{
  "episode_number": "247",
  "episode_title": "Architecting Your AI Brain",
  "guest_name": "Nikolas Hulewsky, Elizabeth Knopf",
  "business_name": "",
  "transcript": "﻿Nikolas Hulewsky (00:00.774)\r\nAll right, welcome back to economics. I've got Liz back with me again. And today we are addressing the two biggest pain points in AI right now. One of them being every time you go to a new chat, you got to refamiliarize the chat with who you are, what you're trying to get. You got to give it the context, right? And number two, have you ever like wanted all your Google Docs and your Dropbox and your whatever other files to kind of just be in one place so you could have sort of your AI brain playing in the background? Well, today we're going to talk about how you can architect the data infrastructure necessary.\r\n\r\n\r\nto go and access all those data sources without aggregating them, creating a bunch of duplicate information. So without further ado, Liz, I'm stoked. Please teach me, I'm ready.\r\n\r\n\r\nElizabeth Knopf (00:39.502)\r\nOkay, all right, well, the other day, first let's start off with something Claude came out with. Of course, I was working on this AI brain project so that everyone in the audience can basically build out their own AI brain, personal operating system. And then of course, Claude came out with a new thing called skills. So what are skills? So you may have heard of agents.\r\n\r\n\r\nAnd again, just to refresh what agents are, that's basically being able to do tasks for you. They have some autonomy, they have memory, they have context, and they're able to access third-party tools to do things. So think of them as your employees and they're doing tasks. Then they came out with this thing called skills, because agents is actually a little bit fusing and sort of how do you make them, how do you build them, and people were just sort of wondering how to do that. And agents were really only\r\n\r\n\r\nto be built in cloud code, but on the browser or desktop, they weren't really accessible. And so what cloud did or Anthropic did was basically build out a way to simplify agents into something called skills. And so this is like for very simplistic tasks, which I would almost equate to the instructions and file examples that you provide in a cloud project. It's very simple.\r\n\r\n\r\nNikolas Hulewsky (02:03.55)\r\nSo this is where Liam Neeson would come over and say, I have a very particular set of skills. You're listing out very particular things that this thing is doing.\r\n\r\n\r\nElizabeth Knopf (02:13.524)\r\nExactly. So like, for example, just to give a contrast between what an agent would be versus a skill. Like a skill might be write this newsletter and you'll have an example newsletter, you'll have instructions and we'll even go through what a skill file looks like and it'll be much clearer versus an agent is like your marketing agent that might have multiple skills and not just the newsletter, but they can do posts on social media and they can do other things.\r\n\r\n\r\nNikolas Hulewsky (02:41.652)\r\nSo how is this different than projects? Because projects, give custom instructions, give context documents, and then that's kind of how I use projects right now. Like, skills sounds the same to me.\r\n\r\n\r\nElizabeth Knopf (02:43.35)\r\nAnd so.\r\n\r\n\r\nIt's not.\r\n\r\n\r\nElizabeth Knopf (02:54.602)\r\nIt is very, very much similar in the sense that it is now accessible to anything. So you can do it once versus like projects that's really contained to that project versus a skill is now accessible to essentially like your cloud, your desktop and in cloud code.\r\n\r\n\r\nNikolas Hulewsky (03:07.572)\r\nNikolas Hulewsky (03:15.39)\r\nSo like in any chat, could, you know, backslash, I don't know what access is it, but be like, hey, I need you to be my sales agent. And it all of a sudden has all, just draws on all that instead of you having to go to that particular project. okay.\r\n\r\n\r\nElizabeth Knopf (03:26.612)\r\nExactly. That's exactly right. Yeah. So that's, you can sort of, would say that's the simplistic way. Like there are a little bit more capabilities that I'm sort of just discovering and learning. Like this came out only a couple of days, but like that's essentially what it does. And so I've just found it already pretty useful rather than again, having to figure out what project and then change the instructions or context or then, you know, having a million different.\r\n\r\n\r\nprojects that proliferate and then have to organize them and figure out what did I name it, all of that fun stuff.\r\n\r\n\r\nNikolas Hulewsky (04:00.006)\r\nWell, I'm a simple man. So I'm sorry, I'm eating this burrito and it's disgusting. I'm gonna tell Mohammed to edit this part out, but you wanna share your screen?\r\n\r\n\r\nElizabeth Knopf (04:07.79)\r\nYeah, let me pop it up.\r\n\r\n\r\nNikolas Hulewsky (04:21.748)\r\nOkay, so you're actually gonna share with us how you create a skill. I'm assuming it's pretty similar just to creating a project.\r\n\r\n\r\nElizabeth Knopf (04:27.534)\r\nsort of, it's just, it's, you it's easy.\r\n\r\n\r\nNikolas Hulewsky (04:36.446)\r\nYou know, that's really interesting the way that Claude is doing this. It's almost like I instantaneously now understand agents. Where like, okay, it's a project that you made, but that project is restricted to that folder that you've created. Whereas the skill is the same as a project, but now I can access it in any project that I'm in when I need its expertise instead of having to go to that particular project.\r\n\r\n\r\nElizabeth Knopf (04:44.994)\r\nYeah, exactly.\r\n\r\n\r\nElizabeth Knopf (05:02.924)\r\njust\r\n\r\n\r\nElizabeth Knopf (05:10.702)\r\nOkay, so first let me show you if you need documentation, because their documentation is pretty good. You want to go to basically their documentation section under agent skills, they'll have an overview. And so if you want to read about it, it sort of gives like info and they also have access to like quick start tutorials, skills cookbooks. And we'll actually go through some of the ones that they've already like.\r\n\r\n\r\npreloaded in so that you're aware and then we'll actually go ahead and we can build out a skill. Yep. All right. So how do you first access to build it? So if you are in just the browser, all you need to do is go down to your settings, which you click where your name is, then you go to settings and then you go and see this little... Don't want to the money. mean, it's... Yeah.\r\n\r\n\r\nNikolas Hulewsky (05:58.029)\r\nMax Plan, okay. Didn't have to flex that hard. Just kidding.\r\n\r\n\r\nNo, I'm Max. I'm a Max. I'm a Max plan to don't worry.\r\n\r\n\r\nElizabeth Knopf (06:05.614)\r\nYou're taking my money. I'm not getting any back. Capabilities. And so then you're going to see this section where there's artifacts, AI powered artifacts, which is I guess how they're like they're calling that a skill now or capability. You memory on, experimental, and then then you have skills. And so you're going to have in this one I created. So we'll go in and I'll explain what that is in a moment. But you're going to preload have preloaded\r\n\r\n\r\nMost of these, think most of these I hadn't built yet. So you'll be able to turn them on or off. So just like to run through a couple of quick examples of what they provided. So brand guidelines, pretty straightforward. And let's actually see, I can pull up. If you wanna see what they look like or like what these documents look like, you can reference them and they have the links again in the cloud docs. So if you wanna see their cookbooks, you'll be able to go there and then.\r\n\r\n\r\nbe able to see what's under the hood of these because they also have this little skill that's a skill creator. So we can basically use one of the skills to create a skill, which is pretty cool.\r\n\r\n\r\nNikolas Hulewsky (07:15.06)\r\nOkay, so I just went in to Claude and there's skills and it says preview and I click upload skill and it's telling me to drag and drop a skill. Okay.\r\n\r\n\r\nElizabeth Knopf (07:24.92)\r\nYes, so we do have to create a file and you'll unfortunately you can't just like have it automatically load in from when you create it, but we'll go ahead and do it together and it's just, you know, saving it to your desktop and then uploading it. So before we actually go ahead and create a file, I just want people to see like what the files look like and we can just sort of, for example, go ahead.\r\n\r\n\r\nNikolas Hulewsky (07:47.412)\r\nAnd I'm sorry, this is a stupid question. You were just in GitHub? Like how did you get access to those, to that?\r\n\r\n\r\nElizabeth Knopf (07:51.906)\r\nYes. So if you go to the agent skills on their documentation page, there's a link in here and the link is called.\r\n\r\n\r\nNikolas Hulewsky (08:08.478)\r\nYou know, over the last week, I've gotten really upset with Claude Anthropic and it's things like this, like their customer service is, why do they not just have a link in the settings and the capabilities that you're trying to turn on? Be like, click here and you can go and see where all the different skills are. Instead, go to this freaking huge document and find the link.\r\n\r\n\r\nElizabeth Knopf (08:26.818)\r\nYeah, they... Right. I know. But then we won't have the opportunity to arbitrage the information by showing people stuff. Okay, so it's Skills Cookbook. And again, I know GitHub is scary, but it's literally just a file folder or a place to put your files. That's repository repo. That's what it is. So don't be scared.\r\n\r\n\r\nNikolas Hulewsky (08:34.42)\r\nThis is true. This is true. Thank you, Liz. Thank you. Glass half full.\r\n\r\n\r\nElizabeth Knopf (08:53.262)\r\nSo in the skills here, they have a bunch of examples. And so we'll do, I think it's in custom, no, of course not. Okay.\r\n\r\n\r\nNikolas Hulewsky (09:03.756)\r\nYou know, this is just an interesting question. Could you build a skin or a wrapper to make it not look scary like GitHub that people can just like, click through the skills.\r\n\r\n\r\nElizabeth Knopf (09:07.992)\r\nYes. Yeah, I did that for any end. Cause like, hate the UI and there were weird, like again, filtering sorting, like simple UI things that should be solved for. But yeah, like I, I, I, I'm surprised like no one has made a better search engine for GitHub or just something that's for non-technical people to access GitHub because literally in\r\n\r\n\r\nNikolas Hulewsky (09:16.532)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (09:22.398)\r\nYeah.\r\n\r\n\r\nElizabeth Knopf (09:35.722)\r\nIf we get to it later in the video, one of the steps of my process is to go to GitHub and to look like, has someone built this already so I don't have to recreate the wheel? Or can I get inspiration for things that they've done? But again, it's sort of scary to just navigate this and then figure out, okay, maybe they have okay documentation, but what does this look like? How do I load the thing? It's very scary. So I think that's a great idea. Yeah.\r\n\r\n\r\nNikolas Hulewsky (09:56.232)\r\nRight, right.\r\n\r\n\r\nWow. That would be, and like just, just broadly speaking, how do you know whether or not an agent that somebody else has built is good? Like, how do you know that has all the components necessary for it to function well and for it to execute on the tasks that you want it to execute on? But like, that's, there's a skin, there's a wrapper. That'd be a great wrapper.\r\n\r\n\r\nElizabeth Knopf (10:16.814)\r\nWell, actually, now that you've mentioned it, SlideTangent that we'll talk about later in the video as well, plugins. So they have now made agents or groups of agents or a workflow accessible because what was happening was that people were building these agents. They were building sort of in-cloud code, their different workflows, and even like people have reached out about the personal operating system. Now you can actually create a plugin.\r\n\r\n\r\nwhich enables them to be more shareable and accessible and they have a plugin marketplace. So again, the nomenclature of all this stuff is like, I don't remember what this is called, how is this different than that? But you can just think of a plugin as like something you've built that's agents or your workflow that's now shareable. And I think they're getting to the point where you might be able to monetize it, but right now it's just.\r\n\r\n\r\nNikolas Hulewsky (11:02.76)\r\nWell, OpenAI did a good job with this with their GPT store. Again, I don't know why Claude, the artifacts was kind of a step in that direction. This seems like they should have something for it. anyways, back to the main assignment.\r\n\r\n\r\nElizabeth Knopf (11:07.541)\r\nExactly.\r\n\r\n\r\nElizabeth Knopf (11:15.65)\r\nYes. Back to the main assignment. So of course, hold on. I just had this here.\r\n\r\n\r\nElizabeth Knopf (11:29.792)\r\nand I just had a bunch of the example skills. me see. Okay, here we go. no. Okay. Okay. So, okay. So here we go. So it's, if you go to github.com slash anthropics slash skills is where you can go directly to see basically what is under the hood of, sorry. Okay. Of this page of where it says capability.\r\n\r\n\r\nNikolas Hulewsky (11:33.234)\r\nYou're fine, we can edit this.\r\n\r\n\r\nElizabeth Knopf (11:52.43)\r\nSo if you go back over here, we'll just go into the brand guidelines since I think that's gonna be the most obvious and easy to understand. So basically it is just a file. This is just to say like, yes, it's usable by everybody, whatever, don't need to worry about that. Skill.md is the file. So as we open this, you can preview, this is literally what's in the file. And it basically provides the name, description, license.\r\n\r\n\r\nthe Anthropic Brand styling and overview. So literally it is just a document with information. So it gives guidelines on colors. So anyone that's ever had to basically deal with maintaining brand guidelines or brand, like it's a pretty simplistic document, nothing wild here. But literally now what you can do is you load that in here and get those guidelines. So what I did just to sort of\r\n\r\n\r\ncreate a custom version of this was this my social brand. I took, whoops, where did it go?\r\n\r\n\r\nElizabeth Knopf (13:02.284)\r\nI thought I had this loaded, of course.\r\n\r\n\r\nElizabeth Knopf (13:20.76)\r\nHold on, sorry. Good, we're going to be able to edit this out.\r\n\r\n\r\nNikolas Hulewsky (13:30.728)\r\nYou're fine. I've just been eating.\r\n\r\n\r\nNikolas Hulewsky (13:35.412)\r\nStuff in my big fat face.\r\n\r\n\r\nWhile you're looking for that, do you think you could have like five of these just ready to go for somebody? I'm gonna say somebody's just overwhelmed with GitHub. And it's like, hey, if you don't wanna go to GitHub, I've got 10 of these that you can just go and download. Okay. I think that would be, I'll say that.\r\n\r\n\r\nElizabeth Knopf (13:52.92)\r\nMm-hmm.\r\n\r\n\r\nElizabeth Knopf (13:56.61)\r\nYeah, totally. Yeah, that's like easy. Okay, let me do what is.\r\n\r\n\r\nNikolas Hulewsky (14:13.896)\r\nYou can't just click into it and see what you paste it in.\r\n\r\n\r\nElizabeth Knopf (14:15.754)\r\nNo, I'm like, that's what I'm looking for is which chat I just did that had this. No.\r\n\r\n\r\nNikolas Hulewsky (14:18.996)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (14:23.284)\r\nHuh?\r\n\r\n\r\nElizabeth Knopf (14:27.71)\r\nthought it was this because like it's not here\r\n\r\n\r\nElizabeth Knopf (14:44.837)\r\nskill\r\n\r\n\r\nElizabeth Knopf (15:08.686)\r\nSorry. wait, is this it?\r\n\r\n\r\nElizabeth Knopf (15:18.84)\r\nthink this is it actually.\r\n\r\n\r\nOkay, it just made it pretty. Okay.\r\n\r\n\r\nNikolas Hulewsky (15:30.452)\r\nThat's it.\r\n\r\n\r\nElizabeth Knopf (15:33.679)\r\nNow, it's in the dock.\r\n\r\n\r\nNikolas Hulewsky (15:38.996)\r\nIt might not be exactly it, but is it close enough?\r\n\r\n\r\nElizabeth Knopf (15:41.878)\r\nYeah, okay, we'll just do this real quick because I'll recreate it.\r\n\r\n\r\nElizabeth Knopf (15:49.208)\r\nOkay. Okay. So basically what I did was I took a carousel that I had.\r\n\r\n\r\nElizabeth Knopf (16:01.1)\r\nI took an image from Canva that I had and I wanted it to basically create brand guidelines based on this image. And so what I did was, we're gonna do this together live, is uploaded the screenshot.\r\n\r\n\r\nElizabeth Knopf (16:21.844)\r\nThen I took the\r\n\r\n\r\nAnd then I said, use the skill creator capability. So that's referencing again, the capability. Yes, it's representing referencing itself. I'm sorry. I'm like not organized here. Okay.\r\n\r\n\r\nNikolas Hulewsky (16:37.008)\r\nItself.\r\n\r\n\r\nElizabeth Knopf (16:48.61)\r\nthe skill creator capability located in the capabilities section.\r\n\r\n\r\nand use the skill creator capability and create a skill called social brand.\r\n\r\n\r\nAll right, so.\r\n\r\n\r\nNikolas Hulewsky (17:10.834)\r\nso you created a skill to help you create other skills.\r\n\r\n\r\nElizabeth Knopf (17:14.782)\r\nNo, so they default and give this to you already. So literally you can go in like when you vote, actually, this is a question for you. Do you see skill creator? no. okay. That's why. All right. So yeah, so, okay. So I had done this a different, yeah.\r\n\r\n\r\nNikolas Hulewsky (17:23.752)\r\nNo, no, have, there's nothing. It just says upload skill.\r\n\r\n\r\nNikolas Hulewsky (17:35.252)\r\nBut there's a skill for creating skills.\r\n\r\n\r\nElizabeth Knopf (17:38.86)\r\nYes, exactly. So if you literally go into the Anthropic or we can probably leave a link in the description so that people can just download these folders and all you literally will have to do is upload a folder so you don't have to even go to GitHub. And what you'll do is you'll go to this, we'll have a skill and it's called skill creator. And this will literally then help you create other skills so that you don't have to figure out.\r\n\r\n\r\nOh, here's the format of the file. Like again, you just use AI to create the file format for you. And so then what you'll do is you'll go to upload skill and drag and drop.\r\n\r\n\r\nthe skill creator, the social brand document in here, I already, that's not a zip, but you'll upload the skill in there, okay? So I already have this, so replace the skill that's existing. I'm not gonna do that, because I already have it there. And then it'll literally show up. So just make sure it's a zip folder. It has to be a folder, and it has to have something called skill.md file. You can add examples in there. But again, you can just,\r\n\r\n\r\nNikolas Hulewsky (18:33.011)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (18:51.06)\r\nWell, GitHub's scary for somebody like me, so what we're going to do is have a link where Liz is just going to have an easy file set up where there's like whatever, 10 basic folders that you can start with to start building some skills.\r\n\r\n\r\nElizabeth Knopf (19:03.31)\r\nYep, and just upload one by one and name them whatever you want. And then you can preview them, run them. And then if you don't like what you see, say, hey, can you update it and make an adjustment? So like I took this image and I said for brand guidelines, which we'll have in there as well, and just say like update the brand guidelines to be like this image and it will just do it for you.\r\n\r\n\r\nAnd so once you do that, then I, for UI, for instance, I had just to show like an example of the contrast. This is just like the out of the box UI that Claude does, whether it's on Claude code or Claude, this is literally in Claude code, but you always get this weird gradient of purples or blues or like just tasteless UI that's always ugly. Exactly.\r\n\r\n\r\nNikolas Hulewsky (19:48.446)\r\nYeah.\r\n\r\n\r\nmassive buttons.\r\n\r\n\r\nElizabeth Knopf (19:54.134)\r\nAnd so I ended up applying my brand guidelines and got something a little bit better. You can't really see, but there's that like dotted background a little bit. So yeah, so it looks better. I'm not a designer, so feel free to say how bad this is and all of that. But again, it just makes it like more aligned with what you're doing versus again, having to constantly reference that.\r\n\r\n\r\nNikolas Hulewsky (20:01.332)\r\nCool. Yeah.\r\n\r\n\r\nNikolas Hulewsky (20:16.756)\r\nAnd so when I'm in a chat, how do I access a skill? I just say, use XYZ skill, or do I like ampersand, backslash?\r\n\r\n\r\nElizabeth Knopf (20:21.358)\r\nYep. Nope. Literally just say use the skill and you name the file. So they don't have any shortcuts. I don't think yet. Nope. No shortcuts.\r\n\r\n\r\nNikolas Hulewsky (20:28.564)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (20:32.115)\r\nDude, this is incredible. So like I have folders set up for analyzing deals. I have folders set up for different projects that I have. If I'm in the middle of something, I'd be like, hey, use my deal analyzer to tell me whether or not this is a good deal. I don't have to like click out of that, go to a folder that I've set up a custom GPT. It's just there. I love that. That's incredible.\r\n\r\n\r\nElizabeth Knopf (20:53.25)\r\nYep, exactly, exactly. And if you have the skill creator, it's like, let's say you've aggregated a bunch of done a cool analysis rather than like what I do is always like say, okay, now create a framework or again, add this back to my documents, my Google Drive and then add it to a project folder in cloud projects. And so it's like you're managing all of this stuff. Now you can just have it as a skill and then reference it. So anytime just think of it like a framework or a template that you're using that sort of a skill.\r\n\r\n\r\nNikolas Hulewsky (21:22.548)\r\nOkay, just like knee jerk, when would I use skills and when would I use projects now?\r\n\r\n\r\nElizabeth Knopf (21:28.03)\r\nProjects would say is like isolated. So you could have multiple skills referencing projects like projects I would say is more when it's stagnant information versus like a skill like you might be again brand guidelines apply to more than like maybe you're doing a newsletter and you need to apply brand guidelines. So maybe you've used all your context in your instructions for\r\n\r\n\r\nthe actual examples or like you're putting in some new news story and it's like, okay, now I have to add in the brand guidelines and it's like, you have the guidelines plus the content plus something. So now you can reference the skill brand guidelines to then visualize the content that you have in the folder. So it's like being able to say like, I have my copywriter who's doing the copy, now that's in the project folder and they can really focus on that. And then now I can bring in the designer to do that rather than having that within.\r\n\r\n\r\nthe project folder. don't know if that's good.\r\n\r\n\r\nNikolas Hulewsky (22:20.136)\r\nThe skill itself doesn't have a ton of context. So if I create a project, for example, I've got instructions. This is how I structure my projects. Instructions, obviously, I have a context doc that is like, hey, here's how I want you to act. And then I have a bunch of documents of examples of how I want them to act. So for the deal analyzer, for example, the context doc would be like, hey, you're whatever.\r\n\r\n\r\nElizabeth Knopf (22:27.118)\r\nMm-hmm.\r\n\r\n\r\nElizabeth Knopf (22:33.934)\r\nRight. Yep.\r\n\r\n\r\nElizabeth Knopf (22:41.07)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (22:45.832)\r\nthis analyst or you have this much experience and this is these are the multiple ranges that I like. This is how I like EBITDA to be, etc. Here are examples of good businesses that I've seen and then then I have a bunch of context documents that I can go and pull the skills not doing that like it doesn't have all the other context documents. It's just kind of that either instruction or context document.\r\n\r\n\r\nElizabeth Knopf (22:51.554)\r\nExactly.\r\n\r\n\r\nElizabeth Knopf (23:04.574)\r\nExactly. You can think of it like that. Like I would say from what you just shared, like all the dynamic stuff that you might have new deals that you're populating in there and new information. If you have, want it structured and formatted that this certain way, like you're probably going to have that on a bunch of different projects that are maybe similar. And so you can do that. again, it's a folder, like even if you have yet one deal in one project, you're probably not having multiple deals in the same project.\r\n\r\n\r\nNikolas Hulewsky (23:06.76)\r\nOkay.\r\n\r\n\r\nElizabeth Knopf (23:30.22)\r\nAnd so you might have different folders. so rather than again, take up that context by saying, I like my formatting this way, you can sort of invoke the skill into each of those with then having, without having to use up that context with the skill or that.\r\n\r\n\r\nNikolas Hulewsky (23:46.084)\r\nor you could have it be like, let's say that you want, your text files in a certain format for when you're building out your databases. Or if you want, a certain Excel spreadsheet populated a certain way, you could have, Hey, this is the skill. It's the data extractor skill or whatever. And then it automatically knows, okay, this is what I'm looking for in this data document. I'm going to go ahead and help it repopulate this way. So yeah, it's focusing on skills or tasks.\r\n\r\n\r\nElizabeth Knopf (24:13.368)\r\nExactly.\r\n\r\n\r\nNikolas Hulewsky (24:16.06)\r\nInteresting. Okay.\r\n\r\n\r\nElizabeth Knopf (24:16.578)\r\nYeah. Or like even here's an example. Like you just had a meeting and again from the meeting you're going to need a summary. You're going to need to email that out. You probably have a format in which you do that email. So you could say you have an email formatting skill. You have a meeting notes skill again to keep everything standardized. And so you can say you know here's the context from the meeting that just came into my Google Doc. Here's some other information about the\r\n\r\n\r\nproject or things weren't related, that's all in the project, Cloud project folder. And then you can say, here's, you know, use the skill for my email formatter to create an email, use the skill for doing meeting notes to create the meeting notes, so on and so forth. So again, you don't have to constantly be adding that in since it's like universal to every time.\r\n\r\n\r\nNikolas Hulewsky (25:04.904)\r\nVery cool. Okay. Can we talk a few minutes about the second brain? Okay.\r\n\r\n\r\nElizabeth Knopf (25:09.558)\r\nYeah. Okay. So, the reason also I really like skills is because, it is going to be accessible to Claude code. It's going to be like, and also the API. So just, one more note on it. I had actually initially added the skills into the API and that's why they were showing up for me into actually.\r\n\r\n\r\nYes, okay. So I did add, wait, no. Okay, nevermind, scratch that. Mohammed, scratch that.\r\n\r\n\r\nNikolas Hulewsky (25:40.336)\r\nOkay, can I tee up? Can I tee up the second brain? All right. I think that anybody who has messed with AI even a little bit has gotten to the point where they said, man, it'd be nice if they just remembered if there's persistent memory and chat GPT does a pretty good job of having persistent memory across chats. However, you've still got to input information into chat GPT in order for to have that persistent memory. And there are some ways where you can tie in\r\n\r\n\r\nElizabeth Knopf (25:44.78)\r\nGo for it, let me pull up the file.\r\n\r\n\r\nNikolas Hulewsky (26:09.598)\r\nyour Google Drive, you can tie in Dropbox and these other file saving formats. However, there you haven't exactly built your own LLM, right? It's not it's not like it's, this is my second brain. It knows everything about me. It knows my whole schedule knows. And it's simple. And at least that's what I thought. I don't I didn't think there was a you know, a way to do it or even a simple way to do it. And Liz and I were talking last week or the week before and she started showing me and talking to me about her second brain and sort of the way that she's got\r\n\r\n\r\nthe data organized in order for it to populate. Because that's kind of the hardest thing, is in order for these models to know how you would think or act or to know about your last week or, what items do I have coming up? What did I get done last week? What are the most important projects, et cetera? It's got to have access to your calendar. It's got to have access to your Google Drive. And it's got to have access to your Gmail. And it's got to have access to everything else that you're kind of working in on a daily basis. And so what we're going to do right now is kind of show you how do you access those things without necessarily\r\n\r\n\r\nbuilding a brand new database and a whole new LLM.\r\n\r\n\r\nElizabeth Knopf (27:12.664)\r\nAbsolutely. So the problem I was trying to solve for is I have amassed and hoarded a bunch of files and digital information in my Google workspace. And probably like many of you, whether you're using Dropbox box, it doesn't matter. You probably accumulated stuff and you have it in these folders. You've already set up a system and now you're like, my gosh, now there's this LLM that I would love it to just go through and figure things out.\r\n\r\n\r\nNikolas Hulewsky (27:28.788)\r\nyou\r\n\r\n\r\nElizabeth Knopf (27:38.282)\r\nNow, of course, in Google, they've started to iterate this within the Google workflow and Microsoft within their suite, where they can access things within those documents. But then if you want to go and build tools, whether it's in N8n, if it's Cloud Code or really any system, Codex, whatever, you have to then figure out how do I utilize that set of documents for...\r\n\r\n\r\nreference, do I have to put this into this thing called a vector database, which is specialized for LLM so that they make all these connections and understand each other. And so do I have to now create a whole new database and then have two and then start proliferating and it costs and like all of these new challenges. And so the things I wanted to try to solve for as like step one was how do I take my Google drive and just make it accessible for cloud code and for all of my projects.\r\n\r\n\r\nNikolas Hulewsky (28:16.989)\r\nYeah.\r\n\r\n\r\nElizabeth Knopf (28:30.956)\r\nso that I don't have to duplicate it and I can get at least a ton of the, like, you know, I won't have it as a vector database, meaning it's not gonna be perfectly accessible as you would if you put it into an actual vector database that is creating all these cool connections. But actually I was able to create good enough so that I can reference documents much more easily, pull them in and then incorporate things in for my workflow because that sort of the starting point is my database.\r\n\r\n\r\nSo any questions before we dive in on how to do that? And it's actually not that hard or not as hard as you think.\r\n\r\n\r\nNikolas Hulewsky (29:07.988)\r\nNo, I think if you're at the point where you're like about to tune out because you think like too complicated, I would just stop being stupid. And I would listen to the rest of this because in order for these models to actually provide the most value in your life, they've got to have access to all the data that you have. If you want to give it to them, right? If you don't want to give it to them, whatever, but they've got to have access to the data. And just because the UI isn't pretty, doesn't solve for the, like the UI being pretty doesn't solve for the problem that eventually you're going to have to organize your data. Like it's just going to take time to figure out.\r\n\r\n\r\nHow do you map all these things together? So either do it now, or you're do it later. I would do it now so that when the cool UI comes out, it's already done and you can actually take advantage of it right away while other people are trying to figure it out. So shut up, sit down, watch the rest of this, because I think this is insanely valuable. Keep going.\r\n\r\n\r\nElizabeth Knopf (29:52.364)\r\nYeah. Okay. So literally, I'm going to start from the beginning. So just again, give people a quick refresher on like how to even access this. So you're going to open this terminal. If you don't know where this is, like again, search on your desktop for it. Terminal will come up and then all you got to do, I'm going to just get to my place where I have my folders. And I would just say like, know where you want to put your stuff in your local files because I've spoken to people who\r\n\r\n\r\nwill just put Claude right away and then they don't realize that all the files being created are just sort of like all over the place. So you sort of want to think through a file structure. And so as you can see, I'll just pull up my file structure so people can see where I'm going.\r\n\r\n\r\nNikolas Hulewsky (30:35.7)\r\nI actually had Claude help me with that. was like, files are a mess. Can you make it organized? I was like, sure. And we like worked through it. It was cool.\r\n\r\n\r\nElizabeth Knopf (30:42.923)\r\nExactly. So CD that just says change directory to document slash Claude code files. I probably should shorten that name. And now I'm going to invoke Claude. All I've typed in was Claude. And if you don't know how to install Claude, we had an earlier video a couple episodes ago. You can go check out to see how to get that set up. Okay. So now Claude is running as you can see this little guy. And so I'm going to again, switch over.\r\n\r\n\r\nto a different folder. again, just so you guys can see on the screen what files I have here. I have systems, which is really where all my agents are.\r\n\r\n\r\nNikolas Hulewsky (31:18.578)\r\nAll I see right now is your local host 9000. Unless you wanted to show something else.\r\n\r\n\r\nElizabeth Knopf (31:21.824)\r\nyeah, I've been doing other things, sorry. No, thank you for calling that out. Okay.\r\n\r\n\r\nNikolas Hulewsky (31:26.996)\r\nSorry.\r\n\r\n\r\nNikolas Hulewsky (31:32.222)\r\nWe'll always call you out.\r\n\r\n\r\nElizabeth Knopf (31:56.928)\r\nscreen share. Okay. All right, cool. you have, okay. So that's going to be, this is sort of a UI I created again, which we just showed that will basically show all the files I index. So how did we get there? Okay. So again, went through a couple steps to get to this little terminal that's black, scary. And just so you know, again, where we're located within my file structure. So we're in documents, cloud code files.\r\n\r\n\r\nAnd in here, the way I organized this was basically, oh wait, now are you seeing? Okay, okay, I'm seeing it, okay. Let me make this, zoom this in. Okay, so we have systems, which is basically where all my agents are located. I have active projects that I have going on here. So as you can see, I have a ton of projects going, which I'm going to finish at some point.\r\n\r\n\r\nNikolas Hulewsky (32:33.012)\r\nI'm seeing it. Yeah.\r\n\r\n\r\nNikolas Hulewsky (32:48.702)\r\nDang. Holy crap.\r\n\r\n\r\nElizabeth Knopf (32:52.738)\r\nAnd then I have like archive of stuff like I no longer need and staging. This is like when things I'm just sort of testing or getting ready for production. I have my personal OS systems, which these are just documents that are orchestrating all of these lower file systems. And again, I don't want you to get overwhelmed by what I'm saying. This is just like create an organization of some sort. You don't have to have it like this. You just need to have some way to think through how you're organizing stuff.\r\n\r\n\r\nAnd yeah.\r\n\r\n\r\nNikolas Hulewsky (33:23.186)\r\nYeah, I would say don't even get overwhelmed by this because I was you just get in and start messing around with the terminal. I'm just now getting to the point after like two months where I'm where I'm understanding this file structure. I didn't get it for idea like dot MD dot txt dot J. Like I just I don't know. So it's cool to show like where you're going to get to within a couple of months. But yeah, if you're listening or watching just start.\r\n\r\n\r\nmessing around with it and come back and watch this video again and you'll be like, that's what Liz was talking.\r\n\r\n\r\nElizabeth Knopf (33:56.13)\r\nYeah. Okay. So right now I'm going to, as if I had never built the Google drive connector, I want you guys to, I'm going to go through those steps. And so, and then I'll show at the end what it looks like because there are a couple of things that I'll probably skip through. So it doesn't take so much time. Okay. So if I were you coming in here and I wanted to connect to my Google drive, I'd say first switch to planning.\r\n\r\n\r\nOkay, so switch to planning means it's gonna help you plan out before it starts just doing things on your behalf. So give it a second and now it says it's ready to help plan. And say, I want to make my Google Drive and in the future other existing data sources accessible for cloud code and various projects. How do I do so?\r\n\r\n\r\nSo literally you're just asking Claude, what do you do if you don't know what to do? If you already know, then you can give it that context. But I'm just again going from like, I've never done this before. What is the best way to do it? It's going to think that through and give you some feedback. And then I'll just quickly run through what I did depending upon what it actually provides here.\r\n\r\n\r\nNikolas Hulewsky (35:15.004)\r\nYeah, that's the cool thing about planning is that you have access to the LLM and it'll be like, let me think through that. That's an interesting question. Here's what I think you should do.\r\n\r\n\r\nElizabeth Knopf (35:21.902)\r\nAnd it often pops up with these, like, do you want to proceed? I rarely say no. And then...\r\n\r\n\r\ngoing to want to access GitHub.\r\n\r\n\r\nNikolas Hulewsky (35:45.364)\r\nYeah, I really actually know as well.\r\n\r\n\r\nElizabeth Knopf (35:47.6)\r\nAll right, I'm gonna see if I could pop this over.\r\n\r\n\r\nElizabeth Knopf (36:04.686)\r\nOkay, so actually I think this is, so this is, I have a bunch of things connected to this, so what this is actually doing is going ahead and automatically setting it up for me, because it, I think I had said yes ahead and it skipped through plan mode. So this is probably not gonna be beginner ready. So we might have to scratch this part from the video and I'm trying to think of a better starting point. Let me just real quick have it.\r\n\r\n\r\nNikolas Hulewsky (36:18.182)\r\ndang.\r\n\r\n\r\nElizabeth Knopf (36:33.836)\r\nsummarize what I did on my other term. Okay, sorry. we're to wrap it up.\r\n\r\n\r\nNikolas Hulewsky (36:36.222)\r\nYeah, do that. Yeah, say something, say, no, no, no, say something like, hey, if I was a beginner and I was trying or I was trying to teach a beginner how to do what I just did step by step, how would I do that?\r\n\r\n\r\nElizabeth Knopf (36:48.128)\r\nElizabeth Knopf (37:17.142)\r\nI think I'm prepared and then I'm not.\r\n\r\n\r\nNikolas Hulewsky (37:21.8)\r\nOnce it's edited, know, no one will know.\r\n\r\n\r\nElizabeth Knopf (37:23.661)\r\nYeah.\r\n\r\n\r\nElizabeth Knopf (37:55.67)\r\nOkay, all right, so basically what it provided as a recommendation of how to get this set up. So I do have some extra stuff on my computer. So it did pull in probably some steps that you won't need to do related to MCPs, disregard that. But essentially what you can do is connect your Google authorization credentials. This is scary. I'll probably do a second video on this that will link in the description.\r\n\r\n\r\nSo we can dive into the nitty gritty of that. It's again, not, it's just step by step copy and pasting, pushing buttons. But if you do, are able to connect your Google cloud through their workspace, then you have access to all of your Google stuff and you need to do it once. And then you have the worlds to play with when it comes to all of your documents.\r\n\r\n\r\nAnd so once you install Google Drive and access it through a couple different methods, there's just, again, the one, okay, sorry, this sucks, this sucks, sorry. No, I just, I'm like, as I'm talking, I'm like, I'm not explaining this well. And I feel like, okay, let me, yeah, go ahead.\r\n\r\n\r\nNikolas Hulewsky (38:58.59)\r\nWhy does suck?\r\n\r\n\r\nNikolas Hulewsky (39:05.042)\r\nNo, can I try? And then I think we just, let's just show what it looks like.\r\n\r\n\r\nElizabeth Knopf (39:09.612)\r\nOkay, I mean, the thing is, it's not much to show. It's just, actually, you what we'll do is we'll basically use Claude and talk to it like I'm talking to my drive. Yeah, let's do that. That'll be the best.\r\n\r\n\r\nNikolas Hulewsky (39:21.268)\r\nOkay, keep that up for one second. If I could. So there's a lot in here and what I would do, I'd love for you to like print this out or like print this out. my gosh, create a doc for this. But these are all the steps that you have to take in order to give Claude access to your Google Drive. And you can ask Claude, even if you get to a place here where it's like, well, what's, I don't even know. How do I configure my MCP?\r\n\r\n\r\nJust ask it, how do I do that? And it will walk you through how to do each one of these things. But once it's set up and we'll have a doc linked in here where you can actually like follow the step by step. Once it's set up, now we can actually use Claude, right? Like now we actually have Claude and Claude can go and access those data sources in a way that kind of turns it into your second brain.\r\n\r\n\r\nElizabeth Knopf (40:11.892)\r\nExactly. Okay. So now I'm going to show you once you've set up your Google Drive to cloud code, what you can do with it, because that's actually the purpose of it. It's like great that you've connected it and we can do a separate deep dive video that's nitty gritty on that. So.\r\n\r\n\r\nElizabeth Knopf (41:45.55)\r\nSo I just pulled up basically where the folder is for where I created this, what I'm calling a Google indexer. And so now it has access to my Google Drive, which has thousands of documents. So what I'm going to do now is as if I was in the LLM itself and say, pull up a document around a meeting and summarize a meeting for me. Or we could\r\n\r\n\r\nI don't know if there's any other ideas you have, but that I think would be, yeah.\r\n\r\n\r\nNikolas Hulewsky (42:15.156)\r\nCould you ask it like to do analysis? Hey, tell me what emails or like what to do's I have pending on my plate or like what are the most important things I need to get done over the next 60 days? Or is it?\r\n\r\n\r\nElizabeth Knopf (42:30.06)\r\nOkay, yeah, so right now I have it just to my right now set up for my Google Docs, the folder, so it's not actually it might have access to my Gmail. Yeah, for now, let's just focus on. Yeah, let's just focus on the box.\r\n\r\n\r\nNikolas Hulewsky (42:36.567)\r\nokay.\r\n\r\n\r\nNikolas Hulewsky (42:40.84)\r\nNo, that's fine. Yeah, so, hey, find a meeting and just ask it, hey, based on this last meeting, what are follow-up items that I need to have?\r\n\r\n\r\nElizabeth Knopf (42:48.81)\r\nOkay, on, first we'll have it try to find, find a meeting I recently had about,\r\n\r\n\r\nElizabeth Knopf (43:02.906)\r\nAI automation and provide a summary and to do items as a result of that meeting within the last, we'll give it three months. Okay, so name the meeting and change the participants.\r\n\r\n\r\nGames to person A and person B, just because I don't know what meeting it's going to pull up. And just so for people that know where this is getting the meeting data and info, I have a folder from Google Meetings that automatically records it and then puts it into a folder, because that's just a built-in feature of what Google has right now. And so that's probably what it's accessing. And so let's see what happens.\r\n\r\n\r\nNikolas Hulewsky (44:12.82)\r\nHey, you have a hard stop right now,\r\n\r\n\r\nElizabeth Knopf (44:15.502)\r\nMy meeting starts in 10 minutes, so let me just see.\r\n\r\n\r\nNikolas Hulewsky (44:21.236)\r\nWhy don't we do this? I think I'll just release the skills as a standalone YouTube video and then we could do this again. Like this was a good dry run. Like I can see where it's headed. It's super freaking cool.\r\n\r\n\r\nElizabeth Knopf (44:26.967)\r\nOkay.\r\n\r\n\r\nYeah.\r\n\r\n\r\nElizabeth Knopf (44:33.718)\r\nYeah. Yeah. I'm just trying to think of like the best way to cause like the integration part is going to scare people, like setting up and connecting to the API area, the console. And then this is like useful, but it's not sexy. Like in terms of being able to, I don't know. I don't know if you feel that way. Like for me, I get excited cause I've been trying to like, like I want, like I keep moving my documents. And so from a functionality, like I get it, but I don't think I've communicated lot. Like this is great.\r\n\r\n\r\nNikolas Hulewsky (45:05.716)\r\nWell, that's why we should.",
  "metadata": {
    "duration": "",
    "date": "",
    "platform_source": "Google Drive"
  }
}