{
  "episode_number": "132",
  "episode_title": "How to Turn a HVAC Company into a $5 Million Business with Jack Carr",
  "guest_name": "Jack Carr",
  "business_name": "HVAC and Plumbing Company",
  "transcript": "﻿Nikolas Hulewsky (00:00.726)\r\nAlright Jack, welcome to Nicknomics. Stuck to have you. Here's what I want to do. I want to know right now you're in the sexiest unsexy business. Which are home services and in particular HVACs. Tell me a little bit about your company. How big is it? Top line revenue, number of employees, geographic scope, etc.\r\n\r\n\r\nJack (00:10.235)\r\nWoo.\r\n\r\n\r\nJack (00:24.307)\r\nAwesome. So, I own a HVAC plumbing company in Middle Tennessee. We are slated to do $5-6 million this year. Really excited for that. I'm going to hit probably 20 employees this year. We're at 17 right now. Middle Tennessee, I forget what other questions you asked. You loaded me up. But yeah, sexiest unsexy business, HVAC and plumbing.\r\n\r\n\r\nNikolas Hulewsky (00:44.214)\r\nNo, that's a pshh. Sexy is unsexy. Okay, how long have you been doing this?\r\n\r\n\r\nJack (00:51.577)\r\nI have been only doing this. bought this company in 2022, at kind of the height of the purchasing explosion that we saw on &A. I jumped on the train and I bought a sub $1 million HVAC company two and a years ago.\r\n\r\n\r\nNikolas Hulewsky (01:00.876)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:10.143)\r\nmy gosh, sub $1 million? So you bought a job.\r\n\r\n\r\nJack (01:12.211)\r\nOh, it was painful. Yeah. I will even worse than that. So the I'm like the quintessential this is exactly what you don't want to happen happens type of person. So I'm like, Oh, yeah, I'm gonna buy a company. I'm gonna leave my cushy W two job making multiple $100,000 a year and buy an HVAC company in a state that I don't live in move there.\r\n\r\n\r\nNikolas Hulewsky (01:34.894)\r\nWhoa, whoa, whoa. Okay, whoa, we just like glossed over that. Wait, what were you doing? What were you working?\r\n\r\n\r\nJack (01:39.099)\r\nSo I mean, it's a long story, but I'll keep it really quick for everyone who's heard about me before. I'm sure you've heard the story. But I had a few entrepreneurial moments in my life. I made some businesses. I sold the businesses. One was a agricultural repair company. Sold that. It was kind of a side gig while I was still working at W2 in California. The W2 was ops manager for wineries. So I ran.\r\n\r\n\r\nNikolas Hulewsky (02:03.374)\r\nWhat was the W tier?\r\n\r\n\r\nJack (02:09.235)\r\nnine different wineries, everything that wasn't making the wine or selling the wine we took care of. So my team up to 40 people did all the capital projects and the HVAC. And so there was a little bit of history with HVAC, but not a ton. On the side, I started up in random agricultural repair company, which went around to the wineries that had broken equipment in the fields, fixed them, took money. I exited out of that circa like 2018.\r\n\r\n\r\nNikolas Hulewsky (02:13.262)\r\nMm-hmm. Okay.\r\n\r\n\r\nNikolas Hulewsky (02:20.162)\r\nOkay.\r\n\r\n\r\nJack (02:37.101)\r\nAnd around the same time got really into Bitcoin and started up a Bitcoin mining farm. Yeah. Yeah, in Reno, Nevada.\r\n\r\n\r\nNikolas Hulewsky (02:43.054)\r\nShut up.\r\n\r\n\r\nReno, what was your kilowatt hour cost?\r\n\r\n\r\nJack (02:48.403)\r\nIt was like, I want to say it was seven cents. So it wasn't bad. It wasn't amazing. It wasn't like so I remember looking at like Apple, old Apple orchard facilities in Washington where you could get like three cent power. And I was so excited. Didn't end up pulling the trigger on it. Like I said, it was it was twenty eighteen. I'd already been mining for a while, but I wanted to go big now. And I know I sold the entire operation. We got up to 30 some units mining at any point in time.\r\n\r\n\r\nNikolas Hulewsky (02:50.958)\r\nAll right,\r\n\r\n\r\nNikolas Hulewsky (03:00.641)\r\nYeah, yeah, yeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (03:09.358)\r\nAre you still mining?\r\n\r\n\r\nJack (03:17.511)\r\nWe mined through a decent portion of the downswing of the market. And then when the 2020 boom happened, we sold off everything right before that. Sold off all the equipment, excuse me. we didn't.\r\n\r\n\r\nNikolas Hulewsky (03:32.27)\r\nDude, okay, this happens to me sometimes. Have you ever seen step brothers? You know the scene where they're like in their bunk bed and they're like, do we just become best friends? It was like, yep. So just quickly, my experience was in Home Health and Hospice and I bought a medical billing company was the first company that I bought. So it's like, it wasn't the same, but it was tangential. So it's like similar to you, right? You're running the ops at these wineries and then you go into a space that's\r\n\r\n\r\nJack (03:39.111)\r\nMm-hmm.\r\n\r\n\r\nJack (03:43.207)\r\nYeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (04:00.216)\r\ntangential, right? So you had experience with, let's just say facilities management or maintenance, whatever you want to call it. And then obviously you went into the HVAC space and Chris and I, my business partner, we launched a company selling Bitcoin miners in October of 2021. In the first three months, we did $10 million in revenue. was freaking nuts. And then we've subsequently gone on to lose like $1.5 million over the last three years because mining has been\r\n\r\n\r\nJack (04:17.384)\r\nYep.\r\n\r\n\r\nJack (04:25.659)\r\nYep.\r\n\r\n\r\nNikolas Hulewsky (04:28.952)\r\nTotally unproblematic for people who don't know the way that Bitcoin is produced is through mining and there's like three variables. There's the price, there's the difficulty rate, and then there's the price of electricity that you have, right? So anyways, we've just gotten freaking crushed over the last few years.\r\n\r\n\r\nJack (04:38.291)\r\nMm-hmm.\r\n\r\n\r\nJack (04:42.727)\r\nYeah, so I mean, I started I started with s nine at minor s nine moved to the s 11 series. And then that's when so I saw the same thing that you guys saw is like, hey, the s 11 series was going to get, you know, overtaken, we came into the upswing. And I said, I got to offload all this equipment now to somebody who wants to run it for long term, maybe as cheaper power, who knows. But that's what we did. So we ended up selling most, most of that equipment, we sold the location and we sold\r\n\r\n\r\nNikolas Hulewsky (04:47.528)\r\nmy god\r\n\r\n\r\nNikolas Hulewsky (04:55.63)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (05:03.788)\r\nYep, yep. Good for you though.\r\n\r\n\r\nJack (05:12.795)\r\nyou know, a little bit of Bitcoin at that time. And so after that point, you know, I was pumped, right? I said, I don't need to work at W2 for a little bit. I'm going to retire.\r\n\r\n\r\nNikolas Hulewsky (05:17.901)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (05:21.71)\r\nOkay, you don't have to tell me how much. But like, give me a ballpark. You had like high six figures, low seven figures, eight figures, like where were you sitting? Okay.\r\n\r\n\r\nJack (05:32.787)\r\nNo, I wish eight figures. I wouldn't be here today if it was eight figures, but it was enough to take a couple years off I mean, I've already told you my salary so you guys can can guess that it's a multiple of that a low load single digit multiple of that We bought an RV it was me my wife and my son we said hey, we don't know where we want to live Napa was a beautiful\r\n\r\n\r\nNikolas Hulewsky (05:54.414)\r\nfor you.\r\n\r\n\r\nJack (05:56.731)\r\nyou know, those wine industry is beautiful, but not really great for families. Like there's one park in all of the Napa Valley. There's no families. So we said, let's go, let's go find out what's, what's out there. It's, know, on the back end of 2020, I've just been working my butt butt off there and we sold them. said, okay, let's go see what's out there. And then on the, on the day we're leaving, my wife goes, I gotta tell you something, I'm pregnant. And then six, six weeks in, go, okay.\r\n\r\n\r\nNikolas Hulewsky (06:04.419)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (06:15.896)\r\nthreat.\r\n\r\n\r\nJack (06:24.179)\r\nLet's do the ultrasound and we go, oh, it's not one, it's two. So we had twins, one in it. So we had twins, a two year old. And we said, okay, well, you know, like this lifestyle is no longer conducive. Like we have to stop somewhere. So we stopped in Idaho. I started my search. said, hey, you know, I have three kids now. Boise, Idaho. Yeah. Oh, awesome. That's where we were looking to move to. Yeah. I loved Eagle. Yeah. Such gorgeous.\r\n\r\n\r\nNikolas Hulewsky (06:27.01)\r\nNo!\r\n\r\n\r\nNikolas Hulewsky (06:44.494)\r\nI'm an eagle.\r\n\r\n\r\nYeah, really, yeah.\r\n\r\n\r\nJack (06:51.633)\r\nWe should talk after this. I have still a lot of good buddies who live there and that'd be cool. We go back a lot. But yeah, so we lived right in North Meridian, like right on the way to Bogus Basin right there.\r\n\r\n\r\nNikolas Hulewsky (06:52.992)\r\nYeah, yeah,\r\n\r\n\r\nYeah, for sure.\r\n\r\n\r\nNikolas Hulewsky (07:04.622)\r\nDude, we go to Bogus at least once a week during the winter. It's close. It's awesome. Anyway, like.\r\n\r\n\r\nJack (07:06.779)\r\nI love bogus, yeah, it's so awesome.\r\n\r\n\r\nSo you'll understand this. my wife and I love Idaho. We love Boise. We love that area. But my wife couldn't handle the winters, the inversions where it's just like gloomy for three or four weeks at a time. She's from Tahoe. So it's snowy, but it's sunny. It's like it dumps snow and then it's like sunny the next day. So she's used to that kind of snow and weather, not like Boise snow miserable for three weeks. I loved it, man. I loved it. We'd go sledding. I mean, it was wonderful.\r\n\r\n\r\nNikolas Hulewsky (07:23.266)\r\nWhere's your wife from?\r\n\r\n\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (07:34.136)\r\nYeah.\r\n\r\n\r\nHahaha.\r\n\r\n\r\nJack (07:41.009)\r\nSo we bought this business in Nashville. So I found Nashville. We had a few locations we were looking at about this sub $1 million HVAC company. And day one, actually the day before day one, so day negative one, everyone quits. Everyone except the person who answers phones quits. So the old owner went around telling all the supply warehouses that he sold the business. The supply warehouses told the employees and\r\n\r\n\r\nNikolas Hulewsky (08:09.356)\r\nno.\r\n\r\n\r\nJack (08:10.119)\r\nThe employees weren't happy. So day one, somebody who has never ran a service call in my life, never been an HVAC guy, like we, I managed HVAC vendors, but I wasn't an HVAC technician, especially from a residential standpoint. And the reason I chose HVAC was because I didn't really know HVAC. It was a moat to me. I knew how to do carpentry and plumbing and high voltage electrical troubleshooting from the winery days. But we always contracted out HVAC because it was so important.\r\n\r\n\r\nNikolas Hulewsky (08:29.454)\r\nMm-hmm.\r\n\r\n\r\nJack (08:39.335)\r\nbecause there was 172-ish million dollars in wine under HVAC at any point in time. So we made sure that that was third party. It was hard to figure out. I couldn't do it in-house. So said, this is the moat. And that moat ended up becoming a headache because everybody quit. now I'm the only... So I'm like the quintessential, like what the worst case that could happen when you buy a business.\r\n\r\n\r\nNikolas Hulewsky (08:49.152)\r\nGosh.\r\n\r\n\r\nNikolas Hulewsky (08:55.954)\r\nThe moat became the millstone.\r\n\r\n\r\nNikolas Hulewsky (09:04.333)\r\nAll right, let's pause here for a second. How much was the business? How much did you buy it for?\r\n\r\n\r\nJack (09:09.203)\r\nWe bought it for $600,000, 600 and change. Yep.\r\n\r\n\r\nNikolas Hulewsky (09:10.894)\r\nOkay. SBA, private. Okay. Dude, I think you'll probably be able to resonate with this.\r\n\r\n\r\nWhen you make a couple million dollars, at first you think it's a lot of money. And then really quickly you're like, you're kind of in no man's land. You've got enough money to do something cool, but not enough money to really go big or just retire for the rest of your life or do whatever you want. And if you do one thing, you're kind of betting the farm. Like this, you did the SBA, so you PG'd it. Now 600 grand probably wouldn't have bankrupted you, but.\r\n\r\n\r\nJack (09:41.692)\r\nMm-hmm.\r\n\r\n\r\nJack (09:45.651)\r\n100%.\r\n\r\n\r\nNikolas Hulewsky (09:49.262)\r\nwould have been a massive slug, right? It would have been a massive hit to your family. that's a, it's just a scary, uncomfortable place to be. So you said, Hey, I'm to buy a business thinking there's a moat here. This is smart. I'm putting my money down. I'm in a growing market in middle Tennessee. And then everybody quits. What did you do on day one?\r\n\r\n\r\nJack (10:09.307)\r\nSo luckily or unluckily, the old owner still had two-week transitionary period with me. Just two weeks. And so it was me and him running calls. And so he had some experience, but he was more of a salesman than an actual technician, right? So it ended up being that like day two, I was up at 3 a.m., 4 a.m. in the morning watching YouTube videos on\r\n\r\n\r\nNikolas Hulewsky (10:27.896)\r\nTechnician. Yeah.\r\n\r\n\r\nNikolas Hulewsky (10:34.734)\r\nAhem.\r\n\r\n\r\nJack (10:38.899)\r\nthe 10 I remember this to the T the 10 most the 10 most common problems on an AC unit because I bought this thing in June so like it wasn't oh you it's kind of slow season no it's like we gotta go day one\r\n\r\n\r\nNikolas Hulewsky (10:48.524)\r\nBye guys.\r\n\r\n\r\nYeah, hey, my freaking air is out. It's Tennessee in the middle of summer. Humidity is 98%. Get the freak out here.\r\n\r\n\r\nJack (10:56.743)\r\nYeah, and so I'm like struggling trying to figure out HVAC as quick as I can, waking up at 3am. Luckily, I have the owner's help, but he wasn't much help because he wasn't a good technician. So it was a lot of self learning. Luckily for me, you know, I've done a lot of electrical troubleshooting. So that actually transfer that knowledge transfer really well, like a contactor is a contactor, half of the issues you're going to get on an HVAC unit are electrically based. So\r\n\r\n\r\nNikolas Hulewsky (11:06.702)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (11:22.082)\r\nYeah, full disclosure, once you get past the word HVAC, you start saying words like contactor. I'm like, I'm checking out. I have no idea what you're talking about.\r\n\r\n\r\nJack (11:27.335)\r\nYep, a lot of people are. But that was like, that was the saving grace for me as an owner buying small was that I knew that so you know, my financial aptitude was okay. My marketing aptitude was pretty good from a failed winery experience. But where I was best at was, you know, mechanical troubleshooting. And so I was lucky enough to have that skill. Because if I didn't, and I bought a sub $1 million job, and this thing same thing happened, like I would have been wrapped.\r\n\r\n\r\nNikolas Hulewsky (11:49.272)\r\nMmm.\r\n\r\n\r\nJack (11:56.839)\r\nThere's no way.\r\n\r\n\r\nNikolas Hulewsky (11:57.166)\r\nSo the pros were it was a smaller company. You didn't have a lot of overhead, right? So except for the person who was taking calls, you didn't have a lot of overhead. You probably had some rent. And then the loan, I'm going to guess your loan payment was somewhere in the ballpark of like $6,000 to $8,000 a month. Okay.\r\n\r\n\r\nJack (12:07.986)\r\nMm-hmm.\r\n\r\n\r\nJack (12:15.335)\r\nBingo. it was like it was was a it was a low prime back then right because it's 2022. So it's like 7k a month before climbing but yeah.\r\n\r\n\r\nNikolas Hulewsky (12:23.374)\r\nOkay, so was your thought like, all right, I could flow this worst case for like three months, but I gotta figure either how to do this myself or hire somebody or were you in like the fetal position? I talked to Reg Zeller the other day and he was telling me about one of the times he had a refinery. He's like, I'm gonna go bankrupt. This is it. I'm in the fetal position in the bathroom at 3 a.m. You probably had moments of both, but like, did you just hop right into fix it mode or were you freaking out for a little bit?\r\n\r\n\r\nJack (12:38.791)\r\nYeah.\r\n\r\n\r\nJack (12:52.423)\r\nmean, honestly, I was so lucky that I was that I was still kind of in the honeymoon phase of it. So I was in the honeymoon phase where I was really happy to be there. So even though like the shit hit the fan, excuse the language, but like, it was sink or swim, and I just decided to swim. So was up at four morning watching YouTube videos, I do all I'd rock out the day do my eight calls. And then at night, I would do all my paperwork. And so, you know, lucky, lucky, I still had that like new ownership energy to get me through.\r\n\r\n\r\nthere was definitely moments of fetal position. But I think the bigger thing was just like, how do I get help? Like I need help ASAP. Let's get some people in here. So I got the first technician shortly after wasn't the best technician, but like, I try to view it as it was a time and a place. So he was a terrible person. In the like, well, like, so how do I explain this? So\r\n\r\n\r\nNikolas Hulewsky (13:31.266)\r\nWhen did you get that first technician in?\r\n\r\n\r\nJack (13:51.892)\r\nSo for example, this is the kind of person that that person was is he asked me, hey, Jack, do you mind if I borrow the truck this weekend? My daughter's unit's broken. I'm going to go. My tools are on it. I'm going to go and fix it. I was like, yeah, sure. Of course, me being the nice new owner, go fix your daughter's unit thinking that her daughter, his daughter lived 10 miles away, 60 miles away. I get a freaking thing in the mail from New Jersey saying I owe a toll. New Jersey's four states away. It's like 2000 miles from us.\r\n\r\n\r\nNikolas Hulewsky (14:05.688)\r\ncourse.\r\n\r\n\r\nNikolas Hulewsky (14:17.104)\r\nmy gosh.\r\n\r\n\r\nJack (14:21.787)\r\nAnd I'm like, hey, what the heck is this, man? And he's like, you told me I could go help my daughter fix it. And I was like, yeah, not in four states away. That's pertinent information that you should have disclosed prior. So he didn't last much longer than that. I don't think actually he lasted anything longer than that when I figured I found that out. I laugh about it now, but I was definitely not happy at that time.\r\n\r\n\r\nNikolas Hulewsky (14:43.598)\r\nDude, I would have been freaking pissed. So I'm gonna have you give me a couple episodes. I'll link in the show notes if you wanna listen to like the rest of your journey, because I'm sure you've told this story many times, right? But what I find fascinating is 2022 is not that long ago. was essentially you bought this business two and a half years ago. And you've gone from a $600,000 company to five, $6 million in top line revenue.\r\n\r\n\r\nJack (14:55.662)\r\nYeah, I'll tell you some parts of it, but yeah.\r\n\r\n\r\nJack (15:02.109)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (15:12.64)\r\nHas that all been organic growth or has that been acquisitive?\r\n\r\n\r\nJack (15:16.371)\r\nSo there's a bit of both. I'd say probably 50-50. Half of it's been acquisitions. We've gotten very good at buying tuck-ins, which are small, you know, mom and pop shops, kind like my original purchase that really nobody else wants, right? PEs too, they're too small for private equity. They're a job for most people who want to get into this game. So what we do is we come along and we say, hey, you're not going to sell this to anybody. We will offer you something. It's probably not\r\n\r\n\r\nNikolas Hulewsky (15:33.09)\r\nway too small.\r\n\r\n\r\nJack (15:45.501)\r\nthe millions that you're hoping for, but you have a large customer base, it's worth something, we'll give you money for it. And that's what we do. And so we tuck those companies in. We just really take their Google business profile, their book of business, and maybe a truck, maybe one employee, and transfer it all over. And so we've...\r\n\r\n\r\nNikolas Hulewsky (16:02.808)\r\nWhat's your focus? it geography? it like, we're just going to gobble up this area or are you just being, hey, anywhere that I see something's for sale, I'm to go out and try to get it.\r\n\r\n\r\nJack (16:11.091)\r\nI mean, anything within our service area will take. We definitely have a strategy on which direction we're moving in Middle Tennessee. But we are agnostic as long as it's service area driven. Because we estimate that we're going to take about 50 % attrition rate on that. But then the other 50 % of customers will become long-term customers.\r\n\r\n\r\nNikolas Hulewsky (16:31.47)\r\nSo to get to that five million, how many companies have you purchased in the last two and a half years?\r\n\r\n\r\nJack (16:35.045)\r\nSo we've purchased four. Four. I so there's a question mark in there because like, what's really a company?\r\n\r\n\r\nNikolas Hulewsky (16:40.259)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (16:44.856)\r\nWhat's a company? Is a customer list a company? Is the Google business profile a company? Yeah, yeah, get what you're saying.\r\n\r\n\r\nJack (16:50.419)\r\nExactly. There's and then their size. So like we bought hey, I have a 50 that we made $100,000 last year off this customer list. It's 100 customers. I'll still buy that like that's still value to me at the right point in time. And so we bought like I said that first 800,000 in top line revenue for 600,000, which we vastly overpaid big big watch out to everyone out there don't be Jack, because you're going to end up with you know,\r\n\r\n\r\nNikolas Hulewsky (16:53.175)\r\nEh.\r\n\r\n\r\nNikolas Hulewsky (17:00.782)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (17:10.67)\r\nOkay. Okay.\r\n\r\n\r\nJack (17:19.235)\r\na new business that you're the only one works there and you paid over half a million dollars for. So, I fell into the buyer's trap. But the second one, for example, was another $600,000 revenue that we bought for $12K. So, that's the extremes of both sides, where it was probably worth a little bit more than that, but not a ton more.\r\n\r\n\r\nNikolas Hulewsky (17:34.22)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (17:43.566)\r\nOkay, so you bought 600,000 in revenue for 12K. What was the next deal you did?\r\n\r\n\r\nJack (17:48.467)\r\nI think we did another deal for $211,000 in top line. We paid $25,000 for that. And then the next one we bought was more of a strategic for vertical. So we wanted to say, we want to go from HVAC to also do plumbing. So we bought a plumbing company that was more of a merger type situation that did $2 million in top line. We had to shut down about half of it just because it was new construction work. We're only service.\r\n\r\n\r\nNikolas Hulewsky (17:57.955)\r\nthe next.\r\n\r\n\r\nJack (18:17.607)\r\nresidential service. And so we paid adequately for kind of that half of the business. I can't say how much we bought that for. But essentially, 2 million in top line and then really 1 million in top line after we shut down the first half of the business. And then the rest was organic growth pretty much.\r\n\r\n\r\nNikolas Hulewsky (18:25.422)\r\nThat's okay. So that, that was too long, 2 million in top line.\r\n\r\n\r\nNikolas Hulewsky (18:37.006)\r\nWow. Okay. So you essentially purchased, I'm just doing the math in my head, 800, 200, 600. you purchased, I'll just round up, 2 million plus 3 million. So you've organically grown $2 million at least, $2 million in the last two and a half years. Dude, that's a lot of growth for a home services company. Yeah. I want to...\r\n\r\n\r\nJack (18:52.989)\r\nThat's probably accurate, yeah.\r\n\r\n\r\nYeah, it hurts. Our net is terrible, but everything goes back into the business. I'm a huge proponent of I'm probably one of the least paid people at the company. I don't have a boat. I don't have and you know, like the traditional owner, the H-Tech owner you see on the Internet that has like this awesome boat and like a F-250 lifted truck. Like I don't I drive around in a beat up old truck. Every dollar goes back into marketing and growing the business because that's the goal.\r\n\r\n\r\nNikolas Hulewsky (19:16.888)\r\nYeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (19:26.254)\r\nI love the acquisition strategy of like, it's crazy the multiples you've been paying for some of the top line revenue. However, businesses that are this small can be really difficult. mean, your first acquisition is a perfect example of that, right? Like it can all fall apart. These aren't businesses that have really good systems, processes and people necessarily. Yeah. So you're bringing organization to them. Are you financing this through personal SBA?\r\n\r\n\r\nJack (19:41.171)\r\nMm-hmm.\r\n\r\n\r\nJack (19:46.941)\r\nThey have none. Yeah.\r\n\r\n\r\nNikolas Hulewsky (19:56.118)\r\nNo debt? How are you buying these businesses?\r\n\r\n\r\nJack (19:58.331)\r\nYeah, so we still have the SBA line open, right? For anyone who knows SBA, you can do the linear math on there. We've spent $600 of our SBA line. We can spend up to $500,000. If it's the same NAICS code or whatever, it's 0 % down. So we are leaving that open for a big acquisition opportunity. All the rest have been on creative financing, seller financing, or we just paid cash, right? We paid cash, bought them out, and called today.\r\n\r\n\r\nNikolas Hulewsky (20:04.45)\r\nEh, eh.\r\n\r\n\r\nNikolas Hulewsky (20:12.354)\r\nNext,\r\n\r\n\r\nNikolas Hulewsky (20:22.606)\r\nLet's run.\r\n\r\n\r\nSo I want go back to this first acquisition because there's one thing that I just want to talk about.\r\n\r\n\r\nJack (20:32.146)\r\nYeah, of course.\r\n\r\n\r\nNikolas Hulewsky (20:35.342)\r\nThere's a lot of people in ETA and this is one thing that I make fun of people for, which is I'm going to buy a business. I'm going to buy a business and I'm just going to hire an operator. Right. Just yeah. they have a fax machine. I'll be printing money, dude. I'll introduce this thing called email. But I think what that does, especially for people who are getting into industries that they don't know is they don't ever get into the weeds. They don't ever understand the business. Do you think that\r\n\r\n\r\nJack (20:40.173)\r\nI'm ready.\r\n\r\n\r\nJack (20:44.947)\r\nEasy, just answer the phone.\r\n\r\n\r\nJack (20:52.733)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (21:05.367)\r\nhaving to learn the business on such a granular level, like becoming a tech for the first couple of weeks or months. Have you looked back at that as like a blessing or have you not thought about it in that?\r\n\r\n\r\nJack (21:17.777)\r\nNo, 100 % complete blessing. What would I so we deal, I deal with a lot of people who ask me, Jack, I want to buy an HVAC company, or I just bought an HVAC company, and I'm having this issue in this issue. Right. And what I've ran into, and what I've noticed is that a lot of people are afraid to change the business, right? You know, the business needs to change for growth perspective, right? A lot of our growth is because I implemented the systems, the people that work for the company.\r\n\r\n\r\nI hired. So it's my culture. It's my ownership. When you buy say a $3 million top line, hey, half a million dollar net, there's maybe like this one guy who's a manager who doesn't want to ever change or this technician is the lead tech and he doesn't want to do it this way. And if he leaves, everybody's gonna leave. So you're scared. You're afraid of not you personally, but like this, this hypothetical person is afraid of changing their business, even though they need to they know they need to to grow.\r\n\r\n\r\nNikolas Hulewsky (22:10.38)\r\nNo no no, yeah.\r\n\r\n\r\nJack (22:17.171)\r\nWe see that a lot. I see that a lot. I keep saying we. as in, you know, I run the help run owned and operated. And so I see that a lot and that's a huge issue. I never had to deal with it. I am the worst like paternal figure when it comes to that. I just say, just do it, rip the bandaid, like let him quit because I just don't have any kind of sympathy or empathy there because it was so rough for me and\r\n\r\n\r\nI know that that had to happen for me to fully understand my business, but also for me not to be ever afraid of making changes in my business, right? Because if I have to go back to being a tech, then I got to go back to being a tech. It is what it is.\r\n\r\n\r\nNikolas Hulewsky (22:55.192)\r\nwhat I think.\r\n\r\n\r\nNikolas Hulewsky (22:59.448)\r\nAnd I think anybody who's successfully scaled a business at some point has to figure out the business on a granular level. So you, I'll use a house analogy. Again, I'm out of my depth here, but effectively you built your house from scratch, right? Like, you know the plumbing. You know where everything is laid. A buyer who buys a business or they buy a home, an existing home, you know, that home could be a hundred years old and they don't know necessarily all the plumbing.\r\n\r\n\r\nunder the house. They don't know that, I actually capped that. The previous owner capped this line several years ago and they ran a new line. so when you start digging in the dirt, you're like, wait, is this line they just left in or what's going on here? And so if they don't actually jump in to figure out the business, it's going to hinder their ability to scale because you don't understand how things work. So you were forced into it, which is great. And you were able to like build it from scratch. But I think people forget.\r\n\r\n\r\nJack (23:55.155)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (23:56.911)\r\nwhether or not you're building it from scratch, you've got to get into the weeds. Like I've never met anybody who was successful that wasn't in the weeds at some point in time. There is no such thing as like just a passive income business that you buy through the SBA.\r\n\r\n\r\nJack (24:01.095)\r\nExactly.\r\n\r\n\r\nJack (24:08.391)\r\nThat's been the weirdest thing about entrepreneurship for me is that the realization working with the owners who are making it and owners who are struggling is the owners who are making it are oddly obsessed with their business, including myself now. Like every single detail about their business, you ask them, they know. They know what their ROI is, what they're on this specific market. And they have a marketing person, but they still know the intricacies of their business, which I've realized is so important to understand.\r\n\r\n\r\nkind of across the board. So, yeah.\r\n\r\n\r\nNikolas Hulewsky (24:39.374)\r\nSo I want to move a little bit. You've been scaling, which is awesome. And you have started to hire overseas talent to help you scale. Is that correct?\r\n\r\n\r\nJack (24:49.863)\r\nYep. Yes. So yeah, sorry. Finish your clip. I'm just like,\r\n\r\n\r\nNikolas Hulewsky (24:53.44)\r\nWell, no, no, So two part question. The first part is. What are you scaling to like? What's your goal? And then the second part is how are you using overseas talent in a home services business?\r\n\r\n\r\nJack (25:05.523)\r\nYes, our goal is 20 million by 2030. So pretty hefty goal. I mean, it's still a few more years of 100 % year over year growth. So a little bit more pain. But one of the ways that we've been able to really effectively do that is by outsourcing our talent, right? So\r\n\r\n\r\nAnd obviously you can't outsource a plumber, you can't outsource an HVAC rep. But what you can outsource is kind of back of office abilities. And so our ability to find really good back of office staff has been an absolute key to driving the business forward because we can hire three, four people for the same cost as a singular domestic individual. But not only that, what we found is they're better retention, like they're so much happier.\r\n\r\n\r\nin that spot than the domestic employees are, unfortunately. So to go into kind of a diatribe story on this one, so our customer service rep position, we were going through a customer service rep every 90 days, give or take. So every 90 days, we would cycle through a domestic customer service rep. We originally started and we hired a customer, after hours customer service rep that was in the Philippines.\r\n\r\n\r\nNikolas Hulewsky (25:56.334)\r\nSo tell me what positions those are, like what are you hiring for?\r\n\r\n\r\nJack (26:20.667)\r\nShe's amazing. She still works for us today a year and a half later. But we originally started her after hours because we didn't have all the systems worked out. So her goal was just hey, anything that comes in after hours, you book it just book it, book it, book it. She did so well that once our customer service rep hit their 90 days, they cycled through for whatever reason, we moved her into full daytime. She's still there today. We replaced her with after hour service another\r\n\r\n\r\nFilipino after our service. And then we brought on a weekend after our service, our bookkeepers in the Philippines, HR, recruiting all in the Philippines or Jamaica. And so we've just been really passionate about any kind of position that we can get, assisting role position that we can get from the Philippines or outsourced, we will do that.\r\n\r\n\r\nNikolas Hulewsky (27:15.278)\r\nWhat about things like billing, collections, scheduling? Yeah, those types of things. Are those done in house or outsourced? It's all, you know what? Yeah, yeah, that's a bad way for me to put it. You're right.\r\n\r\n\r\nJack (27:21.959)\r\nSo the the when I say outsource, I mean, it's all in his house. Yeah. Yeah. Yeah. Yeah. So I mean, what we end up finding was dispatch was a very difficult position because dispatch is like a it's a puzzle. There's a there's a lot of aspects to it and they have to be very in tune with the technicians in the field and they're ordering parts from warehouses. And so there's a lot there.\r\n\r\n\r\nAnd so that's our only back of house position that is local. So we found that we put dispatch here, we keep them local. But in terms of like answering phones, booking calls, being bubbly and friendly, Philippines, South America, Jamaica, all absolutely amazing, amazing hires.\r\n\r\n\r\nNikolas Hulewsky (28:06.284)\r\nAnd has that made it easier for you to roll in these tuck-ins where you just have systems and processes already in place?\r\n\r\n\r\nJack (28:11.507)\r\nOh, 100%. So for example, one of the best ways for a tuck in to be successful, right, because you're just buying a list, you're buying phone numbers. And and that's it, you're buying an inbound phone number, and 6000 outbound phone numbers. That's all you're buying. Right. And so you're paying 10 15 30,000 for this list of phone numbers. And how do you get them?\r\n\r\n\r\nto go from Joe's HVAC who Joe's been their guy for the last 30 years. And now this rapid response is calling me what the heck. And so there has to be a bridge there. And that bridge is we call, we text, and we direct mail and email just to let them know we're partnering, we're going to own all their their warranties and guarantees, and we'll take care of them and we'll give them maintenance is they just want to know that they've been taken care of. And one of the keys to being successful. I said we build those are we\r\n\r\n\r\nbill, excuse me, we offer on those companies at a 50 % attrition rate. But we generally see a lot less, because we're very active in calling their customer base and having the overseas employees that are dedicated just to that function. Right? So I mean, to call 6000 customers at 100 customers a day, and you can do the math, it's going to take two months. And then somebody and that's just like, singular calls, not even the like, hey, they didn't answer, let me call back.\r\n\r\n\r\nNikolas Hulewsky (29:16.824)\r\nUh-oh.\r\n\r\n\r\nJack (29:32.979)\r\nSo there's a full function there of I can pay somebody six, $8 an hour and they're going to bring in so much more value by if they can raise attrition rate from 50 % to 80%. That 30 % on 6,000 customers is astronomical, right?\r\n\r\n\r\nNikolas Hulewsky (29:50.318)\r\nI know a lot of people listening will say like, yeah, it makes sense. I'll hire someone overseas. I'll pay them six bucks an hour as opposed to $15 an hour locally. So the cost savings makes sense and they may even have the desire to do it. And maybe I'm wrong with the numbers. I'm just saying like, cool, there's, yeah.\r\n\r\n\r\nJack (30:04.607)\r\nI was laughing. I would love to find local people for $15 an hour but\r\n\r\n\r\nNikolas Hulewsky (30:09.902)\r\nthat's what you're, I thought you're laughing at the $6. Anyways, how, but it's, it's scary. Like it can be intimidating, right? You, so how did you go about finding your overseas talent? Did you just find them yourself or are you going through an agency? Like what was the first step like when you found this customer service rep for after hours?\r\n\r\n\r\nJack (30:13.298)\r\nNo.\r\n\r\n\r\nJack (30:20.733)\r\nYeah, yeah.\r\n\r\n\r\nJack (30:36.135)\r\nYeah, so I mean, it's definitely a process and there's things that you have to optimize for that are really important. One of those things that sounds obvious, but is accent, right? The less accent that that individual has, the better they are in a situation that's an emergency situation like someone calling in and their basement flooding. They want to be understood. There's a second part to it, though. The second part to it is, hey, if they don't have an accent, it means that they've worked for a Fortune 500 company.\r\n\r\n\r\nNikolas Hulewsky (30:55.0)\r\nSo I agree with that. I agree with the accent piece. I'm just, okay, all right.\r\n\r\n\r\nJack (31:06.035)\r\nas a customer service rep and they have the experience and they have enough experience that they've been practicing English for that long of a time. So that's actually like the real portion to this is what we found is the less accent the more experience they've had because they've had like they've been working for somebody's and they've been pre trained by 18 T or Ford or one of these monstrous fortune 500 companies and they they do really well.\r\n\r\n\r\nNikolas Hulewsky (31:31.278)\r\nSo for me, the hardest part would be not the accent. The hardest part would be where do I even go to start finding people who are looking for this? Like, am I going to Upwork? Am I going to Fiverr? Do I go to Sagan? Do I go to somewhere? Like, there are all these options, but in 2022, there's even a lot more options today than there were in 2022. What was your first step? Like, did you just go post on Upwork? Or like, how did you find that first person?\r\n\r\n\r\nJack (31:57.671)\r\nYeah, so I mean, a little bit back to my history is I also ran a winery that epically failed due to exploding wine bottles. Yeah, we accidentally made champagne after selling out like multiple pallets of wine.\r\n\r\n\r\nNikolas Hulewsky (32:10.222)\r\nThat's an amazing story.\r\n\r\n\r\nNikolas Hulewsky (32:19.598)\r\nHow much money was that?\r\n\r\n\r\nJack (32:22.317)\r\nHow much money was what? I mean, we broke even because we sold it all, but like we had to shut down the company shortly after. Let's just say that it was very bad, like neon purple liquid exploding in people's houses and cars and pantries and like and like like fountain ceiling pictures of it on the ceiling type of shit.\r\n\r\n\r\nNikolas Hulewsky (32:23.733)\r\nthe palates of wine.\r\n\r\n\r\nNikolas Hulewsky (32:27.729)\r\nokay.\r\n\r\n\r\nNikolas Hulewsky (32:31.497)\r\nmy gosh.\r\n\r\n\r\nmy goodness. Okay.\r\n\r\n\r\nJack (32:45.075)\r\nAnyway, long story short is I had previously hired. So like I had a VA back from 2016 who I've been working with who I found on Upwork. And then so I had a community that I've already pulled from. like pH jobs online, Facebook groups, and then Upwork's a great, great option.\r\n\r\n\r\nNikolas Hulewsky (32:55.917)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (33:02.83)\r\nSo what would you recommend to somebody who has a home services business? So it's like, all right, cool, I'm gonna hire my first overseas talent. Where would you go? I know you don't, sorry, go ahead.\r\n\r\n\r\nJack (33:09.213)\r\nSo I don't want to plug. I mean, we started really, really recently a service for this because of our experience. So we are placing CSRs who are pre-trained in the CRM system, and they know basic 101 HVAC and plumbing into other companies. And we did that because\r\n\r\n\r\nyou can go to Upwork 100%. You can find this talent fairly easily. You post, you'll get 30 people who want to work for you at six, eight dollars an hour. Boom, easy. The hard part is once you install them in your business, what we find is a lot of people actually let them go pretty quickly. Like they're there for two weeks and then they're gone. And it's because they don't have the SOPs and the background scripting and everything necessary to allow that person to run semi autonomously.\r\n\r\n\r\nNikolas Hulewsky (33:39.822)\r\nMm-hmm.\r\n\r\n\r\nJack (34:07.767)\r\nwhile expecting a lot out of them, right? So you want someone, I just hire someone and they just answer my phone. But there's so much nuance to everyone's business that to just say that and then let them run free, they're going to fail. They need the training, they need the SOPs, they need to know where the guardrails are. And what I found is that they don't like, people just don't do that. And so, so if you're willing to spend the time training somebody who's not from the US about\r\n\r\n\r\nNikolas Hulewsky (34:30.638)\r\nMm-hmm.\r\n\r\n\r\nJack (34:36.719)\r\nsome US cultures and customs and scripts on how we give empathy and how we say certain things, then yeah, hire yourself, you'll save a ton of money and go. If not, I would definitely recommend having someone who will help implement this person into your business, help guide them. You said a few great ones. mean, Sagan is an awesome, awesome company specifically for like really like technical high placing hires, like accounting and\r\n\r\n\r\nNikolas Hulewsky (34:59.0)\r\nWell, yeah, and maybe.\r\n\r\n\r\nJack (35:06.557)\r\nlike marketing and things like that.\r\n\r\n\r\nNikolas Hulewsky (35:08.418)\r\nYeah, maybe the recommendation isn't like a specific company. Maybe the recommendation is find a company that offers in your vertical, right? Like they have experience. So if I'm an HVAC company, if I'm Austin Linney and I'm like, I want to hire a CSR, I'm going to go to I'm going go to Jack, right? It's like, hey, Jack, I know you know my space. You you have the SOP school. I'll go to you. If you were someone who owns a roofing business, you're probably going to go to somebody who has. Experience outsourcing roofing talent, right? So.\r\n\r\n\r\nJack (35:22.525)\r\nAustin's awesome.\r\n\r\n\r\nNikolas Hulewsky (35:37.742)\r\nThat's probably maybe the better advice to give as opposed to specific companies.\r\n\r\n\r\nJack (35:42.769)\r\nYeah, exactly. And that's that's what my belief is that eventually, I mean, I Peter Lohman also does this specifically for he's another Twitter guy, but he does it specifically for what does he do? He does. Thank you. Property management. And so he's inbound CSRs for property management companies. And that's because he understands the nuance of that industry. And so that's definitely where I would recommend I would say, hey, if you want to do it yourself, it's a great experience. You once again, like we were talking about.\r\n\r\n\r\nNikolas Hulewsky (35:52.024)\r\nYep, yeah, yeah, I had him on.\r\n\r\n\r\nProperty management.\r\n\r\n\r\nJack (36:12.291)\r\nme owning this company, you get the feel for the full process. But you have to spend the time and the energy, especially when you're worried about fighting fighting fires of a $1 million company. Maybe you don't have time for that. But if you don't, or if you do, you try it yourself.\r\n\r\n\r\nNikolas Hulewsky (36:24.237)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (36:28.878)\r\nSo I'm going to ask you, the last question is going to be, would you do what you did again? But before I ask that, because I think that's interesting. I think that's interesting to think about. We'll hear a lot of lessons learned from your experience. But before I ask that, where's the best place for people to come find you?\r\n\r\n\r\nJack (36:38.675)\r\nYou\r\n\r\n\r\nJack (36:46.227)\r\nI love Twitter still to this day or X or whatever you call it. It's the HVAC Jack You can find me there the HVAC Jack and You know Owned and operated podcast you can hear us me and John Wilson talk about HVAC plumbing electrical But would I do it again? Yes 100 % Yes, and then for two reasons one\r\n\r\n\r\nNikolas Hulewsky (36:49.912)\r\nYeah, it's the best.\r\n\r\n\r\nNikolas Hulewsky (36:57.698)\r\nthan the owned and operated podcast as well, right?\r\n\r\n\r\nJack (37:15.131)\r\nis my belief is you for ETA, the first step then, you know, you're beating out 90 % of everyone else is just getting in the game. It really is the first step is putting pushing your chips in saying, I'm in. And that's more than most people get. And so that's that's huge. then with the ETA side, I never had a problem early on, right? Everybody quit, I had like the opposite issue.\r\n\r\n\r\nThe opposite issue was I had too many calls coming in and I didn't have like know what to do. But I had calls coming in, right? If you start up, if I would have started up the same business, I'd be sitting there like the first week, like, like twiddling thumbs because the what is really, really difficult is actually to gain what I found is gaining market share in certain markets. So maybe in in tertiary markets, it's easy. But in HVAC in large markets like DFW in Nashville and\r\n\r\n\r\nNikolas Hulewsky (37:46.03)\r\nYeah, yeah, yeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (37:52.93)\r\nMm-hmm.\r\n\r\n\r\nJack (38:11.581)\r\nlike Las Vegas and like gaining market share is really difficult because you're going up against $100 million corporations who have just all this money to dump into marketing. So I didn't have that issue day one. My phone's running all through that first summer. We had plenty of lead gen. Yeah. And so that's that's why I'm a big believer in ETA in general is just because I did have issues, but I didn't have all all the issues. I just had half of them. So\r\n\r\n\r\nNikolas Hulewsky (38:23.672)\r\nYeah, yeah, yeah.\r\n\r\n\r\nStill a problem, but it's a good problem to have.\r\n\r\n\r\nNikolas Hulewsky (38:40.896)\r\nSo let me ask you this question. So you do it again. That's rad. What would you do different though? What would you have done differently looking back?\r\n\r\n\r\nJack (38:51.667)\r\nI probably...\r\n\r\n\r\nNikolas Hulewsky (38:52.878)\r\nWas it the announcement? it, you know, just making sure you had a tech?\r\n\r\n\r\nJack (38:56.285)\r\nprobably would have tried to buy for less. being like, like I said, the SBA, or the buyer's trap is a real thing. It really catches a lot of owners off guard was, yes, the buyer's trap is like, you understand the information, but you're not understanding how the information is relevant to businesses, right? So you might hear a common thing in the industry, right? Is is HVAC companies trade for 3x their SD will play like that one.\r\n\r\n\r\nNikolas Hulewsky (39:08.622)\r\nWill you explain that? What's the buyer's trap?\r\n\r\n\r\nJack (39:27.446)\r\nSo the SDE on this business was 200,000 280,000. So I paid my 2.5 XSDA to make my $600,000 purchase price. But if you also look at a business that's for an $800,000 business for business doing 3 million, they might have that same 280,000 at a healthy 10 % margin, give or take right. But that 200 that $2 million business that's making that same SDE\r\n\r\n\r\nis actually a business, right? It has people in place, it has systems, it has a phone system, it has a CRM that they're using, it has a warehouse. Like that, that SDE is that low because they're spending properly to keep a healthy business alive. Whereas what I bought was a job without any infrastructure that I had to build everything and work out of a garage week one. And if I was to add real estate, and if I was to add a proper CRM and a phone system and headcount,\r\n\r\n\r\nThe SD on that 280 would have been more like 10,000, right? And so that's the buyer's trap is not understanding the difference between the net on a business and the net on a job. Massive difference. And make sure that if you're actually going to pay that net or that multiple, that it's an actual business that you're paying the multiple on. If that makes sense.\r\n\r\n\r\nNikolas Hulewsky (40:30.926)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (40:53.73)\r\nI love it. It's great advice. All right. I'm going to... Don't overpay. That's it. I'm stopping it here. Stay on.\r\n\r\n\r\nJack (40:55.015)\r\nYeah, so don't overpay. That's the key.",
  "metadata": {
    "duration": "",
    "date": "2025-03-12",
    "platform_source": "Google Drive"
  }
}