{
  "episode_number": "241",
  "episode_title": "The Freight Market Is Collapsing, Here's What You Should Do to Save Your Business with Craig Fuller",
  "guest_name": "Craig Fuller",
  "business_name": "Sonar, Freight Waves",
  "transcript": "﻿Nikolas Hulewsky (00:00.633)\r\nAll right, Craig Fuller, stoked to have you back, owner of Sonar and Freight Waves. You are deep in the logistics and distribution space. You also own a lot of print media, digital media, but I had you on back in May and I thought this was pretty cool. I went back and looked at our transcript and back in May you had some prognostications. I'm going to start calling you Nostradamus because you were like, hey, this is what the tariffs mean to us. At that time it was 145 % tariffs on China.\r\n\r\n\r\ndown yet to where we kind of our equilibrium, I think at 55%. But you're like, these are the things that we're going to start seeing. So I'm going to highlight some of the things that you said. And then I'm just going to tee it up to you to ask what you got right and what you didn't get right. So you told us back then that these terms are going to rip through the through the supply chain, it'll probably take about six months, it'd be a six months lag. You told us that be back to school shortages, that be stressed bonded warehouses, be trucking slowdowns.\r\n\r\n\r\nand that kind of this new reality of free trade as we knew it would be over. And so it's fall. Nostradamus, what did you get right and what did you get wrong?\r\n\r\n\r\nCraig (01:05.72)\r\nWell, the good news is, and the 145 % that we, at the time we did this recording, was sort of the peak of the trade tensions between China and the United States. That got resolved pretty quickly. was a, first there sort of a step down to it, and then there's been this sort of extension that the administration, the Chinese have worked out to sort of bring in a more rational terrace. You know, there wasn't back-to-school shortages, I think is the one part that,\r\n\r\n\r\ndid not happen as we didn't see inventory stockouts. I think it's largely because the market was able to respond, the administration sort of pulled back on their original 145 % tariffs. And in doing so, we were able to see a real surge of goods that came into the economy that sort of made up for that lost volume. But we are seeing a tremendous slowdown in the goods economy that is happening. are seeing...\r\n\r\n\r\nthe end of, I wouldn't say the end of globalization, but, this is gonna play out over decades potentially, a reconfiguration of the global economy, continued tensions between China and the United States, continued tensions between the United States and the rest of the world. Those things are certainly happening. And so all of this is sort of in the backdrop of trade is one of the things.\r\n\r\n\r\nbut certainly is sort of the epicenter for anybody in the economy.\r\n\r\n\r\nNikolas Hulewsky (02:31.001)\r\nWell, okay, so I was doing some research and here's what I found. So you're right, there weren't the massive shortages in back to school shopping. However, year over year price increases with those back to school products was, I believe, one of the highest jumps it's been in the last two decades. So we saw a really big jump in the back to school prices. The other thing is the de minimis, oh my gosh, I can't freaking speak English, the de minimis exemption, which was basically anything under this dollar amount.\r\n\r\n\r\ndidn't have to pay tariffs on, said, we're not doing that anymore. So companies like Shimo, for example, we've seen them raise prices pretty significantly. Imports fell really hard over the summer and it doesn't look like they're rebounding. And then the last thing that I thought was really interesting, and you've talked to me about this and we'll get into it, this OTBI index, which measures the level of shipping logistics within the United States. It's just continued.\r\n\r\n\r\nCraig (03:00.91)\r\n$800, yeah.\r\n\r\n\r\nNikolas Hulewsky (03:28.291)\r\nto decline and I've seen you post multiple times on Twitter, hey, look, this is, I've talked to many guys who've been in this space for decades. This is the worst that it's been. And so with all of that being the backdrop, like, where do we kind of stand now? And what do you expect in the near future for us?\r\n\r\n\r\nCraig (03:35.854)\r\nMm-hmm.\r\n\r\n\r\nCraig (03:46.446)\r\nYeah, I think just for those that are watching this on screen, mean, this shaded blue area is actually the current freight market. So it's sort of the 2025. If you sort of go back to where we were a year ago, this green line is where we were a year ago. We're 15 % down year over year. mean, it's been a... So this is tracking the volume of trucking freight transactions in the domestic economy.\r\n\r\n\r\nNikolas Hulewsky (04:04.845)\r\nAnd describe, sorry, real quick, describe what is this graph?\r\n\r\n\r\nCraig (04:14.638)\r\nAnd what it's doing is looking at seasonality. So if you look at it, green is 2024, pink is 2023. This other shade of green is 2022. This orange is 2019, 2018. I took out 20 and 21 because they're just so skewed because of COVID. It's just hard to see it. I can actually remove some of the other data points and start to clean up the charts. And I think what's really interesting is just sort of look at it from\r\n\r\n\r\nNikolas Hulewsky (04:30.499)\r\nYeah, crazy years.\r\n\r\n\r\nCraig (04:41.442)\r\nThis is where we were a year ago and this is where we're at right now. And so we're back to 2000, if you sort of look at where we're at, we're back to 2018 levels. And I want you to keep that in mind, because it's a really important data point, is the fact that we are back, we have lost effectively seven years of economic growth in the goods economy. So when we think about what freight is all about, freight is a...\r\n\r\n\r\nNikolas Hulewsky (04:44.536)\r\nmy gosh.\r\n\r\n\r\nNikolas Hulewsky (05:05.292)\r\nWow.\r\n\r\n\r\nCraig (05:07.178)\r\nis a function of moving product through the economy when there is demand. And so the great thing about freight market data is it's not skewed by prices. It's not skewed by a lot of the anomalies in the economic data when people use like retail spending data or they look at sort of same store sales. There's an element where inflation actually benefits when you have, it benefits companies looking at from a same store sales model.\r\n\r\n\r\nBecause if you have 4 % inflation, you're going to have 4 % year over year sales. It's the same thing when you look at products that are sold, is the GDP number can grow. But also when you have 3 % inflation, you have to net that out. And so when you look at volume of goods, we have lost 17 % year over year from where we were a year ago.\r\n\r\n\r\nNikolas Hulewsky (05:39.587)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (05:51.063)\r\nYeah.\r\n\r\n\r\nCraig (06:02.03)\r\nAnd the volumes of where we're at is, you know, that 2019, 2018, 2019 numbers, which means we've lost effectively seven years of economic growth in the goods economy, the main street economy. And here's the crazy part. Stock markets at all 10 highs, 60 % of those gains have been companies that are tied to AI. Um, and so the mag, the mag seven is sort of driving sort of, it is driving the speculation, the stock market. Meanwhile,\r\n\r\n\r\nNikolas Hulewsky (06:27.575)\r\nIt is driving it.\r\n\r\n\r\nCraig (06:31.938)\r\nAnd they only employ one point, that number's like one point, I looked it up last night, it's like 1.8 million people are employed in jobs tied to the Magnificent, the Mag-7, of which a million of those people work at Amazon and work in warehouses. So just take that number out. So we have this economy that has 35 million jobs tied to what you would call the good sensitive sectors, the ones that drive the predominance of freight. I've removed retail because retail's actually doing okay right now.\r\n\r\n\r\nManufacturing is doing horrible right now. Energy is not doing well. Auto is not doing well. Housing and construction is not doing well. Transportation logistics are not doing well. And if look at those categories, they employ 35 million Americans. So the question becomes, does it matter if the core part of your economy, the goods economy, is crumbling? Does it really matter? Or if you're trading stocks? The people that are trading the AI stuff would say no. I would argue it should matter when you have, you know,\r\n\r\n\r\nNikolas Hulewsky (07:14.297)\r\nWow.\r\n\r\n\r\nCraig (07:31.502)\r\nso much more of your economy, as many as 20 times as many jobs tied to these sectors that are far more exposed to the economic cycle than what you see with this sort of AI speculation.\r\n\r\n\r\nNikolas Hulewsky (07:41.113)\r\nyou\r\n\r\n\r\nIs there a counter narrative or a counter argument? Like I'm just going knee jerk reaction. Okay, 2018, let's say we had a couple million people population difference over that period of time. Is it so bad to be back at 2018 levels? mean, 2020, 21, 22, 23, those are gonna be elevated because of COVID.\r\n\r\n\r\nCraig (07:58.286)\r\nIf you\r\n\r\n\r\nI mean, look, I think 2024 was not a COVID year and we're down, you know, and so if you think about it, if you care about economic growth, then you should care about seeing year over year increases of goods in the economy because that means that the economy is growing. That means that people are consuming more physical goods.\r\n\r\n\r\nAnd in doing so, in consuming more physical goods, it means that the economy effectively, with no distortions due to inflation, no distortions due to the currency, are actually consuming more product. And I think that is important. And that's an important relevance.\r\n\r\n\r\nNikolas Hulewsky (08:41.609)\r\nWell, let me ask it a different way. I look at this and I'm like, how is this not a five alarm fire? Like, how is this not being screamed from the rooftops of like, guys, we know that this is happening, here's the data. And so in my mind, it's like, what justification are they giving themselves for not making this a priority?\r\n\r\n\r\nCraig (08:59.192)\r\nWell, think about the people that are driving the conversation, the people that can do something about this problem. So let's take freight data and put that aside for a second. You look at the ISM index, is your Institute of Supply Management does their manufacturing survey, that's down. Companies are laying off people. So this isn't just a freight, cardboard consumption or packaging materials is down to something like 2015 levels. So it is not just a freight.\r\n\r\n\r\nissue and you're starting to see the job markets. saw the revisions that happened a couple of months ago in the BLS data. We've seen ADP, because the government's closed, we've seen ADP come out and talk about the fact that we are effectively not growing jobs. We're not adding new jobs in the economy. if, you know, I think the question is why isn't anyone alarmed? Well, look at whom can do something about it. The Federal Reserve is sort of steadfast that the economy's growing, they're looking at the GDP number.\r\n\r\n\r\nsaying, hey, everything's fine. You look at the employment number. They're saying everything's fine. They don't want to be necessarily held accountable for some of the past actions that got us into this really weird spot in the economy. Congress is completely disconnected from the goods economy. talked to members of Congress on a semi-frequent basis, and they're completely shocked that the freight market is as bad as it is. I taught people in the administration.\r\n\r\n\r\nthat could seem to care don't want to admit that their whole trade policies and their trade stance is not working. And then Wall Street is so drunk on AI and speculation that they don't have a reason to actually feel like that they need to bail out. And so...\r\n\r\n\r\nNikolas Hulewsky (10:38.264)\r\nWhat?\r\n\r\n\r\nNikolas Hulewsky (10:42.745)\r\nThat's what that's what's just boggling my mind is you have this index that you pulled up the OT VI like you can see How low shipping volumes have come and like if you're sitting here looking at it, you're like well shipping What does that matter that you just name the industries? That are most affected by this right now\r\n\r\n\r\nCraig (10:55.534)\r\n40 % of the economy is tied to logistics-dependent industries.\r\n\r\n\r\nNikolas Hulewsky (10:59.159)\r\nWell, yeah, you've got construction. You've got manufacturing. Obviously, you got retail, which you said wasn't as bad as it might be later down the road.\r\n\r\n\r\nCraig (11:03.993)\r\nMm-hmm. Mm-hmm. Retail is the one part, sort of the one, and this is one of the reasons I think people aren't alarmed, is that retail spending, retail volume, freight volume, we can sparse our data to see it, is actually holding up relatively well. It is growing. Retail, in terms of retail consumer goods, we call them steady deliveries, is up 7 % year over year, which is really a reflection that big box retail is doing okay. So you're getting reports from Home Depot and Walmart and Target.\r\n\r\n\r\nThey're better, they're doing okay. It's the broader part of the economy. The core thesis of the mainstream economy, the blue collar jobs, which employ so many people, are the very jobs, the very parts of the industry that are being completely impacted by combination of trade policy, Fed policy, employment picture. All of it's just not good.\r\n\r\n\r\nNikolas Hulewsky (11:55.203)\r\nSo why, I guess from my perspective, we talk a lot about unemployment and inflation. I always hear the non-farm payrolls, right? Because they're like, well, farms seasonal, so we don't want to look at the farm payrolls. Why is this shipping index, the OTBI, why is that not talked about in the same breath as those things? To me, that would be one of the leading indicators, because anything that you sell that's a physical good has to be shipped from one place to another. And if we're measuring\r\n\r\n\r\nCraig (12:01.783)\r\nHmm.\r\n\r\n\r\nCraig (12:23.086)\r\nWell, the RTPI index is relatively new. It's only been out since 2018. We introduced it at Sonar. So it's a new index. The Cast Shipment Index is sort of the legacy one around, been around since 1990. It's showing the same stress that we're talking about. is being talked about some, but the issue you have in Wall Street, you have it in Washington, because I talk to a lot of these people, is there's not a lot of people who understand freight. I mean, that's the problem, is that the people that work on Wall Street,\r\n\r\n\r\nThe people that work in around Washington, and I don't care what administration we're talking about, whether we're talking about the Trump administration, the Biden administration, it does not matter. The people that work in around these institutions simply do not have a frontline understanding of how the freight and goods markets work. They're so disconnected from it, to them it might as well be someone speaking in Spanish. can sort of understand what they're saying, but I don't really understand why it's.\r\n\r\n\r\nlike what they're actually communicating to me. And I think that is effectively what's happening is that it is completely a liftoff.\r\n\r\n\r\nNikolas Hulewsky (13:21.337)\r\nDo they not have strong lobbying? Like, does the logistic industry not have strong lobbying? Do they not have strong?\r\n\r\n\r\nCraig (13:26.222)\r\nThey do, but the problem is that their job of lobbying, lobbying's a long term, it's a change, I want to change a law. And so if I hired a lobbyist who gladly take my money, the problem is they can't change the outcome of the economy. And the economy in an industry like freight is so cyclical that unless I'm wanting to change public policy, it doesn't do me any good to go hire lobbyists to drive demand. Demand.\r\n\r\n\r\nTransportation markets specifically work because someone is moving a product from point A to point B and they will not move a product. Nobody moves products around just because they want to move them around. Nobody buys, freight is a commodity that can't store. There's no battery that can store freight. It is a function of buying something to move it from point A to point B in the time it takes. That's effectively the whole calculation of what a freight commodity is. I wanna move this from A to B.\r\n\r\n\r\nAnd the only reason I'm gonna move it is because someone on the other side or somebody, maybe it's internal, something on the other side is buying or consuming that product. Could be my own manufacturing plant, it could be a retailer, but nobody moves freight just to move it. They have to feel like there's a reason to move it. It's gonna be a pull on the other end of that supply chain. And so one of the reasons freight is an incredibly powerful barometer of the broader economy is it's way upstream.\r\n\r\n\r\nIt leaves the broader economy by as much as six to nine months. And this is the whole thing called Dow Theory, which is when the transports are in a recession, they start to give off warning signs six to nine months before everyone else fills it. And so you can go back through different economic cycles. We've had recessions in the past. This is exactly what happens. These big recessions, including the 2007 financial crisis.\r\n\r\n\r\nThe freight market was given off warning signs as early as March. This was six months before we saw the collapse of the financial system.\r\n\r\n\r\nNikolas Hulewsky (15:24.114)\r\nWas it this graph that you're talking about? I know the OTBI wasn't back then, but was it this legacy one that they were looking at?\r\n\r\n\r\nCraig (15:28.462)\r\nVery similar sort of warning signs. mean, there was certainly warning signs in the CAS data, the shipment index, is that the freight market was in a recession, was in a big substantial downturn in 2007. You can go back and read, you I was doing the big trucking company called Yalo filed bankruptcy last year. And in doing so, when they were filing bankruptcy, I was reading a lot of the historical articles that came out during that period of time.\r\n\r\n\r\nAnd I was reading things in early 2007 because they had initially almost filed bankruptcy in 2007. I was reading this stuff and reading about people talking about the freight recession that happened in 2006 and 2007. And so it's very clear to me that if you go back through history, and you can follow this throughout history, is that the freight market has, we've had periods, there's a freight, anytime there's a broader recession, it shows up in the freight market first. And so what I am saying, what I am,\r\n\r\n\r\nguessing that's happening, you called me an extra domicile, it's a great compliment, unfortunately it's not true, I get a lot of things wrong. But what I would say is that the freight market data is warning us, it is flashing red, that there is a broader economic problem in the economy. And that's why,\r\n\r\n\r\nAnd it's not just the freight data. It's the ISM manufacturing index you see. It's consumer, some of the consumer data in terms of consumers are stretched. We're starting to see bankruptcy. Things like Google searches where people are looking at bankruptcy filings or how do I refinance my credit card or my student loan. You're seeing consumers, yeah, you're seeing consumers worried about things.\r\n\r\n\r\nNikolas Hulewsky (17:04.269)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (17:07.705)\r\nHow do I defer my student loans? Yeah.\r\n\r\n\r\nCraig (17:14.626)\r\nYou're seeing the housing market prices. Housing prices are coming down in some markets quite sharply. And so you're starting to see a lot of stress, but you're also getting reports and manufacturing reports where manufacturing jobs are way down. You're also looking at manufacturing activity that's way down. this is all, like I said, I think the cardboard box example is a great example because boxes are in\r\n\r\n\r\nContainer board is the technical term that they would use. Container board, which I would call the cardboard box, is used in everything. It's used in packaging materials. When you go buy cereal and you buy your lucky charms, it's got container board. You get a package from Amazon, it comes in a container board. And so that data also is telling us that there's significant stress. And so...\r\n\r\n\r\nI think what we're seeing is the stock market has gotten way ahead of reality. And you can see this in valuation metrics is that the ratios of these companies are so far beyond historical norms that one of two things have to happen in my view to come back into balance. One is the part of the market that I study. like nobody should ever take trading advice from me. If you knew how poorly I trade, you would know that I...\r\n\r\n\r\nI actually hope not someone you should take training advice from. But one of two things had to happen. The stock market should correct and sort of recognize that there was a problem in the goods economy and the broader economy and the employment picture is getting much more murky. And we'll see the valuations come down or we see an acceleration in the goods economy where all of a sudden these stress parts of the freight market construction comes back, manufacturing comes back. We start to see this sort of\r\n\r\n\r\nresurgence in those parts of the economy to where we are sort of on sort of the second leg. And I think it's more than likely that the stock market corrects before we see a return to activity simply because there isn't a great reason to think that we're going to have this massive demand stimulus hit the goods economy.\r\n\r\n\r\nNikolas Hulewsky (19:17.454)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (19:28.793)\r\nWell, I mean, to your point, we've seen multiple revisions now to the jobs reports, like multiple months worth of revisions. it's.\r\n\r\n\r\nCraig (19:36.781)\r\nthe whole year, we effectively, I mean, they wiped out a million jobs at the BLS said we were there that's, you know, I always looked at this jobs day, because that was always the rebuttal that every economist who I've ever spoken with would rebuttal, but jobs, like you talk about how bad the economy is like, yeah, but the jobs market is so strong. And you're like, I great for you. Like, I don't know, I don't see that the great that it is in reality, those numbers were not accurate. Now.\r\n\r\n\r\nwe could argue about whether it was manipulated or not, but it just isn't accurate. there was a day we stayed in jobs.\r\n\r\n\r\nNikolas Hulewsky (20:08.025)\r\nAnd not even to get too wonky, but A, it wasn't accurate, and B, if you look at the participation rate, which if you don't know this, the way that they measure unemployment is those who are what they call actively looking or employed. So if you're a 35 years old man and you're like, I'm not looking anymore, they don't consider you to be unemployed. You're out of the workforce from their calculations. And so the participation rate,\r\n\r\n\r\nCraig (20:30.329)\r\nYep. Yeah.\r\n\r\n\r\nNikolas Hulewsky (20:35.255)\r\nwhich measures people who are either actively employed or looking for a job has actually dropped pretty significantly over time. So even by citing like, well, unemployment's only at 4 % or 5%, whatever the number is, it's not really a true indicator of where we are from a full employment perspective, which is weird. So you've got the consumer economy, which is kind of in the, not kind of in the dumps, which is obviously slowing. And then you've got this other side of things where Trump just signed this executive order where, we're only going to have trucks made in America.\r\n\r\n\r\nCraig (21:05.197)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (21:05.636)\r\nAnd so it's like freight's kind of just getting hit from both ends of it.\r\n\r\n\r\nCraig (21:09.465)\r\nWell, freight is a commodity. Freight's driven by demand. And what drives demand is economic activity, consumer spending number. The freight market's pretty murky. It's hard to get an exact estimate on how much is consumer-related, goods purchasing versus manufacturing. But let's say that the consumer portion of the freight market is 60%. 40 %\r\n\r\n\r\nNikolas Hulewsky (21:20.985)\r\nMm-hmm.\r\n\r\n\r\nCraig (21:39.055)\r\nis left over in housing, manufacturing, energy, agriculture, all this other stuff that sort of makes up our economy. And the 40%, the non-consumer stuff, is the stuff that's really doing poorly right now. The 60 % is doing okay. And I think it's important to note that that's one of the reasons I think Wall Street has not sort of figured it all out, is that the consumer side of it is okay.\r\n\r\n\r\nIt's okay, it's not great, but it's okay. You can see it even in our data, you can see it. So it's the 40 % that's concerning part. It's the manufacturing, it's the energy market, it's the auto sector, it's that other stuff that actually drives the backbone of our industrial economy is not doing well. Housing is a great example, auto, all of those things are actually the parts of the economy that are the stress. those industries employ 35 million people.\r\n\r\n\r\nSo it's a massively important part of our economy that is just not doing well. And you can look at farmers in terms of like, a lot of them have lost their export markets. So that's also a stress market. Manufacturing, even though industrialization or reindustrialization was supposed to bring manufacturing here, a lot of companies are not willing to take and put big cap X into\r\n\r\n\r\nNikolas Hulewsky (22:38.275)\r\nJeez, man.\r\n\r\n\r\nCraig (23:04.451)\r\nbuilding new production plants because they can't predict what the administration's policies are.\r\n\r\n\r\nNikolas Hulewsky (23:08.857)\r\nLet me ask you this. Here's a stat that I did a lot of research on recently. It might blow your mind. So you've said it a couple of times. 35 million people are employed by those industries, the 40 % of the shipping market. Did you know that there's about 30 million, give or take a couple million, government employees in the United States? Like federal, state, local, army, like that's not even the contractors. That's just people who are employed by state and local governments.\r\n\r\n\r\nCraig (23:37.042)\r\nYeah. No, and it's like a two to one. Like if you look at the contractors to employees, it's even a bigger, it's like a bigger number, right? It's like for every job, it's like, it's, it is insane. And that's been the backbone of our economy really since the financial crisis is so much of the growth and GDP has been government led spending of some sort. And we never really as an economy, yes, we've recovered from the financial crisis because you can see it in the number.\r\n\r\n\r\nNikolas Hulewsky (23:44.345)\r\nIt's insane. It's insane.\r\n\r\n\r\nCraig (24:05.551)\r\nBut structurally, what's happened is the printing press has been helping sort of drive it. And the issue right now is we have this massive hangover that's caused by a combination of sort of the printing press that started in 2008 and 2009, quantitative easing, and you get into COVID level stimulus. And there just isn't the appetite.\r\n\r\n\r\nlargely for political reasons and maybe economic ones as well, but certainly political, to just put another stimulus package. And that's the big issue here is that no one's gonna come rescue us anymore. And so I think the assumption everybody would make is in the past where there's been significant economic downturn is you could expect either the Fed or Congress or the, you know, when somebody empowered to print money,\r\n\r\n\r\nwas gonna come in with a printing press. that's just not happening this time around. And so, because they're so disconnected, they don't think there's a problem.\r\n\r\n\r\nNikolas Hulewsky (25:06.041)\r\nThanks.\r\n\r\n\r\nLet me, let me ask you this because sometimes I get down to rabbit hole where I'm like, yeah, this is freaking crazy and just start talking through it. And I don't get to the, what part of it, if you, I'm talking about small business owners, I'm not necessarily talking about the massive corporations, but you know, entrepreneurs who are, just trying to figure out their own business. They might be listening to this and be like, well crap, nothing I can do about the freight market. If you were a small business owner, what would you be doing to prepare?\r\n\r\n\r\nfor the next six months, year.\r\n\r\n\r\nCraig (25:39.151)\r\nWell, I think a lot of small business owners are already doing this. But I think if you're not doing this, you should be doing it right now. I was told this a long time ago, a mentor told me, is you can't control your revenue, but you can control your cost. And I think one of the things that you learn running businesses, whether big or small, and you certainly see it in big businesses, is they always do layoffs. And everyone loves to attack those decisions, big corporate greed laying people off. But\r\n\r\n\r\nif you're running a small business, even if running a big business, we've seen so many cases of businesses that end up filing bankruptcy because they didn't take corrective action early enough. And the whole thing is about extending your runway. And I think you can over-correct. think we should take sort of Elon Musk's playbook and realize that what Musk has said is that he wants to run the leanest company, one of the leanest companies he can run. And\r\n\r\n\r\nwhen he bought X or Twitter, guess he bought Twitter and turned it into X, you he cut more than 10%. Like he went and I mean, he cut like 60 % of the staff, 70 % of staff, but his whole goal is to go 10 % too far. And he actually says this, he's like, I want to go so far that I call so much pain that I can just pull it back just enough. And so he's like, I want to go 10 % too far. And I think as a business owner, you, you almost have to approach the same thing because\r\n\r\n\r\nYou can't control the market. You can't control your revenues in a down market. And no matter how much we all try to engineer revenue growth, we're still a slave in some ways to the market conditions. Those are well outside of our power. And so if you know or believe that we're headed into a much more significant slowdown, and I don't know if it'll be deep, I don't know if it'll be soft, I don't have a perspective on what this means for the broader economy. I can tell you where we're at right now on freight.\r\n\r\n\r\nIf that plays out to the broader economy, it's going to be painful. And if it's painful, then it means businesses, you know, most businesses run with a degree of fixed costs and a high level of variable cost. And that's that fixed cost portion that you really want to have control over. And you should be looking and evaluating those resources as soon as possible. all, having ran businesses before, you know, currently as well as before.\r\n\r\n\r\nCraig (27:59.983)\r\nevery single time in every business I've ever bought, every owner I've ever talked to, we all have things that are costs that we know exist, that for whatever reason we did not take out. Maybe it's, you know, we really like these people that we're, you know, we're gonna have to sacrifice these jobs or perhaps it's a piece of software that's a piece of luxury, perhaps it's like we all have things that are frankly a little bit of waste that if we're honest with ourselves,\r\n\r\n\r\nNikolas Hulewsky (28:12.185)\r\nYeah.\r\n\r\n\r\nCraig (28:29.955)\r\nWe should go ahead and reduce those. And that's what I would do now, if you're facing this issue, is go ahead and prepare for that.\r\n\r\n\r\nNikolas Hulewsky (28:37.465)\r\nWhat about somebody who's looking at this and saying, I want to go on the offensive either now or when the market continues.\r\n\r\n\r\nCraig (28:43.055)\r\nWell, this is an opportunity because anytime you see a market as stressed as what we're in right now, or could potentially headed into, and if your logistics certainly stressed, is this is a time you should be acquisitive. look, in my own, I'm sorry, I mean, even in my own life, I'm looking, I'm talking to other companies of similar scale to my media business and saying, hey, you know, we've had conversations with some of these founders and owners. Should we be thinking about potentially putting our business together?\r\n\r\n\r\nNikolas Hulewsky (28:53.911)\r\nWhat are you interested in right now? Yeah, go ahead.\r\n\r\n\r\nCraig (29:11.791)\r\nCan we eliminate some of the shared services we have across our businesses? Can we eliminate some of the back office? We have duplicate software systems. Perhaps we don't need that. Perhaps we don't need as big of an accounting function, a back office function, if we consolidate. Hey, you're really good at these things. I'm really good at these things. Put them together. All of a sudden, we get the best of both worlds. Those are conversations that, frankly, times like this are catalysts. Because when business is good,\r\n\r\n\r\nFirst of all, you think your business is worth a lot more than it really is, if we're being completely honest, everybody does. That's natural, right? You think you're a lot better than you really are. You don't really know your problems until the business starts to suck. And then you're like, okay, we have to admit we suck. Let's suck a little bit less every day, but we didn't, like just admit we suck at, just suck. And our suckery is going to get a little bit less every day. And when you're running a business, when things are good, you tell yourself that it's all you. You're like,\r\n\r\n\r\nNikolas Hulewsky (29:38.747)\r\nYeah, yeah, yeah, yeah.\r\n\r\n\r\nCraig (30:04.843)\r\nam awesome. I am so good at this. It's so easy. And then the market changes and you're like, my God, I a, like I suck. And you're probably in between those, but let's be honest, a lot of businesses suck. think Mark Zuckerberg has a great quote. I believe it was when he was first starting Zuckerberg, Peter Till told him, he's like, hey, your business is gonna suck. But as founder, you get to decide where it sucks at.\r\n\r\n\r\nAnd he's repeated this and he's right. Like all of our businesses suck in some ways. And this is an opportunity in a down market where you get to evaluate those things that are important. You get to prioritize it. We've done it this year. You know, we came in this year really bullish in our media business, incredibly bullish. And we actually bought our largest competitor in the marine boating space, magazine space last year.\r\n\r\n\r\nAnd in doing so, were thinking, there's gonna be, and we did diligence, we talked to the market, it was a lot of bullishness, and we thought we would get a nice tailwind in the boating business. But the boating business was one of those industries that has been under a lot of stress this year. Tariffs have been a major impact to it. And one of the things to keep in mind is the boating advertising, the media, because we're an advertising business in many ways, the advertising season is really March through Memorial Day.\r\n\r\n\r\nNikolas Hulewsky (31:15.139)\r\nMm-hmm.\r\n\r\n\r\nCraig (31:27.823)\r\nIf you don't have your campaigns by April, you haven't booked, March to June, I'm sorry, because people aren't buying boats in August. And so if you don't have that bookings by Memorial Day, then you're pretty much done. 60 % of my marine revenue takes place from March to Memorial Day. And think about that in 2025. That was right at the peak of liberation day. so the problem is,\r\n\r\n\r\nNikolas Hulewsky (31:34.52)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (31:49.465)\r\nThat's nuts. Yeah. Yeah, yeah, yeah.\r\n\r\n\r\nCraig (31:53.839)\r\nOur boating advertisers are all, a lot of them are imports, particularly the higher end markets. And this is what I thought when we were buying the marine businesses, hey, this will be insulated from a lot of the economic problems, because these old luxury yachts, luxury boats, they don't get impacted from the downturns of the economy. What I don't know that I appreciated is that Donald Trump's terror policy, which is different than certainly where even I was who studied supply chains back in November, I'm not an astronomer, obviously, at this point I've proven.\r\n\r\n\r\nI bet I'm a fraud at predicting things. I thought all of his sort of trade would be directed at China and we wouldn't see sort of the pressure on the rest of the world. wouldn't see. And so what happened to us is, know, 60 % of our marine revenue, which is half our total revenue, you know, 30 % is really confound in that three month period. And we've effectively lost that whole season because\r\n\r\n\r\nNikolas Hulewsky (32:43.161)\r\nCratered.\r\n\r\n\r\nNikolas Hulewsky (32:48.569)\r\nCheers.\r\n\r\n\r\nCraig (32:49.059)\r\nCompanies were like, I don't know what's gonna happen. So they always pull back and I would say every business owner should consider the same. I'm not trying to talk people out of advertising, but when you have so much instability, the first thing you do is just sort of cut your discretionary spin. unfortunately for a lot of media businesses, advertising is discretionary. And so we lost a lot of, we lost millions of dollars of potential revenue, not because they went anywhere else, but because they simply put their campaigns on hold.\r\n\r\n\r\nwaiting to see where the tariff thing would happen. And so we've been forced to make, you know, look at our own business. We've been forced to evaluate our own cost. We've made some pretty substantial reductions in staff levels. But we've also said, hey, some of these titles that we own, we own 61 some odd titles. I think we've cut six this year. We said, look, these aren't making money. We probably should have addressed them two years ago. But now we have to address them because we're just not good.\r\n\r\n\r\nNikolas Hulewsky (33:44.931)\r\nHow's freight waves doing? Freight waves is growing like crazy. Or sonar.\r\n\r\n\r\nCraig (33:47.747)\r\nWell, freightways on the media side is, know, freight sucks, right? Like it's top business. so advertising is naturally down. One of the sort of surprising things is we have a physical events business that is actually doing well, which I am really surprised by in spite of, or despite all the sort of challenges, our events business is doing really well this year and is up from last year.\r\n\r\n\r\nNikolas Hulewsky (33:53.111)\r\nOkay,\r\n\r\n\r\nCraig (34:17.195)\r\nadvertising's down, unfortunately. A data business, I would say, is holding its own. So, it's weird, because I've never been in more demand on my expertise. So I'm busier, but in some ways I feel like I'm on a treadmill where I'm just doing a lot of work and providing a lot of contracts, but my business itself is struggling from what every other business is, which is,\r\n\r\n\r\nNikolas Hulewsky (34:28.695)\r\nYeah, yeah.\r\n\r\n\r\nCraig (34:45.987)\r\nsort of wheat market conditions, which are outside of my.\r\n\r\n\r\nNikolas Hulewsky (34:48.611)\r\nWell, I you probably know this. Many of the biggest companies today, maybe not many, a lot of big companies today were founded during the 2008 financial crisis. And in fact, a lot of big companies today were founded during 2020 COVID. So we see this cycle where during recessions, many big companies kind of find their footing. point number one.\r\n\r\n\r\nCraig (34:58.434)\r\nAbsolutely.\r\n\r\n\r\nCraig (35:07.915)\r\nI mean, look, I always loved the stories, Nick, and I'm gonna interrupt you, but I always loved the stories of the super successful businesses where they had near-death experiences. And it wasn't the earliest days where the founder did something. It was like they were actually, know, upscale. I think the story of Dell Computer having, know, Michael Dell having to sell off furniture just to survive, and the founder of BET also basically running out of money, and I think John Malone came and bailed him out.\r\n\r\n\r\nNikolas Hulewsky (35:11.501)\r\nNo good.\r\n\r\n\r\nCraig (35:37.945)\r\nYou know, even Walt Disney, like, had to go when he was building Disneyland or Disneyland was running, he was running out of cash. He went to the hotel owners around Disneyland and basically said, hey, I can't pay my bills and begged them to bail him out and they did. I love those stories because it just shows that two things. One is it shows resilience. If you don't give up, it's very hard to put you out of business no matter what. And the second thing is that\r\n\r\n\r\nNikolas Hulewsky (36:02.146)\r\nYeah.\r\n\r\n\r\nCraig (36:05.007)\r\nIt also shows that nothing is perfect in life. Like FedEx, Fred Smith went to the black deck tables to make payroll. These are the great stories that I think shapes founders and the founders that can navigate those things are in much better positions than this.\r\n\r\n\r\nNikolas Hulewsky (36:21.475)\r\nSo here's my question. forward to the next six, let's say there is a recession at some point in the next year, year and a half. If you were maybe an entrepreneur who didn't have your current business, because I don't think you want to be distracted from what you're currently doing. Where do you think the opportunities are going to be? Which markets do you see softening maybe the quickest or the most that would be really interesting for entrepreneurs to take a look at starting a business or buying a business so that when coming out of this, we know there's going to be demand because\r\n\r\n\r\nConstruction's not going away. Retail's not going away. Shipping and logistics is not going away, but there will be a recession. So some of these assets kind of will be on the cheap, so to speak. Where would you be looking?\r\n\r\n\r\nCraig (37:01.347)\r\nYeah, I I think generally the rules of buying a business apply in any economy. Valuations drop tremendously and sort of opportunities open up much more so on the buy side than they do on the... When the market's soft is actually when you get your greatest opportunities. Because there's actually some great businesses, high, know, businesses that can cash flow that perhaps...\r\n\r\n\r\nif you made some corrective action, how often, so I don't know sector specific, because this applies in generally every sector, right? But how often have you looked at a SEM from a prospective seller of a business, and you're like, man, I can go and cut.\r\n\r\n\r\n30 % of the cost out or how often has, if you looked at a business and be like, why do they run it this way? Or I could grow it. think, and so from my perspective, what happens in these down markets is that you end up having opportunities.\r\n\r\n\r\nthat would not be available otherwise. Airbnb is a great example of this. mean, Brian, you talked about it founded in the 2008 recession and the financial crisis. They also, it felt like we're gonna file bankruptcy during COVID. I mean, the idea of having strangers come to your house and look, they raised, think $5 billion from Silver Lake. And I think it was one of the greatest investments in Silver Lake's history was buying into Airbnb right at the\r\n\r\n\r\nNikolas Hulewsky (38:14.623)\r\nSo crazy.\r\n\r\n\r\nCraig (38:28.763)\r\nfront of COVID and that thing went on a tear. And so one of the great things is everything reverts back to the mean. And so this is sort of the rule of business is when things are really hot, things are super inflated, eventually come back to earth. And when things are really bad, Warren Buffett has made a history of buying exceptionally great businesses or large positions in businesses and the worst of times. And he bought Southwest Airlines at the peak of COVID. And so\r\n\r\n\r\nNikolas Hulewsky (38:52.537)\r\nyou\r\n\r\n\r\nHe bought Bank of America at the peak of the 2008 crisis.\r\n\r\n\r\nCraig (38:57.773)\r\nHe bought Bank of America in the financial crisis. He bought American Express during the financial crisis. I think it may have been Goldman Sachs he also took a large position in.\r\n\r\n\r\nNikolas Hulewsky (39:05.709)\r\nWell, what I was going to say is like you said, you look at these Sims and you're like, I could cut here, here, here more. What I've been looking at is they think the business is valued at what that's I could take that same amount of money and go start a competitor. I think where the opportunities as well happen, especially if you're a business owner is during these downturns, your competitors are going to be struggling and you can go and steal their best people. Like you can, if you're building relationships, go and find people who are at the\r\n\r\n\r\nCraig (39:25.688)\r\nAbsolutely.\r\n\r\n\r\nCraig (39:29.155)\r\nWell, there's that true, but Nick, here's the problem right now, at least according to the data, is that people are reluctant to leave jobs. Quit rates are at some of the decade lows because people are so nervous about the economy that quit rates, people going from one job to the other, people are staying put. I see it in even our businesses where...\r\n\r\n\r\nNikolas Hulewsky (39:41.251)\r\nReally?\r\n\r\n\r\nCraig (39:53.161)\r\nknow, two, three years ago, was hard, it felt like it was hard to hold on to people because people found so many opportunities elsewhere that may have gone and started a business. And now it's the opposite effect where the...\r\n\r\n\r\nyou end up with almost people who may would go other find another job that aren't leaving. And not that you want them to leave, but you also want to make sure they're happy. they're of just like staying a little frustrated with things. so I think, like, I think the best opportunity is going to come to look at businesses when markets dry up, it's when businesses, when founders get, they may have taken too much risk.\r\n\r\n\r\nThey may not have a backstop for financing. That's when the opportunities open up. And a lot of it's circumstantial. I mean, you can have a great business that generates cash, it generates nice EBIT, but for some reason, the founder doesn't have a capital source or resource and all of a sudden the debt comes due, they're out of compliance with covenants. That's where the best opportunities come.\r\n\r\n\r\nNikolas Hulewsky (41:04.761)\r\nLet's do some prognosticating really quickly, since we had so much fun the last time. Where do you think things are by Christmas? Let's talk, like, it is.\r\n\r\n\r\nCraig (41:12.735)\r\nI think it's going to be worse. I think it's going be a really rough holiday season. I think by then, people, a lot of the noise and the data will become much more relevant for people. And I think, like, my view is the stock market is more likely to come down than go up. And I think we might, in a pretty substantial correction by the end of the year.\r\n\r\n\r\nNikolas Hulewsky (41:35.097)\r\nOkay, next. Oh, I'm not. We said that, we already said that.\r\n\r\n\r\nCraig (41:36.983)\r\nAgain, don't take stock trading advice from me. I'm a freight guy. just telling you all, I'm telling your listeners, not like, like don't listen to me about stock trading advice, but that's my personal view.\r\n\r\n\r\nNikolas Hulewsky (41:47.705)\r\nYou know, you know who Nassim Taleb is where he talks about the black swan events What's interesting is that yes, there are black swan events But for people who are paying attention that they're like no I saw this coming because this was in this data for you What would be the Lehman Brothers? level equivalent not just bankruptcy, but just financial moment in I Guess in the economy that you would might expect to see over the next six months that kind of would change the dynamic\r\n\r\n\r\nwe're seeing. you think it's a slow trickle or do you think there's a moment that's going to come where maybe one large company goes\r\n\r\n\r\nCraig (42:21.679)\r\nI think it's already there. like, is there a catalyst for, because Lehman and Bear Stearns, you could see it in the data, like, you could see it in the freight data six months before. And you could see some of the stress in the housing market. I mean, I remember back in 2003, talking about how stretched home values were, and it didn't, we didn't all collapse in 2007. So, you know.\r\n\r\n\r\nLike I don't know what is the catalyst. You're asking a broader question. Again, I'm a freight guy. And I studied the goods economy. what I can't understand is how are we in a situation where every facet of the goods economy is showing stress, even consumer, it's doing well relative to the other parts of it.\r\n\r\n\r\nBut there's a lot of signs of consumers really starting to lose momentum. The job market is starting to become stressed. Some of the broader sectors, it strikes me that we're already in the middle of whatever's coming. Wall Street hasn't woken up to it, and no one else has in Washington.\r\n\r\n\r\nNikolas Hulewsky (43:34.871)\r\nIs that your feeling? It's like, we're in it. It's not like.\r\n\r\n\r\nCraig (43:36.983)\r\nYeah, I'm already in it. I I had a conversation with a very high net worth person who's made $15 million in the stock market in the last, I think, two months, they told me. And I'm like, dude, you should think about getting out. he told me when I spoke with him, he's like, thanks for calling. Because I'm like, hey, are you seeing this data? Because I knew they were highly leveraged. And his comment to me was, well, thanks for calling. I've been thinking about rotating out anyways.\r\n\r\n\r\nNikolas Hulewsky (43:48.089)\r\nJeez.\r\n\r\n\r\nCraig (44:04.559)\r\nlargely for fear of margin calls that were gonna hit. He had rolled the whole thing up and he thanked me. was like, look, you're gonna be able to rotate out, like you might miss some of the upper end of the AI revolution. Like maybe there's another 5 % or 10 % to go in AI stocks.\r\n\r\n\r\nNikolas Hulewsky (44:18.7)\r\nUh-huh.\r\n\r\n\r\nCraig (44:23.823)\r\nOver the next six months, but you're be able to rotate in these other sectors that have been beat down I mean the transports alone are trading at great financial crisis GFC level There's five prices. I mean UPS is stock prices. I think is as low as it's been in eight years These businesses aren't gonna go away. It's gonna revert back to\r\n\r\n\r\nNikolas Hulewsky (44:35.502)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (44:43.865)\r\nWhat would be the leading indicator that you would see it turning back positive? Is it just the OTBI data or is there any, I'll demand.\r\n\r\n\r\nCraig (44:49.799)\r\nIt's all demand. It's all demand. And so you would want to see a greater demand in the market. And I think if we are able to see greater demand in the market, that's when I would think things would come back. And you'll be able to pick up. I mean, these stocks have been beat up so...\r\n\r\n\r\nsubstantially, the parts of the economy I'm referring to specifically in freight transportation, so substantially that these institutions are not going away. UPS is not filing bankruptcy. it is not, UPS is a business that will be around for another couple of decades. And I talk about UPS's history in my book. know, UPS has been around since 1900s, the early 1900s. I mean, it was a business that's been built over, well over\r\n\r\n\r\nknow, 120 years, a century plus old, it is the backbone of so much of our economy, e-commerce, it's not going away and you can get the thing on sale. And so that's what I think is gonna be great is even if you rotate out of your highly speculative stretch positions in AI and technology, there's a lot of opportunity that's waiting for you in the other parts of it, because they have not followed the broader market up.\r\n\r\n\r\nNikolas Hulewsky (45:59.001)\r\nYeah, one book that kind of changed my thinking. I didn't read the whole book, but what's his name? He used to be an economic advisor to Peter Navarro. Peter Navarro wrote this book, something about being a winner. And what he talked about in that book was if you own a business and you're running a business, you just need to be generally aware of the economy and the levers that move the economy. So what is the federal funds rate? Or, I mean, one thing we didn't talk about is that the yield curve has been inverted for, think, like the law.\r\n\r\n\r\na really long period, think almost two years, it might've just reverted back, I'm not sure. Anyways, he just talks about, be aware of what's going on. And I think these kinds of conversations sometimes as an entrepreneur, you think like, well, what does that really matter for me? When you are a boat in the ocean, you should know when a storm is coming and you'd much rather be on a large freight ship than a dinghy. And so get prepared.\r\n\r\n\r\nCraig (46:48.621)\r\nIt's also like if you're on the ocean, using that example, and there's a tropical storm building, could be a hurricane, you wanna move out of the way. Like you don't have to have the big boat, but you certainly can move your boat away from where the action is. So going back to what do you do as a founder or an entrepreneur, if you know that there is a chance, like it's not zero, it's not 100%.\r\n\r\n\r\nNikolas Hulewsky (46:58.029)\r\nYeah, right. That's true.\r\n\r\n\r\nCraig (47:13.527)\r\ndepends on whether you believe that the goods economy, the stuff that moves freight, I can tell you unequivocally, this is not just my data, it's cast, it's the reports from the big trucking companies, it's the reports from companies like UPS and FedEx, everybody is seeing lower and lower volumes in freight, which means freight is not moving, therefore goods are not moving through the economy. That is a fact.\r\n\r\n\r\nGoods economy, the mainstream economy is slowing down. That is unequivocally true. Like that is not a, that's not an opinion, that's fact. The economy, the goods economy is slowing down. The question that you have to now ask yourself if you're a founder, should that matter to me? And the question then becomes if the goods economy, if the mainstream economy is slowing down, it's gonna mean likely job losses.\r\n\r\n\r\nNikolas Hulewsky (47:41.517)\r\nYeah, it's not a debatable position.\r\n\r\n\r\nCraig (48:01.805)\r\nAnd it's gonna mean likely other types of stresses, potentially bankruptcies. It's going to mean potentially banks start to get really nervous about lending money. And so if you know this stuff is happening and you still have not felt the pain, because remember, if you're a small business owner, you're selling to the people that are being impacted. Like, if you're selling a consumer product, there are people who are buying these products that are personally being impacted.\r\n\r\n\r\nIf you're selling luxury goods, they may have businesses in these sectors. If you're selling products to consumers, say you have a bodega or a small little retail shop, you're going to find that some of the consumer disposable income is drying up because the people who have work in these sectors are not able to buy your products. you're selling e-commerce, it's all of that. And so all these businesses are being impacted. And if you're in B2B, a lot of B2B businesses are not lucky enough to sell to Meta and Google.\r\n\r\n\r\nyou're selling to, you know, the local cleaning service that cleans this building is selling to other businesses in transportation. And so if that business is being impacted, discretionary spending of all sorts are being evaluated. I mean, we look at every dime, we're looking at every dime right now in our business. And even the most, what seems like an innocuous $300 spend, mean, you know, combined between the two businesses,\r\n\r\n\r\nIt's an $80 million business. $300 are getting looked at. That seems like an $80 million business and I'm worried about a $300 I spend. It's because every dime matters right now because until we have, until we are comfortable that we're out of the storm, if you will, then every dime matters. so businesses like mine and more will continue to look at those things that will have an impact on your.\r\n\r\n\r\nNikolas Hulewsky (49:55.779)\r\nSo in 2008, that was when I got married. And there was this thing in 2008 on Netflix. I can't remember the name of the documentary. I think it was called Peak Oil. But there was this idea that at some point we would deplete the oil reserves around the world. And the point of the documentary was that if we depleted those oil reserves, then the price of oil is going to go way up, which then means the price of shipping and distribution and transportation and energy is going to go way up. And it's going to cause just massive recession, depression level.\r\n\r\n\r\nevent around the world. And at the time I was like, my gosh, and bought into it a hook line. Do you?\r\n\r\n\r\nCraig (50:31.311)\r\nI remember this. I may remember this from the but I Bake Oil, yeah.\r\n\r\n\r\nNikolas Hulewsky (50:36.529)\r\nyeah. Yeah. I mean, it was a thing and like, it makes logical sense. You're like, well, it's a, it's an, it's a non-renewable asset. So I guess at some points got to play. But the thing that always stuck with me from that experience was the like aha moment of, yeah. How did the eggs get to the grocery store? How does the furniture get to Walmart? How do you know, how do these goods move throughout the economy? And that was like a big realization for me. And you, you wrote this book recently, which is, let's see, I'm reading the title, moving the world forward.\r\n\r\n\r\nCraig (50:52.335)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (51:05.677)\r\nwhich talks about the supply chain.\r\n\r\n\r\nCraig (51:07.405)\r\nYeah, so it's moving the world and it is about the supply chain and we're certainly moving it forward, it is all about the supply chain. And it's meant to be a primer. It's not meant to go too deep in any one topic. mean, that's the problem of the supply chain is that, I mean, like anyone who is in supply chain, because I found out, like when I was doing a bunch of research for it, there were things I had no idea about. Like even trucking, which is sort of parse and parcel things that I do and I would put myself up.\r\n\r\n\r\nNikolas Hulewsky (51:32.259)\r\nReally?\r\n\r\n\r\nCraig (51:36.975)\r\nIf it was a trivia contest or a debate about trucking, I would put myself up against anyone. But there were things about trucking that I had no idea about. And I'm like, my god, this is so interesting. And so the supply chain is so broad. This is meant to be a primer. And the reason I wrote it was that oftentimes when someone becomes interested in supply chains, maybe they've joined the industry and they're just trying to learn, or perhaps they've become intrigued for some, why does a ever...\r\n\r\n\r\ngetting stuck in the Suez matter and this is kind of cool I want to learn more about it. There just aren't a lot of books to recommend that sort of cover it all and I meant what I was trying to do is sort of interconnect all these pieces and write effectively a primer on how we got here. How did this stuff evolve and how do we get here?\r\n\r\n\r\nNikolas Hulewsky (52:26.819)\r\nIt reminds me, could my kid read it? what level is it written for? Okay.\r\n\r\n\r\nCraig (52:29.271)\r\nYeah, absolutely. It's meant to be an easy read. I mean, I wrote it. I'm not a... It can't be that. The vocabulary... Now, it may be a little bit technical for... But yeah, it's meant to... You can't get rid it. How'd your kid?\r\n\r\n\r\nNikolas Hulewsky (52:42.348)\r\nMy oldest is 11, I think you'd be really interested in this book.\r\n\r\n\r\nCraig (52:44.545)\r\nYeah, I mean, he definitely I'll send a copy. So.\r\n\r\n\r\nNikolas Hulewsky (52:47.353)\r\nWhat's interesting is like I've met certain people on Twitter and they're authors and I'm like, that's cool. I think my son might be interested. I had somebody send me a book last week and or no two weeks ago and I got it I just set it on the pool table because I was like, like, my son's not going to read this. And I come a week later and he's on the couch. He's like, dad, where did you get this book from? And it was like it's supposed to be a kid's book about entrepreneurship. And I totally forgotten about it. He's like, this is amazing. I'm going to read this twice. Do you know how to sell hot dogs? So and he like got all excited about it. And I\r\n\r\n\r\nCraig (53:12.687)\r\nYou\r\n\r\n\r\nNikolas Hulewsky (53:17.399)\r\nIt was almost like the bigotry of low expectations. I'm like, I need to start letting you actually learn about things.\r\n\r\n\r\nCraig (53:22.575)\r\nYeah, I mean, like, I don't know at an 11 year old, would you be interested in how all this stuff connects? Potentially. Like, it's not, I'm in supply time and freight. You're either into it or you're not. It's sort of like other types of reading historical books or books on the economy. If you don't have a natural curiosity, I don't know that I'm going to change your perspective there because there is a lot of history in it. And so.\r\n\r\n\r\nNikolas Hulewsky (53:45.625)\r\nYou\r\n\r\n\r\nCraig (53:50.479)\r\nBut I certainly could send you one. I will not be offended if you didn't pick it up. I mean, look, it's meant to be a primer. meant for people who are interested in sort of how we got here.\r\n\r\n\r\nNikolas Hulewsky (54:00.057)\r\nThat's awesome. right. Well, best place.\r\n\r\n\r\nCraig (54:01.667)\r\nI'm not selling hot dogs, I'm not telling kids how to sell hot dogs, which is frankly probably cooler for an 11 year old than learning about how the railroads came about. you know what is so cool about the story that's in the book and the stories that are in the book is just the entire foundation of our modern society is tied to how all this stuff happened. mean things we don't even think about, the railroads and the western expansion. I mean here's the crazy thing that I discovered when I was writing it.\r\n\r\n\r\nNikolas Hulewsky (54:06.786)\r\nIt was-\r\n\r\n\r\nCraig (54:30.867)\r\nis that prior to the railroads, and this is gonna seem obvious now when I say it, but prior to the railroads, all the population was along the coasts. Like all of the US population was East, so we would look a lot like Australia as a country if it wasn't for the railroads. The railroads allowed for Western expansion. They allowed us to take advantage of the Midwest. It allowed for those things, which would not have been possible if it hadn't been for the railroads.\r\n\r\n\r\nNikolas Hulewsky (54:47.321)\r\nMmm.\r\n\r\n\r\nCraig (54:58.841)\r\nI mean, the Mississippi provides an enormous lifeline and you could have some population along the Mississippi, but the heart of America, sort of the heartland, would not exist if it wasn't for the railroads. I the railroads had such an impact on the way our country came about. mean, the city of Atlanta was a railroad hub. Like it literally was created by the railroads, yeah. It was the Atlantic railroad that created Atlanta. And it was actually because,\r\n\r\n\r\nNikolas Hulewsky (55:19.961)\r\nWas it really?\r\n\r\n\r\nCraig (55:27.961)\r\nThey were trying to build a rail line from Savannah, Georgia, the port in Savannah to Chattanooga, Tennessee, where I'm at, where the Tennessee River comes down. And they created basically a terminal in just BFE Georgia that did not exist, like one little terminal there. And that created the city of Atlanta, which is a, and it was in the middle of it. It was away from the mountains. so that's how Atlanta came about. I just think that stuff is fascinating.\r\n\r\n\r\nNikolas Hulewsky (55:45.241)\r\nYou\r\n\r\n\r\nNikolas Hulewsky (55:57.369)\r\nDude, that is fascinating. Cause you don't think about how cities were founded.\r\n\r\n\r\nCraig (56:00.505)\r\nYou know, one of the other fascinating stories is the story of the air condition. I know this seems like a really boring, but I did this whole thing on the heat pump and the revolution that is refrigeration. Like, I know this is like really a weird fact, but one of the interesting facts was the second largest, I'm gonna ask you a question. So the number two export of the United States in the 1800s, do you know what that was?\r\n\r\n\r\nNikolas Hulewsky (56:14.817)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (56:29.209)\r\nThe number two, would have guessed tobacco has got to be in the top five. Beyond tobacco, timber.\r\n\r\n\r\nCraig (56:31.799)\r\nThe 18th century.\r\n\r\n\r\nCraig (56:39.245)\r\nYou probably have consumed it today, but you don't think anything about it. The number two export. And it would not make the list of top 20 today, but you consumed it today. Natural ice. The United States used to export ice to Europe. They would go and they would just take these big chunks of ice. You've seen frozen, right? They're going, they're like chipping away at the ice and bringing it. That's exactly what they used to do. And it was the number two export in the United States.\r\n\r\n\r\nNikolas Hulewsky (56:46.573)\r\nI don't know. Egg? At me? Beef?\r\n\r\n\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (57:01.379)\r\nYeah, yeah.\r\n\r\n\r\nCraig (57:09.135)\r\nin the 18th century, and refrigeration changed all that. And so I went into, I found the refrigeration section so interesting because the way foods, like diets have come about is all based on geography. so one of the sort of, that was an interesting tip, but the other one I thought was really interesting is in Japan, they had outlawed meat, like it was illegal, it was a sin, but it was also illegal by emperor's decree for 1200 years to eat red meat.\r\n\r\n\r\nNikolas Hulewsky (57:27.171)\r\nYeah.\r\n\r\n\r\nCraig (57:38.923)\r\nAnd the reason was, they said it was religious, but it actually was economic, is that the land, because Japan can't develop a lot of crops in Japan. Only like 10 % of the island can actually have arable crops. And so you don't want land dedicated to livestock. You want land dedicated to growing food for humans. And so,\r\n\r\n\r\nNikolas Hulewsky (57:59.193)\r\nYeah, because the calorie per square kilometer is just not even comparable.\r\n\r\n\r\nCraig (58:02.337)\r\nExactly. so red meat was banned because it was refrigeration. It was that actually changed all that. So it's interesting because the same thing in Europe, the reason European diets tend to be heavy on protein and carbs is because that stuff could grow in Europe. And then all of a sudden you get refrigeration and now you can have fruits and vegetables from around the world. It's just...\r\n\r\n\r\nNikolas Hulewsky (58:24.995)\r\nWell, don't worry. We might nerd out on this. We could cut this part. But this is crazy to me. And like, I think it was the 16th century when Europe discovered chocolate and coffee. Like before the 16th century from the Americas, exactly. Like think about how ubiquitous that those two things are now. Well, and like Europe was like, this is great. We can get drunk the night before and then we can drink coffee in the morning to like wake us up.\r\n\r\n\r\nCraig (58:38.169)\r\nYeah, and the Americans.\r\n\r\n\r\nCraig (58:43.929)\r\nThe tomato too, the tomato. Like the tomato was like, yeah.\r\n\r\n\r\nCraig (58:53.561)\r\nThere's a great book about that, is like, I think it was the Irish safe civilization or something. And it was like, it was basically.\r\n\r\n\r\nNikolas Hulewsky (58:59.469)\r\nOkay.\r\n\r\n\r\nCraig (59:05.455)\r\ntrying to remember the whole premise of it. But you're right. was basically they were in the dark ages, the medieval date, they were all drunk because they couldn't drink water. And it was actually the caffeine from coffee that ended up waking them up. It gave them this big stimulus that allowed the Renaissance to come about. And credits, the whole credit thing is that coffee, the caffeine from coffee was the reason we had the Renaissance because before that they were all\r\n\r\n\r\nNikolas Hulewsky (59:12.877)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (59:24.589)\r\nThat is so freaking cool.\r\n\r\n\r\nNikolas Hulewsky (59:29.411)\r\nBut that wouldn't have happened without distribution and logistics going from what, yeah.\r\n\r\n\r\nCraig (59:32.929)\r\nNo, it's all tied together. But the refrigeration, so there's also the interesting, I think I cut most of this out of the book when I found this editing. It was this whole section on just the air condition and the impact to cities and how cities come about. You think about cities that could not, Phoenix, Arizona is a great example of that. Phoenix, Arizona as a city would not exist without air condition. Las Vegas, the South, the American South was a malaria infested because what would happen is in the heat, they would,\r\n\r\n\r\nNikolas Hulewsky (59:46.307)\r\nYeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (59:53.079)\r\nLas Vegas. Yeah.\r\n\r\n\r\nCraig (01:00:02.244)\r\nduring the heat of the day they would come inside and then on the and they would be on the outside and some malaria and stuff but with with air-conditioned you you you had the ability to sort of develop these entire cities.\r\n\r\n\r\nNikolas Hulewsky (01:00:13.977)\r\nSorry, my camera, I'm still here, my camera died.\r\n\r\n\r\nNikolas Hulewsky (01:00:23.737)\r\nsee if that. Sorry my camera died. I have a Sony and usually I don't ever.\r\n\r\n\r\nCraig (01:00:27.309)\r\nNo worries. You have a Nikon? Is that it? A Canon?\r\n\r\n\r\nCraig (01:00:35.457)\r\nOkay, because I think, is it a GLSR? So there's actually a reason for that. I read about this. So I had the same problem. I think it was a Nikon. But I Canon or Nikon has a patent. And the other manufacturers did not want to pay for the patent. And has something to do, there's something in there. But the camera will time out.\r\n\r\n\r\nNikolas Hulewsky (01:00:38.137)\r\nIt's like after an hour for whatever reason that I don't know if it like overheats.\r\n\r\n\r\nNikolas Hulewsky (01:00:58.425)\r\nReally?\r\n\r\n\r\nCraig (01:01:02.019)\r\nbecause some signal that comes into the camera will not let it go more than an hour. And I've read about it, because why does it keep doing this after an hour? And it's the DLSR cameras. has something to do. There's a patent of some sort that somebody owns. I Canon owns it or Nikon owns it, either one. And after an hour, it will just time out, and you'll lose camera. I had that same problem. I finally have an embedded camera, so I don't have worry about it anymore.\r\n\r\n\r\nNikolas Hulewsky (01:01:09.547)\r\nYeah, yeah, it would always do it to me.\r\n\r\n\r\nNikolas Hulewsky (01:01:24.493)\r\nI need to go. That's ridiculous. Well, dude, let's, we'll wrap this up. Freight waves, sonar, go find Craig. I mean, you do an amazing work. I love your content on Twitter because it's, literally how I understand the freight and logistics market. Your book is, is it out or is it coming out?\r\n\r\n\r\nCraig (01:01:42.767)\r\nIt will come out October 10th, so.\r\n\r\n\r\nNikolas Hulewsky (01:01:45.623)\r\nOkay, so by the time this is released, it'll be out. I'll include a link and people can go check it out. Okay, stay on for a second.\r\n\r\n\r\nCraig (01:01:49.113)\r\nYeah. Awesome.",
  "metadata": {
    "duration": "",
    "date": "2025-10-08",
    "platform_source": "Google Drive"
  }
}