{
  "episode_number": "26",
  "episode_title": "The Truth About Financing Your First $3M Business with Brian Seeling",
  "guest_name": "Brian Seeling",
  "business_name": "Commercial Kitchen Appliance Repair Company",
  "transcript": "﻿Hey, what's up guys. Welcome to another episode of Nikonomics. And on today's episode, we have Brian Sealing. He's the owner of a commercial kitchen appliance repair company. And if you keep listening, you'll figure out why that's so funny that I got the name right, but it's a company that he purchased only two months ago.\r\n\r\n\r\nSo while we usually talk about on the show, the specific economics of a business. Today took a left turn and I'm honestly, I'm really glad that it did because we spent the majority of the time talking about the cadence of a deal, everything from the LOI all the way up until closing. And we focused on the three main areas of this process.\r\n\r\n\r\nThere's the financing piece, there's the due diligence piece, and then there's the negotiation piece of the purchase agreement.  And what's important to know about all of those is they've got to be driving forward at the same time. Otherwise, one of those three is going to hold up the actual closing process.\r\n\r\n\r\nSo if you or someone, you know, is interested in buying a business, but you've never bought a business, this is a really good, genuine insight into what the deal process is like. This isn't one of the glamorized or sexy versions that you're going to see posted on Facebook, Instagram, or Twitter. This is real life and Brian gives his real life experience.\r\n\r\n\r\nSo if you enjoy this episode, you know what to do, like, subscribe, share with a friend with that. Let's just hop into the show. The man, the myth, the legend, Brian ceiling. Welcome to Nick economics, my friend. Yeah, man. Thank you for having me. I appreciate it. Of course. It's great to have you. I'm just going to get a little color up front for those who don't know. \r\n\r\n\r\nBrian recently bought a business and it was one of the few businesses that I've invested in so far on Twitter. I'd wanted to invest some money into businesses that I met through my Twitter network and Brian,  I met him, loved his thesis on the business. And I actually put some money into his business. It wasn't a ton of money, but it was, it was enough to help him close the business.\r\n\r\n\r\nSo this is going to function as both an interview and an update for me.  I like it. I like it.  What your company is and how you make money.  Sure. So we repair commercial kitchen equipment. That's not a good cleaning company. We're not a company. No, we do not clean. We like hood cleaning companies because they normally break the equipment.\r\n\r\n\r\nSo we have to then come in behind them and then fix it all. So we enjoy the hood cleaning companies.  Even after we closed, I was calling it a commercial kitchen hood cleaning company to people. And Brian was kind enough to correct me. Finally, It's like, you've been saying this too much.  So I know now it's not a hood cleaning business.\r\n\r\n\r\nSo you repair and maintain correct appliances in commercial kitchens.  Yeah. So we, I like to use the term equipment because appliances. A lot of times in your mind, you think about your home, right? And home appliances, and we don't do anything residential. It is all commercial. So, you know, anything inside of a commercial kitchen, but also.\r\n\r\n\r\nSo what is that? Yeah. Yeah. So what is that? What's inside of a commercial kitchen? That would be something that you would service. Sure. So like burner stoves, ovens, cooktops,  ovens, steamers, steam tables, microwaves. What about the walk in freezers, dishwashers? Yeah, no, not nothing on the cold side. So there's the inside of the kitchen.\r\n\r\n\r\nYou have a hot side and the cold side where we specifically stick to the hot side of the kitchen and dishwashers. So  you, do you do washers or don't do washers. Yeah, we do do dishwashers. Yes. Okay. And for the size of restaurants, I don't even know, are there different scales of sizes of restaurants? Like are there small and big restaurants or are they all kind of.\r\n\r\n\r\nYeah. Yeah, there are. Yeah, absolutely. So you think about an operation inside of a hotel, right? You're talking about a huge, especially some of the big, larger, uh, hotels that hold conferences and have to serve hundreds, if not thousands of meals a day. All the way down to the smallest, like a food truck and down here in Tampa, there's a huge food truck community that we also support.\r\n\r\n\r\nSo the food truck just has a basic 36 inch cooktop, maybe a fryer. And that's all I got. Right. And that, that, that serves them and allows them to serve their customers. So, you service that whole spectrum. You service all the way from a food truck up to a hotel or convention center that may have a massive kitchen operation. \r\n\r\n\r\nAbsolutely. What is your background? How did you get into this business? Why were you attracted to it? Where did that come from?  I did not come from this line of work and in this business whatsoever. My actual formal training is in it. So I have an IT background. I was a system engineer for, for many years.\r\n\r\n\r\nI actually had my own consulting firm for almost seven years before selling my interest and then moving down here to Tampa. Where were you? I was in the DC metro area.  Is that where you're from? Is that where you're born and raised? And yeah, born and raised in Alexandria, Virginia, and then moved to Maryland.\r\n\r\n\r\nAnd then moved back to Virginia and then moved down to Tampa.  So you'd owned a business before, right? You had it consulting that you had run. It was, had that business scaled or was it just a one man agency? No, no, it's scaled. Yeah, it's scaled. Sure. We, how big was it? I didn't speak about  42 employees.  Jeez.\r\n\r\n\r\nThat's a big company, man. Yeah. Yeah.  Wow. Why did you end up going away from that and get into a commercial  kitchen? It was just time for me to exit. And I wasn't necessarily looking for a commercial kitchen appliance repair, sorry, equipment business, but I knew I wanted to,  I guess, be an entrepreneur again, so to speak.\r\n\r\n\r\nRight. I wanted to do something else,  but I knew I didn't want to start something from scratch. I'd been down that road. I've been a part of two startups and I just didn't want to start that grind again. I wanted to buy something that was non sexy and that maybe wasn't as, that's a little bit more future proof, meaning, you know, has, it requires hands, like real hands to actually do the work. \r\n\r\n\r\nSo I was always really good with people too. And I know inside a lot of blue collar businesses, it's all about the people within it.  And for me, from a leadership perspective, I was always really good at guiding and helping others grow, and which is a big part of my, my own thesis and how I like to manage folks.\r\n\r\n\r\nSo, within the entrepreneurship  economy, I don't even know what to call it. Ecosystem. Yeah, sure. Specifically as it relates to social media, YouTube, Twitter, Instagram,  there's two, in my mind, two different types of businesses that people fetish. Fetishize.  There's one type of business that  leverages digital distribution. \r\n\r\n\r\nSo whether it's a digital agency or you're selling a product, an info product or e-commerce, whatever it is, you're utilizing the digital infrastructure. And then there's the other end of the spectrum, which are the sweaty startups.  The ones that are the plumbers, the HVACs,  commercial kitchen appliance repair. \r\n\r\n\r\nWhy did you decide to go with one over the other? Or were you looking at both types of businesses and you just decided this was a better fit?  Yeah, I was looking for both types of businesses. Obviously I, with my IT experience and I even have some experience in the digital marketing area as well. And in that vertical.\r\n\r\n\r\nI looked at those, but it just, you know, for me, I, I wanted something that was local too, right. That was important. Something that was locally involved in the community that I was in and not that digital marketing can't be, but typically any of those types of business, especially e-commerce, like what am I doing? \r\n\r\n\r\nSourcing products from China or somewhere else and I'm reselling them, putting a markup on it and pushing it out there. Like  that to me, I wasn't sure you can make some money, but  I guess entrepreneurship for me is more than just, more than just going out and making money. That's part of it. Right. But if I'm, if I can't affect it and help others, then it's not for me.\r\n\r\n\r\nSo I quickly got away from e-commerce stuff as attractive as some of it looked.  I just,  It, it, it, it wasn't, it wouldn't be fulfilling for me. So, and you said you were looking for a business that was future proof. What did that mean to you? And why is this business a future proof business? What does that mean? \r\n\r\n\r\nWell, if you think about just the way, you know, technology is evolving, right? I mean, who knows in 10 years, will we even have  people doing some of this marketing? Type of jobs are with all AI and run by some type of  artificial intelligence. I don't know that we're going to have robots running out to replace fan motors on the back of your convection oven anytime soon.\r\n\r\n\r\nBut, you know, at least for the next 30 years, while I'm still on this earth and kicking, I think I'm safe. So, all right. So you found this, where did you find this business?  Like, where did I find like the business listing or listing?  It was on BizBuySell.  Okay. Look, I'll give BizBuySell its flowers when they're due.\r\n\r\n\r\nYeah. I usually crap on BizBuySell, but there are good businesses to be found on BizBuySell. It's just, you got to kiss a lot of frogs until you find that prince. There are, and I'd say I was super naive when I started. I was so naive when it came to sourcing deals, right? Because when you become a searcher and you're sourcing deals, When you're looking for a business to purchase, it's completely different than if you already own a business and you're looking to then acquire something or grow through a roll up.\r\n\r\n\r\nOr maybe you're looking for a bolt on of some sort. It's different than actually trying to cast a net out there and be a searcher and look for all types of businesses. Talk about that for a minute. Cause there's a lot of people listening who are searching for their first business. They may not have another business.\r\n\r\n\r\nThey're not doing a roll up. What do you mean you were naive? And what's the difference? What are you talking about specifically? So I was naive in, in the idea that I could just look at a listing on biz by sell and then just go buy it.  Right. Like, yeah, I got, I got cash in the bank. I have some capital, right.\r\n\r\n\r\nI've run a company before. I know how to operate a business.  But to get a deal closed now, that is completely different than something that was foreign to me.  And I, I don't want to say I learned the hard way, but I learned through the experience of doing it. So maybe it's part of my own fault of, Hey, I can do anything.\r\n\r\n\r\nThis isn't that complicated. I looked at a business and said, Hey, let's go buy it. What's the worst that could happen? How hard can this be? So, but it was a lot more challenging to actually  Get a deal from first time you laid, you know, I laid my eyes on it all the way to the day one. I'm now running the business.\r\n\r\n\r\nHow long? Tell us. That was 11 months. 11 months, 11 months from the day.  Yeah, that's long. That's yeah. But you also learned a lot. You learned a lot over those 11 months, right? Like, like you said,  you think it's just, Oh, here's the listing. There's the price.  We're done  the deal. The art of the deal. I'm not quoting Donald Trump, but there is a, there's more of an art to the deal than there is science.\r\n\r\n\r\nIt's about, there is a lot of different things. What did you find in the deal process that you feel like you didn't know going in that the next time you'll be more focused on?  I think it's the cadence of how things need to happen. Right. And what you need to be prepared for and how, if you don't have those things lined up, things get delayed  and nothing kills a deal more than time, right?\r\n\r\n\r\nThe longer it takes, the more likely it is for it to fall apart. And typically they do fall apart a few times before they even get to closing. So we'll talk about the cadence. I want you to go be specific. What do you mean by the cadence? So when you go from putting in an IOI to now having an, an accepted LOI,  And then what you, who you need to call first.\r\n\r\n\r\nSorry. Sorry. Define both of those things. No, no, no. This is really good. Like this for people listening who are trying to buy that first business. This is gold. So what's an IOI and what's an LOI. So I forget what the acronym is for Iowa. I'm drawing a blank here, but intent, intent, offer, intent, offer of intent.\r\n\r\n\r\nOffer. Intent of off something like that. It's your intent of your letter of interest. What is it? No IOI interest. Something like that. I forget the I honestly, I don't know. I could Google it and tell you what it is, but the IOI is essentially you saying, Hey, I'm interested in this business. Correct. The LOI is spelling out the terms of the offer  and typically includes an exclusivity clause that allows you a certain period of time to negotiate with that seller where.\r\n\r\n\r\nThey're not going to go out and try to find somebody else. I don't typically do IO eyes, but I know what they are. So anyways,  the IOI, the LOI process, you were talking about how that pertains to the cadence of the deal. Yeah. So that, that is, is huge of understanding how those two things work and when you need, what you need to do and who you need to bring into your deal team in order to get your deal done.\r\n\r\n\r\nRight. I didn't even know what a deal team was. Right. Again, that's something that I learned along the way. Like we meet deal team. Yeah. I have some, a look at the numbers, but I can love the numbers. Not that big of a deal. Well, a little more to it than that. Right. And, and two down here in Florida,  they typically don't like to use IOIs and LOIs.\r\n\r\n\r\nThey have this pre baked,  almost like a real estate brokerage style form that they use that they call a, um,  Oh, I'm drawing a blank on it. But anyways, it's a pre baked offer sheet, essentially. Asset Purchase Agreement. That's what it's called. Asset Purchase Agreement, APA.  And they'd like you to sign those as that, that is your LOI.\r\n\r\n\r\nWell, that's a legally binding contract, right? That is not something that you just want to throw a price on and some terms on and send it over because it doesn't provide you any buyer protections inside of that document. So I didn't know that. Right. And I had these brokers because I looked at a bunch of businesses right  down here in Florida.\r\n\r\n\r\nI had all these brokers sending me the, these APAs. Hey, sign it. If you want to put an offer and sign this, sign this.  And I, you know, I was like, okay, this sounds like you're trusting a broker because a broker is supposed to be that person of expertise.  And really they only care about getting the deal done.\r\n\r\n\r\nSo they're not worried about your interest after the purchase. So anyway, so getting back to cadence, like that, that right there costs me three months.  We had an APA signed, right?  That  fell apart because what happened was I got the, I got it under, I got the APA signed the first time around. I got the deal  under contract.\r\n\r\n\r\nWe went through due diligence,  three, three weeks later, I find the company isn't producing the cashflow that the dealer put, or I'm sorry, the broker put on the, on the, on the one pager that they send out right on the, the listing. And so I go back to the buyer, the seller, I'm like, well, this isn't going to work.\r\n\r\n\r\nLike I, this deal doesn't pencil at this price.  And so the deal fell apart.  And three weeks later, the seller came back around and said, Hey, maybe I will drop the price some.  You know, what can we do to get the deal done?  And so we started that conversation again. But at that point,  he didn't want to sign another LOI or APA without having his lawyer go through it. \r\n\r\n\r\nWell, that's a whole nother conversation we can have about how lawyers can get involved and totally mess things up too. So again, you have all these different pieces that kind of need to happen and go in place. So, you know, if you find a broker that actually knows what they're doing and can help guide you, that's great.\r\n\r\n\r\nBut if I could do it all over again, I would literally find some type of consultant  to help guide me through it because there's so many things that you can get hung up on that you just don't know because you don't have the experience, especially for first time searchers.  There's kind of three phases that I think of it in. \r\n\r\n\r\nI think of it in the negotiating and phase makes it sound linear. It's not always linear.  One area is the negotiating and in the negotiating is the LOI, the APA, or the purchase agreement, whether you're doing an asset or a stock. Um, sale depends. It's not a APA. If it's a stock sale, obviously it's just the purchase agreement. \r\n\r\n\r\nSo negotiating of the deal,  then there's the financing of the deal.  And then there is the. Due diligence of the deal.  And all of those things  are stressful in and of themselves and require different people, the financing portion of it. Like you said, there's a cadence to it. You've got to get pre qualified by the bank.\r\n\r\n\r\nThey've got to look at the financials. It's got to go to underwriting. Then after they take that packet together, they've got to take it to committee.  Committee reviews your proposal and whether or not they're going to lend to you.  If it's not an outright, yes, which many times it's not upon committee, they'll come back to you and say, Hey, We need these updates or you need to add more capital, or we would like to see more of a history here.\r\n\r\n\r\nSo the financing portion of it in and of itself has a cadence, the due diligence, you've got to do a quality of earnings. You've got to make sure you have all your contracts lined up. You've got to make sure you understand an asset versus a stock purchase, because it's going to, it's going to affect how you treat those employees and how you treat your vendor relationships.\r\n\r\n\r\nAnd then in the meantime, you still got the negotiations going on and you may have agreed on a price with the seller, but.  Now you're talking about non competes or you're talking about non solicitations and are they going to be willing to sign one for three years? And is there a seller note involved? So you've got like these three,  again, phases is the wrong word, but like three areas that are really important to the negotiations that all have their own cadences that all have to be moving in the same direction at the same time in order for you to get to a close. \r\n\r\n\r\nSo that all of them have been done and you feel confident in them by the time you actually close and purchase that business. And to your point, it's not even a consultant on any one of those in particular, it's just somebody to walk you through and say, like, Hey, I know this is important to you right now, but getting the APA is signed is much more important than. \r\n\r\n\r\nWorrying about your vendor contract for your I. T. System. So let's get the A. P. A. Sign, right? Just helping you focus on the right things. So it's a really good point you bring up. Yeah. And to speaking of the banks and that's another area. If you can find a capital consultant,  I would 100 percent  do that.\r\n\r\n\r\nRight? Because what happens is to your point, you get locked in with the bank. You go through this whole process of giving, giving up.  In some cases, you're first born to even get it to committee, right? They want so much information, so much paperwork. They want to know what time you eat dinner every night.\r\n\r\n\r\nRight. And  it's so that part can be stressful too. And you get through all that process and all that stuff  and you get it over to the bank only for them to say,  eh, this isn't, this is outside of our investments thesis right now or whatever kind of excuse they want to come up with. So if you have a capital consultant,  typically they know what banks have what appetite for what deals, right?\r\n\r\n\r\nAnd they can get you in front of the right bank  that won't get you all the way down the line. Because what happens is you're that far down the line, you're kind of stuck with that bank.  So now you're at their mercy of whatever they say. They say, Hey, sorry, Nick, we need another half a million dollars in this deal for us to get comfortable.\r\n\r\n\r\nGuess what you're going to have to do? You're going to have to go back and delay the deal even more, or you're going to have to go out and find a half a million dollars in capital.  So if you work with a capital consultant that can help prevent some of those things from happening, you don't get boxed in with a bank that you have to use. \r\n\r\n\r\nI would, if for not anything, at least get a capital consultant, right? I would say  there are even things you can't control  that come into affect the business. For example,  you have investors who are putting money into this deal. Yeah. I was one of them. Yeah. Are you comfortable saying how much the purchase price was or no?\r\n\r\n\r\nNo. Only because the seller's still in the business. Yeah, that's fine. So we purchased this business. I'm putting some money into it, which is  less than 10 percent of the value of the purchase price of the business.  And  the bank is delaying closing, or at least threatening to delay closing because I didn't send them financial statements in the format that they wanted.\r\n\r\n\r\nI showed, I showed them that I had more than enough capital, more than enough capital. I gave them more than enough of a time period, but they wanted to see confirmation of that specific wire going out. And it was like,  it was weird. It was the first time I'd ever had an issue with it. But even if you do everything right, you can still kind of be tripped up by some of these things like, Oh, your investors actually messed up on their wire or there's so many little things that have to be right.\r\n\r\n\r\nSo when you talk about cadence, that's another cadence. If you bring investors in, there's a timeframe to get those investors warmed up to the deal first. Right. Yeah, and then have them provide the necessary paperwork to the bank because anytime you bring another investor that has any kind of equity That's got to go on to your sba, uh application to say hey nick owns is now going to own this much of this company Well, guess what?\r\n\r\n\r\nI need financials on nick then and where did nick come up with that money to put into the company? And how much does he do it, right? So there's this whole thing. Well, that takes time for someone like you to get together, right? You just can't in a day, whip up all this paperwork, whip up all this stuff and then get it over to the bank.\r\n\r\n\r\nRight. I mean, I would say at least a six week period from the time that you start to have conversations with investors to the time that they're ready to actually say yes, and then wire the money over in order to get the deal closed at least six weeks. Right. Because we need.  It's funny. I'm going to have to get you on another time here to actually talk about your business because. \r\n\r\n\r\nI think it's really valuable to talk about the deal process itself. Yeah. So I'm going to keep pulling on this thread. Sure. Why did you decide to bring on investors and how did that thought process work for you?  So, yeah, so I was kind of in a similar situation where I was down the road with the bank and the bank was like, Hey, we're going to need some more capital to be, to put into this business in order for us to get comfortable with the deal.\r\n\r\n\r\nAnd part of the problem. And a part of the reasoning for that was because of my lack of experience within the industry,  right? I come from it, I come, you know, white business, you know, as they call it. And now I'm transitioning into blue collar, sweaty startup type of business. And two, the business also requires a license to operate in the state of Florida.\r\n\r\n\r\nSo that was another concern. So for them to get comfortable, they're like, we need more capital.  And I wasn't necessarily. Comfortable doing it all myself for a couple of different reasons. But I also thought, so, you know what, this is probably a good opportunity for me to then reach out to the investment community, learn more about them and how they operate, and then bring in some  outside eyes on the deal too.\r\n\r\n\r\nAnd then also have some partners involved that I can reach out to when either, Hey, there's a time that we're going to expand, or maybe I need some help with something or Maybe there's some challenges that I'm faced with. It's,  I've learned that it's always best to have a team and a tribe than try to go it alone, right?\r\n\r\n\r\nIt's impossible to do any of this stuff alone.  So I thought back hard, like, do I want to put all the capital in myself? And, or do I want to go out and provide the opportunity for others to join in on this, because I see the value here and I know what I can do once I get to the door. And then really start to establish some relationships with those people too. \r\n\r\n\r\nAnd how many investors did you end up bringing on three?  How has that relationship been? I mean, it's awkward asking you on camera, but you're horrible. Leave me alone now. I'm horrible. I know that. Has it,  you know, did it play out or has it played out the way you had hoped? Obviously it's still in the early innings.\r\n\r\n\r\nCause you, you just transitioned to this business a month and a half ago, right? Or two months ago. Two months ago. Yeah.  So I know it's early, but can you talk about how that relationship has been? Oh, it's been great. Every investor has their own value prop that they bring, and that I know that I can lean on and call on if I need to.\r\n\r\n\r\nThey've been very supportive too, to say, Hey, how are you feeling? How are things going? Is there anything that you saw day one that you weren't prepared for? Or is there anything that we can help with? Or, it's been good, but I don't want to call it annoying, right? But it hasn't been like every day, like someone looking over your shoulder.\r\n\r\n\r\nIt's not that, right? So it's been good.  And as far as the SBA process goes, if anybody has over 20 percent equity,  they're required to sign on a personal guarantee.  And I think that if anybody has over 10 percent equity, they're required to provide personal financial statements above and beyond, like I provided the bank statement of  the account that was wiring money, but 10 percent equity in the business, I did, I didn't need to provide a full  The full, uh, rectal exam, whatever they call it, colonoscopy worth of financial statements.\r\n\r\n\r\nHow do you think about  operating your business with those partners? Does it feel weird? Is it, you know, do you think of them as partners or silent investors? Like, what is your thought process on  not only your relationship with them, but how you involve them in the business?  Honestly, you know, day to day, you're so down into the weeds of, especially the first two months.\r\n\r\n\r\nOf just trying to get things transitioned that you're not even really thinking about that. You don't have time to. And then in this business, we have so many customers and so many different vendors and reps. And there was so much to do from a transition perspective, just administratively that I didn't, I haven't really had a chance to even think about the investors and them as partners because.\r\n\r\n\r\nWe're not down there in the business doing this stuff with me. Talk about the size of the business. That's it. You bring it up really good point. We haven't even talked about how many employees, if you're okay, kind of mentioning what's top line revenue. Cause I think that will give people a better understanding of like, yeah.\r\n\r\n\r\nYeah. So  there's 11, 11 employees in total, including myself, an office manager and a, we call them a warehouse assistant slash parts runner. And then we have eight technicians out in the field. We're doing 2. 8 million in top line. At least that's where we're at today with. Obviously with hopes of growing that.\r\n\r\n\r\nSo  in the transition, what has been the surprising pieces to you? Has there been anything that was very different than what you were expecting?  Just the amount of transactions that we do every month. So we probably do 450  jobs a month.  And so just like I literally prop, I sit at my desk and process checks is what I do,  right? \r\n\r\n\r\nI have all these checks coming in on my dinner. Cause they're typically smaller.  You know, for the most part, we're, you know, our average job size is like 580 bucks, right? Somewhere in that range. So to get to 2. 8 million at 580, you can imagine how many transactions that is. And I had no idea the amount of checks and that people still like, cause guys and gals that operate food trucks,  they work in cash,  right?\r\n\r\n\r\nThey're not doing anything but cash. So I got cash coming in.  I'm not used to that, right? Because before and all of our other businesses, it was ACH. Money gets transferred either through ACH or credit cards. That's it, right? There's no processing checks. And so that was that part has been somewhat surprising, I guess you could say.\r\n\r\n\r\nAnd the amount of  Abuse our vehicles take, right? So our vans that their techs have, and it's not that they abuse them. It's just that they're just driving in there on the road nonstop. Cause again, we have a database of 3, 600 customers,  so they're probably going to seven to eight jobs a day in some cases, if it's busy.\r\n\r\n\r\nAnd that's a lot of time on the road. So our vehicles, they are the definition of road warriors, you know? So that, that was interesting.  What does it look like as you were coming into the company,  dealing with all the things that most entrepreneurs don't think about  as an entrepreneur, you think about the sales process, you think about.\r\n\r\n\r\nManaging people, hiring people. You think about the vans, the technicians, all that stuff.  But at least for me, I didn't think about,  Oh, I got to open a bank account. Oh, I've got to make payroll. Who's my payroll processor. Yeah. We've got accounts payable. Who are we using to cut these checks? The checks that are coming in.\r\n\r\n\r\nWhat's the system that we use to deposit them? Like  these administrative things, mainly,  how has that been for you? And what has been your process for. triaging that stuff.  Yeah. So I knew it was going to be a challenge. And so I had a pretty good  transition checklist that I put together of things that I knew that I was going to have to address day one.\r\n\r\n\r\nRight. And at least understand how we're doing it today  and how I could easily make it better. Right. Without, you know, having to spend weeks or all this time to transition without disrupting the business too. Right. Cause I didn't want to do that either. The way they currently do business. And some of that was as simple as we weren't even using a email domain that was specific to our business. \r\n\r\n\r\nMy office manager was using his like personal email at outlook. com.  No way. And that's where all this information is flowing into. And I'm like, no, we got to stop this like today. So in my IT background, I go to office 365. I set up the email domain. I set up Uh shared mailboxes and like all right now we have a billing email address We have accounts payable email addresses and then I started to then email our customers say hey  Just hello customer.\r\n\r\n\r\nHere's a change Now on you're going to be seeing emails from billing at pgmrepairs. com instead of you know Office manager at outlook. com, right? Cause that's,  and so those, those, but that was a problem I needed to fix. Like they weren't like, there's no way we can operate like this. This is not going to work.\r\n\r\n\r\nRight. But that's something I wouldn't expect it. Well, I kind of knew, but those kinds of things that some folks may not,  especially in these types of businesses, especially these HVAC and plumbing businesses where. The back office is typically super unsophisticated, super unsophisticated. Yeah. They have, I mean, the meme that's like buy a boring business, replace the fax machine. \r\n\r\n\r\nMake money and bro down or like whatever we still get payments to be a fax machine. I hate that. Yeah,  yeah, it's, it's crazy. It's funny, but it's also true. And it's not just the fax machine. It's stuff that you just mentioned, right? Like  email not being utilized properly or inefficient systems for communication.\r\n\r\n\r\nSo I love it. One thing I will say a comment on that is that, and I almost made this mistake. Okay. For anyone out there that's going to buy any of these types of businesses. And if they do have some type of field management solution in place,  do not change it day one. Tell me what a field management solution is.\r\n\r\n\r\nSo field management, uh, solution is what you use for all your scheduling, for your customers, for your invoicing. It pretty much is your dashboard of what's happening day to day within the business. And there are different businesses have different systems. So for like home services or sweaty businesses, it's the field management solution.\r\n\r\n\r\nThat's kind of the backbone of the company for healthcare companies. It's the EHR. So the electronic health record is the backbone of those companies. And for many digital companies, it's the CRM. That's the backbone of those companies, right? They're putting their customers in there. They're tracking a lot of their Salesforce, monday.\r\n\r\n\r\ncom, et cetera. And to your point,  you do not want to mess with that crap  at a minimum in the beginning stages. Hopefully you never have to change it, but if you're introducing a change to that in the middle of a transition, it's chaos, it's horrible. It's a hundred percent chaos. And the only reason why I was even thinking about making that transition was because I didn't think I would be able to just take over the current system without it being a complete mess. \r\n\r\n\r\nAnd once I got into the business, I was like, there's no way I can launch.  Or, or even think about doing that. So I'm going to stick with what they have in place. And yes, that has been a challenge  as well as is the accounting system integration and the integration with that platform  has just created all kinds of just  headaches.\r\n\r\n\r\nAnd I'm taking a deep breath because I'm just thinking about it in my mind.  But that's something that you, that's something you don't think about, right. It's because you go in and you're like, Hey, I'm just going to attach my QuickBooks to this. And.  But unfortunately, it's not that simple with some of these systems.\r\n\r\n\r\nAnd then,  and the backbone of your company is the financial system. So, you know what, you want to know where your money is. Where it's going, if it's coming in, if it's not coming in. So if those two things aren't talking correctly, or you have false data, it's not fun. It's really hard. You are a hundred percent.\r\n\r\n\r\nSo this has been a challenge. That's why it's important to have, you know, enough capital to make sure that you can make it through those first few months, because a lot of it is flying blind. You're just, you're hoping that you're moving in the right direction and you don't necessarily have all the data at your fingertips.\r\n\r\n\r\nLike you'd like to. Yeah.  Last question on the business.  What's your plan? What's your hope with this business in a year, five years, 10 years? Is this  something you want to scale regionally? Is it something you just want to be in Tampa? Where do you see this business going over time? I definitely want to scale regionally for sure.\r\n\r\n\r\nI've seen others that have done it, they've been successful at it. So my plan is to scale over the next three to five years. And maybe even add on some additional services, maybe take on the cold side. If the right acquisition comes along, there might be something that, that we'll get in as well. And because we have the customer base.\r\n\r\n\r\nSo now it's just like, Hey,  now we do the cold side, call us for that now. Right? So there's just a lot inside the business that, that I see potential that I can do. It's just going to take a little bit of time to get it done. But I think in three to five years, it's going to be, it's going to be. Pretty cool.\r\n\r\n\r\nSo cool. Well, I have some rapid fire questions to wrap up. Are you ready? Yeah, sure. Fire away. All right. What do you love about this business? I love that. It's scalable. I love that. I interact with my people every day and I, I love that it's a local here in the community too. That, that was important to me. \r\n\r\n\r\nWhat do you hate about it? I don't think there's anything I hate. I just, it's not, if I would say one thing that's maybe a little different, it's not sexy. I mean, it's, Hey, what do you do for a living? Oh, I fix commercial kitchen equipment,  right? It's not. That's true. Yeah. There's not necessarily the prestige.\r\n\r\n\r\nWhich is fine. What are you obsessed with right now? If you have two hours in your day, you could sit down. You don't have anything else to do. No kids, no work.  What occupies your brain space? How can I grow this business right now? I mean, like those, yeah, you're in the thick of it. Yeah. Who can I talk to?\r\n\r\n\r\nWho are the, who are the conglomerates in the area that own a bunch of restaurants? What hospitals can I get into? Like. What are my competitors doing and how can I kick their ass? Right. Cause that's what I want to do too.  Right. Like that's what, that's what if I could clear out two hours of my day, that's what I'd be diving into.\r\n\r\n\r\nAll consuming. I love it. Yeah.  This is a hard question. Cause you're just in the thick of it right now and you may not have an answer, but  all of us suffer from the grass is greener.  And I'm wondering for you right now, what businesses are you looking at that you're jealous of?  That I'm jealous of? I mean, it doesn't mean you'd be doing them overdoing what you're doing now.\r\n\r\n\r\nRight. But just like,  what are you jealous of? I kind of like the investor side of the things to be honest. Right. And I say that because I like looking at deals. That's one thing that I've found going through this process. I'm somewhat of a deal junkie. I still look at deals today. I have no intention of buying them, but.\r\n\r\n\r\nI like looking at them and I have some searcher friends that I've met via Twitter that I help look at their deals. We look at their deals together all the time and it's fun. Like I enjoy that. So you get access to looking at a bunch of deals as if you're investing in those deals. So for me, I'm kind of, you know, jealous of that aspect of it.\r\n\r\n\r\nSo, yeah, yeah.  Here's the last question. What advice would you give yourself 10 years ago?  Oh man,  10 years ago,  I should have learned about, uh, Acquisition sooner  to be honest. Like I, \r\n\r\n\r\nthe good answer. That's it. That's it. Well, this has been a great conversation, Brian. I appreciate you taking time out of your business schedule. Where's the best place for people to find you reach you? Sure. Find me on, on Twitter or X as they call it now. Be ceiling at B ceiling. Find me on LinkedIn as well.\r\n\r\n\r\nSame thing. Be ceiling. Yeah. Reach out anytime. You have any questions.  Awesome. I hope you have a great day. Can't wait to catch up with you in a year and see how things are going. Yeah. Thank you. Appreciate you, Nick. All right, man. See ya.  Man, what a great conversation with Brian. I love talking to him every single time you can see why I gave him money as I've had some time to reflect on it.\r\n\r\n\r\nI wanted to  give you a little bit more perspective on the deal process itself. You know, running a business can be glamorized. It can be sexy. It can be fun, right? People look at you. You're respected in the community. You're providing for other people, which provides a lot of satisfaction, but running a business is very, very different than buying a business.\r\n\r\n\r\nAnd the same skills that you have in running a business can be very different than the skill sets needed to buy a business and buying a business. You've got to negotiate a price. You've got to build a relationship with that seller. You've got to know what to look for into diligence. You've got to understand the upside and where the potential liabilities are, but also the potential upsides are so you can leverage those once you take over.\r\n\r\n\r\nAnd I think what the conversation with Brian really drove home to me is if you're serious about buying a business, if you're serious about becoming an entrepreneur, Through acquisition, as opposed to, to, through a startup, I would strongly encourage you to find someone who's been through that process, who understands what it takes to go from LOI to close, and it may cost you some money. \r\n\r\n\r\nDon't be a penny wise and a pound foolish.  Please. You will make more mistakes in that process that will cost you much more money in the long run than finding someone and paying them as a consultant or asking a friend of yours to maybe join your advisory board for a couple of percentage points in order to make sure that the deal goes through smoothly.\r\n\r\n\r\nThere's nothing worse than getting into a business, knowing that you know how to operate it, but having negotiated and done a poor job and due diligence. Because now you're stuck, you've taken out a loan and you've got a problem on your hands as opposed to something that you're excited about.  So I hope you found something valuable in this episode.\r\n\r\n\r\nI really, really hope that you found something you can apply to your life or to your business. If you did leave a comment, send me a message, Nick at co founders. com. I'd love to hear it. I really would. And always remember there is no such thing as a dumb question,  only dumb people who refuse to ask dumb questions.\r\n\r\n\r\nI'll see you next time.",
  "metadata": {
    "duration": "",
    "date": "2024-07-03",
    "platform_source": "Google Drive"
  }
}