{
  "episode_number": "19",
  "episode_title": "$20K for 30 Seconds? Inside the Influencer Marketing World with Trenton Hughes",
  "guest_name": "Trenton Hughes",
  "business_name": "Station Entertainment, Help",
  "transcript": "﻿All right. Welcome back to economics. If you've ever wondered how these YouTubers managed to make money. Well, today's your lucky day because I sat down with Trenton Hughes. Founder of station entertainment and his job was to represent influencers to brands. And he talked about everything, how they make money, where they get it from, what the percentage splits are, how those businesses grow, et cetera.\r\n\r\n\r\nIt was an awesome conversation. And I could go down a million rabbit holes, but I really think you're going to enjoy it. So this week I wanted to share something with you. I. I was talking to my wife and she had the typical conversation.  Why don't you spend more time with the kid? Why don't we talk anymore?\r\n\r\n\r\nWho's Sam Parr? And why do you keep talking about her in your sleep? You know, like regular stuff. She thinks I'm wasting my time with this. Could you do me a favor?  Could you subscribe and share this so I can prove to her and to myself that this isn't a waste of time.  That I'm not a deadbeat dad  that I can tell my kids that I actually have a job. \r\n\r\n\r\nI would really appreciate it. All right. Now that I'm done debasing myself, let's hop into the show. Trenton, thanks for joining me. Pleasure to have you, man. Yeah, thank you. I'm excited. Today's a little bit different. It's not necessarily a business that Trenton currently has. Trenton recently exited from a couple of businesses and we get to talk about those businesses and maybe even dive into the process of exiting.\r\n\r\n\r\nSo in its simplest terms, Trenton, what were those businesses? Trenton Larkin And how did they work?  Yeah. Yeah. Good to be here. Thank you. Yeah. A couple of different businesses. One was called help where we were a little bit earlier to the staffing game. Now it's a little bit more popular, but started in that 1 about 8 years ago, and it had been pre existing.\r\n\r\n\r\nI was recruited over to it. But yeah, basically providing Remote teams, both domestically, internationally for customer service departments, like Universal music, Amazon, Headspace and big companies. And that one grew quite a bit. And then the other one was called station entertainment, which was an influencer agency.\r\n\r\n\r\nDid a little bit of sports agency work to basically represent talent and helped them to get brand sponsorships and deals as well as working with some brands to grow. A good amount. And both of them, I was at for about three to four years individually.  And we're both of those in Southern California.\r\n\r\n\r\nTechnically, help was where it was, but it was such an international presence that I was always traveling quite a bit. The office ended up moving to Kentucky, but we had a presence in Ukraine and Philippines and Germany and Mexico and all kinds of places all over the globe. So that one was all replaced. And then.\r\n\r\n\r\nYeah. Station entertainment was actually based here in North Carolina after moved from California to North Carolina. We home based it here.  Okay. So  just so I make sure, like I understand  help where was a staffing company  and specifically they targeted supporting influencers. So the helper was just for customer service.\r\n\r\n\r\nSo building customer service for companies. Yeah.  Okay. And then the talent representation  that was stationed entertainment, you had influencers and athletes like you represented across the board.  Yeah, we really thought athletes would be like a fun way to go. Cause we were passionate about sports. It's just, it's a little bit harder of a market, but we did work with. \r\n\r\n\r\nHall of Fame, NFL players, some really star players for a minute. We were helping them on the brand deal side. So trying to go source sponsorships and deals, not doing their league contracts, but yeah, there's a lot of money in the sponsorship side of things, but we focused more on the influencers.  How did you get into that?\r\n\r\n\r\nLike, how did you get into both of those businesses? Was it something? You grew up thinking, I want to help influencers monetize. That was a joke. I'm sure you didn't grow up thinking that. I don't even know an influencer started now for that one,  transparently, like what the vision with that was that a lot of these creatives, they know how to make audiences and they know how to be creative, but they don't know how to build businesses and they don't know how to go like negotiate deals and do sales.\r\n\r\n\r\nAnd so we had no background in it at all besides how to build businesses and how to scale and how to negotiate and do sales.  So we use our cold outreach approach to get our first few customers. And then it was all about experience, making sure they have an amazing experience with us. We were pretty lucky.\r\n\r\n\r\nWe got our first influence and booked her out. Like we reached out all these brands on her behalf. And book trout with brand deals for, I think it was like 16 straight weeks off the bat. And so, so  walk it back. How did you even identify who you go after? You said you did cold outreach, cold out. You just like put a list of influence.\r\n\r\n\r\nYeah. Yeah. Essentially there's all kinds of influencers out there.  We wanted to focus on like YouTubers. So we were looking at YouTubers that were in initially the DIY space. So they're making their houses look cool. HGTV style, fixing up different things. And that's where we started. And then it grew into all kinds of different influencers.\r\n\r\n\r\nBut yeah. So what was your like original profile? YouTubers in the DIY space with a certain number of followers. Yeah. Like a hundred thousand followers. Plus at certain stages, they're just not easily monetizable, but that's where we started. And then, yeah, pivoted and grew. What made you have the idea? Like why even think, Oh, I'm going to start reaching out to these influencers to help them. \r\n\r\n\r\nGrow a brand, grow a business. The original idea was more to build businesses with these influencers. And what we realized pretty quickly is that's a very difficult thing to do and takes a lot of investment and finding the right person. And we saw this open market when we were starting to talk to people.\r\n\r\n\r\nWe're like, Hey, I need help on brands though. Can you help with that? We haven't found anyone reliable. So just fell into it as we pivoted, because we realized that there was a bigger market in this other side of things. And I would say since then, what made you What made you go into it in the first place?\r\n\r\n\r\nLike, why was there even a thesis of, Oh, we should partner with influencers. What was your background? How did you even come to a place where you thought that would be a good business? Well, truthfully, it was more of just a random idea, but the background was in building businesses. So help where we'd built and done very well with.\r\n\r\n\r\nOkay. And so the thesis is what we know how to build businesses. We have a playbook, I've advised a bunch of startups as well. Why don't we try to build some quote unquote small companies with these influencers who have distribution. And build some cool things for them. Cause most of them, they're making great content, but they don't actually know how to make a huge living off of what they're doing.\r\n\r\n\r\nAnd so it was really like, can we support them while also building businesses for them and with them was the initial thesis. And I am fascinated by this right now. I wish I would have known this was exactly what the business was. Cause I would have done more research and brought some more facts to the table, but luckily I already know a lot.\r\n\r\n\r\nCause I've been researching  It's been really interesting to see. Influencer businesses launch the typical progression that I see is someone grows an account. They start making, but they start selling their time as a consultant, let's say, like they're an expert and then they start selling ad spots. With their distribution, and then they start businesses on top of their distribution.\r\n\r\n\r\nThat's like the progression that I did. But we've seen Nick Huber do this very well. Recently, see Ava. I don't know if you know who see Ava and Xavier are. They have a fund where this is actually what they're doing. They're finding influencers and launching businesses with them. So it's becoming more and more of a mainstream thesis.\r\n\r\n\r\nBut you, how many years ago did you do this?  Oh, it's three or four years ago now started it. Okay. So it was before it got sexy to do this stuff. Yeah. It's definitely blown up. So yeah. How many influencers did you have under your brand? Like at its height, were you managing five people, 10 people, a hundred people?\r\n\r\n\r\nOver a hundred, it took a while to get to that stage. And then at a certain stage, there was so like the beginning of doing cold outreach to find people, but I'm just a huge proponent of delivering amazing experience and building systems that allow for that to happen. And so I think systems work. We were lucky in that way.\r\n\r\n\r\nAnd it grew a lot through word of mouth at a certain point, but at a certain point too, we started, instead of getting all outbound, we were getting. Hundreds of inbound people that wanted to work with us a month to the point where we couldn't take them on because they weren't necessarily right fit. So we just didn't have capacity to take one. \r\n\r\n\r\nYeah. Did you have a threshold or criteria for qualifying? Because 100, 000 subscribers on youtube is very different than 100, 000 followers on instagram. Very different than 100, 000 followers on twitter. And then also A hundred thousand followers in the DIY space is very different than a hundred thousand followers in the gaming space.\r\n\r\n\r\nLet's say, what was your kind of customer profile?  Yeah. Yeah. All of them have like agencies that can do the work we focused on YouTube as our primarily our primary focus. And then in certain verticals,  I think that there's a lot of agencies that have done tick tock well and Instagram well, and we did everything, but the main criteria is that they needed to have a YouTube with certain, uh, thresholds and things that they were hitting. \r\n\r\n\r\nThat worked for us. We became an actual partner.  What was it like? What was that threshold? Yeah. Like they needed to have over a hundred thousand followers. They needed to be in a certain vertical. They needed to have a certain amount of views per video. That plays a big part into like how much brands are willing to pay for. \r\n\r\n\r\nCan you share it with me? Let's say I'm a YouTuber. I have a hundred thousand subscribers.  And let's say I'm a middle of the road YouTuber  per video. How many views am I getting per video?  Just, it varies greatly. I know it depends, but yeah, I mean like some of them can crush and they'll get like 50, 000 views a video.\r\n\r\n\r\nA lot of them might get more like 10 views a video. Let's go with the 10 to 20, 000 views per video. You answered one of my questions. So this was long form content. This wasn't short form reels type content. Okay. Let's say the 10 range. How were they compensated? Like, how does that business model work for an influencer?\r\n\r\n\r\nHow did they just get, here's a hundred dollars or is it like, okay, for every hundred views. This is the amount we'll pay. And is it tiered? What does the compensation structure look like? Yeah. The way that they make their money is like YouTube pays them first off adsense for views, similar to what Twitter and all those other platforms do.\r\n\r\n\r\nThat's the first one. But if they're working on brand deals and sponsorships, there's all kinds of different ways. You can do an affiliate model where  you get paid per customer that signs up for whatever you're promoting. You can do, um, a views model where you get paid higher and lower depending on how many views your video gets.\r\n\r\n\r\nThe influencers prefer to get flat fees, which mitigates their risks. So they'll have a charge of,  uh, usually per thousand views, whatever, um, that might be there's formulas to calculate it, but maybe they're charges a few hundred dollars for a flat fee there. So, and so that's interesting. So YouTube as the video platform, I go and buy an ad just on YouTube and then YouTube will place that ad  potentially with these, on these channels,  uh, and then the ad revenue that's generated from those they're sharing essentially  Yeah.\r\n\r\n\r\nWith these influencers, but you weren't doing that. You were doing branding. You were saying like, okay, brand X, Y, and Z. You want access to Mr. Beast. That's like the only YouTuber I know. So I'm just going to say Mr. Beast  and you can either do an affiliate deal where anything we send you, we get a piece of, you can either pay a flat fee or we can have a tiered approach where depending on the number of views I get paid more or less money.\r\n\r\n\r\nAre those like essentially the same, the three kind of ways that you can get paid? Yeah. Absolutely.  Yeah. Essentially. So  basically I think, you know, that they're, I'm so smart back to the a hundred thousand subscriber YouTuber with 10 to 20, 000 views per video.  What could they make per video? Is it, let's say we went with the CPM model where they're paid like per view, what are they making on a 10 impression or view video? \r\n\r\n\r\nThere's so many different things that range just because of what niche they're in, how big their audience is in the U S versus other places. But generally like it's a 30 to maybe at the high end, like 80 or 90 CPMs.  We're going to get back to the show in one minute, but I just wanted to tell you about today's sponsor, which is, uh, me.\r\n\r\n\r\nOh, it's me. I'm sponsoring the show. Yeah. Cause I'm doing this for free. Do me a favor, like, and subscribe right there, right at the bottom. Move your. Yep. It's right there. Yep. Awesome. Thank you. If we said 50 just from, just for math sake, 50 and 30, 000 views.  So it's weird. The CPM stands for cost per million cost per milli, but it's really like per thousand.\r\n\r\n\r\nSo that's 30 times 50. So that'd be 1, 500 for that video. They would earn.  Something like that. Yeah, it ranges people and also supply and demand and all that good stuff too. So,  but then on top of that, YouTube would also split ad revenue with them potentially.  And honestly, that's where most people in that game made most of their money.\r\n\r\n\r\nI think Twitter X is a very low payout compared to YouTube. And YouTube, I think is the best is from what I understand still.  Yeah, definitely. As you were getting clients, What do they prefer? Like, how do they prefer to be paid? And then how do you prefer to be paid? Cause I'm assuming there were different incentives there. \r\n\r\n\r\nYeah. I think  ultimately they'd probably prefer the less risk. So they wanted to get a flat fee. Some of them that were smart and they really knew if they could perform well, it's in their best interest to go some of these other routes, but it's a lot more risk to, um, the brands prefer it because it mitigates their risk.\r\n\r\n\r\nBut yeah, you get to find that win win hopefully across different things. So to me, the best was getting a flat fee plus an affiliate because you got both models in there and sometimes it could do that. But yeah, ultimately like it was in our best interest to make sure that a, the brand was happy cause we want them to renew.\r\n\r\n\r\nSo we weren't trying to gouge them, which some agencies do. And that be the influencer was happy. So it needed to make sure that it paid them a certain amount. So it was really about finding a fair. In between, it wasn't about one side getting higher or lower. It was thoughtful in the approach. Whereas some of the people that I've seen mess up in this industry is because they're going higher or lower on one of those ends where they're protecting the brand.\r\n\r\n\r\nSo they're going way lower on the rate or protecting the influence or going way higher. And it's not a win. And then the brand doesn't want to renew or vice versa. And so that was one of the things I think that helped us to grow. Can you share what was your fee as a company? What were you charging? And if you can't, can you just give like broad ranges of, was it percentage based, was it fee based?\r\n\r\n\r\nI'll talk to the industry in general. It's, it's a percentage base. Usually ranges from on the low end, 10 percent upwards to, I've heard of like up to 30%,  that seems pretty high, um, to me, but, okay. Somewhere in that range is typically what a agency is taking. If they're charging flat fees,  it's usually a yellow flag, at least I would say.\r\n\r\n\r\nAnd are they paying you because you have relationships with these brands and you're bringing the brand relationship to them or are they hiring you because, Oh, you know how to negotiate. Well, if most of them don't have time, they're so busy, focused on their, their creative. So they need help, but they need help from someone that understands.\r\n\r\n\r\nBut yeah, you know, a good agency or what we were doing was. Going on and actually doing a lot of outreach. We also at a certain point had relationships with thousands of brands. So it was easy for us to go to people that we knew and be like, Hey, let's put them here, let's put them here. So that didn't happen off the bat that took a while to get to that type of stage where you have all those relationships and you can't burn those bridges.\r\n\r\n\r\nUm, off the bat, it was all outreach for us though. Can you give me ranges and we'll stick to YouTube, a YouTuber with, let's say a hundred thousand subscribers. Do you know how much money they make a month?  Yeah, it, it varies, but I know there's a niche. There's how many views?  Yeah. My gut instinct is to say that they might be able to make a hundred grand a year off of that between like ads and in AdSense and things.\r\n\r\n\r\nIf they're smart, they can go way more than that.  But most people are busy and don't have the business sense. Like you can add all kinds of things on there to boost that up to a couple hundred thousand or way more, but probably on average, how  big was your largest,  how many subscribers did your largest client have? \r\n\r\n\r\nTens of millions. Yeah. And so much money did they make  a lot? I think, yeah, they'll, they'll make a lot because some of the people with tens of millions in the millions.  Oh, for sure, yeah. Even per sponsorship, they'll make at least like 20k on one sponsorship sometimes, depending on the Sorry, what's a sponsorship?\r\n\r\n\r\nIs that just one video? Yeah, just one video. Basically, midway through, you're talking about athletic greens or something for 30 seconds to a minute, and you're saying how much you like it, and you give a promo code and all that stuff. Oh, so  YouTube, because I've, I watch YouTube, obviously YouTube will stop and place an ad and it's like click to skip because I don't pay for premium,  but then there's also the YouTuber. \r\n\r\n\r\nSaying, Oh, I, whatever drink, Soylent green, whatever you just said. So those are, okay. I didn't realize that those were  different. Yeah. Most you'll see now, most of the YouTubers or people are promoting things midway through a video. And that's where they're getting that, that ad revenue from the brand specifically.\r\n\r\n\r\nAnd they can make 20, 000 off of one video.  And we want to add in that video. Yeah. I don't know if it's true, but like Mr. B supposedly like minimum fee was like 250, 000 per video. It might even be way more than that now. But yeah, some will make a lot, a lot of the big, big ones could make upwards of a hundred thousand per video.\r\n\r\n\r\nSo it's,  there's good money to be made, but you have to remember like at a certain point, they're also building entire operations and they have big teams that are doing all the editing and managing and all kinds of stuff. And so  there's a lot of cost involved. It's not like, Whoa, these people are just like.\r\n\r\n\r\nSuper rich. I'm sure they're getting a lot of money, but they have big operations to get to that stage. So that's what I was going to ask. Like  you're a creator, you're an influencer, you're building out a team, right? Because the larger you get the better quality videos, you've got editors and managers and content and probably platform specific people who just worry about repurposing your content for other things. \r\n\r\n\r\nHave you noticed, I guess, any particular personality types  where they shift from just, Oh, I'm making money off of content to Mr. Beast. Who's like, I'm going to launch Feastables.  Is that more of the exception than the rule at this point or most of them just, okay, I'm making content. I'll make money off the content or are more of them now like, okay, cool.\r\n\r\n\r\nNow what business do I launch?  No, most are making content and they're not necessarily entrepreneurial in mindset. I think they want to be, but they don't know how to be. Now that's, there's still a lot of people that are entrepreneurial and have built businesses, but the majority are making content and are trying to make content because they're creative and, or because they need it as an outlet.\r\n\r\n\r\nYeah, truthfully, a lot of people make content because they're depressed or having anxiety and this is their outlet or way to have a nontraditional job.  Yeah, I do different things. So  I'm making a lot of content right now. Trenton,  you just triggered me. Is this a, is this why you're making the content? \r\n\r\n\r\nThat's why you came on. I wanted to talk to you about something.  No, I'm just kidding. \r\n\r\n\r\nOne more question on the affiliate. Let's say they get  somebody to sign up and they become an affiliate and it's affiliate for,  I don't know, shoes.  Do they make  A certain percentage on the gross. Are they making, like when you're striking these deals with the brands, is it off of net gross? And then typically what does a split look like?\r\n\r\n\r\nAnd again, I know it's variable, but  yeah, walk me through what that model looks like. It, you have to think like most of these are like products. So they're not just doing net or gross. They're usually doing. Just a flat fee. Okay, per sign up, you get 50 and per sign up, you get 200. Some of them will get into these other models, but that's fewer and far between.\r\n\r\n\r\nBut, yeah, I would say the affiliate  isn't as friendly to influencers. It could be, but most of the time, it's just not. Like, the fees aren't huge. The risk is pretty high. Now I've seen people go crush and they'll make 30, 000 off of a video because they had the right audience for that product. But most of the time, it's not that lucrative for those guys.\r\n\r\n\r\nHow big was your business? If you're able to share,  and if you're not able to share, then I can't share exactly, but it's a multimillion dollar business. We can say that. And a lot of clients, a good amount of employees.  Why did you sell?  So I still own a good amount of that business. It's still actually existing.\r\n\r\n\r\nI. Left and sold some of my company back to the company. And that was ultimately just because. I had different things I wanted to do in the startup world and investing world. And after a couple of different startups, I was a little bit tired truthfully and ready for kind of my next chapter in life. So that company is still going, the founders are still there, still on a little bit of it, but yeah, mostly just sold it back to the company for that one.\r\n\r\n\r\nAnd does that agency do anything other than YouTube or they do an Instagram, Twitter,  uh, TikTok, LinkedIn, Twitter, but yeah, Instagram for sure. Tick tock for sure. Not so much on the LinkedIn side, not so much on the Twitter side from what I know, but yeah, all of the platforms have ability to monetize on YouTube.\r\n\r\n\r\nJust seemed like the best one in our eyes.  So after being in that world and on the back end,  your original thesis,  the reason you got into it, which was. Hey, let's launch businesses off of these influencers. Do you feel stronger in that conviction? Or do you feel now that's never going to happen because of X, Y, Z impediments?\r\n\r\n\r\nI would say I don't feel quite as strongly on that thesis only because of. Most of you, any type of business you're going to create, you need real alignment with those people. And some of the people just weren't entrepreneurial in their mindset. And the ones that were have tried it on their own and done some stuff.\r\n\r\n\r\nSo it's hard to find those right fits. I think that they do exist, but it's just, it's hard to find it. And then the businesses that you need to create with them would they're competitive. You need to find something unique. In my mind, because a lot of people have built like merch lines or courses or things, and that's not super exciting to me.\r\n\r\n\r\nI think trying to like, Mr. Beast has figured out some other things with like candy and all kinds of different things, or Logan Paul and prime now created a clothing brand called full sin. And then they launched an alcohol brand called happy dad that I've now seen in like stores locally. It's like, those guys are thinking bigger.\r\n\r\n\r\nAnd I think that you can only get there if you have a massive community. Attached to your brand. And it's just harder to find those people that you can do that with. And then the capital investment to do it is pretty high. I would say to get there. That's freaking fascinating. Last kind of question related to this.\r\n\r\n\r\nAnd then I got some rapid fire stuff for you.  Well, two more questions. Actually.  First question is businesses like the one that you owned and operated, how were they typically valued? Are they valued off of  EBITDA? Are they valued off of revenue? Are they valued off a number of influencers?  Here's one. Yeah, EBITDA probably.\r\n\r\n\r\nI think most services business are EBITDA, but yeah, that type of stuff is going to be a multiple. Any services business pretty well is four to eight times EBITDA generally. Okay. You can go higher if you're growing fast, if you have different, you know,  intellectual property or different things, but or if you built an incredible brand or reputation, different levers there.\r\n\r\n\r\nBut yeah, from what I understand of the industry.  Four, eight times its ebitda. What are typical margins in a business in this industry? Are they high? Are they low? I, I don't know if they're super high, only because there's a good amount of time and cost involved. So you need to have a decent team to build out from an agent perspective.\r\n\r\n\r\nAnd then that you have tech stack on top of that usually, and  I, I don't know if it's like a super high margin.  And so if I was to tell people, Hey, you should go or not go into this type of industry.  I don't know. Like there's businesses to be had, but that's getting to be a saturated one at this point.\r\n\r\n\r\nAnd so there's some players. What do you define as a higher low?  Well, I'll say a number. You tell me if it's high or low 20 percent margin. Is that high or low? Oh, that's low.  That's a 40 percent margin, high or low. That's probably average. Oh, okay. So you're comparing it to like high margin services or even SaaS services.\r\n\r\n\r\nWell, SAS is going to be much higher than that. But I worked in healthcare services and our net margins were 10 to 15%. So  when I think of high margin, yeah. And  when I think of high net margins, I'm like, Oh, 20%. Talk to me about that.  And that and gross are all different too. But yeah, I don't know. It's not a massively profitable business.\r\n\r\n\r\nI think that some people will come in and figure out the AI thing and they're going to figure out scale. Obviously, if you work with very big influencers, those price tags are different. Yeah. And the great thing about that is you're doing about the same amount of work as you are for a lower influencer.\r\n\r\n\r\nSo the people that have those bigger influencers are going to do a lot better from a margin perspective as well. Interesting. My last question related to this is YouTube was your world, but I've seen you be really active on Twitter recently. Yeah. Why didn't you, why didn't you lean into YouTube? It seems like you know that world really well.\r\n\r\n\r\nYou're probably really well connected. You could probably grow fairly easily, but you went with Twitter, like walking through that thought process.  I'm a little more introverted in nature. So writing is probably a little bit more my alley than YouTube. That said, I'll be launching YouTube here soon. And the cool thing, yeah, I was lucky enough to work with YouTube and do some different things and, and understand a little bit about how to build channels and potentially make an audience work.\r\n\r\n\r\nWe'll see what happens with it. But yeah, I recorded a lot of videos. So eventually that'll be a plan to keep going. My whole thesis now is like. And after a couple of different businesses that have worked, I just really want to help entrepreneurs and help give back. I burned out hard because I wasn't paying attention to my core values.\r\n\r\n\r\nSo it's not, Hey, I want to go be a multimillion dollar influencer. It's more like, let's put out some value, see if we can help some people build a brand off of it and see what happens.  All right. I got some rapid fire questions for you. You ready? Yeah, definitely. What did you love about that business? \r\n\r\n\r\nRelationships. At the end of it, we work with some people that have massive followings or a lot of reputation, NFL Hall of Famers and different things like  they're humans. Like at the end of the day, like these people are humans. And so having human relationships with people that other people don't even think are human in some way is pretty cool, humbling lot to learn.\r\n\r\n\r\nSo, yeah. Okay. What did you hate? About the business,  any type of sales organization. There's just so much like bait and switch. There's so much like manipulation. There's so much lying. I'm not saying on our end, it's usually like, uh, on these brands and they just play games to try to low ball and save money, I guess you can say.\r\n\r\n\r\nSo I don't love those sales tactics. While you were in it and you were running the business,  what industries did you look at that? And you thought, man, I wish I was running a business in that industry. I'm really jealous of. These guys, I look for me, it's commercial real estate. I look at them and I'm like, gosh, that'd be so cool to just own a bunch of real estate.\r\n\r\n\r\nAppreciate it every year at three to 5%, collect my cash flows. I don't have to worry about much triple net lease. What was that for you?  A little more in a different left field direction, but amusement parks, amusement parks. Yeah. Yep. That's go on. We'll see if that's an end goal for me, but yeah, at some point, like I'm fascinated by that world.\r\n\r\n\r\nAnd I think that it provides a lot of value to people and you can do some really interesting things. It's high capital intensive thing, but I think you can build some communities. I think you can build some really cool things with it, but I'm fascinated by the big ones and even the smaller ones. What's your favorite?\r\n\r\n\r\nI think Disney World has done some incredible stuff, so I gotta look at them as a favorite. But there's even like the Great Wolf, and they figure out some really cool things with like kids and lodges. Dude, I go to Great Wolf Lodge. Do you? Every, every year we go down to, yeah, every, at least once a year we go to Southern California.\r\n\r\n\r\nWe stay at Great Wolf Lodge. And if you're from Southern California, right? Yep. That's right. Great Wolf Lodge in Anaheim is like a mile and a half from Disneyland. So we stay at Great Wolf Lodge. We swim, we get breakfast, we go to Disneyland for the day. We come back like  it's right. I like, yeah, I like Great Wolf Lodge.\r\n\r\n\r\nIt's a cool, cool. They're cool. Great models. There's capital intensity there, but it's not ridiculous. And so I think that there's some really cool things you could do in that space.  Very cool. All right. Last question.  What are you obsessed with right now?  Well, now that I've built a couple of companies, I've taken some time and mostly gotten to a cool place, building a new  company for entrepreneurs called tribe.\r\n\r\n\r\nIt's a peer community that I'm obsessed with and. My thesis of leading these businesses was, I was going to go heavier into more of the investment side, which I'm doing a little bit of, but falling in love with this company tribe. And now I'm going all in at this one, just have a huge vision for healthy entrepreneurs, building your community with thousands of members.\r\n\r\n\r\nAnd  yeah, I'm all in on it and then obsessed with my family too. It's a really interesting, of course, you're obsessed with your family.  That's a really interesting thing you say, because after I sold my businesses. I thought I was like, I'm going to invest a half a million dollars into SMB Twitter. And I got a bunch of inbound and they were great conversations. \r\n\r\n\r\nAnd I did invest about a hundred thousand dollars into a couple of businesses.  But what I realized is I don't know that I liked the investor game.  Like investment is just can be so passive, like maybe, maybe you have a board seat, maybe you have some input, but  I like the collaboration. I like getting to know people.\r\n\r\n\r\nI like feeling useful on that. What I'm contributing is actually being received in the way that it's intended. And as an investor or even a board member. You have, you can make your feelings known and you can give advice, but that doesn't mean that it necessarily translates into the business. And so it's harder for me to make the connection of, Oh, my time and energy produced this result over time, other than I made a smart bet five years ago.\r\n\r\n\r\nSo I had a similar experience of coming away from  investing. What do you love about the community aspect? Like why, why tribe you could do anything? Why launch a community? Yeah, first off, I feel very much the same. I now have a 18 point checklist of anything that I would invest in. And for me, it's like, we're not looking at just investing.\r\n\r\n\r\nIt's you need to be involved and I need to be passionate about it and helpful and all that good stuff. So, but tribe specifically, like in my journey of being a founder, it was very lonely. I had a lot of hard times that I wished I'd had. Yeah. Better abilities to reach out to other people and had a better peer community for it.\r\n\r\n\r\nMy family doesn't understand entrepreneurship. My wife is great, but doesn't understand entrepreneurship. My friends aren't entrepreneurs. So it was hard. I think some of the stuff that you go through, you just can't really talk about with other people. Or at least I felt that way. And I've also had some great mentors and executive coaches and things, and I've learned so much from them.\r\n\r\n\r\nAnd so I want to make that accessible to other people because there's so much power in having that, especially because of how hard it is.  And how many people I know are going through some real stuff. So it's just a massive passion product. What I'm building it off of is like what I want and need and want needed.\r\n\r\n\r\nSo I hopefully fill a need for myself, but also for a lot of other people that are going through. Exact same stuff. I feel very similar  to everything you just articulated. Entrepreneurship can be lonely and  people don't necessarily get what you're going through. It's part of the reason why I've enjoyed  a community like Twitter so much is because all of a sudden I can get connected to other people who have been through similar experiences and have some shared trauma, so to speak.\r\n\r\n\r\nBut if you were  talking, I wasn't prepared to ask this question, but it just popped in my mind. If you were talking to yourself 10 years ago,  Or somebody who was in your position 10 years ago, what advice would you give them based on everything you just said? What advice would you give an entrepreneur starting out you starting out  10 years ago?\r\n\r\n\r\nYeah, a few things  dream big and go for those big things, but also give yourself room to fail. I think that I was so afraid of failing and in the end I've learned way more from failing than I have succeeding. And so like that stuff feels hard in the moment, but you're actually going to be so grateful for some of that stuff that didn't go well.\r\n\r\n\r\nAnd then ask for help. I think that I didn't think I could ask for help. I felt like I had to portray a certain image that helped with other company. We had over a thousand employees. I felt like I needed to be strong and not let out.  Some of the emotional sides, but at the end of the day, we're all humans and you need that support and you need that help.\r\n\r\n\r\nAnd I think letting your ego grow and realizing it's going to be okay and people are there to help it's huge.  It's a beautiful first two goals. They go in tandem so well,  dream big and give yourself room to fail. I think those are usually you have the first goal and the second goal don't match, but that one is that dream big and it's okay to fail.\r\n\r\n\r\nSo give yourself some room to fail. That's. Yeah. I'm curious. It's going to stick with me on this one. I appreciate it. And I want to end it with you. Actually. I'm very curious. What would you say to yourself at age 25? I know you, you had a little bit different story of how you got into entrepreneurship. So you say a little bit later.\r\n\r\n\r\nWhat would you say to yourself earlier? I would say don't rush things. For you, Nick, for me, it's going to be a process. Don't be so focused on getting to where you want to get to that. You're not prepared to handle  gravity or the magnitude of that space, because I've seen too many people get to entrepreneurship and they bought that business and they just weren't ready.\r\n\r\n\r\nAnd it failed. That's a crappy experience. Now, ultimately that experience led them to do other things that made them hyper successful. But I would say don't rush to where you think you want to be.  Learn on other people's dime. It's okay to fail on other people's dimes because I'd much rather fail on somebody else's than mine. \r\n\r\n\r\nAnd I would say, continue to be curious.  I think that  I think people who are learners and who are curious.  Tend to be very  successful, and it's because they're constantly trying to figure things out. So in whatever you do, don't get so prideful that you can't be okay with asking the question. Why I ask the why I ask why all the time, and I know it sounds stupid in many ways, but it just helps me learn.\r\n\r\n\r\nSo I think those would probably be the advices are the advice I would give to people.  Resonates deeply.  What I wonder is if I was that age, would I be willing to hear it or would you have been willing to hear it or not? You have to go through an experience at first. Are people willing to listen? I don't know.\r\n\r\n\r\nYeah. If it was me coming in a time machine, giving that experience, then he giving that perspective, then yeah, I'd listen to it for sure. But I'm sure there are people who told me those things. And ultimately that's what I did. I did learn on other people's dime and I bought businesses. And by the time I bought them, thankfully I had that experience and it went really well for me. \r\n\r\n\r\nSo. I believe in that, but I think the other thing I would say is I really liked that this idea of like dream big because I've always dreamed smaller than I think I otherwise could have. And the example that I give is  the first house that my wife and I bought  after 3 years, we were like, oh, man, we could have bought a much bigger house and had more space and been much more happy with it. \r\n\r\n\r\nBut we were so concerned about where we were at that moment with our income level and student debt and all that other stuff that we made the safest decision.  And had I been a little bit more adventurous, had I been a little bit more confident or dreamed a little bit bigger,  it would've worked out for me very well.\r\n\r\n\r\nAnd even to this day, I'm still like, okay, maybe I'll plan for the worst case scenario. So I, I like that idea of  dream bigger. Life is short. If you fail. It's a learning experience. Fail quickly.  If you're gonna dream, you might as well dream big.  It's massive. I think, in closing, like, the way that I came to that was having a couple near death experiences.\r\n\r\n\r\nAnd so there's a quote I love, it's, You have two lives, the second begins when you realize you have one. And so that usually puts in perspective, what do I want to actually be doing because I don't know how long I have here, at least in this body, which plays with it with two things, that patience that you talked about, but also having that big vision to execute on that patients at least.\r\n\r\n\r\nSo  I love it. This was, uh, this was fantastic. Trenton, if you want people to find you, where's the best place to go? Yeah. As of now, probably Twitter most active on there. Trent J Hughes. The tag,  but yeah, we also have a link that tribe HQ. co is our community too. Perfect. All right, man, this was awesome.\r\n\r\n\r\nAppreciate it, man. Thank you.",
  "metadata": {
    "duration": "",
    "date": "2024-06-17",
    "platform_source": "Google Drive"
  }
}