{
  "episode_number": "125",
  "episode_title": "How to Build a Multi-Million Dollar Business with Nothing But Desire with Erik Kaiser",
  "guest_name": "Erik Kaiser",
  "business_name": "Glamcore Global, Riki Loves Riki, Crush the Memory",
  "transcript": "﻿Nikolas Hulewsky (00:00.175)\r\nYou know what mean? can. Perfect, perfect. All right, Eric, Eric Kaiser, super stoked to have you. I'm just going to jump right into it. You had a post a while back that said by 30, you were worth $10 million. Today you're worth $17 million and you've done all of this without like a perfect academic track record. You're running multiple companies. You've got this company called Glam Core. You've got this company called Riki Loves Riki, which I love the name.\r\n\r\n\r\nErik Kaiser (00:00.482)\r\nYeah, no problem. And I'll be looking at the camera the whole time.\r\n\r\n\r\nNikolas Hulewsky (00:30.319)\r\nYou're selling into 85 different countries. You've created over a thousand jobs. You own a factory in China. All right. So you're like, you're all over the place. And then you just launched this really cool product called Crush the Memory that is all over social media. I have a very basic question though. How did you go from this like eight year old kid who was struggling with confidence and focus to building this empire?\r\n\r\n\r\nErik Kaiser (00:52.248)\r\nthrough sheer desire, period. I mean, it really is. It's just desire. It's the old, know, show me the incentive, I'll show you the outcome. You know, my incentive was so high and it was a function of my desire. That's really it. And I think that's an important piece of information for people to understand because you do not need to be scheduled in life.\r\n\r\n\r\nNikolas Hulewsky (00:55.833)\r\nThat's it.\r\n\r\n\r\nErik Kaiser (01:22.144)\r\nyou need to just have this insane desire for something and it's achievable. And as soon as you have that people get it when you don't have desire, everything looks like everybody else is lucky. That's the those are the people who use the word luck like isn't he lucky like, know, for how fortunate that person is really desire is at the heart of probably everything that I've ever done.\r\n\r\n\r\nNikolas Hulewsky (01:49.059)\r\nWhat age did you realize you had ADHD?\r\n\r\n\r\nErik Kaiser (01:51.788)\r\nI really don't. know, I think it was, I think when I was a kid, people thought that you do and giving kids medicine is really great for schools because they can calm you down. But really over time, you can train yourself to have insane focus. And then, you know, I think for me, I never had traditional ADHD. don't have, I don't,\r\n\r\n\r\nI don't think I do. What I do have is a complete and total desire to succeed. that is very narrow. Very narrow.\r\n\r\n\r\nNikolas Hulewsky (02:29.583)\r\nWell, I asked the ADHD question, not because you've ever said that you have ADHD, but I talked to many entrepreneurs, I have ADHD. there's a strong undercurrent of entrepreneurs having a very similar personality with many of the ADHD characteristics. And there are different types of ADHD. There are the like, I hate authority, I'm bad behavior, I'm gonna give you the middle finger and do whatever I wanna do. And then there's the type that I had, which is a little bit quieter, but.\r\n\r\n\r\nYou can't focus. I barely graduated high school. You're constantly trying to figure things out, but you have an ability to hyper-focus or hyper-zoom in on things. And you're like maniacally focused on different outcomes, but you need different things to sort of satiate your curiosity. that's kind of where I'm drawing it from. like, you got a million different things going, but you are hyper-focused. You've got a lot of really good energy. And I think that those are pretty common characteristics in many entrepreneurs.\r\n\r\n\r\nErik Kaiser (03:27.96)\r\nThat I would agree. I think if you're classifying it that way, I'm a very, very curious individual who needs a lot of intellectual stimulation. that leads into, I think, how I often describe myself, which would be useful for this conversation, which is I'm a dot collector, meaning every piece of information is a dot. And then effectively, over time, you start connecting the dots.\r\n\r\n\r\nNikolas Hulewsky (03:50.447)\r\nHmm.\r\n\r\n\r\nErik Kaiser (03:55.924)\r\nI'm a dot collector. love learning. I'm constantly reading. I'm investigating something that's interesting. Today, this morning, at 4.30 in the morning, I put in a freedom of information request for information on airline security. I have an interest in something. I'm so growing. There's a data point. I want to know what the data point is.\r\n\r\n\r\nNikolas Hulewsky (04:18.595)\r\nYeah.\r\n\r\n\r\nErik Kaiser (04:23.346)\r\nAnd I'll end up publishing it when I get it all done. But, but there's a data point, right? And so, you know, I'm not a very good person when I'm bored. You know, I know a lot of people say like, you know, you get bored and you get your best ideas and all the rest of the shirt, you know, I understand that. But when I get bored, I get stupid. It's when my brain is engaged where I'm really, you know, moving. I'm not, I'm not, I don't have ADHD. I've never, I've never claimed that, but I do see how you would say like some of those features are.\r\n\r\n\r\nHD ish and I think my curiosity would probably lean me toward that direction.\r\n\r\n\r\nNikolas Hulewsky (04:58.031)\r\nI've had similar problems. My wife's always like, why can't you just stay at one place and work at that company for 30 years and be in one position? And I'm like, I wish that I could, I do sometimes wish that I could just be the guy who clocks in, clocks there for 30 years, builds up his nest egg, but I need to be overstimulated. Like I need a lot of different things going on in order for me to be my best and most productive self. It's when I have less things going on that I'm actually not great. I'm not productive. You would think.\r\n\r\n\r\nthink it'd be the other way around, but it's like Parkinson's Law. That's where I am with it.\r\n\r\n\r\nErik Kaiser (05:29.452)\r\nYes.\r\n\r\n\r\nI have a good anecdote to help answer that question for some people too, is that I also like, I could never work a desk job, but just I need full freedom to think and do and just energize. However, I have a very close colleague at the company whose parents are entrepreneurs and run a business and she's super bright. And she has told me, she's like, I don't ever want to run a business. She's like,\r\n\r\n\r\nI see what it does to families. looked what it did to my family and how, I never forget that. And I'm like, you they understand, you know, she understands she's super smart, but she understands also that there is a cause and effect. And she was, she gets to make a choice. You know, she, she absolutely gets to make a choice and she made a choice. She's like, no, I don't need, I don't need her want that. I don't want that same outcome. want something different. And so, you know, you worry about that stuff after work all night, every weekend.\r\n\r\n\r\n100 % I'm not going to you know, pay me to do what you need me to do. But it's not at the end of the day. It's on you. And so there's a there's a difference. You know, people, people, people can make it can make a decision about\r\n\r\n\r\nNikolas Hulewsky (06:44.441)\r\nAre you a lifelong entrepreneur? Have you always been an entrepreneur?\r\n\r\n\r\nErik Kaiser (06:47.342)\r\nOh, I've only had one job and it was working during summer between high school and college for two summers working at a boutique bond trading company in New York because I had this aspiration to become an index options trader from when I was a little kid. And I quickly exited any interest in Wall Street after having worked there and only started up businesses, including from when I was in college doing startups.\r\n\r\n\r\nNikolas Hulewsky (07:17.899)\r\nReal. Okay. So one of my favorite things that you do is very similar to my, my business partner, best friend, Chris Kerner, mobile home part guy on Twitter. He loves to just say like the, the mantra over and over, like constraints are a blessing, constraints are a blessing. And obviously you've been hyper successful. You've launched a lot of businesses. most recently you've launched this thing called crush the memory and the way that you've launched it, there it is. It's right around your neck. The way that you've launched it. It's like, there are a lot of constraints. You didn't go out and spend a million dollars on ads.\r\n\r\n\r\nyou created the distribution effectively. Has that been a mantra throughout your career? Have you always been sort of focused on the bootstrap, having constraints or is that something you've developed over time?\r\n\r\n\r\nErik Kaiser (07:58.722)\r\nMy whole life is about constraints. are no, yeah, there are no. So all of the companies that I've started, all of the industries into which I've gone are all done with my own little tiny bit of money, which I grew and some loans from my mom, just, you know, as a very rough way to try to describe the early stage. Everything I've gone into mortgage banking, everything I've funded myself and I continue to fund it myself. We have no investors. We have no\r\n\r\n\r\nNikolas Hulewsky (08:01.87)\r\nReally?\r\n\r\n\r\nErik Kaiser (08:28.204)\r\nthat we have no, no nothing, right? It's just eat what you kill. And I've learned that why that is so important. My wife and I are constantly at odds with this. She's like, why don't you just raise money to do this? Or why don't you just raise money to do that? And, and, and, she's not wrong. And she's absolutely not wrong. She's, she's right, except that I know that when there is a pot of money into which you can dip your hand to quickly solve a problem.\r\n\r\n\r\nproblem usually still exists. And all you've done is reduce the available cash and delay the decision making about what needs to be done regarding that specific problem. Rinse and repeat that process multiple times and you find all of a sudden, your pot is low and you have all of these problems still existing. And so I'm very much an eat what you kill guy. And everyone at the company knows that like, we don't have this line of credit, we don't have anything, we just have our cash.\r\n\r\n\r\nAnd we have to make every decision we make has to be based upon is this the right decision or is this some stupid risk because we have to use our own cash and our and our staff is really pretty respectful of that quite honestly.\r\n\r\n\r\nNikolas Hulewsky (09:42.351)\r\nHave you ever raised money? Is that frame of reference from experience or is that just you thinking, hey, that's usually what happens is if you have money here, you're making stupid decisions and then you still have problems even after you spent it.\r\n\r\n\r\nErik Kaiser (09:55.438)\r\nWhen I was in real estate developing multifamily properties on a commercial scale, large buildings, not like three unit buildings, but like, you know, 50 unit buildings or more, 70 or 100 unit buildings, I would raise equity through, you know, relationships that I had. That's not, that's raising money to get a deal done. I'm still taking on the debt. I'm still taking on the construction risk and all the rest of it. When\r\n\r\n\r\nCompanies raise money from a VC for instance. They will be using that money for a variety of different purposes, of course, with all with the intention of growing the business. However, often businesses encounter lots of problems and they do not have a solution. The brain damage it takes to try to create the solution or figure out how to solve something so high.\r\n\r\n\r\nthat there's usually a slug of cash that can be thrown at it to help the problem go away, but usually recurs. And so I, I'm not really a, an advocate for just dumping money on people and saying like, you'll figure it out because usually what happens is and why there's such low success in the venture capital world is that people will spend the money to solve problems and grow and\r\n\r\n\r\nas they grow the problems exist and eats up the cash and then it just goes flat. So yeah.\r\n\r\n\r\nNikolas Hulewsky (11:23.983)\r\nHow big is your administrative team? You said our team, my team knows. What does that mean exactly?\r\n\r\n\r\nErik Kaiser (11:29.624)\r\nSo we have effectively offshored a bunch of operations instead of growing them organically. So in the United States, we have about eight people. Then we have an operation in Colombia, which is about 10 people. We have an operation in Philippines, which is about 10 people or so. And then we have our factory in China, which has\r\n\r\n\r\nof course, a white collar staff and then the blue collar assembly. And we have, think right now, we're probably at 40 people there or so, roughly about 40 people.\r\n\r\n\r\nNikolas Hulewsky (12:08.143)\r\nOkay. What does each one of those units do, I guess? like, does the team in the States do? What does the team in Columbia, Philippines and China?\r\n\r\n\r\nErik Kaiser (12:15.598)\r\nSo in the United States, do engineering. So our crush engineering is all done in the US. Pretty much. It's not something you just want to hand off to people in foreign countries all the time. That doesn't mean that it's better. We really do need a good team, and we've got a team here. We have operations, global operations in the United States. We've got global marketing in the United States.\r\n\r\n\r\nNikolas Hulewsky (12:22.149)\r\nreally?\r\n\r\n\r\nErik Kaiser (12:44.814)\r\nAnd we have a paid store marketing team, effectively our big marketing team, all the head of marketing is in the United States. Then in Colombia, it's all of the email marketing, graphic design, video editing, all those people are in Colombia. And then in the Philippines, we have mostly customer service and some operations. And then in China, we have some operations, some customer service, and then our product development team, which is\r\n\r\n\r\nwhich is produced in India.\r\n\r\n\r\nNikolas Hulewsky (13:15.107)\r\nWow, all that team is crush the memory. That's not the other cup. OK.\r\n\r\n\r\nErik Kaiser (13:19.094)\r\nNo, no, no, that's globally. So the way you can kind of think about is I have this organization, the structure of all these business units that all work and we incubate brands. And from the infrastructure that we have, the incubation is easier because each startup is almost incremental. Everything exists, ERP systems, operations, shipping, warehousing, all that stuff. And then it makes it easier to incubate the brands. then\r\n\r\n\r\nNikolas Hulewsky (13:41.507)\r\nYeah.\r\n\r\n\r\nErik Kaiser (13:48.024)\r\npeople get dedicated to the brand.\r\n\r\n\r\nNikolas Hulewsky (13:50.669)\r\nOkay, so you're incubating these brands and then you're funding the incubated companies with the cash flows of the brands you've already launched. Okay, that's man. So how many brands do you have? So outside of crush the memory, like how many companies do you have within this? I'm not gonna say hold Co, because it's it's not exactly.\r\n\r\n\r\nErik Kaiser (13:56.941)\r\nThat's correct.\r\n\r\n\r\nErik Kaiser (14:11.704)\r\nWell, it's not a whole code. It's one company with multiple brands. Crush will be split off soon because it is going for a capital raise, which I can explain. But we have a company called Glamcore with the primary. The name of the company is Glamcore Global, but that is our primary brand. That's the brand with which I started. Then we incubated Ricky loves Ricky. And these are in the beauty industry. So most guys don't really know it, but a lot of women do. But we have professional.\r\n\r\n\r\nbeauty lighting products, and we have consumer products that you find in Nordstroms and Bloomingdale's and stuff like that. So then we incubated a brand called Tyco, which is a CPG brand for different, which is still in its hardest road right now. We haven't made any real traction with it. And there's a reason for that. But it sells a shampoo, conditioner, body wash in bottles that are refillable that you can put in your shower.\r\n\r\n\r\nAnd it's a great brand. were attempting to turn it into an Amazon brand and it did not compete well on Amazon for how much money is required to invest, let's just say. So we've switched tune with that. just pulled that. We just changed our strategy in Q4 last year with that crush. We just incubated crush. just\r\n\r\n\r\nWe just incubated Best Combs. This is a is a comb line is very interesting that we engineered using our team. And we have another that's just coming to market literally this week. Literally, we did it on Kickstarter. We just put it on Kickstarter to see what would happen without any marketing or anything. We did it stone cold and did like 10 grand or a little bit more, but just say 10,000 bucks and people buying combs because of the story behind it. And then we have another brand.\r\n\r\n\r\nNikolas Hulewsky (15:47.215)\r\nThat's amazing.\r\n\r\n\r\nErik Kaiser (16:02.936)\r\ncalled Lollipops, which is landing in my warehouse at the end of the month. So sometimes this week it will land. that's a JV. Best Combs is a JV and so is this other lollipops brand. And they all have different strategies. Like Best Combs is a very completely, is a totally different strategy. It's very focused on one job, one goal. We know exactly what we want. We know exactly how we're going to go get it. Lollipops, same deal.\r\n\r\n\r\nNikolas Hulewsky (16:26.713)\r\nMm-hmm.\r\n\r\n\r\nErik Kaiser (16:32.654)\r\nSo I have all these different brands that get incubated and launched and tour right now, literally this month.\r\n\r\n\r\nNikolas Hulewsky (16:39.545)\r\nCan you give me an idea of, let's say all the brands or that company, top line revenue, like just size?\r\n\r\n\r\nErik Kaiser (16:46.476)\r\nYeah, so, so we are now in a downward trend. over COVID, let's just say we did about 18, it was more just say $18 million. And then since COVID ended, we had a sharp decline in revenue. Some of it is related to iOS 14. And then some of it is just related to consumer demand. Demand for our products picked up tremendously during during the pandemic.\r\n\r\n\r\nand then fell off. We're okay with falling off. And by the way, I could care less about top line, completely irrelevant to me. It means nothing to me. The only part of a revenue stack that matters is what the profit is. And show me that you're profitable. So we'd like more profits, of course, but even still in the year following COVID, we did, I think, 17 million and lost a million or something that year. Yeah. So, you know,\r\n\r\n\r\nThat's why I don't like chasing top line. I like chasing bottom line. however, this past year, just closed to tell you how far the drop goes. We just closed 2024 and the total revenue was over seven and somewhere a little above seven million dollars. You you're talking about a you're talking about a huge drop. However, with that, our profitability dropped. Still, we've been losing money for over a year and\r\n\r\n\r\nwhere I started restructuring the company back in July of last year. And we're at the last quarter of restructuring it to get right side up again. And, you what's funny is we'll do, I don't know how much we'll do this year. I've stopped predicting five, 10 million. I really don't know. Really, everybody's like, well, what are you going to do this year? I don't know. Like, you know, I don't know. I really don't. Like, you know, we what we kill. My only job is to make sure, you know, we have enough profits coming in.\r\n\r\n\r\nAnd we don't burn through all of our cash constantly. Right. That's, that's the job. And so, in terms of revenue, I really don't care about revenue. I've never been like, we've got to get more revenue, more revenue. did that at one point and lost money. I'm like, okay, great. What's the point? Like you can really spend a lot of money on ads. They, they'll, they have a very liberal policy on taking your money. But, know, but you know, if you're not making, if you're not making, profits, you're not in business effectively.\r\n\r\n\r\nNikolas Hulewsky (19:09.943)\r\nNo, no, I totally believe the same thing. If you're chasing top line, it doesn't mean anything. You can have a business doing $30 million a year losing money and you and you can have another business doing $2 million a year in top line and they're making a million dollars a year. Which one of those businesses is better?\r\n\r\n\r\nErik Kaiser (19:25.848)\r\nThat's correct. That's right. I only focus on bottom line. I don't care. don't care. I don't care. Anybody, anybody tells me their revenue. I'm like, I don't care. It's just like in real estate. When I used to build buildings and be like, I'm building a hundred units. I'm like, all right, I'm building nine. And then when you get down to it you look at the whole, you know, cap stack and what they've actually invested, even if they've invested less than you, you're, probably I'm doing nine units on my own. I'm getting all the profits and I'm making maybe the same as them. And they're doing\r\n\r\n\r\nall these bigger units and buildings for all this risk when really they're not getting anything out of it. I've been on both sides.\r\n\r\n\r\nNikolas Hulewsky (20:05.199)\r\nI prefer revenue just because it helps me understand how big of a project or how big of a company, because healthcare, for example, I can have a business doing $20 million a year in healthcare, but we're doing maybe $2 million a year in profit. So then you have another business doing $8 million a year in e-commerce and they're doing the same amount of profit, right? But it tells me if you're doing $20 million a year in revenue, it's like, oh, you've got a big team. There's a lot of operations there. It at least gives me an idea of\r\n\r\n\r\nthe size and scope of the business that you're operating as opposed to just looking at profit. Plus people are a little bit less likely to tell you their profit as opposed to their revenue. They'll at least open up about the revenue piece. Okay, so you're touching on something that I think is really interesting and it's this. When people invest in the stock market and they say, hey, put your money in an index fund. They say, you're gonna make 10 % a year over the next 30 years. It's like, which is true.\r\n\r\n\r\naverage, that's been the historical average and moving forward, you'll probably make 10 % a year on your money. But it doesn't look like this. It looks like this. It looks like a roller coaster, right? There's pops and there's dips and there's pops and there's dips. And anytime that the market goes up and has an all-time high and it comes down and it consolidates and then it builds back up again, the same is true in business, right? You have years that are high water marks and they're phenomenal years. And then you have years where you've got to invest but the\r\n\r\n\r\nThe hope is that over time, that value continues to rise and go up. It sounds like you're just in a consolidation period with your companies.\r\n\r\n\r\nErik Kaiser (21:42.993)\r\nYeah, it's it's these are, you know, this is why I have no problem talking about it, you know, come see me in five years like it's just business goes up and down. It just does. There are and I think there are so many people who are distracted by just the ups you because the stories are so awesome. You just hear about these companies. They started growing, growing, growing. And then, you know, all of a sudden, amazing exits and then all of a sudden\r\n\r\n\r\nyou start looking around, you're like, I must be doing something wrong. And that's just not true. I did think that at one point too, but I look around and it's funny when you start, there's a, there's a great quote and I reference it off often from rules for a night that Ethan Hawke published. and one of the great quotes in that book to me is, you know, when, when you, when you compare yourself to anyone or anything, you end up with only two variables, vanity or bitterness. And\r\n\r\n\r\nAnd it's very true. And when you think about it, it's like, you you start comparing yourself to these companies that go straight up, they've got, you know, their unicorns, whatever, whatever acronym people want to use for description, adjective, doesn't matter. Like, don't compare yourself to them. Compare yourself to like, no one else just do your job. Like, whatever it is, if your revenue is great, great, if your revenue is not great, whatever, like, just keep going. Just continue to iterate.\r\n\r\n\r\nNikolas Hulewsky (23:00.995)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (23:07.439)\r\nI agree with that. I do also understand that it's hard. You want to know if you're doing a good job. You want to know how am I doing compared to other people, especially in the beginning, right? As you're getting established, once you've had some success and you've been established and you're like, okay, I know what success looks like. I've been down this road before. I'm not worried about comparing. Then you have perspective that can ground you and you can be more mature. But definitely as you're getting started, you want to know like, am I on the right track? Am I doing the right thing? So I do understand.\r\n\r\n\r\ncomparison game, but it's a losing game. There's always going to be someone smarter than you. There's always going to be someone better than you, more successful, better looking, better in shape. There's no end to that.\r\n\r\n\r\nErik Kaiser (23:42.798)\r\nThere's also an enormous amount of distraction in that because you don't know what the inner workings of another company is like, you don't know their profitability really, you don't know anything. You're just hearing, you're filtering out for what's better about them than you in your own opinion. And that's very toxic. my wife goes to this all the time, you we work together and I'm always, you know, steering the boat looking and I'm like, I know\r\n\r\n\r\nThere's a new M &A wave coming at some point, rates are going to come down. Like, there's going to be a big M &A wave at some point. I'm building into that M &A wave. And so, you know, she's like, she looks at all these other companies, and all of a sudden one is just gone. It's like, the company's gone. Like, wait a second, I thought they were doing amazing. Well, apparently they weren't. And apparently they ran out of VC cash, and now they're no longer in business. And all of sudden, you know, was a topic of conversation for years, how amazing they were and how stupid we were.\r\n\r\n\r\nlook at what they're doing. And I'm like, well, look, we're here. They're not. And so that's a common, that's very common, like, keep your eyes open for that.\r\n\r\n\r\nNikolas Hulewsky (24:41.997)\r\nRight. And they're not.\r\n\r\n\r\nNikolas Hulewsky (24:51.151)\r\nAll right, before I get into crush the memory, my last question, it sounds like you've built this really cool company that has a bunch of different brands. What made you decide to do that?\r\n\r\n\r\nErik Kaiser (25:02.638)\r\nI think it goes back to the beginning of our conversation was like, okay, I have all these different interests. You know, I'm a problem solver by nature. That's what I do. And I solve with design and form and function and engineering. It's just who I am. I'd like to see a solution to something. And why we have incubated all these different brands is because we can. What's really hard is the initial startup getting lift, getting off the ground, building an organization.\r\n\r\n\r\nhaving cashflow and then having enough where you're like, hey, I've got another idea. Why don't we try this? And you can go into that direction. You need to really build that first company solidly. And so here I have this factory in China. Think about it. When you sit back, you zoom out for a second, like, wait, you've got a factory in China. You've got an operations team. We've got warehousing. You've got design. You've got engineering. You've got all this stuff. What else can you do? And all of a sudden, you're like, well,\r\n\r\n\r\nyou know, I see another problem here in the market. Let's let's look at attacking that and the difficulty with every single exploit goes down tremendously. So you could literally incubate a brand on this call. And within a couple of days, we could have kind of collateral. And now with AI stuff moves very quickly. And all of sudden you just you can\r\n\r\n\r\nform a brand and image, can have actually product renderings and you can actually go to market if you really wanted to. Like that's how quickly it can happen.\r\n\r\n\r\nNikolas Hulewsky (26:37.017)\r\nWell, there are VC incubators, right? People go out and they're like, hey, I have experience in this area. He has experience in this area. She has experience in that area. We would like to launch consumer products because of our shared experience. And they raise money and then they have an incubator that they incubate companies and spin them out. You didn't do that. You built companies. The cash was from those companies then fund the incubated ideas. So it's, it's, it is different. And I will say, as we were talking about venture capital, this was an eye opening statistic for me. It goes back to constraints.\r\n\r\n\r\nErik Kaiser (26:59.31)\r\npercent.\r\n\r\n\r\nNikolas Hulewsky (27:07.501)\r\nWe see all these stats. this company raised a billion dollars at a $10 billion valuation, whatever. Do you know what 50 % of that money is spent on? It's spent on Facebook and Metta acquiring customers. That's what 50 % of their money is spent on. And it just blows my mind that that's what they're throwing money at. You effectively have figured out, all right, I think I can understand the distribution. I know how to design things. Let's have an incubator because I've got some secret sauce.\r\n\r\n\r\nErik Kaiser (27:20.142)\r\nGreat. Yeah.\r\n\r\n\r\nNikolas Hulewsky (27:37.485)\r\nor secret sauce might be too strong, but you have a competitive advantage in the ability to get stuff to market and a distribution channel to sell it through.\r\n\r\n\r\nErik Kaiser (27:37.602)\r\nYeah.\r\n\r\n\r\nErik Kaiser (27:44.524)\r\nYeah, but you still end up. Unless you have a product that sells itself is in such high demand, you still need to. Use ads and you know, for this Tyco brand, we tried some ads, we didn't get much traction, we went to Amazon and now we're going to do it completely differently. And I really think this is important. This this is so important.\r\n\r\n\r\nIt's so easy to throw money at ads and people do and some people are successful. Some most people aren't really not. But when you do that, you do constrain yourself to then just ads. And we've had this Tyco brand and we're sitting on inventory. The inventory expires at the end of this year. So now we've tried different ads. We've tried Amazon. We've tried some stuff. Now it's like no.\r\n\r\n\r\nNow you have to be more creative. You're like, now let's find another avenue. I don't give up on anything. There's no, there's not like, oh, well, fuck it, just shelve it and you know, whatever. Like that's not me. I'm like, I will, because each of these\r\n\r\n\r\nNikolas Hulewsky (28:57.423)\r\nLike how much do you have sitting in inventory?\r\n\r\n\r\nErik Kaiser (28:59.182)\r\nOh, it's like $50,000 worth of probably it's like, I don't know, like 12,000 or 15,000 minutes of stuff. It's you're not talking about anything crazy, but I'm not willing to just let it die in the vine for 50 grand. like, no, it's not going to I spent 30,000 on the domain itself. OK, so what I'm trying to get it is you have to continually.\r\n\r\n\r\nthink about more creative ways to access channels, create channels, find a way to move it. So now I have another idea. I'm like, OK, hotels, Airbnb. I'm constantly in one of those keys will unlock a door that we would never have thought of earlier if we were just doing a ROAS 2.3 on meta and just clicking by. then something more spectacular will happen as a result of these constraints.\r\n\r\n\r\nSo that's where I'm at. I'm like, I'm super energized about this brand because it's done really not much. mean, like not much, $10,000 or something. I mean, we're talking just not a lot and no one's focused on it because we have all these other jobs. So that's something else resource, know, resource attribution.\r\n\r\n\r\nNikolas Hulewsky (30:02.98)\r\nYeah?\r\n\r\n\r\nNikolas Hulewsky (30:07.503)\r\nOkay, so there's two sayings that have come to mind for me and they're both venture sayings. The first one is first time founders focus on product and second time founders focus on distribution. And I think you focus on both, but it's obvious you're very concerned with the distribution piece. The second saying is hardware is hard. So I wanna know this crush the memory. It's an amazing idea, but walk me through, okay, first of all, what is it? Where did the idea come from?\r\n\r\n\r\nAnd if hardware is hard, why did you decide to make a hardware product?\r\n\r\n\r\nErik Kaiser (30:40.418)\r\nWell, I didn't know hardware was hard. So I'm ignorant. No, I'm just telling you, I'm an ignorant person. I'm very naive. not I'm not interested in. You know, I just do stuff like going to China. I just moved to China like like I didn't I didn't know it was hard or it's just a challenge like you just I just that's just what I do. I see what I want and I go get it. So\r\n\r\n\r\nI hear hardware is hard. And yeah, it is. It is hard if you're just some dude, you know, but here I am. You know, I'm living in China. I'm building products that I've never built before that I find are much easier than building a building because it's only a certain number of parts. You you get your hands around and you get some you get your hands around products. You get some experience and then you start understanding. And all of a sudden, if you keep looking at something long enough and you keep having a conversation like, that's what it is. interesting. OK, cool. And then you start\r\n\r\n\r\ndeveloping it. And I can just give you an anecdote and then answer your question more directly, which is when I first started working in China back in 2010, I would visit factories and they would make electronics. When I used to see these assembly lines for the electronics, would blow my mind. They're so complex and so technical and so beyond my understanding at the time. And it was just I was just like, I was amazed. I was like, I was like, wow, that is like\r\n\r\n\r\nThat's cool stuff. Guess what? You know, I have one of those assembly lines now. And it just, you know, time after time, more visits, more factories asking a question like, what is this machine doing? You're like, that's what it does. it's a feeder. OK, that's what that is. What does this do? does that. And then you see how it all goes together. And over time, the longer it's not a mystery, all of sudden it's like, we can just get our own. Like, why don't we do that? We just need to hire the right operator.\r\n\r\n\r\nAnd so you do. And so now I've got a very technical SMT line that assembles circuit board, surface mount technology. So when you get an electronic, it has a circuit board in it that's called a PCB, printed circuit board. And all those components have to go on the circuit board. That's done with a very high speed, technical, expensive machine and a line that takes it and puts a solder mask on and drops components and picks the components super fast.\r\n\r\n\r\nNikolas Hulewsky (32:44.099)\r\nWhat's SMT?\r\n\r\n\r\nNikolas Hulewsky (32:58.895)\r\nMm.\r\n\r\n\r\nErik Kaiser (33:06.638)\r\nand then puts it through a reflow oven. just like all that stuff was foreign language to me. Now it's just, that's what we do. It's my favorite process and I own it. So, know, I think that getting familiar with something makes it easier. And then you see that, oh, I can do that. So when people say hardware is hard, yeah. Like when I first got into China, hardware was hard. I had to rely on all these people, processes I didn't understand and kind of like go with it. Like, yeah, that sounds fine to me. And making decisions about\r\n\r\n\r\nNikolas Hulewsky (33:14.841)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (33:35.503)\r\nSo this isn't the first hardware that you've developed.\r\n\r\n\r\nErik Kaiser (33:37.678)\r\nNo, not at all, not even close. As a matter of fact, one of the easier ones.\r\n\r\n\r\nNikolas Hulewsky (33:43.789)\r\nWhere did the idea come from?\r\n\r\n\r\nErik Kaiser (33:46.306)\r\nfrom speaking to an individual about, yeah.\r\n\r\n\r\nNikolas Hulewsky (33:50.019)\r\nSo for those who don't, sorry, sorry. For those who don't know, Crush the Memory is.\r\n\r\n\r\nErik Kaiser (33:53.868)\r\nIt's an AI recording device. And you just literally press a button, speak into it, press it again. And that audio file will go from your device through Wi-Fi into a back-end server, secure, encrypted, transcribe, and give you a note in our crush app on the phone. that note is actionable. That can be searched with AI. It can be put into folders. It's a phenomenal.\r\n\r\n\r\npiece of software, but the hardware itself is there to capture ideas and thoughts and conversations when they occur. It's not for most people. It is what I've learned is it is for effectively the C-suite and independents who are running businesses and depend on their thoughts and ideas in order to advance their lives and careers. It's not for an Amazon driver who's watching,\r\n\r\n\r\nlook in the clock out and get a 12 pack and chill out.\r\n\r\n\r\nNikolas Hulewsky (34:56.089)\r\nI've got an amazing vertical for you to sell into that I'm excited to talk to you about, but I'm going let you – how did the idea come about in the first place?\r\n\r\n\r\nErik Kaiser (35:03.982)\r\nSo talking to somebody who was writing and I said, what are you writing? And they said, well, I have to write down everything or else I forget. And then it just developed into a conversation about where you get ideas. And this person, this individual is chock full of ideas like me. And we were joking about how that, you you get so many in the shower and we were laughing about that. I'm like, you know what, I think I'm going to go on Amazon and go buy something to, um, that's commercially available. That has, you know, is a solution to this problem.\r\n\r\n\r\nand put it in my shower because I get tons of ideas in the shower. And like, it's always a place and always like, Hey, Siri, you must first unlock your phone. You're like, you're with that thing. Like, it's not convenient. You can't, you can't do anything. Really. It's, it's a wildly inconvenient place. And then through some discovery, learn that not only was there, was there no actual solution, there's no, there was no solution in the market to be able to just capture thought really quickly. People have attempted, but it didn't exist. And so I said,\r\n\r\n\r\nNikolas Hulewsky (35:39.512)\r\nYeah, seriously.\r\n\r\n\r\nErik Kaiser (36:00.588)\r\nHmm. I said, I need this. I'm going to develop it and I'm going to make it commercial. I'm going to commercialize it because I'm not the only person who needs this. And there are dementia patients who purchase from us. have mostly C-suiters. That's really our biggest audience and independent individuals, you know, who are either running companies or they are, they're, they're solopreneurs. They're people who are\r\n\r\n\r\ncompletely dependent on oneself in order to advance.\r\n\r\n\r\nNikolas Hulewsky (36:31.663)\r\nSo what was the timeline between having the idea, oh, this would be really cool to product in hand of consumer?\r\n\r\n\r\nErik Kaiser (36:38.418)\r\nThis hardware, the hardware was done first. The hardware was like, yeah, we knew exactly what to do. We looked at different chip sets. We're like, OK, what about this? Let's get some SDKs. Let's put this together. Let's program it. All right, we have to figure out the programming. use a chip set that required us to learn new programming. So that slowed us down a bit. But the hardware was there. And then we're like, all right, I did the UI. I'm like, let me design this app. I'm like, I'm a person who's very focused on organization.\r\n\r\n\r\nNikolas Hulewsky (36:42.959)\r\nErik Kaiser (37:03.864)\r\nSo I'm really good at organizing, like exceptionally good at organizing. So I'm like, this is where I can shine. like, can create an app that is so simple on purpose, very complex when you look behind, but it's very simple, is very familiar, has great organization tools that anybody can use. I'm like, that's the challenge. So let me dive into that. So I did that. I created the UI. And then we started coding.\r\n\r\n\r\nAnd the understanding of how this can be used continued to evolve and change and conversations with people. we pivoted and we got to a point where we had to rewrite from scratch and completely just scrap it. So the timeline was October 21. I got the idea and started doing research and discovery. By the end of December, I had a UI.\r\n\r\n\r\nNikolas Hulewsky (37:53.368)\r\nWow.\r\n\r\n\r\nErik Kaiser (38:00.942)\r\nWe had a conceptual piece of hardware designed on paper and we didn't launch. We didn't ship until just say October of 24. Think about that three years. The challenges were awesome. Let me just say because here we are. We're really good at hardware. We can do lots of hardware stuff. But now there's this entire new back end.\r\n\r\n\r\nNikolas Hulewsky (38:13.804)\r\nmy gosh, three years.\r\n\r\n\r\nErik Kaiser (38:30.062)\r\nthat we had to go and learn and we, you I know how to code, but I don't code anymore. And I started doing some like software layer software layer was, was a major challenge for us major. And for other people, you know, some people are like, oh, the software you do this on the other. The problem with the analysis is, that we, we know software too, like we understand except that what is the into what will this evolve?\r\n\r\n\r\nNikolas Hulewsky (38:35.459)\r\nYeah, was it the software layer or was it the, okay.\r\n\r\n\r\nNikolas Hulewsky (38:44.312)\r\nReally?\r\n\r\n\r\nErik Kaiser (38:59.308)\r\nwhat we're going to spend money on now, will we get a return out of it later? Will we need to pivot? We had a developer who didn't understand ultimately that this was, they thought this was just like a DIY kind of project and completely misled us and what the best way to go about it was, had to scrap that rewrite. And then we got smarter and smarter and smarter along the way to the point now we're like so smart with this stuff. After three years, I have a brilliant engineer by the way, his name is Josh.\r\n\r\n\r\nAnd he and I, you know, lead this team and we learned over the course of years and trial and error what the what the right what the what the right model is for this. And we now understand why other people failed at this. We've learned along the way that somebody else had tried almost exactly the same. I mean, it was crazy. We were shocked when we saw it was a patent search and it was expired, but we never saw it ever. And it was like\r\n\r\n\r\nwas uncanny, they completely fell, we totally understand why they even documented like, we have to start over and we need money to start over. I'm like, I'm like, I get that we did that three times. I'm like, so I'm like, I understand why these companies fail. I understand why some of these other big people who are doing this are not even in the market yet.\r\n\r\n\r\nNikolas Hulewsky (40:15.393)\r\nOkay, you had to start over three times. In 2021, mean, AI was known at the time, but it was not, I want to say ChatTPT came out in 2023, right? So it's like, this was early for AI and it's now, like you're now positioning it as an AI device. Was that the thought at the time or has it evolved because AI came out?\r\n\r\n\r\nErik Kaiser (40:25.346)\r\nthree.\r\n\r\n\r\nErik Kaiser (40:38.67)\r\nTotally evolved. my God, Nick. We were just now sunsetting the existing architecture that we have. We're about to launch next month a whole new architecture. We know where we're going now. It's so clear. You know, we rewrote again. We saved a lot of the code base, but we've moved databases. We were like, now we know what the future looks like. Before it was like, to where you were and they're like, we can integrate the\r\n\r\n\r\nNikolas Hulewsky (41:04.655)\r\nMm-mm.\r\n\r\n\r\nErik Kaiser (41:08.586)\r\nAI into it now and like, it's expensive, the price, now we've got this unlock. Now I'm like, I'm extremely clear on where we're going. I'm extremely clear on what we're doing. I know exactly how to do it. And now it's the real opportunity, right? The AI is taking us there.\r\n\r\n\r\nNikolas Hulewsky (41:23.801)\r\nHow much, when you started, how much did you think it was going to cost you to go to market and how much has it actually cost you to get to this point? Like what are you invested into the company?\r\n\r\n\r\nErik Kaiser (41:33.038)\r\nI said in the beginning, I'm like 250 grand, get us into the market. We'll start making money. No problem. I'm probably, I know it's over a million dollars now. I don't know how far over I stopped counting, but if I run a report and that's, we is probably going to be like a million, two 50 or million three. And so we've gotten some revenue. Of course we did our Kickstarter campaign. We have sales coming in, but we know this is well over a million dollars of my cash that we've invested.\r\n\r\n\r\nNikolas Hulewsky (41:59.769)\r\nDo you think if you would have raised VC money, you would have been able to get to this point?\r\n\r\n\r\nErik Kaiser (42:05.378)\r\nYes, I would have, absolutely.\r\n\r\n\r\nNikolas Hulewsky (42:06.415)\r\nYou do. Okay. I just think from the perspective of when you're in control of your own destiny, you can fail a couple of times and you can continue to fund it. But when you've got investors backing you, when you failed that first or second time even they're like, are you the guy? Are you able to figure this out? I don't know about this, right? And so they stop writing the checks. That's more why I asked the question because\r\n\r\n\r\nErik Kaiser (42:24.334)\r\nYeah.\r\n\r\n\r\nErik Kaiser (42:27.938)\r\nI think if you put it into that framing, I would say, 70 % of the people would have bought the balance of the story. And by the way, take this all the way back to the very beginning of our conversation when you and I were talking, maybe even before we started rolling, is that this is why I like to fund my own jobs. Because I can get them off the ground, I have to make decisions, I have to make the right decisions, and I have to eat it.\r\n\r\n\r\ndoesn't work, it's mine. I own it. So I don't I you know, I can't complain to anybody else. So it forces you to be very clear on exactly what you're doing, you must figure it out, you have to make the right decision. If you don't, you pay for it, you got to go make the next right decision. And so there's a there's a process. Some VCs I know, understand that process, I could always show something for my work, there was nothing it wasn't like it doesn't work, it does work. It's just that to really make it scalable. And I say scalable.\r\n\r\n\r\nin the true term of it, meaning bring a million users on from zero and not having it break, you need to do something better.\r\n\r\n\r\nNikolas Hulewsky (43:36.569)\r\nNo, I have this AI product right now. So my background is healthcare. In fact, that's one of the things I wanted to talk about with crush memory with you and exited a few companies and decided to fund this AI healthcare startup where we help the long and short of it is we help skilled nursing facilities identify diagnoses upfront because they get faxed hundreds of pages of documents and the nurses, they literally cannot read through all those documents. And so AI is really good at that. They can read it, synthesize it, make recommendations. It's great.\r\n\r\n\r\nBut over a year and a half span, two years span, I put $100,000 into it. And like I had to write the check and it was getting to the point where I'm like, is this worth it? Are you the guy? Like, can you figure this out? Well, we had an operator who was working on it and he has now turned the corner and it's going well and it's being, stuff's really good. But you know, I know that from personal experience where you're looking at something that you're funding and thinking, should I keep going with this? It's just a hard place to be.\r\n\r\n\r\nErik Kaiser (44:35.008)\r\nYeah, I know how difficult it is to make money as a VC. And it's hard to know that it's difficult to make money and have to keep footing a bill for changes, you know, especially when it changes completely. You know, the original the company that I started Glamcore was supposed to be a makeup company. It's not it turned quickly into a lighting company. Like, you know, who would have ever let me pivot? Right?\r\n\r\n\r\nNikolas Hulewsky (45:03.99)\r\nExactly. Yeah.\r\n\r\n\r\nErik Kaiser (45:04.622)\r\nYou know, however, I've broken off Crush and Crush is going to go out for a raise after I launch the next iteration where we're ready to feature add and we start adding the new features. Then it's a different story.\r\n\r\n\r\nNikolas Hulewsky (45:21.551)\r\nSo this was gonna be my question. I've always viewed Kickstarter as somebody who puts the product on there that's like, hey, I don't have the money to produce this. Let's kickstart this project, right? And then people fund it and they go and do it. Did you need the money to go on? Like, why did you go on Kickstarter?\r\n\r\n\r\nErik Kaiser (45:39.72)\r\nI, so I'm a product developer and a successful one. And I had never launched a Kickstarter campaign ever. And I was always curious about it. I was like, and I know it's a great marketing platform, if anything, I'm like, I want to learn it. And so I decided along the way that I saw some other like, plod was on there. And there are some other recording devices. like, you know, look, there's an audience here clearly.\r\n\r\n\r\nNikolas Hulewsky (45:43.247)\r\nMm-hmm.\r\n\r\n\r\nErik Kaiser (46:08.782)\r\nLet me at least learn Kickstarter. And I have no downside to putting it onto Kickstarter. And all I need to do is learn it. So I hired an agency to help me understand how to do this and how to launch on Kickstarter properly. It was like $9,800 or something. Best $9,800 I spent. I completely understand how to...\r\n\r\n\r\nhow to launch on kickstart everything. We've launched three campaigns now on Kickstarter of crush being, being one of them with all that. So it's yeah.\r\n\r\n\r\nNikolas Hulewsky (46:41.711)\r\nDo you do you like Kickstarter because of the the ability to validate your product?\r\n\r\n\r\nErik Kaiser (46:46.604)\r\nI think I like Kickstarter because I'm not at risk of not being able to deliver. If I were at risk of not being able to deliver, would, I would, you know, I'd be I might think twice a few times about Kickstarter. Yeah, for me, it was like, I put in my copy, I guaranteed to deliver because I because I had the product. I didn't need to go make a mold. I mean, I've got\r\n\r\n\r\nNikolas Hulewsky (46:57.711)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (47:03.599)\r\nInteresting.\r\n\r\n\r\nErik Kaiser (47:14.498)\r\ntooling I already have her I'm done right I'm just just like just make it so that's what it is it to me it's a marketing channel and it helped with social proof and it helps kickstart the brand you know effectively and so you know using that is helpful in getting people to take a look right and that's what I wanted people to do is take a look\r\n\r\n\r\nNikolas Hulewsky (47:14.564)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (47:19.151)\r\nYeah, it's almost like another marketing channel.\r\n\r\n\r\nNikolas Hulewsky (47:36.079)\r\nDefinitely. So how many units have you sold of crushed memory? what does that look like?\r\n\r\n\r\nErik Kaiser (47:43.564)\r\nroughly about 2000 or more than 2000. It's really it's not units that matters. It's really customers. Because you know, one customer to buy 10, right? You know, I have three, you know, so units units really isn't the important metric to it. I have one in my shower. One with me, and then I have another one floating around. Which, you know, it just floats around and you'd be surprised like I used it.\r\n\r\n\r\nNikolas Hulewsky (47:45.295)\r\n2000. Okay.\r\n\r\n\r\nNikolas Hulewsky (47:54.86)\r\nMm-hmm.\r\n\r\n\r\nWhy do you have three?\r\n\r\n\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (48:07.791)\r\nas a backup.\r\n\r\n\r\nErik Kaiser (48:12.952)\r\nthis morning and why it's being charged. used it this morning because I got up at 330 in the morning and I went to the bathroom. didn't have my crush. It was on the bedside and I was like, yeah, right. And I, this one happened to be in the bathroom, not in the shower. Like, you know, so like there's one, one that floats around.\r\n\r\n\r\nNikolas Hulewsky (48:25.231)\r\nDude, does your wife ever find it around the house and just say like, remember to stop by the post office and pick up the kids?\r\n\r\n\r\nErik Kaiser (48:32.334)\r\nKids, kids, kids, kids, kids, kids, kids, kids, kids, kids, kids, kids,\r\n\r\n\r\nNikolas Hulewsky (48:39.855)\r\nyeah, I, I, that's so fun. We got our kids Apple watches for Christmas. The two older boys and they've started sending me text messages and voice notes. it's so funny just to hear what they're saying and the conversations are heavy. Okay, so 2000 ish units, how much do they cost per unit?\r\n\r\n\r\nErik Kaiser (48:54.67)\r\nSo much fun.\r\n\r\n\r\nErik Kaiser (49:02.126)\r\nThere's a they require $149 effectively. yeah, so that's what it that's what it really is.\r\n\r\n\r\nNikolas Hulewsky (49:10.607)\r\nOkay, so you're, what is that? 300, 400-ish thousand dollars of top line revenue since launch? Wow, and when did you launch? This hasn't been that long. I want to say it's only been maybe six months.\r\n\r\n\r\nErik Kaiser (49:16.034)\r\nYeah. Yeah.\r\n\r\n\r\nErik Kaiser (49:21.612)\r\nWe put it on Kickstarter in July and it closed in August and we have been selling it since. We're not doing any marketing. I have to also make sure you understand the strategy here. We're not doing any marketing. We're doing some paid ads, little stuff. We're poking around seeing what kind of resonates with people and effectively driving resonates with people.\r\n\r\n\r\nNikolas Hulewsky (49:37.316)\r\nYeah, please.\r\n\r\n\r\nErik Kaiser (49:49.102)\r\nwe're going to start turning on marketing after we launch the new app, because there are features in there that make marketing a lot easier. And so we also want to get to the point where we're making sales every day. We don't have a problem making sales, but they're fully organic sales. are like people find, we'll listen to a podcast or they'll see it with somebody and go order it. Or finally, you know, I send out DMs on X.\r\n\r\n\r\nto our followers of Crush the Memory and engage with them. And then they'll be like, oh, listen, thank you. And they'll buy. I'm really focused right now on understanding customer use cases, making sure we're fully debugged. We're mostly debugged. We were mostly debugged in December. There's some edge cases that we're continuing to work on. But now that we're 100 % stable, we have use cases.\r\n\r\n\r\nspoken to enough customers, we're going to go get testimonials now, build some new content, and then we're going to start marketing it pretty significantly.\r\n\r\n\r\nNikolas Hulewsky (50:55.939)\r\nYeah, and that's where you'd raise money, right? Like that's where it's like, yeah, we want money to throw on the ads, the paid ad side and expand our product offering. Cause now you know what you're doing.\r\n\r\n\r\nErik Kaiser (51:04.238)\r\nYeah, well, now we know what we're doing and I can prove it, meaning I'm not going out saying, listen, because realistically, let's just speak in terms of real dollars for a second. You know, effectively, we're turning this into a social network. And I know it's going to be hard to connect. Like, how do you get from this to a social network? And the way you can kind of think of it is that our customer base, now that we know who they are,\r\n\r\n\r\nbecause there was a question about who they actually were. We did a 10,000 person user study that led us to believe it was construction people last year. At the end of the day, it's C-suite that's effectively who they are. And for the most part, in independents who are responsible for their own growth. Now that we know who they are, we believe we don't know what they're collecting, but we know that they're using it to create information.\r\n\r\n\r\nand to make decisions. That's a universe of knowledge that's not available to people. You're not going to find it on action. You're going to find it on Google or anywhere else. However, the ease with which it is to make a note is so high. There's no friction. You look at our chart of how many people are making notes. It keeps going up and up and up because people are getting used to using it now.\r\n\r\n\r\nNow they're crushing everything. And so when they choose to make some of that public. Yeah, that's right. Yeah, that's part of, yeah, yeah, yeah, that's right. That's correct. It's an adjective. So when people are crushing their ideas and they make them eventually public, they can say like, everything in this folder, I'm going to make public. This is going to be my public crush profile.\r\n\r\n\r\nNikolas Hulewsky (52:32.857)\r\nThey're crushing everything. Is that the verb now? Hey, did you crush that idea earlier? yeah, I crushed it. I love it.\r\n\r\n\r\nErik Kaiser (52:57.228)\r\nThen it's become searchable through the AI and crush that starts connecting people. have a chat feature. So now you can talk to other people. And now it's like a, now it's like a, a pre X social platform of a body of knowledge that's available nowhere else. That is very compelling. And to make that fly, the money needs to be spent on getting high levels of adoption at the sea level.\r\n\r\n\r\nNikolas Hulewsky (53:04.527)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (53:09.309)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (53:26.765)\r\nOkay, man, Eric, you're fascinating. There's like a million more things I wanna talk about.\r\n\r\n\r\nHere's, okay, a question for you. Why is this not in healthcare?\r\n\r\n\r\nErik Kaiser (53:36.462)\r\nIt's it's starting to be in healthcare. We have doctors. Yeah.\r\n\r\n\r\nNikolas Hulewsky (53:40.065)\r\nI think it's the perfect use case. So home health and hospice is my background and experience. Eight years ago, we had clinicians who would dictate into their phone their notes, send them over to the Philippines. We'd have some scribes enter them into the EMR and they were done. This is effectively eliminating the need for scribe. You could through AI sort of have these automation set up, but no clinician wants to sit down and just type out their note. They want to dictate it either bedside.\r\n\r\n\r\nErik Kaiser (54:07.266)\r\nNo. Yes.\r\n\r\n\r\nNikolas Hulewsky (54:09.517)\r\nright after the visit or encounter, whatever. I would think this would be perfect for the healthcare setting, but it sounds like you do have some adoption there.\r\n\r\n\r\nErik Kaiser (54:18.582)\r\nYeah, we do. Healthcare. so in terms of the cohorts, healthcare for certain doctors, we already have a there's a Polish. since since this works in every language, mostly, we have a user base in Poland, and they want to run it through their hospital, because they've realized the value of it. Wealth managers, lawyers. And then a small one, this is going to be really interesting.\r\n\r\n\r\nNikolas Hulewsky (54:44.089)\r\nYeah, lawyers. makes sense.\r\n\r\n\r\nErik Kaiser (54:49.134)\r\nthe clergy priests because they're content creators. have to remember their content information for sermons. So this is how some of them are capturing that. They're really interesting. Yeah, very interesting. thought I thought it was a fluke. I'm like, you know, occasionally you go in spot check and earlier on I would look at lots of different people like who are they? Because you need the data. You're like, who are these people who's buying? You're like, okay, we're\r\n\r\n\r\nNikolas Hulewsky (54:56.252)\r\nthat's true. Yeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (55:02.912)\r\nInteresting.\r\n\r\n\r\nNikolas Hulewsky (55:12.74)\r\nMm-hmm.\r\n\r\n\r\nErik Kaiser (55:16.332)\r\nWhere do you pivot? Like, like, what's the conversation? What are people thinking? Like, how do I discuss this? And I get funding priests, I'm like, priests, I'm like, okay, next, priests and priests. And then all of sudden, I'm like, I connected, I'm like, I get it. I completely get it. They're kind of, they're, they're kind of creative. Yeah.\r\n\r\n\r\nNikolas Hulewsky (55:31.459)\r\ncontent creators. that makes total sense. That makes total sense. All right. What's your goal with Crush? Where do you want it to be?\r\n\r\n\r\nErik Kaiser (55:39.758)\r\nthis, this is going to be a this is a very massive expectation of mine. My this is like billion dollar expectation because this is not just a recording device. This is this is this is a tool. And it's going to matter to only some people but the people to whom it matters are the decision makers and what's already happening and why what we see is that decision makers are getting this.\r\n\r\n\r\nSome of them are on X talking about it. Then they're requiring their staff to use the software because they can dictate into this and it can route directly into a folder and they can get that in for their staff can get the information without them having to go type or do anything extra. And so can just I can do that right now. can end I can have a note sent to my dev team just on this call.\r\n\r\n\r\nNikolas Hulewsky (56:24.143)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (56:30.9)\r\nso I could send it. It's almost like sending a text like, hey, I have an executive assistant, Kelly. Hey, Kelly, make sure to follow up with XYZ.\r\n\r\n\r\nErik Kaiser (56:34.507)\r\nYeah.\r\n\r\n\r\nErik Kaiser (56:38.328)\r\nThat is exactly how it gets used. So all of a sudden, the friction points are so low, you're not slacking somebody. You can just say, folder assistant, give me a cup of coffee, and done. And then your coffee shows up. I know that's a little bit low res, but you can think about it. And so now it's starting to be used for teams. So why we're relaunching everything next month is that we have now the ability for teams to use it. You can chat.\r\n\r\n\r\nNikolas Hulewsky (56:40.611)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (56:53.113)\r\nI get it.\r\n\r\n\r\nErik Kaiser (57:06.658)\r\nYou can work on tasks together. Like all of a sudden, we're going to replace Slack at our company with Crush this year. And we're replacing a project management software that we have called Wrike. By August, we'll have that completely replaced. yeah. And then you can create external facing website profile. We're going to link this into different.\r\n\r\n\r\nNikolas Hulewsky (57:23.46)\r\nInteresting.\r\n\r\n\r\nErik Kaiser (57:34.504)\r\nother software like notion and others, and then eventually use the, wherever people are using this for notion, will eventually adopt and create notion lookalike features, and then we'll cut off at some point later, you know, some sort of access to it, unless you pay for it. Like, you know, so I'm looking at, I'm looking at a very, this is a very interesting back door into the, into the decision making community.\r\n\r\n\r\nNikolas Hulewsky (57:59.183)\r\nDo you think crush becomes your only thing pretty quickly here or will you continue to do like different projects and ideas?\r\n\r\n\r\nErik Kaiser (58:05.782)\r\nNo, the crush crushes mine. It's my 95%. There is that's why it's so exciting. You can see how amplified I get when I talk about it because I'm I'm that's how much I clearly see what's going on. All I have to do is play out what's going on right now and stay ahead. That's why everyone's like, there's a recording device. I don't care about recording devices. All of these are the the\r\n\r\n\r\nNikolas Hulewsky (58:12.335)\r\nWell, it just sounds like there's so much within crush that you could do.\r\n\r\n\r\nNikolas Hulewsky (58:17.827)\r\nYeah, yeah, yeah.\r\n\r\n\r\nErik Kaiser (58:35.502)\r\nHardware quality will reach parity in the next 10 months. Like we're building a next version. It's not this. This is just to get from here out. It's not this. It's the software. And no one's focused on the software. Everyone's focused on hardware, hardware. I mean, I literally am like driving around the crowd. like, I'll see you guys at the front of the line.\r\n\r\n\r\nNikolas Hulewsky (58:58.393)\r\nHahaha\r\n\r\n\r\nErik Kaiser (59:00.288)\r\nEveryone's like, we can use chat GPT and use whisper and transcribe it. And can get your notes and then you can have a mind map that no one uses. Like no one cares. People, people really need collaboration tools. That's what they want. They need the ability for you and me to connect our brains through the software and be like, wait a second, you learned about this guy. How did you learn about this? it's I use, I'm on this crush. Well, how do I get to learn about that guy? Well, you have to go crush. That's the only place he has it.\r\n\r\n\r\nNikolas Hulewsky (59:12.611)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (59:24.143)\r\nI mean, it effectively makes team communication easier. Like that's the goal of this is to make communication easier as opposed to map your mental models or having your proprietary way that you think about things necessarily. That totally makes sense and resonates with me. Do you remember, I think this was like two years ago, remember when Clubhouse came out? Okay, and it was like, oh, this is the audio version and it's gonna be really, and there was some pop to it, et cetera.\r\n\r\n\r\nErik Kaiser (59:44.878)\r\nvery much.\r\n\r\n\r\nNikolas Hulewsky (59:52.355)\r\nBut I started hearing around that time that audio was going to be sort of replacing this text based communication that we typically that we have right now. And this seems like that iteration, right? It's like audio is now because we have the technology to be able to transcribe it and send it and dictate it and then create the software on the back end that allows for the organization. Now you can use the audio in order to more effectively communicate. doesn't have to be from an email. It doesn't have to be from your phone.\r\n\r\n\r\nnecessarily it can be through these devices.\r\n\r\n\r\nErik Kaiser (01:00:23.47)\r\nThat's correct. Yeah, you're absolutely correct. Clubhouse was a very interesting launch and something that I remember and I remember all the time now is Google Glass. There's a comparison there and Google Glass in a presentation for VC money, let's just say, would be wildly interesting, right? my God, this is going to take over like Segway was going to take over walking, right?\r\n\r\n\r\nNikolas Hulewsky (01:00:50.943)\r\ngosh. Yeah, yeah, yeah.\r\n\r\n\r\nErik Kaiser (01:00:52.806)\r\nAnd what you end up realizing is that people don't want to be recorded when you're talking to them. People value their own personal, independent, where they are, privacy. In public, you have a different kind of situation, but in a private setting, like if you and I go out to dinner, we have some steaks and we're smoking a cigar on the back deck, and we're having a shoot the crap conversation.\r\n\r\n\r\nYou don't want me recording what you like. We're free thinking and we don't want to be documenting what we're thinking. And it's why Google Glass failed. It's why so many people are thinking that, you know, this wearables in the future. No, I actually don't think I think your watch is the I think your watch is the max wearable you're ever going to get. And I don't think people want to compromise who they are or their ability to think.\r\n\r\n\r\nas a function of technology recording their every move. And so we haven't gone into this like 24 hour recording or record everybody and everything. It's it's kind of like, know, think about what happens behind closed doors. And no one wants anything like that recorded ever. You can't think freely.\r\n\r\n\r\nNikolas Hulewsky (01:02:04.025)\r\nWell...\r\n\r\n\r\nlook, you're the product guy and you've thought about this way more than I have. I could see this going in the direction of what Meta's done with Ray-Ban. Have you seen those glasses that they have where it's like, or AirPods, right? Where it's like, Hey, you and I are talking or I'm by myself and I have glasses and I just tap here and it's like, Hey, remind Kelly that I need to talk to so-and-so tomorrow at three o'clock. So it's like a click on, click off type of thing. Like I could see that being a wearable.\r\n\r\n\r\nErik Kaiser (01:02:14.03)\r\nYeah, of course.\r\n\r\n\r\nNikolas Hulewsky (01:02:36.331)\r\nI can't see the AirPods being a wearable all the time. It's just because it's such a signal that I'm not available. I'm wearing glasses. It doesn't signal to the other person that I'm unapproachable or I'm unavailable. AirPods, it's like, he's listening to something. I don't want to disturb him or, you know, it's just a different notification than having glasses on.\r\n\r\n\r\nErik Kaiser (01:02:55.278)\r\nIt's a wise observation, yeah, very good.\r\n\r\n\r\nNikolas Hulewsky (01:02:57.455)\r\nSo anyways, Eric has been fantastic. Is there anything I didn't ask that you wish I would have asked?\r\n\r\n\r\nErik Kaiser (01:03:03.01)\r\nHow old am I?\r\n\r\n\r\nNikolas Hulewsky (01:03:04.623)\r\nHow old are you? 54. Why did you want me to ask that?\r\n\r\n\r\nErik Kaiser (01:03:05.55)\r\n54.\r\n\r\n\r\nBecause everybody thinks I'm like 40. You know, I don't say that jokingly. It's like true. It's like, because you see all of these, these younger people who claim to have all this wisdom who are like 29 years old. And you're like, wait a second, you're 29 years old, like how much wisdom could you possibly have? It's like, I know what I know because of my age. And I'm not, you know, people look at me like friends of mine, they're like, dude, how do you age? You look like, know, so\r\n\r\n\r\nNikolas Hulewsky (01:03:37.613)\r\nYou and Brian Johnson, apparently.\r\n\r\n\r\nErik Kaiser (01:03:37.71)\r\nVampire Johnson, yeah, I know. But I, yeah, but it's like, you know, I'm not I don't have gray hair or anything. So it's misleading sometimes. And so it's important for people know the context that I'm not. I didn't just start out. been doing this for all my life.\r\n\r\n\r\nNikolas Hulewsky (01:03:41.647)\r\nVampire Johnson.\r\n\r\n\r\nNikolas Hulewsky (01:03:54.511)\r\nI love it, I love it. Well, this has been awesome. I'm gonna cut it here. You stay on for a second. I don't know where my mouse went.",
  "metadata": {
    "duration": "",
    "date": "2025-02-24",
    "platform_source": "Google Drive"
  }
}