{
  "episode_number": "99",
  "episode_title": "How To Start A Business With No Money: College Tuition Negotiation, Local Concierge & More with Chris Koerner",
  "guest_name": "Chris Koerner",
  "business_name": "",
  "transcript": "﻿Nikolas Hulewsky (08:10.881)\r\nAll what do you got?\r\n\r\n\r\nChris Koerner (08:12.078)\r\nAll right, let's see here. Okay, all right.\r\n\r\n\r\nDid you know that you can negotiate your college tuition? Did you know that? Anyone? It's negotiable. What percentage of people do it?\r\n\r\n\r\nNikolas Hulewsky (08:26.102)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (08:31.477)\r\ngotta be less than 5%.\r\n\r\n\r\nChris Koerner (08:34.07)\r\nI don't have the answer. So whatever you say, I'll believe we're going to say 4%. Let's let's call it four. That's a fact. 4 % of people try to negotiate their, their tuition. What percentage of people even know it's possible? Give me a number. I'll believe it immediately.\r\n\r\n\r\nNikolas Hulewsky (08:38.145)\r\nPerfect, 4%.\r\n\r\n\r\nNikolas Hulewsky (08:52.019)\r\nit's got to be in the same percentage ballpark, 5%.\r\n\r\n\r\nChris Koerner (08:57.42)\r\nYeah, I didn't know it until about a month ago when I heard it on another podcast, which I won't mention.\r\n\r\n\r\nNikolas Hulewsky (09:03.467)\r\nDon't say the name. Does it rhyme with Pfizer's Gilead? I'm just kidding.\r\n\r\n\r\nChris Koerner (09:05.102)\r\nBut...\r\n\r\n\r\nChris Koerner (09:09.652)\r\nNo, not at all, actually. Was that believable?\r\n\r\n\r\nNikolas Hulewsky (09:17.803)\r\nSo funny.\r\n\r\n\r\nChris Koerner (09:18.446)\r\nAll right, so what no one okay, I've done I've done some research I did some homework here. I don't know of any company doing tuition negotiations as a service. Why not? Why would we not do this? It's an alignment of incentives. You charge $0 to the families or the students, you take a percentage of whatever you save. What do you have to lose? poke holes in it? What are we doing?\r\n\r\n\r\nNikolas Hulewsky (09:41.441)\r\nI think it's very analogous to insurance. But more people know about this. Did you know you can negotiate the bill from your insurance company, medical health insurance, right? I'm not talking about the premium. I'm talking about when you get a bill from the hospital, like, had my kidneys removed. Kidneys removed? Anyways, appendectomy, you can negotiate with them. Now, most people don't negotiate with them, but you can negotiate with them.\r\n\r\n\r\nChris Koerner (09:53.634)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (09:58.444)\r\nYeah, it's a joke. Who does that?\r\n\r\n\r\nNikolas Hulewsky (10:10.751)\r\nI think that there are some businesses around negotiation as a service, but that's also not very popular. The reason I think that it's not more popular and the reason I brought up insurance is because there are so many different insurance companies that you have to talk to the decision maker and there's many different potential decision makers at each insurance company and the same feels true to me for universities is like, you can't just group, okay, these are the 10 universities I applied to and I got into, I'm gonna group negotiate with them or at least.\r\n\r\n\r\nChris Koerner (10:26.19)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (10:39.943)\r\nthe outside. That would be my reasoning. It'd be very hard to build individual relationships at scale that allow you to then negotiate.\r\n\r\n\r\nChris Koerner (10:47.938)\r\nWell, it all goes to the admissions office.\r\n\r\n\r\nNikolas Hulewsky (10:51.787)\r\nSure. I'm just saying there's a lot of people in the admissions offices and there is a potentially a significant amount of turnover. So you'd have to build individual relationships with individual universities that doesn't necessarily scale. You could start it at like, I went to USC. Cool. I'm the USC tuition negotiator. I could see that being like a good standalone business.\r\n\r\n\r\nChris Koerner (11:11.235)\r\nYeah, yeah.\r\n\r\n\r\nWell, from what I understand, I've, I've read some Reddit posts from parents that have done this successfully for their kids and you don't really need a long standing relationship. It's kind of like,\r\n\r\n\r\nNikolas Hulewsky (11:23.777)\r\nChris, Chris, did Lori Loughlin post this?\r\n\r\n\r\nChris Koerner (11:28.428)\r\nI don't know who that is and I'm too afraid to ask at this point.\r\n\r\n\r\nNikolas Hulewsky (11:30.503)\r\nShe's the aunt from Full House who paid, remember the whole celebrity tuition scandal? They'd get people on the row team. It's like, this is how they got them into college. All right, sorry, keep going.\r\n\r\n\r\nChris Koerner (11:36.302)\r\nyeah. Yeah. It was her. Yeah. No, like, I see what you mean. But I don't think I don't think that's how you frame yourself when you make this call. You're like, Hey, I'm, I'm working with Suzy. You know, she really wants to get into USC. It's her top choice. But our budget for tuition is only X and you guys are at why. So what can you do? Like, that's how the conversation goes. You just need to talk to the admissions office.\r\n\r\n\r\nAnd preferably right before they're about to close admissions, because these guys have quotas and goals that they want to hit. And historically over the last few years, tuition keeps going up and enrollment is going down, which means they're more desperate. You think that those things wouldn't both be happening at the same time, right? I don't, who would have thought that a university doesn't know how supply and demand works, but so I don't see it. And you could be right in that this how it would be in reality, but I don't see it as a\r\n\r\n\r\nNikolas Hulewsky (12:25.953)\r\nWho would thought that?\r\n\r\n\r\nChris Koerner (12:33.612)\r\nsomething that's very relationship driven, like, Hey, it's me again. Hey, I've got this student. Hey, it's me again. It's just like, Hey, I represent so and so she really wants in. but we need a break and the, the savings might be like 8,000 a semester instead of nine, right? But over eight semesters. And if you take 30 % of that, that's very tangible. And people don't like to negotiate. know that negotiations as a service.\r\n\r\n\r\nis a thing. Andrew Wilkins had a company that did it very successfully. They sold and he's publicly said, I'm launching that again. I want to do that again because it was an amazing business. So it's basically that framework applied to universities and the alignment of incentives is what I like because it's something that no one has to pay for. I only eat when you eat.\r\n\r\n\r\nNikolas Hulewsky (13:19.253)\r\nWe just, we had a similar idea around having virtual assistants kind of negotiate car prices. Remember, this was like a couple months ago that we talked about this. So I think negotiation as a service is a really, really good idea. You're framing it more as like, all right, I'm going to, I'm going to, I'm the advocate on behalf of the student and the parents calling the university. I think that could work. Yeah. Why would that not work? I guess if, if the student wasn't in a position of leverage, it wouldn't work.\r\n\r\n\r\nChris Koerner (13:27.092)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nChris Koerner (13:43.768)\r\nCause like, good.\r\n\r\n\r\nYeah, and there's a very that's that's basically what they're paying for is you don't want to be like, Hey, I got 20 universities on tap, which which who's the cheapest? Like, that's not how you play this game. You're like, this is our first choice. We're admitted into four. This is our first choice. But you're just you're too expensive. We really want to go there. Like, what can you do to help us get into your school? Could you do 8000 a semester?\r\n\r\n\r\nNikolas Hulewsky (13:48.693)\r\nLike at their borderline.\r\n\r\n\r\nNikolas Hulewsky (14:11.937)\r\nOkay, so to our distribution question, how would you go about acquiring customers for this? Where would you go? How would you find people to represent in order to negotiate for their tuition to be cheaper?\r\n\r\n\r\nChris Koerner (14:13.998)\r\n.\r\n\r\n\r\nChris Koerner (14:25.986)\r\nWell, this, this plays into one of the frameworks that I talked about recently. It's kind of like, I just did an episode with the line striping business owner and he acquires customers quite easily because he drives around Waco, Texas. So he's a parking lot with faded lines and he knows for a fact that guy needs him. He might not be ready today, but it's not a cold knock. It's a very warm knock. Cause it's like, you're going to be paying someone to do this might as well be me. And he said, none of his competitors are door knocking. And so I like this because\r\n\r\n\r\nEveryone knows who all the high school seniors are, right? They're listed on the website. They're right there. They're at the football games. And so this is something that is like a barbell strategy. You either start hyper local or you start on Instagram and nothing in between. Go to your friends and families that have high school seniors and say, Hey, I'm just testing this out. I'm not even going to take a percentage. I just want to learn my skills, hone my skills. Will you give me a testimonial if I'm, if I even save you a dollar, what do you have to lose? Nothing, right? You've already been accepted.\r\n\r\n\r\nYou have nothing to lose. Okay, now you get some testimonials, throw them up on a website. Now you start charging 10 to 30 % to locals to keep doing the same thing. Or this is a very similar idea to a guy I know on Instagram that does cold emailing as a service for parents that want their kid to get a scholarship, an athletic scholarship. And he only does it through Instagram. He makes a lot of money and he just posts content about\r\n\r\n\r\nhow to get scholarships, how to reach out to coaches. You were smiling.\r\n\r\n\r\nNikolas Hulewsky (15:58.683)\r\nbecause it made me think of the Lori Loughlin situation again, where they were paying people for scholarships to the road team. I think I love this framework that we came up with. I mean, obviously it's an existing framework, but something that was a light bulb moment for us a couple of months ago. I would look at the piggybacking. It's like, okay, who's already working with these individuals? So it could be the test prep companies. It could be the admissions prep companies, because there are companies that help you write your personal statement that gets you your\r\n\r\n\r\nto just do an audit of like, what do your extracurriculars look like? And how is your application going to be? And I would probably target a specific, I'm gonna use USC as an example. went to USC. I would see if there's anybody in my network who works at USC, first of all, and I would contact the admissions office and see if they could give me a recommendation for the companies that they've seen students work with most likely to get a scholarship at USC. I know that's like a very specific question.\r\n\r\n\r\nBut I think USC would know like, man, Kaplan does a really good job preparing students for the admission process. And we've seen their students come through here or whoever it is, right? Those admission departments are going to have relationships with these companies because that is very relational as well. It's like, I talked to Laura at Cascade test prep. She's helping you. she's great. She's going to do a really good job of prepping, you know, whatever your application. So I asked them who they work with. And then I would go to those companies and say, Hey, look,\r\n\r\n\r\nChris Koerner (17:14.456)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (17:23.277)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (17:28.523)\r\nFree service, I eat what I kill, but I want to negotiate on behalf of these families because they're already a qualified student. They've gotten in, they're paying something. So now there's a negotiation process. I think that's probably where I would start is by piggybacking off of those.\r\n\r\n\r\nChris Koerner (17:41.174)\r\nYeah, I like that because like university admission coaching, that's like a well established industry, how to get into Harvard, how to get into the school or how to get scholarships. That industry has been around forever, right? We'll help you apply for scholarships. We'll help you with your essay writing. We'll develop your skills. We'll help you with your SAT or your ACT score. That's been around. So just piggyback on one of those guys and say, Hey, you're not doing negotiations as a service. I'm really, really good at this. You don't pay me anything, but for every, every person you refer to me,\r\n\r\n\r\nI'll give you a third of my cut. What do have to lose?\r\n\r\n\r\nNikolas Hulewsky (18:12.725)\r\nNow, you better be good at negotiations. I would not do this business because I would be like, you're charging 80,000? Well, you better give me it for 60. And they're like, I mean, final offer is 79,999. Okay, fine. I'll take it. I'll take it. It's a win. I just wouldn't be good. I just wouldn't be good at negotiating with the universities. But if you're like a hardline negotiator, you'd go for it. should like, this would be something really cool to launch.\r\n\r\n\r\nChris Koerner (18:31.256)\r\nYeah.\r\n\r\n\r\nChris Koerner (18:38.552)\r\nYeah, I bet it's, it's an easier negotiation than car dealerships, right? Cause that's all those guys do all day. You're up against some, yeah. But with this, you're up against Susan in the front office that is like, you know,\r\n\r\n\r\nNikolas Hulewsky (18:49.633)\r\nThat's true.\r\n\r\n\r\nNikolas Hulewsky (18:54.495)\r\nAnd less than five, I mean, a very small minority of people negotiate anyways, so they're probably not used to negotiating. I like it. Let's get one. All right. So I think we're at we're at like 50 minutes right now. And we've got.\r\n\r\n\r\nChris Koerner (18:56.694)\r\nRight. No one's asking for this. Yeah.\r\n\r\n\r\nNikolas Hulewsky (19:16.284)\r\nUniversity.\r\n\r\n\r\nAll right, so we've got four ideas so far. I have two more ideas. Should we do two more from each of us?\r\n\r\n\r\nChris Koerner (19:27.138)\r\nYep, I've got at least two.\r\n\r\n\r\nNikolas Hulewsky (19:29.365)\r\nOkay. So.\r\n\r\n\r\nhave a close friend of mine. I'm not going to say who he is because it would immediately out him, but he's successful. He has a really successful business, big business, does really, really well. And he's a very generous guy, smart guy. People love him, really well known in his community. And about a year ago, he decided he was going to launch a business with a relative. And this relative came to him and pitched him the idea.\r\n\r\n\r\nand this friend of mine is very wealthy. And so he's like, yeah, I'll put some money behind it. I want to invest in you. I want to see you be successful. And so they launch an apparel brand. I shouldn't say launch. They had the idea to launch an apparel brand. And this friend of mine, when he goes in, he goes all in. He's like,\r\n\r\n\r\nChris Koerner (20:19.928)\r\nThey launched a wire over to China.\r\n\r\n\r\nNikolas Hulewsky (20:22.721)\r\nYes, yes. It was funny because he like started really getting into the world of sourcing and he's like, so I'm on WhatsApp now and I'm sending them payments and I'm trying to work with these contractors and paying them over wise, but I don't like wise. Like it's just funny to hear these conversations from someone other than you. Anyways, he he ended up investing over $200,000 into this and this family member said. Actually, this isn't for me, I'm out.\r\n\r\n\r\nSo my friend, my friend now has $200,000 worth of inventory. Not that he valued. I posted about this on Twitter and people were like, first of all, it's not worth $200,000. Like, yeah, I know that. But 200,000 that he spent on inventory. So I.\r\n\r\n\r\nChris Koerner (21:09.912)\r\nSo retail value is million bucks. mean.\r\n\r\n\r\nNikolas Hulewsky (21:13.729)\r\npotentially. I don't know. I don't know. Right. I'm just, I'm just saying he's into it for 200,000 probably retailing between 800 and a million dollars, just based on what I know about apparel retail. And he's got $200,000 worth of merchandise sitting in his garage. And like these are, it's not just a shirt, $200,000 worth of a shirt. It's shirts, sweatshirts, socks, sunglasses. I mean, anything you could think of from an apparel standpoint. So\r\n\r\n\r\nI, when I found out about this, couldn't wait to talk to you about it because I'm like, there's got to be something here. He's just going to write it off. He's like, it's not worth it to me. It's not worth my time to figure it out. I'll get the tax write off and he's successful enough. I know it sounds crazy, but he's successful enough where it's like $200,000 sucks, it's not. It's a speed bump. It's not anything crazy. But I'm sitting here. I'm like, dude, can we do something with it? Is there something that could be done here? So knowing what you know, what would you do?\r\n\r\n\r\nIf you were either in his situation or my situation, or if you were an entrepreneur that you're like, you knew that this was an opportunity, he's got all this merchandise. How would you take advantage of this? Like there has to be something you could do to actually recoup some of the cost.\r\n\r\n\r\nChris Koerner (22:27.896)\r\nLet me start with a framework. Can I zoom out first?\r\n\r\n\r\nNikolas Hulewsky (22:31.713)\r\nabsolutely.\r\n\r\n\r\nChris Koerner (22:32.952)\r\nWe talk about this all the time. Whenever you start a business, the, the natural progression is to start with the things that you can wrap your arms around. I'm going to design a logo. I'm going to buy a domain name. I'm going to file an LLC. Those are the easier things. And I don't blame people. I've been there too. It's the thing you're like, I'm making progress. And at least you are making progress, right? Even if you just buy a domain name, you're doing more than just thinking about it.\r\n\r\n\r\nIt's like, I'm going to talk to people, I'm going to get feedback. And that's usually a train wreck because the people you're talking to aren't your target customer or they're biased or they love you. So whatever you're hearing is just, not good feedback most of the time. But anytime you want to start a business, you want to start with the hardest thing. And the hardest thing is getting revenue, getting customers, right? Sorry, I to keep pausing to cough. It really interrupts the flow. But so if you start with the hardest thing and you fail,\r\n\r\n\r\nthen you failed before you really spent a dollar. Or if you start with the hardest thing and you succeeded, then everything kind of gets easier from there, right? But when you're starting...\r\n\r\n\r\nChris Koerner (23:41.038)\r\nApparel brand. No, I had to cough. I don't know. I don't know that I'm on like literally When you're starting an apparel brand The easiest thing is to buy apparel. That's not that's like not the easiest. It's one of the easier things to do, right? It's It's like it's the fun thing. It's exciting. We're like, here it is here it is. look at it I'm gonna wear it around. I'm going to talk to people about it That's not the hard thing. The hard thing to do is be apparel brand at number eight million seven hundred and fifty two thousand\r\n\r\n\r\nNikolas Hulewsky (23:41.281)\r\nNamaste.\r\n\r\n\r\nNikolas Hulewsky (23:44.718)\r\nI'm sorry.\r\n\r\n\r\nNikolas Hulewsky (23:57.035)\r\nAnd it's the fun thing.\r\n\r\n\r\nChris Koerner (24:10.542)\r\nRight. Cause that's like one of the most competitive categories there is because it's a huge tam and everyone wears clothes. But like, I would think I've never started an apparel brand. It scares me because it's so crowded. like it's gotta be really hard to break through the noise with an apparel brand. Right. So if you could actually successfully sell a hundred shirts, even at a $0 margin, then you feel a lot better buying $200,000 worth of shirts. Right.\r\n\r\n\r\nNikolas Hulewsky (24:37.773)\r\nLook, I agree with you. I'm just saying it's the situation he's in and he has these assets that he's branded and they're sitting in his garage and you've got Send Eats or Texas snacks, excuse me, where you resell Bucky's products. I mean, you have experience with selling this stuff. Here are some of the ideas that people gave me on Twitter. Call a liquidator because apparently companies just liquidators will take these and resell them because they have their own distribution networks. And I did ask and I'm like,\r\n\r\n\r\nChris Koerner (24:40.673)\r\nNo, no, no.\r\n\r\n\r\nChris Koerner (25:01.601)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (25:07.029)\r\nDo I just Google liquidators? Like how do I find liquidators? I have no idea. Never done anything like that before. So that was kind of interesting. One of the ideas that I really liked was find a couple of influencers and just pay them to wear your apparel. And then, you know, maybe you'll get some sales coming in. So that was, I'm going say a couple of other ideas and then I'll let you riff. So I thought that was kind of an interesting one.\r\n\r\n\r\nChris Koerner (25:25.134)\r\nI got an idea for him.\r\n\r\n\r\nChris Koerner (25:29.432)\r\nYeah, keep going.\r\n\r\n\r\nNikolas Hulewsky (25:35.073)\r\nOne that I thought was really cool was like, just use it as a marketing expense. Say, hey, I want to take five people and whoever sells the most merchandise wins. And so it's like you create this competition around this sort of debt inventory. for somebody like us, it would be a really cool way to grow a brand or build an audience because people are competing to sell this. So I thought that was a really, really cool idea. And then\r\n\r\n\r\nThe last one was, I can't remember what the last one was. Anyways, those are three really, I thought pretty cool ideas that you could do with it.\r\n\r\n\r\nChris Koerner (26:12.782)\r\nI like it. The problem with the liquidator is he's probably going to pay like 10 grand for all of this. It's better than nothing, but like nothing. We're to see a bunch of kids in Kenya running around with these shirts in a year or two, right? Right next to the, right next to the Utah jazz 1998 national championship shirts. So RIP. Yeah, I'm an idiot. I've got football on the brain.\r\n\r\n\r\nNikolas Hulewsky (26:25.707)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (26:31.873)\r\nNBA Championship. National Championship. Right next to the Alabama 2017 the Alabama 2017 Super Bowl champions.\r\n\r\n\r\nChris Koerner (26:43.448)\r\nKeep their name at your mouth.\r\n\r\n\r\nOkay. All right. So, all right. I have it. have an idea that's creative, but it only works if these shirts look okay. Can you, can I see as I talk about this, as I ideate, can you send me a picture? Just a logo, anything. We'll edit out all the pauses.\r\n\r\n\r\nNikolas Hulewsky (26:47.553)\r\nThank you God.\r\n\r\n\r\nNikolas Hulewsky (27:01.729)\r\nNikolas Hulewsky (27:07.189)\r\nThese are their socks.\r\n\r\n\r\nChris Koerner (27:08.888)\r\nCan you hold it up closer?\r\n\r\n\r\nNikolas Hulewsky (27:13.057)\r\nI have other logos. just don't have any pictures of them. It's an It's an Yeah. I'll tell you offline what the name of it is. It's also not a great name, but I mean, it has meaning behind the name, but it's not like an easily marketable name out of the gate.\r\n\r\n\r\nChris Koerner (27:14.444)\r\nIs it an Okay.\r\n\r\n\r\nChris Koerner (27:28.398)\r\nDo the shirts just kind of look like that logo? Is it just like an or is there something written on the shirt?\r\n\r\n\r\nNikolas Hulewsky (27:34.361)\r\nNo, it has the name, they're pretty tame shirts. don't know how else to say It's like I have this Nike sweater on, right? And you can see the Nike logo, but it's understated. I guess that's word I'm looking for. It's not flashy.\r\n\r\n\r\nChris Koerner (27:44.526)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (27:51.918)\r\nI want you to Google God is dope. Tell me what you see.\r\n\r\n\r\nNikolas Hulewsky (27:58.773)\r\nOkay, God doesn't do drugs, but I'll take a look.\r\n\r\n\r\nNikolas Hulewsky (28:05.921)\r\nOkay? God is dope. God's favorite band.\r\n\r\n\r\nChris Koerner (28:10.828)\r\nNow look at their t-shirts and find the one that just has the big block letters on the front, white background that just says God is dope from top. You see that?\r\n\r\n\r\nSo the story behind this brand is really cool. This guy was in Atlanta and he, he, the first thing he sold was only that shirt with that logo. That's it. God is dope with the period, big bold letters. And he went around the streets of Atlanta and he gave them out for free. No questions asked, a hundred percent free. And people started wearing them and then people started Googling it. People started going to his website and then he did something that was also genius. He sold them for $5 on his website.\r\n\r\n\r\nHe did not make money on any of them and it went viral. It went organically viral because so many people were wearing them, talking about them. It was actually a really cool looking shirt that was actually affordable to everyone. And then once he had a massive email list, he started dropping new products that were a little more expensive, but still very reasonable. This guy, I'm not exaggerating. This, this is a $30 million a year business and it was started by a guy in Atlanta with no money, no skills, no talent.\r\n\r\n\r\nNikolas Hulewsky (29:20.575)\r\nWhat?\r\n\r\n\r\nChris Koerner (29:23.852)\r\nHe could just, he designed a logo. He was good at making that logo. Sorry. I say no talent. He clearly has talent, but he had no background. He had no funding. He was just like, I mean, how many guys have a shirt idea? Every other guy, right? But it's a $30 million company based on one logo.\r\n\r\n\r\nNikolas Hulewsky (29:32.095)\r\nYeah, yeah,\r\n\r\n\r\nNikolas Hulewsky (29:40.715)\r\nHmm. So are you saying you try to launch the brand? Like you would be like, all right, just launch the brand. Just give away. Think of it as marketing. You're to give it away for free.\r\n\r\n\r\nChris Koerner (29:52.158)\r\nYeah. I like if, if I have to choose between liquidator, give me 10 grand or me giving them away for free, like in a defined local area to thousands or hundreds of people. Somehow you go to a football game, say anyone that goes to the Eagle football game gets a free t-shirt like, just see if that catches fire. Why not? But the, the, right. The problem that he's up against though, is the fact that\r\n\r\n\r\nNikolas Hulewsky (30:04.095)\r\nhuh, huh.\r\n\r\n\r\nNikolas Hulewsky (30:13.057)\r\nyeah, because it's it's dead inventory anyways.\r\n\r\n\r\nChris Koerner (30:21.398)\r\nI think God is dope works. I think God is dope works because it's sending a message that is polarizing that people resonate with. They believe in fundamentally and it's affordable and it's good design. It's like the Venn diagram, affordable mass market, good design, mass market, the message mass market. And so he just, he, he hit a trigger there. And then the fourth circle of the Venn diagram, brilliant distribution strategy. So\r\n\r\n\r\nYour friend won't be able to do all of those things because it's already done. They're already printed and it doesn't really send a message. It's just a logo, but he could at least try one or two of the Venn diagram options.\r\n\r\n\r\nNikolas Hulewsky (30:59.169)\r\nWell, and there is a message behind the logo. Like it is a very meaningful logo. I would say it looks good. Like the stuff's good quality that they have. That would be interesting.\r\n\r\n\r\nChris Koerner (31:10.476)\r\nAre you able to say what the message is? Like what the meaning is behind the brand.\r\n\r\n\r\nNikolas Hulewsky (31:15.179)\r\ndon't want to just in case. So the meaning behind it, yeah, I don't want to just like, it would give it away. I'm sure I'm going to ask him if he's cool with me talking about it. And I think that he is cool with me talking about it, but I don't want to say it without asking him.\r\n\r\n\r\nChris Koerner (31:23.768)\r\nW- Well he could-\r\n\r\n\r\nChris Koerner (31:32.462)\r\nSo if I were him, I would get, there's these little tools that will allow you to attach a tag to a piece of clothing, right? Like when you go buy a piece of clothes, you go buy clothes at the store, you can buy those tools for like 10 bucks on Amazon. Then you get the little plastic tags and then you print something. If I were him, I would put up a website, Shopify, put a QR code to the website on the tag and put a story, like the heartfelt, meaningful story, whatever the story is behind the brand, attach it to each t-shirt, give them out for free to like the same type of demographic.\r\n\r\n\r\nNikolas Hulewsky (31:39.745)\r\nMm-hmm. Yeah.\r\n\r\n\r\nChris Koerner (32:01.858)\r\ncall it high schoolers, college students, whatever.\r\n\r\n\r\nNikolas Hulewsky (32:03.073)\r\nThat's a great idea. That's a great idea. Well, and that was the fourth one that people recommended. They were like, find a local high school student or young hungry entrepreneur and just like, let them have it. They can list it, they can sell it and essentially give them the starting inventory to launch the brand. So I, it's, just hearing you talk about the high school thing kind of brought that up, but I think that's a great idea.\r\n\r\n\r\nChris Koerner (32:21.006)\r\nMmm, that's another good idea. Yeah, I like that.\r\n\r\n\r\nNikolas Hulewsky (32:31.649)\r\nAgain, it wouldn't be for him because he just doesn't have the time to dedicate to it. if somebody was like, they've got all this inventory, let's take a flyer on it. You could easily attach those QR codes. It could scan. You could tell the story, give it away for free. I like that. I really like that. That's really cool. All right.\r\n\r\n\r\nChris Koerner (32:34.158)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (32:50.222)\r\nDo you think the story behind it is meaningful enough to like really resonate with people?\r\n\r\n\r\nNikolas Hulewsky (32:57.981)\r\nYeah. And he was smart. The brand is tailored. He's very clear on who his ICP is. It's not just like, we made a cool shirt that looks cool.\r\n\r\n\r\nChris Koerner (33:06.85)\r\nHis insane clown posse?\r\n\r\n\r\nNikolas Hulewsky (33:11.329)\r\nHe's very clear on who is insane cloudboss is. But he's very clear on who his target demographic is. And I think that works in his favor because it's not just like, it has to look cool. And then people will like it. It's like, it's very specific to this type of a person. And this is the meaning of the brand. So again, I think that plays into his into his favor, like he thought about it the right way. So cool. All right.\r\n\r\n\r\nChris Koerner (33:37.208)\r\nYeah, I like it. I got one for you. You know, this is like the, this is like the college episode. This is like, because we had the tuition idea, you had that idea, which could be for a young person. And I got one that that's more college focused. Okay. So I had a call with a guy a couple months ago, and he, he went to the university of South Carolina, SEC school, and he got a minor in possession charge, but as in minor in possession of alcohol as a student.\r\n\r\n\r\nNikolas Hulewsky (33:40.993)\r\nLet's do it.\r\n\r\n\r\nNikolas Hulewsky (33:48.703)\r\nAlright, alright.\r\n\r\n\r\nChris Koerner (34:06.708)\r\nAnd as a fellow student that went to an SEC school that happened to work in a jail while I was a student, I never got a minor in possession charge. We call that MIP at the Tuscaloosa County jail, but I was got an Hey, book them on an MIP book them on a MIP. We say that.\r\n\r\n\r\nNikolas Hulewsky (34:13.739)\r\nThanks.\r\n\r\n\r\nNikolas Hulewsky (34:18.986)\r\nRIP to the MIP.\r\n\r\n\r\nNikolas Hulewsky (34:24.629)\r\nHey Chris, where'd you go to school? I went to university, Alabama. What'd you major in? I majored in business with a minor in possession.\r\n\r\n\r\nChris Koerner (34:33.772)\r\nNo, that's hilarious. I guarantee you there's a 62 year old boomer business owner that has an $84 million equipment rental business that says that joke that lives in Montgomery that says that joke on a daily basis.\r\n\r\n\r\nNikolas Hulewsky (34:48.737)\r\nI had to. I had to argue good.\r\n\r\n\r\nChris Koerner (34:49.774)\r\nThat's so good. Anyway, and apparently he knew someone, someone high up. I don't know who it was when he got this minor in possession charge that gave him the good advice to not go to an urgent care. I don't remember what happened. If he got passed out or whatever, they're like, don't go to an urgent care, go to a hospital because the urgent care is required to report you to the university or don't go to the urgent care on campus.\r\n\r\n\r\nNikolas Hulewsky (34:54.419)\r\nThanks\r\n\r\n\r\nNikolas Hulewsky (35:08.513)\r\nHmm.\r\n\r\n\r\nChris Koerner (35:18.626)\r\nbecause they will report you to the university and you could get kicked out of school.\r\n\r\n\r\nChris Koerner (35:27.608)\r\nSo it was just like a little nuance that changed the game for him. He didn't get kicked out of school because he knew this. And then he thought...\r\n\r\n\r\nChris Koerner (35:40.206)\r\nSorry. And then he thought, man, this is really helpful for me to know how can I monetize this? And this was years later when he actually had the idea of how to monetize this, but he launched this website. I wouldn't call it a business because I don't think he's promoting it yet, but it's called Dean's List. And his thesis is that these rich SEC parents want their kid to be looked out for at school. They just want, okay.\r\n\r\n\r\nThey're going to go there. They're going to rush for a fraternity. They're going to be a sorority. They're not going to have immediate access to them. Maybe they're helicopter parent. Maybe they have money. They're overbearing or maybe they just maybe they just love their kid. They want to be looked out for. He had the idea to have like a service. It's kind of like an insurance policy where it's like we know all the tricks of of the trade. When you come in for parents day, we know where you can get a table for brunch where you can't.\r\n\r\n\r\nNikolas Hulewsky (36:09.249)\r\nThank\r\n\r\n\r\nNikolas Hulewsky (36:16.703)\r\nWhatever, they're worried about them.\r\n\r\n\r\nChris Koerner (36:34.946)\r\nWe know the bars you should go to the bars. You shouldn't. Your kid doesn't even know there, know this stuff yet because they're freshmen. But we we've got an in in Columbia, South Carolina. We know all the tricks. If they get a minor possession, take them off campus. you're going to pass $500 a year and we're just going to be one phone call away. We're just going to wait. We'll give you some resources. We'll send you some PDFs, but we're one phone call away. It's like an insurance policy to keep an eye on your kid. They're not answering. Maybe their phone's dead. Maybe they're kidnapped. We'll go check in on it.\r\n\r\n\r\nNikolas Hulewsky (36:44.609)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (36:53.643)\r\nThank\r\n\r\n\r\nChris Koerner (37:05.006)\r\nWhat do think?\r\n\r\n\r\nNikolas Hulewsky (37:07.489)\r\nThat'd be a hilarious sales pitch. Maybe they have some questions about, well, it's just like throwing that in at the end. It's like, maybe they don't know what orientation is. that's true. Maybe they get a minor in possession. that would be terrible. Maybe they get kidnapped in sex traffic to Mexico and wait, wait, what? was that? How common is that at this school? That's pretty common. It's pretty common. Anyways.\r\n\r\n\r\nChris Koerner (37:11.554)\r\nHeaven forbid, heaven forbid someone kidnaps him.\r\n\r\n\r\nChris Koerner (37:29.826)\r\nWhoa, whoa, whoa.\r\n\r\n\r\nNikolas Hulewsky (37:35.009)\r\nMaybe they stub their toe. Hold on, can we go back to the sex trafficking thing? You're talking about my son, right? it's very prevalent amongst young men. Very prevalent here. Anyways, I think it's really interesting. Is it only geared towards parents to get their kids out of trouble? Or is it, hey, welcome to campus. Here's the cool places to hang out.\r\n\r\n\r\nChris Koerner (37:58.808)\r\nIt's like a trusted third party that can just step in to help should something happen.\r\n\r\n\r\nNikolas Hulewsky (38:04.011)\r\nLike a trip advisor, not even a trip advisor. It's like a trip advisor is just your reading and getting advice. This is like someone you could reach out to like a concierge service to, could you check on Timmy? haven't heard from him in three hours.\r\n\r\n\r\nChris Koerner (38:12.194)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (38:15.714)\r\nYeah, it could be as hands on or as hands off as you want and that you'd have to price it accordingly. So it's like, Hey, we'll get you a reservation for parents day. Hey, or it could be a weekly newsletter. We're to tell you everything going on in the city. We're going to tell you the good places to rent a dorm, the bad places to rent a dorm, because sure, you know, where to rent a dorm freshman year, cause they required to live on campus, but sophomore year they're not, but you don't want them to be in the wrong area. Like we will be there every step of the way. I thought it was an interesting idea.\r\n\r\n\r\nNikolas Hulewsky (38:45.151)\r\nIt is really, there has to be something else that's already existing, right? Like, cause people just have these questions. So they just go to Facebook right now and look, or are they like Googling stuff? Cause if you, if you could get the students to rate, if you get the students to recommend and rate like, this is the best bar near campus. This is the best place to, I don't know, rent your second year. This is your best place to, to live senior year. And the students are telling you that that could be really valuable, but I,\r\n\r\n\r\nChris Koerner (38:49.218)\r\nMm-mm.\r\n\r\n\r\nChris Koerner (38:56.046)\r\nYeah, I think it's...\r\n\r\n\r\nNikolas Hulewsky (39:14.367)\r\nI have to believe there's already existing products like this, right?\r\n\r\n\r\nChris Koerner (39:16.878)\r\nI think what people are doing is they're just in like random Facebook groups, like parents of University of South Carolina students. And they're just kind of talking one off. But I think there's a whole business around taking Facebook groups off of Facebook.\r\n\r\n\r\nNikolas Hulewsky (39:27.905)\r\nI was just going to say that I like the idea of not building a group in a community because that just takes a lot of work to get it spun up. Essentially, you're selling an info product. It's like, all right, cool. Here's the PDF. You know what I mean? These are the most recommended places and maybe you update it once a quarter, but then you don't have to worry about sourcing or users leaving comments or anything. You just are the trusted source and then you give the information.\r\n\r\n\r\nChris Koerner (39:50.691)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (39:56.787)\r\nonce a quarter, the only thing that would give me pause is like, I don't know if I want parents calling me for random, like call the police if you're that concerned. Cause otherwise, like, what are they going to be calling you for?\r\n\r\n\r\nChris Koerner (40:05.25)\r\nYeah, here, here's what I think it is. It's you, you join all the Facebook groups and you aggregate the data with Zapier and you put it in a newsletter and it's a paid newsletter, but it's paid by semester. Maybe it's a hundred bucks and every week the parents get a highlight of everything that's happening in the city that they're not going to see on Google. They're not going to find on the news. It's just going to be kind of like gossip from these local Facebook groups. Maybe it's only that.\r\n\r\n\r\nNikolas Hulewsky (40:30.721)\r\nThanks.\r\n\r\n\r\nChris Koerner (40:35.096)\r\nOr maybe it's that plus like the insurance concierge service for a higher price.\r\n\r\n\r\nNikolas Hulewsky (40:40.745)\r\nI laugh because I feel like everything comes back to newsletters. It just makes so much sense. It's a no-brainer. It's a no-brainer. I love it though. All right.\r\n\r\n\r\nChris Koerner (40:53.166)\r\nmuch time is, how much time is that?\r\n\r\n\r\nNikolas Hulewsky (40:56.225)\r\nWe're at 40 and I think 30 minutes. So an hour 10. Do want to do one more or?\r\n\r\n\r\nChris Koerner (40:59.714)\r\nOkay, that works. could do a marry, date and kill.\r\n\r\n\r\nSo we got food. We could combine the food ones.\r\n\r\n\r\nChris Koerner (41:17.23)\r\nfood ideas.\r\n\r\n\r\nChris Koerner (41:23.158)\r\nPeril.\r\n\r\n\r\nNikolas Hulewsky (41:24.577)\r\nYeah, so we've got the farmers market test products, farmers market create and coordinate, leaky gut or just pet piggybacking, university negotiations, Owen's inventory problem, and then the university trip advisor.\r\n\r\n\r\nChris Koerner (41:27.65)\r\nleaky gut.\r\n\r\n\r\nChris Koerner (41:44.632)\r\nSo how many is that?\r\n\r\n\r\nNikolas Hulewsky (41:46.273)\r\n1, 2, 3, 4, 5, 6. Now, we could...\r\n\r\n\r\nChris Koerner (41:49.688)\r\nI'm missing one of them. So I guess you split the food into two. There's like food ideas and then farmers market. That's two, right?\r\n\r\n\r\nNikolas Hulewsky (41:57.717)\r\nYeah, yep.\r\n\r\n\r\nChris Koerner (41:58.796)\r\nOkay, yeah, yeah. Okay. And then with did we do leaky gut after farmers market? And then university and then apparel?\r\n\r\n\r\nNikolas Hulewsky (42:09.153)\r\nand then the university and then Owen and then the TripAdvisor, University TripAdvisor.\r\n\r\n\r\nChris Koerner (42:16.398)\r\nAll right. I, kind of let us on kill Mary date last time. So you want to do it.\r\n\r\n\r\nNikolas Hulewsky (42:22.753)\r\nYeah, let me just think for a second.\r\n\r\n\r\nChris Koerner (42:30.19)\r\nyeah, I guess I gotta think too. What am I choosing here?\r\n\r\n\r\nNikolas Hulewsky (42:47.553)\r\nAre you ready?\r\n\r\n\r\nChris Koerner (42:49.036)\r\nAlmost.\r\n\r\n\r\nChris Koerner (42:58.734)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (43:02.461)\r\nAll right. Here we go. Marry, date or kill. I'll give you my picks. You'll give me yours and then we'll talk about them. So I would marry the reselling of inventory idea. I would date the university trip advisor idea and I would kill the farmer's market food idea just because I hate food products. And then in no man's land would be piggybacking off of pet companies and the university negotiations.\r\n\r\n\r\nChris Koerner (43:30.958)\r\nOkay. I would marry the university negotiations business because I think that anyone that can, sorry. What\r\n\r\n\r\nNikolas Hulewsky (43:43.523)\r\njust married it kill and then we can talk about why we picked each one.\r\n\r\n\r\nChris Koerner (43:45.826)\r\nyeah yeah yeah, sorry sorry.\r\n\r\n\r\nAll right, I would marry the university negotiations business. would date the specifically the slang in authentic pizzas at a farmer's market idea after doing market research to see if it would work or not.\r\n\r\n\r\nNikolas Hulewsky (44:04.447)\r\nthe biggest asterisk ever. Okay, okay.\r\n\r\n\r\nChris Koerner (44:04.856)\r\nBut I won't, but I won't say why. And I would, I would kill the last idea that I just brought up the university concierge parent idea.\r\n\r\n\r\nNikolas Hulewsky (44:14.759)\r\nReally? All right. Let's start with the Mary. Well, yeah, let's start with the Mary idea. I said Mary the inventory idea and you said Mary the university negotiations. That's it. Why? Okay. Why would you marry the negotiations?\r\n\r\n\r\nChris Koerner (44:27.437)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (44:31.192)\r\ngot everything I love baby cost zero dollars to start. You can scale it. It's a proven industry. It's a proven it's a proven tactic that's not being used in this industry, but it's you but you already know that you can negotiate your tuition. So we don't have to wonder about that. So\r\n\r\n\r\nNikolas Hulewsky (44:49.121)\r\nOkay, yeah, I had it no man's land just because of my own personal pride. I just would not enjoy that business, the negotiation part of it. So I agree with you though. Those are good points. I like the inventory idea for someone who's just like, I want to get into entrepreneurship because it's $200,000 of just inventory. they could test, and he's already written it off at this point. So they could test a bunch of stuff. They could throw up an e-commerce site. They could\r\n\r\n\r\nmess around with Google ads. They could mess around with Facebook ads. They could do just a bunch of different things and learn basically on somebody else's dime. So you could acquire a really good skill set and potentially make some money at it. That's why I like that idea. I thought it was fairly easy to launch. I really like the university trip advisor idea because I think that if you were a student at a university, you could easily put this together and start selling it. And then I killed the farmer's market stuff just because I hate food.\r\n\r\n\r\nI just think that's such a hard business to scale. What did you date?\r\n\r\n\r\nChris Koerner (45:58.606)\r\nthat, the pizza idea.\r\n\r\n\r\nNikolas Hulewsky (46:02.229)\r\nWhy?\r\n\r\n\r\nChris Koerner (46:03.214)\r\nI'm not trying to scale everything. I'm trying to have fun, man.\r\n\r\n\r\nI think, I think with the pizza idea, I think you could make a thousand dollars in four hours of net profit.\r\n\r\n\r\nNikolas Hulewsky (46:08.789)\r\nget it.\r\n\r\n\r\nNikolas Hulewsky (46:14.591)\r\nYou're OK. So you're saying personally it's like you like that idea enough where you're like, yeah, I'd date that idea just because I think it'd be fun. Not necessarily like as a recommendation to someone to.\r\n\r\n\r\nChris Koerner (46:21.667)\r\nYeah.\r\n\r\n\r\nNo, this is these are just what I like personally. Not that they're necessarily the best and have the broadest appeal. I would\r\n\r\n\r\nNikolas Hulewsky (46:27.007)\r\nYeah, Dude, you would have so much fun with that.\r\n\r\n\r\nYou and my brother-in-law Owen remind me of each other in this sense because you both love food and I could see you after having a big exit and you don't ever have to work again, you're just tinkering on food ideas. Every year around this time, he sells caramel apples. I could see you just every year like, how did the farmers market this weekend? People are like, Chris, what do you do? Why are you wasting time at the farmers market? You make $10 each time. You're like, I just love it. I love talking to people and having them try my pizza. That just reminds me of you. Let me read. All right, what did you kill?\r\n\r\n\r\nChris Koerner (46:42.915)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (46:50.606)\r\nWhat are you doing?\r\n\r\n\r\nChris Koerner (46:57.612)\r\nYeah, that'd be awesome.\r\n\r\n\r\nChris Koerner (47:03.946)\r\nUniversity Concierge.\r\n\r\n\r\nNikolas Hulewsky (47:05.856)\r\nWhy'd you kill it?\r\n\r\n\r\nChris Koerner (47:08.462)\r\nIt's just not proven. I don't know that there's demand. That scares me.\r\n\r\n\r\nI'd rather be copying someone that's doing this.\r\n\r\n\r\nNikolas Hulewsky (47:18.721)\r\nAlright, cool. Alright, I'm ready to go. I love it.\r\n\r\n\r\nChris Koerner (47:22.126)\r\nAll right, let's wrap.\r\n\r\n\r\nNikolas Hulewsky (47:23.841)\r\nThat's a wrap, Jack. Good to see you.",
  "metadata": {
    "duration": "",
    "date": "2024-12-20",
    "platform_source": "Google Drive"
  }
}