{
  "episode_number": "216",
  "episode_title": "AI SERIES: 20 - How to Turn Any Meeting into Action Items Automatically with AI with Olivia Look",
  "guest_name": "Olivia Look",
  "business_name": "Automation Agency",
  "transcript": "﻿Nikolas Hulewsky (00:00.718)\r\nAll right, Olivia, look, welcome back to Niconomics. I'm excited to have you because you posted something the other day that caught my eye. You are obviously an automation expert. You have an automation agency. You've helped hundreds of business owners actually figure out technology. And then you posted this use case. And I'm going to go and find it if I can. my direct messages. no. Here it is. So this is you. It's literally this easy.\r\n\r\n\r\nOlivia Look (00:03.652)\r\nThank you.\r\n\r\n\r\nNikolas Hulewsky (00:29.838)\r\nAnd then there's a screenshot that says email outbox watch agent. There's a trigger, which is a new email that comes in. And then here are the instructions. Basically, whenever you get a new email saying that you're going to do something, go look and click up to see whether or not a to-do has already been generated. If not, create a new to-do and click up. And then follow up with you in one to three days.\r\n\r\n\r\nOlivia Look (00:50.32)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (00:51.694)\r\nIt's amazing. Like, I don't know how I'd normally do it now. I'm like, I need to go check my email five times a day. But with this, it's just pushing you notifications of, like you said you were gonna do this, Olivia. Let's go follow up with you to make sure that you were actually gonna do this thing this time. Where is this? Where did you build this?\r\n\r\n\r\nOlivia Look (01:08.314)\r\nYeah.\r\n\r\n\r\nI built this with Zapier agents. So this is built in Zapier.\r\n\r\n\r\nNikolas Hulewsky (01:15.726)\r\nOkay, so Zapier has a new functionality called agents.\r\n\r\n\r\nOlivia Look (01:19.786)\r\nYes, yes. And they are very similar to Zaps and the way you typically automate things. And when you get into building them, you'll see a lot of the options are the same, but the agents directly integrate AI and basically kind of naturally allow for the AI to be making decisions for you within workflows.\r\n\r\n\r\nNikolas Hulewsky (01:21.441)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (01:43.961)\r\nSo if I want to an automation like this, if I'm like, that's really cool. I want to have my emails create new to do items for me. What softwares do I need? Obviously Gmail, because that's where my email is. But what else do I need in order to make this work?\r\n\r\n\r\nOlivia Look (01:53.551)\r\nMm-hmm.\r\n\r\n\r\nOlivia Look (01:57.594)\r\nMm-hmm.\r\n\r\n\r\nAdjust that plus Zapier. So Zapier Agents is a separate product.\r\n\r\n\r\nNikolas Hulewsky (02:03.49)\r\nJust that plus zappier.\r\n\r\n\r\nNikolas Hulewsky (02:08.451)\r\nMm-hmm.\r\n\r\n\r\nOlivia Look (02:10.564)\r\nBut there is a fairly generous free tier that I built this one on and we've been pretty happy with it so far.\r\n\r\n\r\nNikolas Hulewsky (02:18.158)\r\nOkay, can we build it?\r\n\r\n\r\nOlivia Look (02:19.98)\r\nYeah, definitely. Yeah. Yeah. Perfect. All right. So let me share my screen and I will just start from literally the Zapier homepage.\r\n\r\n\r\nNikolas Hulewsky (02:21.07)\r\nCan you show me? All right, let's do it. I wanna see your screen.\r\n\r\n\r\nNikolas Hulewsky (02:34.318)\r\nPerfect. Because that's what I need. I'm like, okay, where on the Zapier home, how far down do I scroll? What exactly do I click on?\r\n\r\n\r\nOlivia Look (02:47.895)\r\nI am...\r\n\r\n\r\nOlivia Look (02:52.356)\r\ndoing some privacy settings right now.\r\n\r\n\r\nNikolas Hulewsky (02:54.734)\r\nNo worries, we can edit, don't worry, we'll edit this part.\r\n\r\n\r\nOlivia Look (02:59.482)\r\nPerfect, okay, so then, okay, now we're looking at Zapier, right, everybody? Perfect, so this is the Zapier homepage. This is what you will see when you just log right in. The agents are gonna be down here in the left-hand sidebar at the bottom.\r\n\r\n\r\nNikolas Hulewsky (03:17.208)\r\nSo I just click agents and it takes me to a new. So it doesn't look like the old Zapier.\r\n\r\n\r\nOlivia Look (03:18.724)\r\nYep.\r\n\r\n\r\nOlivia Look (03:23.734)\r\nNot quite, no.\r\n\r\n\r\nNikolas Hulewsky (03:27.246)\r\nCause the old Zapier had like little boxes and arrows and lines and...\r\n\r\n\r\nOlivia Look (03:27.523)\r\nAnd so.\r\n\r\n\r\nOlivia Look (03:32.276)\r\nYes, this is much more plain English natural language processing for your instructions, which I think is one of the really powerful things that the AI brings to automation in particular.\r\n\r\n\r\nNikolas Hulewsky (03:46.784)\r\nWow. So I could basically say, hey, this is what I want to do. Please go execute it as opposed to having to think through the process of, okay, step one. So I need to create this app step two, that's that fair. Okay.\r\n\r\n\r\nOlivia Look (03:57.873)\r\nYes. Yes. And that's exactly what we're to build.\r\n\r\n\r\nOlivia Look (04:04.854)\r\nSo I will go ahead and click new agent here just to completely start from scratch. And every time I have briefly described what I want the agent to do so that Zapier uses its own AI to put the directions and everything together, it just doesn't turn out that great. So I skip this step.\r\n\r\n\r\nevery time so I can start just from a completely blank slate. But there are tons of templates and you can briefly describe what you want on that page and it will pre-generate instructions for you. I just don't like how it turns out.\r\n\r\n\r\nNikolas Hulewsky (04:36.652)\r\nYeah, so if you're just listening, basically what she said is she clicks new agent and then this page pops up that's like, what would you like this agent to do? And so you have the option to enter it basically into a chat box of explaining what you want it to do. She's saying, I just skipped that step and I go straight to creating.\r\n\r\n\r\nOlivia Look (04:55.606)\r\nYes, yes, exactly. So we are still looking at just building, this is a completely blank slate. And so what I want this to do is every time I send an email and say I'm going to do something, it checks click up, which is where I keep my internal to-do list. It checks click up for a related task. And then if it doesn't find one, creates a new one with a reasonable due date.\r\n\r\n\r\nassigned to me. So that's the general idea. And I'm basically going to explain that almost exactly the same in these instructions here. The first thing I'm going to do though is start with the trigger. So I'm going to add a trigger. And this is where things start to look similar to Zapier. They're not exactly the same, but you're going to be here, you know, searching for the app that you want to use. And then\r\n\r\n\r\nNikolas Hulewsky (05:51.246)\r\nOkay, so when you go to trigger, you're not telling it like, anytime I get a new email, you're saying Gmail is the app that's, okay.\r\n\r\n\r\nOlivia Look (05:59.412)\r\nYes. Yes, and we are putting this, so we're using Gmail here. If you use Outlook, you can use Outlook as well. They have the same functionality, which is awesome. So I am going to select the new email trigger, I believe.\r\n\r\n\r\nYep.\r\n\r\n\r\nNikolas Hulewsky (06:20.224)\r\nCan you go back? I'm sorry. Can you go back to that? looks like it looked like there's a couple of different options in there.\r\n\r\n\r\nOlivia Look (06:25.34)\r\nYes. So do you want me to go back a step to look at the triggers? So these are all the triggers that are available and these are what's usually available in Zapier itself. So these are things you can always trigger. So a new attachment, new labels. I used to label emails with a click up label in Gmail to get them sent over.\r\n\r\n\r\nNikolas Hulewsky (06:30.388)\r\nYeah, could you? Sorry.\r\n\r\n\r\nNikolas Hulewsky (06:38.83)\r\nNikolas Hulewsky (06:50.648)\r\nMm-hmm.\r\n\r\n\r\nOlivia Look (06:51.592)\r\nBut that still requires me to remember to do that.\r\n\r\n\r\nNikolas Hulewsky (06:55.478)\r\nYeah. so these are like pre-built. Basically any email that I send could be a trigger. Any email that I get could be a trigger. Any email with the words, don't know, yada, yada, yada could be a trigger. Okay.\r\n\r\n\r\nOlivia Look (07:08.226)\r\nYes, exactly.\r\n\r\n\r\nSo I will connect up my Gmail directly. you are just a beginner at Zapier and far more people get into Zapier and never successfully create their first Zap than people who do get in there and get something built. So if you even have anything built in Zapier, you are far ahead of the curve.\r\n\r\n\r\nNikolas Hulewsky (07:12.396)\r\nI'm a Neanderthal, okay? I'm catching up. I'm catching up.\r\n\r\n\r\nNikolas Hulewsky (07:34.77)\r\nyou're very kind. Thank you for those words of encouragement.\r\n\r\n\r\nOlivia Look (07:36.56)\r\nFor you and everyone else.\r\n\r\n\r\nNikolas Hulewsky (07:38.958)\r\nOkay, so we picked the first zap which was a Gmail trigger and the trigger you picked was\r\n\r\n\r\nOlivia Look (07:45.239)\r\nYes.\r\n\r\n\r\nthis new email which triggers when a new email appears in the specified mailbox and that mailbox for us is going to be the sent box.\r\n\r\n\r\nNikolas Hulewsky (08:01.774)\r\nokay. Cool. So there's a second category that you can choose from after you've chosen sent. It'll ask you where, which, which box mailbox. Okay.\r\n\r\n\r\nOlivia Look (08:11.466)\r\nYes, and if you choose something like, for example, when a new label is applied, the options are preset as well for which label.\r\n\r\n\r\nNikolas Hulewsky (08:21.352)\r\ndude, you could set a trigger where it's like anytime I label something follow up or like remind me to do that in seven days or anytime I label it team or I'm trying to think inquiry, right? that's a sales lead that then there's a trigger for that that goes into a different funnel. Holy crap. Okay. I feel so stupid. Wow. Okay, cool. A whole new world.\r\n\r\n\r\nOlivia Look (08:28.239)\r\nYes.\r\n\r\n\r\nOlivia Look (08:34.064)\r\nMm-hmm.\r\n\r\n\r\nOlivia Look (08:39.672)\r\nYes. Mm-hmm. No, no, there's a whole world out there.\r\n\r\n\r\nYes! my gosh. That was perfect.\r\n\r\n\r\nNikolas Hulewsky (08:51.502)\r\nAll right, so you've chosen the send outbox, great.\r\n\r\n\r\nOlivia Look (08:54.478)\r\nYes. And that's all there is to this one. That's it. So then I am going to actually tell it what I want it to do here. And I'm going to start with just natural language. And then I'll use this add tools button to add in the actual integration to click up. So the first thing that I'll do is, and you saw almost the exact instructions in the\r\n\r\n\r\nNikolas Hulewsky (08:57.452)\r\nThat's it. Okay.\r\n\r\n\r\nNikolas Hulewsky (09:13.39)\r\nMm.\r\n\r\n\r\nOlivia Look (09:24.084)\r\nx post that you shared earlier but when I send an email saying I'm going to do something can you edit this to make it look like I'm a better typist\r\n\r\n\r\nNikolas Hulewsky (09:38.956)\r\nI'm kidding.\r\n\r\n\r\nNikolas Hulewsky (09:44.568)\r\nThat's actually one thing we can't do. I'm so sorry.\r\n\r\n\r\nOlivia Look (09:46.32)\r\nSearch, click up for a related task. And if one does not exist, create one.\r\n\r\n\r\nassigned to Olivia with a due date one to three days out. That seems like a reasonable follow up time. Okay. So that's all there is to this piece. I just said, when I send an email saying I'm going to do something, check, click up. If you don't see something in there, make a task.\r\n\r\n\r\nSo this is just plain English instructions. And so what I'm going to do, not yet. So right here, and I don't know if the exact placement of these things matter, but I put them right before it. So right before search click up, I'm going to add tools.\r\n\r\n\r\nNikolas Hulewsky (10:30.478)\r\nand you haven't added any tools yet.\r\n\r\n\r\nOlivia Look (10:50.434)\r\nand I will search for ClickUp again. And all of those integrations is just like Zapier where you search for your app and there's just a huge list of apps and then a bunch of triggers and actions and things. So these are all of the things that you can do with ClickUp, which is our task management platform.\r\n\r\n\r\nIt's extensive. There are a ton of options and they update fairly often as well.\r\n\r\n\r\nNikolas Hulewsky (11:19.214)\r\nseems overwhelming. would you just, how, okay, let's say I was coming in here trying to do this. Would I scroll until I find the thing that says, check new task? Or like, what are you even looking for right now? I guess is what I should ask. You're just looking for clickup or you're looking for a specific task within clickup.\r\n\r\n\r\nOlivia Look (11:21.677)\r\nIt can be.\r\n\r\n\r\nOlivia Look (11:39.702)\r\nYes, so this is perfect. What I am doing right now is grabbing my to-do list because it has to check that to-do list and tell me if there's already a related task here. So I'm going to say, find a list of all tasks, which is going to get me a list of many tasks. And it looks like I can do them based on the list specifically, which is where my to-do list is.\r\n\r\n\r\nSo if you were just getting into this and you, for example, wanted to create a task or find a task, I would search for tasks. So you're only looking at the task items. There are still a ton of them, but you can see the options and things.\r\n\r\n\r\nNikolas Hulewsky (12:21.964)\r\ninteresting.\r\n\r\n\r\nOlivia Look (12:24.452)\r\nSo that's what I would do especially because ones like ClickUp can be really extensive. So there's just a lot of stuff to go through, like you said.\r\n\r\n\r\nOlivia Look (12:36.014)\r\nI am going to use this find a list of all tasks. And then it just pops up like this and I click the settings icon, the tiniest settings icon you've ever seen in your life. You're gonna click that. And then very similar to how you see it in Zapier. So I have my ClickUp account already connected. I know where my to-do list is. That's a flat out defined field.\r\n\r\n\r\nSo I'm going to set a specific value for this field instead of letting my agent select a value.\r\n\r\n\r\nNikolas Hulewsky (13:04.782)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (13:11.21)\r\nSo if I let the agent select the values that were basically AI context comes into place, they're using context to make a decision on your behalf. Okay.\r\n\r\n\r\nOlivia Look (13:16.942)\r\nYes. Yes.\r\n\r\n\r\nAnd so my to-do list, I will just set all of these values specifically.\r\n\r\n\r\nNikolas Hulewsky (13:22.794)\r\ninteresting.\r\n\r\n\r\nOlivia Look (13:33.232)\r\nAnd there's my to do list.\r\n\r\n\r\nOlivia Look (13:37.866)\r\nI will let my agent select a value for all of these fields. I will set myself as the assignee here because I only want it checking for to-do list items assigned.\r\n\r\n\r\nNikolas Hulewsky (13:50.51)\r\nwow. So since it was already integrated with a click up, there was Scott look, so it already knew there's somebody else it could be assigned to.\r\n\r\n\r\nTechnology is cool for you kids.\r\n\r\n\r\nOlivia Look (14:02.256)\r\nIt is, it is. You can learn too, Grandpa.\r\n\r\n\r\nNikolas Hulewsky (14:04.12)\r\nCan you scroll back up to the top? Can you scroll back up to the top?\r\n\r\n\r\nOlivia Look (14:10.052)\r\nYeah, for sure.\r\n\r\n\r\nNikolas Hulewsky (14:15.038)\r\nOkay, so you just went through you selected the workspace, the folder and the little, okay, got it.\r\n\r\n\r\nOlivia Look (14:21.656)\r\nYes, and those are click up specific terminology. if you're using Trello, you might, you know, select a board here instead of a workspace or something like that. But if you're using the app, you should recognize.\r\n\r\n\r\nNikolas Hulewsky (14:26.989)\r\nSure.\r\n\r\n\r\nNikolas Hulewsky (14:30.702)\r\nThe bottom line is whatever software you're using, it's going to show in the language that you'd be familiar with for that software.\r\n\r\n\r\nOlivia Look (14:38.594)\r\nYes, exactly, exactly. So I am going to go ahead.\r\n\r\n\r\nand let this do its thing. So it's going to search, click up for a related task. If one does not exist, create one. So I'm going to insert another tool here.\r\n\r\n\r\nNikolas Hulewsky (15:00.142)\r\nHow do you know when to insert the tools?\r\n\r\n\r\nOlivia Look (15:02.39)\r\nat its whole.\r\n\r\n\r\nUm, that is going to be when there's an actual action you want to be taken in an app. So I want to search my click up or add a new task and click up. That's when I would add a tool. Basically, anytime you're adding another connection to a different app.\r\n\r\n\r\nNikolas Hulewsky (15:14.166)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (15:23.47)\r\nSo at this...\r\n\r\n\r\nNikolas Hulewsky (15:28.322)\r\nSo at this point, you would actually search task this time, because you want it to actually do something.\r\n\r\n\r\nOlivia Look (15:34.836)\r\nYes, so this time I'm going to create the task. And I am going through a million of these, so there it is.\r\n\r\n\r\nOlivia Look (15:46.21)\r\nOkay, so we will click up create task assigned to Olivia with a due date one to three days out. So I'm going to come back and do this whole thing again.\r\n\r\n\r\nNikolas Hulewsky (15:55.128)\r\nMm-hmm.\r\n\r\n\r\nOlivia Look (15:59.695)\r\nAnd these fields are all very similar to what you see in Zapier. This is just a little bit less pretty.\r\n\r\n\r\nNikolas Hulewsky (16:09.634)\r\nI was going say UI seems more intuitive than Zapier or traditional Zapier.\r\n\r\n\r\nOlivia Look (16:19.886)\r\nI agree with you, this makes a lot of sense. I do like the visual flow of the Zap Builder though. Although this doesn't have the same, you know, there's not a lot of visual flow happening here. It's all our natural language, which is fun.\r\n\r\n\r\nNikolas Hulewsky (16:38.882)\r\nLook at you waxing nostalgic about Zapier. It's beautiful.\r\n\r\n\r\nOlivia Look (16:42.096)\r\nThank you. So I am going to let my agent generate a value for the task name when it creates a value or creates a task. I am going to not set that because I don't want it getting into things. You know, at some point you can say,\r\n\r\n\r\nI don't want the AI even thinking about this, so leave it out. And that's what I'm going to do for that.\r\n\r\n\r\nNikolas Hulewsky (17:16.066)\r\nWhat happens if you didn't come in here and hard code these? Would the AI have enough context just based on what the instructions that you gave it to go out and execute or no?\r\n\r\n\r\nNikolas Hulewsky (17:33.122)\r\nor you don't know, which is an okay answer too.\r\n\r\n\r\nOlivia Look (17:33.24)\r\nLet me see. That's interesting. No, I don't know. I'd be happy to test that. So if I maybe didn't say.\r\n\r\n\r\nNikolas Hulewsky (17:39.854)\r\nWe can test it, no, we can test it afterwards. I was just curious if.\r\n\r\n\r\nOlivia Look (17:42.768)\r\nThat's a good idea. Let it work first.\r\n\r\n\r\nOlivia Look (17:54.169)\r\nI wonder if it would understand the context. Interesting. Okay. Gonna let the agent generate a value for this field, let it generate a value for this field. I think we're okay here.\r\n\r\n\r\nOlivia Look (18:12.354)\r\nI will let it handle the assignee and the due date. I wonder if it's going, I don't think it has the context for example.\r\n\r\n\r\nOlivia Look (18:31.162)\r\nto know it's me. So like when I say assign Olivia, I don't know if it knows who that is. So I'm gonna go ahead and add myself as this specific assignee here.\r\n\r\n\r\nAnd that's it. Okay. So now I can just test it. That's the whole thing. I'm moving you over to the other side so I can test it. Testing sometimes takes a little while, so we're gonna see how it does.\r\n\r\n\r\nNikolas Hulewsky (19:00.898)\r\nOkay, how long does testing usually take?\r\n\r\n\r\nOlivia Look (19:04.336)\r\nIt depends on how long it takes it to get an email. Well, that's helpful.\r\n\r\n\r\nOlivia Look (19:14.232)\r\nIt just said there was a problem testing this agent. Let me see.\r\n\r\n\r\nNikolas Hulewsky (19:22.766)\r\nacknowledge nothing cooperative.\r\n\r\n\r\nOlivia Look (19:24.58)\r\nnot today.\r\n\r\n\r\nNikolas Hulewsky (19:35.426)\r\nFingers crossed.\r\n\r\n\r\nNikolas Hulewsky (19:39.798)\r\nHmm?\r\n\r\n\r\nOlivia Look (19:51.14)\r\nGive it a refresh, the old off and back on again.\r\n\r\n\r\nNikolas Hulewsky (19:54.808)\r\nYeah, that's the tried and true IT technique.\r\n\r\n\r\nOlivia Look (20:02.683)\r\nThere was a problem testing this agent is probably the most helpful error message I've ever seen.\r\n\r\n\r\nNikolas Hulewsky (20:10.146)\r\nYeah, it's very specific.\r\n\r\n\r\nOlivia Look (20:25.167)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (20:33.644)\r\nI want you to try something and we can, we'll like splice this, but just do it all again, but don't go to any of the fields. like, like write it like this, but then just say, click up, find a list of tasks, then don't go into the settings and the, and the click up, create tasks. Don't go into the settings. I'm, curious what generates from that. Let's, let's see if that works.\r\n\r\n\r\nOlivia Look (20:33.657)\r\nWell.\r\n\r\n\r\nThat's fine.\r\n\r\n\r\nOlivia Look (20:52.56)\r\nOkay.\r\n\r\n\r\nOlivia Look (21:00.963)\r\nOoh, okay, okay, okay. Here, so let me...\r\n\r\n\r\nOlivia Look (21:08.337)\r\npull this one out and then just say, find a list of all my tasks. Create tasks, that would be crazy. I hope this doesn't blow up my clipboard.\r\n\r\n\r\nNikolas Hulewsky (21:24.334)\r\nFill up your what?\r\n\r\n\r\nOlivia Look (21:25.701)\r\nthe clicker.\r\n\r\n\r\nNikolas Hulewsky (21:27.682)\r\nme too.\r\n\r\n\r\nOlivia Look (21:29.809)\r\nYou're right.\r\n\r\n\r\nNikolas Hulewsky (21:30.594)\r\nYeah, where's the control Z? Where's the undo on Zapier?\r\n\r\n\r\nOlivia Look (21:32.753)\r\nYeah.\r\n\r\n\r\nOlivia Look (21:39.001)\r\nIs it not?\r\n\r\n\r\nNikolas Hulewsky (21:40.704)\r\nIt's still not running.\r\n\r\n\r\nOlivia Look (21:42.935)\r\nIt is. I wanna see if...\r\n\r\n\r\nOlivia Look (21:50.841)\r\nit one more time just because.\r\n\r\n\r\nCool.\r\n\r\n\r\nNikolas Hulewsky (21:56.75)\r\nOkay, well we can we can pretend like it just worked and then you we can start now let's walk me through Creating it as app\r\n\r\n\r\nOlivia Look (22:07.502)\r\na zap or\r\n\r\n\r\nNikolas Hulewsky (22:09.346)\r\nWell, an agent, yeah.\r\n\r\n\r\nOlivia Look (22:11.363)\r\nOkay, okay, I was gonna say I know you had one that you wanted help building as well, which we can also get into. Okay.\r\n\r\n\r\nNikolas Hulewsky (22:17.356)\r\nYes, let's do this. Let's do it. All right, I'm going to share my screen now.\r\n\r\n\r\nOlivia Look (22:23.119)\r\nYeah, sure. Let me stop sharing here. There we go.\r\n\r\n\r\nNikolas Hulewsky (22:28.448)\r\nAll right, so I'm in Zapier. I come over here to Agents.\r\n\r\n\r\nOlivia Look (22:30.31)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (22:34.05)\r\nI'm now in the agents. I'm going to click new agent. So what I want to do is something that lots of business owners, I think could benefit from. It's after you have a meeting where AI has attended and your note taker has attended after that meeting, I want something emailed out to my team or to me summarizing the meeting and telling me what the due outs are for each individual. So I'll skip your step.\r\n\r\n\r\nOlivia Look (22:58.457)\r\nOkay. Perfect. Yes, give that.\r\n\r\n\r\nNikolas Hulewsky (23:04.654)\r\nAnd the first trigger, okay, I'm gonna try this and then you stop me when I do something stupid. I'm gonna add a trigger. I'm gonna go to Otter AI, which is the AI that I use. Cool. New recording.\r\n\r\n\r\nOlivia Look (23:08.721)\r\nPerfect.\r\n\r\n\r\nNikolas Hulewsky (23:24.654)\r\nOkay, cool, that's it. Save. And now I just want to tell it what I'm doing. Every time there is a new meeting transcript.\r\n\r\n\r\ngenerated. Please summarize the meeting.\r\n\r\n\r\nNikolas Hulewsky (23:50.734)\r\nAnd...\r\n\r\n\r\nGive.\r\n\r\n\r\nNikolas Hulewsky (23:58.062)\r\nfollow up assignments for each person who.\r\n\r\n\r\ntook on a task. Okay. So I wrote it out and now I need to go and look for actions being taken. So every time there's a new meeting transcript generated, boom, that's an action. So I'm probably going to have to insert Otter AI here.\r\n\r\n\r\nOlivia Look (24:23.365)\r\nThat is your trigger. So it should already be handled by the trigger section.\r\n\r\n\r\nNikolas Hulewsky (24:28.588)\r\nOkay, excusez-moi. Please summarize the meeting and give follow-up assignments. here's my question. Will AI within Zapier do that for me or do I need to then go to like OpenAI and with an API call, have OpenAI summarize that?\r\n\r\n\r\nOlivia Look (24:49.361)\r\nOkay, so Zapier agents are going to be able to handle that on their own. So they are using their own LLM features within this. When you chat with the agent, you are chatting with an LLM. So you don't necessarily have to connect another AI tool, but you can if you want to.\r\n\r\n\r\nNikolas Hulewsky (25:08.718)\r\nOkay, I could if I wanted to.\r\n\r\n\r\nOlivia Look (25:10.009)\r\nI think you can test this agent as is.\r\n\r\n\r\nNikolas Hulewsky (25:13.856)\r\nOkay, are these instructions enough? So I've told it where to get something from, I've told it what to do, but it doesn't necessarily know where to send it.\r\n\r\n\r\nOlivia Look (25:23.887)\r\nRight, right now I think it's going to chat it back out to you.\r\n\r\n\r\nNikolas Hulewsky (25:28.3)\r\nOkay, so do I, what do I do? Do I just test?\r\n\r\n\r\nOlivia Look (25:32.805)\r\nYou can see what happens now. Yeah, test incrementally.\r\n\r\n\r\nNikolas Hulewsky (25:34.83)\r\nYes, ma'am. Test the agent. Otter AI new recording.\r\n\r\n\r\nOlivia Look (25:42.595)\r\nyour agent is testing. That's nice.\r\n\r\n\r\nNikolas Hulewsky (25:44.696)\r\nI guess it's, but like, like I had maybe a new recording yesterday. So is it going to go do,\r\n\r\n\r\nOlivia Look (25:51.695)\r\nYou can see.\r\n\r\n\r\nNikolas Hulewsky (25:54.03)\r\nyeah. So Marissa is my new assistant. We're talking about like a 30 day content series that we're going to do where we're posting a new business idea for first time entrepreneurs every single day. And it has her. and it has the do outs. Okay.\r\n\r\n\r\nI'm not a huge fan of the format. I'm sure I could mess with that. That's fine. But what do I want to do with this information? If I'm a business owner, what do I want to do? I could text it out to my employees. I could email it out to my employees. If I have Slack, I could probably send a Slack message with this to employees. Teams would be the same thing. Click up, I could create a click up to do, right? It's like, okay, here is the meeting and now here are the click up to do's from today's meeting.\r\n\r\n\r\nOlivia Look (26:44.145)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (26:45.58)\r\nWhat else would you do with a meeting minute summary? Maybe look at everybody who was on the meeting, get their email, and then send them a message.\r\n\r\n\r\nOlivia Look (26:54.755)\r\nMm-hmm. I do like those follow-up emails that I sometimes get from, I don't know if it's Otter or Fireflies or a different tool. Sometimes they do send kind of meeting summaries to everyone that attended, which is nice.\r\n\r\n\r\nNikolas Hulewsky (27:03.191)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (27:08.11)\r\nOkay, so I could just add something here. Please send meeting summaries to everyone who.\r\n\r\n\r\nintended.\r\n\r\n\r\nSo at this point, do I need to add something here? Please send meeting summaries to everyone who attended. Okay, what would I need to add?\r\n\r\n\r\nOlivia Look (27:25.041)\r\nYeah.\r\n\r\n\r\nYes, so here you will add a tool. You said you use Gmail, right? So put the cursor right after send meeting summaries. Yep. And go ahead and add a space and then add tools.\r\n\r\n\r\nNikolas Hulewsky (27:42.894)\r\nOkay.\r\n\r\n\r\nOlivia Look (27:52.227)\r\nAnd then you will choose Gmail there. Perfect. And then you're going to send an email.\r\n\r\n\r\nNikolas Hulewsky (27:56.13)\r\nAnd now what do I do?\r\n\r\n\r\nOlivia Look (28:05.623)\r\nAlright.\r\n\r\n\r\nNikolas Hulewsky (28:06.158)\r\nAll so I could come in here to look at the fields to let your agent generate a value for this. That's what I want. I want them to be able to, okay. Let your agent select the value.\r\n\r\n\r\nOlivia Look (28:08.539)\r\nMm-hmm.\r\n\r\n\r\nOlivia Look (28:14.053)\r\nHmm?\r\n\r\n\r\nNikolas Hulewsky (28:20.43)\r\nI don't need a cc, bcc, from, your name, reply to, subject, body, okay. I'm just gonna let the agent generate all that stuff. And now, retest.\r\n\r\n\r\nOlivia Look (28:27.067)\r\nPerfect. Yeah, go for it.\r\n\r\n\r\nretest.\r\n\r\n\r\nNikolas Hulewsky (28:39.312)\r\nmy gosh, it's happening. I'm sending the meeting summary and following up assignments to everyone who attended the meeting. Okay, it's thinking.\r\n\r\n\r\nOlivia Look (28:39.407)\r\nAnd it named itself.\r\n\r\n\r\nNikolas Hulewsky (28:54.37)\r\nThis is exciting.\r\n\r\n\r\nOlivia Look (28:56.419)\r\nIsn't it cool?\r\n\r\n\r\nNikolas Hulewsky (28:57.718)\r\nYes.\r\n\r\n\r\nOkay, so here's the message it sends from me. Hi Nick and Marissa, here's the summary. Okay, oh, so it's actually sent to me. That's my email and that's Marissa's email. I'm gonna need to have, Mohammed, please edit that out. Hi Nick and Marissa, here's the summary. Okay, Nick and Marissa discuss strategies, blah, blah, blah. Action items.\r\n\r\n\r\nNikolas Hulewsky (29:25.344)\r\nVery freaking cool. Does it look good if there's anything? So, okay, let's go up here. I don't like just the massive body of text. So I could give it some formatting instructions.\r\n\r\n\r\nOlivia Look (29:27.514)\r\nHow cool is that?\r\n\r\n\r\nOlivia Look (29:35.578)\r\nOkay.\r\n\r\n\r\nOlivia Look (29:39.376)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (29:40.492)\r\nOkay, please summarize the meeting and give follow-up assignments to each person.\r\n\r\n\r\nI want the summary to be short bullet pointed short bullet pointed. What am I Summaries of each.\r\n\r\n\r\nmajor topic discussed. have no I don't know what I'm saying. Okay. I don't know. I don't know.\r\n\r\n\r\nOlivia Look (30:11.705)\r\nThis is perfect. No, knows what they're doing when they're prompting.\r\n\r\n\r\nNikolas Hulewsky (30:15.246)\r\nOkay, okay. Make sure to highlight specific examples used.\r\n\r\n\r\nduring meetings where instructions.\r\n\r\n\r\nNikolas Hulewsky (30:36.558)\r\nare given. Also, please be sure to use.\r\n\r\n\r\nnames for...\r\n\r\n\r\nNikolas Hulewsky (30:53.134)\r\nWho will do what as category?\r\n\r\n\r\nseparate towards. Okay, let's try that.\r\n\r\n\r\nOlivia Look (31:06.338)\r\nNice, yeah, test it again.\r\n\r\n\r\nNikolas Hulewsky (31:09.352)\r\nmy gosh, what's happening?\r\n\r\n\r\nOlivia Look (31:10.565)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (31:15.746)\r\nThis is super, do you know what it's built, what it's on top of? it using Claude? Is it using Chat TVT? Is it its own LLM?\r\n\r\n\r\nOlivia Look (31:23.823)\r\nI looked this up recently and I totally forgot. So AI by Zapier, I believe might be their own hosted model. But when you use AI by Zapier tools, you can also select the model. So if you want to use GPT-4.0 or something, you can select it there.\r\n\r\n\r\nNikolas Hulewsky (31:45.752)\r\nWatch this, AI by Zapier uses OpenAI's GPT-4.0 mini by default.\r\n\r\n\r\nNikolas Hulewsky (31:55.15)\r\nSo I'll ask you that question again. Hey, Olivia, you know what Zapier is built on top of?\r\n\r\n\r\nOlivia Look (31:57.392)\r\nYeah.\r\n\r\n\r\nOlivia Look (32:02.449)\r\nYeah, it's built on top of ChatGPT 4.0 mini by default. But when you use the AI by Zapier actions, you can select the model if you want.\r\n\r\n\r\nNikolas Hulewsky (32:09.176)\r\nEasy peasy.\r\n\r\n\r\nNikolas Hulewsky (32:15.864)\r\nDude, okay, look at this. I did exactly what I said. All right, everybody hears the email. Meeting summary, dog behavior, Marissa has a very cute dog named Buster. Newsletter platforms, building an audience, course and team building.\r\n\r\n\r\nOlivia Look (32:18.053)\r\nHow did the email turn out?\r\n\r\n\r\nNikolas Hulewsky (32:33.632)\r\nAnd you can see I want to see if it used any examples.\r\n\r\n\r\ndoes. Okay. Perfect. Yeah. Here's an example. This is freaking cool. This is great.\r\n\r\n\r\nOlivia Look (32:45.937)\r\nNice.\r\n\r\n\r\nIsn't it so cool? And it was so easy to build. You built it with plain English and a little bit of clicking.\r\n\r\n\r\nNikolas Hulewsky (32:50.776)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (32:57.08)\r\nWow, this is, mean, like if I'm a business, I own businesses, but I don't operate them anymore. I used to operate the businesses, but like as a business owner, I'm just thinking of all the use cases of this. I mean, this is just meeting summaries that could be automated. Like I don't need to sit down at my desk anymore and be like, okay, what did we talk about in our meeting? Okay, everyone, here's what we discussed and here's when we will meet again. And like, I could set it up one time to say this is sort of my framework.\r\n\r\n\r\nOlivia Look (33:12.453)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (33:25.71)\r\nfor summarizing meetings. I like to talk about who was there, what was discussed, what were the action items, were there any examples, when are we meeting again? Like that could be, I could have added that to this instructions, right? When are we meeting again? I could even have it say in the instructions, oh, that would've been cool. Please generate a new meeting based on what we decided in that meeting, right? Oh man, that would've been great. And then you don't have to worry about like,\r\n\r\n\r\nOlivia Look (33:48.877)\r\nYes, yes.\r\n\r\n\r\nNikolas Hulewsky (33:53.176)\r\nHey, did Brian set up that meeting for next Tuesday that we talked about?\r\n\r\n\r\nThat's freaking money. That's amazing.\r\n\r\n\r\nOlivia Look (33:58.005)\r\nMm-hmm. Mm-hmm. Because everybody wants to like look at a meeting as a to-do item I want to end that meeting and end that meeting like I wanted to be over I want to walk away. I want to go do something else. I don't want to immediately follow up on the meeting. I just took so Yes Mm-hmm. Mm-hmm. I will forget genuinely\r\n\r\n\r\nNikolas Hulewsky (34:09.293)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (34:14.254)\r\nYeah, I don't want an open loop. Yeah, I want it to just be done. I don't need to circle back on anything.\r\n\r\n\r\nNikolas Hulewsky (34:23.308)\r\nRight, right, that's amazing. Okay, this was fantastic. I encourage anybody who's watching to go, just go try something. Just go try to automate something. And when you realize you don't know anything, reach out to Olivia and pay her company lots of money to figure it out for you. No, but seriously, go play around with it. Test this out. If you get stuck, reach out to Olivia. I'm sure she's more than willing to answer some questions. It's amazing. All right.\r\n\r\n\r\nOlivia Look (34:38.104)\r\nYeah, yeah.\r\n\r\n\r\noption.\r\n\r\n\r\nOlivia Look (34:50.575)\r\nYeah, absolutely. Me and my whole team of people who are even smarter than me.\r\n\r\n\r\nNikolas Hulewsky (34:56.002)\r\nWell, thank you for this. This was awesome. I can't wait to talk again.\r\n\r\n\r\nOlivia Look (34:58.417)\r\nAbsolutely. Yeah, thank you.",
  "metadata": {
    "duration": "",
    "date": "2025-08-11",
    "platform_source": "Google Drive"
  }
}