{
  "episode_number": "114",
  "episode_title": "TOP PICK! How This 25-Year-Old Built a $1M+ Pest Control Business with Casey McDaniel",
  "guest_name": "Casey McDaniel",
  "business_name": "Pest Control Company",
  "transcript": "﻿Nikolas Hulewsky (00:00.239)\r\nWe don't need to worry about being perfect from the jump. All right, Casey. So the only experience that I have with Pest Control, which is your business, are the door-to-door sales guys. I have no idea how the business actually works. Tell me a little bit about you and what a Pest Control company is.\r\n\r\n\r\nCasey McDaniel (00:24.548)\r\nYeah, I mean, pest control is a pretty simple model. If you've ever had bugs or mice or any pests around your house, we're the guys you call. If you Google exterminator, Google pest control near me, that's what we're trying to do is get to the top of that list. So my first experience with pest control was when I was super young and the only time my parents said they've ever used it. My mom had just had my little sister, so I was probably five years old or so. And she put her in her crib and there was some\r\n\r\n\r\nbig old spider in the corner and she said, I'm not messing with this. And she called like Orkin or Terminix or something, one of the big brands. And that's the only experience I had with pest control until I was about 20. And then I kind of got into it through the door to door side. But yeah, I mean, it's just spraying for bugs, baiting and trapping for mice and the occasional skunk or raccoon that we do.\r\n\r\n\r\nNikolas Hulewsky (01:14.703)\r\nOkay, so say those again. What do you call them? Are they like vermins or?\r\n\r\n\r\nCasey McDaniel (01:20.172)\r\nYeah, so there's a bunch of different categories and different licenses for different stuff. So generally you have kind of your general category, which is just common pests, spiders, ants, cockroaches, stuff like that. And then we've got rodents, which fall under that license, just mice and rats. And then there's a wildlife license in most states for squirrels, raccoons, skunks, prairie dogs, burrowing pests, some of those.\r\n\r\n\r\nYou can also get a termite license for those. There's soil sterilization, a mosquito license, and there's a ton of different ones, but at the end of the day, we're just killing bugs.\r\n\r\n\r\nNikolas Hulewsky (01:56.953)\r\nDude, how did you get into it? Like working in the business?\r\n\r\n\r\nCasey McDaniel (02:02.594)\r\nYeah, so in 2019, I got home from my LDS mission, enrolled in college, and I was looking to just make as much money as I could as a poor college kid. And I was running track as well. So I was either going to have to get a full ride scholarship after my first year, or I was going to have to make a bunch of money because college ain't cheap. And I'm not that smart, so I didn't get academic scholarships.\r\n\r\n\r\nNikolas Hulewsky (02:22.351)\r\nI'm\r\n\r\n\r\nCasey McDaniel (02:22.868)\r\nSo I was looking at everything. I was maybe going to get my CDL and drive a truck in Idaho with my brother-in-law, do landscaping in Utah, go back home and work for my parents' business. And then my cousin hit me up and said, Hey, I do door-to-door pest control sales. I don't know if you've heard of it. But he said, I'm going out to Raleigh, North Carolina this year with a new company. Let's have an interview. You might be a great fit. And we chatted about it and it's just commission-based sales. And I gave it a shot, went out there and honestly, I didn't love it. Worked hard my first year.\r\n\r\n\r\nI sold about 150 accounts during COVID in 2020 and I made, you know, 25 grand or so. And I was like, that was awesome money in between semesters. But I was like, that was so hard. And I got told no like 8,000 times. So I wasn't going to go back. But they lured me in. Yeah. Yeah. And that was as a rookie. There's guys out there doing door to door sales, making seven figures in four or five months. Yeah.\r\n\r\n\r\nNikolas Hulewsky (03:09.359)\r\nYou would justify brand in three months?\r\n\r\n\r\nNikolas Hulewsky (03:20.281)\r\nSeven figures? No way. like a million dollars. They're making a million dollars.\r\n\r\n\r\nCasey McDaniel (03:24.948)\r\nYeah. Yeah. A million plus. Now part of that will be their personal commissions. And then part of that is the pyramid scheme recruiting guys under them. But no, the guys that clear seven figures, large percentage of that is personal commissions that the top guys are selling. 1.5 million in revenue and getting a 60, 70 % commission at minimum. Yeah.\r\n\r\n\r\nNikolas Hulewsky (03:50.707)\r\nWhat? Dude, this world fascinates me. So I'm LDS too, you're LDS. And it's like, when you come home from your mission, you're trying to make money. Like, I have a skillset. I can go knock on doors. wait, I can sell now too? I was doing that for God. Now I can go and do this for Terminix? Great. So you see just like a ton of LDS guys after their mission go knock on the door and they can make good money. So I'm like, I've had friends who've done it. I never did it because it, I mean, for whatever reason, I'm just like, I can't. The only person I can go and sell for is God.\r\n\r\n\r\nHowever, seven freaking figures in a summer sounds insane to me. to like, what does the world of door to door sales look like?\r\n\r\n\r\nCasey McDaniel (04:30.852)\r\nI mean, the daily schedule is generally you wake up, you kind of have some free time in the morning, hit the gym, eat breakfast. A lot of the sales bros are very, very self help and, you know, yeah, yeah, yeah. And Stoic and read your book and do your cold bath and go to the gym and eat your carnivore diet and all that stuff. So a lot of those guys are doing that morning routine. And then you usually have a morning meeting between 10 and noon where you get together, go over how the last day went, go over goals, blah, blah, blah.\r\n\r\n\r\nNikolas Hulewsky (04:42.127)\r\nAndy Elliott.\r\n\r\n\r\nCasey McDaniel (05:00.608)\r\nlittle bit of sales training and then boom on the doors usually by noon at the latest and you're knocking till dark or just after dark if people have their lights on and it's just knocking doors the whole time giving your pitch and just getting as much momentum as you can and selling, selling, selling and then you wake up and do it again.\r\n\r\n\r\nNikolas Hulewsky (05:16.687)\r\nThe ones that I've seen are pest control, obviously, windows, some roofing, alarm systems, solar. Those are the ones that I I missing any?\r\n\r\n\r\nCasey McDaniel (05:29.132)\r\nNo, the big three are pest control, solar, and alarms. And then roofing is kind of the little brother. And then after that is like DiBello doing their windows and also roofing and some of that.\r\n\r\n\r\nNikolas Hulewsky (05:42.039)\r\nIs it, which one's the most for a sales guy to go knock in order to order? Like which one's the most financially lucrative?\r\n\r\n\r\nCasey McDaniel (05:48.92)\r\nThey're all at the end of the day, pretty equal. It just depends on your personality. The solar and the roofing oftentimes are longer sales, very high ticket, build a relationship. You only get a few sales a week or a few sales a summer. Whereas the pest control is just grinding it out. Those top guys are getting 10 to 20 sales a day. And so it's very different, depends on your personality, how much you wanna put in and just who you are. But at the end of the day, the top reps are all making very similar numbers.\r\n\r\n\r\nand all the industries.\r\n\r\n\r\nNikolas Hulewsky (06:18.988)\r\nmarry it into a pyramid scheme.\r\n\r\n\r\nCasey McDaniel (06:21.028)\r\nWell, then these LDS guys that are dominating, they come home, they put it on Instagram and they say, look, I made 250K in my last summer. Come and work with me. And they bring out guys and they know all their mission buddies and they say, come and do it, come and do it. You'll do great. And then they'll get a commission off of each one of their sales.\r\n\r\n\r\nNikolas Hulewsky (06:40.332)\r\nso any guy that you recruit essentially, you get a cut of their commission.\r\n\r\n\r\nCasey McDaniel (06:45.156)\r\nYep, yep. So, and it doesn't affect his. So if I recruited you and you came out and knocked for me, you're not going to get a pay cut. They just add me, you know, a 5 % commission. Or if I have a huge team, if I've got 20 guys that I bring out, some of those guys will be making, you know, 18 to 25 % override on each one of their reps.\r\n\r\n\r\nNikolas Hulewsky (07:03.161)\r\nAnd then if you're a trainer as well, right? Like if you come out and you start actually training guys, don't you get a percentage of whatever they say.\r\n\r\n\r\nCasey McDaniel (07:09.346)\r\nYeah, usually, yeah, yeah. If you are a big guy and you've got your team under you, some of these companies that do just have kind of stray recruits that come in, they'll just put them on your team. And as long as you train them and help them along the summer, then yeah, they'll give you a percentage on those.\r\n\r\n\r\nNikolas Hulewsky (07:25.647)\r\nOkay, what is it about these industries that attracts people to go door to door? Is it, like, yeah, I just don't know.\r\n\r\n\r\nCasey McDaniel (07:33.573)\r\nI mean the solar the roofing those sorts of things they're high ticket So they can just bake that into the price give a guy a commission and do it for pest control It's the recurring revenue and so they can What's that?\r\n\r\n\r\nNikolas Hulewsky (07:43.32)\r\nWhat I mean is, not? Why aren't they going through Facebook? Why aren't they going on Google ads? Why aren't they going through mailers or whatever?\r\n\r\n\r\nCasey McDaniel (07:52.868)\r\nYou can't beat door to door. It's a high pressure sale. A lot of the sales that we get aren't people that are like, I was just going to call someone. They're like, well, we just moved in. We haven't seen anything, but that sounds like a good idea as a preventative measure. you know, I liked my last guy, but if you can beat the price, let's do it. Or I like him, but you sound like you're going to do a lot more. I'll spend a few extra bucks. Let's get the premium service. And so you're getting a lot of people that aren't on the fence to sign up.\r\n\r\n\r\nof people that aren't going to call in, whether you mailed it to them or did a Google ad, you're going out there and a high quality sales rep is going to switch over people from other companies as well.\r\n\r\n\r\nNikolas Hulewsky (08:30.895)\r\nYeah, because if I get a targeted Google ad or if I'm on Facebook and I see like, call Terminix. It's like, Okay, I'll call them later. Or I have every intention to call Terminix and then I forget about it. But if you're at the door, and you're like, Do you care about your kids? Because they're\r\n\r\n\r\nCasey McDaniel (08:45.668)\r\nYeah, a lot of it is just educating about what we do. Because like you said, what is pest control? We come in and it's not like we're going to tent the house like in Breaking Bad and fumigate and you have to get a hotel for three days. Eco-friendly, super safe. We're just going to knock down the wasp nests up high, knock down the cobwebs so it's staying pretty, spray around the foundation, you're good to go. And so people are happy to do\r\n\r\n\r\nNikolas Hulewsky (08:54.863)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (09:08.025)\r\nSo why are the commissions so good in this business model?\r\n\r\n\r\nCasey McDaniel (09:12.188)\r\nbecause of the, the, the recurring revenue, companies are willing to take a loss the first year knowing that they're going to have a lifetime value of three to seven years on those accounts. And so, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (09:22.103)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (09:26.029)\r\nWe're like, seriously, the lifetime when we can just talk pest control, right? But pest control lifetime value there with you for three to seven years.\r\n\r\n\r\nCasey McDaniel (09:33.86)\r\nYeah. so I'm not a, I don't know what the proper way to determine what the true lifetime value is. We started three years ago. Over 50 % of our customers are still with us from that first year of knocking doors. So they, yeah. And we hear a lot of them, people will live in a house for seven years before they move. So that sounds like what they do. The company we just acquired, they've had customers that have been with them for the, from the beginning 17 years now.\r\n\r\n\r\nNikolas Hulewsky (10:01.827)\r\nYeah, the way that I typically do it is if you have a lot of data, can say, this is our average lifetime length. I don't even know what the right term is. How long an average customer stays with us, right? I have 20 years worth of data because the business has been around for 20 years. This is how long an average customer stays with us. But as I'm getting started, usually what I do is I'll look at first the monthly churn and I'll say, we churn 5 % of our customers every single month.\r\n\r\n\r\nThat means it's going to take 20 months before I've turned over all of my customers. Does that make sense what I'm saying? Right? So it's like, okay, that's the average duration that a customer stays with me, 20 months. And then obviously the longer you're in business, a couple of years, it's like, okay, every year, what's our churn? Then you can go that way. So then I back into what I think the lifetime value would be. So if you're at 50 % and you said you're three years in, yeah. So yeah, I mean, you're...\r\n\r\n\r\nYou are probably you're on pace for like six and a half seven years average.\r\n\r\n\r\nCasey McDaniel (11:04.996)\r\nYeah, that's what we figured kind of baked in. mean, last year company-wide, had an 8 % cancel rate. So yeah, they're pretty sticky customers.\r\n\r\n\r\nNikolas Hulewsky (11:15.671)\r\nInteresting. So it's almost like software as a service, SaaS, right? Where you build the product once, it's software, and then it's really high margin, but it's recurring. People are charging every single month. In this space with pest control, it's recurring revenue in the sense that they're going to come out once a year, or is it a monthly maintenance? What does the actual offering look like?\r\n\r\n\r\nCasey McDaniel (11:38.082)\r\nYeah, different markets, different parts of the country will have different down south. is a lot of monthly services in Colorado. We just do quarterly. And so we come out once every three months, we break it down to a monthly bill. So it is truly just a monthly subscription that they're on. We come out unlimited times in between for free if anything flares up. So as long as we're doing a good job, we just come out four times a year. And then\r\n\r\n\r\nNikolas Hulewsky (11:58.703)\r\nHow much does that typically cost for like a once a year treatment or I guess the monthly fee? What does that cost?\r\n\r\n\r\nCasey McDaniel (12:04.004)\r\nYeah, our average right now and after taking over a company with kind of lower price point and blending it in, it's about 45 bucks a month, 135 a quarter.\r\n\r\n\r\nNikolas Hulewsky (12:14.063)\r\n135 quarter and what do they get for that 135?\r\n\r\n\r\nCasey McDaniel (12:16.824)\r\nWe treat the full foundation usually about three feet up, three feet out all the way around, knock down cobwebs and wasps mess up to 30 feet high, treat the interior if needed and as needed, and then place down a couple bait stations and that'll take care of the mice.\r\n\r\n\r\nNikolas Hulewsky (12:31.599)\r\nOkay, so when you say treat, is that like spraying a chemical or something?\r\n\r\n\r\nCasey McDaniel (12:36.14)\r\nYeah, we spray, spray all that.\r\n\r\n\r\nNikolas Hulewsky (12:38.191)\r\nOkay, so you got a guy out there, sprays, wipes cobwebs, maybe does something inside, but the, I mean, what is that? 20 minutes?\r\n\r\n\r\nCasey McDaniel (12:47.94)\r\nYeah. Yeah. Yeah. And that's another reason why door to door is so big and so valuable for us because route density is huge. The company we bought, old school marketing, their customers are spread out all over. We have a lot of drive time and a lot of unbilled hours. In Grand Junction where we do door to door, yeah, our guys can just be on the same street. Sometimes they put less than nine miles on the van in a whole day of working.\r\n\r\n\r\nNikolas Hulewsky (12:49.649)\r\nIs it really?\r\n\r\n\r\nNikolas Hulewsky (12:58.639)\r\nMmm.\r\n\r\n\r\nCasey McDaniel (13:17.272)\r\nwe can knock out 20, 25 jobs in a day at 135 bucks a piece and minimal chemical costs. It's really high margin.\r\n\r\n\r\nNikolas Hulewsky (13:26.264)\r\nmy goodness, how much do pay your guys? Like what's an average rate for, what do you call them? Are they a tech?\r\n\r\n\r\nCasey McDaniel (13:30.724)\r\nYeah, technician. Yeah, our guys are, depending on how long they've been with us, 20, 25 bucks an hour.\r\n\r\n\r\nNikolas Hulewsky (13:37.487)\r\nAll right, so let's say 20 bucks an hour. takes them 20 minutes to spray. That's going to be a third. So you're looking at like 633 or somewhere in that ballpark of labor spend for $135.\r\n\r\n\r\nCasey McDaniel (13:50.892)\r\nYeah, and then the chemicals are about three, four bucks.\r\n\r\n\r\nNikolas Hulewsky (13:53.903)\r\nSo your gross margins are like 120 bucks on the 135.\r\n\r\n\r\nCasey McDaniel (13:59.266)\r\nYes, sir.\r\n\r\n\r\nNikolas Hulewsky (14:00.746)\r\nmy gosh. Is that is that why you pay so well to acquire customers because they are so profitable once they're on\r\n\r\n\r\nCasey McDaniel (14:08.484)\r\nYeah, the big marketing companies, so having talked about having a door-to-door team, there's whole companies that do that. And they just run ads, recruit guys, and they just pimp their team out to whoever company is going to pay the most. so, what's that? Yep, they're just a sales company. They just say, hey, I've got 20 guys that'll come out and put on 3 million in revenue for you, and we're going to charge 130 % of revenue. And they'll get that. They'll get 130 % of the first year contract.\r\n\r\n\r\nNikolas Hulewsky (14:12.239)\r\nThank\r\n\r\n\r\nNikolas Hulewsky (14:20.611)\r\ntheir sales company. Their sales company, essentially.\r\n\r\n\r\nCasey McDaniel (14:37.364)\r\nmarket rate for a team like that is anywhere between 85 and 130 percent and big companies, I can't afford that. Big companies, they'll pay that.\r\n\r\n\r\nNikolas Hulewsky (14:48.333)\r\nWhy? Just because they know it's proven?\r\n\r\n\r\nCasey McDaniel (14:50.722)\r\nYeah, I mean, it's pretty much buying a $3 million company at 1.3 times revenue. And if it's going to be high margin, years two through seven, you'll make your money.\r\n\r\n\r\nNikolas Hulewsky (15:01.247)\r\nWow. Why don't more people do it then? Is there just a lot of executional risk?\r\n\r\n\r\nCasey McDaniel (15:06.948)\r\nYeah, if you don't have a good service, you're gonna have a really high churn rate. If the sales reps are unethical, then you run into those issues getting a bad brand. If you grow too fast, then you've got $2 million that you have to pay out to these sales reps and then all the vehicles you bought, new techs, and you just ramped up too fast, then you got too much debt and you implode. So there's a lot of risk in growing that fast and pulling it off.\r\n\r\n\r\nBut yeah, the bigger, more stable companies, active Moxie, Hawks, Fox, a lot of these that are in the tens or hundreds of million dollar range. Yeah. They'll do that at a bunch of locations and just take over.\r\n\r\n\r\nNikolas Hulewsky (15:43.481)\r\nWow, when did you know that you wanted to actually do this as a business as opposed to just sell?\r\n\r\n\r\nCasey McDaniel (15:48.676)\r\nDuring our second year, were promised a bunch of stuff the second year. The technicians would be better, service would be better, everything would be dialed in. We came out and right away we started knocking doors and we realized that that was all live. Everything was exactly like it was the year before. So my business partner, who's my cousin, who recruited me.\r\n\r\n\r\nNikolas Hulewsky (16:05.389)\r\nHold on. So were you working with one of these sales companies or were you working for an actual pest control company?\r\n\r\n\r\nCasey McDaniel (16:11.81)\r\nWe were working for the pest control company just as the sales side. So, so yeah, it was, it was just not a good company. And so we sat down at the beginning of that summer and we said, let's start our own. Let's do this. Let's we know the sales, let's spray as many jobs as they'll let us. Let's try to get into that. Let's learn the operations, learn the technology and copy everything they're doing and then do it the right way. And so we spent the whole summer just kind of stealing the playbook and then year three in pest control is when we launched our own.\r\n\r\n\r\nNikolas Hulewsky (16:15.631)\r\nSure, yeah.\r\n\r\n\r\nNikolas Hulewsky (16:41.188)\r\nIs it hard to understand how to do the operations?\r\n\r\n\r\nCasey McDaniel (16:44.458)\r\nNo, it's a really simple industry.\r\n\r\n\r\nCasey McDaniel (16:49.602)\r\nHey dude, here's the address. Go spray their foundation. Introduce yourself first. We've got a card on file.\r\n\r\n\r\nNikolas Hulewsky (16:54.319)\r\nDo you to be a certified technician in order to do treatments?\r\n\r\n\r\nCasey McDaniel (17:01.177)\r\nyou\r\n\r\n\r\nCasey McDaniel (17:08.152)\r\nSo that's the biggest barrier to entry. And another reason that I love it, not everyone with a vacuum can start, know, anyone can start a cleaning company. Pest control, you've got two licenses in most states, a lower license and a higher license. The lower license you can test for tomorrow, and that allows you to go and spray for another company. The higher license, you need three years of experience. And once you have that higher master license, that's when you can start your own company.\r\n\r\n\r\nSo to circumvent that, what we did, I had a family friend who had his higher license and we just rented from him. So we're three years in now and I just barely qualified for my master license like last week. So we can get him off of our books now, but this whole time we've just been under his.\r\n\r\n\r\nNikolas Hulewsky (17:47.587)\r\nIs that a state by state requirement or is that nationally? You need three years for a master license to start a business.\r\n\r\n\r\nCasey McDaniel (17:53.024)\r\nEvery state's a little different, but it's usually two to three years somewhere in there.\r\n\r\n\r\nNikolas Hulewsky (17:57.187)\r\nWhat did you pay him?\r\n\r\n\r\nif you can't say it, I'll get that cleared.\r\n\r\n\r\nCasey McDaniel (18:01.363)\r\nSo, family friend, he hooked us up big time. The first year, he said, I don't know, 50 bucks a month. And I was like, dude, this is so far under market value. Like, this is crazy. And I took a minute to respond. And he texted me back and said, I talked to my wife. I'll just do it for free. And we're like, no, dude, I'll give you 600 bucks. I'll write a check tomorrow. A lot of places are charging 1000 to 1500 a month.\r\n\r\n\r\nNikolas Hulewsky (18:21.56)\r\nDeath man.\r\n\r\n\r\nCasey McDaniel (18:27.076)\r\nI've seen some guys trying to their license for as high as four grand a month out in California.\r\n\r\n\r\nNikolas Hulewsky (18:32.065)\r\nWow. What do you need? So in order to qualify for that higher license, you just need three years of experience or is it very like what kind of experience are we talking about?\r\n\r\n\r\nCasey McDaniel (18:40.548)\r\nYeah, no, if you test for that lower license and then you work for a company for three years, then you just have to take a second test and get the higher license. And that's, that's it. You got to 70 % pass fail.\r\n\r\n\r\nNikolas Hulewsky (18:52.047)\r\nDude, that's insane. It's almost like you could start a business for this guy renting out his license.\r\n\r\n\r\nCasey McDaniel (18:56.772)\r\nAnd that's where it gets tricky. There are stipulations on how many people you can rent to and how many operators you can have under that license. And so that's where they kind of cap it. So you can't just have a huge organization of just renting your license out, but you can rent it out generally to about three companies. And if you're charging a few grand per month per license, that's not a bad retirement plan at all.\r\n\r\n\r\nNikolas Hulewsky (18:59.833)\r\nI-\r\n\r\n\r\nNikolas Hulewsky (19:19.983)\r\nSo my experience is in healthcare skilled nursing facilities, you have to be a licensed administrator in order to operate them. And many times what will happen is they'll put a new administrator in there who's not licensed yet. And then they'll take the license of an experienced administrator and put it on the wall that he's operating under. But there is, I mean, there's a risk to that, right? Like the licensed administrator does have a risk associated with it. Is it the same in pest control? did he take on doing that?\r\n\r\n\r\nCasey McDaniel (19:42.146)\r\nYeah, if we get sued for killing a kid or killing a dog or something, then his license would be at risk because he is supposed to be supervising and implementing procedures and stuff. So there is some risk in that for him. That's why most people do charge several grand a month.\r\n\r\n\r\nNikolas Hulewsky (19:59.705)\r\nSo if you have one license now that you can put your, I guess, business under, and you said there's like a limit of two or three businesses that you can do that, let's say that you wanted to service the state of Colorado, which is where you live, right? And you wanna work in Fort Collins and you wanna work in Denver and you wanna work in Aspen and you wanna work in Colorado Springs and those are four places right there. How do you service all of those places if you only have one master license?\r\n\r\n\r\nCasey McDaniel (20:28.504)\r\nYeah, as long as we've got the one master license, then if all of my technicians pass their easy little test and they're personally certified to spray, then they can go and do that. So we do have a location in Colorado Springs with two technicians over there. They're both licensed, so they can do the day to day and spray. They just couldn't start their own business. So yeah, you just need the one master license to qualify and then everyone else needs their little licenses under and they can be anywhere in the state and still just operate under you.\r\n\r\n\r\nNikolas Hulewsky (20:55.86)\r\nWhat if you wanted to go to, I don't know, Montana, Wyoming?\r\n\r\n\r\nCasey McDaniel (20:59.364)\r\nYeah, then I've got two options. Some states you can reciprocate your license. So I'm looking into that now that I just got mine. And if they don't reciprocate it, then you got to start over and either rent from someone or, you know, get a job and get your three years of experience.\r\n\r\n\r\nNikolas Hulewsky (21:15.151)\r\nokay. Interesting. Dude, that part's fascinating. I knew nothing about this world. So businesses like these sticky customers, recurring revenue, high margin, what would you say is the average net margin for a company that operates? I mean, your gross margin is insane, but like net income on a percentage basis.\r\n\r\n\r\nCasey McDaniel (21:38.276)\r\nYeah, factors like any company. Our first year when we did all the work, when we sprayed and did the door-to-door and everything, we netted 74 % that year. Ridiculous. We worked a lot and we were truly owner-operators, but it was good. Now that we're built out more, we've got office people in two locations and more overhead. Last year, we were at 28 % margin and we grew 100%. We doubled our revenue.\r\n\r\n\r\nSo we're looking, if we ever just kind of stabilize, we're targeting hopefully around 40, 45%. But a lot of companies kind of in the growth phase, I see a lot of guys target 30 % growth and 30 % margins.\r\n\r\n\r\nNikolas Hulewsky (22:20.847)\r\nOkay, so you started this year in year three of this. What was your revenue as year one, two and three?\r\n\r\n\r\nCasey McDaniel (22:25.796)\r\nYeah, year one, we did 180k revenue in our first nine months. We started in March. Year two, we did 475. And then this year, we were just over a million.\r\n\r\n\r\nNikolas Hulewsky (22:40.909)\r\nMan, that's amazing. What's your current monthly revenue?\r\n\r\n\r\nCasey McDaniel (22:44.356)\r\nCurrent monthly revenue is about 105, 110K through the winter right now. Cause we just closed on the acquisition kind of fall. So it's worse time to buy a pest control company, but we're hoping with a little door to door team and we're hoping to double again this year due to 2 million this year. Yeah.\r\n\r\n\r\nNikolas Hulewsky (23:00.111)\r\nTwo million. Okay, and so your net income, said this last year, at 28%. So net income right around $300,000. Wow. What is the average, you said earlier, customer acquisition costs for these big companies to come out is essentially 130 % of first year's revenue. Is that normal for the rest of the customer acquisition costs that you're currently doing or not?\r\n\r\n\r\nCasey McDaniel (23:27.656)\r\nNo. So we, when we target Google ads and social media, that sort of stuff, we're looking to keep it to about 35%. So we're still cashflow positive that first year. We're willing to spend more, but it's upfront is the other issue. If you're spending it on Google ads, you spend $150 and then you get your customer and they pay you throughout the year. With the door to door team, you pay as you go. And so they get the sale and you don't pay the full 130 % commission.\r\n\r\n\r\nyou give them a little bit upfront, then either pay throughout the whole year, or you give them a backend in like October and then February. So it's a lot more spread out. So that's another reason why door-to-door is alluring, because you can spread out that customer acquisition cost over a whole year. So door-to-door, for typical customer acquisition, we do try to keep it lower just because it is upfront, because you can blow a budget real quick.\r\n\r\n\r\nNikolas Hulewsky (24:20.569)\r\nOn what?\r\n\r\n\r\nCasey McDaniel (24:21.54)\r\nramping up Google ads that aren't working or putting it into Facebook and spending several grand on a Facebook ad and your phone rings twice from it. And so our bread and butter is the door to door. keep a pretty low marketing budget and then we just pay door to door reps really well just because that's what works best for us.\r\n\r\n\r\nNikolas Hulewsky (24:40.451)\r\nYeah, man. It's crazy about this business. Really high margins. It doesn't seem exceptionally hard to get into. Obviously, there's a time period that you need to have the master license. If you have the cash, you can pay to acquire customers. How did you get into the business in the first place? Did you start from scratch or did you buy a business?\r\n\r\n\r\nCasey McDaniel (25:01.474)\r\nYeah, we started from scratch. I bought my first house, my wife and I got married, we bought a house, we didn't have hardly any money left over that after that. And so I put five grand in, my cousin put in five grand, we ordered about $8,000 worth of chemicals and put them in my garage and we started knocking doors. So we've turned four grand a piece into about 1.3 million in recurring revenue as of today.\r\n\r\n\r\nNikolas Hulewsky (25:26.319)\r\nIf you were doing it again, would you buy or would you build the same way that you did?\r\n\r\n\r\nCasey McDaniel (25:30.584)\r\nMmm.\r\n\r\n\r\nCasey McDaniel (25:34.646)\r\nIf I had the, if I had the money to start again, I would buy a bigger high quality company. There's a lot of small low quality companies that do not operate like us and are not as high margin or as recurring or as good. And that is one of the ones that we bought. We got it at a really good price, but very different model, very cheap and not producing the same way. So.\r\n\r\n\r\nAnd for that reason, I might say build again. And if I had the same amount of cash, honestly, I'd probably build because you get door to door, you have route density, it's all your systems to implement and customers are yours from the beginning and they're happy. Customers don't like change. And so I would probably build.\r\n\r\n\r\nNikolas Hulewsky (26:14.735)\r\nSo going into these new markets in Colorado, are you building from scratch or are buying?\r\n\r\n\r\nCasey McDaniel (26:19.652)\r\nWe only went into one new one in Springs and we did buy there. But right at the same time that we bought, we did have one door-to-door rep out there that put on a couple hundred accounts for us. So it was a little bit of a mix, but we just bought there mostly.\r\n\r\n\r\nNikolas Hulewsky (26:37.775)\r\nAnd do you live in Colorado?\r\n\r\n\r\nCasey McDaniel (26:40.852)\r\nNo, I'm currently in Salt Lake City.\r\n\r\n\r\nNikolas Hulewsky (26:43.407)\r\nHow the frick does that work? So your business is in Colorado. You've done, I mean, you you've gone from what was it? 100K to 400K to a million dollars over three years and you don't even live there.\r\n\r\n\r\nCasey McDaniel (26:54.69)\r\nYeah, really lucky, really blessed, but it's a pretty simple industry. It keeps chugging along. My business partner still lives at one of our locations so he can put out small day-to-day fires. And then about once a month or once every other month, I'll travel back to Colorado and just check on the branches, meet with employees, make sure things are under control. But yeah, then a lot of it is just maintaining what I can over the computer from my office out here.\r\n\r\n\r\nNikolas Hulewsky (27:20.751)\r\nHow do you manage the text?\r\n\r\n\r\nCasey McDaniel (27:23.172)\r\nThey pretty much just self govern. Through the office, we handle all their scheduling. All they have to do is wake up in the morning, log into their app, see where they're going and just go and spray, take pictures while they're there, upload it, do the documentation. like our two in Colorado Springs are just totally by themselves and they're just self starters. They know to be at their first appointment at nine, work through the day, go home, let us know when we're running low on inventory and we ship it directly to the office.\r\n\r\n\r\nNikolas Hulewsky (27:51.663)\r\nHow did you find them?\r\n\r\n\r\nCasey McDaniel (27:53.452)\r\nIndeed. Yeah, that's how we found all of our techs.\r\n\r\n\r\nNikolas Hulewsky (27:54.841)\r\nReally?\r\n\r\n\r\nHave you ever met the guys in Colorado Springs?\r\n\r\n\r\nCasey McDaniel (28:00.256)\r\nI have met one of them, one of them I haven't.\r\n\r\n\r\nNikolas Hulewsky (28:03.15)\r\nThis is crazy, okay, this is crazy to me. You're managing a workforce remotely that requires them to be sometimes in people's homes.\r\n\r\n\r\nCasey McDaniel (28:14.461)\r\nWe run background checks, everything's good, they're good people.\r\n\r\n\r\nNikolas Hulewsky (28:16.035)\r\nNo, I'm not worried about that. I'm just saying, like, any employees that you have, it's hard to manage. anytime you get people out of latitude, it's like, maybe they're taking a little bit less time to do their work. Or maybe they're, I don't know, stealing supplies. Anyways, how do you manage that? That's the hard part that I'm trying to like, my head around.\r\n\r\n\r\nCasey McDaniel (28:37.656)\r\nWe've got really good SOPs. So a couple of things that they have to do at every appointment, knock on the door, introduce yourself to the customer. If the customer is home, whether they are or not, they have to take at least four pictures arrival showing the house with the address very clear. So we know that they're at the right house. They have to take a picture of them knocking down cobwebs, one spraying the foundation and then one other part of the service. So they have to at least four. we also have GPS on all their vehicles. So if I need to, can, I can check and see, Hey, you know, why were you in the back?\r\n\r\n\r\nHome Depot parking lot for 45 minutes this morning. It sounds shady or you know what's going on.\r\n\r\n\r\nNikolas Hulewsky (29:14.319)\r\nThey have company vehicles too.\r\n\r\n\r\nCasey McDaniel (29:17.221)\r\nyeah, yeah, no, yeah, we're legit. It's a real company.\r\n\r\n\r\nNikolas Hulewsky (29:19.343)\r\nI'm not sick, I'm not...\r\n\r\n\r\nNo, no, no, I'm not saying you're not legit. I'm just like.\r\n\r\n\r\nCasey McDaniel (29:26.548)\r\nThey've got stickers on them too, not just magnets. They're wrapped, man.\r\n\r\n\r\nNikolas Hulewsky (29:31.063)\r\nWow. Okay, so they've, how often are you checking the GPS? How often are you looking at their notes and their pictures? And are you doing a lot of QA?\r\n\r\n\r\nCasey McDaniel (29:40.516)\r\nyeah, I, once a week I'll go through, our software is great. I can just run an audit and it'll just show all of the technicians, how many services they did and how many they had one picture, two picture, three, four. So it just shows me real clearly. so that I can, I can double check on that. I don't check their GPS unless they're way behind on schedule. They're doing something weird. We're not overly\r\n\r\n\r\ncrazy with them. But we just have those safeguards in place and they know that they're there. And that's a big part of it is saying, Hey, I have a GPS. I know when you leave your house, I know where you're at. And so that kind of helps keep them in the lane.\r\n\r\n\r\nNikolas Hulewsky (30:14.895)\r\nWho's the enforcer? You or your partner? Really?\r\n\r\n\r\nCasey McDaniel (30:17.622)\r\nMe, I'm the bad cop. Yeah, he's a good cop. I'm the one that does all the firing. I do a lot more of the praising too. He's kind of the middle ground. So I'm the one that usually meets with them and says, hey, you're getting a raise. Hey, you're getting a bonus. And so they like me for that reason. I'm also the one that says, hey, you're on the line. Here's some things we need to improve on or else you're going to get another call from me and we're going to find a replacement.\r\n\r\n\r\nNikolas Hulewsky (30:41.615)\r\nSo a million dollars a year in revenue, how many techs is that? So five techs, and then do you have any other employees?\r\n\r\n\r\nCasey McDaniel (30:45.153)\r\nWe've got five.\r\n\r\n\r\nCasey McDaniel (30:48.999)\r\nOne office person.\r\n\r\n\r\nNikolas Hulewsky (30:51.503)\r\nWhat do they do?\r\n\r\n\r\nCasey McDaniel (30:54.06)\r\nThe office person takes phone calls, does sales, scheduling full customer service rep. If you call the number on Google, it goes to her and she can handle any problem.\r\n\r\n\r\nNikolas Hulewsky (31:05.881)\r\nSo it's got you and your partner, five techs, and then an office person, and that's it.\r\n\r\n\r\nWeekly, how do you manage operations? Are you pulling those reports and then meeting with each one of your techs or do you only talk to them when you see something that's out of the norm?\r\n\r\n\r\nCasey McDaniel (31:19.908)\r\nyeah, I generally just talk to them, for one of those two reasons, either to praise them or to get on them. but yeah, as long as everything looks good, I just let them do their thing and let them know, Hey, you guys have a lot of freedom. If you keep coming up short, then, then we're going to have to go more corporate. And then we do have weekly check-ins and stuff.\r\n\r\n\r\nNikolas Hulewsky (31:39.375)\r\nDo you pay them per visit or do you pay them hourly? Oh, they're on salary.\r\n\r\n\r\nCasey McDaniel (31:41.838)\r\nThey're on salary. Yep, we let them know, hey, in the summer, you just got to get your jobs done when it's hot. In the winter, you're probably going to get off early a little bit, but we get the best of the best because we guarantee year-round work and year-round pay. So we don't have people, you know, we get the best employees.\r\n\r\n\r\nNikolas Hulewsky (32:02.495)\r\nAnd you've got productivity metrics I'm sure that you're looking at. You're like, they got to be seeing eight houses a day or like what's that number?\r\n\r\n\r\nCasey McDaniel (32:10.274)\r\nYeah, that one I'm not too picky on because that's on us. That's my job to keep you busy, I tell them.\r\n\r\n\r\nNikolas Hulewsky (32:17.647)\r\nIt may be on you, but if you hire five techs and then you're like, crap, this tech's only doing two a day, you've got to make a decision. You're like, my fault, I over hired, I got to let you go. How do you assess whether or not you're adequately staffed, overstaffed, understaffed?\r\n\r\n\r\nCasey McDaniel (32:34.692)\r\nYeah. So I've got this really rickety Excel spreadsheet from 2022 that has three inputs and it's what we call the magic computer. And I don't know what, why it's accurate, but it's just good enough. And so I do a lot of my, my 13 week forecast and the year forecast and we, have a pretty good grip. And that's the reason why I like the industry so much is because it is so heavily recurring that I can say, okay.\r\n\r\n\r\nNikolas Hulewsky (32:39.537)\r\nOkay.\r\n\r\n\r\nCasey McDaniel (33:02.53)\r\nWe've got about 15 jobs a day per tech. We're good. We don't need to hire. We're rolling. And we haven't over hired yet because we're pretty good on it. And then if me or my business partner do get a little bit too busy, me and him can step in and I can cover the office if we're getting a lot of calls or he can step in and spray if we need to. So we've got a little bit of flexibility just because we're still willing to be hands on.\r\n\r\n\r\nNikolas Hulewsky (33:23.919)\r\nOkay, I don't know is a perfectly fine answer, but I really want to know what would you expect a tech to do? How many houses per day should a tech be doing if they're adequately staffed?\r\n\r\n\r\nCasey McDaniel (33:36.868)\r\nYeah, in our primary location where we have heavy door-to-door and good route density, they're knocking out 20 jobs a day. In our other location, a little bit less dense, we have a cap at 15 a day.\r\n\r\n\r\nNikolas Hulewsky (33:49.869)\r\nMan, this is an interesting business. my gosh. Okay, my last question on the business. I didn't realize you have a bunch of company vehicles. So you have five company vehicles?\r\n\r\n\r\nCasey McDaniel (34:01.572)\r\nUm, we have, um, am I a dirty liar? So we actually have one, two, three, four, five, six, seven, eight. Um, because we were planning on a little extra growth and then we, we do keep one backup vehicle at each location, just in case it gets in a wreck or there's, know, you gotta have a backup. So we have one backup at each place and then we have two backups at the other location just cause we didn't over hire, but we did over purchase vehicles.\r\n\r\n\r\nNikolas Hulewsky (34:18.681)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (34:25.401)\r\ndo you manage the vehicle? is that a big capital expenditure? Are you leasing them?\r\n\r\n\r\nCasey McDaniel (34:30.564)\r\nYeah, we finance them. So we put down a decent down payment and then we just finance for as long as term as the bank will let us do\r\n\r\n\r\nNikolas Hulewsky (34:38.361)\r\nThat's insane. All right. And hey, how old are you? Okay, 25. First of all, congratulations. Building a million dollar business is a big deal. Not a lot of people get to the million dollars in revenue. So that part's crazy. Second, you're 25. That's super young. So I'm excited to see where you are in five years from now.\r\n\r\n\r\nCasey McDaniel (34:41.316)\r\nI'm 25.\r\n\r\n\r\nNikolas Hulewsky (35:00.557)\r\nWhen did you start paying yourself a reasonable salary?\r\n\r\n\r\nCasey McDaniel (35:04.708)\r\nDo you find reasonable?\r\n\r\n\r\nNikolas Hulewsky (35:06.415)\r\nI guess you tell me what reasonable is. I don't know.\r\n\r\n\r\nCasey McDaniel (35:10.498)\r\nYeah, I can kind of go over our pay. So we're an S corp and we split 50-50 equity. so when we started off the first, it was only about three or four months that we took zero pay because we knew how much we wanted to save one month's worth of expenses. And that first year it was about 10 grand a month were our expenses. And we had one employee that kind of started with us. So once we had 10 K in the bank, then we looked at our cashflow and we started taking a salary of three grand a month each.\r\n\r\n\r\nNikolas Hulewsky (35:40.1)\r\nMm-hmm.\r\n\r\n\r\nCasey McDaniel (35:40.292)\r\nSo that's what we did and then each quarter we take a distribution Whatever is in the bank account down to one month's expenses So that first year if we had 25 K and our 10 K was the bottom we had 15 in there. We'd split that So that's just what we do our salary. We bump it up a little bit every year this year We're paying ourselves like 50 K a year and then if there's money left over every quarter we take it if there's not when we've skipped we usually skip every spring quarter and\r\n\r\n\r\nNikolas Hulewsky (36:01.284)\r\nWow.\r\n\r\n\r\nCasey McDaniel (36:10.614)\r\nJust we get about three, three quarterly payments a year.\r\n\r\n\r\nNikolas Hulewsky (36:14.208)\r\nOkay, 50 grand a year. And then you're taking some distributions. What do the distributions look like? Another 50 grand more?\r\n\r\n\r\nCasey McDaniel (36:20.74)\r\nYeah, great question. Anywhere last September was $1,500 a piece. The September before that was $33,000. So it's truly just whatever it is. So we both have some money saved away in case we grow too fast. But we're trying to keep to where we're making, you know, at least six figures a year, 100, 150 a K a year while we're growing. And then hopefully that'll kind of keep going up as we take the foot off the gas a little.\r\n\r\n\r\nNikolas Hulewsky (36:48.141)\r\nOkay, how long did it take you to break six figures personally? Okay.\r\n\r\n\r\nCasey McDaniel (36:51.588)\r\nWe did it in year two. Year one we were real close. mean, in nine months we did 180k in revenue, 75 % margins. We took home a good chunk. But then year two, we were over six figures. And then this year we were actually just under, but we were fine with it.\r\n\r\n\r\nNikolas Hulewsky (37:07.023)\r\nThat's amazing, man. What it sounds like too, the more cash you can throw at growth, the more you're going to grow. So there's got to be a balance between taking distributions, leaving money in the business to grow the way that you want it to be. What's your goal with the business? Where do you want to get to?\r\n\r\n\r\nCasey McDaniel (37:22.082)\r\nYeah, we want to get to where each of these two locations have at least five technicians doing, you know, hopefully close to two million at each location. If we can kind of expand throughout Colorado, honestly, if our company gets to be doing five to seven million in revenue, that's where we'll be happy. Take the foot off the gas and have a good, hopefully lifestyle business, good cashflow, minimal time input. And I'll be hopefully 30 or early thirties and\r\n\r\n\r\nNikolas Hulewsky (37:50.925)\r\nbe old. Yeah.\r\n\r\n\r\nCasey McDaniel (37:52.15)\r\nYeah, I'll be way past my prime for sure. But that's kind of the goal. Five to seven million. I don't want a billion dollar company. I mean, I could grind for 40 years and I could grow this pretty big, I think. But I don't want to. I'm having my first kid. Family's important to me. I want to spend time with family and do those things and enjoy life. At the end of the day, I don't want to push it too far.\r\n\r\n\r\nNikolas Hulewsky (38:16.431)\r\nit. All right, man. This was fantastic. Appreciate you coming on. Stay on. I'm going to stop recording.\r\n\r\n\r\nCasey McDaniel (38:19.842)\r\nYeah, man. Have a blast. Thanks.",
  "metadata": {
    "duration": "",
    "date": "2025-01-29",
    "platform_source": "Google Drive"
  }
}