{
  "episode_number": "162",
  "episode_title": "AI SERIES: 10 - Understanding the Nuances of Advanced Language Models with Richard Marmorstein",
  "guest_name": "Richard Marmorstein",
  "business_name": "Hume AI",
  "transcript": "﻿Nikolas Hulewsky (00:00.441)\r\nOK, Richard in Las Vegas, I'm feeling lucky. Why don't you show me what you're working on,\r\n\r\n\r\nRichard Marmorstein (00:06.892)\r\nAll right, well, I will start with something fun that I've done in my personal life. I have a two-year-old, I took him to soccer practice, two-year-old soccer practice the other day and he didn't want to participate. He's really into Clifford, like he watches the Clifford TV show and reads the book. So I, Jem and I, they came out with this great image generation model. So I figured I would generate my own book about Clifford going to soccer practice and seeing if I could motivate him to.\r\n\r\n\r\nNikolas Hulewsky (00:25.709)\r\nYeah, of course.\r\n\r\n\r\nRichard Marmorstein (00:35.8)\r\nparticipate in the exercises. So I guess I'll share my screen. Yeah.\r\n\r\n\r\nNikolas Hulewsky (00:39.801)\r\nThat's dude that that is awesome. So he's. Does he? Hold on before this I want to make sure do you have permissions to share your screen? OK, no worries, so you're just going to have to hop out and hop back in once you give her permissions.\r\n\r\n\r\nRichard Marmorstein (00:48.17)\r\nOK. yeah. Let's, I.\r\n\r\n\r\nRichard Marmorstein (00:56.588)\r\nYeah, what did I...\r\n\r\n\r\nRichard Marmorstein (00:05.024)\r\npermissions and I'm doing this in my browser. Yep. So I will go to, I guess, Google's AI studio. Let's, how do I? Ideally, I will picture in picture. No, that didn't work. Here we go.\r\n\r\n\r\nNikolas Hulewsky (00:07.306)\r\nPerfect.\r\n\r\n\r\nNikolas Hulewsky (00:16.224)\r\nYou could just minimize the Riverside screen.\r\n\r\n\r\nNikolas Hulewsky (00:24.841)\r\nThe joys of technology is I can edit all this out.\r\n\r\n\r\nRichard Marmorstein (00:26.64)\r\nYeah, think I need to disable my tiling window manager perhaps. No. yeah, let's disable this. Now you go away. There we go. Okay, Google AI Studio. I'll go here and I can say, you know, just simple prompt, generate me a story about a red dog named, let's not name it Clifford because that would be copyrighted.\r\n\r\n\r\nNikolas Hulewsky (00:37.034)\r\nPerfect.\r\n\r\n\r\nNikolas Hulewsky (00:40.672)\r\nThanks.\r\n\r\n\r\nNikolas Hulewsky (00:54.72)\r\ncopyright, Gifford.\r\n\r\n\r\nRichard Marmorstein (00:56.572)\r\nIfford yeah Goes to soccer practice initially doesn't want to participate But discovers he really likes it and you got a Yep AI studio Don't go to Gemini. It's not there. It's in the AI studio and you use their image generation experimental model and just say like generate about\r\n\r\n\r\nNikolas Hulewsky (01:12.736)\r\nOkay, so this is Google's AI studio.\r\n\r\n\r\nNikolas Hulewsky (01:19.978)\r\nOkay.\r\n\r\n\r\nRichard Marmorstein (01:26.582)\r\none sentence per frame and an image. Story should be about, I don't know, eight pages long. And then you run it. it obviously won't be production quality, but there we go.\r\n\r\n\r\nNikolas Hulewsky (01:46.528)\r\ngosh, what are you talking about? Production quality. Look at that. my gosh. Dude, that's Clifford. I mean, he's not the big red dog, but he's the red dog.\r\n\r\n\r\nRichard Marmorstein (01:53.238)\r\nYeah, ifford, ifford.\r\n\r\n\r\nNikolas Hulewsky (01:56.818)\r\nIfrit, Ifrit, excuse me, excuse me, Ifrit. Dude, and it's written this soccer story.\r\n\r\n\r\nfor your son, I can't read any of the captions underneath, but.\r\n\r\n\r\nRichard Marmorstein (02:07.21)\r\nYeah, yeah, it's you know He wasn't sure about this soccer thing It looked like a lot of running the little black and white ball rolled towards him and he just watched it go by Come on, if for try kicking it hesitantly if for its one his big paw the ball into his surprise zoomed forward So yeah, you like my plan?\r\n\r\n\r\nNikolas Hulewsky (02:25.184)\r\nOkay, so what's crazy about this is even the cartooning looks like Clifford. Like it looks like the children's books I read growing up.\r\n\r\n\r\nRichard Marmorstein (02:36.148)\r\nYeah, yeah, it doesn't look exactly like him. think Yeah, I don't know. I feel a little about the copyright situation, but like Yeah\r\n\r\n\r\nNikolas Hulewsky (02:41.972)\r\nNo, I'm not saying him, just like the style, like the coloring and the... Anyway, wow, that's incredible.\r\n\r\n\r\nRichard Marmorstein (02:51.956)\r\nYeah, so like this takes 45 seconds. I can print this out. I can give it to my son and you know, he's not picky about like the quality of the illustrations and he's just gonna eat it up and maybe he'll do a little bit better at soccer practice. I'm not yet. I need to figure out how to export these into like I'm gonna have to individually save each image. Like it's crazy how just like downloading the images and putting them into the document is the part that\r\n\r\n\r\nNikolas Hulewsky (03:04.714)\r\nDid you try this? Did you show it to him?\r\n\r\n\r\nRichard Marmorstein (03:19.07)\r\nlike takes way longer than the illustration and the narration.\r\n\r\n\r\nNikolas Hulewsky (03:23.23)\r\nWell, I have four boys under 11 and I've told each one of them the same story. Like it started with my oldest and then there's a story that I tell about they see a creature in the distance and they have to sneak up on it and it turns out the creature is Bullseye from Toy Story. And then they ride Bullseye to their house and as they're riding to the house, they see all their friends. They see Spider-Man and Venom and Batman and Iron Man and like every character you can think of and they love this story every night.\r\n\r\n\r\nObviously not my 11 year old anymore, but you know the two the two to five year old and That would be cool to put in this and just have it generate a storybook for me. Obviously I couldn't use those names, but It could generate a storybook\r\n\r\n\r\nRichard Marmorstein (03:53.45)\r\nYeah, yeah.\r\n\r\n\r\nRichard Marmorstein (04:04.84)\r\nYeah, so I mean, think just this recent image model that Google released is like a huge change versus like how easy and how good results you can get from what came before. So I definitely recommend just checking it out and seeing what it can do. Okay, and now I'll demo something a little bit more related to my job. So I work at Hume AI and we just released...\r\n\r\n\r\nNikolas Hulewsky (04:19.786)\r\nOkay, I love that.\r\n\r\n\r\nRichard Marmorstein (04:31.634)\r\na few weeks ago a model for text-to-speech. so like my job is to demo the capabilities of our model. And so what I've been doing is I've taken, you know, I went to college and took some English classes in college and wrote some poems and things. And I put those through the text-to-speech model just to kind of see what results, what results you can get. And my workflow for doing this is I have made an MCP server.\r\n\r\n\r\nthat I use via Claw Desktop.\r\n\r\n\r\nNikolas Hulewsky (05:05.184)\r\nOkay, I am very stupid. So what is an MCP?\r\n\r\n\r\nRichard Marmorstein (05:09.502)\r\nRight, Anthropic has, I guess it's a standard around tool use. Most of the models support tool use, you can, you work for some software company, you have a software product, you want people to be able to just chat with Claude or chat with OpenAPI and use your tool. So MCP is the standard from Anthropic. You can use it from Cursor.\r\n\r\n\r\nYou can use it from Claw desktop. You can't do it from the website because like it all runs on your laptop or that's kind of the default the servers run on your laptop. So like MCP you can you go.\r\n\r\n\r\nNikolas Hulewsky (05:48.64)\r\nSo.\r\n\r\n\r\nNikolas Hulewsky (05:54.368)\r\nIt essentially allows you to use your tools within the model.\r\n\r\n\r\nRichard Marmorstein (06:00.726)\r\nYep, so what you do is, let me make this a little bigger. You edit this file called cloddesktopconfig.json and then there's these commands that you can put in here to add new capabilities to clod. You can do this if you're not a developer. This makes a lot of sense if you are a coder, but like this one.\r\n\r\n\r\nNikolas Hulewsky (06:27.328)\r\nThat's what, that's gonna ask, did you write this yourself or were you using cursor to write this?\r\n\r\n\r\nRichard Marmorstein (06:30.966)\r\nI wrote it my, well, I, so this one gives Claude access to the file system. I wrote this config. You could probably ask cursor or Claude just to write this config for you and get some results. But so here I'm giving it access to the file system so it can see the contents of these directories where, you know, this is where I put my, my poems and stuff. And then, you know, this is where my obsidian vault is. I use obsidian, which is a note taking software. And this is where.\r\n\r\n\r\nNikolas Hulewsky (06:42.696)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (06:52.254)\r\nwhere your poems are located. Yeah.\r\n\r\n\r\nRichard Marmorstein (07:00.69)\r\nwhere I write my code. And then this is the server that I wrote, which is just a little wrapper around the software that my company makes. And so this is what will give Claude the ability to convert text to speech. So let's check it out. I will start a new chat with Claude. I will say, I have a poem in, let's see, users, twitchered.\r\n\r\n\r\ncreative out to get me I Would like you to help me design a voice to read the poem interactively and then produce audio files So we'll do that\r\n\r\n\r\nNikolas Hulewsky (07:48.82)\r\nYou went to school for computer science? Is that what your major was?\r\n\r\n\r\nRichard Marmorstein (07:50.649)\r\nyeah. See you soon, economics.\r\n\r\n\r\nNikolas Hulewsky (07:54.208)\r\nWhere'd you go to school?\r\n\r\n\r\nRichard Marmorstein (07:56.229)\r\nWashington and Lee University, a small liberal arts school. I took a lot of classes outside my major, which was a good experience. think I got... Oh, what's it... Okay, it's looking at my file system. It's seeing that this is a directory. Okay, it's reading the poem. Oh, it likes the twist ending of the poem. And now it's going to create the voice. Hopefully you can hear...\r\n\r\n\r\nNikolas Hulewsky (07:58.421)\r\nVery cool.\r\n\r\n\r\nNikolas Hulewsky (08:18.932)\r\nThis is so cool.\r\n\r\n\r\nRichard Marmorstein (08:25.696)\r\nwhat's gonna happen, because it's gonna play it too. yeah. Well, Claude will call my little server and it'll play it through my speakers. did I? I accidentally clicked to disallow it, because Claude always prompts you to ask permission. So I'm to try again.\r\n\r\n\r\nNikolas Hulewsky (08:28.8)\r\nplot is?\r\n\r\n\r\nNikolas Hulewsky (08:34.463)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (08:43.977)\r\nRight, right.\r\n\r\n\r\nRichard Marmorstein (08:49.302)\r\nAlright, and I'll click allow for this chat. And then it'll cook for a second and then it'll speak.\r\n\r\n\r\nNikolas Hulewsky (08:55.018)\r\nCook.\r\n\r\n\r\nlong did it take you to build this? Not necessarily the total tool, but just your server and...\r\n\r\n\r\nRichard Marmorstein (09:05.566)\r\nI do not have long, but they're out to get me. All of them, those knowing faces, I considered friends, those awkward family arms that felt like love.\r\n\r\n\r\nNikolas Hulewsky (09:24.468)\r\nDid you pick British? was that just, hey, I think\r\n\r\n\r\nRichard Marmorstein (09:26.749)\r\nNo. Yeah, so it's coming up with, well, this is the first line of my poem. I do not have long, but they're out to get me. After he's done going out. Those knowing faces I considered friends, those awkward family arms that felt like love.\r\n\r\n\r\nYeah, so my company's model, usually you want to, if you, can describe the voice that you want, like you could say British accent or you can say, you know, this person should sound really emotional or this person should sound monotone and stuff like that. But also if you just like send it text, it'll try and find the voice that is appropriate to that text. So if you put like army hearties, it'll know that it's supposed to be a pirate or that sort of thing.\r\n\r\n\r\nNikolas Hulewsky (10:06.194)\r\nInteresting. Yeah.\r\n\r\n\r\nNikolas Hulewsky (10:12.544)\r\nSo the first line that played, I was like, yeah, that sounds robotic. The second one that it played didn't sound as robotic. They were different. I mean, they were still the same British voice, but they were, I guess, different inflections. I don't even know the right terminology to use. Was that on purpose? Like, how did that happen?\r\n\r\n\r\nRichard Marmorstein (10:27.316)\r\nYeah. Yeah, well, so that happened because it's not Claude hasn't figured out how to use the model the right way. It can't hear the audio like Claude doesn't support like audio input. So what I can do is I could say, you know, those voices sounded too monotone. I would like it to be more expressive.\r\n\r\n\r\nNikolas Hulewsky (10:37.504)\r\nMm.\r\n\r\n\r\nRichard Marmorstein (10:53.738)\r\nAnd then, can you, like, emphasize parts of the sample text with capitalization and ellipses to add a little bit more stylistic flair and emotional variance to the voice? And then it'll, And then you can see...\r\n\r\n\r\nNikolas Hulewsky (11:12.576)\r\nWhat? Now is Claude writing code that then goes back to your server that tells it what to do?\r\n\r\n\r\nRichard Marmorstein (11:21.366)\r\nClaude isn't writing code, it's just writing text and it's writing a voice description. So the text, this all goes to Hume's, know, text to speech model. do not have one, but they're out to get me. All of them. Those knowing faces I considered friends. Those awkward family arms that felt. Yeah.\r\n\r\n\r\nSo it's gonna try again.\r\n\r\n\r\nNikolas Hulewsky (11:51.85)\r\nHow did you build the model?\r\n\r\n\r\nRichard Marmorstein (11:53.846)\r\nSo I didn't build the model. My company has 20 researchers or has some researchers who do that. So I just show off the cool work that they do. And so they did their machine learning stuff that I don't understand. But all I did was build this connection kind of between Claude and the text to speech. You put in text and you get out speech. You can try what my company does.\r\n\r\n\r\nNikolas Hulewsky (11:55.753)\r\nSure, yeah, your company.\r\n\r\n\r\nRichard Marmorstein (12:23.794)\r\nWe got a demo.\r\n\r\n\r\nNikolas Hulewsky (12:24.158)\r\nWhat's, well, let me just ask, what's the use case for this? Like why do we need another text to speech company?\r\n\r\n\r\nRichard Marmorstein (12:32.826)\r\nyeah, I mean, there's lots of them. think ours is particularly expressive. So if you're a creative person that wants, you know, emotion in your voice or to be able to customize exactly what the voice is like, we're, pretty good at that. ours is the first model where it's, it's in LLM trained. It's not like just a model that, you know, take some words and converts them into the sounds that correspond to those words.\r\n\r\n\r\nit understands what the speech means, right? Most of the traditional text-to-speech models, will go from... You'll type to them, and then they might have an LLM in there in between that converts the text to phonemes, just some representation of the sounds that corresponds to those words. It's not like...\r\n\r\n\r\nNikolas Hulewsky (13:26.047)\r\nOkay.\r\n\r\n\r\nRichard Marmorstein (13:30.858)\r\nWhereas ours goes directly from...\r\n\r\n\r\nYeah, I'm not the researcher so I don't understand, but it's it's a speech language model, is kind of like a different type of thing.\r\n\r\n\r\nNikolas Hulewsky (13:38.708)\r\nDon't know you're good. Okay, well, let me. Let me ask you this. What are the use cases for this? So a creative person who wants the voice to sound good, but are there other business applications like if I'm a small business owner and I want to have an after hours phone service or if I want to have sales support, but I don't have enough money to hire a person I want to hire AI, would I go to your company and be like?\r\n\r\n\r\nHey, I want the voice to sound like this and then I'm using this model in the background to answer the questions. Does that make sense what I'm asking? So it's like, you're using kind of two models. One is the voice, one is the brain behind the way it operates.\r\n\r\n\r\nRichard Marmorstein (14:19.83)\r\nYeah, so my company actually has two products. One is a conversational AI, which you can hook that up to Twilio and you can have it make calls or receive calls and then you'll have a conversation with the user. We're work and then our other product is this TTS that we just released where you could have a conversation, hook this up to Claude or whatever and\r\n\r\n\r\nNikolas Hulewsky (14:30.474)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (14:47.392)\r\nSure.\r\n\r\n\r\nRichard Marmorstein (14:47.904)\r\ncreate a conversational experience, but it's not gonna be able to be interrupted by the user and have a natural feeling conversation. And soon we're gonna make our conversational AI model use this model. This model is called Octave behind the scenes, so you can have an expressive conversation where you can customize the voice as much as you want.\r\n\r\n\r\nNikolas Hulewsky (15:04.64)\r\nMmm\r\n\r\n\r\nRichard Marmorstein (15:09.833)\r\nSo that's one use case, is the conversational use case where you want to have phone calls that happen and deal with things with users. For just the TTS, it's more creatives, right? yeah, well, I mean, if you want to put an ad on TikTok or whatever, and you want the voice to be better than what you're capable of speaking yourself, and you want just a lot of control over it and to be able to iterate yourself without.\r\n\r\n\r\nNikolas Hulewsky (15:22.228)\r\nJust creatives.\r\n\r\n\r\nRichard Marmorstein (15:40.534)\r\nThat's one use case, people can use it for that.\r\n\r\n\r\nJust any kind of content creation where you need voices. We've seen people on Twitter, you know, just make a little short animation that they're showing to people. Yeah, I'm not...\r\n\r\n\r\nother use cases.\r\n\r\n\r\nNikolas Hulewsky (16:03.272)\r\nNo, you don't have to think of anything else. I was just, you don't have to make anything up at all. I'm just me, my simple primitive brain is trying to understand this is so freaking cool because you can actually customize the voice. How would I use this in an application other than content? Cause content's great. But if I'm a business owner, like what could I do? Is it better at cloning my voice than other models?\r\n\r\n\r\nRichard Marmorstein (16:26.694)\r\nwe're going to release voice cloning soon.\r\n\r\n\r\nRichard Marmorstein (16:36.438)\r\nYeah, yeah, mean, yeah, voice cloning is a thing. You could do that. think, you know, one thing that people do is, you know, if you want to listen to things, like on the web, you know, you're on the go and you don't have time to scroll your phone and you want to listen to something, you might, you know, have a voice that you want to read it to you. So that's a use case for experiences like that where, you know, your users just\r\n\r\n\r\nNikolas Hulewsky (16:37.897)\r\nNot yet. Okay.\r\n\r\n\r\nNikolas Hulewsky (17:00.328)\r\nRight. Cool.\r\n\r\n\r\nRichard Marmorstein (17:05.554)\r\none of voice to narrate content to them. Like something that I'm going to do is, you know, I have a blog, I'm a software developer. I'm going to just put my blog posts through this, put a little audio link on top so that you can click it. And then I'm going to actually, I'm gonna publish my blog as a podcast on Spotify. Who wanna consume, you my written content can do so, you know, from their favorite podcast app.\r\n\r\n\r\nNikolas Hulewsky (17:24.676)\r\ncool.\r\n\r\n\r\nNikolas Hulewsky (17:30.688)\r\nThat's a really interesting use case, yeah.\r\n\r\n\r\nRichard Marmorstein (17:33.622)\r\nYeah, and you can do things around it too. You could just read the blog post, but what I have is I have Claude sort of generate a little intro with an excuse why I'm not on the podcast and so the AI is just gonna read my blog post and then can have Claude also generate a little criticism of what I've written at the end so it's a little bit more of a fun audio experience than just the text itself.\r\n\r\n\r\nNikolas Hulewsky (18:00.052)\r\nLet me ask you this. This is what I like to ask people who are using AI every day. What models do you personally use and what are the use cases that you use them for?\r\n\r\n\r\nRichard Marmorstein (18:11.574)\r\nYep. So I use, I use Claude a lot. I use Claude code that they released, you know, a couple, a couple, a month ago now, almost. Yeah, yeah. 3.7 Claude code. And so that can perform like pretty, pretty simple kind of tedious coding tasks that I have to do. Like I use that when I'm trying to solve kind of more complicated problems, I use open AI's\r\n\r\n\r\nNikolas Hulewsky (18:21.184)\r\nOkay. Was it at the same time they released 3.7? Okay.\r\n\r\n\r\nRichard Marmorstein (18:40.542)\r\nreasoning models. They have a cool thing I can show you. So let's just open up desktop again.\r\n\r\n\r\nNikolas Hulewsky (18:46.964)\r\nThat's interesting. When you say reasoning models, which I don't know what that means.\r\n\r\n\r\nRichard Marmorstein (18:53.734)\r\nYeah, so they have...\r\n\r\n\r\nNikolas Hulewsky (18:57.14)\r\nLike they have 404.501.01 mini 03 like to me they're all the same but are some of those reasoning and some of those aren't.\r\n\r\n\r\nRichard Marmorstein (19:02.24)\r\nYeah.\r\n\r\n\r\nYes, so 4.0 is just kind of like their normal model. You type to it, it types back, and that's it. These models have this other step where they reason about things. so you can see kind of like the chain of thought that happens. A question I like to ask, and this is a good way to tell whether it's a reasoning model or not, is when was the last...\r\n\r\n\r\nNikolas Hulewsky (19:21.523)\r\nMmm.\r\n\r\n\r\nRichard Marmorstein (19:33.334)\r\nU.S. presidential election not in a leap year? And the right answer is 1900 because, you know, leap years, every, like, millennium or whatever, they get an exception to the rule that, like, 2000 wasn't a leap or was a leap year, right? Whereas 1900 wasn't, yes. And so...\r\n\r\n\r\nNikolas Hulewsky (19:56.473)\r\nright, right, right, right, right.\r\n\r\n\r\nRichard Marmorstein (19:58.442)\r\nYou have to, like, really know what the rules for when a leap year happens is in order to get the right answer. So if I ask this to 4.0, I think it'll get it wrong. Oops. I clicked update just instinctively. When was the last... here it is. Sorry, I can't help with that. Well, yeah, that's definitely wrong. You can help with that.\r\n\r\n\r\nNikolas Hulewsky (20:03.008)\r\nGot it.\r\n\r\n\r\nNikolas Hulewsky (20:13.523)\r\nNo worries.\r\n\r\n\r\nNikolas Hulewsky (20:21.994)\r\nSure. Come on, 4-0.\r\n\r\n\r\nRichard Marmorstein (20:26.973)\r\nWe'll try again.\r\n\r\n\r\nRichard Marmorstein (20:34.784)\r\nAlright, let's, I guess there's some safety thing that they've added to their model that makes it not want to answer this question. Yeah. So I'm gonna try, like, here's a history question for you.\r\n\r\n\r\nNikolas Hulewsky (20:41.246)\r\nIt must be like, presidential election, stay away from that.\r\n\r\n\r\nRichard Marmorstein (20:52.79)\r\nwhen was the last presidential election\r\n\r\n\r\nRichard Marmorstein (21:02.93)\r\nsearching the web. Alright, yeah. That's Alright, it cheated. Yeah, okay, but if you ask... Let's see, can I disable Webster?\r\n\r\n\r\nNikolas Hulewsky (21:09.17)\r\nYou cheated. Yeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (21:14.816)\r\nBut if it had used its native intelligence, quote unquote, it wouldn't necessarily have been able to reason through, oh, actually, there was an exception. 1900 was the year. That's the answer.\r\n\r\n\r\nRichard Marmorstein (21:27.35)\r\nDon't use web search. Just figure it out. We'll see if we can do this. Yeah, okay, so it'll try and reason, and it does this, and it just decides that 1928 was not in the leap year. Because, I don't know. Yeah, and then if you do a reasoning model and ask the same... That was 4.0, and I had to...\r\n\r\n\r\nNikolas Hulewsky (21:47.456)\r\ninteresting.\r\n\r\n\r\nSo which model did you just pick? couldn't see. Yep.\r\n\r\n\r\nRichard Marmorstein (21:54.44)\r\nI had to tell it that it was a history question so it didn't think that I was trying to vote because it didn't want to get into the Russian. And then I had to tell it not to use web search so it didn't cheat. And then it did what I wanted it to do, is try to find the answer but get it wrong. And then if I start a new chat, I switch the model to a reasoning model. This is their most advanced reasoning model. Well, available to me at least.\r\n\r\n\r\nNikolas Hulewsky (21:59.516)\r\nRight, right, right.\r\n\r\n\r\nNikolas Hulewsky (22:18.72)\r\nOh, so that's O1 Pro?\r\n\r\n\r\nRichard Marmorstein (22:21.234)\r\nThis is 03-mini-high. Yeah. But 01's good too. I'm actually not sure on the differences. But it's a reasoning model. And you can see its reasoning. You can usually see the steps. It has this internal monologue. The user's asking about this. Okay, a leap year happens every four years with an extra day. So it does this chain of thought thing that hides from you by default, but you can peek into it to see what it's watching.\r\n\r\n\r\nNikolas Hulewsky (22:23.401)\r\n3-mini? Okay.\r\n\r\n\r\nNikolas Hulewsky (22:36.425)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (22:41.321)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (22:47.604)\r\nYou can watch it if you expand it.\r\n\r\n\r\nRichard Marmorstein (22:50.518)\r\nand then eventually it'll spit out its answer and 1900 gets it right.\r\n\r\n\r\nNikolas Hulewsky (22:57.098)\r\nOK, so let me ask you this. I've seen all of these models when I'm going into chat GPT. I usually just use 4.0. If I'm trying to write something, I use 4.5. But help me understand, would I use the reasoning models, and when would I just use the general model?\r\n\r\n\r\nRichard Marmorstein (23:02.198)\r\nMm-hmm.\r\n\r\n\r\nRichard Marmorstein (23:16.202)\r\nYep, mean, I would use, I almost always use the general model unless I'm coding or trying to solve just like some analytical problem where you have to, you know, reason step by step in order to come to the correct answer, right? So great for coding. You know, like,\r\n\r\n\r\nNikolas Hulewsky (23:26.462)\r\nInteresting.\r\n\r\n\r\nNikolas Hulewsky (23:31.579)\r\nOh. So I wouldn't use 4.0 for coding.\r\n\r\n\r\nRichard Marmorstein (23:36.982)\r\nYeah, I mean you can, but you get better results if you use a reasoning model usually.\r\n\r\n\r\nNikolas Hulewsky (23:39.508)\r\nNo, I get what you're saying, but like it would be better to use the...\r\n\r\n\r\nWhy? What's the difference? Do you know what the...\r\n\r\n\r\nRichard Marmorstein (23:47.71)\r\nYeah, the difference is just it does this chain of thought thing, right? Like it, instead of just, know, all right, I'm gonna write the answer now. It's explicitly trained to do this type of reasoning where it lays out its assumptions and the steps that it is taking explicitly. And that helps it, you know, it's still, you know, it's always trying to predict the next token, right? But like it's trained to predict tokens in a way that gives you this thing, which is more likely to eventually get to like,\r\n\r\n\r\nNikolas Hulewsky (23:51.029)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (24:06.546)\r\nInteresting. Right, right, right.\r\n\r\n\r\nRichard Marmorstein (24:16.936)\r\na right answer that follows from sound reasoning versus, you know, just something off the top of its head, you know?\r\n\r\n\r\nNikolas Hulewsky (24:24.01)\r\nThat's fascinating. I had no idea what the difference was. I was just like, whatever, bunch of models, but that makes sense.\r\n\r\n\r\nRichard Marmorstein (24:31.146)\r\nYep. Yeah, so I use CLOD for coding mostly when I use CLOD code and I want it to like actually just like, hey, here's this tedious coding thing that I don't want to do. If I'm like actually working on like a hard project that the AI is not going to be able to do.\r\n\r\n\r\nOften I will kind of use ChatGBT as my pair programmer. Their desktop app has this feature where you can, you can like connect it to your code editor. Like I can connect it to terminal over here. And then, you know, I can look at some code. What? Yeah. Yeah, you can, and then it can see this, right? And so, you know, I can say this is JavaScript just, you know, today.\r\n\r\n\r\nNikolas Hulewsky (25:07.956)\r\nHow do I do that? Where did you just do that? you can connect apps.\r\n\r\n\r\nRichard Marmorstein (25:23.71)\r\nis... what do I want to do? I'll just like fibbonacci and then I won't implement it and I'll pretend that I don't know how the fibbonacci sequence works and you can... I will like open up advanced voice mode and do, hey chatgpd can you see my terminal?\r\n\r\n\r\nRichard Marmorstein (25:48.212)\r\nNope, I can't actually see your terminal or interact with it directly. But if you describe what you're seeing or copy. Yeah, you're lying. Anyway, I have used that GPT successfully to like, I don't have to like context switch in between my chat window and my code window. can just like, it's just there. I can use my voice to ask questions about my terminal.\r\n\r\n\r\nNikolas Hulewsky (26:13.696)\r\nthat's smart. Yeah, yeah, yeah.\r\n\r\n\r\nRichard Marmorstein (26:17.618)\r\nprogrammer which Claude Claude doesn't have an experience like that it's like it's not actually about the model it's about\r\n\r\n\r\nYeah, the UI. So these are both the desktop apps. So that's coding.\r\n\r\n\r\nNikolas Hulewsky (26:31.316)\r\nThat's a really cool use case. I like that a lot.\r\n\r\n\r\nNikolas Hulewsky (26:36.874)\r\nDude Rich\r\n\r\n\r\nNikolas Hulewsky (26:40.788)\r\nWell, this was, dude, Richard, this was awesome. So not, not just because your company's,\r\n\r\n\r\nModel is interesting. That was interesting in and of itself. But I think a couple of things that I really got out of this were when to use reasoning and when not that I like. I'm just going to go down that rabbit hole. I think that's super interesting and I kind of want to explore that. And I hadn't even thought of it. You're the first person to actually mention that. So that was freaking fascinating. I think the you the UI that you just showed at the very end there, which was speech to text, not even speech to text. You were you were talking but also able to work.\r\n\r\n\r\nRichard Marmorstein (26:58.25)\r\nMm-hmm.\r\n\r\n\r\nRichard Marmorstein (27:07.722)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (27:20.092)\r\nin another setting and still have AI assisting you. didn't have, like you said, context switch. I think that was fascinating. And then the third one was sort of in the very beginning with this Google AI studio, or I can't remember the name of it. Was that right?\r\n\r\n\r\nRichard Marmorstein (27:36.275)\r\nGemiini, yeah, Google AI studio and use the Gemini experimental model with image generation.\r\n\r\n\r\nNikolas Hulewsky (27:41.472)\r\nYeah, yeah, yeah. So I have that up. I'm excited to try that and just make some stories for my kids. Personally, that's a really cool one. I like that a lot. This was awesome,\r\n\r\n\r\nRichard Marmorstein (27:50.762)\r\nYep. Yeah, was, thanks for talking to me. It was fun to just demonstrate the way I use AI. think it is, you have to figure this stuff out, right? And it's not obvious from all the press releases, but if you spend some time with it, you can figure out ways to make it work for you.\r\n\r\n\r\nNikolas Hulewsky (27:55.807)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (28:08.384)\r\n100 % totally agree. All right, I'm gonna I'm gonna stop the recording",
  "metadata": {
    "duration": "",
    "date": "2025-05-01",
    "platform_source": "Google Drive"
  }
}