{
  "episode_number": "36",
  "episode_title": "How to Launch a Profitable Fractional CFO Agency",
  "guest_name": "Vibhav Joopelli",
  "business_name": "Velo CFO",
  "transcript": "﻿What do you love about this business?  I love that I get to work with top 1% entrepreneurs on a day-to-day basis, like sit in rooms that I would never be able to, to sit in and sit in meetings I would never be able to be in outside of this business. Some of these guys are just top, you know, topnotch, extremely impressive.\r\n\r\n\r\nIn some cases, they have built multi-billion dollar businesses previously and are starting their second or third business now, and getting to just learn how they like, think about things, right. How. The questions that they ask me, and they're all more experienced than I am in many cases. So you get paid to learn.\r\n\r\n\r\nYeah, that's exactly what it is. Paid to learn from them and build relationships with them. \r\n\r\n\r\nHave you ever thought about being an entrepreneur, but just didn't know where to start?  Do you build something? Do you buy something? How do you even know who to talk to about this stuff? Well, I have really strong opinions around this question, and you might be surprised by my answer, which is, I think the safest way to get into entrepreneurship is through something called an agency, specifically an agency built around your unique skill set. \r\n\r\n\r\nSo welcome to another episode of Nickonomics. This is the show for entrepreneurs and watchpreneurs curious to learn how other businesses work. I am your host and chief curiosity officer, Nicholas Hlusky. I've owned and operated more than a dozen businesses generating 30 million a year in revenue and employing more than 300 people.\r\n\r\n\r\nAnd in today's episode, I sat down with Vibhav Joopelli. He's the founder of a fractional CFO company, Velo CFO. And I'm obsessed with just one question.  How do I launch an agency and why is focusing on a niche offering in Vibs case, venture backed companies that were pre IPO, the difference between success and failure. \r\n\r\n\r\nLet's find out together. All right. A quick announcement before we jump into the show. Look, I want to give you guys money. I want more reviews on my show. And so to that end, If you leave a review on my show, screenshot it and send it to me, you'll be entered to win a hundred dollar Amazon gift card. Every four episodes, I'm going to collect all of the reviews that have been left, randomly choose somebody and give you a hundred dollar Amazon gift card.\r\n\r\n\r\nAgain, super simple. Leave me a review on Apple or Spotify, screenshot it. Send it to me and Nick at cofounders. com and you'll be entered to win a hundred dollar Amazon gift card. Let's get some people paid. All right, with that, let's get into the show.  All right, bib, welcome to economics. Stoked to have met you for the first time, long time, as they say, I've been following you for a while on Twitter, but this is our first in person conversation.\r\n\r\n\r\nSo this will be fun. Likewise, likewise. I'm pumped to be here and excited to dive into the business. Okay. So just high level in its simplest terms, what is your business and what do you do?  Yeah, yeah, absolutely. So our business below CFO is a fractional CFO and. Bookkeeping and accounting firm specifically for venture backed startups.\r\n\r\n\r\nSo we provide bookkeeping, payroll, AR, AP services on the back end. And then on the front end, we also do fractional CFO work, which broadly entails financial modeling, fundraise preparation. Headcount forecasting, sales operations, go to market planning, and pretty much everything that a startup entering the inflection point of really starting to scale and maybe have raised a seed or series A and wanting to really get some more financial and data driven decision making into their business would want.\r\n\r\n\r\nI've had a fractional CFO before I had, do you know who Curtis Honey is?  I followed him on Twitter. I've never talked to him and I'm not, you know, super familiar with his business, but  he's, he's a fractional CFO. He launched his business off of Twitter. The thing I found interesting about you is that you're niching down to serve startups and VC backed startups in particular.\r\n\r\n\r\nSo I'm curious to hear, like, how did you get into the space and why did you decide to niche down? Was that always the thesis from the beginning or did you stumble your way into that?  It's a bit of both. I think it was the thesis that I stumbled into, I might say. So it starts from scratch.\r\n\r\n\r\nHonestly, when I started my career, I was in the technology private equity world at a San Francisco and Austin based fund called Strata. And so we were investing exclusively in enterprise software and tech enabled services businesses. And as an analyst at that firm, I spent a lot of time focusing on portfolio company support.\r\n\r\n\r\nSo working with our management teams on either post acquisition, forecasting, budgeting, or acquisition integration of, you know, tuck ins that we would then bolt on to the platform companies in our portfolio. And so. Through that got very familiar with the tech landscape more broadly and understanding tech business models.\r\n\r\n\r\nAnd so parlayed that into moving into the startup world where I was most recently at a FinTech company called ramp between, Oh yeah. I joined ramp, uh, probably end of 2021 left mid 2023 to start, start VLO. And that was a really interesting experience because while I was there, it was when, you know, interest rates started hiking the venture capital market for lack of a better term started, you know, Shutting down a bit and the focus for all of these startups shifted, as you might have heard from, you know, growth at all costs to profitability efficiency.\r\n\r\n\r\nAnd so that was where kind of the genesis of it came from is largely just driven by my experience and where my specific knowledge set played. And then, you know, the reason I left ramp to start this firm is through that market cycle met with a bunch of other startups founders who, who expressed that we don't really know how to start thinking about, you know, Our financials from a strategic lens, because all of the capital we've raised to date, we've been able to raise in a zero interest rate environment. \r\n\r\n\r\nNot even a deck. We just call up a couple of VCs, say, we've got, you know, this many customers, this much ARR, and they say, where do I wire? And so now they're like, all right, we're now we're talking to VCs. They're asking for a model. They're asking for headcount projections. They're asking for a retention analysis, things like that.\r\n\r\n\r\nAnd we don't know where to start. And so that's where it started. And, and that's how I got the business off the ground. And one thing leads to another, your network starts to compound most of our New customers are driven by referrals. So start working with a venture backed startup. They're going to refer their founder friends.\r\n\r\n\r\nAnd so that flywheel kind of picked up and now we've really started to niche down because not only is our customer base in that space, but we've just learned a lot through doing that. And we've started to compound some of our just knowledge about how to work with these kinds of companies. And it's very different of a style than working with.\r\n\r\n\r\nYour traditional cash flowing brick and mortar business or residential services business. So I had Curtis Honey on he's a CPA CFO, or he has a fractional CFO company.  And  the reason I liked your business is because it's different. It is a fractional CFO, but it also has the bookkeeping accounting functions, right?\r\n\r\n\r\nLike, I think the way you described it was like front office, back office,  but you also focus on venture.  His is more kind of the SMB space. So they're similar in what they're offering, but they're obviously different. Right. Anyways, his explanation of what a CFO does is three different buckets. You've got the CFO that helps oversee the transactions, right?\r\n\r\n\r\nSo that's making sure that the accounting is correct. You have. The long term sort of strategic relationships. So you're making sure that  you have financing, that you understand what your balance sheet and your P and L is. And then there's the third leg, which I'm blanking on at the moment  for you.  Have you, did you start with the CFO  and then morph into the bookkeeping and accounting functions?\r\n\r\n\r\nOr were you always like, Hey, we'll be one thing to everybody.  Yeah, that's exactly right. So, so I would almost describe the first leg of what Curtis just described, but like, you're just getting a sense of the numbers here are our numbers. Here's the data that we can work with. I would describe that as like under the office of the controller, which a controller usually reports to the CFO and the controllers responsible for the bookkeeping and accounting.\r\n\r\n\r\nAnd so we started out actually with just that second leg, right. Which is more. Decision making more like building the financial model on top of the books. And  very quickly, what we realized was that finance is a  data business in many ways. If you're working with garbage in, you're going to get garbage out.\r\n\r\n\r\nAnd we felt that trying to build financial models, trying to build financial analyses. On the basis of books that were prepared by third parties just left us exposed to a lot of variability in quality. Cause every company has a different accountant. Now we've got to work with 20 different accountants.\r\n\r\n\r\nWe don't have centralized resources. Sometimes they close the books in five days. Sometimes they close the books in 30 days. And as you know, we can only do our work once the books are closed. So it started off really as just a quality control thing. It's like, okay, if I want. The. work product that's attached to our name to be as high quality as possible.\r\n\r\n\r\nI need to vertically integrate and do the accounting as well. And very quickly, what we also came to realize was that now that we're deeper in the startup ecosystem, we've got a lot of companies that are not ready for The full stack fractional CFO service. Maybe they're at the seed stage because they've raised a couple million and trying to get product market fit.\r\n\r\n\r\nThose types of companies only need accounting and it's a good wedge for us to be able to provide accounting to those smaller companies and then six, 12, 24 months down the line, hopefully they need the fractional CFO support. And we've got a ton of context. We've been doing the books for a long time where we trust the quality.\r\n\r\n\r\nWe don't need to go back and change anything and we've already got the founder relationships that we know. That they're going to go with us. So it started off as like quality control. Then it became a actual strategic business lever.  Well, and the thing I love about accounting is data. And the analogy I always like to use is.\r\n\r\n\r\nIf you wanted to go and lose weight,  you don't just wake up one day and like, Oh yeah. I mean, I guess you could wake up one day and just start, Oh, I'm going to go running.  But typically what you do is you're like, okay, what do I weigh today? Today's March 1st. I weigh X number of pounds today. Cool. Well, in order for me to lose weight, I've got to expend more energy than I take in.\r\n\r\n\r\nOkay. So I need to track my food intake.  And I've also got to track my expenditure with like exercise, right? Yeah. Okay. I've got two things now that I'm tracking. If you don't do two things, one check in with those metrics.  In regular intervals  and to make sure that the metrics you're tracking are accurate. \r\n\r\n\r\nYou're not going to see the success that you need to see. You're going to make poor decisions, right? Like if you step on a scale, that's 10 pounds off and it tells you that you weigh the same, but you actually lost 10 pounds. You might be demotivated or you might feel like you haven't made any progress when actually, when in actuality you have made progress  and it's the same in accounting, right?\r\n\r\n\r\nIf I need to run my business, I need to understand where I'm at. I need to how well I'm doing so I can make decisions for the future. So to your point, if it's garbage in garbage out, it doesn't matter how good the virtual, or excuse me, the fractional CFO is, it doesn't matter how smart you are. It doesn't matter how well you can model things.\r\n\r\n\r\nIf you don't have the correct data upfront,  then you're just guessing, you're throwing darts at a board. So anyways, I like the way you're thinking about, all right, in order to get quality under control, we decided to take everything from  entering of the transactions to the analysis and then decision making recommendations.\r\n\r\n\r\nYeah, I love, I love that weight loss analogy because it also illuminates kind of another point on top of that, which is you also need to be tracking the right metric. So you like in the weight loss analogy, you correctly identified that it's calories in calories out, right? Food intake,  energy expenditure.\r\n\r\n\r\nIt's very simple for weight loss, but in many businesses. That identification is not as simple as it, as that a plus B or a minus B equals C equation. So that's a lot of what we try to do as well as like pinpoint, what are the two to three things in your control? Cause for most people, they would intuitively think, okay, are my input or my equation is like, let me track my revenue or let me track my profit.\r\n\r\n\r\nWhen in reality, the revenue and the profit is more akin to. What the actual weight on the scale is and less. So what are the inputs to increase or decrease the levers that you want to? So it's identifying those and tracking those as well.  So you were at ramp for a couple of years and  I'm pretty sure I'm going to probably say this wrong.\r\n\r\n\r\nSo you can correct me.  Ramp was a startup that was  offering funding. I think it was a debt funding that they were offering. It was a little bit different than just like traditional VC funding. So they were offering a corporate card product. So if you were  I could debit card way off. Yeah. Yeah. I mean, it, it is, it's lending in a sort in that it's a card that you can pay off on 30 day terms, but thank you for being nice.\r\n\r\n\r\nYou're like, no, no, no, Nick. No, no. You're like really close.  Yeah. Anyway, sorry.  Okay.  So being at ramp, did that give you a  The idea for this, were you, were you just seeing all of these startups that were coming to you, maybe they were using your credit cards, maybe they were using your product and they start saying to you like, Hey, fib,  we don't really know  where we are from a financial perspective and we need to be able to go out and raise money, but we can't even produce the decks that are going to support our thesis in order to convince them.\r\n\r\n\r\nBut like, how did that kind of come about for you in getting this idea to, to start the company you have? Yeah, I think what ramp gave me was skills, experience, a network, and quite frankly, like a little bit of like confidence and branding. I think that network is what gave me the idea because I met a lot of other folks in the startup ecosystem that were may or may not have been ramp customers here in New York City.\r\n\r\n\r\nThat we're going through that, that thought process of like, okay, you know, what I described earlier is like, Hey, we need to start to think about our capital, like, can you help us put together a quick and dirty model that we can show to investors? And I'm like sitting here, like I've built a hundred models in my life.\r\n\r\n\r\nI can, I can do that for you in, in two hours. Like, sure. Like, Oh, Oh, you'll pay me for it. Oh, wow. Like, okay. So there's an actual, you know, business that you made here. Say less fam. Yeah. Say less.  So that's how it came to be. And what I kind of came to realize from that was.  Fractional anything can be a business. \r\n\r\n\r\nAll if someone is paying you  to do anything, if you are employed by a company, that means that there are other people out there willing to pay you to do that. So there's no kind of like big jumping point where it's like, Oh, I've got this crazy idea. I've got to go start, got to raise a bunch of money and start a business.\r\n\r\n\r\nIt's like, if you have a job, there is a business you can build. And that business can be starting out as a glorified freelancer. When I started my business, we had. 95 percent EBITDA margins, because all of it was just me with a little bit of software. And then we started to scale, you know, this and that.\r\n\r\n\r\nBut over time you expand into turning that. Knowledge that you have transferring it, you know, building experience and turning it into a firm. But that was my journey. And probably a bit atypical for most of the venture community. Walk me through the decision process to start a company. Cause if like you're at ramp, I don't know what position you had, but they're a venture backed startup.\r\n\r\n\r\nThey're growing. They have a product, they have product market fit. Unlike any of the, many of these other venture companies,  whether or not the venture environment dried up. I think that they were going to be successful.  You could have stayed there. Probably had some equity options like that could have been worth something.\r\n\r\n\r\nAnd you decided to leave that to start this. How  did you get the confidence to do that? And why did you ultimately decide to make that jump?  So, yeah, it was a few things. One is I always wanted to do something entrepreneurial. I think it's what drove me to move into the startup world from private equity in the first place.\r\n\r\n\r\nWas skillset. And I loved my time at ramp was super close with a lot of the team there. And as I've been there a bit, the organization started to scale and around that time where I was like, okay, maybe I should keep an eye out for ideas that come across that I want to diligence further. I had basically started to develop enough of a network to where I felt that I would have a customer base on day one.\r\n\r\n\r\nAnd so that was all I needed to know was that someone would be willing to pay me on day one and I would have. Enough cash to cover my rent. And then from there, it's like, I'll just figure it out from there. It's kind of the mindset I had.  Where were you living at the time?  I was living in New York city.\r\n\r\n\r\nYeah. Wow. Cover the rent. So you're like, okay, cool. I'll make at least 30 grand a month.  Just kidding. Yeah. Yeah. I moved, I've been back and forth between Austin as well. So a little bit of Texas income taxes there. Yeah. I think one of the things that In hindsight benefited me that I know some others might struggle with is a little bit of ignorance.\r\n\r\n\r\nIf you go through the whole process of really thinking through, here's exactly what my projections are going to be once I start, here's going to be my cost, here's going to be how many customers I need to acquire. If you go through the process of thinking through all of that, You're going to be discouraged because the answer is always going to be like, you never know, and you're never going to be able to forecast it.\r\n\r\n\r\nIt's just throw yourself into the fire and figure it out. And so my thought process was like, my backup plan, if everything hits the fan, like, Just, I can go back to working in finance at another startup or maybe even ramp if they'd be willing to take me back. So I didn't view it as that risky and, you know, single, no family, like there's not as much people depending on me to go hit a home run either. \r\n\r\n\r\nWell, the way you just described that is how every entrepreneur who has ever started a business feels.  It took longer  and it was harder than they thought.  Like it just, you look back and you're like, man, if I would, if I knew what I know now, I wouldn't have done this. I don't, I don't know if I've ever met an entrepreneur who was like, Oh yeah, I would do this again in a heartbeat.\r\n\r\n\r\nLike all of them were like, nah, man, if I knew what I knew now, I probably wouldn't do this. But obviously they developed a skillset over that period of time and allowed them to do other things, et cetera. But yeah, you just hit the nail on the head. That's a very interesting dynamic that kind of everybody has to go through because it's harder, it's just harder and takes longer than you thought it was going to take. \r\n\r\n\r\nWhat year did you make the jump?  So this was.  April 14th of 2023 was my last day. So it's been, what's that math? 14 months. Yeah. Almost on the dot. Today's, today's mid June. This was mid April.  Very cool. Talk to me about the economics of actually do them separate. I'm curious about the economics of a fractional CFO company and then the economics of a bookkeeping accounting  company.\r\n\r\n\r\nWhat are typical margins look like? How do you acquire customers? Those types of things. Yeah. Yeah, absolutely. So I'll start with. The customer acquisition side of things, which is, I think, a bit unique for us rather than most companies is that we're able to,  so far, we've been able to acquire the majority of our customers through referrals and inbound, which means we haven't had to stand up a meaningful outbound operation, no sales team, no paid marketing, anything like that.\r\n\r\n\r\nSo that frees up a lot of cash in many ways that, you know, we can do whatever we take as distributions, reinvest in the team. So that's one that kind of plays into the way I've been building the fractional CFO and accounting business. And we've experimented with two different pricing models. The first is just a flat monthly retainer.\r\n\r\n\r\nAnd the second is a more like hourly time and materials based. I would say generally on the accounting side, that's going to be your lower margin, higher volume business. Thanks. You can simply just do more and it's a bit more of a commoditized type of industry where you can quickly hire people who already have knowledge on the, on the fractional CFO side.\r\n\r\n\r\nWell, that's what I was going to ask on the accounting side. It's probably easier to scale because you could go and hire somebody virtual to do a lot of those functions because it's not hyper specialized. Like it doesn't take a lot of expertise to understand. Where to code things in the GL, right? I mean, somebody else is kind of telling you how to do that.\r\n\r\n\r\nAnd you've got to go through a lot of things. Whereas the CFO side,  that is kind of more of a specialized skill. Am I thinking about that the right way or am I like way off? Yeah, I would agree and disagree. I think that there are some nuances related to the specific business model. So if it's a very simple business model, a cash in cash out divide annual contract value by 12 to get to revenue, then it's a lot more of like, but you can, you have a, you have a controller who can manage a pretty junior team and  If we, we work with a number of meaningfully more complex businesses, particularly within the FinTech space because that's where my experience in as, as well as my, uh, partner who, who leads our accounting team.\r\n\r\n\r\nHe's got a lot of specific FinTech experience. So what we've found is that within the venture backed niche, uh, FinTech is something that we've been leaning a lot further into. And so in something like that, you want specific industry expertise, but that industry expertise only really needs to be held at the.\r\n\r\n\r\nLead level. So whoever's leading the engagement and then all of the kind of back end grunt work or reconciliations, things like that can be done by people who don't specifically have that industry knowledge, but have done it for any company before. Yeah. I just meant like the architecture of your GL accounting system, sort of where things are and how they're accounted for. \r\n\r\n\r\nIt's definitely specialized, right? But once your company sets up the SOPs, for the most part, there isn't a lot of subjectivity with needing to decide, okay, how do I account for this? Where do I put this? Usually, like usually by that point, it's, it's pretty plug and play and you just need to go through and allocate or assign things to certain accounts.\r\n\r\n\r\nSo that's all I meant by that end of things are probably easier to hire for them. Like you said, the lead or the CFO or the controller, those are a little bit more specialized. Yeah, that's exactly right. And so So we, that business can run at like 30 to 40 percent margins. And then the fractional CFO side of things can get to, you know, 50 or 60, just cause you've got to pay talent more.\r\n\r\n\r\nAnd you've got, you know, people are willing to pay more for that. And then one thing that's been a confounding variable for us is that I am still at the stage where I handle several kind of key clients. And so that skews the margins a little bit, but so far it's been, you know, healthy enough to where.\r\n\r\n\r\nI'm able to like fund my, you know, whatever distributions need it to fund my life, that's not super expensive. And then try to reinvest the rest into hiring, scaling, tooling, systems, things like that. And so haven't raised any money to date. And the goal is to continue to keep it that way and just use the cashflow to become more efficient on the backend, potentially go down the route of.\r\n\r\n\r\nInvesting in some of our clients that are going out to raise money or doing potentially even roll up or tech and acquisitions in the future on the bookkeeping side. Specifically. I've always thought accounting firms were really good places to find businesses for sale. Not, I mean, the venture side is a little bit different, but for the venture side, it's fine businesses to invest in.\r\n\r\n\r\nExactly. Yeah. So it's a similar concept, but.  So  typically in a CFO role, you are helping companies  forecast out, you're also helping them create and track metrics, but, but also like understand which metrics in particular, you should be tracking as an organization,  it seems like in a traditional business, I'd have a conversation with my CFO and we'd be talking about, Oh, our revenue per unit sold was X, could we increase the revenue per unit sold, or is there an opportunity for us to decrease the The cost per unit sold.\r\n\r\n\r\nAnd so we're having like these conversations about becoming more profitable, but on the tech side, venture side in particular, many times you're just.  You know that you're spending and you know, you're going to have to get to another round of fundraising and it's probably a little bit different now, but especially in the last environment, it was almost like the goal was to get to the next round to raise as opposed to like go public. \r\n\r\n\r\nHow is it being a CFO in that dynamic? Like how are you helping these  startups?  Are you like, is the goal like, okay, we know we're going to run out of cash by this point, so let's just make sure we have enough cash until April 1st, 2025. Or are you also playing that role of like, how do we get more profitable?\r\n\r\n\r\nYeah, I think you hit the nail on the head. What you called out and the fundraising dynamic is probably the single biggest difference in how a fractional CFO business for venture backed startups would vary from. Fractional CFO business for SMBs like Curtis that you described is the dynamic around fundraising with SMBs.\r\n\r\n\r\nYou sell the business once, if at all, right, right. Uh, with venture backed startups, then the next,  the longterm goal of an exit, whether that's via an IPO going public or via MNA getting acquired by a larger private or public company has several milestones to get there. And each of those milestones is a fundraising round.\r\n\r\n\r\nSo companies, if they're chugging along, going, well, we'll raise 18 to 36 months. And so a significant portion of the way we think about it is like, we are not trying to be your partner through the IPO. At some point you should hire a full time CFO, prepare for the IPO separately. We're trying to help you hit milestone by milestone.\r\n\r\n\r\nThat's how do we get to the next fundraise? And importantly, when we get to the next fundraise, there's two things that we're trying to solve for one is doing the. like technical preparation for that fundraise. So setting up the model, setting up the data room, setting up the customer analyses. And one of the learnings that I felt from my time in private equity diligence in companies that were coming to us to raise was  we're doing largely the same analysis, right?\r\n\r\n\r\nVenture capital firms look at hundreds and hundreds of companies a year, and they're doing the same analysis on each one. Why don't we as the team prepare that analysis in advance and make the fundraising process go faster, illuminate what metrics we need to improve. So setting up the data room in that manner, setting up the customer file in that manner is like table stakes for us now and preparing for those fundraisers.\r\n\r\n\r\nAnd the second is like, okay,  here's when we need to fundraise and here's what the financial profile needs to be. The good thing about the velocity of capital deployment and venture capital is that you have a lot of data points on what benchmarks are needed to be successful in a Series A, Series B round.\r\n\r\n\r\nSo we're able to also try to set up kind of some analyses around like,  Here's what the  ideal ARR to FTE benchmark for a series A company should be. Here's where we are. We've got six months to try to improve that. There's a numerator and a denominator. Like what, what are we going to go after? So it's some of those strategic questions and it's also the tactical preparing for that,  but it's still kind of like external.\r\n\r\n\r\nHey, in order to get our valuation to a certain point, here's the ARR to FTE metrics for these other companies. Let's see if we can get there as opposed to, Hey, internally, in order for us to get to a certain EBITDA margin, this is where we need to get our, you know, ARR  to FTEs. That's an interesting way to think about it.\r\n\r\n\r\nYeah. Because these companies are 95 percent of cases, not profitable. There's the EBITDA margin is negative, right? So the focus is much more on top line and burn. I've heard about some of these companies,  they went out and they raised in a really good environment for them. And let's just say 2021, maybe company raised a hundred million dollars at a billion dollar post money,  but because of the pullback in the markets, some of these companies had have like more cash on hand and maybe not anymore, but at a time they had more cash on hand.\r\n\r\n\r\nThen the valuation of their company. And so they've like, got to make this calculus of what they do. Could they ever, in order for them to go public, they have to grow into that valuation. And so they've got to do some analysis of whether or not they could even ever grow into that valuation. Are you helping them through that stuff?\r\n\r\n\r\nLike, do you, have you had any clients that have gone through similar things to that, or is that,  I don't know, maybe later stage, larger companies that, you know, Have a full time CFO at that point and aren't usually using necessarily a fractional CFO. Yeah, we don't work with companies that stage as much.\r\n\r\n\r\nThat's a bit later stage, but the same dynamic does exist in the stage of companies. We do work at where instead of raising, you know, a couple hundred million on a couple billion, they've raised at a high seed valuation. And now they, they haven't grown into the expectations that, that their investors would have wanted and they have difficulty raising the next round.\r\n\r\n\r\nAnd so often what you need to do is. You're going to have to take a valuation discount and it's often like we test the market and we see kind of where the  threshold is like, Hey, here's where interest is coming in and obviously you want to get the best outcome for the team possible, but you would rather raise at unfavorable terms or.\r\n\r\n\r\nSell an aqua hire rather than just let the business die altogether.  There's this thesis that I've been hearing.  I think Andrew Wilkinson articulated it, but I've also heard from other people talk about it where they have these zombie unicorns or just tech companies that raised at. Extremely high valuations  and they have funds that are either just trying to get rid of them, even if it's at a steep discount,  or they're just trying to figure out their like economic model.\r\n\r\n\r\nAnd their thesis is like, Hey, you could go and buy a company with 30 million ARR for two or 3 million.  And if you can fix it or like, you know, drastically reduce the overhead, then all of a sudden you've got a  cash machine and it's something of value. And I like intellectually thinks it's an interesting theory, but I just don't know if there's any validity to what they're saying in your experience.\r\n\r\n\r\nAre there companies like that? Are there companies who are like, look, we're never going to grow into that valuation,  but the fund would probably let us go for. You know, a 90 percent discount and they could still be valuable to somebody, but someone would have to come in and put some money in and obviously change up the dynamics.\r\n\r\n\r\nLike, is that a thing or is that like just a thing people like to talk about? It's definitely a thing. I think it's talked about, you know, including by me a little bit more than it actually happens, but it's definitely a thing. And Jeremy Giffon, who used to work for tiny, he has a fund around this now.\r\n\r\n\r\nThat's the exact thesis. And yeah, I call them fallen angels. You call them zombies, but. There is definitely a significant universe of companies that are written off on the venture capital books as like, these are not going to be successful investment outcomes for us, but that doesn't mean that there isn't a successful product or a customer base in play.\r\n\r\n\r\nAnd so the difficulty is really just the situational negotiation aspect of it, which is how do you incentivize the founder or CEO?  To stay on board, how do you incentivize the existing investors to effectively, like, get their stake out of the way? Because usually these companies also have liquidation preferences in place, where if a company has raised 20 million dollars and sells for 20 million dollars, that 20 million dollars goes to the investors first as a liquidation preference and there's no common equity behind. \r\n\r\n\r\nAnd let me try to paint a picture for what you're saying right now. And then you can correct me because I'll probably mess something up  if I'm, if I'm a founder  and I own 10%, let's just say 10 percent of a company. And I raised  10 million at a hundred million dollar valuation. I'm looking at that and I'm saying, cool, broadly speaking, I'm worth 10 million. \r\n\r\n\r\nAwesome. I've got my money,  but those investors who put 10 million in,  let's just say they have a two X liquidation preference, which means.  In the event of a sale, they get two X on their money. So if they put 10 million in, that means they're going to get at least 20 million back  now, hopefully it's a lot more than 20 million back because it's, you know, they're participating hopefully in that, in the upside, but they're getting at least 20 million back.\r\n\r\n\r\nSo if all of a sudden they raised it in that macro environment where they had a hundred million dollar valuation, but now. They're worth only 20 million.  Well,  like you said, the CEO and founder, they still have 10 percent and they may look at that and say, I've got 20, we could sell this business for 20 million, but I don't get 2 million.\r\n\r\n\r\nMy number doesn't go from 10 to two. My number is zero because of the liquidation preference. That would, that the venture capital company has. And so for them, it's like, well, what's the incentive for me to sell? I have no incentive to sell. There's no, like, I should just continue to spend this money. So either the venture capitalists need to say, okay, look, we'll bend a little bit on this  liquidation preference, or the founder just has to get comfortable with walking away with nothing.\r\n\r\n\r\nAnd I think is that, did I do a good job of like summarizing? But that dynamic, yeah, that's the dynamic at play. And so there are things that you can do to get around that from a deal structure perspective that, of course, require the investors and the board members and the venture capitalists to agree, but you can basically set up the cap table to where it almost becomes a new entity.\r\n\r\n\r\nWhere the CEO or founder has some sort of upside, whether it's via options, they get a bonus somewhere, retention bonus, earn out, things like that. And, and the VCs effectively kind of get like crammed down or pushed out and you still keep the customers and you still keep the product and there's something to be made of that.\r\n\r\n\r\nThe only thing is you'll have to restructure the.  The expenses of the business, because under that new sort of business structure, capital structure, it will no longer support high burn. And so you effectively like strip out a lot of the expenses other than what's required. You keep the customer base, you keep the product and you try to run it as a profitable business now, and then try to do whatever levers you can to keep it growing.\r\n\r\n\r\nAnd all of this, the reason that it's talked about more. And it's actually done is that like there's a lot of things that need to go right under that process that we just described and it's way easier to cut burn meaningfully and continue running a business way easier said than done. You can't just cut 80 percent of a company's OpEx and expect the customers to still be as happy as they were before.\r\n\r\n\r\nSo you're going to have some churn. You're definitely going to have employee attrition. And so there are things that come up that you need to resolve. It's definitely being done. It's being done at the earlier and earlier stages and there's investment vehicles being spun up for it as well.  Have you seen any companies that have gone through it or do you see any right now that are going through it?\r\n\r\n\r\nNone of our clients that are, that that's been the case. There are definitely like some companies I see that are, I view as like prime candidates for this type of thing. And one of the dynamics that.  Maybe there there's less of it than you'd expect right now. One of the dynamics is because these companies have raised so much capital over the past couple of years to where they still have six, 12 months more even though we're through mid 2024, they've still got runway to try and figure it out.\r\n\r\n\r\nAnd the first option that they take is always going to be to try and figure it out before we put our hands up. So at least across the companies I'm working with, Even the ones that are, that, that are struggling to raise are still in the boat of like, we've got six to 12 months to figure it out and get ourselves in a position to where we can raise again.\r\n\r\n\r\nOkay. That's fascinating.  All right.  I've got some rapid fire questions for you. Is that cool? Yeah, let's do it.  What do you love about this business?  I love that I get to work with top 1 percent entrepreneurs on a day to day basis, like sit in rooms that I would never be able to sit in and sit in meetings.\r\n\r\n\r\nI would never be able to be in outside of this business.  That's really interesting. I hadn't thought about that. I wonder  you could write a book someday. Like these are all the things I learned from cool entrepreneurs. Yeah. Some of these guys are just, just top, you know, top notch, extremely impressive in some cases have built, you know, multi billion dollar businesses previously and are starting their second or third business now and getting to just learn how they like think about things, right?\r\n\r\n\r\nThe questions that they ask me, and they're all more experienced than I am in many cases. So it's really, you get paid to learn. Yeah, that's exactly what it is paid to learn from them and build relationships with them.  What do you hate about the business? It's one of the things I love and hate is that it's super talent constrained in the sense that I can grow my, I can only grow the business as, as good as the talent that I have on board.\r\n\r\n\r\nSo some of that's a little bit less out of my control as opposed to like just spamming and getting a ton of customers.  A lot of business guys. Are jealous of real estate guys because real estate is just steady, Eddie, easy. And a lot of real estate guys are jealous of business guys because they can actually generate cash flows and the business can actually grow as you sit here in 2024.\r\n\r\n\r\nWhat businesses or industries are you the most jealous of?  I'm a bit jealous of  people that are GPs and funds, people that own funds, because I think owning a fund, whether it's a real estate fund, private equity fund, hedge fund, I think is just purely on its own, one of the best business models that's possibly out there.\r\n\r\n\r\nYou get leverage in the form of literal leverage. You get Labor leverage, you get capital leverage and you have a stream of fees that's coming in and then you get carry on top of that. And on top of all of that, it's extremely tax advantageous. So I'm, I'm jealous of the business model as much as I like, I'm less jealous of, I envy the person who runs a fund.\r\n\r\n\r\nCause I know it's incredibly difficult. You have so many stakeholders you have to manage, but. If the business model could be like, yeah, exactly. Like the fact that you just have so much leverage across different areas of the way that the business is structured, I think two and 20 is just an insane concept  that hasn't gone away yet.\r\n\r\n\r\nAnd I think it's going to continue to endure. So yeah, I'm jealous of that business model.  I love it. Love it. Okay.  If you have two hours during the day and you don't have work to do and you don't have anything, any personal errands to run,  what are you obsessed with right now? What are you doing during those two hours? \r\n\r\n\r\nI don't know. Honestly, I don't have a good answer to this. I'm probably like getting outside. I live in New York now, so I'm getting outside on the west side highway, you know, spend time with friends doing like basic stuff like that. Probably not a great business answer.  No, no. Honestly, I love the answers that are non business related.\r\n\r\n\r\nI talked to somebody who their thing was they're obsessed with sports cards. Like collecting cards and when they have free time, they're like researching and seeing what the grade is and who it was and what the best cards are in their class. And yeah, so that, I find it interesting just to see kind of what people are obsessed with.\r\n\r\n\r\nIf you ask me during the months of, I don't know, September to December, I'm spending time trying to convince my friends to accept my fantasy football trade, like basic stuff like that, you know, like  it's good,  not college football, NFL. Oh, I went to Texas. So huge college football program down there. So, and we're, we're really good now for the first time in like a while.\r\n\r\n\r\nSo I, yeah, that's probably my kind of like, I'll be passionate outside of business. I went to us. Okay. Yeah. 2005 we've had a rough,  I mean, it was great while it was good. And then those, I mean, the sanctions killed us for anyways, that's a, like a longer conversation, but what advice would you give yourself?\r\n\r\n\r\nFive years ago, I think I would say, spend more time. All right, on  fitness sports, getting outside, getting active, like doing things in real life, social things, meeting people in person, as opposed to kind of like  getting addicted to the screens and cheap dopamine. Because one thing that you quickly realize once you get into the business world, especially, especially the sphere we're in on Twitter and things like that is like, you're going to get way too much of that in your career.\r\n\r\n\r\nSo get take as much time outside of that as you can. And don't get hooked on. Don't get hooked on that stuff early. Because once you get hooked, it's over. You became a young adult at a weird time, 2020, like everything gets locked down. And so it like  kind of forced you into this artificial screens and connect people over the internet.\r\n\r\n\r\nCause that's all you could do, right? Like there was no other option. Were you in New York at the time? During COVID?  I was back in Texas. My, my family's there. Yeah, that's where I was. This was awesome man. Thank you so much for joining me. Candor was amazing, and just to scratch my own intellectual curiosity around venture capital is cool to like talk through it with somebody who actually knows what they're talking about.\r\n\r\n\r\nWhere's the best place for people to find you?  Yeah, I appreciate that. It was absolute blast coming on on Twitter at v tweets. We can link it and then our website is www.velocfo.com, V-E-L-O-C-F-O. And so those are the places really responsive on either of those. So would love to get in touch with, love it with anyone who wants to.\r\n\r\n\r\nShout startups, finance, investing, fantasy football, anything like that. Awesome. Let's do it. Thanks, man. Thanks, Nick. All right. That's it. Another one for the books. I'm fired up. I don't know what else to say. I hope you found something valuable in that conversation. I hope you learned something. I hope there's something that you can apply to your business today, tomorrow, in the future that makes you money, makes you more successful, gives you more time with your kids.\r\n\r\n\r\nIf there was something I'd love to hear about it. In the comments below, you know, give me some feedback. And if you like actionable advice, and you want more of this, I write a weekly newsletter that gives insights, tips, and tricks into the world of entrepreneurship. Subscribe in my bio.  And if I can help you in any way in your entrepreneurial journey, don't hesitate to reach out to me, Nick at cofounders.\r\n\r\n\r\ncom. Sorry, Kelly, for more emails. And the last thing is. Remember,  curiosity is a superpower and you can use it to your advantage. As my mom used to say, there's no such thing as a dumb question.  Only dumb people.  We'll see you next time.",
  "metadata": {
    "duration": "",
    "date": "",
    "platform_source": "Google Drive"
  }
}