{
  "episode_number": "55",
  "episode_title": "Making $1.7M by Reviving Lost Leads with Matty McLain",
  "guest_name": "Matty McLain",
  "business_name": "Boost Patients",
  "transcript": "﻿Nik (00:00.911)\r\nAll right, we're in Matty. Welcome to Nikonomics. Stoked to have you my friend. Why don't you start by telling us what your business is and how you make money.\r\n\r\n\r\nMatty (00:11.566)\r\nOur business is Boost Patients and we make money by helping elective surgery clinics get more patients.\r\n\r\n\r\nNik (00:19.343)\r\nelective surgery clinics. All right, what is that? I don't even know what an elective surgery clinic is.\r\n\r\n\r\nMatty (00:22.35)\r\nYeah. Yeah. Elective surgery. So we, we were in a niche, which was private practice medicine. And even within that niche, we went even more narrow, which is elective surgery. So surgery that obviously it's, it's not, it's not emergent, orthopedics, LASIK, you know, plastic surgery, bariatric surgery. Yeah. Anything that, that you buy as a consumer and there's, there's typically a good\r\n\r\n\r\nNik (00:42.959)\r\nPlastic surgery.\r\n\r\n\r\nMatty (00:50.318)\r\nmix of cash pay in there. It's not all insurance.\r\n\r\n\r\nNik (00:52.783)\r\nthat's interesting. How do those companies typically get leads?\r\n\r\n\r\nMatty (00:56.397)\r\nmost of them, a good mix of them is referral based, but I would say 90 % of our clients, they, they spend money on ads. They do, they do Google ads, they do Facebook ads, they do some mix of advertising.\r\n\r\n\r\nNik (01:12.143)\r\nAnd so you're doing that implementation for them. You are the company that helps them generate more leads or do you do something different outside of the Google Facebook SEO?\r\n\r\n\r\nMatty (01:21.134)\r\nYeah. Yep. So for the first five years of boost, we were the sales department. I was working in, I was helping the clinic with some related things and noticed, man, these, these guys are spending, these guys are spending five or $6 ,000 a month on generating new leads. And if you track those leads through the sales funnel, very few of them were ending up getting a procedure. And so if you, you're a reverse engineer and say, well, why is this, why is there so much waste? Why are so many?\r\n\r\n\r\npatients not sticking and it's, you know, every business has this problem. I think private practice medicine has it more than most, which is there's, there's lack of follow -up. Doctors offices do not see themselves as a sales sales organization. And so I think it comes from the world of medicine, which is if somebody needs a knee replacement or a heart transplant, they'll, they'll call us. They'll come get it. And in, in elective surgery, you have to think like, like any other business, which is we need to get people's attention.\r\n\r\n\r\nAnd then when they reach out to us, we need to follow up. We need to follow up immediately. We need to follow up using all forms of communication. We need to track them in a CRM and we need to follow up for weeks and weeks and weeks. And you'd be hard pressed to find a clinic that does that.\r\n\r\n\r\nNik (02:32.847)\r\nSo are you doing the pay -per -click SEO as well as the sales team service for these companies?\r\n\r\n\r\nMatty (02:42.51)\r\nOnly in the last six months we actually there was the first time we said, okay We will run the ads to generate the lead ourselves for the previous five years we said we will integrate with your forms and Every we'll get more mileage out of the leads you already have and that was that was fantastic But just makes sense for us to enter that the ads game now\r\n\r\n\r\nNik (02:58.863)\r\ninteresting.\r\n\r\n\r\nSo were you a call center for them or like who was doing the follow -up for these patients?\r\n\r\n\r\nMatty (03:05.646)\r\nYeah, yeah. So we started six years ago, we were doing only email nurturing, then we added text messaging. And in the last year, we've added our own agents who get on the phone. So that's our big selling point is, how do you treat these leads that fill out a form? And most clinics would say, well, I think, Suzanne, you call them a couple of times, right? And Suzanne says, No, I send them one email. I thought you were I thought you were emailing for a week or two. No, I'm busy. I thought you were calling them.\r\n\r\n\r\nHmm when I get around to it and turns out she doesn't get around to it\r\n\r\n\r\nNik (03:38.863)\r\nSpoiler alert, she does not get around to it. How did you get into this space? Like how did you find that this was a need? What was your background?\r\n\r\n\r\nMatty (03:40.718)\r\nYeah.\r\n\r\n\r\nMatty (03:45.87)\r\nYeah. Yeah. Crazy story. I was doing similar work for multiple industries. So I had, I had clients who a roofing company, guys who trade commodities, a group of real tours, a bottled water company, and it was helping them. Basically, if you pull it down, they want more sales. And that was my job is to go in and help them figure out how to close more business. I worked out at a gym with a, I knew he was a surgeon. I didn't know him very well. And I thought, man,\r\n\r\n\r\nthis had worked so well in he was a bariatric surgeon and I actually mystery shop.\r\n\r\n\r\nNik (04:17.199)\r\nWhat is, sorry, like orthopedic, I know you're dealing with joints or something. What is a bariatric surgeon?\r\n\r\n\r\nMatty (04:25.07)\r\nGreat question. Bariatrics is weight loss surgery. Yes.\r\n\r\n\r\nNik (04:28.079)\r\nWeight loss, okay, sorry. Okay, so you're working out with the weight loss surgery doctor.\r\n\r\n\r\nMatty (04:32.046)\r\nYep. And I think, man, I'm doing this for other industries. This would work really well for weight loss surgery, high ticket item, lots of cash pay. There's lots of education. It's not, it's not just a real quick, quick decision. It's a long sales cycle. And so I went home and I mystery shopped his website. I filled out his contact us form and I said, I'm ready to come in for a consult. I'm cash pay. What's next. And I took a screenshot and I timestamped it.\r\n\r\n\r\nAnd then I waited and I waited and I was like, Ooh, what's the follow -up going to be like? And days and days. Nope. Nope. We didn't, we didn't really know each other. So do the mystery shop and nothing happened. And it was, I thought that was, Ooh, this is so delicious. I turned it into a story and sent it out to my email list. I had, I had about 500 subscribers where I would put out, you know, just sales tips and general information.\r\n\r\n\r\nNik (05:05.743)\r\nAnd he had no idea, he had no idea you were doing this.\r\n\r\n\r\nNik (05:12.463)\r\nThat's rad.\r\n\r\n\r\nMatty (05:28.11)\r\nSo I turned that into a story. I blurred out the name of the clinic and I said, hey, we all need to remember, we gotta eat our own dog food. We gotta fill out your own form, call your own business, see how the response is. And I didn't know, but he was actually on the email list. So he reads the story and he gets halfway and says, what the heck, he's talking about us. And so he goes through, yeah, he goes through his clinic saying, who gets the emails from the website? And everybody was pointing fingers and saying, you know.\r\n\r\n\r\nNik (05:49.326)\r\nNo way!\r\n\r\n\r\nMatty (05:57.39)\r\nAnyway, finally they find all these emails in a junk folder, 40 emails that patients have been reaching out and no one had seen. So that was the open door to working with them.\r\n\r\n\r\nNik (06:01.359)\r\nDude.\r\n\r\n\r\nNik (06:07.791)\r\nDude, Matty, that, I mean, Chris has this personality. I don't have it where he's like, I'm just gonna test this out. I'm gonna try this out. Like I would be sitting there thinking like, should I do the form? Then someone's gonna reach out to me and I gotta be like, no, it was just a joke. Sorry, I'm not really interested. Chris is like, no, why do you have to tell them anything? Just tell them you're interested in the weight loss clinic and then never follow up with them or whatever. But did you have any intention of following up with him other than you wanted to get content out of it to send to your newsletter?\r\n\r\n\r\nMatty (06:33.966)\r\nI thought that could be an open door. I had not really tried that tactic, but that ended up being a great open door. He was, you know, it turns out we're now we're fantastic friends. He's just salt of the earth guy, fantastic surgeon, he and his partner. And they were, they ended up being a bedrock of, I mean, they let me in their clinic. I spent weeks and weeks and weeks in the back of the clinic, sitting with patients, listening, asking questions, taking notes to figure out how come more of these customers.\r\n\r\n\r\nNik (06:46.479)\r\nAmazing.\r\n\r\n\r\nMatty (07:02.03)\r\ncan't make it to the end of this journey.\r\n\r\n\r\nNik (07:04.559)\r\nWhen I was in high school, I was the class clown. I got voted most likely to make you laugh. And one of my teachers told my mom, they're like, you know, Nick has a shotgun approach to humor. And I don't know why that always stuck with me. I didn't understand it at the time. And as I've gotten older, I'm like, it's kind of like a spray and pray approach. You know, I just say a bunch of random crap and like eventually one of the things will hit and be funny. But I think it's also similar to Chris's approach to entrepreneurship.\r\n\r\n\r\nHe has a shotgun approach where he's like shoots and he just sees what sticks. Are you like that? Are you like, that's an interesting idea. I'm going to test it. And then if there's a little bit of traction, you kind of start going down this rabbit hole or are you just somebody who's just naturally curious and, and, you know, you don't necessarily start a bunch of businesses. What's your background like?\r\n\r\n\r\nMatty (07:50.606)\r\nMan, yeah, so Boost is the, I think I wrote it up before this, I think this is the eighth or ninth entity that I've been part of. So I was probably a lot more like Chris 10 years ago, and I don't think I was as talented as Chris, so I would have two, three, four things going, but none of them getting any traction. So with Boost, my business partner and I made a deliberate decision to say no to many, many other things and focus, and that has worked out really well for us.\r\n\r\n\r\nNik (08:10.479)\r\nYeah.\r\n\r\n\r\nNik (08:18.767)\r\nTell me how big is Boost now.\r\n\r\n\r\nMatty (08:21.23)\r\nBoost is floating around $1 .7 million in recurring revenue.\r\n\r\n\r\nNik (08:27.631)\r\nAwesome. And for you, like there's two things that I'm interested in. This is the first thing at the practice level, what is the customer acquisition cost? And then at your level of boost, what is your customer acquisition cost? Cause I'm assuming they're both different.\r\n\r\n\r\nMatty (08:44.878)\r\nYeah, and it, man, it's, I think it's a great subject to talk about. When we started, Boost was a side gig for my business partner and I. We had some ideas on what the patient follow -up could look like.\r\n\r\n\r\nNik (08:55.791)\r\nIt's called it's called a side hustle, Maddie. Okay, a side gig. Come on side hustle.\r\n\r\n\r\nMatty (08:58.734)\r\nwhat did I call it? It was a side hustle. And we both had our hands full with other things and we said, hey, if we could make, what if we could get five clients? I think at that point we were charging somewhere between two and 4K a month for the work we were doing for our client. And we said, what if we could get five? So that tells you how small our vision is.\r\n\r\n\r\nWe started with, could we get five? And then we went a year and two years and it was word of mouth. It was flying to Houston to visit clinics. It was a couple of trade shows. And then we look up and we have 35 and then we have 45. And so we didn't, we did not intend on building this grand business. We just, we just done it kind of brick by brick. So only in the last 12 months have we said, I guess call it.\r\n\r\n\r\nNik (09:50.351)\r\nReally?\r\n\r\n\r\nMatty (09:56.846)\r\nTwo years ago, we got to the point of, man, we got Jonah and me and Liam, who was our first key hire and one other person really. And we said, all right, we're maxed out. Do we stay small and nimble and try to keep profits very high? Or do we want to keep going and turn this into a real business? And we chose the latter and said, yeah, let's go for it. It should be fun. Let's keep going. So we've kept going.\r\n\r\n\r\nNik (10:01.551)\r\nOkay.\r\n\r\n\r\nNik (10:20.943)\r\nSince you made that decision, what was the size you were at that decision point and how big are you now?\r\n\r\n\r\nMatty (10:26.35)\r\nYeah, we were probably at a million dollars, maybe just under a million dollars at that point. And so I say all that to answer your question about customer acquisition cost. We, it was near zero at that point. It was, it was me making calls, me doing followups, me going to industry events and asking for referrals. And that got us to a million dollars. And we should have started earlier, but we didn't have a real, a real sale system in place. We didn't, we weren't eating our own dog food. That's for sure.\r\n\r\n\r\nSo now we have what we call the sales flywheel and it has taken us, it's taken us a year to fine tune. It includes building lists, scraping lists, enriching lists with home addresses and cell phone numbers and clinic addresses and finding LinkedIn profiles and Facebook profiles, doing the outreach, mailing postcards, connecting on LinkedIn, cold calling, cold texting. So it's this whole system that we built to get in front of private practices and see if they are.\r\n\r\n\r\nNik (11:25.327)\r\nThat's awesome, man. Are you using your same team that helps these practices? Closed leads.\r\n\r\n\r\nMatty (11:26.318)\r\nare interested.\r\n\r\n\r\nMatty (11:32.366)\r\nThat's how we started and now we have a dedicated team of I would say three full -time people on the outreach side.\r\n\r\n\r\nNik (11:40.143)\r\nAre they onshore, are they offshore, like where are they based?\r\n\r\n\r\nMatty (11:44.974)\r\nYep, one is onshore, two are offshore.\r\n\r\n\r\nNik (11:47.791)\r\nDude, that's awesome. And so these physicians that you're working with, it's been typically word of mouth. How do you find them now? Is it just like you said, you're like, you're just scraping these lists and cold outreach or are people Googling you and you've got SEO and you're just getting a ton of hits a month?\r\n\r\n\r\nMatty (11:57.518)\r\nYeah, now...\r\n\r\n\r\nMatty (12:06.446)\r\nNow, I wish we don't have a very Googleable solution. You know, the thing that we are an outsourced sales team. We're an outsourced patient navigator, patient coordinator. So we build specific lists. Like currently we're pursuing a list of LASIK surgeons. So we have probably every LASIK surgeon in the United States. We have multiple people on the staff. We have phone numbers, emails, addresses, and that that's who we pursue. Just to, I mean, honestly, the last time we sent out\r\n\r\n\r\npostcards, we got three demos out of it because the problem is so specific. If the clinic manager sees that she actually said on the call, she signed up with us and she said, I would never respond to a postcard, but I got the postcard that said, you know, how many of your new patients are slipping through the cracks? And she's like, I'm so tired of trying to hire someone to, to be, they need to be a salesperson. But, but I don't, she's like, I'm not a salesperson and I don't know how to follow up and how to track all that stuff. So,\r\n\r\n\r\nFor the right person, that message just rings true.\r\n\r\n\r\nNik (13:06.799)\r\nSo I have a bunch of questions about your business, but I'm not going to ask any of them. I'm more curious about this, the startup phase, because it sounds like you have a really good mind for it, even though like it's only in the last year or so that you've created the sales team. But walk me through, you've done this eight or nine times. What was it about your friend at the gym that got you to the point where you're like, I'm going to go just look, I'm going to see how, how, how fast they respond to me.\r\n\r\n\r\nWhy did you do that in the first place?\r\n\r\n\r\nMatty (13:37.87)\r\nYeah, curiosity and I do love being the person who can solve, I think that's what I love about sales is if you really think you have a solution and truly they just don't know it exists and if I can just tell them about it, I've always been the salesperson. I'm gonna make sales great again. Sales get such a bad rap but.\r\n\r\n\r\nThat's because there's no, there's no barrier to entry. It's like roofing companies. If you have a ladder and a pickup, you know, you can slap a sticker on the side and say, I'm a roofer. It's the same with sales. And so there, there are some people in sales that, I mean, we all know someone who we would say, my gosh, they, it was just the most fantastic experience. they actually did provide a amazing value and I'm so glad I interacted with them. That's, that's kind of the experience that we go for. And so.\r\n\r\n\r\nNik (14:14.767)\r\nSo interesting.\r\n\r\n\r\nMatty (14:31.374)\r\nI think looking at a private practice and thinking, yeah, I think I can help the practice level up their sales to their patients, which is, it's good for the doctor, it's good for the patient, it's great for everybody.\r\n\r\n\r\nNik (14:45.263)\r\nWell, I find it interesting because I think there's two types of people. I mean, there's a lot of different types of people, but generally speaking with stuff like this, there's two types and Chris and I embody the two types pretty well. There's the first type, which is you, which is like, huh, that'd be interesting. I'm gonna try it. I wonder how much demand there is in Waco where we bought this RV park for RV parks. I was gonna post something on Facebook marketplace to see if anybody responds to it.\r\n\r\n\r\nyou know what? I'm kind of curious. I have this list because Chris just has lists of, you know, 10 ,000 people that live in the state of Georgia. I'm curious if anybody in Georgia would buy like peaches from me. So he just, he's like, I'm going to send 500 to test. He just tests it, right? That's the one type. And then there's like the second type of person, which is more me, which is like, Hmm. Okay. So there's 10 million people that live in Georgia of that. The demographics are going to be between 35 and 41, maybe 600.\r\n\r\n\r\nthousand. Okay, I'm going to need to break it down by income and then location and infer whether or not they like peach. Like I'm doing all this research where if I had just acted in the first place, I probably would have gotten a lot of a lot better primary information. But I love like, have you always been like that? Are you do you just do that naturally? Are you like, I'm gonna, I'm just gonna go act.\r\n\r\n\r\nMatty (16:00.526)\r\nYes.\r\n\r\n\r\nMatty (16:07.854)\r\nYeah, I think so. I think, and my business partner Jonah, he is the Nick for sure. Yes, except, yeah, I probably have way less capacity than a Chris of the moment it turns into details and follow up and tracking and systems like, man, all the fun is gone, I'm out of here. This is not what I signed up for. Okay, okay, good.\r\n\r\n\r\nNik (16:31.343)\r\nDon't worry. No, he doesn't have a capacity for that. You're not alone. So you've done this eight or nine times. Walk me through that process of, are you tested it and you, you sent it out to your newsletter. It was interesting. How do you decide to take the next step to start doing some research on like, could this be a business?\r\n\r\n\r\nMatty (16:53.614)\r\nHmm. Yeah, I've talked about this with with different friends Yeah, I think it depends on your situation right are you are you fully employed? Do you work 40 50 hours a week for a job? Do you have another you have another side hustle already? Are you self -employed that all sorts of factors, but I? Think I've probably I've probably changed I used to want to I want to do something that's so dear I want to do something that's not being done that that just lights me up\r\n\r\n\r\nI think over the last few years of, yeah, just going through the pain of growing a business from zero to a million to two million, there is a certain amount of pain and frustration, especially in this industry. We use a lot of technology. We're using phones, email systems, AI, texting, and that world changes so quickly that it feels like we are a startup. We're six years old, but we're still doing startup.\r\n\r\n\r\nshifts and massive changes. And so there, because of that experience, there's a big part of me that thinks I, you know, if there's, there is something to a boring old business, there's something to a painting company where you can, my buddy has a, like a handyman service and all they do is go put a bunch of yard signs out and send some postcards and their phone rings off the hook. Now they have their own problems and issues as we all know, but, but having the challenge of\r\n\r\n\r\nlevel of difficulty to get in front of the buyer, the decision maker is that is a real thing. And we happen to choose an industry that man, it is you ever cold called doctors offices for two weeks, you should you should do that because it will thicken your skin. Yeah, it's tough.\r\n\r\n\r\nNik (18:35.407)\r\nhave. I have actually, it's terrible. It's terrible. Cold call in person actually, which is which is awful. Alright, so after you do that first like test where you're where you're like, okay, there's there's something little here. What like what's your next step to validate the idea even further. In this instance, you went and talked to your doctor friend and it was obvious. There were 40 emails sitting in a junk folder that hadn't been responded to.\r\n\r\n\r\nMatty (19:02.414)\r\nMm -hmm.\r\n\r\n\r\nNik (19:02.639)\r\nWhat was the next step for you to validate whether or not this was an actual idea?\r\n\r\n\r\nMatty (19:07.15)\r\nYeah, so I guess there's two different levels. Level one is validating boost as a business. Level two, validating, can I get in front of doctors? Or level two, can we help doctors get in front of more patients? So which one do you want to go after?\r\n\r\n\r\nNik (19:21.007)\r\nWhat did you do next?\r\n\r\n\r\nMatty (19:25.774)\r\nI would say we, yeah, we validated the idea of the product. We obsessed over it really probably for too long. So we started by, we got all the old leads, the stale leads from the clinic and we would do these re -engagement campaigns and see how many people booked consults and how many of those people went on to have a procedure. And so that was very easy to show.\r\n\r\n\r\nNik (19:44.623)\r\nHmm. How are you? How are you tracking that manually? Or was it like through a clavio campaign? What did you do?\r\n\r\n\r\nMatty (19:52.494)\r\nI think the first thing we ever used was Drip. Did you ever use Drip? Where you could build, you could build.\r\n\r\n\r\nNik (19:59.247)\r\nTo be honest, I've never used any of this stuff. I just know it secondhand because Chris talks about it so much.\r\n\r\n\r\nMatty (20:04.782)\r\nYeah. Yeah. I think Chris is big on Clavio, right? Yeah. I've never used Clavio, but drip is probably a form of, of Clavio. So we don't, we don't use it anymore, but it was very easy to say, Hey, put 800 old stale leads in re engagement through different activities and see how many of those people submit the, the booking form. Ooh. And then take those 47 people and how many went through all the hoops and actually showed up to the front door and then go to the clinic two months later.\r\n\r\n\r\nNik (20:12.239)\r\nSame thing.\r\n\r\n\r\nNik (20:18.447)\r\nHmm.\r\n\r\n\r\nNik (20:31.887)\r\nWhen you sent when you sent those 800 out, were you checking like every day? Like, how many? How many have we gotten back? What's our response rate? How's the open rate? What's the\r\n\r\n\r\nMatty (20:37.07)\r\nabsolutely. We were obsessing over every, I mean, every, every patient reply that said, thank you guys for following up. We were taking screenshots and sending it to everyone.\r\n\r\n\r\nNik (20:50.031)\r\nSo was that campaign the campaign that let you know like, okay, yeah, there is a need here for physicians.\r\n\r\n\r\nMatty (20:57.358)\r\nyes. Yep. Yeah. That wasn't the 100%. Yeah. I would say the first three physicians we had, the results were so dramatic for them and they were, they were saying things like, this is the best money we've ever spent. And we've been doing this for 20 years because you know, I'm trying to think of a good analogy, but it's, it's kind of like, and we still do that. We still do the mystery shop. We do it every week. We've done it.\r\n\r\n\r\nNik (20:59.023)\r\nAnd then go, keep going.\r\n\r\n\r\nMatty (21:24.142)\r\na hundred times, mystery shopping a clinic and taking screenshots and even recording the calls and then getting in front of the physician to say, hey, how much are you spending on marketing? 20K a month. Yeah, but you know, when someone reaches out to you, this is how it goes. I reached out to you, I said I was a patient, no one called me, I got one email, which was three days later, and that was it. And best practice is you should text me back in 60 seconds, 24 hours a day.\r\n\r\n\r\nyou should call me six times, you should email me 10 times, you should text me five times. Just showing them that and when you get in front of the right doctor they say, so all we have to do is say, how much is the procedure worth? And they say, well I get paid 6K. You say, man do you think we could get five more people a month to engage with you? 10 people a month? So.\r\n\r\n\r\nNik (22:11.823)\r\nDude, that is so, and that's a really fascinating lead generation strategy. Just going, they have it on their websites. They have the number, secret shop them, and then show them, hey, look, I sent the email this day, here it is time stamped. No one's ever even responded to me. It's, you know, I sent this in May, it's July 4th. And then they're like, wait, what the freak? And like just a, man, that is, do you use that as a lead generation strategy? That is money.\r\n\r\n\r\nMatty (22:37.134)\r\nAbsolutely, every week. Now, I will say it. I know I agree and it sounds amazing. The majority of the time what clinic manager it's hard to get that in front of the doctor initially, what the clinic manager will say is, yeah, wait, I because you know, here's what here's the other thing we learned is the majority of the time the only person at the doctor's office who wants more patients is the doctor. If you ask anyone else, they say, I'm, I'm too busy as it is, you know, they're like,\r\n\r\n\r\nNik (23:02.415)\r\nYeah.\r\n\r\n\r\nMatty (23:07.246)\r\nI'm super busy and we already have a bunch of patients. And you say, so that person has a different problem. Clinic manager, sometimes they want more patients, but usually that is the doctor's pay. So we have to speak to the clinic manager in a different voice and say, hey, aren't you tired of hiring these positions that if they're good, they move on. If they're bad, you fire them. We can be that outsourced sales team. And that makes them look good instead of putting a bunch of work on their plate.\r\n\r\n\r\nNik (23:34.831)\r\nlong did it take you to go from zero to $10 ,000 a month in revenue?\r\n\r\n\r\nMatty (23:42.094)\r\nMan, good question. I probably, we hit that sometime in the first, I'm gonna say eight months. So we, yeah, cause that would have been five, six, five, five to seven clients.\r\n\r\n\r\nNik (23:54.127)\r\nTo me that sounds like a long time.\r\n\r\n\r\nMatty (23:56.974)\r\nIt was a long time. Yeah. And I think because we didn't know what we were doing and it took, it just took so long. And we over -obsessed about the product.\r\n\r\n\r\nNik (24:04.879)\r\nIt was also your side hustle though, right? Like you weren't doing this full time either of you. Okay. So you, you.\r\n\r\n\r\nMatty (24:08.846)\r\nCorrect. Yep. Yep. I think it wasn't, it wasn't until probably 18 months in that we said, let's do this full time.\r\n\r\n\r\nNik (24:15.759)\r\nSo you didn't hit $10 ,000 a month in revenue until eight months in. How long did it take? And it, well, it took you two years to get to a million a year in revenue, right?\r\n\r\n\r\nMatty (24:29.358)\r\nThat's probably, yeah, maybe a little more than two years. I'm not sure.\r\n\r\n\r\nNik (24:34.383)\r\nWhat were, can you, can you like identify any specific milestones in your mind where it was like, man, at 10 ,000, we had to hire a first person because it was no longer us doing everything. And at 50 ,000, we had to like, are there different milestones that you can kind of look back on and say, these were inflection points.\r\n\r\n\r\nMatty (24:53.102)\r\nabsolutely. And I, man, I wish I would have, I have a spreadsheet somewhere that was from, from day one and it was an Excel sheet and it showed every client down the left and their, their revenue across, you know, left to right. And then I would put those milestones at the bike hired Liam, who was our first employee, you know, switch to a different software added. So I would have all these, it would show what the revenue was and when we took these certain actions, like if I would have known, I should have pulled that up, but.\r\n\r\n\r\nNik (25:22.543)\r\nTalk about your mindset in understanding or identifying when it shifted from a side hustle to going in on it more full time. Because a lot of people enter entrepreneurship through a side hustle. And that's the question they're asking themselves. Like at what point is this no longer a side hustle? At what point is this something I go all in on? How did you think about that? And when in your mind did it shift from, this isn't just a side hustle, this is the real deal.\r\n\r\n\r\nMatty (25:51.534)\r\nYeah. You know, when you start a side hustle and I've had a few, those extra dollars feel like, they feel like icing on the cake. You're, I'm making an extra 2 ,500 bucks a month outside of my living. And you know, for, for, for many, many people, 2 ,500 bucks a month, there'll be life changing. So you, but you know, it's, it's degrees of growth. And I think, I think for some people it could be a mix of greed.\r\n\r\n\r\nFor some people, it can be a mix of desire to prove something. But I think for a lot of us, you didn't know you could do it, and then you did it, and you have those resources and those contacts, and you say, huh, well, we built the go -kart in your garage on the weekend. We could build a little dune buggy. You build a dune buggy. We can build a little race car. We can build a little airplane. And so you keep going because, yeah, we can. And with this accumulated knowledge, we can keep going. And so you get\r\n\r\n\r\nI remember getting to a point of side income and saying, this is no longer icing on the cake. Now, when I go do my other gig, I'm stealing from myself because this is the biggest opportunity. You put them side by side and say, man, now I'm cheating myself out of going for it.\r\n\r\n\r\nNik (27:04.143)\r\nOkay, so tell me when that was, like what does that mean? How much was that a month to you when you're like, okay, this is now overtaking my main thing. Do I need to reevaluate whether or not my side hustle should be my side hustle?\r\n\r\n\r\nMatty (27:17.101)\r\nYeah, dang, that is a great question. I was it probably my income from boost matched when it equaled my income of the other thing. I'm going to say that was in the neighborhood. It was it was right below or equal to I said, what am I doing the potential? I mean, this product, this market, the fit is just we just need to do more of what we're doing.\r\n\r\n\r\nNik (27:38.127)\r\nWell, you've got the tail ends of an aging demographic. You've got the tail ends of a richer demographic who are able to spend on elective surgeries. And you're growing without even really trying. You don't have a marketing team, right? I would be looking at that even in the early days, like, I should probably throw some money behind this. But what was that revenue then? When it was matching, when like your take home was matching what you were doing in your other projects, like what was the revenue of the agency?\r\n\r\n\r\nMatty (28:05.838)\r\nYeah, but my take home was pro and you know what you asked about profit earlier. I was going to say, man, in the early days, my gosh, we were so profitable. I mean, we were, we were richly profitable because we were killing ourselves. We were doing all the work, getting up early, staying up late, dropping balls. And you know, we had to go through that pain to say, are we willing to let some other people come and help us and drop the profit? So\r\n\r\n\r\nI'm just going to take a wild guess. Probably around, I mean, a month that we hit 40 to 50 K in revenue was probably like, my gosh, we, this is it. Yeah. Yeah.\r\n\r\n\r\nNik (28:43.087)\r\nThat was it. Well, it makes sense. Of course you're more profitable in the beginning because you're doing everything. Right. And there are some, there are some businesses where you can be a consultant and it's like, this business is only going to scale as far as my time is able to be scaled. But in a services business like this, you can scale beyond yourself. It's not like you're the only person in the world who can answer a phone call or respond to an email. How long, so when did you, let's say $50 ,000 a month in revenue. What was the time between?\r\n\r\n\r\nthe 10 ,000, which was eight months in, and the 50 ,000.\r\n\r\n\r\nMatty (29:17.198)\r\nthat was probably a long time because we, I mean, we intentionally, my business partner and I know what you will say, but we on purpose said, no, we want to stay small and nimble overhead is death. I mean, I come from, I've been self -employed for a long time, but when you're self -employed overhead is death. I mean, I have, I don't where that book is back here. It's like a company of one. I forgot who wrote it.\r\n\r\n\r\nNik (29:33.775)\r\noverhead of the set.\r\n\r\n\r\nMatty (29:45.39)\r\nAnd he's talking about the benefits of staying small and very, very profitable. And, oof, that sounds delicious. And when you're in that mindset, you don't want to hire people. You don't want to spend money unnecessarily. And then when you step over into let's grow, you have to completely change your thinking and say, no, we succeed through others now. I cannot do the work. I physically cannot.\r\n\r\n\r\nNik (30:04.719)\r\nYeah.\r\n\r\n\r\nNik (30:09.711)\r\nSo that's it. It's okay. It's an interesting point. But Mike, I think my main question now becomes for most people when they start growing a business, they're like grow at all costs. we're getting more business. We should keep growing. They don't get to the let's just keep it small and profitable until and unless they've had something big and they're like, I've done that before. I don't want that. Or they've had something big and it failed.\r\n\r\n\r\nright? Where it's like, no, I know that I know the downside of risks. I'm not trying to take on any of that risk. So did you have experiences in the past where like, stuff either you've blown up or you had managed things that were big that that sort of informed this thesis of like, yeah, let's just stay small. Where did that come from?\r\n\r\n\r\nMatty (30:55.214)\r\nHmm. I have always worked for my first job out of college was I studied entrepreneurship at a UNT in Denton. So I had, I had always planned on starting a business and I've never been part of a large company. I've never been part of anything corporate. It's always been very small. I think. Yeah, I, it's a great question. I, my, I value.\r\n\r\n\r\nFreedom, freedom of choice. If I want to pursue something creative or shiny and flashy, I want to do that. If I want to take time off, I want to do that. However, it's easy to say that, but when boost, you know, boost got to $2 million and I, it took me a while to realize, I'm, I'm actually not the guy to keep going to five, six, seven, eight. I think boost can and it will, but that's not, that's not me. And that, that is very difficult to look at yourself in the mirror and say, I thought I\r\n\r\n\r\nNik (31:42.991)\r\nGood for you, man.\r\n\r\n\r\nMatty (31:50.766)\r\nI thought I was going to go on Nick's podcast and the title was going to be, Matty Takes Us to 10 Million. Growing up, reading all the business porn, ink magazine, fast company, that is kind of the picture in your mind. But that's just not me in any way. In fact, it was probably at 1 to 1 .5 million that I should have said, someone else needs to come in here and do this thing because it's not me.\r\n\r\n\r\nNik (32:15.759)\r\nGood for you. That's really mature. That's a hard thing to kind of come to. I got fired, but I had to come to the realization that zero to a million, like anything under, actually probably anything under $2 million, just not for me, because I'm not a sales guy. I can build good relationships, but I'm not like you and Chris where I'm just like, I'm going to go test this idea. I'm going to go throw something out there. Well, I'm just going to go figure this out. I get like in the weeds in many respects, which is good later.\r\n\r\n\r\nMatty (32:18.734)\r\nYou\r\n\r\n\r\nNik (32:45.807)\r\ndown the road when you're trying to figure out processes and you're trying to bring people on and you're trying to be thoughtful about architecture, sort of where we're headed. But in those beginning stages, like the $2 million in revenue and below, that's not me. That was a tough pill to swallow. And like I said, I got fired. And as I, after I got fired, I was like, yeah, yeah, that was probably stupid of me to do, but thankfully I, you know, it was on somebody else's dime. So I, I, my hats off to you cause it's, it is hard. Like it's hard to get to that place where you're okay with admitting.\r\n\r\n\r\nMatty (33:11.214)\r\nYeah.\r\n\r\n\r\nNik (33:15.759)\r\nwhere you have weaknesses.\r\n\r\n\r\nall right. So for you thinking about the future, what's the next milestone? So it sounds like you got to a million. You've come to the realization, Hey, I'm not the guy to take it to five, 10 million. except like, so are you thinking about hiring a professional CEO? Like how are you thinking about growth in the future?\r\n\r\n\r\nMatty (33:38.713)\r\nYeah, yeah, we already have. We're, we're right in the middle of that at this moment. So brought someone on who the intention was he would transition into CEO, which he is he's he's 90 days in. And that is the plan. He's, he's stepping in, he's taking over. Yeah, he's, he grew a company, I would say similar to boost to about double what we are now. That's what he loves to do. It's what he wants to do. So it's yeah, so far, so good.\r\n\r\n\r\nYeah.\r\n\r\n\r\nNik (33:54.159)\r\nfor you now.\r\n\r\n\r\nNik (34:06.863)\r\nAll right, well, I have some questions to wrap up here. Is that cool? All right, what do you love about Boost?\r\n\r\n\r\nMatty (34:09.998)\r\nGo for it.\r\n\r\n\r\nMatty (34:14.222)\r\nI love that Boost is different. It's hard to put us in a box. People say, are you guys a website agency? You do ads and websites? Nope, we don't do that. I think the best thing about Boost is on our customer quotes page, we have doctors saying that we help them grow 20%, 30%. That's meaningful to me. I think being a private practice doctor is incredibly challenging.\r\n\r\n\r\nNik (34:23.279)\r\nRight. Right.\r\n\r\n\r\nMatty (34:42.094)\r\nAnd to the degree we can help them stay private and stay profitable, that means a lot to me.\r\n\r\n\r\nNik (34:46.895)\r\nThat's awesome, man. What do you hate about it?\r\n\r\n\r\nMatty (34:49.198)\r\nI hate, I hate that we're still a startup and that's probably my fault. That's completely my fault because that is, I think that's what I want to do. And so I'll make boost continue to be a startup until someone else takes over and says, Nope, sorry, no more changes. We got a thing that works. We're going to rinse and repeat and go to five, $10 million.\r\n\r\n\r\nNik (35:15.151)\r\nThat's a hard, that's a, in theory, it sounds good. It's hard to actually put it into practice. We're, you know, always kind of grass and screener type of guys, jealous of different businesses. For you, as you're sitting here, what industries are you jealous of right now?\r\n\r\n\r\nMatty (35:33.518)\r\nYeah, man, I'm always jealous. Well, two things. I always fantasize about being in real estate. Come on, I just want to buy a bunch of property and live the good life. I know those guys have their own challenges. And I have to admit, I'm a little jealous of people who went all in on building an audience five, six years ago. And I know you'd say it's not too late. And I don't think it's too late.\r\n\r\n\r\nNik (35:46.927)\r\nYeah. yeah.\r\n\r\n\r\nNik (36:03.087)\r\nI feel the same way.\r\n\r\n\r\nMatty (36:03.118)\r\nI don't think I will do that, but I do look at it as, dang it, now of course it looks like a fantastic move.\r\n\r\n\r\nNik (36:12.111)\r\nYeah, I know I feel the same way. Alright. You have two hours in your day. You don't have any family stuff. You don't have any work things obligations. You can do whatever you want. What are you obsessed with right now? Where are you spending your time?\r\n\r\n\r\nMatty (36:28.814)\r\nYep. Man, that's a big question. I am writing a book.\r\n\r\n\r\nNik (36:36.303)\r\nGo on.\r\n\r\n\r\nMatty (36:37.422)\r\nYeah, yes. This is boy. This is a rabbit trail of rabbit trails. I spent my all of my 30s. I'm 41 and my 30s. I dealt with a health issue and I'm writing a book about psychosomatic disorder, mind body, mind body stuff. Yeah.\r\n\r\n\r\nNik (36:53.775)\r\nOkay. That's awesome, man. I would ask you what that's about, but I've spoken to you about it before, and I know that it's longer than we have for this podcast. So, all right, last question. What advice would you give to yourself 10 years ago? 31 year old Maddie.\r\n\r\n\r\nMatty (37:03.502)\r\nRight. Yeah.\r\n\r\n\r\nMatty (37:10.286)\r\nYeah, man, I would have said calm the heck down. I do think, you know, I mean, I love business. I'm still passionate about business. But when I was 30, I was yeah, I had two, two tiny little boys and I was very scared that I would never that I would never make any, you know, make something of myself.\r\n\r\n\r\nI think if you show up every day and you work hard, you will absolutely make it. But I think it's probably the biggest struggle for our generation, me and you and guys 10, 15 years younger than us is just the constant weight of I need to get ahead. Because that can crush you.\r\n\r\n\r\nNik (37:56.495)\r\nYou know, I think about this a lot. I think about this a lot because I felt that way. I think I think many of us have felt that way. And if I would have told myself on the one hand, if I would have told myself to relax a little bit, I don't I don't know that I would have done what I needed to do to get to where I am today. But at this, but at the same time, I do want to go back and tell myself like, hey, dude, it's going to be fine. You know, you don't need to have these sleepless nights.\r\n\r\n\r\nBecause you do want to reassure yourself. And so I do struggle with that piece of advice because I do hear a lot of people give it. I give it because like there are two sides to that coin. You know what I mean?\r\n\r\n\r\nMatty (38:36.718)\r\nYes, I've talked about this with many people to say that thing, why are we sitting here with a couple of great businesses? Because we had a bias to action and we wanted to do something and now I want to do something else. So you're right. Maybe the better advice would have been, hey, it works out. Okay, it works out.\r\n\r\n\r\nNik (38:58.159)\r\nYeah. Yeah. Anyways, I'm not saying your advice is bad or wrong because I agree with that advice. It's just I think about that a lot like hmm.\r\n\r\n\r\nMatty (39:05.742)\r\nYeah, well, yeah, and I would have said also buy NVIDIA. I made this.\r\n\r\n\r\nNik (39:10.127)\r\nThat's great advice by Bitcoin, by Nvidia, genius, genius. All right, Matty, where is the best place for people to find you?\r\n\r\n\r\nMatty (39:20.302)\r\ngreat point. Yeah. Boost bariatrics or boost patients. Sorry. We started as boost bariatrics. We, we changed. If you, if you're interested in that service, or if you just want to get ahold of me, yeah, you can, I mean, people can email me. I don't know why they would, but boostpatients .com. We have a contact form. We have a calendar. if you need to get ahold of us, hopefully there's a, hopefully you have a huge following of private practice doctors.\r\n\r\n\r\nNik (39:27.791)\r\nlose patience.\r\n\r\n\r\nNik (39:40.463)\r\nand it won't take you two weeks.\r\n\r\n\r\nWe have a massive following of private practice, but actually I had the DSO guy, David Airely on. So I at least know there's dentists who listen. Right? That's tangential. All right, Matty, this has been awesome. Appreciate you taking time, my friend, and we will talk soon. See ya.\r\n\r\n\r\nMatty (39:49.902)\r\nYeah. Yeah.\r\n\r\n\r\nMatty (40:03.502)\r\nThanks, Nick. See you. Bye.",
  "metadata": {
    "duration": "",
    "date": "2024-09-09",
    "platform_source": "Google Drive"
  }
}