{
  "episode_number": "34",
  "episode_title": "From the Army to Building a $70M Dental Empire with David Ensley",
  "guest_name": "David Ensley",
  "business_name": "Celebrate Dental & Braces",
  "transcript": "﻿David, welcome to economics. I'm pretty stoked. This is the first time I've ever used this space. This is the new convert kit space that they built in downtown Boise. And so I'm testing it out. I got my own podcast studio. I feel rad. Wonderful. It's exciting. You look great.  Thank you so much. I really, I needed to hear that today. \r\n\r\n\r\nAll right. So in its simplest terms,  what is your business? And how do you make money?  Yeah. Wonderful. So I'm an orthodontist. So we're in the dental industry. And then on top of that, I'm part of a DSO, a dental service organization, or sometimes dental support organization. So we actually have a group of practices beyond just a solo private practice.\r\n\r\n\r\nYeah. And dental. Awesome. And  I want to talk more about the DSO.  Tell me, how did you get into space in the first place? What made you want it? To be an orthodontist.  Yeah. So I actually had braces when I was a kid and I was in high school driving a lawnmower around. We actually had a family lawn business.\r\n\r\n\r\nAnd so I was driving around in the Georgia heat, trying to figure out what to do with my life. And I decided I probably wanted to work in the air conditioning. And so I was thinking about different jobs and I'd had braces and this orthodontics thing seemed pretty cool. So I went and visited my orthodontist shadowed and realized that this could be a really great job.\r\n\r\n\r\nProfession and career. And so I went through college, went through dental school and kind of stuck with it. Nothing really dissuaded me or took me off that path of becoming a dentist. And then when I got finished with dental school, I did an orthodontic residency and I had actually done an army scholarship through dental school.\r\n\r\n\r\nSo they paid for my dental school. And he had a little living stipend, you know, so it really helps out with the finances there. So I went on active duty after I got done with dental school. And so that's what I did. My orthodontic residency is actually on active duty. I wore uniform to work and stuff like that to do my orthodontic residency.\r\n\r\n\r\nNo way I've done with that.  I went ahead and did four years in El Paso, Texas at Fort Bliss. Just doing my payback time. And then after that that was when I got out of the army and I moved to Austin, Texas and built a private practice.  Okay. So  for those who don't know, orthodontist, first you go to dental school and then you do a specialty after dental school.\r\n\r\n\r\nIs that right?  Correct. Exactly. Yeah. So it's four years of college, four years of dental school, and then two to three years of residency. My wife is a dental hygienist.  She went to USC. So USC was one of the few schools that actually have a bachelor's degree in dental hygiene. Okay. And,  then after she graduated, she actually was adjunct faculty.\r\n\r\n\r\nShe taught at the dental hygiene school.  It's very cool. Yeah, that's awesome. She loves the dental space. And I actually tried to convince her a few years ago to do a DSO.  I love DSO. So tell me a little bit,  you moved to El Paso. Was that right?  We were in El Paso in the army. I moved to Austin to start the private practice.\r\n\r\n\r\nSo you moved to Austin, you start your practice. At what point do you decide I'm going to start a DSO? And like, I guess maybe first describe what a DSO is.  Yeah. So your classical model was you'd have a dentist, they would have a solo private practice. So they would have a space that they owned. They would own the practice and they would usually work by themselves.\r\n\r\n\r\nFor their whole career. And that was the way that dentistry was done for years and years and years. And then eventually as dentists, we realized that we could be a little bit more professional. We could build a real company that actually did dentistry. And so there's a few different models in the DSO space that we can get into later.\r\n\r\n\r\nThere's a lot of rollup action in the dental space with DSOs. So a lot of people buying up multiple practices and then trying to sell them for larger multiples. But there's also people that are just trying to actually build a group of practices. Basically, they want to have more than just one practice.\r\n\r\n\r\nAnd so they build and operate those practices as a group.  So the DSO model, as I understand it, is essentially  a group of practices that have central  tasks being taken care of administrative tasks. Billing collections, H. R. payroll claims management, et cetera. And you kind of hit the nail on the head that there is a big push right now in the dental space, in particular with private equity companies who are coming in and buying up dental practices and rolling them up. \r\n\r\n\r\nCan you explain why though DSOs have become popular? Because  if I'm a person on the outside, I would think,  what's a DSO? Why don't you just own these dental practices and roll them up? Why do you have to have this thing called a DSO in order for the dental practices to get rolled up? Yeah. Well, there's a few drivers.\r\n\r\n\r\nIf you think about it, a lot of doctors, we spend a lot of time in school. So you spend four years in dental school learning how to fix teeth, but you don't learn anything about business. And a lot of dentists don't want to do the business basically. So that's one driver is a lot of people that are attracted to being part of a DSO because they want some help on the business side of things.\r\n\r\n\r\nAnd so there's a lot of doctors that's very attractive to there's also definitely it's profitable. So if you're running a good dental practice, there's a lot of profit there. And then when you help run the business side, all those things that you mentioned, the HR, the billing and take those off the shoulders of the doctors, then everybody's happy.\r\n\r\n\r\nA lot of times. Now, once again, a lot of the, a lot of the momentum in the DSO industry was built around some of that roll up arbitrage. So just over the last 20 years or so there's been a lot of money to be made in buying and selling dental practices and there's been more and more consolidation in the industry.\r\n\r\n\r\nSo that's eventually going to taper off. But up until this point, that's actually been a big driver in DSOs is trying to acquire practices. Build them into something larger and more professional and then sell them at a higher multiple.  So one thing you didn't mention, which kind of surprises me is that in many States,  like dentists have to own the practice or physicians have to have ownership in the practice. \r\n\r\n\r\nI thought that was kind of one of the main drivers for DSOs. It was like, this was like a workaround. Hey, if I Nick and non physician wanted to buy a practice, I had a partner with a physician. And then we owned a DSO that. Owned a share of the practice. Is that less common now than it used to be? \r\n\r\n\r\nYeah. No that's another major thing that actually determines how it's structured basically, because yeah, if you just, if you Nick just wanted to go build a dental office on your own and forget about DSOs, you're just like, I'm going to build a dental office. You can't just go out and build your own dental office.\r\n\r\n\r\nYeah. Because of those state laws. So that, you know, some of the structure, the way that they work, the agreements and everything is actually to comply with those laws about dental ownership in the industry. So what does the structure usually look like? Like, if I wanted to do that, I'd have to partner with a dentist and they'd own 50 percent of the company. \r\n\r\n\r\nYeah, it's, there's different structures. One very common one that gets around that is you're selling support services, dental support organization, basically. So you're saying, hey, you keep on owning this practice, but you're going to pay me to do these different support functions. I'll do your HR. I'll do you billing.\r\n\r\n\r\nI'll do, just these different things that the dentist wants to get off their shoulders. So that's 1 model that you can do. But then the other 1 is there, there are direct ownership ones where they'll kind of, buy the whole practice and everything, some of the big ones. I'll do that.\r\n\r\n\r\nSo yeah there's different ways they go about doing it, but that's one of the drivers is trying to avoid that direct ownership. So how does your DSO function, like, how does it look? Our group is called celebrate dental embraces. And so we have 21 locations nationwide. I'm a regional partner, so I own the practice in Austin.\r\n\r\n\r\nSo, uh, yeah, we are a little over 10 years old, so we've been trying to grow slowly and steadily. And a few of our things that we really believe in is. We have general dentistry and orthodontics in the same practices, and with orthodontics, we actually have an actual orthodontist at the practices doing full braces and Invisalign.\r\n\r\n\r\nAnd our goal is to make treatment, you know, affordable, quality, and convenient for patients, basically.  Ours is based off a management fee, so each of the practices pays a management fee to celebrate dull embraces. Is the management fee fixed? Or is it variable? Okay. Is it a percentage or is it just a dollar amount?\r\n\r\n\r\nIt's a percentage of collections. Exactly. Percentage of collections. Oh, that's really interesting. Okay. Functionally, you still own the practice, but then have a share of the D. S. O. Is that correct?  Yeah. So functionally, most of the doctors will own their practice. So  they bring in,  Revenue and they pay out their expenses.\r\n\r\n\r\nThey pay out this corporate royalty or management fee, however you want to phrase it, basically out of their revenue and the rest of that's left over after that is there's to keep it just like if they owned a private practice. And our goal is to save them more money than we charge them basically.\r\n\r\n\r\n If their overhead is better at the end of the day, then if they were on their own, then everybody's happy, what a lot of companies do that I've seen in the DSO spaces. So you mentioned earlier, there's this thing called multiple arbitrage.  So I'm going to try to briefly explain it and then you can tell me how dumb I am.\r\n\r\n\r\nBut  essentially, like if I'm looking at a dental practice and I'm just going to speak like broadly here  and the dental practice does, let's just say 500, 000 a year in  EBITDA. Well that dental practice could be sold to another dentist for 1. 5 million. Let's say three times earnings. Okay. Again, it could be more, it could be less depending on the specialties and the margin and all that stuff.\r\n\r\n\r\nBut yeah, 1. 5 million.  And traditionally that's the way that it's been done is a dentist or a physician because there are MSOs as well. They would just sell to another physician or another dentist and it would change hands at that three times multiple. Well, what kind of private equity saw was, this is interesting. \r\n\r\n\r\nIf  the EBITDA of a business is actually.  Not 5 million.  It's not valued at three times EBITDA. It's actually now valued at 10 times EBITDA. And there's public comps for this. There's companies that have gone public and there's also companies that have sold to private equity, et cetera. So they look at it and they say, Hmm, if I can buy 10, 500, 000 practices for 15 million, then because of multiple arbitrage. \r\n\r\n\r\nI'm now doing 5 million in EBITDA, I'll get the 10 X multiple valuation. And so my practices are now worth 50 million, but I only spent 15. So they've got 35 million in between there that allows them to either refinance or sell or go public or whatever, but they built 35 million of equity value. So when you hear multiple arbitrage, that's what they're talking about is the difference between these small standalone companies versus when they're rolled up. \r\n\r\n\r\nMy, my question to you is, how did you get  exposed to it? Is this a group of Dentists  who have kind of pulled together because you said regional partner. So I'm assuming there are other regions where there are partners or were you approached by a private equity group or a business person? Like, how did you kind of get exposed to the DSL world? \r\n\r\n\r\nYeah. So our group is entirely doctor owned. We don't have any private equity involved. That's our plan for the foreseeable future. You never know. But that's something we kind of believe in is Dr. Ownership. And so I was first introduced to the group. I was getting out of the army, looking for how I could actually own a practice.\r\n\r\n\r\nAnd in Austin, it's very competitive. There's a lot of saturated markets all over the country where it's kind of difficult to own a practice. Austin's a young enough city. Also, there just weren't any practices for sale. And I knew I wanted to own a practice as soon as possible. So in that case, if there's no practices for sale and I want to own a practice, that means I need to start from scratch.\r\n\r\n\r\nAnd so I was looking around and networking and some of the supply reps actually introduced me to the founder of celebrate dental embraces. His name is Dave Ferguson, and we just hit it off right away basically. And what Dave did as he built the company is he was willing to give a lot of partnership and a lot of equity away to people he believed in.\r\n\r\n\r\nThat he thought we're going to help grow the company.  So some groups, you know, they're really only wanting to bring on employee doctors, so if I had approached some other DSOs, they'd be like, yeah, sure, we'll hire you as an employee. Right. And the difference we celebrate was like, no, come be a partner.\r\n\r\n\r\nAnd so that's what allowed me to. I knew that D. S. O. S. had competitive advantages. So if you think about it, they're getting supplies cheaper now.  All these economies of scale basically that I knew that to be competitive in the future, I wanted to be involved with the D. S. O. But once again, most of the time you can't actually own in a D.\r\n\r\n\r\nS. O. All they're offering you is to be an employee. So that was a really cool thing. I kind of, you know, I found Celebrate right at the right time where they're actually willing to bring on partners and allow them equity basically. And that's how we've continued to grow is trying to attract more partners. \r\n\r\n\r\nYou said this was 10 years ago?  No, I joined five years ago. Five years ago. Yeah. And I talked at high level about DSOs strictly from a financial perspective  with the multiple arbitrage.  Like you said, the ability to negotiate contracts, both from a payer level and at a vendor level. So, you know, if you're working with Henry shine and you're trying to get your supplies at a discounted rate, because you're offering group purchasing power, that's a huge benefit to it.\r\n\r\n\r\nIf you're going to these insurance companies and you're trying to negotiate rates, that's a huge benefit to it. And you also get to specialize. So you'll have specialization in billing and collections and HR payroll and legal and your CFO. So yeah, there's a host of. Benefits to it that allow you to recognize some economies of scale.\r\n\r\n\r\nLike I, I totally get it.  I was just saying that there's been a huge influx of private equity because they see, Ooh, there's money here for us to make, which is, which has been interesting. So  do you, so you own your practice in Austin, but you also have ownership in the DSO or like, how, like, how does that function? \r\n\r\n\r\nYeah. so like I said the founder, when he structured things. Whenever you open a new region, he wanted a partner both on the ground, basically to run the practice and to help run the DSO portion. So I own 100 percent of the orthodontic practice in Austin, but then I'm a partner in the DSO or sort of the corporate portion.\r\n\r\n\r\nInteresting. How do you guys, if you're willing to share, how do you decide on what the management fee is going to be?  We've just kept it consistent over the years, so it's kind of been the same all along. Yeah.  Interesting. And. Do you guys get together once a year and cause obviously you have your own practice to manage, but  how does the management of the DSO different from the management of your own individual practice?\r\n\r\n\r\nYeah, that's kind of honestly, one of the most fun parts is being a dentist can be lonely sometimes if you're in private practice, you're all by yourself. You got this team and you enjoy working with them, but they're not really your peers, you know, so lots of people have good friends that they talk with and everything, but I've just really enjoyed going down this dental journey with some other partners.\r\n\r\n\r\nSo we get together once a year for a partner meeting and play pickleball and spike ball and, hang out at the lake and stuff like that. So that's a lot of fun, man. And there's constant emails and phone calls and stuff like that with the other partners working on sort of corporate group level type of stuff.\r\n\r\n\r\nSo it's been fun for me, so I, you know, run the day to day in an orthodontic practice and putting braces on and doing invisible line and stuff like that. But then also it's kind of fun because maybe I can step back and work on a company wide type of thing. Just as an example, I sort of spearheaded all our aligner initiatives.\r\n\r\n\r\nSo. Working on rolling out more Invisalign in the group. And so that's something I do for everybody. So just little things like that. Each person contributes in their own way like that.  So for you,  if you guys got approached by somebody from the outside, private equity or business person to invest in the company, are you guys open to that?\r\n\r\n\r\nOr are you  kind of firmly, dentist owned, this is all we're ever going to do or are you kind of agnostic at this point?  We really want to stay private for as long as possible, basically. So somebody offered us, a billion dollars, of course we'd sell, you know, but, but right now we're, we're focused on growing it, really, we kind of looked at the deals that private equity was giving and we're like, okay, so they were going to buy us and, do this and that and everything.\r\n\r\n\r\nWell, why don't we just do it ourself? Why don't we build a professional organization? And make it a great place to work and make it a place that we want to own forever. So yeah we're focused firmly on staying private at this point. And just making it a great place to work and grow. It's smart too, because I've been seeing more physicians and dentists doing this, where they're starting their own DSOs that are owned by the group because you kind of get the best of both worlds, you get.\r\n\r\n\r\nThe economic upside, right? So whereas if your practice was there in Austin, 500, 000 a year in EBITDA, it's worth 1. 5 million.  You were, if you were alone, but with the DSO now, because you're lumped in with all of these other DSO, all these other dental practices,  your practice is actually worth 5 million. \r\n\r\n\r\nSo if you ever sold as a group, it increases the value of your individual practice. Because you're selling, you know, together as a whole. So that's, that's like the amazing upside, but you get to keep the control as a physician of the quality of the care that you're providing. I looked at doing a DSO about five years ago and my wife was like, if you do a DSL, I'll divorce you. \r\n\r\n\r\nBecause, because in her mind, she's like, Oh, gentle dental, West coast dental. All they're worried about is volume. They just want to get as much billable as they can and care suffers from it significantly. But in this model being dentist owned, I think.  I'm not saying that your incentives are not, are misaligned with private equity, but a business person is going to come in.\r\n\r\n\r\nThey're just going to think, how can we increase revenue? And there's potentially some incentives there that aren't necessarily aligned with the patient. Yeah, it's an interesting conundrum that you mentioned there, because there's a lot of.  DSOs that run practices. If you look at their Google reviews are terrible, you know, 3.\r\n\r\n\r\n5 stars, stuff like this. So it's not every single DSO, but there are some corporate places that give everybody else a bad reputation. And so we want to stay as far away from that as we can. Basically. I think some of that may have actually been practices. All they cared about was rolling up.\r\n\r\n\r\nThey knew they were making money because they were getting that multiple arbitrage. I'm just going to buy as many practices. I can. And they weren't running them well, but they continue to make money because they just lumped them together and were able to sell. So I think especially with a more challenging economic environment right now, it's actually really pushing everybody to actually operate well, run good dental practices.\r\n\r\n\r\nIf you run good dental practices, now they'll actually grow and now you can be growing organically versus just relying on this. This multiple arbitrage talk about the economics of a practice.  How do you acquire customers? So you talked about opening your own practice in Austin. You didn't go buy a practice.\r\n\r\n\r\nHow are you going out and finding new dental patients? Pretty dependent on the market, actually. So for example, think of a rural practice. A lot of times the problem is just having enough dentists. So you hang a shingle out in some rural areas and you'll be inundated with patients without doing anything.\r\n\r\n\r\nJust put a sign up. You'll have more patients than you need, basically. Versus in cities, a lot of times it's pretty competitive. There's a dentist around every corner. I mean, have you driven around lately and just looked at strip malls? There's a dentist in every single strip mall, you know? So it's kind of crazy.\r\n\r\n\r\nWe just drove to Salt Lake last week and I was like, how are there so many dental and orthodontic practices? Exactly. Yeah. Anyways, I agreed. Yeah. Yeah. So in big cities, it can be very competitive. So marketing is super important. That's something that we really focus on as a company. It's one of our core competencies.\r\n\r\n\r\nThat's what we. Put some of our marketing and management fees towards is doing marketing and we really hit on all fronts.  Yeah. What is marketing? Is it paid ads? Is it SEO? Is it, you know, in person boots on the ground? What are your marketing funnels? We try to do a little bit of everything. So five, 10 years ago Google pay per click was really cheap.\r\n\r\n\r\nAnd we kind of hit it hard on pay per click before other people were. So at the beginning, we grew our business a lot with pay per click you could buy clicks for so cheap, but we've really had to expand into a lot of different areas basically. So we're talking Google paid ads, Instagram paid, tick tock ads, actually billboards, direct mail in person boots on the ground with some of the orthodontists will get referrals from other dentists.\r\n\r\n\r\nSo really it's kind of like an all of the above strategy. Do you track what your customer acquisition cost is? Like, do you know how much it costs for you to acquire a new patient?  We do. So different channels are easier to track than others. So for example, our tick tock paid ads they all feed into the go high level CRM.\r\n\r\n\r\nAnd so we know exactly how many clicks we got, how much we spent. And then we track all those to conversion. Tick tock has been actually one of our greatest channels lately for orthodontic patients, a little surprising there, but you know, those are in the 50 to a hundred dollar per lead. Google pay per click on the other hand has.\r\n\r\n\r\nHistorically been a little harder for us to track all the way to completion, basically but those have gotten very expensive lately, you know, 200 plus, basically you know, with billboards, we would do a custom number. So we'd know exactly how many people are seeing per lead or per new client  per new client.\r\n\r\n\r\nYeah. All right. So let's just say it's 150 per new patient that you spend, you get a new patient. What is your lifetime value, I guess, for that patient, for an orthodontic patient, it's between five and 7, 000 to do braces for them. Yeah.  And then the cool thing, yeah, the cool thing for us is, you know, we have general dentistry and orthodontics in the same place.\r\n\r\n\r\nSo not only can we, get 6, 000 for braces from a patient that we bring in, but we might convert them to be a general dental patient and get cleanings, for the next five years. Or we might get the kid in and now all of a sudden the parents want to see the general dentist. So, to us, it can be very high on the lifetime values.\r\n\r\n\r\nSo like, essentially you're going to have 50, 50 times return on ad spend.  It's wow. That's wild. Do you know that that's good? Or are you like, Oh yeah, that's normal. Cause that's our practice.  Well, I mean, we definitely do some things very well, but if you've ever kind of been around orthodontists, you'll see that they spend a lot of money on advertising because they know that, you know, and they're like, I mean, even if you spent 500 bringing in a patient, that's actually going to be worth it because most of the time your overhead is 50%.\r\n\r\n\r\nSo you bring a patient in, they spend 6, 000 for braces. Generally, your profits going to be somewhere around 3000. It varies, but somewhere around 3000. Here's the other thing that makes it even better is it's kind of like a marginal profit margin, basically. So say you have 500 patients that you bring in every single year and your profit margin is 50%.\r\n\r\n\r\nWell, if you can bring in a 501st patient, you've already paid your rent, right? You've already paid all these fixed costs basically. So now your overheads even less than 50%, basically. So that's why you see orthodontists working very hard on marketing is because It almost always pays off to try to bring more patients into the practice.\r\n\r\n\r\nYou have 21 locations across the country. Can you talk high level? Like what's the average revenue per location and what's the average net income per location?  Yeah. So, nationwide, our practices are on track to do 65 to 70 million in revenue this year between all 21 of them. So three and a half million per location.\r\n\r\n\r\nExactly. Now there's general dental and orthodontics in each location. We build bigger clinics. So it's almost like there's three practices in each clinic in a sense. But once again, that drives our overhead down, keeps everybody more profitable.  Holy crap. Okay. So on three and a half, what's the bottom line performance on like just an average clinic?\r\n\r\n\r\nOur overhead is generally around, 50 to 55 percent overhead. When you think about it you're making profit as a doctor. So if you actually break out doctor pay, say you're going to pay an associate or you actually were like, well, I work in the practice. I need to pay myself type of thing.\r\n\r\n\r\nA lot of times that's maybe 30 percent of collections would be doctor revenue. If you were going to hire somebody or you're keeping track of it. So  often the actual true profit margin, is maybe closer to 20 percent or 15 percent in a practice. Okay. So let's just say it's 20 percent on three and a half million, 700, 000 a year is your net income. \r\n\r\n\r\nIs that before or after your fees to the DSL,  right? That's after. So that's profit after you've paid all those fees. And then I'm assuming you also have some distributions from the DSL as well. Correct. Yeah. If you're a regional partner.  Sure. Sure. Dude, that's, uh,  that's fascinating. All right. So I have some rapid fire questions for you to end this.\r\n\r\n\r\nAll right, let's do it.  What do you love about this business? I love transforming people's smiles. It gives people so much confidence when you actually give them a smile. They like you know, I'm still in the chair, doing real orthodontics at this point, who knows 10 years from now, maybe I'm just running the business, but right now I'm still doing clinical orthodontics.\r\n\r\n\r\nMan, there's, Nothing better than taking some of these braces off and just seeing them. Yeah. Sometimes I'll cry, you know, or they'll just be so happy about their new smile. So that's the best part is working with the people and making smiles. Now I read, I don't know if it's true, but I read that dentists have the highest suicide rate. \r\n\r\n\r\nProfessions.  So with that in mind, what do you hate about this business?  Yeah. Really it's kind of, uh, a couple of things that, are the worst  part of it is just, you know, employee headaches. I think most dentists would agree with that basically. So, you know, maybe trouble with your staff or your employees or, things along those lines.\r\n\r\n\r\nSo employee headaches. One other thing I dislike about dentistry is that you have to do all the work in person. So, uh, sometimes I'm, you know, I wish I could work remotely if they can make a hologram of myself so I can be able to practice while I'm at the beach, you know, in San Diego or something like that, that'd be amazing.\r\n\r\n\r\nBut sometimes dentists feel like a little bit trapped at their practice, you know, like if you, if you're gone, like the show, doesn't go on. I joke, I can't have sick days, like if I'm not there, like the practice doesn't run. I'm not allowed to be sick, you know. Attorneys are that way?\r\n\r\n\r\nCFO or CPAs are that way? Physicians are that way? Because it's like your billable hours are your income. Yeah, exactly. Yeah, it's sort of that's 1 of the drivers for me of wanting to build a group, so that, you know, you can have it's not just me in a single practice working all the time and it's not running if I'm not there. \r\n\r\n\r\nAll right. So that being said,  Leads into my next question.  Everybody's jealous of everybody for some reason or another, right? We all like, Oh, grass is greener on the other side. It doesn't mean that we want to do that, but there are aspects to it that we're jealous of. What business are you jealous of right now? \r\n\r\n\r\nYeah,  it kind of spins off of that. It really is people who can work remotely that I'm jealous of. You know, this one time  this family was in the practice and they're like, yeah we'll need to get started on braces a couple of months from now. We're spending the summer in Montana. \r\n\r\n\r\nThere's working from home from a cabin in Montana. And I was like, man, my friend,  the tech industry, I have a little jealousy about the tech industry, you know, cause there's this neat mix of there's some incredible W2 jobs, if being an entrepreneur is not your cup of tea basically, but also there's incredible businesses that can be built in tech.\r\n\r\n\r\nSo, yeah I'm not sure if I would trade necessarily, but definitely some jealousy of tech bros working from home. Yeah. Okay.  What are you obsessed with right now? And by that, I mean, if you have two hours in your day, family's not home, you don't need to worry about work. What are you doing? What are you spending your time and your energy on? \r\n\r\n\r\nYeah. Yeah. So,  it's kind of the operations, the practice at this point, you know,  new patient flow, just kind of making sure that we nail that new patient funnel. Now when you're kind of thinking that's like in the moment. Yeah. So like if I had free time, I'm immediately going to go to operations in the practice. \r\n\r\n\r\nWhen I step back just a little bit though, it's like opening new locations. Like that's what kind of makes me kind of passionate and everything is, it's just really exciting opening new locations. So that's the long term obsession, is getting that next location open. Last question. What advice would you give yourself 10 years ago? \r\n\r\n\r\nThat's a great question. I think it would be trying to keep things in balance. And I actually got this advice from a mentor probably just at the right time. I was in the army and doing some moonlighting. And he told me, he's like, which do you think you're going to want back 10 years from now?\r\n\r\n\r\nYou know, a few extra shifts, a little extra money in the bank account at that point, or, you know, some time that you spent with your kids when they were little. And so I think, fortunately, I got that advice from somebody 10 years ahead of me, but I'd probably give that advice again to myself, basically, is keeping a balance.\r\n\r\n\r\nYou know,  we're always wanting to be achievement oriented and successful. And sometimes it's not even about the money, you just want to build something. But just making sure that you don't sacrifice the things that are more important along the journey.  It's great advice, man. I love it.\r\n\r\n\r\nWell, this has been a awesome conversation. I definitely learned a ton where can people find you? Where's the best place to get connected with you?  Yeah. So, they can visit our website, celebrate dental. com or I'm actually on Twitter as well at the DSO guy. Okay. Awesome. Well, this was fantastic, David.\r\n\r\n\r\nThank you. Look forward to having you on again in a couple of years when you're exiting for 500 million. Yeah. Hopefully. Yeah. Great talking with you. Nix is fun. All right. Thanks, man.",
  "metadata": {
    "duration": "",
    "date": "2024-07-22",
    "platform_source": "Google Drive"
  }
}