{
  "episode_number": "85",
  "episode_title": "TOP PICK! How to Build an 80% Margin, $3M Online Trade School on 2 Hours/Day, with Hector Resendez",
  "guest_name": "Hector Resendez",
  "business_name": "Online Trade School",
  "transcript": "﻿Nik (00:01.071)\r\nAll right, Hector, welcome to Niconomics. Let's jump into this thing. Tell me, what do you do and how do you make money?\r\n\r\n\r\nHector (00:08.812)\r\nGot it. Well, I'm glad we're here because I could get to put my in -laws to peace of mind because they think I'm with the cartel. But my own online trade school. No one's ever heard of online trade school because they all think you still got to go to in person to learn trades. But I debunked that idea and it's been fun, man. I'm here on a journey with you guys and trying to spread word about a grant that scaled my school that no one talks about.\r\n\r\n\r\nNik (00:36.859)\r\nSo help me understand because I'm in the minority as well. I think of trade schools working with your hands in particular, right? So when you tell me an online trade school, it just doesn't compute for me. Like what is an online trade school?\r\n\r\n\r\nHector (00:39.406)\r\nAll right. Yep.\r\n\r\n\r\nHector (00:47.952)\r\nMm\r\n\r\n\r\nHector (00:51.288)\r\nSo online trade school is exactly what you think. I teach beach vac, plumbing, electrician, all apprenticeships, delivered online. We were birthed during COVID and we stayed online because if you think about it, what do all those trades have in common? They still have to go take a test on a computer and the computer is not gonna care if you could climb a ladder, pull wire, unclog the toilet. Did you memorize enough theory or pass the test?\r\n\r\n\r\nIf you think of online, you get on these big old planes and they learn virtually through simulators and you trust them so they could trust our students too.\r\n\r\n\r\nNik (01:29.041)\r\nSo like, I know there's a lot of nursing schools online. There's a lot of theory, theory, book learning, all that stuff. They've still got to do the practical pieces, maybe, you know, with somebody in person, but you're essentially delivering the curriculum that you would otherwise learn through a book. You're just not doing it online.\r\n\r\n\r\nHector (01:32.972)\r\nYeah. That's all. Yep.\r\n\r\n\r\nHector (01:49.422)\r\nOkay, we're doing it with VR goggles, gaming style. yeah.\r\n\r\n\r\nNik (01:52.656)\r\nAre you really?\r\n\r\n\r\nWhat? Okay.\r\n\r\n\r\nHector (01:56.4)\r\nWhat?\r\n\r\n\r\nNik (01:59.331)\r\nAll right, I'm gonna get, we'll get into that. That's gonna be amazing. So you said this happened, this guy kind of got rolled out during COVID. I'm assuming it's because everything got shut down and they're like, we don't want you meeting in person. it sounds like there were some grants given by the government. Will you kind of walk through like how online trade schools came about?\r\n\r\n\r\nHector (01:59.47)\r\nHere we go. Buckle up. You got it. All right.\r\n\r\n\r\nHector (02:08.418)\r\nYes.\r\n\r\n\r\nHector (02:18.572)\r\nYeah, so accidentally happened. I used to be a VP for a large financial company. One of my ex -employees reached out to me.\r\n\r\n\r\nNik (02:26.043)\r\nHey, me one second, sorry. Hey buddy, what's going on?\r\n\r\n\r\nCan you say hi to Hector? Can you say hi, Hector? Yeah, one of metal. What's up, You're all wet. I'm going to take you to mama, OK? OK. All right.\r\n\r\n\r\nHector (02:36.654)\r\nYou win the Olympics? You!\r\n\r\n\r\nHector (02:51.169)\r\nOf\r\n\r\n\r\nHector (02:55.832)\r\nyou\r\n\r\n\r\nNik (03:22.012)\r\nSorry. I'll tee you up again with that question. He's our two year old, our youngest one. Yeah, so tell me about how this kind of came about through COVID. It sounds like there were some grants given that incentivize people to do these trade schools online.\r\n\r\n\r\nHector (03:22.978)\r\nYeah, you're good, man. All good.\r\n\r\n\r\nHector (03:40.91)\r\nSo fun fact, the grant has always existed. You know that foodstay exists, right? OK, so same funding source. this grant is called WIOA, Workforce Innovation Opportunity. At Google, WeO, and Idaho, you'll have to go to those little offices that are called Workforce Solutions, or Idaho Works, or whatever it is. But if you Google it, this grant's always been there. But it was always for blue collar, like CDL drivers, and welders, and\r\n\r\n\r\nNik (03:50.245)\r\nReally?\r\n\r\n\r\nHector (04:10.306)\r\nBut the grants been, you know, to do anything because the government spots behind us is if we pay for your trade school and you learn a new skillset and you earn a decent hourly wage, we get you off benefits and now you're paying taxes. So the grants always existed. Why do they keep it a secret? I don't know. Well, I got familiar with it. yeah.\r\n\r\n\r\nNik (04:28.251)\r\nWho, it's a federal, so it's a federal grant though. Who administers it? Is it Medicaid? No.\r\n\r\n\r\nHector (04:34.326)\r\nNope, no, no, the grand, it's the labor in D .C. like the big wigs. It's always it's always been there.\r\n\r\n\r\nNik (04:41.935)\r\nWow, okay, so it's always existed. How did you find out about it?\r\n\r\n\r\nHector (04:44.866)\r\nSo an ex -employee called me that worked for me a long time ago. And at the time, short stint, I bought an insurance franchise that didn't work out. But the silver lining behind this was he called me for a CDL truck insurance and school insurance. So I was like, wait a minute, I can't help you with either, but who, what do you mean about school? And why would somebody give you a school? How do you even own a school? But if you think about it, these little vocational schools are owned by somebody, Bob's, know, trade school or whatever, or Nick's vocational school.\r\n\r\n\r\nI just, man, I never knew it was a business. So I went down there, I saw what they had. They're in a big parking lot with like a, what's it called? Like a portable building, like a little trailer. And they're teaching people how to do trade school. I mean, how to do CDLs drivers. And the brother, his brother is the one that figured it out, cause he's the one that got the grant to do the CDL license. So when they opened up a school and I'm like,\r\n\r\n\r\nNik (05:24.165)\r\nYeah, sure.\r\n\r\n\r\nHector (05:40.654)\r\nmean, there's like 20 people here. are you doing this? Like, man, the state of Texas has this grant and, you know, it pays for if you're unemployed, dislocated worker, military spouses, if you're low income, if you're on food stamps. And I'm like, dude, I went down a rabbit hole for like a week and I figured it out. I'm like, man, I love your concept. I think you're doing it wrong because it's trucks are going to break down. You're in person. The DMV shut down. Like, I want to deliver this like online only. Let me see what courses. And I'm being honest to me.\r\n\r\n\r\nNik (06:03.653)\r\nYeah. Yeah.\r\n\r\n\r\nHector (06:10.987)\r\nWe've heard of online schools this whole time, just no one's delivered it only online.\r\n\r\n\r\nNik (06:14.993)\r\nSo what year was this? it was this during COVID? OK, so yeah, we're in the craziness of COVID 2021 and you think we should do this online. How many people were doing it online at the time?\r\n\r\n\r\nHector (06:17.902)\r\n2020. Yeah. 2020.\r\n\r\n\r\nHector (06:27.566)\r\nI mean everyone was that's a big university or community but not like a individual person like me and you where people people most schools start off with the grant but they go quickly to get accreditation so they could get FAFSA loans grants and all that stuff I don't I didn't have that kind of vision I'm just like man the state of Texas is giving you 10 grand at the time five grand per student and you're teaching them a trade perfect I found out that five grand only ten grand\r\n\r\n\r\nSo let's take a text.\r\n\r\n\r\nNik (06:56.911)\r\nWait, so they're giving you the money?\r\n\r\n\r\nHector (06:59.63)\r\nyeah, not the suitor. Net 30.\r\n\r\n\r\nNik (07:03.934)\r\nmy gosh.\r\n\r\n\r\nHector (07:05.24)\r\nI know. I know. It's crazy. I'm scared to say it, but here I am.\r\n\r\n\r\nNik (07:06.939)\r\nThat's insane!\r\n\r\n\r\nNik (07:13.317)\r\nYou know what, for your in -laws, you actually are a part of the cartel. This is cartel -like behavior, Hector, okay?\r\n\r\n\r\nHector (07:17.101)\r\nYes.\r\n\r\n\r\nHector (07:20.727)\r\nBelieve me, heard that says a lot of times sweetheart you married the wrong Mexican because I don't do any labor Zero zero\r\n\r\n\r\nNik (07:28.548)\r\nYou\r\n\r\n\r\nAll right, so a lot of these schools get into it, like you said, because they want to get into FAFSA and some of these other federally guaranteed or backed programs, because I mean, we've seen this over the last 30 years in particular, the price of higher education has just skyrocketed. Part of the big reason because it's skyrocketed is because the government subsidizes student loans. these, I guess, vocational schools are probably looking at it saying,\r\n\r\n\r\nWell, cool. This is a nice little grant. That's nice to have little grant money, but we want access to the big dog. We want access to federal money, so let's.\r\n\r\n\r\nNik (08:10.869)\r\nSee, I'm the freaking worst today. Hold on. My mic died.\r\n\r\n\r\nHector (08:14.318)\r\nOkay. What's this uploading meme on the 98 % stuff?\r\n\r\n\r\nNik (08:23.544)\r\nSo as we record, it uploads first to your computer and then it uploads to the cloud. So if anything happens, even if it looks, even if my picture looks like grainy right now or your picture looks grainy, it's going to look really good after we're done because it's recording locally. So it's just saying this is how much of your recording has actually been uploaded. All right. So here's what I'm going to do. I'm going to...\r\n\r\n\r\nHector (08:30.605)\r\nGot it.\r\n\r\n\r\nHector (08:41.484)\r\nOkay.\r\n\r\n\r\nHector (08:52.16)\r\nOkay.\r\n\r\n\r\nHector (00:00.343)\r\nYes.\r\n\r\n\r\nNik (00:00.704)\r\nAll right, so. So a lot of these a lot of these universities are looking at this saying we want to go after the big dogs. We want to get access to this other funding. Who cares about the WIOWIAOWIOA grants? Let's move forward. You didn't take that stance. You're like, wait, why are we forgetting about this? Let's lean into this thing.\r\n\r\n\r\nHector (00:23.8)\r\nI love it. I fast forward. I I opened up the school like the wrong way. I mean, not the wrong way. It's lesson learned. You know, I took an investment. I took shareholders and I opened up with teachers because I thought you needed teachers to write curriculum. Fast forward now. I privately all our courses now. So let's just say I buy the course for a thousand bucks. Hypothetically speaking, if Texas did be 10 grand, you could do the margins math there. So it's pretty fun.\r\n\r\n\r\nNik (00:50.094)\r\nDude, all right, I don't even know where to start. Let's.\r\n\r\n\r\nLet's back up. What's your background?\r\n\r\n\r\nHector (00:55.691)\r\nOkay.\r\n\r\n\r\nDefinitely not school. If you notice my handle, I got a PhD, which is a public high school diploma.\r\n\r\n\r\nNone. I've been in sales my whole life. I sold my soul to the devil early when I was 18. was either college wasn't an option. I'm from South Texas, border town, poor. My parents did as best as they could for me. They loved me. They raised me. you know, I just something about selling and talking to people I love. So I ended up doing timeshare sales, my very first sales job. And so when I say I sold my soul to the devil early, I\r\n\r\n\r\nNik (01:08.462)\r\nOkay?\r\n\r\n\r\nHector (01:34.732)\r\nA lot of people out there don't like me, but I sold them some useless time sharing. I got really good at sales.\r\n\r\n\r\nNik (01:40.098)\r\nSo you just started selling, it sounds like you had an insurance franchise. Have you just been a serial entrepreneur? You've of just been doing different things.\r\n\r\n\r\nHector (01:47.614)\r\nNo, that wasn't my first really crack at it. I failed at it. I failed at a lot of things. I started a grass painting company, like spray painting grass, real estate. Remember the little real estate books where you only bought real estate back in the day? Maybe? No?\r\n\r\n\r\nNik (02:00.332)\r\nYeah. No, yes, yes, I know exactly what you're talking about.\r\n\r\n\r\nHector (02:04.216)\r\nYo, would, I somehow, you know, was barely playing any golf. I was golfing one time and I saw the guy spraying grass. I'm like, huh? And I'm like, our yards are terrible. a buddy of mine was a realtor and said, hey man, if you come spray my grass before I take pictures, I'll pay you 200 bucks. I'm like, interesting. And I started a grass painting company that flopped. I tried to do mortgages that flopped. So I fell a couple of times and embraced it. then.\r\n\r\n\r\nBut the majority is I did go, you know, I rose the corporate ladder. The highest I went in sales for industry was a VP. So I've always made decent money. I retired my wife nine years ago. She raises our kids full time. you know, being in commission sales and that kind of organization has just always been my cup of tea.\r\n\r\n\r\nNik (02:45.528)\r\nYeah.\r\n\r\n\r\nNik (02:49.102)\r\nTell me how, like what was appealing about this grant program and doing the vocational schools online? Cause that's a, that's a very broad background from painting grass to working corporate sales. Like obviously the through line is sales. Are there a lot of sales associated with this W W I O A grant?\r\n\r\n\r\nHector (03:02.22)\r\nYes.\r\n\r\n\r\nHector (03:07.544)\r\nAt first, yes. So no one knows. I mean, no one scaled it like I have, right? On a grant only. I don't do any self -pay till recently. We'll get into that later. I did it all on grants. The sales was my sister actually worked as a counselor at one of these offices giving out the grant. So I had an unfair advantage. And she told me, hey, you're going to build a school. You want to do these things, talk to counselors this way. you know, during 2021 when you couldn't do in -person visits still, I called. So remember who our audience is.\r\n\r\n\r\nlow income on food stamps employed transitional living women's shelters over living shelters. I called everyone in Texas that has a nonprofit women's shelter or whatnot. Cause we started off as a healthcare school and I called them. I'm like, Hey, do your applicants or residents want to go back to school for free? And on top of that, I'm gonna give them a free laptop. There's at least I could do when Texas is giving me 10 grand, right? So I go to that Walmart that you know a lot to buy laptops.\r\n\r\n\r\nNik (03:39.5)\r\nUnemployed. Yep.\r\n\r\n\r\nNik (04:05.963)\r\nyeah.\r\n\r\n\r\nHector (04:06.518)\r\nYou know me by first name, like, what's up, Judy? mean, everything. But so I called all the nonprofits and I get unlimited leads because why wouldn't they want the residents getting a free skill set before they leave their environment? And I pretty much broke the broke the ground, broke the Internet because to this day I get unlimited leads because I mean, I'm calling Nick's foundation. I'm like, hey, Nick, I see you a women's shelter where they want to come back to school, learn a trade. And by the way, I'm a throw my free laptop. They're like, well, catch.\r\n\r\n\r\nNik (04:34.702)\r\nSo, okay, give me an idea right now of the size and scope of your business. What are you doing in revenue? What are you doing in bottom line? How many students do you have going through your courses per year?\r\n\r\n\r\nHector (04:46.168)\r\nWe've done 350. We're doing about 20 to 25 a month. Every county has a different training cap. where Texas maxed out at 10, Austin maxed out at 7 ,500 for the same grant. just have different. Correct. So I don't know, a decent month's 180.\r\n\r\n\r\nNik (04:51.854)\r\nTop line.\r\n\r\n\r\nNik (05:01.966)\r\nIs that 10 ,000? Okay.\r\n\r\n\r\nNik (05:09.858)\r\nAnd at what point did you realize, could be a real business. I should lean into this and just continue operating.\r\n\r\n\r\nHector (05:18.424)\r\nWhen I saw what my buddy was doing, I mean, he was doing 10 students a month at $4 ,500. I'm like, between him and his brother, that's $45 ,000. That's not too shabby, but you if you went online only, you can really scale this. And because I'm online only, I have access to the whole state of Texas. you know, Nick that lives in Odessa with no options, I could help him out.\r\n\r\n\r\nNik (05:39.084)\r\nBut do you have to be, like, do you have to get approved or vetted county by county? Because you said there's a county cap. Do you have to get credentials essentially to say like, yes, you are approved educator within McLennan County?\r\n\r\n\r\nHector (05:47.021)\r\nyou\r\n\r\n\r\nHector (05:52.984)\r\nSure, good comments right next door. That's in Waco, good job. Threw me off. But yeah, so you get access to the state of Texas and then Texas does have 28 different little region board deals. And some of them make you go through like a small little step. But mainly what it is is are your courses on our target occupation list, meaning medical assistant, policy technician, CDO drivers. Each county has a different what they deem on demand list. So if you go closer to Houston and the coast,\r\n\r\n\r\nNik (06:00.45)\r\nAlright.\r\n\r\n\r\nHector (06:22.22)\r\nThat's going to be like welders and boat technicians. And, you know, if you go out in the rural East Texas, West Texas, that's going to be like pipe fitters, oil this, oil that. And so I just try to stick to courses that would meet as many target occupationalists possible. And when we first started off, we started off with medical assistant, pharmacy technician, medical billing, coding, things like that.\r\n\r\n\r\nNik (06:42.498)\r\nHow did you know to pick those ones? was there a list that the county or the federal government has that says, are the types of courses we will reimburse?\r\n\r\n\r\nHector (06:49.921)\r\nYeah, yeah, that goes back to what I was just saying. The target occupation list varies by region. So I just put it all on an Excel sheet. I saw which were like the top four on all the regions and just went with us.\r\n\r\n\r\nNik (07:01.934)\r\nLike, what does the accreditation process look like?\r\n\r\n\r\nHector (07:05.762)\r\nSo we're not accredited, we're licensed to the state of Texas. To be actually accredited, that allows you to go to cross state lines and then now you're a big boy school. That's in the future.\r\n\r\n\r\nNik (07:15.896)\r\nOkay, so the state of Texas, so you're licensed by the state, you're paid by the federal government, but the federal government needs to see your license before you can bill them.\r\n\r\n\r\nHector (07:25.976)\r\ncorrect. Well, they don't have to see it. So when you're licensed, we're called an eligible training provider, ETP list. If you're on the ETP list, you're getting grant money.\r\n\r\n\r\nNik (07:36.814)\r\nETPLS dude, you are blowing my mind right now. So I come from the world of home health and hospice, is 99 % of our revenue is government revenue, right? Medicare, Medicaid, managed plans, et cetera. So I know that anytime you're working with the federal government, you've got a credentialing process you have to go through or licensing process, whatever you want to call it. And then because of our federal system, we've got state requirements, in some instances, county and city requirements. So we're in a similar position where\r\n\r\n\r\nHector (07:42.36)\r\nI don't know.\r\n\r\n\r\nNik (08:06.54)\r\nthe state gives us accreditation that give us licensure. And then once the state gives us licensure, we can then go to the federal government and say, hey, we're an accredited home health and hospice agency. Please pay us, you know, see our credentialing. But essentially the federal government is outsourcing the licensing and accreditation to the local states to decide how they want to administer. How did you learn that process? Like, is it a pretty easy process or like how long did it take for you to go from, hey, I'm in my buddy's trailer. He's got\r\n\r\n\r\n10 students at $4 a month to first check hit. I got my first $10 ,000. Like what was that process like?\r\n\r\n\r\nHector (08:45.216)\r\nSo about five months.\r\n\r\n\r\nNik (08:48.108)\r\nThat's not long,\r\n\r\n\r\nHector (08:49.674)\r\nIt's because it's Texas. There's no waiting period. Some states have an actual waiting period. They want you to do a self -pay model and kind of prove it before they give you access to the grants. Also, no one knows how to do it. It's not a big deal when advertises. know, it's like going through the state. Like when I said online school, they were just like, what? And you know, back in\r\n\r\n\r\nNik (09:07.438)\r\nDid you pay like a consultant or were you just reading up on it online? Did you make friends with somebody at the state and they walked you through it? Like again, I'm coming from that perspective of it took me a long time to figure out home health and hospice, how to actually get licensed in these places. And now granted it's healthcare. So it's much more heavily regulated than I would assume education, but how did you get up to speed? Was it just Googling?\r\n\r\n\r\nHector (09:14.806)\r\nMagic. Yeah.\r\n\r\n\r\nHector (09:32.008)\r\nNo, I, I don't, I officially helped my buddy scale and obviously he paid me after a while. Cause I mean, he didn't have a CRM. So I knew that stuff, right? Like I've always known KPI CRMs automation. So I'm like, dude, you're, you're, you're working on post -it notes, right? I'm like, you gotta get so much. And they love it. They're still doing it to this day, but you know, I had a different vision and I just read on it and I'm just like, man, I called around other schools. None of them have a script, like even a simple call in, I want.\r\n\r\n\r\nMedical assistant. OK, it's two grand. Class start every month or whatever. And that's really it on my name. I come from such a sales background. I'm like, Nick, you want to be a medical assistant? Well, why do you want to be a medical assistant? What do you currently do now? you paycheck to paycheck. Come on in, man. Let me put you on a video call. Let me show you how to do this online. So it's just just automating it, man. Just selling it. And like I said, it's not much of a sale. It's free grant. It's just then what I got really good at is showing people how to fill out the grant so they get approved. Because if you just walk. Yeah, if you just walk into the center.\r\n\r\n\r\nNik (10:27.31)\r\nOkay, that's\r\n\r\n\r\nHector (10:30.144)\r\nand you're like, hey, I'm unemployed, I lost my job. They're going to do this to you, right? And they're going to say, go fill this out. And no one knows what to do with this stuff, right? And so I got really good at that. I even got so good, I convinced a counselor after numerous Chick -fil -A attempts of lunch to go on video with me and show me how to fill out the paperwork. And I recorded it. And now I shoot that to the students. They get approved.\r\n\r\n\r\nNik (10:53.326)\r\nSo tell me about the curriculum, it's an education program. There's obviously the curriculum, and then there is the practical practicum. I don't even know what you call it. You probably have to have a certain number of hours of apprenticeship. Yeah, depending on the trade, I'm assuming. How do you find the education piece, the curriculum?\r\n\r\n\r\nHector (11:13.092)\r\nThat's the secret, right? That's what I have and I charge people for. The curriculum I accidentally found, the one that private labels it. So the curriculum, this company I found, they sell it to military and government, like in the masses. I wasn't their target demographic, but after talking to them, I'm like, why wouldn't you? Like, you have this piece, you figured it out. I'm like, just sell it to small schools, like for whatever you want to sell it for, because then we'll just mark it up. So that's how we found it.\r\n\r\n\r\nThe curriculum is not what matters. It's the exam they go take that has to be nationally accredited. So for example, HVAC. HVAC, you have to get an EPA 608 test. That allows you to touch refrigerants and coolants, right? And again, that computer's not going to care if Nick went to in -person school and Hector went online school. Can you memorize enough theory to pass the test? And then you guys are business owners. Think about it. In any of your businesses, you don't let me go in there and do the stuff I want to do. You're going to train me how to do the things.\r\n\r\n\r\nSo this is owner out there, I'm like, I don't care what hands -on experience you've got. The way I want to do things here is A, B, and C. So most employers, you know, they don't care about the hands -on. You learn that in the field. Like just, just like anything else. So we teach you enough to be dangerous, to know and have the conversation, but man, you learn on the field. Every HVAC owner is not going to throw keys at a work truck to the guy on the first day. You go shadow sell 30 days.\r\n\r\n\r\nNik (12:33.848)\r\nNo.\r\n\r\n\r\nBut I'm like physical therapy, I know. And in order to do physical therapy, you've got to go through some school, you've to get your doctorate, but you've got to get, I think it was 2000 hours, I could be totally wrong here, but it's a lot of hours in the clinic in order to get your license. And there is a written piece, but there's also an hours hurdle that you have to hit. Is there an hours hurdle that somebody for an HVAC, I don't even know, it a license?\r\n\r\n\r\nHector (13:01.368)\r\nIt's a license on HVAC, but it's just the EPA license. That's it. They also get an OSHA term. But so you're right on the hours for electrician and plumbers. Here, we just give them a basic certificate that said, hey, you took so many hours, you understand the language. Then those do have to complete 8 ,000 hours before they could get their journeyman.\r\n\r\n\r\nNik (13:22.19)\r\nSo it depends on the vocation.\r\n\r\n\r\nHector (13:24.342)\r\nYep. But with HVAC, there's no license. There's no hours. Once you're licensed, you're licensed. EPA. Now, you have to do it for so many years and become a contractor license to go open up your own. But as soon as you pass our little rinky dinky EPA test, off to the races.\r\n\r\n\r\nNik (13:39.128)\r\nWhat about like, okay, medical coder? There's a national federal test in order for them to be a med -\r\n\r\n\r\nHector (13:44.022)\r\nYes, it's called H .A. National Healthcare Association, recognized nationwide.\r\n\r\n\r\nNik (13:48.718)\r\nAnd what's it called when they pass that? They're just a certified medical biller.\r\n\r\n\r\nHector (13:52.979)\r\nYeah, NBC certified. Yeah, it's just a certification. Like they completed so many hours and the certification, like I said, no one knows who my school is, no one knows who I am, but everyone knows who the EPA 608 is in that world. So if you that in your wallet, you could come work on a truck and work on a house.\r\n\r\n\r\nNik (14:10.606)\r\nHow long does it take? So the state of Texas gives you $10 ,000, depending on the county. They give you $10 ,000. How long does that 10 ,000 work for? Is this like a two year program? Is it a six week course? Does it depend on the vocation? what, how much time are you given to fulfill essentially the training, the courses?\r\n\r\n\r\nHector (14:28.76)\r\nThe courses are 80 to 100 hours. That's it. They're done in two to three minutes.\r\n\r\n\r\nNik (14:34.476)\r\nWow. What's your completion rate on the courses?\r\n\r\n\r\nIs that good or bad? I have no idea.\r\n\r\n\r\nHector (14:42.904)\r\nWell, college is 44%, so we're doing pretty good.\r\n\r\n\r\nNik (14:46.766)\r\nWell, sure, college is 44%, but college is not 80 to 100 hours. College is probably, it's four years, right? So.\r\n\r\n\r\nHector (14:53.132)\r\nSo again, the difference between us and like a vocational school, have to go in person. They fluff up the hours with lab hour, resume building, whatever. They do at least 300 hours to qualify for all the grants and loans and fast -flight and everything. We just stripped it down to the curriculum to go pass the test.\r\n\r\n\r\nNik (15:08.43)\r\nYou don't care about that.\r\n\r\n\r\nNik (15:13.12)\r\nIs it capped? Is there a number of students that you're capped at? Or is the cap just the revenue per student, depending on the county?\r\n\r\n\r\nHector (15:23.32)\r\nJust a revenue pursuit. is. It probably shouldn't. It probably should be capped because we broke certain counties. I mean, when we did our monthly review, I mean, we did more enrollments in Austin Community College in Austin, at least for the grants, not in that traditional. yeah, like if Austin County has a or Travis County has a cap of a million, we probably got 800 ,000. The only reason we do that is because we could process them so fast because we streamline the process.\r\n\r\n\r\nNik (15:50.232)\r\nHow does the government, so again, I'm going to Home Health and Hospice. How do they monitor fraud in your space? Because in hospice, for example, if a hospice company is keeping people on inappropriately, there is a mechanism. It's called the CAP and it's something that the federal government monitors. I'm assuming there's something that the government looks at, whether it's completion rate, whether, I don't even know, but what do they look at?\r\n\r\n\r\nto essentially assess whether or not you're doing a good job as the vocational school.\r\n\r\n\r\nHector (16:20.952)\r\nSure, good question. All of it. We get annually audited and biannually audited and you have to have a certain completion rate, let's call it 70 % completion rate to stay on the ETPL list, remember to get the grants. If not a 70 % completion rate, we have to get 60 % of those jobs.\r\n\r\n\r\nNik (16:32.674)\r\nWow, yep, yep.\r\n\r\n\r\nNik (16:40.43)\r\nSo do you have to track after they graduate whether or not they got jobs and then show the documentation to the federal government when they come and do the audits like, yep, Jason Jones got a job here. Like what's the documentation you have to show to prove.\r\n\r\n\r\nHector (16:43.712)\r\nThank\r\n\r\n\r\nHector (16:52.416)\r\nIt's an Excel spreadsheet and it's still manual like a folder, like Manila folder, we have a ton of them. Unfortunately, it's old school like that. The same is going to go to the cloud, but yeah, we have to keep it on the record for two years in case any changes. But we do really well with that. We give incentives like, hey, you know, we'll buy your first work boots if you tell us where you land or whatnot. And so we get involved in the counties love that.\r\n\r\n\r\nNik (17:13.646)\r\nSo back at the envelope math, 40 ish percent. So it's 60 % of the 70 % that graduate need to have jobs.\r\n\r\n\r\nHector (17:21.174)\r\nYes, it really is extremely, you know how easy it is to get somebody a job in these apprenticeships? easy. If you show up to the interview sober, you're getting the job.\r\n\r\n\r\nNik (17:27.955)\r\nyeah, for sure. Is there a\r\n\r\n\r\nNik (17:34.188)\r\nIs there a time period or they like, Hey, they have to have found a job within two months.\r\n\r\n\r\nHector (17:38.432)\r\nNot necessarily, and if there is, don't know about it because it takes an hour to find them a job. We partner up with staffing companies and they call us all the time like, dude, we need your leads. And because we're not charging them anything, we don't care about the placement fee or anything. We're like, dude, just place them and they love us for it.\r\n\r\n\r\nNik (17:42.754)\r\nYeah, yeah,\r\n\r\n\r\nNik (17:54.83)\r\nSo what are your margins on a business like this?\r\n\r\n\r\nNik (18:00.398)\r\nThey're like SAS like margins.\r\n\r\n\r\nHector (18:03.192)\r\nYeah, well, I think about it. mean, we're private labeling a course for a thousand bucks and we're selling it for 10. I mean, obviously we buy a laptop. There's, you know, some hands exchanging and things and phone calls to be made, but it's pretty crazy.\r\n\r\n\r\nNik (18:14.892)\r\nWhat if somebody wants office hours? What if somebody wants extra tutoring? Or what if somebody wants extra support? Do you have a staff that does those things or is it all within?\r\n\r\n\r\nHector (18:23.096)\r\nWe do have a staff, but the questions are the same. So we're recording loom videos and frequently asked questions and that kind of knocks out 90 % of the questions.\r\n\r\n\r\nNik (18:31.49)\r\nWow, what do do with people who have questions that you haven't answered in the loom?\r\n\r\n\r\nHector (18:34.981)\r\nwe're a school. We're only open from nine to five or send in an email.\r\n\r\n\r\nNik (18:40.878)\r\nDude, is, so from 2021 to today, you've been doing this and you said right now you're doing between three and $400 ,000 a year in top line revenue.\r\n\r\n\r\nHector (18:51.096)\r\nNo, 200 a month. did 2 .4 our second month. We're on pace to do 3 million this year. I know.\r\n\r\n\r\nNik (18:59.086)\r\nOkay. Okay. Wow, tell me what your team looks like. Tell me what like like what is your administrative team look like? Obviously there's there's you. Do you have a sales team?\r\n\r\n\r\nHector (19:07.264)\r\nI love it.\r\n\r\n\r\nHector (19:14.476)\r\nYeah, two enrollment people, two success coaches. They're like the teachers that we hired that, you know, come on, Nick, you could do it. Log in a little more or. No, they're all here.\r\n\r\n\r\nNik (19:24.558)\r\nAre they onshore or offshore?\r\n\r\n\r\nOkay, so you have like an office that they work out of.\r\n\r\n\r\nHector (19:31.658)\r\nYeah, we're all home. started off with a big old office. We looked the part. We bought vera desks and coolers and we thought we were a startup and boy, no one came. I who's going to come? It's an online school. We deliver them the laptop. We moved out of it. It was a WeWork. We worked right in bankruptcy in Las Calinas and Irving and we moved out of there and then now we're home.\r\n\r\n\r\nNik (19:45.539)\r\nYeah.\r\n\r\n\r\nNik (19:54.222)\r\nDude, do you just do you, Texas?\r\n\r\n\r\nHector (19:57.824)\r\nYeah, we can only do Texas because until you get accredited, you could go past the lines.\r\n\r\n\r\nNik (20:03.383)\r\nWhat if you wanted to go to Oklahoma? How would you do that with the current model that you're doing? You'd have to partner with somebody who lives in Oklahoma.\r\n\r\n\r\nHector (20:07.552)\r\nSome. Yep.\r\n\r\n\r\nNik (20:11.086)\r\nThat's really interesting, Dude, okay. How do you, let's talk about, let's talk about some of the mechanics of the business. How do you acquire customers right now?\r\n\r\n\r\nHector (20:12.832)\r\nYep. I know. I'm scared to tell you.\r\n\r\n\r\nHector (20:23.512)\r\nfor free. Remember all the nonprofits. They send us leads. Hey, I'm at a women's shelter. There's 50 of them. They leave every month and I go into a zoom call. They put me on a whatever on a screen somewhere and all of these women, they're like, obviously I can't see them, but they can see me for privacy reasons. And I just give them a pitch who wants to go back to school for free and get a free laptop. A whole bunch of them send me their emails directly and we get on a call and we sign them up.\r\n\r\n\r\nNik (20:50.894)\r\nSo are you doing any pay -per -click, any SEO, any direct mailers, any traditional marketing? No, but you had to.\r\n\r\n\r\nHector (20:58.188)\r\nNope. We've done nothing. I sent pizzas and chip for later.\r\n\r\n\r\nNik (21:03.99)\r\nyou had to build those relationships first, right? Like you've gotten to that place now, but you first had to then go to the women's shelters, go to maybe addiction recovery, halfway houses. I don't even know, like a lot of these places.\r\n\r\n\r\nHector (21:14.02)\r\nYeah. was the biggest one. called this sober house and they had 300 houses. I'm sorry. 300 houses in the state of Texas. I had no idea. Sober living. I called one guy up and he's like, man, come to my meeting. Like we have some guys at the house. I'm like, okay, guys at the house, what's that? Five, six guys. We show up to a church and there's a hundred people in there because they have to go to this new resident meeting every 90 day or once. And I show up and there's a hundred people. I'm like,\r\n\r\n\r\nNik (21:24.632)\r\nWow.\r\n\r\n\r\nHector (21:43.202)\r\nwho wants to go to school for free and a free laptop? And obviously they all qualify because they're considered homeless because it's transitional living. So they all qualify for the grant, regardless if they work or not. And to live in those sober houses, you either have to work or go to school or a combination of both.\r\n\r\n\r\nNik (21:56.814)\r\nSo you do have to be careful or at least cognizant of what the criteria is, right? you're not going to high school seniors who are graduating and like, hey, you wanna do this grant? Like it's not yet.\r\n\r\n\r\nHector (22:02.23)\r\nYeah, mean, everyone qualifies for the grant, right?\r\n\r\n\r\nHector (22:10.625)\r\nNot yet. Not yet. Well, because, so when you go through accreditation, part of being accredited, they're so strict, because we're a for -profit, right? So they're so strict.\r\n\r\n\r\nNik (22:21.294)\r\nWell, you have 80 % margins. You are technically for profit.\r\n\r\n\r\nHector (22:24.758)\r\nWell, so is nonprofit. The only reason we want to sell it is because we're going to sell it, right? Nonprofit, can't sell it. And nonprofit doesn't have any placements. I think that's a scam. Like they don't have to place anything because they're a nonprofit, which is crazy. it's kind of like every university. mean, they're nonprofit, but the dean makes a million dollars, right? But so going back, I forgot what we're discussing there.\r\n\r\n\r\nNik (22:30.134)\r\nRight, right, right,\r\n\r\n\r\nNik (22:38.574)\r\nThat's dumb. Yeah.\r\n\r\n\r\nNik (22:47.982)\r\nSo I said, I said, do you go to high school students and you were like, not yet.\r\n\r\n\r\nHector (22:50.708)\r\nyeah. So now that we're going to accreditation process, 10 % of our funding has to come from self -pay. So as of months ago, we started doing self -pay. And so yeah, we did our first event in May at a high school and blew it out of the water because we're sitting next to UT, A Texas Tech. we are, hey, for four grand, come do HVAC. And all the parents are like, yeah, before we give Nick here $15 ,000, go blow it. know, I'm kegs in this freshman year. Let's pony up.\r\n\r\n\r\nput this on our credit card and you can learn to\r\n\r\n\r\nNik (23:24.032)\r\nwhy are you deciding to go the accreditation route? Sounds like you got a pretty good thing going just with the grants.\r\n\r\n\r\nHector (23:28.822)\r\nnot my shareholders want to go that route and eventually they want to sell it and it's worth a lot of money when it's accredited.\r\n\r\n\r\nNik (23:35.758)\r\nCan, all right, I think I got a handle on the business model. It's freaking fascinating. Are you open to talking about your partnership? I'm curious, you said shareholder a couple of times. So when you.\r\n\r\n\r\nHector (23:46.69)\r\nSo was mine, I came to some buddies of mine when I worked as a VP at a financial company, some investors were some young dudes, kind of like you and Chris, young dudes. they always, when I left that company, they kind of just under their breath said, dude, if you ever do something, let us know. Like if you ever come up with an idea. And I did, I had this aha moment, right? So I pitched them, I knew, I'm a faith guy first, father second, finance third, right? So I knew.\r\n\r\n\r\nIf I'm a jump into this, I can't be the CEO. I mean, look at me, look how I'm dressed. don't, I'm not CEO material. You know what mean? Like I have a PhD. Are you kidding me? So I knew I had a guy that I work with. I'm like, dude, he would be the best CEO ever if I could figure it out. So I put a CEO in place, like, and I put a team in place and I automated it. And I did a sweat equity deal where I put no money in it and I own a pretty good chunk of the school.\r\n\r\n\r\nNik (24:40.002)\r\nWhat were the startup costs? Why did you have to go out and get money?\r\n\r\n\r\nHector (24:43.448)\r\nWe didn't. That's what we thought. I took their idea. They didn't. If you could do this all over again, you could do it for like 20. Besides application fees and some startup, this and that, whatever, it's crazy.\r\n\r\n\r\nNik (24:46.318)\r\nNik (24:56.952)\r\nWould it take you five months to get licensed again or do think you could actually do it quicker?\r\n\r\n\r\nHector (25:01.706)\r\nIn Texas, quicker, probably two months.\r\n\r\n\r\nNik (25:03.51)\r\nIf you wanted to expand to Oklahoma, what would you do? Or any state for that matter, how would you go to another state?\r\n\r\n\r\nHector (25:10.018)\r\nwhich is, hey, Nick, you're gonna open up a school in Idaho.\r\n\r\n\r\nNik (25:13.262)\r\nIs that what you do? Would it be a franchise or would it be like?\r\n\r\n\r\nHector (25:16.056)\r\nI don't know. don't know. That's why I'm here and this is existing. could possibly turn into something. But who knows, man? mean, even the people have actually, they kind of planted the seed, like the people that are on my team, they're like, you should be a consultant. I'm like, huh, maybe I am, or maybe I will be. I don't know. Because when we sell this school, it wasn't quite for me.\r\n\r\n\r\nNik (25:39.788)\r\nYeah, I guess it probably is very state specific. Like you don't know the regulations in each state. Idaho may require every owner to be a citizen of Idaho or a resident of Idaho, I should say. Right. I could see I could see a scenario for that. But if that's not the case, it would seem like you could just go out and find an operator, give them the playbook and then, you know, take a percentage of of whatever they're building.\r\n\r\n\r\nHector (25:53.228)\r\nme.\r\n\r\n\r\nHector (26:01.591)\r\nRight.\r\n\r\n\r\nHector (26:06.966)\r\nThat's why I want you in my life, maybe.\r\n\r\n\r\nNik (26:09.558)\r\nHahaha\r\n\r\n\r\nNik (26:13.198)\r\nOkay, two questions. What's your dude inception, right? You just pulled an inception right here. You're playing 40 chess, dude. I'm playing checkers. But what's your vision for this company over the next five years?\r\n\r\n\r\nHector (26:14.732)\r\nMaybe I'm interviewing you? Ha! This time. Maybe.\r\n\r\n\r\nHector (26:25.677)\r\nThere you go.\r\n\r\n\r\nHector (26:31.99)\r\nMe not being in it, probably selling. And I'm probably gonna take a cool little swing at being a consultant and showing other people how to do it. Not in my state, obviously I don't want the competition or give them the competition, but probably teach people how to do it, because if this PhD can figure it out, anyone else should be able to figure it out.\r\n\r\n\r\nNik (26:51.022)\r\nYeah, mean, you're seeing it. You're all active on Twitter. I guarantee you there'd be a massive, massive demand from people, especially the side hustle audience. You know what I mean? They're like, wait a second. I could be making $7 million in 38 seconds? Where do I pay?\r\n\r\n\r\nHector (27:10.165)\r\nBut that's the thing, people are buying yogurt franchises. I'm like, why? Those things fail. I don't get it. You could keep your pressure washing. You could keep, dude, I'm dressed like this behind a laptop making more than that. So it's like, you could have it all. What I think is crazy is I've gotten more education out of Twitter and X than ever going to school, just by having.\r\n\r\n\r\nNik (27:33.55)\r\nHow much time do you spend in the business right now?\r\n\r\n\r\nHector (27:37.383)\r\nmaybe two hours a day.\r\n\r\n\r\nNik (27:42.328)\r\nHow long did it take you to get to that point?\r\n\r\n\r\nHector (27:46.04)\r\nlike a year, 10 months to years, this will land the plane here. Every trades school owner out there is a trades person accidentally, right? So if you're an HCI guy forever and you're like, you know what? I'll be an instructor, I'll be an owner. Therefore, they don't treat it like a business. They answer the phone, they're the instructor, they don't automate anything. And I literally started this as a business, so that's the biggest difference. I don't live in it, I don't want to teach it. Can you imagine me trying to teach? Forget it. So it's just.\r\n\r\n\r\nNik (27:47.47)\r\nOkay, yeah.\r\n\r\n\r\nHector (28:14.412)\r\nJust automated everything, man. It's crazy.\r\n\r\n\r\nNik (28:17.154)\r\namazing. All right, I got some rapid fire questions for you. You ready? What do you love about this business?\r\n\r\n\r\nHector (28:20.801)\r\nYep.\r\n\r\n\r\nHector (28:24.662)\r\nthat the more lives I impact, the more money we make.\r\n\r\n\r\nNik (28:28.44)\r\npretty good incentive model. Yeah, it's a very good incentive model.\r\n\r\n\r\nHector (28:30.584)\r\nWall of thank you cards. Hey, I'm in my scrubs. Hey, I got this. Hey, I my first paycheck. Hey, I had Christmas for the first time. Pretty nice. The way we built it, if I could do it all over again, I would just bootstrap it myself. I have to answer to shareholders and I gotta go accreditation route. I gotta wear pants to work.\r\n\r\n\r\nNik (28:38.584)\r\nBrad, man, what do you hate about it?\r\n\r\n\r\nNik (28:53.966)\r\nCould you buy the shareholders out?\r\n\r\n\r\nHector (28:56.458)\r\nYeah, it'd be expensive. Yeah, I mean, once I sell it, there's nothing stopping me from starting another one.\r\n\r\n\r\nNik (28:58.712)\r\nYou think it'd be expensive?\r\n\r\n\r\nNik (29:05.294)\r\nI mean, depends on who you sell it to.\r\n\r\n\r\nHector (29:07.896)\r\nYeah, it's true. Yeah, but then I could... True, but... I'll start my 10 year old school.\r\n\r\n\r\nNik (29:09.718)\r\nmean, non -competes are a real thing. non -solicitation. So.\r\n\r\n\r\nAll right. All right. What if you have two hours in your day, you don't have family time scheduled, you don't have work scheduled, like nothing that you have to be doing. What are you deciding to spend your time on? What are you obsessed with right now?\r\n\r\n\r\nHector (29:32.013)\r\nlearning how to build a community and start teaching people how to open up trade schools.\r\n\r\n\r\nNik (29:36.834)\r\ngreat obsession. If you had to give yourself advice, your pre entrepreneurial self advice, what advice would you give him?\r\n\r\n\r\nHector (29:53.12)\r\nI take action so fast and I break things so fast that I just jump in. I would have probably slowed down a little bit more and did a little bit more research, not over now, analyze it, because I just, you know, I started a newsletter. I don't know how to write. I took a writing course. English is my second language. I suck at grammar. I fixed that. But I started a new one before I even learned how to write. it's just, I take action so fast sometimes that I would have told myself knowing this was going to get this big to slow down a little bit. Yep.\r\n\r\n\r\nNik (30:20.92)\r\nGood advice, man. Where's the best place for people to come find you?\r\n\r\n\r\nHector (30:25.83)\r\nat Chris's house. No, I'm Twitter. It's X.\r\n\r\n\r\nNik (30:30.733)\r\nWhat's your handle?\r\n\r\n\r\nHector (30:32.824)\r\ngood question. At TS underscore secrets.\r\n\r\n\r\nNik (30:37.516)\r\nAll right, we'll link that in the show notes. Well, this is Radman. I blew my mind today. That's for darn sure. Appreciate you coming on.\r\n\r\n\r\nHector (30:42.422)\r\nYeah. I loved it. Thanks so much. You got it.\r\n\r\n\r\nNik (30:47.639)\r\nAlright, don't be a stranger",
  "metadata": {
    "duration": "",
    "date": "2024-11-18",
    "platform_source": "Google Drive"
  }
}