{
  "episode_number": "208",
  "episode_title": "How Embracing a Grudge Can Fuel Your Success with Liana Fricker",
  "guest_name": "Liana Fricker",
  "business_name": "The Inspiration Space",
  "transcript": "﻿Nikolas Hulewsky (00:02.124)\r\nAll right, Liana, I'm really excited to talk to you today because you've played at this really cool intersection between SMB, the venture world in particular, but you're also in Europe, which has required you to do things a different way. You know, they're very different than the United States. And what's cool about you is you started in an accelerator, you're based in London, you've had over a hundred companies go through that from my memory.\r\n\r\n\r\nSome of those companies have gone on to tech stars and apply to things like Y Combinator and raise money and become very successful. But because there hasn't been a very large, I guess, entrepreneurial ethos might be the wrong word, but culture in the UK, you kind of became the focal point of, there's resources for you. Go talk to Liana. She can help you in the UK kind of get started. So anyways, you've got this like really cool intersection of experience, SMBs, venture capital helped hundreds of companies.\r\n\r\n\r\nLiana Fricker (00:51.352)\r\n.\r\n\r\n\r\nNikolas Hulewsky (00:57.974)\r\nEt cetera. And you were just telling me something as we got started. So I want to start with that, where you said your main message is you want people to understand where you end doesn't have to be where you start.\r\n\r\n\r\nLiana Fricker (01:12.152)\r\nCorrect, correct. And there's no, there's no fixed way, know, when, so I guess what, what, what helps to contextualize this. So my background is in, marketing storytelling PR, you know, it worked with really big brands. And what I loved was the ability to make an impact and to be entrepreneurial. worked at an agency that really kind of gave me the ability to kind of refresh all those skills or learn those skills even. And when I went out on my own, I\r\n\r\n\r\nNikolas Hulewsky (01:13.198)\r\nIs that right? Tell me more.\r\n\r\n\r\nLiana Fricker (01:41.696)\r\nwasn't quite sure what I was going to do, but I knew that it was going to be something around community and content and probably like education, right? Like working with small businesses and what has really kind of\r\n\r\n\r\nmade me feel awestruck about entrepreneurship in and of itself is the idea that you can start with one idea in one place, like with one kind of frame of reference or your mindset being in one way. And along the journey, it changes it all unfolds, right?\r\n\r\n\r\nNikolas Hulewsky (02:15.83)\r\nalways changes. Well, like you, okay, you were telling me when we spoke last, this is a perfect example. You had a woman that came to you with an idea for a doll. I think the idea was the doll. And all of sudden now here we are, we fast forward, her company is venture backed and they are, I guess, a defense contractor almost. Tell that story.\r\n\r\n\r\nLiana Fricker (02:26.273)\r\nYeah.\r\n\r\n\r\nLiana Fricker (02:37.272)\r\nIt's material circularity for the defense industry, right? And that's the whole thing. You know, you can literally start one place, if you're like at a kitchen table being like, you know, what I want to do is I want to change the world by busting down stereotypes and dolls, and it's going to be made out of the best materials and it's going to be environmentally friendly, et cetera, et cetera, et cetera.\r\n\r\n\r\nNikolas Hulewsky (02:40.436)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (02:57.134)\r\nAnd this was her, she's in the UK, she comes to you. I wanna create these, okay, cool.\r\n\r\n\r\nLiana Fricker (03:01.888)\r\nYes, exactly. know, military wife, ultimately on paper, you know what I would call it, a quote unquote stay at home mom came to us, wanted to crowdfund 10 K, you know, for a prototype. And we were like, but there was just something, it was like the enthusiasm, the ability to like, you know, burn it, burn it all down. Like I love it when people like just really want to challenge the status quo. It's like, okay, this is really interesting. And so, you know, my business partners and I, we talking to her and they were like, all right. And so.\r\n\r\n\r\nOver like three months, we started kind of working with her to shape this idea. And ultimately we got to a point where we said, okay, well, the thing is there's not enough water on earth to support organic cotton production at the scale that would be required for you to be as successful as Mattel. And because this whole thing is about, you know, the sustainability and, you know, inclusion and all of these things isn't, maybe there's another way. So then we started thinking of it from a materials perspective.\r\n\r\n\r\nFast forward kind of another two months, you know, it was all about materials. She got accepted into Antler, was able to turn that place down. And now it's a material circularity company called Uplift 360. And it just blows my mind every time I think about that, you know? Yeah, venture backs, like they've got amazing contracts, you know, they've, they've moved the team over to Luxembourg. And when we think about what, you know, someone\r\n\r\n\r\nNikolas Hulewsky (04:14.158)\r\nAnd their venture back now?\r\n\r\n\r\nLiana Fricker (04:28.076)\r\nyou know, at a kitchen table at this moment, things as possible. I love the idea that maybe they don't even know what's possible. Maybe they're only seeing this one shot, like the small kind of thing about like what could be in the future, but they don't, they don't know what they're capable of. and, that's why I love what it is that I do. That's why I love entrepreneurship. That's why I love SMBs, especially in the times that we're on now where everything is in flux and technology is now ubiquitous. It's like, well, what could we do if we want to just\r\n\r\n\r\nkind of go left while everyone else is going right.\r\n\r\n\r\nNikolas Hulewsky (05:00.75)\r\nOkay, so that's what I think is cool. If anyone's listening and your ears are perking up and you're like, wait a second, she lives in London? She doesn't sound like she's from London. What's going on here? You are not from London. mean, you're the embodiment of like, where you start is not where you end. She is from a small town in California called Valley Joe. Just kidding, that's not how you say it. Vallejo, California in the Bay Area. How the freak did you end up in the UK?\r\n\r\n\r\nLiana Fricker (05:13.304)\r\nBye.\r\n\r\n\r\nLiana Fricker (05:19.49)\r\nYou\r\n\r\n\r\nLiana Fricker (05:28.248)\r\nYeah, you know, by way of Boulder, Colorado is my last semester of university and I came over, I was supposed to stay for six months and 20 years later, I'm still here.\r\n\r\n\r\nNikolas Hulewsky (05:36.718)\r\nIt's worked out. It's worked out for you. And a small aside, the way that we got connected on Twitter is, I don't even remember who posted, somebody posted something about a suit. I don't remember what it was, but I quoted on there my favorite Kanye West lyric, which is, before he speak, his suit bespoke. And I just think it's such a cool lyric because obviously, you know what bespoke means?\r\n\r\n\r\nBut also he's saying before he speaks, his suit is speaking for him. just like, there's layers to it. And, and Liana commented, I don't remember if you've like continued the lyric on, or if you just said, I love this lyric. And I was like, who is this cool person? I'm going to go look at her profile. And that's, that's how we got connected. So thank you, Kanye West. It's such a good song. so the UK is different, right? It's not the same type of entrepreneurial ecosystem and ethos.\r\n\r\n\r\nLiana Fricker (06:12.45)\r\nRight?\r\n\r\n\r\nLiana Fricker (06:20.824)\r\nAnd that's like one of my favorite songs, right?\r\n\r\n\r\nNikolas Hulewsky (06:33.486)\r\nYou have done a bunch of things. You've worked within a bunch of companies. How did this accelerator start in the UK? You've helped over 100 companies go through it now. What was the, I guess, genesis of that?\r\n\r\n\r\nLiana Fricker (06:40.183)\r\nHmm\r\n\r\n\r\nLiana Fricker (06:45.91)\r\nSo the Genesis was the community that I started. So I started a community and we, you know, it grew really quickly. And the whole point of the community was to bring, you know, founders together to swap skills and knowledge and to network in ways that, you know, I find really enjoyable as networking. So instead of, know, 7 a.m. with bad croissants and coffee, you know, we would do stuff like going out and, you know, taking over a bridal shop and having a supper club where you get to like,\r\n\r\n\r\nmeet, like, you know, and it's not just any bridal shop. It's like this incredible family owned, like every single detail thought of, like she's cool as anything. So it was all, it was always around like bringing to the surface what typically laid beneath like everything that we would see in like our traditional kind of suburban, you know, small business space.\r\n\r\n\r\nNikolas Hulewsky (07:24.302)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (07:35.692)\r\nWhat were you doing at the time?\r\n\r\n\r\nLiana Fricker (07:38.69)\r\nSo at the time I was consulting for companies in California. So I'd just had my first baby, the time difference worked, my husband was going into London and so he was coming home really late. And so it was a way of kind of just using all of my skills. I get bored easily and I love to create and make stuff happen. And that's what it started with.\r\n\r\n\r\nNikolas Hulewsky (07:56.91)\r\nAnd your consulting was marketing, branding, communicate, like what was?\r\n\r\n\r\nLiana Fricker (08:02.104)\r\nEverything, everything. was like, I'm very much a strategic thinker. and because of my background in marketing, comms, community, biz dev, you know, content, I just kind of understand how to put it all together and to find the path of least resistance. And that's where like my PR background really comes in handy because when you've got very little budget and you're expected to make a splash, you learn how to tell great stories.\r\n\r\n\r\nNikolas Hulewsky (08:29.282)\r\nThis is true. And so you just decided, hey, I'm going to start this, a peer group effectively, right? Like, hey, let's start this entrepreneurial peer group. We'll meet in cool places. And you just noticed within that group that, people are looking for funding or advice. So like, how did it bleed into the accelerator?\r\n\r\n\r\nLiana Fricker (08:35.488)\r\nYeah.\r\n\r\n\r\nLiana Fricker (08:46.432)\r\nIt was more, I started to realize where some of the gaps in knowledge were. And I realized that I also had those gaps and as luck would have it, you know, I went on an accelerator, met my two mentors who ended up being my business partners and investors. And they were like, we love what you're doing. How can we support this? And then we spent about 12 months finding ways to work together. COVID hit. And that was at the time where we had basically mapped.\r\n\r\n\r\nout a network of digital enterprise hubs that were going to go across our region. had like five out of 10 already set up and running. And then COVID hit, we brought it online and everything really went from there. That's how it became international. And that was when we first road tested the content for what is now our new beginnings accelerator.\r\n\r\n\r\nNikolas Hulewsky (09:27.79)\r\nCheers.\r\n\r\n\r\nAll right, so let me ask you some questions. I'm really curious. For you, man, where do I start? this is a good one. How do you know what ideas are worth pursuing and what ideas aren't? I know that's like a very broad and loaded question, but in entrepreneurship, we get ideas all the time, right? And there's some people who are like, Mark Zuckerberg just had the grit and stick-to-itiveness to,\r\n\r\n\r\nLiana Fricker (09:32.92)\r\nMm.\r\n\r\n\r\nLiana Fricker (09:44.401)\r\nNikolas Hulewsky (10:00.226)\r\nfulfill his vision. But on the flip side, there's also this component of you got to know when to cut bait, right? And so like, I don't know, how do you kind of evaluate when an idea is worth pursuing and when it's like, all right, no, we're cutting bait.\r\n\r\n\r\nLiana Fricker (10:08.482)\r\nyou\r\n\r\n\r\nLiana Fricker (10:15.0)\r\nSo I very much use my thematic intelligence, which is like my body response, and I take it from the outside in. So I'm very much one of those, I don't know if it's old school or what, but I love a pestle analysis, right? Politics. So a puzzle analysis is a...\r\n\r\n\r\nNikolas Hulewsky (10:30.287)\r\nI know what that is, I know what that is, other people don't.\r\n\r\n\r\nLiana Fricker (10:38.102)\r\nIt's a framework that you use to basically understand market forces, right? And the P stands for political, the E stands for economic, the S stands for sociological, T is technological, L is legal, and E is environmental factors. And ultimately, it's how you can identify opportunities and threats and make informed decisions. And then, you know, your strategy kind of pulls from there. So.\r\n\r\n\r\nNikolas Hulewsky (10:53.666)\r\nHmm.\r\n\r\n\r\nLiana Fricker (11:04.46)\r\nI'm a sucker for a pestle analysis and that's where I start. I'm like a walking pestle analysis. I'm constantly reading and researching and social listening and taking notes and almost like the closest I can ever have to an invisibility cloak to understand where things are shifting, moving, where one thing might like, that's probably not worth it anymore, whatever it is. I think that's always where I start.\r\n\r\n\r\nNikolas Hulewsky (11:30.744)\r\nHmm.\r\n\r\n\r\nLiana Fricker (11:32.278)\r\nhow I react when I hear an idea. And what I love the most is what I'm like, my gosh, yes, this is exactly the kind of thing that I thought would be a solution to this intersection of problems. And so again, for me, I'm an intersectionalist. like when it's multifaceted and it's like, I can see how this solves some systemic issues. I can see how this, you know, can make money. And when you put it all together, it's, know, business for good, ultimately.\r\n\r\n\r\nNikolas Hulewsky (12:02.552)\r\nSo you're not essentially, or I guess what you're not doing is, I have this framework of analysis and I'm gonna individually use it on this business that is pitching to me. You've kind of got this framework running in the back of your mind where you're constantly thinking about, okay, what's going on? And I don't remember all of them politically, economically, sociologically, environmentally, et cetera. Where are there intersections of problems? And then when a company pitches to you, it's like, you're hitting on that.\r\n\r\n\r\nLiana Fricker (12:13.846)\r\nMm.\r\n\r\n\r\nLiana Fricker (12:25.452)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (12:32.358)\r\nsocial, political, and economic problem that I've identified. I like this. I'm going to invest in it. So it's almost like the filter is where have I already identified problems and does this company fix it? Is that fair?\r\n\r\n\r\nLiana Fricker (12:43.554)\r\nMm-hmm. Mm-hmm. Mm-hmm. And are they thinking, yeah, exactly that. And are they thinking of it in another way? You know, we work with an energy design consultancy for the built environment. And we got on like a house on fire in the first instance, because when he was kind of sheepishly telling me his ideas for technology and things like that, I was like, well, it's funny you mention that, because I've been racking my head. This isn't even like my zone of genius.\r\n\r\n\r\nAnd every time I come across anything in the built environment, like someone should be doing, you know, this, this, this. And, know, because we work with like scale ups and quite early stage, there's also that element of founder enthusiasm. Cause sometimes like, we just don't know what we don't know. It's like that willingness to see beyond kind of maybe first, second, third, kind of, you know, I guess, point of view, uh, to widen out what we think.\r\n\r\n\r\nmight be the opportunity.\r\n\r\n\r\nNikolas Hulewsky (13:41.336)\r\nDid you say we got on like a house on fire? I've never heard that. That's amazing. What the freak? And we got on like a school breakdown, like a house on fire. Okay, we got on like a house on fire. That's a cool colloquialism I've never heard before.\r\n\r\n\r\nLiana Fricker (14:02.54)\r\nI don't know if that's American or British. I've been here so long, everything is like intersex.\r\n\r\n\r\nNikolas Hulewsky (14:04.576)\r\nIt must be British. has to. It has to be British. We grew up in the same area like this in Northern California. We're not like, yeah, John and I got on like a house on fire. That's just that's not a thing. That's amazing. As you're thinking about this, do you like write this down or is it just all in your head? Are you kind of just constantly thinking about each one of these ideas? Over time, or is there like it like how do you keep yourself organized?\r\n\r\n\r\nLiana Fricker (14:09.432)\r\nI\r\n\r\n\r\nLiana Fricker (14:14.622)\r\nI know, right?\r\n\r\n\r\nLiana Fricker (14:19.288)\r\nBye.\r\n\r\n\r\nLiana Fricker (14:27.67)\r\nWell, I sense make, you know, I think what I've learned to do over time is to play to my strengths and you know, trend spotting, opportunity spotting is, you know, one of the things that I would say I'm exceptional at, just being able to say, yep, that's going to be a thing, you know, sometimes too far into the future. Sorry, too far into No, hold on. Too far into the future. Hold on one second.\r\n\r\n\r\nNikolas Hulewsky (14:49.432)\r\nDo you need take it? You're getting blown up.\r\n\r\n\r\nNikolas Hulewsky (14:56.59)\r\nYou can take a second. Yeah, yeah, take a second.\r\n\r\n\r\nLiana Fricker (15:04.344)\r\nHold on, let me just very quickly call him to let him know, because otherwise he'll be like... Okay, well now, you're busy, so there we are. But yeah, I sense make. because I'm so interested in the world that I always have been, the same thing that led me to PR, that led me to marketing, that led me...\r\n\r\n\r\nthrough everything. It's just my curiosity. I'm so curious about how the world works. I'm curious about people. I'm curious about systems and structures. And I've found that business is probably the best, I guess, canvas that I have accessible to me to allow me to explore it all.\r\n\r\n\r\nNikolas Hulewsky (15:51.928)\r\nSo lots people are curious though, how do you spot trends? I feel like curiosity is like, that's interesting. What's this, what's this, what's this? There's a next step where there's, guess, pattern recognition that says, actually, that's gonna be a trend. Like, what have you seen that might help you understand?\r\n\r\n\r\nLiana Fricker (16:01.986)\r\nYeah.\r\n\r\n\r\nLiana Fricker (16:06.427)\r\nYeah, so it's definitely the pattern recognition. And again, I think maybe part of it is just an innate ability that I have. Um, and that's just been refined and, you uh, shaped over time. Like my, ooh, what am I seeing? Okay. Okay. So something that I'm definitely seeing as an emerging trend is going to analog.\r\n\r\n\r\nNikolas Hulewsky (16:21.698)\r\nTell me some trends. Are you seeing any trends right now? Like what's something that you're like, this is, this is an emerging trend.\r\n\r\n\r\nLiana Fricker (16:33.974)\r\nIt's everything like physical. It's, and I mean, we've seen this for a while, right? It's everything from the resurgence of vinyl to when we think about smartphone free schools. Like my kid, like literally got an SD disc today. Cause we, he now, like we took the smartphone, he got an SD disc today and now he's downloading like music old school style. Yeah. You know, magazines.\r\n\r\n\r\nNikolas Hulewsky (17:00.27)\r\nThat's awesome.\r\n\r\n\r\nLiana Fricker (17:03.276)\r\nYou know, being offline and being in community, you know, I think everything has become so digitized. There's a real push towards offline. And I think what we're going to see over the next kind of five to eight years is the convergence between millennials like myself, who are parenting the youngest gen Zed and the oldest gen alphas, whilst also feeling really, really overwhelmed with the digital world. Just being like, forget it, take the tech.\r\n\r\n\r\nand we're going to go analog with this. So I'm definitely seeing that a lot more, a lot.\r\n\r\n\r\nNikolas Hulewsky (17:34.85)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (17:38.574)\r\nThat's really interesting. Are you just seeing it anecdotally? Like are you seeing it in, I don't know, Twitter posts or media, or are you also seeing it in the types of companies that are now forming around solving problems?\r\n\r\n\r\nLiana Fricker (17:55.916)\r\nThat's a really good question. So I'm seeing it anecdotally offline and then I'm also seeing the kind of evidence that I would look to to make me say, okay, this is gonna be a thing. Like the latest research from MIT around how chat GPT makes your brain rot. And then if you add that to things like Bop House, which is apparently a content creator house for OnlyFans creators.\r\n\r\n\r\nNikolas Hulewsky (18:25.314)\r\nBobhouse?\r\n\r\n\r\nLiana Fricker (18:25.356)\r\nAnd it's very called BOP House B-O-P. And it's like TikTok and Snapchat. Now, if you have a 14, 15, 16 year old, you may or may not be aware of how much time your child spends on these platforms. And I read something online a couple of days ago about the BOP House. We were checking our son's phone and in his for you page was a BOP House thing. And I was like, uh-huh. So when we think about that,\r\n\r\n\r\nNikolas Hulewsky (18:29.857)\r\nOkay.\r\n\r\n\r\nLiana Fricker (18:52.664)\r\nAnd then on Saturday we were at school and they were doing the smartphone free school thing. So you see how like all of this starts to then come together, like, and it, it creates a snowball effects. And I think when we're thinking about things being analog, looking online might be the wrong place to look for the signal. Because a lot of the people that feel the most passionately about this aren't necessarily online and they're not necessarily talking about it in public spaces. They're in.\r\n\r\n\r\nNikolas Hulewsky (19:00.92)\r\nYeah.\r\n\r\n\r\nLiana Fricker (19:20.246)\r\nparenting Facebook groups. There's one that I'm in and I think it might have 20,000 parents that are all just like, we have no idea what to do about our kids in tech.\r\n\r\n\r\nNikolas Hulewsky (19:29.774)\r\nDid you read the MIT study about Chachi-PT?\r\n\r\n\r\nLiana Fricker (19:32.992)\r\nNo, I just saw like the high level.\r\n\r\n\r\nNikolas Hulewsky (19:36.36)\r\nman, I got to read, the same, I saw that. My wife sent it to me as well. I need to read it because this is how I feel about it. I think that every time there's a new technology, people think that, it just makes you lazier, right? Remember when we were kids and they're like, you have to learn how to do long division because you're not just gonna have a calculator in your pocket. It's like, I do now actually have a calculator in my pocket. They might look at that and be like, brain rot, you see, you don't know how to do long division anymore.\r\n\r\n\r\nAnd there's a hundred examples of that. I wonder if it's brain rot in the sense that your muscle for complex problem solving is atrophying to a certain degree, but are you developing another muscle where you can identify how to bring AI into the mix so that you can get ahead faster? I don't necessarily think it's a zero sum game where if just because one muscle atrophies,\r\n\r\n\r\nLiana Fricker (20:17.11)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (20:31.906)\r\nthe whole body atrophies. It could be that one muscle atrophies and another muscle just becomes a lot stronger. I don't know.\r\n\r\n\r\nLiana Fricker (20:38.04)\r\nSo the study was looking at like 18 to 39 year olds and it was a really, really small sample size. I think that's like quite important to remember. And if you think that it was from 18 to 39, know, they're, depending on like what the age mix was, there could have been a significant proportion of people that were in the study that are not our age. So don't remember the world before the internet. then how much maybe atrophy did they already\r\n\r\n\r\nNikolas Hulewsky (20:46.391)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (21:05.176)\r\nYeah.\r\n\r\n\r\nLiana Fricker (21:07.896)\r\nhave, you know, and I agree with you that it's not a zero sum game. What I can say for myself, and I've been on like chat GPT, like I remember when it first launched, that was another one of those trends that I had spotted really, really, really, really early around AI. And I remember in, you know, 2019 saying to copywriters that, you know, if your challenge is how do you scale your content business, imagine a world where you could create these bots of yourself instead of hiring people.\r\n\r\n\r\nNikolas Hulewsky (21:08.546)\r\nhave. Yep, yep.\r\n\r\n\r\nLiana Fricker (21:37.77)\r\nAnd then you could train them with different filters. So you could have your lifestyle filter and your fashion filter and then chat GPT, right? you know, and I was saying that in 2019 and you know, anybody else, anybody who's listening to this is like, yeah, and you were old, like you were late, you know, cause this has been in development for a while. And so, you know, I think it's what I've seen for myself is I use it to brainstorm, to make sense, to rapidly keep up with how my mind thinks.\r\n\r\n\r\nNikolas Hulewsky (21:45.176)\r\nYeah, yeah, totally agree.\r\n\r\n\r\nLiana Fricker (22:06.69)\r\nBut there are times where, because I haven't necessarily imprinted it into my head, because I've not taken the labor to write it out, and I'm kind of doing the thinking part, but I'm not cementing the thinking, it does kind of wash through a little bit. And I do have to reference it. And so I'm coming up with my own ways of doing that, doing a lot more handwriting. I find that that's actually really helpful to write my ideas down by hand first.\r\n\r\n\r\nNikolas Hulewsky (22:21.869)\r\nMm-hmm.\r\n\r\n\r\nLiana Fricker (22:34.572)\r\nbecause it kind of like cemented in and then I can talk to chat, you see, you know, and then it feels like in conversation and then I can like almost like take notes, you know, that.\r\n\r\n\r\nNikolas Hulewsky (22:37.304)\r\nTotally.\r\n\r\n\r\nNikolas Hulewsky (22:41.196)\r\nYeah. Well, I, yeah, exactly. I've started using the chat function with the chat GPT and it's like, it just helps me sort of work through problems internally. I think that's a great way to do it.\r\n\r\n\r\nLiana Fricker (22:50.071)\r\nMm-hmm.\r\n\r\n\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (22:54.806)\r\nAll right, let me ask you this. These are gonna be two hard questions. What are the top five traits that you see right now in successful founders?\r\n\r\n\r\nLiana Fricker (23:05.828)\r\nwell, I guess my first question is like, what a success. okay.\r\n\r\n\r\nNikolas Hulewsky (23:11.982)\r\nI can define it for you. Okay, I define success as a little bit of a cop out answer, but I define success in a founder as them hitting their well grounded goals. It's because for one founder, it may be I want a lifestyle business and I'm not just talking tech. just I'm I'm like talking generally. It may be I want a lifestyle business where I can spend as much time with my kids and I make $200,000 a year.\r\n\r\n\r\nCool. And for another founder, might be, want to build a company and exit for $50 million. Okay, cool. So those are two different definitions of success for them individually, but they're both success for them, if that makes sense. So for me, success is just achieving your grounded goals. And the reason I say grounded is because if you're somebody who's like, I want to be a billionaire, I think that you're an idiot. Do you know how hard it is to become a billionaire? I just...\r\n\r\n\r\nI don't actually think you're an idiot if you're a billionaire, but it is so freaking hard to become a billionaire. There are not many of them in the world. That's a lot of freaking money. So I don't think that's a well-grounded goal, so to speak. Anyways, I don't know. Maybe you have a better definition of success.\r\n\r\n\r\nLiana Fricker (24:26.092)\r\nI would, share that. And what I love about what you've said is that I love nothing more than when they start kind of saying, I want, you know, a lifestyle business that earns 200 K. And then after three years, like, yeah, I want to exit for 50 million. You know, these are journeys that I take people on. And I love that. And that is, so for me, what I feel is, you know, the traits of a successful founder is that openness. It's curiosity, right? Being curious about yourself.\r\n\r\n\r\nNikolas Hulewsky (24:49.742)\r\nMmm.\r\n\r\n\r\nLiana Fricker (24:53.548)\r\nbeing curious about the world, being curious about others, humility. And that's a lesson that you learn, right? Because, you you get batted around a few times in particular if you start like well, like I started well. So I was very much in that, you know, two, three years like, God, I'm infallible. And then it got hard. And then I started taking some.\r\n\r\n\r\nNikolas Hulewsky (25:02.871)\r\nYep.\r\n\r\n\r\nNikolas Hulewsky (25:15.244)\r\nYep.\r\n\r\n\r\nLiana Fricker (25:18.4)\r\nRight, so I learned humility like real well and like now that's like a really core part of my being because your ego can only get you so far and it's something that you have to be really, really mindful of. So that humility I think is key, you know? It's key.\r\n\r\n\r\nNikolas Hulewsky (25:31.714)\r\nYeah, and there's a difference between humility and insecurity. Right? Like you can be insecure. That doesn't mean necessarily that you have humility. In my opinion, humility comes after you've gone through and you've seen, yeah, I have some skill sets to still understand that you don't know everything. That's humility. That's much harder than just being insecure and like, am I good enough? Did my mom love me enough when I was a kid? Yeah.\r\n\r\n\r\nLiana Fricker (25:35.512)\r\nMm-hmm.\r\n\r\n\r\nLiana Fricker (25:57.912)\r\n100 % and that brings me to my next one was like being of service because Having a business is a lifestyle choice, you know, I'll never forget I was talking to Amy Eric who is the founder of Madison Reed Hair care and coloring she was a you know an early Kind of person to work with Starbucks and you know, she got a venture fund and all these things like very very successful And I'll never forget she said, you know, this is a lifestyle choice this\r\n\r\n\r\nNikolas Hulewsky (26:02.574)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (26:15.81)\r\nOkay.\r\n\r\n\r\nLiana Fricker (26:27.442)\r\nis almost like a vision quest. This is not an easy thing to do when you think about all the other ways you ultimately could pay your bills, right? So being of service is so important because it helps you to remember the why. And sometimes you're in service of yourself and your own needs, right? Like your own like pursuit of what is possible, what am I capable of?\r\n\r\n\r\nNikolas Hulewsky (26:29.763)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (26:37.248)\r\nYeah, it's true.\r\n\r\n\r\nLiana Fricker (26:54.774)\r\nYou know, sometimes it's being in service of like the commitments that you made to your family and saying, like I'm doing this for that. Sometimes you're in service of the problem that you want to solve. And it's not like one kind of box, but it's understanding that you are of service. And I think the other thing that I would say that I always consider to be like a great trait is the willingness to collaborate because you know,\r\n\r\n\r\nClimbing Mount Everest and entrepreneurship are two things that only the reckless try on their own. Right? Like you can't do that on your own. Like at all, you know, at all. There are only so many Shackletons or is it Shackleford, you know, or great mountaineers in the world in the same way. There's only, you know, so many lone wolf founders that have done it and got to a billion on their own. And in reality, if you actually go back,\r\n\r\n\r\nNikolas Hulewsky (27:44.365)\r\nYeah.\r\n\r\n\r\nLiana Fricker (27:48.436)\r\nand look at the stories from the time, they probably weren't really, really doing it on their own. It's the, you know, we've created that myth afterwards.\r\n\r\n\r\nNikolas Hulewsky (27:58.465)\r\nI'm going to recap these and I really like them. So curiosity, I agree. think curiosity is a superpower. Humility, openness, being of service, willingness to collaborate. The one in here that kind of surprised me, but I really like as you were talking, is the being of service one. Because back to what we talked about earlier, well, what is success?\r\n\r\n\r\nWhen you're getting into this game, you have to know what your goal is. And I'm not saying it can't change, but like, what do you want? If you want to be rich, okay, embrace that. Okay, right. I think that most of the time people wanting to be rich is a proxy for something else. There's something else that's missing within them and they find that over time, but whatever. If you want to spend time with your kids, if you want to make an impact, if you want to be known, if you want to be liked or respect, whatever it is, understand your motivation.\r\n\r\n\r\nLiana Fricker (28:43.308)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (28:55.234)\r\nfor success. And then this thing, the being of service really ties it in. It doesn't matter what your motivation is. The being of service needs to be tied to your why. And you said that in there. So if you want to be someone who is really well known and respected, then you better have a product that is kind of all about you. Like you're a consultant or you're working with government or like it's something around you because you need that motivation to stay consistent enough when things get hard. It needs to be.\r\n\r\n\r\ntied back to your why, but also you need to have that service aspect so that you're like grounded in the offering. I think that's a really cool one, being of service and being tied to your motivation. That was cool.\r\n\r\n\r\nLiana Fricker (29:35.448)\r\nYeah, yeah, because also it, you know, I'm very much into embracing the shadow side, the yin and the yang. You know, I think the other thing that I love is when a founder has a grudge. I love a grudge. You can turn that grudge up. It's like right now. You know, they're feeling tired. But remember, remember the story you told me about.\r\n\r\n\r\nNikolas Hulewsky (29:59.704)\r\nYeah.\r\n\r\n\r\nLiana Fricker (30:02.178)\r\nBilly when you were seven and what he said, let's go get him.\r\n\r\n\r\nNikolas Hulewsky (30:05.708)\r\nYeah, it's that chip on your shoulder, right? Like it's, it can be used for good.\r\n\r\n\r\nLiana Fricker (30:11.736)\r\nAnd that's not a bad thing. Yes, that's not a bad thing. You can be of service, right? It's like, want to be the thing, I want to be the person, the thing, whatever it is that I needed at that time that created that chip, or I want to burn the status quo down. Like, that's my whole thing. I often think of myself, you know, and this is not like, I'm not egotistical or anything. This is like the best analogy that I have, like almost like a Thanos. For a really long time, I was being of service. I know, right?\r\n\r\n\r\nNikolas Hulewsky (30:16.652)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (30:37.194)\r\nOkay, okay. All right, let her cook. Let her cook. Let's hear what she has to say.\r\n\r\n\r\nLiana Fricker (30:40.408)\r\nBecause for a really long time, because of the nature of the work and who, especially in the early days we were serving, it was very easy to cosplay as an altruist, right? I'm doing this for the greater good. Yes, but also I'm doing this because I am annoyed and I am fresh, right? And I am frustrated in reality. And over the years I've got closer to those feelings. like, no, no, no, no.\r\n\r\n\r\nNikolas Hulewsky (30:59.256)\r\nSam Altman.\r\n\r\n\r\nLiana Fricker (31:07.326)\r\nI am helping people and I'm helping people to accelerate their impact because they are shining the light at some of the problems that frustrate and annoy me. So instead of being an old lady yelling at the sky, this is actually like my infinity stones, right? It's like, and you know, some of them deteriorate and whatever, but every time I'm like doing that and helping people bring that into the world, it...\r\n\r\n\r\nhelps me to fight against the things that annoy me and that I feel are injustices, which just don't make any sense. You know, a lot of times I'm like, why are we even doing it this way? Why?\r\n\r\n\r\nNikolas Hulewsky (31:42.072)\r\nYeah.\r\n\r\n\r\nWell, it takes a lot of energy to be like both of those people, right? Where you're like, well, no, I shouldn't be the one who wants to burn it all down, which I want to get into with you, but it's very interesting. I shouldn't want to be that person, so I'll be somebody different in public. And then you've got like these two personalities. like, takes a lot of energy to stay separated. The closer you can get you to what you're working on aligned.\r\n\r\n\r\nLiana Fricker (31:50.69)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (32:11.394)\r\nThe less energy is spent on that stupid stuff and the more energy can be spent on the actual business.\r\n\r\n\r\nLiana Fricker (32:15.948)\r\nAnd it's hard to make money being an altruist, right? And I call it the tragedy of the purpose-powered founder, right? Where ultimately, it's this tale of pride and greed, and it's got these glimmers of fear woven in. So pride tells the founder that you must appear altruistic. You've got to reject ambition and profit because you've got to stay pure. You don't want to be like the oligarch. And then fear starts to whisper about, what if they think that you're selling out?\r\n\r\n\r\nNikolas Hulewsky (32:25.154)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (32:38.83)\r\nHmm.\r\n\r\n\r\nLiana Fricker (32:44.438)\r\nAnd ultimately in the early days, sometimes it's just like build a business that like makes you a living, right? Like before we get into the 50 million exit, can you pay your bills and go on holiday? Right? Let's keep it real simple. And then you've got that greed and it's there and it's it's unacknowledged and it's lurking there waiting to be noticed. And the purpose powered founder wants everything, you know, on the other side of the F you money, the freedom, the choice, the joy and the ability to pay it forward, but they're not prepared to admit it.\r\n\r\n\r\nRight? And then what you end up with is a self-made prison of burnout and feast or famine cycles and stagnation. And that's what happened to me. And it's like, look, is this not a charity? It's okay to earn money. It's okay to earn a lot of money. Money is not inherently good or evil. It just is. It's what we do with it. So we have a lot of people who\r\n\r\n\r\nNikolas Hulewsky (33:37.474)\r\nDo with it.\r\n\r\n\r\nLiana Fricker (33:41.464)\r\nYou know, they play small, they, they, they, they don't necessarily allow themselves to finish the thought about, what could happen if I had a $50 million exit? Because it's just, it's too much. And it's like, Oh, but you're greedy or this or that. And the other, and I'm like, imagine what, you know, I would think to myself, what would I do with Jeff Bezos' money? You know, I am like this purpose powered, like I want to solve all the problems, right? I'd have a whole lot of fun doing it. So.\r\n\r\n\r\nSurely I'm not being of service if I don't allow myself to keep stretching and moving and creating a business that is sustainable so that I can continue to reinvest in it, to reinvest in others who can then invest in others, and on and on and on and on it goes.\r\n\r\n\r\nNikolas Hulewsky (34:23.0)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (34:27.212)\r\nYou know who's a really interesting example of this?\r\n\r\n\r\nMark Zuckerberg. Now, hey, I let you cook when you said you were Thanos, all right? All right, give me some space here. Give me some space here. No, I think in the early days of Facebook, Mark was Mark. And then I think there was like this 15 year period of time where Mark tried to be what he thought the public wanted him to be, right? And like, I mean, he's an alien either way, but he's all buttoned up.\r\n\r\n\r\nLiana Fricker (34:33.716)\r\nOkay. Tell me more.\r\n\r\n\r\nNikolas Hulewsky (34:58.87)\r\nAnd now we've got like this new version of Mark where he's, you know, wearing gold chains and like videos of him surfing or whatever. Here's the thing. Mark's going to be weird in any environment. it's like Mark finally embraced who Mark was. Now, I may not like any variation of Mark, right? I may love or hate whatever, but I, I do think that he's probably found some freedom and like, you know what? This is just who I am.\r\n\r\n\r\nI'm going to be who I am and I'm not going to like play this facade anymore. And that has been a very interesting arc to see. And I wonder if more people will look at that and be like, you know what? Yeah, I don't like Mark because of X, Y, Z things, but I do respect the fact that he did this. I think I want to try to do that. I just want to be true to myself from now on, because, like you said, money is not inherently good or bad, right? What you do with it, obviously you can make decisions around, but\r\n\r\n\r\nWe need to stop worrying about the way we're portraying ourselves necessarily to people. People read through it pretty quick. You're not really fooling that many people.\r\n\r\n\r\nLiana Fricker (36:02.712)\r\nAnd everyone's got an opinion. You know, I really do challenge myself not to judge, you know, including a Mark Zuckerberg. You I don't know that man. I see probably not even 1 % of who he is and whatever that 1 % is, is what is being chosen to kind of be out there. And there's a whole lot of nuance and detail that is not seen, you know, understanding around why certain decisions are made, et cetera, et cetera, et cetera.\r\n\r\n\r\nNikolas Hulewsky (36:11.352)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (36:22.968)\r\nRight.\r\n\r\n\r\nLiana Fricker (36:31.34)\r\nI do judge Peter Thiel, but at the same time, but at the same time, I can say he, you know, zero to one and you know, some of that early work and thinking has helped to shape how I see the world. So again, I'm not a monster. It's just people are complicated, messy things. And think at the end of the day, we all wanna be loved. We all wanna be liked and we all wanna be accepted. We are pack animals.\r\n\r\n\r\nRight? We are pack animals. And so I love what you're saying around that self-acceptance. And that's so important. It's so important, especially when you're starting a business, working for yourself, anything like putting yourself out there. Ultimately, it's about you're being vulnerable. You're deciding to step in front when you otherwise could be behind and say, look at me for good or for bad.\r\n\r\n\r\nNikolas Hulewsky (37:21.646)\r\nLeona, this has been amazing. I wish I could talk longer, but I have a call starting in five minutes. Tell me, where's the best place for people to come find you?\r\n\r\n\r\nLiana Fricker (37:27.639)\r\nThere you go.\r\n\r\n\r\nLiana Fricker (37:31.288)\r\nLinkedIn, so Liana Fricker, F-R-I-C-K-E-R, or theinspirationspace.co, not .co.uk, not .com, just theinspirationspace.co.\r\n\r\n\r\nNikolas Hulewsky (37:34.509)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (37:41.752)\r\nJust, okay. I can't wait to check in with you in six months. I wanna see what you're doing.\r\n\r\n\r\nLiana Fricker (37:47.606)\r\nYeah, definitely.\r\n\r\n\r\nNikolas Hulewsky (37:48.928)\r\nAll right, stay on for a second.",
  "metadata": {
    "duration": "",
    "date": "2025-07-23",
    "platform_source": "Google Drive"
  }
}