{
  "episode_number": "251",
  "episode_title": "The Future of Sora and True Classic",
  "guest_name": "Ryan Bartlett",
  "business_name": "True Classic",
  "transcript": "﻿Nikolas Hulewsky (00:03.896)\r\nmy favorite. All right. Ryan, Ryan Bartlett, I am really excited to talk to you today. So for those who don't know, Ryan Bartlett is the founder and CEO of true classic. If you are a male between the ages of 20 and 50, you have probably seen his ads on Instagram. For these shirts, I'm actually wearing a true classic shirt right now. Funnily,\r\n\r\n\r\nRyan Bartlett (00:23.31)\r\nWell thank you for putting that on right before this show.\r\n\r\n\r\nNikolas Hulewsky (00:26.788)\r\nBro, they are the best fitting. They're the best fitting shirts. But in the course of like six years, Ryan built a brand that has sold over 30 million t-shirts. It's a billion dollar brand, more than a billion dollar brand. They've sold millions of dollars worth of merchandise. They become a household name. He basically spoke a new product into existence. But that can feel kind of unattainable for a new entrepreneur or for just anybody who's just like trying to get started. And I think...\r\n\r\n\r\nRyan Bartlett (00:29.902)\r\nI appreciate it.\r\n\r\n\r\nNikolas Hulewsky (00:54.296)\r\nWhat I would love to talk to you about in particular is what people don't talk about much is he was also a failed musician and a failed poker player for probably 20 years before he launched True Classic. It's not like he was a 21 year old sitting in his Harvard dorm room and decided I'm going to go ahead and start an app where we rate people's faces. And it turns into, you know, the next Facebook. You saw some stuff. And I think that conversation about compounding experience, compounding interests leads you to where you are today. And it's never too late.\r\n\r\n\r\nto jump into entrepreneurship. here's my first question. What did I miss with that introduction? What did I get right?\r\n\r\n\r\nRyan Bartlett (01:29.688)\r\nYou got it all right. It's a crazy story and life is long is what I'll say. I think I thought that after failing a music, failing a poker, getting into marketing agency and having a little bit of success that that was probably going to be it for me. And I didn't need to create all this chaos of a life that I have now. I was making good money. I was totally fine and comfortable. But...\r\n\r\n\r\nI think I was just, I was missing something. I was missing impact. I was missing like, what am I actually doing for humans out here aside from just making their, you know, dentist office grow a little bit more through my agency? Like that, just did not feel impactful for me. So like we made a post today. You'll see there was a post where an influencer gave a bunch of shirts out to the homeless at scale.\r\n\r\n\r\nAnd for me, like, that's why I did this stuff. Ultimately, it was like for those moments where you can make an impact on someone's life or like even now you and me are talking and the audience is going to hear this and it sparks something in somebody to try something. And maybe they had failed most of their life as well. And then finally get the itch to try something because, you know, we, made it sound like it was possible for them. So that's what this is all about.\r\n\r\n\r\nNikolas Hulewsky (02:49.722)\r\nDo you know who Sam Parr is? My first million?\r\n\r\n\r\nRyan Bartlett (02:53.666)\r\nYeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (02:55.034)\r\nSo he talks about, he likes to look at other people and he's like, well, at what age did they do this? And he's like reverse engineering. It's almost like he's measuring his life based on what other successful people have done and kind of where he is relative to them. And it's really easy to do. You're like, oh, well dude, Mark Zuckerberg, he's 42. I'm the same freaking age. Like, how have I not done that? So I like this conversation for being the other side of the coin, right? Where, how old are you?\r\n\r\n\r\nRyan Bartlett (03:09.891)\r\nYeah.\r\n\r\n\r\nRyan Bartlett (03:22.03)\r\n43.\r\n\r\n\r\nNikolas Hulewsky (03:23.226)\r\nOkay, 43 years old today, easy to look at you and be like, my gosh, billion dollar brand, selling millions of teas a year, just, I can't even fathom that. Take me back 20 years. Like what was 23 year old Ryan doing?\r\n\r\n\r\nRyan Bartlett (03:38.83)\r\nGosh, I was a little bit of a wreck. I I failed out of college because I was just a party animal. just, I loved partying. I loved being out. I loved being social. I was not focused on school in my early 20s. I was focused on music and making it as a music producer. That was kind of like, that's just what I wanted to do. That was what I was best at at the time. And so I was...\r\n\r\n\r\nNikolas Hulewsky (03:46.937)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (04:05.518)\r\nHmm. Where were you going to school?\r\n\r\n\r\nRyan Bartlett (04:08.874)\r\nI was going to sue a Michigan State.\r\n\r\n\r\nNikolas Hulewsky (04:10.862)\r\nAnd then you dropped out to just do music.\r\n\r\n\r\nRyan Bartlett (04:12.81)\r\nflunked out, didn't drop out, got kicked out, more specifically. I went back into community college because my parents were like, well, just take a semester off and go to community and then go back to Michigan State. And ironically, they were telling me my whole life I should do business. And parents are always right in the end. It was everyone else around me that was telling me to do music. It was my friends, my peers.\r\n\r\n\r\nNikolas Hulewsky (04:32.686)\r\nReally?\r\n\r\n\r\nRyan Bartlett (04:41.6)\r\nother people that were like, you've got something, you got to go out there and make something. And my parents were like, yeah, music industry is not a great business. Like I think you are talented, they would say to me, but like, I just think you're more built for business. You have good sales skills, you're entrepreneurial, you're really scrappy, you're good at problem solving. Like that's what makes business leaders good. So I think you should go into Michigan state and get a business degree. And so that's what I was on my path to do. I just, started taking these like,\r\n\r\n\r\nNikolas Hulewsky (04:50.202)\r\nHmm.\r\n\r\n\r\nRyan Bartlett (05:11.458)\r\nhard math classes and science classes and I was just like, I got so uninterested. I'm like, this has nothing to do with business guys. Like, ironically, I should have learned more in math because math has a lot to do with business. But it was all the other prerequisite courses that I was just like, I couldn't keep my focus. So.\r\n\r\n\r\nNikolas Hulewsky (05:14.074)\r\nand it's a little bit of a disaster.\r\n\r\n\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (05:29.306)\r\nBut you got into Michigan State, so you weren't a terrible high school student.\r\n\r\n\r\nRyan Bartlett (05:32.958)\r\nNo, I was good enough at school. Like I was good at test taking. I was good at cramming and test taking. And that got me through most of my high school years to where I had like a 3.2 GPA. So I didn't really apply myself though. And it wasn't, I just couldn't focus. Like the teacher would start talking and I would just zone out within five seconds. And I was in la la land the whole class. Like I just could not focus. It was hard.\r\n\r\n\r\nNikolas Hulewsky (05:39.45)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (05:58.682)\r\nSo I just turned 40 a couple of days ago. You're 43, 42. So I'd say we're the same age. Did your, thank you, man. Appreciate that. Did your parents ever get you on Ritalin or like Adderall or any of the ADHD medications? No.\r\n\r\n\r\nRyan Bartlett (06:05.603)\r\nHappy birthday.\r\n\r\n\r\nRyan Bartlett (06:12.978)\r\nNo, no, back then it wasn't a thing. Like this is, you I was born in the early 80s. So like my parents were, that stuff did not exist. And it wasn't even an option to be honest, because almost all the kids were kind of similar. We were all just kind of like antsy and didn't want to sit in class. So luckily that wasn't an option.\r\n\r\n\r\nNikolas Hulewsky (06:16.996)\r\nIt's true.\r\n\r\n\r\nNikolas Hulewsky (06:30.106)\r\nSo just to foreshadow, did you ever go back to school? did you only?\r\n\r\n\r\nRyan Bartlett (06:37.358)\r\nI did, yeah. Eventually, so I flunked out and then my parents were like, well now you're on your own. Now you gotta figure it out. You wasted our money, you wasted our time, and now you gotta go make something of yourself. And I was like, well, I'm passionate about music, I have talent in music, why don't I go get an audio engineering degree? And why don't I figure that, let me start there. And so that was great. And I did end up graduating. I got an associate's, a bachelor's, and a master's in music, so.\r\n\r\n\r\nNikolas Hulewsky (07:05.742)\r\nWhere'd you go to school? Was that Michigan State you went back to?\r\n\r\n\r\nRyan Bartlett (07:07.71)\r\nNo, was a school, trade school in Orlando, Florida called Full Sail. And it was very much about the arts. was music, film, and everything in between, post-production, where you were basically just in a recording studio all day, learning how to run a board, learning how to edit audio, learning how to produce music, learning how to really run top to bottom, Pro Tools and all those other systems. So it was fun.\r\n\r\n\r\nNikolas Hulewsky (07:33.498)\r\nDude. So many people who are about to hear this don't know this about me. I went to a performing arts high school. from eighth, from grade seven through 12, I went to a performing arts high school and much of my dad's chagrin, you know, he'd be like, Nikolai, are you not going to try out for the sports teams? I'm like, well, jazz dance is the sports dad. He's like, what? Why would you go to such school? But it wasn't college obviously, but very similar type of classes, right? Recording music, dance, theater, et cetera.\r\n\r\n\r\nRyan Bartlett (07:50.286)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (08:02.65)\r\ndid not prepare me for the real world, that's for sure, but you probably actually got prepared for the real world. How long did you stay in the music industry? Because like, okay, you cool, you got those skills, you decide you're gonna go be in the music industry. Was it a quick burn or was it like, no, man, I'm gonna do this thing for the next 10 years.\r\n\r\n\r\nRyan Bartlett (08:22.646)\r\nIt was about a decade. Unfortunately, looking back, I burned about a decade. Working at recording studios, working as a session musician, working with artists. You know, I finally, once I got into LA, I finally did get a job with a big music producer, but he was not a great guy. He didn't treat anyone really well on his team, and we all kind of suffered for it. And it turned me off the music industry.\r\n\r\n\r\nNikolas Hulewsky (08:24.9)\r\nReally? Doing what?\r\n\r\n\r\nNikolas Hulewsky (08:48.953)\r\nHmm.\r\n\r\n\r\nRyan Bartlett (08:49.708)\r\nLuckily, I needed to be turned off to like finally look at like, what are my other options? You know, because I just don't think the business of music is gonna be it for me. Even though I love making it, it doesn't mean I need to actually make money from it. And that took me a long time to like come to terms with, but.\r\n\r\n\r\nNikolas Hulewsky (09:08.57)\r\nHow much money were you making? Let's say you were working for that music producer. How much were you making?\r\n\r\n\r\nRyan Bartlett (09:11.31)\r\nOh God, dude, this is like, this was a while ago. So like 35 K a year. I was basically, this was 2009. I was like a taxi driver. I literally would just like pick them up and drive around all day, go to recording studios, sit in there, hate my life, go get food for people. And it was not a fun job and not glamorous at all. Other than like getting to...\r\n\r\n\r\nNikolas Hulewsky (09:16.238)\r\nWhat year was that?\r\n\r\n\r\nNikolas Hulewsky (09:31.386)\r\nDude.\r\n\r\n\r\nRyan Bartlett (09:36.204)\r\nrub shoulders with some big time music producers and famous musicians and artists. It was bad. It was not fun.\r\n\r\n\r\nNikolas Hulewsky (09:45.146)\r\nI will say, Chris and I talk about this a lot because we love making funny like YouTube videos. If we'd been born like eight years later, I think there could have been an opportunity to do something fun in that space. it's probably, do you feel the same way about that with music? the, cause the discoverability back then was so hard. How did you even get, how did you get on the radio? How did you get on the map anywhere? Now you can.\r\n\r\n\r\nRyan Bartlett (10:03.182)\r\nAbsolutely. It was the wrong timing.\r\n\r\n\r\nNikolas Hulewsky (10:12.854)\r\nthere are TikTok artists. My wife just went and saw Tate McCray in Salt Lake City. She started on freaking TikTok and now she's selling out stadiums around the country. the ability to be discovered as an artist now is so much easier. So I don't think people fully appreciate how hard it was what you were trying to do back then. Like it was a one in a million kind of job.\r\n\r\n\r\nRyan Bartlett (10:28.248)\r\nDude, not only that, it was incredibly difficult to make music back then. And the reason I had to learn to play so many different instruments manually was because I didn't want to hire musicians to track. I wanted to just be able to get on a piano or a guitar or drums and play the instruments myself so I can get a track done. Nowadays, you prompt Suno, and it just fucking magically creates any genre of music with any style at any BPM and any kind of lyric cadence. And you're just like,\r\n\r\n\r\nNikolas Hulewsky (10:39.578)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (10:51.93)\r\nSo crazy.\r\n\r\n\r\nRyan Bartlett (10:56.258)\r\nThis is insane, dude. My whole degree program evaporated with one piece of technology. So.\r\n\r\n\r\nNikolas Hulewsky (11:02.136)\r\nWhat was the moment? What was the moment where you were like, I'm done. How old were you? Do you remember? Was it a moment or was it a progression?\r\n\r\n\r\nRyan Bartlett (11:07.66)\r\nYeah, no, it was like 2010 ish. had I had just burned through so many years of doing it. I was finally just in a place where I was growing up and I'm like, I have got to get my shit together. Like I cannot be this living with three guys in a house musician guy anymore. You know, partying in the week. Like I was just tired of it, dude. I was tired of being broke. I started not having a family and being married. Like I wanted that life.\r\n\r\n\r\nNikolas Hulewsky (11:33.882)\r\nWhere did you live? Culver City. You ever heard of Musicians Institute? It's right there in North Hollywood. When I moved down to LA, this is like 18 years ago, 2007, I worked with this kid who had special needs, but he went to Musicians Institute. He was like Rain Man. I would like, I would literally just play a chord for him or I would turn on a song and I'd be like, what chord is that? He's like, F minor, seventh suspended nine. And I'm like, what the freak? But it was insane.\r\n\r\n\r\nRyan Bartlett (11:35.342)\r\nCulver City. Yeah.\r\n\r\n\r\nRyan Bartlett (12:01.08)\r\nDude, that's insane. He had perfect pitch.\r\n\r\n\r\nNikolas Hulewsky (12:04.121)\r\nperfect pitch and he could hear one song one time and sit down and just he's just start playing it at the piano.\r\n\r\n\r\nRyan Bartlett (12:08.738)\r\nDude, my stepmom is that way. She's a professional harpist. She was in the Pittsburgh Symphony and like unbelievable musician. And she could literally, you would play a note and she could play it on the piano. Like she has perfect pitch as well. And could just sit down and play it out. Like even though she's not really a piano player, she would just hear it and just instantly go down and just start being able to play the whole song from just the top of her head. It was insane.\r\n\r\n\r\nNikolas Hulewsky (12:14.221)\r\nfreaking way.\r\n\r\n\r\nNikolas Hulewsky (12:33.124)\r\nSo I do wanna come back to this, to the musician point in your life, because I think that there's gonna be a nice thread that we can pull on. But you're 30 and you're like, I'm done, dude. I don't wanna be that guy anymore. It's funny to hear you say that, because you're like, I wanted a wife, I wanted a family, I wanted to be about that life. But then you got into poker? Like, is that how it worked?\r\n\r\n\r\nRyan Bartlett (12:54.24)\r\nNo, the poker, no, so I went music, poker, and then back to music. So poker was like sandwiched in between music. So that was like, so my early 20s, kind of like, you know, after I graduated from Florida, I went to Atlanta, tried to do it in the music scene out there, and then got into poker through that. So I was kind of juggling both in a way, but I started making money playing poker. So I was like, I'm just going to follow the money. Like I just, I'm going to be a poker pro now. And that was disastrous as well.\r\n\r\n\r\nNikolas Hulewsky (13:02.553)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (13:19.802)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (13:23.94)\r\nWas that in Southern California?\r\n\r\n\r\nRyan Bartlett (13:24.47)\r\nSo no, that was in Atlanta. And then I moved to Vegas to try to play professionally.\r\n\r\n\r\nNikolas Hulewsky (13:31.546)\r\nTell me how you crashed and burned. want to hear this story.\r\n\r\n\r\nRyan Bartlett (13:33.698)\r\nDidn't take long buddy. was, I went to Vegas with like three grand and I was like, this is going to last me three years at least. And I burned through that in like a few months and I didn't want to borrow money from anybody. So I was just like, let me go. The girl I was dating at the time, I was, she's like, you need to work in the nightclub industry. You would be good for that. And so I went broke and then, you know, still did music on the side, but, gave up poker forever and, got in the nightclub industry for a while.\r\n\r\n\r\nNikolas Hulewsky (14:03.354)\r\nOkay, when you are in 2010, when you're like, I'm done with this, and you are inventorying yourself, where you're like, okay, I know music, I've done, I played poker, so I probably read people pretty well, or at least I'm decent at making risk calculations with limited information. How did you decide what you were going to do next? Like, as you did that inventory, like what was the thing that you decided to do after that?\r\n\r\n\r\nRyan Bartlett (14:20.428)\r\nYes.\r\n\r\n\r\nRyan Bartlett (14:29.226)\r\nYou know, it was really, I just kept moving out of necessity. I was like, how do I make a dollar, basically? Let me go in the nightclub thing, let me try that for a little bit. You know, ironically, I had been developing digital marketing skills just out of pure curiosity over the years, and I didn't really realize at the time that I had accumulated a good amount of talent in that area. And so, as I was kind of poking my head up above water with the poker and the music,\r\n\r\n\r\nNikolas Hulewsky (14:35.15)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (14:39.522)\r\nThank you.\r\n\r\n\r\nNikolas Hulewsky (14:45.434)\r\nMm.\r\n\r\n\r\nRyan Bartlett (14:56.246)\r\nI started thinking about starting like a marketing agency and working with businesses. And that is when my life really started turning around very quickly. And it was as if like, I just needed to turn that switch on and then everything just got so much better. It was like all my skills came together and just started working in unison. The sales, the creativity, the risk tolerance, the hard work ethic, like it all just kind of worked together very, very organically.\r\n\r\n\r\nNikolas Hulewsky (15:00.473)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (15:23.258)\r\nWell, I think I think people forget what 2010 was like. 2010 is very similar to today's sort of focus on AI, right? Like today at AI, it's like you could go start an AI automation agency and you could help any business owner because the business owners don't really know what to do with AI. It was like that in 2010 where they're like, well, I know like Facebook and and Google Maps are like important, but I don't really know how to integrate it into my business. And so if you just kind of knew anything about that space, you were going to be able to make money and, you know, launch a business that way. But\r\n\r\n\r\nRyan Bartlett (15:35.843)\r\nRain.\r\n\r\n\r\nNikolas Hulewsky (15:52.824)\r\nWhat, how do you think that the music helped you with those skills? How do you think that the poker helped you with, like, why did creativity help with, you know, does that make sense? Like I'm trying to piece together.\r\n\r\n\r\nRyan Bartlett (16:01.632)\r\nIt wasn't so obvious right away in the service industry. It wasn't really apparent until I got into e-comm. And that's when I realized, creativity is scalable in this form of business versus like, because service base, can really only do so much and the creativity hits a ceiling pretty quick. But like creating a winning ad that crushes and is really creative and thoughtful can...\r\n\r\n\r\nin theory, scale to the moon and drive a huge business. So it wasn't until I really started wielding my creativity in true classic that I started seeing it really work for me. And then I was like, wow, all that work I did is actually becoming useful now in this business. And it really paid massive dividends.\r\n\r\n\r\nNikolas Hulewsky (16:45.722)\r\nThat's a really interesting application because basically when you look at many businesses now, there's product and distribution and distribution is really king. And when you were in doing music, all you're trying to do is figure out, at least when you're commercializing it, all you're trying to do is figure out how do I capture someone's attention? How do get them to like this song? So you're like just constantly iterating, constantly trying to figure out was the hook right?\r\n\r\n\r\nRyan Bartlett (16:56.546)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (17:11.428)\r\nDoes that note hit just right? Should there be anything in the background? so things that seem insignificant or nuanced to somebody else make or break a song to somebody like you. Do you think like that part of the analysis is really what has carried over?\r\n\r\n\r\nRyan Bartlett (17:26.688)\r\nIt's partly that, it's also just partly when you work that muscle as long as I have, I just don't really know any other way to think. Like I've just always been in this, I gotta create, create, create mode since I was very young. So coming into True Classic, it was very easy for me to go back into what I had always been doing, just in a different application, right? Like I wasn't writing a song, I was writing an ad. And I wasn't writing a song, but I was writing a script. Or I was...\r\n\r\n\r\nNikolas Hulewsky (17:42.487)\r\nMm.\r\n\r\n\r\nRyan Bartlett (17:56.108)\r\ndoing conversion rate optimization on the website and using my imagination to picture this cart to be a little bit different and more usable in the user experience. And when you couple all of that together, it's just a different application where you're wielding that creativity. it's still, even emails, like email design, you can be super creative. Dealing with customers, you can be super creative. The product offering, you can be super creative. There isn't a part of the business that creativity doesn't touch, to be honest with you.\r\n\r\n\r\nNikolas Hulewsky (17:56.58)\r\nYeah, man.\r\n\r\n\r\nNikolas Hulewsky (18:26.298)\r\nI talk to people about this sometimes because in entrepreneurship, think if you're to get into entrepreneurship, pick something that you like and are interested in, something you're good at and something the world will pay you for. Right. And so like, what are you passionate about? And sometimes we poo poo that like, well, what are you passionate about? I'm passionate about whatever X, Y, and Z. But my opinion is like, I love music. Was I passionate about music? If I really drilled down to it, I'm probably passionate about\r\n\r\n\r\ncollaborating with other people, being creative, figuring out a way to communicate something that resonates with another individual in a way that nobody's ever done before. Those are the attributes that I'm really interested in. So it's not so much, I gotta figure out how to make money with music. No, it's I gotta figure out how to make money with the attributes that I really enjoyed within music and apply them in a space that nobody else is doing this stuff in.\r\n\r\n\r\nRyan Bartlett (19:13.326)\r\nBut that is a very hard conclusion to come to for most people. So what you just said is a lifelong journey, I've realized. Like, it's so easy to say that now where we are sitting, but like when you look back at when you're young, you're just trying to do what you like, and everyone tells you to follow your dreams and follow what you're good at, and you try to do that, right? But like what you don't realize in the moment is that you're just setting yourself up for what is actually next and what you're\r\n\r\n\r\nNikolas Hulewsky (19:25.626)\r\nThank\r\n\r\n\r\nRyan Bartlett (19:42.254)\r\nactually supposed to be doing. So everything in your 20s, largely for most people, is a complete waste. Like almost nobody I know that was doing stuff in their 20s is now doing that as an adult. Like they just, they went through a phase, they did a thing. It's like the guys I know who got law degrees got in the field and then got out of it almost immediately because they realized they didn't really want that, right? Like you just, every, but then later in life, they were a general counsel somewhere or they used that lawyer skills to help negotiate contracts for somewhere else. And then that led them to the next thing. So.\r\n\r\n\r\nNikolas Hulewsky (19:42.82)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (19:52.014)\r\nRight.\r\n\r\n\r\nRyan Bartlett (20:11.712)\r\nIt's such a long journey and I just think that people need to be aware that everything they're going through is just a building block to something greater and that nothing you're kind of dealing with today is forever. Like you just gotta know that you're building something and you may not, it may not be super obvious right now, but just keep building whatever it is that feels right to you and just keep developing and eventually it'll all make sense in the big scheme of things.\r\n\r\n\r\nNikolas Hulewsky (20:38.05)\r\nI think, I think it might be similar in the sense that you were kind of just head down building, building, building one thing led to another led to another. launch the agency. Was there a moment though, where you finally had some breathing room? Maybe you were making enough money to pick your head up and say, huh, these are the things I like. This is what I'm good at. What do I want to do next? How can I apply these skills? Is that where true classic came from? Exactly.\r\n\r\n\r\nRyan Bartlett (20:46.061)\r\nYes.\r\n\r\n\r\nRyan Bartlett (21:00.322)\r\nThat's after you get all the things. So I got the house, I got the family, I got the kids, I got the cars, I got the whole thing after about six or seven years of true classic, low seven figures a year business. I I finally got all the things I wanted. And then, to your point, you start looking around going, well, what now? I thought that was the thing that was gonna really make me happy. And listen, my kids and my family ultimately do make me the happiest.\r\n\r\n\r\nNikolas Hulewsky (21:14.714)\r\nAhem.\r\n\r\n\r\nRyan Bartlett (21:27.938)\r\nbut I still was missing that impact component. And that's when I started thinking about e-commerce and true classic just happened to be kind of the vehicle to get me there.\r\n\r\n\r\nNikolas Hulewsky (21:37.152)\r\nYour agency, what was it exactly? Just digital marketing?\r\n\r\n\r\nRyan Bartlett (21:40.886)\r\nIt was digital marketing, but it was really SEO first and paid media and AdWords.\r\n\r\n\r\nNikolas Hulewsky (21:48.218)\r\nSo were you doing any of the creative or were you just doing, or you were doing the creative?\r\n\r\n\r\nRyan Bartlett (21:51.148)\r\nYeah, we were doing a lot of web development, creative. We were doing everything because all the clients needed everything. So like a dentist in LA would need creative or they would need content or they would need their website tweaked or whatever. Like we were kind of a catch-all agency.\r\n\r\n\r\nNikolas Hulewsky (21:56.301)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (22:05.242)\r\nYou started True Classic in 2019. What was the agency doing in 2018? Like how much money was it generating? What were you taking home?\r\n\r\n\r\nRyan Bartlett (22:11.958)\r\nLike low seven figures a year, like probably, you know, like 100 grand a month, like in retainers.\r\n\r\n\r\nNikolas Hulewsky (22:18.712)\r\nSo like you were crushing it by most standards, right? was like life was good. You had the family at the house, you had the cars, you were making good money. What was the moment where you felt like, I think I should do something else. Like I need to take another big swing.\r\n\r\n\r\nRyan Bartlett (22:35.276)\r\nHonestly, it was just like this feeling of it's just like I'm not doing enough for the world. I don't know what that is and I don't know why. It was very much just like I never felt satisfied. I never felt like what I was doing was enough. know, it just I had this emptiness of like, yeah, I'm making money and yeah, my kids are growing up and yeah, I'm building these other people's businesses to be a little bit bigger.\r\n\r\n\r\nNikolas Hulewsky (22:43.375)\r\nReally?\r\n\r\n\r\nRyan Bartlett (23:00.792)\r\nBut like something was just insatiable within me. Like it was just, could not deny it. It was just something I had to like get out of my system. I was just like, I gotta do this e-comm thing. I gotta see where it goes. I gotta build something. And then let's see what happens and how I feel on the other end of that. So.\r\n\r\n\r\nNikolas Hulewsky (23:15.372)\r\nLooking back, do you know what was driving that? You just felt like relative to your capacity, were underperforming or is it still kind of a mystery to you? What was pushing you?\r\n\r\n\r\nRyan Bartlett (23:26.03)\r\nI think that I just knew that building other people's businesses was actually not what I was trying to accomplish in life. I think what I was actually trying to accomplish was to build a big enough business to where I could employ people and feel good about growing a huge team and then doing all this philanthropy work that, you I grew up having been around, my parents had a lot of that growing up. And I think deep down, I felt like I owed it to them and I owed it to my family to show them.\r\n\r\n\r\nkind of like how I was raised. And I need to be doing good for a lot of the homeless, a lot of the veterans, a lot of the things that we do now is driven by just me pushing and going, guys, what's next? Who else can we help? Like, who lost everything? How do we show up for them? And just living in that kind of impact mind frame just always kind of kept me going and searching for a way to be super impactful for people.\r\n\r\n\r\nNikolas Hulewsky (24:16.686)\r\nBack when you were, you know, when you were a musician and doing the poker stuff, did you want to be rich? Like did you, were you driven by money?\r\n\r\n\r\nRyan Bartlett (24:25.398)\r\nNot really. I wanted to be good enough to where I could survive in LA. That's really what it was. And LA is like, it's really tough. it just, the rich came because I provided so much value in the agency. And so, I was happy with that. But, yeah, I wasn't moved by money. No, I think when you have no money, it's a part of it for sure. Like in the early years, when I went from like,\r\n\r\n\r\nNikolas Hulewsky (24:31.128)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (24:43.204)\r\nBut it wasn't the driving force.\r\n\r\n\r\nRyan Bartlett (24:53.058)\r\nbroke musician making no money spending student debt checks to like making 20 grand a month. It was wildly exciting. It was like, my God, I've made it, kind of vibe, right? And that really did inspire me. But that wears off very quickly. And as you stack up retainers, just becomes, it doesn't become the thing that really moves the needle for you anymore. You just get used to it.\r\n\r\n\r\nNikolas Hulewsky (25:19.102)\r\nWhen did the idea for True Classics come? Was it in 2018? I know it only launched in 2019, but...\r\n\r\n\r\nRyan Bartlett (25:23.574)\r\nIronically, looking back, and I made a post about this a while back, the idea started when I was like in my like 19-ish, but I had forgotten about it as, but I had told my brother about it and he reminded my mom like a couple of years ago, because he had seen on the sidelines, Classic, he's like, remember, I remember when Ryan told me that when we went into Caroloha and they didn't have his black shirt that he was going to start a t-shirt company someday so that he could always have the t-shirt he wanted. And I was like,\r\n\r\n\r\nmy gosh, I forgot that I had told him that. It was insane, full circle moment. But like, when did I actually take it serious? It wasn't until about, I would say 2018, where I was like, I was toying around with a few e-commerce ideas. Like I wanted to do like lab diamonds, was like an industry I was really interested in. It was like incredible value for people. There was a couple of things I wanted to do, but the t-shirt thing, I just, the more,\r\n\r\n\r\nNikolas Hulewsky (26:13.102)\r\nMm.\r\n\r\n\r\nRyan Bartlett (26:21.686)\r\nI looked at the competition, the more excited I got about how boring the space was and how much I could make an impact in this particular space. Like I didn't feel that anyone was doing anything amazing in apparel.\r\n\r\n\r\nNikolas Hulewsky (26:34.842)\r\nWell, and that's what I want to drill in on is because I think that for maybe for the first time, you're old enough, you're mature enough to kind of look back and assess the state of the field. Okay, these are my skills is kind of what's going on. But were you actually looking at it that way? Or was it still Hey, this is kind of just where my curiosity is leading me and it just so happened. It worked out like how calculated was it and how just it happened because water flows downhill.\r\n\r\n\r\nRyan Bartlett (27:01.708)\r\nwith the t-shirt thing, I mean, look, I would say that part of it was just I was facing, I knew I needed to solve a problem. Like that was like the first and foremost, right? So any business I was going to get into, it was not going to be a lifestyle brand. It was going to be a problem solving brand. And so the t-shirt thing just kept staring me in the face. Like I just kept going into my closet, being underwhelmed, asking myself why, going, looking up online, not really finding any good solutions and then going like, why is everyone doing it wrong?\r\n\r\n\r\nNikolas Hulewsky (27:17.486)\r\nHmm.\r\n\r\n\r\nRyan Bartlett (27:31.15)\r\nWhy aren't they trying this? Why am I not seeing any great marketers in this space? Like I bet you if I enter this space, I'll make such an impact so quick because it's so boring and so archaic. Like these brands that have been doing it for 50, 60 years are not enormous because they're wildly creative and they've created D2C. They just have unbelievable distribution and they're in every big box retailer and they've been doing it forever. And I'm just like, where are the...\r\n\r\n\r\nNikolas Hulewsky (27:41.743)\r\nWhen it-\r\n\r\n\r\nRyan Bartlett (27:57.454)\r\ntalented creatives in this space. Why haven't they lashed onto this space yet? And so that's kind of where it started.\r\n\r\n\r\nNikolas Hulewsky (28:03.898)\r\nOkay, I love that framing of it because it's like, you identified a problem which is the shirts don't fit very well. I think I heard you talking about it. You're 6'2 and like 175. Okay, I'm a little heavier than you. I'm like 185, but I'm 6'2 as well. And like, I just always had a problem with shirts, either the sleeves were too short or like the bottoms wasn't long enough for, you know, for the top. When you were doing the research, were there really no companies or were they just not market?\r\n\r\n\r\nRyan Bartlett (28:14.648)\r\nYeah, yeah.\r\n\r\n\r\nRyan Bartlett (28:26.691)\r\nRight.\r\n\r\n\r\nRyan Bartlett (28:32.289)\r\nNo, there was. just, okay, so I'll tell you where they were missing. What you just described wasn't being talked about. And now there's like a million companies who try to do a version of true classic. But when I started this, no one was talking about fit like that. Like nobody. So I was basically just like, yes, it's underwhelming. Yes, people are creating solutions, but they're definitely not talking about it the way I want to talk about it. And they're not getting super narrow and precise, which I think was really the key.\r\n\r\n\r\nNikolas Hulewsky (28:59.578)\r\nMmm.\r\n\r\n\r\nRyan Bartlett (29:00.994)\r\nto getting people to focus on who we are and what we are and what we stand for. like solving the three problems of number one, fit being like the biggest problem, feel the comfortability of just everyday clothing, and then price being this like I wanna make a premium garment at a reasonable price instead of charging $100 a shirt, I wanna charge like 15 bucks or whatever it was. And that was really the three things that I was trying to solve in the market and no one was nailing it.\r\n\r\n\r\nNikolas Hulewsky (29:29.658)\r\nSo as a consumer, you knew that there was a problem. You did a little bit of research. You saw some of these companies. And then as the business guy who literally had had a digital agency, obviously you have the music experience as well, you're like, nobody is marketing this. It just was kind of the meeting of the two.\r\n\r\n\r\nRyan Bartlett (29:46.004)\r\nYeah, no one's isolating the actual problems and talking about it, which actually is really good news for literally anyone starting any product, was if you look at an industry and you look at a vertical and you feel very underwhelmed, that means there is unbelievable white space for you to go off and do something amazing. Now that takes vision. It definitely takes a certain amount of real confidence to execute on that vision. And that was what I had built into me.\r\n\r\n\r\nfrom all those years of doing so many things. So it's just the perfect storm of like vision, opportunity, seeing a white space, and then me having enough confidence and a little bit of crazy to go like, am I really gonna like start a t-shirt brand in this day and age? Like I told my wife this idea and she was just like, there's gotta be something else. Like you're not really gonna try to sell like plain t-shirts, right? Like this isn't, and I'm just like, no, no, no, you don't understand.\r\n\r\n\r\nNikolas Hulewsky (30:34.202)\r\nHa!\r\n\r\n\r\nRyan Bartlett (30:41.806)\r\nThese guys are dinosaurs. Like they're they're underdoing it. I'm telling you, I'm gonna make lot of swings at this and it's gonna make waves and I'm gonna show you and that's exactly what happened.\r\n\r\n\r\nNikolas Hulewsky (30:54.17)\r\nThat's funny. That's funny. My wife would have been like, are we still making 100 grand a month with the agency? Yeah. Okay. Whatever. Do whatever you want to do. Have you heard? I'm sure you've heard of the like the fat pitch philosophy from Warren Buffett. Or so he got it from Ted Williams. Ted Williams is one of the greatest hitters of all time. Are you a big baseball fan or not so much? Okay. So the crazy thing about baseball is that for it be a Hall of Famer, basically, you got to hit the ball 30 % of the time.\r\n\r\n\r\nRyan Bartlett (30:59.244)\r\nYeah, exactly.\r\n\r\n\r\nRyan Bartlett (31:07.054)\r\nMm-mm.\r\n\r\n\r\nRyan Bartlett (31:14.626)\r\nI used to be when I was young,\r\n\r\n\r\nNikolas Hulewsky (31:23.61)\r\n30%, three times out of 10 and all of sudden you're a Hall of Famer. That's how hard it is to hit a ball in baseball. Well, Ted Williams, he played probably 80 years ago. He had a couple of seasons where he hit the ball 40 % of the time, four times out of 10. It's crazy. And he would talk about this thing where he broke down the strike zone into 27 different sections and he knew exactly where his fat pitches were. Yes, the ball would be in the strike zone and it was technically hittable for him, but it wasn't his fat pitch. There was a certain area where he had a much higher percentage chance of hitting the ball.\r\n\r\n\r\nAnd so he'd wait, he'd sit and he'd wait on those pitches until it entered the head zone. And obviously he'd take a hit. Warren Buffett has taken that and he's like, we at Berkshire wait for our fat pitches. We're not just like placing a million bets on a million things. We know what we know. And when we see an opportunity, we go big. And I love that philosophy because I think that for many of us, there's a couple of times in our life where there's a fat pitch and we got to make a decision. Knowing everything that I know, I have an unfair advantage. I think I see the future.\r\n\r\n\r\nI'm going to go ahead and make a bet on this. And the question is just whether or not you're willing to bet big. And for you, it sounds like you're like, I think this is a fat pitch.\r\n\r\n\r\nRyan Bartlett (32:31.818)\r\nIt was, but I also felt like even if it doesn't work, so what? And I think that a lot of people I talk to, a lot of young entrepreneurs are so worried about failure and having failed so many times, it just did not feel like it was such a risky thing for me to try to build a t-shirt brand. If it doesn't work, I just close shop and move on. Like I didn't care. I was just like, I'll move to the next thing. Right? It would have been.\r\n\r\n\r\nNikolas Hulewsky (32:38.49)\r\n.\r\n\r\n\r\nRyan Bartlett (32:55.83)\r\nIf it wasn't True Classic, it would have been a Lab Diamond. If it wasn't Lab Diamond, it would have been Matcha. I would have just kept going until I nailed something. It just so happens that True Classic worked.\r\n\r\n\r\nNikolas Hulewsky (33:05.562)\r\nWell, I think and I think that's a really good thing to bring up like Ted Williams. If the ball enters his strike zone, he could get a single, a double, a triple or home run like he's just going to make contact with the ball and it doesn't even necessarily mean he's going to get off base. It just means that he gets on 40 % of the time as opposed to 30 % of the time, but being disciplined enough to know when to swing and when not to swing I think is an important piece and to not be scared of failure. Like you said, if I fail, what the data set is here. I know that I should take this swing, so I'm going to do that.\r\n\r\n\r\nRyan Bartlett (33:25.944)\r\nYeah.\r\n\r\n\r\nRyan Bartlett (33:36.078)\r\nSo on the knowing part, you're right. There is a component of business to where it's like you can go into a million things, but knowing what to focus on is truly very important. And I was passionate about this particular space. I also did my homework, right? So for anybody listening that is in that like, I could do anything mode, yes, you can technically, but you have to do something that you actually want to.\r\n\r\n\r\nbleed your eyes out doing every day for years and years and years, or you will absolutely not make it. You have to love providing real value in the form of some product that you can stand behind. It can't just be like, I saw Mr. Beast make chocolate bars, I want to make chocolate bars. It just can't be that because you'll get so tired of chocolate after six months that you'll never want to look at it again because it'll be such a difficult business. So like I was willing to\r\n\r\n\r\nplay the long game on clothing to try to make it work because I loved it that much. But a lot of it again goes back to like when you say the 40 % doing my homework got me to that 40 % where I knew I was it was higher than 40. It was like 80 to 90. That was what I was swinging on to get there because I did so much work and research and research and just every night on my phone talking to\r\n\r\n\r\nNikolas Hulewsky (34:46.361)\r\nRight.\r\n\r\n\r\nRyan Bartlett (35:00.875)\r\napparel people are going into Facebook groups are going on to Amazon and validating product options and like I was obsessed with learning and I think that is that is a big part that people don't talk a lot about.\r\n\r\n\r\nNikolas Hulewsky (35:13.102)\r\nYeah, I think the curiosity pieces is massive. did you, I'm just curious, did you ever struggle with like, man, what am I doing? I wasted so much time. Because you can easily look back on 10 years wasted music, poker, whatever.\r\n\r\n\r\nRyan Bartlett (35:16.301)\r\nIt's huge.\r\n\r\n\r\nRyan Bartlett (35:27.298)\r\nYeah, mean, the absolutely dude, I feel like music and poker were a huge waste on a lot of levels, but I do derive a lot of skills from those industries that I've been able to pass on through business music, but the creative poker with the incredible risk tolerance. I mean, you we take bets here on product inventory to the tune of tens of millions of dollars on a whim in a boardroom in a 30 minute meeting. like if I didn't have\r\n\r\n\r\nNikolas Hulewsky (35:37.849)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (35:49.966)\r\nMmm.\r\n\r\n\r\nRyan Bartlett (35:56.136)\r\nso much at stake in poker in the early days and I was able to put my rent on the line today, I would not feel comfortable making those bets, but it's just, you know, I have a lot of grit and determination and will to bet on myself and the upside that it just feels normal for me to take bets at this point.\r\n\r\n\r\nNikolas Hulewsky (36:14.028)\r\nLooking back though, do you look at it now and you're like, okay, yep, it's a good thing that I had those experiences. during, that's what I was gonna say is like close to it or even like during it, were you beating yourself up? Were you like, I'm such a moron or did you move on pretty quick?\r\n\r\n\r\nRyan Bartlett (36:20.65)\r\nIt is now. Yeah.\r\n\r\n\r\nRyan Bartlett (36:29.406)\r\nAbsolutely, dude. I did move on, but like, I think at the time you reflect on how much time wasted there was and man, I wish like when I talk to guys that are young and they're crushing it, I'm just like so jealous. I'm like, my God, like, because I punted my 20s. So I'm just like, you're already this far along in your mid 20s, dude, you're going to absolutely crush it by your mid 30s. Like it wasn't till my like early to mid 30s that I started crushing it. So\r\n\r\n\r\nBut I also didn't beat myself off about it too much. was just like, I was always an eternal optimist. So I'm just like, know, chalk it up to a few failures, but we'll figure it out eventually.\r\n\r\n\r\nNikolas Hulewsky (37:12.164)\r\nSee, I don't know. Maybe this is me just making myself feel better. I think life's about finding leverage points where you can bet really big. And some people find those leverage points in their 20s. And some people find them when they're 40 and they launch a business. And the timing sucks. Yeah, I'd love to have found those leverage points earlier. But also, frankly for me, I wouldn't have been able to take advantage of some of those leverage points in my 20s. Because I didn't have the maturity. I didn't have the dexterity or the...\r\n\r\n\r\nRyan Bartlett (37:37.538)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (37:40.782)\r\nthe knowledge to actually take advantage of them. So as much as I would have loved to be killing it, I just wouldn't have been killing it, which is hard to say sometimes. I wish I could say that differently.\r\n\r\n\r\nRyan Bartlett (37:49.934)\r\nI think leverage is an interesting game that you bring up because even at this level, six years in, I am constantly trying to create leverage for myself. And so has Ben, like we're one of my executives. Like we, that is the full game at our level is like, how do you create leverage and get your time back so that you can focus on the things that really matter? Like I want to focus more on philanthropy. I want to focus more on feeling, making people feel good, making people look good.\r\n\r\n\r\nNikolas Hulewsky (38:01.082)\r\nThank\r\n\r\n\r\nRyan Bartlett (38:15.394)\r\nhelping with initiatives that help the company or help, you know, homeless people or whatever it is. Like I want to do the stuff that I want to do, not the stuff that the business demands of me. Because man, does it really demand every second of my attention.\r\n\r\n\r\nNikolas Hulewsky (38:28.92)\r\nWhen did you make that switch? I'm assuming, well, actually, let me step back. How quickly did you get to hundreds of millions of dollars in revenue a year? Okay, I'm gonna say that's because of your genius. Is that fair? You might be humble and.\r\n\r\n\r\nRyan Bartlett (38:32.791)\r\nYeah.\r\n\r\n\r\nRyan Bartlett (38:38.808)\r\nyears.\r\n\r\n\r\nRyan Bartlett (38:45.83)\r\nIt's partly. I hate giving myself all the credit, but no, I would I would say is like part of it is I had amazing co founders that that truly is part of the luck factor here is like I had great co founders that believed in me who were willing to not step on my toes and just let me be me and do what I do and not.\r\n\r\n\r\nfight back on things, but actually be real leverage for me in spots that I'm deficient in. like Matt, for instance, was like the CFO finance &A guy. Nick was like the apparel manufacturing, knows how to talk to that world and bring my apparel vision to life guy. And the three of our, you know, trifecta DNA just played the absolute perfect full circle picture of what it took to really build this business. So that was big.\r\n\r\n\r\nNikolas Hulewsky (39:22.202)\r\nSure.\r\n\r\n\r\nNikolas Hulewsky (39:31.81)\r\nYeah, I guess set a diff set a different way. I would say you played your role to perfection, right? It's like you were Steph Curry on the warrior. You needed to just shoot freeze and you you played that role.\r\n\r\n\r\nRyan Bartlett (39:43.692)\r\nYes, but I needed Draymond and I needed Clay Thompson. I had to have those guys to make it all work.\r\n\r\n\r\nNikolas Hulewsky (39:50.264)\r\nYes. When did you get to the point where you're like, you know what? I know that my native genius got us here, but now I need to kind of pivot out.\r\n\r\n\r\nRyan Bartlett (39:58.134)\r\nYeah, right after we hit 100 million. So basically year right after year two, we hit 100 million. And I was like, okay, it's getting too big now. And I don't I'm uncomfortable managing this size of a team. I'd never dealt with like HR and like all this other bullshit that came along with business. I had to just like figure out on the fly.\r\n\r\n\r\nNikolas Hulewsky (40:14.158)\r\nYeah.\r\n\r\n\r\nRyan Bartlett (40:21.42)\r\nAnd also just like scalability issues that I had never encountered or dealt with and three PLs going out of business. And I mean, you name it, dude, there was like a million fires. Even to this day, we have a million fires. But it wasn't until I brought Ben on, who's our current CEO, that he created unbelievable leverage for me. And he was a version of me, but even more intelligent and just like could figure any... He was like a...\r\n\r\n\r\nyou know, UCLA grad, business grad, like the guy just, worked at Metta, like uber smart, like, you know, he's always the smartest guy in the room. And that is what it takes to create leverage. You got to find those people and then you have to also convince them to come aboard and see the vision that you see. Because he had a really cushy life. He didn't need to come to this, you know, fire startup where everything's just chaotic. It's like a fucking zoo here, man. It's just wild animals running around in the office like every day. It's just nuts.\r\n\r\n\r\nNikolas Hulewsky (40:52.217)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (41:17.658)\r\nOh my gosh, dude. I mean, that's the thing, whether it's a hundred million dollar company or a $5 million business, as you grow, you hit new inflection points. And it's like, okay, at $250,000 in revenue, my skillset was amazing at a million dollars in revenue. I don't know what the freak I'm doing. I got to bring other people in. Was it hard for you to recognize that? Or was it pretty obvious like,\r\n\r\n\r\nRyan Bartlett (41:30.519)\r\nYeah.\r\n\r\n\r\nRyan Bartlett (41:35.434)\r\nNo, it wasn't hard because I was drowning and I was just like, I'm very, I have super high awareness of what my capacity is and what my ceiling is talent wise. I knew that I would always be good for this company in the creative aspect. Like I still to this day, I can out creative just about anybody. It's just like my thing. Like I'm just, that's what I'm really good at. Not so good at ops, not so good at finance.\r\n\r\n\r\nNikolas Hulewsky (41:57.946)\r\nMm-hmm.\r\n\r\n\r\nRyan Bartlett (42:01.12)\r\nnot so good at many parts of this business, but what I am good at, I'm the best at. And that is why I'm still kind of useful to this company. But I would say that like in the early days, we had just a lot of scrappy entrepreneurs. Like everyone that worked for us was like a multifaceted, jack of all trades kind of guy. And that worked really well in the early years because everyone was doing the job of like five to 10 people. Now, you need like\r\n\r\n\r\nabsolute specialists in everything that you do. Like you need a real CFO, not like a guy who knows finance and accounting a little bit, right? Like it needs to be really focused. So that's a big transition everyone's got to make though.\r\n\r\n\r\nNikolas Hulewsky (42:36.068)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (42:40.996)\r\nHave you found that transition hard? Because what I've noticed, I've done it a couple of times with businesses that have scaled. The people that you hire to go from, let's say, zero to 50 or zero to 100 million, they're not the same people who I would hire at 100 million. And it's hard sometimes because either they leave because they're not happy anymore or you've got to let them go because the team is suffering. But that's freaking hard because they were there in the beginning. Has that been a, have you dealt with any of that at all?\r\n\r\n\r\nRyan Bartlett (42:53.218)\r\nCompletely different. Completely different.\r\n\r\n\r\nRyan Bartlett (43:07.552)\r\nIt's the hardest part of it. There's no question, and I think you know this, that the people component to business is always the harder part of business. I actually think business is wildly easy. think it's complex, but the challenges are always wildly easy to solve in the big scheme of things. There's just nothing, Ben and I always say that, there's just like nothing we can't figure out, and we always do. Even when things seem stacked up against us and there doesn't seem to be a way out, we find a way out.\r\n\r\n\r\nBut I would say people are so unbelievably complex and they're going through their own journeys that you have no nothing about. And then one day they just up and quit. And then you find out later that they were so in their head about something and that wasn't even reality. They just were in their head about it. They didn't bother to reach out and they were stewing on it. And then they just gave up and quit. And so, you know, I guess you learn to touch base more with people and find out where they are in their current journey. And that helps you get to the truth.\r\n\r\n\r\nof where they're actually at versus where you think they're at. Because people play a game, right? They act like everything's fine. And then one day they're just gone. And then you look back and you're like, damn, what could I have done? Like, they didn't actually need to go anywhere. I would have actually promoted them. I would have given them more money, more opportunity. I would have given them everything. But they were just like, there's no more upside here. So I'm capped on the ceiling here. So I got to go find something else. But it's very difficult.\r\n\r\n\r\nNikolas Hulewsky (44:11.951)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (44:32.836)\r\nYeah. I've done it a couple times and I hate it where like, I find out somebody was like, Oh, I thought you didn't want me here. You know, like, we'll like reconnect a year later or something. And I'll be like, dude, no, I hurt my feelings. Like I, I really enjoy you were here from the beginning and I enjoy working with you. What did I do wrong? Like, I feel like I screwed up a relationship that I had actually found really valuable, but you don't have time to like sit and stew and figure that out. You got to move on to the next thing because there's another fire the next day. It's just, it's\r\n\r\n\r\nRyan Bartlett (44:49.325)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (45:01.21)\r\nIt's a hard part about scaling hyper fast.\r\n\r\n\r\nRyan Bartlett (45:04.076)\r\nYeah, and if you have a lot of people, how can you possibly sit there and talk to every single one of them every single day? Like, it's quite literally almost impossible. You can touch base very quickly, but if you don't sit there for real extended time periods, you're never gonna get to the actual route of where they're at. And that takes really detailed questions, it takes a lot of them opening up.\r\n\r\n\r\nAnd no one's going to just sit on a five minute huddle and open up it like really quickly off the top of their head about what's really happening deep down. Like it just doesn't work that way. Right. So you're right. It's, it's, it's a difficult journey though.\r\n\r\n\r\nNikolas Hulewsky (45:32.858)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (45:40.398)\r\nIt's hard though, it's hard to make the switch because you, at least when you're building businesses, you feel productive when you're doing something. I ran a Facebook ad today and I got a, you three X ROAS, right? Money hit the bank. I immediately see it. There's immediate feedback. When you start growing and you realize, people are the ones who are executing on my vision. I got to go build relationships with them. There is not that immediacy with the feedback. Did you find it hard to make the switch of like, okay, I got to be more people focused?\r\n\r\n\r\nRyan Bartlett (46:04.696)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (46:08.686)\r\nthan necessarily ops focused or did that just come over time?\r\n\r\n\r\nRyan Bartlett (46:13.422)\r\nI would say it came over time. I also learned the hard way like you where like people would leave and then you'd find out why and you'd realize in hindsight that like I just didn't do enough to communicate and there's so much of my job really needs to be that even though I do need to actually solve problems for the business because there's so many problems. So it's just this constant juggling of people's feelings, what you can help them do in life, but then also like the business is a machine that I just have to\r\n\r\n\r\nadhere to. I have to give it my attention as well. So you need to find other really great managers that can do that job for you. I think is really the punchline. And now we do have those people who can help soften and figure out where that person is without me actually having to be the one to get it out of them.\r\n\r\n\r\nNikolas Hulewsky (46:45.006)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (46:50.042)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (47:01.336)\r\nAre you continuing to focus on the stuff that you feel like is your native genius? Like, are you focusing a lot on the marketing, creative, branding?\r\n\r\n\r\nRyan Bartlett (47:07.616)\r\nIf I can, yeah, I would say that it changes. Like there's some weeks where I am heads down trying to solve a really tough problem and there's other weeks where I'm just like making content all week and it's like amazing. So it just ebbs and flows with the state of the business.\r\n\r\n\r\nNikolas Hulewsky (47:10.701)\r\nand\r\n\r\n\r\nNikolas Hulewsky (47:21.804)\r\nIf you could go back to your, to you, 20 year old Ryan, or let's say 25 year old Ryan, who's just like in the middle of it, what advice would you give yourself?\r\n\r\n\r\nRyan Bartlett (47:32.13)\r\nI would have told myself that I don't need to make music, I don't need to make money from music, and I don't need to make money from poker. I can do both of those things and just have them be fun hobbies, and I don't have to do it for a living to actually make a living. I can be completely fulfilled doing something else, making money, something being an entrepreneur or a business, and I would have just, it would have started me a lot sooner than later. It would have saved a lot of time and energy, but then in hindsight,\r\n\r\n\r\nyou know, it did help develop those muscles that got me here in the first place. So it's hard to say like, would I have changed anything? Probably not. Would it have been nice to maybe take a few years off of each of those industries and give back to the business? Probably.\r\n\r\n\r\nNikolas Hulewsky (48:16.122)\r\nYeah, when I talk to people, sometimes they're like, I would have told myself to not be so hard on myself. You know, go easier, you're gonna be fine. I'm always like, well, did you end up being fine because you were hard on yourself? You know, I'm not saying like, sit in your closet and be like, you stupid idiot, you're the worst person I've ever, like, yeah, don't do that stuff. But you kind of needed that fire to get to the next level. What advice would you give to a 30 year old, 35 year old, 40 year old?\r\n\r\n\r\nRyan Bartlett (48:28.173)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (48:45.22)\r\nwho is sitting there thinking, gosh, what have I done? Okay, I have some skills. I didn't really leave my dent in the universe. I didn't really leave my mark. What am I gonna do?\r\n\r\n\r\nRyan Bartlett (48:50.979)\r\nYeah.\r\n\r\n\r\nRyan Bartlett (48:56.354)\r\nI think that there is, listen, there's a couple things going for people that are in that age range with what we have in our day and age, which is like this unbelievable technology and AI and all these things that are evolving very quickly to help businesses get more visibility and do a lot better, a lot easier. I mean, just to live in a time where we have the ability to leverage Facebook ads is one in a trillion. Like, there's no true classic without Facebook ads. just, I'm happy to admit that, that like there is a certain amount of luck\r\n\r\n\r\nthat I lived through the years of Zuckerberg and a lot of businesses, you know, from the 90s and below just didn't and they didn't have that luxury. you know, that I'm very thankful for. But what I would say is that, you know, you don't need a lot of money to start something these days. That's a that's the great news. You have an unbelievable distribution engine like Facebook that you can test things on at a very small scale for not a lot of money. I mean, you can start.\r\n\r\n\r\ndrop shipping items and flip a few products for a few hundred bucks very quickly and easily and turn a profit on little to no effort on literally a few hundred bucks on literally just some elbow grease, getting some products in a Shopify store, connecting the right apps, having everything kind of working for you. That's provided you've done the research to know how to set it all up correctly. But like there's just the white space is endless for starting something. I think people just get in their heads about\r\n\r\n\r\nI gotta have the perfect plan in place to get it or it's gonna fail and it's like, yeah, so what? Then what? Then you do it again and you try something else and then you fail again. So what? Then you move on again and you just keep going and going and going. But people are stuck in this mindset of like, I gotta get it right the first time or I'm dead. And then I just instantly die. The end. I can never do anything again. It's like, dude, life is long. You have a long time to figure this out.\r\n\r\n\r\nAnd you don't have to do a product for like 50 years. You can try it for like two or three months. See how it goes. What did you learn? Did it grow at all? If not, kill it. Try something else, right? So like nothing is final. I get this attitude from people that like, if I do this thing, it's the end of me if it doesn't work. And it's like, my God, dude, it's not that serious.\r\n\r\n\r\nNikolas Hulewsky (51:08.972)\r\nAnd it's almost like the failure. Let's say you do do something and you fail. It kind of sets you free because you realize, that's that's what I was worried about. I can do this again. Dude, I love it. I love that. Right.\r\n\r\n\r\nRyan Bartlett (51:15.278)\r\nYeah, the world didn't come crashing down on me. It just went away. Right. That's what drop shipping is good for. Honestly, if there's one thing I would leave people with, it's that if you learn drop shipping and you learn that a product doesn't work, you move on to the next product. And then if that doesn't work, you move on to the next, and you just keep going until you find a winner, and then you scale a winner, and it makes you realize that I actually had to fail 12 times to get to the 13th winner.\r\n\r\n\r\nRight? And business is exactly the same way. Now, hopefully you don't have to fail 12 businesses to get to the 13th business, but you may have to, you know, eat a few businesses, three or four or even five before you get to your scalable e-comm company that gets you to where you want to be.\r\n\r\n\r\nNikolas Hulewsky (51:59.962)\r\nWell, it's building the muscle. It's just you're building like muscle memory on identifying, this product work just doesn't work. this, marketing creative works. This marketing creative doesn't work that how I treat people this way works. How I treat people that way doesn't work. every single experience can be a muscle building experience. And it's easy to say looking back on that, but I just am like encouraging you that if you're in the thick of it right now and you feel like what the frick am I even doing? Everything is compounding and there will be a point in your life where there is a\r\n\r\n\r\nRyan Bartlett (52:19.575)\r\nRight.\r\n\r\n\r\nRyan Bartlett (52:27.566)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (52:29.646)\r\nYou can take a fat swing and you're not only just gonna get one fat swing, you'll get multiple fat swings. The trick is don't die when you take that one.\r\n\r\n\r\nRyan Bartlett (52:37.622)\r\nAnd don't get, yeah, exactly. Don't kill yourself over one mistake. I would also say that like, if you have a way, and I don't know if there is a way, I'm sure there is. If you have a way to develop creativity, I do think it's the ultimate hack in business. I think without it, we are just another t-shirt company putting out average content like everybody else, and we're not getting this surge and through line that puts us above everybody else. If you have a way to develop that creativity,\r\n\r\n\r\nI think you'll look back and realize how unbelievable of a superpower it actually is in business, not just with product innovation or creativity, but how you deal with people, how you show up in meetings, how you find solutions in a room of people that, you know, I sit in these rooms sometime with these people who are all smarter than me and somehow some way I'm able to navigate out of a situation quicker than all of them because creativity leads you to the real answer, not what the smartest answer in the room actually is.\r\n\r\n\r\nRight? And I know my strengths, but I also know that creativity breaks through all the noise and all the intelligence hands down, and it has gotten me some unbelievable solutions that none of these smart people could have thought of, because they were so stuck in what they thought the answer was, they weren't able to paint outside the lines. And man, that painting outside the lines is truly the real intelligence you need to see.\r\n\r\n\r\nNikolas Hulewsky (54:02.478)\r\nWell, I absolutely think creativity can be developed. Jerry Seinfeld talks about this a lot, where he sits and writes every single day. That's a part of his process. He writes whether he feels like it. He writes whether he doesn't feel like it. It's every single day. And so yeah, is there probably some level or some degree of innate creativity that some people have more than others? Sure. Just like there's going to be people like LeBron James who can just jump out of the gym. Yeah, that are just freaks. But then there's going to be other guys who are like, I'm going like way in my sports bag here. Bruce Bowen.\r\n\r\n\r\nRyan Bartlett (54:13.304)\r\nSo good.\r\n\r\n\r\nRyan Bartlett (54:24.994)\r\njust freaks. Yeah.\r\n\r\n\r\nNikolas Hulewsky (54:32.09)\r\nThey're not freaks. They just worked at their craft every single day and they tried and they got in and they figured out how to do something that was replicable. I think that creativity is very similar to that. There is definitely some innate creativity that you just either have or you don't, but you can develop the muscle. You can understand what is it about this phrasing that people like? How do I say something that captures attention but doesn't close the loop so that someone is actually willing to click to figure out what's on the other end of that ad creative?\r\n\r\n\r\nThere are definitely tricks and tactics that you can do. It just takes work. It's just work.\r\n\r\n\r\nRyan Bartlett (55:05.966)\r\nYeah. Yeah. By the way, have you been playing with Sora at all? I am obsessed. I think I have 700 Soras in my draft folder. Like I just sit in my bed at night now and I don't scroll anymore. I just create Sora videos nonstop for like three hours.\r\n\r\n\r\nNikolas Hulewsky (55:10.936)\r\nyeah. It's ridiculous, dude.\r\n\r\n\r\nNikolas Hulewsky (55:23.034)\r\nDo you, are they in your draft folder? Cause you're like, cause you're like, I can't, I can't like be that guy who's releasing 700. Oh, okay.\r\n\r\n\r\nRyan Bartlett (55:28.682)\r\nNo, I don't care about that. I don't care about that. You know what it is? Sora is one of those things where you have to do 10 to 15 iterations before you get a really good one. So I'll prompt it, I'll get a B- version. And then I'll prompt it again and I'll get to a B. And I'll have to keep prompting it until I get to the A because it's not a perfect system. It's wildly better than VO3 though, I will say that.\r\n\r\n\r\nbut it has been such a game changer. I just don't think people really realize what's happening with Sora just yet, but it is mind-blowingly amazing.\r\n\r\n\r\nNikolas Hulewsky (56:02.606)\r\nWhat are you using it for? Like what do you have 700 drafts for?\r\n\r\n\r\nRyan Bartlett (56:05.816)\r\nSo right now, I'm just using it for organic content on Instagram. Like I'm just creating posts that are funny, and I just put them out. And I just put them out on Instagram, and people laugh and say, this is hilarious, and that's it, that's it. It's just purely entertainment purposes. I don't need to make an ad. Yeah, I don't need to sell anything. I don't care about that. But yes, you can build ads with them. You can sell things with them. But I don't treat it like that personally. I just like to be creative and funny.\r\n\r\n\r\nNikolas Hulewsky (56:21.07)\r\npurely entertainment.\r\n\r\n\r\nNikolas Hulewsky (56:32.814)\r\nWell, I mean, again, you're building the muscle because I like I'll do the same thing, but you learn over time. You're like, I need to prompt it this way. I actually need to tell it explicitly to do this or not say anything about this.\r\n\r\n\r\nRyan Bartlett (56:43.15)\r\nSo it's actually getting better in that respect than ever before. So that is where VO3 came short. You used to have to prompt in like JSON language or some sort of arbitrary code language to really like nail the scene the way you wanted it to look. Whereas Sora, you can go as basic as one single sentence and it gets you like 90 % of the way there.\r\n\r\n\r\nwhich is the advancement from where VO was to where Sora is. And that's what makes it so much better because it levels the playing field with creators where you don't have to be an engineer to write a prompt anymore. You can just literally write a sentence that's funny and say, you know, I want to make a, like, have a guy.\r\n\r\n\r\nwin true classic and a price is right scenario. And boom, Bob Barker comes out and he's like, the price is right. And he opens the curtain and there's a pack of true classic sitting there. And you're just like, my God, I did that in 30 seconds with no effort.\r\n\r\n\r\nNikolas Hulewsky (57:41.004)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (57:46.554)\r\nThat's what I'm saying is even understanding how to put the simple sentence in place in order to get that version of sore that even looks good is still a skill. Like how to prompt chat, TBT to give me the answer that I want is a skill.\r\n\r\n\r\nRyan Bartlett (57:57.952)\r\nIt is. So you can do that in chat GPT a little bit. Like you can say, hey, sometimes I'll go to chat GPT and go, I want to create Sora videos. And I want to do it in a 10 second framework. Right? And it's going to be in portrait mode. So I want to do it around this concept. Can you give me some ideas that fit within 10 seconds, make them super short and punchy, make it dramatic, make it a thriller style, whatever it is, like whatever you're going for.\r\n\r\n\r\nand it'll give you like 10 versions. And then you can kind of look at the 10 and go, this one's kind of good, this one's, what I do is I'll take one that's kind of good and then I'll put my sauce on it and then it'll get me to the better version. So it doesn't come out perfect on Chagy BT and then you just copy that little excerpt, throw it back in Sora and let Sora try to create it.\r\n\r\n\r\nNikolas Hulewsky (58:46.17)\r\nCan you, have you ever done a series? Like that's the only thing that I can't quite figure out is the continuity. That's my thing is like, I'd love to do six of these 10 second videos and stitch them together, but.\r\n\r\n\r\nRyan Bartlett (58:51.502)\r\nNot yet. No, not yet.\r\n\r\n\r\nRyan Bartlett (58:57.55)\r\nWell, you won't need to, because pretty soon, they just advanced it to 25 seconds. They were at 10 seconds. Then they were at 15. Now the web version has 25. So pretty soon it's going to be up to a minute, and then two minutes. And then you're just going to be able to do one prompt and have a two minute long piece of creative that you won't even need to storyboard at all. You'll just tell it what to do, and it'll do the whole thing. It does have a storyboarding component now in the web application, by the way. They just rolled that out three days ago.\r\n\r\n\r\nNikolas Hulewsky (59:03.598)\r\nI didn't know that.\r\n\r\n\r\nNikolas Hulewsky (59:23.864)\r\nI haven't looked at it.\r\n\r\n\r\nRyan Bartlett (59:26.754)\r\nwhere you can storyboard the scene and then it'll break it down in increments of seconds. So it'll say like, if you want to do a, you do a sentence long prompt, it'll, it'll show you how to break it down. So in this part of the sentence, I want this to be like three seconds. And then in the next three seconds, I want it to do this. And then the last four seconds, I want it to end with this. And so it gives you kind of a play by play. Yeah. It's exciting. Yeah. They're already doing it.\r\n\r\n\r\nNikolas Hulewsky (59:49.452)\r\nmy gosh. Yeah, I see it. There's a storyboard. Holy crap. Well, dude, what do you think about the way that they released Sora? I'm curious to hear as a product person.\r\n\r\n\r\nRyan Bartlett (59:56.078)\r\nIt's happening so fast.\r\n\r\n\r\nRyan Bartlett (01:00:01.922)\r\nLike the invite only thing?\r\n\r\n\r\nNikolas Hulewsky (01:00:04.418)\r\nany of it. Before I give you my color, I'm just curious on what you think of how they did Sora.\r\n\r\n\r\nRyan Bartlett (01:00:09.72)\r\nI don't know really the background. just know that they did it super privately and it was part of Chi-I-G-B-T and I have an unlimited account because I create way more than 30 a day now. I'm just on fire with it. But yeah, I really have no context.\r\n\r\n\r\nNikolas Hulewsky (01:00:20.494)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (01:00:24.62)\r\nI think so the invite only was cool, whatever, cause it creates scarcity. But I think, I don't know that he thought of this, but releasing it as a social platform could turn out to be one of the most genius tactics ever because what it does is it, it makes the product stickier. It's not just some guy sitting for most of us, most people who aren't you, what am I going to create a Sora for? Like I don't, I don't need to have a, have a brandy thing, but\r\n\r\n\r\nRyan Bartlett (01:00:51.308)\r\nlove that part of it too, you're right.\r\n\r\n\r\nNikolas Hulewsky (01:00:54.522)\r\nIf you're on Soar and I'm on Soar and we're friends, dude, I'm sending you videos all the time. Hey, look, this is us on the top of the Eiffel Tower in 1870. Isn't that hilarious?\r\n\r\n\r\nRyan Bartlett (01:01:01.262)\r\nDude, listen to this. Last night, so I'm sure your wife loves this show, but last night I had my wife create an account and do a cameo just so I could create a love is blind between me and her on Sora. It was fucking amazing, And literally we both come out and we're like, my God, wow, you look great. And she's like, yeah, you're taller than I thought. And like, it's this whole like.\r\n\r\n\r\nIt was, she was dying. She's like, this is the greatest thing I've ever seen.\r\n\r\n\r\nNikolas Hulewsky (01:01:28.57)\r\nmy. Yeah. Yeah. And so now he's created, they've created this product and how do get people to use it? They create the social aspect to it. And so now they're sharing stuff back and forth. I just think that that's so smart because it's not just this niche product that's kind of standard, like nano banana standalone VO three standard, like what else am going to use it for? Yeah. Now there's this\r\n\r\n\r\nRyan Bartlett (01:01:41.474)\r\nYeah, dude.\r\n\r\n\r\nRyan Bartlett (01:01:47.394)\r\nVery smart. You're right. And the component of the remix is what makes it so easy to go, I love that creative. Let me remix it and do my own prompt. So if you see some monkey or some Donkey Kong swinging from building to building, you can just be like, put my grandma swinging building to building. And then it instantly changes it to your grandma. And then it's just this old lady swinging. And you can just do iterations of everyone else's creative.\r\n\r\n\r\nand it helps the creativity just flow unlimited, man. It's amazing.\r\n\r\n\r\nNikolas Hulewsky (01:02:18.778)\r\nHow do you view that? Like you're a creative person. You do this stuff for a living. How do you view this impacting the ability to run and generate ads? Is it detrimental to your job? It's the future. OK.\r\n\r\n\r\nRyan Bartlett (01:02:29.582)\r\nthink it's the future. No, no, I think it's all upside for us. I think that as long as you're not using it in a way where you are trying to kind of like we're an apparel company and we and we're focused on fit, we don't want to use fake AI models for to show off our fake digital clothing. Like that's the component I don't like about AI.\r\n\r\n\r\nBut everything else is fair game in my opinion. Like everything like entertaining content wise, that's why I'm playing in that space more than anything, because I see more of the upside there than anything. Yeah dude, and it's so easy to use and you don't have to know anything about anything to create content to use this and wield it well.\r\n\r\n\r\nNikolas Hulewsky (01:03:02.17)\r\nIt's just another tool in the tool belt.\r\n\r\n\r\nNikolas Hulewsky (01:03:11.29)\r\nDo you have any advice? How do you make your cameo look like you more? Like when I create stuff, sometimes it looks exactly like me and other times I'm like, who the freak did they think I was?\r\n\r\n\r\nRyan Bartlett (01:03:19.094)\r\nYeah, it's not it's I think it'll get better over time. I just don't think it's all the way there yet. I'm with you. Like I've tried to do different angles, different shots. I've recreated the cameo a few times, but a lot of it is lighting. I've realized that you really got to have the lighting dialed in to get every contour of your face and piece of it, because that's all it's using is really what it can see in the camera lens. So you got to make the most of the lighting to get the best picture you can.\r\n\r\n\r\nAnd even my wife last night, like, because she took the cameo without makeup on and then in the Love is Blind, she was wearing a dress, but she didn't have makeup on. So she was like, I don't like it. It doesn't show. I need makeup on or whatever. So I'm like, you have to recreate the cameo with makeup on. Like, that's it.\r\n\r\n\r\nNikolas Hulewsky (01:03:58.766)\r\nYeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (01:04:05.333)\r\nBecause you and I have hours of high definition video that we could upload. It could look really, really close to the way that we actually look. But my camera died, so that was fun. Never mind. All right, well, I'm going end it here. And I'm going to stop here. We'll upload it. I don't know why my camera died. Give me a second.\r\n\r\n\r\nRyan Bartlett (01:04:15.149)\r\nYeah.\r\n\r\n\r\nRyan Bartlett (01:04:29.357)\r\nIs it like a.",
  "metadata": {
    "duration": "",
    "date": "",
    "platform_source": "Google Drive"
  }
}