{
  "episode_number": "149",
  "episode_title": "How to Build a Business with AI Image Technology with Chris Koerner",
  "guest_name": "Chris Koerner",
  "business_name": "Go Rock, Oakbridge Advisory Services",
  "transcript": "﻿Chris Koerner (00:00.955)\r\nYou want me to start us? Okay. Let's talk about 4.0 image. Okay. That was annoying. Let's talk about 4.0 image generation. Okay. You have access yet? Okay. That's okay. That means everything I'm saying, not everything, but everything I've done will be fresh to you. Okay. So, my gosh, where do we begin? Chat GPT has always sucked with.\r\n\r\n\r\nNikolas Hulewsky (00:02.2)\r\nDude, let's do this thing. What are we waiting for? What are we waiting for? Too slow. Too slow.\r\n\r\n\r\nNikolas Hulewsky (00:15.182)\r\nNo.\r\n\r\n\r\nChris Koerner (00:28.795)\r\ngenerating images with words or numbers, right? That's gone.\r\n\r\n\r\nNikolas Hulewsky (00:33.811)\r\nAnd, and, sorry, sorry.\r\n\r\n\r\nChris Koerner (00:37.261)\r\nNo, that's fixed. That's And it hasn't. Yeah.\r\n\r\n\r\nNikolas Hulewsky (00:40.162)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (00:45.358)\r\nOkay, sorry, keep going.\r\n\r\n\r\nChris Koerner (00:46.391)\r\nIt hasn't really, hasn't really been able to edit pictures, right? But now it can. And if you're on Twitter, you've seen these pictures everywhere, maybe even on Instagram. A lot of people are playing with it. not all, pro accounts have this feature yet. Mine does thankfully. So I've been playing with it. for instance, I generated a picture of Ryan Gosling, wearing a Bucky's Beaver onesie with a hood on and it was\r\n\r\n\r\nNikolas Hulewsky (01:14.35)\r\nYou\r\n\r\n\r\nChris Koerner (01:15.491)\r\nAll I did was take the stock image from our website of the onesie, upload it and say, give me a picture of Ryan Gosling wearing this. And it was like, we can't, you know, due to copyright reasons, we can't generate an image of Ryan Gosling, but do want someone that looks like Ryan Gosling? And I'm like, yes. And it, it takes a while. Like it took three or four minutes to load and generate. Yeah. But like it's, it's Ryan Gosling. Like it's not a guy that looks like Ryan Gosling. It's him. And like the skin tones match.\r\n\r\n\r\nNikolas Hulewsky (01:33.975)\r\nReally?\r\n\r\n\r\nChris Koerner (01:43.788)\r\nIt does not look AI at all. Like, can I show you?\r\n\r\n\r\nNikolas Hulewsky (01:46.008)\r\nReally? Yes, please share your screen. By the way, I'm trying it right now just to see if I... Well, cause I've been trying it on my phone. It's not working on my phone. It is taking a while to load. So this might be a good sign. Cause what? my gosh. Are you freaking kidding me?\r\n\r\n\r\nChris Koerner (01:52.259)\r\nOkay, yeah, maybe it's ready.\r\n\r\n\r\nChris Koerner (02:02.203)\r\nAlright, can you see my screen?\r\n\r\n\r\nOkay.\r\n\r\n\r\nLike, it looks like him. And if you look really closely, the Bucky's logo is a little weird, like it's not supposed to have that whisker. But you really got to be looking for it. Okay, and this was my prompt. That's it. That's what I gave it.\r\n\r\n\r\nNikolas Hulewsky (02:11.028)\r\nNikolas Hulewsky (02:16.258)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (02:24.828)\r\nmy gosh.\r\n\r\n\r\nChris Koerner (02:25.029)\r\nShow Ryan Gosling wearing this looking sexy. I can't show Ryan Gosling in that outfit, but I can make a funny and flirty version of someone like him wearing it. Like that's not like Ryan Gosling. That's Ryan Gosling. Good job covering your butt, but come on.\r\n\r\n\r\nNikolas Hulewsky (02:36.502)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (02:41.79)\r\nmy gosh.\r\n\r\n\r\nChris Koerner (02:42.329)\r\nSo then, so then I said, I uploaded a picture of beaver nuggets just in a bag now show that same pic of him but he's showing in beaver nuggets with a look of joy on his face. Showering, showering. Image created. Look at his skin. Like look at his the crow. Well, like it's the opposite. It's the he has crow's feet on. It's not. It's not letting me.\r\n\r\n\r\nNikolas Hulewsky (02:58.38)\r\nI mean, his skin's always been flawless, but can you zoom in?\r\n\r\n\r\nNikolas Hulewsky (03:05.806)\r\nCan you zoom in for me? No, not letting you.\r\n\r\n\r\nChris Koerner (03:11.055)\r\nBut look how like the shading of his skin, like the lines. Okay.\r\n\r\n\r\nNikolas Hulewsky (03:16.738)\r\nYes, looks professional. The beaver nuggets look blurred.\r\n\r\n\r\nChris Koerner (03:21.125)\r\nYep. Yep. So then you had to go full Ashton Hall, right? I mean, what? He broke the internet. Okay, if you're listening, you don't know who Ashton Hall is, and you haven't been on the internet. He's this guy out of Alcorn State, he played football, supposedly he's five, five. Whereas on his football profile, he's five foot 11. And he posted his morning routine. And Nick, that thing got almost a billion views on Twitter.\r\n\r\n\r\nNikolas Hulewsky (03:48.056)\r\nCan we talk about Ashton Hall for a minute? Or is that gonna be too big of a squirrel?\r\n\r\n\r\nChris Koerner (03:49.947)\r\nAs long as it's not that big of a squirrel. Let's talk about it.\r\n\r\n\r\nNikolas Hulewsky (03:55.968)\r\nOkay. That dude's a genius. like the way that obviously it elicits a lot of hatred towards him. Cause you're like, who the freak is this guy? Yeah. Like who is he? The timestamps were odd. He's, he's in the air for four minutes as he's jumping into the pool. So like the whole video is his morning routine and it's minute by minute him walking through it. Yes.\r\n\r\n\r\nChris Koerner (03:58.651)\r\nif he's a genius.\r\n\r\n\r\nChris Koerner (04:05.369)\r\nwhich is why he's a genius.\r\n\r\n\r\nChris Koerner (04:15.321)\r\nYes. Every frame is memeable. It's not like a memeable video. It's every frame is viralable.\r\n\r\n\r\nNikolas Hulewsky (04:21.91)\r\nIt's like he said to AI, I want you to give me a frame by frame viral video concept that I'm gonna shoot and make me as hateable as possible. I'm good looking and have big muscles and I'm rich. know what I mean? It's just like mash those things together. It's crazy. Also, I just want, but I do wanna say, how big of a psychopath do you have to be to wear that much jewelry when you go and work out?\r\n\r\n\r\nChris Koerner (04:25.179)\r\nYes.\r\n\r\n\r\nChris Koerner (04:32.985)\r\nYeah. Yeah.\r\n\r\n\r\nChris Koerner (04:43.099)\r\nI just don't get me started. mean, but Nick, that's just part of the video, right? He probably doesn't actually wear that. But first of all, there, you can see online that he recently filed an eviction or like an eviction was filed against him. Like that's public data. So now that all this has gone viral, a lot of a lot of stuff has come out about him, which is, mean, five foot five, I don't know if that's true, but I heard it from a non reliable source.\r\n\r\n\r\nNikolas Hulewsky (04:44.846)\r\nI can't, I don't get it. I don't get it. Anyways.\r\n\r\n\r\nNikolas Hulewsky (05:02.311)\r\nreally?\r\n\r\n\r\nNikolas Hulewsky (05:11.682)\r\nmy gosh.\r\n\r\n\r\nChris Koerner (05:12.409)\r\nSo it's probably true. So I said, show this guy eating a massive box of Krispy Kremes with an asher next to him full of old cigs and a huge bottle of Coke by him as well as in Coca Cola. So then I got this. Okay.\r\n\r\n\r\nNikolas Hulewsky (05:26.158)\r\nto the next video.\r\n\r\n\r\nChris Koerner (05:29.146)\r\nIt does.\r\n\r\n\r\nI know. I know. And it looks like it's a little blurry, but there's nothing wrong with it. Like\r\n\r\n\r\nNikolas Hulewsky (05:38.961)\r\nthe Coca-Cola logo looks perfect.\r\n\r\n\r\nChris Koerner (05:43.703)\r\nit looks real yeah and then you got a different version with a bottle of Adderall right here but it just it looks real I mean you got a Peloton in the background with a red handle like\r\n\r\n\r\nNikolas Hulewsky (05:44.12)\r\nPerfect.\r\n\r\n\r\nNikolas Hulewsky (05:59.458)\r\nThis is where I think NFT technology is actually gonna come into play. Because you don't know what's real anymore, unless you have some type of attribution, something to show like, it's stamped with my blockchain or whatever, right? Because this is so good. this next picture. So if you can't see, Chris has been scrolling down and there's a picture of Chris on a billboard. This looks real.\r\n\r\n\r\nChris Koerner (06:04.837)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nChris Koerner (06:15.802)\r\nRight.\r\n\r\n\r\nChris Koerner (06:20.579)\r\nIt is.\r\n\r\n\r\nNikolas Hulewsky (06:28.108)\r\nLike it looks like you took this picture.\r\n\r\n\r\nChris Koerner (06:28.527)\r\nWell, so Simon made this, this is not AI yet. Simon made this, but I wanna switch out these three words with other, I'm trying to ABCD test this on Facebook ads.\r\n\r\n\r\nNikolas Hulewsky (06:39.16)\r\nSo, okay, so we're looking at a billboard. On the left-hand side is Chris. It's the Kerner Office Podcast logo, cover art. And on the right side it says, Still Rat Racing? The Kerner, the Kerner Office Pod! Because it's all capital letters. And then it shows where to go listen to it.\r\n\r\n\r\nChris Koerner (06:43.395)\r\nmy podcast cover art. Yep.\r\n\r\n\r\nChris Koerner (06:55.161)\r\nYeah, so I want to swap out still rat racing with all kinds of different things and see what people click on the most. So I said swap out still rat racing with quit your job. So it did this. So it switched out the person. That's not me anymore. My podcast art like I didn't want you to touch that but all the letters are still right. It changed like like it was a black background with white font. Now it's just black font. So it's like it's still is a work in progress when it comes to words. But\r\n\r\n\r\nNikolas Hulewsky (07:03.139)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (07:06.486)\r\nYeah, I was gonna say, who the frick is that?\r\n\r\n\r\nNikolas Hulewsky (07:19.021)\r\nYeah, yeah,\r\n\r\n\r\nChris Koerner (07:25.263)\r\nAnd then I was like, okay, no, don't fix it. And then it just said, still rat rock. So it's, it's getting there. It's getting there. Words are hard.\r\n\r\n\r\nNikolas Hulewsky (07:35.214)\r\nI was going to ask because in the past when you've tried to edit images, it just doesn't work. You have to start over almost. Is it the same way?\r\n\r\n\r\nChris Koerner (07:44.571)\r\nNo, it's better, but it's yeah, it's a lot better with words and letters, but it's not perfect. Of course.\r\n\r\n\r\nNikolas Hulewsky (07:53.294)\r\nThat is it. That is insane. What's interesting is to see each of these companies catching up with each other. So Grok, which is XAI Twitter, their LLM came out with image editing abilities like a week ago or two weeks ago. I can't remember like the timeline. And then all of a sudden OpenAI comes out with their edit image editing capabilities.\r\n\r\n\r\nChris Koerner (08:00.283)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (08:10.971)\r\nOkay.\r\n\r\n\r\nChris Koerner (08:17.051)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (08:21.746)\r\nWhat's the deep seat comes out and then all of sudden open AI comes out with their deep research like. I like these products are already existing. They're kind of just like waiting for the first person to bring it to market and then they're going for it is what it seems like.\r\n\r\n\r\nChris Koerner (08:28.933)\r\nYeah.\r\n\r\n\r\nChris Koerner (08:33.209)\r\nYeah. So we got to talk about businesses. can start with this new image generation thing, Nick. think there's going to be a whole new class of chat GPT wrappers that can be built just on top of this one feature. Okay. Absolutely. There is. Can I, can I tell you one of my favorite ideas for this? Okay. There's a class of like niche kind of indie SaaS projects and just\r\n\r\n\r\nNikolas Hulewsky (08:38.669)\r\nAbsolutely.\r\n\r\n\r\nNikolas Hulewsky (08:47.35)\r\nAbsolutely there is.\r\n\r\n\r\nNikolas Hulewsky (08:53.635)\r\nYes.\r\n\r\n\r\nChris Koerner (09:02.479)\r\nI don't know why, but for whatever reason, SAS projects, companies, apps built around resumes and jobs do really, really well. Probably because people are, they're in a productivity state of mind. They're trying to better their lives. They're willing to spend some money because they're about to get a job. That stuff just does really well. So why not like a, now this domain name is taken visual resume.com and the, the landing page looks kind of like replica. It's just a prompt.\r\n\r\n\r\nAnd you've got some pictures of what resumes could look like the like before and after pictures on the website. And for five bucks, you just upload your resume, and it just spits out an infographic of your resume, something that just looks beautiful, but delivers all the same info so you can stand out unlimited revisions, $5, you must put your email in to get delivery of it. So you get an email and you get $5. What do we think?\r\n\r\n\r\nNikolas Hulewsky (09:49.922)\r\nYeah, that's fantastic idea.\r\n\r\n\r\nNikolas Hulewsky (09:56.686)\r\nI think it's a fantastic idea. How would you build it?\r\n\r\n\r\nChris Koerner (10:01.194)\r\ncursor or uplift or lovable or whatever. Like this would be very, very simple. You know what saying?\r\n\r\n\r\nNikolas Hulewsky (10:04.684)\r\nOkay, so you very simple is would it be an app that you like actually have on your phone or is this a desktop?\r\n\r\n\r\nChris Koerner (10:11.675)\r\nI don't think it needs to be. I think you could turn it into a recurring product. Like you could use those emails to upsell them to a proper iPhone app. That's 9.99 a month, like unlimited image, you know, regeneration, image fixing, whatever it is. But this would be like your foot in the door to do all that.\r\n\r\n\r\nNikolas Hulewsky (10:31.054)\r\nOkay, again, we didn't talk about this beforehand, but you ready for me to bring this full circle?\r\n\r\n\r\nChris Koerner (10:34.947)\r\nI've never been more ready for anything in my\r\n\r\n\r\nNikolas Hulewsky (10:36.782)\r\nDo you remember in the fall when I was complaining about taking family pictures? And we brainstormed on the idea of like, why not? Like this is now to the point where it's the use case. Upload your family.\r\n\r\n\r\nChris Koerner (10:41.049)\r\nYeah. Yep.\r\n\r\n\r\nChris Koerner (10:48.217)\r\nOkay, what are we doing Nick send me a family picture right now and I'll share my screen and I'll swap you out in like an old country time photo and we'll see if it works.\r\n\r\n\r\nNikolas Hulewsky (10:55.638)\r\nHuh? Okay, hold on, let me go find it.\r\n\r\n\r\nNikolas Hulewsky (11:01.398)\r\nHmm with my kid look just me or my kids\r\n\r\n\r\nChris Koerner (11:07.717)\r\nwhole family we can we can blur out the faces we'll blur out your face\r\n\r\n\r\nNikolas Hulewsky (11:13.822)\r\ncoming to you in three two what\r\n\r\n\r\nChris Koerner (11:21.227)\r\nYou just you just missed a great joke opportunity. could be like, my wife doesn't let me come to the family picture. She says I ruin them. You could have said something very self deprecating right there and you missed it.\r\n\r\n\r\nNikolas Hulewsky (11:30.19)\r\nOkay, Chris, now you're gonna get this picture. It's gonna look a little different than me. Usually when we do family pictures, she has a stand-in. Because she says I make weird faces.\r\n\r\n\r\nChris Koerner (11:38.171)\r\nYou\r\n\r\n\r\nOkay, all right, let's do this. So what?\r\n\r\n\r\nNikolas Hulewsky (11:45.006)\r\nOkay, but while you're doing that to remind people of the premise, we wouldn't have family pictures and it's a horrible experience, especially when you have young kids. You're trying to take them for like the Christmas photos. So you don't want to be looking like you're at the beach, but then it's still warm weather. So you're sweating like crazy. You've got young kids running around, one kid smiling, one kid's pissed off. In fact, the picture that I sent you, one of my kids is pissed off. So this will be fun to see, like, can we make them smile? Yeah.\r\n\r\n\r\nChris Koerner (11:57.199)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (12:10.381)\r\nThat's very clear. He looks like that a lot though.\r\n\r\n\r\nNikolas Hulewsky (12:14.968)\r\nThat's just his face. Anyways, and so what we talked about was like, why isn't there something where I can just send family pictures, just good pictures to my photographer throughout the year. And then we get to the end of the year and it's like, Hey, I'm ready for you to make me my family portrait. And they just, take the pictures, they run them together and they spit out. You could probably build a rap album, Okay. You know how this week I built a survey. It was fun. I like found these questions, built a survey, and then it spit out output.\r\n\r\n\r\nChris Koerner (12:24.592)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (12:30.863)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (12:45.006)\r\neasily build a survey. So let's say you're a photographer or even a digital artist, digital marketer. You just build a survey that says, what was that?\r\n\r\n\r\nChris Koerner (12:56.451)\r\nNo, let's keep going.\r\n\r\n\r\nNikolas Hulewsky (12:56.93)\r\nThat's Anyways, you just, you just built a survey that says, Hey, tell me a little bit about your family. What kind of picture you would like. what are the cool things you did this year? What are your favorite places? Whatever. And then you who's putting all this stuff together, you get the information from their survey, take their pictures, merge them together, and then tell AI, Hey, generate me 10 ideas for this. And then you send it to the family and they're like, I don't like this background. so and so looks weird. Whatever. Then there's like unlimited revisions.\r\n\r\n\r\nChris Koerner (13:04.176)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (13:24.037)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (13:26.05)\r\nYou don't have to just do it like one time, try to get a blemish or something.\r\n\r\n\r\nChris Koerner (13:30.327)\r\nHmm. Photographers are toast. They're toast. No, they just need to learn these skills. And then they'll be, you know, they'll be supercharged.\r\n\r\n\r\nNikolas Hulewsky (13:35.534)\r\nIt's never been more over for photographers than it is right now.\r\n\r\n\r\nNikolas Hulewsky (13:45.71)\r\nOkay, while you're doing that, I'll share my screen real quick because it turns out I do have access.\r\n\r\n\r\nNikolas Hulewsky (13:57.388)\r\nand I'm excited to share it.\r\n\r\n\r\nI just grabbed a random picture on my desktop, which happens to be me and Gertley. And so I just said, I want you to make this an anime style picture. And this is what it generated for me. It was pretty good. my gosh. Like it kept the background. Like it has my, my remote here for the fan. It's got it's Japanese turning Japanese. really think so. It's got the brick. It's got the brick in the background. Grandma.\r\n\r\n\r\nChris Koerner (14:12.645)\r\nOkay.\r\n\r\n\r\nChris Koerner (14:16.057)\r\nWow, that's good.\r\n\r\n\r\nYou look Japanese.\r\n\r\n\r\nNikolas Hulewsky (14:33.016)\r\nBreaking the background. it's got the Shure mic. What? Granted it says Shube, but that's okay. My eyes are blue and very big. They're very big. My hair, that's okay. Hey, that's okay. It makes me look good. Dude, that's amazing.\r\n\r\n\r\nChris Koerner (14:44.228)\r\nand your hair is brown now.\r\n\r\n\r\nNikolas Hulewsky (14:56.526)\r\nAlright, what you got on your end?\r\n\r\n\r\nChris Koerner (14:58.446)\r\nIt's still loading.\r\n\r\n\r\nNikolas Hulewsky (14:59.688)\r\nOkay, well that's loading. I have an idea on this idea that I want to ask you about.\r\n\r\n\r\nChris Koerner (15:03.129)\r\nWait, wait, I want to share my screen as it's loading because it's halfway done. So it said that an old time country setting country Western setting goes against their content policy for some reason. So I said rainforest setting and it started what? Look at that. It started loading and then it went away and said bumps into a content policy stuff.\r\n\r\n\r\nNikolas Hulewsky (15:18.19)\r\nThere we go.\r\n\r\n\r\nNikolas Hulewsky (15:21.998)\r\nWhat is that?\r\n\r\n\r\nNikolas Hulewsky (15:33.678)\r\nOkay, while you're doing that, it's interesting to see trends of styles. So like clothes comes back into style, like the stuff kids are wearing today, baggy, Janko jeans. Those were popular when we were like middle school and high school and now they're kind of coming back into style, which is really cool. It's funny. But one of the things that I've seen also as millennials is like retro,\r\n\r\n\r\nChris Koerner (15:47.823)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (15:54.586)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (16:02.998)\r\nNintendo 64. It's not actually Nintendo 64, but it looks like Nintendo 64. Or just retro Nintendo where you're literally just playing the retro game of Nintendo. I wonder if in like five years or even sooner, you just go the opposite direction. Where everything's going to look so polished, so professional, so good, any copy, any marketing materials, any picture, any LinkedIn, whatever that the way to stand out will be to like\r\n\r\n\r\nChris Koerner (16:13.007)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (16:25.861)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (16:31.17)\r\ngo the opposite way and look low tech. I wonder if there's a product around like a low tech solution or even just a low tech looking solution, a prompt. Yeah.\r\n\r\n\r\nChris Koerner (16:33.755)\r\nMm hmm. Mm A prompt. Yeah. Mm That could be a rapper just like a call it like lo fi lo fi rapper lo fi. I don't know. Yeah, like there's this famous ad that went viral where it was like we like our graphic designer just quit.\r\n\r\n\r\nNikolas Hulewsky (16:51.022)\r\nYeah, it's like countercyclical.\r\n\r\n\r\nChris Koerner (17:01.005)\r\nnow hiring and it's like someone wrote it in Microsoft Paint. Yeah. And like that, that did really, really well. So it reminds me of that. It reminds me of like Minecraft. It reminds me of the fact that like short form videos, TikToks, like they shouldn't be overproduced anymore. Like they kind of need to be under produced. You can stand out. Like we're already there. It seems. And I think we're going to, we're going to go that direction even more.\r\n\r\n\r\nNikolas Hulewsky (17:05.389)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (17:26.114)\r\nYeah. All right. well that's loading. Can I go on a ramp?\r\n\r\n\r\nChris Koerner (17:30.479)\r\nDude, rant away.\r\n\r\n\r\nNikolas Hulewsky (17:31.758)\r\nHere's my rant for the week. I see posts all the time from people who are like, I'm looking for a business to buy. just need to hire an operator. Have we already talked about this before? I don't want to be in the weeds. Wait, two weeks ago? OK. So I'm still on this rant. And I've been thinking more and more about it. And I've kind of come up with this framework that I want to run past you and get your opinion on.\r\n\r\n\r\nChris Koerner (17:44.077)\r\nYes. We talked about this like two weeks ago. Yeah.\r\n\r\n\r\nNikolas Hulewsky (18:00.782)\r\nSo there's a lot of people who, they wanna be entrepreneurs. They're young, they're hungry, they're hungry rowdy arsonists, and they wanna get into entrepreneurship. But they think like, I just gotta go start a business or I gotta go buy a business. And they're not really thinking through the best steps to prepare themselves for entrepreneurship. So here's a little formula that I have that I wanna get your opinion on. I think that success in business is your idea,\r\n\r\n\r\nplus execution. It's that simple. You have an idea and then there's execution. And then within that, the execution, you have grit, you have distribution, you have fulfillment, and then you have knowledge and experience. In one of those four, at least, you have to have a competitive advantage. And then even in the idea, you potentially have to have a competitive advantage. Somewhere in that formula, something has to have\r\n\r\n\r\nChris Koerner (18:31.621)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (18:56.694)\r\na competitive advantage in order for you to be successful. So like you have grown like crazy on social media. Was it the idea? I'm just going to post shorts every single day about business. No, there's lots of people who post shorts every day about business. Was it the execution? Yeah, it was the execution. So like what was it in the execution? The distribution, the probably the fulfillment of it, right? Like it was a creative strategy in the way that you were finding viral videos and then you're putting business plans on top of it because any viral video can become a business plan. Like that was\r\n\r\n\r\nChris Koerner (19:25.273)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (19:25.59)\r\na very interesting take on an already knowable idea of, build an audience. And of course, then you'll have distribution. It's like, okay, cool. Everybody knows that. But so anyways, you, you just, you had a very unique value proposition and an unfair competitive advantage. And I think a lot of people want to get into entrepreneurship and that's admirable. If they don't have an unfair competitive advantage, if you're 23 years old and you're looking at this, it's like, you're to go compete in a market that already exists against people who\r\n\r\n\r\nChris Koerner (19:29.243)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (19:55.224)\r\nhave the distribution, have the knowledge, have the fulfillment. And if you're like, well, I'm just going to work as hard as everybody or harder than everybody else. Like that, that's just table stakes when you enter the game. So I've been thinking this through. What do you think of that framework?\r\n\r\n\r\nChris Koerner (20:05.829)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (20:12.536)\r\njust as a concept.\r\n\r\n\r\nChris Koerner (20:12.56)\r\nabout your competitive advantage being the most important thing.\r\n\r\n\r\nNikolas Hulewsky (20:16.75)\r\nYeah, if you're going to start something, you need to have a competitive advantage in something or a path to a competitive advantage in something. An edge, yeah. In order for it to be successful.\r\n\r\n\r\nChris Koerner (20:26.415)\r\nLike an edge. Yeah.\r\n\r\n\r\nI agree with the caveat. I think that maybe the most important thing is the market that you choose or the title wave that you choose to ride. I'm thinking of ride sharing, right? Uber launched. They took the market by storm, then lift sidecar. There's a bunch of others and they're doing great. here's a very recent example, totally different.\r\n\r\n\r\nYou know, six months ago we talked about that guy that Mose lawns for free. He posts the time lapses. They get millions of views. Do you know how long he's been doing that and how many followers he has across platforms?\r\n\r\n\r\nHe's been doing it for about two and a half years. He has 45 million followers.\r\n\r\n\r\nNikolas Hulewsky (21:21.005)\r\ninsane.\r\n\r\n\r\nChris Koerner (21:21.851)\r\n45 million. are you telling me that if someone were to copy and paste exactly what he does exactly no competitive advantage, no differentiation, they would be successful because it's a tidal wave. Like there's so much demand. There's few people willing to go outside, buy a mower, do it for free, knowing how to edit it. Like they would win.\r\n\r\n\r\nNikolas Hulewsky (21:43.064)\r\nYeah, but those would be, in my opinion, those would be competitive advantages. If you know how to edit it yourself or if you have the money where you don't need the money to go and mow somebody's lawn and you've got some backstop, I agree.\r\n\r\n\r\nChris Koerner (21:52.131)\r\nI'm just saying like, you don't have a background in this, right? Like you literally just copy him. you download CapCut, like you don't have a background in editing, but you're just like, I'm gonna copy him exactly. I feel like because there's so many people that want to watch something so visual that you're not gonna get 45 million in two years, but you could get 4 million in two years or 20.\r\n\r\n\r\nNikolas Hulewsky (22:15.65)\r\nSo yeah, great caveat. I think that falls into like the grit category because in order to do that, even if it's a knowable execution strategy, he's got to do it for two years before he gets to any level of like quote unquote success. He's doing this for free and he's actually getting paid.\r\n\r\n\r\nChris Koerner (22:31.579)\r\nMaybe. I just use that as an example because he's been doing it for two years, but like his first videos started going viral like immediately just because the algorithm loves it. So.\r\n\r\n\r\nNikolas Hulewsky (22:43.5)\r\nYeah, that's luck is not a strategy. It's like, okay, did he pick? He's like, this is a tidal wave industry. I'm gonna go out and mow lawns. Right.\r\n\r\n\r\nChris Koerner (22:50.935)\r\nNo, he didn't. He got lucky, but anyone copying him wouldn't. They're just copying.\r\n\r\n\r\nNikolas Hulewsky (22:56.238)\r\nYeah, but okay, I think we're in agreement here, but you're entering now into a market with more competitors. So the probability of your success just lowers when you're entering it with no experience. Either the road is going to be longer, you've got a steeper learning curve, you've got to throw more resources at it, et cetera. All of this goes to say, it's proving the point that I'm coming up with is if you were 25, this was my question. If you were 25 years old.\r\n\r\n\r\nand you were like, all right, that's the business formula. I want to figure out where I can achieve this sort of competitive edge to enter a market. What would you be looking at right now? You personally, like Chris, 25 year old Chris, where would you be looking to get that competitive edge and then exploit it? Now it might be this where you're like, I'm going to basically start a lawn care company.\r\n\r\n\r\nwith a component of I'm going to do video. And so that's that's my asymmetric bet is that video takes off. But essentially you got to learn how to go Molans for a period of time. Right. So that could that could be one vector.\r\n\r\n\r\nChris Koerner (24:01.947)\r\nMm-hmm.\r\n\r\n\r\nMm-hmm.\r\n\r\n\r\nSo I would just, I would go full barbell barbell strategy. I'd go no tech or AI and nothing in between. cause I think, I feel like both are tidal waves. and it'll be easier to find a competitive advantage regardless of how crowded the market is because the tidal wave is so big. Like the home services tidal wave isn't going to get bigger necessarily, but there will be fewer people on it because of AI.\r\n\r\n\r\nSo it will be it will become less competitive.\r\n\r\n\r\nNikolas Hulewsky (24:38.574)\r\nUm, I 100 % agree with the barbell. That's totally my thinking. It's either got to be full AI or like full, no AI. Would you go, let's, let's get the, the mower landscaping guy as an example. Do you think it's a better strategy for somebody who's young that wants to get into this space to go and find someone who's doing it and learn it from them or to just go do it themselves?\r\n\r\n\r\nChris Koerner (24:46.5)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (25:02.043)\r\nI mean, you know my answer to this, come on.\r\n\r\n\r\nNikolas Hulewsky (25:04.812)\r\nYeah, to go do it yourself. Do you think you would have gone faster if you had actually gone and learned like an almost apprenticeship with somebody else?\r\n\r\n\r\nChris Koerner (25:17.007)\r\nWell, let's talk about like phone restore. Like my first thing, right? Where literally everyone I spoke to, they're like, you, gotta learn how to fix phones, dude. You gotta learn how to fix phones before you open a business fixing phones. It was like, okay, I, I hear you. hear you, but, I'm, I don't want to, I don't want to, I'm impatient. So logically on the surface, it's like, yeah, I, you know, I could have given me a headstart. could have.\r\n\r\n\r\nyou know, learned faster. But realistically, a lot of times what happens and this is something I tweeted about this week is like, you sit down with someone you apprentice, you learn how to fix phones. And then you're like, this kind of sucks. You know, I didn't realize this, I didn't realize I got to go to China to get these. And I'm going to be talked out of it. Now, I'm just gonna I'm just gonna speak out of both sides of my mouth. Right? That could mean that I find something better. Right? Because I can't replay my life.\r\n\r\n\r\nIt could be that I just keep just kind of doinking around trying to learn, learn, learn, like ever learning, never coming to a knowledge of the truth, you know? Who was I talking to? I posted a video about the silt fencing business and this guy commented, the whole premise of the video was like, go do a silt fencing job for free where it has failed, like an erosion control job at a residential home where it's failed.\r\n\r\n\r\ntake a video of yourself doing it, send it to the builder that owns the job site as a sign of goodwill and say, Hey, I fixed this for you. Next time you have a job, me, give me a call. And this builder commented and he's like, Hey, I'm a builder here. I'll tell you what that wouldn't work. That just wouldn't work. I'll tell you right from a builder's perspective that what I'm like, okay, if you're the only home builder in the United States of tech or the United States of America, I would take that very seriously. I would take that seriously and I would not enter that market.\r\n\r\n\r\nNikolas Hulewsky (26:45.943)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (27:03.438)\r\nThis is United States Texas, I'll tell you what.\r\n\r\n\r\nChris Koerner (27:08.965)\r\nBut you're one of thousands. I don't care. I don't care what you think. So a lot of times the people that you're seeking advice from, they're like, you're trying to do the right thing. And they're in the industry. So you're like, they know what they're talking about. They're they can't see the forest through the trees. They're so jaded. It's all they know. So they, like maybe they're a pessimist by nature, like, you don't want to do this because this this this this. Whereas like another guy in the same industry would be like, yeah, actually, this is a great industry. It's kind of a cheat code. And you should try it, you know. So it's just tough.\r\n\r\n\r\nNikolas Hulewsky (27:24.266)\r\nMm-hmm, totally.\r\n\r\n\r\nChris Koerner (27:39.195)\r\nBecause we're saying opposite things like\r\n\r\n\r\nNikolas Hulewsky (27:39.694)\r\nWell, it's interesting because we are saying opposite things, but they're also like in line with our personalities, right? Like that's the way I'm going to go find success. You're going to do it a different way. I'm just trying to think through. I think the rule is more you should go out to de-risk yourself and like gain a competitive advantage and go get some experience. But what you're saying also makes a lot of sense. I'm like trying to work through this framework because in my mind, in the example of\r\n\r\n\r\ngo out and do something for free for a home builder. Why not go get, take a job for six months at a really low pay for a home builder. Then you like understand how to actually put up those fences or how to actually frame or run electrical or do plumbing or phone restore. As an example, all the mistakes you made in phone restore were made on your own dime. Whereas if you had spent some time, maybe you could have learned some of those mistakes on somebody else's dime and then transition them, but it is.\r\n\r\n\r\nto your point, it's that balance of like, there are people who will go and learn and then talk themselves out of the opportunity. But.\r\n\r\n\r\nChris Koerner (28:43.591)\r\nMm There's too many variables, you know, depends on personality type and\r\n\r\n\r\nNikolas Hulewsky (28:47.182)\r\nSure. I think that the best way for most young people who are looking to get into entrepreneurship is to go out and you're still taking a risk, but go take a job that pays way less than you're currently making right now in an industry that is barbelled, like you said, either very AI focused or no AI at all. Like go learn plumbing, HVAC, construction, framing, because you know what's not going to go out of business in the next 10 years? Guys who are going and framing houses.\r\n\r\n\r\nLike I'm sure robots will get a lot better. That's not happening in the next 10 years and, go and learn that industry because then once all as the demand is there for it, you're to have an agency that can go and do construction. For me, that seems like the best way for somebody who's young to enter entrepreneurship. It's not to buy a business that they have no idea what they're doing. And it's not to spend a bunch of money starting a business up. I think.\r\n\r\n\r\nChris Koerner (29:37.627)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (29:47.444)\r\nYour best way for someone who's a hustler like you is just do some side hustle, see which one hits and then lean into that one. For somebody like me, it's like go get some experience first and then take the swing there. But there is no such thing as like, I'm just going to have somebody else do the operations. Like, no, you need to learn this stuff one way or the other, either all in from the startup like Chris does, or go gain some experience like I do and then get into the business. can't shortcut understanding the business and just think you're going to outsource it to somebody else.\r\n\r\n\r\nChris Koerner (29:54.959)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (30:17.26)\r\nunless you're born to a rich family, basically.\r\n\r\n\r\nChris Koerner (30:19.567)\r\nYeah, I think it.\r\n\r\n\r\nChris Koerner (30:24.475)\r\nHold on. Why does it the recording timestamp mood? Is that that freaked me out? I thought we hadn't been recording. Like a lot of things, it just comes down to know thyself, right? Like do it. It'd be nice to have like a quiz on our website or something where people could could, you know, learn more about themselves. Like are if you do this, are you most likely to do this or this? And they answer 10 questions at the end of it. It's like, you know, you should probably just go and do things.\r\n\r\n\r\nNikolas Hulewsky (30:26.595)\r\nYes,\r\n\r\n\r\nNikolas Hulewsky (30:30.316)\r\nI know it's at the top now.\r\n\r\n\r\nI know I did that earlier this week.\r\n\r\n\r\nChris Koerner (30:53.877)\r\nbecause friction and momentum are very real. And if you just go and try to learn, you'll probably never launch based on the answers you just gave to this quiz, right?\r\n\r\n\r\nNikolas Hulewsky (31:02.188)\r\nYeah, that was the entrepreneurship quiz that I sent you. Basically, there's four options. Should you start? Would you start a business? Did you buy a business? Should you invest in a business? And then there's actually option four, which I didn't explicitly state, which was like, just do a side hustle because you're not ready for this. But yeah, that's the whole thing behind it is. There are hustlers like you who were always going to hustle like, I went to Facebook marketplace and I flipped this thing and I bought it for $4 and I'm selling it for five. Like you just have always been a hustler. I'm not a hustler.\r\n\r\n\r\nChris Koerner (31:05.211)\r\nI guess it was, wasn't it?\r\n\r\n\r\nNikolas Hulewsky (31:31.328)\r\nI'm more of the, well, let me learn it first, understand it, way more paralysis by analysis. But then eventually I go bigger by buying a business or investing in a business. Both of those things are fine. You just have to know who you are. Each one of those have pros and cons, but you can't skip the step of like learning. The learning is the integral part of becoming successful.\r\n\r\n\r\nChris Koerner (31:41.178)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (31:53.71)\r\nMe too.\r\n\r\n\r\nChris Koerner (31:54.651)\r\nUm, I got something. So I'm a little frustrated because that other podcast, I won't say my name, but I had two things prepared to talk about. And then they released two episodes talking all about these things. And it's just a crappy coincidence. So let the record show. Okay, let the record show. You familiar with rucking?\r\n\r\n\r\nNikolas Hulewsky (32:16.398)\r\nScrew him. Screw him. Just do it, Chris. You're gonna do it better.\r\n\r\n\r\nNikolas Hulewsky (32:26.104)\r\nheard the word I'm sure if you explain it I'll be like yeah yeah yeah but I can't think of it\r\n\r\n\r\nChris Koerner (32:29.04)\r\nyou put on a backpack with weights in it and walk around. It puts more stress on your core on your legs on your body. It's a healthier way to walk. Okay. And it's funny because when I was running ultra marathons, like three, four years ago, people were rocking like they would rock an ultra marathon and it was a thing, but it was very niche at the time. And today it's very, very, it's getting a lot more popular and there's a company called go rock and they're doing half a either $50 million or something in annual sales.\r\n\r\n\r\nNikolas Hulewsky (32:31.872)\r\nYeah, okay.\r\n\r\n\r\nChris Koerner (32:57.931)\r\nthrough a Shopify store. They're doing great. They sell like $300 backpacks $75 weights. Anyway, Nick, you know me.\r\n\r\n\r\nNikolas Hulewsky (33:04.248)\r\nmean, the irreverent marketing is just right there. Like go rock yourself. It's like, dude, it would be incredible. Okay, sorry.\r\n\r\n\r\nChris Koerner (33:07.127)\r\nI know I know you've got a bunch of puns. Anyway, these I'm too cheap for this stuff Nick. These backpacks are expensive. It's $300 for a backpack. Okay, and then you got to buy the weights. That's just the backpack. You know how much these weights are?\r\n\r\n\r\nNikolas Hulewsky (33:18.552)\r\nHere we go. Here we go.\r\n\r\n\r\nNikolas Hulewsky (33:26.67)\r\nexpensive, I'm sure they're expensive. $20.\r\n\r\n\r\nChris Koerner (33:27.931)\r\nYou what these weights are? It's like $75 per weight. Why? Because they have a handle. Like what are we talking about? You want to put weights on but you can't work hard to grip it? Like that's like going to the gym to walk on the treadmill and parking right outside the front door. Like what are we talking about?\r\n\r\n\r\nNikolas Hulewsky (33:48.014)\r\nIt's like, the heck are we doing here, you know?\r\n\r\n\r\nChris Koerner (33:49.851)\r\nThere it is. like, you were talking about going four to $500 in to just walk around with weights on your back.\r\n\r\n\r\nNikolas Hulewsky (33:56.494)\r\nJust a vest? A $4,500 for just the vest?\r\n\r\n\r\nChris Koerner (33:58.509)\r\nIf they have vests and they have backpacks and it's like two to $300 just for the backpack and then you got to buy weights to put in it. Yeah. And what they'll tell you is like, well, these backpacks are different because it has slots so they won't jostle around and it supports your waist and there's pad. It's like it's a freaking backpack. Can a brother get a Jansport here?\r\n\r\n\r\nNikolas Hulewsky (34:04.012)\r\nReally?\r\n\r\n\r\nThere has to be\r\n\r\n\r\nNikolas Hulewsky (34:16.014)\r\nOkay, okay, you remember the episode of The Office where Andy goes and runs for the diabetes? Yeah, I mean, I guarantee there's somebody who's like, oh yeah, I could put this together for 50 bucks and they went and did it they're like, oh, nipple chafing. I know, that's what I'm saying. That's why I brought it up. I'm sure that it is.\r\n\r\n\r\nChris Koerner (34:21.155)\r\nYeah, and it is nipples shave. Yeah.\r\n\r\n\r\nChris Koerner (34:31.801)\r\nthis guy's right here. You're talking to this guy. Okay. So my wife and I go on a date every Saturday night and we wanted to go rucking on our date. Okay. We want to go rucking. So she has she still wears a backpack from high school. Stop. We're done. Banana edited that out, please. Banana. so I'm not going to buy this stuff. Like I went to go rock.com to buy it and I'm like, I'm not doing it. I don't care.\r\n\r\n\r\nNikolas Hulewsky (34:42.958)\r\nWhat the wreck? Okay.\r\n\r\n\r\nDo you and your wife rock often? I'm sorry. Banana, banana.\r\n\r\n\r\nNikolas Hulewsky (34:59.118)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (35:00.955)\r\nSo I have this like Chinese backpack that my mother-in-law gave me from Amazon like four years ago. It's called like Tisayo. It's like probably cost $24. And you want to know what weights I put in this sucker? I'm asking Chad to be T I'm like, what is the cheapest price per ounce of a weight? Like it needs to be dense. It needs to be cheap. It's like sand, water. I'm not gonna be lugging around water. Dude, I roll up to Home Depot.\r\n\r\n\r\nNikolas Hulewsky (35:09.388)\r\ngood brand.\r\n\r\n\r\nNikolas Hulewsky (35:14.19)\r\nI'm so ready for this.\r\n\r\n\r\nChris Koerner (35:28.315)\r\nI buy pavers like cement blocks to pave a sidewalk. $1.78 for 17 pounds. What are we doing? $1.78 for a paver. No, what are you talking about? them. No, it's like it's like a brick.\r\n\r\n\r\nNikolas Hulewsky (35:36.878)\r\nDid you crush them? No. Well, I don't I know, I'm just saying the weight distribution might be weird if it's just in the brick form,\r\n\r\n\r\nChris Koerner (35:46.189)\r\nNo, it's good. Because you can get square ones, you can get rectangular ones, you can buy different sizes, different weights out the door. It's like five bucks. Throw them in the backpack, I'm good to go. 3040 bucks out the door. Okay, so I'm thinking like, well, this needs to be a thing. Like, and that's what this other podcast talked about is there needs to be like a more affordable version of go rock. Sure. But there are other ways you could monetize this. Go ahead.\r\n\r\n\r\nNikolas Hulewsky (36:11.598)\r\nSo, like, go-ruck is the premium version, but the other version is like, hey, do you want to feel like you're in middle school again trying to catch the bus? Remember when you'd like have the backpack on and you're running and your back's just like, yeah, yeah. So like, again, we're playing on people's nostalgia, back to middle school, go-rucking, how tight did you have it on? Like, was it tight enough where it wasn't flapping against your back?\r\n\r\n\r\nChris Koerner (36:20.855)\r\nMm hmm. Bump, bump, bump. Yep.\r\n\r\n\r\nChris Koerner (36:27.685)\r\nYep. Yep.\r\n\r\n\r\nChris Koerner (36:34.743)\r\nI had no flap issues. It was fine. Nothing was wrong. Like it worked great.\r\n\r\n\r\nNikolas Hulewsky (36:38.19)\r\nCould you have run and it been fine?\r\n\r\n\r\nChris Koerner (36:41.659)\r\nIf I did run, it would have been the same experience as with a go-ruck backpack. Like it was a normal experience. Yeah.\r\n\r\n\r\nNikolas Hulewsky (36:46.606)\r\nReally.\r\n\r\n\r\nSo the go-ruck is not like the vest that these like tactical guys will wear that look like.\r\n\r\n\r\nChris Koerner (36:55.235)\r\nyou they sell those that's not their main product that they need to have like a sternum strap that like connects the backpack straps in the middle that kind of helps redistribute the weight and then you can have like a belt strap to help distribute it to your hips the weight more\r\n\r\n\r\nNikolas Hulewsky (37:01.71)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (37:10.527)\r\nIt feels like this would be really easy. You find a manufacturer in China, there's gotta be knockoffs on Alibaba already, right? And then, okay, yes sir.\r\n\r\n\r\nChris Koerner (37:18.319)\r\nYeah. So dude, let's go back to our barbell. I want to people need to do barbells of this, right? They need to go ultra cheap, super cheap, stupid backpack, you could make it funny, kind of like with your puns, right? You go Yeah, this is a piece of crap backpack from China, but it's not gonna break. Okay, and it's 50 bucks, including the weights. Yes, these are pavers from Home Depot, right? And the expensive part with e commerce with this is shipping like I bet this for the $70 weights that go rec sells a lot of that is just\r\n\r\n\r\nNikolas Hulewsky (37:40.812)\r\nWhatever happened.\r\n\r\n\r\nChris Koerner (37:47.745)\r\nshipping that they're baking in. You got to go that direction or you got to go super barbell ultra premium, no synthetic fibers, no microplastics. These are all cotton backpacks like these weights like there's no paint like there's no lead whatever super premium like kind of like a Patagonia or like a lifetime return policy something like that or you got to go like digital product $20\r\n\r\n\r\nNikolas Hulewsky (37:55.95)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (38:12.451)\r\nebook PDF of like how to rock for $50 and it just it's like an instruction manual go to Home Depot buy this buy this buy this and then there's like workout tips there's like a plan. Yeah.\r\n\r\n\r\nNikolas Hulewsky (38:21.602)\r\nI like the info product idea or you source the backpack and you can do this now, which is crazy with AI. Then you could build a wrapper to place the order at Home Depot to ship to your house. Because the most expensive piece is going to be the weight that you're shipping from overseas, right? Like, why am going to order that from overseas? I could order it from my local Home Depot and then have them through checkout. Boop, they buy the backpack. Exactly. Affiliate links. And then Home Depot is just sending it to their house and they get to...\r\n\r\n\r\nChris Koerner (38:35.291)\r\nMmm.\r\n\r\n\r\nChris Koerner (38:38.958)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (38:45.019)\r\naffiliate links.\r\n\r\n\r\nChris Koerner (38:51.077)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (38:51.202)\r\nshipments at the same time and it's like, here's how to put together your rocking backpack.\r\n\r\n\r\nChris Koerner (38:54.683)\r\nMm hmm, dude, or you could make like a Strava for rucking. Because it's kind of interesting that like Strava and like these these watches right here, like the garments and choruses of the world. They don't they can't really account for rucking because it you know, you're just walking or hiking but you have an increased heart rate. So I wonder if you could do like a very niche Strava for rucking only or like a scheduling app for rucking or\r\n\r\n\r\nNikolas Hulewsky (38:59.598)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (39:05.23)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (39:22.799)\r\nYou know what I'm saying? Like something to track your workouts or\r\n\r\n\r\nNikolas Hulewsky (39:24.066)\r\nDude.\r\n\r\n\r\nI mean, so the other thing to do would be like pickleball. All these accessories have popped up around pickleball. I'm sure you could find, like you could even do this in your newsletter. I'm sure there's probably of your, whatever, 150,000 subscribers, 10,000 that rock. I don't know, maybe that's too high and just pull them and be like, Hey, you rock. What's the worst part about rocking? You're like, the worst part is, and whatever the worst part is, it's so heavy, but whatever the worst part is.\r\n\r\n\r\nChris Koerner (39:34.862)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (39:48.781)\r\nMm hmm. They're so heavy.\r\n\r\n\r\nAhem.\r\n\r\n\r\nNikolas Hulewsky (39:56.94)\r\nthat becomes a niche product in and of itself. Kirk, like what was the business he had that he was a partner of? The Frisbee? Yeah. It's like he sold that before it finally hit peak popularity, but rucking is like on the way up in terms of popularity. like, what could you do? Could you make branded backpacks? Could you have influencer backpacks? Like you could make backpacks and go find, that's actually a really good idea. Forget the premium.\r\n\r\n\r\nChris Koerner (39:59.93)\r\nYeah.\r\n\r\n\r\nChris Koerner (40:04.315)\r\ninfinite disks.\r\n\r\n\r\nChris Koerner (40:12.09)\r\nMm-hmm.\r\n\r\n\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (40:26.616)\r\nGo find whoever the influencer is that talks the most about rucking that has the largest audience or whoever's making it the most popular or send it to 10 really popular fitness influencers and be like, hey, for free, wear this and anybody that buys through us, you get an affiliate link for.\r\n\r\n\r\nChris Koerner (40:35.621)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (40:43.065)\r\nI love it, dude. There's all kinds of like influencers plays you could do with this.\r\n\r\n\r\nNikolas Hulewsky (40:50.06)\r\nIt also feels to me like the... Remember when Stanleys became popular? Look at my stala. It just becomes popular because it's popular. It's not necessarily popular because it's the best thing. So like rucking is probably going to become popular just because it's popular, not necessarily because... What are we talking about here? It's a weighted backpack. Okay. It's nothing new. There's no invention that's happening here. It's just rebranded. It's rucking.\r\n\r\n\r\nChris Koerner (40:50.181)\r\nChris Koerner (41:03.535)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (41:08.763)\r\nMmm.\r\n\r\n\r\nYeah. Yeah.\r\n\r\n\r\nChris Koerner (41:18.949)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (41:21.451)\r\nSo funny.\r\n\r\n\r\nChris Koerner (41:22.02)\r\ntrend.\r\n\r\n\r\nNikolas Hulewsky (41:24.142)\r\nIt's pretty good. I like that one.\r\n\r\n\r\nChris Koerner (41:26.075)\r\nShould we wrap this? 41 minutes?\r\n\r\n\r\nNikolas Hulewsky (41:28.002)\r\nYeah, 41 minutes.\r\n\r\n\r\nNikolas Hulewsky (41:35.798)\r\nI love it when we're both like, banana, banana, banana.\r\n\r\n\r\nChris Koerner (41:39.547)\r\nWe need like a red button.\r\n\r\n\r\nNikolas Hulewsky (41:42.84)\r\nDude, my young men have started listening to my podcasts. Yeah, yeah, it is cool, but like they came to church one Sunday and were like, dude, I was listening to the episode where you're talking. And I was like, crap, I get it. I gotta stop. I gotta be careful with, I don't know, right? It was just like two or three weeks ago. There was nothing bad in the episode. It was just that they brought up that they listened to an episode and it triggered in my mind like, I gotta be careful with what I'm saying.\r\n\r\n\r\nChris Koerner (41:46.041)\r\nThat's cool. Do like it?\r\n\r\n\r\nChris Koerner (41:58.019)\r\nWhich episode?\r\n\r\n\r\nNikolas Hulewsky (42:15.758)\r\nAlright. What?\r\n\r\n\r\nChris Koerner (42:17.305)\r\nYou want to start us off on this one.\r\n\r\n\r\nNikolas Hulewsky (42:24.822)\r\nI do. I do want to start us off.\r\n\r\n\r\nNikolas Hulewsky (42:37.248)\r\nYes, give me give me let me find one thing.\r\n\r\n\r\nChris Koerner (42:46.651)\r\nBefore you start us off, want to add like a 30 second snippet to put to the end of the first one, just as a joke. So, Mohammed, Simon, if you're watching this, what I'm about to say, put it at the end of the episode we just finished.\r\n\r\n\r\nAhem.\r\n\r\n\r\nNikolas Hulewsky (43:20.952)\r\nSorry, it got lost, I had it up, and now it's...\r\n\r\n\r\nChris Koerner (43:34.019)\r\nNick, I would be remiss without ending this episode without. I'm sorry.\r\n\r\n\r\nChris Koerner (43:41.539)\r\nNick, I would be remiss if I ended this episode without talking about one of our close friends. Okay. This is a friend that we've talked about and referred to multiple times on this podcast. And he recently had a sit down with me and he was offended. He was offended because I always refer, we always refer to him anonymously and he wants his name to be known to the world. His name is Steven Carl Hale. He lives at 2345 Boxwood drive, Allen, Texas, seven five zero zero two. He has four children, all boys.\r\n\r\n\r\nWife named Emily. He's a great man. owns Oak Bridge advisory services. That's oakbridgeas.com. He does quality of earnings analysis for healthcare companies. He's a great man and a beautiful father. Steven Carl Hale. Yeah, but no, hear me out. Hear me out. me out. Banana, Muhammad, I want you to bleep out his address. When I say two, three, four, five box would drive Allen, Texas. Bleep out that, but like keep it in so they can't actually hear.\r\n\r\n\r\nNikolas Hulewsky (44:22.136)\r\nDid you really just dox him? Okay, don't conclude his address.\r\n\r\n\r\nChris Koerner (44:38.809)\r\nBut he's going to love it.\r\n\r\n\r\nNikolas Hulewsky (44:38.85)\r\nYeah, my gosh dude, I was like, what the hell?\r\n\r\n\r\nChris Koerner (44:45.403)\r\nWe went to dinner the other day. He's like, yeah, you talk about but you never said my name like, dude, I do that to like, I don't want you to lose clients. Like I thought there was more downside and talking about I'm not like trying to hide who you are. So I, I put in my notes mentioned Stephen Hale a bunch of times. So\r\n\r\n\r\nNikolas Hulewsky (44:54.55)\r\nRight.\r\n\r\n\r\nYou know, trying to be protective. I freaking love Steven.\r\n\r\n\r\nNikolas Hulewsky (45:04.558)\r\nI had a physician who reached out to me that wanted a quality of earnings and then I posted about it. like, hey, I'm looking for somebody to do a quality of earnings. I just didn't even think of Steven. I don't know why I didn't think of him. And he messaged me and he's like, so why wouldn't you think of me for this quality of earnings? Like, I'm a freaking moron. Now, I didn't send that to anybody else. But so when Steven responds to me, was like, oh, shoot, yeah, here you go. I put him in touch. But yeah, I felt like a freaking moron. Anyways.\r\n\r\n\r\nChris Koerner (45:13.819)\r\nYeah.\r\n\r\n\r\nChris Koerner (45:20.751)\r\nHe told me this.\r\n\r\n\r\nChris Koerner (45:26.235)\r\nYou\r\n\r\n\r\nChris Koerner (45:31.771)\r\nThat's funny.",
  "metadata": {
    "duration": "",
    "date": "2025-04-11",
    "platform_source": "Google Drive"
  }
}