{
  "episode_number": "58",
  "episode_title": "Bad Data Is Ruining Your Business. He Found the Fix! with Kirk Newcombe",
  "guest_name": "Kirk Newcombe",
  "business_name": "Torch PX",
  "transcript": "﻿nik (00:00)\r\nAll right, Kirk, welcome to Niconomics. Stoked to have you, my friend. Do me a favor and briefly explain to me what your business is and how you make money.\r\n\r\n\r\nKirk (00:13)\r\nYeah. I run a business in technology consulting business called Torch PX. I'm a SaaS guy who decided that I really cared deeply about business process and quote to cash and technology as an enabler. And I actually, before that spent some time running a swimming pool business with 150 employees. And that was a total deviation for what I was doing prior again in technology.\r\n\r\n\r\nnik (00:37)\r\nmy god.\r\n\r\n\r\nKirk (00:43)\r\nBut what I realized in the process is that every business is actually a technology business. And it's taken me back to say, hey, listen, like good process, good people and technology that powers that not as the sole solution is the most interesting thing to me. And that's why I've kind of built a practice around that to go help other people.\r\n\r\n\r\nnik (00:59)\r\nSo you so you went from tech to boring back to tech, right? Like with the with the pool company. Do you still own the pool company? Or did you exit from that? Okay.\r\n\r\n\r\nKirk (01:12)\r\nStill invested, I have a great team running the company now and very healthy business. It's very exciting.\r\n\r\n\r\nnik (01:16)\r\nWhat? So when you got into the pool company, 150 employees, that's a big, that's a big operation. What, what exactly does that mean? A pool company, like a pool cleaning company, pool building company, service company? I don't know what that means.\r\n\r\n\r\nKirk (01:29)\r\nYep. Classic, like classically, right? Pool companies are going to be construction and service or just construction or just service. We're actually a handful of companies together that are, that collaborate at times, but are largely operating independently. We do design construction. We do service and maintenance. We do heating and gas and propane delivery. We also do bulk chemical delivery. So we'll deliver bleach as well.\r\n\r\n\r\nnik (01:54)\r\nIs that geographic specific or is that all over the country?\r\n\r\n\r\nKirk (01:58)\r\nvery, very focused in Hamptons, East end of Long Island. Yeah.\r\n\r\n\r\nnik (02:02)\r\nyeah, terrible place. Okay. That's awesome. That's awesome. So you know, yeah, you're you're, you're marketing to the right clientele. Can you give me an idea of like, how many pools we doing a year?\r\n\r\n\r\nKirk (02:05)\r\nterrible place, great place, great place, yeah.\r\n\r\n\r\nInteresting. So the clientele that we have actually, they're looking for like much bigger pools than your average or more fancier pools than your kind of average American. We're serving the 1 % of the 1%. I'll say that there are a lot of companies out there that are easily doing 50 to 100 pools a year. I'd say like 100k price point, we might do a dozen pools a year or so.\r\n\r\n\r\nnik (02:28)\r\nMm -hmm.\r\n\r\n\r\ninteresting.\r\n\r\n\r\nKirk (02:45)\r\nWe do far fewer, we're a fairly big business, but we put a lot of effort into a much smaller number of pools.\r\n\r\n\r\nnik (02:53)\r\ntalk about your experience going from tech to the boring business and what it was that sort of reignited this tech enablement philosophy that you have.\r\n\r\n\r\nKirk (03:03)\r\nYeah, frankly, it's not boring at all. The swimming pool industry is actually really exciting and at times incredibly stressful. So amongst the more stressful things I've done, I'll say that is running a pool business. So I have a lot of respect for anybody who's been in the trades. And I grew up in a family restaurant, which has its own version of it. But yeah, yeah, exactly. Exactly.\r\n\r\n\r\nso the transition transition is good. I think in a lot of ways, I think I was lucky. I think I'm, I really enjoyed people, fundamentally, and it's very much a people driven business, both internally and externally. So that transition was fairly easy. I think what I learned real fast is that like we had to invest a lot of time and energy into technology inside the business, to try and make say our construction division and our service division collaborate more, I think,\r\n\r\n\r\nI don't know, easily, and realize that like, it's easier said than done. It really is. And it's especially hard for us because we're in a four season market versus like the Sunbelt down South. It's very, very different dynamic. So yeah, I think, you know, for us, I acquired the company. So, you know, the tech transition, there were some learnings there, but it's also, hey, you go from being inside.\r\n\r\n\r\nnik (04:10)\r\nYeah.\r\n\r\n\r\nKirk (04:26)\r\nsay, like inside the office to actually being in the field and you can't see the work being done. You can't be on the client site. You have 150 employees that are maybe a level separated from you versus kind of some of the environments I was in prior where yeah, we might've had thousands of employees, but you know, the team that I reported to is much smaller. So yeah, culturally it is very different and like super exciting in some way.\r\n\r\n\r\nnik (04:46)\r\nSo as you were running the company, did you kind of come to this aha moment of it was, was it one of two things? First thing was it, man, there is no software solution that actually addresses all of our problems. Or was it. There are more than enough software solutions, but nobody knows how to implement them and get those systems to tie together. which one of those two kind of led you to this next phase that you're in now.\r\n\r\n\r\nKirk (05:12)\r\nYes and yes. Yeah. Yes and yes. Yeah. I mean, you know, we're, we're a big business and I think that like most companies until you get to a certain size, you don't start investing in somebody who owns the technology, who is an employee of yours, unless you're already a tech business. And so it's owning the technology doesn't mean you're just a, you understand, you're say an engineer, you actually have to understand the business process too.\r\n\r\n\r\nnik (05:14)\r\nOkay.\r\n\r\n\r\nKirk (05:41)\r\nAnd so for us, I described four divisions of our business. Each of them has its own kind of operating workflows. And so they're distinct and unique. And how you go from, say, quoting a piece of business to actually collecting cash against that piece of work takes time and it's different in every single case. And what it actually has an impact on is everything, right? So in construction, when you say complete a piece of work on a project,\r\n\r\n\r\nIf that project is a one day project, it's different than if that project lasts six months to two years, right? And in our case, we might be six months into a project and it's still not complete. But if that, if that work is done on paper and not entered in a timely fashion, then it actually has an impact on the manager, the project manager. It has an impact on finance and it's an impact on me because then I have to go to the report to the board. So I, it made me realize that just inside one silo of our business, we had to account for those sort of unique attributes of that process.\r\n\r\n\r\nBut then how do I do that when I'm trying to do that for three other divisions as well? And so it's really, really challenging to build software across that spectrum. And typically I think a lot of ERPs don't do a good job of mapping into everybody's very specific case. In our case, we think about a property, not a customer. Because, yeah, ERP...\r\n\r\n\r\nnik (06:58)\r\nCan you define what an ERP is?\r\n\r\n\r\nKirk (07:02)\r\nYeah, it's the abbreviation for enterprise resource planning. I mean, it's a very generic term to describe a piece of software that helps you control information and data and a process throughout your business. Right. And, you know, I think if you're in construction or if you're in service, and what we do is, you know, weekly cleanings of swimming pools, we would use an ERP. But in that world, you might call it a field service management tool, right? And construction, it's a project management tool, but they're all kind of part of the bigger.\r\n\r\n\r\nnik (07:31)\r\nYeah. Well, and that that's an interesting problem that you were facing because you've essentially got four service lines that are like you said, one is construction. One is, and a couple of them are services. One, and one of them as a product, geez Louise. So you can't necessarily take jobber for the services. Let's say, and I don't know, I'm using jobber as an example of one of those. did you? Yeah. So.\r\n\r\n\r\nKirk (07:32)\r\nBigger bucket, yeah.\r\n\r\n\r\nI looked at it. I looked at it. Yep.\r\n\r\n\r\nnik (07:57)\r\nSo you can't necessarily take Java jobber, which is managing your cleaning and then use it for the sales of your chemicals, right? And I mean, potentially that you're using Shopify or an e -commerce site and that is then also managing your construction company, which needs a totally different software. So how did you go about solving that problem? Is it proprietary internal software you've created or is it a sort of an approach to marrying a bunch of systems?\r\n\r\n\r\nKirk (08:25)\r\nYeah, the latter. So nobody can do all those things. And I think to expect anybody to do so would be a lot. And I think you see some of the incumbents in the industry, they're building tools, trying to expand horizontally and do other stuff. But the reality is, is like our, our chemical delivery business is B2B. You know, it's, it's, you know, it's not even Shopify. So then who's doing that and how do you do it? And, and it's frankly, it's actually simpler. So, so.\r\n\r\n\r\nnik (08:47)\r\nyeah.\r\n\r\n\r\nKirk (08:54)\r\nThe thing is, it starts with actually what are you trying to achieve? And in our case, right, we care deeply about profitability. We're fortunate enough to be a profitable business. We care about the unit economics. So if we sell a gallon of chlorine, are we making money in that gallon, right? But a gallon to one client, the cost of delivery might be different than the cost of delivery to another. So how we think that through requires its own treatment.\r\n\r\n\r\nBut that client might also be receiving service from us. And so it comes down to, you know, the goal there is, well, are we profitable on a client by client basis? And then how do we do that? Well, it's usually by adding another layer, another reporting layer, and finding an intelligent way to kind of map across these two sort of like pillars of software up one level to look at the two. It's hard.\r\n\r\n\r\nnik (09:44)\r\nWhat are you using for that? Are you doing like Zapier or are you using something obviously more potentially more sophisticated like Microsoft or I don't know some of these other platforms?\r\n\r\n\r\nKirk (09:56)\r\nYeah, there's, I mean, there's a variety of ways to do it. You can do it, do it in Excel, right? Zapier doesn't quite get you there to a, to a consolidated version of it. And you can look at like other platforms, like for example, if you're running your accounting platform, say Gentact or QuickBooks, right? You can begin to actually map all that information back into a central accounting platform, which gets you, gets you what you want. The reality is it's not super flexible.\r\n\r\n\r\nAnd so there are ways to basically tie into all the individual platforms and pull it into Excel. There's tools called, there's one called Cube, there's another called Data Rails, and they're expensive, but what they do is actually get you like really timely reporting where you can tie directly into them and do that. Or you custom build it, it kind of depends. And I think that's where, you know, we, in the practice that we're building now is, you know, if you're, if you don't have great reporting,\r\n\r\n\r\nIt impacts you in so many different ways. You can't rely on the books that might only be, you know, reliable at the end of the month or sometimes at the end of the quarter. So what are your operating metrics? And so that it becomes less about the tool itself because it's sitting on an antiquated system, but it's more about how you use it. And if it ends up in Power BI or it ends up in Excel and it's super powerful, then, you know, building that integration is worth the effort. So.\r\n\r\n\r\nnik (11:19)\r\nYeah, I mean, one of the most difficult things, it may sound weird to say, but in being an entrepreneur is not identifying the key metrics because it's pretty obvious what the key metrics are. Revenue, gross margin, net income, right? It's being able to identify the key metrics that you can pull timely because you don't always, like you're saying, great, maybe you do have a sophisticated operation that closes on the fifth of the month and you get the financials by the 10th.\r\n\r\n\r\nthat's still 30 days in arrears that you're looking, what are the metrics that you need to be looking at? Like today, right now, in order to understand kind of where you're headed. And to me, that's the hardest part in entrepreneurship is getting the timely data.\r\n\r\n\r\nKirk (12:03)\r\nYep. And I think that the other thing, and I'm working on a project now, are actually people who've been in the industry forever know those metrics, right? And they might say, okay, great. Well, this needs to get accomplished in this amount of time. But what I've realized is actually there's almost derivative metrics that we can create to understand are we pacing ahead or behind. And I'll give you an example in the pool industry, which is a great one. And I think a lot of people are just starting to figure it out. So one thing to think about is,\r\n\r\n\r\nSwimming pools in say the Northeast, right, where we have winter season, they have to be opened and usually opened in time for Memorial Day. And so it means that there's a mad dash to kind of that deadline. You don't have that anywhere in the South, right? These other guys that are doing this, they don't have to worry about that. In our case, we do. And so the thing is, what I realized is that if we set a goal of say getting a pool open in five days, meaning the water is balanced, you can swim in it.\r\n\r\n\r\nNobody's, you know, it's going to be a pleasant swimming experience. And on average, you're sort of opening a pool like three and a half days, right? That means you're ahead of schedule. But are you comparing against like your goal? Are you comparing against the pace from last year? You know, if you're, if you can't just use our number of pools open because Memorial Day shifts every, every year. So you have to design a custom metric. And it's like a derivative of what you already have in order to kind of get a sense. Are you ahead? Are you behind? Are you not?\r\n\r\n\r\nnik (13:30)\r\nWhat's your custom metric? So what was, are you allowed to say what your custom metric was?\r\n\r\n\r\nKirk (13:31)\r\nAnd that just sometimes requires another lens. Sorry?\r\n\r\n\r\nThis one specifically, like it's like, Hey, listen, five days, five days to an open pool. Right. But the thing was in that, in that case, that, that was the goal, but that wasn't the actual metric. Right. Because the thing was, is if we looked at it and said, well, cause we might be, we might be trying to open more pools sooner. Right. And so if I try and look at that, that number, it skews things. So you end up having to say, well, it's, it's like,\r\n\r\n\r\nnik (13:42)\r\nOkay, got it.\r\n\r\n\r\nKirk (14:05)\r\nHow many pools have you opened to date relative to your start date from last year? And on average, are they sort of opening in a five -day time span or a three -and -a -half -day time span or a seven -day time span? And if that number creeps up or down, then it's telling you you're doing better or worse. But none of that matters, right? This is the other thing, it's like super important, but none of that matters if the information doesn't get sort of\r\n\r\n\r\nnik (14:12)\r\nMm. Right.\r\n\r\n\r\nInteresting.\r\n\r\n\r\nKirk (14:35)\r\ninputted in the field and if nobody goes and actually does, yeah, garbage in, garbage out, 100%. Yeah.\r\n\r\n\r\nnik (14:36)\r\nYeah. Garbage in, garbage in, garbage out. So let me ask you this question. You're obviously super smart and you know, if you've got a sizable business that's doing well, what made you go from, hey, we implemented or we created the systems in order to integrate these disparate systems and have a centralized location where we're actually seeing real -time data. What made you say, let's start a consulting company?\r\n\r\n\r\nthat helps other companies do this, why not just double down on the industry and say, we've got this competitive advantage, we know that we're realizing, I don't know, four points, four percentage points difference on our net income because we have these efficiencies, let's go roll up a bunch of pool companies or let's go roll up other industries that are just not as efficient as us. Walk me through kind of your decision -making process for this new business that you're doing.\r\n\r\n\r\nKirk (15:32)\r\nYep. The short answer is, well, the pool industry is a vertical and what we're able to do is a very horizontal solution. And I think so. So if you ask, and then the other part of the question is, is, is honestly, if you ask friends of mine, colleagues of ours who were out and who are acquisition entrepreneurs, almost a hundred percent of the time, if you ask them, you know, a year or two into owning the business, if they moved quickly enough when they, when once they bought it, they almost,\r\n\r\n\r\nuniversally say, no, I should, I would have spent more money sooner. I would have hired sooner. I would have fired sooner. I would have done things more quickly. And, yeah, my own, my own lesson was that it took me too long to kind of get out of the fixing the things that needed to be fixed in the business to then take a step back and like focus real hard on the, on the integration stuff that needed to be done. It wasn't a day zero activity, but if we take it, if we look at like the best private equity funds that are out there today, and I'm not necessarily.\r\n\r\n\r\nsay putting them on a pedestal because I'm not. But they're being very deliberate about how when they close a business on an acquisition, that they understand what's going on inside that company. So for me, I'm looking at it from those perspectives and saying, it's very logical to me. It's a much bigger market to me for us to be able to do that in an &A context or even supporting somebody who's got an existing business. So that's one angle. The other side of it is the pool industry is an incredibly tough industry to operate in.\r\n\r\n\r\nfrankly, right? And I think like, there are a lot of people who'd like to be in simple businesses, and I don't think I'm looking for simple businesses. I actually just think that like, there are lessons that are that I learned that are equally relevant to heating ventilation to, to other pool companies that are in other markets or to, I don't know, the travel industry. So I look at that. It's, you know, I think that the next business that I get to work with, right, it's a different type of challenge, but it's actually the same pattern just,\r\n\r\n\r\nthe solution requires like a similar solution. So it gets me excited.\r\n\r\n\r\nnik (17:35)\r\nWell, and are you working on your own tech or is everything sort of a consulting and custom based solution?\r\n\r\n\r\nKirk (17:43)\r\nYes and yes. And the reality is that if we look at like what's going on in technology today, everybody's talking about AI. I don't think AI is the solution for everything. I don't think it's actually a cure -all for anything, but I do realize that it's making a lot of things easier today. And so I think that building enduring products, software products, is getting harder day by day by day.\r\n\r\n\r\nSo we're in a period here in the next two, three, five years. It's going to be, it's tough to say, great. I'm going to go build a product and somebody can't spin another one up tomorrow. And a lot of that is, and frankly, we're seeing that across the spectrum enterprise businesses that are building software where all of a sudden their clients are saying, Hey, you know what? I'm actually going to go, I'm going to build it in a house. I don't need you to sell me the software anymore. So that's really, that's it's real. Right. And so my business partner and I are saying,\r\n\r\n\r\nwe're in an era where services matter. but I think also we're also in an era where people are more primed to like think about the friction that they have. They think AI is the answer when the reality is, is actually what they need is just, you know, a bit, a bit of a better strategy, a real thoughtful review of their process, some, some workflow optimization, sometimes just the right tool, right? And then we can talk about AI. So,\r\n\r\n\r\nSo that's more about business and change management. And that's not tech at all, right? So it's great.\r\n\r\n\r\nnik (19:14)\r\nWell, it's interesting. Jamoth, poly apetit. I don't know. I always screw his name up, but he just started. Did I? Okay, good. he, he just started a fund. I think it's called 80 90 or like 90 10. I can't remember exactly what it is, but his thesis is essentially we can develop 80 % of the functionality with 90 % of the savings. So if you're a company that is currently using Salesforce and it's really expensive and clunky, and you're trying to get all of these tailored.\r\n\r\n\r\nKirk (19:22)\r\nI think you got it right. Yeah, you got it right.\r\n\r\n\r\nnik (19:44)\r\nintegrations to your organization. Well, they could spin up a software that gets you to 80 % of the functionality, and you'll save 90 % of the cost because AI is allowing their team to leverage their time and energy and talents to build that stuff. So I like I agree with you, I do think that the cost of software is coming down. And I, I like the way you articulated your thesis, which was services, businesses are becoming more popular. And so it's about helping them.\r\n\r\n\r\nfigure out ways to integrate it. But AI is not the first step. AI is like, you know, step five after you've gotten a couple of these things knocked out of the way.\r\n\r\n\r\nKirk (20:21)\r\nYep. A hundred percent. At the same time. I mean, like pool industry is not going to go away. The pool industry absolutely isn't going to go away, which I, which I love. but it's not going to grow at the same pace as, as say, sort of, you know, this, this kind of, this kind of service. So.\r\n\r\n\r\nnik (20:37)\r\nWhen did you launch TorchPX?\r\n\r\n\r\nKirk (20:40)\r\nfall last year. So I don't know, six, seven, eight months, nine months ago.\r\n\r\n\r\nnik (20:44)\r\nAnd is that where you're spending the majority of your time right now?\r\n\r\n\r\nKirk (20:47)\r\nYeah, have a couple anchor clients, you know, working with, you know, gosh, gosh, travel business that's been in the industry for 20, 30 years, that's in the process of modernizing a whole slew of things across their tech stack. And some of it is very foundational, frankly. Yeah.\r\n\r\n\r\nnik (21:08)\r\nAnd what do these engagements typically look like? Are they project based where it's like, Hey, we need you for six months to do X, Y, and Z. Are you on a retainer? Is it like a recurring business where they're, you're just a part of their tech stack now, not tech stack, but they're, you know, they're, they're team and you're the one that they go to in order to understand how they integrate all these systems. What is it? What does that relationship look like?\r\n\r\n\r\nKirk (21:29)\r\nYeah. Yeah. In their case, I'm embedded, and I've done anywhere from five hours in a week to, you know, very, you know, big 80 hour a week to try and get some stuff done. you know, and I'm, I'm basically fractional CIO, in that particular case. and then we're looking at sort of where we're going to go build very specific modules within the business.\r\n\r\n\r\nnik (21:50)\r\nCIO being Chief Investment Officer, Information Officer, sorry. Okay, all right.\r\n\r\n\r\nKirk (21:53)\r\nChief Information Officer. Yeah, Chief Information Officer. But there's other cases where my business partner, he's embedded doing a similar thing, more as a fractional CTO. So he's building out sort of a tech, how you say, like a product that meets the needs of the service organization. The other thing is, and these are like retained things that are just blocking and tackling for these businesses. But that's, you know, that's...\r\n\r\n\r\nThat's the stuff that we're excited to do, but it's also, and it's just us, you know, adding value where we can. I'll say this, right? We have, we have a client where we, we've built a real product for them, right? Where we're ingesting call transcripts and a heating and ventilation business. and they have a very narrow specific use case. Right. And they're narrow specific use cases means that like, you can't just jam this into chat TBT. You can't, there aren't,\r\n\r\n\r\nnik (22:38)\r\npoint.\r\n\r\n\r\nKirk (22:49)\r\nthose sort of VoIP platforms today that they give you the intelligence that this person needs in order to determine sort of what success is inside their business. So we've set up a tool that basically ingests those calls, allow them to query the calls, have really timely sort of feedback on what's going on, you know, stuff that they aren't able to gather in other ways. So we look at that and that's an example to come back to your questions like, well, are we building a product? Yes, in this case, it's a very tangible product. I think we've got some other people that are...\r\n\r\n\r\ninterested in it and that's where it's like, you know, we're excited to go sell it and do that. And maybe that's the direction we go, but you know, is it defensible is the other piece.\r\n\r\n\r\nnik (23:21)\r\nYeah.\r\n\r\n\r\nHow are you currently acquiring customers? How are you getting people?\r\n\r\n\r\nKirk (23:32)\r\nA couple of ways. I mean, I've been very tied in the search fund community as a traditional funded searcher. So I have an investor base there and then there's.\r\n\r\n\r\nnik (23:41)\r\nyou were you were a traditional funded searcher. That's how you got into this pool business. awesome, OK.\r\n\r\n\r\nKirk (23:44)\r\nYep. Yep.\r\n\r\n\r\nYep. Yeah, so I raised search capital and then I raised capital to go to the acquisition itself.\r\n\r\n\r\nnik (23:53)\r\nYeah. You did that you did the actual traditional search fund not like, I feel like now it's morphed into like, I'm a searcher. I'm a self funded searchers like, okay, well, you're just somebody who has a job that is looking for a business to buy. That's not really a search fund.\r\n\r\n\r\nKirk (24:08)\r\nYeah, I mean, yeah, it's funny because I didn't know that self -funded was even a route. You know, when I raised, I was like, I thought you just had to go this way. But I will say, I met a lot of people this week who have quit their jobs. They burn the boats and they are funding, you know, self -funded to go execute a search. They're not parallel processing with the work, but yeah.\r\n\r\n\r\nnik (24:30)\r\nNo, I, I would prefer to do a self funded search because I, I would much rather own 90 % of a, of a, you know, five to $10 million business than potentially 30%, you know, depending on my performance and if there was an exit, etc. of a much larger business, but that that would be just me. Just anyways, so I get it, I totally get it. It just was interesting for me to hear it the first time like, what do you mean self funded, but\r\n\r\n\r\nKirk (24:56)\r\nYeah, economics are great for self funded. I mean, it's a fantastic group for a lot of people. And, you know, in hindsight, if I do it differently, I might do a self funded search, you know, but I also couldn't have self funded the business that we bought. So no, I grew up in a restaurant. I grew up in a restaurant.\r\n\r\n\r\nnik (25:06)\r\nI like\r\n\r\n\r\nNo, well, maybe you could have I don't know. But yeah, most people are not. Okay, all right. I do love I do love your thesis for this, you know, there's a kind of a popular investing thesis at the moment, which is find things on your PNL and start services or businesses based on those. So you went and looked at Okay, what's our ERP? What types of systems are we using? These are always a pain.\r\n\r\n\r\nI know other companies have the same pain point and they pay for it. So let's go start a services business around something that we're already spending a considerable amount of money on. was, was that a thoughtful thesis or was it just something that kind of happened by happenstance because it was such a pain in the butt. You figured other people have to have this problem.\r\n\r\n\r\nKirk (25:58)\r\nThe journey to get there didn't start at the P &L, that's for sure. It started from the pain and the realization that it's really, really hard to bridge the gap between business context and the technology context. And especially if you're going across domains. And so what I realized is that I have...\r\n\r\n\r\nI'm in the middle of a process right now with a new firm that we've engaged to do a big project for us and where I'm running it from the client side, right? I'm responsible for delivery from the client side and making sure this firm that's going to help implement a whole pile of different things for us does it right. And so I realize that I'm not just an advocate for the business process, I'm an advocate for the employees and the CFO and the board. And I just...\r\n\r\n\r\nThere's not a single consulting firm out there that's building software for anybody or trying to implement that cares about those things. Or appreciates what it means to be in my shoes eight weeks from Memorial Day and I still don't have the system up and running. So yeah, I think in my sense, I guess from my perspective, humbly, I think that what I realized was to be able to translate across those various kind of like,\r\n\r\n\r\nconstituents and their concerns was a big, you know, to where I can actually add a lot of value. So that was what it was.\r\n\r\n\r\nnik (27:30)\r\nWell, I have some rapid fire questions for you if that works. Specifically with Torch PX, what do you love about that business?\r\n\r\n\r\nKirk (27:34)\r\nSure. Yes, do it.\r\n\r\n\r\nI'm solving problems every day, even if it's not a real, even if it's not going to turn into a sincere opportunity, somebody's facing something in their middle of something and, and, and, you know, whether, whether they actually do it or not, I don't know, but like there were solutions to their problems and, and I get to get to hear them in my head sometimes come up with them. So I love that.\r\n\r\n\r\nnik (28:06)\r\nThat is, what do you hate about it?\r\n\r\n\r\nKirk (28:13)\r\nI think we're really early in the adoption cycle. I think everybody thinks AI is actually, it's actually had more impact than it actually has. It's made more noise than it is in reality. I think there's a lot of businesses that say they're using AI, but really what they're doing is they're going to chat GPT and asking it a question versus having sincerely embedded it into their workflows. And I think also that the patterns for AI are all very similar. And so that's great.\r\n\r\n\r\nnik (28:32)\r\nYeah, I know, right?\r\n\r\n\r\nKirk (28:43)\r\nBut I think despite that, we still haven't gotten over the gap because it's still technology and it's not like, I want to use AI and you just do it. It's not like, I want to use a new piece of software. It's still very involved. And so I think we've overestimated.\r\n\r\n\r\nnik (28:57)\r\nIt's, it's still, it still feels in the novelty phase and you know, there's a lot of good applications when it comes to creatives who are trying to write copy or who are trying to generate ideas or those types of things. But until the agents get to a place where they can actually go and act autonomously as opposed to being, direction, I don't know what the right word is, but told to do certain things. That's when I think things are going to flip is when we have easy autonomous agents that are going out and acting on our behalf to execute functions that we've written for them. So.\r\n\r\n\r\nAnyways, for you, I'm curious, all of us, I think to some degree or another, think the grass is greener in other places. As you sit here, what industries or what businesses are you the most jealous of right now?\r\n\r\n\r\nKirk (29:27)\r\nYeah, I agree.\r\n\r\n\r\nnik (29:50)\r\nI'll give you an example while you think of that. I always think of commercial real estate. I'm like, man, that would be so nice just to get a check, have my property appreciate a little bit faster than the pace of inflation, triple net lease. I don't have to worry about anything. That would be the life. I always think commercial real estate would be like the business I'd love to do. No, I need to.\r\n\r\n\r\nKirk (29:52)\r\nYeah.\r\n\r\n\r\nAre you doing it? So here's the thing is what you just described to me is I want to have a business where I've already got tons of equity. I mean, like that's that's the answer to the question, right? It's like any business where I already have a ton of equity. Like the thing is, if you've got a ton of equity, you get in a commercial real estate, you've got a ton of equity and you go buy a big services business. And it's so big that you're indifferent to whether you make an 18 % return or 15 % return.\r\n\r\n\r\nRight at that point, then you're kind of sitting there and you can kind of just collect. I think, but I don't envy anybody, honestly. I think like everybody's got their own, their own problems. I think it's more just like, it's like the people who are actually solving the problems that they like to solve. I think that's the, that's the big thing. which is the most non -answer answer, but frankly, I just don't, I don't envy people because I look at, I look at what you do and I'm like, you got your own challenges, man. You know, like, I don't think I want to do that. It's part of the reason is I struggled to.\r\n\r\n\r\nnik (31:03)\r\nHow dare you?\r\n\r\n\r\nKirk (31:10)\r\nbuy a business, right? Because the deeper I got, I'd be like, that's, yeah, I'm stepping in your shoes. I don't like those shoes so much, you know?\r\n\r\n\r\nnik (31:15)\r\nYeah. Well, how dare you? How dare you have an emotionally mature answer to this question, Kirk? Okay. I was like, I was hoping for like, I don't know, Buffalo Wild Wings or something. All right. This next question is, I like to ask it, but if you have two hours in your day, you have no personal or family responsibilities, you don't have work responsibilities, you can focus on and do whatever you want.\r\n\r\n\r\nKirk (31:23)\r\nSorry, sorry.\r\n\r\n\r\nYeah, I don't want to go run a restaurant, that's for sure. I definitely don't.\r\n\r\n\r\nnik (31:45)\r\nWhat are you obsessed with right now? Like what is on your brain?\r\n\r\n\r\nKirk (31:51)\r\nI talk about kitesurfing more than I kitesurf. And I actually, like, I think it's a really fascinating sport that everybody thinks is harder than it actually is, but it's actually really dynamic. So that's on my mind. If I could take two hours and go kiting tomorrow, I will probably do that tomorrow afternoon. But it'll take more than two hours. Take my afternoon. Yeah, I would, like, I'll stop everything to go do that. Yeah.\r\n\r\n\r\nnik (31:54)\r\nOkay?\r\n\r\n\r\nkite surfing.\r\n\r\n\r\nOkay, okay, that's red. Okay, my last question to the emotionally intelligent and mature individual is, what advice would you give yourself 10 years ago?\r\n\r\n\r\nKirk (32:30)\r\nDon't listen to everybody else. Do the scary things. Realize that you need to do the scary things to get past it. And just break some stuff faster. Don't wait. There's no reason to wait. Just go do it. Just go do it. Yeah. Yeah.\r\n\r\n\r\nnik (32:47)\r\nI love it. I love it. Awesome. Well, Kirk, where can people find you? Where's the best place to go and...\r\n\r\n\r\nKirk (32:52)\r\nKirkkirk at torchpx .com just like it's spelled. I'm on Twitter, Kirk Knucom. Or send me an email, whatever works.\r\n\r\n\r\nnik (33:02)\r\nOkay, awesome man, this was fantastic. Thank you so much for taking time.\r\n\r\n\r\nKirk (33:05)\r\nThank you for having me. I appreciate it. Cheers. Thanks, man.\r\n\r\n\r\nnik (33:07)\r\nAnd of course, we'll talk soon.",
  "metadata": {
    "duration": "",
    "date": "2024-09-16",
    "platform_source": "Google Drive"
  }
}