{
  "episode_number": "64",
  "episode_title": "How Permanent Equity Built a 9 Figure, Debt-Free Portfolio with Mark Brooks",
  "guest_name": "Mark Brooks",
  "business_name": "Permanent Equity",
  "transcript": "﻿Nik (00:01.091)\r\nAll right, Mark Brooks, welcome to Nicanomics. I'm really excited to have you here. Tell us who you are and what you\r\n\r\n\r\nMark Brooks (00:10.414)\r\nSure. So yeah, my name, my name is Mark Brooks. I'm the managing director at a firm called permanent equity. And we are technically a, you know, a big bad private equity firm, but, you know, we operate very differently than traditional private equity. And I think you can see that in our name. We don't, we don't run 10 year funds where we're trying to spin businesses off. Like we, have 30 year funds. So we essentially act like a next generation of capital, typically for a family owned family run.\r\n\r\n\r\nbusinesses. And that's really what we do. We love coming alongside folks for the long term as opposed to being a short term flip. There's value in that model also, but it's not ours.\r\n\r\n\r\nNik (00:52.389)\r\nTell me, can you kind of break down what a traditional private equity fund looks\r\n\r\n\r\nMark Brooks (00:56.942)\r\nYeah, so traditional private equity fund has a few hallmarks. It's typically going to be a seven to 10 year fund model. And the quick and brash way of talking about them is you spend three years buying businesses, three years building businesses and three years selling businesses. It's not exactly right. But that's kind of the brash way to chop it up.\r\n\r\n\r\nEssentially, traditional private equity is playing a valuation game. So they're buying businesses based on a multiple of EBITDA. And then their whole intent is to grow that multiple over time and to grow earnings over time so that a few years later when they try to sell it to the next buyer, that multiple is dramatically higher and hopefully earnings are higher as well. And that's really how they make most of their money.\r\n\r\n\r\nSome folks may have heard of the two and 20 model. So that's how their fees are structured. So that's a 2 % annual charge on the assets that they have under management at the time. That's the 2%, the management fee. And then the 20 % is the carry, which is any upside that they generate after the sale of one of their businesses, they keep 20 % of that upside. So again,\r\n\r\n\r\nthat gap that they're trying to create by the way they operate the business, by the way they find and integrate add -ons, build a management team, all those sorts of things. That difference between starting price and ending price is how they make a good bit of\r\n\r\n\r\nNik (02:36.827)\r\nYeah, I think for me, one of the things I didn't realize for a long period of time was that private equity funds and small businesses are just playing different games. Private equity funds, they're playing multiple arbitrage many times where they're looking at selling upstream. And most of the time, if their business grows, their business is going to sell for a higher multiple. So they can buy something at a six X because they know that by rolling things up, they're going to be able to sell at a 12 X.\r\n\r\n\r\nWhereas me, small business owner, I can only pay up to a 5X. their economics aren't different in running the business. Their economics are different at the sale of that business. And so by nature of the way they build, they have to exit either by selling upstream to private equity or going public and creating a liquidity event for their LPs.\r\n\r\n\r\nMark Brooks (03:23.98)\r\nYeah, yeah, for sure. I think actually, Nick, you're probably a bit of an odd bird in the small business space and that you think about multiples at all. You know, most of the folks that we're talking to have never thought, you know, until they sat down with their banker or their financial advisors or intermediary, like they haven't thought about a multiple on their business. Like most folks think about their business as a legacy or they think about it as a paycheck.\r\n\r\n\r\nor even think about it as a bank account. You wouldn't believe how many businesses we come across that are so overcapitalized. They just have massive amounts of cash on their balance sheet that they'll never use. But it's because the business owner thinks about the business like they do a bank account. And so there's this interesting conversation, especially for us, because we're not really multiples focused also, which I think we'll get into a little bit later, where\r\n\r\n\r\nThey, the business owner comes to the table speaking Chinese and we come to the table speaking Spanish and then we both have to speak the English of traditional private equity for a little bit talking about multiples. And then we can finally, you know, we can kind of go and start speaking our native tongues again. So yeah, it's a funny, it's a funny little dance around multiples for\r\n\r\n\r\nNik (04:40.443)\r\nTotally is. So like segueing off of that, how does permanent equity differentiate itself from the traditional private equity model?\r\n\r\n\r\nMark Brooks (04:51.662)\r\nYeah, so aside from timeline where we're buying with 30 year funds and no intention of selling the businesses that we're buying, a couple of other major differences is we don't use debt for our purchases of equity. So we tend to go into debt -free transactions, no third party debt. So that's a big differentiator for\r\n\r\n\r\nBut again, if you think about the motivations and the metrics that we're focused on, levering up for a traditional private equity firm makes a ton of sense based on the differential that they're trying to create between their entry and their exit. We're not really concerned about the exit because we don't plan on exiting. So for us, we are very focused, like we think most business owners are, on cash\r\n\r\n\r\nSo our, you know, our, we call beer money. So if the, you know, if you can't buy beer with it, it doesn't actually count. So we're interested in businesses that know how to generate cash. And that's because that's what we're incentivized to do. So when we go to our investors, what we talk to them about is, you know, we're not in the multiples game. We are interested in growing our businesses over time.\r\n\r\n\r\nBut the way that we are structured is we don't make money at permanent equity unless our businesses are making money. So you remember I talked about the two and 20 model from traditional private equity before. There's no two for us and there's no 20 until like 30 years from now, right? Because we're not actually looking at that. So the arrangement that we have with our investors is that every six months,\r\n\r\n\r\nNik (06:23.483)\r\n2 in 20,\r\n\r\n\r\nMark Brooks (06:41.144)\r\nWe're sitting down with each of our businesses and we're saying, okay, of the earnings that you've retained over the last six months, where do you have a very high level of conviction that we can deploy those back into the business and generate a good rate of return? We'll retain those earnings in the business. Everything else we're going to distribute out. And that money gets distributed to our investors and permanent equity keeps a percentage of that. And that's really the only way we make money as a firm is through our share of\r\n\r\n\r\nevery, you know, twice a year distributions of free cashflow from the businesses that we own. That's right. And, you know, that's, that is such a huge deal for us incentive alignment. you know, because we, you know, you can see in the model, like we get paid when our investors get paid. So there's no, there's no management fee. So we don't get, we don't get paid to sit on their money, right? We only get paid when we are, when we're distributing money to them. And so you will see.\r\n\r\n\r\nNik (07:13.945)\r\nIncentives are aligned. Incentives are very aligned between your...\r\n\r\n\r\nMark Brooks (07:39.506)\r\nus negotiating with our CEOs and the leadership teams inside the businesses, the types of employment agreements that you would not see really in any other model, which is where we're incentivizing them to distribute cash. So we have a, you're not, they're not based on EBITDA. They're not based on net income. They're based on actual distributions of cash. So this is your, this is your base and your bonus is based\r\n\r\n\r\nNik (07:52.069)\r\nInteresting.\r\n\r\n\r\nMark Brooks (08:03.416)\r\ncashflow distributions because that's how we get paid. That's how our investors get paid. So we call it kind of drinking from the same soda straw. And we want to make sure, and you can see, you know, for folks who are a little more financially minded, like if you're not, if you're not basing incentives off of the exact same line on one of the three financial statements, things can get out at a joint really quickly. Like, you know, early on in our life, like we had, we had CEOs that were incentivized based on EBITDA. And then you start having conversations\r\n\r\n\r\nNik (08:25.637)\r\nreally quickly.\r\n\r\n\r\nMark Brooks (08:33.218)\r\nfinancing and you're completely at odds in terms of what you're trying to do with the business. So something I would really encourage folks to think hard about is when you're thinking about incentive alignment, make sure that you are measuring the exact same thing at each level of your stack to keep those incentives completely\r\n\r\n\r\nNik (08:53.915)\r\nI used to work at a company where I was incentivized off of EBITDA. And the first time that they did that, it was fine. But then we had this metric in healthcare called DSO, day sales outstanding. And kind of every industry says it in a different way, but it's the same thing. It's essentially your cash conversion cycle. And so you'd have a lot of administrators who were making really good money because their EBITDA was fantastic, but their collections time was, you know, 150 days. And it's like, okay.\r\n\r\n\r\nMark Brooks (09:04.617)\r\nMm -hmm. Yeah.\r\n\r\n\r\nMm -hmm.\r\n\r\n\r\nNik (09:22.627)\r\nIncentives are misaligned here and we can fix that\r\n\r\n\r\nMark Brooks (09:24.086)\r\nYeah, it's a killer cash conversion cycle if you don't speed it up. Yep. Great example.\r\n\r\n\r\nNik (09:30.395)\r\nSo I'm curious from your perspective, a lot of private equity funds do one of two things. Either they will pay a much higher multiple and just buy out the owner, roll it up, realize some efficiencies of scale and continue to grow. Or in some instances, the DSO model in particular is this, the dental services organizations, they'll pitch them on a higher multiple right now, they'll pay\r\n\r\n\r\nMark Brooks (09:46.99)\r\nMm -hmm. Mm -hmm.\r\n\r\n\r\nNik (09:59.323)\r\n60 % of that multiple for an opportunity to get a second bite at the apple, so to speak, when they exit.\r\n\r\n\r\nMark Brooks (10:06.242)\r\nHey, yeah, Nick, I'm really sorry. Can you ask the question? You dropped out there. Can you re -ask the question? Yeah, I'm sorry about\r\n\r\n\r\nNik (10:10.713)\r\nYeah. Dang it. Yeah, yeah, yeah. No, you're totally good. I'm gonna mark this really quick. Cool. So, so at least from what I've seen in private equity, there's been kind of two models. The first model is to pay a very high multiple for the business owners done, they're out. Maybe they do some type of an earn out. Maybe they do some type of seller note, but they're out. The second model is and this is really popular in the dental space with DSOs. They will tell the owner, hey, look, I'll pay you a high valuation.\r\n\r\n\r\nMark Brooks (10:17.239)\r\nOkay,\r\n\r\n\r\nNik (10:40.123)\r\nI'll pay you 60 % of it right now. And then when we sell, we'll give you that second bite at the Apple and you'll get an even higher valuation for your business. But that operator stays on and continues to run the business. You guys, at least from what I've read and heard, you like to keep operators on and you like them to continue to run their business. How does it look for you when you're structuring these purchases? Do you just have large seller notes? You're not necessarily talking about a second bite at the Apple because you're not looking at exiting.\r\n\r\n\r\nHow do you keep these owners on and incentivized?\r\n\r\n\r\nMark Brooks (11:13.934)\r\nYeah, so we have a couple of different models and really we cater to whatever the seller needs for the most part. So we have what we call legacy buyouts where the seller is ready to be done. So kind of our classic example of that is we bought a business out in California from a woman who was still the active CEO of the business and she was 94 years old.\r\n\r\n\r\nSo she's not rolling equity into the new entity. We can do deals where we're bringing in outside management help from the very beginning because the seller is exiting. But our structures really to keep people on look very different based on what they're looking to do. So if it's more of a growth oriented\r\n\r\n\r\ntype of a business and the sellers tend to be younger, then we will buy less of the business and let them roll more because we want them to be highly incentivized going forward to stick around and to see the thesis through. There are other models that we've done where we do make an agreement about a put option for them later on in the life of the business based on what they've told us they're thinking in terms of timing.\r\n\r\n\r\nUm, so yeah, that there's, while we may not all collectively have a second bite at the apple, we like to set what the measurables are that will make that put option possible or, you know, a creative, a creative to them later. Um, so again, when you're, when you're thinking in terms of 30 years, you have to think way down the line, uh, on, on this. And the other thing you have to keep in mind is like, people change their minds too. Like we have, we have people who have stuck around longer than they thought they would. We've had people who have left.\r\n\r\n\r\nNik (12:39.739)\r\nOkay.\r\n\r\n\r\nNik (12:49.627)\r\nfor\r\n\r\n\r\nMark Brooks (13:09.43)\r\nsooner than they thought they would. so you just kind of have to assume when you're going into these things that people are gonna change their minds and recognize that you've got to be flexible and you need to create a structure that's mutually beneficial for everybody. The kind of rule of thumb that we think about, Nick, on that is whoever is forcing on time needs to give on money. So if you're saying,\r\n\r\n\r\nhey, want to ask you to do this earlier than you thought you would, then you need to give on valuation. Or if we say, hey, we want you out before we thought we did, then we need to give on valuation. So we try to create these give take kinds of constructs in the purchase agreement so that there's a very clear understanding about what the dynamics are if someone decides they want\r\n\r\n\r\nNik (13:55.163)\r\nYeah, I really like\r\n\r\n\r\nNik (14:01.859)\r\nIt's it's a clear, clearer way to say that the age old adage your price, my terms, my price, your terms, right? Like it's like that's very broad. This spells out the terms, right? It's like, hey, if you want out sooner, flexible on price and vice versa.\r\n\r\n\r\nMark Brooks (14:09.9)\r\nYeah, exactly.\r\n\r\n\r\nMark Brooks (14:15.65)\r\nThis is the discount. If we went out sooner, this is our discount. Yeah, exactly.\r\n\r\n\r\nNik (14:19.995)\r\nWhat types of positions are you typically taking in these companies? Are they controlling positions, minority positions?\r\n\r\n\r\nMark Brooks (14:25.486)\r\nYes. So no, that's the one thing that is, that's required in our, our LPA, our agreement with our investors is that we will always take a majority position. So we are at least 51 % on everything that we own. We are up to a hundred percent on some and the vast majority of them are somewhere in between. Again, depending on what the owner wants to do, how long they want to stick around, that sort of thing. So anywhere between 51 and a hundred, we tend to get\r\n\r\n\r\nNik (14:54.299)\r\nAnd what's your value prop? Like if I'm a company and I'm selling and I'm the owner and I stay on and I cool, I get some money. I take some risk off the table, but why partner with a private equity fund? Why not like cash out refi or sell altogether?\r\n\r\n\r\nMark Brooks (15:08.034)\r\nSure. Yeah. mean, it really depends on what your priorities are as a seller. We are not a good fit for a majority of people out there. And I think a big reason that people go with us is because of our timeframe. I mentioned earlier, people think about their businesses in different ways as a bank account, as a job, as a legacy. A lot of them think of it as a family\r\n\r\n\r\nSo if you care, kind of our tagline is, it's for people who care what happens next. That's what we're there for. If you don't care that your business is gonna get flipped again in three years, if you don't care that your management team is likely to change dramatically as soon as you step away, if you don't care that your business might be relocated or might be subsumed by a platform company, that sort of thing. And again, I'm not...\r\n\r\n\r\nNik (15:38.351)\r\nYeah, thank\r\n\r\n\r\nMark Brooks (16:07.874)\r\nI'm not blaming anybody. Like this is based on personal priorities. So if you, if what you care about is the, is the largest check size, then you have to recognize that you're giving up other non -monetary things when you, when you make that decision. for us, you know, we, like we, we have a partnership with a, a couple of very young founders up in, Duluth, Minnesota. It was, they're building a software business there. Is that the best place in the world to recruit development talent?\r\n\r\n\r\nNot necessarily, but it was important to them because they grew up there. It is important to them to build a business in Duluth. So part of our agreement with them is that we're going to continue to build that business in Duluth. Were they going to find a traditional private equity firm that would agree to that? Probably not, or they might agree to it for a short period of time. So again, it's like, how much do you care\r\n\r\n\r\nNik (16:56.857)\r\nNo, they weren't. No.\r\n\r\n\r\nMark Brooks (17:05.386)\r\nYou know, your management team and your people, your location, how much do you care about keeping the family name on the business? You know, there are lots of things that go into the more, the softer side of business ownership that people really need to think through when they're making a decision to transition.\r\n\r\n\r\nNik (17:20.603)\r\nI went through this. I sold my medical billing company two years ago, three years, two years ago. That company, I was like, I just want top dollar. I'm going to sell to a private equity fund and I want top dollar and I got top dollar, right? The home health and hospice that I built, that was my baby, man. That was my honestly, I'm upset that I even had to sell it. we did. We did. I had four other partners got outvoted and you know, we're amicable, but that that one hurt. But\r\n\r\n\r\nWe sold to a seller that was not top dollar. We sold to somebody who I was comfortable with continuing on the legacy and I took a steep discount as to what I could have gotten, but legacy was really important to me on that business. So I mean, I've lived it on both ends of that spectrum.\r\n\r\n\r\nMark Brooks (18:04.898)\r\nYeah. Yeah. So that's, I would say that from a structural perspective, that's our, that's our value add on the operating side. You know, what we find, part of the reason we love working with small to medium size of businesses is, you know, where we really like to add value is the stuff that business owners typically aren't interested in. they get bored by, or their eyes start to roll back in the back of their heads when they think about it. Like, you think about like the prototypical entrepreneur.\r\n\r\n\r\nstarting a business. They're starting a business because they have understood something unique about a market or about a gap in the market, and they can build a product or a service for that. No one becomes an entrepreneur like, my gosh, I can't wait to do accounting. I can't wait to run my monthly financials. I can't wait to negotiate banking relationships and come back every year and renegotiate the terms of my line of\r\n\r\n\r\nLike that's gonna be awesome. Like no one does that. And so when we can come in, we talk about where we love to spend our time is the taste like chicken layer of business. So if you look at our portfolio, are all, yeah, we're all over the map in terms of industry, in terms of a location. And that's because we don't have a thesis other than great businesses that know how to make money are gonna continue to make money. And if we can come alongside those founders,\r\n\r\n\r\nNik (19:13.135)\r\nThat's a great saying, man. That's freaking that's a great that I love\r\n\r\n\r\nMark Brooks (19:31.04)\r\nand really help them level up that taste like chicken layer of business. Banking, finance, legal, compensation systems and HR, culture building, those sorts of things. That's where we love to spend our\r\n\r\n\r\nNik (19:41.789)\r\nYeah, are you doing a lot\r\n\r\n\r\nSo banking relationships, AP, payroll, maybe credit card processor, maybe even a credit card tracking system like Divi, like all those back office functions that people hate, you're essentially kind of coming\r\n\r\n\r\nMark Brooks (19:58.464)\r\nRight. So we're not, the other thing that we don't want to do is we believe businesses are healthier when they're not dependent on us operationally. So we will help guide them in those decisions, but we're typically not running them for them. We'll take on temporary project work, but we don't want to become an agency of record for folks, typically speaking. But I will say we're finding exceptions to\r\n\r\n\r\nwhere there are gaps in the market. So for example, we identified a gap in the market for small to medium sized businesses around hiring. It's just really hard to find, you know, because most of those businesses work on scale, you know, recruiting businesses, know, executive search type businesses, they work on scale, they want to work with large businesses. So we had someone internally who's like, hey, I want to give this a shot. Like, can I try working on the hiring side? And we're like, heck yes, go do it.\r\n\r\n\r\nAnd she just started crushing it. so what we, so we actually spun her off as her own separate business called 10th street talent, just a few months ago. And so now she's an independent agency and she only works with small to medium sized businesses and primarily works on executive search, bring people who are like national quality, you know, executives into small to medium sized organizations that are really looking to\r\n\r\n\r\nNik (21:01.669)\r\nHmm.\r\n\r\n\r\nNik (21:15.065)\r\nand do your\r\n\r\n\r\nNik (21:23.387)\r\nDo your LPs have equity in that business or is that like a separate entity that just works with your portfolio companies?\r\n\r\n\r\nMark Brooks (21:28.034)\r\nIt's a, yeah, it's, it's a separate, it's a separate entity. and you know, most of these, like our, businesses are going to need to work with executive search anyway. and she is, and she, because of her, her cost model, she's able to offer, you know, a discount to our portfolio businesses, but she got, she's gotten so good at what she does. She now has people outside the portfolio coming to her and asking her to run searches for her. And\r\n\r\n\r\nclosing several of those a year\r\n\r\n\r\nNik (21:59.003)\r\nWell, I I get it too, because you don't want to take on things at the home office or the mothership, I don't know what you guys call yourselves there in Missouri, that are, you know, tasks or functions, because you're not charging the 2%. You're not charging a home office or a management fee. Lots of companies that I work for would charge 5 % management fee, and they would do a list of things. They'd run payroll, they'd do HR, you know, benefits, all those types of things. But for you, like,\r\n\r\n\r\nMark Brooks (22:07.778)\r\nYeah. Yeah.\r\n\r\n\r\nNik (22:27.471)\r\nIt'd be nice, but you can't float that cost. so there's an, again, incentives, there's an economic incentive for you to not only create the best option, but one that's competitive in the marketplace that your companies will choose to use. I think that's a great, model.\r\n\r\n\r\nMark Brooks (22:44.684)\r\nYeah. Yeah. And we're, mean, we're, we're going to be opportunistic with that. don't have, you know, we don't have one outside of, hiring now, but there's just the number of, you know, national level firms and agencies out there that really understand the difference of running a small business is very small. And so we think, we think there is opportunity out there probably in, marketing, in data analytics and business intelligence, that we may go out there and go get later.\r\n\r\n\r\nNik (23:10.511)\r\nWell, I think you've done something with Clayton where you guys put on phenomenal events. The events are very, very good. And Clayton is now building out this, I don't even know what call it, event company. But there's a clear why, there's a clear product market fit and who he's targeting and all of those things. It just makes sense to me because you did something really well and now you know there's a market demand and so you spin it out. So I think that's a really cool part.\r\n\r\n\r\nMark Brooks (23:20.685)\r\nYeah, thank\r\n\r\n\r\nNik (23:38.627)\r\nof your model is like finding those arbitrage opportunities to kind of take advantage of. you, for you. Okay, these companies come on, you bring them in the full fold, and then you focus on the things. I love it. That tastes like chicken, right? All the things that are just pretty much the same. And you you know that there's a different level of knowledge when it comes to these things with individual operators, like someone may not know, hey, what's your cack? I don't know what that word means. Or hey, what's your gross margin?\r\n\r\n\r\nMark Brooks (23:41.932)\r\nYeah, yeah, it's super fun.\r\n\r\n\r\nNik (24:07.559)\r\nI honestly am not sure, right? So there's like an education component to it. I would love to talk about kind of some of the metrics that you track globally with these companies. But maybe I'm even going down the wrong rabbit hole. First, guess, tell me kind of what your day to day looks like in working with these companies. What are you focused on with\r\n\r\n\r\nMark Brooks (24:18.062)\r\nMm -hmm. Mm -hmm.\r\n\r\n\r\nMark Brooks (24:26.54)\r\nYeah, so I mean, our job here is to really be kind of a board and a box. We want to empower our businesses and our co -owners and CEOs to run the business. So the kind of apocryphal true story is we bought a business and we're like, hey, we want you to run the business and we're excited to have you on.\r\n\r\n\r\nAnd we closed the deal and the next day the CEO calls Brent and he's like, he's like, Hey, Brent, how's it going? Brent's like, good, good. He's like, so, so what do want me to do? And Brent's like, well, well, what would you have done yesterday? And he's like, well, I would have done this, this, this. And Brent's like, great, you should do those things. And he's like, okay. All right, cool. You know, like we don't, again, like we're not, we're not industry experts. And a lot of that is, a lot of that is intentional. Like they're the industry experts.\r\n\r\n\r\nThey started the business because they saw a very interesting opportunity in the market. They know way more about that industry, about the suppliers, about the competition, about the products and services that are out there. We have very little value to add on the highly specialized part of the business. So the things that we were focused on broadly across the entire portfolio have to be very\r\n\r\n\r\nbecause there is not a ton of similarity between a business that sells excess airplane parts and a high -end matchmaking business. There's almost nothing comparable between them. So in terms of what we're looking at broadly across the portfolio, we have a few businesses where we can do comparison points around purchasing. So they're buying aluminum at this price or lumber at this price, that's sort of the thing.\r\n\r\n\r\nBut for the most part, we really have to be focused on the highest of high level financial metrics, the ones that actually matter to our investors. And then each individual business has a very different set of metrics that it's looking at. And we kind of believe, I can't remember which investor said this, but if you can't explain the business with a napkin and a crayon, then you shouldn't invest in it.\r\n\r\n\r\nMark Brooks (26:53.198)\r\nAnd we kind of believe the same thing. Like our underwriting from Tim, our CIO, typically comes back with a maximum of 10 lines of Excel. Like if we can't explain the major leverage points in the business model very succinctly and very specifically, then we've got no business being a co -owner of that company. So it tends to be\r\n\r\n\r\nNik (27:17.243)\r\nInteresting.\r\n\r\n\r\nMark Brooks (27:20.398)\r\nthose metrics that we use in underwriting are the ones that we end up tracking as well. Now, I don't want to oversimplify it. Most of those metrics have 11d bajillion ways that you can drive them. So there are all kinds of ways that you can impact those leverage points. But I think, as a multiple business owner yourself, you have probably learned, you can look at the income statement and there are 45, 50 lines on that thing.\r\n\r\n\r\ntwo of them actually matter to driving the business forward, two or three. And it's different with every business. There's a rate that matters in this business that doesn't matter in this business. There's a volume in this business that doesn't matter in this business. So I have an unsatisfying answer of what do we look at across the portfolio? We look at cashflow and then for each individual business, we look at a litany of other things that are specific to that business.\r\n\r\n\r\nNik (28:05.883)\r\nWhat?\r\n\r\n\r\nNik (28:12.155)\r\nLet me ask it this way. I look at businesses with five categories of potential metrics. There are the financial metrics that everybody knows. Your profit, your margin, LTV, some of those types of metrics. Then there are employee metrics. Things like turnover, your net promoter score, retention, which is just the flip side of turnover.\r\n\r\n\r\nThen there are operational metrics. You know, what are your gross margins like? Mainly your direct expenses, right? Like your variable costs, how you're sort of controlling those. Then there are growth or marketing metrics. So how are we doing on the sales side, et cetera? And then there are product metrics. What's our quality like? What's our customer satisfaction? Those types of things. So like for me, those are the five areas. Financial, employee, operations, marketing, product that I look at. And then I'll assign probably one.\r\n\r\n\r\nor two depending on the category where I'm like, okay, high level, these are the things that I'm tracking. How do you how do you kind of break things down? Do you are you dogmatic? Or is it kind of like, we'll figure it out when we get the\r\n\r\n\r\nMark Brooks (29:24.98)\r\nI am not dogmatic. When it comes to dogma, I probably get most dogmatic around businesses that are doing a decent amount of marketing spend in a direct to consumer environment, probably because I have a lot of personal experience there and because I think there is a way to run a DTC business that is superior to others.\r\n\r\n\r\nBut again, that's my background. I did that at AOL, I did that at The Motley Fool. So I tend to be highly opinionated when it comes to those businesses where I've had the most experience. And as I get introduced to other business models in other industries, I become more opinionated about those as well. So before I was responsible for running a commercial construction subcontractor, I didn't have strong opinions about how projects should be run, how we should be coordinating with other trades.\r\n\r\n\r\nNik (29:59.288)\r\nWhen it comes to ad spend.\r\n\r\n\r\nMark Brooks (30:21.482)\r\nyou know, what we should look at in terms of, you know, metrics on a line of credit and when we should use it when we don't. I have really strong opinions about that now. So those opinions really, they fluctuate around what industry we're in because some of them matter a ton in some industries and others don't. We have businesses that are essentially a marketing engine and that outsource all the actual work.\r\n\r\n\r\nSo people metrics are less important in there and we have other businesses that have a very large payroll because it's a highly specialized labor that they need to be able to bring people in to train them on that sort of thing. In those businesses, people metrics matter a lot. But I think for the folks that are listening, I really like your categories and those resonate with me. I may not have articulated them in exactly the same way, but yeah, think those are, I think there's a really\r\n\r\n\r\nNik (30:52.037)\r\nMm -hmm.\r\n\r\n\r\nMark Brooks (31:16.76)\r\nbuckets to put things in. And if you don't have at least one thing in each of those buckets for your business, you better be pretty darn sure that it doesn't matter to your business model, that entire bucket. And if it does, upon examination, you better think about what you need to throw in that bucket.\r\n\r\n\r\nNik (31:33.627)\r\nSo how do you track metrics? mean, there's cashflow, but the financial statements are backward looking. Maybe best case scenario, you guys are closing the books on the fifth of the month and then your team's working together and you've gotten financial metrics produced by the 15th of the month and then you're able to review them. But by that point, you're almost a past that performance period that you're looking\r\n\r\n\r\nHow do you make sure that you're looking at the right metrics at the right\r\n\r\n\r\nMark Brooks (32:06.924)\r\nYeah, so one of the things that we tell businesses when we're in diligence with them is, before we've closed is, hey, as soon as everyone on your side is comfortable, can you please start copying us in on the metrics and reports that you already use to run the business? Because we actually learned a ton based on what they're already using. And it's never nothing, right? It may not be the best and it may not be the most up to date.\r\n\r\n\r\nNik (32:26.009)\r\nMark Brooks (32:36.882)\r\nbut it gives you a good sense of where they are and what they consider to be important to running the business. For the most part, what we find is that their daily and weekly reporting that they're using to make daily and weekly operational decisions pretty good. Like that's a, it's, it's tends to be insightful. it tends to be at least a leading indicator of what we're going to see in the, in the financial statements at the end of the month. so we will typically stick with what they're already using to run the business.\r\n\r\n\r\nand then ask them to add some things if they haven't sent them out before. Or to increase or decrease the frequency with which they send it. They send out something weekly and it's like, actually, can we get this daily? Or it's monthly, can we get this weekly?\r\n\r\n\r\nNik (33:17.721)\r\nAnd your philosophy is you're buying performing assets. You're not necessarily going in and buying something that's significantly underperforming with a thesis that you're to turn it around and make your money that way. So that would make sense that they have a good sense of kind of what metrics they need to be tracking.\r\n\r\n\r\nMark Brooks (33:32.3)\r\nYep, that is true. We only buy cash flowing businesses. The exception to that is tack -ons. So for those that don't know the terminology, these are smaller businesses that we are rolling into a business that we already own that's very similar. So we have had opportunities where we have\r\n\r\n\r\nbusinesses that are underperforming. And as long as we can understand why they're underperforming and we feel like the business that we already own in that same area is performing well in those areas and we can find a good fit, we will take opportunities to do that. But we do not buy kind of new standalone assets that are\r\n\r\n\r\nNik (34:21.987)\r\nnew\r\n\r\n\r\nCan you talk a little bit about how many of the portfolio companies you manage and are you able to share of like what a combined revenue number might be just to give an idea of what the scale is or employees or just whatever you can share?\r\n\r\n\r\nMark Brooks (34:35.918)\r\nYeah, sure. So across our 16 businesses, I think we have just shy of 900 employees and a bunch of contractors on top of that that are dependent on us and who work for us exclusively. So yeah, about 900 employees across 16 businesses. And our portfolio is largely managed by two of us right now.\r\n\r\n\r\nI have seven or eight businesses. Ryan has seven or eight businesses, our other operating partner. So I'm kind of a managing director, operating partner hybrid. Ryan's our other operating partner. He's managing roughly half the portfolio. yeah, seven or eight businesses each. And again, as we think more like a board and less like a day -to -day operator of the business, each of us can probably take\r\n\r\n\r\nmore than that. I don't know where it actually starts to break. But when we do start getting stressed out and feeling like our calendars are very full, it's actually a good chance for us to step back and say, I waiting in on areas that I shouldn't be? Am I getting too granular? Is this something that I'm taking on myself that actually it's healthier for the long term of the business if they figure this out, if they take on this\r\n\r\n\r\nCause it just like, yeah, just, mean, just like when you're, yeah, I mean, when you're, when you're, this is going to sound condescending. I don't mean it to, when you're raising children, when you're raising children, right? At some point you want them to empty the dishwasher themselves. You want them to do their own laundry and their ironing and learn how to cook a meal, you know, those, those sorts of things. If you're, if you're doing, yeah, it does\r\n\r\n\r\nNik (36:03.139)\r\nInteresting. Talk about that. Talk about that trigger.\r\n\r\n\r\nNik (36:27.547)\r\nPlease tell me it happens, Mark.\r\n\r\n\r\nMark Brooks (36:30.03)\r\nIt does happen. I'm a little bit further along in this journey than you are. Yeah. Um, but, uh, you know, if you, if you're constantly doing that for them, they're, never going to learn and they're going to be stunted adults for not, for not knowing that. And so if you think about, uh, the business, not as it is now, but as you hope it will be in five, 10, 15, 30 years, you want a business that knows how to, that knows how to run itself, that knows how to manage its own stuff. Right.\r\n\r\n\r\nNik (36:30.981)\r\nWell,\r\n\r\n\r\nMark Brooks (36:59.116)\r\nSo the more small things that I'm taking on just because it's easy or just because I can do it or just because I have a background in it, I'm forgoing an opportunity to educate and build the capability that the business is going to need long -term. So, the trigger is just, gosh, I'm really stressed out right now. I've got a ton on my calendar. I have people waiting on me for lots of things. Maybe I need to review what those things\r\n\r\n\r\nand just kind of do a level set on, these things that I should own? Or have I just, have I like picked these up because they're important to me individually, or I've got a background in them or that sort of thing. And that's not necessarily the healthiest long -term decision. It might be the most expedient short -term decision. And obviously we're happy to help with resources in the short -term, but what we don't want to do is stunt the intellectual or emotional growth of the business.\r\n\r\n\r\nlong -term by taking on all this work that they really need to learn how to manage.\r\n\r\n\r\nNik (38:00.291)\r\nYeah, I think that's exceptional feedback, especially for entrepreneurs, they're doers. So if there's a problem, you get in there and you fix it, right? But you can take on too many problems. And so to have a time where you kind of evaluate and say, All right, am I taking on too much? Am I giving them the opportunity that they need to learn and grow and be successful is a is a very, very good exercise. Here's my last\r\n\r\n\r\nMark Brooks (38:20.93)\r\nYeah. I mean, we find thinking about delegation at all should be through the lens of, this for the benefit of the person to whom I am delegating? Now, there are some exceptions to that, but as an entrepreneur, am I just trying to get this off my desk is one way to think about delegation. The other is, am I helping somebody grow a career? Am I helping them learn how to do this? Like, am I making\r\n\r\n\r\na more capable helper for the business in delegating this to them, as opposed to just making my life easy. It's a really helpful overlay for any kind of delegation to think, is this good for the person to whom I am delegating long -term? Am I making them a better human, a better employee, a better worker, a better helper by doing\r\n\r\n\r\nNik (39:08.859)\r\nI'm not mature enough yet. Hopefully I'll get to there. But the way I think about it, the way I think about it right now is I once read a Harvard study where they had two groups and the one group were performers, high performers, and they asked them to focus on their weaknesses. to bring, you know, bring their weaknesses from a 20 % to a 50 % for on 100 % scale. And then there was another group of high performers where they said, don't even\r\n\r\n\r\nworry about your weaknesses, just focus on the things that you're good at. And they found over time that the high performers who just focused on the things they were good at, dramatically outperformed the high performers who were trying to improve in other areas. Now that's not to say you shouldn't improve and that's not to say you shouldn't focus in areas that you're weak. But the takeaway from that that I've always kind of carried with me is all of us have superpowers. All of us have things that we are exceptional at. And if we start taking on things that we're not exceptional at, then we have a problem because\r\n\r\n\r\nNow you're taking away from the things that's the highest leverage use of your time. So you need to figure out how to outsource that or delegate that. But your approach to it, I like a lot more. It's much more emotionally intelligent, which is like, I can delegate, but is this going to help this person down the road? And will it allow them to then grow their sphere of influence, which is really what leadership is all\r\n\r\n\r\nMark Brooks (40:23.66)\r\nYeah. I mean, I think you're absolutely right. And so let's draw a circle in between those two things and say that the follow -up lesson for both of those approaches, which I think is true, is you need to be surrounding yourself with people who are different than you are. To people who think differently than you are, people who do work differently than you do. Because if you're focusing on your strengths and you're delegating stuff that aren't your strengths,\r\n\r\n\r\nto people that have the same strengths that you do, then you're just making their lives worse, right? You're forcing them to focus on things that they're weak at. And we tend to gravitate towards people who are like us. Like I'm an operationally focused person. I tend to gravitate more towards operationally focused people than dreamers, right? Dreamers tend to congregate with other dreamers. And so there's this real challenge\r\n\r\n\r\nNik (41:16.453)\r\nYeah,\r\n\r\n\r\nMark Brooks (41:20.654)\r\nbuilding a business, building a leadership team is like, you don't want an orchestra full of trumpets, right? It doesn't sound nice. It's not balanced. But that's what we do. we're not keeping our heads up and realizing who we're bringing onto our team, you need to be surrounding yourself with people who are more like guardians of the business, people who are more risk averse. They're extremely valuable in huge roles. And they tend to be the types of people\r\n\r\n\r\nGenerally speaking, dreamers are going to avoid, right? Because they tend to say no a lot, but they provide really helpful guardrails of safety for the business. know, brakes are so we can drive fast, not so we can drive slow, right? And so just a challenge for, yes, focus on your gifts. Yes, focus on delegating things for the good of the people who are receiving that work. And the way to do that is to build a team of very\r\n\r\n\r\npeople with different skills and different dreams for what they want to\r\n\r\n\r\nNik (42:21.485)\r\nAmen. Amen. Very well said. I have some rapid fire questions to finish this off. That's not good. right. What are some shared characteristics that you have found in successful companies? Because you've managed many companies, you've seen lots of different businesses, you've probably even seen lots of businesses that you didn't end up purchasing that were still good businesses, they just didn't necessarily fit your investment thesis. For you, what what are the shared characteristics?\r\n\r\n\r\nMark Brooks (42:26.594)\r\nOkay, yeah sure, yeah let's do\r\n\r\n\r\nMark Brooks (42:51.214)\r\nSo I would say an important one is bad news travels at least as fast as good So a business and a culture that doesn't shy away from bad news and actually bubbles it up faster than good news is a really healthy sign It's hard to bury stuff that becomes, you know an infection that becomes a death warrant You know when you're when you're in a business that has high velocity of bad news\r\n\r\n\r\nI think is a very positive thing. I think people who recognize that as the business grows, you can do one of three things. You can specialize, you can delegate, or you can stay small. Those are your three choices. So for a CEO who's doing a little bit of everything, as you grow,\r\n\r\n\r\nyou can either specialize and say, okay, I'm going to continue to be like the product gal at this business. Or you can delegate and say, I'm going to hire a management team, one of whom is going to be the leader of product. Or you can stay small. That's your other option. Because if you are insisting on making every strategic decision for the business,\r\n\r\n\r\nNik (44:09.083)\r\nTotally agree.\r\n\r\n\r\nMark Brooks (44:16.418)\r\nthe business is definitionally, you become the lid on that business. So leaders that are willing to recognize where they are exceptionally strong, like we were talking about in our last conversation, and focus solely there and delegate everything else, that's a really good sign for a business that's going to be able to grow. And the third I would say is businesses that know how to take good risks.\r\n\r\n\r\nNik (44:38.811)\r\nI love\r\n\r\n\r\nMark Brooks (44:45.708)\r\nSo we talk about taking risks above the waterline of the boat. So if you want to run an experiment on, I wonder what would happen if I drill a hole in the side of the boat, you want that to be above the waterline and not below the waterline. companies that are good at testing and trying things are the ones that have a really good nose for what's above and what's below the waterline. And once they figure out where that waterline\r\n\r\n\r\nThey're willing to test a lot of things, collect feedback, be wrong lots and double down on the, on the areas where they think they're right. so yeah, those are just a few ideas on\r\n\r\n\r\nNik (45:26.841)\r\nLove it. Love it. All right. You've seen a lot of different businesses and all of us are jealous to some extent. So my question to you is what businesses or industries are you the most jealous of right\r\n\r\n\r\nMark Brooks (45:42.702)\r\nUh, I mean, I think, I think digital content is a great business. Now I'm, you know, I'm biased. spent, uh, I spent 14 years at, uh, at the Motley Fool. Um, and so I think, I think in terms of margins generated versus level of effort, if you can, and, the whole thing here is like, I'm not talking about going out and competing with CNN or Fox news or Yahoo or anything like that. I am talking about, uh, there are riches and niches.\r\n\r\n\r\nAnd I think you'd be really surprised, you know, most of your listeners have a surprising amount of expertise when you drill down, you know, small enough to a very particular part of their very particular industry that people want to learn about. And they're willing to pay a lot of money to learn about it. So if you can develop a discipline as a writer of putting out really great content, and you don't aspire to like have thousands of employees, I think, I think that's a, that's a great.\r\n\r\n\r\nrelatively low headache business. There's no physical assets. You're not having to manage a large team. So just in terms of heartburn to return, think that's a pretty good business to be in.\r\n\r\n\r\nNik (46:47.503)\r\nYeah.\r\n\r\n\r\nNik (46:57.669)\r\nDude, you're dropping all these nuggets, heartburn to return. I gotta write that one down too. Okay, so if you have two hours in your day, you don't have any family responsibilities, you don't have any business responsibilities, and you can do whatever you want for those two hours, what are you obsessed with right now? What's on your mind? What are you spending your time\r\n\r\n\r\nMark Brooks (47:00.728)\r\nHa ha ha ha.\r\n\r\n\r\nMark Brooks (47:21.026)\r\nyou know, I've, I have, made kind of a conscious decision to spend less time on Twitter lately. and I have, the, the trigger habit that I have developed in place of it is picking up a book. so I have, I have read, I've read more in the first six months of this year than I've read probably in the last three years combined. so that's what, that's what I'm obsessed with right now is, is just reading.\r\n\r\n\r\nNik (47:36.981)\r\ncool.\r\n\r\n\r\nMark Brooks (47:49.902)\r\na ton. if I had, I've been fairly omnivorous, which has been fun. So I'm a Jesus follower, so I read a good bit about him. I read some history, so I read a great book that Morgan Housel recommended to me called 1944.\r\n\r\n\r\nNik (47:50.521)\r\nWhat kinds of books?\r\n\r\n\r\nMark Brooks (48:14.222)\r\nIt's like a 700 page book, just about that one year of history. And it was phenomenal. I read a lot about management, especially people management, know, the softer side. So I read a great book, again, recommended by a friend, Michael Newton called On Caring. This year, it's like hundred page book that was written in the seventies that was really great. So yeah, I I try to read kind of across the gamut, but those are some quick examples.\r\n\r\n\r\nNik (48:18.832)\r\nWow.\r\n\r\n\r\nNik (48:44.185)\r\nYou ever messed with Arbinger Institute?\r\n\r\n\r\nMark Brooks (48:48.928)\r\nI don't think I have, tell me about\r\n\r\n\r\nNik (48:50.459)\r\nLeadership and Self -Deception, you ever read that book? Yeah, it's told as a fable, it's a good people book. So anyways, a recommendation, I think you'd enjoy it. All right, my last question, what advice would you give to yourself 10 years\r\n\r\n\r\nMark Brooks (48:53.875)\r\nI've heard of it. haven't read\r\n\r\n\r\nMark Brooks (48:58.71)\r\nOkay, cool. check. Okay, I'll check it out.\r\n\r\n\r\nMark Brooks (49:11.406)\r\nI would say the advice I would give to myself 10 years ago is remember what's important. When you're young, like I was 10 years ago, there's so much noise in the world and there are so many things that it's easy to get envious of or to lose focus on.\r\n\r\n\r\nNik (49:19.963)\r\nWhat do you mean?\r\n\r\n\r\nMark Brooks (49:41.294)\r\nUm, and, uh, you know, most of them are, most of them are dead ends. Uh, and so I, I wish that I could tell myself, uh, 10 years ago, you know, it's a long, take a long, take the long view on life and really, really focus on two or three things that you want to be cornerstones of your life and ignore all the temporal stuff, ignore keeping up with the Joneses, uh, you know, all, all those sorts of distractions. Um,\r\n\r\n\r\nI think my 10 -year -old self would have benefited from that a\r\n\r\n\r\nNik (50:13.275)\r\nI have a quick story that happened this weekend that's very similar to that. My 10 year old, my 10 year old, oldest son and we were swimming and I love to throw my boys around. Like they love to just launch them into the pool, you know? But he's big, he's like 80 pounds. And I, this is the first summer where I'm like, dude, I can't throw you anymore. And anyways, he asked me to throw him and I'm like, I can't throw you anymore. And I was thinking, for whatever reason, it was just stuck in my head.\r\n\r\n\r\nMark Brooks (50:17.677)\r\nYeah, sure.\r\n\r\n\r\nNik (50:42.787)\r\nthat day, it was like, there's always gonna be a moment where it's like the last time I play basketball with him or the last time he asked me to read him a nighttime story or the last time, you know, that we go get ice cream together. And it was a very bittersweet moment. And that night I went and laid with him as he was going to bed and I just talked to him. I was just like, hey, what's going on? But it was a really nice reminder to me to make sure that the things that are important to\r\n\r\n\r\nstay important to me and I make time for them. So I love the way that you articulated\r\n\r\n\r\nMark Brooks (51:14.315)\r\nYeah, for sure. Treat every time like the last time. you will, you know, that I think somebody put it like, you know, sucking out the marrow of life. So if you treat each experience like it's the last time you're going to get to do it, I think you get so much more enjoyment and pleasure out of life here on earth than you would otherwise.\r\n\r\n\r\nNik (51:38.085)\r\nI agree. Mark, this has been a phenomenal conversation. Thank you so much for making time. Where's the best place for people to find you or learn more about you if they're interested?\r\n\r\n\r\nMark Brooks (51:46.956)\r\nYeah, I'm Mark at permanent equity .com. So keep it, keep it super simple. Mark at permanent equity .com. I'm at Mark Brooks on Twitter. Those are the two best places to get a hold of me. I'd love to, I'd love to have a conversation and thanks a lot for having me on Nick. It was really\r\n\r\n\r\nNik (52:03.023)\r\nYeah, perfect. This was great, man. Let's talk soon.\r\n\r\n\r\nMark Brooks (52:05.368)\r\nAll right, okay, sounds good, see ya.",
  "metadata": {
    "duration": "",
    "date": "2024-09-30",
    "platform_source": "Google Drive"
  }
}