{
  "episode_number": "80",
  "episode_title": "How the $574B Digital Media Industry Is Being Disrupted by a Sesame Street Alum with Caroline Strzalka",
  "guest_name": "Caroline Strzalka",
  "business_name": "Overplay",
  "transcript": "﻿Nik (00:00.96)\r\nAll right, Caroline, why don't you give us some of the meat and potatoes? Tell us what your business is and how you make money.\r\n\r\n\r\nCaroline Strzalka (00:06.519)\r\nSure. So I'm Caroline Csukka. I am the founder of Overplay. Overplay is a no -code solution for making any video into a game. So the way I like to describe it to people is that we're like TikTok for gaming. So you can download Overplay. It's an app right now for both iOS and Android, and you can download it. And you're just scrolling through mini games that are made from videos that anyone can make and anyone can play.\r\n\r\n\r\nAnd these are tapping, swiping, jumping, driving games. basically what you're doing is now you're having an interactive experience with video. And it's awesome. It's like the next, it's what's next for social media. It's what's next for commercials. It's what's next for anyone doing anything in media or video.\r\n\r\n\r\nNik (00:55.308)\r\nCould you give me just a quick example of what, let's say I have a video on my phone, what kind of a video would I use to turn into a game?\r\n\r\n\r\nCaroline Strzalka (01:03.349)\r\nYeah, so maybe you went to a Taylor Swift concert. You know, you took your kid to a Taylor Swift concert. There's this like really great video of Taylor dancing on the stage. And now you can make her dance into like a swiping game. And so the kind of interaction that you have with this content now is that if you think about Dance Dance Revolution or Guitar Hero, where the goal of those games is to match the action you see on the screen. Now with your thumb, you're having to swipe, swipe, swipe as Taylor's dancing.\r\n\r\n\r\nAnd if you're doing it accurately, you're getting points now based on how accurately you're putting in the input and you're getting rewards. so, and then there's a leaderboard at the end and everything too. So now, yeah, you could take literally a video of anything and make it into a game. You know, maybe your dog is running around the park and jumping over logs. And now you can make that into like also maybe a swiping game or a tapping game.\r\n\r\n\r\nNik (01:50.126)\r\nThat is awesome.\r\n\r\n\r\nCaroline Strzalka (01:59.861)\r\nor maybe you're recording, maybe you're using your GoPro and you are recording a mountain biking trail that you're going down and you're recording that and now you can make it a POV driving game, you know? So literally anything can now be made into a game and you can do this within minutes.\r\n\r\n\r\nNik (02:17.432)\r\nSo you have had a really cool run over the last little bit. You obviously started this company. You've raised a couple of different rounds. You're currently raising around on WeFunder. Mark Cuban has invested. You've been on Shark Tank. What was it about this business that attracted you to it? And why do you think it's resonating so well with people?\r\n\r\n\r\nCaroline Strzalka (02:39.127)\r\nSure, yeah. It's one of these things where my co -founder, I've known my co -founder for now like 16 years or something like this. We worked together at Sesame Street and his name is Dan Projanski. And one day Dan told me about this idea of how he thinks that he came up with a way to turn any video into a game. And automatically like my business development hat went on and I was like, my God, Dan, if you could build that and we could patent it.\r\n\r\n\r\nI was like, that is like the goose that laid the golden egg. It's really what we would have wanted at Sesame. you know, coming from the media industry where it costs so much money to film content, it costs a lot to film live action Muppets as you might have thought about or not, but it costs a lot of money. And so we're always trying to create a long tail for that content, you know, trying to...\r\n\r\n\r\nCan that video be used in an app or can it be used in an ebook or something like this? We're always trying to make that content go further. And to make games is really expensive. Even the easiest game that Sesame was making for apps or whatever, was like $25 ,000 to make that game. Yeah, I mean, it's probably gotten more expensive since then. And so...\r\n\r\n\r\nNik (03:57.1)\r\nto make the game.\r\n\r\n\r\nCaroline Strzalka (04:03.703)\r\nyou I was like, my gosh, if video could be used as the asset that you then are putting the layer of gaming on top of that solves so many problems because you're taking the most expensive parts of making a game out, right? You're taking out the asset creation, the engineering that all has to go behind it. And, and yeah, these are snackable games. So these are like 30 to 45 second games. They're like, they're games that you're getting that quick, you know, hit of\r\n\r\n\r\nNik (04:13.08)\r\nYeah.\r\n\r\n\r\nCaroline Strzalka (04:32.363)\r\nYou know, maybe it's just fun or maybe it's educational or whatever it is, but that might just do the trick for what you're making. So these are not AAA title games with, you know, that cost millions of dollars. These are really easy to make games. Yeah.\r\n\r\n\r\nNik (04:45.666)\r\nWell, so on top of that, the gaming industry is massive, I mean, it's like it's more than a half a trillion dollar a year industry. Is that right?\r\n\r\n\r\nCaroline Strzalka (04:49.419)\r\nYes. Yeah.\r\n\r\n\r\nCaroline Strzalka (04:54.419)\r\nYes, and yeah, gaming is like the biggest form of media out there and it's growing exponentially every year. You know, the stats around the amount of people that play games every day, it's like now it's like the majority of Americans and as you go to like Gen Z, it's like, yeah, everyone is playing at least a game. And if you think about games, it's like people are playing casual games, you you're on the subway, you're playing a game, you know, my head of games called them.\r\n\r\n\r\ncall them toilet games, you you're in the bathroom, you're playing a game. We don't like to admit it, you know, but, you know, you're, you're taking the time and then people are also playing the AAA title, you know, games. But it's, it's huge. these are like, you know, 60 hour plus games where you're, you know, completing the multi level. These are, yeah.\r\n\r\n\r\nNik (05:32.536)\r\nYeah. What does that mean, AAA?\r\n\r\n\r\nNik (05:42.37)\r\nAlso, so AAA is an actual, I guess not brand, but like category of games.\r\n\r\n\r\nCaroline Strzalka (05:47.389)\r\nyeah, category of games, right. Like, so this is like Madden, you know, football or, you know, or this is that kind of thing, you know, where you're playing on a console system on Xbox or whatever, you know? Yeah.\r\n\r\n\r\nNik (05:59.128)\r\nSo what I find interesting is like there's kind of two paths into entrepreneurship. I mean, there's lots of paths into entrepreneurship, but I think there's two differentiators into entrepreneurship. There's the regular sweaty startups, just any business that you could go into and start. And then there are tech startups or venture backed startups. And those are the ones where you have to go out and raise money. The former...\r\n\r\n\r\nCaroline Strzalka (06:18.689)\r\nYeah.\r\n\r\n\r\nNik (06:23.95)\r\nIt may take a year or two for you to get to a place where you're consistently profitable, but you can bootstrap that business. The latter, it may be a 10 year or even 20 year horizon before you're like really seeing the fruits of your labor. I'm curious. This industry is so big. It's you found a way to do it cheaper than most other gaming companies. Why did you decide to raise and why not go the bootstrap route?\r\n\r\n\r\nCaroline Strzalka (06:40.897)\r\nYes.\r\n\r\n\r\nCaroline Strzalka (06:47.979)\r\nYeah, with this, it's very, very difficult to go the bootstrap route. This is software that we were making something that's never been built before. So we really did need a team of engineers to make both the game maker and the game player. And we built this both for iOS and Android. So this takes a lot of money. This is not one of those things where you can like kind of piecemeal it, release it, charge people money for it. It's just, it's not one of those businesses.\r\n\r\n\r\nNik (07:03.627)\r\nMm\r\n\r\n\r\nCaroline Strzalka (07:17.791)\r\nwhere you have to kind of go whole hog, hire the engineers. I mean, this automatically costs hundreds of thousands of dollars even to get going. And so,\r\n\r\n\r\nNik (07:20.715)\r\nMm\r\n\r\n\r\nNik (07:27.758)\r\nSo how did you even get to the, cause if you're getting into entrepreneurship and how did you even get the idea, obviously you're working at Sesame Street. How did you get the idea to say, all right, let's, Dan, let's spin this out into a real company.\r\n\r\n\r\nCaroline Strzalka (07:32.79)\r\nYeah.\r\n\r\n\r\nCaroline Strzalka (07:40.757)\r\nYeah. So what actually ended up happening is that, you know, we, Dan and I, we kept our day jobs and Dan had this nugget of an idea. We were able to, through another entrepreneur friend of ours, find a developer actually in Argentina who was also willing to work nights and weekends to help us see\r\n\r\n\r\nwhether this could even be built, right? So Dan had this idea of how to now, a brand new way to make games on top of video. And we didn't even know whether it was possible, right? So we were trying to build the MVP, the minimum viable product. And so a lot had to be worked out. And between him and Dan, they were actually able to come up with the MVP. From that, we were able to get the MVP.\r\n\r\n\r\nshare the MVP with a lawyer who was then able to see how big this could be, right? And we're able to get the patent for this, right? So to get the patent. Yeah, yeah.\r\n\r\n\r\nNik (08:47.116)\r\nA lawyer? Why a lawyer? okay. Okay. So sorry. He so he wasn't like telling you, hey, you should go raise money for this. He was saying this is or is not patentable.\r\n\r\n\r\nCaroline Strzalka (08:55.177)\r\nNo, no, we knew that if this could be built, this is a multi -billion dollar idea. This is worth a lot of money. And when you're thinking that way, you know that you have to go the venture backed route. There is no bank that's going to lend you the millions of dollars that you need for this. Like we are, you know, pre -revenue, we're still pre -revenue. And so there's, this is not a traditionally bankable idea.\r\n\r\n\r\nLike when you have something, especially in the software space, that's highly scalable and that could be huge. You want to have a billion dollar idea. it, if it check marks those boxes, then you know, you have a venture backable idea. And sometimes with ideas like this, you know, it, can only really go down the venture route because this is like one of those things where they have to believe in the future of what the software could produce in terms of revenue. And banks don't believe in you.\r\n\r\n\r\nNik (09:52.088)\r\nSo what's Dan's background? I know he worked at Sesame Street, but what was his?\r\n\r\n\r\nCaroline Strzalka (09:53.247)\r\nat that stage,\r\n\r\n\r\nCaroline Strzalka (09:57.461)\r\nYeah, so Dan actually studied film in college. So he's not a traditionally trained computer scientist. He studied film and in he started off at Sesame kind of more on the more on the on the on the video side for Sesame and ended up being a self taught engineer and ended up running becoming the head of interactive.\r\n\r\n\r\nat Sesame and running that whole team. So he's just one of these brilliant guys, but it was film. And it was film what really is the thing that really helped him to, it was his film background that really gave him the other way of thinking about making games that is not the traditional way, right? It's, yeah, he used, yeah.\r\n\r\n\r\nNik (10:46.316)\r\nYeah. So what I think is fascinating about many of these ideas is there's like always an element of serendipity to them. The companies that make it really big or have industry changing technology that they roll out. And his experience obviously being at Sesame Street and being in the position to understand their IP catalog as well as how interactivity works. But your background, I mean,\r\n\r\n\r\nCaroline Strzalka (10:54.401)\r\nMm\r\n\r\n\r\nNik (11:15.03)\r\nYou went to University Penn undergrad and Wharton MBA. You're freaking smart and you do have really good experience and somehow you both end up at Sesame Street, which is not, it's not a place that people think of when they think of like Wharton MBA, right? And then you find this idea that both of you get excited about and obviously you start a company. Was your intention always to be an entrepreneur or did this just kind of come about and it was like,\r\n\r\n\r\nCaroline Strzalka (11:17.803)\r\nMm -hmm.\r\n\r\n\r\nCaroline Strzalka (11:30.946)\r\nright.\r\n\r\n\r\nNik (11:42.454)\r\nYou guys look at each other and we're like, yeah, we'd be idiots not to run after this idea.\r\n\r\n\r\nCaroline Strzalka (11:46.551)\r\nYeah, so I guess after undergrad, I was an investment banker and I used to take companies public. And one of my companies that I helped to take public was GameStop. And this is, you know, back in the day. this would have been, we took GameStop public in 2001. 2001, yeah.\r\n\r\n\r\nNik (12:01.688)\r\nWhat year?\r\n\r\n\r\nNik (12:09.654)\r\nOkay. So this is is this is way before this is when they were actually, you know, a profitable making sense investing company, not a meme stock. Yeah.\r\n\r\n\r\nCaroline Strzalka (12:15.479)\r\nYeah, yeah. Yeah, yeah, absolutely. and so, you know, at the bank, I was like one of only a few women on my team, I think there was a group of 100, I was one of three women. And I had to get these founders of GameStop. So imagine like, you know, founders of a gaming company, or a gaming retail company that kind of in a way fell into success. I mean, they work very hard, but, you know, clearly also\r\n\r\n\r\nyou know, they came in, they're rough around the edges. And, and I had to clean them up for their roadshow, basically, right, like with the presentation and the business and like, and, and, you know, get them ready. And I looked at all these other companies that, you know, I was working in equity capital markets. And so I would take all these companies public, and I would look at these founders. And sometimes as founders, they were the original founders. And sometimes there are the founders that\r\n\r\n\r\nNik (12:46.462)\r\nRiding a wave. Yeah.\r\n\r\n\r\nCaroline Strzalka (13:12.159)\r\nor they were the management that came in later after the founders. But I would look at these people and be like, you know what? I could do that someday. Like I could found a company. If these guys could found a company, I could found a company. And one day I could ring that NASDAQ bell for my company. And in a way, being a banker, that seed was already planted in my head that I was like, if these guys could do it, I could do it too. There's nothing stopping me from doing this. I am so yeah, so I went to I went\r\n\r\n\r\nNik (13:38.402)\r\nThank\r\n\r\n\r\nCaroline Strzalka (13:41.879)\r\nto business school, I knew that I didn't want to go back into banking. I already had done my stint there. did not. mean, I the way that you learn about Wall Street is by working on Wall Street. And I kind of feel like I learned a lot. And I was also working like 100 hour weeks for like three years. It was it was crazy. And and so went to business school, studied marketing and entrepreneurial management.\r\n\r\n\r\nAnd I was really intrigued by both and Wharton's curriculum in that area. And entrepreneurial management, it kind of gives you like the scaffolding around which you could kind of think about starting a company. And so I had it in my mind that I didn't know that I would start a company. I never thought I would start a company like right after business school, which is not what I did anyway.\r\n\r\n\r\nBut I always had in the back of my mind that yeah, maybe I could start something and at least Wharton would give me the good scaffolding to do it.\r\n\r\n\r\nNik (14:40.78)\r\nYeah, I mean, it's really interesting to hear you start telling the pieces because I always feel like when you get into entrepreneurship, whatever your first foray into entrepreneurship is, I'm a very risk averse person. So I think go into the thing that has the least risky profile to it. And I tell people, look at your subset of experiences, look at your skill set, find a business that matches that and kind of build around that. The easiest thing to do normally is like start an agency business. Maybe you're a\r\n\r\n\r\nCPA and you started practice. Maybe you are an engineer and coder, you know, start doing freelance work, et cetera. But, you know, do something that you have a special skill set in. And so just hearing you start talking about the little nuggets that you were developing over time is incredible. The road show. Like that is not something a lot of people go through. Like road shows are hardcore because you, you are literally going around to institutional investors and pitching your company and they're asking you very hard questions. You have to be prepared.\r\n\r\n\r\nto not just answer the surface level questions, but the second, third, fourth order questions because they're putting a lot of money and capital behind you. so to hear you like preparing for that and understanding what is needed in those pitches, there's like one skill that's being developed. Then you go over to Sesame Street and you're like, this, this makes sense. Well, before Sesame Street, you develop, you go to get your MBA in marketing and entrepreneurial management.\r\n\r\n\r\nyou go to Sesame Street and you start learning about content, you meet somebody there, and then all these pieces come together where with Overplay, it's a no -brainer to invest in Caroline at this point because it's like, yeah, she has all of these experiences. Did you think about it like that at the time or is it only in retrospect that you were able to say, yeah, it did work that way?\r\n\r\n\r\nCaroline Strzalka (16:25.615)\r\nI think I see my life in a different way. I think I see my life as pretty fluid. And I like to, one of the best pieces of advice that I ever got.\r\n\r\n\r\nis to put yourself in challenging situations. And I will tell you, being an investment banker right after undergrad, it's like being thrown in the fire, right? Like it was super challenging, but I knew that I would come out, like if I kept my eyes and ears open, like I'd either come out, you\r\n\r\n\r\nknowing people that would be useful in the future for me or with an idea or something like that. And then going into Wharton for my MBA, I kind of came in a little bit open knowing that I was like, I don't need to study finance. I've already done that. And let me see what else is out there. And so I was like exploring a variety of classes and I was like, I really, I just had that feeling in the back of my mind that entrepreneurship would be there. And then,\r\n\r\n\r\nYou know, I took the job at Sesame after MBA, which is not normal for a Wharton MBA to go into a nonprofit. and, but it was, it was really interesting cause I kind of, once again, kept my options open. didn't want to go into management consulting, because I actually like making stuff, that actually, like, I felt like management consulting was a lot of like, you know, writing up decks.\r\n\r\n\r\nfor a client that ended up never being implemented. I wanted the work that I did to somehow be useful to the world. I wanted to make stuff. I get lot of pride in being able to make something. But yet I'm not an engineer. So Sesame was an interesting opportunity because they were looking to bring on some business people to really help with various areas of the business, especially around building\r\n\r\n\r\nNik (18:03.583)\r\nMm\r\n\r\n\r\nCaroline Strzalka (18:23.383)\r\nthe digital media business, was just starting off. If you think about the iPods and like iPads and how kids, you know, yeah, so I entered, I started working at Sesame in 2006. And so, and then I was there for seven years. No, no, I was there for a long time and you know, we,\r\n\r\n\r\nNik (18:30.798)\r\nWhat year was this? 2008?\r\n\r\n\r\nNik (18:43.404)\r\nWow. Okay. You there a long time. It wasn't like you were just there two years, found a cool idea and bounced.\r\n\r\n\r\nCaroline Strzalka (18:51.349)\r\nI was working investment banking hours over there as well, but we were making really cool stuff. So Sesame's very first apps, console games, all the deals with Netflix, Hulu, YouTube, those platforms were just getting started and everyone wanted to work with Sesame because it's like the gold star.\r\n\r\n\r\nNik (19:08.206)\r\nSo were you doing, you were negotiating like licensing deals, like you were doing the business development side of things.\r\n\r\n\r\nCaroline Strzalka (19:12.747)\r\nYep. Licensing deals, but also thinking through the content, like what could be made from this, but then also like going over and, and flying out to San Francisco and working with IDEO's Toy Lab in creating Sesame's very first app. like rapid prototyping and everything like that. When you're at a nonprofit, you're doing like everything. So yes, my title was business development, but I was also like, you know, kind of creative and you know, marketing or everything.\r\n\r\n\r\nNik (19:37.774)\r\nDid you? You really do. You have like the perfect profile to invest in you like you're so smart, but you have very specific experience in a niche space. Anyways, like that is I just think that's so freaking cool. When? When did you in that kind of run up? When did you decide like overplay was the thing you wanted to do? Was it 2015 and it was like a three month period of time?\r\n\r\n\r\nCaroline Strzalka (19:43.585)\r\nHahaha\r\n\r\n\r\nCaroline Strzalka (19:48.492)\r\nYes.\r\n\r\n\r\nCaroline Strzalka (19:52.299)\r\nThank you.\r\n\r\n\r\nNik (20:05.214)\r\nyou're like, yep, this is it. We're out. Or was it kind of a slower process that took a few years to unfurl before you and Dan decided to make the step?\r\n\r\n\r\nCaroline Strzalka (20:13.749)\r\nYeah, so what had happened is that prior to COVID, so Dan and I had kept in touch. Dan and I are totally yin and yang though. So he's kind of like, he's like the mad scientist kind of guy, like the brilliant engineer, you know, and then I'm like more like on the business side, but also like, pretty creative and, and strategic. So Dan and I, we would meet up for coffee, like once a month.\r\n\r\n\r\nearly in the morning and just talk about our ideas. Cause we always had stuff buzzing on the side that we were working on. And so it one day we're meeting up for coffee at my local coffee shop here. And Dan tells me about overplay. And so I literally told him, I was like, if you could build that MVP and we could patent it, I'm in. And so what ended up happening is that during COVID, I was actually down in Florida with my parents and you know, kind of doing the COVID thing.\r\n\r\n\r\nand working from down there.\r\n\r\n\r\nNik (21:10.808)\r\nmy, hold on a second. So you were living in New York, but then you were in Florida?\r\n\r\n\r\nCaroline Strzalka (21:15.571)\r\nYes, so I moved down to, actually right before New York was closed down for COVID, I was down in Florida for my nephew's first birthday and they ended up closing New York and I never came back.\r\n\r\n\r\nNik (21:32.206)\r\nThat is so that is so funny because I, I was in California for the very beginning of COVID. And then I moved to Idaho in like May. And so you probably have the same experience like California was like, dude, anybody within a quarter mile gets COVID, we're all gonna die, shut everything down. Like it's the worst thing, you know, put 17 masks on, then you come to Idaho and it's like, COVID don't exist. That's a conspiracy theory.\r\n\r\n\r\nCaroline Strzalka (21:38.956)\r\nMm\r\n\r\n\r\nCaroline Strzalka (21:43.552)\r\nYeah.\r\n\r\n\r\nCaroline Strzalka (21:50.123)\r\nYeah. Yeah.\r\n\r\n\r\nCaroline Strzalka (21:57.313)\r\nYes. Yes.\r\n\r\n\r\nNik (21:59.815)\r\nlike just totally opposite ends of the spectrum and that like that's New York and in Florida too.\r\n\r\n\r\nCaroline Strzalka (22:04.257)\r\nYeah, that was New York and Florida. But it was, it's nice. You know, my parents, you know, luck, luckily, you know, lucky me, they live right on the beach. And so it was really the best place. We could actually stay away from other people and be in a beautiful natural setting. And I was helping take care of my parents and keeping them safe too, which was really important because coming from the North, I was already, by the way, masks up here.\r\n\r\n\r\nbecause I listened to the BBC and I had heard a report about a virus coming out of China and this was like weeks before, like weeks before I went down, weeks before any of this was called, I was already wearing a mask. And so I came down, you know, with that knowledge that, you know, but I didn't think anything would be closed down. Like I didn't think I'd be not, I didn't even go back to New York for like 18 months.\r\n\r\n\r\nNik (22:59.822)\r\nThat is insane.\r\n\r\n\r\nCaroline Strzalka (22:59.871)\r\nSo it was cool. I hung out at the beach. I worked on my business, you know. Exactly.\r\n\r\n\r\nNik (23:03.414)\r\nYeah, there's freaking worse places to be than on the beach. So you spent that time during COVID to kind of take the opportunity to start working on Overplay.\r\n\r\n\r\nCaroline Strzalka (23:12.427)\r\nThat's exactly right. Yeah. And not only did we start working on overplay, we started raising money for overplay. So yeah.\r\n\r\n\r\nNik (23:17.056)\r\nOkay, so let me let me ask you this because this is where I think most entrepreneurs are going to identify with you or it's like, Hey, cool. I met somebody else. We have a cool idea. Let's partner together and do something and work on it. But this is where the divergence starts. You are sitting there thinking I need to go raise if we're going to make this work, I got to raise money because this is going to cost hundreds of thousands of dollars to develop and most entrepreneurs don't even enter this space. So I think this would be a fun conversation to get into some of the details. When did you start realizing you needed to raise money for this? Was it right away?\r\n\r\n\r\nCaroline Strzalka (23:34.049)\r\nThat's right.\r\n\r\n\r\nCaroline Strzalka (23:47.295)\r\nright away. Even when Dan first told me about the idea, I had it in the back of my mind that like, is this a good time to fundraise for this? I mean, there's all sorts of things you have to think about strategically, given the area of the given the industry, right? And so it ended up being also to that gaming and media, it was a good time, you know, to raise for that. And so we're talking about 2020. Yeah.\r\n\r\n\r\nNik (24:10.872)\r\ngreat time. How did you know how much money? How much? How did you know that first initial round? Because I think you said there's been three rounds so far. So that first friends and family round, how much did you raise? And how like, how did you get to that number?\r\n\r\n\r\nCaroline Strzalka (24:23.723)\r\nMm -hmm.\r\n\r\n\r\nYep. So this is also one of those things you have to think about to you have to think about very strategically. You can't raise too little that people don't take you seriously and you can't raise too much that you're selling too much of your company early on. Right. So no matter what you do, if you do, if you decide to raise around of a funding, pre -seed round of funding or a couple pre -seed rounds, like what we did.\r\n\r\n\r\nRaise it as a safe, not even a convertible note. Raise it as a safe is kind of like a convertible note, but it's a little bit more founder friendly. But this is the Y Combinator created instrument that came out like 15 years ago. And it is really the best thing to raise off of. And so there's some standard terms that you usually use. So I had it in my mind that we need to raise one and a half million dollars.\r\n\r\n\r\nNik (25:06.168)\r\nMm\r\n\r\n\r\nCaroline Strzalka (25:25.347)\r\nAnd the way that I got to one and a half million is because I was like, you know what, we need a million dollars, but we're probably going to need that half million dollar buffer to for this unknowns, right? This might end up taking no matter what you start, it ends up taking much more time and much more money than you think. Oftentimes it ends up taking three times more time and three times more money than you think, even if you're being, you know, adding in the buffer.\r\n\r\n\r\nNik (25:45.144)\r\nYeah.\r\n\r\n\r\nCaroline Strzalka (25:54.263)\r\nSo I thought I was like, you know what, let's raise one and a half million and let's do it on some standard terms, right? So usually, you know, usually standard terms, especially you can look at the industry, think about the safe that you're raising. You're like, well, you know, let's raise it at, you know, eight or eight and a half million post money cap and let's do it at a 15 % discount. You know, these are like standard terms. Yeah. Sure.\r\n\r\n\r\nNik (26:20.974)\r\nSo let me, can I just break that down for people who are listening? You may be thinking, people, I'm speaking to the audience now, you may be thinking, my gosh, if I went and raised money, I'd have to then figure out the valuation as well. So she raised a million and a half dollars, like what's the valuation and what percentage equity, all that stuff. What a safe does essentially is it says, I'm raising a million and a half dollars. And when I raise the next round or when there's a priced round, you will have a, and you said 15 % discount.\r\n\r\n\r\nCaroline Strzalka (26:28.151)\r\nYeah.\r\n\r\n\r\nNik (26:51.118)\r\nat whatever we raise at. And there's an $8 million cap. So if we end up raising at a $10 million valuation, your discount is not discount, excuse me. Your equity piece is calculated at that $8 million cap. you actually Yeah, you have more upside to it. So you're not giving away equity. upfront in these pre seed rounds, you're you're doing the safe which sits there the company is able to use it and then it converts\r\n\r\n\r\nCaroline Strzalka (27:06.421)\r\nYeah, get the better of the, yeah.\r\n\r\n\r\nNik (27:19.704)\r\nto equity once there's a priced round in the future.\r\n\r\n\r\nCaroline Strzalka (27:23.851)\r\nThat's right. know, your cap is serving as like a proxy for your valuation, but it's not the actual valuation yet. And it doesn't become an actual valuation until you raise your first price round, which by the way, we have not yet raised a price round. We've raised only on saves rate. A price round is really when you're, so when, when you're really, you're, you're doling out the equity. So you're coming in with a specific price. All of the money has to close on a certain date.\r\n\r\n\r\nNik (27:37.314)\r\nAnd what does that mean, a price drown?\r\n\r\n\r\nCaroline Strzalka (27:52.021)\r\nYou're doling out the equity actual ownership in the company and all the safes or convertible notes are now converting at that date.\r\n\r\n\r\nNik (28:01.08)\r\nDid you, did you know all of this stuff at the time or did you have to go and like, all right, I'm like, I guess I'm to go read all of Paul Graham's essays and you know, all the white commoners because like white commoner to put out a ton of information and like, okay, I need to incorporate in Delaware because that's what they say. And then it needs to be a C Corp. that like walk me through your process for getting up to speed on the structure for a venture back company.\r\n\r\n\r\nCaroline Strzalka (28:21.803)\r\nYeah. Yeah. So just to lay it out, know, right after undergrad, I worked in equity capital markets. I used to price convertible notes, you know, so like I understood.\r\n\r\n\r\nyou know, what a cap was, what a discount was. Convertible notes are complicated, like super complicated. But the general concept of convertible notes, even for large companies, like I understood what that was. And then when I started taking my entrepreneurship classes at Wharton,\r\n\r\n\r\nAnd I was like, yeah, you can raise now convertible notes, you know, for a startup. Yeah, that makes sense. Of course that makes sense. And converts were still the thing. Safes came a little bit later. But, you know, if you kind of keep up on you know, on entrepreneurship, like, yes, you do. You know, you hear about Techstars, you hear about Y Combinator.\r\n\r\n\r\nIf you're kind of up and up on that, you know, there's a lot written about them, right? So you can kind of read a lot about it. So I would read about safes and I knew that safe was the right way to structure this. Yeah. There's a lot of podcasts too on this. So yeah. Yeah.\r\n\r\n\r\nNik (29:28.622)\r\nHow did you just, there are, yeah, yeah, I know there's a ton of YouTube and there's a ton of different types of safes. you can, anyways, you can do it a bunch of different ways. How did you go about like.\r\n\r\n\r\nCaroline Strzalka (29:40.683)\r\nThere's really only two kinds of safes, by the way. It's a pre -money and post -money. And you just want to use the standard safe that's on the Y Combinator website. Just use that safe.\r\n\r\n\r\nNik (29:50.626)\r\nWell, what I'm saying is you can augment the safe with a bunch of different terms that you throw in there is what I meant. Yeah.\r\n\r\n\r\nCaroline Strzalka (29:54.815)\r\nYes. Yeah, you can augment the safe, but you really you're only changing the first. It's the first piece. I one of the reasons I'm kind of like honing in on that is that the safe is the safe. And it's like the whole idea behind it is that it's so easy and it should not be changed other than for you changing the cap and the discount. Like you really are not supposed to change other terms.\r\n\r\n\r\nAnd that's what makes it so easy for investors to come in and for founders to raise off of a safe.\r\n\r\n\r\nNik (30:25.528)\r\nSo if anybody was raising pre -seed or seed, you recommend going the safe route.\r\n\r\n\r\nCaroline Strzalka (30:32.023)\r\nAbsolutely. Convertible notes are still too complicated. There's still too much negotiation. You want to make it as easy as possible. Also, you don't want to spend a lot of money on lawyers or in this early stage. You don't want to be, and you don't want to be changing your terms for this one investor and that one investor, whatever. It makes your cap table super messy. You have lots of side letters. No, no, no, no. Make it as easy as humanly possible from the beginning. Just raise us a safe.\r\n\r\n\r\nNik (31:02.254)\r\nOkay. how did you, when you were, when you were going the safe route, how did you go about deciding what you would pay yourself? Cause that's been always been something I've never done a venture backed company. but it's always been something I've been curious about. it's like, get into entrepreneurship because you want control and you want to make money and you want to do your own thing. But when you've got a venture backed company, could be 10 years before you go public and have a liquidity event. And maybe there are some opportunities to take secondary along the way, but your salary in particular, like how is that set?\r\n\r\n\r\nCaroline Strzalka (31:24.491)\r\nMm -hmm. Yep.\r\n\r\n\r\nNik (31:31.98)\r\nAnd how did you decide on that in that first kind of go around?\r\n\r\n\r\nCaroline Strzalka (31:35.447)\r\nYeah. So I think we began paying ourselves in the second round of funding. So we raised one and a half million and then we raised a second round of funding, $3 million round. And we started paying ourselves at that point. The reason for it is because if you're going full time on your startup, you have to pay yourself because you have to live somewhere and you have to eat. And so Dan and I, you know, talked about it.\r\n\r\n\r\nyou know, it's expensive to live in New York. But, you know, we're the only folks who ever in our company, we're the only folks who do live in New York. most of our most of our team is is global. A lot of folks in Latin America and Europe. And so but Dan and I, you know, we're like, OK, here's what I think we're going to need to pay ourselves just to be able to live, you know, and.\r\n\r\n\r\nAnd here's also what's acceptable for us, but also our investors also expect us to pay ourselves because if you're not paying yourself, yeah. Yeah. If you're not paying yourself, you can't work full time at your idea, you know, like you have to have your side hustle or whatever. so investors really want you to be focused on your, you know, on your company. And so you absolutely do need to pay yourself. It might not be with your first round of funding. It was not for ours.\r\n\r\n\r\nNik (32:39.416)\r\nWell, that's, that's less than this. No, finish that.\r\n\r\n\r\nCaroline Strzalka (33:02.296)\r\nbut we did need to do it for our second round. were not able to.\r\n\r\n\r\nNik (33:05.23)\r\nSo what was the time period between the first round and second round of funding?\r\n\r\n\r\nCaroline Strzalka (33:08.695)\r\nWe raised our first round in 2021 and we raised our second round last year.\r\n\r\n\r\nNik (33:17.358)\r\nOkay, so that's two years. What did you do for two years to make ends meet? I mean, you raised the money for... ahead.\r\n\r\n\r\nCaroline Strzalka (33:20.727)\r\nso we, yeah, we did raise as a safe. so if you can, once again, if you can raise as a safe, you're just, collecting checks and you're able to spend as they come in. So even though we closed our last round in 2023, I believe we started paying ourselves in 2022. Yeah.\r\n\r\n\r\nNik (33:40.59)\r\nOkay. Where did the majority of the money go? Was it all development costs?\r\n\r\n\r\nCaroline Strzalka (33:46.519)\r\nYeah, it's mostly product focused. So we were building both for iOS and Android, a game player and a game maker. And we're building in native code. So we have 20 people currently on our team. It is still mostly product focused at this point. I mean, we do have some QA, some research ahead of design. But yeah, it's mostly engineering. But now,\r\n\r\n\r\nas we raise this next round of funding, which a lot of it is still gonna go towards engineering to build our API. But we are gonna bring on like some business folks to help us out on the marketing side and other places, yeah.\r\n\r\n\r\nNik (34:30.478)\r\nOkay. How do you think about equity? like that would always, I know the safes are good because they give you flexibility, but when you finally do convert, should be a goal of a founder? Like are they like, yeah, I'm still owning 80%. You know, me and my co -founder own 80 % or is it more than that?\r\n\r\n\r\nCaroline Strzalka (34:38.87)\r\nYeah.\r\n\r\n\r\nCaroline Strzalka (34:52.594)\r\ngosh, yeah. Yeah, so the rule of thumb, so in general, this is just rules of thumb. With every round of funding that you raise, expect to sell off anywhere between 15 to 20 % of your company. And as you think that through, also, what you also want to do is that with every round of funding, you're hoping to double your valuation, right? So,\r\n\r\n\r\nIf we raised at an $8 million post -money cap, our first round of funding, our second round of funding, we raised that at 15 million post -money cap. And now say for instance, we're raising at a 30 million post -money cap. So that way every time you're, you're selling off, yes, a certain percentage of your company, but you're doing it at increasingly higher valuations. And in general, this is like the rule of thumb, but\r\n\r\n\r\nyou want to be hitting those milestones to be able to now justify the much higher evaluation from raise to raise. So all of those milestones that you're telling your investors that you're going to hit before the next round, you want to make sure you hit them so that way you can justify your next level of valuation.\r\n\r\n\r\nNik (36:04.492)\r\nOkay. And you've done some pretty interesting things with raising money. You've gone institutional. You've done the friends and family, but you've also raised on these fundraising platforms. Tell me why to quote the Backstreet Boys.\r\n\r\n\r\nCaroline Strzalka (36:13.043)\r\nMm hmm. Yep. Yeah, so we, yeah, we, what's that? I'm sorry. Yeah, tell me why. Ain't nothing but a heartache. Yeah, no, but no, it's not a heartache raising on WeFunder. So it's, no, WeFunder, we decide, so there's three equity crowdfunding platforms. And this is different than regular crowdfunding. This is not\r\n\r\n\r\nNik (36:19.938)\r\nI said to quote the Backstreet Boys, tell me why. Yes, you got it.\r\n\r\n\r\nCaroline Strzalka (36:42.271)\r\nyou raising money for surgery for your dog. is equity crowdfunding is it is raising from the crowd in exchange for future equity for your company, right? So what happens is that there's three platforms that you could raise from. We raised on WeFunder. There's also Start Engine and Republic. Those are the three. And they're all a little bit different from each other, but essentially they all end up doing the same thing.\r\n\r\n\r\nwhich is put together a SPV, a special purpose vehicle where you're able to aggregate a lot of investments and they could be a hundred dollars all the way up to a hundred thousand dollars that whatever people want to put into your company, but it's all aggregated as one SPV and ends up being one line item on the founders cap table. So, and you raise it as a crowd safe. And so we were\r\n\r\n\r\nNik (37:38.097)\r\nso it is a safe. It's not a convertible note.\r\n\r\n\r\nCaroline Strzalka (37:39.255)\r\nIt's a safe. Yeah, I'm telling you safe is the way to go. and so we decided to raise our second round of funding, which was last year and to raise it as, so we raised half of it, one and a, we raised a $3 million round in total. We raised one and a half of it from institutional, from venture capitalists, angels, all of that, and one and a half million of it from we funder. And, we figured, you know what we're democratizing gaming.\r\n\r\n\r\nand we funder is democratizing investment, minus well, know, bring normal people in to be able to invest in Overplay.\r\n\r\n\r\nNik (38:17.56)\r\nWell, it's interesting because there is a perception of people who raise on these crowdfunded sites that either A, venture capital, they couldn't raise money anywhere else. So they've got to go raise from a bunch of uneducated investors or B, if they do raise, it's going to make it more difficult for venture to come in and invest because it muddies the cap table. So how you kind of just explained the first, which\r\n\r\n\r\nCaroline Strzalka (38:25.143)\r\nMm\r\n\r\n\r\nNik (38:47.986)\r\nI like and agree with how do you respond to the second one where maybe VC shies away because they're on the cap table now.\r\n\r\n\r\nCaroline Strzalka (38:52.875)\r\nYeah. Yeah. It doesn't muddy the cap table at all. So because it's one line item, it's one special purpose vehicle, you know, who's, you know, and it's, kind of funny when we first started raising on we funder Dan and I always like, we're normal people. grew up in Philly. Dan grew up on, in, in, New York, but like in New York in the seventies, you know what I'm talking about? Like seventies and eighties. I mean, I grew up in a,\r\n\r\n\r\nNik (39:17.698)\r\nYeah, yeah. Free Giuliani, New York. Yeah.\r\n\r\n\r\nCaroline Strzalka (39:22.389)\r\nYeah, you know, like, you know, we're normal people. We're people that worked really hard to get to wherever we were. But we're like normal middle class kids who like middle class city kids. grew up in a row home, you know, like we wanted to be able to almost like bring, you know, we wanted to bring overplay to the people we wanted normal people to like ride the\r\n\r\n\r\nthis kind of spaceship with us, like we're a rocket ship. We wanted to bring people along for the ride. Dan and I always had it in our minds that we wanted to bring people like us on the journey with us. And we told our investors this. So we had some institutional investors who actually didn't know anything about equity crowdfunding. And they're like, why are you doing this? And it was like, because we can. And at the end of the day,\r\n\r\n\r\nyou just need to bring in your money quickly and it doesn't matter. I mean, it does matter. You want to keep your cap table clean. So what I mean by clean is that you don't want a thousand line items on the cap table. But if you have a couple of them too, that's fine. Ain't nobody going to say boo about it. like, you know, you just kind of, want to, you know, we, we move forward anyway.\r\n\r\n\r\neven if, look, if a VC complained about us doing that, be like, okay, well then you either reinvest in us or invest more in us so that way we don't go that route, you know? But yeah, we figured we just could. And I'm very glad that we made that decision because there's ancillary benefits to raising equity crowdfunding as well. Not just the money that comes in, but, and it's not uneducated folks who are coming in, which I kind of like take a little bit of offense to.\r\n\r\n\r\nbecause that is the way that by the way people think about retail investors, wrongly. I mean, we have a lot of real, we have people who are investing for the first time. Absolutely. They're just getting their feet wet on investing. And I love that so much. We actually even there's even classes, there's undergrad classes where you have to invest in a company and you learn about venture capital by investing through like we funder, which is awesome. But then also too.\r\n\r\n\r\nNik (41:36.29)\r\nHmm. Yeah.\r\n\r\n\r\nCaroline Strzalka (41:38.891)\r\nthere's LPs who are invested in major funds, or there's angels who come in, like big time angels who just like snoop around on Start Engine and WeFunder looking at the best new ideas, right? And so it's kind of like you're almost able to be like a shark on Shark Tank. Like you can figure out who's the winner here.\r\n\r\n\r\nNik (41:56.078)\r\nWell, that's how you got on the shark tank, right? Was somebody who had invested in one of your?\r\n\r\n\r\nCaroline Strzalka (41:59.691)\r\nAnd then go, then, right, they discovered us on WeFunder. So Shark Tank approached us because they found us on WeFunder. And then also too, like, you know, we have all these, we're gonna be announcing some really big partnerships soon, and some of those partnerships found us through WeFunder, which is like awesome, yeah. So.\r\n\r\n\r\nNik (42:20.686)\r\nThat's really cool. Well, it's, it, it's interesting because you, you say a lot of the things that investors want to hear a founder say, but you know, I feel like 99 % of the time it's because the, the, the founder has figured out what they want to hear and then work their way back from it and found like a little story to tell that can like tie in to, to, what they want to hear. But like,\r\n\r\n\r\nCaroline Strzalka (42:31.635)\r\nMm\r\n\r\n\r\nCaroline Strzalka (42:45.696)\r\nMm\r\n\r\n\r\nNik (42:50.028)\r\nyour experience, you worked seven years at Sesame Street and your award in MBA. Like you're not just motivated by the same kinds of things. So like this is very in line with your brand, I would say. So it's just really cool to hear you talk about it, but also have the history to back up what you're talking about. not just lip service.\r\n\r\n\r\nCaroline Strzalka (42:53.878)\r\nYeah.\r\n\r\n\r\nCaroline Strzalka (43:09.227)\r\nYeah, and also Dan and I are very genuine people. Like we wear our hearts on our sleeves, like in all honesty, you know, and it even goes back to a question that you asked a little earlier, which I'm not even sure I answered fully. I don't think I did. We had to think about also to like ownership. One of the things you really do need to think about if you do go down this route where you're raising saves or even, you know, equity or whatever, you really do need to think about how much ownership you retain.\r\n\r\n\r\nin your company with every round of funding. And it also has to come at a certain timetable where you're able to achieve what you need to achieve, right? So it's a careful balance of how much you're raising, how much you're selling off and at what time. And Dan and I, as we're telling our stories, this is all coming from the heart. This is our baby, Overplay is our baby.\r\n\r\n\r\nNik (43:39.715)\r\nMm\r\n\r\n\r\nNik (44:02.222)\r\nNo, it's cool. mean, talking to you for 10 minutes, you're like, okay. She's genuine. This isn't just like a story she's, she's telling people. last question on the business and then, and then I have some rapid fire questions to wrap up. So you're four years in, you're just about to start monetizing this year. What do you think the timeline is for you personally to have a liquidity event?\r\n\r\n\r\nCaroline Strzalka (44:06.133)\r\nYeah. Yeah.\r\n\r\n\r\nCaroline Strzalka (44:23.893)\r\nMm -hmm. Yeah.\r\n\r\n\r\nNik (44:26.444)\r\nAnd what does the liquidity event look like? it a secondary or is it going public? Like, are your intentions?\r\n\r\n\r\nCaroline Strzalka (44:29.131)\r\nYeah.\r\n\r\n\r\nCaroline Strzalka (44:32.639)\r\nYeah. so I do think that within a year's time, Overplay is going to get offers to be bought. like, and that could be from, I, you know, it's always like putting my investment banker hat back on. This could be from a public company that's in the social media space or in the media space. And they need to constantly show growth for investors.\r\n\r\n\r\nAnd so it could be a public company that is looking to round out by adding in gaming or by adding in,\r\n\r\n\r\nNik (45:03.746)\r\nLike when Facebook bought Zynga, or was it Ben? I can't remember who the company was, the Farmville and all that stuff.\r\n\r\n\r\nCaroline Strzalka (45:10.519)\r\nyeah. Yeah. yeah. right, right. Exactly. Or when they bought Instagram, right. or, or like, you know, Adobe putting in the offer to buy Figma for $20 billion last year. Right. and so, there's, there's various reasons why folks might be interested in overplay and, and it could be a media company, but it also could be a creator economy company. could be a platform.\r\n\r\n\r\nNik (45:22.792)\r\nMm. Yeah. Okay.\r\n\r\n\r\nCaroline Strzalka (45:39.431)\r\nand there's, there's a, there could be a bunch of interesting opportunities there, but I also do think Overplay has enough legs to potentially go public. and the reason why I believe that as well is because, Overplay, yes, we have our app, but we are also building the API and the API would allow our, technology to be wrapped, and, and inserted into.\r\n\r\n\r\nother websites and apps. So for instance, ESPN .com could integrate the Overplay API and now make game playable highlights reels. And they'll be playable on ESPN .com. And that's the kind of thing where we believe Overplay could be ubiquitous. And so yeah, so there's a...\r\n\r\n\r\nthere's different opportunities. I don't think that the timeline, it's too long before we could do something along those\r\n\r\n\r\nNik (46:37.154)\r\nYeah, I'm just, trying to give somebody an idea who's like listening to this, like, man, four years in and, know, maybe she's making a salary, but to not have any liquidity event for putting that much work in is, is hard. Like when is, when could there be an expectation? So you think in the next few years, there could be something. Okay. last question, what's currently the biggest bottleneck to growth? Is it getting users to adopt it? Is it engineering? where do you see growth stalling currently?\r\n\r\n\r\nCaroline Strzalka (46:52.015)\r\nWe do think three to five years time. Yeah.\r\n\r\n\r\nCaroline Strzalka (47:00.3)\r\nMm\r\n\r\n\r\nNik (47:07.318)\r\nNot stalling, but just the bottleneck.\r\n\r\n\r\nCaroline Strzalka (47:07.447)\r\nYeah, I'm glad that I can say this because this is like an easy solve, but it is the money right now to be able to hire the folks to build the API. So we're raising around a fund. feel like funding is always the bottleneck, but there's a lot of interest in overplay on the investor side, which is really great. But yeah, we're raising a $5 million round right now. We've raised\r\n\r\n\r\n1 .3 million on WeFundr so far. We're in due diligence with some funds that are coming pretty close. So I think that we'll be able to wrap up this round pretty soon. But yeah, right now it's about like being able to, yeah, bring on, hire the API engineers to like now be able to move things forward. yeah.\r\n\r\n\r\nNik (47:47.426)\r\nMm\r\n\r\n\r\nNik (47:58.126)\r\nHow many daily active users? guess, how do you measure the app itself?\r\n\r\n\r\nCaroline Strzalka (48:02.049)\r\nYeah.\r\n\r\n\r\nYeah, yeah. So we just released our beta in June and we had to create our own tables on the backend to be able to measure all of this stuff because this is not something that you can normally measure through like regular Google Analytics or the app analytics and things like that. We had to measure other things. So we had to build that whole dashboard and everything too.\r\n\r\n\r\nNik (48:16.268)\r\nMm\r\n\r\n\r\nCaroline Strzalka (48:30.551)\r\nSo we needed a few months. So we just launched the beta in June. We needed a few months. We're to be releasing to strategic investors our usage. But right now, we have over a quarter of a million downloads. We have over 1 and 1 million game plays, over 4 million minutes already played on Overplay. yeah, and this is without any marketing, really. I mean, yes, we were on Shark Tank.\r\n\r\n\r\nOkay, we were on Shark Tank, I do give that, but we're not like, you know, actively marketing overplay yet. Yeah. Yeah.\r\n\r\n\r\nNik (49:02.286)\r\npushing it. All right. Here's some rapid fire questions to end it. You ready? What do you love about this business?\r\n\r\n\r\nCaroline Strzalka (49:13.013)\r\nI just love bringing something new out into the world that'll help people discover something new creatively about themselves. This is a tool now where anyone could be a game maker. And I think most adults have never made their own games. Most adults have filmed videos and shared it with their friends, but now they can add an interactivity portion on top of it to make it even more fun. And I just love this new creativity tool. Yeah.\r\n\r\n\r\nNik (49:40.566)\r\nWhat do you hate about it?\r\n\r\n\r\nCaroline Strzalka (49:43.457)\r\nhate about it.\r\n\r\n\r\nNik (49:46.21)\r\nI know hate's a strong word. Not the business, like it could be the process of fundraising. could be, you know, the business, could be.\r\n\r\n\r\nCaroline Strzalka (49:46.485)\r\nWhat do I hate about this business?\r\n\r\n\r\nCaroline Strzalka (49:52.331)\r\nprocess. Yeah, it is is a very it is a very long process for fundraising. It's just us. It's a time suck. And I, I really want to get back into the business of overplay rather than just fundraising. I would I would love to have my time back. Yeah.\r\n\r\n\r\nNik (50:09.088)\r\nI do. totally agree. All right. If you have two hours in your day and there's no work responsibilities and no personal family responsibilities, what are you obsessed with right now? What what's taking up mind share?\r\n\r\n\r\nCaroline Strzalka (50:18.935)\r\nTrees. I just want to be outside. I just want to be with the trees. I just want to be outside in the sun with the trees and with nature. I know I live in New York, so it's a little bit of a hard thing to do, but I am actually going to be planting my front stoop. We have like a nice tree in an area around the tree. So I'm like, I just actually bought a ton of plants that I'm going to be planting. Planting Harlem, you know? This is like my...\r\n\r\n\r\nNik (50:44.406)\r\nAwesome. Well, you know, a tree does grow in Harlem, so.\r\n\r\n\r\nCaroline Strzalka (50:49.463)\r\nA tree does grow, actually a crazy thing. On 311, you can request a tree like anywhere if you're in the city. And I think I've planted over 300 trees in New York at this point, because I'm, yeah. So yeah.\r\n\r\n\r\nNik (51:01.42)\r\nthat's awesome. Very cool. All right. Lastly, what advice would you give to your pre entrepreneurial self?\r\n\r\n\r\nCaroline Strzalka (51:11.883)\r\nWhoo, like buckle in. mean, it's, it's blood, sweat and tears. And, and it's gonna be worthwhile, but I'm not saying it's not gonna be painful. It was, it's been one of the most rewarding, but also one of the most painful things I've ever done in my life. Like the people that you think are gonna, your friends who you think are gonna support you in this process, or even your partner.\r\n\r\n\r\nthey might not be there for you for this journey. Like they might bail. And yet strangers and other people that you meet through the community that you're trying to create might end up being your biggest advocates. And that's one of the things that I find that's most shocking in life. I just had this conversation with another startup friend yesterday. But yeah, it's like people, the people that you think are, that are gonna be in your journey with you are not necessarily the ones that\r\n\r\n\r\nare gonna join you for this. And you have to, if you decide to go down this path, it is your path and you have to take responsibility for it. it's just, it's gonna be different than you think it will be.\r\n\r\n\r\nNik (52:25.358)\r\ngonna be different than you think it will be. is true rewards have never been spoken. Well, this has been awesome. Thank you for coming on being candid sharing as much as you have. Where is the best place for people to come find you? Where's the best place for people to find download and play with overplay?\r\n\r\n\r\nCaroline Strzalka (52:27.211)\r\nYeah. Yeah.\r\n\r\n\r\nCaroline Strzalka (52:33.975)\r\nThanks Nick.\r\n\r\n\r\nCaroline Strzalka (52:40.575)\r\nOverplay, yeah. Come to overplay .com. You could download Overplay for free. It takes you right to the Android and to the iOS page. You could download the app. Try it out. Try making a game. You could also invest in Overplay if you wanted to. We still have our WeFunder open, so that's wefunder .com slash Overplay. And if you wanted to reach me, I'm at, reach me or Dan, we're at founders at overplay .com. So you can ping us with your thoughts. Yeah.\r\n\r\n\r\nNik (53:10.584)\r\nVery cool. All right, well, this has been awesome. Thank you so much for joining us. We'll talk soon.\r\n\r\n\r\nCaroline Strzalka (53:12.425)\r\nAwesome. Thanks, Nick.",
  "metadata": {
    "duration": "",
    "date": "2024-11-06",
    "platform_source": "Google Drive"
  }
}