{
  "episode_number": "242",
  "episode_title": "I Replaced My Research Team with This AI (Here's How) with Elizabeth Knopf",
  "guest_name": "Elizabeth Knopf",
  "business_name": "Anthropic",
  "transcript": "﻿Nikolas Hulewsky (00:06.225)\r\nAll right, Liz, we are going to be reviewing some of the updates that Anthropic has released in the last week. I think that if you want to, you want to unshare your screen real quick. We don't want to, we don't want to preview it too fast. The reason I'm the most excited for this is because at least for me, Claude, Anthropic has been the most intuitive with helping me sort of work through this interactive software building. I don't even know what you want to call it. Artifact building.\r\n\r\n\r\nElizabeth Knopf (00:17.649)\r\nsorry. Yeah.\r\n\r\n\r\nNikolas Hulewsky (00:36.215)\r\nthat is just really curious for me. And we've known about artifacts, but it looks like they've released some things that actually soup it up, make it a lot more powerful under the hood, right?\r\n\r\n\r\nElizabeth Knopf (00:49.558)\r\nIndeed.\r\n\r\n\r\nNikolas Hulewsky (00:50.885)\r\nSo, all right, so for those who don't know, artifacts are, for lack of a better term, anytime that you're creating something within any of these LLMs, let's say it's like, hey, create me an LOI template, or hey, create me a checklist for X, Y, and Z, or hey, create me a mock website, that is an artifact. And what Cloud does really well is it saves those artifacts. So can actually go back and look at them and reference them. However, they haven't been dynamic. And what I mean by that is they're pulling on static data.\r\n\r\n\r\nThey're not going out necessarily to the web and crawling things and then returning something. They're using static data because there was no API integration. Well, it looks like now there is some API integration that Anthropic has enabled. So it's turned these now, these now static artifacts into dynamic artifacts, kind of like webs or web web applications or even websites themselves. Is that a fair characterization?\r\n\r\n\r\nElizabeth Knopf (01:45.45)\r\nYeah, absolutely. And I would just say like, you know, it's not going to be totally obvious until you start actively using it. So a lot of the things they just rolled out, which we can run through and just overview of their blog, as well as this cool little visualization I built out using its new capabilities. But a lot of it, it's more nuanced in terms of like, you won't get it until you see the output of what you're prompting.\r\n\r\n\r\nNikolas Hulewsky (02:12.785)\r\nOkay, so with that, let's just show one of the outputs. So Liz went into Claude and she said, show me what's new with this 4.5 update within Sonnet.\r\n\r\n\r\nElizabeth Knopf (02:22.898)\r\nExactly. I asked it to demo this and then I asked it to imagine it. Oops, sorry.\r\n\r\n\r\nNikolas Hulewsky (02:29.233)\r\nYou want to show your screen?\r\n\r\n\r\nNikolas Hulewsky (02:34.437)\r\nYeah, like I had to ask you what this is. there's this new term, imagine, which is kind of the vocabulary that Anthropic wants to use for create or generate.\r\n\r\n\r\nElizabeth Knopf (02:44.318)\r\nMm-hmm. All right, so, okay, over, whoops, did I just close it? Okay, so I asked it basically to build out a way to showcase its capabilities where it would actually demo them on the fly.\r\n\r\n\r\nSo here, it sort of gives a couple of summaries as to the highlights of what it does. So number one, the benchmarks, it just keeps improving for software development. know, again, unless you're a coder, you're probably not as aware as to like that, you know, how that's improving. It actually can have computer use, which is what we demoed the other day.\r\n\r\n\r\nwhich you should check out that episode, using the extension that it has. And then also this is sort of underappreciated, but they've shown as a model can think longer, it has better outputs and responses. And so it can now focus for up to 30 hours, if not more. I've actually never been able to push it that far, but because it can...\r\n\r\n\r\nhave extended thinking beyond what it previously did, that output should be much more high quality and can handle more complex prompts and tasks versus in a lot of the interfaces like with the browser or in Cloud Code, you have to sort of iterate through tasks to make sure that they're all done. Now you can provide a more complex prompt to get more output because it can extend its thinking.\r\n\r\n\r\nNikolas Hulewsky (04:17.777)\r\nLet me give an answer for that or an example for that. So let's say you have a multi-step problem. And the first step of the problem is go out and find this data, bring it in. Great. Now, after you've found that specific data, I want you to analyze and synthesize the data. Cool, that's step two. Now, after you've analyzed and synthesized the data, I want you to measure it against whatever these benchmarks that I've set and find me XYZ criteria that I'm looking for. That's step three. In the past,\r\n\r\n\r\nElizabeth Knopf (04:22.25)\r\nMm-hmm.\r\n\r\n\r\nElizabeth Knopf (04:26.144)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (04:45.711)\r\nyou would give that prompt and it would show you step one and then there'd be mistakes in step one. And so you'd have to be like, well, I tried step one, but it started failing at this point. And it was like, I'm sorry about that. Let me fix it. And then you'd finally get past step one and you're into step two and you'd do the same thing. You'd like iterate through it. And then you finally get past step two and you get into step three. So it was like this back and forth that you would have with the AI in order to finally get to a working product with this. What I've seen is it's actually going through and it's like, okay, step one, I got to go retrieve the data.\r\n\r\n\r\nI should go to this website. let me test it out. Okay, I went to that website, I tried to pull it. it didn't exactly work the right way. And now it's like, it's testing itself and thinking through to make sure that it's not giving you this half baked answer, it's actually giving you something that works.\r\n\r\n\r\nElizabeth Knopf (05:30.294)\r\nAbsolutely, absolutely. And I think what you can even do within that, like in step one, you can say here's a success criteria. And if it meets these criteria, great on versus if not, go back to the first.\r\n\r\n\r\nNikolas Hulewsky (05:44.987)\r\nlove this thing that you've created because it shows me exactly what the new updates are. Advanced reasoning in math. So it solves complex math problems. And you can click Run a demo,\r\n\r\n\r\nElizabeth Knopf (05:54.89)\r\nMm-hmm.\r\n\r\n\r\nRight, so here we're gonna do run the math demo. So we'll do this simultaneously because as it can do is parallel tool execution. So before when you would prompt it in the browser, if it's using tools for MCP or which is more on quad.\r\n\r\n\r\nNikolas Hulewsky (06:01.287)\r\nmy\r\n\r\n\r\nElizabeth Knopf (06:13.706)\r\ndesktop versus like again these tools that you have here. It could only do one at a time and you would be able to see it do okay step one open this thing and run through and now it can actually do multiple so we can actually even quickly demo that. this is run all of these just so you see they're all okay.\r\n\r\n\r\nNikolas Hulewsky (06:22.63)\r\nYeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (06:27.739)\r\nWhat the... Okay, so go up to that first row. Go up to that first row.\r\n\r\n\r\nAlright, so run a math demo, find all the integer solutions to x squared, I can't quite see it, plus y squared equals z.\r\n\r\n\r\nElizabeth Knopf (06:41.046)\r\nYeah, X cubed and Y cubed. So I guess this was a hard math problem. I don't remember from my algebra days, but I guess that's hard, or at least for the computer. Yep, so found that solution. So math whizzes, you can go test it out. Parallel tool execution. So again, this is sort of demoing. It just used a couple different.\r\n\r\n\r\nNikolas Hulewsky (06:46.48)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (06:51.633)\r\nWhoa, and it found the solution.\r\n\r\n\r\nElizabeth Knopf (07:05.398)\r\nprocesses here for fetching, grabbing a CSV file, testing, and doing some frontend and analytics all together.\r\n\r\n\r\nNikolas Hulewsky (07:12.505)\r\nWhoa, hold on, hold on, hold on. You're just like blazing through it, because I know this is like old hat for you. The parallel tool operations, if anybody who's like tried to use AI to scrape something, create a CSV and then generate like a calculation out of that CSV.\r\n\r\n\r\nIs this saying I could I could prompt it to do like, hey, take this data, organize it in this way, find me the I don't know, three most correlated variables.\r\n\r\n\r\nlike it will go through in that step-by-step process.\r\n\r\n\r\nElizabeth Knopf (07:44.918)\r\nYeah, so I think rather than it going by step by step, it's now saying like do these three things all at once versus before again, it goes one step at a time. And sorry, let me pop over so it's better visibility. Okay. All right, there we go. You can see it better. basically, okay, so that was the same. Okay. So yeah, so basically doing all of these tasks at the same time.\r\n\r\n\r\nNikolas Hulewsky (08:14.789)\r\nWhat would you use this for? what would you, what do you use executing parallel tasks?\r\n\r\n\r\nElizabeth Knopf (08:14.91)\r\nSo it was.\r\n\r\n\r\nElizabeth Knopf (08:19.092)\r\nYeah, I mean, this is more of a time saver versus just thinking about like when you're like if you're manufacturing something you would do, you know, once like the whole Toyota way as you do from a quality standpoint with step one, step three, get the full output versus like you do a bunch of this widget, this widget, actually, sorry, let's scratch that. Mohamed, remove this from the... Okay. Okay. So basically this is more of a time efficient\r\n\r\n\r\nNikolas Hulewsky (08:42.801)\r\nMuhammad.\r\n\r\n\r\nElizabeth Knopf (08:49.056)\r\nsee thing. So rather than going step A, step B, step C, which is how again, most of these models are working where they're going one step at a time, this is to say we can do these three at the same time so that if they need to work together, they're all done and ready versus having to go do this thing, wait for them this other thing to go and then come back together. After a lot of time, this now can say we're doing these two tasks at the same time to then bring them back together. So for instance,\r\n\r\n\r\nNikolas Hulewsky (09:16.219)\r\nWhat would be, what would be, yep, sorry, go ahead.\r\n\r\n\r\nElizabeth Knopf (09:18.806)\r\nSo let's build a UI showing data analytics, but you also need to go run and capture that data and do calculations or synthesize the data. It would do those tasks separately versus now it can do basically build the UI while in the dashboards, while it's doing some functionality on the data. And rather than, again, having one and then the other, it's coming to do it simultaneously and more dynamically. So that's just one simple example.\r\n\r\n\r\nNikolas Hulewsky (09:44.997)\r\nDoes that mean in the chat, I might be able to say, hey, create me this UI. And then while it's extended thinking, creating that UI, can go into the chat and give it another prompt to say, go pull this data. That's not what it's saying. okay.\r\n\r\n\r\nElizabeth Knopf (09:50.102)\r\nMm-hmm.\r\n\r\n\r\nElizabeth Knopf (09:57.346)\r\nNo, it's working in the background. So it's basically saying, okay, here's all the list of tasks I would need to do. Now let me go and execute on those tasks simultaneously versus like you be like you still, it still stops you and it has that little stop bar when you prompt it. So you can't yeah, do that unfortunately. but it's, it's more working. lot of these updates are more under the hood and less obvious to the user until you sort of see that it is just faster.\r\n\r\n\r\nNikolas Hulewsky (10:20.273)\r\nMm-hmm.\r\n\r\n\r\nElizabeth Knopf (10:24.51)\r\nmore comprehensive and higher quality outputs.\r\n\r\n\r\nNikolas Hulewsky (10:28.643)\r\nWell, let's maybe let's give. Do you want to show any of these or should we? Should we go to the washroom?\r\n\r\n\r\nElizabeth Knopf (10:34.512)\r\nyeah, so then we mentioned the long task planning. So that's again, just extended thinking. we mentioned the, computer use great code, autonomous agents. so this again is a little bit more, less obvious where you can say like build an agent to do things. This I think is more obvious in cod code. but again, it has more agentic capability in terms of how it is running.\r\n\r\n\r\nthe LLM. it's actually, again, going out and getting data, searching more websites, and doing more of that functionality where it's just less obvious. And then again, if you're into specific like law, medicine, and STEM, apparently it's better. And then it's a little bit less sycophantic and deceptive. So they're correcting some of its personality. And then file creation, which we demoed earlier this week. So those are really the four\r\n\r\n\r\nNikolas Hulewsky (11:30.885)\r\nYeah.\r\n\r\n\r\nElizabeth Knopf (11:32.713)\r\nupdates for it.\r\n\r\n\r\nLet's go over to actually let me just quickly show because I think the extent of this is gonna be more obvious So previously for deep research you or you would have to use deep research to get a really comprehensive Output so I prompted it to take Nick and his good friend Chris corner his channel corner office since they have a fun friendship To basically analyze the two and provide just a strategy\r\n\r\n\r\ncompare them, create a formatted output, and to go also check out other viral channels and incorporate those recommendations. So this is not deep research, this is just Sonnet 4.5, and it created this, you know, this is like pages and pages content pillar strategy, distribution strengths, weaknesses, channel profile, see how this is just like super, super comprehensive, it just keeps going.\r\n\r\n\r\nand going and going. So I'm just gonna keep scrolling until we get to the end, but essentially like it's created this really good comprehensive plan that before you would maybe get a fraction of this as an output and you'd have to sort of iterate through. And this again went out and did the research and used its agentic capability.\r\n\r\n\r\nNikolas Hulewsky (12:53.647)\r\nSo I feel like perplexity, people used to use perplexity for a lot of this, like the deep research. This looks, I mean, you're still scrolling. This looks insane.\r\n\r\n\r\nElizabeth Knopf (13:00.639)\r\nYeah, I mean.\r\n\r\n\r\nElizabeth Knopf (13:04.488)\r\nYeah, I just finished. Yeah, like I actually should see, let me download it and we'll see how long this this is an MD.\r\n\r\n\r\nNikolas Hulewsky (13:11.929)\r\nIs it now is it is it something like where you have to select deep research or is it is it kind of deciding based on the prompt and the ask how much time it should it should give to extended thinking.\r\n\r\n\r\nElizabeth Knopf (13:23.498)\r\nSo I gave it, I told it to work for a certain amount of time. It didn't necessarily work for that amount of time. So I think it just depends on like how complex the ask is for that. So I just, let me just open up here. I downloaded, let's see how in a PDF format.\r\n\r\n\r\nElizabeth Knopf (13:45.174)\r\ncan't see how long that ended up being. So that ended up being 22 pages. So it just produced and so, share so you can see the screen.\r\n\r\n\r\nNikolas Hulewsky (13:51.596)\r\nmy gosh.\r\n\r\n\r\nNikolas Hulewsky (13:58.033)\r\nI mean, I haven't read through it, but I'm also assuming it's not the typical AI slop. Like it's not 22 pages of Chat GPT 3.5. It's, yeah, real analysis.\r\n\r\n\r\nElizabeth Knopf (14:07.902)\r\nRight, exactly. Like, I mean, this is definitely like bullet points, but it pulls out example episodes. Before, know, it could get these wrong, or again, this whole hallucination problem, I feel like is not quite solved, but it has been mitigated dramatically because it's actually able to go do the work. So...\r\n\r\n\r\nNikolas Hulewsky (14:21.659)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (14:30.982)\r\nWow.\r\n\r\n\r\nElizabeth Knopf (14:32.118)\r\nYeah, so like my first this actually nailed it competitive landscape like you guys are catering to specific audience this this totally I will I will I'll send it to you\r\n\r\n\r\nNikolas Hulewsky (14:38.245)\r\nYou got to send this to me. need this. is it. Dude, is going to start your own research firm.\r\n\r\n\r\nElizabeth Knopf (14:45.503)\r\nI mean...\r\n\r\n\r\nNikolas Hulewsky (14:47.131)\r\nThis is incredible for like a lot of that entry level research and analysis.\r\n\r\n\r\nElizabeth Knopf (14:48.15)\r\nYeah.\r\n\r\n\r\nlook, you got a head to head comparison so you can duke it out with your bud.\r\n\r\n\r\nNikolas Hulewsky (14:58.417)\r\nI wonder, I, could I also upload data sets and have it look more thoroughly than it has in the past? Like usually when I get, when I have data sets, I have to give it explicit instructions of, look at it like this or normalize for this data or tell me what, where the statistics, significant statistical significance is, which variables are correlated, which ones are not. Will it do that on its own now?\r\n\r\n\r\nElizabeth Knopf (15:01.046)\r\nYou\r\n\r\n\r\nElizabeth Knopf (15:28.118)\r\nI would imagine so. haven't prompted it yet, but I would say like high probability yes, because again, it is thinking things through.\r\n\r\n\r\nNikolas Hulewsky (15:30.321)\r\nI gotta try it.\r\n\r\n\r\nElizabeth Knopf (15:38.75)\r\nbefore it does it to identify what's important and what it thinks you're gonna want. So my guess is yes. And again, like I was able to download that into a PDF. You can download it into other file formats. So you could do like a really deep analysis for like an investor pitch deck or a product demo deck or whatever kind of PowerPoint you need. Like you can actually sort of get that full workflow within the browser now from, you know,\r\n\r\n\r\nNikolas Hulewsky (15:41.937)\r\nMm-hmm.\r\n\r\n\r\nElizabeth Knopf (16:08.664)\r\ngetting the content framework, the look and feel, all of that within the browser, which in my mind is just like mind blowing. We're here, you know, where we're at. Like if you think about a year ago, you could not do any of that.\r\n\r\n\r\nNikolas Hulewsky (16:23.377)\r\nHow do you think about getting the most out of this technology? I think of it as a fighter jet. could fly it, huh? Yeah, so like there's so much technology in it, but a fighter pilot is going to be the one who actually knows how to use it. If you put me in the cockpit of a fighter jet, don't know what buttons I'm supposed to push. don't know how to fly the thing and whatever. So like I see stuff like this where\r\n\r\n\r\nElizabeth Knopf (16:32.381)\r\nMm-hmm. oops.\r\n\r\n\r\nYeah, yeah, I agree with you.\r\n\r\n\r\nNikolas Hulewsky (16:53.455)\r\nI can spit out hundreds of pages of analysis, but the stuff that you just said was like, yeah, now you can do this framework and have this comparative analysis. It's almost like, how do I even get up to that speed? Does that make sense?\r\n\r\n\r\nElizabeth Knopf (17:04.918)\r\nYeah. Yeah. So I guess, you know, part of this is one, like I'm using, you know, a lot of my business chops from 20, 20 years of working. it was like all this, the, the, my, my old rules and things I've wanted to automate. So that's, know, that piece of it, but if you're, you know, just starting out or, know, you don't have maybe that kind of experience, um, or just to make it more relevant in your day to day.\r\n\r\n\r\nNumber one, you've got the best mentor and teacher available, which is Claude itself. So if you don't know what to do, literally just ask it, say like, I want to achieve this outcome and always do the outcome rather than say like what you think the process is. You can say the process and get feedback on it too. But if you just say like, I want to achieve this goal, what do you recommend? Give me a couple different options. So that's number one. And as you're going, like again, ask for feedback and say like, I heard\r\n\r\n\r\non it 4.5 just came out.\r\n\r\n\r\nhow can I use this? Give me ideas. Here's what I'm doing. Give it the context. And again, you can use projects to give the context of like your life of everything going on in your life, whether it's personal, your business stuff, your health, your finances. You can again, create cloud projects to put stuff in each of those places. And then you have that context. And as the new functionality comes out, you can just reference those over and over again. Or better yet, you go to Google Drive, create a folder, and then you can always\r\n\r\n\r\nupdate things and reference them within the projects.\r\n\r\n\r\nNikolas Hulewsky (18:36.635)\r\nHow frequently do you update reference documents and context documents?\r\n\r\n\r\nElizabeth Knopf (18:41.16)\r\nYeah. So I have certain workflows that are, would say somewhat consistent. So for instance, if I'm, trying to write viral scripts or, posts or context, like I have certain frameworks that I probably should update more. but I have both like automation workflows. And then I have just like prod project prod, cloud projects that always like, like the principles are always the same, like.\r\n\r\n\r\nHere's how you do storytelling like that's not gonna change so I have static information there and then I was like new Themes or trends that's sort of what I'm updating. So it's a mix of like where there's dynamic things that are changing and where there's not so yeah\r\n\r\n\r\nNikolas Hulewsky (19:24.241)\r\nDo you like create time for yourself and your schedule to say, all right, I'm going to go update you do.\r\n\r\n\r\nElizabeth Knopf (19:28.276)\r\nYeah. Yeah. Yeah. So I have like, so just to give context on people are like, you know, what do you do or whatever? So they understand sort of my schedule. I, I right now just like, like I do trading, I manage my own money doing trading. So I have some time for that. have time for\r\n\r\n\r\nAt some point I'll reintegrate content, I have just sort of that's gone to the wayside, but that'll probably be like an hour a day. So trading is about an hour a day, content is about an hour a day. And then I'm working on doing some acquisitions, which is the rest of my day. And then from like an AI, AI is like, I'm always using it. And so then if I'm like, okay, I need to build a project or I want to update any of my SOPs and stuff, I have sort of like\r\n\r\n\r\nOne day a week where I have a couple hours and that's usually late evening, because then I have like family time and kids and pick up and I'm a mom, so deal with that. So late evenings is usually when I do sort of my work on updating my cloud stuff, I'm building out cloud code stuff, or I have frameworks. So have like a Friday, well actually not Friday, Thursday night that I do like framework updates.\r\n\r\n\r\nMondays I sort of have like a check-in of like what's been going on and I've even started building out like the Elon agent of What did I get done this week where it literally goes into? Yeah, it goes into cloud code and it just basically logs everything and gives me a summary of like what did I do this week? And you could do that and have it like go even towards like other Applications and sort of like check out everything you're doing There's a software tool called rescue time which you could use too, but you could build out your own agent to do that as well so I have sort of like\r\n\r\n\r\nNikolas Hulewsky (20:49.222)\r\nReally?\r\n\r\n\r\nElizabeth Knopf (21:09.688)\r\ngeneral frameworks and personal systems that I'm really trying to nail that I have like a couple hours every weekend I'm on and then my fun projects that I'm doing a couple hours every night and then the rest of my day is you know just normal work stuff but I'm always using\r\n\r\n\r\nNikolas Hulewsky (21:24.273)\r\nHow do you think about the AI management in different buckets? For example, when I think about managing a business, I'm like, okay, there's five pillars to managing my business. There's finance, there's operations, there's product or quality, there are people, and then there's marketing, sales and marketing. Those are like my five pillars in any business. Do you think about managing your AI?\r\n\r\n\r\nIt's not even a tech stack. It's more of like a AI brain.\r\n\r\n\r\nElizabeth Knopf (21:54.634)\r\nYeah. Yeah.\r\n\r\n\r\nSo this is like I've actually been thinking a lot about this and I don't have a good answer and ask me in a month and maybe I'll have a better answer because as I've been trying to think of my like my operating system I've been putting a lot of thought into like what does that look like for my life where I can use AI across the board from you know not my business stuff so I have like the business pillars which are similar to what you would say for normal business pillars and then I have just other slices of my life so managing my kids\r\n\r\n\r\nschedule and everything there, managing my finances and everything there. And I would say my health, but that's nonexistent right now. So, but like that, you know, that should be a slice too. So, you know, I would say those are sort of like the big buckets, but I, and are like maybe pillars. And then under those, would be sub pillars in their own sort of sub operating systems. Is that what you're going for? You're more thinking of like, okay.\r\n\r\n\r\nNikolas Hulewsky (22:54.289)\r\nKind of, kind of, I'm more curious around like, okay, this is, I have a frameworks bucket, I have a prompts bucket, I have a context documents bucket. And it's like, in order to have that brain, the AI brain, it's gotta have specific pieces to it. And I'm just trying to think through like, what are the specific pieces?\r\n\r\n\r\nElizabeth Knopf (23:02.887)\r\nyeah,\r\n\r\n\r\nYes. Yes.\r\n\r\n\r\nElizabeth Knopf (23:12.81)\r\nYeah, yep, that's great. Okay, so yes is the answer to that one. Okay, so I do, and this is going back to how I've been building the architecture for my personal operating system because for instance, I've collected all these hooks, I've collected all these content frameworks or just like business frameworks and I'm like, I don't wanna keep putting them into every file folder.\r\n\r\n\r\nSo I sort of have prompts that I use and I have just like a document that I've been using. I would say I probably could get that better. I've used tools in the past, like there's this really cool tool called, I don't know if you're gonna be able to see my, yeah, you can't see my extensions, but Text Blaze has been keeping a lot of my prompts for the time peeing and at some point I'm probably gonna export them. And then I also just have just a little Google Sheet.\r\n\r\n\r\nof prompts I like. And I had built out a little automation tool that I basically have prompts I use that then can be saved into that Google Sheet. So that's like one thing that you could also build out in Cloud Code as an agent for prompts that you like, where you can easily from your interface or your Cloud or ChatGPT or whichever tool have it be.\r\n\r\n\r\nInputted into just a master repository. So that's so having a library, but if you want to just keep it simple just like Google spreadsheet then number two I am building out an agent system where I have like a master orchestration where it's basically the general rules of everything and this is I it's sort of like project management plus some other stuff because they're not everything thinks it's project management bucket But right now when I'm working on a new project or in building out something\r\n\r\n\r\nnew, there's like very similar things it's going to reference, or again there's like templates, and then there's like content repositories. So I have the prompt library, then I have like content frameworks and templates, and within that I have like a subfolder of hooks.\r\n\r\n\r\nNikolas Hulewsky (25:14.053)\r\nWhat's a content like that you're putting out?\r\n\r\n\r\nElizabeth Knopf (25:17.974)\r\nNo, so I actually haven't, I don't have enough content or good stuff that I'm like, this is my stuff. I did train it on my voice though. So I do have like my voice document where I had, I uploaded a bunch of my content and then said like, what's my voice so that AI could replicate my voice for AI generated.\r\n\r\n\r\ncontent. I have like my own personal voice documents and then I have like frameworks or people that I like to follow who I want to replicate. So I have like their scripts and sometimes it's like I like the framework in which they laid out a video or the way they built this and so I'll either capture their voice as well. I'll capture the framework they built out.\r\n\r\n\r\nor just some of the ideas from that video. So that's sort of similar to the content Cloud code thing I built. So I'm basically trying to get that to be accessible and not interfacing itself. But right now it's just literally a file of like stuff I've collected and curated where it's the content and stuff I like. So again, it's ideas, frameworks, and then my stuff, my voice.\r\n\r\n\r\nYeah, in there.\r\n\r\n\r\nNikolas Hulewsky (26:34.779)\r\nWell, because like, I've been thinking a lot about this as well. Like you're basically building out your second brain. It's your, it's your AI second brain. And in order for the second brain to be functional, like it's got to understand how you think, which is one component. How does Nick or how does Liz think about certain things? How do they make decisions? How do they approach problems? and then it's also got to have context. Cause it's one thing to just, does Nick think about things?\r\n\r\n\r\nIt's another thing to know what's currently happening because one without the others, knowing how to think without context just is not, is not great. and so I just think about like, do you, how do you manage both of those staying current? Right? You got to have data aggregation. You got to make sure, okay, my, my zooms are recorded and it's got to go into my emails to know what's going on there. And I don't know. I'm just trying to think through.\r\n\r\n\r\nElizabeth Knopf (27:05.866)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (27:31.759)\r\nHas anybody figured that out? Like, have you figured out a good way to have it?\r\n\r\n\r\nElizabeth Knopf (27:34.088)\r\nSo, yeah, so, okay, so going back to sort of the system and the framework I was building, so we'll take content as an example, and I can explain sort of the automation piece of it too, which I think there's an component you're referencing. So, in addition to, so I have like content stuff, have...\r\n\r\n\r\nthe prompts library and then those are just like resources which I things that the agents can reference now the agents is where the action is actually happening so that's actually where the decision-making like you were talking about comes in because every time you build something in cloud code or again in your project where you put instructions or even in the prompt you're giving specific instructions which again is that how do I make decisions and so you could easily provide\r\n\r\n\r\ninputs or examples or history that you've already done for the AI to extrapolate those decisions or you can be explicit and just say here are the rules I have for this specific bucket of things. It could be so specific or it could be super broad and then say whenever you do these actions reference this, you know, decision matrix or whatever rules you give it. And so that's the beauty of having agents where it can go and say here's the rules I have.\r\n\r\n\r\nAnd you can basically, again, make these super narrow. And there's a number of different ways to do that in Cloud Code. And then go execute this task that I'm giving you by building out this agent. And so it's actually doing the work from the content and context that you've given it.\r\n\r\n\r\nNikolas Hulewsky (29:09.165)\r\nAnd like those ones, building out the decision making, how are you updating those often? Are you like going at the end of the day and each one of your chats and saying, please write me a context document.\r\n\r\n\r\nElizabeth Knopf (29:21.44)\r\nSo, no. Okay, so, no. I wouldn't say like my decision making or those rules are being updated that dynamically. Right now I'm in the process of building stuff out for like a system, like a trading plan first. Like that's sort of my latest thing I'm right now trying to systematize. So that I'm more iterative, but at some point I'll probably stop that.\r\n\r\n\r\nuntil I get inputs that are changing within the market that make those rules or that system less relevant or it's not getting the returns I want. So that I anticipate like basically building some out and then having like checkpoints because even just thinking back\r\n\r\n\r\nhow I generally operate in terms of like decision frameworks and all of that from like a business standpoint. You know, don't do that too regularly because if you don't have some level of consistency of that decision making, you're not seeing the, you can't measure it perfectly, I guess, across time. So that's sort of the way I think like I'm not gonna be constantly giving it new feedback until I have like a specific checkpoint, which.\r\n\r\n\r\nI often sort of manage myself in what's called agile, which is like a two week chunk. so I have what I'm doing, my deep work for that two weeks or like a system, you know, my couple hours blocks for each of those things. And then my deep work and the tasks, and then every two weeks sort of check in and say, okay, here's the feedback. Is there anything I can incorporate now? I'm not good at that right now from updating my decision matrix, because I've been more focused on a bunch of other things. I don't know if that.\r\n\r\n\r\nNikolas Hulewsky (30:56.997)\r\nWell, I can't wait until you figure this out so you can tell me how to do it.\r\n\r\n\r\nElizabeth Knopf (30:59.262)\r\nOkay. Okay. So now you've given me something I'm going to figure out. Cause like I'd started, yeah. Started my project management system and have like just been more execution mode, but I'll, I'll try to get this into decision-making.\r\n\r\n\r\nNikolas Hulewsky (31:09.221)\r\nThere's just so much. It's like, my emails, meetings that I've recorded, and then just the way that I generally think about things, like, what is the best way for me to create that second brain that gives me a lot? And then even once I've created it, what do I actually use that second brain for? It's a lot. Anyways, I gotta run. yeah, yeah, yeah.\r\n\r\n\r\nElizabeth Knopf (31:29.418)\r\nWell, other point, which I think you've sort of nailed is this is why, and next week I want to talk about this because this is super important, like the AI adoption curve. In organizations, it has not happened yet. People are still playing in single player mode because of what you just said, because of that operating system within a business and how do you utilize AI and build out your operating system?\r\n\r\n\r\nwithin a company. So if you're having a hard time doing it individually, think about it at scale for enterprises. Small businesses have more advantage of that. And so, yeah, let's try to solve for that over next couple of weeks.\r\n\r\n\r\nNikolas Hulewsky (32:06.033)\r\nLet's do it. I love it. Okay. I'll hit stop.",
  "metadata": {
    "duration": "",
    "date": "2025-10-10",
    "platform_source": "Google Drive"
  }
}