{
  "episode_number": "40",
  "episode_title": "Working on $100 Billion Government Projects with Alan Pentz",
  "guest_name": "Alan Pentz",
  "business_name": "Professional Services Consulting Firm",
  "transcript": "﻿You're setting up the systems process infrastructure for a hundred billion dollar projects. Yeah. Jeez Louise. \r\n\r\n\r\nNewsflash: the federal government spends a lot of money. Now, you might know that the federal government is 34 trillion in debt, but you know how much money they spend a year this year, they're going to spend 6. 9 trillion. That's almost as much as the top 50 largest companies in the United States generate in revenue a year.\r\n\r\n\r\nAnd while Congress appropriates funds to individual governmental agencies, Who decides the budgeting process, who decides which department sub department sub sub department get what types of funds? Well, the answer is government contractors. And in today's episode, we dive into what a contractor does, how they win contracts and how they make so much money off of governmental bloat.\r\n\r\n\r\nWelcome to another episode of Nickonomics. My name is Nick Kaluski, and this is the show for entrepreneurs and watchpreneurs who are curious to learn how other businesses work. I've owned and operated more than a dozen businesses, and I've generated more than 30 million a year in revenue, employing more than 300 people.\r\n\r\n\r\nI recently sat down with Alan Pence. He's the owner of a professional services consulting firm that works exclusively with the federal government. And I'm obsessed with just one question. What can I do to get access to those sweet, sweet government contracts so that I too can generate $35 million a year in revenue and $6 million a year in ebitda, just like Alan?\r\n\r\n\r\nWell, let's find out together. Okay guys, we're gonna get back to the show in just one second, but first, a message from a sponsor. Who is, uh, me? Oh, it's me 'cause I'm doing the show for free. Listen, I wanna give you a hundred dollars. All you have to do is this, go to Apple or Spotify.  Give me five stars, write a review, screenshot that review, send it to me, Nick at cofounders.\r\n\r\n\r\ncom and you will be entered to win a hundred dollar Amazon gift card every four episodes. I am going to choose a winner at random and I'm going to do this five times, 500 for five stars. I just made that up. It's what I'm calling it. Please go to Apple or Spotify, leave a review, screenshot it, send it to me, Nick at cofounders.\r\n\r\n\r\ncom and you'll be entered to win a hundred dollar Amazon gift card. All right, let's get back to the show.  All right, Alan.  Welcome to Nicknomics, man. Stoked to have you. Yeah. It's awesome to be here. I appreciate it. I know I've been on your pod a couple of times and I'm stoked to have you on mine now.  I know.\r\n\r\n\r\nIt's like a little exchange program we've got going on.  It's called a quid pro quo,  which is a good setup for your business  since you work with the government. Tell us briefly. What your business is and how you make money.  Yeah. So most people, even after I tell them what my business does, they're like, so what does it do?\r\n\r\n\r\nI don't really get it. So, so our exclusive customers are within the federal government and we're professional services, consulting firms. So we're like, you know, Accenture or Deloitte or these consulting firms and the government contracts out. A lot of the implementation of programs. So we happen to do a lot of work with grants and like something, you know, like, if you heard about the chips program, where the government's trying to get money out for semiconductor manufacturing and research, trying to onshore some of that.\r\n\r\n\r\nThat's the kind of program we would help the government set up and run. There's a bunch of. You know, stuff they have to go through, like environmental reviews, compliance reviews, they have to put out certain kinds of notices and administer the whole, you know, billions of dollars are administering. So there's a ton of work around that.\r\n\r\n\r\nSo, so we kind of do that kind of stuff for the government. So maybe you'll get to. The point where you're like, I can't disclose that, which would be amazing. That'd be an amazing clip, but tell me, what does that mean exactly? So if I'm a government agency and I'm trying to find money for the chip sack or whatever,  why would I call you?\r\n\r\n\r\nYou're coming in to manage the project. You're, you're coming in to manage an aspect of the project. You're like, What exactly is your team coming in and doing usually pretty, pretty soup to nuts because the government, well, Congress will allocate these projects to different departments and a lot of times, like the department will have, like, I don't know, 15 lawyers who do policy work and they're like, Oh, we have to administer a 50 billion grant program.\r\n\r\n\r\nWe don't know how to do that. Right. So there's a lot of that kind of stuff. Also, you know, government has trouble hiring. There's a lot of difficulty in hiring. So they outsource a lot more than maybe you would think. Let's just take a project. Let's say that the FDA gets allocated funds from Congress to operation warp speed.\r\n\r\n\r\nRight. Right. Implement operation warp speed.  Why would I call your company? Why would I call Alan? I'm like, Hey, Alan, we've got 3. 5 billion.  What exactly are you doing for them? What are they calling you in for?  So, like, the 1st thing we would do is the 1st thing that they would try to look at an FDA might be a worse example in the sense that they do grants all the time.\r\n\r\n\r\nSo they probably have more, they have more infrastructure set up than other agencies, but. You know, there are dozens of agencies, right? So basically, they would call you in and say, Hey, look, we need to implement this program. So there's like, program set up. There's like, a whole bunch of stuff around getting the notice of funding opportunity out.\r\n\r\n\r\nThere's a bunch of regulations that you have to comply with when you do that, put it in the federal register. You have to advertise the program depending. Now, warp speed is a little different because there's this thing called Barta that as a committee of Uh, with a lot of the companies involved that were already set up.\r\n\r\n\r\nSo they sent it to an existing thing that was already operating. But say like with chips, there is no like council of people set up with industry and the government to talk about what needs to be done. So you'd help, maybe you'd set up like a council like that. And a lot of cases that's highly regulated, right?\r\n\r\n\r\nThere's a bunch of regulations about who the government can talk to and in what manner with, uh, industry. So you have to set up these, uh, very. Like, open compliant process committees and run them in a specific way. So we'd help them do that. Then when you get the paperwork has to go out to have people apply, and then it's got to be reviewed by grant reviewers.\r\n\r\n\r\nAnd so a lot of times we'll organize all those people. So you got technical experts and they have to go out and find them, bring them in. They sit down and look at everything. You got to do metrics and reporting on where the money's going, all that kind of stuff. Is it mainly grants that you are helping them administer  for us?\r\n\r\n\r\nWe happen to do a lot of grants, but like we do some work, say like IRS, where we're like helping them with business process reengineering and their call center. Like that might be, it's kind of general management consulting work that you might hire a consultant, you know, like, but why would a big company hire Accenture, right?\r\n\r\n\r\nLet me try and regurgitate it in my kindergarten brain, a government agency gets awarded money from Congress. They get allocated funds. It could be a grant, or it could just be for a new program and instead of just contacting any old management consulting company to help them build the infrastructure necessary in order to distribute those funds that have been allocated by Congress, an example of this might be.\r\n\r\n\r\nThe PPP loans that were administered through the SBA, right? Like that was something that they were the best suited government agency for it, but they didn't have a PPP program. So in order to get all that stuff set up,  they need to reach out to a management consulting company.  That not only has experience building these types of programs, but has experience with the government, because there are government regulations that are also required.\r\n\r\n\r\nThey need to have sounds like an advisory board. They need to meet certain regulatory requirements from a reporting perspective, not only on the creation, but also in the. Implementation and distribution of those funds, like you were saying, if you need to review grants, or if you need to have a process for reviewing use of funds by local agencies, then you're also setting up those things.\r\n\r\n\r\nIs that essentially what that means? It's like, yeah, exactly. And we'd be going out and like, helping say it's a state, right? We would go out and tell the state. Here's what's coming. And then we might actually help them go through and figure out how to file their application. Because they don't have resources and understand how to do that.\r\n\r\n\r\nAnd the requirements can be incredibly complex from the government. But what's the size and scope of some of these programs that you've helped? Yeah. The government rollout.  Oh, yeah, they're massive. So, you know, just from the amount of money that's going out, it's, you know, like we do some stuff with broadband that it's a bunch of different programs.\r\n\r\n\r\nSo like, and it was obviously accelerated. During the pandemic, when we had like the IRA, the bill legislation, the, you know, the cares act, all that kind of stuff. So, I mean, you're talking a hundred billion dollars going out for something like that. You're setting up the systems process infrastructure for a hundred billion dollar projects.\r\n\r\n\r\nYeah.  Geez Louise. And well, there are multiple projects within that, but yes, you know, stuff like that over time. CHIPS is  54 billion. Um, quite a lot. They're huge programs. Yeah. You said the FDA is a little bit of a different example because they actually have infrastructure  to administer these funds. Is there something like, does the government require these agencies to use outsourced or outside  consulting, or is it just because it's not their expertise?\r\n\r\n\r\nSo why spin up a whole new part of their department?  Right, right. I mean, at the, you know, FDA has contractors doing stuff, but they're probably more working within an existing system, so they might bring in a contractor to build out a sales force implementation to manage contacts. Through, you know, like what money we gave to these people and they want to put that into a system.\r\n\r\n\r\nAnd so they might have a specific contract for that specific contract for this for metrics or something like that, or for like improving their grant system, that kind of stuff. How did you get into this? Yeah. So I, I worked in the industry, right? So I was,  I like my, originally when I came out of college, I worked on Capitol Hill.\r\n\r\n\r\nYou were like a legislative aid. Yeah. It was a legislative aid. And then I did some press for a guy from Montana named Max Baucus before he's old back in the early two thousands. Yeah. So I did that. It was really fun. That's like very political though. Right. Congress is totally different than administration.\r\n\r\n\r\nAnd then I went to business school at UT Austin. And I had the privilege of graduating during the worst MBA recession, like the tech recession of 2002. So there were no fricking jobs, man. I was like, and I was this weird dude who'd like work on Capitol Hill. So, you know, the first guy they're going to hire in limited circumstances, not going to be me.\r\n\r\n\r\nI had to crawl back up here to DC and this is pre post 9, 11, pre Iraq war. So the government was pumping. Um, Tons of money out in the terrorism campaign and D is setting up DHS and all that kind of stuff. So really the only thing hiring was a gov comms. So I ended up working in a company for four years, kind of learning the business and then my company got bought.\r\n\r\n\r\nWas it a similar business?  Yeah. Very similar kind of work. Yeah. They got bought by a company that's now part of  GDIT, which is general dynamics, IT division. So anyway, they got, and they went through like four acquisitions, but anyway, I had a client and I had a non compete, you know, kind of thing or a non solicitation, but I had a client move agencies, which invalidated that a former client.\r\n\r\n\r\nAnd so I'd been working for another company and I was just like, Hey, do you need someone to help you with like running the program? He's like, yep. Yep. So I jumped out with a partner when you say client, you're saying that's like a government agency. Yeah, like a program manager, managing a program within a government agency.\r\n\r\n\r\nSo we were working on interoperable communications for public safety. So please fire EMS. So there's a bunch of problems with that. And so it was just me and a partner. We both had a client of our own each. I'm like, we were just billing our time. And so for our first four or five years, we were just consultants that happened to own the company, right?\r\n\r\n\r\nWe were basically W2s  and we had no, I didn't know I was 90 percent 85, 90 percent billable. I didn't even know how to get in our bank account. Like we had some one back office. Yeah. We had like one back office person who was doing that stuff. And I remember one day I was like, how much money do we have in the bank?\r\n\r\n\r\nAnd I was like, I realized I didn't even know how to get into it.  So not, not maybe the hands weren't really on the control board, you know, You said government agency managers are like program managers.  Are they appointed? Are they elected? How are they put into these positions? So almost all like, basically it depends on the agency, but almost their federal civilian workforce.\r\n\r\n\r\nSo they're part of, you know, they're protected under various pieces of legislation, so they're part of the bureaucracy, they're not appointed.  They're federal employees,  federal employees. They're the deep state.  They're the deep state. I call the deep state people who show up for work on Monday at eight o'clock, you know, that's the deep state. \r\n\r\n\r\nThere's people that keep doing their jobs. Right. Yeah. Yeah. Administration to administration. They're there. How big a programs do like they typically manage? I mean, I know it can be like really broad, but Yeah. I mean, some people have like a million bucks. Some people have 10 billion. It's all over the map.\r\n\r\n\r\nThey have discretion to basically say, okay, yeah. So like Congress, well, and it really depends on is it, was it legislated? Was it executive order? What blah, blah, blah, blah, blah. There's all these different authorities. Like some of the work I did early on, which is gathering all the authorities that one of the programs I worked for had.\r\n\r\n\r\nLike they didn't even, you know, there had been like legislation, there'd been an executive order. There'd been like various other like interagency things. And so like, they didn't even know all the scope of what they had. They had to like gather it all together because it's just so confusing. Like, you know. \r\n\r\n\r\nAnd then you go down to Congress and they're giving you a shit for like, this is so complicated. And it's like, you wrote it. Like, what are you talking about?  So it's everybody, you know, it's just the whole, you know, it's a system. It works in a way, but it's a very complicated look. If you have three centers of power and there's more than that, even within an agency, right.\r\n\r\n\r\nYou talk about federal bureaucracy versus the appointees versus like the white house. Versus that's part of the White House supposedly, and then you got Congress and it's like, and then you got the Supreme Court. I mean, it's just like a mess. Like, everybody's fighting each other to, you know, try to figure stuff out.\r\n\r\n\r\nSo the best part, though, is like, if you're in places like I was, like, public safety communications, pretty bipartisan. Not really the highest priority for the administration. So it just keeps like going right. They just do their stuff. Part of the beauty of the bureaucracy in Washington of the federal government is that it does take a long time to get anything done.\r\n\r\n\r\nYou know, that, and that was the theory behind the checks and balances of Congress.  The executive branch and the Supreme court,  but the downside of that is there's a lot of bloat, a lot of waste  because it does take so much time. And because it is so convoluted, it's very easy  to,  you know, not assign oversight or understand necessarily who's in charge of something said funds mysteriously.\r\n\r\n\r\nDisappear many times, not sure they disappear, but anyway, they do disappear from the public ledger, but they do go into somebody else's pocket.  I'm not quite sure how true that is. But I would, I push a little bit on that. I think a lot of stuff I would say, actually, my contention is the federal government is to account. \r\n\r\n\r\nSo there's too many checks and too many things. So it's so accountable that it actually doesn't, it's not accountable to the end result. It's all accountable. Did you follow this procedure? Did you do this? Did you do that? Of course, they're isolated instances of corruption, but way, I would say way less than in a private company.\r\n\r\n\r\nWay less because there's so many incentives and people looking at it when they go in and audit the Department of Defense and there's a trillion dollars. Missing on the balance sheet. It doesn't match to you. That's like,  what is that?  Well, that doesn't mean it's missing. It means that they can't get their systems to work and get all the information in to talk to each other because it's such a massive system.\r\n\r\n\r\nSo granted it's messed up, but that doesn't mean that somebody like walked off with the money. That would be, it's just like system, different systems, right? You know, they've got systems from like 1950. They're working with, right? Yeah. We're using different words for inefficiency, basically. Okay. Right.\r\n\r\n\r\nThere we go. When did this start? When did you and your partner go off to start your own? It was in the end of a seven. So I've been on it for a while. What does the background checks look like for this? Do you get vetted once? And then all of a sudden it's like, we're an approved government contractor. We can work with any agency or does every agency have their own  process for vetting vendors?\r\n\r\n\r\nIt's all, it's all mixed. So like you can go sub in to almost any contract, right? And there, you know, there are things like security clearances, like you might have to have a security clearance for certain kinds of work and that's a totally different process, a contract with a company like mine or Booz Allen or somebody, because you have some expertise and they can sub you in right as a company on their contract.\r\n\r\n\r\nSo basically what you start out subbing, that's the way I started. You know, you're going through another company to work for the government, and this is a, you know, going into government contracting is a long term play, right? It's a compounding play, and it takes a long time. And the government, because the government wants doesn't it's so difficult for them to contract. \r\n\r\n\r\nThere's so many regulations. There's that you can protest.  The award of stuff. And that can go into courts. It took the DOD like years to award their cloud contract because Oracle and Microsoft are suing each other and suing the government when you're saying the government,  are you talking about this individual agency or are you talking about like, okay, so you're not like, Oh,  Congress, the Senate, the White house, you're talking about this individual. \r\n\r\n\r\nSo, so what happens is agencies have their own contract. Mechanisms and then there is, you know, the general services administration builds what they call G wax government wide acquisition contracts, I think, and those are big contracts that you can use across multiple agencies. So there are things like, once you, but the deal is, you've got to be really experienced to get on those, those ones, right?\r\n\r\n\r\nSo you start out something to someone else  and everyone teams, like I said, because it's so difficult for the government. To do individual contracts that they want to mash a bunch of stuff together and competed for 3 to 5 years. So they don't have to deal with it.  So they'd much rather. That's good for you.\r\n\r\n\r\nRight? That's good for a business.  Well, it's good for if you can get access. Right? So we want a prime contractor to manage all that complexity underneath. And if they want to sub, they can just go through that prime. Right?  Okay. Yeah, so it's basically like you have this prime and they might have multiple subs to do the work.\r\n\r\n\r\nAnd basically what happens is you start as a sub, you got to get a year of experiences that, and then you got to talk some client into putting you on as a prime. And usually you have to start with these really low end vehicles that most people can get on. They're kind of a rolling admission vehicle called the professional services schedule for my part of it.\r\n\r\n\r\nAnd then. You know, maybe you got a prime, right? And then you got to get at least a year of experience. And now you have prime past performance,  and that's a lot more valuable. And then you just kind of build and you have to get, like, more size of contract more complexity. And then as you build those kind of things, you can now compete for the what I guess they're still called best in class vehicles. \r\n\r\n\r\nAnd so those are like, Hey, you need to have managed 5 to 10 million contracts with this many subs at this many agencies. And like, right now, actually, they're doing these scorecards.  So they just basically give you like 100 things that they want. And you get points for having them and whoever gets the most points gets on the contract, basically.\r\n\r\n\r\nAnd then is it basically what's yeah.  Is it as impartial as you just described? Like, is it like, Oh, they do the points and whether or not you have the points you get the contract or is it like those kind of vehicle for those big broad? So those are just big, broad vehicles that like  GSA is setting up government wide.\r\n\r\n\r\nOnce you get into the actual task order, that's the actual work coming across that vehicle. So think of the vehicle is a master services agreement. You all have the right to bid on this work. Then there's individual task orders that are the actual work, like helping D. O. D. do their C. R. M. or whatever it is.\r\n\r\n\r\nRight? And then on that work, a lot of times the government wants to keep the incumbent.  Or they want somebody in particular, and they'll try to shape the criteria by which they select  the vendor to that. Right. So they'll be like, hey, you need these kind of resumes with this kind of experience, blah, blah, blah.\r\n\r\n\r\nAnd only like a couple of companies can do it. Yeah, yeah, yeah. Okay. The bigger the contract gets, the harder that is to do because it gets way more scrutiny. So when you're doing like a 500 K million dollar a year contract, you can,  people get away with lots of stuff, but when it's a hundred million dollars or a billion a year, yeah, no, I mean, those are getting scrutinized.\r\n\r\n\r\nAnd like,  it's interesting because usually when I think of like barriers to entry to a business or an industry,  I'm thinking of  regulatory, I'm thinking of significant capital investment,  but for this space, I don't, I wouldn't even know what to describe it. It's like. Social proof basically for these agencies.\r\n\r\n\r\nLike  it's anybody can get into it, but in order to start to get the best contracts, it takes a long time because you've got to build a body of work  in order to get those bigger contracts. And then you're going to have to build the process. You have to build the back office that can administer. So.\r\n\r\n\r\nBasically, by the time you're getting those big master services agreements, they want to know. Basically, they all they care about is can you administer government contracts? Can you administer the team behind you? And can you make effective bids and deliver? To be honest, they don't really care about your solution.\r\n\r\n\r\nAt least the people selecting who gets on the M. S. A. The services agreement. Now, the individual task orders, they might really care about your solution.  But like to get on the big piece of work, they just want you to be a good general prime contractor for the government. It took me years to figure that part out. \r\n\r\n\r\nIs that how we got like the exchange? Remember when Obamacare came out and they, they sent 5 billion to build the website and it's like,  didn't take 5 billion to build that website. And then when it broke, they had to go find a bunch of really smart people and just get them on contracts as fast as possible.\r\n\r\n\r\nAnd so like that whole process worked. After it broke, but you could just see the machine, like tons of people knew that it wasn't working, but it's just such a machine that they can't, you have to throw your body in the cares, try to stop.  It's not just a meritocracy. It's you've got to have a body of work in order to even get to a spot where they will evaluate the quality of your work.\r\n\r\n\r\nBut even then that's kind of secondary to whether or not you can administer the contract.  Wow. Exactly.  So tell me, I'm curious, like  for companies in your space that do the professional services and getting them getting their infrastructure built out in order to manage these new programs that have been appropriated by Congress. \r\n\r\n\r\nWhat is like the typical margin look like on those types of businesses, these high margin businesses, low margin businesses.  Yeah, it does. It does depend on the type of work. So I think when you're smaller, a lot of people under, you know, like a million, a couple of million and even a below, they can probably get away with about a 20%. \r\n\r\n\r\nMargin net margin pre tax course. If you're doing a lot of DOD work, they do cost plus, and that's a lot rougher. So you're down, you're down in single digits. So really? Yeah. Yeah. They do a whole weird thing called cost plus, which, so just put that aside, right? Okay, guys, we're going to get back to the show in just one second, but first a message from a sponsor who is, uh, me.\r\n\r\n\r\nOh, it's me. Cause I'm doing the show for free. Listen, I want to give you a hundred dollars.  All you have to do is this. Go to Apple or Spotify.  Give me five stars, write a review, screenshot that review, send it to me, Nick at cofounders. com and you will be entered to win a hundred dollar Amazon gift card every four episodes.\r\n\r\n\r\nI am going to choose a winner at random and I'm going to do this five times, 500 for five stars. I just made that up. It's what I'm calling it. Please go to Apple or Spotify, leave a review, screenshot it, send it to me, Nick at cofounders. com and you'll be entered to win a hundred dollar Amazon gift card.\r\n\r\n\r\nAll right, let's get back to the show. I do want to ask about that because everybody talks about cost plus as being this.  Big boondoggle waste machine, because essentially what they're saying is  you tell the government what it's going to cost. And then you fix a percentage on top of that,  which doesn't sound scary or bad.\r\n\r\n\r\nBut when you take into consideration that if you messed up or if there's overruns, you're not really incentivized to hit a timeline or a budget because you just plus on top of whatever it costs for you to finish that project.  But I didn't realize it was single digit margins. Yeah, yeah, it's like 6, 7%. I mean, some people like it because they get a lot of their costs covered.\r\n\r\n\r\nRight and then they could go bid other work where they might get a little bit better margin and add that cost cost is a little bit fungible. Right? But we don't we actually don't do that work. So I just kind of stay away from we do all civilian agency work. So, yeah, and then they do all kinds of other contracting.\r\n\r\n\r\nBut I think, but like I said, I think. When you're a million smaller, you can get away with 20 percent and then it starts going down to 15 and then eventually down to low teens when you're getting in the 50, a hundred million plus.  Because you, you have to build such a big back office.  To like administer all this stuff and you have to have multiple recruiters and compliance people and contracts management, and so you're paying a lot.\r\n\r\n\r\nAnd the administration that you're talking about is the administrative burden that the government's placing on you in order to contract for these programs, are there administrative burdens? That the government requires you like just for reporting your business. Like, are they looking at you and saying, okay, where did you spend this money?\r\n\r\n\r\nWhat were your margins?  Like, is there any audit process other than just the IRS? Are they looking at you and sort of your administration? Yeah. So they look at like each agency and that's a good question. I don't know if it's on every contract that I have to go back and ask our contracts people, but on the big ones, they'll come in like GSA will come in and audit you every.\r\n\r\n\r\nPeriodically and make sure your rates were the right rates and bubble, you know, that, and they'll go through your  invoices and make sure that you're doing everything right. We try to do it with them as often as possible because you can kind of get ahead of problems. If there's anything you really want to be audited more than not, because you don't want to come down like three years later with some huge problem, right?\r\n\r\n\r\nThat they're going to come after you for. So yeah, so there's all sorts of stuff like that. Dude, that is so interesting. Yeah, it's a very strange little economy, right? And is your space, your, like, your industry, is it dominated by small players like you or is it dominated by KPMG and Deloitte and these larger entities and corporations?\r\n\r\n\r\nSo, so it really, I mean, it is dominated by the large companies because you think like, They're building weapon systems and those are gonna Lockheed and stuff like that. Those are massive. Right. So, I mean, revenue wise, it's dominated by them. But the government sets aside at least three to 5% of spend.\r\n\r\n\r\nThat's the target for small business. And then they have Oh, they're mandated categories beyond that. Yeah. So they're mandated to do that. And so there's all, you know, so there's, I would say it's dominated by the big guys, but there's definitely a big market for smalls.  Sure. And, and actually to tell you the, the, the process of going from small.\r\n\r\n\r\nThe large, 1 of the hardest things in business to do in this industry, it's just almost impossible. Like, you get once you kind of get out of your small business side status.  We call it 1 side of the river. We call it the river being in the river. 1 side are all the small little animals who are happy. And on the other side are the huge predators, like waiting to kill somebody.\r\n\r\n\r\nAnd then all of a sudden you're pushed, you're like this deer that got pushed out in the middle of the river and you can't get back to the smalls. And if you go to the other side, they're just going to rip you to pieces. So like, okay, what's, what's the line? What's the demarcation line? Like what's, yeah, there's a bunch of, they, they change them a lot and they, and there are based on different kinds of work you do, but it's usually, it's all calculated on a five year average.\r\n\r\n\r\nRight. So you take your revenue for a five year average. And I think the main one for regular management consulting is 24 million right now.  When I started, it was like  12, 15 or something like that. And it's gone up to 24. And then I think for like IT engineering work, it's like, 34, somewhere in that range.\r\n\r\n\r\nI'd have to go look up the latest figure. So have you been pushed into the predator?  Right. But you could be a hundred million dollar company, but on a five year average,  right, you are under the other thing is if you get these big master service contract vehicles that I was talking about, they're usually for five years.\r\n\r\n\r\nAnd if you're small, the day you got awarded the contract, you stay small for that five years.  So you can keep growing and be big and be over that, but you still got small business size status on that vehicle. And then that vehicle can actually let a contract at the fifth year for five years. So, And so you could get 10 years on some kind of work as a small.\r\n\r\n\r\nSo there's a whole bunch of games like that that you play. And it's a whole ladder. And then basically what happens is people either. I mean, there are a few companies that cross, but usually they do some M and a, they're able to buy a couple of unrestricted, well, unrestricted as large work. But there are small companies that do unrestricted work just by happenstance, right?\r\n\r\n\r\nThey just happen to get it that way. So there are companies that'll go do it out of their own cashflow and buy and get bigger and get enough unrestricted work. To be interesting to a strategic buyer, like a big guy, but most people will go to private equity and then private equity will try to mash a few of those things together  and get enough work.\r\n\r\n\r\nYou kind of buy in a melting ice cube.  Because as that work comes, but the small work comes back up,  sometimes you can talk a customer into taking it unrestricted, but they, you know, because they're after this 3 to 5 percent target, so usually they don't want to let it go. So then usually you have to find a small business to front you  and you become the sub.\r\n\r\n\r\nAnd that's what we're doing for other people right now, where they're from.  Yeah. And that's how you, like, once you get all the contract vehicles and you get all the experience, basically the real job is to go get the big partners whose work is going small  and then be the front person for them. That's how you really accelerate your growth.\r\n\r\n\r\nLike you said, it is its own  economy. A hundred percent. Oh yeah. It's totally weird.  Crazy. It's crazy. The government's created this, but it doesn't really create a lot of lasting, valuable companies.  And even like. There's a whole thing about that where I think they're even doing that on the innovation side because there's so much like, I had a buddy who was in the Obama administration doing  procurement and R and D stuff  and he had a whole presentation called the summit of death. \r\n\r\n\r\nSo, it's like, basically, the government takes a really innovative company and makes it do all this stuff, like, hire lobbyists, get compliance, get contracts, people do that. And so, by the time they're super successful, they're at the summit, but they've lost all their innovation because all their money went into.\r\n\r\n\r\nSo, Building out the infrastructure, the infrastructure necessary to kill their inner cause of the summit of death, you know?  So this will be my last question with your business. Like what, when you retire or when you decide you're done,  what happens to that business? Do you sell it or is it, does it have enterprise value? \r\n\r\n\r\nYeah, so it does. You know, the multiples are constrained when you have small business work. And so we're right now exploring those options. Cause we're looking at sizing out a couple of years. And so we look at, should we. One thing we could do is go more IT focused work. That would give us a little bit more runway.\r\n\r\n\r\nThat's a huge culture change though, because the cap cap. 'cause the cap goes up. Cap goes up. Yeah. It gives you a couple more years. The other thing would be looking at a strategic in an exit with a PE partner and being either part of a platform that they're rolling up or being the platform. We could merge with another company and maybe we could get big enough.\r\n\r\n\r\nTo be interesting to a strategic, but some kind of exit has to happen at some point, you're just, you know, are the multiples, you know,  yeah, so, I mean, I think they probably go from, they're probably in the five,  it depends on the type of work you have, like, so you had a bunch of really cool AI work or something that was really growing or used to be cyber, you know, it's like the big one, they'll, somebody will just buy that to get into it.\r\n\r\n\r\nRight? And maybe they'll give you 10 times. Right? But really, when you're small business, you know, it's gonna be 4 to 6 times a bit. And then if you can get unrestricted, it can go. It goes to 8 to 12 and up from that. Yeah. So, I mean, if you can get a couple of companies, I've seen emerged.  And they've just been able to turn over enough work that they've got, say, 30 to 50 percent unrestricted and then they can get into that 10 to 12.\r\n\r\n\r\nAnd then they can, but at that point, they can exit to a strategic rather than P.  But private equity is basically the main  avenue for most small businesses.  All right. So I got some rapid fire questions for you. Are you ready to go for it? What do you love about this business? I definitely love like the mission part of it, you know, like being able to work on some of these big programs.\r\n\r\n\r\nWell, I mean, like trying to help reshore semiconductors, the United States is huge. Right. And just being a part of that, you know, is a privilege, but I also love the game of it. It's like a big, like machine. And once you figure out how the machine works, you just learn how to like, you know, it's fascinating.\r\n\r\n\r\nSo it took me years to figure that out. But I love that part of it to what do you hate about it?  Yeah, I mean, just the compliance and like the link. I mean, our sales cycle is like 6 to 12 months or longer. And then the government's just so like, they're so they've been screwed so many times by bad vendors that they're so prescriptive. \r\n\r\n\r\nAnd like, once they're in bed with a, you know, once they've awarded work to a vendor, it's really hard to get out of it. So, like, they just so prescriptive and it kind of ends up shooting themselves in the foot. What do you mean by prescriptive? They're just trying to make the contract deal. They want to specify each. \r\n\r\n\r\nUh, position and what they do and what experience they have and what they're going to do, you know, it's like, ah, it's just like, what's your outcome that you want and then hold us accountable to the outcome would be a much better, but for these big contracts, it's really hard for them to do that too. So I often joke that everybody's jealous of everybody else in some capacity, right?\r\n\r\n\r\nReal estate guys are jealous of business guys and business guys are jealous of real estate. What industries are you the most jealous of right now?  Oh, man, I love like, I think like manufacturing would be like one of the things I would love because we actually make something I've been in. So I've been in like a word sell, like, like management consulting world for so long.\r\n\r\n\r\nI'd love to actually, like, produce a product someday.  And then I used to love my favorite was self storage  because, like, You just have like a, there's no employees and like, you don't ever talk to your customers and you just like, but now there's no value of that apparently. So no one makes money in self storage anymore.\r\n\r\n\r\nBut if you could make money on it, I would go self storage. What keeps you up at night?  Yeah, I mean, I think right now I'm seeing. A lot of the excesses of the pandemic are starting to crop up, and I think that and maybe the excesses the last 15 years,  and I think you're starting to see things like PE firms not paying out on funds. \r\n\r\n\r\nI think venture capital is in a lot of trouble. And I think we're going into a world of higher interest rates and higher inflation and basically nobody in the operating community and the funding is an industry did not exist. The last time we had a high and variable inflation and it's a leveraged business.\r\n\r\n\r\nAnd so I'm really worried across the board 1 valuations, I think, are going to deflate slowly over time, but there aren't right now. We still have too much money in the system sloshing around. And I worry, like, look, we got pension funds that are waiting on these returns. We've got people. In our community that are levering up to buy small businesses, and I just wonder, like, is all this behavior the result of 15 years of  very low rates and a 40 year cycle of declining rates?\r\n\r\n\r\nAnd we're now entering a 40 year cycle of increasing and variable rates.  And like, has anyone ready for that?  And we still got fricking GameStop going through the moon. I'm just like, what is going on? Like, didn't we get rid of this? And like, but now you're starting to see cracks. Like you're starting to see real estate operators whose deals are going bad.\r\n\r\n\r\nAll the deals from 20 to 22 or start stopping paying.  This is a very broad topic. Yes. I saw a chart recently basically saying that the majority of Americans have burned through their COVID savings. So a lot of that excess money that was in the system is kind of working its way out. What you're kind of highlighting is  the asset values over the last few years have been so high because of the amount of money that was in the system  that many companies are underwater.\r\n\r\n\r\nAnd for real estate in particular, if you underwrote a deal  at a 3 percent loss, Interest rate and a million dollar valuation. Well,  what does that deal look like at 7 percent interest rate? It's not a million dollar valuation anymore. It's had to change. And now valuation. So what happens to those LPs who invested in that?\r\n\r\n\r\nWhat happens to the returns if your interest expense was a hundred thousand and now with the 7 percent interest rate. Your interest expenses 300,000 and your NOI was 400,000. I mean your NOI just went from 300 to a hundred. So like your LPs are being paid out less. You have less flex flexibility and we haven't even seen the beginning.\r\n\r\n\r\nJust the beginning now, I think where people extended and pretended on that crap for so long and it's starting now, but it's gonna grind on for years.  That's the problem. And like, what happens when all this capital just gets incinerated?  Don't you think there's a differentiation between those operators who were in the space operating for years before 2021, 2022 asset valuations  and the new entrants, the ones who went out and raised a fund? \r\n\r\n\r\nIn 2020, 2021, and then deployed that capital at sky high multiples, do you think that do you think there's still  the risk for like massive contagion?  Well, I don't know about massive contagion. I'm not saying I don't expect like a crisis. And this is what I think our problem is. We are so conditioned around crises.\r\n\r\n\r\nLike the GFC and the pandemic, this is a long, slow grinding deflation of, of asset values. We have not experienced that since the seventies and maybe a little bit in the real estate in the early nineties, no one's lived through it. Right? And so we don't know. No one's prepared for it. I guarantee you all the none of those operators that you're talking about that are great, but they were all doing deals during 20 to 22. \r\n\r\n\r\nAnd by the way, it was happening before it was already inflated. So I just worry that, like, we're all still pretending like it's going to go back to what it was, and it's not. And, like, what are the implications of that?  And, like, I think that we could see a dramatic  Like over time, you're going to see inflation just grind down these returns. \r\n\r\n\r\nAnd we're going to have that for the next 10 plus years, basically you think it's going to be inflation that grinds down those returns. Or do you think there's also going to be deflation and asset values? Yeah. So I think inflation deflates the asset values, right? So the higher your interest rate goes, the less value you have and the less multiple you're getting on your NOI or whatever it is.\r\n\r\n\r\nRight. So, but so kind of like the same thing to your point, we are  conditioned to kind of experience crisis. Yeah. And like in the great financial crisis, we had a big run up and then over like three, four years, a massive crash and home prices,  but home prices didn't, they didn't bottom in 2008. They bottomed in like 2011, 2012. \r\n\r\n\r\nAnd so for what we're dealing with now, where we pumped a bunch of money into the system during COVID, the crash, probably  to your point, or the, at least the lows, we, we probably still haven't even experienced yet. Cause it hasn't, it might be nominally values. Just don't go down, right.  But real values are going to go down, so you're just not going to have a lot of appreciation and you're going to have more inflation.\r\n\r\n\r\nI don't think inflation is gonna be crazy,  but it's going to be higher and more variable than it has been. And so that just means over time, your 5 to 6 times thing becomes a 3 to 4 thing. And there's just a lot of grinding in that that sucks. Why does it keep you up at night? Because I mean, you have a business that seems kind of insulated from that. \r\n\r\n\r\nWell, not 100%, but yeah, I mean, I think that we have a lot of operators out there who have taken on a lot of debt, and I worry that they're going to get in a lot of trouble on and to like, look, what do you think props up every pension system and endowment in this country? It's a bunch of private equity venture capital, and they're increasing the amount of that because those guys are volatility laundering, right?\r\n\r\n\r\nThey're not showing their real returns. These guys with these funds in the last few years, they're full of shit. They haven't marked anything down. I mean, if you go out and look at real estate deals right now, there's still crap and like, and the, and the public REITs went down 30, 40 percent and they're like, Oh, no, we're down 1%.\r\n\r\n\r\nGive me a fucking break. Sorry for my language, but it makes me angry. This is great. Where can people find you if they want to. If they want to come follow you. Yeah. So definitely reach out small. I have a great newsletter, the small business mentor. co. If you want to subscribe, I'm on Twitter at a Pence P E N T Z.\r\n\r\n\r\nAnd I've got the  podcast. So this has been great. This was awesome. Thank you, Alan. We'll talk soon, man.  All right. That's it. Another one for the books. I'm fired up. I don't know what else to say. I hope you found something valuable in that conversation. I hope you learn something. I hope there's something that you can apply to your business today, tomorrow, in the future that makes you money and makes you more successful.\r\n\r\n\r\nIt gives you more time with your kids. If there was something I'd love to hear about it in the comments below, you know, give me some feedback. And if you like actionable advice and you want more of this, I write a weekly newsletter that gives insights, tips, and tricks into the world of entrepreneurship.\r\n\r\n\r\nSubscribe in my bio.  And if I can help you in any way in your entrepreneurial journey, don't hesitate to reach out to me. Nick at cofounders. com sorry, Kelly, for more emails. And the last thing is remember  curiosity is a superpower and you can use it to your advantage. As my mom used to say, there's no such thing as a dumb question. \r\n\r\n\r\nOnly dumb people.  We'll see you next time.",
  "metadata": {
    "duration": "",
    "date": "2024-08-05",
    "platform_source": "Google Drive"
  }
}