{
  "episode_number": "163",
  "episode_title": "Supply Chain Meltdown: Tariffs, Shortages, and the New Trade War with Craig Fuller",
  "guest_name": "Craig Fuller",
  "business_name": "Sonar, FreightWaves",
  "transcript": "﻿Nikolas Hulewsky (00:00.78)\r\nAll right, Craig Fuller, serial entrepreneur. I'm excited to talk to you today because you are the Bloomberg of freight and logistics. Obviously you have Sonar, which is the Bloomberg terminal, which is like real time logistics data domestically and internationally. But you also have freight waves, which is the the the non Bloomberg terminal portion media arm. It's just keeping people up to date. And I've been following you super closely because this trade war.\r\n\r\n\r\nis evolving. I think like many entrepreneurs, I was sitting around thinking, yeah, they're going to talk a lot about it. But at the end of the day, nothing's really going to impact me. And then you had a tweet, I don't even remember when it was, where you said, well, guys, orders for back to school shopping should be placed right about now. So buckle up because orders are way down. It was something to that effect. And like in my mind, that was the first moment it clicked where crap supply chains are like\r\n\r\n\r\nreally long tail. there's not this immediate effect in them so I got to get educated on what actually is going on.\r\n\r\n\r\nCraig Fuller (01:07.101)\r\nYeah, I think that's absolutely correct. So we are at risk of seeing supply chain shortages this year and as early as mid summer. So I think by the time we roll into June and July is when you'll start to see certain products that are out of stock is where I would expect. But probably the first time most people will notice it and become sort of aware is that back to school season, which starts.\r\n\r\n\r\nNikolas Hulewsky (01:31.374)\r\nMm.\r\n\r\n\r\nCraig Fuller (01:31.965)\r\nReally late July, early August is when moms are going out and shopping for their kids for back to school. And that's when you'll start to see it become more of a mainstream story when they can't find the things that they normally expect. Whether it's apparel, clothing that they would send their kids in, whether it's school supplies, those are the types of things that I would expect to see us have shortages of and where it becomes sort of apparent. I do think there'll be parts of the industrial supply chain that actually will start to be impacted earlier.\r\n\r\n\r\nyou're already starting to see some layoffs due to parts cost, et cetera. Things like air conditions, frankly, a lot of the compressors and air conditioning parts, when people have problems the summer, when it gets really hot, they could have problems getting those things replaced simply because, yeah, I mean, these are the types of things you don't think about until you need it. And then all of a sudden when you need it, you can't get it. And the reason is that the host sellers are just simply not importing. They don't want to pay the 145 % tax.\r\n\r\n\r\nNikolas Hulewsky (02:09.591)\r\nno.\r\n\r\n\r\nNikolas Hulewsky (02:17.176)\r\nThat was a problem during COVID. I remember that being a problem during COVID.\r\n\r\n\r\nCraig Fuller (02:30.683)\r\non these goods and so they're not bringing those products across the oceans and therefore it won't be in stock in warehouses.\r\n\r\n\r\nNikolas Hulewsky (02:37.496)\r\nSo I think the lag is just incredible. It's just weird to me, right? Like most things you can react really quickly to because you're like, my house is on fire. Cool. Now I know I need to go put the house out. But if someone tells you, hey, in six months, your house is going to be on fire unless you do X, Y, Z things, like we put it off. We're like, well, it's not really, it's not really going to happen. Can you kind of explain why there is this lag? Like what does the supply chain look like after something is produced in China?\r\n\r\n\r\nall the way up until when it gets put on our shelves. Like what are all the hands that kind of touch it along that continuum?\r\n\r\n\r\nCraig Fuller (03:10.367)\r\nBut we have to actually start earlier than that. So, you know, it's interesting that as, you know, I'm 46 years old, I've largely grew up in a world where everything was sort of instant gratification or just in time supply chains. But I remember as a kid watching Saturday morning cartoons, because that used to be a thing, and you would see the commercials and it would say, allow six to eight weeks for delivery. And that was a normal sort of cycle time that, for the most part, the supply chain\r\n\r\n\r\nNikolas Hulewsky (03:12.469)\r\nokay.\r\n\r\n\r\nCraig Fuller (03:38.821)\r\nused to exist even we're talking about months. And so if you think about what this takes to order products is the reason we are able to get products in one or two days is because there are products inside of warehouses sitting for you and I to simply order them. But if we sort of back up what it actually takes to get those products into warehouses is you're talking to up to a year, six months to a year before products are actually, and we're going right to the ordering process. So,\r\n\r\n\r\nNikolas Hulewsky (03:54.318)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (04:05.035)\r\nWhat?\r\n\r\n\r\nCraig Fuller (04:07.263)\r\nThink about the ordering process is a large retailer or a brand of the United States will send an order over to China and say, I want you to produce these products on these specs. They will, you they have a bunch of orders coming in. Typically these work, these manufacturers do, and they are on a 90 to 180 day lag because it takes them time to produce those with all the other orders. Stuff is not instant. So we have typically a 90 to 180 day\r\n\r\n\r\nperiod of just assembly and production before it ends up getting even shipped over to the United States. And so that time is what we're looking at is this stuff is anywhere from six months to a year out before you do it. So when you look at Walmart, Home Depot, Target, even small e-commerce companies that are DTC, when they're doing a product design, they're given themselves months in advance before they expect those products to arrive. So this is\r\n\r\n\r\nThe ordering season for the holidays is when people are ordering product. And so that's the, right now, this is when these orders are taking place. And so think about.\r\n\r\n\r\nNikolas Hulewsky (05:07.628)\r\nWow. Right now.\r\n\r\n\r\nNikolas Hulewsky (05:13.368)\r\nSo Black Friday, Cyber Monday, any?\r\n\r\n\r\nCraig Fuller (05:15.837)\r\nYeah, so Halloween's probably the big holiday. So the way I think of the schedule is if we're six months out is about the time when orders will be flowing in. And what's happening is that nobody wants to actually take orders right now or make orders because they don't know what those costs are going to look like, what the tariffs look like. The other thing is that Chinese manufacturers, due to a number of cancellations, they've gotten a lot of products that have been put on hold, orders that were done, where maybe they...\r\n\r\n\r\nThey didn't take payment ahead of time or took a small deposit ahead of time. They're stuck with this inventory and now they look at US customers, US importers as credit risks. saying, look, I built 10,000 units to your specs and you paid me 20 or 50 % of whatever that amount is and you're refusing delivery because of the tariffs or asking them to hold this inventory. You're now a credit risk when they start to see these issues pile up, they're simply not taking orders for anyone.\r\n\r\n\r\nThat is what we're looking at is, that is the sort of end game in terms of where we start to where we end. But let's talk about something intermediate, why we should be looking at things this summer, because based on the six month timeframe that I shared with you, we shouldn't be impacted. Because if you think about when the tariffs went into effect, that was April 9th. So fast forward, it's really Halloween is sort of the first time and then ordering cycle will be a problem. But let's back up here, something else is also going on. So.\r\n\r\n\r\nNikolas Hulewsky (06:33.954)\r\nYeah.\r\n\r\n\r\nCraig Fuller (06:39.007)\r\nUS importers knew tariffs were coming. think largely anybody that was involved in trade in terms of supply chain are largely sophisticated. We knew tariffs were coming. was in everybody we talked to that was at any level knew that tariffs were coming. I think most people, including myself, expected sort of a 20 to 25%, maybe 30 % tariffs on China to be sort of the upper end of it. For the most part, companies can absorb that in their margins. It's not ideal, but they would be able to absorb a 30 % increase in cost.\r\n\r\n\r\nof goods sold because they're able to pass it Slightly pass it on, some of this stuff gets offset in currencies. And so for the most part, like you said, is that most entrepreneurs sort of said, oh, this will either get figured out or I will figure it out when it happens. What they note, no one expected was 145 % increase, which basically means that you can't afford to import products. And I own a number of businesses. I even have a small e-commerce business that sells.\r\n\r\n\r\nNikolas Hulewsky (07:10.178)\r\njust by passing it on to, yeah, that's what I was gonna ask, sorry, cut you off.\r\n\r\n\r\nCraig Fuller (07:34.449)\r\nairplane and models and railroad models for our hobbyist titles. We have shut down all orders because our suppliers have taken a 30 % increase. And that's about the margin that we typically get on these products is that, you know, we're talking about the markup being about 30%. When you increase the cost of goods sold by 30%, it simply becomes something non-workable. So we've just shut down all orders. In fact, I talked to our e-commerce, head of e-commerce this morning. said, well, it's just not ordered anything until we figure out what this looks like.\r\n\r\n\r\nSo what's happening right now on the ground, when these tariffs went into effect, everybody said, oh my God, 145 % tariffs means that I can no longer make this product profitable for me. I don't want to pay the tariff or the increase in costs. I'm just going to pause all orders. And so what a lot of US companies did, and I'm talking big companies, I'm talking small companies and talk about everything in between, just paused all orders. And so when they pause all orders, the flow of containers and the flow of shipments from China,\r\n\r\n\r\nthe United States just stopped. And that's what we're not stopped entirely, but we saw, you know, as many as 80 ships, what we call blank sailings, just didn't take the voyage, didn't have enough cargo to come across the oceans. And in doing so, that stuff is starting to pile up. what's...\r\n\r\n\r\nNikolas Hulewsky (08:55.214)\r\nSo April 9th happens, let me just ask this question real quick. So April 9th happens, companies have already been in that 30, excuse me, 90 to 180 day window where they're doing production. Products are produced, at that point companies have said now like, oh yeah, don't send it, is that why China's looking at us as a credit risk?\r\n\r\n\r\nCraig Fuller (09:13.215)\r\nYeah, they actually have product. They have product that's actually either in loaded in containers. And there's actually been stories of this where a five below a discount retailer sort of in that lower end five below means less than $5. The dollar tree or everything's a dollar is now going up to five. Yeah.\r\n\r\n\r\nNikolas Hulewsky (09:24.013)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (09:27.278)\r\nYeah. Inflations hit the dollar tree hard. We're five below now.\r\n\r\n\r\nCraig Fuller (09:34.463)\r\nAnd so, you know, there was a story of Fibolo basically instructed their ship line to unload the containers that were loaded because they could no longer afford to bring those products across the ocean. So essentially the way you think of this is that freight is piling up, manufactured goods are piling up in China, and they're not making it over to the United States because companies are refusing to take delivery. There have been examples and there will be examples of where companies\r\n\r\n\r\nNikolas Hulewsky (09:54.861)\r\nMm-hmm.\r\n\r\n\r\nCraig Fuller (10:02.889)\r\nproducts come into a warehouse, they actually do go across the ocean because the company is not aware that the tariffs are going to hit them or don't realize how much they're going to hit them. And, you know, they're expecting a four or $5,000 bill for tariffs. And all of a sudden it's a hundred thousand dollar bill and they don't have the cash. And so they refuse to pay the tariff, which is really born by the customs broker is the one responsible for it. And the customs broker is like, well, I'm not delivering the freight until you pay it. So now.\r\n\r\n\r\nNikolas Hulewsky (10:19.854)\r\nCheers.\r\n\r\n\r\nNikolas Hulewsky (10:31.374)\r\nOkay.\r\n\r\n\r\nCraig Fuller (10:31.699)\r\nWe have another inventory problem because products may be in US warehouses, but no one's actually taking delivery of it. And so we have this sort of like snafu happening with these bottlenecks that's being caused by this really abrupt change to trade.\r\n\r\n\r\nNikolas Hulewsky (10:47.79)\r\nOkay, so I'm an idiot and I don't understand the full workings of the supply chain. So I know this is a very simple question for you, but I'm trying to understand. You said in there, did say there's a tariff broker? Okay, so.\r\n\r\n\r\nCraig Fuller (11:00.591)\r\nknow, customs broker, they're basically the ones that are responsible for arranging all of the paperwork that's required and declaring, helping you declare the value of your source product. remember, we're talking about the cost of goods sold, not the end. This isn't a sales tax, this is a tax at the point of importation.\r\n\r\n\r\nNikolas Hulewsky (11:13.998)\r\nOkay, so if I'm looking.\r\n\r\n\r\nNikolas Hulewsky (11:18.84)\r\nOkay.\r\n\r\n\r\nSo could we try to walk through the timeline of like, all right, the goods are on a ship. They're in a container, they're on a ship. Because I've heard of like a bonded warehouse. I'm like, what the frick is a bonded warehouse? And then I've heard about obviously shipping companies like truckers. I listened to your announcement this morning and it was like, if you're going to the West Coast, don't go unless you know what the prices are. And I'm like, what do you mean don't go? Like, do they just show up and pick up goods and then ship them? Like, how does that process work?\r\n\r\n\r\nCraig Fuller (11:27.731)\r\nOkay, so let's say...\r\n\r\n\r\nCraig Fuller (11:32.115)\r\nYeah.\r\n\r\n\r\nCraig Fuller (11:50.014)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (11:51.138)\r\njust all the way to the last mileage. Like how does it kind of.\r\n\r\n\r\nCraig Fuller (11:54.057)\r\nOkay, so let's just walk through the timeline in terms of how this works. So let's assume that our products have been manufactured and we'll just use backpacks as an example, because back to school, backpacks are gonna be in high demand. My wife buys a new backpack every year for my kids as they get older, like, yeah, so whatever they want, right? So we went from like Peppa Pig to Disney to I don't know what this year is gonna be. Anyways, so backpacks, let's say that we...\r\n\r\n\r\nNikolas Hulewsky (12:01.358)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (12:04.962)\r\nYeah.\r\n\r\n\r\nOkay.\r\n\r\n\r\nThe Jansports.\r\n\r\n\r\nCraig Fuller (12:22.879)\r\nproduce 10,000 backpacks and we're gonna go sell those backpacks in United States. The products are produced and they're ready to be shipped. You're talking about a 10 day to 14 day from the manufacturer, somewhere in China, a lot of it's along the coast, some of it can be sort of in the hinterland, sort of in the middle of the country, but for the most part, a lot of these products are assembled along the coast. It's about a 10 day to 14 day lag from the time that the orders are ready to the time it gets loaded into a container and then,\r\n\r\n\r\ndeparts the ports, let's say Shanghai or Shenzhen, which are sort of cities in China, Guangzhou. And so what will happen is the products are loaded. They're gonna take approximately three weeks to a month, depends on what port you're headed, to get to the United States. So let's think about this. The Liberation Day tariffs went in effect on April 9th. We're three weeks out.\r\n\r\n\r\nNikolas Hulewsky (12:57.102)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (13:12.494)\r\nWow.\r\n\r\n\r\nCraig Fuller (13:18.239)\r\nfrom the time that the slowdown starts to be felt in the United States, which is this week. We're going to see it about midweek to late week is when we're going to see a drop off in container flow. And once those products end up getting on the shore and so that this is where the customs broker sort of takes over as their job is to quote unquote clear the product through us customs. got to pay the tariffs and duties, any fees associated with those products to us customs.\r\n\r\n\r\nAnd then also make sure that they are liable, make sure that the product that you said you're shipping is actually legitimate. It's not contraband, it's not fentanyl, it's not weapons, it's not nuclear devices, radioactive, whatever. And it also, and so that's the more malicious side of customs, which does happen quite a bit. Somebody will say they're shipping in coffee and it's actually cocaine. You can watch this in that show, I think airport, I can't remember what they call it.\r\n\r\n\r\nwhere it's the customs guys at the airport security or something. And it's a great show. I recommend it. imagine not the human side of it bringing it in across the border, but actually a truckload or a container load of freight is doing the same thing. And you could see the dogs going, the customs broker is the one liable essentially by the United States for ensuring that the products are compliant, are not contraband or dangerous.\r\n\r\n\r\nNikolas Hulewsky (14:30.914)\r\nYeah.\r\n\r\n\r\nCraig Fuller (14:44.319)\r\nbut are also properly classified. And the broker will then pass that liability on to the importer of record. But essentially their job is to make sure that they're doing the things that are compliant. The US, correct. So DHL could be someone like Flexport, it could be all sorts of things. And their job is to essentially police this on behalf of the government. Now they have ways to bypass this liability so that if a customer is not,\r\n\r\n\r\nNikolas Hulewsky (14:54.284)\r\nand those brokers will be somebody like DHL.\r\n\r\n\r\nCraig Fuller (15:12.927)\r\ncompliant, they're not fully held liable, they have a way to pass that liability on, but the US government and customs enforcement expects them to do some level of diligence on their customers. And so this process takes place. The freight shows up three weeks after it's sent from the ports in China. At some point, it's going to clear customs. Some of this product can be pre cleared, which means the US customs says, hey, we trust this importer. It's Walmart or\r\n\r\n\r\nIt's Procter and Gamble and we know it's probably legitimate. They're probably properly classified or, hey, this looks highly suspicious. Nick importing is, we just don't trust Nick. We know this guy has a habit of bringing in things he shouldn't be doing or improperly classifying. Or Nick is a new importer. We've never heard of Nick. yeah, and like, you're a little sketchy. We've seen these podcasts. And so they end up...\r\n\r\n\r\nNikolas Hulewsky (16:03.118)\r\nso we don't have a history on them.\r\n\r\n\r\nNikolas Hulewsky (16:08.546)\r\nWhat? So real quick on that, real quick on that question. So is Walmart doing the importing or are they contracting with a big shipping company like Maersk? Okay, so there's other people in this.\r\n\r\n\r\nCraig Fuller (16:14.847)\r\nIt totally depends. well, Marisk is an ocean ship line. do happen to, you know, some of these ship lines do happen to have 40 operations, like a company called SEVA, which is owned by one of the big ship lines out of Europe. But for the most part, think of the ship lines like Marisk, Hathag, Lloyd, MSC as the container vessel operator. And then you have the customs broker.\r\n\r\n\r\nAnd the customs brokers job is to help you as Nick incorporated import products from wherever in the world. there's all these like excise taxes, export issues that sometimes you have to contend with certain countries have export restrictions and controls. The job of the customs broker is to help you figure all this stuff out and a reign to navigate it essentially. And so that's why they play a really important role in international trade.\r\n\r\n\r\nNikolas Hulewsky (16:51.427)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (17:03.416)\r\njust navigate the system.\r\n\r\n\r\nCraig Fuller (17:10.131)\r\nThey're also supposed to be the ones that know the rules of engagement. In this environment, the rules change really quickly. Some are, in some cases, contradictory. There's a lack of clarity because there'd be an executive order. It'd be something that the White House says that will be different than what's actually in the executive order. And the executive order then gets put into the federal registry. Federal registry consider it a law, but sometimes these things are happening so quickly that they're not really clear as to what they mean or don't mean.\r\n\r\n\r\nNikolas Hulewsky (17:24.739)\r\nYeah.\r\n\r\n\r\nCraig Fuller (17:39.943)\r\nin some cases even contradictory in terms of.\r\n\r\n\r\nNikolas Hulewsky (17:43.192)\r\nSo the customs broker gets it. How long does it usually take to clear customs? my gosh, dude.\r\n\r\n\r\nCraig Fuller (17:45.331)\r\nThank you.\r\n\r\n\r\nTotally depends. So they can pre-clear it while it's on the ocean. It can be stocked. a lot of times, I don't know what the percentage is, but I'm gonna guess 99 % of the shipments get cleared pretty quickly within hours of when the files come in. But in some cases, they just like when you, if you've ever flown internationally and you go through the process of immigration,\r\n\r\n\r\nlike they will randomly check product. They will randomly check. So there's like a whole data science element to saying, Nick incorporated is highly suspicious. Like every single shipment you send in Nick, we're going to flag because it meets some suspicious pattern that customs has identified that likely means it's drugs, it's contraband or it's improperly classified. So they have a\r\n\r\n\r\nwhole data science element to this. And then there's the randoms where it just a number generator on the backend, it's not being flagged for being suspicious, but it says, we should take a look at this. Now that can happen to Walmart and PNG, but can also happen to Nick Incorporated. So let's say that our backpacks have been flagged. Now these backpacks basically will not clear until Customs has actually done an inspection of them. So what they will do...\r\n\r\n\r\nwhen the container arrives in the United States, they will order container 12345 and say, I want to take that container and put it into, once it's broke, like broken, once the freight is off the container, we will take it into, either go to the bonded warehouse, which happens across next to customs, like it happens next to the ports, where it's sitting waiting for inspection.\r\n\r\n\r\nCraig Fuller (19:39.961)\r\nor they'll send it to an offsite location where they can inspect it deeper. Typically this stuff is happening in bonded warehouses. And so what will happen is the customs inspectors will come and they'll probably tear open the boxes and they're going to inspect our backpacks and they're looking for anything that is A, is it properly classified? So let's say these backpacks are cheap plastic backpacks and you declared them at a dollar a piece. That probably sounds legitimate in terms of your cost of a backpack. Maybe it's $10.\r\n\r\n\r\nBut let's say these are high grade calf leather that customs looks at it and says, these are not $10 backpacks. They're like a hundred dollars. And cause they know this stuff. see the patterns and know you, you declared it as a nylon backpack cheap, but you could buy at, you know, Nick incorporated, but they're really high end calf leather, beautiful, like luxury backpacks. They're going to say, look, we know this is at $10. It's a hundred dollars. And so now what you're going to do.\r\n\r\n\r\nNikolas Hulewsky (20:11.758)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (20:35.96)\r\nSo it's not, it's not.\r\n\r\n\r\nCraig Fuller (20:37.319)\r\nis say, look, you get improperly declared, you pay a penalty.\r\n\r\n\r\nNikolas Hulewsky (20:41.262)\r\nSo it's not just, he's got cocaine in the shipping container. It's, yeah.\r\n\r\n\r\nCraig Fuller (20:44.123)\r\nNo, it's like, did you declare the amount that you are owed, right? Just like, just like if I improperly did my tax returns and didn't say that I made a hundred thousand dollars and I said I made 10,000 or it's what they'll do is as much the same as their job. And one of the things to know is if you're a whistleblower, so let's say that the, that someone knows that you're illegally importing and improperly declaring\r\n\r\n\r\nthat person can rat you out and they get 10 % of the, of essentially the fees and fines that are associated with the, so now they have an incentive structure to actually, so don't trust your fans and family about how you're through in the system because.\r\n\r\n\r\nNikolas Hulewsky (21:18.733)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (21:25.492)\r\nI'm familiar with the whistleblowers, man. I worked in Medicare and Medicaid for many years in healthcare. It's a nice payday when it happens. Yeah.\r\n\r\n\r\nCraig Fuller (21:33.755)\r\nSo there's an incentive structure to rat you out. And so what will happen now is we've cleared it. we're talking, those delays aren't typically very long. Like we're not talking about the stuff being delayed, you know, days. Although if we improperly declared it could be, especially with all the inspections coming on right now. I haven't heard this, but I do expect, I mean, I've heard there's been chaos, but I don't know what the time you do know, or we all know that.\r\n\r\n\r\nthis stuff is going to, know, the Trump administration, customs and border patrol is being far more exacting and far more disciplined and sort of incented to go out and look for improperly declared products because this is part of the administration's goal is to drive as much tariff revenue as it possibly can. So.\r\n\r\n\r\nwhile I haven't heard it on the ground, I would expect that there to be a backlog, similar to like if you went to TSA and there's a bunch of people who don't know how to fly an airplane or there's a, look, if you go on international flight in certain countries, you're more likely to end up in a long line than if you went from say the Caribbean and a bunch of Americans on there. It's just natural to expect there to be a backlog. So normally there isn't really a huge delay, but in this scenario, I would expect.\r\n\r\n\r\nNikolas Hulewsky (22:33.774)\r\nIt's the incentive. Yeah.\r\n\r\n\r\nCraig Fuller (22:57.993)\r\nthere to be more delays than normal.\r\n\r\n\r\nNikolas Hulewsky (23:00.238)\r\nOkay, so goods are shipped 21 days to get over the ocean. They get to port. They have to go through the customs agent or the broker, customs broker. How, so...\r\n\r\n\r\nCraig Fuller (23:12.553)\r\nBut the customer oftentimes doesn't even take possession of the product. Like they're not necessarily taking possession of it. It's all paperwork that they're essentially clearing electronically. Some of this stuff is actually, you know, old paper, the old carbon paper does exist, but for the most part, a lot of it's electronically.\r\n\r\n\r\nNikolas Hulewsky (23:29.966)\r\nJeez Louise. So what are these? I've heard a couple things, a bonded warehouse and a forwarder. When do those come into the mix?\r\n\r\n\r\nCraig Fuller (23:37.181)\r\nYeah. The forders are always involved. So the, the customs forder and the broker essentially for the most part, are part of the same companies, you do have case, examples where, so a forder for the, you know, many forders own customs brokers. it's pretty typical. You may be using a different customs broker than you use for the forder. Like your audience doesn't need to know this new.\r\n\r\n\r\nNikolas Hulewsky (24:05.038)\r\nOkay, I just didn't know if that was like a supply thing where it's like, the forwarder is the one who actually ships it. Okay.\r\n\r\n\r\nCraig Fuller (24:08.275)\r\nThe forder is separate entity. For many cases, they can be a part of the same company, but in other cases, you can have a customs broker. there's a lot of nuances to this where an importer prefers a certain customs broker over a forder. Again, not getting into too many nuances, because I don't want to bore your audience with all these technicalities. But the forder is a different party than the customs broker, completely separate.\r\n\r\n\r\nAgain, could be a part of same company, but they're actually, they provide a separate function. A forwarder's job is to arrange for transportation from the origin to the destination. So their job is basically to take freight from the factory in China and basically arrange for ground transportation in China. So from our factory to our port. Now it's also possible that the manufacturer puts it on a domestic truck and it doesn't get into the forwarder.\r\n\r\n\r\nNikolas Hulewsky (24:57.262)\r\nMm-hmm.\r\n\r\n\r\nCraig Fuller (25:05.855)\r\nforders business until it gets into the port and then is ready to be trans shipped.\r\n\r\n\r\nNikolas Hulewsky (25:11.736)\r\nSo these companies aren't necessarily handling those logistics internally. They're going with a forwarder.\r\n\r\n\r\nCraig Fuller (25:15.263)\r\nNo, part, mean, there are examples of companies that handle this internally. Companies like Amazon may have a logistics operation or does have a logistics operation. Companies like Walmart, they're moving so much freight, will handle a lot of this stuff internally. But there's also for most part, so Nick Inc., who's a really small backpack company, you're not gonna have your own in-house forwarding operation. You're not gonna have your own.\r\n\r\n\r\nNikolas Hulewsky (25:28.792)\r\nYeah.\r\n\r\n\r\nCraig Fuller (25:39.875)\r\ncontainer vessel contracts and trucking contracts, you're going to outsource that. It just makes sense. Even very large companies are outsourcing this. so some of the biggest importers may do this in-house, that's an exception versus the rule. And so the forwarder's job is to basically arrange for transportation services to move your freight from point A to point B, to make sure it gets to the point of consumption or the point into a domestic warehouse that then you can put it into your supply chain.\r\n\r\n\r\nNikolas Hulewsky (25:44.663)\r\nInteresting.\r\n\r\n\r\nCraig Fuller (26:09.139)\r\nThat's what the ford is job is. And this is just like DHL, you know, UPS has a fording operation, FedEx has a fording operation, but there are companies like a company called Expeditors, a company called Flexport that do the same function. Just they're in a different part of that system.\r\n\r\n\r\nNikolas Hulewsky (26:10.392)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (26:28.014)\r\nSo the goods have been shipped, they're cleared. They've, you know, we're about, let's say 23 days into the process of shipping from China to the United States. Who picks up the baton now? Like who's the one that...\r\n\r\n\r\nCraig Fuller (26:41.415)\r\nOkay, so let's assume the freight has landed or has arrived in the port of LA. And so it comes into the port. It is offloaded at the terminal. are the cranes, you know, the terminal is essentially a part, think of it like a, the terminal at an airport is sort of, you know, terminal D is different than the, so the airport is Atlanta and that's the entire ATL or LAX in our case. It's this entire\r\n\r\n\r\nNikolas Hulewsky (26:46.478)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (27:08.142)\r\nMm.\r\n\r\n\r\nCraig Fuller (27:10.033)\r\nlike system, right? Where you have warehouses, like the airport is this like massive geographical section. The terminal is actually where the action takes place. So they offload your container. And let's say that we have a full container load, because I don't want to bore you with less than container, but let's say that we have a full container. And so that container is going to be offloaded. And then we have a decision on whether we want to move the container. And let's assume it's cleared. No problem. Our backpacks are properly declared.\r\n\r\n\r\nNikolas Hulewsky (27:25.548)\r\nYeah, yeah, yeah, yeah.\r\n\r\n\r\nCraig Fuller (27:37.897)\r\nWe don't find cocaine inside of our backpacks or fentanyl. Everything's great and we're ready to move the cargo. So now we have a choice of, and the forwarder may or may not take control of the sort of domestic shipment process. For the most part, your audience are small e-commerce founders. They probably will be responsible for arranging for a large piece of the transportation because you just don't want to deal with it. I want to call up Flexport or I want to call up\r\n\r\n\r\nNikolas Hulewsky (27:58.114)\r\nMm-hmm.\r\n\r\n\r\nCraig Fuller (28:07.269)\r\nUPS and FedEx and just let them deal with it. And so what they'll do is they will arrange for intra land transportation across the country. so our container could go on the rail road, we call it intermodal. And so this is going to be, you see these containers as you're driving down the road and you see a train and it's just stacked with containers. That is a container on rail movement. And so that's one way it could be handled. Another is that you,\r\n\r\n\r\ncould have a truck pick up your container and take it to a local warehouse. And again, we're talking about LA, Los Angeles. And so it could be coming into a warehouse that's around the port. Most likely it's going to a warehouse that's in what they call the Inland Empire, which is about 30 miles east of the port of Los Angeles or Long Beach. And so we're gonna ship it over there. And this is where that container,\r\n\r\n\r\nNikolas Hulewsky (28:45.23)\r\nMm-hmm.\r\n\r\n\r\nCraig Fuller (29:06.557)\r\nwould be called, would be unloaded and we call broken. So they're break the container. They don't physically break a box, but they pull freight out of it. And then they short it based on destination of where it's going. So this is the process that we're starting to get in MLAN. And let's say that our warehouse is bonded, which is what you've asked. And so if it's bonded and if it's in transit bonded, it means that effectively,\r\n\r\n\r\nNikolas Hulewsky (29:18.19)\r\nNikolas Hulewsky (29:27.884)\r\nYeah.\r\n\r\n\r\nCraig Fuller (29:35.773)\r\nthat the customs fees, the tariffs are not required to be paid until the product is consumed or sold. So if it goes into a retailer, let's say that you're wholesaling these backpacks to Walmart, then the moment Walmart does an order and they ship 5,000 of these backpacks into their stores in, I don't know, Phoenix, Arizona, then the tariff would be required to be paid.\r\n\r\n\r\nAnd so that's sort of one example. The other example, let's say that it's bonded and you're selling these online. So nickinc.com, nickbackpack.com is selling these. As they get sold, that's when the tariff is paid associated with this product. So effectively what a bonded warehouse enables you to do is basically put off or delay the tariff until after you're at a point of consumption.\r\n\r\n\r\nNikolas Hulewsky (30:05.048)\r\nWow.\r\n\r\n\r\nCraig Fuller (30:32.135)\r\nand it effectively leaves the bonded network. And that's why bonded warehouses are so important in this environment because the tariff amounts are so big that it's a big working capital problem for companies to pay them.\r\n\r\n\r\nNikolas Hulewsky (30:44.844)\r\nYeah, who were they cutting the tariff check to? Is it to the bonded warehouse?\r\n\r\n\r\nCraig Fuller (30:49.159)\r\nSo the, well, the effectively the importer, the, the forwarder, the customer, sorry, the customs broker is responsible for making sure to collect the, the tariff. They collect it on behalf of the U S customs. and so the U S customs is basically saying, okay, flex port. So a hundred thousand dollars for this shipment. we're going to go collect it, but it's not required to be paid until the stuff actually moves out of that bonded warehouse or out of that bonded network.\r\n\r\n\r\nNikolas Hulewsky (31:17.646)\r\nOkay, and so then there...\r\n\r\n\r\nCraig Fuller (31:18.065)\r\nYou can have in transit bond. Let's say, for instance, Nick, that we ordered 10,000 backpacks and these backpacks for some reason, the Bahamas wants to consume these backpacks. It's big surge for some reason. And so what will happen is this bonded warehouse will then ship the freight in transit in a bonded carrier in transit so it could move across the country in a truck that's in bonded and not be required to pay the tariff.\r\n\r\n\r\nNikolas Hulewsky (31:31.587)\r\nYeah.\r\n\r\n\r\nCraig Fuller (31:47.219)\r\nBecause the moment you move into the United States, once you're in the domestic system, that's when you're required to pay the tariff. If that thing is moving in transit bonded, then it's not required to pay it until there's a point of consumption.\r\n\r\n\r\nNikolas Hulewsky (32:04.024)\r\nSo looking at the continuum, we've got leaving China, gets the United States and it's going through customs, port of entry, then it gets shipped to a bonded warehouse. And then from that warehouse, it gets shipped to, does it go to another like regional warehouse or like are there two more stops? It could be, okay.\r\n\r\n\r\nCraig Fuller (32:22.099)\r\nCould be. It could be. It could be going, so let's say that we're at our bonded warehouse in LA and you decided that you've got a 3PL that's in Ohio because your Nick backpack ink wants to get this product closer to the consumer, is on the, know, large percent of consumers are on the East coast. know, Ohio is a great, know, Ohio, Tennessee, the sort of midsection of the country.\r\n\r\n\r\nNikolas Hulewsky (32:43.456)\r\nEast Coast, right?\r\n\r\n\r\nCraig Fuller (32:49.565)\r\nyou see a lot of distribution warehouses around the midsection because you can get everywhere essentially in two days by truck. And so what will happen everywhere except the West Coast. And so what happened is you may leave a thousand of these backpacks in a facility in Southern California and then 9,000 of them end up going to Ohio where they're sitting in a facility waiting to be purchased. And as people purchase the backpacks, end up, you end up distributing them.\r\n\r\n\r\nNikolas Hulewsky (32:56.334)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (33:17.006)\r\nOkay, so my Neanderthal brain, the way that I would regurgitate this back to you, you tell me if I'm wrong. I mean, it sounds like you said like the airport, sounds like international travel. If you're coming from China, there's only a couple of places where you're gonna go directly to. Maybe it's Seattle, maybe it's LA, maybe New York has a direct flight, Dallas, but there's like...\r\n\r\n\r\nCraig Fuller (33:34.255)\r\nWell, lot of this, again, containers. I mean, I use the example LAX, bad example, because we like LAX is an airport, most stuff is moving into containers. It's only a certain amount of ports on the West Coast or even East Coast. I think we have 40 some odd boards in United States. There's only 40 points of entry that your freight is going to come into the US.\r\n\r\n\r\nNikolas Hulewsky (33:39.512)\r\nWhat?\r\n\r\n\r\nNikolas Hulewsky (33:50.328)\r\nSure.\r\n\r\n\r\nNikolas Hulewsky (33:57.176)\r\nWell, what I meant was if I'm a person, I'm traveling from China, I'm going to have to go to one of these probably main hubs. And then from there, I'm going to go through customs and then I'm going to have to, let's say I'm trying to get to Knoxville. I mean, I'm probably going to have to take one or two more flights or the railway to get to Knoxville, right? But I've got to go through all of these other processes because there aren't just direct flights to Knoxville every day. They got to go to\r\n\r\n\r\nCraig Fuller (34:14.559)\r\nCorrect.\r\n\r\n\r\nThat's right.\r\n\r\n\r\nNikolas Hulewsky (34:24.056)\r\ngroup people together is like, okay, now we have enough demand. Well, now we can get a flight to Knoxville out. It's the same thing with these shipping containers. got to make sure you, yeah, hubbins, geez.\r\n\r\n\r\nCraig Fuller (34:29.695)\r\nIt's a hub and spoke network. mean, so essentially what's happening, Nick, is that your freight, and so let's say that our container goes into this warehouse in Southern California and, you know.\r\n\r\n\r\n9,000 of our backpacks are gonna move into Ohio, 1,000 are gonna stay behind in LA. They may in that warehouse have, or on the West Coast, I should say, they may in that warehouse have a San Francisco, they're gonna send it to San Francisco. But for the most part, this stuff is gonna sit in that warehouse until it's ordered. And what's gonna happen is once that product's ordered, UPS or FedEx or US Postal Service are gonna pick up those orders, kind of put it on the truck, and they're gonna basically send it into their own hub and spoke network.\r\n\r\n\r\nIn the case of UPS, it's probably going by truck and all of these on the West Coast are going by truck. But let's say that you kept all your freight in this warehouse in Southern California, then it may be picked up by FedEx and they're going to haul it in air freight. So basically it will leave the warehouse, will go to along, you know, the, don't know where FedEx's hub for Southern California is. Maybe it's in Ontario, the Ontario airport or something like that, ONT.\r\n\r\n\r\nNikolas Hulewsky (35:19.331)\r\nYeah.\r\n\r\n\r\nCraig Fuller (35:45.343)\r\nand they'll load it on a freighter from Ontario, California to Memphis to, you know, let's say the consumption's in Knoxville, it go from Memphis on an airplane to Knoxville or truck, be offloaded in the morning and then your cargo, your backpack would show up at a house because it'd be put on a local truck. A local delivery driver will then take it.\r\n\r\n\r\nNikolas Hulewsky (36:00.974)\r\nSee?\r\n\r\n\r\nCraig Fuller (36:16.031)\r\nHey Nick, you there?\r\n\r\n\r\nCraig Fuller (36:22.994)\r\nNick, are you there?\r\n\r\n\r\nNikolas Hulewsky (36:28.394)\r\nAre you there? Did I lose you?\r\n\r\n\r\nCraig Fuller (36:29.499)\r\nHey, yeah, like, I don't know what happened there.\r\n\r\n\r\nNikolas Hulewsky (36:32.3)\r\nSorry, okay. Okay, we're back. First of all, thank you. I'm an idiot for getting me up to speed on this. So now I can ask some more intelligent questions. The reason you said that this week is really the week the crap's kind of hitting the fan is because it's the first time that after the tariffs were implemented, people are gonna be paying these tariff fees. So the shipping volumes are way down. And another interesting complexity, I heard a lot of people's like,\r\n\r\n\r\nbalance sheet are in these containers. And so they can't necessarily even afford to pay the tariffs. Are we going to see a lot of people just leaving them in these bonded warehouses until\r\n\r\n\r\nCraig Fuller (37:13.885)\r\nYeah. I mean, this is a big risk for the broker, the customs broker. Is there effectively the credit? The US customs is not going to not collect. They're going to say, look, this shipment was trans shipped to the United States. We need to collect. And so now the forders are the ones on the hook for collecting these fees, these tariffs. And if they don't, then I don't know what the process is. This has been so\r\n\r\n\r\nNikolas Hulewsky (37:29.829)\r\nCraig Fuller (37:42.527)\r\nIt's been so long since we've seen these kinds of tariffs on this kind of product this fast. I don't know that we've ever seen a tariff increase at this speed and velocity. So I don't know what ends up happening if all of a sudden a forwarder ends up with a $10 million liability to US Customs and doesn't have the money to pay it. That very well could happen. I just don't know what the precedent is for that and how that would be handled between US Customs and border enforcement, like the collections process.\r\n\r\n\r\nNikolas Hulewsky (38:11.086)\r\nCheers.\r\n\r\n\r\nCraig Fuller (38:12.691)\r\nBut I do know that the forwarder is essentially responsible for collecting the money and then passing it on to the government. And if you don't have the product, I imagine if I'm running a forwarder operation, then I'm not going to deliver the product to you until I get paid, because that's my only leverage. Like, if you're not paying the fee, then why am I going to give you the product?\r\n\r\n\r\nNikolas Hulewsky (38:33.294)\r\nSo I understand the lag time now. I mean, that makes a ton of sense. And we're like, it's like a slow moving car wreck where you just, know it's.\r\n\r\n\r\nCraig Fuller (38:40.647)\r\nIt is a slow, and this is like, can see it in real time. And what's so incredible is we know that this is going to slow down the goods economy, the trucking, it's slowing down freight and international imports. And we have an eight week, six to eight week sort of visibility of what's to come. Like it's obvious that there's going to be a much slower level of shipments than we've seen in the past. And that's going to really impact.\r\n\r\n\r\nstarting at the ports and then sort of reverberating to the center of the country over time. And it's going to create potential for a large level of layoffs. mean, there's half a million people in the United States, or I'm sorry, half a million, there's nine million people in the United States involved in logistics. It's half a million people just in Southern California that are involved in logistics. you know, I...\r\n\r\n\r\nNikolas Hulewsky (39:33.614)\r\nJeez.\r\n\r\n\r\nCraig Fuller (39:34.729)\r\nWhat are we looking, if we've seen a 30 % drop off in imports, then we're looking at potentially 150,000 jobs getting cut just in Southern California alone. Or if you take the whole country and let's say that we see a 10 % slowdown in freight or a 5 % slowdown in freight, we're talking a half million jobs on those 9 million.\r\n\r\n\r\nNikolas Hulewsky (39:54.306)\r\nSo I pulled up, I just shared my screen because I get all of my data from you around this stuff. You retweeted this thing about the trade between the United States and China collapsing. And one of them is the container ship count and the container ship tonnage. And you can see just month over month, the used and total capacity dropping dramatically in April of 2025. I mean, it looks like February, March,\r\n\r\n\r\nI guess typically lower months just based on the limited data that I have in this graph, but this looks like an absolute dramatic drop from where we were.\r\n\r\n\r\nCraig Fuller (40:32.543)\r\nIt is. I mean, you're talking about cancellation of a lot of voyages. So, you know, if you think about what we're seeing right now in the Southern California in the trucking is that the volume of freight is about equivalent to the COVID low. And it's about to get much worse. And so we're going to see a pretty substantial drop off in coming coming weeks in terms of domestic freight moving across the country.\r\n\r\n\r\nNikolas Hulewsky (40:50.542)\r\nCheers.\r\n\r\n\r\nCraig Fuller (41:01.769)\r\nCompanies are indefinitely going to cut cost or definitely cut cost.\r\n\r\n\r\nNikolas Hulewsky (41:04.886)\r\nIt is.\r\n\r\n\r\nThis was another chart you shared. It's the China cancellations of US pork. Like you said, yeah, yeah, us. Like that's a massive drop because this is a retaliation, right? This is them saying like, okay, cool.\r\n\r\n\r\nCraig Fuller (41:12.233)\r\nThose are exports. Yep.\r\n\r\n\r\nCraig Fuller (41:19.679)\r\nIt's retaliation night. So China is like, look, is the largest, largest consumer of pork in the world. And it's like, look, we don't want any more American pork. So they're to go to Brazil or Argentina or Australia to get their pork. And the stuff is fundable. Pork is a commodity like, like other commodities and they'll get it somewhere else. And so now farmers are being impacted because they don't, they're losing their access to these export markets.\r\n\r\n\r\nNikolas Hulewsky (41:44.376)\r\nOkay, some some rapid fire questions before I get into the entrepreneurial side of things. What are the leading indicators KPIs that you look at right now that are telling you how good or bad things are? Are there any like, hey, I always look at X.\r\n\r\n\r\nCraig Fuller (41:59.133)\r\nI mean, we have our own data where we look at the volume of transactions. It's high frequency data, so it's showing the impact of it. And then a lot of this is anecdotal. mean, we're taking the challenges, the data, the data is high frequency and it's showing actually what's happening on the ground. But you're also like, okay, what is the decisions that entrepreneurs and companies are making? I want to know that stuff as well. So you need the context in addition to the data. The data that I look at are container outbound shipments.\r\n\r\n\r\ncontainer bookings, and then I look at the domestic trucking data to sort of see how it's tracking the volume of transactions to understand what's actually happening on the ground.\r\n\r\n\r\nNikolas Hulewsky (42:40.126)\r\nWhy the domestic trucking data? What does that tell you?\r\n\r\n\r\nCraig Fuller (42:44.127)\r\nBecause it's going to, I mean, this is what we do, right? are essentially, if you want to fill the pain, it's going to show up in the trucking data. imports, or American businesses are so insulated from some way of international markets, or typically think of themselves as insulated, that you won't see the stuff on the ground. If you want to know where the pain's at in the domestic economy, you'll see it in the trucking data.\r\n\r\n\r\nNikolas Hulewsky (42:52.824)\r\nHelp.\r\n\r\n\r\nNikolas Hulewsky (43:11.562)\r\nWhat industries do you think are gonna be hit hardest for?\r\n\r\n\r\nCraig Fuller (43:13.897)\r\nI think trucking and retail are the first, the top two. So, Apollo had this, report you just showed was Apollo talked about this, is that obviously if you're working in the logistics sector and trucking, when there aren't as many loads to haul or as much freight to haul, you're naturally going to see a pretty significant pullback in demand and therefore that's going to be pretty arduous for these companies. And then you look at retailers when you don't have inventory.\r\n\r\n\r\nNikolas Hulewsky (43:17.774)\r\nTrucking and retail.\r\n\r\n\r\nCraig Fuller (43:42.035)\r\nYou're simply not going to have the need for as many clerks or as many people in the warehouse and your sales are going to slow down. mean, consumers have a tendency to buy products, particularly sort of impulsive products, because they like what they see, but there isn't what they see here. There's an inventory stock out situation. It's just going to be a pretty big lag on sales. I mean, my own example is I have a small e-commerce business. Like I said, we sell model airplanes. We're not taking any orders from China right now or not ordering any product inbound.\r\n\r\n\r\nNikolas Hulewsky (43:42.316)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (44:03.384)\r\nSo.\r\n\r\n\r\nNikolas Hulewsky (44:10.19)\r\nCheers.\r\n\r\n\r\nCraig Fuller (44:11.869)\r\nAnd it means that at some point the models that we have, will run out of inventory and we're not replenishing it. So it means my sales will certainly drop. But the, if I don't pull back my orders, then I will lose money on every order. I'm not willing to do that. So I'm better off just shutting down it entirely, bleeding out what inventory I have, and then just sitting in a wait and see environment before I decide I want to go back into that and order product. And I think this is what\r\n\r\n\r\nNikolas Hulewsky (44:37.806)\r\nIt\r\n\r\n\r\nCraig Fuller (44:38.419)\r\nWhat most people don't understand is like every individual company is making their own decisions on what's best for them. And they're being very targeted and selected. think a lot, for the most part, the smaller companies are a bit unaware. Like you said, a lot of entrepreneurs like I'll figure this out when I get there, or this will be figured out for me because the policy will change. And we haven't seen that. You know, in fact, this weekend, Trump talked about how\r\n\r\n\r\nall of this tariff revenue that is being generated is going to help him offset income taxes. So if he believes, and like I'm not here to judge whether or not that we could achieve that, I don't know that we will, but let's suggest that he believes that that is the case, then the likelihood of him reversing his tariffs is quite small because if he believes that this is a way to offset revenue, again, take the judgment, political judgment away from.\r\n\r\n\r\nBut if this is something that he believes, then it suggests that he believes that keeping larger tariffs in force is important to achieve his objectives, and therefore that we will see some reprieve or reduction fills diminished because this position is such. And so the issue is,\r\n\r\n\r\nNikolas Hulewsky (45:38.982)\r\nyeah.\r\n\r\n\r\nNikolas Hulewsky (46:00.667)\r\nI mean, it has surprised me though that people have thought this was gonna blow over so quickly because the dude's been consistent on this for 30, 40 years. I mean, he's believed.\r\n\r\n\r\nCraig Fuller (46:06.781)\r\nSo let me, well, let me tell you firsthand. I mean, we talked to people in supply chain that have been tracking this stuff and we were telling our customers that buy our data, but also others, there is going to be tariffs. This is happening. You absolutely can bet your clock by tariffs are coming. And I think most people ignored that, said there would be reprieve. But when you looked at the first Trump administration, we did put significant tariffs on China versus where we were. And there was a 20,\r\n\r\n\r\nI think the blended averages on like 18 % tariffs on China went from zero to like 18%. And so, but it also, there was a lot of exclusions, certain products like toys were excluded in that. It very targeted and very specific. And I think that's, and look, we told everybody that tariffs are go up, you can expect it, but I don't, and so a lot of people just ignored that entirely. People who are sort of track this stuff daily accepted that tariffs would go up.\r\n\r\n\r\nBut I don't know anyone. In fact, we did a survey of importers and the highest we got, I think it was like a dozen importers or something. The highest, the lowest was like 10 % because I think everyone accepted the would-be tariffs on China. The highest was like 50%, but most of them were in that 10 to 35 % range. And only one of them was above 50%. We're talking about 145 % tariffs is unprecedented. This was so unknown.\r\n\r\n\r\nA lot of people say, he's been saying this for 40 years. Absolutely. But if you looked at the first Trump administration, what we got was something very different than what we have today. So it is easy to sort of play money boarded quarterback in politics because like I told you so, or you're an idiot for voting for this guy. But what I think people don't understand is there were a lot of policies in the first administration, in the Biden administration that had a different set of policies that were also bad for a lot of businesses that I think\r\n\r\n\r\nEveryone was like, this will be better because we'll get the first, we'll get Trump 1.0, it'll a little bit of chaos, a lot of drama, but at least these will be very business friendly acts, business family policies. And what we've got is something of the extreme nature of the Trump playbook is like no restraints. I don't think anyone expected, certainly I didn't expect, and I think other people who do this for a living, mean, Wall Street certainly didn't expect.\r\n\r\n\r\nNikolas Hulewsky (48:24.387)\r\nYeah.\r\n\r\n\r\nCraig Fuller (48:33.074)\r\nextreme levels that we're seeing right now. And so it's anybody's guess on how long these things stay enforced. I don't think it's sustainable. In fact, the treasury secretary said as much that the tariffs are effectively blockades, they're not sustainable and they will be reduced. The question is how long?\r\n\r\n\r\nNikolas Hulewsky (48:49.922)\r\nSo here's my question. I'm an entrepreneur. I don't have a massive business. I'm not Walmart. I don't have my own internal logistics team. I want to know from your perspective first, what can I do on the defensive end? And then offensively, is there anything I could be doing to maybe even take advantage of the current situation? So defensively, from your standpoint, let's say I am that entrepreneur who doesn't really even understand it yet. How do they even start thinking about, and it may be too late. I don't think it's too late, but.\r\n\r\n\r\nHow do they even start thinking about preparing for the chaos that will ensue?\r\n\r\n\r\nCraig Fuller (49:21.491)\r\nWell, think, so let me be very clear is global trade as we knew it is over with. And I had this conversation internally. It does not matter what we see in terms of short term. I think you have to recognize that the world that we grew up in where you had continuation of open free trade policies is over with. The political winds have permanently shifted\r\n\r\n\r\nThere is a, both parties, the Democrats and the Republicans are aligned that China is a major strategic threat. A large percent of the US population feels that China is a major threat and had been sold out by a lot of the quote unquote globalist. And so it will be politically unsavory for any politician to start promoting zero tariffs and free trade as a core policy.\r\n\r\n\r\nI think what we'll get is some level of movement back to a more reasonable set of tariffs, but I do not expect under any realm that we will see. And look, this is inevitable. This fraction that we're seeing with China, we've been talking about, I've certainly been talking about it since 2022, when the Biden administration was in office, that we are in the second global Cold War. This is the second Cold War and you...\r\n\r\n\r\nNikolas Hulewsky (50:43.63)\r\nCold war, yeah.\r\n\r\n\r\nCraig Fuller (50:47.411)\r\nthat means that free trade is a thing of the past. So you have to sort of stop living in the world of denial that this is all gonna resolve and just say, look, this is the new playbook, these are the new set of rules. It's the first thing you can do. Second thing to do is educate yourself. And so there's so many resources out there, like freightways.com, the business I run, we were constantly talking about the day-to-day nuances that are happening. If you're an e-commerce, it's the de minimis exemption.\r\n\r\n\r\nWe're providing context to that. And we're going very deep and there's a number of other resources, but educate yourself on what's happening. Obviously, X is a great resource because you're getting some firsthand accounts from people on the ground. You're also getting a lot of data.\r\n\r\n\r\nNikolas Hulewsky (51:29.902)\r\nSo you glossed over something that I think is incredibly important and I want just really quickly, the de minimis exemption. It used to be the products under $800 were what exempt from these tariffs. That is.\r\n\r\n\r\nCraig Fuller (51:36.063)\r\nMm-hmm. Correct.\r\n\r\n\r\nexempt from tariffs and basically they would just clear without any problem. Like there was no, there was no problem unless they suspected it was fentanyl or cocaine or pills or whatever. They weren't stopping these shipments. They were just like flowing through. And look, of all the things that we've seen, this is the one that I, I literally, when people arguing this is bad, I'm like, how can you even make a legit argument that we effectively what was happening is Chinese retailers or Chinese e-commerce companies.\r\n\r\n\r\nNikolas Hulewsky (51:44.706)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (52:10.318)\r\nTimu, Sheen, yeah.\r\n\r\n\r\nCraig Fuller (52:10.547)\r\nWe're going direct to the factory. Sheen and Tmoo were going directly to the factories. Alibaba is another example. Even Amazon started to get into this direct to consumer world. And they were going direct from the factory to the consumer. They were bypassing the American distribution importers, wholesalers and retailers. These jobs were all in China. We were basically helping Chinese companies compete against American companies because\r\n\r\n\r\nAs a U S company, I have sales and marketing costs. have R and D. I have branding costs. I have to pay my salaries. I probably have domestic warehouses and these Chinese e-commerce companies were like, I don't need all that. I can do this direct from China and I'll just use the U S postal system to basically trans, you know, trans ship my products and I won't pay $800. And the problem is like Walmart and Amazon, we're having to pay\r\n\r\n\r\nthe tariff on their container imports because the, Nick's backpacks, when you're bringing in 10,000 backpacks into the United States, you're paying a tariff on all those backpacks because it's more than $800. And so you were at a disadvantage to these Chinese companies because they're buying direct wholesale. You've heard the TV, buy direct wholesale. So they were basically bypassing you entirely. And it was, it's a real major threat.\r\n\r\n\r\nThey're not adding any jobs to the US. They're selling cheap crap to US consumers.\r\n\r\n\r\nNikolas Hulewsky (53:41.736)\r\nAnd then it gets worse. Then they leverage the most subsidized distribution channel in the country called the U.S. Postal Service. I mean, there's a reason why we're always talking about, man, we're losing so much money on the postal service. You know why we're losing money? Because we're subsidizing it. Yeah.\r\n\r\n\r\nCraig Fuller (53:46.601)\r\nThe US postal server. Yes.\r\n\r\n\r\nCraig Fuller (53:52.029)\r\nbecause the rates are lower and it's all set by Congress. under the, Congress sort of expects the postal service to set these rates, but it's all, all this stuff is sort of approved for the postals board of directors. And essentially you're right is they were using our own system against us. And the United States as a capitalistic society,\r\n\r\n\r\nhistorically has not differentiated between a foreign company and a domestic company in except with certain exceptions to this. And so these e-commerce companies are setting up shop in China, are using TikTok and Facebook and advertising their wares on that. And what they're doing is they're essentially letting American businesses and entrepreneurs sort of figure out where the consumer demand is.\r\n\r\n\r\nAnd what they will do is they'll take a product category. Let's say they want to be in model airplanes. They'll let me and others do all the work to figure out what sells. They'll go on and look at, these products are, and they're using all the data that's out there. These products are in high demand. Let's just go undercut every other U.S. business and entrepreneur who's done all the work to figure this stuff out. And let's just hammer it through by going direct. And\r\n\r\n\r\nWhat makes it so powerful is that the combination of these language learning models, like a chat GPT and grok and et cetera, can make it. mean, the old days you would see these, like the web has been around for, you know, for 30 years now. And you would look at these Chinese retailers and the language was so bad. You're like, I don't trust this person because I can't even spell the product correctly or like, how can I trust it?\r\n\r\n\r\nNikolas Hulewsky (55:39.342)\r\nYeah.\r\n\r\n\r\nCraig Fuller (55:47.081)\r\nBut what's happened is a lot of the people who run these businesses were educated in the U.S. They went to American universities. They speak fluent or fluent enough English, and they then compliment themselves with these language learning models and AI generators. they're really, all they're doing is they're taking U.S., basically U.S. marketing language on these product categories, copying it and pasting it over to their own. And now they're undercutting\r\n\r\n\r\nour American businesses to bring products in. And so that is why we saw over the weekend that Shein, and I suspect Timmy will do this if they haven't already done it, has raised their prices by over 300 % because they're trying to offset the cost of tariffs. so, but to me, the de minimis exemption was the most ridiculous part of our whole trade policy is we're letting foreign entrepreneurs cut our entire\r\n\r\n\r\nAmerican businesses and entrepreneurs out and they're not paying US taxes is the other thing. It's like, let's think of all the things we're losing out on. So this is sort of ground center to the argument that we need some level of trade restrictions and tariffs put in place. The de minimis exemption is the primary example. The problem is that we look at beyond that, we're getting into like products that manufacturers are using.\r\n\r\n\r\nUS retailers and this is so, this is too much too fast. Like that's the issue. Like that's my issue is not that we ended up with 145 % tariffs. We ended up with 145 % tariffs in two weeks. That's my problem. I think inevitably.\r\n\r\n\r\nNikolas Hulewsky (57:19.308)\r\nThat's your issue is it's too much too fast.\r\n\r\n\r\nNikolas Hulewsky (57:31.096)\r\nWell, because of everything you just described, right? It's like, hey, I've got to order this stuff six months, nine months in advance, and then they've got to make it, then they've got to ship it, and then they've got to bring it in, they've got to then ship it once it enters port. How do you shift all of those supply channels in two weeks?\r\n\r\n\r\nCraig Fuller (57:38.943)\r\nAnd I need to find alternatives. Yeah. Correct.\r\n\r\n\r\nCraig Fuller (57:47.743)\r\nYou can't, you can't. I think that's the problem. And I think the issue isn't the 145 % tariff. I think it had, if it had started at 20 % or even started, there was a paper, the economic advisor, White House's chief economic advisor, he leads the economic council, actually wrote a white paper before he got selected by Trump, which is our tariff should be measured and every single month go up by 2%.\r\n\r\n\r\nAnd it's sort of like the analogy in the movies where you see the guy takes a bunch of people hostage and is like, for every hour I don't get the million dollars I'm gonna assassinate, I got assassinated a hostage, which is like, if the pressure gets continues to mount, I'm gonna give you enough time to solve this problem for me. I can't shoot all my hostages at once, right? Cause the moment I do that, I have no leverage. But if you know, well, this is what happened is we shot all of our hostages at once.\r\n\r\n\r\nNikolas Hulewsky (58:38.958)\r\nBut you can, apparently.\r\n\r\n\r\nCraig Fuller (58:44.799)\r\nAnd now we have no hostages because there's no, there's like going to 200 % is meaningless at this point. If you've embargoed all trade, then what is the point of going to 200? Why not have it at 10,000 %? Cause it's not going to matter for the most part. And so the issue is that we have lost our leverage in the negotiations because now we have shot all of our hostages and the only thing that we can do is to reduce it or keep it. So we have no hostages. We're basically saying, look, we're not going to do anything.\r\n\r\n\r\nAnd we're just gonna hope that the Chinese blink before we do. And I would say that that's unlikely, frankly, because the Chinese are used to, can, Chinese can suffer a lot longer than we have, than we can here in America. We're just not used to suffering that long. We are a society built on much more instant gratification than what the Chinese are. Their whole system is built in terms of multi-decade planning. They don't have an election cycle. They don't have quarterly earnings they have to deal with.\r\n\r\n\r\nAnd so they can suffer a lot longer than we can. And the entrepreneurial class of Chinese entrepreneurs are such that they're so agile and so hungry that they're willing to sort of figure this out in ways that American businesses just aren't. And one of the interesting things, we've seen this emergence on TikTok of these Chinese entrepreneurs. And look, no doubt that TikTok is in part,\r\n\r\n\r\nor at least influenced by the Chinese government, which is an enemy. The PRC owns the parts of TikTok. This is not disputed, like this is known. And the algorithms are such that they're using these algorithms to influence, to give their manufacturers an advantage over American e-commerce companies.\r\n\r\n\r\nNikolas Hulewsky (01:00:17.538)\r\nThe CCP, yeah.\r\n\r\n\r\nCraig Fuller (01:00:40.913)\r\nAnd because they have all this data, they're to basically, if consumers are interested in these products, they're able to put these products front and center direct from the factory. So what's happening is American businesses are not ordering anything because they can't afford the tariffs. But these Chinese entrepreneurs helped with TikTok and AI models and their own sort of resources are saying, go direct to the factory, American consumer.\r\n\r\n\r\nYes, we'll deal with the tariff, but at least we don't have to deal with the markup. They've cut out their, you know, wholesale importer costs, which is, know, in a lot of this stuff comes in to importers, then they sell them to the retailers. So they've cut that out, they've cut out the retail costs, they've largely cut out the American distribution networks and logistics networks. And so that's why these products on Ti Mu and Xi Yen are like a fifth typically, or historically been like a fifth of what you would say, like 20 % of what you would see in an American store.\r\n\r\n\r\nbecause all those markups have been eliminated. Well, now what's happened is we've gated our own entrepreneurs. We've made it so that it's not profitable or has made it so that you cannot as an entrepreneur even compete. And so the tariffs in some ways have really benefited the Chinese more so, at least the Chinese e-commerce companies, more so than they're going to benefit America because it didn't block these guys from competing.\r\n\r\n\r\njust raised our cost. And again, I think we could have gotten to a place where we would have put real pressure on China had we had done more measured and targeted terrorists over time. But what we've done is we've shot all the hostages at once and we have no more hostages to shoot because effectively they're all dead.\r\n\r\n\r\nNikolas Hulewsky (01:02:34.92)\r\nOkay, let me ask you this. If you ever heard about Keynesian economics, in the long run, well, there's a saying in Keynesian economics, which is in the long run, we're all dead, which means that cool, we might get to equilibrium in the long run, but we make decisions in the short run. And the reason I bring that up is because yeah, in the long run, this trade imbalance will reach equilibrium and we'll figure out a new system. The old order is done, but we don't really know what the new order is going to look like.\r\n\r\n\r\nCraig Fuller (01:02:41.694)\r\nYeah.\r\n\r\n\r\nCraig Fuller (01:02:46.729)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:03:05.644)\r\nHowever, in the short run, we gotta figure out how to get to the long run, right? So from your perspective, your business is probably gonna do great because of this, honestly, because it's like, I wanna know what's going on with these imports, tariffs, et cetera. Let me go get more information. So your business is probably like booming. You're probably the exception to this. What do you say to most entrepreneurs who are like, how do I navigate this? Like, okay, I got educated. Like, what should I do?\r\n\r\n\r\nCraig Fuller (01:03:19.455)\r\nAbsolutely.\r\n\r\n\r\nCraig Fuller (01:03:28.573)\r\nYeah, it's interesting. So Nick, it is interesting. It's much like the networks do really well when there's a disaster like CNN or Fox or MSNBC or New York Times, whatever the media business is, always does really well when there's some type of crisis because people are suddenly interested in the topic that they largely ignored or didn't care about prior to it. And it's true that high frequency data, which we offer in news,\r\n\r\n\r\nin trade is all of a sudden now top of people's mind. And I can even see it in my own ex account is my account has exponentially grown like a thousand X amount of engagement almost on every single tweet compared to where I was a month ago. And so this stuff is top center. People are interested in it, but I sit in a really unique place where I'm able to see what's happening on the ground before it actually happens. And as an American business leader, and I have more than I do than just\r\n\r\n\r\nsupply chain data, I'm worried and very concerned about small business because I don't think anybody wins. I don't want to see entrepreneurs go out of business that are exposed to this, but I do think there is a likelihood that direct to consumer businesses of e-commerce businesses are at enormous amount of risk right now. I think a lot of American businesses in manufacturing are at enormous risk. And I think we have to ask ourselves, what is it we are actually accomplishing by doing this?\r\n\r\n\r\nthat the only people that can change this policy is the administration or Congress potentially convening, but that feels to me like it's gonna take too long to get resolution. Like I said, it appears as if Trump is committed to these tariffs because he believes it's the right thing to do. And so as an entrepreneur, you have to prepare yourself. I think there's a sense of denial that so many people have that this will get resolved. And what I am suggesting is,\r\n\r\n\r\nNikolas Hulewsky (01:05:11.928)\r\nSo what do you do in the short term?\r\n\r\n\r\nCraig Fuller (01:05:24.671)\r\nYou could not run a business in the world that hope is your strategy. You cannot expect that the government is going to bail you out. There's unlikely to be, if this is what we're seeing on the ground, very similar to COVID from a supply chain volume standpoint. We remember April, 2020, the panic, or maybe March of 2020, when there was this massive panic of like, oh my God, I'm in a business.\r\n\r\n\r\nand the world's shutting down and we're all gonna die. My business is going under. And what happened is the government came in and rescued us all with billions and trillions of dollars, Triple P programs, SBA programs, all of this. Well, let's imagine a world in COVID, take the health scare away, but just the business scare, and put yourself back in those positions back in early COVID of what you felt like.\r\n\r\n\r\nNikolas Hulewsky (01:05:54.648)\r\nYeah. Yeah.\r\n\r\n\r\nCraig Fuller (01:06:18.879)\r\nBut this time there is nobody that's going to come in on a horse with a bunch of money and save you. So you have to accept this is a permanent shift in trade. And I believe that's the case. And I don't believe whoever is in office. I mean, just the best example of this is when Biden was in office, he did not reverse a single one of Donald Trump's policy. Now, they went out and attacked the original trade war, trade war 1.0 that took place in 2018 and attacked Donald Trump.\r\n\r\n\r\nAnd when the Biden administration got to office, they had the chance to reverse his tariffs. Guess what? They didn't do it. So that's the best example that we are unlikely to see a wholesale reversal of this trade war. We may see a mitigation, but you may have to wait three and a half years to get that. And there is no evidence that the Republican Congress is going to step out in front of Trump and reverse them. So accept this as a permanent\r\n\r\n\r\nFracture now, what do you do about it? You got if you have suppliers that are in China You have to find alternatives the the in this was inevitable that trade between the US and China We're gonna get cut off. We told people it was probably gonna happen due to a Chinese attack on Taiwan You need to prepare yourself. It's probably gonna happen around 2027 but Trump just said I'm going with it. Screw it. I'm make this happen right now\r\n\r\n\r\nNikolas Hulewsky (01:07:39.854)\r\nScrew it. Let's accelerate the timeline.\r\n\r\n\r\nCraig Fuller (01:07:43.165)\r\nAnd there is a defense argument. I've heard that a lot of the China hawks in his administration have wanted this because they believe that this was inevitable anyways. And they would rather have this hardship and this reversal of this decoupling happen before there was an attack on China because they felt like that was the best advantage. And now this feels inevitable to cut off trade with China. Let's go happen, have it on our terms, essentially. The hardship is gonna happen. So except it is real.\r\n\r\n\r\nAnd it's not reversing to the level that it was before. Now, what do you do about it? You need to find alternative suppliers. You need to go to Vietnam, get on a plane, go to Vietnam. Now here's the reality is that Vietnam, a lot of the manufacturers in Vietnam are actually Chinese companies. So, and a lot of the source material comes from China, but at least you have an option. And that's actually good as an American entrepreneur because there will probably be less tariffs on Vietnamese goods, even if they're Chinese.\r\n\r\n\r\nNikolas Hulewsky (01:08:20.29)\r\nOkay.\r\n\r\n\r\nCraig Fuller (01:08:41.479)\r\nmanufactured or Chinese source material, then there will be on China directly. So at least that's one option. Go to that. Or if you can find Mexican suppliers, you're in gold. Because at that point, if you can get your products from Mexico, then geopolitically, the risks are more diminished.\r\n\r\n\r\nNikolas Hulewsky (01:08:49.656)\r\nWhat about?\r\n\r\n\r\nNikolas Hulewsky (01:09:01.698)\r\nWhat about India? I've heard India because India has like a fifth of the labor cost of China. They are in a dispute with China as well. They have some territorial disputes. So it's like they would be aligned geopolitically with the United States. There's not as much potential risk there. Democracy, all of those things, they're going like crazy. Is India a good market or is that? It is, okay.\r\n\r\n\r\nCraig Fuller (01:09:03.719)\r\nAnd here's a option as well.\r\n\r\n\r\nCraig Fuller (01:09:18.975)\r\nIndia is a great option. will say, this is my read on it, there's short-term options and there's long-term options. So India, Vietnam, Thailand, Malaysia, all of those are great short-term options. My recommendation is have a long-term plan. Let's imagine that, and trade wars do kick off hot wars. I think something like 14 of the last 21 sort of\r\n\r\n\r\nOne of the issues that you end up with is this concept and politics and history where an emerging superpower, you have a dominant hegemon and then you have an up and coming power and there's a flip that's going to happen because the up and coming power is about to take over and inevitably end up in a hot war. And I think it's happened something like 70 % of the times in history where you've had a dominant superpower that's been flipped. And so,\r\n\r\n\r\nMy read on it is that we're going to end up in an inevitable, some type of military conflict sometime in the next five years with China. And when that happens, it means US content, these shipping vessels that are coming across the world are likely to be targets for, become military targets. And so I would be thinking about, want to source my product closer to home.\r\n\r\n\r\nNikolas Hulewsky (01:10:23.939)\r\nReally.\r\n\r\n\r\nCraig Fuller (01:10:41.509)\r\nIndia is an option, I think you have to think of it as an intermediate or short-term option. And then I would be thinking, how do I build a supplier network that's closer to home in Mexico, Canada, the United States, perhaps Latin America, because once I've removed the over the world ocean transit, my products are much safer. Now, this requires a lot of strategic long-term thinking, perhaps requires a little bit more capital, but this is my recommendation to founders is be thinking about these strategies because this...\r\n\r\n\r\nissue with China could break out if there is massive distress in China. the United States, the Trump administration accomplishes what they want to, which is to sort of break the Chinese economy. That could actually make them more violent and more willing as sort of a nationalistic fervor to go out and attack Taiwan or attack the United States that we end up in some type of hot conflict. And like, I know that feels like if that happens,\r\n\r\n\r\nYou know, your little e-commerce company selling stuffed animals is probably not that important, but this is your business. You should take those steps.\r\n\r\n\r\nNikolas Hulewsky (01:11:46.936)\r\nSo from your perspective, I'm a small business. I'm working with a forwarder, right? Who's like handling all the logistics. It's because I don't understand how to do all of this stuff internationally. But I probably also don't understand how do I go and find, should it be Vietnam? Should it be Mexico? Should it be somewhere in South America? Like, where do you go? Do you just start Googling stuff? Or are there companies that kind of help? Is it?\r\n\r\n\r\nCraig Fuller (01:12:09.887)\r\nI mean, Google is the best resource. probably, if you are an importer and you have an existing supplier, chances are that you have friends that are also either in the same business or similar businesses that may have supplier networks of their own. They may have a contract manufacturer that's willing to take your business on. and I'm, know, Backpacks is an example. You probably can go to some of the trade fairs in Vietnam.\r\n\r\n\r\nThe nice thing is you can get on a plane, go to Vietnam and these suppliers, these contract manufacturers, these sources typically have these own shopping malls for manufacturers that you can walk into the trade fair and go in a network and try to find them. then like this is, imagine yourself when you went out and started your business 10 years ago, five years ago, whenever it was, you had to get on a plane or you had to find a source provider online to do it. This is a little bit more Wild West.\r\n\r\n\r\nThe nice thing is if you take these steps, may be, not every entrepreneur is doing this right now. In fact, think the majority of them are paralyzed. They don't know what to do. Some of them aren't even aware they have a problem yet. Not until they get that first tariff bill. They're not even aware that this is an issue. And so you have an advantage if you can make the time to go over and find source. And my recommendation is go to Vietnam to start with, because that is the, they have the, a lot of these are Chinese manufacturers that have set up shop in Vietnam.\r\n\r\n\r\nChina was planning for the rift of trade happening anyways, and so you're probably gonna find some contract manufacturers in your sector that could take this on that you'll find in Vietnam. And then what I would do is sort of say, okay, that's my short-term plan. My intermediate plan is to perhaps look at places like India. But I would also think about, what happens if things get really out of hand, then I need to find a supplier that's closer to home, and I would be looking strong about Mexico.\r\n\r\n\r\nNikolas Hulewsky (01:14:07.598)\r\nIs on-shoring just a fairy tale? Is it not gonna happen for the majority of these products?\r\n\r\n\r\nCraig Fuller (01:14:10.431)\r\nIt is a fairy tale to the degree that the Trump administration talks about everything's coming back to the United States. Like Nike shoes are going to be produced in a warehouse. don't want a lot of this manufacturing. We don't even want, I mean, the sweatshops, like nobody wants sweatshops in the United States. We don't have the labor. We have this problem with immigrants in the sweat, you know, coming over anyways and working in our sweatshops. These aren't respected businesses. I think the idea that we're going to bring apparel or shoes or toys back to the United States is a fairy tale.\r\n\r\n\r\nNikolas Hulewsky (01:14:27.064)\r\nThank you.\r\n\r\n\r\nCraig Fuller (01:14:40.369)\r\nI do think we need industries that are highly strategic to our economy and to our defense sector here. Things like shipbuilding, steel production, electronics, pharmaceuticals, medicine, medical devices, all of that should be onshore. That's what should be targeted. And I think that's what most people expect when we talk about trade.\r\n\r\n\r\nNikolas Hulewsky (01:14:48.782)\r\nSure.\r\n\r\n\r\nNikolas Hulewsky (01:15:02.894)\r\nWhat do you think happens if tomorrow they snap their fingers and they're like, psych, no more tariffs. Let's say it went back down to zero. What damage has already been done? Right? Cause like there's already, there's, there's a kink in the hose at the moment is has damage been done that can't be reversed? No.\r\n\r\n\r\nCraig Fuller (01:15:16.755)\r\nYeah, I don't think so. I think for the most part, there will be a, I mean, you're probably going to have a small, if we did see a reversal of the tariffs, and I don't see a case for 0%. I just think that's inevitable. That we see zero, like, first of all, there were already tariffs on China coming into the administration or coming into this year. Like if we go back to where it was before, then fine. But let's say we go down to 30 % tariffs.\r\n\r\n\r\nNikolas Hulewsky (01:15:30.604)\r\nI agree, agree.\r\n\r\n\r\nCraig Fuller (01:15:46.719)\r\nThat is a workable amount for most American businesses. You're talking about probably a 15 % sort of host. If you take about a 100 % markup, know, it's a 15, a 30 % tariff means you're gonna pay about 15 % of your markup. So that feels workable for most businesses. If we do that, then we've not lost anything long-term. There's still enough time. I think the question's gonna be how do the Chinese manufacturers respond?\r\n\r\n\r\nAre they gonna keep their higher prices? Because a lot of what's happened is these Chinese manufacturers now look at US importers like credit risks. Are they gonna trust you? Are you gonna have to front load the money? Where maybe before they would take a 20 % down payment on products, maybe they want 80 % down payment. So you've got some things that happened, but I think eventually we get back to where we were before. We all go about our business. The American consumer is really important. But I think what we're looking at is...\r\n\r\n\r\nwill be some slowdown in the economy. Will there be long-term pain? Probably not. But I don't think this is, even if we get some resolution, I don't think it's the end.\r\n\r\n\r\nNikolas Hulewsky (01:16:52.11)\r\nAll right, here's my last question. Most of this has been not doom and gloom, but more the downside risk. Is there any opportunity here? Is there any opportunity for somebody who's like, man, this is, maybe there's a lag, right? Six months before this gets really bad, so I can front run and there's an arbitrage play here, or even long-term like, okay, cool. I could set up some domestic manufacturing and X, Y, like how do you see opportunities in this space?\r\n\r\n\r\nCraig Fuller (01:16:56.467)\r\nYeah.\r\n\r\n\r\nCraig Fuller (01:17:16.979)\r\nYeah, like opportunities in the, in the world of chaos. mean, bonded warehouses, we've talked about them owning bonded warehouses being in that business means you can make bank. you probably would have wanted to own those six months ago, cause I imagine the value of those have gone up tremendously. industrial warehouses, industrial real estate is really important. So if you have a warehouse, even though it's not bonded, you, can expect that that would do really well. If you run a business.\r\n\r\n\r\nNikolas Hulewsky (01:17:32.002)\r\nSix months ago. Yeah.\r\n\r\n\r\nCraig Fuller (01:17:46.319)\r\nthat can source products in Mexico. mean, one of the things that I know a lot of people did 20, 30 years ago is when China was just coming online, there were a lot of American entrepreneurs that built those trade relationships, those manufacturing relationships, and became basically an importer or a sort of manufacturing rep for Chinese manufacturers well before it became\r\n\r\n\r\nsort of in vogue, like figured out how to navigate it. And I think the same thing could be said for Mexico. if I, like if I were to, my son, who's 18, were to come to me and say, what can I do dad, to make a lot of money? My recommendation to him would be, figure out where these contract manufacturers are in Mexico, and go build these trade relations with those companies in Mexico, and then go to the manufacturers in these products categories of which,\r\n\r\n\r\nNikolas Hulewsky (01:18:38.018)\r\nsoon.\r\n\r\n\r\nCraig Fuller (01:18:43.625)\r\nthere's a lot of exposure, low margin, high production numbers where people are screaming. The toy industry is absolutely screwed. Toys are low margin products. Typically you have high run toys, high production toys, because they run in these product cycles, basically every year they have to produce new types of toys to drive demand.\r\n\r\n\r\nthe toy industry is absolutely screwed because the majority of these products are made in China. And so if I were to direct my son, I would say, go find some contract manufacturers in Mexico that produce toys and start there and then call on U.S. businesses and start talking about, can we be a partner for you? Because even if we get a resolution with China, as I just shared with you, every business owner has to be thinking long-term about\r\n\r\n\r\nWhat do I do if this becomes a hotter conflict or there is this, this 145 % doesn't, doesn't get relief. Or even if we see relief, it doesn't go back to 145%. I mean, here's the reality of it. We could see some short-term relief and then she, know, China does something to piss off the Trump administration and we're at 300 % tariffs. You just don't know. It's so unpredictable.\r\n\r\n\r\nNikolas Hulewsky (01:20:03.49)\r\nDude, I totally agree. This was amazing. Thank you for answering all my stupid questions. I really appreciate it.\r\n\r\n\r\nCraig Fuller (01:20:09.021)\r\nNo, is not stupid. This is such an unprecedented, uncharted time in history. But this is a new era in history. I think if someone that grew up in a sort post-Cold War world sort of came of age, we've never known a world where, mean, is, free trade is an exception, not the norm. I think that's what our generation cannot get our heads around is the fact that we've had globalization and global free trade throughout history, it's an exception. The fact that we haven't had\r\n\r\n\r\nglobal military conflict is an exception. We've enjoyed a blessed time in history that is, by the way, world of history goes, a pretty remarkable time to grow up. That world that we once know is no longer what our kids are going to inherit. It's going to be a fractured world with a lot more conflict. It's showing up on the front lines.\r\n\r\n\r\ntrade and supply chains at the front line of the Second Cold War. And just like when Russia and the United States or Soviet Union and the US were going out, is this stuff could, as we thought during the First Cold War, could easily boil over into a hot conflict. That risk is there. And we will certainly see proxy wars, which will be disruptive to trade. So take the time to educate yourself and take the time to start preparing for a new world.\r\n\r\n\r\nI don't want to use new world order because that sounds like really apocalyptic and like culty. That's not what I mean, but a new world structure that free trade just isn't a fact.\r\n\r\n\r\nNikolas Hulewsky (01:21:34.798)\r\nTriggered. Triggered.\r\n\r\n\r\nNikolas Hulewsky (01:21:43.759)\r\nWell, the only thing I would add to that is to say that the reason we grew up in that environment is because a bet was made. And the bet was if we open these capital markets to China, they will democratize. They will have exposure. They will become more friendly to us. Like, let's not make them a foe. Let's give them an opportunity to become trading partners. And that bet has not, it didn't go our way. I mean, we-\r\n\r\n\r\nCraig Fuller (01:22:01.085)\r\nAbsolutely.\r\n\r\n\r\nCraig Fuller (01:22:05.523)\r\nWell, I think Nixon did the right thing in the 1970s when we first opened up trade with China. mean, this was a country that brought so many, by doing so, we brought so many out of poverty. I think the mistake was actually made in the 90s where we said, because we were bringing China into the world and they had a reason to participate in sort of this American-led order.\r\n\r\n\r\nI think the mistake was made was assuming that if we truly gave them free trade status with the United States, that it would mean global prosperity for everybody, including Americans and American businesses. And what ended up happening is American CEOs focused on short-term quarterly profits, realized it was a massive arbitrage of taking their businesses to China. And in the process of doing so, transferred\r\n\r\n\r\nintellectual property. These American CEOs, and like I am all about American capitalism and I don't judge, I would have made the same decision because I would have been focused on short-term earnings even over three to five years thinking I'm doing the right thing for my shareholders and finding lower cost trade. And in the process of doing what people did not understand about the Chinese was they were essentially learning these industries. They took the American\r\n\r\n\r\nR &D model and go to market model that these American companies had done all of this market research and they were learning how these industries operate and essentially building businesses to eventually compete against these American companies. don't, again, I don't blame the CEOs of these businesses because they made the decision at the time that was in the best interest of their shareholders and what they thought was in the best interest of their enterprises.\r\n\r\n\r\nWe now know that was a massive mistake. We now know that what they've done is they've set us up to rip off our industries. China has a history of intellectual property theft, of hacking into computer systems, stealing the blueprints for the designs of the products, and letting American businesses chart the world in R &D only so that they can benefit. And that is where we're at.\r\n\r\n\r\nNikolas Hulewsky (01:24:24.684)\r\nYeah, and that's why we're in the position that we're in, unfortunately. man, this was awesome. Hopefully if things continue to, well, not even hopefully. I hope to talk again, man, because I know things are going to evolve and I just want to get your perspective on it.\r\n\r\n\r\nCraig Fuller (01:24:36.329)\r\nWe should anytime. It's going to be, I had this conversation with my team is like, this is not a, cause we're just looking at all the traffic associated with these stories. Like this is not a short term. This is not going to be done a short term. need to continue to focus on the bigger stories and how this plays out.\r\n\r\n\r\nNikolas Hulewsky (01:24:55.886)\r\nYeah, agreed. All right, We'll talk soon. That's it.\r\n\r\n\r\nCraig Fuller (01:24:57.727)\r\nAppreciate that.",
  "metadata": {
    "duration": "",
    "date": "2025-05-02",
    "platform_source": "Google Drive"
  }
}