{
  "episode_number": "84",
  "episode_title": "BEST Way to Make Money with Reddit In 2024 with Chris Koerner",
  "guest_name": "Chris Koerner",
  "business_name": "",
  "transcript": "﻿Nikolas Hulewsky (00:00.437)\r\nI can tell now that I've I mean, we know each other a really long time. I can tell how excited you are about an idea with how much you talk. Like you just had to get a drink because you had dry mouth. But I was watching the clock when we started. You spoke for like seven minutes straight. You usually don't speak for seven minutes straight, which is pretty cool. All right.\r\n\r\n\r\nChris Koerner (00:11.17)\r\nMmm.\r\n\r\n\r\nChris Koerner (00:18.634)\r\nI don't usually do that.\r\n\r\n\r\nChris Koerner (00:22.818)\r\nI try to be concise, like that was that was that was it. You know, that was the whole story.\r\n\r\n\r\nNikolas Hulewsky (00:29.247)\r\nWell, the problem with being concise on Reddit is like, you had to take, it says that you're experiencing issues. Did you get those fixed?\r\n\r\n\r\nChris Koerner (00:39.916)\r\nYeah, everything seems fine on my-\r\n\r\n\r\nNikolas Hulewsky (00:41.257)\r\nOkay, cool. Anyways, the problem with Reddit is you've spent so many years on Reddit. So it's like, you got to catch people up to help them understand why it's a good idea. if you had to do that, all right, cool. Chris, got some cool ideas. Do you want to listen to silver tsunami idea, business in a box idea, CPA idea? Okay, so that's funny. I should have known you were going to do that. I know that this already exists.\r\n\r\n\r\nChris Koerner (01:03.842)\r\nBusiness in the box.\r\n\r\n\r\nNikolas Hulewsky (01:11.381)\r\nOkay, but hear me out. I think there needs to be a DIY service for side hustlers. And you started businesses, I started businesses. You've started way more businesses than I've started from scratch. It's a freaking nightmare to get your books cleaned up. It's a freaking nightmare to know where you are relative to where you thought you would be. What's your revenue? What's your cost per unit? What are your gross margins? Like don't know any of that stuff early on, you're just going.\r\n\r\n\r\nand you're trying to look for little signals so that you know whether or not you're moving in the right direction. But it's hard to get those KPIs. And even if you wanted to start getting those KPIs, it's like, all right, I need a CRM, but do I need HubSpot? Like, do I need to pay or do I need Salesforce? Do I need to be paying $1,000 a month for this stuff? Okay, I need accounting, but do I need QuickBooks? I need to incorporate, but do I need to go to LegalZoom? Do I need to have an attorney? Like, there's just all of these.\r\n\r\n\r\nof things that you go through as a business owner when you're getting up and running. But people like you and I have growth packet and we kind of have a tech stack that we use now, right? It's like, okay, we kind of use Google Sheets until we get to a certain level and then we kind of professionalize it. So I think that there's an opportunity for someone to create a business in a box that says basically, here are the tools that you need to get started and then here are the integrations that you need to create, go for people who are trying to do side hustles.\r\n\r\n\r\nSo like accounting, bank accounts, finance, invoicing software, all of those things. Cool. Here's Stripe, here's Google Sheets, here's the Zapier API or integration that you need to have that's pulling from those things. Here's how you can set it up so you can look at metrics. Great. Operations. This is how you're tracking customers. You can't afford HubSpot, but set up your Google Sheets this way so that you're getting customer information like this.\r\n\r\n\r\nInventory management. Okay, you're not ready for an inventory management system. This is how you should set up Google Sheets in order to get this stuff going. you need to, you're finally ready to incorporate. This is what you should do. Don't go to an attorney yet. Go to these websites, incorporate. This is how you start the bank account, et cetera. So it's, it's like very easy. Like anybody could create it using chat GPT, but you would go and look at the things that typical businesses use and then create this business in a box.\r\n\r\n\r\nNikolas Hulewsky (03:36.905)\r\nbecause entrepreneurship is only becoming more popular. People are only getting more more interested in doing side hustles. But the headache of getting stuff cleaned up, of having clean books, of understanding where your metrics are, is just such a problem that you kind of have to figure it out yourself. It'd be nice to just have a plug and play system that says, you're getting started, use this.\r\n\r\n\r\nChris Koerner (03:55.19)\r\nWhat does it look like? Like, it, is it a website? Is it an app? Where is it hosted?\r\n\r\n\r\nNikolas Hulewsky (04:00.317)\r\nI think what I would do, so this is where I would go, it would be like a digital product that you could sell and it would be a spreadsheet with a Google Doc. That's it. And so the Google Doc would sort of lay out, all right, here are the five areas of your business. Finance, and it would go through, all right, invoicing, accounting, revenue, right? And then there'd be links to here, the spreadsheets that you should use, how to set them up. And then there would be operations, cool.\r\n\r\n\r\nThis is how you set up your internal CRM, right? And then links of how to set it up. like, it would take a while to set up. Like we'd have to actually go through it and create it. But once it was created, it would just, it would be a very cheap version of kind of setting up your backend systems.\r\n\r\n\r\nChris Koerner (04:46.668)\r\nIt's so funny you bring this up because I've had over the last week, I've had a very similar idea. I wasn't calling it this, but it doesn't look like that, but it achieves the same purpose and it solves the same problem. Okay. This is just really funny because this is something else I've been excited about. so before I, before I go there, so,\r\n\r\n\r\nNikolas Hulewsky (04:59.082)\r\nGo on.\r\n\r\n\r\nChris Koerner (05:08.652)\r\nHow is it customized to whatever niche or industry that person is doing? Or is it broad enough to where it applies to basically anyone?\r\n\r\n\r\nNikolas Hulewsky (05:16.405)\r\nI think you can upsell those things, right? Like if you're trying to make more money off of it, but it would just be broad. And we would say that in the disclaimers, like, look, you're gonna have to tailor this, but these are the systems that you could use. You're gonna have to tailor anything. If you bought QuickBooks, you're gonna have to tailor it. If you bought HubSpot, you're gonna have to tailor it. If you bought Jobber, like any of these other systems, you're gonna have to tailor it, right? So it'd be the same as any of those other systems.\r\n\r\n\r\nChris Koerner (05:21.282)\r\nOkay.\r\n\r\n\r\nChris Koerner (05:42.698)\r\nIt's funny because it reminds me of who was someone in my family, my aunt or something. She always says, you know, I might've screwed up at raising my kids, but I, they don't make a book about this. Like how to parent one-on-one. It's kind of like that. It's like a business version of that. Like how to business. okay. Love it. Definitely solving a problem. Here's what I was thinking. the new year's coming. A lot of people are going to have a new year's resolution to start a business, right? Or a side hustle, right?\r\n\r\n\r\nNikolas Hulewsky (05:56.543)\r\nYeah. Right.\r\n\r\n\r\nChris Koerner (06:15.02)\r\nThe problem that you outline absolutely exists. How to incorporate, where to incorporate, which one to choose. Do I even incorporate? Do I need a customer first? Do I need a business plan first? hear Chris talks about this. Nick talks about this. Alex Hormozi talks about this. what do I do? Where do I start? I thought about doing like an eight to 12 week email based cohort, like a course. Okay. But every Monday that email is going to show up and it's, it's an email with instructions, like a to-do list, but it's also an accountability part.\r\n\r\n\r\nNikolas Hulewsky (06:35.829)\r\nMmm.\r\n\r\n\r\nChris Koerner (06:44.898)\r\nOkay. And then on Sunday you get another email for follow up with a form to fill out saying like, here's what I did. I found my first customer this week. I got a logo this week. I got a website this week and there is a cost to it. Let's say it's 200, $400 for the whole thing. It starts on January 1st, but every week you fill out the type form or whatever it is and say, I did all my steps. get a ref you get refunded a proportional amount. So by the end of it,\r\n\r\n\r\nIf you do everything you're supposed to do and you that means you actually have a business with paying customers and as a cherry on top, you didn't pay anything for any of that. You get a full refund. But statistically speaking, most people would not do most of it. They would flame out after a couple of weeks. So it could still be a profitable business while still earning the goodwill of doing it for free. Because if you do what you say you're going to do, it's free. If you don't, you pay.\r\n\r\n\r\nNikolas Hulewsky (07:43.583)\r\nSo you know who Jason Calcanis is on? So he has an accelerator incubator. can't remember exactly what it's called, but it's Founder University. think it's the name of it, Founder University. And it costs money. But if you complete it, you get a full refund because his thing is like, hey, I want you to have skin in the game. And it's kind of like that, right? But he's not really doing it to make money. He's trying to get people into his ecosystem, et cetera.\r\n\r\n\r\nChris Koerner (07:47.571)\r\nyeah, it's, yeah, similar to that.\r\n\r\n\r\nChris Koerner (07:54.897)\r\nMm-hmm\r\n\r\n\r\nChris Koerner (08:07.01)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (08:12.405)\r\nWould you make money off of this or are you just like, would be a thing.\r\n\r\n\r\nChris Koerner (08:16.994)\r\nIt would be a cool thing to do and it would make money.\r\n\r\n\r\nNikolas Hulewsky (08:21.301)\r\nYeah, because a certain percentage of them are not and it's not all or nothing, right? You may get 50 % of the way done and that's interesting. What would you charge?\r\n\r\n\r\nChris Koerner (08:28.096)\r\nAnd I think people should be rewarded for doing some of it and not necessarily all of it, you know? I don't know. I don't know. I would think it would be in the hundreds.\r\n\r\n\r\nNikolas Hulewsky (08:40.181)\r\nI think that's a freaking great idea. And that for me, the business in a box thing would be probably building out some programmatic SEO around like, what should I use to, you know, start my business? Yeah. When should I incorporate like all those Google terms? And I'm sure that there are like other high ranking things, but it would just be, hey, here's like the $50 packet.\r\n\r\n\r\nChris Koerner (08:41.012)\r\nit.\r\n\r\n\r\nChris Koerner (08:52.897)\r\nMmm. that's a great idea. That's a great idea.\r\n\r\n\r\nNikolas Hulewsky (09:08.181)\r\nDIY, like do it yourself, business in a box. And then it would just literally just be passive. You create it one time and it's just spitting out based on programmatic SEO.\r\n\r\n\r\nChris Koerner (09:17.186)\r\nThis is just such a perfect example of how like the distribution idea can make the business idea a thousand times better because I think programmatic SEO would be just the most brilliant way to build that business because of all of the endless combinations of words and sentences. How do I incorporate my barber business, tree care business, HVAC business, plumbing business?\r\n\r\n\r\nJust for that one, just incorporate, have thousands of landing pages, thousands of search terms that people are searching. How do I find customers for my thousand? how do I, you have thousands of questions that people are searching for and then thousands. So theoretically you have millions of landing pages answering questions that people are asking that could all have a link to a paid product.\r\n\r\n\r\nNikolas Hulewsky (10:02.783)\r\nWhat's been really fun about the last six months is this was a whole world that I didn't know. And I'm still way behind where you are, but it's fun to have these conversations now where I'm somewhat understanding some of the distribution and growth hack portions of it. Because then I can actually add value. Whereas before it was just like, that sounds like a cool idea. But the distribution piece, like you said, is so important to understand. OK, cool. Great idea. How are you going to get it out there?\r\n\r\n\r\nChris Koerner (10:14.038)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (10:29.932)\r\nYeah. man, that's really good. I like that a lot.\r\n\r\n\r\nNikolas Hulewsky (10:35.901)\r\nChris. All right, you're up.\r\n\r\n\r\nChris Koerner (10:38.594)\r\nAll right, let's see. Let me look at this.\r\n\r\n\r\nAll right, I want you to give me some ideas. I'm gonna plant you with an idea and I want you to give me some implementation ideas.\r\n\r\n\r\nNikolas Hulewsky (10:49.471)\r\nHit me with your best shot!\r\n\r\n\r\nChris Koerner (10:52.876)\r\nSo I found a website that's really, really interesting and I wanna monetize it somehow, but I'm coming up short, okay? No, it's called distilled.io and what distilled does, I'm gonna pull it up. It notifies you if something on a website changes, okay? Now, you can tell by the way they're pushing.\r\n\r\n\r\nNikolas Hulewsky (11:00.063)\r\nIs it called Wikipedia?\r\n\r\n\r\nChris Koerner (11:21.29)\r\ntheir website that most people use it for ticket sales. Okay, so as a family, we are going to the Alabama Auburn game at the end of the month, the Iron Bowl. And I'm cheap. I don't want to buy tickets when they're 200 bucks each, I want to buy them when they're 100 bucks each. But when are tickets the cheapest? Now, if it's a concert ticket, statistically speaking, you're better off waiting until the last minute. But with sports tickets, it can it can range like Auburn if they're ranked in two weeks, they're gonna be more expensive.\r\n\r\n\r\nIf Alabama loses the next two weeks, they're going to be cheaper, right? You just, you can't really know. You don't know when the best time is to buy them and ticket master and stuff. I've been all those guys. They don't really have services for this because they're that doesn't work to their incentivization. They want you to buy right now. And that's why they're always going to tell you going fast price will be higher tomorrow. Right. And so you can use distill the IO to notify, to be notified when a ticket price drops.\r\n\r\n\r\nfor any event, for any section, for any seat, super cool. It's a little unintuitive to use. Like it's kind of tricky to use. But I think there's a world where you could build a SaaS on top of this, or you could just build like a ticket notification system that's built on top of Distil.io. And it's stupid, simple, easy to use. Maybe it only works on Ticketmaster, only works on StubHub. It's $10 a year or something cheap. Have you heard of Scott's Cheap Flights?\r\n\r\n\r\nIt's kind of like that. It's like 70 bucks a year and it's kind of an insurance policy. You're like, I don't know how many times I'm going to travel this year, but if I get an email and it says the flights to Hawaii are 300 bucks right now, we're going to go to Hawaii and I'm going to pay 70 bucks a year just for the opportunity to save, you know, a thousand dollars on tickets. It could be something like that. like tens of dollars a year for a service. but more broadly speaking, how could you use this to make money?\r\n\r\n\r\nNikolas Hulewsky (13:14.229)\r\nWho's using distilled IO right now? who they're, they have to be a company,\r\n\r\n\r\nChris Koerner (13:20.244)\r\nMm-hmm. Like, what-\r\n\r\n\r\nNikolas Hulewsky (13:21.141)\r\nI'm that they have a target demographic or a target customer.\r\n\r\n\r\nChris Koerner (13:27.552)\r\nThat's what I was saying is like it, the messaging on their website is like towards the ticketing websites, right? But yeah.\r\n\r\n\r\nNikolas Hulewsky (13:35.509)\r\nOkay, so take ticketing out of it. Why would I care if a website updated? Here's the problem. If I cared enough for a website, like an update on a website changing, I'm probably gonna be on their emails list. I'm probably gonna already be in the, like let's say it's a food product that just dropped or it's a new blog article that.\r\n\r\n\r\nChris Koerner (13:55.274)\r\nMm-hmm. Mm-hmm. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (14:03.625)\r\nthat Chris posts, right? Like I'm gonna be on his email, on his email list. So it has to be something where you're interested enough to wanna know about it, but not so interested, or there's not a mechanism to update people via a newsletter.\r\n\r\n\r\nChris Koerner (14:06.242)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (14:18.498)\r\nSo I'll give you, yeah, I'll give you some ideas. So let's say it's a Shopify site that sells a product that people obsess over. Text to snacks. We have some pretty advanced apps that will notify people when something is back in stock, if they choose to be notified. But I would bet that most Shopify stores don't have this. You go look, they're out of stock. At some point or another, they go back in stock and that just happens when some random employee, maybe a VA,\r\n\r\n\r\njust changes a number in the settings and hit save, then it goes back in stock. Most Shopify stores do not have a feature that will automatically notify people. Now, it might go in their next newsletter like days later, but it might be sold out again by then. So it could work for niche products like this or websites. Like let's say you're a major fan of some merch store or a food store that doesn't have a feature like this. It could work for that.\r\n\r\n\r\nNikolas Hulewsky (15:12.725)\r\nIt has to be a business that is capitalizing on being early. So like one of the things that come to mind for me are a trading company. Let's say somebody who wants to invest in certain businesses. Publicly traded companies have to disclose every quarter and every year their financials and those are 10 Ks and 10 Qs. And so when the 10 K is published to their website, because it'll be published to their website, how do you know that it's being published? I mean, this could be one of those things where you automatically get a notification.\r\n\r\n\r\nChris Koerner (15:19.062)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (15:22.498)\r\n.\r\n\r\n\r\nNikolas Hulewsky (15:42.813)\r\nyou go and read through the 10 K or the 10 Q. And if you're first to go through and actually pull out anything that's that's important, you can have a trading advantage. So that's one way although I'd have to believe that there are already things that you can do like that. You know, it'd be interesting. Sorry, this is like, if you're a searcher, and you're trying to buy a business, you could set up a bunch of like, let's say you find like different target businesses, just different parameters.\r\n\r\n\r\nAnytime that there's a change on their website relative to address pricing leadership teams, I mean, that could be a signal to you that something's going on with the company. I'm with you, man. There has to be something there. There has to be something.\r\n\r\n\r\nChris Koerner (16:24.364)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (16:29.218)\r\nSo I'm going to read you some ideas that they that they provide on their website. So legislative tracking, track budget, find grants, build tracking, get legislative calendar alerts. Obviously those websites are super outdated. Enterprise solutions, medicine and health, jobs, monitoring new jobs being posted, legal tracker, patents, real estate, track zoning laws, stuff like that. So basically any of these ideas you could build a business on top of.\r\n\r\n\r\nRight? Like you could build a small SaaS tool that just tracks zoning law changes in Los Angeles County. Right? There's a lot of people that would really need and want to know that as soon as possible, or it could cost them a lot of money. investigative content strategy, spying your competitors, ticketing, cybersecurity. And I was just thinking more broadly speaking as a framework framework. I love reaching out to companies like this.\r\n\r\n\r\nand asking whoever is reading my email, how are people using this? In what creative ways are people using this? So do you remember when I used to have an RV that I rented out? So I rented it on RV share and I was getting my MBA at TCU at the time, which meant I had a lot of free time on my hands to surf the internet while I was supposed to be learning. And I distinctly remember sitting in class, making a spreadsheet, running all these searches on RV share, trying to\r\n\r\n\r\nreverse engineer what the most in demand type of RV was. You've got a class A, which looks like a tour bus, class B, which is like a converted van and class C, which is like a motor home. It's like an RV with the engine attached, right? And I distinctly remember saying, all right, Dallas County for this weekend, how many class ABCs are available for rent this weekend? No notice. All right. There's 86 class A's there's 82 class B's and there's nine class C's. Huh?\r\n\r\n\r\nInteresting. Well, maybe there just aren't that many classes listed. Let's look six months out where few people have booked same search. there's 92 class A's, there's 90 class B's and there's 60 class C's. Interesting. So there's just about as many listed in each category, but class C is being rented by far the most. So if I want to go out and buy an RV, let's say I haven't yet, I'm going to buy a class C and you can do this with Airbnb. What types of Airbnb's we've talked about this in the past.\r\n\r\n\r\nChris Koerner (18:55.104)\r\nyou can reverse engineer just on Airbnb's homepage, what is the most in demand just by searching for this weekend and for a year out, right?\r\n\r\n\r\nNikolas Hulewsky (19:02.97)\r\nOkay, I think I have an idea for this. I, yeah, no.\r\n\r\n\r\nChris Koerner (19:05.664)\r\nOkay, hold it. sorry. All right. So I made this big spreadsheet and I was able to get really close on like, what is the best type of RV to buy? Because then you look at the price and you're like, huh, the price for all three of these RVs are about the same, but a class C is rented four times as often. Why would I buy something else if I'm doing this as a business? Now, if I want to buy an RV for my family, it's another story. And so I reached out to RV share at the time and they were pretty small at the time. And I said, Hey, I'd love to talk to someone.\r\n\r\n\r\nI know I sound crazy. You know, look at my spreadsheet. Am I, am I in the ballpark here? Like, because I haven't bought the RV yet. I want to buy something that's good for my family. And also I can rent out. Turns out we wanted to buy a class C anyway. And then I sent it to this guy and he's like, Hey, can you have time for a call? I'm like, yeah, I guess. So I hop on the phone. He's like, where did you get this data? I'm like, from your homepage. He's like, this is exactly right. Like, I wish I could shout it from the rooftops like class C class C. Like if you want to do RV share as a business,\r\n\r\n\r\nclass CRVs and I'm like, cool, it worked. And he was like super impressed, but I'm like, literally I just ran searches on your website. So that is the framework here of just like, when you see something that's interesting, reach out to the business and be like, how can I make money with this? How are people making money with this? How are people using this in surprising ways? And you can come up with all kinds of ideas.\r\n\r\n\r\nNikolas Hulewsky (20:24.917)\r\nSo hearing you talk, I think this would be an interesting thing to do. Let's say that I'm a company that sells, I don't know, RVs, right? And I'm trying to figure out a better way to convert on my landing page or on my sales page, okay? I think what I would do is I would go and find 10 or 20 competitors and then just on their purchase pages, let's say, set up an automation for any time that there's a change and see if I can pull any patterns.\r\n\r\n\r\nChris Koerner (20:53.068)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (20:54.613)\r\nCause it's like if they're all, maybe they've all changed the color of the buy now button, or maybe they've all changed their script and they made it shorter, right? Or maybe they're all changing it to, mention financing as opposed to just paying cash. Like who knows what the changes are. It'll take some sort of analysis on your end, but if you went and pulled maybe 20 competitors and then you're just seeing the updates as they come in, it would allow you to make your conversion even better because you're seeing what\r\n\r\n\r\nChris Koerner (20:55.572)\r\nMmm.\r\n\r\n\r\nChris Koerner (21:00.279)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (21:22.483)\r\nwhat's working for other people because they're not changing those things on those high leverage pages unless it's working.\r\n\r\n\r\nChris Koerner (21:30.868)\r\nYes, but your idea just gave me another idea. dude, okay, so what is a local business? This isn't gonna be a guessing game. A local business that makes tens of millions of dollars a year that most people overlook, that has a huge marketing budget, that is just so willing to spend thousands of dollars a month on X, Y, or Z SaaS tool to give them a little edge. What is it? Car dealerships.\r\n\r\n\r\nNikolas Hulewsky (21:34.997)\r\nOkay, I'm in.\r\n\r\n\r\nChris Koerner (22:00.012)\r\ncar dealerships spend a stupid amount of money on marketing, direct mail, SEO, you name it. If it might work, they will buy it. Okay. And I know this because I have a friend now in the space who sells software to these guys and they spend like crazy. So dude, if I live, I used to work at a car dealership in Tuscaloosa, Alabama, right? If I'm a dealership owner in, if, if I own Nick Saban Nissan in Tuscaloosa, Alabama, I'm going to want to know\r\n\r\n\r\nhow many Nissan's my local competitors are selling, right? You could go into them and this distilled IO costs like 10 bucks a month, right? You could go into them and say, Hey, I'm gonna send you a daily report of all the cars that all of your competitors within a 30 mile radius sold the day before. Would that be helpful to know? my gosh, yeah. Now we can like, if all the Altima's are gone, then we can mark up our Altima. If there's a zillion Altima's on the market, then we need to cut our Altima prices. Like dude,\r\n\r\n\r\nHow much would they pay for something like that? Give it for free for 30 days. I'm going to install it all for free. They don't know it takes you like 10 minutes. I'm going to start sending you the reports and then we'll talk price in 30 days, but promise me you'll read the reports because it's going to be very valuable. Dude. And that or real estate, right? Like how many homes did you sell? But like real estate, a little trickier because it's in my experience, it's harder to sell into that. Whereas car dealerships have this marketing budget on their line.\r\n\r\n\r\nNikolas Hulewsky (23:12.873)\r\nThat's a great. Yeah.\r\n\r\n\r\nNikolas Hulewsky (23:17.257)\r\nReal estate would be a really good one.\r\n\r\n\r\nChris Koerner (23:27.938)\r\nline item marketing budget. That's massive. This just like, Yep, let's allocate three grand to this every month and see how it goes. Whereas real estate, it's a little more stodgy.\r\n\r\n\r\nNikolas Hulewsky (23:36.681)\r\nYeah, I I think I think the framework is literally where is there an arbitrage if you're quicker? If you're able to get information faster, where is there an arbitrage and then you can reverse engineer into any business that has that function or component to it and use and use distilled.io. I love it. How many ideas are we up to right now?\r\n\r\n\r\nChris Koerner (23:52.992)\r\nYeah. Dead.\r\n\r\n\r\nChris Koerner (23:58.454)\r\nToday, I think it's just two.\r\n\r\n\r\nNikolas Hulewsky (24:02.633)\r\nWell, I've had one and you've had two, right? The red idea.\r\n\r\n\r\nChris Koerner (24:05.57)\r\nyeah, yeah, yeah. So Reddit, business in the box, so three. And we're at like 26 minutes, because we're at 22 when I stop. Here's an interesting idea.\r\n\r\n\r\nNikolas Hulewsky (24:13.919)\r\nOkay, so I got it. I'm just telling you, I have a podcast at the top of the hour, so.\r\n\r\n\r\nChris Koerner (24:19.83)\r\nYou gotta hop.\r\n\r\n\r\nChris Koerner (24:23.392)\r\nOkay, here's an interesting idea we could try. We could split a segment in half and save it for the next week. We've never done that, right?\r\n\r\n\r\nNikolas Hulewsky (24:32.499)\r\nYeah. No, I'll be right.\r\n\r\n\r\nChris Koerner (24:35.81)\r\nYeah. Okay. Let's do it.\r\n\r\n\r\nNikolas Hulewsky (24:37.429)\r\nI'm for it. All right, do you want me to go next? Okay. All right. CPA or silver tsunami?\r\n\r\n\r\nChris Koerner (24:49.58)\r\nWell, you know the acronym CPA like gives me anxiety and makes me sleepy. So let's go sleep or tsunami.\r\n\r\n\r\nNikolas Hulewsky (24:55.541)\r\nAll right, let's go CPA.\r\n\r\n\r\nNikolas Hulewsky (24:59.637)\r\nSober Tsunami is the one I'm the most excited about, but I don't think we have enough time for it. All right. So Chris, what's the biggest expense that employers have or business owners have that they feel like they have zero control over?\r\n\r\n\r\nChris Koerner (25:04.002)\r\nOkay, good.\r\n\r\n\r\nChris Koerner (25:17.44)\r\nHmm. Taxes.\r\n\r\n\r\nNikolas Hulewsky (25:19.477)\r\nTaxes, taxes, right? What I'm about to say, I don't think is a new idea or necessarily a novel idea, but I think it is novel in its application. But traditionally you have a CPA and CPAs are telling you when to file. They're helping you with bookkeeping. They might even be helping you kind of go through some tax strategy, but usually tax strategy is like way down the list, right?\r\n\r\n\r\nI think there's space for a tax sherpa, specifically for entrepreneurs. And when you're talking to a CPA, how often do you talk to Ross?\r\n\r\n\r\nChris Koerner (26:00.994)\r\nas infrequently as I'm able to.\r\n\r\n\r\nNikolas Hulewsky (26:02.899)\r\nYeah, maybe once or twice a year and it's usually around filing deadlines, right?\r\n\r\n\r\nChris Koerner (26:06.944)\r\njust enough to not get audited and even so I've been audited.\r\n\r\n\r\nNikolas Hulewsky (26:10.003)\r\nYeah, it's but it's very rushed. You're like constantly feeling like you're under the gun. And where I think there's space is, again, not in bookkeeping and accounting, not in tax filing, and not in fractional CFO work. It's in helping entrepreneurs maximize their tax strategies. So here are some examples. What should I pay myself as an entrepreneur? There's rules around that. So you have to pay yourself something.\r\n\r\n\r\nChris Koerner (26:29.75)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (26:37.725)\r\nOtherwise you get audited because you're avoiding certain taxes, but you can't pay yourself too much. Otherwise you're not complying with the IRS rules. How should I handle retirement? Think of it like this. When you are a business owner, you could contribute to a 401k. Why is it important to contribute to a 401k?\r\n\r\n\r\nChris Koerner (26:48.662)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (27:00.468)\r\nI have literally a 401k. that an ultra marathon?\r\n\r\n\r\nChris Koerner (27:06.237)\r\nI don't know. That's the most responsible thing that I know nothing about.\r\n\r\n\r\nNikolas Hulewsky (27:07.573)\r\nSo good.\r\n\r\n\r\nA 401k allows you to put pre-tax dollars into a savings account that you don't have to pay. Listen to me, that you don't have to pay taxes on. So the idea is you're to have a lower tax bracket when you retire than you do right now. So if I have $50,000 and I'm a business owner, I'm probably going to pay somewhere in the ballpark of like 30%, $15,000 in taxes. If I put that money into a 401k after I retire, and then my tax liability gets down to maybe 15%,\r\n\r\n\r\nI just cut my taxes in half, right? Here's the crazy thing. You can contribute up to $23,000 a year to a 401k, but the company can also match 100%. So for you as the entrepreneur, your company that you own, so you can now, you have to make sure you can, you match everybody's, can't just match like the owners, like there's certain rules, but theoretically you could put $46,000 away pre-tax into a savings account that just sits there.\r\n\r\n\r\nChris Koerner (27:54.722)\r\nLike your company that you own.\r\n\r\n\r\nNikolas Hulewsky (28:12.501)\r\nThen you're like, well, that's not that much money. Like, okay, well, does your wife do anything in the business? Yeah, she does something in the business. Great. Pay her a salary and have it all go to the 401k and then match that 100%. All of a sudden you've got $92,000 that's gone away into a savings account that you just saved taxes on. You're not paying taxes on, right? And there are IRAs that you can contribute to. What?\r\n\r\n\r\nChris Koerner (28:33.154)\r\nI need to make a call.\r\n\r\n\r\nNikolas Hulewsky (28:35.221)\r\nBut then you can also pay your kids through the business. They can contribute to a 401k. You could also contribute to an IRA, which is different than a 401k. 401k has to be tied to a business. An IRA can be independent and you can contribute to that. But the IRA limit of contributions is $7,500 a year. So it's like, it is, it's, it's, well, that's the, this is the IRA. So this is the Irish. It's the Irish Revolutionary Association. Yeah.\r\n\r\n\r\nChris Koerner (28:53.642)\r\nIs that the rifle association? Okay.\r\n\r\n\r\nInternational, international rifle association. Okay, cool.\r\n\r\n\r\nNikolas Hulewsky (29:05.205)\r\nRight? Okay, so that's savings. Then there's how do I pay my spouse and kids? You can pay your kids and spouse through the business for doing actual work. Like, and it's not child labor laws, right? Or just knowing what are potential big write-offs? Okay, maybe I could write off a vehicle, but what else? You can write off a certain percentage of your mortgage, but there are very specific rules, phone, internet, meals, vacations. Then there's like real estate. How do I depreciate? All that stuff. So,\r\n\r\n\r\nLike in my mind, that's very different than, how do I file my taxes? And it's the tax Sherpa on your team. They would be separate from the person filing your taxes. Now, if you, if you did this, you got like, stay in your lane, do not start doing bookkeeping, do not do start doing tax, do not doing threshold. Yeah. Stay in this lane. And you are essentially the advocate for the business owner so that when the end of the year comes and the business owners having those conversations with his accountant, which we've all had, right.\r\n\r\n\r\nChris Koerner (29:46.422)\r\nYeah, yeah, yeah. There's plenty of money to be made in this lane.\r\n\r\n\r\nNikolas Hulewsky (30:02.197)\r\nyou're talking to your CPA and you're like, well, could I write this off? And they're like, maybe. They're like hemming and hawing. Or you're like, a friend of mine told me about this deduction. And they're like, yeah, yeah, that could work for you. And in the back of your mind, you're like, well, why didn't you know that deduction? You know what I mean? They're just not thinking about it. They have so many returns. So like this person's in your corner, they're looking for tax deductions, but you still got the check of your regular CPA who's like, that's good or bad, right? And then they can argue about it. And like, you don't have to argue about whether or not.\r\n\r\n\r\nChris Koerner (30:13.622)\r\nYeah. Yeah. Yeah.\r\n\r\n\r\nChris Koerner (30:29.174)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (30:30.773)\r\nIt's a reasonable tax deduction. And then so what I would do in terms of fulfillment, I don't think you need to be a CPA. I think you can use chat GPT and just the stuff that's already out there, but just focus on helping entrepreneurs save. From a pricing standpoint, I'd be like, either pay me $10,000 or 25 % of whatever I save you. And it's like very, very easily measurable. You get last year's tax returns, you just go through it.\r\n\r\n\r\nChris Koerner (30:55.244)\r\nYeah, I like the latter.\r\n\r\n\r\nNikolas Hulewsky (31:01.159)\r\nAnd then for distribution, I would just piggyback. I would go to the tax and bookkeeping firms and just say, like, hey, let me talk to your clients. Or I would also start, you know, be the Twitter, Instagram, YouTube tax guy where you're just putting out tax information. Like some of these accounts already exist, but I think just leaning into it and just being that, just being that niche where you're providing value to entrepreneurs who aren't yet rich enough to have like their on staff CPA. Cause like you get\r\n\r\n\r\nVery rich. Yeah, there's lots of options to you, but you gotta have a lot of money for that.\r\n\r\n\r\nChris Koerner (31:31.116)\r\nYeah, yeah. But there's there's a lot more in the messy middle than there is at the top. Anyway.\r\n\r\n\r\nNikolas Hulewsky (31:37.641)\r\nYeah. And then with things like ChatGPT, you can actually get to the answers of these things fairly quickly or at least point you in the right direction. yeah, you're not a JP Morgan Chase private banker who's like giving tax advice, but you're still saving people tens, in some cases, hundreds of thousands of dollars a year on taxes.\r\n\r\n\r\nChris Koerner (31:55.106)\r\nYeah, I love this idea, honestly, and I love the piggyback idea. but I think you have to change the incentive structure to get the CPA in your corner and say, my pricing structure is 30 % of any money saved, and I'm going to give you 30 % of that. So you're effectively going to get 10 % of everything that I saved this guy for just referring him. You don't have to do any work. I'll do all the work. And then he can be your advocate. Like, dude, I this tax Sherpa.\r\n\r\n\r\nHe's legit. Like I'm like in the weeds in your returns. Like I know a lot of this stuff. Like I know a lot of this stuff, right? Like, but like this guy, it's all he does and he doesn't charge you anything upfront. He only charges if he saves you money and then he's\r\n\r\n\r\nNikolas Hulewsky (32:37.853)\r\nlike the idea of that, but, but CPAs are going to be like, well, as a fiduciary, I have to disclose that I'm going to be getting a kickback and I don't feel comfortable. you're like, you'd have to figure out some other way for them to be incentivized to do it. Otherwise I just, I think it would get messier if, you start paying them, not because I don't think you should, like you should pay them. It would be way more valuable. You probably get way more customers, but I could just see a lot of CPAs kind of, this feels dirty. need to tell my client.\r\n\r\n\r\nChris Koerner (32:59.147)\r\nRight.\r\n\r\n\r\nChris Koerner (33:05.324)\r\nI can see that. if they, like, let's say you get ahead of that and say, we do advise you tell your client, that's it.\r\n\r\n\r\nNikolas Hulewsky (33:07.614)\r\nEh eh.\r\n\r\n\r\nNikolas Hulewsky (33:11.878)\r\nYou can do that. can. Yeah, you can definitely do that.\r\n\r\n\r\nChris Koerner (33:15.36)\r\nAnd then do you think honestly, do you think clients would mind? And I'm not this isn't the leading question. I don't know. Like, if my CPA came to me and said this, and he's like, hey, he charges 30%, he is going to give me a cut out of that. But you don't have to pay me, you just pay him. I don't think I would mind.\r\n\r\n\r\nNikolas Hulewsky (33:31.805)\r\nI would probably, if I was the CPA, I would probably just say, hey, this is a service we provide. And like not even tell them about the pricing structure. The biggest problem is gonna be the CPA signing their name on recommendations. And if you make the CPA feel like, hey, look, we're just an advisory service. You don't have time to go and find all these deductions. Let us do this. Like we'll do all of the work. And the payment runs through you and then you'll cut us our portion of it.\r\n\r\n\r\nChris Koerner (33:55.618)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (34:01.397)\r\nBut you have final say over what deductions actually get approved. think that actually probably the best way to do it because they're going to feel comfortable with it. The customer is going to feel like it's run through that agency and there's not going to be any real issues.\r\n\r\n\r\nChris Koerner (34:15.298)\r\nOkay, I like it. It's a good one.\r\n\r\n\r\nNikolas Hulewsky (34:17.705)\r\nGracias.\r\n\r\n\r\nChris Koerner (34:19.517)\r\nAlright, let me go to my notes real quick.\r\n\r\n\r\nNikolas Hulewsky (34:31.007)\r\nWe could do merry day or kill and save some of these segments.\r\n\r\n\r\nChris Koerner (34:35.65)\r\nHow much time are we at? 53,\r\n\r\n\r\nChris Koerner (34:41.154)\r\nDid you ever look at retention on if people stick around for a date or kill on ours? I never really looked at it.\r\n\r\n\r\nNikolas Hulewsky (34:47.477)\r\nThe problem is I don't have your podcast retention. I could go and look on YouTube, but I haven't.\r\n\r\n\r\nChris Koerner (35:01.482)\r\nOkay. I got one. It'll be a short one. So I talked to a guy last week that is making about $1.2 million a year. He's a handyman. Okay. He's making $1.2 million a year and he's doing something very interesting. His pricing model is very interesting and it could be replicated in many other industries. So he charges $750 a month as a retainer to be a handyman for homes that are like somewhat rural.\r\n\r\n\r\ncall it one to $3 million homes, nice homes, but not like mega mansions that like constantly need stuff done. And a lot of it is time sensitive. Maybe it's septic issue or something, but $1.2 million a year. Most of that coming from a $750 a month retainer, but then he still charges 120 bucks an hour for the actual work that he does.\r\n\r\n\r\nNikolas Hulewsky (35:54.933)\r\nWow. Why? Just so that you have access to him? Where he's like, hey, you're not going to be booked out three months?\r\n\r\n\r\nChris Koerner (35:56.386)\r\nWhat do you think?\r\n\r\n\r\nChris Koerner (36:01.578)\r\nYeah, yeah, because like the the best handyman are always booked out. So he kind of accidentally landed on this model. He's not like a super smart business guru. He's just like, listen, he just kind of said it once to a customer. And they were like, No, no, a customer said it to him. There's like, is there just something I can pay you every month, no matter what, to be sure that you answer my call and that you'll be here like within a week, instead of within two months, because I just can't wait two, three months for some to be handled. But\r\n\r\n\r\nI call the other handyman and they don't even pick up the phone much less get over here that week. And he just started throwing out, eh, a hundred bucks a month and then no pushback 200, 500. And he landed at 750 where he first started seeing pushback. Now he's making like insane recurring revenue from these people. A net like 30%. I would think of his net. It's his recurring revenue is like 70, 80%.\r\n\r\n\r\nNikolas Hulewsky (36:47.187)\r\nWhat? What's he making?\r\n\r\n\r\nJust recurring revenue. What do think he's?\r\n\r\n\r\nNikolas Hulewsky (37:00.287)\r\nBut like how many customers are paying? Like 10 customers, 100 customers? What do you think is?\r\n\r\n\r\nChris Koerner (37:04.898)\r\nHe didn't, I mean, I could pull out the calculator. He didn't give me exact numbers, but I would think it's hundreds of customers. mean, 750, that's 7,500, 75 grand. If it's a hundred customers, would bitch about it, put you about a million a year. So I would call it like 70 to a hundred customers paying him 750 a month.\r\n\r\n\r\nNikolas Hulewsky (37:23.605)\r\nThat's really smart. Why would you not do that?\r\n\r\n\r\nChris Koerner (37:27.104)\r\nI guess you... You... Yeah.\r\n\r\n\r\nNikolas Hulewsky (37:27.209)\r\nYou whittle down your customers, you get recurring revenue, so that there's more stability, you know who you're getting, they know who you're getting. That seems like a no-brainer for people.\r\n\r\n\r\nChris Koerner (37:39.042)\r\nHow could this be monetized outside of handyman work? Or could you partner with a handyman to like help him implement this pricing? Like a really good handyman or do it in a different type of home service business.\r\n\r\n\r\nNikolas Hulewsky (37:53.941)\r\nThe hard part is that you don't necessarily know the quality of the handyman, but I guess if you had somebody who you knew was really, really good and you were just like, let me help you do this, I think you'd have to do it neighborhood by neighborhood.\r\n\r\n\r\nChris Koerner (38:12.065)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (38:13.213)\r\nOr you could post to our Facebook marketplace, Reddit.\r\n\r\n\r\nI don't know, where would you market this?\r\n\r\n\r\nChris Koerner (38:21.686)\r\nYeah, mean, 750 is a lot. I think you could work up to that, but you could, I wonder if you could build like a SaaS tool that enabled business owners to charge this way, any price they want. And that could be the route.\r\n\r\n\r\nCause I think there are a couple of VC funded startups doing this. Like there's basically a whole class of idiot millennials like us that really don't know how to use a wrench. And there's a handful of VC funded startups serving us like home service startups where you pay like 50 bucks a month and then you have someone on call. So I wonder if there's a way to make that, to enable that for anyone, for any business owner.\r\n\r\n\r\nNikolas Hulewsky (39:04.181)\r\nHmm, I'm sure, yeah, I don't know. I'm sure that there is.\r\n\r\n\r\nI wish I had something to offer this.\r\n\r\n\r\nChris Koerner (39:10.53)\r\nI have thought this one through more.\r\n\r\n\r\nNikolas Hulewsky (39:15.381)\r\nI'm stressing because I have this podcast and I need to do a little bit of prep.\r\n\r\n\r\nChris Koerner (39:18.274)\r\nThat's fine.\r\n\r\n\r\nOkay, so should we not... did I completely screw the pooch? Should we not do kill, marry, or date or whatever?\r\n\r\n\r\nNikolas Hulewsky (39:27.441)\r\ndo marionator kill but if you don't want to do it we don't have to do it.\r\n\r\n\r\nChris Koerner (39:31.584)\r\nWe could do my idea and split the segment in half and just do one Mary Dator keel for everything on the second episode of this.\r\n\r\n\r\nNikolas Hulewsky (39:39.935)\r\nYeah, that's fine.\r\n\r\n\r\nChris Koerner (39:41.282)\r\nAll right, so we had Reddit, we had Business in a Box. What was the third one?\r\n\r\n\r\nNikolas Hulewsky (39:46.069)\r\ncpa distilled.io.\r\n\r\n\r\nChris Koerner (39:48.726)\r\nDistill was the third, then CPA, then Handyman.\r\n\r\n\r\nNikolas Hulewsky (39:55.189)\r\nMaybe we save the handyman for another time. I felt like that was a throwaway.\r\n\r\n\r\nChris Koerner (39:55.653)\r\nYeah, was weak. It was weak. Yeah, let's save that. We can plug it in somewhere else. All right, Nick, it's time for a Mary Dater Kill. We've got the Reddit growth hack, business in a box idea, distill.io, and the CPA idea.\r\n\r\n\r\nNikolas Hulewsky (40:18.613)\r\nOkay, who's going first?\r\n\r\n\r\nChris Koerner (40:19.34)\r\nWhat do you got? You.\r\n\r\n\r\nNikolas Hulewsky (40:21.813)\r\nFor me, marry the CPA idea, date.\r\n\r\n\r\nNikolas Hulewsky (40:30.313)\r\nMan, this is very selfish. distill, no, date, business in a box, kill, Reddit.\r\n\r\n\r\nChris Koerner (40:39.97)\r\nOkay, and then distil is just in no man's land, distil.io, the tracking software. Okay, what is your reasoning? Okay, okay. Marry, date or kill? I'm gonna marry the distil.io plan for car dealerships specifically. I really, really, really love that idea. I'm gonna date the Reddit growth hack idea and I'm gonna kill.\r\n\r\n\r\nNikolas Hulewsky (40:42.675)\r\nYeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (40:48.083)\r\nNo, no, no, you gotta say yours first and then we say our reasoning.\r\n\r\n\r\nNikolas Hulewsky (41:01.673)\r\nYeah, that's cool.\r\n\r\n\r\nChris Koerner (41:11.118)\r\nthe business in a box idea.\r\n\r\n\r\nNikolas Hulewsky (41:14.101)\r\nI'm so, it's so weird that we both married and dated our own ideas. So, distilled.io, just felt like I not yet can not wrap my mind around like, where would I use this? And how would I use this, right? Same with the Reddit growth strategy. It's just like, how exactly would I do this? I think they're both really good marketing strategies. I just don't know about how to build a business around those.\r\n\r\n\r\nChris Koerner (41:18.69)\r\nNo, it's just a coincidence.\r\n\r\n\r\nChris Koerner (41:42.482)\r\nThat's fair. I didn't like to still until we got to the very end of it and talked about the car dealership idea. I love that idea because you could start generating those reports for the car dealerships without them ever opting in and just start emailing them to them. That's your distribution strategy. Give it to them for free. Yeah. And then you send an invoice. That's why I love that business in a box. I killed that because it's just hard. I think it's it's just hard to wrap my mind around. And I I date the Reddit growth hack idea because I think it's underutilized and more.\r\n\r\n\r\nNikolas Hulewsky (41:55.839)\r\nYeah, that's actually a really good idea.\r\n\r\n\r\nChris Koerner (42:11.574)\r\nbusiness people, more capitalists should own their own subreddit so they could monetize it.\r\n\r\n\r\nNikolas Hulewsky (42:17.717)\r\nDone. I love it. That's a wrap, Jack.\r\n\r\n\r\nChris Koerner (42:18.635)\r\nAll right, that's a wrap.",
  "metadata": {
    "duration": "",
    "date": "2024-11-15",
    "platform_source": "Google Drive"
  }
}