{
  "episode_number": "194",
  "episode_title": "AI SERIES: 17 - Directories Are Back: AI Makes Niche Goldmines Easier Than Ever with Kirill Zubovsky",
  "guest_name": "Kirill Zubovsky",
  "business_name": "Scousy",
  "transcript": "﻿Nikolas Hulewsky (00:00.206)\r\nAll right, Qdaro, I'm super excited to have you back. We've already talked, we've done some AI stuff, but so now there's some trust here, there's some rapport here. And I wanted to bring you back, because I think that you're freaking smart. The way that you've built things is freaking smart, and I just want to learn from you, if that's okay.\r\n\r\n\r\nKirill Zubovsky (00:00.38)\r\nGo!\r\n\r\n\r\nKirill Zubovsky (00:19.666)\r\nLet's do it.\r\n\r\n\r\nNikolas Hulewsky (00:20.576)\r\nOkay, he says it's okay. So today what we're going to talk about are the hottest thing in the world, directories. Now I did an episode with Min Nguyen where he actually kind of outlined how he's doing directories. He started a pickleball court directory and that's aggregated all of the pickleball courts kind of around the country and has put them in one place. But think of a directory as a less flashy version of Yelp or a very niche version of Yelp. So...\r\n\r\n\r\nif we want to take all of the pickleball courts, for example, and place them into one directory. So now when somebody searches on Google, pickleball courts near me, there's a massive directory of pickleball courts that are near me. It doesn't have the same sexy UI that Yelp might have, but it has all the niche information that you're looking for. And if you start driving a lot of traffic to that, you can make a lot of money through ads and through clickable links and affiliates and all of those things. Well, in the past, directories were really, really hard to do because in order to get all that information, you had to know where to scrape it.\r\n\r\n\r\nNow Google, if a business was actually listed on Google, great, it was already in that format. You could go to Google and you could scrape the business listing because you knew exactly, you know, in this cell or this pixel, I don't know exactly how it's mapped. This is where this data set will be. But for those websites that weren't on Google, Google Business Profile, you couldn't do that. So they were kind of left off of these directories. Now with AI and using context, you can actually go to these websites, scrape their data, and list everybody, whether they're on Google Business Profile or not.\r\n\r\n\r\ninto these directories. So it's expanded the number of directories. It's made the niche offering even more valuable. And people are looking at this and saying, hmm, what can I scrape together? What kind of directory can I make? So I asked you, this is one of the ideas that I gave. was like, let's build a scraping tool so we can build a directory. And you were like, that's the easiest thing I've ever heard of, Nick. So yeah, let's do it.\r\n\r\n\r\nKirill Zubovsky (02:02.77)\r\nyou\r\n\r\n\r\nAll right, Nick, I got to be honest, I've never built a directory before. And that's why this is why I was so interested in this because I was like, I know I should have directories. I know they make money. And I mean, my buddy that I work with right now, we've always talked about all kinds of directories we want to have. So precisely for that reason, because it's still a good opportunity, you can still make money with it. And you just got to find something niche and hot and create that people will follow. And so I was like, yeah, this is going to be great. Of course. Yeah.\r\n\r\n\r\nNikolas Hulewsky (02:08.714)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (02:30.05)\r\nYeah. Did I do a good job? Did I do a good job explaining it? Okay, okay, cool.\r\n\r\n\r\nKirill Zubovsky (02:34.862)\r\nwe're going to like cut that out and just blast it all over YouTube. And it's going to be like, what is the directory? You know, you're going to edit to core it too, you know, for people who want to know what directories. No, it's golden. But my point is, it is in fact, still really hot in terms of businesses. And so was like, yeah, of course I want to learn how to do this. And if I'm going to learn it, we're going to do it live.\r\n\r\n\r\nNikolas Hulewsky (02:43.874)\r\nYes, yes, cool.\r\n\r\n\r\nNikolas Hulewsky (02:56.29)\r\nYeah, so there's already scraping tools out there. there's a company called Outscraper, which is what Chris and I have used in the past. And they basically take all the Google Business Profile data. They've got a database. So I can go and run lots of reports and get lots of contact information. But it says other websites that don't have it in the formatting that we need to build a scraping tool for, right?\r\n\r\n\r\nKirill Zubovsky (03:15.409)\r\nWell, let's just do it live and we can discuss it and I'll you know, I prepared a little bit just a teeny tiny bit and I'll show you because your audience is very often like not technical to mildly technical, right? So they're they're looking for tools that they can use that are going to help them move forward quickly without doing a lot of coding, hiring somebody. Am I right? Yeah. So I want to tell you\r\n\r\n\r\nNikolas Hulewsky (03:20.161)\r\nSure.\r\n\r\n\r\nNikolas Hulewsky (03:24.184)\r\nJust a teeny bit.\r\n\r\n\r\nNikolas Hulewsky (03:39.49)\r\nYeah, absolutely. That's them.\r\n\r\n\r\nKirill Zubovsky (03:43.611)\r\nLike how I thought about this when you said let's build a directory and just to show you like how fast it is to figure out how to do these things with no coding required. And the thing is I was in the gym this morning. I was on a exercise bike talking to Grok. Normally as one does, of course. Yeah, luckily I was the only one there. So I wasn't the weirdo in headphones just talking to Grok about random directory sites.\r\n\r\n\r\nNikolas Hulewsky (04:02.67)\r\nas one does.\r\n\r\n\r\nKirill Zubovsky (04:13.169)\r\nSo we actually built a tool for this with my friend and I'll show it to you later. It's called a Scousy MVP agent. But normally I would talk to my MVP agent that I tailored for myself. The only problem is I didn't build the voice mode into it. So it's not something I could use on an exercise bike. So I was like, you know what, let me see if Grok can do it. So I went to Grok, opened the voice chat and it's fantastic, by the way. If you haven't tried it, you have to.\r\n\r\n\r\nJust start asking random questions in voice mode when you like walk around with your dog in your headphones and just ask questions you can learn so much.\r\n\r\n\r\nNikolas Hulewsky (04:48.718)\r\nAre you using Grok in the Twitter X app or are you using the standalone Grok?\r\n\r\n\r\nKirill Zubovsky (04:54.885)\r\nI'm using the standalone app. Yeah. And in there you hit voice mode and it just starts talking to you and listening to you and responding to you. Right. Like and it works in your pocket.\r\n\r\n\r\nNikolas Hulewsky (05:06.338)\r\nLet me ask you this question, because I'm terrible with this. I think I know the answer. I'm just an idiot and I've never done it. The latency for me is a problem. And I know now like the timing is not the issue. Like we could dial up or dial down the latency at this point. But it's when I'm having the conversation that I do something like what I just did right there. Okay. I did that little pause. Do you hear that? The AI thinks that I'm done. And so it jumps in and it like throws off the rhythm of the conversation. How do you not do that?\r\n\r\n\r\nKirill Zubovsky (05:14.384)\r\nMm-hmm.\r\n\r\n\r\nKirill Zubovsky (05:26.608)\r\nMm-hmm.\r\n\r\n\r\nKirill Zubovsky (05:35.225)\r\nSo...\r\n\r\n\r\ndoing it on purpose.\r\n\r\n\r\nKirill Zubovsky (05:44.652)\r\nIt's gotten pretty good at giving you a few seconds to pause. So it's not trying to interrupt you right away. But the beauty is if it does interrupt you, you can just interrupt it right back and it knows to let you keep talking. And and it's not been that much of an issue. What's actually the issue is the reverse, where sometimes I'll ask you a complicated question. Like I'll say, hey, can you create a markdown document for me? And there is no\r\n\r\n\r\nNikolas Hulewsky (05:58.797)\r\nOkay.\r\n\r\n\r\nKirill Zubovsky (06:12.804)\r\nbranching yet where it can say sure I'll go make the document for you and then I'll tell you when it's ready it actually starts reading the document out loud to me in my ears and that's the annoying part because the document might be six pages long and here you are walking around listening to the eye and if you interrupt it then it will stop generating the document because it's literally spelling out what it's making for you\r\n\r\n\r\nNikolas Hulewsky (06:37.262)\r\nWhat about just saying in the beginning, like, don't respond to me until I say, okay, go, grok. Will that work?\r\n\r\n\r\nKirill Zubovsky (06:45.462)\r\nI've not tried that before. We should try that. You're pretty smart. mean, you're doing pretty well for yourself. So you got to be pretty smart to do that. so no, no, it's great. Let me show you though. Let me show you. I'll screen share. So I hopefully.\r\n\r\n\r\nNikolas Hulewsky (06:47.318)\r\nOkay, I'm very smart, girl. I'm very smart.\r\n\r\n\r\nNikolas Hulewsky (06:56.14)\r\nI am pretty smart. Anyways, alright, so that was a side note. So you're talking to Grok. Cool.\r\n\r\n\r\nNikolas Hulewsky (07:05.55)\r\nAnd while he's pulling up the screens share something that I did not do that I should have in the beginning. Coril's got over 10 years of startup experience, coding experience. He's started and sold multiple companies. If you want to hear his background and experience, you can go back to listen to the first episode that we did, I don't know, month or two ago at this point. But he's currently working on a company called Scousy, which you can just tell us really quickly, Scousy, what are you working on there?\r\n\r\n\r\nKirill Zubovsky (07:34.553)\r\nGosh, Nick, you're so two months behind. You're good. If you want to learn more. Yeah, no more. I'm just doing more because we can do so much more now. If you want to learn of to what I'm actually doing right now, you can go to QED.AM. And yes, it's a short URL and it's awesome. Yeah, thank you. So I'm\r\n\r\n\r\nNikolas Hulewsky (07:36.94)\r\nI'm such an idiot. You doing something new now?\r\n\r\n\r\nNikolas Hulewsky (07:53.39)\r\nOkay. Nerd.\r\n\r\n\r\nNikolas Hulewsky (08:00.312)\r\nQED.\r\n\r\n\r\nKirill Zubovsky (08:00.751)\r\nIt stands for quite easily done. But also in Latin, there is a phrase that it stands for that which needs to be discovered. And so we thought it was a really good name for actually, you know, discovering projects with AI. Scousy is now one of those projects. I'm working with a friend of mine, Carrie, and we are basically shipping whatever we want to exist in the world. We are using all these tools to just ship a project a week and\r\n\r\n\r\nNikolas Hulewsky (08:13.506)\r\ngreat name.\r\n\r\n\r\nKirill Zubovsky (08:29.038)\r\nAnd we've shipped a few and we have more of them in works. Whereas I'll just to give you some ideas, right? Like we, you know, we built Scalzi and Scalzi was there to basically provide you with development services that are augmented with artificial intelligence. So if you want to hire me, so to speak, to build your product, I'm not going to be doing it for three weeks. I'm just going to do put a bunch of bots in front of you and I'm going to let you talk to those bots and I'm going to take the information.\r\n\r\n\r\nNikolas Hulewsky (08:57.144)\r\nMm-hmm.\r\n\r\n\r\nKirill Zubovsky (08:58.159)\r\ncompile it together and then like 24 hours you're gonna have a product that is gonna be pretty well hashed out for you to do version one so you can share it with people. so, but as we were doing that, we're like, you know what's really difficult? Marketing is really difficult. And so Kerry is a writer and he figured out how to automate his writing. Like maybe we shouldn't say this on air, but he's not written a single blog post in like two months, even though he publishes a blog post a day.\r\n\r\n\r\nNikolas Hulewsky (09:16.099)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (09:25.01)\r\nAre these tools wrappers essentially? the ones that you're shipping once a week? Are they pretty much wrappers or is there a lot of code involved?\r\n\r\n\r\nKirill Zubovsky (09:32.502)\r\nIt very much depends. Let me finish the first point and I'll get back to this. But no, it's all good. what I'm saying is like, Kerry, you basically fine tune the model to where it knows what he likes in terms of writing and now writes blog posts for him where he just needs to accept them basically and like show it to go in this direction or that direction. And the funniest part is people have told them that they really enjoy his new writing and he's got more followers and more comments.\r\n\r\n\r\nNikolas Hulewsky (09:34.254)\r\nOkay. Sorry.\r\n\r\n\r\nNikolas Hulewsky (10:00.814)\r\nHmm.\r\n\r\n\r\nKirill Zubovsky (10:01.824)\r\nAnd he's like not touched his keyboard, you know, for the actual writing bit. And then we're like, well, this is cool. But YouTube, you know what you're doing? YouTube is really popular. And I have a podcast, but like I never have time to do it. I'm like, OK, what can we do next? I'm like, at some point I automated my avatar. So now we can just give it a text. There's a company called Hey, Jen, and you can go there and like you can create your own avatar with your own voice. using the yeah, their interface, though, isn't amazing. So I built like.\r\n\r\n\r\nNikolas Hulewsky (10:04.61)\r\nYeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (10:26.2)\r\nNo way.\r\n\r\n\r\nKirill Zubovsky (10:30.481)\r\nto your point, like, what do we do? Well, I built an interface for us where I can like direct the interface as to what I need my video to look like. So we've been experimenting with like, okay, can we have a content that's completely like autonomous where Carrie writes the blog post and then like we narrated the two of us, you know, bounce it off and neither of us are real. And that's gonna, I think that's gonna be amazing.\r\n\r\n\r\nNikolas Hulewsky (10:52.12)\r\nTwo months, two months, this is two months worth of not speaking and this is all the crap that you're thinking of.\r\n\r\n\r\nKirill Zubovsky (10:58.286)\r\nOh yeah, there's been more. So, but that's what I mean. That's what we're doing. And what we're going to do today, I told you there's going to be like a big reveal. This is already yesterday. I just can't show you tomorrow today because I'm still building it. But I'm going to show you how we're going through this by hand, essentially still talking to AI, but I already have workflows built where I just say, here's what I'm trying to do. And then I say, go.\r\n\r\n\r\nNikolas Hulewsky (11:00.183)\r\nmy gosh.\r\n\r\n\r\nKirill Zubovsky (11:26.025)\r\nMultiple AIs talk to each other locally on my computer trying to figure out like who's responsible for what because I essentially have a project manager that does the writing and the directing and I have a senior engineer that writes the plan and I have a junior engineer that does the building of the stuff. Yeah, and and This is where we're going where you just got to be like, all right computer do stuff And then you're go for a hike come back, know, like check in from your phone\r\n\r\n\r\nNikolas Hulewsky (11:41.944)\r\nShut up.\r\n\r\n\r\nKirill Zubovsky (11:54.996)\r\nAnd it's just going to be, I mean, I don't know.\r\n\r\n\r\nNikolas Hulewsky (11:56.601)\r\nSo is this, is that an agentic workflow?\r\n\r\n\r\nKirill Zubovsky (12:00.269)\r\nWell, I guess you would call it, I gentic workflow. Yeah. In proper terms. And there's a bunch of systems there that do that for fortune 500 companies. just like, I don't like the bloat. So I needed something that's very simple, something I can visually manipulate. And that does exactly what I want. So I was like, you know what, let me see how difficult it is. And it turns out it is both difficult and not difficult. So we'll see. Um, yes.\r\n\r\n\r\nNikolas Hulewsky (12:19.31)\r\nCheers.\r\n\r\n\r\nNikolas Hulewsky (12:24.206)\r\nOkay, well you're gonna show us tomorrow next time, but why don't you still show me why I'm still living in the past, yesterday, not only building the directory, but how we build the directory, which is I think what you're saying is, that's so yesterday, how we build the directory. So what am I looking at right here?\r\n\r\n\r\nKirill Zubovsky (12:36.129)\r\nYes. Okay, let's go back to gym. Let's go back to the exercise bike where I started talking to grok. And so what it is, and I say, Hey, grok, you know, I want to talk to you about stuff. And again, so everyone can do this. This is so straightforward. You and if you've not used the grok interface, you can just do simple chats, you can enable this thinking mode, where it basically just like runs a little longer and tries to figure out give you like better answers.\r\n\r\n\r\nNikolas Hulewsky (12:45.006)\r\nOkay.\r\n\r\n\r\nKirill Zubovsky (13:03.681)\r\nAnd there is deep search where it will actually go and do some research, look at some URLs. But I turn all this off. Again, I'm in the gym, the connection is poor. And I'm just like, hey, Groc, I'm going to build this application. Let's talk about this. The vision is to be able to have like a directory website and, you know, like just basically help me brainstorm this application.\r\n\r\n\r\nNikolas Hulewsky (13:25.068)\r\nI think, sorry, the prompt is so interesting to me. I like seeing how other people do it. Will you read that first prompt? Whatever the first prompt was, it was setting the tone of like, hey, I'm brainstorming this. This is how I want you to interact with me.\r\n\r\n\r\nKirill Zubovsky (13:29.9)\r\nWhich one?\r\n\r\n\r\nKirill Zubovsky (13:38.06)\r\nOkay, we'll skip this one because I think there's some TV noise in the background. here, the vision is to be able to have multiple website directories that I can set up that list something. For example, I would set up plumbers near me and I will display all the plumbers that are available in my radius and find reviews, for example, descriptions of their services, et cetera. And then it will make it easy for me to find just the right plumber. And I want an application that can apply multiple directories like that.\r\n\r\n\r\nAnd then I probably pause to take a breath and that's when it's like starts interrupting me, got it, blah, blah, blah. And I'm like, no, no, wait, I'm not done. know, I'm like, the challenge here is to build this application. It's to find the information, blah, blah, blah, blah. And then like, okay, I just need to know what pauses. Okay, so I'm like, so what I need first is a tool that will help me scrape this information. And I don't know which tool, right? By the way, I'm going to be automating all this with AI. Like, no problem, I'm just honest about it.\r\n\r\n\r\nNikolas Hulewsky (14:09.229)\r\nAlright.\r\n\r\n\r\nNikolas Hulewsky (14:18.744)\r\nNo, keep reading it.\r\n\r\n\r\nNikolas Hulewsky (14:30.99)\r\nOkay, so the very first part was like, hey, here's what I'm trying to do. Here's an example. Then you went into an example. For example, if I was looking for a plumber, blah, blah, blah, blah, blah, blah, then you take a breath or whatever it interrupts you. And then you say, I need to make a tool that can scrape all of this data first. And then you give it the end state, which is like, ultimately, this is what I'm trying to do. So you tell it upfront, generally, this is what I'm trying to do. Here's an example.\r\n\r\n\r\nKirill Zubovsky (14:36.694)\r\nMm-hmm.\r\n\r\n\r\nMm-hmm.\r\n\r\n\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (14:58.85)\r\nThis is the tool that I need your help with building in order to get there and end state. This is what it looks like. That's an interesting framework for a prompt. That's cool.\r\n\r\n\r\nKirill Zubovsky (15:01.547)\r\nMm-hmm.\r\n\r\n\r\nKirill Zubovsky (15:08.15)\r\nWell, and let me sell my own stuff to you, you know, so I was telling you about the Scouts MVP agent that we built. Okay, no, no, no. So like you guys can like play with it later or, you know, hit me up for a promo code if you want to use it for free. But the point is, I guess you can't sell it because I'm actually terrible at displaying images. But so the bot...\r\n\r\n\r\nNikolas Hulewsky (15:13.723)\r\nno, no, here we go. Hard sale. I'm just kidding.\r\n\r\n\r\nKirill Zubovsky (15:29.663)\r\nwill go, I know, right? I should look at my own website more often here. Let me find this section here. So the bot will actually go through idea validation, problem discovery, target audience definition, and so forth. It's designed to prompt you with all the questions. So you can go to this bot and just say, I have an idea. And the bot would be like, great, what's your idea? Tell me more about it. Because it knows to go through all these phases and to extract as much information from you as possible.\r\n\r\n\r\nNikolas Hulewsky (15:54.871)\r\nInteresting. So why did you go to Grok and not your own bot? Why aren't you eating your own dog food, huh?\r\n\r\n\r\nKirill Zubovsky (15:58.475)\r\nbecause my own bot doesn't have a voice mode, so it would be impossible or it does, but it would not work well on a bicycle. So I was like, you know, I know I'm going to be joking while like by 20 minutes, you know, I'm done with this. So anyways, here, that's why when I'm doing this prompt, I'm kind of trying to think ahead and anticipate what...\r\n\r\n\r\nNikolas Hulewsky (16:02.981)\r\nokay.\r\n\r\n\r\nNikolas Hulewsky (16:08.386)\r\nGot it, got it.\r\n\r\n\r\nNikolas Hulewsky (16:14.22)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (16:18.67)\r\nAnd to say the name of your bot one more time.\r\n\r\n\r\nKirill Zubovsky (16:23.634)\r\nWell, it's scousy.com slash MVP dash agent, but scousy MVP agent. Yeah. Yeah. And again, this agent is specifically designed just to take your idea and help you think through an MVP. Because afterwards you take this, you give it to us or you give it to somebody else and then they can go forward with that and kind of have a and the beauty of this and which something that other AIs wouldn't quite do unless you instruct them to do it.\r\n\r\n\r\nNikolas Hulewsky (16:27.022)\r\nScout's the MVP agent. Okay, cool. I like that a lot.\r\n\r\n\r\nKirill Zubovsky (16:53.903)\r\nIt's very annoying. Like it will keep asking you questions and you're like, no, no, just figure something out. He's like, no, I don't know enough. You have to tell me more. What do you really want? Right. And we've had number of times. A few people I worked with were kind of annoyed, but a few people were like really grateful for that because every time the bot would ask, is there anything else? They'll be like, yeah, there's one more thing, you know? And anyways, so.\r\n\r\n\r\nNikolas Hulewsky (17:18.798)\r\nYeah, it's a nice reminder.\r\n\r\n\r\nKirill Zubovsky (17:21.8)\r\nI'm trying to do this ahead and kind of like force this into Grok and be like, here's everything I want to tell you. So as you can see, here's this massive response from Grok, like just telling me everything I should know. And the beauty is that response, like I'm just listening to this as a podcast. You know, like, it's like, as in like I'm on a bike, I'm just listening to a podcast. Yeah.\r\n\r\n\r\nNikolas Hulewsky (17:39.938)\r\nYeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (17:44.505)\r\nCan ask you a question with Grok? Cause I do this sometimes when I'm talking to chat GPT. Can you adjust the speed? Like when I listen to a podcast, I'm like, I always listen to either 1.2 or 1.3 X. Can I, can I do that with Grok? Do you know?\r\n\r\n\r\nKirill Zubovsky (17:56.874)\r\nI'm using my phone as my camera so I can't tell you for sure. can, I've never needed it to, but you can adjust voices, right? So you can adjust what kind of voice talks to you. So I'm assuming some of those voices are actually gonna be natural. I don't know if they still have it. Grok used to have this unhinged mode where it will just swear at you and call you names. Yeah, so I tried that one. That was definitely unhinged and faster, but anyways.\r\n\r\n\r\nNikolas Hulewsky (18:01.014)\r\nThat's fine. No, no, no, no, no. You've never done it, though, is the point.\r\n\r\n\r\nNikolas Hulewsky (18:08.803)\r\nYeah.\r\n\r\n\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (18:23.586)\r\nYeah. No worries. Okay.\r\n\r\n\r\nKirill Zubovsky (18:26.557)\r\nSo like, look, you were saying, you you already know what scraper you like to use. actually, it actually listed a bunch of scrapers for me and it all looks like a text because it was never intended to actually display it visually. So if you use GROK on the website, it would have laid all of this out nicely so you can see it better, but because it was just reading it into my ears, it's just like a blob of text. So yes, Appify is the one we're gonna use. And then I continued asking it questions like, hey, this is great, you know, what would you do?\r\n\r\n\r\nNikolas Hulewsky (18:54.584)\r\nSo Applify is the tool that you're going to use to build on top of, to build the scraping tool.\r\n\r\n\r\nKirill Zubovsky (18:59.528)\r\nThat is the scraping tool. So we're just gonna scrape the tool. here because here's I'll show you let me show you we'll do two more minutes on grok And then we'll dive into building something so I said this is great See you\r\n\r\n\r\nNikolas Hulewsky (19:01.582)\r\nOkay, cool.\r\n\r\n\r\nKirill Zubovsky (19:15.837)\r\nwhat would you do in order to make sure that this website starts to appear in searches early on, right? I wanna like think about SEO. So then it gives me like all these ideas on SEO. And then I explain that like URL structure is important in SEO. And then it's like, yeah, you're right. Let's think about your URL structure. So you don't need to be technical to display, to do any of this. You can just talk about what you know, right? And it will help you. So now it says, okay, your app, emergency plumbers.\r\n\r\n\r\nzip code if I want to go for zip code or emergency plumber is Austin, Texas, like gives me some ideas of how I want to structure it. then, yeah, see like you were asking here, I took a breath and it paused or like we got disconnected. We got disconnected. And I can just say continue and it just continues because it knows the previous conversation. Eventually I asked it about AISCO. Do you want to know what it is?\r\n\r\n\r\nNikolas Hulewsky (19:56.911)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (20:09.102)\r\nAbsolutely.\r\n\r\n\r\nKirill Zubovsky (20:10.044)\r\nYeah, excellent. again, I don't remember if you saw this website last time we talked, did you? Okay, so GA4Hell. Okay, GA4Hell is something we started to improve Google Analytics because a lot of people have Google Analytics installed. Nobody knows how to use them anymore. They got so complicated, like it's awful. And so our first pitch to customers was like, okay, guys, we'll just dig into your Google Analytics and we make\r\n\r\n\r\nNikolas Hulewsky (20:18.028)\r\nNo. I mean, maybe. I don't remember it, though.\r\n\r\n\r\nKirill Zubovsky (20:39.598)\r\nfrom it, like a little script like this, essentially, you know, what you need to do. And we'll just email it to you so that you have like quick understanding of what's going on with your website. We tested this on a couple dozen people, like, okay, this is good, but people are overwhelmed with information. So what can we do? We can give you...\r\n\r\n\r\nactionable items that you can just do to improve your growth, improve your customer retention, right? Like forget about what you know about your analytics. Just tell me what I can do to do better. And as next iteration of that was what we're adding now to GA4 is the AISCO. In other words, how do you make your website popular on Google was something we've been asking for the last 20 years. But for the next 10, we're going to be asking\r\n\r\n\r\nhow can I get chat GPT? How can I get Grok? How can I get Anthropic to recommend my website in the user's query? How can I bring those customers onto my platform? Because look, I'm talking through text. I never need to exit Grok. websites, if they can't get in here, if they can't somehow get my attention and say, like, Appify did it, right?\r\n\r\n\r\nGrok knows it's a good tool, so now I'm gonna go there. So how do we structure our website so that we can do that too? And Grok, mm-hmm. No, no, go ahead.\r\n\r\n\r\nNikolas Hulewsky (21:57.443)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (22:04.642)\r\nWhen we, sorry, finish your thought and then I'll say. I was just gonna say Google at their conference last week, IODay, I can't remember what it's called. Anyways, they announced that they're gonna be integrating ads into the AI search. So that's the first time that they've actually said, ads are be coming to AI search.\r\n\r\n\r\nKirill Zubovsky (22:23.687)\r\nMm-hmm.\r\n\r\n\r\nKirill Zubovsky (22:29.423)\r\nRight, and of course with Google, you're gonna need to pay them to stick your website into AI search, right? But can we do it somehow where we inject our website into training data? Somehow we convince AI that we are the best in the category, and that's gonna be the next layer of SEO. Anyway, so was like, hey, can you also optimize this website for AI SEO? And it gives me some ideas, which are pretty good. So I have this long conversation. We're gonna fast forward to the end. And at the end, I got it to come up with\r\n\r\n\r\nNikolas Hulewsky (22:33.026)\r\nYep.\r\n\r\n\r\nNikolas Hulewsky (22:42.168)\r\nMm-hmm.\r\n\r\n\r\nKirill Zubovsky (22:58.882)\r\nessentially this document. A document as to how we're to build the whole thing.\r\n\r\n\r\nNikolas Hulewsky (23:05.452)\r\nNow, now was there, can you tell me in the prompt that you gave it for this document, did you say anything specific like, give me a markdown list or put it in a JP2 format? I don't know, but is there anything specific that you asked for?\r\n\r\n\r\nKirill Zubovsky (23:20.269)\r\nhuh. Let's look. So I said, okay, now can you put together a markdown document? It will do markdown by default, but I just like it. I was going to show you another tool I built. Do you want to see it? Darn. I know. So anyways, but anyways, so I'm like, yeah, markdown document that summarizes all my needs from this discussion. Please be very detailed. Make sure I could share this with friends and developers.\r\n\r\n\r\nNikolas Hulewsky (23:26.75)\r\nokay.\r\n\r\n\r\nNikolas Hulewsky (23:34.924)\r\nNo. We'd be here all day.\r\n\r\n\r\nKirill Zubovsky (23:50.136)\r\nand they could basically build this product based off that document. Also for the demo focus, and I said for the demo focus specifically on how we will make a local service scraper and listings for Boise Idaho. So I'm trying to say, don't just, yeah, don't just give me like a scraper and this tool for everything, because we'll be here forever, right? We only have 15 minutes. Just give me like one location for starters. So.\r\n\r\n\r\nNikolas Hulewsky (23:54.872)\r\nCool, okay.\r\n\r\n\r\nNikolas Hulewsky (24:16.11)\r\nThat's awesome.\r\n\r\n\r\nKirill Zubovsky (24:17.414)\r\nSo it produces this document. I can share this later, but it's basically, this is something like the Scouts, the MVP bot would have produced for you as well, but we have a very particular structure. This is less structured. This is like, here's what we talked about. Okay, so I know we've been here for a while. I'm sorry, I love to talk. This is so good. Like this is good stuff. So what are we gonna do now is we're gonna open a new cursor and say, call it,\r\n\r\n\r\nNikolas Hulewsky (24:22.573)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (24:34.549)\r\nNo, I'm watching.\r\n\r\n\r\nKirill Zubovsky (24:46.84)\r\nRequirements,\r\n\r\n\r\nNikolas Hulewsky (24:50.178)\r\nSo let me just back up, because I'm an idiot and I'd probably miss this. I know that we've now gotten sort of the, not just the prompt, but the outline of what the scraper is going to be doing. There's a geographical component to it. Do we have a specific thing that it's scraping though? I didn't hear that part.\r\n\r\n\r\nKirill Zubovsky (25:08.272)\r\nSure. we are going to, this is where time constraints kind of prevent us from doing everything we want. This is what I'm going to show you. I bypassed that part because we're not going to build it live right now. But I went on Google Maps and I said, emergency plumber is Boise, Idaho. And I got this map. Yeah. sorry. I haven't mentioned that yet. Great.\r\n\r\n\r\nNikolas Hulewsky (25:14.722)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (25:29.998)\r\nOkay, plumbers. Cool.\r\n\r\n\r\nNikolas Hulewsky (25:35.468)\r\nYou probably did and I just missed it because I'm a moron, but I was just like, wait, what, what director are we building? So we're building a plumber's directory.\r\n\r\n\r\nKirill Zubovsky (25:41.765)\r\nWe are building a local services directory, but I had to pick something. So I said, give me plumbers. And so if you go and here's this thing, see like right now, if you go on Google and say emergency plumbers and Boise, Google hijacks the top listings, then it inserts an ad and then it inserts maps. So it puts itself first again, and then it starts to put all these plumbers. So the only downside of directories, guess, right now is in Google, you have to compete.\r\n\r\n\r\nNikolas Hulewsky (25:45.964)\r\nYeah, yeah, Okay.\r\n\r\n\r\nNikolas Hulewsky (26:00.743)\r\nMmm. Yep.\r\n\r\n\r\nKirill Zubovsky (26:09.903)\r\nquite aggressively with Google itself. So you're not going to be the first one as you used to be in directories. Now, I went to Appify and I found this Google Maps scraper. And here I just said, you can see it, right? Here, should I zoom in so your people can see it? Okay. And so in the scraper I said, I just want emergency plumbers in Boise.\r\n\r\n\r\nNikolas Hulewsky (26:30.978)\r\nYeah. Yeah, I-\r\n\r\n\r\nKirill Zubovsky (26:38.635)\r\nAnd I want 10 of them, you know, just 10 places to start. By the way, if people are going to use it, which I think is pretty cool. And again, like this is making scraping so much easier than it used to be. But some things like reviews, for example, I said like number of reviews or.\r\n\r\n\r\nNikolas Hulewsky (26:54.542)\r\nSo is this a template within Applify that is for scraping?\r\n\r\n\r\nKirill Zubovsky (26:58.585)\r\nYep, it's called Google Maps Scraper and it's just a template and it's just like, you pick what you want and it does it for you. The only thing is if you're going to do it, if I try to do like business lead enrichment, so essentially you get emails for all the CEOs of those companies. It's kind of funny calling plumbers CEOs, but they are CEOs of their own life, you know.\r\n\r\n\r\nNikolas Hulewsky (27:22.254)\r\nThe plumber company's coming for you, You can't dog on plumbers like that.\r\n\r\n\r\nKirill Zubovsky (27:24.664)\r\nYeah. like we, man, they have some heavy tools. So some of this stuff requires you paying. So then I had to like turn it off, like business lead enrichment doesn't work in a free account anyways, but I ran it. here's, shows you that it did the run and it ran for 600 seconds and voila, it gave us all of this information. So, you know, here's that stuff from Google maps with links, location, phone number.\r\n\r\n\r\nNikolas Hulewsky (27:47.362)\r\nMm, wow.\r\n\r\n\r\nNikolas Hulewsky (27:52.494)\r\nThis is only from Google Maps.\r\n\r\n\r\nKirill Zubovsky (27:54.424)\r\nAnd this is only from Google Maps, but.\r\n\r\n\r\nSo we're just trying to show how easy it is, right? So if we did this like a full project, and we can, if you want to, we can do it, you know, but you take this information. Next step, you'd automate how you get to this information. So either Appify API or some other tool, but you'll say, okay, now I wanna be able to get this information for every new location. And then you'll enrich this information.\r\n\r\n\r\nNikolas Hulewsky (28:24.046)\r\nWhat does that mean every new location?\r\n\r\n\r\nKirill Zubovsky (28:26.584)\r\nWell, like when I when I put it here and I say Boise, Idaho, right. But our app isn't going to be just for Boise, Idaho. Like why make a website that only has Boise in it? It's going to be in Austin and, you know, in Seattle and so forth, because we want to fully automate it where you build the structure and then you put in your requirements and you just say go. And then by the end of the day, you have scraped all of these things for all of the cities over, I don't know, three thousand people, you know, and then.\r\n\r\n\r\nNikolas Hulewsky (28:36.622)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (28:55.822)\r\nBut it's only using what has a Google Business profile at this point.\r\n\r\n\r\nKirill Zubovsky (29:02.126)\r\nThis particular Google scraper only scrapes Google profiles, but there's the same ones, you know, like we can do ops.\r\n\r\n\r\nIt's actually hard to exit this in recent. There you can do, what is it? Yelp? Is it still relevant? know, boom, Yelp scraper. Like where else would you look for plumbers? Yellow pages. Yeah, I look there's yellow pages apparently still. didn't know that was even a thing. But yes, so this would have all kinds of tools in the same way here. Look, there's a TikTok scraper, right? Like if you want to remember, I said like marketing is really difficult nowadays.\r\n\r\n\r\nI mean, I'm pretty sure you can find like you can find videos with hashtags, which means you can find influencers to promote your stuff. Yeah, so it's awesome. They basically built an ultimate scraper for everything. So because scraping content is quite challenging. All right. So I'm going to like fast forward through this because we we keep running out of time. All right. It's OK. So OK. So what I did next is I went to cursor and I said, well,\r\n\r\n\r\nNikolas Hulewsky (30:03.502)\r\nI'm sorry.\r\n\r\n\r\nKirill Zubovsky (30:10.549)\r\nOne thing, hold on, I just, I'm gonna need to do this. Cursor rules. I'm gonna take this. I might as well tell you. So cursor has rules which specify how cursor should operate. I mean, this is an educational video, so I'll show you. For example, so I have like this, bunch of these like order rules, means they always attach to my cursor environment.\r\n\r\n\r\nSome are manual, some are requested by the cursor as it runs. So one of the rules could be, for example, code quality. If we're going to build something, I have specific rules for how I want it to be built. So that it's not just any code, it's like, do it this way. So I don't have to go later and tell you how to fix it or change it. You should presumably always do it this way. And I'm going to say, make sure...\r\n\r\n\r\nNikolas Hulewsky (31:06.83)\r\nI mean, you might as well be speaking in Greek to me. I have no idea what you're saying, but this, okay, looks great.\r\n\r\n\r\nKirill Zubovsky (31:11.552)\r\nOne second. Okay. Do you want me to explain? Like, you know, like, no, it's kind of like if we were to play a game, a board game, we would all read the rules first, right? So that we don't invent the rules as we play. So this is what it is. I like specify rules of the game. And so that the cursor, see now it can like review those things and it knows how I like to build my projects. So now it will...\r\n\r\n\r\nNikolas Hulewsky (31:16.418)\r\nNow, keep going.\r\n\r\n\r\nNikolas Hulewsky (31:35.662)\r\nSo we're building the website that's going to house the directory is what you're doing. Okay.\r\n\r\n\r\nKirill Zubovsky (31:39.168)\r\nExactly.\r\n\r\n\r\nSo now, normally I would do, and this is where 15 minutes is not an accurate timeframe because no, because normally I would put a lot more rules and there are a lot more things in this sequence that I think we should have in order to make the best final product. But we just here, actually, let me do one more thing. I'm gonna show you.\r\n\r\n\r\nNikolas Hulewsky (31:48.95)\r\nNo, I get it. Yeah.\r\n\r\n\r\nKirill Zubovsky (32:21.602)\r\nSo we're going to ask, we're going to see if Krista can do it. Hey, can you take requirements and turn them into a PRD document that we will use to build this application?\r\n\r\n\r\nKirill Zubovsky (32:42.434)\r\nSo PRD stands for what? Product Requirements Document. Essentially just outlines everything in a better format for the AI to understand what it needs to do. And that's where I said like the future development isn't going to be me talking to this thing all the time because think about it, we've had software development for decades now, right? And we've had rules around software development and we know how to build teams in software development.\r\n\r\n\r\nNikolas Hulewsky (32:46.104)\r\nOkay.\r\n\r\n\r\nKirill Zubovsky (33:12.115)\r\nSo you need all these different roles on your team that are responsible for different things. And so the next iteration of how I'm doing this, I don't just throw this in cursor and ask it like, just build this stuff. I actually have multiple documents. So every person on a team will have a different document that they're responsible for. But for now, we'll just do this like one shot here. know, it translated our needs into\r\n\r\n\r\nNikolas Hulewsky (33:48.237)\r\nNow, you're a developer, you've had experience with this. Cursor's not the app that most people are gonna be using to build this directory, right? They're probably gonna be, if they're no code, they're probably gonna be using Replit or Lovable or Lindy or one of these tools.\r\n\r\n\r\nKirill Zubovsky (33:49.505)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (34:05.162)\r\nSo when they build the directory in those, it ready for commercial use or are they still going to have to go and talk to a developer like you to be like, will you finish up the last 20 % just to make sure it's clean?\r\n\r\n\r\nKirill Zubovsky (34:22.689)\r\nI'd like to tell you that they'll be able to just launch something and they will be able to just launch something. It's just not necessarily going to be exactly what they need. So part of it is you'll need to accept the fact that you're not going to get exactly what you want, right? So, and maybe just roll with the punches and do like do with what you have. Of course, second part is like...\r\n\r\n\r\nNikolas Hulewsky (34:34.103)\r\nMm-hmm.\r\n\r\n\r\nKirill Zubovsky (34:48.947)\r\nIf you see what you've got is close enough, then you can find somebody to help you. I mean, we're here to help. And the tools will get better. Replit is apparently getting much better. Cursor is working on a lot of stuff. Like, you know, I'm building stuff on top of Cursor. We're not quite there yet where you can just say, give me this and it's done. But I think, yeah, we're getting there.\r\n\r\n\r\nNikolas Hulewsky (35:14.51)\r\nOkay\r\n\r\n\r\nKirill Zubovsky (35:18.431)\r\nSo like, look, for this stuff, right? Like it got into the point where it did a file structure for us as to how these components would look like, data schema. Like part of it too right now, we're just gonna try and see if this works. But if I were to do this offline and not on camera, I would read through the whole thing and to make sure that it specifies exactly what I think it should specify.\r\n\r\n\r\nAnd then I'll edit all the bits and add all the details where they're missing. But YOLO, so...\r\n\r\n\r\nNikolas Hulewsky (35:57.027)\r\nOkay, what would you do again? You're no code or you don't have coding experience. Is there a QA doc or a QA prompt you can ask it to say, please look over this code for these specific potential problems.\r\n\r\n\r\nKirill Zubovsky (36:15.294)\r\nyou're going to want to be as detailed as possible. So in my workflow, you can kind of see it in the background there, I'm adding a test-driven development where I'm saying that for everything we build, make sure you test it after you build it. And I'm also asking the AI to be very granular in how it makes things. So instead of just trying to whip out this whole directory at once like we're doing now, I would say, and again, this is where like the...\r\n\r\n\r\nI'm going to need to read a bunch. But this is where I'd say, okay, just make sure we can display this one page. Here's the information. you know, so like here, I took this information and we're going to save this as data JSON. And I'll be like, hey, like, just make sure we can display this on one page first and then do the next step. So you don't need to be a developer to do that. You can just think of like,\r\n\r\n\r\nAs a user looking at a website, what are the bare minimum things you want to see on it, right? And then start adding. Because it's a lot better at doing simple steps quickly than it is at creating this massive thing. But you know what? Again, we're playing around here. Let's just check it out. Well, actually here, tell me, we have this product requirements document and we have data JSON that pulls the data. How would you instruct the AI\r\n\r\n\r\nNikolas Hulewsky (37:20.75)\r\nHmm.\r\n\r\n\r\nKirill Zubovsky (37:42.121)\r\nyou can go and build you the website.\r\n\r\n\r\nNikolas Hulewsky (37:45.471)\r\nno, that's what you're here for.\r\n\r\n\r\nKirill Zubovsky (37:48.361)\r\nGuess, like, just think about it, you know, like, here's this dumb robot and you're trying to tell the robot that like, I want something. How do you tell?\r\n\r\n\r\nNikolas Hulewsky (37:52.589)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (37:57.423)\r\nOkay, so tell me the data sets again, or the components we have. Okay.\r\n\r\n\r\nKirill Zubovsky (38:00.681)\r\nSo we just have the data JSON with the data we need to display. And we have a requirements document that says, basically, we put everything from our discussion in there and said, as much as we just explain to the AI, it should technically be contained in here.\r\n\r\n\r\nNikolas Hulewsky (38:10.968)\r\nhow we want it displayed.\r\n\r\n\r\nNikolas Hulewsky (38:19.758)\r\nOkay, so I would say I have my explainer document. Please take the JSON file with all of the data that we'll be displaying on our directory and create a first draft directory.\r\n\r\n\r\nNikolas Hulewsky (38:42.542)\r\nWas that close?\r\n\r\n\r\nKirill Zubovsky (38:45.375)\r\ntyping it out we'll see so\r\n\r\n\r\nNikolas Hulewsky (38:48.031)\r\nHahaha\r\n\r\n\r\nKirill Zubovsky (38:53.405)\r\nYou know, so like everyone is selling you this magic because magic is going to happen. We definitely go into the direction of magic where things will just happen. But for now, the more magical you want it to be, the more work you still have to put yourself into doing it. But you learn over time, like what helps. And I've been talking to a lot of friends about what helps them. And different people have different approaches. But like you learn over time that, OK, the more you can put in a document,\r\n\r\n\r\nthe better the AI will be at creating it. And then the more you can, and then eventually you want to split the documents into sections because it's better at making like one section at a time than an entire document at a time. You want to do test-driven development because then it will hopefully not fail as often as it normally fails. you want to tell it to never delete stuff because once in a while it goes on the wilds like...\r\n\r\n\r\nGoose chase and it adds like 20 files you never needed and just deletes the 20 that you actually want it. And like you have to put hard boundaries around that. It's hard for me to say whether tools like Replet actually do that internally. They probably do, know, like hundreds of engineers that work for those companies got to do something. So I'm assuming that's what you're essentially paying for. Somebody is putting all this knowledge into the system.\r\n\r\n\r\nAnd that's\r\n\r\n\r\nNikolas Hulewsky (40:19.47)\r\nfeel like I'm drinking from a freaking fire hose right now, man. This is like... So, let me just try to back up and be concise. Basically, with directories, you can be as complicated or as easy as you want to make them. You can go with a replete lovable, you can go with cursor. If somebody is serious about wanting to launch a directory, and let's say there's somebody like me and they have no coding experience, in your mind,\r\n\r\n\r\nKirill Zubovsky (40:27.294)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (40:47.968)\r\nYes or no? Are they going to need someone to help them at least finish the product?\r\n\r\n\r\nKirill Zubovsky (40:56.808)\r\nYes, if they want it to be really good. No, if they are persistent and they're okay with letting AI take control of some specifics.\r\n\r\n\r\nNikolas Hulewsky (40:59.384)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (41:07.662)\r\nOkay, so let's operate from the perspective of yes, they're gonna need somebody to help them architect this project. So if they are gonna need someone to help them architect this project, when would be the best or ideal time to use them? Is it at the beginning to like architect the whole process or is it at the end to get them, you know, the last 20 % past the finish line?\r\n\r\n\r\nKirill Zubovsky (41:30.045)\r\nFrom the perspective of a person who does these things, I think you should try and fail first, because then you'll have much better appreciation for somebody helping you. But it's also a learning experience where you're going to realize what you actually want, because it's really easy to just have an idea. But at the same time, if you really don't want to do anything, you just want somebody else to do it for you, that's fine.\r\n\r\n\r\nNikolas Hulewsky (41:43.406)\r\nOkay.\r\n\r\n\r\nKirill Zubovsky (41:59.719)\r\ntry to put as much detail into your concept as possible. Don't just come with an idea of, I want a directory and I have $20. That's not gonna work. Yeah. But look, let's see. Let's see what we did.\r\n\r\n\r\nNikolas Hulewsky (42:11.854)\r\nIt's not gonna fly. Okay, fair.\r\n\r\n\r\nKirill Zubovsky (42:19.047)\r\nIt's, you see, we're like, we can read through the descriptions. Look, it's created all these files to display all this stuff. yeah. Yeah, it's installing stuff. So let's see, ready in.\r\n\r\n\r\nNikolas Hulewsky (42:29.57)\r\nCan we see it? when are we able to actually see it?\r\n\r\n\r\nNikolas Hulewsky (42:35.233)\r\ninstalling them.\r\n\r\n\r\nKirill Zubovsky (42:39.355)\r\nLocal service finder. Find emergency plumbers in Boise, Idaho. Click. Boom. Are you seeing this?\r\n\r\n\r\nNikolas Hulewsky (42:48.77)\r\nDude, that's freaking awesome.\r\n\r\n\r\nKirill Zubovsky (42:50.555)\r\nYou can visit their website. You can call them. boy, let's not call them. It's actually started a call.\r\n\r\n\r\nNikolas Hulewsky (42:59.682)\r\nHahaha\r\n\r\n\r\nKirill Zubovsky (43:02.957)\r\nBut we still have five minutes and we're to go even further because we're going to commit to making this live. We're going to say git init. Again, git is just a way to save stuff. git add commit. Okay, git commit. What are we going to say? We have our first directory ready in demo. And then we're going to say versal.\r\n\r\n\r\nAnd we're to save Versal Prod, which is going to send it to production. And it's going to be my project. Again, you know, like, look, you don't need to know any of this. It's just asking you questions. Want to verify the settings? No, I don't want to verify settings. Where are you learning this? Obviously.\r\n\r\n\r\nNikolas Hulewsky (43:54.976)\r\nWe're yellowing this.\r\n\r\n\r\nKirill Zubovsky (43:57.294)\r\nAnd even better, and we're going to totally work on this because I already bought the domain services, emergencylocalservices.com.\r\n\r\n\r\nNikolas Hulewsky (44:06.723)\r\nWhat'd you buy?\r\n\r\n\r\nNikolas Hulewsky (44:11.116)\r\nNice.\r\n\r\n\r\nKirill Zubovsky (44:14.674)\r\nyeah. so after this episode, emergencylocalservices.com should be, should be live and ready for you to check it out. And you know what I can do? I can, do you think we should make it open source? Should we like put this?\r\n\r\n\r\nNikolas Hulewsky (44:27.074)\r\nThat's awesome.\r\n\r\n\r\nNikolas Hulewsky (44:32.386)\r\nI don't even know what that means. I wanna say yes. What do you mean log open source?\r\n\r\n\r\nKirill Zubovsky (44:35.952)\r\nMeans everybody can use what we just built without having to rebuild it again. So we're just giving it to them for free. Our hard work of 15 minutes and like $2 in credits and AI stuff. We're going to connect this to the production environment. so eventually, hopefully, maybe it will actually appear online. Look, yep. So it's already.\r\n\r\n\r\nNikolas Hulewsky (44:42.158)\r\nSure.\r\n\r\n\r\nKirill Zubovsky (45:05.155)\r\navailable in their staging environment. So I see this like weird URL. So we've got that. And then we're setting up the...\r\n\r\n\r\nOkay, there you go. Emergencylocalservices.com. We have Local Service Finder.\r\n\r\n\r\nNikolas Hulewsky (45:22.424)\r\nHey, I have another domain that I just bought while we were talking. was just like trying to find, what about findlocalhomeservices.com?\r\n\r\n\r\nKirill Zubovsky (45:26.779)\r\nUh-huh.\r\n\r\n\r\nKirill Zubovsky (45:31.813)\r\nPerfect. And the beauty of this, once you build this, you can throw it on 10 different domains. Let me show you one more thing because I think people are going to really appreciate it. I use this tool called Mid Journey for generating images. if you want to, because right now we are not getting services, we are getting just the text. I mean, there's nothing to show.\r\n\r\n\r\nNikolas Hulewsky (45:39.534)\r\ncrazy.\r\n\r\n\r\nKirill Zubovsky (45:59.139)\r\nSo you can go here and you can say create an image. I was making a bunch of stuff yesterday. So we're to say a handsome plumber. We're doing plumbers, right? In Boise, Idaho, fixing a sink in a beautiful, beautiful big house. Let's just see what it does.\r\n\r\n\r\nKirill Zubovsky (46:24.377)\r\nI highly recommend everybody. It's like 10 bucks a month. Play with mid journey. I set my kids up with this the other day. They created their own personalized profiles and they spend like two hours generating images. You know, it's like watching TV, but you actually get to like make stuff because they realize that they can actually be very detailed about all of these images and specify exactly what they look like. So anyways, look, look at this handsome plumber and boys.\r\n\r\n\r\nRight? So now, now I'm going to finish by saying, remember like how we started doing things by hand by going to Appify and doing this. The next iteration of this tool would be to say automate things like for every page, go get an image. For every page, go get a chat GPT description. And how you do that? Well, you actually have AI write the description of the image, then send that description of the image to an image generator. Right?\r\n\r\n\r\nNikolas Hulewsky (47:14.584)\r\nHmm.\r\n\r\n\r\nKirill Zubovsky (47:24.13)\r\nAnd so you automate, like you peel back the onion and you automate every step of your process. And that's really like where the power is where one bit at a time, you automate yourself with AI.\r\n\r\n\r\nNikolas Hulewsky (47:32.419)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (47:37.337)\r\nWell, I just bought FindLocalHomeservices.com. I'll send it to you. And I also created an image. And here's what I said. Handsome local plumber working on a sink and inspiring confidence to those who are looking for a contractor. It's loading right now. I didn't use Mid Journey. I didn't use Mid Journey. But let's see what ShadTPT has come up with.\r\n\r\n\r\nKirill Zubovsky (47:41.103)\r\nOkay.\r\n\r\n\r\nKirill Zubovsky (48:06.103)\r\nAlright.\r\n\r\n\r\nNikolas Hulewsky (48:06.476)\r\nLook at this guy. Look at this guy. You know, he's not as nice as the one that you have. I feel like the one you had, like it's like, okay, that guy's got 15, 20 years worth of experience. You know what I mean? He's not a new grad who just bought this plumbing company. Like the guy, the guy who you have, I'm like, okay, I'll hire that guy. This guy, I'm not, I don't, I don't think I'd hire him.\r\n\r\n\r\nKirill Zubovsky (48:16.803)\r\nYes, yes, yes.\r\n\r\n\r\nKirill Zubovsky (48:27.961)\r\nBut mean, he looks trustworthy, you know?\r\n\r\n\r\nNikolas Hulewsky (48:30.67)\r\nHe looks good. He looks, he's too, he's got too, he's too well built for me. It's like, why do you have so much time to, why are you in the gym? Why aren't you working more? Are your services not that good? You know what I mean? The other guy, he was a little on camp, he's got a little beard, some stubble going on, he's got 15, 20 years of experience. like, yeah, hire Jack over there. Pull up your picture again, we'll see your picture again.\r\n\r\n\r\nKirill Zubovsky (48:36.825)\r\nhe spends too much time in the gym.\r\n\r\n\r\nKirill Zubovsky (48:43.918)\r\nYeah.\r\n\r\n\r\nKirill Zubovsky (48:54.905)\r\nLet's see, let's see, let's see Jack. We're gonna call him Jack. Share. yeah, you have to unshare I think for me to share. There we go. Let's do it again. Share my screen. There's Jack. So handsome. Jack.\r\n\r\n\r\nNikolas Hulewsky (48:58.626)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (49:06.896)\r\ndude, look at Jack. Dude, I'm telling you right now, I'm not worried about him being alone with my wife, you know? I'm not worried, I'm not, maybe not. But no, look at Jack, look at him. Like that guy right there, I'm okay, that's, I'm hiring Jack. He's got some, he's made, I don't want him making mistakes on my sink that he learns from, I want him to have already made those mistakes, and he's made those mistakes.\r\n\r\n\r\nKirill Zubovsky (49:14.689)\r\nWell, I don't know if I'd go that far. Jack's got street cred, you know, so...\r\n\r\n\r\nKirill Zubovsky (49:35.438)\r\nAnd think about it, like, this is the power of creativity, because literally now for every page in every city and every zip code, you can try to, you can start to change the prompts, right? Like where if you're in Texas, you can have cowboy Jack. If you're in Seattle, figure out your own prompts, you know, but that kind of stuff, like, and now you can create all this content and go, and like, it's going to take you hours.\r\n\r\n\r\nNikolas Hulewsky (49:51.267)\r\nYeah.\r\n\r\n\r\nKirill Zubovsky (49:59.427)\r\nLike if I spend the rest of the day working on this, we're going to have a really kick-ass directory for emergency services in America by end of the day.\r\n\r\n\r\nNikolas Hulewsky (50:04.27)\r\nIt's true.\r\n\r\n\r\nNikolas Hulewsky (50:08.237)\r\nOkay, I love it man. I totally agree. Well let's end it here. This was fantastic. Appreciate you. Let's go visit this website and get it moving. Alright.\r\n\r\n\r\nKirill Zubovsky (50:19.907)\r\nThank you.",
  "metadata": {
    "duration": "",
    "date": "2025-06-26",
    "platform_source": "Google Drive"
  }
}