{
  "episode_number": "153",
  "episode_title": "AI SERIES: 6 - How to Automate Content Creation with Pranav Ghatraju",
  "guest_name": "Pranav Ghatraju",
  "business_name": "AI Automation Agency",
  "transcript": "﻿Nikolas Hulewsky (00:00.814)\r\nAll right, Bronov calling from Boston. Super excited to talk to you. I'm going to learn some AI today. I'm stoked for it. You are chemical engineer by trade who has now transitioned into AI automation, which is freaking awesome. Here's my first question for you. ready? What LLMs do you use and what do you currently use them for?\r\n\r\n\r\nPranav Ghatraju (00:24.058)\r\nSure, this is a great question. So I would start is like, thank you so much, Nick, for having me here. And it's a pleasure to be here and to spend this next few minutes with you. So I'm a firm believer in that, like, you should be having a mixture of LLMs for different use cases. So for my case, I find just the OpenAI interface is really, really intuitive to me. So I do a lot of my like ideation and everything with chat GPT, mainly with the 4.0 model, it gets the job done for me for most.\r\n\r\n\r\nNikolas Hulewsky (00:45.585)\r\nYeah\r\n\r\n\r\nPranav Ghatraju (00:54.152)\r\nIf I know something requires a little bit more understanding, I'll go to the reasoning models as well. But for the most part, for all the execution, whether that's like, you know, expand on this or do XYZ focusing more on execution and not really much on generation, but just do the actual thing. I'll use ChatGPT. For anything related to research, I like Perplexity. I think it's a very powerful tool. Grok did come out with\r\n\r\n\r\nNikolas Hulewsky (01:15.873)\r\nGood.\r\n\r\n\r\nPranav Ghatraju (01:24.012)\r\nability for deep research. just haven't had a chance to really play around with it yet, but once I get my hands dirty with it, I'll definitely keep you posted on how that goes. And I just love Claude. Yeah.\r\n\r\n\r\nNikolas Hulewsky (01:33.354)\r\nJust so you know, I'll edit this part out. If you see me looking away, I forgot to tell you this. I'm not texting or tweeting. have two monitors up, and I'm trying to look at some of my notes. I get really insecure if I'm talking to someone and they're looking around, so I don't want you to feel like I'm distracted. I'm just looking at this other monitor trying to find my notes to ask you questions. sorry. Before you go to Claude,\r\n\r\n\r\nPranav Ghatraju (01:39.886)\r\nYeah.\r\n\r\n\r\nyeah, all good.\r\n\r\n\r\nPranav Ghatraju (01:48.972)\r\nMm-hmm. No, all good.\r\n\r\n\r\nPranav Ghatraju (01:55.418)\r\nAll good, yeah.\r\n\r\n\r\nNikolas Hulewsky (01:59.33)\r\nTell me more about perplexity. So what are you using perplexity for exactly? Deep research?\r\n\r\n\r\nPranav Ghatraju (02:01.818)\r\nMm-hmm.\r\n\r\n\r\nYeah, perplexity is like, it's the way I like to think of it. It's kind of like your LLM that's supercharged with search. So it's basically crawling the entire web in such a way and giving the LLM capabilities to summarize what it's seeing and giving you that experience that like, in addition for searching something, you're getting something actionable without having to click into every link, like what you have with Google, right? Even with SGE, yeah.\r\n\r\n\r\nNikolas Hulewsky (02:13.794)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (02:27.81)\r\nSo perplexities real time.\r\n\r\n\r\nPranav Ghatraju (02:32.429)\r\nPerplexity is real time and it really it has I think it's just an excellent tool like I don't know if you if you're aware But they're gonna be coming out with their own browser soon. So really excited about that to see what that looks like So that's gonna be it's gonna be whole new different world out there But I would say but I would say like in terms of models like always start with one\r\n\r\n\r\nNikolas Hulewsky (02:32.587)\r\nInteresting.\r\n\r\n\r\nPranav Ghatraju (02:56.026)\r\nand just play around with it, see what the feeling is like. For me, I got my hands dirty with chat GPT, because it was just mass market. That's what you heard on all the times. And slowly, slowly, as more, as I got into space more and more more models came my way. Like there's a whole slew of open source models that you can run. There's Mistral, there's Falcon, there's a Llama. These are all things that just came my way as I became in this space. But that shouldn't stop you from at least getting started.\r\n\r\n\r\nNikolas Hulewsky (03:04.238)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (03:25.486)\r\nYeah. And OpenAI has, like you said, has a really good user interface. It's pretty intuitive, right? Like the chat box, the way it stores history of your conversations is nice. So you use chat tpt for sort of general ideation. You'll use perplexity for research. And then I think you said you used, you like Claude lot. What do you use Claude for?\r\n\r\n\r\nPranav Ghatraju (03:30.234)\r\nMm-hmm.\r\n\r\n\r\nPranav Ghatraju (03:49.146)\r\nSo I use Cloud to actually do a lot of the content generation. So actual generation. So think of things that require a little bit of creativity. So for example, the way I like to distinguish this is like, execution is like you give it bunch of rules and it'll do those rules. For example, let's say like,\r\n\r\n\r\nNikolas Hulewsky (03:53.486)\r\nReally?\r\n\r\n\r\nPranav Ghatraju (04:09.4)\r\nLike one use case I'm fascinated about with AI is like taking unstructured data and structuring it. So for example, taking a picture, telling me what it is in a format that I can record in a database rather than just like as a text. So for those use case, I've seen open AI is really, really good getting those structured outputs, a chat GPT, open AI.\r\n\r\n\r\nNikolas Hulewsky (04:30.881)\r\nOpenAI or Claude?\r\n\r\n\r\nNikolas Hulewsky (04:35.214)\r\nOkay, I thought you were saying Claude is good for that. So Claude's not good for that.\r\n\r\n\r\nPranav Ghatraju (04:37.88)\r\nNow Claude, Claude, but I would say Claude is really good when it comes to creative side.\r\n\r\n\r\nSo let's say like you're asking it to generate content for someone to read. I don't know. I don't know how it's programmed. Maybe if I read the documentation, it'll give the picture become clear. But I'm just so much more fascinated, like not fascinated, it's not the right word, but I'm more moved by the text I get from Claude versus what I get from Chachif. Chachifity seems very dry with its output, whereas Claude, there just seems to be a little bit more character. Maybe this is a very subjective feeling. Maybe others feel differently, but this is what I've experienced.\r\n\r\n\r\nNikolas Hulewsky (05:01.464)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (05:10.21)\r\nI do wonder, I do wonder because I hear people say like, you know, this model has much more character than chat GPT. I wonder if people are just they're just used to who let the dogs out. That's also is happy. He's he's like, I'm ready for it. I wonder if if when people are talking about like, it has more character, if what that really means is I'm just used to seeing chat GPT output.\r\n\r\n\r\nPranav Ghatraju (05:11.74)\r\nyou\r\n\r\n\r\nPranav Ghatraju (05:21.932)\r\nYeah, He heard us talking about AI and got crazy.\r\n\r\n\r\nNikolas Hulewsky (05:39.564)\r\nAnd so a new output has character, right? Cause it's different. It's just different than anyways. That's just the thought. I started using yesterday and today actually flawed for helping me code. I'm trying to take my transcripts for my podcasts and put them into a digestible format so I can actually upload them to LLM. So they're like cleaning the texts. They were moving.\r\n\r\n\r\ntimestamps, they're organizing the data. And I've never done any of stuff before. And it was like, here's the Python script, go run it in Google collab. And I found that Claude is actually better at helping me create the script than chat GPT was to clean the data. And that was interesting. I'd never done that before.\r\n\r\n\r\nPranav Ghatraju (06:27.438)\r\nYeah, I mean, the, I think the way it's like,\r\n\r\n\r\nIt's kind of like iPhone versus Android, right? Where it's like they both achieve the same purpose. Like they both make calls, they both you can text maybe with Android to iPhone, you have the green thing that people will rag you about. But if you look at the total experience, it's more or less the same, but people gravitate to other based on experience. So you talk to an Android user, they love the customizability aspect of their phone. They're not locked to a certain configuration.\r\n\r\n\r\nNikolas Hulewsky (06:45.649)\r\nHahaha\r\n\r\n\r\nPranav Ghatraju (07:01.422)\r\nlocked to a certain ecosystem like Apple does. Apple just gives that premium experience no matter what. Even if you get sucked into their ecosystem, you have to give props to them for giving that premium experience and creating that system that if you're not an Apple user, you don't really belong. I don't know if there's an LLM equivalent, but it's kind of like that. But the whole point is, are you being served?\r\n\r\n\r\nLike if you're being served to your capacity, like there's something that's working there.\r\n\r\n\r\nNikolas Hulewsky (07:35.744)\r\nOkay, so tell me you were a chemical engineer, you've now gone and created and started your own AI automation agency. When did you start your agency?\r\n\r\n\r\nPranav Ghatraju (07:44.6)\r\nYes.\r\n\r\n\r\nSo I would say, from, so after I stopped working, I took a little bit of a break, and I would say I started seriously pursuing this in August.\r\n\r\n\r\nNikolas Hulewsky (08:00.045)\r\nOkay.\r\n\r\n\r\nPranav Ghatraju (08:00.206)\r\nwhere I just, you know, where I put up my profile out on Upwork, started networking with some people and got some clients through the door pretty easily. Some solutions included building some spreadsheets like I did in my previous job. Other included like building up full-fledged apps.\r\n\r\n\r\nIt's not necessarily AI apps, but just apps in general. And what that's transitioned to is more or less, it's giving me a whole arsenal of tools available to just build anything I want. So it's giving me exposure to no code development. There's a tool called Bubble that I...\r\n\r\n\r\nis very powerful when it comes to building out web apps. There's a tool called Flutter Flow, which is really powerful to build mobile apps. And now you have a whole slew of like text to prompt builders that you can type and it'll output like a web app for you. At the same time, it gave me a whole exposure to the world of Zapier, to the world of Make. And like, how do we create those workflows to, you know, connect the dots to achieve a certain purpose?\r\n\r\n\r\nNikolas Hulewsky (08:52.408)\r\nYeah.\r\n\r\n\r\nPranav Ghatraju (09:05.79)\r\nAnd this came from someone who had like a zero business background, but then just learning these softwares understand what drives business value, what drives, you know, how do we move things forward. It really is an eye opener to that more than anything else. Like the money is nice on the side, but like having this knowledge and seeing it firsthand, just how these tools drive value has been truly exciting.\r\n\r\n\r\nNikolas Hulewsky (09:07.01)\r\nWhen did you?\r\n\r\n\r\nNikolas Hulewsky (09:32.982)\r\nOkay, so walk me through how are you using AI in your business today? Is it a revenue generator or is it a cost saver or is it a efficiency accelerant? how are you using it?\r\n\r\n\r\nPranav Ghatraju (09:45.572)\r\nSo I would say for the bulk of my clients, it's more or less a time saver. And it really boils down to a few categories. So one is increased capacity. So they're able to take on a higher workload without having to raise or without having to bring on more workers or more labor. Like that expectation has risen for how much output a single person can do. That's one. Another one is about streamlining operations. Like I think before the age of AI, many people were kind\r\n\r\n\r\nof loose with their operations but the minute like the AI came out more or less they realized that in order for AI to be beneficial they really had to get their operations dialed in so you know building out those SOPs building out you know those knowledge banks such that they can get outputs that are repeatable and then reverse engineer it such that they can install AI key touch points to really smoothen out any points of friction and thirdly I think it's just an amplifier in every any way\r\n\r\n\r\nLike if you look at top line side of things like the way you can use, you know AI enrichment to increase the likelihood of you landing in an inbox or like you can use it to do for market research really expanding on customer pain points and saving on the bottom line just you know, automating workflows that are very tedious things you should automating things that you should you should be doing but just don't because you don't have enough hours in the day. So I've seen the benefits like very close\r\n\r\n\r\nNikolas Hulewsky (11:05.766)\r\nYeah.\r\n\r\n\r\nPranav Ghatraju (11:15.386)\r\nclose up, which has been really exciting for me.\r\n\r\n\r\nNikolas Hulewsky (11:18.446)\r\nOkay, so from your perspective, your framework is, hey, this is either going to give you more capacity or it's gonna be an accelerant on what you're already doing. That's kind of how you're looking at it. Okay. Tell me about, I guess, what's something you use on a daily basis or what's something that you, can you show me anything? Is there anything that you have like?\r\n\r\n\r\nPranav Ghatraju (11:29.391)\r\nYeah.\r\n\r\n\r\nPranav Ghatraju (11:41.644)\r\nYeah, sure. So one of the things I've built and I'm still actively building out is it's basically like an interview bot where like you connect with the voice AI and from that conversation you're able to generate content. So just gonna pull it up real. Yeah.\r\n\r\n\r\nNikolas Hulewsky (11:56.27)\r\nA way of a lamp? Hold on a second. What do mean? Like I would, I would just call the bot.\r\n\r\n\r\nPranav Ghatraju (12:01.306)\r\nSo basically, yeah, you would call the bot and the bot is trained on specific questions that you interview. Like it gives you an interview and from that interview, I'm able to generate content that I could potentially use in a post. So this idea came, go ahead, yeah.\r\n\r\n\r\nNikolas Hulewsky (12:17.678)\r\nOkay, so when you say con.\r\n\r\n\r\nYeah, go ahead. Go ahead.\r\n\r\n\r\nPranav Ghatraju (12:24.25)\r\nSo I'm just gonna share my screen real quick. It's, it's,\r\n\r\n\r\nNikolas Hulewsky (12:26.83)\r\nWhen you say content, are you talking about marketing copy or are you talking about like LinkedIn, Instagram, Facebook, Twitter posts?\r\n\r\n\r\nPranav Ghatraju (12:30.925)\r\nYeah.\r\n\r\n\r\nPranav Ghatraju (12:35.15)\r\nYeah, I'm primarily building this for Twitter and LinkedIn, mainly just to get that top of funnel content. it's still pretty unrefined, but just building this out has been really cool. One thing I've been really fascinated by has been voice agents, because like...\r\n\r\n\r\nNikolas Hulewsky (12:40.632)\r\nMmm. Yeah.\r\n\r\n\r\nPranav Ghatraju (12:56.516)\r\nThere's so many times where I really want someone around, forget like customer service, but just the opportunity to really talk with somebody. And then they're not available. It's like 3 a.m. They're not around. Like if I want content done and like I don't have anything for the week, like I don't want to be sitting down. I just want to like, you know, hit record, just walk around the block and just have this conversation. And after I'm done, then I can, I have, you know, piece of content. So let me, let me just, we'll just do a quick demo of this. So.\r\n\r\n\r\nNikolas Hulewsky (13:18.968)\r\nHahaha!\r\n\r\n\r\nNikolas Hulewsky (13:25.708)\r\nYeah, I'd love to see it.\r\n\r\n\r\nPranav Ghatraju (13:26.81)\r\nI hope it\r\n\r\n\r\nPranav Ghatraju (13:32.004)\r\nAre you able to see my screen? Yeah. Let me just hit record.\r\n\r\n\r\nNikolas Hulewsky (13:33.25)\r\nYeah. Yep.\r\n\r\n\r\nPranav Ghatraju (13:43.002)\r\nWere you able to hear that?\r\n\r\n\r\nNikolas Hulewsky (13:44.994)\r\nI don't hear anything, but.\r\n\r\n\r\nNikolas Hulewsky (13:49.23)\r\nThat's okay.\r\n\r\n\r\nPranav Ghatraju (13:49.86)\r\nSo basically, once I have... Let me pull up a transcript. So this is the backend of this. This is an app called Bubble. I like to use this for visual interfaces.\r\n\r\n\r\nNikolas Hulewsky (14:01.678)\r\nOkay, let me ask you this question, all right? basically what you're doing is you're taking the audio, the audio is then getting converted into a transcript and then you are taking that transcript, right? And repurposing it, et cetera. So I get that piece. Why are you using bubble? So like, why not something like Replet or Cursor or Lovable? Is it Lovable? What's that one? Yeah, Lovable.\r\n\r\n\r\nPranav Ghatraju (14:23.418)\r\nYeah, lovable, yeah. this is a really good question. This is a really good question, Nick. It's mainly because it's something I'm comfortable with at the moment. for me, I do, I used, before all these tools came out, I was already developing on Bubble. So I understood how to piece things together. And it just...\r\n\r\n\r\nNikolas Hulewsky (14:31.72)\r\nokay. Okay.\r\n\r\n\r\nPranav Ghatraju (14:45.198)\r\nLike lot of these tools like Lovable, I just feel at the moment it's meant to make coders life easier. Like someone who like actively codes. Like though I know how to read code, I'm not good at writing it. And like if someone were to go in and if I were to outsource that portion of it, like I feel like I'd be more or less lost. Whereas this case like with Bubble, it's like a drag and drop interface. It's like building with Wix where you have some logic in the backend too. So these are like some of the logic\r\n\r\n\r\nNikolas Hulewsky (14:53.134)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (15:04.993)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (15:09.666)\r\nExactly.\r\n\r\n\r\nPranav Ghatraju (15:15.162)\r\nI here for like, you know, I make the call to I use make in this case for like handling the transcript But then like all the interactions are also ting like if I have a transcript like it hides it then I can go to my content pieces so\r\n\r\n\r\nNikolas Hulewsky (15:16.471)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (15:28.261)\r\nHave you heard of a software called Flowwise?\r\n\r\n\r\nPranav Ghatraju (15:33.466)\r\nYes, so Flowwise is actually, it's more for developing AI apps specifically. Oh, I think I to be, I don't think I'm logged in just one second.\r\n\r\n\r\nNikolas Hulewsky (15:43.308)\r\nYeah, I'm trying to figure out where flow wise fits in. It's like, okay, I N8N, Zapier, Make. Okay, I get what those do. I get what Replet, Cursor, Lovable do. I get what Bubble does, so to speak. But flow wise, I'm like, what does flow wise do? I don't quite understand where that fits into.\r\n\r\n\r\nPranav Ghatraju (15:50.276)\r\nMm-hmm.\r\n\r\n\r\nPranav Ghatraju (16:04.666)\r\nSo Flowwise is very similar to NADen, I would say, where it's like you can build out workflows. But the difference between Flowwise and NADen comes down to kind of the language. So Flowwise is built on top of a framework called LangChain.\r\n\r\n\r\nNikolas Hulewsky (16:10.542)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (16:24.728)\r\nMm.\r\n\r\n\r\nPranav Ghatraju (16:24.952)\r\nwhere it's like, that's the underlying framework it uses. Whereas N8n, I'm not sure what it's built off of. And it's mainly geared for, N8n is really much like, I think it's like Zapier and Make on steroids. Whereas Flowwise is like a different category altogether, I would say. Mainly geared towards more complex AI apps. Like with Flowwise, you were able to do very complex queries to graphs and where you can talk with unstructured data.\r\n\r\n\r\nNikolas Hulewsky (16:38.796)\r\nExactly.\r\n\r\n\r\nPranav Ghatraju (16:54.966)\r\nwhich I haven't seen that with NADN yet. But for most use cases, NADN is like, I would say for most use cases, NADN is the, is much more, it has a lower barrier to entry than Flowise.\r\n\r\n\r\nNikolas Hulewsky (16:57.526)\r\nOkay. Thanks for letting me.\r\n\r\n\r\nNikolas Hulewsky (17:09.55)\r\nOkay, thanks for letting me squirrel. All right, so you've got some transcripts up here. So after you do the voice to text, it's generated a transcript. Where does that go?\r\n\r\n\r\nPranav Ghatraju (17:14.916)\r\nMm-hmm.\r\n\r\n\r\nPranav Ghatraju (17:20.196)\r\nSo basically what I'm able to do is like in the back end, I've set up a make scenario that takes this transcript and just breaks it down into different based on the questions it asks. So there's like a list of questions the bot asks. Yeah. So it's still a work in progress and like it might, it might leak some things out, but like it's, it's yeah. Yeah. So it's basically what it does. It scans each question in the answer and just takes that portion of the transcript.\r\n\r\n\r\nNikolas Hulewsky (17:32.514)\r\nAre you able to show me? Can I see it?\r\n\r\n\r\nNikolas Hulewsky (17:37.294)\r\nSick.\r\n\r\n\r\nNikolas Hulewsky (17:41.166)\r\nOkay, okay, that's fine. Yeah.\r\n\r\n\r\nPranav Ghatraju (17:49.282)\r\nSo you have different AI modules programmed for that use case. Just look at this question, give me the answer. So question one, question two, question three.\r\n\r\n\r\nNikolas Hulewsky (17:56.884)\r\nso the audio is specific questions that then correspond with the make automation.\r\n\r\n\r\nPranav Ghatraju (18:03.674)\r\nSo that's what the bot...\r\n\r\n\r\nSo basically what the flow is, is that I wish I could, maybe I could make this a little more visual for you.\r\n\r\n\r\nNikolas Hulewsky (18:16.824)\r\nYeah, I'm also trying to get people an idea of like, how would I even map this, right?\r\n\r\n\r\nPranav Ghatraju (18:21.282)\r\nYeah, so basically the flow is, and I think this is a very good idea we can do this, is you start with, you like you start the interview.\r\n\r\n\r\nAnd once you finish the interview, you have the option to send that transcript to the bot or you can delete the transcript. Sometimes you like what we just did, like we started, you're not able to hear the audio. You want to give that option to the user. So let's say that I'm just giving the use case like we're just going to keep continuing. So you start the interview. You after post interview transcript is generated.\r\n\r\n\r\nNikolas Hulewsky (18:49.762)\r\nperson.\r\n\r\n\r\nYep.\r\n\r\n\r\nNikolas Hulewsky (19:00.982)\r\nAnd the interview is specific questions. It's not just me talking ad hoc off the top of my head.\r\n\r\n\r\nPranav Ghatraju (19:04.984)\r\nNo, no, no, it's like, yeah. So the AI, the bot is like, it has questions loaded into it that it needs to ask that are mainly geared towards like...\r\n\r\n\r\nIt's geared towards your expertise. It's geared towards what's going on in your business currently. And it asks questions based on that so it can generate. So you can get those ideas unstructured into the transcript. And from that transcript, it generates the content. So once the interview transcript is generated, it gets sent to make automation.\r\n\r\n\r\nto sort the questions. So once each question is sorted, you get three varieties. So you can get like a piece on like thought leadership, a piece on.\r\n\r\n\r\nPranav Ghatraju (20:03.098)\r\nI think it's like authority so like actually sorry like a story out of it and third third one is just a I Think it's like a how-to guide It's pretty new. I'm still I'm still figuring it out myself what I did exactly what I did exactly but but like the\r\n\r\n\r\nNikolas Hulewsky (20:09.212)\r\nHello.\r\n\r\n\r\nNikolas Hulewsky (20:17.957)\r\nNo, no, this is, don't worry. Like this is amazing. Like just thinking through the flow of it, I think is important.\r\n\r\n\r\nPranav Ghatraju (20:25.848)\r\nYeah, so basically what happens is you have this interview with the bot. Then once that interview is finished, you have this transcript that has like a whole slew of text. And then you sent it to AI to sort the text and from the text for each question.\r\n\r\n\r\nPranav Ghatraju (20:46.884)\r\nFor each question, you get three vehicles to inspire change in your audience. And right now, it's pretty generic, but this could be huge where if you turn this into a full-fledged app where you can load, this is the ICP I'm looking to target, give me, give me, good.\r\n\r\n\r\nNikolas Hulewsky (20:47.054)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (21:07.31)\r\nThere's a lot of people who would listen to this and be like, well, I'm not going to post content. I'm kind of lame. But if you look at it from the other end of the spectrum, is what would you use interviews for to then generate stories? Well, I could be an executive at a company and I just am recording our weekly updates, right? Or, hey, I want to record stories that my mom tells about\r\n\r\n\r\nPranav Ghatraju (21:14.168)\r\nMm-hmm.\r\n\r\n\r\nPranav Ghatraju (21:23.5)\r\nMm-hmm. Yeah.\r\n\r\n\r\nPranav Ghatraju (21:31.193)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (21:35.576)\r\nher childhood or I want to record stories about myself for my kids. You can still do this. You can get them prompted, sent to you. You're on a walk. You say it into your AirPods. AI then takes it and makes it prettier, know, pretty's it up. Hopefully, you know, it's not lying about anything, but I think there's a ton of potential use cases in just this flow that you're talking about.\r\n\r\n\r\nPranav Ghatraju (21:41.369)\r\nMm-hmm.\r\n\r\n\r\nPranav Ghatraju (21:51.726)\r\nYeah.\r\n\r\n\r\nPranav Ghatraju (21:56.154)\r\nyou\r\n\r\n\r\nPranav Ghatraju (22:00.142)\r\nYeah, and like the way I like to think of this is, you know, really expanding, know, you're augmenting your capability. Like, sure, like you can, you know, sit down and answer a bunch of questions and send it to send it to an AI to really expand. But what you're given here is like a structure to work with such that all you do is press interview, you press stop and in the back end, so much goes on. Like this whole whole flow should be completed within like six or seven minutes. How's that versus an hour like sit\r\n\r\n\r\ndown and like ideating everything. After this call I'll shoot you a Loom video with how this works. think that'll be more descriptive. I think with the recording, what's going on right now, it doesn't pick up system sound so that's why you're not able to hear the bot. think, yeah, but this is just a primer into the capabilities what you hear. And if I just go to the screen real quick, these are some of the, like, this is some of the content I got from this transcript.\r\n\r\n\r\nNikolas Hulewsky (22:36.334)\r\nYeah, that would be.\r\n\r\n\r\nNikolas Hulewsky (22:44.286)\r\nMmm. Yeah, no worries.\r\n\r\n\r\nPranav Ghatraju (22:59.996)\r\nwhere it's like Stop like this is using chat GPT because it was just mainly for a use case standpoint just to see how it would work and not like for actual actual like, you know production but like these\r\n\r\n\r\nNikolas Hulewsky (23:11.598)\r\nDo you know, you know how I knew it chat TPT? The emoji.\r\n\r\n\r\nPranav Ghatraju (23:18.892)\r\nYeah, yeah exactly. I don't know either like I have to make sure like every prompt like please don't output emojis please don't output emojis.\r\n\r\n\r\nNikolas Hulewsky (23:19.758)\r\nDude, chat DVD's obsessed with emojis, man. I don't know what it is.\r\n\r\n\r\nNikolas Hulewsky (23:30.35)\r\nI know, dude. That's so funny. Okay, so this is a story basically from the transcript. It's turned into a story.\r\n\r\n\r\nPranav Ghatraju (23:37.88)\r\nYeah, like, mm-hmm. And like, again, like you can play around with the prompting to improve the formatting, but again, this is also chat GPT for like,\r\n\r\n\r\nNikolas Hulewsky (23:47.854)\r\nNow, is your agency specifically focused on creating content or is this just one of the use cases that you've created at your agency and you're doing a lot of other things?\r\n\r\n\r\nPranav Ghatraju (23:57.54)\r\nThis is mainly just an internal thing I wanted to test out, just mainly to play around with voice agents and just test the capability. But I would say that one of the key points I like to focus on is content, because the barrier to entry is just now so low.\r\n\r\n\r\nNikolas Hulewsky (24:06.912)\r\nno.\r\n\r\n\r\nPranav Ghatraju (24:14.456)\r\nlike with all these tools, can forget like AI generated content, but you can make AI content that's actually good. And like that's actually moving people like down the funnel if you prompt it, right? Like I was just reading something about, know, like cold to hot traffic, just as I'm learning marketing.\r\n\r\n\r\nAnd how much it makes sense to utilize what you're seeing in these readings and apply it to your content. What does it mean to make content to move people from cold to warmer audience? What does it mean to nurture? What does a nurture post look like? It's just so easy to get 80 % there where the remaining 20 % just comes down to understanding your customers.\r\n\r\n\r\nNikolas Hulewsky (24:50.39)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (25:01.516)\r\nNope, for somebody like me, have 130 ish podcasts, of information there. Obviously I have a ton of posts that I've created. Would I use a tool like this to create content or like what would I do with all that content that I'm sitting on?\r\n\r\n\r\nPranav Ghatraju (25:06.618)\r\nMm-hmm.\r\n\r\n\r\nPranav Ghatraju (25:16.568)\r\nAbsolutely, absolutely. So the way I like, I would think of it, Nick, is like, you have all this content. So now from this content, you need to really figure it out. What are things that would appeal to my ICP?\r\n\r\n\r\nLike, know, if I'm looking, what is the goal I want to use? For example, someone that's cold and doesn't know what, you know, what your podcast is about, what your business is about, you really need to say like, okay, like they have a problem. They don't even know they might have it, but what is something to least catch their attention? So, so just building out a content around like, you know, that, that side of things based on what you already have.\r\n\r\n\r\nNikolas Hulewsky (25:46.558)\r\nInteresting.\r\n\r\n\r\nPranav Ghatraju (25:55.948)\r\nAnd then same thing, what's something that, okay, they know who I am, they just need to buy me, they need more content to, such that they buy into me a little more, what would that look like? And just building out this bank and bank of content that you could work with. Like, it shouldn't, you shouldn't have a situation anymore where like, I don't have anything to write about. you're not, like, writer's block doesn't exist anymore. Like, the curi, the curi, the,\r\n\r\n\r\nNikolas Hulewsky (26:14.953)\r\nHahaha!\r\n\r\n\r\nNikolas Hulewsky (26:20.128)\r\nWell, it still does for me. haven't, I haven't figured out, I haven't figured out how to do it right, man. It's, it's, it's hard. It's hard because you want to feel authentic. You don't want to have a bunch of emojis in there. You want it to sound like your voice. And, I think the thing I haven't quite figured out is the context window is only so broad. So how do I get all of my content in there? And then also prompt it to.\r\n\r\n\r\nPranav Ghatraju (26:25.998)\r\nMm-hmm.\r\n\r\n\r\nPranav Ghatraju (26:29.337)\r\nYeah.\r\n\r\n\r\nPranav Ghatraju (26:32.974)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (26:49.526)\r\nwrite the things that I want it to write in the voice that I want it to write. It feels like I need to almost train a bottle at this point, as opposed to just use the context window that's available to me.\r\n\r\n\r\nPranav Ghatraju (26:52.09)\r\nMm-hmm.\r\n\r\n\r\nPranav Ghatraju (27:00.122)\r\nYeah, so that's where it becomes really important to break it into micro steps.\r\n\r\n\r\nLike one of the things I've noticed just building this out is rather than loading an AI with a bunch of instructions, really breaking it down into smaller steps such that you have an agent that's just focused on finding your brand voice. You have an agent that's just focused on ideation, an agent just focusing on taking those ideas and expanding it, an agent that actually writes the content, and then an agent that edit. Yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (27:30.434)\r\nWhen you say an agent, you mean like a GPT, like a custom GPT that I built? Okay.\r\n\r\n\r\nPranav Ghatraju (27:35.052)\r\nOr like, for example, in Zapier, you have like a specific module just dedicated to that. That specific use case in the prompting is just dedicated, just such that when it gets this task, it fulfills that task to its ability with the desired output. So many times, yeah, go ahead. Sure, please do,\r\n\r\n\r\nNikolas Hulewsky (27:52.904)\r\nI want to show you, can I show you something? No, no, finish your thought. I'm going to share my screen.\r\n\r\n\r\nPranav Ghatraju (27:58.466)\r\nI was just going to say like many, many times, like when people dive into this, they tend to forget that like one workflow, like what we think of, like when we're typing to chat GPT, there's actually a bunch of things going on in the background.\r\n\r\n\r\nis like, because the whole point of LLMs is predicting what the next thing will be, right? So the way they take, for example, you know, write me something about this. It's probably taking that input and really taking 50 inputs and the probability of which one they're looking for to ultimately get the output. Whereas if you give it a structure of this is exactly what I want you to do, it knows how to output that such that you get a more desirable result.\r\n\r\n\r\nNikolas Hulewsky (28:16.578)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (28:38.136)\r\nSo I have some of these GPT over here that I've created. This GPT, for example, I'll load, it's called the business research assistant. I'll put a transcript from an episode that I've recorded it and it will spit out for me a summary of that business, but also with some insights of what the industry looks like, how somebody might get into this business, et cetera. I have this one is the content strategist. So I've told it.\r\n\r\n\r\nPranav Ghatraju (28:58.008)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (29:06.604)\r\nHey, I'm going to take this transcript. I'm going to give you everything, give you the whole transcript and then give me some ideas of what to post to Twitter, to LinkedIn, give me some thread ideas, give me some just short post ideas, et cetera. I've got, I don't have it on here. I have a prompt specific for quotes in the introduction of my podcast. So after, you know, we record a podcast, I'll have it go through the transcript and find me quotes that will go at the very beginning of it.\r\n\r\n\r\nAnd then I have another GP another GPT that tells me like, just give me an idea of what this business does. Right. But I run those all separately. You can see I have separate GPTs and like I copy and paste the transcript into into separate GPTs. Are you saying I could set it up where I don't even need to do it separately? It would just with with a make automation, it could just run it for each one of those.\r\n\r\n\r\nPranav Ghatraju (29:35.308)\r\nMmm, nice.\r\n\r\n\r\nPranav Ghatraju (29:43.684)\r\nMm-hmm.\r\n\r\n\r\nPranav Ghatraju (29:56.302)\r\nYeah, if there's open AI has this thing called the assistance API where you can build your like what you have like your custom GPTs you can build a you can build your own assistance within your open AI that you can essentially API into and get these things such that they're in automated flow. So for example, if you have like, let's take for example, what's like let's take your content strategist pro.\r\n\r\n\r\nLike for that to happen, you have one for hooks, one for the body, pass that one for the, you know, the CTAs based on like what, what sort of CTAs you are looking for. And finally, like something to edit that. Like you can basically string them together.\r\n\r\n\r\nNikolas Hulewsky (30:36.814)\r\nYeah, like that.\r\n\r\n\r\nThis is my folder for content creations. It's like, that's what takes the episodes and tells me what content I can create around it. This is the project folder that I have for intros, right? So that's, this is what gives me the quotes. And then obviously I use these GPTs for other things. So how would I set it up? Where would I go? How would I actually create this? I'd come up here to.\r\n\r\n\r\nPranav Ghatraju (30:42.393)\r\nMm-hmm.\r\n\r\n\r\nPranav Ghatraju (30:49.818)\r\nMm-hmm.\r\n\r\n\r\nPranav Ghatraju (30:58.362)\r\nSo the first thing would be to like, if you go to, I'll send you the link in the chat.\r\n\r\n\r\nNikolas Hulewsky (31:23.15)\r\nWhat's it called?\r\n\r\n\r\nPranav Ghatraju (31:25.378)\r\nIt's like the, it's called OpenAI Playground.\r\n\r\n\r\nNikolas Hulewsky (31:29.614)\r\nIt's an AI playground, okay?\r\n\r\n\r\nPranav Ghatraju (31:32.282)\r\nSo this is attached to your OpenAI account. So if you open that up, you just log in.\r\n\r\n\r\nNikolas Hulewsky (31:39.596)\r\non there. Loading.\r\n\r\n\r\nNikolas Hulewsky (31:46.476)\r\nwaiting for platform.\r\n\r\n\r\nNikolas Hulewsky (31:52.664)\r\nYeah, like, cause I've created all these custom GPTs, but I'm not, there's nothing automated.\r\n\r\n\r\nPranav Ghatraju (31:58.168)\r\nYeah, so if you log in.\r\n\r\n\r\nNikolas Hulewsky (32:01.339)\r\nI did push it. My internet's apparently very slow.\r\n\r\n\r\nor have too many windows open.\r\n\r\n\r\nProbably too many windows.\r\n\r\n\r\nNikolas Hulewsky (32:20.11)\r\nI'm so excited to try this.\r\n\r\n\r\nPranav Ghatraju (32:30.938)\r\nSo you see it says assistance in the nav bar. yeah. So do you have, need to load, you have to load credits into your OpenAI account because this is connecting, yeah, because it's connecting directly to the server because you're kind of borrowing their infrastructure to build this out so you can API into it. So they like, think.\r\n\r\n\r\nNikolas Hulewsky (32:34.636)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (32:40.685)\r\nto sit up.\r\n\r\n\r\nNikolas Hulewsky (32:46.871)\r\ndoesn't just go\r\n\r\n\r\nNikolas Hulewsky (32:56.984)\r\nWill it charge me every time I run it from now on?\r\n\r\n\r\nPranav Ghatraju (33:01.462)\r\nNo, no, like it's the way it runs you it's on a credit system So like it's per it's on a per call basis. Yeah, so yes. Yes. I had to speak that out to really come to terms with it\r\n\r\n\r\nNikolas Hulewsky (33:10.574)\r\nOkay. That's okay. Cause I'm, I have the, the $200 a month plan or whatever.\r\n\r\n\r\nPranav Ghatraju (33:22.458)\r\nSo that's for chat GPT. This is going, it's kind of weird because like a chat GPT that's like public facing, where it's like, I'm just going to say, you can be one of behind your screen for this. Where chat GPT is kind of the public facing, but in the backend, like OpenAI has the ability that you can build your own chat GPT on top.\r\n\r\n\r\nNikolas Hulewsky (33:33.006)\r\nYeah, I did. I did.\r\n\r\n\r\nThis\r\n\r\n\r\nPranav Ghatraju (33:45.688)\r\nSo to do that, load your account with credits such that you can borrow this infrastructure from chat or from OpenAI. So this is how you can use it with make automations.\r\n\r\n\r\nNikolas Hulewsky (33:52.974)\r\nI'll do that right now.\r\n\r\n\r\nNikolas Hulewsky (34:00.249)\r\nHow much money should I put in? I have no idea.\r\n\r\n\r\nPranav Ghatraju (34:02.766)\r\nI like for just for now I I tip I've loaded 10 bucks and it's it's yeah it's it's lasted me since since October so I think you're fine\r\n\r\n\r\nNikolas Hulewsky (34:07.086)\r\n10 bucks. Okay.\r\n\r\n\r\nNikolas Hulewsky (34:15.778)\r\nOkay, cool. Confirm payment. 10 bucks. And I'll go back to showers. Are you good on time?\r\n\r\n\r\nPranav Ghatraju (34:26.809)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (34:34.958)\r\nIt's processing. I see it spinning. Here we go. Yeah, baby.\r\n\r\n\r\nNikolas Hulewsky (34:43.96)\r\nAll right. We did it.\r\n\r\n\r\nPranav Ghatraju (34:45.828)\r\nSo now what we can do, yeah, so we go to start building in the right, So that should take us back to, oops.\r\n\r\n\r\nNikolas Hulewsky (34:52.046)\r\nStart building.\r\n\r\n\r\nNikolas Hulewsky (34:59.328)\r\nEconomics. What best describes me?\r\n\r\n\r\nPranav Ghatraju (35:03.758)\r\nI would say somewhat. I wouldn't say you're not...\r\n\r\n\r\nNikolas Hulewsky (35:05.547)\r\nOK. I can use words that sound technical.\r\n\r\n\r\nNikolas Hulewsky (35:12.238)\r\ninvite you later. Make your first API call.\r\n\r\n\r\nPranav Ghatraju (35:15.802)\r\nSo this is like what you say, API key. So I would hide your screen for this because this is where you, like these API keys, like you don't want them going out public. So, because essentially someone has access to this key, you can just call it any test key, for example.\r\n\r\n\r\nNikolas Hulewsky (35:28.366)\r\nOkay, so I just call it.\r\n\r\n\r\nNikolas Hulewsky (35:36.888)\r\ntest the project name. Test one, I don't know. Generate API key.\r\n\r\n\r\nPranav Ghatraju (35:46.98)\r\nSo I would just copy paste that key into like a notepad or something. you don't have to write it down, but into like your text or something. Like a sticky note. Yeah.\r\n\r\n\r\nNikolas Hulewsky (35:54.826)\r\nYes, Yes, sir. Let me let me just.\r\n\r\n\r\nIt's funny, Trying to figure out where to save everything.\r\n\r\n\r\nPranav Ghatraju (36:05.722)\r\nThey don't really make it that easy.\r\n\r\n\r\nNikolas Hulewsky (36:08.215)\r\nOkay, so I've got my API key. What about this thing where it says run this curl command in a terminal to generate a haiku or free using GPT-40 minimum? Like, what is this?\r\n\r\n\r\nPranav Ghatraju (36:20.566)\r\nYeah, that's essentially it. So curl is the language that you use to communicate with APIs. So that's what we have Zapier and make for they handle that block of code for us. So what we're going to do is actually, we're going to create our assistant and then we're going to use those block of codes that they've already made to essentially create like automated workflow. So if you can share your screen, let's we can get started. So let's first start with building out this. We can first start with building the assistant.\r\n\r\n\r\nNikolas Hulewsky (36:30.659)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (36:44.163)\r\nYes, sir.\r\n\r\n\r\nNikolas Hulewsky (36:50.306)\r\nSo do I need to copy just curl node or?\r\n\r\n\r\nPranav Ghatraju (36:52.922)\r\nNo, you just have to hit, you can just hit continue. Did you already copy your key? I already bought credits later, you already bought it. Yeah. Yeah, so now what we'll do is go to Playground in the right. Yep, Playground. And we'll go back to Assistance.\r\n\r\n\r\nNikolas Hulewsky (37:01.518)\r\nI already bought, yeah, I already have credits. Okay, cool.\r\n\r\n\r\nPranav Ghatraju (37:17.77)\r\nAnd there should be an option to create a new assistant. So I'm just going in.\r\n\r\n\r\nNikolas Hulewsky (37:22.792)\r\nsee here this is clear thread files attached to thread message\r\n\r\n\r\nRun.\r\n\r\n\r\nPranav Ghatraju (37:31.546)\r\nAnd in mine, I have an option to create assistant. I don't see that.\r\n\r\n\r\nNikolas Hulewsky (37:35.884)\r\nHere we go. Sorry, my window is too small. have it split screen right now. Okay, cool. Sorry, my fault.\r\n\r\n\r\nPranav Ghatraju (37:39.29)\r\nOkay, okay. Yeah, so now what we'll do, and all good, all good. So now what we'll do is let's create that content creation one. So if we go back to the custom GPT screen you had, chat GPT.\r\n\r\n\r\nNikolas Hulewsky (37:54.606)\r\nAll hold freeze.\r\n\r\n\r\nPranav Ghatraju (38:05.036)\r\nanytime.\r\n\r\n\r\nThese are the type of things that also give me energy. now what we'll do is like, so we go to the content strategies. This is a GPT you made, right? So what we can do is if you hit the edit button on the right, we'll try, or you can do that, yeah, edit GPT.\r\n\r\n\r\nNikolas Hulewsky (38:11.959)\r\nGood, good, good, good. Okay. So I'm back here.\r\n\r\n\r\nNikolas Hulewsky (38:21.1)\r\nMm-hmm. Yes.\r\n\r\n\r\nPranav Ghatraju (38:33.87)\r\nWe're just going to copy paste the prompt that you used.\r\n\r\n\r\nNikolas Hulewsky (38:37.381)\r\nHow do I do that?\r\n\r\n\r\nPranav Ghatraju (38:38.628)\r\nthing as you go to configure yeah so all of this yeah these are instructions just that's the prompt so we're just gonna copy paste that into our system\r\n\r\n\r\nNikolas Hulewsky (38:43.896)\r\nThese are the instructions.\r\n\r\n\r\nNikolas Hulewsky (38:52.408)\r\nOkay?\r\n\r\n\r\nNikolas Hulewsky (38:56.536)\r\nSo in the system instructions, that's what I'm pasting into the assistant.\r\n\r\n\r\nPranav Ghatraju (39:00.654)\r\nYes. I don't see your screen. there we go. System. Right. Yep. And we'll scroll down. That's perfect for now.\r\n\r\n\r\nNikolas Hulewsky (39:04.462)\r\nI'm just pasting it in here. Okay.\r\n\r\n\r\nNikolas Hulewsky (39:10.36)\r\nAnd then the GPT-4-0.\r\n\r\n\r\nPranav Ghatraju (39:15.384)\r\nSo if you click, I think this is also important, but if you look at the tools available, this is really cool stuff. basically, for example, if you're getting a little more techie, the purpose of AI agent is you can load it with different tools such that it can perform, it function better.\r\n\r\n\r\nNikolas Hulewsky (39:33.006)\r\nMmm.\r\n\r\n\r\nPranav Ghatraju (39:34.754)\r\nSo let's say like you need to do calculations, like you're dealing with Excel files. Well, you can load it with a calculator such that it's more empowered to do those calculations better. Like N8n does a really good job of this, like building out, they built out like a calculator tool, they have a calendar tool to like make dates easier and all of those parameters. like.\r\n\r\n\r\nNikolas Hulewsky (39:55.18)\r\nWhat is this?\r\n\r\n\r\nKeep going, sir.\r\n\r\n\r\nPranav Ghatraju (39:58.756)\r\nSo these are all different parameters to help with the output to limit hallucinations. So basically with AI, it's all about you're giving a creative ability to come up with decisions. So what this does is you are able to limit the creativity. So off the top of my head, like.\r\n\r\n\r\nTypically these are like default values, like temperature, it's typically, it's a function of how diverse and creative you want your answer to be. if it's like one based on the input, it could really stray away from like what it thinks it's a good answer. Whereas if it's lower, it'll try to script stick to script. So typically a good amount to be at is like around one, like anything less than one, kind of making a little too rigid and anything above\r\n\r\n\r\nNikolas Hulewsky (40:42.653)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (40:46.158)\r\nHow big is this content window and the system instructions? Like, I put a lot more in here?\r\n\r\n\r\nPranav Ghatraju (40:54.83)\r\na little too much creative freedom.\r\n\r\n\r\nPranav Ghatraju (41:04.546)\r\nYeah, so that you could, yeah, maybe. What if you press it? Yeah, so I mean, the whole point is like, you tinker down with the prompt until you get like, desired output you would like.\r\n\r\n\r\nNikolas Hulewsky (41:06.647)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (41:14.944)\r\nof this thing.\r\n\r\n\r\nNikolas Hulewsky (41:19.086)\r\ndon't know.\r\n\r\n\r\nPranav Ghatraju (41:19.322)\r\nMaybe like I think I think it's just a way to adjust the prompting So like rather than you having\r\n\r\n\r\nNikolas Hulewsky (41:24.514)\r\nSo do I hit clone? Is that what I do? what do I do now?\r\n\r\n\r\nPranav Ghatraju (41:29.272)\r\nYeah, or actually, I think you can just save it. I think it's just auto-saved. So let's do a test run. where it says enter your message. Let's just say, say, yeah, well, let's say, let's just put a sample transcript in there. Yeah.\r\n\r\n\r\nNikolas Hulewsky (41:38.734)\r\nOkay, what do I do here? Do I a transcript in here?\r\n\r\n\r\nNikolas Hulewsky (41:47.822)\r\nI'm going to go to get a transcript.\r\n\r\n\r\nFrom a recent episode, I just did an episode with Nick Huber.\r\n\r\n\r\nNikolas Hulewsky (42:02.446)\r\nGrab that transcript and get in the shop.\r\n\r\n\r\nNikolas Hulewsky (42:13.805)\r\nand then run.\r\n\r\n\r\nNikolas Hulewsky (42:23.726)\r\nIt looks like it's just this isn't the whole transcript. Too large. Okay.\r\n\r\n\r\nPranav Ghatraju (42:27.828)\r\nMm-hmm. so the context... Where did you say the two large?\r\n\r\n\r\nNikolas Hulewsky (42:34.998)\r\nRun failed, request too large for GPT-4.0 in organization.\r\n\r\n\r\nmeans.\r\n\r\n\r\nPranav Ghatraju (42:44.794)\r\nOh, it's saying like the input tokens were too high. So like this operates on a token system. basically like each, I think a group of words is like one token or one token is a group of words, something like that. And like this exceed, that's not about the cost. It's just like the how many tokens was inputted in. So it's basically the load on the server is a little too much. So maybe if we clean this up, it might get a little less. I don't know, but do you have a clean transcript?\r\n\r\n\r\nNikolas Hulewsky (42:58.542)\r\nDid this cost more than I have?\r\n\r\n\r\nNikolas Hulewsky (43:04.483)\r\nNikolas Hulewsky (43:09.815)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (43:13.55)\r\nthe outset.\r\n\r\n\r\nPranav Ghatraju (43:14.618)\r\nYeah, let's see what it looks like with the clean transcript.\r\n\r\n\r\nNikolas Hulewsky (43:22.71)\r\nHow do you define a clean transcript?\r\n\r\n\r\nPranav Ghatraju (43:26.042)\r\nFor example, without timestamps or like any awkward breaks, things like that. Because like essentially timestamps take up word space.\r\n\r\n\r\nNikolas Hulewsky (43:29.998)\r\nNikolas Hulewsky (43:38.221)\r\nBye!\r\n\r\n\r\nYes, let me get one.\r\n\r\n\r\nNikolas Hulewsky (44:01.474)\r\nParis.\r\n\r\n\r\nNikolas Hulewsky (44:05.486)\r\nmight have the same problem.\r\n\r\n\r\nNikolas Hulewsky (44:14.446)\r\ntoo large. Okay. I don't all my transcripts have timestamps.\r\n\r\n\r\nPranav Ghatraju (44:21.252)\r\nWell, okay, I mean, that's a thing, but what we could do is, why don't we just take a portion of the transcript, like a small, you know, half of the transcript. Let's start with that.\r\n\r\n\r\nNikolas Hulewsky (44:34.83)\r\nGood idea.\r\n\r\n\r\nNikolas Hulewsky (44:49.865)\r\nFirst 20 minutes.\r\n\r\n\r\nNikolas Hulewsky (45:00.75)\r\nStill too large.\r\n\r\n\r\nLet's try 16 minutes.\r\n\r\n\r\nPranav Ghatraju (45:09.178)\r\nI'm also playing around with some I had to\r\n\r\n\r\nNikolas Hulewsky (45:23.918)\r\nStill too large.\r\n\r\n\r\nNikolas Hulewsky (45:45.933)\r\nOkay.\r\n\r\n\r\nPranav Ghatraju (45:47.706)\r\nBut basically, why don't we just say hi and let's see where it takes us.\r\n\r\n\r\nNikolas Hulewsky (45:53.219)\r\nYes, sir.\r\n\r\n\r\nPranav Ghatraju (45:53.998)\r\nMaybe a lot. Let's see how it says.\r\n\r\n\r\nBasically what we're building here is like a chat GPT just for this particular use case.\r\n\r\n\r\nSee, like you mentioned that you want to get the user to get to 25,000. So let's see what he says. Yeah, so why don't we say I have a portion of this transcript. Maybe just copy paste five or six lines.\r\n\r\n\r\nNikolas Hulewsky (46:12.204)\r\nMm-hmm. That's right.\r\n\r\n\r\nNikolas Hulewsky (46:43.586)\r\nHere.\r\n\r\n\r\nNikolas Hulewsky (47:03.918)\r\nSo those are the content pillars that I have built into this prompt.\r\n\r\n\r\nPranav Ghatraju (47:08.282)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (47:11.394)\r\nAnd it looks like there's nothing returned for them. But here's an implementation strategy.\r\n\r\n\r\nPranav Ghatraju (47:19.234)\r\nInteresting. Yeah, maybe it's like a...\r\n\r\n\r\nNikolas Hulewsky (47:31.886)\r\nSo what would I do from here?\r\n\r\n\r\nPranav Ghatraju (47:34.702)\r\nYeah, so what I would do actually is rather than go with the assistant route, it seems like the context window is too small. I would actually just, know, whatever prompt you have in your custom GPT, just use that in like a makes. Do you have make by chance?\r\n\r\n\r\nNikolas Hulewsky (47:50.67)\r\nI've never used it before. Okay, try it and make.\r\n\r\n\r\nPranav Ghatraju (47:52.704)\r\nthat's okay. Like, it's very, very simple. Yeah, so what we can do is just send me over that prompt you have.\r\n\r\n\r\nPranav Ghatraju (48:07.354)\r\nwhich is you can send it in the chat and I'll share my screen.\r\n\r\n\r\nPranav Ghatraju (48:25.73)\r\nlike it got cut off at the end or is it\r\n\r\n\r\nNikolas Hulewsky (48:33.997)\r\nYeah, I got cut off.\r\n\r\n\r\nMaybe there's...\r\n\r\n\r\nPranav Ghatraju (48:37.353)\r\nMaybe if it's blue.\r\n\r\n\r\nNikolas Hulewsky (48:42.456)\r\nWe're trying our best here, okay?\r\n\r\n\r\nPranav Ghatraju (48:45.166)\r\nYep, we're all, we're just figuring out. And no matter what, Nick, we're just, we're always early to the game.\r\n\r\n\r\nNikolas Hulewsky (48:51.022)\r\nHere's the rest of that.\r\n\r\n\r\nPranav Ghatraju (48:55.811)\r\nAwesome\r\n\r\n\r\nNikolas Hulewsky (49:11.36)\r\nyeah, I'm very good. Very talented.\r\n\r\n\r\nPranav Ghatraju (49:18.596)\r\nSo I'm just gonna, I'm gonna go ahead and share my screen.\r\n\r\n\r\nPranav Ghatraju (49:29.818)\r\nSo what I'm doing here is like this is the make interface. So what it does is it makes it super easy to, you know, create these scenarios and it's trigger based. So trigger based means like it's based off of the start of something. So for now, I'm just going to load the OpenAI. So you just go choose a module, OpenAI, like chat GPT whisper.\r\n\r\n\r\nAnd for this case, what we'll do is we'll just say, create a completion. So that's kind of what we're, so every time we interface with OpenAI, like on chat GPT, this is the endpoint we're Like it determines which endpoint to hit. So sometimes if you pull us up an image, it'll ask to analyze the vision. So what we'll do is we'll just do this one. I already have a key loaded in, but I'll just say GPT.\r\n\r\n\r\nNikolas Hulewsky (49:57.862)\r\nOkay.\r\n\r\n\r\nPranav Ghatraju (50:34.83)\r\nuser.\r\n\r\n\r\nSo these are the different user roles. Like if you look at the documentation, it does a really good job of explaining the two. Like I wouldn't be able to explain it to you as well as the documentation. But basically what?\r\n\r\n\r\nNikolas Hulewsky (50:52.325)\r\n.\r\n\r\n\r\nPranav Ghatraju (51:01.572)\r\nSo these are like the different, how you're supposed to interact with the AI. So like, for example, the user is...\r\n\r\n\r\nlike what you type in to the chat, like what's, Tomorrow I have, we can work something out. Do you want to try this again tomorrow?\r\n\r\n\r\nNikolas Hulewsky (51:16.29)\r\nOkay, Pranav, I have a question. Hold on, I got a question for you. What is your schedule tomorrow?\r\n\r\n\r\nNikolas Hulewsky (51:28.25)\r\nI'm like, this is amazing. And I'm like, super excited to do this, but I can just feel myself. like, I'm not all there, but I want to, think it would be actually really cool to, go through and make a make automation. after I'm free after four, two o'clock mountain.\r\n\r\n\r\nPranav Ghatraju (51:33.261)\r\nUh-huh.\r\n\r\n\r\nPranav Ghatraju (51:37.4)\r\nYeah, sure, yeah.\r\n\r\n\r\nPranav Ghatraju (51:43.374)\r\nYeah.\r\n\r\n\r\nPranav Ghatraju (51:51.416)\r\nOkay, so that'd be like four. No, how does Friday look for you, Nick?\r\n\r\n\r\nNikolas Hulewsky (51:51.47)\r\nIs that too late?\r\n\r\n\r\nNikolas Hulewsky (51:58.742)\r\nI'll just show you.\r\n\r\n\r\nPranav Ghatraju (52:07.898)\r\nI Pacific time, know Easter time, everything else between us.\r\n\r\n\r\nNikolas Hulewsky (52:10.358)\r\nMountain. I'm on mountains.\r\n\r\n\r\nThis is my Thursday and Friday.\r\n\r\n\r\nPranav Ghatraju (52:19.844)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (52:22.03)\r\nSo we could do something here tomorrow at one o'clock Eastern.\r\n\r\n\r\nPranav Ghatraju (52:26.5)\r\nMm-hmm.\r\n\r\n\r\nPranav Ghatraju (52:33.274)\r\nYeah, I can do that. So why don't we do that in such a way like we'll figure out a project to build. Like maybe we can bounce ideas tonight and we can just build it on that call. How does that sound?\r\n\r\n\r\nNikolas Hulewsky (52:35.48)\r\nI'll see you later.\r\n\r\n\r\nNikolas Hulewsky (52:50.306)\r\nSounds amazing. Send it to...\r\n\r\n\r\nPranav Ghatraju (52:53.614)\r\nYeah, why don't we do that then?\r\n\r\n\r\nNikolas Hulewsky (52:58.39)\r\nYeah, okay.\r\n\r\n\r\nPranav Ghatraju (52:58.87)\r\nHere's my email. you have it? Okay, perfect.\r\n\r\n\r\nNikolas Hulewsky (53:02.254)\r\nI think that was the right one, Yeah, okay. Sorry, I just felt myself hit a wall and this is really good and I don't wanna waste it. So if you could do it tomorrow, that would be amazing too.\r\n\r\n\r\nPranav Ghatraju (53:04.28)\r\nYep, that's the right one.\r\n\r\n\r\nYep, that's the one, yep.\r\n\r\n\r\nPranav Ghatraju (53:17.466)\r\nSo yeah, so what I'll do is tomorrow we'll continue on this content creation use case, where it's like...\r\n\r\n\r\nNikolas Hulewsky (53:25.87)\r\nWell, because I like this because I have my podcast episodes. And from that one episode, I have a business plan that I create. I have ideas for posts. I get the quotes. And so I think I think we could we could do like three or four things that no longer have to be done one at a time.\r\n\r\n\r\nPranav Ghatraju (53:30.234)\r\nMm-hmm.\r\n\r\n\r\nPranav Ghatraju (53:34.329)\r\nMm-hmm.\r\n\r\n\r\nPranav Ghatraju (53:37.656)\r\nYeah.\r\n\r\n\r\nPranav Ghatraju (53:48.887)\r\nRight, you can build out like a streamlined flow. Cool, let's do that then. Yep. Awesome. So we'll touch base tomorrow. Yep.\r\n\r\n\r\nNikolas Hulewsky (53:49.846)\r\nYeah, okay. Yeah, that'd amazing. Okay, that sounds good to me. Thank you, man. I appreciate you very much. Yeah.",
  "metadata": {
    "duration": "",
    "date": "2025-04-17",
    "platform_source": "Google Drive"
  }
}