{
  "episode_number": "191",
  "episode_title": "$1 Million Revenue, $250K Cash Flow: The Smash My Trash Franchise Model with Kevin Moyer",
  "guest_name": "Kevin Moyer",
  "business_name": "Smash My Trash",
  "transcript": "﻿Nikolas Hulewsky (00:00.046)\r\nbeginning anyway, so it doesn't matter if we're like right on time. All right, Kevin, you are a franchise owner of one of my favorite franchises, Smash My Trash. It's simple, freaking great name. It's not something that's gonna be AI automated away. I love it. Tell me quickly about you and how many locations do you have? How many employees, top line revenue, where you're located, et cetera.\r\n\r\n\r\nKevin Moyer (00:17.785)\r\nMm-hmm.\r\n\r\n\r\nKevin Moyer (00:26.682)\r\nYeah, so I signed on as a franchisee of Smash My Trash in December of 2021. I opened my doors in August of 2022. I started with three territories and one truck and one driver. And I ended up buying two more territories. So I have a total of five now. I have four drivers and one virtual assistant. And I guess one of my favorite things about the business is that it is actually mostly passive right now.\r\n\r\n\r\nAnd that's kind of like a dirty word in the franchise world because a lot of times that ends up not being the case. But it is a really nice, simple, elegant business model that actually does support a passive owner. And I was kind of deliberate about setting it up that way. The other thing about it is it's 90 minutes from my house. that's like the closest part of the territory is 90 minutes away. The furthest part is like two and a half hours away. So I was driving down there every day for two years, basically.\r\n\r\n\r\nNikolas Hulewsky (01:15.16)\r\nWow.\r\n\r\n\r\nKevin Moyer (01:23.0)\r\nhad my first kid in January of last year and realized that, thank you, yeah, another one on the way, and realized I can't be driving down to Salinas, California every day and coming back at night. so I had to think even more about how to make it somewhat passive. And at this point, spend, I'd say no more than about an hour a day on it, answering calls from drivers, handling emails, collecting payment, and things like that. But it's really great business.\r\n\r\n\r\nNikolas Hulewsky (01:26.606)\r\nCongratulations.\r\n\r\n\r\nKevin Moyer (01:52.186)\r\nLike you said, there's a lot to like about it.\r\n\r\n\r\nNikolas Hulewsky (01:54.604)\r\nYeah, so you have five territories, five locations, four trucks. What's like three trucks? I'm sorry. What's like top monthly top line revenue?\r\n\r\n\r\nKevin Moyer (01:57.144)\r\nYes. Three trucks, four drivers. Yep.\r\n\r\n\r\nIt fluctuates. So we are seasonal, not every Smash. Actually, I think we are more seasonal than any other Smash my trash franchise. So in the summer.\r\n\r\n\r\nNikolas Hulewsky (02:12.056)\r\nThat's weird, because you would think California is pretty steady.\r\n\r\n\r\nKevin Moyer (02:15.758)\r\nYeah, so a lot of our customers are agricultural. And the way it works is when you go to the grocery store or anywhere and buy lettuce, there's a good chance it comes from my smash my trash territory, central California. Big, it's like the lettuce capital of the world. And what these companies do is they do all of their operations and harvesting in California between April and November. And then they move their operations to Arizona in the winter. And\r\n\r\n\r\nNikolas Hulewsky (02:18.318)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (02:42.723)\r\nHmm.\r\n\r\n\r\nKevin Moyer (02:44.536)\r\nSo yeah, there's a seasonal component to it. So in May, I think we'll do around $105,000 in top line. And then in the slower part of the year, that goes down to maybe $70,000. then what it amounts to at the end of the year is about a million top line.\r\n\r\n\r\nNikolas Hulewsky (02:56.928)\r\nOkay. Yeah.\r\n\r\n\r\nI mean, I just don't think people realize how big California is and how, I guess, varied the industries are within it. think at one point, it might still be this, but it was the fifth largest economy in the world. It's the largest produce producer, definitely in the United States. I was telling my son, I'm like, because I grew up in Sacramento, we used to have rice patties. Because the Delta floods in the valley, it floods every single year, and they use those floods, obviously, to grow a bunch of crops.\r\n\r\n\r\nKevin Moyer (03:08.42)\r\nMm-hmm.\r\n\r\n\r\nKevin Moyer (03:22.65)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (03:29.866)\r\nIt's nuts. It's just nuts how much is actually produced in California, but that makes sense. Yeah. Are you from California?\r\n\r\n\r\nKevin Moyer (03:31.138)\r\nYeah. Ton of agriculture. Ton of agriculture. Yep. I'm not, I'm originally from Florida, actually. I've moved around a bunch, followed my now wife out here, and I've been out in California since 2017.\r\n\r\n\r\nNikolas Hulewsky (03:40.417)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (03:45.036)\r\nSo what were you doing before I smashed my trash?\r\n\r\n\r\nKevin Moyer (03:47.916)\r\nI was working at tech startups. Yeah, I was doing that whole thing. Yeah, the Bay Area tech thing. I worked at Salesforce and then I went to go work at two smaller startups and really learned how companies grow, but didn't love it at a certain point. I kind of had the version of the entrepreneurial bug where I wanted to have direct control over outcomes and kind of like...\r\n\r\n\r\nNikolas Hulewsky (03:50.644)\r\nOK, so you were like in the valley, Silicon Valley scene.\r\n\r\n\r\nKevin Moyer (04:16.217)\r\nbe able to pull on all the different levers. And what I found working at startups is like, as part of the early team, you get to do that. And then as you raise new rounds of funding, like they just bring in executives and your role just naturally kind of narrows. And the bet is like, if I have a 20 year career, I hopefully pick a winner and I'll eventually like, you know, rise to a position where I can actually like make decisions and do fun stuff. I realized if I just went and worked at a smaller thing that I owned completely, I'd be able to like have that type of fun that I wanted to have and like directly reap the benefits.\r\n\r\n\r\nNikolas Hulewsky (04:46.36)\r\nWhat were you doing? Were you in sales? Were you an engineer? Were you in product? Like, what was your role?\r\n\r\n\r\nKevin Moyer (04:50.712)\r\nI kind of bounced around. So I was a sales engineer, which is basically like, your job is to partner up with the sales rep and explain how the product works. Yeah, it's kind of like a translator. was like, my goal was to like make, I would like do product demos. And then I was in marketing, I was in product, I was in product marketing, I worked on pricing, I worked on like the product led growth, like freemium, premium, freemium and like free trial type of stuff. So I did get to dabble a bit.\r\n\r\n\r\nNikolas Hulewsky (04:57.878)\r\nYou're like a translator.\r\n\r\n\r\nNikolas Hulewsky (05:04.558)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (05:14.542)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (05:19.148)\r\nHow much were you making before you To start, trash my...\r\n\r\n\r\nKevin Moyer (05:24.43)\r\nI made different amounts at different points. the most I was making was like 250K. And then I went down to go work at like a more of an earlier stage equity thing. And I think there I was making like 170K.\r\n\r\n\r\nNikolas Hulewsky (05:29.228)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (05:35.19)\r\nYeah, more equity, less. So walk me through. None of that sounds like managing trash. So walk me through how you went from, I'm in tech. I understand tech product pricing, even the technical side of things to, I want to buy a franchise that picks up trash.\r\n\r\n\r\nKevin Moyer (05:46.254)\r\nMm-hmm.\r\n\r\n\r\nKevin Moyer (05:58.788)\r\nYeah. I really wanted to directly benefit from the stuff I was doing. And I felt like it's not a reflection of tech or the companies that I was working in in particular. I feel like if you're working at a company, the cycle is you do really hard work, you hope your boss notices, you try to make a case. And if everything goes well in a year, you get a 10 % raise and like maybe an equity grant that then vests over four years. it's like the connection between input and output and like reward back.\r\n\r\n\r\nIt just wasn't a tight enough loop. I like, I'm like a business nerd. Like I feel like you are. And I, I felt like no matter what I was doing, like there was some ceiling on what I was able to, I mean, from the monetary side, like earn for myself, but also like, I wanted to like have a tighter feedback cycle of like, I have an idea, I want to implement it today and I want to see the results tomorrow. And I felt like working for myself would be a more fun way to do that. Even if I was making the same or less.\r\n\r\n\r\nNikolas Hulewsky (06:30.734)\r\nMm.\r\n\r\n\r\nKevin Moyer (06:57.9)\r\nand I could just kind of work whenever I wanted.\r\n\r\n\r\nNikolas Hulewsky (06:59.682)\r\nWhy not do the tech thing? Start a tech company, have a tech product, something that you have control over. You swung the total other way to the other end of the spectrum. How did you get there?\r\n\r\n\r\nKevin Moyer (07:09.914)\r\nMm-hmm.\r\n\r\n\r\nKevin Moyer (07:14.778)\r\nPart of it, there's a couple, I mean, there's a bunch of reasons. One big one was I saw these people who ran these companies, the people that started these companies that I was working for, and they are savants. And I was like, okay, I could compete with these guys who are crazy and live in 10 person houses and have 200 IQs and are just a different level. And I became interested in plays that allowed me to just\r\n\r\n\r\nNikolas Hulewsky (07:27.203)\r\nHahaha\r\n\r\n\r\nKevin Moyer (07:44.772)\r\ntranslate as best as I could just like raw brute force effort and work into cashflow. And I think that in the tech world, there's a high upside like power law dynamic where like the top 2 % of people are the winners. And I just don't feel like I'm a top 2 % person. And I do think I'm a hard worker and I'm willing to just like pound the pavement. And I was really attracted to that line between like the directness of working hard to just like\r\n\r\n\r\nNikolas Hulewsky (08:02.68)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (08:07.267)\r\nWow.\r\n\r\n\r\nKevin Moyer (08:13.304)\r\nreaping a reward and smash my trash, I'll tell you, and we'll talk more about it is a perfect example of that. It's a no-brainer value proposition. You just got to go make it happen.\r\n\r\n\r\nNikolas Hulewsky (08:19.245)\r\nI think.\r\n\r\n\r\nthink you have a quality that either you're born with or you get beaten into you. To be able to recognize what you just said, I like, I'm not a top 2%. It's difficult. It's not innate. Is that something that you feel like, hey, I'm lucky it was a God-given attribute? Or was that something that was kind of beaten into you over time as you're like, I tried. I tried to be a top 2%, but man, I lost.\r\n\r\n\r\nKevin Moyer (08:49.666)\r\nYeah, well, mean, like the awareness that I'm not a top 2 % person was like front and center every day working at these startups and like, listen, like hearing these engineers talk and like watching them operate. Cause like the people who started these companies are engineers first and they've learned how to run a business. It's like, all right, that's crazy. But then like the willingness to go do it, I think was partially, I realized like in the venture world, like the investors win because they spread their investments out.\r\n\r\n\r\nNikolas Hulewsky (08:56.749)\r\nMm.\r\n\r\n\r\nKevin Moyer (09:17.314)\r\nAnd it makes sense. they can, VCs get a great return over a period of time. Founders get like a great risk adjusted return because like it's a high upside. And even if you fail, like you've raised money, you make connections, you get like the status of it. But as an employee at these venture backed companies, like with a four year vest, you have a finite career to pick a winner. So it's like, if you're doing four year vests in 24 years, you have six companies. And if one of them isn't the winner, or if your last one's a winner, like that's when you make your big return.\r\n\r\n\r\nNikolas Hulewsky (09:28.962)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (09:47.021)\r\nMmm.\r\n\r\n\r\nKevin Moyer (09:47.042)\r\nAnd I just like, felt like I couldn't put my all into working at these companies if I was unsure that I was going to be able to like ever reap the benefit of it.\r\n\r\n\r\nNikolas Hulewsky (09:56.066)\r\nWhat an interesting and just self-aware assessment, man. That's, that is fascinating. I would say just talking to you for 10 minutes, you're a top 2 % mind from, you know, around the world. But when you get into a place where there's a concentration of like top 0.5 % minds, then yeah, of course you're like, man, I'm not even, I'm not in the top tier here. Just it's like playing in the NBA. You got there because you were the smartest, you know, you were the best kid in high school. You were an all American in college.\r\n\r\n\r\nKevin Moyer (10:08.577)\r\nI appreciate that.\r\n\r\n\r\nNikolas Hulewsky (10:24.93)\r\nAnd then you get to the NBA and you're like, I'm just a bench player, but you're still one of the best players in the world. just happens to be here. Trying to you're competing with LeBron James for a starting spot. What did your, what did your friends and coworkers think when you were like, yeah, I'm going to go buy a business.\r\n\r\n\r\nKevin Moyer (10:28.003)\r\nYeah.\r\n\r\n\r\nKevin Moyer (10:36.281)\r\nYeah\r\n\r\n\r\nKevin Moyer (10:42.212)\r\nSo my friends are all kind of on this, like my personal friends from college are all in kind of the same thing. Like we're all, like one of my friends just bought a manufacturing business in Ohio. Another one of them is also in Smash My Trash, he got into it before me and kind of like got the idea into my head. So like they get it, we're all kind of doing similar stuff. The people I worked with were like, what are you doing? Like they didn't understand it at all.\r\n\r\n\r\nNikolas Hulewsky (10:47.277)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (11:00.738)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (11:07.598)\r\nThey're like, oh, you are stupid. We all thought you were stupid. We talked about you behind your back, but wow. Trash? Okay, get them out of here. All right, so you looked around, you found Smash My Trash. It's great franchise. You've been in it for about four years. How did you think about the transition? Had you made good money and you'd saved up a bunch or was it a hard transition for you to kind of make the jump and think about how much income do I need right away?\r\n\r\n\r\nKevin Moyer (11:09.314)\r\nYeah, I'd like, yeah, man, we've seen the signs, but like confirmed. Yeah.\r\n\r\n\r\nYep. Yep.\r\n\r\n\r\nKevin Moyer (11:35.396)\r\nYeah, so I was very fortunate that I did have some cash stocked away from these jobs that I had a buffer that allowed me to start a business in growth mode without having to make money along the way to pay the bills, which is very fortunate.\r\n\r\n\r\nNikolas Hulewsky (11:49.132)\r\nHmm. What did your wife? What did your wife say when you were like, Hey, I'm to leave these jobs where I could make a couple million dollars in equity and I'm making a couple hundred thousand dollars a year to smash and trash.\r\n\r\n\r\nKevin Moyer (12:01.338)\r\nShe was down for it, and she's still down for it. Yeah, I mean, I'm very fortunate that she does trust me with this stuff. I think what neither of us expected is that I was going to be gone all the time, physically down in the territory, making it happen. That's the thing about Smash My Trash is the reason I chose it, like I said, was it was a direct line between what I was putting into it and the money that I would get out on the other side. But what that meant was I'm driving around there like...\r\n\r\n\r\nNikolas Hulewsky (12:03.128)\r\nGood for her.\r\n\r\n\r\nNikolas Hulewsky (12:13.644)\r\nMm.\r\n\r\n\r\nKevin Moyer (12:29.582)\r\nphysically doing stuff, meeting people in person, and there's a lot of time away from home.\r\n\r\n\r\nNikolas Hulewsky (12:35.254)\r\nWhy did you decide to do a franchise and not buy a business?\r\n\r\n\r\nKevin Moyer (12:40.698)\r\nSo this is similar to my spiel with the tech thing is these people who are out buying businesses, it's a popular idea and people simplify it when you see them online talk about it. There's these business buying influencers who are like, what's the big deal? Just like, get a loan, buy a business. Digging into it, I didn't think, and I think it was right at the time to think that I didn't have the chops for that. think like,\r\n\r\n\r\nNikolas Hulewsky (13:04.717)\r\nMm.\r\n\r\n\r\nKevin Moyer (13:05.198)\r\nThese guys who are in private equity and banking, like diligence is second nature to them and like they know the questions to ask, they can build a financial model in their sleep. I think there's a certain type of person that is kind of has that skillset and I was right to think I didn't have it. Now, I think it's possible that I could have started a non-franchise business, but the franchise seemed like more like a sure thing. Like I think.\r\n\r\n\r\nI thought it was more of a sure thing than I realize now. It was more risky than I realized, but at the time it felt like it was the right balance of, I can start a business and de-risk it a little bit because there's this perfectly built playbook, which is not always totally the case.\r\n\r\n\r\nNikolas Hulewsky (13:44.738)\r\nWhy? Why was it, okay, why was it riskier than you thought?\r\n\r\n\r\nKevin Moyer (13:48.29)\r\nSo we can get into the idea of a franchise agreement. there's a lot to say here, but franchise agreements are really serious things that you're signing. There are, a lot of cases, 10-year agreements. And they have clauses in there that, if you're not careful and you don't know what you're looking for, can get you in hot water, depending on the franchise or in depending on the situation. There's a couple of ones. So there's the term of the franchise agreement, which is\r\n\r\n\r\na lot of times 10 years. So you're locked in for 10 years and you personally guarantee the royalties to the franchisor. So that's one. A different kind of PG. Yeah, so it's not like a, it's not a recourse loan, which I have that too, but yeah, you're personally guaranteeing a royalty stream to the franchisor, which by the way is why franchisors are amazing businesses. But there's also...\r\n\r\n\r\nNikolas Hulewsky (14:23.756)\r\nWow. So you do sign a PG.\r\n\r\n\r\nNikolas Hulewsky (14:28.792)\r\nSure.\r\n\r\n\r\nKevin Moyer (14:43.93)\r\ndifferent contract provisions that franchisors put into these agreements that really tip the odds in their favor. And they should. It's perfectly logical. Like I think sometimes franchisors get a reputation of being kind of sharky. But one example to get specific here is minimum royalties. So what they say is, expect you to do X amount of revenue per month, and we're going to charge you either 8 % of your actual revenue or some set amount, whichever is higher.\r\n\r\n\r\nNikolas Hulewsky (15:13.724)\r\ninteresting.\r\n\r\n\r\nKevin Moyer (15:13.828)\r\nSo if you do less than the revenue that they quote unquote expect, you pay a much higher percent of royalties than say like the 8 % that you think you're paying. Does that make sense? Yeah.\r\n\r\n\r\nNikolas Hulewsky (15:22.094)\r\nSure. Yeah, it totally makes sense. mean, cause in to steal man, their side of things, they're like, Hey, we're giving you the playbook. We're giving you the infrastructure. We're training you. we need some type of a minimum return in order to justify this cost. That's man. That, okay.\r\n\r\n\r\nKevin Moyer (15:37.304)\r\nYeah. It protects them against bad franchisees. It protects them in a case where there were some, maybe a rich guy, maybe a lazy guy or gal gets in there and doesn't try and like another franchisee would have like juiced the revenue and they collect the royalty. They make it so that every franchise they sell generates a minimum amount of cashflow. And if you're ready to work, it's fine. But if you either have a bad territory or you're not going to put in the work, you can be paying effectively like\r\n\r\n\r\nNikolas Hulewsky (15:42.403)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (15:59.075)\r\nSo.\r\n\r\n\r\nKevin Moyer (16:06.266)\r\n30 % royalties or more.\r\n\r\n\r\nNikolas Hulewsky (16:08.974)\r\nSo it wasn't that it was necessarily risky. Well, I guess it wasn't that it was on its face riskier. It was you didn't necessarily appreciate or fully appreciate the downside risks associated with a franchise. Whereas now looking back, you're like, man, yeah, I signed this thing. yeah, that could have gone away. So we'll do.\r\n\r\n\r\nKevin Moyer (16:21.742)\r\nMm-hmm. Yeah.\r\n\r\n\r\nKevin Moyer (16:27.64)\r\nYeah, it could have gone south. And luckily it didn't. The way I think about it is like reversibility. Like I thought like, all right, we'll try it. If it doesn't work, what's the downside? And I think it was a more irreversible decision than I realized and appreciated at the time.\r\n\r\n\r\nNikolas Hulewsky (16:35.982)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (16:42.102)\r\nThat's a good point. So I wasn't ever in private equity, but I had sort of the private equity experience that you described. worked for healthcare company and I had a lot of experience buying and selling. I shouldn't even say selling, buying operations. And so I went through the diligence process. I understood what was valuable, what wasn't valuable and how to discount things, yada, yada. And then I also operated those businesses. So when I decided to get into entrepreneurship, what did I do? I went and bought a business in the space that I knew. wasn't like,\r\n\r\n\r\nWell, I know healthcare really well. I'm going to go buy a tech SaaS company because I just had like, to me that seemed stupid. However, after buying the business and signing the personal guarantee and getting an SBA loan, looking back, like, man, I did not, I could have gone really south. Like I didn't, I didn't appreciate the personal guarantee in particular, right? You're like, you think you appreciate it. And then after you get in, you're like, man, one bad move or one bad call.\r\n\r\n\r\nKevin Moyer (17:27.758)\r\nMm-hmm.\r\n\r\n\r\nKevin Moyer (17:32.27)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (17:38.19)\r\nCould have been a disaster. I sympathize with you on that for sure. Let me ask you this question. When you were modeling it out, so when you were like, I'm gonna do smash my trash. And if I get in there and I call it spreadsheet porn, cause you start like putting the numbers in, you're like, oh man, yeah, if it's just a 5 % growth rate per month and like, well, I shouldn't be able to get like 20 % margins at this point. $20,000 my first year. What was your projection for the first year? And what did you actually do?\r\n\r\n\r\nKevin Moyer (17:42.306)\r\nYeah, yeah.\r\n\r\n\r\nKevin Moyer (17:52.09)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (18:07.148)\r\nwhen you got into the franchise.\r\n\r\n\r\nKevin Moyer (18:08.686)\r\nYeah, it's a good point. I think this is a thing with everybody in the entrepreneurial world of like models make things look like these like just bulletproof things that just like pick off cash and it's just automatic. And I honestly think it comes from the real estate world where like you can model a self-storage facility like that. You can model certain types of investments like that. A small business is not like that because there's a million things that don't show up in the model. Like one of your drivers being a wild card.\r\n\r\n\r\nNikolas Hulewsky (18:19.682)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (18:28.364)\r\nsure.\r\n\r\n\r\nKevin Moyer (18:37.346)\r\nor your sales rep being like an insane person or a customer that goes out of business and all that. I actually, to answer your question, I can't remember what my projections were. I know I was racing to a million dollar revenue run rate and I didn't actually even have a goal of when I wanted to hit that. It ended up taking me about a year and a half. I was able to get comfortable with Smash My Trash because it is, as far as modeling and projections go, it's fairly straightforward.\r\n\r\n\r\nNikolas Hulewsky (18:37.73)\r\nYeah.\r\n\r\n\r\nKevin Moyer (19:06.148)\r\nWhen I bought the territories, I literally paid somebody on Upwork to drop a pin on every single dumpster on Google Maps. And you can basically size your market and put in some basic assumptions and say, the whole rates that these people pay are x. If I can close y % of them, then my revenue is going to be z. And that's what I did.\r\n\r\n\r\nNikolas Hulewsky (19:15.032)\r\nBrad?\r\n\r\n\r\nKevin Moyer (19:29.492)\r\nAnd then it was basically a matter of to go back to the brute force, just make it happen thing. I was like, just drive to each one of those dumpsters on my map every day and like find the person I need to talk to and make the pitch. So was confident that there'd be revenue there, but I did not have any sort of sophisticated projections or modeling that I was going after.\r\n\r\n\r\nNikolas Hulewsky (19:40.898)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (19:46.488)\r\nHow much did it cost you to buy in?\r\n\r\n\r\nKevin Moyer (19:49.018)\r\nAbout 500k total between the truck, the territory fees, and the initial working capital.\r\n\r\n\r\nNikolas Hulewsky (19:50.999)\r\nOkay.\r\n\r\n\r\nWhat about, let's just say just the territory fees.\r\n\r\n\r\nKevin Moyer (19:56.772)\r\nJust the territories were 125.\r\n\r\n\r\nNikolas Hulewsky (19:59.086)\r\n125. Okay, so then you invested a lot of money in working capital trucks, etc.\r\n\r\n\r\nKevin Moyer (20:03.418)\r\nYeah, yep, so 250k truck, 125k franchise fees for the initial three, and then the rest was working capital that I just put into the business's cash. And then about a year later, I bought two more territories and that was an additional 60k.\r\n\r\n\r\nNikolas Hulewsky (20:19.704)\r\nSo I'm curious, why did you buy the two territories a year later? Because from your story, it was, I'm driving 90 minutes each day, I'm about to have my first kid, I can't continue to do this. But then you buy two more territories. What was the thought process at that point?\r\n\r\n\r\nKevin Moyer (20:35.736)\r\nYeah, part of it was I had to and part of it was there was an opportunity and I was being opportunistic. So it goes back to the minimum royalty thing. So I bought these three territories and the three territories I bought were probably six out of 10 quality. And I think something we can maybe talk about is one of the, there's a couple of things with franchises that I think are traps to watch out for. One is like minimum royalties. Another one is making sure that the territories you buy are viable. The first three I bought were pretty good.\r\n\r\n\r\nNikolas Hulewsky (20:41.218)\r\nWhat do mean you had to?\r\n\r\n\r\nNikolas Hulewsky (21:03.426)\r\nHmm.\r\n\r\n\r\nKevin Moyer (21:04.91)\r\nBut I had this minimum royalty agreement signed where I knew if I was going to need that, I needed to have more surface area of revenue that I could go get. I needed scale. So I had to go buy them. But I also was lucky that there was two territories contiguous to mine that ended up just being absolute gold mines of potential revenue. So there was an opportunistic side. No, they were greenfield. They were new. So I was able to just buy them from the franchisor.\r\n\r\n\r\nNikolas Hulewsky (21:12.526)\r\nYou needed scale.\r\n\r\n\r\nNikolas Hulewsky (21:26.415)\r\nWere they owned by somebody? Were they owned by somebody at the time?\r\n\r\n\r\nNikolas Hulewsky (21:34.094)\r\nso did they come to you and say like, hey, these are open. Do you want them or did you go to them? And we're like, I think I can get more business in this area.\r\n\r\n\r\nKevin Moyer (21:43.064)\r\nI went to them. Yeah, so one day I just drove out of my territory and was like, what else is out there? Like, where can I go get more customers? Where can I just add revenue? And that's where I started to go out into the sticks, into agriculture land, and realized that there was a really severe need out there for the service. And that's when I...\r\n\r\n\r\nNikolas Hulewsky (21:52.216)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (21:58.632)\r\nOkay, so you went from six out of 10 locations to what?\r\n\r\n\r\nKevin Moyer (22:03.288)\r\nAnd then I added 10 out of 10, and now I think we're at about an 8 out of 10 in aggregate. Yeah.\r\n\r\n\r\nNikolas Hulewsky (22:08.47)\r\nNice. Okay, what were the red flags that you said? The first red flag was minimum royalties. The second red flag you said was viability of a territory. What are some other red flags that you have?\r\n\r\n\r\nKevin Moyer (22:22.766)\r\nThose are the two big ones, and I think those are true for every franchise. I think the other red flag that I look for is what is the actual key to success with a franchise? In Smash My Trash, it's ability and willingness to go do direct door-to-door sales yourself or the ability to find a sales rep who can do it.\r\n\r\n\r\nNikolas Hulewsky (22:24.312)\r\nOkay.\r\n\r\n\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (22:44.28)\r\nHow would you have assessed that before you bought it? Like how would you have known that that was the differentiator?\r\n\r\n\r\nKevin Moyer (22:49.22)\r\ndidn't really know. I had a loose sense that I could just kind of will this into existence because it was a direct sales play and I got comfortable with that. But I think there's other franchises where it's harder to figure out what that key is. And I think that that's the job of anyone looking at a franchise is to call as many owners as you can and try to find a pattern on why are good people winning and why are the bad franchisees not winning. Talk to a lot of people and try to pick out the patterns.\r\n\r\n\r\nNikolas Hulewsky (23:14.146)\r\nTalk to a lot of people.\r\n\r\n\r\nKevin Moyer (23:18.136)\r\nLike I think in brick and mortar franchises, it has a lot to do with like site selection and real estate. And there's people who do really well in those franchises that just know I need to be on this side of the road because I'm a lunch business and I need to get the people who are driving on this side of the road to go to lunch. And if I put it on the other side of the road, I'm going to have half the revenue. And there's other franchises where it's something totally different. But geography ends up playing a big role in a lot of franchises that I think is kind of\r\n\r\n\r\nNikolas Hulewsky (23:24.536)\r\nHmm.\r\n\r\n\r\nKevin Moyer (23:47.214)\r\ndownplayed naturally in the franchise sales process. They get positioned as like a territory is just like a unit. It's just a thing you buy. It's apples to apples and it's not always the case.\r\n\r\n\r\nNikolas Hulewsky (23:57.08)\r\nWell, that's interesting because I would think, I would think there are some instances where it's just really easy to tell. Like if it's an existing franchise that's being sold, you can look at the history and the financials and it's like, if they're making money, it's a good territory, right? But there are probably good territories that just have bad operators. So you still need to sniff out. But the, the greenfield one that I think would be potentially the most scary if you're coming into franchising new.\r\n\r\n\r\nKevin Moyer (24:07.445)\r\nyeah.\r\n\r\n\r\nKevin Moyer (24:14.254)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (24:23.072)\r\nIf you're like, have no experience with franchising period and I'm going Greenfield, you're kind of layering on to unknowns, right?\r\n\r\n\r\nKevin Moyer (24:23.353)\r\nYeah, for sure.\r\n\r\n\r\nKevin Moyer (24:29.838)\r\nFor sure. Yeah, I was talking about Greenfield. If you're buying an existing unit, it's a totally different game. It's just like buying any other business. If their revenue is what it is and they're making a certain amount, then you would diligence that. think like you would diligence any business.\r\n\r\n\r\nNikolas Hulewsky (24:37.207)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (24:43.342)\r\nIf you were to go back in time, would you still buy a franchise that you had never run before in a greenfield market? Or would you buy a franchise that you'd never run before that had history?\r\n\r\n\r\nKevin Moyer (24:46.426)\r\nyou\r\n\r\n\r\nKevin Moyer (24:56.888)\r\nIt's hard to regret what I did because it worked out, but I think there's a really strong case to be made for someone out there who's looking to get into owning their own business to buy a franchise resale. think franchise resales are really great business acquisition opportunities for a number of reasons, one of which is the network of other owners. So if you buy an independent mom and pop business and that owner that you buy it from retires and sales off into the sunset,\r\n\r\n\r\nNikolas Hulewsky (24:59.47)\r\nSure.\r\n\r\n\r\nKevin Moyer (25:26.02)\r\nThere's no one for you to go to with questions. If you're a first time business owner, you can call the franchisees around you. You can call the franchisor and you can get support. The other thing I like about franchise resales is there's a built in roll up opportunity where there's a bunch of people in the country who are running the same brand on the same systems, doing the same thing. They have the same CRM. They have the same invoicing system. So the integration is really easy.\r\n\r\n\r\nNikolas Hulewsky (25:35.022)\r\nThat's a point.\r\n\r\n\r\nNikolas Hulewsky (25:53.454)\r\nMm.\r\n\r\n\r\nKevin Moyer (25:53.482)\r\nIn theory, it's probably not as easy as I'm making it sound, but like, you know what I mean in theory. The issue is...\r\n\r\n\r\nNikolas Hulewsky (25:59.254)\r\nIs that a thing? Do people go and roll up franchises?\r\n\r\n\r\nKevin Moyer (26:02.296)\r\nyeah, yeah, yeah. I think it's one of my favorite plays I see people do. My buddy who I mentioned from college who's in Smash My Trash is very much going that route. I'm going like the cash flow passive route and starting something else. He is doing acquisitions within Smash My Trash and it's going well for them.\r\n\r\n\r\nNikolas Hulewsky (26:22.283)\r\nDid he raise outside money or is he funding it all himself?\r\n\r\n\r\nKevin Moyer (26:25.364)\r\na combination. I'm not sure exactly how they did it, so don't want to, I don't want to say something wrong, but yeah, they have some outside money in there too.\r\n\r\n\r\nNikolas Hulewsky (26:29.09)\r\nThat's fine. Yeah.\r\n\r\n\r\nNikolas Hulewsky (26:33.474)\r\nHow does that work? Like you've got five locations. Let's say he's rolling up, but the franchise still does a majority of the shared services. Do you in the roll up need to eventually have even like your own shared team of resources, if that makes sense, like your own operating hub, or is it still just plug and play? The franchise does everything and you let the individual locations run.\r\n\r\n\r\nKevin Moyer (26:49.53)\r\nMm-hmm. Yep.\r\n\r\n\r\nKevin Moyer (26:56.014)\r\nI actually think that's the beauty of the roll-up is you can put in these positions that you can't afford if you are someone like me with five territories. I'll give you an example. One of the things about franchising is you're artificially constrained. So like, there's no reason why I can't, you know, if I had an independent smash business, I could go kind of service whatever, but because I'm constrained to a territory and the guy who owns the territory next to me is constrained to his, we would all benefit.\r\n\r\n\r\nfrom an in-house mechanic. Because right now we're using 1099 mechanics, and we're paying for them, and they're not always available. If I were to roll up everybody in my area, you could bring in-house mechanics and other kind of overhead that helps you just support the whole operation. And I think that's one of the benefits of rolling it up, is you have enough cash flow to hire these positions that help you manage a larger operation.\r\n\r\n\r\nNikolas Hulewsky (27:48.982)\r\nSo you expanded, you ended up giving more revenue, which is good, it kind of stabilized the business. And you talked about now you're optimizing for cashflow passive. Is it passive for you right now?\r\n\r\n\r\nKevin Moyer (28:00.356)\r\nMm-hmm.\r\n\r\n\r\nKevin Moyer (28:03.822)\r\nIt's pretty passive. I mean, I spend, would say no more than an hour a day on it. There's occasionally. Yeah. So here's the, it's a beautifully simple business. The value creation happens when you acquire customers. And I've gotten good at acquiring customers. Once you acquire a customer, your drivers just go there every day and do the same thing. They don't need to be specialized. You know, they don't need to even have a commercial license.\r\n\r\n\r\nNikolas Hulewsky (28:08.248)\r\nWhat?\r\n\r\n\r\nWhat? How?\r\n\r\n\r\nKevin Moyer (28:32.504)\r\nYou can hire somebody who's a solid guy, who has experience driving trucks, and they do a route, and you sign a customer up, and they just go perform a service once a week, once a day, three times a week. And I have a really good lead driver, operations manager, who kind of handles the daily problems that come up in the field. We skipped a stop, they told us to come back. He handles all that. But it is a very simple business to operate once it's running.\r\n\r\n\r\nNikolas Hulewsky (28:57.678)\r\nCool, because I hear $100,000 a month, a million dollar business. think small business, right? Like if it's a small business, I got to be in it, running it every day. But effectively, what you're saying is the majority of the work is getting customers, finding drivers. Once that's taken care of, it's kind of on cruise control.\r\n\r\n\r\nKevin Moyer (29:14.734)\r\nYep. Occasionally there'll be a blow up. Occasionally a truck will go down, we'll have a major mechanical issue and I'll need to swoop in and it'll take up a whole day. That maybe happens once or twice a year. Other than that, I've tried to set up our processes and systems and some automations and a VA and like all the typical stuff that people try to do to try to make it as passive as possible. And when you're driving 90 minutes a day, it's a very strong motivator to try to get it set up so that it doesn't need you.\r\n\r\n\r\nNikolas Hulewsky (29:33.464)\r\nSure.\r\n\r\n\r\nNikolas Hulewsky (29:42.36)\r\nWhat's like a typical net income on if you're doing $100,000 a month, what are you cash flowing?\r\n\r\n\r\nKevin Moyer (29:48.986)\r\nYes, I always mess up like the exact terms of like SDE and EBITDA, but like on a P &L before depreciation and taxes and everything, it's about 40 % margin. So it's about 400K. And then I pay 160K a year, 150K a year to debt service. And so I ended up pocketing like 250.\r\n\r\n\r\nNikolas Hulewsky (30:08.928)\r\nWhat? Dude, that's amazing.\r\n\r\n\r\nKevin Moyer (30:10.21)\r\nYeah. I mean, that's a new thing. So for the first two years, was nothing. was first two years, it was nothing, nothing, nothing. And then starting last summer, it started to be a pretty steady. What looks like, if nothing changes, if everything continues to go well, which fingers crossed it will, it's yeah, about 250k.\r\n\r\n\r\nNikolas Hulewsky (30:14.606)\r\nOh, I know. Yeah, yeah, yeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (30:30.19)\r\nThat's fantastic, man. Congratulations. And I know it wasn't in the beginning, right? It's compounding. That's how, honestly, in my opinion, that's how every business is. It's like you're an overnight success, 10 years in the making. It's like one day you wake up, yep, everything.\r\n\r\n\r\nKevin Moyer (30:32.25)\r\nThank you. Yeah, it's been good.\r\n\r\n\r\nKevin Moyer (30:44.28)\r\nYeah, it's nothing, nothing, nothing, nothing. And then it kind of bursts to pay off and that, you know, that feels good.\r\n\r\n\r\nNikolas Hulewsky (30:51.662)\r\nSo I'm curious about the asset value because that's one of the things within franchising. I don't quite understand I talked to a guy from Chick-fil-A he has no asset value like he does Once he's done with the chick-fil-a that he's running like he can't sell it the company just takes it back How are these smash my trashes or like how do you think about the value creation that that you've generated within these smash my trashes that you have?\r\n\r\n\r\nKevin Moyer (31:16.344)\r\nYeah, so I think the business is an asset that I could sell. People buy these. People from the outside have bought Smash My Trash businesses. So I think that's an option for me.\r\n\r\n\r\nNikolas Hulewsky (31:28.002)\r\nYeah, but like, so I agree. I agree. I'm curious, like, how do you value it? So if you're doing a million dollars a year, 250 in, call it SDE, add back in those debt servicing, you're at $400,000. How would I, a buyer come and value your smash my trash?\r\n\r\n\r\nKevin Moyer (31:48.858)\r\nI mean, I'm biased. think it's a fairly valuable business because it has a lot of the traits that get you high multiples. At least I hope this is the case. It's recurring.\r\n\r\n\r\nNikolas Hulewsky (31:56.396)\r\nMm-hmm. Do you know what they trade at? Is it like two, three times SDE, one times revenue? You think it's more?\r\n\r\n\r\nKevin Moyer (32:02.848)\r\nI think it's more. I think it's more. Of course I'm going to say that. It may be wishful thinking, but I would say four to five wouldn't be unreasonable. That's what I would want.\r\n\r\n\r\nNikolas Hulewsky (32:12.895)\r\nWhat have you seen though? Do you know what franchisees have sold for?\r\n\r\n\r\nKevin Moyer (32:15.702)\r\nYeah, it's in that range, four to five or more, depending on the size, because it's a lot of things that people who buy businesses are looking for. Yeah, four to five EBITDA. It's recurring, it's steady, it's low maintenance, it's passive.\r\n\r\n\r\nNikolas Hulewsky (32:20.622)\r\n4-5 SDE.\r\n\r\n\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (32:31.106)\r\nWow, okay, so you've built up a 1.6 to $2 million asset with Smash My Trash over the past two years.\r\n\r\n\r\nKevin Moyer (32:38.37)\r\nYeah, I think so. Yeah, thanks.\r\n\r\n\r\nNikolas Hulewsky (32:40.002)\r\nThat's rad, man. That's geez Louise. Alright, here we got like the last two questions. My first question is. What are in your opinion the most common mistakes that franchisees or potential franchisees make when getting into the business?\r\n\r\n\r\nKevin Moyer (33:00.29)\r\nYes, we've already talked about one of them, which is picking a territory that isn't viable. That I think is, no, I think that's the biggest one. Some franchises are more apples to apples depending on where you are, just going to kind of work no matter what. But the way that franchises get sold, there's like many people in the sales process. There's the franchisor, a lot of times there's a franchise broker.\r\n\r\n\r\nNikolas Hulewsky (33:05.422)\r\nOkay. How would you... Go ahead, sorry.\r\n\r\n\r\nNikolas Hulewsky (33:21.934)\r\nMm-hmm.\r\n\r\n\r\nKevin Moyer (33:25.998)\r\nThere's a franchise development company in a lot of cases whose job is to create the territories and then sell them on behalf of the franchisor. So it just kind of like, you know, there's a little bit of.\r\n\r\n\r\nNikolas Hulewsky (33:35.758)\r\nThere's a lot of incentive to sell it without necessarily giving you the whole picture.\r\n\r\n\r\nKevin Moyer (33:41.23)\r\nthat yeah, that's a big part of it. And I don't think anyone's necessarily, no one in that chain is doing anything necessarily wrong. It's just the natural progression of just how the incentives are set up. And then I think the other half of it is a lot of times the people who buy franchises are first time business owners like me, and they don't know how to think about a 10 year franchise agreement. They don't know how to think about minimum royalties. They don't know how to think about territory and site selection.\r\n\r\n\r\nNikolas Hulewsky (33:49.56)\r\nSo.\r\n\r\n\r\nNikolas Hulewsky (33:59.587)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (34:04.984)\r\nWell, you've given me a totally new framework to go off of, is first time franchisee in a green field market. that's even more risk than I think people appreciate. I think that's a really interesting thing. How would you go about validating a territory?\r\n\r\n\r\nKevin Moyer (34:17.038)\r\nMm-hmm.\r\n\r\n\r\nKevin Moyer (34:25.434)\r\nCalling franchisees and trying to pick out the patterns. Yeah, that's the best way to do it. Call franchisees, ask him what their territory is like, ask him what's working, why it's working, and you'll figure out patterns. it's like with Smash My Trash, it's the people who know how to sell or hire sales reps enter in a place where the trash dynamics are, you know, there's a density of industry and there's hall rates that are high. And there's a certain number of other things that like, there is a recipe for where it's a winning model. And there's a recipe for where it's, you know, less of a winning model.\r\n\r\n\r\nNikolas Hulewsky (34:27.746)\r\nThat's what you do.\r\n\r\n\r\nNikolas Hulewsky (34:38.286)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (34:56.206)\r\nI'm curious and this is my last question. So you talked about you're in this phase of like pretty passive. I'm assuming though you don't want to just stay the size that you are with Smash My Trash. What's the plan with Smash My Trash? Because we talked earlier, it sounds like you have an idea for some other businesses, but are you just kind of let Smash My Trash ride or do you have a plan to grow and expand that? What are your thoughts moving forward?\r\n\r\n\r\nKevin Moyer (35:15.928)\r\nMm-hmm.\r\n\r\n\r\nKevin Moyer (35:22.808)\r\nIt's the question. I am totally stuck right now. I don't know. The good news is like, it's not a bad place to be stuck. Door number one is keep it going as is. And it's growing slowly. I'm starting a new business. So I wake up every day and have a little bit of tension that I could be doing more to grow it. There's a lot more potential. There are customers who are waiting on me to give them a proposal right now and I haven't had the time and that pains me. There's a...\r\n\r\n\r\nNikolas Hulewsky (35:29.912)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (35:41.102)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (35:48.534)\r\nand you're on here giving a podcast.\r\n\r\n\r\nKevin Moyer (35:51.704)\r\nI'm spending a lot of time right now on this new business, pretty much all my time on the new business I'm starting. So there's tension there that I could be doing more and I'm not. So that opens door number two. Like you said, I think somebody would be willing to pay a good amount for what I've built and I could sell it. Every time I look at the math of selling it, it kind of leads me back to like, I should just hold it as is. think this will just keep going, so why not own it myself? And then the third door would be, would bring in something like an operating partner to\r\n\r\n\r\nNikolas Hulewsky (36:00.215)\r\nYeah.\r\n\r\n\r\nKevin Moyer (36:22.008)\r\nto grow it for me and I could partner with someone like that.\r\n\r\n\r\nNikolas Hulewsky (36:24.812)\r\nYeah, that was going to be my question is like a lot of people who get into entrepreneurship. It's one of my favorite phrases to make fun of, but they're always like, I'll just hire an operator. And I laugh at that because I'm like, you have no idea what you're doing. If you, if, if you thought hiring an operator was easy, you have never like figured it out, but it's because they're outsourcing the operations before they've even gotten into the business way too early. Exactly. You're at the spot now where\r\n\r\n\r\nKevin Moyer (36:32.481)\r\nMm-hmm.\r\n\r\n\r\nKevin Moyer (36:37.294)\r\nYeah.\r\n\r\n\r\nKevin Moyer (36:46.01)\r\nToo early. Yeah. Yep.\r\n\r\n\r\nNikolas Hulewsky (36:50.208)\r\nit makes total sense, right? Where you're like, okay, I get what it needs to be successful. So now I can go and find someone who's going to be the right fit to make this business successful. And you're attracting somebody to a good situation. This isn't like a turnaround or a crappy thing that you're operating. This is a good situation. How are you thinking about potentially finding an operator? Are you just like networking like crazy? you like?\r\n\r\n\r\ndoing the same cold calling that you've been doing for Smash My Trash or are you pretty passive and you're like, if it happens, it happens. I'm in no hurry.\r\n\r\n\r\nKevin Moyer (37:21.4)\r\nI'm more the last one. I'm more of what you just said. It's like I'm just kind of sitting around saying, I need to do this, I need to do this. And I've had a couple of conversations, but I think I should be putting more time into it because I actually think it would be a big unlock if I found the right person who was willing to hustle and I could give them the playbook. There's definitely a good situation here. I just haven't put the time into it yet, honestly.\r\n\r\n\r\nNikolas Hulewsky (37:32.984)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (37:43.63)\r\nIt would seem like there'd be somebody in tech who was like you five years ago that you could be like, Hey, just come get your feet wet, learn how to run a business. And then we can partner on a territory or, know, we can, we can have some type of equity split down the road. Have you thought about going back to your old tech contacts or anybody that in that space who might be fit that bill?\r\n\r\n\r\nKevin Moyer (37:54.372)\r\nYep.\r\n\r\n\r\nKevin Moyer (38:04.056)\r\nI thought about it. Yeah, I think it's a hard, because they'd make less out of the gate. Not everyone's willing to do that. And I would sell them on the upside. I'd sell them on the growth potential and all those things. But unless somebody has had a liquidity event, it's a hard pitch to say, hey, you're going to come in and make this amount every year, and you're going to have this much equity, and you're going to bet on these outcomes. It's just, especially in California, where the cost of living is so high, it's not easy for everyone to pull that off.\r\n\r\n\r\nNikolas Hulewsky (38:08.526)\r\nSure.\r\n\r\n\r\nNikolas Hulewsky (38:20.748)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (38:32.81)\r\nI agree. Well, I'm rooting for you, man. I can't wait to see where you are in a year from now. And maybe in a year from now, we'll talk about your new business. But this was fantastic. Appreciate you, Kevin. All right, we'll talk soon. Stay on for a second.\r\n\r\n\r\nKevin Moyer (38:40.654)\r\nYeah.\r\n\r\n\r\nYeah, it was a great chat. All right.",
  "metadata": {
    "duration": "",
    "date": "2025-06-23",
    "platform_source": "Google Drive"
  }
}