{
  "episode_number": "23",
  "episode_title": "Business Brokerage Secrets: Identifying Deal Breakers and Red Flags with Jackie Hirsch",
  "guest_name": "Jackie Hirsch",
  "business_name": "Crown Atlantic Business Brokers",
  "transcript": "﻿Hey, what's up guys. Welcome back to another episode of Nikonomics. And on today's episode, we have Jackie Hirsch. She's the owner and founder of Crown Atlantic business brokers. Now, not only is Jackie an investor, a business advisor, and with over 400  transactions under her belt, she's one of the most prolific business brokers in the country.\r\n\r\n\r\nI first met Jackie Hirsch. At SM bash and honestly, her energy, her optimism, they're infectious. And I couldn't wait to sit down with her and have her on the show. She came on to talk to me about the biggest mistakes that people make both buying and selling businesses, as well as what it was like to found a business in the nineties and a male dominated good old boy industry.\r\n\r\n\r\nAs a young woman in Florida, if you're somebody who's trying to buy a business or an entrepreneur, and you're a parent trying to figure out how to juggle everything at the same time. You don't want to miss this episode. It's a great episode. Thank you, Jackie, for coming on. And if you liked this episode, you know what to do.\r\n\r\n\r\nLike subscribe, share this with a friend, but with that, let's just get into the show, Jackie. Hey, I'm stoked to have you. I've been looking forward to this day. Since SM bash, when you didn't even know that I was going to ask you to come on here. So thank you. Thank you for accepting. And my goal with this is that by the end of it, you say, this was fun and not.\r\n\r\n\r\nThank you for the invitation.  I very much,  very much appreciate that. Jackie shared with me just beforehand that thank you for the invitation is a nice way of saying. This was a waste of time. So  no, no, it's actually, I didn't enjoy myself. Oh, I didn't enjoy myself. Yes. Thank you,  Jackie. For those who don't know you,  who are you?\r\n\r\n\r\nUh, and what do you do?  My name is Jackie Hirsch. I'm the founder of Crown Atlantic business brokers. I've been selling companies for 25 years, which seems like a long time. Sometimes we sell companies. I also invest in companies and I got started when I was 22. I'm 48. I just turned 48. I will not reveal my height, but I'm really, really tiny in person.\r\n\r\n\r\nIn fact, I just posted a picture next to Eric Pesavici because we were at a happy hour together and I'm wearing heels and I like don't even come up to his shoulder. As Shakespeare would say, she is small, but she is mighty.  So don't worry about that. It wouldn't be a good thing if I were like six, five, I would be. \r\n\r\n\r\nIt's funny. I am a really large, friendly person. I go back and forth with my wife. So my wife, she's not short, she's five, seven,  you know, she probably was born 10 years too early. Maybe. I don't know. She's a stay at home mom at the moment, but I'm like, man. I'm so lucky. You're not the husband.  Cause I do just like, she already bosses me around.\r\n\r\n\r\nShe's German. She's like, Nick, the trains will run on time. Also trains will not run at all. And  I'm like, you were a man and born with all those privileges of being a man. I'm scared for what you might, uh, you know, what havoc you might wreck in the world. So  how did you get into  what you're doing? Because I read your background.\r\n\r\n\r\nAnd I'd love for you to go into your background, but it doesn't necessarily match up with becoming a business broker.  This is how long ago 1998 was when people don't realize how much time has passed. So I answered an ad in the paper. So I graduated college early. I was 21 when I graduated, had a job for a brief period and wasn't great at it.\r\n\r\n\r\nAnd so I saw an ad to be a business broker and I loved business. As a kid, I loved business as a little kid. I love business and I still love business and talking about business. And so I answered this ad and the broker was going to hire anybody with a pulse who probably wasn't a criminal. And I had a real estate license cause everybody in Florida has a real estate license.\r\n\r\n\r\nSo he hired me. Okay. And I think pretty much everybody made fun of me in the office and nobody would take me seriously. And it was super unpleasant in every sense of the word. The broker said, here's a bookcase over here and you can read all of that stuff and watch those.  And so I did, and I was the only person who had ever done that. \r\n\r\n\r\nSo then I started learning stuff and then I just started selling more companies than everybody else. Took a little bit of time, but he sold it to another business broker. And I worked there for a bit, which was a complete culture clash for me. It was like working with somebody who thought they were like the mafia.\r\n\r\n\r\nI don't know. It was, it was hard. And then I started my own and my first agent was my dad, but I started the company with my money. So I'm sure everybody thought that my dad started the business and I didn't really care. My dad was a rocket scientist who graduated from Berkeley. He was super smart.  He's super smart.\r\n\r\n\r\nAnd I'm like, dad, it's not rocket science. I can teach you business brokerage. And that was always a joke. So my dad was retired when he started and he started doing deals. And my brother joined us shortly after that. And because of where I came from, I never wanted a large brokerage. Like it was always going to be small and lean and hustle, and we'll just take all the deals.\r\n\r\n\r\nAnd that's what we did. You're an entrepreneur and you've invested in your own businesses, obviously.  Why did you stay as a business broker? Why not buy some of these businesses or what is it about being a business broker that you've enjoyed? It's an interesting question. So I felt like every time I got to the next earnings level, I would have had to buy a business.\r\n\r\n\r\nThree times larger, four times larger to get to that earnings level. So I kept jumping and what I do is I'm a matchmaker. So it's a bit of an art and there's  a bit of romance to that. In a way, I see people that I sold a company to 25 years ago. There's somebody I'm working with right now. I sold them a company 24  years ago, and we're now looking at their third acquisition.\r\n\r\n\r\nAnd  that's awesome. So there's some stuff like that about it, but in the meantime, I did try some other things and. I got married and nothing that's foreign to you, but a little bit of tragedy. I got married and I was pregnant seven times. I have one kid. It's hard to like having a business when you're doing that.\r\n\r\n\r\nAnd then I had multiple companies,  so you can only do so much with what your bandwidth is and I didn't have a partner and I didn't, it's not like, I mean, how many  unmarried, okay. So like female partners that are not married to each other. Do you know that you have a business like you and Chris? Cause I don't know any,  no, not, not right now.\r\n\r\n\r\nMy hope is in maybe 10 years. We see that more frequently, but  no, I'm, I'm very, you just don't see that. Yeah, it's true. It's true. And I'm very lucky that I have a spouse who's incredibly supportive and has allowed me to be successful because without her,  none of this would have been possible. And I can't imagine  being a mother. \r\n\r\n\r\nAnd the business owner, because  even if you own a business, you work 40 hours a week, you're always mom. You come home. Yeah. It doesn't matter. Mom, like my wife and I, come home at the same time from a date. Who did the kids run to? They run to mom. And I freaking love my kids. I fall asleep with my kids like every night.\r\n\r\n\r\nWe have a great relationship, but there's just something special about a mother and a child's relationship. So I just have immense respect for female entrepreneurs in particular, because you guys wear so many hats.  So in 2009, I showed a company, it was a 20, 000 square foot facility elsewhere in Florida, cause I'm in Florida.\r\n\r\n\r\nAnd we walked by a nursery and I was like, God, let me see that room again. Like, let's go buy that room again. And so we saw, and I had just met Michael. Maybe I had just gotten engaged and I wanted to marry Michael right away. And we got married within the year anyway. So like a year and a week from when we met.\r\n\r\n\r\nSo pretty quick. And so they had a nursery in the company. And I was like, I have an extra office at my office. And so when Melina was born in 2000 and 2011, she had an office in our office and she was with me for three years. So like you asked, why didn't you have another company in addition, it'd be hard.\r\n\r\n\r\nLike she came with me to work full time. Michael used to travel for work. And then I used to work full time. She'd come with me to meetings sometimes, but it was just hard. Like I breastfed her here at the office for a year, like, and work full time. And, at that point I had two companies, I had a home health company.\r\n\r\n\r\nAnd then I also had business brokerage.  So walk me through that.  I have boys, I love my kids  and it's a dream of mine to have them work in the businesses that I own.  You've done that with your daughter. She's, you'll see 2011. So 5th, 14, 15, 14, 13. Okay. I can do math.  She's Louise. How long did that freaking take me to get to a number that I was still wrong? \r\n\r\n\r\nAnyways, has that been fun? Has that been hard trying to get her to understand? What you do,  you know, we talk about money all the time at our house. We talk about investing. Like she knows we're on cap tables. She knows what we do.  She knows how to deal with prices. Like she will tell me stuff is too expensive or she'll tell me like, this is a good price or we should be investing in this.\r\n\r\n\r\nWe talked about it. Cause I think that's important. I think a lot of people don't talk about it. Stuff we'll say this person, you know, she goes to private school. And so she knows that private school costs this and most people make this. And I was like, how would they send their kid to private school? She's like, I don't see how I'm like, and that's why they're not there because it's expensive.\r\n\r\n\r\nInstill that in her. Like, how did you teach that to her? So my oldest son is 10. I love him to death. He can't keep a secret to save his life.  And there's been several times where he's asked me how much money we have.  And I want to tell him to help him understand, kind of like, Hey, look, we sold some companies.\r\n\r\n\r\nThis is my income. This is where we are.  But every time I ask him, I say, look, if I tell you this, you can't tell your friends. Yeah. Can you keep, can you do that? And he looks at me, he thinks about it and he looks at me and he's like,  Yeah. I don't,  you shouldn't tell me dad, cause I don't think I can, I don't think I cannot tell them  he's going to get older at some point and he'll be able to work through that.\r\n\r\n\r\nBut for you and your daughter,  how did you introduce her to those concepts early? Because I'm thinking about this a lot now with my sons.  You know, we always, so we're big, like tundle twins fans. She reads those books and we were reading those to her. And what is that? I don't know always talked about that.\r\n\r\n\r\nThe Tuttle Twins? Holy crap, really? Oh my gosh, Conrad Boyack, sorry, Connor Boyack, he's amazing.  The, okay, the Tuttle Twins? I need to you. The Tuttle Twins? I think he lives in Idaho.  I'm not saying I'm cultured, Jackie. Okay. I'm just saying,  Oh, I think your kids would love it. You know, he has books on like the golden rule and crony capitalism about how like capitalism isn't good.\r\n\r\n\r\nIf it's like just your friends and you keep everybody out, you know, through regulation, but unnecessary regulation, it's just amazing. So yeah, we've always been talking about stuff like that.  I'm going to go on Amazon. We bought them. I'm saving a bookmark right now. We bought like multiple sets for our children's, um, library.\r\n\r\n\r\nLike we bought the whole set. I've been thinking a lot about this. I want my sons to understand. I grew up with no money and I had no concept of how I was supposed to handle it. My kids are growing up, you know, thankfully in a much different situation. I want them to understand what does it mean to manage your own money, but on top of that, What's the  macroeconomic environment?\r\n\r\n\r\nWhat do those things mean? And I do it myself, but yeah, at the time I love having Sort of told  to a child through these books. I'm going to check them out. Absolutely. So, okay. I'm not a parental expert. Right. And you have more kids than I do, but I'll tell you this. I look at being a parent, like I'm a tour guide and I don't want to be hired for that job every single year.\r\n\r\n\r\nI always want to be hired for that job. So I think about it, like, would my kid give me a job review and what would it be? And what does that look like? Cause I think yelling is like, you're going to step in a hole. Don't do that. Right. Like that's yelling, but not like,  I feel like the way people talk to their kids, sometimes they don't  they would never talk to a coworker that way.\r\n\r\n\r\nThey would never talk to a stranger that way. So, like, why are you speaking to your child that way? Right? So I really try and look at it like that. And for her to trust me, I have to trust her. And I really look at that and take it very seriously. And so I don't make fun of her and like, we, I have her back and I stand up for her, although sometimes I think like my husband was worried that we were going to get kicked out of the school at the time during COVID because I was like fighting the mask policy and like, I was fighting hard and he texted me.\r\n\r\n\r\nHe's like, you need to stop. And I wrote back. Not stopping. And like, when Michael asked me to do stuff, like I almost always do it because I love him and he's like, he's my number one, like tied with Melina. So it was, it's hard, but yeah, I will fight for her. And she knows that. So I think there's a really strong basis of trust and then a really big information exchange.\r\n\r\n\r\nI'm always trying to listen to her and hear her perspective. And then. Really, I'm trying to get her to understand the world through all sorts of different things, like psychology, money, fitness. Like we have a home gym and it's a serious home gym and we all work out in the gym six days a week in our house.\r\n\r\n\r\nAnd she's there. So she's there. She works out every day. She's a Taekwondo black belt and she does trapeze and archery. She's like amazing. You probably don't think of it this way, but  you're brokering her experience in life.  Like your job is to take this human being, learn everything about them and make sure that they feel comfortable.\r\n\r\n\r\nMake sure that they trust you. Make sure that the advice that you give them is taken, right. Which is exactly in a broker relationship and then show them their options and try to get them to understand. And eventually, ultimately they have to make their own choice.  Hopefully you're giving them enough good information.\r\n\r\n\r\nSo I like seeing you take your brokering experience and apply it to your daughter because you know, it, it's very much like that. Yeah, I would say maybe I was always a parent and maybe this is, I've always been like this with my clients. You can't buy this. This is a mess. Like do not do this. And you know, I had a, I did, um, business like that yesterday we had a showing and in the deal I'm like, or in the zoom call, I'm texting him like, you cannot buy this.\r\n\r\n\r\nThis is a disaster. Like I'm texting like in the call,  like I'm like on the screen like this. And then I'm like,  Yeah. And then I abruptly ended the call with, thank you for inviting us.  Thank you for the invitation.  So, okay. Here's my question. You've sold over 400 businesses.  Since 1998. That's a lot of businesses.\r\n\r\n\r\n400.  It's a lot of businesses.  Are there any businesses that stick out to you or experiences that stick out to you that you're like, I'll never forget Johnny Brown?  Oh yeah. There's a lot of experiences. I have people, you know, die during the deal or after the deal. I hear when people are sick. Yeah, absolutely.\r\n\r\n\r\nYeah. I sell some serious stuff and I got to take it very seriously. I take it very seriously, you know, and. Yeah. I had somebody call me and they're like, my husband has a mistress. And I was like, Oh no, not one of these again. But she's like, it's the business. Business always wins out over dinner or dates or travel.\r\n\r\n\r\nLike the business always wins. And I want her gone. I want that business gone. And they had had it for four years. And I. Said, okay, I got it.  And then some of my sellers, they grew up with nothing. And then I hand them like a check for millions of dollars.  Right. And so I'm dealing with somebody who grew up in a trailer and now that they're a multimillionaire and they've been a multimillionaire for a bit, but it's really hard for them to merge those two people sometimes.\r\n\r\n\r\nNo, not in paper, like still a multi millionaire and then get like another few million. It's hard. And I get that because my family, my dad was a rocket scientist, so there were four kids. And so we had plenty of love and we had everything we needed, but I saw that there was a lot more out there and there was a lot of stuff we couldn't do.\r\n\r\n\r\nAnd  like, I feel like that like child lives within me. And so I have to like take down every deal, have like millions and millions of deals pending for me to feel like. I can put food on the table, which is ridiculous. I probably could not work for 15 years and be fine.  I've been there. What's your typical deal profile?\r\n\r\n\r\nLike are you dealing with  10 million or less? Are you dealing with 20 to 50 million deals? Like what size of deals do you typically broker? A lot of 10 million and under, I would say like deal size, like one to 10 million. I would say my average deal size is about 3 million. Like I love doing those deals all day long.\r\n\r\n\r\nI think I sent you one that I just closed on a couple of weeks ago. It was for 4. 2 million, 1. 1 EBIT. I mean,  Okay. If you don't know the answer to this, we can come back to it. Okay. Okay. What are your biggest deal? Red flags. I wish I would've emailed you this before we started, but as you think about it, as you're looking at deals and you evaluate deals when you're looking, what are the biggest red flags that you see? \r\n\r\n\r\nOkay. So  deals are like people,  right? You usually see the red flags right up front.  Usually, right? You might choose to ignore them. You might choose,  but you usually see them upfront.  So I had somebody called me yesterday and he has a business. I won't say what it is, what kind, cause there's not that many like it, but it's a nice industry.\r\n\r\n\r\nAnd he's  taking like his, his net to him is probably  a million, two, a million, three.  Okay. Consistently.  But he doesn't file tax returns.  He doesn't file tax returns and it's shocking. And I was like, listen, I can't, I'm like, are you willing to file tax returns? He's like, I see you don't have any experience with this and hung up.\r\n\r\n\r\nI was like, you're right. I don't have experience with criminals. You're right. \r\n\r\n\r\nGood luck. Good luck selling your business to Pablo Escobar. Yeah. So it was interesting. So red flags, you know, taxes.  Well, obviously if somebody is going to, I don't mind if somebody deducts a bunch of stuff because I think that as a business owner, you can  use the tax rules to your advantage. And there is a tax consultant and he'll tell you about one of the, um, rules that says if you order furniture and have it delivered to your office and it stays in your office for one day, you can write it off. \r\n\r\n\r\nI'm not saying I would do that because I find it horribly inconvenient. I don't like dealing with furniture anyway, why would I do that to my office and make myself crazy? But you can do that. Um, and I'm not here to give tax advice. I'm just saying what he said, but I think if somebody is  paying people under the table,  I think if somebody has certain vendor relationships, you have to really look at that.\r\n\r\n\r\nBecause why wouldn't you run a clean business? So you can do your own stats. You can do your own KPIs. You can do your own analysis. If you're not even thinking on that level of strategic, you know, planning, just even a little bit, it's going to make it challenging to sell the business. And every business has something.\r\n\r\n\r\nWell, when I speak in bootcamp, yes, I speak for Tamara Rosati's bootcamp on dealing with a broker, which is super fun, by the way, I love doing that. It's like a joy, a new joy that I'm loving. Bye. You know, we talk about how deals are like people and they all have hair.  I've never met a deal without hair. So 90 percent of what's on the market is garbage and 10 percent has problems.\r\n\r\n\r\nAnd so you'll be buying like the 10 percent with problems. I think if I were to summarize, I'm going to put words in your mouth and then you tell me. What I'm saying, what I'm hearing from you and the way you're describing these things is  you look for low integrity red flags, because if there's a red flag that implies low integrity,  yes, it makes the deal harder to sell ultimately, but there's also probably something else that you may find out about. \r\n\r\n\r\nAt the last hour. Is that kind of fair? Yeah. And I've never, Nick, I've never thought about it that way, but that's, I feel like a lot of my sellers have a lot of integrity and there are people I'd want to hang out with. There are people I'd invite over into my house and be with my family. And if I don't feel like that, I don't usually want to take the deal because after 25 years, I don't have to take every deal.\r\n\r\n\r\nSo if somebody makes me feel weird or I just don't feel like it'd be a business. I'd be interested in buying or a business. I'd be interested in investing.  How am I going to sell that to somebody else? Do you? It has to be compelling. Do you only do sell side brokering or do you do buy side brokering or?\r\n\r\n\r\nNo, I'll do some buy side brokering, but I don't, I don't take a buy side fee. So in the state of Florida, yeah. In the state of Florida, we co broker, which is unusual. Not every state does that. Yeah. No, I've never seen that before. Yeah. It's unusual. And I do enjoy it. It's like real estate almost. It is. Like, I would say like 30 percent of my transactions might be co brokered and all, and you've brokers you like and brokers you don't want to work with.\r\n\r\n\r\nAnd so you have to build that trust with those people as well. And you have to show up as trustworthy. But for the state of Florida, I did the webinar this year on how to package a business properly. I've never bought a business through a broker.  I know. I heard that. I thought that was great. I've bought  seven, eight, somewhere in that range of businesses,  but that's not entirely true.\r\n\r\n\r\nTo be honest with you, I did once work with a sell side broker.  They call themselves a sell side broker. All they did was introduce me to the seller. And that was it. I did everything else. I did all the due diligence. I did all the negotiation. And then I paid a 10 percent fee on the sale. It was stupid.\r\n\r\n\r\nI'm glad I did it because it was a very, very good deal. But anyways, my experience with the majority of brokers, and I can already tell you, you're not, you're not the majority of brokers  is  they will play it really close to the vest. And they won't. The reason I don't like to go through them is because they don't allow me to the seller.\r\n\r\n\r\nAnd I know That part of my value props, part of my superpower is building a relationship with somebody. So if I can't build a relationship with the seller,  then, then we're just competing on price. And if I'm just competing on price,  I don't have really any interest in buying that business. Hearing that for me,  what do you look for when you're talking to someone?\r\n\r\n\r\nLooking for a business, right? Are you looking for like, yeah, what are the attributes that you look for in that type of a person again? So I want somebody who seems to have high integrity, who's going to take care of the team, who's going to treat them well, who's going to treat the customers well. So I'll tell you, there was a business that I put pending just a couple of weeks ago and no, it was, it was.\r\n\r\n\r\nWas it last week? It may have been last week. Yeah. It was last week. It all runs together. It all runs together for sure. So I was at bootcamp and there was this former boot camper and he had been looking at deals here in Orlando and there was a business that came on the market. You got to sign the NDA for this like now.\r\n\r\n\r\nAnd because he was so prepared, he had a one page on himself. He had London prequalifications really actually was more than one page. It was like resume bio, what I'm looking for. He had a picture of me and my dog and my wife and like really clear. And so when I sent the NDA, I sent that and the other broker sent that to the seller and the seller immediately started researching this guy and found out that they knew all these same people.\r\n\r\n\r\nSo when we got on the call, I was able to get a zoom call because like this broker knows I hustle and I will close that deal and he won't have to do anything. So it's a good deal for him. And I'll run the whole deal and we'll just collect his fee. Okay.  So, uh, and I'm happy because my guy gets the deal. \r\n\r\n\r\nThe whole call, the first call was  who they know, what those people are doing, where they live, where they like to vacation. There was nothing about, I'm like, what's this business do? I don't know what this business does. And then the second call was about them taking care of their dads.  Still don't know what the business does.\r\n\r\n\r\nDon't know who works there, but there were four full price LOIs and my guy got the deal.  And I believe it's because that initial one page. I tell everybody I talked to, I've, I've been flooded with people who reach out to me on Twitter. They're like, Hey, I'm trying to buy this deal. What do you think? Right.\r\n\r\n\r\nEvery person I talked to, you can disagree with me on this. I say in the first conversation, don't talk about price or finances.  Just get to know them. Just have a conversation. Like you need to feel comfortable with this seller and they need to feel comfortable with you. So, because if you don't feel comfortable with them, who knows what skeletons are hiding in the closet.\r\n\r\n\r\nAnd if they don't feel comfortable with you and you have trouble financing or inevitably like any deal, something comes up, it just makes it really hard to work through those things. If you guys don't have a relationship and if you come in first question, What was your EBITDA last year? Then it's like, okay, this is just a transactional relationship.\r\n\r\n\r\nSo I'm just going to base it on the transaction itself as opposed to a relationship, which is what it should be. And so for me, I was like, we may talk about it, right? It may be like at the end of the call, or we may say something about price, or they may ask a question, but I am never going to bring that up on the first call because I don't care about it on the first call.\r\n\r\n\r\nI care about  how to, you know, how is this business run? And I can tell that by the owner.  Yeah, that's good. I think that's a good sign that they were talking about.  Absolutely. And whereas I know, I know one of the other buyers that was looking at it.  And that guy asked like all of those ratio questions.\r\n\r\n\r\nWhat are your KPIs? What's this? What's your cat?  Right. I'm sure the seller's like,  you know, and he doesn't know why he didn't get the deal.  I know why. Yeah.  All right. Let me ask you this. You're a broker. You've seen hundreds of, you've seen thousands of deals. You've closed hundreds of them.  Right now you are, let's say you go back  and you're buying your first business  and you couldn't be a broker. \r\n\r\n\r\nWhat is attractive to you? What would you go after? What are you like? I love this industry.  So as a kid, okay. So first my, my, My favorite toys as a kid, I had a large metal Tonka truck, like it was an auto trailer. And then I had a farm. And so I would transport stuff, right? I would be doing my own like animal brokering commerce, right?\r\n\r\n\r\nThat's what I would do. And so I love that. So I love farming and I love construction, but the other business I wanted was Bob's barricades. So Bob's barricades were like everywhere in Florida and I don't know who Bob was, but I always wanted to meet him. And whenever they had construction, they would. Put up the barricades and be Bob's barricades. \r\n\r\n\r\nGosh, I love that business. And sometimes I wonder like if I would have felt like I could have gone into construction. Cause that was like one of the things I really loved. And when I was in school, I graduated high school and I had a full ride to college and. Again, it was lean in our family. So my sister was in law school while I was in college and then I had two other brothers and one of my other brothers wanted to become a doctor, which he did.\r\n\r\n\r\nAnd  I didn't really have any time to like experiment. Like I got a business degree and I got out in three years and like done and out the door university of Florida.  You didn't get to necessarily  go out and explore and experiment on the things that you wanted to do. No, I mean, I did. I was super active on campus.\r\n\r\n\r\nAnd so I did a lot with that. And I was in a very active campus organization called Blue Key. It's only in Florida. So it's, but if you go to the University of Florida, it's like a big deal to get into Blue Key. And so I got into Blue Key and I did stuff like I'd be backstage for all the concerts and I was in the homecoming pageant, which I Which is not Miss UF.\r\n\r\n\r\nThose are different. Like homecoming pageant is like the women that are active on campus. It's like a bunch of, and I'm not insulting myself. I'm just saying it's like a bunch of eights versus Miss UF is like a bunch of tens and so it's like two different pageants. So this was like the ladies that are super active on campus and all have careers.\r\n\r\n\r\nThey will always like the pageants. It was the pageant for, for Leslie Knope from parks and rec. You ever watched that show?  Probably similar. She's just passionate. She's passionate about governance. She's passionate about student. Yeah.  It's great. It was like that. So, I mean, it was,  and honestly, like, it was the first time cause I didn't know a lot of those women  and it was like, Oh my God, there's a lot of women like me, or at least this group of 20 people that are super ambitious and always working like crazy.\r\n\r\n\r\nAnd I was like, gosh, there's other creatures out there like this, you know, cause.  I was always a little envious. Like you asked me like before, like what would be my dream job? I'd love to be a stay at home mom.  That there's something really exciting about that. I sometimes feel like the Ray Bradbury story, like Rocket Man, when in that story, Elton John writes a song on the Rocket Man, and it's about like, when you're in space, you want to be home, but when you're home, you want to be in space.\r\n\r\n\r\nAnd you can't really quite.  Mix the two.  We're going to end with my rapid fire questions. Okay, let's do it. I love live surprise.  What do you love about being a broker?  I love that. I work with really smart people, both buyers and sellers and people really trying to do something. We usually have a lot of the same  kind of life outlook.\r\n\r\n\r\nOn how things should be trying to do better, trying to do better for the community, trying to do better for your family, how things could be different, how to better support the staff. I love that. I never get tired of that. And I never get tired of community building and selling a business to somebody and they're going to keep all the staff and keep it going and grow it.\r\n\r\n\r\nThat part's really exciting for me. What's, uh, what are the downsides? What do you hate about  Sometimes I'm so in it. We did an F reorg on a deal recently. I thought it was just going to end everybody from the bank to the M& A law firm, or they said they were an M& A law firm and they've never done an F reorg.\r\n\r\n\r\nAnd just renaming this like small corporation was like,  It was insane. So I think sometimes I get really stressed out and you had a guest on this where they work like crazy cause they don't know when is enough or how to step back or how to, and so I have to manage that. Like not let the deal run me and really try and keep the party going, but nobody's having fun.\r\n\r\n\r\nSo there's some stress and,  Yeah. That's a really good analogy. I've got to keep the party going, but nobody's having fun. Jeez Louise. That's, that's, that's spot on for a broker. It's just when you think you've seen it all in 400 deals and then there's of course deals that didn't happen. You see something you never seen before.\r\n\r\n\r\nYou're like, I didn't see that coming. I did not see that one coming.  All right.  Here's my last question.  What are you obsessed with right now?  If you have a free two hours, okay. If you have free two hours, what do you, you open up your Mac book and you're like, Oh, I'm going to go research something or I want to watch a show or I want to listen to podcasts or I want to go hike.\r\n\r\n\r\nWhat are you obsessed with right now? Okay. Well, usually if I have time, I go to the park with Melina, right? So, you know, hang out with Melina. We scooter, we will work out in the gym or go places or just do stuff. Always that spending time with. Michael and Melina. Um, and then I'm trying to read, I'm always trying to like do either manifesting or reading other publications.\r\n\r\n\r\nAnd then I do listen to a lot of podcasts. I'm always trying to download as much information, always on two X,  you know? Yeah, of course.  So one, one time it's too slow. No, I had totally. I had somebody tell me recently that I need to slow down the way, like, The pace of my talk, because he's like, people listen to this on one and a half or two times and you just sound really fast compared with those anyways.\r\n\r\n\r\nSo correct. No, I, you were at 1. 75. Actually, I did have to take it down. But, um,  yeah, but I think like sometimes like the, it depends upon the audio of the other person, which is why I was so like, I had to have a good microphone for this. Cause I didn't want the audio to be bad. Sometimes I hear like bad audio.\r\n\r\n\r\nAnd so when it's like not clear audio, I can't do two X, I can only do like 1. 5.  All right. That makes sense to me. Well, this was awesome. Jackie, I really, really appreciate you making time and I honestly can't wait to talk to you again because this was a fascinating conversation. Where can people find you?\r\n\r\n\r\nWhere's the best place?  I'm on, I'm on Twitter. You can do at SMB, Jackie Hirsch. Okay. That's there, but I love your deal therapy that you're doing. I think it's helping a lot of people. Good. You're unlicensed deal therapy. It's amazing. Yeah. Sit down on the couch. We'll talk about all your childhood drama. \r\n\r\n\r\nIt's so good. Trauma, money, religion, like let's cover it all. All of it. Oh, well, Jackie, this was, this was awesome. Thank you so much. Thank you.  I told you. I told you she's likable. Energy is infectious. She's awesome. Big. Thank you to Jackie for joining us.  I think as I've had time to reflect on our conversation, I wanted to drive home a point that kept coming up in my mind as we were speaking.\r\n\r\n\r\nAnd that is not all brokers are bad. Now. I've never bought a business through a broker, but I've spoken to a lot of brokers. I've sold a business through a broker, but I've never bought a business through a broker. And I think sometimes brokers get a bad rap and there's definitely some bad brokers out there.\r\n\r\n\r\nBut Jackie is one of the good ones. As you're looking for a business, you want somebody who's on your side, who can be an advocate for you, who understands the process, who understands the nuances of how to get a seller. And a buyer on the same page, because many times the broker is just playing middleman.\r\n\r\n\r\nThey're trying to make sure that the deal doesn't blow up. They've got exceptional people skills. They're smart. They understand the market. They calm and reassure everybody. And as you're going through the deal process, there will be points along the line where the deal looks like it's going to blow up.\r\n\r\n\r\nAnd if you don't have somebody competent in your corner, like Jackie,  then it is going to blow up. If there's not somebody there. To bring the temperature down and tell everybody to take a breath. It's really hard to self regulate when you're just negotiating buyer and seller. So having a broker there is incredibly important as you're trying to close the business. \r\n\r\n\r\nIf you found something valuable in this episode, I'd love to hear about it. Leave a comment, send me a note, nick at cofounders. com and always remember, there are no such things as dumb questions. There are only dumb people  unwilling to ask dumb questions. I'll see you next time.",
  "metadata": {
    "duration": "",
    "date": "2024-06-26",
    "platform_source": "Google Drive"
  }
}