{
  "episode_number": "200",
  "episode_title": "Crucial Red Flags to Know When Buying and Selling Businesses with Clint Fiore",
  "guest_name": "Clint Fiore",
  "business_name": "Bison Business, Dealonomy",
  "transcript": "﻿Nikolas Hulewsky (00:00.75)\r\nAll right, Clint, I am super excited to talk to you. Let me give the listeners a quick rundown on your background and experience, which is extensive. You are the founder and CEO of Bison Business, which is a brokerage and M &A firm. You've also just founded, launched, raised money for Dealonomy, which is now a new deal platform, which we're going to get into, which I think is incredible. You've been a partner in a Texas-based 50-employee manufacturing company. You've sold...\r\n\r\n\r\nand bought many businesses yourself. You've raised seven figures from angel investors. You've done over 500 deals. At least your company has more than $100 million in enterprise value. Probably if you wouldn't add it all those up, you're probably close to the billion dollar mark, I'm assuming. But you're incredibly experienced in the business buying space. And the first question I want to ask you is, what is the craziest deal you've ever seen?\r\n\r\n\r\nClint Fiore (00:52.966)\r\nMan.\r\n\r\n\r\nNikolas Hulewsky (00:54.212)\r\nThat's not a fair question. There's too many of them.\r\n\r\n\r\nClint Fiore (00:58.394)\r\nThe craziest one ever. You know, some of them, the craziest ones were just the normal deals that went crazy on us. And then we have kind of sub genres that would just be really weird, weird and wacky business models that you've never heard of.\r\n\r\n\r\nNikolas Hulewsky (01:15.756)\r\nLet me, let me, let me introduce one to you that I thought was really interesting. It's a story that I read a while ago and it has like always kind of stuck with me. went back and found it as well. It was a story about a seller who was in his seventies and he was selling to these people who were forties or fifties. They can't remember, but they were well capitalized and the seller did everything possible to sort of self-sabotage and you massage the deal, massage the deal, got it closed. Is this, is this ringing a bell?\r\n\r\n\r\nClint Fiore (01:18.213)\r\nYeah.\r\n\r\n\r\nClint Fiore (01:41.926)\r\nMm-hmm.\r\n\r\n\r\nClint Fiore (01:45.83)\r\nno.\r\n\r\n\r\nNikolas Hulewsky (01:47.254)\r\nOkay, all right. So you massage the deal, massage the deal to the point where the seller was like pissed off at you when it closed. And you were sitting there looking like, dude, I just saved your retirement. These guys didn't need your business. And you're mad at me? It's like...\r\n\r\n\r\nClint Fiore (01:54.042)\r\nYeah.\r\n\r\n\r\nClint Fiore (01:59.931)\r\nYeah.\r\n\r\n\r\nI've had a few times like that with sellers in their 70s or so and big egos. And by the end of the deal, I was sell side on them. So I'm representing them, but they keep doing things to try to change the deal at the last minute and just in generally make everyone's life miserable. Push back on all the documents and\r\n\r\n\r\nEventually they say whose side are you on here? You know, like are you on my side or or not? And I'm saying I am on I am on your side by trying to actually get this deal to close and the behavior you're exhibiting here is gonna kill your deal and and so me pushing back is me trying to help you because you're You're gonna run this buyer off. You're gonna run this bank off and and you're gonna have nothing to show for it then we're gonna be\r\n\r\n\r\nNikolas Hulewsky (02:37.294)\r\nyou\r\n\r\n\r\nClint Fiore (03:01.606)\r\ndead in the water, starting back over from zero. And you've told me you can't do this again, you know? and, uh, and so, yeah, that's, that's kind of, happened over the years. Uh, I started pretty young in this business and a lot of my sellers were a lot older than me. And I'm, uh, I feel like I click with the buyers a little bit more in general, um, because they were like younger, ambitious, kind of playing offense in life. And I feel like a lot of the older sellers, especially we're kind of playing defense.\r\n\r\n\r\nNikolas Hulewsky (03:06.039)\r\nYeah.\r\n\r\n\r\nClint Fiore (03:28.632)\r\nAnd I'm an offensive player by nature, which means I'm ambitious, growth minded and optimistic. And you, have these, some of these people that have held on too long and they're at this point, they're pessimistic, defensive, and, you know, kind of cantankerous in their, in their personalities. And so, so eventually, you know, when we get into a deep into a deal, I'd end up being best friends with the buyers, because they were just kind of like my kind of people, great people.\r\n\r\n\r\ndoing their best to get this deal done. And when the seller inevitably goes out with their golf buddies or their CPA or their attorney and starts getting somebody feeding them bad information in their ear, who, know, the peanut gallery will always tell these guys, you're giving your company away. You shouldn't do any seller financing. What are you doing? you, you're, you can get way more than that. And, know, people will always say, tell them what they want to hear, but no one will actually write the check.\r\n\r\n\r\nNikolas Hulewsky (04:13.186)\r\nYep.\r\n\r\n\r\nClint Fiore (04:28.038)\r\nfor more than what we have it under contract for. And so yeah, if the wrong voice gets in their ear, all of a sudden they start second guessing the deal and pushing back. And then I've got to change my relationship from being their advocate to being their kind of referee and, I don't know, supervisor to keep them in line.\r\n\r\n\r\nNikolas Hulewsky (04:49.986)\r\nWell, there is like that healthy tension of, from the seller's perspective of like, well, I shouldn't even say healthy tension. I understand the skepticism from the seller's perspective of like, well, you just want this deal to close Clint, so you can get paid, right? But what they don't take into account is because for many of them, this is probably the first deal or at least the biggest deal they've ever done. It's not like they're sitting, like they aren't deal people for these SMBs, so they don't understand.\r\n\r\n\r\nthe natural flow of a deal, it's gonna die two times, everybody feels like they're giving up more than the other person. Like for them, it's so personal and you've got to play like therapist, referee, advocate, mathematician, know, all things kind of rolled into one. You definitely earn your money, I will say as a broker. It's not an easy job.\r\n\r\n\r\nClint Fiore (05:40.006)\r\nYeah. Yeah. It's people want to think it's about the dollars and cents, but it's the emotional side and the therapist side of this and just, dealing with those creeping doubts and the cold feet is, is a huge part of it. And I'd say it's almost the more important part of the deal making than the dollars and cents sometimes.\r\n\r\n\r\nNikolas Hulewsky (05:54.05)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (06:01.518)\r\nAlright, so here's what I want to cover today. I think it'd be really fun. I want to go through from a broker's perspective. What are the top five red or green flags, however we want to say it, that you look for when a seller comes to you and says, hey, I want to sell my business. And then what are the top five, let's say red flags you look for when a buyer comes to you and says, hey, I'm looking for a business to buy or I'm interested in XYZ business. And then I want to ask you as a buyer, not as a broker,\r\n\r\n\r\nWhat would be the top five red flags you would look for in a business as you're looking to buy it since you have so much experience looking at tons of deals? If we get time, I want to know like the top five things that blow deals up as they go. And then I want to talk through how you've taken all this, you know, 20 years of brokerage experience and why you're launching a new platform, Deulonomy. I think anybody who's listening.\r\n\r\n\r\nClint Fiore (06:34.682)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (06:55.362)\r\nwho has gone on Biz by Sell or any of these websites has had the thought in their head like, man, why isn't there a better place? Why isn't there a better marketplace for buyers and sellers to connect? You not only had that thought, but you've actually gone and raised money and launched a platform. And so I want to talk about like, what is that? How does that work? The why behind it? So does that sound fair? that cool?\r\n\r\n\r\nClint Fiore (07:01.722)\r\nYeah.\r\n\r\n\r\nClint Fiore (07:13.702)\r\nIt sounds great. Yeah, it sounds great. Like a great way we can help people out to learn this, this space. It's a very cloak and dagger, smoky back room kind of industry that most people don't understand. They've never been on the inside of it. And I think that's why I took off on social media originally was like, I have no problems just kind of peeling back that curtain and saying, here's how it works. And I love teaching about it, explaining about it. And hopefully we can do some tips today that'll help the listeners.\r\n\r\n\r\nNikolas Hulewsky (07:39.918)\r\nOkay, as a broker, when a seller comes to you and is like, I'm looking to sell my business, what are some of the red flags that you look for upfront and why?\r\n\r\n\r\nClint Fiore (07:52.324)\r\nYeah, I mean, the biggest thing, the biggest thing I want to know immediately is why, like, why are you wanting to sell your business? In the small business world. So I'm going to asterisk this. Most of what I'm going to be talking about on the show is going to be like the seven figure size deal, which is like the premium Main Street mom and pop business that's going to be owned by, you know, privately held, small\r\n\r\n\r\nBootstrapped owner that built it themselves and like that's where the typical deal we do is like that that seven figure deals sometimes we do eight figure deals, but we work at kind of premium Main Street world and The economics of these deals until you get into the middle market, you know into the eight nine figure deals The multiples aren't very big in our space. So you're talking two three four five X multiples, which means\r\n\r\n\r\nthat's a multiple of what that earn of what that owner benefits from owning the company each year. And when you tell this owner, I can get you a three X or four X. The natural thing is, is that sucks because I could just not sell. And in three or four years I make that much. And so why would I want to do that? And that's, I flipped that question back on then I'm like, yeah, why would you want to do that? You know, like you tell me you came to me. So, so like,\r\n\r\n\r\nNikolas Hulewsky (09:13.422)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (09:19.104)\r\nYeah, yeah. Because from your perspective, if you spend a ton of time and energy marketing and then they're just they're not in the headspace for it, then that's kind of not a waste of time, but it makes your job way harder.\r\n\r\n\r\nClint Fiore (09:20.486)\r\nThe fact that\r\n\r\n\r\nClint Fiore (09:31.652)\r\nYeah. And so I look for a big why. if the biggest red flag for me is if the seller comes to me and they don't have, they can't articulate a reason they want to sell their business. that means there's something under the surface. means they're either like, scared and burnt out, but they're too proud to admit it. Or there's something wrong with the business that they're not sharing.\r\n\r\n\r\nor there's something going, you know, like they're not being honest with me because I'll be honest with them and I'll let them know the economic reality. it, know, nine times out of 10, it's not worth as much as they wish it was worth. and we have to kind of tactfully gracefully pop that valuation bubble and, let them know where these companies trade, which is not the same multiples as middle market or public companies.\r\n\r\n\r\nNikolas Hulewsky (10:04.045)\r\nMm-hmm.\r\n\r\n\r\nClint Fiore (10:30.438)\r\nAnd so if I don't hear a really well articulated reason as to why I need or want to sell this business that makes total sense to me, that's my first big red flag. So I always look for motive. Yeah.\r\n\r\n\r\nNikolas Hulewsky (10:42.326)\r\nInteresting. Can I ask a quick question on the multiples? Lots of times you'll see SDE, cashflow, EBITDA, and for these deals many times it's interchangeable. What number do you look at? Are you like, I guess let's define SDE first and then for you, what number do you look at as you're setting that multiple in valuation?\r\n\r\n\r\nClint Fiore (10:59.813)\r\nYeah.\r\n\r\n\r\nYeah, those multiples I was describing, aren't EBITDA multiples, those are SDE multiples. And in the Main Street world, SDE is kind of king in our world and that's how SBA lenders like to lend on is as the SDE approach. But let me define that after I cough for one second. Hold on.\r\n\r\n\r\nNikolas Hulewsky (11:19.189)\r\nOkay.\r\n\r\n\r\nWe can edit that part out, don't worry. Get a drink.\r\n\r\n\r\nClint Fiore (11:30.82)\r\nOkay. So yeah, I love nerding out about this topic. you know, EBITDA is the most popular metric for kind of the middle market world and that's earnings before interest taxes, depreciation and amortization. And you can compare companies side by side on a debt free basis. So it kind of takes away their capital structure considerations. And, the problem with EBITDA and main street is it doesn't account for the owners.\r\n\r\n\r\npay perks and benefits and their use of the business as kind of their personal piggy bank with their discretionary spending and things like that, which is much more prevalent on the smaller deals and the owners comp and perks and discretionary spending is usually a much bigger part of the earnings stream than on the middle market companies that have professional management managing the company and don't need as many of those adjustments. And so if you understand EBITDA,\r\n\r\n\r\nNikolas Hulewsky (12:03.406)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (12:29.098)\r\nAhem.\r\n\r\n\r\nClint Fiore (12:30.15)\r\nas just a way you can look at companies on an apples to apples basis based on their, their earnings power, SDE just takes it a step further and it adds back that owner's benefit. So we, we start with net profit, then we do the EBITDA adjustments and then we add back the owner's salary. The payroll tax is associated with the owner's salary and, their benefits that they get through the company.\r\n\r\n\r\nAnd if there's any large, like one time discretionary purchases that the company made that aren't going to be applicable to the buyer that we can document and defend, we'll add those back too. And basically what we're trying to get to is when we do that work, that's called a financial recast. You should be able to see as the buyer, okay, if you own this company and you didn't have any debt on it and you came in and you filled the owner's shoes and you were working full time.\r\n\r\n\r\nand you paid yourself $0. So you were working full time, you had no debt and you only paid the necessary expenses for this company. What's the maximum amount of earnings that was the profit that this thing could make on a normal year. So like that's what SDE is. And that's a big, that's a lot of adjustments to get there. And it's a big earnings number and that makes it low multiples because we do so many adjustments to get there. But\r\n\r\n\r\nNikolas Hulewsky (13:37.016)\r\nMm-hmm.\r\n\r\n\r\nClint Fiore (13:54.446)\r\nI think it's needed to really look at small businesses accurately is you have to get comfortable with that math because that number, that SDE is ultimately what you have to back out your salary. Because remember we said, SDE is paying yourself zero working full time. So what do you want to make? What do want to pay yourself that has to come out of SDE? What's going to be your debt service? That's going to come out of the SDE. And so we, we build up that.\r\n\r\n\r\nNikolas Hulewsky (14:14.615)\r\nYeah.\r\n\r\n\r\nClint Fiore (14:21.444)\r\nlet firehose of income and SDE, and then we back out of it, the buyer's debt payments and their, compensation. And then that tells us what the cash is going to be afterwards.\r\n\r\n\r\nNikolas Hulewsky (14:32.246)\r\nYeah, and part of way that I look at it is like you're saying, in the middle market, for the most part, those businesses are going to have a professional management, so a CEO that isn't necessarily the owner who's exiting. For these businesses, $10 million.\r\n\r\n\r\nClint Fiore (14:40.496)\r\nMm-hmm. Yeah.\r\n\r\n\r\nClint Fiore (14:52.582)\r\nMm-hmm.\r\n\r\n\r\nClint Fiore (15:09.008)\r\nMm-hmm.\r\n\r\n\r\nClint Fiore (15:32.206)\r\nNo, SDE multiples are lower. They're roughly about a turn less than EBITDA. So like, it's pretty common to see EBITDA multiples of like four to six and SDE multiples of like three to five. But I'd say most commonly it's around three, three or four. but it, you know, the bigger the deal, the bigger the multiple, the more consistent the earnings, the bigger the multiple.\r\n\r\n\r\nAnd when you have like a small deal and you have lumpy project based revenue and things like that, then you end up getting the low end of that range versus the really dialed in business with recurring revenue that gets you the higher end of that range.\r\n\r\n\r\nClint Fiore (16:22.491)\r\nYep.\r\n\r\n\r\nClint Fiore (16:33.37)\r\nYep.\r\n\r\n\r\nClint Fiore (16:42.918)\r\nIf they're just, if they haven't been running their business, like they're thinking about selling it, you know, like if, if they've been, that's usually reflected in their accounting. So it's best seen in their books. The typical like boomer owner that's been in business a long, long time, they become masters of proving to the IRS they don't make any money. You know,\r\n\r\n\r\nAnd they've got a million tricks of how to do that. And, and that can be very detrimental to, trying to sell your business. Cause we have to prove you do make money. And the first things that banks and buyers want to see is your tax returns. And if you've, if you're too good at that game, it really, cuts deep on the valuation. And so, I like the green flag for me is if you've run your business, especially in the last three to five years.\r\n\r\n\r\nknowing that you're going to sell it and that you need to have your books accurate. You're going to need to show profit and, to be able to prove everything up and not have a lot of shady, funny business going on. and it's like the mindset of, you, did you view, are you viewing this business as an asset that you're going to be transferring to someone else and that you're going to have scrutiny on, from banks and buyers, or have you just been forever running it with the\r\n\r\n\r\nCat and mouse IRS game as your sole goal in life and with zero thought that anyone's going to actually look under the hood here. And we get a lot of those and, those can be extremely difficult to sell. If, if we, if you've done it, there's a, there's kind of a right way and wrong way to do it. Cause you can take a lot of legal deductions and have your cake and eat it too, and still get your ad backs and still get your value.\r\n\r\n\r\nNikolas Hulewsky (19:08.287)\r\nOkay, I'm back from outer space.\r\n\r\n\r\nNikolas Hulewsky (19:16.897)\r\nYou can hear me okay?\r\n\r\n\r\nNikolas Hulewsky (19:20.801)\r\nAll right, so this is...\r\n\r\n\r\nNikolas Hulewsky (19:28.065)\r\nThis is exactly what you were just talking about.\r\n\r\n\r\nNikolas Hulewsky (19:32.865)\r\nAnd this is a tweet of yours that I had up for this conversation. The CPA says, business doesn't make any money, but the business buys the owner a new platinum F350 every three years. The supplier takes business owner Deep Sea Fishing in Cabo annually. The entire family is on payroll. There's a Vegas trip expensed for the industry conference and $30,000 a year in credit card rewards. It's like exactly what you're talking about.\r\n\r\n\r\nClint Fiore (19:33.221)\r\nYes.\r\n\r\n\r\nClint Fiore (19:57.488)\r\nYep. Yep. All those are all those are pretty good ones. You know, like, like, I can usually get you paid. I can usually get you paid on most of those. That's why I saying there's there's like a right way and a wrong way to play this game. And\r\n\r\n\r\nNikolas Hulewsky (20:13.045)\r\nWell, yeah, and this is not illegal, just to be clear. This is not illegal. This is just what you were talking about. You don't want to pay taxes, and so you're running through as many expenses through the business as possible. And these all should be add-backs to the business.\r\n\r\n\r\nClint Fiore (20:16.069)\r\nYeah.\r\n\r\n\r\nClint Fiore (20:26.244)\r\nYeah. And when a financial nerd doesn't have a, you know, a street smart entrepreneurial business broker running, you know, running point on like what these ad backs are and why they're legit and why every business owner does this and why these expenses aren't necessary business expenses that are going to ding the buyer, because you don't have to do that. You know, that family is not going to be on the payroll.\r\n\r\n\r\nthe college kid of the owner, that's the social media manager that's making 40 grand a year, posting a few times, like you're not going to pay them 40 grand a year to post a few times. Like, any of those things that don't, don't apply. So you have to make sure you, you're able to explain every ad back and explain it in a way that's believable and it's defensible and, and that would survive IRS scrutiny, but there's a wrong way to do it. that's.\r\n\r\n\r\nThe part that sucks is when I get people like, I literally had a call last week and this guy within, and it was a cold lead. Like he didn't know me from anybody within five minutes of talking. He's admitting to probably a million dollars of tax fraud. Like, I mean, and this is stuff that like, I can't get you paid on that is, black hat stuff. And it was like, yeah, my books say I'm making a million a year.\r\n\r\n\r\nOr my tax returns I'm paying taxes on a million a year But I'm really making about two million a year because and he starts rattling off all the things he's doing and it was things like yeah I've got a lake house and we just we spent 250,000 rebuilding the dock. I expensed all that through the company But it was like his personal vacation home and if like I don't want to know about that and I don't want to like you're never gonna admit that to to like the banks and\r\n\r\n\r\nNikolas Hulewsky (22:13.348)\r\nno.\r\n\r\n\r\nClint Fiore (22:22.854)\r\nI mean, I guess people are so people get too cozy with that because they've gotten away with it. And but I tell people, hey, I don't want to hear it. I don't want to hear about that kind of stuff. And and I tell people you can only steal it once. This is my line for that. So if you're stealing from the IRS, that's your you don't get to steal it from the buyer to like you don't get to get paid on that at closing. And it's actually really foolish, too, because\r\n\r\n\r\nNikolas Hulewsky (22:31.425)\r\nas a buyer.\r\n\r\n\r\nNikolas Hulewsky (22:39.676)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (22:45.769)\r\nYeah, yeah.\r\n\r\n\r\nClint Fiore (22:52.09)\r\nNot only is it just wrong and illegal, it's stepping over dollars to pick up dimes. Let me give you an example.\r\n\r\n\r\nThe $100,000, let's just use for easy numbers. You, you expensed $100,000 house remodel. Maybe you have like a construction company that does, that does construction work on other people's houses, remodeling. You remodeled your vacation home and you used your crews and you know, so like the payroll for all that, the expenses for all that were all expensed in your business, but you didn't pay yours. You didn't actually,\r\n\r\n\r\nNikolas Hulewsky (23:17.184)\r\nRemodeling.\r\n\r\n\r\nNikolas Hulewsky (23:32.577)\r\nclaim that as an income on your.\r\n\r\n\r\nClint Fiore (23:34.822)\r\nYeah, exactly. So maybe that adds $100,000 of expense with $0 of revenue tied to it. So what does that do? That reduces your bottom line by 100 grand. And you think you're smart because you save $100,000 of taxable income. Let's say your real tax rate is like 25 % or 28%, something like that.\r\n\r\n\r\nYou think you're a genius because you just saved $25,000 in taxes by pulling that shenanigan off. But when we go to sell your business, if we're running at a four X multiple, you just sacrifice $400,000 of business value to save $25,000 of taxes. What would you rather have 400,000 Mr. Jones or 25,000? You know, it like that's, that's why I say you step over dollars to pick up dimes when you're pulling that BS, especially in your last few years of ownership. It's.\r\n\r\n\r\nIt's a completely, false choice that you're not doing the right thing.\r\n\r\n\r\nNikolas Hulewsky (24:35.721)\r\nIt's funny because as a buyer, I've had multiple of those occasions. I actually like those because number one, it makes the bank the bad guy. Because I'm like, Mr. Jones, I'd love to pay that price, but the bank won't underwrite that because it's not taxable income. And then it puts you as a buyer in a better position because you're like, OK, well, I know that that's because he was treating things the wrong way.\r\n\r\n\r\nClint Fiore (24:43.066)\r\nMm-hmm.\r\n\r\n\r\nClint Fiore (24:54.854)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (25:03.401)\r\nI can get to the higher end of a justifiable, you know, bank underwritten valuation and feel comfortable with that because I know they've been playing some games. as a buyer, sometimes I'm like excited about it. Obviously there can be downsides. I bought a business once and I'll try not to get too in detail about it. They had some fraud that I didn't know about and the IRS came in and because it's a healthcare company, the healthcare number is tied.\r\n\r\n\r\nto the entity, even though we did an asset sale, they garnished our bank. Like they froze our bank accounts and they took what was owed to them from the seller out of our bank accounts. It was a couple million dollars and it almost crushed us. was terrible. anyways, you may think that you're getting away with it the short term, but in the long run, somebody's got to pay the price. And many times, like you said, the buyer shouldn't be paying the price for that.\r\n\r\n\r\nClint Fiore (25:42.725)\r\nYeah.\r\n\r\n\r\nClint Fiore (25:57.86)\r\nYeah. And a lot of that does work out in the buyer's favor. If they're, they're being too aggressive on their tax mitigation or tax avoidance strategy, you may find there's more money there than you thought. And, and people don't talk about that, but, it does work out sometimes.\r\n\r\n\r\nNikolas Hulewsky (26:14.429)\r\nI have found as I've gotten older that I think that people over index on taxes, where they're like playing this game of like, okay, well, they're going to optimize the taxes in the most efficient and best way possible. And like, there's a space for that, but there does come a point where you're just over engineering and you're kind of wasting mental capacity.\r\n\r\n\r\nClint Fiore (26:20.656)\r\nMm-hmm.\r\n\r\n\r\nClint Fiore (26:30.278)\r\nMy parents, my mom and uncle who owned our family business, our nursery garden center in Texas, were the exhibit A on that. they, every time, so the nursery business is very seasonal and it's also feast or famine based on the weather and all kinds of things. As you have good years and bad years. And you know, they're always borrowing money.\r\n\r\n\r\nto pay for the inventory buildup before, because they make all their money in the spring and they have to borrow money to fill up the greenhouses with inventory. And then they hope that at the end of spring, they pay off all the revolving debt and have enough to survive through the negative cashflow months of the hot summer months when nobody's buying plants and get to the Christmas sales and then to the next spring. And so you're always riding that cash.\r\n\r\n\r\ncycle and you're paying the banks tons of interest on revolving credit to support your inventory breathing in and out at the nursery. And I was like, man, why don't y'all ever just save some money and not have to borrow for everything? Like have to keep borrowing. But what they would end up doing is anytime they had a good year where they could have gotten out of that revolving debt once and for all and just become their own bank for their own inventory.\r\n\r\n\r\nNikolas Hulewsky (27:40.651)\r\nMm-hmm.\r\n\r\n\r\nClint Fiore (27:53.242)\r\nthey'd always just go buy a bunch of crap because they, they knew about schedule 179 accelerated depreciation, right? And they would literally have this conversation with their CPAs in November, December every year. if they're like, all right, are we going to owe taxes? Yeah, you had a good year. It looks like you're going to have taxes. Okay, let's go down to the car dealership and they just go, they go buy brand new trucks, SUVs, equipment.\r\n\r\n\r\nNikolas Hulewsky (28:17.697)\r\nmy gosh.\r\n\r\n\r\nClint Fiore (28:20.068)\r\nAnd their whole goal was just to not have to pay taxes. But what ends up happening over time is your, is your balance sheet gets bloated with all this crap that you bought, but you never actually have cash and you never have. And you always are paying the banks tons of interest. And, and I'm like, guys, you are making banks all the money because you're, you're paying.\r\n\r\n\r\nNikolas Hulewsky (28:30.562)\r\nMm-hmm.\r\n\r\n\r\nClint Fiore (28:42.234)\r\nThey're getting loans on the cars. They're getting loans for the inventory. They're, paying all this interest on all these things. And I'm like, guys, you gotta get on the other side of this debt power curve. You're on the wrong side of this. And this is why you never have money is because you're paying the banks all this money every year. but it was because they're letting the tax tail wag the dog is what I would call that. Is there so worried about, you know, if they show a few hundred grand of profit and they leave hundreds of thousands of dollars in the bank, so they have like more money and could\r\n\r\n\r\nNikolas Hulewsky (28:57.803)\r\nYeah.\r\n\r\n\r\nClint Fiore (29:11.216)\r\ncould be their own bank, they'd have to pay taxes and that's their, that's their worst nightmare. So I guys, if you're listening to this and your business owner, there's worst freaking things and paying taxes, paying taxes means you're doing something right. means you're making money and, and yes, be smart about it. Like, take all the write-offs you can, but don't do to this expense of never getting ahead in life because you're so afraid of paying taxes.\r\n\r\n\r\nNikolas Hulewsky (29:22.709)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (29:36.993)\r\nAll right, those are two red flags, which I like. Let's flip to the buyer side. So as you are going to market, you've listed this business, what are the biggest red flags you see or you look for when a buyer approaches you and says, hey, Clint, I'd like to see your Sim.\r\n\r\n\r\nClint Fiore (29:55.598)\r\nYeah. Yeah. You know, most brokers like really heavily indexed and we do too, to an extent on just, you have any money? You know, like that's, that's a big one. I can't overemphasize the, how much brokers like it when you have money, when you show up to a deal.\r\n\r\n\r\nNikolas Hulewsky (30:06.817)\r\nWhy is that important?\r\n\r\n\r\nClint Fiore (30:20.262)\r\nIt that's usually the first thing is most people are borrowing to buy a business on Main Street deals, but you have to have a down payment. And so like the first thing most brokers try to do is screen you with they're going to ask you for your net worth, your liquidity or personal financial statement or some indication that you're financially qualified for this deal. Because we all have lots and lots of buyers coming at us and the hardest buyers\r\n\r\n\r\nto get across the finish line are ones that just are so thin on their financial firepower that they're, you know, scraping the couch cushions to try to get the down payment and trying to raise friends and family money after the fact, after the LOI, which adds time and deal risk. And so, I would say being cagey about that answer is a red flag. So\r\n\r\n\r\nwhen I hear buyers will ask you a lot of times first conversation of, we'll ask you like,\r\n\r\n\r\nNikolas Hulewsky (31:16.769)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (31:22.303)\r\nLet's role play. I'll ask you. I'll ask you. So Clint, do you have enough money to put down to buy this business?\r\n\r\n\r\nClint Fiore (31:30.532)\r\nI I can get it, like I've got it.\r\n\r\n\r\nLike, stuff like that.\r\n\r\n\r\nNikolas Hulewsky (31:36.993)\r\nThe worst answer.\r\n\r\n\r\nClint Fiore (31:42.224)\r\nThat's the red flag answer.\r\n\r\n\r\nNikolas Hulewsky (31:42.913)\r\nGet it. Are you a loan shark? my gosh.\r\n\r\n\r\nClint Fiore (31:49.53)\r\nI've got all these people who want to invest with me.\r\n\r\n\r\nNikolas Hulewsky (31:50.635)\r\nDo people really, people say that? People say that? I can get it.\r\n\r\n\r\nClint Fiore (31:54.436)\r\nYeah, they say, you know, good deals, good deals, have no problem getting capital. And there's people that teach that. And it's, to an extent it's true, but not if you're a loser that's never done it before. Like I've raised money. I know it can be done. I'm not like I've raised seven figures for pre-revenue startups from angel investors three times. So if anybody knows money can be raised, it's me.\r\n\r\n\r\nI know that's a thing that happens, but for a small business transaction, the, especially if you're going to go the SBA route, they've got to see seasoned, funds, know, they're like, they've been sitting in an account. They know where they came from and they knew, and if you don't have that lined up personally, you better know who your financial partner is and introduce them right away. And I won't, and show us the down payment. like, that's a huge deal.\r\n\r\n\r\nNikolas Hulewsky (32:52.427)\r\nSo what if you ask me the question now and I'm going to be someone who doesn't have the money and you tell me if this is the right answer.\r\n\r\n\r\nNikolas Hulewsky (33:04.801)\r\nSo you ask me, ask me, do I have, whatever, do I have the money to close?\r\n\r\n\r\nNikolas Hulewsky (33:10.625)\r\nWe're role playing. Okay, I'll... I froze? Dang it. Okay, so ask me if I have the money.\r\n\r\n\r\nClint Fiore (33:11.91)\r\nSorry, you froze up there for a second, Nick.\r\n\r\n\r\nClint Fiore (33:20.486)\r\nSo do you have the money for this?\r\n\r\n\r\nNikolas Hulewsky (33:23.773)\r\nI do have the money, but it's not my money. I have some investors, but the reason I reached out to you is because this is a healthcare business. I've worked in operated healthcare companies for the last 15 years, and I have three investors who have committed to fund any deal that I find under $5 million. As long as it's in the same space as my experience, I'm more than happy to send you my resume as well as their contact information so you can see what their background is.\r\n\r\n\r\nClint Fiore (33:47.588)\r\nThat's the way you overcome it. So that's a great answer. Like as long as you show me that those, those investors have names, they have phone numbers that you'll bring them in on a conversation shortly after this conversation. And so I know they're not just investors, you know, that, that are, you've dreamed up here. that's perfectly fine. then, then that really segues into the second thing, which is experience. So we want to see the financial wherewithal and we want to see the experience.\r\n\r\n\r\nNikolas Hulewsky (33:49.226)\r\nYeah, okay.\r\n\r\n\r\nNikolas Hulewsky (34:04.063)\r\nRight, right.\r\n\r\n\r\nClint Fiore (34:17.742)\r\nIt's very hard. Sellers are smart. They're smart about like, who's going to be successful or not. And most sellers, they want you to be successful as a buyer because ultimately a big determination of a seller satisfaction is being able to drive past that business in five years and see it thriving and see like, man, that thing that I did is still doing great five years after I sold it. And it gives you a huge pride as the owner.\r\n\r\n\r\nto see the new buyer being successful. And if you come in and you've never managed people, you don't have industry experience, think owners overindex on industry experience. And that can be a real detriment to you as a buyer if you don't have industry experience. And so if you're inquiring about a deal in an industry you haven't worked in, you better have like a good way to explain how...\r\n\r\n\r\nyou're not going to flail around in this industry with this person's company. And so you need to get industry expertise really quick or have a partner that has industry expertise that's helping you out or something to bridge that experience gap. But I also look for just general experience. Have you managed people? Have you managed finances? Have you managed a PNL? Because I want to see people that have led humans and\r\n\r\n\r\nall the messiness that goes along with that and have had responsibility for profit and loss and know the pressure and responsibility that comes with that. And that's all applicable here. So any of your management experience or financial management experience is really going to come into play as well as industry experience. So that's the two things we want to see. then the, I'd say the third thing is just, you done deals before? And do you know how this stuff works? Or are you,\r\n\r\n\r\nOr did you just read a book and you're about to make my life absolute hell because you don't know what you're doing with due diligence. You don't know what you're doing with the legal side of this. And do you have advisors around you that are experienced in small business transactions? Are you bringing, you know, your, some random attorney that doesn't, doesn't do these types of deals that's looking over your shoulder or\r\n\r\n\r\nClint Fiore (36:43.994)\r\nyou know, just a bad news bears deal team on your side. That's, that's a big red flag too.\r\n\r\n\r\nNikolas Hulewsky (36:50.177)\r\nSo with all your history, with those, like you said, the red flags for a seller is going to be, hey, why are they selling? And have they been actually operating their business in a way where their financials make sense? For a buyer, it's, they have the money, do they have the experience, do they have the, sorry, do they have the experience broken into two sections? One, managing, operating, and then do they have experience with deals or people around them who have experience going through this process?\r\n\r\n\r\nAs you've gone through the last 20 years, what has it been about, I guess, the traditional buying process that led you to think, I'm going to launch something to fix this. We need to fix this. This idea that I have, I think, fixes it. This is what's broken. Here's how we can do it. What about the current process has been broken?\r\n\r\n\r\nClint Fiore (37:43.14)\r\nYeah. So I think business brokers have somewhat a well-earned bad reputation in general. And I think that's a little bit unfair because I think really every industry is like this. I like to compare it to real estate because everybody's very familiar with real estate, but everybody knows there's tons of real estate agents, but 80 % of them are absolutely worthless and you would never use them to sell your house. And,\r\n\r\n\r\nBut there's like 20 % they're actually competent and good and know what they're doing. And that would be a good choice to help you buy or sell a house. And, but what's interesting about real estate is you can usually figure that out. Like who are the 20 % that are the high volume award winning producers, but in M and a and business brokerage, it's really hard to figure that out. And you don't bump into those people every day. And so the 80 20 rule is in effect. And if you just randomly bump into.\r\n\r\n\r\na business broker, &A advisor, you may get one that's really green and doesn't know what they're doing and is stumbling around making a bad name for themselves, but you just haven't found the 20 % one yet. And, and if you just bump into a few of them, you may think all business brokers suck because you just happen to run into the 80%, not good ones. That was my experience as a buyer. So kind of what led me into this industry was, at one point I sold,\r\n\r\n\r\nthe manufacturing company I was a partner in and had some capital from that exit and decided I wanted to buy a business. And so I started, I didn't know anything about it. This was a long time ago, but I did the like Google business for sale search, but all this whole ecosystem that we've met in the, the Twitter ecosystem, the, the courses and gurus teaching about it and writing about it. None of this existed yet.\r\n\r\n\r\nAnd so I'm just stumbling around in the dark, you know, trying to learn how to buy a business. And I started running into business brokers and it was very unimpressed and it felt like the most backwards industry I'd ever seen. Um, again, I bought houses many times and I could get even in the early, you know, the, this was probably on 2012, 2013 that I was trying to buy a business. Um,\r\n\r\n\r\nClint Fiore (40:07.736)\r\nAt this point, the internet was advanced enough on houses that you could get 95 % of the way to a buying decision in your pajamas at midnight on your computer when it comes to buying a house. But when you try to buy a business, you can't even get 5 % of the way on your computer before you hit some dead ends. And, and what I, what I found was it was hard to find a good deal. They, they were overpriced. They had incomplete information.\r\n\r\n\r\nthere were listings that looked good, but when you finally got ahold of the broker, they'd say, sorry, that sold six months ago. but you know, we'll find you something else. And, it was like, every time you found something that looked promising, you'd get the actual information. It was 180 degrees opposite, or it was already sold or it already had, you know, 20 bids on it. And, and it was like, I couldn't get a call back. I couldn't get taken seriously. And I had some experience and I had some money and I felt like I was a perfect buyer.\r\n\r\n\r\nbut I could not get respect. I could not get the time of day. I couldn't get a good deal to save my life. And I struck out for so long that eventually I snapped and I said, somebody needs to make this easier. Like this is ridiculous how hard this is. And so I built the brokerage I wish existed when I was a buyer. And then I ran that brokerage, but we were a kind of a Texas based firm and our, just did a quality first approach where we just said, all right, we're going to be very buyer friendly.\r\n\r\n\r\nNikolas Hulewsky (41:08.363)\r\nHmph.\r\n\r\n\r\nClint Fiore (41:34.992)\r\nwe're going to only represent deals we would want to buy at fair valuations and always have complete information and no bait and switch tactics. Just be the kind of broker that we wish we had run into when we were trying to buy. And that worked. But then what changed for me is when I started like teaching about our process. So 10 years went by, did lots and lots of deals.\r\n\r\n\r\nAnd then I got on Twitter and started teaching and preaching about our quality approach and how this works from the sell side, because I don't think there were many brokers sharing the broker side of the story or the seller side of the story. But there's lots of people teaching about selling the dream of buying a business, but like a lot of them didn't have the rubber hits the road experience that I did of actually doing it, like actually selling businesses and how it works from both sides.\r\n\r\n\r\nNikolas Hulewsky (42:17.589)\r\nbuyer side.\r\n\r\n\r\nClint Fiore (42:31.47)\r\nAnd so I just started teaching about it. And then I heard over and over again, man, that's a breath of fresh air. I wish you weren't just in Texas. Cause I would love to buy a business from you. I hate brokers, but you're okay. You know, like that's, that's the most common thing I would hear is like, I've never met a business broker I liked, but I like you and I like the way you do business. And\r\n\r\n\r\nNikolas Hulewsky (42:53.013)\r\nWhat was the biggest differentiator of what you're offering?\r\n\r\n\r\nClint Fiore (42:57.52)\r\nI mean, it's just doing the things that I wanted. It's just the golden rule type stuff. It's like, just call people back and, and like, yeah. And set appropriate valuation expectations with the owner so they're not completely smoking crack on their asking price. And, and so I've always done that. I've just leveled with the business owner. I take on deals that I think are fair.\r\n\r\n\r\nNikolas Hulewsky (43:07.189)\r\ndon't have a listing that's expired beyond your website.\r\n\r\n\r\nClint Fiore (43:27.294)\r\nfairly priced bankable and package them up well and market them hard and get them done. And it's not rocket science. It's just the right way to do it. but what I found and the reason I started Deulonomy is a, I wanted to expand nationally and B I felt like the market shifted in the last few years and it really shifted to the buy side. And this is what really dawned on me was\r\n\r\n\r\nI mean, ever since I began in this industry, part of what drew me was like the demographic tailwinds of the baby boomers because you know, I've always heard that like they're the basketball going through the water hose. They've driven every industry from like they made Gerber baby food boom when they were babies. made the Ford Mustang popular when they started driving cars as teenagers because like that was the cool, cool car. then they've now it's like healthcare expenses is huge as this huge aging.\r\n\r\n\r\naffluent population goes through and then you know, they own most of the small businesses and I think about 63 or to 63 to 70 % don't have a successor lined up and so they don't know how they're gonna exit but they all need to exit and so I'm like man, I've got these huge tailwinds we're gonna have this huge wave of Sellers and I'm gonna be there to help these this aging population Sell their businesses and what great demographic tailwinds but what I didn't realize is\r\n\r\n\r\nA, most of their businesses aren't really sellable. So only about 5 % of businesses ever hit a million dollars in revenue. And I don't really touch a business that's doing under a million in revenue, right? And so 95 % of that demographic basketball isn't even the stuff I want to mess with. And so the 5 % that is has been increasing competition lately because the, buy a business\r\n\r\n\r\nNikolas Hulewsky (45:05.473)\r\nCheers.\r\n\r\n\r\nClint Fiore (45:24.614)\r\nteaching has gone mainstream and there's the figures out there like the Cody Sanchez's and Alex Formozzi's and Walker Diablos that have like written the books on it, built the courses on it, built the followings on it. And on top of that, all the business schools of the entire country are now teaching entrepreneurship through acquisition of their MBA programs. And this is catching on like wildfire and people are really drawn to this. And so I almost think like the tsunami that I thought was coming in sellers.\r\n\r\n\r\nis really coming in buyers and that's really dawned on me the last few years. And I mean, I used to get like in 2017, 2018, 2019, I would get maybe 20, 30 NDAs signed. That would be someone that signs a non-disclosure agreement to look at a deal. Each deal I launched. Now we get two or 300, like every two.\r\n\r\n\r\nNikolas Hulewsky (46:18.185)\r\nmy gosh. How do you manage that? Just administratively, that sounds like a nightmare.\r\n\r\n\r\nClint Fiore (46:23.398)\r\nIt's very challenging, especially because we believe in like the buyer relationship and loving on the buyers. Yeah, it really taxed our team. And in fact, like my team was getting mad at me because I was getting so popular on social media that it was like, it was drawing in buyers in large numbers, but it was like, we only have the same number of businesses to sell, but we had 10 times as many buyers.\r\n\r\n\r\nNikolas Hulewsky (46:27.819)\r\nHot, know, white glove. Yeah.\r\n\r\n\r\nNikolas Hulewsky (46:48.299)\r\nYeah.\r\n\r\n\r\nClint Fiore (46:49.348)\r\nAnd we're getting paid only when the deal closes, right? And so it doesn't do me actually any good to have 10 X the amount of buyers than I used to when we can only sell the same amount of businesses. It just gives us more work with the same amount of revenue. And, and so I just, at one point decided this needs to change. Like all these brokerages are all competing for the sellers, but buyers are being drawn in huge numbers and nobody's really solving their big pain points.\r\n\r\n\r\nAnd so what DeLonomy is doing is we've switched our business model on its head entirely. used to be Bison Business was a sell side firm like every other broker. DeLonomy is more of a buy side platform. So we are intermediary. we are the sellers are our clients. We source all the sellers. We vet the deals. We make sure they're the good deals that we would always be selling with Bison Business and others. So we look for the motivated seller.\r\n\r\n\r\nwith clean financials, with strong historical earnings, and that's bankable, all the things you want to see as a buyer. But this time we tell the seller, hey, we will sell your business for free. And we're the only broker doing this. So we flipped our revenue model to the buy side and we're treating the businesses like the inventory and we're treating the buyers like the customer. Ultimately, the buyers are the ones writing the check.\r\n\r\n\r\nNikolas Hulewsky (48:04.438)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (48:12.532)\r\nInteresting.\r\n\r\n\r\nClint Fiore (48:15.392)\r\nAnd we believe that every other broker treats the sellers like the customer and the buyers like nuisances. know, it's just like there's so many of them, they take them for granted. There's a bunch of tire kickers wasting their time. But we want to flip that script and create the most buyer friendly platform there is where we source really good deals. And then we have buyers pay to be members of the platform and pay a small success fee by side for us to facilitate.\r\n\r\n\r\nNikolas Hulewsky (48:24.321)\r\nYeah, yeah, yeah, yeah.\r\n\r\n\r\nClint Fiore (48:44.698)\r\nbring them a good deal and help them get it done. And.\r\n\r\n\r\nNikolas Hulewsky (48:47.649)\r\nWhat do those fees look like?\r\n\r\n\r\nClint Fiore (48:50.352)\r\nThey're smaller than sell side fees. like most sell side brokers are like 10, 11, 12 % on Main Street. We're going to be three to 7 % for our members. So we're bringing the total deal cause down. We're doing deals more efficiently on a high tech platform. And then we have a recurring revenue piece of that where you can actually, you can join for free on dealonomy.com. So it's a freemium model. You can look at our deals, make offers, all that.\r\n\r\n\r\nBut if you upgrade to premium on Dealonomy, you get certain advantages on the platform. The biggest one is a 10 day first mover advantage. So when we launch new deals, the premium members, the paying members, they get to look at it exclusively for the first 10 days. And on day 11, it goes live to the entire network and you get a lot more competition starting on day 11 with us. And then you also get some additional perks of membership with that, including reduced success fees.\r\n\r\n\r\nNikolas Hulewsky (49:30.081)\r\nThey get a first look.\r\n\r\n\r\nClint Fiore (49:48.152)\r\nadditional office hours, times and community stuff and exclusive events and things like that. Those are all happening for premium members. So yeah, we're kind of like a SaaS company in a way, but we're also a white glove service, two sided brokerage where we're being intermediaries. We source the sellers, we matchmake to our buyer network and we facilitate the deal start to finish.\r\n\r\n\r\nNikolas Hulewsky (49:54.593)\r\nSo for you is...\r\n\r\n\r\nNikolas Hulewsky (50:12.266)\r\nTell me about the $10,000.\r\n\r\n\r\nClint Fiore (50:15.75)\r\nYeah, we, this was kind of a Alex Hormozzi inspired thing with the a hundred million dollar offers book. Uh, you know, he taught talks. You should have an offer. So good. It's an absolute no brainer and try to do a guarantee if you can. And so we made our offer for sellers, you know, we'll sell it. We'll value your business upfront. I'll tell you the range that we think it's going to trade in. That's another thing about DeLon me is we don't do asking prices like other brokers. We do a range. So if you come in to sell,\r\n\r\n\r\nI'll say, Hey Nick, I your company is reliably going to be trading in the like two to two and a half million range. And that's just depends on the offers we get in, but it's going to sell somewhere in there. And we'll tell you like the minimum and maximum we expect. And if you're willing to accept offers inside that range, which is a bankable fair market value range that aligns with the comps of your industry,\r\n\r\n\r\nthen we guarantee we'll get you an offer in 90 days or less for your company inside that range. And if we don't deliver, I'll give you $10,000. No harm, no foul. so we're not only selling your business for free, we're guaranteeing a buyer match, a serious offer in the value range we present with a $10,000 guarantee backing it up in 90 days or less.\r\n\r\n\r\nNikolas Hulewsky (51:42.175)\r\nAnd you just launched, right?\r\n\r\n\r\nClint Fiore (51:46.822)\r\nCorrect. Yeah. So we raised money. We raised $3 million last year and, from some of the top people in this space. And that's, I've been very blessed with the Vester team and advisor team that we have behind us. People like Walker Dybul, are on the cap table. and some other really well-known folks like the the SMB law group guys are on our, on our cap table advisory board. so some of the top thinkers and, and,\r\n\r\n\r\ndeal makers in this space are backing us. But we raised money last year. We started building the site almost a year ago. So we've been in stealth mode until May 12th of this year, 2025 is when we had our official launch party. And that's where we went live and started broker and deals on the site. we're, as of this recording, we're about a month old and we already have over a hundred million dollars of enterprise value on the platform.\r\n\r\n\r\nSo that's a, that's from about 20. Yeah. So it's, just crossed that last week. It was a big milestone. Um, so in our first, yeah. So in our first month of business, we're up to 25, 26 deals. We're averaging three or 4 million, a deal size or wise on the platform, but we have like the smallest deal right now is about 700 K and the largest would be probably about a $30 million deal, but most are in that one to 10 million range. Um, but we're scaling at a pace that I'm expecting to be.\r\n\r\n\r\nNikolas Hulewsky (52:53.409)\r\nCongratulations, man, that's freaking amazing.\r\n\r\n\r\nNikolas Hulewsky (53:14.401)\r\nI'm assuming none have closed yet.\r\n\r\n\r\nClint Fiore (53:16.166)\r\nprobably a hundred deals on the market. Say again.\r\n\r\n\r\nNikolas Hulewsky (53:21.813)\r\nI'm assuming nobody's closed yet.\r\n\r\n\r\nClint Fiore (53:23.14)\r\nI didn't, sorry, you broke up. Well, we closed a couple that were already in progress with Bison. So we merged in Bison business. And so that gave us kind of a running start. And so we've already closed a couple deals in, but the ones that launched in May, we already have a couple under LLY. and there we're meeting our, we haven't had to pay her $10,000 guarantee yet. Like we're getting offers in. and so that's.\r\n\r\n\r\nNikolas Hulewsky (53:49.185)\r\nGood.\r\n\r\n\r\nClint Fiore (53:51.344)\r\nThat was a nerve wracking thing, but so far so good on that knock on wood. the buyers are stepping up and they are liking the deals and they're making offers. And so, you know, essentially what we've made is, I like to use the metaphor for buyers of, know, I know buying a business feels like you're looking for a needle in a haystack and that's the whole, the whole process is so it sucks because all day long you're just filtering through, Hey, stuff you don't want.\r\n\r\n\r\nNikolas Hulewsky (54:07.179)\r\nYou\r\n\r\n\r\nClint Fiore (54:19.674)\r\nThat's just junk that's in the way and you're looking for your precious needle. That's going to be the thing that's that's going to change your family forever. That's the business you want to buy. And what if there was a needle store? You could just walk in that had normal business hours and you could buy a needle and you didn't have to go look in hay barns. Like that's what we're trying to make. And so that's the metaphor I've been going with. And yes, you have to pay a small fee as a buyer, but what is your time worth?\r\n\r\n\r\nNikolas Hulewsky (54:33.345)\r\nWhat if...\r\n\r\n\r\nNikolas Hulewsky (54:39.903)\r\nYeah, yeah.\r\n\r\n\r\nClint Fiore (54:48.198)\r\nYou know, most people are taking a year to two years to find and close a deal. But if there was just a platform where all the deals were good, they were realistically valued, there were banks ready to lend on them. They were, they had complete information in the deal rooms. could electronically sign NDAs. You could go make an offer. You could get it accepted right on the platform. Bang, bang, bang. Just go through this process really quickly and frictionless. That's worth it. Like that's worth paying a few bucks.\r\n\r\n\r\nNikolas Hulewsky (55:15.745)\r\nWhat is, for the buyers, what is the fee?\r\n\r\n\r\nClint Fiore (55:20.55)\r\n3 to 7 percent like I said, that's going to be\r\n\r\n\r\nNikolas Hulewsky (55:22.433)\r\nWell, I know that's the fee, you said there's, if you want the first look as well.\r\n\r\n\r\nClint Fiore (55:26.762)\r\nthat's 99 a month or you get 20 % off if you do annual. So, but it's very affordable membership.\r\n\r\n\r\nNikolas Hulewsky (55:28.405)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (55:33.537)\r\nThat's way lower than I would have. Do you have any idea of what you expect your churn to be? Like how long you think people will be members?\r\n\r\n\r\nClint Fiore (55:40.23)\r\nWe're expecting, we're modeling it out that we expect people to be on for like 10 to 12 months on average, but there's going to be certain folks that are just repeat, you know, serial acquirers that we think are going to be lifers with us buying lots of businesses over the years. But, know, the average person, I think. And in a year of membership, they'll probably be able to get a deal done. And, um, and then you can become a free member until you're actively, you know,\r\n\r\n\r\nsearching again and you want that 10 day first mover advantage and the discounted fees and stuff. And you can fire up that membership whenever you're active.\r\n\r\n\r\nNikolas Hulewsky (56:11.769)\r\nI know it's different, but John Matzner and then have a friend named Parker Cox, he has Pivago, they've kind of launched these overseas talent companies that have a Costco-like business model. And I'm not saying yours is exactly the same, but it's similar from the perspective of like, hey, look, in aggregate, we're gonna charge you a lot less, but there is gonna be the subscription.\r\n\r\n\r\nClint Fiore (56:15.718)\r\nMm-hmm.\r\n\r\n\r\nClint Fiore (56:24.57)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (56:38.305)\r\nlike you gotta pay a membership fee so that we can screen you up front and like we can keep the lights on as we go. That is definitely just becoming more and more popular. People are willing to pay a little bit more up front.\r\n\r\n\r\nClint Fiore (56:49.486)\r\nIt is. Yeah, I view it as, Costco is a good example. You know, it's like you're, you're paying your membership to get certain advantages. And I view the membership program is like, that's not really where we're going to make our profit, but that's what's going to make us be able to basically crowd fund the world's best business search program. So we're going to be hitting up sellers all over the country with this irresistible pitch.\r\n\r\n\r\nyou know, the only place you can sell your business for free with a guaranteed result in 90 days or less. That's a killer pitch. And we need to get that in front of lots and lots of people. And the members that are going to get first access to those deals are helping with their membership. They're helping fund those marketing efforts to get that message in front of thousands of sellers and get first dibs on those deals that we drum up for them. And then we'll do the quality control. So we'll find them. We'll vet them. We'll, do the quality control.\r\n\r\n\r\nAnd, like you're helping fund that effort when you're a member and you get exclusive first dibs on them, you know, when you're a member. it's kind of a, just a neat way to almost crowdsource that, that national seller, uh, search effort.\r\n\r\n\r\nNikolas Hulewsky (58:01.345)\r\nHow are you doing the seller search effort? Because it seems like with your audience on Twitter, you're not really going to have a problem getting buyers in the door, which has its positives and negatives. The positives is, cool, we've got a big buyer pool and potentially the price per deal is actually higher than normal just because you have more buyers than you do sellers. I'm not saying that's the case. I'm just saying that that could be something. But the other side of it is you just don't have enough deals necessarily for all the buyers.\r\n\r\n\r\nSo you need to go out and actually get more sellers to come on the platform. What's your plan for getting more sellers onto the platform?\r\n\r\n\r\nClint Fiore (58:36.42)\r\nYeah, we have a, we have a multi-pronged attack going on that. So, you know, I'm, I'm big on content marketing, which generates inbound. So we've, we've always gotten inbound. and I've got, whole new efforts going, like I'm, I'm going to start going big into video, which I've never done before. I've, I've, I've been pretty big on social media from just writing and pictures and storytelling and teaching. but we've got two podcasts going right now and\r\n\r\n\r\nNikolas Hulewsky (58:43.873)\r\nMm-hmm.\r\n\r\n\r\nClint Fiore (59:02.214)\r\nWe're going to have daily videos and long form videos is teaching about these topics and magnetizing people bring them in the door. But on the outbound, like, like we have some major efforts going on. the, the lowest hanging fruit is what we call the COI effort, which is ours, uh, centers of influence marketing, which is really, trying to hit up all the CPAs, the wealth managers, the exit planners, um,\r\n\r\n\r\nNikolas Hulewsky (59:09.087)\r\nAnd as you, sorry, go ahead.\r\n\r\n\r\nClint Fiore (59:28.526)\r\nyou know, insurance agents, commercial real estate agents, anyone that's in contact with business owners regularly and let them know about our business model because we're such a no brainer referral for them. It's such a low risk referral because they could refer sellers to us. We never asked them for any money. We value their company upfront for free and we guarantee that we're going to get them the result that we promise. And so it's a super friendly referral and we will pay for that referral. And so we have like a paid\r\n\r\n\r\nkind of bounty we will pay for sellers referred to us from these industry professionals. And so we're building a huge network of people that have hundreds of business owners as clients to become their go-to referral and those that are allowed to accept referral fees, we will pay them for those leads. And so if you're listening and you have contact with a bunch of business owners and you want to send us sellers, we'll pay you. Like we can pay you upfront money or we can pay even more if you wait till closing, we'll, cut you in on the deal.\r\n\r\n\r\nwhere that's as long as it's legal to do so in your state or, and you're able to do that with your profession. We'd be happy to paper that up and stake you in the deal. we're doing that, but then we're also doing like full on, outbound stuff like email marketing, pay per click, SEO efforts, everything under the sun. We're running experience right now to get this, pitch in front of more and more sellers.\r\n\r\n\r\nNikolas Hulewsky (01:00:28.472)\r\nthat's rad.\r\n\r\n\r\nNikolas Hulewsky (01:00:38.059)\r\nThat's awesome.\r\n\r\n\r\nNikolas Hulewsky (01:00:55.073)\r\nSo I can't believe we've gone through an hour because I still feel like I have a million questions to ask you. But on a closing note, my question to you would be, what advice do you have for searchers? If you could give one piece of advice to somebody searching for a business, they could have experience, they could not have experience, it doesn't matter. From what you've seen, what are the biggest deal killers and how can they\r\n\r\n\r\nsort of mitigate against those as they go into the deal process.\r\n\r\n\r\nClint Fiore (01:01:27.206)\r\nI it's almost the wrong question. It's like, at some point, you got a cowboy up is my advice. I think what the perpetual searchers that never close a deal, the big mistake they make is they're too focused on the deal. It's like, they'll lose a deal over, though someone will bid 50,000 more on the deal and they're like, nope, that's the most I'm going to pay.\r\n\r\n\r\nNikolas Hulewsky (01:01:30.143)\r\nokay.\r\n\r\n\r\nNikolas Hulewsky (01:01:34.537)\r\nHahaha\r\n\r\n\r\nClint Fiore (01:01:57.066)\r\nnot with that 30 % customer concentration, I'm out, you know, and, they're, they're, they can't accept some hair on the deal. They can't, what you'll find is that it's almost impossible to find a perfect deal. And so when I say a deal on me is going to be good deals only, they're not going to be perfect. None of them are perfect. I'm just saying we're going to have realistically priced deals with motivated sellers and cleanish financials that are bankable, but it doesn't mean they're perfect.\r\n\r\n\r\nYou're not going to have every checkbox checked. And so at some point, cowboy, like if you're going to play this game, you got a cowboy up and say, I'm going to accept a little bit of hair and I'm going to bet on myself. And you're going to ask you get to ask yourself, what am I buying here? And can I win with this? Can I win with this? The guy in the mirror, the gal in the mirror, because ultimately those historical financials you're obsessing over and nitpicking with your quality of earnings and all this, like those are past, like those are\r\n\r\n\r\nThose are in the rear view mirror the day you close and moving forward, it's all on you. Every, every better result, you got to own it. Jocko willing style, extreme ownership and like, and so you've got to at some point say, this is good enough. This is close enough for hand grenades. I think I can bet on myself. I think I can win with this deal. And if you don't have that like fire and, and, tolerance to like bet on yourself,\r\n\r\n\r\nand something that's like 80, 90 % of what you wanted, but not a hundred percent of what you wanted, then you're going to be searching forever and you're never going to close a deal. And so get good enough and giddy up cowboy. Like that's, that's my advice.\r\n\r\n\r\nNikolas Hulewsky (01:03:36.213)\r\nDude, I think that's amazing advice, man. My brother-in-law and I did a deal five years ago. And when we were selling the business later, he told me, he's like, I would have never done this deal just because he felt like there was a lot of hair on it. It worked out very well for us. But he was just saying how grateful he was to have a partnership. And it goes both ways. Sometimes one partner is more willing than the other partner. But yeah, there does come a point where it's like,\r\n\r\n\r\nCrap or get off the pot, man. Like you gotta make a decision on this stuff. You're never going to find the perfect deal. I think that's fantastic advice. I love it. All right, well, Dilanomy, if they wanna come find you, can come find you on Twitter, clmpfiori.\r\n\r\n\r\nClint Fiore (01:04:19.428)\r\nYeah, really on all the, all the social platforms, it's just my name Clint C L I N T Fiori F I O R E and, feel free to reach out, DME, whatever. we'll try to say hi to you if I can. And, emails Clint Clint at deal on me.com. If you want to email me and our website's still on me.com.\r\n\r\n\r\nNikolas Hulewsky (01:04:40.127)\r\nAwesome Clint, fantastic, thank you man.\r\n\r\n\r\nClint Fiore (01:04:42.842)\r\nThanks so much for having me.",
  "metadata": {
    "duration": "",
    "date": "2025-07-07",
    "platform_source": "Google Drive"
  }
}