{
  "episode_number": "148",
  "episode_title": "AI SERIES: 4 - How Fear and Regulation Impact AI in Finance with David Kaylor",
  "guest_name": "David Kaylor",
  "business_name": "Alchemy Technology",
  "transcript": "﻿Nikolas Hulewsky (00:00.841)\r\nI hope. All right, David, super stoked to have you. I'm really excited to learn about some of the AI stuff that you're working on, where you are. Really quickly, will you give the people a brief background, who you are, where you work, what your role is?\r\n\r\n\r\nDavid (00:16.482)\r\nYeah, for sure. So David Kaler, work at Alchemy Technology. We do banking services, digital banking services for credit unions, banks, across a variety of use cases, from like the app you log into, to digital account opening, to loan origination, all sorts of stuff.\r\n\r\n\r\nMy specific role is really around implementations of those platforms and services, essentially plugging our wires into banks' making sure all of that works. Lots of fun. Yeah.\r\n\r\n\r\nNikolas Hulewsky (00:52.651)\r\nYeah, you were saying that most credit unions or regional banks probably haven't built their own platform. They're using you or one of four of your competitors. Is that right? I wonder, what's it been like over the last, let's say three years, two years. Two years ago is when OpenAI had their moment. I was like, wow, chat GPT, I can ask it questions, my gosh. And like over that period of time, they've been...\r\n\r\n\r\nDavid (01:02.272)\r\nMm-hmm. Yeah.\r\n\r\n\r\nDavid (01:08.334)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (01:20.267)\r\ncompanies have sort of shifted. All of sudden you're seeing roles like, he leads our AI implementation team and et cetera. What's it been like working at a tech company that's servicing these fairly old legacy businesses? Is there a lot of talk around AI? Is it still nascent? How do you view it?\r\n\r\n\r\nDavid (01:40.002)\r\nI would say there's a lot of talk. We have like a, yeah, yeah, yeah. I would say the doing is a little, not a fast follower, it's a slow follower. We're getting there. Honestly, I think we're doing okay internally. But I would say the industry as a whole, there's a lot of excitement and we have a data product that does use some AI models.\r\n\r\n\r\nNikolas Hulewsky (01:42.847)\r\nOkay, but not a lot of doing.\r\n\r\n\r\nNikolas Hulewsky (01:50.219)\r\nMm-hmm.\r\n\r\n\r\nDavid (02:04.13)\r\nthat we'd send out to our clients and stuff. And that's really well done. But I would say as a whole in the industry, I would say there's more excitement than actual productivity. Where we do have some productivity, yeah, go ahead.\r\n\r\n\r\nNikolas Hulewsky (02:17.975)\r\nDo you think that's because of the regulatory environment within banking?\r\n\r\n\r\nDavid (02:25.806)\r\nThere's a lot of fear, yeah. There's a lot of fear and apprehension. I would say in the banking sector, if you don't know if you're allowed to do something, people just assume you're not allowed to do it, which I would say is very different than most of the business world. If it's not, in the business world, if it's not explicitly denied, then you assume you can go forward. And I would say in the banking regulatory environment, it's quite the opposite. Yeah.\r\n\r\n\r\nNikolas Hulewsky (02:50.593)\r\nhealthcare is very similar, right? It's like, hey, we don't move fast and break things in healthcare. We take our time. Same with banking, right? So tell me how you are currently using AI, both personally and within the organization.\r\n\r\n\r\nDavid (03:08.398)\r\nSure, so I've tinkered with a bunch of different things. I like trying the different models for different things. I would say my best personal use case has been Replet, the AI engine agent model where it actually does all the hosting for you, which is brilliant. I'm somewhat technical in my background, but I'm by no means a developer or a server engineer to spin all that stuff up. So it actually spins up the servers, the database,\r\n\r\n\r\nit hosts it all, know, serverless, native in the background, whatever. Basically, you don't have to know any of that or think about it. And so I built a little mini game on Replet that is essentially like, it's a click-based monster destroyer. I can bring that up if we want to look at that. It's kind of fun. It's a time waster. You know, it goes on for forever. Absolutely. Yep.\r\n\r\n\r\nNikolas Hulewsky (03:58.549)\r\nYeah, I'd love to see it. This is more of a like entertainment, personal use, right? Okay. While you're pulling that up, I like to ask people this question. What, let me find it so can ask it appropriately.\r\n\r\n\r\nNikolas Hulewsky (04:16.865)\r\nOkay, what models are you using and what are you using them for currently?\r\n\r\n\r\nDavid (04:22.862)\r\nGood question. I really like...\r\n\r\n\r\nGemini, the Google one, which I know gets a lot of hate.\r\n\r\n\r\nBut it's good at one specific thing, and that's knowing its own ecosystem. So I write some Google Apps Script. And who does Google Apps Script better than Google? And so Gemini is pretty good at that. I had a crappy little Python script that I was running manually every day in the morning on my laptop that would connect to some Jira APIs and send an email. And I popped it into Gemini and I said, hey, I want you to take this Python script.\r\n\r\n\r\nNikolas Hulewsky (04:39.479)\r\nyou\r\n\r\n\r\nDavid (05:04.234)\r\nand output me a Google Apps Script that can then be scheduled and automated. And it did it. First try, no errors, it just worked. I was blown away.\r\n\r\n\r\nNikolas Hulewsky (05:14.379)\r\nThat's awesome. That's funny. I haven't heard people talk about Gemini, but that makes sense from that specific use case, right? It does its ecosystem really well.\r\n\r\n\r\nDavid (05:24.694)\r\nRight. Outside of that, I don't use Gemini.\r\n\r\n\r\nNikolas Hulewsky (05:27.647)\r\nOkay, so what are the other ones you're using for what?\r\n\r\n\r\nDavid (05:30.094)\r\nI think Grok is really good at basic scripting. Python or Apps Script sometime, I'll pop over there. I use ChadGBT a lot for general stuff. I would say it's kind of slow. The output, it takes a long time to think and then write a response.\r\n\r\n\r\nNikolas Hulewsky (05:42.23)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (05:49.559)\r\nEspecially after using grok man grok is so fast. It's at least comparative to chat GPT Okay, so chat GPT grok Gemini do you use anything else on a regular basis?\r\n\r\n\r\nDavid (05:51.926)\r\nMm-hmm.\r\n\r\n\r\nDavid (05:56.47)\r\nMm-hmm. Yeah.\r\n\r\n\r\nDavid (06:05.902)\r\nNo, I guess whatever's built into Replet, which I think is Clawed 3-7 at the moment.\r\n\r\n\r\nNikolas Hulewsky (06:13.193)\r\nOkay. Yeah, that's interesting because a lot of people use chat tpt as like a thought partner is just general. Hey, how does this work? And then they'll go to other things for specific use cases. I Claude the anthropic model sonnet 3.7. I've heard a lot of people using for coding, which I mean, you're using it for replicates. You're effectively using it for coding. Grok I've heard for real time data and for some\r\n\r\n\r\nnot analysis, but the deep research function supposedly is really good. I haven't used it for deeper search. use chachi.pt for deep research. So anyways, it's just interesting to hear the specific use cases that people use for each one of them.\r\n\r\n\r\nDavid (06:54.264)\r\nI'll bounce around to most of my deep AI work is scripting. And so when I run into an error and you tell it the error and it just repeats the same answer over and over and it's like, okay, you're not getting the error. Then I'll switch models, paste the same code in, same error, and it'll approach it from a different angle and then usually get past the bug or the error or whatever it was struggling with.\r\n\r\n\r\nNikolas Hulewsky (07:06.688)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (07:12.229)\r\nNikolas Hulewsky (07:16.437)\r\nOkay, so you're, and it sounds like you're mainly using it for coding, like creating the automations, creating the workflows to help you.\r\n\r\n\r\nDavid (07:24.546)\r\nYeah, correct. I don't actually have any automations using AI where I'm like pinging out to an AI to do something. It's the AI is helping me automate basic tasks in my work life.\r\n\r\n\r\nNikolas Hulewsky (07:32.727)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (07:38.551)\r\nCool. All right, let me see the game. I want to see the game he created.\r\n\r\n\r\nDavid (07:42.158)\r\nYeah, so this was, I mean it's not fancy, but it only took like 20 minutes, so. I don't know if you ever played the paperclip game back in the day, but you could like build a paperclip factory, and then like took over the world.\r\n\r\n\r\nNikolas Hulewsky (07:56.117)\r\nYeah, Explain it.\r\n\r\n\r\nDavid (07:59.894)\r\nSo you would essentially click. It's a clicker game. And I'll start iterating through this. And you can see as I click, the monster health goes down and then it dies. And then we have a new monster. And you'll notice I have gold and a score and it starts to go up. And so this is the same premise as the paperclip game that was popular. man, what was that? Like early 2010s probably and built with a UI of like the 1990s. But man, I spent days, I hadn't\r\n\r\n\r\nrunning on a server in my last job so I could let the paperclip factory run overnight so I could accumulate all these resources and take over the universe with paperclips. So anyways, that was the inspiration here and I like, wonder how hard it would be to recreate a spin-off of that.\r\n\r\n\r\nAnd so I have a, I added a little storyline. It's not great, but I didn't write it, AI wrote it. I'm like, hey, give me like a thousand part storyline broken into sentences in this like JSON format. And it did. So we have a storyline.\r\n\r\n\r\nNikolas Hulewsky (09:05.623)\r\nThat's awesome.\r\n\r\n\r\nDavid (09:06.094)\r\nSo I have gold, I can upgrade my click so it like kills the monster faster now, it's stronger. I can do passive income, so now if I don't do anything, I just get two gold per second. Just by sitting here, I'll upgrade the passive again.\r\n\r\n\r\nNikolas Hulewsky (09:24.341)\r\nOkay, so what did you create this on?\r\n\r\n\r\nDavid (09:28.332)\r\nReplet. This is hosted on, built and hosted by Replet, and it took me like 30 minutes to put together.\r\n\r\n\r\nNikolas Hulewsky (09:29.815)\r\nOkay, and when you...\r\n\r\n\r\nNikolas Hulewsky (09:36.193)\r\nCan you pull up the Replet, I don't know, project that created this? Was it all natural language that you used to create this or were you actually coding?\r\n\r\n\r\nDavid (09:45.57)\r\nYeah, no, I'm not a programmer by trade at all.\r\n\r\n\r\nLet me see if I can get it in the mic.\r\n\r\n\r\nNikolas Hulewsky (09:53.313)\r\nSo you went to Replet and you said, hey, Replet, I want you to make this game that does X, Z things and then you just iterated essentially to this.\r\n\r\n\r\nDavid (10:03.446)\r\nCorrect. Yeah, let me see if I can get into my Replet account.\r\n\r\n\r\nI think that's the wrong Gmail.\r\n\r\n\r\nNikolas Hulewsky (10:13.559)\r\nYeah, no worries. No worries if you can't. I was just curious if you had like the ability to show, hey, this is what a first prompt and et cetera. Okay. No worries. worries. Okay. So this is the game function, which is awesome. And I'm sure you use this just to, for entertainment. What are some of the other functions that you're using AI for at the moment?\r\n\r\n\r\nDavid (10:18.381)\r\nYeah.\r\n\r\n\r\nIt's on a different laptop, sorry.\r\n\r\n\r\nDavid (10:33.006)\r\nYep.\r\n\r\n\r\nDavid (10:38.062)\r\nSo the actual useful use case is basic scripting. So there's a lot of things in life that we forget about, right? Just tasks that need to be done, accountability items. One example I can talk you through is like time tracking for my team. It's always a big thing.\r\n\r\n\r\nNikolas Hulewsky (10:41.847)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (11:01.303)\r\nYou\r\n\r\n\r\nDavid (11:02.104)\r\nfor various reasons. But everyone hates time tracking. No one's very good at remembering, doing it, real time. And so I had built a little Python script that would do it. We talked about that earlier. What it does now, it's this Google Apps script that I had Gemini rewrite from the Python into.\r\n\r\n\r\nAnd it essentially makes an API call out to Jira and it says, hey, what tickets did so-and-so comment on today? Or yesterday, actually.\r\n\r\n\r\nAnd then it gets that list and then it says hey what what gyr tickets did they log time to and then it does a diff against those two lists So we commented on ABC, but we only logged time to a and B And so the remainder is C was a ticket that had work done, but no time logged to it And so then it sends an email to that person and says hey you did work on this ticket But you forgot to like track your time to it\r\n\r\n\r\nNikolas Hulewsky (12:02.711)\r\nDo you, do you have the flow I can look at for this or no?\r\n\r\n\r\nDavid (12:07.171)\r\nI don't have a flow.\r\n\r\n\r\nNikolas Hulewsky (12:09.783)\r\nCause so what I'm trying to understand Jira is a project management software. That's essentially, it sounds like that's where your team is logging their time just because they're associating their time with tickets within Jira. Okay. So what you're saying is it will go in and take one time point and subtract it from another and be able to match what they self-reported versus what they actually recorded in the system.\r\n\r\n\r\nDavid (12:15.958)\r\nYeah, essentially.\r\n\r\n\r\nDavid (12:22.604)\r\nMm-hmm. Yep.\r\n\r\n\r\nDavid (12:39.118)\r\nCorrect, yep. Or it'll look at where they like logged a comment, so they like responded to a client or just dropped an internal note. So they took some action on this particular project but didn't associate any time to that project. And so it finds that discrepancy and then emails them about it.\r\n\r\n\r\nNikolas Hulewsky (12:44.695)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (12:55.575)\r\nAnd.\r\n\r\n\r\nAll right, and what is actually doing it? it a prompt that you like, how does it get initiated?\r\n\r\n\r\nDavid (13:03.608)\r\nGood question. So that's not the AI. The AI helped me write the Google Apps Script that actually does the work. So it's a Google Apps Script that runs on a scheduler every morning. And so it's just executing Apps Script code, calls the API, gets the list, gets the other list, does the logic, sends the email. And so that's the function I wanted to work.\r\n\r\n\r\nNikolas Hulewsky (13:12.446)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (13:19.895)\r\nMm.\r\n\r\n\r\nDavid (13:30.016)\r\nI knew it was possible. If you can logically think through it, anything is essentially possible with code. I didn't know how to write it. I'm not really a programmer. so I just typed a prompt into... Originally, ChatGBT wrote it in Python. And I manually ran it for probably a year. Every morning I would click a button just to execute it. And I got tired of clicking the button. And so I popped it into Gemini and I said, hey, rewrite this Python script in\r\n\r\n\r\nNikolas Hulewsky (13:51.745)\r\nMm-hmm.\r\n\r\n\r\nDavid (13:59.872)\r\nGoogle Apps Script because Google Apps Script has a scheduler. And that was the key that I no longer have to click a button, runs on some server that Google has. If I'm on PTO, it's still going to run, that whole thing.\r\n\r\n\r\nNikolas Hulewsky (14:13.687)\r\nOkay, when you're saying Google Apps Script, I don't know what that is. So is there a platform that you can write these, I guess, function? I don't know what the right word is on Google.\r\n\r\n\r\nDavid (14:27.264)\r\nYeah, so they're attached to four folks that have the Google Cloud Work Suite. I think it's built into the personal Google too, probably. If you've ever used Google Docs. Google Docs are Google Sheets. I usually attach mine to Google Sheet.\r\n\r\n\r\nNikolas Hulewsky (14:36.503)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (14:40.203)\r\nSo where would I go on that?\r\n\r\n\r\nNikolas Hulewsky (14:47.839)\r\nOkay, so I would just open a new Google Sheet and I could do this? Shut up. Don't lie to me. Okay, hold on.\r\n\r\n\r\nDavid (14:50.09)\r\nMm-hmm. Yeah, absolutely. It's like totally free. Any Google Sheet, and then you go to Extensions.\r\n\r\n\r\nNikolas Hulewsky (15:02.529)\r\nOkay, Google Sheet, extensions.\r\n\r\n\r\nDavid (15:05.612)\r\nand then App Script.\r\n\r\n\r\nNikolas Hulewsky (15:09.143)\r\nI see app, yeah, Apps Script.\r\n\r\n\r\nDavid (15:13.558)\r\nAnd then it brings up, it's basically JavaScript.\r\n\r\n\r\nNikolas Hulewsky (15:16.673)\r\nHoly balls. so this is how I would get it automatically populating into the sheet so that I can see the data.\r\n\r\n\r\nDavid (15:26.222)\r\nYeah, I mean sometimes like this one I don't even put through a sheet it just does all the logic in memory\r\n\r\n\r\nBut there are use cases, so I have a different use case where I just want like a daily dump of all the Jira tickets that match a certain filter. And so every day it increments to this list that's sitting in a Google Sheet and it just adds whatever the diff was from the last time it ran to the end of the list. You can do all sorts of stuff. You can do logic, you can manipulate the sheet, you can build a... If you want to like take the data in a Google Sheet and like build a Google slide deck out of it, you can do that.\r\n\r\n\r\nreally the sky's the limit as far as it goes between Google integrations. But it's also not limited to just the Google ecosystem. I'm making an API call out to Jira from Apps Script.\r\n\r\n\r\nNikolas Hulewsky (16:19.509)\r\nHmm. So when do you?\r\n\r\n\r\nSo Apps Script isn't necessarily populating in your Google Sheet. That's just where you go to get into the Apps Script.\r\n\r\n\r\nDavid (16:27.47)\r\nYeah, it just like is hosting it. I have like a dummy shell of a Google Sheet that's just like it exists and then I have like all these scripts that have schedulers attached to them.\r\n\r\n\r\nNikolas Hulewsky (16:33.281)\r\nThat is so weird.\r\n\r\n\r\nNikolas Hulewsky (16:40.777)\r\nso it's almost like your database of Apps Scripts.\r\n\r\n\r\nDavid (16:45.41)\r\nYep. And I'm sure there's a better way to do it, but this is simple and easy.\r\n\r\n\r\nNikolas Hulewsky (16:47.243)\r\nDude, that-\r\n\r\n\r\nNikolas Hulewsky (16:52.715)\r\nGosh. There's no, I guess, AI, there's no context happening when you're running these, right? It's not like, hey, look at this and make a determination whether or not XYZ happened. It's literally if then statements being executed. Okay.\r\n\r\n\r\nDavid (17:10.156)\r\nYeah, basically, yeah, it's pretty simple stuff. I wouldn't be surprised if Apps Script has a Gemini hook where you could ping out to Gemini and say, do some logic or something on this. I'm not doing any of that, but I wouldn't be surprised if it's possible.\r\n\r\n\r\nNikolas Hulewsky (17:29.057)\r\nTheoretically, I could use this to say, okay, Shopify, tell me how many abandoned carts. I guess I could probably have an automated Shopify message to me. I'm trying to think of what use case I might use this for. Could I use this for my sales team? Could I use this for...\r\n\r\n\r\nDavid (17:50.83)\r\nYou could use it for like...\r\n\r\n\r\nLet's say you have a report, let's say in Salesforce, that you want to run on a daily basis that calls out certain accounts that are maybe in a red status or trending red based on certain factors. And you want to email your sales reps that are attached to those accounts, but you don't want to email everyone. You only want to email the ones that are trending red based on like, you know, four factors that may or may not show up in the report. Well, the script can like,\r\n\r\n\r\nNikolas Hulewsky (18:18.462)\r\nDavid (18:24.368)\r\nloop through that logic and then send the email or not send the email. It's like, hey, go do your job.\r\n\r\n\r\nNikolas Hulewsky (18:29.803)\r\nDang. Dude, this was awesome. I had no idea about, I'm such a noob, about app scripts. I can't wait to start playing around with this stuff. Anything else you want to show? Anything else that you're working on right now?\r\n\r\n\r\nDavid (18:44.728)\r\nThat's the main, it's like I do a lot of the same thing over and over again. So it's like that kind of pattern just across a variety of different use cases, but that's the bulk of it.\r\n\r\n\r\nNikolas Hulewsky (18:50.199)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (18:54.327)\r\nAnd that might be a good framework for thinking of how to bring AI in is like, if there's something that you're doing repetitively over and over and over, it's probably a way for you to automate it.\r\n\r\n\r\nDavid (19:03.992)\r\ndefinitely.\r\n\r\n\r\nNikolas Hulewsky (19:05.237)\r\nAnd it's not that you're automating it with AI making decisions. It's that you're figuring out how to do the coding that automates it. Yeah, dude, I love that.\r\n\r\n\r\nDavid (19:10.018)\r\nMm-mm.\r\n\r\n\r\nYep. Right. It's like empowering you to be better at basic task automation.\r\n\r\n\r\nNikolas Hulewsky (19:19.051)\r\nThat's fantastic. Armin, this was fantastic. Thank you.\r\n\r\n\r\nDavid (19:21.986)\r\nYeah, absolutely.\r\n\r\n\r\nNikolas Hulewsky (19:23.479)\r\nAll right, I'm gonna stop recording and stay on for a second, because we've got to upload.",
  "metadata": {
    "duration": "",
    "date": "2025-04-10",
    "platform_source": "Google Drive"
  }
}