{
  "episode_number": "93",
  "episode_title": "Don‚Äôt Miss the $16 Billion Genealogy Boom: Use AI Tools with Chris Koerner",
  "guest_name": "Chris Koerner",
  "business_name": "Home Health and Hospice Companies",
  "transcript": "﻿Chris Koerner (00:01.014)\r\nAll right, what are my options?\r\n\r\n\r\nNikolas Hulewsky (00:02.547)\r\nAlright, here are your options. Silver Tsunami or a phone reminder.\r\n\r\n\r\nChris Koerner (00:10.254)\r\ndifferent silver tsunami from a couple weeks ago.\r\n\r\n\r\nNikolas Hulewsky (00:12.937)\r\nIt's my favorite silver tsunami I've ever thought of. I told you, I'm gonna try to have a silver tsunami every week.\r\n\r\n\r\nChris Koerner (00:18.434)\r\nokay. Well, we gotta go with that.\r\n\r\n\r\nNikolas Hulewsky (00:20.457)\r\nAll right. So my background's in healthcare and I own home health and hospice companies. I love those services, but they're so hard. You're on 24 seven and in hospice it's death and dying. Somebody has a bad experience. I can't refund that. I can't give you 5 % coupon off your next experience, right? Cause you died. like it's it's anyways, it's very high stakes, but I love the silver tsunami space. So let me give you some data. And my goal is to talk about a silver tsunami idea every week.\r\n\r\n\r\nThat's kind of my goal. The over 65 age is going to double by 2050 from 52 million today to 95 million. So within under 30 years, about 25 years, we're gonna add another 40 million people to over 65, all right? Alzheimer's and dementia.\r\n\r\n\r\nChris Koerner (01:10.958)\r\nfor Sears.\r\n\r\n\r\nNikolas Hulewsky (01:17.917)\r\nThat was weird. Sorry, the microphone was like buzzing. Alzheimer's and dementia, you know what that is. Those are the diseases where people like lose memory. They don't recognize you anymore. Those are expected to double from six million people to 13 million over over double by 2050. OK. Today, there's 52 dependence for every 100 working individuals. By 2050, there's going to be 77 dependence for every 100 working individuals.\r\n\r\n\r\nChris Koerner (01:37.037)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:47.217)\r\nAlright, so the silver tsunami is real. People are aging. People are getting older. I highlighted the Alzheimer's and dementia because people are forgetting more and more. And it brings me to the thing that I am very, very interested in genealogical services. Now I get it anybody who's LDS and listen to that's like, of course they bring up genealogy, genealogy, I am doing it.\r\n\r\n\r\nChris Koerner (02:09.046)\r\nHey, Brody Christensen, calm down, okay? Keep listening.\r\n\r\n\r\nNikolas Hulewsky (02:12.521)\r\nBut for those who don't know what genealogical services are, those are services that help you map your family history. Not only who your parents were, but who your grandparents and great grandparents and great great grandparents. Because if I were to ask anybody listening this question, hey, where was your grandpa born? They probably have to think about it, but they could probably figure it out. I think my grandpa was born in Massachusetts, right? Now, if I asked them, where's that written down? 99.9 % of them would say nowhere.\r\n\r\n\r\nIt's all just oral, right? It's just passed down from generation to generation. yep, this is when Grandma Smith came over on the Mayflower. That was a really stupid example. genealogical services, so people actually taking family history, digitizing it, is expected to grow from about $5 billion a year this year to $16 billion by 2023, or 2033. So in the next eight years.\r\n\r\n\r\nit's going to more than double. And for anybody listening, genealogical services will be like familyhistory.org or familytree23andme, right, telling you your DNA, et cetera. So tons of opportunity here. Here's what I think the product is. I think that capturing stories is an incredible opportunity right now. You have the older generations, like they always do, pass away. They have stories.\r\n\r\n\r\neverybody has these stories, the ones that grandpa always tells about growing up in Southern Florida and how he got, you my dad tells this story. He grew up in Brazil. And when he was five years old, he got captured by the Indians and they were about to cook him. He was in a pot. They put him in this pot. They started boiling the water. They're about to cook him. And his dad shows up with the mayor of the town and the mayor of the town talks to the chief and they end up trading a parakeet and a bow and arrow to get my dad back. And that's the story my dad tells.\r\n\r\n\r\nChris Koerner (04:09.752)\r\nThis a real story?\r\n\r\n\r\nNikolas Hulewsky (04:10.857)\r\nIt's a real story. I don't know if it's true. I don't think it's true, but it's a freaking amazing story, right? But it's like, you know, we call them Dee Dee. That's what we call them for grandpa. And it's like, that's an amazing story. And my dad has tons of those and everybody's parents have interesting stories like that. But when my dad dies, what happens to that story? Maybe I tell it to my kids and maybe it's a crazy enough story that it gets passed down to a couple of different generations, but at some point it gets lost.\r\n\r\n\r\nChris Koerner (04:20.046)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (04:40.455)\r\nI think right now there's a huge opportunity to capture these stories and there are tools like never before to be able to capture them in two specific ways. Way number one, digitally via video, right? We're on Riverside right now. We have cool cameras, we have cool lights. We could go in and interview these people and capture their story. It's very similar to what Story Worth is doing with the emails, except you would actually have a video, right? Way number two, which I love, artificial intelligence and digitize records.\r\n\r\n\r\nChris Koerner (05:04.342)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (05:09.937)\r\nSo many people have journals. Now there are many people who don't have journals, but many people have journals. How do you get those digitized? Well, in the past, you haven't been able to read handwriting. But now there are tools that allow you to take a picture and then using technology, digitize that and transcribe it. So I think those are two huge opportunities to create. Before I keep going and just keep talking, does it make sense what I'm saying or am I just like rambling?\r\n\r\n\r\nChris Koerner (05:39.65)\r\nNo, I'm getting some ideas. I'm loving it.\r\n\r\n\r\nNikolas Hulewsky (05:39.881)\r\nOkay, cool. All right. So here are some ideas of things that you could turn into products, okay? You could create a chat bot for your grandma and grandpa. Some people are gonna be weirded out by that, right? Cause it's like grandpa died 30 years ago. I don't wanna talk to him, but other people are gonna be like, yeah, I could really use some advice from grandpa right now.\r\n\r\n\r\nChris Koerner (05:52.622)\r\nMmm.\r\n\r\n\r\nChris Koerner (06:03.5)\r\nSo I thought you were going to say a chat bot for grandpa to tell his stories to.\r\n\r\n\r\nNikolas Hulewsky (06:08.381)\r\nWell, that's, yeah, yeah, I'm gonna get there. That's capturing all of this stuff, right? I'm talking about like end state products that could be created from capturing all of these things. So one is a chat bot for family to talk to. Another one is you could turn these interviews into like podcasts and use like actual good lights, actual cameras, and then just have episodes where you could watch grandpa tell this story or great grandma tell this story.\r\n\r\n\r\nChris Koerner (06:13.18)\r\nhuh.\r\n\r\n\r\nChris Koerner (06:18.839)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (06:32.965)\r\nof the time that they made the high school football team or that they got shipped off for World War II or that they almost got sold to Indians in the interior of Brazil. You can create books, Like Story Worth kind of does that where you create books. And you can also create a service where you digitize records for families to capture these things. So in my mind, like those are broad products that you could create. The way that you create them would be through either capturing video,\r\n\r\n\r\nChris Koerner (06:52.526)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (07:02.141)\r\ntaking their records and digitizing them, creating a chat bot that just prompts them with questions or the email correspondence with something like StoryWorth, right? So like it's either gonna be video, it's gonna be written, it's going to be live with a chat bot or you're gonna be digitizing things. Those are kind of the ways that you would capture it. And so there are tools like Adobe Scan or Microsoft Lens where you can actually scan this stuff. There are handwriting OCRs where you can Google Cloud Vision.\r\n\r\n\r\nAmazon Textract that you can actually look at the handwriting and transcribe it. Once it's transcribed digitally, you can then upload it to the LLM so that it can read you off this information. How cool would it be to have a chat bot for my kids to be like, where was great-grandpa Royce born? Great-grandpa Royce was born in Southern Florida, Defuniac Springs. It just spits out an answer instead of asking mom or dad. Then you would have\r\n\r\n\r\nChris Koerner (07:40.526)\r\nMm.\r\n\r\n\r\nChris Koerner (07:52.216)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (07:57.627)\r\neven chat bot development. So OpenAI has opportunities to now create chat bots based off of information that you feed it using different GPTs, essentially. So that's the product. And that is like the way that you would get to the product in a nutshell.\r\n\r\n\r\nChris Koerner (08:18.966)\r\nI love it. So, here are my ideas that I'm going to, that are coming to mind. So do remember the company rewind? So rewind was interesting. It's a Silicon Valley startup. They raised a bunch of money. It's a Mac app. It's an iPhone app and it listens and it watches everything you do on your computer or what you type, what you look at. It's like a, it's like a browser history for everything, which a lot of people are freaked out about. I'm not.\r\n\r\n\r\nNikolas Hulewsky (08:27.785)\r\nMm-hmm. Yes.\r\n\r\n\r\nChris Koerner (08:45.794)\r\nThey're coming out with a piece of hardware any day now. I'm like on the wait list. I pre-ordered it. It's like 70 bucks and it's going to be a wearable. and it's going to listen to everything that happens around you. And then it will send you a daily summary and it will recognize voices and attribute certain voices to their names. It's amazing. And it's good. Like you could just recall anything. It's all going to be there in an LLM that you can talk to. Super cool. Not an ad, but what you could do is\r\n\r\n\r\nNikolas Hulewsky (09:02.345)\r\nThat's amazing.\r\n\r\n\r\nChris Koerner (09:15.028)\r\nyou could piggyback on someone like rewind and literally just resell their product as rewind for elder people, right for for a different generation that would never even hear about the company. And like, you know, you give it to your grandpa, what is this? just just put it on your shirt every morning. And just talk and just live your life and tell stories and talk about World War Two and talk about your mission and talk about all this.\r\n\r\n\r\nAnd it's just going to be on his schedule on his timetable or hers. It will just be recorded and it will be there forever. And it doesn't have to be this formal thing. He doesn't have to write an email. You can just talk to it.\r\n\r\n\r\nNikolas Hulewsky (09:57.299)\r\nThat is going to be one of my other silver tsunami ideas, that device. And I'm not even going waste a bunch of time, but I have so many ideas around that, I've been, especially in healthcare. But I love that. I love that idea. Here's what I'm thinking for a distribution idea. Many people don't know the difference, but there are like three types of living places for the elderly. There are independent living facilities. Well, I mean, yes, a traditional home.\r\n\r\n\r\nChris Koerner (10:02.499)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (10:23.731)\r\nbut let's exclude those things. They're independent living facilities, they're assisted living facilities, and then there are skilled nursing facilities. It does not matter that you know the difference. They are kind of different. But I would take, I would do two things. Thing number one, I would get high school kids to volunteer and I would go to the assisted living facilities and I would say, we're gonna be here once a week, we're just digitizing records. And so then the families or the residents would bring those records and they would just take pictures of them, upload it, and then.\r\n\r\n\r\nChris Koerner (10:49.514)\r\nMmm. Yeah.\r\n\r\n\r\nNikolas Hulewsky (10:51.465)\r\nhave it for the families. could be a senior project. You could even do it for free. I've been thinking about doing it for free locally because I just think it would be a really cool project to do for these residents. Okay? So that's thing number one. Thing number two, I would go through either local photographers, local videographers, because they have the equipment. They have the lighting, they have the cameras, they have the microphones. And I would just say, go capture once a week stories and go to those assisted living facilities and say, we're going to be here Thursdays from noon to five.\r\n\r\n\r\nIt's just story time. And it would allow these residents to come put a mic on and tell their story. The residents would love it because it's one of the saddest things about these facilities. They don't get a lot of visitors and it's super freaking sad because some of them, yes, they're gone. They have Alzheimer's dementia. They're not there. But many of them are still there, but they just, don't get to see their grandkids or they don't get to see their friends anymore because the level of care that they need doesn't allow them to go out and visit with these people. So\r\n\r\n\r\nChris Koerner (11:23.086)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (11:30.797)\r\nYeah.\r\n\r\n\r\nChris Koerner (11:39.544)\r\nMm-hmm.\r\n\r\n\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (11:47.933)\r\nYou would get a ton of people coming in and then you could, you would either have the facility pay you as like an add-on benefit of staying at the facility or you would have the family pay you or some type of combination of both, but you would capture all of that, package it up really prettily and then give it out and sell it either back to the families, back to the resident, et cetera, or turn it into some of these other products that we're talking about, like the chat bot, like a book, like a podcast.\r\n\r\n\r\nChris Koerner (12:14.031)\r\nThat is such a good idea. Do you think the owner of a facility like this would be willing to pay extra for a service like this if they thought they could fill more beds? Like if it could set them apart? Because what is the value of one more filled bed to a facility?\r\n\r\n\r\nNikolas Hulewsky (12:23.977)\r\nA million percent. A million percent.\r\n\r\n\r\nNikolas Hulewsky (12:31.177)\r\ndepends on the facility, but if we're talking about an assisted living facility, that's going to be like an extra $5,000 a month in top line revenue. And then like in a vacuum, you would say like, know, 15 % online. LTV. It's weird.\r\n\r\n\r\nChris Koerner (12:43.394)\r\nLet's say LTV.\r\n\r\n\r\nChris Koerner (12:47.384)\r\nlike monthly profit, how many times, how many months?\r\n\r\n\r\nNikolas Hulewsky (12:51.369)\r\nI mean, the average day at these assisted living facilities are 10 years. It's a really long time. Yeah, it's a really, really long time. But the thing I was going to say is like, if you looked at it on a vacuum and you're like, there's 100 beds in this assisted living facility and I get $100,000 in revenue a month and my profit is $20,000, you're like, okay, it's $200 or $200 per bed per month profit.\r\n\r\n\r\nChris Koerner (12:56.77)\r\nWow, I didn't realize it'd be that long.\r\n\r\n\r\nNikolas Hulewsky (13:20.659)\r\nbut if you add one more additional bed, it's not an additional $200 in profit. It's like an additional $4,000 in profit, right? Because everything's already built into that. The problem would be proving to them that it gets more residents in the door, right? Like the idea and the concept. So that's where I think you would have to go through a distribution model of these like freemium upfront, like, hey, I'll do it for you. I'll charge it to the residents and we'll be exclusive.\r\n\r\n\r\nChris Koerner (13:24.942)\r\nYeah. Yeah.\r\n\r\n\r\nChris Koerner (13:35.01)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (13:48.201)\r\nBut then once they see the value and it's bringing people in, it's like, okay, cool. I'll pay you whatever you want.\r\n\r\n\r\nChris Koerner (13:52.883)\r\nSo here's what I think you do. You go find a facility that's willing to be creative. You find a photographer that's willing to be creative and you offer this completely for free. No strings attached just to get because you want data. So you say, all right, let me get with your marketing person and they're going to sell this when they're talking to these people, they're going to sell this service. And let's say it's for a year, right? For the next year, we're going to offer whatever it's called for free and we're going to send you\r\n\r\n\r\nAll the data for free videos, text, whatever we're going to record capture stories from your dad or from your mom for free. It's, and that's just comes with the cost of admission and it, but what you need to let us do, you need to let us train your marketing department to actually sell this. And then you need to allow us to ask the new customers that you get for the next year. If this played into their decision at all, that's it. We're just going to send them an email with like a followup or two. If they don't respond.\r\n\r\n\r\nNikolas Hulewsky (14:50.825)\r\nHmm.\r\n\r\n\r\nChris Koerner (14:50.828)\r\nThat will give us data transparently so we can go get a bunch more customers like you that will pay us a pretty penny. So this is completely free. Your only downside is we spend an hour with your marketing team. You know, that's it.\r\n\r\n\r\nNikolas Hulewsky (15:03.261)\r\nYeah. Yeah, that would be genius. I don't even think you need to wait a year. I think you're just like, give us a month or just one month. Hey, any new residents that move in after you've told them this, we'll send them this blind survey and they can tell us. And if we see like, no, we didn't care about that. Great. But if we start seeing people comment about that, I think that that would be a major thing. And maybe I'm over indexing on it maybe I'm hokey, but dude, there's something just so beautiful about capturing.\r\n\r\n\r\nChris Koerner (15:08.416)\r\nRight. Three months. Yeah.\r\n\r\n\r\nChris Koerner (15:16.792)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (15:32.371)\r\nthese stories. Like when I worked in hospice and you have, know that you're actively dying. There are people who are wanting to capture stories. had this guy who had ALS.\r\n\r\n\r\nNikolas Hulewsky (15:43.107)\r\nhe had some young kids and he just captured him reading stories to them. That was it. He's just reading his stories. He's in his 30s. We paid for that, right? But now those kids for the rest of their life are going to have dad reading them this story. It's freaking, it's incredible. There are millions of these stories that just pass away because people die and they didn't pass it on.\r\n\r\n\r\nChris Koerner (15:57.976)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (16:10.211)\r\npontificating here. I think it's a cool business. I think you can make a lot of money. But I also just think it's a freaking cool service to have for people to be able to refer back to that you could feel really good about going into these facilities and selling something that you feel like is actually bringing joy to people. You know what I mean? And not just like, I found this cool arbitrage and I was able to make money because I sold the Delta between these two. It's just so cool.\r\n\r\n\r\nChris Koerner (16:24.642)\r\nYeah.\r\n\r\n\r\nChris Koerner (16:29.166)\r\nRight, right, right.\r\n\r\n\r\nChris Koerner (16:33.71)\r\nAnd I think that there could be a framework here where you could argue that this is a vitamin and not a painkiller, right?\r\n\r\n\r\nNikolas Hulewsky (16:42.729)\r\nWhat do mean? I know that that's an analogy, but I always forget like what that means.\r\n\r\n\r\nChris Koerner (16:44.142)\r\nYeah, painkillers just like something you absolutely have to have. It's just a lifesaver on day one. And so you see people these gurus like sell painkillers, not vitamins, vitamins are nice to have. Okay, so you can make the argument that this isn't a great idea, because it's just a vitamin. not a painkiller. And let's say it is. Okay, first of all, there are a lot of people selling vitamins make a lot of money. Let's say it is let's own that. For the purposes of this analogy. What is the framework for selling vitamins? Well,\r\n\r\n\r\nNikolas Hulewsky (16:50.544)\r\nYeah, yeah, yeah.\r\n\r\n\r\nChris Koerner (17:15.394)\r\nI could just picture someone like myself. It's like, yeah, I really want those stories. Okay, cool, cool. It's $500 a month. I don't know if I want them that much, you know, but it's like $50 a month, you don't make any money. So it and I'm just completely making up these numbers. So don't focus on the numbers. But maybe the the framework for selling vitamins is you've got to go through like the person writing the check has to be someone that's not as vested in the outcome.\r\n\r\n\r\nNikolas Hulewsky (17:26.468)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (17:32.05)\r\nRight.\r\n\r\n\r\nChris Koerner (17:44.012)\r\nAnd so if you go to the kids of these people that will be in assisted living and try to sell it to them directly, you might get that like, very nice to have very cool to have just, I'm not going to pull the trigger on this. But if you take that same person in the room with the marketer at the assisted living facility, and they're like, we offer this and it's included in the price. They're like, I'm in, like they would choose that place because of it, even if they wouldn't go out of their way to pay extra for it. Does that make sense?\r\n\r\n\r\nNikolas Hulewsky (18:10.675)\r\nDad, that makes a lot of sense. is, that's really interesting framework. Yeah.\r\n\r\n\r\nChris Koerner (18:15.052)\r\nYeah. So it's like, if you do cut a deal, one month, three months or whatever, just to get data from the facility, the data may tell you that it's not moving the needle at all. That the, the surveys are telling you people didn't really care. Okay. If that's the case, no big deal. Then you just pivot your strategy and don't go through the facilities and go directly through the people. Maybe you record their stories for free and then reach out to their kids, send them a sample.\r\n\r\n\r\nRight? Like use AI to say, Hey, find me three highlights, like make a sizzle reel from this 30 minute story about World War Two, send it for free to the kid. And it's kind of like when you walk into a theme park and like, Hey, come here, hey, critter family, come here, let's get a picture. Hey, $74 by this picture. It's like an equivalent of that. Right? You send them a sizzle reel and like once they see it, the same person that's not willing to pay for it. Once they see a highlight clip, like, bye bye now, bye now. It's already done, you know,\r\n\r\n\r\nNikolas Hulewsky (19:09.001)\r\nWell, this will be like the last thing and then we're taking a lot of time on this idea, but an offshoot of that would be like, I could go to a facility right now and be like, let me build out a room for you, small room like this, where they could go. Yes, and they could go at any time. You just train a staff member. like, hey, this is how you turn on the mic. This is how you turn on the camera, right? And they could just go on their own timetable.\r\n\r\n\r\nChris Koerner (19:20.386)\r\nMm-hmm.\r\n\r\n\r\nIt's like an assisted living podcast studio equivalent.\r\n\r\n\r\nMmm.\r\n\r\n\r\nChris Koerner (19:34.222)\r\nyou don't need a photographer. That's the expensive part, right? You just need the one time cost of the equipment. You literally have a button that's like this big. And it's like, press red button. And then you have a sensor in the door where when they leave it, they don't have to turn it off. Like when there's it's like the same sensor that you have on the light switch that turns on the light when it detects movement. When there's no movement, it stops recording. Big\r\n\r\n\r\nNikolas Hulewsky (19:39.975)\r\nYeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (19:48.137)\r\nYeah, yeah\r\n\r\n\r\nNikolas Hulewsky (20:02.825)\r\nOr so like their podcast studios here in Boise that do this, you know, Nathan Barry with ConvertKit or Kit now. I just go in there and they're ready to go and they have an employee there who like gets me set up really quickly. But I have my Riverside account and I go, dude, each resident could have a Riverside account. I was like, Mrs. Jones, come on in. Yep. I'll log you into your Riverside account and you're ready to go. And they sit down and it's built out and they just tell their story. And then when they're done, they'll have, you know, the because\r\n\r\n\r\nChris Koerner (20:09.144)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (20:24.227)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (20:30.749)\r\nThey have employees at these assisted living facilities. The employee will just, you whatever, hit stop or they'll close the lights off. Boom. And they're out. Like it's frictionless. They don't have to have somebody like according to the schedule. If I was going to spend some money and invest and actually do it, I would do that. I would spend like five grand, out of a cool little podcast studio and then really test the idea. think that would be.\r\n\r\n\r\nChris Koerner (20:50.478)\r\nDude, I'll do you one better. I'll do you one better. I was just, I was just listening to a podcast where this guy invented like a pod. If you wanted to go on a conference call or something in an office, open office setting, it's too loud. He invented these pods. Well, I don't even know what podcast it was, but they sold $50 million worth of these things. Right. And literally all it was, was like a two by two pod that was soundproof with a fan. Right. So it didn't get all hot and stuffy in there.\r\n\r\n\r\nNikolas Hulewsky (20:52.872)\r\nGo on.\r\n\r\n\r\nChris Koerner (21:18.69)\r\nAnd it was just a quiet place for them to have calls or work. And now, and like these are all over WeWorks, like this is no longer unique, right? You could just take one of those. You just buy a pod and you could put it off, off the side of the lobby. You don't need to build out a whole room and they just go in there. They sit down in the only, like you're eliminating all the variables, right? There's just one chair. The mic is a fixed. Yeah.\r\n\r\n\r\nNikolas Hulewsky (21:19.219)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (21:32.553)\r\nHow much do they cost?\r\n\r\n\r\nNikolas Hulewsky (21:38.151)\r\nYeah, that way. That way the facility when the facility is not like, well, I'm giving up a room now. I could have been renting that. Yeah.\r\n\r\n\r\nChris Koerner (21:44.3)\r\nYeah, it's just a little pod, they have to sit in one place, the mic is in one place, they push a big red button, you don't even need to ask their name, because the the facility is going to have headshots of all these people, right? So you just tie that up to the facial recognition of who's talking. And you could link it up automatically on the back end, they could just start talking and tell stories and your cost would be zero, you'd have an upfront cost, maybe five grand. But your ongoing cost is just some software couple hundred bucks a month. And then you could sell it.\r\n\r\n\r\nNikolas Hulewsky (22:13.097)\r\nSo for anybody listening, I freaking love this idea and I'm volunteering you for this as well, Chris. If there's somebody who like loves it, or is like trying to build this out, like contact me. I'm serious. Chris and I, like I would be, just cause I have a lot of connections and distribution on the assisted living facility side, but I know myself, like I'm not going to do this. I think it's a great idea, but I know I'm not going to do it.\r\n\r\n\r\nChris Koerner (22:26.222)\r\nThat's a good idea.\r\n\r\n\r\nChris Koerner (22:39.026)\r\nThis is so good. You don't even need a person. You just drop off a pod one day, you plug everything in, you connect it to the internet, and you walk away. And everything's uploaded to the cloud, all the videos.\r\n\r\n\r\nNikolas Hulewsky (22:46.057)\r\nI think the one, the one thing you'd have to figure out, the one thing you'd have to figure out is getting the person comfortable talking because they may feel weird. Like, who am I talking to? There's no picture or maybe it's just me. You know what I mean? Like or getting them started with prompt. Exactly. Right. Like getting them started with some type of prompt. I that part I don't know. But I'm sure you could kind of figure that out pretty quickly. Anyways, I yeah.\r\n\r\n\r\nChris Koerner (23:02.784)\r\nMmm, like a prompt. Yeah.\r\n\r\n\r\nChris Koerner (23:14.926)\r\nthat. Yeah, that could just be like chat GPT like just the audio feature like you could just have a like an overarching prompt where it's like, all right, you are in a pod right now. It's an 83 year old wants to tell stories, but they don't know where to start. Right. So you're going to prompt them to tell stories like it can. You could just use an audio version of that.\r\n\r\n\r\nNikolas Hulewsky (23:34.163)\r\nDude, well, because chat GBT has that now where you can talk to it. Right. Or and maybe the worker just sets it up and be like, all right, Gary, Gary sits down. Grandpa Gary sits down. You're ready to go. Chat GBT Gary is ready. And it's built into the prompt. It's like, hello, Gary. Glad you're here. Why don't you tell me a story about where you where you grew up? And then Gary just starts talking because then it at least mimics the having a conversation. I think that would be really.\r\n\r\n\r\nChris Koerner (23:38.388)\r\nMm hmm. Yeah.\r\n\r\n\r\nChris Koerner (23:57.091)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (24:03.057)\r\nAnyways, you could solve that piece, but I do think that'd one piece that you'd like have to kind of figure out.\r\n\r\n\r\nChris Koerner (24:09.144)\r\ngreat idea. I really love that idea. I'm very, very proud of you.\r\n\r\n\r\nNikolas Hulewsky (24:10.473)\r\nThank you, Chris. Thank you.\r\n\r\n\r\nNikolas Hulewsky (24:18.953)\r\nAll right, what you got?\r\n\r\n\r\nChris Koerner (24:19.01)\r\nAll right, I got one. So new year's coming. New year equals new business opportunities, new side hustle opportunities. That's right. So.\r\n\r\n\r\nNikolas Hulewsky (24:25.544)\r\nNew year, new you.\r\n\r\n\r\nChris Koerner (24:30.166)\r\nI stole this idea.\r\n\r\n\r\nNikolas Hulewsky (24:31.37)\r\nhold on a second. Hold on a second. We need to start listening to Macklemore's. Next year is going to be better than this year.\r\n\r\n\r\nChris Koerner (24:37.349)\r\nNo, Winsor featuring Macklemore. We do.\r\n\r\n\r\nNikolas Hulewsky (24:41.969)\r\nThere it is. year's gonna be better than this year. Next year's gonna be better. Such a good song.\r\n\r\n\r\nChris Koerner (24:46.658)\r\ngood song.\r\n\r\n\r\nokay. So I'm still, I stole this idea, but I'm implementing in a different way. Justin Mares. He's kind of a Twitter business guru. He did this a year or two ago with some friends and family. if you look at, if you're watching on YouTube, you look at this right here. What is that? That is a CGM, a continuous glucose monitor. Okay.\r\n\r\n\r\nNikolas Hulewsky (25:08.637)\r\nAre you biohacking now?\r\n\r\n\r\nChris Koerner (25:10.094)\r\nI've used this before. This is my second go-around with this but I'm a biohacker. I got an oar ring. I got my Coros watch.\r\n\r\n\r\nNikolas Hulewsky (25:18.569)\r\nYeah, you're a bye guy.\r\n\r\n\r\nChris Koerner (25:24.14)\r\nAlso, I did want to give a shout out to my mom Cindy who listens to this podcast. I love her very much. And she's written hundreds of journals. She has 10 10s of 1000s of pages of handwritten journals. And I'm very excited to digitize all those in an LLM. I know, I know. And I told her I'm going to do this. And she loves the idea. I could ask like, Hey, what was Cindy's worst day? Hey, what was life like the day I was born? Like she's written about all these things.\r\n\r\n\r\nNikolas Hulewsky (25:37.011)\r\nDude, she's the perfect audience.\r\n\r\n\r\nNikolas Hulewsky (25:49.415)\r\nYeah, well, hey, June 2nd, 1992. What was that day like in Cindy's life? That's incredible. Well, dude, and I have the list of tools. mean, I'd listed them off, TransBiscus, Amazon Textract is really good. I can't believe how freaking good it is. anyways, sorry, keep going with your.\r\n\r\n\r\nChris Koerner (25:54.264)\r\nYeah, I know.\r\n\r\n\r\nChris Koerner (26:06.24)\r\nNo, we could put this segment in like, we could just add it back to that segment. But basically what rewind is doing with this wearable is like what my mom has been doing for 60 years writing in a journal. Like not that we should no longer write in journals, there's something very different and intentional about that. It doesn't replace that wholly, but being able to ask questions to something based on what you did in your life, that's gonna be the standard. Kids being born today, that's all they'll know.\r\n\r\n\r\nNikolas Hulewsky (26:34.249)\r\nWell, I already previewed this in medical care. As a physician, don't have your chart anymore. You're just like, right, Mrs. Johnson is a 95-year-old female, 120 pounds, PMI of, and they just start listing these things. They don't need to write that down anymore. You know how much time that's going to save? It's now going to be here and then transcribed to the electronic medical record. Anyways, that in and of itself will allow us to care for that booming population that I just named going from 52 to 95 million.\r\n\r\n\r\nChris Koerner (26:48.066)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (27:04.349)\r\njust the productivity savings of no longer having to enter into your EMR will allow us to get there.\r\n\r\n\r\nChris Koerner (27:08.012)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nlove it. All right, so I have a continuous glucose monitor and\r\n\r\n\r\nNikolas Hulewsky (27:12.104)\r\nAnyways.\r\n\r\n\r\nChris Koerner (27:18.23)\r\nIt monitors my glucose continuously. Like we get it, right? It's mostly used for diabetics, but yes.\r\n\r\n\r\nNikolas Hulewsky (27:22.717)\r\nSo I don't get it. So it's usually used for diabetics. Why are you using it? That's what I don't get.\r\n\r\n\r\nChris Koerner (27:29.464)\r\nGreat question, my friend. Thank you for softballing me. it's\r\n\r\n\r\nNikolas Hulewsky (27:34.473)\r\nBy the way, I cannot believe you have it because you freaking hate needles. And it's genius.\r\n\r\n\r\nChris Koerner (27:39.99)\r\nI do, but it doesn't hurt. It doesn't hurt. Like legitimately, I don't know. I hate needles, but legit, I don't know how it doesn't hurt. But like you have this whole thing and you, you pop it in there and you don't even feel it. So, all right. So if you look at my phone right now, you see this, I have this handy little app. You can't really see it, but it says scan, scan, scan sensor. And every eight hours I have to do this. And I think it's like an NFC chip and it's not working.\r\n\r\n\r\nNikolas Hulewsky (27:44.265)\r\ndo you hate? Huh?\r\n\r\n\r\nNikolas Hulewsky (28:00.872)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (28:09.417)\r\nNFT. That's an NFT. this is what I have to use before.\r\n\r\n\r\nChris Koerner (28:12.76)\r\nto the FD.\r\n\r\n\r\nChris Koerner (28:16.643)\r\nIt's literally not scanning for the first time ever. But anyway, you scan it and it will go past the last eight hours and show you what your blood sugar has been. And then you can attribute it to what you ate or drink around that given time because when our blood sugar spikes, we get cravings, we get hungrier and we overeat. Okay, that's what happens when our blood sugar spikes. So there's all kinds of tactics and strategies out there where like, if you eat carbs, you want to pair it with protein. You don't want to eat carbs all by themselves. You always want to balance it with protein or before\r\n\r\n\r\nyou eat a meal, you want to eat a little protein beforehand and help you feel more full like a hard boiled egg or some almonds, right? Or if you eat a big, like a very unhealthy meal, maybe full of carbs or sugar. If you walk for like 15 minutes afterwards, just casually, it will have like a 70 % decreased effect on your blood sugar levels. Yeah. Like it's it's a it's a total hack. And so having a continuous glucose monitor\r\n\r\n\r\nNikolas Hulewsky (29:05.683)\r\nReally?\r\n\r\n\r\nI know.\r\n\r\n\r\nChris Koerner (29:12.834)\r\nhelps you learn more about your body. So even if you only wear it for a few months, you'll know forever that like that diet Coke, it's not supposed to spike my blood sugar, but it does. everyone's different. Like everyone's bodies are a little different. So some things are constant for everyone and some things are unique to you. So I love it because it just helps me learn and understand and not make such terrible decisions. Okay. All right. So Justin Mares, he did a challenge at the beginning of last year, the year before where he went to his friends and family.\r\n\r\n\r\nand said, Hey, order a continuous glucose monitor. We'll all wear the same type. We'll all track our levels together. Pay me a thousand dollars. and you've got to keep your blood sugar in a range for three months straight. Maybe you have like one or two, like, you know, fibs where you can mess up without any penalty. But if you don't, like if you, if you screw up and you eat a brownie, I keep your thousand dollars. If you go all one, two or three months,\r\n\r\n\r\nwhile staying in this range, I give you all of your money back. It's just an accountability piece. So that went really well. I don't know what the percentage of what the percentage was of people that did it successfully versus failed, but I think this could be an interesting side hustle and you're just using math to your advantage. And it depends on the type of person that you're working with, but you, doesn't have to be with a continuous glucose monitor. It could just be like a new year health challenge.\r\n\r\n\r\nNikolas Hulewsky (30:14.771)\r\nRight, right, right.\r\n\r\n\r\nChris Koerner (30:40.002)\r\nwhere everyone puts money into a pot and there's something, something where you don't have to be honest. Like you can just use tech to hold everyone accountable. You're sharing your numbers and you're just a like, you're going to be healthier because of it. So that's just a win no matter what. B you're banking on people failing and you make money that way.\r\n\r\n\r\nNikolas Hulewsky (31:00.243)\r\nThis reminds me of a member of Project Skyfall.\r\n\r\n\r\nChris Koerner (31:03.882)\r\nNo, Sky Drop. Yeah. Like, the 007 movie.\r\n\r\n\r\nNikolas Hulewsky (31:06.185)\r\nSkydrops, it's 007. When the sky falls. Yeah, Skydrop, the treasure hunts and like, dude, that'd be so cool to put together treasure hunts. It kind of reminds me of that idea because effectively, you're just, you are becoming the accountability partner for them, right? And you, so you could do it as a person or you could probably build out a platform for it. But I do like that idea because people want\r\n\r\n\r\nChris Koerner (31:27.32)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (31:36.701)\r\nTwo things, people wanna get better and people want an accountability partner. Like they may not say it or they may be like, that's kind of stupid, but we suck. We suck at holding ourselves accountable. We adhere much more to things if we have somebody helping us stay accountable. So I really like that framework of becoming somebody's accountability partner. Would it just be around health items or could it be anything?\r\n\r\n\r\nChris Koerner (31:41.656)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (32:00.872)\r\nNo. So it's the same concept that I talked about a couple of weeks ago with Mike, a course based newsletter based course, right? You pay into it. You get all your money back out if you do the things, you know? And so at the end of it, like at the end of this one, if you win, then you paid nothing and you're healthy. At the end of the other one, if you win, you get all your money back and you have a thriving business. So it's just like, it's fair. It's fair all around.\r\n\r\n\r\nNikolas Hulewsky (32:05.235)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (32:26.185)\r\nIt's funny, it's like insurance almost. You'd have to get good at underwriting it. You're like, okay, I need to get my actuarial scientist on this to make sure I know what the probability of people not completing the challenge is going to be because if everybody does it.\r\n\r\n\r\nChris Koerner (32:34.338)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (32:38.222)\r\nYou go stand outside the casino and just sell all those people.\r\n\r\n\r\nNikolas Hulewsky (32:43.834)\r\nYeah.\r\n\r\n\r\nBut if everybody does it, you don't make any money. You know what mean? That's a very weird, that's a weird business model.\r\n\r\n\r\nChris Koerner (32:50.563)\r\nBut you\r\n\r\n\r\nYou still can though, but wait, there's more. So I'm going to do this with my newsletter subscribers. This challenge specifically that I'm talking about. haven't sent an email about it, but even if they're completely successful, I will make a hundred dollars because I'm going to use an affiliate link and they all have to use the same CGM continuous glucose monitor.\r\n\r\n\r\nNikolas Hulewsky (32:56.612)\r\nGo on.\r\n\r\n\r\nNikolas Hulewsky (33:14.995)\r\nThat's okay. Can we just talk about how gene when we can cut this out if you want. That's a genius way for you to monetize. Like it's it's genius and the reason is genius because you're doing something that you love to do and like you're getting people to come along with you. That's freaking genius. You're not just.\r\n\r\n\r\nChris Koerner (33:32.726)\r\nAnd no one really pays for it. Like I get $100, but that's paid for by the company. And if they do the thing, they don't pay for it.\r\n\r\n\r\nNikolas Hulewsky (33:37.961)\r\nRight? Exactly. You're not just selling them a product that's like, Hey, Chris, I think your audience would be a really good fit for you know, they're millennials in their mid 30s. And they're buying a house, insurance, life insurance would be really good. It's like, no, you're doing something that, like, man, I really, really like that monetization framework for you, because you hate monetizing. I'm not and I'm not like, I don't think you're taking it the wrong way. Like,\r\n\r\n\r\nChris Koerner (33:50.627)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (34:03.287)\r\nNo, I do.\r\n\r\n\r\nNikolas Hulewsky (34:06.321)\r\nYou've had lots of opportunities to monetize. You've got almost a million followers across all of your social platforms. You get tens of millions of views every single month and you don't monetize because it makes you feel gross. Like for years I'd been pushing you. That's one of reasons I got onto Twitter is because I'd be like, dude, you can make money doing this. You could do this. You could do this. And you're like, all right, like if you want to do that, go for it. I'm not doing that with my stuff. I think that's a, that's a genius way. Sorry, I'll get off my soapbox.\r\n\r\n\r\nChris Koerner (34:33.326)\r\nThanks. No, I think it's the same personality trait that I was just texting you about an hour ago where like if I'm late, I have anxiety because people are waiting for me. If someone else is late, I have anxiety because I'm waiting for someone. And it's just like, that's why I hate being late. I don't like being late. I think that same principle applies to monetizing because if I just start shilling ads that are not relevant to people, it's not something that they're going to buy anyways, then I'm wasting their time. It's as if they're waiting for me. That makes sense.\r\n\r\n\r\nNikolas Hulewsky (34:41.373)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (34:59.465)\r\nAnd it does. And this brings up a bigger point to me. This isn't necessarily a business idea. This is just a philosophy that I think everybody needs to think about because if you want to get into business, I wouldn't pick the thing that you think is going to make you the most money. I wouldn't. I think that that's the wrong way to go about it. And I know Nick Huber is always posting like, don't follow your passions. That's stupid advice. There's some truth to that. I just, dude, I hate his stuff recently. It is just all rage bait. Anyways.\r\n\r\n\r\nYou need to find things that you're passionate about that you really like because the grind is real. When you decided to launch that business, it's going to get freaking hard. And if you have no passion for it, if you're not excited about it, if it's not something that you really believe in selling, you're not going to stick with it. So like find where your comfort zone is asking for money for you. You don't like selling ads and you've embraced that. So like, OK, you've got to figure out other ways to, you know. Yeah.\r\n\r\n\r\nChris Koerner (35:56.836)\r\nLike constraints force creativity, right?\r\n\r\n\r\nNikolas Hulewsky (36:00.059)\r\nExactly. Because you're going to continue to do this. We need to pay for our content team. We got to pay for all the other stuff that we have, the overhead. And that's fine. So you just got to be creative about it. think more people need to spend time thinking before they hop into something about what they are and what they are not passionate about, what they are and what they are not okay with when it comes to business. Because they spend far too much time on how much money they're going to make and far too little time on how it's going to affect their psyche and their soul. I know that sounds stupid and woo-woo, but it is so freaking true.\r\n\r\n\r\nChris Koerner (36:15.448)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (36:29.4)\r\nWell, you won't, you won't, you're going to quit what you're doing. If you don't like it, you're to go back to a job. Right. So let me go ahead. I'm going to agree with you, but I put a twist on it. So I've gone like over the last 15 years starting businesses, I've gone back and forth on that. Follow your passion. Don't follow your passion. That's like a big polarizing topic. So I completely agree with you. Follow your passion. If you want to love what you're doing, there's, you probably have enough passions to where you could monetize at least one of them. Right.\r\n\r\n\r\nNikolas Hulewsky (36:34.973)\r\nYeah.\r\n\r\n\r\nNow you.\r\n\r\n\r\nChris Koerner (36:59.384)\r\nbut also be willing to eat crap for a while, right? Maybe that business you start that is profitable just sucks because you have to sell and you hate selling or you have to go door to door and you hate that or you have to manage people and you hate that. Like there's also an element to just be willing to eat crap for a while, all right, to get to what your passion is. So there's one aspect. The other aspect is one of my missions with all the content I put out is to get people to look at things differently and to see\r\n\r\n\r\nthings differently and to find opportunities and more things and to like fall in love with business and business ideas because that's what I've done. And so I don't pick ideas based on passion. I'm passionate about the idea itself, about business itself, about commerce. That's my passion. So whether it's porta potties or software or an agency, it makes no difference to me because the passion is like, like it's way further up the funnel than that. Does that make sense?\r\n\r\n\r\nNikolas Hulewsky (37:39.081)\r\nThanks\r\n\r\n\r\nNikolas Hulewsky (37:55.857)\r\nIt doesn't make sense. have two things I'm going say. The first thing is you have to have a Venn diagram and there are three aspects to the Venn diagram, but most of the time people only focus on two. The two people most of the time focus on, and for those who don't know, a Venn diagram is like two circles and then where they overlap is where you want to focus. The two things that people focus on the most are what I like doing and what I'm good at, right? So if there's overlap in something that I'm passionate about and what I'm good at, that could be a business, right?\r\n\r\n\r\nthere's the third circle in that Venn diagram, which is what I can charge for. Right? So there's three circles, what I can charge for, what I'm good at, what I'm passionate about. They have to overlap. Otherwise, I don't think you should get into the business, but everybody can find that. I think everybody could find their Venn diagram of that. The second thing I would say is, you and I have talked about this a lot. Jeff Bezos and Elon Musk and Bill Gates, they've just hyper-focused on one thing.\r\n\r\n\r\nChris Koerner (38:30.456)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (38:37.059)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (38:55.379)\r\nThey're just hyper-focused on one thing. It's their one thing and they're hammering at home. I don't do that. I'm too ADHD, et cetera. You and I love the ideation of business because it's like, it's the game of business. I think Warren Buffett is similar to that. He's a capital allocator. It's not like he's like, he's just the insurance guy or he's just the Bank of America guy. Like he loves the game of business as well and he's putting money in different places. So.\r\n\r\n\r\nI don't think it's bad that you haven't necessarily quote unquote followed your passion. Like, I'm a wrestler. I'm going to go into our wrestling business. No, you love playing the game, right? Like you like figuring out how to get somebody to buy and that's a passion in and of itself. That's fine. You just have to the work. It's taken you a long time, taking me a long time to like do the work to understand, okay, cool. This is my Venn diagram. Passionate about, good at, can make money at. People need to do the work and understand kind of where their passions lie.\r\n\r\n\r\nChris Koerner (39:30.594)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (39:36.856)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (39:49.39)\r\nI And when it comes to that circle of the Venn diagram, like what you can charge money for, what the world needs, a lot of people just don't know that they can charge money for certain things or that they can monetize certain things. And that's another thing that I deliberately intentionally try to do is show people like anything is monetizable. Anything is scalable. can, you can, you can monetize anything, but they just don't have ideas. They don't know how to get there. But if they can kind of change, rewire how their brain works, then they'll see opportunities in everything.\r\n\r\n\r\nNikolas Hulewsky (40:19.113)\r\nI totally agree. So we're at 40 minutes for both episodes. Do you want to do a merry day to kill for both or one for each? Because we only have five ideas total.\r\n\r\n\r\nChris Koerner (40:25.09)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (40:35.593)\r\nthe live local music that you had first, my newsletter idea, Facebook group, email automation, silver tsunami.\r\n\r\n\r\nWait, and biohack.\r\n\r\n\r\nChris Koerner (40:46.786)\r\nLive music.\r\n\r\n\r\nNikolas Hulewsky (40:49.897)\r\nDo we have six? Am I wrong?\r\n\r\n\r\nChris Koerner (40:53.376)\r\nIt depends on how you look at the Facebook automation and the email, because it was kind of one that we turned into two Facebook groups. I think that could be two.\r\n\r\n\r\nNikolas Hulewsky (41:01.169)\r\nMy newsletter, live music, Facebook group, Silver Tsunami Biohacking.\r\n\r\n\r\nChris Koerner (41:05.122)\r\nLive music, email. Yeah, I think that's it.\r\n\r\n\r\nWe just, they were all longer.\r\n\r\n\r\nso five, right?\r\n\r\n\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (41:20.617)\r\nWe could just maybe not do the married date or We could just marry and kill. Which idea do you love? Which idea do you hate?\r\n\r\n\r\nChris Koerner (41:29.452)\r\nYeah, or we could rank them.\r\n\r\n\r\nBut that's, it's kind of hard rank in five. It's a little complex.\r\n\r\n\r\nNikolas Hulewsky (41:40.359)\r\nWell, what I'm saying, like we would do, if we just cut the episodes right now the way that they are, the first three, the first episode would be newsletter live music, Facebook groups. And the second episode would be Silver Tsunami biohacking. So we could do, and we would do both, right? Like, okay, which one do you love? Which one do you want to kill? Or we could jumble these around.\r\n\r\n\r\nChris Koerner (41:51.384)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nChris Koerner (41:59.918)\r\nHmm.\r\n\r\n\r\nChris Koerner (42:04.59)\r\nI say we do Mary Dator Kill for all five and we don't do any of it for the first episode.\r\n\r\n\r\nNikolas Hulewsky (42:11.241)\r\nOkay, so they wouldn't hear, so that next week they're not gonna hear a Mary Dator kill.\r\n\r\n\r\nChris Koerner (42:15.49)\r\nWe'll give them a pre no, but we'll just give them a preview of what this week's about. There was just basically what we did. It's like it gives them a reason to come back.\r\n\r\n\r\nNikolas Hulewsky (42:23.209)\r\nDude, okay, all these ideas are so good. There's not an idea this week that I'm like, that was dumb.\r\n\r\n\r\nChris Koerner (42:27.694)\r\nI know, we're really smart.\r\n\r\n\r\nBye now.\r\n\r\n\r\nNikolas Hulewsky (42:34.057)\r\nWow. All right, I need to take like 30 seconds to see which one.\r\n\r\n\r\nChris Koerner (42:40.11)\r\nYeah, let me do the same.\r\n\r\n\r\nChris Koerner (43:17.934)\r\nAll right, next time for marry date or kill. We've got five ideas that we talked to this week. We've got five, we've got five ideas that we talked about this week. And last week we've got the live music idea inspired by Nashville. We've got the local email newsletter idea that you pivot into a high ticket monthly service. You've got the Facebook groups automation idea where you play middleman between someone that wants leads, someone that has leads. You've got the ancestor.com genealogical idea where you put a pod.\r\n\r\n\r\nin an assisted living facility and charge either the residence or the assisted living facility. And then you got the biohacking idea, know, biohacking challenge as a service. Where are you at with these? Merry day or kill.\r\n\r\n\r\nNikolas Hulewsky (44:02.601)\r\nDude, this is, I think this might be the hardest week that we've ever had in ranking these. These were freaking good ideas this week.\r\n\r\n\r\nChris Koerner (44:10.67)\r\nare good ideas. We're really smart people. Really smart. I mean, yeah, I mean, yeah, like in some countries.\r\n\r\n\r\nNikolas Hulewsky (44:13.833)\r\nI'm good looking, right? I feel like I'm really good looking. All right, I'm going to give here the first two that are in No Man's Land. All right. The newsletter. And the live local music. Those are No Man's Land for me. I'm like, I don't feel strongly one way or the other. All right. Mary. I just love the silver tsunami idea.\r\n\r\n\r\nChris Koerner (44:32.686)\r\nOkay. Okay.\r\n\r\n\r\nNikolas Hulewsky (44:42.385)\r\nof going to assisted living facilities and capturing stories. just, yeah, it's my bit. Yeah, I love that idea. So I would marry that idea. I would date the Facebook group email automation. I think that's an incredible idea. I think there's a couple of different ways you could monetize it and it's easily monetizable. And then I would kill biohacking.\r\n\r\n\r\nChris Koerner (44:45.464)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (45:08.43)\r\nYeah, that all makes sense to me. I mean, we're almost the exact same. There's one difference between us. So I 80 % agree with you. No man's land for me, email newsletter idea and biohacking. Okay. Biohacking because okay, anything can be scalable. Anything for sure. You could do this as a service. You could help other people do this, but it's kind of a gimmick. It's a way to make a little money harder to scale email.\r\n\r\n\r\nno man's land, but that's just because it's high competition. It's a great idea. But it would just take a while, right? It takes\r\n\r\n\r\nNikolas Hulewsky (45:43.529)\r\nthe Facebook group, email automation you're saying?\r\n\r\n\r\nChris Koerner (45:46.538)\r\nthe local specifically the sorry the newsletter yeah because it takes time to build a newsletter takes time okay no man's land mary ancestry absolutely 100 love that idea i don't care that you got to pay five grand for these pods i don't care that it's hard to sell into assisted living facilities my love for this idea outweighs both of those things okay okay don't even come at me with i don't care date\r\n\r\n\r\nNikolas Hulewsky (45:47.827)\r\nfor the newsletter. Local. Yeah, Okay. Yeah, yeah. Agreed.\r\n\r\n\r\nChris Koerner (46:14.626)\r\nFacebook group automation. I really, really love that idea because I think you could scale it quite quickly. Your costs are almost nothing. You just got to make some phone calls. You got to marry some parties together. I just, I, that should be a Mary, but it's just, it's high. It's high competition. and, and then the kill is live music. Like it's just like, I'm not an events guy. I'm not an organizer. I'm not an extrovert. Someone could do it, make a lot of money, but events are hard. Logistics is hard. I've been burned on logistics.\r\n\r\n\r\nNikolas Hulewsky (46:28.105)\r\nYeah. I know, it's a hard read.\r\n\r\n\r\nNikolas Hulewsky (46:42.185)\r\nOkay, so we've, we both killed different ideas, but I think we killed them for the same reason, which is like I killed biohacking because I'm like, there's only a small percentage of people that could actually do this. You're one of them, right? It's like you have a large audience, like that's where it makes sense.\r\n\r\n\r\nChris Koerner (46:55.938)\r\nYeah, it's true. Well, I think you could do it with a neighborhood or a friend group or I don't think you have to have an audience but I see what you're saying.\r\n\r\n\r\nNikolas Hulewsky (47:05.299)\r\nYeah, yeah, you could. then anyways, I think that's a business that's hard to get up and running. And then I agree with you, the live local music would be really logistically hard. I love the idea of it. But that would just be a really logistically hard business. I'm curious to hear, I want to hear from people this week. Like which one of these would you marry, date or kill? I know it's been doing that. I think it like overheats or something.\r\n\r\n\r\nChris Koerner (47:16.802)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (47:21.432)\r\nYeah, it would.\r\n\r\n\r\nChris Koerner (47:28.834)\r\nWait, your camera just went out. Okay.\r\n\r\n\r\nChris Koerner (47:35.266)\r\nYeah, so if you're on YouTube comment, what would you marry date or kill? Are we are we aligned here or not?\r\n\r\n\r\nNikolas Hulewsky (47:42.823)\r\nYeah, I wanna know, let's see it and it'll pop back up. Here we go. Yeah, I wanna hear from people. Which one would you marry? Which one would you date? Which one would you kill and why?\r\n\r\n\r\nNikolas Hulewsky (47:55.433)\r\nIt's a week. Is it Happy Thanksgiving? Maybe that was last week. All right. Well, this is great.\r\n\r\n\r\nChris Koerner (47:58.584)\r\nPretty much. It was last week.",
  "metadata": {
    "duration": "",
    "date": "2024-12-06",
    "platform_source": "Google Drive"
  }
}