{
  "episode_number": "109",
  "episode_title": "What Viral Reels Teach Us About Business with Chris Koerner",
  "guest_name": "Chris Koerner",
  "business_name": "",
  "transcript": "﻿Chris Koerner (00:00.228)\r\nAlright, so let's do a new type of episode today. I'm going to call this I genius as in genius things I saw on Instagram. OK. IG yes.\r\n\r\n\r\nNikolas Hulewsky (00:08.499)\r\nOkay, okay.\r\n\r\n\r\nYes, I love that. I love that. Do we buy the domain? I genius.\r\n\r\n\r\nChris Koerner (00:13.988)\r\nYou like that?\r\n\r\n\r\nWhy wouldn't we? Why wouldn't we? I don't get it.\r\n\r\n\r\nNikolas Hulewsky (00:19.264)\r\nSpoiler alert, I've had it for five years. Always have.\r\n\r\n\r\nChris Koerner (00:22.85)\r\nI think the focus change on the camera when you do that. That's pretty good. look at that. That's good. All right. So if you're listening, I'm going to explain what we're watching. And if you're watching on YouTube, you're going to see it on my screen. So I'm going to pull up a couple Instagram reels and we're going to talk about what they are and how we'd improve it, what we like about it, what we don't like about it. Cool.\r\n\r\n\r\nNikolas Hulewsky (00:26.944)\r\nSo good. So good. Always, always has been.\r\n\r\n\r\nNikolas Hulewsky (00:45.088)\r\nokay. Like about from what perspective to like get it more views or if it's a business, sorry.\r\n\r\n\r\nChris Koerner (00:50.752)\r\nNo, no, no, like from a business perspective, because these are all business ideas,\r\n\r\n\r\nNikolas Hulewsky (00:53.213)\r\nOkay, these are all business ideas. These are reels of business ideas. And so we're looking at them evaluating.\r\n\r\n\r\nChris Koerner (00:56.804)\r\nSome of them are not business ideas, but as I like to say, any good idea could be a good business idea. So that's the idea.\r\n\r\n\r\nNikolas Hulewsky (01:03.498)\r\nVery true. Like religion.\r\n\r\n\r\nChris Koerner (01:07.94)\r\nYeah.\r\n\r\n\r\nChris Koerner (01:13.371)\r\nAll right, let's see. Here we go. Oh, I just gotta do this one sec.\r\n\r\n\r\nChris Koerner (01:29.966)\r\nShare.\r\n\r\n\r\nChris Koerner (01:37.956)\r\nUm, all right. Muhammad, if you could edit out like this awkward pausing. Let me see. I gotta get it. How do we get it to be full screen?\r\n\r\n\r\nNikolas Hulewsky (01:45.696)\r\nBanana, banana, Mohammed.\r\n\r\n\r\nChris Koerner (01:51.886)\r\nYeah, banana is the safe word to actually edit something out, Muhammad. And if we say edit this out, Muhammad, and we don't say banana, then don't edit it out. So bananas, the word is poor guy.\r\n\r\n\r\nNikolas Hulewsky (01:55.562)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (02:03.444)\r\nAre you trying to make the real full screen?\r\n\r\n\r\nChris Koerner (02:07.78)\r\nFull screen, yeah. I know I can, but hold on.\r\n\r\n\r\nChris Koerner (02:16.996)\r\nLet see if I look over here. I'm on another tab right now.\r\n\r\n\r\nChris Koerner (02:24.177)\r\nAll right.\r\n\r\n\r\nChris Koerner (02:33.314)\r\nOkay.\r\n\r\n\r\nChris Koerner (02:57.732)\r\nOkay, you know, I think I'm just gonna pull up my video, like the video that I did about this, with the overlay. So let me do.\r\n\r\n\r\nNikolas Hulewsky (03:07.445)\r\nguys\r\n\r\n\r\nChris Koerner (03:14.126)\r\nThere it is. All right.\r\n\r\n\r\nChris Koerner (03:24.42)\r\nUgh.\r\n\r\n\r\nNikolas Hulewsky (03:43.953)\r\ngosh.\r\n\r\n\r\nNikolas Hulewsky (03:54.1)\r\nYeah.\r\n\r\n\r\nChris Koerner (03:59.234)\r\nAll right, I'm stop sharing my screen.\r\n\r\n\r\nNikolas Hulewsky (04:01.494)\r\nwe're just, we're just playing our social media clips now? Okay, hold on a second. I got something.\r\n\r\n\r\nChris Koerner (04:07.844)\r\nThis is all a ploy to get like four more Instagram followers.\r\n\r\n\r\nNikolas Hulewsky (04:09.696)\r\nIt's all... Yeah!\r\n\r\n\r\nto the ones that people listening who don't already follow you on those platforms.\r\n\r\n\r\nChris Koerner (04:13.54)\r\nThat's\r\n\r\n\r\nYep. Yep. All right. What do we think? What do we think of this as a business idea? It's great, right?\r\n\r\n\r\nNikolas Hulewsky (04:18.496)\r\nDude, I love that idea. I love that idea. So again, I just talked to Craig Fuller from Freight Waves. He bought a model train museum that was going out of business 80,000 square feet. He's bringing it. He's bringing it back to Chattanooga, Tennessee. And he is going to build and live the way he was talking about it. He's like, I want it to be an immersive experience. I want it to be like Disneyland, right? Where you come in. And this isn't a model training museum like\r\n\r\n\r\nChris Koerner (04:35.78)\r\nSo big.\r\n\r\n\r\nNikolas Hulewsky (04:49.074)\r\nLego set where it's really small. He's like, the buildings are 10 feet tall. Like you're in the middle of it. Like you feel like a giant, right? You're Godzilla walking through it. And I think this, I think what he's talking about these immersive experiences. We, when we went through COVID, it fast forwarded what we thought was going to happen. we're all just going to go to remote work and we're all going to work at home and it's going to be amazing. And people are going to buy online and we're going to get groceries delivered and Shopify is going to go crazy. All those things happen. But I think people realized, I don't like this.\r\n\r\n\r\nChris Koerner (04:52.388)\r\nHmm.\r\n\r\n\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (05:19.87)\r\nI like doing stuff. I like meeting other people. I like doing things. So this, the businesses that you just showed me, it's like I'm out doing things like, okay, I went to the coffee shop, but I'm also digging dirt. You know what I mean? It's not just sitting around drinking. It's experiential. And so I like the idea of coupling these businesses, traditional services businesses with some type of an experiential component. So I really like it.\r\n\r\n\r\nChris Koerner (05:28.398)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (05:43.694)\r\nYeah, I mean, you could also start a business that just sets these up for existing businesses, right? It's like a sandbox as a service. It doesn't have to be a coffee shop. It could be a restaurant. could be a trampoline park. It could be anything that already has traffic that would fit this demographic and you could just install it and manage it for them for a fee.\r\n\r\n\r\nNikolas Hulewsky (06:02.354)\r\nOr you could go to the companies who are already doing that and say, hey, you install this? Great. I'll bring you business. just want 30 % of whatever you, like whatever the number is that gets worked out, right? You become the sales channel and then start going and finding local businesses that you can implement this with. And then you don't even have to worry about the fulfillment or any of the work. You're just essentially a distribution channel.\r\n\r\n\r\nChris Koerner (06:23.608)\r\nBanana. Mohammed, I'm about to describe actually what was in the video because we forgot to do that. People listening don't have any idea what we're talking about. So I'm going to describe what was in the video and then say banana again. And if you could just put that right after we watched it, is that cool? All right. So for those just listening, we just watched a video of this coffee shop in Dubai that has a huge sandbox in the middle of it. And you've got kids and adults.\r\n\r\n\r\nlike just playing with RC excavators and toys in the sandbox. And this was like an insanely viral video. the one that I copied had like 30 million, views on it. So we think there's something here. What do you think, Nick? All right, banana. You could just put that right after we watched it. All right. So you were talking about offering as a service son of a\r\n\r\n\r\nThis just went off the rails!\r\n\r\n\r\nNikolas Hulewsky (07:14.836)\r\nI love it when you yell, hit me dad, hit me.\r\n\r\n\r\nChris Koerner (07:16.388)\r\nYou\r\n\r\n\r\nNikolas Hulewsky (07:19.808)\r\nIt's coming back.\r\n\r\n\r\nChris Koerner (07:19.876)\r\nHow do we fix your camera? Okay.\r\n\r\n\r\nChris Koerner (07:31.044)\r\nAll right. Totally agree with like the experiential stuff. We're getting outdoors more, but just on a more base level, like you've got a zillion coffee shops out there. They're all about the same. It just makes one extremely different for a very low additional cost. Like what's the downside of this?\r\n\r\n\r\nNikolas Hulewsky (07:46.132)\r\nRight? there are already places who do this and like, it's food is a secondary experience. Dave and Buster's is an example of that. Chuck E. Cheese's, if we want to go back to when we were kids. like Dave and Buster's food isn't great. But the experience is fun, right? Like, because I get to go do stuff and it's an activity. So it's kind of flipping that paradigm, right? Food is the primary. The experience is secondary.\r\n\r\n\r\nChris Koerner (07:54.745)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (08:03.416)\r\nterrible actually.\r\n\r\n\r\nChris Koerner (08:13.177)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (08:15.424)\r\nI like that framework a lot.\r\n\r\n\r\nChris Koerner (08:17.998)\r\nWell, there's another business idea that I hadn't planned on talking about that reminds me of this. So I'm friends with a guy named Sherman and he's in Utah and he found this business in Saratoga Springs, Utah. It's like a kids play area, right? Think like Trampoline Park. It's got all of the climbing stuff that you can play on, very generic when it comes to that, but it's very clean. It's kind of like a Planet Fitness model, 20 bucks, unlimited play per month per kid.\r\n\r\n\r\nNikolas Hulewsky (08:31.2)\r\nYou ever heard of it?\r\n\r\n\r\nChris Koerner (08:47.812)\r\n10, maybe even 10, very cheap. But the differentiator is like upstairs, there's like this elevated platform where the parents can watch their kids and they have like really good food, like very high quality food. It's like a WeWork up there and it's like really fast Wi-Fi, leather couches, super nice. Like, you walk into a trampoline park and it just feels gross and it's just bunch of gross kids. It's like a very nice play area for kids.\r\n\r\n\r\nNikolas Hulewsky (09:11.902)\r\nYou know what? You know where else I'm seeing this is pickleball clubs. Where it's like there's a pickleball club and then they have a bar upstairs, but you could. It's also also like a we work. You can get up there and actually work out of there. They have Wi-Fi and it's a really good experience. I I also like this framework of deciding where you're going to go. Don't the middle is messy, so either be the lowest cost option and just be the Chuck E Cheese.\r\n\r\n\r\nChris Koerner (09:17.868)\r\nMmm, mhm.\r\n\r\n\r\nChris Koerner (09:22.318)\r\nMm-hmm.\r\n\r\n\r\nYeah.\r\n\r\n\r\nChris Koerner (09:36.524)\r\nMm Yeah.\r\n\r\n\r\nOwn it. Just own it.\r\n\r\n\r\nNikolas Hulewsky (09:42.216)\r\nOr go up market and be the expensive option. So it's like, yeah, yeah, we do cost 50 % more than the competitor and we're way better. Just own it. I otherwise you're like in this weird game where you're trying to compete on price, but then you're also trying to compete on quality and. That's a really difficult place to be. So with these experiential places, these ideas in particular, if you're going to do it, do it well. Don't half a it. Don't make.\r\n\r\n\r\nChris Koerner (09:52.505)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (10:08.864)\r\nIt's like, this is a homemade sandbox and you can still see the particle board on the side. You know what I mean? Like it's very obvious. So do it well or hey, bring your own excavator if you want. We got a freaking ditch in the back. You know I mean? Like those are the two options. Pick one of those. Don't go in the middle.\r\n\r\n\r\nChris Koerner (10:12.866)\r\nYeah, yeah, yeah, yeah, yeah. It's very obvious.\r\n\r\n\r\nChris Koerner (10:23.704)\r\nYeah, yeah.\r\n\r\n\r\nWell this place in Utah is slammed by the way. It's their first location. They just opened it and they are crushing it. Crushing it. Yeah. So.\r\n\r\n\r\nNikolas Hulewsky (10:38.378)\r\nshould open one of these.\r\n\r\n\r\nChris Koerner (10:41.71)\r\nThere have been talks. Not really, but.\r\n\r\n\r\nNikolas Hulewsky (10:42.016)\r\nWait. I'm sorry.\r\n\r\n\r\nChris Koerner (10:50.072)\r\nBut it's it's interesting because you go to the trampoline parks and it's super expensive. You pay by the hour and these guys are just like flat monthly fee come as much as you want. And then they make money on food. They make money on socks and all this other random stuff. But supposedly the owners have like not slept since opening it basically because they've just been slammed in a good way. Granted Utah is like the perfect market for this, but in a way it's should be like the most oversaturated market for stuff for kids to do. Right.\r\n\r\n\r\nNikolas Hulewsky (10:52.928)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (11:00.106)\r\nconcessions.\r\n\r\n\r\nNikolas Hulewsky (11:16.116)\r\nDude, fly out. Let's go. Let's go do a video with them. That'd a great video. Let's do it.\r\n\r\n\r\nChris Koerner (11:19.042)\r\nI'm down. It'd be a great video. OK. Where's my ticket?\r\n\r\n\r\nNikolas Hulewsky (11:25.034)\r\nFine, do it tomorrow. Fine. You won't do it. You won't do it.\r\n\r\n\r\nChris Koerner (11:30.532)\r\nYou put trying to put a chip on my shoulder.\r\n\r\n\r\nNikolas Hulewsky (11:33.598)\r\nYou won't do it. You won't do it.\r\n\r\n\r\nChris Koerner (11:35.204)\r\nSo we could bring up something we could talk about something you have on your list or we could go to another video. I'm cool either way. Okay, because the idea is for both of us to talk equally about them, right? So\r\n\r\n\r\nNikolas Hulewsky (11:42.726)\r\nLet's keep going. I like Igenius. Let's do another one.\r\n\r\n\r\nNikolas Hulewsky (11:48.468)\r\nYeah, yeah, yeah, I just didn't have much to say about the first one.\r\n\r\n\r\nChris Koerner (11:51.682)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (11:56.16)\r\nMaybe if we do Igenius in the future, you can share these videos with me I can come a little prepared.\r\n\r\n\r\nChris Koerner (12:00.366)\r\nYeah, that's a good idea. All right. Let me give me just a minute to find this other one.\r\n\r\n\r\nNikolas Hulewsky (12:08.478)\r\nWhile we wait, please hold.\r\n\r\n\r\nChris Koerner (12:15.66)\r\nYou love that song so much. All right, here we go.\r\n\r\n\r\nChris Koerner (12:23.012)\r\nAlright.\r\n\r\n\r\nNikolas Hulewsky (12:24.288)\r\nAll right, banana. Edit out that gap, Mohammed, please.\r\n\r\n\r\nChris Koerner (12:30.308)\r\nall right, here we go.\r\n\r\n\r\nMm-mm-mm.\r\n\r\n\r\nChris Koerner (13:34.788)\r\nHmm\r\n\r\n\r\nChris Koerner (13:42.902)\r\ninsert Tim Robinson gif of him going.\r\n\r\n\r\nNikolas Hulewsky (13:43.071)\r\nWhat's the\r\n\r\n\r\nNikolas Hulewsky (13:47.744)\r\nOkay, so what we just watched was a woman holding up some socks, basically saying, get socks wet, put them on your baby's feet, and then put wool socks over that, I'm assuming so they don't get too cold. All right.\r\n\r\n\r\nChris Koerner (14:01.06)\r\nSure. Put coldness on the feet and then put something on the feet so they're not cold. Sure. Got it. Check.\r\n\r\n\r\nNikolas Hulewsky (14:07.55)\r\nIf they don't call this cotton-headed ninny muggins, I don't know what we're doing here. Okay? If anyone who's seen Elf knows that reference, but like it's right there. It's on the tip of the tongue.\r\n\r\n\r\nChris Koerner (14:15.281)\r\nit's right there. All right, so I don't want to bias you. I just want to know your your gut take right off the bat. What's in your head right now?\r\n\r\n\r\nNikolas Hulewsky (14:24.23)\r\nI hate it. I like I really do hate it. Like, are you kidding me? Are you so I have four boys, you're telling me we got to go freaking let's get the socks wet, bring them out, put them on the baby, then put the wool over it like, yeah, my kids not going to sit through that. And then they're probably going to take the socks off as they're going to bed. I, I yeah.\r\n\r\n\r\nChris Koerner (14:43.758)\r\nWhat is the female version of bro science? This is like...\r\n\r\n\r\nNikolas Hulewsky (14:48.064)\r\nHo science. Ho science.\r\n\r\n\r\nChris Koerner (14:50.404)\r\nOkay, let's banana, banana, banana alert. Mohammed, please edit the.\r\n\r\n\r\nNikolas Hulewsky (14:54.858)\r\nDude, come on. That was so good. That was such a good joke, dude. That was such a good joke. If bro science isn't proven science for men, ho science is not proven science for women. I'm sorry.\r\n\r\n\r\nChris Koerner (15:01.06)\r\nI don't know. Oh.\r\n\r\n\r\nMohammed is not going to know where to go with this episode.\r\n\r\n\r\nNikolas Hulewsky (15:10.858)\r\nthe rules, dude. Yeah, that's where I go with that video. I'm sorry if I was supposed to go another direction.\r\n\r\n\r\nChris Koerner (15:12.036)\r\nChris Koerner (15:18.092)\r\njust no, no, you're you're you're right on target. I'm just so like done with these gross science like, all you got to do is put on a cold sock and lose 80 pounds like just come on. But this thing has like 10 million views here. So\r\n\r\n\r\nNikolas Hulewsky (15:33.472)\r\nWell, I think people are so desperate, they're desperate.\r\n\r\n\r\nChris Koerner (15:36.932)\r\nHow do we monetize this?\r\n\r\n\r\nNikolas Hulewsky (15:38.592)\r\ndirty boy. Okay. Okay. so the reason it has 10 million views is because people are desperate to figure out.\r\n\r\n\r\nChris Koerner (15:49.124)\r\nThere's demand. There's some sort of demand. Even if entertainment demand.\r\n\r\n\r\nNikolas Hulewsky (15:51.22)\r\nWhat's the problem? What was the problem in the beginning? It's that you don't have good circulation or does circulation help you sleep?\r\n\r\n\r\nChris Koerner (15:58.573)\r\nshe doesn't even say there's a there's a problem. She just says it helps with quote overall health.\r\n\r\n\r\nNikolas Hulewsky (16:01.076)\r\nNo one else.\r\n\r\n\r\nWell, yeah, I would make the problem clearer, obviously. But if the, and this for kids, it's not even for adults.\r\n\r\n\r\nChris Koerner (16:17.71)\r\nLike, yeah, so maybe the idea is to to market this at adults, like people buy much dumber stuff than this, right? Much dumber stuff.\r\n\r\n\r\nNikolas Hulewsky (16:25.398)\r\nyeah, much dumber stuff. I would market this at adults. As a parent, I'm going to guess she doesn't have any kids. Or she has like one daughter who's just an angel. But you know, anytime you layer two, three, four kids on top of it, I just, don't know how you do that. It's like, this is my child's bedtime routine. Starting at 6 PM, we read books. Then we take a bath. Then we take a walk. Then we watch the, then we journal. Then we do our gratitude. not done. And then we eat dinner. Then\r\n\r\n\r\nChris Koerner (16:50.19)\r\nWe'll end like, and-\r\n\r\n\r\nNikolas Hulewsky (16:54.336)\r\nThen I yell at her father for 17 minutes. She takes notes. Then we change. Then we go to the bathroom. Then we do breath work. And then by 9 30, 9 30, she's ready for bed at 9 45. She wakes up. I go in there. It's like, nobody has time for all that crap. So I would market this at adults.\r\n\r\n\r\nChris Koerner (16:59.972)\r\nThen we do breath work. Then we do our skincare routine.\r\n\r\n\r\nChris Koerner (17:13.752)\r\nYep. I don't. Yeah, I just the problem with this is like there's no before and after. Right? Like if it was like if it like removed a rash, and it like clearly worked, you could see that it worked. It's like, okay, there's something here. Here's an example. So when I was a teenager 1314, I had warts all over my hands. Yeah, it was gross. I hated it.\r\n\r\n\r\nNikolas Hulewsky (17:24.928)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (17:39.782)\r\nEw, dude. I shake those hands.\r\n\r\n\r\nChris Koerner (17:43.534)\r\nYou do now.\r\n\r\n\r\nI had warts and it was super embarrassing. And I remember, remember the desks at school that had like the cubby you put like your notebook and I would like keep my hands under my desk because I was so insecure about people seeing them. Yeah. And you will never believe it. What got rid of them. My mom was like, all right, we got to get them frozen off. And I'm like, Nope, not doing needles, not doing pain, not doing hard things. you\r\n\r\n\r\nNikolas Hulewsky (17:52.835)\r\nyeah.\r\n\r\n\r\nNikolas Hulewsky (17:57.705)\r\nI see that.\r\n\r\n\r\nNikolas Hulewsky (18:09.598)\r\nWashing them? Was that what got rid of them?\r\n\r\n\r\nChris Koerner (18:13.816)\r\nSo it turns out there's something to that.\r\n\r\n\r\nNikolas Hulewsky (18:15.346)\r\nIt's so crazy. I wash my hands twice a day and all of sudden they're gone.\r\n\r\n\r\nChris Koerner (18:17.814)\r\nall those signs in the restroom have some truth to them.\r\n\r\n\r\nNikolas Hulewsky (18:21.728)\r\nThey're not just for employees, even though they say for employees.\r\n\r\n\r\nChris Koerner (18:24.546)\r\nNo, someone told me once, and this is like the most bro science of the nineties ever, but it was take vitamin E gel pills, right? Just like from the grocery store vitamin E and pop them and rub the vitamin E gel all over your hands before bed. And then take two or three vitamin E pills before bed and then cover your hands with socks. Okay.\r\n\r\n\r\nto keep the moisture in to keep them on your hands and then go to sleep, fall asleep with socks on your hands and do that for like two weeks every single night. And when you wake up, you take more vitamin E pills. And I did that for two weeks and they completely disappear. Every single one of them. And I tried other things like other home remedies gone and they never came back. So could you monetize something like that? Little kit, little, little work remover kit.\r\n\r\n\r\nNikolas Hulewsky (18:54.496)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (19:05.652)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (19:15.264)\r\ntotally think you could monetize something like that. Here's a little wart. Get rid of that little wart. That little wart shows up. You're like, what's up little wart? You're like, is that a booger on my finger or a wart? I don't know. That's been a hard winner. Anyways, I think it's just human psychology in the SMB space. What's the sales pitch? You can buy a business for no money down. It's super easy. It's passive income.\r\n\r\n\r\nChris Koerner (19:23.608)\r\nThem little froggy bumps.\r\n\r\n\r\nChris Koerner (19:42.328)\r\nYeah, we all want a silver bullet. We all want, yeah.\r\n\r\n\r\nNikolas Hulewsky (19:44.904)\r\nIt's the same thing. It's the same thing, right? Like, you want better circulation? All you have to do is this one little trick or you want to lose 30 pounds? So I think.\r\n\r\n\r\nChris Koerner (19:52.172)\r\nand you can't prove that your circulation is better.\r\n\r\n\r\nNikolas Hulewsky (19:55.68)\r\nSo think if we're strictly talking about marketing and packaging it, I think that's a really good way to market and package something is to appeal to the what's the one thing that's going to solve everything and then build out around there. I think if I were to do something like that, water would be something. Right now, microplastics are big deal. Your family, just bought a steel drum. I don't even know what it's called.\r\n\r\n\r\nChris Koerner (20:10.276)\r\nYeah.\r\n\r\n\r\nChris Koerner (20:23.34)\r\nWe bought a burkey, but then we switched it out with a reverse osmosis under the sink.\r\n\r\n\r\nNikolas Hulewsky (20:27.136)\r\nwith a Ferkey. But I think something like that, has to be something like, you do this every day, people are reading about microplastics, that might be a cool wholesale business that you start selling those types of units.\r\n\r\n\r\nChris Koerner (20:38.787)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (20:42.884)\r\nSo like three years ago, I bought a bunch of domain names related to microplastics and I just got an offer for one of them because they're like listed on like a domain marketplace passively. I usually don't get offers for anything, but the domain name I got there that I got an offer for is never touched plastic.com. And I think there's a mark never touched plastic. So like buying food or drinks that have never like not like not PVC, not a plastic bottle, nothing.\r\n\r\n\r\nNikolas Hulewsky (20:53.92)\r\nOkay. Yeah.\r\n\r\n\r\nNikolas Hulewsky (21:02.144)\r\nNever touched or never touch.\r\n\r\n\r\nThat's a really good name. Gosh, dang it, that's a good name.\r\n\r\n\r\nChris Koerner (21:14.507)\r\nDang it.\r\n\r\n\r\nNikolas Hulewsky (21:15.616)\r\nI'm sorry.\r\n\r\n\r\nBanana.\r\n\r\n\r\nChris Koerner (21:18.916)\r\nWe got we got freaking rovers on Mars and we can't have a camera stay on. This is bull crap. This is bull crap.\r\n\r\n\r\nNikolas Hulewsky (21:24.864)\r\nI'm sorry.\r\n\r\n\r\nNikolas Hulewsky (21:29.152)\r\nI'm sorry.\r\n\r\n\r\nHold on.\r\n\r\n\r\nChris Koerner (21:31.971)\r\nDone!\r\n\r\n\r\nNikolas Hulewsky (21:40.99)\r\nWhat was the offer for?\r\n\r\n\r\nChris Koerner (21:43.32)\r\nnot very much, but just the fact that someone out there is looking for domain names around avoiding plastics.\r\n\r\n\r\nNikolas Hulewsky (21:50.088)\r\nYou know, it's interesting. I so I bought a domain in a couple years ago as a joke, but I got it. I got an email from another company as well. They're they're a plastic company. It's called micro peas.com and they want it because they're like, you know, no micro peas and then the website is no micro P.com and.\r\n\r\n\r\nChris Koerner (22:04.408)\r\nOkay.\r\n\r\n\r\nmoving. We're moving on from this.\r\n\r\n\r\nAlright, I'm gonna show you another video.\r\n\r\n\r\nNikolas Hulewsky (22:14.496)\r\nTo the one guy on YouTube who said I'm too immature, I'm sorry.\r\n\r\n\r\nChris Koerner (22:20.002)\r\nHey, here's who he is. Warts and all.\r\n\r\n\r\nNikolas Hulewsky (22:25.32)\r\nyou. You look like the cat who ate the canary.\r\n\r\n\r\nChris Koerner (22:30.766)\r\nAll right, here we go.\r\n\r\n\r\nYou ready for this one? All right, here we go.\r\n\r\n\r\nNikolas Hulewsky (22:42.213)\r\nthat audio is terrible.\r\n\r\n\r\nChris Koerner (22:47.063)\r\nAlright, that's it. That's the whole video.\r\n\r\n\r\nNikolas Hulewsky (22:50.054)\r\nOkay. Can you describe what was that? I don't even know what that was.\r\n\r\n\r\nChris Koerner (22:52.462)\r\nSo.\r\n\r\n\r\nIt's clearly in Asia. It's a maybe a seven year old girl in front of like a kind of like a claw machine vending machine. On the left side is an aquarium with live goldfish in there swimming around and she has like this plastic scoop and she has a joystick and she scoops it down and then some fish swim above it and she like catches a fish, a live fish in the scoop and then pulls it out above the water and then moves it over and then drops it in like a bin. And then we don't really know what happens to that poor fish. Is it like?\r\n\r\n\r\nNikolas Hulewsky (22:57.024)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (23:14.336)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (23:23.404)\r\nis a more interactive way of buying fish for your aquarium and you can pick them that way. Or I don't know. They're really small fish so you can't eat them. So I don't know what's going on here but it gave me a good idea of something that could be going on here. Okay. All right. Okay. So this this machine is being sold. The Instagram account that posted it is some random Chinese company that sells these live fish vending machines and you know we love vending machines around here. Right.\r\n\r\n\r\nNikolas Hulewsky (23:36.702)\r\nOkay, give me an idea for a framework as well. Keep going.\r\n\r\n\r\nNikolas Hulewsky (23:51.936)\r\nlove me a vending machine. Never met a vending machine I could refuse.\r\n\r\n\r\nChris Koerner (23:56.26)\r\nOkay, that's good. I never heard that one actually. So is it a new bit you're trying? I like it a little bit. Okay, so you take that machine on the left side is the fish tank with all the fish. And then on the right side, you get like a just a simple 10 gallon aquarium, you fill it with coral toys, it's crystal clear, it looks just like a fish paradise, and there's no fish in there. And on the left,\r\n\r\n\r\nNikolas Hulewsky (24:01.598)\r\nIt's a new bit! I'm trying it out! We'll see if it sticks! You.\r\n\r\n\r\nChris Koerner (24:25.858)\r\nYou just have fish packed to the brim, terrible living conditions. And the kids save the fish. Well, the left side looks like what we see in the video, right? It's just a bunch of fish, right? And the kids get to save them and put them in like fish paradise. pay, they pay money to move them over. And then at the end of the night, when the business closes down, you just put those suckers right back with the other fish. What do we think? What do we think? First principles.\r\n\r\n\r\nNikolas Hulewsky (24:30.368)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (24:36.576)\r\nMm-hmm. Mm-hmm. Mm-hmm. The natural habitat.\r\n\r\n\r\nNikolas Hulewsky (24:54.08)\r\nWhat if we started, what if we started a business with dogs? They're all in the same nine by nine kennel. There's 400 of them stacked up. You come in, you look at the dogs, you're like, oh, that dog looks like he's in trouble. You could save the dog today. So you put them at the dog park. But at the end of the day, we put the dogs back into kennel, baby. I hate that. But I do like the idea of this framework, which is if you're a business that sells things to kids, how?\r\n\r\n\r\nChris Koerner (25:05.54)\r\nYou could save him.\r\n\r\n\r\nNikolas Hulewsky (25:23.392)\r\nHow do you make it more attractive to the kid? And by this is what I mean. If you ever go to the store and your favorite child really wants something and they're just like.\r\n\r\n\r\nChris Koerner (25:35.817)\r\nMm Every single time I go to the store every three seconds.\r\n\r\n\r\nNikolas Hulewsky (25:39.102)\r\nreally, really want something. When do you give in?\r\n\r\n\r\nChris Koerner (25:44.621)\r\nI don't.\r\n\r\n\r\nNikolas Hulewsky (25:46.112)\r\nOkay, I give in. I'll give it every time, every other time. But you you give in when you're like, wow, yeah, Johnny has a hobby that does this, let's get that. Or like, it's a color, he's been asking for this. Okay, it's an impulse buy whatever. But either way, it's hard for a parent to say no. So how do you make the experience for the kid such that it's so great that it makes it even harder for the parent to say no? Here's an example.\r\n\r\n\r\nChris Koerner (25:47.844)\r\nMm-mm.\r\n\r\n\r\nNikolas Hulewsky (26:14.881)\r\nIf you're a dick sporting goods and you sell soccer balls, like leave some soccer balls, like leave a little pitch, let the kids play soccer with them. I know that's not like a hundred percent feasible, but I'm just painting the idea here. A Lego store have Legos out that the kids can play with, with the actual Lego set in a box. And then after they played with it, you know, they want to buy it. So this is that on steroids, right? There's fish. You scoop the fish out, you move it and plop it down. Daddy, I want the fish I just saved.\r\n\r\n\r\nChris Koerner (26:33.315)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (26:44.052)\r\nLike, how do you say no to the kid after they just saved a freaking goldfish in front of you? It's like, OK, yeah, I guess let's get the freaking goldfish. You're right.\r\n\r\n\r\nChris Koerner (26:47.908)\r\nMmm. Like you install these at like a PetSmart. Yeah. You make money on the vending machine, but it's really a big upsell ploy. They're paying you to be upsold.\r\n\r\n\r\nNikolas Hulewsky (26:53.03)\r\nexactly. You install them somewhere that people are going to make purchasing decisions anyways.\r\n\r\n\r\nNikolas Hulewsky (27:01.728)\r\nExactly. You don't have a sales guy walk in the floor. 100%. You don't have a sales guy walk in the floor to tell you all of the features. Oh, this puppy's really good because they're good breed and you can see why blah, blah. No, you let them go play with the freaking puppy for 20 minutes or you let them scoop out the fish or like that's going to be a much better sale than anybody trying to convince them. So I like that framework if you own a children's business.\r\n\r\n\r\nChris Koerner (27:03.65)\r\nLike going to an Alex Hormozi conference. You pay a lot of money to be upsold.\r\n\r\n\r\nChris Koerner (27:23.0)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (27:27.17)\r\nMm-hmm. Yeah. I like my idea too, I do. I do. I really do.\r\n\r\n\r\nNikolas Hulewsky (27:34.144)\r\nYou're a dirty dog, man. You're freaking crazy, bro. I don't think like FEMA's like not even going to approve that, bro. I don't know. I don't know. I don't know. I'm just spitting. I'm just spitting here.\r\n\r\n\r\nChris Koerner (27:40.654)\r\nFEMA, Emergency Management Association.\r\n\r\n\r\nAlright, I got another one for you.\r\n\r\n\r\nChris Koerner (27:54.82)\r\nLet's see.\r\n\r\n\r\nNikolas Hulewsky (27:55.872)\r\nHere, while you're pulling that up, I'm gonna shut my camera off for a second. Cause you're gonna take a second to...\r\n\r\n\r\nChris Koerner (28:01.262)\r\nI'm ready.\r\n\r\n\r\nNikolas Hulewsky (28:09.312)\r\nthese all saved videos by the way? Okay. All right. What's next?\r\n\r\n\r\nChris Koerner (28:09.657)\r\nYeah, they're bookmarked\r\n\r\n\r\nHere we go.\r\n\r\n\r\nNikolas Hulewsky (28:18.269)\r\nWow.\r\n\r\n\r\nChris Koerner (28:40.408)\r\nAll right, tell us what's going on here, Nick.\r\n\r\n\r\nNikolas Hulewsky (28:41.342)\r\nOkay, first of all,\r\n\r\n\r\nI don't know. I don't know the video clips. I can't even, I don't even know. I know there's dogs involved and there's a car and that, and that it's like somehow mobile, but I don't really know what their product is. Cause like, it's like, wouldn't stay long enough on any one thing. Is this, is this because we're too ADHD or is this because they're an idiot?\r\n\r\n\r\nChris Koerner (28:46.84)\r\nI like every cut is like half a second.\r\n\r\n\r\nChris Koerner (29:05.188)\r\nIt's probably a combo. I mean we're idiots too, right? I'm not saying anything you don't already know, right?\r\n\r\n\r\nNikolas Hulewsky (29:05.898)\r\nThat's So what is this? This is pink car.\r\n\r\n\r\nNikolas Hulewsky (29:18.216)\r\nSo what do we just watch? A pink car, some type of pet grooming?\r\n\r\n\r\nChris Koerner (29:21.218)\r\nYou wouldn't, you wouldn't know what's happening here unless you read the caption. So what we just watched was this millennial woman that opened a mobile bookstore. It's this pink car that she put bookshelves on the back of and it's a book and she rolls up to events, farmers markets, conferences, and she specifically sells romance novels from a mobile, like very niche, but supposedly she's doing really well.\r\n\r\n\r\nNikolas Hulewsky (29:47.946)\r\nWhat's the name of her Instagram account?\r\n\r\n\r\nChris Koerner (29:50.18)\r\nGood girl books Knox as in Knoxville. think she's in Knoxville.\r\n\r\n\r\nNikolas Hulewsky (29:57.44)\r\nHey, good girl books knocks. You need to figure out what you do. Okay. Cause that video, I had no idea you sell freaking romance novels in a mobile unit. thought, thought it was a dog grooming business that you could like read books to. I had no idea.\r\n\r\n\r\nChris Koerner (30:09.774)\r\nHer dog, her dog was in it a lot. You had all summer to think about it.\r\n\r\n\r\nNikolas Hulewsky (30:15.976)\r\nYou need to figure out what you do with your marketing team.\r\n\r\n\r\nChris Koerner (30:19.78)\r\nSo many I think you should leave references to.\r\n\r\n\r\nNikolas Hulewsky (30:22.4)\r\nThat's a weird business. A mobile bookstore? Like Apple Bookstore or Amazon?\r\n\r\n\r\nChris Koerner (30:27.948)\r\nMm-hmm. Yeah.\r\n\r\n\r\nChris Koerner (30:34.468)\r\nphysical books. So I think this is interesting. What if, for instance, what if you had a mobile bookstore of business books and you rolled up to Main Street in Columbia, Missouri and you parked right outside the atrium? You think you wouldn't sell some books there?\r\n\r\n\r\nNikolas Hulewsky (30:49.536)\r\na good idea. Can I tell you something? I know I've mentioned Craig, but it's just because I just interviewed him. I asked him. I was like, he buys all these media properties up, magazines in particular. He focuses on magazines. like, do you keep the magazines? Everybody's getting rid of print. You're keeping the magazines. And he's like, there's something very interesting. You are indestructible when you're holding a book or a magazine in your hand.\r\n\r\n\r\nThink about that. If you're on Facebook, if you're on Twitter, if you're on your Instagram, on your phone, bling notification, bling, I got a like, I got a text, but you could be watching anything, but your attention is not necessarily fully there. You bring up a book or a magazine or something, you're indistractable, right? Isn't it freaking great? So even though I crapped on her video, because it was just so confusing, I didn't know what the freak I was looking at.\r\n\r\n\r\nChris Koerner (31:24.204)\r\nMm-hmm. Yeah. It's not. Yeah.\r\n\r\n\r\nChris Koerner (31:32.708)\r\nThat's such a good framework.\r\n\r\n\r\nNikolas Hulewsky (31:43.338)\r\nI think it's a great idea because you're bringing the book to them, they're indistractable and you have their attention. And now you got to be careful and smart about how you use their attention. I really, gosh dang it, I really liked that idea because it's almost like we've swung so hard towards digital that people are now willing to pay a premium for physical experiences. And this plays into that. It's a great idea.\r\n\r\n\r\nChris Koerner (31:49.572)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (32:03.576)\r\nYeah. I mean, you could work with a major publisher like Penguin and buy their books at wholesale and just follow conferences around like very niche conferences and only supply those types of books.\r\n\r\n\r\nNikolas Hulewsky (32:14.228)\r\nDude, CES is going on right now. The consumer electronics show. There we go. Park out there. They were like seeing all these digital products all day and then you just have a book or whatever that comes out. Yeah, you're probably gonna get a small percentage of people who are gonna come and look at it, but they're gonna, people will come and look at that stuff. That's a great idea. Conferences, business conferences in particular, man. That's a great idea.\r\n\r\n\r\nChris Koerner (32:18.104)\r\nYeah. Show show.\r\n\r\n\r\nChris Koerner (32:23.896)\r\nI\r\n\r\n\r\nChris Koerner (32:34.061)\r\nYeah.\r\n\r\n\r\nChris Koerner (32:39.192)\r\nAnd just like any, any vending concept or mobile concept or like party bus concept or food truck concept that's on wheels and different and unique. Like you already, people look at it with a positive confirmation bias because it's unique. It's like, turns heads. It's like, huh, even if the idea itself is bad, it's made better by the fact that it's new and unique and fresh. That makes sense.\r\n\r\n\r\nNikolas Hulewsky (32:55.52)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (33:02.078)\r\nIt is. Yeah, it does make sense. And you can do something I think you'd want to do something that is unique. So this is what I mean by it. Let's say they sell Lord of the Rings books because that's one of the books that I know. Could I buy a Lord of the Rings book on Amazon? Easily. Send it to me. Other than it's in person and you're going to like this mobile book, like what else could you do? Maybe there's a QR code with every single one of them that links to something. Maybe there's, I don't know.\r\n\r\n\r\nChris Koerner (33:27.534)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (33:30.688)\r\ncustom bookmarks. I just think there'd have to be something else that's like, oh, the mobile book place is coming. I know I could get this book on Amazon, but I like them because of X, Y, and Z.\r\n\r\n\r\nChris Koerner (33:41.016)\r\nYeah, dude, I love the word indistractable. I don't think I've ever heard that word. And wow, wow.\r\n\r\n\r\nNikolas Hulewsky (33:46.08)\r\nI made it up. He said the same thing. I'm dead serious. He said the same thing to me. He's like, it's a really good word. You're indestructible.\r\n\r\n\r\nChris Koerner (33:53.678)\r\nWell, it makes, was watching, there's a documentary about Jerry Springer right now and Jesse and I were watching it last night. Okay. Remember Jerry Springer?\r\n\r\n\r\nNikolas Hulewsky (34:02.442)\r\nHmm, do I remember Terry Springer? I don't know. Is this your girlfriend's mom's brother that you had sex with? you kid-\r\n\r\n\r\nOf I know what Jerry Spurrier did.\r\n\r\n\r\nChris Koerner (34:12.524)\r\nYes, so that his producer said something really interesting. You're going to like this. You're going to like this. He said we wanted something to be happening on the screen at all times to where if you're flipping channels with the sound off, you would stop.\r\n\r\n\r\nAnd like their craziest episode ever, which you probably never heard about because they aired it and they aired everything in New York City first. But then this was so crazy that they stopped airing it. It was a guy that divorced his wife and married his donkey and brought his donkey on the show with him and like was French kissing the donkey on the show. OK, and the still image of that was a guy was a guy sitting next to his donkey and it said, you marry your donkey like you can't tell me if you're\r\n\r\n\r\nNikolas Hulewsky (34:51.872)\r\nWas it Shrek?\r\n\r\n\r\nChris Koerner (34:59.396)\r\nBecause flipping channels back in the day is the same thing as swiping on social media. Every platform just wants us to stop swiping or stop scrolling and to stay on their app. It's the same principle. It's first principles. And did you realize that he was rated higher than Oprah for a time?\r\n\r\n\r\nNikolas Hulewsky (35:08.32)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (35:18.078)\r\nnot surprised. I didn't know that, but yeah, I'm not surprised.\r\n\r\n\r\nChris Koerner (35:20.344)\r\nSo back then the ratings were like, if you had 2 million views per episode, you were solid.\r\n\r\n\r\nNikolas Hulewsky (35:27.776)\r\nSorry, 10, we're close.\r\n\r\n\r\nChris Koerner (35:28.74)\r\nYou\r\n\r\n\r\nNikolas Hulewsky (35:34.772)\r\nI want to see this episode now. Yeah, just well, I you could keep talking because they're going to we're going to cut away from my camera anyways.\r\n\r\n\r\nChris Koerner (35:34.86)\r\nI just wait.\r\n\r\n\r\nChris Koerner (35:39.862)\r\nOkay, okay, okay. So back in the day, there were like 20 talk shows. This is like late 90s, I believe mid to late 90s. And to get a rating of two as in 2 million viewers, that was like pretty solid. Like it just meant you weren't gonna get canceled wasn't amazing, but but solid. Oprah was at 1616 million viewers per episode. Jerry Springer his first show was like one\r\n\r\n\r\none and a half million viewers per episode. It was like, okay. And it was just like, he would like reunite people that hadn't seen each other for 30 years. It was kind of like a heartwarming show, which I had no idea he started as that. And then someone had the idea to just go off the rails and no one had ever done that before. And they described it as, like the gladiator, the television version of gladiator, like the modern day gladiator, cause it was just people fighting like on a stage. Right. And he, after, after that donkey episode,\r\n\r\n\r\nNikolas Hulewsky (36:15.154)\r\nMm-hmm. That's so crazy.\r\n\r\n\r\nNikolas Hulewsky (36:30.132)\r\nYeah, yeah, yeah. Yeah.\r\n\r\n\r\nChris Koerner (36:36.246)\r\nhis ratings were higher than Oprah's for a time, which is like to think that like two, two million is solid. Oprah was at 16 million. Jerry was at 17, 18 million. Crazy. It's crazy. And so like if you're on like Tik TOK or Instagram and you're swiping, you will see that principle in action where, like 30 % of people that look at short form video have their sound off. Right. And so you'll see crazy hooks that have a hundred million views. Like this one common hook is a guy standing in the middle of a road.\r\n\r\n\r\nNikolas Hulewsky (36:39.775)\r\nmy gosh.\r\n\r\n\r\nNikolas Hulewsky (36:46.514)\r\nIt's insane. That is insane.\r\n\r\n\r\nChris Koerner (37:06.072)\r\nwith a rope tied around his neck and arm. And the other end of the rope is tied to a car and the car will be speeding away from him. And like, so the assumption is this guy's about to get thrown backwards because he's tied to the car and you will not scroll past that if you see it. And so people are just doing more and more outlandish things to stop the scroll. And it's just, that's humans, it's first principles.\r\n\r\n\r\nNikolas Hulewsky (37:16.885)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (37:20.554)\r\nRight, right, right, right, right.\r\n\r\n\r\nNikolas Hulewsky (37:32.094)\r\nYeah, I didn't, I didn't, actually didn't make up the word indistractable, but I thought that was a really interesting framework that he gave, which is like, I'm like, he's not going to go away from the magazine because people are indistractable. they're, they were a hundred percent focused on it. So somehow bringing these types of businesses into the real world, whether it's through a community, whether it's a product that kind of floats around, I, really like it.\r\n\r\n\r\nChris Koerner (37:44.44)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (37:58.296)\r\nOr like you said, it could be like all signed copies, like something unique about the book, like a limited print or first edition or something that would be even better.\r\n\r\n\r\nNikolas Hulewsky (38:06.292)\r\nYeah. You know who Scott Galloway is. I heard him talking recently about, and maybe it Scott Galloway. I don't know. They all run together. But he was talking about that our economy is an addiction economy. He's like, look at the biggest companies of all time. You've got pharmaceutical companies, tobacco companies that were selling cigarettes. Well, that was his point. He's like, Google, Facebook, Apple, they are trying to get your attention. They're trying to keep you addicted to the product.\r\n\r\n\r\nChris Koerner (38:10.777)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (38:25.762)\r\nApple.\r\n\r\n\r\nChris Koerner (38:35.897)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (38:36.232)\r\nWe're in an addiction economy. And in this instance, your attention is what they're trying to capture, right? And I think it's interesting to think about ways to bring people off platform, ways to get people to focus on you and be, you know, to not be distracted. The first idea that we talked about, whether the Tonka trucks that are digging in the sand, you're indistractable, right? Like you're focused, laser focused 100 % on digging that hole or whatever.\r\n\r\n\r\nChris Koerner (38:43.204)\r\nMmm.\r\n\r\n\r\nChris Koerner (39:03.976)\r\nMm Yeah.\r\n\r\n\r\nNikolas Hulewsky (39:06.26)\r\nSo creating environments where you can be laser focused and not distracted, I think, is a good framework to think about for businesses that are bringing people in to their product.\r\n\r\n\r\nChris Koerner (39:15.972)\r\nYeah, someone I saw something online where someone was talking crap about parents like you and I frankly that I mean any any parent is on their phone around their kids occasionally, right? Some of us more than others and I try to be conscious about it. When my kids are with me around me, I try to be off my phone less very hard, but it's tough and it's an addiction. But I was reading like back in the 50s, 60s, 70s. It was the same thing. It was just the newspaper like the dad would get home from work. He would sit in the armchair.\r\n\r\n\r\nHe would open the newspaper. Dad, look what I did at school today. And he's just in like, it's first principles. We're humans. We're creatures of habit. We get addicted to stuff. So let's sell cigarettes. What?\r\n\r\n\r\nNikolas Hulewsky (39:55.22)\r\nNo, it's hard. I spent two hours wrestling with my... spent two hours wrestling with my kids last night. And I've been, I mean, it's stupid, but I've been trying to, when I get home, just wrestle. Put my phone away and just wrestle. it's like, they're only going to be young for a small period of time. And I don't want them to make, like to do an imitation of me looking at my phone or on my phone or like whatever that is. So I do try to make time to mess around with them.\r\n\r\n\r\nI was sweating, dude. It was a freaking workout. My kids are big. It's a problem. I do though. Yeah, let's call it. This is a good one.\r\n\r\n\r\nChris Koerner (40:30.392)\r\nYou got some big boys.\r\n\r\n\r\nChris Koerner (40:34.5)\r\nShould we call it?\r\n\r\n\r\nOr we could do another one, but.\r\n\r\n\r\nNikolas Hulewsky (40:41.504)\r\nNo, I think it's All right, see you next time.\r\n\r\n\r\nChris Koerner (40:41.816)\r\nYeah, we can do it. Cool. All right.",
  "metadata": {
    "duration": "",
    "date": "2025-01-17",
    "platform_source": "Google Drive"
  }
}