{
  "episode_number": "95",
  "episode_title": "How This Entrepreneur Built a $1.2M/Month Outsourcing Empire with Nathan Yap",
  "guest_name": "Nathan Yap",
  "business_name": "Support Zebra",
  "transcript": "﻿Nik (00:00.62)\r\nAll right, Nathan, welcome to Niconomics. I'm stoked to have you here. Why don't we just get into some meat and potatoes? Tell me, what is your business and how do you make money?\r\n\r\n\r\nNathan (00:10.069)\r\nMy business is Support Zebra and we help fast growing either SaaS or e -com companies scale by turning customer requests into brand ambassadors. So we do that through full end -to -end customer service solutions. In traditional R2D call center.\r\n\r\n\r\nNik (00:25.998)\r\nturning. Okay, so for me, I'm a I'm an idiot. So that'll be helpful for me to say call center. You have a call center. Are they doing all inbound? Like is this all? Hey, I'm a growing SaaS company and I need someone to handle these leads that are coming in. Can you please take the phone for me? Or is this also outbound?\r\n\r\n\r\nNathan (00:44.181)\r\nWe do a component of AppBound, but AppBound is only when it comes to callbacks or we don't do any lead gen, we don't do any outbound sales initiatives.\r\n\r\n\r\nNik (00:53.762)\r\nAnd your target customer are SaaS companies.\r\n\r\n\r\nNathan (00:56.297)\r\nSAS and Ecom. Yeah, so really quickly, to say what we do is you come to us, you're a SAS company, you've got product market fit, you're scaling, you can't handle the volume of requests, you can't handle the, your wait times are getting super long, you want to focus on growth. So we come in, all of our project manager, Accenture project managers, they come in and they literally, it's like a consulting project. Hey, Nick, let's define what your goals are for customer service. I want...\r\n\r\n\r\nCSAT customer service satisfaction to be this. I want my average wait time to be this. We then build out an architect, full game plan. We'll build out your playbooks, your processes, your KPIs, your dashboard. We'll build out your training programs. We then hire the team. And then I think the most important, but the overlooked part of it is that we'll manage that team evergreen. So like the daily huddles, the weekly business reviews, the monthly reviews.\r\n\r\n\r\nwill architect and give out like a midterm and long -term AI strategy. And we actually have 15 devs on our innovations team that will build out efficiencies and automations for your customer service functions. It's a whole holistic customer service function in a box.\r\n\r\n\r\nNik (02:09.774)\r\nAll right, so call center does not do it justice. You're more of a sales team.\r\n\r\n\r\nNathan (02:15.807)\r\nI hate the word call center because I feel like it just brings up like, like everybody has had like a bad call with Comcast or Sprint and I'm like, my gosh. I think it gives us a bad rap. So yes, we are much more than a call.\r\n\r\n\r\nNik (02:25.292)\r\nYeah.\r\n\r\n\r\nNik (02:31.278)\r\nYou're an outsourced sales team.\r\n\r\n\r\nNathan (02:34.313)\r\nWe tell clients that we want to be your, and we will serve as your outsourced CX customer service solutions and strategy partner. Yeah.\r\n\r\n\r\nNik (02:44.566)\r\nOkay. Do they ever outgrow you? Do they ever bring it in -house?\r\n\r\n\r\nNathan (02:49.429)\r\nThey can and they have it's happened once in, I started this in 2009, so it happened once in the 15 years that we've.\r\n\r\n\r\nNik (02:59.628)\r\nOkay, so not never because I could see myself as a company me like, okay, cool. Yeah, I'll use him for a little bit. But eventually, I'm going to bring this in house and then eventually never comes you know, you do such a good job. They're literally a part of your team. Why would you ever bring it in house?\r\n\r\n\r\nNathan (03:13.205)\r\nYeah, mean, all the big, especially like telecom is huge, airlines are huge, are huge buyers of outsourcing. They all have massive, massive teams. think like Comcast has upwards of 25 ,000 folks on their outsourcing team spread globally. Yeah. T -Mobile has 10, 20 ,000. Uber has like 25 ,000. So, and that's to the point where they're like vendor managers where they have\r\n\r\n\r\nNik (03:31.293)\r\nmy gosh.\r\n\r\n\r\nNathan (03:42.933)\r\n10 different outsourcing companies and they stack rank and see which ones, how they want to allocate spend between each one. But on a smaller scale, like for startups or mid -sized businesses, like you don't just get the agent or the team of agents, you get a team lead, you get a team lead manage, like the project manager, day -to -day performance, you get a QA that's checking the interactions, making sure they're following the script, making sure that, or the framework, make sure they're flagging any calls that where the customer's obviously pissed off.\r\n\r\n\r\nNik (03:42.957)\r\nHmm.\r\n\r\n\r\nNathan (04:12.319)\r\nWe have a workforce manager that helps with staffing and optimizes your staffing levels. We have a trainer that builds out all the training content. I guess a whole army, right?\r\n\r\n\r\nNik (04:19.882)\r\nOkay, dude. All right, I want to get into that. My first question though is there's lots of people, especially on social media, who have had outsourced experience, right? You've got Nick Huber who has, it's now somewhere, but it's, know, was support Shepherd, John Matzner's got Sagan. Anyways, there's like a group of people who are working on this virtual assistant or outsourced kind of business model.\r\n\r\n\r\nBut to me, most of those companies that they're describing are fairly small or like growing into what they want to become. To hear you describe the fact that you like a customer service rep and an implementation manager and a QA and all the other stuff that you named, I'm guessing you're not a small company. Can you give me an idea of like, how big is this company?\r\n\r\n\r\nNathan (05:12.725)\r\nSure. Well, from a team size, we have over 1 ,000 team members between Philippines and Mexico currently. Revenue -wise, we're doing right at like $1 .2 million a month in MRR, in recurring revenue. Yeah.\r\n\r\n\r\nNik (05:25.742)\r\nThat's amazing. How long has it been that way? is this a business? I think you said you started in 2009. Has it just been growing steadily or did you explode and then, you know, kind of steady or?\r\n\r\n\r\nNathan (05:39.221)\r\nCOVID was a catalyst. I want to, I know you have a lot of startup folks that listen to your podcast, to the podcast. I want to take it back to like reality on how it originally started, if that works. So starting in 2009, we had no idea what we were doing. We had a hospice that needed some medical billing work. It was being outsourced to another company we weren't really happy with.\r\n\r\n\r\nNik (05:52.546)\r\nYeah, let's do it. Yeah.\r\n\r\n\r\nNathan (06:08.083)\r\nthe service that we were getting, we found out was being outsourced to the Philippines. So we said, okay, let's just bring that in -house. went to the, my family's from the Philippines. So that's like my unfair advantage. My family's from the Philippines. My parents are here in the U S but Tuna relatives over there, all of them are in business over there. whenever the Philippines set up our own office and then kind of grew from there and we didn't know what we didn't know. We thought if we built it, they would come. And so the first,\r\n\r\n\r\nThe first like probably three to five years, think we almost shut the doors several times, at least three times.\r\n\r\n\r\nI completely underestimated the IT part of things, like keeping a call center online 24 -7, like redundancy, infrastructure. This is way before cloud. Multiple internet and fiber lines coming in, natural disasters in the Philippines, like underestimated that. Very underestimated the whole management piece of just managing people. Like when people are your product, there's not just\r\n\r\n\r\nNik (06:59.757)\r\nMmm.\r\n\r\n\r\nNathan (07:21.717)\r\nLike software doesn't talk back to you. Software doesn't have love triangles at the office or drama. So this was all new to me as well. And then this is my first go at figuring out distribution and sales too. all of that, like I was a very young, I mean to put in context, 2009, I was 22 when I started it. like,\r\n\r\n\r\nNik (07:23.128)\r\nTotally agree.\r\n\r\n\r\nNathan (07:51.719)\r\na year out of college.\r\n\r\n\r\nNik (07:53.6)\r\nYeah, man. what, so was it the medical billing company that you're using with the hospice that kind of spurred this thought of let's go to the Philippines and find people that can work with us?\r\n\r\n\r\nNathan (08:03.827)\r\nYeah, so the EMR that we're using is a, you're from the hostage space, we were using Solow and we were using their revenue management, revenue cycle management. And so it ended up being outsourced to the Philippines and we thought we could do a better job and turn around, especially the parts of the Medicaid building process were tedious that we could do faster. So we set up an office there and then when we...\r\n\r\n\r\nNik (08:10.284)\r\nYeah. OK.\r\n\r\n\r\nNathan (08:33.173)\r\nsaw how much our outcomes changed and how much we liked it. We said, I think this is going be an actual business. And then we started with friends and family and said, hey, can you add five people here or 10 people here? And that was the impetus for starting Support Zebra.\r\n\r\n\r\nNik (08:49.752)\r\nHow often were you going to the Philippines? was it like once a year and you were just managing remotely?\r\n\r\n\r\nNathan (08:55.157)\r\nAt his peak, was probably going quarterly every couple of months. Fortunately, my business partner, my first cousin, Nino, lives there and is based there full time. so he was our managing director, basically a country head of the Philippines. Now he's our chief culture officer, chief people and culture officer. And so he manages the operations side of things in the Philippines full time.\r\n\r\n\r\nNik (08:59.767)\r\nOkay.\r\n\r\n\r\nNik (09:20.494)\r\nI mean, cause that would freak me out doing something, doing something international, setting up that much of your business. But obviously you have family there and thankfully you have a, sounds like you have a cousin who's also your business partner. Is he, he's based in the Philippines.\r\n\r\n\r\nNathan (09:34.847)\r\nBased in the Philippines, based in our headquarters. So that is a huge unfair advantage for sure. Not to worry about like the trust factor and it's.\r\n\r\n\r\nNik (09:37.816)\r\nDude.\r\n\r\n\r\nYeah.\r\n\r\n\r\nNik (09:44.802)\r\nHow common was using the Philippines as a call center for not large corporations, but like small and medium sized businesses back then?\r\n\r\n\r\nNathan (09:57.269)\r\nI'm going to try to remember this,\r\n\r\n\r\nNik (09:59.502)\r\nBecause it's obviously grown in popularity, right? am I, do I just not, no, okay.\r\n\r\n\r\nNathan (10:03.583)\r\nLike I think somewhere and Sagan and have put a ton of light on the Philippines as an outsourcing destination as a whole. And I think that all kind of relatively recently, especially for the small SMB where like I need to hire one person or I need to hire two people. I think that's only in the last couple of years that it's really become like, well, actually, you know what? I take that back. Tim Ferris, the four hour work week. Like I can hire a VA for in the Philippines.\r\n\r\n\r\nThat was a big publicity boost, but I think it's only now becoming mainstream.\r\n\r\n\r\nNik (10:41.038)\r\nSo for a lot of people, they're looking at this and they're like, my gosh, this guy's got a thousand employees, $1 .2 million a month in MRR. That must be nice to, you he's young, but you know, they forget about 2009, 2010, 2011, like not just scaling a business during that time, but dude, the great financial crisis was legit. You and I are about the same age actually. So you're 39, 40ish, 37.\r\n\r\n\r\nNathan (11:08.597)\r\n37.\r\n\r\n\r\nNik (11:10.574)\r\nOkay, so I'm 38 and like going through that time, you just didn't know what was going to happen. was like every day there is this massive change to the macro economic environment. What did the first few years look like and who were your core customers when you launched?\r\n\r\n\r\nNathan (11:12.596)\r\nOkay.\r\n\r\n\r\nNathan (11:24.917)\r\nDo want me to give you a side story about on a business before that was affected by the the. Yeah, so right after college, well, graduated from college, I told you I had a strong connection to the Philippines of family member of mine said, hey, check out this mining project. I think it has a ton of legs. There's coppers being used everywhere as being used in manufacturing. But you should come over here and see what you can do here. It's like, OK, so me.\r\n\r\n\r\nNik (11:29.515)\r\nabsolutely, are you kidding me? Yeah.\r\n\r\n\r\nNathan (11:53.845)\r\nMy business partner now, MTS and his cousin went to the Philippines. 21, 22 year olds fresh went over to the Philippines, met with this mining site, like a mining company there. They needed, they couldn't find distribution. So we said, okay, I want to be your international agent. They're only selling locally. Let's go there. So we signed exclusive export rights with them. And we went over to the, yeah, so we went over to China.\r\n\r\n\r\nNik (12:21.229)\r\nWhat?\r\n\r\n\r\nNathan (12:25.865)\r\nlooked at like tap everybody on our network. My family is my dad's side of the family is Chinese. So went over to the China. He had a family member that's in the director of foreign affairs or is in the foreign affairs department there. And then we also went to Alibaba was huge there. So we just blasted anybody like do you need raw copper ore from the Philippines? We signed a letter of credit. We I mean,\r\n\r\n\r\nEventually, was all test shipments. Initial test shipments was a couple hundred thousand dollars. And then if that test shipment went well, it would have been millions of dollars a month coming in the door. And then we were like, this is it. We made it. We don't have to work. We've already made it. And so part of the letter of credit, the requirements for it to be paid has to be X percent copper so that you don't have a bunch of unusable\r\n\r\n\r\nNik (12:57.615)\r\nmy god.\r\n\r\n\r\nNik (13:21.9)\r\nYeah, they're worried about the purity of the copper.\r\n\r\n\r\nNathan (13:24.373)\r\nworry about the purity, they don't want to waste it's being shipped over in a container or in a barge. You don't want to waste shipping rocks that don't have any copper content. And this is May 2008 or no August 2008, right after graduation, right at the height of the commodities bubble. And so at the peak raw or grade A copper was 9000 a ton. When we left and came back to the US, it was under 4000 a ton. So like\r\n\r\n\r\nNik (13:31.406)\r\nGot it. Yep.\r\n\r\n\r\nNik (13:52.644)\r\nmy gosh.\r\n\r\n\r\nNathan (13:54.121)\r\nall of our assumptions and all of our pricing, all of that went out the window. Yeah, so that business died. We put some down payments on initial stocks that we obviously were never able to get back. So\r\n\r\n\r\nNik (14:00.886)\r\nWell, did you lose anything on that business?\r\n\r\n\r\nNik (14:13.198)\r\nOkay, but you didn't have like a, I don't know, $3 million order, okay.\r\n\r\n\r\nNathan (14:17.205)\r\nNo, I want to say we put down 15 ,000, 15 to 20 ,000 that we borrowed from parents for like like as a hold or as a hold on that on that initial inventory and stuff. And so that had a very quick death. We came back to the came back to the US. I took an offer as a staff accountant right before that I had before graduation. I went back to them said, hey,\r\n\r\n\r\nStartup life didn't work out so well, which we had me. then worked for my, basically had like a year and a half corporate stint as my only corporate experience. So.\r\n\r\n\r\nNik (14:57.602)\r\nAnd then you went and started the hospice and then you went and started the outsource company as well at the same time. Well, crazily enough, like copper is making a comeback right now. There's a shortage worldwide. The copper is off the charts. What did that experience teach you? Like, what did you take from that experience?\r\n\r\n\r\nNathan (15:03.199)\r\nYeah.\r\n\r\n\r\nNathan (15:08.437)\r\nYeah.\r\n\r\n\r\nNathan (15:18.249)\r\nDon't count your eggs before they've hatched. Don't count your chickens before they hatch, whatever that quote is.\r\n\r\n\r\nNik (15:22.967)\r\nYeah, yeah.\r\n\r\n\r\nNathan (15:29.193)\r\nThere's no free lunch. Like we thought that it was going to be super easy.\r\n\r\n\r\nNik (15:32.846)\r\nHow did that experience change your approach to launching this company? I'm gonna call it a call center, but to launching the call center in the Philippines, because I would probably be freaked out. First of all, you're the United Nations over here, freaking dads, Chinese, your mom's Filipina. Somehow you're getting in with the foreign services government, I don't even know person in China, but you also have relatives in the Philippines to staff your call center, so freaking kudos to you. That's an amazing, unfair advantage.\r\n\r\n\r\nDid it freak you out a little bit to start this business and have it have such an international component to it?\r\n\r\n\r\nNathan (16:07.455)\r\nSo I want to be clear to both you and your audience. It sounds like we had this all planned out, like we became experts overnight. When we were doing the whole copper mining thing, if you picked up a rock and you picked up copper ore, I would not be able to tell the difference between the two. We went into it completely oblivious, having no idea about mining or distribution works.\r\n\r\n\r\nI think one thing we were fearless in cold calling to calling competitors, cold calling buyers, cold calling sellers. I remember when we were figuring out like, yeah, we'll send you an LC and we can do the first test ship. it's like, I don't even know what an LC is. Let me Google that really quick. that's a letter of credit. How does that work? Who do I know that that's done letter of credits before with import and export? So we were figuring it out on the fly, 100%.\r\n\r\n\r\nNik (17:02.67)\r\nOkay.\r\n\r\n\r\nNathan (17:06.197)\r\nDon't let me fool you that we came in.\r\n\r\n\r\nNik (17:07.47)\r\nI know, I've heard this quote before, like there's a there needs to be a balance, especially with founders who do anything significant of smarts and ambition, but naivete. Because if you knew everything upfront, you know, many people just give up, they're like, it's too hard, right. But you need that sort of unknown like inexperience, because that's what keeps your optimism, optimism. That's what keeps you taking these bets or making these\r\n\r\n\r\nguesses, I guess, to kind of keep moving forward. So I get it, man. You are learning on the fly, but what a valuable experience. Like that is, I know it sucks that at the time, I'm sure you're like, my gosh, my life is over. I'm never going to be an entrepreneur. Maybe not, but that's how I would have reacted to it. But the experience of that just must, it's just incredible.\r\n\r\n\r\nNathan (17:56.437)\r\nYeah, I think also really the value and the power of trust. Now I'm in the business for 15 years and have a very trusted network of partners and vendors when it comes to marketing or paid media or SEO, website building, whatever. I have that trusted network and circle where I can call it, hey, I'm starting a new entity.\r\n\r\n\r\nHere's our legal formation websites on that like.\r\n\r\n\r\nI take that for granted now, but starting off, you have to go through, you have to vet a ton of folks. so I think power of trust and building your networks, I think is a huge, huge thing. And I think also the hospice company exposed me to EO very early on. So think I joined EO when I was like 24. And everybody there were much older than, the average age was much older than I was. And so,\r\n\r\n\r\nSeeing all that, it was just like a shortcut of like, wow, this is how folks with Successful Business act and how they interact with other people and here's experience share around sales or marketing or management.\r\n\r\n\r\nNik (19:13.934)\r\nSo when you started though, backing up to support Zebra in its inception, was there a core offering or a core demographic? Like what was the original thesis? We're gonna do medical billing for hospice companies? Was that how you started it? No.\r\n\r\n\r\nNathan (19:28.199)\r\nNo, I mean, our core thesis was if you're willing to write a check, you are our ideal client profile. So whatever you need in terms of outsourcing, you're willing to pay for it. We do exactly what you want us to do.\r\n\r\n\r\nNik (19:44.434)\r\nWhen did you sort of evolve to this focus on SaaS? Because I think it seems like a very smart strategy, but why did you end up settling on SaaS and how did you get there?\r\n\r\n\r\nNathan (19:56.533)\r\nThat's fairly recently, so probably in the last four five years. So for the first 10 years, we were just general outsourcing specialists. You have a need, general customer service outsourcing specialist. You have a customer service need, go and we can figure out a solution for you. And then.\r\n\r\n\r\nwe looked at our client list and it was very heavily focused on SaaS and e -comm. We just because of the first 10 years we don't have where we didn't have any filters. We have healthcare, fintech, retail, distribution. We have clients all over the place. But when we looked at it like SaaS and e -comm were the clients that were really growing and where the revenue year over year was increasing to us. It was a, we felt like it's a growing industry and continue and will continue to be a growing industry. And so we kind of just\r\n\r\n\r\nended up narrowing our focus based on like when we were serving kind of everybody, we saw like, here's the two subsets that we support and that we feel like we do really well with. And so, yeah, so it's SaaS and Ecom. And so Ecom, like one of our big like household brands that we work with, AG1, Athletic Greens, we've been doing customer service for them since 2009, 2010.\r\n\r\n\r\nNik (21:04.599)\r\nIt's.\r\n\r\n\r\nNik (21:19.202)\r\nWow.\r\n\r\n\r\nNathan (21:19.987)\r\nI met the founder at a Summit Series Conference back in Miami. I still remember the Summit Series Miami. And we've doing their customer service ever since.\r\n\r\n\r\nNik (21:33.102)\r\nSo a lot of people will talk about when starting out, well, there's a saying in SaaS, land and expand, which is like, go hyper niche, niche, and then you can expand into different product categories and offerings. It sounds like, I mean, you were the opposite. You're the opposite approach. It's like, I'm everything to everybody, and then you eventually went and decided to narrow down and niche down. Was that intentional, unintentional? Like, what made you do that strategy?\r\n\r\n\r\nNathan (22:00.585)\r\nThe niching down was intentional for sure. The delivery side became a bit complicated when we were like, well, if you're not an expert in anything, you're not an expert. If you're an expert in everything, you're not an expert in anything. We saw more niche competitors going after like pure tech or pure healthcare and seeing like this go deeper, but they're also able to try to premium their go -to -market function becomes a lot clearer.\r\n\r\n\r\nNik (22:02.253)\r\nOkay.\r\n\r\n\r\nNathan (22:30.389)\r\nreach becomes a lot clearer. The delivery becomes a lot easier because if we are able to e -comm, for example, as our e -comm 101 onboarding, we train you in Shopify, we train you in Magento, we train you in BigCommerce. We have that clear domain depth. In addition to Shopify for the shopping cart, we can all train you in intercom. The whole e -commerce tech stack, same goes for SaaS. We saw a lot of value add going\r\n\r\n\r\nNik (22:46.71)\r\nDial down.\r\n\r\n\r\nNik (22:56.365)\r\nMm -hmm.\r\n\r\n\r\nNathan (23:00.437)\r\nsuper deep as opposed to being general. And it also made it easier from a training perspective, like, hey, we have an e -comm training class and we have a SAS training class versus we have 10 different industries we're in. Like having to do training classes for each and customizing for each was very complicated.\r\n\r\n\r\nNik (23:20.686)\r\nSo when did you, said four or five years ago is when you actually sat down and decided to make this, why? Why did you make the switch then?\r\n\r\n\r\nNathan (23:33.153)\r\nI think the reason why we were not forced or challenged was we started working with a marketing consultant and he like, what do you all do? Who's your ICP? And I couldn't give him a great answer. And I was like, well, we do this, but we also do this and we also do that. We do everything. He was like, well, that's not going to work. And so yeah, was a marketing consultant that\r\n\r\n\r\nNik (23:41.806)\r\nHmm.\r\n\r\n\r\nNik (23:48.578)\r\nWe do everything for everyone!\r\n\r\n\r\nNik (23:57.004)\r\nWhy did you bring a marketing consultant in?\r\n\r\n\r\nNathan (23:59.645)\r\nIt wasn't just a market, it was a full service marketing agency. was like one of those full on lead gen agencies where they're going to do outbound, they were going to do our pay per click, they were going to do everything. so while that didn't work out, think the core premise of like the shopping group, the exercise they put in through was like, this makes a lot of sense. yeah.\r\n\r\n\r\nNik (24:14.562)\r\nLike the exercise, the exercise they made you go through. Yeah.\r\n\r\n\r\nSo how big were you at the time? How many employees and kind of like, was your MRR? Do you remember?\r\n\r\n\r\nNathan (24:31.302)\r\nI don't know what it is actually, it's five years ago, but I'll tell you what, I'll tell you the journey through COVID, cause that's a, that's a funny.\r\n\r\n\r\nNik (24:36.706)\r\nYeah, yeah, I'm also curious. You that's a big shift to go from providing everything to everybody to okay, we only do these two e commerce and SAS. And mainly, I'm curious if it paid off, right? Like, what were you then?\r\n\r\n\r\nNathan (24:49.333)\r\nWe didn't stop taking care of our legacy clients. We kept it on. And if somebody came in and said that they had a need and that was not in e -commerce SaaS, I have a very difficult problem saying no to revenue. So if it's big enough and we think we can help, I'll still say yes. We just don't actively go after them.\r\n\r\n\r\nNik (24:53.623)\r\nSure.\r\n\r\n\r\nNik (25:12.974)\r\nOkay, fair enough. All right, so walk me through what happened during COVID then.\r\n\r\n\r\nNathan (25:16.565)\r\nso COVID, we were at, I want to say 400 team members, all on site. Not all the Philippines, full, all a hundred percent all on site. Essentially overnight where everybody, everybody went on lockdown. We were.\r\n\r\n\r\nNik (25:29.194)\r\non site meeting in the Philippines. Okay.\r\n\r\n\r\nNathan (25:42.517)\r\n100 % go from, we went from 100 % work on -site to 100 % work from home in like 10 days.\r\n\r\n\r\nthe, thankfully the Philippines economy is so dependent on outsourcing that we were always essential workers like healthcare workers here, we're here in the US. So they never closed. But we went from 400 ish team members down to 200. When, when everything went off, everybody, all of our clients, especially Ecom said,\r\n\r\n\r\nHey, let's cut our team in half. We don't know what's going to happen. We think that sales are going to go down. We got to cut costs. So we went from 400 down to 200. And yeah, and like.\r\n\r\n\r\nNik (26:30.458)\r\nmy gosh,\r\n\r\n\r\nNathan (26:33.973)\r\n30 days. And then we're in the middle of all these layoffs and then one by one everybody starts coming back saying, my gosh, our volume is through the roof, hire everybody back and then add more team members. So we went from 400 down to 200 up to 600 by the end of that year in 2020. So talk about a rollercoaster.\r\n\r\n\r\nNik (26:35.341)\r\nmy gosh.\r\n\r\n\r\nNik (26:56.083)\r\nmy gosh. That's insane.\r\n\r\n\r\nSo I'm curious too, did it change the way that you operate in the Philippines? Like do you have physical offices now where they all come to or is everything done, you know, VoIP style and it's disaggregated, people are working from home. Like what does it look like now?\r\n\r\n\r\nNathan (27:19.221)\r\nNow it's probably 50 to 60 % on site now. All of our healthcare accounts, FinTech accounts want an on -site physical presence purely for security. And it's also much easier to build culture and build camaraderie on site than it is work from home. Work from home, have to be a lot more purposeful with it. I think what COVID did was it created\r\n\r\n\r\nIt opened up the lanes for like a somewhere and a Sagan. Like it opened up the lanes for a bunch of all the other folks to come in. And by the way, I don't think any of them are competitors. think I look at them as global. Yeah. I feel, I look at them as like global recruiting agencies or global talent recruiting where they'll hire one, two, three people. But the key distinction is there is that they don't manage the outcome. Like I, they might hire one person that's on you. It's on you to manage and like.\r\n\r\n\r\nNik (27:57.88)\r\nand seems very different.\r\n\r\n\r\nNik (28:10.626)\r\nYes.\r\n\r\n\r\nNathan (28:15.305)\r\nWe've managed outcomes, we managed performance, we managed the KPIs, and in most cases, our MSAs are built where we have strong performance incentives and kickers based on our KPIs.\r\n\r\n\r\nNik (28:25.646)\r\nYeah, so somewhere, somewhere places talent. Your company is a customer service solution company like that happens to be outsourced in the Philippines, right? Yeah, so like, they're similar in the sense that you're using global talent, but they're totally different business models, totally different models. That's, that is fascinating to actually think about. So so you went from 400 and COVID to about 1000.\r\n\r\n\r\nNathan (28:35.839)\r\nFully initialized.\r\n\r\n\r\nNathan (28:46.633)\r\nYeah.\r\n\r\n\r\nNik (28:55.242)\r\nish today. So you've two and a half X during COVID.\r\n\r\n\r\nNathan (28:57.493)\r\nYeah. Correct.\r\n\r\n\r\nNik (29:02.666)\r\nwhat it's pretty that that's pretty freaking incredible. And you hit on something when you're talking as you're like, well, we like to have offices because it improves morale. And I know you kind of like glossed over that. But that's always been for me also a major question mark with outsourcing companies is I think that company culture is such a differentiator, especially in services businesses, because like you said earlier, we're not selling a software product and we're not selling a physical good or\r\n\r\n\r\nwidget, we're selling services. And so our people are literally our product. I said all the time in home health and hospice, like our nurses, the ones that are at the bedside, they are the product. It's not, you know, a thing that we sell. And so I've always loved home health and hospice, because I knew that I could outcompete by building really good teams getting really good buy in creating an environment where people go above and beyond and care about each other, etc. And that's interesting, that's interesting way that you that you said about it.\r\n\r\n\r\nIt sounds like you approach this business the same way, right? I think a lot of people look at outsourcing as, I'm just gonna go in and it's gonna go to the Philippines, I'm gonna save a lot of money. But that's not the way that you've approached this.\r\n\r\n\r\nNathan (30:12.861)\r\nNo, not at all. So I do want to touch like the this isn't just a random office in a random country. My family's from there. Our headquarters is a town that my parents grew up in. And so we're now one of we're now one of the larger employers in that town, which is super satisfying, super gratifying to me to be able to create all of that opportunity. And from the very beginning,\r\n\r\n\r\nwe said that culture was going to be one of our biggest competitive advantages. I think it's also from a marketing and sales perspective, one of the most difficult things to convey during the sales process, because everybody says like, we have a fantastic culture. We have an amazing culture. It's very difficult to actually, unless you've actually gone on site, like we have a hundred percent close rate. When somebody goes to our, goes and visits the Philippines, does a site visit, we, they are 100 % guaranteed to be a client in our.\r\n\r\n\r\n15 years of business. And they see it because we have a chef on site, we have a cafeteria on site, we have a clinic, we have nurse and doctors 24 seven so that they don't have to if somebody gets sick, somebody gets sick in the middle of their shift, they can visit the clinic save money. We have our own network of shuttles and vans for pickup and drop off. We did this during COVID when we didn't want they didn't want to ride public transportation. And then when we tried to take it away as a perk, we kind of had a big uproar of like, I guess\r\n\r\n\r\nI guess this perk is saying, we pay for full healthcare benefits. We have our own internal make a wish program. So we grant as many wishes as possible every quarter. We call it the zeal. So support zebra, a pack of zebras is a zeal. So the zeal grants as many wishes as possible every quarter. So that could be one member, one team member, her son was having developmental issues or problems and challenges.\r\n\r\n\r\npaid for a mental health checkup as well as therapy. One, when he got married 15 years ago, he couldn't afford a wedding reception. So we did one 15 years later with him and his closest family and relatives and and family. One bucket list for her mom was to be a business owner. like had a, in the Philippines, they have what's called like street stands or sorry, sorry stores. And\r\n\r\n\r\nNik (32:21.4)\r\nAwesome,\r\n\r\n\r\nNathan (32:36.457)\r\nWe built up that first street stand along with the initial inventory for it. And so, no, we love that part of the, it's a, so we have these culture videos if you want, I don't know you can link them to the show after, but I can send you some culture videos. Yeah,\r\n\r\n\r\nNik (32:42.242)\r\nYeah.\r\n\r\n\r\nNik (32:47.79)\r\nYeah, if you send me some all income. I think that's a freaking amazing. Alright, well, I have some wrap up questions on the business and then we're going to go to some rapid fire. So before I wrap up, tell me, generally speaking, you don't have to tell me your company's margins. like, in this industry, what kind of margins do companies like yours typically experience?\r\n\r\n\r\nNathan (32:54.547)\r\nAll right,\r\n\r\n\r\nNathan (33:10.153)\r\nYeah, so there's a number of publicly traded big call center companies. think they're in the\r\n\r\n\r\nlow teens to, generally speaking, think it's between 12 to 25 percent. 25 percent of the extreme high side, most, which is where we land, is probably in the 15 to 20 percent margin rate, even the market rate.\r\n\r\n\r\nNik (33:31.244)\r\nOkay. For you, like what, how many people are state side based and how many of them are are well, I guess I know many of them are based in the Philippines, but like what's state side? Like you have an office right now. Who else is in this office with you? What do they do?\r\n\r\n\r\nNathan (33:46.437)\r\nSales, there's just my business partner that's in this office. have a sales function is stateside. They're distributed, they work remote. So we've got a team members in Vegas, in Utah, one other one in Houston. So sales function is here. Account management will eventually be here, but it's in the Philippines now. But yeah, just a sales function and meet really.\r\n\r\n\r\nNik (34:08.074)\r\nAnd then second to last question on the business, what's your biggest bottleneck to growth right now?\r\n\r\n\r\nNik (34:17.704)\r\nIf you had a customer that was going to come on and they were going to double the call volume that your team handled. No problem.\r\n\r\n\r\nNathan (34:23.029)\r\nNo problem. would not, yeah, no, if you asked me five years ago, the problem would have been delivery and like, how can we, but one of our core team members, our president now used to run, was the country manager for concentrics for employee number one, when he left, he oversaw 18 ,000 people. So he had been there, done that. So from a delivery standpoint, I have zero concerns. That was not always the case.\r\n\r\n\r\nNik (34:29.048)\r\nMmm.\r\n\r\n\r\nNathan (34:52.007)\r\nNow I would say it's top of funnel buyers interested in outsourcing.\r\n\r\n\r\nNik (34:59.694)\r\nCool. Yeah. All right. Last question. What do you say to somebody who's sitting at home and listening to the Twitter gurus that are like, you could launch a call center. You should find a niche and launch your own call center. Anyways, what would you say to somebody who wanted to start their own call center?\r\n\r\n\r\nNathan (35:18.517)\r\nI would say, I don't know.\r\n\r\n\r\nI think they have enough naivete to say like, good luck. Like, I think you can make it work that like, like I did. I would love to see that. But honestly, and this is not the scare of competition away, but like, I feel like there are much easier, less.\r\n\r\n\r\ngrind businesses than call centers and hospice. They're both 24 -7. They both are people as a product. So they're both high -management, high -touch businesses.\r\n\r\n\r\nNik (35:55.342)\r\nOkay, that's fair. All right, here's my rapid fire questions. What do you love about this business?\r\n\r\n\r\nNathan (36:02.109)\r\nI love creating opportunity. love the smiles we create when we have.\r\n\r\n\r\nNathan (36:09.637)\r\nmembers that we've uplifted and kind of moved up the socioeconomic ladder.\r\n\r\n\r\nNik (36:14.894)\r\nWhat do you hate about it?\r\n\r\n\r\nNathan (36:22.453)\r\nManaging people is very, very difficult.\r\n\r\n\r\nI'll just leave it at that. There's no science. It's an art.\r\n\r\n\r\nNik (36:35.47)\r\nIt's like when you haven't had kids yet, but one day you'll have kids. And kids have this amazing, just amazing ability to be the best and worst thing in your life. And that's what it's like when you manage people, right? Like for me, it's like the best part of the job, but then there's also the really crappy parts that you don't wanna deal with, so I get it. For you, what industry are you most jealous of right now? Like you said,\r\n\r\n\r\nNathan (36:39.498)\r\nYeah.\r\n\r\n\r\nNik (37:03.832)\r\nThere's easier ways to make money that aren't as much of a grind as call centers and hospice. What are you jealous of at the moment?\r\n\r\n\r\nNathan (37:10.015)\r\nfeel like grass is always greener on their side, but I would say I'm super jealous on the real estate folks that have assets and collect rent and have to do property maintenance. I would def, I think that's like my next.\r\n\r\n\r\nNik (37:24.344)\r\nThat's interesting. mean, you have a business that's probably kicking off really good cash. Why aren't you putting a bunch of real estate?\r\n\r\n\r\nNathan (37:29.321)\r\nWe have, I have put a bunch in real estate, but I'm also still in addition. I'm also managing a thousand over the same time.\r\n\r\n\r\nNik (37:35.938)\r\nYeah, yeah, yeah, okay, fair, good point, yep.\r\n\r\n\r\nI get it. All right. If you have two hours in your day, no family time, no work time, what are you obsessed with right now? What are you spending your time on in those two hours?\r\n\r\n\r\nNathan (37:41.513)\r\nYeah, real estate.\r\n\r\n\r\nNathan (37:52.853)\r\nI am obsessed with AI, everything AI. Partly because I find it fascinating, partly out of self -preservation. 10 years from now, is there even going to be a call center agent? Or is that just going to be an AI agent? mean, optimistically, I'd love to think that we're going to be able to figure out and adapt and become the... We have the relationships with our clients. We have the domain experience. We have the knowledge on what our clients want.\r\n\r\n\r\nWe are, we should be the ones to create and build out their AI strategy and implementations. That's how I look at it. So I'm, I'm obsessed about it. I tinker on it. I probably put on and sign up for five new demos a week. So.\r\n\r\n\r\nNik (38:37.23)\r\nAll right, here's the last question. What advice would you give to your pre -entrepreneurial self?\r\n\r\n\r\nNathan (38:44.351)\r\njust get started. feel like so many folks get analysis paralysis and don't ever get started because they're waiting for the perfect time or they're waiting for a big bonus and they don't have their first customer or whatever. And so I think just getting started.\r\n\r\n\r\nis just step one and then you'll learn and figure it out from there if you're meant for entrepreneurship.\r\n\r\n\r\nNik (39:13.326)\r\nOkay, well, this has been awesome. Dude, I'm so excited to see you over the next few months. Like you have amazing domain expertise. You're well spoken. You've got great, great success and experience. I think you're to blow up and be able to give a lot of people a lot of really good advice, especially in this world as we're starting to outsource, you know, more and more in the SMB space, where can people come find you?\r\n\r\n\r\nNathan (39:38.063)\r\nThere's my ex Twitter, it's Nathan Yat, my name, N -A -T -H -A -N -Y -A -P.\r\n\r\n\r\nNik (39:40.76)\r\nCool. All right, man. Well, this was awesome. forward to following up with you in a bit. Yep.\r\n\r\n\r\nNathan (39:46.025)\r\nThanks for having me.",
  "metadata": {
    "duration": "",
    "date": "2024-12-11",
    "platform_source": "Google Drive"
  }
}