{
  "episode_number": "103",
  "episode_title": "Is Consistency Overrated? Content, Wins & Losses, Investments, & Our 2024 Business Lessons with Chris Koerner",
  "guest_name": "Chris Koerner",
  "business_name": "Not Applicable (Personal Podcast)",
  "transcript": "﻿Chris Koerner (00:00.174)\r\nwell, 2024 is coming to an end. What are when we look back on this year, 30 years from now, what are we going to say about this year? What are some adjectives to describe 2024?\r\n\r\n\r\nNikolas Hulewsky (00:02.103)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (00:13.501)\r\nmy gosh, for me and you or just generally for like life.\r\n\r\n\r\nChris Koerner (00:16.398)\r\nFor me and you.\r\n\r\n\r\nNikolas Hulewsky (00:19.327)\r\ngeez, chaotic would be one of them. I'm not good. I don't know what adjectives are, but.\r\n\r\n\r\nChris Koerner (00:27.982)\r\nThe first one, you're one for one so far. So adjective describes a down.\r\n\r\n\r\nNikolas Hulewsky (00:31.859)\r\nOkay, okay, okay, okay. It was definitely a chaotic year, but it was also a year that was super exciting. And not that chaotic means it's not exciting, but I I always think of chaotic as negative. Yeah, lots of wins and lots of failures. It's weird. It's almost like the magnitude of the wins has been.\r\n\r\n\r\nmirrored by some of the magnitudes of the failures. So it's been a really interesting year. Personally for me, I quit my job this year. I mean, you know this, even at the companies that we owned, I always had a W2 position in those companies. And it was one of the things that made my wife really comfortable entrepreneurship. And in February, March, I quit the job that I had at the company who had acquired my home health and hospice. So for me, that's probably how I'm going to remember this year the most. It's the first year that I went\r\n\r\n\r\nfull into startup entrepreneurship.\r\n\r\n\r\nChris Koerner (01:31.822)\r\nIt's like the inflection point for entrepreneurship for you. Like the big one.\r\n\r\n\r\nNikolas Hulewsky (01:37.283)\r\nYeah, man. mean, most people aren't going to appreciate this. You're going to appreciate this. We were on a text chain because we want to buy a new house. We were on a text chain with our realtor and Jess goes, sorry, things have been a little busy. Nick started a new business and so we've been really focused on that. That's the first time Jess has ever referred to this as a business ever. You know what mean? For me, that was really cool to see. Either she's just finally acknowledging that she's held hostage or\r\n\r\n\r\nChris Koerner (01:57.806)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (02:06.624)\r\nMmm. Or that you're hell tostach.\r\n\r\n\r\nNikolas Hulewsky (02:06.815)\r\nor she's just asleep in the fact.\r\n\r\n\r\nI'm blinking twice. I'm blinking in Morse code.\r\n\r\n\r\nChris Koerner (02:15.106)\r\nWhat was she referring to as a business specifically?\r\n\r\n\r\nNikolas Hulewsky (02:19.331)\r\nSpecifically, she's referring to content. Yeah. We'll talk more about that actually in a little bit, but I'm curious to hear you. What was your adjectives for this year? You're better at words than I am, Kreis.\r\n\r\n\r\nChris Koerner (02:24.002)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (02:36.61)\r\nWell, there's only...\r\n\r\n\r\ntransformative, the word transformative comes to mind. As far as like startups, business, entrepreneurship is concerned, it was an average year for me. Just starting and launching things and chasing curiosities, but transformative in the sense that this was the first time I've ever like willfully gone on camera and publish it to the internet. Other than like an occasional interview here or there.\r\n\r\n\r\nNikolas Hulewsky (02:45.699)\r\nThat's a great word.\r\n\r\n\r\nChris Koerner (03:11.27)\r\nIt's something that I always said I would never do. yeah, like short form video specifically, was never, it was very cringe to me to think about.\r\n\r\n\r\nNikolas Hulewsky (03:15.095)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (03:22.755)\r\nI I guess that's true. We'd always talk about doing short form, but as a joke, never as serious business content. I was watching some of your short form yesterday. You've gotten way better. Even in the last month or two, I want to say, when you first started, you were just stiff. You're kind of figuring it out, and now you just know the flow and the cadence. You're really good.\r\n\r\n\r\nChris Koerner (03:27.832)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (03:35.224)\r\nThanks.\r\n\r\n\r\nChris Koerner (03:45.262)\r\nThank you.\r\n\r\n\r\nNikolas Hulewsky (03:45.687)\r\nI I just wanted to say that.\r\n\r\n\r\nTransformative, I like that. That's a really good word for this year for both of us, for different reasons, but yeah, for both of us. What's interesting is at the end of last year and the beginning of this year, you and I had very serious conversations about what are we doing? We own multiple businesses together. What's the plan? What's the future? We had just started, you and I both getting into content, posting to Twitter in particular.\r\n\r\n\r\nChris Koerner (03:51.096)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (04:17.995)\r\nAnd at that time you had like 50,000 followers on Twitter and I had 5,000 followers. And we made like the conscious decision to go all in on content because we're sitting here and we're looking at the Cody Sanchez's and the Nick Hubers, Andrew Wilkinson even. And it's like they're doing it in different ways, but they've built an audience and the audience gives them optionality. They can do whatever they want. And as we were looking at it, it's like, OK.\r\n\r\n\r\nThe way that most people make money, a la Cody and Nick when he started, sell a course, create a community. Not really what we want to do. You could build a big audience and sell ads. Maybe we want to do that. For us though, it was about building an audience so that we could have access to deal flow and talent and then act on those opportunities. I would say in the moment, I didn't think that we were actually doing that this year, but looking back as I was preparing for this episode.\r\n\r\n\r\nI'm kind of shocked with how much we've done. It's been a crazy year. I mean, you just crossed a million followers across all platforms, which is freaking nuts. 120 on Twitter, over 400,000 on Instagram, 200,000 on Facebook, 180 on TikTok. Like, it's nuts to me to see how much you've grown. And I've grown just as much. I've grown just as much.\r\n\r\n\r\nChris Koerner (05:19.64)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (05:42.478)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (05:45.587)\r\nBut it's been cool. For me, it's been cool to see that plan coming to fruition for both of us.\r\n\r\n\r\nChris Koerner (05:54.562)\r\nYeah. Yeah. mean, short form content to me is like so powerful. I saw this analogy and it was like, how many lottery tickets would you buy if they were free? How often would you play the lottery? I buy as many tickets as I could fit in my car. Why wouldn't you? Well, that's like, that's like short form video. It's a five minute investment that could turn into a whole business. Your life being changed.\r\n\r\n\r\n20 newsletter subscribers, a business partner, a customer. Like we talk about AI, chat, GPT, crypto. I'm still like, I'm on short form video. I just think it's the most powerful asymmetric bet in the world. And the smarter the algorithms get, the more it becomes so.\r\n\r\n\r\nNikolas Hulewsky (06:44.269)\r\nWhen was the moment that changed for you? Because you said you used to hate it, it was cringe. When did that change?\r\n\r\n\r\nChris Koerner (06:59.161)\r\nWhen I like when I cracked the code for me, right? I say crack the code. It's like, what's the secret? It's like, no, it's like everyone has their own secret. When I found out what my thing is, then the juice became worth the squeeze. Like the cringe became worth it. That makes sense?\r\n\r\n\r\nNikolas Hulewsky (07:07.639)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (07:14.625)\r\nWhat was your thing? Yeah, yeah. What do you mean? What was your thing?\r\n\r\n\r\nChris Koerner (07:18.803)\r\nNikolas Hulewsky (07:23.895)\r\nAre you talking about once you crack the code on what the format is or are you talking about the content?\r\n\r\n\r\nChris Koerner (07:28.822)\r\nRight, both. So\r\n\r\n\r\nChris Koerner (07:33.762)\r\nAm I drawing a blank?\r\n\r\n\r\nLet me think for a sec. I've almost got it. Muhammad literally edit this out, please. All right, so.\r\n\r\n\r\nWhat is content? Content is sharing ideas, right? Maybe you share a funny skit. That's an idea. Maybe you share a clip of you doing standup. You're sharing an idea, right? You're conveying an idea in that standup bit. Maybe you're sharing a video of you making your favorite pasta primavera. That's an idea. And like, I'm an ideas guy. That's my thing. Like I see ideas and opportunity in everything. And so I feel like for me,\r\n\r\n\r\nShort form content specifically is a way to very efficiently share all these ideas that are flooding at me on a daily basis. Right? Like I feel like it was built for me because I can quickly just get it out there. Like I have an idea instead of thinking on it for hours, I can just get it out there to the world. And then the world says back to me, I kind of like this, you know, and if half of the world hates it and half of them like it, then it might go viral. Right. And then I.\r\n\r\n\r\njust have to put my feelings aside. So I just feel like it's a great place for people that have a lot of ideas and are willing to share them. And I've always had a lot of ideas, but I hadn't always been willing to share them.\r\n\r\n\r\nNikolas Hulewsky (08:58.477)\r\nSo this is a quick story. When we were talking about doing this, the idea behind content is building trust at scale. Because if you build trust at scale and then you have optionality to make an investment or to bring somebody on, I we hired a chief of staff this year who we had no business hiring. This is way more talented than to come work for two YAHUs. But people trust us and so they want to work with us. And for me, when I saw the real value of short form was about a month ago.\r\n\r\n\r\nI had somebody on my podcast. We didn't episode an interview and it was fine. The most views I'd ever gotten on a video was about 4,000 views. So this person comes on and they ended up paying. I didn't know this at the time, but they paid to have that video promoted on YouTube. And the video ended up getting like 30,000 views. So way more than I had ever gotten on any video. And when it got the 30,000 views, my average view duration\r\n\r\n\r\nwas almost longer than any other video. My average view duration is like five, six minutes. This video is like 10 minutes long. And as I was just like looking at it, it was so weird to me. Like, why would I have so many more views and so much longer of an average view duration? Because most of the time, you know this, the more views you have, the shorter your view duration. And it hit me. It's like, people are out there who will resonate with your message, but you have to find them.\r\n\r\n\r\nAnd that's any business. Customers are out there that will resonate with your product, whether you're a digital agency, a physical product, a consumer goods, whatever it is, and you need to figure out how to find them. You are extremely talented at short form content and the short form, like you said, the lottery tickets allow you to build the audience so that you can then connect with them on the long form stuff and build trust. It's a means of building distribution. For me, that's when it clicked. It's like,\r\n\r\n\r\nIt's easy for me to sit here and be like, well, I'm just not as good as Chris or anybody looking and starting out in this journey of trying to grow a business. Well, I'm not as good as XYZ competitor. It's like, no, they've just figured out a way to distribute their product and you need to figure it out. And there's a bunch of tools at your disposal and you got to figure out what you're the best at and then hammer that home. And I think that's what you figured out about a year ago. like, I love ideas. I love businesses. Short form seems like a great platform.\r\n\r\n\r\nNikolas Hulewsky (11:24.927)\r\nthen you just had a framework and just boom, hit it, hit it, hit it, hit it. It's been fun for me to see. It's been a bit of a bummer because we haven't talked very much over the last six months, but it's still been fun.\r\n\r\n\r\nChris Koerner (11:37.966)\r\nWell, it all just comes down to throwing spaghetti at the wall and trying a million different things. You know, I've sent you concepts of like funny things and silly things and, just seeing what works, but man, there's a whole world on the other side of, of cringe and just setting your pride aside or your ego aside and like not caring what people think.\r\n\r\n\r\nNikolas Hulewsky (11:59.476)\r\nI think people look at content as something different than a real business. But there's so many things that just apply. I just talked about the distribution. You just talked about iterating, finding your product audience fit. The same principles apply because this is effectively a business at the end of the day. That's the fun part is you get to test and see in real time whether or not you're being successful.\r\n\r\n\r\nChris Koerner (12:07.118)\r\nAhem.\r\n\r\n\r\nChris Koerner (12:11.811)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (12:25.454)\r\nDude, I didn't even tell you this story, but I've got a buddy from TCU. We go hunting every year and we were hunting in November and he shows me this video on TikTok and it's this outdoor grill that's only sold in Argentina that has all these attachments, really cool looking. You put coals in it and you can like hang meat over it and you can like build it. You can custom build it to your preferences. No, it's like a, it's like a elevated fire pit for charcoal.\r\n\r\n\r\nNikolas Hulewsky (12:47.501)\r\nSo is it a smoker or is it?\r\n\r\n\r\nChris Koerner (12:53.73)\r\nthat you can put grills over in different shapes and like a Brazilian steakhouse style, you can like rotate over it. Super cool. And he's like, dude, like, look at this. was like, and he's talked about making homemade smokers or homemade grills before he's been a W2 worker forever, but he has like this amazing outdoor kitchen. It's like his passion. He knows how to weld. He knows like manufacturing contacts in Mexico from his job, but he's like 50 and he probably makes.\r\n\r\n\r\nNikolas Hulewsky (12:56.45)\r\nInteresting.\r\n\r\n\r\nChris Koerner (13:21.902)\r\n300 grand a year. He has an amazing retirement package. He works for a publicly traded company. It would be so hard for him to quit. And so when he showed me this TikTok video, I'm like, dude, this is your thing. Like you could just copy this in America. They don't ship it to America. It's only in Argentina. If it would work there and work here. And this TikTok account had 500,000 followers and it was just selling these grills in Argentina. It's like, you can't tell me that this wouldn't work here. And he's like, this could be the next Traeger. Traeger is a $600 million company. This could be the next Uni Pizza Ovens. This could be the next...\r\n\r\n\r\nbig green egg and I'm like, cool, yes, but it doesn't have to be like this could make $5 million a year in net profit. That would be life changing for anyone. And so I took that video and I made a look at this freaking guy right here, a video about it. Just talking about like someone needs to copy this and bring it to America. And I sent it to Carlos before I ever published it. And I was like, hey, what do you think of this? He's like, well, it's awesome. But like, what if we launched this?\r\n\r\n\r\nNikolas Hulewsky (13:56.643)\r\nBye.\r\n\r\n\r\nChris Koerner (14:20.792)\r\nAnd I'm like, well, you this is cool for you, but I'm not launching a grill company right now, you know? And I was like, but here's what I will do. I'll make, you know, I'll spend 10 minutes making a landing page for you. Think up a name, I'll buy the domain name and I'll make a video and say, like my friend Carlos, he has his job and he's always wanted to do this. And he's now accepting pre-orders because you can just do things. Cause this is America. You can do whatever you want. And we all make up the rules. And so I did, I bought a domain name.\r\n\r\n\r\nNikolas Hulewsky (14:25.303)\r\nYeah, yeah,\r\n\r\n\r\nChris Koerner (14:49.998)\r\ncalled Fuego Pits and I published it and it did like, okay, but like after a month now it's gotten like two and a half million views and he has like 300 email addresses and like a hundred people typed out a message saying how much, when can I buy this? Like it's a proper business. And now he's like actually talking to welders, he's talking to Mexico and like he's gonna put it in motion from.\r\n\r\n\r\nNikolas Hulewsky (15:00.087)\r\ncase.\r\n\r\n\r\nNikolas Hulewsky (15:08.77)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (15:13.805)\r\nHe's talking to Mexico?\r\n\r\n\r\nChris Koerner (15:16.514)\r\nSounds like something Trump would say, right? We're talking to Mexico.\r\n\r\n\r\nNikolas Hulewsky (15:18.019)\r\nHe's talking to many people. He's talking to Mexico. They're gonna build the wall\r\n\r\n\r\nChris Koerner (15:24.018)\r\nand like this is this legitimately could become a business. It could cause him to quit his job because I spent five minutes making a reel. Like that's how powerful it is.\r\n\r\n\r\nNikolas Hulewsky (00:01.208)\r\nWe had this happen six months ago where a friend of mine, tons of great experience, you know who I'm talking about, and I posted about him. Like, friend of mine, tons of private equity experience, he's been the COO, we grew this company from $2 to $150 million, yada, yada, yada. If anyone's interested, let me know. I had like 100 people reach out and\r\n\r\n\r\nThese are guys who are running private equity funds or people who have a business that they want to hand it off to an operator. And he didn't end up taking any of those positions more because it was a personal thing. But that was an eye opener for me. It was like, this is some dumb tweet I fired off that like 300,000 people saw and hunt over 100 people that were like legitimate reached out to me. We're like, Hey, could I talk to your friend? Anyways, it's just, it's crazy to me.\r\n\r\n\r\nChris Koerner (00:49.816)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (00:57.311)\r\nIt's cool. It's been cool to see the validation of the thesis over the past year.\r\n\r\n\r\nChris Koerner (01:02.168)\r\nYeah, and people listen and they're like, it's not for me. That's not for me. And it's, it's not like nothing is for everyone. Nothing is right. But if it's not for you, like make sure it's not for you for the right reason. Cause for me, the right, the reason why I didn't think it was for me is cause I didn't want people to judge me and I cared what they thought too much. And only until I stopped caring, did it make a world of difference for me.\r\n\r\n\r\nSo it's just that to me, in my opinion, that's not a good reason to not do it.\r\n\r\n\r\nNikolas Hulewsky (01:35.398)\r\nWe're also lucky that we were able to have time to do all of this. If we had actual full-time W2 jobs, there's no way we could have been able to make as much content as we have made over the past year. We both launched podcasts and we've done over hundred episodes just this year. You can't do that with a full-time job. We've been incredibly fortunate, I would say. But we knew that. That's why we were like, all right, let's take the swing now. Otherwise, we're never going to have another opportunity like this again.\r\n\r\n\r\nChris Koerner (01:48.589)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (02:04.998)\r\nLet's talk about some of the wins. Some of the validating wins are you ready? Biggest I think biggest win of the year side vending. Wanna recap that?\r\n\r\n\r\nChris Koerner (02:05.39)\r\nYeah. All right, let's do it. Yep.\r\n\r\n\r\nChris Koerner (02:18.594)\r\nYeah, I I posted a look at this freaking guy right here video in July about perfume vending. got 17, 18 million views by now and drove a ton of like the, the, the manufacturer didn't want to work with this. And so we launched a website on our own and captured a bunch of leads and became a distributor for the manufacturer instead. And we sold six figures worth of perfume vending machines.\r\n\r\n\r\nNikolas Hulewsky (02:43.648)\r\nWe've generated it somewhere in the ballpark of 200, might be over or I can't remember where it is. $200,000 of sales. An amazing validator of the idea. I would say for us, we started with perfume vending and then we did some cotton candy and we've had some other vending machines. What we have realized since is that there's a big learning curve in educating the end customer. So the entrepreneur who's going to buy these vending machines.\r\n\r\n\r\nIt's actually a really long sales cycle because there aren't perfume vending machines in the United States. They can't call up a local owner and ask them, where did you place your machine? What did you charge? they can now. Yeah, that's what I'm saying is like when we initially did it, the sales cycle has been so long because they have lots of questions. They're the first guy through the wall, but now there've been units placed. Now there are people who are actually doing it and making money. This will continue to be a business for us moving forward. That was one piece I didn't quite\r\n\r\n\r\nexpect was just how much education would be involved in it.\r\n\r\n\r\nChris Koerner (03:44.002)\r\nI just can't wait to go to a dinner party and say, what do you do? I'm an orthodontist. What do you do? I'm a neurosurgeon at a children's cardiac ICU unit. okay. What do you do, Chris? And I guys, I don't really, it doesn't matter. It's silly little thing. No, Chris, what do you do? You know, you know, those perfume vending machines you see at gas stations and nightclubs. No, I've never seen. Sure. You have it. That that's me. I, I brought them here.\r\n\r\n\r\nNikolas Hulewsky (04:08.422)\r\nYou\r\n\r\n\r\nChris Koerner (04:13.878)\r\nI don't know. That's all I want. That's why I'm in this game.\r\n\r\n\r\nNikolas Hulewsky (04:17.36)\r\nDude, honestly, we talked about that before you tweeted that. Before you posted that YouTube video, said, Chris, I just want to be able to look my lawyer brothers in the eye and say, I sell vending machines, guys. Get the freak off.\r\n\r\n\r\nChris Koerner (04:32.545)\r\nNo, you enable entrepreneurship. That's what you do.\r\n\r\n\r\nNikolas Hulewsky (04:33.03)\r\nYeah, yeah, we need a long term. So, side vending was rad. One of the cool things to come out of side vending was that we built a sales team. So, we've had thousands of leads. That's one thing that we'll learn moving forward is all of a sudden, thousands of people were reaching out like, can I buy one of these things? And really quickly, we had to implement a system to track these leads, document them, call them, follow up with them, et cetera.\r\n\r\n\r\nin the process, we had to build out an actual sales team. So have two sales guys now. We have someone who's managing sales for us. And that infrastructure will allow us to plug and play different products moving into the future. We just launched an agency called Repeat Leads, which has been years in the making for us. We've talked about doing a lead generation agency for years. And we're using that team as well to help us on the Repeat Leads side of things. And then we also have these one-off products that we've talked about, right? It's like,\r\n\r\n\r\nMaybe we should tweet about this tractor. Dude, we got a couple hits on this tractor, we could move like 20 units, bro. But that part's been cool. Like to now be like, cool. We have a sales team. This is how we handle inbound. This is how we pre-qualify people. This is we follow up with it. And we're still learning. We're still iterating. But to me, that's going to be a feature of perfume vending.\r\n\r\n\r\nChris Koerner (05:54.542)\r\nYeah. It's also been interesting learning how hard it is to convert a lead to a sale. and for anyone out there that has, 500 followers, 5,000 followers and it's like, yeah, what do I do with that? The, the, the amount of loyalty that you have at that level is unlike anything else. There's 1000 % of trade off. The more followers you get, the less your open rate goes down or the more your open rate goes down, the more your engagement rate goes down. it's just.\r\n\r\n\r\nNikolas Hulewsky (06:19.398)\r\nvolume operating.\r\n\r\n\r\nChris Koerner (06:23.926)\r\nIt's just a fact of life, right? We know people that have a couple thousand followers with agencies that do seven figures a year, because they're selling the right thing to the right audience. And they don't have such a big audience to where people don't feel like they could really connect with them, you know?\r\n\r\n\r\nNikolas Hulewsky (06:31.899)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (06:37.446)\r\nThat was a trade-off we knowingly made. We didn't want to just have an audience and then sell them a product. We're not trying to just make money off of the audience. We're trying to grow an audience so that we then have optionality to launch different businesses or partner with different people. I like Cody Sanchez. I think she's incredibly smart and she's doing some really cool things. But that's how she started, was monetizing her audience. That's just not the way that we wanted to go about it in the beginning.\r\n\r\n\r\nChris Koerner (07:02.584)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (07:07.31)\r\nNow we do. Now it's like, how do we monetize this audience? But just kidding.\r\n\r\n\r\nNikolas Hulewsky (07:15.046)\r\nOkay. So we've launched repeat leads. Briefly, do want to do a description of repeat leads? You want me to?\r\n\r\n\r\nChris Koerner (07:26.606)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (07:27.77)\r\nI'll do it and then you can correct me. Repeat Lead is a lead generation agency focused on small businesses, typically with a physical location, although that's not a deal breaker for us. And we focus on organic search in particular. SEO, and you can think of that as like technical SEO where you're actually building out the website. But then there's also programmatic SEO, is, you know, regular SEO on steroids. We have backlinks, a backlink offering. We have content.\r\n\r\n\r\noffering that's generated. And then we also have Google business profile that we optimize. Those are the main offerings that we have. We like those things because those are the things that we know. And we've used them on our businesses in the past. We didn't want to launch an agency that we didn't know. Those are all things that we've optimized and seen really good benefits from in our own businesses. And so we decided to launch a business because we're already doing that in-house with an in-house team. So why not go ahead and offer that to people who are looking for it?\r\n\r\n\r\nSo that was my brief explanation of repeat leads. I hope that I did a good job because you're probably going to correct me.\r\n\r\n\r\nChris Koerner (08:31.658)\r\nRepeat leads is a way for me to productize all the growth hacks that I've ever done and fell in love with. what, and you know, today it's a few different, very specific things, but in a year or two, it's going to be all kinds of cool little unique growth hacks.\r\n\r\n\r\nNikolas Hulewsky (08:49.03)\r\nYeah. All right. I'd say here's a couple other things, quick hitters. We invested in a peer community. everybody's heard of a mastermind and there are some masterminds that are like $10,000 a year. We invested in a community called Tribe and they focus on entrepreneurs who are about $3 million in top line revenue. These aren't $100 million companies. These are entrepreneurs who are growing.\r\n\r\n\r\ninto their businesses and trying to actively grow their businesses. It's $200 to $300 a month right now is their offering. We invested in it because we met the founder, Trenton, and really liked him, really liked his vision. We know that there's a need for entrepreneurs to connect with other entrepreneurs. Chris and I have zero interest in creating a community and this just seemed like a natural fit for us to be a part of. Then if people would ask us, hey, do you have a community or hey, do you have any coaching or mentorship? Easily pass that on over there because they've\r\n\r\n\r\ngot an infrastructure built out, they've got a cool product, they've got a good offering and we believe in it. I mean, that's the bottom line. So I'm really bullish on Tribe. We've already exceeded kind of where we thought we would be. The feedback from members has been exceptional. And I really like Trenton. I think Trenton's doing a really good job.\r\n\r\n\r\nChris Koerner (10:05.934)\r\nI It's going to be great.\r\n\r\n\r\nNikolas Hulewsky (10:07.782)\r\nThe next business we found was a commercial kitchen appliance repair company based in Florida. This was a searcher who reached out to us and was like, hey, I need some gap funding to close. Frankly, I just really like the business. I don't think it's going away. don't think AI is going to be automating it away. Guys going and repairing appliances in these commercial kitchens, if anything, think it's going to help it. It's in a market that's growing very fast in Tampa, Florida.\r\n\r\n\r\ngot an operator who's been an entrepreneur before, it's got solid financials. So there's really good tailwinds behind it. I just fell in love with it because it's unsexy, right? It's one of the sweaty businesses. You and I invested in a lot of quote unquote sexy things. This is an unsexy business and it's going really well. Again, we don't have a massive position in it, but we have a good position in it and I'm excited to see where it goes over the next year. But that would have never come had we not had\r\n\r\n\r\naudience and connections and somebody who reached out to me that saw that we invest in things. So, I'm excited to give updates on that.\r\n\r\n\r\nLet's see. Do you want to give an update on fast tree care and sunbeam pause?\r\n\r\n\r\nChris Koerner (11:20.748)\r\nYeah, Sunbeam Paws is our pet cremation business and we're actually growing a good bit right now. Our operator has been focused a lot more on growth. Now that we've worked out the kinks, we're placing brochures with vet clinics, we're taking on new customers.\r\n\r\n\r\nNikolas Hulewsky (11:21.83)\r\nyou\r\n\r\n\r\nYou\r\n\r\n\r\nNikolas Hulewsky (11:35.462)\r\nKinky. I'm sorry.\r\n\r\n\r\nChris Koerner (11:39.374)\r\nYou need to go read the comment that someone left on YouTube. Did you see it? There's a comment left on YouTube. I gotta find it. Probably.\r\n\r\n\r\nNikolas Hulewsky (11:44.454)\r\nI'm sorry.\r\n\r\n\r\nknow what did it say?\r\n\r\n\r\nAm I gonna be offended?\r\n\r\n\r\nChris Koerner (11:57.61)\r\nLet's see... Eric... Wait...\r\n\r\n\r\nNikolas Hulewsky (12:00.16)\r\nno. no. no no no no.\r\n\r\n\r\nChris Koerner (12:08.216)\r\nI know where it I don't know. Anyway, what was I even talking about?\r\n\r\n\r\nNikolas Hulewsky (12:10.147)\r\nI'll find it later.\r\n\r\n\r\nNikolas Hulewsky (12:13.872)\r\nsomebody impossible. Operator working out the kinks, we're able to grow.\r\n\r\n\r\nChris Koerner (12:18.954)\r\nYeah, we provide logistics for veterinarians that need their pets to be cremated. We don't cremate them ourselves, but we work with partners. It's a fancy way of saying we're a middleman in the cremation business of pets.\r\n\r\n\r\nNikolas Hulewsky (12:35.462)\r\nIt's funny because we've talked a number of times on this podcast about ideas that could take advantage of the booming pet industry. We're just on the end of it. I love it.\r\n\r\n\r\nChris Koerner (12:45.836)\r\nYep. And let me say like, it's been, it's been a lot of fun making a burning dog jokes about this business. But I'm like, I'm so past that, you know, we had our dog, and he sadly got hit by a car. And it was terrible. I have a lot of empathy for people that really love their pets. Now. You know, it was absolutely terrible when that happened. So yeah, what are gonna do? waffles rest in peace.\r\n\r\n\r\nNikolas Hulewsky (13:09.99)\r\nI'm sorry.\r\n\r\n\r\nNikolas Hulewsky (13:13.37)\r\nDoggie Dog world.\r\n\r\n\r\nChris Koerner (13:15.288)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (13:20.834)\r\nWhat?\r\n\r\n\r\nNikolas Hulewsky (13:21.348)\r\nsorry. I was thinking about the text you sent to All right. Fast Rekare.\r\n\r\n\r\nlove this business. We've had it now for a year and a half. It just continues to be consistent for us. We have James running that business. It's located only in Dallas. Frankly, we're trying to figure out what we're going to do with it because James is amazing. He's incredible. But if it's really going to grow the way that maybe he wants it to or that we would want it to, it's going to require more time and energy from us and we don't have the desire or the time and energy to dedicate to it, which\r\n\r\n\r\nleaves us trying to figure out, what do we do? How do we get James what he needs? How do we grow this business? What are next steps? I love the business. think it's been a massive proof of concept for us over the last year and a half. But I'd say we're kind of like in this limbo phase. It's fine. It's consistent. It makes money. But is that all we want? Is it ever going to be there? And really, we like James a lot and want him to have a lot of opportunities.\r\n\r\n\r\nWe've been thinking about what the next steps are for that business.\r\n\r\n\r\nChris Koerner (14:29.806)\r\nYeah, it's just, it the best and highest use of our time?\r\n\r\n\r\nNikolas Hulewsky (14:34.406)\r\nMm-hmm. I agree.\r\n\r\n\r\nChris Koerner (14:36.032)\r\nI think working with James's, but the industry itself, maybe not. So if you wanna buy a tree trimming business, reach out.\r\n\r\n\r\nNikolas Hulewsky (14:44.166)\r\ntreatment business in Dallas. For me, that was a really validating thing because that was one of my thesis is we could meet really cool people and work with cool people. James is that. James is like the embodiment of that. He's awesome. He's hardworking. He's humble. He's hungry. I know I want to work with James. I just don't know if that's the highest and best use of his time in the moment, which similar to the next business, we started an AI healthcare company called Volterra.\r\n\r\n\r\nthat business helps skilled nursing facilities find as many codes as possible when they're doing the admissions process. It has gone better and worse than I expected, better in the sense that the technology really works and there's traction, worse in the sense that it actually, we had never done a tech startup. Even though that wasn't the plan, our plan was to throw a skin on top of chat GPT and then offer this as a service. We brought in\r\n\r\n\r\nco-founder, his name is Zach. Zach ended up realizing this needs to be built out as a tech product. There's proper engineering. He's got a co-founder now. We have actually ended up spinning that out. We still own some equity in it, but they're in the process of raising money. They're beta testing in more than a dozen facilities. It's going really well. I'm stoked for the upside on that. That was an eye-opener for me. was just like, in our lane. We don't know tech. You know what I mean?\r\n\r\n\r\nI'm excited for Zach. think he's going have lot of really good opportunities. building things with software as a feature is hard, just really hard.\r\n\r\n\r\nChris Koerner (16:20.622)\r\nYou know what say, software is hard. That's what they say.\r\n\r\n\r\nNikolas Hulewsky (16:22.982)\r\nsoftware soft.\r\n\r\n\r\n\r\n\r\nNikolas Hulewsky (18:17.808)\r\nOkay. No, more than happy.\r\n\r\n\r\nChris Koerner (18:28.046)\r\nIt's interesting because I've never, I've never had a year with a bunch of wins that wasn't offset with a bunch of losses as well. Like I've never had a period of life where it's only wins or only losses. and I went to breakfast with a friend the other day that's getting divorced, going through a really tough time in life right now. And he works for a company that is just crushing it and his stock options are tripling and he's making more money than he's ever made, but his marriage is struggling.\r\n\r\n\r\nI mean, it's his marriage is over. He's divorced and it, took him by surprise. And I just find that an interesting paradox of life where, don't know, it's never really all good or all bad. And if it is seemingly all good, then some bad is usually around the corner and vice versa. So in my opinion, the biggest L we took was with our crypto services business. we had two revenue lines, one with sales, one with services.\r\n\r\n\r\nNikolas Hulewsky (19:14.918)\r\nThat's true.\r\n\r\n\r\nChris Koerner (19:25.534)\r\nAnd the services were just dragging us down. And so over a year ago, we made the tough call to cut off the services line of our business because that just wasn't making any money. was the most onerous. And so we did and we're still doing it. And it's been 14 months and it's just a lot of hard conversations, a lot of angry emails and restless, sleepless nights. And it just sucks. There's no other way around it. It sucks. you know, these crypto bear markets.\r\n\r\n\r\njust seemingly never end. It's just not a good industry to build a really sustainable business on.\r\n\r\n\r\nNikolas Hulewsky (20:01.988)\r\nNo.\r\n\r\n\r\nNo, no, no. I would say our experience with that taught us we don't want to be anything that's operationally intensive. We may be in an industry that's operationally intensive, but we don't want to be in a position that requires us to be operationally intensive from that experience. I there's things that we are really good at and then there are things that we really like to do. I'm good at operations, but I don't actually like to do it. I don't.\r\n\r\n\r\nChris Koerner (20:14.584)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (20:22.402)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (20:35.154)\r\nand you are not a fan of operations, nor are you good at it, right? So it's like, why would we be in businesses that are operationally intensive? Let's focus on our areas of strengths. And that experience over the last year and a half has really just hammered that home for us. So every time that one of us brings up the idea, which is like once a week to go into another business that's operationally intensive, we're just like, hey man, we're not doing that again. Chris, dial it back. Nick, quit acting like a moron.\r\n\r\n\r\nChris Koerner (21:01.144)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (21:05.146)\r\nThat's it. Yeah.\r\n\r\n\r\nChris Koerner (21:05.474)\r\nYep. Just because a business idea would work doesn't mean you should launch it. Almost anything would work. Almost anything could scale. Doesn't mean it's the best and highest use of your time skills or talents. It took me a long time to learn.\r\n\r\n\r\nNikolas Hulewsky (21:24.134)\r\nI'm still learning that. mean, we still have conversations like, but this could be something. but we could turn this into something. It's hard to say no. Unless it's to drugs, I can say no to drugs.\r\n\r\n\r\nChris Koerner (21:33.494)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (21:37.666)\r\nWell, especially when you're just, you're a flood of ideas all the time, you know, and you're impatient and you just want to test them and try it out and see how it goes and validate the concept. But it's tough. Yeah.\r\n\r\n\r\nNikolas Hulewsky (21:52.794)\r\nYeah. Let's see. Another high invested in a farm in Puerto Rico this year.\r\n\r\n\r\nand I lost some money.\r\n\r\n\r\nChris Koerner (22:03.96)\r\nHas anyone ever done that and not lost money?\r\n\r\n\r\nNikolas Hulewsky (22:07.853)\r\nno, actually, it's a scientific fact.\r\n\r\n\r\nChris Koerner (22:13.12)\r\nIt's the classic like, it's like, you know, you let your wife start a clothing boutique, you invest in a farm in Puerto Rico, like we've all been there.\r\n\r\n\r\nNikolas Hulewsky (22:20.922)\r\nNo, I met Hunter Durham. He's on Twitter. Very charismatic, very smart, been successful. Then he went through bankruptcy for his businesses and he had a new venture that he was starting. It was to start a business, the cacao industry or taking advantage of the cacao industry in Puerto Rico. Really, I invested in him. The idea wasn't super gangbusters on, but I knew that there was a high probability of it not working out. Spoiler alert, it did not work out. He's pivoted into, I think he's doing a digital\r\n\r\n\r\nbrand. I can't remember exactly what he's doing now, but he's, he's pivoted. and then the other big fail for the year, we had an RV park in freaking the middle of nowhere. I won't say it. And after we purchased it just a few months later, for whatever reason, the city got to stick up their butt and decided they were going to shut down the park. So we had to shut down that park and sell it at a little bit of a loss. But,\r\n\r\n\r\nThat sucked. was just a, yeah, the whole experience fricking sucked. Cause we were both so excited about it. Found it off market. was a good deal. And then the city came in this year and was like, sorry son, you can't operate here. We don't like northerners.\r\n\r\n\r\nChris Koerner (23:38.478)\r\nI think when you include the revenue we made from it and everything, we'll make a little bit of money.\r\n\r\n\r\nNikolas Hulewsky (23:43.174)\r\nI think you're right. don't know why it's in my-\r\n\r\n\r\nChris Koerner (23:46.156)\r\nI mean, you might as well call it a loss because it, you know, time value of money, two years having six figures tied up, but we will come out ahead on paper. for the headache.\r\n\r\n\r\nNikolas Hulewsky (23:56.706)\r\nIt was a loss. It was a loss for me because I put the cash in and it was like always just my wife and I love my wife, but just like, Hey, let's update with the park. What's going on with the park? What's happening with the park and\r\n\r\n\r\nChris Koerner (24:10.722)\r\nShe's right behind you.\r\n\r\n\r\nNikolas Hulewsky (24:15.366)\r\nSo that just added a lot of stress for me personally. I guess that's probably why I think of it as a loss. You're right. It actually wasn't technically a loss on paper, but it tied up capital for a year and a half, two years. No, was a year and a half. And it just added that weird stressful dynamic with my wife and I. So that's probably why I'm thinking of it more as a loss.\r\n\r\n\r\nAll right, what else you got?\r\n\r\n\r\nChris Koerner (24:42.808)\r\nYou\r\n\r\n\r\nChris Koerner (24:47.453)\r\nI got a business idea.\r\n\r\n\r\nNikolas Hulewsky (24:51.494)\r\nShould we end on an idea?\r\n\r\n\r\nChris Koerner (24:51.628)\r\nIt kind of goes, we could, it kind of goes along with the content conversation we were having. So not everyone wants it. Go ahead.\r\n\r\n\r\nNikolas Hulewsky (24:59.846)\r\nWhy don't we?\r\n\r\n\r\nWhy don't we frame, why don't we just like tie that up and be like, all right. So that was this year's wins and losses.\r\n\r\n\r\nChris Koerner (25:07.116)\r\nYeah, and we could put this with the content.\r\n\r\n\r\nNikolas Hulewsky (25:10.244)\r\nand then frame it as something exciting. don't know. Maybe just talk about looking forward to 2025.\r\n\r\n\r\nChris Koerner (25:17.206)\r\nYeah. And then I'll say this thing and then we'll put it with the content.\r\n\r\n\r\nNikolas Hulewsky (25:23.268)\r\nIt'll all be one episode though. Yeah, yeah.\r\n\r\n\r\nChris Koerner (25:24.876)\r\nYeah, I'm just saying the very last part, the business idea that I have around content will put it near the beginning.\r\n\r\n\r\nNikolas Hulewsky (25:31.492)\r\nYeah, and let's ask each other like what we're most excited about for 2025.\r\n\r\n\r\nOkay, I'll do the recap. You start with what you're most excited about for 2025. Or you can do the recap and I'll start with what I'm most excited about. Which one do want to do?\r\n\r\n\r\nChris Koerner (25:46.126)\r\nWhy don't you do the recap? Start with that.\r\n\r\n\r\nNikolas Hulewsky (25:48.58)\r\nOkay. All right. So, transformative is the freaking best word for this past year because we've been working to like, you and I have been working towards something over the last, I mean, we know each other 20 years, but over the last five years in particular, as we've partnered with different businesses and it felt like this year we finally figured out, okay, this is the thing. And we're doing a lot of things to clean up, to get organized, et cetera. But it's just transformative because it finally went from\r\n\r\n\r\nthesis and chaotic mess to, okay, this is the direction that we're going in and this is how we're going to get to where we're going. Yes, we had some losses, but dude, it was just such a cool year. There's so many amazing things that happened this year that we probably didn't even touch on. I love 2024. I'm always going to remember 2024 as a transformative year for both of us.\r\n\r\n\r\nChris Koerner (26:43.246)\r\nAgreed all around. It a good year.\r\n\r\n\r\nNikolas Hulewsky (26:44.772)\r\nWhat are you most looking forward to in 2025?\r\n\r\n\r\nChris Koerner (26:49.102)\r\nHmm.\r\n\r\n\r\nChris Koerner (26:56.686)\r\nI'm excited to put out a lot more content. A lot more.\r\n\r\n\r\nNikolas Hulewsky (27:00.16)\r\nlot more? you are a dirty boy! Okay!\r\n\r\n\r\nChris Koerner (27:05.87)\r\nI want to put out a thousand shorts in business, a thousand business idea shorts next year, three a day. And I want to film more like out and about dirty job style, long form YouTube videos. That's what I'm really excited about.\r\n\r\n\r\nNikolas Hulewsky (27:21.446)\r\nYes. Yes. Content. So it's content. That's your that's your excitement. Okay. I would say I'm in the same boat. I am I'm really excited because I feel like I am where you were a year ago. I don't think I'm ever going to get an audience as big as your audience. But to me, it's like, all right, this is what I am. And I just have an opportunity now to hammer at home. I want to put out\r\n\r\n\r\nChris Koerner (27:27.36)\r\nMm-hmm. Yeah.\r\n\r\n\r\nNikolas Hulewsky (27:49.382)\r\n20 out and about style videos where we – I'd prefer to do most of them with you because I just think we'd have so much fun. The dynamic of us playing off of each other. But going to different businesses and just asking them like, do they work? What do you do? How do you provide service? I've learned so much over the last year just in our podcasts. Prepping for our podcast and then interviewing people on my own podcast. There's a whole world of business that I didn't even know existed. I think it would be really fun to go out and about and interview people.\r\n\r\n\r\nChris Koerner (27:58.264)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (28:19.652)\r\nI'm also excited to take what we've been doing and scale it. I'm going to focus a little bit more next year on healthcare. I'm starting a healthcare podcast that's focused on the healthcare entrepreneur because I think that's a market that's just underserved. It's dying for knowledge on how to do this stuff. Again, I don't know what the monetization play is yet, but my brother-in-law's are doing a podcast with me and we're going to do the fulfillment on the backend is the co-founder's podcast network. I'm curious to see if that turns into anything.\r\n\r\n\r\nThose are the things I'm probably the most excited about next year.\r\n\r\n\r\nChris Koerner (28:53.102)\r\nWe're not content or content.\r\n\r\n\r\nNikolas Hulewsky (28:55.11)\r\nAnd this is on the con.\r\n\r\n\r\nChris Koerner (29:00.526)\r\nIt's not who you know. It's TKO.\r\n\r\n\r\nIf you know, UTKO.\r\n\r\n\r\nNikolas Hulewsky (29:08.358)\r\nI'm sorry, did you copyright that yet?\r\n\r\n\r\nChris Koerner (29:11.032)\r\nJust did, always has been.\r\n\r\n\r\nNikolas Hulewsky (29:11.43)\r\nI just bought the website. Your favorite meme.\r\n\r\n\r\nChris Koerner (29:19.201)\r\nEhh...\r\n\r\n\r\nNikolas Hulewsky (29:20.196)\r\nAll right, here we come, baby.\r\n\r\n\r\nChris Koerner (29:22.894)\r\nAll right, can I tell you this content idea?\r\n\r\n\r\nNikolas Hulewsky (29:25.647)\r\nOf course.\r\n\r\n\r\nChris Koerner (29:27.17)\r\nAlright, so if you're listening to this and you're thinking, I don't want to do content. Okay, let's start with audio. Let's start with podcasts. Let's start with your passion. Okay, because everyone's passionate about right, right Nick.\r\n\r\n\r\nNikolas Hulewsky (29:40.708)\r\nI'm most passionate about content. And honestly, my wife, Jessica, she's like a close second. I always walk down and I see my wife in the kitchen filming shorts and posting them to Instagram so she can sell things on her Etsy store.\r\n\r\n\r\nChris Koerner (29:56.686)\r\nWhat are you talking about right now?\r\n\r\n\r\nNikolas Hulewsky (29:58.554)\r\nI just was going hard. He said everyone's interested in content and I know that Jessica doesn't like content.\r\n\r\n\r\nChris Koerner (30:02.702)\r\nThat's not what I said, actually.\r\n\r\n\r\nNikolas Hulewsky (30:06.352)\r\nWhat you say?\r\n\r\n\r\nChris Koerner (30:08.206)\r\ncan't wait for you to watch this back. I said\r\n\r\n\r\nNikolas Hulewsky (30:10.428)\r\nMuhammad, edit that out too.\r\n\r\n\r\nChris Koerner (30:13.583)\r\nSeriously though, I said everyone's passionate about something, right?\r\n\r\n\r\nNikolas Hulewsky (30:14.8)\r\nHahaha!\r\n\r\n\r\nyeah, I'm a faggot, sorry.\r\n\r\n\r\nChris Koerner (30:20.75)\r\nOkay, please edit that out. Please edit that out. all right. So everyone's passionate about something, right, Nick? Okay, so the acquired podcast, you're familiar with it.\r\n\r\n\r\nNikolas Hulewsky (30:22.198)\r\nYou\r\n\r\n\r\nNikolas Hulewsky (30:34.247)\r\nSuch a good podcast. Yep.\r\n\r\n\r\nChris Koerner (30:36.162)\r\nWell, we don't want to drive people away from this one. So it's not that good. Like it's fine. It's fine. Don't waste your time.\r\n\r\n\r\nNikolas Hulewsky (30:41.35)\r\nIt's actually, it's pretty stupid. Honestly, I'm surprised they have an IQ of like 85 combined. I don't even know how it's Yeah. Yeah. Yeah.\r\n\r\n\r\nChris Koerner (30:46.36)\r\nCombined. Yeah, I'm glad you said combined because it is. Honestly, I haven't spent that much time listening to it, but I like what the thesis is of it. One sec. Give me, give me. Yeah. One sec. Yeah.\r\n\r\n\r\nNikolas Hulewsky (30:54.95)\r\nI've listened to\r\n\r\n\r\nChris Koerner (31:11.918)\r\nSo I got a handyman here.\r\n\r\n\r\nAnyway, so the thesis of the acquired podcast is what are the two guys names? Do know?\r\n\r\n\r\nNikolas Hulewsky (31:21.776)\r\nI don't know their names. I've only listened to a handful of episodes, but they're insanely well researched and they go very deep on a particular topic.\r\n\r\n\r\nChris Koerner (31:27.51)\r\nYes, that's what I'm going for.\r\n\r\n\r\nChris Koerner (31:32.75)\r\nchoir.\r\n\r\n\r\nChris Koerner (31:36.642)\r\nAll right, Ben and David are the two hosts of acquired and what makes this podcast different is they only release one episode a month. The episode is like two to four hours long and they each claim to spend 100 hours on the topic. So they'll do an episode on Nvidia or on a merger, like a big merger or on Blockbuster versus Netflix, any sort of business topic, usually revolving around an acquisition or a merger or something, hence the name acquired.\r\n\r\n\r\nbut they will collectively spend 200 hours researching for a month straight and then they'll record it. And it's been around for about 10 years and it's huge. These guys make about $25 million a year in sponsorship and event revenue. Yeah, it's that big. Their media kit is on their website. Yeah. Their ad slots are like $1.1 million for three episodes. Yeah, that's proven.\r\n\r\n\r\nNikolas Hulewsky (32:18.522)\r\nWhat?\r\n\r\n\r\nWhat?\r\n\r\n\r\nNikolas Hulewsky (32:29.126)\r\n$25 million a year?\r\n\r\n\r\nChris Koerner (32:34.05)\r\nThat's proven. That's not like me guessing.\r\n\r\n\r\nNikolas Hulewsky (32:36.773)\r\nmy gosh, that's insane.\r\n\r\n\r\nChris Koerner (32:39.438)\r\nYeah, they had an in-person event with like 20,000 people there and they were like $75 tickets.\r\n\r\n\r\nNikolas Hulewsky (32:46.918)\r\nShould we stop putting out so many episodes?\r\n\r\n\r\nChris Koerner (32:49.39)\r\nNo, hear me out. So I feel like anyone in the world, I think it's important that there are two people on this podcast, because they're each doing a ton of research. A lot of it overlaps. And so they each have a deep knowledge of the subject. But it's like a Venn diagram. It's not all overlap, right? So I think you need to find what your passion is. Maybe it's pizza, barbecue, food, music, classic rock, doesn't matter the acquired of X, Y or Z.\r\n\r\n\r\nRight. So I got some ideas. Whatever, whatever it is sports acquired for sports, call it game changers, right? Where you talk about dynasties or like a season that we'll never see again in any sport or an athlete or a game, right? A whole episode, three hour episode about game seven jazz verse bulls 1999. Right? Tell me that wouldn't be amazing. Like in depth, like you're looking at newspapers.com\r\n\r\n\r\nNikolas Hulewsky (33:18.864)\r\nearly 2000s emo.\r\n\r\n\r\nNikolas Hulewsky (33:33.733)\r\nI\r\n\r\n\r\nNikolas Hulewsky (33:37.967)\r\nHmm\r\n\r\n\r\nChris Koerner (33:48.494)\r\nYou're going deep. Like you're looking at local newspapers from the 90s. go ahead.\r\n\r\n\r\nNikolas Hulewsky (33:55.438)\r\njust think what's interesting about this idea is how much media and television have changed because in the past, if you had this idea, you'd have to go to a production company. You'd have to go to Netflix, you'd have to go to Paramount, you'd have to go to Fox, pitched the idea and then a decision maker would say yay or nay because you had to get all of the equipment necessary to make a quality film. Now, you can get all the tools and equipment necessary to make a quality film.\r\n\r\n\r\nChris Koerner (34:08.323)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (34:23.792)\r\nfor a few hundred dollars, maybe a thousand dollars. And so you can do it yourself. You can do all the research yourself. And that's super, that is very interesting because we're not talking about, this isn't anything new. There's been documentaries, there's been things like this done before. Ben Levy, Ben Wilson, the How to Take Over the World podcast. Like his podcast is essentially a broader version of this. It's history focused on people.\r\n\r\n\r\nChris Koerner (34:26.318)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (34:42.796)\r\nMm-hmm. Ben Wilson. Yeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (34:52.89)\r\nYou're talking about history focused on a specific genre. Like the last dance on Netflix. I don't if you've watched that, Michael Jordan's last season. Dude, incredible. Incredible.\r\n\r\n\r\nChris Koerner (34:57.462)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (35:02.294)\r\nMm-hmm. It's amazing. Yeah.\r\n\r\n\r\nNikolas Hulewsky (35:07.758)\r\nYeah, think that's a great idea.\r\n\r\n\r\nChris Koerner (35:09.57)\r\nI think it'd be fun. I think it would just be if it is your passion, it would genuinely be fun to do whether anyone's listening or not. And it would take years. Like it would literally it took acquired years for them to like hit any sort of critical mass. But now like they're just growing like crazy. And it took like if you can wait 10 years to make 25 million a year. These guys didn't have like a big audience before they were just a couple tech bros.\r\n\r\n\r\nNikolas Hulewsky (35:35.302)\r\nme ask you this. Do you think that they're successful because they were consistent? Or do you think that consistency was an ingredient? Because just because you do it for 10 years doesn't mean you're going to be guaranteed $25 million a year. You know what I mean? And you and I both do stuff and it's like, if it's not working, if I'm not seeing results, I move on, I'm out. How do you know that something's working enough to say, I'm going to do this for the next 10 years because I know\r\n\r\n\r\nChris Koerner (35:37.335)\r\nEh.\r\n\r\n\r\nNikolas Hulewsky (36:05.188)\r\nI'm David Senra and I know I'm going to be a multimillionaire by doing book reports, essentially. That's what he's doing. He's reading a freaking book and then he's giving a book report. But he summarizes it in a way that's fantastic and people listen to it. Anyways, he has a great podcast. Yeah, he's super excited about it. It's great. It's great content.\r\n\r\n\r\nChris Koerner (36:09.336)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nChris Koerner (36:17.848)\r\nHe's, and he's excited about it. I think when it comes to content, think the consistency is overrated. It's overrated. If you will. lot of people like, the algorithms, they want to see you post every day, every day, every day. I don't believe that to be true. I think the, the most important thing in any content is the idea. Right. And Mr. Beast nailed that right for, for whatever reason, a hundred million people want to see who takes their hand off the lab Lamborghini last.\r\n\r\n\r\nIt's the idea of the video. Now he has an amazing hook. He does a lot of re hooks along the way to keep retention high, but without a good idea, you're not going to get a hundred million views. So spent the most amount of time thinking about the idea, like what will the podcast be? What is a broad enough market? And also something that I love. Maybe it's food. Maybe it's restaurant, iconic New York city restaurants, right? Whatever it is, you have to love it.\r\n\r\n\r\nAnd yes, you need to be consistent. You can't quit, but you and I know, no guys that have been podcasting or writing or doing whatever blogging for decades and still no one's really reading that much. You know, and they might get a lot of joy out of it that's not the point. And that's fine. No shade to them, but it has to be the right idea and a high quality.\r\n\r\n\r\nNikolas Hulewsky (37:39.354)\r\nI think that's the biggest thing. When both of us talked about starting our podcasts, we had to find a reason to do it other than, we're going to get a big audience or we're going to make a lot of money off of it because we know ourselves. Like if we don't enjoy doing it, we're not going to continue to do it. Both of us genuinely enjoy doing this for different reasons. I love talking to people and like learning about them and like getting the story from them, right? You love the, does it work ideation? Yeah.\r\n\r\n\r\nChris Koerner (38:06.337)\r\nideation.\r\n\r\n\r\nNikolas Hulewsky (38:08.102)\r\nRight? So we like it for different reasons. And that's why your podcast is more about the ideation. And my podcast is more about like getting to know them. How did they do it type of thing? But if we would have been trying to do the same show, one of us would have dropped out because it's not, it's not for us. So if you're going to do this idea, pick something that you're passionate about, not to be woo woo, like, follow your passion. Like, no, if you don't like it, it's not going to come through. People are going to listen to it and be like, eh, this guy's not even passionate about it. Why should I be passionate about it?\r\n\r\n\r\nNikolas Hulewsky (38:39.322)\r\nI like it. It's a great idea. We should do one. What would we do? What would we do?\r\n\r\n\r\nChris Koerner (38:39.662)\r\nThat's a good idea though, right?\r\n\r\n\r\nNikolas Hulewsky (38:47.408)\r\nsome type of church history.\r\n\r\n\r\nChris Koerner (38:51.118)\r\nI don't know.\r\n\r\n\r\nNikolas Hulewsky (38:51.247)\r\nor\r\n\r\n\r\nNikolas Hulewsky (38:55.046)\r\nI don't know if you're allowed to do that.\r\n\r\n\r\nChris Koerner (38:59.928)\r\nI don't know. That's a good question.\r\n\r\n\r\nNikolas Hulewsky (39:01.894)\r\nI guess we are doing it with this Friday episode.\r\n\r\n\r\nChris Koerner (39:07.939)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (39:09.168)\r\nWe just don't do as much research.\r\n\r\n\r\nChris Koerner (39:12.034)\r\nI might do it on like, I tried a new format this week where it was like a deep dive, but I didn't interview anyone. I just did the research myself on the bounce house industry and I spent 25 minutes just talking all about it and I got great feedback from it. so to me that was like a much shortened version of what they're doing. I go on perplexity, Chad's UBT. I went and interviewed people in person. I learned the unit economics of it, that upside downside startup costs, all that. And then I just report report back.\r\n\r\n\r\nI could do that forever, because it's fun.\r\n\r\n\r\nNikolas Hulewsky (39:45.03)\r\nIt's to be super fun.\r\n\r\n\r\nYeah, but even then you're not doing 100 hours. Geez Louise.\r\n\r\n\r\nChris Koerner (39:50.894)\r\nI don't know what more I could have learned.\r\n\r\n\r\nNikolas Hulewsky (39:56.104)\r\ndude, you could have learned so much more, I'm sure. No, I know it all, bro. I got the 80 20. All right. Happy New Year. Merry Christmas.\r\n\r\n\r\nChris Koerner (39:58.402)\r\nNo.\r\n\r\n\r\nChris Koerner (40:04.142)\r\n80-20. All right.",
  "metadata": {
    "duration": "",
    "date": "2025-01-03",
    "platform_source": "Google Drive"
  }
}