{
  "episode_number": "38",
  "episode_title": "From Idea to IPO in 12 Months with Callum Laing",
  "guest_name": "Callum Laing",
  "business_name": "Veblen Director Program",
  "transcript": "﻿Look, the best board members I've ever worked with are ones that have genuinely tried to help, and they've been looking at who they can connect me to in their network. I mean, that alone is  One connection  to a small business can completely change the trajectory of that business's success that is worth its weight in gold.\r\n\r\n\r\nAnd we have many, many examples of our members that have done that and created huge amounts of wealth. \r\n\r\n\r\nHey, what's up guys. I have a question for you, gun to your head. Maybe that's not a good analogy,  something very serious to your head.  If you had to answer the question. What is a board of directors? And what do they do? Could you do it?  I know I couldn't five years ago. And even today, every company that I've ever sat on the board of does it differently.\r\n\r\n\r\nSome meet monthly, some meet quarterly, some have minutes that are kept, some send it out once a year and you  assign that.  Well, today's guest, his name is Callum Liang, and he founded a company called Veblen director program, and it helps. Ambitious entrepreneurs  and corporate executives work their way up the board ladder by helping them first establish local boards with local companies.\r\n\r\n\r\nAnd then through that experience leverage their way up into publicly traded companies. It's a really interesting conversation where we talked about the role of a board, board governance, why it's important, why it exists.  And if you've ever been fascinated or interested in what exactly a board does and how it could apply to me, I think this is going to be a great episode for you.\r\n\r\n\r\nSo. Let's hop into the show. Okay, guys, we're going to get back to the show in just one second. But first a message from a sponsor who is, uh, me. Oh, it's me. Cause I'm doing the show for free. Listen, I want to give you a hundred dollars.  All you have to do is this. Go to Apple or Spotify.  Give me five stars, write a review, screenshot that review, send it to me, Nick at cofounders.\r\n\r\n\r\ncom and you will be entered to win a hundred dollar Amazon gift card. Every four episodes I'm going to choose a winner at random and I'm going to do this five times, 500 for five stars. I just made that up. That's what I'm calling it. Please go to Apple or Spotify, leave a review, screenshot it, send it to me, Nick at cofounders.\r\n\r\n\r\ncom and you'll be entered to win a hundred dollar Amazon gift card. All right, let's get back to the show. All right. Calum, welcome to Nickonomics. I am stoked to have you. My first international guest. I  mean, I've had people who were international, but never somebody who was based outside of the United States.\r\n\r\n\r\nSo stoked to have you. Can you give us in a sentence, just briefly, what is your business? And how do you make money?  Sure. So no, it's the short answer. \r\n\r\n\r\nSo I've kind of reached that stage of my life where I'm an entrepreneur investor, so I've got a bunch of different things. My core business is doing small business mergers and acquisitions, but I own different businesses, including one that is really designed to help people get their first board seats and kind of marrying.\r\n\r\n\r\nGood motivated potential board members with small businesses and helping to work out. Talk about your first business where  lots of small business M and a,  how did that come about? And how did that inform this board member business that you're in the process of?  So  look, it came about my business partner, a guy called Jeremy other has been  Doing distressed deals for a long time.\r\n\r\n\r\nI was going the traditional route of building  starting companies and building them. He was quite well versed in acquiring companies. And one of the things that he realized was if you put a group of companies together, you get that scale advantage and, therefore, the multiples. Go up and if you do it in a public hold co that comes with a lot of advantages, a lot of disadvantages as well, but a lot of advantages around the liquidity of the stock. \r\n\r\n\r\nSo about 10 years ago, we started working on designing what we call the agglomeration model, which  is to help small owner operated businesses. And this isn't tech or anything sexy. This is cash generating, the backbone of the economy type companies. Gen property, those kinds of businesses, boring businesses, boring businesses, but cash generating, and basically we find one of those where the founder doesn't want to leave, but they want to grow.\r\n\r\n\r\nAnd they've typically, they've reached a bit of a ceiling in terms of their knowledge, in terms of business just plateaus. And so we have a public list kind of hold co and then we bring the companies in, the founders stay in control. So it's their brand. It's their hiring and firing. It's their culture.\r\n\r\n\r\nYeah. But now when they go and pitch for business, they're a global multinational, which means they can win bigger contracts. They can level the playing field when it comes to recruiting top talent because they can now offer stock options. If they want to go and do their own acquisitions, they have the currency of the stock to go and do those acquisitions.\r\n\r\n\r\nSo it's a very successful model from a small business perspective. And we've been doing that for about 10 years. And where is that based?  All over. So we do listings in the U. S., although the U. S.  has more challenges than other markets. We're doing a lot in Europe at the moment, but yeah, we're pretty global in outlook.\r\n\r\n\r\nIn the English language, the English rule of law is kind of the guideline. Yeah, it's a similar model. I mean, Berkshire Hathaway does a similar model where they're, I wouldn't say they're small businesses, but it's the same, it's the same philosophy, right? Same thesis. Let's buy a business. Let's keep the owner in place and have them grow.\r\n\r\n\r\nAndrew Wilkinson just took a company public called tiny, which is based in Vancouver. Brett B. Shores, another investor. He has a company called permanent equity that does a similar type of investment model. Yeah, yeah.  Private. We, we take them public, but, and look, I think a lot of it is a reaction to.  Yeah, the private equity or the typical finance model comes in with this view of, okay, if I'm acquiring your company, I must be smarter than you. \r\n\r\n\r\nSo private equity sort of buys these companies,  kick the founder out, fire half the staff, level the company up with as much debt as it will possibly handle, and then flip it on to the next people. And actually. There's a lot of business owners where  the final number is less important than maintaining a bit of legacy.\r\n\r\n\r\nThey've been part of the community for 20 years,  the staff are like family, they actually care about it. Mm hmm. And oftentimes the only reason they're selling is that they have  us entrepreneurs are, we're idiots basically. And if, if things start, if things start to play, we get bored and we start new businesses and little property investments and all sorts of other silly things.\r\n\r\n\r\nAnd actually,  if you've reached that point,  oftentimes people sell because they think it's the only option, but if you can put them into an environment, Where suddenly they're part of a bigger group with a bunch of other business owners that they can't tell them what to do, and they can't be told what to do, but they now all have a shared interest in each other's success. \r\n\r\n\r\nAnd as you know, it can be quite lonely at the top. So being part of something bigger is actually very compelling. So yeah, it was kind of, it was to solve a problem that we had had as small business owners. And  so there, there is some form of it. In the United States,  the entity globally, like how large is the entity? \r\n\r\n\r\nSo we do different ones. So some are specific. Yeah. So  ultimately what we want to do is kind of have  give business owners the choice of, okay, I want to go and join one that's already got a hundred companies in there, because I know that there's going to be. Stable and that kind of thing. Or I want to join one of the new ones because I get all of the upgrade in the stock or yeah.\r\n\r\n\r\nI only want to join one that's industry specific or in this country. So the long term goal is to have these dotted all over the world at different levels.  Can you give me a, just an idea of size and scope, like how many companies are, are sort of a part of this network, if you will, that you're a part of.\r\n\r\n\r\nOne. That we did recently, which we got out of about a year ago after five years in it was a company called MDH Corporation, and we grew that. I think we did.  30 acquisitions over five years built up to about 170 million in revenue. A few of those we unwound and then a few, we ended up buying out, put into their own separate listing.\r\n\r\n\r\nWe have,  and that was all kind of old economy.  We have got another one in France, which is a group of a little bit more sexy stuff, sort of very sort of solar panels and kind of clean tech. Oh, well you say, you say France and sexy. I'm like, Oh, Louis Vuitton, like LVMH.  Your man there has bought up every company in that space.\r\n\r\n\r\nIt's not many left for us.  So what I find interesting is, You must have done dozens, maybe even hundreds of acquisitions in this space. Over a hundred and a lot of 10 years ago. Geez, Louise, do you have any idea of like what the total combined enterprise value of those a hundred acquisitions was? I think we got to about a half a billion and then stopped counting.\r\n\r\n\r\nThat's insane, man. Okay. So you've had a firsthand view of  not only what types of businesses, obviously, that are successful, but in going public in being public entities, there's a separate governance structure that's required, at least in the United States that I'm aware of, right? You have to have corporate governance in order to go public as a company,  board of directors, oversight, et cetera.\r\n\r\n\r\nHow  I'm assuming. That played into sort of your thesis of what you're doing now, because you're trying to, from what I understand, you're going to correct me.  You're taking that thesis, which is corporate governance is important  and helping small businesses apply that to themselves in their individual operations and industries.\r\n\r\n\r\nIs that correct? Or am I way off?  No, it's directionally correct. The few different elements that are worth addressing. The first I'd say is. The public markets for small companies is broken beyond repair. It's horrible. The amount of challenges, even at the biggest companies in the world. So you've seen like this  farce around, uh, Tesla stockholders not being able to vote.\r\n\r\n\r\nIt's one of the biggest companies in the world. Now you're a microcap trying to find out who your shareholders are and how they've like letting them vote, especially if you're international.  It's nigh on impossible. And so basically the public markets are really, really broken. And so what size is that micro cap?\r\n\r\n\r\nCan you just give me like an idea of micro cap is typically below 50 million market cap. Then small cap is typically  200 billion. And then up from there, I can tell you how we've addressed that, but just moving on. Yeah. You then have This kind of public perception of  boards and good governance. And if you,  if you wanted to,  Nick, you decide, okay, I want to be on the board of directors and you look at.\r\n\r\n\r\nWhat's out there, you'll probably find that there's some training programs out there that say, okay, we'll teach you  this will give you the Institute directors will give you a certificate that says, okay, now what they do is they basically train you on  corporate best practice of big company, corporate governments.\r\n\r\n\r\nSo S& P 500.  Good corporate governance, best practice. That's what you'll be trained on,  which is fascinating, but completely irrelevant to small business. \r\n\r\n\r\nNot useful. In fact, if you try to apply it to a small business, you would kill that small business. And ironically,  you're being taught stuff that the boards of those big five top 500 companies. They don't need to know they're so surrounded by advisors and legal people and even the market sends advisors into their meetings.\r\n\r\n\r\nThey don't actually need to know this stuff. So it's a  fascinating mental exercise, but it's irrelevant. So what we focused on was. Just by, yeah, and you're absolutely right by doing a hundred acquisitions, I've sat on a lot of boards, advised a lot of boards. I realized that oftentimes you had a lot of the wrong people on boards and you had people that were just in it for themselves.\r\n\r\n\r\nThey weren't really thinking about the wider stakeholders. There's definitely been this challenge of if you don't look the right way, if you're the wrong gender, if you went to the wrong schools, if you come from a different background, you're not going to get a seat on the board. And. Um, despite all the talk about diversity, very little has changed.\r\n\r\n\r\nAnd the reason that very little has changed is that directors are terrified of making the wrong choice. Because if they bring you, Nick, if I bring you into one of my PLCs and you turn out to be useless, or worse, you turn out to be a royal pain in the butt,  the average tenure of a director is nine years.\r\n\r\n\r\nSo I either put up with you for nine years, which, Is a long time, or I fire you, which makes our whole board looking competent and the share price plummets. So that's why it's so slow moving. And when I started looking at it,  there's 330 million businesses globally in the world. There's 33 million in mind blowing.\r\n\r\n\r\nIn the U. S. So like 10 percent in the U. S. And by the way, if you want a board seat, always look internationally because internationally, you're exotic and you're exciting  locally,  just a person, 330 million businesses in the world, less than 1 percent have an actual functioning active. I  mean, that's staggering and yet every single successful business you can think of has an active functioning board.\r\n\r\n\r\nSo what's the rest of the companies doing? Well, it's small businesses that basically kind of think, well, yeah, board sounds good, but I'll do it when I'm a grownup company. I'll do it when I'm bigger. I'm a huge believer that basically every entrepreneur, even if they're right at the kind of the entrepreneur ideation stage.\r\n\r\n\r\nFirst thing you do is you build a board of advisors. It doesn't need to cost you anything. You just get some smart people around you that you can bounce ideas off. And that's like your training wheels to ultimately developing a board. And I think entrepreneurs should not only have a board around them, but they should also sit on other people's boards because  you know, when you're running your own business, you're so in the weeds, you're so dealing with fires and you assume them.\r\n\r\n\r\nThat your problems are completely unique. And when you go and sit on the board of other companies,  you realize that other people are dealing with stuff and something got solutions that you haven't gotten.  Can you talk about the role of a board? Because just for some background, I've worked at  Publicly traded companies that would have been in the small cap space up to about 5 billion market cap is where I worked. \r\n\r\n\r\nAnd then I've worked in private companies and I've owned my own companies. And the public companies, like you said, there's a comp committee, there's a compliance committee. There's  a lot of different roles with who plays what who's appointed. They could be paid positions that could be given stock that could vest or they could be, you know, given right away.\r\n\r\n\r\nBut I think when people hear the word board,  I don't know that we actually know what that means.  Yeah, it's a very good point. And I think also what happens is, and you will have noticed this, that there is a theater to board that there's a performance element to it and boards were set up to  help businesses and to protect stakeholders and shareholders.\r\n\r\n\r\nThat aren't involved in the day to day running.  What has happened  as so often happens in business is people have become obsessed with the process and forgotten the end result. And so people get so drawn into, Oh, we've got to have the right people on the board and we've got to have these committees and go to the, and they actually forget  your job is to help the business grow.\r\n\r\n\r\nAnd so I,  part of what we have to do when we're training people in the Veblen director program is. Oftentimes kind of take them out of this perception of a board as being this big formal thing and get it back to, Hey, look, you've got an entrepreneur that's trying to solve problems for customers.  If you can help them solve more problems for more customers, they can create more jobs and that's a net benefit. \r\n\r\n\r\nSo get right back to those basics. Think in terms of how you can help the business rather than,  I think what's happened is we now think of boards, especially in public markets as being almost like police that are there to sort of sit between the regulators and look that, yeah, there's a lot of stuff in PLC boards that you have to be aware of, and that's fine, which is also why I think people should cut their teeth On the boards of small companies before they get into that PLC environment.\r\n\r\n\r\nWhat do you think are the most important attributes of a board? I've been on many boards. Some of them have been very effective and some of them have been, we don't even meet once a year, we just say we do. And everybody signs the attestation, right? Like it's not good,  but from your perspective, especially for small businesses, like.\r\n\r\n\r\nWhat do you think makes a functioning, a good functioning board? I take it right back to basics of what I'm looking for as a small business  owner.  What I want my board to do, what I want my board to do is to help me grow the business.  In some regards, that can be stopping me from making mistakes because as entrepreneurs, we have a tendency to, we tend to believe that that we're geniuses, but  sometimes it's useful to have someone say, well, maybe you should test that before you suck all the money into it.\r\n\r\n\r\nSo that's part of it. Look, the, the best board members I've ever worked with are ones that have genuinely tried.  To help, and they've been looking at who can they connect me to in their network. I mean, that alone is  one connection  to a small business can completely change the trajectory of that business's success.\r\n\r\n\r\nThat is worth its weight in gold. And we have many, many examples of, uh, of our members that have done that and created huge amounts of wealth just for themselves and also for the businesses by connecting them to an investor, connecting them to a big  That to me is way more useful than getting hung up on what's the, what's the latest change in ESG regulations that everyone needs.\r\n\r\n\r\nIt's interesting to hear you talk about a board of directors because  I don't know, are you familiar with some of the entrepreneurship networking organizations like YPO, EO, Tiger 21,  in many ways, those pods, whatever you want to call them. Those like small groups of entrepreneurs who are in those groups together. \r\n\r\n\r\nThey kind of function as a board. It's not a formalized board, but they meet, they have hot seats. They're talking about the difficulties in their business. And like hearing you explain it as an entrepreneur, you're it's lonely. And so we're almost like outsourcing that connection and that accountability that a board brings into these.\r\n\r\n\r\nNetworking organizations, and I'm not saying that they're bad, but  why do you think we haven't been able  to build a stronger ethos of board membership at the small business level? In particular, you're absolutely right. And the Veblen director program with very much following. That model of EO and YPO. So right now, so we've only been going less than two years.\r\n\r\n\r\nWe have 180 members. We are  doing something like a dozen board seats a month. People are getting onto a dozen board seats a month. And ultimately like that's an incredibly valuable,  people jumping on boards and then they're upscaling to bigger boards. And it's incredibly supportive and valuable network.\r\n\r\n\r\nLook, I think the reason why most businesses don't consider it is again, there's been this obsession with process and boards have got this reputation and have worked very hard to protect this reputation as being super exclusive and board members of these business gods. I mean, like, if you ever worked in a corporate. \r\n\r\n\r\nLike for every quarter, there's all the boards coming, the boards coming, we've got to prepare these packs and like everything stops for two weeks while everyone does this for a board pack that the board member goes. And it's just nonsense and theater. And I think  entrepreneurs often assume that they need to pay a lot of money for board members.\r\n\r\n\r\nAnd what I learned very early on in my career was. I didn't have any reputation when I was a young entrepreneur. I didn't have any reputation. I didn't know what I was doing.  And so I put together a board of advisors. I didn't know that's what it was at the time. I was just taking entrepreneurs out and trying to get them drunk and learn their secrets. \r\n\r\n\r\nThat's a board. You just described a board. Yeah. I just reframed it as a, as a smart,  but what I was really trying to do was  What I learned very quickly was a lot of their advice was rubbish, and it was because they just didn't have any experience. So I had a guy from, theoretically, a guy from a big company  who was on this board, and his advice was rubbish because he'd only ever been in the corporate environment.\r\n\r\n\r\nWhat he thought made sense wasn't. Useful for a small business. However,  it was so valuable because I could leverage the name of the big company.  So when I went out to clients and I could say, Hey, we've got this advisors from this company. Now they didn't know whether he was the janitor or the CEO of that.\r\n\r\n\r\nCompany, all they knew was that this company had that somebody sitting on my board. And so I was able to leverage that to 10 X the times that I was raising money for this business, because now I was leveraging off other people's credibility. And that was like my big eye opener moment. And at no point did I offer them any money.\r\n\r\n\r\nUh, cause  What I realized, what I said was, look, if we're successful, then I'd love to give you some stock in this at a time, but  for now, it's just very informal coffee once a month to bounce ideas around.  What you realize is  that there's a lot of people in corporate world.  That are frustrated entrepreneurs and they love the idea of living vicariously through you.\r\n\r\n\r\nAnd so if  they can call themselves an advisor to a startup, suddenly they've got something interesting to talk about at their dinner parties and you don't need to pay them. You just leverage off the brand. You leverage off it. Maybe they can make some introductions, give you some good knowledge. They don't have to be on your board forever.\r\n\r\n\r\nLike you can replace them now as you grow and scale. That brings up a really interesting point. Before I ask about like your business economics  for small businesses, like publicly traded companies, they have a board and typically they'll have a stipend and or stock options, right? A combination of the two,  but for small businesses,  stock is hard to give. \r\n\r\n\r\nRight. How do you value it? Where does it vest? If it does vest, then there's tax implications and you got to worry about for a publicly traded company. They've got whole departments. They've got the accounting team that's going to help a board member, but for a small business that you may not have the level of sophistication necessary in order to implement something like that. \r\n\r\n\r\nHow do you recommend in this program? Small businesses create their boards. Is it the way that you're talking about these informal relationships or is it paid? Like, what does it look like?  So bear in mind, what we're trying to do with the members of the Veblen director program is get them onto the board ladder  and the easiest way to get.\r\n\r\n\r\nOn to the board letter is not to apply for an existing board seat because you haven't got any experience, so nobody's going to hire you. It's to go and create a board for somebody else. And so what we, what we do is we say, go and find a small business owner, offer to build an advisory board for them.\r\n\r\n\r\nIt's not going to cost them anything.  You're going to go and find four or five interesting people and do that for them. Very informal as well. But what you're saying is look at the end of the year. If we've done a good job and if you want to retain us, then it's going to be 50 grand a year or whatever terms you, you negotiate.\r\n\r\n\r\nAnd most entrepreneurs are very open to that because there's no commitment. It's like, okay, if you've added value, then yes.  The other thing that we teach our members to do is to say, look, I'm more than happy to give you an hour or two a month as an advisor, but if I really think I can add value, so look, I have an investor in my network who I think would be interested in this.\r\n\r\n\r\nIf I introduce you and they invest, then would that be worth  5 percent of what they invest or a slice of the equity in my deals?  And that's a really, it's very easy for a small business owner to say yes to that because  everyone promises stuff. Nobody delivers. So  offering something in the future is very easy to do.\r\n\r\n\r\nAnd if you actually deliver, that's great. And we had an American gentleman, retired entrepreneur.  Went and sat on the board of a food and beverage startup in Europe,  um, did exactly that said, look, if I can make an introduction, it wasn't an investor. It was actually an F and B company in the U S  and he knew they needed the European distribution partner.\r\n\r\n\r\nSo he said, so F and F and B food and beverage. Okay. So he set up that introduction. He set up that deal. And it's  to him, it's worth two or 300, 000 in the first year. Oh, my gosh. Yeah. So, and the startup is thrilled, absolutely thrilled to have this. The American companies now that it's European distribution partner, they're super happy.\r\n\r\n\r\nIt's incredible how quickly these things can become very lucrative. Okay, guys, we're going to get back to the show in just one second, but first a message from a sponsor who is, uh, me. Oh, it's me. Cause I'm doing the show for free. Listen, I want to give you a hundred dollars. All you have to do is this go to Apple or Spotify. \r\n\r\n\r\nGive me five stars, write a review, screenshot that review, send it to me, Nick at cofounders. com and you will be entered to win a hundred dollar Amazon gift card. Every four episodes, I am going to choose a winner at random and I'm going to do this five times, 500 for five stars. I just made that up. It's what I'm calling it.\r\n\r\n\r\nPlease go to Apple or Spotify, leave a review, screenshot it, send it to me, Nick at cofounders. com and you'll be entered to win a hundred dollar Amazon gift card. All right, let's get back to the show. Tell me again. I apologize. How do I pronounce the name of the company?  So the company is called Veblen  and it's after the  Veblen, V E B L E N.\r\n\r\n\r\nIt's after the economist, Torsten Veblen, who.  He was the one that realized that the normal laws of economics don't apply to high status goods.  So the, the more you charge for a Louis Vuitton bag, the more valuable, the more you get. So in the world of Instagram,  Lambos and watches is what gives you high status in the world of LinkedIn, where we live, board seats gives you high status.\r\n\r\n\r\nSo that's kind of interesting. So how long have you been doing this business?  It's less than, I think it's about 18 months. And you said you had, is it 150 members? I think. Okay.  100, 180 members. How did you find them? Like, how do you acquire customer? How do you acquire members? Yes. So LinkedIn  is, yeah.\r\n\r\n\r\nOffering board seats is crack cocaine for LinkedIn. \r\n\r\n\r\nYou're a LinkedIn crack dealer is essentially what you are. Yeah. We started doing monthly webinars.  How'd you get a board seat? Just kind of talking through the things we've talked about. I wrote a book called Boardroom Blueprint, which actually, if you go to boardroom blueprint. com, your listeners can get a free copy at the moment.\r\n\r\n\r\nSo yeah, mostly kind of funnels. And what we're doing now is  breaking down like, so  our sort of demographic is ambitious people. It's career ambitious people, whether you're an entrepreneur or whether you're executive. And now that we're sort of 18 months in. We're starting to split the funnels. So we have a one specifically for entrepreneurs, which is, this is how you apply to get a board of Veblen directors.\r\n\r\n\r\nThis is how you get on the board of other people's companies. And then for executives, it's more about, Hey, look, this is how you build your reputation.  So break that down again. So I could apply to have a board of Veblen directors,  or I could become a part of the community. That's that, that's, that's. Where I'm a board member to people applying both and it's completely free for a business.\r\n\r\n\r\nThey fill in a form and it goes to our members. Our members will apply and then they just pick and choose the four or five that they want because our members are doing it to get that experience.  And interestingly, like when you.  Oh, we see this happen. I mean, if you do a search on LinkedIn for Veblen every single day, you've got members saying, Hey, I've just got my first board seat with such and such a company.\r\n\r\n\r\nAnd what happens is that's often the most viral post you'll ever put on LinkedIn because all of your network.  Suddenly sees you in a completely different light. Like if you've just been Bob in accounting for the last 15 years and now you're bobb in accounting, that also sits on the board of another company like  wow.\r\n\r\n\r\nRight? There's something multiple. And so everyone's kinda like, well, congratulations, but, oh, have you spoken to this company? They might be interested in it. Let me put you in touch with this and right.  With a gentleman, uh, he got a position on a not for profit. So he basically joined the program. Within a week, he'd figured out his framing.\r\n\r\n\r\nHe reached out to this non profit that he is a big fan of. They said, yeah, we'd love to have you on the board. So he got that. It's actually a paid board seat.  He posted about it and another non for, not for profit.  Wow. Like I didn't know you were interested. Would you be interested in sitting on our board as well?\r\n\r\n\r\nSo that's awesome. Literally within the space of a month, he was sitting on boards of  two non profits that he really cared about.  So if I'm Bob and accounting. And I'm like, Oh man, I, I love what Veblen is doing.  What does that look like? Am I paying like a yearly membership fee? Am I taking a course? And then I'm a part of a community that sort of works together.\r\n\r\n\r\nHow?  Yeah. How does it function? Exactly right. So,  so first of all, like we have a very, very high success rate. So 60 percent of our members. Get that first board seat within 60 days. In fact, we, the, the success rate has blown us away. We actually guarantee it. Like if you haven't got a board seat within 12 months, we'll keep working with you until you have, we've never had to use that.\r\n\r\n\r\nSo basically what Bob does is he watches our web, we have an interview and look, if we don't feel that  not only we can provide value to you in terms of your Making sure you get that policy, but also  if we feel you're not going to have value to the community, you're not going to get in because we, we, we want this to be a powerful community.\r\n\r\n\r\nIt gets approved. It joins the program.  There's a whole bunch of content to work his way through and it's, I bring in a lot of experts,  everything from sort of investor relations, DEI, like government. So all these different. But it's super, super tactical, practical stuff,  none of it's theory. It's like, this is actually what companies need.\r\n\r\n\r\nThis is how you can make a real difference. Because we don't want more bad board members. We want people to be good board members. True.  So  he can work through that at his own pace. It's adult learning. Like there's no kind of punishment if he skips a week or anything. I like that. Adult learning, not self paced, adult learning.\r\n\r\n\r\nYeah, and we put them into an accountability group. So everyone gets put into an accountability group. They connect every week. The entire purpose of that accountability board is to get you a paid board seat. And you're on that board to get other people a paid board seat. So you're constantly looking out for each other.\r\n\r\n\r\nYou're constantly going out to companies, say, Hey, I just spoke to this company. They're willing to do a board. I'm looking for someone with an IT background. I'm looking for someone in South Africa. I'm looking for someone like. But for these boards together, and so everyone, it's kind of  look at, as you come from an entrepreneurial background, we're always trying to add value to other people.\r\n\r\n\r\nRight? In the employee world,  if there's 1 board seat and 2 people, or there's 1 promotion and 2 people going for it, that person is your archenemy. It's a zero sum game. Yeah. Yeah. When you lose, you know, you win. I lose. Exactly. And so oftentimes we were a little bit shocked when they come into the community where everyone wants everyone else to do well.\r\n\r\n\r\nBecause. The value of my network goes up if Nick, if I can get you a seat on this fantastic  biochem company that's growing,  like, it's not right for me, but if I can get you on that, then I now have a good contact on the board of a fast growing company. Like, that's really cool. It's an incredibly supportive  community and yeah, really, really inspiring.\r\n\r\n\r\nHow does the pricing work? So I'm Bob and accounting,  do I pay a year up front? Is it, is it monthly? Yeah. So there's a one time in initiation fee, which is 3, 750 us. And then it's 150 a month to stay in the community. Is it just up to the member to decide? Yeah. Okay. I want to stay in. Is it like, Hey, you got to sign up for a year at a time?\r\n\r\n\r\nSo you have to stay in for a year, so you're locked in for that first year. And then at the end of the year, it's basically on us to make sure that we're adding enough value that you want to stay in. But bear in mind, like the bigger we grow, the more companies are coming to us with board seats, the more valuable that network becomes.\r\n\r\n\r\nAnd I think as you evolve up the ladder, you come across different challenges. I remember the first PLC board  position that I got,  we were coming up with Problems, I hadn't, not only did I have no idea what to do. I didn't have anyone I could talk to. And so having other people that sit on boards that say, Hey, look, have you had somebody short your stock before?\r\n\r\n\r\nWhat did you do? It's really, really useful to have that support network. So nobody's dropped out yet. So how have you thought about building the infrastructure necessary to support the members of Evelyn? Cause  obviously you probably need some facilitator to make sure that their accountability group is running appropriately.\r\n\r\n\r\nYou probably need someone to set up. The, like you said, you bring in professionals to talk about DEI compensation, board governance, those types of things. So there is a real cost. To it. How do you think about building the infrastructure necessary to support the community that you've built? So I've built it very organically, mostly using freelancers. \r\n\r\n\r\nI, at the beginning of this year, I brought in a CEO who's absolutely fantastic, a woman I've known for about 20 years, she had built a similar community of entrepreneurs and now she's coming to build this network. So, and to be honest, we probably.  She was expensive. Like she's very good and probably most good people are.\r\n\r\n\r\nYeah, probably like if I'm  being objective,  I probably should have grown another year before I bought her in to get the best out of her, but  she was available and I know that she, like we can grow into her, she will be able to fire on full cylinder, she's doing an amazing job now, but.  Going from a million a year to a million a month is where she adds the most value.\r\n\r\n\r\nYeah, I've got sort of various other teams that do the marketing. We put out a lot of marketing content. Talk about the marketing content. Like do you have any idea how much it costs you to acquire?  A customer. I know that's a weird way to say members of the community, but it's got to cost something for you to either put out content or for you to cold contact.\r\n\r\n\r\nLike what are your marketing channels currently and how much does that kind of cost you?  Up until about three months ago, we really didn't do any adverts. We just did organic content, webinars, partnerships.  You're so, you know, LinkedIn, Twitter, whatever your social media was. Yeah. So the three primary channels, LinkedIn is definitely the main thing. \r\n\r\n\r\nWe have a YouTube channel and then Twitter to a lesser extent. And I think one of the teams just set up Instagram and ticked off. That's funny. I just did that recently. And I'm like,  I have no interest to be on Tik but I know somebody who's posting my content there, you know, like I go look three now. And then I'm like, Oh, that's interesting.\r\n\r\n\r\nThey posted that. Yeah, exactly. So we're working on ads. We haven't really gotten enough. Data yet to kind of like we're constantly testing and tweaking those funnels and  Working out what works and what doesn't we what is working quite well is  Most of the experts I bring in are basically from my network.\r\n\r\n\r\nSo I've spent 20 years building up a great network and so I can lean on people Because we've got quite a big audience now. It's easier. So in a couple of days i'm doing a discussion with Noah Kagan Which  Helps us reach a wider audience. And then that filters through to Veblen as well. I suspect like the biggest impact will be.\r\n\r\n\r\nYeah. Yeah. Yeah. I mean, it, it, it really,  you know, the value of, of podcasts, like people,  they listen to this and you might be in there, they're in the car, they get really  motivated and then they forget about it. And then they see something on LinkedIn in six months time, they go, Oh, I remember that. It's interesting.\r\n\r\n\r\nI was having a conversation with somebody about this recently. Do you remember during COVID? I don't, you may not. On YouTube. There is. Mainly young men  because men are idiots, but they were doing these trick shots.  They'd like, you know, with ping pong balls down the stairs or like one of them was flipping cards  and it started out with them just flipping cards and trying to land inside of a pin  clothes pin.\r\n\r\n\r\nAnd then they upped the ante. It was like, okay, a clothes pin that's spinning around on a train. Oh, that that'll be hard. Right. And they're flipping it. And the first time it took them two hours. And the second time it took them six hours to get it. Cause now it's on a train. And then they're like, well, what if we had a windmill and had to go through the windmill propellers and then land on the train that was moving?\r\n\r\n\r\nAnd you know, that took them 18 hours.  And  I laugh at that because I feel like posting on social media in particular is like that I can control my wrist flicking, but when it finally lands, I can't tell you that I did anything different. I can just tell you that I was consistent. I'm not gonna be able to go back and say, Oh, it was this new strategy that I tried.\r\n\r\n\r\nLike, no, that's not how it works. You just have to stay consistent. And you never know when somebody in their customer journey sees that piece of content and makes a decision to buy. And I think you're articulating that. Yeah, totally. Right. It's insanely frustrating.  You can't, you can't not play, play the game.\r\n\r\n\r\nI think, I guess the challenge for us, and we touched on this before that we start recording around sort of come to. Creating content. And you basically say, this is my avatar. I'm going to try and produce as much content to help this in individual. And it feels like it's very crowded. Like it feels because we're in the space and we see so much other content and we look at the people that are 10 years ahead of us and go, Oh, the content good.\r\n\r\n\r\nAnd. But actually, if you look at LinkedIn, less than 1 percent of us are producing content on LinkedIn. Like, LinkedIn feels more on shouting, but it's less than 1 percent of us. And you also know that, and like,  for all of our  aspiring board members, building their profile is critical because this is how people are going to find them.\r\n\r\n\r\nIf I, Nick, if I recommend you to a board, The first thing they're going to do is Google you. The first thing that's going to come up is your LinkedIn profile. And if it doesn't look like you're a  grown up board member, you like, I'm just going to pass that. That's so that's absolutely critical. And I think  the other thing that  where podcasts are super useful is that  when people do get excited by an idea, they want to deep dive, they kind of,  we all do this, we all kind of get sucked into these rabbit holes of, you know, what's Suddenly spending like seven, eight hours  watching some rando that we'd never heard of.\r\n\r\n\r\nYeah. But it's exactly what we need at that point. And so you want to have that content available for that's a really interesting way to articulate it because you're building trust. And in order to build trust, people have to spend time with you. And if you don't have a bank of content, they can't spend time with you.\r\n\r\n\r\nBecause you can't schedule, you know, one on one calls with everybody. Google did some research a while ago. Before you make a high purchase ticket, a high ticket purchase,  you, most people will need to have spent at least seven hours with the brand in some way or another across multiple different channels. \r\n\r\n\r\nThat's reading an article, reading a book or listening to a book, listening to some podcasts, watching some YouTube videos. And our brain doesn't differentiate between what we see on the screen and what we see in person as well. That's why we mourn when somebody famous. Dies. Even though we've never met them in person.\r\n\r\n\r\nAnd so if you can, the higher the price point, the more you need people to have spent that time with you, which means you need to be delivering valuable content that they're learning something from. I love that. I just want to say, I. I think you've  found a niche. You've also created a niche in identifying sort of this gap in the market, especially at the local level of helping people get on boards.\r\n\r\n\r\nCause there are a lot of people,  whether it's for the money or for the prestige are interested in being on a board and you've like created this pathway for them.  To not only think that they can do it, but to have it actually be attainable, right? Like there's people in their camp in their corner, rooting them on.\r\n\r\n\r\nYou're teaching them how to be good board members. You're not just trying to extract value out of them to become board members and put in your pockets. Like, no, we, this is the curriculum that we have around it. So I think it's a really fascinating and interesting business that you've built. That's mission driven.\r\n\r\n\r\nAnd that, you know, you can tell that the quality is actually there. So I applaud you. I think that, I think this is a, just a fascinating application of an entrepreneur. Finding an An unexploited need, an exploited sounds bad. An unmet need in the marketplace. Look, ultimately it is entrepreneurship. It's around building businesses that attract the people that you wanna hang out with.\r\n\r\n\r\nAnd ambitious people and entrepreneurs. And those are the people I wanna hang out with. And if I can get a few thousand people onto boards around the world, that's a super valuable network. Yeah, that's a big win, my friend. Yeah. Alright, I have some rapid fire questions for you to. Yeah. To wrap this up. Is that cool?\r\n\r\n\r\nSure. Go for it. Okay.  What do you love about this business? The success of my clients. Like, I know that sounds really cheesy, but honestly, it's the coolest thing when, and they've been like this, they're getting so much better offers than I ever got, \r\n\r\n\r\nlike just working with really cool companies and these cool companies come in and I, I want to apply for them. Yeah. Yeah. So, so yeah. That's a good answer.  What do you hate about it? What's difficult about the business model? Look, I mean, entrepreneurship is difficult. It's a, it's like trying to flick a card through a windmill into a moving train clip. \r\n\r\n\r\nSo there's always new challenges. I think right now we've done a very good job of appealing to people who want to sit on a board.  There's a much, much bigger audience out there that doesn't even know that a career option for them, they're ambitious, they're driven, but it never occurred to them that they might be able to sit on a board.\r\n\r\n\r\nSo  trying to get to that wider audience, that's sort of the next challenge for us over the next few years. As you sit here in 2024, all of us entrepreneurs in some way, some form or fashion think the grass is greener. And in some other business for me, it's real estate, commercial real estate. I'm like, man, it'd be just nice to own a piece of commercial real estate.\r\n\r\n\r\nAnd it's just pumping off cash flows and appreciating a little bit faster than inflation. So I get jealous. That's me.  Are there any businesses right now that you're jealous of?  A very close friend of mine is a very successful entrepreneur called Daniel Priestley. And he has a business  called Dent, which I helped him launch in Asia.\r\n\r\n\r\nHe has a thing called a scorecard, which is a great way of collecting data on customers. So basically a quiz that goes into a whole funnel. That business is amazing. Absolutely smashing it and yeah, he takes great pleasure in telling me how well it's doing every time I speak to him. What's it called? Dent?\r\n\r\n\r\nYeah. So it's the app is called the scorecard app. It's just okay. Lowing up is a great marketing tool for entrepreneurs.  I just found out about these businesses where their whole business model. Is  market research and surveys  where they acquire customers. Essentially, they're acquiring of customers is getting people to opt in to take surveys.\r\n\r\n\r\nAnd then they've got this database of people that they can go out to  and they know the demographics. They know how they came to them. They know what products they're interested in. So when larger corporations like Nike or Procter and Gamble come and they say, Hey, we want to get a sense of where our customers are with what their outlook is on the economy.\r\n\r\n\r\nThese companies then say, okay, cool. Pay us X number of dollars. We'll go out and survey them.  I just found that fascinating and it's not the same as what you're describing, but it's similar, right? You're getting market sentiment. You're getting the scorecard. You're getting people insights into their customers.\r\n\r\n\r\nYeah. And then I'm in market research as a, as a huge, huge business at the corporate level, there's an interesting.  So on the Veblen direct program as well, there's, have you heard of expert networks?  So, yeah, so these big consultancies pay an absolute fortune to speak to experts. And so one of the things that we're doing, cause we're putting so many people onto boards in different sectors and they've got such great backgrounds is ultimately that's another revenue stream that our members can access as well.\r\n\r\n\r\nSo, um, if there's a listener list, You know, who doesn't know expert networks, essentially what they do is  let's say I'm a private equity company. I'm an entrepreneur. I'm a fortune 500 company, whatever it is.  I have a thesis and I'm trying to either launch a product, just gather more, more information. I can reach out to people who are members of this expert network. \r\n\r\n\r\nThat are maybe a VP at a competitor or in the space and they have a ton of experience and I can pay it's expensive, you know, 1, 000 an hour or more to gather really specific, detailed, actionable information. And it's really, really valuable. So. To hear you kind of, that makes sense too, right? Like the, there's a network effect with the Veblen community that can function in a very similar manner.\r\n\r\n\r\nYeah, definitely. No, it's exciting. Second to last question. If you have two hours in your day and.  No kids, no family, no business, nothing, right? You don't have any other responsibilities.  What are you obsessed with right now? What are you doing with that time?  So right now I've just moved house and  everything's in boxes.\r\n\r\n\r\nSo that's what I'm doing with my time. Okay. That's fair. Generally, I try and do a fair amount of exercise.  I'm just getting back into Muay Thai and boxing again, which  But yeah, my, my eldest daughter is a competitive climber as well, like bouldering and stuff. So wow. Okay. I occasionally do a bit of that, but yeah, I try and do something  physical.\r\n\r\n\r\nYeah. I have four boys under 10. So for me it's a wrestling. I go break away from this and we just go wrestle. It's fun. So I was without kids or screen. It's like the dream.  I know  the only time that happens is when we're sleeping. And even then, I'm not sure we have two hours of uninterrupted time with no kids running in. \r\n\r\n\r\nIf you had to give yourself advice 10 years ago,  what advice would you give yourself? Interesting. So normally that question is what advice would you give yourself 20 years ago? And my answer is always, it doesn't matter. I wouldn't have listened 10, 10 years ago,  I was actually starting to listen a bit more.\r\n\r\n\r\nUm, \r\n\r\n\r\nso I think, so I think that the biggest.  We made, so we built the agglomeration model up. So 10 years ago was when we were thinking about the agglomeration model of taking companies public. We designed it from the bottom up to help small business owners. And it's been very successful with that. It took us a long time to realize how  weird the public markets are and how corrupted and expensive that they can be. \r\n\r\n\r\nTook us too long to realize that actually. The advice that we were getting given from all of these very expensive advisors actually was self serving for them and not what's in the best interests of your shareholders and people. And so when we learned that very expensive lesson,  then we had to go and re engineer it from the point of view of disregard all of that advice.\r\n\r\n\r\nAnd. Do it the way you want to do it. And if you do it that way, actually, it's very lucrative again. So yeah, I would have tried to explain that to myself 10 years ago, but I, that's an interesting perspective. I only know the United States. I don't know the international markets, but here in the United States, we have kind of two major markets.\r\n\r\n\r\nWe have the NASDAQ and we have the niece, the New York stock exchange.  They're kind of a monopoly and there's been some. Mark markets that have tried to launch recently, but there's 1 that's gaining steam right now. And it has black rock as 1 of its main sponsors. It's Texas. Texas is trying to launch their own  exchange.\r\n\r\n\r\nAnd so, like, hearing you talk about just the difficulty in the self serving nature of these.  Established markets. It would make sense to me that of course there's underhandedness. Of course, it's difficult. It's a very expensive process. I know in the United States, it's, I want to say something on average of 7 million to take a company public.\r\n\r\n\r\nSo it's not a cheap process by any stretch. And I don't think I would have realized that. Definitely not 10 years ago.  And look, I think actually  blockchain ironically would solve a lot of this, but it's, it's a trillion dollar industry and people in the industry have no interest in it being disrupted.  No, no, this is true.\r\n\r\n\r\nIt's going to drag on for a long time yet, I think this was an awesome conversation. I didn't know what to expect, but I learned a ton from you. Thank you so much for being gracious with your time. If people want to come find you, where's the best place again? Give the website for your book. I think that would be really helpful.\r\n\r\n\r\nGet a copy of the book for free at boardroom hyphen blueprint. com. Connect with me on LinkedIn. They do mention this podcast. Otherwise, like in your connection request, otherwise. You'll get lost, but I mentioned this podcast and yeah, LinkedIn is kind of the best, best place to connect. We'll do well.\r\n\r\n\r\nAppreciate you coming on. Hopefully we'll talk again in a year and see how things are going. Go. Appreciate it. Thanks Nick. See it. All right. That's it. Another one for the books. I'm fired up. I don't know what else to say. I hope you found something valuable in that conversation. I hope you learn something.\r\n\r\n\r\nI hope there's something that you can apply to your business today, tomorrow, in the future that makes you money and makes you more successful. It gives you more time with your kids. If there was something I'd love to hear about it. In the comments below, you know, give me some feedback and if you like actionable advice and you want more of this, I write a weekly newsletter that gives insights, tips, and tricks into the world of entrepreneurship.\r\n\r\n\r\nSubscribe in my bio.  And if I can help you in any way in your entrepreneurial journey, don't hesitate to reach out to me, Nick at cofounders. com. Sorry, Kelly, for more emails. And the last thing is. Remember,  curiosity is a superpower and you can use it to your advantage. As my mom used to say, there's no such thing as a dumb question,  only dumb people. \r\n\r\n\r\nWe'll see you next time.",
  "metadata": {
    "duration": "",
    "date": "2024-07-31",
    "platform_source": "Google Drive"
  }
}