{
  "episode_number": "113",
  "episode_title": "How Constraints Built OpenPhone into a Thriving Business with Daryna Kulya",
  "guest_name": "Daryna Kulya",
  "business_name": "OpenPhone",
  "transcript": "﻿Nikolas Hulewsky (00:00.164)\r\nAll right, I'm going to say it. Doreena Kulia. I didn't butcher it. Okay. How would you say my last name, by the way?\r\n\r\n\r\nDaryna Kulya (00:06.431)\r\nYou said it perfectly. That was so great.\r\n\r\n\r\nDaryna Kulya (00:11.302)\r\nNicholas Hulewski?\r\n\r\n\r\nNikolas Hulewsky (00:13.774)\r\nHulewski, okay. Yeah, my dad has said it multiple ways. Hulauski, Hulewski, and he like does the yich at the end. And then when I lived in Hungary, it was Hulewski, just because that's you said it. And then when my wife and I got married, I was like, we just got to choose a way. So we say Huluski, funnily enough. Yeah, I know. Because I had a friend of mine who was like, dude, you know what? Your name is Hulu, like the website, Huluski.\r\n\r\n\r\nDaryna Kulya (00:19.933)\r\nLovsky. Yeah.\r\n\r\n\r\nDaryna Kulya (00:33.121)\r\nokay, okay.\r\n\r\n\r\nNikolas Hulewsky (00:42.37)\r\nAnd my name has been so hard for everybody I've ever met that I was like, done, easy. Hulu, Huluski, easy peasy.\r\n\r\n\r\nDaryna Kulya (00:48.893)\r\nIs this why you say Nick? You're just kind of like Nick because your last name is difficult. You're just like, Hey, Nick.\r\n\r\n\r\nNikolas Hulewsky (00:53.944)\r\nYeah, yeah, it's Nick. It's just Nick. I'm not even going to try Huluski. But and I mean, you know this, people will call you anything. And then they'll be like, hey, Darna. And you can correct them 17 times. But it's always going to be I was talking to Darna the other day. It's like, that's that's not my name. I'm not I'm not Darna. And you kind of you just get used to it. OK, so I'm super freaking excited to talk to you. You are the founder of OpenPhone.\r\n\r\n\r\nDaryna Kulya (01:14.323)\r\nYeah, your daddy is good.\r\n\r\n\r\nNikolas Hulewsky (01:23.69)\r\nAnd I want you to just give a brief, what is open phone?\r\n\r\n\r\nDaryna Kulya (01:28.223)\r\nYeah. Well, thank you so much for having me. I'm really excited to be talking to you. OpenPhone, just as the name might suggest, we're a business phone system for, we serve small businesses, startups, and we really want to build an amazing solution that helps companies connect with their customers a lot more easily, in a much more easy way. So yeah, that's what we do.\r\n\r\n\r\nNikolas Hulewsky (01:50.612)\r\nThe way I understand it is when you're launching a business or when you're a small business, you don't necessarily have like the enterprise solution for a phone system. So I am the owner, I'm calling all the customers. And unless I have a Google voice number, which many people don't even set up, that's my number. I'm giving it to people. And the phone number is really intimate. I mean, an email is kind of intimate, but the phone number is very intimate. It's like the new social security number. You don't want to give it out and you don't want to change it because then you lose kind of all your contacts.\r\n\r\n\r\nDaryna Kulya (02:20.225)\r\n100%. But I'll tell you even one thing that I know people do. So to me, like all of the things you mentioned, a hundred percent, but here's the other thing, right? So let's say you, you put a phone number on your website, your business is taking off. You have more and more clients. Here's what happens at some point you start maybe hiring people and growing your team and you bring on people whose job is to actually like, Field your calls, respond to text messages. But if you put your personal phone number out there,\r\n\r\n\r\nYour customers are forever going to be texting and calling you. And like as a founder, you're like happy to help customers, right? No, not a big deal. But the problem is that, you know, you don't have a way for your team to actually help out and like delegate those conversations. So that becomes just like a, like a, a roadblock in helping you scale. So.\r\n\r\n\r\nNikolas Hulewsky (03:08.356)\r\nAnd give me an idea, how big is the company? How long have you been around?\r\n\r\n\r\nDaryna Kulya (03:13.761)\r\nYeah. So we started, 2017, 2018, depends, depends on the, kind of milestone. So we've been around now for, you know, six, almost seven years. we, from a customer perspective have over a hundred thousand customers and our team, is, you know, we're a little over a hundred employees.\r\n\r\n\r\nNikolas Hulewsky (03:30.382)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (03:35.908)\r\n100,000 customers. Okay. Does that mean 100,000 businesses? Or is that like 100,000 individuals who are using it? So one business might have 10 people who are using it they're all counted.\r\n\r\n\r\nDaryna Kulya (03:41.855)\r\nIt's over.\r\n\r\n\r\nDaryna Kulya (03:47.841)\r\nThat's a great question. From a business perspective, I have to look at the exact number, but we have over 50,000 businesses. So if you want to look at businesses, over 50,000.\r\n\r\n\r\nNikolas Hulewsky (03:59.406)\r\ndoing it. That's a that's a freaking ton. 50,000.\r\n\r\n\r\nDaryna Kulya (04:02.433)\r\nI don't know. be honest, it sounds, mean, I know it's a lot and it's kind of like an interesting thing. Like on one hand, I'm, I'm so like, I'm sitting here being like, so happy to tell you this, but this at the same time, like every new customer we get, I'm just like, so happy for every one customer, or if, if one customer is unhappy, I'm so unhappy. So the numbers may seem big, but like for me, psychologically as a founder, I'm kind of like,\r\n\r\n\r\nYou know, I, today I met one of our customers this morning and to me it's like, this is my only customer in my head. Like I don't really think about thousands. like, you know, I still know a lot of our customers personally.\r\n\r\n\r\nNikolas Hulewsky (04:46.308)\r\nIt's incredible. like usually I'll ask, what's your revenue? What's your bottom line? Like those types of things. But you are an interesting, I don't have very many, well, I shouldn't say very many, probably 30 % of the people that I have on have raised venture money. And you are one of those tech founders, right? So you went out and raised venture money and you can't talk about revenue and valuation and all that stuff, even though I want to ask so bad. So a hundred thousand customers,\r\n\r\n\r\njust feels like a lot. From my perspective, there's the enterprise solutions for what you do, like Ring Central. And again, I'm going to give you like what I think it is, and then I want you to correct me because you're much smarter than I am. So there's Ring Central, and I'll use Ring Central and they're like a voiceover IP. My phone is going over the internet, it's not necessarily hard lined. And there's a bunch of functionality within Ring Central.\r\n\r\n\r\nBut for the most part, I'm using that as my switchboard to direct calls and make sure that things are getting answered in a timely manner and responded to in a timely manner. Is Ring Central the good analogy to use for open phone?\r\n\r\n\r\nDaryna Kulya (05:58.355)\r\nIt is, it is definitely good. now, mean, we are, so in our space, in the category that we are in, they are, you know, they're the public company. They, you know, they are the kind of very, very grown up version maybe of what we do. But I should say, I should for sure say our vision for how we're growing and what we're building is, is starting to be quite different from rank central because, know, when we started the company.\r\n\r\n\r\nOur mission has always been not just giving you a way to call and text people. Cause I think that's like, you know, the world doesn't need another app to just send messages. Right. The vision for us has always been how do we help our customers? How do we help small businesses build stronger relationships with their customers? So we think that like giving you a phone number, allowing you to call and message is like fair, very much like bare minimum.\r\n\r\n\r\nRight. We are building a lot of cool things on top of that. So right now, sure. You can look at ring central and be like, cool. Like this is what these guys do, but like we spend a lot of effort thinking about like, how do we help our customers automate certain communications, save time and money, right? How can we help you collaborate with your team so you can really get back to your clients like insanely fast. And these things go outside of what I think.\r\n\r\n\r\ntypically you expect from a rank central as an exam.\r\n\r\n\r\nNikolas Hulewsky (07:27.684)\r\nSo the last thing, just because I want to frame it for the audience listening, what you do is Ring Central is typically going to be focused on enterprise, right? Larger organizations. Open phone, from what I understand, you're focusing on small businesses and tech companies. These are small companies that don't necessarily have the resources or even the implementation know-how to bring on a Ring Central. This is like plug and play. Let's do this thing, right?\r\n\r\n\r\nDaryna Kulya (07:54.129)\r\nit's super self-serve. Yes, exactly. mean, look, I think there's a couple of things here. First of all, very easy. You know, we don't have a massive sales team. Like most of our customers just sign up on the website and start using the product. So we had to build something that was so easy, so delightful that basically kind of like just works. and that's kind of a, you know, it's, it's by design. It's from the beginning. We've always kind of been operating this way. Also, I should say, and kind of thinking about.\r\n\r\n\r\nyou know, ring central versus open phone. Like at the end of the day, we started to come, you know, ring central has been around for a very long time. since like 1999 and like the way they had to build the product, you know, back when they started was very different from the way businesses communicate today. So for example, in our product, it's not just calling. We, we spent so much effort thinking about texting. actually see businesses want to text a lot these days. So our product,\r\n\r\n\r\nis like very like texting and calling. They're kind of like at the same level. We pay attention to both. feel like some of our competitors, to be honest, they just started out as this like PBX system with extensions, you know, like back in the day you had extensions, like no one does extensions anymore. Like imagine you can't text an extension. That's so weird. So we just, you know, we as a product have the advantage of not having those legacy concepts to worry about.\r\n\r\n\r\nWe can build you something that makes sense for the way businesses talk to customers today. We don't have to like, you know, like we're not going to give you things that don't make sense anymore. We don't use your desk phone. We don't give you facts. You know, we are, we're definitely the modern version for, for today.\r\n\r\n\r\nNikolas Hulewsky (09:40.228)\r\nThis is very dumb question. What would you call companies like yours, RingCentral? I always say like, that's a VoIP system. But I don't think that that's right. Is it a telephone solution? Does that make sense what I'm even asking?\r\n\r\n\r\nDaryna Kulya (09:42.261)\r\nSure.\r\n\r\n\r\nDaryna Kulya (09:53.721)\r\nYeah, yeah, for sure. mean, technically you can say we're, you know, VoIP solution. I mean, to be honest, I don't love the word, but technically, right? Like we're in that category.\r\n\r\n\r\nNikolas Hulewsky (10:05.188)\r\nBut it's more than that. you're doing internal communication. There's a communication component to it.\r\n\r\n\r\nDaryna Kulya (10:08.033)\r\nYeah. So the way that we are evolving and what you'll see us do, right, is going outside of this phone system. Like technically we are a business phone solution, but we are starting to get into this place where it's like we are blurring the lines of what a phone system does and what a CRM does. Even from the early days, we kind of thought that like a lot of things that you do as a, for example, when you're running a business,\r\n\r\n\r\ninformation about your customers may live in like a hub spot, right? And you log your opportunities there, you sync all your data, right? That's your CRM. And then you use a phone solution. We're really entering the space where we want to give you something that kind of like abstracts this, where, you know, we're not just a place where you, you know, place calls and texts, but we give you a lot more insight about your customers. So you'll see us be like blurring those lines.\r\n\r\n\r\nNikolas Hulewsky (10:41.796)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (11:07.268)\r\nWell, it's really interesting because let's say that I wanted to do a texting campaign, either for leads or for previous customers, right? Like I want to keep customers warm or I had leads that didn't close and I just want to follow up with them. You know, what I'll do is I'll go to Clavio or I'll go to HubSpot or like I'll get all the information and then I'll use some app, some software that interfaces that can send text messages. And then I pay like a per text message fee.\r\n\r\n\r\nfor you, it's it's already integrated. You're already using the phone system. And that's why like, it does seem like there would be some overlap with the CRM if you're using it to text and follow up with customers, right?\r\n\r\n\r\nDaryna Kulya (11:49.715)\r\nYeah, for sure. mean, first of all, integrate, so we actually integrate with main CRMs. We integrate with HubSpot and we integrate with Salesforce. We also, so, so you can, you can do that through our integrations, but I think more interestingly, at least based on what you are telling me, one thing that is super cool about what we do is we have a very deep connection with Zapier. So a lot of businesses, what they can do is they can kind of like, you know, if you don't use HubSpot, if you have your own other type of a CRM, you can actually connect.\r\n\r\n\r\nopen phone easily to other tools using Zapier. And then you can set up automations. My favorite example is you have a form on your website for people to contact you, right? You take their information, right? You take their phone number, whatever. And then you send them like a thank you message or confirmation message from your open phone number based on what they gave you in that form. To me, that's like, by the way, whoever is listening, like every business should do this. It's like such a no brainer. It's so easy.\r\n\r\n\r\nNikolas Hulewsky (12:46.308)\r\nOkay, Dorina, you're blowing my freaking mind here. I'm going to like this is a tangent. I wasn't even planning on talking about this. A couple of months ago, Chris, my business partner, tweeted something and it was about a vending machine, but it was perfume. And it went nuts. It got like 20 million views. And he started getting people DMing him and saying, Hey, where can I buy this? Really quickly, the two of us were like, we should capture this information because these are leads. We ended up getting 2500 people reach out to actually over 3000 people reach out to us and say they wanted to buy it.\r\n\r\n\r\nDaryna Kulya (12:51.814)\r\nOkay.\r\n\r\n\r\nYeah. huh.\r\n\r\n\r\nDaryna Kulya (13:00.129)\r\nMm-hmm.\r\n\r\n\r\nDaryna Kulya (13:10.641)\r\nMm-hmm. Yep.\r\n\r\n\r\nNikolas Hulewsky (13:16.61)\r\nIt represented like $50 million in sales volume. And we had emails, phone numbers, et cetera. But we were like, how do we follow up with all these people? OK, we put them into a CRM. And now we got to make a phone call. But then how do we document it? And we did call them, but we started tracking it on a spreadsheet to tick off. Yep, I called this person, I called this person, and then called this person. The reason you're blowing my mind right now is because could we have just uploaded that information to OpenPhone?\r\n\r\n\r\nand then had them call through open one and it would have automatically said, yep, this person was called or showing the last call date. my God. Where were you three months ago?\r\n\r\n\r\nDaryna Kulya (13:49.409)\r\n100 % totally. mean, what you could have, I now I feel like you guys, I don't know. We've been around. think, I think maybe, know, we've been around, but look, I think that to me, what's interesting is like, so this is the piece of like, you were asking about like, what is open phone? And I think, you know, we are definitely evolving. There's going to be, by the way, tons of really cool things we're going to be announcing and talking more about next year.\r\n\r\n\r\nBut for me, what's so exciting is automation because at the end of the day, you don't want, like in that example, you don't want to manually enter that data. You don't want to be like tracking things on a spreadsheet. And for us, like, I just see so many businesses where there's all these like small things they can automate and save a ton of time. So to me, again, if you have simple example, you have a form, you have a type form, Google form, whatever it is, you capture data.\r\n\r\n\r\nThe thing that we know is that for customers, a phone number is such a important channel. Like if you text someone, they're much more likely going to reply to you than if you email them. And if you get their consent, if they give you their phone number and they say, sure, you can send me a text message, you are suddenly in their messages app, right? And that's like a much better place to be than to be like email number 10,000 in their inbox.\r\n\r\n\r\nNikolas Hulewsky (14:56.1)\r\nMm-hmm.\r\n\r\n\r\nDaryna Kulya (15:13.791)\r\nSo it's just like, it's a no-brainer.\r\n\r\n\r\nNikolas Hulewsky (15:16.334)\r\nAll right, I'm gonna tell you what we're currently doing and then you tell me what we should have been doing. So we have a type form. People will go to the type form, we'll capture it, it goes to Google Sheets. And then in Google Sheets, we have all the names. We then have an automation running with Go High Level. Or High Level is what it's called. The website's called Go High Level. High Level that then takes those phone numbers, puts them into High Level and then initiates a text campaign, right? But the calls, that's like the most important thing.\r\n\r\n\r\nDaryna Kulya (15:20.821)\r\nOkay. Yep.\r\n\r\n\r\nDaryna Kulya (15:31.007)\r\nYes. High level.\r\n\r\n\r\nDaryna Kulya (15:44.459)\r\nYes. Yes.\r\n\r\n\r\nNikolas Hulewsky (15:45.784)\r\nthe calls the rep will call these people, but then they'll document within the Google Sheets are not documenting and go high level. And then on top of that, it's all honor honor based, right? I'm not that I'm saying that they're lying, but I don't have like, they actually did call this person. They had this many minutes.\r\n\r\n\r\nDaryna Kulya (16:01.664)\r\nmy God. Yeah. You have no idea. You don't have no oversight because they're using their, whatever they're using to call. You don't know what's happening.\r\n\r\n\r\nNikolas Hulewsky (16:04.653)\r\nNo!\r\n\r\n\r\nNikolas Hulewsky (16:08.386)\r\nIt gets better, it gets better, for worse, depending on your perspective. We then have them, then they're using, I think it's Otter AI still, but it could be one of the new AIs that comes in and it does a summary of the conversation. But the problem is Otter AI doesn't integrate with high level. They just don't have an API integration that we can get through Zapier. So now it's like we have all this information from the calls that is not being kept.\r\n\r\n\r\nDaryna Kulya (16:11.702)\r\nHa\r\n\r\n\r\nDaryna Kulya (16:17.44)\r\nYeah.\r\n\r\n\r\nDaryna Kulya (16:28.651)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (16:38.028)\r\nin the system. So please, please fix me.\r\n\r\n\r\nDaryna Kulya (16:42.561)\r\n100%. So here's what you need to do. my God. I love it by the way. We're just so okay.\r\n\r\n\r\nBy the way, and I will give you some options, right? So first of all, you have a form, you're capturing this information and whatever type form, Google form, it doesn't matter. You connected to open phone via Zapier. So the first thing to do is to get all of those entries and get those people added to open phone and then text them. The moment they fill out the form, send a text, right? On the open phone side, you guys need to have a number between you and Chris, whoever you want to add, add all of your team members to this number.\r\n\r\n\r\nNikolas Hulewsky (17:08.889)\r\nMm-hmm.\r\n\r\n\r\nDaryna Kulya (17:18.091)\r\nSo everyone sees what's happening. So that's number one. For calls, I mean, I'm pretty sure high level has a Zapier integration. We have a Zapier integration. We can hook this up. So again, I have to check, but I'm fairly certain that you do, which means if you have a call coming from open phone, we can push that to high level. If that's your CRM. Also open phone has automatic call recording, automatic transcription, automatic call summary. So you don't need to do Otter.\r\n\r\n\r\nI love Otter by the way, I use it for some other things. It's Too many tools. Yeah. And also the fun part is that whoever on your team uses OpenPhone, I don't know, when you have a salesperson making calls, you have analytics and you can see like, is this person actually making 10 calls a day or are they just telling you, but not? So you as the owner have full visibility into what's going on.\r\n\r\n\r\nNikolas Hulewsky (17:48.502)\r\nNo, I do too. It's just, you know, when you're adding one more software to the P, there's just too much.\r\n\r\n\r\nDaryna Kulya (18:14.796)\r\nLike who on your team is making the most calls? Who has most missed calls? What are the times of the day? Maybe like you guys are busy in the afternoon, but like no one cares about it in the morning. So you can kind of look at all of that. Yeah.\r\n\r\n\r\nNikolas Hulewsky (18:24.035)\r\ngosh.\r\n\r\n\r\nNikolas Hulewsky (18:29.472)\r\nI freaking love this. I'm so excited. Like literally, I'm going to send this to Chris before this airs. Just to be like, Chris, you need to watch these minutes for the\r\n\r\n\r\nDaryna Kulya (18:31.775)\r\nThank\r\n\r\n\r\nDaryna Kulya (18:38.433)\r\nThis is, hey, we will set you up. mean, I am always, by the way, as a founder, I'm always like, I'll give you like a friends and family discount. But anyway, I'll set you up. You will, don't worry. We can do like a very, very nice setup. I mean, it seems easy.\r\n\r\n\r\nNikolas Hulewsky (18:45.944)\r\nDude!\r\n\r\n\r\nNikolas Hulewsky (18:53.902)\r\nWell, Chris and I, so Chris and I have talked, we've talked a lot about this where it's like people who are starting businesses, and I'm not talking about tech businesses, I'm talking about like the traditional businesses, it's almost like they need their own separate tech stack because they're not ready for QuickBooks, they're not ready for HubSpot, they're not ready for RingCentral, right? They're still figuring stuff out on Google Sheets, they're still figuring stuff out between a Zapier integration, right? To me, this feels like a very scalable, at least in the early days.\r\n\r\n\r\nway to have your CRM and to track calls and to make sure that you're not having leads drop. Do this sounds like a sales? I'm not. This was not the plan, but you. This is a very real pain point that we're going through right now, so that's why I'm like getting so excited. It's like the light bulb is going off in my mind for how it works.\r\n\r\n\r\nDaryna Kulya (19:40.385)\r\nTotally. Listen, I mean, that's one of the reasons why we built OpenFront. mean, I think that when I look at our customers and what kind of... Also, by the way, we are now in this world of AI. People, think the most important thing, you want to make sure that if someone wants to contact your business, you are getting their information, you are following up with them right away, you're not dropping any balls, you're sending them a message, you're like...\r\n\r\n\r\nLike the worst thing to me is that someone wants to get in touch with your business and you are like not responding to the call or you're not even following up through texts. think, I think that's what actually kills a lot of businesses is that they're not great. Like they are good at what they do at their craft at the service we offer, but they're actually not good at communication. So we make the communication part very easy so that you can focus on like the.\r\n\r\n\r\nservice, the actual product you're offering and not on like automations and you know, all this other stuff. maybe one, one more thing I will just say that like my favorite thing in open phone, it's just like, it's there. Look, if you miss a call, we do something called auto reply. So without even Zapier, without whatever, just within open phone, you can say, if I miss a call from this number, send an automated message. This is so key because you have a.\r\n\r\n\r\ncustomer who's calling you, you're not replying because you're busy. Instead of them calling another person on Google, right? You just send them automated message being like, Hey, sorry, I'm with another client. If you want to book an appointment, know, text me this, right? Just don't leave. Yeah.\r\n\r\n\r\nNikolas Hulewsky (21:24.078)\r\nSo I'm gonna take this way back, because I got so excited. I swirled hard, but it was amazing. It was great for me. I think broadly speaking, there are two types of entrepreneurs. There are traditional entrepreneurs that either start a business or buy a business. And if they need to raise capital, it's usually private equity. And I don't mean PE, I just mean it's privately held equity. And then there are the sexy entrepreneurs, which found tech companies. And those are typically founded\r\n\r\n\r\nDaryna Kulya (21:28.789)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (21:53.26)\r\nare funded by venture capital. So they're different, right? And you founded a tech company and that's different than traditional entrepreneurship. However, I think the process is still the same as I look at deciding what you're going to do. And I want to focus in on this because I think the first step before an entrepreneur does anything, whether it's a tech entrepreneur or a traditional entrepreneur, is they've got to identify what problem they're solving.\r\n\r\n\r\nAnd then there's other steps, right? Will someone actually pay me for this? there a need? Who's my target demographic? analysis, excuse me, competitive analysis, all those things. But that first step is so important. Like, what problem am I solving? And is someone actually willing to pay for it? Walk me through that for OpenPhone. In 2017, how did you come to this, there's a problem here that we need to solve?\r\n\r\n\r\nDaryna Kulya (22:41.845)\r\nYeah.\r\n\r\n\r\nDaryna Kulya (22:46.049)\r\n100%. So, my God, this is like, every time I go back to the story, like I feel so old, let me try to remember. To be honest, there were several paths that led us down this road, but the very much, the idea and the trigger point actually was coming from my co-founder. And really what happened is, you know, both of us are Canadians, so we are now in the U.S., but we are from Canada. And fun fact.\r\n\r\n\r\nCanadians pay the most money for their cell phone bills. I myself, yeah, because the country is so big, not, not enough people and also really big monopoly from a perspective of, you know, providers. So, so this is actually like a common thing, by the way, a lot of people I know have tried to like find ways to pay less money for their cell phone bill. It's a Canadian thing. mean, maybe it's less known, but I have cried over my cell phone bill.\r\n\r\n\r\nThat's a separate story.\r\n\r\n\r\nNikolas Hulewsky (23:44.964)\r\nBy the way, I'm cracking up because you have a very Canadian accent. No, that's a joke. That's a joke. It's just, you're like, I am Canadian. My husband and I are Canadians. No, this is amazing. So you're actually Ukrainian. Okay.\r\n\r\n\r\nDaryna Kulya (23:49.865)\r\nI do? my God.\r\n\r\n\r\nDaryna Kulya (24:02.837)\r\nI am Ukrainian. But for a second I was like, hey, I lived in Canada for a while. Look, I was born and raised in Ukraine, spent most of my life in Ukraine, but I did live in Canada and I went to university in Canada.\r\n\r\n\r\nNikolas Hulewsky (24:16.92)\r\nYes, sorry, sorry. That was a quick side note. So I didn't realize cell phones were so expensive or at least cell service was so expensive.\r\n\r\n\r\nDaryna Kulya (24:23.937)\r\nAlso, the way, this was, know, things potentially have improved, but this was like 2017. so what happens is, my, co-founder's coworker, basically, he worked somewhere and his coworker was like, Hey, did you know you could port your phone number from your traditional carrier in Canada? think it was like Rogers.\r\n\r\n\r\nto this virtual solution and you save a ton of money, but also there's like a fun fact. You can use your phone number anywhere in the world. There's no roaming, there's no nothing. you can kind of like, because your phone number becomes like an internet powered phone number, you can control everything about it. So, so my co-founder, Mahir, he did that. He basically was like, this is fun. Let me try it. So he ended up.\r\n\r\n\r\nNikolas Hulewsky (25:14.34)\r\nHow did you make calls? I know it's over the internet, but if did you just have to have LTE turned on or like how did it actually connect?\r\n\r\n\r\nDaryna Kulya (25:20.417)\r\nYou have to have, so, so he ended up using this other, there is another app that came with it. So you put your phone number through the app and you make calls anywhere there is internet. So through wifi or whenever you have LTE. So essentially you need to have an internet, you need to have like the calls go through the internet.\r\n\r\n\r\nNikolas Hulewsky (25:39.812)\r\nYou have to have a connection at some point. you have to pay for the internet or was it like, I don't understand.\r\n\r\n\r\nDaryna Kulya (25:43.745)\r\nSo what he did is kind of like unbundled his plan. So he ended up doing a data only SIM card. So he has data on his phone through a data only SIM card. And then he ended up using this, I forgot even the name, this other app for the phone number. So basically there's a phone number that's configured and then there is like a data through this data only SIM card.\r\n\r\n\r\nNikolas Hulewsky (26:07.086)\r\nOkay, so he ends up using the solution that is effectively voice over IP. I mean, you're calling over the internet.\r\n\r\n\r\nDaryna Kulya (26:12.001)\r\nCorrect. But what ends up happening is he realizes two things, right? The first thing is like, my God, it's so cool. By the way, maybe this is cool for, I don't know, for engineers, for tech people. Like, I don't think any, like a regular person would do this because the risk of like, this is not something you, like someone can just do for fun. To me, this is like a, a bit more of like, Hey, let's play around with this idea.\r\n\r\n\r\nNikolas Hulewsky (26:37.336)\r\ntechnical.\r\n\r\n\r\nDaryna Kulya (26:38.353)\r\nYeah, exactly. You kind of have to be into experimentation. Maybe you risk something going wrong. don't know. And essentially what happens is he does this and his phone number becomes like configurable, right? So like anything is possible, right? But at the same time, the app he was using was just so bad. And both of us are product people. We are like into design and UX and...\r\n\r\n\r\nbuilding beautiful products. So, so my hair just started essentially at this point, he was like, this is such a powerful idea, but he's like, build a much better app. So I basically witnessed him as he went through this journey. He was like, I'm just going to build something better. And as he started building it, you know, he initially almost was building it for himself, but then we quickly realized that like this should be really sold to businesses because\r\n\r\n\r\nBusiness owners don't want to be using their personal phone number. So essentially he was just like, my God, we should do it.\r\n\r\n\r\nNikolas Hulewsky (27:40.164)\r\nWhat were you doing at the time? What was your job?\r\n\r\n\r\nDaryna Kulya (27:43.329)\r\nYes, I was a product manager at another tech company. I was building software for another company and I was honestly, was loving my job. was having, you know, I had an amazing job. just, be honest, when I saw him do this and I kind of, you know, my initial thought was like, Hey, you're building something interesting. I just thought I'm going to help you get customers. So the initial thing I did, and I have a lot of stories here.\r\n\r\n\r\nI was like, let me go find customers for this. And that's what I did. And in the process, I was like, my God, this is so cool. Like I want to do this. So, then started, just started working eventually. And you know, I.\r\n\r\n\r\nNikolas Hulewsky (28:21.166)\r\nand\r\n\r\n\r\nNikolas Hulewsky (28:24.772)\r\nOkay, so to be clear, your co-founder is now your husband.\r\n\r\n\r\nDaryna Kulya (28:28.533)\r\nHe is my husband. Yes. And we were at the time. Yeah. We, we met, we kind of, you know, we, we met, and, and, my God, when did we meet? This was like such a long time ago. Essentially when we started working on open phone, you know, we were in a long distance relationship, which is a interesting fact. So when he ported his number to the solution, we talked on the phone a lot because we were in a long distance relationship.\r\n\r\n\r\nAnd that's when I was like, wait a minute, your call quality is actually better now because, because he had in his apartment, he had a much stronger internet connection, and carrier connection. the moment hit, so that also like played a role in this. Cause I was like, this thing is great. You have much better call quality now.\r\n\r\n\r\nNikolas Hulewsky (29:16.74)\r\nSo you co-founded OpenPhone and you also co-founded a relationship, a family. So did you always know you wanted to be an entrepreneur? Like, did you always know you wanted to start a company or was this... Okay, so that was already in the cards.\r\n\r\n\r\nDaryna Kulya (29:21.866)\r\nYes.\r\n\r\n\r\nDaryna Kulya (29:30.377)\r\nYes. Well, I think that that was in the cards. I, know, what I'm maybe not sharing is like throughout, you know, ever since, I don't know, ever since like I even in university, I I'm trying to remember, I always had side projects and ideas I was building, but they were all like probably terrible. They were all, you know, I mean, I'm just now looking back. I had a lot of attempts.\r\n\r\n\r\nand various projects that never became companies. So I had a lot of attempts, but for this one, think that I just really felt like we were building something people really wanted. to be honest, we got that validation from the market quite fast.\r\n\r\n\r\nNikolas Hulewsky (30:25.668)\r\nHow long was it between making version one and getting your first person to pay you for it?\r\n\r\n\r\nDaryna Kulya (30:31.541)\r\nYeah. So the version one, I know actually all the dates. So we started trying to get beta users September, I even know, cause September 2017. And then the first person who paid us like the first dollar, was March or February, 2018. But that was only because, well, that was pretty fast to me. mean, it actually could have been faster to be honest. It could have been even faster.\r\n\r\n\r\nBut we wanted the product to get to a certain point that we were like comfortable charging people. wanted to, you know, to make a product. We wanted it to be like a not really alpha, you know, it was alpha beta. And then you launch, we wanted something a little bit more, you know, more solid. So that's when we got comfortable charging. Yeah.\r\n\r\n\r\nNikolas Hulewsky (31:22.052)\r\nOkay, so you make this first product or first version, you're working a full-time job. Did you know you were gonna go raise money or were you thinking we can bootstrap this? Because you're in Toronto or you're in Canada at the time?\r\n\r\n\r\nDaryna Kulya (31:33.983)\r\nWe were, yeah, we actually were in Kitchener Waterloo, which is just outside of Toronto, which is by the way, Canadian tech hub. It's an amazing, an amazing place. Yeah. It's like Canadian Silicon Valley. That's where we were.\r\n\r\n\r\nNikolas Hulewsky (31:45.54)\r\nOkay, so did you know you were gonna raise or like, was that the plan or was it like, let's bootstrap this thing.\r\n\r\n\r\nDaryna Kulya (31:51.763)\r\nSo frankly, we wanted to raise, but we had a very hard time raising. to be honest, before we got into Y Combinator, we were essentially going down the path of bootstrapping. And to be fair, it all happened very quickly. So things changed very quickly. But the thing is that we just felt that if we raised money at that time,\r\n\r\n\r\nWe would have gotten like terrible terms and there was nothing really to show. It was still at the very idea phase. So I'm actually grateful that we did not get any money and people said no to us. And we kind of bootstrapped for a period of time. And then we got into YC because it helped us be a better company. And it also helped us like figure out how to get customers without paying for ads, you know.\r\n\r\n\r\nNikolas Hulewsky (32:44.484)\r\nSo YC, when did you get into YC?\r\n\r\n\r\nDaryna Kulya (32:46.997)\r\nWe got into YC in May 2018.\r\n\r\n\r\nNikolas Hulewsky (32:50.53)\r\nOkay. it's actually not that long. mean,\r\n\r\n\r\nDaryna Kulya (32:52.969)\r\nYeah, it was quick, but it felt longer in my...\r\n\r\n\r\nNikolas Hulewsky (32:57.337)\r\nyeah, for sure. How many paying customers did you have before you got into YC?\r\n\r\n\r\nDaryna Kulya (33:02.753)\r\nSo at the point of application, we had like 60 paying customers. essentially, from the point that we had the first paying customer, which I said was like February or March, to the point of YC, like April, end of April, in that period of time, we went from one to 60 fairly quickly. And it was $10 per month. You couldn't pay us more because that was like, we had only one plan, $10 per month.\r\n\r\n\r\nNikolas Hulewsky (33:22.232)\r\nAnd how much were they paying?\r\n\r\n\r\nDaryna Kulya (33:32.001)\r\nNot more, not less. If you could, if you wanted to pay us more, I remember like being like, how do we take more money? Basically that was $10 per month. Yeah.\r\n\r\n\r\nNikolas Hulewsky (33:42.5)\r\nWas that covering costs? $600 a month.\r\n\r\n\r\nDaryna Kulya (33:44.801)\r\nIt was probably not quite yet, but it was getting there.\r\n\r\n\r\nNikolas Hulewsky (33:53.86)\r\nOkay. So one of the things that I love about your story is that you guys were scrappy. And you said something on a podcast, I listened to some stuff before we got on here and he said something on a podcast that is almost verbatim what my business partner Chris says, where it's like, constraints are good. Because constraints force you to be creative. They force you to think outside of the box and had you gotten money early or had you gotten funded or whatever, you probably waste a lot of money on stupid things, potentially. Can you talk about\r\n\r\n\r\nDaryna Kulya (34:01.409)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (34:23.832)\r\nhow you went about acquiring customers.\r\n\r\n\r\nDaryna Kulya (34:26.217)\r\nYeah, look, constraints are great. think I am sometimes even kind of a bit nostalgic for those times because you really test your creativity by having like, you have to figure things out without money. So for us, the, how we figured out how to get customers is the first path was Facebook groups. And I'll just tell you this, you know, because we've always wanted\r\n\r\n\r\nWe didn't start OpenPhone to be like a product for a certain type of business, like real estate or property management or healthcare. We kind of, we kind of, we saw the problem with more universal. So we basically were like, okay, we need to get in front of a lot of types of entrepreneurs and small businesses to understand like where the pain is the strongest. So I thought at the time, the only way that I've, that I thought was to get in front of a lot of types of businesses.\r\n\r\n\r\nfor free was Facebook groups. And then we pivoted to like Reddit and Reddit and subreddits. And I have to say, I'm so bullish on Reddit. mean, Facebook groups feel, I don't think they're dead, but I think there was like a certain ceiling that we hit with those. But with Reddit, I mean, it's still actually a very important channel for us. I think that I'm just like super bullish on Reddit. And we just went, it was super scrappy. I posted on 60 plus Facebook groups. I joined a\r\n\r\n\r\nbunch of subreddits posted in all of these places. And I was kicked out of some places. actually, you know, was a lot of people swore at me. Like, you know, I had a whole bunch of things happen, but it was kind of very, I don't want to say brute force, but it was very much like, Hey, just getting the word out. but, but we then later learned that, okay, here are the posts, here are the groups that are actually good for us. And here's how to position the product.\r\n\r\n\r\nand the rest kind of followed.\r\n\r\n\r\nNikolas Hulewsky (36:22.478)\r\nWell, I think that scrappiness forces you to figure out how you position the product, but you can always throw money at the problem. You can always turn on paid ads. When you have money, it's very hard to instill an ethos of scrappiness of like, figure out how to go on and grow business. Like Chris and I have launched multiple businesses off of Reddit, Reddit alone. And he's close to a million subscribers now across all social media platforms, but he still loves Reddit. He's like, Reddit's?\r\n\r\n\r\nDaryna Kulya (36:43.861)\r\nThat is amazing.\r\n\r\n\r\nNikolas Hulewsky (36:52.248)\r\nthe freaking most toxic, but dude, you have to learn how to write well. He just had a post go viral on Reddit and the moderator came in and shut him down. Cause they were like, you stole this from Chris Kerner. And he's like, no, no, I am Chris Kerner. I didn't even have to like show proof for it. Anyways, I have a suggestion for you. We're trying something out. Do you have an open phone subreddit yet? Okay, perfect. So that's one thing that we're testing out right now is like,\r\n\r\n\r\nDaryna Kulya (37:16.182)\r\nYes, we do.\r\n\r\n\r\nNikolas Hulewsky (37:21.432)\r\nyou go in and you post to all these different subreddits, right? Because that's where your potential customers are. And then you tag open phone on your responses, right? Like, I found out about this on the open phone. And then that way, no moderators are kicking you out of different groups. You you have control over the message and you're able to bring people in and brainstorm. Anyways, so I.\r\n\r\n\r\nDaryna Kulya (37:34.325)\r\nYeah\r\n\r\n\r\nDaryna Kulya (37:39.137)\r\nThat's a great idea. mean, I think that, and also by the way, there is another piece, right? I feel like when, I think that a channel like Reddit, is something interesting about it, which is to your point, it forces you to figure out how to write. also forces you to be, like first of all, to deliver value. I'm it Reddit really taught me that whatever I'm posting, wherever I'm posting, I need to be delivering value. And that's like, if I don't deliver value, it's.\r\n\r\n\r\nNot going to work. No one's going to care. And I'm going to get downvoted. I'm going to get kicked out. Like it has to be about providing value. And it's just a free, I think it's like a free marketing class. Go figure out Reddit.\r\n\r\n\r\nNikolas Hulewsky (38:22.306)\r\nSo I'm going kiss your butt for a second, but I'll delete it if it goes bad. You're very, very well-spoken. You're very smart and you're very passionate about your product. It's very obvious. It's one of the things that got me excited about talking to you. When we first met, we met at Main Street Summit and there was this thing where I could go get a free headshot. I go, sign up for it. Chris and I go sign up for it. I show up to get a free headshot and you're there because OpenPhone is sponsoring this, essentially paying for it.\r\n\r\n\r\nAnd you and I talked, we talked for like 20 minutes. And I found out you're from the Ukraine. My father's Ukrainian. You just had a child and you know, we were just talking about life and different things. I go in, I get my headshot. I say, thank you. leave. And then a few weeks later, I get the headshot back and I'm like, this looks really good. I go, I want to buy a second headshot. Cause Chris and I took a jokey picture of us together. So I go to buy a second headshot and it's like a hundred bucks. And I was like, my gosh, did they really pay for\r\n\r\n\r\nDaryna Kulya (38:50.72)\r\nYeah.\r\n\r\n\r\nDaryna Kulya (39:13.087)\r\nhaha\r\n\r\n\r\nNikolas Hulewsky (39:20.898)\r\never like a hundred bucks for everybody to get a headshot. So I went and searched you. I was like, I need to go find this, this woman. And I, ended up finding you and I'm like, not only does she work for open phone, like she's the founder of open phone. And it, you didn't lead with that. wasn't like, Hey, how are you? I'm doing well. I'm the founder of open phone. was just a good conversation. And you were very caring, right? Empathetic about, about getting to know me. And it's one of the things that I find.\r\n\r\n\r\nvery valuable when I meet people is like, what are some of the first questions you ask me? And if the first question you ask me is what do do? Yeah, I'm not super keen on the relationship, but that also bleeds over to how passionate you are on the product side. Like I can tell you are passionate about giving a good experience to people and making sure that the hundred and first thousandth customer is having the same experiences as customer number one. Has that been intentional or is that just sort of an innate thing that you can now look back on and say,\r\n\r\n\r\nYeah, that is I guess that is a skill that I have.\r\n\r\n\r\nDaryna Kulya (40:21.985)\r\nI mean, I don't know. think it's kind of to be, be, to be honest, as I think about our, our journey, maybe, maybe because, you know, so first of all, let me put it this way. I am myself using our product all the time. And fun fact, I do have a SIM card number, but I basically don't use it. just there for testing purposes. I literally use open phone for everything. So maybe my passion for the product comes from the fact that\r\n\r\n\r\nI rely on it big time. And I think this allows me to have a lot of empathy, as much empathy as I can for our customers, because I use it. I see all the power. I see the problems, right? Like I see it all. So that's how I get empathetic. I just like, I'm there in the product all day, every day. So that's maybe like a, you know, a trick. I don't know if it's a trick, but it's, so my empathy and my desire for\r\n\r\n\r\nhave a good experience comes from the fact that, comes from that. And maybe going back to your other point, like, I mean, I don't know, by the way, that conference was amazing. It was nice to meet you. I just think that, when it comes to just like events and things like that, I don't really go to too many events. So I feel like even if we are sponsoring or whatever we're doing, the point of the event is to meet people and like get to know them. And it's impossible to do it. If you're like,\r\n\r\n\r\nlet me tell you about my product. No one cares. No one cares about your product. Right. So I just think that maybe that's me learning through all this experience. Like no one cares if I post about the product on Reddit and I'm like, Hey, sign up for my product. If I'm like, Hey, like, can I help you solve a problem for you? Can I, I don't know, can I give you some valuable suggestions? I just try to think about how can I be helpful? And, that, that always leads me the right way. So.\r\n\r\n\r\nNikolas Hulewsky (42:18.466)\r\nWell, it's very obvious. think that there are like two ends of a spectrum when it comes to founders, entrepreneurs. There are the opportunists, the ones who just they've always wanted control over their schedule and they don't really care what gets them there and they'll find something's like, that can make me money. Cool. I'm going to become an entrepreneur. And then there's like the missionaries. They're so compelled to solving a problem that they can't do anything else. They got pulled into, it was not even on their mind, but they got pulled into entrepreneurship just because they're so passionate about that.\r\n\r\n\r\nAnd the unicorns are usually like a blend of those two. And you seem like one of those unicorns where you're like, I always wanted to be an entrepreneur. I was opportunistic. I wanted to find it open phone kind of became the opportunity. But you're also exceptionally passionate about the product, which you have to be like you have to be the missionary in order for companies to scale.\r\n\r\n\r\nDaryna Kulya (43:04.101)\r\nhave to. You're not going to go anywhere without it. And to be honest, think that just maybe for folks listening, like there were right now, even the way you're like really pumping me up, you're like, look at how many customers you have. I'm like feeling so happy. But to me, to be honest, like we've had some bad days and really tough moments. And I think that because I still remember those so deeply, I guess like I'm happy about where we are. I obviously want us to do better.\r\n\r\n\r\nBut it's like, I don't really have a chance to feel really too good about myself because we faced so much rejection and so much, you know, failure. And to me failure is like learning opportunity. So I guess like most people I know, they kind of like grind their way to the point that they're like just sitting there being like, okay, I've survived.\r\n\r\n\r\nNikolas Hulewsky (43:55.79)\r\nWell, first of all, first of all, you're in San Francisco. So it's like, well, I guess I got to be Airbnb to be successful. So you're kind of in a weird bubble. But second, I do try to be complimentary of entrepreneurs because I know how hard it is. I mean, I've been through those moments and nobody's there to tell you how cool you are. You know what I mean? And you're not, you're certainly not there to do that. You're not like self reflecting on like, man, isn't it cool how much cool stuff I've done? Like, no, you're trying to fix the problem at hand. And so I like, I like to\r\n\r\n\r\nRemind entrepreneurs like yourself, it's like, hey, you know, you've done a good thing, right? And because I think it just helps you sort of feel better about the process you're going through. So I like to just remind people like, you know, 100,000 people is a lot of people, right? So that's a lot of customer.\r\n\r\n\r\nDaryna Kulya (44:36.235)\r\nThank you. Yes. man. Thank you, Nick. mean, this is like a, didn't know I needed this. know, it's the, just come onto your, your pod, you know, on a weekly basis, just to like, just to hear this.\r\n\r\n\r\nNikolas Hulewsky (44:47.385)\r\nSo.\r\n\r\n\r\nThat's good.\r\n\r\n\r\nWhat's the goal with OpenPhone? Is this like, we want to go public? this, hey, we just want to scale it to a certain point and then recapitalize and keep it private? Where are you?\r\n\r\n\r\nDaryna Kulya (45:04.735)\r\nLook, we have no intention on any kind of like exits or any sort of you know, cashing out. we see, to me, the thing that I see is that I see so many problems for us to solve for people and the kind of product we're building, which you said, you know, I'm very passionate about the product we're building, but I see the next chapter and the next chapter and the next chapter. And as the years go by, you know, we're in year, what, six, seven now.\r\n\r\n\r\nI'm seeing like a whole new thing that we need to be doing. So to be honest, like I don't see the end. And maybe someone has to stop me and be like, listen, here, you know, but I don't see the end.\r\n\r\n\r\nNikolas Hulewsky (45:47.064)\r\nWell, okay, then put it put a number on it for me. What in in 10 years? valuation? Like where do you think that open phone has the opportunity to become billion dollar plus\r\n\r\n\r\nDaryna Kulya (45:57.887)\r\nLook, I definitely want to see us. think like, like, you know, the going public, I feel it's, it's a mark of building a company that's, that's really, contributing to the society in a very meaningful way. And I think to me, I would love to see that. I would love to, you know, to ring the bell and all of that. So to me, to me, that's like. A milestone I want to experience, but I don't even want to stop there. want to go, you know, obviously that's not the end.\r\n\r\n\r\nBut I want to experience that as a person.\r\n\r\n\r\nNikolas Hulewsky (46:26.02)\r\nWell, well, and the thing the thing with tech founders in particular is like, if I go and start a business right now, and it's cash flowing, I can pay myself however much I want. When you're a founder of a tech company, you're burning cash, and you're just trying to grow and scale. So you either are able to get some money in a secondary or you have to go public. Because at some point, you want to buy a house and you want to travel a little more or you've you know, you've created a billion dollars of shareholder value, but you're still making $120,000 a year. And it's like, I'd like some of the upside, right?\r\n\r\n\r\nSo that's why I'm always curious about tech founders is kind of how do you think about the next step in the evolution of your company?\r\n\r\n\r\nDaryna Kulya (47:01.678)\r\nI think that, and by the way, you, kind of said something interesting, maybe because we're in San Francisco, we are surrounded by, you know, I think like people around me, they all seem to be kind of, you know, going public is just like, no big deal. Right. I think that, I think that maybe based on the environment we're in. To, you know, I see, you know, we, we dream big. want to, we want to take this really far. And also by the way, that makes you kind of every day, you know, you look at the numbers.\r\n\r\n\r\ngoing up and to the right, you feel happy, but you're always like, maybe comparing yourself to people around you and you're like, well, is this good enough? Right. So I think to me, what makes me truly happy seeing the impact we are making on our customers. And I think there is so much value we can offer. So I want to be doing this as long as possible. And I want this company to be like, you know, I want the New York Stock Exchange. I want all of that and beyond. I think that's like, you know,\r\n\r\n\r\nNikolas Hulewsky (47:56.526)\r\nOkay. When you ring when you ring the bell, I'm to be a hanger on you just like tell me text me like, Hey, Nick, I'm ringing the bell this week. I'm to come fly out and just I'll just be in the crowd clapping like a seal because I'll be so happy for you. Amazing.\r\n\r\n\r\nDaryna Kulya (48:02.431)\r\nOkay.\r\n\r\n\r\nDaryna Kulya (48:07.841)\r\nGod, Nick. Okay, I'll remember this. Just very, very important.\r\n\r\n\r\nNikolas Hulewsky (48:15.012)\r\nAll right.",
  "metadata": {
    "duration": "",
    "date": "2025-01-27",
    "platform_source": "Google Drive"
  }
}