{
  "episode_number": "238",
  "episode_title": "How to Easily Turn Vending Machines Into a Passive Income Empire",
  "guest_name": "Mike Hoffman",
  "business_name": "Vending Machine Business",
  "transcript": "﻿Nik (00:01)\r\nMike, welcome to Niconomics, my friend.\r\n\r\n\r\nMike (00:04)\r\nNick, thanks for having me. I'm fired up to be here.\r\n\r\n\r\nNik (00:06)\r\nGood, good. I'm fired up to have you. I've been doing doing a lot of research. Stoked to ask you a lot of questions. But before I do all that, why don't you give people a flavor? Who are you and how do you make\r\n\r\n\r\nMike (00:17)\r\nYeah, so I am a Northwest guy like yourself out here in Oregon and have different income streams ranging from vending to Airbnbs to consulting with our special operations community. So a little bit of everything under the\r\n\r\n\r\nNik (00:34)\r\nOkay, so you, think what's really fascinating about you is your Twitter handle is, is it Mr. Passive Income? that, and I just listened to an episode that you did on, I believe it's called Financial Independence is the podcast. I'm actually gonna link to that in the show notes because any question that I would have asked about your business was answered in that podcast. It was like phenomenal. But you started out as an assistant coach.\r\n\r\n\r\nMike (00:41)\r\nYep.\r\n\r\n\r\nNik (01:01)\r\nand evolved into this what you are now in building a passive income stream. Just like high level, tell me a little bit about your background.\r\n\r\n\r\nMike (01:11)\r\nYeah. So I kind of had an aha moment when I was a coach and when you're in collegiate athletics, like you don't want to calculate your hourly wage because you're just working all the time. So, was on one of those, you know, working on a Sunday, middle of the football season and was like, I need to learn how to earn with my mind and not my time kind of moments. And that's right around when Tim Ferris and the four hour work week and kind of that whole thing.\r\n\r\n\r\nThat's when I really started to explore other income streams that were more passive and led me to real estate and then eventually down this unattended retail and vending\r\n\r\n\r\nNik (01:50)\r\nYeah, so give me the high level. What are you into right now? What are your passive income investments?\r\n\r\n\r\nMike (01:58)\r\nYeah, so it's a good question. have an Airbnb down in Florida that I just outsource management. I tell the manager I don't want to know anything unless it's damage above $2 ,000. So I try to make it as passive as possible by letting them run point with that. I have vending machines in actually East Coast, Midwest and West Coast and operators that run those routes for me.\r\n\r\n\r\nand then, you know, I got a little Bitcoin mining. I'm really interested in just kind of like value ads with real estate, just trying to find good deals. So we, we bought some land on like the home and ADU concept and rented out both as separate homes. And we're doing a development project right now with eight units that we're going to do four town homes and sell off each individually and to eight units.\r\n\r\n\r\nNik (02:51)\r\nBitcoin mining, how many miners do you have?\r\n\r\n\r\nMike (02:54)\r\nI actually outsourced that so I don't have any miners myself but I have a facility out in New Jersey that does it for me and it's kind of like a third party thing that I'm again trying to make everything as passive as possible.\r\n\r\n\r\nNik (03:10)\r\nYeah, so I have a business partner, mobile home park guy, Chris Kerner. We own a business that sells crypto mining hardware. And we were in the hosting space for a while, but that was just a nightmare for us to manage. We were actually a wholesaler middleman. We had relationships with facilities that were doing the hosting and then we had customers and we would like charge a pass through rate and it just was a mess. Didn't work. So we got out of that business. But yeah, our company sells hardware to mainly Bitcoin miners.\r\n\r\n\r\nMike (03:36)\r\nYeah. Yeah. So how is that market these days? Is it trending one way or the\r\n\r\n\r\nNik (03:43)\r\nIt's a hard market right now. You know, there's three things that really affect mining. The price of Bitcoin is only one of them. So even though the price of Bitcoin is appreciated, which is great, you still have to factor in the cost of energy and the difficulty rate that you're hashing at. So for those who don't know Bitcoin, I think everybody knows what Bitcoin is, but Bitcoin was specifically created to be a finite resource. There will only ever be 21 million of them. And the way that it is produced,\r\n\r\n\r\nit is quote unquote mined. And the way that it is mined is there are these computers that essentially solve, this is like a dumbed down version, but essentially solve math equations that get progressively harder so that it limits the amount of supply that's in the market. And with each successive Bitcoin that's minted or mined, it gets harder. So 10 years ago, you used to be able to mine Bitcoin on your laptop. And now it takes hundreds of computers pulled together in order to mine one Bitcoin.\r\n\r\n\r\nSo that, the difficulty rate, the hash rate is one of the three components that contribute to crypto mining profitability. And that has been really, really difficult because there are a lot of people who are getting into mining and you have operations that their cost of energy is almost zero. You have these like flare gas operations that essentially siphon off the flare from natural gas fields.\r\n\r\n\r\nwhich is which essentially those fields will pay you to take that flare gas and that that powers their mining facilities or you've got people with big solar farms or you've got people with lots of renewable energy. So anyways, it's difficult right now because of that. And we expect it to come back up. You we were very bullish on it. It's not a question of if it's just a question of when. So that that's been a very volatile business, though. That's not passive, Mike.\r\n\r\n\r\nMike (05:36)\r\nYeah, yeah, yeah. Well, I'm glad I outsourced it. You just validated my hypothesis when I was looking into it. So,\r\n\r\n\r\nNik (05:44)\r\nOkay, yeah, dude, be glad please be glad. I could tell lots of stories on that one. So you have real estate, whether it's Airbnb or rentals, you have some crypto mining, you have vending machines, is that\r\n\r\n\r\nMike (05:59)\r\nYeah, that's the main core of everything. I mean, we have a couple different equity play. Like we're building a oil lube station in Florida, like one of those 10 minute oil lubs, a development group that I just, I'm a silent investor. And so there's all these kinds of random projects like that, that are kind of behind the scenes in the works.\r\n\r\n\r\nNik (06:19)\r\nHave you gotten to the point where those in passive streams of income, like are they, are they provided you enough where you you've quit your corporate job, you're, you're working essentially on those businesses now, not necessarily for another\r\n\r\n\r\nMike (06:33)\r\nYeah, exactly. So the cash flow from my vending route alone, November of 2022 was when I left quote unquote, corporate America for kind of that dream of being able to just live off the cash flow of some of my assets.\r\n\r\n\r\nNik (06:49)\r\nHow long did it take you? When did you start doing it and how long did it take you to get to 2022?\r\n\r\n\r\nMike (06:54)\r\nThat's a good question. It could have been a lot shorter. Hence why I try to help people avoid the mistakes I made. But I think I got into vending right before COVID. So like 2018, I got into real estate back in 2014. So it's just been kind of, you know, my first property was like a classic.\r\n\r\n\r\nNik (07:07)\r\nmy gosh.\r\n\r\n\r\nMike (07:16)\r\nMidwest $70 ,000 home that was renting for 900 bucks. And I was like, Oh, I broke the 1 % rule. You know, I don't know what I don't know. And then I got a second one. And then I was like, shit, I can't just keep coming up with a down payment for every home, you know, by myself. So that's when I was traveling a lot for my, my day job. And I was sitting in these airports and I was like, someone's making $8 off of me with this cold brew that I'm paying nine bucks for. I know it costs a dollar at Costco.\r\n\r\n\r\nThis is fascinating and he's not even here selling it to me. So like he's clearly earning with his mind, not his time. And I went down this rabbit hole and, broke into Vendi when I got home one time after just a work trip that just kind of created a fire under\r\n\r\n\r\nNik (08:00)\r\nOkay, so you went from 2018 buying your first vending machine to 2020. All the debt included, you know, because you, I think I remember you saying that you don't buy these with cash, you finance them, many of them you can get with zero money down. But you got to make debt payments on that to 2022, like you're living off the income just off of your vending machines.\r\n\r\n\r\nMike (08:23)\r\nYeah, absolutely. And we have people now that will do it in six to 12 months because now we actually have a system of scaling. Like I was just going, you know, door knocking to build my vending route. We're now like with a strategy of kind of who to target. You know, I could have shortened that up by at least three years.\r\n\r\n\r\nNik (08:24)\r\nand Santa.\r\n\r\n\r\nOkay, so what you just said is like my main question of the day is there's a lot of it's very sexy on Twitter in particular, but Instagram. Are you on Instagram? I'd be sure I haven't seen you. Do have a large account\r\n\r\n\r\nMike (08:55)\r\nI am. Yep.\r\n\r\n\r\nI think I have like 47 ,000 followers, but it's not as accurate as Twitter.\r\n\r\n\r\nNik (09:02)\r\nOkay, so Chris, my business partner, he has 100 ,000 followers on Twitter and like 120 ,000 followers on Instagram. But he plays into a similar vein, which is people who are just looking for that side hustle that's going to take them into entrepreneurship. And I don't mean what I'm about to say in a negative or derogatory way, but they're looking for like, oh, this is easy. Oh, this is the hack. This is the thing that helps me skip the line.\r\n\r\n\r\nAnd in my experience, I've never bought an asset that was like truly passive. I've never bought something that didn't take work to get there. And you may be at a place now where you're passive, but what were the first few years like? I you said you knocked doors.\r\n\r\n\r\nMike (09:48)\r\nYeah. Yeah. So, so Nick, you bring up a great point because vending is not passive. Like for me, landing your first location isn't, mean, yeah, that's exciting of, okay, Hey, I got my first vending lead wherever in, Idaho. But like, what intrigues me more is like when people like take those steps to quantify leverage and how much their time is worth and like hire that operator, build out the systems. Like when you start out, you can't delegate what you don't know.\r\n\r\n\r\nwhat to delegate, you know? So that's where I think the big steps for most kind of people getting into entrepreneurship is actually being able to focus on the business and not in the business. And that's like taking a step back and not being in the weeds long -term.\r\n\r\n\r\nNik (10:34)\r\nIt's true, but it's hard to focus on the business when you don't know what's going on in the business. You know what I mean?\r\n\r\n\r\nMike (10:40)\r\nAgreed, agreed. But like that's also people are afraid to think, you know, like even the knocking on the doors or the cold calling, like one of the biggest value adds I found when I went down this coaching business was people didn't want to cold call. And so like, was like, okay, well let's figure out how to do this for you. You know, like the classic friction with remove that step, but at the end of the day, you know, it's still, you gotta, to me, I just come back to\r\n\r\n\r\nthe quicker you can build systems to whether that's vending, whether that's anything really, Bitcoin mining, whatever all of those things are, I would gladly give away a margin to make it as passive as possible.\r\n\r\n\r\nNik (11:23)\r\nTell me about the first couple of vending machines that you have. Did you hire an operator or were you the guy going around refilling them and going to Costco?\r\n\r\n\r\nMike (11:32)\r\nI was a guy, yeah. So I went into a property. I was like, hey, do you guys have any machines? They were like, nope, we need one. Can you provide one? And so I did a quick Google search. There was a company that came out. Yeah, yeah, there was a company that came up on it. Yeah, yeah. well, it's like a perfect storm with these places.\r\n\r\n\r\nNik (11:47)\r\nReally? They were just like, yeah, we need one. Sure. Like it was that easy.\r\n\r\n\r\nMike (11:56)\r\nThey are these property managers. They don't want headaches from their tenants. And especially nowadays with the pressure of we got to keep rents high, all these new builds, you know, we got to keep up with the Joneses like all the amenities. So yeah, they were like, we want something. This was definitely a class A property. The first one I popped into. And I literally did a Google search. found a machine manufacturer out of Iowa and I'm from Iowa originally. I was like, okay, Midwest, I can trust these guys clearly.\r\n\r\n\r\nNik (12:06)\r\nYeah,\r\n\r\n\r\nMike (12:25)\r\nYou know, you got every Alibaba and machine company from China that pops up too. But I like, I'm not shipping something across the ocean. So, um, and then they had the most how -to videos on YouTube. So like, all right, I'm going to figure this out myself. And I mean, Nick, no money down. First payment wasn't due for 90 days until after it was delivered. So was doing 90 days of sales and, uh, my monthly payment was $112 and I was doing 900 bucks in revenue.\r\n\r\n\r\nwith 60 % margins and I was like, this is cash flowing more than my rentals and I can depreciate this machine.\r\n\r\n\r\nNik (12:56)\r\nWhat?\r\n\r\n\r\nHow much are the machines?\r\n\r\n\r\nMike (13:05)\r\nUh, that one was like $5 ,500.\r\n\r\n\r\nNik (13:10)\r\nmy gosh. my gosh. Okay, mind blowing. So you get that first machine, you're like, I'm just gonna figure it out. Which I think most people do before they get to the operator point. And you said something really important. It's like, you gotta figure out your systems first. And it sounds like these first couple of machines like allowed you to figure out that system of how you manage\r\n\r\n\r\nMike (13:11)\r\nYeah.\r\n\r\n\r\nYeah. Yeah. Like where are going to store product? Is it in your garage? Like for us in Oregon, you know, the weather is pretty fair. doesn't get ridiculously hot in the summer. doesn't get ridiculously cold in the winter. So we just had a landscaping shed on the side of our house. That's where I would, you know, would go to Costco at the time. And then I just line it up when we were shopping with the kids. So I'd literally have my daughter in the shopping cart. We'd do our groceries, all the, all the vending items underneath the cart.\r\n\r\n\r\nAnd that was like our Saturday routine. And then I'd stock it every Tuesday on my way to the grocery store. was like, you know, just kind of kill two birds with\r\n\r\n\r\nNik (14:16)\r\nYeah, that blows my mind. You weren't a part of like a large GPO. You were just going to Costco and buying things in bulk.\r\n\r\n\r\nMike (14:21)\r\nYeah, yeah, exactly.\r\n\r\n\r\nYeah. Yeah.\r\n\r\n\r\nNik (14:27)\r\nHow quickly did it take you to ramp? So you bought that first machine, you placed it, when did you buy the second, when did you buy the third?\r\n\r\n\r\nMike (14:34)\r\nYeah, the buying the machines is the easy part, especially if you finance them. The limiting factor is finding good locations. Like I'm firm believer that I'll take one class A, let's say apartment complex that's doing 1200 bucks a month and five Jiffy lubes doing 250. And so like for me, it's all about good locations and what your time is worth. And so that's the ramp up. That's the, um,\r\n\r\n\r\nstep that people kind of miss out is they just do the shotgun approach instead of like land and expand.\r\n\r\n\r\nNik (15:07)\r\nYeah, I and you've I've heard you say before that basically there's like two types of places that you look for. There's high traffic places and there's high employee count places, right? So it's like the Jiffy Lube may be a high traffic place, but it's going to be low lower margin. But that's not necessarily a high employee place to go in places vending machines.\r\n\r\n\r\nMike (15:27)\r\nRight. Yeah. And there's also leverage there too, with that, we need to get into like employed subsidies. So right now there's a huge push to get people back in the office and how do we get them back in the office? When I was working for a startup in Menlo park, we were literally right across the street from Facebook and Facebook would park these tens of food trucks in the parking lot. Cause they didn't want their employees to go\r\n\r\n\r\nAnd so if they stayed, they'd even give them $15 dinner credit, but you can't access it until 7 PM. So people would stay for the free meal and just work the whole time. And so like same thing, we have a roofing company that pays us half of the cost of the vending sales and our cooler and their shop. So think about this. We get a monster for a dollar from Costco. We list it for $4. Well, this CEO of this roofing company is\r\n\r\n\r\nNik (15:55)\r\nYeah.\r\n\r\n\r\nMike (16:23)\r\nI will pay $2 of that $4. So we list it for two bucks because he doesn't want his roofer to go to the 7 -Eleven and spend 45 minutes of their break driving to the store only to spend $4 .50 at the 7 -Eleven. So now they're spending more of their paycheck. They're using his trucks and gas and more time to get there. So we're literally selling all our items for 50 % off and invoicing the company for the other 50%. Yeah.\r\n\r\n\r\nNik (16:50)\r\nFor the 100%. Yeah, I mean, that's a.\r\n\r\n\r\nMike (16:53)\r\n25 employees and nothing's doing as much as a 500 person apartment\r\n\r\n\r\nNik (16:58)\r\nHow many vending machines do you have\r\n\r\n\r\nMike (17:01)\r\n64, we just installed two yesterday. Yeah, we have one install Friday afternoon here in Oregon. I mean, we're just kind of at that bell curve of growth right\r\n\r\n\r\nNik (17:15)\r\nWhat kind of an operator do you need for\r\n\r\n\r\nMike (17:18)\r\nsomeone that's patient and, is actually really good with the details. You know, they like my operator here in Oregon. He he's basically my boss for our Oregon route, but he wouldn't even know how to set up this riverside on his laptop. But that guy knows the ins and outs of route, where to buy product, what's been selling, you know, all the operator things.\r\n\r\n\r\nNik (17:46)\r\nAlso, he's doing everything like when you say operator there, they're doing purchase decisions. They're also stocking their running the route. They're managing relationships, all that\r\n\r\n\r\nMike (17:53)\r\nYeah. Yeah, we run a pretty lean Ibotaha and so he's doing all of that. We might get like a picker at some point where, you know, they organize our warehouse and all of that. But right now he's doing all of that. And we do have a purchasing agreement now. So we're not going to Costco. We're getting, you know, delivered from a performance food group type.\r\n\r\n\r\nNik (18:15)\r\nSo tell me about the morph because you've got these vending machines, you're making money off of real estate, but you also offer, and I don't even know what it's called so you can educate me, is it a community or coaching or a GPO that people are, a group purchasing organization that people are a part of where you're actually helping people do this themselves?\r\n\r\n\r\nMike (18:38)\r\nYeah. Yeah. It's kind of all the above. So we run a community it's called vendingpreneurs. So they all set up their own businesses, wherever they live. And then we help them, through coaching of like, what kind of any, okay. Nick goes and does a pop in at the Jiffy lube. We quantify revenue projections and help you really see if it's a good location.\r\n\r\n\r\nwe also help you find leads. we have in -house cool. have six full -time cold callers on staff. have two email SDRs. and then yeah, we have a purchase agreements with these either machine manufacturers or products, distribution folks where, you know, we're getting volume based pricing to our community.\r\n\r\n\r\nNik (19:22)\r\nAnd just so you know, I'm taking notes. I'm not just like tweeting away. When I'm on a call and I see people like looking down, I'm like, crap, am I not doing a good job? how did that arise? People just saw you posting about it and they're like, will you teach me how to do this? And you realized,\r\n\r\n\r\nMike (19:26)\r\nyou're good. You're good.\r\n\r\n\r\nNo.\r\n\r\n\r\nYeah. Yeah. And, and Nick, I'm let you know, we talked about it earlier. My background's as a coach. And I think what drives me every day is how do you coach people at scale? And that's the beauty of, of acts and, getting out to people and why I'm so bullish on so many people are like, why do you share so much? Why are you so open? Like those are your secrets. And it's like, guys, come on. It's a Mark Cuban. You know, there's no patents. You just, the cream will rise to the top. Like that's my mindset. If I can\r\n\r\n\r\npeople great. And then the second piece is the machine, the vending machine industry is going through such a disruption right now. When you think of like the old school motors and I got to press like E four to get a Snickers when now you got the open shelf coolers with the AI cameras, you open the cooler, you can get your Snickers, your diet Coke and a bag of chips walk away and it's going to charge the credit card used to open the like, it's just going through such a disruption that even\r\n\r\n\r\n90 % of our leads we find already had traditional vending and they're either broken. The operator doesn't know how to use a cell phone so they can't track inventory with without going by the machine. You know, it's like that whole baby boomers just holding on to this machine and they're not getting with the times. Like it's more than just throwing a credit card reader on there now.\r\n\r\n\r\nNik (20:57)\r\nWell, it's a classic example and you see this in real estate as well where the owner has extracted all of the value from that asset because they've refused to reinvest in it, right? They view it as, this is value for me, not necessarily I'm gonna have the best product. And so when the time comes, real estate in particular, to sell that commercial building, it's dilapidated, but they still wanna charge the market price that a new building.\r\n\r\n\r\nwould go for. so it doesn't surprise me that you're seeing the same effect with these vending machines.\r\n\r\n\r\nMike (21:31)\r\nYeah, we, so we, uh, two weeks ago I was in Chicago and I bought a route in Chicago about three months ago and we've been doing like a land and expand model to grow the route in the loop, right downtown in the loop. I met with a property two weeks ago. They have an entire city block on Michigan Ave, 39 floors and their interest is literally the CVS on the first floor went out of business during COVID.\r\n\r\n\r\nAnd so they just want a micro market with CVS type items in it. They're literally like, you can put Tylenol in here, charge 3X. We have tenants that just want to go downstairs because they're used to going to that CVS. And so like back to the value add of these owners and you know, commercial real estate, they're trying to keep their tenants happy because they're just hurting so\r\n\r\n\r\nNik (22:28)\r\nTell me about the community. How many people are either a part of it or how many people have you\r\n\r\n\r\nMike (22:34)\r\nI think we're up to like 400 right now active members.\r\n\r\n\r\nNik (22:37)\r\nOut of what period of time is\r\n\r\n\r\nMike (22:40)\r\num november of 2022\r\n\r\n\r\nNik (22:46)\r\nMike, that's pretty incredible, 400 people\r\n\r\n\r\nMike (22:48)\r\nOh, thank you. mean, it's just, yeah. And I mean, we have, we have guys in the community and gals that are doing, you know, 35 plus machines now like freaking raking in 30 K a month. You know, it's not just uh, kind of, oh, onesies and twosies. got you a gym, you're making your 300 bucks and you're good.\r\n\r\n\r\nNik (23:12)\r\nIs that the core offering, the community, or is there a coaching component as well that comes with it? Like, hey, here's the course you can buy. Like, what does the business look\r\n\r\n\r\nMike (23:20)\r\nYeah, the main part of the business is the ancillary benefits, you know, like the we get bulk pricing with machines, we get bulk pricing with products, and then we find leads for you. So let's say we help a vendingpreneur get started in Boise, Idaho, like we're going to pull all the businesses that fit our revenue criteria to be a good vending location. We're going to either cold call or email into them on your behalf.\r\n\r\n\r\nthe, the venuepreneur and Boise. then when you get a meeting, you're going to be like, well, shit, how do I approach that meeting? What am I pitching them on? Okay. We had a great meeting. What's a contract template look like? Like my whole vision with this is like, make this as out of the box as possible. You get, sign up and you get started with, basically leads at your, at your\r\n\r\n\r\nNik (24:12)\r\nHow does it work for the vendingpreneur? Are they locked into a community contract where they're like, hey, you have to be a part of this community for X period of time, or do you get a percentage of sales? What is the revenue model for you? Because that's a lot of work on your end,\r\n\r\n\r\nMike (24:26)\r\nYeah, that's a good question. we're, we're kind of fine tuning that because we're actually having the opposite problem. People come in the community. So our original plan was like, Hey, come in for six months. We'll get you some locations. We'll get you to a revenue target. And you know, the training wheels are off and you've, you've done this with one, two, three, five locations. Now you can do it yourself. Well, now people after six months, they are at that margin where it's like, why wouldn't I throw gas on this\r\n\r\n\r\nSo they want to keep using the services and keep getting access to more leads, getting access to more book pricing. You know, now we're at the point now with 400 members where we, you know, I have a meeting with PepsiCo at the end of the week where it's like, they, they want to fight for shelf space because all 400 of these people have micro markets or machines that are going to either put Pepsi or Coke in\r\n\r\n\r\nNik (24:54)\r\nRight.\r\n\r\n\r\nAnd so the community members, how are they paying for that value? Is it just the community membership or do you like, is there an affiliate agreement with them? I mean, it almost sounds like a franchise, but it's you're not a franchise.\r\n\r\n\r\nMike (25:24)\r\nYeah. Yeah. Yeah. That's kind of what we're. Yeah. We're not a franchise. We're kind of working through that Nick. mean, I think, you know, the, the most obvious is like, okay, we just slap on a monthly fee to stay involved in the community. get rights of access to leads in your zip codes and get all the discounts that come with it or, you know, back channeling it in a way of, you know, I had a meeting with the group in Portland on Thursday. They have 680 properties across the country. Well, if I'm the contract holder and\r\n\r\n\r\na standard of like these machines need to be stocked, whether they're in Boise, Eugene or Reno, Nevada, you know, like we got to be buttoned up about what our unified brand is going to out to the whole portfolio. So I'm also working that side of like, do I just take a revenue share off the top? And then I'm just kind of, run in point with it or I don't\r\n\r\n\r\nNik (26:19)\r\nYou ever thought about buying back all the machines and just owning them outright? Standardizing everything?\r\n\r\n\r\nMike (26:25)\r\nNo, because it goes against my model of helping other people kind of build side hustle and change. These vendingpreneurs need to have healthy margins and need to be in business. That's why I'm trying to go to these fights with a gun to lower transaction. I mean, they're trying to gouge. These vending machine companies are making money off you with merchant services. They're making money off you with the machines. They're making money off the software fees, monthly software fees. It's like,\r\n\r\n\r\nPick which one you care about that aligns with your business model, and then let's be real\r\n\r\n\r\nNik (26:59)\r\nWell, you're not asking for my advice, but I'm going to give it to you anyways. What I would do is set up a separate agency that handles all that stuff, that does the leads and the back office and the contract negotiation, et cetera, and then charge a management fee as a percentage of revenue. It's fairly common in the healthcare space that I come from where you have like the centralized home office is what they call it. And they do all that stuff. They do the accounting for us. They do HR, they do payroll, they\r\n\r\n\r\num, AP, uh, they do legal and then they charge the individual affiliate locations, just a percentage of revenue anywhere between like five and 15 % of revenue, but it is a separate entity. And I, I think your community, could, you could even offer for free, but if people want to use your, your, um, agency, cause they're, you know, they're generating leads, they're negotiating contracts on your behalf, they're finding locations, they're doing all the back office support. To me, that's just, that's a very simple.\r\n\r\n\r\nHey, we'll do that work for you and charge you a percentage of your revenue. The franchise model would apply here as well, but then you'd have to go through a ton of legal. You'd have to actually incorporate, have to have to get the financial disclosure document. Anyways, I just think that that would be kind of a pain in the butt, but I think.\r\n\r\n\r\nMike (28:14)\r\nYeah.\r\n\r\n\r\nAnd the franchise kind of goes against like, you know, building it yourself. Cause I don't want to, people want to get to 35 machines with their own, I mean, brand. we have so many members where it's like, they have teenage kids at like, it'd be like your 10 year old here. You get this machine, you get to set the prices, you pick the product. Like with the franchise model, it's like, no, this product, this machine, this prices, you know, it's kind of, um, goes against the core.\r\n\r\n\r\nyou to take ownership and I don't want yeah the agency things really interesting to me because that's fascinating so yeah I'm gonna have to pick your brain\r\n\r\n\r\nNik (29:00)\r\nWe can do it now or we can do it later, but that's fine. I think what's, to me, what's fascinating about what you've done is look down on is not the right word. I see a lot of people on Twitter, the cleaning bros or the pressure washer guys or who, pick your poison, the real estate guys who house hacked that are like, I did it and I can show you how, join my community. And then all of a sudden,\r\n\r\n\r\nbusiness becomes showing people how not doing the house hacking, not the pressure washing, not, you know, the window cleaning, whatever. And the way you describe your community is it's, I'm sure you're making, you know, money off of the community, but it's not you, you haven't forgotten about your main business. Like you're still growing, like that 65 machines is a lot of machines to have out there. And I think it reflects your ethos of wanting to help people wanting to coach\r\n\r\n\r\nMike (29:50)\r\nYeah.\r\n\r\n\r\nNik (29:57)\r\ninstead of exploit\r\n\r\n\r\nMike (29:59)\r\nYeah, yeah. And you can't see it, but there's also a sign right here, which is the quote of like the man in the arena. And like, I, you know, I've done a lot of these cleaning business, how to communities and like, they get so far removed from the actual day to day that they kind of forget the, the why behind it. And that's why, you know, behind this wall, we got shelves of literally drinks and snacks and like, that's, you know, the stuff that,\r\n\r\n\r\nWe're living the wise. So, I think you, you bring up a really good point and I don't want to be a, info product where people just sign up and hear me talk once a week and watch some videos that were recorded about how to negotiate contracts. Like at the end of the day, we, do a good job. have, we have two kind of workshops a week that are, that are live and one's foundations of like how to build your vending route or questions that you have. then.\r\n\r\n\r\nThe other one's purely me just giving updates on, you know, negotiations with the Pepsi's negotiations with the machine manufacturers, negotiations with these reits or, you know, big groups with multiple properties, like, cause all of that is real value.\r\n\r\n\r\nNik (31:09)\r\nrates. Have you ever gotten into skilled nursing facilities?\r\n\r\n\r\nMike (31:14)\r\nNo, but I would love to. mean, that would be, yeah.\r\n\r\n\r\nNik (31:16)\r\nDude, let's talk after this. My brother -in owns a skilled nursing facility company that has 60 facilities and is good friends and partners with a large publicly traded REIT called Care Trust. Anyways, I also like the way you talked about it. was like, you're not just like, yeah, this is totally passive. Oh, it's so easy. Anybody could do it with just $20 ,000 YouTube. You're not pitching it that way.\r\n\r\n\r\nYou went out, you got experience in the business, you systematized things, and then you allowed you to scale. And I'm putting words in your mouth here, but I can see a little bit of a kindred spirit in you where then you like, had this stuff and people started coming to you asking you how to do it. And you're like, well, I already know how to do the system. So I might as well hand this off to people and help them skip those three years. So for them, it may become a passive type investment, but you have to go through the process.\r\n\r\n\r\nof understanding the business. Otherwise, you can't get to the passive state. You don't get to where you are today without having to go through learning the business.\r\n\r\n\r\nMike (32:21)\r\nYeah, right, right. You can't just like buy a vending route and assume the machines are going to stock themselves. Like there's none of that, you know, like the laundromat thing with the guy you had on your episode. That's why, you know, yeah, vending is not passive at the beginning. It's all about, you know, it's like, and that's the beauty of the active passive debate. Like there's a continuum and\r\n\r\n\r\nNik (32:34)\r\nYeah, tie with yourself.\r\n\r\n\r\nMike (32:46)\r\nThere's a guy in my community has 35 machines and he won't hire an operator because he's frugal as AF and he just, that's like his therapy is going to stock machines. He'll even tell you that he'll be like, I actually enjoy going to stock these machines. He's actually the guy I was mentioning earlier. He's got four teenage kids and he gives each kid a machine to decide what they're going to stock it with. It's a competition in the house. It's so cool. It's like supply and demand one -on -one with your kids is.\r\n\r\n\r\nNik (33:12)\r\nThat's awesome,\r\n\r\n\r\nMike (33:16)\r\nYou know, it's like the lemonade stand 2 .0.\r\n\r\n\r\nNik (33:19)\r\nHow are these businesses valued? Let's say I had 35 machines. Are people buying them? Are they like, oh, you got 35 machines. I'll buy it for the asset value. Are they buying it off of the cash flows? Well, before that, can you sell these routes?\r\n\r\n\r\nMike (33:35)\r\nYeah, there's definitely an exit strategy. Yeah. I'm at the vendingpreneur I bought. go\r\n\r\n\r\nNik (33:38)\r\nHow did it? No,\r\n\r\n\r\nMike (33:42)\r\nSo this vending printer I bought his route three months ago in the Loop Chicago. So he was moving back to a different city and I was like, well, I found you these locations. I'm not gonna let you just sell them to a quote unquote competitor that's not in the community. I bought it at, it was doing eight grand a month, 96K a year. got it for like, he got an offer for 85 and I just matched it. Did seller financing over I think.\r\n\r\n\r\ntwo years or something. I was doing EBITDA, it was right around, I think it was around 5K a month. So I got it for, yeah, 85. Oh yeah, I mean, so Nick, I have to, outside of the future of unattended retail, I think in the next two to three years, Vending is the next consolidation of.\r\n\r\n\r\nNik (34:14)\r\nSay that one more time. What was it doing in\r\n\r\n\r\nOkay, so $60 ,000 a year. So you got it for like one and a quarter times.\r\n\r\n\r\nMike (34:40)\r\nprivate equity groups and snatching up these routes. Because literally all you're doing is throwing systems on these routes and adding new machines that aren't just limiting you to a motor of it only fits a 12 ounce can. It's like, no, this is a micro market shelf where you can do a 10 ounce Red Bull, a 30 ounce Monster. I mean, we have people doing two gallon cold brew like, know,\r\n\r\n\r\nNik (35:04)\r\nI want to describe that really quickly because for me, most of the time I think of a vending machine as like you said, F3 and my Snickers takes forever and the swirly thing and it pushes it out. But there are these new things that are happening now. If you've been to an airport, any major airport recently, you can walk in and you can grab something and you can walk out and it charges your phone because there are cameras on you that are watching what you pick up. And there's still an attendant there, but I feel like the attendant is really just to make you feel better and\r\n\r\n\r\nnot actually because there's a lot of theft going on. But what you're saying is that's coming to a location near you because the technology is able to fit into either a machine or a system of cameras that you can set up locally that allow you to function in that way. Is that\r\n\r\n\r\nMike (35:53)\r\nAbsolutely. So a great example of this is we took a old school vending machine, same location. So an apartment complex, I think it was like 300 units, vending machine was doing $1 a month. Let's just say a thousand bucks for easy math. Like the classic motors, it's gotta be chips on the top because those are the big motors. It's gotta be 12 ounce cans that fit in these motors. Like you're really pigeonholed on to what you... We swapped that out with a smart fridge where\r\n\r\n\r\nto unlock the fridge door, you gotta put your credit card or Apple Pay, and then there's AI cameras based on what you grab out of that fridge is gonna charge you. And so people will open the door, not only are they gonna get their 12 ounce soda and their bag of chips, but they might get their laundry pods, or they might get their Tylenol. Same location, the very next month we swapped out the old school vending machine, that thing did 2 ,500 bucks.\r\n\r\n\r\nNik (36:43)\r\nYeah, yeah, it's not just food.\r\n\r\n\r\nMike (36:52)\r\njust off of people having flexibility on what they want to do. You don't have to enter in a motor for every single item and redo the transaction. It's literally like, open the door, grab it, walk away. The friction of this process, like you said, going into the airport now, you don't want to talk to anyone. You don't want to wait in line. You want to grab your shit and\r\n\r\n\r\nNik (37:16)\r\nWhy wouldn't I go to a CVS or a Walgreens or a Walmart or anybody and just say like, look, if you brand this, we can have micro locations and in these schools, in this apartment complex, in this massive working complex. Would they not go for\r\n\r\n\r\nMike (37:35)\r\nI think they would, I just don't think they'd care until you get to a level of volume that will their attention. I mean, I've even, I've approached Farmer's Fridge and they're like, yeah, you have 400 members. When you get to a thousand operators, maybe we can talk. You know, I'm just like, okay, I'll come back to you in six months. Game on.\r\n\r\n\r\nChallenge accepted. But you know, like the same thing with PepsiCo and you know, even all these brands, the first thing they're going to ask you is like, how much volume are you going to do? Like, no offense, but Boise is a small market for CBS to care.\r\n\r\n\r\nNik (38:01)\r\nChallenge.\r\n\r\n\r\nTotally. It is. No, I totally agree with you. But if these micro locat I don't even know what you call them, micro retail locations. If these micro markets start popping up, and even if they start eating away at 5 % of these companies' businesses, that's a lot of money, especially when retail has razor thin margins to begin with, because they've got these large brick and mortar locations that they've got to pay for, whereas the micro retail market\r\n\r\n\r\nMike (38:22)\r\nMicro markets, yeah, micro retail.\r\n\r\n\r\nNik (38:42)\r\nthe brick and mortar location is being paid for by somebody else, you're just coming in and offering them another amenity or potentially another revenue stream. So yeah, I got some rapid fire questions for you. You ready? Cool. What do you love about this business?\r\n\r\n\r\nMike (38:55)\r\nYeah, let's do\r\n\r\n\r\nI'm waking up in the morning and looking at my dashboard on how many, how many sales we did while we're sleeping.\r\n\r\n\r\nNik (39:07)\r\nWhat do you hate about\r\n\r\n\r\nMike (39:11)\r\nThere's still machines, so things break. And if you don't have a good operator, then you're definitely gonna be working in the business and not on it. you know, that hiring a crucial operator is probably the most important piece.\r\n\r\n\r\nNik (39:27)\r\nWhat question do you wish I would have asked that I\r\n\r\n\r\nMike (39:33)\r\nOoh, that's a good question. I'd probably say where things are going. I think in five years, you know, I think there's going to be a machine for anything. You know, we were talking CVS and that even seems so outside the box of traditional Snickers and Doritos. like, I still think, you know, you go to, you go to Marriott and you got this.\r\n\r\n\r\ncubby of snacks and stuff. I do rather than like a room call service, like if on the Marriott app, it's like I want to Cheetos and a Gatorade and a little robotic car brings that up the elevator to your room. Like I'll pay an extra 50 cents for that. If I don't have to like get out of my PJs and go down to the lobby and wait in line to check out my bottle of water while three other people check into their hotel room, like that whole friction of just people.\r\n\r\n\r\nwill pay for convenience. That's what's blow, every time I go to Costco, I'm like, these Kirkland water bottles are 10 cents and they sell in the airport for six.\r\n\r\n\r\nNik (40:39)\r\nIt's It's crazy.\r\n\r\n\r\nI'm assuming you're going to say you're not jealous, just humor me for this. We're all jealous creatures. So what businesses or industries are you the most jealous of right\r\n\r\n\r\nMike (40:58)\r\nI don't know if jealous is, think AI to me, I just don't know the capabilities fully. You know, it's kind of like Bitcoin. You kind of wish you got in earlier than you did. Everyone, everyone wishes they would already got in then when they did. like with me and AI, you know, I think of every time I use chat GPT or Gemini, I'm just like, wow, that work statement I wrote up for a vending.\r\n\r\n\r\nlocation took me two seconds when it normally takes me a half\r\n\r\n\r\nNik (41:32)\r\nAll right, let's say you have two hours in your day. You have no family time or no family scheduled. They have no business stuff scheduled. What are you doing with those two hours? What are you obsessed with right\r\n\r\n\r\nMike (41:47)\r\nI'm obsessed with a hundred million dollar exit in three\r\n\r\n\r\nNik (41:52)\r\nOkay, why 100 million?\r\n\r\n\r\nMike (41:56)\r\nbecause someone once told me that it'd take me five years and now I'm just like, I don't know. don't know. I mean, it's just something that,\r\n\r\n\r\nkind of as a goal and I have it written up here on the whiteboard, which made me think of it. 2028.\r\n\r\n\r\nNik (42:13)\r\n20, 28, 100 million, all right. And what advice would you give yourself? I'm gonna say five years ago, before you started the vending machine roll up, what advice would you give yourself?\r\n\r\n\r\nMike (42:34)\r\nI think there's a couple of things, Nick. That's a really good question. First one is something I learned from the book, Never Eat Alone, you know, the whole kind of cliche, your network is your net worth before you need something from someone, you better provide value first, you know, whatever that is. I think the second thing is professional persistence. You know, I went to the national vending conference three months ago and gave out\r\n\r\n\r\nmy business card to probably 60 different suppliers. And I had one company and one sales rep that sent me a follow up after that conference. Well guess who's going to get my business. So like people buy from people, you know, and like today people are lazy. like AI will do it for us at the end of the day. I mean, you still got to send a follow up and schedule the follow up and do what you say you're going to do. So professional persistence. then I think the third thing\r\n\r\n\r\ngenerally is be curious. You I think your podcast is a great example of this. Like you listen to podcasts and people ask a question only to chime in with the answer that they wanted to lead you to where like you are generally when you listen to your episodes, you're curious about whoever you're interviewing and you want to learn and you want to, you know, the, agency idea. Yeah, you're providing ideas, but it comes out of place of curiosity. And\r\n\r\n\r\nThat's just something more people should be curious and not just think they know it\r\n\r\n\r\nNik (44:03)\r\nThat's awesome. I'm glad you've gotten that from my podcast, because that's definitely the hope with it. This has been an awesome conversation. I think just really high value. Where can people come find you? Where's the best place?\r\n\r\n\r\nMike (44:14)\r\nInstagram, Twitter, think Mr. Passive and then if folks are interested in learning about the Vending Niche, Vendingpreneurs is a good site for what we offer with our community or you can just follow me on mrpassive .com which is just like my newsletter, a lot of free resources, things like\r\n\r\n\r\nNik (44:36)\r\nMike has been awesome. Thank you, my\r\n\r\n\r\nMike (44:37)\r\nYeah, this is awesome. Hopefully we can do it again sometime.\r\n\r\n\r\nNik (44:44)\r\nLet's do it, we'll talk soon. Bye bye.\r\n\r\n\r\nMike (44:45)\r\nOkay, thanks, Nick.",
  "metadata": {
    "duration": "",
    "date": "2025-10-01",
    "platform_source": "Google Drive"
  }
}