{
  "episode_number": "78",
  "episode_title": "Selling Drugs, Vending Machines and Stripping Bankrupt Companies for Parts with Chris Koerner",
  "guest_name": "Chris Koerner",
  "business_name": "Co-Founders",
  "transcript": "﻿Chris Koerner (00:00.248)\r\nAlright, so time for a little perfume vending update. So over the summer, launch of Real goes viral about a perfume vending machine. We start selling perfume vending machines. We sold a little over $100,000 worth and then our two rockstar sales guys left in the same month. One of them took another job. One of them started a company and that's kind of the sucky part of having a company called Co-Founders is that all these guys want to go start other businesses. What are you going to do? This is a trade-off. So we went from\r\n\r\n\r\nNik (00:24.032)\r\nThey're entrepreneurial. Yeah. I don't know. Yep.\r\n\r\n\r\nChris Koerner (00:29.568)\r\nsales every week to zero sales because zero sales people. But we just hired three salespeople, all of them rock stars, very excited. And we have three products now we're no longer PV perfume vending Nick, what what are we selling? What are we selling? Nick?\r\n\r\n\r\nNik (00:46.08)\r\nDude, what are we selling? All right, so we got perfume vending machines. People know about that. They're not really super popular here in the States, but they're popular in Europe. You go up to it, you pay money, you get a spray of a perfume. Then Chris had this post. It's a machine that cleans motorcycle helmets. Randomly went viral. And then we are also now selling, drum roll please, cotton candy vending machines.\r\n\r\n\r\nChris Koerner (01:08.482)\r\nOf we are.\r\n\r\n\r\nNik (01:09.342)\r\nIt's like, of course we are. Most people are like, I had an accident this weekend. what happened? I tripped in the yard while I was doing yard work. No, Chris is like, I had an accident this weekend. what happened? I tweeted and started this new six figure business. I'm sorry.\r\n\r\n\r\nChris Koerner (01:22.904)\r\nor posted a video because that's that's more accurate lately, but cotton candy vending machines are just so obvious because it's so visual. It's you're selling to kids, the margin is like somehow the margins over 100%. I don't know how that math works, but it's there. And so like people want to post about it, the kids want to buy it. And the things on wheels. So I posted a video about it and it went\r\n\r\n\r\nNik (01:24.8)\r\nYeah.\r\n\r\n\r\nChris Koerner (01:48.158)\r\nsemi-viral and we got a bunch of leads and we got over 2000 leads on the helmet cleaning vending machine and now it's like we've accidentally started a company that makes videos that drives leads to sell random vending machines.\r\n\r\n\r\nNik (02:01.376)\r\nWell, and what's crazy about it to your point, like when we first posted about this in August and we got a bunch of traction, we had sales guys, we didn't think we were starting a real business. It was like, cool, we'll just capture this opportunity. And now we've actually created a proper business. to your, like we've talked about this all the time. It always takes longer than you think and costs more than you budgeted for. You know what I mean? Like here we are now almost November and yeah, we've sold almost $200,000 worth of vending machines, but.\r\n\r\n\r\nstill feels like we haven't even scratched the surface of the opportunity just because we've been creating the foundation in order to grow it.\r\n\r\n\r\nChris Koerner (02:35.788)\r\nYeah, it takes longer than you think it costs more than you think and your projections almost never are hit.\r\n\r\n\r\nNik (02:42.142)\r\nYeah, I think there's like always two, in my opinion, two ends of the spectrum. Either you blow past your projections. You just freaking crush it like we did with Mining Syndicate, right? Like out of the gate, $10 million in the first three months revenue. And you're like, holy crap, I didn't even think that was possible. Or you significantly like undershoot your projections. just, took longer. It's not that anything went bad. You just don't know what you don't know at the time. That's why so many entrepreneurs are like, if I knew everything I knew now, I wouldn't do this business again. It's just because you don't know.\r\n\r\n\r\nChris Koerner (02:45.015)\r\nof three.\r\n\r\n\r\nNik (03:11.232)\r\nI had this conversation. think ignorance can be a really good motivating force to get you to do something. Because if you actually knew everything, you would never start.\r\n\r\n\r\nChris Koerner (03:19.98)\r\nYeah. My wife says, Chris, you're ignorant. said, but Nick said that's a superpower. So.\r\n\r\n\r\nNik (03:24.64)\r\nDid she say ignorant or ignorant?\r\n\r\n\r\nChris Koerner (03:27.927)\r\nUhhhh... I have to make a call.\r\n\r\n\r\nNik (03:29.076)\r\nYeah, okay, I heard it. I heard it.\r\n\r\n\r\nChris Koerner (03:31.872)\r\nAnyway, so that's a quick update. It's just, it's a fun business. It's cool.\r\n\r\n\r\nNik (03:36.126)\r\nYeah, shout out to the three sales guys. We got Gage, we got Terrell, and we got Jeff, whose boss's name Gioff, which is freaking amazing. And we are stoked to have them and building a really cool team. All right.\r\n\r\n\r\nChris Koerner (03:47.456)\r\nright? All right. All right. Little story here. Little story. So what happened during COVID? I'm gonna tell you what happened because a lot of things happened. Everyone bought by everyone bought bikes. Okay, are we in agreement? Everyone bought bikes.\r\n\r\n\r\nNik (04:02.464)\r\nOkay. I don't know. I didn't buy a bike.\r\n\r\n\r\nChris Koerner (04:07.224)\r\nI'm hot bikes because this\r\n\r\n\r\nNik (04:08.842)\r\nWell, you bought a Peloton, so I don't... Is that a bike?\r\n\r\n\r\nChris Koerner (04:12.022)\r\nI bought all the I bought bikes.\r\n\r\n\r\nNik (04:15.36)\r\nDude, okay, I went over to Chris, I've been to Chris's house many times. He's got a Peloton in his room, but he's also got this like little contraption that allows you to take your real road bike, bring it into your room and like, it acts like a Peloton, but I don't even know how to describe it. But I'm like, well, what's the point of the Peloton? And you're like, if I want to take one of the classes, hello. Do you want Rachel's teaching? Go, go, go guys. Okay, 17, 18, feel the pump, feel the pump, coming down, coming down.\r\n\r\n\r\nChris Koerner (04:24.908)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (04:43.575)\r\nOkay, listen, it's so obvious what's different about these Nick. On the Peloton, you're taking virtual classes with virtual people. And it's like so fake. It's just fake and synthetic. But on the, on the Wahoo, which is the name of the contraption that you put your bike on, where you connect with Zwift, am I saying that? Is it Zwift? Z, one sec, where you connect with Zwift for $15 a month.\r\n\r\n\r\nNik (04:54.932)\r\nRight. Right.\r\n\r\n\r\nChris Koerner (05:11.308)\r\nYou can write in a virtual world against people all over the world. Okay, it's much more real. It's much more real. It's totally different.\r\n\r\n\r\nNik (05:19.486)\r\nOkay. All right. So everybody during COVID bought a bike is where we landed.\r\n\r\n\r\nChris Koerner (05:22.988)\r\nYeah, so this is what I bought. I bought a Peloton bike. I bought a Peloton treadmill. I bought a bike to put on my Wahoo contraption so I could ride in the virtual world via Zwift. Then I bought a road bike for the road to get outside. And then I bought a mountain bike. OK, so that's five. Thankfully, all of this happened while Mining Syndicate was going from 0 to 10 million and I had money for all this stuff because I have not bought a bike since.\r\n\r\n\r\nNik (05:27.594)\r\nMm-hmm.\r\n\r\n\r\nNik (05:38.762)\r\ncourse. Of course.\r\n\r\n\r\nRight. For the mountains in Texas. Right.\r\n\r\n\r\nNik (05:53.216)\r\nFor people who don't know, is the cheapest person in the world. So for him to buy five essentially of the same thing, it just tells you how much discretionary income he had at the time.\r\n\r\n\r\nChris Koerner (06:02.102)\r\nYes. Anyway.\r\n\r\n\r\nI bought my two real bikes from a business called the pros closet. Okay. The pros closet has been around for 12, 13 years. It they're based out of Denver and it's pretty much like a car max for bikes, but online only you can sell your bike to them and ship it to them or you can buy used bikes from them. Also accessories, new bikes, et cetera. But really it is an eight figure used bike business called the pros closet.\r\n\r\n\r\nOkay. They were doing well before COVID then COVID hit. They were doing really well and they went the VC route and they raised, I want to say $55 million. Now let's, let's be very clear, Nick. This is a Shopify store. It's a Shopify store. Period. And so what was interesting was if you, if I'm in Texas there in Denver, I want to sell my bike to them. They would ship me like a bike box and I could break down my bike and ship it back to them. But here's what\r\n\r\n\r\nNik (06:35.338)\r\nSheesh.\r\n\r\n\r\nNik (06:47.615)\r\nWhat?\r\n\r\n\r\nNik (06:51.753)\r\nRight.\r\n\r\n\r\nChris Koerner (07:04.536)\r\nThey did wrong. They paid way too much for their trade-ins because the value of bikes went crazy in 2021, 2022. They paid too much and then everyone stopped buying bikes, but they paid way too much for these bikes. They couldn't unload them and they've got a glut. And I went to the website the other day to look for something. I hadn't been there in a year and it literally said, we have one more bike left in stock. We're going out of business. It's been a great ride. Great 13 years.\r\n\r\n\r\nNik (07:18.048)\r\nthey've got to go out in the inventory.\r\n\r\n\r\nNik (07:32.622)\r\nWhat?\r\n\r\n\r\nChris Koerner (07:33.548)\r\nAnd then this is on their website. said, we have sold over 50,000 bikes. And then they didn't say how many accessories, but 50,000 bikes and the average bike on the pros closet is like three grand. So what's that 150 mil in 12 years plus accessories, shirts, helmets, you name it.\r\n\r\n\r\nNik (07:43.744)\r\nyou\r\n\r\n\r\nNik (07:48.32)\r\n$150 million.\r\n\r\n\r\nNik (07:55.776)\r\nHow are they, wow, how are they going out of business? Especially when you raise $55 million. Well, I guess when you just buy all that inventory.\r\n\r\n\r\nChris Koerner (07:55.884)\r\nand went out of business.\r\n\r\n\r\nChris Koerner (08:02.378)\r\nMaybe that's why they're going out of business, right? Because like no exit scenario was good enough to pay off their shareholders. Like they were so diluted. Isn't that crazy? Like it's really easy in hindsight to be like, dude, what are you doing? Like, why are you doing that? But nobody knew. We didn't know what was going to happen. Right? Like I remember having conversations about e-commerce, like who's going to go back to the grocery store when we're all accustomed to ordering them online. Everyone went back to the grocery store. You know, like, yeah, Instacart's still there.\r\n\r\n\r\nNik (08:09.034)\r\nto that's insane.\r\n\r\n\r\nNik (08:16.096)\r\nThanks\r\n\r\n\r\nChris Koerner (08:31.488)\r\nIt's doing fine. But like, if you look at the e commerce trends, e commerce jumped forward like seven years during COVID. And then it shrunk back like five. So it's still a net win for e commerce. But a lot of it just went back to doing what we were doing before.\r\n\r\n\r\nNik (08:45.76)\r\nWell, it's just a testament to how much money we had in the system. Everybody thought that their thesis was correct. They're like, no, no, it'll make sense. even if we don't, if we're not right, we have all this money to put somewhere and they put it into weird bets like this. That is such a freaking weird, man, that's a crazy story.\r\n\r\n\r\nChris Koerner (08:59.296)\r\nAnd, and really it's the same conversation as mining syndicate because we launched that during that time of everyone having way too much money and China had just backed out of mining and the, the, like the mining profitability had never been higher, literally ever. So it was like the perfect storm to launch that. But really when we tell people we were successful because we're so good at business, right?\r\n\r\n\r\nNik (09:24.576)\r\nI mean, we were, thankfully we didn't expand the way that we could have expanded. And we had lot of opportunities to really like, do let's double down on this, let's build a facility, let's buy this company, let's do all of these things. And we ultimately decided now let's be more conservative with it. And that's honestly saved our skin. I think if we would have overstretched it would be a much different situacion.\r\n\r\n\r\nChris Koerner (09:44.088)\r\nAgree.\r\n\r\n\r\nI agree, but I'm not done talking about the pros closet. This isn't just me talking about something cool that I saw. There's opportunity here, Nick. There's so much opportunity. Do you remember in the newsletter business, you know a good bit about the newsletter business, roughly the revenue per subscriber you can expect per month if you send a daily newsletter, call it five times a week. Do you remember? Yeah.\r\n\r\n\r\nNik (09:59.978)\r\nI got an idea for that today, actually.\r\n\r\n\r\nNik (10:12.508)\r\nyou're asking me? $2.\r\n\r\n\r\nChris Koerner (10:16.696)\r\nI believe it's like, it depends. Like it depends on a lot of things. Are you in finance? Are you in ice cream?\r\n\r\n\r\nNik (10:18.333)\r\nNo, no, no.\r\n\r\n\r\nNik (10:23.811)\r\nProbably, probably like 50 cents.\r\n\r\n\r\nChris Koerner (10:26.68)\r\nExactly. 50 cents per subscriber per month. And so how big is the pros closet email list after 12 years serving? So if let's say that they sold 50,000 bikes and 50,000 accessories, 100,000 customers, what that doesn't account for are the multiple hundreds of thousands of people that subscribed and never bought anything like on my e-commerce sites. It's like a three, four, five to one ratio of emails to actually paying customers. So they could have an email list of three, 400,000 people.\r\n\r\n\r\nNik (10:44.415)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (10:54.872)\r\nwhich would be a $200,000 a month newsletter. And you think you couldn't monetize a cycling newsletter? Like cyclists are affluent. They spend money. They're passionate. They're like, it's the perfect demographic to sell to. So now you've got a 2.5, $3 million a year business with 75 % margins. It's not a $30 million a year business, but it's much more profitable and easier to run.\r\n\r\n\r\nNik (11:20.16)\r\nhave to be doing that right? mean if they took VC money, those guys are smart, they're probably stripping it for parts at this point or at least trying to figure out where the asset value is.\r\n\r\n\r\nChris Koerner (11:28.854)\r\nI reached out to the CEO.\r\n\r\n\r\nNik (11:31.742)\r\nYou don't care, do you? You don't care. You don't care.\r\n\r\n\r\nChris Koerner (11:35.926)\r\nAm I in it for the game or the content, Nick? Come on.\r\n\r\n\r\nNik (11:39.496)\r\nI'm sorry, but Chris Kerner is in for office hours and he's ready to teach. Go ahead, Professor.\r\n\r\n\r\nChris Koerner (11:46.788)\r\nI just reached out to the CEO via LinkedIn and I was like, dude, what are doing with your email list? I want to buy it. And he's like, we already sold it. So there it is. All this hype. If I can't live up to the hype, I got to make it a little funny. I got to make Nick laugh. But still, like, I wish I knew what they did. And maybe one day I will know. But my whole point is that\r\n\r\n\r\nNik (12:03.584)\r\nYou got to make it look like it's good.\r\n\r\n\r\nChris Koerner (12:14.944)\r\nNate, there's 3 million Shopify stores. Okay. Let's say 30,000 of those are big businesses, big being eight figures plus. And people would be surprised. Any one of those businesses could have a paid newsletter alongside what they're selling on their Shopify store. Why not?\r\n\r\n\r\nNik (12:32.916)\r\nWell, I've told you this before, but I have like three goals in business, three other goals in business. One, I want to become a professor. Adjunct would be perfectly fine by me. I'd love to teach at a university. I think that'd be super fun. Two, I want to buy a business out of bankruptcy. I want one of those stories that's like, so yeah, I bought it for 500,000 and now it's a $20 million a year company. I just think that's really cool.\r\n\r\n\r\nThis is one of those types of stories. I think that there are a lot of other opportunities out there, but how do you find them? Like that's my thing is I'd love to find one of these that are like going out of business or just shutting their doors, but what's the game there? How do you find them?\r\n\r\n\r\nChris Koerner (13:18.059)\r\nWe talked about this like two months ago. You go, you, you sell the one to sell the many, you go through the CPA. Remember that? That was like two months ago or you just freaking tweet about it. And like people that have failing businesses are not going to be talking about it, but they will in the DMS if they think you can help them, you know,\r\n\r\n\r\nNik (13:24.405)\r\nMm.\r\n\r\n\r\nThat's right. That's right. I remember that now.\r\n\r\n\r\nNik (13:36.906)\r\nDude, the third goal I have, I wanna own a commercial real estate. I know that's like stupid, but I just.\r\n\r\n\r\nChris Koerner (13:46.028)\r\nYou have a fourth though too.\r\n\r\n\r\nNik (13:48.308)\r\nWhat is it? Did I forget it? What is it?\r\n\r\n\r\nChris Koerner (13:50.092)\r\nYeah, I thought you wanted to own like a restaurant or something. Like, no, like seriously, like something where like an ice cream shop. You've talked about that.\r\n\r\n\r\nNik (13:52.999)\r\nno.\r\n\r\n\r\nNik (13:58.908)\r\nyeah. I mean, so my brother-in-law, is a big foodie. And we've talked about like, when we retire, we're just done. And we want something to do, it'd be cool to have a restaurant together. That's just like small town. Maybe we sell ice cream. Maybe we just sell like caramel apples or like it's kind of specialized. It's not necessarily a big old restaurant. But I just think that would be fun to keep you busy. Like I'm not thinking of that as like, that's gonna make me money or that's gonna be a bucket list item. That's a good one.\r\n\r\n\r\nChris Koerner (14:06.818)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (14:24.151)\r\nYeah, yeah,\r\n\r\n\r\nChris Koerner (14:28.408)\r\nwhat I want to do with barbecue.\r\n\r\n\r\nNik (14:30.144)\r\nI know. All right, you're ready for me. OK, I I need a little rope here. OK, I'm going to try my best not to talk that much, but this requires some explanation, so I need you to keep me on track. Are you ready? All right, have you ever heard of a pharmacy benefit manager?\r\n\r\n\r\nChris Koerner (14:45.676)\r\nYes, sir.\r\n\r\n\r\nChris Koerner (14:50.294)\r\nI just fell asleep while you said those three words. So that's a no.\r\n\r\n\r\nNik (14:53.6)\r\nOkay, let me back up. Do you know Mark Cuban?\r\n\r\n\r\nChris Koerner (14:57.396)\r\nNever heard of her. Absolutely.\r\n\r\n\r\nNik (14:58.528)\r\nOkay, Mark Cuban has a company called Cost Plus Drugs. You've heard of that company, right? And what's the...\r\n\r\n\r\nChris Koerner (15:03.434)\r\nAbsolutely. Also, also, I will say we were talking about this type of stuff the other day and you were sounding really intelligent. And then I flew to Columbia and I listened to the latest all in podcast with Mark Cuban. And then I realized, Nick sounds smart just cause he listens to the all in. Cause it was like, it was like, it was really good. And it was Mark Cuban. So I learned a lot about that type of stuff.\r\n\r\n\r\nNik (15:20.746)\r\nMuhammad Katz this part.\r\n\r\n\r\nNik (15:28.597)\r\nOkay, so Mark Cuban has this company called Cost Plus Drugs, and this is going to be a play on that. But it's a pharmacy benefit manager. And what a pharmacy benefit manager does is you or I as an individual can't go to a pharmaceutical manufacturer and just buy our drugs directly because we couldn't afford the price. So the pharmacy benefit manager can access middleman, they negotiate bulk pricing, and then they sell to the end user. Typically, the pharmacy benefit manager is working with a company.\r\n\r\n\r\nSo the company utilizes a pharmacy benefit manager to purchase drugs on their behalf. I want you to guess how big the pharmacy benefit manager industry is.\r\n\r\n\r\nChris Koerner (16:09.592)\r\nI'm just gonna sound like an idiot. I don't know. I don't know 30 billion.\r\n\r\n\r\nNik (16:15.36)\r\n$590 billion.\r\n\r\n\r\nChris Koerner (16:17.474)\r\nMuhammad, literally edit this out please. I do have some pride left. I have some pride left.\r\n\r\n\r\nNik (16:22.272)\r\nDude, it's massive. It's massive. It's a massive industry. It's a massive expense to businesses. On a yearly basis, companies spend on $1,000 per year per employee on pharmacy benefits. Typically, again, it's through the pharmacy benefit manager. The way that it works is there are thousands of drugs. How do you know what price you've negotiated on what drugs? They have this thing called the formulary.\r\n\r\n\r\nChris Koerner (16:38.872)\r\nMm-hmm.\r\n\r\n\r\nNik (16:51.52)\r\nI know I'm getting in the weeds here, but this is important. They have this thing called the formulary that spells out exactly how much each drug costs. And then you purchase at that price. But there's a problem here. There's no transparency in the industry. Typically, PBMs and manufacturers have non-disclosure agreements. other PBMs don't know what other PBMs are necessarily purchasing those drugs at. So when they go to negotiate with the manufacturer, there's some asymmetric\r\n\r\n\r\nInformation that the manufacturer has that the PBM doesn't the flip side. Companies pharmacies, they also don't know what other companies and pharmacies that are purchasing from the PBMs are paying for specific drugs. So the PBM has a lot of pricing power, so it's very opaque. You don't. You don't know necessarily what what people are paying because of either non disclosures or these companies just want to keep the margins for themselves. OK, so. We went over there's two ways you can buy drugs. It's either through the PBM or through.\r\n\r\n\r\nChris Koerner (17:43.928)\r\nMm-hmm.\r\n\r\n\r\nNik (17:49.49)\r\nmanufacturer. Some companies when they get big enough become self-insured. Have you ever heard that word before? And what that means is like they're eliminating the PBM essentially in this case. They no longer need the PBM to go negotiate on their behalf because they have enough purchasing power to go and negotiate directly with the manufacturer. But again, they have to negotiate the formula. They have to set the prices first and still the manufacturer has some asymmetric information. enter cost plus drugs.\r\n\r\n\r\nMark Cuban's company publishes their formulary online. His whole thesis is, look, we're just gonna mark up 15%. So we don't really care. This is what we're paying for these drugs and then we mark everything up 15%. So it's now out in the open what a big company like Mark Cuban's company pays for these drugs. And this is where I think the opportunity is. The average markup is about 30%.\r\n\r\n\r\nSo if you're spending $1,000 per year per employee, the pharmacy cost, if you will, is like $770 and the employer markup is $230. So you're paying $230 essentially of profit to the PBM who's in between you. With Cost Plus, if it's still that $770 for the pharmacy, you're now only paying $116 difference. Or excuse me, sorry.\r\n\r\n\r\nYou're not paying $115 difference. You're saving $116 a year per employee. Right? So if you switch to cost plus, that's how much money you'll save. $100 per employee per year. Think about companies with a thousand plus employees, right? $100 per employee per year all of a sudden becomes $100,000 a year in savings. All right. This is where I think the business opportunity is. I think you could...\r\n\r\n\r\nChris Koerner (19:22.349)\r\nMm-hmm.\r\n\r\n\r\nNik (19:45.032)\r\nstart a business where you just reach out to companies and you say, look, you negotiate your formulary every year, right? Yep. All right. And the company could negotiate with the PBM or they could negotiate with the manufacturer. It doesn't matter whether it's the middleman or the actual manufacturer. And you say, hey, look, I will help you reduce your overall spend on pharmacy by, you know, call it 20%, whatever the number is. I just want you to pay me a percentage of what I save you.\r\n\r\n\r\nAnd they'll say like, okay, how are you going to do that? And you don't necessarily have to give away your secret sauce, but you can now go and see publicly what prices cost plus drugs are charging. And you can use cost plus as a stocking horse. You can say, Hey, look, PBM, either you renegotiate with us or we're to go to cost plus, or you go straight to the manufacturer and you say, Hey, look, I know this is what cost plus is paying for, you know, is buying for these drugs. I want it even cheaper and, and use that data to essentially level the playing field. There's no longer this.\r\n\r\n\r\nasymmetric information that they, either the PBM or the manufacturer are negotiating with because now you've leveled the playing field. And I think that there is a ton of money to be made just by reaching out to these companies and either saying, I can look at your formulary and show you which drugs you need to negotiate harder on, or I'll do this for you as a service. What do think?\r\n\r\n\r\nChris Koerner (21:06.49)\r\nChris Koerner (21:10.102)\r\nI love it. I love it.\r\n\r\n\r\nNik (21:12.138)\r\nYou're like, I don't doubt about two minutes in, I'm not gonna lie.\r\n\r\n\r\nChris Koerner (21:15.92)\r\nthat's a long time. First of all, let me get my jokes out of the way before I respond to it. Hey Siri, remind me to email the president of Marvel to make a new movie series where he assembles a cast of characters called the Formulary. Okay, I was muted, right? What's up? What's up? Second of all, I think it's good bit if you're talking to someone like at a dinner party and they say something confusing and like you've heard of that, right? You're like, PBM, yeah. All you gotta do is make it an acronym.\r\n\r\n\r\nNik (21:33.034)\r\nLove it.\r\n\r\n\r\nChris Koerner (21:44.92)\r\nand they'll assume you know what you're talking about. PB, I'm like, well, okay. I've never called that. Yeah. Yeah. No, I love it. Like this goes in line with our thesis of like, what you can't just like look at this guy's website, because he's probably like, why can't they just look at this guy's website? Because they don't know about his website. That's not their SOP. they're, they're not thinking to. And you still have to negotiate.\r\n\r\n\r\nNik (21:46.4)\r\nThat's make it make it an acronym and those and I'll assume you know what you're talking about.\r\n\r\n\r\nNik (21:57.664)\r\nThanks\r\n\r\n\r\nNik (22:10.068)\r\nWell, and for some of these large companies, it's such a small line.\r\n\r\n\r\nChris Koerner (22:12.992)\r\nRight? Like that's the hard part is negotiating, not just looking at the website.\r\n\r\n\r\nNik (22:15.968)\r\nRight. And for many of these companies, it's such a small line item that many times they don't even think about it. If your company doing, let's just say, $10 billion a year in sales and your pharmacy spend is, even if it's $10 million, that's probably a lot, $1 million a year, that's nothing on the P &L to you. But for you or I, if we're starting a business and we're like, hey, I'll take that million down to 500,000 and I just want 20 % of the upside,\r\n\r\n\r\nChris Koerner (22:38.466)\r\nMm-hmm.\r\n\r\n\r\nNik (22:45.738)\r\nand I'll do all the work for you. It's like, yeah, sure. No, no brainer. I'll outsource this to you. So I definitely think there's a ton of opportunity to go to larger companies and help them renegotiate their pharmacy formulary. So if you're like writing notes, pharmacy formulary, large companies, BBMs, to me that like there's a massive opportunity there.\r\n\r\n\r\nChris Koerner (23:04.344)\r\nWouldn't that make it hard to sell into these guys if it doesn't move the needle that much? Like, eh, yeah, we could save money. I could see how that works. There's no risk, but like, that's not a priority.\r\n\r\n\r\nNik (23:14.56)\r\nIt could. Yeah, it totally could. But usually each one of these departments are mandated with a budget of some sort. And the budget that they're focusing on for the most part is going to be on premiums or their risk pool for overall health costs. And pharmacy is typically a minority of their spend. The majority of their spend is going to be on pre-existing conditions relative to surgeries or primary care physician.\r\n\r\n\r\nmany other health services other than just the pharmacy benefits. I think it's not the top priority. They would be incentivized to work with you because it's saving them money and saving them time, but it's not going to be something that they're necessarily looking at full-time from their position because for them, doesn't move the needle as much as other things.\r\n\r\n\r\nChris Koerner (24:01.538)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (24:07.064)\r\nHow could someone listen and get their first customer doing this?\r\n\r\n\r\nNik (24:10.336)\r\nYeah, so what I would do is I would just honestly go to someone that you know who owns a business, small business, could be a small business and just ask them, hey, tell me about your benefits. How does it work? And I guarantee for the most part, they'll be like, I'm not really sure. So I would start digging in because if you know nothing about the space, it's going to be useless for you to go to a bigger company. So just go to a local company that you know, start digging in like, okay, how does this work? How exactly do they?\r\n\r\n\r\nnegotiate the formulary. Okay, they're insured by UHC, who's setting these prices. And then once you get a little bit familiarized with it, I would honestly go to LinkedIn and just look at people in your local area or your network that are working for large companies that are in a either human resources position or an executive position on the finance side, CFO, controller, et cetera, message them and be like, when you renegotiate this year for your benefits, please let me know.\r\n\r\n\r\nI have a program that can save you 30 % on your pharmacy benefits. And it won't catch everybody, but that will catch a lot of people because they're like, how did they know they renegotiate every year? that's okay. Let me look into this.\r\n\r\n\r\nChris Koerner (25:22.774)\r\nYeah. For the first customer you said to get a business owner, what, like what type of business would he own? For example.\r\n\r\n\r\nNik (25:28.81)\r\nThey have to have some employees that they help pay for benefits for. So it's probably going to be somebody that has at least, I think the number is 20 employees. I can't remember what the Affordable Care Act mandates, but if you have something like, it's somewhere in that ballpark where if you have over a certain number of employees, you have to offer health benefits. Otherwise your employees can just go get benefits on the exchange. So it has to be somebody who has a business that's like, let's just call it 30 employees or larger.\r\n\r\n\r\nChris Koerner (25:42.486)\r\nwas like 26 or something. Yeah.\r\n\r\n\r\nNik (25:58.624)\r\nAnd then after that, it doesn't matter really what the business is. They just have to have a certain number of employees that cross the threshold that require them to provide health insurance.\r\n\r\n\r\nChris Koerner (26:06.616)\r\nSo you could just like use Manta or some other generic business database and sort out all the ones smaller than, call it, I think it's like one to 50, 50 to 100. You just sort out everything under 50 and start reaching out to them.\r\n\r\n\r\nNik (26:18.974)\r\nYeah, if you were just going to do it cold locally, I would just, excuse me, if you were just going to do it cold, I would do it locally because you want to be able to go meet with them in person. mean, health benefits in particular are just a very intimate, I guess, thing to renegotiate. So I would look for local business owners that fit that profile.\r\n\r\n\r\nChris Koerner (26:27.501)\r\nYeah.\r\n\r\n\r\nChris Koerner (26:36.738)\r\nOkay. like, mean, we, I think I tweeted about this. I call it like the, eat when you eat. Right. It's, it's kind of like the idea of the FedEx savings. I don't remember where I talked about this, but this company that I use called 71 pounds, they would audit your, your FedEx labels. And if anything was late, it would automatically file a dispute and whatever they recovered, they would take 30 or 40 % of, and it was really time consuming and manual for a business owner to do this for himself, but they had automations hooked up where they could do it.\r\n\r\n\r\nNik (26:43.294)\r\nMmm, yeah.\r\n\r\n\r\nNik (26:58.954)\r\nMm-hmm.\r\n\r\n\r\nNik (27:06.24)\r\nAnd you can do this in a bunch of different businesses. It's just anything where people renegotiate their contracted rate somewhat frequently, you can go in and be like, hey, are you with Zapier? Let me help you renegotiate. Or, hey, you're with Verizon? Let me help you. There are lots of these types of services you can do.\r\n\r\n\r\nChris Koerner (27:06.326)\r\nwith Zapier, right? Just a beautiful business model.\r\n\r\n\r\nChris Koerner (27:21.815)\r\nYeah.\r\n\r\n\r\nChris Koerner (27:26.678)\r\nYeah. All right. I got one for you. Ready? Okay.\r\n\r\n\r\nNik (27:31.092)\r\nYes. Yes.\r\n\r\n\r\nChris Koerner (27:37.922)\r\nHave you used AI in a spreadsheet much? Like not uploading a spreadsheet to chat GPT, but man, it is so cool. So here's what I did. Yeah. So there's this Google Sheets extension called, I think it's called GPT for Sheets and it's dirt cheap, costs almost nothing. And you basically type in a formula equals GPT. And then in parentheses, you put a prompt and then you put comma and then the cell that you're referring to.\r\n\r\n\r\nNik (28:03.146)\r\nHmm. Okay.\r\n\r\n\r\nChris Koerner (28:05.088)\r\nAnd so there's just so many use cases here. I did this for my newsletter. Like I would love the first names of as many of my newsletter subscribers as possible. Because when I email them, I could include the first names and it'll help your deliverability because all of the carriers will see that each email is unique and it seems more personalized. Like people know I'm not writing them personally, but it just feels better. Right? It just shows better.\r\n\r\n\r\nNik (28:29.94)\r\nYeah, agreed.\r\n\r\n\r\nChris Koerner (28:32.02)\r\nAnd you can put in what's called fallback values to where if you can't get their first name, then you could just say like, like for Texas next, what I do is howdy comma. And then if I have their first name, it'll put their first name. If I don't, it'll just put partner. So it's like, either way, I don't look like an idiot. Right. And so\r\n\r\n\r\nNik (28:42.368)\r\nthe\r\n\r\n\r\nNik (28:47.072)\r\nRight. It's also not like I get all the time in Twitter. Hey, co founders, are you worried about? I'm like, that's not anyways, keep going.\r\n\r\n\r\nChris Koerner (28:56.864)\r\nYeah, right. So on my subscribe page, if I were to ask for their first name, then I'd lose 20 to 30 % of subscribers. So I don't it's not worth that much to me, right? Yeah, it's just more friction.\r\n\r\n\r\nNik (29:06.879)\r\nReally?\r\n\r\n\r\nChris Koerner (29:11.256)\r\nBut I still want them. And so there are services where you can append data. There's one called Norbert where you can upload a list and it's going to go to LinkedIn. It's going to go all over the internet and say, all right, we think, you know, this guy's email is johnsmith at gmail.com. His name is going to be John. And right. Sometimes it'll use logic just by doing it that way. And sometimes it'll actually like connect the random, you know, dragonslayer at gmail.com email to a LinkedIn profile and then use their first name. So\r\n\r\n\r\nNik (29:25.28)\r\nWe think it matches with this.\r\n\r\n\r\nChris Koerner (29:41.528)\r\nNorbert and you know, it's competitors work about 30 4050 % of the time. But this GPT for sheets is awesome because it can do it as well. So I use it for two different things. So for perfume vending, for instance, we have a type form where we require their first name. But some people are idiots and they type in like a question, like, hey, I want to know the price of it. And it says that's their first name. It's like, that's not helpful. And some people don't put it because it's not.\r\n\r\n\r\nI don't know if it's we asked for it, but it's not like a required field that most people put it in. And then some people just type gibberish. And so I exported all the perf inventing leads to a Google sheet. I typed in a formula that's like, Hey, most of these are first names. Some of them are all caps. Some of them have no caps. want you to standardize them, make them all grammatically correct. If someone just writes a sentence and like there's no first name of any nationality found in that sentence, leave it blank. like it's a really long prompt. And then if it's like, if it's all caps, just make it good. If it's like,\r\n\r\n\r\ngibberish like people just hit the keyboard then just leave it blank and then you drag it down boom good to go and it costs like a fraction of a fraction of a penny per row\r\n\r\n\r\nNik (30:47.803)\r\nWhat?\r\n\r\n\r\nNik (30:54.176)\r\nSee, you're blowing my mind right now, because like data integrity is such a big problem, especially when you're trying to do any type of analysis. I mean, that was a big issue with all the leads that we got for perfume vending is people would put like, we, let me back up here. When you're people for information, you can do it one of two ways. You can leave it free text, or you can give them dropdowns. And when we ask them where they're from, these weren't dropdowns. It was like, where are you from? And so some people like they just misspelled Maryland.\r\n\r\n\r\nChris Koerner (30:59.661)\r\nI\r\n\r\n\r\nChris Koerner (31:23.852)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nNik (31:24.156)\r\nor like Michigan or South Africa. So I had to go in manually and find these ones and sort and clean up the data. I had to do like lot of manual data cleanup, especially for large data sets. That's incredible.\r\n\r\n\r\nChris Koerner (31:31.671)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (31:37.336)\r\nYeah, so then let's say you don't have first names, you just have an email address. Then the prompt is, hey, all I have is an email address. Can you like discern what the first name is? And if you can't like reasonably with 70 % accuracy, just leave it blank. Then because a lot of times it's like smithjohn at gmail.com. His name is john. It's not Smith, right? A lot of times it's like john 7727. it's john. And sometimes it's like mixed in there. And it's really, really good for that.\r\n\r\n\r\nand it costs almost nothing. now what I did was I went to my newsletter, I exported every single one, I drug it down, and now I have first names for like most of my emails. But it doesn't end there. Go ahead, go ahead.\r\n\r\n\r\nNik (32:17.792)\r\nOkay, so tell me the name of the plugin again.\r\n\r\n\r\nChris Koerner (32:21.836)\r\nGPT for Sheets.\r\n\r\n\r\nNik (32:23.264)\r\nOkay, so GPT for Sheets and then I just go in a cell equals GPT and then I tell it what I want, open parentheses.\r\n\r\n\r\nChris Koerner (32:30.821)\r\nopen parentheses, open parentheses, prompt, comma, cell number, and then you drag it down and close parentheses.\r\n\r\n\r\nNik (32:41.888)\r\nCould you do it where it's like prompt, comma, column, right? So it's like, I want you to find me the most common name in this column. Let's just say, boom. And then it'll be like, John. Like, will it do that type of information? Does that make sense?\r\n\r\n\r\nChris Koerner (32:47.5)\r\nYeah.\r\n\r\n\r\nChris Koerner (32:58.028)\r\nYeah, yeah. Like, you can already upload spreadsheets to chat GPT like you recommended a podcast. I listened to it yesterday, by the way, very, very good. And he was talking about he exports his YouTube analytics, uploads it to chat GPT and says, Hey, like, what are some commonalities here? Like, that's cool. But this is like hyper hyper granular, which I love. And so for all of these co founder applications, we have, you know, we've gotten 30,000 co co founder applications and like a third of them fill out a 28 minute long type form.\r\n\r\n\r\nasking all kinds of questions about businesses that they started, what they've done that's impressive, what school, when are they graduating? And we look at this and we're like, what do we do with this? Okay, we could like do control find Harvard, like that guy might be interesting, but that's like, that gets you 1 % of the way there, you know, because we don't care about Harvard, like we want a guy that built a Chrome extension from his dorm room and like hacked into the, the university servers, right? But that's in his story. That's not like,\r\n\r\n\r\nwe don't have a drop down that says did you hack into your university servers? And so we could totally make a prompt that's like, all right, here's our grading criteria. We want students that have actually done something, maybe it was a lemonade stand, but like they have to have already started a business, we don't care what the revenue was. We want students that have an eye for entrepreneurship, that are ideas people, we want students that this we don't care about GPA, ignore like assign zero weight to GPA is zero weight to school zero weight to graduation date. This is what we're looking for. Drag it down.\r\n\r\n\r\nScore them 1 to 10.\r\n\r\n\r\nNik (34:24.992)\r\nOkay, so I'm on Google Workplace Marketplace, Google Workplace Marketplace, GPT for Sheets. It's by Talarian. It's got some weird, it's like blue background with some stars on it.\r\n\r\n\r\nChris Koerner (34:31.224)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (34:36.642)\r\nsounds about right. Yeah, yeah. But I do if you're listening to this and you want to use this, you got to go to open AI get a $20 account, a month account if you don't already have it and get an API key, because GPT for sheets will allow you to use your own API key. And it costs especially almost nothing then because it's these things are really cheap on the surface. But the longer your prompt gets your input, and the longer of an output you're asking for, the more it's going to cost you.\r\n\r\n\r\nNik (34:37.756)\r\nAlright, I'm installing it.\r\n\r\n\r\nChris Koerner (35:05.706)\r\nSo across thousands of rows, actually can get expensive. So you want to use your own API key.\r\n\r\n\r\nNik (35:12.317)\r\nso you actually need to go and get your API.\r\n\r\n\r\nChris Koerner (35:14.506)\r\nYou don't need to know that you'll save a lot of money if you do\r\n\r\n\r\nNik (35:19.872)\r\nAll right, keep going with your idea because I'm all over the place at this point.\r\n\r\n\r\nChris Koerner (35:23.848)\r\nNo, that's it. I'm gonna make a YouTube video about this. I'm gonna like share my screen and do a how to\r\n\r\n\r\nNik (35:26.72)\r\nI promise you, listeners, you will hear this in a week, two weeks, three weeks. I promise you, I will come with ideas based on just using this Chrome extension. Like, because just the ability to clean up the data. right now, if I want to go in and take a look at your financials and say like, what's something that you're spending an exorbitant amount of money on? I got to go filter it the right way. I got to put in some formulas to show me which percentages. Like there's a million things I have to do just to get to the point where I can make\r\n\r\n\r\nChris Koerner (35:37.144)\r\nLet's do it.\r\n\r\n\r\nYeah, it's a big deal.\r\n\r\n\r\nNik (35:56.362)\r\nthe assessment where I can do the analysis. This could clean it up for me so much faster. Anyways, that's incredible.\r\n\r\n\r\nChris Koerner (36:04.064)\r\nYeah, another use case is I tweeted about this a month or two ago, but if you wanted to serve local businesses, sell them something, you could use Outscraper to just, are you with me, Nick? Nick? Nick?\r\n\r\n\r\nNik (36:20.736)\r\nYes, okay.\r\n\r\n\r\nChris Koerner (36:25.48)\r\nHe's not with me one way. Now he's not with me another. I know. Tone it down. Tone it. Tone the excitement down. Okay. I need I need you to act less like yourself like your wife always asked you to do. Don't be yourself so much. It's annoying. Right?\r\n\r\n\r\nNik (36:26.944)\r\nI'm with this in a spreadsheet. I'm playing with this a spreadsheet right now, okay? Is that what you wanted me to say?\r\n\r\n\r\nOkay, go ahead.\r\n\r\n\r\nChris Koerner (36:46.092)\r\nNo, like imagine you go to outscraper, you say, you know what, I want to sell software, I want to sell customer service software to nail nail salons. Okay. You scrape all of the one star reviews for nail salons in the country. And then you use, put them in Google sheets, use GPT for sheets to say, are like the most common repeated words in this dirty, late, closed, rude, right? And then you can build, build software around the complaints or\r\n\r\n\r\nNik (37:09.034)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nChris Koerner (37:14.54)\r\nConversely, show me all the five star reviews. What are you hearing the most? Boom, boom, boom. Wow, okay, there's a correlation between number of reviews and the word delicious. How can I monetize that? Like there's just endless ways you can use this.\r\n\r\n\r\nNik (37:27.914)\r\nWell, I'm really, I'm really curious to use it right now because like there are times where I get data and I'm like, I don't know how to sort this because it's just in a funky format. And so I'll go to chat GPT and I'll say, this is the data I have. This is the format it's in. I'm trying to do X, Y, Z write me a script for how to parse this data. And it'll be like, okay, do, and it'll tell me whatever to write. This could eliminate just even go into chat GPT. I could just write in here and tell it what I want. Anyways, that's freaking up. Yeah, I am.\r\n\r\n\r\nChris Koerner (37:33.154)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (37:53.592)\r\nThey're gonna love it. They're gonna love it.\r\n\r\n\r\nAlright, what do you got? What do you got?\r\n\r\n\r\nNik (38:00.262)\r\nAll right. Two options for you. Newsletters. Or dating.\r\n\r\n\r\nChris Koerner (38:13.362)\r\nLet's do dating.\r\n\r\n\r\nNik (38:14.654)\r\nOkay, so I was talking to somebody this morning that we both know. Her name is Kelly. She is our executive assistant. And she was complaining to me about her bumble interactions and just how stupid men are, you know, just texting out of the blue, right? And when you're trying to get laid, you say stupid stuff and that shows up in the DMs. So anyways, I was thinking about it and I started doing some research.\r\n\r\n\r\nChris Koerner (38:29.356)\r\nBumble.\r\n\r\n\r\nNik (38:44.448)\r\nI'm going to share some crazy things, okay? Are you ready for a crazy story, Chris?\r\n\r\n\r\nAre you?\r\n\r\n\r\nChris Koerner (38:52.862)\r\nYou're putting that in the hook, aren't you? That's good. That's going in the intro. sorry, sorry, sorry, Sorry. Ask me that again.\r\n\r\n\r\nNik (38:54.846)\r\nAre you ready? Well, I'm trying to set you up to tell. I'm trying to set you up because you told me. Chris, are you are you ready for some freaking crazy stats?\r\n\r\n\r\nChris Koerner (39:04.888)\r\nHow crazy of a story are we talking here?\r\n\r\n\r\nNik (39:07.722)\r\nDude. The craziest story you've ever heard.\r\n\r\n\r\nChris Koerner (39:16.12)\r\nI don't think you can hear it. It's just Tom Delon saying, I don't want to know. dang. I did the wrong part. did the wrong part. Hold on. on. Hold on. What's that? What's that? Yes. Yes. Muhammad. Muhammad literally actually edit this out.\r\n\r\n\r\nNik (39:25.386)\r\nDo you want me to you up again? Do you me set you up again? Okay.\r\n\r\n\r\nWe need to come up with a safe word for Mohammed so he actually knows which parts to edit and which parts not to. So freaking funny.\r\n\r\n\r\nChris Koerner (39:49.432)\r\nAll right, do that again.\r\n\r\n\r\nNik (39:52.062)\r\nAre you ready for the craziest stat you've ever heard around dating?\r\n\r\n\r\nChris Koerner (39:55.586)\r\nHow crazy are we talking? Kind of scared.\r\n\r\n\r\nNik (39:57.472)\r\njust like so crazy, you're gonna hang up this call and start a business right now.\r\n\r\n\r\nNik (40:06.474)\r\nThank you.\r\n\r\n\r\nChris Koerner (40:09.174)\r\nYes, yes, I want to know. Tom\r\n\r\n\r\nNik (40:10.848)\r\nWhy would you say you don't want to know? 30 years ago, what was the number one way that people met their spouse?\r\n\r\n\r\nChris Koerner (40:20.148)\r\nHmm. don't know. School in person? Like down at the soda shop? I don't know. World War One? I don't know.\r\n\r\n\r\nNik (40:23.05)\r\nthrough friends.\r\n\r\n\r\nNik (40:26.592)\r\nYou're so dumb.\r\n\r\n\r\nthrough friends. What's the number one way today that people meet their spouse online? And it's cool. But there's something I think that we miss in meeting people online. And it's the social proof. Like when you met someone through your friends was like, I know, Gary, I'm friends with him, you should go on a date with him. It's like, Lauren said I should go on a date with him. Okay, cool. I'll go on a date with him. But when you go to these online dating sites,\r\n\r\n\r\nChris Koerner (40:34.69)\r\nOnline, online.\r\n\r\n\r\nNik (40:57.042)\r\nYes, you have a lot more access. You can talk to people. You see their profile. You see all this stuff. But as far as I don't like, there's no social proof. You've been on LinkedIn and you've seen where on LinkedIn it's like people can write recommendations. Right? Or like Sam Parr posted one time, he's like, hey, a friend of mine is looking for a date and he got a ton of people reaching out to him. I don't see any of that in the dating world. I just see it as this is me. You're putting your best foot forward and then people are reaching out to you and it.\r\n\r\n\r\nChris Koerner (41:25.4)\r\nMm-hmm.\r\n\r\n\r\nNik (41:26.048)\r\njust has created this really weird dynamic. Let me ask you though, do you know how big the online dating industry is? Revenue per year. It's about $10 billion. actually nine, call it actually nine billion dollars. By 2031, it's projected to be at $13 billion. So as far as like an annualized growth rate, it's about 7%, which is crazy good for a general industry. So it's only growing.\r\n\r\n\r\nChris Koerner (41:35.681)\r\nidea.\r\n\r\n\r\nNik (41:55.328)\r\nIt's going like crazy and you're dealing with this problem where you don't have the same social checks to get people comfortable with dating one another. So I started thinking, and these are like just ideas. What are some ways that you could actually facilitate this connection? So you could start a business around local sports leagues that are just for singles. I know that exists, but I'm just throwing it out there. You could start.\r\n\r\n\r\nChris Koerner (42:23.128)\r\nOkay, yeah.\r\n\r\n\r\nNik (42:25.416)\r\na local newsletter. You know the newsletter economics just for singles. You could also scrape the API's or integrate with the API's of Tinder, Bumble, Grindr. That was a joke. I had to do Tinder or Bumble and just build another site where you can link to somebody social proof, right? It's almost like, hey,\r\n\r\n\r\nChris Koerner (42:43.842)\r\nYou had to, you had to.\r\n\r\n\r\nNik (42:54.996)\r\nThese are my letters of recommendation that you can go and look at. These are my friends and these are links to their social profiles so you can see that they're actual real people. But if I were to do this and figure out a way, I don't have the answer, but there's a huge opportunity here. If I were to do it, would start local. would start with finding people. I would be local, find people in my local market and I would start building a network there and figure out what the best way to facilitate that social proof is and then try to roll it out.\r\n\r\n\r\nChris Koerner (42:56.939)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (43:11.65)\r\nLocal?\r\n\r\n\r\nNik (43:24.602)\r\nthe same things that I would do in growing a local newsletter, but I would just grow it locally for local singles. Then I would either do a sports league or I tend to go sports league because I think being active and physical is a really good way to have interaction. there could be other, like you could have an improv league, you could have cooking classes, there's a whole other things, but it's just geared towards singles. What do you think?\r\n\r\n\r\nChris Koerner (43:43.554)\r\nSo is your attempt to pull people off the apps into more in-person stuff?\r\n\r\n\r\nNik (43:49.936)\r\nMy attempt is to use the apps to funnel them to in-person things. So it's like, cool, go on the apps, find who you like, but maybe you don't wanna go on a date with that person, or maybe you don't wanna be one-on-one with them. We're Mormon, we grew up, when you turned 16, you weren't supposed to just date one-on-one, you dated in groups. So it's like facilitate a group environment for people that maybe are uncomfortable with just going the one-on-one route and have that facilitate relationships.\r\n\r\n\r\nChris Koerner (43:55.212)\r\nMmm. Mmm.\r\n\r\n\r\nChris Koerner (44:16.418)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (44:19.882)\r\nbe dating app for introverts too. I don't know.\r\n\r\n\r\nNik (44:22.654)\r\nYou don't care, you? You really don't care.\r\n\r\n\r\nChris Koerner (44:25.366)\r\nNo, just trying to think. I don't know enough about like, I've never owned a dating app, right ever. And so I'm very, I'm right, right. Here's some thoughts that come to mind. First of all, an interesting growth hack that I saw was this guy owned a bar or restaurant or a nightclub. And he created a fake profile of a very pretty girl and set up dates for like dozens or hundreds of men to meet at that.\r\n\r\n\r\nNik (44:30.752)\r\nI've never been on a dating app.\r\n\r\n\r\nNik (44:38.346)\r\nthe\r\n\r\n\r\nNik (44:43.221)\r\nThank you.\r\n\r\n\r\nChris Koerner (44:54.582)\r\nbar or restaurant. And it worked. Like it just drove a ton of customers and they all got ghosted but then they were there. So it's pretty smart, right? It's it's a thing. So I think that any business built on the theory that people are coming offline more is a good business. I love that thesis and I agree with it. Like the mechanics of it, I can't wrap my mind around like\r\n\r\n\r\nNik (44:55.968)\r\nOkay.\r\n\r\n\r\nNik (45:04.137)\r\nThat's a pretty good growth hack.\r\n\r\n\r\nNik (45:23.102)\r\nI don't know. Yeah, it was just an idea that I had this morning where it's like, there has to be a way to provide the same social proof and facilitate these social connections in the real world. But like, it's fine to meet people online. I think that's really good because you don't have this like awkward like getting to know someone and like, what do they really think and all that stuff. Like you can kind of just see it upfront.\r\n\r\n\r\nChris Koerner (45:44.78)\r\nWhat if, what if it was something like you, like, let's say Nick, you're the business owner. You're the aggregator of the people here and you go find like in Dallas, it would be like Clyde Warren park, which is like a nice park downtown. It's built over and overpass. it's kind of hipster. It's close to everything. You could organize meetups, for specifically targeted to people that are on dating apps, like active on dating apps and people could have their first date there.\r\n\r\n\r\nNik (46:10.368)\r\nMmm.\r\n\r\n\r\nChris Koerner (46:13.11)\r\nThat way, like everyone at the event, which is at a public place, you don't have to go rent something expensive. They're all like they're in the shared experience. They're all on this awkward first date together and they might end up meeting someone there that that is the ultimate fit for them, not the actual date.\r\n\r\n\r\nNik (46:23.306)\r\nDid it? Genius.\r\n\r\n\r\nNik (46:28.16)\r\nNow there may be somebody who's listening that is in this world and they're like, yeah, that already exists. And we just don't know because we're not single.\r\n\r\n\r\nChris Koerner (46:32.642)\r\nThat's a thing. It's called, it's called a party tech. This tweet will go viral. We're going to get canceled. It's like tech bros discover a party.\r\n\r\n\r\nNik (46:40.544)\r\nBut it's like when we went to SMB, SM bash or when we went to Main Street, it's all these people who like met on Twitter and now they're meeting in real life. And you there are functions that allow you to meet people in person. It's the same thing, right? Like everybody's on Tinder, so they may like recognize a profile picture. But then there are activities that are designed to get people to interact. So it's like not a party in the sense that\r\n\r\n\r\nChris Koerner (46:56.364)\r\nMm-hmm.\r\n\r\n\r\nNik (47:08.158)\r\nit's a general free for all like, cool. The punches over there and music's playing and everyone just dances. It's like, okay, you come, maybe there's some speed dating and you just literally you like literally are doing speed dating. and maybe there's like sports. I really like improv cause I think it's fun to just see how people think. Like maybe there's an improv thing like, and you can choose the different activities that you do, but that, that would like facilitate and foster it. Yes.\r\n\r\n\r\nChris Koerner (47:12.674)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (47:16.066)\r\nI was just going to say that you took it right out of my mouth.\r\n\r\n\r\nChris Koerner (47:24.534)\r\nMmm.\r\n\r\n\r\nChris Koerner (47:31.606)\r\nAll right. We landed on something good here. Once again, Chris and Nick are super unique. This one's good. This is a good one. Yeah. This one. That, that, that app idea though, dude, no, it could be, it could like, let's say you take a restaurant and you reserve like the back room, right? For parties. It's like 30, 40, 50 people. And the only people that are invited or allowed to come.\r\n\r\n\r\nNik (47:38.164)\r\nThis one. But this idea though? This idea.\r\n\r\n\r\nChris Koerner (48:01.26)\r\nAnd you could charge a fee at the door are people that will be on their first date with someone that they met on an online dating app. It has to be a first date date and they, they never have to have met them before. And it must be from an online dating app. And then you get them there and then you game a fire. Right. Maybe you do improv. Maybe you do karaoke. Maybe you do speed dating. Maybe you do all three and you can even game a fire to where it's like, you go open minded.\r\n\r\n\r\nNik (48:09.258)\r\nHmm\r\n\r\n\r\nChris Koerner (48:28.904)\r\nAnd you might end up with the same person like you might get there. Maybe maybe you get there and intentionally you spend like 20 or 30 minutes with that person that you came with getting to know them for the first time. And it's like, all right, now we're doing speed dating and you have like two or three minutes with everyone there. And then at the end of it, it's like, all right, raise your hand if you want to stay with the same person or not for the rest of the night and you could switch right. Or you can even make it you can even make it blind, right? Make it blind or else human psychology will get into play. And it's like, all right, here's a piece of paper right here.\r\n\r\n\r\nNik (48:49.92)\r\nor\r\n\r\n\r\nChris Koerner (48:58.486)\r\nIf you want to stay with the same person or switch and then like someone gets on stage and it would be really awkward, but it's like, it is what it is.\r\n\r\n\r\nNik (49:07.04)\r\nOr you copy Nick Gray and you make it exclusive and you plan the experience. And anybody who comes that doesn't participate well, you kick them out. You're very exclusive. You're gated with who comes in. But before the event, you send out a list. Here's everybody who's attending. You can go look at their profiles here. It's very clear. You're going to this to try and find someone to date, but you're not necessarily assigned to anybody.\r\n\r\n\r\nupfront, but you can go and you look and you're like, Chris is going to be there. cool. He's an Alabama fan. all right. I went to Alabama. Nick's going to be there. Okay. I like that curly hair. That's true. So anyways, there's like, it's an epidemic in the South. Okay. But you would go and you'd have some information before you went and then that would make the party more.\r\n\r\n\r\nChris Koerner (49:42.296)\r\nIt could be my sister though. Could be my sister. You gotta watch out for that. It's not funny.\r\n\r\n\r\nChris Koerner (49:54.806)\r\nUh-uh.\r\n\r\n\r\nNik (50:02.696)\r\nenjoyable because you at least know who's there. You've seen their profiles. You maybe have a list of like, these are the five people I want to talk to. And essentially, you're just facilitating a meetup, but you're focusing on the niche of dating. And you could you could do this with any niche. You could facilitate meetups focusing on the niche of SMB, you could facilitate meetups focusing on the niche of disc golf players, like you know what mean? Like it could be any niche.\r\n\r\n\r\nChris Koerner (50:03.234)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (50:10.402)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (50:26.52)\r\nIt's funny because like, you don't have to pay for a venue, because they're buying their own food and drinks, right? So they reserve the room for you, because they know you're, you're going to be paying customers, you just charge like a door charge, the 2030 40 bucks at the door for this whole experience. And that's how you make money.\r\n\r\n\r\nNik (50:43.072)\r\nYeah, you don't have to control any. You don't have to the menu, the menu, the seating, none of it.\r\n\r\n\r\nChris Koerner (50:48.876)\r\nHave you seen Black Mirror? Have you ever seen that on Netflix? They have an episode that's like this, where it's like social proof. Everyone has like a social credit score. And so for, for instance, like, let's say you walk out of a store and you don't hold the door open for someone and the girl's like, rude, she'll pull out her phone and like scan your face and like leave you a bad review as a person. And then your reviews, it like tallies up to like a score and everyone is driven by like their score. Like what's your score? it just dropped. like,\r\n\r\n\r\nNik (50:59.114)\r\nMm-hmm.\r\n\r\n\r\nNik (51:16.394)\r\nCheers.\r\n\r\n\r\nChris Koerner (51:18.018)\r\nPeople are good scores all the time, but occasionally they'll get like a negative review that will drop their score that everyone can see and they like stress out over it. It kind of reminds me of that. it's like a crowd sourced, are you a good person? And it's like, there's a benefit to that and there's a downside.\r\n\r\n\r\nNik (51:31.914)\r\nYeah.\r\n\r\n\r\nWell, I just think in situations where there's really, that are really high risk is the wrong word, leverage maybe, dating high stakes, dating is one of them because you're trying to find your spouse, like your mate for the rest of your life. Starting a business could be one of them. You want to have some type of social proof. Like you're looking for that because you're making a decision with almost no information. You want to gather as much as you can. It's such an important decision.\r\n\r\n\r\nChris Koerner (51:44.418)\r\nHigh stakes.\r\n\r\n\r\nChris Koerner (52:01.858)\r\nYeah, I like it. That's a good one. I like ideas that like you don't have to build an app for right like you can use the apps to build something in person for low tech. We're not well when we're not what our wives would call like smart, you know.\r\n\r\n\r\nNik (52:04.128)\r\nThank you.\r\n\r\n\r\nNik (52:08.576)\r\nTotally. Totally.\r\n\r\n\r\nNik (52:16.296)\r\nNo, no, no, no, no, good looking, or attractive to them on most days, or a good father. Right? Yeah, or who I would have chosen had I had it to do all over again. Do you know what mean?\r\n\r\n\r\nChris Koerner (52:20.276)\r\nyeah.\r\n\r\n\r\nor decent providers.\r\n\r\n\r\nYeah, that's us.\r\n\r\n\r\nChris Koerner (52:33.466)\r\nor our first choice, you know, like.\r\n\r\n\r\nI mean, they call me fallback Chris for a reason, you know, plan B Chris. All right, I got one. I got one. So there's this guy on social media called the Dumpster Dive King. And he has over 10 million followers. And literally, all he does is dumpster dive. That's it. And he has a GoPro and he dives for dumpsters. And he finds things and sometimes people confront him. They're like, What are you doing here? This private property and he's like,\r\n\r\n\r\nNik (52:42.08)\r\nmy gosh.\r\n\r\n\r\nChris Koerner (53:05.004)\r\nNo, it's not because according to ordinance, blah, blah, blah of the city, I am allowed to be here. This is public. So that's like, that's good content. But the, the, the biggest reason why he's so viral is because of the payoff at the end of these videos. What's he gonna find? It's a treasure hunt. Right? This goes to like a previous episode talking about treasure hunts, like, it is human nature, it's first principles, we want to know what's at the end of the rainbow.\r\n\r\n\r\nNik (53:08.608)\r\nOf of course you would.\r\n\r\n\r\nNik (53:23.016)\r\nThanks\r\n\r\n\r\nChris Koerner (53:30.072)\r\nLike what's in the box? Like we want the payoff and the algorithms want the payoff because it means high retention. So I did a deep dive on the dumpster dive King and was enthralled by it because it's just a video with him voicing over it. Like he's not really talking while he's dumpster diving, right? He's like, I found these golf clubs. these are $400 golf clubs. So people love it. Cause they're like typing like that's not a $400 golf club. That's a $300 golf club.\r\n\r\n\r\nIt was discontinued and like everyone has an opinion on what he's finding. Everyone wants to get to the end to see what he finds. And so it's just, it's a brilliant business as far as social media is concerned, but then he took it a step further and he sells all the stuff he finds on his own website, lost goods.com. Okay. Which is a very, very ugly website, but a very smart thing to do. And I would bet that most of his sales come from eBay, Facebook marketplace, Etsy, the big marketplaces. And then this is just kind of like the\r\n\r\n\r\nNik (54:14.496)\r\nsmart.\r\n\r\n\r\nChris Koerner (54:26.68)\r\n5-10 % of his sales.\r\n\r\n\r\nNik (54:28.98)\r\nIt's a good it's a good name because it's lot. It's like lost goods and now they're stolen from the trash goods, but you've rebranded it to lost goods. You know what mean?\r\n\r\n\r\nChris Koerner (54:34.936)\r\nMm hmm. Mm hmm. It is good. But I like this idea, because it reminds me exactly of an idea I had three years ago. So three years ago, I was living in Houston for six months. And we lived in a neighborhood that had its own 18 hole disc golf course. And so I played disc golf with the kids and it was fine. But what we really loved was wading through the ponds and the ditches looking for lost\r\n\r\n\r\ndisc golf discs. And it's very simple. You take off your shoes and there was a creek that neighborhood is called Cross Creek Ranch. So there was a creek that went across the neighborhood. And you would just kind of waddle through this, you know, knee deep creek, and you would feel plastic in your toes. And you reach down, you pick it up, it's like, it's a disc. And some of these discs are quite valuable, they could be hundreds of dollars. Most of them are like 10 to $30. But it's still it's like, I just found 20 bucks. I just found 20 bucks.\r\n\r\n\r\nI just found three 20 bucks stacked on top of each other because this is like a honey hole where you know, the the wind always carries it to this spot. And it was so fun. Like male, female, old, young. It's your treasure hunting. And I never sold I never sold any of them. They're still in my garage. We've lost a bunch of them. A lot of times people will write their name and number on the back of the disk in Sharpie. And so that was fun too. Because then you get to play like hero and text them like I got your disk. Come get it.\r\n\r\n\r\nNik (55:45.706)\r\nTreasure.\r\n\r\n\r\nChris Koerner (56:01.88)\r\nAnd it's just, it was very fun. So the idea, I think you could monetize this. I think you can monetize anything. Okay. They have these devices that will beep if it sees plastic or if it senses plastic of some sort in a certain vicinity. And so I think you could build a tool where you could easily find these disks and like literally monetize it by just finding and selling these disks.\r\n\r\n\r\nAnd then you could monetize it by selling that tool and then you can monetizing it. You could monetize it by filming everything. And it's the same principle as the dumpster dive King. People want to know what are you reaching in the murky water for what's coming out? There are guys doing this with golf balls. Like there are people that have built a decently sized business on social media, posting content about finding golf balls and then selling the golf balls on their website because people want to support them. What do think?\r\n\r\n\r\nNik (56:55.466)\r\nSo you're starting a social media channel, but you've thought about the ways you would monetize it. It's not just through views, you'd also have a store that you resell the stuff.\r\n\r\n\r\nChris Koerner (57:03.894)\r\nYeah, you can monetize it by, but it's not done. So I went and bought a domain name when I had this idea, which isn't saying much because I buy all the domain names. In fact, at one point I owned 70 % of the domain names in the world. Fun fact.\r\n\r\n\r\nNik (57:17.17)\r\nHold on a second. Hey, Siri, remind me to buy all the domain names.com.\r\n\r\n\r\nOkay, I had a...\r\n\r\n\r\nChris Koerner (57:23.384)\r\nAnyway, domain name I owned was water finds.com, which is so similar to lost goods.com. Okay, two words, like, and the idea was to do this, and then to sell everything I found on this website. And is this going to be a $10 million business? No. Could it be a seven figure business? Yeah, I genuinely believe it could be even without social media.\r\n\r\n\r\nBut I think someone should do this. went and I let the domain name expire and now it's like a premium domain name for 10 grand. Someone like it's not worth 10 grand. It's not so like. But like yeah, if I wanted to buy it back, it'd be it'd be 10 grand water fine stock.\r\n\r\n\r\nNik (58:00.412)\r\nNo, I know, know.\r\n\r\n\r\nNik (58:05.566)\r\nI love that idea. Fun. Get you out, doing stuff with your kids. That's awesome.\r\n\r\n\r\nChris Koerner (58:11.36)\r\nAbsolutely. Someone needs to do it.\r\n\r\n\r\nNik (58:14.026)\r\nOkay, mark this right now. We have 10 minutes left. I wanna try something new.\r\n\r\n\r\nChris Koerner (58:18.178)\r\nMm-hmm.\r\n\r\n\r\nNik (58:22.24)\r\nI wanna, let's recap the ideas that we talked about, because you're gonna spice this into two episodes. Let's recap the ideas we talked about and then have a segment that's like, have you ever seen the like start one, bench one, cut one?\r\n\r\n\r\nChris Koerner (58:35.554)\r\nMm-hmm.\r\n\r\n\r\nNik (58:37.088)\r\nsimilar idea or it could be like, all right, gun to your head. You're picking one of these businesses to do. Which one are you doing?\r\n\r\n\r\nChris Koerner (58:43.191)\r\nI like it.\r\n\r\n\r\nNik (58:44.01)\r\nSo like we ask each other that question. let's just recap really quickly what all the businesses that we talked about.\r\n\r\n\r\nChris Koerner (58:47.286)\r\nYep. And then we'll do it like twice one for each episode. Yeah.\r\n\r\n\r\nNik (58:51.274)\r\nExactly.\r\n\r\n\r\nChris Koerner (58:53.749)\r\nOkay, so the perfing vending wasn't really an idea, right? That's what we led with.\r\n\r\n\r\nChris Koerner (59:06.552)\r\nAnd then.\r\n\r\n\r\nNik (59:07.658)\r\nSo I did Cost Plus as a service essentially, or like pharmacy negotiations.\r\n\r\n\r\nChris Koerner (59:12.386)\r\nMm-hmm.\r\n\r\n\r\nNik (59:16.434)\r\nand I did a dating, like facilitating local dating.\r\n\r\n\r\nChris Koerner (59:21.88)\r\nMm hmm. And then I did the pros closet that was before your cost plus right.\r\n\r\n\r\nNik (59:29.482)\r\nThat's what we did first.\r\n\r\n\r\nChris Koerner (59:29.954)\r\nPerfume vending, perfume vending, pros closet, pharmacy negotiations.\r\n\r\n\r\nChris Koerner (59:38.488)\r\nI literally just delete, GPT for sheets, was that next?\r\n\r\n\r\nAnd then dating idea and then water finds.\r\n\r\n\r\nNik (59:46.586)\r\nand then water finds.\r\n\r\n\r\nChris Koerner (59:49.655)\r\nWas that all of them?\r\n\r\n\r\nNik (59:51.242)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (59:52.6)\r\nSo three per episode. Because we ended the first at like 37 minutes.\r\n\r\n\r\nSo this episode's gonna be pretty short.\r\n\r\n\r\nNik (01:00:03.776)\r\nI mean, we could also cut these segments up. I mean, it's kind of hard to do that.\r\n\r\n\r\nwhen we squirrel so much.\r\n\r\n\r\nChris Koerner (01:00:12.802)\r\nWe could still do perfume vending as like an idea, just the concept of creating social media content around an asset and selling it.\r\n\r\n\r\nNik (01:00:21.792)\r\nYeah. Okay. So do you want to do the first three pharmacy negotiations pro closet proof inventing and then the set the second set GPT for sheets facilitating local? Yeah, I like that.\r\n\r\n\r\nChris Koerner (01:00:31.948)\r\nShould we do, what should we call it, if you do a married date or kill?\r\n\r\n\r\nNik (01:00:38.154)\r\nSure, because it's usually Mary Africa, right?\r\n\r\n\r\nChris Koerner (01:00:42.858)\r\nYeah, but like Avery does it at school and they call it marry date or kill. So I think it's a thing. All right. So this, all right. So before we wrap up this episode, we want to do something new. We want to call it marry date or kill on these three ideas. Okay. So to recap the three ideas, perfume vending machines. And what we're saying here is the general idea of using social media to generate attention.\r\n\r\n\r\nNik (01:00:43.902)\r\nor F. Mary pill.\r\n\r\n\r\nNik (01:00:49.376)\r\nOkay, all right.\r\n\r\n\r\nChris Koerner (01:01:11.98)\r\nfor a high value asset and then reselling it. An asset that someone else manufactures. That's the idea in general. The second idea is that of repurposing someone else's newsletter. Maybe it's an e-commerce newsletter, maybe it's a manufacturing company, anything to make like an ad driven newsletter out of it to monetize to the tune of hopefully 50 cents per subscriber per month. It could be your newsletter, it could be someone else's piggyback. And the third idea,\r\n\r\n\r\nNik (01:01:17.044)\r\nYep. Yep.\r\n\r\n\r\nChris Koerner (01:01:41.854)\r\nis pharmacy negotiations as a service and or cost savings as a service benefits negotiations as a service and you monetize by taking a percentage of money saved, correct? All right, married date or kill. How do we do this? Do we want to each like say what we think at the same time? So it's not biased or?\r\n\r\n\r\nNik (01:01:53.28)\r\nCorrect. Yeah.\r\n\r\n\r\nNik (01:02:04.96)\r\nI think we just go, would marry, I would date, I would kill. And then you say, I would marry, would date. And then we talk like, really, you would? Okay.\r\n\r\n\r\nChris Koerner (01:02:10.552)\r\nOkay, why don't, okay, why don't.\r\n\r\n\r\nYeah, why don't you go first then?\r\n\r\n\r\nNik (01:02:18.91)\r\nOkay, so I would marry, let me look at these real quick.\r\n\r\n\r\nI know it was my idea and I'm being selfish. I would marry the pharmacy negotiations or just negotiation of the service. would.\r\n\r\n\r\nChris Koerner (01:02:36.15)\r\nWhy?\r\n\r\n\r\nNik (01:02:38.068)\r\nI'll tell you, hold on, just let me say the three real quick. So I would marry pharmacy negotiations as a service. I would date Pro's Closet and I would kill perfume vending.\r\n\r\n\r\nChris Koerner (01:02:39.244)\r\nOkay, yes sir, yes sir.\r\n\r\n\r\nNik (01:02:55.082)\r\nYour turn.\r\n\r\n\r\nChris Koerner (01:02:56.298)\r\nokay. You're going to say why after I say that? All right. So I would marry.\r\n\r\n\r\nChris Koerner (01:03:05.848)\r\nclothes closet I would date\r\n\r\n\r\npharmacy negotiations and I would kill perfume vending.\r\n\r\n\r\nNik (01:03:14.464)\r\nBoth would kill prof-\r\n\r\n\r\nChris Koerner (01:03:17.697)\r\nit's reliant on going viral and that's that's really hard hard to do. Yep.\r\n\r\n\r\nNik (01:03:19.936)\r\n100%. That was the same reason I had. Yeah. It doesn't work unless you have some way or some putty who can make something go viral. Totally agree. Why would you marry Pro's Closet over the pharmacy negotiations?\r\n\r\n\r\nChris Koerner (01:03:33.612)\r\nBecause to me, it seems a lot more approachable. I can wrap my mind around it. It falls in line more with my background.\r\n\r\n\r\nNik (01:03:40.992)\r\nThat is so funny, because that's the exact reason why I picked the pharmacy negotiations, because I was like, I just know that so much better than going and repurposing somebody's newsletter. Yeah. Genius. All right. I love it.\r\n\r\n\r\nChris Koerner (01:03:49.664)\r\nYeah. Makes sense.\r\n\r\n\r\nChris Koerner (01:03:54.925)\r\nall right, let's do it again. Why don't, why don't you? Yeah.\r\n\r\n\r\nNik (01:03:56.49)\r\nOkay, so I'll do the recap this time.\r\n\r\n\r\nAll right, so let's recap these ideas and then marry, date or kill them. So we have first GPT for Sheets, which is a tool that allows you to use AI in either cleaning your data or just helping you build out your spreadsheets. There is facilitating local dating events or just any niche group facilitating those types of events. And then there is Water Finds where you are starting a channel and\r\n\r\n\r\nposting that content and then either reselling the stuff online or monetizing from the channel that you can launch. All right, Chris, marry date or end kill, which one's.\r\n\r\n\r\nChris Koerner (01:04:42.887)\r\nHmm. All right. I would. Now, how are we monetizing GPT for Sheets?\r\n\r\n\r\nNik (01:04:49.76)\r\nI don't think we explicitly said how we're monetizing GPT for sheets. I think there's a lot of different applications that you can have for it, but it's just like implementing it in your business.\r\n\r\n\r\nChris Koerner (01:04:57.592)\r\nI mean, we could theoretically just charge a fee to clean someone's data with it, right? We start for free, say, hey, hey, I'm launching this business. I'm really good at cleaning data. I use AI, right? We could just go ahead and say that. Can I do it for free? Yeah, yeah, yeah. Is it helpful? All right, what would you pay for this, right? And then you kind of start pricing your way into it. Go the old shout out to Brandon Doyle method and charge basically nothing to start and just keep raising your prices until you start to get pushed back.\r\n\r\n\r\nNik (01:05:24.0)\r\nBrennan Doyle PT? All right.\r\n\r\n\r\nChris Koerner (01:05:26.104)\r\nThat's right. Branded, Branded oil rules. all right. All right.\r\n\r\n\r\nNik (01:05:32.512)\r\nOkay, merry date, Kyle.\r\n\r\n\r\nChris Koerner (01:05:38.39)\r\nI'm gonna this is tough. It's like dependent on like the time of life that you're in. I know. Yeah, marry GPT for sheets. Date water finds kill dating idea.\r\n\r\n\r\nNik (01:05:44.724)\r\nNo, no, stop qualifying, just say it.\r\n\r\n\r\nNik (01:05:53.214)\r\nOkay, marry GPT for Sheets, date, facilitating local events, and kill water finds.\r\n\r\n\r\nChris Koerner (01:06:02.392)\r\nThat makes sense. would have guessed that for you as well.\r\n\r\n\r\nNik (01:06:04.532)\r\nOkay, so we both said to marry GPT for sheets. I think that to me that's like there are so many applications that you could start a ton of businesses or you could just make your own business more efficient. Like there's a ton of reasons. Why did you want to date the water finds?\r\n\r\n\r\nChris Koerner (01:06:18.296)\r\nbecause it's really, really fun and I would love it. It would be a grind to get to a meaningful amount of money, but it would just be so fun. And I like, I'm an introvert, like organizing events, like that gives me anxiety. So it's not really a knock on the business model or idea. It's, it's me. It's not me. It's you.\r\n\r\n\r\nNik (01:06:27.732)\r\nthat.\r\n\r\n\r\nNik (01:06:34.56)\r\nThat makes sense.\r\n\r\n\r\nNik (01:06:38.272)\r\nI didn't like the water fines because I think it'd be a grind. It would take so long to get it monetized. Like if I have something else that I'm doing that's making me money and I want to have a side hustle or whatever, I think it's a cool channel to do. And I think it's fun thing to do with your kids. But I think for anybody listening who wants to just like start it as a business, I think it would be really, really hard. So for me, that's why I killed it. I didn't put the dating as number one because I think it's much harder to spin up than utilizing the GPT for sheets.\r\n\r\n\r\nI think utilizing G54 Sheets you can do really quickly the dating or facilitating niche groups I think is really, really difficult to get spun up.\r\n\r\n\r\nChris Koerner (01:07:16.12)\r\nAlso, the dating thing, as far as we know, this could exist. We could sound like idiots right now to half the population. As far as we know, it isn't really a thing. And that just makes me nervous, right? I don't want to invent something new.\r\n\r\n\r\nNik (01:07:24.288)\r\nYeah, yeah. So let us know what you guys think. Merry date or kill.\r\n\r\n\r\nChris Koerner (01:07:30.68)\r\nAll right, that's a wrap. All right, I gotta go.\r\n\r\n\r\nNik (01:07:32.136)\r\nAll Hey, this is a good one. Love you.",
  "metadata": {
    "duration": "",
    "date": "2024-11-01",
    "platform_source": "Google Drive"
  }
}