{
  "episode_number": "110",
  "episode_title": "The Truth About Overseas Hiring with Connor Gross",
  "guest_name": "Connor Gross",
  "business_name": "Constant Hire",
  "transcript": "﻿Nikolas Hulewsky (00:00.49)\r\nAll right, let me just make sure this is looking good.\r\n\r\n\r\nAll right, Connor, tell me tell me about your business. What is your business name and how do you make money?\r\n\r\n\r\nConnor (00:13.542)\r\nYeah, we launched Constant Hire earlier this year. It's pretty simple. We're recruiting business meant to get you the top talent in the U.S. across sales and marketing roles.\r\n\r\n\r\nNikolas Hulewsky (00:23.598)\r\nWhen you say in the US, is that the talent is in the US or companies in the US?\r\n\r\n\r\nConnor (00:27.548)\r\nBoth. The talent is in the US. Everyone that I've seen on social media is launching their favorite overseas business, hiring from Sri Lanka, Latam, Philippines, wherever. And that's awesome. We hire overseas people as well for a couple of our different companies. But lately I've been taking more of a strategy of I think when everyone's going overseas, I want to find who is the best, are the killers in the US. I think people are getting a little romanticized around the idea that somebody in Honduras is going to be able to do the same job.\r\n\r\n\r\nas a killer in New York City, LA, Dallas, wherever else. And the reality is, I think that you're always going to need the really ambitious, high level US cultural talent. So I wanted to build a company that was gonna help companies find that talent.\r\n\r\n\r\nNikolas Hulewsky (01:11.47)\r\nSo are you placing these individuals in the United States and are they remote or are they on site?\r\n\r\n\r\nConnor (01:17.67)\r\nCombination of both. So we've hired, you know, onsite COOs for manufacturing companies in Miami. We've hired onsite creative strategists for DTC business over in San Diego, but we also hire remote sales reps in Canada. You know, I said US earlier, we also do Canada and sometimes the UK, but we'll do a combination of everything. My overall goal is how can we get people really high level talent?\r\n\r\n\r\nNikolas Hulewsky (01:42.414)\r\nOkay, so I know you just launched this business, so it's new. You're on pace to do like 200 grand this year, 200, 300 grand. Tell me, just give people a quick background. You have other businesses as well, right? Like this isn't the first business that you started. So just give a broad overview of like size and scope of the businesses that you own and operate.\r\n\r\n\r\nConnor (02:02.706)\r\nTotally, yeah. So this is one of my latest obsessions and I tend to find that like I love going from that zero to 1 million scale and then asking my business partners and we'll say that I get very bored after the 1 million part because a lot of getting there is just inventing new stuff and after 1 million it tends to be like just hammering and doing all the scalable things and the boring management stuff which I start to hate really fast. But all of the other companies, 30 second background on me.\r\n\r\n\r\nlaunched an Amazon FBA brand when I was 19, scaled it up to a couple million in sales, sold that when I was in college. And after we sold that, I got really bored, COVID hit, and I was sitting in my apartment thinking, what do I do? Started two different companies from there. One was me taking all the money that I made from the Amazon FBA business and buying the self storage facilities throughout Texas, Arkansas, and soon to be New York. And we've been doing that for about three years now, learned the ins and outs of real estate, learned\r\n\r\n\r\nyou know, how to take a building that's worth 500,000 and make it worth 1.5 million. And we've done that a couple of times. The second business that we launched was a Shopify business. I love e-commerce. think it's a hard business, but one of my most fun businesses to run because you can flex the analytical and creative chops. so launched that business. We actually launched the first version of that business in 2020 got some product market success, but it wasn't entirely where we wanted it to get.\r\n\r\n\r\npivoted the business idea a little bit towards the end of 2020, early 2021, and it took off from there and I've scaled that up. The e-commerce business will do around 7 million per year at this point, and the real estate business does about $42,000, $43,000 per month, but we are leasing up two buildings. So I think with our current size and scale, we should give that closer to like 50 to 55,000.\r\n\r\n\r\nNikolas Hulewsky (03:52.664)\r\nSo the e-commerce business, 7 million top line. Can you give me an idea of like what's bottom line performance? Okay. Okay. That's awesome, dude. All right. So you've, you've got some real chops and I, gosh, who does that sound like to me? Someone who loves the zero to 1 million phase and then just loves to hand it off. I don't know where I've heard that before. yeah. That's Chris, my business partner. So, so you're, accomplished. You operate well. You're smart. You have a marketing mind.\r\n\r\n\r\nConnor (03:56.732)\r\nYep, one million.\r\n\r\n\r\nConnor (04:14.642)\r\nIt's way more fun that way.\r\n\r\n\r\nNikolas Hulewsky (04:21.248)\r\nWhy are you getting into the recruiting space?\r\n\r\n\r\nConnor (04:23.772)\r\nSo I tried to spend some time earlier this year figuring out what do I want to do next? Like with the e-commerce business, we got it to a point where that was taking up a good deal of my time previously. And I wanted to figure out, how do I get out of this? So we hired a director of marketing. We hired a head of CS. We hired overseas agents to do all of the ops works. like we eventually hired a CEO for that business. And I got to the point where I was like, all right, I'm...\r\n\r\n\r\nI'm not really doing a whole hell of a lot of this point. Like what's the second business to start. And what I was telling you before we pressed record here is like, I actually don't, this is going to sound bad, especially if you're a customer, but like, I don't care about any of the companies that I run. And what I mean by that is like, I'm not passionate about self storage. I'm not passionate about the niche that we sell in the e-commerce space. I'm not passionate necessarily about recruiting. The thing that I am very passionate about is building companies that can scale, make money and finding ways to solve problems in ways that other people cannot.\r\n\r\n\r\nThat gets me excited. That gets me fired up. And I love doing that consistently. so the actual first idea that we wanted to start after we placed the CEO in our e-commerce business was saying, Hey, there are, you know, you always hear the silver tsunami, baby boomers, retiring narrative. And the crazy stat that I read somewhere is that there are 12 million baby boomers retiring, but like only 1.4 million of them are going to sell their companies. You know, some of them just shut it down because they don't know how to sell it.\r\n\r\n\r\nothers are have in sellable or unsellable assets. And so like, is there an opportunity to approach these guys and say, Hey, listen, your roofing company is awesome. You make $800,000 a year, your kids don't want it. You know, you're probably just gonna wind it down because somebody told you that you probably can't sell it because there's too much key man risk. Can I go up to these companies? And can I say, Hey, for the next 18 months, I'm going to teach you how to replace yourself by hiring a CEO.\r\n\r\n\r\ndo your job, you're going to pay them a lot, you're going to pay them $250,000 a year, but we're going to find you a killer. We're going to give you the systems and operating procedures to phase yourself out of the business and make this a sell worthy asset where you can, you know, keep the cashflow for a little bit and then make the $2 million and retire. that was the first idea. And I love that idea. I thought it was like a huge market trending opportunity, something that probably sounds fun. talk to a lot of people about it seemed exhausting.\r\n\r\n\r\nNikolas Hulewsky (06:35.278)\r\nOkay, that's a idea.\r\n\r\n\r\nConnor (06:45.402)\r\nseemed like I was going to have to learn so many new different businesses all the time. like entertainment wise, that's fun. But like as far as building the systems to create a scalable company, I think that sounds so hard. So so we scratched that idea and like the CEO placement, like there were companies that do that. They typically niche down into like very specific like tech e-commerce, you know, agency types of sectors. And that exists. But like, I wanted to build CEO to owner.com.\r\n\r\n\r\nNikolas Hulewsky (06:59.523)\r\nYeah.\r\n\r\n\r\nConnor (07:14.168)\r\nand build out a whole playbooking system.\r\n\r\n\r\nNikolas Hulewsky (07:16.59)\r\nThe problem with that is for the traditional staffing companies, if I'm a company looking for a position, I'm going and I'm like, I need this position. They know that they need that position. You don't have to convince them they need that position. When you're cold contacting owners who are like, I'm just going to shut this business down. You have to convince them that finding a CEO to replace them is the best way to go. So you've got a huge education problem with your target demographic, with your target customer.\r\n\r\n\r\nConnor (07:42.78)\r\nthere's an education problem. And then the other side of it too is like, I was, was riffing on this idea with some guy that I met on X the other day. He does a lot of like exit planning for founders and it helps them there. And I was like, man, how cool would it be to start like the YC for exits, right? Like, you know, you have this whole program where you're helping people start companies. You're giving them mentors, resources, funding, whatever. Like what if that existed for exits and it was better than just a business brokerage. And he was like, I thought of this idea. I agree entirely.\r\n\r\n\r\nThe problem is that by the time that you're truly ready to like sell your business, not when you first think about it, but the time that you're actually ready, you're tired, man. Like, you know, you're beat up. You're like coming out of the trenches and you're like, just either shut this thing down or give me 20 grand cash and I'll just call it a day. so I think that's the other problem with it. And there's an education thing. There's a motivation thing. There's, you know, a systems to scale thing. So there's a lot of pieces there and maybe there's a world where it makes sense in the future, but\r\n\r\n\r\nThat wasn't going to be it today. And so, so we took that and we're like, all right, well, I still like the idea of hiring. We got really good at hiring our team. Maybe I can hire for other people's teams. So let's launch d2chire.com. the seven letter domain name. Actually kind of clutch $9 for the seven letter domain name. So I was pretty happy about that. But, then we ran into problem number two. Problem number two was that e-commerce companies don't need to hire a lot. You know, that's\r\n\r\n\r\nNikolas Hulewsky (08:55.374)\r\nReally?\r\n\r\n\r\nConnor (09:10.258)\r\nkind of the beauty of the model is that you can use a lot of overseas hires, contractors, agencies, and you can build a hundred million dollar brand realistically with 20 employees. And so we're like, all right, maybe there's a big enough market here, but I don't love the fact that I can't get one client and hire 20 roles for them. Like I need those economics. And so then we rebranded to constant hire. We do the same thing. We just position ourselves differently. Like I still think that we are the best at hiring sales, marketing, e-commerce, digital marketing style talent.\r\n\r\n\r\nThe only difference now is that we try to target a little bit more of like growing companies that need more headcount.\r\n\r\n\r\nNikolas Hulewsky (09:46.382)\r\nPretty cool story because I think that's the exact way that many entrepreneurs who are starting businesses, not necessarily buying them, but that's the progression. Are you freaking just downing a San Pellegrino bottle? You're just drinking it straight from the bottle. my gosh.\r\n\r\n\r\nConnor (09:58.642)\r\nOf course, yeah.\r\n\r\n\r\nWell, I tried to get the Mountain Valley from the bodega, but they only had... What's that?\r\n\r\n\r\nNikolas Hulewsky (10:03.818)\r\nHe's got like a two liter, for those who can't see, he's got a two liter San Pellegrino and he's just freaking hitting it like it's a champagne bottle. This is amazing.\r\n\r\n\r\nConnor (10:12.324)\r\nIt's what do pour these things out before you drink from them?\r\n\r\n\r\nNikolas Hulewsky (10:16.353)\r\nYeah, typically.\r\n\r\n\r\nConnor (10:18.246)\r\nI've never done that.\r\n\r\n\r\nNikolas Hulewsky (10:19.564)\r\nWell, you probably live by yourself.\r\n\r\n\r\nConnor (10:22.086)\r\nI've got a girlfriend and no critiques yet, but also I don't know if she sees the deed being done.\r\n\r\n\r\nNikolas Hulewsky (10:29.134)\r\nYeah, yeah, you're a psychopath.\r\n\r\n\r\nConnor (10:31.174)\r\nHehehehehe\r\n\r\n\r\nNikolas Hulewsky (10:34.392)\r\nThat is freaking hilarious. Anyways, it's the iteration process, right? You're like, you start with one idea and then by the time you get to the idea that's actually making money, just, it's very different than the original idea. Staffing is like pretty hot right now. If you go onto a lot of social media platforms, Nick Huber bought his company, Support Shepherd, and turned it into somewhere.com. And then you've got lots of people who are starting their own staffing agencies, but they're focused on overseas talent.\r\n\r\n\r\nand placing them locally in these admin roles. You're not though, it sounds like you're focusing on state side talent and focusing them and placing them in roles. In my mind, those economics are very different, right? Like if I'm a business owner, SMB, I'm much more interested in the cheaper solution to my problems. So is your target, is your ICP different than most of these overseas talent staffing companies?\r\n\r\n\r\nConnor (11:33.478)\r\nYep. So great question. had, I think we had like eight or nine sales calls this week just cause had some, had some content go out and they got good traction. And every time that somebody jumped on a call with me, that was under 10 employees. Like I start the call and say, Hey, I want to be really clear here. We might not be a good fit to work with you because what I've learned about hiring is that it's largely a strategy question. Okay. Should we invest in higher sales rep? Should we hire?\r\n\r\n\r\nyou know, a quality engineer, should that be a role that somebody in this other position that is a project manager actually does like, unfortunately, the people that have less than 10 employees, probably just don't actually know what their business needs. And so when you're hiring, it's actually really easy to say, let me hire somebody that I can pay $1,500 a month to, because there's no skin off my back. And like, I can kind of be a shitty manager when they're overseas, and they're not going to really notice that much. I can kind of just like, tell them like, that mean, it's, it's the truth, though. Like, I mean,\r\n\r\n\r\nI have plenty of overseas, hires as well. Like I'm not even knocking it. Like I think that the barbell approach of hire the killer in the U S and then support them as with as much low cost talent as possible overseas is a really winning playbook. but the truth is, that like when you're hiring a lot overseas, you're not getting strategy out of that. You're probably also not even getting people that are willing to like work through the 50, 60 hours a week. And we have really talented overseas people. I've hired people from nearly every.\r\n\r\n\r\nOverseas staffing agency that you can think of. And I would probably, don't know, 20, 30, something like that overseas hires at this point. And like certainly more than that over my lifetime, I can confidently say three has been like good. Like, like, not even like good because there are people that do their job, but where I'm just like, damn, like there's, there's alpha here that I'm getting more output than what I'm paying. Whereas everyone else, you know, you pay them $1,500 a month. You get $1,500.\r\n\r\n\r\nNikolas Hulewsky (13:15.982)\r\nWow.\r\n\r\n\r\nConnor (13:29.618)\r\nmonth worth of work done. Like I'm not criticizing. It's just, just the truth. Whereas like the other roles, like there's one ops person, there's one designer and there's one CS person that I can think of off the top of my head, who do more than the work that I'm paying them for. Whereas what I found in the U S is that there's certainly a level of entitlement on the middle market levels of people. Like if you're making anywhere from like 65 to $90,000 a year, like I would be terrified to be an employee in that salary range, honestly.\r\n\r\n\r\nI think that you you're probably better off finding a good amount of people overseas in that range, depending on what the role is. But like, overpaying 20 to 50 % of market comp can legitimately get you somebody who adds millions of dollars to your top line. And I've seen it several times.\r\n\r\n\r\nNikolas Hulewsky (14:15.182)\r\nSo here's my question. I understand the difference in the business model of these overseas staffing recruiting companies. It's cheaper, right? And they're doing a lot of administrative functions. So it makes sense to me. It sounds like you're just doing a traditional staffing company. Am I missing something?\r\n\r\n\r\nConnor (14:34.578)\r\nSo the first thing you're missing is, and I had to learn this when starting this business too, because someone was like, are you recruiting or staffing? And I was like, hold on one second, my internet's super laggy and I'm Googling it. was like, what the hell is the difference? Yeah, so we do recruiting. So you don't pay me on a recurring basis. You manage all of the HR and admin stuff. My take on it is that for the average bootstrap founder, hiring a recruiter based on the economics\r\n\r\n\r\nNikolas Hulewsky (14:41.582)\r\nBrooks reading. All right, yeah.\r\n\r\n\r\nConnor (15:04.548)\r\nof how a recruiter charges today is impossible. And frankly, what I've learned being in this business is that people hate recruiters. They hate them so much. employees, know, business owners. Yeah. So if I turn to you and I say, Hey, I can find you a great, like you run a digital marketing agency, you hire account managers who are $75,000 a year, you hire creative strategists, you hire director of marketing, whatever. And I say, Nick, you hire somebody for $85,000 a year.\r\n\r\n\r\nNikolas Hulewsky (15:14.786)\r\nPeople being who? Business owner?\r\n\r\n\r\nConnor (15:33.266)\r\nI'm not going to charge you anything. Let me go find you the best talent possible and only, and if you hire them for me, pay me $20,000. Like that's the typical recruiter pitch because they charge 25 % of first year salary. people hate that small businesses are not prepared to spend $20,000 on a fee. And honestly, most recruiters like just don't know shit about shit. Like they're, they're basically like a tone down from sales reps. And so like they,\r\n\r\n\r\nTypically, we'll just spray and pray and just get people in front of you, hoping that you just need a higher bad enough that you pay them the big fee and sign on my approach on it. And the way that we're trying to change the economics slightly and sorry, actually one more really important part on the traditional recruiting piece. The reason that they do such a high fee from my understanding and the people that I've spoken with is that when you're recruiting for several people and they are entirely contingency based, if you recruit for three people,\r\n\r\n\r\nYou probably only actually fill one of those roles, which means you did a ton of work for two clients and you didn't get paid anything for it. So you need to make up for it somewhere else. Right. now I think that that's bad for the client. think it's bad for the recruiter. I think it just doesn't make sense all around. Here's my updated approach on it. We are trying to get hyper niche on the roles that we serve and focus on. So if you turn to me and you say, can you hire me?\r\n\r\n\r\na director of operations. I'm going to say, no, I can't because it's going to take me way too long to relearn that role. And I'm going have to like learn your business. And I'm going have to like, learn what's important about this, whatever. Whereas roles that we've hired a lot of so far, copywriters, account managers for digital marketing agencies, sales reps for both software and account and digital marketing agencies, and creative strategists. These three roles are sorry, those four roles, I know extremely well, I have deep talent pools, I can now charge you substantially less.\r\n\r\n\r\nbecause I know that I already have really good people in those roles that are ready and actively looking for jobs today. And I know how to recruit for them. And I know what to say. And so as a result, now, instead of charging you $20,000, I charge you $6,000. And it's still as contingent based on me placing it. So like you pay me nothing upfront. I think it's that we do a 10 % non-refundable deposit. And then only if you hire that person, you pay me six grand. Everyone that I've spoken with that is a small business owner at this point, they are way more comfortable paying on that.\r\n\r\n\r\nConnor (17:53.762)\r\nstyle of compensation versus the, you know, pay basically a quarter's worth of a salary and just hope that they're good enough.\r\n\r\n\r\nNikolas Hulewsky (18:02.638)\r\nI mean, it sounds like you're just charging less.\r\n\r\n\r\nConnor (18:05.958)\r\nWe charge less and we and we and we do way more specific types of work. Yeah.\r\n\r\n\r\nNikolas Hulewsky (18:10.03)\r\nSo you niche down on the roles, but you're also charging far less than a typical recruiter would charge. Yeah, I I hate recruiters because usually they promise you the world, they send you a bunch of candidates, and then I don't have any more success with them adding value in my companies than if I had just hired somebody. Like, I fired them within three months and it's like, cool, now I freaking just paid 20 grand to place this person.\r\n\r\n\r\nConnor (18:33.778)\r\nAnd I think so the other thing to on the charging less part is if you think of the market as somebody the willingness to pay, right? So the people that typically use recruiters, private equity firms, VCs and very large companies that just have a ton of cashflow. Those are the people who typically use recruiters. Anyone who's running a smaller business and smaller being defined as like under 200 employees typically does not as much unless they are one of those first couple of categories because they don't want to pay the fee. Now, if the fee becomes less,\r\n\r\n\r\nand they're more willing to pay it, the market gets way bigger and the volume can go up, which means that we consistently scale on our cost to fulfill consistently drops. So yeah, so we charge less, but we can sell to more people.\r\n\r\n\r\nNikolas Hulewsky (19:14.798)\r\nHow do you, all right, so if I'm sitting at home and I'm like, all right, how would I start one of these? How do you acquire customers?\r\n\r\n\r\nConnor (19:22.095)\r\nYou turn to everyone and you say, I'll do your recruiting for free as long as you can do a case study and then like give me a shout out that I do a good job.\r\n\r\n\r\nNikolas Hulewsky (19:28.046)\r\nOkay, cool. That's good messaging, right? But like, who do I go to? Am I just going to my network on Twitter? Am I doing pay-per-click ads? Do I have a programmatic SEO optimized website that is directing people to my services? Like, how do I even just get in front of them to say, is my offering and this is what I'll do?\r\n\r\n\r\nConnor (19:36.198)\r\nMm.\r\n\r\n\r\nConnor (19:46.738)\r\nCool. Yeah. So, what I would do is start niche, figure out the one, one rule, not even four or five, six, whatever, like I, and make it very specific, kind of like newer role. What I've learned, from doing this is that the role that we're having the most success with right now by a long shot or creative strategists, because it's a newer role. It's a role that didn't really exist prior to three plus years ago. And when it\r\n\r\n\r\nNikolas Hulewsky (20:08.76)\r\nWhat's a creative strategist?\r\n\r\n\r\nConnor (20:11.63)\r\nAre you, do you do the e-commerce stuff with Chris? Are you in the e-commerce world?\r\n\r\n\r\nNikolas Hulewsky (20:15.416)\r\nYeah, mean, Chris has like 20 years worth of e-commerce experience and I have maybe five as an investor. You know what mean? So no, I'm not nearly as knowledgeable as he is.\r\n\r\n\r\nConnor (20:25.084)\r\nSo Creative Strategist is, they are the people who design or come up with the concepts for ads, specifically video ads. they'll, yeah, so if you've ever seen like, Dollar Shave Club's a bad example, but like go to any of your favorite like, you know, larger, faster growing DTC brands, and you've probably seen like, you follow, I'm sure, you're gonna, yeah, so like Dr. Squatch, you know, the soap company. So like, so they'll start with like, you know, a scroll stopper of like,\r\n\r\n\r\nNikolas Hulewsky (20:34.464)\r\nokay.\r\n\r\n\r\nNikolas Hulewsky (20:46.382)\r\nPillowCube is one of them. Yeah, yeah, yeah.\r\n\r\n\r\nConnor (20:54.642)\r\nus cutting soap up or like, you know, a soapy bathroom mirror. And then we'll say, like, do you suffer with the Andriy for like, you know, some kind of like, like call out there. And then they'll like turn it into, you know, a whole flow from there. So the creative strategist is somebody who creates the brief and the script. and then, you know, subs it out to the creators, make sure post-production seemed effectively whatever. but reason that we do a really good job there is cause that's a new or type of role. It's something that people have realized is more important in this business.\r\n\r\n\r\nNikolas Hulewsky (21:11.822)\r\nHmm.\r\n\r\n\r\nConnor (21:24.528)\r\nAnd so now they are recruiting for it and it's really hard to find good ones. and we've gotten very good at finding good ones. And so I would start with a hyper niche role and say, recruit for this role. Then tactically, I would go on LinkedIn. would buy a LinkedIn recruiter seat. You can start with LinkedIn recruiter light. It's $170 per month. And I would find everybody on LinkedIn who is recruiting for that role. And I would send them an email. was, and also I would, I would also make a job posting for that role and sort of recruiter search.\r\n\r\n\r\nAnd just start interviewing people say, Hey, I run this agency. I've had a ton of clients who are constantly doing it. If you want to lie, like I make up fake reviews in my e-commerce businesses. When I first started e-commerce businesses, like call it unethical. Sure. Like it all evens out of the end. and so if you, if you want to say like, Hey, we were approved for a ton, like let me just screen you and go into 40 hours a week of interviews. And like, these are 15 minute long interviews. You're taking notes. If you want to keep it cheap, do it in a spreadsheet and like tactically interview a hundred.\r\n\r\n\r\npotential creative strategist and rank them top to bottom. Simple enough. Now reach out to all of these companies that are ideally fast growing companies and don't just want a singular creative strategist, but multiple like ideally digital marketing agencies, whoever else and say, John, I have a killer creative strategist. know they're classic recruiter pitches. Let me give them to you for free and you charge 20%. I want to sort of really great relationship here. Like let me send you some people. If you hire them, pay me nothing. and you know, if you, you know, if you like them,\r\n\r\n\r\nMaybe we can do business together in the future. There's no catch not pulling your leg like just.\r\n\r\n\r\nNikolas Hulewsky (22:56.686)\r\nSo LinkedIn is kind of your platform that you would start with.\r\n\r\n\r\nConnor (22:59.794)\r\nlike, 100 % Yeah, there's there's a billion people on LinkedIn, but no exaggeration. think it's like 980 million or something.\r\n\r\n\r\nNikolas Hulewsky (23:05.9)\r\nWhat are the margins on a business like this? All right. So top line, get $6,000. What's your bottom line on a place?\r\n\r\n\r\nConnor (23:11.058)\r\nso it depends on how many people that your recruiter can handle at once. So like a typical, a typical, this is where it gets really beneficial to niche down and do a singular role. Let's say that I have one recruiter and I pay him $80,000 a year and I pay him $1,500. and not even let's say that's what we do. It's $80,000 a year, $1,500 commission replacement, which are $6,500 per junior role and $10,000 per senior role.\r\n\r\n\r\nAnd so for a junior role, like a creative strategist or an individual contributor role, we'll charge that $6,500. And if I have this one individual placing creative strategists across 10 clients, okay. So that's 65,000 typical placement time under 60 days. and so he's only recruiting and screening creative strategists, which means that he's able to sub overtop talent to several people. And then it's on them to make sure that they're making a competitive offer, right? Like I'm not going to say what's that.\r\n\r\n\r\nNikolas Hulewsky (24:04.952)\r\nSee me. You're being hyper efficient by having by niching down.\r\n\r\n\r\nConnor (24:09.81)\r\nYes, the economics fade away really fast when you do every role, because then somebody can do maximum five roles. And like they're spread them and they're probably not doing the best job.\r\n\r\n\r\nNikolas Hulewsky (24:19.224)\r\nHmm. Yeah, there's just cognitive switching costs between each one of them and you guys would, know, Hey, give me 30 seconds. I freaking got a pee. I've been drinking too much. Give me.\r\n\r\n\r\nConnor (24:24.838)\r\nYeah, you're good. You're good. You're good. Yeah.\r\n\r\n\r\nNikolas Hulewsky (25:51.223)\r\nI have recorded.\r\n\r\n\r\nI recorded a hundred of these and I have never had to go to the bathroom. first time, first time long time. That is so funny. I was like freaking about to pee my pants.\r\n\r\n\r\nConnor (25:59.026)\r\nFirst time.\r\n\r\n\r\nConnor (26:05.106)\r\nYou're good. I also, don't know if, I think you're camera is... Okay.\r\n\r\n\r\nNikolas Hulewsky (26:07.566)\r\nI know. Yeah, it's, it's, it's coming back. It should be coming back on. Here we go. All right. so\r\n\r\n\r\nlevel for agencies in this space. What is bottom line?\r\n\r\n\r\nConnor (26:22.642)\r\nI think it's 40%. 40%. So it depends. It changes as you scale. So margins drop the bigger you get people. it's kind of almost like a Valley. And if you're an agency owner and you're listening to this and you have a different experience, DM me because like I'm, this is something I'm actively figuring out. But from the brief conversations that I've had, my understanding is that under 2 million, it's about 40%.\r\n\r\n\r\nNikolas Hulewsky (26:24.302)\r\n40 % net margins.\r\n\r\n\r\nConnor (26:51.794)\r\nAnd it looks like it's about 40 % because you don't have to have the administrative bloat and the, you know, having extra people who are not revenue generating within your team. Then I think it drops anywhere down to like 25 to 20 % from like the three to 6 million range. And then afterwards, I think it goes back up to 30 % after 6 million, because you don't need the more overhead, the overhead can scale your team up enough. I would actually like, that's my understanding of it.\r\n\r\n\r\nif anyone's listening to this and they're like, fuck you, you know, excuse me. So I started cursing like if they're like, hey, no one's getting 40 % like we're getting 40 % but we're also a three man operation today. And so I'd be curious to hear what other people are seeing.\r\n\r\n\r\nNikolas Hulewsky (27:34.808)\r\nWould you buy a business or would you start one from scratch if you're getting into recruiting again?\r\n\r\n\r\nConnor (27:39.442)\r\nSo I've, I've only ever, I don't even want to call it a business. Like we've bought real estate in past. Obviously that's, that's easy. That's like, you know, or not. It's not easy, but like it's predictable. and there's relatively lower risk of like revenue going away overnight. I've only ever bought one other like business. And if you're listening to this, you don't see what I just did. Like it's air quotes because it was a $26,000 Shopify site. and I just had such a bad experience with it where like, it just like,\r\n\r\n\r\nThe guy started it, put it together in 45 days, like verified proof that he made 5,000 profit in the first month. And I was like, fuck it. Like I'll just buy this thing and put it on autopilot. And then revenue dropped every month, like lost, I don't know all in 10 grand. wasn't a bad deal, but like, I don't have a lot of experience buying them. so if it's me, I would just start it.\r\n\r\n\r\nNikolas Hulewsky (28:32.366)\r\nCause if I'm listening to this, right? And I'm like, I'm just doing the math in my head. Like, okay, probably a 60 day close cycle. think that's what you said in between when you're like posting and when you get paid by the client. All right. So that's already kind of a long window, but then you have to get up and running. Then you have to like understand what position you're hiring for. You got to post to LinkedIn and you are probably the one who's doing all of the work. So after that, you then have to go and get clients who are going to actually pay you. So I would guess from like,\r\n\r\n\r\nConnor (28:34.908)\r\nYeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (29:02.324)\r\nidea or like I'm doing this to getting that first check is six months.\r\n\r\n\r\nConnor (29:08.55)\r\nI was pretty close to what it was for us. but a part of it, a part of it too, came from like first quarter. I just did a bunch of free placements. I was also like the first quarter we were still kind of in the let's let's do be a CEO placement agency. and so then second quarter was like, and at first early second, I was like, let's do free placements. Let's get the case studies. Let's get people excited and make sure that we even want to do this in the first place. we got to that point. We're like, cool. We're getting good at this.\r\n\r\n\r\nQ3 was when like the bulk of the revenue started coming in and we were like, wow, I need to hire somebody to like help from the fulfillment side of all of this. and now we're at the point where like, great, we've got consistent clients. We're beaten down on that marketing drum. I've had the fulfillment starting to get pretty dialed in. So yeah, I mean, like I'm, I'm 10 months into this business and, now is when we're actually starting to see a decent amount of lift from a revenue standpoint, but like,\r\n\r\n\r\nThe other thing too is I think I came in so bright eyed and bushy tailed into this business, just thinking like, service businesses have great cashflow and like, let's go start a service business. And I realized I've just never started a service business before and I've nothing about it. And so like my e-commerce mind was like, you want to know what we need to do? We need to spend money on Google and Facebook ads. That's how you get customers. Cause that's how we get customers in the e-commerce business.\r\n\r\n\r\nAnd after wasting $15,000, I was like, okay, let's do anything, but spend money on Google and Facebook ads. Cause like, clearly that's not working for us. Like either our offers are on our landing pages wrong. Like something's not right here. and I've very quickly realized that this is such a word of mouth referral, do the work, down content, style business from a marketing channel that like, I would never go after the paid acquisition strategy again, at least for the foreseeable future.\r\n\r\n\r\nNikolas Hulewsky (30:55.662)\r\nSo if you were giving advice to somebody who was thinking about starting a business like this, what would you say would be the perfect background or the ideal background of somebody to get into this business?\r\n\r\n\r\nConnor (31:06.226)\r\nfor recruiting in particular, any form of client facing thing, and then specifically a sales background and slash or any form of technical expertise. So this is where it gets kind of complicated because the reason that people hate on recruiters is because recruiters don't know what they're talking about. And they're like, he was good on the phone and he worked at Google. And so like, he's good at his job. It's like, that's not true. And so one of the things that we make all of our recruiters do, first of all, we try to only hire recruiters who have\r\n\r\n\r\neither a sales or a marketing adjacent backgrounds. But in the event that they don't, or in the event that like they do a little bit, but they don't entirely know, like, I will put together a ton of training materials on each of the roles that we are hiring for. And like, what does a good answer look like? What does a bad answer look like? What does a good creative strategist look like, etc. So to summarize, and like, kind of distill that those points down, need to have a sales background, because like, you're going to get rejected a lot, and you're just doing it.\r\n\r\n\r\nhell of a lot of outreach recruiting sucks. People don't like to do recruiting because you're doing outreach all day long and to do it. Well, it's extremely time consuming. The second thing is client services to a degree. Like you're not selling a product like an e-commerce. You're the reality is your product can be bad to a degree, but people like you, you keep the business often and like, you know, at end of the day, good product, good service wins, but like there are exceptions to that and service really matters in this. then lastly is\r\n\r\n\r\nNikolas Hulewsky (32:25.55)\r\nYeah, that's true.\r\n\r\n\r\nConnor (32:35.928)\r\nany form of knowledge and expertise such that like, if you turn to me right now and you're like, Connor, I need to hire a JavaScript developer. I would say that's cool. Can't help you. Like, cause I have no idea how to do that. Like I've never done that before. I wouldn't even begin to know how to test or screen them, but like 99 % of marketing roles, I can do a very good job for you on.\r\n\r\n\r\nNikolas Hulewsky (32:55.662)\r\nThat's a hard thing for entrepreneurs because it's like, potential money and revenue. Yeah, I could solve that problem. We're problem solvers and we're motivated by the financial incentives. It's hard to say no to that stuff. right. Knowing everything you know now, would you start this business again?\r\n\r\n\r\nConnor (33:11.282)\r\nGood question. Yeah, I just would have niched down way earlier. Like, I think I think there's every business starts to look shitty after you've been in long enough. Or even just like after you get past like the the the new idea phase of it, like the things that I'm seeing right now in my world that I'm not super open about online, but I will be here is like, people do want the overseas talent, right? Like, like that is a trend. But I'm also\r\n\r\n\r\njust increasingly convinced that a bar bill approach is going to work best. Like I don't know any agency owners who are today putting Filipino talent in front of a client that pays $20,000 a month. Just don't. so that's, that's one of the one side of it. the other thing is like, okay, well, it will AI disrupt this business. Maybe like people might need to hire less, but I also think you make the other side of that argument of getting the right hire is going to be more important. and so.\r\n\r\n\r\nYeah, I think that I still really like the business. And I also think that if I only look at it from a recruiting business, then I think I would like it less. However, I do see a world where this becomes a business that is entirely around talent, sourcing, vetting, placing, training, you know, everything in between. And I think that that is a really big long-term vision. But like, I guess the last piece here is like,\r\n\r\n\r\nIt cashflow as well. And my ultimate goal is to own several profitable companies in the long term. And so like, this is a good business for that. like having access to good talent will make every other company that I run in the future that much easier.\r\n\r\n\r\nNikolas Hulewsky (34:54.766)\r\nAll right, let's bookmark this thing. You tell me 2025, what are you gonna do in top and bottom line revenue for your staffing company?\r\n\r\n\r\nConnor (35:03.446)\r\nideally a million top line and zero bottom line and zero bottom line. cause I would want to just, I think it's just going to take a lot of time and energy to grow. And I want to put every dollar back into the business, to grow it. So like, I, I'm, I'm very thankful that unlike other people who start agencies and it's their first business and it's like the, the gateway drug into entrepreneurship. Like we have other companies that pay me right now and I don't necessarily need a salary from this.\r\n\r\n\r\nNikolas Hulewsky (35:13.347)\r\nMm.\r\n\r\n\r\nConnor (35:31.058)\r\nBut what would be really interesting to me is to get this business to 2 million top line and you know, $600, $700,000 bottom line over the next 18 months. And then just take that cash and have way more optionality around future businesses and things that I can start. So yeah, ideally if we can get to a million dollars top line, if I'm not pouring everything into marketing, I think that there's a real world where $350,000 bottom line is very achievable.\r\n\r\n\r\nNikolas Hulewsky (35:59.214)\r\nAll right, what is one thing that you believe that you don't necessarily have evidence for, right? Like statistical evidence, but just in your gut, you're like, this is going to be a thing. And it can be in staffing or outside of staffing. no, no, it doesn't have to be anything related to this business, but just business in general. Like, is there something where, hey, it might be early, I don't have all the data on this, but gosh darn it, I just think.\r\n\r\n\r\nConnor (36:13.906)\r\nAlso does not have to be anything related to this business.\r\n\r\n\r\nNikolas Hulewsky (36:26.476)\r\nIt's kind of like your thesis with staffing. I just think that people are going to start wanting to pay for onshore talent. Cool. That might be it. But is there anything else that you have a lot of conviction around that you don't necessarily have the data yet to support?\r\n\r\n\r\nConnor (36:38.672)\r\nYeah. Okay. Actually I have one that I literally just thought of, on Monday or Sunday this week. have you ever seen Gary Vaynerchuk's video around, content creators for peanut butter? Have you seen that? No. it was, it was made a long time ago. It was made in 2012 and Gary Vaynerchuk had a whole video where he said, in the future, somebody is going to make a million dollars a year. And all they're going to talk about on the internet is their favorite type of peanut butter. And you don't.\r\n\r\n\r\njust go all in on different types of peanut butter, the texture, the flavor, the ways that you can make recipes with it, everything that's going to happen. And we're already seeing really niche creators because content has been so democratized. We've seen really niche creators make a ton of money talking about incredibly niche subjects. I think that the same thing will be incredibly possible for companies and businesses in the future. I, my, my old case right now is that\r\n\r\n\r\nIf your moat today is in product, I think you're going to have a very hard time in the future. I think that it's going to be incredibly easy and hardware and stuff like that. Right? Like you see the Elon Musk, the world building rockets and electric cars and chips. Like that's still early innings and hard, but like if you are selling a hat, if you're selling software, if you're selling, no, I mean, but even like, there's like consumable, like, like vitamins, supplements, whatever, like it's never been easier to\r\n\r\n\r\nNikolas Hulewsky (37:56.43)\r\nsoftware product.\r\n\r\n\r\nConnor (38:06.126)\r\nfind a co packer and launch a direct to consumer brand. It will soon. And we've seen this like even just this week alone, I'm seeing a lot of AI dev tools that can take you from idea to fully functional software product in the matter of hours. That's insane. Like that's crazy to me. And so you're, you're seeing it become easier and easier to make the product. So here's the question then, right? How do you get distribution? If everyone has a product now, distribution becomes the end game. And I think that you can get a lot of distribution by going hyper niche. And so\r\n\r\n\r\nI think I saw a tweet or LinkedIn post about this a couple of days ago. So if someone's listening to this and I'm blatantly ripping it off, I apologize. but like there will be a million micro niches around Calendly. Okay. What is the best calendars schedule scheduling tool for doctors for, and not even doctors, anesthesiologists for podcasters in the business space for, you know, any, any form of niche hyper profession.\r\n\r\n\r\nwhere they probably want this extra feature because maybe they're, you know, a certain level of compliance level and Calendly doesn't comply for that right now. And so I think that you're going to see a world where every product gets hyper niche based on their audience, even like, you know, you see it in a macro scale today, black rifle coffee, billion dollar company did $400 million in sales last year, and they focus on selling to conservative Republican American driven values. And that has led them to be a breakout brand.\r\n\r\n\r\nin this coffee category, I think that you're going to see that happen with every product company across every identity and profession and build hyper niche products.\r\n\r\n\r\nNikolas Hulewsky (39:43.406)\r\nI love it.",
  "metadata": {
    "duration": "",
    "date": "2025-01-20",
    "platform_source": "Google Drive"
  }
}