{
  "episode_number": "52",
  "episode_title": "How Frustration Led to a $400K/Month Call Center Business with Donald Spann",
  "guest_name": "Donald Spann",
  "business_name": "Call Panna, LifeTech Staffing, International Talent Staffing",
  "transcript": "﻿nik (00:00.558)\r\nAlright, Donald Donald span welcome to economics. Stoked to have you my friend. I've heard so many good things from good people that I know and like and just just excited to have you here.\r\n\r\n\r\nDon (00:12.069)\r\nYeah, thanks so much for having me Nick. Honored to be here.\r\n\r\n\r\nnik (00:15.662)\r\nAll right, well, let's hop into it. Tell us what is your business and how do you make money?\r\n\r\n\r\nDon (00:22.225)\r\nSo how I make money right now? Well, I'm investing in 14 companies that are not distributing anything to me yet, but hopefully in the future. I run a company called Call Panna. We are a call center, a contact center for the legal cannabis industry. I also recently, as of 22 days ago, I started a\r\n\r\n\r\nLife Tech Daffing Agency, a senior level talent primarily in the US in the life sciences and artificial intelligence spaces. And my partner in that, they've been in the industry for over a decade and way back when I was in one of my final jobs was in staffing. I also have the International Talent Daffing Agency focused on entry level positions and across general category. And then\r\n\r\n\r\nThat's about it.\r\n\r\n\r\nnik (01:22.254)\r\nThat's about it. 14 companies, a call center called Calcana, a staffing agency for high level sounds like AI talent and then an international staffing agency.\r\n\r\n\r\nDon (01:31.569)\r\nYeah, and more so like, yeah, more so life sciences. I don't even fully know what life sciences is yet. So I'm learning that. But you know, one thing about once you start doing enough project, like I'm jumping in, I don't care. I'll learn as I go along.\r\n\r\n\r\nnik (01:38.926)\r\nHahaha!\r\n\r\n\r\nnik (01:48.174)\r\nYeah, can you can you give me an idea of like, of the three that you mentioned call Canada Staffing Agency International Staffing? How big are those companies with employees? Maybe how much revenue today? Does each one of them do?\r\n\r\n\r\nDon (01:55.409)\r\nMm -hmm.\r\n\r\n\r\nDon (02:01.137)\r\nYeah, so, eight daffing, we source around 100 people.\r\n\r\n\r\nAnd so, you know, generally, we're probably going to do in terms of direct sort of, I guess, operating profit revenue around 300 ,000, but a technical revenue because, you know, we also handle payroll about a million. From the carcanic side, and eight staff is the international staff and is four years old.\r\n\r\n\r\nCall Canada's 18 months old we do about 45 ,000 a month and we've got 10 to 12 agents and a few like managers and And you know, we're going I Have not been taking we're technically profitable, but I haven't been taking any distributions yet\r\n\r\n\r\nAnd LifeTrak is, I mean, we're new, we haven't landed a client yet, but you know, go get some revenue by end of year.\r\n\r\n\r\nnik (03:16.974)\r\nSo let's first of all, cool that you were in the staffing agency business before it became sexy on social media. Tell me about the call center. So is this your first foray into call centers or you have a history in that, right?\r\n\r\n\r\nDon (03:23.057)\r\nI have a history in it. Going back a bit, really over the last few years, for those of you that know nothing about me, for the last 11 years I've been running different projects sort of at a full -time business.\r\n\r\n\r\nAnd so one of the companies, one of the earlier ones was a cleaning company, which I know there's a lot of people on Twitter with that. But I was one of the first ones in terms of adapting the model that's prevalent now, which is we were the first company in Chicago to offer online booking. And so we got a lot of calls. This was back in 2013. We got a lot of calls and after about a year and a half, I got sick of handling the calls. So I looked into some options.\r\n\r\n\r\nAnd in looking at the options, I determined that, you know, one, I could probably reverse engineer this and two, there's a lot of fellow owners that have the same problem. So I ended up in January 1st, 2015, launching a company called Vicky Virtual, who initially served a bunch of cleaning company owners. And over time, by the time I sold it in October, 2019, we had about 1300 clients in 40 different industries.\r\n\r\n\r\nand about close to 150 full -time employees. So it's not big. It was beautiful for me because I was the sole owner. So that was fantastic. But the cost was in the $10 ,000 major range. So it gets pretty crazy.\r\n\r\n\r\nnik (04:52.078)\r\nHoly crap. That sounds like a big call center. Like that's big, right?\r\n\r\n\r\nnik (05:12.91)\r\nCan you talk about like, so I think you said, Colcana is doing $45 ,000 a month in revenue. Can you talk about how big that agency got? Like how much revenue they were doing a month?\r\n\r\n\r\nDon (05:23.441)\r\nThe old one, Vicky Virtual. So we were turning over about $400 ,000 a month. And our employees were all US based in that company, with what's called Canada Assault International. About half of our people are in Eastern Europe, another half are in Latin America. So we're taking a different approach this time around.\r\n\r\n\r\nnik (05:32.686)\r\nWow. Wow.\r\n\r\n\r\nDon (05:52.049)\r\nAnd you know, again, I know there's a lot of people on Twitter that sort of advocate for international staffing. The caliber of talent I've been able to work with by paying, let's say significantly more than a typical call center for that particular job in the other country. We've been paying better, so the caliber we're working with is better. So I've had a sort of a much better experience.\r\n\r\n\r\nnik (06:16.782)\r\nSo let me, I just want to try to recap. You started a cleaning company in 2012, I think he was what you said, or somewhere around that ballpark. And as you started trying to grow that company, you were like, I think I could probably bring this in -house. I think I could do the call center, like this, the sale, the outbound sales calls in -house. And that evolved to, well, if I'm already doing this in -house, I could probably do it for other.\r\n\r\n\r\nDon (06:25.841)\r\nYeah, 2013.\r\n\r\n\r\nnik (06:45.646)\r\ncleaning company owners. And so you started growing the call center that way.\r\n\r\n\r\nDon (06:46.929)\r\nAnd yeah, and let me be clear too, I think a lot of call centers, they think about the outbound side. I specifically do inbound. So, you know, we were getting inbound calls, you know, asking questions, potentially booking an appointment. And I was sick of fielding those calls. You know, like I was trying to, it was like a remote business and I was trying to embrace that lifestyle. So being on the golf course, you know.\r\n\r\n\r\nnik (06:57.934)\r\nnik (07:06.574)\r\nMmm.\r\n\r\n\r\nDon (07:15.985)\r\nsomewhere. And having to field a call was like, over time, it's like, I want to focus on, I guess, higher impact things and not be distracted and interrupted. And so I knew a lot of others had this problem. So, you know, Vicky Virtual was an inbound company and Call Panna now is also an inbound focused contact center.\r\n\r\n\r\nnik (07:44.046)\r\nInteresting.\r\n\r\n\r\nDon (07:44.849)\r\nAnd you know, it worked out well. It made it so that, you know, there was a lot of planning company owners and small business owners, day one especially, with a day job. And they can't, you know, they can't answer the phone when they're at their desk. And so we enabled them to do that. And so instead of having a full -time receptionist, our average client was about $300 a month, and they could sort of rest easy knowing their calls would be handled and they'd be getting that business.\r\n\r\n\r\nnik (08:12.462)\r\nokay. So this was an inbound call center. This is not an outbound call center. And those, those are different skillsets, right? I mean, outbound, you're cold calling, you're trying to sell inbound, you're much more customer service, you know, educational setting schedule, setting the setter out. Okay. That's really, that's true.\r\n\r\n\r\nDon (08:19.441)\r\nYeah. And closing the deal, like if somebody's booking an appointment, you know, like we started in cleaning companies, but again, we were in 40 industries. 40 % of my clients or our clients when I sold were total attorneys and small law firms. And so, you know, when you have, yeah, so think about\r\n\r\n\r\nYou know, you're a solo attorney, you just went off to start your own thing instead of hiring a paralegal and or a secretary, but especially probably a paralegal that's also taking calls. You just, you know, enlist a call center. Really we will call it a virtual receptionist company that, you know, would answer, thank you for calling Bob's Law Firm. This is Donald, how can I help you today? And...\r\n\r\n\r\nWe would fill out the intake form. We wouldn't give legal advice, obviously, but we allowed that completely new law firm to present as if they had an office and they had an in -house receptionist that could field the call and leave that good first impression.\r\n\r\n\r\nnik (09:36.238)\r\nSo how did it turn from this is my in -house inbound sales team to, I can actually take on clients, right? How did you turn it from an internal part of your organization to a business that was helping support other businesses?\r\n\r\n\r\nDon (09:48.881)\r\nWell.\r\n\r\n\r\nDon (09:53.137)\r\nSo, honestly, I pursued it as a way to help other businesses. You know, it had to add a perk of supporting my business as well. But day one, you know, I did a whole prelaunch campaign and day one we had seven clients.\r\n\r\n\r\nnik (09:58.446)\r\nYou did, okay.\r\n\r\n\r\nnik (10:08.974)\r\nHow did you know that there was a demand for it? Like obviously you knew there was a pain point in your business and so it made sense for you to bring it in house. Hey, I want a golf. I don't want to be interrupted by sales calls. This is annoying. But what made you sort of go the next step and say, actually, this is not just a cost center. This could actually be a business for me.\r\n\r\n\r\nDon (10:15.953)\r\nMm -hmm.\r\n\r\n\r\nDon (10:30.528)\r\nYeah, I mean the reality is that most businesses answer calls or they should be answering the phone. They get some type of inbound inquiry, especially across different channels, whether it's calls, emails, maybe live chat, if they set it up on their website, social media messaging, and so call PANNED for the legal cannabis. We do all those channels.\r\n\r\n\r\nAnd so it already existed. It's sort of shocking that no one talks about it because, you know, call centers are a $300 billion industry and growing at 6 .7 % every year. It's going to be three quarters of a trillion by 2027, I think. And so, yeah, nobody talked about call centers and it made zero sense whatsoever. I created a course on this which has about 500 students.\r\n\r\n\r\nnik (10:59.566)\r\nHmm.\r\n\r\n\r\nnik (11:13.742)\r\nWhat?\r\n\r\n\r\nDon (11:25.137)\r\nAnd that's all I'll say about it. But in the US alone, in the virtual receptionist niche, which was like a fancy answering server, it's $3 billion a year in the US alone. And grown.\r\n\r\n\r\nnik (11:38.574)\r\n$3 billion virtual receptionist industry in the United States.\r\n\r\n\r\nDon (11:43.633)\r\nYeah. Yeah. And the average business size is $2 .4 million dollars as of 2022. The average business size. So we were only slightly above the average size. So it's not saturated and for some reason, I'm not kidding, you can go on YouTube, I am the only course on this topic on the entire, on the planet.\r\n\r\n\r\nnik (12:10.702)\r\nmy gosh.\r\n\r\n\r\nDon (12:11.313)\r\nSo for some reason, yeah, nobody talks about call centers, but over the course of a day, most of us have some desire to inquire about something. And the business owners, especially in the services, in the trades, so many of you in the trade, you're not answering the phone. And when you don't answer the phone, you're leaving the door wide open for any of your competitors that do answer the phone.\r\n\r\n\r\nto get the business you would have gotten. And so that's the premise. Answer the phone, answer it with a delightful, cheery voice, and actually represent the business that's being called well, instead of picking up the phone and taking a message, or letting it go to voicemail and I'll call you back, or shooting over a text like, sorry I missed your call. That can work, but the reality is that when someone is looking for a plumber, and they have some questions, or maybe,\r\n\r\n\r\nIt's an emergency. They want to talk to someone and usually a human still that says, Hey, yeah, we'll get someone out to you in this amount of time.\r\n\r\n\r\nnik (13:20.174)\r\nWell, I think it's interesting. Businesses look at growth and there's kind of two sides to the coin. There is generating more leads, but there's also converting a higher percentage of the leads that you already have. And most of the time you think, I just need to generate more leads, right? Because more leads equals more business. You decided to take the tact of, well, it's not necessarily you're not getting enough leads. Are you converting your leads at a high enough percentage?\r\n\r\n\r\nnik (13:49.71)\r\nAnd then you built a business around that. It's interesting. Most people focus on the former as opposed to the latter. When you launched, when you launched, you know, go ahead.\r\n\r\n\r\nDon (13:50.545)\r\nYeah.\r\n\r\n\r\nIt is harder to generate leads than it is to do a decent job once you get the lead. And to your point, some of our larger clients were sort of like a white label of digital marketing agencies, because a digital marketing agency would\r\n\r\n\r\nnik (14:12.462)\r\nHmm.\r\n\r\n\r\nDon (14:23.121)\r\ncreate leads, they would spend their client's dollars to create more leads, higher lead flow or higher traffic. And then the client wouldn't answer the phone or wouldn't close the deal because they're not available. And so after a while, it's like, listen, they're going to be upset with me because I'm spending their money and they're not ultimately generating revenue because they're not closing the leads because they're not picking up the phone. So it's like, okay, I will also provide the service of picking up the phone.\r\n\r\n\r\nSo, you know, it matters. Again, it.\r\n\r\n\r\nnik (14:54.67)\r\nInteresting. So you partner a lot with digital marketing agencies.\r\n\r\n\r\nDon (15:00.945)\r\nWe did in that business. I would say probably 10%.\r\n\r\n\r\nnik (15:04.526)\r\nNot in the cannabis, not on the calcana.\r\n\r\n\r\nDon (15:09.649)\r\nOur clients are dispensary groups generally and like cultivators, like growers, and we're trying to expand. But there's only a few digital marketing agencies in the space because you can't really advertise too much for cannabis.\r\n\r\n\r\nnik (15:25.102)\r\nTalk to me about the economics of the business. How does it work?\r\n\r\n\r\nDon (15:29.361)\r\nYeah. Yeah. So, I mean, it's really simple. You know, essentially what you're doing as a concept is you're looking for people that want some type of service to handle their inbound inquiries. And to a certain extent, outbound as well, but usually inbound inquiries, right? And then you're providing people to do that.\r\n\r\n\r\nresources to do that. You can either do it with human labor or obviously more popular is, you know, grown popularity is artificial intelligence agents, which is very just computing power. And so, you know, we just make our money in the margin between those things. So I don't want to say my exact numbers because I do have investors in Carpenter, but\r\n\r\n\r\nnik (16:24.206)\r\nYeah, so like high level, how do you look at or how does the industry look at revenue? Are you looking at it on like a per employee basis? Is it a per customer basis? Is it like how do you kind of evaluate things?\r\n\r\n\r\nDon (16:34.289)\r\nYeah, yeah.\r\n\r\n\r\nDon (16:38.417)\r\nThe way that evaluated and sort of projected forecasted within any concept call center wise is you Get a sense of what the total monthly bandwidth basically, you know, what can an agent one human output and So in most call centers, they tend to be a bit aggressive with what they ask and so that's six the equivalent of six or seven thousand minutes a month\r\n\r\n\r\nnik (16:55.63)\r\nOkay.\r\n\r\n\r\nDon (17:08.401)\r\nwhich is about five hours, sometimes up to six hours a day on the phone, just straight up talking or handle time however way you charge it. Handle time is talk time plus, you know, writing notes at the end, which is called after call work. If you add those two metrics, you get handle time. So, you know, let's say an agent can handle 5 ,000 minutes a month, right? My business model is based off of 4 ,000 minutes a month.\r\n\r\n\r\nbut let's say an agent can handle 5 ,000 mails a month. And let's say you're charging $2 per minute. However, which way it breaks down, let's say it packages, whatever, let's say it equates to $2 per minute, where you're generating $10 ,000 per month for an agent. And if you're employing someone, let's say in the US even, you're probably all in on average about $3 ,500. If you're employing someone overseas, you're probably all in around...\r\n\r\n\r\n$1 ,100 to $1 ,600 on average. So you're generating $10 ,000 a month at full bandwidth per agent on let's say $1 ,500 a month in expenses. And so that growth margin is very high. And you have a lot of room.\r\n\r\n\r\nnik (18:22.798)\r\nYeah. So on the revenue side, if I'm a small business owner, are you quoting me, hey, this was going to cost you per minute? Or are you saying, hey, per month, this is the flat rate? Like, how does it work out on that end?\r\n\r\n\r\nDon (18:38.001)\r\nYeah, so Vicky Virtual did tiers. And the way that I talk about my course is pricing tiers, which equate to a certain thing. So when I sold the company, our market plan, which is $99 a month, and now for 60 minutes a month. So about $1 .67 a minute. And then there was another tier in between, the third tier was 300 minutes for $349 a month.\r\n\r\n\r\nwhich is about $1 .16 a minute. And so in that scenario, you know, death was generated. And so with our agent doing about 4 ,000 minutes a month, on average, we were generating about $1 .30 a minute, so about $5 ,200 per agent. At the time, it was pre -pandemic, so our costs were lower. We were in for about, all in on average, about $2 ,500.\r\n\r\n\r\nSo we had about just over 50 % growth margin. And since we were remote, all of our agents, even in the UF, were working from home. And that's the same in my current setup. They're using their own laptops. We have a prerequisite of having a solid internet connection. If necessary, we provide headsets and such. But they're taking calls on the internet. And so they're just plugging in a USB headset.\r\n\r\n\r\nAnd sort of cost the phone system, which can be pricey. And a lot of people like to skimp out on that, but I just broke down growth margin. There's no reason to skimp out on that. And then you've got, as you grow, management. And then of course any marketing costs and such, and that's it.\r\n\r\n\r\nnik (20:29.134)\r\nSo, okay, so talk to me about that. You got, you know, $10 ,000 a month in revenue, let's say $2 ,000 a month in costs, 80 % gross margins. On the administrative side, the indirect costs, you set a phone system, what, so they're not just plopping in AirPods and answering calls that like it's a, it's a hardware that you're sending to each one of these, like, well, like, what is it? No.\r\n\r\n\r\nDon (20:46.193)\r\nIt's good.\r\n\r\n\r\nDon (20:51.729)\r\nNo. Yeah, again, they're taking calls on their laptops, right? Or their computers. And it'll be like a USB headset that connected to it, right? And I guess some people might use an AirPod or something. I wouldn't recommend it because the battery could run out before a shift is done. But the reality is that a $40 Logitech headset will do the job. It'll be great.\r\n\r\n\r\nnik (20:56.366)\r\nokay.\r\n\r\n\r\nnik (21:01.838)\r\nOkay.\r\n\r\n\r\nnik (21:09.198)\r\nSure, sure.\r\n\r\n\r\nnik (21:18.35)\r\nAnd there's a system, I'm assuming, that tracks all these calls and the time. And it's like, so it's very, this isn't an otter system. Like I spent 60 minutes today.\r\n\r\n\r\nDon (21:23.409)\r\nYeah.\r\n\r\n\r\nIt a contact center software one of the most robust software is out there it gets insanely complicated I Considered over time building one and I can tell you right now just argue with someone about this it was outside of it Why don't you just do this? And I'll tell you right now if I would have built something worth its salt it would cost at least two to three million dollars even with internet\r\n\r\n\r\nnik (21:44.878)\r\nHahaha\r\n\r\n\r\nnik (21:58.218)\r\nmy gosh, that's international talent building it. Yeah.\r\n\r\n\r\nDon (21:58.513)\r\nYou know programmers Yeah, and so that's no talent building. So it'll take three to four years and two to three million dollars to really do it right? even building it or considering building it for my student because I At this point we've heard 80 people into successfully into The phone systems I typically recommend which are five nine and more recently ringed central\r\n\r\n\r\nnik (22:24.526)\r\nI know RingCentral.\r\n\r\n\r\nDon (22:27.121)\r\nYeah, so RingCentral used to be pretty much just like phones, but back in September of last year, they finally brought that into a full, fully comprehensive contact center software. So contact center meaning, you know, different channels, omni -channel, multi -channel. So we're talking live chat, email correspondence, social media correspondence, you know, et cetera. Versus, you know,\r\n\r\n\r\nnik (22:49.55)\r\nMm -hmm.\r\n\r\n\r\nDon (22:55.633)\r\na call center software, which is primarily just phone and maybe SMS. And so RingCentral\r\n\r\n\r\nnik (23:02.094)\r\nSo I was just going to ask. All right. So I get the gross margin side of things, but the indirect size, you've got to manage these people. You've got to make sure that, you know, they're answering the calls in the right way. They're converting at a certain percentage. They're being trained appropriately, et cetera. I'm assuming you're using the call center software to track their time. And there's like key metrics that you're looking at. What are like, what are the key metrics you look at?\r\n\r\n\r\nDon (23:08.433)\r\nMm -hmm.\r\n\r\n\r\nDon (23:27.505)\r\nYeah, those...\r\n\r\n\r\nDon (23:32.113)\r\nSo I'll say, let's say five, but I want to point out before I say that, that Ring Center N59 have the capability of generating probably 5 ,000 different types of reports. And that's not an exaggeration. I mean, they track everything. And honestly, I will get to that.\r\n\r\n\r\nnik (23:47.566)\r\nHa ha ha.\r\n\r\n\r\nSure.\r\n\r\n\r\nDon (23:55.857)\r\nBut I want you guys to, I've been talking more because I want people to have sort of a holistic understanding of this. Yeah. So the nice thing about writing a call center from the management side is that it's one of the few things where you can sort of micromanage without micromanaging because you see exactly the second they log in, there's reports that will show every single key that was ever\r\n\r\n\r\nnik (24:02.67)\r\nNo, this is fantastic, Donald.\r\n\r\n\r\nnik (24:18.382)\r\nyeah.\r\n\r\n\r\nDon (24:25.745)\r\nin the entire system down to the second and you know going back a year. So if someone says no I didn't do that you can look well it looks like you intentionally hung up that call. You know it traps all kinds of stuff. The five metrics that we pay the most attention to are in terms of across agents right let's say in that context.\r\n\r\n\r\nnik (24:39.214)\r\nYeah, yeah, yeah.\r\n\r\n\r\nDon (24:53.361)\r\nWhat's your average speed of answering? If we're scrutinizing agents, if we're scrutinizing the call center, that's how fast is the, what's the hold time before a call is answered across different clients. That's one. Two, what's the abandon rate? Abandon is when a caller calls.\r\n\r\n\r\nand they hang up before an agent has a chance to answer the call. So sometimes, generally, around 25 seconds is when the abandoned percentage starts to go up. In this industry, especially within my niche on the inbound side, you want it to be somewhere between 5 % and 10 % as an abandoned rate. If it's above 10%,\r\n\r\n\r\nnik (25:34.894)\r\nInteresting.\r\n\r\n\r\nDon (25:47.633)\r\nThat's when you'll start hearing complaints from your clients. And that means you need to provide more bandwidth by hiring more people. If it's below 5%, you've actually over -hired and you need to add some clients. 2 % to 3 % of calls are going to be either robo calls or people that dialed the wrong number. And it's just built in. So like 2 % is sort of a sweet spot in terms of\r\n\r\n\r\nnik (25:54.862)\r\nHmm. Yep.\r\n\r\n\r\nnik (26:01.902)\r\nInteresting.\r\n\r\n\r\nDon (26:16.369)\r\nHey, you know, someone called in, they tried to reach someone, you know, he didn't pick up quickly enough. So that's abandon. Three would be the talk time, the amount of time. And so that's usually scrutinized by agent. Sometimes we scrutinize that by client because certain types of clients in different industries, you know, they have wildly different average call time. Right. Across the center, you should expect it to be around two minutes on that.\r\n\r\n\r\nnow if I were to give a fourth, it would be a\r\n\r\n\r\nnik (26:51.822)\r\nI mean, if there's only three, there's only three. I mean, I just was curious, like what the top kind of things you look at.\r\n\r\n\r\nDon (26:57.265)\r\nYeah, I would say those are the top three. We also, of course, do the number of calls an agent has taken on average over the course of the day to get a sense of how much are they dealing with. And again, we just put that against their bandwidth. And then finally, we have, this is important, the percentage of dispositions. So dispositions are a category of call.\r\n\r\n\r\nAnd so we have 20 different dispositions and our actually 26 in our current company. An example would be message taken or product complaint or something like that. So the percentage of different disposition.\r\n\r\n\r\nnik (27:48.206)\r\nYeah, the interesting thing about your business is, are you a sports fan at all?\r\n\r\n\r\nDon (27:53.521)\r\nYeah. I saw that down in the cup last night.\r\n\r\n\r\nnik (27:54.35)\r\nbaseball has.\r\n\r\n\r\nokay. I don't know who won. Who won? Did Edmonton come back and?\r\n\r\n\r\nDon (28:03.757)\r\nFlorida, Florida one. Yeah, two to one I would very cost.\r\n\r\n\r\nnik (28:04.878)\r\nFlorida. Okay, they did it.\r\n\r\n\r\nLike in baseball, there's this concept of moneyball, because in baseball, they've been tracking these statistics for so long. And the statistics are so specific and controlled. You know, in basketball, if somebody has a ball, like has the ball, and they, if Allen Iverson has a crossover at the top of the key, right? Well, how do you isolate that move? Was he at the top of the key? Was he at the corner of the key? You know, was he, you know, down in the post, like there's just a bunch of places.\r\n\r\n\r\nDon (28:27.537)\r\nMm -hmm.\r\n\r\n\r\nnik (28:37.006)\r\nBaseball, it's like, did he get a hit? Did you not get a hit? And if you got a hit, was anybody on base? Like there's it's, it's more controlled and the metrics they can generate, but because they can generate so many metrics, it's much easily, much more easily predictable, by plugging and playing in certain pieces. And it sounds like these call centers, there's so many minutes that are being logged and in a controlled environment that you can say like, we know with some certainty, we're just going to get two to 3 % there. Wrong number. Robo calls. Right. Like that's interesting.\r\n\r\n\r\nDon (28:47.148)\r\nYes. Yes.\r\n\r\n\r\nYeah, I mean, yeah, absolutely. Once you get some skill, you can really get us done. And you know, I got about it. Yeah.\r\n\r\n\r\nnik (29:13.998)\r\nI was just going to say, so bottom line performance, what's like an industry average for these call centers? What's the typical like net profit margin that they're generating?\r\n\r\n\r\nDon (29:24.241)\r\nIt's wildly variable across different niches. If you're doing like an outbound call center, I'm assuming you want to be around 20 or 30%. There's a lot of call centers, especially most of the large ones go after contracts and they like bid contracts. And that's all about, you know, trying to go to lowest bid and then you're overworking your people. So that could be like 10%, right?\r\n\r\n\r\nnik (29:41.614)\r\nMm -hmm.\r\n\r\n\r\nDon (29:50.577)\r\nI think across the industry it's probably 18 or 20 percent, maybe a little bit lower. I always tell my students in our niche to shoot for 35 percent. It's hard to achieve that in the beginning because of course you got to get to a certain level of scale, but by the let's say 30 ,000 a month mark, you should be there unless you're being aggressive in terms of spending for scale.\r\n\r\n\r\nnik (30:15.662)\r\nSure. How do you acquire customers? The inbound call centers in particular, where are you getting them from? What channels are you using?\r\n\r\n\r\nDon (30:19.857)\r\nAnd my current business is all networking. Cannabis is just not going to happen outside of that. It's just very difficult. In general, there's all kinds of different ways. One of the beautiful things is my most successful student, there's seven that have hit the seven figure mark now. And all seven of them had different methods.\r\n\r\n\r\nSo an example would be prospecting on LinkedIn. Another example would be one guy that's counted right now, he's running TikTok ads. I didn't even think that was a possibility, but he's doing it and it's blowing up on there. You know, some people are focused on SEO related things. Our business was mostly built on that. And, you know, just relying on\r\n\r\n\r\nnik (31:21.55)\r\nAnd do you, so there are different models. You can do the pay -per -click, you can do SEO, you can do traditional models. For you, do you know how much it costs to acquire a customer?\r\n\r\n\r\nDon (31:34.737)\r\nSo, dependent. And it changes so much. I showed in 2019, it changed a lot since then. We would spend around $300, which I'm telling you is amazing. Our retention at that time, which I think had gone up, was 22 months. So if I have a client with $300 and we've got 22 months, that's $6600 that we were spending $300 to acquire. And so, frankly, we were able to... You know what?\r\n\r\n\r\nnik (31:41.102)\r\nRight, okay.\r\n\r\n\r\nnik (31:51.918)\r\nWow.\r\n\r\n\r\nDon (32:03.409)\r\nIt's funny because when I started the company, it was actually to our very first client and we actually didn't go through all of that. But if we did, I consulted for a bunch of different call centers and one of them had like a, I think they were making 15X on their spend in revenue. And they...\r\n\r\n\r\nI'll put it this way. I was working with a private equity firm on this one company. They were doing about 28 million and growing. And that firm offered 5X revenue and they were outbid by at least three other firms.\r\n\r\n\r\nnik (32:50.67)\r\nmy gosh. So in the call in the center industry, is that pretty normal to do evaluation based off of revenue?\r\n\r\n\r\nDon (32:58.193)\r\ndepends on the net. And on net, I would say yeah, eight sold for a multiple.\r\n\r\n\r\nnik (32:59.566)\r\nIt depends on the net.\r\n\r\n\r\nnik (33:05.966)\r\nDang, man, that is freaking fascinating. So my last kind of business related question, and then I want to get into the rapid fire is, I think you've noticed this too, but there is this tendency on Twitter in particular, Instagram has it as well, where somebody starts out with a services business, cleaning company could be, and\r\n\r\n\r\nIn order to grow and scale that cleaning company, they've got to like systematize things. But in the systemization of it, they also create, I don't know, like you did a call center, but something to help grow their business. And then that becomes the business, whether it's teaching people how to grow the cleaning company, selling courses, or like you did going all in on servicing that industry by offering a niche offering.\r\n\r\n\r\nDon (33:39.201)\r\nYeah.\r\n\r\n\r\nDon (33:50.801)\r\nBecause I think once you come across the needs yourself\r\n\r\n\r\nnik (34:03.662)\r\nIt kind of it pivots from that home service to another thing. Why do you think that is? Why do you think that there's that pivot that happens?\r\n\r\n\r\nDon (34:19.761)\r\nWhat, again, most people that have service companies do. They either ignore it or they like, you know, address it. And you realize that you haven't had a bunch of people, like as you run your business, you get solicitation across all service categories. There's not a lot of people that hit you up offering to be a call center for you. And so I think there's this realization that it's like, wow, this is so...\r\n\r\n\r\nThis is like a utility service for us. This is like a, you know, it's a utility. Like it's one of our core categories of things that we need to be continuing to utilize for the rest of our business existence.\r\n\r\n\r\nnik (35:04.398)\r\nYeah, it's foundational to the company.\r\n\r\n\r\nDon (35:06.257)\r\nIt's foundational. And so in doing that, it's like why I'd love to be a foundational service offering to other companies. It's very sticky, can get very ingrained. And so, you know, it's just sort of a natural and parallel thing. And the nice thing is because you have so many metrics and things that exist within the software. As long as you build out your SOPs surrounding\r\n\r\n\r\ncall center etiquette, how to handle calls and interactions for certain clients, it's not that hard to systematize because it is pretty predictable. The actions are the same. It's very repeatable. And so when things are repeatable, it's easier to systematize it. And it's easier to get to the point where you can run things. And I think that once you have that sort of developed\r\n\r\n\r\nbusiness brain, I guess. You know, you should have intrinsically come to those same conclusion. And, you know, I know I keep, it's almost like I'm selling the business or the industry and I can't help but do that. But another thing to mention, I was working maybe eight to 10 hours a week on the business when I showed up. Because everything is so well. And even with Carl Kanna,\r\n\r\n\r\nIt takes me about 10 hours a week to run it. And anything outside of that is just focused on client generation.\r\n\r\n\r\nnik (36:42.254)\r\nIf somebody wanted to get into the call center industry, would you recommend they focus on a niche or would you recommend they just get in and offer anything to everybody?\r\n\r\n\r\nDon (36:54.257)\r\nYeah, I think, you know, being an initiative, the best thing because you have what I typically recommend is that if you have current experience in an industry that is that has any need whatsoever for call center services, then you focus on that first because you're aware of the pain points. And so when, you know, when talking to process, you can sort of hit the touch on those pain points.\r\n\r\n\r\nnik (37:11.438)\r\ntonight.\r\n\r\n\r\nDon (37:23.857)\r\nand get some buy -in and more interest. And then once you grow and you're able to get yourself out there, establish more of a sort of internet footprint, eventually you'll be able to have resources to one, spend outward, and two, get traffic organically.\r\n\r\n\r\nnik (37:46.254)\r\nSo besides cannabis, which is what you're doing, are there any industries within cold calling that you think would be growing or just underserved or good niches to focus on? You said it's a $300 billion industry that's growing at 6 .7 % a year, something like that. So it's growing, it's outpacing just regular inflation. Are there any that you're particularly like, man, there's a huge need in these areas?\r\n\r\n\r\nDon (37:49.393)\r\nYes, sir.\r\n\r\n\r\nDon (38:04.109)\r\nYeah.\r\n\r\n\r\nDon (38:13.597)\r\nWell, you know AI is exciting for pretty much everyone Call centers aren't sexy, but AI and call center makes it sexy. So people we're sort of a gold rush right now the majority of the sort of advancements are happening on the software side because you know, you can't really be a better service offering than the other AI service offering like you're using\r\n\r\n\r\ncomputing power regardless. So what's the difference if the software you're using? And so there's a lot of competition between different software and science in terms of, you know, how good can they make their agents? And so it's still very much on tap. I have been avoiding it sort of on purpose, but we do offer a AI agent because our software, Rain Central has it. But I'm of the mind, especially in our niche, that people need to reassure and\r\n\r\n\r\nof humans. Now when it comes to the larger skill operations like, you know, calling a Fortune 500 customer service line, that needs to be AI because humans are too frustrated, they make too many mistakes, and they don't have the bandwidth and energy to do the exact same thing, same level of quality every single day. So, you know, I think there's a lot of opportunity in the AI space. There's a lot of people, whether they're\r\n\r\n\r\nnik (39:33.166)\r\nInteresting.\r\n\r\n\r\nDon (39:40.369)\r\nI used to argue about how good is an AI agent versus a human one. And the fact is it doesn't really matter. It matters what clients want to buy in. So clients will say, hey, this is interesting. Let me try the AI agent, whether it's better or not. And if it's sufficient, that's your client.\r\n\r\n\r\nnik (40:02.158)\r\nOkay. All right, I have some rapid fire questions for you to end. Is that cool? What do you love about this business?\r\n\r\n\r\nDon (40:07.185)\r\nYeah, yeah absolutely.\r\n\r\n\r\nDon (40:14.001)\r\nWhat I love about the call center business is a lot of the stuff I said before, but one of the big things being that once you get to a certain level of scale, pretty repeatable. There's a lot of fires and some of them are terrifying, like a phone system going down, that's your entire business. And so it's like, my God, then you don't have control. But outside of things like that, which are very inoff and rare.\r\n\r\n\r\nIt's something that you can go to sleep at night Knowing that you are actually truly serving all of your clients. You're providing real value to your clients You didn't sell them something and it's like, I don't know if I'm getting the value and on the inbound side It's not performance based the way outbound is Outbound, you know people are like, hey, you know, I need to achieve this You know this all I well\r\n\r\n\r\nIt's not worth it. And maybe you achieved that for three months and then for the next two months you don't and all of a sudden it's done. Whereas on the inbound side, it's like, are my people happy when they talk to your agents? Yes, great. I don't need to change it. You know, and so it's just, it's a lot calmer. It's a much less, I guess, tense relationship really. It's just a simple.\r\n\r\n\r\nnik (41:30.286)\r\nYeah.\r\n\r\n\r\nDon (41:41.489)\r\ntransaction and clear value on both sides.\r\n\r\n\r\nnik (41:43.086)\r\nWhat do you hate about the business?\r\n\r\n\r\nDon (41:47.857)\r\nThe only thing that's annoying about the business right now is how many people are outside of it and think that AI agents are better than human agents when they have no idea. And they just have no idea.\r\n\r\n\r\nnik (42:02.478)\r\nTrue, true. We're all creatures who are jealous and think the grass is greener on the other side of other businesses. What business are you jealous of right now?\r\n\r\n\r\nDon (42:15.993)\r\nThe only business I'm jealous of is a business that is not too frustrating and generating nine or ten figures in revenue that someone else owns and not me.\r\n\r\n\r\nnik (42:30.958)\r\nWhat business is that? I think that sounds just like being born with money.\r\n\r\n\r\nDon (42:34.993)\r\nYeah, pretty much. Well, I'll say this. Like tech staffing, I'm super excited about it. It can be a nine -figure company. There are agencies even in this niche that are generating that. And our premise, not to get into it, but our premise is significantly better than pretty much all of them. And so I'm just sort of anxious to get to that point. So I'm jealous of, I guess envious.\r\n\r\n\r\nof anyone that had gotten to that point.\r\n\r\n\r\nnik (43:06.478)\r\nAll right. If you had two hours in your day and you don't have to do anything personal, you don't have to do anything with the business, what are some things you're obsessed with right now? Where does your mind go? What are you doing in those two hours?\r\n\r\n\r\nDon (43:20.537)\r\nOutside of business? racing.\r\n\r\n\r\nnik (43:24.91)\r\nRacing, what do you mean?\r\n\r\n\r\nDon (43:26.417)\r\nYeah, I mean, if I could drop everything, if I had unlimited money and had no desire even to work on anything other than the sort of passion project, it would be, you know, owning a Formula One team and being one of the drivers. Yeah. So I absolutely, no, absolutely not. That's a dream of mine, but it's extremely difficult.\r\n\r\n\r\nnik (43:45.293)\r\nReally? Have you ever driven a Formula One car?\r\n\r\n\r\nDon (43:55.793)\r\nto be in a position to do that. And even then you're not driving like anyone near a current year one. And it's a very expensive sport. Even if you're driving beat up Nissan, if you take it on a track and you're using proper performance tires and properly running in on the track, you're replacing $2 ,000 for the tires every single track day. So that adds up fast, plus you gotta get out there and...\r\n\r\n\r\nnik (44:03.854)\r\nday.\r\n\r\n\r\nnik (44:07.438)\r\nYeah.\r\n\r\n\r\nDon (44:25.393)\r\nNot the time, not yet, but that's my dream.\r\n\r\n\r\nnik (44:26.958)\r\nYeah, all right. That's cool. That's a cool answer. Last question. What advice would you give yourself 10 years ago?\r\n\r\n\r\nDon (44:36.081)\r\nThe one thing I did 10 years ago, which I don't know if I think it's a good or bad thing, is I tried so many companies. And I think it was necessary because I wanted to get a sense of\r\n\r\n\r\nwhat I like.\r\n\r\n\r\nDon (44:59.505)\r\nhonestly, I can't really give myself too much advice. I guess if there's one piece of advice though, 2014, I would say if I could go back in time, invest every single dollar in the Bitcoin and sell it later. But I really, I really don't have any regrets over the last.\r\n\r\n\r\nnik (45:17.806)\r\nFair, fair. All right, Donald, this has been.\r\n\r\n\r\nOkay. This has been an awesome conversation, man. Where can people find you or more about your businesses?\r\n\r\n\r\nDon (45:32.081)\r\nYeah, so, you know, again, the two businesses I really care about right now are LifeTechStaffing .com and CarlKana .com. I'm assuming they'll be linked to that. And on Twitter, I am at DTSpan. And Nick and I follow each other. I think some of our content is pretty similar. And yeah, hope to see you on there.\r\n\r\n\r\nnik (45:59.598)\r\nMan, this was awesome. Thank you so much and I can't wait to connect with you in the future.\r\n\r\n\r\nDon (46:04.017)\r\nYeah, absolutely.\r\n\r\n\r\nnik (46:05.294)\r\nI'll talk later.",
  "metadata": {
    "duration": "",
    "date": "2024-09-02",
    "platform_source": "Google Drive"
  }
}