{
  "episode_number": "32",
  "episode_title": "Building a 7 Figure Hospitality Biz Working 10 Hours a Week with Rashmi Bhat",
  "guest_name": "Rashmi Bhat",
  "business_name": "Hospitality Management Company, Short-Term Rentals, Hotels, Restaurants",
  "transcript": "﻿My first business at 21, I graduated college with three job offers and decided I was just going to do my own thing. And I figured I had one year to figure it out. And if it didn't work out, I would go back, get my master's and get a corporate job.  And that ended up becoming 10 years in the hospitality space.\r\n\r\n\r\nI own restaurants. I pivoted into real estate in 2020. We bought short term rentals and then I started managing short term rentals  and then grew into our hotel portfolio. And so today  I have everything from restaurants or hotels to short term rentals. \r\n\r\n\r\nHow can someone with limited resources launch and scale a hospitality business? And what if that someone is a female immigrant who has no experience running a business? Well, on today's episode, you Bhatt did just that. Welcome to another episode of Nickonomics, the show for entrepreneurs and entrepreneurs who are curious how other businesses work.\r\n\r\n\r\nI, of course, am your host, Nicholas Halewski. I am an entrepreneur who's owned and operated more than a dozen businesses, generating 30 people. Recently I sold most of my holdings and now I spend my time talking to business owners and bringing you their stories. Well, on today's episode, I'm obsessed with just one question. \r\n\r\n\r\nHow the freak did Rashmi? An immigrant who learned to speak English by watching cartoons, a bootstrap business empire  that has five hotels, a short term rental management company, and launched a restaurant during COVID with just 20, 000. I hope you enjoy this one. All right, Rashmi, welcome to Nickonomics. I am very excited to have you on.\r\n\r\n\r\nI think this is going to be an awesome conversation today, but for those who don't know you, why don't you just describe the process? In its simplest terms, what your business is and what you do.  Thanks so much for having me on here, Nick, for anyone that doesn't know the way to pronounce my name, which is really easy, it's like, don't rush me.\r\n\r\n\r\nRush me. I was like, just a little  before everyone tries to figure it out.  So I, my, my first business at 21, I graduated college with three job offers and decided I was just going to do my own thing and I figured I had one year to figure it out and if it didn't work out, I would go back, get my master's.\r\n\r\n\r\nand get a corporate job.  And that ended up becoming 10 years in the hospitality space. I own restaurants. I pivoted into real estate in 2020. We bought short term rentals and then I started managing short term rentals  and then grew into a hotel portfolio. And so today  I have everything from restaurants or hotels to short term rentals.\r\n\r\n\r\nAnd I am fully virtual in my business. So I worked from home. Walk me through that again. First business was a restaurant. And did you, you bought that restaurant?  No, it was a sandwich shop. I don't have any money. Like I was 21 and out of college. I had like 20 grams to my name that I'd saved working for four years, like at tips through college. \r\n\r\n\r\nI had next to nothing.  So how did you get the restaurant?  So I found this art gallery that was 1, 700 a month to rent. And it was like an eight or 900 square foot space. And I figured that for sandwich shops, you don't need a HUD. See, your startup cost is really low. You need, like, a refrigerator, a salad prep, and a counter.\r\n\r\n\r\nLike, you need, like, three things. Okay. Sorry. Stupid question. What is a hood? A hood is if you have a gas range in commercial kitchens, you need literally a hood that takes away like all the steam and the heat. Oh, okay. It's a piece of equipment. It's not really expensive now, but back then that was like 15 grand and I had 20 and so it was basically my whole budget. \r\n\r\n\r\nI'm not doing, so then, so you're not doing anything with a hood.  I didn't have a stove.  Oh, yeah. Okay. So the twist was 2014. I went to Fiverr. I found this guy who was a French chef who wrote recipes. So he wrote me 10 sauce recipes that I use for sandwich-like sauces  and I opened the restaurant. It was just like my mom and I and I was like, I think people will come eat a sandwich. \r\n\r\n\r\nThat was it. That was it. Yeah, it was.  Yeah. Okay. So what, like just regular old sandwiches and were these, was this like a deli, you know, no premium meat? Like, yeah, yeah. We had fancy meats, fancy cheeses. I grew up in France. So I brought the French element a little bit. I didn't know you grew up in France.\r\n\r\n\r\nI did. I lived in France from when I was six to about 10 years old. I know you just visited there, but I didn't know that you also had family or like experience there. Yeah. I lived there and I lived in Malaysia for a couple of years. I moved to the United States in 2009, like right at the heart of where we are in recession.\r\n\r\n\r\nOh, okay. That's not that long. It's not.  Yeah. I was in, uh, I was like a junior in high school when I moved here.  Where did you move to  Paducah, Kentucky, Paducah, Kentucky, middle of nowhere.  So this, like, what's your heritage?  So I'm Indian. So I'm from Hanoi in India. I was Dutch when I was about six and then we left for France when I was six, and then when I was ten we moved to Malaysia for a couple of years.\r\n\r\n\r\nAnd then I moved to the United States in 2009.  Okay, so this Indian girl, French raised, Malaysian experienced, moves to India. I don't even know. Paducah, Kentucky. Okay. Yes. What was that? What was that experience like? It was amazing. It was amazing. I would have done anything to be in the United States. Like I always wanted to be here.\r\n\r\n\r\nAnd I was like, I don't care if I live in Paducah, Kentucky or anywhere. I would have lived literally anywhere just for a chance to come to this country. I finished high school, went to college in my first year of college. I wanted to pursue entrepreneurship and the school I went to for college, they canceled their entrepreneurship program.\r\n\r\n\r\nSo I found a different school in Houston, Texas, and I transferred there to get in-state tuition with a scholarship so I could afford to go to school  and live there. Yeah. Okay. I'm going to ask a question that's going to be triggering for a lot of people, and then I'm going to explain, but I want to ask it in a triggering way.\r\n\r\n\r\nFirst, How do you speak English so well?  It's what everybody asks me. And it's really easy. I watch a lot of TV shows and I still do. So my father, I knew we were kindred spirits because my father is full blooded Ukrainian during World War II.  The Germans on their conquest came through the Ukraine and they took my grandparents back to Germany.\r\n\r\n\r\nAnd so my grandparents actually worked as teenage slaves, and this is documented. I'm not making this up for the Germans. Because all the men were fighting in the war and they were short labor. So they needed this labor. They took them back. They work in the factories. So my grandparents met in Germany. My father was born 1947 in Germany, Germany, right outside of Hamburg. \r\n\r\n\r\nAnd when he's less than one years old, he moves to Brazil, grows up in Brazil until he's 14, 15, 16 comes to the United States, lives in the United States. He was a professional soccer player.  And all of his best friends are like Latin American, but he's, so he speaks Russian, Ukrainian, Portuguese, and Spanish,  but he came here when he was, I want to say 14.\r\n\r\n\r\nYep, I was 15. And he still has an accent. It's not as thick as when I make fun of him. Like I always make fun of him. Like Nikolai, please. We'd love to make jokes about such things. He doesn't sound like that, but he's definitely the song I used to sing was descend  at D's and does. These are the words that dad can't say.\r\n\r\n\r\nSo you could still hear it when he says like, bring me this, bring me this.  But, but you, like, I don't even hear, honestly, I have a pretty good ear for it. I don't detect Any accent. So that's why I'm like, so curious how you speak English so well. When I moved to France, I was six and my parents didn't speak any French.\r\n\r\n\r\nI was like our first move outside of India. And we moved to Leon, France, which is always known for immigration. It's not Paris. It's not like, you know, one of the, and this was like back in 99, right? So I'm talking, the internet had barely come out.  Cell phones, like we used to have prepaid cards to call back home.\r\n\r\n\r\nWe had lines. This is way pre, like, all of this.  And my dad had French classes he was taking in India, because you have to know French in France. Like, you've got to know French. So, like, we move here. The winters are harsh in France. And I'm like, I don't think this is going to work for me. I was like six or seven.\r\n\r\n\r\nAnd my parents were like, You know, I understand, like, we don't have a choice, like, we have to make this work for us. Purposefully, we did not buy any sort of cable TV, like, we just had regular French streaming TV. And as a family, we would just watch French, like, news and TV shows, and we didn't understand anything.\r\n\r\n\r\nBut that's how we, like, subconsciously picked up language, and obviously we had language classes, and like, all of this other stuff.  But my parents took out everything in my life that had English, and they were like, You're going to learn French. It took me like a year and I picked it up and like,  but that's the attitude.\r\n\r\n\r\nLike a lot of immigrants come here with, like, we don't have a choice to go back.  And so you make it work and you learn to make it work. So when I moved to America, I literally, this was like when Netflix had DVDs. And so. We would watch Netflix DVDs and my parents got, they did get those boxes that used to come where you could have a Disney channel and stuff.\r\n\r\n\r\nCable, I guess. Cable boxes. Yeah. Yeah. I would just watch like the Suite Life of Zack and Cody. I'm just like, oh, what does that word mean? Or this, and like, I would just like, flash it in front of them more, and we're like, okay, this is how Americans say, like, biscuit. Or this is how they say, and then, slow, like, you know, dropping the accent and being more like, this is how English is spoken.\r\n\r\n\r\nSo if I go to London, I'm like, I hope I don't sound British and sound fake. Cause I have a habit of just being like, should I just like pick up the accent?  It's funny. So I'm not like you, I'm not an immigrant, but I am first generation. And my dad is always been around immigrants. So I have an ear for it.\r\n\r\n\r\nLike I love to hear accents and I like to mimic people. So I'm the same way. If I'm around people long enough, I'll start to kind of mimic the way that they're speaking sort of subconsciously. But all right. So  you came to the United States.  As a teenager  and you were able to execute the American dream, which is owning your own business.\r\n\r\n\r\nAnd you and your mom opened this sandwich shop.  What was the next step there? You operated that for a few years and then what, then you got into the, you bought your first rental property. No, I still have that place by the way. We're a fully wholesale company now. So we sell to like coffee shops, hospitals.\r\n\r\n\r\nSo I still have that.  Yeah, the restaurant. Yeah.  And so 2015 happened and we're working along. I get an offer from a coffee shop to become a wholesale company. And they're like, can you just supply sandwiches? And I was like, Oh, this is B2B. This is way easier than B2C. So we did that for a couple of years in 2017.\r\n\r\n\r\nLike life's pretty comfortable and I was like, I should do something else. 'cause entrepreneurs can't sit still. Right. So I went out and bought a comic shop. Don't ask why. I just did and I wanted to, well on, lemme hear, did I hear that right? A comic shop? Yeah, a comic book shop. Like literally comic books.\r\n\r\n\r\nYeah. Superman, Spider-Man, Marvel, dc I know nothing about comics. I know nothing about the world. I know nothing about. Sure. Seems natural. Of course. Yeah. Yeah. Why not?  I just went for it. But the reason I bought that comic shop is I wanted to see if I sold pre packaged Indian food in my little town. And by the way, where my restaurant is, is a small German town.\r\n\r\n\r\nSo  it's in between Austin and San Antonio. It's called New Braunfels. It has been a lot since, but it's like a really small, super cute town.  I wanted to see if I sold a pre packaged Indian food, would people buy it? That was like my trend for the Indian restaurant. Oops. And we were selling that every single night and I was like, okay, this works.\r\n\r\n\r\nSo  a year and a half later, I liquidated the comic book shop, sold everything out, took back cash  and put it in my Indian restaurant.  Like I was building up to that. And I actually  bought a food truck cause I didn't have the money to put in a hood again, this damn hoods.  Oh my gosh. Bought this food truck for 13 grand.\r\n\r\n\r\nAnd I put the food truck in behind the restaurant. So like the food gets made in the food truck and then you run it out into the rough water before sitting in.  So we do this. That's the most immigrant thing I've ever heard.  And uh, so this is October of 2019. Okay. And I'm like, why is it gray? And then March of 2020 hits.\r\n\r\n\r\nAnd my restaurant's closed. We took two weeks off and I was like, what am I going to do? And at the same time, my landlady, so in like between all of this. I told the landlady when I signed the lease for that restaurant, I was like, if you ever decide to sell, can you let me know? Like, I'm interested in buying it.\r\n\r\n\r\nAnd at that time I had a grand total of like, I don't know, like 10 grand to my name. I like no money. But I just like told her, cause I'd heard on some podcasts that you're just supposed to tell people you're interested in buying real estate. So she hits me up in March of 2020, right when everything shut down, she's like, Hey, I want to sell this and buy a place in Hawaii.\r\n\r\n\r\nAre you interested in buying?  And I was like, yes, yes. Very interested. With like no money. And I was like, okay, I'll just figure it out. Like I'll just let the universe like figure out how I'm going to buy this place.  And she gives me a price.  And while I'm trying to figure out like what am I going to do with like, where's like, how am I going to make next month's rent?\r\n\r\n\r\nTell me, hold on, hold on. How, like, what's the price? What's just like, give me, tell me what range. Like it was 40, 50, 000. Yeah. Like it was like, Oh, 450. Yeah. 450 grand. Yeah. Okay.  Yeah. It was for me. That's a lot of money. No, no, no. I thought you said 40 or 50, 000, but yeah. 450, 000. Yeah. That's a lot of money.\r\n\r\n\r\nYeah. Cause I mean, including like the real estate.  Sure.  And I'm like, okay, like how do I figure this out? How am I going to make next month's rent? And I told my mom, I was like, let's just open the restaurant. We're just you and I, because by this point in our business, we had enough team members to run the place.\r\n\r\n\r\nAnd I was like, it's COVID, we can't afford anybody. You and I, go back to the basics, we'll just run the restaurant. We crushed it in April and May when everybody was shut down, like, the joy of being in a small town or community, and I went hard in, like, all the Facebook groups. We were doing deliveries for bread, like, I was going all in. \r\n\r\n\r\nAnd at this time, I just happened to mention to my boyfriend, I was like, where am I going to find 100K to buy this place? Because if I can just put in 100K with the bank, I know they'll finance the rest, but if I can just get 20 percent now.  And he was like, I've been, like, he works corporate, and he's like, I have the money, like, we'll do it.\r\n\r\n\r\nI was like, are you serious?  And I was joking And he was like, well, I believe in it. He's like, yeah, I get to be a landlord, I'll have an LLC and your LLC pays mine. And I was like, are you serious? And he was like, where else am I ever going to get the chance to buy, like, a commercial development? Yeah. And I was, he was like, yeah.\r\n\r\n\r\nAnd then I had two other people who came in and back up and they were like, hey, if it doesn't work out with him, like, we, we're interested in helping you buy this property. So if it doesn't work out with him, like you guys break up or like, if it doesn't work out, like he doesn't put the money in,  he doesn't put the money.\r\n\r\n\r\nI probably would have broken up. \r\n\r\n\r\nYou should come by real estate together before being married. That's true.  But no, we're just dating back then. And so in America, I hear people like, you know, I'm self made and I always have a big thing. I'm not self made. Yeah. I agree. Countless people have been like literally hours of like sweat, tears, blood, and money. \r\n\r\n\r\nLet me ask you this question. This is kind of a left field question.  You are an immigrant.  You're a woman.  So you like, you came here really with no roots. And  you know, most women, they're not going into entrepreneurial fields. We see how many women are on SMB Twitter. Where did this confidence come from that you could do this? \r\n\r\n\r\nYou started the deli, then you went and bought the comic shop. Then you rolled that into an Indian restaurant. And obviously from the Indian restaurant, you've bought short term rentals and you've got a property management company  at its core. Like you're kind of just putting everything on black every time.\r\n\r\n\r\nLike you, it's not like you had any big wins and took some risk off the table. It's like each one of those wins just rolled into the next win. And I'm just like, just curious, kind of your.  Thought process. Like, where did that confidence come from that you were going to be successful?  Yeah, I think, um, a lot of immigrants come with this, like, you don't have a backup option, like in America, I think you have some level of safety net, which is amazing, right?\r\n\r\n\r\nLike you're unemployed. You can, regardless of like what you mean, people say you can go to the unemployment office and file for something. And you're probably not going to be on the road. That's not the case from like where I come, like if you don't have money, people live on the streets in India, like it's completely normal.\r\n\r\n\r\nSo when you conquer that mentality, you will learn. That, like, I can only bet on myself.  And then my parents moved us to France, and they were like, You've gotta make this work. I think I took that, and I was like, Okay, like, whatever I do, whether I succeed or fail, like, it's on me. So I have to make this work, and I'm gonna bet on myself every single time.\r\n\r\n\r\nSo I did. And the universe has a way of rewarding that, and I think this country has a way of rewarding people that take these risks over and over and over again.  I love, I love talking to immigrants. I mean, I know immigrants have a hard time because they come to this country with nothing.  But they also have this like  unquenchable  enthusiasm for this country because they're like, yeah, I know I started with nothing, but there's so much opportunity here.\r\n\r\n\r\nThere's just overly, you know, enthusiastic about it. And that's, you know, Anyways, I, so I love hearing your perspective and your story. Cause it like woven through that is just like this optimism of, well, yeah, that's what I got to do. Cause I, I got to make it work. I don't have any other option, but I have an opportunity.\r\n\r\n\r\nI was 21 when I opened my restaurant, I'm 31 now. So I was like, I'm young, like what's the worst that could happen? Like things don't work out. Right. Cool. Like I moved in with my parents after graduation. I was like, I'm going to save money and not pay rent and pay my. My deli's rent instead of like my own.\r\n\r\n\r\nI was willing to give up that. Did you ever call your deli new deli?  They should have. Is it? \r\n\r\n\r\nCome on. It wasn't pretty good. A new deli. Come on. An, an Indian themed sandwich shop. How is it not, how is there not a new deli? It's gotta be a new deli somewhere. I should name that my drive thru restaurant. That. Yeah.  Sorry. No, not at all.  I forgot what I was saying though.  I don't remember either. I just got sidetracked by my amazing idea for new Delhi and let that road show.\r\n\r\n\r\nOkay. So let me ask you this of the businesses that you have right now, uh, you have. The sandwich shop that, that kind of white labels, I don't know how to describe it, but you're selling sandwiches to you have the Indian restaurant, you have short term rentals, and then you have a, a hospitality management company, or is that the same as the short term rentals?\r\n\r\n\r\nNope. They're two different. We manage 50 short term rentals on the short term rental portfolio  and then manage about five hotels. We have about 50 doors under management on the boutique hotel side. Okay. I just bought my first hotel last month and we're under rehab on 18 units. Congratulations. Yeah.\r\n\r\n\r\nThat's amazing. How big is it? It's 18 units.  It's in North Carolina. I can't disclose where, because we're like going, we're going to like rehab. Got it. At some point you'll announce it. That's fine. Of course. Yeah. Yeah. Yeah. Once we get through like rehab and refi, I'm like, you're all the numbers.  That's it.\r\n\r\n\r\nOkay. So of those businesses, which is your favorite, like, which is the one that you're really passionate about? I like the short term rentals and the hotels management part a lot. And the reason I like it is it took me a long time to get out of the day to day for my restaurant.  The short term rentals and hotel, like right from the get go, I like got myself out of the day to day.\r\n\r\n\r\nAnd so they run without me and the restaurant now runs without me as well. But it was a huge goal of mine. I was seeing all these tech bros being like, my business is running without me. And I'm like, how do I do all of that? But like for hospitality, that was like my big, like motivator. And so I wanted a business.\r\n\r\n\r\nLike I have five core principles. Well, like I run, I want stuff to be like run by VAs. That's exactly what I want. I'm not very close to it necessarily, but like, overseas talent or talent from anywhere, including the United States, I want people to be able to work from their home. I like high cash businesses, I like To be able to net  high cash flow businesses.\r\n\r\n\r\nI like to be able to work. So hold on. What does high cash? What does high cash businesses mean? Just like high net margin.  Yeah. 89 percent kind of net margins, which is hard to run in restaurants. Like we don't run that at the restaurant by any means, but we do run a lot of that on the property management front.\r\n\r\n\r\nOkay.  I like for me to work less than 10 hours or less a week and on everything. And then the rest of the time do whatever I want. Like my definition of freedom. 10 hours.  I'm  down to two. We'll see. Tim, Tim Ferris does four. He has a four hour work week, but yeah, I guess 10 is okay. I mean,  I'm not, I don't know.\r\n\r\n\r\nMy, my definition of freedom is to do whatever I want to do whenever I want to do it, whichever I'm going to do it. And so I'm like, how do I implement these three core strategies into what I do? That's all I've been on Twitter. I see so many other solopreneurs we're doing all these cool businesses that are.\r\n\r\n\r\nAnd they have key people in place to manage each of them.  I mean, that's all, and you and I were talking about this before we got on here, but I was like, you have to resist the urge to keep tweaking things that aren't broken  just to keep yourself busy. And focus on being like, business is fine. Chill.  Go focus on your skill.\r\n\r\n\r\nI totally agree. I totally, anyways, tell me more about the property, not the property management, but the hospitality management business. You said margins were like 80 percent net. Yeah, they gave me, they gave up to 90. So the way we do it,  it's just everything we do on there is basically profit. I pay my team on it, but everything else on it is essentially profit.\r\n\r\n\r\nI don't carry any of the tech costs, all the Properties and the hotels do.  So the market is really high on it. We don't carry, we don't have any W2 people on there. Everyone is 1099 and then invoices.  It usually goes to the property owners. We don't pay for any of that. We're like a revenue management, marketing service and guest com team.\r\n\r\n\r\nSo we handle all of that for our clients. But anything beyond that, we had an incident yesterday, like one of our hotels were like, the door lock wasn't working. And they needed to call a handyman. So calling the handyman is not a cost me there. We're a virtual team. If you're going to do 5 million in top line, does that mean you're going to do 4 million in bottom line this year?\r\n\r\n\r\nI wish now. So all of that is split in between a couple of the businesses and where we invest a lot of money. Need like that much to go. And we're just now on the trajectory to do that. Yeah. I mean, still, that's the great trajectory to be on. Are you distracted? Like, is there something else you want to do after this? \r\n\r\n\r\nOh, there is. Okay. What's next?  Oh, so right now I'm focused fully on the hotel project that I, like the hotel we bought and focusing on like fixing that, getting it  where I want it to be, having it look, feel, I mean, it's like a brand new kind of thing for me, like having 18 units at one time to redo it. \r\n\r\n\r\nVery different from the short term rental world.  So I'm all in getting to understand hotels. Like we're good at the guest com or good at pricing, but. So sticking with the hospitality management business. Sorry. I moved on before I wanted to finish all my questions.  How do you acquire customers? And who are customers are for your hospitality management businesses?\r\n\r\n\r\nCustomers aren't. People coming to stay at the hotels, your customers are the hotel owners or the, or the STR owners, right? Correct. So how do you find them? How do you find good customers? This is going to sound a little cuckoo, but I'm going to throw it out there. And I've told you this before. I am not a natural born salesperson.\r\n\r\n\r\nI'm not aggressive on sales. It doesn't come naturally to me. So I have a mindset mentor and I literally visualize daily that people just come to me, ask me for business and that is exactly what happens in my world. People just find me and they're like, Hey, I have a buddy who has a hotel and they're struggling.\r\n\r\n\r\nCan you help them? And I'm like, yeah, I think so. And yeah, and so I acquired my first hotel management client like six months ago.  And then it's just grow to five properties from there. How many is it now? At five hotels under management. Okay. But like my top line revenue includes my restaurant, but there's like a bunch of other businesses underneath it.\r\n\r\n\r\nBut, and other hotel owners will just refer me to other hotel owners and go like, I know this girl, she helps manage hotels. Do you need someone? And most of my clients are real estate investors who bought hotels. So I don't typically deal with hotel owners who bought hotels. Okay. God, these are people who wanted the real estate and didn't understand what they're getting into that there's a business actually associated with it.\r\n\r\n\r\nAnd you're actually managing the business for them. Exactly. And a lot of management companies won't take on properties that are 20 units or less because there's not enough  to make big line margins on the business.  So they're like, we want to focus on the a hundred, 200 doors, which makes sense.  And I was just like, cool it.\r\n\r\n\r\nI'll pick up these little 10, 20 unit deals. We'll put in all virtual systems. There's no front desk. People just straight up check in, stay out, and we manage a full virtual team. And then we have team members on site if a guest needs anything.  Yeah. They'll look within the radius.  Yeah. So to answer your question, that is cuckoo,  that's cuckoo. \r\n\r\n\r\nI don't, I'm like, I don't know, like I don't have a, I mean, look, if you're religious, it's prayer. Like you just described prayer, right? Or if you're a millennial, you might say, I put it out to the universe and the universe answered. But it's the same type of concept. But are you planning on going through some of those, things?\r\n\r\n\r\nMore traditional sales funnels like SEO, like paid ads, like newsletters, LinkedIn, those types of things. Not for the hotel management company. And the reason is we keep our quality high on like what we do. The reason I got into it as I needed partners to buy my first deal. And so because I found these people and they're like, Hey, we want to buy a hotel.\r\n\r\n\r\nAnd they partnered by my first hotel and at the Capitol. And I wanted to show people like, Hey, I can do this for you. And that's the whole reason I got into it. I believe in less and making more. So, so you're not necessarily trying to actively grow  the property management side of things or excuse me, the hotel management.\r\n\r\n\r\nNot if we get referred business, I would love it, but we're not actively going after, and it's really, it's hard to find these people.  What do you mean?  In terms of finding a real estate owner who bought a hospitality business and doesn't realize that, like, usually I find them at conferences. That's been like a good lead gen source,  but it's not real local, local SEO or skip tracing these people.\r\n\r\n\r\nPeople talk to me about all of those things and I'm like, I might consider it later on, but if not, like, I'm good doing less than I like working 10 hours a week. That's good. I mean, you know what you want. You're trying to get to that level. And I think it's awesome to have a singular focus. Tell me  a little bit about how did you get started in the hospitality management space?\r\n\r\n\r\nDid you have to put some money in upfront in order to hire these team members? Did you do all of the work and fulfillment on the backend? Like, was there any investment in the infrastructure? Like, how did that look for the first couple of months?  Yeah. So I started with short term rentals in 2020. That's what we started buying them.\r\n\r\n\r\nAnd I was managing everything kind of myself. I had automations in place, but I was mostly doing everything myself. Did that for about two and a half years and then December 24th, 2022. So hold on. So 2020, you started buying short term rentals. How many short term rentals did you buy? How many were you managing? \r\n\r\n\r\nBuying slash partnering on six deals.  Okay. So you had six STRs  under management at the time and it was just you, or did you have a team that was managing those properties? It was just me.  Can you, I just have no idea. Can you like give me an idea of what that means? Okay. Six properties means what, 10, 000 a month in, in like revenue or is that high, low?\r\n\r\n\r\nWhere does that fall in the STR space? I hear a difference for rentals cause you have the property revenue and then you have like your management revenue.  You were buying this. It was just like me. We were in like three different States. We're in Tennessee, Texas, and Oklahoma. And so that's the reason I bought them far away from me is so I was forced to systemize.\r\n\r\n\r\nAnd if something, I just don't have to run over and fix it. Cause that's exactly what I would do. Cause I can work the restaurant world. Right. Well, I was like, I fix it,  but I didn't want that. I didn't want another job. Like I was so clear on real estate that I was like, I can't afford another job. Like I was working when I, when we bought our first short term rental, I was working about 65 hours a week in my restaurant, like we're just out of COVID labor was short, sales were through the roof.\r\n\r\n\r\nI was just land.  And Wow. So I was like, I can't afford another job. Like literally okay, there's not enough time. And so I like listened to every podcast. So one of the things, um, I would do is I delivered sandwiches for my wholesale sandwich company. So I was the delivery driver. Okay. She's Louise. Yeah. So I had two hours going from like new Brown Falls into Austin or San Antonio delivering everything and then coming back.\r\n\r\n\r\nSo it was about a four to five hour kind of car ride on, on a typical day. So I would just listen to BiggerPockets. And I would listen to every other real estate podcast I can get my hands on. And that's how I learned real estate would consume. Yeah, I was just like, okay, like, these people live far away, like, what tech stack do they use?\r\n\r\n\r\nAnd that's why I try to be as open as I can on Twitter, and I'm like, this is the tech stack we use, because I learned from someone else.  So I took all of that, found partners, and like, hustled my way to like, six units, and I was like, Life is good. I was netting, you know.  I don't know, like 10 grand, 20 grand a month.\r\n\r\n\r\nI was like, good. Like, I'm like, I'm chilling.  So can you tell me, sorry. So you, if you were netting 10 or 20 grand a month, that means you were doing 15 to 30 grand a month in revenue. Yeah. Maybe a little more of those six properties. What was the asset value and how, like you said, you had partners. Did you have to put a bunch of money in, or were you like, Hey guys, you put the money in, I'll do the sweat equity.\r\n\r\n\r\nNo, I put a little bit of money in. I wasn't majority by any means. It was usually minority.  And then I found people who are high W2 earners. And just were like, they had the cash to put down, they got the tax bonus, and this is back when a hundred percent bonus depreciation was big in real estate. Yeah. And so a lot of people were buying for bonus depreciation and we were killing it online, the cash.\r\n\r\n\r\nThat's awesome. Like it was, it was awesome. We're still doing pretty well. So you have these six, you're in Covid. You're managing these properties and then you decide  to, to start branching out and managing other people's properties? Or did you start buying more short term rentals? No.  So December 20.  For 2022 hits.\r\n\r\n\r\nAnd I'm like literally putting like ham in the oven. I'm hosting Christmas Eve dinner and we bought properties in three different states and everything since it's over. It was just like a big phrase. Oh, I remember this. Was this when the power went out in Texas and people were like burning books in their fireplaces to stay warm?\r\n\r\n\r\nYeah. I remember this. Yeah. Well, except it happened in Oklahoma and Smokies too. I see. So they happen everywhere and I'm like doing this. And again, like I'm solopreneur over here. So I'm handling everything. And I was like, I will never do this again, like ever.  And at that time we were lower on cash than I would have liked.\r\n\r\n\r\nSo I was like, I'm not going to buy any more real estate. So I stopped buying real estate in November of 21 and I didn't pick up another property for two years. I bought my one last year in 23, but I'm a very conservative investor. So. If I don't have the money, like, I'm just not gonna buy anything. And so, I was low on cash.\r\n\r\n\r\nAnd I was like, I will never do this again. Like, I will never pull a phone call. Like, this is not happening to me. So, January 16th, this Again, I'll talk about the universe. This girl reaches out to me on Facebook. And it's like, hey, I'm a virtual assistant. And I'm looking for my next date. Are you looking for someone?\r\n\r\n\r\nAnd I was like,  I am. I'm like, what's the worst that could happen?  So, I hired her.  And she, she works with me. She's my lead now. She brought in a bunch of other people under my company.  And she was like, can we go out and get more deals and grow? And that's when I started the short term rental management.\r\n\r\n\r\nAnd I had a friend approach me. He had 35 units at the time. And he was like, Hey, I'm a great sales guy, but I struggle in operations. And I was like, I can help you put systems in ops together. And so I helped build the entire backend in the ops. For all of that. And they have an office manager now, but I still consult with them. \r\n\r\n\r\nAnd that's how we grew the portfolio to that. And then in November of last year, I got into the hotel management space because I wanted to buy my own hotel. And I was like, how can I work this? Just do my own thing. And so the management kind of came about in this,  in this weird way. So.  It's been a, it's been a path we're working towards it.\r\n\r\n\r\nI love it. No, I love it. Look, I mean, look, you're obviously very smart and you understand the systems and processes, but you also have this,  I don't know, thing about you where you're very trustworthy and you know, people like you, you're genuine. You have this enthusiasm, I think because you're an immigrant.\r\n\r\n\r\nAnd,  you know, people want to see you be successful, but they also see that you're going to be successful. So let's do something together. I think you have  a lot of very interesting traits kind of swirling around. And then at the same time, you also know what enough is. You're not like, look, I'm not trying to build a hundred billion dollar company.\r\n\r\n\r\nI just want to get to a spot where I'm working 10 hours a week and my life is good and I can travel and do the things that I want to do when I want to do them with the people I want to do them with. I think that's  very attractive to many people because you know what you, anyways, it's cool. I like it.\r\n\r\n\r\nIt's very. Very cool to hear your story and sort of how you've ended up where you are. I have some rapid fire questions to close things out. You're ready. Okay, cool.  Hospitality management. Let's just stay here. What do you love about this business?  The memories we get to create for other people by far. My favorite. \r\n\r\n\r\nThat's a great answer. What do you hate?  But I guess calling me at midnight or 1 a. m. In a while, in a while, well, that is not fun. We had a guest locked down, uh, to. 30 am a couple of nights ago and my team handled it. Oh my gosh. Not fun. What industries are you most jealous of right now? The SAS companies. \r\n\r\n\r\nOkay. Any specific SAS companies or just the SAS model? That's model. It's a lot easier to raise VC back money. It's easy to hire sales crews for them. You wouldn't want to raise money.  I don't know what I want to raise money, but what I like about them is they're high cash, they're scalable. What I don't like about them is, and I think where a lot of them go wrong, is they're great on the sales front, but they're not so great on the fulfillment front.\r\n\r\n\r\nSo they try to save all this money, and you can't call support, and you have to text, and email, and do all these, I'm a millennial, but like do all these millennial things. And I'm like, dude, just get me on the phone with someone who can fix this millennial problem. Like it's a really easy  . True. But I think small companies, especially coming from the hospitality world where you're on 24 7, 365 days, every time everyone is off our business, that's when your business is pumping.\r\n\r\n\r\nI know. That's why I don't like it. Yeah. Well, when  , what stresses you out? What's, what keeps you up at night  worrying about all this will crumble tomorrow.  Okay.  That's a very, that's a very common saying, right? Yeah.  I feel you. All right. What are you obsessed with right now?  So if you had two hours in your day, no work, nothing on the calendar,  what are you doing with your time?\r\n\r\n\r\nYouTube. I'm like obsessed with YouTube right now. I'm trying to figure out how to. Make money on YouTube. I'm like, Oh, I have a whole YouTube, a whole Twitter list of YouTubers. I follow, I think it is. I'm like convinced it's the next frontier. Everyone's like crazy about Bitcoin. I don't know two things about Bitcoin.\r\n\r\n\r\nYou're crazy about YouTube. I love it. I love it. Last question. What advice would you give yourself 10 years ago?  Take more risks. I think I took a pretty good one, but I should have taken more. Cause you're, I mean, I'm married now. We're about to start a family, like life's different, but when you're young, single, and you have no money, I mean, they can't really come after you.\r\n\r\n\r\nIf things don't work out,  you're a college kid. So just take more risks. Rashmi. This was awesome. I really, yeah, I'm really, really glad we did this. Where's the best place for people to find you? I hang out on real estate, Twitter at Chai and Cabins.  Come find me. Say it one more time. Chai and what? Cabins.\r\n\r\n\r\nChai and Cabins. Chai and cabins. Okay.  All right. We'll come find you. Have a great one. Thank you guys. Appreciate it. All right. That's it. Another one for the books. I'm fired up. I don't know what else to say. I hope you found something valuable in that conversation. I hope you learned something. I hope there's something that you can apply to your business today, tomorrow, in the future that.\r\n\r\n\r\nIt makes you money. It makes you more successful. It gives you more time with your kids. If there was something I'd love to hear about it in the comments below, give me some feedback. And if you like actionable advice and you want more of this, I write a weekly newsletter that gives insights, tips, and tricks into the world of entrepreneurship.\r\n\r\n\r\nSubscribe in my bio.  And if I can help you in any way in your entrepreneurial journey, don't hesitate to reach out to me. Nick at cofounders. com. Sorry, Kelly, for, uh, for more emails. And the last thing is, remember,  curiosity is a superpower and you can use it to your advantage. As my mom used to say, there's no such thing as a dumb question. \r\n\r\n\r\nOnly dumb people.  We'll see you next time.",
  "metadata": {
    "duration": "",
    "date": "2024-07-17",
    "platform_source": "Google Drive"
  }
}