{
  "episode_number": "140",
  "episode_title": "We Debate the Value of the SBA (I Get Demolished!) with Jon Matzner",
  "guest_name": "Jon Matzner",
  "business_name": "Sagan",
  "transcript": "﻿Nikolas Hulewsky (00:00.558)\r\nAll right, welcome to our Mattsner mind. I am stoked to be with the Mattsner mind himself, John Mattsner.\r\n\r\n\r\nJon (00:06.639)\r\nYou are the inventor of that term. I would like to pretend that I made that term up, but I would say I popularized it, but you invented it.\r\n\r\n\r\nNikolas Hulewsky (00:08.589)\r\nI-\r\n\r\n\r\nNikolas Hulewsky (00:14.368)\r\nIt's so good. I don't know how that's like right there on the tip of the tongue, especially given your brand.\r\n\r\n\r\nJon (00:15.803)\r\nIt's wonderful. And it it lets me constantly mock people and and and you know, should I put this in the Matzner mind? we covered this in my mastermind last week. It's just like it's like a cue. It's like, that's an upsell in my Matzner mind. You know, you know, so it really it really aligns, Nick. It really it aligns.\r\n\r\n\r\nNikolas Hulewsky (00:37.847)\r\nIt is so good.\r\n\r\n\r\nNikolas Hulewsky (00:44.248)\r\nI think I have one or two businesses that I'm gonna see some money back from this year. I may just dedicate a portion of that money to building out mattsdermind.com. That would be so good. When's your birthday? Okay, I'll have to keep that in mind.\r\n\r\n\r\nJon (00:54.525)\r\nJust, ugh, it's... August. Yeah. I mean, just if you got a couple glamour shots of me, a little AI, you a couple puff pieces, I mean, I wouldn't be mad. I wouldn't be mad.\r\n\r\n\r\nNikolas Hulewsky (01:09.358)\r\nThe reason I love interacting with you so much is because I feel like I can have an intellectual argument with you and you're not going to get offended and I'm not going to get offended. We can disagree with each other and think the other person's wrong and I'm not going to walk away being like that freaking douche.\r\n\r\n\r\nJon (01:24.962)\r\nIt ties to it ties into what we were saying before which I was like you should record this because this is good it ties into Yeah, yeah, yeah, it ties in I mean we're about to talk about something with SBA loans, which is good But the first part was about influencers and stuff and there's nothing that makes me unhappier than when somebody's in the comment section making fun I wouldn't say making fun of like with animosity attacking Hormozi and I'm like, okay\r\n\r\n\r\nNikolas Hulewsky (01:31.096)\r\nWe're recording by the way.\r\n\r\n\r\nJon (01:54.459)\r\nHe wears a tank top and a nose strip. You don't need to make things up.\r\n\r\n\r\nHe has a camera crew following him around with a varsity letter jacket on that says acquisitions.com. You don't need to make fake things up. Just tease him. Just there's so much, right? You don't need to be like the sec bro. This guy's, this guy's worthless and has never helped a person in his life. And he's selling. I'm like my brother in Jesus, you like\r\n\r\n\r\nNikolas Hulewsky (02:11.758)\r\nThere's enough material there.\r\n\r\n\r\nJon (02:28.403)\r\nYou don't need to make things up, just satirize and make fun of and keep your powder dry for the real criminals. Don't say Nick Huber is a criminal. He's not a criminal. I might try to say he's a bad businessman. He's not actually a bad businessman. But like, I just mean, don't say, Nick, man, a fraud. He's not a fraud. He's not a fraud. Stop saying that.\r\n\r\n\r\nNikolas Hulewsky (02:51.15)\r\nIt's like the last five years when everybody's a Nazi. Like, everybody's a Nazi. Everything's violence. It diminishes. Like, my great grandparents were killed in the Holocaust.\r\n\r\n\r\nJon (02:54.429)\r\nCorrect, exactly. Everything's violence. Everything's violence. It's like, yeah.\r\n\r\n\r\nJon (03:02.855)\r\nYeah, my two. Yeah, yeah, like my, let's see. I would say my great uncles and aunts, my great grandpa made it out. Yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (03:05.055)\r\nreally? Yeah.\r\n\r\n\r\nNikolas Hulewsky (03:10.274)\r\nSame thing, like your family, right? And it's like, no, those were Nazis. Like those are the Nazis, right?\r\n\r\n\r\nJon (03:13.917)\r\nCorrect. Correct. A guy selling a worthless info product is not a Nazi. He's he's worthy of our satire. Let's tease him. Let's make fun of him. Let's attack his business model. But let's not say he's Bernie Madoff. He's not pretty made off. He sells a useless info product. All right. Let's all just let him you know.\r\n\r\n\r\nNikolas Hulewsky (03:18.946)\r\nYeah, yeah,\r\n\r\n\r\nNikolas Hulewsky (03:36.014)\r\nDude, and the thing I love about your brand is just how you go relentlessly. You are relentless. You're a dog with a bone, dude, and you'd never give it up. It's like Nick Huber posts something about his personal jet or his family or whatever. It's like, there's John. John's like up in the comments, oh, this is interesting. Did you pay for that with the 35 % fee that you charge people? Oh, that's fascinating. I just got the cease and desist letter.\r\n\r\n\r\nfrom a large competitor. I love how you like block out the names on it. And if anybody reads through it, it's so obviously fabricated. It's so good. It's like, people don't read it. it's so good.\r\n\r\n\r\nJon (04:10.515)\r\nBut people don't read it. It's like how should I handle it? That's the that's the joke. That's the joke. I did one about responding to tariffs. Did you see that one?\r\n\r\n\r\nNikolas Hulewsky (04:18.712)\r\nThe tariff one was so good.\r\n\r\n\r\nJon (04:20.547)\r\nI just cut and paste it. what it what it ties into, too, as we talk about using social media, I said this to somebody. But my dad taught me this, which is, you know, Nick, think of a great ad and you think of a great ad and you go, what was the company that ran the ad? You're like, I don't remember. You're like bad ad. Meaning if I'm just stirring the pot to stir the pot, I'm just chasing likes and followers and who cares. But if I'm stirring the pot, making an inside joke about Cookie Monster,\r\n\r\n\r\nWhy is John Post about the Cookie Monster? because he eats influencer. that's on fucking message and it drives the right type of attention. making it, it's not, I'm gonna say Nick Huber's a fraud, cause he's a fraud. It's like, no man, it's breaking his balls about being, great margins and how I live in a, you know, I'm doing house hacking cause my margins aren't that good. Like that's the joke.\r\n\r\n\r\nNikolas Hulewsky (05:13.23)\r\nDude, what's been great about your brand is I think it was 90 % planned and probably 10 % luck, but I'm going to say the vast majority of it was planned. You built up this brand of making fun of people who were taking themselves too seriously as gurus. And you said to me, this was probably a year and a half ago when you're like, I'm saving my capital, essentially your social media capital for when you have a business to actually promote. And so when you went all in on Sagan,\r\n\r\n\r\nnot only had you built this brand of attacking influencers, Sagan was the perfect business to launch, to attack influencers because influencers had launched these businesses. Do you know what I mean? So it's like, just tied beautifully into your brand and you can continue to market the business while at the same time taking full advantage of your personality, which people love. And so I think you've done that just the right way and it's you, it's authentic. It's like, that's why I think you're seeing so much success with Sagan. It's the Ikagi. I don't ever know how to say that.\r\n\r\n\r\nJon (06:07.889)\r\nYeah, I was gonna say it's the thing, it's the best businesses are reflections of the founders themselves. And like if anybody else could start it, keep going. And if you think about like, so what's your go to market? I just kind of like, I kind of like tease people who take themselves seriously, but it's about of operational efficiency business model that takes inspiration from Amazon Prime. Like nobody, like.\r\n\r\n\r\nLike you're on an acid trip right now if you try to describe the actual business and the journey, but it works.\r\n\r\n\r\nNikolas Hulewsky (06:40.834)\r\nYeah, and because you stay on message and you have the one thing that you're harping on, there's a lot of momentum. The flywheel builds up. Anyways, this has been cool. It's been really cool.\r\n\r\n\r\nJon (06:52.103)\r\nI've been blown. I've been, dude, I've been blown away by the inbound that I get who, and again, not I am not everybody's cup of tea. And like I said, you know, when you join the LDS temple, you say be nice to everybody and play board games. So like there's probably some LDS guy there who's like, I wouldn't go, John, but he he's a little bit too, you know, aggressive. But in equal number, I also have like hilariously affluent people who\r\n\r\n\r\nJohn, I gotta tell you, man, you'd kill me on Twitter. I log in just to see you make fun of these guys who we all know are full of shit. And by the way, can you work in our port co. Cause we have like 400 locations of a DSO and we need call center. You know, it's like, so it's the, who's the guy, the health nut guy who says, if you're not upsetting people, you need to have like pointier opinions. And I don't know if I fully buy that, but Brian Johnson.\r\n\r\n\r\nNikolas Hulewsky (07:44.622)\r\nI don't know.\r\n\r\n\r\nNikolas Hulewsky (07:48.11)\r\nOh, yeah, yeah, Brian Johnson, okay.\r\n\r\n\r\nJon (07:49.767)\r\nYeah, and it's I don't 100 % agree with that because but do you? Yeah, but you don't do it. Dude, you don't do it.\r\n\r\n\r\nNikolas Hulewsky (07:55.736)\r\nI agree with it. I was going to say I'm pretty milk toast, right? And I've gotten to the point now where I'm like, yeah, if I wanted to grow a lot and have a huge audience, I would need to stake out harder positions.\r\n\r\n\r\nJon (08:09.693)\r\nBut is that, my question would be, is that you? Are there things where you'd feel comfortable? There might be though, like being an advocate for the SBA loan program. Like there could, like, or, you know, taking care of senior citizens in a respectful way and you pick an enemy and you name it and you, you pro, it's not the same version of my, you know, dyspeptic nature. It's your own version of it.\r\n\r\n\r\nNikolas Hulewsky (08:18.316)\r\nYeah, yeah, that could be something.\r\n\r\n\r\nNikolas Hulewsky (08:28.59)\r\nThat's true.\r\n\r\n\r\nJon (08:36.211)\r\nYou know, so it's not like art. You don't copy my playbook. You find your own. You're like, I hate people who don't have any kids because I have goddamn 78 like or whatever. You're 79 or got the 78 wives or 78. I always lose track. Wives or kids or is it?\r\n\r\n\r\nNikolas Hulewsky (08:44.942)\r\n79, 79, but yeah.\r\n\r\n\r\nNikolas Hulewsky (08:50.648)\r\nLook, I've had this discussion before with people and I'm not gonna say the full story, but I would not do well in polygamy. Like I can hardly handle one woman, I can only imagine what it'd be like to have two women in the house. Like I'm not talking about the carnal nature of man. That's a different story. But like the logistically handling the household, no thank you. They would eat me alive.\r\n\r\n\r\nJon (09:02.355)\r\nYou\r\n\r\n\r\nJon (09:12.359)\r\nYeah, yeah, the logistical nature of Yeah.\r\n\r\n\r\nJon (09:19.015)\r\nYeah. Yeah, it's the thing that you have to understand when I make that comment, Nick, is that it is not based in reality. It's based in me giving you a hard time. so so so so to be very specific, I'm to get a lot of mileage out of it. Every time we talk, the numbers going to go up. I'm going to I'm going to start naming them. I'm going to you know what mean? I'm going to talk about sister wives. It's going to be a whole it's going to be a whole there might be a backstory at some point, you know.\r\n\r\n\r\nNikolas Hulewsky (09:20.597)\r\nI would eat me alive.\r\n\r\n\r\nNikolas Hulewsky (09:29.432)\r\nI'm out.\r\n\r\n\r\nNikolas Hulewsky (09:34.51)\r\nPerfect.\r\n\r\n\r\nNikolas Hulewsky (09:40.152)\r\nPlease do. They deserve it.\r\n\r\n\r\nNikolas Hulewsky (09:47.278)\r\nyou\r\n\r\n\r\nJon (09:48.549)\r\nSo just so we're clear.\r\n\r\n\r\nNikolas Hulewsky (09:49.678)\r\nTo tie the bow on this influencer thing, for me, it was about a year ago when I learned this stat, 50 % of every dollar raised by venture capital is spent on Google and Meta. And it's spent acquiring customers because they need to get their message out. They need get people to actually use their product. And so when I look at these influencers who have built distribution and you can...\r\n\r\n\r\nJon (10:02.259)\r\nI want to talk about this.\r\n\r\n\r\nNikolas Hulewsky (10:17.17)\r\nmaybe not call it that, but that's what it is. These followers are distribution.\r\n\r\n\r\nJon (10:19.611)\r\nIt's attention. I would call it attention, not distribution.\r\n\r\n\r\nNikolas Hulewsky (10:22.434)\r\nOkay, they've built an attention machine. They have effectively hacked their way past needing to raise money from VC. They own now the distribution channel and it's so freaking valuable. How valuable is it? People will give up 80 % of their company and spend 50 % of the money they raise in order to acquire customers so they can go get VC money in order to grow. that's how valuable distribution is. So I look at these influencers and I'm like, wow, they've done something really cool that I...\r\n\r\n\r\nhaven't done and I don't think I could do the way that they've done it.\r\n\r\n\r\nJon (10:53.553)\r\nYou have. You have.\r\n\r\n\r\nNikolas Hulewsky (10:56.428)\r\nI mean, we're talking about on this. Yeah, on a microscale.\r\n\r\n\r\nJon (10:57.275)\r\nWhy are we talking? Why are you and I talking?\r\n\r\n\r\nBut you don't need a macro scale.\r\n\r\n\r\nNikolas Hulewsky (11:05.038)\r\nTrue, yes, true.\r\n\r\n\r\nJon (11:06.503)\r\nYou're not trying to fucking Mr. Beast candy bars. You're trying to get a couple off-market healthcare deals done in the next 10 years.\r\n\r\n\r\nNikolas Hulewsky (11:10.974)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (11:15.446)\r\nThat is exactly right. I think there's a different strata. There are people who want to grow an audience because that becomes their business. Gary Vaynerchuk is one of them. Alex Hormozi kind of becomes one of them. Cody Sanchez is, I know she's buying businesses, but media is her business. And then there are people who John Wilson comes to mind or Brian Beers or you, they have an audience and it's like, yeah, yeah, but I'm just talking about my business and hey, I don't care if I have a niche audience, it's making me a million bucks a year. Cool. I'm good with it.\r\n\r\n\r\nJon (11:17.607)\r\nYeah, yeah, yeah.\r\n\r\n\r\nJon (11:29.65)\r\nYes.\r\n\r\n\r\nJon (11:33.683)\r\ncorrect, or me.\r\n\r\n\r\nNikolas Hulewsky (11:45.004)\r\nSo I think there are different levels to it.\r\n\r\n\r\nJon (11:47.763)\r\nI know this wasn't on the docket for today, but I want to talk about this because I talk about this with Peter Lohan all the time because I have some new opinions about this. I've been talking to a lot of people lately and my new pitch these days and I'll give you a data point and then I'm going to tell you what I think the implications are. The data point is I know somebody who runs a small community in a niche business, right? A Matstrom behind a few, exactly.\r\n\r\n\r\nNikolas Hulewsky (12:12.366)\r\nA Matzner mind if you will. Yeah.\r\n\r\n\r\nJon (12:17.075)\r\nSo good. And a couple hundred participants. The CEO of a publicly traded software company said, I would like to fly every one of your people out to our corporate headquarters, put them up at the nicest hotel in town and give you all a tour of our facility.\r\n\r\n\r\nNikolas Hulewsky (12:36.704)\r\nWow. Is he a member of the community?\r\n\r\n\r\nJon (12:37.414)\r\nWhy?\r\n\r\n\r\nJon (12:40.765)\r\nBut he's trying to target the business owners in that community because they're all growing business, right? So I believe when I look at the democratization of software development, when the cost to develop niche software tools evaporates, when I look at global talent, when I look at a lot of these different things, when I think where is the value gonna accumulate, to me it is in the high affluence community builders.\r\n\r\n\r\nNikolas Hulewsky (12:43.992)\r\nYeah. Yeah.\r\n\r\n\r\nJon (13:07.951)\r\nIt's not the attention big million post followers. It's the guy who's like the hundred and eighty best CPAs in the country are all in my circle of influence and I can point them at a software tool. I can point them at an event. I can point them at. And so when I think about where I think a lot of this value is going to accumulate where the acquisition targets are. Dude I have a little community of every health care operator who's under the age of 70 who has more than\r\n\r\n\r\nNikolas Hulewsky (13:23.981)\r\nEh.\r\n\r\n\r\nJon (13:37.113)\r\nX number of beds. That is more valuable than saying, have some poopy sass that serves the healthcare community because you not only have distribution, you also have influence and affluence to point. What's the hard part? It's the, what? I don't know. Dude, I don't know what I'm saying.\r\n\r\n\r\nNikolas Hulewsky (13:51.096)\r\nDid you just coin that? Influence and affluence? John, John, that's very good. Like I may have to cut this out just so you can like trademark it.\r\n\r\n\r\nJon (14:00.559)\r\nNo, don't believe—no, that's AI. That was AI. That was AI.\r\n\r\n\r\nNikolas Hulewsky (14:02.798)\r\nI'm dead serious, I'm dead serious. Like if that's your framework, hey, I'm building communities. I focus on two things, influence and affluence. Like that is a framework. That's a framework.\r\n\r\n\r\nJon (14:10.739)\r\nBut that is true, but that is, but what I mean is, what I mean is, you know that these people are growing, they've self-selected by participating in the community, you know they have dollars to spend, that is more valuable. Like, who's more important, you with your Twitter growth group or tool number 87 to help you pre-schedule your Twitter posts using a GPT wrapper? Fucking Nick, Nick is way more valuable than schmucky, you know.\r\n\r\n\r\nbootstrapped SaaS number 87 that helps you write AI conflict. Because Nick can be like, guys, this is the tool that's the best. Nick can go buy one and push it into your group. You are in a position of leverage as the taste maker. And that's where I think all this value is going to accumulate. It's not the developers anymore. It's not the technical co-founder.\r\n\r\n\r\nNikolas Hulewsky (14:48.908)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (14:57.037)\r\ninteresting.\r\n\r\n\r\nNikolas Hulewsky (15:01.954)\r\nWell, this is funny. This wasn't on the bucket at all. mean, know, Chamath from the All In podcast, he has this fund that he started called, I think it's called 9010, 8020, 9010. I always get it wrong. Anyways, the thesis behind it is 90 % of the functionality with 10 % of the cost. So he's going after Salesforce, these large ERPs. he's, yeah, it's the same thesis that you have, right? And he's like, our devs can build it and not only can they build it, they can build it better for you because they can actually make it customizable. So.\r\n\r\n\r\nJon (15:04.529)\r\nYeah, I know. But yeah.\r\n\r\n\r\nJon (15:28.605)\r\nHow's he distribute it? How's he distribute it though? That's my question.\r\n\r\n\r\nNikolas Hulewsky (15:32.265)\r\nI don't know. I don't know.\r\n\r\n\r\nJon (15:33.555)\r\nHe goes to these people. So why am I gonna go to the community influencers, the vertical, they're gonna, he builds a tool that does some Twitter, know, Grammarly, right? And he wants to start attacking Grammarly. What's he gonna do? He's gonna go to Nick and say, Nick, you've got 250 entrepreneurs who I know like to write. Nick is in the driver's seat, notch him off.\r\n\r\n\r\nNikolas Hulewsky (15:37.262)\r\nWhat do you these people?\r\n\r\n\r\nNikolas Hulewsky (15:41.929)\r\nI got it. Yeah.\r\n\r\n\r\nNikolas Hulewsky (16:01.742)\r\nThat was going to be what I was going to say is that I think a lot of people are talking about AI. Hold on a second.\r\n\r\n\r\nJon (16:08.583)\r\nYeah, kids. Fix it in post.\r\n\r\n\r\nNikolas Hulewsky (16:12.92)\r\nHello sir, hey, hey, what's up dude? I'm on a call, wanna say hi to John? Say hi John. Hi John. I'm gonna put you out here.\r\n\r\n\r\nJon (16:19.313)\r\nBye.\r\n\r\n\r\nNikolas Hulewsky (16:30.119)\r\nI love that kid. like, think.\r\n\r\n\r\nJon (16:34.759)\r\nMy wife's 35 weeks today. Both babies are healthy. Yeah, got twins coming. One boy, one girl.\r\n\r\n\r\nNikolas Hulewsky (16:38.84)\r\nDude, congratulations, boys, girls, mix. That's what I am. I was born with a sister. Anyways, I think that people are making a big deal about AI, which they should be making a big deal about AI. But I think one of the only defensible modes will be an audience for distribution.\r\n\r\n\r\nJon (16:59.823)\r\nNot but it's not what I think you have to go one level past that because there's been people who've been like, I'm just going to scoop up some YouTube channels and pointed at different monetization. It has to be it has to be a lined audience that you can drive buying decisions around that views you as an authority. It's not it's it's not I have a big listserv and the CPM is low because it's an underpriced channel. It's not that.\r\n\r\n\r\nNikolas Hulewsky (17:18.454)\r\nAn authority. That's it.\r\n\r\n\r\nNikolas Hulewsky (17:25.87)\r\nauthority, influence, and affluence. We're building a list here.\r\n\r\n\r\nJon (17:29.477)\r\nIt's not, it's not, I have a big list serve and the CPM's low, right? But that's what people, originally there was attention arb, where the CPMs on newsletters were lower than clicks on PPC or what, but now I don't think that that works for the, especially for B2B. Like for, and I'll give you a specific example in my business. We've done some stuff with people who have got huge audience, whatever, never works. And then I go to somebody who like,\r\n\r\n\r\nNikolas Hulewsky (17:34.177)\r\nNo.\r\n\r\n\r\nJon (17:57.469)\r\nbuilds Excel databases for business owners who like super wonky and niche and the only people would ever, it's called like how to set up your CRM correctly to scale to 10 service tax. And you sponsor that guy, that guy's going to get you more sales than 10 million, then Mr. Beast. That's what we figured out. Cause nobody watches Mr. Beast. Nobody.\r\n\r\n\r\nNikolas Hulewsky (18:21.72)\r\nThen Mr. Beast, that's true. Your target audience isn't watching Mr. Beast.\r\n\r\n\r\nJon (18:26.119)\r\nThey're watching the guide about how to set up your service Titan to add more techs.\r\n\r\n\r\nNikolas Hulewsky (18:30.158)\r\nDude, when I started my podcast in June of this year, I was getting like, I don't know, a couple hundred downloads a month. I had one guest come on and his business has tripled. Now, tripling from $250 to $750 a year. Yes, that was a low basis. I wouldn't be surprised if Hector. Oh gosh. Good for him, man.\r\n\r\n\r\nJon (18:47.539)\r\nYou talk about Hector?\r\n\r\n\r\nHector's smoking because of your pod. I talked to Hector. He joined Sagan. Yeah, he joined Sagan. Yeah.\r\n\r\n\r\nNikolas Hulewsky (18:57.898)\r\nNo, I'm not even talking about Hector. I'm talking about Buddy Rathmull, who has a Google My Business profile business. Great business. And I'm like, holy crap. That was just from my stupid audience of people. Not stupid, sorry. That's not what I meant. Not you, fellow listener.\r\n\r\n\r\nJon (19:11.143)\r\nBut it's, but it's not you, not you, not you listener.\r\n\r\n\r\nJon (19:17.991)\r\nBut I wanna make sure that you, cause you were talking about me talking to your group, cause this is my message too, which is if you want a lot of followers, say you're gonna give away a free iPhone and run ads in India, and you'll have a million followers in 30 days, and you're not gonna be able to sell one t-shirt. But if you're talking about weird, niche shit that applies to your ICP,\r\n\r\n\r\nyou're going to have a level and a relationship to drive purchasing decisions that is just head and shoulders different than the guy who writes the same Filipino rage bait tweet hoping to get more views for their\r\n\r\n\r\nNikolas Hulewsky (19:53.326)\r\nAnd this is why how long have you been on Twitter playing this game? Two years? Okay. I started really having a Twitter about a year ago. And honestly, it took me about a year to figure out what I'm doing. This is why as we were texting the other day, I'm going back into healthcare because I'm like, why did I ever position away from that? That's one of my core areas of expertise. I can niche down on that probably better than anybody that I know currently on Twitter. Why would I go away from that? I tried to be like abroad.\r\n\r\n\r\nJon (19:56.531)\r\nTwo years? Two years? Three years?\r\n\r\n\r\nNikolas Hulewsky (20:22.926)\r\nI buy and small businesses, which is true, I do. But healthcare really was where my bread and butter was. And I came to the realization, it's like, I would much rather be well known than, or excuse me, known well than well known. Like that I'm not concerned with being known by a million people. If 50,000 people know me, which is still a freaking ton of people, but they're the right people, that's way more valuable to me than a million people who hit like every once in a while. Yeah.\r\n\r\n\r\nJon (20:46.279)\r\nThat's my point, who joined to learn how to go from zero to $10,000 in three days. Those people aren't, those aren't the people you wanna get to know.\r\n\r\n\r\nNikolas Hulewsky (20:57.462)\r\nEasily gained, easily lost is the way that I like to think about it.\r\n\r\n\r\nJon (21:01.533)\r\nAnd that's, in closing, before we move on, that's why to me, the pod format has, I really like, because I'm not looking to huge top of funnel whatever, I'm looking to get the guy who's gonna buy us at 15 turns of earnings to listen to 10 episodes and be like, this is exactly the company we wanna buy. One listener, one listener!\r\n\r\n\r\nNikolas Hulewsky (21:23.886)\r\nDude, we'll probably lose people who are like, okay, cool, you guys are patting yourselves on the back. that's the reason I, that's why I have carpal tunnel, are you kidding me? Podcast is such an intimate way to get to know somebody. They're in your ears, you're looking at them. Other than meeting you face to face and spending time with you, this is the best medium. So one podcast is like 400 Twitter posts.\r\n\r\n\r\nJon (21:33.107)\r\nThat's all I do. Do they, have they ever heard me talk before?\r\n\r\n\r\nGod\r\n\r\n\r\nNikolas Hulewsky (21:53.486)\r\nwhat I mean? And that's why I love it so much because they can hear me. They can hear the nuance, the way it's delivered. Within five seconds, they're like, oh, this guy's trustworthy. Or, oh, this guy's full of crap. That's why I love it so much.\r\n\r\n\r\nJon (22:05.075)\r\nThis guy's obviously looking for his next wife. That would've been my thought. When I hear you talk, I'm like, number 67. He's very, you know.\r\n\r\n\r\nNikolas Hulewsky (22:07.692)\r\nYeah, yeah. Absolutely.\r\n\r\n\r\nI mean, look, if you're not looking for your next wife, what are you doing?\r\n\r\n\r\nJon (22:17.331)\r\nDo they kick you out? I'll tell you a funny story and then we'll go to our final topic. A guy DM'd me and goes, hey man, just joined Sagan, going great, you guys hired us a couple of people. You should promote your podcast more on Twitter because reading your Twitter, you come off like an arrogant dick, but you're actually like pretty interesting when you talk. I was like, thanks? But it's like, ah.\r\n\r\n\r\nNikolas Hulewsky (22:39.65)\r\nDude, this is a quick aside. I hired some VAs to help cross post to all the other platforms. And so they took my posts and they started posting the threads. And what they did was they just looked at the highest ranking posts that I ever had, like most views. And like five out of seven of them were troll posts, right?\r\n\r\n\r\nJon (22:57.777)\r\nYeah, like mine today. I got one that's doing four million right now.\r\n\r\n\r\nNikolas Hulewsky (23:01.262)\r\nOkay, but for you to do a troll post on Twitter, most people know you in some capacity and they're gonna be like, oh yeah, I know how he meant this. You go to threads and do that. People are like this freaking douche bag. Are you freaking kidding? People hated me, dude. People, yeah, I had to like, I got rid of the VAs and I was like, all right, no, no, no, no, no. We gotta like start over. It's taken me like two months to basically get rid of all that crap. But because to your point, people don't know how to take it. They just.\r\n\r\n\r\nJon (23:15.217)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (23:29.076)\r\nread one thing and if they haven't built trust with you, they're automatically going to assume the worst.\r\n\r\n\r\nJon (23:34.139)\r\nAnd I'm also a little bit, by my own definition, I am oftentimes a dick. I mean, I pick on people who are nice guys who I compete with, and that is not a nice thing to do. And I'm sorry, and then somebody hears me talk about it, and I'm like, he's doing it on purpose, he doesn't actually hate these people, he's just stirring the pot, because it creates a conversation. Okay, cool. So.\r\n\r\n\r\nNikolas Hulewsky (23:53.176)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (23:58.254)\r\nWell, it's the same thing. You know, I saw some SBA posts recently. And for whatever, for whatever reason, I don't know why people are freaking out. Maybe I should be freaking out more. I'm not. They think the 7A pro\r\n\r\n\r\nJon (24:02.131)\r\nYeah, that's what we're going to talk about today. Yeah.\r\n\r\n\r\nJon (24:09.683)\r\nDude, they're not gonna get rid of the S. They're not gonna touch it. No.\r\n\r\n\r\nNikolas Hulewsky (24:12.598)\r\nLike, okay, Elon Musk tweeted about how much fraud there was in the SBA. He's talking about PPP loans. Like, that's where 95 % of this fraud is coming from, whatever. Anyways, I've been seeing some posts. I saw one of your posts last night that was like, we don't need the SBA. Time out. Give me one second. Hold on.\r\n\r\n\r\nJon (24:28.763)\r\nNo, no, no.\r\n\r\n\r\nNikolas Hulewsky (24:45.358)\r\nIt's gonna be you're just gonna hear my kids in the background this whole podcast. Sorry. We'll do it live.\r\n\r\n\r\nJon (24:48.189)\r\nFix it and post.\r\n\r\n\r\nWell, fuck it. But but I can say that part. But sorry. All right. Break. Break. I want to make sure that because it ties into the beginning of our conversation that you understand what I wrote. Part of what I wrote is also going after the influencers who will remain unnamed, which was what if the greatest wealth transfer in history is from.\r\n\r\n\r\nNikolas Hulewsky (25:00.174)\r\nOkay, good.\r\n\r\n\r\nNikolas Hulewsky (25:17.902)\r\nMm-hmm.\r\n\r\n\r\nJon (25:18.899)\r\ntaxpayer-backed SBA loans to aging boomers on subscale not transferable businesses. That was what I originally wrote and part of it was me making fun of the 1874 thousandth post called have you heard about the thing called the gray wave from a M &A guy or a broker or an influencer who's trying to sell you a course. So to be clear, I was not nihilistic. I was merely flicking boogers at the\r\n\r\n\r\nNikolas Hulewsky (25:25.74)\r\ngood framing. Yeah.\r\n\r\n\r\nNikolas Hulewsky (25:45.069)\r\nNo.\r\n\r\n\r\nJon (25:48.847)\r\nThe greatest wealth trade, I don't even know if that's true. It just bothers me at this point. Yeah, who's great, by the way? Who I think is great. Yeah.\r\n\r\n\r\nNikolas Hulewsky (25:53.238)\r\nNo, I saw you get into it with Heather. And she's fantastic. And I assumed, I was like, he just like, I know you like to argue. I like to argue as well. And when she comes back and is like, this isn't true at all, I knew you were going to hit back twice as hard because this is your strategy.\r\n\r\n\r\nJon (26:11.219)\r\nSo did she by the way, so did she she said that she's like I knew you had something ready to go But but I will say I want to frame it a little bit though I will say that it's important to understand first and foremost. I need to give my disclaimers I Would take an SPA loan I think Heather's a good person. I think you're not a bad person if you take an SPA loan. I think You know like I I'm not angry with you if you\r\n\r\n\r\nNikolas Hulewsky (26:17.262)\r\nIt was so good. It was so good. So yeah, do it.\r\n\r\n\r\nJon (26:39.451)\r\nSell a business, buy a business, do et, like, I just want to get all those disclaimers, like, out of the way. This is not a vindictive whatever. Comma, we were talking, again, I'm a small government guy flirting with libertarianism, talking about the merits of the government being involved in this type of activity, which is the basis of my disagreement. So I just want to frame that up front. I'm not like this nihilistic, like,\r\n\r\n\r\nYou all are scammers if you sell an SBA, buy an SBA, use an SBA. And it has benefit, right? That is not the argument I'm making.\r\n\r\n\r\nNikolas Hulewsky (27:14.402)\r\nYeah, it was, I think the thing I was surprised at, and this wasn't your post, I can't remember his name, but he was like, the SBA is a subsidy for boomers. And that was the post where I was like, no, we can. I'm gonna give you my side of the Yeah.\r\n\r\n\r\nJon (27:28.531)\r\nMay I make that argument? Okay. Okay. Well, wait, wait, wait. Before you make your side, what is the topic we're discussing here? Because we gotta do like a good old fashioned debate thing. What is the proposition that we're discussing? It's not, do they ever do good? It's not, are they always bad? It's what's...\r\n\r\n\r\nNikolas Hulewsky (27:39.053)\r\nI think we-\r\n\r\n\r\nOkay, okay. I think this is the proposition. Is the SBA inflating? Is that what I wanna argue about? Is the SBA subsidizing? Partially, yeah, but also like, is it subsidizing boomers?\r\n\r\n\r\nJon (27:52.389)\r\nNo, you don't want argue that. That's no, that's a bad argument. You don't want argue that.\r\n\r\n\r\nJon (27:58.331)\r\nYou want to say is it a force for good? You want to say it's a force for good in the US?\r\n\r\n\r\nJon (28:04.859)\r\nOkay, fine. I think that's an easier point for me to argue. So thank you. Great, okay.\r\n\r\n\r\nNikolas Hulewsky (28:07.808)\r\nfine. And then more broadly, is it a force for good? So anyway, so I saw that post. And frankly, I like the fact that so many people right now, like there's been this massive swing. I like what Doge is doing. I get that people are going to be irritated by what they're putting out there and they're probably going put out a bunch of stupid stuff. But I also think they're kind of blowing it up and people want to see stuff get blown up and they want to see where the waste has been, right? And so understandably, the Eye of Sauron\r\n\r\n\r\nJon (28:13.563)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (28:37.902)\r\nturns to the SBA. It's going to be on every one of these departments at some point or another. I think it's good. I think it's good to scrutinize. However, that being said, I don't think it's fair to characterize it as just a subsidy for boomers.\r\n\r\n\r\nJon (28:54.833)\r\nWait, you changed your argument. Not just a subsidy, the premise was, is it a subsidy for boomers? Not just a, we must be precise here, Mr. Nick. It's not just a subsidy, it's a subsidy for boomers. Okay, keep going.\r\n\r\n\r\nNikolas Hulewsky (28:57.208)\r\nWhat? OK.\r\n\r\n\r\nNikolas Hulewsky (29:04.513)\r\nOkay, cool.\r\n\r\n\r\nWell, when you are just framing it as a subsidy for boomers, right? If your post is, I'm not saying you did this, the one that set me off was the SBA is just a subsidy for boomers, right? When you're just framing it as that, that's where I'm like, that's not fair. So for me, as I'm looking at this, I have bought and sold multiple businesses and I've bought and sold through the SBA. I think it's a great program. And then when I saw, you and I kind of get into an exchange,\r\n\r\n\r\nJon (29:19.366)\r\nOkay. Okay.\r\n\r\n\r\nI wouldn't argue that.\r\n\r\n\r\nNikolas Hulewsky (29:36.806)\r\nI thought it would be fun to actually have this conversation. So let me just say my experience and then we will start getting into the debate. I found a business off market in 2020. Great business. There were multiple people circling it. They wanted to buy the business. I could not have purchased this business without an SBA loan. I went to the seller. I was able to convince her to sell to me. She sold for a lower price than these other buyers were willing to pay and I was able to purchase the business.\r\n\r\n\r\nI told that story as a way to say, look, the SBA is not subsidizing boomers, it's subsidizing people like me. And that's really the intent of the program to subsidize people like me who want to become entrepreneurs and buy a business and have opportunities for economic mobility within the United States. That's how I view the SBA. I do view it as a good program. think that the thrust and the point of the SBA is to give people like me an opportunity to buy a business. And that is the point I was trying to articulate. All right.\r\n\r\n\r\nTell me why I'm stupid.\r\n\r\n\r\nJon (30:38.899)\r\nI mean, you live in Idaho and you used to live in California. You drive a minivan. You seem like you wear dad jeans. You have to be more specific. Do you mean on this topic? I mean, feel like you, I mean, how much time we, you know, is Riverside going to boot us out at some point? How much time? You can't just open a gate like that and expect me not to walk through it. Sure.\r\n\r\n\r\nNikolas Hulewsky (30:40.523)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (30:47.054)\r\nI do. I do. No, keep going. my gosh, keep going.\r\n\r\n\r\nNikolas Hulewsky (30:57.624)\r\nBut here's, I guess here's the first question. Is it fair for me to characterize it as saying, I would not have bought this business without the SBA?\r\n\r\n\r\nJon (31:06.629)\r\nIf your statement is Nick would not have bought this business without the SBA, I would say probably correct. Yeah. Yeah. Is it fair to say that without the SBA, Nick would have found a way to be an entrepreneur. It comes out of his ears, his eyes, his nose. He would have if not this and maybe it wouldn't have been as quickly. Maybe it would have been in a different form or function, but.\r\n\r\n\r\nIs was the SBA the difference between you being an entrepreneur and not? I'm more just asking. Yeah, OK. I don't think that's a controversial statement. Yeah. OK. I have to do the John thing, which is esoteric, whatever. Right. That is, you know, that's why it's what's what puts people in the seats. Got to the people what they want. To me, this is this is ultimately a question of political philosophy, which is\r\n\r\n\r\nNikolas Hulewsky (31:40.719)\r\nno. No, don't think, I don't think it is. No.\r\n\r\n\r\nNikolas Hulewsky (32:04.014)\r\nHa!\r\n\r\n\r\nJon (32:04.207)\r\nWhat is the appropriate role of the government? I'm not arguing that the SBA does good. I'm not arguing that it's not a net zero fee program or whatever people are saying. I'm not arguing that it helps create liquidity in the subscale small business market. I'm not arguing any of that. I'm arguing that based on the principles of small government and freedom and my particular\r\n\r\n\r\nbroadly call them anti-federalist opinions, right? Small, liberal, 19th century free market. Is this an appropriate function of the government? And I would say no. And my rule is, and I think I put it in the comments, which was, I believe, again, this is my political philosophy, other people disagree, that if I'm holding a gun and I hold it up to your neighbor and say, would I use that gun to stop you from murdering someone?\r\n\r\n\r\nYes. Would I use that to enforce a contract? Yes. Would I use that as much as I love public libraries, which were near and dear to my heart and I wouldn't be half the man I was today. Would I say, Nick, I'm going to pull this trigger unless you fund a public library for my kids. I'm not okay with that. And there are other ways to have libraries built. There are other ways to get kids excited about reading. But unless I'm willing to pull that trigger,\r\n\r\n\r\nI don't believe it's an appropriate use of the government. does not mean I think reading sucks. That does not mean I hate librarians. That does not mean that I don't ever go to libraries that are paid for with taxes. It just means in according to my political beliefs, the use of force is ultimately somebody shows up to my door and takes my shit with a gun. And unless I'm willing to hold a gun up and say, you must subsidize Nick's below market rate to acquire this business with a gun.\r\n\r\n\r\nI don't think it's okay. So that's my long and esoteric answer.\r\n\r\n\r\nNikolas Hulewsky (34:03.918)\r\nYeah. No, and when I forgot you said that. To me, we are arguing about degrees of separation. We're on the same road. You just decided to take an earlier exit than I did. We're not taking different paths here. Because I would say all taxation is theft then. I know, I know, but no matter.\r\n\r\n\r\nJon (34:23.623)\r\nThat's my point. And so I'm only willing to steal for law enforcement, for courts, for national defense.\r\n\r\n\r\nNikolas Hulewsky (34:31.074)\r\nYeah, and what I am saying is, okay, you've decided that your line is there, right? We all vote on these things and we have representatives in government who can go and change the laws. The SBA wasn't just an executive order. It was something that was created by our representatives who we voted for. And if we want to change it, we can vote them in and out to change that law. But it's something that as a society, we came together and we said, we think this is a net good, let's go ahead and enact it. And I would say it is a net good.\r\n\r\n\r\nLet me ask you this. Do you think that the SBA has been a net benefit to society or a net drag?\r\n\r\n\r\nJon (35:07.281)\r\nI can't let your last statement go unchallenged.\r\n\r\n\r\nNikolas Hulewsky (35:09.44)\r\nOkay, go ahead. What's my last one?\r\n\r\n\r\nJon (35:12.979)\r\n99.99 % of people would say, would have a vote, every representative, not everyone, but large, many of them, most citizens would vote to take Jeff Bezos' money.\r\n\r\n\r\nJon (35:30.545)\r\nYes, because the only person who loses is Jeff Bezos. The fundamentals...\r\n\r\n\r\nNikolas Hulewsky (35:34.858)\r\nI almost tweeted this. I almost, hold on, hold on. I almost tweeted this this weekend. How dirty you think the inside pole handle is of a bathroom tells me your view of the world. You think that the inside pole handle of a bathroom is filthy and disgusting because you don't have faith in humanity and nobody washes their hands.\r\n\r\n\r\nJon (35:53.913)\r\nNot in groups. Individuals I do, not in groups.\r\n\r\n\r\nNikolas Hulewsky (35:56.686)\r\nI just I don't I wouldn't vote to take Jeff Bezos money. You just said 99.99 % of people would take Jeff Bezos money.\r\n\r\n\r\nJon (35:59.243)\r\nBut wait, let me finish my point. Wait, I didn't finish my point. I didn't finish my point. No, cannot finish. Fine. Then say more than 51%. Whatever. The basis of the society, and again, this shows my anti-federalist beliefs, is rights protection, not democracy. Rights protection. And to me, I don't care if everyone says, everyone but, you know,\r\n\r\n\r\nNikolas Hulewsky (36:07.406)\r\nOkay, keep going.\r\n\r\n\r\nJon (36:26.735)\r\nI'm the one gay guy in Tuscaloosa and everybody in town says fuck that gay guy. Sorry. You know, we. Yeah. Fix it. Fix it. Fix it. it in post. Yeah. Fix it in post. Right. But what I mean is there is a certain sense sense of inalienable pregovernmental rights that regardless of the votes of even a majority of the people, they are inalienable.\r\n\r\n\r\nNikolas Hulewsky (36:37.39)\r\nI think he'd be pretty happy about that. Fix it and post it.\r\n\r\n\r\nJon (36:54.713)\r\nrights protection, I believe, is the basis of the US, not democracy. That's why, again, anti-federalists, they insisted on the Bill of Rights, right? I believe that taxation and property is a pre-governmental right. And so I don't care if everybody in town says, let's give Bobby a loan or not give him a loan. I don't care. It's a right for you. And one guy says, I don't want to do it.\r\n\r\n\r\nThat is rights. The beauty of the US to me is rights protection and property, i.e. nobody's going to show up at my house and take my my car if I don't pay taxes is a pregovernmental right that has an insanely high bar to go in and steal someone's property to pay for something else. So that is my my core. is not about voting and elective rep. You know, everybody in the South didn't want to let the black kids in school either. Right.\r\n\r\n\r\nNikolas Hulewsky (37:52.814)\r\nWell, mean, yeah, I would say if you want to talk about inalienable rights, the pursuit of happiness is one of those things. The other inalienable, agreed. And if you want to say property, I think the business ownership is property. You own that. yeah. So for me, the government, yeah.\r\n\r\n\r\nJon (38:00.999)\r\nYes, if it doesn't come at the expense of other people.\r\n\r\n\r\nJon (38:12.723)\r\nI'm tracking. Okay, I'm tracking. Good.\r\n\r\n\r\nHow is that connected to me taking someone else's dollars to help Nick buy a business? I'm stealing Beth's property to help Nick.\r\n\r\n\r\nNikolas Hulewsky (38:25.506)\r\nSo I can't convince you to say, no, we should have no other government except for law enforcement. And what's the other thing?\r\n\r\n\r\nJon (38:35.249)\r\nIt's pretty limited. I'm not an anarchist, right? Contract enforcement, national defense, law enforcement. mean, there's some managing externalities, right? There's a couple. Correct. Correct. I like the University of Chicago, if you can't tell. I like the libertarians. Yes.\r\n\r\n\r\nNikolas Hulewsky (38:43.458)\r\nYeah, yeah. We can play the Milton Friedman clip where they start asking him. Yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (38:52.354)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (38:56.674)\r\nSo like I'm good with that as well. What I'm saying is, if I, let's say there's a group of us and there's 10 of us and we come together and we say, it's actually better for us to pull our resources to give John an opportunity to buy a business because I believe in John. And I believe that whoever the central authority is that makes the decisions in order to fund John is good. I'm okay with that. That's what I am.\r\n\r\n\r\nJon (39:12.221)\r\nYep. Yep.\r\n\r\n\r\nYep.\r\n\r\n\r\nJon (39:20.237)\r\nIs it a voluntary association? If it's voluntary, absolutely. If it's involuntary at the point of a gun, different. Can I opt out? Can I say, nah, I'm good. No thanks. Then I have an issue with it. If it's voluntary, then I'm fine with it.\r\n\r\n\r\nNikolas Hulewsky (39:28.851)\r\nwhat? No.\r\n\r\n\r\nNikolas Hulewsky (39:37.87)\r\nIf you volunteered to be a part of it, if you voted for it and you said yes, and then it comes to the point where it doesn't work unless everybody's all on the same page and contributing to it, and then you decide to opt out, that's where the issue becomes. And it's like, okay, well then let's get all of us to get together again and vote on this. And if we want to end this subsidy, great, we can end the subsidy. But if one person is pulling out and it causes everything to lose focus. Anyways, so.\r\n\r\n\r\nJon (39:46.705)\r\nYeah, I mean, yeah.\r\n\r\n\r\nJon (40:00.359)\r\nYeah, correct.\r\n\r\n\r\nNikolas Hulewsky (40:04.062)\r\nI'm okay with people getting together and I do think that making that bet on John becomes a net benefit to that community. The other thing that I think that it does is there are two reasons why the United States is the world superpower. We can argue about where it is on par with China, but just\r\n\r\n\r\nJon (40:20.563)\r\nYou know you're not going to be able to, you know, just be careful because you know I'm going to like pick apart your reason, right? Because by you listing certain reasons that lends itself to a certain premise. So just be prepared. I'm going to poke at your reasons.\r\n\r\n\r\nNikolas Hulewsky (40:32.174)\r\nOkay, do you agree or disagree with me that the United States is a superpower? Okay. I think that there are two reasons the United States is a superpower. First reason is militarily. Like you can't, we have the strongest military in the world. Okay. Any disagreements? Okay. The second reason is because of the United States dollar. I mean, there's,\r\n\r\n\r\nJon (40:35.965)\r\nAgree.\r\n\r\n\r\nJon (40:52.046)\r\nno.\r\n\r\n\r\nJon (40:58.589)\r\nSure. Strengthen the dollar. Reserve currency of the world. Yep.\r\n\r\n\r\nNikolas Hulewsky (41:02.474)\r\nthe reserve currency of the world. So if we want to implement sanctions on a country, guess what? We can't because they're trading in dollars. mean, the barrels of oil are still primarily traded in dollars. There's been some movement to try to get away from that, et cetera. So I think that the United States economy is actually a national defense for us as well. making sure that we have… Yeah.\r\n\r\n\r\nJon (41:22.739)\r\nIt's our str- it's our str- good. I'm- I don't- I might nitpick your wording, but yeah, close enough, good.\r\n\r\n\r\nNikolas Hulewsky (41:29.432)\r\nSo in that vein, where you're willing to, at the point of a gun, give your money to somebody for national defense, I am saying I think national defense and economic supremacy are almost neck and neck. I'm okay with giving up at the point of a gun to make sure that we sustain economic supremacy. If that means that.\r\n\r\n\r\nJon (41:50.107)\r\nOkay, but but here but here's my question. What here's my question. What is the driver of? Economic supremacy is it? government subsidization or is it the free market provided with a robust court system and free and voluntary transactions that Created the behemoth that we are now benefits of is it central planning was it a poll at Bureau was it taxation and redistribution?\r\n\r\n\r\nNikolas Hulewsky (42:14.094)\r\nCan I ask you a question? Early 20th century, what did we have? What did the economy look like?\r\n\r\n\r\nJon (42:23.259)\r\nEarly 20th, I always have to do the math on this. On what axes? Yeah. I got into a tariff fight with Pomp a week ago talking about hot smoothly. But again, I'm intellectually consistent on this. This isn't like some, you know, so, okay.\r\n\r\n\r\nNikolas Hulewsky (42:26.75)\r\n1900s, early 1900s, late 1800s, early 1900s. had an ex... That was pretty funny. That was pretty great.\r\n\r\n\r\nNikolas Hulewsky (42:41.282)\r\nI know you are. We had wealth centralized. In the history of the world, we had probably the richest man who ever lived in John D. Rockefeller because of monopolies. What did the government do? The government came in, broke up the monopolies. How do you feel about the government coming in and breaking up those monopolies?\r\n\r\n\r\nJon (42:58.237)\r\nBroadly speaking, monopolies form because of crony capitalism and favorable legislation that emanates from crony capitalism that locks monopolies in place through regulation, licensing, granting of railroad rights in the freaking Delta. Natural monopolies are generally speaking, fairly few and far between. But with the help of crony capitalism,\r\n\r\n\r\nNikolas Hulewsky (43:24.238)\r\nSo you said it. Yeah. So you're hitting for me, that's the point. Like you're hitting the nail on the head. Locks in, locks in. I know you said locks in. You stupid. Locks in.\r\n\r\n\r\nJon (43:31.263)\r\nI've pretty much been doing that this whole conversation. So I don't know. OK. I why I feel like I've been on I've been on the nail the whole. No, sorry. Go ahead.\r\n\r\n\r\nNikolas Hulewsky (43:44.706)\r\nThe government can lock in monopolies, but it does not create them. I have to choose my words here because it does create monopolies and regulates them. But in their formation, let's talk about the railroads, for example. They ended up getting locked in because John, they had grown, who was over the railroads? that, I don't know who it was.\r\n\r\n\r\nJon (43:47.635)\r\ncorrect?\r\n\r\n\r\nJon (43:54.067)\r\nYeah.\r\n\r\n\r\nJon (44:11.389)\r\nDude, we're gonna push the limits of my early 20th century railroad history.\r\n\r\n\r\nNikolas Hulewsky (44:14.796)\r\nLet's drop that. The point that I'm making is they get to a point where they're big enough to then buy off the politicians to then codify their place as a monopoly. Okay. So do I think that the economy and for the general working class person like myself was as good of an opportunity in the early 19th century, early 20th century as it is today? No. Do I think that there's as much potential economic mobility outside of moving?\r\n\r\n\r\nJon (44:23.335)\r\nYeah, correct.\r\n\r\n\r\nNikolas Hulewsky (44:42.754)\r\nto the far west because there wasn't an established state governance, whatever you want to call it. Like you could go out and be a first mover essentially, moving to California, having the gold rush, going to Utah, et cetera. In those places where there was already an established history, it was not as, you weren't as mobile back then as you are today. Disagree or agree?\r\n\r\n\r\nJon (45:06.289)\r\nOkay, your point, your premise was, I know it's hard because you have to be deliberate with your words, but it's hard to do that on the fly. You're saying that economic mobility has increased over the last 100 years. I would agree with that. And I think I would agree with that. And I would say...\r\n\r\n\r\nNikolas Hulewsky (45:23.212)\r\nYeah. Yeah. And we have gotten more regulation during that time is what I'm saying. I'm not arguing for more regulation.\r\n\r\n\r\nJon (45:30.963)\r\nWe also have less we also have less pirates. Correlative not causative. We have to look for causal relationships, not correlative relationships. We also have pirates. you didn't you see that chart that was in the it's a website. I got to go dig it up where you can look at any two variables and the graphs will chart perfectly. It's like number of TSA agents in Iowa and senators named Steve.\r\n\r\n\r\nNikolas Hulewsky (45:40.462)\r\nI don't understand what the pirates have to do with this.\r\n\r\n\r\nNikolas Hulewsky (45:55.65)\r\nReally?\r\n\r\n\r\nJon (46:00.421)\r\nAnd they're like exactly the same number. And you can pick like all these random charts. And the whole thing is correlation isn't causation. Like left handed, you know, fortune 100 CEOs and rivers that experienced floods east of Tuscaloosa. And it's like, wait, so flooding rivers caused left handed fortune 100 CEOs. It's like, no, it's correlative. And so what I would argue is we have to search for causation.\r\n\r\n\r\nNikolas Hulewsky (46:04.3)\r\nThat's incredible, no.\r\n\r\n\r\nJon (46:30.355)\r\nAnd I would make the case that the free market is increasing economic mobility despite government interventions. If you look at a comparative analysis of other economies, other rising countries, and when we get away from free market principles, it hampers us. Like, OK, why do you think health care costs have exploded? Talking to a health care entrepreneur.\r\n\r\n\r\nNikolas Hulewsky (46:52.888)\r\nWhy do I think that they've exploded? Because of government intervention.\r\n\r\n\r\nJon (46:54.183)\r\nYeah. Yeah. Okay. Good. Correct. Why do you think? Yeah. So there you go. Fiend. End of the podcast. Right. But whereas flat screen TVs in quality and cost have collapsed. Why? Why? Why are these two things? Shouldn't we our prices be going down? The instruments are less expensive. We have more precision machining. have, you know, why can a cash\r\n\r\n\r\nSurgery facility replace an ACL for eight hundred and eighty dollars. Do you ever do you listen to econ talk? It's one of my favorite podcasts They did a great episode with a guy who runs a cash facility for surgeries and he's like a small government guy like me and literally like the cash price to replace an ACL is like eight hundred and eighty five dollars He pays the surgeon 350 bucks. The disposables are like a hundred dollars They get you out in the afternoon. There's no you know, like\r\n\r\n\r\nNikolas Hulewsky (47:28.11)\r\nHmm\r\n\r\n\r\nNikolas Hulewsky (47:43.886)\r\nGeez Louise.\r\n\r\n\r\nJon (47:50.491)\r\nLike, and it's about this free market approach to providing health services. It's fascinating. Yeah, you should look it up. There's a great episode on\r\n\r\n\r\nNikolas Hulewsky (47:55.158)\r\nWow.\r\n\r\n\r\nWell, I can't argue the counterfactual because we don't know what would have actually happened. We have ins...\r\n\r\n\r\nJon (48:00.891)\r\nYeah, yeah, yeah. But you can argue on a comparative basis. You can look at other countries.\r\n\r\n\r\nNikolas Hulewsky (48:08.558)\r\nOkay, go on.\r\n\r\n\r\nJon (48:09.041)\r\nYou can even look at states. Look at states that have a minimum wage law versus states that don't. That have a more free market orientation versus those that are a little bit more regulatory. I would look at those as the cases for, again, I'm talking my own book here. I'm a small government guy, right?\r\n\r\n\r\nNikolas Hulewsky (48:29.876)\r\ncan talk your own book. The problem is when you go back and you look over the course of history, let's just say over the last 100 years in the United States.\r\n\r\n\r\nIf you call the counterfactual, which we can't actually look at and say, no, it succeeded in spite of it, and then dismiss all of the things that we've seen, in my opinion, address a lot of systemic issues like Glass-Steagall in the 1930s, like repealing a lot of these protectionist policies that were first implemented and then actually repealed. You talked about tariffs. I don't believe in tariffs either.\r\n\r\n\r\nI think that if there is a spectrum that you can be on, we can be in the middle. We can walk and chew gum at the same time. I'm not advocating for communism, but I'm also not saying the only thing that I want the government taking care of is the military, because then we just kind of live in a bunch of fiefdoms. We just have a bunch of a rogue state that really has no laws. There's no anarchy. There's nothing that we can actually compare against to live a quality of life. Agree or disagree?\r\n\r\n\r\nJon (49:34.587)\r\nYou want I worked in the government and there is nothing that will make you more of a small government person than working inside the government It's what happened with Thomas Sowell Thomas Sowell Thomas Sowell Thomas Sowell was a socialist and then he went and worked in the Department of Labor for a summer and he came out as the freaking most Chicago school economist all time. He tells a story in his book\r\n\r\n\r\nNikolas Hulewsky (49:42.958)\r\nI am a smog.\r\n\r\n\r\nNikolas Hulewsky (49:57.134)\r\nThat's why I take issue with the SBA is the SBA is not a run like a traditional government organization where here's the funding, go and give this to people who want to buy businesses. The SBA funding is done through banks who have to go through their own underwriting process. I'm not saying, no, no, stop, stop. I'm not saying that they're not backstopped. What I'm saying is that these are not government bureaucrats who are making decisions on where the money goes.\r\n\r\n\r\nJon (50:14.941)\r\nBut they're backstopped. If I backstop something, it changes the underwriting.\r\n\r\n\r\nJon (50:26.501)\r\nOkay, that's, I would say that's better than them doing that, but it is still, in my opinion, an inappropriate use. Yeah. Sure, yeah.\r\n\r\n\r\nNikolas Hulewsky (50:33.036)\r\nYeah, that's that's what I'm saying on the continuum of things. think it's a much better if the government is going to be there for something and you want to argue to me that, it should be there to fund these individuals who would not be able to get funding elsewhere, then they should do that. To like to the original point, I would have still gotten into entrepreneurship, but I would not have been able to buy this business without the SBA. if you say it again.\r\n\r\n\r\nJon (50:56.541)\r\nWere you qualified to buy that business? Were you qualified to buy that business?\r\n\r\n\r\nNikolas Hulewsky (51:01.75)\r\nYes, I had the skills to buy that business.\r\n\r\n\r\nJon (51:03.549)\r\nthen why couldn't you go to a private lender or equity?\r\n\r\n\r\nNikolas Hulewsky (51:08.742)\r\nSo this is now the spectrum, I think. I could have. It would have just significantly changed the deal. They would have taken the majority of the upside. I would have gotten maybe 20 % of the upside.\r\n\r\n\r\nJon (51:19.879)\r\nthat is that is that so you used you used the SBA because you're a greedy bastard Nick you didn't want to go to ruthless entrepreneurs so you had to convince with voluntary exchange so you went to Betty the mail person's tax dollars and said subsidize my loan because I want to own more of this company that doesn't feel very noble to me\r\n\r\n\r\nNikolas Hulewsky (51:26.52)\r\nYep, that's absolutely correct.\r\n\r\n\r\nNikolas Hulewsky (51:42.784)\r\ndoes it not feel like? I mean, the framing is obviously not very noble. I know if I'm going from a place of no leverage and I'm going to put a personal guarantee, which they would still have required. Even if I went and did it private, I'm going to have to sign a personal guarantee. And I'm only going to get 20 % of the upside after a certain return. It reduces the incentive for me to go and do that. I wouldn't have done that business.\r\n\r\n\r\nJon (51:45.555)\r\nI'm just stirring the pot a bit, you know.\r\n\r\n\r\nJon (52:00.765)\r\nSure. Sure.\r\n\r\n\r\nJon (52:10.723)\r\nJust like in the great financial crisis doing jumbo loans for shitty FICO score people because everybody said owning a home is the American dream\r\n\r\n\r\nNikolas Hulewsky (52:18.542)\r\nYeah, but my point is this wasn't, this was not a jumbo loan. This was a good business. The point that I'm making is could I have done another business? Sure. It would have been much harder for me. There would have been more barriers for me to have the economic mobility that I have achieved today. Okay. So if you grant that premise, that's my point is it allows for more economic mobility.\r\n\r\n\r\nJon (52:30.931)\r\nSure. Sure. Okay.\r\n\r\n\r\nJon (52:39.391)\r\nI wouldn't, I wouldn't, I don't, I would call that a I have no comment on that comment. Meaning, okay, sure. Keep going. I'll grant you that premise. It made you, if you didn't have access to the SBA, you would be less economically mobile. Sure, I'll grant that premise. Keep going.\r\n\r\n\r\nNikolas Hulewsky (52:57.314)\r\nYeah, that's one of my core premises is that the SBA allows for more economic mobility.\r\n\r\n\r\nJon (53:04.164)\r\nAgain, I would say on an individual basis Sure, fine. Okay. Keep going\r\n\r\n\r\nNikolas Hulewsky (53:10.382)\r\nBut not generally.\r\n\r\n\r\nJon (53:13.029)\r\nI would say it's an inappropriate, you know, again, the political philosophy that I come from is the bar to\r\n\r\n\r\nNikolas Hulewsky (53:18.552)\r\nNo, no, get the inappropriate. I could have sworn in the comment you were like, I don't think that it actually does allow for economic mobility.\r\n\r\n\r\nJon (53:27.663)\r\nI wouldn't written that.\r\n\r\n\r\nI mean, I wouldn't have written that. I would, I, there was maybe other arguments. You can pull it up when I said.\r\n\r\n\r\nNikolas Hulewsky (53:36.782)\r\nI'm gonna look.\r\n\r\n\r\nJon (53:37.287)\r\nI would have said if it's such a net zero organization, why isn't a private sector alternative emerged? That would be one comment I would have asked. If it really is truly.\r\n\r\n\r\nJon (53:49.715)\r\nIt's dangerous to scroll through my feed, Nick. I don't even know what's in there. I don't look backwards.\r\n\r\n\r\nNikolas Hulewsky (53:51.8)\r\nI know I'm like, geez, Louise, how much do you freaking tweet? All right, I'm not gonna get that. Go there. I'm gonna say you won this one. I'm gonna say you won the one. I'll just chalk it up. You won this argument.\r\n\r\n\r\nJon (53:57.075)\r\nI would just I I think It's and this is good, know, and then let's do one last thing and then I gotta go take care of my kid\r\n\r\n\r\nNikolas Hulewsky (54:08.386)\r\nYeah, same.\r\n\r\n\r\nJon (54:11.409)\r\nI would just say, you know, there's a debate within the small government circles about directionalism versus destinationalism. Meaning, should we try to make the SBA more free market? Or should we sit here and say, why the F is the government helping to backstop loans? And it's actually an important debate, which is, should we be trying to fight for more free market mechanisms within Fannie Mae and the Department of Education? Or should we say, why the F?\r\n\r\n\r\nIs the government at the federal level involved in education? And there's not an easy answer to that. It's actually an important debate, right? So I am coming out with what I would call a destination list perspective, which is why the F does the SBA even exist? But if you say, do I think the SBA is going to get banned tomorrow? I think it's no. But would I, you know, want to move towards more free market mechanisms existing within the SBA where\r\n\r\n\r\nlenders compete on the loans and they're forced to buy insurance and, you know, yada, you know, they only match the best price of a private lender, but they still match it like, sure, that's a directional is saying, look, I want to move more towards this. But do I really think the SBA is going to get nuked? As much as I'd like to have a melee come in and do, where are where are where are that's not gonna happen.\r\n\r\n\r\nNikolas Hulewsky (55:32.482)\r\nOne of the greatest pieces of video of all time. I agree, I agree that it's not going to happen. I think for me, if I were to stack order rank where I think the most fraud or waste is happening within government, the SBA is not even in the top quartile. Yeah, so for me, that's why I'm like, why are we even talking about the SBA?\r\n\r\n\r\nJon (55:48.881)\r\nNo. Agree? Yeah. Dude, the Pentagon lost like hundred billion dollars like last year. Doesn't even know where they put it. Yeah.\r\n\r\n\r\nBecause, because for me, when I think about it, I want someone to see that post and be like, huh, huh, interesting, because it happened to me. I first heard like, wait, should the government even be doing this? And it opened my eyes to an entire view of political philosophy that I found very intellectually.\r\n\r\n\r\nNikolas Hulewsky (56:16.974)\r\nIf you have, let's just say, the ability to focus only on 100 things in a day, or 100%, let's do it on a percentage basis, 100 % of your time is able to be focused, and you could focus that directionalism on reforming the Pentagon or looking at the SBA. Why point them at the SBA?\r\n\r\n\r\nJon (56:37.587)\r\nCan I disclose something with what I would actually do? I'd sell info products.\r\n\r\n\r\nI mean, the ability. OK, I do courses, I do masterminds, I do live events. No, you're right. Yeah, sure. If I have a finite amount of resources, I would not pick a fight with the SBA, probably. I don't think I would. I'm not sure. But at this direction, the 500 million in SBA 7A loans that go to experienced entrepreneurs\r\n\r\n\r\nNikolas Hulewsky (56:46.702)\r\nOkay.\r\n\r\n\r\nAgreed. Agreed. The ability to scale with info products is amazing. Is amazing. No, the point that I'm making is I get your argument. I'm not saying.\r\n\r\n\r\nNikolas Hulewsky (57:07.842)\r\nIt's\r\n\r\n\r\nJon (57:13.959)\r\nbuying businesses in a sector they're qualified in, that is about 97 on the list of 100 of shit that's fucked up with our government.\r\n\r\n\r\nNikolas Hulewsky (57:21.676)\r\nIt's like the house is burning and we're like, I really don't like the roses you planted. Like, okay, yeah, the roses suck. we put the fire out? But I want you to know directionally, hey, directionally, we need to change these roses. Like, okay, we'll get to the roses. Can we put the fire out?\r\n\r\n\r\nJon (57:30.973)\r\nAgain, if you're making me look, yeah.\r\n\r\n\r\nJon (57:37.413)\r\nNo, no, no, you confuse them. Directionally, you need to put out the fire. Destinationally, why the fuck is there a fire? Why is there a fire? Why is the house on fire? Why are we even here? Right? Yeah, you flipped them. You flipped them. Yeah.\r\n\r\n\r\nNikolas Hulewsky (57:45.848)\r\nOkay, I flipped him. I flipped him. right. But that's how I feel about this argument is like, okay, we're all going to get esoteric about the SBA.\r\n\r\n\r\nJon (57:54.355)\r\nIf you said, you, you, first of all, throwing the word esoteric at me is like throwing the word, you know, 74 kids to you, right?\r\n\r\n\r\nNikolas Hulewsky (58:02.894)\r\ndon't know what it means.\r\n\r\n\r\nJon (58:08.147)\r\nknow what esoteric means. The point I mean, though, is, a lot of what I like to write about is, look, I'm not the administrator. I'm not Elon Musk who has a magic wand to focus on three priorities in the next year when he still has the goodwill of the president. I am an internet commenter trying to at least create the intellectual space potentially\r\n\r\n\r\nNikolas Hulewsky (58:09.464)\r\nHahaha!\r\n\r\n\r\nJon (58:36.603)\r\nin someone who at least goes, huh. It's not, I'm not forced to choose. I get to be, you know.\r\n\r\n\r\nNikolas Hulewsky (58:43.8)\r\nYeah, I agree with you. I'm not saying you shouldn't have commented on that. I'm talking about generally speaking, you see people focusing on certain things like they're hot topics at any given time within society. Why are we even talking about the SBA? There's a million other things that are higher on that priority list.\r\n\r\n\r\nJon (59:01.715)\r\nI would struggle if you concede, I wouldn't say concede, but you ended by essentially saying, I agree, but it's not the top of the list. We can end on that.\r\n\r\n\r\nNikolas Hulewsky (59:14.882)\r\nNo, the problem is about two minutes into us talking, was like, I agree with, like John and I have the same opinion. And so then I was like forced to be defending something that I'm like, don't actually feel, cause I agree with you. It's like, yeah, should government be in that? No. But is that the highest priority? No, that's a bad pot. That's a bad pot. And really what just happened is you freaking wiped the floor with me. Cause I ended up trying to figure out a way to argue something that.\r\n\r\n\r\nJon (59:33.201)\r\nYeah. But that's bad pod. But that's bad pod. That's bad pod.\r\n\r\n\r\nNikolas Hulewsky (59:43.618)\r\nI didn't really feel that strongly about. it's hard for me to see when people get distracted by things that just aren't as important.\r\n\r\n\r\nJon (59:50.131)\r\nIf you want if you wanted to say John will you sign this pledge that says the government should do a hundred things before it goes after the SBA I'd I'd be the first thing I'd John Hancock that thing right that is not the You know the big the big signature at the bottom of the what Declaration of Independence. Yeah fix it post tighten it up anything else before Yeah, wait, I think you should end with saying contents lame unless you're building something\r\n\r\n\r\nNikolas Hulewsky (01:00:06.129)\r\nWe'll edit this in post. We'll edit this in post. It'll be tighter. No, it was great. It was great. Yes.\r\n\r\n\r\nDude, content is freaking lame unless you're building something. Because you're sitting there and you're like, well, what am going to post today? What could I write about? Stupid. It's so stupid. Go do something cool and write about it. That's what content should be.\r\n\r\n\r\nJon (01:00:27.373)\r\nYou, you, Nick, I don't want to read you interview and watch you interview an entrepreneur, but I want to hear you talk to someone about your decision to get back in the game. I would watch that. I would not watch how to get $64. But you, even now with your decision about getting back in, what have you learned about what type of opportunity you want to pursue? I want to watch that.\r\n\r\n\r\nI don't want to watch you interviewing the guy, the dropshipper talking about how it's the opportunity to century. I have no, I have no desire for that. But even right now with your decision to get back in the game, how are you thinking about raising money? Who are you going to go to? How'd you meet the people you're going to go to? How do you know this opportunity is big enough? How do know you want to go back in healthcare? Like that's what I want to hear from you.\r\n\r\n\r\nNikolas Hulewsky (01:01:17.518)\r\nThe is the reason I do the podcast is because I'm interested in those conversations. And I know that if I'm not doing something that I'm interested in, I'm not going to do it long term.\r\n\r\n\r\nJon (01:01:21.331)\r\nWell, that's different,\r\n\r\n\r\nJon (01:01:25.169)\r\nYou're not interested. You don't find I find I like the dialectic so much. I find I learn by talking and debating. And so when I have something I'm working on, which is Nick, should you raise from one investor or multiple investors and you get somebody smart on you're like one investor is easier because it's one big check. But then you work for them. But a bunch of smaller tickets, there's a little bit of upkeep, but no one person has a voice. So you get a deck. You're not screwed.\r\n\r\n\r\nNikolas Hulewsky (01:01:34.147)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (01:01:53.836)\r\nneed to get better at it. I don't like talking about myself. That's not exactly correct. I just have so much more interest hearing from somebody else and then debating an idea than talking about specifically something that I'm necessarily doing. Because I don't think people would find it interesting. I'm like, people aren't going to care.\r\n\r\n\r\nJon (01:02:09.651)\r\nYou need to go on that journey because I think you're leaving a lot on the table. You're going a lot on the table by not... We'll end on this. There's this book that I love that I advocate to everybody called The Gift of Therapy and it's by this guy named Erwin Yalom, who's one of my favorite authors, who's an existential psychotherapist. And he talks about being a fellow traveler. And...\r\n\r\n\r\nHe says historically therapists were this removed character where they could run sessions for three years and nobody knew a thing about them and nobody knew anything about them and they were the consummate professional and they showed up and they facilitated the group discussion. went home and nobody even knew their last name. Sorry, their first name I should say if it's a doctor and modern impactful psychotherapy. These therapist is on their own journey and that's what makes them effective, which is it's not Nick saying I know the meaning of life.\r\n\r\n\r\nI'm gonna teach you, it's dude, I'm working on this shit too. I am super nervous about getting back into healthcare because of litigation risk because I got sued once so bad, I was worried I might lose my house. And dude, I look confident, fuck, I'm terrified about getting back on a cap table of a healthcare company. It's not good technique to be a black box, it's bad technique. So that's my motivational message to you, it's bad technique. I wanna hear from Nick.\r\n\r\n\r\nNikolas Hulewsky (01:03:34.094)\r\nOkay. I love it. I love them. I love it. Done. Let's do it.",
  "metadata": {
    "duration": "",
    "date": "2025-03-31",
    "platform_source": "Google Drive"
  }
}