{
  "episode_number": "223",
  "episode_title": "How He Paid Off a $2M SBA Loan in 24 Months with Garth Fasano",
  "guest_name": "Garth Fasano",
  "business_name": "Rainmaker",
  "transcript": "﻿Garth Fasano (00:00.135)\r\nWe need a stronger community for the post-closed search entrepreneur. and it's not EO, it's not YPO. I don't have firsthand experience. I did go through the EO process. They accepted me. I just felt like those, it's different when you're investors money versus like your entire life is on the line, everything you've built. And so I think that soon,\r\n\r\n\r\nNikolas Hulewsky (00:04.515)\r\nTotally agree.\r\n\r\n\r\nNikolas Hulewsky (00:15.608)\r\ncircle jerk.\r\n\r\n\r\nDude.\r\n\r\n\r\nNikolas Hulewsky (00:22.54)\r\nYeah.\r\n\r\n\r\nGarth Fasano (00:27.835)\r\nThere needs to be a version of that for the search community and the sort of small business accurate community.\r\n\r\n\r\nNikolas Hulewsky (00:33.196)\r\nWell, tell me, this is probably not gonna get, well, it's not probably, it's not gonna get released unless there's something in here that I'm like, this is gold, so don't worry. What did you hear about Tribe? I wanna know why did it suck? Because our churn is really low, we're growing.\r\n\r\n\r\nGarth Fasano (00:45.345)\r\nokay. So what was the original name? I, what was, wasn't it called something else before that? No, no, there was, okay. Is tribe the one with, okay. I looked at the website. Okay. I think I have a buddy who's in it and I think I was drinking a beer with him and he was like, not very impressed with it. And I think he's in like, it's not much money. Like whatever. I don't really care. and.\r\n\r\n\r\nNikolas Hulewsky (00:52.918)\r\nUh-uh, it's always been tribe.\r\n\r\n\r\nGarth Fasano (01:11.079)\r\nand I told him like my idea of like, we need an in-person community like EO, something like that. And he was very interested in that. That is not what I remember. Okay. I looked at the old website. I've not seen this one.\r\n\r\n\r\nNikolas Hulewsky (01:18.67)\r\nWas this? This is Tribe.\r\n\r\n\r\nWe did just redo the website.\r\n\r\n\r\nNikolas Hulewsky (01:28.238)\r\nOkay, well, this is Tribe.\r\n\r\n\r\nGarth Fasano (01:32.724)\r\nLike, just fucking join my community.\r\n\r\n\r\nNikolas Hulewsky (01:36.451)\r\nWell, no, no, no, dude, here's the thing. I've actually been, how do I put this? I've been feeling the same way about, I think Tribe's good for people who are like first time entrepreneurs. like at the, they've gotten to a million or two million and then they're like, I don't know how to get to 10 million. And so they join with other entrepreneurs and they're having these conversations. And most of the businesses that are in there are agencies or like startup businesses where they like went from the ground up.\r\n\r\n\r\nAnd I've been feeling recently like there needs to be either from the, I've decided I'm going to search and I'm in the process. I've got an LOI signed from that point on through like the first two years, a community for the ETA or just for people who are entrepreneurship through acquisition period. And they get into that because it's different. It's very different. Like these guys are all talking about meta ads and they're talking about, this is how I acquire. What's your CAC and LTV. And it's like,\r\n\r\n\r\nGarth Fasano (02:20.38)\r\nYes.\r\n\r\n\r\nGarth Fasano (02:30.247)\r\nUgh.\r\n\r\n\r\nNikolas Hulewsky (02:33.016)\r\nDude, when you're doing ETA, you don't know that crap yet. You're just trying to make sure that the team doesn't leave and that you, like, since you PG'd this thing, nobody forecloses on your house.\r\n\r\n\r\nGarth Fasano (02:42.779)\r\nAnd when you buy a company, I'm going to, you know, of course you should know CAC to LTV, but you don't need to know it because you can look at the P and L and you're like, it works. Like you maybe growth harder than you think it's going to be if you don't know those metrics, but like you're buying a business that's working. the CAC to LTV doesn't matter. the thesis, yeah. The thesis for ETA isn't, I'm going to.\r\n\r\n\r\nNikolas Hulewsky (02:52.182)\r\nYeah, dude. Yeah.\r\n\r\n\r\nNikolas Hulewsky (03:02.754)\r\nYeah, that's. Sorry, keep going.\r\n\r\n\r\nGarth Fasano (03:09.873)\r\npop this thing from 1 million to 10 million over the next two, three years. The thesis is I'm going to slow growth this thing and I'm going to create a fantastic financial asset for myself, my family and my investors. And if I happen to pop it, fantastic, like even better.\r\n\r\n\r\nNikolas Hulewsky (03:25.603)\r\nOkay, so tell me, you said to me before I hit the record button. We're just gonna hop in right here.\r\n\r\n\r\nGarth Fasano (03:30.791)\r\nAll right, let's do it.\r\n\r\n\r\nNikolas Hulewsky (03:32.631)\r\nYou, so you're in corporate America, right? You're working and you were searching at the same time and you found this business. And you said in the first 24 months, your words, you freaking crushed it. You killed it. You paid off your SBA loan in the first two years. That's dude, that's freaking nuts Garth. That's freaking nuts. Like you obviously, you know it's nuts. Cause you said it was nuts, but what was the business? How, like when you bought, what was it?\r\n\r\n\r\nGarth Fasano (03:38.257)\r\nYes. Yep.\r\n\r\n\r\nGarth Fasano (03:44.551)\r\nYeah.\r\n\r\n\r\nGarth Fasano (03:48.71)\r\nI did. Yep.\r\n\r\n\r\nIt is not.\r\n\r\n\r\nGarth Fasano (04:00.071)\r\nThe business I acquired was a call center supporting small businesses around the United States and Canada. what it really, what it was doing is taking leads that were generated by the small business and or their marketing agency, taking those leads, working them, putting through a sales and conversion cycle. And then not just appointment setting, but closing the deal, taking a deposit and scheduling it on the small businesses calendar.\r\n\r\n\r\nNikolas Hulewsky (04:29.048)\r\nWhat year was this?\r\n\r\n\r\nGarth Fasano (04:30.521)\r\nI acquired it in October, 2022.\r\n\r\n\r\nNikolas Hulewsky (04:34.286)\r\nDude, I'm so freaking stoked for this because I've always said that's the right now. That's been the number one use case that I've seen for AI is after hours in particular gathering calls. But anyways.\r\n\r\n\r\nGarth Fasano (04:44.357)\r\nOkay. So, like, so that's, that's table stakes. That stuff is actually too easy. Like go and I mean this with all respect, but go be a GHL SAS bro and put, turn on your AI agent and like collect that data that way. Yeah. Have fun. Like, sure. That is just, that is such, that is so table stakes, like an after hours bot to collect information. You know, now we have that, that we, hired a, so.\r\n\r\n\r\nNikolas Hulewsky (04:53.432)\r\nTell me, please.\r\n\r\n\r\nGarth Fasano (05:13.383)\r\nback up the story a little bit. After running this for two years, the board and I would continue to have conversations and they would always ask me at every meeting what is happening with AI. in October, 2022, the answer was, Hey, it's about 10 years out. I think we've got some time then, uh, 2023. Yeah. You're laughing. Like we can all laugh with.\r\n\r\n\r\nNikolas Hulewsky (05:15.448)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (05:33.624)\r\nYeah, October 2022. What happened in December 2022?\r\n\r\n\r\nGarth Fasano (05:38.123)\r\nthe world started changing and it started changing faster and faster. so in 2023, the answer was, it's about three to five years out. And then in 2024, we were at a meeting and they said, hey, like, what do you think is gonna happen? was like, you know, it's still three years out. You maybe if I had like graphed these answers over time, we would have seen the writing on the wall. The next week was when ChatGPT launched some of their voice capabilities. I don't remember exactly what that product was called at the time.\r\n\r\n\r\nNikolas Hulewsky (05:39.97)\r\nYeah, the world's our chain. Keep going.\r\n\r\n\r\nGarth Fasano (06:07.249)\r\nBut I called the board back and said, Hey guys, I think it's now we should talk more. and so basically we went into some, serious strategy planning meetings and there were sort of two choices. There was, Hey, we have a fantastic business. It's doing really well. clearly the writing is on the wall that this is going to have to shift or it will sort of be, compete out competed by AI over time, or we can, you know, make a big investment.\r\n\r\n\r\nand go see what we can go do. And so we made the decision to go invest in the AI future of the business.\r\n\r\n\r\nNikolas Hulewsky (06:43.694)\r\nOkay, yeah, I was trying to like put these pieces together because I in my research I was like, all right, he bought this business crushing it. Like you're processing $100,000 a day worth of revenue for people who were utilizing you as this outsourced sales team, right call center. And then all of a sudden you've launched Rainmaker AI, which is it's along the same lines, but I was like, I wonder what this whole process was to actually make the switch to go heavy into AI. And I agree with you. I had a guy in my podcast.\r\n\r\n\r\nGarth Fasano (06:56.455)\r\nYep.\r\n\r\n\r\nNikolas Hulewsky (07:12.76)\r\nHe's the CEO founder of Think AI and they have after hours calls. And we did like a live demo where I was like, cool, I wanted to talk to me. And it was fun. But the reason why I think it's the best use case is because for small business owners, they're still not doing it. Like what percentage of small businesses would you say are still not capturing calls, emails, texts, leads after hours that they're losing to competitors? Like it's gotta be above 90 % that still don't have after hours stuff.\r\n\r\n\r\nGarth Fasano (07:15.174)\r\nOkay.\r\n\r\n\r\nGarth Fasano (07:42.391)\r\nSure. Most don't. Now, the one thing I would say that we found in running sort of the legacy model is that, you know, having a voicemail isn't the end of the world as long as you are promptly following up with that lead and making it easy for them to communicate with you. think, and, and I think this is where I've seen some of the strategies small businesses have taken and they're like, Hey, have a VA offshore or maybe I have two or maybe I have three that way have really good coverage. And what you're giving up in that is this local\r\n\r\n\r\nfeel like what, someone calls a small business in their community, they're expecting, you know, to speak with someone who sounds like them is local, knows how to pronounce the town that they live in and where the business is located. And a lot of times if you use offshore, it doesn't, it doesn't work out that way. And so you have these sort of, and the alternative is you build your own team in-house or you outsource it to an onshore resource. And that's incredibly expensive. And then you don't get the coverage that you're looking\r\n\r\n\r\nor for after hours. so small business owners have an incredibly hard decision to make. Do I offshore it? Do I not sound local? Which is we were talking about CAC to LTV metrics. Like your conversion rate is just going to go down. People are, it's not going to sound authentic. You're not going to convert it to customers. Maybe you can even only do appointment setting at that point. You can't even take a payment or book the full service. So it still has work required for the owner. But it's more affordable and you can handle demand spikes. The other option historically has been\r\n\r\n\r\nhire my own onshore team or in my office or outsource it onshore where I get really good quality. They can probably book the entire thing. so those have been the two choices and people have been really stuck in between those without a solution. And so the answer is now apparent to all of us where this is going to be solved with technology and AI.\r\n\r\n\r\nNikolas Hulewsky (09:33.806)\r\nAlright, tell me what's the size of Rainmaker right now? how much revenue are you guys doing a month? Net income a year?\r\n\r\n\r\nGarth Fasano (09:39.623)\r\nYeah, we're $3.5 million in revenue. We raised our seed annually. So we're what I would call in our tech spot is we're at our seed round. we do have an AI after hours product out there in the market, but I would call us kind of pre-product right now. That is not where vision is. We're still running it today.\r\n\r\n\r\nNikolas Hulewsky (09:45.464)\r\nmonth.\r\n\r\n\r\nOkay, all right.\r\n\r\n\r\nNikolas Hulewsky (10:02.254)\r\nAnd so what happened to the call center that you had? Is it still there?\r\n\r\n\r\nHow big is that business?\r\n\r\n\r\nGarth Fasano (10:09.595)\r\nThat business is, you know, in terms of, I'm going to give you in terms of people, we have about 50 people in the call center. It's big. Yeah. It's not small. We are our part of our thesis is that we are still going to need humans involved in the sales process for small businesses. I think that actually one of the big challenges that small businesses have is, and what we have gotten really good at over the 15 year history of the\r\n\r\n\r\nNikolas Hulewsky (10:16.312)\r\nYeah. that's big.\r\n\r\n\r\nGarth Fasano (10:37.403)\r\ncompany while it was a call center business is, helping businesses refine their product offer and their pricing and their packaging so that it is easy to sell remotely. What a lot of businesses struggle with is, Hey, you know, I've got these great products. got this and that. And, you know, you, if you try and sift through that over a conversation, it just creates more questions for the consumer. have to reduce the questions and make it very easy for them to make a purchasing decision. And.\r\n\r\n\r\nYou know, that sort of stops them from calling another competitor, continuing to shop around. And if that does mean when you get onsite and you're delivering that service that you end up providing it slightly differently or make a modification to it, whether a discount or an upcharge, that's okay. You just got to stop them from calling your competitors. and for context, a lot of our clients are home services companies where they sell a service and they go to the local.\r\n\r\n\r\nNikolas Hulewsky (11:30.255)\r\nWell, what you just said about getting your branding and your marketing and your messaging all cohesive. it's it cookie cutters the wrong word, but it's like scalable, replicable. It's the same idea for all of your other processes in your business when it comes to AI, because if you can create the SOPs and you can create the processes now all of a sudden I have a workflow that I can go and just either build out or hand off to AI. But if you don't have that.\r\n\r\n\r\nGarth Fasano (11:36.742)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (11:55.737)\r\nThen you're just like, what do I use chat GBT for? I'll ask it a question. Like you just not ready. You're not ready for AI. Let me ask you this. So between the time of being a w two employee to now where you're like probably $50 million plus in enterprise value in the businesses that you have, which is just freaking nuts. So W two employee ETA by the business pay off the SBA loan to today. What's that years? How many years is that?\r\n\r\n\r\nGarth Fasano (12:24.327)\r\nwe're two and a half years, roughly post acquisition, maybe.\r\n\r\n\r\nNikolas Hulewsky (12:28.504)\r\nDude, F you, man. End this interview. Hey, Jamie, end the interview. This is two and a half years?\r\n\r\n\r\nGarth Fasano (12:35.589)\r\nYeah, we're both August 2025 right now as a recording. And so we're getting closer to the three year mark.\r\n\r\n\r\nNikolas Hulewsky (12:44.686)\r\nWas this your goal? Like were you like, nah man, this is what I'm gonna do with it.\r\n\r\n\r\nGarth Fasano (12:46.119)\r\nNo, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no,\r\n\r\n\r\nNikolas Hulewsky (13:05.667)\r\nYeah.\r\n\r\n\r\nGarth Fasano (13:14.747)\r\nBut my background had been in enterprise sales and service, which is call center.\r\n\r\n\r\nNikolas Hulewsky (13:20.164)\r\nWhat size of business were you looking for?\r\n\r\n\r\nGarth Fasano (13:23.159)\r\nI was looking sort of in the, I'll be honest, I was very comfortable going small. I'm glad I didn't end up doing that. So I would probably drop anything that was less than a million in revenue and looking up to probably about 10 to 10, maybe 15 million in revenue. When I was doing my search, the family office sort of supporting me. And so if I needed to get, if I had an equity gap, I felt very confident that I was going be able to close that. So that gave me a pretty wide aperture that I was able to\r\n\r\n\r\nNikolas Hulewsky (13:41.453)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (13:53.218)\r\nWell, yeah, that's what I was gonna ask, like, $10 million, you're not just buying that with the SBA and some gap funding.\r\n\r\n\r\nGarth Fasano (13:58.073)\r\nYeah, I feel confident I could pull it together if I needed to.\r\n\r\n\r\nNikolas Hulewsky (14:01.676)\r\nOkay, so when did you find this business? Was it, keep going, sorry.\r\n\r\n\r\nGarth Fasano (14:04.903)\r\nI found, yeah, July, summer 2022 is when this business sort of kind of came across my desk and I'll be honest, it was on BizBuySell. I found it on BizBuySell. Yep.\r\n\r\n\r\nNikolas Hulewsky (14:17.9)\r\nNarrative violation, hate myself.\r\n\r\n\r\nGarth Fasano (14:20.463)\r\nI think people, I think people give it a bad rep. think that there are some, mean, clearly there are diamonds in the rough that are out there and. Yep.\r\n\r\n\r\nNikolas Hulewsky (14:26.956)\r\nWow. I think BizBiz is great for getting your reps in, like legitimately, like go on there, request a bunch of information, talk to these brokers, understand how to look at a sim and ask the right questions, et cetera. It's just a lot of kissing frogs until you find that prints. You know what I mean? It takes a long time. So were you just like surfing BizBiz and you saw it?\r\n\r\n\r\nGarth Fasano (14:49.831)\r\nman, I can't remember exactly. mean, I was on and off searching for five years. And so I went through sort of each version of searching proprietary, you know, doing direct outreach, writing letters, calling people. did biz by cell. tried broker led and you know, ultimately I just had so much fun doing it. I love looking at businesses. Like I loved seeing a business that was sort of in my geographic area and being like, wow, this is.\r\n\r\n\r\nNikolas Hulewsky (15:02.435)\r\nYeah.\r\n\r\n\r\nGarth Fasano (15:18.481)\r\nThis is so cool. And I could start to envision myself being the owner operator. I would write up a financial model for it. And part of the way I would sort of, you know, figure out if my assumptions were correct is I would go get a bunch of Sims for similar businesses in other markets. So like, people are like, do you all this market research? Well, I think it's really easy. Just go get five more Sims from other markets and see, you know, benchmark all the key metrics.\r\n\r\n\r\nNikolas Hulewsky (15:34.423)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (15:43.289)\r\nDude, you know what's interesting? You searched for five years. So you were at your corporate job, I'm assuming you weren't full-time searcher for five years. And you started out with a thesis of like, I'm gonna get the unsexy sweaty business. I'm gonna freaking do port-a-potties and septic pumping. And you ended up with a business that was basically the same thing that you had been operating in where you had experience. How did that happen?\r\n\r\n\r\nGarth Fasano (15:49.159)\r\nYeah, correct.\r\n\r\n\r\nGarth Fasano (16:07.067)\r\nYep. So I mean, it's not by chance. You know, my friends in the search space now are like, what were you doing looking for something that was not in your background area? Like, why would you even try that? Like that is just silly. And, and they're right. Because when I saw this business, I didn't need to go pull five Sims from anywhere else. I looked at it I was like, wow, they are, they are doing some amazing things in these couple of different ways. And like, this is awesome. This is awesome. This is awesome. And no one else that is doing outsourcing or outsource sales.\r\n\r\n\r\nNikolas Hulewsky (16:25.987)\r\nYeah.\r\n\r\n\r\nGarth Fasano (16:36.369)\r\ncan do this.\r\n\r\n\r\nNikolas Hulewsky (16:38.126)\r\nI'm so freaking glad Connor connected us, because this is like the scene in Step Brothers where he's like, do we just become best friends? Dude, for the last two years, I've been doing this podcast, right? Like I sold multiple businesses and I was in healthcare and I was like, well, what else is out there? Oh, tech is cool or SaaS businesses are cool or communities are cool, whatever. And then like three or four months ago, I got to the point where I was like, what am I doing? I have this like skill set where I'm better than 99 % of people just because I have a lot of experience in that space.\r\n\r\n\r\nWhy would I leave that space to go into a space I have no clue about? That's just seems like the dumbest thing in the world. And so now, you my brother-in-law and I have launched this venture studio for healthcare in particular. But as I've reflected on it, I feel like that is the way to go. If you're getting into entrepreneurship, because now I don't have to learn how to run a business and what the business is. Now I just need to learn how to run the business because I already know what the business is. I already know how it's supposed to operate, but I'm an entrepreneur for the first time. I don't have these like.\r\n\r\n\r\nmultiple competing learning curves. At least that's how was for me.\r\n\r\n\r\nGarth Fasano (17:37.019)\r\nYep. I mean, yep, that was my learning to focus on what you know. mean, the other thing is like, you know, this doesn't apply to you, but for people who are looking for a business out there is like getting in the game is so important. And now that I'm in this game here, like I know so much more about small business operations, CAC to LTV, how you acquire customers, what the sales motions are, what's important, what's not important. And, you know, that's what we're taking and leveraging into the future platform of Rainmaker.\r\n\r\n\r\nNikolas Hulewsky (18:04.29)\r\nYeah, dude, that's awesome. Okay, so you just found this business by chance. Tell me a little about it. How big was it? What was the revenue top line? What was the asking price?\r\n\r\n\r\nGarth Fasano (18:14.823)\r\nwas it was about 2 million in revenue. They were asking for about a 3X and it had sort of pretty pretty standard margins. I'm trying to remember. Sure. Based is usually pretty low, like 15 to 20 % gross margin. It's pretty, it's pretty rough. Like in a, typical outsourcing business. Yeah. Yeah. So you make all your money on\r\n\r\n\r\nNikolas Hulewsky (18:28.322)\r\nWhat are standard margins for call center? What, 20, 30 %?\r\n\r\n\r\nNikolas Hulewsky (18:40.526)\r\n15, 20 % gross margin?\r\n\r\n\r\nThe F?\r\n\r\n\r\nGarth Fasano (18:44.807)\r\nshore resources. You don't make money on the onshore resources. You get high revenue on onshore resources, very low margins, whereas like, you know, offshore, and it's different by each geo. But typically, you're looking at like 50 plus 50 to 60 % margin.\r\n\r\n\r\nNikolas Hulewsky (19:00.782)\r\nSo this business is doing $3 million top line. It was doing what, 250 bottom line?\r\n\r\n\r\nGarth Fasano (19:05.095)\r\nIt was, was, it was better than most because of how deeply embedded it was into services. was, it was all around like 500 and, uh, yeah.\r\n\r\n\r\nNikolas Hulewsky (19:14.438)\r\nOkay, so you saw it and you're like, I know this space, 500,000 in EBITDA. Okay, they're asking for 1.5. I think I can swing this. Did you have a lot of money you could put down?\r\n\r\n\r\nGarth Fasano (19:25.019)\r\nYeah, I wrote the check, yeah.\r\n\r\n\r\nNikolas Hulewsky (19:27.878)\r\nyou just bought it out, right?\r\n\r\n\r\nGarth Fasano (19:29.271)\r\nI wrote the equity check myself, but then took an SBA loan to fund the gap sort of traditional, traditional ETA smaller side where it's one 10, 10 roughly. Yeah. There were some things to that. Yeah.\r\n\r\n\r\nNikolas Hulewsky (19:37.59)\r\nokay, okay, so.\r\n\r\n\r\nOkay, sorry, when you said that I was like, holy balls, dude, why did you leave the other company? You got a freaking million and a half dollars laying around. Okay, so your thesis was like, cool, I can get in there, I know this business. Did you know that it would have the explosive growth that it did? Because, okay, so you buy it, doing three million. I'm assuming you're not doing $3 million a year anymore.\r\n\r\n\r\nGarth Fasano (19:47.815)\r\nactually.\r\n\r\n\r\nGarth Fasano (20:00.057)\r\nNo. Again.\r\n\r\n\r\nGarth Fasano (20:07.237)\r\nIt was doing 2 million at the time. Yeah, 2 million. A 2 million in rent. And but when I got in the plan that there, if you're an acquisition entrepreneur, I don't think your thesis should ever be like explosive growth. It should be base case. Like I'm to lose some customers when I take over. Like it's very slow. And that was what I built my entire financial model on.\r\n\r\n\r\nNikolas Hulewsky (20:09.006)\r\n2 million.\r\n\r\n\r\nNikolas Hulewsky (20:12.77)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (20:26.382)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (20:32.002)\r\nYeah, year one, learn the business, stabilize, learn the team, right? It's just like, do no harm. If the ship can keep sailing, I'm in a good spot. And then years two and three, you're supposed to go for explosive growth. That's not what happened to you, it sounds like though.\r\n\r\n\r\nGarth Fasano (20:37.99)\r\nYeah.\r\n\r\n\r\nGarth Fasano (20:44.625)\r\nThat is not what happened. so, we, we, there are a couple of factors at play is we got a little bit more involved in what I was calling like lead Jen and we offered that as a new service product to our customers. And there was incredible adoption. so that was, started generating by launching a lead Jen program, which let us connect in lead aggregators directly into our sales motion for our clients.\r\n\r\n\r\nNikolas Hulewsky (21:01.379)\r\nMm.\r\n\r\n\r\nGarth Fasano (21:11.365)\r\nWe improve the conversion rate on leads from those sources. And I'm talking like thumbtack bark.com Angie's list, things like our clients conversion rate on those leads prior to us building the integrations was 2 % like on all leads. It was terrible. We cause speed to lead was lower. mean, like literally we had people who would get a thumbtack lead, reply to it on their phone, screenshot it, send it to us. And then we would have to like input it into our pretty sophisticated CRM and dialing solution.\r\n\r\n\r\nNikolas Hulewsky (21:17.55)\r\nAngie's a little... yeah.\r\n\r\n\r\nNikolas Hulewsky (21:27.192)\r\nCheers.\r\n\r\n\r\nNikolas Hulewsky (21:40.269)\r\nWhat?\r\n\r\n\r\nGarth Fasano (21:40.871)\r\nand then call it. And so the conversion rates were terrible.\r\n\r\n\r\nNikolas Hulewsky (21:45.006)\r\nWas there a specific niche that this call center was servicing? I forget, sorry.\r\n\r\n\r\nGarth Fasano (21:49.479)\r\nIt was dog training and I'll get back to like my that'll tie back into what my thesis was with this business, but we built\r\n\r\n\r\nNikolas Hulewsky (21:53.003)\r\nOkay. Yeah. Wow. $2 million a year for just dog training sales or call center. That's amazing.\r\n\r\n\r\nGarth Fasano (22:01.115)\r\nYeah. We were, we were selling like 25, 30 million in dog training a year.\r\n\r\n\r\nNikolas Hulewsky (22:07.63)\r\nAnd what it was curr- really? At the time? I just- Okay.\r\n\r\n\r\nGarth Fasano (22:11.111)\r\nYep. Oh, well, by the time it got scaled up and we did this stuff. but you got to hear this. So by building a direct integration into these lead aggregators, we took the conversion rates from 2 % to 14%. So we set an excellent conversion rate on those. So we started pumping an additional $200,000 of revenue per month for our clients by building that integration.\r\n\r\n\r\nNikolas Hulewsky (22:33.582)\r\nHold on a second. Let me get my calculator out. Yeah, that's good. That's a good improvement. Oh my gosh. when you say working the leads, you kind of went from an inbound call center to where you're getting calls in your whatever leads that you're getting from your customers. How did you turn into an outbound? It's almost like an outbound call center where you're working the leads or no? OK.\r\n\r\n\r\nGarth Fasano (22:38.567)\r\nIt's good. It's pretty good,\r\n\r\n\r\nGarth Fasano (22:59.215)\r\nWe've always been doing both. So we would get both inbound calls and then we would also get like web leads or leads from any other sources. And then we just built it like the business that I, when I bought it, it had a CRM was using Salesforce. We also had five nine. So these are like fortune 100 level, you know, systems and a pretty sophisticated outbound dialing program there as well.\r\n\r\n\r\nNikolas Hulewsky (23:06.232)\r\nOkay.\r\n\r\n\r\nGarth Fasano (23:23.568)\r\nSo we get a web lead, call it, we send text messages, we do these follow-up sequences, and we convert those into customers.\r\n\r\n\r\nNikolas Hulewsky (23:24.28)\r\nBros.\r\n\r\n\r\nNikolas Hulewsky (23:30.178)\r\nOkay, so then walk me through, what was the change? All you did was you started integrating with the aggregators.\r\n\r\n\r\nGarth Fasano (23:36.965)\r\nYeah. So the lead sources that we would get and were automated when I came in were things like phone calls. Those would come direct to the team. would ring. Web leads would come directly in and through integrations would show up in our CRM and they get an outbound dial. But there are these other sort of like parts and pieces that were sort of sitting out and not connected into the platform. And so I just went down the list and started connecting them all in. And you know, that speed to lead went down.\r\n\r\n\r\nNikolas Hulewsky (23:57.879)\r\nHmm. Yeah.\r\n\r\n\r\nGarth Fasano (24:05.723)\r\nthe service that we were able to deliver improved and it started delivering significant revenue for our clients. So as our clients revenue went up, so did ours.\r\n\r\n\r\nNikolas Hulewsky (24:14.072)\r\nDude, that is insane. So you were getting a lot of leads that were not either phone calls or web generated. You were getting a ton of leads that were the Google LSA or Angie's List or Thumbtack or wherever else they're coming from. And then you'd have to manually enter those in or at least get them from the client. Probably, actually, that was the problem is you had to get them from the client. Then you had to manually enter them. And then by the time you're responding to them, there's this big gap, like you're saying, of the speed to lead.\r\n\r\n\r\nGarth Fasano (24:20.828)\r\nYeah.\r\n\r\n\r\nGarth Fasano (24:26.407)\r\nAnd we just...\r\n\r\n\r\nGarth Fasano (24:38.767)\r\nExactly. So, yep. So it's not rocket science.\r\n\r\n\r\nNikolas Hulewsky (24:47.982)\r\nThat's it. Okay. I'm going to tell just like a kind of similar story. My, first company I worked at was a publicly traded company, but they were very entrepreneurial and they, they like give you opportunities to go and run these local agencies. They call them their healthcare operations. And I took over this one and this one was losing, I think it was $400,000 a year. And then I got in there in the next year, it made $600,000 in profit. So I had a million dollars swing and it was like, dude, Nick is amazing. It's great.\r\n\r\n\r\nI wasn't, they were writing off like 8 % of their revenue to bad debt. All I did was like fix the collections. So I didn't like change anything to the business and then, know, instantaneously it's going a lot better. That sounds like this, right? Like you're coming in, you're like, dude, we're getting the leads. All we have to do is improve our speed to lead and boom, we just seven X'd the conversion.\r\n\r\n\r\nGarth Fasano (25:39.944)\r\nThe epiphany was like, wow, we're converting at 2 % on Thumbtack. Thumbtack seems like it's a pretty good business. People invest in Thumbtack. So it must be better than 2%. Like what is going on here? And then you're like, well, it's because this person screenshotted their phone and sent us the lead. And now we have to manually input it.\r\n\r\n\r\nNikolas Hulewsky (25:48.206)\r\nAll right.\r\n\r\n\r\nNikolas Hulewsky (25:59.673)\r\nHow hard was it to actually get them integrated? So let's just say Thumbtack, for example, when you're like, yeah, we gotta get that just integrated to our CRM. How hard was it to get the API or whatever?\r\n\r\n\r\nGarth Fasano (26:09.841)\r\nThe, it is not that hard, but it is a process building the relationship with it. was, it took hoops to work it through with thumbtack and create what they call a centralized account. and then the sort of chaos that that created was from billing because I essentially had to put the company credit card in was buying.\r\n\r\n\r\nall of the thumbtack leads on my company credit card and then had to figure out how to invoice the clients for those. And thumbtacks web hooks did not still do not, I believe, deliver the price of each individual lead purchased via their web hook. And so it was like very, very messy to try and figure that out. Cause I was like, perfect. I just push it into Salesforce, run a report every month, add that to the inbox.\r\n\r\n\r\nNikolas Hulewsky (26:41.708)\r\nInvoice the client.\r\n\r\n\r\nNikolas Hulewsky (27:02.382)\r\nDid you see that opportunity before you bought the business or was it after you got in that you're like.\r\n\r\n\r\nGarth Fasano (27:08.027)\r\nNo, no, did not see that opportunity before I got in. But that was not the number one idea of buying the business. The business was like, wow, they've built, the founder of this business and the team built something amazing, like fantastic. Like the goal wasn't even to touch that. It's like, perfect. Let it keep running. The goal was, can we prove that this model works in another industry? If I can go prove that this model works in another industry.\r\n\r\n\r\nthen we are onto something because we can go take this and bring it to additional industries. And so that was my goal from the beginning. We very quickly got into a med spa about less than six months after I came in, had through referral, we had a med spa. And what we proved was we can sell med spa really, really well. There was an issue that med spa franchise did not create leads.\r\n\r\n\r\nNikolas Hulewsky (27:47.982)\r\nthat's buzz.\r\n\r\n\r\nGarth Fasano (28:00.096)\r\nthey just wanted us to keep working their existing customer base, which if you're calls on your existing customer base, not a good strategy. So in the long run that, didn't work. but what we did prove in the, you know, six months we were working together with them is that we run the same sales motion. The sales call flow works just sort of like plug and play different pieces. And so that was the epiphany was like, okay, we can actually take this anywhere. Let's continue to prove that. then we got into.\r\n\r\n\r\nA couple more franchises, we're in a home cleaning franchise and one of the largest franchise roll ups. We're also into a pest control company and one of the largest global franchise systems. And we now have a handful of other businesses that were involved in as well.\r\n\r\n\r\nNikolas Hulewsky (28:42.19)\r\nTell me about, like you said, when did you identify that, these aren't integrated with the aggregators, and when was it fixed by?\r\n\r\n\r\nGarth Fasano (28:51.527)\r\nit probably took, it took, I'm going to guess it was about 90 days to figure that whole process out.\r\n\r\n\r\nNikolas Hulewsky (29:00.91)\r\nOkay, so let's just say you bought the business and the business is doing for simplicity sake, $150,000 a month. I know that's a little bit less than it was, but $150,000 a month. After 90 days and you fix the aggregator problem, what did your revenue jump to? Or did it not jump? I don't know if it was a percentage based on what your customers were doing or no.\r\n\r\n\r\nGarth Fasano (29:18.779)\r\nYeah. Yeah. So that, is how we, built it was a percentage of the revenue generated for our customers. we were basically, yeah. So we just, so anytime we could make our customers more money, we made more money. So it wasn't really that complicated.\r\n\r\n\r\nNikolas Hulewsky (29:25.645)\r\nhello?\r\n\r\n\r\nNikolas Hulewsky (29:34.102)\r\nOkay, and you said that just by fixing that, it increased revenue for customers in aggregate?\r\n\r\n\r\nGarth Fasano (29:39.047)\r\n200k a month, yeah. In aggregate, yeah. So that was adding about 10 % revenue to them.\r\n\r\n\r\nNikolas Hulewsky (29:44.371)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (29:49.294)\r\nDude, so you doubled the size of your business within 90 days.\r\n\r\n\r\nGarth Fasano (29:53.64)\r\nThat's making it sound way too nice. No, it wasn't quite that big.\r\n\r\n\r\nNikolas Hulewsky (30:00.334)\r\nWell, you said, no, you said it added $200,000 a month, right? for the, the, got it, got it. Okay, okay, what was the percentage you got?\r\n\r\n\r\nGarth Fasano (30:03.815)\r\nfor our clients. Yeah, and you get a percentage of that. Yeah, yeah. We were typically getting around like, depending on the exact business, like 10 to 15%.\r\n\r\n\r\nNikolas Hulewsky (30:20.142)\r\nOkay, so let's just say you were getting for number sake ease of number sake $30,000. You increased your revenue 20%.\r\n\r\n\r\nGarth Fasano (30:27.141)\r\nYep. Yep.\r\n\r\n\r\nNikolas Hulewsky (30:31.01)\r\nWow, that's awesome, dude. And I'm sure your customers were happier because they were getting more business with the same amount of work in leads. Your team was happier.\r\n\r\n\r\nGarth Fasano (30:37.148)\r\ncustomer.\r\n\r\n\r\nGarth Fasano (30:40.923)\r\nYep. mean, they literally didn't have to do anything differently other than stop screenshotting stuff and sending it to us. So it was like more efficient across the board. Everyone loved it.\r\n\r\n\r\nNikolas Hulewsky (30:52.192)\r\nAll right, so that business growing, doing well, can you tell me where it's at today? Like what are you doing in revenue today?\r\n\r\n\r\nGarth Fasano (30:59.137)\r\nwe, it's about three and a half million in revenue today. So we are in a tricky transition moment of like, what is the future state of, you know, business? and this is a hard play and a lot of people say, Hey, you know, no services, business, businesses can transition into being a technology company. I would challenge that. think we're probably, you know, I'm sure the size of this business to some is big to some is minuscule. I think we're small enough where we can make this kind of a transition and do it successfully.\r\n\r\n\r\nNikolas Hulewsky (31:07.927)\r\nYeah.\r\n\r\n\r\nGarth Fasano (31:28.709)\r\nAnd I think one of the reasons we're really well positioned is because there are a ton of AI technology companies trying to come into this space. And I would say probably more on the B2B enterprise side. But what we are doing that I'm not seeing other people doing is that we are coming into the SMB side and not doing appointment setting like end to end sales. So by Q4, will, our product will, that will be.\r\n\r\n\r\nthe sort of real first release of the product. And with AI voice, we will be able to ask discovery questions on the call, identify the right product and pricing, deliver that to the consumer, and then handle talk-offs and objections, and then schedule the service and take payment all with AI.\r\n\r\n\r\nNikolas Hulewsky (32:14.528)\r\nIs everything currently combined with it? is, is, is,\r\n\r\n\r\nGarth Fasano (32:17.927)\r\nIt's like the delivery between AI and humans. Yes, it's combined at the moment. And I think that's actually the really fun question that we're spending a lot of time thinking through is like, what does that look like in the future? think, I think we all know what it's going to look like in the long run. And honestly, the long run is like 24 months, 36 months at longest five years, like, cause these things go so fast. And I think we know that at that point it is going to predominantly be AI. And I think\r\n\r\n\r\nThat is scary to a lot of small business owners, but maybe you saw this update from Google on July 16th. said, Hey, we're going to start having AI call small businesses. And so as we get pressure from corporate America, like this is going to force a small business owner to have an AI voice solution. Otherwise they're going to get updated with calls.\r\n\r\n\r\nNikolas Hulewsky (33:08.472)\r\nSo I'm a caveman, so please explain it to me like an idiot. Tell me what is the current process that business owners are experiencing and what is this new process that business owners will experience, let's say, with your company? Yeah, Q4.\r\n\r\n\r\nGarth Fasano (33:26.759)\r\nYeah. I think like, so the process that small business owners have today is that they spend money on leads and they get leads. If you're using a platform like ours that to outsource the sales motion, or maybe you're doing it internally, or maybe you have a team, but now you have to manage some system, whether it's an employee, a VA, an outsource sales organization to manage, convert, close those leads.\r\n\r\n\r\nNikolas Hulewsky (33:55.597)\r\nYou got to figure out what to do with these leads that have been generated. Yeah.\r\n\r\n\r\nGarth Fasano (33:58.14)\r\nYeah. And I think actually the technology setup is pretty complicated once it's not the owner doing it. because now how do get the local number? How is everyone staying on the same page? What email address are you using? Like who follows up if you have seven day a week coverage, how do you make that work? Like, cause now there's multiple people involved. What are the handoffs like, and now what happens when you're doing it at scale and you're running a multi-location business that's doing 10 million in revenue a year. Like, so how do you build a system that can scale? So\r\n\r\n\r\nNikolas Hulewsky (34:26.092)\r\nAnd so, even in the current state, what they might have done is said, Garth, I need your company. Please handle these leads. And so your company is working those leads, all of the inbound stuff that happens.\r\n\r\n\r\nGarth Fasano (34:35.815)\r\nYeah. Inbound Webley. We're doing the mix of inbound outbound from a local number, giving it that consistent look and feel. mean, our people can talk about the weather in that town. When someone asks like that, we do not.\r\n\r\n\r\nNikolas Hulewsky (34:43.191)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (34:48.686)\r\nDo you use Go High Level? I just saw that they came out with, one of the things I don't like about the texting software is it's green. You know, on the iPhone, High Level just came out with like, it texts in blue.\r\n\r\n\r\nGarth Fasano (34:58.207)\r\nyeah. I think, I think go to be honest, we spent a lot of time thinking about if go high level would be a core part of our future technology stack. And, it is our, our take and we made an attempt at using it for a period of time because it sort of solves a lot of the problems, but what it does not let you do is have a team and\r\n\r\n\r\nI'll get into the nitty gritty for some folks. You can't have a team of people working across multiple sub accounts. It just doesn't work. And there's not a good way to connect that and have a scaled team working multiple sub accounts. So if you want to use a local number in a particular orbit, and maybe you're saying, hey, it's changed already because they have a lot of updates. And so maybe that's possible. We tried, did not work, and it's just not enterprise grade.\r\n\r\n\r\nNikolas Hulewsky (35:43.118)\r\nI don't know.\r\n\r\n\r\nNikolas Hulewsky (35:48.237)\r\nYeah. So what Garth is saying high level is a, it's a CRM, but it's also a system that people use for their scheduling and invoicing and all these other things. And what he's describing is a central team. So an outsourced team like Garth's team, it's really hard for them to work across sub accounts is basically what you're saying. And the sub accounts being, the pizza shop in Pittsburgh and the dog groomer in San Francisco and the electrician in Austin. Right. So it just makes it hard for an outsourced company like yours to operate under high level.\r\n\r\n\r\nit may make sense for a small business.\r\n\r\n\r\nGarth Fasano (36:19.463)\r\nHere's the, the real like straight up example is in high level. you want to, if we say we have, you and I owned three businesses together and one person who was answering the call, that person would have to keep a tab open for each sub account for the calls to ring. And now if they picked up a call for PC widget in high level, and then someone called on XYZ, you know, whatever product\r\n\r\n\r\nNikolas Hulewsky (36:37.922)\r\nReally?\r\n\r\n\r\nGarth Fasano (36:46.119)\r\nIt would start ringing on that tab while they are on a call. So they're like on a call with a customer for business a while the phone is ringing in their ears for business. It's incredibly distracting. And like, to be honest, you need scaled teams. so like, you know, I mean, there's, there's this, uh, math equation sort of known as Erlang and this dictates the service levels that you're going to give. It's a, it's a formula. It's a process. You can't beat it. You can't change it. You need to operate at scale. And so.\r\n\r\n\r\nNikolas Hulewsky (36:53.966)\r\nHmm.\r\n\r\n\r\nGarth Fasano (37:15.975)\r\nyou without AI, by the way. So to operate at scale, you would have to have just so many tabs open. would be total chaos.\r\n\r\n\r\nNikolas Hulewsky (37:23.276)\r\nOkay, so that's current state. Q4, what does it look like? Do you no longer have a centralized team and AI is literally just deciding?\r\n\r\n\r\nGarth Fasano (37:32.328)\r\nWe will, we will still have a team. in Q4, we will have AI voice that can, like I said, talk to elite, understand their challenge, pitch them on the product, identify the right product and price, handle talk offs and then book. Yep. So it'd be like, that price is too much. tell me what budget were you thinking of? Like the AI will be able to do all of that. and yeah, maybe, maybe.\r\n\r\n\r\nNikolas Hulewsky (37:51.082)\r\nWhat's it?\r\n\r\n\r\nNikolas Hulewsky (37:58.479)\r\nOK. I it was like a competition. Today we're having a talk off. How long can Brad go?\r\n\r\n\r\nGarth Fasano (38:03.143)\r\nI call it actually your talk offs. It's a process. Uh, and maybe this is just me and my, like the sales, we could do a whole episode on like home services, sales, best practices, like what to do, what not to do and how to handle these kinds of things. So talk offs are like pretty core part of our training, but if you, that is going to mean that 100 % of calls are answered immediately 24 seven.\r\n\r\n\r\nseven days a week, 365. And for sure, there are going to be customers that do not want to speak with AI. And so I think one of the big questions is like, where do we go? We can handle that in with our human team and our sort of traditional call center. can escalate that to the business owner. But I think what is so the sort of midterm is sort of what I think there are some more questions about, but it's super clear that in five years, as we introduce our recursive learning models, there is no way that the AI can't handle it all.\r\n\r\n\r\nThe question will be, how do you handle it if a customer doesn't want to talk to AI?\r\n\r\n\r\nNikolas Hulewsky (39:01.432)\r\nDude.\r\n\r\n\r\nNikolas Hulewsky (39:05.058)\r\nThat is so freaking cool. Like the thing about, the thing that makes McDonald's great, I love McDonald's, is I can have McDonald's in Boise, Idaho, Austin, Texas, Miami, Florida, LA, and it tastes the same. It tastes the exact same, right? I know what I'm getting. Now you may say it's a mid burger, it's a four out of 10, that's fine, but it's a four out of 10 in all of those places.\r\n\r\n\r\nGarth Fasano (39:30.523)\r\nYou're giving me lines and needles and I got to jump in because it's going to be better than McDonald's, man. Imagine your best sales rep is on every call and in every text message and in every email with your leads. It is your best sales rep. it, in fact, it's better than your best sales rep because it's going to have access to all of the data. And what we are actually building that we sort of coined the rain brain is it is going to, our sales model is going to get better from\r\n\r\n\r\nNikolas Hulewsky (39:35.298)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (39:45.922)\r\nThat's what I'm saying.\r\n\r\n\r\nGarth Fasano (39:59.848)\r\nall of our clients. So like if we're working in another industry and we learn a sales tactic that we need to use, that is going to update the rain brain and the sales methodology that we deploy for all of our clients. So we, yeah, we have engineers right now building the rain brain, which is this complex vector model of how to continuously improve and deploy recursive learning across all of these components of sales. I couldn't help myself.\r\n\r\n\r\nNikolas Hulewsky (40:10.252)\r\nrain brain. That's freaking amazing. That's\r\n\r\n\r\nNikolas Hulewsky (40:24.376)\r\nWell, so yeah, you jumped in at the exact point that I was trying to make, right? It's like, now you have consistency and it's the best sales rep that you could possibly have. Why would I, as a small business owner, decide to bring that in-house? Why would I not go to somebody like your company that's just a plug and play? Boom. Hey, you already know how to do this. Cool. Go ahead, have at it.\r\n\r\n\r\nGarth Fasano (40:29.38)\r\nAlright.\r\n\r\n\r\nGarth Fasano (40:42.279)\r\nThere's no way that this is not the way ever like small businesses today, they go and sign up for QuickBooks. They, if they need to hire people, they probably go to Indeed or Monster. there, there, there can be competitors. That's great. If you need to run ads, you go to Google or Meta. Well, when you need to do sales, you're going to go to Rainmaker. There's, yeah, there's no way there.\r\n\r\n\r\nNikolas Hulewsky (41:05.006)\r\nWhat do you think happens with the human component? Like what do you think happens with your human team that's answering calls? I have an opinion on this. I'm just curious what yours is.\r\n\r\n\r\nGarth Fasano (41:11.591)\r\nYeah, I think that the human component is still going to be incredibly important, but the role is going to change. And this is what a lot of executives in the outsourcing space are saying, that, you know, we are going to up level and skill the work that we do. And this is not the first time we've had this sort of moment in history, like when factories and the assembly line were coming out and robotics were getting implemented, people said, everyone's going to lose their job. Well,\r\n\r\n\r\nthat didn't play out that way. and I think that what is going to happen is that there is the opportunity for incredibly skilled sales professionals to be watching the sales flows, what's working, what's not working. How do we continue to tweak this and evolve now? Obviously AI is going to be doing a lot of recursive learning, but I think that there are still going to be the opportunity for this in the midterm of like how.\r\n\r\n\r\nNikolas Hulewsky (41:42.272)\r\nNo.\r\n\r\n\r\nNikolas Hulewsky (42:06.003)\r\nOkay, you said it a few times. What the freak is recursive learning?\r\n\r\n\r\nGarth Fasano (42:10.051)\r\nhow do we continue to make the model better and better? Like if I say something and it doesn't convert a lead, it's tagged it. we didn't book it. what happened on that call or what did not happen on that call and what should I do the next time? And so, Hey, look at the math says on these types of calls, we booked them. Well, what happened on that call and how do we insert that into, and by the way, I'm using the word call, but it's going to be text message, email, multi-channel.\r\n\r\n\r\nNikolas Hulewsky (42:27.779)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (42:33.966)\r\nYeah, that's that's my opinion with AI right now. We're going through this with With the venture studio we just launched as people are feeling like well crap AI is gonna come in and automate my job away and I always go back to Are you getting to everything that you want to get to in your job right now? Or I even want to get to are you getting to everything that you are expected to get to in your job right now? Like and the answer is no So really it's just gonna make you more more efficient and have a you're go from like line\r\n\r\n\r\nemployee to supervisor almost and the AI is going to be like that's your tag team partner and they're to be doing a lot of the work and you're going to be sitting back and maybe looking at some of the analysis or like you're saying looking at that call log because even to get it in the right format so that you can then analyze it you've you've got to put together the right information and then even once it spits it out you still got to take a look at it and understand how to implement it I don't think it's going to eliminate jobs in the way that people think\r\n\r\n\r\nthat it's going to eliminate jobs. I think it's going to eliminate jobs and then create a whole set of new jobs that people are going to step into that will make companies more efficient, more profitable, and provide better experiences for their customers.\r\n\r\n\r\nGarth Fasano (43:41.532)\r\nWe've already started promoting our teammates or moving our teammates from the call center business to the SaaS platform business. we've a fan full of times. That's something we're super committed about. And we really do believe that our teammates that know this sales process so well from working at so many times are actually really well suited to this future job of, you know, what we're calling is kind of like eyes on glass. Like, and we already have mockups of what the\r\n\r\n\r\nNikolas Hulewsky (43:50.684)\r\ncool.\r\n\r\n\r\nGarth Fasano (44:09.671)\r\nI'm going to use a word that is sort of super legacy call center. And this is not what I mean, but it'll help people into the agent desktop of the future. So like people have always been trying to design the agent desktop. How do I, how do we create this perfect customer view so that we, that the human, the agent working that can do exactly what's needed at the right time. But there is a version of this for the future that is not about an individual customer, but it's about the flow of data and where leads are going.\r\n\r\n\r\nwhere they're falling out and where you're having the best conversion and how, if you're having a problem, maybe we are inserting a human into that moment to sort of address it and improve it and correct it.\r\n\r\n\r\nNikolas Hulewsky (44:45.134)\r\nHere's a second theory and I might cut this out because it may be like two nerds like, actually what will happen is if you carry the one on the spreadsheet. So I don't know how into power generation are you?\r\n\r\n\r\nGarth Fasano (44:52.039)\r\nthis great, I love it!\r\n\r\n\r\nGarth Fasano (45:00.768)\r\nI don't know much about what you're talking about, so.\r\n\r\n\r\nNikolas Hulewsky (45:03.01)\r\nOkay, so in order for us to use all of this AI, it requires a massive amount of power. Yeah, yeah, yeah.\r\n\r\n\r\nGarth Fasano (45:09.121)\r\nthat kind of power generation. Okay. actually it's wild. was having dinner on Sunday night with a guy who is going to report directly to Elon and is in charge of acquiring the power generation for, for X.ai. Yeah. So I do.\r\n\r\n\r\nNikolas Hulewsky (45:28.436)\r\nNo way. Really? Dude, okay. Wow. It's freaking coming in big dog and really quick. The problem is that like, so the United States currently produces like four terawatts of power a year. And over the next 10 years, we really only are slated to go from like four to six. It's not that big of a jump. China is slated to go from like five already to 10 in that same period of time.\r\n\r\n\r\nAnd so we're running into this problem where more and demand for AI, but we don't necessarily have the capacity to produce the power necessary to run these models. I kind of have a theory which is we think AI is going to replace everything, but we're going to have to actually create these like mid-level jobs where we're deciding on like, what is the most valuable thing that we can be using our compute for? And then everything else is kind of built around that where we have like\r\n\r\n\r\nOkay, this person goes and grabs and I don't know, indexes these things or this person goes and grabs the transcripts and does this part of the analysis, et cetera. And then we save the compute for this small piece of what we actually need to do. Again, that might just be a total nerd thing, but are you thinking at all about how does this scale? What happens in a year from now? If we get to the point where it's like, shoot, we have a limitation on how much power we can actually use because no.\r\n\r\n\r\nGarth Fasano (46:48.871)\r\nI haven't thought about it in the power side. I mean, I think that we will.\r\n\r\n\r\nNikolas Hulewsky (46:55.566)\r\nBecause if you build it all AI and then people are using you exclusively and all of a sudden there comes a limitation to the amount of power you can use, then that's going to interrupt the ability of you to provide that service. So it's a real thing.\r\n\r\n\r\nGarth Fasano (47:07.547)\r\nThat, that sounds like a real thing. Well, we, the way we have been thinking about it right now is, I think a lot of AI companies are sort of a, a wrapper around an LLM or a mainstream platform, like pick, your choice. That is not what we are doing. We, we hired a CTO who comes as a background in, healthcare data and integrations. And so he's actually building the enterprise infrastructure.\r\n\r\n\r\nwe can deploy this as efficiently as possible. we already are our engineering team and our product managers are also designing with the thesis of how do we do this to limit the number of tokens so that we can do it in the most effective way possible, relatively a competitor that will emerge at some point.\r\n\r\n\r\nNikolas Hulewsky (47:50.562)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (47:55.587)\r\nThat's an interesting approach. Making this efficient as possible. Yeah, that makes sense.\r\n\r\n\r\nGarth Fasano (47:55.784)\r\nYeah. Now, no. So if there becomes a power shortage, then hopefully we would be in a better position than others. I, I might have a slightly different perspective on it. Like I think, I think that the, you know, we, this is gonna might get very political. You might have to cut this out. That's okay. But like, I that we're in. Yeah. I think that, you know,\r\n\r\n\r\nNikolas Hulewsky (48:20.027)\r\nI'm in. I'm in.\r\n\r\n\r\nGarth Fasano (48:24.411)\r\nWe have lived in some pretty wonderful times throughout probably both of our lives here in the United States. And we've never had moments of scarcity that have forced tougher decisions or people to really consider what's most important to them. And I think that if we were in a moment where we were running out of power, people might be willing to make choices to help deliver the type of power needed for, you know, the economy to continue to provide in the way that we all expect it to.\r\n\r\n\r\nNikolas Hulewsky (48:51.286)\r\nInteresting. mean, because there's two choices. One, we can build more power infrastructure. Two, we can ration. The problem with building more power infrastructure for the amount of power that we need, like a nuclear reactor is going to take at least five years, even in these, what do they call them? Gen three. Is that what they call them? Anyways, these new safer, smaller. Huh?\r\n\r\n\r\nGarth Fasano (48:55.879)\r\nMm-hmm.\r\n\r\n\r\nGarth Fasano (49:07.471)\r\nMm-hmm. How many ones though? You probably know the better than I do. Haven't we been talking about like miniature ones?\r\n\r\n\r\nNikolas Hulewsky (49:15.86)\r\nIt's still gonna take five years. It's not even necessarily about the approval process. It just takes a long time to build these out. Probably the quickest ones that we could do is we could spend solar, wind, those types of power, but then we have other problems, which are how do we store the power? How do we transmit the power? We gotta build this whole infrastructure. so that's one piece is like, could we even create the generation? And then the second piece would be rationing. I mean, that's effectively what we're talking about is like,\r\n\r\n\r\nGarth Fasano (49:45.735)\r\nThat would be.\r\n\r\n\r\nNikolas Hulewsky (49:45.826)\r\nDo you ration power to people?\r\n\r\n\r\nGarth Fasano (49:48.356)\r\nYeah, that would be a pretty interesting future. I hadn't thought about it before because I just find it hard to imagine Americans accepting that. Like in the face of so many things where we've been told to ration, we generally don't.\r\n\r\n\r\nNikolas Hulewsky (50:02.862)\r\nWe should just, we should form it as a reward. We should be like, hey everybody, the hours of three and six, just get out, get outside, just go hang out. You'll still be paid your full wages. Just go have fun. You know? I don't know. Anyways, that was a weird, that's it. It's something I've been thinking a lot about recently, cause I'm like, man, we're using more and more and more and more. We don't have the capacity to meet the demand of just natural growth within the United States. But then now we have the LLMs that are coming online. What the freak is going to happen?\r\n\r\n\r\nYes, dude, it's like the debt. I'm sorry. I was just looking at this weekend with my son. We get $5 trillion in. We spend $7 trillion a year.\r\n\r\n\r\nGarth Fasano (50:43.271)\r\nFundamentally, I just don't know how that works. That makes me nervous. I mean, that's why, I this goes back to like, I paid off my SBA loan as fast as I could, because that kind of thing just makes me nervous.\r\n\r\n\r\nNikolas Hulewsky (50:51.618)\r\nIt should make you nervous. Anyways, yeah, we'll probably cut those parts out. But what's your plan? What's your plan with this company? Are you wanting to expand aggressively into other verticals or are you like, hey, I home services is the thing I'm going to stick in the land and expand mode.\r\n\r\n\r\nGarth Fasano (51:07.271)\r\nI think what we are looking for right now is the early adopters that are ready for this kind of motion and this kind of efficiency in their business. There are still big businesses with smart folks that are going and trying to build traditional call centers. And that's sort of, it's concerning that that's still sort of the thesis that smart people have because there's just no way that that's the future in.\r\n\r\n\r\npretty short period of time. so our plan, I mean, we already do have enterprise clients in our pipeline that are outside of home services. And so I expect that we will probably not make the leap to sort of B2B sales, like, cause that is a much more competed spot with AI. Like you can see a lot of AI SDRs. We are not trying to go get into that knife fight. we think that there is so much opportunity in the small business space. And I think.\r\n\r\n\r\nNikolas Hulewsky (51:55.384)\r\nYeah.\r\n\r\n\r\nGarth Fasano (52:05.871)\r\nIt actually has the opportunity to impact the small business community massively. I, I personally know so many of our clients now and many of them feel like trapped if they are taking their own calls. Like, you know, they, they have to have their phone on them 24 seven it's the morning and they're at the gym and they get a lead. They have to like stop doing their reps and call that lead. Cause they know they just spent 50 bucks on that lead. And if they don't call them right now, their competitor probably will. And it's over and they just like literally flush 50 bucks down the.\r\n\r\n\r\nNikolas Hulewsky (52:22.318)\r\nfor sure.\r\n\r\n\r\nGarth Fasano (52:34.833)\r\nThat is a sort of intense pressure that never stops. And so I think we do, with this company, we have such a bigger mission. Like part of the American dream is, I think, buying a business, creating equity and real wealth for you and your family, like material wealth. And that is not tens of millions of dollars. That's a very comfortable American lifestyle, though, that it can create. And I think that we've...\r\n\r\n\r\nsort of a trick, like you become trapped day to day and you do this because you hope you can spend more time with your family, yet you're sort of chained to your phone in the modern technology world.\r\n\r\n\r\nNikolas Hulewsky (53:09.216)\r\nI agree with you. think that this is going to become more and more a thing. What are you calling it? It's not a call center. It's not like it's not a call center anymore. It's a what? It's a, just a sales platform.\r\n\r\n\r\nGarth Fasano (53:17.447)\r\nIt's a sales platform. We probably need a better name than that, but that's what we're on right now. the, current sort of, you know, I said, have a sort of this after hours solution. call it the anytime agent. but you know, there is going to be this massive sales solution. And probably the reason we haven't named it is because we actually think it needs to own everything from lead to cash. Like there is the other big break for small businesses in the model is that, you know,\r\n\r\n\r\nthey're spending billions and billions of dollars to purchase leads that don't convert. And like that part of the system is broken. Like they're buying leads that aren't converting and you know, the balance sheets show who is making the most money as a result of that. And that seems like something's wrong there.\r\n\r\n\r\nNikolas Hulewsky (54:05.144)\r\nJeez, man, the thing I love about this idea, and obviously this is one product in a sea of products that are currently being thought through, but there is going to be an arbitrage. I know a lot of tech bros or finance bros are like, we freaking love arbitrage, bro. But like you're saying, right now there's billions of leads that go unconverted by that company, but they go converted somewhere else. That person who was looking for something ends up making a purchasing decision.\r\n\r\n\r\nfor the most part somewhere else. And so there will be this gap is my feeling for all AI technology where the early adopters see such an outsized return on their investment early on in AI. Everybody's going to be looking to them and be like, well, what are you doing? And eventually everyone kind of implements it and it gets to parody again. And there will be another opportunity for differentiated or later. But that period of time, that arbitrage between the early adopters and every, but the laggards, I think it's going to make a lot of people, a lot of money.\r\n\r\n\r\nThere's going to be a lot of businesses that just crush it and create a competitive advantage, like a first movers advantage that. Yeah.\r\n\r\n\r\nGarth Fasano (55:11.687)\r\nThere's, mean, absolutely. mean, the example that I can give where I think that this is going to pop so fast pretty soon is that announcement that Google made where in local search and select verticals and in select markets. And the example they gave was like, I think auto mechanics and pet groomers and they're using San Francisco and they did pet groomers near me. They showed, and this was posted on X by Google, by Google. And there's a button that showed up in the bottom like,\r\n\r\n\r\nNikolas Hulewsky (55:32.728)\r\nMm-hmm.\r\n\r\n\r\nGarth Fasano (55:40.028)\r\nshowed you the normal search results. And then it said, get more information with AI or something like that. And you click that button, it walks you through a quick workflow where you select the businesses and then Google's AI calls those businesses with an AI gets the pricing, gets the availability and gets a basic understanding of the service and then sends an email or a text message back to the consumer. So, I mean, this is probably like,\r\n\r\n\r\nThis is going to be so hard for businesses to manage in the way that many of them operate today because of for a couple of reasons. One, now you have the phone potentially we'll use the word. I'll make it a little bit, you know, exciting, like ringing off the hook with AI. So now you've got to answer AI. You've got to give them information. So you're spending, you probably paid to be in that result. Now you're paying a human to answer the phone and you are not going to get the lead's name. You're not going to get their phone number and you're not going to get their email address. So.\r\n\r\n\r\nSo you think about, and now imagine where there's AI services to answer that. so imagine it's like, you know, talk about efficiency. Imagine it's like this, where an inbound call comes in, you have your AI rainmaker service pickup. It identifies that it's Google's AI, not a different one identifies it as Google AI call, not a human. And it triages it differently. Maybe it can speak at 10 X speed to reduce the tokens or the call length to reduce the cost and\r\n\r\n\r\ndeliver that more efficiently and in a way that puts your business at the top of the results in that email or text message back to the consumer.\r\n\r\n\r\nNikolas Hulewsky (57:10.414)\r\nDude.\r\n\r\n\r\nGarth Fasano (57:11.399)\r\nWhen you say like, we're about to potentially see some massive gaps emerge, I think the answer is yes, like undoubtedly.\r\n\r\n\r\nNikolas Hulewsky (57:16.878)\r\nWell, the first one that we saw was Meta released their earnings two weeks ago at this point. And the thing that really stood out to me is their ads business, it grew like crazy and it's more profitable than ever. Why? Because small businesses love Meta ads and they keep using it. Yes, it's true. But because Meta ads has become better by utilizing AI. So it's easier for small businesses now to target their, you know, ICP.\r\n\r\n\r\nto convert leads to actually find the right people. of course I'm gonna go to Meta. So they've used AI to make their product better. We're now gonna start seeing that. I think, like you're saying, trickle down to the sales process, the fulfillment process, the billing process, the HR hiring and onboarding, like all those different processes. And it's gonna be, yeah, man, it's gonna be so crazy.\r\n\r\n\r\nGarth Fasano (58:06.907)\r\nI mean, this is, this is, feel like, you know, the moment for our generation to, to like make work and change the world. Like this is, this is the time. And so like, asked me like, what is my goal? Like that's my goal. Like, you know, going back to ETA, that's an asymmetric bet on yourself. being, you know, having a good run at that and then taking another asymmetric bet is also a part of the fun. Like there's a.\r\n\r\n\r\nNikolas Hulewsky (58:10.082)\r\nto Gold Rush.\r\n\r\n\r\nYeah.\r\n\r\n\r\nGarth Fasano (58:32.849)\r\nThere's, there's, think it's a Jeff Bezos quote, but it's like, you know, in, baseball, the best outcome you can have is like four points, but in business you can get 10,000. So like always go for it.\r\n\r\n\r\nNikolas Hulewsky (58:42.33)\r\nMmm. Yeah, yeah, yeah, yeah. Yeah, a grand slam is only four runs. Like you hit a grand slam is like four runs. Business, there's no camp. There's no cat. Dude.\r\n\r\n\r\nGarth Fasano (58:46.511)\r\nRight, if you a grand slam, there's no cap. Yeah, exactly. This is our generation's opportunity.\r\n\r\n\r\nNikolas Hulewsky (58:56.418)\r\nI love this. We're gonna end it here. Where can people find you?\r\n\r\n\r\nGarth Fasano (58:59.783)\r\nHit me up on LinkedIn, GarthFasano, and find us at rainmaker.ai.\r\n\r\n\r\nNikolas Hulewsky (59:06.038)\r\nCool. All right, Garth, stay on for a second. Let's let this.",
  "metadata": {
    "duration": "",
    "date": "2025-08-27",
    "platform_source": "Google Drive"
  }
}