{
  "episode_number": "138",
  "episode_title": "How to Quickly Grow Your Newsletter Without Ads with Derek Kolstad",
  "guest_name": "Derek Kolstad",
  "business_name": "Daily UI, Remote Jobs, Pixel Kit",
  "transcript": "﻿Derek (00:00.459)\r\nLove it.\r\n\r\n\r\nNikolas Hulewsky (00:01.262)\r\nAll right, Derek, I'm freaking I'm so excited to talk to you because I'm in the middle of this newsletter goal that I have, which is over the next 60 days, I need to 10,000 subscribers, which is a very lofty goal. If anybody who knows anything about newsletters knows like a personal newsletter getting 10,000 subscribers from scratch in 60 days is a lofty goal. Let me ask you a question. Am I crazy?\r\n\r\n\r\nDerek (00:24.205)\r\nUm, no, uh, you could do 10 grand 10, 10,000 in 60 days. That's not too crazy. Um, it, it's all about having, they're just the right distribution system. And if you can nail that now, um, nail your message and, uh, create kind of this Trojan horse to attack something from a top down strategy, you can't brute force bottom up trying to.\r\n\r\n\r\nNikolas Hulewsky (00:32.578)\r\nReally?\r\n\r\n\r\nDerek (00:52.651)\r\ndo small tactics so if you want to scale fast like that I think you're gonna have to go top down. Yeah, and you could, I think you can do it.\r\n\r\n\r\nNikolas Hulewsky (00:58.35)\r\nI gotta go big. Okay. Okay, I can't I can't wait to get into tactics. Three, we were planning on doing this podcast anyways, because we we spoke what six months ago, probably. And my team screwed up, but we lost the audio. So I wanted to get you back on because I'm like, it was such a good conversation. You have a newsletter though. Like this is this we're speaking your book right now. Give the give the people some red meat like\r\n\r\n\r\nDerek (01:13.666)\r\nMaybe.\r\n\r\n\r\nDerek (01:22.829)\r\nYeah.\r\n\r\n\r\nKinda.\r\n\r\n\r\nNikolas Hulewsky (01:28.566)\r\nYou're legit. How many subscribers do you have?\r\n\r\n\r\nDerek (01:30.412)\r\nWell, I have a few newsletters. Of course, a motorcycle goes by as soon as it's done. That's so funny. The last time we did this, yeah, I was in a coffee shop and had crazy bad audio, and now that I'm not, that one time. All right, so I have a few newsletters and combined, I have over 600,000 subscribers now. So I'll add 10 or 15,000 a month, but the main...\r\n\r\n\r\nNikolas Hulewsky (01:34.67)\r\nThat's rad. rad. No worries.\r\n\r\n\r\nNikolas Hulewsky (01:45.038)\r\nYou're great.\r\n\r\n\r\nNikolas Hulewsky (01:53.058)\r\nmy gosh,\r\n\r\n\r\nDerek (01:58.669)\r\nnewsletter is called daily UI and that's a newsletter for designers basically so that one's at like a little over 450 and Then I've got one that's a little over 120 for a job board remote jobs comm plug that and then I have a tiny digital product that's got a few thousand subscribers and a Like a coming soon wait list called pixel kit pixel kit comm\r\n\r\n\r\nNikolas Hulewsky (02:14.509)\r\nNice.\r\n\r\n\r\nDerek (02:28.508)\r\nis going to be a new little pet project. And so that's got a pretty decent wait list.\r\n\r\n\r\nNikolas Hulewsky (02:33.046)\r\nOkay, so first of all, you're legit, like 600 plus 1000 subscribers, even if even whatever it's across a couple. It's incredible. You have guys like so he'll bloom who's one of the most well known newsletter guys he has about a million subscribers so you're you're well on your way to having\r\n\r\n\r\nDerek (02:48.406)\r\nYeah. The difference is, yeah, those guys actually put a lot of spin behind it. So you see a ton, you know, the cost per acquisition and it's a lot of monthly push for that. I've never spent a dollar. I haven't done a paid ad before. So.\r\n\r\n\r\nNikolas Hulewsky (03:07.534)\r\nWait, you've gained over 600,000 subscribers without spending a dollar on.\r\n\r\n\r\nDerek (03:10.784)\r\nSir.\r\n\r\n\r\nI've never spent, and I think I kind of, you know, I was in this mindset of like, I have to be this GI Joe and parachute in and do everything, guerrilla marketing and get as far as I can before I have to spend any money. And then once I kind of tapped into a few pipelines that were actually working, I just kind of realized, you know what? It's much better to have a consistent flywheel that'll keep the whole process in motion.\r\n\r\n\r\nNikolas Hulewsky (03:13.688)\r\nThat's amazing!\r\n\r\n\r\nNikolas Hulewsky (03:40.344)\r\nMm-hmm.\r\n\r\n\r\nDerek (03:42.73)\r\nthan it is to do transactional ads and stuff.\r\n\r\n\r\nNikolas Hulewsky (03:45.23)\r\nYou know, you know, Chris, my business partner, mobile and partner Chris Kerner. He's grown 100,000 subscriber newsletter in the last 12 months and hasn't hasn't spent a dollar on ads. It's all it's all organic, driven from his socials, and he's adding like 20,000 subscribers a month, which is. Which is great. I mean, you're adding 15 across your platforms, right? So but once you once you got the flywheel going, it's a lot easier to keep that momentum up.\r\n\r\n\r\nDerek (03:48.073)\r\nYeah. Yeah. Yeah.\r\n\r\n\r\nDerek (03:54.219)\r\nThat's pretty good.\r\n\r\n\r\nPretty good.\r\n\r\n\r\nDerek (04:02.677)\r\nYeah.\r\n\r\n\r\nYeah.\r\n\r\n\r\nTotally. Running a business or something, any type of product, it is like a steam train. It's easier to stay in motion than it is to get in motion. And it takes a lot of steam to get that thing out of the gates. But once you have it rolling, it should be.\r\n\r\n\r\nNikolas Hulewsky (04:26.126)\r\nI agree. I've also said momentum is hard to build, but it's also hard to stop. And so sometimes sometimes you stop doing the things that got you the momentum in the first place and you don't really see that show up until months or years later because you've already got all this momentum behind you. So I want to give a quick context. So I've interviewed over 120 entrepreneurs since last year. It's been nuts. I've been at least three episodes a week for the for not even a year. I officially started this in April of 2024.\r\n\r\n\r\nDerek (04:31.368)\r\nYeah, yeah.\r\n\r\n\r\nDerek (04:40.478)\r\nBye.\r\n\r\n\r\nDerek (04:52.33)\r\namazing.\r\n\r\n\r\nNikolas Hulewsky (04:56.936)\r\nAnd I did it because I wanted to find out about different businesses. And I've kind of gotten tired of the theory. I mean, I still love it. I'm still super curious. But I see all these people like you who have built things and like you're making real money. And I've wanted to start testing the ideas that I've had on my podcast. And the one that I keep coming back to is newsletters. Just because that's the one that people are like, anybody can do this. And I want to put it to the test.\r\n\r\n\r\nDerek (05:14.41)\r\nNice.\r\n\r\n\r\nNikolas Hulewsky (05:25.26)\r\nCan anybody do it? I don't know. Let's try it. I'll put I'll put some money behind it and and let's see if I can actually grow newsletter. But the way that I'm thinking about it and the way I want to go to 10,000 subscribers is because in order to monetize it in order for it become a business, you've got a couple different channels. I'm going to name them. You tell me where I missed. You can monetize your newsletters through ads so you can have sponsors who pay you money to market their product and you can do it on things like\r\n\r\n\r\nSpark Loop or Beehive or. Some of those types of platforms or you can have private. Engagements who you know pay you money to to market in their newsletters. So that's one avenue. Another avenue is similar, but different. It's affiliates so you don't necessarily get money up front, but you put a link or product in your newsletter. And then people click on it and they go to that and if they purchase because you have the affiliate link. It's trackable. It's attributable. You get money for that.\r\n\r\n\r\nThat's that's way number two way number three is you have a digital product that you sell. So you've got this newsletter, you've got people who are subscribing to you and it's like, by the way, I'm the business guy, take my course on how to buy a business. This is a digital project product that I sell. And the last way it's similar but different, a business that you advertise through the newsletter. So I talked about ads, that was the first one. Well, instead of taking money and\r\n\r\n\r\nDerek (06:27.114)\r\nSo.\r\n\r\n\r\nNikolas Hulewsky (06:47.968)\r\nin ad spend from other people. You just put your own product into the newsletter and think of it as a distribution channel to grow your business. Those are kind of the four ways that I think about monetizing newsletters. Did I miss one?\r\n\r\n\r\nDerek (06:58.907)\r\nNo, that seems pretty legit. You could just sell the newsletter as a whole. So that could be like the exit strategy monetizing.\r\n\r\n\r\nNikolas Hulewsky (07:07.392)\r\nYeah, yeah, as it as an exit. I'm just saying like ongoing cash flows. That's kind of how they're generated.\r\n\r\n\r\nDerek (07:13.514)\r\nYeah, that's pretty much the way to do it under the hood. know, you'll see a lot of people sell secondary things that aren't necessarily a product, that it could be a service. So you could be selling your accounting services or things like that if you're a CPA. So you could leverage it to sell products or services. So, but you either sell someone else's or you sell your own. That's pretty much it.\r\n\r\n\r\nNikolas Hulewsky (07:35.854)\r\nAnd the way that I've seen it, like let's say I'm taking ad money is it's decided on this thing called cost per milli CPM. So they take your total number of newsletter subscribers. They look at your open rate and they say on a monthly basis how many of them are opening your newsletters and then they pay you on a cost per milli. So I'll just do an example. If I have a hundred thousand newsletter subscribers, my open rate is 50%. That means I send four newsletters a week or excuse me, four newsletters a month. So I've got.\r\n\r\n\r\n400,000 50 % open rate. I'm now at 200,000 people who have actually looked at that. The cost per million is actually cost per thousand, so I'm going to divide 200,000 by 1000. Now I've got 200 and then they'll pay me a certain metric. So let's just say $50 per milli. I've now got what is that $10,000 a month in ad revenue. Based on the number of opens, is that correct?\r\n\r\n\r\nDerek (08:33.25)\r\nYeah, you can totally do it that way.\r\n\r\n\r\nNikolas Hulewsky (08:35.63)\r\nOkay, but you don't do it that way,\r\n\r\n\r\nDerek (08:37.959)\r\nI kind of do and kind of don't. There's a lot of nuances to it. One is that sometimes they're just not apples to apples where depending on your industry, one is going to be more valuable than the other. that CPM could fluctuate and then depending on the geography too. if like I have primarily US audience, so English speaking.\r\n\r\n\r\nUsually higher budget, things like that that's more attractive for a sponsor. And then, yeah, same. Are you going into a localized one or is yours just gonna be a personal? Okay.\r\n\r\n\r\nNikolas Hulewsky (09:18.614)\r\nNo, this is a personal newsletter, which I think is harder, to be honest. And maybe I'm wrong. What do you think?\r\n\r\n\r\nDerek (09:23.688)\r\nYeah. The reason it's harder to do the personal newsletter is there's a level of friction around that where you tell me, hey, I have a personal newsletter. I have to know who Nick is and I have to know the context of why that would be valuable to me. So that extra layer creates extra friction, makes it harder to sell the idea. So harder to spread.\r\n\r\n\r\nIf it's easy to tell, it's easy to sell. That's the way it is.\r\n\r\n\r\nNikolas Hulewsky (09:56.846)\r\nWell, that's a good framework. If it's easy to tell it's easy. So I, I kind of think about newsletters in sort of three buckets. There's a geographic bucket. So you have these like local newsletters, right? Jazz, who's who's building in public, he has a Winnipeg newsletter. That's just Winnipeg. Ryan Sneadon has a newsletter that's just Annapolis. There are topic based newsletters, which are like, hey, this is the particular subject which\r\n\r\n\r\nI would say kind of what I'm focusing on is hey, how to buy, start and scale your first business. And then I think there can be demographic based newsletters, which are. These are for moms, millennial moms who have a kid at home or. I'm trying to think of whatever these are for seniors from from AARP. And then you can. You can mix and match those right like you can have a demographic based newsletter in a geography or a topic based newsletter. In a in a geography.\r\n\r\n\r\nDerek (10:45.755)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (10:54.702)\r\nSo that's kind how I think about it. But to your point, I think that the topic based newsletters are harder. Especially if you're building it around a personality or a brand, because you've got to build brand awareness and then figure out where you're going to get those potential customers from. Whereas geographic, it's like cool everybody in Winnipeg. Alright, I'm going to dial up some Facebook ads and target them. Is that right?\r\n\r\n\r\nDerek (11:06.727)\r\nGreat.\r\n\r\n\r\nDerek (11:17.414)\r\nThat's right. But then again, if you actually wanted to dominate one of those industry verticals and own that market on something, you can be an expert that someone else just can't compete with because they don't have that edge. So like if you're saying you're spinning up one in Toronto or Austin or something, pretty much I can compete with you or anyone can compete with you from wherever, you know, you don't have to be in Austin. You could be sitting in Rome. Doesn't matter. So I don't know what the competitive\r\n\r\n\r\nis other than you're a local and you can meet people. It's so much broader if you go for an industry one that you want to try to expert.\r\n\r\n\r\nNikolas Hulewsky (11:56.13)\r\nGive me, give me an idea. have 600,000 subscribers. Can you give me mesometrics? Like what are your open rates? What's your top line revenue?\r\n\r\n\r\nDerek (12:02.565)\r\nYeah, and to your point, different types of newsletters have different types of performance. So, for example, daily UI is this. I don't pitch it as a newsletter. I pitch it as a design challenge. And that one little tweak makes it kind of more unique. It makes it stand out. A lot of the way, you know, your success,\r\n\r\n\r\ncan ultimately be kind of determined by either minimizing or maximizing certain variables. So you can either be really specific on one thing, lower your costs, compete better, or you can be better at marketing and grow and maximize on one end. So for the design newsletter, that has a lifetime average open rate of 42 % across over 450,000 subscribers.\r\n\r\n\r\nNikolas Hulewsky (12:58.68)\r\nWow.\r\n\r\n\r\nDerek (12:59.046)\r\nBasically as your list grows, it's kind of common for the open rate to actually decline. So of that 450, there's probably at least seven or so hundred thousand that have actually passed through it over the lifetime of it. You have churn, people churn out, but the unsubscribe rate on that is crazy, crazy low. It's probably under 1 % on that newsletter.\r\n\r\n\r\nNikolas Hulewsky (13:21.07)\r\nSo when you say 1%, is that like 1 % per issue? Is that 1 % per month, per year?\r\n\r\n\r\nDerek (13:24.676)\r\nI think I just had that as like an annual 1 % under 1 % annually. Yeah. Per month or something. It's just a fraction of that. It's very tiny. And I think that's a function of just maintaining your lane. You know, there's lot of these newsletters that become very generic and that one, I just maintain my lane. Another example, for example, my newsletter for remotejobs.com is just like a roundup of jobs.\r\n\r\n\r\nNikolas Hulewsky (13:27.968)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (13:33.134)\r\nThat's super low.\r\n\r\n\r\nDerek (13:54.266)\r\nJob boards have terrible newsletter performance and they do. I know that across many job boards because I've looked at buying other job boards and career sites from other people as well. I thought, is that an easy strategy to grow is just acquire others. It's not a good strategy for that particular niche. The reason for that is churn is built into the product with a job board. They don't stick around for very long. You might see someone two, three, four months, but\r\n\r\n\r\nthen it's pretty much over because the whole purpose was to find a job, know. So, churn is built into it. And another thing is you'll have really low click rates on those because, you know, nothing compelling, you send them these jobs and they're not interesting, there's a ton, you gotta click them. So, different needs.\r\n\r\n\r\nNikolas Hulewsky (14:41.262)\r\nSo give me an idea right now, what do your newsletters generate a month?\r\n\r\n\r\nDerek (14:46.117)\r\nOkay, so this month, it's the 7th of March. Combine them already over $30,000. That is not just for a week though. That's pretty much just means I've booked out the whole month. So I'm pretty confident the year, like I would like to peg it as basically trying to make a dollar per subscriber per year. So I'm pretty confident I'll hit the $400 or $400,000 mark, maybe hit half a million this year.\r\n\r\n\r\nI don't really monetize the job board newsletter. It's a programmatic newsletter, so it's kind of different, but daily UI, I sell big sponsored dedicated campaigns and ads in this automation sequence. The main thing that makes daily UI kind of a unique style. It's literally daily and it's fully automated and.\r\n\r\n\r\nNikolas Hulewsky (15:38.498)\r\nIs daily UI day literally daily?\r\n\r\n\r\nDerek (15:44.503)\r\nI haven't actually written an issue in years. Full Suite, I just set up a workflow, predefined all of those SINs. And once you subscribe, you're into this workflow and you're supposed to create different designs. The idea is you'll build a design portfolio. It'll challenge your skills. You'll learn more. And I also share\r\n\r\n\r\nwork from subscribers. So if you subscribe and you create a neat piece of design work and you share it on Dribbble or Behance or Twitter, I'll share those. So, a way to feature subscribers.\r\n\r\n\r\nNikolas Hulewsky (16:24.175)\r\nSo let me ask you this. The job board, that weekly, monthly, daily?\r\n\r\n\r\nDerek (16:29.028)\r\nI'm doing that one weekly now and it could even go down to every two weeks.\r\n\r\n\r\nNikolas Hulewsky (16:38.03)\r\nOkay, I'm gonna, I just wanna do some quick math, all right? So you said you wanna do $600,000 in revenue, right?\r\n\r\n\r\nDerek (16:48.837)\r\nI think I'll do four to six. Like I'm pretty confident I'll do four. And that would be less than a dollar per subscriber. But because I'm not monetizing a lot of those subscribers, you know, I'm probably 20 % I'm not monetizing. And that's okay because one easy way, possibly the easiest way to grow a newsletter is to cross promote it.\r\n\r\n\r\nNikolas Hulewsky (17:13.198)\r\nSo here's my question. All right. I'm just doing back at the end. I was just doing some back of the envelope math. You got 600,000 subscribers. One of them is a daily newsletter. One of them is a weekly newsletter. If I just did the math that I've been doing. All right. Number of sends, 42 % open rate. That's how many eyeballs are going to be seen on these newsletters. And then you say, all right, the CPM is $50. I'll even, I'll even say CPM $20. I'm getting like,\r\n\r\n\r\n$1.4 million in like potential top line revenue, but you're not getting $1.4 million. Is that a conscious choice? Are you like, I don't really want to\r\n\r\n\r\nDerek (17:50.34)\r\nRight.\r\n\r\n\r\nWell, it's really hard to actually achieve. You can't book all your slots. No one can sell out all their slots, basically. It's very, very hard to do. And of that, like I'm not monetizing those, the smaller list, 100,000 and 70,000 on this other list. Not monetizing those, but...\r\n\r\n\r\nYeah, that's a trickier one too because you.\r\n\r\n\r\nNikolas Hulewsky (18:25.442)\r\nWhen we spoke when we spoke the last time I got the sense from you that you hadn't you're like, I know I could get more but it's a conscious choice.\r\n\r\n\r\nDerek (18:32.588)\r\nYeah, yeah, think I could, you could try to juice it if you really did leverage it. What I have is like, I'll pre-sell things too. So I'm sold out for the rest of this month and next month. So what'll end up happening is maybe if I add 30 or 50,000 subscribers in the next couple months, those rates aren't gonna change for that sponsor. They've already pre-booked. So in theory, what you should be doing is, yeah, as you're,\r\n\r\n\r\nsubscriber base increases, you should be increasing your price because you say it's proportional if you're using the CPM basis. But it's easier to pre-sell things. Lock in a rate now and get them on the books. That's way...\r\n\r\n\r\nNikolas Hulewsky (19:17.304)\r\nI also think there's, I also think there's nuance to it. Like sometimes there are people who push too far and they're like, I want to get as much revenue as I can every single time. And maybe you could get a $50 CPM or a hundred dollars CPM. But from talking to you, you were like, well, the enjoyment of the newsletters, it's almost completely automated. And I like, don't have to do that much stuff. I feel like if I start investing more, then I have to build a bigger team. And it's kind of like the Mexican fishermen. Have you ever heard that story?\r\n\r\n\r\nDerek (19:46.039)\r\nRight. Yeah, yeah, I have. Yeah, no, I totally get that. The other thing, though, is let's say, so my job board is about two years old. The way that I got it off the ground, growing subscribers and growing the traffic was promoting it through my other newsletter. And if you're cross promoting one of your own products, that means you have less space for ads. If I'm hitting you with a daily email already and I send one per week as a sponsored one.\r\n\r\n\r\nNikolas Hulewsky (20:04.494)\r\nMmm.\r\n\r\n\r\nDerek (20:15.03)\r\nYou have to pick and choose, you know, are you gonna promote your own product or are gonna promote someone else's?\r\n\r\n\r\nNikolas Hulewsky (20:19.952)\r\nWhen did you start doing that? When was that?\r\n\r\n\r\nDerek (20:22.466)\r\nmaybe two years ago, it finally launched in like December, 2022.\r\n\r\n\r\nNikolas Hulewsky (20:23.822)\r\nYeah, I mean.\r\n\r\n\r\nBecause if I was looking at it, I would say, what's a good customer acquisition cost for a newsletter subscriber?\r\n\r\n\r\nDerek (20:35.062)\r\nYeah, that's a good question too, because I've never paid for one. It's hard to say. I see people do that all the time.\r\n\r\n\r\nNikolas Hulewsky (20:37.816)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (20:41.474)\r\nWhat I've heard is between one and two dollars is like normal.\r\n\r\n\r\nDerek (20:45.888)\r\nIt depends on how you monetize it, you know?\r\n\r\n\r\nNikolas Hulewsky (20:48.782)\r\nSure, sure. just some people have gotten way less. They paid paid way less for subscribers. Some people have paid more. But if I was just doing back in the envelope, I'd be like, OK, you got 150 subscribers from cross-promoting to your other newsletter. That was potentially between 150 and 300 thousand dollars of value that you created for yourself. Right. So, yes, there was missed revenue because you were filling the ad slot. However, there was a lot of value created.\r\n\r\n\r\nDerek (21:12.802)\r\nYeah.\r\n\r\n\r\nYeah, you have to weigh those opportunity costs if you have something else that you want to own and really grow and scale and add value to. Another thing is I've always done this since day one, offered a 15 % rebooking discount. So if you book a second campaign, you get a 15 % discount. those will sneak up on you too. I've had some sponsors book like over a dozen times and\r\n\r\n\r\nThat means you're giving that discount continuously. basically grandfathered that in on a lot of people. And you kind of have to do that to get the ball rolling so that you can have a portfolio of clients that you've worked with. You're more attractive to new sponsors. But the bottom line is, you know, everything gets easier every time you do it. So you just gotta keep doing it.\r\n\r\n\r\nNikolas Hulewsky (22:12.898)\r\nOkay, so so for me, let's workshop this. I want to gain 10,000 subscribers in the next 60 days. What's step number one, what early like, you're the consultant, Derek, you're the guru, help me understand what I need to do.\r\n\r\n\r\nDerek (22:16.417)\r\nLet's do this.\r\n\r\n\r\nGotcha.\r\n\r\n\r\nDerek (22:27.916)\r\nHere's what I would do. I would first define the benefit of this newsletter. There's so many, it's so vague. People don't buy products, they buy improvement. What's the improvement that we're making in someone's life? You can entertain someone or you can improve them, that's it.\r\n\r\n\r\nNikolas Hulewsky (22:39.278)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (22:45.806)\r\nOkay, so let me tell you what it is and then you can tell me that too broad that sucks or all right, you're playing in the same ballpark that you should be. My newsletter is geared towards first time entrepreneurs and watchpreneurs who want to buy, scale or start their first business and have not yet made their first million dollars. That's my ideal customer. my newsletter is helping them buy, start or scale their first business.\r\n\r\n\r\nDerek (22:52.481)\r\nThat's right.\r\n\r\n\r\nNikolas Hulewsky (23:13.718)\r\nIs it too broad? it too\r\n\r\n\r\nDerek (23:16.649)\r\nNo.\r\n\r\n\r\nNikolas Hulewsky (23:19.244)\r\nYou don't like it. can tell by your face. Tell me what it don't hold back. I'm curious. Like what's\r\n\r\n\r\nDerek (23:22.934)\r\nYou need a really snappy short slogan. There needs to be something or it needs to be built into the name as to what it is. I so I like.\r\n\r\n\r\nNikolas Hulewsky (23:30.158)\r\nMmm.\r\n\r\n\r\nSo what if I was like, I wanna help you make your first million dollars.\r\n\r\n\r\nIs that too snappy?\r\n\r\n\r\nDerek (23:39.457)\r\nThat's kind of too broad now, because a million dollars doing what? Like you're going to teach me to write a book and I'm going to be bestselling author. So yours is basically.\r\n\r\n\r\nNikolas Hulewsky (23:45.831)\r\nI wanna help, I wanna help.\r\n\r\n\r\nYeah, first time entrepreneurs and entrepreneurs make their first million dollars.\r\n\r\n\r\nDerek (23:57.695)\r\nYeah, I think you could even keep consolidating it, just keep collecting that. Like if you're a first time entrepreneur or a wantrepreneur, you're just, you're in that mindset. You're still, you're like an early stage founder kind of is where you are. First time founder style. So then you're appealing to two sets of people. One who are already running a business and two people who want to. So you could work any normal job.\r\n\r\n\r\nNikolas Hulewsky (23:57.838)\r\nBecause I'm not. Okay, help me.\r\n\r\n\r\nDerek (24:27.656)\r\nyou could be anywhere in the workforce and you want to go buy one. So what types of businesses are you going to focus on? That's the question now.\r\n\r\n\r\nNikolas Hulewsky (24:31.117)\r\nExactly.\r\n\r\n\r\nNikolas Hulewsky (24:36.546)\r\nYeah, my the businesses I would focus on are it's not tech. These aren't SaaS companies. These Yeah, these would be services businesses, mom and pop businesses, agencies that you want to launch and then exploring the ways to scale them by them or start them. Like the businesses I've ever operated have been up to $30 million in revenue. So like that's good size, but I feel like my my sweet spot is $10 million or less.\r\n\r\n\r\nDerek (24:41.556)\r\nRight. Local business.\r\n\r\n\r\nDerek (24:54.1)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (25:05.228)\r\nbusiness. I so those are small businesses, those are typically going to be first time entrepreneurs, or watch banners who are buying into those businesses. So that's why I picked that range.\r\n\r\n\r\nDerek (25:15.445)\r\nYeah, no, that totally makes sense.\r\n\r\n\r\nYeah, once again, if it's simple to tell, it's simple to sell. We need a really, really snappy short slogan of how you say that. Because this is people, are we buying a business or am I starting one?\r\n\r\n\r\nNikolas Hulewsky (25:28.462)\r\nHmm. Okay.\r\n\r\n\r\nNikolas Hulewsky (25:34.328)\r\nWell, I've done all of that. So it's like, I'm...\r\n\r\n\r\nDerek (25:36.576)\r\nWhich one which which is the focus here?\r\n\r\n\r\nNikolas Hulewsky (25:40.558)\r\nwhat I want is the focus to be, I can help you buy, can help you start, or I can help you scale your business. But you're saying that's too broad?\r\n\r\n\r\nDerek (25:46.912)\r\nIt feels like it for me. I would just kind of get paralyzed on the landing page.\r\n\r\n\r\nNikolas Hulewsky (25:50.989)\r\nthing.\r\n\r\n\r\nthe people that have on my podcast have done all of those, right? They're buyers, they're starters, they're scalers. And so I'm drawing insights from those conversations to then apply to this newsletter.\r\n\r\n\r\nDerek (25:59.177)\r\nRight.\r\n\r\n\r\nDerek (26:03.572)\r\nYeah, I'll have to workshop on this idea.\r\n\r\n\r\nNikolas Hulewsky (26:06.008)\r\nOkay. Okay, so I'll continue. Let's say I workshop the idea. You were saying I've got to go big in order to get to 10,000 subscribers. What like what should my plan be?\r\n\r\n\r\nDerek (26:18.408)\r\nOoh, well, the plan is we define that improvement, you know, how you're going to improve a person's life. So that's the idea is like, I'll show you how to buy a business and, or I'll show you how to make a million dollars with a local business. Then we need your playbook. And now your playbook is kind of the lead magnet and you can promote that lead magnet. And if they all follow the same flow and it's consistent, it makes sense.\r\n\r\n\r\nNikolas Hulewsky (26:23.47)\r\nOkay.\r\n\r\n\r\nDerek (26:48.349)\r\nSo I'll kind of stay in your funnel. So we define that product and then you build a little flywheel for how you're gonna promote it. Social media, lead magnets, cross promoting others. It has to be a good enough little cookie that it's worth subscribing to.\r\n\r\n\r\nNikolas Hulewsky (27:02.126)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (27:10.698)\r\ninteresting. Okay, so step one is, what's the problem we're solving for the customer? It's essentially the product. So that's where I need to refine like, I can't be everything to everybody. to kind of refine that piece. The second piece is then okay, what's your playbook that becomes your lead man. So Chris grew to 100,000 subscribers, his kind of thing is, I had these entrepreneurs on my podcast, this is a really cool idea. Click on the link in the bio to get the business plan. And so that that's what's driven\r\n\r\n\r\nDerek (27:21.599)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (27:39.096)\r\nthe majority of his growth is like they're going to get the business plan and then they sign up for the newsletter and they they're staying for that. Is that kind what you're describing?\r\n\r\n\r\nDerek (27:45.917)\r\nYeah, yeah. And for yours, we'll have to think of it specifically. Like, I've never run a local business. I don't know what that's like. I've worked in them before, so there could be context there. But yeah, you would have to share some case studies because you're also building trust too. It's not some random guy. It's someone who's done it before. You want to know that you're getting advice from an operator.\r\n\r\n\r\nNikolas Hulewsky (27:52.76)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (28:10.926)\r\nOkay, so let's say that I've figured out the problem I'm solving, which is the product, the playbook, which is the lead magnet. What's next for me 10,060 days, what would you do? Am I just like posting videos on every platform I can and driving them to the lead magnet? Am I going to other newsletters maybe that I have relationships with that I've made on my podcast? I mean, I have a couple of people who've come on that have large, know, do I go to Derek and like, Hey man, would you mind recommend? You know what I mean? Like, what do you think is\r\n\r\n\r\nDerek (28:36.686)\r\nsponsors. What I would do is\r\n\r\n\r\nYeah, once I had a good lead magnet that was like how to build and buy a million dollar business, I would circulate that around to other people who, you know, there's a lot of local meetup groups like meetup.com. You can be a presenter. You can go and speak one week at a large meetup group and then you can incentivize people to share it on social media. You could look at cross promoting for other\r\n\r\n\r\nrelevant business newsletters. You could host a live little seminar. So next week is Nick's workshop and he's going to talk about how his experience is building or buying or selling a business. And during that workshop, you plug that you're actually launching this little lead magnet.\r\n\r\n\r\nNikolas Hulewsky (29:35.224)\r\nSo it's all trust building.\r\n\r\n\r\nDerek (29:37.227)\r\nEverything is, yeah.\r\n\r\n\r\nNikolas Hulewsky (29:38.19)\r\nyou're just describing you're going and you're, hey, this is my expertise is the lead magnet. It's like people are do I trust this guy? Or do I not trust this guy? And then they're more likely to click. I feel like the podcast has kind of played that role for me.\r\n\r\n\r\nDerek (29:49.326)\r\nIt pretty much has. And you have all those connections. So you've established a lot of those tracks already. Those tracks have already been...\r\n\r\n\r\nNikolas Hulewsky (29:55.704)\r\nHmm. You said you said in the very beginning you were like, it's not a crazy goal. You could do it. But in 60 days you get 10,000 subscribers. It's not just going to be the organic brute force bottom up approach. You're going to have to go top down. What did you mean by that?\r\n\r\n\r\nDerek (30:10.43)\r\nyou're going to have to find strategies and execute them that in a way that you can attack a large audience, not small. Like for example, the local meetup one, those could be pretty small. Maybe you go to a meetup and there's 50 people there. Even if you did that every day and everyone subscribed, it's not going to get you to a fraction in two months. So you have to think big, but you can think strategically in those. So if you do do a meetup group and.\r\n\r\n\r\nkind of incentivize some people in it to share with their audience. There's kind of network effects to that.\r\n\r\n\r\nNikolas Hulewsky (30:45.76)\r\nWhat did you do? Can you give me an example of what worked for you?\r\n\r\n\r\nDerek (30:47.357)\r\nI'll give you some of these honey pots. One that worked was there's a lot of these courses, Udacity, Coursera, Udemy, and they teach people design, they teach people software, you can learn to code. And I approached a lot of those instructors, course instructors, and said, hey, I've got this design challenge, da, da, da, you know, basically would help\r\n\r\n\r\nstudents build a portfolio and you'll have a lot of misses and what I found worked well was not just approaching the instructor but like an assistant instructor and say, hey Cathy, this is a neat thing. Students can build a portfolio and land better jobs, et cetera. They like sharing the idea with an instructor and bringing it to top. It makes them look good as well. And once they've incorporated that into their course,\r\n\r\n\r\nNikolas Hulewsky (31:23.822)\r\nHmm.\r\n\r\n\r\nDerek (31:46.605)\r\nas a free resource, that's its own little flywheel because I'm not touching it. It's just a free inbound lead system and it grows. I just went through a little list of how can I create all these little Trojan horse ideas that I can sneak into big communities without paying, without. So you need to, you need to make a list of how you can approach these little Trojan horses. Another thing.\r\n\r\n\r\nNikolas Hulewsky (31:54.946)\r\nWhat made you think of that?\r\n\r\n\r\nNikolas Hulewsky (32:07.886)\r\nMmm!\r\n\r\n\r\nDerek (32:15.612)\r\nthat worked really well was design is very visual, so it's easy to see and easy to share. So I would go pick my favorite designs and one of the most popular newsletters, the most popular issue that I would send would be a weekly one. And it would just be my best finds of the week. So it would be the best designs and designers love seeing, what do you consider the best? that open rates on that thing would skyrocket because people were always curious of what\r\n\r\n\r\nwhat was the best of the week? Yeah.\r\n\r\n\r\nNikolas Hulewsky (32:47.694)\r\nYou gamified it in that sense, like you got community buy in that wasn't just what am I getting out of this newsletter? It was also what is the community? Within this newsletter producing.\r\n\r\n\r\nDerek (32:56.108)\r\nYeah, have to give value. What you give is what you get. And you've given enough in terms of just like thought leadership, podcast interviews, you have enough of that giving that you can actually get now.\r\n\r\n\r\nNikolas Hulewsky (33:15.192)\r\nHmm. I really like the way that you framed it though, where you were like, thinking first, okay, where is my target and ideal subscriber located currently? And then how do I get a Trojan horse into that community? That like you thought distribution first and then work your way back? I thought that that's really interesting. Do you still do that?\r\n\r\n\r\nDerek (33:31.225)\r\nYeah.\r\n\r\n\r\nDerek (33:36.731)\r\nfor sure. start with basically it's just going in reverse starting with a customer experience. It's like what's the output that someone wants and how do I create an input that creates that output?\r\n\r\n\r\nNikolas Hulewsky (33:52.952)\r\nSo for me, the output somebody wants would be to start a business or buy a business or make their first million dollars. Like I pick one of those and then you're saying like reverse engineer.\r\n\r\n\r\nDerek (34:04.996)\r\nYou can reverse engineer it and you can also explain it in easy ways by explaining the problems and the pain points that they already have. It's actually pretty tricky buying a business. You don't know where to start. You know, you can study business in general, but you can't specifically study that business. There's a lot of blogs and advice out there, but it's chaos. That's a problem. That's a pain point. So you can start from there.\r\n\r\n\r\nNikolas Hulewsky (34:17.102)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (34:31.618)\r\nI really love this idea, man. There are a lot of business buying newsletters and it's very much like I'm the professor. You're the students. Here's what you need to know. I'm going to tell you everything and there's a place for that. Like those are important. But how do you gamify is at the wrong word, but like how do you create engagement within that community? The way that you've done it with like the weekly, which one's the best design, right? Like how could I bring that into this? Or it's I don't know. Maybe it's user generated.\r\n\r\n\r\nDerek (34:44.818)\r\nyeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (35:00.898)\r\nBusinesses that they found not generated, but deals that they got which ones deal the week.\r\n\r\n\r\nDerek (35:03.673)\r\nYou you yeah, Deal of the Week. I do have that dot com to. Yeah, deal of the week dot com. That was a good little side thing. So another thing you can do is you can take a very, very specific one that there is no research, there's no case study on random things like I happen to know of this specific pizza shop that will do basically six million dollars in revenue. It's a local.\r\n\r\n\r\nNikolas Hulewsky (35:09.922)\r\nI forgot about that. I forgot about that.\r\n\r\n\r\nDerek (35:32.449)\r\nsingle location pizza shop. That's a ton. Okay. That is a ton. It's a serious operation running a pizza shop and a kitchen and everything. But the common person wouldn't imagine that a pizza shop would basically be doing 500 grand a month. They would not think that. So you could expose something like that as a playbook and\r\n\r\n\r\nNikolas Hulewsky (35:36.226)\r\nYeah.\r\n\r\n\r\nDerek (35:56.61)\r\nIt's a pretty small niche for people that are looking for a pizza shop, but it's people looking at how to actually build a good functioning restaurant, how to build customer relationships. So it could be more broad too. You could be thinking like, I want to open a breakfast place, but I'm definitely going to read how this pizza shop did that. You know, what was the mechanics behind that?\r\n\r\n\r\nNikolas Hulewsky (36:17.998)\r\nWhat types of community things, I wonder, could I get engagement from the rest of the community like you're doing with the daily design challenge or the weekly design challenge? I really like that framework. I'm going to have to think on that. Did you grow your newsletter over how long a period of time?\r\n\r\n\r\nDerek (36:29.7)\r\nYeah.\r\n\r\n\r\nDerek (36:38.964)\r\nman, it's 2025 now. It's probably been six years and I think I might have bought it in 2018. Not sure. Basically, it was this little side project that kind of had this pop and drop and I saw this guy was selling it. There's only a couple thousand dollars. I think there might have been 1800 subscribers or something like that. And I thought I could redesign this.\r\n\r\n\r\nNikolas Hulewsky (36:50.286)\r\n2018.\r\n\r\n\r\nDerek (37:08.589)\r\nredo it and then come up with these mechanisms to create a flywheel and just keep testing them and that would be a really interesting little side business and it's different from a typical newsletter the way that now I frame it as a design challenge. It's the distribution is so much easier because design newsletter is very generic there's a million of those now. This is a design challenge and\r\n\r\n\r\nto just kind of increase retention in things, I would put in different, what I call surprise rewards. So if you stay subscribed, I will go in and I will create a campaign just for a specific segment. So I'll go in to my ESP, create a segment, and look for whoever has opened 50 % of newsletters in the last 90 days or something. And then I'll send an email and say, claim this reward.\r\n\r\n\r\nand the first three people might get some get discount codes to different software or programs that I've negotiated. And I've also done little Amazon gift cards before. Go Clings. Easy, tiny little retention mechanism. What else?\r\n\r\n\r\nNikolas Hulewsky (38:17.667)\r\nThat's awesome.\r\n\r\n\r\nNikolas Hulewsky (38:25.166)\r\nSo I'm gonna not wrap, but I think to summarize, what I really love is this framework of what's the problem, the specific problem that you're looking to solve for a customer. It has to be specific enough where you can differentiate.\r\n\r\n\r\nDerek (38:40.696)\r\nThey don't buy products, they buy more. Yeah. What's the improvement? it, you know, am I entertaining people? Is this music, books, movies, video games? That's an improvement for entertaining. Otherwise there's a lifestyle improvement and that's like basically your mind, body, bank account improving. You know, you're getting smarter, you're getting more fit, et cetera. You buy improvements, that's it. So think.\r\n\r\n\r\nNikolas Hulewsky (38:45.538)\r\nWhat's the improvement?\r\n\r\n\r\nDerek (39:09.334)\r\nWhat's the improvement? For you, it's obvious. Well, you're starting a business. Yeah, you're starting a business, but what's the actual improvement?\r\n\r\n\r\nNikolas Hulewsky (39:16.814)\r\nYeah, I got a workshop. I'm going to continue to workshop that because I it leads into this.\r\n\r\n\r\nDerek (39:20.236)\r\nbecome your own boss, take back your time.\r\n\r\n\r\nNikolas Hulewsky (39:23.488)\r\nlead into your second point, which is like, what's the playbook so can create the lead magnet? And then once you have the playbook and the lead magnet, then it's like, okay, distribution, how do I get to where my audience currently is through a Trojan horse style of, of offering? think that's\r\n\r\n\r\nDerek (39:27.607)\r\nRight.\r\n\r\n\r\nThanks.\r\n\r\n\r\nDerek (39:37.977)\r\nFinding that audience, I call that the watering hole method. I think some people call it that, I don't know. It's basically saying there is this certain animal I'm trying to hunt. Where do they all congregate? All these crowds congregate in their own ways. You need to find where they gather. Like, okay, where do realtors go to conventions? What's the trade show, et cetera? Is there an online community that they go to? Embed yourself in those communities. Just go to the water hole.\r\n\r\n\r\nNikolas Hulewsky (40:06.306)\r\nYeah, it sounds so simple to fish where the fish are. Go to the watering hole. it. Yeah, I love it. This is great. I'm going to stop it here for right now.\r\n\r\n\r\nDerek (40:10.998)\r\nRight, right.\r\n\r\n\r\nDerek (40:17.578)\r\nAnother thing I'll mention for the pod is an easy way if you're looking to kind of just like go out of the gate and monetize things, you can list your newsletter at any stage. I waited way too long where don't be afraid to try to monetize it early on your email list. So if anyone's listing and you have a email list, just a couple thousand subscribers, 10,000, 20,000.\r\n\r\n\r\nNikolas Hulewsky (40:36.504)\r\nWhat do mean list?\r\n\r\n\r\nDerek (40:47.434)\r\nIt's just never too early to monetize that. think I probably wasted a lot of time waiting, thinking, okay, once I hit this milestone, it's big enough to sponsor, or there's enough people that there's gonna be clicks, or I'm gonna alienate my readers if there's ads. It is scary. The first time you put in ads or sponsored products, it is kind of scary because you're waiting, are people gonna unsubscribe? Is it gonna throw me into spam now?\r\n\r\n\r\nNikolas Hulewsky (41:13.39)\r\nMm-hmm.\r\n\r\n\r\nDerek (41:16.842)\r\nIt's just not too early.\r\n\r\n\r\nNikolas Hulewsky (41:20.094)\r\nI heard from I heard from somebody saying that like, getting sponsors early actually helps you and not train your audience, but get them used to the fact that you have sponsors. Because if you wait potentially too long, then it's like, wait, what the freak? Where did this sponsorship come from?\r\n\r\n\r\nDerek (41:32.215)\r\nYes.\r\n\r\n\r\nDerek (41:35.839)\r\nAnd you don't want to overwhelm them. don't, people will get ad fatigue if every issue is just an ad from Nick now. It's way better if it's just intermingled with his organic natural content. And another easy thing you can do is whatever products you absolutely love and use, go, don't be afraid to approach those brands as a potential sponsor. My, both my websites and newsletter are now sponsored by a company called Roam.\r\n\r\n\r\nro.am and I approached them because I was using the tool maybe a year ago and I was totally blown away. was like combining Slack and zoom. There's just kind of chaos communication with all these separate tools and I discovered Roam and I just kind of stayed in touch and then, you know, maybe six months ago I got on a call with the founder and then\r\n\r\n\r\nA couple months ago, we got on another call and once you've built that relationship, you're like, I'm a user. love the product. know the product and have perfect audience overlap. Approach the products you use. Just, you know, start from in your house. It's an easy thing to do.\r\n\r\n\r\nNikolas Hulewsky (42:50.638)\r\nThat's great advice,\r\n\r\n\r\nDerek (42:51.338)\r\nYeah, no, it's never too early.\r\n\r\n\r\nNikolas Hulewsky (42:53.422)\r\nI love it. All right. I'm stopping here. I'm going to talk to you next time. Stay on.\r\n\r\n\r\nDerek (42:56.279)\r\nAll right.",
  "metadata": {
    "duration": "",
    "date": "2025-03-26",
    "platform_source": "Google Drive"
  }
}