{
  "episode_number": "230",
  "episode_title": "Google's New AI Tool Is Breaking the Internet (Nano Banana Review) with Elizabeth Knopf",
  "guest_name": "Elizabeth Knopf",
  "business_name": "Not Applicable (personal project)",
  "transcript": "﻿Nikolas Hulewsky (00:00.601)\r\nMic is good, camera is good.\r\n\r\n\r\nOkay, Liz, I am excited to talk to you today because you are going to show me how to actually use some amazing tools. But the things we're going to talk about today are the things that are currently taking the AI world by storm. The first one is Nano Banana, which is the model that Google just released. And the second one is you're going to actually show us with Claude code how you replaced one of your apps and created your own app using Claude code natural language. You're not a coder. You're not a developer, but you're going to show us how we can do that ourselves. So\r\n\r\n\r\nFirst question, what the freak is Nano Banana? I keep seeing this crap all over the internet. I'm like, I don't know what this is.\r\n\r\n\r\nElizabeth Knopf (00:40.888)\r\nSo you know how like a couple of weeks ago we were talking about how Google sucks at marketing? Well, I think they were listening to our pod because someone stepped up their game and they did a great job finally releasing a product called Nano Banana. And all that is, is their Gemini Flash 2.5 image model. So it's just another image model, but it's actually a pretty awesome image model.\r\n\r\n\r\nNikolas Hulewsky (00:46.118)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (01:04.155)\r\nSo I have, I found this Reddit thread I'm gonna show to you. And these are some examples of Nano Banana, of what they did. So this is, here's a picture of Ronaldo, he's drinking a water bottle and they Photoshopped a Coca-Cola. They also Photoshopped a jersey on him. The face looks Photoshopped to me just because I see them next to each other, but pretty cool. Here's one that I think is nuts. Like they took this picture, on the left it's two guys in the middle of the day with the Toronto skyline behind them. And then they Photoshopped that.\r\n\r\n\r\nto at night. And it's literally the same guys in the same picture. You wouldn't have known that incredible editing. I don't know what this is. So I'm gonna go to the next one. Oh, this guy took a picture in front of his house. It looks like he's in like Nova Scotia and they change his clothes and the lighting and it looks like he's in a flea market in Morocco or something like that. So really, really good image generation. The my question is like, what are people using this for? Is it just like a novelty trick?\r\n\r\n\r\nElizabeth Knopf (02:01.973)\r\nNo, so I think there's a couple of interesting things that has made this so exciting. So a couple of key challenges that have come up with a lot of the image generation models. So first off.\r\n\r\n\r\nIt's just like replacing things and doing simple edits can be, were a little bit hard to do. And even with like chat GPT's in comparison, you you would say like make this, you know, change this one element and sometimes it would work and then sometimes it wouldn't and same with Google's previous models. And so now it has just become much more precise with specific edits and iteration of those edits. So changing the shirt, changing the product, like it actually is much more,\r\n\r\n\r\nin terms of how it takes whatever you're prompting it to change and making those changes. And I would say Adobe was still sort of the leader and you're saying Photoshopping, but like literally they were probably still leading the way in some of that editing versus again, going to one of these image models to do your editing. But now NanoBanana really sort of advanced the ball in terms of doing that. The second key feature and I think is the more exciting and really big deal is what's called visual memory.\r\n\r\n\r\nSo this is essentially where you can have from one image to the next, it persists as the same person, same object, same thing. And that has been the biggest flaw in image generation because you would see these little, even ads or short ads and like there would be a person but they'd slightly look different with like different bone structure or something in the next cut. And so now persistence,\r\n\r\n\r\nNikolas Hulewsky (03:23.227)\r\nYeah.\r\n\r\n\r\nElizabeth Knopf (03:40.844)\r\nhas actually been improved so dramatically. And that's because they came up with some interesting techniques, how they're building the model, which we can talk about in a second. But those are really the two. Yeah.\r\n\r\n\r\nNikolas Hulewsky (03:45.745)\r\nNikolas Hulewsky (03:50.697)\r\nthat's really cool. OK, so if I was starting to use these image generating models, but that was always a problem, right? It's like, cool, I generated this cool logo, but how do I get it to stay the same logo across multiple iterations? Whereas this is like, well, now you can do that. You can keep the same person in the same image or the same logo, whatever. It stays persistent. Here's my question to you. We used to talk about\r\n\r\n\r\nElizabeth Knopf (04:05.058)\r\nRight. Yep.\r\n\r\n\r\nNikolas Hulewsky (04:17.455)\r\nmultimodal and maybe this is just me because I'm a caveman, but we used to talk about multimodal models where you're like, I can upload an image and then I could upload text and I could upload a video and I could upload. I'm trying to think of what the other mode would be, but those are all three different data types. And in the past it was only text, but you know, now you can kind of upload some images and videos getting there. However, my perception of multimodal has actually changed a little bit.\r\n\r\n\r\nI think of multimodal now as I have an LLM that I use for synthesizing data. I have an AI image generator that I can use to like create, you know, whatever logos, et cetera. I can even get these, they're not LLMs, they're SLMs, small language models that are specific use cases that are, you know, maybe they're healthcare, maybe they're tech related, et cetera. Or, or maybe there's a deep research function. So it's like, those are actually different modes of AI.\r\n\r\n\r\nAnd I think Google has done a really good job of creating this studio that kind of incorporates a lot of these different modes, but people don't really use it or know about it. And you were just telling me about Google AI lab. I can't remember exactly what it's called. What is it?\r\n\r\n\r\nElizabeth Knopf (05:32.814)\r\nOkay, so since they have so many different locations and properties, it's bad. aiStudio.google.com. it's Google, aiStudio is the name. One of the locations you can access Nano Banana, or of course you can go straight to Gemini and access Nano Banana there too. And so...\r\n\r\n\r\nNikolas Hulewsky (05:35.077)\r\nThey're terrible.\r\n\r\n\r\nElizabeth Knopf (05:52.606)\r\nGoogle AI studio has now started incorporating in that model into be building being able to build out little apps and like other tools with this This new model. So that's I think pretty exciting and we'll dive in here in a second just to see What's what's basically possible?\r\n\r\n\r\nNikolas Hulewsky (06:11.697)\r\nOkay, so this is it. I'm in Google's AI studio. So ai studio.google.com. First of all, I don't know, it must have been two months ago or so, but you showed me a version of this and it was overwhelming. This chat interface is clean. I mean, it looks like the open AI chat interface. I don't get instant anxiety looking at it. So am I wrong? Did they not overhaul this?\r\n\r\n\r\nElizabeth Knopf (06:14.606)\r\nMm-hmm.\r\n\r\n\r\nElizabeth Knopf (06:23.842)\r\nYes.\r\n\r\n\r\nElizabeth Knopf (06:36.256)\r\nI think they have iterated it. It's I don't I don't have a good memory here for what it looked like. But yeah, I mean, I think it was a bit more overwhelming the last time probably. It seems like everybody's simplifying.\r\n\r\n\r\nNikolas Hulewsky (06:45.103)\r\nYeah. Okay. So on the left side, I have chat, which looks the same as, as open AI, but then I have stream. What is stream?\r\n\r\n\r\nElizabeth Knopf (06:49.87)\r\nSo stream is actually a pretty cool thing. This is where you can basically use your web camera or share your screen So like if you are debugging something if you want to learn something if you want Google to Watch a video with you and give you feedback or see you do something live and talk with you It is actually doing that and capturing it in real time. So this is like\r\n\r\n\r\nNikolas Hulewsky (07:17.541)\r\nNo way.\r\n\r\n\r\nElizabeth Knopf (07:18.742)\r\nYeah, people are sitting on this feature. It is pretty incredible. I use it a lot for just debugging. And when I'm like doing something or like following instructions, I'm like, what am I getting wrong? Or like, look at my screen or so I don't have to take a gazillion screenshots. I'll do that. Or I've tried to also do like a YouTube video and having it sort of walk through it with me. So there's a lot of different cool things you can do with this feature that again, is like totally slept on.\r\n\r\n\r\nNikolas Hulewsky (07:48.305)\r\nI'm gonna show you something really quick.\r\n\r\n\r\nWe'll edit this to make it quicker. So.\r\n\r\n\r\nI did all these interviews with people and I got it to spit out outputs. so AI basically synthesized the interviews, but I wanted to look at the interviews across all the interviews to be able to pull out information that maybe I'm not seeing. But there was a problem in cleaning the data. So I had it all stored in Google and one of the coolest tools, Google apps script, I was writing a script and I was like, Claude, can you help me write the script?\r\n\r\n\r\nElizabeth Knopf (08:14.936)\r\nYep.\r\n\r\n\r\nNikolas Hulewsky (08:26.065)\r\nAnd so this is me just like going back and forth. It's writing the script. And then every time it would, I'll show it to you. So this was the script. see it over here and I would copy and paste it into actually Google app script and it would help me create it. But every time that it would screw up, I had to do this. I had to take a screenshot of the execution log and then I would copy it and I would just literally paste it. And then it was like, Oh, this error was because of blah, blah, blah, blah.\r\n\r\n\r\nand then it gave me a fix. And then there'd be another problem and I had to, you know, again, copy and paste and capture the image and put it in here. And then it would tell me what the error was. You're saying I could have just had this on, like I could have just had this talk to Jim and I live on and it would have been looking at what I was trying to build and like give me real time feedback.\r\n\r\n\r\nElizabeth Knopf (09:10.115)\r\nYes.\r\n\r\n\r\nElizabeth Knopf (09:16.174)\r\nAbsolutely. Yes Yeah, exactly Yeah, I mean I will say that I have had in the past were like I again I love Claude so sometimes I think Claude is better at Feedback because again, they're using the Gemini chat model. So it depends on your opinion there, but Gemini has been getting a lot better but absolutely absolutely you do that and Okay now you're\r\n\r\n\r\nNikolas Hulewsky (09:18.021)\r\nThat's insane.\r\n\r\n\r\nNikolas Hulewsky (09:22.159)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (09:40.817)\r\nOkay, and then generate, go ahead.\r\n\r\n\r\nElizabeth Knopf (09:44.098)\r\nGenerate Media is just Nano Banana and Vio. Actually, go to that in a second and we'll come back to the apps in a second. So yeah, so again, if people haven't been using Vio, pretty spectacular for videos. Again, if you wanna do, they have also other sorts of media now you can produce. So whether it's like speech generation, doing audio, again, you can start doing a lot of cool stuff in here.\r\n\r\n\r\nAnd one of the things also that I think is worth noting on Nano Banana that I also think is cool related to that sort of persistence element is like you could do step-by-step guides. So I haven't yet tried it for software, but I have tried it for like fitness, like show me a step-by-step guide with images of like how do you properly lift weights or do an exercise and it will take with the same person going through each of those steps.\r\n\r\n\r\nSo you can just, again, get very creative and imaginative on using those step-by-step guides. Obviously, they have a recipe one here. So I think that's a pretty cool feature. And as you can go in here, they do have a bunch of cool examples and templates that you can be inspired by, different camera angles. OK, so now the really cool place that, again, people don't even know about. And this is a\r\n\r\n\r\nNikolas Hulewsky (10:56.209)\r\nThat's insane. Yeah, yeah, yeah.\r\n\r\n\r\nElizabeth Knopf (11:05.25)\r\nlike a helpful way for beginners who again are a little bit intimidated to get started in building apps. So if you go to build.\r\n\r\n\r\nElizabeth Knopf (11:15.234)\r\nThis is similar to some of the other LLMs that will have sort of like little mini apps examples. They used to call these gems, which was just really like confusing. Now they, I don't know, just are calling them apps, I guess, or I don't know if there's even a different terminology, so whatever. But basically they have little starter apps and examples, some of which have incorporated in Nano Banana already. And there's others that have sort of showcased some of the real power of\r\n\r\n\r\nwhat Google and Gemini can do, which again is really on this sort of like video multimedia, components that I would say, you know, the other models each sort of have elements of, but I really think that Google is excelling and doubling down on that capability of both like animation, video, audio, and, you know, streaming, cause they have the infrastructure.\r\n\r\n\r\nNikolas Hulewsky (12:09.275)\r\nis.\r\n\r\n\r\nIs this kind of an answer to Claude code?\r\n\r\n\r\nElizabeth Knopf (12:16.546)\r\nSort of, sort of. I would say they're very different in terms of like the workflow, but everybody's trying to build out some kind of coding app because everyone sees like personal software is what's happening. That is what is being sort of cultivated through LLMs as really, I would say the biggest area of maybe annihilation or augmentation from what's happening. So, you know, everyone's building apps.\r\n\r\n\r\nNikolas Hulewsky (12:39.695)\r\nYeah.\r\n\r\n\r\nElizabeth Knopf (12:46.166)\r\nAnd so you can do that now with chat GPT, with Anthropic, with Cloud Code, with Grok, you can all sort of build within the browser. So then still, again, you can build it from here in the browser. There's still a couple steps to like get it into production, but Google has like that full workstream of getting from a little mini app into production. Whereas some of the other guys like don't have the same kind of infrastructure that Google has. It's not as smooth.\r\n\r\n\r\nNikolas Hulewsky (13:12.155)\r\nSo it's probably more similar to a replet or lovable than it is to Claude code.\r\n\r\n\r\nElizabeth Knopf (13:17.064)\r\nsort of, sort of, I would say it's, again, it's hard to like...\r\n\r\n\r\nNikolas Hulewsky (13:19.377)\r\nYou're so nice. You're like, you're like, yeah, kind of Nick.\r\n\r\n\r\nElizabeth Knopf (13:23.776)\r\nYeah, I mean, kind of kind of, but like, again, they all have like, you can start prompting to build something. And then again, to go to that sort of next mile is a little bit more challenging. But this I would say is like still keeping very simple apps. would say cloud code is still sort of the best in going like in the same environment interface, you know, from idea to production and building out sort of infrastructure. Like again,\r\n\r\n\r\nI'd say Gemini is doing well, but again, there's something about their interface that I'm just not as thrilled about. So I think it's personal preference, but you can access a lot of these tools here and test it out and see if you like them. Because again, I think it's just a preference thing.\r\n\r\n\r\nNikolas Hulewsky (14:04.613)\r\nYeah. I literally just put this prompt, build me a game. can play with my kids. It's a history trivia game with rounds of questions that is tailored to everyone's age. The app should keep score. It's been running for 75 seconds and I can see it real time building this out. so like in this sense, it reminds me of lovable and that I'm like watching it build real time. Boom, there it is. And now I have basically, an MVP to test around with. So I could say Nick age.\r\n\r\n\r\n40.\r\n\r\n\r\nThen I'm going to add another player. We're going say Liz age 29. And then we're going to start the game.\r\n\r\n\r\nElizabeth Knopf (14:42.734)\r\nThank you.\r\n\r\n\r\nNikolas Hulewsky (14:49.007)\r\nAnd we're playing. It's generating the questions. This is me. Which Roman emperor famously appointed his favorite horse, Incittatus, to the position of consul or at least threatened to in display of contempt for the Roman Senate? I have no idea. I'm going to say Nero because I just know he was in that case. Caligula. All right, Liz, here's your question. It's generating for you.\r\n\r\n\r\nElizabeth Knopf (15:11.491)\r\ngosh.\r\n\r\n\r\nNikolas Hulewsky (15:14.373)\r\nwhich explorer is often credited with the first circumnavigation, come on, of the earth despite dying halfway through the journey. Christopher, it was Magellan. He died, yeah, he died in the Philippines, I think is where he died. This is freaking cool. I just built this.\r\n\r\n\r\nElizabeth Knopf (15:22.402)\r\nWas that Magellan? No.\r\n\r\n\r\nElizabeth Knopf (15:33.782)\r\nIt's awesome. And so if you want to go back in a second, I'll show you because I think like this is cool. Again, like cloud artifacts can do this like chat, you can do this rock and do this. But I think there's a couple pieces with the nano banana element and some of the features that they have. That's pretty cool. All right. So if you just go down to like the one you're showcasing, so just scroll. I just wanted to highlight a couple of cool things. So keep going. Okay. So number one maps.\r\n\r\n\r\nPeople don't talk about map making or leveraging maps. So map explorer, or there was like an MCP map thing, whichever one you want to do. Like you can incorporate in map elements. So I started talking about kids. was started doing like an exploration on the Google maps for my kids game. you know, some like Carmen San Diego meets something else. And so maps is just like, you know, that's embedded and native to Google's stack. And so you can start doing\r\n\r\n\r\nNikolas Hulewsky (16:01.189)\r\nThis one?\r\n\r\n\r\nElizabeth Knopf (16:29.208)\r\ncool things with Maps or maybe it is more on the business side, logistics and scheduling, or there's a lot of different use cases that I think Maps is sort of a cool, unique use case that other folks don't have as ease of integration. Of course you can integrate Maps into everything else, but again, it's Google's sort of core function.\r\n\r\n\r\nNikolas Hulewsky (16:31.761)\r\nNikolas Hulewsky (16:51.003)\r\nthis would be so cool. I could do a total game with my kids. Like go back to Lee Tepe in Turkey, which they honestly just found recently. I could say, take me somewhere ancient. my kid, my son, I know my oldest son is going to be like, let's go back to Lee Tepe. And then all of a sudden we could just go to YouTube. Like I could build this out and be like, take me somewhere cool. And then give me like the top three YouTube videos to link to just because it's in the Google ecosystem. That's awesome.\r\n\r\n\r\nElizabeth Knopf (16:54.455)\r\nYeah.\r\n\r\n\r\nElizabeth Knopf (17:17.134)\r\nTotally. Yep. All right. So let's go to another cool feature they have. Okay. So this one I haven't got to work perfectly, but it's called video analyzer. And then we'll highlight a couple other ones. So you scroll down, down, down. Video analyzer. So this is like pretty cool. So we all sort of want to understand like, you know, can get a transcript from a video, but like if we're doing this podcast, we want to say like where, you know, where\r\n\r\n\r\nNikolas Hulewsky (17:26.938)\r\nWhere is it? Did I miss it? Okay.\r\n\r\n\r\nElizabeth Knopf (17:45.728)\r\nWhere is our body language bad or I don't know some some other thing or what is happening in this video? And you can literally in their little app here Add in a video You can add yeah, so this you have to have a local file for I had edited this the other day where you could just put in a youtube url and it would download the file so you could iterate this little app\r\n\r\n\r\nNikolas Hulewsky (17:51.025)\r\nOkay. I can drag and drop.\r\n\r\n\r\nNikolas Hulewsky (18:08.229)\r\nLet me see if I can get, let me see if I can get a video. I'm sure I have a video on my desktop somewhere. Hold please.\r\n\r\n\r\nI have to drag and drop? can't like...\r\n\r\n\r\nElizabeth Knopf (18:25.282)\r\nIf you want to edit it, edit the thing, can tell it to add a YouTube URL that'll download the file or access the video.\r\n\r\n\r\nNikolas Hulewsky (18:38.01)\r\nI I got it. Yep. Okay, cool.\r\n\r\n\r\nElizabeth Knopf (18:40.462)\r\nAll right.\r\n\r\n\r\nNikolas Hulewsky (18:44.963)\r\nZero.\r\n\r\n\r\nI made this video a couple of months ago. I was doing a post on, what's it called? Christmas light, hanging Christmas lights. And so I made kind of this super cut of people hanging Christmas lights with some music on it. So I'm going to take that and I'm going to add it here and we're going to see what that does is processing the video. Now I should probably, do I need to tell it something or is it just processing it?\r\n\r\n\r\nElizabeth Knopf (18:58.584)\r\nMm-hmm.\r\n\r\n\r\nElizabeth Knopf (19:16.43)\r\nLet's actually see because the way I was doing it was different the last time. So I have no idea. It's gonna be surprise.\r\n\r\n\r\nNikolas Hulewsky (19:21.765)\r\nOkay. I'm so nervous.\r\n\r\n\r\nElizabeth Knopf (19:27.116)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (19:27.275)\r\nExplore this video via audio visual captions, paragraph, key moments, table, haiku, chart, custom. Let's do, what do think we do? Haiku or chart?\r\n\r\n\r\nElizabeth Knopf (19:38.392)\r\nLet's do a chart. Let's see. I don't know what it'll do.\r\n\r\n\r\nNikolas Hulewsky (19:43.129)\r\nChart of importance. Type of custom prompt. I want to see a chart of.\r\n\r\n\r\nthe total number of light bulbs seen.\r\n\r\n\r\nNikolas Hulewsky (20:06.245)\r\nI have no idea if that will work. I just thought that'd be interesting to try. Because they're hanging light bulbs.\r\n\r\n\r\nElizabeth Knopf (20:08.704)\r\nYeah. But you can start, you can start imagining to like, okay, it can actually ingest, you know, wow, that's pretty cool. Of course.\r\n\r\n\r\nNikolas Hulewsky (20:15.569)\r\nWhat?\r\n\r\n\r\nNow I'd have to go count that. But yeah, this is the video. And you can see this guy's just.\r\n\r\n\r\nsetting up all the light bulbs. I mean, I believe it. I'm not gonna go count it, but I believe it.\r\n\r\n\r\nNikolas Hulewsky (20:36.047)\r\nHow cool is that? That's freaking cool.\r\n\r\n\r\nElizabeth Knopf (20:37.41)\r\nThat is pretty cool. So again, like now you can start like ingesting video as a medium and doing more than just, you know, getting a transcript, which I just think is pretty cool.\r\n\r\n\r\nNikolas Hulewsky (20:43.334)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (20:49.305)\r\nYeah, that's awesome. All right.\r\n\r\n\r\nElizabeth Knopf (20:51.374)\r\nAll right, so couple other things to highlight that are just related. We don't need to do the full demo of them, but just throwing them out there. So if you just keep on going down, there's like a video learning one. So similar, basically you can put in a video to learning app. So you can basically put it in a video and it'll generate like.\r\n\r\n\r\nan app related to the video. I've tried it a couple of times and it wasn't like totally perfect for some of the educational or tutorial type videos. But again, these are just like cool ideas that if you polish up, you can build your own little apps to do cool things with or like use this as a lead magnet for.\r\n\r\n\r\nNikolas Hulewsky (21:31.013)\r\nI want to try something. Ooh, I want to try. Okay. Let's go to my YouTube channel. gosh, that sounds so douchey. I'm sorry. Let's go to my channel. And let's, let's pick a video that would be really cool to turn into a lead magnet. So this is our Claude code video. That's a good one. Let's keep that one in mind. Automate anything with Zapier.\r\n\r\n\r\nElizabeth Knopf (21:40.91)\r\nyou\r\n\r\n\r\nElizabeth Knopf (21:59.022)\r\nIt's a one.\r\n\r\n\r\nNikolas Hulewsky (22:01.253)\r\nbest prompts.\r\n\r\n\r\nElizabeth Knopf (22:04.472)\r\nThat might be easier.\r\n\r\n\r\nNikolas Hulewsky (22:07.685)\r\nFive million, okay. How to build a directory from scratch. You know what, those directory ones are like super popular. Let's go to the, that's what I'm gonna do. This one was my most popular one.\r\n\r\n\r\nHere it is. So let's try this.\r\n\r\n\r\nNikolas Hulewsky (22:25.839)\r\nSo he went through the process of building out a directory. And we're going to go back.\r\n\r\n\r\nyou weren't even looking that whole time? I'm sorry.\r\n\r\n\r\nElizabeth Knopf (22:38.252)\r\non the sorry. Yeah, no, I wasn't on the you weren't sure you\r\n\r\n\r\nNikolas Hulewsky (22:39.737)\r\nYeah, I thought I was sharing my screen. Okay, so I found a video. I found a video on my YouTube page. This is a video that I put out of somebody who walked me through the process of building out a directory. So we've talked about directories before. They're like super hot right now because people are like, I could build a directory with AI. I don't have to do all the manual work, blah, Anyways, that was a really popular episode. People really loved it. And now I'm taking the link. I'm dropping it in here.\r\n\r\n\r\nreally curious to see what it generates for me. Because if it could generate from this one episode of like a how-to video, how to build a directory, then I'm gonna hang this call up and end early. Cause we're done, I'm done for the week. I'm just kidding.\r\n\r\n\r\nElizabeth Knopf (23:27.985)\r\nLet's hope it works, because it wasn't working well for me the other day, even though I'm like, this is one of the beautiful apps. Yeah, so we'll see. We'll see if it does, but it has to do something.\r\n\r\n\r\nNikolas Hulewsky (23:31.569)\r\nreally?\r\n\r\n\r\nNikolas Hulewsky (23:35.739)\r\nWe'll see, fingers crossed. Okay, well that's spinning up.\r\n\r\n\r\nWe'll see where that goes. I'll just keep it here for a minute. But while that's loading, man, I just feel like Google, even still, what we just went through, the AI Studio is incredible. Why do more people not talk about that? Are we just spoiled?\r\n\r\n\r\nElizabeth Knopf (23:50.478)\r\nI\r\n\r\n\r\nElizabeth Knopf (24:05.966)\r\nI I don't know. don't know. Cause it's like, think the thing about cloud code versus like Google's suite and even everybody else's like coding suite, there's still friction in terms of like when you start to how you get to production versus I think with cloud code, because it's in the terminal, it's like, even though you're still dealing with this weird black box interface,\r\n\r\n\r\nNikolas Hulewsky (24:27.985)\r\nMm-hmm.\r\n\r\n\r\nElizabeth Knopf (24:30.496)\r\nyou can go through the full process and then when you want to visualize it, it just sort of like pops up on your browser versus the other ones. It's like you have to then figure out how to get it to view it. Sometimes there's a previewer. Then sometimes you have to like connect it with like either Versel or go with like Vertex or there's like still steps. And at every point, every point in something you have to change or do, you lose people. And even though it's so easy to do this stuff now,\r\n\r\n\r\nNikolas Hulewsky (24:55.921)\r\nThanks\r\n\r\n\r\nElizabeth Knopf (25:00.172)\r\nLike friction is still friction and people just, you know, stop if it gets like a little bit hard. Understandably so.\r\n\r\n\r\nNikolas Hulewsky (25:07.921)\r\nI I would think, yeah, okay, so that learning code app, got an error. It did not do it.\r\n\r\n\r\nElizabeth Knopf (25:12.938)\r\nOkay, that's a bummer but like you can see the vision you can see the vision and I think with some interaction You can get there\r\n\r\n\r\nNikolas Hulewsky (25:16.71)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (25:20.433)\r\nI just think with this AI studio that Google has, man, for first time, like novices like me, I can have the video running while it's watching me go through stuff. can tell me in real time what things I'm messing up. I can create apps. can show me the apps and like it, it takes the good of lovable replet and it takes Claude, which helps me debug things. And then it has a good image generator. and then I can.\r\n\r\n\r\nintegrate my YouTube videos, I can integrate my Google Sheets. Like that's one thing that bugs the crap out of me. Maybe you can help me fix it. When I asked Claude to parse data and then it's like, sure, go ahead, just copy this and paste it. I'm like, no, no, just give me the CSV. Such a pain in the butt. Whereas Google can obviously just do that with Google Sheets, but money on the table.\r\n\r\n\r\nElizabeth Knopf (26:13.716)\r\nYeah, no, and it's interesting because right now people that are watching and paying attention like this is a great arbitrage opportunity for any of this stuff. Like again, people don't know about Google AI Studio. So you can literally take that code, find a good URL that has some good traffic already and just put it up like minimal changes. Obviously you need to do a couple things, but you know, if people get ad revenue or whatever for a free tool.\r\n\r\n\r\nSo I'm working on a couple of those, so we'll see how it goes. I mean, right now is a good little early charge until everybody's doing it.\r\n\r\n\r\nNikolas Hulewsky (26:39.204)\r\nand sing.\r\n\r\n\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (26:46.095)\r\nThat is such a freaking good point. It's an amazing arbitrage because people it used to be that software development was only for a select few who had gone through a ton of school, understood how to code. Now we can do it with natural language and something like Google's AI studio. It's a built out suite. It has all the tools that you might ever possibly need. You have no coding experience and you just told me you built a app that replaced one of your apps recently. What was that?\r\n\r\n\r\nElizabeth Knopf (27:09.454)\r\nYes. Okay, so let me share my screen and show you what I've been working on. And so let's see.\r\n\r\n\r\nNikolas Hulewsky (27:16.035)\r\nYes.\r\n\r\n\r\nElizabeth Knopf (27:22.382)\r\nOkay. All right. Do you see it says content ideas? Okay.\r\n\r\n\r\nNikolas Hulewsky (27:27.248)\r\nI do.\r\n\r\n\r\nElizabeth Knopf (27:29.226)\r\nSo I used to pay for an RSS feed tool and that basically aggregated. sorry. Okay. So that basically is listening to websites, keywords, different social media sources, and it's aggregating all that information into a feed so that you can basically see everything. It had organizational collections and groups.\r\n\r\n\r\nNikolas Hulewsky (27:34.843)\r\nTell me what that is.\r\n\r\n\r\nElizabeth Knopf (27:54.038)\r\nand just different ways to like parse information so that you could just see it in one spot versus going to gazillion different sites or having to read through a million newsletters or whatever. So I basically was like, I'm sick of paying for this. It was not that expensive. So probably not the best use of my time for something to build. But at the same time, it was a good starting tool as I'm learning cloud code and sort of sharpening my skills. so,\r\n\r\n\r\nNikolas Hulewsky (28:18.801)\r\nCan you show me what, like what did it look like before?\r\n\r\n\r\nElizabeth Knopf (28:22.196)\r\nSure, let me see if I still have access to, okay, let me see if can still.\r\n\r\n\r\nNikolas Hulewsky (28:25.361)\r\nSorry, I'm trying to understand.\r\n\r\n\r\nElizabeth Knopf (28:33.696)\r\nOkay, so this is like the tool I used to be paid for. Yeah. I'm trying to look for... Yeah, so it's not really showing how it used to show just because I've canceled it. It's on the free version here.\r\n\r\n\r\nNikolas Hulewsky (28:36.977)\r\nOkay, so this is rss.app and it would bring in all the things that you're interested in.\r\n\r\n\r\nElizabeth Knopf (28:51.054)\r\nBut like let's do opening night. So basically it would be a feed So like it's still better than what I built but like for my purposes This is great. So I was paying $20 a month for this\r\n\r\n\r\nNikolas Hulewsky (28:51.312)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (29:02.501)\r\nAnd what was it going out and scraping? Was it going to like Twitter? Was it going to YouTube? Or like, how was it?\r\n\r\n\r\nElizabeth Knopf (29:06.294)\r\nYeah, so all of these different, yep, so it was scraping specific sites. like XAI news, it was going to all these different blogs and I inputted all these. had my own, you know, Twitter feed here, some just AI sites, like different peoples who Twitter accounts I had, like, yeah.\r\n\r\n\r\nNikolas Hulewsky (29:13.361)\r\nokay.\r\n\r\n\r\nNikolas Hulewsky (29:23.355)\r\nThis is incredible! Why the F didn't I know- This is insane!\r\n\r\n\r\nElizabeth Knopf (29:28.718)\r\nWell, the cheaper one that is worth doing and it's actually free now it used to you have to pay a little bit or I use API I use API so that's why I end up paying for everything. Feedly is a little bit more inexpensive. This is like 10 bucks a month for more feeds. But yeah, like you can put in different sources and just have your own little feed here.\r\n\r\n\r\nNikolas Hulewsky (29:49.105)\r\nI mean, I go to Twitter because it's like, I've kind of curated my feed so that I see the stuff or I'll go to their search and see like what's trending, cetera. Why the freak wouldn't I have ever done this? This is amazing. Of course, because there's this specific information I want. I want to know the AI updates. I want to know the SMB updates and I want to know the tech updates. That's pretty much it. I don't really care about the politics anymore. And after freaking filtered through Elon posting, you know, half naked 10 year old girls on the feed.\r\n\r\n\r\nElizabeth Knopf (30:02.677)\r\nExactly.\r\n\r\n\r\nNikolas Hulewsky (30:17.457)\r\nI'm like, Elon, settle the freak down. Anyways, this would be an amazing way to cultivate my own feed. Sorry. Okay. So you had an app for that for your own feed and you decided I'm going to build my own.\r\n\r\n\r\nElizabeth Knopf (30:20.662)\r\nyou\r\n\r\n\r\nElizabeth Knopf (30:26.405)\r\nYeah. Yup. Yeah. And again, this was just something to cut my teeth on because I'm just like, you know, this is like annoying that I'm paying $10, $20 a month. Like again, I'm paying a lot more in other subscriptions, but I was just like, easy tool to build. Let me see if I can do it. Ingesting information is useful for a lot of different use cases and apps that I have on my backlog here. um, yeah.\r\n\r\n\r\nNikolas Hulewsky (30:47.739)\r\nThis is insane. Okay. All right. Go back, go back to your, to the other screen, the cloud code.\r\n\r\n\r\nElizabeth Knopf (30:51.214)\r\nAnd of course, you could also say that in some ways this is a little bit moot because it's like you have perplexity, like it sort of does it for you or any of the cool things. anyway, so I just decided, let me see if I can build this myself, see what would happen. I built out, oops, dashboard didn't work. Okay, so I built out just again, like to get different content ideas. So I put in a bunch of different sources that I had collected. And of course, things are failing now. Did I have a different, hold on, might have a different.\r\n\r\n\r\nElizabeth Knopf (31:21.858)\r\nOkay, I think it's at a different local host address. I've been building out things and they override them. Give me one sec, let me just see.\r\n\r\n\r\nNikolas Hulewsky (31:30.105)\r\nOkay, that's gonna be a question I have for you is how do you stay organized with all the things you're building? Because I've only built a handful of things and I'm like, okay, which folder did I put that in? Where's it saved under? What's the latest version of that thing?\r\n\r\n\r\nElizabeth Knopf (31:40.942)\r\nThis is my project management dashboard that I started built in in Cloud Code that I've already iterated like five times.\r\n\r\n\r\nNikolas Hulewsky (31:47.245)\r\nOf course you did. Of course you built a content management, your project management dashboard. That's awesome.\r\n\r\n\r\nElizabeth Knopf (31:54.646)\r\nYeah, so yeah, so stay stay organized and apologize. I have to figure out what my local host is on\r\n\r\n\r\nNikolas Hulewsky (32:01.233)\r\nThat's fine. We'll edit it. It'll look like you just went right there.\r\n\r\n\r\nElizabeth Knopf (32:03.63)\r\nYeah, I got overwritten. That's why. That's annoying. Okay. Hang on. no.\r\n\r\n\r\nNikolas Hulewsky (32:22.894)\r\nmy gosh, PPP data. What a good data set for you to have.\r\n\r\n\r\nElizabeth Knopf (32:26.882)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (32:31.185)\r\nYou know, it's well, of course, you know this. insane thing about the PPP data is that it tells you in that year, at least because it's so it's old, the size of the business, how many employees they had, like revenue, net income, freaking insane.\r\n\r\n\r\nElizabeth Knopf (32:46.936)\r\nI was trying to combine that with some financial distress data because there's other types of loans that people had. So because we were looking at potentially assuming their debt and unfortunately the PPP data, I was like trying to parse together with that to overlap it because other data sets are not as good. anyways.\r\n\r\n\r\nNikolas Hulewsky (32:50.949)\r\nWell, it's okay. Don't worry about it being overwritten. Just go back to the tool.\r\n\r\n\r\nNikolas Hulewsky (33:11.217)\r\nOkay, okay, can I ask you this? Let's hear it again.\r\n\r\n\r\nLet's pivot for a second. How did you build this personal dashboard? Is it automatically pulling in new projects? Do you have to populate it every time? Like, what am I looking at here?\r\n\r\n\r\nElizabeth Knopf (33:18.2)\r\nAnyway.\r\n\r\n\r\nElizabeth Knopf (33:25.896)\r\nNo, no, no. Okay, so what you're looking at right now as I'm building, as I'm trying to load my other one. Okay, so this is like a project management dashboard because of course, as you start building projects and me being like a obsessive multitasker, especially with cloud code that I had started having too many projects and I was like, I need to keep track of what's what.\r\n\r\n\r\nI started sort of learning to that you want to build out to-do lists, you want us have certain rules, then I started wanting templates, and then I started having like agents or different frameworks that I was starting to leverage and I needed to keep all this organized. So of course, what do you do is project management tool. So I first went to GitHub to see like someone may have already solved this. So let me see if that's better. I'm still testing out other people's tools, but this one was my own because\r\n\r\n\r\nAgain, like you sort of have to decide what should you build for yourself versus like what should you build for? Okay, so this is not again fully Not fully functional yet and I had to redo a number of different features on this and so it's still like a mega work in progress. So right now,\r\n\r\n\r\nNikolas Hulewsky (34:21.845)\r\nShow me how it works. This is so freaking cool, Liz.\r\n\r\n\r\nNikolas Hulewsky (34:40.197)\r\nLike how is it deciding, it looks like there's a priority associated with it, highest, high, medium, low. How does it decide priority? Do you tell it that?\r\n\r\n\r\nElizabeth Knopf (34:48.866)\r\nSo I had put in basically a set of rules in a cloud.md file that's sort of like overarching in my personal operating system. And let me see if I can, I don't know if actually yes. So basically I have, and let me do this so you can actually see my cloud code terminal. So, or I guess I will talk to it in cloud code. All you need to do is like, start with planning, tell it what you want to achieve.\r\n\r\n\r\nNikolas Hulewsky (34:59.845)\r\nAnd did you upload that to cloud code?\r\n\r\n\r\nElizabeth Knopf (35:19.434)\r\nand it will help sort of think through what that is. Now, I would say when you're going into this, assume that if you haven't done it before, you're probably gonna have to redo the whole project more than once until you sort of refine what you need, because sometimes I just think it's starting from scratch is better versus trying to iterate and fix, because it might have to redo a bunch of stuff. So this is probably my third iteration of this tool, and I'm gonna probably redo it again.\r\n\r\n\r\nBut essentially what I have right now is my local file folder that has all of the different files and folders for each of these projects. In the upper level sort of file folder structure, so I have everything in something called Cloud Code Files. Then under that, within that I have some files and then under that I have a bunch of like categories of projects. I have active and then I have like archived and then I have a couple different stages.\r\n\r\n\r\nNikolas Hulewsky (35:52.817)\r\nOkay.\r\n\r\n\r\nElizabeth Knopf (36:16.069)\r\nAnd in the active ones, I have then these projects. from these, it's ones I'm actively working on. And then I've built out some agents, which again, all I did was tell Claude, I wanted to have agents that achieve these sort of things. So have like a systems folder that's thinking about my system of project management. So I created a, and again, I'm just prompting Claude and telling it what I want to achieve.\r\n\r\n\r\nLike what I'm saying literally to the camera right now, there's nothing more magical than what I was doing besides just like interacting with Claude and figuring out how to do that and having Claude tell me how I should approach it in planning. And if you're sort of afraid of the black. So the agent. Yeah. So I have a couple of different agents. have a security agent that will help, um, just make sure I have security best practices going.\r\n\r\n\r\nNikolas Hulewsky (36:52.837)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (36:59.217)\r\nSo like, was that agent doing? What was that agent doing? Systems.\r\n\r\n\r\nElizabeth Knopf (37:10.732)\r\nI have an agent that does pulling my to-do lists on a daily basis, or I can manually have it basically refresh. And so it's pulling in my to-dos because I have a to-do.md file in every project so that it basically tracks all of the tasks that I'm doing. And I had set in the cloud.md file the rules.\r\n\r\n\r\nof what I wanted for that project. And in every one, I have it say, create a to do file, that to do dot MD and break down every part of the project into bite sized tasks and then update.\r\n\r\n\r\nNikolas Hulewsky (37:48.027)\r\nCan you show me that? Is there any way you could show me what that looks like? What's an MT? I know what an MD is the markdown, but what's an MT? MD, okay, sorry, I just misheard it.\r\n\r\n\r\nElizabeth Knopf (37:51.342)\r\nLet me see and No empty sorry, I was empty Let me let me pull this up and see because for some reason let me stop the share and see if I can reshare this\r\n\r\n\r\nNikolas Hulewsky (38:04.209)\r\nAnd so every time you go into cloud code, you're like, okay, here, this is like my template of things. I'm going to upload basically the context.\r\n\r\n\r\nElizabeth Knopf (38:10.196)\r\nYes. So I'm basically having exactly. I'm having it build templates as I'm learning so that I can say like, I've done a data cleaning project. So I know here are the rules or things that come up so that I don't have to like recreate the wheel. And then also when I'm just like doing projects, like I want it to break it down into bite-sized pieces, always have a to-do list, always have certain security things. So let me see here.\r\n\r\n\r\nElizabeth Knopf (38:40.301)\r\nOkay.\r\n\r\n\r\nElizabeth Knopf (39:01.294)\r\njust making sure, okay, this is the right one. Okay, all right, so, okay, so these are like my different little projects I have going on right now. Let me just make sure there's no API showing, okay. All right, so here's sort of the, let's go back up, okay, so here's my overall Cloud Code file structure. So I have,\r\n\r\n\r\nNikolas Hulewsky (39:24.422)\r\nMm-hmm.\r\n\r\n\r\nElizabeth Knopf (39:25.684)\r\nBut I my active ones, have staging, and then I have my systems. So these are different little systems that I'm telling it to do. So I have a to do aggregation log. if I pull. Yeah. So I just decided again, for my agents that are doing things or have a system for doing project management. like think of your management systems, like when you're managing things, like how you would have a team and how you manage a team you do on a daily basis, a check-in you want to have.\r\n\r\n\r\nNikolas Hulewsky (39:34.865)\r\nWhat does that mean? I'm so sorry. Systems? What do mean systems?\r\n\r\n\r\nElizabeth Knopf (39:54.53)\r\nWhat are all the to-do's for the day? Your prioritization.\r\n\r\n\r\nNikolas Hulewsky (39:54.961)\r\nIs, would it be fair to say like this is an SOP folder where it's like, this is how you do things?\r\n\r\n\r\nElizabeth Knopf (40:01.332)\r\nExactly. It is, it is more though than it is both an SOP plus the execution. So I have actual agents in there, which again, all I did was tell Claude, make an agent that can do X, Y, and Z things. An agent that will get all of my to-dos from every project on a daily basis and aggregate them and add them to that dashboard. So that is literally.\r\n\r\n\r\nNikolas Hulewsky (40:26.821)\r\nAnd that runs independent of you. don't have to like push a button to have it do it. It's a certain time that it goes and runs.\r\n\r\n\r\nElizabeth Knopf (40:30.99)\r\ncorrect because I said exactly I said here's the schedule you do it and so it will go ahead and update it I didn't do it in real time because that takes a lot of CPUs and just will kill your system but you know I have a way to do that if I wanted so so basically I'm thinking through okay this is what I want it to do so I don't have to manually do this I'm allergic to doing manual tasks and anything administrative so\r\n\r\n\r\nNikolas Hulewsky (40:47.665)\r\nHmm.\r\n\r\n\r\nElizabeth Knopf (40:56.3)\r\nI just say, I don't want to do this, so can you do this for me? So let me even just see if I can open up this so that you can see maybe what this looks like. Move that over.\r\n\r\n\r\nNikolas Hulewsky (41:02.181)\r\nWhat the F***\r\n\r\n\r\nNikolas Hulewsky (41:10.703)\r\nYeah, it's like you're almost building your own little Claude project, right? Cause the Claude projects have context where it's like, this is how I want you to act. I want you to always give me to do's. I want you to make sure that you're attacking problems this way. And in Claude code, you don't, you don't have that context. So you, need to recreate it again, which is why you're, building the systems folder.\r\n\r\n\r\nElizabeth Knopf (41:35.598)\r\nAnd I've had to rebuild this like I've had to say okay scratch everything let's start again so like as you're building and you're trying to do this for yourself don't be afraid to do that because you'll figure something out and be like that was stupid or you'll build one thing and then you forgot you build it and you build it again and then they're conflicting and it creates problems so just like yeah\r\n\r\n\r\nNikolas Hulewsky (41:51.921)\r\nWell, wondered, I wondered too, if I could get to the end of maybe the end of creating something and just say, please write me my operating system based on the way that I interacted with you. I don't even know what the right prompt would be, but some type of markdown that helps you remember what I like and what I don't.\r\n\r\n\r\nElizabeth Knopf (42:05.646)\r\nOne, two, three.\r\n\r\n\r\nExactly, exactly. You can absolutely do that. And another thing I found is helpful is, so it doesn't have great context management or sort of ways to remember your whole chat. Cause when you close out one of those little black boxes, the terminal window, it loses everything of what you just did in the chat. So what I've been doing now regularly is saying like create an MD file of the whole chat.\r\n\r\n\r\nNikolas Hulewsky (42:24.005)\r\nYep.\r\n\r\n\r\nNikolas Hulewsky (42:28.88)\r\nRight.\r\n\r\n\r\nElizabeth Knopf (42:33.842)\r\nand create a file that basically summarizes it. So when I start this again, I have context I can reference. And so that's really helpful to have those things so then you can manage your context because in those chats, if you're not clearing it out regularly, it'll actually like get worse over time because you're overloading it.\r\n\r\n\r\nNikolas Hulewsky (42:39.633)\r\nMmm, that's really smart.\r\n\r\n\r\nNikolas Hulewsky (42:52.027)\r\nHoly crap, this is insane. Personal operating system and then it has all the files with.\r\n\r\n\r\nElizabeth Knopf (42:59.276)\r\nYeah, so it has a file. Yeah. So like I have stuff for my family. Yeah, financial tools. So stuff that I put on. Yeah. So I basically am building out all these different things. Obviously I have to iterate and update this. And I've had to redo this a few times. So I'm sure things are missing.\r\n\r\n\r\nNikolas Hulewsky (43:02.995)\r\nlook at that, family management. Dude, that is amazing. That's amazing.\r\n\r\n\r\nNikolas Hulewsky (43:18.459)\r\nSo what is that? Do you tell it to, when you're creating something new, you just say, hey, please reference my personal OS architecture in this folder.\r\n\r\n\r\nElizabeth Knopf (43:26.126)\r\nYep, yep, yep, yep. You have to be in sort of the right place within the folders for it to know how to reference things, which is a little tricky sometimes if you're early on in process. But as long as you're sort of at the, you know, my sort of high level folder is the Cloud Code Files folder. So if I'm in there, I basically can say, go reference my operating system and do X, Y, and Z thing, or do this, blah, blah, blah.\r\n\r\n\r\nNikolas Hulewsky (43:36.603)\r\nSure.\r\n\r\n\r\nElizabeth Knopf (43:54.484)\r\nSo yeah, so you basically will have it do that. If I'm in a lower file structure, it'll only sort of see what's in that lower level file folder. like again, architecture.\r\n\r\n\r\nNikolas Hulewsky (44:05.509)\r\nWhat are the different categories and frameworks that you have? we have, up to the top again. So systems architecture, you've got the smart context manager. Basically you're it to say, you're saying be token efficient, modular design. Okay, so you're talking about the way that you're scaling your security framework and your master launcher. And then you've got the enhanced project management. Like basically you're just telling it the things that you like.\r\n\r\n\r\nElizabeth Knopf (44:35.83)\r\nYeah, exactly. Or like again, when I said always make the chat log or always make the context or whatever, those will be rules in this folder. I'm still sort of iterating through for like when I create a new project, always inherit these sets of rules and create the cloud.md file and always create the to do list file. So that's sort of like, again, I've iterated this a few times, so don't even know what's right now. I have to figure out what's what at the moment.\r\n\r\n\r\nNikolas Hulewsky (44:36.197)\r\nRight?\r\n\r\n\r\nNikolas Hulewsky (44:53.424)\r\nMmm.\r\n\r\n\r\nElizabeth Knopf (45:03.022)\r\nbut those are like the rules and agents I'm building out, or sorry, those are the rules I'm building out. And then from there, I'll have like little agents that'll go and say, okay, on a daily basis, go and get those to do files, go and check the security, go and debug something. You can have like...\r\n\r\n\r\nNikolas Hulewsky (45:25.243)\r\nSo let me ask you this. get that the agents are running at the end of the day and they're gathering that information, they're putting it in the dashboard. If you're in the middle of a project though, what do you have to do in order for it to generate the data so that the agent will find it and take it, right? Cause you have one agent that's like, go find all the to-dos. Cool. Well, if the to-do is not generated, it's not going to be able to find anything, right? So how do you make sure that at the end of the day, like, do you have a mental checklist or do you also prompt it to say,\r\n\r\n\r\nElizabeth Knopf (45:43.554)\r\nYep.\r\n\r\n\r\nNikolas Hulewsky (45:55.139)\r\nAt the end of this, make sure you do this.\r\n\r\n\r\nElizabeth Knopf (45:57.678)\r\nYep, so you can do it either way, like both work. Right now, I have been doing it more on the mental side of things, but I've just started adding these rules and tasks. So let me even see if I can find in one of my other folders rules that I can show you.\r\n\r\n\r\nNikolas Hulewsky (46:12.881)\r\nI mean, theoretically, you could create an agent that's like, go at the end of the day, look at every new folder that's created or new project, but however, I don't know exactly how you define it. Pull out all of the to-dos. And if there are any to-dos that are missing, put that on the dashboard so that when you go to the dashboard, you're like, crap, I didn't put the to-dos. Right? Like it's like, there's a yellow flag there for me.\r\n\r\n\r\nElizabeth Knopf (46:18.755)\r\nMm-hmm.\r\n\r\n\r\nElizabeth Knopf (46:30.988)\r\nExactly.\r\n\r\n\r\nExactly. So here's one of my rules folders for one of my projects. This one. Let me see if one more that we can pull up.\r\n\r\n\r\nElizabeth Knopf (46:51.854)\r\nOkay, so this is like my to do collector agent that's doing that. This was in.\r\n\r\n\r\nNikolas Hulewsky (46:55.707)\r\nMm.\r\n\r\n\r\nElizabeth Knopf (47:01.678)\r\nGood one. Okay, here's another. Okay, so I'm right now trying to build out a little, what was this, the same one? Yeah, okay, cool. A vendor quote collector. So basically, we have to get our windows redone in our house, so I don't want to call a gazillion places, so I want it to basically create a little way that will email out all, basically scrap data of a bunch of vendors.\r\n\r\n\r\nNikolas Hulewsky (47:02.449)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (47:17.562)\r\nYeah.\r\n\r\n\r\nElizabeth Knopf (47:29.132)\r\nget their contact info, reach out to them, and then start parsing them. So anyway, so I started this project. So I put together these rules for what it needs to do. Project overview, technical considerations, development phases, context management, and status stuff. So here's where it says, create the to-do file, analyze requirements, build out the architecture on the design.\r\n\r\n\r\nNikolas Hulewsky (47:29.915)\r\nSo cool. Yep.\r\n\r\n\r\nElizabeth Knopf (47:57.526)\r\nAnd then in my to-dos, basically built out a checklist of stuff it needs to do. And then I haven't really been working on this, but it'll go through and check off hypothetically each of these little things as it gets it done.\r\n\r\n\r\nNikolas Hulewsky (48:11.717)\r\nWow. I know this just comes easy and naturally to you, but I think there's a huge opportunity to start businesses just around this, around helping people, companies get organized with their data infrastructure with respect to AI. Cause like I have stuff all over the place and I always am like, did I do that in claw? Did I do that in chat, CPT? Did I do that in perplexity? Like whatever it is, I would bet I could build agents that are like at the end of the day, go to these chats or at least figure out.\r\n\r\n\r\nsome way to do that to stay organized. Man, kind of, yeah. You always blow my mind, Liz.\r\n\r\n\r\nElizabeth Knopf (48:47.426)\r\nYou know what agent we really need to build though, or maybe I'll start working on this, is basically all the stuff we talk about from the pod that can just then go and build off those little apps for us. Which is possible. It's possible.\r\n\r\n\r\nNikolas Hulewsky (48:59.013)\r\nYeah. Yeah. Well, the other thing I was going to say is like, I know the RSS feed got us over to here. That is an amazing idea. You're like, you're curating information for people. And yes, I can go to perplexity. However, I'm still at the mercy of perplexity and what they're giving to me. I think most people would still like to have a human who's like curating the news. That's why I like local newsletters.\r\n\r\n\r\nElizabeth Knopf (49:15.822)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (49:29.561)\r\nYes, you can go and gather a bunch of information, but the editors insanely important because that editor knows the local area so much better than any LLM at the moment. So which new stories do you pick? What do you put in there? What do you not put in there? And so having this RSS speed built out, you could have custom, like I could, it's almost like building a newsletter. I could build a custom RSS feed that just goes out every single day of like, Hey, Eagle Idaho, here's what happened yesterday. And I spent five minutes a day just curating that information.\r\n\r\n\r\nElizabeth Knopf (49:53.816)\r\nMm-hmm.\r\n\r\n\r\nElizabeth Knopf (49:58.818)\r\nYep, absolutely.\r\n\r\n\r\nNikolas Hulewsky (50:00.613)\r\nMan, that is so freaking cool. Okay, I'm gonna end it here. Liz, as always, this was fantastic. What do we have to look forward to next week?\r\n\r\n\r\nElizabeth Knopf (50:12.934)\r\ngosh, next week. there's been a couple of things I feel like we've talked about. have to show you how to do some, think data scraping and data cleanup with cloud code, I think would be interesting. I know that's sort of boring, but it's like something we all hate doing. And I know you've had use cases and I just finished a big project around that. That saved me a very long time.\r\n\r\n\r\nNikolas Hulewsky (50:21.958)\r\nTubby awesome.\r\n\r\n\r\nNikolas Hulewsky (50:33.201)\r\nThat would be awesome. working on something right now where it's like, I've aggregated all the data, I have good data, but now how do I put it in the format where I can then analyze it? I'm, spoiler alert, I'm not doing well.\r\n\r\n\r\nElizabeth Knopf (50:42.028)\r\nMm-hmm. Yeah, we can do that.\r\n\r\n\r\nElizabeth Knopf (50:47.182)\r\nWell, that's where Cloud Code will help you out. And again, everyone wants to do scraping, but there's still some friction there in doing scrapers. So Cloud Code makes that easy too. So we can do all that fun.\r\n\r\n\r\nNikolas Hulewsky (50:58.331)\r\nCool. OK, next week, the date.\r\n\r\n\r\nElizabeth Knopf (51:01.998)\r\nSounds good.",
  "metadata": {
    "duration": "",
    "date": "2025-09-12",
    "platform_source": "Google Drive"
  }
}