{
  "episode_number": "174",
  "episode_title": "AI SERIES: 15 - How AI is Revolutionizing Home Services Lead Conversion with Bryan Shankman",
  "guest_name": "Bryan Shankman",
  "business_name": "Lead Truffle",
  "transcript": "﻿Nikolas Hulewsky (00:00.162)\r\nstarts anyway so. I'm excited to talk to somebody because I think you are what I aspire to be which is somebody who understands AI. And understands home services. So Brian. What's your company what do you do.\r\n\r\n\r\nBryan Shankman (00:14.348)\r\nYeah. Yeah. I'm Brian. I'm the co-founder and CEO of Lee truffle. It's an AI customer service rep that helps home services, convert website visitors and miss calls into book jobs. I could talk more about how it works, but pretty much the, the net net is every day. I'm helping small business owners leverage AI primarily to impact the top of their funnel, right? Instead of needing to be monitoring the phones 24 seven, or if they're having a lead overflow or it's 11 PM on a Tuesday.\r\n\r\n\r\nOur app helps them have a conversation with that lead specifically over text message and then book that job for them.\r\n\r\n\r\nNikolas Hulewsky (00:47.992)\r\nThat's what I was gonna ask. So it's a chat bot essentially, it's not calling on the phone.\r\n\r\n\r\nBryan Shankman (00:50.702)\r\nYeah. So it's not a voice agent at this point. might be something that, you know, we explore down the road, but, for now it's all over text message, which definitely has some advantages to voice, but also has some disadvantages. but yeah, for, for the most part, it's when someone's on the, you know, proven plumbing's website or car charger specialist website. there's a traditional form fill experience, which a lot of consumers have had a bad experience with and\r\n\r\n\r\nNikolas Hulewsky (01:03.032)\r\nYeah.\r\n\r\n\r\nBryan Shankman (01:18.584)\r\nhave filled that out, it goes into some email inbox that hasn't been monitored in three weeks and the person logs in a week later to see they had a lead two weeks ago that they missed. On the other hand, you have a traditional web chat experience which has a lot of benefits but also is web chat if the person says how they need to pay you for a $30,000 job tomorrow and then bounces off the website, that lead is effectively gone. We've sort of flipped both of those on their head and combined them into one where it's essentially a chat widget looking.\r\n\r\n\r\nthing, but we actually just ask for the name and phone number and then the rest of the conversation happens over text message.\r\n\r\n\r\nNikolas Hulewsky (01:52.303)\r\nIs it a picture of like a person who's like, nice to meet you. What's your phone number? Okay.\r\n\r\n\r\nBryan Shankman (01:55.336)\r\nYeah, I could show you an example, it's basically, yeah, it's a little pop-up and there's usually a picture of the owner operator and we just kind of looked at all the best highest converting chat widgets and made our own version.\r\n\r\n\r\nNikolas Hulewsky (02:06.988)\r\nI had the founder of a company called Think.ai, T-H-Y-N-K, have you heard of them? Yeah, I mean, there's a lot of these in this space. So they are customer support. They literally will answer the phone. And I was like, I gotta do a demo live. I gotta do it live. And so we did, we did it live. And it's still laggy, right? There's still a time in between. he was saying that I could dial it up or dial it back. It just really depends on.\r\n\r\n\r\nBryan Shankman (02:12.578)\r\nI'm not familiar now.\r\n\r\n\r\nBryan Shankman (02:23.821)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (02:34.87)\r\nperson that they're speaking to because it still it interrupts. Like I'll use chat GPT sometimes and I'll talk to it and then it'll give me give me answers. But I pause a lot in my speech like right here. And the problem is you'll be in the middle of your thought and then yeah you'd be jumping in right now right like cutting me off because you're you don't necessarily know that. So he was like we have to have the lag in there long enough so that it doesn't just interrupt you while you're speaking to it but also short enough where it doesn't feel like\r\n\r\n\r\nBryan Shankman (02:49.218)\r\nIf I was an AI, I'd be jumping in right there. Yeah.\r\n\r\n\r\nNikolas Hulewsky (03:04.906)\r\nthis is AI. like, and we just haven't figured that out. AI in general, not his company, but just AI in general hasn't figured that part out yet.\r\n\r\n\r\nBryan Shankman (03:12.568)\r\nYeah, I have a lot of opinions on voice and AI that I could go into my quick summary. In my opinion is that voice is getting better every day. It's just not really there yet. In my opinion, at the same time, I think that in the age of AI, two of the most high leverage things you can do is meet people in person and then have real live conversations with them, whether it's on zoom or on the phone. And so for a home services business, if you can have a senior trained CSR, pick up the phone when someone needs pest control tomorrow. I just went through this at my house.\r\n\r\n\r\nthat is just so comforting for the lead or the new customer. And so for me, I tell our customers, we don't want to replace that experience having the owner operator pick up the phone and talk to a real human being, because I think that's actually at a premium nowadays. So anyways, I think voice will be there soon. for me today, I think having a real human on the phone is actually kind of there's some alpha there.\r\n\r\n\r\nNikolas Hulewsky (04:02.828)\r\nI did test it, I wanted to push it a little bit, because I was curious on how it would respond, and I was like, I think its name was Eric, I that was the name of the guy I was talking to. I was like, listen Eric, you've been mansplaining to me this whole time, and I just really don't appreciate, I just, whatever, went off on him, and he was like, I'm really sorry about that, let's try to bring this back to the conversation. It did a good job, it didn't meet me escalated like that, so I think that'll be a good use case, make sure it's not yelling at people. So.\r\n\r\n\r\nBryan Shankman (04:29.155)\r\nsure.\r\n\r\n\r\nNikolas Hulewsky (04:33.533)\r\nYour experience, I guess, was kind of interesting. We were talking before this. You first, had a company that was a plugin for Jobber. And for those who don't know, what is Jobber?\r\n\r\n\r\nBryan Shankman (04:39.598)\r\nCorrect.\r\n\r\n\r\nBryan Shankman (04:43.586)\r\nJobber is a CRM for home services. One of the top ones alongside Service Titan and House Call Pro, probably the big three.\r\n\r\n\r\nNikolas Hulewsky (04:51.598)\r\nI always have a hard time calling it a CRM because I'm like, it's not just, you know, for leads. lot of these businesses run off of jobber. It's like, that's their scheduling tools, their billing tools, their accounting tool. Like it's just, it's the all in one thing. Anyways, that's my own like personal weird thing, calling it a CRM. And then before that, what did you do?\r\n\r\n\r\nBryan Shankman (05:11.074)\r\nSo before that, I spent 10 years in mostly venture-backed software companies. Most notably, I was the second sales hire at a company called Frame.io, which some people may or may not be familiar with, but it's a video review and approval platform. Employee number 39 and stayed with them through the acquisition by Adobe. And so I don't.\r\n\r\n\r\nSay that to flex. say that because it was like four or five years in my mid twenties when I learned a ton about software and building specifically go to market teams. So that was my career. then did a stint at Tik TOK, which I didn't like working at a big company, but also was cool to work at Tik TOK, uh, did a couple other things, but went out on my own officially about two years ago and have been building software companies since.\r\n\r\n\r\nNikolas Hulewsky (05:52.015)\r\nIt wasn't meant to be a flex, but it was kind of a flex. gotta get it.\r\n\r\n\r\nBryan Shankman (05:54.23)\r\nYeah, it was a subtle flex, subtle flex. Hey, clearly I didn't make that much money because I'm still out here working, so.\r\n\r\n\r\nNikolas Hulewsky (06:03.689)\r\nWhat made you get into home services? I think that's interesting. Like you're working at these tech companies. Home services is obviously very different. I Jobber. I wouldn't have even thought you knew what Jobber was going from TikTok. Like who goes from TikTok to Jobber?\r\n\r\n\r\nBryan Shankman (06:05.665)\r\nYeah.\r\n\r\n\r\nBryan Shankman (06:14.563)\r\nYeah.\r\n\r\n\r\nYeah. Yeah. It's a good question. I, so we found home services in a very roundabout way. I'll try and give you the 30 second or 15 second version. I officially went out on my own. met someone on something called YC co-founder match. If you're not familiar, it's like a dating app for tech bros and you pair up and I'm the sales guy. He was the tech guy. did another app in the B2B SaaS sales space, which is again, my background. Long story short, we went on Reddit.\r\n\r\n\r\nthinking about doing this ringless voicemail space, met a pest control owner in Seattle named Wesley, Wesley at Parker Eco Pest Control, out, still a friend today, and she wanted a ringless voicemail system, and so we started building it for her, and she asked if we could integrate it with her CRM, which was Jobber, and we said, ooh, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (07:04.046)\r\nSo this, hold on, on, this is a really cool thing. Chris, my business partner, has used Ring List voicemail jobs for years. Can you explain what those are?\r\n\r\n\r\nBryan Shankman (07:11.628)\r\nYeah. Yeah, so ringless voicemail is a way to leave a voicemail on a person's phone without the phone ringing.\r\n\r\n\r\nNikolas Hulewsky (07:23.448)\r\nSo, and these are typically outbound sales tactics, right? Where you are, you want to contact these people and you don't, you don't want to necessarily call them because they may pick up and hang up. You don't necessarily want to text them. So you're, you're leaving a message anyways. Yeah.\r\n\r\n\r\nBryan Shankman (07:36.0)\r\nYeah, I don't want to throw your boy Chris under the bus here but yeah sending ringless voicemails to people that you don't know or haven't opt in opt it in is like highly inadvisable and a really bad idea, but Yeah, the word would be illegal so I'm not trying to get anyone like catch anyone a case here. yeah, okay Yeah If you're trying to yeah, if you're gonna yolo it yolo it but sms and all this like, you know cell phone automation stuff is so highly regulated so\r\n\r\n\r\nNikolas Hulewsky (07:41.602)\r\nThrow away.\r\n\r\n\r\nNikolas Hulewsky (07:46.53)\r\nThe word would be illegal. That would be the word.\r\n\r\n\r\nNikolas Hulewsky (07:54.255)\r\nHe doesn't do it anymore, but yeah, he used to do that to test ideas and stuff.\r\n\r\n\r\nYeah, yeah,\r\n\r\n\r\nBryan Shankman (08:05.954)\r\nwe at least at my company after learning about it all try and do all the right things for ourselves and our customers. But the way our customer was using it was actually pretty creative as the invoice in her accounts receivable hit 30, 60, 90 days overdue. Invoice voicemail will go to her customers phones in her voice thanks to 11 Labs and voice cloning which is all pretty new a year ago. And so it'd be like, hey, this is Wesley Parker, you go pest control your invoice for XYZs.\r\n\r\n\r\nNikolas Hulewsky (08:28.376)\r\nVery cool.\r\n\r\n\r\nBryan Shankman (08:32.686)\r\n30, 60, 90 days overdue and she brought her accounts receivable down by like 50K in the first month. So that was our entry point to answer your question, Nick, about into home services. We worked with her. We found the job or app store, which had like 20 apps on it at the time and just thought there was a lot of opportunity there.\r\n\r\n\r\nNikolas Hulewsky (08:47.064)\r\nWhat did you do with that? So what happened with that company?\r\n\r\n\r\nBryan Shankman (08:49.454)\r\nUh, yeah. So that then, uh, we built that for Wesley one-off essentially custom dev project that then turned into tool desk, which if you're a job or user, go into the job or app store and search in, uh, SMS marketing, you'll see there's three options, MailChimp, Chirp and tool desk. So we're still one of the few options for SMS blasts in the job or app store. Um, again, another long story, but we just realized that there is massive limitations on being tied to one CRM.\r\n\r\n\r\nNow if that's CRM's HubSpot or Salesforce, you're good, because those are so big. Jobber, it's big quote unquote, but big enough to build a million dollar software business on the back of no. And so we realized that we needed to do something. We love the space, learned and met so many great people, learned so much about the industry, but that led us to them pivoting and saying, okay, Tool Desk is great, but there's just really like hard limits on it. So we then pivoted to Lead Truffle, which is what we're working on today.\r\n\r\n\r\nNikolas Hulewsky (09:21.44)\r\nstory. Yeah.\r\n\r\n\r\nNikolas Hulewsky (09:43.567)\r\nBecause that is a really cool idea. A lot of people struggle with collections and they think, like, how do I improve my collections? And they don't necessarily want to sit down and call every individual customer every single day. So, hey, I'm going to do a voiceless or a ringless voicemail drop. I've cloned my voice, send it out to the 100 customers who are 30 days past due. seems like it's great.\r\n\r\n\r\nBryan Shankman (10:03.948)\r\nYeah. Yeah. Don't don't. If it's something my coven and I have totally talked about bringing back on lead truffle and putting into our software because the mechanism is quite valuable.\r\n\r\n\r\nNikolas Hulewsky (10:15.694)\r\nSo we were talking earlier, you, it sounds like from the companies that you've done, very sales oriented, sales related, right? Either capturing leads or outbound messaging to individuals. You were sharing with me your experience using clay, which you'll have to explain what that is to the listeners. Cause unless you're San Francisco tech bro, you probably aren't using clay as your CRM, but using clay and AI.\r\n\r\n\r\nin order to improve your outbound success rates. Will you talk a little bit about that?\r\n\r\n\r\nBryan Shankman (10:47.436)\r\nYeah, yeah, for sure. So if you're in any business, you need leads. I mean, unless you're like have some consulting firm and you have one client that pays you a million dollars a year or something. like if you're in any telly, any relatively medium to small to any business, you need leads. I I think that's fair to say. And so Clay is essentially a way to prospect more thoughtfully and more specifically.\r\n\r\n\r\nNikolas Hulewsky (11:01.016)\r\nbe nice.\r\n\r\n\r\nNikolas Hulewsky (11:06.422)\r\nAny business? Yeah.\r\n\r\n\r\nBryan Shankman (11:17.176)\r\nWhat it does is it's a spreadsheet that allows you to connect to many disparate data sources. One very, very simple example would be, you know, find me all founder CEOs of software companies in San Francisco with 50 to 100 employees, right? So that would be data source one. And then on that same spreadsheet, you know, go find their Instagram profiles by searching on Instagram. And then on that same spreadsheet, you know, go check these.\r\n\r\n\r\nthree B2B data providers for their emails. So now I have one cohesive spreadsheet that's the founders, their Instagram profile, and their email that was able to be searched across multiple databases. you basically, yeah, go ahead. Ty, the stump guy, Tyler, told me about it, but it sounds, I just, I've heard about it from him, but no, I've never used it. Yeah.\r\n\r\n\r\nNikolas Hulewsky (12:01.11)\r\nInteresting. So do you know outscraper?\r\n\r\n\r\nNikolas Hulewsky (12:10.764)\r\nIt's similar to Clay. It's basically built on Google's, I don't even know what the word is, Google search, where basically it's like, I want to find these business owners in this area and their phone numbers. And so you can go and you scrape that data together. But what it doesn't have is the additional functionality of like, okay, now go find me their Instagram, go find me their LinkedIn, go find me their website, like all that other stuff. So that's interesting though, specifically for high intent individuals that are looking for decision makers at organizations.\r\n\r\n\r\nClay is a very good software to use for targeting your outbound.\r\n\r\n\r\nBryan Shankman (12:45.474)\r\nYeah, that's right. And that's where Clay is interesting is that you can connect these data sources, right? So there's like a million places to go scrape Google data. So you got your CSV of, you know, AC, HVAC companies in Austin from data provider one. That's like 20 % of the job. I now need to go find who are the founders or the owners of it. Okay. I got that from LinkedIn. Now I need to check their emails. Well, their emails not in database one. So I got to go then upload the CSV to database two and I'm still missing 40%, you know, so\r\n\r\n\r\nBasically, the process of building a highly high quality, highly targeted list typically requires multiple data providers. puts them all into one.\r\n\r\n\r\nNikolas Hulewsky (13:23.33)\r\nYeah, just, I just had somebody come on. Anyways, they do a similar, they have a similar type product data shoppers. So how did you use AI with clay? That's, that's where I'm curious. Cause a lot of business owners are going to say, Hey, cool. I have the leads now. I could have done that before. What am I using AI for?\r\n\r\n\r\nBryan Shankman (13:39.842)\r\nI think AI and clay is most helpful in two specific use cases. think number one is copy generation. And so when I say copy generation, what I mean is assuming you're doing a cold call, a cold email or LinkedIn DM, kind of the big three channels, you want to say something that is personalized and relevant to that individual. so step one is to get data about that person into the clay table.\r\n\r\n\r\ntheir LinkedIn history. can go as far as seeing how many, yeah, there's so many data sources, so I'll just make some, yeah, sure. Yeah. Yep.\r\n\r\n\r\nNikolas Hulewsky (14:15.118)\r\nCan you show me, can you show me clay? Is that cool? I know about clay. I've, don't think I've ever actually seen it or messed around with it.\r\n\r\n\r\nBryan Shankman (14:22.22)\r\nYeah, it's actually probably going to be a little underwhelming. It's just a spreadsheet, but then I'll show you how outg... Yeah.\r\n\r\n\r\nNikolas Hulewsky (14:27.374)\r\nIt's just a spreadsheet.\r\n\r\n\r\nBryan Shankman (14:31.776)\r\nAlright, can you see this here?\r\n\r\n\r\nNikolas Hulewsky (14:32.078)\r\nYep.\r\n\r\n\r\nBryan Shankman (14:35.726)\r\nhim in a little for you. Yeah, so this is a shout out to Demetro at Home Service Base. He basically is building a B2B database specifically for home services on the back of things like Google My Business. And so for my company, Lead Truffle, these are exactly the type of customers we serve. And so I said, hey, man, can you get me a list of all franchises in the US with 10 to 60 locations? Right? Not so big that we're going to have to go through some long corporate\r\n\r\n\r\nNikolas Hulewsky (14:37.006)\r\nOkay, so just describe what we're looking at.\r\n\r\n\r\nNikolas Hulewsky (15:01.485)\r\nwow.\r\n\r\n\r\nBryan Shankman (15:05.144)\r\nprocess to get approved with big enough where, you know, they'll have, right, there's some meat on the bone. can, they can roll us out to multiple different locations at a time. So what we have here is simply a name of the company and the domain. Now I do want to say I brought this data from an external data source. You also can do things like.\r\n\r\n\r\nNikolas Hulewsky (15:08.11)\r\nThere's some meat on the bone. There's some scale, yeah.\r\n\r\n\r\nBryan Shankman (15:28.206)\r\nfind business review information and perform searches on Google and then just specifically for this audit.\r\n\r\n\r\nNikolas Hulewsky (15:34.178)\r\nWow. So what did you, sorry, what did you click on up there in the top right?\r\n\r\n\r\nBryan Shankman (15:38.67)\r\nOh yeah, so this is action. Let me actually show you something that's probably more specific just to that outscraper use case you mentioned.\r\n\r\n\r\nNikolas Hulewsky (15:46.371)\r\nWell, no, I like that use case as well, because if you're somebody who's on social media, let's say you're on LinkedIn, you have 2,000 connections or you're on Twitter and you have 3,000 connections, you can export those connections and pull them in here. I don't know that it's necessarily going to populate information on every single one of them, but if you're an agency that's targeting a specific type of profile and specific type of person, you bring in these names and then hopefully you're trying to fill out the rest of the contact information, right? Like maybe that's how you're using it.\r\n\r\n\r\nBryan Shankman (16:15.31)\r\nYeah. Yeah. So that's definitely a use case for sure. In this specific scenario, I have just the company. Right. So I know that this is a good fit company for my business. And for Ty, his stump grinding company, it's general contractors. For other people, it's other things. But for me, these are ICP fit companies. But now the work is a few different things. Mainly, I need to find\r\n\r\n\r\ncontact information for these people. But just to the AI point, think where AI can be super helpful here is in doing things like verifying that, like doing analysis of a company to make sure they're actually a fit for your business. Cause one of the worst things you could do on outbound is you have this list of a thousand companies and it turns out that none of them are actually a fit. even if you got a meeting with them, it's like time wasted. So just on the AI front, could come in here and yeah, so I'll show you. So yeah, so there's literally like a use AI button in clay.\r\n\r\n\r\nNikolas Hulewsky (16:42.99)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (17:04.558)\r\nHow does it do that? you're doing it, sorry.\r\n\r\n\r\nBryan Shankman (17:10.894)\r\nYeah, so what you can do is use their models. They mark up the credits from OpenAI and Anthropic times like a million, so I don't do that. This is getting into the little bit of advanced world in KLEI, but not a big deal. You can bring your own API, which just means you can use your own pre-bought credits through OpenAI. For this, use OpenAI, yeah.\r\n\r\n\r\nNikolas Hulewsky (17:32.864)\r\nWhat are you using? Open AI? Okay. And I'm assuming then you've got a, so you're doing an API call, it's going to open AI. And do you have a prompt that you've created for this essentially where you're like, look at this business, do this analysis.\r\n\r\n\r\nBryan Shankman (17:43.438)\r\nyou\r\n\r\n\r\nBryan Shankman (17:47.138)\r\nYep, so that's what we'll do right here. And I'm going to turn off my API key because I need to freshen up my credits. So I'll just use Clays for now. Yeah, and so they have a bunch of templates here that you could look through. I'll just read a couple for your audience. Is this a SaaS company? Classify this company as B2B or B2C. Give me a company snapshot. So a lot of people have built these already. And we have a small list of companies that I got from a really\r\n\r\n\r\nNikolas Hulewsky (17:57.55)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (18:08.008)\r\nwow.\r\n\r\n\r\nBryan Shankman (18:13.102)\r\nspecific data source. But if someone, you know, who hasn't had like a boss or whatever, be like, Hey man, here's some leads. And it's like 10,000 companies. You're like, dude, I don't even know like who these people are. If these are legit or good for my business. Let's say you had a list of people you met at an event. Not all of them are actually going to be a good fit for what you do. So you can come in here and say, please.\r\n\r\n\r\nNikolas Hulewsky (18:34.178)\r\nWell, like I'll let you type that. Ty, who's the stump guy. He might pull a list from outscraper. That's all the general contractors within Provo or wherever he is. But then he needs to know like, all right, which one of these general contractors do commercial, which one of these do residential, which one of these do high end residential, which one of these are just our new build, which one of these are remodels. Like there's probably a host of that's just, that's just general contractors, like on a house, but there's a whole.\r\n\r\n\r\nBryan Shankman (18:34.606)\r\ngo. Yeah, go ahead.\r\n\r\n\r\nNikolas Hulewsky (19:03.374)\r\nhost of verticals he could sell into and probably different ways. So now you're utilizing AI to segment each one of these leads because your outbound approach is obviously going to be different depending on what setting they're operating in. Am I understanding that right? Okay.\r\n\r\n\r\nBryan Shankman (19:18.286)\r\nCorrect, exactly. So AI in this case is really good at categorization is essentially what it comes down to. So I'll read this out here. Please go to.\r\n\r\n\r\nAnd again, I don't want to get too technical here, but you write this prompt once and then it's going to go through each individual row and go to their individual website. So you can just hit play and it'll go to all 400 websites for you. It'll take a little bit of time. But what I'm telling is it is, Hey, go to this website and verify their home services company focused on outdoor maintenance. That's totally arbitrary. I'm just making something up return outdoor. If it is return other, if it is not.\r\n\r\n\r\nSo, yeah.\r\n\r\n\r\nNikolas Hulewsky (19:55.075)\r\nYeah, I've looked through tools like this. I'm not going to say like clay, but where Zapier is like this, make is like this, where you have to actually click in and then give it the parameters that it needs in order to execute the function that you want. It's just cool to watch other people think through how they're setting things up because you do things way different than I would do them. And now I've learned like, that's interesting. He's using the AI within the system. He's not necessarily using his API.\r\n\r\n\r\nSo anyways, I just think that's cool to see how you're setting it up.\r\n\r\n\r\nBryan Shankman (20:27.948)\r\nYeah. And an example use case here would be I only sell to people that do outdoor maintenance. Right. And so now I have this nice categorization where, your green pal is an outdoor company, but hire a helper or not is considered other lawn love is outdoor, et cetera, et cetera. And I won't run all these columns, but now I could take a list of 10,000 companies that I got from somewhere and really narrow it down to the people I want to focus on the.\r\n\r\n\r\nNikolas Hulewsky (20:51.928)\r\nSo this is Clay, but if I was Tyler or Ty, sorry, and I was grinding stumps and I used Outscraper, Outscraper is another tool that can generate leads, not leads, but contact information for people that you may want to contact. You could also set this up where he's got a Google Sheet that has an automation through Zapier that then goes to OpenAI through the API key or not even an automation through Zapier, just calls directly and does the same categorization, right?\r\n\r\n\r\nBryan Shankman (21:22.574)\r\nI'm not sure about that honestly Nick. It sounds reasonable but I don't know about connecting. Yeah. Okay. Okay.\r\n\r\n\r\nNikolas Hulewsky (21:26.51)\r\nWell, I'll say it. You can. Yeah, you can. Nowhere near the functionality that Clay has. And it doesn't have like these, I love how there's like suggested prompts. Cause there are things that like, yeah, I should probably look for something like that. But I'm just saying utilizing AI in this fashion doesn't require you to utilize Clay. You could set this up in your own way, but effectively what you're doing is within Clay, you don't have to worry about creating the automations. Clay has the automations.\r\n\r\n\r\nnatively built.\r\n\r\n\r\nBryan Shankman (21:57.154)\r\nThe AI can, when I first started as an SDR 10 years ago, I'm getting old. I would have had to gone to every one of these websites and gone into a spreadsheet for my A E and Mark to check box with their outdoor. Not the AI can now do this in a couple of minutes. The negative of that is that now people can do this and do these highly scaled email campaigns. And that's a whole other conversation, but just from a straight efficiency standpoint, you can do so much more with so much less.\r\n\r\n\r\nNikolas Hulewsky (22:21.07)\r\nI mean, you said it earlier. I don't know if you said it before we started talking or, in this conversation. It's like, I, and I agree with this, the more and more you're using AI in your business. I think more and more businesses are going to use AI. should. The more important the human touch is going to become. People want to talk to other humans. They want to get somebody out. Who's going to do a quote. They want to have somebody pick up the phone. So I'm in agreement with you. It's like, yeah, cool. More people are going to be doing more outbound campaigns. Now it's going to be about how can you differentiate? And I think.\r\n\r\n\r\nBryan Shankman (22:42.222)\r\n100%.\r\n\r\n\r\nNikolas Hulewsky (22:50.05)\r\nthe human element is definitely a big part of that differentiation.\r\n\r\n\r\nBryan Shankman (22:53.602)\r\nYeah, it's the classic zig when everyone else zags. When 10 years ago you could do a blast email campaign, it was relatively novel and you got what felt like a pretty personalized email in your inbox. Like, that's interesting. Now that everyone can do it and send millions of emails per month, what's way more interesting is meeting someone in person, shaking hands and having a beer or coffee with them because that's so much more rare nowadays. So that's, that's what I'm definitely focused on in addition to some of these other scale things.\r\n\r\n\r\nNikolas Hulewsky (23:16.494)\r\nYeah, and if you've got, oh cool, I've got my chatbot on my website and maybe you've got an after hours call person that's AI and maybe you've got an AI who's sending these cold email campaigns. Well, guess what? You as the business owner, you're not doing any of those things anymore and you've got some time to go do the networking. You've got some time to go get coffee. You got some time to go do an extra job maybe during the day. it's freeing you up not to just like watch Netflix. It's freeing you up so you can do the things that are high leverage, which...\r\n\r\n\r\nwe talked about.\r\n\r\n\r\nBryan Shankman (23:47.438)\r\nYeah, it's a lot of the routine and rote things that are just freaking annoying. Like they're just annoying. I don't really know how else to describe them. Like you can just have the AI do them. Like it would have been so annoying to go to each of these websites and confirm they're my ICP. I just would not have liked doing that, or I would have outsourced it. I would have had to pay money. Like machine, do this for me.\r\n\r\n\r\nNikolas Hulewsky (23:54.606)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (24:01.119)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (24:04.802)\r\nmean, a thousand, how long would it have taken you to do a thousand back in the day?\r\n\r\n\r\nBryan Shankman (24:08.256)\r\nYeah, that would have been my project for the week, categorizing each of those. Yeah. So it's just like, yeah, it's just nice. like you can now focus on talking to Nick on a podcast instead of categorizing these companies all day.\r\n\r\n\r\nNikolas Hulewsky (24:12.226)\r\nThat's insane! my gosh.\r\n\r\n\r\nNikolas Hulewsky (24:21.334)\r\nOkay, two last questions. Before my last question, which is my favorite question, name of your company and website people can find you?\r\n\r\n\r\nBryan Shankman (24:29.528)\r\nFor sure, yeah. My company is Lead Truffle, leadtruffle.com. That's where you can check out my AI customer service rep for home services. And then me personally, I am on X slash Twitter most actively, Brian Shankman, Brian with a Y on Twitter.\r\n\r\n\r\nNikolas Hulewsky (24:46.52)\r\nCool. All right, last question. Which models are you using and for what?\r\n\r\n\r\nBryan Shankman (24:51.598)\r\nYeah, so my co-founder is a software engineer and so he's like always, he has a lot of disdain for like anything that's like not new as of yesterday. So I use 4.0 just because it's one that's on OpenAI. Yeah, chat.jpt and 4.0 is just like, I'm comfortable with it. It handles images well. I'm always copying in PDFs of.\r\n\r\n\r\nNikolas Hulewsky (25:03.737)\r\nokay, chai.dbt is what you're using.\r\n\r\n\r\nBryan Shankman (25:11.842)\r\nPNLs and legal documents and asking you questions. Some of the newer models like 03 are much better. Like these longer like reasoning chains where you can talk through it, like through a complex problem with it. So, but my workhorse 90 % of my stuff is through chat. GPT and specifically for\r\n\r\n\r\nNikolas Hulewsky (25:26.798)\r\nOkay, you're not using any other models for anything.\r\n\r\n\r\nBryan Shankman (25:29.454)\r\nIn our business we do we have fallbacks with Gemini our main our main model is for through open AI We have fallbacks with Gemini, but for me personally, I just chat GBT is my guy. Yeah, just He he likes deep seek a lot for certain things r1. Yeah r1 through deep seek he uses Gemini for a good amount of stuff as well as like I think three or one on chat GBT\r\n\r\n\r\nNikolas Hulewsky (25:39.918)\r\nWhat about your co-founder?\r\n\r\n\r\nNikolas Hulewsky (25:53.837)\r\nOkay, cool, fair. This was awesome, man. Thank you so much. All right, we will talk soon. Stay on. I'm gonna...\r\n\r\n\r\nBryan Shankman (25:57.132)\r\nYeah, thanks for having me on Nick.\r\n\r\n\r\nyou",
  "metadata": {
    "duration": "",
    "date": "2025-05-20",
    "platform_source": "Google Drive"
  }
}