{
  "episode_number": "170",
  "episode_title": "How AI is Redefining Search and Shifting Ad Dollars with Elizabeth Knopf",
  "guest_name": "Elizabeth Knopf",
  "business_name": "",
  "transcript": "﻿Nikolas Hulewsky (00:01.26)\r\nLiz, another busy week. I'm excited because we had tech earnings this week. So we saw Google meta, I think even Microsoft report and we're getting our first glimpses into, okay, they're starting to use AI. Whoa, is it, is it affecting these companies or is it not affecting these companies? So tell us what's the bottom line.\r\n\r\n\r\nLiz (00:06.248)\r\nYes, yes, yes.\r\n\r\n\r\nLiz (00:20.018)\r\nOkay, so Google Alphabet, they came out with their earnings. People were happy about the numbers. And the CEO was really sort of emphasizing various aspects of their business, not initially highly focused on search. But a couple of days later, there was some testimony going on inside of Congress where one of the leaders at Apple revealed that their numbers have declined when it came to search revenue.\r\n\r\n\r\nSo they get, guess, a portion of the ad revenue through their platform. And for the first time in 20 plus years, search is declining. And it was like, I remember if it was 5 % or 8%, but it was significant enough. And of course, after that, Google's stock dropped. So, no, nor they're going to highlight that at all. They're going to start compensating and saying, you know, all this other thing. And I do think they're making some good strategic\r\n\r\n\r\nNikolas Hulewsky (00:59.16)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (01:05.752)\r\nOkay, so on the earnings call, Google didn't say, search is slowing.\r\n\r\n\r\nNikolas Hulewsky (01:14.701)\r\nOkay.\r\n\r\n\r\nLiz (01:16.756)\r\ninvestments, but the challenge is that, you know, that's ad revenue. And so even if they can shift engagement to Gemini, and actually, let me show you, I'll show you a cool chart in a second. But even if they can shift that revenue, those ad dollars still need to go somewhere. And so somebody is going to basically be eating that up. And I don't know if that's going to be Metta or someone that engages social or at some point if any of the AI platforms decide to monetize in a different way besides just subscriptions like\r\n\r\n\r\nWho knows? I don't know what's gonna happen there, but there's still ad dollars that need to be chased because people need to advertise. And so how we see that play out is gonna be interesting.\r\n\r\n\r\nNikolas Hulewsky (01:45.986)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:58.222)\r\nYeah, because search has been the best business of all time for 20 years. But like the most profitable company, fastest growing company, Google, it's been the best business model forever. And this is the first time we've ever seen it. Like, wait a second. Is this not a totally monopoly? Do they have chinks in the armor?\r\n\r\n\r\nLiz (02:01.928)\r\nYes. Yes. Yes.\r\n\r\n\r\nLiz (02:16.116)\r\nRight. And it's so funny that now, you know, it's like the time they're finally going after Google for being a monopoly, it's like no longer the case. That's just how things play out. But the other piece is like, you know, Alphabet, it has all these different divisions that in and of themselves, mean, YouTube is still massive and growing. You've got now Waymo, which is going to be a huge business. All of their, you know, B2B and infrastructure stuff, like that's also big. you know, but again, just as you mentioned, search is massive. And so that's still\r\n\r\n\r\neclipses the rest of their businesses. So again, we'll see. I wanted to show you though one other sort of indicator on, let me share my screen.\r\n\r\n\r\nLiz (03:04.126)\r\nOkay. So if we go ahead and put in chat GPT,\r\n\r\n\r\nNikolas Hulewsky (03:09.742)\r\nAnd so for those who are listening or watching, what are we looking at here? This is what?\r\n\r\n\r\nLiz (03:13.63)\r\nOkay, Google Trends, I'm pulling this up. This helps my FOMO anytime I'm like, am I missing out on something? I go to Google Trends to see what's actually going on. And again, Google Trends is based on search, so there's gonna be some skewed data now that we know that search is declining. But so as you can see, like ChatGPT just blows everything out of the water when it comes to search, and this is Gemini.\r\n\r\n\r\nNikolas Hulewsky (03:16.225)\r\ntrends.\r\n\r\n\r\nNikolas Hulewsky (03:37.326)\r\nCheers.\r\n\r\n\r\nLiz (03:40.168)\r\nBut if you start adding in the rest of the LLMs, so if we put in Claude, why don't we do...\r\n\r\n\r\nNikolas Hulewsky (03:50.68)\r\nSo what she's doing right now is she's got in the Google Trends, we're looking at the trend of chat GPT over time. And then she compared that to Gemini. And it's like, it's not even close, right? It's like, if it's on a scale of 100, chat GPT is at 90 and Gemini is maybe at five or 10%. And that, but now what she's doing, she's adding in Claude, she's adding in Grok, she's adding in, you know, what's the perplexity, maybe what any of these other models.\r\n\r\n\r\nLiz (04:02.376)\r\nYeah, and this is.\r\n\r\n\r\nNikolas Hulewsky (04:19.074)\r\njust to get a feel for like, okay, well, what does the rest of the search market potentially look like?\r\n\r\n\r\nLiz (04:23.666)\r\nYeah, so and they're just not, yeah, they're not even close. And this is over a 12 month period. So it's just, let's see if we can even go any longer. Yeah, this is over 12 months. So even let's just put it in comparison where, you know, where this started, we'll see probably an inflection.\r\n\r\n\r\nNikolas Hulewsky (04:28.206)\r\nWow, this is over the last 12 months? Insane.\r\n\r\n\r\nAnd what Google Trends is looking at is search trends, like search volume for these. Okay.\r\n\r\n\r\nLiz (04:40.852)\r\nYeah, yeah, yeah. So again, this is probably even more exaggerated now that people are actually using the tools to find things. SEO is probably gonna be dying. mean, it'll probably have a very slow death. mean, people are still using AOL. So that's all around. It takes a while for these things to drop off and those behaviors to change, but I think the acceleration is more exaggerated than anything historically we've seen. So go ahead.\r\n\r\n\r\nNikolas Hulewsky (04:56.93)\r\nHmm\r\n\r\n\r\nNikolas Hulewsky (05:09.454)\r\nI think your point earlier was like, if there are $100, and I know that's not the right amount, but just conceptually imagine this, if there's $100 to be spent on ads in the economy, and for a long period of time, Google was soaking up 90 of those dollars, but now the search volume that Google has is declining, so it doesn't have the reach that it once had.\r\n\r\n\r\nWe're not going to stop spending the hundred dollars. So where does, let's say Google went from 90 % to 80%. Where does that additional $10 go? And that's the question. It's like, who does it accrue to? Does it, does it go to Metta? Because Metta has their platform. Does it go to Apple? Apple doesn't really have an ads platform. Does it somehow go to open AI or perplexity or claw, anthropic, or some of these models, or does it go somewhere else? Like that's, that's the question right now is where are these dollars going to go?\r\n\r\n\r\nLiz (06:03.006)\r\nAnd I've seen interesting indicators where I don't actually know the ad dollar numbers, but I know people are using now TikTok, for instance, as a search engine. So people are actually searching in TikTok for various things. And people are also doing that in YouTube. Now, of course, again, that's part of Google's ecosystem. So I think social is going to be a larger search engine. And how that plays out and what that looks like, again, I don't know.\r\n\r\n\r\nNikolas Hulewsky (06:11.181)\r\nMm-hmm.\r\n\r\n\r\nLiz (06:32.434)\r\nI think a lot of dollars are gonna shift to social. I don't know where else.\r\n\r\n\r\nNikolas Hulewsky (06:36.27)\r\nOkay, Google's earnings come out, doesn't look that bad, but then Apple, for whatever reason, under testimony says, oh, our ad dollars are shrinking from search. And everyone is like, oh, that must be because Google's not getting the same ad or search volume that it once had. So it crashes. Have you ever heard of the innovator's dilemma? Okay, so I'm going to explain it and then you correct me because you probably know it much better than I do. But the innovator's dilemma is essentially\r\n\r\n\r\nLiz (06:57.182)\r\nYes. yeah.\r\n\r\n\r\nNikolas Hulewsky (07:06.402)\r\nYou come out with a product, it does really, really well, and then you create this business. We're using Google as an example. You've got search and it's just, search has just been amazing. But then these innovative products start popping up and they kind of start stealing some of your market share. And the innovator's dilemma is, do we continue to double down on this core product and make little changes to it, little optimizations over time just to make the product better or\r\n\r\n\r\nDo we embrace this new innovation and start putting out products that effectively will cannibalize the golden goose that we've had over a period of time? And there's lots of examples over time. Clayton Christensen first, I think, coined this phrase. If you read the book, Good to Great or any of his other works, he was a famous Harvard professor. But that's kind of what Google's going through right now. And it's so weird because you would think Google's the best position to own the AI race. They've got\r\n\r\n\r\nFor many people, probably the best model. It's got a massive context window. It can run really fast. They've got an integrated operating system. They've just got like all of these. How much user data do they have on YouTube? How much user data do they have from search? Like they should be eating everybody's lunch, but they don't want to do anything that might cannibalize their core business. And as an example, you might be thinking like, well, what could they do that would cannibalize their core business? What if they just integrated Gemini into the Google suite?\r\n\r\n\r\nWhat if instead of going to Google Drive or going to your Gmail and then going outside of it to search, you used Gemini to search for those things? Well, then all of a sudden the search volume that they would get from traditional Google would go way down. They would own the search. They would continue to own the quote unquote search market or the AI market. But that that product that they once had would just kind of be gone. And I think a lot of people within Google would revolt against that. So that's that's the dilemma. Do we lose the short term revenue on the bet?\r\n\r\n\r\nthat AI is going to take over without a known revenue model? Or do we continue to just bolster our current product and figure it out at some point on the road? Did I do a good job of articulating it?\r\n\r\n\r\nLiz (09:12.04)\r\nYou did it perfectly. And the key factor there is that cannibalization component where like the original example that they gave was in the steel industry where basically the large steel guys had the full suite of low quality steel all the way up to really high quality steel. And so new steel mills and the way they sort of built these steel factory or mills.\r\n\r\n\r\nwas targeting this lower quality product. And so the steel mill guys were like, well, we don't care about that as much because that's the lower end of our market. It's not as big of a piece of a pie. And then those guys just started eating away and going up market until they basically just.\r\n\r\n\r\nNikolas Hulewsky (09:49.73)\r\nTotally, I mean, the ultimate example that many people use is Kodak. So Kodak was a camera company and they had film. Kodak actually invented the digital camera. I think in the seventies or at some point, like they had the technology, they created the digital camera, but they were like, the quality's not as good. And so they stayed in film. And what happened? Like that business is dead. That business is gone. And Kodak was a massive business for a very long time, but they were, it was the innovator's dilemma. They had film.\r\n\r\n\r\nLiz (09:54.3)\r\nYep, take that.\r\n\r\n\r\nNikolas Hulewsky (10:18.594)\r\nThey didn't want to go away from it, even though they had created the digital product and then the digital product, digital camera ate their freaking lunch over time. But it was because they were unable or unwilling to adapt. And it's a very hard thing because you've got the golden goose. Do you kill the golden goose? Like that's a scary thing. This golden goose has given us lots of eggs for many years. And so anyways, that's the position that Google's in right\r\n\r\n\r\nLiz (10:40.5)\r\nYeah. And I think they're shifting. They see the writing on the wall. They're not stupid guys, and I think you see that now with this year specifically. They've just been releasing and shipping. Basically, they had about 10 years, I would say, not shipping that much of interest or sexiness, and it's more some developer tools with bad UIs and all this other stuff.\r\n\r\n\r\nNow it's like in the last six months really, they have just been coming out and shipping and shipping and shipping. And at the beginning last year I was like, you know, what is going on with Google? Their best position. And now they're just coming out with everything they've been cooking. And I think some of the founders are even now more involved. So, you know, I think they see what's happening, but again, you know, they also have a large company that they have to shift. And that's, as you said, both the innovators, the level.\r\n\r\n\r\ndilemma and a large bureaucracy and all the challenges of just change management of separate shifts.\r\n\r\n\r\nNikolas Hulewsky (11:33.632)\r\nYeah, I mean, you see, you see what happens with these large companies, tech companies in particular is like they go from growth mode to caretaker mode. And it's not a bad thing. It's just they shift in their maturity. And we saw it at Google, Google grows, grows. They were on Eric Schmidt. And then eventually they, they transitioned to Sundar and Sundar is an amazing job of running that business efficiently. It's just a phenomenal job from an efficiency standpoint, but from a new products, it's not great. You look at Apple, Steve jobs, he was the driver, innovation after innovation.\r\n\r\n\r\nJohn Ivy, all these people, they leave and they bring in Tim Cook. Tim Cook's got a freaking phenomenal job of creating the supply chains, of sourcing, manufacturing, like getting their margins to the right place. But again, now they're not the innovator within the industry. So there are a million, Microsoft for a long time, although, gosh, what's their CEO's name? Yeah, Sachin Adel. I actually like that guy. think, dude, he's like such a good balance of the two.\r\n\r\n\r\nLiz (12:23.976)\r\nSatya Nandala.\r\n\r\n\r\nLiz (12:28.168)\r\nHe's great. He's great.\r\n\r\n\r\nNikolas Hulewsky (12:32.078)\r\nBut they had Bill Gates and then Steve Ballmer comes in and they kind of just stay steady. They're in stasis. But then Satya Nadella comes on. He strikes up a deal with OpenAI. Like all of a sudden they've got the innovation back and they're more of a darling. So it's a difficult thing with these maturing tech companies. I totally get it.\r\n\r\n\r\nLiz (12:51.444)\r\nBut I think that for the audience, everybody has an opportunity right now because things are so fundamentally changing and this is the great equalizer. So, you know, both from a technical skill standpoint, it's more accessible than ever. And from a size standpoint, actually some of these small, nimble companies are winning. Like there's, you know, a great chart right now. Let me see real quick if I can pull it up of the number of team members to revenue.\r\n\r\n\r\nNikolas Hulewsky (12:55.597)\r\nYeah.\r\n\r\n\r\nLiz (13:16.937)\r\nFor some of these companies that have already hit like 100 million revenue, think that was like Kerscher and a few others.\r\n\r\n\r\nNikolas Hulewsky (13:17.112)\r\nHmph.\r\n\r\n\r\nNikolas Hulewsky (13:24.534)\r\nWell, so while you're looking that up, if you look at the other earnings that came out this week, Meta came out this week, and their earnings were phenomenal. dude, Mark Zuckerberg, he's got such a good balance of the innovator and the operator. That guy has run a really tight ship there. And you're starting to see now at Meta with their earnings, the revenue per employee jump.\r\n\r\n\r\nSo they're still making capital infrastructure investments. They're still investing in their data centers and their cloud, et cetera. But you know they're not doing? They're not adding humans at the same level that they once were. And he was on stage, I think it was last week with Satya Nadella and they were talking and like Mark, first of all, Mark's freaking weird. Did you see him on the Theo Von?\r\n\r\n\r\nLiz (14:00.542)\r\nGreat. Great.\r\n\r\n\r\nLiz (14:12.737)\r\nIt was just the one with the glasses where it was just, yeah.\r\n\r\n\r\nNikolas Hulewsky (14:14.552)\r\nDude, Theoband's like, do you drink coffee? And Mark's like, nah, brah. Silence, no response. And then Theoband's like, okay. You've never had coffee? And he's like, I drink it recreationally sometimes. You're like, Mark, gosh, man, you need someone to like coach you how to talk to. Anyways, he was talking to Satya Nadella and he said in that conversation, 20 to 30 % of their code right now is being written by AI.\r\n\r\n\r\nLiz (14:41.448)\r\nYeah, and that's incredible. And the other thing people don't talk about when it comes to both writing fresh code is the other thing no one talks about is technical debt. Like that is in my mind, hundreds of billions of dollars in an opportunity of like rewriting all this historical code. And for those that might not be familiar, you have this also in an organization where basically you haven't standardized procedures so that everything is pristine and perfect. So you have\r\n\r\n\r\nknow, piles of documents somewhere where the same thing is with code. It's like you want to get things done quickly and fast. And so it can be a little bit messy, you know, move fast, break things. Well, a lot breaks inside of companies and most companies are sausage factories. You don't want to see how the sausage gets made because it's a mess. And so now being able to use AI tools to clean up those messes is really exciting, even though it's super boring and, you know, not\r\n\r\n\r\nNikolas Hulewsky (15:14.018)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (15:30.722)\r\nI didn't know, dude, I didn't know, I'd heard the term tech debt, but I didn't really know what it was until this weekend. I went to a tribe retreat with a bunch of entrepreneurs and I met, I'd met her before, but her name is Ellie. I'd have to look at her last name, but she has a company called Yala. Have you heard of her company at all? Okay, okay, love her, super smart. Basically, she's a fractional CTO, that's like her job.\r\n\r\n\r\nLiz (15:36.401)\r\nOkay.\r\n\r\n\r\nLiz (15:44.404)\r\nYeah, okay. I know her. Yeah.\r\n\r\n\r\nI haven't, but I know her, yes.\r\n\r\n\r\nNikolas Hulewsky (15:57.28)\r\nShe works with small agencies or small companies that need a CTO. So she's fractional CTO, but she's developed this product on the side called Yala, which addresses this tech debt issue. And it's, it blew my freaking mind. So for somebody who's an idiot like me listening, like tech debt, what does that mean? Imagine you bought a house that's a hundred years old and for many on the East coast, this is a real thing. And you tear up the floorboards, right? Cause you're like, I don't like this floor. And when you tear it up, you're like,\r\n\r\n\r\nwhat's the f- there's a layer of 70s carpet, then there's a layer of like linoleum, and then there's a layer of the actual like original hardwood of the home, and you're like, what is happening here? So then you've got to go in and rip all that stuff out, and then while you're ripping it out, you realize, the plumbing's all jacked up. Not only are there a bunch of pipes, but like there's added pipes from different eras where like, this is a lead pipe, and this one's PVC, and this one's now copper, and whatever. So you have to-\r\n\r\n\r\nIt creates more work. You have to then go in and clean up all that crap. That's tech debt. As they've been creating these companies, the engineers that are writing the code, they have to make a decision. Do we clean all this old stuff up or do we just like patch it and move forward? And most of time they patch it and move forward. So Ellie's company, Yala, what it does is it will, using AI, take a snapshot of the technical infrastructure and then give you an idea of how it currently sits.\r\n\r\n\r\nAnd then you can start to identify like, there's some tech debt here. But it's also for like, we're developing this project. We've gotten this far. I need a new engineer. The new engineer can just come in using YALA and they just, okay, cool. I have a clear understanding of where everything maps to as opposed to spending all that time to map it out. So anyways, to your point, I had no idea that was a thing, but it is a thing and like AI can help solve that now.\r\n\r\n\r\nLiz (17:44.158)\r\nYeah. And just on that note, so I think businesses, there's two opportunities that that brings up. So now everyone's doing vibe coding, right? So most of us who know how to, who are vibe coding, like you get to certain point and then you get stuck or things like you try to ship something and things start breaking. Or there was an example where a guy published a product, but then people were basically hacking into the backend because he had exposed things because he doesn't know the general principles.\r\n\r\n\r\nNikolas Hulewsky (17:53.134)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (18:10.382)\r\nCause he doesn't know.\r\n\r\n\r\nLiz (18:11.708)\r\nAnd so there is a gap and a new market opportunity for engineers to basically fill that gap and be like, okay, we have to now clean up your code that you just vibe coded into existence without thinking through the proper infrastructure.\r\n\r\n\r\nNikolas Hulewsky (18:14.584)\r\nTotally.\r\n\r\n\r\nNikolas Hulewsky (18:22.488)\r\nWell, that's what I didn't understand is like, can go on, can vibe code, right? But it usually gets you like 80 or 90 % of the way there and you still need someone to come in and finish it. Well, in order for someone to come in and finish it, they've got to understand what's the architecture of your coding. And so they will come in and spend probably five, 10 hours at least just understanding what it currently is so that they can make the changes. And that was the point of her product, Yala. She's like, cool, you vibe coded? That's fine.\r\n\r\n\r\nLiz (18:36.18)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (18:50.03)\r\nuse Yalla and now you can go find that engineer and you don't have to pay the 10 hours for them to do the assessment. Yalla does the assessment for them and they can move forward. I think there's going to be a lot of little solutions like that, that people can go in and create and quickly spin up. And then it's solving a problem that we've known it's been a problem, it just wasn't as big enough of a problem for a big tech company to.\r\n\r\n\r\nLiz (19:12.148)\r\nAbsolutely. And there's two other sort of pieces to that as well. So one is cybersecurity because I know Ellie's also, that's her sort of bread and butter. That is also going to be a big issue with all these vibe coded products is because nobody thinks about cybersecurity when they're building those little tools and there's going to be a lot of challenges. So that's one.\r\n\r\n\r\nNikolas Hulewsky (19:17.29)\r\nMmm. Yeah.\r\n\r\n\r\nNikolas Hulewsky (19:29.71)\r\nThat would be an interesting product for an entrepreneur. just like to spin up a, hey, your vibe coding, cool. Buy this prompt or package or whatever and like, cool. Now you're SOC 2 compliant or whatever the compliance level is. That's interesting.\r\n\r\n\r\nLiz (19:40.788)\r\nThere you go. There's been a couple of companies that have recently done really well in the space, Wiz and then Vanta, that have actually proven out that there's a ton of opportunity in cybersecurity across the board. Another opportunity for the business audience, though, is thinking about this from an organizational perspective, because there's also organizational debt. Again, as either people are shifting from\r\n\r\n\r\nNikolas Hulewsky (19:45.846)\r\nHmm.\r\n\r\n\r\nLiz (20:04.348)\r\nsoftware or even again the things that you never do like build an SOP as an SMB like okay, maybe you've documented a couple things but not a lot we know again No things are messy and so by using AI tools just to do the things and the hygiene work that you should do But again, you just don't ever have time or prioritize and we know that's true No one likes to talk about it But you could build little AI agents or tools that help actually make all of those things to build better organizational hygiene\r\n\r\n\r\nSo that again, you don't have to spend the time to do that, but you can still have it done by AI automation.\r\n\r\n\r\nNikolas Hulewsky (20:36.654)\r\nDude, Liz, I love that idea. That is a freaking amazing idea. Not just tech debt, but organizational debt, where it comes in and is, can I tell you something I've been doing the last week in particular? Okay, so I told you I'm working on this project and I hired an intern. And the intern doesn't know anything. He's very smart, but he doesn't know anything. And so I've been wearing my pendant around my chest that's recording everything.\r\n\r\n\r\nLiz (20:48.67)\r\nYeah.\r\n\r\n\r\nLiz (20:54.644)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (21:06.082)\r\nThat thing has been so freaking helpful. Because at the end of every day, I have the transcript and I've taught him now how to do it. And he goes and it summarizes the day. Originally, we used it to map out what his orientation was going to be. And we have those documents now. And so it actually references those documents in the project that we've created to tell us, are we on track? Are we off track? What did we do that we shouldn't have done? What did we need to have done that we didn't do? And like,\r\n\r\n\r\nIt saved so much mental time at the end of the day where not only am I stressed about like, I got to update this thing so that he's on the right track, but also I got to back think through the day and be like, okay, what did we decide on? How did this work? And now I've got the pendant right there, which instantaneously gets me the first draft of like our due outs. And he was so funny. He was sitting at the computer and he didn't know what he said, but like I laughed so hard. He was like, dude, meetings are toast. And it was like, as if meetings are.\r\n\r\n\r\nyou know, an entity or a person, but it's also true. It's like, yeah, meetings are toast. We can have this thing. So just as a business owner, if you just start wearing that thing, it doesn't matter if it's limitless AI or plot or whatever, you just start recording your days and then you create a process for yourself at the end of the day to summarize that, catalog it and archive it. Then you can go back and ask it. like, hey,\r\n\r\n\r\nLiz (22:08.308)\r\nAbsolutely.\r\n\r\n\r\nNikolas Hulewsky (22:31.128)\r\nhow is my sales process? Is it as clean as it could be? And like, it will start mapping these things for you. It's incredible. So your idea of organizational debt, where you just, you got clutter, first you have to give it the information. if so, if you can use that pendant to give it the information, then you can start making really cool decisions. That is a genius idea, Liz.\r\n\r\n\r\nLiz (22:50.9)\r\nWell, on that note too, think like there's a lot of like, I always think of digital workers, but there's also, as you're saying, being out and about and like in the real world, interacting with people. And there are so many businesses like in the trades that are on site. And so they can't go and just, you know, take a video of what they do online because they have a process when they're in the field. And so I think these tools now, whether it's the glasses or are used to be in the body camera business. So, you know, maybe it's a body camera that has the OCR.\r\n\r\n\r\nOr I had been at one point looking at an investment where they were building out a tool that actually helped on the fly doing an analysis of something that then gave feedback or documented it through both video capture and again, explaining it. So no one's really come out with all like a tool suite there, but I think there's also another lane and avenue where people can build out tools to help with that capture of the real world. And there's just a gazillion applications for that.\r\n\r\n\r\nNikolas Hulewsky (23:46.478)\r\nAll right, well, we're gonna have to spin this up before somebody else does. So have like a week time to do this. But even if it's just a prompt where we know how to ask the transcript or the AI to evaluate the transcript, because it's like, okay, you are a process specialist. I need your help identifying any moments in my days, and I'm gonna give you a week's worth of time where I'm wasting time doing something that could be automated. I...\r\n\r\n\r\nLiz (23:49.812)\r\nI know, right? Great.\r\n\r\n\r\nNikolas Hulewsky (24:12.514)\r\nI don't know what should be automated. Even if we just wrote that prompt and created a wrapper, five bucks a pop, that would, no, we might have to cut this part out. I'm just kidding. I really like that. I think that's a really cool idea.\r\n\r\n\r\nLiz (24:22.181)\r\nHahaha\r\n\r\n\r\nLiz (24:27.412)\r\nWell, shifting back to I found the charts and actually to our note about social search, I actually found them in Twitter versus finding them from Googling them. So just another data point on that. All right, here, let me share my screen.\r\n\r\n\r\nNikolas Hulewsky (24:29.101)\r\nYeah.\r\n\r\n\r\nLiz (24:47.73)\r\nOkay, so this again is software development and engineers is basically dropped off a cliff. But again, couple opportunities for folks to maybe fill those gaps for VibeCoders. And then here we have the, this was one of the charts where basically it's showing their recurring revenue and the number of people. And of course these are tech businesses, but still, I mean, I think this is an indicator you would never have seen this even before, you know, 2023. So.\r\n\r\n\r\nNikolas Hulewsky (25:14.414)\r\nWow.\r\n\r\n\r\nLiz (25:15.09)\r\nThis is pretty exciting. again, small medium sized businesses can have these same sorts of numbers as well.\r\n\r\n\r\nNikolas Hulewsky (25:20.75)\r\n12 million ARR with four people.\r\n\r\n\r\nLiz (25:23.38)\r\nYeah, yeah. And this is already now too. So this is an old chart, but it is crazy.\r\n\r\n\r\nNikolas Hulewsky (25:25.666)\r\nSheesh.\r\n\r\n\r\ncrazy.\r\n\r\n\r\nWell, like I was saying, in the Meta earnings, Meta did really well in those earnings because I think people are seeing, Meta is going to be some real value that accrues to Meta. Meta also launched their own standalone model. I'm not sure if I'm saying that right, just like Grok is now its own standalone thing, I believe Meta has launched their own standalone, right?\r\n\r\n\r\nLiz (25:41.672)\r\nYes.\r\n\r\n\r\nLiz (25:49.684)\r\nYep.\r\n\r\n\r\nLiz (25:54.984)\r\nYeah, exactly. So what we're looking at right now is Meta's one. they came out of the gate on feature parity. So basically, they came out with all the same features most other LLMs have, but they have a couple other ones I'll show in a second of things that are different than some of the other ones. this is just meta.ai. So literally, if you go to meta.ai, you'll find this, and it's free.\r\n\r\n\r\nNikolas Hulewsky (26:05.166)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (26:13.602)\r\nWhat's it called?\r\n\r\n\r\nNikolas Hulewsky (26:18.552)\r\nOkay.\r\n\r\n\r\nLiz (26:20.78)\r\nAnd same with grok. It's free and Gemini. It's free and then the other ones have obviously tiers a free tier and then you have to subscribe So I think there's some benefits and considerations the so a couple of the cool features that meta has is so one You can do voice interaction. So that's pretty cool. You can talk to it You can code with it and then you can create a cool image. Let's do Imagine\r\n\r\n\r\nNikolas Hulewsky (26:28.365)\r\nOkay.\r\n\r\n\r\nLiz (26:53.256)\r\ndog wearing sunglasses. All right, we'll just keep it simple for now. Once it generates though, you can then animate it, which is the cool feature. So one, they make it just, yeah, so we're gonna animate this guy.\r\n\r\n\r\nNikolas Hulewsky (27:04.92)\r\nSay what?\r\n\r\n\r\nNikolas Hulewsky (27:09.134)\r\nAlright, so she said, okay, so we got the dog, it's a cool dog with some sunglasses on at the beach, alright, static image, but now it's gonna animate it?\r\n\r\n\r\nLiz (27:18.268)\r\nYeah, so very simply they don't have like crazy, it's not gonna start talking or anything, but it has movement. Yeah, exactly, exactly, I get it. And so of course, chat.tpt has like Sora and then Google has VO and you they're all developing their own image models, but it just came out of the gate and it's just easy, super friendly.\r\n\r\n\r\nNikolas Hulewsky (27:22.606)\r\nWhat the what? So it's like a gif, almost.\r\n\r\n\r\nNikolas Hulewsky (27:36.812)\r\nYeah, but it's also not native. Like, if I want to go use Sora, I have to go out of ChatGPT.\r\n\r\n\r\nLiz (27:42.452)\r\nYeah, it's sort of a funky user experience. again, Meta is consumer focused. They understand people. And so they also made just styles. So you don't have to remember, was it a photo realistic? Do I call it mechanical felt? I don't remember how to call this. now it just makes it very user friendly. So they're really thinking through UI and nuance very well. The other cool feature that I think is an indicator to what we were talking about before. me see if I can get back.\r\n\r\n\r\nNikolas Hulewsky (27:50.668)\r\nHmph.\r\n\r\n\r\nLiz (28:11.476)\r\nis this discovery. there are a couple like mid-journey. Yeah, so mid-journey perplexity have this like UI where people publish things and then you can go through basically this like pin board of what people have created. But what's interesting is if you click on, let's do click on this little Fox guy, all of a sudden you see people commenting on it, liking it and engaging with it. So I think this is an early indicator that they're gonna be.\r\n\r\n\r\nNikolas Hulewsky (28:14.2)\r\nDiscovery.\r\n\r\n\r\nLiz (28:38.484)\r\nincorporating in social dynamics into their AI tool, which we have yet to see, but it makes a ton of sense. Yeah.\r\n\r\n\r\nNikolas Hulewsky (28:45.528)\r\nSo hold on, your screen is, for me, it's small. It's not bad. Are you within, no, no, no, no, no, no, no, you're totally fine. I'm just saying that because I can't quite read it. Are you within Meta.ai and is there like a tab that you click for social or is it just there?\r\n\r\n\r\nLiz (28:50.727)\r\nsorry.\r\n\r\n\r\nLiz (29:03.168)\r\nNo, no, no. So when you go to the home screen and you just scroll down, this is, guess, the discover. So on the left hand side, it says discover. And then they just have this wall of examples. And then again, if you just click into any of them or you can sort of see, like again, likes, comments and remixes, you can take someones and change it to your liking. But you have all of this. So, you know, something's going to happen here. They're smart. Yeah. Yeah. So and again, the other one's positioned well for this.\r\n\r\n\r\nNikolas Hulewsky (29:06.136)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (29:09.74)\r\nNo way.\r\n\r\n\r\nNikolas Hulewsky (29:19.16)\r\nHuh.\r\n\r\n\r\nNikolas Hulewsky (29:27.822)\r\nThat's totally social, yeah.\r\n\r\n\r\nNikolas Hulewsky (29:33.034)\r\nI well I was gonna say, I wonder if with the Facebook example or the meta example, you could create that. Does it give you an option then to say like, would you like to publish this to Instagram and Facebook?\r\n\r\n\r\nLiz (29:44.564)\r\nI'm sure, let's see, copy link. Not yet, but I'm sure that's coming and like that's an easy feature. So I don't see, I don't Yeah, I don't see it here directly, but yeah, I mean, again, they have a massive ecosystem and they're smart cookies. basically created our social dynamics and behaviors online. So I think that's super cool. There's some other cool features, so it's worth checking out. Again, it's free. Oh, the other just cool thing is they actually have,\r\n\r\n\r\nNikolas Hulewsky (29:50.658)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (29:58.957)\r\nthey're very smart.\r\n\r\n\r\nLiz (30:14.196)\r\na way that you can edit the text. So let's say it just created a three-day business trip carry-on packaging list. I now have a text editor here. So rather than going and copying and pasting this into, let's say, a Google Doc or Microsoft, can now within here, let's say, okay, I don't want bullet points. So again, copy and paste is dying, which is fantastic because they're just integrating some of these cool features here.\r\n\r\n\r\nSo again, these are simple things, they do. sorry. Yeah. So I am doing text editing. We're going to bold. This is just a text editor where you can highlight parts and not the whole thing. Yeah. So up here, it's basically just like what you would see in a normal text editor up top. You can change heading types, bold, italicize, whatever.\r\n\r\n\r\nNikolas Hulewsky (30:42.914)\r\nWait a second. You did it fast. I'm so stupid. Wait, what?\r\n\r\n\r\nGood night.\r\n\r\n\r\nNikolas Hulewsky (30:56.99)\r\nso you can click on something to say text editing?\r\n\r\n\r\nNikolas Hulewsky (31:03.586)\r\nYeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (31:08.821)\r\nso it'll give you the output and then you can go and mess around with it.\r\n\r\n\r\nLiz (31:11.252)\r\nExactly. Which again is unique because before it's like you want to change something, you have to do a new prompt and reference this. And so here you can also select a partial amount of text to rewrite that only. So again, small things, but big impact because again, less clicks if you're changing it. Um, another quick thing I wanted to highlight, and then I don't know if we'll have time to get into MCP. I, you know, I had a whole thing ready for MCP, but you know, getting away with the other stuff. Okay.\r\n\r\n\r\nNikolas Hulewsky (31:13.88)\r\nDude. Yeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (31:23.465)\r\nvery cool.\r\n\r\n\r\nNikolas Hulewsky (31:28.204)\r\nYeah.\r\n\r\n\r\nLiz (31:38.696)\r\nGROK, okay, I hate formatting. Like this is the bane of my existence. GROK now allows you to create PDFs without having to go, again, take and copy, paste something, and then convert it into a PDF. So let's do create an academic paper PDF on AI.\r\n\r\n\r\nNikolas Hulewsky (31:52.205)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (32:00.426)\r\nacademic paper PDF on AI. Okay.\r\n\r\n\r\nLiz (32:02.354)\r\nYeah, so you do have to ask it to do a PDF. And if you ask with like certain prompts, you can also get diagrams and sort of technical, like technical visualization in it as well. It's like referencing certain codes. I won't even mention it at the moment that you ask it and it'll bring it up. But okay, let's give it thinking.\r\n\r\n\r\nNikolas Hulewsky (32:18.936)\r\nfine. So it's thinking right now.\r\n\r\n\r\nAnd what exactly, like when you say, create me a, whatever, research PDF, like what are you hoping for? Is it like a long form?\r\n\r\n\r\nLiz (32:32.709)\r\nExactly, exactly this. So a format of where you would go and look at an academic paper, it would be structured and formatted in a way, because this is just a pain in the butt, like having to go format.\r\n\r\n\r\nNikolas Hulewsky (32:40.686)\r\nYeah, so what we're looking at now, it ran, it created it, and it's got the title, it's got the introduction, it's got the methodology. Yeah, it looks like an academic paper.\r\n\r\n\r\nLiz (32:55.198)\r\nacademic paper. But here we'll just do create a resume PDF for\r\n\r\n\r\nLiz (33:05.684)\r\nSo I don't even know if it's gonna look up about me, but it's gonna create a formatted resume.\r\n\r\n\r\nNikolas Hulewsky (33:12.142)\r\nSo I just had a call with a company that's rolling out a software that we created. And from that call, I took the transcript and I created a summary of the conversation and a couple of PDF documents so that we can just have this moving forward. It was kind of a clunky process to do in ChatGPT, just not great. Could I do have done the same thing with Croc?\r\n\r\n\r\nLiz (33:16.734)\r\nMm-hmm.\r\n\r\n\r\nLiz (33:26.184)\r\nThanks\r\n\r\n\r\nLiz (33:36.99)\r\nYeah, yeah, you could literally copy and paste whatever, put it in here and just say, yeah, make me a I literally just said, create a resume PDF, and then I put my name. whatever it could be for whatever info. Like this obviously is not about me or anything, but it can literally take whatever content you put in it and just say PDF in it, and it will output a PDF. So if you want it.\r\n\r\n\r\nNikolas Hulewsky (33:41.346)\r\nTake that transcript and then just say, and tell me what was the prompt again? Write me an academic paper?\r\n\r\n\r\nNikolas Hulewsky (33:53.868)\r\nYeah.\r\n\r\n\r\nLiz (34:03.056)\r\nNDA template if you want, whatever other template, it will create that format for you. Because again, formatting, putting headers, it just takes time. It's like all these little things that are annoying when you're creating a document, but we all like nice visuals. We just don't like creating them. So yeah, huge time saver.\r\n\r\n\r\nNikolas Hulewsky (34:07.491)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (34:21.708)\r\nWhat do you use this for?\r\n\r\n\r\nLiz (34:23.544)\r\nso I haven't actually used it yet because I found out about this only a couple of days ago because I think it launched last week. but yeah, I mean, this is literally, I mean, everything from, I think I've came up with 15 different examples on the hosting on social, which was everything from like, you're creating a menu, a resume, an academic paper, bibliography, an event. I've created a whole event schedule and with the layout of a hotel map.\r\n\r\n\r\nwith this as well. So again, I haven't used it like actively where I've sent this to someone because I haven't used\r\n\r\n\r\nNikolas Hulewsky (34:53.634)\r\nJeez Louise.\r\n\r\n\r\nAn event map? That's really freaking cool.\r\n\r\n\r\nLiz (35:00.04)\r\nme see if I can even pull it up because I don't know where I did it.\r\n\r\n\r\nLiz (35:07.891)\r\nEr.\r\n\r\n\r\nLiz (35:13.836)\r\nI don't know where it is, so I don't want to waste time trying to find it. Yeah, I'll post it later on social as an example. But yeah, I basically did that. You do have to call on some specific language. I don't know what Latex Beamer class is, but I had found it when I asked it. I wanted to do this. I wanted to include diagrams. What's the prompt? So if you want it to do some kind of visualization, you don't know what the prompt is, just ask it, and it'll tell you.\r\n\r\n\r\nNikolas Hulewsky (35:16.26)\r\nit's noise.\r\n\r\n\r\nNikolas Hulewsky (35:39.84)\r\nWhat the freak. This is blowing my mind. I'm doing it right now.\r\n\r\n\r\nin the branding sound that I, here I'm gonna share my screen now. Let's see.\r\n\r\n\r\nLiz (35:50.524)\r\nOkay, I'll miss it.\r\n\r\n\r\nNikolas Hulewsky (36:00.844)\r\nOkay, so I just said I have no idea if this is gonna work. Please turn this transcript. Please take this transcript.\r\n\r\n\r\nthis transcript and make it into a three page marketing PDF document in the branding style that in the branding style of the picture I uploaded. Let's see how this does.\r\n\r\n\r\nNikolas Hulewsky (36:24.63)\r\nUploading uploaded. All right, and then I gave it the transcript. Let's see What it does I'm so curious right now\r\n\r\n\r\nSuper grok. Okay, starting document, setting up the document class, blah, blah, blah, Because if it can do this and make it look good, I will use this all the time. I mean, there's just so many things that you want to communicate efficiently and in a visually pleasant way. I mean, there's a reason why people started posting on LinkedIn and Twitter with these like one line sentences. I used to hate it, but it's like people like to look at that. Like it's visually pleasing for them.\r\n\r\n\r\nto look through this stuff. Okay, it's spitting it out. Okay, so if you can't see this, I'm gonna show this. I took a screenshot and this is Glide. So this is the SaaS company that I have. This is Glide. This is what their branding looks like. I literally just went to the website, took a screenshot and uploaded it here. And so then I asked Grok to take that conversation when we were doing a demo for a team and using the branding that I took from the website, make.\r\n\r\n\r\na marketing PDF that's three pages. And here it is. Wow. It looks good.\r\n\r\n\r\nLiz (37:39.924)\r\nSo I would say for marketing and business process documentation and infographics, I would actually start with doing a, like say, tell Claude to visualize it and it'll create just very basic business visualizations of diagrams and business mapping. And then you can take that and put it then into chat GPT image generation to then make it prettier.\r\n\r\n\r\nNikolas Hulewsky (37:48.333)\r\nMm-hmm.\r\n\r\n\r\nLiz (38:06.644)\r\nSo this is like, again, more academic and sterile and business oriented. But if you go take, before you even, yeah, let's see how good.\r\n\r\n\r\nNikolas Hulewsky (38:09.951)\r\nInteresting.\r\n\r\n\r\nI'm going do it. Okay, I'm going to do it. So you said, man. So I'm going to take this and I'm going to go.\r\n\r\n\r\nLiz (38:22.74)\r\nor you can take personal texts too. You don't need to even take this PDF. Cause I feel like this PDF is again, more like, you know, legal documents and like very sterile that you don't make for marketing. Visualize, you don't have much of a prompt to say like visualize this content and maybe whatever. I don't know what's inside. you know, there you go.\r\n\r\n\r\nNikolas Hulewsky (38:27.063)\r\nI am.\r\n\r\n\r\nNikolas Hulewsky (38:33.506)\r\nOkay, so.\r\n\r\n\r\nNikolas Hulewsky (38:49.664)\r\nAgain, so this was a presentation that we made to a skilled nursing facility company that we're trying to sell into. But we're doing more and more of these and so we want to have a standardized, like, this is our onboarding documentation, this is our, what?\r\n\r\n\r\nLiz (38:59.22)\r\nOkay. All right, let me change your prompt a little bit. Okay, create like, estimate a couple sections. Like say, visualize three documents of the first three sections. wait, it's doing another one. So let's see if it does it here. Hold on. Cause you can also do multiple visualizations within Cloud now. So rather than having like one, it'll do like multiple documents.\r\n\r\n\r\nNikolas Hulewsky (39:04.299)\r\nYes, ma'am.\r\n\r\n\r\nNikolas Hulewsky (39:23.692)\r\nWhat the freak?\r\n\r\n\r\nLiz (39:27.156)\r\nSo we'll see what it does. Yeah, it's doing a workflow.\r\n\r\n\r\nNikolas Hulewsky (39:29.208)\r\nSo again, all I did was I took the transcript, I put it in here, and then the prompt I gave it was visualize this content for a marketing doc I want to create. And it first spit out an outline that was like, okay, here's the guide over. holy crap. And now it's working to create a visual component that illustrates the glide workflow process. Now it's working on creating a visual component that focuses on key areas of the glide platform. Okay, so let me just look here.\r\n\r\n\r\nwow. So this is the document that's... What the f... No.\r\n\r\n\r\nLiz (40:00.862)\r\nYeah, see you soon.\r\n\r\n\r\nNikolas Hulewsky (40:09.454)\r\nOkay, so this is the document to spit out. This is great. All right, so these, here are the key pieces of it. Here are the key benefits. Start optimizing your revenue today. Okay, great. Then it shows me, here's the Glide platform. This is how it works. This is the value. my gosh. my, dude, it took quotes from the webinar and added them to this document.\r\n\r\n\r\nLiz (40:32.551)\r\nYeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (40:35.628)\r\nI think this could save us a lot of time, manpower hours in the LTC areas. That's amazing! What?\r\n\r\n\r\nSo, and then you would then take this and put it into ChatGPT.\r\n\r\n\r\nLiz (40:48.084)\r\nIf you want to add it prettier add more graphics or like cartoonish stuff like this is pretty good from like a business standpoint It's nice and clean and what you would want. Obviously you can sort of vibe design changing the color\r\n\r\n\r\nNikolas Hulewsky (40:56.622)\r\nMm-hmm.\r\n\r\n\r\nWell, what if I what if I said what if I took like that picture right of like, hey, here here is Glide's brand. Schema. Please redesign. Will it do a good job of this?\r\n\r\n\r\nLiz (41:17.776)\r\nYes, yes, and a couple just things to note. Sometimes it'll put like text on top of boxes or like mess up so there's overflow text. And if you just like tell it, you take a screenshot of it and you put it back in and then just tell it what's wrong, it'll fix it. So sometimes it's not perfect. Like this actually is like beautifully done, but sometimes it's not perfect. But again, you can just vibe design it within, cloud. Yeah, I know.\r\n\r\n\r\nNikolas Hulewsky (41:26.606)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (41:36.513)\r\nI know.\r\n\r\n\r\nNikolas Hulewsky (41:41.378)\r\nThis is insane, Liz. This is so good. Holy crap.\r\n\r\n\r\nLiz (41:44.488)\r\nI've been visualizing everything, so it's fantastic.\r\n\r\n\r\nNikolas Hulewsky (41:48.78)\r\nSo why would you use Grok over Claude then?\r\n\r\n\r\nLiz (41:51.892)\r\nTotally different kinds of business documents. So this is marketing or like visualization. The other is like creating again, like a resume, creating a white paper, a menu, a legal document, various, again, things that don't need branding that are more like just content that you would put typically into a PDF that you have like multiple columns or, know, like a standardized.\r\n\r\n\r\nNikolas Hulewsky (41:55.918)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (42:00.942)\r\nA white paper.\r\n\r\n\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (42:17.133)\r\nYeah.\r\n\r\n\r\nLiz (42:20.276)\r\nstructuring of it, again, you don't need to make it pretty. And with Claude, it's the business use cases that you need to make something prettier. And then with ChatGPT is where you're going to get the cartoons, the animation or the graphics to add on. Like, again, this is like, they're not going to create a cartoon version or a Ghibli version of, you know, your logo, but it will provide just data structured with colors.\r\n\r\n\r\nNikolas Hulewsky (42:45.774)\r\nOkay, it didn't do, it didn't make a ton difference. So I probably just have to go in here and like iterate because the color scheme is not what Clyde is. Anyways, dude, this is fantastic. I love this. We're going to have to do a separate MCP episode. We need to. I know. This was awesome. This was awesome. Thank you.\r\n\r\n\r\nLiz (42:56.478)\r\nYeah. Yeah.\r\n\r\n\r\nYeah, not a perfect idea, but yeah. Yeah. I know, always want to talk MCT, but that's okay. It's evolving.\r\n\r\n\r\nAbsolutely, thank you.",
  "metadata": {
    "duration": "",
    "date": "2025-05-14",
    "platform_source": "Google Drive"
  }
}