{
  "episode_number": "231",
  "episode_title": "How Robots Are Saving America's Nursing Crisis with Matthew Chang",
  "guest_name": "Matthew Chang",
  "business_name": "Chang Robotics",
  "transcript": "﻿Nikolas Hulewsky (00:00.824)\r\nAll right, we have a freaking great episode today. I've got Matthew Chang. You are the founder of Chang Robotics and you're also the general partner of a $50 million Chang Robotics fund. And we're going to talk about what that means, but you're playing in an incredibly cool space right now. You're a Georgia tech engineer. You've got an executive MBA. You've led some of the largest teams with respect to autonomous vehicle deployments and manufacturing in the United States.\r\n\r\n\r\nand you are credited with launching the country's first autonomous hospital initiative. I can't wait to talk you about skilled nursing facilities, because that's my background. You've also been mentioned in Fast Company and Inc. You're a 2025 Entrepreneur of the Year finalist for Ernst & Young, which for those who don't know is actually a very prestigious entrepreneurial award around the country. I guess my first question is, you're winning at life. Does it ever get tiring to then look in the mirror and say, gosh, and I'm handsome too? You know, is it?\r\n\r\n\r\nMatthew Chang (00:52.801)\r\nI'll tell you what's tiring Nick and you can relate, it's having that fourth kid. We made you kids look easy. We were that family that when you see like the two parents spazzing out over one child, you know, we were like, what's your problem when we had three? We had the fourth dude and it felt like I ran into a brick wall. So I don't know how you guys felt about it, but it was so different. Turning eight months this week.\r\n\r\n\r\nNikolas Hulewsky (00:57.55)\r\nDid you just have a fourth?\r\n\r\n\r\nNikolas Hulewsky (01:13.208)\r\nDude, okay, how old is your fourth?\r\n\r\n\r\nNikolas Hulewsky (01:20.398)\r\nOkay, what's funny is I feel the same exact way. I'd always heard people say two to three was the hardest, because you're like, you go from man to man to playing zone. Three was easy. It was like, oh, cool, three is a of cake. Four, I don't know what it was. It's been really hard for us. I felt like we hit a brick wall. And maybe it's because our age, I don't know how old you are, but my wife and I were both gonna be 40 this year and our youngest is now three. And we were like, are we just too old to have young kids anymore? It was hard.\r\n\r\n\r\nMatthew Chang (01:34.969)\r\nYeah.\r\n\r\n\r\nMatthew Chang (01:47.482)\r\nYeah, too much bending over and picking up and wiping, right? I think for us it was our baby had to give up being a baby and that created a lot of tension when we had two babies that was about to turn two when we had our fourth and he loved being the baby. His first words were me baby, right? And then we took that away from him and then he lost his place in the world and it just spiraled out of control.\r\n\r\n\r\nNikolas Hulewsky (01:52.344)\r\nHahaha, yeah.\r\n\r\n\r\nNikolas Hulewsky (02:00.686)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (02:17.186)\r\nWas that the closest your kids have been two years?\r\n\r\n\r\nMatthew Chang (02:20.388)\r\nYeah, they're all two years apart. have four that are all two years apart.\r\n\r\n\r\nNikolas Hulewsky (02:22.99)\r\nOkay. Yeah, cause our first set of kids are three years, three years, three years. And then this last one's two years. And we had the same thought. We were like, I wonder if it was a hard adjustment because that third one was like, I'm not a baby anymore. Kind of losing my place early, but I'm with you, man. I think three to four is hard. Okay. So tell me about chain robotics because I am what people call a Luddite. I don't know anything about this space. I think of\r\n\r\n\r\nMatthew Chang (02:36.345)\r\nYeah.\r\n\r\n\r\nYeah, you got Rob.\r\n\r\n\r\nand\r\n\r\n\r\nNikolas Hulewsky (02:53.23)\r\nYou know, I robot with the movie Will Smith made in 2002. I don't really know what the state of robotics is right now. Give me give me just a high level of what your company does.\r\n\r\n\r\nMatthew Chang (03:04.002)\r\nYeah.\r\n\r\n\r\nWhat we do is we design and install robotic systems and I'll explain that, but we do robotic systems for the workforce. So anywhere there's a workforce, if they could do their job better or safer or cheaper using robotics, then we do that. And that means we have to custom tailor the system design for the operation. So you mentioned hospitals in the intro. That's obviously a nursing tailored system where the point of the robots is to make the nurses lives better.\r\n\r\n\r\nAnd it's not, the primary goal is not to save the hospital money, it's a side benefit, it's not to improve patient care, it's so the nurses will like it.\r\n\r\n\r\nSo that's where we start with everything, whether it's factory e-commerce, smart city. We want the workforce to like it. And then we worry about the other things like the cost savings or the affordability. But if the workforce doesn't like it, they just won't use it. You know, we've all bought tech in our daily lives and for our homes that we thought was cool. And then it got in the closet. I don't think I've run my robot vacuum cleaner in two months, you know, probably because of those four kids and there's\r\n\r\n\r\nNikolas Hulewsky (04:13.239)\r\nReally?\r\n\r\n\r\nMatthew Chang (04:14.636)\r\nBut it's like, I bought it, it's great, but it doesn't work if it drives over a Lego. So it's out right now. It's out of commission. So my workforce is rebelling against the tech.\r\n\r\n\r\nNikolas Hulewsky (04:22.744)\r\nNo, it doesn't. So is your company...\r\n\r\n\r\nSo is your company actually building the hardware for the robotics?\r\n\r\n\r\nMatthew Chang (04:34.778)\r\nVery little. So what we do is we source all the components from the open market as best we can. On our website we list a bunch of really cool technology companies that we're partnered with. And so if I can buy it from somebody that that's what they produce, I'm gonna buy it.\r\n\r\n\r\nNikolas Hulewsky (04:37.272)\r\nVery little.\r\n\r\n\r\nMatthew Chang (04:54.958)\r\nThe only thing we self-manufacture is that like last 10 % of a project where there is no custom application in the marketplace for nursing or for this e-commerce application, then we will design and fabricate that. But we leave that for the very end. And that's kind of like a de-risking tool because if we set out to custom produce everything required for a unique project, the project would take 10 years and be way over budget. So it'd be speed to market. take existing tools and we incorporate\r\n\r\n\r\nthat in the design.\r\n\r\n\r\nNikolas Hulewsky (05:27.246)\r\nI'm poking around on your website. Do you have any videos on here? I should have grabbed a video beforehand, but I wanna show what we're talking about. Where would I find one? Projects?\r\n\r\n\r\nMatthew Chang (05:30.488)\r\nYeah. Yeah.\r\n\r\n\r\nMatthew Chang (05:38.402)\r\nYeah, there's a preview screen that shows a bunch of robots in manufacturing. So you might have to click on the manufacturing button and you'll see a bunch of robots driving around. You see that in the background?\r\n\r\n\r\nNikolas Hulewsky (05:39.18)\r\nWe can edit, we'll edit this part down.\r\n\r\n\r\nNikolas Hulewsky (05:56.995)\r\nYep, do. Cool, cool, All right.\r\n\r\n\r\nNikolas Hulewsky (06:08.814)\r\nOkay, so I'm on your website right now and I'm looking at what looks to be like an Amazon warehouse and there's a bunch of boxes on, yeah, you probably can't say, sorry, I actually don't know where it is, but there looks to be a bunch of boxes on these autonomous robots.\r\n\r\n\r\nMatthew Chang (06:16.61)\r\nMmm, close.\r\n\r\n\r\nMatthew Chang (06:26.264)\r\nYeah, I can't tell you where it is, but I can tell you what it's doing. These are autonomous robots that were added to a food production facility.\r\n\r\n\r\nthat was already a very high volume, very critical facility. It's servicing all the big box stores. And these autonomous robots integrated with the legacy machinery to get all the intro logistics done with autonomous robots. This is like one little screen grab. You see a manual fork truck driver there. So it's working with the humans. That's what we call cobotic when the two work together.\r\n\r\n\r\nNikolas Hulewsky (06:35.31)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (07:02.254)\r\nTROBOTIC?\r\n\r\n\r\nMatthew Chang (07:04.164)\r\nCo-obotic collaborative robots. Yep.\r\n\r\n\r\nNikolas Hulewsky (07:05.774)\r\nKobotic, that's awesome.\r\n\r\n\r\nMatthew Chang (07:08.708)\r\nYep. So, so this would be an example. This was one of the first autonomous factories ever built in North America and super early. Just picture, picture like Waymo or Tesla self-driving like pre-COVID. You know, that's where we were. And so this is very early in the robotics space where it was autonomous. So it's kind of a milestone that we made it work. Right. And so these are the types of things that we're\r\n\r\n\r\nNikolas Hulewsky (07:35.896)\r\nWow.\r\n\r\n\r\nMatthew Chang (07:38.732)\r\nthat we're implementing, this would be a retrofit. And what this system did is it let an existing factory produce about 20 % more product with no new labor. So that was just like easy money for our client, right? And it meant they could take bigger contracts with the retailers.\r\n\r\n\r\nNikolas Hulewsky (07:49.903)\r\nmy gosh.\r\n\r\n\r\nNikolas Hulewsky (07:53.9)\r\nor you'd\r\n\r\n\r\nYou described that as intra company logistics. that what you said or intra manufacturer?\r\n\r\n\r\nMatthew Chang (08:00.802)\r\nYeah. Yeah. So you have, you have logistics, which is like, you know, DHL, FedEx, UPS, people that move stuff around outside the box. Intro logistics is moving stuff around inside. So if we, if we take a peek under the hood at hospitals and you can check out cure robotics.com, that's going to be moving stuff around in a hospital so that nurses aren't the ones moving it around. They do nursing robots do the moving.\r\n\r\n\r\nNikolas Hulewsky (08:13.784)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (08:30.04)\r\nSo you mentioned autonomous driving. There was kind of this split within autonomous driving. And you'll correct me because I'm sure you know the actual technology. Tesla wanted to have video and Google wanted to have LIDAR. Is that correct? OK. And so those were two totally different approaches to solving kind of the same problem with autonomous.\r\n\r\n\r\nAnd at the same time, feels like there's also two approaches to robotics. There is the Tesla humanoid, I think it's Optimus, which that thesis is, hey, let's create robots for a world that was already created for humans. So that's why they're humanoid. And then there's the robotics that looks like, from this video that we just looked at, where it's not humanoid, it's literally just like helping transport things.\r\n\r\n\r\nMatthew Chang (09:09.262)\r\nYep.\r\n\r\n\r\nNikolas Hulewsky (09:28.748)\r\nIs that a fair characterization of robotics or is it more complex than that?\r\n\r\n\r\nMatthew Chang (09:34.33)\r\nI'd say we don't really care.\r\n\r\n\r\nSo if it's a robotic thing that works, we're going to include it in our design and we're going to install it. Right. To date, we've installed zero humanoids because humanoids don't work. Now there's cool videos of them doing like kung fu or like running down a hill. Right. Like that's pretty sweet. But we're trying to manufacture, like assist nurses. So the humanoids don't work yet. And they're not for sale. All these humanoid companies go to their website and see if you can buy one.\r\n\r\n\r\nNikolas Hulewsky (09:39.438)\r\nYou don't care.\r\n\r\n\r\nNikolas Hulewsky (09:45.614)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (09:57.197)\r\nYeah.\r\n\r\n\r\nMatthew Chang (10:08.86)\r\nAnd the answer is no.\r\n\r\n\r\nNikolas Hulewsky (10:10.03)\r\nWhen you say they don't work, is it their error rate is too high or is it like they just don't actually work?\r\n\r\n\r\nMatthew Chang (10:17.964)\r\nIt's dexterity. I was telling a joke this morning that you'll know humanoids are ready for prime time when you see optimist robots building optimist robots. Right. So if optimists is so good, why isn't there a team of optimist robots in the factory building the optimist robots? Right. Will it get there? Sure.\r\n\r\n\r\nNikolas Hulewsky (10:39.374)\r\nthey're not ready.\r\n\r\n\r\nMatthew Chang (10:40.952)\r\nYeah, yeah. I mean, it's just a readiness question, right? And like NASA has this TRL thing, technology readiness level, that a lot of, you know, engineers know about.\r\n\r\n\r\nWhen it's ready, you'll know it's ready because people will be buying them and using them. But you have never seen one in a production facility. You've never seen one in an e-commerce facility. You've never seen one in a nurse in a hospital helping doctors or nurses. Humanoids just aren't ready yet. And I did an X-post on this as to why. Now don't want to get like super technical with like optical versus laser vision and like the localized. But I'll just keep it super high level. Number one.\r\n\r\n\r\nNikolas Hulewsky (10:56.396)\r\nInteresting.\r\n\r\n\r\nMatthew Chang (11:20.378)\r\nThe battery packs on a humanoid is about the size of a shoebox and it just doesn't have that much power in it. We get about 0.1 kilowatts per pound and we're going to need to step function battery chemistry so we have a lot more energy in the same shoebox size shape because it's a humanoid we can't like scale the battery pack right. So that's number one. Number two is human dexterity.\r\n\r\n\r\nSo, you know, my hand can easily manipulate a business card or anything I put in it, and I don't have to think about it. It just does it. And I can do moist, hot, cold.\r\n\r\n\r\ntight, firm, too tight, you know, that's a natural human response. And right now with what we have with robots, they're just like mechanical actuators. There's no sensory feedback. So I don't know if something, if I'm holding it too tight or not tight enough, which is why robotics do really well with like rigid form factors. You know, if it's, if it's hard and it's predictable, they can pick it up. But if it's soft and squishy, or if it's slippery, they're going to really struggle. So that's the dexamethasone.\r\n\r\n\r\nAnd then the final one is a software issue. think this is easiest one to solve. Nobody is selling a teamwork app, what we would call a fleet manager in my business, that is coordinating the many tasks of a bunch of autonomous robots who aren't designed to work by themselves. They're designed to work as a team, as a workforce.\r\n\r\n\r\nSo that's probably the easiest one to solve because you know, groups like Tesla or whoever I'd say if they really focused on it, they could probably get a first product out in about 24 months. But the battery pack issue and the, the dexterity, those are long, long roadmaps, know, like MIT, Carnegie Mellon, Northwestern, they have a team dedicated to the dexterity. It's still in basic research. So it's going to take a long time to get out to industry to where.\r\n\r\n\r\nNikolas Hulewsky (13:09.73)\r\nDexterity.\r\n\r\n\r\nNikolas Hulewsky (13:23.886)\r\ninteresting. Okay.\r\n\r\n\r\nMatthew Chang (13:25.336)\r\nYeah, and then have it be affordable, right? We can't have a million dollar robot.\r\n\r\n\r\nNikolas Hulewsky (13:26.99)\r\nOkay, so humanoid robots not happening anytime soon. Not yet, not yet. So does your company just go in to these larger organizations and almost work as a consultant to say like here is where there could be opportunity and then you source it, maybe you have sourcing relationships, potentially you even fabricate it locally if you need to. Is that the way that it works?\r\n\r\n\r\nMatthew Chang (13:31.962)\r\nDon't worry about it right now. It'll be here later. Yeah. Yeah, yeah.\r\n\r\n\r\nMatthew Chang (13:55.79)\r\nYes. So for us to really understand a company, we have to get in there and do engineering consulting. So we are either closely following or a replacement to Deloitte. So you hire these big, expensive management companies and they do really high in PowerPoint and they tell you all the things that are wrong and what you need to do to fix it.\r\n\r\n\r\nBut that's it. Once they turn in the PowerPoint, they send you the final invoice and they're done. Right now you're as a board or as a management team, you're educated and you're going to go implement on the on the recommendations. Then all of our clients, most of them we find after they've had some big expensive flashy consulting and they've wasted an entire year and they're like, we don't know what to do.\r\n\r\n\r\nIt's unimplementable. So what I like to joke with our customers about is we're not quite at the Deloitte and McKinsey level of PowerPoint, but we're close. We're about 90 % of that PowerPoint level.\r\n\r\n\r\nThen we do the engineering, we do the sourcing, we install it, and then we put a long-term warranty on it. So we're literally standing with our client when the projects go live. And so that's where our customers really value it, because they're like, I didn't want recommendations. I want it done. And so we're the get it done team.\r\n\r\n\r\nNikolas Hulewsky (15:09.346)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (15:16.846)\r\nYeah. How big is the business today? Top line revenue, number of employees. I don't know any numbers.\r\n\r\n\r\nMatthew Chang (15:22.882)\r\nYeah, top line, we're installing anywhere from 20 million to 50 million a year in robotics. And we're in kind of our growth curve right now. So things are stepping up. Team, we're right around 60 people.\r\n\r\n\r\nAnd so that's actually, my guess would be a high revenue for the people count. And the way we're able to do that is with our supplier relationships. So, you know, I've got specialist technical and manufacturing companies in every category. I'll just run through a quick list to give you a sense of kind of from an engineer's point of view, how involved it is. When I design it, I have to do the power design. It's going to connect ultimately to the utility and get the electricity to the robots. That's what they eat, right? They like electricity.\r\n\r\n\r\nNikolas Hulewsky (15:42.551)\r\nWow.\r\n\r\n\r\nMatthew Chang (16:12.012)\r\nI have to do the IoT and network design, right? Chances are your old Wi-Fi system isn't going to cut it. So we have to go to an overhaul of the communication systems inside of your facilities. I have to do the permitting, which means I have to have an industrial architect involved because we've got life safety and hazard classifications and all kinds of things that the permitting officials care about. I got to go to the insurance company and convince them to underwrite it so they want to\r\n\r\n\r\nNikolas Hulewsky (16:13.262)\r\nYou\r\n\r\n\r\nMatthew Chang (16:41.862)\r\ndesign package from me so that they can increase the insurance on the building to cover this.\r\n\r\n\r\nThe fire protection is like the number one place robotics go wrong. If you ever read about a robotic failure, there's usually a fire involved. And then if you have a fire in a robotic system, you're probably losing the building, right? Which is a catastrophic loss if you're in production or e-commerce. So we have to be really focused on that. Structural, some of our stuff requires that we install steel, you know, to hang it from or to mount it from, or a second level so that we can drive robots on two levels. So we have to go through that.\r\n\r\n\r\nwhich involves general contracting. So as you look through the layer, it's about 15 engineering disciplines from start to finish that we have to touch. And that's why we have partners. And so when we have a focus area on power design or fire protection or structural, we flex out into those partners. And my team is a bunch of generalists. They know how to manage those specialty groups that then do ultimately a signed and sealed engineering drawing on their trade.\r\n\r\n\r\nNikolas Hulewsky (17:22.712)\r\nCheers.\r\n\r\n\r\nNikolas Hulewsky (17:48.77)\r\nSo how long does it take to go from like idea to it working on the factory floor? Cause you have to do all of those things you just said. Is it like a two year process?\r\n\r\n\r\nMatthew Chang (17:54.554)\r\nYeah, if you're super ambitious and a client comes to us, which has happened multiple times, and they just say, like, we want it all, then that's probably a three-year project, right? Because of the regulatory, the cyber risk, the enterprise integration, we have to connect to SAP or Epic or whatever the ERP is.\r\n\r\n\r\nSo that's usually like a three year process from first meeting to we're all standing there together watching robots on the floor. For easier stuff that we've done before, it's like nine months. So, you know, we've done like four industry first use cases in e-commerce. We did the first e-pharmacy, robotic, you know, e-commerce pharmacy. I mean, we can stand that up super fast. Hospital, I can be...\r\n\r\n\r\nNikolas Hulewsky (18:27.437)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (18:49.558)\r\nAnd those were probably easier because you just, you had like plug and play solutions, I'm assuming, where it's like, hey, we know what this robot can do. Okay.\r\n\r\n\r\nMatthew Chang (18:54.638)\r\nYeah, we got the whole playbook. Yeah, we've already solved all the hard problems, and now we're just making little adjustments. Hospitals, I can have robots running in a hospital six months from first phone call. But the first project took us two years, right? Because we had to go through like...\r\n\r\n\r\nNikolas Hulewsky (19:10.584)\r\nSo what are they doing in that hospital?\r\n\r\n\r\nMatthew Chang (19:13.85)\r\nIn the hospital, we're doing automatic transport of all the things a nurse needs to provide care. So as you know, you know, nursing, all nurses are connected workers now. They all have a tablet or a phone or a scanner with them. So when they go in the room and they see the patient, they're going to place an order in their ERP. Right. It could be for, you know, OR transport or for a room turnover for surgery prep, whatever their order is.\r\n\r\n\r\nNikolas Hulewsky (19:22.19)\r\nSo.\r\n\r\n\r\nMatthew Chang (19:44.146)\r\nSome of those orders are linked live to my robotic system on the back end. So the nurse doesn't see the interface. They just see that they do the same workflow, but some buttons trigger robots to start moving, just like the Amazon website. So you go to Amazon, you click a button to buy the pair of shoes. You can almost picture the robots start moving around, getting those shoes out to ship to you. We're doing that, but in the hospital, we're signing up for 90 second prime. So from nurse touch to robot at the door with the things\r\n\r\n\r\nNikolas Hulewsky (20:11.287)\r\nWhat?\r\n\r\n\r\nMatthew Chang (20:13.98)\r\nShe ordered 90 seconds. So it's a super intense. Yeah, I mean, that means like decision making has to happen on a millisecond basis for us to get the wheels turning so that we're bringing items. And it means also we have to know exactly. Go ahead.\r\n\r\n\r\nNikolas Hulewsky (20:18.253)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (20:28.931)\r\nThe nurse.\r\n\r\n\r\nSorry, no, go ahead.\r\n\r\n\r\nMatthew Chang (20:33.306)\r\nYeah, we have to know exactly what the inventory is, right? Because as you know, in e-commerce, the number one sin is out of stock, right? So there's no better way to make a nurse your enemy than to bring a robot to her with supposedly she ordered a surgery prep. The robot shows up empty, right? Not going to fly. Yeah, that puts pressure on us. We have to be predictive with inventory, but that's why hospitals are actually easy. They carry what? Maybe 2000 SKUs on a hospital floor.\r\n\r\n\r\nNikolas Hulewsky (20:50.454)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (20:56.846)\r\nMm.\r\n\r\n\r\nMatthew Chang (21:03.102)\r\nsomething like that and then they probably have access to another 10,000 in their warehouse. Yeah, I mean we've done e-commerce facilities that have a million SKUs, you know, so we've gotten really good inventory prediction.\r\n\r\n\r\nNikolas Hulewsky (21:04.814)\r\nIs that not a lot?\r\n\r\n\r\nNikolas Hulewsky (21:12.536)\r\nJeez.\r\n\r\n\r\nThat's a million SKUs? That's insane. my gosh.\r\n\r\n\r\nMatthew Chang (21:19.928)\r\nYeah. Yeah. Yeah. Consignment, consignment e-commerce. Well, Amazon, FBO Amazon, that's about 300,000, right? In a big Amazon facility. But a consignment warehouse like Wayfair is like a million SKUs in Wayfair's box, right? You have to keep up with it.\r\n\r\n\r\nNikolas Hulewsky (21:34.198)\r\nI, I, no, I didn't know that.\r\n\r\n\r\nNikolas Hulewsky (21:45.103)\r\nYou know, those, I'm not gonna call them three PLs, but whatever, the fulfillment centers, whether it's Amazon or Wayfair or these FBO stores, I get those because there's not a lot of people there, but in a hospital setting, there's people walking the floor all over the place, patients, family members, clinicians, right? So where are these robots sitting? Are they just like plugged into a unit waiting to be called on? Are they continually monitoring the floors?\r\n\r\n\r\nMatthew Chang (22:00.122)\r\nyeah.\r\n\r\n\r\nMatthew Chang (22:08.482)\r\nYeah, in every...\r\n\r\n\r\nEvery hospital wing that we've seen so far since we got into the medical business three or four years ago, there's parking spaces on the floor. Now they're typically like a little alcove and they might stick some extra wheelchairs there or they might have a couple dialysis machines that they stick over there and they never think about. So we have to reclaim a few of those parking spots. We need between two and three parking spots per floor and then we'll put a charger there and we'll actually color the\r\n\r\n\r\nfloor that says parking spot so please don't put a hospital bed there. And then the robot. Let's see if you go to cure if you go to cure robotics dot com we'll take a peek at it and I'll walk you through how it works. But they're generally limited by the door width. OK. So you know we have a day and things like that. So all doors are standard. See you are a.\r\n\r\n\r\nNikolas Hulewsky (22:43.789)\r\nYeah, yeah,\r\n\r\n\r\nHow big are those machines?\r\n\r\n\r\nNikolas Hulewsky (22:55.501)\r\nYou're\r\n\r\n\r\nNikolas Hulewsky (23:05.966)\r\nHow do I spell cure cure?\r\n\r\n\r\nMatthew Chang (23:10.752)\r\ncurabotics.com\r\n\r\n\r\nAnd so what we leave is about two inches on either side of the door when we pass through it. And that's for a safety reason. Like we don't want to pick what's called pinched injury if your hand was to be in there. So this robot is, it gives you about two inches on each side of the doorway.\r\n\r\n\r\nto clear to go through. And so it's a big inventory. This is a big robot and it will come up to your, I don't know how tall you are, but I'm six four and it comes up to like my mid chest. And the reason it's so big.\r\n\r\n\r\nNikolas Hulewsky (23:45.368)\r\nDang, no, I'm like 6'2\".\r\n\r\n\r\nMatthew Chang (23:48.802)\r\nYeah, so there you go. So it's up at your sternum level. And the reason it's so big is because we want to minimize the time it has to go to the elevator and go down the elevator and go to the supply room and get restocked. Right. So we want to minimize.\r\n\r\n\r\nNikolas Hulewsky (24:02.35)\r\nthat's a good point.\r\n\r\n\r\nYeah. How does it get in the supply room? How does it get on the elevator?\r\n\r\n\r\nMatthew Chang (24:09.016)\r\nYeah. There's another one that you got right there, that KiwiBot. Nick, thank you. Why were the first company to do that? So, yeah. So we have an integration with Otis and we install a hardware box outside of the Otis Elevator Controller.\r\n\r\n\r\nNikolas Hulewsky (24:20.738)\r\nReally?\r\n\r\n\r\nMatthew Chang (24:33.408)\r\nand the elevator controller does not have an input port. Why? Because they don't want you controlling the elevator. It's supposed to be secure. If you can control it by plugging into it, it's like a Die Hard movie waiting to happen, right? Like somebody hijacks the building.\r\n\r\n\r\nNikolas Hulewsky (24:44.95)\r\nOkay.\r\n\r\n\r\nMatthew Chang (24:46.874)\r\nSo those things are designed not to be plugged into and we worked with them to get the first plug-in. So we had to drill a hole in the side of the box and go in and reduce some of the wiring. So that is an example of how we do it. The robot just thinks about it. You know, the communication is wireless. We have a server on site that coordinates these things and it can think about the elevator and command it. It can think about the fire alarm.\r\n\r\n\r\nNikolas Hulewsky (24:58.776)\r\nNo way.\r\n\r\n\r\nMatthew Chang (25:16.858)\r\nand respond to it, can think about the security and the door control and open the door. So that robot right there that you saw has a security badge issued by security and it is a nursing security badge. And then when it thinks about opening the door, the door's just open.\r\n\r\n\r\nNikolas Hulewsky (25:21.56)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (25:31.086)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (25:34.452)\r\nSo how does it get into the supply room? Is it the same thing?\r\n\r\n\r\nMatthew Chang (25:37.752)\r\nYeah, just drives over there and you know, you have two choices. You can either manually replenish it because the replenishment is only happening a few times a day. So you can manually do it if you have a resource there or we can also have it be robotic to where a system loads the inventory and automatically.\r\n\r\n\r\nNikolas Hulewsky (25:56.289)\r\nWow. So it could go pick and pull its own stuff, theoretically.\r\n\r\n\r\nDid you need to make more videos of this? This is like perfect YouTube, Instagram videos. I'd look at this all day.\r\n\r\n\r\nMatthew Chang (26:05.658)\r\nI'm an engineer. I'm so trash at marketing, I watch guys like you and others on X and you guys are brilliant marketers. And I'm like, gosh, I wish I had that bone in my body. So I'm mid-career here, Nick. I'm trying to learn marketing.\r\n\r\n\r\nNikolas Hulewsky (26:22.968)\r\nWell, I have some ideas on marketing because this is a product where it's like, just film what you do and post it. It sells itself. can that does it keep things safe? Because that would be one thing where it's like, well, can anybody just open it up and put something in there?\r\n\r\n\r\nMatthew Chang (26:41.016)\r\nYeah.\r\n\r\n\r\nYeah, so what you saw on that website is a non-secured tool. We have these terrible words in the engineering for everything. So that whole assembly on top is called a tool. That is non-secured items that you wouldn't put under lock and key. We have other inserts. You can take that whole shelf assembly, the white part in the middle. You can take that whole shelf assembly out. You can stick a secured unit in there that might have a\r\n\r\n\r\nkey fob or a badge swipe. And then you, you could have it to where you can deliver meds, for example, which we want under locking. Yeah. So then the nurse would take their badge and swipe on the side of the robot and they'd have access to the drawer that had their medications in it.\r\n\r\n\r\nNikolas Hulewsky (27:18.86)\r\nYeah, that's where I was gonna go. Like, skilled nursing facilities is a place.\r\n\r\n\r\nNikolas Hulewsky (27:30.592)\r\nSo tell me about the key we bought.\r\n\r\n\r\nMatthew Chang (27:33.4)\r\nKiwiBot is super fun.\r\n\r\n\r\nThe robot on the left, that's our pride and joy. We invented that and it's, but it's not like, it doesn't have a personality. KiwiBot is a point to point degree. And we partnered with that company, KiwiBot, and they, that robot is cute. It winks at you. It makes fun sounds. It's like very, like kids love it. Seeing a bunch of kids interact with it. I think it's the coolest. And so KiwiBot is a point to point. So it's like, Hey, I'm at the pharmacy or I'm at the supply room and I have a hot delivery.\r\n\r\n\r\nNikolas Hulewsky (27:44.078)\r\nOkay.\r\n\r\n\r\nMatthew Chang (28:05.916)\r\nRight and I've got to make this delivery because a nurse said she needs it in 10 minutes and it's gonna go traverse it can go exterior So it can go traverse the campus go inside. You know get on the elevator and make a single delivery So it's like a last mile thing oh look at that Yeah, yeah\r\n\r\n\r\nNikolas Hulewsky (28:21.472)\r\nOkay, I\r\n\r\n\r\nNikolas Hulewsky (28:25.506)\r\nHere's, see KiwiBot's got the shorts going on. Look at this little guy, winking at you, driving all over the place. So, do.\r\n\r\n\r\nMatthew Chang (28:35.972)\r\nYeah, if you ordered like a emergency meal, for example, for a patient and that thing shows up, you're going to be super pumped. You're like, here he is. He just brought me my meal.\r\n\r\n\r\nNikolas Hulewsky (28:43.308)\r\nNot only are you bringing food to the patient, you're brightening the patient's day. Can they transport patients?\r\n\r\n\r\nMatthew Chang (28:47.411)\r\nThat's it. That's it.\r\n\r\n\r\nThough none of those can, little fun fact for you, we just submitted a patent on the autonomous hospital bed, which would be the first interactive robotics that we would have installed. And so the point of that is, it's going back to workforce. The hospital beds can be 500 pounds.\r\n\r\n\r\nRight? You have a couple hundred pounds for the bed and you have a couple hundred pounds for the patient and your average nurse is five foot four. So you and I have the benefit of being large males. If we had to push the beds, we'd be fine. But for a smaller workforce, it's like really tough. And one of the top workers comp claims from nurses is they're pushing a bed and it ran into a railing or they try to stop it and they pulled their back. So we want to put autonomous drive on the beds to where it's like power assist and the nurse just walks with it.\r\n\r\n\r\nNikolas Hulewsky (29:16.621)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (29:25.346)\r\nThat's insane.\r\n\r\n\r\nNikolas Hulewsky (29:44.27)\r\nMmm.\r\n\r\n\r\nMatthew Chang (29:46.514)\r\nSo it's designed to be escorted, not like we're rolling patients around with no supervision. But that way the nurse is only touching it if they need to disengage and navigate a door entry or an elevator entry. So I don't think we're going to get on the elevators automatically because we want to know that the nurse is with the patient. So they'll have to be physically in control to go in.\r\n\r\n\r\nNikolas Hulewsky (30:10.926)\r\nWell, to your point, not just the transport, also the transfer of the patient to the hospital bed is, mean, that's, man, those are workers comp claims waiting to happen. You can't control whether a patient's a 90 pound woman or a 500 pound person.\r\n\r\n\r\nMatthew Chang (30:29.262)\r\nYeah, my mom, a 40 year nurse in a trauma one, their rule was they could get an orderly to help with the patient transfer at 300 pounds.\r\n\r\n\r\nSo can you imagine how many 295 pound patients she had to move? Right? And then the system would be like, 295, like you and me couldn't move a 295 pound man. And then, you know, my mom has to do it. That's crazy. Right? So they, the nurses deserve this type of stuff. That's our viewpoint. They just do. If the, if the hospital administrators love their nurses, they'll give them this stuff. And then if the nurses want to feel loved, they're going to ask their administrators, need these robotics.\r\n\r\n\r\nNikolas Hulewsky (30:43.66)\r\ngosh.\r\n\r\n\r\nNikolas Hulewsky (30:50.174)\r\nmy goodness.\r\n\r\n\r\nNikolas Hulewsky (30:55.5)\r\nNo, no. That is insane, dude.\r\n\r\n\r\nMatthew Chang (31:13.5)\r\nbecause it's gonna make my life easier.\r\n\r\n\r\nNikolas Hulewsky (31:16.152)\r\nHow much does one of these machines cost?\r\n\r\n\r\nMatthew Chang (31:19.29)\r\nInstall, know, sign seal delivered about 200kps.\r\n\r\n\r\nNikolas Hulewsky (31:24.11)\r\n$200,000 and that is that with you helping the whole process to get it like set up or is it just click you do everything? Okay\r\n\r\n\r\nMatthew Chang (31:29.242)\r\nI do everything. Yeah. Yeah. We bring it to site, we install it, and then we do the training. But that might sound expensive. On average, 14 nurses share one robot. So the fractional cost per nurse is super low. And then that robotic system saves all nurses about 15 % of their day. So they get time back.\r\n\r\n\r\nNikolas Hulewsky (31:56.589)\r\nReally?\r\n\r\n\r\nMatthew Chang (31:57.858)\r\nmore present with patients. So on an ROI basis, it's smoking hot. It's like 18 to 20 months ROI. Yeah, for itself, So simple math. If you have a hospital that has a 10 % nursing shortage, which is pretty common, and they're wearing out their existing nurses by asking for overtime or extra shifts, right, or pulling doubles,\r\n\r\n\r\nNikolas Hulewsky (32:06.093)\r\nReally?\r\n\r\n\r\nWhat's the useful life of one of these machines?\r\n\r\n\r\nMatthew Chang (32:23.418)\r\nAnd you can eliminate the nursing shortage by giving your existing nurses 15 % of their day back. That improves outcomes, patient satisfaction, nurses are less physically strained, and you did all that for a few million bucks per hospital. That's like a sweetheart deal.\r\n\r\n\r\nNikolas Hulewsky (32:43.458)\r\nYeah, it wasn't robotics, but I was doing it with transcription. And then we started doing it with AI. Because clinicians hate documenting. And understandably so, right? It was like the worst part of their day. It's like, I just did all that. Now I have to go right about it. But with these pendants that they can wear or with dictation services, they can just have it almost totally done for them. That saved about 20 % of their time. So all of a sudden, these nurses are 20 % more productive. And with the same nursing staff, can\r\n\r\n\r\nMatthew Chang (32:50.991)\r\nRight.\r\n\r\n\r\nMatthew Chang (33:00.355)\r\nYeah.\r\n\r\n\r\nMatthew Chang (33:09.775)\r\nme.\r\n\r\n\r\nNikolas Hulewsky (33:12.878)\r\nYou can do 20 % more work. Yours is just on the robotics side.\r\n\r\n\r\nMatthew Chang (33:14.35)\r\nSo I have a use case for you then, Nick. I need your help with this. My wife is an ER physician assistant. All right, so she is the front line. Yeah, you go in the hospital, she's the first one you see that's gonna provide care. She, on a day where she's doing the fast track, which is like the, you know, all the coughs and the sneezes and the, you know, the simple stuff that comes into an ER.\r\n\r\n\r\nNikolas Hulewsky (33:21.677)\r\nreally? Okay.\r\n\r\n\r\nMatthew Chang (33:40.0)\r\nShe spends 50 % of her day doing notes, 50%. So she sees a patient, she's to write a note. Sees a patient, write a note. And you know what it is, like orders out to the lab, to the imaging center, and then it all comes back, the results, and she's got to tidy up the patient note.\r\n\r\n\r\nLike that's insane. Her favorite days is when she only sees a few patients and she does complex operations. So for example, she put a guy's ear back on the other day. His ear was in his hand. He came in and she put it back on and it took her like four hours. That's right. That's right.\r\n\r\n\r\nNikolas Hulewsky (34:00.59)\r\nIt's insane.\r\n\r\n\r\nNikolas Hulewsky (34:13.058)\r\nVincent van Gogh? Geez, four hours?\r\n\r\n\r\nMatthew Chang (34:17.55)\r\ngirlfriend appreciated it. and there was like, there was like blood vessels and nerves and stuff she had to reattach, right? It was a super intricate, was basically a plastic surgery and she did it in the ER. She liked that because she was with a patient doing something hands-on, very technical, and then she wrote one note. But she could have seen like 30 flus in the same time and had to write a note on each one. So, yeah, huge. Yep.\r\n\r\n\r\nNikolas Hulewsky (34:19.573)\r\nHahaha!\r\n\r\n\r\nNikolas Hulewsky (34:41.006)\r\nDoes she work for a large hospital system?\r\n\r\n\r\nThat's always the hardest part with this AI stuff is that you have to get the approval from that large hospital system in order to start using things. So I don't know if they use anything yet, but there are lots of products out there. There's like the pendant AI pendant, limitless. That's who it is. Limitless pendant. There's the plot pendant. And then they actually do have physician software now that's AI enabled that basically takes all of the stuff that's been recorded and puts it in a soap.\r\n\r\n\r\nMatthew Chang (34:47.267)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (35:15.95)\r\nlike a pre-populated soap, which is like a type of note. I don't remember what the acronym stands for, but it's like how physicians write their notes. that I've seen physicians use and it saves them a ton of time. The uphill battle for her is she's gonna have to fight with the hospital system to give permission to use it because everybody rightfully so is so scared of HIPAA. But there's tons of stuff out there she could use.\r\n\r\n\r\nMatthew Chang (35:39.118)\r\nYeah, we spent more time going through HIPAA compliance with that nursing system than we spent installing the system. Yeah, so HIPAA is a, that's a real regulation, right, deal with. Yeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (35:51.001)\r\nHip is the real deal. It's a real regulation. Yeah, you tackled robotics and healthcare.\r\n\r\n\r\nMatthew Chang (35:56.974)\r\nAnd I'm not mad about it either, I deal with all regulations, environmental, energy models. I go through all regulations. when we add on a HIPAA, when I did the DOT projects and I installed the first autonomous vehicles for the DOT, we had all these additional layers of highway safety and ADA compliance and people with disabilities. I'm not mad.\r\n\r\n\r\nWe just put that in the design, right? You build in the requirement, you understand what it means, and you translate that to the technology.\r\n\r\n\r\nNikolas Hulewsky (36:34.574)\r\nYou know what's interesting is kind of going back the the robots that you that you placed at the hospital. How big is that fleet?\r\n\r\n\r\nMatthew Chang (36:45.478)\r\n28 to do a very large hospital. Yeah. Very big hospital. We're doing all floors. Every nurse, every nurse has access to the system and it's like 28. So it's, actually a very small. Yeah. It's very small system for the number of people that have to touch it. Right. Like when we do a factory, I've done factories where we install like three robots per person.\r\n\r\n\r\nNikolas Hulewsky (36:47.342)\r\nOkay, geez, 28.\r\n\r\n\r\nNikolas Hulewsky (36:58.286)\r\nIt's a good project. It's a good project for Chang Robotics.\r\n\r\n\r\nMatthew Chang (37:13.37)\r\nSo for each worker in the factory, there's now three new robots added to the work environment. And that's where we're really augmenting the workforce. In healthcare, it's way more efficient. It's like, I don't know how many nurses work in a hospital that size, but it's a few hundred. And they're sharing 28 robots, right? So it's very efficient.\r\n\r\n\r\nNikolas Hulewsky (37:17.865)\r\nJeez.\r\n\r\n\r\nNikolas Hulewsky (37:35.746)\r\nWell, what's interesting, what I was gonna get to is that, I think you said it was 14 nurses per robot.\r\n\r\n\r\nMatthew Chang (37:43.321)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (37:44.399)\r\nSo 14 nurses per robot and you said that the robots make them 15 % more efficient. kind of rough numbers, what that comes out to is for every 14 nurses that are using a robot, they're actually doing the work of a little more than 16 nurses. I was just doing the math on my phone. So you've got effectively two additional nurses in there and depending on kind of where they are, nurses are expensive.\r\n\r\n\r\nMatthew Chang (37:53.592)\r\nYes.\r\n\r\n\r\nMatthew Chang (38:09.391)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (38:12.718)\r\nlet's just say it was $100,000 a year per nurse, it's kind of like year one, you make your money back because you've effectively just hired two hundred thousand dollar nurses. And that's like the all in costs. I'm not just talking about their wages. That's benefits, that's insurance, that's workers comp, all that stuff. So, I mean, I'd be surprised if the ROI was, I think you said 18 months.\r\n\r\n\r\nMatthew Chang (38:13.166)\r\nYes.\r\n\r\n\r\nMatthew Chang (38:33.784)\r\nYeah, well, that was for our first hospital. And that was with maybe some learnings. But yeah, I think we're ready to scale. It's like we figured out all the hard stuff, which is controlling the whole building within cybersecurity compliance and HIPAA compliance. Yeah, so as we start to roll this out and we're obviously talking to a couple of major hospital chains right now.\r\n\r\n\r\nNikolas Hulewsky (38:34.988)\r\nYeah, that was your first one.\r\n\r\n\r\nMatthew Chang (39:00.504)\r\nI think it's just going to the cost curve is going to go way down. I agree you could get to a 12 month payback on that.\r\n\r\n\r\nNikolas Hulewsky (39:06.862)\r\nOkay, how did you get into this? Like, it goes against everything that I preach about entrepreneurship. But like, let me tee it up for you. So everything I preach about entrepreneurship is like something that's low cap X, something that's high cash flow and high cash conversion. So you're getting paid, you know, really quickly, something that has large tailwinds, which this does have large tailwinds. But like from my perspective, robotics is not something that's widely adopted.\r\n\r\n\r\nMatthew Chang (39:10.616)\r\nDude, totally by accident. Totally by accident.\r\n\r\n\r\nNikolas Hulewsky (39:34.338)\r\nSo it's, you're kind of creating new markets that you're operating in. It's high capex. You got to have these relationships that are international relationships in order to source the machines. And then you've got to have the specialty of being an engineer in order to work through all the permitting process, but then also the customization. Like it sounds like a freaking nightmare. Not one I would want to get into. How the freak did you get into this?\r\n\r\n\r\nMatthew Chang (39:41.614)\r\nYes.\r\n\r\n\r\nMatthew Chang (39:54.776)\r\nWell, I am that engineer. So, you know, I can't change that, right? You know, so my background...\r\n\r\n\r\nNikolas Hulewsky (39:57.706)\r\nHahaha\r\n\r\n\r\nMatthew Chang (40:05.39)\r\nYou know, was originally supposed to be a naval officer and do engineering for the Navy. And I got kicked out before I got commissioned when they shrank the Navy. And this was right as the global war on terror was kicking off. So the Pentagon hadn't caught up that, hey, we need more officers. They were still operating under the sequester where they were shrinking the military. They just shrank my Navy scholarship class. And I was one of the ones that got cut out.\r\n\r\n\r\nSo then I said, all right, lead into it, go the professional engineering route. And I joined a company where I could, what ended up happening was I traveled the world and built super high-end manufacturing plants all over the world. And for American companies that were obviously globalizing. And so I built them in the U S I built them in the middle East and all across Asia, Southeast Asia. And, and so.\r\n\r\n\r\nNikolas Hulewsky (40:58.284)\r\nWhen you say high-end manufacturing, are you talking about like cars, technology? You're not talking about like furniture or clothing. I have no idea. I'm just trying to understand what that means, high-end.\r\n\r\n\r\nMatthew Chang (41:09.23)\r\nYeah, advanced manufacturing, all it means is that you have a really well planned out manufacturing process that's high throughput. so like lean Six Sigma, Toyota way, like all that type of stuff like that. And then you have to have a high degree of automation for it be advanced manufacturing. So an example, I built the Airbus A350 factory. So if you flown on the new Delta flagship, yep, that plane is made of carbon fiber. And so the.\r\n\r\n\r\nNikolas Hulewsky (41:35.907)\r\nYeah.\r\n\r\n\r\nMatthew Chang (41:39.116)\r\nThe reason it had to have a new factory in North Carolina instead of using an existing factory in Wichita, Kansas where it should have been built was because the entire thing is made out of carbon fiber. They didn't have a carbon fiber production facility in Wichita, they located that one in North Carolina. I built the first driverless paper factory in the country for Georgia Pacific and the joke there is...\r\n\r\n\r\nNikolas Hulewsky (42:06.702)\r\nDriverless paper? the...\r\n\r\n\r\nMatthew Chang (42:09.006)\r\nYeah, yeah. So paper factory, which makes like tissue paper bounty quilted Northern, like all that type of stuff, that only has driverless robotics inside and no humans. So, so we'll call it lights out facility. You can turn the lights out and it'll keep working because the robots don't need lights. So,\r\n\r\n\r\nYeah, yeah. It was a, to dimension that one, I built twin plants, one in Louisiana, one in Arkansas, 450,000 square feet packed with machinery, packed with driverless forklifts that have laser vision, Waymo vision, and 17 guys in a control room just watching it. The typical employment for a plant should be like 500 people.\r\n\r\n\r\nNikolas Hulewsky (42:54.328)\r\nNo way.\r\n\r\n\r\nMatthew Chang (42:57.72)\r\nRight. But this was totally robotic lights out. So the joke is joke is if you had toilet paper during Covid, I know it wasn't easy to find, but you're welcome because we had a humanless paper factory that was producing paper paper towels. Yes. I mean, wild stuff. I got I worked with McCormick when the new food safety regulation came out and they had the first time to determine traceability. Dude, McCormick buys spices from one hundred and forty source countries.\r\n\r\n\r\nNikolas Hulewsky (43:00.247)\r\nWhat?\r\n\r\n\r\nNikolas Hulewsky (43:13.388)\r\nThat's incredible.\r\n\r\n\r\nMatthew Chang (43:27.644)\r\nAnd those hit intermediaries and brokers and wholesalers. They don't know exactly what farm the peppercorn came from, right? And so they were trying to provide traceability back to the point of origin. And so we had to install IoT systems for them so they could begin keeping up with it. Like corn from Iowa, which farm did it come from? I don't know. Hit the silo, right? We don't know where it came from. It all mixed together. So...\r\n\r\n\r\nNikolas Hulewsky (43:29.016)\r\nJeez.\r\n\r\n\r\nNikolas Hulewsky (43:51.161)\r\nWhat?\r\n\r\n\r\nMatthew Chang (43:55.096)\r\nSo yeah, advanced manufacturing can be any industry. It's just, you have to have a high degree of technology in the plant already.\r\n\r\n\r\nNikolas Hulewsky (43:55.478)\r\nSo when did you launch?\r\n\r\n\r\nNikolas Hulewsky (44:02.67)\r\nSo at what point was there the aha moment of like, I think this could be a business, right? Like I'm doing it for these large companies. I think I could actually kind of do this for other companies as well.\r\n\r\n\r\nMatthew Chang (44:11.098)\r\nYeah, well mine was I did intrapreneurship before entrepreneurship. So I got, I had these two job offers when I stopped doing the international travel, had Delta million miler. I was like, you on the plane for like three weeks out of the month at least. Um, and then I met my wife and I was like, I gotta be here, you know, like I can't be out there. gotta be here.\r\n\r\n\r\nAnd so I had two interesting job offers. One was Amazon asked me to build, to be in charge of their CapEx. And that was super cool. That was 2014 Amazon. So Nick, if I took that stock option, I wouldn't be on phone with you right now. Yeah.\r\n\r\n\r\nNikolas Hulewsky (44:51.202)\r\nNo, he'd be on a beach somewhere.\r\n\r\n\r\nMatthew Chang (44:55.034)\r\nYeah, or I would just probably be the still in the corporate machine, know, crushing everyone as they did such a good job. So, so that was then I had another construction company that said, Hey, we want to do design build. So I took that job because I thought it would be so cool to build an engineering team within a huge international construction team.\r\n\r\n\r\nNikolas Hulewsky (45:00.59)\r\nThat's true. Yeah.\r\n\r\n\r\nMatthew Chang (45:18.022)\r\nthat went really well until we got fired. My whole team, they closed our office on one day. So we were killing it. Have you had an RX bar? You ever had the, the, okay. I built the art. was our signature project that we got through. built the RX bar plan with for the egg protein that goes into the RX bar. And then.\r\n\r\n\r\nNikolas Hulewsky (45:34.862)\r\nno way. Yeah, yeah.\r\n\r\n\r\nMatthew Chang (45:39.156)\r\nHR lady shows up, pass out a bunch of folders. I'm like, HR lady should not be in the Jacksonville office. Like we got flip flops, Hawaiian shirts, like she killed the vibe. And then she gave us folders and that was the end. Like leave immediately. She took the keys and we were out. So I was homeless. I was out on the street. And so I started my company the next day and thought.\r\n\r\n\r\nNikolas Hulewsky (45:56.331)\r\nNo. Why?\r\n\r\n\r\nMatthew Chang (46:03.642)\r\nYou know, if I was ever going to try it, just, I've built international offices all over the world. built a company with inside a company in 18 months, got it to profitability. And then, I guess if I'm going to try it, I'm going to try it now. And just one of my former clients called me, Matt, what are you doing? Like I'm sitting on the couch in my pajamas on my laptop. Why are doing that? I'm like, because you don't have a job. And she goes, why didn't you appear next week?\r\n\r\n\r\nSo she goes, before you come, you need to get a company, get a suit, and get a haircut. So I joke, did two of the three, right? And so went up to meet her in Iowa and she just, 2017, 2017.\r\n\r\n\r\nNikolas Hulewsky (46:41.281)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (46:47.362)\r\nWhen was this? Give me an idea what year.\r\n\r\n\r\nMatthew Chang (46:53.688)\r\nTo be specific, it was May of 2017. She pulls the whole team together. It was a manufacturing operation in Iowa. She said, team, this is Matt. He's a manufacturing expert. Matt, this is team. I'll leave you guys to it. I want to know your findings at the end of the week. She just left. Like, what? So I had to go work through, like, let me study the process. Let me study the inventory. The things I would do normally.\r\n\r\n\r\nI just did it by myself. And at the end of the week, she took me to the accounting department and said, this is Matt. He has a company. You do have a company, right? I'm like, yeah, yeah, I set one up. I got an LLC. And she's like, great, get it paid. That was it. I have one client. And in my line of work, if you're technical, you just need one customer. Once you have that one customer, you are in business. And from there, that rolled over and we ended up with within 12 months of opening,\r\n\r\n\r\ntwo of the wildest automation and autonomous projects on earth. That was just God's favor dude. it was we got hired to design the driverless bus system for the DOT. And that was pretty nuts. It's in operation today and you can go ride it.\r\n\r\n\r\nNikolas Hulewsky (48:04.59)\r\nWhere?\r\n\r\n\r\nMatthew Chang (48:07.586)\r\nin Jacksonville. Jacksonville, we had to compete and win to get sponsored by first term President Trump as the first driverless city. So he gave us his fat grant, $25 million grant for Jacksonville. Big point of pride. We smoked all our Florida rivals, Tampa, Miami, Orlando. We smoked Boston, San Francisco, Austin, Texas. The guys that should have won, we beat them. And so Jacksonville today has the only federal driverless bus\r\n\r\n\r\nin the nation. So that was that was an early project. We got hired to build the first autonomous factory for major food producer.\r\n\r\n\r\nNikolas Hulewsky (48:39.309)\r\nNo way.\r\n\r\n\r\nMatthew Chang (48:48.334)\r\nThat is now the largest coffee roastery in North America. So we're like 12 months in, I'm like, my gosh, what happened? And at the end of, as those projects started to life cycle out, like we finished them basically, it was like, I think we're the best autonomous engineering company on earth.\r\n\r\n\r\nbecause we're so early and we're the only guys that have done it at scale in multiple use cases. So that's why when we get into healthcare, it's not that hard. E-commerce, not that hard. Our hardest project yet is coming around the corner, which is we're gonna be designing the first autonomous port in the nation. It's gonna be in Texas. Yep, yeah, an actual port.\r\n\r\n\r\nNikolas Hulewsky (49:31.831)\r\nHoly crap.\r\n\r\n\r\nMatthew Chang (49:33.298)\r\nAnd, and so that's going to be wild, dude. And the secret to the ports, you go back, how long ago were the longshoremen on strike? it this time last year? think. Yeah, it was like tailing to Biden, right? As Trump was coming in, the longshoremen were going on strike and they were, you know, demanding, you know, some higher wages.\r\n\r\n\r\nNikolas Hulewsky (49:43.768)\r\nSomewhere in the, know sometime in the last year. Yeah.\r\n\r\n\r\nMatthew Chang (49:54.938)\r\nWell, you don't think we're going to build an autonomous port if the longshoremen don't like it, do you? Like, clearly our job is to work with them and convince them that this is good for the union, it's good for the longshoremen, and it makes their job easier and it makes their pay go even higher. So we're going to figure that out. I've done it with the bus drivers union, mechanics union, nurses, you know, and it starts, that's why I said it always starts with the workforce. You have to figure out what does the workforce want. Then you go to the technology.\r\n\r\n\r\nstart with tech first no one's gonna use it right they're gonna hate it\r\n\r\n\r\nNikolas Hulewsky (50:28.29)\r\nWhy, so why did you win the contract in Jacksonville? Like why would they need your skill set for driverless transportation? Because it sounds like other cities were competing or trying to figure it out as well. What exactly in your skill set was the differentiator?\r\n\r\n\r\nMatthew Chang (50:45.346)\r\nJust high creativity and adaptability. I remember I was the Jacksonville. Yeah, Tampa had a partnership with Tesla and they looked like the favorites. Las Vegas had a partnership with.\r\n\r\n\r\nNikolas Hulewsky (50:51.672)\r\nSo each one of those cities were independently trying to figure it out.\r\n\r\n\r\nMatthew Chang (51:06.134)\r\nSome famous company was propped up by the Zappos founder, guy that sold that to Amazon. And, and so they looked like they were going to be the favorites. know, Waymo was making a lot of noise at the time and, in Phoenix and then, San Francisco. So we had some worthy adversaries. Uber was I think in Pittsburgh, right? So as we looked, we felt like David versus Goliath. We're like, we're not, we're not going to win.\r\n\r\n\r\nNikolas Hulewsky (51:10.318)\r\nI don't.\r\n\r\n\r\nNikolas Hulewsky (51:29.507)\r\nYeah.\r\n\r\n\r\nMatthew Chang (51:33.846)\r\nunless we get so far outside the box. And so that's why I'm going to give your audience my free biz dev strategy. Lose first or win. Right. So what I don't like is commoditized competition where five companies are competing on equal basis and then it becomes a race to the bottom in terms of price or offering. What I like to do is throw out an offer that's so different.\r\n\r\n\r\nthat if you're looking for commodity, you just throw it out right away. So lose first. I want a rejection letter 10 minutes after I submit my offer, because you're like, nope, we wanted apples and you brought me oranges, right? Or they look at it and they're like, huh, these people actually thought of a different way to solve it. we were probably not compliant with the DOT's request when they did this. It was the most competitive grant in DOT history. had 703 applicants.\r\n\r\n\r\nNikolas Hulewsky (52:14.339)\r\nYeah.\r\n\r\n\r\nMatthew Chang (52:31.164)\r\nand cities were competing with cities inside of states and the states were competing so I don't I can't imagine what sort of money was spent to win the purse it was probably more than the purse was spent across the nation and so I said look for us to do this we have to not be focused on an OEM like a Tesla or a Waymo what we have to do is we have to convince the DOT that we're going to roll out a strategy that becomes their template\r\n\r\n\r\nfor the nation, right? We're gonna build the playbook for them. So we made the short list because as you know, Florida's got some political advantages. So we the short list, we got invited to interview, and it was a beautiful proposal by the way. Gotta still keep up, let see if I got it here.\r\n\r\n\r\nMatthew Chang (53:26.648)\r\nSo very beautiful proposal. Yeah, right? Not what you would typically see in a grant, right? So we took the non-traditional approach. Grants look like research papers. They're typically very ugly and sterile. So we went high marketing, like visual appeal. And then when we got the audience,\r\n\r\n\r\nNikolas Hulewsky (53:29.12)\r\nhello. Bound? Okay.\r\n\r\n\r\nMatthew Chang (53:51.258)\r\nI did something that no one else did. went on, you're not going to believe this, I went on the whitehouse.gov website and I read every white paper that Trump had published for policy. They're nice and short. The Trump White House white paper. Yeah. Thank you for your attention.\r\n\r\n\r\nNikolas Hulewsky (54:06.072)\r\nAll caps, nice and short, broad language. Thank you for your attention to this matter.\r\n\r\n\r\nMatthew Chang (54:14.18)\r\nBut they're amazingly plain spoken. not overly verbose. They're like three to four pages each, nice and concise, and very well communicated. And I just don't think anybody took it seriously at the time. And I said, I'm going to bet the whole thing that every bureaucrat in DC is paranoid that they don't know how to make the boss happy. And if you remember, Trump won was kind of erratic, right? Like there was all this like tweeting and he hadn't really solved the wire.\r\n\r\n\r\nNikolas Hulewsky (54:38.351)\r\nYeah, not anymore.\r\n\r\n\r\nMatthew Chang (54:44.124)\r\nDC apparatus you know I think he thought he could boss him around and they'd do what he said it didn't go that way so I just said the whole thing was about basically how do you make the boss happy this plan is gonna make the boss happy and I think that's what they went with they thought it was outside the box it actually had a shot at making Trump happy I think secretary Duffy was just here in Jacksonville writing our system so clearly it did you know it's resonating\r\n\r\n\r\nNikolas Hulewsky (55:10.85)\r\nWhat?\r\n\r\n\r\nMatthew Chang (55:12.154)\r\nYeah, yeah. mean, can't believe it. The point is it worked. We beat Uber to the autonomous game, dude, as a bunch of ragtag city people in Jacksonville. And that's been the theme of like our company and my career is we just beat everybody. You know, we have an electric vehicle project. We just built an EV six times more powerful than the Tesla semi.\r\n\r\n\r\nNikolas Hulewsky (55:13.548)\r\nWhat could do?\r\n\r\n\r\nMatthew Chang (55:36.494)\r\nfrom first drawing to close the production on the first vehicle was three years. Elon has been playing around with that Tesla Semi for a decade and it's still not out there in the wild. It's in these kind of forever pilots and it's not commercialized yet.\r\n\r\n\r\nSo, and it's not that his is more complicated than ours. Ours is designed for the FAA. So it's designed to the FAA requirements to clear the snow from runways in airports, freezing cold temperatures to blow snow. And it's, that's why it has so much power to it because it has to mechanically blow the snow off the runway from idea to production three years. You know, and like I said,\r\n\r\n\r\nNikolas Hulewsky (56:20.386)\r\nWait, so is it in production right now?\r\n\r\n\r\nMatthew Chang (56:23.086)\r\nYeah, yeah, and we produce it in Detroit. Yeah.\r\n\r\n\r\nNikolas Hulewsky (56:24.91)\r\nIs it any or any off the line any of them working?\r\n\r\n\r\nMatthew Chang (56:30.318)\r\nWe did our unveiling at the FAA trade show in April. We drove it under self-power and it's going to two airport pilots this coming snow season.\r\n\r\n\r\nNikolas Hulewsky (56:40.558)\r\nBro, okay, however much money you're raising, you need to dedicate like 10 % of it just to marketing. How do I not know this crap, man? You're right, you're right. But like, seriously, you're like, oh yeah, yeah, we won the grant. How many people won the grant for the DOT?\r\n\r\n\r\nMatthew Chang (56:50.298)\r\nThat's an offline. We won't do that on the podcast.\r\n\r\n\r\nNikolas Hulewsky (57:04.472)\r\nYou're the only one out of 700 plus applicants. You're the only one that won the grant. And then those other companies said, we're still gonna compete. We're gonna try it at the same time as them.\r\n\r\n\r\nMatthew Chang (57:04.503)\r\nYeah, just us. Yeah.\r\n\r\n\r\nYep. They gave the runner up.\r\n\r\n\r\nMatthew Chang (57:16.558)\r\nYeah, they gave a runner-up prize to Las Vegas. So Las Vegas got like the, you know, like the consolation prize. And then they gave a bronze medal to Youngstown, Ohio. And Youngstown ended up giving the money back because they couldn't.\r\n\r\n\r\nLike if you take the money, have to execute right with a federal brand. If you take the money, you have to show product. So Las Vegas is still trying to bring theirs online and they're going to have like a very limited application where they like retrofit a vehicle and it like kind of does something automatic. then Youngstown, Ohio, I think just gave the money back because they're like.\r\n\r\n\r\nNikolas Hulewsky (57:40.461)\r\nYeah.\r\n\r\n\r\nMatthew Chang (58:02.266)\r\nWe can't execute here. But in Jacksonville we got it done. It's operational today. You can come to downtown Jacksonville and ride a driverless city bus right now.\r\n\r\n\r\nNikolas Hulewsky (58:11.768)\r\nDude, that's insane. That's incredible. I'm still trying to figure out like, okay, well, what is your business? Because like, yeah, we, we do make robotics, but then also we get contracted with all these, yeah.\r\n\r\n\r\nMatthew Chang (58:17.656)\r\nYeah.\r\n\r\n\r\nMatthew Chang (58:24.822)\r\nOkay, so we'll take it offline. Here's what I love to do. This is what my whole team loves to do. And this is most engineers, by the way. We want to work for great clients that appreciate our work. We want to design cool things that we can be proud of, that if we're driving by it with our family and kids, we can point to that and say, mommy or daddy helped make that, right?\r\n\r\n\r\nAnd we just want to have people respect the work that we do. We want to know that it's safe for the public. That's the number one thing in engineering is safety for the public. That's it.\r\n\r\n\r\nWe're very simple in that regards and my personal passion is I want the thing that no one else has done before. That's why I bought build SubZero EVs because no one wanted to go build that. That's a very tough use case. That's why I wanted to do the first Autonomous Hospital because several big name companies tried and failed.\r\n\r\n\r\nAnd then our other passion project that you'll start to see early next year on store shelves, we're rolling out high performance food packaging with no PFAS. So that's the like for the moms product. And that's a totally chemist based product.\r\n\r\n\r\nNikolas Hulewsky (59:42.199)\r\nI don't know what that means.\r\n\r\n\r\nMatthew Chang (59:44.408)\r\nOkay, so your food packaging is covered in PFAS, right? So if I was holding a Starbucks cup, it's just a plastic bag with paper wrapped around it. So your hot coffee is in plastic, right? And if you've seen the videos online probably where they take a Coke can and they stick it in acid and then a bag comes out. So like even your aluminum cans have plastic bags inside of them.\r\n\r\n\r\nNikolas Hulewsky (01:00:02.55)\r\nYeah, yeah.\r\n\r\n\r\nMatthew Chang (01:00:08.213)\r\nSo we want to have and that's where all the PFAS in your food comes from. When you have these microplastics in food, it's coming from the food packaging. Canned soup is super high in microplastics, you know. So what we want to do is we want to have good for you food packaging. But what's the point of food packaging? Freshness can't fall apart in the store. I don't want a coffee cup that the coffee goes from inside the cup to outside the cup in my lap. Right. I need the coffee to be in the cup. So that means\r\n\r\n\r\npaper packaging by itself is not high performance enough. You know, we don't want to coat it with wax and then the wax is like in the drink and all that stuff. So what we did was we went to Northwestern University, their chemistry department, they had a breakthrough in material science called graphene oxide.\r\n\r\n\r\nSo we partnered with them. We took the global license for graphene oxide research, patented all the applications, and now we're going into commercial production with two Fortune 500 companies so that some of the food product you see on the store shelf is in organic paper, but the paper's been strengthened with graphene oxide so that it can actually hold up to like wet meats or to vegetables or things like that that would normally make it soggy and fail.\r\n\r\n\r\nNikolas Hulewsky (01:01:25.129)\r\nNow, was that a product that you incubated and thought of and said, Hey, we're going to go create, we're going to go talk to Northwestern and get that or we did a fortune 500 companies come to you and say, solve this problem for us. And then you went out and did it.\r\n\r\n\r\nMatthew Chang (01:01:34.478)\r\nNow we incubated that my one of my mentors, who's a brilliant PhD of engineering. He works at my company and he said, I want you to take a gamble on this. He said, I think it's going to work. I want you to take a gamble. So we did two of my mentors.\r\n\r\n\r\nNikolas Hulewsky (01:01:49.345)\r\nOne of my mentors works at my company. Am I talking to like Genghis Khan or Alexander the Great? Jeez. Yeah, two of my mentors work at my company. Holy, that's amazing.\r\n\r\n\r\nMatthew Chang (01:01:59.726)\r\nWe have two deans. We have a dean of engineering, and he's the one that came up with this idea of using organic chemistry to solve food packaging. And then we have a dean of business, both of which were mentors of mine, and they both work at the company now.\r\n\r\n\r\nNikolas Hulewsky (01:02:15.992)\r\nDude, you're like an, have you ever heard of Bell Labs or Xerox had a, what was it? It's like Palo Alto Park research or something like that. Or Palo Alto Research Center. a lot of the Google has, you know, their moonshot part of the business. What's, what's anyways, you're like your own independent Bell Labs.\r\n\r\n\r\nMatthew Chang (01:02:20.057)\r\nYeah.\r\n\r\n\r\nMatthew Chang (01:02:37.174)\r\nx lab or something.\r\n\r\n\r\nYeah, we're a much poorer version of that. We have to do everything.\r\n\r\n\r\nNikolas Hulewsky (01:02:43.49)\r\nWell, that's what I was going to say. You incubated this idea. Like most of those companies have lots of funding that they're like throwing at these moonshot ideas, you know, from Google. You.\r\n\r\n\r\nMatthew Chang (01:02:50.69)\r\nYeah, that's where for your audience, you know, the customer funded model is core to what we do. So we had relationships to Fortune 500 food retailers and producers and we asked them.\r\n\r\n\r\nwould it be useful if we could solve this problem? And from there, they both gave us our initial research contracts. from there, so far one of them's in production right now. And the other one is I think, hopefully we'll be getting into production soon, is we were solving a industry problem.\r\n\r\n\r\nThis wasn't like product market fit. It's like I live in factories. I know this is a problem. I'm also consumer. I buy the product at the store. So I know it's a problem. And we just want to fix that problem.\r\n\r\n\r\nNikolas Hulewsky (01:03:35.331)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (01:03:39.884)\r\nIs that part of the reason you went and raised or you're raising this fund, this $50 million fund is so you can work on projects that you want to work on without having to go to a corporate sponsor.\r\n\r\n\r\nMatthew Chang (01:03:46.682)\r\nThe fund came from so quick story about chain robotics. We have spun out three product companies that I talked about paper science, hospital robotics and sub zero electric vehicles. Okay. Those are independent companies that have diversified cap tables and private investors and they're they have their own CEOs of each business and we just sponsored them, get them to launch. Right.\r\n\r\n\r\nNikolas Hulewsky (01:04:13.784)\r\nSay those three again.\r\n\r\n\r\nMatthew Chang (01:04:16.09)\r\nGoECO is organic high-performance food packaging. Robotics is the hospital automation that we talked about for a while on this call. then Kodiak Tech are the FAA rated electric vehicles.\r\n\r\n\r\nSo that was the peak innovation we could do for productization. Like we were stretched for resources. And at the same time, we're very active investing in chain robotics. So we hold currently 12 companies, startup stock on our balance sheet. So every time I can, if I'm working with a cool company or cool idea, I Hey, can we invest? We've invested in a few of our customers, a bunch of our friends.\r\n\r\n\r\nAnd so we're sponsoring companies and we were just getting demand that I couldn't handle from the profit that we make to keep investing and spinning out companies. So we looked for a way to scale that and that's where we ended up launching a VC. So we have the Chang Robotics Fund, which is cr.fund on the web.\r\n\r\n\r\nSo from the Chang Robotics Fund, we said, oh, now we can onboard many more companies and provide much more support. So we brought on a team of GPs that were really good at venture. then we have so far invested in nine companies. And for the fund one, we're going to 15 to 17, depending on how it shakes out. So we're a little more than halfway done with bringing the portcodes on. And we started that in January of this year.\r\n\r\n\r\nNikolas Hulewsky (01:05:56.815)\r\nIs the plan just to invest in them or is the plan like, hey, I'm not only investing in them, but we're also bringing the full force of chain robotics to help them.\r\n\r\n\r\nMatthew Chang (01:06:02.894)\r\nyou\r\n\r\n\r\nMatthew Chang (01:06:06.916)\r\nGreat. Yeah, it's it's a Vintra studio turned sideways.\r\n\r\n\r\nSo typical venture studio, you have your idea, you go work there, they take a little cut of the company and they give you HR, legal, like kind of the foundational support that you need to start a business. That's not what we do. We go horizontal. We're going to give you scaled engineering and technical expertise as you grow in complexity for product. So what it saves founders from doing. So first off, you can't be in the fund unless you need engineering, right? Because like that's the whole value prop. But\r\n\r\n\r\nNikolas Hulewsky (01:06:38.104)\r\nYeah. Yeah, yeah, yeah.\r\n\r\n\r\nMatthew Chang (01:06:40.846)\r\nDave's companies, when you watch SpaceX, when you watch Tesla, when you watch Andrew Real, what they're doing is amazing.\r\n\r\n\r\nBut you can't replicate that as a founder unless you have really deep pockets, right? And the Google example, the Bell Labs example were perfect. You have to have really deep pockets to scale the technical and to build those engineering teams to launch a rocket and land it back on the launch pad, right? So what we do is we provide that scaled engineering support as they grow from prototype to gen one, gen two product, eventually autonomous systems product. We scale with them and we just have a few requirements. Number one,\r\n\r\n\r\nFor your next level engineering, you have to use chain robotics.\r\n\r\n\r\nand you should because it's just a better value. We'll train your internal engineers, but every time you get to the next level, you got to use us. The other requirement is you have to have a coherent made in USA strategy. So if we're to give you that expertise and then you're going to go fabricate in Malaysia or China or Mexico, you're out. To come in with the Robotics Fund, you have to make it in USA.\r\n\r\n\r\nNikolas Hulewsky (01:07:52.482)\r\nThat's awesome.\r\n\r\n\r\nMatthew Chang (01:07:54.616)\r\nYeah, that's what, you know, I don't know if everyone agrees with it, but that's the way it is.\r\n\r\n\r\nNikolas Hulewsky (01:07:59.833)\r\nmean, dude, as your investment thesis, you can do whatever you want, right?\r\n\r\n\r\nMatthew Chang (01:08:03.16)\r\nRight. Yeah. that, that I think, know, yep, you have to use our engineering and you have to make in USA. And, and then we give you capital on all the mentorship. But if you look at my website and look at our toys that we have for engineering, like, why would someone not want to use that? So if you just go to Chang Robotics.ai\r\n\r\n\r\nNikolas Hulewsky (01:08:05.836)\r\nAre those the two main criteria?\r\n\r\n\r\nNikolas Hulewsky (01:08:13.39)\r\nDude, I think what's...\r\n\r\n\r\nthink what's fascinating about that is...\r\n\r\n\r\nNikolas Hulewsky (01:08:23.086)\r\nWhat's the website?\r\n\r\n\r\nMatthew Chang (01:08:30.39)\r\nAnd then when you're on the homepage, just scroll down until you see the partners. There's a couple of X guys in here. yeah, hit home and scroll down. There you go. So we just went past all the partners. Those are our little special secrets. But right here, yeah, all these little logos. Who's not going to want to have access to these companies, right? So independently, a startup cannot work with these firms.\r\n\r\n\r\nNikolas Hulewsky (01:08:42.302)\r\nOkay.\r\n\r\n\r\nMatthew Chang (01:08:59.012)\r\nBut if they're working through me, they can, right? And I can use my relationship to bring it to them. And there's probably some that are not on there, because we add them pretty frequently.\r\n\r\n\r\nNikolas Hulewsky (01:09:11.742)\r\nWell, think what's interesting about that fund is you've started, like you said, an engineering, you can launch sort of an agency business because it's a high ticket item. And if you got one client, you're in business. And that's why it works, because it's high ticket, you got one client, you're in business. However, in order to scale a business like that, it's hard because how do you automate or optimize creativity? How do you all of sudden have an SOP for how we solve problems?\r\n\r\n\r\nMatthew Chang (01:09:34.04)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (01:09:41.743)\r\nCreativity is, by definition, hard to have constraints around it. But in this fund, what you're doing is you're effectively taking the best part of what you do, which is that creative problem solving mixed with engineering and solving the hardest engineering problems. And then you're investing in companies by giving them access to that sort of creative problem solving as they scale up. is really interesting. It would be as if Bell Labs...\r\n\r\n\r\nhad done that or DARPA was able to do that, which is obviously federally funded, but you're doing that in the form of this fund is really freaking fascinating. Yeah, sorry, you're blowing my mind with the way that you've structured it.\r\n\r\n\r\nMatthew Chang (01:10:27.608)\r\nYeah, one fun thing for the audience, we do teach on lean startup, so I'm sure you've read the book. But it's basically this idea of being customer funded, understanding what the customer wants.\r\n\r\n\r\nAnd so where I think it breaks the paradigm is I personally find the Silicon Valley model too abstract. When you talk about like product market fit and when you talk about like some sort of a breaking point of adoption, I feel like all those models were set up around effectively social media and web 2.0. So it was like B2B SaaS, which now we're dunking on pretty hard on Twitter and social media and all these digital things.\r\n\r\n\r\nI feel like all the venture words were for that. And you see the guys that you'll see me in the chorus on this. You see all the manufacturing guys on Twitter now are saying like, that doesn't work for us. Like I fabricate metal parts. Like that's what I do and it works and people buy it. so I think, I think by us mentoring on the lean startup, it's much more focused on like, what is your target market actually want? You don't need product market fit. If you know what they want, just figure out what they want and go build it.\r\n\r\n\r\nYou know and then as you build it you're gonna better and better and cheaper and cheaper, and you'll you'll add more customers Scale is the hard part both in manufacturing and engineering Like how do you produce a lot of goods you just have to have more mega factories, or is there a better way to do it? What we? We're doing in engineering is inside and outside the company outside the company. We have these great partners So I'm doing something like incredibly technical in like microelectronics. You know I've got a partner for that. We're gonna use them\r\n\r\n\r\nNikolas Hulewsky (01:11:45.859)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (01:12:00.991)\r\nYeah, right.\r\n\r\n\r\nMatthew Chang (01:12:14.364)\r\nSo that helps us scale because we don't have to keep those people on staff. And then inside the company, we have a 40 % AI goal. So I want 40 % of the engineering tasks done by AI. So it's the same issue you brought up with the nurses and the doctors and having to scribe and write notes and everything. I mean, if we're being honest, like a lot of an engineer's day is not value added.\r\n\r\n\r\nIt's just doing reporting or manual tasks. It's not the actual problem. Yeah.\r\n\r\n\r\nNikolas Hulewsky (01:12:47.278)\r\nProbably most people's, yeah, yeah, most people's problem. Most of their day is not value-added.\r\n\r\n\r\nMatthew Chang (01:12:51.034)\r\nSo we want, we want all that done by AI and then we want the engineer focused on the QA, the problem solving, you know, monitoring the AI, you know, for lack of a better sense. So I think we're well in on the way with that. think we'll be, you know, in maybe six months from now hitting that 40 % target where 40 % of the work is now done by a machine and not by the human. And then the human has more time for the customer, more time for the\r\n\r\n\r\nNikolas Hulewsky (01:13:18.638)\r\nThat's so cool.\r\n\r\n\r\nMatthew Chang (01:13:20.988)\r\nCreativity or just more time with their kids, whatever it is\r\n\r\n\r\nNikolas Hulewsky (01:13:25.592)\r\nDude, I wish I had another four hours with you, because I could just, there's like so many rabbit holes we could go down. Let's do it. Where's the best place for people to come find you?\r\n\r\n\r\nMatthew Chang (01:13:29.626)\r\nWell, I have to do a consult with you because I got to figure out this marketing thing.\r\n\r\n\r\nMatthew Chang (01:13:38.842)\r\nCheck me out on X, so it's Matthew A. Chang. I'm sure you'll tag me in this podcast. And then our company website, changrobotics.ai. You can get to all my other resources and links from there. And then I do have one resource for your audience that I'll tag you in when it comes out, which is September 30th. I'm set to publish a book on how to start a business the Christian way.\r\n\r\n\r\nAnd that is, risk taking is biblical. It goes written by Joshua Lysak. That's coming out September 30th. It's the first time I've it out loud just now. So I'll make sure I tag you in that. Yeah.\r\n\r\n\r\nNikolas Hulewsky (01:14:15.864)\r\nDude. Okay, tell me the title again.\r\n\r\n\r\nMatthew Chang (01:14:20.642)\r\nrisk-taking is biblical.\r\n\r\n\r\nNikolas Hulewsky (01:14:23.276)\r\nrisk taking is biblical.\r\n\r\n\r\nMatthew Chang (01:14:25.656)\r\nWhat we unpack in the book, we have to use the role we is is what does the Bible have to say about risk, which entrepreneurship is all about risk, right? If you're not willing to take a risk, you'll just never be an entrepreneur. Right. So what does the Bible have to say about it? So that people that are Christians can be biblically aligned. And then what what role and evidence did Christ play in his ministry that you can replicate?\r\n\r\n\r\nNikolas Hulewsky (01:14:30.614)\r\nYeah, yeah,\r\n\r\n\r\nMatthew Chang (01:14:55.58)\r\nin building a business. So it's designed to get people off zero and to one. And so by the end of the book, you know, if you read through it and actually do it, if you have done nothing and you read the book, it's going to take you two years, right? That's the preview. But most people are not in chapters one. Most people are already somewhere in like chapter six or seven as they pick it up and read it. They may be able to get there in six months, right? But the idea is let's get more would be entrepreneurs\r\n\r\n\r\noff of zero and on to one so that they're actually in the game. And we lay out some basic principles too for how they can set their business up to be a Christian business even if you're in skilled nursing or robotics or whatever industry you're in, you can do that.\r\n\r\n\r\nNikolas Hulewsky (01:15:41.998)\r\nSo like the parable of the talents would be a perfect example of, you you've got these three people, he's, yeah, he's given 10, yeah, 10 talents to one, five talents to another. I can't remember the exact numbers, one to one. And the first two double their talents and the third one doesn't want to risk anything. He buries it. And when the master comes back, he's like, what the freak? He's like, well, I kept it safe. He's like, you're not a profitable servant. Yeah, yeah, yeah.\r\n\r\n\r\nMatthew Chang (01:15:46.394)\r\nRight in the middle of it. That's right in middle of it, yep.\r\n\r\n\r\nMatthew Chang (01:16:00.964)\r\nYeah.\r\n\r\n\r\nMatthew Chang (01:16:07.834)\r\nThat's not why gave it to you, right? That's not why I gave it to you. I gave it to you so that you would do something and multiply it. Exactly. You nailed it. Yeah, so the Parable Analysis Interpreter? September 30th. So it'll be available on Amazon and all the normal channels and I'll make sure you get the link for that.\r\n\r\n\r\nNikolas Hulewsky (01:16:11.918)\r\nDude, that's-\r\n\r\n\r\nYeah, that's really cool. September 30th.\r\n\r\n\r\nNikolas Hulewsky (01:16:26.325)\r\nAwesome. Well, Matthew, this has been fantastic. We'll talk again soon. All right, stay on. I'm going to just.",
  "metadata": {
    "duration": "",
    "date": "2025-09-15",
    "platform_source": "Google Drive"
  }
}