{
  "episode_number": "123",
  "episode_title": "How I Made $150K in 3 Weeks with Christmas Lights (After a Job Selling Toothpaste) with Anne McGinty",
  "guest_name": "Anne McGinty",
  "business_name": "Christmas Lighting Business",
  "transcript": "﻿Nikolas Hulewsky (00:00.078)\r\nAnd the reason I'm super excited to have you is not only because you have a really cool podcast, but you've talked to a bunch of different entrepreneurs over the last year. And I think you would have really good perspective for people who are listening, trying to figure out how to get into entrepreneurship or grow their business. But before we get into that piece, because I'm super excited to brainstorm with you, tell me your background.\r\n\r\n\r\nAnne McGinty (00:00.286)\r\nYeah\r\n\r\n\r\nAnne McGinty (00:25.151)\r\nHow far back do want me to go?\r\n\r\n\r\nNikolas Hulewsky (00:26.926)\r\nGo to 1981 San Jose, California. Tell me about your business life. Give me the highlights of your successes.\r\n\r\n\r\nAnne McGinty (00:29.653)\r\nOkay.\r\n\r\n\r\nAnne McGinty (00:38.741)\r\nOkay, business life, I'll try to short in this. Graduated from college in 2003. So went backpacking overseas for about a year and lived check to check. Came back, started a sales job selling toothpaste. This was in the Bay Area and it was demoralizing. Great company.\r\n\r\n\r\nNikolas Hulewsky (00:55.47)\r\nWhere was this? OK.\r\n\r\n\r\nAnne McGinty (01:02.473)\r\nBut when you have a trunk full of toothpaste samples to give out to people and you're driving from San Francisco down to Santa Cruz to moderate a Fresno and back every single week, it was brutal. But I learned sales. So that's what I got out of that job. And sales is really just about making connections and getting to know people. And from there, once I realized that I could not make enough money in this full-time job to do anything because I was struggling to save money. It took me six months to save $1,000.\r\n\r\n\r\nI, yeah, because I was on, it was a base salary of near 30,000 and then my bonuses got me to about 50,000. But when you live in the Bay Area and you take out your health insurance and you take out your utilities and your phone bill and then you pay taxes, it really whittles down very quickly when rent is so high. So I took six months to save $1,000, was very happy and celebrated and then I quickly,\r\n\r\n\r\nNikolas Hulewsky (01:36.077)\r\nOkay.\r\n\r\n\r\nAnne McGinty (02:00.007)\r\nswitched and thought that's ridiculous. Like how am I ever going to get ahead? And started a greeting card business on the side using my photographs because I had minored in photography. So that I ran for a couple years really only got to the point where it was making about $15,000 an extra take-home profit a year. And I used that money to buy a property in Jackson Hole, Wyoming. So\r\n\r\n\r\nThat property in Jackson Hole, what it was, $230,000, so $46,000 down. I sold it the next year for a 100 and, it was either a 126,000 or $156,000 profit. And that was just a good start, right? So this was 2005.\r\n\r\n\r\nNikolas Hulewsky (02:45.912)\r\nWow. What year is this?\r\n\r\n\r\nNikolas Hulewsky (02:53.602)\r\nOkay, so you went, saved up some money, started a greeting card business. You end up doing $15,000 a month in supplemental. You build up enough cash to buy a property. a year. Okay, I thought you said it. Okay, that makes more sense. Because you said it in a way that was like, big deal. And I was like, 15 grand a month, that's nuts. Okay, so you save up an additional 15 grand. You purchase some real estate in Wyoming, and then you're able to flip that within the next year. And all of a sudden you're sitting on 150 grand-ish.\r\n\r\n\r\nAnne McGinty (02:58.868)\r\nYeah.\r\n\r\n\r\nAnne McGinty (03:02.602)\r\nnot a month, a year.\r\n\r\n\r\nAnne McGinty (03:10.741)\r\nNo.\r\n\r\n\r\nAnne McGinty (03:16.84)\r\nYeah\r\n\r\n\r\nAnne McGinty (03:22.067)\r\nYeah, because we had friends who were living in Jackson Hole, Wyoming, and I was talking to them lamenting about how difficult it was to get ahead in the Bay Area. There was no way we could purchase real estate. I say we because my husband, my boyfriend at the time, and I were trying to like hack life together. And our friends were saying, rents are so much here too, and there's a 0 % vacancy rate. And one of them mentioned, there's this condo that's available. It's like entry level, low price. would be\r\n\r\n\r\nprobably cashflow by just a little bit. So it did, it only cashflowed by around $56 a month. But with the down payment parked, the $56 a month, sold it a year later. know, Wyoming has no state tax. So we were in a 15 % long-term capital gains tax for federal and no state tax. And that was a good enough down payment for the Bay Area. So this was, so I still had the toothpaste job. I still was doing the greeting cards and I was also part-time\r\n\r\n\r\nworking interning between a newspaper and a photographer who is based in Marin County up in San Rafael earning extra side gig money. So all of that, I was hustling. All of that I was like just putting and I was so good because I went from backpacking where you're living check to check and on very little money like I was living off of bread, peanut butter and bananas to coming to the Bay Area.\r\n\r\n\r\nNikolas Hulewsky (04:28.078)\r\nDude, you were hustling. You were hustling.\r\n\r\n\r\nNikolas Hulewsky (04:42.049)\r\nHahaha\r\n\r\n\r\nAnne McGinty (04:44.263)\r\nIt was like a game to me, like how can I live the most fun life that costs the least amount so that I can save it so can actually put this money to work.\r\n\r\n\r\nNikolas Hulewsky (04:52.974)\r\nDude, we were first married, my wife and I went to Europe because we were like, well, if we have kids, it's going to be a long time until we can actually go to Europe. And we weren't there that long. We were there two weeks. But every hotel that we stayed at, we just shoved our bags full of bananas and apples and the baguettes. And that's all we ate. yes, was, well, not only free breakfast, it was like free breakfast, lunch, and dinner. So I'm very familiar with the peanut butter bread banana diet because I live that diet.\r\n\r\n\r\nAnne McGinty (05:10.911)\r\nFree breakfast?\r\n\r\n\r\nAnne McGinty (05:18.983)\r\nYes, when you have to, when you need to, you do it. And it was, honestly, it was fun.\r\n\r\n\r\nNikolas Hulewsky (05:27.668)\r\nIsn't it? Isn't it interesting too? You get to a different stage in life and then those periods of time that just felt so hard and they felt like, man, I wish I was in name whatever place that you think is better than where you are right now. And then you get to that place, cool, have a home or I have a second home or I have a business, whatever. And then you look back and you're like, man, I'm nostalgic for that time. It was so simple. It was so fun.\r\n\r\n\r\nAnne McGinty (05:50.665)\r\nYeah, we do talk about this all the time, how it didn't take a lot of money for us to have the best life ever. so, and we both, my husband, he's from New Zealand, he also spent years backpacking and he would go to London and then when London had winter, he would leave and go to warmer countries. But I really do think that there's something special that you can learn from that experience that is kind of hard to replicate within America, unless.\r\n\r\n\r\nBackpacking in America is hard because this country is pretty expensive and it's just the culture is not really that well set up for it.\r\n\r\n\r\nNikolas Hulewsky (06:26.51)\r\nI mean, the transportation in the United States, if you look at like a Amtrak map across the country, I love talking to people with ADHD. We are talking about Amtrak right now, it's amazing. If you look at a map of Amtrak across the country, it's not very populated. I mean, there's like a couple of railways across, so it's much harder to actually backpack across the United States than it is across Europe. Where did the hustler come from? Is that instilled from the family? Is it just you?\r\n\r\n\r\nAnne McGinty (06:31.411)\r\nYeah.\r\n\r\n\r\nAnne McGinty (06:35.22)\r\nYeah\r\n\r\n\r\nAnne McGinty (06:47.55)\r\nYes.\r\n\r\n\r\nAnne McGinty (06:53.703)\r\nInmate, I think it, I'm the youngest of four and I think that I was born fairly happy. Like I just was a happy go lucky people. That's a phrase people used to always say, she's just like happy go lucky. And my mom said that when I was very young, I just, she would say, you know, what do you wanna be? And I would joke around and be like, I'm gonna be a clown. And then my sister was just like, she gets so annoyed, she just roll her eyes at me.\r\n\r\n\r\nAnd then my mom would ask again, I was like, I don't really care what it is that I do as long as I'm happy and I'm having fun. And even now to this day, when a decision comes up like, Hey, mom, what do you think about this business? Or what do you think about this potential investment? She's like, look, you always said that you were motivated by creating a very fun life and you've done that. So just keep on going with, with that direction. And it's, it's worked. Yeah.\r\n\r\n\r\nNikolas Hulewsky (07:49.326)\r\nI like the scene in Step Brothers when they go from hating each other to realizing they're, but do we just become best friends? Yep. That's me. I was just born with like a happy demeanor. I just kind of have always had a positive disposition. I like to have fun. I like to have relationships with people. So anyways, I resonate. I resonate with that.\r\n\r\n\r\nAnne McGinty (07:54.313)\r\nYou\r\n\r\n\r\nAnne McGinty (08:02.377)\r\nYeah.\r\n\r\n\r\nAnne McGinty (08:10.389)\r\nYeah, but the hustler part I think the hustle part came from my parents because they were immigrants from the Philippines and they came over with $200 each and By the time just to fast forward real fast By the time I was born and in middle school they had about a dozen houses and they yeah And they had investments and they took us traveling around the world and they sent us to private school So their life and their story was constantly told to me throughout my own life\r\n\r\n\r\nNikolas Hulewsky (08:38.325)\r\nMm-hmm.\r\n\r\n\r\nAnne McGinty (08:40.143)\r\nAnd it really instilled this belief that you can make anything happen that you really truly believe you can. So, no, I grew up in Atlanta, Georgia.\r\n\r\n\r\nNikolas Hulewsky (08:47.662)\r\nDid you grow up in California?\r\n\r\n\r\nOkay, I knew I heard a Southern draw.\r\n\r\n\r\nAnne McGinty (08:53.333)\r\nIt's not there anymore.\r\n\r\n\r\nNikolas Hulewsky (08:56.056)\r\nfreaking no, I knew I heard it. was like, are you from the south? But I realized sometimes I offend people when I asked them for their accents. But my dad's an immigrant. He's from he's technically from Brazil, but he's Ukrainian. I freaking love. Yeah, long story. But I love immigrants. And Filipinos dude, such hardworking, good people. And they're just industrious. They're very, very entrepreneurial, especially in healthcare, like I worked in healthcare.\r\n\r\n\r\nAnne McGinty (09:09.948)\r\nwow.\r\n\r\n\r\nAnne McGinty (09:20.787)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (09:25.006)\r\ntons of Filipinos in healthcare and they own businesses and they have board and cares and they've got like the Filipino mafia that they work with. I feel like it's a cultural thing.\r\n\r\n\r\nAnne McGinty (09:36.253)\r\nI think it is. I was just speaking with someone the other day and they had mentioned how they read a couple books about hospitality. And when they were talking about what they'd learned, I thought, you know, those concepts I think are sort of ingrained in the Filipino culture, the idea of hospitality. It kind of shows when you look at the careers that a lot of Filipinos do end up in overseas, a lot of times it's hospitality.\r\n\r\n\r\nNikolas Hulewsky (09:58.67)\r\nYeah, makes sense. What's funny is my dad, so again, he's an immigrant. And we grew up with these really, I grew up really poor and we grew up with these really crappy cars, BMWs, Mercedes-Benz, but they were always like salvaged title, 20 years old. So it's like 1997, I'm driving around in a 1974 BMW four series that is like got three different color doors and a different color hood. And right, so I was always like, dad.\r\n\r\n\r\nAnne McGinty (10:15.549)\r\nAwesome.\r\n\r\n\r\nAnne McGinty (10:20.032)\r\nLove it!\r\n\r\n\r\nAnne McGinty (10:26.14)\r\nLove that.\r\n\r\n\r\nNikolas Hulewsky (10:27.768)\r\nthis is are we doing here? And it wasn't until I got older and lived in Europe and realized like having one car, you're doing well. Having two car, you're like wealthy. That like, it like made my dad feel good. Like, I have multiple cars, Nikolai. I am very, very successful man. You're welcome. So I, I love immigrants. That's, that's awesome. Are all your siblings that way? Are they really industrious as well?\r\n\r\n\r\nAnne McGinty (10:41.449)\r\nYou\r\n\r\n\r\nAnne McGinty (10:52.519)\r\nin different ways. We all have very different personalities, but yeah, I think that that maybe it's genetic. don't know. Something that came over with my parents that was instilled in all of us is fire that like I can make it happen.\r\n\r\n\r\nNikolas Hulewsky (11:07.15)\r\nAfter that first 150 grant that you made from Wyoming, Montana, wherever it was, what did you do with that? Did you buy a house in the Bay Area? Did you take that and buy a business? What did you do?\r\n\r\n\r\nAnne McGinty (11:09.663)\r\nYeah.\r\n\r\n\r\nAnne McGinty (11:15.699)\r\nYes, so Mark and I, so he was my boyfriend again at the time, he and I were looking for real estate in the Bay Area and we really couldn't find anything. And this was back in the like purple Kool-Aid times where people were like, sure, add an extra 100,000, 200,000 above the asking price. Like literally real estate agents would say, have you drunk the Kool-Aid yet? And we almost bought a house that would have really, really stretched us. Like the mortgage.\r\n\r\n\r\ninsurance taxes, I think would have actually debilitated us slightly. And then my husband found a three unit building that was for the same price. And, you know, we had both read property books, gone around to open houses with my parents in my childhood, we understood how to do this, it just felt a little bit scary. And we put in an offer on this property and we got it and the\r\n\r\n\r\nlower two units really did not cover a whole lot of the mortgage at that time because the middle floor tenant was rent controlled and elderly and we accepted that and knew we can't kick her out. It's fine. She can stay as long as she wants to. But miraculously, a year or two later, she vacated. And when she vacated of her own doing, she just left and that unit and the lower unit paid for the full mortgage of the entire building. So, yeah, go ahead.\r\n\r\n\r\nNikolas Hulewsky (12:13.496)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (12:37.998)\r\nDid you know you were house hacking? Like, did you know that you're like, okay.\r\n\r\n\r\nAnne McGinty (12:41.333)\r\nI mean, kind of, yeah. Kind of, because in New Zealand, this is a real strategy for how people get ahead there. Like, it's actually a part of the conversation when we go and with our friends, say, here, it's not about saving money to send your kids to college or university. It's about saving money to help them get in real estate. Because the average home in New Zealand is a million dollars now, New Zealand. And so it's more important to people\r\n\r\n\r\nNikolas Hulewsky (13:01.335)\r\nMmm!\r\n\r\n\r\nNikolas Hulewsky (13:07.5)\r\nmy goodness.\r\n\r\n\r\nAnne McGinty (13:09.767)\r\nover there to kind of house hack that way. And degrees have a much less sort of value or expectation in that culture. They really appreciate all different types of businesses, trades, jobs. They won't even necessarily ask you what you do for a living because it doesn't matter. It doesn't identify you the way it does here in America.\r\n\r\n\r\nNikolas Hulewsky (13:32.766)\r\nWhen you bought the house and then all of sudden were in the position where you had renters essentially covering your mortgage, which is really popular now, right? Since 2010, since I feel like the great financial crisis where we had the housing bust, the house hacking has become really, really popular. like, you could buy this house and then you just rent out this unit and then you go from there and you roll it you do the Burr method and buy, rehab, refinance, repeat, whatever. Were you still doing toothpaste at this time?\r\n\r\n\r\nAnne McGinty (13:49.087)\r\nMm-hmm.\r\n\r\n\r\nAnne McGinty (14:01.019)\r\nAt this time, the transition happened around 2006, so no, I wasn't. We had started a Christmas light hanging business. No, I just decided it was too much effort. I have a whole cabinet over there that is full of greeting cards for life.\r\n\r\n\r\nNikolas Hulewsky (14:09.069)\r\nWhat were we doing?\r\n\r\n\r\nNikolas Hulewsky (14:13.707)\r\nDude, I love you so much. my gosh. All right. Did you still have the greeting card company? Okay.\r\n\r\n\r\nNikolas Hulewsky (14:29.016)\r\nGood for you. But the Christmas lighting business, that's very seasonal. Why would you pick a seasonal business?\r\n\r\n\r\nAnne McGinty (14:36.245)\r\nSo that was kind of why we chose it because we both love to travel so much. So it was very motivating, the concept that you could make a year-long salary living in such a short amount of time. And that really proved to be beneficial in multiple ways because when you get a big chunk of money all at once, it actually is, I think, easier to save. It's also easier to strategically invest.\r\n\r\n\r\nNikolas Hulewsky (14:43.342)\r\nMmm.\r\n\r\n\r\nAnne McGinty (15:05.265)\r\nwhen you see this lump sum and you're like, I can actually make a significant investment if I just go ahead and use that money for that purpose, it removes the ability for you to just spend it. So we were just pretty motivated, I think, to get our money working. We wanted to have our time. And the seasonal aspect was I still love seasonal businesses. Like if you and I end up talking about what\r\n\r\n\r\nbusinesses I would potentially start today, they all kind of have an element of either seasonality or significant time.\r\n\r\n\r\nNikolas Hulewsky (15:46.53)\r\nYeah, it's interesting. you like optimizing for lifestyle. It's like you like having these seasons of like, okay, I'll work really hard, but I know I'm going to sock away money here because I want freedom at these other times. I think that's a really interesting way to kind of architect it. How long did you do the Christmas lighting business for?\r\n\r\n\r\nAnne McGinty (15:50.964)\r\nYeah.\r\n\r\n\r\nAnne McGinty (15:55.87)\r\nYeah.\r\n\r\n\r\nAnne McGinty (16:03.635)\r\nWe did that business for 13 years and sold. Yeah, we sold it in 2020. And it was such a gem. Yeah, it was such a gem. Really. Honestly, I would start that business again if I were that age. Because it grew so rapidly, we also chose a very high net worth area where we wanted to operate. And there is something to that.\r\n\r\n\r\nNikolas Hulewsky (16:06.434)\r\nHoly crap. You started from scratch? Did you start from scratch? Why?\r\n\r\n\r\nAnne McGinty (16:31.827)\r\nPacific Heights, Presidio Heights, San Francisco, the houses are all right next to each other, so your efficiency is maximized because if one neighbor, insensitive, yes, and as long as you establish that relationship and there's trust and you do a good job, then it just repeats every year. So it's not like painting. You paint your house, you're probably not gonna get your house painted for another 10 years. With Christmas, it comes around every year.\r\n\r\n\r\nNikolas Hulewsky (16:33.87)\r\nOkay, yeah.\r\n\r\n\r\nNikolas Hulewsky (16:40.654)\r\nThey're pretty price insensitive.\r\n\r\n\r\nNikolas Hulewsky (17:00.362)\r\nIs it, would you consider it a reoccurring business or a recurring business? Right? Like recurring business model would just be you're on a payment plan and every single month, right? That's SaaS, right? But reoccurring obviously is, we call you when we need you, but how did...\r\n\r\n\r\nAnne McGinty (17:14.437)\r\nThere were some people who would automatically book the following season for the exact same day or timing and they wanted to just secure that. What we ended up doing was, because our season at the beginning was only, it was very short. It was like maybe four weeks, maybe. And of those four weeks, it was probably only three weeks of work. But we made about $150,000 in those three weeks. So for us, that first season, yeah.\r\n\r\n\r\nNikolas Hulewsky (17:37.902)\r\nHuh? Wait, wait, wait, wait, wait, wait, wait, Generated or like net income made?\r\n\r\n\r\nAnne McGinty (17:44.053)\r\nNet income was closer to a hundred, but for us, for me, going from a selling toothpaste job at 50,000 a year to making my half of that was around 50. So making that in three weeks, I just thought, we've got this. So we started pouring everything that we could into growing it, turning it from a three week business into a six week, into eventually it was a six month business with six trucks.\r\n\r\n\r\nsix teams. So it turned into a six month business. Yeah. Because we picked up really big contracts with amusement parks, we had a job that was out of state, which was, I can't tell you which location it was because there was an NDA on it. But these are these are like amusement park size jobs. And they can take a month to install with our entire six truck team. So\r\n\r\n\r\nNikolas Hulewsky (18:15.576)\r\nSix month business? Why?\r\n\r\n\r\nNikolas Hulewsky (18:29.806)\r\nand you'd have to kill me.\r\n\r\n\r\nNikolas Hulewsky (18:40.878)\r\nmy goodness.\r\n\r\n\r\nAnne McGinty (18:41.609)\r\nThese companies often set their budgets in January and they know they have all these seasons to get through. there's Halloween, after Halloween it pretty much switches to Christmas if you're in that business. So we actually needed to put the lights up before Halloween and just keep them off. So we, yeah, we started installing in July. When the, go ahead, go ahead.\r\n\r\n\r\nNikolas Hulewsky (18:54.312)\r\nyeah.\r\n\r\n\r\nNikolas Hulewsky (19:03.382)\r\nI'm, this is part of my problem is like I spend time, what, what? No, you've.\r\n\r\n\r\nAnne McGinty (19:08.915)\r\nI was just gonna say when the pumpkins start growing, that to us was our signal that Christmas is here.\r\n\r\n\r\nNikolas Hulewsky (19:13.006)\r\nHa\r\n\r\n\r\nI'd like prepare for these interviews and I'm like excited to talk about certain things. I have my notes down and then somebody says something and it's just like, you know, I can't, I can't not follow the rabbit down this hole. Did you, I want to start with before the year that you launched it before you actually launched it. You guys have some money. Obviously you've got your, your place in San Francisco. You've got some renters. How did you come across?\r\n\r\n\r\nAnne McGinty (19:23.701)\r\nYuck.\r\n\r\n\r\nAnne McGinty (19:36.373)\r\nMm-hmm.\r\n\r\n\r\nAnne McGinty (19:42.485)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (19:45.016)\r\nChristmas lighting. Why was that the thing?\r\n\r\n\r\nAnne McGinty (19:46.481)\r\nSo, and this all kind of like happened really overlapping. we sold, let's see, we sold that condo in 2007, but we started this business in 2006. It was kind of like just a little bit of an overlap, but I had been selling toothpaste, right? And one of my coworkers was just joking with me like,\r\n\r\n\r\nNikolas Hulewsky (20:00.778)\r\nMm-hmm.\r\n\r\n\r\nAnne McGinty (20:09.275)\r\nman, we've got it so bad in this job, our backs hurt, we have to sell toothpaste. And meanwhile, my cousin's down in San Diego, he's making six figures and all he does is put up Christmas lights for a few weeks a year. And I was like, huh, that's interesting. And then Mark, my husband, said, he was at Whole Foods grocery shopping and...\r\n\r\n\r\nno, not grocery shopping actually. He was there like handing out free toothpaste because I'd convinced him that he needed to like make some, make a little extra cash. And he was right next to another woman who was handing out samples and they were chatting and they were sort of joking about the fact that they were handing out samples. And she said, you know, my boyfriend's got it so much better than this. He makes like six figures a year and all he does is put up Christmas lights.\r\n\r\n\r\nSo this was all like within two weeks that this happened. And I don't know, is that like the universe giving us a sign or is that a door that's just like, like come this way? We talked about it that night and we couldn't stop going, what are the chances? Really, like this stuff doesn't happen. Christmas lights, like twice in two weeks, what? And that's why we started.\r\n\r\n\r\nNikolas Hulewsky (21:08.023)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (21:18.434)\r\nYeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (21:24.258)\r\nSo I think what's really interesting is I think that there are two types of people who get into entrepreneurship. I think there's type A, which is you, that like you couldn't do anything other than just hustle. Like it was always going to be something that you did, which is awesome. And then there's people who are more of the planners who are like, okay, I'm to be strategic. I'm going to buy a business. It's going to be an existing business. Does it have a moat? Is it sticky? What are the customer contracts like, right? Like they're more of the thinkers. That's probably a little bit more for me just because it makes me feel safer.\r\n\r\n\r\nBut for you, like your type, you're opportunists where you're like, there's something there, let's try it. Why not? Why the heck not? Had you and Mark talked about you wanted to do something entrepreneurial together or was this like, huh, I never thought about us actually doing a business. I've got this side gig over here. Maybe we should try it. Which one was it?\r\n\r\n\r\nAnne McGinty (21:59.549)\r\nYeah.\r\n\r\n\r\nAnne McGinty (22:16.923)\r\nWe really were just motivated by believing that our lives were worth more value than any job was willing to pay us and wanted to make more money faster. Truly.\r\n\r\n\r\nNikolas Hulewsky (22:32.11)\r\nSo you had thought about doing entrepreneurship. It wasn't the first time you had ever like…\r\n\r\n\r\nAnne McGinty (22:36.117)\r\nBut not because I wanted to be an entrepreneur or run a business. I just wanted more control over my time and money. And that was a way that I could do it. I'm not a career corporate ladder climber. I don't like being in office buildings. I like my freedom. I like sunshine. So flexibility. We kind of fell into it, I would say, more than I had it ever in my head that that's what I was going to do. It was a belief, though.\r\n\r\n\r\nthat we could, a belief that we could make more money and create more time by chasing these opportunities.\r\n\r\n\r\nNikolas Hulewsky (23:12.138)\r\nSo a lot of people will talk about entrepreneurship and they'll say, hey, if you're going to do something, you got to be passionate about it. If you're to get into something, you got to have a passion for it because entrepreneurship is hard and you can run these businesses, yada, yada, yada. Did you have a passion for tree lighting or not tree lighting, but Christmas lighting? Do you ascribe to that like, you got to have a passion for it? What do you think of that?\r\n\r\n\r\nAnne McGinty (23:27.061)\r\nNo, not at all. I mean, I'm 43 now. So now I do have like a little bit more experience and knowledge. I, again, if I were to start a business today, it would really need to be framed around what the goal was of the business. I again, did not spend that much time thinking about this back then. It was really about money and time. But now,\r\n\r\n\r\nI have a different perspective. So I don't necessarily think that you need to have a passion for it. I think, I believe that is one avenue and it is a beautiful one if you can go that route and you get real purpose from what you're doing. But I also don't think it has to be that way. Like my mind generally thinks about how could I make money and do it in the shortest amount of time possible? Like I'm more of that type of an entrepreneur.\r\n\r\n\r\nSo, but when I interview people, I am absorbing what they're saying and I'm really impressed and just, I admire how other people have been more conscious about why they've started businesses, whether it's for a legacy, to give back to the world in some way, because they do have a passion in some related industry. But this is me learning alongside my listeners and it's great.\r\n\r\n\r\nNikolas Hulewsky (24:53.038)\r\nWell, I think I land a little bit in the middle. I just think you need to have a clear why. Why are you doing it? Do you want to be rich? That's fine. Do you want to have control of your time and freedom? That's fine. Do you love healthcare? And you're like, I just want to have a really good healthcare company that provides really good service. Like that's fine too. Just, you just have to know your why and then architect your opportunity towards that why. And I mean, that's what you've done, right? So in your way, you've been intentional.\r\n\r\n\r\nAnne McGinty (24:59.091)\r\nYeah.\r\n\r\n\r\nAnne McGinty (25:08.744)\r\nYou\r\n\r\n\r\nAnne McGinty (25:12.659)\r\nYeah.\r\n\r\n\r\nAnne McGinty (25:17.459)\r\nThat's what I, yeah, I agree with you 100%.\r\n\r\n\r\nNikolas Hulewsky (25:21.486)\r\nIt may not be in the same way that other people have done it, but you've been very intentional. Okay, year one, you do $150,000. When did you guys talk about the idea and when did you launch?\r\n\r\n\r\nAnne McGinty (25:23.252)\r\nYeah.\r\n\r\n\r\nAnne McGinty (25:32.615)\r\nWe talked about the idea, so those occurrences where they felt very like serendipitous, like a bit of synchronicity happened in July and we started the business in August. We did not know what we were doing.\r\n\r\n\r\nNikolas Hulewsky (25:45.976)\r\nYou're the best. my gosh, this is so cool. And what did\r\n\r\n\r\nOkay, isn't that usually what happens? I feel like you have to have a certain amount of naivety, because if you knew everything you knew now, you're like, man, I would not have done it that way. But you kind of need, you need that naivety to get you to do the things. What did you think was gonna happen? All right, so you launched in August. Did you think like, this could be a cool side hustle? Or like, what was your goal for that first year?\r\n\r\n\r\nAnne McGinty (25:55.069)\r\nYeah.\r\n\r\n\r\nAnne McGinty (26:13.499)\r\nOur goal was as much as we possibly can because Christmas is not coming around until next year. So every time a day passed, if we didn't have anything booked, it was like, there goes November 15th, because we're not getting November 15th back until next year. So it was really this chase. If a person signed up for a, they wanted the service and I saw that we had a spot open the next day. I did a little bit of like sales hacking where I was just like, we.\r\n\r\n\r\nNikolas Hulewsky (26:30.007)\r\nWow.\r\n\r\n\r\nAnne McGinty (26:41.525)\r\nactually we're going to be just down the road tomorrow and we had a cancellation. We could go ahead and get your lights up and in fact this is in our early installation window so you would get a 10 % discount off of labor. And they'd be like, oh great, I'll take it. And I'm like, yes, job secured for that day. I just increased that day from being like a $1,500 day to a $3,000 day because I filled this time slot.\r\n\r\n\r\nNikolas Hulewsky (27:04.652)\r\nYeah. OK. Did it cost anything to get started when you you launched in August? Like what were you guys thinking?\r\n\r\n\r\nAnne McGinty (27:12.437)\r\nIt took about 20,000 all in.\r\n\r\n\r\nNikolas Hulewsky (27:15.15)\r\nWhat was the $20,000 spent on?\r\n\r\n\r\nAnne McGinty (27:16.757)\r\nWe paid for a course to get a shortcut on education, on how to do the electrical part, custom cutting things, custom fitting, learning what all the lights and supplies were because we had such a quick turnaround with when we wanted to start marketing. that, yeah. Well, I did, I didn't do them all the time, but I was out there. I was out there on trees and ladders and yeah.\r\n\r\n\r\nNikolas Hulewsky (27:31.694)\r\nBecause you are going to be doing the installations too. I'm guessing if you had that.\r\n\r\n\r\nNikolas Hulewsky (27:39.438)\r\nI'm saying if you did 150 grand and then 100 of that was net profit, you were probably doing a lot of the labor yourselves. All right, so took a course. Did you have to buy any equipment?\r\n\r\n\r\nAnne McGinty (27:47.807)\r\nYeah.\r\n\r\n\r\nAnne McGinty (27:51.689)\r\nYeah, we bought ladders, we bought base supplies that you need for every job. bought...\r\n\r\n\r\nNikolas Hulewsky (27:57.336)\r\nDid you think about any insurance where you're like, we probably need to have insurance because I, you did. Okay. That's shocking.\r\n\r\n\r\nAnne McGinty (28:00.021)\r\nI think we did get insurance. Yeah, we did. Yeah. We maybe didn't get the amount of insurance that we needed and we definitely did not get workers compensation because we didn't even know about it. me. We got a box truck and some spray cans and we spray painted the name of our business with some home printed stencils. I like cut out the stencils and we taped them up and park Presidio and just like sprayed.\r\n\r\n\r\nNikolas Hulewsky (28:24.141)\r\nI love it.\r\n\r\n\r\nAnne McGinty (28:29.565)\r\nour number and our name on there. And when we weren't getting jobs, we would park that box truck in the premium neighborhoods where we wanted to work. And it was like a billboard. It was like a moving billboard, but free. And it worked.\r\n\r\n\r\nNikolas Hulewsky (28:43.874)\r\nYou never got called. Nobody was like, this car. It's unsightly.\r\n\r\n\r\nAnne McGinty (28:48.571)\r\nNo, because we would move it within 72 hours.\r\n\r\n\r\nNikolas Hulewsky (28:53.336)\r\nOkay.\r\n\r\n\r\nAnne McGinty (28:53.383)\r\nAnd it was tidy. Like, I could send you a picture of it. And it was tidy enough.\r\n\r\n\r\nNikolas Hulewsky (28:56.536)\r\nYeah, okay.\r\n\r\n\r\nsaying it wasn't tidy. I just know how those neighborhoods get sometimes when they're like, unsightly. This isn't a Mercedes. Ugh.\r\n\r\n\r\nAnne McGinty (29:00.565)\r\nLike major intersections that we knew a lot of people drove up and over, we would try to park it right near that stop sign so that you literally like couldn't miss it.\r\n\r\n\r\nNikolas Hulewsky (29:14.61)\r\nmy gosh.\r\n\r\n\r\nOkay, so tell me the rest of the customer acquisition channels. All so you had the van, you were like, we're doing this, it's decorated, we're gonna call us here. How else did you acquire customers that first year?\r\n\r\n\r\nAnne McGinty (29:22.59)\r\nYeah.\r\n\r\n\r\nAnne McGinty (29:27.047)\r\nWe printed off ads on our home printer, like two to a page with a little elf tangled up in lights. And it was like, get your lights professionally installed and you get a discount if you do it before a certain date. And Mark and I just walked around the neighborhoods and just put these on doors. I get them sometimes at my own house for tree trimmers and things like that. it brings back all these nostalgic memories that I'm just like, you know, that actually still works. So.\r\n\r\n\r\nNikolas Hulewsky (29:45.486)\r\nAmazing.\r\n\r\n\r\nYeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (29:53.218)\r\nWe have a tree trimming business that I have. That's one of the channels that we acquire customers through is door to door. Yeah, it's not big. Long story short is we launched a tree trimming business as a project to see if it would work and it worked. It's not massive. It's like a half a million dollar a year business, but it's been fun. We've learned a lot of things about home services in particular, like jobbers, the CRM that they use.\r\n\r\n\r\nAnne McGinty (29:59.559)\r\nYou have a tree-timmer- trimming business?\r\n\r\n\r\nAnne McGinty (30:17.394)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (30:19.896)\r\nHow do we acquire customers? How do we use? Anyways, a million things. It's been a really good learning experience, but it's not a massive business. yeah, yeah, totally could be, but you know, I've got ADHD. So of course it's not massive because nobody's focusing on it.\r\n\r\n\r\nAnne McGinty (30:26.313)\r\nBut it could be.\r\n\r\n\r\nAnne McGinty (30:30.997)\r\nYou\r\n\r\n\r\nToo funny.\r\n\r\n\r\nNikolas Hulewsky (30:35.34)\r\nAnyways, OK, so you had you had flyers. You parked the car. What else did you do? Did you do any email stuff SEO? my gosh. OK, when you were doing this, because I can I can tell you're a hustler and you're a tracker as well. Like you want to see what works. Which of the two channels was the most effective?\r\n\r\n\r\nAnne McGinty (30:44.967)\r\nNothing.\r\n\r\n\r\nAnne McGinty (30:55.015)\r\nWhat was the box truck? But also those flyers did work for helping us get the initial prime sort of houses in the neighborhood. So it was a combination, but once we had the job and our team was there parked for four hours to get the job done, the neighbors would come out and see the truck and they would be like, Sally is getting lights.\r\n\r\n\r\nNikolas Hulewsky (30:57.718)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (31:07.054)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (31:20.875)\r\nYeah, genius.\r\n\r\n\r\nAnne McGinty (31:21.887)\r\nSo, let me call this company too. We just really focused on customer service communication, quality and result. If anybody had a complaint, we really listened to them.\r\n\r\n\r\nNikolas Hulewsky (31:33.022)\r\nAnd those neighborhoods are so nice, it's keeping up with the Joneses-esque as well. It's like, what? Mark, Martha's put up her Christmas lights already. We need to get decorations going.\r\n\r\n\r\nAnne McGinty (31:36.639)\r\nThere's a little bit.\r\n\r\n\r\nYes.\r\n\r\n\r\nAnne McGinty (31:44.757)\r\nfeel like you should do voiceover.\r\n\r\n\r\nNikolas Hulewsky (31:46.734)\r\nI do. Here's my Donald Trump. ready? Welcome to the Trump administration. We've got the finest people. It's gonna be amazing. Or the best one I do is for my kids where, Gorsh Royce, it's time for bed. That's my goofy voice. I don't know what it is. I've always just loved mimicking people. My sister says that used to walk around the house and just like repeating words over and over and over. Anyways, that's not the point.\r\n\r\n\r\nHere's my question for you. Were you sophisticated enough at the time to have different phone numbers for the flyer and the van?\r\n\r\n\r\nAnne McGinty (32:23.337)\r\nNo.\r\n\r\n\r\nNikolas Hulewsky (32:24.384)\r\nNo, OK, so you didn't you didn't necessarily know who was calling you from which source.\r\n\r\n\r\nAnne McGinty (32:28.533)\r\nNo, and honestly, that was probably a way that we, you could say it was a failure, maybe we should have tracked that data a bit more, but it didn't really matter to us. All that mattered was that our customers were repeatedly booking. So we were aiming for an 85 % retention rate. And as long as we were getting an 85 % retention rate, that to us was a signal that we're priced right, and we're doing a good job.\r\n\r\n\r\nNikolas Hulewsky (32:55.63)\r\nWhat's crazy to me is that you launched this business in August. It's a Christmas business. When are you done hanging lights? You take them down as well? Is there a fee? Okay, okay. they pay. Okay. But you probably had all of your money by like the first week of December?\r\n\r\n\r\nAnne McGinty (33:03.669)\r\nYeah, yeah, yeah, that was all part of the package. Nope, all included. Yeah.\r\n\r\n\r\nAnne McGinty (33:13.907)\r\nI mean, you'd like to think so, but no, people sometimes wouldn't pay on time. We would sometimes, the last date I believe we ever installed lights and over those 13 years was around December 17th. That was really late.\r\n\r\n\r\nNikolas Hulewsky (33:27.852)\r\nWow, that's really late. Okay. The point I'm making though is that like the time between launch in August and like your business being done is like four months. That year, that year, that year. Yeah. So you had no idea necessarily what to expect. So you go from, let's do this thing. We launched in August and then by December, let's just say December 15th, you're sitting there and you're like, holy crap, Mark, we have $150,000.\r\n\r\n\r\nAnne McGinty (33:39.635)\r\nWell, yeah, so we launched in August. yeah.\r\n\r\n\r\nAnne McGinty (33:57.715)\r\nWe literally had that conversation. Like it was Thanksgiving and we had tallied up how much the season was gonna make and we were beyond ourselves. Like we were that overwhelming feeling inside where you're just like, Like we just, you just really wanted to like shout it from the rooftops like, holy crap. Like this is more, it was so much money to us at the time.\r\n\r\n\r\nNikolas Hulewsky (33:57.718)\r\nOkay, we gotta mix it. Yeah.\r\n\r\n\r\nAnne McGinty (34:24.789)\r\nRemember, it took me six months to save $1,000. So to make that in a lump sum was incredible. And then when the season wrapped up, so even though it may take longer to put the lights up, the lights were down by January 6th. And we went overseas for four months and we rented out our apartment. And so we hardly had any expenses because we were in Southeast Asia and we went to Nepal and just had a lot of time to reflect.\r\n\r\n\r\nNikolas Hulewsky (34:24.939)\r\nYeah!\r\n\r\n\r\nNikolas Hulewsky (34:39.372)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (34:52.846)\r\nBecause how old were you at this time? You were what, 26, 27? Yeah. Do you have kids? No kids? Okay, you have kids now. But yeah, no, my wife and I, we didn't have kids for probably, I think the first six years we were married, I'd have to go back and like actually do the math. But yeah, we waited a little while and $100,000 with no kids. I mean, it's like you're a king or queen.\r\n\r\n\r\nAnne McGinty (34:55.377)\r\nAround that, yeah.\r\n\r\n\r\nWe do now. We do now. Yeah.\r\n\r\n\r\nAnne McGinty (35:05.876)\r\nYeah.\r\n\r\n\r\nAnne McGinty (35:13.746)\r\nI know.\r\n\r\n\r\nAnne McGinty (35:17.297)\r\nIt opened up again just more opportunity. But we really delayed gratification. So we looked at that money as opportunity, not as money to spend. Yeah.\r\n\r\n\r\nNikolas Hulewsky (35:26.19)\r\nYou rolled it again. I made the joke earlier, the BRRR method, which is this like really real estate centric method where people buy a home, they rehab it, then they refinance it, right? So it's like, I bought it at 50, I put 20 into it and I rehabbed it. I'm gonna go refinance it, cause now it's worth 120. And so they go and pull out, yep, they cash out refi and they pull whatever, 70 % of that loan to value. And then they repeat, that's the BRRR method. Buy, rehab, refinance, repeat.\r\n\r\n\r\nAnne McGinty (35:37.299)\r\nMm-hmm.\r\n\r\n\r\nAnne McGinty (35:43.355)\r\nTake the cash out.\r\n\r\n\r\nAnne McGinty (35:51.114)\r\nYeah.\r\n\r\n\r\nYep.\r\n\r\n\r\nNikolas Hulewsky (35:55.35)\r\nYou were doing that, but it wasn't the burn method because it wasn't just real estate. was like, okay, it just rolls to the next thing. We put the next amount on black. We just keep doubling down on these things.\r\n\r\n\r\nAnne McGinty (36:02.398)\r\nYeah.\r\n\r\n\r\nAnne McGinty (36:06.107)\r\nYeah, stocks or saving for another down payment. Once we started having kids, we started saving that money for another down payment because we wanted to get out of the city.\r\n\r\n\r\nNikolas Hulewsky (36:15.694)\r\nOkay, tell me the first, if you remember the first five years worth of revenue for the tree, tree, keep saying tree, Christmas lighting business. So year one, 150, what was your two?\r\n\r\n\r\nAnne McGinty (36:26.965)\r\nProbably close to 300.\r\n\r\n\r\nNikolas Hulewsky (36:29.09)\r\nOkay, year three.\r\n\r\n\r\nAnne McGinty (36:30.869)\r\nProbably around 500.\r\n\r\n\r\nNikolas Hulewsky (36:33.398)\r\nOkay, year four and five.\r\n\r\n\r\nAnne McGinty (36:35.803)\r\nThis is where my memory starts going. 750, 950.\r\n\r\n\r\nNikolas Hulewsky (36:42.51)\r\nThat's crazy. All right, so I'm just doing the math with like 500. So 500, if you had 85 % customer retention, then you're looking at, what is that, 425.\r\n\r\n\r\nAnne McGinty (36:49.416)\r\nYeah.\r\n\r\n\r\nAnne McGinty (36:54.301)\r\nYeah, so we really focused on keeping our customers.\r\n\r\n\r\nNikolas Hulewsky (36:57.76)\r\nYeah, you weren't necessarily adding a ton. Do you need him? Go. OK, so you weren't. It's fine. We can always edit this. So you weren't necessarily focused on like I got to get way more people in the door. It was like, now let's just keep the pie that we have and grow incrementally every single year.\r\n\r\n\r\nAnne McGinty (37:03.143)\r\nI do. I'll get them in a second.\r\n\r\n\r\nAnne McGinty (37:14.227)\r\nYeah, that was our strategy. Because to us, to maintain a customer costs a lot less than acquiring anyone.\r\n\r\n\r\nNikolas Hulewsky (37:23.086)\r\nTotally. And what was your profit? So it was it.\r\n\r\n\r\nAnne McGinty (37:26.463)\r\nmy god, the profit was so good. So good. Yeah, so good. One second, let me get that.\r\n\r\n\r\nNikolas Hulewsky (37:31.138)\r\nGo, go, go, go.\r\n\r\n\r\nAnne McGinty (37:42.581)\r\nYeah, I'm on one right now.\r\n\r\n\r\nNikolas Hulewsky (37:48.11)\r\nDo need to go? Okay. I just messaged my 1230 that I'm running late.\r\n\r\n\r\nAnne McGinty (37:48.936)\r\nNo, we're good.\r\n\r\n\r\nNikolas Hulewsky (38:00.472)\r\nSo was the business always that profitable or did it like finally come to equilibrium? Like how big did it eventually get? yeah, you can't. Okay.\r\n\r\n\r\nAnne McGinty (38:03.401)\r\nWell, it actually, was, was a, I can't talk about that, but the profit margin was interesting because when we sold the business, the business still wanted to grow. It never stopped growing, even in the recession. And I think part of the reason of that is because it's a luxury service. So you're again, working with high net worth individuals, their disposable income doesn't really get that impacted when these downturns happen.\r\n\r\n\r\nNikolas Hulewsky (38:28.503)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (38:31.982)\r\nYeah, and if you had gone to maybe some other neighborhoods, that's probably a disposable good that they're like, hey, it's recession, we're cutting this out. But for the wealthy, they're not cutting that out.\r\n\r\n\r\nAnne McGinty (38:38.869)\r\nRight. And the wealthy, they don't want to appear to their neighbors like they're having a bad year. Yeah. So there was a little bit of that psychology, but not a ton. the profit margin, as we grew, the profit margin did decrease a little bit as we started hiring more and having to get more trucks and had to get workers compensated, all the things, right? And when we sold it though, we still had a very good 50 % net profit.\r\n\r\n\r\nNikolas Hulewsky (38:44.578)\r\nLike they don't have money.\r\n\r\n\r\nAnne McGinty (39:09.599)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (39:09.614)\r\nOkay, why did you sell? I mean, you're sitting here, it's a business like printing money. It's a 50 % profit margin.\r\n\r\n\r\nAnne McGinty (39:15.709)\r\nYeah, we sold, I know it was such a good business. We sold because we saw COVID was coming and we thought if COVID happens, lot of our businesses, a lot of our commercial business won't be able to put lights up because there are places where people gather. So if that happens, we're going to take a hit on the valuation. we committed to, it'll be another five years minimum.\r\n\r\n\r\nthat we could exit this if we don't sell now. And we had been so diligent about setting aside a lot of the net profit and investing and creating passive income channels and then got the valuation for the business and thought, if you add that to the pie, then...\r\n\r\n\r\nWe had all these strategies. I don't know you like spreadsheets or not, but I'm kind of a, I love spreadsheets. my God, I geek out on this spreadsheet that I made because to me I was like, that is just beauty. Look at that. you look at it like inflation plus a 5 % return as like a base, you know, I was looking at the numbers and I just was like, if we live off of this, which has been our annual expense for so many years, like I know what we cost to live, then.\r\n\r\n\r\nNikolas Hulewsky (40:24.109)\r\nUhhh\r\n\r\n\r\nAnne McGinty (40:36.605)\r\nif we don't touch that money for about seven years, it'll double. And then if we don't touch it again for another seven years, it'll just double. And it started getting to this point where it's like, so what that means is that within, I can't remember what the exact number of years was that I looked at it, but I was like, as long as we maintain that plan, then in, it was like five to seven years or something like that, we will be able to passively make what we were making from the business.\r\n\r\n\r\nanyway. And that is why it made sense.\r\n\r\n\r\nNikolas Hulewsky (41:10.798)\r\nAnd you de-risk yourself. And I call it spreadsheet porn. Because you're like, you're just like, for me, it's terrible. I get sucked in. It's honestly, honestly, it's one of my biggest weaknesses. It's something I'm working on this year. Before the call, I talked to you about like, I like to track the metrics, right? I'm like, oh, where am I at? And it's, there's no point to it. Like I spend so much time worrying about, okay, what changed? is there an inflection point? But whatever. It's like, have you ever seen the meme wit?\r\n\r\n\r\nAnne McGinty (41:12.414)\r\nYeah.\r\n\r\n\r\nAnne McGinty (41:16.283)\r\nYou\r\n\r\n\r\nAnne McGinty (41:25.813)\r\nI\r\n\r\n\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (41:40.414)\r\nor not meme wit, mid-wit meme where it's a bell curve. And so on the one side of the bell curve is a caveman who's like, all we have to do is provide good service to people. And then the middle is like a tech guy and it's like, actually, so if we have the systems correct, we'll automate everything and we can get 1 % better every single year, right? It's like the middle. And then there's like the other end of the bell curve, is the Jedi. it's like, all we have to do is provide good service to people, right? So you like learn over time, you're like,\r\n\r\n\r\nI just have to provide good service. I just have to provide a good product, et cetera. anyways, I get obsessed with the spreadsheets. And so it's a focus for me this year to like stop worrying about the data and things. So I'm there. I'm there with you. I've modeled. I know that's the problem. Cause you get in there and you're like, hmm, if I could just get 1 % of 1 % technically, that's a $10 million market. then you know what I mean? Like you just on the spreadsheet, it works. I modeled it out. It's all going to work.\r\n\r\n\r\nAnne McGinty (42:22.205)\r\nspreadsheets are so fun!\r\n\r\n\r\nAnne McGinty (42:30.773)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (42:38.606)\r\nDid your\r\n\r\n\r\nAnne McGinty (42:38.837)\r\nAnd when your modeling actually happens, it's like the best reinforcement of, right? Yeah. Yeah. Yeah. Yes. It's amazing.\r\n\r\n\r\nNikolas Hulewsky (42:43.629)\r\nSo that's what I was going to ask. Did it happen for you? It did. All right, so you're five years post now, so are you making passively what you were making in the business?\r\n\r\n\r\nAnne McGinty (42:55.665)\r\nYes!\r\n\r\n\r\nNikolas Hulewsky (42:58.722)\r\nI gotta go, I have to go make a call. This is ridiculous. No, that's awesome, that is awesome. That is really incredible.\r\n\r\n\r\nAnne McGinty (43:00.07)\r\nHa!\r\n\r\n\r\nAnne McGinty (43:05.973)\r\nIt is incredible, but I do feel like we looked to this future. We saw it. It's just kind of like how years ago, I'd say like eight, 10 years ago, I started saying to myself and also my husband or whoever, like, when we own a house in New Zealand, not if, when, you know? And so that will happen. And it's always been that way. So I just, I know...\r\n\r\n\r\nthat these things will happen because you also kind of like see the vision for the future and you do some of that spreadsheet modeling. it does help you sort of, yeah.\r\n\r\n\r\nNikolas Hulewsky (43:43.81)\r\nYeah, totally. mean, people talk about it in the woo-woo way of manifesting, putting it out to the universe. But the thing is, it is true, right? Where your mind is, is where your future ends up being. So what I'm focused on, what my goals are, you're much more likely to hit them if you're articulating them and putting that out there into the world. If you're constantly thinking like,\r\n\r\n\r\nAnne McGinty (43:51.357)\r\nRight. Right?\r\n\r\n\r\nAnne McGinty (44:01.982)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (44:10.56)\r\nI'm never going to be as smart or I'm never going to be as successful or this would never work. It's probably not going to work because your mind is already of formatted things. Do you regret selling?\r\n\r\n\r\nAnne McGinty (44:16.415)\r\nTotally agree.\r\n\r\n\r\nAnne McGinty (44:24.797)\r\nI don't regret selling because the business was at a point where it also wanted to continue growing. And I did not at that time have the skill set to double it. So I lacked experience and didn't realize I could have just maybe tapped the insights of another mentor or entrepreneur who had done that before. I was getting stressed out by the size of the team, which just...\r\n\r\n\r\nNikolas Hulewsky (44:36.808)\r\ngood for you.\r\n\r\n\r\nAnne McGinty (44:50.133)\r\nkind of feels like the size of a family. Like you end up caring too much about the social dynamics, or I did at least. And I don't regret it for that reason. I think we miss elements of it, but no. 20 people.\r\n\r\n\r\nNikolas Hulewsky (45:04.206)\r\nHow big was the team? 20 people. Yeah, so I sold a business almost two years ago. It was my home health and hospice that I grew from scratch. And I regret selling that. I was like, that thing was my baby. I had partners. So, you know, I'm a fifth partner in the business and it was a great business, but they needed to get out. They were taking down some big deals in their other business. They needed liquidity. I mean, a whole host of reasons. And so I couldn't.\r\n\r\n\r\nAnne McGinty (45:19.177)\r\nWhy'd you sell it?\r\n\r\n\r\nNikolas Hulewsky (45:33.582)\r\nI couldn't buy them out. wasn't financeable at that time. Anyways, it was what it was, but I regret selling that business in many ways just because I love that business. So I always like talking to people like, do you like the E-Sold? Do you regret it? And it's kind of 50-50. Many times there's always an element of like, yeah, I kind of regret selling it because I miss the people or I miss the business or I miss the environment. It's not necessarily, yeah.\r\n\r\n\r\nAnne McGinty (45:36.872)\r\nHmm.\r\n\r\n\r\nAnne McGinty (45:40.774)\r\nthat's a bummer.\r\n\r\n\r\nAnne McGinty (45:59.391)\r\nThat's what my husband says. He misses the people and just being out there and having these challenging long days. There's a rewarding feeling to it. But I'm happy with where we are.\r\n\r\n\r\nNikolas Hulewsky (46:13.622)\r\nWell, and I had like this whole planned out. We were going to talk about the top businesses that you saw this year and like characteristics of successful entrepreneurs. But I appreciate you indulging me following you down the rabbit hole because this was an awesome, awesome conversation. I really don't have anything else to say. I think I think we'll just end it here.\r\n\r\n\r\nAnne McGinty (46:33.375)\r\nWell, it's funny because I had expected to talk about also just ideas for other people who want to start businesses and I've got plenty of them. So maybe that'll be another conversation.\r\n\r\n\r\nNikolas Hulewsky (46:39.907)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (46:43.63)\r\nI may have to just bring you back on. I'm going to include it in the show notes, but your podcast, if you want to come listen to you.\r\n\r\n\r\nAnne McGinty (46:51.987)\r\nYeah, it's called How I Built My Small Business and I interview experts, entrepreneurs about both their advice and their area of expertise, but also how they themselves navigated the growth of their businesses. And it's fun. It's a great place to learn.\r\n\r\n\r\nNikolas Hulewsky (47:09.228)\r\nYeah, that's awesome. All right. Well, I will speak to you soon. Stay on for a second while.",
  "metadata": {
    "duration": "",
    "date": "2025-02-19",
    "platform_source": "Google Drive"
  }
}