{
  "episode_number": "159",
  "episode_title": "From Storage Units to $52 Million: An Entrepreneur's Playbook with Nick Huber",
  "guest_name": "Nick Huber",
  "business_name": "Somewhere",
  "transcript": "﻿Nikolas Hulewsky (00:00.95)\r\nSuper serious. All right, Nick, I know a of people know who you are, but I want you to just give a brief background on who you are because I really want to get to the meat and potatoes, which is the last year, somewhere acquisition, your book coming out, all those things. But first, set us up.\r\n\r\n\r\nNick (00:15.12)\r\nYeah, first Nick, thanks for having me, man. I love your stuff. You've, uh, you've accomplished a lot and you're sharing the sharing the wisdom, is rare. So appreciate you. The, uh, yeah, man. So I graduated, started a moving and storage company, uh, learned the ropes through suffering of entrepreneurship in a tough business. Um, built a self that was in 2011, built a storage facility from the ground up started in 2015, opened it in 2017. That one deal was a massive win for me and my family and future generations of Hubers.\r\n\r\n\r\nNikolas Hulewsky (00:22.915)\r\nThank you.\r\n\r\n\r\nNick (00:45.396)\r\ngot serious about storage. bought 63 self storage facilities raised about 40 million of outside equity built a real estate private equity company and a management company. Small, dabble started, RE cost seg in 2022. that business has gotten pretty large 50 plus employees, you know, 750 K plus a month of revenue. and you know, just have picked up opportunities as they've came at me, got involved in some got involved in somewhere back in.\r\n\r\n\r\n2021 when the business was about a year old as a customer first hired a few people internationally. then I started talking about the business as an affiliate and then I bought in a year later, as a minority partner. and then I had the opportunity to buy the whole business, and in a pretty big deal for me, uncomfortable deal, in it closed on May 1 of, of last year. So yeah, here I am.\r\n\r\n\r\nNikolas Hulewsky (01:39.106)\r\nSo let me, all the companies combined, what's aggregate, top line revenue, number of employees.\r\n\r\n\r\nNick (01:44.894)\r\nthat's tough because it's changing. think if we talk about all the small ones, the, you know, eight, eight smallest ones, a total of, you know, a million a year revenue. they're all, no, some of them are stressful. Yeah. business is hard, right? but yeah, they're, they're profitable. They have a future. RE cost seg is doing 750 K a month of revenue. So if you annualize that, you know, you can kind of\r\n\r\n\r\nNikolas Hulewsky (01:49.219)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:53.942)\r\nOkay. But highly profitable.\r\n\r\n\r\nNick (02:13.168)\r\nLook at it. have Bolt Storage. Bolt Storage that's 1.3 million last month of revenue across our portfolio and somewhere did a little over 1.5 last month of revenue.\r\n\r\n\r\nNikolas Hulewsky (02:26.478)\r\nSo one of the things I really admire about you, gosh, I sound like I'm sucking up. One of the things that I really like about you is the way you started. So Chris Kerner, my business partner at Mobile Home Park guy, you and him had like a very similar origin story. He started writing on like Reddit and Quora, know, the entrepreneur threads and what they called subreddits. Yeah, yeah. And like that's where he cut his chops.\r\n\r\n\r\nAnd then he moved on to Twitter and all the other social platforms and he's grown a lot. You do the same thing, right? Like you started kind of on Reddit and then you obviously expanded out. I think the thing that's the most impressive to me is the way you've built your distribution because and I know you preach the sweaty model, but if you go to venture capital, you go to Silicon Valley, 50 % of the dollars they raise are spent on acquiring customers. And another word for acquiring customers is distribution. You went and sort of built the distribution and then decided, hey,\r\n\r\n\r\nthese are the things I'm going to bet on. Was that purposeful from the beginning or was it something where you're like a year in thinking, I guess I kind of have this audience. should figure out how to leverage the distribution.\r\n\r\n\r\nNick (03:32.73)\r\nSo nothing in my life has been purposeful. didn't, I didn't study entrepreneurship or watch Shark Tank right before I started my company. If I would have, I probably would have started a different business and I wouldn't have succeeded. I would have went and got a job. but yeah, I started, I started with a podcast called the Sway Startup first episode in December of 2018. and I had nowhere to promote it. So I started writing on Reddit. They're mean as hell on Reddit. honed my, honed my, you know, honed my skills. Moses Kagan talked to me into getting on Twitter.\r\n\r\n\r\nNikolas Hulewsky (03:54.936)\r\nDid something.\r\n\r\n\r\nNick (04:02.062)\r\nlate about a year later. And, you know, that's where I found kind of what I'm good at, which is writing. And I luckily, this, the step that everybody tries to skip, I had luckily, you know, cut my chops and actually done some things in business leading up to that. So I could, you know, share and talk about it, but, it's not the same growing an audience today. So if anybody says I want to get on Twitter and grow an audience, I'll say good luck because it's not, not for that anymore.\r\n\r\n\r\nNikolas Hulewsky (04:27.534)\r\nBut why? Tell me why. Tell me why.\r\n\r\n\r\nNick (04:29.776)\r\nYeah, I mean look the the algorithm is not the same You can't write a thread and get it seen by a bunch of people. You can't post links It's just a different platform now and it's really hard to grow really really hard to grow\r\n\r\n\r\nNikolas Hulewsky (04:43.374)\r\nYour kind of growth philosophy, which pissed a lot of people off was just all eyeballs are good eyeballs, right? I'm just a huge funnel. And then even if I bring somebody in because I tweet about the blue haired people that I hate, eventually they're going to see something of mine where they're like, this guy has some substance behind it. And then they'll move down the funnel and eventually they'll kind of make a purchasing decision. That's my synopsis taken from things I've heard you say and just my own observations.\r\n\r\n\r\nWould you say that's fair?\r\n\r\n\r\nNick (05:14.852)\r\nI think I'm a, I'm just a goofball, man. I got a weird sense of humor. I'm a pick. like, I like goofing off with my friends. And so when I can make, it just blows my mind that I can make a tweet sitting here in Athens, Georgia, on my couch, on the toilet, wherever, and somebody somewhere, somebody somewhere gets so angry at what I tweeted in 240 characters or whatever the limit is now that they get\r\n\r\n\r\nfired up and pissed off about what I tweeted. That just blows my mind. I've never read a tweet and gotten fired up enough to really get upset. If somebody has the mental instability to actually be able to read a tweet and not get fired up, I'm just going to poke that bear because it's funny and fun. The other half of that is that, look, I have, I have some unique values and unique beliefs.\r\n\r\n\r\nNikolas Hulewsky (05:59.842)\r\nYou're so good at it though.\r\n\r\n\r\nNick (06:08.912)\r\nI have a lot of liberal views. love living in a little college town with weird people and craft beer and live music. think everybody should be able to do whatever the heck they want. but I also have some conservative views about, you know, business and hard work and discipline and raising a family. And I'm not afraid if people hate that. in my opinion, you can, if you try to be loved by everybody, then you're nobody's going to give a shit about you.\r\n\r\n\r\nNikolas Hulewsky (06:32.738)\r\nYeah, you've said you've said that a lot. I mean, you definitely take sort of a Donald Trump esque playbook to it where it's like, okay, cool, I get eyeballs, but eventually people are going to get to know me and they're actually going to see me for what I am. They're not just going to take this one tweet and the people who do take the one tweet and have a perception of me like screw them. I don't sound like I care about them. I have to tell you this story. So I've got four boys under 11. And a couple of years ago, I read a tweet of yours that I started to roll my eyes at and then\r\n\r\n\r\nI actually implemented it with my family. So you were talking about your boys fighting or something like that. And you're like, whenever my boys are fighting, I pulled them aside, right? And it was like, cool. We got parent advice from, yeah, what team are you on? And so you, you said to them, guys, guys, guys, guys, what team are we on? They're like, team Huber. And at first I kind of my eyes because I'm like, okay, cool. Parenting advice from the guy who's got a kid who's six years old. But then I had implemented it with my family. I've got four boys.\r\n\r\n\r\nNick (07:11.44)\r\nWhat team are you on? What team are you on?\r\n\r\n\r\nNikolas Hulewsky (07:31.692)\r\nAnd like every time they fight now, I'm like, guys, what team are we on? We're team Huluski. Like, yeah, we're team Huluski. It's such a powerful way to shift the thinking, especially like even in your kids and with boys, right? Like boys are hyper competitive. Like they're going to fight. They're going to have issues. But at the end of the day, you want them to be on the same team.\r\n\r\n\r\nNick (07:49.102)\r\nYeah, man, you can't stop it. My, boys drive me nuts because they are not happy unless the other one's upset. it's just what, it's the way it is.\r\n\r\n\r\nNikolas Hulewsky (07:58.994)\r\nAll right, so you, you built up this profile, which was awesome. But because of the way you built it up, you you garnered a lot of hate. When you decided that you were going to take on somewhere, did you kind of regret the way that you built your profile? Were you like, my gosh, because now you're now you shifted from like, hey, I'm just kind of a private nobody, I have some small businesses to boom, $50 million acquisition. And you kind of got a target on your back like people want to root\r\n\r\n\r\nother people to lose, especially when they start coming up in the world because they're jealous. Did that ever creep in your mind where you're like, should have done this differently?\r\n\r\n\r\nNick (08:37.752)\r\nWhen I bought the company and I announced the fact that we bought a $400,000 domain name and I announced, and I announced the, you know, fact that I raised $20 million and bought it for 52 million and had those like the, shit, I thought this guy was an influencer. Now he's doing something like this. it brought in more leads to somewhere than the business could handle. It broke the entire business. Broke it. It broke it in a good way, in a bad way because we had a lot of unhappy customers.\r\n\r\n\r\nbecause our business was used to doing a million dollars a month and it did $1.6 million in May. So it broke everything. 24, right, right when I announced the acquisition. So no, there's no regret because that those eyeballs. It was it was a great thing for somewhere.\r\n\r\n\r\nNikolas Hulewsky (09:13.464)\r\nGosh. May of 23, 24.\r\n\r\n\r\nNikolas Hulewsky (09:29.966)\r\nOkay, quickly, just give a broad overview. What is somewhere, how big is it, what's your core offering?\r\n\r\n\r\nNick (09:37.808)\r\nYeah, we have 160, you know, management recruiters, account managers all over the world. We structure our business like teams. So as a customer, you go into your account manager, she or he has six to eight recruiters on their team and they recruit all over the world for all different needs that your business has. One's a technical recruiter, one's an exec recruiter, one's a South African sales and customer service and finance specialist, one's in LATAM on ops marketing, graphic design, whatever it might be. And we are the growth partner of a business. So\r\n\r\n\r\nWe went, we've kind of transformed over the last year from being, we'll find you an executive assistant in the Philippines to, we're going to build you a worldwide team, whether it be a financial analyst in Egypt to a, you know, head of finance in South Africa to a, engineer in Columbia or a draftsman, AutoCAD specialist, whatever it might be. so the, the, our core offering is to build worldwide teams for companies. That's our core offering because.\r\n\r\n\r\nIt's really hard to hire Americans and you can hire phenomenal talent for $1,500 a month in other areas of the world.\r\n\r\n\r\nNikolas Hulewsky (10:43.618)\r\nI mean, I think it's just really hard to hire in general. The biggest value prop is like the ROI that you can get. If I hire for comparable position, 50 grand a year, and I can get it for 20, all of a sudden I've got more to invest in the business for the same quality at a much lower price. You said it was a career defining decision for you. Like why? You're young, like why is this a career defining decision?\r\n\r\n\r\nNick (11:10.574)\r\nI think there's a, I mean, there's this theme throughout my life that anything I've done, I've not been qualified to do. I didn't have permission to start a real estate private equity company. If I'd tried to go get a job from Sam's Zell, he would have said, no, you can't work for me, Nick. But I still went out and raised $40 million and bought a hundred million dollars for the self storage. I didn't know what I was doing. It worked. We made some good decisions. The business is in a really good spot.\r\n\r\n\r\nNikolas Hulewsky (11:25.582)\r\nThank\r\n\r\n\r\nNick (11:39.888)\r\nWhen I'm, you know, 30, 34 years old and my partner comes to me and says, Hey, Nick, I'm thinking about selling 51 % of my business to Andrew Wilkinson at a $47 million valuation. want to sell half your shares and make almost $4 million cash. And I'm like, okay, well I can get out of the best business I've ever been in. I can divest some of my shares and take a win that can build me a big house and get me a sports car, whatever. Or I can try to get more of it.\r\n\r\n\r\nAnd so I came back to Marshall and said, Hey man, want to, I don't want to sell half. And I actually want to be the one to buy your shares instead of Andrew Wilkinson. Let's make a deal.\r\n\r\n\r\nNikolas Hulewsky (12:19.47)\r\nOkay, so this is the thing I'm the most interested about. I'm not going to say I was in the same situation, but I had multiple companies. ran them in 2022, 2020. can't remember the year. Combined, we did about $30 million in top line revenue. Call it $3 million in bottom line.\r\n\r\n\r\nNick (12:37.904)\r\nIt's really similar to my portfolio size, yeah.\r\n\r\n\r\nNikolas Hulewsky (12:41.166)\r\nYeah, so but at that point I was like, I grew up exceptionally poor and I had some opportunities right before rates started going in. I kind of freaked myself out and I was like, rates are going to rise asset values going to come down. I better sell while the selling is good. And so I sold my medical billing company and I had selling my home health and hospice company and I'm super grateful for it because like quote unquote secure the bag. And like you said, generations of Huliski's will be grateful for that opportunity. But I've gotten to this place now where I'm like, OK, well now what?\r\n\r\n\r\nAnd I'm thinking a lot about what's my next big swing going to be? Cause I'm still, I'm almost 40, but I'm still young. I can do a lot. And I think there are a lot of entrepreneurs who are leaving, listening to this and thinking, yeah, how do you, what is my next swing going to be? How did you decide? Like, what were you seeing within somewhere that you were like, okay, cool. I got a nice, nice lifestyle business. I'm making maybe call it a million dollars a year. I'm going to risk it all, pushing it all on black. And I'm going to go all in on somewhere.\r\n\r\n\r\nNick (13:38.128)\r\nI, I know that somewhere has the potential if well managed to be a, a $52 million valuation company, but a, but a, a massive company. I'm talking hundreds of millions of revenue. It's that kind of potential, that kind of market.\r\n\r\n\r\nNikolas Hulewsky (13:56.044)\r\nWhy like what what about it were you seeing that you're like, it's currently 52. Like what what what revenue was it doing at the time you said it did $1 million in the month of May, but it was doing\r\n\r\n\r\nNick (14:03.97)\r\nabout a million about a million a month of revenue when I acquired it when I made the deal to\r\n\r\n\r\nNikolas Hulewsky (14:07.606)\r\nOkay, so is it was a $12 million top line business. Let's say it was really profitable and you're doing $5 million bottom line. I don't know. I'm just guessing. It's a 10x multiple $50 million business, right? As kind of the ballpark that we're playing in. Was was it because it was growing so quickly? Were you like, we're experiencing 20 % month over month growth? Or was it just you're seeing this massive trend in outsourcing talent? Like, what was it exactly that for you is the catalyst?\r\n\r\n\r\nNick (14:14.64)\r\nYeah.\r\n\r\n\r\nNick (14:34.64)\r\nYeah. So it was a, it was a three and a half year old business that was doing a million a month of revenue was growing exceptionally fast. Um, and I just saw what it did to my business. I went from a mindset as an entrepreneur in 2020 of, everybody on my team is in America. Every single person to hire somebody new and to grow my business takes $50,000 a year. And that's for an entry level person to hire an executive. God forbid if I can afford them, it's $150,000 a year.\r\n\r\n\r\nI went from that to being able to make five hires who are specialists for the same money. And when you can do that, the growth, changes, it just changes everything about how you think about business. If you can manage these people, like, look, there's difficulties. If you can manage them, if you can, you know, keep track of everything, if you can really make sure that everybody's productive inside your business, it's a total game changer. And I know it's not going to get easier to hire Americans. I know that.\r\n\r\n\r\nNikolas Hulewsky (15:29.152)\r\nWhy do you think no one's built a hundred million dollar overseas talent company yet? Tell me about it.\r\n\r\n\r\nNick (15:34.34)\r\nThey have, absolutely. hell yeah. Athena, Athena's doing 60 million ARR, probably worth a half a billion if they went public. They just do only executive assistance.\r\n\r\n\r\nNikolas Hulewsky (15:43.95)\r\nOnly executive assistants.\r\n\r\n\r\nNick (15:48.592)\r\nIn the Philippines, they're not doing any team building. They're not doing any corporate accounts. I mean, we have shifted our focus over the last year to, literally helping companies build their entire teams. And we're going to do with five different clients this year, we're to do more than 30, hires, 30 hires for them. We're going help them build their entire company. That only goes up as you start building teams. So yeah, there's, there's many, many BPO's, um, you know,\r\n\r\n\r\nYou know, we're going to build a full team for you. We're going to put them in an office business, business, business process. Outsourcing means like we're going to take a function of function of our company and put it in an office in the Philippines. If you go to Manila, there are high rises full of BPL organizations that are the middleman between Visa, MasterCard, Apple, and, these call centers. And many of them, many of them are worth a hundred million dollars plus. Oh yeah. It's a big, big business.\r\n\r\n\r\nNikolas Hulewsky (16:19.224)\r\nWhat's a BPO, business partner organization?\r\n\r\n\r\nNikolas Hulewsky (16:39.405)\r\nReally?\r\n\r\n\r\nSo did you just see, I'm able to differentiate because I have a distribution channel. It's like, okay, this is a known thing. There are already companies this size. We're growing exceptionally fast. I've got the experience from it because I know how much it's revolutionized my business. And I have the distribution channel. Like with those kind of the components that got you to a place where.\r\n\r\n\r\nNick (17:02.308)\r\nYeah, that's exactly it. Like, look, this is a good business. This is a good business model. I'm a good operator. I can grow this thing. And over time, if I make good decisions and I build the right team, this can be not a, you know, not a million dollar a month business, but a $10 million a month revenue business.\r\n\r\n\r\nNikolas Hulewsky (17:17.262)\r\nSo when you found out Andrew Wilkinson was looking or sniffing around the business or had made an offer, I don't know kind of where the process was.\r\n\r\n\r\nDid you know that Marshall was like in the mode of selling or was this news to you?\r\n\r\n\r\nNick (17:29.786)\r\nThat was the first, that was the first time when he called me and said, Hey, Nick, we need to talk. He said, I got, I got some to talk to you about. I'm I had a, the first thought came to my head is like, Holy shit. Did he get an offer to sell? but when he called me, it was the first I'd heard that he was even interested in selling should have. Okay. Late October, 2023.\r\n\r\n\r\nNikolas Hulewsky (17:45.25)\r\nWhen was that? Like, when did you get that call?\r\n\r\n\r\nSo we're talking like six months in between when you got that call and when you closed in May or late April, the the close was. How did you go from a forty seven million dollar valuation to fifty two million? Like what? How did that work? Huh? is that is that how these are value just off of top line? Because bottom line so good.\r\n\r\n\r\nNick (17:54.64)\r\nYeah, April 30th, May 1st,\r\n\r\n\r\nNick (18:03.088)\r\nRevenue went up as we negotiated the\r\n\r\n\r\nNick (18:10.734)\r\nNo, no, like I, I valued the company on what was money it was making. It made more money. Like it between October, between October and January. Tale, like the business kept growing. Yeah.\r\n\r\n\r\nNikolas Hulewsky (18:24.206)\r\nDo you feel like you paid a premium for it? Or do you feel like it was baked in it like it was market price? Because some people would look at it and be like, hey, look, like why are you drinking your own blood? You built this company off and I'm not saying you are no Marshall is a part of it. But a lot of the distribution was built off of you posting about it and driving people to it. It's like, okay, you built this company, why now pay a premium valuation for it?\r\n\r\n\r\nNick (18:31.428)\r\nNo, I've\r\n\r\n\r\nNick (18:49.2)\r\nI think starting from scratch was not something I was interested in. It's been a great deal. I don't regret a thing that tells you anything. Yeah.\r\n\r\n\r\nNikolas Hulewsky (18:56.628)\r\nThat's awesome. How did you go through? All right. like I said, kind of similar situation to you. The most money I've ever raised. How much should I raise? Let's just call it made seven figures, five million, six million, somewhere in that ballpark from investors. You had to go and you probably raised more than that because you were buying these large real estate deals and that just takes more capital. But for an enterprise like a business, five or six millions of most average.\r\n\r\n\r\nNick (19:10.458)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (19:26.506)\r\nhad to raise $20 million for this, then you had to take out sounds like about $10 million of debt from what I've done in the bit of research I've done. Did that?\r\n\r\n\r\nNick (19:28.688)\r\nYeah.\r\n\r\n\r\nNick (19:34.914)\r\nI borrowed 9.9.3 8 million from Marshall as a seller note directly to me. 18, 18 % of the company I borrowed from Marshall to me. and it's backed by the business itself. So, it's not, it's not like a personal guaranteed loan. didn't give me any cash. He gave me the equity and he holds that equity as collateral to the loan itself.\r\n\r\n\r\nNikolas Hulewsky (19:39.982)\r\nso that's the debt financing.\r\n\r\n\r\nNikolas Hulewsky (19:44.835)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (19:56.525)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (20:00.543)\r\nDid you go to Andrew Wilkinson and be like, hey, look, man, I know you're going to buy it, but would you rather just help me fund it? Or at that point, was he like, that's not a.\r\n\r\n\r\nNick (20:06.286)\r\nYeah, I tried. I tried to get him to invest in at that point. He thought that AI was going to kill the business and he had no interest in investing.\r\n\r\n\r\nNikolas Hulewsky (20:14.44)\r\nWow, okay, so you go, you raise 20 million and then you do this seller note. Did you sign any personal guarantee?\r\n\r\n\r\nNick (20:19.013)\r\nMm-hmm.\r\n\r\n\r\nNo, I put, so I, I needed almost 30 million to buy 57.25 % of the business from Marshall and, Joe, or the two founders. I was trying to organize an orchestrated system where it was worth it for me and the carrot at the end, meaning I get all my investors paid back. The business grows. I own as much as possible of this company. I already own 12.75%. I needed to my private equity tranche, meaning the\r\n\r\n\r\nNikolas Hulewsky (20:29.581)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (20:37.442)\r\nMm-hmm.\r\n\r\n\r\nNick (20:48.304)\r\n20 million in cash that I gave Joe and Marshall was 39.25 % of the business. Um, I needed to raise that in private equity and I could only get a promote on that. Meaning I get everybody their money back. I'm going to get 20 % of the ups basically. So I raised, I raised all that money giving there's no pref, there's no fee. It's just, they get every bit of cashflow from that 39.25 % of the business until they're made whole. And then above that, if they invested less than a million bucks, I get 30 % ups. If they invested a million or more.\r\n\r\n\r\nNikolas Hulewsky (21:02.114)\r\ninteresting.\r\n\r\n\r\nNick (21:17.904)\r\nI get 20 % ups. So I raised from 39 people, an average of over 500 K per person. A couple of big fish came in to invest. I was, it was super stressful. I went out and pitched them all on how to do this. had no investment bank working with me. I hired my own attorneys to put all the documents together to orchestrate this deal. And I set up a deal where if this business grows, I'm going to own about 34 % of the company.\r\n\r\n\r\nif get everybody paid back.\r\n\r\n\r\nNikolas Hulewsky (21:48.878)\r\nOkay, so you've got 12 and a half percent of the time you need to raise the. Okay, and then you need to raise another 20 million to buy the 39 % out. I'm just rounding here. And the way that it currently works is that $20 million. Every bit of cash flow that you distribute goes to those investors first until they get their money back. And then there's like a pro rata split of depending on how much they put in either 30 % or 20 % to you and then the rest of them. Okay.\r\n\r\n\r\nNick (21:52.516)\r\nWell, 75.\r\n\r\n\r\nNick (22:15.834)\r\nYep. Yep.\r\n\r\n\r\nNikolas Hulewsky (22:18.254)\r\nI've been thinking about a lot this I've been thinking a lot about this because I'm kind of toying with the idea of raising some money and and going bigger in the healthcare space, buying a larger acquisition. And one of the things that I like constantly think about is anytime you're raising money, you're giving up control. And for me, that's what's always freaked me out about raising money is like, expectations go up and you lose control. Are you able to\r\n\r\n\r\nNick (22:42.991)\r\nI didn't lose any control. I control everything.\r\n\r\n\r\nNikolas Hulewsky (22:46.646)\r\nSo there's like decision making control, right? But well, I guess let me ask. There are no.\r\n\r\n\r\nNick (22:51.13)\r\nThere's these two trunks. They're both LLCs. They both have different promotes, That bought in under million dollar investors, the over a million dollar investors with the different promotes. I own all the common shares of those. They own the preferred shares. The preferred shares get the cashflow first until they're made whole. And then most of the cashflow after they're made whole, but the common shares vote. I own those. they have no voting rights. They have no recourse. They just get\r\n\r\n\r\nNikolas Hulewsky (22:55.086)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (23:03.843)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (23:11.98)\r\nSo they have no recourse.\r\n\r\n\r\nNick (23:19.589)\r\nall the cash flow into their hole from that entire tranche. Yeah.\r\n\r\n\r\nNikolas Hulewsky (23:22.144)\r\nWow, man. How did you orchestrate that? Most investors are going to be like, nah, I want some type of record. I want a board seat or I want, you know, something to say like if Nick's royally screwing this up, I can get him out of there.\r\n\r\n\r\nNick (23:32.686)\r\nYeah, that's the, that's the good thing about having the network that I had from raising, you know, 40 million across all my real estate, you know, investments and knowing how to do it and having a really good plan when I bought the company so that when I got on these meetings, I'm like, Hey, look, we're going to grow this business. It's going well. Here's what I think we can do. Obviously nothing here's guaranteed and you're going to get all the cashflow and 80 % of the upside, but you're going to have no say and I'm going to control this thing. And you're riding along with me.\r\n\r\n\r\nNikolas Hulewsky (24:01.742)\r\nwith those in that you said it was super stressful as you're like talking to people trying to close this deal. Was it ever stressful because of social media? Like was it ever stressful because you were? I don't know. Were they saying, hey, I'm not interested because you tweet too much or you're too open or I'm worried about some key man risk because if you do something really stupid because you're so closely associated with it, the value of the business goes down like was has that been a part of those conversations at all?\r\n\r\n\r\nNick (24:29.776)\r\nLook, a lot of people said no. Like I, I, I approached, I, I approached 500 people to ask about this investment and 39 said yes. So, um, yeah, look, there were a lot of things people didn't like about the business. People said you're just a contingency based recruiting firm. People said you're paying too much. People said, um, I don't have a board seat. People said you're not putting in enough of your own cash. You're, not making a big enough investment at the beginning. Other people said that didn't matter, but I found 39 people who.\r\n\r\n\r\ntrusted me and the vision and raise the money. And I'll warn you that once you go out and raise that capital to make a deal like this, the stress is just on a different level. The pressure is on a different level. If was all my money, if it was all my money, if it was all my own money, I'd feel one way about it. And I'd be like, okay, let's see what happens here. When other people's cash is on the line, for me, it's more scary.\r\n\r\n\r\nNikolas Hulewsky (25:12.237)\r\nIn what way?\r\n\r\n\r\nNick (25:26.222)\r\nI don't know. People say, it's just other people's money. We don't care. For me, I would rather go bankrupt myself. I'd rather go Nick Huber, go bankrupt, go get a job, start over, build from scratch. Then this deal goes sour and me lose $20 million of other people money.\r\n\r\n\r\nNikolas Hulewsky (25:29.07)\r\nYeah, have you ever?\r\n\r\n\r\nNikolas Hulewsky (25:40.376)\r\nHave you ever heard someone say like, OPM, other people's money? I that's a defining characteristic of someone who's going to be successful entrepreneurs. Yeah, if you feel like, well, other people's money, it's probably not the person you want in a leadership role or as an entrepreneur. But if you are as\r\n\r\n\r\nNick (25:43.664)\r\nYeah, that's not how I feel.\r\n\r\n\r\nNick (25:56.624)\r\nI don't know anybody who truly feels that way. The reputational risk, just people work freaking hard for their money, man. They're trusting me with their cash. That's, I don't know, know, that's an intense blessing.\r\n\r\n\r\nNikolas Hulewsky (26:15.374)\r\nI did I agree with that I've had moments over the last two years where either you know, people wanted me to invest or I invested and I lost some money and like comments are made about. Oh well, you know, yep stuff happens like oh yeah, you lost your money almost like it's flippant and my response is. Because they don't understand it, but my response is like I don't think you understand how hard it is to accumulate. $100,000 half a million a million $10 million to put into a deal.\r\n\r\n\r\nIt's, it's really hard if everybody could do it, they would have done it. And then to put it into something thing, you're going to get a return and it goes belly up. Like, that's a big deal. Now I got to go talk to my wife and let her know, or I got to go look in and make sure that our portfolio is balanced the way that I want it to be like, it's not just, well, you had some money to burn. So you're fine. You lost that investment. It's like, no, you don't understand the\r\n\r\n\r\nNick (27:07.26)\r\nYeah, maybe that's how the crypto world feels about it, but I don't know any private equity owner who raises other people's capital to buy real estate or businesses or whatever that doesn't feel like very serious responsibility that comes with that.\r\n\r\n\r\nNikolas Hulewsky (27:23.458)\r\nWhat did you think of Andrew Wilkinson's critique about AI ruining the space? Because I have the same concerns. I'm playing with operator deep research. I'm in the weeds with AI right now. And I'm like, man, this is some really good technology.\r\n\r\n\r\nNick (27:37.294)\r\nYeah, I'm following. I'm taking it very seriously. I'll bet I'll push it aside and talk down to it on Twitter all day, but, I would, I would be pretty foolish to like Andrew Wilkinson is a great friend of mine, a mentor. Him and I are close. I would be foolish not to listen to a guy who's smarter and more experienced than me. I'm not that, I'm not that arrogant. my general thoughts are I'm watching it closely. I am afraid of it.\r\n\r\n\r\nNikolas Hulewsky (27:45.225)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (27:59.374)\r\nWhat are your thoughts on it? Give me some of your thoughts.\r\n\r\n\r\nNick (28:07.202)\r\nIt's on my radar closely, but it's nowhere near close enough to actually replace a human being today. I'm, I know because I'm trying to implement all these tools into my company, the demos, the demos are amazing. They're wow. Factors. Amazing. You get in and watch it work. And you're like, son of a bitch. This is a pain in the ass.\r\n\r\n\r\nNikolas Hulewsky (28:22.678)\r\nYeah, it's a really cool efficiency gain. Like it's you're able to turn one employee into maybe 1.5 or two employees. And for some specific positions, you're able to outsource it. But yeah, I'm in the same boat. I don't I don't see it yet getting to the place where it can actually take a full time employee position. I mean, there some cool things. After hours answering services. That's been really cool. I've seen AI answering calls and then redirecting those calls. But not yet.\r\n\r\n\r\nhave I seen it actually replace people? Deep research is the closest I've seen to like, this is like an entry-level analyst, but I still have to do all of the work in order to produce the outcome.\r\n\r\n\r\nNick (29:02.928)\r\nI've had friends who say like, Nick, you got to watch this and they'll pull up their phone. They'll start talking to their AI. And at the end of the conversation, I'm like, that was the dumbest thing I've ever just listened to. Andrew, I love Andrew. He pulled up his phone on Twitter and he started talking to his AI that he built about making a reservation. I'm like, nobody would put up with that. I don't.\r\n\r\n\r\nNikolas Hulewsky (29:11.679)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (29:22.095)\r\nI saw I saw that video. I was like, dude, is he in a hostage situation?\r\n\r\n\r\nNick (29:24.354)\r\nElon, Elon pulls up. Elon is talking to Joe Rogan on February 28th episode and he starts talking to his AI for, and I'm like, guys, the wow factor's here, but ain't nobody wanting to do this. And in my storage business, every phone call is worth 500 bucks. Ain't no way I'm trusting AI to answer the phone. In a roofing business, every phone call is worth 600 bucks. Ain't no way we're trusting AI to answer the phone.\r\n\r\n\r\nNikolas Hulewsky (29:50.764)\r\nThis is this is the way I think about it right now. I think people are seeing. The opportunity of AI right these things come out and you're like my gosh AI can answer this question and quickly you go to the end state where if AI is basically what we hope Siri would be when it first came out. But if AI can produce this report for me quickly, man, I'm going be able to replace a full time employee, but it's the last like mile that's the hardest to actually implement. And so I think those people get really, really excited.\r\n\r\n\r\nabout the opportunity where I think people, and I'm not saying like you, I'm not saying you, but potentially like you who are like, call me when it's ready. I do think that when it's adopted, it's gonna be adopted very quickly and there's gonna be an arbitrage for six months, maybe a year, because people have been up to speed with it. And then once it's finally game time, they can implement it because they've been thinking about how do I put this process into place? Where would I actually plug it in? What's the software I would use to track usage? Who would I replace? How would I implement the SOP?\r\n\r\n\r\nto train the AI and then everybody's gonna catch up, right? But there's gonna be this kind of year time where they can still charge old prices with new efficiency until the new prices catch up with the new efficiency. It's sort of my thinking.\r\n\r\n\r\nNick (30:59.856)\r\nYeah, like we're building, we're building an AI training module. That's an add on it somewhere for every new hire. Like at the end you pick somebody and they're like, and then we say, for 500 bucks, do you want us to put them through a two week intensive AI training and make them 50 % more effective at their job? You're pretty silly to say no to that. Um, so yeah, look like I think the main, the main hesitance of hiring internationally is the language barrier. They can't quite speak and they don't quite understand our culture. Like us as well as us.\r\n\r\n\r\nSouth Africa is a game changer when it comes to that, by the way, building literally executive teams at all my companies in South Africa. But AI is going to help these folks with the things that they struggle with most. in a way, in a way, like when the lawnmower was invented, it didn't put the lawn care companies out of business. It actually helped them make more money and be more effective. I'm going to be on the cutting edge of AI. And when it's ready, we're nimble. We make decisions quickly. We're good operators. So I'm optimistic.\r\n\r\n\r\nNikolas Hulewsky (31:54.968)\r\nSo yeah, I totally agree. I think nobody knows what's gonna happen. People think they know what's gonna happen, but ultimately we don't.\r\n\r\n\r\nNick (31:55.568)\r\nBut I don't know what's gonna happen, man. I don't know what's gonna happen.\r\n\r\n\r\nNick (32:03.088)\r\nI've been listening to Elon Musk tell me full self-driving is coming the next year for 20 years now. What he does for humanity is amazing, but these tech enthusiasts need to shut their computer, go outside and touch some grass sometimes.\r\n\r\n\r\nNikolas Hulewsky (32:19.534)\r\nHow it's been a shift for you to go from, all right, I've got these smaller companies to now you've got to hire executives. You hired Zach Prince at Ari Kossig, which dude, when you you pull that hire, like blown away just because he's so high caliber and you can like, write him off and say, well, he was crypto and his company went bankrupt, whatever. The dude was a billionaire for a period of time and built a company that was worth billions of dollars.\r\n\r\n\r\nBlockfire. Like, I don't, I don't care what ended up happening. He didn't commit fraud, right? But that's incredible. You went out and snagged him. You got him. You then go take down somewhere, you know, 50 plus million dollars. And you've hired and I can't remember his name, but you've hired an operator to be the CEO of that company as well. Talk to me about the shift to go from I'm sweaty startup guy to now I'm you know, air conditioned white collar guy.\r\n\r\n\r\nNick (33:13.902)\r\nIt's really, really hard and it'll humble you hiring executives. Like I thought a year ago that I knew a lot about business and hiring. I have gotten, I've been humbled. I've learned a ton and I'm, I am better, but I realize now how much I have to learn about building teams and scaling companies, hiring executives and people to lead divisions of your company. It's hard, man. It's hard, hard, hard. It's very rare. It's very rare for somebody to be able to get into a meeting.\r\n\r\n\r\nNikolas Hulewsky (33:39.736)\r\nMorn a lot.\r\n\r\n\r\nNick (33:43.46)\r\nGo into a meeting, figure out what's happening incorrectly, spot it, think of a solution, and then tell everybody that solution. Even the executives that I hire one in 10 can actually do that. Like I feel like I can do that. So that's not, that's not me bragging. It's just hard. It's hard.\r\n\r\n\r\nNikolas Hulewsky (33:58.882)\r\nYeah, or-\r\n\r\n\r\nNikolas Hulewsky (34:04.046)\r\nor to go into a meeting spot where something is wrong and get everybody who's in that group, the decision makers to come together and like as a group, identify a solution that it's a very different skill set. That's why I always roll my eyes. I roll my eyes. I laugh when I see new entrepreneurs who are like, yeah, I'm going to buy a business and I'm going to hire an operator. I'm like, you have no idea. First of all, business isn't big enough for you to quote unquote hire an operator. Second, it's a totally different skill set operating a business and then managing managers.\r\n\r\n\r\nNick (34:33.252)\r\nYeah. So Zach Prince left by the way, and we're hiring CEO, COO in South Africa. Yeah. His last day, his last day was February 23rd.\r\n\r\n\r\nNikolas Hulewsky (34:38.326)\r\nNo way. Are you good?\r\n\r\n\r\nNikolas Hulewsky (34:45.27)\r\nI'm assuming, are you meeting this executive team in Africa? Like, are you actually going to fly down and meet them?\r\n\r\n\r\nNick (34:51.614)\r\nyeah, got a trip on trip on the books. Yes. But look, the Zach Zach is a stud, still a great friend of mine. He got an offer that he could not refuse opportunity from his previous network. And he also did amazing things with Ari Kostek in the one year that he was CEO. but when he left, we decided, Hey, we're going to build this entire company. We're going to build this entire company internationally, including executives.\r\n\r\n\r\nNikolas Hulewsky (34:54.35)\r\nThat's pretty cool.\r\n\r\n\r\nNikolas Hulewsky (35:00.301)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (35:14.988)\r\nThat's how I mean, how can you not especially like not only have you taken this big bet on somewhere, but you've also seen, hey, I know what works and I know what kind of value this is going to provide us. It's a competitive advantage.\r\n\r\n\r\nNick (35:25.676)\r\nI can hire and I've done it. I've hired a head of sales at Bolt Storage in South Africa for $4,500 a month base who has built revenue teams and was a CRO at his previous position. Hired a head of finance at Somewhere in South Africa who was a controller of a 600 person company.\r\n\r\n\r\nNikolas Hulewsky (35:32.526)\r\nCheers.\r\n\r\n\r\nNikolas Hulewsky (35:43.788)\r\nWow.\r\n\r\n\r\nNick (35:44.432)\r\n$5,000 a month. I've hired my rev ops specialist who is a HubSpot wizard. And one of the best operators I've met is an Indian South African guy named Dippin. our head of sales at RE Costing, Ivan in South Africa, sales managers, sales team, revenue team, marketing team, recruiters. We've hired 40 recruiters in South Africa over the last year. We rebuilt the team there.\r\n\r\n\r\nNikolas Hulewsky (36:12.118)\r\nWhat do you look for in leaders? Like what are your most important attributes or like what are the things that you look for?\r\n\r\n\r\nNick (36:18.892)\r\nI try to find somebody who's done it before.\r\n\r\n\r\nI, and also it's, it's man, it's hard, but humbled by this game over the last year of trying to pick operators and managers.\r\n\r\n\r\nNikolas Hulewsky (36:34.06)\r\nWhere did you miss? Tell me where you missed. I mean, not to name names, but like, what do feel like?\r\n\r\n\r\nNick (36:37.744)\r\nYeah, I mean, look, it's just really hard in an interview process and in a vetting process to figure out if they have it, if they have that. And you can get, you can get recommendations from people who tell you that they have it and then realize later that they don't. Um, the old, but I can tell pretty quickly when I start, when I get in the trenches with somebody. So I either like promoting from within getting people. And the great thing about hiring in South Africa is that I can bring somebody in the door for four grand a month. And within a month or two.\r\n\r\n\r\nI know if they're an all star or not, and I can say, okay, like it's time to make 6k a month and you're on a path and here's the path. it's whereas hiring a United States executive, you're gonna, you know, you're to be on the hook for 200 grand base plus bonus plus a severance plus all these, you know, FICA and benefits and all the, all the other crap.\r\n\r\n\r\nNikolas Hulewsky (37:25.518)\r\nYeah, I cut my teeth in healthcare. And so my my home with an office company, $12 million a year, had over 300 employees. So it's just a very service heavy business, right? We're not like one these tech companies where we've got a million dollars in revenue per employee, or like we're very low on the revenue per employee side of things. So I've had to learn how to hire. And the biggest thing I've learned in hiring is like, it's a freaking crap shoot. Number one, like you just\r\n\r\n\r\nYou just don't know they can have the best resume in the world. You hire them and it's like 5050. But number two, your best people come from your best people like for me, that's been the biggest the biggest thing. And that's why I think any leader that I've hired because I've hired leaders of different businesses is they have got to be able to recruit. They've got to be able to retain. They've got to be able to inspire and they've got to drive results like those are the four things they have to do as a leader because if they can recruit, retain and inspire, then I know their sales, you know, they're like they're a salesperson.\r\n\r\n\r\nlife of sales, whether you're selling somebody to like bring you new business or whether you're trying to keep people on your team, you've got to convince them and sell them on you your vision that you're the leader. And if, if they can do those things that I know they're going to go get their best people, right. So it's like, try to hire leaders who I know have a good network. And that's how I've used Twitter as well as like, I've always got a bench of like four or five people that I know at any given moment, if I had an opportunity, I can go and kind of these people. But it took me a while to like, realize that piece is like,\r\n\r\n\r\nThat's just such an important aspect to leadership.\r\n\r\n\r\nNick (38:55.098)\r\nI'll add a fifth one and that's be able and comfortable to fire people quickly.\r\n\r\n\r\nNikolas Hulewsky (38:59.256)\r\nYeah, that's actually really good.\r\n\r\n\r\nNick (39:00.698)\r\nAs the, cause Chris Powers told me, was complaining maybe two years ago, I was complaining to him about one of my employees. was saying, Chris, you know, he keeps messing up here. I'm trying to help him, trying to help him here. And he goes, Nick, you need to fire the guy. And I'm like, what are you talking about, Chris? It's my busy season. We're doing more than ever. He's working 60 hours a week. I can't fire him. And he goes, you need to fire him tomorrow. And if he's still here in six months, you got a problem because your culture at your company falls to the level of incompetence that you tolerate. So if you tolerate C players,\r\n\r\n\r\nYour entire company becomes a sea player organization. he said, Nick, you can either let your shitty people go or watch your great people walk away.\r\n\r\n\r\nNikolas Hulewsky (39:37.486)\r\ntotally true, man. And I, I've had to learn how to fire fast. used to think that was just, if somebody doesn't get it, fire them fast. But now I look at it, and I'm like, all right, there's two options, either they're not going to fit long term, in which case I fired them fast, or I didn't set them up for success. And even if I didn't set them up for success, there are moments where it's like, I'm sorry, I wish I could have set you up for success, but this position needs you to be successful without me having to like jump in. But I kind of like\r\n\r\n\r\nI try to parse it in between those two. And if I know they're not going to be a long-term fit, like they're gone. If I know that they're good long-term fit, but I didn't set them up, I do work with them, but you've got to be quick. Like you, you've got to turn them out quickly. Otherwise it breeds complacency with like you're saying bleeds complacency with the rest of team.\r\n\r\n\r\nall right. I'm gonna I'm gonna switch to something touchy. What do you think of these of these cheapers? The wrong word? What do think of these competitors that are doing? I'm going to reframe this actually, somewhere has been doing a fantastic job. And anytime a company is doing really well, it inspires a lot of competitors to enter the market because there's obviously a market for it. They can make money, there's margin, etc. And so there's been a lot of other smaller\r\n\r\n\r\nStaffing companies, overseas talent companies that have popped up because they're trying to ride the same wave and they're following a very similar playbook. Cool. I'll build distribution on social media and then I'll use that distribution to grow by business. Some of them more successful than others. Your biggest antagonist though has been John Matzner at Sagan and John is a as good of a troll as you are, I would say. You guys are both very good trolls. It's just one of you has the power.\r\n\r\n\r\ndynamic that the other one doesn't have at the moment. I have no doubt the roles will reverse. It'd be like the same struggle except one of you'd be doing the other role. My first question is, how do you as someone who I've seen be like one of the most fiery people on Twitter, not engage with that? Like how are you taking the high road in this conversation?\r\n\r\n\r\nNick (41:40.624)\r\nI honestly wanted to win, man. I really don't care. It's a massive, it is, it's a massive, it's a massive.\r\n\r\n\r\nNikolas Hulewsky (41:45.528)\r\nThat's the most alpha thing you could have said.\r\n\r\n\r\nNick (41:52.738)\r\nIt's a massive market. It's a massive market. Every, every day I see another competitor that does very similar things to what somewhere does. And they're twice as large as me. And I talked to a guy like Jesse Tinsley, who I had a phone call with him a month ago and he makes, he makes me feel small. He makes me feel like, holy shit, I'm small. Talk to guys like Chris Powers and see what they're doing. Like I\r\n\r\n\r\nNikolas Hulewsky (42:07.669)\r\nmy gosh.\r\n\r\n\r\nNick (42:18.66)\r\nWould I approach Twitter like John does? No, but look, man, he's a good dude. He's got a good team. I'm super thankful for the work he's done in his past protecting us and our country. I, I hope he wins, man. really do.\r\n\r\n\r\nNikolas Hulewsky (42:27.095)\r\nHmm\r\n\r\n\r\nNikolas Hulewsky (42:32.174)\r\nYou just pulled the John Hamm meme when in Mad Men when he's in the elevator and the guy says something to him. He's like, I can't remember what he put the guy says something about like, I don't know why you think like that. And then John Hamm turns him and he's like, I don't think about you at all. That's what you just did. I don't think about my competitors at all.\r\n\r\n\r\nNick (42:46.672)\r\nSo look, man, the thing about this, I follow my competitors very closely. This, this is a very hard business. get 50,000 applicants a month and 40,000 of them can't, they can't type over 30 words per minute. You can't work a remote job if you can't type 30 words per minute. So I have to do the work with a team of, with a team of 20 people to figure out who's actually capable of working for a US based company.\r\n\r\n\r\nNikolas Hulewsky (43:06.753)\r\nRight.\r\n\r\n\r\nNick (43:17.068)\r\nOur screening process is a ton of work. We're selling two sides. You got to sell clients and you got to sell candidates on taking the jobs. Recruiting is phenomenally difficult. If you want to do that yourself or hire an internal recruiter or post jobs on pH jobs, like that's a great way to do it. Somewhere adds a ton of value, man. Like we add great people to companies. We stand by it for six months. Like we're going to, we're going to win. hope a lot of people other went.\r\n\r\n\r\nA lot of other people win too, because ultimately the people who the people who win are the business owners. My self storage company. I spend 1.5 million a year on payroll to have a team of 50. That's less than 30,000 per head. My competitors, my competitors in the United States running similar sized self storage portfolios are spending 5 million a year on overhead. 1.5 or 5 million. You tell me which business you'd rather run. It's a game changer. It's a game changer.\r\n\r\n\r\nNikolas Hulewsky (43:45.506)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (43:56.174)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (44:09.282)\r\nYeah, dude, it's a total game changer. And I, I have another friend who's gotten into this Parker Cox, has a company called Pivago, their models a little different. But he has said, and it's my, it's my favorite quote of Warren Buffett's where Warren Buffett says, my favorite boat, or my favorite wave to write is one with a tailwind. So like what Warren Buffett saying is like any industry that I'm competing in, I want to be in one that's growing like crazy.\r\n\r\n\r\nAnd the one that you're in right now is the wave is so big that a lot of people are able to write it. And a lot of people are going to be able to be successful because even within outsourcing, some people are going to specialize just in sales. Some people are going to specialize just in training after they've actually onboarded. Some people are going to specialize in this industry. You know what mean? Like this, there's a bunch of specialization that you can get into. You talked about the BPS.\r\n\r\n\r\nNick (45:02.544)\r\nI think a lot of them, I think a lot of them are going to like, this is a hot take. think a lot of them are going to fail. It's a very hard business without, without, you know, if we didn't have 40 leads a day coming in the door somewhere, it'd be really, really, really, really hard to do this business. Um, recruiting is fricking hard. Like standing by these hires over time is hard. Like I talked to a lot of owners who were like, Nick, I want to sell you my agency. And I'm like, okay, what do you do? They're like, well, we have the Athena model. It's, know, we upcharge every hire. I'm like, how many do you have? 21.\r\n\r\n\r\nNikolas Hulewsky (45:21.4)\r\nMm-hmm.\r\n\r\n\r\nNick (45:31.472)\r\nWe have 21 contractors on we have 80 grand a month of recurring revenue. We want a million bucks. I'm like, luck, man. Good luck. Good luck. It's, there's a ton of there is a ton of competition. There's a ton of competition in this space. It's really hard. I had to rebuild the business to take it from 1 million a year capacity to now our goal in the next couple months is 2 million a year, 2 million a month. Sorry, 1 million a month to 2 million a month. Go taking a business from 1 million a month to 2 million a month.\r\n\r\n\r\nNikolas Hulewsky (45:40.361)\r\nYeah\r\n\r\n\r\nAnd you have no need to acquire.\r\n\r\n\r\nNick (46:00.536)\r\nYou need so much more. You need a totally different structure.\r\n\r\n\r\nNikolas Hulewsky (46:03.31)\r\nYeah, and you're going to rebuild it again when you get to 5 million and like you constantly are rebuilding the business because what you did it X is not translating or why.\r\n\r\n\r\nNick (46:10.832)\r\nSo a lot of these operators who are in this space, they're not going to be able to do it. I'll tell you that. It's hard.\r\n\r\n\r\nNikolas Hulewsky (46:16.55)\r\nI did. I totally agree. To me, it's very similar to trying to grow on social media, for example, where I think you just have to niche down. And most people don't want to do that. They want to be everything to everybody. If you're going to go into a space like this, carve out a really good niche. then it's mean, SAS does this well land and expand. It's like, OK, pick out your niche and expand from there. You're different. You have a distribution channel, which most people don't have as a competitive advantage. So I think.\r\n\r\n\r\nyour strategy can be different because you have some scale. But if you were just getting into it, you can't be everything to everybody. All right. I want to I want to switch a little bit. Your book. I'm I'm excited to talk about this. I saw Sahil Bloom release his book a couple of months ago and was just blown away. I don't know how he did it. I don't know what voodoo he conjured, but it was like every person who had any influence was posting a picture or a quote or something from his book. Right. And I think he has really good things.\r\n\r\n\r\nNick (47:10.522)\r\nYep. Sahil wrote an excellent book and he ran a masterful launch campaign and he's connected to anybody who is everybody because he's such a likable, awesome dude that like you can't replicate what Sahil did. Like to get to number two on the New York Times bestseller list as a first book behind Mel Robbins, was selling like any other week during any other year, Sahil is the number one New York Times bestseller on his first release.\r\n\r\n\r\nThe fact that he didn't get there because of Mel Robbins on a heater is unique. The book business is hard and Sahil, yeah man, like he worked his ass off to write a great book and it's going to be, it's going to change his life forever.\r\n\r\n\r\nNikolas Hulewsky (47:53.326)\r\nNow, obviously, you were already writing this book before Saho released it, and you and Saho probably talked about the fact that you're both writing books, but.\r\n\r\n\r\nNick (47:59.684)\r\nYeah, we both have the same, we're good friends. have the same agent. Like we use different, you know, publishers. but he was paying when I used a Harper Collins, but\r\n\r\n\r\nNikolas Hulewsky (48:09.976)\r\nI saw you didn't use a ghostwriter though.\r\n\r\n\r\nNick (48:13.368)\r\nI had an editor that helped me, but I wrote, I wrote every word. Yeah. I tried the ghostwriter at first. this is my legacy, man. Like it's, it's mine. So I'm not going to do that.\r\n\r\n\r\nNikolas Hulewsky (48:17.83)\r\nNikolas Hulewsky (48:23.864)\r\nWell, so I'm to ask why write a book? You got all these other things going right now, like you literally you just bought somewhere.\r\n\r\n\r\nNick (48:27.854)\r\nWell, originally decided to write a book because, well, it two years ago that I originally decided to write a book and I thought it was going to be easy. I was wrong.\r\n\r\n\r\nNikolas Hulewsky (48:43.797)\r\nDude, that that could be that could be the the on the tombstone of every entrepreneur. Hey, why'd you start this business? I thought it was going to be easy. That's amazing.\r\n\r\n\r\nNick (48:53.284)\r\nYeah, I'm just, I'm just cocky enough, man, that I think I can do everything. And it was a humbling experience, but I'm so glad I did it. am phenomenally happy with how it came out. It tells not only my story, but the story of 40 plus other entrepreneurs to get key lessons apart apart. like people read too much bullshit about trying to change the world. This is a tactical book to make more money and to build a sustainable company. So I'm proud of it.\r\n\r\n\r\nNikolas Hulewsky (49:17.698)\r\nWhat does it focus on? Talk about like what the actual focus of the book is.\r\n\r\n\r\nNick (49:20.664)\r\nYeah, it's got three parts. The first part is, you know, what opportunity you chase, how to figure out what business you want to go after. Second part is like the key skills that you need. Hiring, making decisions, delegation, sales. And then the last part is people hiring. You know, how to get people to follow you, what to look for in people, because you can't do it alone. And to get leverage, you have to hire and build teams. So the last part is all about that.\r\n\r\n\r\nNikolas Hulewsky (49:46.35)\r\nSo writing a book was probably not the, it's like probably wasn't the best time to write it. Did you find it helpful though?\r\n\r\n\r\nNick (49:52.654)\r\nmy gosh. I'm so glad I did it. It made me better as a person. It humbled me. and it also gave me like, nowhere is there really an organized structured, you know, mind dump of mine of how I feel about everything from everything I feel about from what business to start to how to go after opportunities to how to do all these business things, to how to live a good life and how to be a good parent. Like the last chapter is not business related. It's literally me.\r\n\r\n\r\nNikolas Hulewsky (50:07.158)\r\nYeah, the Huber playbook, right?\r\n\r\n\r\nNick (50:21.22)\r\ntelling people that they need to have kids and telling people how to raise their kids and telling people, you know, what other things you need to focus on to be an effective person.\r\n\r\n\r\nNikolas Hulewsky (50:30.552)\r\nThere are three reasons I started this podcast. The first reason was a journal for my kids. The second reason was to meet cool people. And the third reason was to learn about cool businesses. feel that that's how I feel about this podcast is like at some point they're going to feed all these into an LLM and my kids are going to be able and my grandkids are going to be able to talk to, you know, 39 year old Nick who's still making penis jokes and like hear from him and what he was like and how he thought about things. This is a much better way to capture it. But I've found in writing in particular, you can just codify\r\n\r\n\r\nyou're thinking a lot more. It's like, how do I think about choosing an opportunity? How do I think about hiring and firing and onboarding and delegating and all of those things, which I'm, I'm assuming was actually really good for you. As you're in the midst of trying to rebuild somewhere to have this format of like forcing you to think about, okay, what are my non-negotiables? Because ultimately just benefited you.\r\n\r\n\r\nNick (51:19.77)\r\nYeah, I, you want to learn something, teach it. It's, it's, it's so freaking true. Like I, I've, I got organized with my own thoughts, my own priorities and, my own principles. Like it's really hard to do the work to figure out how you actually think about things. Most people just get on Twitter and think about things just like how their favorite influencer thinks about things. to, do the work, to do the work is different.\r\n\r\n\r\nNikolas Hulewsky (51:43.918)\r\nDude, there's so much more I want to ask you, but I'm not going to monopolize your time. This has been awesome. Tell me that, what's the name of your book? This, okay.\r\n\r\n\r\nNick (51:51.578)\r\ncalled the sweaty startup, how to get rich doing boring things came out this, came out this week. So, if you, you're kind enough to the link, yeah.\r\n\r\n\r\nNikolas Hulewsky (51:56.886)\r\nAll right. My affiliate link, my affiliate links in the bio that Nick's going to pay me handsomely for. I'm just kidding. But yeah, we'll have a link in the bio. I love it, All right. I'm going to I'll edit the end.\r\n\r\n\r\nNick (52:02.8)\r\n.",
  "metadata": {
    "duration": "",
    "date": "2025-04-28",
    "platform_source": "Google Drive"
  }
}