{
  "episode_number": "100",
  "episode_title": "How The Tuttle Twins Sold 6 Million Books Teaching Kids About Entrepreneurship, Freedom & More with Connor Boyack",
  "guest_name": "Connor Boyack",
  "business_name": "Tuttle Twins",
  "transcript": "﻿Nik (00:00.878)\r\nAll right, Connor, welcome to Nikonomics. It's tough to have you here. Why don't we just jump into the meat and potatoes? Tell me about your business and how you make money.\r\n\r\n\r\nConnor Boyack (00:08.858)\r\nSo the business we're talking about today is the Tuttle Twins. So I write a series of children's books, which have now also turned into curricula and a whole lot more materials. And these are resources to help kids of all ages and their parents, frankly, learn about ideas like capitalism, entrepreneurship, property rights, personal responsibility. We do it through fun stories, beautiful illustrations, trying to make these ideas accessible to kids. So.\r\n\r\n\r\nThis is a business unit within a nonprofit. So a little bit different model than a lot of people are used to in the traditional for-profit world. But we treat it kind of independently as its own little business unit, despite being owned by the nonprofit. So trying to, you know, at a minimum have excess revenue, if not ultimately break even. Like a lot of folks are trying to get multiples and, you know, have an exit at some day or whatever. That's not really our focus. Ours is a very mission driven initiative. And so we...\r\n\r\n\r\nuse a lot of entrepreneurial energy within the nonprofit. But ultimately the goal, I'm happy at the end of the day, if we are breaking even in what we do, because that means that a ton of people are reading the books, they're learning about the ideas. Ultimately, that's where we find the most value for us. But it has to be profitable, allowing us to do marketing and reach more people and grow what we're doing.\r\n\r\n\r\nNik (01:10.113)\r\nOkay.\r\n\r\n\r\nNik (01:28.462)\r\nNo mission without a margin. You can't have a mission-driven organization if you're not actually able to keep your expenses in line. Can you give people an idea of the Tuttle Twins? Let's say, how big is it? How many books have you sold? How many, like you have some really cool stuff with Angel Studios. Can you talk about sort of the reach you have?\r\n\r\n\r\nConnor Boyack (01:33.124)\r\nTotally.\r\n\r\n\r\nFor sure.\r\n\r\n\r\nConnor Boyack (01:50.81)\r\nSure, so we started in 2014, so the time we're recording this, it's our 10th anniversary year. We now have about three dozen books for kids of all ages, all the way from toddlers to teens and everything in between. then we've sold a total of over six million books now. We translate them into about a dozen languages and more, counting.\r\n\r\n\r\nAnd yeah, you mentioned the cartoon. So we partnered with Angel Studios, spun off a cartoon. And that's in its third season now. I think it's got over 250 million views across channels. We've got games and curricula and other content as well. Really, we're just trying to build this almost like content empire and fill this void. Because this literally started because my partner and I, Elijah,\r\n\r\n\r\nWe were like, you know, kids were young and we're like, hey, we want to teach our kids this stuff. I went on Amazon one day trying to find books like this for my kids. There was nothing. So it's one of those very traditional stories of like seeing a problem and having the light bulb moment and being like, I could do that. So we partnered up. He illustrated. I wrote the book and it's just been growing from there more than any of our wildest imaginations. And now it's of service to millions of kids around the world whose schools and textbooks aren't teaching them these ideas.\r\n\r\n\r\nIf anything, they're often teaching quite hostile or different ideas. And so it's a great supplement for families to do it. I think it's great product market fit and it's served us really well.\r\n\r\n\r\nNik (03:19.79)\r\nOkay, so you have the Libertas Institute, which is based in Utah. Is the media arm like a subunit of the nonprofit or is it a separate standalone for-profit entity?\r\n\r\n\r\nConnor Boyack (03:24.399)\r\nThat's right.\r\n\r\n\r\nConnor Boyack (03:32.122)\r\nSo it's it's just an initiative of Libertas Institute. So we are the publisher of the books We run it as a business unit internally, but on the books, it's just one of our many programs within the nonprofit So we we track it ourselves primarily because we want to make sure that as a business unit We're you know, it is profitable and not requiring to be subsidized by other fundraising or other revenue generating efforts But ultimately it's just one of many different initiatives that our organizations\r\n\r\n\r\nNik (03:59.278)\r\nGot it. You can open that. Go for it. Love you. I'll see you later.\r\n\r\n\r\nis it weird operating this business within a nonprofit? Cause like, I'm just looking six million books sold is insane. I don't necessarily know what the profit margins are. We can talk about like generally speaking in the published publishing industry, what that is, but I'm just curious, like the nonprofit piece and then having this, I'm not going to even call it for profit. It's just a very, you know, very commercial enterprise in, selling these books and creating a media arm. How, how do those two things comport?\r\n\r\n\r\nConnor Boyack (04:36.878)\r\nWell, it's definitely non-traditional, I'll give you that, but it's very doable and I think advantageous in some cases. So clearly my partner and I are not going to have any type of exit where we just go retire to play golf on a tropical island for the rest of our days. Like that's not what we're after and that's not how we structured it. So there are trade-offs in that sense that we have no ownership stake, there are no shares in a nonprofit, there's no dividends being paid to shareholders or anything like that.\r\n\r\n\r\nBut we do get to avoid corporate income taxes, which is really nice. And then we also open up philanthropy as an additional revenue stream. So all along the way, what we've done is what I call a philanthropic kickstart model. We'll go to donors and we'll say, hey, we've got this idea for this book or this project. And we'll get them to fund it. And that will fund its creation and maybe the first print run of books, for example, in a marketing budget. And then from there, we sell, we market and sell the book or the project, the asset, whatever it is.\r\n\r\n\r\nAnd then we can reinvest that sales revenue back into marketing. So we tell donors, it's a kickstart model because you can give just one time, but it's going to be a gift that keeps on giving because you're enabling us to then kind of put it into this machine, the snowball, right? Going down the hill, getting bigger and bigger. So opening up philanthropy as another revenue stream has been very advantageous for us beyond just being a, you know, taking on investor dollars or bootstrapping it ourselves.\r\n\r\n\r\nSo that's been very helpful to grow what we're doing.\r\n\r\n\r\nNik (06:04.824)\r\nSo you really view, I might be putting words in your mouth, but it sounds like you really view this media segment as an accelerant to the mission of the Libertas Institute. Is that fair to say?\r\n\r\n\r\nConnor Boyack (06:17.75)\r\nIt's yes, it's very entwined with with what we're doing. And it's integral to how we think about social change. So Libertas Institute ultimately is involved in in legal reform, trying to change laws, trying to protect our rights and in Utah, where we're headquartered, but across the country as well. And what we realized years ago is that changing laws is really like a pendulum going back and forth. You can go fight, fight, fight, get a law passed, but it might get\r\n\r\n\r\noverturn two years later if the cultural tides shift. So if you want to have a really strong effect in what you're doing, we have to change hearts and minds as well. We need there to be this cultural understanding of these principles and these ideas. And so the books and the other programs that we do that are more family facing and youth oriented for us, yes, are a strategic part of what we're doing overall trying to, as we say, change hearts, minds and laws to create a freer future.\r\n\r\n\r\nAnd it all begins, I think, with education in the home. I don't think we're going to save our country at the Capitol, even though we should engage there and try and fight for better laws. And we do. I also don't think we're going to save our country in the courtroom, even though I think we should litigate and sue the government to hold it accountable. And we do. But I think ultimately if we're going to save our country, it's not in the Capitol. It's not in the courtroom. It's at the family dinner table.\r\n\r\n\r\nand it's restoring social fabric. It's getting parents and kids learning about these ideas, talking about it, developing critical thinking. And so that's why for us it is very mission driven. But as you said, there's no mission without a margin. So we have to treat this like a business. can't just, look, I could go get Elon Musk to give me a billion dollars and I could just blow all the money and not have a sustainable business model. But we're very entrepreneurial. We like practicing what we preach. And what we preach is entrepreneurship. It is capitalism. It is profit.\r\n\r\n\r\nNik (08:08.418)\r\nThank\r\n\r\n\r\nConnor Boyack (08:08.451)\r\nAnd so we try and incorporate that in what we're doing to get the message out there.\r\n\r\n\r\nNik (08:11.532)\r\nYou've built something really cool. You've got millions of books sold. Obviously you're reaching hundreds of millions of people with the Tuttle Twins content. You have a cool program across the country that encourages entrepreneurship and for kids to get out with these, I'll call them farmers markets and get a taste of what it's like to operate in a capital efficient market, et cetera. You could probably make a lot of money by yourself doing something else. Why did you start this? Non-profit.\r\n\r\n\r\nConnor Boyack (08:39.226)\r\nso yeah, I started a Libertas Institute in 2011. And to be very honest with you at the time, I had a very limited vision. I was focused just here on Utah, my adopted home state. wanted to get some laws passed. I had a skillset that was very conducive to that. I had been volunteering in a few different organizations, doing lobbying, doing marketing, my backgrounds in online marketing and web development. That's what I used to do for a living.\r\n\r\n\r\nNik (09:04.632)\r\nOkay.\r\n\r\n\r\nConnor Boyack (09:05.402)\r\nAnd so, you know, I had understood like the psychology of persuasion and marketing, but I was very passionate about history and economics and, you know, protecting our individual liberty. And so I figured, well, you know, there's no other organization doing quite what I want to do. I'll have to start my own. And I said, okay, well, I'll start a think tank. That'll be the model. But there was no vision for the Tuttle Twins or these children entrepreneur markets or many of the things that we've done. But I found along the way that having a nonprofit for\r\n\r\n\r\nThe reasons I mentioned, among others, has been very useful tool for me to advance the cause. I'm not in this to make money. I mean, I'm compensated just fine. And I think I ought to be based on the value that I create. I'm very pro-compensating value creator as well. But I have no need for any type of particular ego or massive exit as long as I can take care of my family and build up my own wealth along the way. The mission matters.\r\n\r\n\r\nfar more to me and having a nonprofit structure in which to do that has facilitated quite well. I could have done a for-profit, Elijah and I could have done that entirely from the beginning. I think we would have had some challenges had we not taken on maybe some investor dollars, which as authors, no one really invests in doing children's books. Going through the traditional publishing route was a non-starter for reasons we could get into. So it was kind of the path that opened before us and ever since has been a very fruitful avenue to pursue.\r\n\r\n\r\nNik (10:31.63)\r\nSo there are a lot of, I'm gonna call them conservative media types that have kind of cropped up over the last five to 10 years. Ben Shapiro is probably the largest. He has The Daily Wire, which is incredibly popular because it's filling this niche, I think, that the mainstream media has kind of neglected for long time. Then you got people like, no, love them or hate them. I'm just gonna say their names. Candace Owens, Charlie Kirk, individuals like that who are also in the space that are creating content and they've realized that\r\n\r\n\r\nmedia is incredibly powerful because it creates distribution and it has also grown their brands. When did you realize that like, holy crap, yes, I'm doing the, and I'm saying it horribly wrong. Is it Libertas or Libertas?\r\n\r\n\r\nConnor Boyack (11:15.64)\r\nYeah, we we I'm a libertarian. don't care how you pronounce it. So it's a very you pronounce it however you want. We say libertas emphasis on the bear. Like think of like an Italian, libertas.\r\n\r\n\r\nNik (11:19.532)\r\nOkay.\r\n\r\n\r\nNik (11:25.934)\r\nOkay, So, libera, I'm gonna say I'm, I'm terrible. Anyways, so you have you have the nonprofit that you created? At what point did you realize, holy crap, we could do something more if we're able to tap into this media piece, because we're kind of limited with our reach and scope at the moment, because it just really depends on the dollars we can bring in. But if we build this media piece, all of a we have distribution, we have an ability to help children learn like\r\n\r\n\r\nConnor Boyack (11:34.466)\r\nYou do you.\r\n\r\n\r\nNik (11:54.06)\r\nObviously there's a ton of other goals. When did that like switch for you in your mind?\r\n\r\n\r\nConnor Boyack (11:58.574)\r\nWell, it definitely did not switch at the beginning. I distinctly remember that when we published our first Tuttle Twins book, I went to my board meeting and I gave a copy of the book to each of the board members. was walking out to his car with my board chairman after the meeting. He had the book in his hand and he literally said, and I kid you not, maybe one day we could help fund our work by selling these books. And what was my reaction? My reaction was nervous laughter, dismissive laughter.\r\n\r\n\r\nNik (12:22.114)\r\nYou\r\n\r\n\r\nConnor Boyack (12:27.642)\r\nbecause I had no vision for it. I thought that was crazy. you know, it's a book, number one, but also a kid's book. And one of the chief problems we ran into, thinking of just navigating the publishing industry, was I went to some of the publishers who do political type books, especially more conservative or center-right books. And I pitched the idea for Tuttle Twins and like, well, that's interesting. We just don't do any children's books.\r\n\r\n\r\nAnd so then I went to the children's books publishers and I said, Hey, you know, here's this concept. They're like, okay, interesting concept. We just don't do anything political. Of course, this was a decade ago. Nowadays, plenty of children's book publishers do all kinds of political stuff. But at the time that wasn't the case. So of necessity, we had to forge our own path. And in the early years, I had very limited vision. This was just a fun hobby. It was a fun little side hustle. So to precisely answer your question, it was COVID.\r\n\r\n\r\nHere's an interesting stat for you. From 2014 through 2019, so that's six years inclusive, during those six years, we sold a cumulative total of 750,000 copies of books, which mind you, for a self-published outfit is actually really, really good. We were very happy with ourselves, but it was a slow build. So 750,000 total books in those six years. 2020 hit and we sold 1.3 million books in 2020 alone.\r\n\r\n\r\nNik (13:35.811)\r\nYeah.\r\n\r\n\r\nConnor Boyack (13:51.096)\r\nalmost double the entire past six years combined. And so my limited vision and my treatment of this project is just a fun little side project that we were doing, radically changed once I realized the opportunity, I realized the need, and then after kind of formulating the thoughts with my team, realized the strategic benefit that comes from integrating this as like a core component of our work.\r\n\r\n\r\nWe have this whole model called the pyramid of impact, but in short, it's this integral part of what we're doing now for our mission. And it was COVID and the market demand, the response. Think of it, right? Everyone was a homeschooler all of a sudden. They don't know what to teach their kids. Many parents are freaked out at the totalitarian response of their local state or federal governments. They're worried about the freedoms in our country being eroded, know, freedom of speech and association and assembly and all of that.\r\n\r\n\r\nNik (14:27.182)\r\nMm-hmm.\r\n\r\n\r\nConnor Boyack (14:45.85)\r\nAnd so we were, it was one of those things when preparation meets opportunity. I talked about product market fit, and there was a little bit of that in the early years, but more is just like, this is a fun little thing. I'll get this for my grandkids. Starting in 2020, that tone shifted amongst our customer base. Now it was like, I need these resources to teach my kids truth in a world filled with deceptions. Will you please help me? And it was far more laser focused. was, and so we brought way more vision and strategy to it.\r\n\r\n\r\nSo frankly, it was COVID for me that led me to finally realize like, okay, this is more than just a side thing. I need to turn this into like a critical component of what we do.\r\n\r\n\r\nNik (15:20.878)\r\nWas there a moment in COVID that was like, holy crap, this thing is taking off, right? Like obviously you sell 1.3 million copies in 2020. I'm assuming maybe there was a month or a week or like a conversation with an influencer who promoted your book. Like, I'm just curious, was there a moment of time in time in there where you were like, is this really happening? Like this rocket ship is taking off.\r\n\r\n\r\nConnor Boyack (15:42.906)\r\nI think there's two. The first was just the customer response that I think of like coming as waves. I was just in Cabo San Lucas with my daughter this weekend. So I've got beach analogies running through my head. And we were standing on the side of the beach and the waves were just kind of gently, you know, lapping at our feet, very soothing, very steady. And it was like that in the first few months of COVID where we would have these like waves of customer service, like emails and DMs and...\r\n\r\n\r\nNik (15:54.083)\r\nYes.\r\n\r\n\r\nConnor Boyack (16:08.794)\r\nand messages from families that would just periodically come in like, okay, three at a time, 10 at a time, 20 at a time. And it was just these parents with just deep gratitude that they found us. It was like, I felt so lost over the past few weeks. I look around at all my neighbors and they're all fearful and don't want to go outside and they're okay with what the government's doing and they're going to inject themselves with 4 million, you know, boosters or whatever.\r\n\r\n\r\nAnd I don't know what happened to the people I thought that were my friends and family or like-minded or whatever. Anyways, messages of gratitude and appreciation that they found us, almost this like anxiety that had been released because I don't know how to talk to my kids about this, but now I found your books and now we've had amazing conversations as a family. it was like for a period of a few months, these like steady little waves coming over me that changed. And the other thing that was more acute.\r\n\r\n\r\nwas when we had to double our warehouse capacity. There was so much demand and we were caught off guard for it. mean, who predicted or planned for any of this? And we were just at capacity. So we moved into a warehouse, we quickly got up and running, and then like two, three months later, we had to move into another warehouse, double the size. And that for me, just dealing with all the hassle and the headache or whatever, kind of smacked me upside the head and I was like, hey, you need to take this more seriously. This isn't just like a hum-dee-dum fun little project.\r\n\r\n\r\nLike you gotta invest more resources and time and energy into this thing because there's a lot of upside, especially right now that we can take advantage of.\r\n\r\n\r\nNik (17:35.662)\r\nDude, that, I can't even imagine. I can't even imagine going through 2020 and then all of sudden your business is just exploding and you've got to figure out supply chain issues. You've got to figure out how to do all the fulfillment, finding a new space. And you were in California, but Utah was actually pretty strict. like I, during COVID, I lived in California in the beginning of COVID, Southern California, and then we moved to Idaho in May.\r\n\r\n\r\nConnor Boyack (17:47.576)\r\nFor sure.\r\n\r\n\r\nNik (18:05.198)\r\n2020. And we went from like California where if somebody had COVID within a quarter mile, everybody was gonna die. Right? It's like, great. We might as well just, you know, phone it in. We're all dead. And then I moved to Idaho where it was like, COVID, COVID don't exist. I don't, I'm not getting the ouchy ouchy, you know, like it's just like two total opposite ends of the spectrum, which was, it was cool in a weird way to actually see that stuff. But Utah, would say was more in the middle of that, probably closer to California than\r\n\r\n\r\nConnor Boyack (18:13.38)\r\nThat's right.\r\n\r\n\r\nConnor Boyack (18:24.719)\r\nRight.\r\n\r\n\r\nNik (18:34.114)\r\nthan Idaho, did you find it difficult operating in Utah to get what you needed done? Like how did you meet all the demand with the constraints that were placed on you?\r\n\r\n\r\nConnor Boyack (18:44.364)\r\nYeah, Utah was fine from a business perspective. It was fairly open. I mean, there were those first two or three weeks where everyone around the country was pretty much shut down. No one knew what was happening. But after that initial period, Utah was fairly open. We didn't really have any constraints in terms of personnel or problems with our warehouse or fulfillment. The biggest problem that we ran into, you mentioned a moment ago, was supply chain. In particular, the rise of e-commerce, like Amazon and everyone exploded during COVID and has remained high ever since. And something you may not expect from that.\r\n\r\n\r\nBecause Amazon and other online retailers need massive amounts of cardboard in which to ship all of their stuff, they were outbidding every other paper customer in getting pulp because they go to these big auctions, these big warehouses, and they're basically just putting in these massive orders. So getting paper to print our books was difficult. It tripled the amount of time that we had to take to wait for our books to be printed. It massively increased the cost.\r\n\r\n\r\nNow things have settled down a bit and sped up quite a bit since then, but for like a year and a half or two years, we really struggled on the supply side to even like we would go out of stock periodically on some of our products because we were just waiting for the books to come in, which kind of sucked because the demand was so high and we were having problems keeping up with it. That was our main pain point was just the supply chain issues.\r\n\r\n\r\nNik (19:58.969)\r\nThank\r\n\r\n\r\nNik (20:03.042)\r\nDid you ever shift to like, all right, let's create a digital book. All right, let's do audio books. Is that where, you know, Angel Studio kind of stepped in and said, hey, let's do a cartoon series. Like, how did those things evolve?\r\n\r\n\r\nConnor Boyack (20:13.956)\r\nSo yeah, Angel slightly predates all of the COVID stuff as we were kind of planning and preparing for it all. So it wasn't born out of that. And the answer is no on the digital side for our books, primarily because after we did the first one or two books, we did come up with like the Kindle version and all the things. And the feedback was very strong from our community. The parents were sick of their kids being on devices for everything and they wanted them to read analog physical books.\r\n\r\n\r\nNik (20:41.356)\r\nYeah.\r\n\r\n\r\nConnor Boyack (20:42.81)\r\nAnd which I get, you know, still many kids are getting exposure from plenty of audio books and digital books, but our community in particular wanted to keep us in the physical space, which I was totally fine with. so we've never shift. Now we have some digital resources. We have like activity workbooks and audio books and things like that, of course, that are digital. But the core books, we always kept physical. And, you know, for that period of a year and a half with the supply chain issues, we just had to deal with it and get through it. But\r\n\r\n\r\nFortunately, we've come out the other end of that and things are largely fine now. But other than that, we didn't really have any huge headaches, thankfully, to deal with during COVID.\r\n\r\n\r\nNik (21:19.374)\r\nDid you have any entrepreneurship experience before this?\r\n\r\n\r\nConnor Boyack (21:23.866)\r\nIf by experience you mean various attempts that failed, then yes. Of course, of course. Yeah. So, I mean, here's a fun one. You know, Utah a little bit. So in Utah, there's a company called KSL and they do like, you know, it's a news company, media company, but they have a big classified section that's very popular. And this was like the Parkland. No, it was maybe it was Sandy Hook. There was one of the big shootings like 13, 14 years ago.\r\n\r\n\r\nNik (21:28.13)\r\nDude, that's experience? You kidding me? Totally.\r\n\r\n\r\nConnor Boyack (21:53.618)\r\nAnd in response to that, KSL summarily decided to delist and stop listing all of their guns and ammo and anything firearm related. It was the, in Utah, as in many conservative states, there's no background checks required. There's no paperwork required. It's private party sale. You can go just buy a gun right now for anybody. And so KSL classifieds were a great way to facilitate those marketplace transactions. Well, they shut it down immediately. They said, we're not doing this anymore.\r\n\r\n\r\neven though they had no connection to the incident, which was in another state, but there was so much online uproar that they just wanted to like abandon it. So I messaged my brother. I've got three younger brothers. I messaged one of them who had done some online marketing stuff. said, Hey, what if we, set up a website like ASAP to do online marketplace sales for, for guns in Utah. And so we start working on that, registered the domain name. I get the website set up again. I'm a web developer. So he's starting on the business side and the marketing side.\r\n\r\n\r\nAnd then we find out that a friend of ours has the same idea. So we end up in partnership, four of us total, launching a company that's called the Utah Gun Exchange, which to this day is the premier and basically only place in Utah where you can buy guns from private parties like this. So we sold our, I sold my interest, you know, a few years in, not for much money at all. Frankly, the problem we ran into was we had a hard time scaling up any marketing effort because Google and everyone would not put ads.\r\n\r\n\r\nNik (23:19.49)\r\nbut yeah.\r\n\r\n\r\nConnor Boyack (23:19.978)\r\non the website because it had to do with firearms. So most of our advertising revenue came in the form of like, what do you call it? Barter almost like free products, know, guns and ammo and knives and generators and random things that these advertisers would throw at us, which was fun while it lasted, but there wasn't really any massive upside. So I sold my interest in that I had and I'll conclude by saying this, there were probably six or eight other little business ventures and attempts that I had done over the years.\r\n\r\n\r\nMy problem was I was always the IT guy. I was the guy that was gonna build the website. I was gonna build the app. I was doing all of that. And consistently what I kept running into was we would, know, back of the napkin, all right, here's the division of labor. You do this, I'll do that, let's go. And I would go put in all this effort and all this energy. This is of course pre-AI when I didn't have any coding assistants to help me. So I'm slave in a way coding this stuff. And then they would drop the ball or things would fizzle or it wasn't good product market fit.\r\n\r\n\r\nNik (23:52.663)\r\nThank\r\n\r\n\r\nConnor Boyack (24:17.77)\r\nAnd so I kept running this problem where I was putting in all this work only for it to flop again and again. And again, whereas other guys are just like dipping their toes in the water and like, you know, it's not going to work. I was slaving away at this. So it kind of burned me out a little while towards really at least pursuing any ventures that required me to be the person investing all of the sweat equity upfront. But, you know, in a period of a few years, my interests deepened on the economic and the political side.\r\n\r\n\r\nAnd that's what sent me down the path that I'm on now, but I'm grateful for all that early entrepreneurial struggle because it really informed starting up my own nonprofit and bringing a lot of that learning to what I'm doing now to try and accelerate rather than starting from scratch.\r\n\r\n\r\nNik (25:03.118)\r\nSo I have some questions on the business and you know if anything's too close to home you can say no thank you but are you required because you're a non-profit to publicly report like your revenues and your expenses and all that stuff? It is. Okay. So do you report what the total twins or the media arm I shouldn't even say total twins the media arm generates for Libertas?\r\n\r\n\r\nConnor Boyack (25:15.822)\r\nYes. Yep.\r\n\r\n\r\nConnor Boyack (25:25.85)\r\nIn the aggregate after being combined with all of our other initiatives as I said Tuttle Twins is a is an internal initiative of Libertas Institute And so it's not reported independently at all to the IRS what gets reported is across the whole organization You know, what are expenses for contractors for employees for marketing so you could look at the marketing be like, my gosh They spent this much money. Well, most of that was probably Tuttle Twins, but a lot of that was some of our other initiatives So they the public sees it Yes. Yep\r\n\r\n\r\nNik (25:51.758)\r\nDoes it break out like dollars in as well, revenue in? Okay.\r\n\r\n\r\nConnor Boyack (25:55.961)\r\nPrecisely.\r\n\r\n\r\nNik (25:57.038)\r\nWhen you're looking at it as a business or a segment in particular, how do you think about what you're doing? Like, do you think about the Tuttle Twins as a standalone business? Or is it like, hey, I can subsidize it with some of the other efforts that we have as long as it's continuing to further the message? I don't know on the nonprofit world. I'm just curious.\r\n\r\n\r\nConnor Boyack (26:25.57)\r\nYeah, so internally we track everything as an independent business unit on profit and expense based off sales revenue being the revenue for that business unit. Now, we do get philanthropic revenue on top of that that I mentioned, and some of that is tied directly to the Tuttle Twins. Someone will say, this gift is to get three books into the library in Henderson, Nevada. Great. That's Tuttle Twins revenue.\r\n\r\n\r\nNik (26:45.262)\r\nMm-hmm.\r\n\r\n\r\nConnor Boyack (26:53.306)\r\nBut a lot of our donors are investing in the overall cause, the overall mission, the overall youth outreach. And that allows some flexibility because they're donating to what's called in the nonprofit world, general support, which allows me the flexibility with my team to move those dollars around as needed. So if Tuttle Twins is struggling, like after the iOS 14 or whatever changes when online advertising became super difficult, we had a really hard time. All the ads that were working were breaking. We were losing money in online ads.\r\n\r\n\r\nAnd so that year I was able to supplement with some of that philanthropic revenue. Now again, know, total twins gets lumped together with everything. So at the end of the day, all that really matters is the aggregate numbers and how we're doing overall as a, an organization. but yes, internally we're able to move money around, with the investment of some of our larger donors who are just saying, I support what you're doing. You know, here's some, capital to help. So some years we need it in one business unit more than the other, but that\r\n\r\n\r\nthat philanthropic investment typically allows for a great degree, thankfully, of flexibility allowing us to make sure that each program has the support that it needs.\r\n\r\n\r\nNik (27:58.414)\r\nWhat was Libertas' budget in 2014 and what is it in 2024?\r\n\r\n\r\nConnor Boyack (28:06.49)\r\n2014 it was probably about $200,000. 2014 was the second full-time year. I quit my job at the end of 2012. I had just built a home with my wife. My mom thought I was consigning my wife to a lifetime of poverty by quitting my great senior web developer job in a red hot IT industry with lots of future runway.\r\n\r\n\r\nto start not only be employed by a nonprofit, but be its founder and responsible for getting it off the ground after several entrepreneurial failures. So fortunately, my mom was proven wrong and she was gleefully to have been proven wrong. So 2014 was, so beginning of 2013 was when I started for the first time, I took a big pay cut, but I was able to focus full-time and start growing it from there. So 2014, year two, was roughly $200,000.\r\n\r\n\r\nNik (28:40.504)\r\nYeah.\r\n\r\n\r\nConnor Boyack (29:03.706)\r\nThis year our budget is roughly $15 million.\r\n\r\n\r\nNik (29:06.232)\r\nWow, man, that's a ton of growth.\r\n\r\n\r\nConnor Boyack (29:10.754)\r\nAnd if you look at the chart year over year, I COVID is when you have the big explosion. That's when Tuttle Twins exploded. It's when our brand, Liberitas, exploded. It's when My Name ID went through the roof. I'm able to get meetings with donors I never would have been able to get before. And so it was definitely, it felt awkward, especially at the time, because a lot of businesses were really struggling as a result of COVID, right? And they're laying people off. They're downsizing. They're shutting their doors. Whereas we were, for the most part, doing much better.\r\n\r\n\r\nthan we ever had been. that, you know, I'm on the hunt right now for, we've kind of plateaued since then. We had this big growth spurt and then we've kind of kept it stable and have slight growth. And so right now what our team is working on is what's the next 10X jump to kick us up. But yeah, in retrospect, you look back a decade and you're like, that's transformational. It's huge.\r\n\r\n\r\nNik (29:58.174)\r\nSo where the, I understand on the nonprofit side, people making contributions makes total sense. On the media side, Tuttle Twins, how do you break down where your revenue comes from? Books, obviously that makes sense. So you have book sales. Where else are you generating revenue?\r\n\r\n\r\nConnor Boyack (30:14.65)\r\nSo yeah, book sales is the the biggest revenue driver for our organization to give you an example and this is publicly accessible in our our IRS documents last year so 2023 we sold I don't have the numbers exactly in front of me, but we sold about nine million dollars in books and And we raised philanthropically about five point two million dollars. So the book sales revenue\r\n\r\n\r\nvastly exceeded the philanthropic revenue. Now, of course, there's a ton of costs baked into that, the cost of goods and warehouses personnel, but that's the biggest revenue driver for us. And then you mentioned this other project, we have the Children's Entrepreneur Market. They're kind of like entrepreneurial farmers markets where the kids run the show. And that's also a revenue for us, both on the philanthropic side, but also we charge booth fees for that. We sell t-shirts for the kids that say, you know, I'm an entrepreneur.\r\n\r\n\r\nAnd then we're going to be getting into corporate sponsorships. Think of like your local 5K charity fund run type thing. We're going to get corporate dollars as well. So what I like about this, Nick, in particular, is here I am the founder and president of a nonprofit, but I am generally very critical of most nonprofits. I think largely with a broad brush, most of them are inefficient. They're ineffective and they're not entrepreneurial.\r\n\r\n\r\nMany times they are doing what their donors want of necessity, right? Because the incentives are there as opposed to doing what the market wants. So one of the best things I love about our kind of capitalist enterprise initiatives within our organization is that we get that direct market feedback loop. We're selling books, we're charging people money for these entrepreneurship events. We're able to directly get that profit.\r\n\r\n\r\nyou know, information directly from, okay, here people are paying money here. They're not, let's lean in over here. And traditional nonprofits don't have that. They just go write a grant and they get 200 grand to do this thing. And then they go back and write their grant report and say, we did this thing and you don't really have as good of a feedback loop. And so you get a lot of, a lot of inefficiencies. So I've almost become this evangelist within our nonprofit ecosystem that I'm in for more of these like, you know, political economic organizations.\r\n\r\n\r\nConnor Boyack (32:35.438)\r\nto say we need to find ways to inject more entrepreneurship, get an entrepreneur in residence or get someone who's from a for-profit background to come in and be your chief of staff or whatever and just find ways to get more of that mindset and that energy into what we're doing because I think it's needed and I think it would help a lot.\r\n\r\n\r\nNik (32:53.198)\r\nSo internally, I didn't hear you say anything about YouTube or your email list, because I think you've got 250,000 subscribers on YouTube, hundreds of millions of views. Are you monetized on YouTube? YouTube? you?\r\n\r\n\r\nConnor Boyack (33:07.13)\r\nSo I should clarify for you. So the cartoon, we licensed the IP to a separate LLC that was created as a for-profit and that company raised like 4. something million dollars to produce the first couple seasons of the cartoon. that is think of like Marvel comics versus Marvel movies. So we have the IP and we have all the books and all the educational stuff. And then the cartoon is legally a separate thing that's not part of our nonprofit.\r\n\r\n\r\nAnd so they raised their own investment to do that. So they do have a YouTube channel, they do monetize that, but all that revenue flows into their LLC and doesn't touch what we're doing.\r\n\r\n\r\nNik (33:44.248)\r\ngot it. And they're paying, and they're paying Libertas a fee for the IP, essentially, but a pre-Nakia.\r\n\r\n\r\nConnor Boyack (33:50.788)\r\nCorrect. was a one-time upfront, yep, there was a one-time upfront fee to get access to the IP. Libertas also then became an investor in helping get the cartoon off the ground. And then we got a lot of our donors to invest some of their money as well. But it is legally, financially, and otherwise a separate initiative, even though our customers just see Tuttle Twins as this kind of amorphous blob that is all things Tuttle Twins, which is fine. Like I don't need them to know the backend distinctions and what.\r\n\r\n\r\nNik (34:17.826)\r\nNo.\r\n\r\n\r\nConnor Boyack (34:19.758)\r\nbut they are separate.\r\n\r\n\r\nNik (34:21.272)\r\nWhat about, I think you said you had a million newsletter subscribers?\r\n\r\n\r\nConnor Boyack (34:26.234)\r\nYeah, so the books, right? The email marketing is a huge aspect of what we do. We send two or three emails a week. That drives a lot of revenue for us, both to past customers as well as people who have just joined our list but not yet purchased. So we do heavy email marketing to monetize the email list. We've got like 80 or 90,000 people on our SMS list that we're always texting them opportunities and things to. And one of the...\r\n\r\n\r\nNik (34:49.678)\r\nDo you monetize that with with sponsorships like you know, a lot of the newsletter business models like hey, I'll pay you X number of dollars to have access to your list. Does that do you guys do that?\r\n\r\n\r\nConnor Boyack (34:58.574)\r\nThat's a great question. Yeah, it's an emphatic no for us because this is so mission driven and brand oriented. We don't want to get into that model and I don't fault others for doing that model. We often will sponsor and advertise on other people's email lists and things. They've chosen that as their business model. I totally respect that. But for us, we don't want to get into the business of having to make all these editorial decisions because our work is so ideological and idea based.\r\n\r\n\r\nAnd so having to deal with like, is this particular vendor, is this company on brand? And having to get into that, we made the decision that we only want to promote our own products rather than take on advertisements for other people.\r\n\r\n\r\nNik (35:42.094)\r\nthink what's interesting is like, I don't think a lot of other nonprofits are, maybe they are, maybe I'm totally mistaken, but I don't think they're in the position that you are, which is you kind of are controlling your own destiny because you have this economic engine with the content that you're producing. So you're not, you don't have to be beholden to a donor or to, you know, one or two specific people who have a lot of money. You can control what you're doing. It's amazing.\r\n\r\n\r\nConnor Boyack (36:06.382)\r\nBingo.\r\n\r\n\r\nIt is amazing. it's, you know, entrepreneurs, they, why do they start a business? They want freedom of money. They want freedom of time. They want freedom of purpose. I'm here channeling Dan Sullivan, strategic coach of which I'm a member. And he talks about the, he's got a fourth freedom, which freedom of relationships, I think was the other one. And so that's what's in like the entrepreneurial DNA. You want control, you want freedom. You want to be able to not be, you know, a W-2 wage slave type of thing.\r\n\r\n\r\nAnd as I said earlier, in most nonprofits, they are beholden to a core few donors. They feel like they can't step out of line. They can't do anything that donor wouldn't want them to do or that they have to do something that donor wants them to do. And our donors know that we can't be directed like that. We have a lot of autonomy. It gives me that freedom that I desired. For me, it is more the freedom of mission, freedom of purpose, freedom of impact.\r\n\r\n\r\nto be able to say like, here's what I think is right, let's pursue this and then find the resources and the donors who can help us do that. But we've never really felt the need to chase dollars for their own sake and do something that we normally wouldn't do because there's money behind it. So we are somewhat insulated from that. And I will tell you, Nick, that's why I've become in it this evangelist I talked about, because I've seen the benefit. I know how much better it is to run a nonprofit with this type of like almost for-profit mentality within it. It's just a different.\r\n\r\n\r\nyou know, ownership structure and you get to avoid taxes, which is a libertarian I love, and you open up another revenue stream, which is a capitalist I love. So, you know, it's just a different mindset change, but trying to help people say, if we have some of that entrepreneurial energy within nonprofits, some of those market mechanisms, those feedback loops to directly monetize things, to try and go sell things to people. Here's what I tell most of my nonprofit CEO friends. I said, I want you to do this thought experiment.\r\n\r\n\r\nConnor Boyack (38:00.268)\r\nIf you had to charge your stated audience, whether that's elected officials or voters or people who own Dalmatians or whatever your audience is, if you had to charge them for your services, would they pay? And if so, how much? Because nonprofits are typically getting donors to fund whatever they do, and then they go provide it for free to other people who often don't want it, don't use it. I think people pay attention to what they pay for.\r\n\r\n\r\nAnd so my question to them is, you what would you charge and do you think people would be willing to pay? And generally across the board, people cringe at that question because they know, I think implicitly how difficult it would be to get people to pay for what they're actually doing, which to me is a great signal from the market to say, maybe we ought to rethink what we're doing if it's not actually a service to the people that we claim it is.\r\n\r\n\r\nNik (38:46.082)\r\nAll right, I have a couple last questions as we wrap up. I don't know much about the nonprofit space, but you said something earlier in our conversation, which was like, you wanted to build wealth for yourself and your family, which I think everybody wants to do. But I look at nonprofit and I'm like, yeah, but don't those people would like get paid only barely market salaries and you know, there's not incentive plans and they don't necessarily have equity or ownership. And you look at what's going on with like Sam Altman, for example, he's got,\r\n\r\n\r\nConnor Boyack (39:14.22)\r\nRight.\r\n\r\n\r\nNik (39:14.67)\r\nHe's got OpenAI that's a nonprofit and he's saying, no, I don't pay myself anything. And then all of a sudden you get this report that's like, site, they're going to go for profit. And he has a seven percent stake and he has $10 billion. So how, do you think about creating wealth for yourself within the nonprofit model?\r\n\r\n\r\nConnor Boyack (39:19.63)\r\nRight.\r\n\r\n\r\nRight.\r\n\r\n\r\nConnor Boyack (39:32.568)\r\nWell, first of all, I bought Bitcoin a decade ago, so that helped. But but setting that aside, look, I've never heard of anyone doing what Sam Altman is trying to do. I've literally never heard of a nonprofit being converted into a for profit. So I'm I'm extremely curious to see how they're going to pull this off. Elon Musk and others are right to not only complain, but sue as as original donors like, wait a minute, you're you're\r\n\r\n\r\nNik (39:35.456)\r\nHello.\r\n\r\n\r\nConnor Boyack (40:00.634)\r\nPersonally profiting off of an philanthropic investment. make like it just doesn't make sense to me So I'm really curious to see how that's shake out in the courts through all this litigation but that is a Generally what you're conveying is is and as you can see that's born out of ignorance Which is totally fine. Most people share that ignorance about how compensation in a nonprofit works The stereotype is that you're you know hand-to-mouth working paycheck to paycheck for a pittance and in many nonprofits, that's true\r\n\r\n\r\nBut that is by no means required. You can have executive staff, the president, myself, paid very generously. I know of CEOs who make a million dollars or more a year running a nonprofit. Now granted, at that level, they have very large nonprofits, large budgets, and they can accommodate salaries of that type. All that has to happen is your board has to approve it, and it has to be a reasonable salary for the value provided in relation to the organization's overall\r\n\r\n\r\nknow, budget and mission and so forth. You can have incentives. You can say, hey, like the CEO, if we hit these revenue targets or if you fundraise this much, then you're going to get these bonuses. That's completely appropriate. I get royalties, right, as a result of the books that we sell. And so I'm able to not only get a salary, but get royalties from the books. I've been able to make other investments on the site outside of the nonprofit, right? So\r\n\r\n\r\nNik (41:19.103)\r\nokay.\r\n\r\n\r\nConnor Boyack (41:23.694)\r\nWhen I say build wealth, it's not just I'm strictly confined to what I'm doing with the nonprofit. I look for other opportunities to invest and to be a part of something. But primarily, most of my income, almost all of my income is strictly from Libertas' activities. And as long as I can justify to the board the value that I'm providing and they want to make sure that I stay put right where I am, and they want to make sure I'm sufficiently incentivized to do so, there's really no upper limit.\r\n\r\n\r\nYou just have to be able to explain and your board explain with a straight face to any IRS agent, whoever audits you that this is a reasonable salary and maybe it's a little above market or whatever, but that's okay for these reasons. Like it just has to be a reasonable decision that's approved by the board. So you're right. No equity, no ownership. You're never going to sell the company and make oodles of money. And that's kind of out of the cards, but it's an acceptable trade off for a lot of people, including myself, who are able to earn a very decent income along the way.\r\n\r\n\r\nand be involved in something that's transformational.\r\n\r\n\r\nNik (42:22.006)\r\nAll right, here's my second to last question. Do you ever fantasize or like wish that you had written the Tuttle Twins outside of the nonprofit? That you're like, man, if I had written the Tuttle Twins outside of the nonprofit, I could have, I don't know, captured more of the royalty or use that to grow my own business, right? Like, I don't think that's necessarily a bad thought to have crossed your mind at all. But I'm just curious how you have thought about sort of the way that it was created and obviously it's been an economic engine.\r\n\r\n\r\nfor Libertas. But any thoughts around that?\r\n\r\n\r\nConnor Boyack (42:57.658)\r\nGreat question. The answer is no. I don't really have any thoughts or regrets about it. Here's how I look at it. Libertas, as I said, I went to children's book publishers. I went to political publishers. We couldn't figure it out. Libertas became the publisher out of convenience, but also opportunity because, you know, we had the resources to invest. Think of Libertas almost as like a one third partner in the Tuttle Twins with my partner, the illustrator and I, almost as like you would have...\r\n\r\n\r\nbrought on an investor who was providing the seed capital for this project to get it off the ground. That was Libertas' role in the early years. Here's the resources, here's the personnel, here's the everything. We're going to make this happen. Libertas will become the publisher. And so it's basically this kind three-way partnership in a sense in that regard. And so, I'm grateful that we were in that position to be able to get incubate this project off the ground. Now, one might look at that in retrospect and say, if only we had not done that done for profit. And I look back at that and I say,\r\n\r\n\r\nI don't know how we would have done it at all. Certainly we would not have had the success that we have right now in a traditional publishing model. Like had we found a publisher to publish these books, royalties are very minimal. Marketing budgets are nonexistent. We would have probably sold, you know, I don't know, a few thousand books and then decided to call it quits and move on because like the revenue wasn't there. The energy wasn't there. The marketing investment wasn't there from the publisher. They just siphon off so much revenue. But for us being a mission driven organization, we were able to still pay a royalty lower than market rate.\r\n\r\n\r\nand use all of that revenue not to profit some publishing company and then subsidize their other failed books that aren't selling well, but to reinvest that revenue laser focused on growing the Tuttle Twins and getting that snowball as it goes down the hill to get bigger and bigger. So to me it was fortuitous, it was providential, it was exactly what we needed and I have no regrets about the way that it turned out because I just think it would have not flopped, but I think it would have burned out long, long ago had we been stuck in the traditional for-profit.\r\n\r\n\r\nbook publishing model.\r\n\r\n\r\nNik (44:53.09)\r\nDude, I love your perspective. I love your attitude. I love the story. I think it's freaking amazing. What's Libertas gonna be in five years? What's your plan? What's your goal?\r\n\r\n\r\nConnor Boyack (45:02.946)\r\nSo to answer that, let me ask you a brief question. When does this episode drop?\r\n\r\n\r\nNik (45:08.263)\r\nI can move it up anytime, but right now it would be beginning of November.\r\n\r\n\r\nConnor Boyack (45:13.412)\r\nPerfect. Okay. So if you want, do you want to, I can start my answer over now and you'll just cut there. Okay. Well, actually what's exciting is we just a few weeks ago rebranded. So we moved from being Libertas Institute. We're now called the Libertas Network, which is an association of these initiatives that change hearts, minds and laws to create a freer future. And what that has allowed us to do, and it's going to allow us to do over the next five years is to really grow this national organization. My goal is to build a national network.\r\n\r\n\r\nNik (45:17.944)\r\nYeah.\r\n\r\n\r\nConnor Boyack (45:43.422)\r\nof millions of families who are coming to our entrepreneurial events, these farmers markets you mentioned, they're reading our books, they're engaging with our material, and then importantly, we're connecting them to the organizations in their community trying to make a difference so that they can go show up at the Capitol or sign the petition or be part of whatever change they want to see. so ultimately the vision is that we become a conveyor belt.\r\n\r\n\r\nif you will, into all these amazing organizations working across the country, trying to remove roadblocks from entrepreneurs, trying to help small businesses, trying to protect parental rights. We become the resource to all these organizations by going out across the country, building these relationships with families, building this network, and then leveraging that network, handing these families off to our organizational partners. So five years from now, we are a far more robust national\r\n\r\n\r\ninitiative, the Libertas Network, with, you know, three million plus families in our network who are learning, who are getting involved, making a difference. No one is doing this. No one's focused on this like K through 12 segment. Most of the nonprofits and the voter outreach groups and so forth, they talk to adults. They go out and try and talk to adult voters. And that's fine. But I think we can have much more impact talking to families, helping parents teach their kids, changing the future, helping the rising generation.\r\n\r\n\r\nSo five years from now, we're gonna be a much bigger and far more successful national organization. Now that we've rebranded a little bit, I think that's gonna allow us to bring on some additional donor dollars to help scale up our work. And I'm super, super excited for it.\r\n\r\n\r\nNik (47:18.306)\r\nI think what I love about what you're doing as well is I'm kind of liken it to the daily wire, but the daily wire is a media company that is about this is our political view and we're going to only we're only going to print stuff that kind of comports with our political view. You're teaching economic principles. I could just is what it is. This is the free market. This is how it works. You want to be an entrepreneur. This is how it works. In my mind. I don't see a massive political component to that. Whereas the daily wire is going to be talking.\r\n\r\n\r\nmore about the social issues. And I think, you know, Libertas has some of the social component, but specifically the Tuttle Twins, it's incredible to me. You're just focusing on economics. Like, how does this work? You want to be an entrepreneur? This is how you go about doing it. And it gets me excited even to get my kids involved with it because this stuff isn't taught in schools. It's not even taught in college. It's only taught through experience. You have to go out and learn about this stuff by experiencing it. I really like what you're doing.\r\n\r\n\r\nConnor Boyack (48:15.962)\r\nAnd so how much better will our children's lives be when they are young adults? If that experience you're talking about, they've had it when they're 10 or 13 or 17. So ultimately what we're trying to do is help parents give their kids a lake up and accelerate to be more successful in the future, to be critical thinkers, to be truth seekers, to be entrepreneurs, problem solvers, value creators. So yeah, in conclusion, guess, tuttletwins.com for anyone who hasn't heard about it before, I'd love to.\r\n\r\n\r\nshare that with you and get more families reading these books so that we can change hearts, minds, and eventually laws to create a freer future together.\r\n\r\n\r\nNik (48:50.158)\r\nAwesome, Connor, appreciate you, man. Let's connect soon.\r\n\r\n\r\nConnor Boyack (48:53.86)\r\nThanks, Nick.",
  "metadata": {
    "duration": "",
    "date": "2024-12-23",
    "platform_source": "Google Drive"
  }
}