{
  "episode_number": "92",
  "episode_title": "How I Built a $15k/Month Shopify Store (Selling DOG Supplements!)  with Mike Myler",
  "guest_name": "Mike Myler",
  "business_name": "Wildbound",
  "transcript": "﻿Nik (00:01)\r\nAll right, Mike, welcome to Niconomics. Why don't you just tell the people, what do you do and how do you make money?\r\n\r\n\r\nMike Myler (00:07)\r\nSo I run an e -commerce store, Shopify, that is a leaky gut solution for dogs. So do you know what leaky gut syndrome is? Get rid of that.\r\n\r\n\r\nNik (00:17)\r\nI mean, it sounds very descriptive, but I couldn't tell you what it actually is.\r\n\r\n\r\nMike Myler (00:21)\r\nYeah, so basically your gut is like a water balloon. It's not supposed to let anything out. But when it does, things go haywire kind of in your body and especially on your skin and your digestive system. Humans have it. Like leaky gut syndrome is really, it's kind of a buzzword right now. But dogs also have it because kibble is like, kibble is not the best thing a dog should be eating. And most dogs are eating kibble. And so...\r\n\r\n\r\nNik (00:47)\r\nWhat's the difference between leaky gut and just Taco Bell? It's synonymous.\r\n\r\n\r\nMike Myler (00:52)\r\nYeah, synonymous, synonymous. Yeah. I think that's like the, I think that's a number five at Taco Bell.\r\n\r\n\r\nNik (01:00)\r\nYeah, my brothers and I make a joke. My sister, unfortunately, she passed away of colon cancer. And so we, thank you. So we all have to get prostate exams regularly, right? Because if you have a close sibling who passed away from that, anyways, you need to get checked. And so whenever one of us is going to get checked, you've probably never had a prostate exam. What they do is they got to clear you out, right? So you like drink this\r\n\r\n\r\nMike Myler (01:07)\r\nI'm sorry.\r\n\r\n\r\nNot yet. Not yet.\r\n\r\n\r\nheard that.\r\n\r\n\r\nNik (01:30)\r\nGatorade mixed essentially laxative and you are just going to the bathroom all night. It's terrible. It's terrible. But my brothers and I will text each other when, you know, when one of us is preparing for that and is like, Hey guys, getting some Taco Bell on the way home today. I should be ready for my colonoscopy tomorrow. No Gatorade necessary. Anyways, that's probably TMI. But so when\r\n\r\n\r\nMike Myler (01:36)\r\nMm\r\n\r\n\r\nI'm\r\n\r\n\r\nNo Gatorade necessary.\r\n\r\n\r\nYeah. It's similar to what we do to the dogs. kidding. It's kind of like, okay, what we do basically is we get a nutritionist looking at your dog's situation. They give you prescriptive diet recommendations, like customized diet recommendations based on what your dog is like currently, what his medical history was. And that food discontinues to feed yeast. Yeast is the big problem.\r\n\r\n\r\nNik (01:58)\r\nYeah.\r\n\r\n\r\nHmm.\r\n\r\n\r\nMike Myler (02:21)\r\nyeast causes inflammation in the gut. It gets into the dog's bloodstream and then comes out to the outsides of the dog, makes it super itchy. But if we can plug those holes and get rid of the yeast and then put in good bacteria into the gut, the gut is then out of dysbiosis, it's in balance. So we get... Go ahead.\r\n\r\n\r\nNik (02:46)\r\nSo you're not, let me see if I understand this. I was thinking you just go to your e -commerce site and purchase a product, but you're talking about having a nutritionist actually come in and assess your pet? How do you do that?\r\n\r\n\r\nMike Myler (03:01)\r\nRight after purchase, you get a 30 -point questionnaire. Then you enter all your dog's information. You're purchasing a subscription, and the subscription is a little bit atypical. You get one product during the first month, and then you get another product every month after that.\r\n\r\n\r\nNik (03:10)\r\nWell, let's back up a best backup. Okay. So I go to your e -commerce store. What am I purchasing?\r\n\r\n\r\nSo the subscription to a product and the product being the vitamin or the whatever it is to bring balance to your gut essentially.\r\n\r\n\r\nMike Myler (03:37)\r\nYep. Yeah. So there are three phases. The first phase is to get you or your dog onto a new food that doesn't feed yeast. And that happens in the first 10 days, roughly. It's a 10 day transition for the dog. And then after that, you start using our product, which is an MCT oil, and that detoxes the yeast from the dog's gut. MCT, MCT. But CVD is not out of the question, actually. It's very helpful after the protocol is over.\r\n\r\n\r\nNik (03:56)\r\nCBD oil. Okay, what is MCC?\r\n\r\n\r\nbecause they're so they're so distressed by having to eat that that they're like, I need to relax, please get me some CBD.\r\n\r\n\r\nMike Myler (04:10)\r\nWe just do straight marijuana usually for that. no, CBD is like anti -inflammatory, so it helps with seizing the gut. But MCT, it's a medium chain triglyceride. And it basically doesn't harm the good bacteria in the gut while killing and then detoxing the yeast, the fungus, the bad bacteria.\r\n\r\n\r\nNik (04:19)\r\nOkay. So what is MBT? MCT.\r\n\r\n\r\nOkay, so I go to your website, the ecommerce site, I purchase it, I get like the first 10 days are the same for everybody. Essentially, we're just getting you off of kibbles and bits. And then over those 10 days, at some point, you have a consult with a nutritionist or like, does that part work?\r\n\r\n\r\nMike Myler (04:43)\r\nMm\r\n\r\n\r\nYep.\r\n\r\n\r\nBut no, no live consult with the nutritionist. You just get the, review those 30 point, that 30 point questionnaire for you. it's all self -reported data, but a live, like an actual nutritionist is analyzing what's happening with your dog. Yeah. And then you can interact with the nutritionist throughout your stay with us via email.\r\n\r\n\r\nNik (05:03)\r\nso it's all self -reported data. It's an assessment.\r\n\r\n\r\nHmm, why the\r\n\r\n\r\nThat seems interesting. It would seem like you would need a fecal sample in order to diagnose what's going on in their gut. How do you get a nutritional diagnosis by a questionnaire?\r\n\r\n\r\nMike Myler (05:36)\r\nYeah, it's not a diagnosis necessarily, but the symptoms of a yeast overgrowth in the gut microbiome are very readily apparent. ask, one of the questions is, can you send us pictures of the problem areas? And typically the symptoms that they list and the pictures that they've posted along with those symptoms tell the nutritionist what they need to know. And it's not, it's...\r\n\r\n\r\nnot at all uncommon to have a yeast issue. it's like, and it's also not a bad thing for any dog to go through this protocol. Like every dog has some amount of yeast in their gut, which is actually a good thing. But it's never a bad thing to like detox bad bacteria and then add in good bacteria. Any dog can do this. Yeah.\r\n\r\n\r\nNik (06:25)\r\nSo. So you said there's three phrases to it. When did the windows face three end or like how long is the subscription?\r\n\r\n\r\nMike Myler (06:34)\r\nThe subscription is as long as you want it to go, but the of the overhaul period is three months. So first month is focused on switching to a new food and then detoxing yeast. Second month and third month are both introducing and repopulating the gut with good bacteria quickly and consistently. And then once that three month period is over, we kind of drop the dose of the good bacteria and it's just a maintenance coast after that.\r\n\r\n\r\nNik (06:52)\r\nand then\r\n\r\n\r\nInteresting. Interesting. Yeah, I have more questions on that. But how did you get into this? Like, this is a really big industry right now, right? Like there's pet insurance has been introduced over the last decade, you've got people who are way more willing to take their pets to the vet. So like my wife and I in the last month, we bought two cats a couple of months ago. And one of the cats was diagnosed, I can't remember what the term was, but they were diagnosed with something\r\n\r\n\r\nMike Myler (07:11)\r\nYeah.\r\n\r\n\r\nOkay.\r\n\r\n\r\nNik (07:29)\r\nthat was a terminal autoimmune disease. And literally just in May of this year, there was an approved drug that cured that disease. like cats would, yeah, cats would just die of this before, but now there's a cure for it and it, you know, cost us like five grand. I don't even remember how much it costs, but you know, people are spending money on their pets because pets are a part of the family. So I think you're entering into a wave that is growing, but.\r\n\r\n\r\nMike Myler (07:31)\r\nMm.\r\n\r\n\r\nGood.\r\n\r\n\r\nHoly smokes,\r\n\r\n\r\nNik (07:57)\r\nHow did you get into this? Were you always passionate about animals?\r\n\r\n\r\nMike Myler (08:00)\r\nWell, I've always loved dogs, but it wasn't like, I need to combine business and dogs somehow. was like, I kind of just got an itch during COVID, where I was actually working overseas in Australia, and Australia's COVID policies were crazy. Like we weren't allowed out of a 5K radius.\r\n\r\n\r\nNik (08:27)\r\nmy gosh.\r\n\r\n\r\nMike Myler (08:28)\r\nYeah, and you had to be approved to go to the store in some cases. It was crazy. And they were actually like taking it. Police is just walking. So anyway, we were inside a lot and my job was such that I could do it like rather efficiently. So I had a lot of time to think about like what I would do if I weren't doing this job. And anyway...\r\n\r\n\r\nThat led to my first company, which is when we moved back to the US, Mystic Hollow Tents, which is like a themed glamping thing where I would come and set up a tent in somebody's backyard that was like where the wild things are themed or wizard themed or something like that. And that was fun. That's like, I loved that, but it took way too long to set up and it was inefficient. like, I just couldn't make the finances work. Anyway, I still have the tent and it's super cool.\r\n\r\n\r\nNik (09:05)\r\nReally?\r\n\r\n\r\nMike Myler (09:24)\r\nyeah. So while that was failing, one of my, like a good, a good friend of mine said that his brother's brother or something had sourced a bunch of dog leashes from China for some course that he was taking. And, yeah, just like, I think in college, he had a, he just wanted to see if he could do it. And, I.\r\n\r\n\r\nNik (09:40)\r\nOkay. Random.\r\n\r\n\r\nMike Myler (09:52)\r\nHe was like, I don't want to do anything with this business. I don't care about these leashes. I just wanted to see if I could do it. So I bought the leashes from him for six grand, a thousand leashes for six grand. And I set a goal on January 1st, 2022 to start a profitable business that year. And so I was like, all right. So I bought them on January 2nd. And I think I lost more leashes than I sold. They just like, weren't that cool.\r\n\r\n\r\nThey had like a wooden dowel handle, which is unique, but not unique enough. In fact, like people that I gave the leashes to, influencers and things like that, and even people I bought, I followed them on social media to track, because people post pictures of their dog all the time and you can see what leashes they're using. They would use my leash for like a week and then they would go back to their old leash. I was like, that's a bad sign.\r\n\r\n\r\nNik (10:38)\r\nSure.\r\n\r\n\r\nAwkward. Yeah.\r\n\r\n\r\nMike Myler (10:51)\r\nAnyway, in the middle of that, my sister -in -law called me and she was like, let's do dog electrolytes. I was like, okay. She had just left. She's like pretty entrepreneurial and then just left a nonprofit where she had, she'd been really successful. And, I was like, okay. So within a month we wanted to vet our ideas. We called vets and pet nutritionists. And the first conversation we had was with this gal named Samantha Henson out in Michigan.\r\n\r\n\r\nShe basically told us what this protocol was and she'd been doing it for the last like five to 10 years in her own practice. She was booked out for a year and a half and she was like, I don't know what to do. Can you guys scale me? And we were like, yeah, yeah, can't like, let's do this. Liz and I had this two hour meeting right after we were just shaking with excitement.\r\n\r\n\r\nNik (11:44)\r\nSo you were taking informational calls in order to better understand the dog electrolyte market. And you ended up talking to someone and she starts kind of discussing, well, yeah, electrolytes are cool, but actually have you heard of this protocol that I actually run on dogs?\r\n\r\n\r\nMike Myler (11:51)\r\nYeah, setting them up, yeah.\r\n\r\n\r\nExactly.\r\n\r\n\r\nYeah, she was kind of like, look, yeah, this is what I'm Yeah.\r\n\r\n\r\nNik (12:04)\r\nYou should go and listen. I'll send it to you. But Chris and I actually a couple months ago, I did a podcast episode where we talked about starting a company with electric dog electrolytes. I think he even bought the domain salty dog. And it like,\r\n\r\n\r\nMike Myler (12:20)\r\nNo, this is what I'm doing. You guys should just scale me. Yeah. I hope you know. Yeah.\r\n\r\n\r\nNik (12:23)\r\nto scale you. But we are like on that episode, we talked about what we would do to like sort of grow and scale that just anyways, it's so that's interesting. you are you currently doing the electrolytes as well or no?\r\n\r\n\r\nMike Myler (12:31)\r\nThat's interesting.\r\n\r\n\r\nNo, no, haven't touched it since that day.\r\n\r\n\r\nNik (12:37)\r\nSo funny. Okay, so that that conversation was so good. You were like, pivot. Why? Why? Why leave the electrolytes and go all in on the gut biome?\r\n\r\n\r\nMike Myler (12:38)\r\nIt's all you.\r\n\r\n\r\nYeah, we just like.\r\n\r\n\r\nIt was just like everything she said was like, yes, we can do that. We can do this. We can create a DIY version of this where you don't have to have a 90 minute call with the nutritionist three times a month. can like it all just seemed very possible. And she was willing to work with us. Like she was willing to advise us and be the brains behind all of it. And it was like, okay, we could go.\r\n\r\n\r\nand learn all we want to learn about electrolytes for dogs and like as like secular analysts, we don't know anything about the dog space other than that. Or we could use this brain that's already been working on this concept for the last 15 years and have her advise us and just scale her. And that just sounded way more attractive.\r\n\r\n\r\nNik (13:40)\r\nThat makes sense, right? Because it's like, okay, it's not that you're any less passionate about or excited about the potential of doing something with electrolytes for dogs. It's just that this was a more readily, I guess, marketable or an easier business to launch.\r\n\r\n\r\nMike Myler (13:50)\r\nYeah, yeah.\r\n\r\n\r\nYeah. Yeah. we were reading her reviews and things too. And it was like, these people were, she had like a little cult. Like she, she changed these dogs lives like in orders of magnitude better.\r\n\r\n\r\nNik (14:11)\r\nYeah, I mean, you were telling me how many dogs has she helped during her career?\r\n\r\n\r\nMike Myler (14:16)\r\nYeah, so she's kept track. She set a goal, I don't know how long ago, to help one million pets. And she just accomplished that like May of this year or something. She's not too much older than me. I think she's like shy 40.\r\n\r\n\r\nNik (14:27)\r\nHow old is she?\r\n\r\n\r\nJeez Louise, and she, a million pets?\r\n\r\n\r\nMike Myler (14:37)\r\nShe's funky, man. She's got a photographic memory. she, or no, was it autumn? Like anything she hears is written down in her book upstairs. And she had the dog encyclopedia memorized when she was six. She's funky. She started studying and reading the back of dog food bags at the age of like 10 or something. Yeah.\r\n\r\n\r\nNik (14:38)\r\nthe goal.\r\n\r\n\r\nRaymond\r\n\r\n\r\nThat's insane, So, all right, so tell me about the business then. So you launched this business. Did you have any experience in e -commerce?\r\n\r\n\r\nMike Myler (15:11)\r\nMm\r\n\r\n\r\nOnly what I've told you about leash sales. it's done now.\r\n\r\n\r\nNik (15:19)\r\nOkay. And, and the, the product that you're selling, is this a proprietary product? Are you white labeling it from somewhere? Like, how are you getting\r\n\r\n\r\nMike Myler (15:26)\r\nWhite labeling, yeah, the more proprietary thing is the actual process itself. Yeah, just white labeling.\r\n\r\n\r\nNik (15:30)\r\nprotocol. So tell me about the size of the business right now. When did you launch the business?\r\n\r\n\r\nMike Myler (15:40)\r\nWe launched it in June of 2022. that right? No, 2023. 2023. And we launched it with a three -month kit that did pretty well upfront, but then we couldn't bring our CAC down. We were charging about $200 for it, and our CAC was like $150. And that just didn't work at all.\r\n\r\n\r\nNik (16:04)\r\nIt wasn't working.\r\n\r\n\r\nMike Myler (16:07)\r\nYeah, and so in December, kind of just let it coast. My business partner went on a hiatus. She had a baby and so she took time off and...\r\n\r\n\r\nNik (16:16)\r\nAnd sorry, who's your business partner?\r\n\r\n\r\nMike Myler (16:18)\r\nYeah, my business partner is my sister -in -law who called me. Liz.\r\n\r\n\r\nNik (16:21)\r\nOkay, so sister -in what's her name? Liz. Okay, so you have sister -in -law Liz and then the person who created the protocol, Samantha. Is she involved with the business or like how does, how is she?\r\n\r\n\r\nMike Myler (16:28)\r\nSamantha out in Michigan.\r\n\r\n\r\nShe is very, so we have her like personally trained nutritionist working for us. She is like anybody who these nutritionists can't solve, have Sam call that person to figure out what's going wrong.\r\n\r\n\r\nNik (16:52)\r\nAnd is Sam on any of this business or is she just a consultant?\r\n\r\n\r\nMike Myler (16:55)\r\nYeah, Sam, Sam, we have a licensing deal with. Yeah. Yeah.\r\n\r\n\r\nNik (16:58)\r\nOkay, very cool. And had she been selling this before?\r\n\r\n\r\nMike Myler (17:04)\r\nShe was doing this and running this protocol and creating just diets for dogs in her practice. But she wasn't doing the e -commerce thing at all.\r\n\r\n\r\nNik (17:16)\r\nOkay.\r\n\r\n\r\nShe wasn't doing anything online. She wasn't selling any of this stuff virtually. So when you set up the e -commerce site, like how did you go about figuring out the pricing? Like you said, the kit that you started selling was 200 bucks and your CAC was 150. Like how did you decide on the 200?\r\n\r\n\r\nMike Myler (17:21)\r\nMm\r\n\r\n\r\nYeah, we kind of priced it out all our cogs and expected overhead and things like that because we actually didn't have it set up at that point, but then multiplied it by three, figuring that if we sold one, we would need revenue to advertise and then sell another one. So it was basically just like multiply it by three and then the CAC was just way too high, way higher than expected.\r\n\r\n\r\nNik (18:01)\r\nSo is there any variability to the price of your products that they're purchasing or is it the subscription covers everything?\r\n\r\n\r\nMike Myler (18:09)\r\nThe covers everything. It varies by size of dog. Small, medium, large, giant. apart from that.\r\n\r\n\r\nNik (18:15)\r\nJust like a normal dog, what's the subscription cost per month?\r\n\r\n\r\nMike Myler (18:20)\r\nSo if you have a, most of our clients are bulldogs because, well, for a number of reasons that we get into, but it would be boring probably. So they're usually like a medium and that's $44 .99 a month for the first three months and then it drops by 35 % a month after that.\r\n\r\n\r\nNik (18:40)\r\nOkay, so $45 a month, that's gonna be about $150 for the first three months. And then the rest of the nine months are what? $35 a month? No, 32.\r\n\r\n\r\nMike Myler (18:50)\r\nYeah, 32, something like that. But again, it's not a year long. It's the first three months and then however long you want to have your dog on a probiotic after, basically.\r\n\r\n\r\nNik (19:03)\r\nWhat is the typical, like what's your churn? How long do people typically stay on?\r\n\r\n\r\nMike Myler (19:07)\r\nYeah, the LTV is confusing right now because we just relaunched with the subscription in April. And so we don't really have very much data on that yet. most people stick through the first three months and then a lot of them will stay on for another two months or something.\r\n\r\n\r\nNik (19:27)\r\nSo five months is currently like the length of time. So let's call it the lifetime value of a customer is I mean, it's not much more than that $200. That's interesting. Is that is that average? Like is that where it should be for this industry? Or is that low? Hi.\r\n\r\n\r\nMike Myler (19:28)\r\nFive months.\r\n\r\n\r\nYeah, not much more.\r\n\r\n\r\ndon't, I don't really know like the, what, what we're doing because it's like a protocol upfront and then, and then like your average pro or like a, your good quality probiotic after, it's just, it's just confusing. Like, I think we need a few more months of data to understand really what's happening. we do have some people who've been with us since day one, like\r\n\r\n\r\nThey've ordered 24 times or however many months we've been open.\r\n\r\n\r\nNik (20:15)\r\nAnd other than a conversation with the nutrition, nutritionist that part I get, what is the fulfillment like? Do you have a, you know, warehouse that you're shipping this stuff from? Or is it is it white labeled and like, like, just basically drop shipping?\r\n\r\n\r\nMike Myler (20:31)\r\nYeah, we just have a little warehouse and a fulfillment gal that is helping us. Yep.\r\n\r\n\r\nNik (20:36)\r\nso you're you are fulfilling orders. interesting. Why not just drop ship? Like, why not fully white label it and let whoever you're purchasing it from handle?\r\n\r\n\r\nMike Myler (20:46)\r\nYeah, we haven't...\r\n\r\n\r\nThey won't like do the labeling for us and stuff like that. Yeah. So the companies that we're currently with won't do the labeling for us, but that's like definitely in the plans.\r\n\r\n\r\nNik (20:56)\r\ninteresting. Okay.\r\n\r\n\r\nDo you know what your customer acquisition cost is right now?\r\n\r\n\r\nMike Myler (21:07)\r\nIt is right around $30. So it was $150 before and now it's $30, which is much better.\r\n\r\n\r\nNik (21:10)\r\ntheir end.\r\n\r\n\r\n30 and then and how are you currently getting customers? What do those channels look like?\r\n\r\n\r\nMike Myler (21:18)\r\nFacebook ads, and then I started kind of my own like almost affiliate style TikTok where it's not wild biome, which makes it easier for me to say whatever I want basically. And then like, I just kind of pitch wild biome.\r\n\r\n\r\nNik (21:33)\r\nHas that been successful using TikTok?\r\n\r\n\r\nMike Myler (21:35)\r\nIt has, yeah. It just kind of clicked within the last month, month and a half. But sometimes we do, like I do three or four times the amount of sales on TikTok than I do on Facebook for a day. yeah.\r\n\r\n\r\nNik (21:48)\r\nReally? How big is your TikTok?\r\n\r\n\r\nMike Myler (21:51)\r\nI only have like less than 2000 followers, but they're all hyper focused. it's the only thing I talk about. Yeah. Yeah.\r\n\r\n\r\nNik (21:55)\r\nYou guys know I gonna say you're still driving. You're still driving sales there. Alright, so you've got a your CAC is 30 your LTV. Let's just call it 210 because that's a very easy ratio, but that's 7 to 1. That's a really good. I shouldn't say really good. That's a good LTV to CAC ratio. Why not throw more money at it? I mean like how fast are you growing at this point?\r\n\r\n\r\nMike Myler (22:21)\r\nWe're growing like 30 % a month, month over month.\r\n\r\n\r\nNik (22:25)\r\nOkay. And what and how much is your revenue on a monthly basis?\r\n\r\n\r\nMike Myler (22:30)\r\nMonthly basis we're making like, I think we made, just shy of like 15 grand last month.\r\n\r\n\r\nNik (22:38)\r\nThat's your revenue or that was your net. Okay, so 15. So you're going between one and $2 ,000 in revenue a month. Essentially, you're bringing on close to 10 new customers every month. Does that sound?\r\n\r\n\r\nMike Myler (22:39)\r\nNever know. Never know. Yeah. Net is five, something like that. Five or\r\n\r\n\r\nYeah. We did just over 100 new customers last month, or two months ago, and 150 last month.\r\n\r\n\r\nNik (23:08)\r\nBecause $145 for that first month, right, would be, how much would that be? Am I like?\r\n\r\n\r\nMike Myler (23:16)\r\nI'm doing it at $45. Yeah, yeah, yeah.\r\n\r\n\r\nNik (23:17)\r\nthat's $4 ,500, right? Okay. So yeah, okay. guess. And then you have a bunch of other people who are already on the recurring side of things, dude. That's all right. So like you're getting new customers, they're coming in into good clip. What is your current bottleneck or restraint to more growth?\r\n\r\n\r\nMike Myler (23:22)\r\nAnd then we have the residual.\r\n\r\n\r\nMm -hmm. Yep.\r\n\r\n\r\nright now we only have, so we have two nutritionists that are capable of doing things, but only one is like train trained. and she is like, she's working another job and then, but she's about to move where she can have more time. So that's about to open up a little bit.\r\n\r\n\r\nNik (23:52)\r\nMm\r\n\r\n\r\nIs the nutritional consult paid or is it like free of charge included with the subscription?\r\n\r\n\r\nMike Myler (24:01)\r\nPart of the whole shtick. It doesn't take her much time to analyze the data that you send her and then give diet recommendations from there. It's enough.\r\n\r\n\r\nNik (24:13)\r\nWhy would the nutritionist be a bottleneck to growth? It seems like you'd still be able to get like generate a bunch of sales. It may be a bottleneck to fulfilling some of that stuff, but not necessarily growth.\r\n\r\n\r\nMike Myler (24:23)\r\nThat's, yeah, I'm sorry, I'm sorry. Yeah, I misunderstood your question. Yeah, the reason I haven't put a ton of money behind it is that I would be afraid that we wouldn't be able to fulfill it, basically. Yeah, yeah.\r\n\r\n\r\nNik (24:36)\r\nreally? Because how quick how quickly after their purchase are they having this conversation with the nutritionist?\r\n\r\n\r\nMike Myler (24:43)\r\nlike within a day.\r\n\r\n\r\nNik (24:47)\r\nWhat is the conversation?\r\n\r\n\r\nMike Myler (24:49)\r\nAgain, it's not a conversation. It's merely her reviewing their 30 point questionnaire and then sending them diet recommendations. Yeah. But in addition to all of that, you get some people who go through the protocol entirely silent and then they leave a five -star review at the end. Those are the golden customers, right? But then you get others who are like, hey, my dog just sneezed too hard.\r\n\r\n\r\nNik (24:59)\r\nWow.\r\n\r\n\r\nYeah, sure.\r\n\r\n\r\nMike Myler (25:18)\r\nCan you please help me? And so the nutritionist has to go in via email and talk through this sneezing issue. And then they have another email in our inbox like 20 minutes later. And so there are people who are very high touch and there are people who are no touch at all.\r\n\r\n\r\nNik (25:33)\r\nCould you license like her knowledge and recommendations for diet? Because it seems to me you could easily take that information, put it into a prompt with artificial intelligence, even chat GPT, the prompt windows wide enough. And then you could just answer customer questions using AI. You wouldn't necessarily need, you could have a nutritionist review it, but you wouldn't need a nutritionist to write out the recommendation every single time. Have you thought about doing that?\r\n\r\n\r\nMike Myler (25:47)\r\nYeah.\r\n\r\n\r\nYeah.\r\n\r\n\r\nMm\r\n\r\n\r\nTotally. Yeah, so we actually had something built like that at the very beginning. it's probably on me that we haven't used it very much, but the questions are so nuanced that I'm not sure it would work anyway. But we should definitely implement it.\r\n\r\n\r\nNik (26:23)\r\nGive me an example of a nuanced question.\r\n\r\n\r\nMike Myler (26:30)\r\nIt's like this spot on my dog is red and it's looking like there's pus below it. fed him, he's on this dog food and he's a little bit overweight and he's had these three conditions for the last six months. All these things are contributing to it. So it's almost like a little medical database.\r\n\r\n\r\nNik (26:57)\r\nWell, but are these nutritionists asking for additional context or are they just giving an answer based on\r\n\r\n\r\nMike Myler (27:01)\r\nThey're asking. Yeah, so that's the other weird thing is like most of the responses that would go out include several different questions based on the email that they got in the first place. Yeah. Yeah. Yeah. Which is cool, mean.\r\n\r\n\r\nNik (27:13)\r\nHmm. So it is hyper tailored.\r\n\r\n\r\nI still think you could still have artificial intelligence like turn one nutritionist into 10, right? Because it, you know, maybe it just takes the base level recommendation and then allows the nutritionist to not have to type up everything or just just focus on the things that are most important. Like I have a company that we're incubating right now. It's an AI healthcare company. And we help with diagnosing in skilled nursing facilities in that setting. And it's essentially what we're doing is we're just\r\n\r\n\r\nMike Myler (27:34)\r\nRight, Yeah.\r\n\r\n\r\nCool.\r\n\r\n\r\nNik (27:48)\r\npulling out the most pertinent data, bringing it to the fore so that the clinician isn't spending 45 minutes reading the patient's whole HMP in order to find the one or two things that they need to focus on. It's kind of pulling it out upfront and they're spending the majority of their mental power actually assessing it as opposed to reading and finding. So anyways, that would just be a suggestion. I think you could absolutely use AI.\r\n\r\n\r\nMike Myler (28:08)\r\nYeah. Yeah.\r\n\r\n\r\nYeah, I'll have to revisit that. Again, we do have the tool built, but that hasn't been used yet.\r\n\r\n\r\nNik (28:16)\r\nThat's about it.\r\n\r\n\r\nEspecially, especially now that you have all of these questions and answers, like how many people have answered the questionnaire?\r\n\r\n\r\nMike Myler (28:30)\r\nWe have kind of like a half questionnaire for our homepage and then we have a full questionnaire for all our customers, probably like between all of that, like three to 5 ,000 people.\r\n\r\n\r\nNik (28:41)\r\nWow. So you have enough data to feed an LLM to basically say, here are all the questions, here are the answers, and then here were the recommendations that each one of these nutritionists gave. And then the LLM would be able to start seeing patterns and making inferences on, red spot behind the ear usually indicates X. I mean, like, so you're kind of building the data that you would need in order to train a model.\r\n\r\n\r\nMike Myler (28:53)\r\nyou\r\n\r\n\r\nYeah.\r\n\r\n\r\nNik (29:11)\r\nto be successful at making those. Anyways, I don't wanna get too sidetracked on that. So you're currently doing Facebook ads, you're currently doing TikTok. I know we were messaging back and forth and you have like an email campaign that you're working on as well.\r\n\r\n\r\nMike Myler (29:11)\r\nTotally. Yeah. No, yeah, yeah.\r\n\r\n\r\nyeah, yeah, just from one of Chris's blog posts or whatever, his cold email outreach, he just, I got a list of like 70 ,000 French Bulldog owners in the US that I haven't started cold outreach for yet. I just got it like a day or so ago.\r\n\r\n\r\nNik (29:44)\r\nWhat, so what about the customers? Let's just say 5 ,000, because that's an easy number. You have 5 ,000 customers, quote unquote. How many people right now, how many paying customers do you have right now that are active?\r\n\r\n\r\nMike Myler (29:49)\r\nMm\r\n\r\n\r\nCurrently, somewhere between three and 400, I think.\r\n\r\n\r\nNik (30:04)\r\nOkay, so you've got a lot that are inactive. Like what's your plan with those inactive customers? it like, I that seems like a very reward, warm lead base to kind of go back to and start mining through. Are you doing any of that?\r\n\r\n\r\nMike Myler (30:15)\r\nYeah, have some email campaigns, although I certainly can admit that I have not focused deeply on that. We have some nurture campaigns and things like that, but they're not as strong as I would like them to be. That's a really good point.\r\n\r\n\r\nNik (30:37)\r\nAnd then do you sell any other products?\r\n\r\n\r\nMike Myler (30:40)\r\nNo, just this one thing right now. It's in the works but...\r\n\r\n\r\nNik (30:45)\r\nYeah, I would think I would think. You have 5000 people that have gone through and purchased with you, so you don't. You don't just have 5000 people that you can sell to again. You have a database of 5000 people you can ask questions to like you could. Obviously you have to use it sparingly, but you could ask them what's a product that we didn't have that you would think that you would like us to have, or you know in the last year, what are some of the pet products you have purchased?\r\n\r\n\r\nMike Myler (31:08)\r\nYeah.\r\n\r\n\r\nMm -hmm.\r\n\r\n\r\nNik (31:13)\r\nRight. And like just get information from them and see which products are the most frequently purchased or most in demand. And then you just easily start adding that a checkout. Right. Like because they're already going to your website, there's already enough trust for them to build that you've built in order for them to purchase the subscription. seems like a no brainer to offer add ons or or for ups upsells, up charges.\r\n\r\n\r\nMike Myler (31:23)\r\nYeah.\r\n\r\n\r\nMm\r\n\r\n\r\nYeah, totally. we do already have some other products that we refer out quite a bit and that are super useful during the protocol itself, which are,\r\n\r\n\r\nNik (31:52)\r\nAre you partnering with any like influencers or thought?\r\n\r\n\r\nMike Myler (31:56)\r\nThat was how we got our first 10K in sales actually from the three month kit was, it's actually Lizzie's sister, my partner's sister. She's got a good following and we helped her dog heal. then she, yeah, she made $10 ,000 for us.\r\n\r\n\r\nNik (32:16)\r\nCause that seems like a very easy way to sell into this market.\r\n\r\n\r\nMike Myler (32:18)\r\nYeah, Yeah, so I've been reaching out. We do have a few influencers currently on the protocol. The issue there is we've got to your dog before you have real skin in the game. And so it's a long process to get not just a candy bar that tastes good.\r\n\r\n\r\nNik (32:36)\r\nTaking time.\r\n\r\n\r\nAll right, well, I have some rapid fire questions to wrap up. Is that cool? All right. What do you love about this business?\r\n\r\n\r\nMike Myler (32:43)\r\nYeah, go for it.\r\n\r\n\r\nI really like that it's actually like we're not a snake oil. I can't take the products myself. It's like we got a call one day from, we get five star views all the time, but we got a call one day from a girl who just was crying. She, her 10 year old dog, they were about to put her to sleep. Her rear end was like emaciated. had this, this bone problem.\r\n\r\n\r\nShe had all these, she'd been itchy for five years. was like, she couldn't go for walks anymore. Three months in and she was like, she had good energy. She was running around. She was a new dog and like this girl was just sobbing on the phone. It was like really cool. Yeah, so that's super fun to know that it's actually changing things.\r\n\r\n\r\nNik (33:20)\r\nmy God.\r\n\r\n\r\nThat's awesome.\r\n\r\n\r\nWhat do you hate about it?\r\n\r\n\r\nMike Myler (33:41)\r\nI think, I think I hate that. It's so, it's so hard to convince somebody that it's going to be real because the customer that we typically get is somebody who's done everything. like they've, they've tried every little probiotic chew and so very, very jaded. And it's also like a high.\r\n\r\n\r\nNik (34:04)\r\nso they're probably very jaded by this point.\r\n\r\n\r\nMike Myler (34:10)\r\nhighly educational product. Like you've got to know a lot before you're convinced. And so it takes a lot there on that side.\r\n\r\n\r\nNik (34:19)\r\nIf you have two hours in your day and you are not working on any work and you don't have any family responsibilities, what are you obsessed with right now? What's like taking up Mindshare?\r\n\r\n\r\nMike Myler (34:30)\r\nYeah, lately it's been like a focus on like anti highly processed foods for me. Like, my wife and I are pretty, pretty healthy people. But we've just like up leveled it feels like in the last three months, cutting out almost all ultra processed foods and, and it's just like fascinating getting into that.\r\n\r\n\r\nNik (34:54)\r\nWere you always like? Were you always like this or did this business kind of spur that?\r\n\r\n\r\nMike Myler (35:01)\r\nIt may be correlated there, but yeah, it's just some podcasts that I've been into and listened to got me thinking, well, I actually don't eat that healthy. Let me try. I've always considered myself as somebody who eats healthy and works out, but these podcasts are like, no, you don't. No, you don't. You're eating chips five times a week.\r\n\r\n\r\nBut I feel like we've cracked a code that says, this is how you stay healthy, this is how you're bought, like you don't gain 20 pounds even without working out for the rest of your life.\r\n\r\n\r\nNik (35:42)\r\nAll right, here's the last question. What advice would you give to your pre -entrepreneurial self?\r\n\r\n\r\nMike Myler (35:49)\r\nLearn to tell really good stories and tell them to an audience. Like participate in telling stories, in writing to an email, like a group of email subscribers or even on TikTok. Like just get really good at telling stories. I think like if you learn that skill and maybe two other marketing skills, I'm talking to myself now, like you will be successful.\r\n\r\n\r\nwhether, whether, like in whatever business you want to start because they're like marketing is marketing. If you learn those key skills, you can take them anywhere.\r\n\r\n\r\nNik (36:30)\r\nI think that's great advice, That's great advice. Where can people come find you? What's name of your company, website?\r\n\r\n\r\nMike Myler (36:37)\r\nWildbound .dog is the website and I think you can search that on Instagram as well, find the same thing. And then my own personal affiliate kind of TikTok is dog people problems.\r\n\r\n\r\nNik (36:51)\r\ndog people problems. All right, I'll go check it out. This was awesome. Thanks, Mike. It sucks.\r\n\r\n\r\nMike Myler (36:52)\r\nYeah, yeah. Yeah, thank you, Nick. Appreciate it.",
  "metadata": {
    "duration": "",
    "date": "2024-12-04",
    "platform_source": "Google Drive"
  }
}