{
  "episode_number": "53",
  "episode_title": "From Employee to Owning a $3.5M Accounting Firm in Only 2 Years with Patrick Dichter",
  "guest_name": "Patrick Dichter",
  "business_name": "Appletree",
  "transcript": "﻿Nik (00:00.807)\r\nPatrick, welcome to Nekonomics, my friend. Super excited to have\r\n\r\n\r\nPatrick Dichter (00:04.364)\r\nIt's good to see you, man. Thanks for having me on the show.\r\n\r\n\r\nNik (00:06.983)\r\nYeah, of course. Most people know who you are, but for those who don't give us a explanation of what your business is and how you make\r\n\r\n\r\nPatrick Dichter (00:15.224)\r\nSure, so I own an accounting and tax firm called Appletree. We serve small businesses nationwide doing quality bookkeeping and tax. And I actually bought the company. So I'm about two and a half years into acquiring the accounting firm. And that's my story.\r\n\r\n\r\nNik (00:31.635)\r\nHow did you get into it? Why bookkeeping and accounting?\r\n\r\n\r\nPatrick Dichter (00:34.892)\r\nI'm not a formally trained accountant. So I spent seven years at a digital marketing startup for small businesses and really enjoyed working with small businesses there. And then I spent three years doing small business coaching and consulting, and all my clients would have terrible books. And I was always referring it out and just saw like how transformational that was when they had clean books and started to hear about people that buy small businesses. And I thought, what if I bought an accounting firm? Cause there's a lot of similarities with the agency that I come from.\r\n\r\n\r\nUm, so yeah, I went looking for an accounting firm to buy and it took 10 or 11 months and ultimately made it happen.\r\n\r\n\r\nNik (01:09.907)\r\nCan you describe really quickly those two verticals? What is bookkeeping and what is accounting?\r\n\r\n\r\nPatrick Dichter (01:15.564)\r\nYeah, so bookkeeping is like, you know, doing the monthly reconciliation, creating a profit and loss balance sheet, statement of cash flows. It's a broad term. like some people might include sales tax compliance in there. Some people might include paying bills and sending invoices and\r\n\r\n\r\nSo that's bookkeeping and accounting. And then tax would be filing business tax returns, filing personal tax returns, tax planning, tax consulting, things like that.\r\n\r\n\r\nNik (01:46.489)\r\nOne thing I've noticed on social media in particular is there are a lot of people who talk about bookkeeping and accounting firms and they're just there for whatever reason enamored by them. Why do you think that is? Like what makes them attractive right\r\n\r\n\r\nPatrick Dichter (02:01.772)\r\nWell, if you go read like all these search fund books or a Harvard business guide to buying a small business, they'll tell you to look for certain things. And the accounting firm checks a lot of these. So they'll look for recession resistant, sticky customers, good margin, capex light. And it checks all those boxes, right? And I think for a long time, a lot of people were like, well, I can't go buy that because I'm not a CPA, but there's been more and more weirdos like me that have bought accounting firms. And so they're like, huh.\r\n\r\n\r\nLike maybe I could go buy an accounting firm. So I think that's a big part of it is they see the, I don't know, that it's always gonna be around. And then I think the other part of it is people are frustrated by their own accounting experience and so they wanna go create a better one.\r\n\r\n\r\nNik (02:48.369)\r\nName those again that Harvard Business Review outlines.\r\n\r\n\r\nPatrick Dichter (02:52.81)\r\nYeah, recession resistant, CapEx Lite, right? So you don't have to buy machinery. Solid profit margin, sticky customers.\r\n\r\n\r\nNik (03:06.941)\r\nYeah, definitely in the tax and bookkeeping space because many business owners don't even know what the PNL is like. They'll look at it right and there are certain places that they'll go and look but how you I don't know categorize your GL accounts or create them or how you allocate certain expenses. That's you might as well as be speaking Chinese. They just want it done right so they can get good data to make good decisions. For give us an idea of kind of like the size and scope.\r\n\r\n\r\nSo you bought a business. How long ago was that? What size was that business? What size of your company's now?\r\n\r\n\r\nPatrick Dichter (03:42.606)\r\nYeah. So I bought it two and a half years ago at the time it was like 1 .2 million in revenue and like 330 ,000 in SDE. We tripled it in the first two years. So this year we'll, I don't know, maybe do 3 .5 million. This would be my third calendar year. So yeah, so I've acquired two more accounting firms and kind of made them all under the one brand.\r\n\r\n\r\nNik (04:02.953)\r\nAnd is it 3 .5 with just that one location?\r\n\r\n\r\nPatrick Dichter (04:12.014)\r\nAnd our team headcount is like 32, maybe 35 people, give or take.\r\n\r\n\r\nNik (04:17.257)\r\nWow. How many of those are accountants and how many of those are like bookkeepers? Sorry, how many of those are CPAs and how many of those are bookkeepers?\r\n\r\n\r\nPatrick Dichter (04:25.206)\r\nYeah, so we have, I think like nine tax professionals. So some are CPAs, some are enrolled agents. And then we have staff accountants who are like full charge bookkeepers. And then we also have, you know, a payroll department with a few people in it and a couple of admins.\r\n\r\n\r\nNik (04:42.857)\r\nSo that business that you bought, I think you said 1 .8 or 1 .5, but 300, okay, but 300 and SDE, typically when these firms trade hands, like my father's a CPA, my father -in -law is a CPA and he's probably gonna sell his practice this year. Typically when they trade hands, they're going to other CPAs. And so they'll look at SDE because that's gonna be what the CPA is pulling out of the business. But for somebody like you, was\r\n\r\n\r\nPatrick Dichter (04:47.47)\r\nWelcome to 1 .2L revenue.\r\n\r\n\r\nNik (05:10.707)\r\nSorry, and let me define that seller discretionary earnings.\r\n\r\n\r\nYou had to probably hire someone to backfill what that CPA was doing that you purchased the firm from, right? So did you factor that in as you were buying the business? And how did you look at maybe valuing upon purchase because you're not a CPA?\r\n\r\n\r\nPatrick Dichter (05:19.916)\r\nRight, right.\r\n\r\n\r\nPatrick Dichter (05:30.05)\r\nYeah. So I'll comment on two things. think normally these trade for relatively low multiples compared to other service based businesses. You know, they'll trade for like two to three times the cashflow. like,\r\n\r\n\r\nI don't know, plumbing and some of these other things go for three, four, five, six times. But usually they're very owner dependent, right? Where, you know, it's like one tax pro and a few admins and like, if he walks out the door, like you're screwed. So I bought a firm with 12 employees that was well run and the manager, the owner had done a good job of like having mostly the other managers own the client relationship.\r\n\r\n\r\nBut I still had to backfill his time. So my plan was to like grow top line. And then I brought in some billable consulting work, you know, that is like small business coaching, consulting, kind of fractional CFO work. And I did that to try to help offset, you know, the debt payments and, and like my salary. So yeah. Yeah.\r\n\r\n\r\nNik (06:32.041)\r\nSo you focused in day one of growing the company for you finding the business. Did you have a broad, I don't know, set of criteria that you wanted to do, right? Like you named those in the beginning, recession proof, sticky customers, high margins, light capex. Was that your criteria? And then you've, just found a business that fit them and it happened to be an accounting and bookkeeping firm or were you like from the beginning, accounting and bookkeeping?\r\n\r\n\r\nPatrick Dichter (07:00.758)\r\nYeah, I had total blinders on for an accounting firm. That's not the norm. think a lot of people look at a ton of different industries. I was hyper focused on an accounting firm.\r\n\r\n\r\nNik (07:08.637)\r\nAnd did you find it and move or did you find one in your area that you already lived?\r\n\r\n\r\nPatrick Dichter (07:13.686)\r\nWe were living in Colorado at the time and we moved to New Hampshire for family, where my wife's from. So I looked at firms in Colorado, I looked at firms in New England, I looked at virtual firms. So the one I happened to buy, the first one was in New Hampshire. And then since I bought, know, virtual firms located elsewhere and we have clients nationwide, but I was kind of looking at those two places where we were living.\r\n\r\n\r\nNik (07:39.465)\r\nfor people who are listening that are either entrepreneurs that want to buy a business or they want to buy that first business as a entrepreneur. Talk about that process. Like when did you decide I'm going to buy a business? And then how long did it take between that decision and actually closing on that business?\r\n\r\n\r\nPatrick Dichter (07:58.437)\r\nUm, it took me 10 or 11 months to like find the one to close on. And really there are a couple of things that made me want to go for it. Um, I didn't grow up with money. We have three kids. My wife's a veterinarian. She has a pile of student loans for vet school. So making a lot of money is important to me. Um, and I had felt like I had done all the right things for the first like 10 years of my career and I had like nothing to show for it, you know?\r\n\r\n\r\nNik (08:16.617)\r\nMm\r\n\r\n\r\nPatrick Dichter (08:27.896)\r\nLike we were able to buy a house in Denver, but I had no money, you know? Like I had worked my ass off as a sales manager at that digital marketing startup. And like, I had some equity, like I had no money. Like, you know, cause we had bought a house, we'd pay for our own wedding, we had health issues. And then I did small business consulting and I'd been presented like a partner path and a chance to buy in. like, when I looked at it, I was just like, just doesn't seem like.\r\n\r\n\r\nthat much upside, you know? And so part of it was kind of like a chip on my shoulder, like a little bit of like, okay, now I'm ready to like bet on myself. And I've been helping all my small business consulting clients, improve their business and like increase profitability. And I was like, okay, I'm ready to do this for myself, you know?\r\n\r\n\r\nThat was part of it. And I do think you have to have that. Like if you're going to go buy a business, like you have to have a chip on your shoulder or something that you're trying to prove wrong. Cause if you're in like a comfy cozy job and you're making a good W -2 like you're not.\r\n\r\n\r\nNik (09:29.575)\r\nYeah, I definitely had a chip on my shoulder. I'm curious though, like you didn't have any money, right? You're like, I don't have any money.\r\n\r\n\r\nPatrick Dichter (09:36.322)\r\nYes, the only thing I had was like home equity, right? So like we had sold the house in Denver and moved and I used like the cash from like the appreciation. And that was like my down payment.\r\n\r\n\r\nNik (09:50.345)\r\nDude, that was the same thing I did on my first business. Yeah, I used the equity that we had made on our California house to put as a down payment for the first company I bought. And I was so grateful for it, right? Cause I'm just like, oh dude, this is amazing that I was able to do that. Did you know that that's what you were going to do? Or were you thinking you maybe had to get investors? Actually, let me take a step back from before that. How did you decide on the size of business you wanted? Right? Cause you could have bought anywhere from zero to 5 million if you're going through the SBA.\r\n\r\n\r\nPatrick Dichter (09:58.466)\r\nThat's funny.\r\n\r\n\r\nPatrick Dichter (10:19.694)\r\nRight. So I knew that I wanted to own a hundred percent myself. The only other option I knew was like a traditional search fund where you only own like 20 or 25%. And I didn't want that. I didn't know at the time that now I know that you could do like a smaller investment where you still own 18 or 90%. You know, I didn't know of those deal structures back then. I might be open to that now, but I, so for me that meant\r\n\r\n\r\na purchase price between like, you know, 500K and 2 million was kind of in the range that I was looking for. And honestly, like good.\r\n\r\n\r\nNik (10:55.383)\r\nDid you, did you figure that out? Sorry, answer, sorry. I'm cutting you off, keep going.\r\n\r\n\r\nPatrick Dichter (10:59.662)\r\nI figured it out that like, okay, I can, I'm probably gonna have to put 10 % down and like, um, but the other thing is like really good accounting firms or bigger ones. They really don't come up for sale or if they do, they trade at higher multiples than like the SBA will pencil for, you\r\n\r\n\r\nNik (11:18.569)\r\nWell, and like, did you go sit down with a banker and say, hey, I'm SBA banker, I'm looking to buy a business. Can you pre -qualify me? Or did you just back at the envelope, you knew kind of how much you had, knew what the debt service needed to be, and you kind of came up with that range of 500 to 2\r\n\r\n\r\nPatrick Dichter (11:33.966)\r\nI talked to a bunch of people and then I generally knew the SBA structure that most often works is like you put 10 % cash down, there's a 10 % seller note and then 80 % is a bank loan. So in my head, I was just like, okay, if it's a 500K purchase, need 50K or if it's 1 .3 purchase, need 130K, et cetera. So that was kind of the math that I was going off\r\n\r\n\r\nNik (11:41.468)\r\nYeah.\r\n\r\n\r\nNik (11:57.289)\r\nAll right, so you buy this business, it's doing $300 ,000 a year in seller discussion, your earnings, you now have a note payment on it, you're transitioning it. What did that look like? How was your first year transition, or not even first year, what was the first month like transitioning that business?\r\n\r\n\r\nPatrick Dichter (12:14.574)\r\nSo I wanted to close November 1st. He wanted to close December 31st, like a true count and like have a clean year. So I close at the end of the year and then you go, what? This is at the end of 21. So I close and then we go straight into busy season, right? So they're like, we don't change anything. We don't hire, we don't do anything different. And so I was kind of forced to just like observe, right? So.\r\n\r\n\r\nNik (12:21.001)\r\nWhat year? What year was it? What year was this?\r\n\r\n\r\nOkay,\r\n\r\n\r\nPatrick Dichter (12:42.72)\r\nIt was information overload the first few weeks of just like, how do I even get into our computer and systems? like, we had this like weird email server, you know, and it was just like such a big learning curve. and then I started to take over sales with the new leads. And then that really took me through May. And then after May, was like, okay, we're understaffed. I'm going to hire, I'm going to try to grow faster. I'm going to try to improve the tech. so.\r\n\r\n\r\nNik (13:11.143)\r\nLooking back, are you grateful that you bought the business going into busy season?\r\n\r\n\r\nPatrick Dichter (13:15.318)\r\nI really wish it would have closed maybe a couple months earlier because I would have tried to hire a couple of people.\r\n\r\n\r\nNik (13:21.065)\r\nI always tell people when they're buying a business, not that I'm super experienced, but I've bought and sold in the dozen, above a dozen now, businesses, the first month, don't do anything. Your whole job is just build trust with the team and understand what the freak is going on. I would hope in the first three months you don't do anything. If it's a sinking ship and you're buying a turnaround, that's a different story. But if you're buying a business because you think it can be profitable and support you, just go\r\n\r\n\r\nand understand what's going on because one of my favorite quotes, do know who Scott Galloway is? Yeah, he's, he always talks about how he became like an activist investor, he'd get on the board and he's like, and what I've learned is they're not as dumb as you'd hoped and you're not as smart as you'd thought. Right? Because you're looking at it before you buy it and you're like, well, if I just do this and I change this up and I'm gonna, I'm gonna make all this money over here. And it's like, hey, they're actually not as stupid as you thought that they were. And you're actually not as smart as you'd hoped.\r\n\r\n\r\nPatrick Dichter (14:17.318)\r\nYeah. Yeah. That's really hard to go do those things yet. But I also think there comes a point where you have to stop playing defense and you have to go play offense. Whether that's at two months, five months, seven months, right? I think some people tread too lightly and they're like, oh, they try to pitter -patter around stuff for 12 months. it's like, no, eventually you got to flip the switch and say, here's where we're going and you're toxic and you probably need to go and yeah.\r\n\r\n\r\nNik (14:26.483)\r\nTotally agree.\r\n\r\n\r\nNik (14:43.465)\r\nYeah. Yeah. And what like once you've established trust and they know who you are and how you operate, like, it's all systems go, but it's really hard to go 100 miles an hour if you haven't built some trust with that team. So okay, so you started growing the business and you guys have grown really aggressively. Now that was managing a practice where you were on site. How hard was it? How hard was it to actually manage the CPA firm? Or sorry,\r\n\r\n\r\nthe accounting firm and the tax prep firm when you didn't have experience versus how hard was it that you thought it was going to be? I don't know if that question makes sense, right? Like, but just walk me through.\r\n\r\n\r\nPatrick Dichter (15:25.852)\r\nSo I feel like I'm like a mentally tough person or resilient, you know, and it's still really hard and really stressful. And like, there's a lot of days where it's a knife fight. So it's been as hard as I thought it would be. Opportunity is bigger, you know, so that's been cool. Like there's way more demand for accounting services than I thought. The other thing I think I was really nervous about was just\r\n\r\n\r\nman, like what if, what if we mess up a tax return or how do we get everything exactly right? And I've just realized like, there's so much terrible accounting and tax work being done out there that like, I really think we're in the top like 10%. We're not perfect. Like we mess up stuff too, right? But like the bar is so low in accounting. There's a lot of people that do their own returns that do a bad job\r\n\r\n\r\nNik (16:15.721)\r\nWhy do you think that is?\r\n\r\n\r\nNik (16:20.35)\r\nMm -hmm.\r\n\r\n\r\nPatrick Dichter (16:24.024)\r\ncommit tax fraud, frankly. And then there's such a shortage of accountants right now. A lot of people have left the industry and a lot of people got burned out in the past few years. And a of people who run small firms are like, they're good at their craft, but they're not good at running a business. So they're understaffed and like, they don't have the tech and they haven't raised prices. So, and I think for a long time,\r\n\r\n\r\nNik (16:50.643)\r\nDid you find?\r\n\r\n\r\nPatrick Dichter (16:52.876)\r\nI think that one other thing is like a lot of times people just didn't associate a lot of value with accounting. They'll pay an attorney a ton of money, but like they won't pay an accountant a ton of money.\r\n\r\n\r\nNik (17:03.219)\r\nDid you find it hard to connect with the accounting team? Did they look at you skeptically? Were they like, who's this guy? He's not an account.\r\n\r\n\r\nPatrick Dichter (17:06.796)\r\nYeah, I feel like for the first few months, they're still like, what's the real story? Like, you tell us that like, you weren't going to change a lot of stuff. And you tell us that like, you really, you like bookkeeping because you're a consulting past and like, you know, they're like, okay, who's the, who's the smooth talker business guy that's coming in? Like, what's the grand plan? You know, until\r\n\r\n\r\nNik (17:28.104)\r\nIs there?\r\n\r\n\r\nNik (17:32.407)\r\nmoment that that changed? Like was there something that changed or did\r\n\r\n\r\nPatrick Dichter (17:36.02)\r\nNo, I think it's just like over time you try to like, you try to help make their lives better and improve their pay and like listen to them. And then hopefully they see some confidence, you know, that like, he does have some value to offer. He, you know, he's made some good hires or he's improved some tech or like.\r\n\r\n\r\nNik (17:57.307)\r\nAnd you grew the business pretty significantly.\r\n\r\n\r\nPatrick Dichter (17:59.542)\r\nYeah, so, but I think it's, change is hard for anybody, know? So like, one thing I have had to learn is like slow down and get buy -in because there's times where I've moved too fast without their buy -in. Or, you know, they're busy and like, I'm trying to drive new clients and they're like, dude, like you gotta slow down on the new client. it's a tricky job.\r\n\r\n\r\nNik (18:23.689)\r\nSo the company's grown, you're probably in a position where, what are margins, net margins on a practice like\r\n\r\n\r\nPatrick Dichter (18:35.598)\r\nSo accounting firms can run between 15 % to 40 % net profit margin. 40 % is really if it's three to five people and not a lot of admin staff. But when you start to get over $1 to $5 million in revenue, you'll see anywhere from 15 to 35 % net profit margin, just depending on\r\n\r\n\r\nhow staffed you are and like how impressive.\r\n\r\n\r\nNik (19:02.441)\r\nSo let's just say for argument's sake, you're 20 % net margins, you're doing $2 million a year, and you're making $400 ,000, that's good money. Why did you decide, hey, I'm actually gonna go buy some more practices? Why not just stick with the practice you had that you're able to manage locally?\r\n\r\n\r\nPatrick Dichter (19:19.438)\r\nYeah. My goal from the start was to get from 1 .2 million of revenue to 5 million within five years. So like five within five years has just been like my North star. And my thought was it would be a big enough business where I'd have leaders in place and it'd be stable enough. And then I'd try to go start buying other types of businesses.\r\n\r\n\r\nSo I'd hold that accounting firm and then we'd try to go buy a landscaping business or a software business or a marketing agency, who knows? But the accounting firm would kind of be the platform that would help us to buy and maybe give us deal flow as well. Yeah, I haven't acted on it yet, but that's become true. We've had clients that tell us that they want to sell and we're the first ones to find out.\r\n\r\n\r\nNik (19:54.707)\r\nallow you to do the rest.\r\n\r\n\r\nNik (19:59.177)\r\nHas that played\r\n\r\n\r\nPatrick Dichter (20:11.053)\r\nor people come to us. So, yeah.\r\n\r\n\r\nNik (20:14.889)\r\nAnd why, why the 5 million in five years? They just sound like a good number or like, are you like, all right, five and five years and I'm out, I'm selling, I'm cashing.\r\n\r\n\r\nPatrick Dichter (20:22.99)\r\nNo, I'm not going to sell it. The thought was 5 million top line would be 20 % bottom line. So it'd give you enough cash to like reinvest in other things. And it also probably mean a head count where you had a good leadership team so that I didn't have to be in it as much day to day. No, I don't know\r\n\r\n\r\nfour is the right number or six is the right number, we're on pace to hit five million within five years. My bottom line hasn't been that strong because I've been reinvesting a lot in hiring ahead. But I'm still focused on that five million mark and then come up for air.\r\n\r\n\r\nNik (20:58.345)\r\nAnd that's normal for those businesses. Your margin's not gonna be great in the years that you're growing. Once you get to where you wanna be, then you can start sort of dialing things in and optimizing your margin. How has the transition been for the practices that you bought that are not located near you? Has it been the same experience or have you found that to be difficult?\r\n\r\n\r\nPatrick Dichter (21:21.166)\r\nSo two of the deals have gone great, better than I thought. One has gone terrible. And the one that hasn't gone that well is the one that I thought was gonna be the home run, you know? So I don't think location was part of it. It was just like other factors with like, is it similar style firm? And then like we messed some things up on the transition.\r\n\r\n\r\nNik (21:24.809)\r\nshit.\r\n\r\n\r\nNik (21:41.651)\r\nCan you talk about that one? Like what\r\n\r\n\r\nPatrick Dichter (21:44.844)\r\nYeah. You know, they had a niche with online course creators and coaches. so, part of it was like, all those people were making a lot of money for a long time and then like Facebook ads stopped working. some of them were struggling and cut costs. The other was like, we, we took over the business from a really dynamic guy who could like do it all. You do accounting and he could tat.\r\n\r\n\r\ntalk tax, could do wealth management, he could know that industry inside and out. so there were big shoes to build and like some of the clients just didn't like us as much. As much as we tried to like take care of them and do the transition. And then the other thing was like there were some client concentration, so there were less clients, bigger engagements. And then when we lost a couple, it really hurts, you\r\n\r\n\r\nNik (22:32.137)\r\nIs there anything you took from that experience that you're gonna make sure on the next deal? You're like, okay, we gotta make sure that this is buttoned\r\n\r\n\r\nPatrick Dichter (22:39.692)\r\nYeah, I think just really making sure you have the right people to transition the clients to being upfront with your messaging and just like what's gonna happen in the transition and then making sure you buy a similar style of firm.\r\n\r\n\r\nNik (22:57.853)\r\nHmm. What about.\r\n\r\n\r\nPatrick Dichter (22:59.372)\r\nLike our term is like tax centric leads the relationship. And this one was like more CFO leads the relationship. And that's just different dynamic.\r\n\r\n\r\nNik (23:06.409)\r\nyeah, that is a different offering. What are your thoughts on doing something de novo like from scratch versus buying another practice? Cause I'm sure you could find CPAs in different markets and then just throw a marketing engine behind them and grow something from scratch, which is potentially cheaper than buying. But what are your thoughts on\r\n\r\n\r\nPatrick Dichter (23:25.836)\r\nYeah, it is cheaper. So I'm constantly thinking about that. Like we grow pretty well organically. You know, we grow by like five to six K in new monthly recurring revenue each month, which I think is faster than most accounting firms. So.\r\n\r\n\r\nPatrick Dichter (23:45.623)\r\nI don't know.\r\n\r\n\r\nNik (23:45.661)\r\nHow are you acquiring customers?\r\n\r\n\r\nPatrick Dichter (23:49.414)\r\nIt's a mix. So part of it is like, or just inbound digital with like Google reviews, AdWords and SEO. And then the other half is people who are buying businesses. you know, through conferences or through the &A community or just my own like personal. Yeah, it's surprising. Yeah. There's a lot of people who are active on there and buying businesses on there and then they reach out to us. So that's been really fun to work with all these people that are buying businesses.\r\n\r\n\r\nNik (23:58.127)\r\nokay.\r\n\r\n\r\nNik (24:05.821)\r\nDo you do lot through Twitter?\r\n\r\n\r\nNik (24:16.937)\r\nHave you ever broken down what your customer acquisition cost\r\n\r\n\r\nPatrick Dichter (24:21.958)\r\nUm, publicly, I don't think I have. if I were to, yeah, if I were to napkin math it, mean, average client for us, you know, was like 900 a month, probably maybe a thousand a month. Um, and it probably costs us a thousand dollars to acquire a customer.\r\n\r\n\r\nNik (24:23.655)\r\nNo, okay. Are you willing?\r\n\r\n\r\nNik (24:41.673)\r\nWow. And they're sticky too, right? Like these aren't, they're not churning after two or three months. You're probably at least 12 months before anyone's like, oh, these guys suck.\r\n\r\n\r\nPatrick Dichter (24:53.774)\r\nSo there's this weird dynamic, like some of them leave within like six months because they closed the business or like they struggle or they're like, it's a misalignment on expectations. Otherwise, yeah, the average lifetime is like eight years, so.\r\n\r\n\r\nNik (25:08.681)\r\nEight years, I'm gonna round up just $1 ,000 a month. So what is that? $96 ,000 is like your LTV for customer and it costs you $1 ,000 to buy them. Jeez Louise, that sounds like a money printing machine. Show me where to put the dollars in.\r\n\r\n\r\nPatrick Dichter (25:25.324)\r\nYou really better start a tax firm or buy your dad or stepdad's practice. But I mean, like here's the downside, right? Like tax talent is so hard to get right now that like, man, it's crazy and so expensive. then I feel like a lot of days I'm like running an airline, right? I do everything perfect and people are just like, yeah, that's what we expected. You make the slightest mistake and they lose their shit. know, they're just like, how could you miss the one thing? And you're\r\n\r\n\r\nNik (25:29.894)\r\nNo, I don't\r\n\r\n\r\nNik (25:51.571)\r\npeople's money.\r\n\r\n\r\nPatrick Dichter (25:55.232)\r\nHow did you not know? it's like, well, we asked you for that piece of information three times.\r\n\r\n\r\nNik (26:01.385)\r\nWell, like my father -in -law is a fantastic CPA. And he missed something two years ago, I think, in the filing. And it was, it was just, it wasn't even that we owed more money or that we pay less than we should have. It was like a, it was a filing penalty of some sort. And it came in at like $20 ,000 per member of the LLC. And so it was like $100 ,000. He ended up, we ended up working it out and it wasn't, we didn't owe anything, but it's\r\n\r\n\r\nit's a pretty high leverage position to be in when you're managing people's money, right? So when you do screw up, you can royally screw up, unfortunately. Are you thinking about expanding into other customer acquisition channels or are those like the ones you have are currently the best? And so you're like, Hey, look, if I can continue to exploit these, I'm fine, because I can't necessarily grow the supply side. Because of the accounting, the accountant shortage.\r\n\r\n\r\nPatrick Dichter (26:36.876)\r\nYeah.\r\n\r\n\r\nPatrick Dichter (26:58.422)\r\nI'm always like trying different channels, you know, like there'll be a directory we try or a conference we sponsor or, you know, different content, but, yeah, I, it still comes back to like my personal Twitter and Google reviews, like what does it, know? So, but I'm still trying to try other things just so we have diversified channel. like, I'm thinking of\r\n\r\n\r\nNik (27:17.641)\r\nAmazing.\r\n\r\n\r\nPatrick Dichter (27:26.008)\r\nbrand that I'm trying to have a few years from now.\r\n\r\n\r\nNik (27:28.873)\r\nAll right, I have some rapid fire questions for you. You ready? What do you love about this business?\r\n\r\n\r\nPatrick Dichter (27:34.732)\r\nI love helping small business owners and I love helping people buy businesses. I'm a deal junkie.\r\n\r\n\r\nNik (27:40.841)\r\nWhat do you hate about\r\n\r\n\r\nPatrick Dichter (27:45.102)\r\nthat make a small mistake and people freak out. And I would also say like, we have to chase clients so hard. You know how disorganized small business owners are and like that whole thing of like, we can do everything else right, but like, we'll have to ask for a piece of information 12 times before we get it from a client. that gets, yeah.\r\n\r\n\r\nNik (27:47.953)\r\nYeah.\r\n\r\n\r\nNik (28:05.481)\r\nThat's a big pain in the butt, All right, we're all a bit jealous. So as you sit here, what businesses or industries are you the most jealous of right\r\n\r\n\r\nPatrick Dichter (28:17.332)\r\nevery week man like I'll be I'll meet somebody I'll be like they make yarn and they make how much money right or like you know this person manufactures this niche part and they're like making two million of EBITDA per year you know or I mean\r\n\r\n\r\nNik (28:36.041)\r\nSo it's not necessarily a type of business. You just get jealous of, like, man, that sounds fun.\r\n\r\n\r\nPatrick Dichter (28:40.108)\r\nYeah, yeah. But if I had to pick like SaaS businesses, definitely I have any about SaaS businesses.\r\n\r\n\r\nNik (28:50.555)\r\nAll right, if you have two hours of free time and you don't have any family responsibilities and no business responsibilities, what are you obsessed with? What are you doing with that\r\n\r\n\r\nPatrick Dichter (29:01.432)\r\nfly fishing. Yeah.\r\n\r\n\r\nNik (29:02.663)\r\nReally? Okay, I'm gonna ask you really dumb question. I don't really know what fly fishing is. Like I know that guys sit out there for hours in their boots and like, why do they call it fly fishing?\r\n\r\n\r\nPatrick Dichter (29:14.666)\r\nHave you ever been fishing? Like, no.\r\n\r\n\r\nNik (29:16.157)\r\nI've been fishing, but I've never been fly fishing.\r\n\r\n\r\nPatrick Dichter (29:19.32)\r\nDo you have fun doing\r\n\r\n\r\nNik (29:21.097)\r\nDo I have fun doing it? No, but I know lots of people do.\r\n\r\n\r\nPatrick Dichter (29:23.022)\r\nOkay. The difference with fly fishing is like, I feel like you can like, it's a little bit more active than just like sitting there with a rod and waiting because you're doing something and you're walking around and you also, you feel the fish more. So like for some people, there's like a caveman thing in you when you catch a fish and feel it, you feel that even more on a fly rod. And we're just snobby dickheads that think it's like a more pure way to\r\n\r\n\r\nwith your fish, you know? And it's like a puzzle piece of like thinking about the bugs in the water and the weather and like the things that go into\r\n\r\n\r\nNik (30:00.563)\r\nIt makes sense to me, you're a deal junkie. You like to catch that whale. so fly fishing makes sense to me. And maybe I should try fly fishing. If it's more active, that's my thing I don't like about fishing is, especially about myself. I'm like, gosh, like kill me now, this is so boring. If I'm out with somebody that's different, right? But fly fishing would be nice if you're more mobile. I know.\r\n\r\n\r\nPatrick Dichter (30:18.828)\r\nYeah, man. There's world -class fishing in Idaho. My uncle who taught me growing up, they lived in Ketchum and in Sun Valley. And that's where I learned it a little bit as a kid growing up was in Idaho.\r\n\r\n\r\nNik (30:30.003)\r\nDang, all right. Well, next time you come out, you gotta come visit. All right, last question. What advice would you give to yourself, to your pre -entrepreneurial self?\r\n\r\n\r\nPatrick Dichter (30:42.286)\r\nstart sooner, just get in the game. think I am good at being persistent and working hard and having a good attitude. I feel like that's, once you're in the game, luck comes to you and more opportunities come to you. But there's never a perfect time and things aren't going to line up. So I think if you have those traits of a figure it out factor and\r\n\r\n\r\nNik (30:43.699)\r\nReally start, say\r\n\r\n\r\nPatrick Dichter (31:11.832)\r\nkeep your head on straight, like start earlier and like the compounding will go from there, yeah.\r\n\r\n\r\nNik (31:18.857)\r\nCool, well, I love this. I've learned a ton. Appreciate you stopping by. You've got some cool stuff going on. You and Clint Fiore just started a podcast, right? Tell me about\r\n\r\n\r\nPatrick Dichter (31:28.088)\r\nSure did. Yeah, inspired or acquired if you're looking for another podcast and you're bored.\r\n\r\n\r\nNik (31:34.629)\r\nOkay, no, no, no, do the pitch because it's a really, really cool idea.\r\n\r\n\r\nPatrick Dichter (31:37.688)\r\nSo the format, we interview business owners and give them a valuation live. So we'll be like, all right, man, you own a landscaping business in Austin doing X revenue of X employees and X profit. Currently the valuation would be Y. Would you sell it would you hold it? And we'll ask them like on the spot and they'll be like, I don't know. And then we'll zoom out, talk about the business and like where it could be in a few years and then we'll update it. And we'll say, okay, then based on that, here's the new valuation. Would you sell it would you hold it?\r\n\r\n\r\nSo it's really like just real conversations and real numbers with people who own businesses and Clint being a business broker brings a cool unique lens to it.\r\n\r\n\r\nNik (32:14.953)\r\nIn the few that you've done, because you've done now 10 to 15, is there any surprise in what people choose?\r\n\r\n\r\nPatrick Dichter (32:23.724)\r\nI think most, well, most of the people who are willing to come on, they're not going to just say like, I want to sell tomorrow because I think they don't want to like freak out their staff. So most people, most people are saying like, I don't want to sell yet, but.\r\n\r\n\r\nNik (32:32.138)\r\nOkay, yeah, yeah, makes\r\n\r\n\r\nNik (32:37.747)\r\nThey're inspired. They leave inspired.\r\n\r\n\r\nPatrick Dichter (32:40.054)\r\nYeah, we're inspired by them, you know, because they're like crushing or growing these pretty amazing businesses.\r\n\r\n\r\nNik (32:45.959)\r\nOkay, so it's an inspired or acquired. All right. And then where's the best place for people to find\r\n\r\n\r\nPatrick Dichter (32:52.034)\r\nYeah, happy to chat with anyone. know, you can find me on Twitter or LinkedIn, wherever, just Patrick. And then my last name is Dictor, D -I -C -H -T -E -R. thanks for having me. See ya.\r\n\r\n\r\nNik (32:59.657)\r\nOkay, this is Radman, appreciate you. Yeah, of course. See ya.",
  "metadata": {
    "duration": "",
    "date": "2024-09-04",
    "platform_source": "Google Drive"
  }
}