{
  "episode_number": "71",
  "episode_title": "From Zero to $42 Million: Building a Franchise Empire and Leveraging Content Marketing with Brian Beers",
  "guest_name": "Brian Beers",
  "business_name": "Midas Automotive Repair Shops",
  "transcript": "﻿PART 1\r\n\r\n\r\nNik (00:00)\r\nAll right, Brian Beers, thank you so much for joining me on Niconomics, my friend. You know, there's a million places people go and listen to your background because you've been on a ton of podcasts and it's freaking fascinating. You've done some incredible stuff, but if you could give us the elevator pitch, the two minute version of what's your background, how do you make\r\n\r\n\r\nBrian Beers (00:05)\r\nAwesome cool, thanks for having\r\n\r\n\r\nYeah. So, I mean, I've been in franchising my entire life. Actually, my parents got into franchise in the seventies. So was like born into it. And so, you know, over the last 15 years, I've built this company kind of from what my dad started up to what I've scaled it today. So we own, it's my brother and I, we have over 30 automotive repair shops. That business will do $42 million in revenue. We just launched a painting business. I have another business where we help people find and scale franchises.\r\n\r\n\r\nAnd now I'm going kind of this kind of like online media presence in order to find people that we can partner with and kind of continue to expand and help people build a fortune through franchising.\r\n\r\n\r\nNik (00:57)\r\nOkay, you've done an incredible job. I mean, if anybody wants to listen to your background, there's an episode that you just did recently with Alan Pence on the Small Business Mentor podcast. And they go listen to that because it'll give you like, how you started how you grew how you rolled that. Yes, your parents are your dad and your uncle started in franchising, but it wasn't like you inherited, you know, $42 million worth of revenue in those in those locations that I think they had like six or so somewhere in that\r\n\r\n\r\nBrian Beers (01:25)\r\nAnd had six and then, you know, I was just, I was an employee. Like I did my first D, I was six years into it. And then I, you know, my brother and I, whatever we saved money and then we went out and bought our own like business, you know, bank loan or whatever. uh, and we rolled it all as like one company. Like we operated as one unit, but like, you know, there was a six original stores and I, know, we had two of them. And then, um, you know, we just, we just kind of kept all the money in there. We didn't really take distributions and then just use that money and then 17 to buy another store and two and 18 and two and 19 and 20.\r\n\r\n\r\n21 was like 11 and then five and then six and then whatever. It kept compounding. Then eventually we bought out, you know, my dad.\r\n\r\n\r\nNik (02:03)\r\nSo you've been following this roll up strategy playbook. Like it's a tried and true strategy to roll up and grow and build revenue and build these locations. But you've done something recently that I want to talk about because I'm fascinated by it. Where you have pivoted, I don't even know if pivoted is right word, but you've gone harder into content. So you've got a fairly large Twitter following. I don't know how many followers you have, 40 ,000, 30 ,000 followers. I don't know if you're on Instagram, but I'm sure you'll start.\r\n\r\n\r\nBrian Beers (02:24)\r\n30, 30ish.\r\n\r\n\r\nNik (02:32)\r\ngoing there with this, but I've seen you start putting out some incredible freaking quality videos, man. Tell me about what you're doing.\r\n\r\n\r\nBrian Beers (02:33)\r\nat point.\r\n\r\n\r\nYeah, so I mean, I've I don't know, I've always loved teaching people like even in in all the business we own, like I'd be the guy that would want to teach people, you know, here's like the bigger vision. This is what we're trying to achieve. This is the playbook. This is what we have to do. Like, I've always loved that that component of just like, you know, the aha moment of helping people kind of see the light in that and that and then helping them achieve it. Right. So like, and I know, like, if I can teach somebody something and then they can do it and then they have success.\r\n\r\n\r\nAnd now there's a light bulb moment in their head. Now they continue to do that thing, right? Now I don't have to like teach them or force them or whatever, because they now believe it, right? They saw the vision, they did the thing, whatever, maybe they had some problem, but they overcame it. And it's like the hero's journey, right? As you go through. I've always done like, that's how I built the company like from zero pretty much was help was teaching and educating and coaching. So I've always had like a passion for that. And then, you know, I,\r\n\r\n\r\nYou know, it just expanded. It's it like started small. It started small and it snowballed of like going on Twitter, just like, here's my story. Here's how I built this thing from from scratch. And here's how we scaled it. And like, ultimately, you know, it's it's helping, you know, create like a great life for me. I have many friends who it's the same thing and like who own franchises and together like, you know, we're similar ages and going through, you know, similar things and having similar success. And so like, it's duplicatable. Right. But it's a it's a thing we're not a lot of people know about. Right.\r\n\r\n\r\nThere's a lot of misconceptions in franchising of, you know, from, it's McDonald's or it's KFC, or it's like, you know, you need millions of dollars to do it, or it's like a chuck in a truck and, you know, only you buy yourself a job. It's for people who are unemployable or like, whatever. And like both those scenarios are true. It's like two ends of the spectrum, but there's also this world in between. And, you know, I thought, hey, if I can help people just like learn about\r\n\r\n\r\nand I can help other people make money and like ultimately have success and like get on the path to building wealth and cashflow that like good things will come of that. Right. And even when I first started, had no, there's no product to sell. There was no monetization. It was more of just like, like I know I'm having success. If I teach other people how to success, like good, good things will happen. And so that's kind of how I got, I I got started on\r\n\r\n\r\nNik (05:04)\r\nSo I get that with the Twitter stuff, right? Like, hey, I'll post some content. I'm kind of giving back. I'm helping people understand. I'm educating, et cetera. But your YouTube stuff is so freaking high quality. Like, you're obviously super intelligent. You teach really well. You break down concepts in a way that make it accessible for people. But then you add, like, the editing and the lights and the production value on it. And I mean, it's just top notch. It's a matter of time before you gain steam on YouTube.\r\n\r\n\r\nWhat's the thesis behind it? Like, yes, there's good things will happen for sure. But what's the thesis behind putting that much time and energy and\r\n\r\n\r\nBrian Beers (05:37)\r\nYep. Yep.\r\n\r\n\r\nYeah, so that's how it started, I guess. And then how it's going is I've been at the Twitter game for two years. I follow a lot of the major people, right? The personal brand people, Cody Sanchez is a big one I follow and number. And they all talk about like, there's these different forms of capital. that, it starts with like there's money capital.\r\n\r\n\r\nwhich is like, you people have money, right? Get things done. People who have labor, like they have labor force taking it stuff. There's code, right? You can write code. can like whatever you can own the world. And then now it's audience, right? It's people who have attention and who have audiences. And there's totally unknown people who have no money. They have no code. They have nothing, but there's a large group of people that, you know, like them, believe in them. And then that can create, you know, amazing value because you can speak, you know, directly to people and, know, as, the\r\n\r\n\r\nthe world gets like more polarizing, right? People push away from each other. They also come together in these groups. anyway, so I, whatever, I buy into that theory. I live it, like I'm in certain groups that are, know, very tight knit and, you know, some of them we've never met in person, but we know each other, right? And we help each other because we're on similar paths, you\r\n\r\n\r\nNik (06:53)\r\nI wholeheartedly believe in this thesis as well, which is if you have an audience, you can own distribution. And if you own distribution, that's a massive competitive advantage. You may not have the capital, you may not have the time, you may not have the expertise, but if you own distribution, you can still be hyper successful. you see it, Cody Sanchez, she has an investment thesis that I've heard from people close to her where it's like, is this a media accelerated business? Her whole thing is investing in media accelerated businesses.\r\n\r\n\r\nAnd you see it, you she bought into Rezzi brands, which I, yeah, you have a that one. Do have that one painter? Okay. Yeah. So, so she, she bought into Rezzi brands. That's a media accelerated business. You look at Alex Hormozi, he's doing a very similar thing as well with acquire .com where he's going and sort of helping these companies that can be accelerated by media is your thesis to like niche down on that and say like, I'm going to be X.\r\n\r\n\r\nBrian Beers (07:28)\r\nYep, yep, yeah, we're franchisee.\r\n\r\n\r\nYeah. Yeah. Yeah. So my thesis that I'm currently like laying the groundwork for is to do what our XR Mozi is doing, but in the franchise world. So give out a whole bunch of free content, right? To educate everybody on how to find a franchise, how to scale it. And then ultimately through, through media filter down to find like the best operators who then we can partner with and we can provide capital and we can provide coaching and guidance to help them.\r\n\r\n\r\nyou know, scale their business because like, like, I can only do so much. Like, like, like you need somebody who owns a business who eats, sleeps and breathes it to really grow it. Right. Like, and, and I, I only can eat, sleep and breathe my business. And as, as much as like, you know, there's this, I have this whole thing on holding companies. We could go down like that rabbit hole if you want, but like this idea that, I'm going to own all these businesses. This is kind of, you're like, I don't know. I don't know. But we can talk about this. What's, what's side note this, but\r\n\r\n\r\nNik (08:42)\r\nYeah, please.\r\n\r\n\r\nBrian Beers (08:46)\r\nI don't know all these businesses and like, but what happens is you get dilution, right? You get dilution of focus. you know, that happened to me years ago. We owned a bunch of different franchises. None of them worked out because like I was the only key person in it. And so, and so, you know, our thesis too is like, let's, let's instead of me having all these like employees and like me being still the one, even if we have some partners, like let's find the guys who this is their life.\r\n\r\n\r\nAnd then we can help accelerate them to building an eight figure business. that's, mean, ultimately faster with the story of like why I'm doing all this stuff. That's one of the key pillars we're looking for is using content to find, to educate people, to build a reputation, to build trust, to find the people, to eventually partner with. Then then they get the inside track knowledge. And we've done a few of these so far.\r\n\r\n\r\nNik (09:35)\r\nWhen are you getting the nose strip and the really tight short shorts with the cutoffs? You're not hitting the gym enough yet? You gotta pump those numbers up rookie if you're gonna compete with Alex.\r\n\r\n\r\nBrian Beers (09:39)\r\nyeah.\r\n\r\n\r\nThat's right. Yep. I'm working on it. go to the gym. I go to the gym twice a week. So I am getting, I can bench my body weight. So I know, I know we're different, but yeah. So back to your original question. So why YouTube? So I've been on Twitter for two years. You Twitter's fun for like real time thing, right? I mean, I, you know, I've had people throw it, but it's also like, if you don't put out content\r\n\r\n\r\nYou don't give you right and stuff you tweeted on two days ago is completely lost in the ether It's like YouTube people watch YouTube videos from seven years ago. Like I've had people It's an asset. It's like buying real estate you put out build YouTube. It's real estate it produces you know, it can produce for years and I So now my strategy is hey YouTube for like like Twitter's great for like testing ideas see what sticks right?\r\n\r\n\r\nBut then ultimately the goal is to get them over to YouTube and then ultimately to own it through email.\r\n\r\n\r\nNik (10:45)\r\nI think like what I discovered and probably what you're discovering as well is like, Twitter's a great platform for real -time interaction and engagement, but the discoverability of YouTube and Instagram doesn't even compare to Twitter. They are so much better. Like YouTube, you're going, like, how do I start a franchise? And if you've got lots of content on there over years of time, of course, Brian's going to pop to the top. Nobody's going on Twitter and being like, how do I buy a franchise? They're just not searching for that.\r\n\r\n\r\nBrian Beers (11:01)\r\nYeah.\r\n\r\n\r\nYep.\r\n\r\n\r\nNik (11:15)\r\nAnd even if they go to your profile and they start scrolling, it's like, there's so much text. Maybe they get like five tweets deep, but you go to Instagram or you go to a YouTube channel and like you got pictures. cool. I can click on this. This looks attractive. This looks great too. So it's like the discoverability of those platforms is so much better than Twitter. Anyways, there's a lot of things I love about Twitter, but there's also lot of things that are frustrating about it. How, when did you kind of come to this? How did you, and why?\r\n\r\n\r\nWere you like, hey, I want to get to a hundred million dollars. And so I got to figure out a way to scale there. Like what, what was the.\r\n\r\n\r\nBrian Beers (11:48)\r\nYeah, I I've I'm a couple things. I've invested a lot of money into into coaches over the years. Right. I mean, I'm like a coach in a lot of ways. I like I view I view it as, you know, eating, eating it too. So, you know, I've hired personal brand coaches to learn this stuff. A lot of it is through them. One of them was Roy Vadin's brand builders. He worked at my let a bunch of people. That was the first one I did. did that like two years ago when I first started my podcast.\r\n\r\n\r\nNik (12:02)\r\nYeah.\r\n\r\n\r\nBrian Beers (12:16)\r\nUh, that one was pretty good. Most recently I'm in Mac gray. Um, I know you follow him on Twitter, but he's got millions of followers. It's all about, it's all about personal brand and then building a business around a personal brand. Um, and a lot of, a lot of, yeah. 37.\r\n\r\n\r\nNik (12:30)\r\nI'm curious though, like how old are you? Okay, so we're like the same age. You have kids?\r\n\r\n\r\nBrian Beers (12:37)\r\nYeah, seven and three.\r\n\r\n\r\nNik (12:38)\r\nOkay, I got four boys under 10, 10, seven, four and two. It's a crazy house. But like you're successful. You've got a big company, it's growing. You don't have to do anything. I'm not saying you could go to, you know, retire on a beach, but why start investing all this time? Like what's the motivating factor behind\r\n\r\n\r\nBrian Beers (12:57)\r\nYeah. Yeah, I get that question all the time. And I think it's like, I think it's it's ingrained in me. And it's it's people. It's like people who build big companies, the only thing they know how to do is work. You know what mean? It's just like, like, I am just not like, I'm just gonna like turn it off and like, go golf all day. Like, like the people who can build the big company aren't the people that can just turn it off. It doesn't it doesn't work that way. And like, I like new challenges. Like, I like the challenge of figuring\r\n\r\n\r\nin that business is how do we go through acquisition? How do we how do we structure these seller finance deals? Like I only went to a bank one time to acquire all the you know, we've done millions of dollars of seller finance deals that like we figured out how to do we're paying cash or like whatever like that was a it's like a game. Now we're in this phase of like that business has slowed down from an acquisition standpoint, which is what I enjoyed. Now it's into like finding vacant buildings and developing stores basically from scratch and that takes okay, it takes nine months maybe to open a store\r\n\r\n\r\nI don't, that's like not fun to me. And I have, I have a team of people they can, they can like, hire all these ex military special operations guys who love that shit. Like they're really good at like the organization, the planning, the follow through and like dealing with the vendors and like all that stuff. Like I don't want to deal with any of that stuff. And so then it's like, I enjoy the challenge of building this, of, I have no idea how to build a media company. Like I literally started with from zero knowledge base.\r\n\r\n\r\nBut I enjoy the process of learning and growing. And now I'm like, I'm figuring it out. Right. And like even, you know, and, and even code like, and it's cool. Cause like the more I figured out the more like I get connected to other people. So Cody Sanchez, I wouldn't say we're friends, but like we're in a text basis now and like, but I get to like ultimately, yeah, we're, familiar with each other. We'll leave it at that. And maybe we'll be friends by the time this podcast comes out. don't know, but\r\n\r\n\r\nNik (14:43)\r\nYou're familiar. Yeah.\r\n\r\n\r\nI hope\r\n\r\n\r\nBrian Beers (14:51)\r\nBut like as I, you know, as I like it, then I can, I get to start to know other people and, then I can like, I can learn from them because they're a bunch of steps ahead. You know, she's three years ahead of me. Like I knew of her three or four years ago. She spoke a lot into this, this mastermind that I'm part of. Um, and she had no, she had no following, right? And like, so it's, it's something like that huge growth three years, you know, 6 million followers. I think it is now from, from zero. Like I, I'm, I'm nervous, zero. And, and like, I just look at that and be like, man, there's a lot I can learn.\r\n\r\n\r\nAnd like, and then even, you know, I get to that level, then it's like, you know, whatever it's the Hermosies or the Milets or like whoever it is then, who's a couple more steps ahead. And I don't know. I always just like, like that to me is fun and exciting and it's new. And it's like, um, and I know it can have, I can have an impact on a massive amount of people versus like, even if I stay in my company, we have 200 employees, right? Maybe we could double, maybe we can get a 400, but like, I mean, I could have an impact on millions of\r\n\r\n\r\nRight. think, I think that is more exciting and fun and, just enjoyable.\r\n\r\n\r\nNik (15:54)\r\nIt's such a weird thought because I've had that thought before too. mean, you are actually going to do it. I may or may not do it. But it's like, am I prideful? Am I a douche for saying like, yeah, I could do what they're doing. And then I look and I'm like, no, I could do what they're doing. Why could I not do what they're doing? It's just kind of a weird head space to be for me sometimes.\r\n\r\n\r\nBrian Beers (16:07)\r\nYeah, no, I don't think that's at all.\r\n\r\n\r\nYeah, I mean, one of the things that I, I mentioned I was in this mastermind group. So I'm in this group. I've been in for years, you know, and there's guys in it worth a hundred million dollars, $200 million. And, you know, they share the financials, they share their stories, you know, they're like interviewed kind of on a nothing holds back private thing. you know, even the guys, you know, worth, you know, huge, huge amount of money, you know, not that much older than, I mean, in their fifties or whatever. And his mindset,\r\n\r\n\r\nwas he looked at other people ahead of him and said, they're not any smarter, they're not any more educated, they had a plan and they work, they set goals and they work hard. And if they can do it, then I can do it. And so like, so that was the thing he, that was like, he lived by that. And then I was like, man, I think the same thing. Like I see other people doing this stuff. And I'm like, I can do that. Like even like Graham Stephan, he's like what, five million YouTube followers. I look at his videos, like I kind of, whatever.\r\n\r\n\r\nWe kind of look alike or whatever similar profile. We're probably like short, we're like short white dudes, whatever. He's like a similar age. I think he might be a little bit younger. Yeah. Yeah. Yeah. But like, I just look at him and like his videos, like aren't that impressive, like from a production standpoint and the content he talks about isn't, isn't that great, but he's extremely consistent, right? He puts out, he's done seven years straight of two videos a week or whatever it is. And he's built this and he's, he's built this amazing business\r\n\r\n\r\nNik (17:14)\r\nYeah.\r\n\r\n\r\nGet better\r\n\r\n\r\nBrian Beers (17:40)\r\nAnd I just look at those guys and like, man, if he can do it, I can do it. And like, then maybe I can do it in five years instead of seven years, right?\r\n\r\n\r\nNik (17:46)\r\nWell, it's kind of interesting. I'll be vulnerable with you for a second. I watched one of your YouTube videos and I had the same thought. Not for the reasons maybe that you're saying, but I, you two years ago I had companies that were doing $30 million a year in revenue, 300 plus employees, and I sold most of those companies. And I've done deals, $10 million plus, and I've bought and sold over a dozen businesses. And when I watched your video\r\n\r\n\r\nthe seller note process. And when you were like, I've done millions of dollars in transactions and we've and I think you said you've done like $2 million worth of deals or three somewhere in that ballpark. Six. Okay, I'm sorry, six. Sorry, that wasn't I was like, I was like, dude, I've done more than six. Like I have experience here. It was like it was for me like almost this weird validating feeling of not like oh, Brian sucks, right? That wasn't the feeling it was like, oh, okay, I could play in this arena because I actually\r\n\r\n\r\nBrian Beers (18:19)\r\nOkay. Yeah.\r\n\r\n\r\nSix. Six. Yeah, but yeah. Yeah. Let's get the finger count right.\r\n\r\n\r\nNik (18:46)\r\nexperience in that space. think that's a very important characteristic that you have where when you're exposed to it, you're like, yeah, why couldn't I do it? I can do\r\n\r\n\r\nBrian Beers (18:56)\r\nYeah, the challenge, the biggest challenge anybody has who wants to build a personal brand or be a creator, like whatever the terminal, an influencer, right? There's like these different tags at the end of the day. It's all the same, right? Is it's consistency. It's showing up every single week and putting out content. And I mean, I struggle with that. Like I, I'm like, I spent a lot of time on this and I still struggle with it. Right. And so like,\r\n\r\n\r\nNik (19:20)\r\nI can tell.\r\n\r\n\r\nBrian Beers (19:22)\r\nAs much as there's people out there, you and me prior to this, it's just like, it's the commitment to do it. Even MrBeast talks about how do you grow on YouTube, how do you get better? And he's like, we'll make 100 videos and then let's talk. And nobody makes, people drop out if you're making five. But you have to make the 100 videos to get enough reps in to build the habits to then be able to take it to the next level.\r\n\r\n\r\nNik (19:50)\r\nThere is no shortcut.\r\n\r\n\r\nBrian Beers (19:51)\r\nYeah, there's no shortcut to any of stuff. It's the same as building a business. I look at like the directory of our of our business and whatever 42 million all this stuff like, but like, oh, yeah, yeah, oh, God,\r\n\r\n\r\nNik (20:01)\r\ndid my camera just shut off? What\r\n\r\n\r\nGreat, I was just talking about how great El Gato is and now, just freaking shuts off on her.\r\n\r\n\r\nBrian Beers (20:08)\r\nI know, I know,\r\n\r\n\r\nMight be your... I've had this happen. Maybe try turning it on and off.\r\n\r\n\r\nNik (20:15)\r\nI turned it off and turned it back on. We'll see what that does. There we go. All right. Yeah. Thank\r\n\r\n\r\nBrian Beers (20:18)\r\nThere you go. All right, we'll edit and back to my 40 million. I've seen even an art growing in our business, You know, 42 million or whatever. But it's like an exponential compound growth curve where you do all this stuff in the early days and you're going a little bit better, but you don't see it. You don't feel it. It's the story of the penny that doubles every day or whatever. And it's like, it takes a long time before you start to really see it, but then it grows exponentially.\r\n\r\n\r\nIt's the same like, you know, like the rich get richer, right? Like in our franchise business, like, as we become a better dealer and like make more money, we'll get like the franchise or brings us deals, like other people come to us with deals, we get better negotiating power with vendors, like we can get cheaper prices than than other people because we've got the buying power, like a lot of that stuff, like happens. And I think it's the same thing in the content game\r\n\r\n\r\nIt's this compound growth and it feels like you're not making sense. where a lot of people give up on it. But then bam, it things happen exponentially. And then all of sudden now like you're rich in content and now you start to do deals with like Cody and Alex and Graham and all of sudden now I'm being exposed to millions of people and like it grows like a rocket ship. And I think I know that's going to happen if I'm consistent.\r\n\r\n\r\nNik (21:39)\r\nWell, I have no doubt about it if you're consistent, your content's really, really good. You're smart. You break things down really easily and you're building trust at scale. Like that's what social media is. It allows people to build trust in you in scale. Usually you're doing it one -on -one, but this allows them to like hear you for hours on end. And like just to tie the bow on this thesis, when venture backed companies raise money, they raise millions of dollars, sometimes billions. What do they spend the majority of that money\r\n\r\n\r\nThey spend the majority of that money on acquiring customers, acquiring market share. And this in my mind is no different. You're building a distribution channel that will allow you to get to whatever number you want to get to with your franchise company, but it's a funnel for deals. It's a funnel for people, talent in particular, which is really, really important. And it allows you access to things that you wouldn't have otherwise had in the past.\r\n\r\n\r\nI'm all in on this thesis. Like it's the same as marketing. You're diverting dollars to building a brand as opposed to going out and buying ad space in other places. What has been the most surprising thing for you? When did you like flip the switch? When did you like go hard on?\r\n\r\n\r\nBrian Beers (22:53)\r\ncontent stuff.\r\n\r\n\r\nI don't, it's hard to, mean, it's, it's, I don't know. It's scaled, right? It was like, Hey, Twitter and it's been fun. And I've had a podcast, but the podcast was kind of like a side, a side thought or like whatever. I want to say it's probably been six, maybe six months ish, maybe beginning of the year. I kind of thought, listen, like I'm gaining traction. Like things are going well. you know,\r\n\r\n\r\nBut I knew YouTube, listen, I know YouTube is it. And I know I can't do it alone. I need video editors. need people to help with like content ideas, with script writing, with like, whatever. There's hooks, there's thumbnails, there's titles. Like there's like a lot to learn and it's not just, I'm gonna write this tweet, bang this tweet out at five o 'clock in the morning and schedule it for later. And I'm like, go about my day. You know, there's a lot more involved. And so I think I decided, hey, I wanna grow this thing. then that's when I like, I guess the flip, it's switched.\r\n\r\n\r\nAnd then I would say really it was over last two months that I've really now like started to make the better YouTube videos. I hired a chief of staff, which is like a whole nother conversation, but okay.\r\n\r\n\r\nNik (24:04)\r\nWell, how did you like that was gonna be my question to you, right? Like, you're still running a big business. How do you have enough time? I'm guessing I'm gonna guess here, you're spending 30 hours a week on content. At least, how are you able to do that when you still have a business that you're running? Because I sold all my businesses and I don't have a job. I'm cool. I'm in on\r\n\r\n\r\nBrian Beers (24:22)\r\nYeah. I mean, so, yeah. So a couple of years ago, I mean, I, you know, so the Midas business, at least the auto repair business, right? A couple of years ago, you know, I was the COO. I like, you know, all the, all the district manager, we have four district managers, each one of them oversaw six to eight stores. They all reported to me, you know, as kind of the operations person, but also, you know, I'm also like the CEO and I'm also like, whatever, all this other stuff I like do real estate and different things. And then, you know, I had a bunch of friends who had hired\r\n\r\n\r\nCOOs and they use this foundation that helps place former special operators into high paying civilian jobs. So they place, you know, green berets, army rangers, Navy SEALs, know, MARSOC guys straight out of the military. And so there's a guy in Philly. had hired, he had hired one of these dudes and it was like, guy was crushing it. And he was a good friend of mine and he would, you know, he would be like, man, the guy's like pretty much running my company now after like a couple months.\r\n\r\n\r\nAnd I was like, I need, I was like, I need that. So I reached out to this guy, this company, I tell them what I want. And I would say like, I don't hear from them for like three months. And then they sent me this guy, Colin. And, but he's the only guy we talked to and we love him. We hire him. He starts in August of 22. And then within by, I would say within, you know, by, by the end of the year, by, Christmas time. So, you know, four months ish, same, same timeframe. He's pretty much running the company.\r\n\r\n\r\nYou know, and he spent 20, 26 years -ish, 20 something years in the military. You went out again. It's probably a setting on your camera.\r\n\r\n\r\nNik (25:56)\r\nWhat the F is going on\r\n\r\n\r\nSo, okay, give me one second. I'm gonna do one thing.\r\n\r\n\r\n\r\n\r\nPART 2:\r\n\r\n\r\nBrian Beers (00:01)\r\nYeah, so I would say after three, four months, he had taken over kind of the operations for the business. And obviously, there's still like a learning period. But I mean, yeah, now it's been, you know, almost almost two years. He completely he pretty much completely runs runs the company. He's the CEO. Yeah, he's a chief operating officer. But he's awesome. And he he's way better at it than me. I think sometimes like as an owner, like who's built the business, you're like, one can do it better than\r\n\r\n\r\nNik (00:18)\r\nAnd he's your COO, is that like his title?\r\n\r\n\r\nBrian Beers (00:31)\r\nAnd in reality, he's way better than me at it and enjoys it. This is what he does. I was his first job, civilian job, since he was 16 years old working at Ambercrombie and Finch or whatever he says. So there's all these guys that come out of the military, specifically these special operations guys, who have a ton of raw people skills that you cannot teach.\r\n\r\n\r\nNik (00:45)\r\nDang.\r\n\r\n\r\nBrian Beers (01:00)\r\nThey're loyal, they're accountable, they're very driven, they have a high emotional intelligence and like they want to be part of a team, they want to win, they've risen to like the top 1 % or maybe 10th of a percent or whatever within the largest organization on earth or whatever it is in this specialized field. And so like they don't get to that point unless they have these skills. I figured, listen,\r\n\r\n\r\nIf he has all these skills that I can't teach, but I can teach them like franchising or we have franchise or they can help teach franchising. Like that's what I want. So anyway, I hired him. He's been great. He's, he's, he's, you know, the best employee I've hired. And then, so he kind of runs that business. I only spend a few hours a week. My primary role is, is really, is the growth side of it. So like, I'm, I'm the one talking to the realtors. They send the properties. Like, I'm kind of saying, Hey, I think this will work or not. And then, you\r\n\r\n\r\nwe would, he would still get involved from the object kind of given the yes no. Yeah, so it's it's called the Special Operator Transition Foundation. So it's s o t f .org is there there you know. Yeah. Yeah, so it's a nonprofit. And so then whatever I made a I took a $10 ,000 donation. Yeah. So that was so it was the first hire.\r\n\r\n\r\nNik (02:01)\r\nWhat was the name of that company that was placed?\r\n\r\n\r\nS O T F dot org. And did you pay them a fee for placement or?\r\n\r\n\r\nOkay, in the form of a donation. Okay.\r\n\r\n\r\nBrian Beers (02:27)\r\nAnd then, so he pretty much runs that business. then as you know, I spend very little time on the, the day to day kind of side of it. And then, you know, as I've started to build like the content team and just like this idea of like, whatever the, the, mini acquisition .com, like I've talked about that, but like, we're starting to do these deals where we're, you know, we're finding these guys, we're partnering with them. I've these like all these other things going on. I wanted somebody who was just like a, at his same level.\r\n\r\n\r\nwho'd be a right -hand man to me just to help with like all the other stuff I'm working on. And so I went back to the same foundation. You I had kind of told them, listen, you got anybody who wants to live in Philadelphia, like send them my way. And so I had talked to a bunch of whatever. I talked to a bunch of different guys over the course of whatever, the last year. And then I was able to help direct them to maybe another local business owner that I knew or just like give them guidance or like whatever. And I ended up talking to this one guy and I really liked him. And I thought,\r\n\r\n\r\nI don't know, I'm like, man, this guy's like really sharp. He had his own business. He was like starting and, you know, his, he was from Philadelphia and looking to move back. then I came to them and was like, Hey, I need a chief of staff. Like, wonder if this guy would be interested. And so, you know, we, we spent a number of months kind of going back and forth and, you know, he had multiple offers, you know, similar thing all through this foundation and people we knew. And, and he, he's still in his like transition period. He comes full time in, September\r\n\r\n\r\nNik (03:53)\r\nbut he's there in Philadelphia with you.\r\n\r\n\r\nBrian Beers (03:56)\r\nSort of he he is family in Philadelphia. He still lives in Virginia. So he's up. He'll be up here one day a week I think long term he'll move here. I think it's like everybody in his family wants to move back But they have a daughter graduating high school, whatever they don't want to disrupt family life stuff Which is totally fine totally fine for me. I mean, whatever one one day is enough in person I do a lot of things online and virtually in phone and text so like I wouldn't want to meet with him any every day anyhow, so\r\n\r\n\r\nIt's totally fine. Totally fine for me.\r\n\r\n\r\nNik (04:29)\r\nTell me about, so you've freed yourself up, you've gotten more time and resources to throw at this. First question is, how much are you investing a month right now? And just building this content machine, right? So I said, have an editor, sounds like you have somebody helping you with writing. Can you talk about what that looks\r\n\r\n\r\nBrian Beers (04:43)\r\nin content.\r\n\r\n\r\nYeah, so 6K a month ish. In that range, I've got like, I've got a video editor, I've got a personal VA, I have two people that kind of help with like graphics and social media. And I do have a writer. I don't know the writers are like, I'm a pretty good writer. I've written all my stuff. So I've really struggled with that side. I'm moving more towards like maybe just like it's a it's like a copywriter who's someone who could like take my stuff and maybe like, I need a better headline. need I need a little bit more\r\n\r\n\r\nNik (04:56)h\r\nOK, that's not.\r\n\r\n\r\nwe've represented.\r\n\r\n\r\nBrian Beers (05:21)\r\nPizzazz, I'm really good at writing like all this very tactical things. Sometimes it's like the it's like the hook that I need help with. And it's not like a full time thing. But so it's I'm struggling with that. I have a couple ideas. I've tried. I mean, I've tried some of the ghost writers. I'm sure you know.\r\n\r\n\r\nNik (05:38)\r\nHow do you think about the investment? Are you like, okay, I'm gonna do this for six months and then within six months I'm gonna at least start seeing ads on YouTube because I'm gonna get monetized or I'm placing it in my newsletter. Or is that, are you not even looking at it that\r\n\r\n\r\nBrian Beers (05:55)\r\nYeah, I mean, we do have so currently I've I do have a monetization strategy currently, which is through a franchise consulting business. And so a lot of it is so you know, we talk about helping people find franchises, what to look for what to you know, how to find one, they can come and work with us. And basically, it costs them nothing. And we kind of play matchmaker to help them find a brand that matches their goals and their budget and whatever they love. And if and if we are successful in playing matchmaker, the franchise or pays us a commission.\r\n\r\n\r\nAnd so I've built a team there as well. like, don't, I mean, I work with some people directly, but a lot of it is, you know, people come to me through social media, then they work kind of with somebody on my team. And then, you know, I host like weekly group calls, you know, I've created courses and it's all free, whatever that, that anybody working with us gets access to. And I'm working to put all that stuff on YouTube, like all that content. so, so I\r\n\r\n\r\nNik (06:50)\r\nAre you looking at it though in the lens through the lens of like, okay, is there an ROI on this six grand I'm spending? Or are you like, I'm so sold on this. I'm willing to put $200 ,000 into this before I see a first dollar quote unquote\r\n\r\n\r\nBrian Beers (06:58)\r\nIt's\r\n\r\n\r\nno, it's, it's kind of an event. mean, it's investment. mean, from that is from the, from the consulting side of it, it is, you know, it's profitable. Like I'm doing more than six K a month. So like it's paid for in a sense of like, from, from that business, it pays for the, for the content side of it. And then I'm also like, you know, I am generating this, like, in my mind, this asset that can grow over, over time, like that, and have that compound effect. and so I don't, I don't, I don't know, I don't like have\r\n\r\n\r\nROI like I've, it's oscillated. Like I spent more months. I was spending more at one point, but then I was like, man, this isn't like, I'm not growing the audience. guess the, one of the ROI is I'm looking for his audience growth, right? I'm going to hire you to like help me get more Twitter followers or new or get more newsletter people or like LinkedIn or whatever it is. And it's like, if it's not, you know, if I'm not seeing that you can do better than me, like it's, it's not worth it. And then I think it gets you off your game too. When you like, when you hand too much stuff off.\r\n\r\n\r\nNik (07:39)\r\nYeah, that's what I was gonna\r\n\r\n\r\nYeah. So is your is your like North Star metric subscribers on YouTube? Is it newsletter subscribers like what what to you is like this is going\r\n\r\n\r\nBrian Beers (08:07)\r\nI mean, it's it's calls booked for people that want to work with my team currently. It's an outcome based like, like, because ultimately I could have a million followers. But like, if it's not generating, you know, if that's not generating like inbound leads for us, it doesn't matter. Right. Yeah. But I could have a hundred followers, man, if all a hundred are booking calls, like we're doing pretty good. So I think that's currently it now on a short term basis. Yes.\r\n\r\n\r\nNik (08:12)\r\nHmm,\r\n\r\n\r\nthem what's the\r\n\r\n\r\nTotally.\r\n\r\n\r\nBrian Beers (08:35)\r\nI'm investing a ton of time and effort into YouTube. like, it was funny, like on Twitter, you know, I used to get whatever I've had, I've had a number of views, you know, 100 ,000 200 ,000 300 ,000. That was like, man, this is exciting, right? On YouTube, I get like, I get like 500 views. And I'm like, pumped about it. You know, it's like you get like reframed on like, what's like, you know, what's good.\r\n\r\n\r\nNik (08:51)\r\nHa\r\n\r\n\r\nIt's just so much harder to grow on YouTube than it is on Twitter. It's so.\r\n\r\n\r\nBrian Beers (08:59)\r\nYeah. Yep. But it's like the short term pain to have a long term gain, or Twitter is like the reverse where you can get short term gain but but has no long term benefits.\r\n\r\n\r\nNik (09:08)\r\nSo six months from now, let's say you look back on this experiment, you've spent $40 ,000 six months from now on your content team. What would be the metrics that you would set to say like, this is how I know I've been successful?\r\n\r\n\r\nBrian Beers (09:24)\r\nUh, yeah. So I mean, I'm at, I'm about 41 ,000 followers currently across like the platforms. Uh, I'm looking, I mean, I would love to have a hundred thousand by the end of the year. I don't think I'm going to hit that. Um, but like I want to grow by YouTube, whatever. I'm like a numbers guy. So like, it was like a linear, it was more of like a linear growth to say, could I, could I grow YouTube from, I don't know. I'm at 900 today by the end of the year. Could I get to 6\r\n\r\n\r\n5 ,000, something in that range. Like that would be a success there. LinkedIn, I'm at 6 ,000. Can I get to 10 ,000 by the end of the year? Right? That's possible. Newsletter, I'm at 5 ,000. Can I get to 10 ,000? And Twitter, I don't know. I'm at about 30 ,000. My goal is 75, but man, I've been, I don't know if it's all this politics, like the Trump and Biden, man, I get no traction anymore. And it's like, so that's what's frustrating, right? You spend all this time and effort building this thing. And then now like I write the same exact stuff and nobody sees it. And\r\n\r\n\r\nNik (10:12)\r\npolitics\r\n\r\n\r\nBrian Beers (10:23)\r\nbecause their newsfeed, unless it's like my newsfeed, my newsfeed is completely jammed up with assassination conspiracies.\r\n\r\n\r\nNik (10:28)\r\nWell, dude, like you're articulating the reason why and you said it earlier, you want to get people on to your newsletter. Yeah.\r\n\r\n\r\nBrian Beers (10:34)\r\nYou want to own the audience. You got to own the audience. And for people, like they want to see my stuff, like, and they don't see it. like, the inbox is how you how you get there. And so anyway, that's like, that's the biggest challenge is you can grow. it also like if that's your business, it could kill your business. Like you get blacklisted tomorrow and have nothing to show for it. And so I think anybody who like it was listening, they like this. You have to own the audience. And the only way you own it is email. mean, it's email or text, but email, email is the way you own\r\n\r\n\r\nNik (10:51)\r\nTotally.\r\n\r\n\r\nAll right. All right. So 5000 subscribers on YouTube, 10 ,000 on LinkedIn.\r\n\r\n\r\nBrian Beers (11:08)\r\nYep. So Twitter, I mean, I'm 30 ,000 now. If I could get to 50 ,000, that would probably be a win at this, at the rate that I'm moving. And yeah, no, think, I think that'll be good. But then like that's linear, like, but, but I know things happen exponentially, but, uh, and I want to be having fun with it. Like, listen, I don't, you know, we, any, anybody, right? You can choose as a business owner, you can choose the life that you live, right? You can design, you can design whatever you want. And it's\r\n\r\n\r\nNik (11:14)\r\nOkay, all right, I'm putting that in writing.\r\n\r\n\r\nBrian Beers (11:36)\r\nI want to make sure that I'm having fun. Like I enjoy what I do every day, that I'm not like super stressed out about it. And, you know, I'm doing what I want. I think that's like, that's more important to me than anything. And I currently am like, currently am enjoy what I do and I'm happy about it. But like, whatever there's days I'm like, you know, I set a high standard for myself and there's days I know I'm falling short of the standard I set my for myself. So I, you know, it's self -imposed. but, but it's like, I want to, I want to build the habits.\r\n\r\n\r\nso that I can play at the level that I know I'm capable of playing at.\r\n\r\n\r\nNik (12:10)\r\nwhen you said it to like, it's not linear. You could be consistent every single day. And then all of a sudden, you've got a post that pops off and you grow your subscribers by a thousand. Like Chris, mobile home park guy, my business partner, consistent. He's been consistent on Instagram. And he just hit, like, he just posted a video about this, like perfume vending machines. It's gotten 10 million views between Instagram and TikTok.\r\n\r\n\r\nBrian Beers (12:26)\r\nI know, he's an animal. He's an animal.\r\n\r\n\r\nNik (12:39)\r\nAnd we're going to build another business basically off of this tweet. But he's also gained like 50 ,000 followers on Instagram, like and YouTube, frankly, which I'm kind of butthurt about because we did an episode together and that episode's been his most popular episode. And it's gotten him like 700 subscribers. And I'm like, freaking, hey, man, I didn't even get anything from that. But anyways, it's it's crazy how like all of a sudden it happens. yeah, anyways, I got to two questions to end this interview. You ready?\r\n\r\n\r\nYou have two hours in your day. I think I know the answer, but I'm going to ask anyways. You have two hours in your day. You have no family time and you have no business time scheduled. You can do those things, but you don't have any obligations. What are you doing in that time? What are you obsessed with right\r\n\r\n\r\nBrian Beers (13:27)\r\nthat's not the content. yeah. Currently it's, mean, honestly it is, it is the content. Cause I enjoy it. Like I got a lot of stuff I want to get out there and it's the game and I've always loved business. I've always loved playing the game and this is the game I'm playing right now. And so like, I like that. I mean, I'm sure I'm trying to become a better golfer. I'm I shoot like a hundred, you know, I, I do with my dad. So like, I'm, trying to do that, but like, that's\r\n\r\n\r\nNik (13:30)\r\nIt doesn't have to be the content. Like, I think that's the answer,\r\n\r\n\r\nBrian Beers (13:55)\r\nI'm trying to pick a pickleball. I have whole bunch of friends that play pickleball, like not locally, but like throughout the country. And so I've taken a couple lessons. I am pretty good. just need to like, I have the ability to be pretty good. just need to play more.\r\n\r\n\r\nNik (14:06)\r\nIt's funny, this goes back to like one of the earlier comments that you said in the conversation. I'm the type where I want to want to like golf. But I don't, I don't enjoy it. Like I would rather be having these conversations or like brainstorming on something cool that we could figure out. Same is probably true of pickleball where I'm like, yeah, I could go and play. And I enjoy it, I have fun, I like getting out there. But like, I'm kind of obsessive with this stuff. Anyways, so last question. What advice would you give yourself 10 years ago?\r\n\r\n\r\nBrian Beers (14:14)\r\nYeah, that's right.\r\n\r\n\r\nI think, um, let's see, 10 years ago, how old I've been, I've been in 27. I was in the throes of it. Um, I would've said it at that point, it would have been probably to stay super focused on my core business, which was Midas. We had, uh, we, we, you know, we tried to build the mini Berkshire, right? Like, oh, I'm going to own a bunch of these different things. And like, we bought like section eight single family homes and we bought, you know, we bought in some other franchises and\r\n\r\n\r\nNik (15:06)\r\nJeez.\r\n\r\n\r\nBrian Beers (15:07)\r\nWe bought until like an Amazon store and like, you know, how did it all turn out? Like we shut down all those other things and like, and lost, you know, made some money, lost some money, whatever. But like, but then the bigger thing, it was a distraction for me. And during that time period, like there was a bunch of opportunities that like we, we could have, there's a bunch of stores we could have bought. We could have opened deals. We could have done in that business that probably would have added like seven, $8 million of revenue today, like annually today.\r\n\r\n\r\nNik (15:35)\r\nHmm.\r\n\r\n\r\nBrian Beers (15:37)\r\nbut I said no to those or I wasn't interested in those cause I was distracted by these other things that like shiny object syndrome or like whatever. just thought like, I need diversity in my income. Right. But like, you know, like, all my money is for my, I was making good money, but like it was all from them. And it's just like, you know, people, people have this like misconception that like, you, you don't make money through diversification, right? You make, you keep your money through diversification. You make your money through the opposite, which is concentration.\r\n\r\n\r\nIf I stayed focused just on that business, would have been, you know, it would have been further along than I am today. And, but it's hard, right? You see all the stuff you see you guys doing all this crazy shit with perfume and mobile home parks and all this stuff.\r\n\r\n\r\nNik (16:16)\r\nIt is\r\n\r\n\r\nWell, I'll share my perspective a little bit. The first perspective that I have is everybody looks at Warren Buffett and they're like, he has all these companies. It's fantastic. Like Warren Buffett's thesis wasn't I'm going to invest in a bunch of different companies. Therefore I'll be rich. His thesis was I'm going to invest in underpriced assets. So whenever there was an opportunity, he invested and he would double and triple down in those investments. For me, you I sold a lot of these businesses over the last two years. And so the last six months in particular, I'm kind of like a kid in a candy shop. I was so focused.\r\n\r\n\r\non those businesses that now, like for the first time, I'm like, that's franchising. What is that? social media, what is that? Like I'm just like learning about all this stuff and it's so fascinating to me. Chris, unfortunately, he has shiny object syndrome. Like that guy can't focus to save his life. But I agree with you. I think focus to get your first nut, whatever you want to call it, is incredibly important. And then you can go play. Like\r\n\r\n\r\nwhatever safety you need first, and then you can go invest in these like other opportunities, but everything else before that is just a distraction. All right, this has been Rad, my friend. Best place for people to find you, I'm assuming is Twitter.\r\n\r\n\r\nBrian Beers (17:31)\r\nYes, on Twitter at Brian beers or you know, if you want to check out my YouTube, I'm working to build their same thing at. Awesome. Cool. That'd be\r\n\r\n\r\nNik (17:37)\r\nI'm going to link you in my video on YouTube this time. All right, cool, man. Well, this was great. We'll talk later. Thanks.\r\n\r\n\r\nBrian Beers (17:42)\r\nThanks Nick.",
  "metadata": {
    "duration": "",
    "date": "2024-10-16",
    "platform_source": "Google Drive"
  }
}