{
  "episode_number": "45",
  "episode_title": "From $20K to $4.7M Profit with Short-Term Rentals in Under 3 Years with Chris Koerner & Isaac French",
  "guest_name": "Chris Koerner & Isaac French",
  "business_name": "Live Oak Lake",
  "transcript": "﻿Yeah, Isaac, I also love, and I know you didn't love this at the moment that you got banned by Airbnb. I love the theory of constraints and I'm fascinated by what this, like the startup failure rate in Silicon Valley might be if there was no such thing as a VC because you don't have to be creative when you have 5 million cash in your bank account.\r\n\r\n\r\nRight. You don't have to. And who knows how many billion dollar startups we'd have out there today if they had to get creative and just make it work. But when you have all this money, you don't have to think you don't have to be creative. You just hire and spend, and then you go out of business.  If Airbnb never bans you.\r\n\r\n\r\nYou're just fat and happy on Airbnb at an 80 percent occupancy rate saying, Hey, we underwrote for 75. We're winning here. Right. But you're not like you, you would never have learned that. I mean, you may have, but like it forced you to learn it in a six day time span for 900 and it changed everything for you. \r\n\r\n\r\nHave you ever dreamed of building something extraordinary, something so unique that it doesn't just attract visitors. It turns into a destination in itself. Think about it.  A place where every detail from the architecture to the amenities isn't just thoughtfully designed, but meticulously crafted to create an unforgettable experience. \r\n\r\n\r\nNow imagine doing that with only 20, 000.  Oh, and breaking your pelvis in the process  and still coming out on top by selling for millions.  Well, my name is Nicholas Helusky and welcome to another episode of Nickonomics. This is the show for entrepreneurs and entrepreneurs who are curious to learn how other businesses work.\r\n\r\n\r\nOver the past five years, my companies have generated over a hundred million dollars in revenue and created millions of dollars in shareholder value. I've bought and run and sold. Dozens of companies with multiple seven figure exits. And on this show, I let my curiosity drive as I interview successful entrepreneurs, asking them to walk me through exactly how they built their businesses and how they operate today.\r\n\r\n\r\nSo whether you're an experienced business owner or just starting out, Nickonomics is the place for you to learn.  And today my best friend and business partner, Chris Kerner, and I did a joint episode. We're going to be releasing this on both of our feeds at the same time, because we sat down with Isaac French, a man who didn't just build a resort.\r\n\r\n\r\nHe created an iconic micro destination  live Oak lake was so compelling. It actually caught the eye of private equity and sold for a handsome sum. And on this episode, you'll hear how Isaac went from a 2. 3 million investment to a 7 million exit. Why he believes storytelling is the secret weapon for any business and how he built a media brand that generated 40, 000 in bookings.\r\n\r\n\r\nWith just a $900 social media budget.  But mainly Chris and I are just dying to know one thing.  How the freak did Isaac build something so compelling that people are willing to travel from all over the world just for an opportunity to pay him  to experience it.  Let's find out together. Okay guys, we're gonna get back to the show in just one second, but first, a message from a sponsor.\r\n\r\n\r\nWho is uh, me? Oh, it's me 'cause I'm doing the show for free. Listen, I wanna give you a hundred dollars.  All you have to do is this.  Go to Apple or Spotify,  give me five stars, write a review, screenshot that review, send it to me, Nick at cofounders. com and you will be entered to win a hundred dollar Amazon gift card.\r\n\r\n\r\nEvery four episodes I am going to choose a winner at random and I'm going to do this five times, 500 for five stars. I just made that up. That's what I'm calling it. Please go to Apple or Spotify, leave a review, screenshot it, send it to me, Nick at cofounders. com and you'll be entered to win a hundred dollar Amazon gift card.\r\n\r\n\r\nAll right, let's get back to the show. Isaac French, stoked to have you. Welcome to Nickonomics, my friend,  Nick. Excited to be here. We have a special episode today because Chris is joining me on Nickonomics. But, uh, before we get into the fun, Isaac, tell me in its simplest terms. What is your business and how do you make money?\r\n\r\n\r\nWell, I just sold my business actually. So, but my business is developing one of a kind, iconic, immersive micro resorts, and I developed this property called live Oak Lake, seven cabins around the Lake. We can get into it if you want, and then just sold it to private equity, and now I'm teaching others how to do the same thing.\r\n\r\n\r\nAwesome. So you sold out and now you're selling a course. Perfect.  What was the joke? You guys could laugh. I mean, we feel really awkward.  I first, I first got introduced to you a little over a year ago, Chris and I bought an RV park in Waco and the park itself is five acres, but the RVs only sit on, what is it, Chris?\r\n\r\n\r\nIt's less than two acres of the five, right? It's less than one acre. It's less than one acre of the five.  And as we were brainstorming what to do with it, Chris was like, dude, you got to check out Isaac French. And so he sends me your stuff and he's like, we could do something like this in the back and we could have hiking trails.\r\n\r\n\r\nAnd we looked at what were those tents that we looked at, Chris, that they were like, what  were they called? Jukes. Yeah. They're glamping. 10, 20 grand is like glamping tents. And I went down this rabbit hole of, dude, these are all the cool things that we could do really inspired by what you did right outside of Waco as well.\r\n\r\n\r\nWhen you started. Cause it looks amazing.  Was there a grand plan in mind or was it like,  Hey, let's just build some cabins on the lake. And then it just iterated from there. Each time your wife came up, she's like, Oh, this is too ugly. Why don't you put some lights on it? Or you know what I mean? Like, how did it come about? \r\n\r\n\r\nCan I just tell you the story in a nutshell, please.  So I grew up in a big family, homeschooled, very industrious, started businesses from the time I was six years old and, or probably before that actually, and have always been very creative, but also, Enjoyed like project management and construction. My dad had a small construction business and I worked for him in high school, learn the trades from the ground up, you know, out there as a general labor, literally work through every trade and learn construction, manage projects for a few years.\r\n\r\n\r\nBut I always was frustrated because though we got to work on some cool projects, there were commercial projects. You'd have a pretty big team, architects, engineers, Owners, owners, reps, and there was always so much  gridlock and also creatively, I never really agreed being pretty, pretty strong and decisive in terms of my own architectural likings and such.\r\n\r\n\r\nI never really would always agree with the decisions. And that's really bad for a general contractor, because that's not really my job or my business, but I was like, well, maybe I'm in the wrong business, but all of that experience was really helpful because. If you're going to design, I feel like I wish every architect had to go through on the ground training like as actually a builder because  any of them just like drop these plans that are crazy and unbuildable and it's kind of like this running joke or maybe not even that charitable.\r\n\r\n\r\nIt's like this. Always this friction between not always, but a lot of times between a design team and a contractor. So fast forward a few years. I quit that moved, moved to Texas. That's actually where I was born and raised, but my family lives in Idaho. We still travel there quite a bit, moved back to Texas.\r\n\r\n\r\nWe're in Idaho,  little town called Deary outside of Moscow. So north central, south of Coeur d'Alene, few Americans know that the capital of Russia is actually in Idaho, Moscow, Moscow, Idaho, well, it's Moscow and most people say Moscow. So that's how you know what it is or not.  So when I came back to Texas, I got married, also had like accounting experience.\r\n\r\n\r\nI taught myself bookkeeping, accounting, tax prep in high school, because again, always been entrepreneurial. I really wanted that kind of strong business foundation. And was very intrigued with marketing, but had never done any of it. So I had all these disparate bits and pieces of experience and passions.\r\n\r\n\r\nAnd I was just, I don't know, it's hard to articulate, but I had this desire to sort of bring it all together. The creative, the analytical, the marketing, all of these different things, some of which I hadn't even done, but I had an interest in and throw all of my passion into one project. And so maybe I went in the other ditch.\r\n\r\n\r\nI was like, I'm not hiring any architects. I'm not hiring anybody. Not even consultants. I'm going to figure this out. Had this idea, create a village of like really charming cabins that are totally unique architecturally for Texas and with a really high degree of like experience and, and yeah, just design throughout the property and, and rent out these cabins.\r\n\r\n\r\nSo started looking on Zillow, found this five acre piece of property one morning. That was like five minutes down the road from where I live. Went out there. Got goosebumps like as I stepped on the property and immediately felt like this is the place. I could just see there was this little muddy cow pond that had, it was  really a jungle and really a mess, but I could see the potential for this property.\r\n\r\n\r\nAnd there were these massive live oak trees, which  first tip first pro tip, big live oak trees are, or big trees of any kind are so underrated. If you're going to try to create a property like this, because you can't plant them, you can't buy them. They're either there or they're not.  So we bought the property closed, sorry, got it under contract that day.\r\n\r\n\r\nI had about 20, 000 to my name, got on the phone immediately and started calling friends and family to see if I could, I wanted it to do it just like a hard money loan until I could refinance the whole property, pull money out, pay them back, but.  Finally got a yes, but was told, no, we want equity. We don't want to give you a hard money loan.\r\n\r\n\r\nSo gave up 40, 45 percent equity and was it family or it was family. It was like four or five different family members. Family's always the worst, man. They say, don't do business deals with your family, but it actually worked out. And quick note on that. I said, I had a big family. I have seven brothers. And we all worked in the family business.\r\n\r\n\r\nIt was actually awesome because there's nothing like a family that yeah. Okay. We have our moments like my brothers and I, we may not always see eye to eye, but at the end of the day, we have each other's backs 1000%.  And so it's a certain kind of like collaborate, collaborative and just synergistic vibe and environment that like made the construction business awesome.\r\n\r\n\r\nAnd so having them in this capacity of now of like, Investors partners in the project was actually awesome too, because I could call them up like, Hey, how are we supposed to do the standing seam roofing detail? What any thoughts on this for weatherproofing or whatever? And I could get instant feedback.\r\n\r\n\r\nSo fast forward, not to bore you with all the details, nine and a half months designed and built this whole resort, seven cabins, modern Scandinavian, very like  stunning design. Yeah. And there just aren't that many in Texas. I was like, this is perfect opportunity. And really create like this transported vibe all the little details from your first impression of the property when you drive up to the front gate to the welcome gift to the trails to the lights to the signage to everything like adds up.\r\n\r\n\r\nNo detail was left unintentional. It all adds up to this really magical experience. That was the dream, at least. And I feel like we accomplished it. So we opened nine and a half months later, crazy year. I also built a 750, 000 spec home at the same time and sold that in four and a half months, rolled the profit, which was about 200, 000 into this project.\r\n\r\n\r\nWe needed every penny of it because we went way over budget. It was 2021, you know, post COVID supply chain. Um, craziness and, but we got the project done. Also broke my pelvis during the process. \r\n\r\n\r\nI fell out from a ladder fell out from underneath me and I felt like eight feet on a concrete and broke my pelvis, which is a big, big deal. Yeah, that's a big deal. I was in the hospital  with multiple surgeries. I still have a, like 50 pieces of stainless steel in me. When I go through TSA, I've gotten used to  explanations. \r\n\r\n\r\nOpened in January, 2022 and launched on Airbnb two weeks later. I wake up one morning. Check on our account. We're getting amazing. We've gotten amazing bookings. We've gotten amazing reviews. The entire thing is suspended. Great out. It's like, I'll never forget that view. It's like grayed out with a little red triangle.\r\n\r\n\r\nAnd I couldn't figure it out. It's like, of course, like speechless. At first I called Airbnb, totally unhelpful. Wouldn't,  I have mixed feelings about Airbnb, but anyway, not, this isn't to bash Airbnb. They've done a lot of good, but their customer service. So, six days later, they finally reinstated us. But before I get to that, I didn't know that we were ever going to be reinstated.\r\n\r\n\r\nI started calling people up like, Hey, what do we do? Do you know anything about social media? Cause I knew direct bookings were going to be a key part of the model.  But I had chosen to launch on Airbnb because they boost your property like for the first 30 days  and  finally found this person was like, Hey, you should do a giveaway with a travel influencer.\r\n\r\n\r\nSo sure enough, called up a Dallas account. Dallas sites, one Oh one is the handle. And they have like 200, 000 followers. I paid them 900. They ran a two night stay giveaway. And. You know, two days later, this is during the suspension.  Within one week, we got roughly 5, 000 followers from scratch and 40, 000 of direct bookings as a result of this 900 giveaway.\r\n\r\n\r\nSo that was the ROI. Geez,  dude, that was the moment for me where I was like, that really was the most pivotal moment of the entire journey because it, it opened up a horizon in terms of growing, building a brand around the property that just, you know, Blew my mind. And I think ended up being quite a beacon for other people as well.\r\n\r\n\r\nSo fast forward, another 12 months, we grew about a hundred thousand followers. About the half of that was just piggybacking off of it. We went all in with these giveaways. We invested probably 50, 000 in these giveaways,  but drove seven, 800, 000 of direct bookings, insane. Or either we had. 80 percent of all of all occupancy was direct and then overall like 95, 94, 95 percent overall occupancy for all seven cabins for 365 days of the year.\r\n\r\n\r\nFor the first year,  a million dollars top line, about 550, 000 NOI. We refinanced the property four months after we launched. Well, it was actually about six months when we closed on it.  Four, six months later, the appraisal came back like twice what the initial one was pre billed. So we were able to pull out all of the cash and 400, 000 on top of all of that.\r\n\r\n\r\nUm,  and then, uh, We basically started creating our own content because at a certain point there, you really have to, and the algorithm was shifting to be much more reels driven from photos. So we went all in with like creating our own Instagram right now,  specifically you're talking about specifically Instagram.\r\n\r\n\r\nYou're not talking about Twitter or YouTube, right? This is Instagram. Yeah. Which is the booking channel. So hot take here. I believe Instagram is going to be the booking channel for at least for unique stays. If not most Airbnbs. Which are shifting towards unique stage, just because  in that equilibrium, yeah.\r\n\r\n\r\nYep. And people need differentiation. Like they're seeking experiences. They're seeking one of a kind stays and they don't want the commodity stuff that's on Airbnb. But Instagram is much more visual. It's very story driven. Storytelling is a massive part of creating a brand like this and getting people selling people the dream to come out and stay. \r\n\r\n\r\nWe don't view this transactionally. So maybe that's the place where the transaction starts, but this is, we had guests come back three and four times in a 12 month period that just gives you a peek into the kind of like cult like following that we built at Live Oak Lake. Cause it was totally unique. And people say, here's another like hot take.\r\n\r\n\r\nA lot of people in real estate say, especially with, we spent 300, 000, 330, 000 a key, which was a lot at the time we sold for three times that, but we spent a lot of money to build the place. And people were like, you've got to choose high barrier to entry markets where there's already regulations in place so that somebody else can't come along next door and build the same thing. \r\n\r\n\r\nThat's not my philosophy. If you do it right, which is really hard, that's a big I F if you do it right, right. You build something that's truly one of a kind that is word of mouth worthy. I like to say, because word of mouth marketing is the best channel marketing period, end of story, social media and influencers, whatever can help augment that, but ultimately people trust people.\r\n\r\n\r\nThey don't trust brand. They don't trust, they don't trust companies. And if you build like this incredibly compelling property and experience, that's more than just a place to stay. It's an experience  you're going to. No matter who else builds what next door to you, you're going to already have that first mover advantage.\r\n\r\n\r\nYou're going to be like the Kleenex of the industry, so to speak. And so I'm looking for markets that are, I don't care about saturation. I don't care about local attractions. I'm going to create a destination with the property and I want to build it as quickly as possible, which means it's not going to be a high barrier to entry market.\r\n\r\n\r\nSo outside of Waco, Texas, unincorporated part of the County don't need any permitting.  Now, obviously proximity to demographics and like population is also very important. And we happen to be smack dab in the Texas triangle with 22 million plus people. So there's a lot going for it. But anyway, just back to finish the story  18 months after we initially opened.\r\n\r\n\r\nAnd we had that very, in hindsight, fortuitous disaster with getting kicked off Airbnb, which was a mistake by the way, on their algorithms part,  because we got reinstated. We ended up selling the whole property after being approached by multiple private equity groups and other buyers. We sold for a million bucks a key.\r\n\r\n\r\nSo 7 million, we built it for 2. 3, sold it for seven. And basically, let me get my calculator out. Hold on a second. Seven.  Okay. So it was a good deal.  It's a decent deal. Yeah.  It takes a lot of underwriting to actually do the math and make that decision. But  one of the,  one of the keys though, and I'll just say this kind of off the record, even though this is a podcast,  the, you know, leaning in, leaning in approached us to, to buy this.\r\n\r\n\r\nLiterally told us the fall. They valued the following around 2 million that we had built. So we sold, we sold the real estate. We sold everything as a turnkey property and that Instagram following, which was like around 150, 000 at the time of sale. And we also had like a small email list and some other stuff, but they told us like, look, this is gold to us because we're planning to expand this.\r\n\r\n\r\nWe're either going to expand this brand or we're going to launch other properties and leverage this following. And I built that for again, cost us around 40, 000, 40 in terms of like giveaways, content creation. And whatever. And I got a masterclass in social media in the process. So if that's not enough on your fire, go tell a story and build a brand as a founder, but also for a property like this, of course, that begs the question.\r\n\r\n\r\nDo you have something worth telling a story about? And there's a lot behind that. All right. Amazing story. I don't know that. I don't know that you took a breath during that whole thing, but you just were like, I didn't want you to cut me off because I didn't want it to get boring. You got, man, we have a lot of questions.\r\n\r\n\r\nI'll take the first question, Chris. And then you take the second question. I, you just came out of the closet recently with the community that you live in. And you like talked about kind of your background and your upbringing. And as I'm hearing you talk, and as I look at the pictures  of what you built, and as I look at where you grew up,  it looks to me like you rebuilt where you grew up.\r\n\r\n\r\nIn this short term rental Airbnb, right? Like it's, they're close enough to each other. There's a lot like there's fences in between you're facilitating this communal atmosphere. Was that intentional or is it just now in retrospect that you're like, Oh, I guess I did  take this sort of idea and rebuild it over here. \r\n\r\n\r\nThat's a great question. And I don't think anybody's asked me that. So. Yeah, to summarize, I live in this intentional agrarian Christian community and we privately own homesteads, but we collectively own a lot of agricultural areas and a craft village and all kinds of cool stuff, communal areas that we can use.\r\n\r\n\r\nIt's a really great concept. You should come visit. It's called Homestead Heritage.  So much of my upbringing, whether it was on the, just on my family level, my siblings, my parents, but then the community, they're pretty much inseparable, was,  I owe everything I am and have to that, to that upbringing. And it's so hard to try to pin down influences and different formative aspects of my childhood.\r\n\r\n\r\nBut yes, to answer the question, absolutely. I think it's a Really insightful question, because when I think about it, I believe people are absolutely hardwired to connect with people. Obviously everybody knows that we all need a sense of belonging. We need a community. And yet in today's day and age and culture, even with social media, which could be, I guess, termed a community on some level, it's created a problem because, I think social media should be a tool that leads to in person relationships and in real life events, relationships, a lived life.\r\n\r\n\r\nAnd so many people try to substitute that. And I think like virtual reality and gaming and so many different, yeah, AR is really the antithesis of what I believe. It's like you can mimic and create this alternative. So to have a property that sort of brings together The, a sense of place,  uh, enhancing and, and, and really magnifying and showcasing the beauty of an area, even say central Texas, which probably objectively isn't the most beautiful place, but I think is very beautiful.\r\n\r\n\r\nIf you can craft, you know,  that's right. I think more than anything though, Isaac is like, it's fostering community. And you talked about,  Oh, Hey, you want to go to a market that has regulation and that won't allow other people to come and build there. And yes, that is a form.  Of building a moat around your business, but that's like an external moat where cool.\r\n\r\n\r\nOnly a few of us can get into that market with, if we know the right people or if we time it right. But then there's this other thing that we can do to build a moat, which is be very intentional, have an exceptionally high product, and just be better than everybody else in the market. And I think that's really where you played.\r\n\r\n\r\nHere is you've created this experience that fosters and facilitates community.  Yeah, we have a commons area we designed and it only costs us around 35, 000. It's a pergola stone patio fireplace, a dock down public access to the small lake, which we basically, we didn't build it. There was already a body of water, but we, Greatly enhanced what was there and made it beautiful.\r\n\r\n\r\nAnd just creating that little environment. Then we have a container pool next to that swings. Cause we cater not just to a lot of couples getaways, but also to a lot of small families that come in and stay. And one of the most rewarding parts of the whole thing. And I know that this could sound like what everybody says, but this, I really mean this from my heart at the end of the day.\r\n\r\n\r\nLet me say this. If you're going to be in hospitality, you have to be a people person. You have to love people. You have to love to connect with others and  to feel that sense of pride and accomplishment it pride in a good way of like we built something here. And it was definitely, they say it takes a village.\r\n\r\n\r\nIt took a village to build that village. It was a big team effort,  but to have that done and like to know, to have the scars, to prove it, even literally. And then to be able to go over there and interact with some of the guests who are just organically mingling and getting to know each other. I had.\r\n\r\n\r\nCountless conversations like this, where somebody, a family from Dallas was there, a couple from Houston came in somebody from wake of someone local,  and they're genuinely all being united by this shared experience, this beautiful place, getting to know each other.  Yeah, I get to make new friends, honestly, having that.\r\n\r\n\r\nAnd I got to do it less and less just because my schedule got crazier and crazier through the process. But that's something I always want to be grounded in again, like those in person relationships, that is my life. I've shared about it publicly now on like a lived basis, but even with the property, it was so cool to see people.\r\n\r\n\r\nAnd like, we were very intentional in the design. There's no TVs in the units and we do have really high speed wifi.  There's no TVs in the units. No, I don't think I can film anymore. That's my baby.  Yeah. Most people would say like that, that will kill the idea. No, I know you're joking.  Most people would say like, that's stupid.\r\n\r\n\r\nLike, what's, what's wrong with you? But we didn't listen to the orthodoxy when we designed to build these. And sure enough, just little decisions like that throughout that again, created this overall experience meant so much to people because sometimes you don't know what you want, like Steve jobs said it so eloquently, but, you know, He was like creating the iPhone when people didn't know they needed an iPhone and he was  creating the need for it.\r\n\r\n\r\nAnd so in kind of actually an ironically opposite sense, we were creating the, we were getting rid of the need to constantly be on your phone without you even really knowing. And I know that's even obvious in one sense, but like, again, just by fostering those connections. Regrounding people in nature. And I know, again, it becomes very cliche sounding, but it's a real thing.\r\n\r\n\r\nThere's a reason we hit 95 percent occupancy overall. It's crazy to think about.  Chris, I'm curious. Cause hearing him talk reminds me a lot of you actually, like Isaac, I can tell you're particular. You like to make sure that everything is perfect. And Chris is very much like that, right? Like he wants to make sure that the brand and the experience and what he's putting out there is representative and reflective of what he's like.\r\n\r\n\r\nAnd he gets to be perfectionist sometime. Sometimes, but Chris, I'm curious, like  what's percolating on your mind? Like what, after hearing all of that stuff, do you really want me to talk? I have a page full of notes and I could just talk for hours. Yeah, dude. So much to say. First of all, it's funny you referenced Steve jobs.\r\n\r\n\r\nCause I'm getting like,  like Joni Ive. Vibes from you, the designer from Apple.  He has such an attention to detail. And Nick, I think it's funny that you compared him to me. Cause the more you talk that like before we ever spoke, it's like, Oh man, this guy have a lot in common. That's why I like him now. It's like, I like this guy because we don't have a lot in common. \r\n\r\n\r\nI'm terrible at attention to detail. If I be, if I built Live Oak Lake, it would have taken three years. I would have like forgotten the road leading up to it. There would have been no attention to detail or anything. Like I probably could have marketed people there.  I'm thinking of an interesting analogy where you're like, everyone says, pay attention to zoning.\r\n\r\n\r\nAnd we said, screw that. We're going to have the best park and zoning doesn't matter. Like we're buying and building RV parks and that's what we do. We pay attention to zoning. And I think of an analogy to that is like Elon Musk always says like, you don't need to market. Like if you have an amazing product, you don't need marketing.\r\n\r\n\r\nAnd hit Tesla famously doesn't market. And that's what you're saying, right? Like if I have an amazing product with high attention to detail and good distribution, direct bookings, not relying on Airbnb, then I don't care who builds next to me because I'm going to be better than them. And I'm saying personally, if I built Live Oak Lake, I would care who came next to me because they would probably be better than me.\r\n\r\n\r\nHe would care. \r\n\r\n\r\nOkay, guys, we're going to get back to the show in just one second, but first a message from a sponsor. Who is, uh, me? Oh, it's me. Cause I'm doing the show for free. Listen, I want to give you a hundred dollars. All you have to do is this go to Apple or Spotify.  Give me five stars, write a review, screenshot that review, send it to me, Nick at cofounders.\r\n\r\n\r\ncom and you'll be entered to win a hundred dollar Amazon gift card. Every four episodes, I'm going to choose a winner at random and I'm going to do this five times, 500 for five stars. I just made that up. That's what I'm calling it. Please go to Apple or Spotify, leave a review, screenshot it, send it to me, Nick at cofounders.\r\n\r\n\r\ncom and you'll be entered to win a hundred dollar Amazon gift card. All right, let's get back to the show. I'm super impressed by your attention to detail and I see it on your website. I see it on your Twitter account. Like everything you do is highly crafted and curated and I have aspects of things like that, but mostly I'm just like, Move fast and break things done is better than perfect.\r\n\r\n\r\nLet's ship it out there. And that is fine. That that gets you from zero to one. You are very particular with the things that you want, right? Like, yeah, yes, but yes, attention to details. Definitely not there.  It gets you from zero to one, but you're going from one to 10 without attention to detail. Well, the problem is sometimes I don't always hit 10.\r\n\r\n\r\nSo I'll just give you one quick anecdote to illustrate this.  I've always been again, like artistic. My grandmother gave me art lessons as a kid growing up and I'm decent at it, but it's pretty hard to make a living as an artist. So it wasn't ever going to be, plus I'm just, I can't be tied down with one thing.\r\n\r\n\r\nI'm just. Too curious to try out other things, but I, one thing that's held me back, even like in my art, like painting and drawing is I always try to make a masterpiece. And they say like,  There's all those different quotes about basically reps are much more important than masterpieces when you're trying to learn something.\r\n\r\n\r\nAnd  again, like, it's just always been a, a weakness for me because everything I do, I want it to be absolutely perfect. So even though Live Oak Lake, which is an interesting case in point, because yes, we built it really fast and everything, but that doesn't necessarily mean it wasn't going. It wasn't because I made a bunch of compromises not to make it perfect.\r\n\r\n\r\nIt meant that it consumed my life for nine and a half months. You went way over budget. You already said that, right? It was like, it wasn't even a hundred thousand. Yeah. 35 to 40 percent over budget, which my original budget was probably way too conservative. And there were other price increases and stuff, but yeah, point taken.\r\n\r\n\r\nIt was unhealthy in terms of, I have to be super careful even now, like having a family. And then of course, having all this community life, because I get fixated on something and I will go so all into it. Doesn't mean it's going to necessarily take me a long time. It's just going to be.  I'm really lucky because I'm similar to you.\r\n\r\n\r\nI'm a musician and I used to write a lot of songs and it would take me forever because they had to be perfect. And I didn't write that many because I just couldn't get it right where I wanted it to be, but I have a partner in Chris who's like done is better than good or whatever. Done is better than best.\r\n\r\n\r\nWhatever the phrase is. And so Chris pushes me, I'm still very much that like analytical, we got to get it the right way, but we've been lucky enough to have kind of that partnership. Yeah. Isaac, I also love, and I know you didn't love this in the moment that you got banned by Airbnb. I love the theory of constraints and I'm fascinated by what this, like the startup failure rate in Silicon Valley might be if there was no such thing as a VC, because you don't have to be creative when you have 5 million cash in your bank account.\r\n\r\n\r\nRight. You don't have to, and who knows how many billion dollar startups we'd have out there today if they had to get creative and just make it work. But when you have all this money, you don't have to think you don't have to be creative. You just hire and spend, and then you go out of business.  If Airbnb never bans you.\r\n\r\n\r\nYou're just fat and happy on Airbnb at an 80 percent occupancy rate saying, Hey, we underwrote for 75. We're winning here. Right. But you're not like you would never have learned that. I mean, you may have, but like it forced you to learn it in a six day time span for 900. And it changed everything for you is super well put.\r\n\r\n\r\nThat's exactly. Yeah. That, that sums up. Almost every good thing. What do they say? Of course, necessity is the mother of the mother. Yeah. Yeah. Necessity creates the possibility. And I couldn't agree more with that. I wish I always want to stay extremely hungry in that sense. And that's the, that's always the challenge.\r\n\r\n\r\nCause as you scale and you get more successful, yeah, you feel less of that need, but that's the story of life, right? I mean, that's definitely the story of business. You always have the disruptors that are coming in. I think even in, to that point, like. In hospitality, specifically,  we're in, I described it as the early innings of like a massive, massive secular trend in travel and hospitality.\r\n\r\n\r\nAnd we're shifting away from this model of even like, you know, luxury and luxury travel spending is at all time highs, even right now, but people, my generation and those, the generations in front of me and all our generation, honestly, Seeks and prioritizes experiences over possessions and over luxury like not 10 to 1 and people still don't fully grasp.\r\n\r\n\r\nI think all of the effects of that, but as  that shift continues to unfold, creating projects like this, and that's why I'm so passionate about the opportunity. Is such a massive opportunity because  the big companies, Hilton, Hyatt, you know, even four seasons, like the luxury resort brands are not going to be able to innovate with properties like these.\r\n\r\n\r\nAnd there's a reason that they're paying the kind of money that they are for smaller portfolios, like graduate hotels just sold for 200 million dollars, just the brand, which is. 50 hotels, there's no real estate, just a brand, auto camp, there's, there's already some institutional exits that are crazy.\r\n\r\n\r\nWe're just getting started there. I want to ask you this question. It's a little bit of an introduction, but you posted recently about the community that you grew up in. And the way that you've described it is it's  very close, tight knit. Everyone lives close together, the Christian community, correct?  Okay. \r\n\r\n\r\nChris and I grew up Mormon. We still are Mormon. We met on our missions. We've been best friends ever since. And, uh, both of us, all three of us, in fact, have been on the receiving end of people calling us members of a cult. So we live by some pretty specific guidelines, so to speak.  I say that because I'm curious.\r\n\r\n\r\nYou had experiences where,  Hey, we're way over budget. And so you built a spec home and then rolled the profits into finishing the property. Airbnb freezes your money. And so you figure out a way to go to direct bookings, Chris. And I was laughing at the Airbnb story because Chris and I have had our funds frozen.\r\n\r\n\r\nI can't count how many freaking times Chris has the make it happen. Gene. I always call it the NIH gene.  My question is what is it about growing up in some of these maybe stricter communities  that allows for entrepreneurs to come out of it? And to be successful. Cause in my experience, I mean, there are a lot of Mormon entrepreneurs, but also people who grew up in very quote unquote, weird circumstances that are very successful entrepreneurs.\r\n\r\n\r\nDo you think there's anything from that background that translates well to being an entrepreneur?  Such a good question.  I would say, yeah, maybe a few things I'll touch on very briefly. One, we didn't have TV just like we didn't have TVs in the cabins. We didn't have TVs in our homes, in our home. We didn't play video games.\r\n\r\n\r\nWe didn't have any screen cell phones. We had computers and like, we, yeah, learned video editing and whatever, published our own newsletter and all kinds of stuff as kids, which was cool. But even that was really honest.  No, we're not the Amish. Like we use technology are kind of like if you want to say put it into like a slogan.\r\n\r\n\r\nWe don't want technology to control us. We want to control technology. So we're just really intentional about drawing lines. And especially with like entertainment and media. I just think it's so addictive and so destructive potentially. Especially to kids that you have to be super careful. So if you subtract a lot of that out, what does that mean?\r\n\r\n\r\nIt means that you all of a sudden have all this time and I would argue creativity and then just being in the environment of a communal setting like this, where music is a huge part of the culture, crafts are a huge part of the culture. So we actually have a school where we teach traditional skills like woodworking with hand tools, pottery, blacksmithing, weaving.\r\n\r\n\r\nUm, growing your own food, having animals and having that embedded in the culture as a family, as a community from before my earliest memories, I had, I was saving up money to buy my first flock of ducks when I was like five years old. And then I learned like all this amazing  personal responsibility by having those.\r\n\r\n\r\nAnd so it, we like cut out all these unnecessary distractions and it allowed for this incredible. Incredibly like innovative, creative, curious, yeah, experimental attitude in terms of like starting businesses and learning skills and whatnot. And so I would also add to that just briefly,  my parents and like, now that I'm a parent, we have our first son.\r\n\r\n\r\nHe's like 18 months. And I, so I,  thank you. My appreciation grows for what they did exponentially. How this feels, I'm sure as I'm raising my kids, but  they had the wisdom to know, like  they, Never prioritized our success in terms of gifts that we had financial success, any of that over the character development that was like absolutely the top priority for them.\r\n\r\n\r\nAnd so at times that, that forced them, they had to make difficult decisions and I'm very thankful for them. Like for instance, I can't tell you how many times I would get some much like I am today, some idea that I became fixated on some business. I was going to start, maybe it was learning an instrument or whatever.\r\n\r\n\r\nAnd they, of course, they encouraged that. They thought it was great,  but I would have some real major character flaw. And whether it was, yeah, I'll just be vulnerable. It was maybe dishonesty or laziness or whatever it was. I was being irresponsible in some way. And they saw that was.  You know, this other thing was taking precedence.\r\n\r\n\r\nAnd so, like, they would just say, no, you're not doing that anymore. At this point, like, you're banned. You're grounded from that activity. And it hurts so bad because, like, that's what I wanted to do so strong. And I'm sure there's a lot of parents who are listening now or people that are like, Would take pot shots at that, but I have so much appreciation for it because that discipline and then over time, like starting to see the fruit of that became such like an invaluable part of who I am today in terms of like. \r\n\r\n\r\nNow, even seeing like, okay, you take a project like Live Oak Lake, I wouldn't have even had the skills or the first inklings of how to actually pull that off without all the things my parents gave me, but when I did get involved in it, like that could have taken over my life. It came close to, and it could have been like, it could have been tragic in so many ways, because at the end of the day.\r\n\r\n\r\nLife is not about making money. Life is not about like  doing crazy projects. Life is about relationships. This is my view. And if you don't, if you're not successful in your family, in your kids, your parents, your community, the people that matter, then I don't give a rip about the rest of your success, even if you're changing the world in quotes,  now people, that's my view and I'm not trying to be too abrasive with that, but what I will say is if you make the right priorities in some of these ways.\r\n\r\n\r\nAnd when it comes to raising a family and I'm giving credit to my parents in this, you actually get a stronger entrepreneur, someone with stronger skills, someone with more responsibility, someone with more of a work ethic, someone with even more creativity, but a balanced person. So I don't know if that answers the question, but it sounds like what you're saying is you were given the opportunity to do hard things.\r\n\r\n\r\nWhen you were young and the environment to fail and quickly have feedback and have people help you along that path to, to supplement the things that you, maybe you are naturally weekend. I think that's a really, really cool observation. Chris, what do you think?  I agree. I've started trying to practice this myself.\r\n\r\n\r\nIt might sound silly, but let's say there's a snack that I'm having too much of like every five minutes. I go grab the wheat thins. It's like, okay, there's nothing wrong with wheat thins, right? They're fine. But it's like, I, if I feel over reliant on them. Then I'll, I'll cut it out, right? Anything in my life that it's like, I'm relying on too much.\r\n\r\n\r\nI'll cut it out. Like one of my sons will play brawl stars too much. And it's like, you're not addicted to this, but this is like, you're just over reliant on it. And it's just a healthy practice to call that out. Like every now and then it's like Lent, right? Like every now and then just call out those things that you're relying on too much, even if it's like a healthy food, right?\r\n\r\n\r\nModeration in literally all things. I love it. All right. Enough with the philosophical crap. Chris, I want you to ask this next question because this is the part I'm the most excited for. Okay. Isaac, this is my question. This is, I have a patent on this question and that is patently false, but I want to ask it anyway.\r\n\r\n\r\nSo what are you seeing in the industry that you're obviously focused, you have to be focused to get this built in nine months. So what are you two focused on? What opportunities or business ideas to chase down that you think In another life, you would chase down or other people should chase down  going back to what we said about staying hungry, and I've actually not totally ruled out doing this, but  I want to lower the barrier to entry.\r\n\r\n\r\nSpeaking of barriers to entry for people that think, oh, I'm not privileged enough. I don't have wealthy families. I don't have a wealthy family either, but I was creative. And yes, I am privileged in a lot of ways. Most people can do this, what we're talking about.  I want to lower the barrier by just going out. \r\n\r\n\r\nI wish someone else would do this who could really have a platform to say this from, but, and literally bootstrapping all of this with no connections, doing a one off property and documenting the whole thing in the order of priorities. If you say, okay, I'm going to need to raise money. I'm going to need to get financing.\r\n\r\n\r\nI'm going to need to get a design. That's great. I'm going to need to find a market, all these different checkboxes of what to do to create a micro resort or a unique stay. Okay.  I would say storytelling is at the top of that list, but that's not what people think. And if you will build the muscle and start be willing to put yourself out there and start authentically sharing, first of all, you have to have a dream to do this.\r\n\r\n\r\nYou can't just say, Oh, that makes sense on a spreadsheet. So let's do it. Like you have to be fired up and passionate about it. But if you have that dream and you're willing to let it burn, you've got to tell your story and you got to do it publicly. And I'm seeing people doing this right now, a couple of people, but. \r\n\r\n\r\nThey haven't even started construction. Some of them are in the process of raising money. They've all one guy's already built 130, 000 followers on Instagram, just sharing his vision for what he wants to create. And he's an awesome storyteller master, the art of storytelling. And this is something I'm still very much working on, but put that at the top of your list.\r\n\r\n\r\nThat's going to lead to connections. That's going to lead to the money. That's going to lead to. All the answers that you're, that you think are standing in the way of you achieving that goal. So that's somewhat philosophical. Let me drill down into one specific answer. I've told this to a number of friends over the last two and a half years, since  the whole Airbnb debacle,  when we launched our Instagram.\r\n\r\n\r\nYou need, it's all about direct bookings. You need a website to capture direct bookings.  PMS stands for property management softwares that are out there, host away, guesty, hospitable, owner res. Those are some of the big ones in the STR space. Most, if not all of them include a direct booking engine component.\r\n\r\n\r\nHowever, it's trash. It's terrible. It looks terrible, especially for someone who like cares so much about design. It's.  It's just awful. It is great on the backend and that it will aggregate the calendar. Basically for direct bookings, you need a calendar just like Airbnb,  but then obviously you need to be able to aggregate those calendars with the other OTAs like Airbnb.\r\n\r\n\r\nSo you're not getting double bookings. Then you need to have some basic message automations.  Confirmations, checking instructions, et cetera, et cetera.  And you need to have a payment processor like Stripe. Well,  the booking engines that are out there are trash. And this is, I've actually thought about it.\r\n\r\n\r\nI've thought about partnering with the developer to do this, but someone needs to build a great, just call it Shopify for unique stays.  It's, you would think this is simple and yet it's. It's absolutely a gaping hole in the market and make it customizable, beautiful, simple. Direct bookings are all about reducing interference, reducing friction.\r\n\r\n\r\nAirbnb is a, Brian Chesky has become famous for saying this. He's a designer and Airbnb is a design led company. They've done. If they've done one thing, right. It's that they have incredible UI and they totally smoke Verbo and some of the other players booking because their design is awesome. If you do have direct bookings, everyone's conditioned to have design like that, and there is none.\r\n\r\n\r\nYou're saying there is none and make a direct bookings website and plugin that is as aesthetic as the kind of properties that I'm passionate about creating. That's really. What I'm trying to say here, but as a SaaS opportunity, this is absolutely gold because I, from my vantage point, get to see how many people are experiencing this exact same pain point.\r\n\r\n\r\nI have a community. We have about 55 active in the trenches, builders and entrepreneurs building these stays right now in there. This is one of the biggest questions that comes up repeatedly. What do we do about direct bookings? Cause it looks like trash. Right now the workaround, if you don't want to just put up with the terrible looking templates that they provide, you is hire a developer.\r\n\r\n\r\nIf you go to bolt, I don't know if you guys have heard of bolt farm tree house. It's a really cool property in Tennessee. Go to bolt farm, tree house. com. They have a really good interference interface. Actually, they obviously hired a developer to. Custom basically, yeah. Build something around the functionality of the PMS that we're talking about.\r\n\r\n\r\nAll we need is like a wrapper. It's really simple. Somebody should build this. You build insane enterprise value. I probably cut.  Isaac, why wouldn't you go to tech or what are they? Tennessee tree house farms, bolt tree, bolt farm, tree house, bolt farm, tree house, great name, why wouldn't you go to them and be like,  let me license this.\r\n\r\n\r\nI have the distribution with my social media. I could blow up and white label this software because if they've already built it, want built it once, it should be. I'm assuming it's integrated with probably one of the biggest PMSs. Yeah, yeah, yeah. They're integrated with guesty. I think it is. I could actually matter.\r\n\r\n\r\nThe funny thing is the owners of this Seth bolt is a, is the basis for a big band called need to breathe. It's actually an awesome band.  And so he actually already has a lot of distribution, but he's not Chris. No, no, he's not in the S you know, need to breathe.  I don't think so. No, I don't need to pick out their music.\r\n\r\n\r\nThey have really good. How old are you? Isaac? 27  F me. Gosh, dang it. That's why we don't know. Need to breathe. Chris, you're like a sniper.  Heard a Simon and Garfunkel. \r\n\r\n\r\nThat's one example. You could build it other ways too. And so like they've done some, they've done the hard work for them. Doesn't mean it's a one size fits all what I'm talking about. You could have different templates and different solutions, and I'm sure it's harder than I'm making it sound. Bye.\r\n\r\n\r\nSomebody please do this. And if you're serious about it, talk to me, cause I do have distribution in this space specifically and the ability to sell it, or you could just create an agency, Chris. The agency is creating, you know, better booking  experience for you. Just copy and paste the code. There's a guy out there already.\r\n\r\n\r\nIf you go to boosley. co. uk,  this guy, Mark Simpson, and he has like an agency. They do this. Here's the problem. And I like Mark. Mark, if you're listening, don't. They don't get it when it comes to design. And this is fine for like the bottom 80 percent of properties, but this is not fine for my property. I'll respond for Mark.\r\n\r\n\r\nOh, bloody hell. Come on. It's a great looking website.  I  don't know. I don't know where to go. He's a good guy. I love that you used the Shopify example because that's exactly what I was thinking. It's like, you know, Amazon came around in 95, Shopify around 10. And it's like Airbnb 15 years old and it's here.\r\n\r\n\r\nIt's we're 15 years in and there's no, there's no Shopify to Airbnb is Amazon yet. Right. No one's arming the rebels, so to speak.  That's exactly it. That's a big opportunity. Huge opportunity. I mean, you could take a percentage of bookings plus a monthly fee, like the monetization angles are. Well, yeah, you could build out other elements to this more on the property management side, revenue management, dynamic pricing, smart home automations,  Is the problem that the payment doesn't interface with the PMS because like there have to be really good payment or booking experiences for other experiential activities.\r\n\r\n\r\nRight? Like, I don't know, water skiing or snowboarding or like just other things that you can pay for online. Why wouldn't that translate to just slap it on to your website and let them pay for their bookings using that? You're saying like calendar integrations where you're scheduling something. Yeah, there probably are.\r\n\r\n\r\nI don't, if there are, I don't know of them. Another cool company. This is a startup in Austin. If you, it's a way. co w a y. co they're focusing just on experiences, which again, I was like a key part of this whole experiential hospitality model. So they'll work with. Property like Live Oak and then work with local vendors that are like a expert guide to the city or a kayak guide or whatever it is. \r\n\r\n\r\nAnd then plug this together. They get it when it comes to design design, you can clearly see from their website, but nobody's doing this for the actual reservations.  I love it. Can I give you a very niche idea, but I think would be amazing.  I think you could build.  The social media retreat compound where you specifically design it for people who are interested in a weekend with  Sahil bloom or a week with.\r\n\r\n\r\nNick Huber or, you know, or some other YouTuber who's going to, yeah, a week a week with them would be a long time or so, or a YouTuber or a Tik Tok influencer, Instagram, whatever it is. And it's, you know, it's giving access to people to come and have an experience with them. They could have an educational component to it as well, but it's specifically designed.\r\n\r\n\r\nTo take advantage of social media and like, what do they want? We want somewhere to take really cool pictures so that everyone can see what we did and the food's really great. And so we're going to, even the presentation with the food is Instagram worthy or, you know, a live band. I don't know. I'm just trying to like think through it.\r\n\r\n\r\nBut I think if you designed that in a place where they could  to reasonably easy, easily,  you're already in sort of that social media space. You could probably tap into a lot of people coming and using that retreat  for their social media purposes. Chris, do you hate it or love it? No, I love it. Yeah.\r\n\r\n\r\nThere's a zillion ideas. I like the idea of just leveraging Instagram more for properties like yours, being a middleman between Instagram influencers and properties like yours to help facilitate. Oh, that's a great idea. Giveaways. So just have like an agency that's that represents them.  That's a killer idea because influencers are like, it's a huge arbitrage right now.\r\n\r\n\r\nThey, the best ones are still heavily under monetized what they charge versus what they're worth. And that's changed a lot, but it's still like  a huge opportunity, but it's so fragmented. It's almost impossible. That's another question I get all the time. Like who, who do we use? How do we know? And like to be able to vet them and help coordinate their schedules and such.\r\n\r\n\r\nIdeally you would own them almost like not own. You would own those.  You could incubate your own influence. We don't own people anymore.  With the C word, I think it's funny you bring this up cause Nick and I literally talked about this week. So I started on Instagram  and I had this video blow up over the weekend.\r\n\r\n\r\nI went from 70 to 120, 000 followers. I saw it. It's awesome. Thanks. Thanks. And I've never done any promo and not even for myself. Like I push people to my podcast, which isn't even monetized, but I found this guy. We were DMing. He's in like the lawn care influencer niche, believe it or not. And I saw he had like a promotional video for Harry's razors and I DM them.\r\n\r\n\r\nAnd I'm like, how much do you get paid for that? And he has 40, 000 followers. I'm like, he's like three grand.  What three grand to make a dumb real at 40, 000 followers for Harry's razors. And I'm like, geez, Louise, like how much could I get paid? And then I realized not one person has DM me saying like, Chris, I want you to sell this software or a job or this home services CRM, like no one's reaching out.\r\n\r\n\r\nSo that just makes me think, wow, we could reach out to people like me and. Pretty confidently know that they're not getting hit up from everyone for offers like these. Yeah. You know what I'm saying? That yeah. Yeah. So that's the creator and vet the business opportunity, pair them together in a really efficient way, make a nice spread on top. \r\n\r\n\r\nYeah. Like just, you know, who's killing it as a creator is Hans Loride. You know, Hans.  I know, I don't know Hans.  I don't, you follow him on Instagram. So he started on Twitter and it has an excellent newsletter too, but into your design tips and he went from zero to 583, 550, 000. I think he is today in like seven or eight months, just posting 185  posts, but he'll just have like a format and he's just copy and paste it. \r\n\r\n\r\nAnd he's got a great, unique personality and he's, Offers a ton of value to like,  it's not rocket science. We could talk about social media all day.  Yeah. I like that agency idea. Cause you're already in that space and there's a lot of people who don't know how to navigate it. Right. Like, and there's a lot of people who all of a sudden blow up and there's this learning curve between, okay, I've got 50, 000 followers and how do I monetize?\r\n\r\n\r\nLike it takes time for them to figure that stuff out. If you could be the one to be proactively reaching out to them and saying like, Hey, man, congratulations on your growth. I see that you're doing really good content. I don't know if you're interested or not, but we have a lot of people who are interested in marketing.\r\n\r\n\r\nThank you. Through your channel, you know, hit me up and then you guys have a conversation. You can get like a nice stable of people that go and promote stuff.  Definitely. Yeah. Like I, I didn't start an Instagram to start selling Harry's razors, right? I started to push people to my podcast, but if someone DM me and was like, Hey, I've got relationships with the Harry's razors and I'll take 30 percent and I'll bring you 10 grand deals.\r\n\r\n\r\nIt's like, that's attractive. But you know, no one's reaching out. It's a missed opportunity.  Agreed. Mark recognizes my talent.  You have a lot of talent, Chris.  Thanks mom. I'm Nick.  You guys have a great chemistry.  Thanks. What Isaac? What else? You got any other other things bubbling on your mind? Finding one final thought and example on the Shopify for short term rentals. \r\n\r\n\r\nWander. com is super cool. And a lot of people know them, but they've got, they've mastered design and brand. And if you look at their, I actually like this quite a bit more, even than the bolt farm tree house, but excellent, excellent UI when it comes to selecting dates, booking, really simple, clean design.\r\n\r\n\r\nSo  they're killing it as far as an example, but again, they're not, they haven't licensed this. This is just an internal thing. So somebody needs to make this as a SAS product.  All right, Isaac, this has been an incredible interview.  I have a rapid fire set of questions to ask you as we end. Are you good with that?\r\n\r\n\r\nSure.  All right. I'm only going to ask you three of them this time. But my first question is,  we're all jealous creatures.  So what industries or businesses are you the most jealous of right now?  Mobile home parks. No, just kidding. Oh,  that was quick.  No.  What industry, man, that's a great question. Oh, gosh, I'll, I'll tell you, I'm always really interested in commercial real estate.\r\n\r\n\r\nCause I'm like, Oh, that'd be so nice. Triple net lease. I just get a rent check every single month. I don't got to worry about anything in my mind. They have it made.  I can't think of anybody else. I'm jealous of like, I love what I do. I think it's the best. It's a  better than us. That's all. I'm better than you.\r\n\r\n\r\nI'm better than you. I was hoping to ask that question and feel better about myself, but Isaac just freaking threw it in our face.  Okay.  If you have two hours in your day, you don't have any family time and you don't have any work time scheduled, right? You can do whatever you want with those two hours. \r\n\r\n\r\nWhat are you obsessed with right now? What are you spending your time on? I am going to read one of my 1, 200 books, physical books, that I've bought in the last year that is sitting in my library behind me that I have not had a chance to read yet, because I love to read, but I just never have time. Hold on a second.\r\n\r\n\r\nYou've bought 1, 200 physical books in the last year? That's an exaggeration. I bought somewhere around  4, 500 books, but that is not an exaggeration.  I have a problem because like, I'll just read, I'll see a review on a book and I love reading. And I think books make people really smart. And I know that all successful people have that problem read.\r\n\r\n\r\nSo I buying the books, but not actually reading them.  Do not give this man disposable income.  Nick, Nick does that, but then he'll buy one for me too. And he'll read three pages. And he's like, I read it. You didn't read it. Like you, you didn't read the whole thing, Nick, you read, I love, I do love physical books.\r\n\r\n\r\nThere's some, there's just totally different about having it in your hand and being able to, you know, flip through it. So I'm in. All right. Last question. I usually say, what advice would you give yourself 10 years ago, but you were 17 at the time. So what advice would you give yourself five years ago?\r\n\r\n\r\nBefore you started this entrepreneurial adventure. I don't know if this is, I don't know if I would have listened to it. Cause I think you can intellectually understand this, but then some things you just have to learn the hard way. I think humility to be completely vulnerable is something I'm still trying to learn.\r\n\r\n\r\nAnd someone like I'm naturally so extroverted. So like. Risks friendly, so out there ready to do it.  Sometimes you need some hard knocks just to like  teach you. Yeah. Teach you humility. And to be completely honest, we all have an ego. We all are like somewhat like we have limitless potential as humans, but we also have a baser nature and we're self interested and just con and that's where I find, you know, constant grounding in my faith and my community.\r\n\r\n\r\nBut.  Humility, humility, humility, like goes a long ways. I love that quote, I think it's C. S. Lewis actually, he says,  Humility is not thinking,  Less of yourself and it's not thinking more of yourself. It's not thinking about yourself. And that's kind of what I try to live up to on a daily basis. But it's a work in progress. \r\n\r\n\r\nI think that's interesting. There's, I think there's a self selection in there where people that strive for humility get it.  Because they're self aware of it and they care about it and people that aren't striving for humility don't even know that they're prideful and therefore they'll never get it.  I have one more question.\r\n\r\n\r\nYeah.  Yeah. Is that allowed? Is that allowable?  I'll allow it. Last question  to me when you said you got the property under contract and then you raise the money, like, What the heck in the world told you? If I build it, they will come. Did you see some data point? Was there somewhere, another similar place in another state?\r\n\r\n\r\nLike what research did you have? Or was it just in your bones? I hate to say it, but there was no research. I talked to a couple of friends that had Airbnb and all they told me is don't build more Airbnb in Waco, but I was like, you don't get it. What I want to build doesn't exist. And it's going to create a new lane of traffic.\r\n\r\n\r\nIt's not going to be. It's not going to be. Dependent on just, again, people scrolling, what's the best place to stay. It's going to become a destination. And so it was like a dream that was crystallized into a hardcore conviction that this didn't exist and that this needed to exist, and this was the place to do it, and especially on that piece of land, it was literally, I think I got goosebumps, like this is the place. \r\n\r\n\r\nGood for you, man. That's a big risk. That's why you're able to make that spread between 7 million sale price. Because you took that risk. Like if someone would have came to me or Chris, we would have been like,  Hey, if this was doable, someone would have already done it.  Like Isaac, chill out. Don't go overboard.\r\n\r\n\r\nThis isn't going to work. Right. But  you needed that determination and that grit to stick it through. That's, it's an admirable quality, man.  I talked to a lot of dreamers. A lot of people approach me like, what do you think of this idea and that idea? And like, I hear a lot of people say what you're saying, but they don't go through with it.\r\n\r\n\r\nRight. It's a very small Venn diagram overlap to have both qualities. And so very, very jealous of that. You've done a great job. All right, Isaac. This was fantastic. Where's the best place for people to come find you?  Active on X again at Isaac French underscore and my newsletter. I literally spend two to three hours a week writing it.\r\n\r\n\r\nEvery word for you. That's, you can find it at IsaacJFrench. com.  Awesome. Isaac. This was great. Chris. Thank you. Nick and Chris, thanks guys. Pleasure. Appreciate it. All right. That's it. Another one for the books. I'm fired up. I don't know what else to say. I hope you found something valuable in that conversation.\r\n\r\n\r\nI hope you learned something. I hope there's something that you can apply to your business today, tomorrow, in the future that. It makes you money. It makes you more successful. It gives you more time with your kids. If there was something I'd love to hear about it in the comments below, you know, give me some feedback.\r\n\r\n\r\nAnd if you like actionable advice and you want more of this, I write a weekly newsletter that gives insights, tips, and tricks into the world of entrepreneurship. Subscribe in my bio.  And if I can help you in any way in your entrepreneurial journey, don't hesitate to reach out to me. Nick at co founders.\r\n\r\n\r\ncom sorry, Kelly, for more emails. And the last thing is. Remember,  curiosity is a superpower and you can use it to your advantage. As my mom used to say, there's no such thing as a dumb question,  only dumb people.  We'll see you next time.",
  "metadata": {
    "duration": "",
    "date": "2024-08-16",
    "platform_source": "Google Drive"
  }
}