{
  "episode_number": "225",
  "episode_title": "The Business That Legally Eliminates Your Tax Bill with Kriss Bergethon",
  "guest_name": "Kriss Bergethon",
  "business_name": "E-commerce Health Supplements, Car Washes, Gas Station",
  "transcript": "﻿Nikolas Hulewsky (00:00.172)\r\nmy stuff's good. Yes. And yes. Okay. Chris Berg, you are a serial entrepreneur, your companies do, you know, close to $10 million a year in revenue. You've got tons of different businesses, you've got e commerce, you've got real estate, you've got agencies, like you're an entrepreneur is entrepreneur, which I freaking love. You said two things to me before we got started. One was you were not planning on being an entrepreneur entrepreneur.\r\n\r\n\r\nKriss Berg (00:21.263)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (00:28.738)\r\nSo I'm so excited to explore that with you, I'm like same. And then the second thing was you started talking about this incredible flywheel that you've created with your businesses about how you generate cash and then where you put that cash in tax advantaged vehicles and then that feeds back into the business. Like it's kind of blowing my mind. Can you just tell me that again? How does the flywheel work that you've currently got set up?\r\n\r\n\r\nKriss Berg (00:28.761)\r\nRight.\r\n\r\n\r\nKriss Berg (00:52.571)\r\nYeah. Yeah. So, uh, I've had an e-commerce business for almost 15 years now. It's health supplements. You can kind of see some of these things over my shoulder over here. And, uh, we're launching a telemedicine platform. That's all going to be part of it, but that business kicks off nice cashflow for me and my partner. pour, of course I use, I live on some of that money and then I pour excess profits into commercial real estate, specifically car washes.\r\n\r\n\r\nI also have a gas station now, so I have four car washes, two car washes under contract, and a gas station. And that whole thing has completely nuked my tax bill for three years now, should, for this fourth year too, so for this year right now. Yeah, I paid zero income tax. I pay a lot of property tax. I pay a lot of all your local taxes.\r\n\r\n\r\nNikolas Hulewsky (01:40.969)\r\nNuked it in a good way though, right?\r\n\r\n\r\nKriss Berg (01:50.189)\r\nsales tax, all that stuff, but zero income tax.\r\n\r\n\r\nNikolas Hulewsky (01:54.862)\r\nOkay, so the idea is generate high cashflow from the e-commerce business or whatever high margin business that is, and then you funnel that money back into real assets, real estate, because you can use bonus depreciation being one of them to offset your tax bill. So then you have more cash to then reinvest in business, which then grows that business, kicks off more cash, and it's just like this virtuous cycle. Is that fair?\r\n\r\n\r\nKriss Berg (01:58.735)\r\nYes.\r\n\r\n\r\nKriss Berg (02:05.561)\r\nYes. Yep.\r\n\r\n\r\nKriss Berg (02:14.275)\r\nIt's like.\r\n\r\n\r\nKriss Berg (02:18.011)\r\nIt's a beautiful virtuous cycle. And the nice thing about it is that I think a lot of your listeners have probably heard about bonus depreciation and they say, I got to be a real estate professional. With car washes and gas stations, you don't have to be a real estate professional. That is not required at all.\r\n\r\n\r\nNikolas Hulewsky (02:35.118)\r\nSo that, well dude, this is what I was gonna ask you, cause I'm a freaking moron and I had.\r\n\r\n\r\nKriss Berg (02:40.667)\r\nSo, oh my, we're gonna get a lot of grave.\r\n\r\n\r\nNikolas Hulewsky (02:46.424)\r\nSo I like, I was I was like, this is it cool. I got some cash. I'm making money. I'm gonna go buy some real estate. So me and my friend, Chris Kerner, I'm like, dude, let's buy some let's buy an RV parks, we buy an RV park, get the RV park, cool, things are going and I'm like, alright, cool. Well, that should offset my taxes, right? And I go to my accountant, he's like, well, I mean, they're, passive losses. And I was like, okay, well, we'll just offset it against those passive gains I have. And he's like, well, you don't, you don't have any passive gains. So I'm like, wait,\r\n\r\n\r\nKriss Berg (02:53.039)\r\nYeah.\r\n\r\n\r\nKriss Berg (03:12.067)\r\nYeah, yeah.\r\n\r\n\r\nGreat.\r\n\r\n\r\nNikolas Hulewsky (03:16.906)\r\nCome on, say what? So literally, my wife, we might cut this part. I have like 500 grand sitting in passive losses right now. That is just there. And my wife's like, why are we paying this money to the IRS? Don't we have all these losses you told me was just gonna be offset? And I was like, I made a mistake. But car washes are not that way.\r\n\r\n\r\nKriss Berg (03:32.091)\r\nYeah.\r\n\r\n\r\nNo, they're considered an act of business. the active losses from it. So here's the thing with gas stations and car washes. And I wasn't smart enough to figure this out. I ass backward into this. I was looking for a self storage facility to buy because if you recall in 2021, if you were on Twitter at all, you had to buy a self storage facility. was, it was literally required to have an account. And I was looking for one to buy and nobody wanted to sell them because they were red hot.\r\n\r\n\r\nAnd my, agent who was looking for me, said, you should look at this car wash. I think it's a pretty good deal. These guys, hadn't done any of the basic blocking and tackling of a business, no Google maps, no reviews. hadn't updated the prices in 10 years. They were completely neglecting the business. So we bought it for like six 50. We went in, put in new equipment, which was not too expensive. Raise the prices up to market rates. We put it on Google maps. It got a bunch of five star reviews and we doubled the business.\r\n\r\n\r\nAnd they went from making like, it was making like 65 grand a year. Now it's making 140, 150 grand a year. And we thought, well, this is really good. Let's do it again. We bought another one. It was a carbon copy of that one. And that December, this is 2022, every December, maybe you do the same thing, you email your account. Okay, well, what's the damage on taxes here? What, you know, what, what am I looking at here? And\r\n\r\n\r\nShe said, good news, you're not gonna owe anything. And in fact, I think you're gonna get a bunch back because as an entrepreneur, you probably know you pay quarterly payments. She says, you're gonna get all your quarterlies back. And I kind of.\r\n\r\n\r\nNikolas Hulewsky (05:14.178)\r\nWell, let's not scare anybody. That's only if you're like making real money. Yeah, if you're not making real money, don't worry about those quarterly payments right now.\r\n\r\n\r\nKriss Berg (05:17.974)\r\nRight. Exactly. No, no, you really don't have to do it. So I did the, you know, the cartoon eyes, the woo-ga like what? I picked up the phone. I'm like, I think you're emailing the wrong guy. Wait, you just told me I won't own any taxes. Because my tax bills at the time were low to mid six figures every year.\r\n\r\n\r\nNikolas Hulewsky (05:28.78)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (05:41.038)\r\nCause you were, you were personally making from the e-commerce brand, like, you know, high six figures, probably eight, 900,000. Yeah.\r\n\r\n\r\nKriss Berg (05:45.563)\r\nsee figures year after year and I was used to cut back for the the tax man for 200k 300k that was on top of my quarter lease So I had basically just made four or five hundred thousand dollars and I didn't know how I said What are you talking about? And she said bonus depreciation and I knew that was a part of it because people were talking about it But I didn't understand it at all. I didn't know what it was. And so That got my attention\r\n\r\n\r\nNikolas Hulewsky (05:53.568)\r\nRight. jeez.\r\n\r\n\r\nKriss Berg (06:13.11)\r\nAnd so ever since I've been like all in on this. so car washes are active businesses. A storage facility is a passive real estate. When you're renting a facility or you're leasing space or square footage, it's passive. Car wash is an active business. And for some reason with the tax code, the taxman decided that everything on a car wash and everything on a gas station is eligible for bonus appreciation except for the dirt, except for the real estate itself.\r\n\r\n\r\nNikolas Hulewsky (06:19.725)\r\nHmm.\r\n\r\n\r\nKriss Berg (06:42.042)\r\nSo you don't even need a cost seg study. You just need to know what the lot is worth, you subtract that from whatever you paid for it, and literally everything else is now 100 % eligible for 100 % bonus depreciation.\r\n\r\n\r\nNikolas Hulewsky (06:56.942)\r\nOkay, I have questions on that. Let's back up though first. Can you explain what bonus depreciation is?\r\n\r\n\r\nKriss Berg (07:01.21)\r\nIt's basically a tax break that Trump did in 20. I think the first one is 2017 and then just reupped it with the big, beautiful bill. And it's a way to spur investment in small business. They want you buying equipment. They want you buying factories. They want you buying hard assets with, and the way the tax man thinks of it is it has to have a life of 15 years or less. Okay.\r\n\r\n\r\nNikolas Hulewsky (07:09.655)\r\nYELL\r\n\r\n\r\nKriss Berg (07:30.818)\r\nAnything other than that is 100 % eligible for bonus depreciation. So for whatever reason, the tax code was written that the building of a gas station and the building of a car wash also has a life of 15 years. That means everything at a car wash is eligible to be depreciated. So.\r\n\r\n\r\nNikolas Hulewsky (07:53.612)\r\nYeah, my favorite thing to say is, man, it's a real estate giveaway. It's almost like we had a real estate mogul as the president of the United States. It's so weird. It's so weird.\r\n\r\n\r\nKriss Berg (08:06.758)\r\nOnce you get into investing in commercial real estate, you'll realize, and really residential real estate is eligible too, in a lot of ways, most of the tax code is written for you to invest in real estate. And that's why it's such a huge flywheel. And I just kind of fell backwards into this, but it's a massive advantage.\r\n\r\n\r\nNikolas Hulewsky (08:27.438)\r\nSo let me, I'm just gonna try to paint a picture for the audience if you're listening. this is like the reality of bonus depreciation. Let's say you have two businesses and you're looking at them, they're both million dollar businesses and one of the businesses makes, they both make $100,000 a year net, right? With the real estate, you buy it, it's a million dollars and I'm not, let's just say the land's not in there, let's just say it's all a million dollars. You can depreciate the cost of that real estate over, it is 15 years.\r\n\r\n\r\nKriss Berg (08:56.857)\r\nYeah, normally.\r\n\r\n\r\nNikolas Hulewsky (08:57.518)\r\nYeah, okay. So it's over 15 years. So you're not having to depreciate it over necessarily a much longer time horizon or not depreciated at all, you can actually depreciate the cost of asset. So what happens is instead of, I bought a million dollar asset, I made $100,000 in profit, I'm going to pay 30 % of that $100,000 to the tax man. Actually, what happens is you still made $100,000 in profit.\r\n\r\n\r\nBut now you've got this 15 year depreciation on a million dollar asset. So we're talking about, let's call it $75,000 a year in depreciation because 75,000 over 15 years is about a million dollars. Now it's like, oh, I had a hundred thousand dollar gain, but I have this $75,000 offset of depreciation. My taxable income is actually only $25,000. So I'm only going to pay, call it 10 grand. It's more than that ballpark. That's the magic of bonus depreciation. The flip side I would say is,\r\n\r\n\r\nthey are wanting to spur investment in commercial real estate in particular, because we do have an aging infrastructure. They want you to come in and, and say like, crap, I just, I just paid all this money. I can't afford to upgrade the facilities. So they're, this is like one of the ways that they get you incentivized to have the money to invest in those facilities. So I don't know, did I do a good job of like explaining the bonus depreciation idea or no.\r\n\r\n\r\nKriss Berg (09:59.514)\r\nYes.\r\n\r\n\r\nKriss Berg (10:13.144)\r\nWell, you explained straight line depreciation over 15 years. The bonus aspect is that you take it all in one year. Instead of the 75 over 15 years, it's a million dollar write off this year, okay? I have had a crash course in this stuff. So I've got the two car washes under contract right now. It's $4 million.\r\n\r\n\r\nNikolas Hulewsky (10:17.752)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (10:22.883)\r\nFlip!\r\n\r\n\r\nNikolas Hulewsky (10:28.492)\r\nWhere were you two years ago when I sold my businesses,\r\n\r\n\r\nKriss Berg (10:41.178)\r\nthe it's two locations, the real estate, meaning just the dirt sitting under these places is probably worth max of let's say $500,000. So the rest of it, the equipment, the building, everything on it are worth $3.5 million. Okay. With the bonus depreciation, if we wanted to, we could take a $3.5 million right off this year that would subtract from whatever income we had and would\r\n\r\n\r\nNikolas Hulewsky (10:56.547)\r\nHmm.\r\n\r\n\r\nKriss Berg (11:07.948)\r\nfor most people would be a loss and that would a loss that you could carry over probably for a couple of years.\r\n\r\n\r\nNikolas Hulewsky (11:13.578)\r\nAnd for anyone who's right now like, actually you can't because you're not a real estate professional. Sorry, actually you don't need it because these are real businesses.\r\n\r\n\r\nKriss Berg (11:19.226)\r\nDon't need it. Don't need it. Don't need it. These are active businesses. They count against active losses, active gains. So if you have a W3 job, I talk to people all the time that are like, hey, I'm a doctor, I'm a lawyer, I'm making mid six figures, upper six figures, and I've got this massive tax bill, what can I do? This is an option. It's an option.\r\n\r\n\r\nNikolas Hulewsky (11:28.056)\r\nHoly crap.\r\n\r\n\r\nNikolas Hulewsky (11:40.824)\r\nSo let's just say you have two under LOI right now. What's the combined value or are you okay sharing what kind of the combined value of those two is? Okay, so 4 million and you're gonna buy these, you're not gonna pay $4 million in cash, I'm assuming you're gonna finance. Okay, so you're gonna put how much down to buy these $4 million worth of car washes?\r\n\r\n\r\nKriss Berg (11:45.178)\r\nYep.\r\n\r\n\r\nKriss Berg (11:49.402)\r\nYeah, it's four million. Yeah.\r\n\r\n\r\nKriss Berg (11:56.408)\r\nYeah. Yep. Yep.\r\n\r\n\r\nKriss Berg (12:01.402)\r\nWe're about 700 and change down.\r\n\r\n\r\nNikolas Hulewsky (12:04.942)\r\nOkay, so you put $700,000, you get a $4 million asset, and in year one, $3.5 million of your taxes have just been what? Sorry. Yes.\r\n\r\n\r\nKriss Berg (12:15.29)\r\nWell, not three and a half million dollars in taxes. So you got your income. Let's just say you had a million dollars in income, but you have a three and a half million dollar loss. Now you have a two and a half million dollar loss. So you're not gonna pay any income taxes. That two and a half million dollars will roll over to next year. Now we should caveat all this with talk to your accountant because everybody's situation is different.\r\n\r\n\r\nNikolas Hulewsky (12:27.735)\r\nloss.\r\n\r\n\r\nKriss Berg (12:39.034)\r\nAnd the carryover is a little more complex than I'm making it sound. But these are the basics. This is the 101 version. And it's incredibly powerful for welding.\r\n\r\n\r\nNikolas Hulewsky (12:49.506)\r\nWell, the other caveat, so yes, we're not financial experts. And number two is you can't just do that and then sell the property and be like, cool, I made $2.5 million. There is a thing called recapture. if you, yeah.\r\n\r\n\r\nKriss Berg (12:53.912)\r\nYeah.\r\n\r\n\r\nKriss Berg (13:01.572)\r\nYou're gonna recapture. So my plan is to hold onto these for a long time. I'm really hoping to pass a lot of this on. I'm gonna build a real estate empire. I wanna have car washes and storage and gas stations. I wanna build buildings. I wanna rehab buildings. And I'm hoping to pass on an empire to my kids. Now, if they want no part of it, that's fine.\r\n\r\n\r\nBut if I were to die and hand them off to their kids, then they reset their basis and they don't actually pay for the depreciation recapture. But there's other options. 1031 is a huge option. Obviously, if you just got sick of the car wash, I can't do this anymore. You can 1031 and avoid taxes. But it is a tax deferral system at its essence. There's a million ways around that too.\r\n\r\n\r\nNikolas Hulewsky (13:50.83)\r\nYeah, but if you think about compounding, whether it's compound interest or just compound learning, whatever, the more time your money has to work, the more of a return you're able to generate. And so if you are cutting out, you know, paying an extra $500,000 a million a year in taxes, that money goes back into your assets and you're just compounding, right? So yes, eventually you pay the taxes, whether it's the recapture or if it's a 1031 and then you finally have to pay the taxes at some point, but you've now built up this\r\n\r\n\r\nKriss Berg (13:59.535)\r\nThanks.\r\n\r\n\r\nNikolas Hulewsky (14:18.786)\r\nthis massive base of assets, which is freaking incredible. I grew up, I knew guy who had a, I'm gonna have to describe it so he's not known. Let's just call it a commercial manufacturing company. And his company wasn't massive, student at $7 million a year, let's call it a million dollars a year in profit, okay? But he lived in this baller house, baller house, baller yard, took massive, like tons of trips.\r\n\r\n\r\nKriss Berg (14:31.119)\r\nMm-hmm.\r\n\r\n\r\nKriss Berg (14:36.301)\r\nOkay.\r\n\r\n\r\nKriss Berg (14:44.836)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (14:45.164)\r\nvery generous and I was always like, what the freak? And as I got older and into business, I finally was like able to talk to him. I was like, how did you do this? He's like, well, what I did, it's not from my business. I just took most of my excess cash and just started buying commercial real estate. And over the last 20 years, my commercial real estate, I now make almost double than my business. So I was like, wait a second, you're making like $2 million a year, just in rent from your commercial real estate. And he's like, yeah, and it's pretty.\r\n\r\n\r\nKriss Berg (15:09.336)\r\nYeah.\r\n\r\n\r\nYeah, pretty awesome.\r\n\r\n\r\nNikolas Hulewsky (15:14.158)\r\nIt's pretty passive. Now, it's freaking incredible. And I use that story now because a lot of people are like, I want to buy a business that generates passive income. And I always point to that example. I'm like, look, only way to get to passive income is you either inherit a bunch of money and you can buy real estate and then it's passive, or you work your butt off for X number of years and you accumulate an asset base and then you're just like getting checks. Nobody buys just like a quote unquote passive business. It's not a thing.\r\n\r\n\r\nKriss Berg (15:39.867)\r\nNo, and the car washes, I'm working, it's probably down to about five hours a week now when we integrate these two new ones.\r\n\r\n\r\nNikolas Hulewsky (15:51.282)\r\nwow.\r\n\r\n\r\nKriss Berg (15:54.937)\r\nthat'll be another five hours a week. So my philosophy is kind of one in, out. So I'm taking on the five hours a week and in the beginning, it'll be closer to 10 to 20 hours a week of these new car washes. So I have to get something else off my plate. So in the other business, I say, okay, I'm not going to do this anymore. Hire an offshore worker or train somebody on the team to do this part of the job for me because I got to go over here and work on this real estate for a little bit. I'm always, I've always making sure that I'm not just adding things to my plate.\r\n\r\n\r\ntaking something out too. That's key to it.\r\n\r\n\r\nNikolas Hulewsky (16:27.182)\r\nDude, okay, I'm so glad I'm talking to you. You are, I think you're 50, right? You just turned 50? Dude, happy birthday. I turn 40 next month. So almost exactly 10 years apart. I don't feel that way. I'm gonna be honest. This is the first birthday. But you're you're dropping some gold nuggets in here because I'm kind of dealing with that thing right now. I'm trying to figure out how do I delegate? How do I make sure that I'm not just putting things on my plate but I'm actually then offloading it.\r\n\r\n\r\nKriss Berg (16:31.466)\r\nJust turned 50 last week. Yeah. You're a baby,\r\n\r\n\r\nKriss Berg (16:54.895)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (16:56.61)\r\nYou're also talking about the car washes, but it sounds like you don't have that many and you're, you're just kind of getting into it. So am I fair to assume that there was a period of time where you were doing entrepreneurship and you weren't necessarily optimizing everything? Like how long have you been doing this, playing this game?\r\n\r\n\r\nKriss Berg (17:08.91)\r\nGo.\r\n\r\n\r\nKriss Berg (17:12.25)\r\n23 years in January, I bought my first business in 2003, January 2003 with an SBA loan. It cost a whopping $180,000. had 50 grand of my own money that I had worked, made working heavy civil construction jobs and got sick of the grind and actually all my bosses went to jail.\r\n\r\n\r\nYeah, I had this, I was working in Alabama on this huge tunneling project and all the bosses were on the take. So they would, they were bid rigging and then they were kickbacking and all this stuff. And I saw the writing on the wall and I left two weeks before the FBI wrecked and came in and seized everything. And so I was 27 and I had, just like,\r\n\r\n\r\nNikolas Hulewsky (17:51.726)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (18:02.007)\r\nGood for you.\r\n\r\n\r\nKriss Berg (18:06.614)\r\nI hate this. I hated working for somebody else. I had zero entrepreneurial instincts. I didn't know what to do. I'd read a bunch of books, but I moved back to Denver at the time and my friend had just bought like a loop shop and he had gotten an SBA loan. He knew the SBA process and he had a similar path. And I was like, yeah, I think I'm to do that. Found an excavation company and I did everything wrong. I mean, I bought the business and two weeks later it was payroll. And I was like, wait, what?\r\n\r\n\r\nNikolas Hulewsky (18:30.286)\r\nHa\r\n\r\n\r\nKriss Berg (18:34.938)\r\nI'm looking at this money in the bank, I'm like, hey, we're doing pretty good. I think I had 15 grand and I think payroll was 18. I was like, wait a minute, I thought this was my money. Baptism by fire, but I grew that. was doing 180 top line, grew it to 2.6, 2.7 million, sold it four years later. I just made all the mistakes though. I was doing everything myself. It was a completely flat organization. We went from three employees to 25.\r\n\r\n\r\nNikolas Hulewsky (18:55.659)\r\nwow.\r\n\r\n\r\nKriss Berg (19:03.768)\r\nand they were all reporting to me essentially. And I was super stressed out and it was basically a home services business. did excavation for plunders.\r\n\r\n\r\nNikolas Hulewsky (19:13.998)\r\nAnd when did you sell?\r\n\r\n\r\nKriss Berg (19:17.602)\r\n2007, which was pure luck. Yeah, yeah. So I sold them September 2000. I think Lehman Brothers happened. Was that on that? I don't know. Was it October that year? Yeah. So everything fell apart. I mean, just pure luck that I sold it. And I did see the writing on the wall. Like a lot of my customers were custom builders. They were like,\r\n\r\n\r\nNikolas Hulewsky (19:19.448)\r\nI was just gonna say, geez, man.\r\n\r\n\r\nNikolas Hulewsky (19:27.726)\r\nOctober.\r\n\r\n\r\nKriss Berg (19:39.578)\r\nYeah, the house used to sit on the market for a month and now it's sitting on that house on the market for six months. And I thought, that's going to hit me in the wallet. So I didn't know. Well, was, it was mostly pure burnout. was at the time 2006, you had, I don't know if you remember this, you had to buy how many minutes you were going to use on your phone a month. Like you had to tell it. that? remember going to the max package. was like 6,000 minutes a month. I was using every minute of that.\r\n\r\n\r\nNikolas Hulewsky (19:48.142)\r\nIs that why you got out or were you just like, I wanna do something else?\r\n\r\n\r\nNikolas Hulewsky (20:00.281)\r\nmy gosh, yeah, yeah, yeah, yeah, yeah.\r\n\r\n\r\nKriss Berg (20:08.141)\r\nand I was putting 50,000 miles on my truck every year. I just drove around and yelled at people on the phone for 12 hours a day. And I knew I was gonna die. I was really, I'm seriously gonna die if I kept doing that. It was so stressful and sold it and completely, literally moved off the grid. We moved to Steamboat Springs. I met my now wife right in that phase.\r\n\r\n\r\nNikolas Hulewsky (20:30.179)\r\nDang.\r\n\r\n\r\nKriss Berg (20:31.435)\r\nAnd she was like, I don't want to live in Denver. And I realized I didn't really either. So we moved into a house that was solar and wind powered and, went just. Complete opposite, right? There was nothing going on. I live in house where I would hear like police helicopters flying overhead. And then we moved off to the grid and it was like, wow, we have to drive an hour for food. So it was,\r\n\r\n\r\nNikolas Hulewsky (20:45.037)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (20:55.094)\r\nYeah, you went from putting 50,000 miles a year on your truck to like five. It used to work.\r\n\r\n\r\nKriss Berg (20:58.827)\r\nYeah, exactly. Yeah, we started, you know, kind of homesteading and that kind of thing. And I had to figure out how to run this house off solar.\r\n\r\n\r\nNikolas Hulewsky (21:06.274)\r\nSo through the Great Recession, you were off the grid.\r\n\r\n\r\nKriss Berg (21:08.727)\r\nWe were off the grid and I moved up there. still was under the impression that I could be a builder. was going to, cause I saw these, these builders and like they were building custom homes and the only person making any money was the developer, right? Like all the, all the contractors were fighting over scraps. And I thought I'll just go up to Steamboat and I'll build a house every year and maybe make a couple hundred thousand bucks and I'll be happy. And that was 2007.\r\n\r\n\r\nThat was the worst possible timing. sold the business for right just under a million. I walked with like, cause I had some debts and stuff, we had to pay off equipment. I walked with like 690 or something, like 650 or something, which was a lot in 2007 was a lot of money. That was a lot. Yeah. Yeah, for first day.\r\n\r\n\r\nNikolas Hulewsky (21:37.678)\r\nWhat did you sell your business for?\r\n\r\n\r\nNikolas Hulewsky (21:53.838)\r\nOkay. Dude, that's what I was gonna say is like, well, and especially for a first exit, that's that still.\r\n\r\n\r\nKriss Berg (22:03.233)\r\nAnd again, no entrepreneurial instincts. had no idea. My parents were both wagees their entire lives. And so we bought a house and thought I was, bought a lot. I was going to build on it.\r\n\r\n\r\nNikolas Hulewsky (22:14.05)\r\nDid you put all the money into the house? Like, did you pay cash for the house?\r\n\r\n\r\nKriss Berg (22:16.697)\r\nWell, no, we got a loan, but it was weird because certain banks wouldn't even loan on it because they're like, oh, you're not connected to the grid. There's no electric meter. can't finance this house. Yeah, what does that have to do with It's still a house, right? Yeah, no, exactly.\r\n\r\n\r\nNikolas Hulewsky (22:27.118)\r\nMakes sense. Makes sense. We can't find it in this house. There's no electric meter. You're like, I don't, what? That's an underwriting criteria.\r\n\r\n\r\nWhat did you do then? Like, okay, because I could see that you go out there, there's no building going on and you weren't entrepreneurial, like you say, but but you have some money.\r\n\r\n\r\nKriss Berg (22:45.749)\r\neverything ground to a halt. I had a little bit of a nest egg, my wife worked, and I picked up a book called The Four Hour Workweek. And that book changed everything for me because all of a sudden you could make money wherever you were. And there was no jobs, there was no business to run a steamboat at the time, everything was in a complete trapper. So\r\n\r\n\r\nNikolas Hulewsky (23:06.669)\r\nYeah.\r\n\r\n\r\nKriss Berg (23:11.033)\r\nThat book so I bought a website after that it happened to be about solar power because I was learning that Really? Well living with it every day Started selling solar kids and stuff like that. And then I had a bunch of Yeah, I had a bunch of health issues at the same time to my digestion probably all related to my stress levels Had a bunch of digestion issues energy and all this stuff and went to doctors they couldn't figure anything out and this is\r\n\r\n\r\nNikolas Hulewsky (23:20.044)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (23:23.852)\r\nReally?\r\n\r\n\r\nKriss Berg (23:38.266)\r\n2008, 2009 is right when Google and social media really is taking off and it's finally, you could get real information from the web. Before that it was really sketchy and unreliable and so, researched all my health issues and started a health business, started selling health supplements. So that was how I transitioned to an e-commerce health business. Long story.\r\n\r\n\r\nNikolas Hulewsky (24:04.169)\r\nand the e-commerce business has been around ever since, what kind of supplements are you selling?\r\n\r\n\r\nKriss Berg (24:07.095)\r\nYep. So we've got CBD stuff. We've got blood sugar stabilizers and we've got pure xanthan is my favorite thing because it's like sunscreen in a pill. Take this stuff and it's an antioxidant. It's great. Yeah, it's what makes salmon pink. So it gives your skin some pigment and it really nukes the antioxidants.\r\n\r\n\r\nNikolas Hulewsky (24:25.688)\r\nsunscreen in a pill?\r\n\r\n\r\nKriss Berg (24:34.381)\r\nthat the sun beams down on you and burns your skin with. So been doing that for 15 years. And this year, actually this weekend, we're launching a telemedicine business. We're going to be prescribing things like semaglutide, is basically ozempic. There's GLP ones are hot. We're going to be prescribing those. TRT, HRT.\r\n\r\n\r\nNikolas Hulewsky (24:49.336)\r\nMm-hmm. GLP-1s.\r\n\r\n\r\nKriss Berg (24:58.105)\r\nThere's a big demand for ivermectin, BPC-157 and all that stuff. So it's a big shift for us into kind of a Western medicine pharmaceutical.\r\n\r\n\r\nNikolas Hulewsky (25:06.35)\r\nDude, that is so funny. I literally just did a podcast, me and Chris, we do one every Friday, and we were talking about what's your favorite business that you would start? And this was mine, it wasn't Med Spa, but I lumped it in with Med Spa, which is this, right? Like hormone replacement therapy, semi-glutide, but effectively being a PCP for people.\r\n\r\n\r\nKriss Berg (25:12.023)\r\nYeah.\r\n\r\n\r\nKriss Berg (25:22.467)\r\nYeah.\r\n\r\n\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (25:31.224)\r\nthey can have access to this stuff because for the most part they don't have access and it's blowing up right now. There's a ton of demand for it and there's a ton of need for it like paramedic pause which is a real thing for women. It's before they hit menopause and they're you everything just starts kind of going crazy and it's under understudied and under under under under understood. That's not a word. I'm a freaking moron. It's under understood. That's a real word. Freaking a dude anyways.\r\n\r\n\r\nKriss Berg (25:37.977)\r\nYeah.\r\n\r\n\r\nKriss Berg (25:43.576)\r\nYes.\r\n\r\n\r\nKriss Berg (25:52.329)\r\nOverunder understood.\r\n\r\n\r\nIt's misunderstood and I was really against the GLPs for a long time. thought it was, I thought they were dangerous. And cause I kind of lived through the nineties. There was a bunch of prescribed medications for weight loss and they all turned out to be horrible. They killed people. And once I started looking into the safety of these things, and then I had three or four friends that they lost.\r\n\r\n\r\nNikolas Hulewsky (26:01.518)\r\nThank you.\r\n\r\n\r\nNikolas Hulewsky (26:05.634)\r\nReally?\r\n\r\n\r\nKriss Berg (26:26.905)\r\nhundreds of pounds, their lives are now, first of all, their lives are much longer because they lost hundreds of pounds. Like they had a very short timeframe. Some of them were in their 50s. They were going to be lucky to live another 10 years. They're probably now looking at another 20, 25 years thanks to GLP-1s. And that really opened my eyes.\r\n\r\n\r\nNikolas Hulewsky (26:46.958)\r\nGood for them, dude.\r\n\r\n\r\nWell, the reason I love these businesses is because, and you saw it with the supplement business, there's a big disconnect between the brainiacs who are like, if we just affect these molecules, know CRISPR gene editing, I know how to do this, and actually getting it in the hands of people who need to use this stuff. And that's where entrepreneurs step in and say, wait a second, you can lose how many pounds? How many years do you life does it add? I could sell this, right? so entrepreneurs come in and they figure out a way to actually get it into the hands of people.\r\n\r\n\r\nKriss Berg (26:55.319)\r\nYeah.\r\n\r\n\r\nKriss Berg (27:01.581)\r\nYes. Yeah.\r\n\r\n\r\nNikolas Hulewsky (27:18.454)\r\nI think the inventor of Ozempic, is it Novo Nordis? I think that's their name. Their stock has kind of been hammered because they weren't able to effectuate the type of distribution they needed that people thought they were going to get because people like you were like, I actually think we could manufacture these off label and have the same outcomes and get it in the hands of people. to me, this health stuff is kind of, if you're interested in it in particular, it's a gateway drug into entrepreneurship because people need it.\r\n\r\n\r\nKriss Berg (27:26.146)\r\nIt has.\r\n\r\n\r\nNikolas Hulewsky (27:47.028)\r\nyou can figure out how to get buyers and sellers together, whether that's through an e-commerce store or whether that's through a platform with physicians who are making writing prescriptions, I just think it's freaking fantastic.\r\n\r\n\r\nKriss Berg (27:57.336)\r\nI totally agree. And after my first business, was basically like digging and laying concrete, which neither one of those have changed in like 150 years. After that, I decided I want to be on the nose cone of the rocket. Like I'm going to be whatever is taking off. That's why we got into CBD and that's why we're getting telemedicine. And I asked Chad to BT like a year ago. was like, you know, what's it, what's going to be the annual growth rate for telemedicine?\r\n\r\n\r\nAnd it was like 26 % annually. And so all these people, especially in our generation, right, that are kind of sick of the doctor thing, right? If you can get an appointment in the next three months, you go in there, it's 10 minutes, you're gone, right? And you don't have time to really talk. And it's frankly, it's embarrassing to talk about if you need Ozampic or if you need some hair growth formula, or if you're really worried about your testosterone levels, like...\r\n\r\n\r\nThat's really hard to do.\r\n\r\n\r\nNikolas Hulewsky (28:54.478)\r\nIt is, I was just talking to somebody about this. Functional medicine is the way that they talk about it. Where typically when we go and see a primary care physician, primary care physicians are fantastic, they're wonderful people, they're good doctors, they're good hearted people, but they're not necessarily looking at it holistically and they're not necessarily collaborating with an interdisciplinary team that is helping you find the right things for you.\r\n\r\n\r\nKriss Berg (28:59.701)\r\nMm-hmm. Yep.\r\n\r\n\r\nKriss Berg (29:17.529)\r\nLet's go.\r\n\r\n\r\nNikolas Hulewsky (29:20.814)\r\nI love these businesses. It's adjacent to what you're doing, but it's not exactly what you're doing. Where I could pay $10,000, $20,000 and I just go get all my blood tests once a year and they do all of my panels. They tell me about my genes. They tell me about, you know, I do a stress test on my heart. We do an MRI, everything. And it, you know, gives me peace of mind. But then I also go talk to a dietician and I talk to a specialist if there's anything that's wrong or geneticists that tells me kind of, hey, these are the best foods for you at this time of day, et cetera. Because we want better\r\n\r\n\r\nKriss Berg (29:33.102)\r\nYes.\r\n\r\n\r\nKriss Berg (29:36.941)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (29:49.743)\r\nrecommendations. We want better access to healthcare. So I freaking love that space that you're getting into.\r\n\r\n\r\nKriss Berg (29:56.184)\r\nYeah. Yeah. And I, I realized that I benefited from testosterone replacement therapy big time. And so I was mixing Western medicine and holistic medicine. And I realized that's what most people need to do. Right. You need some prescriptions, you need some dietary guidelines, you need some supplements, you need some this and that, like to kind of put yourself in one camp or the other is really foolish because they both can benefit you tremendously.\r\n\r\n\r\nNikolas Hulewsky (30:06.339)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (30:20.066)\r\nYeah, definitely. How did you get into, what was your first deal for car washes? So like, you know, you're, you're doing all this other stuff. How the freak were you like, I'm going to go ahead and buy a car wash. You saw Cody Sanchez?\r\n\r\n\r\nKriss Berg (30:30.945)\r\nYeah, well, a little bit. was actually Nick Huber talking about the self-storage stuff. Yeah. And I was like, well, let's look at the storage. And it was so overheated. It still is in a lot of ways that I was like, well, that doesn't make financial sense at all.\r\n\r\n\r\nNikolas Hulewsky (30:37.017)\r\nthat's right. Yeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (30:47.086)\r\nBut why that space? You didn't even know about the tax benefits of it.\r\n\r\n\r\nKriss Berg (30:52.921)\r\nSo that's a great question. We were making money hand over fist during the pandemic because everybody all of sudden was stuck at home and really concerned about their health. And so they were buying supplements and we actually found one of our manufacturers had masks at the time. so we were in May of 2020, we were the only e-comm suppliers in the country who had masks. So we were just shipping them like, you know.\r\n\r\n\r\nNikolas Hulewsky (31:01.443)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (31:08.717)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (31:15.314)\r\nNikolas Hulewsky (31:19.47)\r\n2020 was a good year for the Berg family.\r\n\r\n\r\nKriss Berg (31:21.049)\r\nIt was a really, really good year. so I was looking, starting then in 2021, I was looking, I was just kind of bored. I was like, you know, the e-commerce thing is great. And it just doesn't take a lot of time. It's still only like a 20 hour a week gig for me. And I was just like, I need a little something. I need some juice. Like I was mountain biking a lot and I was snowboarding a lot and I was going to the gym all the time and I was bored. I was like, I need something.\r\n\r\n\r\nNikolas Hulewsky (31:31.32)\r\nHmm.\r\n\r\n\r\nKriss Berg (31:48.28)\r\nto do a little side gig that will make some money. And so the real estate thing popped up and all the guys talking about commercial real estate, it finally clicked for me. This is the breakthrough for me, was I realized that my online business, if I really grew it, really did a good job with it. Like if I sold it, I could probably get a five to eight X multiple.\r\n\r\n\r\nRight? That's probably a really good outcome for an e-commerce business. Most people will be lucky to get two or three X. I was looking at this car wash. I was like, wait a minute, he's getting 10 X for this crappy, I mean, this place is a dump. And I thought that's what shooed me away for the first year. I was like, the hell with that. They don't even know how to value these things. They're crazy. And then I realized, wait a minute, I could go in there and double that business.\r\n\r\n\r\nAnd then it would be 10x that the value on it, it's finally flipped that these multiples work in your favor. If you grow them, if you grow the business, I went, I 10xed, I literally 10xed everything. And I was like, this is way better from a multiple.\r\n\r\n\r\nNikolas Hulewsky (32:52.396)\r\nYou just went full Cardone. You're like, dude, I just got 10x my mindset. If I 10x this 10x.\r\n\r\n\r\nNikolas Hulewsky (33:04.526)\r\nI remember the first time I converted a cap rate valuation to like a multiple where, because a lot of the commercial properties, they're valued off of a cap rate. And so it's like, oh, it's $100,000 a year at a 10 cap. So what $100,000 a year at a 10 cap is 10 % interest, or excuse me, a 10 % expected return. So effectively, you just divide the 100,000 by 10%, and you get a million dollars. And I was like, wait a second, wait a second, a 10 cap is a 10x multiple?\r\n\r\n\r\nKriss Berg (33:09.113)\r\nYes, this is a cap. Yeah.\r\n\r\n\r\nKriss Berg (33:15.565)\r\nYes.\r\n\r\n\r\nYes.\r\n\r\n\r\nKriss Berg (33:25.848)\r\nYes.\r\n\r\n\r\nYes. Right. Yes. Which means a seven cap is like a 15x multiple.\r\n\r\n\r\nNikolas Hulewsky (33:33.388)\r\nAre you freaking kidding me? Wait, wait, and that one down.\r\n\r\n\r\nYes, yes. I'm like these ones down the street. Remember when interest rates were at zero and there was like four caps? They're like, yeah, this, this Dutch Bros is so good. You could get in for a four cap. And you're like, what the freak? This is like a 20x busy like more than 20x. And just insane. So for you, that was like, that was kind of the aha moment.\r\n\r\n\r\nKriss Berg (33:42.797)\r\nYeah. Yeah.\r\n\r\n\r\nKriss Berg (33:53.689)\r\n20X, yes. That was the breakthrough. I thought these real estate guys were, they were nuts. You're getting 6 % on your money. What are you doing? You're an idiot. And then I realized, oh, wait a minute. If you go in, you optimize the customer experience, you improve the customer experience, you improve the signage, you improve the Google ratings. A lot of these places, can double, double the income, double the, uh,\r\n\r\n\r\nNikolas Hulewsky (34:04.319)\r\nYeah.\r\n\r\n\r\nKriss Berg (34:22.541)\r\nwhich is called the NOI, which is the profit for real estate based business. And when you do that and multiply it by the cap rate, the numbers get really big, really fast. And it's funny because my car wash will do in a year what my e-comm business will do in a month, but the car washes are actually probably worth more because it's real estate. And it makes no sense to somebody who's just breaking into this, but again, this is the flywheel.\r\n\r\n\r\nNikolas Hulewsky (34:44.59)\r\nMmm.\r\n\r\n\r\nKriss Berg (34:51.577)\r\nThis is what exploded my net worth, because all of a sudden I had this $400,000 tax liability. All of sudden that's going straight into assets, and those assets are compounding like crazy, and it's huge breakthrough.\r\n\r\n\r\nNikolas Hulewsky (35:04.461)\r\nOkay, so if you were trying to, I need to figure out how I'm gonna get the rest of this jam packed. If you were starting over again, I love this strategy, but like the real estate piece kind of, from my perspective, this might be a dumb perspective, it seems like it only comes into play once I'm making money on something else. And then it's like, okay, then I funneled into the real estate and it goes back. So how would you, you're starting over, you're 27 year old Chris again, what would you do? Like what would you get into right now?\r\n\r\n\r\nKriss Berg (35:09.827)\r\nYeah. Yeah.\r\n\r\n\r\nKriss Berg (35:23.117)\r\nYeah. Yeah.\r\n\r\n\r\nKriss Berg (35:29.029)\r\nYeah. Yep. That is a great question. So it depends if you have a little coin and I did at the time, I saved some up and I think most of your listeners probably have a little bit of a nest egg. And I think it's a great idea to buy a business that's got some really good upside. You want it to be\r\n\r\n\r\na little bit neglected, you want it to be a little old systems, the kind of the cliche of it's run on a fax machine or whatever is pretty appropriate because you can find these businesses. I don't love home service, but I think if that was your best option, that was kind of the best way to break in. I think it's a great way to start. And I would look to build it up, try to double, triple the business and sell it.\r\n\r\n\r\nin four or five years because it's it's a grind. It's a huge.\r\n\r\n\r\nNikolas Hulewsky (36:19.606)\r\nYeah. It is a grind. I love that description. But you just described like, what was that? What were those teen movies? 10 things I hate about you or whatever else. The girl who's like ugly because she has glasses on and dresses frumpy and then all of sudden she comes down the stairs. She has no glasses and her clothes are better. my goodness. Yeah, but that's what you want in a business is like.\r\n\r\n\r\nKriss Berg (36:35.468)\r\nYes.\r\n\r\n\r\nit's gorgeous. Yeah.\r\n\r\n\r\nThat's what you want. And yeah, now, now if you're, if you're really starting out from zero and you have nothing, um, there's a great follow. He's actually in my town and I'm mentoring him. His name is Jared Hardin and he's the guy who's doing parking lot striping. You've probably seen him on Twitter and he is, he's got a little bit of capital, but he noticed a gap that almost nobody in our county was doing it.\r\n\r\n\r\nNikolas Hulewsky (36:45.706)\r\nsome some little changes. I'm not trying to get a bunch of plastic surgery. I can't afford all that money.\r\n\r\n\r\nNikolas Hulewsky (37:05.986)\r\nMm-hmm.\r\n\r\n\r\nKriss Berg (37:14.572)\r\nThe guys who did had like two Google ratings. They never answered their phone. And so he's found something like that. There's, there's little things like that. And if, like, if you were in college and you're like, got Chris, I got nothing. I would actually, I love the home service for seniors. A lot of seniors want sort of the new tech stuff that's supposedly really easy to install nest simply say.\r\n\r\n\r\nNikolas Hulewsky (37:18.094)\r\nMm.\r\n\r\n\r\nKriss Berg (37:44.296)\r\nring doorbells. There's a ton of people who want that stuff and like that, but actually are scared to death of it. And if you're a college kid, you buy a hundred dollars worth of tools at Home Depot and watch a couple of YouTube videos. can install all that stuff, right?\r\n\r\n\r\nNikolas Hulewsky (37:57.998)\r\nWell, watch couple of YouTube videos and have chat GPT and all of a sudden you're the whole IT team. Like you're gonna figure it out.\r\n\r\n\r\nKriss Berg (38:01.56)\r\nYou're in business, right? And then you help them install the app on their phone and you charge them 250 to do it all.\r\n\r\n\r\nNikolas Hulewsky (38:09.592)\r\nDid I, I love the parking lot striping business. I also love, have you seen the stump grinders on Twitter? Bro, so Chris and I did a podcast a year ago, it last July. And cause we have a tree trimming business and we were like, Hey, we think, yeah, we think a really cool business to start would be contacting tree trimming companies and just saying, Hey, I'll remove your stumps for you. And it's like, and then we laid out the business case for it. And so Tyler Mumford, who was kind of the first one he went out, he freaking did it. He did.\r\n\r\n\r\nKriss Berg (38:12.898)\r\nYeah.\r\n\r\n\r\nYeah. Stump grinding.\r\n\r\n\r\nKriss Berg (38:22.968)\r\nYeah, I remember this. I remember this.\r\n\r\n\r\nKriss Berg (38:33.538)\r\nRight.\r\n\r\n\r\nYeah, you did it.\r\n\r\n\r\nNikolas Hulewsky (38:38.178)\r\nHe did over $250,000 in his first year. just closed his first year and others like 10. It's just him. Yeah, it's just him. And now there's like 10 other stump guys, but now that's a hard business to scale. Okay. I'm not going to pretend like, you could be a $10 billion company. No, no, that's a hard business to scale. to get into entrepreneurship and just start like generating some cash and building the entrepreneurial muscle, dude, just like the striping business, like that. Those are just great businesses I can get into as a solopreneur low downside risk.\r\n\r\n\r\nKriss Berg (38:40.864)\r\nIt's just him,\r\n\r\n\r\nKriss Berg (38:59.415)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (39:07.63)\r\npretty low cap. I don't have to buy the machine. can finance it. Like it's, it's, it's not crazy to get into. So that's kind where you would focus if, you were to start over and then.\r\n\r\n\r\nKriss Berg (39:15.064)\r\nAnd you nailed it on the head is stop hammering on scalability on your especially on your first business You need something because if it was scalable Private equity and all the bad ass entrepreneurs in your town would have already done it, right? You need to go fill in those gaps that aren't scalable. They're gonna take some some sweat blood sweat and tears fill those gaps make a couple hundred grand quit your w-2 and then you then you level up\r\n\r\n\r\nNikolas Hulewsky (39:27.395)\r\nYeah.\r\n\r\n\r\nKriss Berg (39:44.653)\r\nthen you can get into something and most people after that, they just start their businesses, right? Maybe they're buying it. Some people are doing roll-ups and stuff like that. But now I don't need to really buy any more businesses. We bought a little bolt-on for this telemedicine thing, but now for the most part, we can just start what we need to do. We have a little bit of capital, we got a lot of experience. And I look at a business say, this is, wow, this is five million bucks. I could start it for 50. And in five years, I'll be at five million bucks.\r\n\r\n\r\nI don't need a bank for that, you know. So that's gonna be my journey.\r\n\r\n\r\nNikolas Hulewsky (40:14.432)\r\nYeah, yeah, I've talked. I've talked to a couple of people recently who were looking at they were telling me they're like I want to do a roll up. I'm like, OK, what? Tell me about your first deal. Well, we're looking at this deal and it does. It's like $500,000 a year in EBITDA and you know, we've got like a decent leadership team and and I think that's going to be our first deal. And I was like, that's the dumbest thing I've ever heard because.\r\n\r\n\r\nKriss Berg (40:23.798)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (40:40.896)\r\nIf you're going to do a roll up, your first deal needs to be a platform level deal. And at $500,000 in EBITDA, the CEO is the owner. So you're going to have to step in there. Like you don't have a bench. You don't have systems that you can replicate. You don't have processes. have, you have nothing. Like if you're going to do your every single day. And, and that's what I feel like people have kind of, I don't know, denigrated. It's okay to be in the knife fight, dude.\r\n\r\n\r\nKriss Berg (40:44.888)\r\nYeah.\r\n\r\n\r\nKriss Berg (40:49.069)\r\nYeah.\r\n\r\n\r\nKriss Berg (40:56.6)\r\nYou're going to be in the fight every day. You're going to be in the business.\r\n\r\n\r\nNikolas Hulewsky (41:07.948)\r\nIf you're getting into entrepreneurship, you should be in the knife fight. You need to understand how the business works. You're not just going to come in and be like, yeah, I want to hire an operator. Like that's the dumbest thing. You're not going to be successful.\r\n\r\n\r\nKriss Berg (41:17.804)\r\nyou are going to buy a job. you buy a business, unless you have millions and millions of dollars, and if that's the case, you're probably never gonna buy a business because you're be under that golden roof. Yeah, yeah. But yeah, you're going to buy a job. The whole idea is that you buy a job and you scale it and you get it to where you're handing off. You're leveling everybody up, right? I was doing the knife fight. I was answering the phone every day.\r\n\r\n\r\nNikolas Hulewsky (41:23.842)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (41:27.822)\r\nJust buy commercial real estate.\r\n\r\n\r\nKriss Berg (41:46.455)\r\nNow I got somebody answering the phone. I was doing the invoicing every day. So you're building up and you're delegating and you're taking stuff off your plate. That's going to be your job for the first four five years in your first business. If you can do that, you're going to scale a really nice business. It's okay. Yeah. You're really, really rich doing that. It's going to take time. That's what I tell young entrepreneurs all the time.\r\n\r\n\r\nNikolas Hulewsky (42:02.318)\r\nand that's okay. And like, you should be okay. Like that's good. It's okay to work in the business.\r\n\r\n\r\nKriss Berg (42:13.592)\r\nis you're going to achieve your dreams, you're gonna be really rich, you're gonna have all the stuff you want, all this freedom you want, it's gonna be way harder than you think it would be, and it's gonna take way longer than you think it will. You just internalize those two things, you're gonna get there.\r\n\r\n\r\nNikolas Hulewsky (42:22.69)\r\nHa\r\n\r\n\r\nNikolas Hulewsky (42:29.966)\r\nOkay, I have a question for you because I've been thinking about this a lot People think that growth especially when it comes to wealth looks like this right like this trajectory and more and more I feel like success especially in entrepreneurship actually kind of looks like this and then and then all of a sudden you wake up one day and you're like I have a million dollars in my checking account like when did When did that happen? Like you just it's because it's compounding like we were talking about your\r\n\r\n\r\nKriss Berg (42:38.38)\r\nYeah.\r\n\r\n\r\nKriss Berg (42:51.318)\r\nYeah. Yeah.\r\n\r\n\r\nKriss Berg (42:57.243)\r\nThat's exactly right. And if you zoom in on that little flat part that you were talking about, it's actually like this. The scale is so small, you don't see that part. But yeah, mean, my whole income and that would take a huge hit through 2007 through 2011. It really took me to get back on my feet. it was kind of like a little bit of retirement because I was so, I had a nest egg, but.\r\n\r\n\r\nNikolas Hulewsky (43:02.006)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (43:16.034)\r\nReally?\r\n\r\n\r\nKriss Berg (43:22.38)\r\nYou know, the online thing, it was okay, but it was small and I snowboarded a lot. got really good at snowboarding and mountain biking, you know, that stuff. And I really took some time off to figure out what I wanted to do, but I didn't have great income. I didn't have great net worth and all that stuff. So it was a, by most people's standards, that was a down, those were down years, but I, they're some of the most rewarding for me because.\r\n\r\n\r\nNikolas Hulewsky (43:49.731)\r\nYeah.\r\n\r\n\r\nKriss Berg (43:50.713)\r\nI got a lot of time with my wife. We got to travel. We got to live off the grid and really just sort of connect with nature and all this stuff. So yeah, I just feel like now I'm reaching that inflection point, the kind of the hockey stick thing. Like just now, I'm 50, right? I've been doing this 23 years. I feel like now things are finally taking off. All my businesses are kicking ass. They don't take a lot of my time.\r\n\r\n\r\nI make decisions easily. know what to say no to, which is a huge part of what people have to figure out is when they know I say no very quickly. Now I know exactly what I want out of my career.\r\n\r\n\r\nNikolas Hulewsky (44:29.294)\r\nDude, you're making me feel so much better about myself right now. I'm turning 40 next month and it's just, just, for whatever reason, no other birthday has ever stressed me out. And this one, I'm like, yeah, I just, I'm like.\r\n\r\n\r\nKriss Berg (44:31.96)\r\nHahaha\r\n\r\n\r\nKriss Berg (44:40.077)\r\nReally.\r\n\r\n\r\nSo how's it hit you? What keeps you up?\r\n\r\n\r\nNikolas Hulewsky (44:45.454)\r\nI think the things that keep me up are my kids are, man, I'm gonna get emotional. They're just growing so fast, man. 11, eight, five, and three. And I don't wanna miss any years. I'm like, man, I blinked and I'm 40. I'm gonna blink and be 50 and they're gonna be out of the house. So that's something that keeps me up. I've also been struggling with this thing of feeling like, well, you're 40, you are who you are.\r\n\r\n\r\nKriss Berg (44:55.704)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (45:13.25)\r\nYou've got your weaknesses and you suck at them. And you know what I mean? And I just, I'm like, man, I thought I, thought I would have been better at this or I would have overcome this challenge. And like, why am I still struggling with X, and Z? So for me that kind of those two things have really been what I've\r\n\r\n\r\nKriss Berg (45:17.345)\r\nYeah.\r\n\r\n\r\nKriss Berg (45:20.694)\r\nRight.\r\n\r\n\r\nKriss Berg (45:28.908)\r\nYeah, I can tell you right now, I can just tell you, we don't know each other that well, but I can just tell you from what you're doing, this podcast, your online presence, you are gonna grow more than you ever thought. Your 40s, I think, me anyway, were when I really blossomed. At 40, I was in bad shape physically, I was not in a great place mentally, and now I feel like...\r\n\r\n\r\nNikolas Hulewsky (45:40.984)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (45:44.535)\r\nWell.\r\n\r\n\r\nKriss Berg (45:56.043)\r\nman, I feel like maybe this is the halfway mark of my life. I mean, I might live just 20 more years, but how I feel right now, how my career is going, what kind of father I am and husband, I'm just now hitting my stride. So everything's going to change. You're going to keep growing. You're going to figure out how to prioritize your family and your kids. And again, that saying no thing, right? If...\r\n\r\n\r\nNikolas Hulewsky (46:05.944)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (46:20.92)\r\nYeah, what was the biggest change for you? Like what was the biggest unlock for you? If you could like, okay, it's cool that you had the tax wealth building, like that's cool. But in terms of like, before you could even get there, you kind of had to unlock yourself, like you were talking about. Was it spending time? Was it learning to say no? Was it delegation? Was it like what?\r\n\r\n\r\nKriss Berg (46:28.63)\r\nYeah. Yeah.\r\n\r\n\r\nKriss Berg (46:39.422)\r\nIt was all of that, getting everything off my plate that I hated and having the, cause you got to have some income to do that, right? You can't just, and when you're starting out, you can't just hire everybody. Like you said, you can't just hire an operator.\r\n\r\n\r\nNikolas Hulewsky (46:49.452)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (46:54.872)\r\nWell, so I literally, was having, I actually might cut this part cause I don't know how my wife would feel. We were talking, she was upset with me because I forgot something and she goes, and she goes, how the freak did you not remember this? You have three assistants. And I was like, well, they're not assistants. They do this and they do this and they do this. And she's like, okay, you need that many people. You're that important. And so it was a thing, but I'm trying to get to the place as well where I'm like,\r\n\r\n\r\nKriss Berg (47:18.422)\r\nRight.\r\n\r\n\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (47:24.662)\r\nIf I have the money to hire them, I should outsource everything that I hate so that I can focus on the things that I am uniquely good at. And I'm trying to get better at that. But I think I'm sucking at the setting of expectations once I hire those people. So it's like, cool, I found them. I've hired them. But I don't know that I set them up for success. Like, how did you do that piece?\r\n\r\n\r\nKriss Berg (47:28.802)\r\nYes.\r\n\r\n\r\nKriss Berg (47:38.518)\r\nMm.\r\n\r\n\r\nRight. Right.\r\n\r\n\r\nKriss Berg (47:49.337)\r\nI think you've got to kind of tell them what you're trying to accomplish, right? Like, what is the end state? I want to be done at 4.30 every day. I don't want any messages coming in. I don't want to hear a Slack message. And this happens every once in a while, but with those types of people, tell them and empower them with decision-making, right? Because so often they're like, what do want to do about this?\r\n\r\n\r\nNikolas Hulewsky (47:55.0)\r\nlike end state.\r\n\r\n\r\nKriss Berg (48:18.456)\r\nLike what's the answer here? Tell them if the end state is I just, I need less stress, I need less email, less communication, you are a fence for this stuff. Here's the decision, here's the general outline of how I wanna work and this takes time. They just have to figure out how to work with you. And then let go and then let them do it. And often.\r\n\r\n\r\nNikolas Hulewsky (48:43.308)\r\nand don't hop in five times like I do.\r\n\r\n\r\nKriss Berg (48:44.952)\r\nDon't hop in, don't get involved. lot of times, so the first time I ever really experienced with this, I had this construction company and I decided I needed a vacation. I went to Belize and I did all this research and this is like 2005, cell phones are very weird back then. I did all this research and I bought this international package so I could take calls in Belize. And so I paid like $150 so that my phone would work. I got there and it didn't work once. It was a brick. It was a total brick.\r\n\r\n\r\nAnd I was totally stressed out for the first two days. by day three, was like, screw it. There's literally nothing I could do. I'm not going back. I put the phone in the bag, I turned it off and everything was fine. I got back. I just assumed it would be this fire, you know, that, that gif where the guy walks in with the pizza and the, it was literally on fire. And I got to the meeting Monday morning. I'm like, guys, is it okay? And they were like, yeah, of course. Fine.\r\n\r\n\r\nNikolas Hulewsky (49:22.776)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (49:33.826)\r\nYeah.\r\n\r\n\r\nKriss Berg (49:44.684)\r\nWhat, what do you think we're a bunch of idiots? Like, of course we can handle it. I realized that they wanted to be empowered, that they wanted to be trusted. And they wanted me to get the hell out of the way. That was the, that was the biggest breakthrough is get out. They loved it when I was gone because they could, finally felt like they owned their own job. before I was meddling, right. I was, I was showing up on the job and say, do it this way, do it this way. They didn't want to do it. So.\r\n\r\n\r\nNikolas Hulewsky (50:08.728)\r\nYeah, yeah, yeah.\r\n\r\n\r\nKriss Berg (50:11.192)\r\nLetting go is big part of it. It's a huge thing for me, Nick. Air gapping my day, which means about 4.30, I put on the headphones, I put on some binaural beats, and I just do this 10, 15 minute wind down. I literally lay on the floor. I have a pillow in my office over here, lay on the floor, and I just zone out. And for the first seven minutes, it's the monkey, right? It's the grind. I should have done this today.\r\n\r\n\r\nI gotta do this. And I refuse to let myself write anything down. I don't play with the to-do list. I just say, if it's important, it'll come back. Call it a meditation, call it whatever you want. But at the 15 minute mark, I am totally zenned out and I go upstairs and I'm present with my family. And I'm not, the monkey mind isn't thinking about, I should start a stump grinding business.\r\n\r\n\r\nNikolas Hulewsky (51:10.062)\r\nlong you've been doing that.\r\n\r\n\r\nKriss Berg (51:11.864)\r\nThis has been a couple years now and that helps.\r\n\r\n\r\nNikolas Hulewsky (51:14.956)\r\nI'm, I'm, dude, I'm, I'm committing to you. I'm going to try it. I'm really, I'm really going to try it.\r\n\r\n\r\nKriss Berg (51:20.472)\r\nTry it. Find some music or something, anything. YouTube's got a million free options. You don't need an app. Just find something that'll kind of zone you. It could be like the Enya kind of massage music or something. Nothing with lyrics, but just do that, zone out. And then, course, biggest thing is don't get trapped in your phone for the next two hours, right? Put it on silent, put it away, go hang out with the kids.\r\n\r\n\r\nNikolas Hulewsky (51:33.132)\r\nYeah, yeah, yeah.\r\n\r\n\r\nKriss Berg (51:50.134)\r\nAnd that'll check all those boxes like you don't want to miss their youth, right? Give them two hours a day uninterrupted. And then you'll come back more refreshed for your business, right? Then you're raring to go because you haven't been thinking about it all night. You wake up in the morning, you're like, boom, let's hit it.\r\n\r\n\r\nNikolas Hulewsky (52:09.943)\r\nDude.\r\n\r\n\r\nChris, I'm serious, this has probably been, I've done 230 of these now. This might be, I don't wanna say the best, because I'm a prisoner of the moment, but probably the top three conversations that I've had and like walking away from this, I'm more energized than when I came in. just thank you. This is freaking amazing conversation. Where can people come find you?\r\n\r\n\r\nKriss Berg (52:18.37)\r\nReally? That's impressive,\r\n\r\n\r\nKriss Berg (52:24.065)\r\nRight.\r\n\r\n\r\nKriss Berg (52:27.532)\r\nThat's awesome, Thank you.\r\n\r\n\r\nKriss Berg (52:33.176)\r\nThanks, Jim. Thank you.\r\n\r\n\r\nKriss Berg (52:38.284)\r\nGo find me on Twitter, Chrisberg tweets. It's K-R-I-S-S-B-E-R-G tweets. If the health stuff struck a chord with you, go to healthyliving.clinic. Otherwise, let's connect on Twitter. Let's hang. I love that platform. It's changed my life and I love inspiring people to do what I do. So come connect and I'd love to talk to you guys. And I love what you're doing, Nick. This podcast is awesome. You are a great interviewer.\r\n\r\n\r\nNikolas Hulewsky (53:04.846)\r\nThank you.\r\n\r\n\r\nKriss Berg (53:06.014)\r\nand keep going, because this is what you and Chris, I love your stuff, I love following you guys and I love the pods and it's really powerful dude. You're helping people a lot more than you know. You probably don't hear as much as you should, but it's incredibly inspiring and you should be really proud.\r\n\r\n\r\nNikolas Hulewsky (53:23.924)\r\nI that. Thank you. I thank you.",
  "metadata": {
    "duration": "",
    "date": "2025-09-01",
    "platform_source": "Google Drive"
  }
}