{
  "episode_number": "29",
  "episode_title": "How to Cut Your Offering, Triple Your Prices & Thrive with Dave Kline",
  "guest_name": "Dave Kline",
  "business_name": "Management Accelerator",
  "transcript": "﻿we removed content, tripled the price, and everybody thought it was  more valuable. How is this possible? \r\n\r\n\r\nHey, what's up guys. And welcome back to another episode of Nickonomics, the show for curious entrepreneurs and wantpreneurs that want to understand how other businesses work. And the startup stories that got them to where they are today.  Have you ever fantasized about starting your own business, waking up one morning and having enough revenue generating in order to support you?\r\n\r\n\r\nWell, that literally happened to our interviewee today, Dave Klein. He wrote a viral post in 2020 and he woke up the next morning with 150 customers in his pipeline. Thank you, Dave. With about 375, 000 of committed revenue.  And with that, he launched his management accelerator. And since then he's trained over a thousand managers, generated millions of dollars in revenue for his business and improved on average, the net promoter score of his graduates from 68 to 81.\r\n\r\n\r\nAnd in this episode, you'll hear how Dave went from a consultant at PWC to leadership roles at Moody and Bridgewater associates to actually launching his management accelerator and creating the life that he's always dreamed of.  And if you enjoy this episode, I have a simple ask, will you please leave us a review or five star writer review on Apple or Spotify?\r\n\r\n\r\nIt really helps us understand how we're doing and also improves reach. But with that, let's hop into the show.  All right, Dave, welcome to the cage.  Thanks for having me, Nick.  I've never said that before. I don't know why I said that. I just, it felt right.  Let me out.  I'm super excited to have you have been following you for a while on Twitter.\r\n\r\n\r\nI just think you put out really interesting and thoughtful content, but let's start at the beginning  briefly and it's simplest terms. What's your business and how do you make money?  Simplest terms. We train managers.  Train managers, train leaders,  a variety of different vehicles that could be one to one coaching that could be going in house and running our management accelerator program with one company.\r\n\r\n\r\nIt can be a public version of that program where 50, 60, 70 managers come from different companies and train them in that way. But at the end of the day, we're trying to gift people the skills that allow them to be On the right side of the poor odds that managers face  already 30 seconds into this.\r\n\r\n\r\nI'm so excited. A million questions, rapid firing through my head. Okay. So what's your background? How did you get into that?  So I was an engineer by training and I engineered literally zero things ever in my life. I graduated in 99 from undergrad. So that was. This part of the. com boom. So if you could turn a computer on, you could get a job in either a startup or consulting.\r\n\r\n\r\nI went consulting. So, I went from consulting to, I spent 10 years at Moody's, a fortune 500 company did a lot of tech product strategy, product management, and marketing. Then I moved to 10 years at Bridgewater Associates, the world's largest hedge fund. And again, we had a bit of a manager rotational program. So I.\r\n\r\n\r\nIt was a COO of a couple of departments. I led a couple of departments, everything from operations to talent management to executive development and succession.  And so I've pretty much done everything but sales over the course of those 20 years. And you're glossing over this stuff like really quickly, but I've worked, I've worked in corporate America. \r\n\r\n\r\nFirst of all, to make a transition from engineer to consulting, where did you start consulting?  It was the part of PwC before they sold it to IBM. PwC Consulting is, is, I mean, it's a top tier consulting company. That is a jump. But then to go to Moody's and then to work your way up at Bridgewater into this leadership development position, right?\r\n\r\n\r\nLike one of the most important positions because you're training future leaders within those companies.  How did that happen? Go from engineer to corporate development. Is it like, that's a jump.  Yeah, I don't know. It's like one of those looking back. It doesn't feel each piece sort of felt  appropriate.\r\n\r\n\r\nLike I, as an engineer, I wasn't the one you had doing the math. I was the one you had presenting. So that translating into consulting made sense. And then within consulting, I wasn't the most technical consultant.  So they had me quickly team leading and managing people. So within 18 months of being in the workforce, I was already managing.\r\n\r\n\r\nI think it is,  I don't know. I sort of put it back into like, I like to lead. I am a patient developer of people I connect in, in pretty good ways. And so that started very early. So I was a manager really the entire time. And  I think there's different costumes you can wear as a manager. The one that feels most authentic to me is that of a coach.\r\n\r\n\r\nYou know, helping people be better, helping people find their own path. I was never super directive. I wouldn't have said I was like a great visionary, but that's that has been my superpower. And it took me a while to sort of realize that you could make a living using gesture superpower. And so it was more of a side.\r\n\r\n\r\nProduct of what I was doing, then the focus, and then over the last two years,  I think we've gotten to that place where they say, when you, if work feels like play, you don't work a day in your life. Like, I feel like I'm finally doing that.  Well, it's interesting you say that. So my background was in corporate healthcare, worked for many different companies, and I just had different opportunities. \r\n\r\n\r\nAnd I've always felt lucky. I know it was 99 percent luck,  but I found myself in similar situations where like training hundreds of administrators and I worked in home health hospice, but I love teaching and coaching. And even when I moved up into regional positions or president positions, I still was managing managers or, you know, leading leaders.\r\n\r\n\r\nAnd that's a Even that's a different skill set than leading frontline employees. And it wasn't until a few years ago that I realized, Oh, that's a skill set.  Like I know I don't, I'm no, I'm not an engineer and I can't build things or I can't code or I'm not a plumber or an electrician, but I can get people on the same page and I can get people rowing in the same direction and understanding what the vision is like. \r\n\r\n\r\nAnyways, I think that's an underappreciated part of leadership is that there is a skill set that you need that is both innate and developed over time. And it sounds like you've sort of found that niche and then followed it through the corporate ladder all the way up to Bridgewater. How did you make the leap into actually buying a business or starting a business or did you just go out on your own? \r\n\r\n\r\nWell, it was buying a business to starting a business. That's actually the progression. So I, like I said, with Bridgewater, we rotated people around. I had been through four or five of the departments and. It's not that big a company. And so the next opportunity for me looked a lot like something I had done before.\r\n\r\n\r\nAnd it just felt like  if I could just keep doing this, but eventually the clock runs out. And so I left at the end of 20. And it's interesting that you and I sort of connected on Twitter. Originally the insight for me was coming from some of the money, Twitter voices in my head, which were, I was waiting and waiting, waiting for the big idea for a business.\r\n\r\n\r\nLike I'll have the big idea and then we'll start a business. It's something my wife and I had always talked about. And so many of the Dick Huber's, the Michael Girdley's, the Cody Sanchez are like, just buy a business. And it finally sort of sunk into me of, well, why am I waiting for the big tada idea? I'm a reasonably good operator.\r\n\r\n\r\nI can select talent and I can do these things. So why don't I just go buy something and get going? And we did, we bought this digital asset. It was an online education review site.  You know, sort of dove in, but I'm like, I don't have an SEO background. I don't have a web design background,  you know, and all of a sudden I look up and I have this business.\r\n\r\n\r\nAnd so I'm learning five or six different domains, which are so exciting at once. And yet at the same time, I think I got luckily, unluckily, I don't know. There's some combination of luck and unluck here. The,  it worked really well for about a year.  So we bought it. We thought we had about a 30 month payback period to break even the business quickly doubled.\r\n\r\n\r\nSo that shortened it to 12 or 15 months. The good news is we sort of got through the payback period before it fell off a cliff as a hundred percent organic search site might do. We're pretty subject to the whims of Google. So, at one point, Google changed positively and we jumped up and then Google changed negatively and they moved Main Street on us.\r\n\r\n\r\nAnd we got there. Kicked off and so  it was a wild ride, but in the course of the down slope, we tried to diversify. And so that's how social media came to be. That's how I took saw Hill blooms course. I started writing and the only thing I was writing about that got any traction was leadership and management. \r\n\r\n\r\nAnd then we sort of had the light bulb moment of, well, we, maybe we should. Try to teach this and we, I wrote one viral thread and woke up, we had a wait list of 150 people for our first course that we hadn't even correct. It was a type form 10 question survey, which now that I've learned more about marketing.\r\n\r\n\r\nI'm like, well, that was dumb. We had so much friction. I probably had a thousand people hit the thing and only 150 complete it. Right? And. Right. But they were highly qualified, super interested in some ways. The friction had bought them in more. So our conversion rate on that first course was really high, but yeah, we sold a thing, we sold out a thing before we, I wrote a slide  and yeah, so it was pretty fun to get started that way.\r\n\r\n\r\nSo the bad business investment has now led to the business where.  What was the education business? That you bought?  It was a website called Skill Scatter. It was honestly just two or 300 listicle reviews of everything from piano lessons to Python courses.  That's interesting. So you didn't even buy a business that was necessarily. \r\n\r\n\r\nYour skill set, the business you have now is like uniquely your skill set, right? Leading leaders or teaching people how to be leaders. It was educational, which like, I love educating. I love it. I love seeing people learn,  but now you've migrated to  your natural skill set.  That's really cool. I guess like where in the timeline of the first business kind of.\r\n\r\n\r\nFalling off and then you finding, Hey, I can actually  start my own company. I don't need to buy  an education business. Do they overlap? Was there like a gap? How did that timeline look? We still own the first business. It's like a, I don't know, it's a bit of a rental property on a, in a very mediocre location and throws off a little bit of cash, but it's not something we focus on.\r\n\r\n\r\nI'd say the.  Sort of the, I think the crossing point was our second cohort. So again, the site did well for the first year, year and a half, and then started to do this in May, I think of 22 was when Google really made a change on us that dramatically hit the site. And we had done  one version of the program.\r\n\r\n\r\nSo we ran a second version and I'm sure you've bumped into him. Again, this was sort of experimenting and learning and we has fallen and fallen in love with Alex Hermosi's first book. Like we were listening to it on a drive. I like consumed it. Then my wife and I were on a drive. I'm like, we got to listen to this again.\r\n\r\n\r\nLike, there's just. Is it a hundred million dollar leads?  Yeah. And. You know, there's a whole equation of like dream outcomes and probability of success over time and costs. And then the piece that stuck with us is his real push on raise your prices, price connects to value. And when we ran our first cohort, I think we were 750 for a seat.\r\n\r\n\r\nAnd  I was like, I think we should raise it to 2000.  And we were like, cause we were looking at, in the world and the feedback we had gotten was super strong. Even people, the one that made me sort of have the spark with someone was like, I took this Harvard executive course and this was way more useful.\r\n\r\n\r\nAnd I'm like, wait a minute, what? Wait a second. Right. And I'm like, well, that's so I'm like, well, what does Harvard charge for their like management course? And it's like seven, eight, 10 grand. Some versions of it are 30. And I'm like, well, what's the worst that happens? Let's try 2000.  What's the worst that happens?\r\n\r\n\r\nWe get. If we get one third as many people, we'll make the same amount of money as the first cohort.  And so we did it and we sold it out again. And the only two, the only change we made is we removed content because the other piece of feedback we got was it was too much too fast. It was like two nutrient dense.\r\n\r\n\r\nI had to go back and re listen to the tape.  So I'm like, okay, we'll take a little bit out. Like what stuff do we think is not critical? So we remove content,  same exact course, triple the price. Basically our NPS went from 68 to 81. Will you define NPS? The net promoter score. So the people who say I would recommend this versus minus the people who say I would definitely not recommend this.\r\n\r\n\r\nAnd, but really the net promoters are the nines and tens. And so we, four out of five people said that they would recommend it. It's amazing.  On the higher price. And we ask a second question, which is if you apply what you learned, how much value did we create? The first group. At  750 said five X on average.\r\n\r\n\r\nSo they said, Oh, this is worth, or maybe they said, sorry, they said seven X. So they, it was about worth 5, 000. The second group said 23 X.  Wow. On the higher number. So now they were saying this was worth 65, 000. And it was one of those entrepreneurial moments where you're like, wait a minute.  So we removed content, tripled the price and everybody thought it was more valuable.\r\n\r\n\r\nHow is this possible?  But I think what ends up happening is they had more skin in the game. So attendance had gone up. Commitment had gone up. Engagement had gone up. That thing created a virtuous cycle with everybody else in the room. So the energy was higher. The interaction was greater. The caliber of the people who are willing to bet 2, 000 on themselves or ask their company to do it.\r\n\r\n\r\nAnd that, I think that was really the inflection point too, where.  Instead of trying to save this business that was doing this, all of a sudden we saw that, wow, we could really impact people. We could have this change. We could have a really viable business. I mean, at now, I mean, we're now 2, 500 a seat. It's just not that many people that have a meaningful business. \r\n\r\n\r\nYeah. And I went to Capitol camp a couple of weeks ago and the tickets for that are 13, 000. And it's like, you go to Capitol camp,  I can almost guarantee you anybody who came back from that was like, Oh, it was amazing. It was great. There's a component to it of, I spent this much money, so I want to get my value out of it.\r\n\r\n\r\nSo do you go out of your way to network with that person you may not have spoken to previously or to engage with the speakers or take notes or really be thoughtful about your, even your approach to coming to the conference. So it's a very interesting effect where even charging more gets people to buy in even more, which obviously that improves.\r\n\r\n\r\nTheir experience and the outcome, what, so your cohort based,  how does it work? All right. So  I'm like, Dave, teach me how to be a leader. What does the cohort look like? You put us into pods of five to 10, or are we all just 50 people in a group and we meet once a week, what What does the curriculum and timeline look like?\r\n\r\n\r\nYeah, it's a mix. Our core program that we've run, you know, 2025 times, it's eight sessions. They're 90 minutes a piece over the course of a month. In 90 minutes, that's frequent.  It's twice a week.  It's like a college course, right? We try to do it once a week for eight weeks. People start to wane. We've tried to go faster and it's just a little bit too much, too fast.\r\n\r\n\r\nLike we're again, the art and craft of leadership is a pretty big topic. And so you just bring people really fast. We've tried that, that brought a curriculum in both models. We find the month works pretty well of keeping them interested, but giving them some time to metabolize. How long have you had this? \r\n\r\n\r\nUh, two years. Okay. So this is two years worth of iteration to get to the spot where you're at. I mean, we teach feedback and then we really ask for it in return and we take action on it. So originally the sessions were 60 minutes. We moved them to 90. We had put an optional Q and a at the end because people wanted to hang around and do more smaller group use case stuff.\r\n\r\n\r\nWe had one on one coaching as a bonus and a surprise.  We then move that into the main offer. You know, we've changed some of the content along the way. So it's iterated into this thing, but we do also go from big groups to small groups. So we will, we'll be doing more of a lecture. We talk about it as we want it to be a dinner party, right?\r\n\r\n\r\nWe want to feel like you can come off mute and ask a question. You can interrupt, you can fight with me. Like, I'm totally cool. If you think what I'm saying is crazy. Cause that's when a lot of people will learn the most, but we also break people into small groups. They, they learn the most when they think you're crazy.\r\n\r\n\r\nIs that when someone takes the counter? No, no, no. I've yeah. Yeah. I mean, well, then they'd be learning a lot. If that was the criteria, have you ever read the book, the advantage I'm assuming you have just cause you're. I haven't. No. Okay. So Patrick Lencioni, the table group, you heard about any of his stuff.\r\n\r\n\r\nI have five dysfunctions for sure, but not. Okay. Five dysfunctions. Yeah. Five dysfunctions is a good thing. So Patrick Lencioni, the majority of his books are written as fables. So there's like three signs of a miserable job, five dysfunctions at a team. But then the advantage is like his. One of his few textbooks where he kind of codifies all of his ideas.\r\n\r\n\r\nAnd he has this pyramid where he talks about the base of the pyramid is trust.  And then once you have trust with the team, you can have what's next conflict because conflict in the absence of trust, just, it just leads to animosity between team members. Right. And then once you have conflict, you can have commitment.\r\n\r\n\r\nAnd once you have commitment, you can have. Accountability and then once you have accountability, you have results, right? So results is at the top of his pyramid and then it's followed by all those things. But I think what's interesting is talking to you for 30 seconds. It's like, Oh, I trust Dave. Dave has my best interest at heart, right?\r\n\r\n\r\nAnd so it facilitates this feeling where people can chime in and say, I don't know if I agree with that point, Dave. And then it makes other people feel comfortable.  Yeah. Dave, that was stupid.  I don't know. They don't say it was stupid. Like that's important. Fine. I was, I was, I was trained to resist that with my 10 years of, like, that's, that's Tuesday morning.\r\n\r\n\r\nI just find that the conflict is such an important part of learning. And I love that part because if you can get past wondering, why is Dave asking that question? It's because he thinks I'm an idiot and realizing like, Oh, Dave's asking that question. Cause he's trying to get to the right answer. It just leads to so much more discovery.\r\n\r\n\r\nI, I, it's a beautiful way for you to kind of frame. I think why people get so much out of your courses  now. And that resonates a lot with me, the it's amazing part of the journey we end up taking people through is with the course we try to show as well as tell. Right. And so to your point,  how do I take 50 strangers on the internet all in little zoom boxes and how do we get them to trust each other as fast as we can?\r\n\r\n\r\nSo we do a lot of small things and we try to jar them out of what their normal day might look like. So when they come into the first class, there'll be a song going. Yeah. Well, in the intros, we asked everybody for their hype song. So it's somebody's hype song. Oh, sweet. Yeah, yeah, yeah. And then we get to talk about that person.\r\n\r\n\r\nLike we know them and that person feels connected to, but the other people feel a little bit closer because they were talking about this person in a one on one way. Then we'll ask them a question. Oh, what was your first concert? Then people are chiming in with their first concert. And again, it sort of creates that.\r\n\r\n\r\nIt connects the nostalgia to that. Oh, look, that person has similar music interests to me. Oh, Dave, that is so freaking cool.  And in three minutes, we sort of do that, then I'll lead with a lot of the things I suck at. It's very easy for Mara and I to then be vulnerable about something like, yeah, you're here because I'm just trying to gift you the mistakes that I made for 25 years.\r\n\r\n\r\nLike, here you go. And here's an interesting story about when I really screwed something up. And it's interesting, just those combinations, like we'll get a lot of feedback, even after module one, where I felt like I tried, I feel like I knew you and I trusted you within 15 minutes. And so that's huge because then I know we can get to your point conflict, right?\r\n\r\n\r\nWe can get to different points of view. And then we try to show people, well, here's how you resolve conflict. And it's the same game that we're trying to get them to play with their teams. Like, how can you quickly build trust with your new hires or with the team you take over? Then how do you ask for conflicts?\r\n\r\n\r\nA lot of people just shy away from the conflict, but then you don't get better ideas. You don't, and you don't build the muscle for bringing conflict to resolution and turn that into progress. And so we try to both show with all the things we teach as well as actually teach them.  Well, just because I love talking about these things anyways, like I love leadership and I love getting teams to function well together and have a feeling where they feel comfortable enough challenging each other. \r\n\r\n\r\nBut I love the way you've set it up too, because you have a very short feedback loop. It's a month.  And so over the last two years, you've been able to have, I don't know how often you do cohorts, if it is once a month, or if you're launching them once every two weeks and you just have overlapping cohorts, but either way. \r\n\r\n\r\nYou've iterated, you've gotten to a point where like very quickly you can launch the cohort and then get feedback. What did we do well? What did we do wrong? And then iterate and go to the next cohort. And so in less than two years, you've gotten to this point where the product and experience is just very high level and very high quality for the individuals going through your program.\r\n\r\n\r\nWas that by design or did that just kind of. As you look back, you're like, Oh yeah, I guess that does make sense that we were able to do that.  There are plenty of things I could say were happy accidents. That one was by design, not necessarily that it was just a month. And the goal was to get the feedback.\r\n\r\n\r\nI believe every system has to have a feedback loop, right? That you agree. We sort of set a goal. We combine people process. And technology to produce an outcome. If we meet the goal, great. If the goal comes up short in some particular way, well, then you go back and say, well, how do I want to change the people process or technology?\r\n\r\n\r\nAnd that, you know, those sites, that loop is how we get better and better. And so  we actually have even tighter loops than you're describing. Like we ask for the feedback in pretty much every session, or at least at a midway point at the end, like we are constantly, like, how do we dial this in? And then. I think the other thing that other people can use is just  the stakes feel so much higher in your mind for experiments than they are in reality.\r\n\r\n\r\nWe launched a course with a type form survey and okay, so my worst case is crickets and nothing happens. My best case was I have a new business. It's so asymmetric. Did it take you a while to get okay with that though? Or was that always innate within you? Where you're like, okay, yeah, I'll just try it.\r\n\r\n\r\nWorst case, I think it oscillates if I'm being handed. So we're running a, we're running a different form of our program at the end of June. It's going to, it's going to be a weekend  and in person, it's the same sort of live sessions that we're doing online. And we've had three or four ideas. So this is like me, like,  Owning the fact that I have been very hesitant to like eat my own cooking for the last year, because we have this thing that's working really well.\r\n\r\n\r\nAnd you're like, Oh, I don't want to break it. Um, but we're getting these signals of other things. One of the signals was I'm too busy. I can't come during the week. Another signal was, do you have something for earlier career managers or more basic, et cetera? Could you do it at a different time? And so there's all these Things that we've been pushing off because the thing we've been doing works. \r\n\r\n\r\nAnd then we finally were like, why don't we just experiment? Like it's a summer.  We don't teach the cohort in the summer anyways, but why don't we just do a weekend? And so we're going to find out, we're going to find out at the end of June, whether  a whole bunch of people wanted to do a management fundamentals course in a eight hour sprint over a weekend or not.\r\n\r\n\r\nWow. I'm excited to hear how it goes.  We'll see. Have you done any in person events or in person gatherings? The shape of our business is definitely continued to evolve, right? If you're in the creator world, it's like have social media, lead it to a newsletter, have some sort of digital something you can sell as some sort of service that's higher ticket, et cetera.\r\n\r\n\r\nI haven't gotten to the final two yet. I'm just, I'm in the social media. I haven't even sent a newsletter, but I am connecting, collecting emails. So yeah. I'm a few steps behind, but yes, that's correct. We, well, we did a funny, we went from social to this like mid ticket live thing, and then we've been back building.\r\n\r\n\r\nSo we,  I would say my first couple of cohorts were just Twitter. It was Twitter to a 2, 500 course  for like a year. Wow. Okay. And then Elon bought Twitter and we're like, Ooh, this is dicey. So I'm like, we should have a newsletter. So we had, so then we have a newsletter. So explain a little bit why it was dicey. \r\n\r\n\r\nI have a principle that like anytime ownership changes hands, you'd have to  assume anything could happen.  And if you watch it play out over the last two years, like we came very, like there was one moment where I felt like it was going to shut down.  He certainly has changed the algorithm meaningfully multiple times.\r\n\r\n\r\nHe's like chased bots in a good way. There's lots of, I don't have a strong point of view, good or bad, but I was just assuming like  it could have gone away. I'm not baiting you to like, say one thing positive or negative about Elon. Do you know who Jay Klaus is?  Okay. I really, really like, in fact, J class is going to be at this convert kit event, which I'm stoked.\r\n\r\n\r\nI want to meet him. But he talks about this. You can't be platform dependent. And so what you're describing is if you're on Twitter and your business is coming from Twitter and all of a sudden there's. An algorithm change, even not even Twitter goes out of business, just a change, tweak to the algorithm and your funnel dries up, your business is done.\r\n\r\n\r\nSo you've got to figure out a way to get people off platform and you've also got to diversify onto other platforms. So I think that's a really, really important piece, not just for creators, but for businesses as well. You can't be dependent on just one channel. For distributing your product. I mean, literally where we rewind the tape 20 minutes, right?\r\n\r\n\r\nI had a business, all Google, Google changed the algorithm. I had no business. And then here I am, I'm all on Twitter and I have a business. Elon buys it. And at least we pattern match this time. And I was like, okay, two LinkedIn and two newsletter. And so we've built those out over the last year and a half. \r\n\r\n\r\nThe next thing to come will be a digital product. So we have a course that's recorded.  We need to get that out. Then we have the live things, but then I've also started speaking and executive coaching, too.  I'm the worst publicized executive coach in the world. I have a roster of seven CEOs, but no one even knows I do it.\r\n\r\n\r\nOne of my favorite quotes is stupid people repeat the same mistakes over and over. Smart people make new ones.  And like, just, just even hear you say like, Oh, I recognized, Oh, I'm all in. This happened before. Ding, ding, ding, ding, ding, red alert, red alert.  Three weeks ago. Yeah. Yeah. It's anyways, it's at least you recognized it and made the change.\r\n\r\n\r\nSo tell me in the cohort based courses, what are you learning and teaching? Do you have your own, Playbook and manual. Or are you like, for me, the corporate experience I have with leadership development is like, here are the books we read that'll help you learn what our company culture is. And this is the vernacular that we use.\r\n\r\n\r\nAnd how does it function for you?  Honestly,  we were almost reluctant management trainers. If you say like, Oh man, someone's coming in to do corporate training. You picture like. A boring conference room, someone who's theoretical, they've got really cute ideas. And then you ask them how you actually do it.\r\n\r\n\r\nAnd they're like, I gotta go. \r\n\r\n\r\nAnd so there's a,  for us, I've run this business with my wife. She worked at Goldman Sachs. She worked at Google. I worked at Moody's in Bridgewater. Right. And so at one point. There was, there's a stat and we use it in the beginning of almost all, every time we teach, which is 60 percent of managers fail. \r\n\r\n\r\nFrontline managers of the C suite industry. There's a Gartner study. There's a McKinsey study, Cornfield. Like all the studies point to about 60 percent don't make it. And by don't make it, they get fired from their management job in 18 months.  So you're like, you see that stat and you're like, Holy shit.\r\n\r\n\r\nLike that's crazy.  Like we know we can do more things as a group than alone. So we keep assembling into tribes, into clans, into teams. They require leadership. They require management, but yet 60 percent of people fail. We take our very best performers. And set them up and you're worse than a coin flip.  And we just felt really blessed.\r\n\r\n\r\nIf you put those five, those four companies together at MPWC, make it a fifth companies that spent millions and millions and millions of dollars developing managers and leaders.  And we both individually happened to have had a couple of good role models too.  And so I'm like, wow, most people would have  killed to have one of these companies as their training ground.\r\n\r\n\r\nAnd we've had five of them collectively. So we said, well, what works across all five? If it worked at Bridgewater and Goldman and Google and PwC, does that make it as close to foundational or universal as it could be? And so we sort of compared our notes and our experiences and that's what.  That is what created the eight modules.\r\n\r\n\r\nDid you actually sit down and say like, all right, let's whiteboard this out, honey. What did you learn? What did you do? Or was it gradual over time that you guys sort of.  If you go back to the original, we had  that sort of cross comparison was the foundation for the first six. And then we have added, we've added two since then.\r\n\r\n\r\nSo one was of the two we added. So one was very Bridgewater specific. It was this idea of diagnosing problems to root cause. I was hesitant to do it, even though I was, I pointed to it as one of the. Two or three most impactful things I learned in my career leading teams. I just didn't know if it would translate well.\r\n\r\n\r\nAnd so then, you know, in that spirit of experimentation, I think in the third or fourth cohort, we're just like, we're going to, here's a bonus class. We're going to try to see if this works. And the feedback was screamingly positive. And so we just added it. The other one we added is this idea of amplifying your culture with your cadence. \r\n\r\n\r\nSo we were just getting a lot of signal from managers, especially founders or earlier, earlier stage companies of people being worried about. Losing the culture, right? That they, the behaviors that sort of got them going, but now they're getting big, they'd come to us because they were getting big and they needed a better operating system to manage. \r\n\r\n\r\nWe happen to have worked at companies that really spent a lot of time thinking about culture, codifying it, training it, teaching it. And so that was half, but it felt a little theoretical. And what you see when you study those companies is they carry it all the way down into how the company operates. So if you are, if you're Bridgewater and you're saying, well, I have this value of radical transparency.\r\n\r\n\r\nWell, I carry that through the people I hire who have to value operating through radical transparency. And then I have to support those people by having tools that allow us to give feedback transparently by recording every meeting, by how we do diagnostic sessions at the end of every week of things that are broken.\r\n\r\n\r\nAnd so it's this connection from the concept all the way down to the practical. And we use that to sort of tie together a lot of the pieces of the course. And. And it's that one has been a pretty powerful addition to say that phrase again, culture through cadence. So we call it amplifying your culture with your cadence,  which means you have to articulate what are the behaviors I want. \r\n\r\n\r\nI have to attract and retain the people who naturally exhibit those behaviors. Then I have to put process or rituals in place  that encourage those behaviors. I love the way you added cadence to it because  the first two things you said make sense. Okay, cool. Articulate your core values. Oh, easy.  Put systems in place to reinforce those core values.\r\n\r\n\r\nAgain, makes sense.  But it's the cadence. It's the like,  having a schedule  that reinforces.  Those core values that  I really, really like the way that you phrase that I'm going to have to write. I'm going to listen to this episode five times to write down all the nuggets that you drop in here are each one of the modules.\r\n\r\n\r\nIs there a lot of homework? Is there a lot of reading? Is it all interactive? What does the education look like?  We usually have 20 to 30 minutes of optional pre reading, but there's almost no homework in the course because  we're our target market is leaders. Majority of them are showing up. They're already overwhelmed.\r\n\r\n\r\nThey have too much to do. And so instead what we did is we tried to structure the modules where we're building that part of your management system in each session. So if you take the delegation module, as an example, we ask you to show up to class. With what's a piece of work on your desk that you are struggling to delegate.\r\n\r\n\r\nAnd by the time you leave, you have the script for  what you're delegating, who's going to get it, when you're going to delegate it, how you're going to oversee it. And literally this is the script you run to hand it off reliably.  So what are the modules you have? Yep. So we start with the mindset of the manager.\r\n\r\n\r\nSo that is really an entire module on self awareness. Second module is going to be the developmental coach. So can you build a high fidelity picture of your people,  structure that into how they need to grow, and then ultimately give them productive feedback. The middle four modules are all about work. So we go from goals.\r\n\r\n\r\nTo setting clear expectations, expectation to delegating work,  delegating work to then measuring and overseeing that work diagnosing to root cause. And then that amplifying your culture with your cadence. So that should take your work all the way from the concepts. You want to drive down to the tasks and the execution of it.\r\n\r\n\r\nAnd then when the last 2 modules, we go back to the people, we do an entire module on recruiting.  The difference is most people I think do hiring. We try to teach them how to recruit. And then the last one is this idea of your professional competitive advantage. So every leader I think has a different fingerprint.\r\n\r\n\r\nDo you know what yours is? And then do you look back through the seven modules we did? Are all these pieces adding up to reinforce the leadership brand that you want to have? Or are you sort of  pushing yourself in a direction away from that? Are you, how much of the module are you live teaching? How much of it is recorded? \r\n\r\n\r\nAll life. Okay. That's good. I was going to say, if it's all like recorded, then  that's a very nice digital product that you're just pumping out. It's been a debate. The challenge we have is even the ones that you lose a lot,  you lose a lot and you,  you get tied up in this asymmetric preparation, like you put 50, 50 people together and say like, Oh, please watch these 30 minutes in advance before we get together and talk half, we'll do it.\r\n\r\n\r\nAnd half won't do it. And so you sort of end up wanting to then. Not leave half the people out. And so you sort of read half teach the module, but you teach to the lowest common denominator, unfortunately, is what happens in those situations. And so the people who did prepare like. Don't get as much out of it while you're pulling up the bottom half.\r\n\r\n\r\nI,  it makes a ton of sense. What do you do post course? This is more from like a business standpoint.  One of the hardest things with any of these is compliance.  And that sounds bad to say this. I don't mean like, you know, you're checking in on them and did you do what I told you to do? You know,  I'm sure a lot of leaders are like, man, it'd be nice to have something that, you know, Just, I can follow up with or people check in with me and I'm maybe that's the executive coaching piece.\r\n\r\n\r\nBut is there like a subscription model that you have post course that maybe sends them weekly updates or maybe there's a once a month group chat or what does it look like post course?  It's such a good question that we have not done a good job answering  in the set. Well, at least not that we haven't done a commercial job answering it.\r\n\r\n\r\nWe do, we have alumni calls. They're usually every four to six weeks. It's just open to our thousand alumni. I would say, you know, 10 percent of them come back. It's always like they're slightly different. 10%.  Yeah.  And it is, it's really meant to be an open Q and a session. That's like office hours. Hey, you tried to implement something from the course.\r\n\r\n\r\nHow's it working? Not working. You have a challenge we didn't talk about in the course. Great. Bring it up.  So we do that. We try to make ourselves very available. So we always tell our alums, like. You have our email, you have ways to DM us. We still have our community reach out. Like we're always available. I should have done my research on this.\r\n\r\n\r\nDo you have a podcast?  I do not. It seems like a very  asymmetric bet for you to do a podcast where it's just like maybe one episode a week, or you could do more, but one episode a week where  you're just bringing on alum or you're talking to other leadership experts, because then it allows people who've graduated from your program.\r\n\r\n\r\nI'm going to, I'm going to bet for me after talking to you for 30 minutes, I'm going to be way more engaged with your stuff because I know you now. And what you say really resonates with me as a, as a leader.  I would assume after eight weeks of 90 minute courses for two days a week, people are like, gosh, dang it.\r\n\r\n\r\nI really like Dave. And what, I don't know your wife's name, but I really like what the clients are doing over there.  They would tune into a podcast and not even from an audience building standpoint, but I think the value that would be derived  would be exceptional because  eight weeks is still a short sprint. \r\n\r\n\r\nThere's going to be things that they're going to relearn over years that they're going to hearken back to those eight weeks. And if you had a podcast or something that allowed them to like relisten to these things, they're going to get more and more value out of it over time. So I don't know, I'm making a suggestion to you.\r\n\r\n\r\nI think a podcast would be a very Low risk way of continuing to facilitate this community that you've invested in, in perpetuity.  I appreciate it. I imagine you're struggling with this a bit as well, where it's just, I'm not short of ideas. I am at this inflection point of deciding, do I want,  how much more management do I personally want to take on to do the rest of the stuff?\r\n\r\n\r\nLike I,  the newsletter, as an example,  I would love to be running that like a business. I think I am. I would give myself a C plus. I am running it as a. Distribution mechanism of long form content. I'm not running it like a business. I'm not systematically growing that user base in a way other than promoting it on social or, you know, sort of swapping ideas with other newsletter creators.\r\n\r\n\r\nBut I,  that versus a podcast, I have a book that I need to be writing. I have, I'm just like, I'm out of hours in the day.  Do I want, do I want to have, do I want to build a business like the way I know how to go get more hours? And that is to hire people and delegate. Or do I like the lifestyle that I have, which is relatively uncomplicated.\r\n\r\n\r\nI don't have, I don't feel any pressure to continue a business or anything other than what my family needs. Yeah. And how do I want to weigh those things? And so that's fine. I'll do the podcast for you. Yeah, I,  for me, the way I look at it is like podcast allows me to network. It allows me, honestly, this is the second biggest reason I do it.\r\n\r\n\r\nIt's a journal for my kids because I want my kids 20 years from now to just either be able to listen to what I sound like or feed all my content into an LLM and have a conversation with 38 year old, you know, dad, and then.  Obviously build an audience, but I think for you, you just, if it was something  that you used for then content, which is what I'm doing, it's like, okay, podcast, I get content content that goes to social.\r\n\r\n\r\nIt also then feeds into my newsletter. I've structured it in a way that. Makes me feel like it's actually creating less work for me, but yeah, mostly my strategy is this. So my podcast strategy, I would say I'm on one to two a week. And so to some degree, I achieve the podcast outcome. I promote them in my newsletter so people can hear me talk, but I also get stimulus from different hosts  asking me questions from different angles and we get dropped into pools that we wouldn't normally.\r\n\r\n\r\nUm, Necessarily show up in. And so maybe what you can do is 80 20 solution on the podcast. Yeah. Maybe that is the 80 20 solution. And maybe what you could do is just create a feed. Like this would be a very, very easy thing to do. Create a feed for your alumni. That's like, if it is twice a week that you're appearing on podcasts, like  cool.\r\n\r\n\r\nYour podcast is already done. Here's my feed of all the different podcasts, which is the second section of my newsletter every week now. So, Oh, awesome. Okay. Like, it looks like I need to subscribe to your newsletter.  All right. Sold.  Alright, free to subscribe man. Free to subscribe. I man, this has been my favorite conversation so far.\r\n\r\n\r\nI've done 26 of these, so I'm not like super far into it, but I'm just fascinated. I try to keep this to 30 minutes 'cause I try to like just keep it nutrient dense.  Too many questions.  Can I rapid fire some questions at you? Fire. Alright.  What do you love about this business?  It's a tie.  I genuinely love being able to see over the shoulder of all these leaders and into these businesses and help them like just remove like that one problem that unlocks the next level. \r\n\r\n\r\nAnd the other one is my, my own personal sovereignty. Like I, I get to work with who I want, when I want, how I want, and I don't have to compromise on it.  Love it. What do you hate about this business?  It's a harder one. I don't, I like don't. I know hate's a strong word. What do you not like about it? It's funny.\r\n\r\n\r\nI was talking to a leader yesterday and I think probably the thing I like the least about it, maybe I hate it. Like it's,  there's a distribution of people in the world.  And I have the people who are like the hand raisers that are high energy, that show up, that engage, that pour a bunch into it. They give us tens out of tens.\r\n\r\n\r\nThey say it's worth a hundred times what they paid. And I literally want all 50 people to be those people. And that's just not how humanity works. We'll have one person out of every 50 who's like, they come to two. Multitasking. They're not really open to change. They're basically show up to confirm whatever they already know.\r\n\r\n\r\nAnd you're like, there's such a weird worldview and so orthogonal to me. But I, if I could find a way to screen and not have those folks in my programs, I think it would be to the benefit of everybody else. The 49 who are the high energy hand raisers.  So anyways,  have you ever thought about mid course, just.\r\n\r\n\r\nJust like pulling them inside and saying, Hey,  I'll refund you, but please don't come back. No, I hadn't thought about that. I mean, I guess I could. Yeah. Just curious. Not crazy. I mean, I'm all about clear as kind and speak truth to power. So. Yeah. I mean, if you really thought that the other 49 would benefit just anyways,  thought exercise  we're humans.\r\n\r\n\r\nSo there's always an aspect of the grass is greener. On the other side. And I always say real estate guys really love guys who have businesses. Cause they're like, Oh man, that'd be so cool. I could grow a business and I could have cash flows and no cap. And then business guys are always jealous of the real estate guys.\r\n\r\n\r\nCause they're like, man, it must be so nice to have an asset that just steadily appreciates every single year. Maybe outpaces inflation. What businesses are you jealous of? Right now,  I work with some really cool businesses,  and I have turned down jobs at those cool businesses.  And so right now, I feel like I've opted into the greener grass,  uh, and I am pretty systematically designing not to.\r\n\r\n\r\nTo chase another yard at the moment. And so if anything, I am, I'm probably more jealous of what I'm not getting to. Right. If I could be more systematic in my day to say,  I mean, social, right. It's a huge part of our businesses. It takes a lot of my time. I have tried in so many different ways to figure out how I could do like, like, you know, Achieve the outcomes I needed with it while doing less.\r\n\r\n\r\nAnd I have not figured that out. And that comes at the expense of the course I'm not building or the book I'm not writing. And so if I'm jealous of anything, it is the ones who are either creative enough to solve that problem for themselves to get to those things.  Or sometimes I'm jealous of the fact that they will like compromise their standard  on things that probably aren't as important.\r\n\r\n\r\nLike, I don't know how important comments are on social media. I know that. A comment existing is important for being part of a community and communities are what drives social media engagement. I have been really hesitant to turn it over to an AI tool to do comments or to turn it over to a VA because I've seen everybody else who does it and it is. \r\n\r\n\r\nObvious. It's not good. When it happens, I agree with you.  And so, but I'm a little jealous sometimes of that. I wish I could just care a little bit less about that particular thing or talk myself into that. It doesn't matter. Or just go full Alex Hermosi and never respond back to anything like, I don't have, I don't have the courage.\r\n\r\n\r\nI don't have the courage for that and  I'm jealous of that. Okay. How about that? All right. Last two questions.  If you had two hours. This afternoon, wife was gone kids. I don't know if you have kids, but if kids are gone,  you can do anything you want  and you sit down,  pop up in your computer.  What are you obsessed with right now?\r\n\r\n\r\nWhat are you spending time on? Where is your mental energy when you don't need to be thinking about work or family?  What am I obsessed with?  I'm just going to answer the question. I want to answer. I'm sorry. Do it. Duh. Well, I spent 20, I mean, you and I spent years in corporate America. I used to have a very much like a church and state thing.\r\n\r\n\r\nLike I would work and then I'd come home and I'd have these other things. And now I have my own business and I love it. And I get, we were talking about it, like work is play, play is work. Like they're very, the,  I don't, I often don't know what day of the week it is because there'll be a Monday when I'll like paddleboard and I'll do all the cool stuff and there'll be a Saturday where I write  and that's totally.\r\n\r\n\r\nSo if I'm, but if I'm sitting down and cracking open my computer, I am obsessed with what you would have put in the work bucket. Like I am. But what I'm super interested in right now is how  I have it. There's a set of phrases in business that I have these allergic reactions to. My current one is work life balance.\r\n\r\n\r\nYeah. I think it is one of those ones that is doing more harm than good. And so I'm like, how would I rephrase that? And one of the CEOs I work with. I think so as well, which is it's very much, how do we get our team to be at sustainable peak performance  because work life balance, like it assumes that these things have to be balanced. \r\n\r\n\r\nAnd I'm like, that is not true. There's seasons in your life where like, I want to work 20 hours and I'm doing something I'm so obsessed with, or there's times where I just want to like totally punch out because I need a break. And so, but. When I bring together a team and I'm working like peak performance.\r\n\r\n\r\nSo how do you get individuals to peak performance? How do you then get a collective of people to peak performance? How do you sustain that over the long haul? So if I had two hours, I'd probably be either researching or like trying to crystallize my thoughts on that. Another acceptable answer would have been paddle boarding. \r\n\r\n\r\nInstead you're, you know,  Einstein over here, my computer. Once you crack, I know, I know.  As they say in courtroom dramas leading the witness, I shouldn't have said crap to crack open your computer. I should have, I should have just like left it plain because you probably would have been like pickleball is amazing.\r\n\r\n\r\nBut that was a freaking great answer. All right. Last question.  What advice would you give you 10 years ago? Not someone who's in the same position as you if you were, if you had a time machine and you could go back and just give yourself advice.  10 years ago, and it could be as simple as, Hey man, don't be too dependent on Google.\r\n\r\n\r\nWhat would you tell yourself?  It's probably some version of the spotlight effect. Like no one's watching. So just take your chances. I should have been writing on social media earlier. I should have bought the low price business earlier. Like I should have taken, I should have taken more action to produce more data.\r\n\r\n\r\nTo tighten those loops we talked about in the same way that 20 years later or 10 years later,  we wrote the survey, we made the course, we taught the course, we raised the price. We like those loops all created a business. Everything I was doing before it was virtuous procrastination. So just get after it.\r\n\r\n\r\nVirtuous procrastination. Jeez Louise. I'm going to have a freaking dictionary added of all the sayings that you have. It's amazing.  Uh, virtuous procrastination. I love that. Beautifully articulated. All right, Dave, this was an absolute pleasure. Where can people find you if they want to learn more about you? \r\n\r\n\r\nYou can find me on LinkedIn, Dave Klein, find me on Twitter decline. I, I, you can subscribe to my free newsletter management playbook, or you can join one of the courses we talked about management accelerator. com MGMT. Okay. We'll check it out. Thanks, man. This has been awesome. Thank you. Well, a big thank you for Dave for making time to come on.\r\n\r\n\r\nI've just been floored. By the types of guests we've been able to get on here and the free knowledge that we're just dropping on people every single day. If you liked this episode over the next few weeks, we have some amazing guests coming out. I mean, I've been shocked at the quality of the guests that I've been able to get because I'm just an idiot who reached out to people and asked them to come on and somehow they do and they're sharing  nuggets and how they.\r\n\r\n\r\nBuilt these businesses, how they run these businesses. And if you're an entrepreneur or an entrepreneur who wants to get into this,  these are gold. It's like sitting in on a college course, but you don't have to pay anything for it. I truly believe that curiosity is a superpower. So I would encourage you to keep asking questions, keep finding opportunities to get better.\r\n\r\n\r\nAnd as my mom always says,  there's no such thing as a dumb question. There's only dumb people who are unwilling to ask the dumb questions, and I'll see you next time.",
  "metadata": {
    "duration": "",
    "date": "2024-07-10",
    "platform_source": "Google Drive"
  }
}