{
  "episode_number": "130",
  "episode_title": "How Our Podcast Helped Him Make $23K/Month and Quit His 9-to-5 with Chris Koerner",
  "guest_name": "Chris Koerner",
  "business_name": "Stump Grinding Business",
  "transcript": "﻿Chris Koerner (00:00.355)\r\nOkay, sure. well, I did love the dishes. I was just hoping he had a mission story behind them.\r\n\r\n\r\nNikolas Hulewsky (00:04.664)\r\nWhatever, Chris, you love the dishes.\r\n\r\n\r\nDo you even know where they're from? Or are they just up there?\r\n\r\n\r\nTyler (00:11.606)\r\nNo, I don't know. I'm guessing a thrift store. It would be my best guess. I have no idea.\r\n\r\n\r\nNikolas Hulewsky (00:19.826)\r\nAll right. I hit record, but we'll probably edit these first parts anyways. I know you've connected before with Chris on DMs. I think you and I have DMed a few times before. This is going to be easy. The plan is to not go super long, but we'll see where the conversation takes us. Okay. Chris, I'm let you start. Let's do this thing.\r\n\r\n\r\nChris Koerner (00:48.751)\r\nYeah, Tyler, I just want to hear what your story is. Specifically, like what made you want to quit your your B2B sales job and do this and how has it been going so far?\r\n\r\n\r\nTyler (00:59.288)\r\nYeah, that's great question. yeah, graduated from college about four years ago. I have been in B2B sales since. I have been looking throughout that time to get into entrepreneurship in some way. A classic I read, buy then build. And I was like, I'm going to buy a business. And I had $0 in my bank account. So that's\r\n\r\n\r\nyou know, slowly crashed down reality wise, and then looked into some service franchises. And there's a lot of moments of cold feet. And yeah, I heard the idea about a stump grinding business from your podcast originally, I've documented this on on Twitter a few times, but something clicked there. I'm not really sure why I was on a tree crew in high school, I'd grind ground like a stump or two. You with a, you know, a handle grinder at the time.\r\n\r\n\r\nNever used a machine like what I use now, but yeah, you kind of put it in a perspective. I was like, that's kind of just B2B sales. I know how to do that. And grinding stumps is not that complicated. Like maybe we can just give it a shot and see what happens. And yeah, it's slowly, I did not plan on ever quitting my job with stump grinding. was like, this will help me save more cash. And it slowly progressed from there.\r\n\r\n\r\nChris Koerner (02:11.846)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (02:13.112)\r\nSo you've always been a grinder. Just always. He's been grinding since college, Chris. You didn't know that?\r\n\r\n\r\nTyler (02:15.596)\r\nYeah, yeah, always.\r\n\r\n\r\nChris Koerner (02:15.611)\r\nTyler the Grinder, that's what they call him.\r\n\r\n\r\nChris Koerner (02:20.635)\r\nYeah, I do now.\r\n\r\n\r\nNikolas Hulewsky (02:22.574)\r\nSo, Chris and I, when do we have that conversation, Chris? July? What's funny? Oh.\r\n\r\n\r\nChris Koerner (02:26.417)\r\nJuly, yeah, think so. July 11th.\r\n\r\n\r\nTyler (02:28.184)\r\nJuly 11th, I have the, I found the episode just so I had it for my notes. You know what I mean? When I heard it, cause I heard it the day it came out. And then August 3rd is when I did my first three jobs from July 11th.\r\n\r\n\r\nNikolas Hulewsky (02:40.11)\r\nfunny enough Chris you were in Utah when we recorded that episode weren't you?\r\n\r\n\r\nChris Koerner (02:45.169)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (02:46.892)\r\nIt was serendipitous.\r\n\r\n\r\nChris Koerner (02:48.314)\r\nIt was.\r\n\r\n\r\nTyler (02:48.322)\r\nThat's perfect. Yeah, absolutely.\r\n\r\n\r\nNikolas Hulewsky (02:50.12)\r\nOkay. What was it about? Okay. I mean, I don't really remember the whole conversation. What was it about stump grinding that you're like, this is like B2B sales. Because I don't think stump grinding is like B2B sales, but\r\n\r\n\r\nChris Koerner (03:01.251)\r\nIt is B2B sales. This is literally a B2B sales business.\r\n\r\n\r\nTyler (03:02.806)\r\nIt is. Yeah, about 95-ish percent of my revenue is, what's the differentiator, reoccurring? So it's not recurring, but I work with the same contractors who continue giving me same sub jobs all the time. So my marketing spend is almost zero. So I build a relationship upfront with a company that doesn't have a grinder. They either rent or they have an old one that's just not great.\r\n\r\n\r\nNikolas Hulewsky (03:05.77)\r\nsay more.\r\n\r\n\r\nTyler (03:30.642)\r\nAnd it just makes more sense to have someone else do it. Either they don't love their sub currently or they're tired of renting and we build that relationship slowly. And then now, you know, I just make sure I answer my phone and get back to text really fast, put it on the calendar and get it done.\r\n\r\n\r\nNikolas Hulewsky (03:44.622)\r\nSo these aren't residential clients. The majority of your clients are like what? Apartment complexes, businesses.\r\n\r\n\r\nTyler (03:51.134)\r\nyeah, go.\r\n\r\n\r\nChris Koerner (03:51.429)\r\nNick, let me interrupt you, Nick. This whole idea was not like, let's start a stump grinding business. It's let's start a stump grinding business that only goes through tree trimming crews because they're outsourcing their stump grinding to other people. So his customers are the tree trimming business owners, but their customers are residential. He's just not going through residential customers. They're subbing it out to him.\r\n\r\n\r\nNikolas Hulewsky (04:11.502)\r\nI'm a retarded, okay. Now I remember this part of the conversation.\r\n\r\n\r\nChris Koerner (04:16.357)\r\nYeah. And for anyone listening, if you want to go back and listen to this original podcast, was on July 5th, July 10th, episode number 37, July 10th, B2B stump grinding, cash cow or.\r\n\r\n\r\nTyler (04:23.352)\r\n11th? 10th? Got it.\r\n\r\n\r\nNikolas Hulewsky (04:30.222)\r\nThat's right, because it wasn't just the stump grinding we were talking about. Yeah, okay. Now I'm caught up, Tyler.\r\n\r\n\r\nChris Koerner (04:35.609)\r\nYou probably heard it on the 11th, but yeah.\r\n\r\n\r\nTyler (04:37.708)\r\nYeah, no, we're all here. It's perfect. Yeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (04:40.375)\r\nI'm caught up.\r\n\r\n\r\nChris Koerner (04:41.573)\r\nWe're here physically.\r\n\r\n\r\nNikolas Hulewsky (04:45.614)\r\nAll right, so a lot of the stuff we just talk about in theory, right? Where we're like, yeah, dude, this is what you could do. Here's the idea. How much of what we said, I mean, it's mainly Chris's idea, like how much of what we said, did you go out and implement and it worked? And how much of what we said was it like, yeah, this didn't work. I had to go out and find customers this way.\r\n\r\n\r\nTyler (04:45.777)\r\nTyler (05:02.616)\r\nYeah, I want to shout out Chris on this. I've mentioned this on Twitter. and Chris, I try to always tell people what ideas came directly from you still to this day. I followed literally I'm not joking word for word. There's 10 minutes of the podcast that I probably listened to. I don't know, three, four or five times that I had pretty much written down word for word, the exact text to send the exact software is to try it out, trying it in a different market. So I actually tried out.\r\n\r\n\r\nChris Koerner (05:12.837)\r\nThank you, thank you.\r\n\r\n\r\nChris Koerner (05:28.357)\r\nThat's amazing.\r\n\r\n\r\nTyler (05:31.064)\r\ntried it out in Boise, even though was down here in Provo. I was never going to service a stump in Boise, but I wanted to see the demand in a similar market. So I literally did everything from that podcast, did not change anything. there was stuff that wasn't covered in the podcast, brands of machines and trailers and different things that are just logistics for the business that I had to go learn myself. But how to actually drum up my first customers, was directly from the podcast.\r\n\r\n\r\nChris Koerner (05:58.991)\r\nNick, let me jog your memory even more. I went to Upwork and hired a virtual assistant to call hundreds of tree trimming companies in Houston because Houston's like a comparable market to DFW because we were literally thinking about starting this. And then I shared that data with anyone that wanted it in a spreadsheet. And I forget what it was. It was like 10 % of the market was willing to sub it out to us. And I think we covered the data on a, on a\r\n\r\n\r\nNikolas Hulewsky (06:21.646)\r\nThat's right.\r\n\r\n\r\nChris Koerner (06:26.398)\r\nan episode like a month later so did you ever look at that data Tyler and use it or was it just kind of irrelevant\r\n\r\n\r\nTyler (06:31.928)\r\nYeah, I got that spreadsheet and that data. I mean, I looked at it. It helped me organize my spreadsheet actually and how I did some of my outreach. And I asked you about your cold caller and you're like, hey, you know, I'll give you it once he's done doing this cold calling for me. And I was like, all right, that's fine. Like I'll just go do it myself. So I went and did most of the cold calling, cold texting, all myself early, early stages.\r\n\r\n\r\nNikolas Hulewsky (06:53.89)\r\nSo Boise was your test market?\r\n\r\n\r\nChris Koerner (06:53.937)\r\nGotcha.\r\n\r\n\r\nTyler (06:55.692)\r\nBoy, here's my test market. was, it was crazy. I remember the first day I sent out like 45 texts and I had guys calling me like, dude, you need to be in this backyard in like 20 minutes. And I was like, whoa, whoa, whoa. I was like, easy, easy, easy. There were some uncomfortable conversations there. I felt a little bit dishonest. Yeah. Yes. Yeah.\r\n\r\n\r\nNikolas Hulewsky (06:57.324)\r\nWhat does it show?\r\n\r\n\r\nNikolas Hulewsky (07:15.896)\r\nlike whoa whoa whoa I was just lying I'm not in but this was a test\r\n\r\n\r\nChris Koerner (07:18.071)\r\nLike, I just listened to a guy on a podcast. I don't... Are you my grandson?\r\n\r\n\r\nTyler (07:21.932)\r\nI was like, dude, I don't, can't grind stumps. You guys are crazy. You know, it was, yeah, but no, it went fast. That's how fast I did like three days of that. And then I was like, I'm going to stop doing this because I'm starting to get into some really weird conversations with people following up with me. Like, are you going to show up? I never told anyone I was going to show up anywhere, but there were people, you know, telling me they had jobs for me. And, but it was great. I use those, opportunities as like a conversation. have an Arizona number. That's where I grew up.\r\n\r\n\r\nNikolas Hulewsky (07:49.71)\r\nMm.\r\n\r\n\r\nTyler (07:49.88)\r\nAnd so I was just like, coming from Arizona, this is the pricing down there. Like what is the pricing look like up here? Once again, you can judge me for my dishonesty. totally understand.\r\n\r\n\r\nNikolas Hulewsky (07:59.982)\r\ndude, that's smart. Yeah, yeah, yeah. So you were framing it as, hey, I'm already out of market. This is what we usually pay. Help me understand what the pricing is. But really you were just trying to get pricing.\r\n\r\n\r\nChris Koerner (08:07.825)\r\nMm-hmm.\r\n\r\n\r\nTyler (08:08.115)\r\nYeah. Yeah. And basically, they would give me like, oh, yeah, it usually works like this up here. And I was like, OK, took a ton of notes. And then was like, I'm sure it probably works pretty similar in Provo and Salt Lake.\r\n\r\n\r\nNikolas Hulewsky (08:19.822)\r\nIf people can't see Chris's face, but right now hearing Tyler talk about, it's like, didn't lie to anybody outright. And like just how uncomfortable he was having those conversations. Chris looks like James Franco in the meme where he's looking over, he has a noose around his neck and he looks over at the guy and he goes, first time? Yeah, that's how Chris looks right now to Tyler.\r\n\r\n\r\nChris Koerner (08:37.573)\r\nFirst time. Well, I've had so many awkward conversations, because like, that's all I do is just send out text to hundreds of people to validate things or not. And then it's like, my gosh, next thing I know, there's a 80 foot Santa Claus in my front yard. Like, that's true story.\r\n\r\n\r\nTyler (08:55.02)\r\nYep. Yep.\r\n\r\n\r\nNikolas Hulewsky (08:58.21)\r\nFirst time, dude. Okay, so Boise was like, my gosh. Yep, it's here. It's a thing. I'm gonna now do this. Where are you? You're in Provo. I'm sorry, Provo. I believe that's it's pronounced, correct? Provo.\r\n\r\n\r\nTyler (09:09.336)\r\nI'm in Provo, yep.\r\n\r\n\r\nYeah, exactly. Yeah, no, that's exactly how it went. I brought the same idea down. actually kind of wished that early on I was like, I wish I was in Boise because I got a little bit better and like more opportunities in Boise than I did in my area. Yeah, I wasn't really willing to pick up and move everything right then. no, it still worked out great. I found\r\n\r\n\r\nChris Koerner (09:13.445)\r\nMm.\r\n\r\n\r\nChris Koerner (09:27.11)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (09:31.086)\r\nIf only you knew somebody, I'm Boise.\r\n\r\n\r\nNikolas Hulewsky (09:36.354)\r\nNah.\r\n\r\n\r\nTyler (09:40.578)\r\nMy first two to three contractors are guys that give me a ton of work still to this day. And then, you know, after you've blamed your first two or three, the worry of like not being able to pay equipment or trailer or some of that stuff kind of leaves. And it's just building from there. So it was awesome to get to those first two, three relationships in the first few weeks and then slowly after that build. But those, those first four weeks too, I was doing all this at a, office of a tech company. So that was fun.\r\n\r\n\r\nNikolas Hulewsky (10:09.582)\r\nAre you just renting a grinder and then going out and doing these jobs or did you buy one?\r\n\r\n\r\nTyler (10:14.988)\r\nI rented for the first month. found a dealership that was about to pull a new machine out of their new like sales into their rental fleet. and they said, Hey, you can rent this for the month. If you, you know, if you decide to buy it, we'll just roll the rental price into the buy price, which was an awesome win-win for everyone.\r\n\r\n\r\nChris Koerner (10:30.257)\r\nHmm, that's a good idea.\r\n\r\n\r\nNikolas Hulewsky (10:31.601)\r\ncool.\r\n\r\n\r\nChris Koerner (10:34.105)\r\nSo did you never end up doing any jobs in Boise? You just use that to test?\r\n\r\n\r\nTyler (10:39.126)\r\nYeah, didn't I was I never traveled to Boise at all. So yeah, it was just a test market.\r\n\r\n\r\nChris Koerner (10:44.261)\r\nHmm. It's not surprising to me that the outreach fared better in Boise, just because I feel like Provo is the most competitive market in the world for anything. You've got like 80,000 return missionaries that have been rejected a million times each, and they're just so ready to launch a business. Like everything's over saturated in, Provo. It's not surprising that you had better luck in Boise because Provo is like the worst for launching stuff. If you can make something work in Provo, mark my words, you can make it work anywhere.\r\n\r\n\r\nNikolas Hulewsky (10:46.072)\r\nSomebody's.\r\n\r\n\r\nNikolas Hulewsky (11:01.676)\r\nYou said it's not surprising or it is surprising, the poise? Yeah.\r\n\r\n\r\nNikolas Hulewsky (11:15.37)\r\nIf you can make it here kid, can make it anywhere. Freaking New York City.\r\n\r\n\r\nChris Koerner (11:19.825)\r\nWell, I mean, Nick, like on one hand, you have all these enterprising return missionary business owners. And then on the other hand, you have a bunch of people like me that are like, Oh, okay, your price is 350. Will you do 14 cents? You know, like what, what are the cheapest people in the world?\r\n\r\n\r\nNikolas Hulewsky (11:32.076)\r\nYeah, the combination of those two is not good. We looked at Provo. Remember we did it with the...\r\n\r\n\r\nChris Koerner (11:38.864)\r\nfor tree trimming.\r\n\r\n\r\nNikolas Hulewsky (11:40.024)\r\nWhat's his name? Yeah, Fortree trimming. And we were like, man, it is high, like hyper competitive out here in Provo. What was the time? So you listen to it on the 11th, let's say July 11th. What's the timeline here between July 11th and like your first booked job? Like when, when did you start doing the testing in Boise? When did you start looking in Provo? And then when did you have your first book job?\r\n\r\n\r\nTyler (12:01.912)\r\nYep. So I listed it at July 11th. I think I sent my first batch of text July 12th. As fast as that outscraper thing happened, just went. And the cool thing about this, I have not always been like this. I just want to kind of play both sides of this a little bit in that there was a direct way to go test this in a different market. And this wasn't going to hurt me. So I was like, I'm going to try this today. And so July 12th, I think I sent my first text.\r\n\r\n\r\nChris Koerner (12:08.559)\r\nHmm. Bias for action.\r\n\r\n\r\nTyler (12:28.792)\r\nBy the end of that week, I was like this has some legs to it. Like I started going into dealerships and talking about or you know learning about brands of stump grinder. I also emailed probably 50 owners of stump grinding companies in different states. Just like a quick like can I interview you? Can I ask you a few questions? And that's that actually worked well for me really well. People are open with their time.\r\n\r\n\r\nNikolas Hulewsky (12:37.486)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (12:49.191)\r\ninteresting.\r\n\r\n\r\nTyler (12:55.864)\r\nespecially these stump grinders, they were awesome and kind of got me up to speed really fast on brands and stuff. But yeah, anyways, and then I had my first book job August 3rd. So I remember, yeah, first two, well, I two jobs that were four stumps. One job was three stumps and the other job was one stump on August 3rd. That was a Saturday and it was electric. It was awesome.\r\n\r\n\r\nNikolas Hulewsky (13:07.736)\r\nDude!\r\n\r\n\r\nChris Koerner (13:21.585)\r\nAny like, stories? Like any just embarrassing stories? You screwed something up or something broke?\r\n\r\n\r\nNikolas Hulewsky (13:26.414)\r\nit\r\n\r\n\r\nTyler (13:28.044)\r\nYeah, not on the day one, but absolutely. Yeah, I had one at a townhome complex. It was for an HOA and there's roots running everywhere. And at the last second, tree guy was like, dude, I need you to get every single root out. And I was like, okay, we can do that. But like, we're going to hit a sprinkler line somewhere. And he's like, that's fine. You know, like, let's just do it and we'll, we'll fix it. Yeah. I was like, all right, whatever, dude. Yeah. And this is my first time working with them too. So I'm young and dumb and whatever. And we go.\r\n\r\n\r\nChris Koerner (13:45.617)\r\nMm hmm. That's not fine. What are you talking about?\r\n\r\n\r\nTyler (13:56.99)\r\nhit the sprinkler line. It's right next, I can't make this up. This is a summer day in Utah, right next to a window of a townhome. The sprinkler starts like, like, the highest pressure water you've ever seen starts coming through this person's window. The window is open. The window is open. I basically break into their house. I like slam, slam, slam. They don't come in two seconds. I open, was like, Hey, is anyone home? You know, because I do not want to flood their whole living room. Finally, they come downstairs, we shut the window.\r\n\r\n\r\nChris Koerner (14:07.729)\r\nNo, it's fine. It's fine.\r\n\r\n\r\nTyler (14:25.14)\r\nwe finally figure out where the sprinkler turnoff is because HOAs are weird. It was like at the front of the property. And then he was like, yeah, you're going to be on the hook for this, by the way. So I'd never made any, I didn't make a dollar off that job, which was a nightmare, a nightmare. But yeah, I mean, a few things like that, but overall what you do as a stump grinder, as long as you call in like utility locates, it's pretty simple.\r\n\r\n\r\nChris Koerner (14:36.579)\r\nWhat? my.\r\n\r\n\r\nNikolas Hulewsky (14:37.123)\r\nNikolas Hulewsky (14:44.014)\r\nMm.\r\n\r\n\r\nWhat was the owner? Was that was that Derek Sorensen? It Derek Sorensen, wasn't it? Frickin brother Sorensen. Was it Braden Christensen? Gosh, dang it, dude.\r\n\r\n\r\nChris Koerner (14:53.273)\r\nIt was, it was Braden Christiansen.\r\n\r\n\r\nTyler (14:56.46)\r\nyeah, yeah, yeah, no, yeah, was, yeah, Joseph something. Yeah, yeah, 100%.\r\n\r\n\r\nNikolas Hulewsky (15:02.752)\r\nNot. That's in.\r\n\r\n\r\nChris Koerner (15:05.489)\r\nany other any other stories like that?\r\n\r\n\r\nTyler (15:10.156)\r\nYeah, there was one where they wanted me to fit through like a gap between two sheds. And then there was a electric line running to the back shed. was a private electric line. I saw it. I knew it was there. I'm an idiot. I was just like, dude, I can do this, whatever. And so I hit it. I couldn't do it. I'm an idiot. And the back shed was the home office for the dad of that family. Didn't know that.\r\n\r\n\r\nChris Koerner (15:22.309)\r\nmy gosh. That'll kill you.\r\n\r\n\r\nTyler (15:38.944)\r\nAnd so he comes out, like I hit it, sparks fly everywhere. He comes out just pissed, know, like so mad and rightfully so. Like that was completely on me. Yeah, yeah. He goes, exactly. What the frick is happening? You know? And then I was like, yeah, I'm sorry I hit this and had to pay for that one too. But those are really the two worst ones. Outside of that, it's been small stuff here and there.\r\n\r\n\r\nChris Koerner (15:45.937)\r\nFrick, Frick, Heck, Flip, Brother Elder.\r\n\r\n\r\nNikolas Hulewsky (15:59.96)\r\nSo here's my question for all the people who are like, actually you can't do one of these businesses without this type of insurance, this type of insurance, this one. When did you actually get insurance? you did, okay.\r\n\r\n\r\nTyler (16:09.88)\r\nRight away, I did do that right away. Yes, yes, I have. This one felt a little bit different. It didn't feel like I was, I don't know, what's it, you know, running a cleaning company. Yeah, yeah, this one I felt like I was like, I could actually probably do some damage somewhere. And so I got insurance right away. Both those things I paid out of pocket, but yeah, no, did have insurance, yeah.\r\n\r\n\r\nChris Koerner (16:18.481)\r\nGo fast and break things.\r\n\r\n\r\nNikolas Hulewsky (16:20.258)\r\nGood, good, good, good.\r\n\r\n\r\nChris Koerner (16:25.826)\r\nAnd you did.\r\n\r\n\r\nNikolas Hulewsky (16:29.356)\r\nNo, yeah, that makes sense. Can you give me an idea? So August was your first month. You've quit your job. Like you're not working. You're grinding full time.\r\n\r\n\r\nTyler (16:39.576)\r\nquit my job September 1st. Yeah. So I did.\r\n\r\n\r\nNikolas Hulewsky (16:41.658)\r\nmy gosh, dude. So tell me, what's your revenue been? Just hit me August, September, October, November, if you can.\r\n\r\n\r\nChris Koerner (16:42.031)\r\nCool!\r\n\r\n\r\nTyler (16:47.168)\r\nYep. Yeah. So, I have that somewhere. could break it out individually, but so it was 9,500 in, August. and then in September I had like so much on the calendar that I was like, it's either I quit or I get fired basically. And so I actually, I negotiated some severance cause I was pretty good at my job. So I had a really good book and I was like, Hey, let me help pass these accounts off to someone that wants them and let me leave. And they're like, yeah, perfect. We'll pay for a month. And I was like, let's freaking go.\r\n\r\n\r\nChris Koerner (16:52.785)\r\nIt was an-\r\n\r\n\r\nChris Koerner (17:03.835)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (17:04.633)\r\nNikolas Hulewsky (17:11.938)\r\nMm-hmm.\r\n\r\n\r\nTyler (17:17.048)\r\nSo September was 23k. So that was actually my biggest month still to this point. Yes. And then it slowed down because of winter.\r\n\r\n\r\nChris Koerner (17:23.176)\r\nmy gosh.\r\n\r\n\r\nNikolas Hulewsky (17:26.501)\r\nReally? Probably because you're like, I was just gonna say, yeah, probably because it's like end of summer, going into fall. That's when people are doing the majority of this type of work.\r\n\r\n\r\nTyler (17:35.682)\r\nTotally. And then through the end of the year, I did 69,000 in revenue from August 3rd to the end of the year. And then in January, I did like seven in this month, I'll do 11. So it's starting to pick up again for the spring. yeah, yeah, we're excited about that. It's awesome.\r\n\r\n\r\nChris Koerner (17:48.507)\r\nHoly cow. Even in February you're doing 11 grand?\r\n\r\n\r\nChris Koerner (17:55.471)\r\nI mean, are you grinding through the snow?\r\n\r\n\r\nTyler (17:58.102)\r\nYeah, some days, yeah. try not to do it on snow days, but yeah, some days it's scheduled and it's not coming down too bad. it's like a blizzard, I'm not gonna be grinding a stump, but if it's some light snow, yeah, we'll put on a few jackets and go.\r\n\r\n\r\nChris Koerner (18:14.053)\r\nAll right, let's talk unit economics like per job. What is your average job size? What is your average profit per job? And how do you think that'll change when you start scaling and hiring?\r\n\r\n\r\nTyler (18:23.148)\r\nYeah, 390 is my average job size. And that's skewed upwards probably because of a few outliers. I've had like a four grand job and a five grand job that are considered one job there. I do not know my profit per job, just gonna be honest there, hand up. I try to keep track of all this stuff, but I don't know that currently.\r\n\r\n\r\nChris Koerner (18:44.197)\r\nThat's okay. I mean, rough ballpark, like based on what you're like, because you own the thing now, you there's no rental costs, you've got gas your own time, I have to think your costs aren't that much.\r\n\r\n\r\nTyler (18:53.816)\r\nYeah. No, not at all. Directly, like my stump grinding payments, 9.90. I pay 1.75 for my trailer, and then I pay like 4.50 for my truck. I park it at a storage facility for, you know, 150 bucks, and then I have 4.50 of insurance monthly. So like total, you're talking like two grand at 2,500 of overhead. And I make that, like I do $1,500 days routinely in the summer.\r\n\r\n\r\nChris Koerner (19:09.285)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (19:21.038)\r\nDude.\r\n\r\n\r\nChris Koerner (19:21.081)\r\nAnd I mean, that's paying down your assets to most of it like.\r\n\r\n\r\nTyler (19:24.054)\r\nYeah, absolutely.\r\n\r\n\r\nNikolas Hulewsky (19:25.26)\r\nRight. Yeah, that's a good question. How much did the stump grinder cost?\r\n\r\n\r\nTyler (19:28.982)\r\nStump grinder was $55,000. yeah. Yeah, I had to put 20 % down on that. Everything else, I was zero down on the trailer and the truck. So there's some awesome companies that will do startup loans for heavy equipment where they still lend it to your company with your personal credit is weighted in there. And they kind of screw you with interest rates. hey, I mean, I was in the game.\r\n\r\n\r\nNikolas Hulewsky (19:31.116)\r\nAnd so you're on payments, right? You didn't pay out of pocket, I'm assuming.\r\n\r\n\r\nNikolas Hulewsky (19:37.454)\r\nThat's I was just going to ask, how did you finance it?\r\n\r\n\r\nNikolas Hulewsky (19:54.156)\r\nYeah, yeah, exactly.\r\n\r\n\r\nChris Koerner (19:54.288)\r\nMm-hmm.\r\n\r\n\r\nTyler (19:57.528)\r\nBusiness credit started growing. I actually was able to get like a business credit card pretty fast because of that stuff.\r\n\r\n\r\nChris Koerner (20:01.617)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (20:01.976)\r\nSo what's the term of the loan? How long over? How's it amortized? What's your monthly payment?\r\n\r\n\r\nTyler (20:08.92)\r\nFive year loan, 990 payment. I put like 12 grand down because I had to put like 20 % down. So yeah.\r\n\r\n\r\nNikolas Hulewsky (20:12.91)\r\nDang. Okay. Dude, I was just doing the math as you were talking and I'm like, all right, you said month 1, 9500 month 2, 23,000 and then you did 69,000 total between August and December. So you averaged about $12,000 a month for the rest of the year. And then you said January and February, you've done about 11,000 a month.\r\n\r\n\r\nTyler (20:35.738)\r\nYeah, just about across the two.\r\n\r\n\r\nNikolas Hulewsky (20:39.032)\r\nSo even though, what was your job before?\r\n\r\n\r\nTyler (20:42.848)\r\nI was a SaaS sales rep, you will. So selling reoccurring SaaS products.\r\n\r\n\r\nNikolas Hulewsky (20:46.849)\r\nOkay.\r\n\r\n\r\nSo you're probably making more money than this, you're like back at the envelope, you're taking home at least nine grand a month.\r\n\r\n\r\nTyler (20:58.296)\r\nYeah, yeah, we'll And what's so funny is because a lot of personal expenses are rolled up into a lot of the things that I do for business, I am going to be very interested to see after the end of a full year with a lot of those upfront costs already handled. I think I can make more if I was going to be the one grinding all year this year, which I want to hire eventually, but right now it's just shoveling cash away. actually think\r\n\r\n\r\nyou'd be surprised how fast you could hit the mark of like a good W-2 if you're just willing to like be out there and just do do a lot of hard work.\r\n\r\n\r\nNikolas Hulewsky (21:33.038)\r\nWell, that was going to be my question. 23,000 in September was a good month. You're coming into the months where in the spring and summer, well, you'll probably have big months again. What's your plan to be able to do 23, if not more than that a month?\r\n\r\n\r\nChris Koerner (21:33.305)\r\nyourself.\r\n\r\n\r\nTyler (21:46.454)\r\nYeah. So a few things. the first one was, the beauty, beautiful thing about being a sub in the last person to talk to the customer is I've actually gotten a lot of reviews, without ever spending a dollar in marketing. Cause I'd leave and I'm like, Hey, this is my, I have a little card, you know, that you put on the back of their phone and it pulls up my, my review link there. I'm like, Hey, I, know, I work with the name, the tree company all the time. Like I do all their stumps for them. I'm a new company. Like I'm here in Provo. I'm working hard.\r\n\r\n\r\nChris Koerner (22:07.023)\r\nMm-hmm.\r\n\r\n\r\nTyler (22:14.808)\r\nLike, could I get a review? So I have 55 five-star reviews. We're starting to get a little bit more organic traffic directly from the customer and starting to rank a little bit better for stump grinding specifically. And then building more more tree relationships. It's the biggest thing I could do. One tree relationship can give me anywhere from, you know, five grand on the year to like 20, 30 grand on the year of revenue. So it's just important that I build those as strong as I can, do anything I can to land my first job for that tree company.\r\n\r\n\r\nChris Koerner (22:17.755)\r\nWow.\r\n\r\n\r\nChris Koerner (22:36.337)\r\nCheers.\r\n\r\n\r\nNikolas Hulewsky (22:37.517)\r\nWow.\r\n\r\n\r\nTyler (22:43.03)\r\nand then do everything I can to be reoccurring for them.\r\n\r\n\r\nChris Koerner (22:46.577)\r\nSo, so you're not being super strict about like I am only B2B like you would love both. Correct. Okay. And are your are your subs or your crews that are referring you? Are they cool with that? Have you talked to them about that? Or you just kind of leave in business cards on the sly?\r\n\r\n\r\nTyler (22:52.076)\r\nYes, yes, absolutely.\r\n\r\n\r\nTyler (23:02.136)\r\nUm, odd the review part, is that what you're talking about?\r\n\r\n\r\nChris Koerner (23:05.109)\r\nYeah, or like, do they care that you're you're talking to the customer directly? Probably not because it's you're not competing with them, right?\r\n\r\n\r\nTyler (23:11.906)\r\nThey love it. Because I always I send them a message like, just got done it at Sally's. Like she's super stoked on how it all went. And like in their head, they're like, great. Yeah, they you know, they love us. So I always leave that little text after. And it's a loud machine. So I always just knock and I'm pretty personable. So I just make it in their head, it's still the tree company doing the service. You know what mean? That's the only person they have communicated with. So I don't think my guys mind it too much.\r\n\r\n\r\nChris Koerner (23:24.123)\r\nOkay.\r\n\r\n\r\nChris Koerner (23:33.721)\r\nYeah, yeah, yeah.\r\n\r\n\r\nChris Koerner (23:38.725)\r\nWhat about you know economics between you and the tree trimming company? Like what are they charging? What are they paying you?\r\n\r\n\r\nTyler (23:44.44)\r\nYeah, usually, so I price everything by a measurement of diameter of the stump. So if you take the widest diameter of the stump, you times it by $7 an inch is what I charge usually. I'll go above and below that just depending on a few things, but a lot of tree companies will charge a customer anywhere from like eight to $12 an inch and they'll keep the part up top. Early on, I was giving percentages\r\n\r\n\r\nof that $7 an inch back to the tree, tree company. But then I've been so good for the tree companies that I've worked for, like so reliable that recently I've just been like, Hey, $7 an inch is my price. If you want to take a cut, just charge, you know, upcharge. But I need the $7 an inch. And they've all been really cool with that.\r\n\r\n\r\nChris Koerner (24:16.785)\r\nMm.\r\n\r\n\r\nChris Koerner (24:27.653)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (24:33.539)\r\nOkay. And do you know what they're charging?\r\n\r\n\r\nNikolas Hulewsky (24:34.424)\r\nOkay, so the customers aren't paying you.\r\n\r\n\r\nTyler (24:38.476)\r\nCustomers aren't usually paying me directly. No, usually I get paid by the tree guy. Yep.\r\n\r\n\r\nNikolas Hulewsky (24:40.558)\r\nOkay, it's coming from there.\r\n\r\n\r\nChris Koerner (24:40.881)\r\nDo you know what per inch that they're charging?\r\n\r\n\r\nTyler (24:45.91)\r\nUsually like 10 to 12 bucks an inch, usually. And then sometimes, if it's a huge job, they'll a stump in for free. There's a bunch of things that they'll do, but usually the job will make up for that if they throw it in for free.\r\n\r\n\r\nChris Koerner (24:47.609)\r\nOkay, I guess you said that\r\n\r\n\r\nChris Koerner (24:57.713)\r\nWhen you go directly through the customer, are you charging 10 to 12 per inch? Okay.\r\n\r\n\r\nTyler (25:02.038)\r\nYeah, yes, yeah, absolutely. Usually I'll set it right around 10 when I'm going directly on a, if someone got my number.\r\n\r\n\r\nChris Koerner (25:09.275)\r\nHow? Go ahead, Nick.\r\n\r\n\r\nNikolas Hulewsky (25:11.342)\r\nwas just gonna say, have you started getting direct customer referrals at this point?\r\n\r\n\r\nTyler (25:16.406)\r\nYeah, yeah, some direct customer referrals every once in a while, like tree companies just don't even want to deal with the stump grinding lead if it's a pure stump grinding lead. So let's just shoot my number over to that customer and I'll get a call that way.\r\n\r\n\r\nNikolas Hulewsky (25:25.71)\r\nSo are you still paying zero dollars for marketing or are you starting to invest in that?\r\n\r\n\r\nTyler (25:30.712)\r\nI'm starting to invest a little bit in some marketing. SEO I've paid for actually the whole time. I have paid for, my friend runs a little SEO company out here. And so I've been investing in that and like the website a little bit, but outside of that, I'm playing with some Facebook group, direct marketing potentially I think could work. Yeah, playing with a few different things.\r\n\r\n\r\nNikolas Hulewsky (25:52.334)\r\nYeah, man. We've got many episodes on. Sorry, go ahead, Chris.\r\n\r\n\r\nTyler (25:58.818)\r\nTrust me, know. Ever listen to them all.\r\n\r\n\r\nChris Koerner (25:59.087)\r\nI was gonna say, how do you how important do you think your sales ability is to this being successful to someone or is it not that hard of a sale?\r\n\r\n\r\nTyler (26:08.544)\r\nnot that hard of a sale to the to the tree company if they don't like their guy or their renting or their machine just went down like they just need you. It hasn't been too hard. have, you know, put it there's been a few times where I'm like, that was that was me. Like I showed up to their office. They're like, yeah, we use this guy and we're really happy with them. And I hang out there for a little bit and talk to them. And by the end, they're like, Dude, you know what, like, we actually have a stump for you tomorrow or whatever. And those were\r\n\r\n\r\nChris Koerner (26:11.099)\r\nYeah.\r\n\r\n\r\nChris Koerner (26:33.52)\r\nMm-hmm.\r\n\r\n\r\nTyler (26:34.904)\r\ntimes that I used my sales ability, for the most part, it's a pretty easy sale.\r\n\r\n\r\nChris Koerner (26:40.113)\r\nOkay. And when it comes to a tree trimming business owner, what type of owner is most likely to use you? Is it someone that's that owns a machine and it keeps breaking down some of the rents and machines, someone that's already outsourcing it to your direct competitor.\r\n\r\n\r\nTyler (26:53.74)\r\nYeah, it's a mix between people that have rented and just have never found a guy they liked and someone that's tired of their sub. And then I'll get called like emergency wise when people's grinders go down a lot. Actually, guys that have told me no in the past, they'll hit my, you know, they'll call me and be like, our grinders down today, can you pick this up? So that's great too. Yeah.\r\n\r\n\r\nChris Koerner (27:01.093)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (27:13.934)\r\nHow are you doing the marketing? Do you have a CRM? Do you have a Google Sheet? How are you tracking? this is the tree trimming company I want to target. I followed up with them this many times. Because you can keep it in your head only so far. And then at a certain point, you've got to systematize it.\r\n\r\n\r\nTyler (27:28.844)\r\nYeah. Yeah. I have a Google sheet. I haven't put anything into like, I would love to get a full blown hub spot built out for myself eventually, because that's always what I use to detect companies. But currently it's all on a Google sheet with every text and email recorded that I've sent to these people. I'm starting like some cold email stuff, which has actually worked really well, because I don't think anyone in the history has marketed stump grinding through cold email to tree contractors. I really think I'm\r\n\r\n\r\nChris Koerner (27:57.681)\r\nand\r\n\r\n\r\nTyler (27:58.666)\r\nI'm breaking some ground there. And yeah, I don't know, that's worked really well.\r\n\r\n\r\nNikolas Hulewsky (28:03.82)\r\nWhat system are you using for job tracking, invoicing, collections, those types of things?\r\n\r\n\r\nTyler (28:11.192)\r\nSheets for all of that. I don't use anything else currently. Just still sheets. Calendar,\r\n\r\n\r\nNikolas Hulewsky (28:15.95)\r\nscheduling. dude, that's Chris. I mean, this is we talked about. Like that's what I love about people like you and Tyler and, these businesses. didn't spend the time to like put up your fancy CRM. You're not like, okay, I gotta have high level or I gotta have job or, this is my invoicing software. Like, no dude, I got Google sheets. I've been reaching out to people cause I went and scraped data and now I have their contact information and you just freaking went.\r\n\r\n\r\nTyler (28:41.698)\r\nYeah, I had.\r\n\r\n\r\nChris Koerner (28:42.159)\r\nIt's all, those are all friction to just actually launching the thing.\r\n\r\n\r\nTyler (28:46.156)\r\nYeah, I checked the other day actually, cause someone asked me, I had 30 K in revenue before I ever had like a website or domain or anything, which was awesome. Like I was like, that's, you know, that's pretty cool. so anyways.\r\n\r\n\r\nChris Koerner (28:55.089)\r\nIt's amazing.\r\n\r\n\r\nNikolas Hulewsky (28:57.614)\r\nWow, that's rad. So you didn't have a website until October? Was it because you were like, hesitant? Were you like, I don't want to like commit to this because I don't know if it's my thing yet. Or were you just like too busy to even think about it?\r\n\r\n\r\nTyler (29:01.314)\r\nYeah, till like October. Yeah, exactly.\r\n\r\n\r\nTyler (29:12.982)\r\nYeah, I was more on the side of like busy. was like, this is working. I don't really need more jobs right now. So let's just keep doing what's working and then we'll figure this out once it gets cold. And a lot of that's come since then.\r\n\r\n\r\nChris Koerner (29:24.177)\r\nSo your average job is 390. What does that look like? Is it one stomp, three stumps? Do they get discounts for multiple stumps?\r\n\r\n\r\nTyler (29:32.108)\r\nYeah, my average job is somewhere between one to two stumps, somewhere sitting there if you take them all. Now I've done like, I did 20 stumps for a city and they are all big stumps. That was like a $4,600 job. then you show up for minimums, my minimum is like 150. So anything below a certain size is just 150 bucks. Yeah.\r\n\r\n\r\nChris Koerner (29:51.089)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (29:56.206)\r\nIs there any removal? Like are you taking anything or is it you're just grinding and leaving it?\r\n\r\n\r\nChris Koerner (29:59.589)\r\nMm-hmm.\r\n\r\n\r\nTyler (30:02.328)\r\nAbout 70 to 80 % of my jobs are grinding goes what we call it. So you grind, you leave it in a nice pile. And then you tell the customer like, hey, use this in your yard, use this in your mulch beds, use this wherever, it's good stuff. And then the other 20, 30 % are like people that need it gone for some reason or the other. And that's why I do have a dump trailer for that reason. I don't have anything else to pick up the mulch besides the shovel and a wheelbarrow. So those jobs are a lot less fun.\r\n\r\n\r\nbut I do offer that and usually charge double if I need to do that. Customer never understands why it's double, but it's double because you have to go dump in the middle of the day. It's a lot harder, takes a lot longer. It's just, it's a lot harder of a job.\r\n\r\n\r\nChris Koerner (30:33.358)\r\nHmm.\r\n\r\n\r\nChris Koerner (30:39.825)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (30:44.174)\r\nwonder if there's any opportunity for that to take the mulch somewhere, right? Like have a relationship with a nursery or somewhere that you can sell the mulch to after.\r\n\r\n\r\nChris Koerner (30:51.109)\r\nYeah.\r\n\r\n\r\nTyler (30:54.562)\r\nI haven't figured out selling the mulch, but I've found at least places where I can dump for free at landscape yards, which has been nice. It's better and it's closer than the dump is here.\r\n\r\n\r\nNikolas Hulewsky (30:58.382)\r\nYeah, okay.\r\n\r\n\r\nYeah.\r\n\r\n\r\nChris Koerner (31:03.737)\r\nIsn't there a company called like mulch masters or something that like they're like middleman between tree trimming companies and consumers they like sell mulch. What are they called?\r\n\r\n\r\nTyler (31:11.767)\r\nYes.\r\n\r\n\r\nI forgot what they're called. It's like chip drop or something like that. Is that right? Yeah. So chip drops unique because they're kind of, what I have is mixed with dirt. If that makes sense. a tree company is chipping directly into the back of a truck. So it's pure wood chips. Mine is like a little dirtier landscape yards will take them though.\r\n\r\n\r\nChris Koerner (31:17.401)\r\nYeah, that's it. That's it. Is that not work for you?\r\n\r\n\r\nChris Koerner (31:27.432)\r\nokay. Yeah.\r\n\r\n\r\nNikolas Hulewsky (31:31.32)\r\nYeah.\r\n\r\n\r\nChris Koerner (31:32.314)\r\nYeah.\r\n\r\n\r\nChris Koerner (31:35.941)\r\nYeah. What now I'm curious that you said you listened to that 10 minute clip over and over and over. Now we're six, six months later now. What up in that 10 minute clip ended up just not being very relevant or helpful. And what in that 10 minute clip was just like gospel truth is still true today.\r\n\r\n\r\nTyler (31:53.772)\r\nYeah, on the top end of like where this could scale to, like I'm not, I don't want to put a limit on myself, but I remember, I think there were some numbers starting around like this could be a, you know, three, $4 million company. I it's hard for me to see that a future of that ever being the case, even if you grow up really smart, it's just, there's a lot of other options. People do own their own machines, big companies on their own machines. There's some limits to the market size there. but what was gospel was, you know, grabbing less from outscraper.\r\n\r\n\r\ncold texting with a really simple cold text and then just following up from there. And that's, that's what I did. I added a few like of my own unique flair. After every text I sent the day after I would just send, just following up on this with like an up arrow. And a lot of people are disorganized with their texts. So they see it just following up on this. They call me instantly because they're like, this guy's trying to give me business. And then I'll have them on the line. Like, dude, what's up? I'm a stump grinder. And they're like, you could tell they're like crap. shouldn't have called this guy.\r\n\r\n\r\nChris Koerner (32:33.476)\r\nMm-hmm.\r\n\r\n\r\nTyler (32:48.21)\r\nAnd yeah, but I already have them and so we built a relationship that way.\r\n\r\n\r\nChris Koerner (32:48.528)\r\nYeah.\r\n\r\n\r\nChris Koerner (32:52.315)\r\nSo I remember that three to $4 million number and that was based on how many tree trimming crews there were in greater DFW, which is like nine 50 and on getting like 5 % of them. And I just Googled like what the greater Provo or in Lehigh Metro population is 733,000. So DFW is exactly almost exactly 10 times more than that. Do you think this could be a three to $400,000 business? If so, then three to 4 million in DFW could still be accurate.\r\n\r\n\r\nTyler (33:12.886)\r\nYep.\r\n\r\n\r\nTyler (33:19.16)\r\nThere you go. 100%. And to be fair, I do service Salt Lake County too. I service Salt Lake County less than I service Utah County. So together between the two counties, it's like 1.7 million people-ish. yeah, no, I think this could definitely be a $300,000 to $400,000 company here for sure. I think it could be $500,000, $600,000, $700,000. No doubt. I was just saying like top level. like, I don't know. Maybe it could. But I just don't know. Yeah, there you go. Exactly. Exactly.\r\n\r\n\r\nChris Koerner (33:23.876)\r\nOkay.\r\n\r\n\r\nChris Koerner (33:30.289)\r\nCheers.\r\n\r\n\r\nChris Koerner (33:33.681)\r\nand\r\n\r\n\r\nChris Koerner (33:44.047)\r\nYeah. You moved to Dallas.\r\n\r\n\r\nNikolas Hulewsky (33:48.024)\r\nWell, it couldn't be that by yourself, but if you started getting other people to grind for you, then that potentially used to go. How do you view this business? Do you think this is the business Tyler's gonna be doing five years from now? Or was this a cool experiment that has now given you confidence to become an entrepreneur and do other things?\r\n\r\n\r\nTyler (33:54.122)\r\nAbsolutely.\r\n\r\n\r\nTyler (34:09.208)\r\nMore in the B camp. It will be what I'm doing for the next few years for sure But it what I consider it to be is a cash-heavy business that allows me to learn business at a really really low level of risk Like really low now at this point. There's pretty much no risk in my day to day and then I sit back and I Do a ton to learn as much as I can about other business models and do other do other things outside of just stump grinding now\r\n\r\n\r\nWith that being said though, I do want to push and see where it can go because what I do at that point where I go pursue something maybe a little bit bigger or that has some bigger tam to it than stump grinding, what I do in the next few years will decide what I do with this business. Can I try to sell it? Can I try to put my brother in as the owner operator or as an operator and still take checks from the company? There's a lot of options. So really most of my day to day is focused on pushing it as far as I can, but I do think.\r\n\r\n\r\nat some point I will want to move to something a little bit bigger.\r\n\r\n\r\nChris Koerner (35:10.489)\r\nI'm like so tempted right now to just go start this business. That's awesome. Like I won't, but here's my question is if you were to wave a magic wand and get every single tree trimming business in your market, all 1.7 million people, every tree trimming business owner on the phone and give them your best shot and then follow up as you do with all of them. what percentage of them do you think you could get as a customer?\r\n\r\n\r\nTyler (35:14.88)\r\nYeah, it's fun.\r\n\r\n\r\nTyler (35:38.134)\r\ngood question. Probably 20 to 25 percent I think would be maybe 30 percent would be right around there.\r\n\r\n\r\nNikolas Hulewsky (35:46.734)\r\nHmm, higher than I thought.\r\n\r\n\r\nChris Koerner (35:47.717)\r\nWow. So, and you think five to 25 grand a year top line from each of them is realistic.\r\n\r\n\r\nTyler (35:48.8)\r\nI really think I could do 30%.\r\n\r\n\r\nTyler (35:55.776)\r\nYes, it just depends on the size. yes, yeah, there's some, it could even be bigger, to be honest, if you get a huge company, but those guys run like two to three grinders and just don't need me.\r\n\r\n\r\nChris Koerner (36:01.701)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (36:05.937)\r\nYeah. Okay. So let's, let's be conservative here because we know that there's about one tree trimming business for every 10,000 people. So if you're in a city on an Island, you know, a hundred thousand people, there's going to be 10 tree trimming business businesses. Let's say that someone isn't as good at selling as you, and they can only close 20 % of them. That's going to be two. Um, let's say five to 25,000 per year. Let's be conservative and say $10,000. So theoretically in a city of a hundred thousand, you would do\r\n\r\n\r\n$20,000 a year top line, or does that sound like too low, like too conservative?\r\n\r\n\r\nTyler (36:39.532)\r\nNo, that sounds about right. Yeah, that sounds about right.\r\n\r\n\r\nChris Koerner (36:41.124)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (36:41.422)\r\nHow many true trimming companies are there in the 1.7 million, I guess, Metroplex that you're operating in?\r\n\r\n\r\nTyler (36:47.928)\r\nI don't have an exact number. I know my data scrape pulled like 500 plus. But yeah, some of those duplicates and stuff in there too.\r\n\r\n\r\nChris Koerner (36:52.785)\r\nMmm.\r\n\r\n\r\nIt's like one in 5,000. I remember Nick, when we did this research for tree trimming, we didn't like Provo because Dallas was one in 10,000. Provo was one in 5,000 people. So it was good for you.\r\n\r\n\r\nTyler (37:07.932)\r\nYeah and there's less tree coverage too here than in Dallas. If you compare them directly there's a few less trees here just a little bit drier.\r\n\r\n\r\nChris Koerner (37:11.793)\r\nMm-hmm\r\n\r\n\r\nChris Koerner (37:20.943)\r\nWhat last question, what is the exact making model of your grinder and would you recommend it to others?\r\n\r\n\r\nTyler (37:27.788)\r\nBandit 2550, yes, I would definitely recommend it to others. It's a great, you have to get to a certain amount of horsepower that you're dangerous in the industry. Cause if you're at the low horsepower that people could rent the same machine, it's like, would we do that? You know what I mean? But then there's, there's top levels that are way bigger than mine. That would be awesome to have. They're just come with about double the price point. So it's a, it's a great middle ground, but I always tell guys, Hey, go find\r\n\r\n\r\nChris Koerner (37:42.927)\r\nYeah.\r\n\r\n\r\nTyler (37:56.3)\r\nthe dealerships in your area, cause there's four brands and there's really not always four dealerships for each, you know, a brand for each dealership in your area. So dealership support is important in some granny because these things take a beating and you're going to need, you're going to need to replace things on them. So, I always tell people that.\r\n\r\n\r\nChris Koerner (38:02.149)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (38:13.623)\r\nWhat advice would you give to somebody who's thinking about doing this in their local market?\r\n\r\n\r\nTyler (38:17.912)\r\nYeah, I would tell them to go listen at first podcast. I would tell them to go listen to this. And then I don't want to shout. Can I shout other people's podcasts on here? Is that okay? Okay. I don't want. Okay. Yeah. Perfect. Perfect. Um, the, yeah, exactly. Um, Austin gray, he's big on Twitter as well. He runs owner operator podcast. Uh, he interviewed me there and I, we went really into detail about like the, the, the small things in the business, uh, because he runs a, you know, land.\r\n\r\n\r\nChris Koerner (38:25.775)\r\nYes, of course, of course. Say whatever you want. It's not going to be in there.\r\n\r\n\r\nNikolas Hulewsky (38:27.694)\r\nYeah, we'll bleep it out.\r\n\r\n\r\nTyler (38:46.552)\r\nclearing heavy machinery business as well. So that's awesome. And then, you know, I'll plug my own stuff. I don't talk about this at all, but I do have a lot of people now. No, not a community, not a course. No, no. Well, I guess it is, it is a PDF. There you go. Yeah.\r\n\r\n\r\nNikolas Hulewsky (38:55.662)\r\nA Of course.\r\n\r\n\r\nChris Koerner (38:57.905)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (39:02.958)\r\nYes. Well, okay. It's kind of a, keep going.\r\n\r\n\r\nChris Koerner (39:04.561)\r\nThere it is.\r\n\r\n\r\nTyler (39:08.184)\r\nYeah, no, it's, I have gotten a little bit of a following on Twitter. So I have a lot of people ask for phone calls and stuff like that. And one week, I think I hopped on like 15 phone calls and I was like, what am I doing with my week? And so I put together this 84 page PDF. It's like, it's a no brainer price. It's like 149. My average job is 390. So if you ever land a stump grinding job, you will pay for the PDF. And that's what I'd recommend too, because I put some stuff on there that's\r\n\r\n\r\nA lot of it's from the original podcast with you, Chris, but then there's a lot of like stump granny-specific stuff on there that's just super niche.\r\n\r\n\r\nNikolas Hulewsky (39:44.43)\r\nChris, what percentage did we get from that?\r\n\r\n\r\nChris Koerner (39:44.753)\r\nThat's amazing.\r\n\r\n\r\n89%. That's what we talked about.\r\n\r\n\r\nTyler (39:49.592)\r\n89. Yeah. Yep. Exactly. Gumroad gets the other five and then I'm left with like four and a half percent there. It's perfect.\r\n\r\n\r\nNikolas Hulewsky (39:49.614)\r\nWe got 89 % okay cool cool cool cool cool cool cool cool cool. Yeah yeah yeah. Dude Tyler nice work man. This is awesome. Stoked for you.\r\n\r\n\r\nTyler (39:59.608)\r\nThank you guys. appreciate it. I just wanted to say real quick, like I have listened to every episode of both of your podcasts. So I'm not just saying that. am really, this is awesome. I just really appreciate being here and meeting you guys. know it's kind of sounds funny, but it's like meeting. I'm excited about it this morning. So.\r\n\r\n\r\nChris Koerner (40:06.939)\r\nWow. Thank you.\r\n\r\n\r\nNikolas Hulewsky (40:14.466)\r\nI would, I will. Okay. I would ask you whose podcast you like better, but I don't want to have my feelings hurt.\r\n\r\n\r\nTyler (40:24.664)\r\nI listened to Chris's first because I saw tweets from Chris earlier and then now I've caught back. I've caught up on both so.\r\n\r\n\r\nChris Koerner (40:25.965)\r\nask. Don't ask.\r\n\r\n\r\nNikolas Hulewsky (40:29.271)\r\nNah.\r\n\r\n\r\nChris Koerner (40:30.159)\r\nHe I'm his first love.\r\n\r\n\r\nNikolas Hulewsky (40:32.152)\r\nYou're good. You're good. Dude, congratulations. Can't wait to check in with you in a year, my friend.\r\n\r\n\r\nTyler (40:37.4)\r\nThank you guys, appreciate it. Thank you, have a good day.\r\n\r\n\r\nChris Koerner (40:37.797)\r\nThank you, Tyler. This is awesome. You're awesome. See ya.",
  "metadata": {
    "duration": "",
    "date": "2025-03-07",
    "platform_source": "Google Drive"
  }
}