{
  "episode_number": "155",
  "episode_title": "Can AI Replace Your Sales Team? I Tested It with John Long",
  "guest_name": "John Long",
  "business_name": "think.ai",
  "transcript": "﻿Nikolas Hulewsky (00:00.142)\r\nAlright, John, I'm stoked to learn something from you today. I think I'm gonna learn a lot. Tell me really quickly, what's your business?\r\n\r\n\r\nJohn Long (00:09.858)\r\nYeah so I'm one of the co-founders of think.ai T H Y N K dot A I and we provide businesses with AI agents that can help automate processes for them. Our agents can make and receive phone calls and receive text messages emails hold meetings schedule meetings interview people variety of things. And so we help.\r\n\r\n\r\nautomate processes that involve communication typically with customers or sometimes internal communications as well.\r\n\r\n\r\nNikolas Hulewsky (00:41.562)\r\nOkay, I'm really excited to check this out because there's a lot of talk from people who are like, AI is coming, AI agents are here. I've played around with operator and different agents. Usually when people talk about agents right now, it's like robotic process automations that have been rebranded as agents. But I'm excited to see what you've put together. And you're not just an entrepreneur who's using AI, you're an entrepreneur who has a company that helps entrepreneurs use AI. So it's kind of pretty meta.\r\n\r\n\r\nJohn Long (01:06.552)\r\nYeah, and we use the AI to build our business, right? And so we are our first customer. We use what we sell and it works to help put us in touch with people. So it's awesome.\r\n\r\n\r\nNikolas Hulewsky (01:10.148)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (01:20.624)\r\nDude, that is awesome. All right, so let me ask you the first question that I ask everybody. What models do you use and for what purposes?\r\n\r\n\r\nJohn Long (01:28.994)\r\nYeah, so we use a variety of different tools. When you say what models, that's kind of LLM type of a question, which is great. We do use ChatGPT on the back end. We're using 4.0 for some of our conversational things. But I mean, in our business, we're in Perplexity. We use Cloud occasionally, ChatGPT, a variety of different algorithms.\r\n\r\n\r\nNikolas Hulewsky (01:35.448)\r\nYeah, I'll ask it a bit. I'll ask it another way. Yeah.\r\n\r\n\r\nNikolas Hulewsky (01:55.48)\r\nAre there different use cases you've found that are better for some than others?\r\n\r\n\r\nJohn Long (02:01.101)\r\nYes, a little bit. I'm a chat GPT user. It knows me well. I've been using it for a long time. so I don't, you my prompting there is pretty easy because I can ask it something and it knows so much background about me that it's able to answer so much about my family, about my business, about, you know, the way that I operate in life, et cetera. You know, if we...\r\n\r\n\r\ngosh if we were trying to do we have a we have an AI podcast that's completely AI. We use notebook LM for that. I don't know if you're familiar with that. That's a Google product. And so that's more of just kind of a fun thing that we do. We actually were using it to stay up to date on all of the things going on in the world of AI. And we were like well we're making this. Why don't we publish it. And so you know we use that. We don't do a lot of coding. My business partner is more on the operation side so he gets\r\n\r\n\r\nNikolas Hulewsky (02:54.778)\r\nWill you?\r\n\r\n\r\nJohn Long (02:57.668)\r\ninto that a little bit more and he, I think he uses perplexity a lot more than he's using chat GPT.\r\n\r\n\r\nNikolas Hulewsky (03:02.768)\r\nOkay. Yeah, I've heard, I've heard generally speaking, these are the use cases. Chat CPT is used as a general thought partner to sort of ideate with. Claude is used a lot by coders who are writing code. Perplexity is used a lot for research because of the real time access to the internet. I'm trying to think, Gemini is used when people are trying to tie the Google suite together. So like there's a whole, that I'm seeing so far is like, oh, these are kind of the general use cases.\r\n\r\n\r\nthat people use for these items. Notebook LM is interesting though. You're the first person to talk about Notebook LM. I've personally used Notebook LM for my podcast because what I've found is, I'm gonna use words I don't know, so you'll correct me. But it's kind of like a closed sandbox in the sense that I don't get a lot of hallucination when I ask it to go and pull a transcript and maybe do an analysis for me or write a summary. Whereas with ChatGPT, I'll get a lot of hallucinations unless I'm very specific with my prompt. What do you use Notebook LM for?\r\n\r\n\r\nJohn Long (04:00.878)\r\nSo we, like I said, we have a podcast that we produce. It's a weekly podcast. It's on the news of the AI agents, or of the AI world. And so we collect recent publications, news stories, et cetera. We load all of that into Notebook LM, and then we use its podcast feature to create a podcast that we publish every week.\r\n\r\n\r\nNikolas Hulewsky (04:23.184)\r\nI haven't seen the podcast feature. No, that's not true. I have seen the podcast feature. I've never used it though. Is it good?\r\n\r\n\r\nJohn Long (04:29.208)\r\nThat's pretty cool. Yeah. Check it out. Yeah. Yeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (04:32.707)\r\nDid you clone your voice for it, or is it using its own?\r\n\r\n\r\nJohn Long (04:35.662)\r\nWe have it just using its own. can clone your voice and you can actually come in as a guest on the podcast and the AI host will interview you. there's a lot that you can do with it. But we use kind of the basic features of it. And again, normally, initially we started using it just to help us stay up to date on all of the happenings in AI. This industry is moving so fast. It's a little crazy, right? And then we were like, let's just share this. Why not?\r\n\r\n\r\nNikolas Hulewsky (04:45.808)\r\nThat's rad.\r\n\r\n\r\nNikolas Hulewsky (05:04.036)\r\nHow is the podcast done? I'm so curious.\r\n\r\n\r\nJohn Long (05:06.99)\r\nWhen you say how is it done, I'm not sure if I understand your question.\r\n\r\n\r\nNikolas Hulewsky (05:09.016)\r\nYeah, like how many downloads do you get a week or how many listens or how many people are?\r\n\r\n\r\nJohn Long (05:13.688)\r\nGosh, you know what? I don't even pay attention to those numbers. So I honestly don't know. I apologize, Nick. I should know those numbers.\r\n\r\n\r\nNikolas Hulewsky (05:20.4)\r\nYou don't have to apologize. You apologize for not knowing your numbers. I'm just curious, are you looking at it as like a potential funnel or is it just, hey, this is cool. Why don't we just put this out there?\r\n\r\n\r\nJohn Long (05:31.118)\r\nYeah, a little bit of a funnel, but not something that we really push a lot of content to or market in any way. And so I think it's something that we mention in a newsletter that we send out to our email list each week just as a giveaway.\r\n\r\n\r\nNikolas Hulewsky (05:50.522)\r\nYeah, that's cool. I like that. So talk to me about Think. Think.ai. You said it helps business owners automate their business. does that mean?\r\n\r\n\r\nJohn Long (06:00.962)\r\nYeah, so I'll tell you the history and that will help explain what we do and what our AI agents actually do. So my business partner and I had spent a number of years in technology and in sales and for years have talked about, hey, we need to go on our own. We need to go on our own, start our own thing. And so...\r\n\r\n\r\nAbout a year and a half ago, we started going down that road more earnestly with a technology that was in the physical security space. And as we were starting up that company, said, gosh, AI is really coming on. Wouldn't it be cool if we could find an AI solution that could help replace the pre-sales motion, right? The prospecting and the qualifying of leads, warming things up, discovery calls, et cetera. And wouldn't it be awesome if it just put appointments on our\r\n\r\n\r\non our calendar with prospects that had already gone through a little bit of a filtering process. We're qualified, exactly. And we looked and looked and looked and looked. Couldn't find anything that did everything. We found tools that would do the texting and automate the texting, but it wouldn't do the phone calls or technology that would do the phone calls, but it wouldn't do the emails and nothing that did everything.\r\n\r\n\r\nNikolas Hulewsky (06:58.692)\r\nor qualified to some extent. Yeah.\r\n\r\n\r\nJohn Long (07:19.926)\r\nAnd so we did a lot of research. We found bits and pieces of different tools. We put them all together, put together an automation using a CRM high level automation backend, and we built it.\r\n\r\n\r\nand initially built it for us to use. And then as we started to recognize, hey, this is actually a pretty cool tool, we said, this could be a business. Maybe this is something that we should actually be pushing. And so we pivoted away from the physical security side and went all in on AI. And that's what we've been doing now for about the last eight months or so.\r\n\r\n\r\nNikolas Hulewsky (07:52.784)\r\nSo it started as a sales assistant, I don't know the right word, but for the sales process, is it strictly sales still or have you expanded outside of sales?\r\n\r\n\r\nJohn Long (08:01.496)\r\nSo it can do a lot more than that. The same platform is used, but it can do customer service, can do HR. A month or so ago, we used it to conduct like 60 or 70 interviews for us as we were going through a hiring process. So it can be used to do a number of different things, but anything related to communications.\r\n\r\n\r\nNikolas Hulewsky (08:21.488)\r\nyou still using other technology and this is a wrapper for it or have you developed your own text to speech model?\r\n\r\n\r\nJohn Long (08:29.08)\r\nSo it's a mixture of things. So we're using other technologies underneath the hood. But we've been able to stitch all of those together and have them work in a unified kind of omnichannel fashion.\r\n\r\n\r\nNikolas Hulewsky (08:44.534)\r\nSo it's interesting. I used air.ai a couple of years ago when it first came out and it was cool. was a really, like you knew the future was coming, but there was still kind of a lag. It didn't feel great. Has it progressed? Has it gotten a lot better or is it still lagging? Like do you have to tell them upfront, for example, hey, this is an AI agent that you're talking to.\r\n\r\n\r\nJohn Long (08:48.386)\r\nYep.\r\n\r\n\r\nJohn Long (09:07.608)\r\nYeah, so it depends on the person. We have people, in fact, we had someone just the other day on one of the phone calls. He had been on with our AI for like five minutes and he goes, wait a second, is this a human or is this AI? And we've trained our AI, you sometimes people say, just.\r\n\r\n\r\nlie, tell them it's a human, right? And we don't do that. We're very upfront with people. And so the agent said, yeah, I'm an AI agent designed to help answer your questions about Think. And the guy was just blown away. You could hear over the phone him kind of gasp and go, my gosh, you are the best AI I've ever met.\r\n\r\n\r\nNikolas Hulewsky (09:39.77)\r\nThat's awesome.\r\n\r\n\r\nJohn Long (09:41.282)\r\nSo that was cool, but it is still AI. You still have latency issues sometimes where it pauses a little bit longer than maybe is natural or it comes in a little bit sooner than is natural. That's getting better. There are models out there right now that it is very difficult to tell. And so we're watching those very closely. And as those get tested to the point where we're comfortable, we'll continue to upgrade and make it better and better.\r\n\r\n\r\nNikolas Hulewsky (09:48.524)\r\nhuh.\r\n\r\n\r\nNikolas Hulewsky (10:06.224)\r\nSo that hasn't really been an issue for you, the AI component to it.\r\n\r\n\r\nthat's surprising to me. Cause the few times that like I tested it out as a cold collar where we were cold calling mobile home parks off market and then other businesses off market and, people hated it. Well, I shouldn't say that it was very polarizing. Some people were like, this is cool. Yeah, we'll talk to it. And then other people were like, click. Once they realized it was an agent. so that it surprises me to hear that like, it's not an issue for your sales teams to have that first call go through an AI agent.\r\n\r\n\r\nJohn Long (10:42.734)\r\nNo, it's not. And in fact, it's awesome to watch. You can see as leads come in and the AI agent starts to engage. It'll call them, it'll text them, it'll email them, and it'll have this conversation. And as that conversation progresses, you can literally watch on the back end as that happens and see this conversation emerge. And the agent is masterful at getting people to eventually book an appointment with us.\r\n\r\n\r\nNikolas Hulewsky (11:10.372)\r\nYeah, I guess if the first interactions with it are text-based, that's very different than the latency issues that might come from having a conversation with them, right?\r\n\r\n\r\nJohn Long (11:19.746)\r\nYeah, and ours does call. if someone responds to one of our marketing pieces, our agent will call them. That is our first outreach call and text. And so we don't hide from a phone call by any means. It's great.\r\n\r\n\r\nNikolas Hulewsky (11:35.216)\r\nDo you track do you track metrics that are like, hey, human versus AI, these are the conversion stats, maybe to show that there is or isn't any difference between the two?\r\n\r\n\r\nJohn Long (11:47.214)\r\nSo we... Yeah, I mean, we're 100 % AI. And so we don't necessarily have the ability to compare like this half of the house is AI and this half is human.\r\n\r\n\r\nNikolas Hulewsky (11:58.869)\r\nRight. But there's probably some like industry standards or benchmarks that you can compare against, right?\r\n\r\n\r\nJohn Long (12:04.046)\r\nSo I actually, I came across a really interesting, it's perfect timing, I came across a really interesting study that was published by Harvard. And they did a study with Procter & Gamble. I just saw this this morning. They studied, I think it was 776 people at Procter & Gamble. And they had individuals using AI, individuals working by themselves, teams using AI, and teams working by themselves. And the individuals using AI,\r\n\r\n\r\nNow this isn't exactly phone call only. was, you know, using it in other areas as well. But the individuals using AI were happier, produced as high or higher quality of work as the teams working by themselves, or without AI, by themselves. And then the teams working with AI were like,\r\n\r\n\r\nNikolas Hulewsky (12:55.437)\r\nshoulders.\r\n\r\n\r\nJohn Long (12:56.012)\r\nmultitudes better than the teams working by themselves. So that was one of the first like truly, you know, research-based studies from a very reputable non-AI entity on the effectiveness of AI. And it was fascinating to see. mean, what it proved was AI absolutely should be a team member.\r\n\r\n\r\nNikolas Hulewsky (12:58.8)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (13:24.72)\r\nMm-hmm.\r\n\r\n\r\nJohn Long (13:24.79)\r\nnot necessarily replace the team, but have it be a team member and you'll instantly elevate your team to levels that you haven't seen before.\r\n\r\n\r\nNikolas Hulewsky (13:32.528)\r\nThat's awesome. What have you found amongst your customers? Is there kind of like an ideal customer that this works for? Like, home services with a sales team or tech companies with a sales team, or is it not even sales related? That's the best use case for it.\r\n\r\n\r\nJohn Long (13:45.934)\r\nSo it doesn't have to be sales related because that's where we came from. That's kind of where our focus has been. And so really our ICP customers have three characteristics. Number one, they have processes that they follow, right? So they're...\r\n\r\n\r\nThey're mature enough in their business that they have an ABC sort of a process that they go through. Number two, they have people helping with those processes right now that could be better utilized elsewhere. And so people and then number three, they are spending money on those processes. They're spending money on marketing to bring leads in or they're spending money on, you know, moving things through those processes. Right. We can help in those areas. We can help reduce costs. We can help reduce time and we can help\r\n\r\n\r\nprocesses move more smoothly.\r\n\r\n\r\nNikolas Hulewsky (14:31.152)\r\nThat's an interesting framework because you're not just saying, hey, anybody that has sales in their business, you can use our AI agent, right? Like you've got a pretty defined customer. And from everything that you just said, my guess would be like, that's a company that's at least a million dollars. You maybe there are some that are less than that, but these are companies that have some infrastructure, some leadership that are putting real dollars behind it. And they're probably, from your perspective, they're going to be more successful because they have developed.\r\n\r\n\r\nInternal systems though, whereas smaller companies, you know, they see these solutions all the time They're like, this will be the fix and they implement it, but they don't actually have any systems They don't actually know how to utilize it and they they're not set up for success\r\n\r\n\r\nJohn Long (15:12.364)\r\nNow, that being said, we work with a number of customers that this is becoming the process, right? They didn't have a process, but AI and their use with little.\r\n\r\n\r\nthe things that we're providing has become their process and that still works very well. And so if you have a, you know, a smaller home services company, I, I've been kind of a serial entrepreneur a little bit like you, Nick. I owned a heating and air conditioning company at one point. And, know, I know how it is when you're busy, when you're running and the phone rings, you know, I've got to answer that call or I'm going to miss an opportunity. I'm going to miss the next job, but sometimes you can't, if you've got your hands stuck inside a furnace or if you're, you know,\r\n\r\n\r\nalready on a call with customer number one and customer number two is calling at the same time and you sometimes just run out of capacity and that's where something like an agent can step in and you know with our agent you could have 300 calls come in at 5 a.m. on Christmas morning and every call will get answered every call will be personalized to the person that calls appointments would be scheduled you wouldn't lose it anything right and it could all happen at the same time\r\n\r\n\r\nNikolas Hulewsky (16:20.346)\r\nYeah, I talk about this a lot. The first, in my opinion, big hurdle that entrepreneurs face or challenge as they're growing their business is the ability to systematize and then effectively communicate that system. Many entrepreneurs get to the point where like they're only ever a one man shop or one woman shop. I mean, that's okay if that's what they want to be. But if you want to grow, you have to be able to create a system and then scale. So maybe that's the better criteria for you is like, Hey, you have\r\n\r\n\r\nYou have to some systems or least willingness to systematize in order to use this.\r\n\r\n\r\nJohn Long (16:52.43)\r\nIt really is the difference between owning a job, right? There's a lot of people that simply own a job, right? They own a heating and air conditioning company, but really it's just a job. They are a technician and the calls happen to come to them and they do the work. And then owning a business where you have that structure that you described, right?\r\n\r\n\r\nNikolas Hulewsky (16:58.437)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (17:11.3)\r\nYep. Totally. Yeah. And one of the things is I've been thinking about AI that I talk about a lot is bringing on these AI agents or bringing on these AI solutions. They're like an employee and you need to treat them like an employee. need to have very clear expectations, job. What's the word I'm looking for? Job expectations, job descriptions. There we go. And then like a very clear onboarding process, quality.\r\n\r\n\r\nJohn Long (17:30.83)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (17:37.186)\r\ncheck-in, performance management. Like you don't just set it and forget it because if you do, it's not going to work out. You have to be very clear with what you're expecting from them because then they, you'll get more out of them by being clear. But many people don't treat them as employees. just like, well, it's just solution. It's technology. It should just work.\r\n\r\n\r\nJohn Long (17:52.45)\r\nWell, and it's a lack of understanding. And I don't mean that in a bad way. It's just, this is new, right? And people need to understand that while AI could be a silver bullet for their business, it's not a silver bullet that doesn't need training.\r\n\r\n\r\nNikolas Hulewsky (17:57.008)\r\nFor sure.\r\n\r\n\r\nJohn Long (18:07.562)\r\nand guidance and direction, right? Can AI revolutionize businesses for people? Absolutely. You you've got a lot of entrepreneurs that watch these podcast episodes and they're looking for that thing to set them free. And AI may be exactly that, but it doesn't set itself up, right?\r\n\r\n\r\nNikolas Hulewsky (18:07.64)\r\nYeah. Totally.\r\n\r\n\r\nJohn Long (18:25.646)\r\nAnd so you still have to provide kind of that structure. A lot of times when we teach people about AI, we teach them the 1080 10 principle. And maybe you've heard this before, but the first 10 % has to come from the humans, right? The setup, right? The structure, the direction, the, you know, the end goal that you're that you're shooting for the middle 80 % can come from AI and it can do it very, very quickly. And it can do it at a very, very efficient way. But then the last 10%, that\r\n\r\n\r\npolishing step, that final product still typically has to come from humans, right? And so especially in, you know, if you're using like an LLM or, you know, a generative AI type of product, agentic agents tend to get a little closer to that hundred percent mark on the back end, but they've been really well polished before they can get to that point.\r\n\r\n\r\nNikolas Hulewsky (19:20.336)\r\nYeah. I freaking love that. I love that framework. 108010. I've never heard that before, but it makes total sense. You have to prompt it, train it the right way, let it do its work. And then you still have to do something on the backend in order to make sure that it's producing the type of output that you want it to produce. But that framework, the 108010, that's, I love that, John. I freaking love that. Can I try out your software? Heck yeah,\r\n\r\n\r\nJohn Long (19:40.322)\r\nYeah, well, steal it, use it.\r\n\r\n\r\nJohn Long (19:46.242)\r\nYeah, you want to do it? Let's try this. Okay. All right. So let's have you go to our website. So go to think th y n k dot AI.\r\n\r\n\r\nAnd when you go there, you'll see we're up in the upper right hand corner. Go ahead and put your information in there. And then while you're doing that, I'm going to share my screen.\r\n\r\n\r\nNikolas Hulewsky (20:01.348)\r\nTest our AI.\r\n\r\n\r\nJohn Long (20:09.703)\r\nAnd.\r\n\r\n\r\nJohn Long (20:13.868)\r\nSee, I wanna share my entire screen.\r\n\r\n\r\nJohn Long (20:21.612)\r\nLet me know when you get that in. Now, Nick, what's going to happen is our agent's going to call you in about 30 seconds. Don't answer your phone and I'll walk you through a little bit of process with it here.\r\n\r\n\r\nNikolas Hulewsky (20:32.954)\r\nOkay, so I'm gonna say I'm ready to test AI.\r\n\r\n\r\nNikolas Hulewsky (20:38.192)\r\nAnd then I'll keep an eye on my phone. I always put on Do Not Disturb, so I'll even take it off Do Not Disturb.\r\n\r\n\r\nJohn Long (20:45.292)\r\nAnd so what I'm going to do is I'm going to show you on the back end here.\r\n\r\n\r\nJohn Long (20:52.878)\r\nOh, it said stop sharing. Why is that doing that? Okay. I'm going to show you on the back end. So here we can see that you've come in.\r\n\r\n\r\nNikolas Hulewsky (20:55.706)\r\nI see your screen still.\r\n\r\n\r\nNikolas Hulewsky (21:01.804)\r\nProvo, Utah. SkyNet is calling me. my gosh.\r\n\r\n\r\nJohn Long (21:04.012)\r\nYeah, SkyNet. So here you can see on the back end, again, this is a high level CRM and this CRM comes with our agent. You do not have to use it, but a lot of companies love high level as a CRM. We can connect with any CRM system that they're using, but here we can see it sent you a text message, it sent you an email. Okay, so we can see.\r\n\r\n\r\nNikolas Hulewsky (21:26.32)\r\nOh yeah, yeah, yeah. Hey Nicholas, this is Eric over at Think AI. And then there's his AIL pitch.\r\n\r\n\r\nJohn Long (21:30.956)\r\nSo go ahead and respond to that text message, Nick, and just ask him a question. Ask Eric anything you want about AI. Sure.\r\n\r\n\r\nNikolas Hulewsky (21:37.346)\r\nAnything I want about AI. Eric, is that your real name?\r\n\r\n\r\nJohn Long (21:43.224)\r\nHahaha.\r\n\r\n\r\nSo we're going to see that pop in here. So here it is. Here's your question. Eric, is that your real name? So you're going to see this on the back end. Now, Eric could respond instantaneously. He could call you as soon as you hit that button a second ago. But we've trained this to say, wait a little bit. Give it a 30 second pause to feel a little bit more human-like, right? And so the AI is automatically updating this opportunity from a new lead to responded to show in our system that,\r\n\r\n\r\nNikolas Hulewsky (21:49.885)\r\nI'm watching the workflow on the backend. this is pretty cool.\r\n\r\n\r\nNikolas Hulewsky (22:06.444)\r\nYeah.\r\n\r\n\r\nJohn Long (22:15.226)\r\nAll right, we got a live one here, right? Nick is engaging with us. He's interested. And so here in just a second, we're going to see a text pop back in from Eric responding to you. So here he said, and this is probably hitting your phone right about now, know, absolutely, Nicholas. Eric is my real name here at Think.ai. I'm here to help you explore our AI solutions and how they can benefit your business. What sparked your interest in AI? And you can see he's already starting to engage in the conversation.\r\n\r\n\r\nNikolas Hulewsky (22:41.786)\r\nI'll respond, I'll respond. I'm looking for an after hours solution to handle my inbound calls.\r\n\r\n\r\nJohn Long (22:51.118)\r\nPerfect.\r\n\r\n\r\nNikolas Hulewsky (22:52.72)\r\nI don't know if you do that, but that's just what I said.\r\n\r\n\r\nJohn Long (22:55.49)\r\nYep, absolutely. Well, let's see what Eric says. We'll let Eric answer. I don't want to answer for him. I'm going to let Eric tell you what he can do, okay?\r\n\r\n\r\nNikolas Hulewsky (22:58.084)\r\nYeah. Yeah, Eric. If Eric doesn't do well, I'm worried about him. You're not going to fire Eric if he messes up, are you,\r\n\r\n\r\nJohn Long (23:06.764)\r\nWell, we'll see. He knows he's being watched. So I bet he's going to be on his best behavior right now.\r\n\r\n\r\nNikolas Hulewsky (23:10.7)\r\nNoses.\r\n\r\n\r\nNow when you trained Eric, is it Eric every time or is it like randomized Eric and Sarah and Lauren?\r\n\r\n\r\nJohn Long (23:20.214)\r\nSo for us, it is Eric every time. And here he's responding to you. But you can have different agents. And each agent has a directive or an objective that it's trying to achieve. Eric's objective is to qualify people and then schedule them for a sales meeting with us. But you can have agents that will then, you know,\r\n\r\n\r\nEric could potentially qualify you as a sales target and then pass you to a sales agent whose job is to pitch you on our products and sell you. We have you go to a live human at that point, but we could go from one agent to another if we wanted to as well.\r\n\r\n\r\nNikolas Hulewsky (23:51.322)\r\nSo this is.\r\n\r\n\r\nNikolas Hulewsky (23:56.346)\r\nSo this is interesting, right? He sends me the first message. I troll him, Eric, is that your real name? And he's like, yeah, it's my real name. What can I help you with? So then I tell him my problem set. Hey, I'm looking for after our solution. And he responds. But the cool thing about the last response is not just let's set up a call. It's, tell me a little bit more about your specific challenges. Like he's further qualifying me as opposed to just sending me straight to a person, which feels less scary, right? Like it feels less like I'm getting.\r\n\r\n\r\nhard sold.\r\n\r\n\r\nJohn Long (24:25.838)\r\nSo let's do this then, Nick. Let's up the game here a little bit. Go ahead and send Eric a text and just say, hey, can you call me or call me back or something like that? And then when he calls you, go ahead and answer this time. I'll be quiet so that you can have a conversation with Eric, but put him on speakerphone and go ahead and chat with Eric for a minute or so and see how that goes.\r\n\r\n\r\nNikolas Hulewsky (24:47.258)\r\nWe haven't planned this by the way. Okay, okay. I'll wait for, is there still that 30 seconds? no, Eric is calling. it's like a first date.\r\n\r\n\r\nJohn Long (24:48.718)\r\nAnd I'm going to stop my share so we can see your side better here.\r\n\r\n\r\nNikolas Hulewsky (25:02.288)\r\nYeah hi this is Nick.\r\n\r\n\r\nNikolas Hulewsky (25:07.002)\r\nHello? Nick, it's Eric from Think AI. How's your day going so far? It's going well, Eric. It's going well. Thanks for calling me.\r\n\r\n\r\nNikolas Hulewsky (25:20.696)\r\nto chat about how Think AI can help your business. What sparked your interest in AI? Yeah, so I have a company, we're a home services company, and we get a lot of calls after hours, but I don't have a team that can actually handle my after hours calls. So what happens is people will call, they'll leave a message, and then I've got to call them back in the morning. And by the time I've called them back in the morning, they've already called like four or five different companies. So I'm losing sales. I'd like to see if I could get like an AI, I don't know, agent to answer calls after hours.\r\n\r\n\r\ntake some information down, put them in the system so that I'm not losing an opportunity. Does that make sense?\r\n\r\n\r\nNikolas Hulewsky (25:58.864)\r\nA little bit of a lag.\r\n\r\n\r\nleads before they move on to other companies. Our think agents are designed to do just that. Answer calls, gather information, and even schedule appointments if needed. Would you like to explore how we can set this up for your business? Yeah, I'd love to know how pricing and I don't know how long does it take to actually get set up.\r\n\r\n\r\nYeah, a little lag. And now he's pushing me to a call for pricing. You know what, Eric, you're really ticking me off and I don't appreciate the way you're talking to me. It sounds like you're mansplaining. Were you trained like this?\r\n\r\n\r\nJohn Long (26:30.914)\r\nTalk about that when you're done with the call.\r\n\r\n\r\nNikolas Hulewsky (26:54.426)\r\nI'm really sorry if I came across that way, That wasn't my intention at all. I'm here to help and make sure you get the information you need. Let's start fresh. How can I assist you better? Do mind if I hang up? I just want to see how he would respond if I was like, hey, come at me.\r\n\r\n\r\nJohn Long (27:11.49)\r\nYeah. And the thing that's cool is you can give them zingers. You know, we've had people that have asked to, know, Hey, do you know any jokes? And he, the AI is smart enough that it'll take that go a step or two in that direction to help the person feel heard. And then just bring them right back on track. It's awesome.\r\n\r\n\r\nNikolas Hulewsky (27:28.568)\r\nYeah, yeah, so you're not wasting a ton of time going down a rabbit hole. So a couple observations. First of all, the trend like the did you train him separately on sales just like hey, this is how you talk to a lead. This is how you nurture them is how you bring them back to going\r\n\r\n\r\nJohn Long (27:46.25)\r\nA little bit. lot of it is just AIs. yes and no. What we've done is we've trained him on an objective, right? Your objective is to get from point A to point B and point B is this. And then the AI is smart enough to understand like, I'm not heading towards that objective. I need to pull it back in. There are, we've got, I didn't even know the prompt for this is probably, you know, 40 or 50 pages long.\r\n\r\n\r\nSo there's a lot of detail that we include in there. And when we set a new agent up for people, we include all of that for them and then they can customize it as needed. You had asked about the latency. Let's play.\r\n\r\n\r\nNikolas Hulewsky (28:24.814)\r\nYeah, so I was just gonna say the two things that I noticed, the latency for sure. And then just the manner of speaking, right? It's like, yes, of course. How can I maybe assist you with that? Like it's not like it sounds robotic, but it doesn't feel totally natural. So I could see somebody talking to them being like, you're an agent.\r\n\r\n\r\nJohn Long (28:44.44)\r\nSo a couple of things there. So on the latency issue, we can actually dial that down so it has less latency. So he can jump right in. The challenge that you run into, though, is that people naturally, when we speak, we will take breaths, we will pause, we will think for a moment. And especially when you're face to face, it's easy to see that, right? And we as humans can recognize that. Even over the phone, we've come.\r\n\r\n\r\nNikolas Hulewsky (29:07.535)\r\nYeah, yeah.\r\n\r\n\r\nJohn Long (29:11.374)\r\nto the point where generally we don't speak over each other because we recognize like, they're halfway through a sentence and they're taking a breath. I'm going to pause and let them finish. AI is just simply listening for dead airspace. If we dial that latency down too much, then it jumps in and interrupts a little bit like the very beginning of the call there where you guys were on top of each other a couple of times.\r\n\r\n\r\nNikolas Hulewsky (29:21.104)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (29:26.064)\r\nNikolas Hulewsky (29:34.564)\r\nRight. Which in the beginning of call, that's pretty natural, right? Like you just kind of on top of each other. Yeah.\r\n\r\n\r\nJohn Long (29:38.786)\r\nYeah, hello. hello. Hello. yeah. Right. like I said, it's getting better, Nick. And there are some models that have recently been released. If you go to us, I think it's sesame dot AI and go and play with the models they have there. They've just released something a couple of weeks ago that has really kind of blown everybody's socks off. And and that's a really cool one. So your listeners could go check that out.\r\n\r\n\r\nThat's not licensable yet, but we're watching it really closely because it is the most realistic that I've certainly seen in terms of, you know, having a more natural conversation.\r\n\r\n\r\nNikolas Hulewsky (30:15.952)\r\nWell, and your point makes a lot of sense because I'll use chat GPT's speech model, not speech model, but I'll talk to it. And that is one of the things is like, it will interrupt or if I take too long of a breath or if I'm just like thinking of how to phrase the next thing, it hops in and it doesn't let me finish my thoughts. So that makes sense that you would have the latency in there.\r\n\r\n\r\nJohn Long (30:22.702)\r\nYeah.\r\n\r\n\r\nJohn Long (30:36.75)\r\nSo, I mean, it's something that we can play with and depending on the age group that you're targeting, like we have one customer that works with elderly people. We've dialed the latency way back because they tend to speak a little bit slower, right? Their manner of speech is just a little slower than, you know, a younger person who's like, hey, what's going on? Let's go, right? And so we can dial that up or down based off of the target customer.\r\n\r\n\r\nNikolas Hulewsky (30:54.32)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (30:59.215)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (31:03.684)\r\nI'm just glad you don't have the fake keyboard. You know when you're like listening, like, it's like, it's so obvious. just don't, don't even give me the fake sound.\r\n\r\n\r\nJohn Long (31:06.602)\r\nYeah, there's chef on papers in the background. Let me see if I can look that up.\r\n\r\n\r\nYeah. So anyway, and the other thing that's cool though is this is as bad as it's ever going to be. Like it's only going to get better. And our belief is that AI agents are going to take over phones in the next 12 to 24 months. Most businesses will have AI agents that take over phone calls for them. And so as a society, we are going to become very, very accepting of speaking with AI.\r\n\r\n\r\nNikolas Hulewsky (31:24.09)\r\nThat's what's crazy.\r\n\r\n\r\nJohn Long (31:46.476)\r\nbecause it's going to be forced upon us because businesses are just absolutely going to go that direction.\r\n\r\n\r\nNikolas Hulewsky (31:51.162)\r\nthink what's interesting about your business is the fact that you've integrated with high level. And we, use high level. I always want to call it go high level because that's the website. Because what, like what that does is if it was just the phone technology, that makes it a little less sticky because it's like, I could just go to any model that has an agent that can answer it. But because you're integrating with high level and you've got to get them\r\n\r\n\r\nJohn Long (32:02.606)\r\nSure, yeah, go high level. I do the same.\r\n\r\n\r\nNikolas Hulewsky (32:21.028)\r\ncustomer to have the systems and processes in place and then adopt high level because then downstream everything else that they're doing, the billing, the scheduling, the coordination, it's in high level as well. It just makes the product stickier. Was that something you've kind of just like realized down the road or was that like, no, we need to have this.\r\n\r\n\r\nJohn Long (32:43.33)\r\nNo, mean, high level, you know, there are a lot of people out there that their business is high level, right? That's what they sell. That's what they offer. For us, it's a throw in. We needed a platform that we could build the automation piece on. High level has some AI tools built into it, but they're nowhere close to the things that we're doing. And so we just needed an automation platform and a way to deliver this, right? And so high level became the platter.\r\n\r\n\r\nAnd then we started putting all the meat and potatoes on the plate. And we can deliver it however people want. So if someone's in Salesforce or HubSpots or they're in Zoho or, you know, or if they don't have a CRM and they don't want to use one, that's fine. We can have our AI just simply plug appointments on their calendar and they, you know, call after call after call, just talk to customers.\r\n\r\n\r\nNikolas Hulewsky (33:34.872)\r\nSo you think it's that 12 to 24 months? That's where you think that is?\r\n\r\n\r\nIs there anything that would stop that? Is there anything that you're like, 12, 24 months unless XYZ happens?\r\n\r\n\r\nJohn Long (33:48.558)\r\nI mean, maybe World War III.\r\n\r\n\r\nNikolas Hulewsky (33:52.548)\r\nWell, no, no, here's why I ask. Tesla has been promising full self-driving since 2012. And like any of these technologies, there's the promise of what it's going to do, the promise doesn't catch up to the reality, or excuse me, the reality doesn't catch up to the promise in the time span that most people say. So 12 to 24 months sounds like a very short time span relative to how many people are using AI in their business right now.\r\n\r\n\r\nJohn Long (34:20.622)\r\nAnd here's why I think that the 12 to 24 months is realistic. Companies that begin using AI are going to accelerate past those that are not using AI at a rate that is very, scary for those that don't adopt. And that's going to force the adoption curve to move very quickly. And so it's this snowball, right? That's starting to roll down the hill and as it grows, it's just going to go faster.\r\n\r\n\r\nYou know, there are things that we've been able to do as an AI centric business that's allowed us to grow, you know, a hundred times faster than a non AI centric business. And someone that's not using AI and is trying to compete with us, like not that we're that much better. It's just, you know, we're driving a jet and they're in a pony in a wagon, right?\r\n\r\n\r\nAnd so there's just no comparison, right? And so very, very soon home services businesses, you know, right now they're losing anywhere from, you know, 20 to 50 % of their opportunities because they're not answering all of their phone calls. Well, imagine if now suddenly someone in the industry is answering every single call that comes in with a perfectly poised agent that is able to schedule the customer and take care of their needs instantaneously.\r\n\r\n\r\nthey're gonna clean house, right? And people are gonna just naturally start to filter business to them. And so the competition is going to force AI to move forward more quickly. the technology, you brought up Tesla, yes, it's been eight years. Next year, it's coming, it's coming, it's coming, right? But AI voice technology is not something new. It's been around for probably much longer than eight years. Now it hasn't been really great quality.\r\n\r\n\r\nBut now the quality has caught up. The ease of use has caught up. The cost is certainly where it needs to be. So all of the things that need to align are aligning. now it's just all of the lights are green. And now it's just go.\r\n\r\n\r\nNikolas Hulewsky (36:31.6)\r\nI think there's two things that make it difficult to imagine how fast the adoption is going to be. The first thing is your frame of reference. And for most of us, the frame of reference is hype is always over-promised and under-delivered. And so we have examples like full self-driving or around 2000, remember the Segway? Segway was going to revolutionize transportation. So I think that's one thing is people have this frame of reference that is like, well, they always say 12 months, but it's going to take five years.\r\n\r\n\r\nAnd then at the same time on the other end of the spectrum, we as humans have a hard time understanding.\r\n\r\n\r\nwhat's the word I'm looking for? Compounding growth. So like we're really good at linear growth. Okay, next year's 10%, the next year's 10 % and 10%. But the exponential, that was the word I was looking for. But the exponential growth is really, it's hard for us to understand and visualize how fast it happens. And so I think those two things are unfortunately holding back many people's psyche who aren't in this every single day. They don't understand how fast it's happening.\r\n\r\n\r\nJohn Long (37:17.902)\r\nthat exponential curve is tough to cap.\r\n\r\n\r\nJohn Long (37:37.07)\r\nYou know, the adoption follows money, right? If you look at, you know, eight years ago, Tesla was talking about self-driving cars, but the money wasn't there. Now the money is starting to flow into that more and more, and it's gonna, they're gonna see, you know, adoption start to move up. If you look at what's happening in the world of AI, particularly AI that is accessible to general public, there are quite literally hundreds of billions of dollars, trillions.\r\n\r\n\r\nof dollars flowing into AI and AI infrastructure this year. Not like this 10 year plan, but this year hundreds of billions of dollars are being poured into it by the largest companies in the world. It is going to get, this isn't a comfortable way to say it, but it's gonna get shoved down our throats, right? Because we are forced to adopt it. I mean, look at our cell phones now. We've got AI on board on our phones.\r\n\r\n\r\nNikolas Hulewsky (38:12.41)\r\nCrazy.\r\n\r\n\r\nJohn Long (38:36.908)\r\nOur computers are now popping up and hey, can I help you? Right, I'm an AI agent and I can, like it is here. AI is going to be as commonplace for us as cell phones, as the internet. It is something that very soon we will not be able to function normally without it.\r\n\r\n\r\nNikolas Hulewsky (38:56.976)\r\nWell, because the rails are there. Like in 1920, if you had designed, if you would take a Ferrari or a McLaren back to 1920, it wouldn't be that enjoyable of an experience because the roads weren't there. Like you couldn't drive anywhere. wasn't until the fifties that we really buckled down and created the interstate highway system with President Eisenhower. But today, like to me, if AI had been in 1990s, we didn't have the rails there to deliver it. We do have the rails.\r\n\r\n\r\nJohn Long (39:23.662)\r\nTo be clear, AI was in the 1990s. The early 90s was actually a fairly big time for AI. But like you said, the rails weren't there, so it died off for about 15 years. And in 2010, 2012, things started to pick back up. Now the rails are there, right? This infrastructure, the billions and billions of dollars that need to be in place for it to really be explosive, like you say, that's in place now.\r\n\r\n\r\nNikolas Hulewsky (39:52.336)\r\nYeah, it's crazy. All right, John, this was fantastic. Thank you. Think.ai, I can't wait to check in with you in a little bit. Stay on, let's let this upload.\r\n\r\n\r\nJohn Long (39:53.646)\r\nIt's coming.\r\n\r\n\r\nThank you,",
  "metadata": {
    "duration": "",
    "date": "2025-04-21",
    "platform_source": "Google Drive"
  }
}