{
  "episode_number": "101",
  "episode_title": "Robot Lawnmowers, Christmas Tree Business & Monetizing Email Lists with Chris Koerner",
  "guest_name": "Chris Koerner",
  "business_name": "Emerald Lawns, Fast Tree Care",
  "transcript": "﻿Chris Koerner (00:01.838)\r\nDo remember that episode we had a couple months ago about the idea to take the random viral, like TikTok shop type ideas and put them in a store? Remember that?\r\n\r\n\r\nNikolas Hulewsky (00:05.78)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (00:14.334)\r\nYeah, pop up.\r\n\r\n\r\nChris Koerner (00:16.268)\r\nYeah, well, someone's doing that. On the promenade in Santa Monica, there's a literal like a tick top shop. It's not tick tock shop. It's this company called outlandish. And it's a physical retail location where you can sell stuff on tick tock shop live. You can watch people selling live, you can test products, you can buy products in person, you can take classes on how to sell on tick tock shop, you can take classes on how to sell on live stream. And it's all right there.\r\n\r\n\r\nexactly like we talked about.\r\n\r\n\r\nNikolas Hulewsky (00:46.696)\r\nAre they giving us a cut?\r\n\r\n\r\nDid they acknowledge that they got it from us?\r\n\r\n\r\nChris Koerner (00:50.252)\r\nI have some I have I have some legal docs out. I'm to see how it plays out.\r\n\r\n\r\nNo, apparently this company's been around for a few years, but they've never done like a physical retail store until like last week.\r\n\r\n\r\nNikolas Hulewsky (01:07.182)\r\nmake – I had heard that the Promenade was actually having a hard time. It's Third Street Promenade, you said, right? Yeah, I heard that they were having a hard time with leasing space. They were getting a lot of tenants leaving because I guess there's a really big homeless problem there in particular. So, I mean, it would make sense if they just have some free space to throw up that idea.\r\n\r\n\r\nChris Koerner (01:12.088)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:29.24)\r\nfor crazy.\r\n\r\n\r\nNikolas Hulewsky (01:30.676)\r\nIt is pretty crazy. The company who's doing it, they're a legit company. Like have you heard of them before?\r\n\r\n\r\nChris Koerner (01:35.286)\r\nNo, but they're legit. Yeah. I never heard of them. I think they're like VC funded and everything.\r\n\r\n\r\nNikolas Hulewsky (01:44.884)\r\nCome to Dallas next.\r\n\r\n\r\nChris Koerner (01:47.264)\r\nAmen.\r\n\r\n\r\nNikolas Hulewsky (01:50.59)\r\nLove it.\r\n\r\n\r\nChris Koerner (01:52.184)\r\nWhat do got for me? That's it. That's everything I have. done.\r\n\r\n\r\nNikolas Hulewsky (01:57.438)\r\ndone for the day. right, Chris, let me ask you question. Are we the startup bros or the hold co bros?\r\n\r\n\r\nNikolas Hulewsky (02:08.916)\r\nWe're the Holdco bros. Thank you. You're right. We don't just talk about startups. You like how I just like bulldozed through it? You're like both. Absolutely. You're right, Chris. We are only the Holdco bros. So I went, I bought a Christmas tree and when we buying it, was $120 tree. Typically we will buy Christmas trees and we spend like $10 or $15. We get a permit and we go to BLM.\r\n\r\n\r\nChris Koerner (02:11.074)\r\nYeah, that's what I said.\r\n\r\n\r\nNikolas Hulewsky (02:38.452)\r\nBureau of Land Management, Black Lives Matter land. And we cut down a tree and it's 10 or 15 bucks. And it's a cool experience. We didn't do that this year because the people we usually go with, anyways, whatever, it's a whole long story. And so instead we went to the place that was selling a Christmas tree near our house at the grocery store. It was $120 to get this tree. So it got me thinking, two ideas. One's a dumb idea, one's a good idea. The first one, the dumb idea.\r\n\r\n\r\nChris Koerner (02:39.436)\r\nYeah, black lives do matter. I agree. Thank you.\r\n\r\n\r\nNikolas Hulewsky (03:06.896)\r\nis I haven't looked at any of the regulations. I don't know if it's legal or not legal. I can't imagine it's marketed as legal, but what if there was a concierge Christmas tree business where I go, I buy 20 permits a year. If I cut down 20 trees and I take it and I deliver that to people's homes. Now you could get like as crazy with it as you want it, right? Like you could take pictures of it and they could choose it.\r\n\r\n\r\nvirtually and the kids could look at it they could name the tree for a couple, maybe they named the tree three years ago and they've been watching it for three years and it's finally ready to cut down. That's kind of too short of a period of time, but you get what I'm For significantly cheaper than the $120, I mean, maybe 60 bucks, you go up, you cut down 10 trees, costs you $100 because you wouldn't bought the permits. And then you go and deliver the trees to each person for 60 bucks and you just made\r\n\r\n\r\nChris Koerner (03:43.245)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (04:01.396)\r\n$600, obviously your labor is included in there. But why would a Christmas tree concierge business not work? I want you to tell me.\r\n\r\n\r\nChris Koerner (04:13.004)\r\nIs it the good idea or the bad idea? Okay. I'm just kidding. No, no. Okay. Any idea could work with the right distribution and execution. Okay. I will say that, right? If, if you got Elon Musk to tweet about this idea, it would work. Okay. Just by the law of large numbers, but aren't people paying for the experience of trekking up there in the mountains and cutting it down?\r\n\r\n\r\nNikolas Hulewsky (04:14.804)\r\nWhat is the bad idea?\r\n\r\n\r\nNikolas Hulewsky (04:38.58)\r\nNo, this is what I'm saying. It costs me $10 to $15 to buy a permit to cut down a tree. Or I go to Albertsons and buy a tree in the parking lot that's pre-cut and it costs me $120. So what I'm saying is if I was a young person and I'm just like, I'm just going have a side hustle this Christmas, I'm going to make two grand, whatever, why wouldn't I just buy permits?\r\n\r\n\r\nChris Koerner (04:40.363)\r\nEHH!\r\n\r\n\r\nChris Koerner (04:44.856)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nChris Koerner (04:51.278)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (04:57.4)\r\nhybrid.\r\n\r\n\r\nNikolas Hulewsky (05:06.126)\r\ncut down trees and then deliver these to families. And then on the back end, charge them another $50 to come pick up the tree after Christmas is done.\r\n\r\n\r\nNikolas Hulewsky (05:16.616)\r\nThis is not like a necessarily it's like your pizza business that we talked about last week, right? Like it's not necessarily it's like I'm going to go scale it, but it's just.\r\n\r\n\r\nChris Koerner (05:20.738)\r\nOkay. No, no, no, no, I don't shoot. There's no idea that's too small for me. Okay, no judgment here on that.\r\n\r\n\r\nNikolas Hulewsky (05:25.62)\r\nMy wife says that all the time. There's no such thing as too small Nick.\r\n\r\n\r\nChris Koerner (05:36.238)\r\nFirst of all, Cindy, I'm sorry you had to hear that. That's my mom who listens to this.\r\n\r\n\r\nSo you're\r\n\r\n\r\nNikolas Hulewsky (05:44.02)\r\nAnd to my mom, you're welcome. Because I'm sure she had a hearty laugh.\r\n\r\n\r\nChris Koerner (05:49.528)\r\nSo this is an alternative to the Albertsons buyers you're saying. It's a cheaper alternative.\r\n\r\n\r\nNikolas Hulewsky (05:54.066)\r\nYeah, yeah, yeah, yeah. Not to people who are going to go cut down the tree themselves. I'm not marketing to them. It's to the—\r\n\r\n\r\nChris Koerner (05:58.796)\r\nOkay, but that's what my question was assuming. Okay, so I like this because positive cash flow conversion cycle, collect the money upfront, Venmo me 60 bucks, or Venmo me 100 bucks if you'd like it delivered. You get paid upfront, right? And you could say, hey, 15 of the 60 goes straight to the BLM, that's the permit, the rest goes to me, 40 extra dollars if you want it delivered, or you could...\r\n\r\n\r\nNikolas Hulewsky (06:02.483)\r\nDano.\r\n\r\n\r\nNikolas Hulewsky (06:11.828)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (06:26.882)\r\npicking up on the parking lot Saturday morning between nine and 11 a.m. So I like that it's cheaper you're cutting out the middleman you're cutting out the multi-billion dollar company that's selling it in the parking lot. I yeah I mean I don't why wouldn't that work?\r\n\r\n\r\nNikolas Hulewsky (06:44.916)\r\nI know why wouldn't it work. Like it seems like the side hustlers in paradise, like, of course I'll go cut down some trees. I'll deliver them. And not only will I deliver them, but I'll pay you to pick them up too. Like I'll handle everything end to end.\r\n\r\n\r\nChris Koerner (06:57.996)\r\nWhat's the distribution strategy if you're not on a busy corner like Albertson's is?\r\n\r\n\r\nNikolas Hulewsky (07:03.892)\r\nI would probably, there's two things that I thought of to start with. Old school, I know. I'd probably put flowers, flyers up at Albertsons because people are there, like they're seeing the farm anyways, but then all of a they see this fire that's like, I'll go cut you down the tree. Cool.\r\n\r\n\r\nChris Koerner (07:15.402)\r\nMm-hmm. Mmm. Mm-hmm.\r\n\r\n\r\nChris Koerner (07:22.324)\r\nYou're dirty.\r\n\r\n\r\nNikolas Hulewsky (07:25.172)\r\nThat would be one way I would do it. The other way I would do it, again, this is if I was local, I would join some of the local Facebook groups and just say like, hey, I'm doing this this year. Anybody who's interested, let me know because there are tons of Facebook groups in Eagle, Idaho. I would just go join 20 of them since I live here, offer that as a service and see who bites.\r\n\r\n\r\nChris Koerner (07:51.608)\r\nI like it. Absolutely. mean, if, if a business model depends on spamming someone with flyers in the parking lot of your main competitor, I am a thousand percent all for it. I'm in.\r\n\r\n\r\nNikolas Hulewsky (08:01.628)\r\nHahaha!\r\n\r\n\r\nI'm in, I am in. All right, so here's my second idea with this. I got curious and I started chatting it up with the guy who was there. He was not the owner of the tree lot, but he's worked with the company for a long time and I'm like, hey, how long you guys been here? We've been doing this for 30 years. He sounds nothing like this, but it just works for this part. We've been doing this for 30 years. How do you do it?\r\n\r\n\r\nChris Koerner (08:23.818)\r\nNo, this is yeah\r\n\r\n\r\nNikolas Hulewsky (08:29.932)\r\nWe have to get in contact with Albert Sins and they award us a contract every few years and we just come and set up the trees. Like, really? You've had it for 30 years? He's like, yes, sir, we have. But what's name of your company? Tells me the name of his company. Like, it's a landscaping company? A landscaping company owns this tree lot, right? He's like, yes, sir. How long you been around? We've been around two generations at this point. So got me thinking. I'm like, dude.\r\n\r\n\r\nChris Koerner (08:49.006)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (08:58.9)\r\ncould be the perfect business to go out and try to buy. So what do we do? We started doing some research. I find the name. And this is the meme of Vince McMahon when he's sitting in the ring and it gets progressively more excited. know what he... Yeah, yeah. No, no, no, no. So the first thing I was just like, first I was like, you've had this for 30 years? Okay, tell me more. Then he tells me, you're owned by a landscaping company? okay.\r\n\r\n\r\nChris Koerner (09:13.326)\r\nyeah, I was thinking Vince Vaughn for some reason. I'm like, what?\r\n\r\n\r\nNikolas Hulewsky (09:28.722)\r\nYou had my attention, sir, but now you have my focus.\r\n\r\n\r\nChris Koerner (09:30.222)\r\nMy grandson calls me the Boomer Silver Tsunami. Go on.\r\n\r\n\r\nNikolas Hulewsky (09:35.636)\r\nSo then he tells me the name of the company. go to the website. Guess what I found on the website, Chris.\r\n\r\n\r\nChris Koerner (09:45.486)\r\nPlease don't tell me it was just plain HTML.\r\n\r\n\r\nNikolas Hulewsky (09:49.268)\r\nThere was no website, Chris. They were on Google Maps because people had been giving them reviews, but I clicked on their website. There was no website. gosh, dang it. My camera's doing this again.\r\n\r\n\r\nChris Koerner (09:51.598)\r\nIt's so beautiful.\r\n\r\n\r\nChris Koerner (10:04.172)\r\nYou have got to, El got to figure that out.\r\n\r\n\r\nNikolas Hulewsky (10:08.654)\r\nI just have had it on for an hour and a half. Hold please.\r\n\r\n\r\nChris Koerner (10:15.084)\r\nNow, is that your teleprompter or a light? I just ordered two Elgato lights today. Will I have that issue?\r\n\r\n\r\nNikolas Hulewsky (10:24.924)\r\nNo, no, no. I'll tell you later. Anyways, so I go, I click on the website, Chris. First of all, it's been ransomware.\r\n\r\n\r\nChris Koerner (10:29.133)\r\nOkay.\r\n\r\n\r\nChris Koerner (10:39.694)\r\nCan you tell me the business and we'll bleep it out so I can look at this up.\r\n\r\n\r\nNikolas Hulewsky (10:44.692)\r\nyeah, give me a second.\r\n\r\n\r\nfind it for you.\r\n\r\n\r\nPrince.\r\n\r\n\r\nNikolas Hulewsky (11:01.246)\r\nMm-hmm.\r\n\r\n\r\nEmerald Lawns, Idaho.\r\n\r\n\r\nChris Koerner (11:09.644)\r\nIs it the same Google business profile listing for the tree business and the lawn care business?\r\n\r\n\r\nNikolas Hulewsky (11:15.398)\r\nIt's just the lawn care business. There is no Google listing for the tree business.\r\n\r\n\r\nChris Koerner (11:21.646)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (11:22.388)\r\nSo the first one that comes up is like, your connection is not private. It's like, can't go to it. And then the second one I tried to get to, I get this like ransomware. Your website is under construction. If you're the owner of this domain and need assistance, please contact web support at web support at blip blip blip blip. So I'm like, dude, first of all, these guys don't care about their website because they've allowed it to just sit there as a problem. Second.\r\n\r\n\r\nChris Koerner (11:34.702)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (11:45.666)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (11:48.862)\r\nThey're known entity. People are leaving them Google reviews, but they're still not optimizing it. So you know, you know, when you reach out to a mobile home park and it's like Gary Johnson at aol.com or Lauren Michaels at comcast.net, SBC global.org. see.\r\n\r\n\r\nChris Koerner (12:06.594)\r\nThe second I see that, I buy a boat.\r\n\r\n\r\nNikolas Hulewsky (12:09.755)\r\nWhy? Why do you buy a boat?\r\n\r\n\r\nChris Koerner (12:11.15)\r\nBecause I know I'm going to be able to afford it with all the money I'm about to make.\r\n\r\n\r\nNikolas Hulewsky (12:13.224)\r\nHahaha!\r\n\r\n\r\nChris Koerner (12:18.286)\r\nWhat's up?\r\n\r\n\r\nNikolas Hulewsky (12:21.902)\r\nmy gosh. So good. Just the timing was perfect. Anyways, so it got me thinking. It got me thinking. There have got to be many similar ancillary businesses that are owned by unsexy companies that are operating. And there's one of two options. Option number one, you try to buy the Christmas tree lot from them.\r\n\r\n\r\nChris Koerner (12:28.246)\r\nI see.\r\n\r\n\r\nNikolas Hulewsky (12:49.62)\r\nthink that would be hard. I don't think they want to carve that out. They're probably like super high margins. Option number two would be going and try to buy this business because I already know a couple of things. Number one, they've been around for 30 years. So they've got a really long track record. That's awesome. People know who they are. They've got a crew. They're delivering good service, et cetera. They're probably making a ton of money from the tree farm and they're probably making so much money. They don't care about their freaking website. That's how much business they have coming in. So they're probably close to retirement age.\r\n\r\n\r\nChris Koerner (13:16.92)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (13:19.668)\r\nThey're in the ballpark of like, hey man, I'd to talk to you about buying your business. I'm not saying it would work, but there's a chance that you could buy this business. So I just, I know you do the same thing as well. I think there are so many opportunities like this to go out and cold contact these people in your local markets, these local businesses that could potentially be for sale because they are going to sell in the next 10 years. We know 10,000 baby boomers are retiring every single day and a thousand of them are business owners. So.\r\n\r\n\r\nChris Koerner (13:26.766)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (13:49.8)\r\nAs you're out and about, look for little clues like that. Could this be a company that's coming for sale? Because you might just find a gem.\r\n\r\n\r\nChris Koerner (13:59.15)\r\nI mean, the homepage of their website says click to print coupon. Like what? That's a thing.\r\n\r\n\r\nNikolas Hulewsky (14:05.204)\r\nDude, I know, I know. it's like not even necessarily I wanna get into landscaping, but if I did, like dude, this would be a perfect opportunity. This is the type of business that I'm looking for is like an owner who's making so much money, they don't even care about their branding or their website. And they're probably close to retirement. I wanna reach out to them.\r\n\r\n\r\nChris Koerner (14:23.8)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (14:30.626)\r\nI have like four sub business ideas based off of this one. Okay. First of all, Andrew Wilkinson was on a podcast and he talked about an idea that I thought was really interesting. You know, they have like the Roombas, the Roombas for lawn mowing. Now have you seen those? Yeah. It's like a fully autonomous robot lawnmower. And of course, what are the haters say? insurance. cut your feet off. like, like as if they don't have sensors. It's the future, right? We're moving that direction, but guess what?\r\n\r\n\r\nNikolas Hulewsky (14:45.62)\r\nI'm make sense, but no I didn't know\r\n\r\n\r\nOkay.\r\n\r\n\r\nChris Koerner (15:00.162)\r\nWe've had Roombas in the house for over a decade, still selling brooms, still sweeping, right? There's room for everyone here. Andrew, now this was said from a tech guy who's probably never mowed a lawn in his life, but his idea was buy a landscaping business and take a sub-segment of the customer base and say, hey, we're beta testing these robot lawnmowers. We're going to drop them off and then we'll come back and pick them up in a couple hours.\r\n\r\n\r\nNikolas Hulewsky (15:06.804)\r\nMm-hmm. Mm-hmm. Mm-hmm.\r\n\r\n\r\nChris Koerner (15:29.742)\r\nAnd you just buy a fleet of these Roombas for the lawn you drop them off you train it to the yard once you program it and You just drop them off on your route instead of having a whole crew of guys It's just one guy dropping them off pick them up charge on the drive drop them off in another set of houses What do think?\r\n\r\n\r\nNikolas Hulewsky (15:49.652)\r\nI just had the mental image that 10 years from now, we don't see Hector driving around doing lawn care. We see freaking Kevin, the nerd driving around doing lawn care. He's like, can't just kind of pick up these robots. this one's malfunctioning. I'm just going to go back to the car and.\r\n\r\n\r\nChris Koerner (16:04.642)\r\nThe gamer, pale white skin, looks like a vampire, never been outside in his life, making 40 grand a week.\r\n\r\n\r\nNikolas Hulewsky (16:13.68)\r\nservicing all the machines. looks like we got to reboot this thing. Have we tried unplugging it and plugging it back in? Hmm. That's so good. I don't hate the idea, but that just seems like super capital intensive. You got to buy the landscaping company and then you got to buy all the machines, right?\r\n\r\n\r\nChris Koerner (16:14.004)\r\nyes.\r\n\r\n\r\nChris Koerner (16:23.63)\r\nUgh.\r\n\r\n\r\nChris Koerner (16:31.234)\r\nYou don't have to buy a landscaping business. I mean, it's less capital intensive than having a whole crew of, of landscapers and lawnmowers and equipment and oil and moving parts and\r\n\r\n\r\nNikolas Hulewsky (16:44.033)\r\nthese are cheaper than traditional lawn care equipment?\r\n\r\n\r\nChris Koerner (16:47.928)\r\nThey're pretty comparable.\r\n\r\n\r\nNikolas Hulewsky (16:50.644)\r\nWhy? Why do you say? so they're all electric.\r\n\r\n\r\nChris Koerner (16:51.406)\r\nbecause they're a lot smaller.\r\n\r\n\r\nYeah, they're all electric and they're small because you don't need someone to sit on them, right? They're literally like the size of a Roomba. And a writing like a commercial writing mower is easily eight to 15 grand. And these do not cost that much. The downside is they take longer, but there's no one writing them. So it doesn't matter. So I think for like cookie cutter neighborhoods, like you see in the suburbs, 5000 square foot lawns, these are perfect. You train them to the lawn. It remembers that you drop it off, you pick them up.\r\n\r\n\r\nSo that's one idea. Interesting, right? Second idea, this is like far out there in the future, but obviously, figure Tesla, they're all making these robots. Okay. And they're gonna go in the house. What? You can't tell me there's not gonna be a business that literally just drops off a $10,000 robot at someone's house, cleans it, and then someone comes and picks it up. Like, the counter argument to that is like, why wouldn't they just buy their own robot?\r\n\r\n\r\nNikolas Hulewsky (17:26.558)\r\nCool idea.\r\n\r\n\r\nChris Koerner (17:53.486)\r\nOkay, well just did an episode about a guy that rents out appliances for $60 a month. Appliances cost $300 and some people rent them for years at a time. Why wouldn't...\r\n\r\n\r\nNikolas Hulewsky (18:03.667)\r\nyou're saying that they would rent the robot as a cleaner?\r\n\r\n\r\nChris Koerner (18:06.222)\r\nI'm talking about a cleaning business that owns a bunch of like Tesla robots that drops it off. They clean the house. Yeah. And then they just come and pick them back up.\r\n\r\n\r\nNikolas Hulewsky (18:13.638)\r\nOptimus.\r\n\r\n\r\nNikolas Hulewsky (18:19.87)\r\nThat's a really cool one. The way you're thinking about it reminds me of the way we used to talk about Tesla probably, I don't know, five years ago, because they've been promising FSD for years. like you and I would talk about, dude, just for goodbye, a fleet of Teslas wait and then rent them out. They'll be their own taxi. Like it's very similar to these robots.\r\n\r\n\r\nChris Koerner (18:42.978)\r\nYeah, well you saw a Tesla release that right like the design for it. It's just a. He promised to be ready by 2020. We're a little late. But.\r\n\r\n\r\nNikolas Hulewsky (18:45.652)\r\nYeah, looks freaking rad.\r\n\r\n\r\nNikolas Hulewsky (18:53.522)\r\nElon? Over-promising? No. Not our King Elon.\r\n\r\n\r\nChris Koerner (19:01.336)\r\nAll right, so that's that's one thing. Okay, we're gonna go in that direction. That's where that's where things are headed. Does it mean that cleaners are out of business? Not at all. Okay. You drop off robots and do laundry for you. Right? We still have invented. We still haven't invented a good machine that does laundry for you. Have you ever seen those machines? They're like hydraulic machines with these huge hooks and they\r\n\r\n\r\nNikolas Hulewsky (19:10.291)\r\nNo.\r\n\r\n\r\nNikolas Hulewsky (19:15.636)\r\nI would love that.\r\n\r\n\r\nChris Koerner (19:28.894)\r\nroll up to a tree like a fully mature tree and they dig these hooks in the ground, pull the tree out and then you go dig a hole in the ground that's the exact same size and just transplant that tree into that hole. Isn't that insane?\r\n\r\n\r\nNikolas Hulewsky (19:31.602)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (19:41.428)\r\nYeah, dude. Insane or or the same. I mean, it's the same concept, but those machines that go and pick apples in large orchards that like they're driving and then they just grab the tree and shake it. It's insane.\r\n\r\n\r\nChris Koerner (19:51.16)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (19:54.946)\r\nThey shake it. Yeah. So cool. Okay, so two ideas here. Christmas tree. What's stopping someone from going to a Christmas tree farm? Scooping that sucker out of the ground. Putting it in a pot, right with extra soil, delivering it to the house. we have a nice real Christmas tree. You're watering it every week. And then you just take it back, put it back on the farm.\r\n\r\n\r\nNikolas Hulewsky (20:09.332)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (20:14.313)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (20:20.02)\r\nBye.\r\n\r\n\r\nChris Koerner (20:23.352)\r\nDo it again next year when it's a little bit bigger.\r\n\r\n\r\nNikolas Hulewsky (20:26.162)\r\nyou\r\n\r\n\r\nChris Koerner (20:27.843)\r\nVoilà.\r\n\r\n\r\nNikolas Hulewsky (20:29.374)\r\nWait a second. Did you just invent a recurring revenue model from Christmas trees?\r\n\r\n\r\nChris Koerner (20:31.534)\r\nYou don't have to cut it down.\r\n\r\n\r\nChris Koerner (20:37.326)\r\nIf you're not in that Christmas tree subscription game, then where you at?\r\n\r\n\r\nNikolas Hulewsky (20:48.788)\r\nWhat was the original version of that? Where you at? Anyways.\r\n\r\n\r\nChris Koerner (20:52.418)\r\nYeah, me. Yeah. Yeah. Anyway, but\r\n\r\n\r\nNikolas Hulewsky (20:55.356)\r\nYeah, why could you not do it?\r\n\r\n\r\nChris Koerner (20:58.126)\r\nI think you could, it's the same concept of transplanting trees, which I've done. You're transplanting it into a pot that is transportable. You're putting it in your living room and you're putting like a nice wreath or a garland or something around the pot, something Christmassy, and then you're taking it back at the end of December and you're putting it back on the farm to keep growing.\r\n\r\n\r\nNikolas Hulewsky (21:23.186)\r\nYeah, like you just charge someone a rental fee. And if it dies and it breaks, then you charge them the full price of the tree. That's a really interesting idea.\r\n\r\n\r\nChris Koerner (21:26.456)\r\nMm-hmm. Eco-friendly, baby.\r\n\r\n\r\nChris Koerner (21:33.582)\r\nAnd those, well, those trees can go a long time without water. So I'm, I'm betting that you could get away with not even watering it that much.\r\n\r\n\r\nNikolas Hulewsky (21:42.878)\r\nThere's probably a farmer listening to this right now. It's like these idiots, what they don't understand is birch trees can't survive for that long outside of mother nature.\r\n\r\n\r\nChris Koerner (21:46.274)\r\nThese guys are so dumb.\r\n\r\n\r\nChris Koerner (21:54.008)\r\nSomeone slept through agronomy class.\r\n\r\n\r\nChris Koerner (22:01.016)\r\nTell me you're not an arborist without telling me you're not an arborist.\r\n\r\n\r\nNikolas Hulewsky (22:05.948)\r\nsay these guys are horda uncultured if you know what I'm saying\r\n\r\n\r\nNikolas Hulewsky (22:13.876)\r\nWe're so stupid. Okay.\r\n\r\n\r\nChris Koerner (22:15.822)\r\nAll right, that's one idea. Okay. There's the other idea that I've had for a while. Tell me why this wouldn't work. Tell me why it wouldn't work. Okay.\r\n\r\n\r\nIf you want to build a house or build anything, you buy raw land and it's probably going to have some trees on it. Okay. What do you have to do? You got to clear the land. Land clearing is a thing. It is a well established industry. Okay. You can do it with chainsaws. You can do with heavy equipment, skid steers. You push the trees over, you cut them over, you pull out stumps, you burn this stumps. You can clear land any number of ways. So there's a market there that exists. And then you've got a market of homeowners or businesses.\r\n\r\n\r\nNikolas Hulewsky (22:31.828)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nChris Koerner (22:55.384)\r\nthat want to plant mature trees. Because it's the one thing you can't just like snap your fingers and have exist. You do have to wait decades for them to grow or you have to spend a lot of money to buy a transplantable tree. The bigger a tree, the more expensive they are. Tree farms are insanely expensive. Like thousands to tens of thousands of dollars to buy these trees that are five, 10, 15 years old. And it makes sense, right?\r\n\r\n\r\nWhy can't you buy one of those hydraulic machines and somehow find a way? Maybe you're pulling city permits. Maybe you're pulling real estate records when a piece of raw land sells and reaching out to the buyer right after it sells and playing middleman between the guys that are about to chop down or burn all these trees and the guys that want to buy mature trees and moving them.\r\n\r\n\r\nNikolas Hulewsky (23:46.836)\r\nI'll do one better. If I were the nursery or the tree farm, that would be something I would explore as a distribution channel. I would reach out to, like you said, tree trimming businesses or land clearing businesses or getting records of homes that have sold in the area and use that as a distribution, not distribution, it's acquiring cogs essentially. Because in that way, you don't have to\r\n\r\n\r\nChris Koerner (23:57.166)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (24:16.55)\r\nreinvent the wheel. You're already selling these trees to people. You're selling them at a much different maturity level, but you're already selling these trees. Yeah, I don't hate it.\r\n\r\n\r\nNikolas Hulewsky (24:31.582)\r\nThose are four good ideas off of that.\r\n\r\n\r\nChris Koerner (24:33.88)\r\npretty tight.\r\n\r\n\r\nNikolas Hulewsky (24:35.976)\r\nYou're welcome. All right, what do you got?\r\n\r\n\r\nChris Koerner (24:38.19)\r\nAll right, so.\r\n\r\n\r\nCan I tell you something crazy?\r\n\r\n\r\nNikolas Hulewsky (24:43.56)\r\nalways.\r\n\r\n\r\nChris Koerner (24:45.966)\r\nSo this sounds a little bombastic, but I don't care. Okay. I keep going back and forth. I keep going back and forth on this. So my son is 14. He has a phone and he doesn't use Google. He uses chat GPT for everything. And I feel like for his generation, that's going to be the norm. and of course Google has Gemini. Google's making big strides in AI.\r\n\r\n\r\nNikolas Hulewsky (24:50.406)\r\nOkay. Okay.\r\n\r\n\r\nChris Koerner (25:14.158)\r\nThey're doing lots of things. have Google Drive. They can integrate every which number of ways they can. They can build models based on YouTube data. They have things that no other company in the world has. But we all know that Google gets a majority of their revenue from ads, Google ads, right? To this day, Nick, 77 % of their revenue comes from ads, AKA ads that are shown when people Google things. I literally use Google.\r\n\r\n\r\n80 90 % less than I used to. My son doesn't use it at all. And my other kids younger than him probably won't use it at all. Do they have Google Drive accounts at school? Yeah, yeah. So like they use Google, but Google's not making any money when you log into Google Drive. Right? That's a loss leader. So you'll keep searching things on Google. You know what mean? But like you look at Google stock,\r\n\r\n\r\nNikolas Hulewsky (26:04.692)\r\ndepends, but yeah.\r\n\r\n\r\nChris Koerner (26:13.068)\r\nIt's doing fine. They're great. They're up 44 % year to date. Despite open AI. Is this a situation where AI advancements just grow the pie for everyone rising tide situation, everyone's going to be fine because the economy is growing AI is just making everything more prosperous for everyone. Or should we be worried about Google because of their ads revenue dropping inevitably.\r\n\r\n\r\nNikolas Hulewsky (26:38.288)\r\nSo there's two things. The reason that Google stock prices stayed fairly constant, if not risen, is because they've been able to cut headcount pretty significantly. So profitability has stayed the same, which is fantastic for them. And there's been a lot of concern whether or not they were going to get left behind by open AI. The central premise though of your question is, well, I'm using chat GPT, so I'm no longer using Google. Therefore, Google will have less\r\n\r\n\r\ntraffic, less revenue and ads. I don't know that that's true. Where is ChatGBT pulling that information from? Anytime you have an answer and you're asking it specifics, they will give you links. They will say, whatever. What's the capital of Albania and how many people live there? The capital of Albania is Tehran and there are 700,000 people that live there. Many times they will include links. Well, they're going and crawling the open web. So they're crawling Google. They're crawling every other\r\n\r\n\r\nsearch platform out there and then they're returning information. I don't I don't know. It may change the game. It may change the way that Google is monetizing those ads, but I don't think it. I don't think it takes them out of the game. The flip side to your. Are good question though is because they also have such a competitive advantage there so far ahead with YouTube and with just traditional search.\r\n\r\n\r\npeople are using the Gemini more and more because they can get a lot more information out of it.\r\n\r\n\r\nChris Koerner (28:17.774)\r\nSo you a buy, sell or a hold on Google?\r\n\r\n\r\nNikolas Hulewsky (28:21.384)\r\nI'm a buy. I would buy Google.\r\n\r\n\r\nNikolas Hulewsky (28:26.782)\r\nWhat are you?\r\n\r\n\r\nChris Koerner (28:30.158)\r\nI'm a hold like I don't own it and I'm not going to buy it, but I would never short it either. I just, when, when, when opening, crawls Google, Google's not getting revenue from that. And if they're passing on a link, they're circumventing Google for that link. Google gets nothing when they pass on a link.\r\n\r\n\r\nNikolas Hulewsky (28:39.667)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (28:51.612)\r\nI wish I did more research before you ask this question. Google is still printing money. They still are sitting on a ton of cash, tens of billions, not hundreds of billions of dollars of cash. They've got a moat when it comes to search and data. They've got YouTube, which is the largest store of information in the world that they can go and crawl anytime. Anything that OpenAI can do, Google can throw money at it and they are starting to throw a lot of money at it. There's a lot of money that they're throwing into research and development right now.\r\n\r\n\r\nChris Koerner (28:56.48)\r\nI know. I know.\r\n\r\n\r\nNikolas Hulewsky (29:21.534)\r\nSo they could license that information. They could create a rev share model that allows them to still effectively monetize that data. I just wouldn't bet against Google. That's more of where my conviction comes from. It's like they've got so much money, they're still printing so much money. I wouldn't bet against them. Even though they've had stupid launches, when they're portraying the pilgrims as black and they've got just a bunch of unforced errors.\r\n\r\n\r\nYeah, I wouldn't bet against them.\r\n\r\n\r\nChris Koerner (29:53.582)\r\nI find it hard to want to bet against any of the thing companies. I don't care what's going on in the world. Like there's just no precedent for trillion dollar companies that own this much data.\r\n\r\n\r\nNikolas Hulewsky (30:06.356)\r\nNo, Facebook's in the same boat.\r\n\r\n\r\nChris Koerner (30:09.667)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (30:11.924)\r\nbut I haven't researched it enough to have a super strong opinion.\r\n\r\n\r\nChris Koerner (30:18.19)\r\nYeah, I would never short Google, but it's just, it's interesting how much consumer behaviors is changing. They've tried for decades to reduce their reliance on search ads and you know, they've gone from like 95 % reliance to 77%, but it's still crazy.\r\n\r\n\r\nNikolas Hulewsky (30:37.485)\r\nIt'd be nice to have those margins in that revenue.\r\n\r\n\r\nChris Koerner (30:37.55)\r\nYou\r\n\r\n\r\nAll right, what do you got?\r\n\r\n\r\nNikolas Hulewsky (30:43.988)\r\nAll right, do remember when we were talking a couple weeks ago about dogs with leaky gut?\r\n\r\n\r\nChris Koerner (30:49.646)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (30:54.386)\r\nWell, when I was talking to him and gave me this idea and I was going to bring it up last time, but we didn't have enough time. If you remember, he's selling supplements to pet owners to fix their dog's leaky gut and he charges a subscription for that and it's effectively a two month treatment, of course. And then people pay after those two months after the leaky gut is fixed for the supplements. But he has pretty high churn. So he currently has like three\r\n\r\n\r\n300 to 400 customers. Gosh dang it. Give me 30 seconds.\r\n\r\n\r\nNikolas Hulewsky (31:30.036)\r\nwhen it... This has nothing to do with Elgato. This is my camera. I've been running it for like two and a half hours and so it's overheating and I think it's just turning off.\r\n\r\n\r\nChris Koerner (31:40.44)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (31:43.612)\r\nSo give me a second.\r\n\r\n\r\nNikolas Hulewsky (31:56.238)\r\nHe's got 300 400 current customers, but he's had over 5,000 customers. When I was talking to him on my podcast, I'm asking him the question, I'm like, what are you doing with those 5,000? He's like, nothing. I'm like, what are you doing to nurture them? No. Do you sell to them? No. Do you sell any other products besides these supplements? No, not yet. It got me thinking. I'm like, how many other companies are like this? How many other Shopify or small businesses, Shopify stores or small businesses, e-commerce businesses just have massive email lists?\r\n\r\n\r\nthat they're not utilizing. And we've talked about going and buying email lists, which I still think is a really cool thing, or buying Facebook groups. But the idea that I had would be to spin up an agency showing small businesses how to better monetize their customer lists. So for example, these are some things that you can do with a customer list. You can send surveys, you can do special giveaways, you can announce product launches, you could just start a newsletter.\r\n\r\n\r\nto give generalized updates. But your customer list is very similar to LinkedIn. Many people only use LinkedIn when they're looking for a job. Many people are only using their customer lists when they're trying to sell to them actively. the question is, there's like three main questions. What's your process for capturing customer emails? What's your strategy for nurturing those relationships and how do you track and determine success? I don't think most small businesses know how to answer those questions. They may know on the front end.\r\n\r\n\r\nthey've launched a sales campaign and they've set up their funnels so that they can actually sell on a specific product. But once they're in the door, they're not doing a really good job of maintaining a relationship with their customers. So I think if you launched an agency around helping small businesses monetize their email lists, whether that's through a campaign, whether it's just nurturing them, whether it's starting a newsletter, whatever it is, and then selling that locally,\r\n\r\n\r\nwould be a really cool business.\r\n\r\n\r\nNikolas Hulewsky (33:58.622)\r\nWhat do think?\r\n\r\n\r\nChris Koerner (34:01.122)\r\nYeah, I like it. So not an email marketing agency that would basically manage someone's email, but it kind of like a consultancy.\r\n\r\n\r\nNikolas Hulewsky (34:11.74)\r\nA little bit, yeah, and I would only start with existing customers, because there's going to be a natural tendency to be like, well, I'll set up all of your funnels. What does your landing page look like? How do you capture emails? Once the email comes in and you've got a lead, where does it go? How are you responding to it? Within what period of time are you sending them information? I wouldn't do that. There's going be a natural inclination to do that. I would just focus on existing customers, because eventually then if you do a good job, the business owner is going to be like,\r\n\r\n\r\ncan you help me on the front end as well? They've got a leaky bucket. They're losing customers that they've already brought on. So help them patch the hole in their leaky bucket and then you can help them upstream to figure out a better way to set up their funnels. But I just don't think that they're capturing information nearly as well as they could.\r\n\r\n\r\nChris Koerner (34:59.544)\r\nSo you help them with their lead magnet, their email capturing system, and then you help them better monetize their emails.\r\n\r\n\r\nNikolas Hulewsky (35:07.102)\r\nWell, no, no, I would, you could do that. I would start with just their existing emails and just say, talk to the business owner. Cool. What are your goals? How does a customer typically purchase? What is the life cycle of a customer? How do you stay in contact with them and then help them craft a customer nurturing campaign or just strategy so that that keeps those leads warm. So that's the first thing. And then I would help them set up other funnels within their business to help with sales.\r\n\r\n\r\nChris Koerner (35:36.398)\r\nWhat do you think you're charged for something like this? And what do you, and I'll second question. What does an ideal customer look like? What size business, what industry?\r\n\r\n\r\nNikolas Hulewsky (35:46.452)\r\nI think I would start by charging one time project based. I know it's really sexy to be like, I charge a monthly fee. I just think if you charge a monthly fee, you're going to continually get blown up by these businesses, like set it up one time for them and let them run with it. And then if they have problems, they can come and contact you. I would charge probably five grand. And I would say, look, this is my ROI guarantee.\r\n\r\n\r\nIf you don't get X number of sales within the next Y days, I'll give you half of your money back. Did you know this with email lists of people who have purchased from you before? If you're a good company, those are the warmest leads that you have because there's a relationship with you already. So I would charge just straight up five grand. And then I would work into a monthly subscription to help them on the front end. That's the thing that's going to be changing a lot more is like,\r\n\r\n\r\nhere's a new campaign you can run, change the wording of this, this is what the copy should – it's going to morph into a more traditional marketing and sales agency. An ideal business size, I think it's going to be a sub-1 million business that has a history and a track record. Maybe they've been around for 15, 20 years. It's that landscaping company that we described earlier.\r\n\r\n\r\na bit newer because that's a little too old, a little too boomerish, but they've got a history. People know who they are. They've got customers. They've got something to work with that you can then show them the real value. If they don't have a big customer list already, then the offering doesn't work.\r\n\r\n\r\nChris Koerner (37:32.91)\r\nLet me tweak it. So what about, I think sub one million is probably too small for someone that's gonna spend $5,000 on something like this. I could be wrong, but what about the model of, Fast Tree Care, right? Our tree trimming business. We have a sizable email list and a phone number list that we've never once used, right? Total hypocrites, here we are talking about all this. We've never used it.\r\n\r\n\r\nNikolas Hulewsky (37:34.75)\r\nOkay.\r\n\r\n\r\nChris Koerner (38:00.654)\r\nIt's like it's human nature like hey, don't eat carbs. You do. You should take a brisk walk after you eat dessert. We don't and we know that we should. Right? Okay, so we're all hypocrites. But I just went through this a couple weeks ago because I'm like, all right, let's let's send a mass email for fast tree care to drum up some jobs. And I would bet I would bet 90 over 90 % of home service businesses.\r\n\r\n\r\nthat are sophisticated enough to collect emails are not regularly emailing their list. If they are, they're probably paying an agency, like a full service marketing agency, way too much money to do it for them, which means it's not personalized, it's cookie cutter, copy paste, not very effective, okay? So that means 90 % of the home services businesses out there, I would put at the ones between 500 grand and $5 million in top line revenue, you go in there and say, hey,\r\n\r\n\r\nNikolas Hulewsky (38:39.208)\r\nYeah.\r\n\r\n\r\nChris Koerner (38:58.222)\r\nWhat's the RMD use jobber? Okay, cool. We know jobber. We love jobber. Here's what we're do for $0. We're going to go into your jobber account. We're going to segment your list. We're going to find people that you gave a quote to but never purchased. We're going to find people that purchase but never purchase you again. We're going to find people that just opted in for whatever reason, and they've never bought from you. And we're going to start generating jobs for you from your existing customer list. Well, I could send an email anytime I want. Yeah. But you know, respectfully, you don't you don't know what you're doing.\r\n\r\n\r\nNikolas Hulewsky (39:25.139)\r\nAre you?\r\n\r\n\r\nChris Koerner (39:27.918)\r\nAnd even if you did, like you just need someone to click the button. You need someone to hold you accountable. We'll just do it for you. Well, what do you charge? Well, nothing. We're going to charge 15 % of every job that we bring you, or we're going to charge you $50 for every quote that we generate for you, every lead that we generate. And that's it. We're just, it's, it's an alignment of interest of incentives.\r\n\r\n\r\nNikolas Hulewsky (39:49.204)\r\nYeah, I would go. I like that pricing model. I would go the lead route is it's hard to say like it's hard just hard to track like to that job closed that they pay what was the actual price.\r\n\r\n\r\nChris Koerner (39:58.028)\r\nWell, it's, it's not hard if they are like diligent at using jobber, because then it would, it would just be in jobber and we're already in jobber. But if they're not, if they have jobber, right. But we would need access to do this anyway, but they might like have jobber on paper and pay for it every month, but not like be actually putting their jobs in there. And in that sense, so maybe it would just be a gut call when you log in a jobber and it's like, clearly you're doing everything in here. I'm going to charge a percentage of revenue generated or\r\n\r\n\r\nNikolas Hulewsky (40:06.312)\r\nThat's if they give you access.\r\n\r\n\r\nNikolas Hulewsky (40:15.956)\r\nYeah. Yeah.\r\n\r\n\r\nyou\r\n\r\n\r\nChris Koerner (40:26.68)\r\nclearly you're paying for job or you're just collecting emails. But I don't know, like job or shows your revenue is zero. I see nine wrapped trucks in your parking lot. That's clearly not true. I'm just going to charge perly generated, right?\r\n\r\n\r\nNikolas Hulewsky (40:40.222)\r\nYeah, I love that.\r\n\r\n\r\nChris Koerner (40:41.678)\r\nI think that could be a really good business. It's just hard. Like philosophically, it's hard for a business owner to shell out thousands per month or one time for some service and just hope and pray that it works. It returns positive ROI.\r\n\r\n\r\nNikolas Hulewsky (40:59.636)\r\nYeah. I mean, we've dealt with that a ton. You think you have a really good idea and you're like, this is amazing. I could generate a hundred thousand dollars a month for this person. It makes all the sense in the world, but there's still that step of faith. Like, okay, I'll pay you five grand for this. What's my guarantee that I'm actually going to get it? So you better have a really, really good, really well dialed in offering.\r\n\r\n\r\nChris Koerner (41:24.042)\r\nOne. All right. Quick question for you. Do you think that there's a business here? I had a caller reach out my Q and a episode and he wants to start a business. That's like a business owner, accountability platform. There's a business out there that does this for health and fitness. You pay him 600, $700 a month. They check in with you every day via text. They don't eat this. Don't eat that. What'd you eat today? I think there's a lot of automations involved, but there is an actual real person on the other end of the phone.\r\n\r\n\r\nthe company's doing well, seemingly they're growing. He, he wants to do this for business owners, both people starting a business and people running a business and accountability partner. Okay. I'll tell you what my answer was to him. Actually, I want to hear what you think. Is this a viable business model? Why or why not?\r\n\r\n\r\nNikolas Hulewsky (42:12.628)\r\nDo I think, what my camera turned back on? Do I think it's a viable business model? It depends. To me that you're just describing a mastermind, whether it's EO, YPO, Vistage, Tiger 21, Hampton.\r\n\r\n\r\nChris Koerner (42:29.454)\r\nWell, this is one to one though. This is like, it's like a business partner with no equity. It's an accountability partner. Hey, you do those cold emails today? As opposed to a mastermind is like, I'm gonna meet with these eight people. We have group chat. This is like very one to one personalized.\r\n\r\n\r\nNikolas Hulewsky (42:44.702)\r\nI know. I'm giving you my justification. You're asking me, do I think it's a viable business? Yes, because it's similar to those companies and businesses that already exist and a function of those masterminds is accountability. Yeah. Do I think it could work? Yes. Does he talk about pricing?\r\n\r\n\r\nChris Koerner (42:46.894)\r\nOkay.\r\n\r\n\r\nChris Koerner (43:06.904)\r\nAnd no, I'm just assuming he's in the same ballpark, hundreds of dollars per month.\r\n\r\n\r\nNikolas Hulewsky (43:12.916)\r\nHere's why I like the idea. I like the idea because it's really easy to not hold yourself accountable. I'll do it tomorrow. this came up and I wasn't able to get it done. Having somebody check in with you every day, even if it's an annoyance, you're going to get better results. There's a reason why – what does Sam Par always talk about? My body tutor, I think is one of those. They work because there's an accountability, there's a feedback loop built in.\r\n\r\n\r\nChris Koerner (43:35.298)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (43:42.086)\r\nthe process. So I think that it's a good idea from that standpoint. I think the difficulty of this is going to be the intimate nature of it. In order for me to have an accountability partner, I'm going to have to open myself up and I'm going to have to tell them about my life, my business, things that are important to me, et cetera. so I think there's a bigger trust factor there that you'd have to overcome. You'd have to really get them to understand that\r\n\r\n\r\nyou're not going to disclose things or that you actually have insights or you're going to be consistent. So think that might be one of the biggest hurdles is getting people to trust.\r\n\r\n\r\nChris Koerner (44:23.394)\r\nYeah, I agree. think if you trust the person that's your accountability partner, then you're more likely to keep paying and stay accountable and do the thing. But I think getting there has to take so much time that it needs to be a more expensive product. Right. And so\r\n\r\n\r\nNikolas Hulewsky (44:37.236)\r\nI think so too. I also think it's like you can't be a nice accountability partner. It can't be like, what happened? tell me about why you weren't. I kind of think you need to kick in the pants a bit of like, what's the freak, man? What are you waiting for? You said you're going to do it.\r\n\r\n\r\nChris Koerner (44:44.269)\r\nRight.\r\n\r\n\r\nChris Koerner (44:52.598)\r\nYeah, right. But if it's just some if it's just some stranger in an SMS, it's like, the frick is this guy? I don't care if I'm gonna do this or not, you know.\r\n\r\n\r\nNikolas Hulewsky (44:58.036)\r\nYeah, exactly.\r\n\r\n\r\nChris Koerner (45:02.798)\r\nI think it's interesting. I saw this LinkedIn post where this guy, he had a picture of a $1,000 check. And he's like a real estate broker. And he said, every month, I write my boss a $1,000 check to his name. And if I don't make 1000 cold calls that month, then he can cash the check, keep my $1,000. And I've never I've never once broken it. And it's kept me accountable. And I think that's interesting. Right? I think it should be it's like the barbell, right? This needs to be like 2000 a month. And like\r\n\r\n\r\nNikolas Hulewsky (45:07.412)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (45:19.348)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (45:24.244)\r\nThat would be interesting.\r\n\r\n\r\nChris Koerner (45:30.816)\r\nsomeone legit, someone you, which is just a coach. It's just a business coach, which is a well established industry. It needs to be that, or it needs to be like a free app where you deposit money and that money is kept. Kind of like the idea we talked about a couple of weeks ago, that money is kept if you don't do the thing and you doing the thing has to be provable somehow. It can't just be on your honor.\r\n\r\n\r\nNikolas Hulewsky (45:45.214)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (45:52.69)\r\nI like that idea. I like that idea because then there's real skin in the game.\r\n\r\n\r\nChris Koerner (45:58.562)\r\nYeah, like maybe you start, go ahead. Maybe you start super niche where it's like an accountability partner for, for cold outbound and you have to link through an API to your, your open phone or to your whatever it is. So it knows for sure that you're doing that thing. And if you are, then you'll get your money back, maybe less than 5 % processing fee. And if you're not, the money's gone.\r\n\r\n\r\nNikolas Hulewsky (45:59.444)\r\nIf I don't know. There you go.\r\n\r\n\r\nNikolas Hulewsky (46:22.76)\r\nYeah, it has to be things that are easily measurable. Like my mind goes to, let's say somebody wants to grow a social media presence and that we're knee deep in that world right now. That's very easily measurable. Did you post three times today? I don't care about the quality, just did you post? Did you write what you said you were going to write? Cool. Now I know whether or not I can keep the money or whether or not you get refunded. It would be much, yeah, picking a niche I think would probably be the way to go. Hey, I'm gonna help.\r\n\r\n\r\nChris Koerner (46:24.492)\r\nAhem.\r\n\r\n\r\nChris Koerner (46:39.363)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (46:53.414)\r\nentrepreneurs who have a hard time losing weight. Like that might be a niche or like I'm going to help entrepreneurs who have wanted to learn Spanish, but never have. It's like, all right, sign up for Duolingo and I know exactly whether or not you've done the courses and so you get your money back. Yeah, I like focusing on the vertical or niche. So yeah, think it could be cool. I think I got that same question from him.\r\n\r\n\r\nChris Koerner (46:58.542)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (47:19.374)\r\nEhem.\r\n\r\n\r\nNikolas Hulewsky (47:21.544)\r\nI feel like we've gotten that a few times from him.\r\n\r\n\r\nChris Koerner (47:24.92)\r\nMaybe he blasted me up like four different ways.\r\n\r\n\r\nNikolas Hulewsky (47:28.38)\r\nYeah. What I would say to him, can't remember his name. I know I could find it because I read the same thing. What I would say to you, know, dragonslayer69420 is if you you've asked us this question several times, go freaking test it. Like at this point, if it's on your mind and you've been like, you can't stop thinking about it you're trying to get external validation from somebody else, just go do it. Just go see if it works or not. That's going to be the real validation whether or not you can get somebody to pay for it.\r\n\r\n\r\nChris Koerner (47:56.91)\r\nturn it here first. Bias for action. Trump's all. Start it before you have it.\r\n\r\n\r\nNikolas Hulewsky (48:02.356)\r\nAll right, this is a one. Do you want to do a Mary Day Killer no? That's fine. He's whatever. No, it's fine.\r\n\r\n\r\nChris Koerner (48:04.334)\r\nAlright.\r\n\r\n\r\nChris Koerner (48:10.414)\r\nWhat do you think?",
  "metadata": {
    "duration": "",
    "date": "2024-12-27",
    "platform_source": "Google Drive"
  }
}