{
  "episode_number": "86",
  "episode_title": "AI: Threat or Opportunity? How This $9 Million Marketing Agency is Embracing the Future with Brandon Doyle",
  "guest_name": "Brandon Doyle",
  "business_name": "Wallaroo Media, Arvo Digital",
  "transcript": "﻿Nik (00:00.78)\r\nAll right, Brandon, welcome to Niconomics, friend stoked to have you. Why don't you quickly just give us an idea? What is your business and how do you make money?\r\n\r\n\r\nBrandon (00:05.989)\r\nGlad to be here.\r\n\r\n\r\nBrandon (00:11.141)\r\nYeah, thanks for having me. My name is Brandon Doyle, my business. So I have two marketing agencies. One is called Walleroo Media. The other is called Arvo Digital and we're digital marketing agencies focused on the e -commerce space. Walleroo does everything on the paid side. Arvo does everything on the organic side. And yeah, we work with the econ businesses to help them scale profitably.\r\n\r\n\r\nNik (00:32.524)\r\nOkay, so I'm pretty stupid. When you say everything on the paid side, are you talking about like Google pay per click, Facebook ads, like anything that's media ad buying related? Okay.\r\n\r\n\r\nBrandon (00:41.826)\r\nYeah. Yep. Yeah. So yeah, Google, Facebook, TikTok, Snapchat, Twitter, podcasts, digital billboards. Yeah.\r\n\r\n\r\nNik (00:50.306)\r\nwow. OK, basically any platform you can buy digital ads based on.\r\n\r\n\r\nBrandon (00:55.345)\r\nConnected TV, yeah, yeah. Digital ad space, creative videography, photography, AI -generated photography, whatever. All that that goes with it. Yeah, that's the wall of your side. And then Arvo's more like email and SMS marketing, search engine optimization, content marketing, social media, that kind of stuff.\r\n\r\n\r\nNik (01:14.286)\r\nWhat's your ideal client look like?\r\n\r\n\r\nBrandon (01:16.689)\r\nAn e -commerce brand that is, let's say, between five and 20 million in revenue, that range. And, you know, we take them from there and just keep it going.\r\n\r\n\r\nNik (01:27.694)\r\nSo e -commerce is going to be typically brands that are selling a product, physical product online. Okay, so no education, no courses, no digital products of any kind.\r\n\r\n\r\nBrandon (01:32.133)\r\nYeah, you have physical products.\r\n\r\n\r\nBrandon (01:40.753)\r\nNo, mean, we could and we have, probably, yeah, 90 % of ours is physical products. 90 % of our clients, yeah.\r\n\r\n\r\nNik (01:44.408)\r\nBut your bread and butter is products.\r\n\r\n\r\nNik (01:50.648)\r\nGive just a brief idea to the audience. How big are your businesses revenue -wise and employee -wise?\r\n\r\n\r\nBrandon (01:56.817)\r\nEmployment, I don't do payroll luckily, so I don't know how many employees we have. I would guess...\r\n\r\n\r\nNik (02:00.546)\r\nYeah.\r\n\r\n\r\nYou can make it up. Nobody's going to know.\r\n\r\n\r\nBrandon (02:06.385)\r\nYeah, hundreds of thousands of employees. No, probably like 35 to 40 full -time employees, like in the US, we use overseas people aside from that. And then revenue 2024 will probably do, it'll be between eight and nine.\r\n\r\n\r\nNik (02:08.503)\r\nYeah\r\n\r\n\r\nNik (02:14.189)\r\nOkay.\r\n\r\n\r\nNik (02:28.782)\r\n8 and 9. that on both sides combined?\r\n\r\n\r\nBrandon (02:31.931)\r\nYeah, both combined. In my head, I kind of treat them as one. Yeah.\r\n\r\n\r\nNik (02:35.544)\r\nHow do they, any idea like what the revenue split is from the paid side versus the organic side?\r\n\r\n\r\nBrandon (02:39.409)\r\nIt's pretty close to 50 -50.\r\n\r\n\r\nNik (02:42.766)\r\nDang. So how did you get into this space? Sounds like you have a very targeted business like e -commerce, paid and non -paid marketing. Most people kind of are like everything to everybody that at least that I've seen. How did you get in?\r\n\r\n\r\nBrandon (02:56.817)\r\nMm\r\n\r\n\r\nBrandon (03:01.553)\r\nYeah, so my parents had a website built for them in 2008. Good timing, great recession and all that. And yeah, so this was...\r\n\r\n\r\nNik (03:09.698)\r\nGreat timing. tell me their business was like a real estate company?\r\n\r\n\r\nBrandon (03:14.513)\r\nNo, that would be funny. No, actually, it was custom Letterman jackets for high school athletes. That's what they did. So they had a website made where you could customize your own Letterman jacket online. It was pretty cool. It was actually really cool, especially at the time, not really been done before where you could make all the changes to a garment and see it all in front of your eyes. Anyway, though, that was their first foray into digital, their first website. So they spent all their...\r\n\r\n\r\nNik (03:16.056)\r\nyou\r\n\r\n\r\nNik (03:22.848)\r\ncool.\r\n\r\n\r\nBrandon (03:43.473)\r\nsavings they had on the website. So it launches, it's getting roughly zero visitors a day. And so they asked me to find them some sort of marketing company to help them get traffic. So I started going out and getting bids and the cheapest bid I got was six grand a month for SEO only and they didn't have any money, which yeah, I know that's a lot, especially in 2008, but that was literally the cheapest bid I got. So I think just the SEO companies were killing it back in the day.\r\n\r\n\r\nNik (04:03.851)\r\nWow.\r\n\r\n\r\nBrandon (04:12.963)\r\nSo they couldn't afford that. I said, well, what if I learn, you know, maybe you give me equity, profit share, whatever. And they're like, yeah, sure. Do it. So I started learning online on Moz. It was SEO Moz. It's now Moz. That was a good website to learn and read it and stuff. And I learned and I got good at it it was really fun.\r\n\r\n\r\nNik (04:30.69)\r\nGive me an idea. How old were you? What were you doing at the time?\r\n\r\n\r\nBrandon (04:33.585)\r\nSo I was a sophomore to junior in college at the time. Yeah. And yeah, so by like a year later, they were on like the top half of page one for like 200 different keywords. So it was going super good. Yeah. Their business was better than ever. I was still in college. I started getting referrals from my parents, you know, of other businesses. Cause I don't know. They were trying to help me cause I helped them. And\r\n\r\n\r\nNik (04:37.422)\r\nOkay, you're young, got it.\r\n\r\n\r\nNik (04:49.166)\r\nThanks.\r\n\r\n\r\nBrandon (05:03.665)\r\nThen, so I was majoring in finance at BYU. I graduated in 2010. I worked in finance for a year and a half, purposely took a job, not on Wall Street, because I knew I didn't want to do that grind, number one. Number two, that I was doing this on the side and I would quit eventually. So I quit a year and a half later. And in the span, I quit when my wife was three months shy of birthing our second child. Not, yeah.\r\n\r\n\r\nNik (05:31.202)\r\nGreat timing.\r\n\r\n\r\nBrandon (05:33.581)\r\nAnd right when I quit, all the clients I had, which was maybe five, it was more than enough to pay the bills. Literally within the span of like two weeks, all of them fired me for like crazy reasons. It was like one, the person I knew there, they got pushed out. The other one sold to someone that already had a solution. The other one retired and just shut it down. So was just like all these random reasons. Nothing was, you know, my fault or whatever.\r\n\r\n\r\nNik (05:46.669)\r\nReally?\r\n\r\n\r\nBrandon (06:02.937)\r\nAnd so, yeah, I had quit two weeks later, nothing. And it was like, okay, this is not ideal. So I sold alarm systems door to door in college. So anyway, yeah, so I kept, I went out for like a week, three different times during the first six months, let's say, of starting Wallaroo to pay the bills and it works luckily. And so anyway, that's what I did. That's how it started.\r\n\r\n\r\nNik (06:14.478)\r\nOf course you did.\r\n\r\n\r\nBrandon (06:32.433)\r\nI had a co -founder, my best friend that I met at a church camp when I was a teenager. We started this thing and yeah, 15 years later, we're still doing it. So it's going good.\r\n\r\n\r\nNik (06:45.806)\r\nDude, OK, I got some questions for you real quick. Your parents company is that still around?\r\n\r\n\r\nBrandon (06:51.887)\r\nYeah, still around. Yeah, buildyourjacket .com. It's going good. Yeah. Yeah.\r\n\r\n\r\nNik (06:53.735)\r\nHow's it doing?\r\n\r\n\r\nNik (06:57.398)\r\nIs it that dude? That's amazing. That's it's pretty. It's pretty cool to that you basically you're in college, so couldn't work on anything full time anyways, like you didn't need a full time job. And you were able to essentially apprentices even the right word, but you just you had a guinea pig to learn SEO in particular, which was awesome.\r\n\r\n\r\nBrandon (07:07.697)\r\nMm\r\n\r\n\r\nBrandon (07:14.543)\r\nYeah, yeah, yeah. Yeah, it was that and then it was Google Ads too. But yeah, yeah, it's just those two.\r\n\r\n\r\nNik (07:23.214)\r\nI think what's interesting, I don't know if most people know this, I'm LDS Mormon. And so I have 50 % of my friends who sold either alarms, pest control, something in the summer, because after we come home from our missions, it's like, well, I know how to knock doors. I guess I could do that for a little while. I never sold just because I was like, God is the only thing I'm ever gonna try to sell, because I'd suck at this stuff. But you can make bank doing summer sales.\r\n\r\n\r\nBrandon (07:39.59)\r\nYeah.\r\n\r\n\r\nBrandon (07:46.385)\r\nYeah.\r\n\r\n\r\nYou can and I got roped into it, but I mean, there's a lot of money if you get somebody to sign a three year contract paying, you know, 40 to 50 bucks a month for an alarm system. And you can be dishonest and do really, really well. I never did that, but even if you're honest, you can still do well. And even if you learn so much, like I want my kids, I don't know that I want them to knock doors for a summer job.\r\n\r\n\r\nNik (08:11.182)\r\nthink like\r\n\r\n\r\nBrandon (08:19.237)\r\nbut I want them to have a super hard job like that because if it's just you by yourself and it's up to you to go make your own money by walking around a town and trying to get someone to buy something that you're selling, there are just so many skills and modes of work ethic that you get from that.\r\n\r\n\r\nNik (08:39.896)\r\nmean, I can't even imagine you quit your job, all your clients leave, your wife's gonna give birth in the next three months. It's one thing to have like, it's my summer job in between sophomore and junior year, and hopefully I'm gonna make as much money as I can, because I'm going back to school. It's another thing to be like, I have a family. I have to sell this stuff. What do you feel like were, I don't know, one or two of the main lessons you learned from summer sales or knocking door to door?\r\n\r\n\r\nBrandon (08:56.997)\r\nYeah.\r\n\r\n\r\nBrandon (09:05.797)\r\nI mean, every no is a closer to a yes is a good lesson, but it's true. that, and you know, I'm at the S2 and went on a mission to Brazil for two years. So you learned that during that time, but that's definitely a skill that I still use in with my marketing agencies to this day. Like if somebody, if I'm trying to get somebody as a client and if they say no, well, that doesn't actually mean no, not to me.\r\n\r\n\r\nIf I can still provide them something that I think is going to help them scale and I'll do everything I can to figure that out. And if they still say no, not right now, I'll say, hey, no worries. You know, let's chat in three months. And if you have any questions in the meantime, hit me up. I would love to strategize with you, but yeah, let's just chat in three months or whatever. And so I'm just always like trying to keep that relationship going. And I recently closed a client like six months ago that I first started talking to 12 years ago.\r\n\r\n\r\nNik (09:52.504)\r\nMm\r\n\r\n\r\nBrandon (10:02.225)\r\nAnd they were never a client until six months ago. Yeah, not ideal. But I just don't give up. I don't give up. if I talk to you, you're going to become a client of mine eventually, unless you exit the industry. That's sort of my philosophy.\r\n\r\n\r\nNik (10:06.03)\r\na 12 years clothes cycle? Jeez, ideal.\r\n\r\n\r\nNik (10:20.484)\r\nmy so. Alright, so you quit your job, lose your clients, your wife's about to give birth. You decide to go. You sell alarms, whatever like a week at a time three times. How long in between when you lost all your clients and when you built back up that book of business?\r\n\r\n\r\nBrandon (10:36.401)\r\nSo probably five, let's see, five months in, it was good enough to be like, hey, let's get an office. Me and my co -founder, like a $400 a month office. But like it was enough time to warrant. We already had enough clients just from going to local community events and stuff to do that. And maybe like six months in, we hired our first part -time employees.\r\n\r\n\r\nNik (11:04.366)\r\nWas that stressful for you or is it only stressful like looking back?\r\n\r\n\r\nBrandon (11:11.301)\r\nIt was stressful in the moment, but I was never worried. Like I knew it was the right move. So it was just like, okay, well another challenge, but let's do this.\r\n\r\n\r\nNik (11:19.914)\r\nI have a lot of moments in my career where looking back, I'm like stressed out for myself, but in the middle of it, I didn't feel super stressed. Like, yeah, I was worried and anxious, but I wasn't like, what did you say? You're like, I think you said worried or like you weren't like doubting yourself necessarily. I think that's an interesting, it's an interesting thing. Cause like you look back with years of experience and you're like, man, this could have gone wrong. This could have gone wrong. This could have gone wrong. But in the moment you don't necessarily know what you don't know.\r\n\r\n\r\nBrandon (11:39.142)\r\nYeah.\r\n\r\n\r\nNik (11:49.521)\r\nand you kind of make it through.\r\n\r\n\r\nBrandon (11:50.353)\r\nTotally. But also it's like I look back at that and you know that was at this point that was almost 13 years ago. Like hey good job man like the young version of me but that was like a simple time too like in a way it was stressful but it was just part of process but also like man the stress or the simplicity of the business at that time versus now. I look back on that sometimes.\r\n\r\n\r\nNik (12:11.021)\r\nYeah.\r\n\r\n\r\nBrandon (12:19.865)\r\nLongingly, I guess.\r\n\r\n\r\nNik (12:21.71)\r\nWell, yeah, it is like a different period of life. Like you look back on that and you're like, man, my wife's about to give birth. I already have a child. I gotta, I gotta make ends meet. That's stressful. And then you like get to, you know, years down the road and it's like, my gosh, I owe the supplier $150 ,000. I just lost this one client. Potentially I'm on the hook for half a million dollars. Like the scale grows immensely. And so I agree with you. It's like, it's still stressful. It's just different kind of levels of stress.\r\n\r\n\r\nBrandon (12:50.469)\r\nYeah, yeah, yeah, totally.\r\n\r\n\r\nNik (12:52.762)\r\nif you ever heard Alex Hormozi talk about his launch.\r\n\r\n\r\nBrandon (12:55.899)\r\nYeah.\r\n\r\n\r\nNik (12:56.622)\r\nwhere he basically he launched a business. Turns out he partnered with some guy who was a fraudster stole the money, then he launches another business. Turns out these clients found out they could refund essentially what they paid him. And so he's like hurting in cash, he has to make $100 ,000 in profit in a month. And he's like, All right, what am going to do? I think it's like, those moments are just so foundational to your eventual success, sort of the way that you decide to respond to them. All right, so six months in, things are rolling well.\r\n\r\n\r\nBrandon (13:15.739)\r\nYeah.\r\n\r\n\r\nBrandon (13:20.684)\r\nyeah, for sure. Yeah.\r\n\r\n\r\nNik (13:26.924)\r\nWhat were you doing at that time? Was it just SEO?\r\n\r\n\r\nBrandon (13:30.115)\r\nIt was pretty much just this year. Yeah.\r\n\r\n\r\nNik (13:32.142)\r\nOkay, when did you switch to the dark side and start doing paid stuff?\r\n\r\n\r\nBrandon (13:36.491)\r\nprobably like six months in even maybe a year. Yeah. And then shortly after that we started managing Facebook pages. And then what would have been next? And then just other social media platforms from there. Yeah. Facebook ads.\r\n\r\n\r\nNik (13:50.03)\r\nHas it been this business the whole time? Has it been this business and you're just expanding offerings or have you also been, were you also like bringing on different types of businesses that were maybe complimentary?\r\n\r\n\r\nBrandon (14:02.097)\r\nNo, mean, I always, anytime I was talking to a client, if they asked if we did something, I would just say yes, right? So it became website design. We started doing website design. We started doing PR. So we became this full, full service that was technically like maybe, you know, 12 different things. That's what we morphed into until 2017. And then in 2017, I said,\r\n\r\n\r\nme and my co -founder, we're like, hey, let's just go all in on the thing we're best at. Cause it's hard on the phone with the client or trying to say, well, actually we're great. We're the best at all 12 of these things, right? That's not possible. So it was like, let's go all in on social ads, social media advertising. So that's what we did 2017 all in. And then whatever else came in, we just refer it out, right? And so that's what we did.\r\n\r\n\r\nBut we were referring out a lot of stuff and I started getting mad with how much money we were referring out. So I was like, well, what if we like ramp up another agency, find someone else to be like the day -to -day operator and we won't refer out as much. So that's what we did. So Walleroo was first and then we launched Pouch. And so Pouch was just doing SEO and content marketing. And then we...\r\n\r\n\r\nNik (15:04.674)\r\nYou\r\n\r\n\r\nBrandon (15:28.945)\r\nAnd so that started going well. So that was in like the fall of 2018 and it started going really well. We got this guy named Kyle to run that one. And so I was still like the CEO, day -to -day CEO of Walleroo. Kyle was running Pouch. And since that went well, then we started another one in May of 2019 that was doing web design and web development. And that was going well. And then we did another one.\r\n\r\n\r\nSo then we had email and we had social and we had like a smaller version of Walleroo and then we had a Web3 one and then we did an NIL one with college athletes. So we had like six agencies each with their own day -to -day operator. And at this point, yeah, at this point, I, by the time we got to like number six, I stepped out of the day -to -day at Walleroo. So basically me and my co -founder were over the six and each had\r\n\r\n\r\nNik (16:14.478)\r\ncheese\r\n\r\n\r\nBrandon (16:28.393)\r\none or two people that ran them. And you know, we would basically be the back office slash sales of all six. And I was going to say it was going well, but it wasn't going great. It was going okay.\r\n\r\n\r\nNik (16:41.486)\r\nWell, it's like, me, give me an idea. Like, right now you're at $9 million a year. 2017 2018. What like what was the size of the company?\r\n\r\n\r\nBrandon (16:51.057)\r\nnot not not big 2017 1 mil 2018 one and a half no less than 0 .2\r\n\r\n\r\nNik (16:56.502)\r\nOkay. And so when you have all, when you get to the point where you have all six of these, kind of how big were you?\r\n\r\n\r\nBrandon (17:03.377)\r\nYeah, so that would have been like when we still by the time we had six and then still had six would have been would have been like 2021. So 2021 we had six going at one time and you know maybe we got to the point where we were at like maybe only like five million in revenue because a lot of them were just getting going.\r\n\r\n\r\nNik (17:25.358)\r\nOkay, so from. Okay, so from like 2013, whenever you graduate from BYU. Or not sorry, but when you leave your finance job until 2021, you've got you've grown from zero to a $5 million agency. But you've got all these different service lines, all these different operators, you've essentially built yourself a little hold Co is what you've done, even though they're like very complimentary services. And it just started to get more stressful or kind of what was the tension you guys are running?\r\n\r\n\r\nBrandon (17:45.233)\r\nMm\r\n\r\n\r\nBrandon (17:52.247)\r\nWell, we, yeah, what we found out is it's really hard to find an amazing operators. That's very difficult. And because the first time we did it, we did find an amazing operator. We thought it was gonna be easier. So we were getting people that we like, we like, would get someone that we know already knew that was already running something in that industry for years, or at least experienced in that industry for years and be like, we'll teach him or her the stuff they don't know.\r\n\r\n\r\nNik (17:57.624)\r\nYeah.\r\n\r\n\r\nNik (18:05.463)\r\nMmm.\r\n\r\n\r\nBrandon (18:20.688)\r\nBut it's hard to teach. It's hard to teach. It's hard to teach all that stuff that a great operator needs. So, yeah, anyway, it was one, it became six, and then towards the end of 2022, the six, which was eventually seven became two. And those are the two that we have now, Walleroo and Arvo, which was the original spin -off pouch. We just renamed it Arvo. So it's Walleroo and Arvo.\r\n\r\n\r\nNik (18:25.026)\r\nway harder to teach.\r\n\r\n\r\nNik (18:48.942)\r\nDid you keep two operators? Like, okay. And then did you shut down the rest or did you just essentially absorb them into those two entities?\r\n\r\n\r\nBrandon (18:53.167)\r\nYes, there's two operators total.\r\n\r\n\r\nBrandon (19:00.963)\r\nLike half we shut down and half we absorbed.\r\n\r\n\r\nNik (19:04.014)\r\nWas that hard for you?\r\n\r\n\r\nBrandon (19:06.563)\r\nyeah, because I didn't want to fail. Like I hadn't like officially, I felt like I hadn't officially failed yet period in business. So to me, that was just submitting failure both to myself, you know, to my wife, whoever else close to me would know, but also to the operator, like these people were friends. So it's like, man, I failed you. I'm sorry, but like we can't do this.\r\n\r\n\r\nNik (19:29.314)\r\nwhat was the moment or series of moments that it was like, dude, we gotta pare this down.\r\n\r\n\r\nBrandon (19:35.575)\r\nIt was just like, I mean, it was a lot of time trying to manage and help six different companies all in a similar industry, just doing different things, you know. But also, it just like it was too fragmented. We weren't making enough money. And, you know, when when me and my business partner started Walrugh initially, it was always like\r\n\r\n\r\nNik (19:45.509)\r\nMm\r\n\r\n\r\nBrandon (20:03.865)\r\nEvery entrepreneur has their own goals with their life, which is awesome, which is one of the things that makes entrepreneurs entrepreneurs. But ours was always like, we want to run a business and grow a business to have a great lifestyle, to be able to spend lots of time with our families. That was the goal. It wasn't to like get rich and scale like crazy or anything, which maybe isn't the norm. I don't know, but.\r\n\r\n\r\nThat's what we chose. And so that was kind of the, you know, part of the impetus of eventually having six or seven was, well, we want to like step away. And we got over eager, multiple times, obviously in trying to achieve that goal and only more recently have, you know, figured it out. guess I would say.\r\n\r\n\r\nNik (20:54.634)\r\nWhat did you realize going through that process? Was it that it's hard to manage that many people or was it that simplicity makes it easier to grow a business? What was the ultimate decision point where you said, yeah, it sucks, these guys are my friends, but I gotta eliminate this, we gotta consolidate because this isn't working? Were there any pivotal moments?\r\n\r\n\r\nBrandon (21:19.407)\r\nI don't think there was one, no, there wasn't like one thing. It was more like us sort of seeing everything coalesce at once. It was like, okay, if we're not giving the operator majority equity, which we weren't, we're gonna always care about it more than them. Okay, there's one thing. Next thing, it's hard to train a non -great operator to be a great operator. And also, okay, so that's another thing. Agency life is not easy.\r\n\r\n\r\nSo you have to also find the person that's totally fine with all the ups and downs of agency life. Another one, takes a lot of time. Like it was just like us kind of realizing all these different challenges all at once after having done it for a year and a half to two years. And.\r\n\r\n\r\nNik (22:04.876)\r\nWas the filter, was the filter, hey, we've got these great businesses. Let's just keep one or two of these guys to continue operating. Or was it the opposite? Hey, we've got two really great guys that we know can do this model where they can be the operator. Let's consolidate these businesses under them.\r\n\r\n\r\nBrandon (22:25.649)\r\nYeah, it was kind of a combo and also realizing, I guess in the same vein, which would be like one of my biggest pieces of advice to anyone that would want to go down the hold co route or the multi -company route, whatever you want to call it is like, just focus on the ones that are really making you money. And if you just grow those by like 10 % a year, like it's really starts adding up and you don't need to get fancy.\r\n\r\n\r\nLike don't be a rush to step away or get fancy or don't be seduced by the sexiness of launching a bunch of things or trying to make like this extra passive income of, you know, 2K a month on the side. Like if you have something that's doing seven figures, let alone eight, a year, 10 % a year growth adds up very fast. Yeah.\r\n\r\n\r\nNik (23:16.578)\r\nYeah, very, fast. For me, when I've had to make hard decisions, I've had to fire friends, I've had to lay off a lot of people, and it freaking sucks. It just is awful. But many times before D day, I knew that I had to do that stuff. I knew for a long period of time, and I it's just my personality, like I procrastinated it, I justified, or I pushed it off because it was going to be uncomfortable.\r\n\r\n\r\nor maybe I liked the appeal of, no, I 17 companies and I want to continue to say that I own 17, not just two. Was there anything like that for you that like, did you know for a long time that that was the right decision? And it just took you a while to finally execute on it or, or once you knew you executed right away.\r\n\r\n\r\nBrandon (23:53.488)\r\nMm\r\n\r\n\r\nBrandon (24:04.463)\r\nNo, I definitely didn't execute right away. Yeah, it was, it took a while because I was close to them. you know, we were kind of hoping maybe some of them might figure it out on the, on their own, you know, and eventually, you know, some did, but yeah, I didn't want to be the one that like ended it because then, yeah, it's just, it's just tough.\r\n\r\n\r\nNik (24:27.438)\r\nDude, it is so freaking hard. And it's something I've had to learn over time. it's something honestly, I've had to learn over and over again. I've adopted this philosophy that like clarity is kindness. Because what I've learned in those situations is that every time that it finally ends, the person on the other side is relieved because they felt this tension like they knew that they were underperforming. They knew that they weren't meeting expectations.\r\n\r\n\r\nsome weirdness in the relationship had developed because like I started avoiding them and I wasn't talking to them as much. like, so like the personal dynamic all of a sudden becomes weird. But then once we kind of clear the air and it sucks, it's like this heavy weight is sort of lifted. And when I get into these situations now, I have to remind myself like this will pass. Like this is not the end of the world. They're probably in it. They probably understand what's going on as well. Have you found that? Yeah.\r\n\r\n\r\nBrandon (25:20.591)\r\nYeah. yeah, totally. Yeah. Every single time, I would say.\r\n\r\n\r\nNik (25:28.13)\r\nIt's hard and it's hard because you you know that you get to know that intellectually, but it's still hard to like fire somebody that you've been working with for long time. I was going to ask you. I think one of the really cool things about the space that you're in. Is it reminds me of the like where artificial intelligence is now where companies are like, well, I know this is going to be important, but I don't know what to do. And so you know I'm I haven't seen it yet, but I know more and more agencies are going to be popping up helping mom and pop.\r\n\r\n\r\nBrandon (25:47.217)\r\nMm\r\n\r\n\r\nNik (25:57.11)\r\nsmall businesses implement artificial intelligence, whether it's through automation, whether it's through system design, etc. And you like remind me of, you know, the generation before that where it's like, Well, I know advertising on Google is important, but I really know how to do that. And so you you started a business that was riding a massive wave, which is phenomenal. Were there any cool experiences along the way where you're like, Why am I doing this for this customer? Like, I'm just I'm just some idiot from Utah, and I'm managing\r\n\r\n\r\nBrandon (26:01.259)\r\nyeah.\r\n\r\n\r\nBrandon (26:09.531)\r\nMm\r\n\r\n\r\nBrandon (26:16.277)\r\nYeah.\r\n\r\n\r\nBrandon (26:26.001)\r\nYeah. I mean, no, to first piggyback off what you were saying, I think I heard it recently on a podcast. Maybe it was they were quoting Paul Graham, but he was saying how the market is the most important thing that sort of determines the livelihood of your business. Yeah. Yeah. And yeah, that's very true because we were in a market that was growing really fast.\r\n\r\n\r\nNik (26:27.224)\r\nsome like multi -billion dollar companies.\r\n\r\n\r\nNik (26:47.938)\r\nthe success of your business.\r\n\r\n\r\nBrandon (26:54.937)\r\nNow AI is that market. And funnily enough, in my opinion, AI, the industry they're disrupting the most is my industry. Because what can AI do the best right now? Write words and make images, which is like most of what we do. Right? So we're really working hard on the back end of everything we're doing too.\r\n\r\n\r\nNik (27:18.123)\r\nYeah\r\n\r\n\r\nBrandon (27:24.067)\r\neither implement AI to supercharge what we do in the quantity of production or just make things way cheaper and therefore pass those savings along to our clients and try to be a leader that way. anyway, that was a little bit of a tangent to your question, which was, what was your question again?\r\n\r\n\r\nNik (27:45.442)\r\nYeah, like just you were riding this massive wave and what I've noticed is that when riding those you get put in situations where you're like, I have no business being here. How am I having a conversation with the CEO or how am I running this ad campaign for this company? I was just wondering if you had any of those moments.\r\n\r\n\r\nBrandon (27:48.215)\r\nyes yes.\r\n\r\n\r\nBrandon (27:57.68)\r\nYeah.\r\n\r\n\r\nBrandon (28:01.489)\r\nyeah, I would say I've had many, but on like both sides. like we've done awesome campaigns for, so like the NBA and Gatorade partnered to launch the G league and we ran their launch campaign for them. like being on calls with that was amazing. Right. I'm a huge sports fan, huge NBA fan. So that was awesome. But then also sort of like on the other side, like this is more earlier on, but you know, being on a call.\r\n\r\n\r\nNik (28:18.498)\r\nYeah, awesome.\r\n\r\n\r\nBrandon (28:29.477)\r\nwith a random dentist from a no -name town in New Mexico that was like mad at me that maybe I didn't write a good enough blog post about their whatever, smile, reconstructive surgery called service. That's like, well, why am I doing it? Like why me here? So it's kind of like both ends of the spectrum, but the good outweighs the bad, that's for sure.\r\n\r\n\r\nNik (28:51.416)\r\nTotally.\r\n\r\n\r\nNik (28:55.534)\r\nso your company's now sounds like you've got some operators in place. You and your business partner are serving more as board members and advisors than CEO COO. Is that fair?\r\n\r\n\r\nBrandon (29:07.582)\r\nYeah, yeah, I mean our official I guess we don't have any official titles other than founder So yeah, I mean we Go ahead\r\n\r\n\r\nNik (29:14.19)\r\nHow long have you been hands off like this?\r\n\r\n\r\nBrandon (29:18.651)\r\nSo I knew almost a year ago that now pretty shortly I am going to go to Europe with my wife and kids for six months. And so me and my co -founder have been sort of just strategizing behind the scenes like, how's it gonna go when I'm in Europe for six months?\r\n\r\n\r\nWe need to get the agencies ready before I go. So it's not like too much of ripping off of a band -aid when I do go. So anyway, I told them in the fall, yeah, late fall, but that was going to for sure happen. And we need to start preparing accordingly. And I think that the, you know, a lot of the things are easier. Like if I, if I do finances, which I did like getting somebody else to do that, that's not that hard, but\r\n\r\n\r\nYou know, partially I'm the face of the agencies like on Twitter or LinkedIn and, I do a lot of marketing for them or I help a lot with more of the higher end sales. like figuring out how to get out of that and get the necessary people trained to try to, you know, be at my level.\r\n\r\n\r\nNik (30:31.744)\r\nInteresting. it wasn't necessarily operations and fulfillment that you've been doing a lot of. It's been marketing awareness, brand.\r\n\r\n\r\nBrandon (30:39.813)\r\nYeah, it's more marketing and sales. Yeah, yeah. Yeah, the ops and the fulfillment I've been out of for a long time. Yeah, like six years.\r\n\r\n\r\nNik (30:48.942)\r\nHow do you, cause how do you have that? I I think about that a lot. Every, almost every entrepreneur I talk to, I want to say every, but I there's always like an exception to the rule. So I'll say almost, but it's like the goal is that's the game is like, I just want to get to a place where I can be hands off or, know, where somebody else is running the business or these guys who are in the ETA space. And they're like, I'm going to buy a business and hire an operator, which is always my favorite comment. It's just like, dude, you know how hard that is. But it sounds like, like you've,\r\n\r\n\r\nBrandon (31:04.337)\r\nMm\r\n\r\n\r\nBrandon (31:11.033)\r\nYeah, yeah, yeah. Yeah.\r\n\r\n\r\nNik (31:18.09)\r\nYou've kind of gotten there. And for most entrepreneurs, you probably followed a similar track where you start handing off the things that aren't your core competency, right? Like maybe operations weren't your core competency, but you sort of hold on to the stuff that's the highest and best use of your time, which it sounds like sales, marketing, branding. How how have you thought about handing those things off? Like what did you do? How did you how did you start the process of training somebody else up to essentially replace those things?\r\n\r\n\r\nBrandon (31:26.779)\r\nMm\r\n\r\n\r\nBrandon (31:45.689)\r\nYeah, I that was the hardest part and I was always the kid in school that like group projects like I would just do it all because I want to make sure we get an A. So that's how I am in business and was I guess. Especially if it's something that if it's like I know that I can affect the top or bottom line the most or the fastest then it's like well I'll just do it. Like I don't need to try to train you or whatever. Yeah. But I got some good advice.\r\n\r\n\r\nNik (32:08.312)\r\nYeah, why would you not?\r\n\r\n\r\nBrandon (32:14.705)\r\nthat was like, well, if you really wanna do it, then you have to be comfortable with 80%. Like if you can get somebody else that can do 80 % of what you were doing on it, you just have to be comfortable with that. And maybe eventually they'll get to 90. You know, the goal is eventually to get to 100 of whatever you were doing, right? But you have to be comfortable with the 80 and that's kind of what I came to terms with.\r\n\r\n\r\nNik (32:36.674)\r\nYou know what? It's interesting. I've referenced him a few times just because I listened to his My First Million episode most recently. But Alex from Ozzy. Is they were they're giving him a hard time for not. He's famous for not marketing his companies that he's invested in. Like school, school .com is the first one that he's ever marketed and he's like wearing the hat and all that stuff and everybody else. He doesn't promote on social media and like people like me. I was always scratching my head. I'm like why is this guy like isn't that the thing he brings to the table? But he said something that.\r\n\r\n\r\nBrandon (32:43.27)\r\nMm\r\n\r\n\r\nBrandon (32:50.129)\r\nMm\r\n\r\n\r\nBrandon (32:54.438)\r\nYeah.\r\n\r\n\r\nBrandon (33:01.861)\r\nYeah. Yeah.\r\n\r\n\r\nNik (33:05.922)\r\nthat really resonated with me. And he could just be making this up, but to me, it makes a lot of sense. He was like, the reason I don't do it is because I don't want to have key man risk in my businesses. I don't want to be running these businesses forever. So if I ever want to exit and I've been doing those things, the acquirer is going to either discount it because of the things that I'm doing, or they're going to ask me to stay or like, it just creates key man risk and responsibility for me to stay on. And like that comment just totally changed the way that I thought about.\r\n\r\n\r\nBrandon (33:17.561)\r\nMm -hmm. Yeah.\r\n\r\n\r\nBrandon (33:30.288)\r\nMm\r\n\r\n\r\nNik (33:36.942)\r\ngrowing, scaling, building these businesses because, you're doing, I mean, he's whatever, doing a hundred million, $200 million a year. You're at $10 million a year and you're starting to think about that. That is going to allow you to get to 20, 30, 50, $100 million in revenue a year because most people grow their business and the cap is at like 5 million, 10 million, but it's because they're not willing to give anything up. They're not okay with the 80%. And so they artificially cap their business, but people like you who are like, okay, I can get okay with the 80%.\r\n\r\n\r\nBrandon (33:43.984)\r\nYeah.\r\n\r\n\r\nBrandon (34:00.345)\r\nYeah. Yeah.\r\n\r\n\r\nNik (34:07.434)\r\nyou will grow because it's not going to be dependent on you. It's going to be dependent on the team. And so that's my soapbox is for me. It changed recently. I don't know. Has your thought process changed on that?\r\n\r\n\r\nBrandon (34:12.572)\r\nYeah. I mean, yeah, with the 80 % thing and then the whole key man thing, I mean, that was the reason why we wanted to also step away is because agencies are always like a hot thing to acquire. And so we get hit up all the time with either bigger agencies or\r\n\r\n\r\nyou know, PE firms that want to acquire us and every now and then, well, I take the first call all the time because I just want to kind of build a Rolodex for when it is time that we want to sell. But every now and then we will go down the road a little more, even though I tell them we're not ready just to learn, you know, more about the process. And as I've done that, they've always dove deep when I say, well, I don't need to like when we get acquired like me and my co -founder, we're out.\r\n\r\n\r\nNik (34:40.834)\r\nYeah, for sure.\r\n\r\n\r\nBrandon (35:02.819)\r\nAnd they always dive deep to see like, out are you of it currently? Cause we don't, we don't want to, we don't want to acquire something and then have it go down. So that's when we really were like, okay, let's fully figure out how to step away, especially pre me going to Europe. What do we have to do to get it? You know, a hundred percent everything figured out.\r\n\r\n\r\nNik (35:23.096)\r\nDid you ever deal, this is something I struggle with. Did you ever feel like sheepish about it? I had operators in place and they'd be running a business and then, you know, I'm collecting distributions and I'd always feel like, man, I'm the one getting paid, you know, more than everybody else, but they're the ones who are operating the business. And there was a lot of times where I just, it was hard for me to step away because of that component of it. Was that ever a problem for you?\r\n\r\n\r\nBrandon (35:53.389)\r\nYeah, yeah. And so we, and my co -founder just brought on like an official board member to be over the two CEOs of the two agencies and his, so he's basically now doing what we were doing, which was weekly calls, monthly more official meetings and with an agenda and then a bigger quarterly version.\r\n\r\n\r\nand then helping them. And the guy we brought on is incredible and has tons of experience in &A and consulting and just that whole world. So anyway, when we brought him on, which was only like a month ago, two months ago, because we were paying him a fee and then he basically gets a percentage of the delta of our valuation where it is when he started a couple months ago to whenever we sell.\r\n\r\n\r\nNik (36:51.127)\r\nrad.\r\n\r\n\r\nBrandon (36:52.379)\r\nSo that's how we incentivize him and with a small little monthly thing just for fun. So anyway, when we were talking to him, we were like, yeah, I think we're, cause we were talking about the logistics of paying him that monthly part. And we were like, I think we're just gonna, you know, just pay you from our personal pockets. That's what we were telling him. And then he was like, why? And we were like, well, you know, we don't want like the CEOs to think like we're doing this.\r\n\r\n\r\nHe's like, why? Like you guys, you're the bosses. You own the most. You're the boss. Don't think twice about that. The company should pay me, not you guys. And I was like, that's, he's like, yeah, you shouldn't feel shame. You shouldn't feel bad. Like that's just, it is what it is. And I was like, that's actually, that makes me feel a lot better. And so only like two months ago did that click in my head when he told me that. Yeah.\r\n\r\n\r\nNik (37:43.138)\r\nYeah.\r\n\r\n\r\nNik (37:48.75)\r\nAll right, I'm gonna ask you some quick questions on the business and then I have some rapid fire questions for you. First question is you're doing, let's just say eight or $9 million in top line revenue. What does an agency like this typically net? What kind of profit margins do they have?\r\n\r\n\r\nBrandon (38:04.209)\r\nYeah, 20 % is more like the typical norm. With AI though, it's getting closer to 30 now. So, yeah.\r\n\r\n\r\nNik (38:13.868)\r\nOkay. And then how are valuations set? they a multiple EBITDA or a revenue?\r\n\r\n\r\nBrandon (38:19.043)\r\nIt's a, yeah, it's a multipole of EBITDA. Yeah, so, you know, where we are, it's more like seven to eight -ish, six to eight -ish X EBITDA.\r\n\r\n\r\nNik (38:30.414)\r\nAre you trying to get to that like 2 .5 million number where you're going to get into that 10x range?\r\n\r\n\r\nBrandon (38:38.033)\r\nYeah, want to get to 10 to 12. And ideally, if we can, with AI, be sort of ahead of the game and have some internal stuff built, then we can be on the higher end of that range and then, yeah, get out of it. Yeah.\r\n\r\n\r\nNik (38:53.998)\r\nThat's right. All right. What do you love about this business?\r\n\r\n\r\nBrandon (38:59.973)\r\nI love how fast it moves and how it's always changing. Like we have a lot of clients, clients are always, we're always getting new clients. So it's always fun to work on new stuff, whether it's a new apparel brand or a brand new product that didn't exist before or whatever. So that's fun. But then the services change so fast. Like Meta ads now is so different than it was even let's say three years, two years ago, way different now than two years ago. And SEO now is changing super fast because of AI.\r\n\r\n\r\nAnd social media, the algorithms always change. if you're running, you know, a TikTok page, that's way different than it was a couple of years ago. And then, you know, now like Reddit and Facebook groups are sort of like back and working really well. So it's just, it's always something new and it literally never gets old. So I love that. The same thing that I just said. This is a lot of stuff. Like we have to keep up with that time. Yeah. Yeah.\r\n\r\n\r\nNik (39:44.77)\r\nWhat do you hate about it?\r\n\r\n\r\nSo true.\r\n\r\n\r\nIf you have two hours in your day and you don't have to have any family stuff, you don't have any work stuff, what are you obsessed with right now? What are you spending your time on?\r\n\r\n\r\nBrandon (40:06.225)\r\nI love trying to figure out new ideas that would work in this space, which kind leads me down other roads. But just with how fast AI is moving, I think that there's so much potential. So I love diving deep on that.\r\n\r\n\r\nNik (40:25.902)\r\nWhat advice would you give yourself? Not 10 years ago. What advice would you give your pre -entrepreneurial self?\r\n\r\n\r\nBrandon (40:34.449)\r\npre -entrepreneurial. I would probably just say like don't for the entrepreneur version but pre -entrepreneurial I'd say don't lose focus. Don't get distracted. We would be at way more revenue if I didn't get distracted with all these other agencies or if I didn't launch multiple Ecom things myself but sort of half attempt, know, didn't give them the focus so those failed or even a few years ago we bought a metal recycling company.\r\n\r\n\r\nand just didn't give that focus. like, there's just always random things that got me distracted. And yeah, if I would have stayed focused, it would be way bigger now, I think. I wouldn't trade it though, because I learned a lot, but I would still tell myself that.\r\n\r\n\r\nNik (41:12.376)\r\ndo this.\r\n\r\n\r\nNik (41:17.484)\r\nI always have this conversation with people because it usually the advice that they give themselves is count. I think counterintuitive or counterproductive to where they are today. Where it's like, OK, had I not done the one I get a lot is like, don't be so hard on yourself. And I'm like, but that kind of was what you needed in order to get through stuff. So I have this like love hate relationship with it, but I'm with you like experience is paramount. I wouldn't trade it, but.\r\n\r\n\r\nBrandon (41:38.448)\r\nYeah.\r\n\r\n\r\nNik (41:45.74)\r\nyou know, here's here's kind some of the advice I would give. I love I've loved this conversation has been awesome. I'm gonna have Chris watch this before it even comes out because I'm like, there's like so many good nuggets of of information in here. Where's the best place for people to come find you\r\n\r\n\r\nBrandon (41:56.027)\r\nThank you.\r\n\r\n\r\nJust Twitter. My username is Brandon Doyle with underscore before and after but yeah pretty active on Twitter and Love to chat. So hit me up\r\n\r\n\r\nNik (42:09.356)\r\nAwesome, man. Well, have a good one and we'll talk in six months when you're back and we can hear how your experiment went. Good luck. See you.\r\n\r\n\r\nBrandon (42:14.639)\r\nleast it works. Yeah, OK. Sounds good. Thank you.",
  "metadata": {
    "duration": "",
    "date": "2024-11-20",
    "platform_source": "Google Drive"
  }
}