{
  "episode_number": "199",
  "episode_title": "How to Capture After-Hours Leads with AI Call Agents with Austin Gray",
  "guest_name": "Austin Gray",
  "business_name": "",
  "transcript": "﻿Yeah. New background, \r\n\r\n\r\nNew background, new recording studio.\r\n\r\n\r\nnew house, new background, new recording studio, \r\n\r\n\r\nYeah, that backyard looks sweet.\r\n\r\n\r\nOh dude, it's so freaking awesome. It's massive, but it's freaking awesome. So \r\n\r\n\r\nSo you're a full-time landscaper now.\r\n\r\n\r\ndude, this, okay, this is what's crazy about about it. Um, we spend 250 bucks a week for landscaping. All right. I would think with that amount that my house would like, the yard would just be manicured all the time. It is not there, there are still weeds everywhere. Like it is just, a lot of work. I'm not, look, I'm gonna complain 'cause they're, they're first world problems.\r\n\r\n\r\nBut I, I do know on the, on the spectrum of problems, these are very, very low. But yeah man, there's just like a lot of maintenance that you just don't think of. \r\n\r\n\r\nOh yeah. Yeah. No doubt about it. And what'd you say? It was like a, going from a quarter acre to couple acres.\r\n\r\n\r\na third of an acre to three acres. \r\n\r\n\r\nThat's a big jump.\r\n\r\n\r\nIt's a big jump. It's a big jump.\r\n\r\n\r\nand you want it to look nice and you want it, like, you wanna make sure when people come over that they're having a good experience and, and then you're just like always worried about your lawn. Like, oh, how does the lawn look? Is it good? Is it dying? Does it have enough water?\r\n\r\n\r\nIs it, is it healthy enough? Yeah. Just got like cold complex about it. \r\n\r\n\r\nSo I had to like, I have to have no windows in my office. If my wife's like, why don't you like go upstairs? We have like all these, all these windows and everything that like overlooked the lawn. I'm like, 'cause, because if I look outside, all I will think about is like everything that needs to be done out there.\r\n\r\n\r\nIt's true.\r\n\r\n\r\nIt's so true.\r\n\r\n\r\nIt's true.\r\n\r\n\r\nIt is ni It is nice though. I will say it is nice because when I have calls now, conference calls, I just like go walk the yard. It's freaking sweet. Go walk the yard, do some projects. That's the best. \r\n\r\n\r\nYou like landscaping work, outdoor work, or do you just hire it all out?\r\n\r\n\r\nI do, I like it. I mean, we have some hired out just like the general mow and blow edging stuff, uh, I actually enjoy it 'cause it's mindless. I don't have to be thinking or making critical decisions. There's just, oh, there's a weed pull, pull, pull. Oh, \r\n\r\n\r\nYep.\r\n\r\n\r\nLet's blow 'em out. Like, and then you feel good at the end of it, you're like, oh, cool.\r\n\r\n\r\nI accomplished something. You can look at it and just easily say, I accomplished something. So \r\n\r\n\r\nYeah.\r\n\r\n\r\nthe same reason why I like washing dishes. It's just, \r\n\r\n\r\nOh,\r\n\r\n\r\nit's a mindless task. You don't like washing dishes? \r\n\r\n\r\nI don't like washing dishes. I get in trouble for it all the time at my house.\r\n\r\n\r\nDude, I, I enjoy, well, I'm not gonna say that I do it all the time, but when I do, do it, \r\n\r\n\r\nOkay. Okay.\r\n\r\n\r\nyou know, throw some pods in, get a, get a little podcast going. Just, it's just mindless. And you get to the end of it, you're like, all right, cool. I accomplished something. \r\n\r\n\r\nYeah. \r\n\r\n\r\nI don't know, it just Feels good.\r\n\r\n\r\nFeels real good.\r\n\r\n\r\nFeels real good, man. so our dude, our episode got, forgot your record. Everything. Our episode got Jacked up on your end. \r\n\r\n\r\nYeah, it was weird. I made a transition with backend team, so I built a whole new team in the Philippines. Um, something weird happened just in the transition from the last person who was handling it. This is the one episode, and, and I, if I remember correctly, we were having issues with squad guests recording on your end.\r\n\r\n\r\nSo we switched over to your, we switched over to Riverside. You sent me your link. We recorded in, in yours. Then you sent me the, the rendering somewhere. It got messed up. I don't know what it was.\r\n\r\n\r\nShould I resend you the file? \r\n\r\n\r\nYeah, let's try to do that. But shoot, we're gonna, I'm excited to re to record something new here. \r\n\r\n\r\nOkay. \r\n\r\n\r\nSo that last episode, well the last one we, we dove down the podcasting setup. Are you still doing? Uh, are you, you still have your teleprompter\r\n\r\n\r\nI do. Yeah, it's up here. \r\n\r\n\r\nand you don't use a screen, like you don't have a computer setup or anything?\r\n\r\n\r\nI mean, I do, I have a, my computer's right down here with me. \r\n\r\n\r\nOkay,\r\n\r\n\r\nUh, that's why I'm, I'm texting Kelly right now to send you the last podcast. \r\n\r\n\r\ncool.\r\n\r\n\r\nuh, yeah, I got my, my whole, I got my whole setup here again. It's pretty legit. \r\n\r\n\r\nThat's great. I was gonna talk to you about that on this episode because, well, for one, you, you, you encouraged me on the lighting. How does, how does my lighting look on this recording?\r\n\r\n\r\nMuch better. Much better. The only thing I would say is you need a backlight \r\n\r\n\r\nSo I ordered some of those. Go ahead. \r\n\r\n\r\nBecause right, right now you see your guitar, there's a shadow on the wall, or like if you raise your hands up, you'll see a shadow on the wall. So if you just get like a nice little, I. Nice little backlight. be freaking set, dude. \r\n\r\n\r\nJust put something on the ground and have it shine up. \r\n\r\n\r\nThat's what I do. \r\n\r\n\r\nOkay?\r\n\r\n\r\nI, it's not charged right now, but I got one of these little bad boys and when it's, show it to you. When it's charged, this little blue light, \r\n\r\n\r\nOkay.\r\n\r\n\r\nbut this, but my, this new office is so bright. There's so many windows in it that. I don't need that. Like, I don't need that massive accent light anymore, so I don't use it. But you have no windows. \r\n\r\n\r\nYeah. No windows. No windows at all.\r\n\r\n\r\nUh, okay. So what do you, what? What are we jamming on today? You tell me. \r\n\r\n\r\nDude. \r\n\r\n\r\ntalk about? \r\n\r\n\r\nOne second. I'm sorry. \r\n\r\n\r\nYou're fine. \r\n\r\n\r\nI'm start once.\r\n\r\n\r\nYou there, \r\n\r\n\r\nI am here. \r\n\r\n\r\nyou take supplements.\r\n\r\n\r\nUm, magnesium I think is the only one I take. \r\n\r\n\r\nYeah, \r\n\r\n\r\nYeah. Why? \r\n\r\n\r\ndude, maybe, maybe, you know, Chris Berg,\r\n\r\n\r\nNo, I may. I may. Yeah. Yeah. Yes, yes, yes. \r\n\r\n\r\nmaybe he could shed some light on this. But I literally, so I, I take a good amount of supplements, like \r\n\r\n\r\nMm-hmm. \r\n\r\n\r\nelectrolytes. Um, I'll try to take like lion's mane, you know, stuff like that. I mostly got a bad batch of something.\r\n\r\n\r\nBrilliant. Could you feel sick right now or what? \r\n\r\n\r\nYeah. \r\n\r\n\r\nJ \r\n\r\n\r\nIt, it happened. No, it, it's happened like the last three times I've taken these electrolytes. I don't know if it's, I'm gonna have to throw 'em out. I literally had to go out. \r\n\r\n\r\nup. \r\n\r\n\r\nI, I just did.\r\n\r\n\r\nWhat you want? Like we can do this again, man. \r\n\r\n\r\nNo, all good. I'm good. That's, it's weird though. Anyways. All right. Let's talk ai.\r\n\r\n\r\nSheesh. Okay. \r\n\r\n\r\nJeez.\r\n\r\n\r\nhopping right back in. Uh, again, just so you know, my, my camera's up here, my computer's down here. So if you see me down here like this, I'm not tweeting. I'm looking at my notes on different \r\n\r\n\r\nOkay.\r\n\r\n\r\nso you wanna talk ai. \r\n\r\n\r\nWell, you've been doing a, uh, you've been doing the series, right? \r\n\r\n\r\nI just finished. \r\n\r\n\r\nI wanna know what you learned.\r\n\r\n\r\nOh my gosh. Come on man. I haven't had time to freaking digest all that. \r\n\r\n\r\nWhat are some of the co \r\n\r\n\r\npeople. \r\n\r\n\r\nwhat are some of the coolest things you've learned? Surely there's like, like three things that you're implementing.\r\n\r\n\r\num, I think there's like the sexy things and then there's the unsexy things. The. What's your level of familiarity with AI right now? \r\n\r\n\r\nI mean, that's what I watch, that's what I watch on YouTube at night.\r\n\r\n\r\nLike what? Like what are you watching? \r\n\r\n\r\nUh, I watch that Greg Eisen, you know that Greg Eisenberg guy?\r\n\r\n\r\nYep. I watch Greg \r\n\r\n\r\nI feel like he brings on some people who are, who are moving pretty fast in the space right now.\r\n\r\n\r\nOkay, so you just like the ideas that Greg Eisenberg has. \r\n\r\n\r\nI mean, I've always been, I, I came from software sales, so you know, I'm, I'm always, I'm always like, how do we implement software faster inside service business? Um, that was sort of my whole mindset coming into starting a local service business. So I was like, I know that we can, we can implement some software in these things.\r\n\r\n\r\nAnd then now with where we are with ai, I am very interested in this.\r\n\r\n\r\nSo, I mean, there's, there's a ton. It's, it's moving really quickly. are you good, man? I feel like you're like, do you need to take,\r\n\r\n\r\nI am a hundred percent good. \r\n\r\n\r\nyou're a hundred percent \r\n\r\n\r\nI'm a thousand percent now. That was just the, I'm telling you, it's the weirdest thing.\r\n\r\n\r\nso that is, so if I throw up, I'm just like, done for hours. So, um, yeah, I, I would say. Poof. If I could distill a couple ways, I think the first thing.\r\n\r\n\r\nI'd say is we are early. I know that's, that's like a, a cliche thing to say, but uh, when you're in a Twitter bubble and everybody's talking about ai, it may feel like, oh dude, everybody's using ai. But it is so early people, people still just have no idea to use it and if they are using it. using it to 10% of its capacity or 5% of its capacity, they're not even using it for every use case that they could be using it for. Um, I'll give you an example. I'm not even gonna talk about agents like or any of that stuff.\r\n\r\n\r\nI talked to this woman, her name was Abby. She's a writer and she just showed me in Claude how to organize her. Claude. So, um, what's your LLM of choice? \r\n\r\n\r\nWho's GPT? Right now? I have a subscription to Claude, but yeah.\r\n\r\n\r\nChatt, BT has projects, Claude has projects as well. Do you use the projects at all? \r\n\r\n\r\nSo in our last episode, you went through, you went through that? Yeah.\r\n\r\n\r\nThat's right. We talked about, sorry, I'm talking to too many people. So that, that was one thing where it was just mind blowing. She didn't show me anything crazy. It wasn't like she's like, oh, this is the software that I built from scratch. It was literally just how do you think about architecting a system that allows you to leverage ai? More than you've ever leveraged it in the past. And so the way that she was thinking about it by creating reference documents, uh, by having different projects for different aspects of her life, like even her personal life to me, was fascinating. So that's one thing I've totally implemented and stolen is I've projects for everything now, whether it's work, whether it's personal, whether it's, you know, something that I'm on with my kids. Uh, because each one of those projects keeps context and I think the context I. So to me that's, that's the first thing is like we're early, we're barely using it. And even the things that we're trying to use it for, we haven't even, we haven't even scratched the surface on the easy stuff. \r\n\r\n\r\nDid you? Record an episode with her. \r\n\r\n\r\nUhhuh. \r\n\r\n\r\nYou did? Did y'all do screen share? \r\n\r\n\r\nwe did. Yeah. \r\n\r\n\r\nOkay.\r\n\r\n\r\nit was great. Yeah. If you wanna check what, I don't even remember what episode that was. Uh, I could send you a link. \r\n\r\n\r\nYeah, let's put that in the show notes because. Last time what we did is we went down a deep dive rabbit hole, but if you've already recorded that content, if already lives on the internet, \r\n\r\n\r\nYeah. \r\n\r\n\r\nI'm gonna go watch that and then I'm gonna recommend that our listeners go watch that. So this is actually something that, um, listeners, like, if, if y'all have been listening to any of my AI stuff recently, then like you probably know that I just, I move really fast.\r\n\r\n\r\nOrganization is not my strong suit, but I'm kind of to the point right now where I'm in GPT and I've got like a thousand different thing that I've prompted it on and I just need to organize it. Um, and so this is gonna be really interesting to go and look at it. Um, and if you'll share that link. Uh, what was her name?\r\n\r\n\r\nAbby. \r\n\r\n\r\nAbby. Yeah, \r\n\r\n\r\nOkay.\r\n\r\n\r\nPertz. I just texted you her episode. I. in fact, I'll, I'll find the YouTube episode as well and send that to you just so you have it, \r\n\r\n\r\nYeah, let's,\r\n\r\n\r\nI'm gonna go watch that\r\n\r\n\r\ngonna forget if I don't do this right now. That's just how I, that's just how it's gonna go. I'm gonna forget \r\n\r\n\r\nshe automated 60 minute task down to zero minutes. Is that her,\r\n\r\n\r\nthat that was, uh, Olivia. \r\n\r\n\r\nOlivia?\r\n\r\n\r\nYeah. Here, I'll send you her. \r\n\r\n\r\nOkay.\r\n\r\n\r\na million dollar community. She had a million dollar business. She shut that down and kind of built out her, her new business that she's running, just framed around ai, which was, which was fascinating. Um, \r\n\r\n\r\nshe hit 60 KMRR in four weeks using ai. Who is that?\r\n\r\n\r\noh, that is, uh, Amanda, what is her name? Amanda. Hug and Kiss. No, Amanda. Where is she? I'll just say Amanda for now. \r\n\r\n\r\nOkay.\r\n\r\n\r\nShe, Amanda Orson. There we go. Um, so she has a software that is, is effectively trying to eliminate realtors the buy side and the sell side, uh, of real estate transactions. And so it's a marketplace where you can go and you can list and people can buy and it cuts out the middleman.\r\n\r\n\r\nAnd she gives you a bunch of resources and templates that, that, uh. Make it easier for you to not have to use an agent. 'cause most people are using an agent for the contract or for the title company for recommendations on who's gonna do the inspection. Like all the stuff that you just wouldn't normally do.\r\n\r\n\r\nAnd, they make, they make it easy for you to have a private party off market transaction without having to use a real estate agent. Um, but she was able to build that using AI within her team and. I mean, at the time, this was two months ago, she's at, you know, 60 grand MRR, but it was a very quick sprint and she was able to launch it.\r\n\r\n\r\nAnd it wasn't that AI built it, it was that AI is now giving, it's, it's 10 Xing her team's ability to actually get stuff out quickly. This was something that was interesting actually. Um, I heard Satya Nadella, do you know who he is? \r\n\r\n\r\nI don't. Oh, okay.\r\n\r\n\r\nand Mark Zuckerberg we're having a conversation at one of these conferences Mark asked Satya, he's like, Hey, what percentage of your code is written by ai? And they hemmed and hawed and they're like, well, you know, we can't really totally quantify it, but, but the number that they got to was like 30%, like 30% of code right now within Facebook or Meta. And Microsoft is being written by ai. And it, it's not that it's just on its own writing code. It's doing the first pass or it's doing an audit or it's uh, you know, helping to QA something for one of these engineers, but 30% of code and that's right now, which is just nuts.\r\n\r\n\r\nAnd then you look at their earnings. Yeah, had blowout quarters, Microsoft Meta because they're, they're now leveraging ai. They've grown top line revenue. They've shrunk employee costs because they're, they're using AI to help their engineers 10 x it. It's pretty cool. \r\n\r\n\r\nWhere are the biggest opportunities right now that you've seen from interviewing these people about ai?\r\n\r\n\r\nUm, I think the, alright, well, lemme take a step back. If you're a small business owner, what I would say the biggest. The, the first step that you do, I think we've talked about this, is just, just go pay for a premium plan. I don't care what it is. I don't care if it's perplexity, chatt, pt, Claude, Gemini, whatever it is, go pay for a plan.\r\n\r\n\r\nThe reason you pay for, it's so that you have, uh, more ability to ask it questions. If, if it's free, you kind hit a cap, start playing around with it. Um, and then after that, then you'll start kind of seeing opportunities to implement it within your business. But I would say from what I'm seeing. The number one best use case is sales. Um, and, and here are like a couple examples after our phone calls. People who are calling for your services after hours. Nobody has the, the income to be able to, to have a a 24 hour team that's just answering calls. Right? Um, so many times those people call and they'll leave a message or they'll call and nobody answers 'cause there's no message machine.\r\n\r\n\r\nAnd then they call the next person the competitor, and then the competitor gets that business. So there are a couple things that people are doing right now. There's a company called Think, T-H-Y-N-K, I had him on John Long is his name. and they have. ai?\r\n\r\n\r\ncustomer service representatives who will answer calls.\r\n\r\n\r\nNow, they'll do it during the day and after hours, but I like the after hours component to it. so they're, they're capturing business. They're capturing leads after hours, which I think is, is. Incredible. Um, and beyond that, they're also able to capture those leads and enter them into the CRM. So it's not quite an agent where it's autonomous, but you are telling it, Hey, once you've captured these fields of information, populate it in the CRM and then when you come the next day to work, you've got two or three people who've called in.\r\n\r\n\r\nIt's like, oh, you've got, uh, an evaluation with John Smith and Mary Jones at 11 and 12 o'clock, and you didn't do anything fast. So like capturing, um. Capturing leads essentially after hours, I think is a really cool use case. Have you seen anybody doing that right now?\r\n\r\n\r\nI mean, I'm, I've seen a couple people who are building products on it. We just started using open phone and it looks like their AI assistant or answering assistant works pretty well. I've experimented with that a couple times. I've been hesitant to implement any sort of AI phone answering. But to your, to your point, I'm open to doing the after hours because why not?\r\n\r\n\r\nThey're not getting touched anyway. \r\n\r\n\r\nwould've lost it anyways. \r\n\r\n\r\nAnd the second thing that I want to ask you here. So I'm running a lot of Facebook ads for, uh, several businesses right now, and we're, we're getting a ton of leads, but some of those come the middle of the night early, you know, 3:00 AM in the morning sometimes.\r\n\r\n\r\nSo is there a way that you've seen for an AI call agent to or call assistant to call those leads? \r\n\r\n\r\nYes. \r\n\r\n\r\nYeah.\r\n\r\n\r\nYeah, there is. I mean, so John Long, I can't remember which episode number, but that's his whole company is, is think, think ai. And I actually have a phone conversation with his agent live on that episode. Is is pretty fun. And look, you still know it's an AI agent. is the latency. So. And, and this is, this is the main issue.\r\n\r\n\r\nThey can actually have quicker conversations with you. 'cause, so if you talk to an AI agent right now, it's like, how's it going, Brian? It's good. How are you doing? I'm great, man. You know, they're like, there's like this lag. reason that there's a lag is because AI still hasn't perfected. Listening and understanding when to jump in. And so they, if they just hear a pause or like a longer breath, they think they're supposed to jump in. So these companies will actually say, um, you need to wait, not 0.5 seconds, but 2.5 seconds before you jump in. And so that's why there feels like there's a lag. We have the technology for there to be no lag, technically, but they don't understand like the context of when to jump in and when not to jump in.\r\n\r\n\r\nAnd so it kind of just. them to talk over each other. um, from that episode, honestly, what I found was, I think if you have an AI agent, an AI agent says, I'm an AI agent, how can I help you? Like just let the person know upfront. There's usually not a big problem with that. I'm sure on the tail ends, you'll have people who are just butt heads and they'll hang up. at least then the person that you're talking to is like, oh, okay, I'm in the know. I'm just gonna proceed. With this conversation. So the short answer to your question is yes, you can have them call in the middle of the night. Um, you obviously have to set up automations probably through through Zapier or, or some automation software like that.\r\n\r\n\r\nBut you can have them actually call outbound and have conversations with potential leads. \r\n\r\n\r\nCool. That's great. And yeah, I like your, I like your thought process there on just being straight up with the customer. Hey, this is an AI agent, but I can answer most of your questions just to let you know. Like I'm gonna document these and then somebody from our team is gonna be giving you a call first thing in the morning, or however you wanna frame it, right.\r\n\r\n\r\nYeah. The, the, the other thing on the sales side I would say is like, it's not an AI call agent, but it's an AI chat bot. So anybody who's going onto your website and wants more information, you can pretty easily train up a chat bot. I. To be able to interact with people and it pops up and they start having a conversation, et cetera, and they get to a point and then it takes the lead and shoves it in the CRM. but I, I do think that there is a space to be utilizing ai, either call or chat agents to follow up on leads or take in inbound leads that you otherwise wouldn't have gotten to that, that are time sensitive. \r\n\r\n\r\nThat's awesome. What else are you seeing as opportunities?\r\n\r\n\r\nso the other thing in sales I would say is, um, what's the CRM that you use in your business? \r\n\r\n\r\nGo high level. \r\n\r\n\r\nGo high level. \r\n\r\n\r\nYep.\r\n\r\n\r\nSo go high level would be a perfectly good CRM to use, but um. Basically qualifying, scrubbing lists that you have. Right? So you, you'll have to export it and kind of either put it in a CSV or in a Google sheet and then have Gemini take a look at it. you can actually have it now. Um, and I'm trying to think of the software, but there are softwares. I think Clay. Clay is a CRM, but it will go and look at those prospects and you can tell it to, I want you to pull, its LinkedIn Pro, their LinkedIn profile. I want you to pull their business information. I want you to, um. I'm trying to think, oh, qualify this list of people based on these attributes. So just cleaning the data in order to get it to a place where your sales team can take it and run with it, and just identifying, hey, here are the top potential leads, and the bottom leads think is a really cool, I. Time savings of ai.\r\n\r\n\r\nSo like you've seen deep research on chat GPT, that's effectively what you're doing is like a, a deep research esque function on the leads that you've generated. upstream of that, there's this software called Browse ai. Have you ever messed with browse ai?\r\n\r\n\r\nNo.\r\n\r\n\r\nOkay, so browse ai. Um, back in the day when you wanted to go and scrape data from websites, so let's say I wanted to get the phone number of every pickleball owner in the United States. I would have to essentially write script. To say, to Google Business profile and pull this specific information. And if they weren't on Google Business profile, you're kind of out of luck. Um, that's actually what a system like, not go high level, but um, outs, scrapper does right outs, scrapper just goes and pulls all the Google profile, Google business profile listings and, and that they've got them in a centralized place.\r\n\r\n\r\nBut what, what software like Browse AI does is it allows you to actually go to every individual website and then using context, 'cause it's ai. You tell it, go find the About Me page and find their hours of operation, phone number, address, services they offer. And so then it will go to the website and actually look for all of those things and populate it into a spreadsheet.\r\n\r\n\r\nSo you're No.\r\n\r\n\r\nlonger dependent on whatever brows, ai, or excuse me, whatever outs scrapper has pulled together, uh, from Google Business Profile, you can actually go to the websites of these companies pull that information because you're, you're now using context. You're not hard coding. Where to, you know, and telling the software where to go to actually pull it. So I think that's a really, really cool use case for businesses that are trying to find more and better leads, uh, to call on that is not in the same pond that everybody else is fishing in, which is Google business profile. \r\n\r\n\r\nBrowse ai. Huh?\r\n\r\n\r\nMm-hmm. Yeah. \r\n\r\n\r\nYeah, that's super interesting.\r\n\r\n\r\nThat's a cool one. \r\n\r\n\r\nWhat is the pricing on that? Oh wow. Yeah. And all this stuff is like straightforward and inexpensive in the grand scheme of things for what you're actually getting.\r\n\r\n\r\nNo, it totally is. And if you're willing to spend a little bit of time on it, you'll, can figure it out and build some pretty cool stuff in a short amount of time. \r\n\r\n\r\nWhere are some other opportunities outside of sales?\r\n\r\n\r\nOkay. So outside of sales, This is tangential to sales. However, it overlaps to all operations. Um, and again, I'm like looking at things that don't require agents. I'm sure that, that you listen to Greg Eisenberg and he'd be like, oh, well if you just plug in these three things, you can have an autonomous robot that goes and was those cars, I'm not there yet, but uh. You know, I'm like the caveman who's just trying to figure out how the wheel moves and, and, and he's designing, you know, Ford F1 fifties. Anyways, um, so there is a lot of information that we communicate every single day that's not recorded, but there are ways that you could be recording it. So, for example, I have a limitless pendant that records all my conversations. I'm not wearing it right now because. We're on this and I could get the transcript if I wanted it. So there's no point for me to to record it. Um, and throughout the day you have many calls with your team. Maybe you have a call with the sales team, maybe you have a call with the ops team, maybe you have a call with finance, maybe whoever. Um, so I like to think about what are opportunities for me to capture the information that is on these calls in a non-invasive or at least easy way. And so the first way that I would say is, well, lemme back up. Why, sorry. Why would I wanna capture all this information? because I can then take that information into those transcripts and put it into my LLMs and say, please summarize this conversation.\r\n\r\n\r\nPlease tell me who I need to follow up with, et cetera. and then if you get, want to get really crazy with it, you can just start creating Zaps that you don't have to do anything with the LLMs. You just set up a Zap and it does it on its own, and it sends out meeting minutes after the meeting is completed. So, um, I don't know about your listeners, but I was awesome in meetings. It's fantastic, dude. We solved, we solved all the world's problems in every meeting we had. You know what the problem was? Hey, what did we say we were gonna do? I can't What? Who, no, no, no. That's, that's not what we said, Austin. What we said was that I was gonna go and you were gonna stay.\r\n\r\n\r\nNo, I remember that very clearly. You said that you were gonna go and I, you know what I mean? And said, um. Recording. It just takes away the mental stress of like having to write down every single note, but also the ability to go back to it and double check many different things. So, uh, and I'll give you some examples of it after this, what I would do is take a look at any meetings that you have with multiple people where Zoom is involved. And I would look at getting an AI note taker, either Otter, AI, fathom, uh, fireflies. I'm sure there's one or two that I'm missing. But those are really simple. They integrate with your calendar. And get them on every single one of your meetings and they're gonna record and take meeting notes for you. And then you can go and take the transcripts, which is fantastic. If you then want to take it to the next level, I would get one of those pendants. And it doesn't have to be limitless ai, it can be plot plot's, another pendant that's out there. It's cheaper. but just your conversations, be upfront with people and tell them like, yeah, hey, I'm recording this, but I can't count how many times I've had like one-on-one conversations.\r\n\r\n\r\nAnd I, I. Relying on my recall at this point is just not good 'cause I have so many different conversations. So here's a real world example of that. I have an intern right now, and I'm in the process of launching an accelerator that's focused on healthcare. So we're gonna be leveraging ai, it's gonna be an accelerator, and it's within a healthcare organization that I'm working with.\r\n\r\n\r\nWell, I have an intern who's helping me create that. And our first couple days, all we did was talk about. What does this internship look like? What do I need from him? What are the deliverables? What are we trying to do? do we get there? What are all the things that we test of conversation? Typically, I don't have those recorded. It's not like I have some, some chat bot, but I had my limitless pendant, and from that conversation, those conversations, a 12 week internship program. Deliverables broken down to the day where it's like, all right, today you're doing this. This is who you're talking to.\r\n\r\n\r\nAnd, and it took me a little while after those conversations to iterate that way. But I, he now has a roadmap and it's not like he's calling me every day like, Hey, what should I work on today? It's, no, we talked about it. You know what the end deliverables are. Just go and do. So that has been, that was, that's an example of that.\r\n\r\n\r\nBut think about every time you onboard a new employee. You have a sales meeting, you're talking strategy once a month or once a quarter with your executive team. you don't have a conversation with your bank about financing. You are talking, you're talking to your accountant about taxes. How many times like the next, every year I do taxes.\r\n\r\n\r\nI'm like, what did we decide last year? Why did we decide that? And they feel like reeducate me. But if I have those conversations recorded, I can just go back to the transcripts and like, ask AI those questions instead of spending three $50 an hour for my or my CPA to tell me the answers to those questions. So, that, that's valuable in sales, it's valuable in operations, it's valuable in onboarding and orientation, people, management, the whole gamut. I think figuring out a way efficiently capture your conversations and then be able to extract value out of them is totally underrated.\r\n\r\n\r\nThis is incredible. This, I have so many ideas even. And I know you're, you're sort of looking at it more from, like you said, you're doing a healthcare accelerator, but like my head is going to, man, if I'm an excavation business owner with a crew of three, can, can you think about how many times listeners, right now you've had a conversation with other people and they're still calling you back, asking for questions?\r\n\r\n\r\nI mean, my head is going to like, what if you recorded your morning? Operating meetings and you had some sort of automation set up to where, 'cause I'm sure, I'm sure you're set in with Zaps from, I haven't even looked into Limitless yet, but the way I'm envisioning is you can record a conversation that you have.\r\n\r\n\r\nYou probably have some sort of Zap automation set up to where it sends that recording two chat GBT. \r\n\r\n\r\nIt \r\n\r\n\r\nNo.\r\n\r\n\r\nwill it. I haven't figured it out yet. It, it's like, it's kind of like an extra, it's harder. They don't have a bunch of API integrations. They \r\n\r\n\r\nOh, really? Okay. \r\n\r\n\r\nnow I'm copying and pasting it, \r\n\r\n\r\nOkay,\r\n\r\n\r\nthen from there everything's kind of automated. \r\n\r\n\r\nso let's talk about the future, like once they will, I mean, I'm envisioning this as if, if you eventually you could be like, okay, we are having a morning operational plan meeting right now, and. John, Trey and Adam are present. Right? And then you have some sort of automation set up to where it's recording what you're saying as the foreman of that crew.\r\n\r\n\r\nIt's taking the transcript, plugging that into chat, GPT, with a pre prompted framework to summarize and create checklists and step by step. Um, outlines for people, and then you can voice prompt it to say, please send this to Adam, Trey, and John, and some sort of automation could set up. And, and now we're getting into a, I think this is what you would call an agent.\r\n\r\n\r\nUm, but I'm trying to paint the picture for where the future of this could be and how it can be applicable to really some of these just, \r\n\r\n\r\nCan I do you one better? Are you ready for \r\n\r\n\r\nyeah. Yeah. Yeah.\r\n\r\n\r\nI've been thinking about this as well. Um, I've had several, many conversations about this. Think about you have a sales team, how, you know, maybe you have 2, 3, 4, 5 sales reps out there. I. How do you know whether or not they're doing a good job?\r\n\r\n\r\nAt the end of the day, there's one of two ways. Either you just look at their sales numbers or you go on a ride along. \r\n\r\n\r\nYep.\r\n\r\n\r\nNeither one of those tell you the whole story, on a ride along. You're just kind of getting the best version of them at that moment. What if they had this on every day? And you could go and have AI analyze the transcripts and like, Hey, tell me how they're doing.\r\n\r\n\r\nHow are they doing about closing? Are they following up with the people that they're supposed to follow up with? When they have conversations, are they speaking more or less than the person? Are they asking calibrated questions, just, you know, a whole host of things. And then you don't have to go and spend five hours right along with every single one of them to identify the pain points.\r\n\r\n\r\nLike you've, you've already gotten like 80% of the way there from those transcripts in and of themselves. it allows you to manage those salespeople. Way better maybe you otherwise would have in the past, or like you said, guys are out in the field. It could be, it could even be a liability thing where anytime they go to a client's house, they've got it on and it's recording the conversation.\r\n\r\n\r\nNow you have to be careful about two party consent states. If you live in one of those states. I don't, I live in a one party consent state. um, if it's capturing those conversations. then it's like there's a dispute, like, oh, well let's just go back to the, to the transcript. And even if they're like, well, I never said that.\r\n\r\n\r\nIt actually records the audio as well, so you can listen to the conversation. Um, it, it all of a sudden kind of eliminates the need to rely on memory. And you could just kind of, let's, let's just look at the tape. Let's like refer back to what we actually talked about. Uh, but yeah, morning meetings, sales I think is a, is a really, really big one. yeah. \r\n\r\n\r\nI'm with you on the sales 'cause like right now in one of my businesses, we are, we're getting the leads, we're trying to dissect at which point of the sales process is broken. And the only way that w that me is a remote GM right now of this business, I'm relying on the in-person sales person to tell me what the customer is telling them in their on in-person site visits or calls with the customer.\r\n\r\n\r\nYep. \r\n\r\n\r\nSo to your point, this could be a great way to break down where the process is breaking.\r\n\r\n\r\nThe, the other cool things that have been is like I, I've gone to several conferences now with it, and at the end of the day, or even in the middle of the day, I'm like, who did I meet this morning? Oh, here are the 10 people you spoke to. Here's what their businesses were. Here's what you guys talked about. Did I say, did I say I needed to follow up with anybody? Oh, yeah. Here are the follow up items you said you were going to do. I guess it's. It's pretty power powerful from that perspective because otherwise when you're going to these, uh, conferences or you're going to places where many people are congregating, you wanna remember the connections that you're making. How else do you do that? It's like, it's kind of, unless you're just taking notes the whole time, there's no way to really maximize those efforts. But with these now recording the conversations, you can go back, refer to it go to follow up, when you're like, oh yeah, Austin said that. about excavating. What did he say? I I think I might have something for him. And they go read the transcript, or you listen to it and you're like, oh, easy. That's what he said. Um, here's his pain point. I can send him a follow up message. That's very personalized.\r\n\r\n\r\nI mean, just the amount of, especially you as a creative entrepreneur, the amount of ideas you have at on any given day. \r\n\r\n\r\nYeah. \r\n\r\n\r\nI mean, this, this, this is going to unlock so many ways to document those. What did we talk about? Scenarios and I mean, this is, this is going to open up. The world into having a personal assistant.\r\n\r\n\r\nEventually, once this thing has an open API.\r\n\r\n\r\nand it, it might have an open a PII just have, it's, it's more complicated than the typical software that's been out there for a long time. I. So I haven't quite figured it. It might not have a zap, right? So it's like, I think it has API capability, but it doesn't have a zap. And so you gotta whatever, do a workaround. Um, but yeah, I've started, when I'm just walking around or you know, doing yard work, how many times do you have an idea that comes to your head and you're like, oh, I gotta document this. And you pull out your phone and maybe you text, just start talking now, like, Hey, so I think I know how to document this.\r\n\r\n\r\nSOP on procurement. Um, wanna focus specific. You just start talking, right? And it's recording it, and then you can go back to it and it's the SO p's just there the follow up items I need today, or the things I need to get done this weekend, or, or whatever it is. Like you said, opening it up for, uh, a personal assistant, but it, it's, it's, pretty game changing once you start messing around with it and just realizing there's a lot of potential applications for recording the communications that you've had throughout the day. \r\n\r\n\r\nYeah, this is gonna open up a lot of opportunities. Let's see, how much is it? Order pen and \r\n\r\n\r\nAI pendant is like $500, I think. \r\n\r\n\r\n99 per year. Wow.\r\n\r\n\r\ncheap. It's not cheap. \r\n\r\n\r\n$399 per year though to have it do what it's doing, like I'm thinking that's a great deal if, if it's going to take everything that I have bouncing around in my head and help me standardize some of it and create some checklists and actually get it over the people who, \r\n\r\n\r\nit for sure. If you can \r\n\r\n\r\nyeah. \r\n\r\n\r\nit. \r\n\r\n\r\nYeah. That's cool. Yeah, thanks for sharing that.\r\n\r\n\r\nThere's so many opportunities and ideas that I have right now for how this could help, but I mean, this is, this is essentially just like it's making it an actual thing right now and bridging the gap between like, we're literally gonna have an AI assistant shortly. \r\n\r\n\r\nshortly.\r\n\r\n\r\neven if you didn't want to go and wait for an AI assistant, you could have all this stuff and then have a VA do the majority of the things that are manual tasks at this point. \r\n\r\n\r\nSo right now it, it records transcribes and then keeps that in in a bank. And then basically you just have to go copy that transcript and then if you wanna summarize it, you're plugging it into G PT or CLO or whatever, and saying, please summarize this. Create a step-by-step checklist.\r\n\r\n\r\nYeah. I mean, I can query it and I can have it tell me like, Hey, summarize this conversation. It'll spit stuff out. But I like to have it in my chat, TBT 'cause I feel like that's just adding even more context to me and my conversations. So, um, but yeah, it's. But it's easy. It's not super complicated or difficult, it's just, it is a copy and paste formatting thing, and if you don't wanna do that, you could have a, you could pay a VA to do it. \r\n\r\n\r\nSo this kind of goes into. A concept I've been thinking about quite a bit, especially with the podcast, 'cause I'm interested to, to hear your thoughts on this. The way I've been thinking about this podcast is I get to go interview smart people like yourself and then we're recording this and if you set it up properly, everything that you're sharing right now.\r\n\r\n\r\nIt can be recorded and queried in a knowledge base. So right now I'm creating the owner ops podcast specifically for local service based business owners. What I have envisioned in, in my mind is to create this knowledge base that can eventually be searchable. Like if somebody were to come to owner ops.com, I wanna be able to have a, a bank where it's like you can just go in search with ai.\r\n\r\n\r\nHey, what do some of the owner ops podcast guests recommend about? Building a sales team or about Facebook ads, and then if we get all of this into a knowledge base, we can query it. And then ideally the AI can give really, really, um, great answers to people as long as we continue to bring on great guests \r\n\r\n\r\nMm-hmm. \r\n\r\n\r\nwhat you're saying is essentially you're creating your own personal knowledge base.\r\n\r\n\r\nIf you can get your thoughts. Out of your mouth and into the recorded ai, like where do you see opportunities in the future for, for that?\r\n\r\n\r\nthere's, there's two parts to it. There's you, the person who's creating the content, whether you're a content creator or whether you're just somebody who's like. Trying to create their own internal knowledge base. It's content, right? That, that it's drawing on or context we could say. So there's you, there's the ability to create it, and then there's the ability of these LMS to process it. That is a bottleneck right now. So I don't know how many episodes you've done of the owner op ops podcast, um, is, is trying its best to balance two things, speed and accuracy. Nobody wants to be sitting for 30 minutes for it to find the perfect answer. Um, but also nobody wants. be a split second and hallucinate and be totally wrong when it's trying to find those things. Uh, and so there are limits to how much context it can hold think of a, in its head at any given moment. So, uh, Google can hold a million tokens of context a time. AI chat, tts kind of at 120,000 tokens, give or take, 120,000 tokens is like 300 pages worth. Of documents. So that kind of gives you the, the, the scope, um, of what this context is. But if you're able to take those episodes And like, I want you to get rid of all the ums, the ahs, the hums and filler words, all of a sudden that's a lot more, a lot less information that you're uploading context. Beyond that, though, you do need to format scrub and put the data somewhere so that it's easily queryable. It's not just searching everything that you've ever done. So for some of those episodes, for example, you're gonna have to go through, and you can use AI to do this, but you're gonna have to go through and assign tags to it. You're gonna have to go through and assign industry profiles, business sizes, et cetera, so that it can tag. That episode and then once it's found the tag, it can then go ask that question essentially that you're the specific question that you're looking to have answered. Um, but that is one of the problems with Cool, we're creating way more data, which is awesome. It should just be able to, you know, process it and spit something out. But it's actually. Limited in, in its ability of how much it's able to process. So thinking through how to architect it in a way that allows it to still access that data totally taking up the context window is it's complicated.\r\n\r\n\r\nAnd do you think that that will be solved regardless within a reasonable timeframe? Call it one to three years.\r\n\r\n\r\nUm, I think it, yeah, I think, I think the ability of these LLMs to process more information is going to be solved. Um. But I still think it's going to require you or I have a good system for it. I don't think it's just going to be able to take everything that we've ever had and decide what's important and what's not important.\r\n\r\n\r\nIt's like training an employee, right? Like yes, we have conversations, but we also have SOPs, and we also have emails that are very clear on what we expect. Sometimes there is conflicting data, and so how does it prioritize? Is the SOP, correct. Is the most recent email correct? Is what you just said to me yesterday?\r\n\r\n\r\nCorrect. 'cause you could have made a mistake yesterday. like those problems are not necessarily going to go away by ai. AI's gonna make inferences, it's still going to be an issue. So thinking about how you store this data, thinking about how you clean it, thinking about how you extract information from it is still an important component of being able to extract as much information as possible. \r\n\r\n\r\nDo you think that AI system architects are going to be the new software engineer of the next decade? \r\n\r\n\r\nOh, for sure. \r\n\r\n\r\nYeah.\r\n\r\n\r\ndon't know about for sure. But yes, it's gonna be a thing. I mean, we already have prompt engineers. \r\n\r\n\r\nHmm.\r\n\r\n\r\nThat's a thing. They're just literally writing the best prompts. They're not necessarily writing code, they're just, we write the right prompts to get the right output? And there are companies doing hundreds of millions of dollars a year that are just a wrapper. Around chat GPT, because they figured out the way to write the right prompt. It's, it's not like there's any proprietary software around it. So yeah, I think there's gonna be a whole host of things that pop up that people aren't even thinking of right now. data, I don't even know the right word. Data, architecture, data, data storage solutions.\r\n\r\n\r\nOur, our, I think are going to become more and more popular. \r\n\r\n\r\nWhat are some other interesting ways that you've seen people making money with AI right now?\r\n\r\n\r\nOh man. Uh, I'd say the, the most common way that I'm seeing people make money with AI right now is going learning AI and then teaching other people how to use ai. I know that sounds like Grif. I don't think it's a grift, but, um, I. There's a lot of people who just don't even know where to start. They're like, I, I don't even know what to do.\r\n\r\n\r\nAnd so if there are people like you who are like, I've done a home services business. I know what it takes to run one of these, and if you wanna learn about ai, I can do a bootcamp. Um, real value. I, I know some people might look at that and be like, oh, nice money grab from Austin. Those, I used to look at it, okay, I'm projecting here.\r\n\r\n\r\nI used to look at it like that, right? I used to look at it as like. Oh, here, buy my course. I'm gonna monetize my audience. I'm now at the point where I'm like, people just don't know and they don't have time. I have more time than you. 'cause you actually have a business. They don't have time to like sit around and dick around on YouTube and like, figure this stuff out.\r\n\r\n\r\nSo it's just cool. I trust you, Austin, just tell me what I need to know. and so many businesses are popping up around that. But they're niche businesses. They're businesses where, oh, Nick does home health and hospice and I'm a home health and hospice operator. I'm gonna go talk to Nick about ai. I'm not gonna talk to Austin. He owns an excavating company. Why am I gonna talk to Austin about a healthcare AI implementation within my business? Um, that to me has been the most easily repeatable and valuable business right now, is just getting people, teaching people how to use and think about ai. Um, beyond that, wrappers like this vibe coding stuff, lovable hugging face.\r\n\r\n\r\nWell, hugging face I guess isn't one of those, but, um. Rep lit cursor where you're just kind of building apps by yourself and, and putting a wrapper around chatt PT. are super fascinating. They have their own set of inherent problems, but I think those are really interesting ways to make money. If you have a cool idea and you're willing to code for 36 hours straight, uh, there's a million things out there, man.\r\n\r\n\r\nIt's, it's, it's, I feel like it's more difficult to pick one thing to learn about than it is. To just get started because like after you get started, then you're like, well shoot, which one of these is the best? I don't, what should I be spending time on? You know what I mean? You know that you spend a bunch of time on this stuff. \r\n\r\n\r\nTotally. Totally. Yeah. I'm, there was a point in time where somebody was asking me like, what, you know, like, what do you think the most important thing you're doing with your day is? I'm like, honestly, right now, the more time I can spend in GPT. Like if I can carve out an hour straight \r\n\r\n\r\nYeah. \r\n\r\n\r\nwith it each day, I feel like I learned something new.\r\n\r\n\r\nI optimize something within the business. And I really do think it's a great time. And once you just get in there and start understanding how to prompt it correctly to get what you need out of it, it can, it can help you move a lot faster. Um, but you did bring up something that I think is, is pretty interesting and I don't know why, like.\r\n\r\n\r\nWhy is there such a negative pushback with the, with the course thing?\r\n\r\n\r\nUm, I think it's because, well, I think people are jealous. I think that's one reason. think that, unfortunately over the last five, 10 years, many people who have no experience with anything, all of a sudden sell courses, teaching people about the experience that they don't have. it's kind of like there's a grift going on.\r\n\r\n\r\nIt feels scammy. Um, and then I think that it courses are not higher education, so there's, there's just a level of skepticism with, does Austin really know? Does he even have a certification? I bet he doesn't even know about the right architecture. he doesn't even understand the, the Geneva protocol that came out last mar, like, know, there's just, it's just easy to be a naysayer. Uh, I think those are the biggest reasons. I don't know. What do you think?\r\n\r\n\r\nI don't know. Um, I think I do see a lot of this though. Um, I. But I do also see people who have built successful businesses, you know, offering some education around it and charging money for it. And plenty of people I've brought on the podcast for example, you know, we'll be in, let's say it, soft washing or tie and stump grinding, right?\r\n\r\n\r\nLike you can't knock a guy for. Being an entrepreneur and figuring out another revenue stream, especially if it's helping somebody. And so,\r\n\r\n\r\nand especially when they're being asked for it and people are like, I'll pay you. Like, just help me get this started. What is he supposed to do?\r\n\r\n\r\nand that's the thing, it's like once you, once you start talking about a business that you've built, plenty of people are d DMing and you just, you definitely don't have enough time to jump on. One-on-one calls. Um, so I don't know. You brought it up and it's been something I've been thinking about recently and I'm like, man, \r\n\r\n\r\nis funny. \r\n\r\n\r\nman, I, you know, if you, if you've built a business like, and, and you truly have become good at it, why not create another revenue stream and sell some information and use it to go pay off some of that heavy equipment that you've built a good business on?\r\n\r\n\r\nLike, \r\n\r\n\r\nYeah. Yeah. \r\n\r\n\r\nwhy not?\r\n\r\n\r\nSame with ai. So is this where you're going with your podcast? You gonna, you gonna lean harder into the AI stuff?\r\n\r\n\r\nUm, I'm gonna lean harder than I did before ai, but I don't think I'm gonna totally shift things. So before ai, it was like, how to help you, uh, buy, and scale your business to, you know, to make your first million dollars. I was like, my idea. Now it's like, start by scale your first business. Using ai.\r\n\r\n\r\nLeveraging ai. So I think AI will be an important component of it. And like I said, I'm launching this accelerator, so in my mind it just will make it easier to be able to take what I'm doing outside of podcasting and have it in the podcast. Um, but I also don't want to go like full just gray Eisenberg or it's just ai, ai, ai. 'cause ai, like AI is good and it's important, but it's a, in my mind, it's, it's a tool in the tool belt. Like if you're trying to build a house. Having this, a saw doesn't build you the house, you gotta have everything. Right? I mean, the saw is incredibly important 'cause you, you can't build a house without one, it's not the whole house.\r\n\r\n\r\nLike there's a whole host of things that you have to do in order to build that house. I won't even get into the rest of the analogy 'cause I know nothing more than that. \r\n\r\n\r\nHmm.\r\n\r\n\r\nI I, I just, it would be intellectually. Non non satisfactory to me to just talk about AI all the time. I wanna talk about like, cool ai, but how do I, how do I put it in my business?\r\n\r\n\r\nHow do I make money from it? How do I scale? How do I grow? do I make a million dollars and, uh, and achieve financial freedom? Like, that's, that's really where I wanna get headed.\r\n\r\n\r\nI love that. That's, it's such an important piece. So your analogy is basically you are still bringing the business acumen and the knowledge of building and scaling businesses to this and your perspective is very similar to mine. Okay. AI is one tool in the tool belt, but if you know how to architect it and put it into place to save time and money.\r\n\r\n\r\nThen that's where I think the true value is here. \r\n\r\n\r\nYeah, a hundred percent. \r\n\r\n\r\nSo tell us more about the accelerator. Is that healthcare specific?\r\n\r\n\r\nuh, it's, it's a, still a little bit under wraps, but yes, it is healthcare specific. Uh, and the idea would be with. lot of the connections that I've had in the industry and then also made over the last couple of years, we would have companies come into the accelerator who are looking for an opportunity to test their product, actual feedback from customers.\r\n\r\n\r\nUh, we'd have a pitch day at the end of the program where we'd bring healthcare specific investors to take a look at these products and obviously invest or not invest, but, uh, I have some really good relationships with people in healthcare and. Instead of doing much cooler things than I've ever done, and they have really big platforms that they're like, yeah, we'll let you test stuff out in these environments. And so for me it's like, I, cool, I can play middleman, I can help identify some cool up and coming companies, give them an opportunity to get an accelerated, um, push. And then, you know, who knows what happens. There's just so much opportunity particular, even if they're just AI rappers to, to make healthcare more efficient.\r\n\r\n\r\nHealthcare freaking sucks right now. From, from an efficiency standpoint, I'm not saying the people or the care that they're providing sucks an efficiency standpoint, it sucks and there's so many things that we could do to make it better, to improve patient experiences, to improve employee experiences, to drive more revenue, to create, be, you know, more bottom line for operators in the industry. And it doesn't have to be through the government coming in and applying more regulations. We can solve it through technology and I, just think it would be fun to play a small role. In what's coming, so that, That's the, uh, the quick and dirty of the healthcare accelerator.\r\n\r\n\r\nThat's awesome. That's awesome. Well, anything else you wanna share on that? \r\n\r\n\r\nNo, man, \r\n\r\n\r\nCool.\r\n\r\n\r\nhave more to say, I'll have more to say at some point when it, when we finally launch it, but \r\n\r\n\r\nOkay. And where can, where can our listeners find, uh, your podcast and your content online?\r\n\r\n\r\nNick omics, N-I-K-O-N-O. MICS, Nick Economics, that's on YouTube, Spotify, apple, or you can find me. Twitter's my favorite place co-founders, Nick, and, uh, come, come say what's up. \r\n\r\n\r\nWell, thanks again for, for making time to be on the owner ops podcast, Nick. I appreciate it. \r\n\r\n\r\nThanks for having me, man. It's always good to see you. \r\n\r\n\r\nYeah, it's always good to chat and we will definitely have more in the pipeline. So, uh, listeners, if you are listening to this text in your questions for what you have for Nick, because we're gonna do another episode, we'll likely do, uh, regular episodes since he has his own podcast as well.\r\n\r\n\r\nBut I want to know specifically what questions about AI do you have. So shoot us a text. 9 7 0 9 8 5 OWNR. We've got a specific text line through open phone that you can text in your business questions. So send those in and, uh, we'll make sure to ask those in the next episode with Nick listeners. Thanks again for listening to another episode of the owner ops podcast, where we publish episodes every Friday about building and growing local service-based businesses.\r\n\r\n\r\nWe also send a newsletter on Saturday where we summarize. The main learning lessons and points that were discussed in the episodes. So if you haven't signed up for that yet, go to owner ops.com/newsletter. And then finally, we did recently launch our school group specifically for local service business owners.\r\n\r\n\r\nSo you can join for free school.com s k.com/owner ops OW N-R-O-P-S. Until next week. Don't forget, work hard, do your best, never settle for less.\r\n\r\n\r\n​",
  "metadata": {
    "duration": "",
    "date": "2025-07-04",
    "platform_source": "Google Drive"
  }
}