{
  "episode_number": "222",
  "episode_title": "3 Home Service Businesses You Can Start with Under $20K with Anne McGinty",
  "guest_name": "Anne McGinty",
  "business_name": "Christmas Lighting Business",
  "transcript": "﻿Nikolas Hulewsky (00:00.366)\r\nLet's do quick mic check. Okay, we're good. Camera check. We are good. Okay, Ann has been too long. I am actually kind of mad at myself that we haven't talked since we spoke. I mean, it feels like nine months ago. You are one of my favorite people. We got to know each other because I saw your story about starting a Christmas lighting business within like 60 days, made $150,000 in your first year. And you were just always scheming. You're always trying to figure out how do I make that money?\r\n\r\n\r\nHow do I get out of the rat race and do the things that I want to do? So today I thought it would be really fun for us to go through if we were starting over the top three businesses that we would get into as first time entrepreneurs. How does that sound?\r\n\r\n\r\nAnne McGinty (00:46.035)\r\nThat sounds great. Let's do it. And as I mentioned before, wait, you just froze, I think. You good?\r\n\r\n\r\nNikolas Hulewsky (00:54.508)\r\nDid my wifi...\r\n\r\n\r\nAnne McGinty (00:57.501)\r\nHello?\r\n\r\n\r\nNikolas Hulewsky (00:58.659)\r\nMeet my Merp.\r\n\r\n\r\nAnne McGinty (01:03.475)\r\nHello.\r\n\r\n\r\nNikolas Hulewsky (01:06.881)\r\nNo!\r\n\r\n\r\nAnne McGinty (01:42.077)\r\nHello? Can't hear you.\r\n\r\n\r\nNikolas Hulewsky (01:43.752)\r\nI got kicked out. I'm sorry. Can you hear me or no?\r\n\r\n\r\nAnne McGinty (01:45.595)\r\nNo, it's all good. I took a screenshot of the photo that you froze on.\r\n\r\n\r\nNikolas Hulewsky (01:52.084)\r\nWhat was it? Was it bad?\r\n\r\n\r\nAnne McGinty (01:53.779)\r\nNo, it's great. like, you're just like really, you're like, yes, we're doing this. I tried to send it to you, but I don't know how to do it in the chat.\r\n\r\n\r\nNikolas Hulewsky (01:56.084)\r\nHuh?\r\n\r\n\r\nNikolas Hulewsky (02:00.98)\r\nNo worries, no worries. Okay, I don't know what happened to my internet. Anyways, all right. Top three businesses that you and I would start if we were starting over. And the reason I wanted to do this with you is because you have a podcast, you've talked to how many entrepreneurs over the last two years.\r\n\r\n\r\nAnne McGinty (02:20.211)\r\nIt hasn't actually been that many. It's maybe 80 or so. It's not like hundreds of people. yeah, the people that I've interviewed though, their businesses are not necessarily the ones that I would start. And we touched on this before we jumped on it. I have to be realistic about my skill set. You know, like I can't start a business that one of my guests has started because I don't necessarily have the experience and the skills that they have. So, but I've got some ideas for what I would start.\r\n\r\n\r\nNikolas Hulewsky (02:24.212)\r\nThanks a lot.\r\n\r\n\r\nNikolas Hulewsky (02:44.382)\r\nSure.\r\n\r\n\r\nNikolas Hulewsky (02:48.563)\r\nI've got a very particular set of skills. Just kidding. No, I feel the same way. I've had a bunch of people on that I just was interested to learn from. And I'm not going to go and start their business, like whatever SaaS company that they did. But I do get a kernel every time that I talk to somebody where I'm like, that's interesting. I wonder if I could kind of apply that. So for me, it's been taking all these ideas and putting them together and getting a good idea.\r\n\r\n\r\nAnd you and I just had so much fun the last time we spoke. I just thought this would be a really fun exercise. Can I tell you just for me, like how I think about finding these first businesses? Okay. I sent you over this tool cause I get like really nerdy about it, but I built like myself this framework, but there are, think there are three things that, that are dummy insurance for first time entrepreneurs. The first thing is macro trends. freaking love macro trends.\r\n\r\n\r\nAnne McGinty (03:20.135)\r\nYeah.\r\n\r\n\r\nAnne McGinty (03:25.466)\r\nYes, please.\r\n\r\n\r\nNikolas Hulewsky (03:45.044)\r\nSo what's an example of a macro trend? There's macro and micro, macro economics, micro economics. Macro is the big picture. What's happening around us? Micro is gonna be sort of at your local level. So macro trends that I love, the aging population. That's a macro trend, right? Our country is getting older. We're seeing more and more people aging into retirement and that industry is growing like crazy. What would be an example of another macro trend? Social media or mobile, you know, when we first went to mobile, that was a macro trend.\r\n\r\n\r\nAnne McGinty (03:58.414)\r\nMm-hmm. Yeah.\r\n\r\n\r\nNikolas Hulewsky (04:12.968)\r\nHome services is a macro trend because we haven't built enough homes in the United States. They're getting dilapidated. People need to take care of them. Let's hire some people to fix some stuff, right? So those are macro trends that I just love to look at. Are there any macro trends on your radar?\r\n\r\n\r\nAnne McGinty (04:14.515)\r\nLove that.\r\n\r\n\r\nAnne McGinty (04:29.841)\r\nI mean, health and wellness, longevity space. I see declining trends like alcohol and...\r\n\r\n\r\nNikolas Hulewsky (04:38.718)\r\nDude, I just saw that on CNN. It was like the lowest levels of alcohol consumption since like the 1930s.\r\n\r\n\r\nAnne McGinty (04:45.489)\r\nYeah. And we're seeing it in this area. I wineries are struggling. Breweries, I don't know as much, but there's a cultural shift happening. so, you know, as longevity and wellness is growing, obviously the things that take away from health and wellness are going to go down a little bit. Other macro trends. mean, obviously there's an AI space, but like that's getting a little bit overhyped right now.\r\n\r\n\r\nNikolas Hulewsky (05:08.019)\r\nYeah.\r\n\r\n\r\nSo the reason I like macro trends and they're the first form of dummy insurance for me is because you don't have to be the smartest person to be successful when there's a really strong tailwind. And like Warren Buffett says that, what's my favorite kind of boat? One with a strong tailwind, right? Like if you're riding a big wave, you don't have to be the smartest or the best operator or have this innovative idea. Like you just hop on a trend and that's gonna carry you forward. So that's for me, that's why I like these macro trends for first time entrepreneurs is\r\n\r\n\r\nAnne McGinty (05:27.015)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (05:40.562)\r\nYou can make a lot of mistakes, but because it's growing so fast, you're just going to continue to get demand for your business and have a cushion to make those mistakes and learn from your mistakes. I don't know, any thoughts on?\r\n\r\n\r\nAnne McGinty (05:51.123)\r\nWell, and I love that, but macro trends, see to me, I think I'm maybe more of a micro type of a trend business person. Like I'm not the big ideas grow a business to a $500 million type business. I am looking at businesses that I can grow to create a very specific outcome for me and my family and then flick it on. Like I am not great at coming up with businesses for purpose or for...\r\n\r\n\r\nNikolas Hulewsky (05:56.82)\r\nAnne McGinty (06:19.571)\r\nI'm just being honest. I'm being honest. I'm really good at coming up with businesses that just make good money with low overhead and produce the type of lifestyle that you want to live. So I'm not, again, going to be coming up with like the next headspace or I'm, you know, it's not, while those are wonderful macro trends, I'm, guess I'm just, I don't necessarily know how to participate in them.\r\n\r\n\r\nNikolas Hulewsky (06:20.926)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (06:45.288)\r\nYeah, let me, so I think we are on the same page and maybe I just set it up really poorly. I don't, for me, this isn't about building a hundred million dollar company. For me, it's like, what is a macro trend that's happening? And then what is a way that I can ride that to effectuate the outcome that I want? Yeah. Right. And so like your business that you started, you're like,\r\n\r\n\r\nAnne McGinty (07:04.517)\r\non a local, okay, on like a more regional level.\r\n\r\n\r\nNikolas Hulewsky (07:12.198)\r\nin July, you're like talking to somebody and you're like, I talked to three people today, honey, that all, and you talk to somebody that wants it, that does Christmas lighting. That's interesting. Let's go take a course. A month later, you guys are launching this Christmas lighting business. And within 60 days, $150,000, I think in your first 60 days worth of business, right? But that was writing a macro trend where people are just outsourcing. They're like, we'll pay somebody to come hang our Christmas lights, right? Like probably in the 1950s, you're not able to launch that business.\r\n\r\n\r\nAnne McGinty (07:16.339)\r\nhehe\r\n\r\n\r\nNikolas Hulewsky (07:41.729)\r\nthat it just wasn't something that people were necessarily doing.\r\n\r\n\r\nAnne McGinty (07:43.997)\r\nTotally. Well, maybe the disposable income wasn't there. And this is, you're going to see a theme in the businesses that I would start, because I'll just tell you what that theme is. Home services businesses that cater to the ultra wealthy.\r\n\r\n\r\nNikolas Hulewsky (07:47.155)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (07:52.209)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (07:56.788)\r\nI like you. Unfortunately, I think we might have the same number one.\r\n\r\n\r\nAnne McGinty (07:59.801)\r\nEvery single business that I think I would start if I was starting all over again, it falls into that niche.\r\n\r\n\r\nNikolas Hulewsky (08:08.788)\r\nOkay, services for the ultra wealthy, home services for the ultra wealthy. Ooh, I freaking like that. So.\r\n\r\n\r\nAnne McGinty (08:14.577)\r\nHome service businesses for yeah, for the ultra wealthy.\r\n\r\n\r\nAnd it's partially because of my experience with the holiday lighting business and how lucrative it was and just how easy it was to grow by word of mouth and also to get it started because I think we got it started for less than $20,000. So I like low overhead. Like I'm not gonna start a retail shop. I'm not gonna do a CPG. I am not gonna do technology and SaaS because I don't know how. And...\r\n\r\n\r\nNikolas Hulewsky (08:46.61)\r\nYep. Well, no, so I love this. It was accelerated by COVID, but that was a macro trend that was happening, right? More and more we were doing things. Amazon Prime is overnight shipping to our house. DoorDash. I mean, I honestly don't do DoorDash, but I know tons of people who are like multiple times a week ordering DoorDash to come to their home. Some of the other services that you just named, mobile IV hydration, I think is an incredible business in the healthcare space.\r\n\r\n\r\nAnne McGinty (08:48.625)\r\nYeah, I'm like, no, yeah.\r\n\r\n\r\nAnne McGinty (09:04.967)\r\nMm-hmm.\r\n\r\n\r\nAnne McGinty (09:15.571)\r\nVery niche, that's up your alley.\r\n\r\n\r\nNikolas Hulewsky (09:17.748)\r\nOh, freaking yeah, you'll see you'll see a theme for me as well. But, but no, it's still it's taking advantage of, hey, there's home services that are becoming more and more popular because people are like getting things done at their home, but also the ultra wealthy have disposable income. So how do I take advantage of that? Okay, I love that. love that. I know.\r\n\r\n\r\nAnne McGinty (09:35.483)\r\nWell, and the rich are getting richer, right? So like that is an unfortunate circumstance in our economy is that our middle class is shrinking, rich are getting richer, the poor are getting poorer. And the wealthy have more disposable income, they can ride out downturns more easily. So if you're providing them a service, they're probably not gonna discontinue that service just because there's an economic downturn.\r\n\r\n\r\nNikolas Hulewsky (09:58.396)\r\nI Yeah, I totally agree. Okay, so macroeconomic is my first. The second dummy insurance that I have high margin businesses. Again, I just think you have a lot to play with there. If you've got high margin businesses, if I decide to start an e commerce company, or a third party logistics company, those are low margin, high volume businesses, you have very low margin for error. So\r\n\r\n\r\nAnne McGinty (10:10.003)\r\nMm-hmm.\r\n\r\n\r\nAnne McGinty (10:23.153)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nSame with CPG. Or food, restaurants, restaurants, retail, CPG.\r\n\r\n\r\nNikolas Hulewsky (10:28.402)\r\nYep, like.\r\n\r\n\r\nOh, restaurants. Yeah. Anything that's like become commoditized. Really. Um, those are just really hard spaces to operate in. I'm not saying you shouldn't do that, you know, at some point, but for a first time entrepreneur, for me, I'm choosing businesses with high, high margins. Uh, and then my third would be, and it goes along the same lines as high margins, a very quick cash conversion cycle. I don't, I don't want to be messing with collections.\r\n\r\n\r\nI don't want a bunch of net 30, net 60. Preferably you pay me upfront for services that I'm going to do, but I want to get that cash as quickly as possible because I just don't want to play. I don't want to play that game. So those are kind of my.\r\n\r\n\r\nAnne McGinty (11:16.179)\r\nWell, even, even, I was gonna say even better if you can get a deposit from the person and that deposit covers all of the expense. And then the second payment is all profit.\r\n\r\n\r\nNikolas Hulewsky (11:25.556)\r\nMmm. Yeah.\r\n\r\n\r\nAnne McGinty (11:28.595)\r\nBecause then you may not even necessarily need a lot of cash in order to get started because you're getting started on the deposits.\r\n\r\n\r\nNikolas Hulewsky (11:35.614)\r\nTotally, yeah, and then those deposits are able to be your work, totally, because then that's your working capital and your investment capital to do the other things that you need to do in order to grow. Yeah, that's a really good point. Yep, it's dummy insurance. You don't have to be a freaking genius if you've got good margins, strong macro trends, and you're getting cash really quickly.\r\n\r\n\r\nAnne McGinty (11:36.775)\r\nDo you get what I'm saying? Yeah. That's your working capital. Yeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (11:56.276)\r\nSo I wanna hear your first business. What's number one on your list?\r\n\r\n\r\nAnne McGinty (11:59.347)\r\nIt's actually very similarly related to what I already did. So it would just be luxury holiday and event decor services, but it would encompass not just Christmas, but potentially Halloween and anything with lighting and floral parties. Because for the ultra high net worth individuals, when they're getting those garlands placed in places or the table settings,\r\n\r\n\r\nNikolas Hulewsky (12:18.088)\r\nReally?\r\n\r\n\r\nAnne McGinty (12:27.467)\r\nor the Christmas lights and you just become their go-to for everything. You have recurring revenue all year and you can hire instead of seasonally, you can have full-time employment. So that was what we struggled with was with our business. And we noticed when we would go out and the companies that would be coming in to provide services and decor for the other parts of the year, it was like, there's somebody that's literally handling every holiday of the season for these.\r\n\r\n\r\nultra high net worth people. It's lucrative.\r\n\r\n\r\nNikolas Hulewsky (13:02.836)\r\nOkay, so, cause when you launched your business doing Christmas lighting, it was seasonal, it was once a year. But those customers that you were selling to probably had multiple times a year that they would have paid for other things. Easter set up, Halloween set up.\r\n\r\n\r\nAnne McGinty (13:15.997)\r\nThey would ask us all the time. Yeah. They would say, do you do Halloween? Do you do Easter? Do you do 4th of July? Like, do you do anything else? And it's like, well, no, we just specialize on Christmas. And that was enough for us. But obviously, we could have had a business that was five times the size if we started expanding into other seasons.\r\n\r\n\r\nNikolas Hulewsky (13:19.66)\r\nmy gosh.\r\n\r\n\r\nNikolas Hulewsky (13:36.436)\r\nHave you heard of a business called pumpkin porch decorating? Okay, it's this woman, she lives in Dallas. My friend Chris met her. All she does every year is she decorates homes with, and their porches with like pumpkin and fall feel. So it's not quite Halloween, but it's sort of at the same time of year and she goes and she decorates, she sets everything up.\r\n\r\n\r\nAnne McGinty (13:41.303)\r\nNo?\r\n\r\n\r\nNikolas Hulewsky (14:03.55)\r\nAnd then she also takes everything down and her business is doing a million and a half dollars a year. I got to find her so that I think you would like her as an interview. Yeah, like it's incredible, but also similar. What would you do in the spring?\r\n\r\n\r\nAnne McGinty (14:10.503)\r\nThat's what I mean. Yeah, I I would like her too.\r\n\r\n\r\nIt's the same for spring though. Spring, 4th of July, Easter, flowers, anything. People who have these really fancy homes, I I'm talking ultra high net worth. So the people that we worked with were making so many millions of dollars a year that they really just wanted what they wanted because they wanted it and they had the money to afford to pay for it. And they usually would have multiple homes as well.\r\n\r\n\r\nNikolas Hulewsky (14:21.972)\r\nMmm.\r\n\r\n\r\nAnne McGinty (14:41.041)\r\nAnd so sometimes if they had their house in San Francisco that was worth 15 million and then they had their house in Jackson Hole that was worth another 15, 20 million and then they had their other house somewhere else, they'll decorate all of them and they'll just find the local service provider in each of those locations to get what they want. So again, this is not for purpose. This is for money. it's like,\r\n\r\n\r\nNikolas Hulewsky (15:05.225)\r\nYeah.\r\n\r\n\r\nAnne McGinty (15:07.435)\r\nNow I'm at a point in my life where I'm like, okay, I want to do something a little bit more for purpose. But if I were just starting out, you got to go for the stuff that's going to provide you with windfalls. You need a lot of money fast. And then that way you can get your money to start working for you.\r\n\r\n\r\nNikolas Hulewsky (15:18.076)\r\nAll right, let me show you this later.\r\n\r\n\r\nNikolas Hulewsky (15:24.116)\r\nOkay, let me show you this lady. Here she is.\r\n\r\n\r\nSo she charges over $1,000 to come and decorate your porch. I wanna say she's crazy, yeah. And that would piggyback perfectly on your Christmas lighting business.\r\n\r\n\r\nAnne McGinty (15:33.009)\r\nYeah, this does not surprise me.\r\n\r\n\r\nAnne McGinty (15:42.149)\r\nWhat? Totally. And the thing is that she's just saying over a thousand dollars because she probably doesn't want to reveal how much people actually spend. There are going to be people, there will be people who spend 5,000 to $10,000 to decorate their houses for Halloween. There will be.\r\n\r\n\r\nNikolas Hulewsky (15:52.35)\r\nYou think so?\r\n\r\n\r\nNikolas Hulewsky (16:01.012)\r\nThat's insane to me. freaking hate Halloween. how would you start this business? Let's go with the first thing. How much money do you think it would not not the pumpkin business, but like you're saying year round decoration services, would it be sort of a monthly recurring thing and then you would just do each one of the I don't know, holiday? No.\r\n\r\n\r\nAnne McGinty (16:01.086)\r\nHahaha!\r\n\r\n\r\nAnne McGinty (16:21.771)\r\nNo, no, I think that, and we don't, know in our last talk, we talked a lot about the Christmas lighting business. So can definitely talk about some of the other ideas that I have, but I would start with just one niche, which would be Christmas. And then I'd get that solid. And then from there, I would start adding on because you need cashflow fast, I think. And Christmas is where people spend majority of their money. Like if you look at the quarters divided out over the year, fourth quarter is the biggest spend.\r\n\r\n\r\nSo I would nail one of those and then I would start adding on services and it wouldn't be recurring. People would just need to know that you were available for them for the various holidays and then you would create packages I would think for each one. So if a client was spending $5,000 with you for Christmas, maybe they'll spend $3,500 with you for Halloween and when 4th of July comes, it may be less, but I would nail Christmas first.\r\n\r\n\r\nNikolas Hulewsky (17:17.652)\r\nSo you would, just a reminder of the way that it worked. You had the idea for the Christmas business in July, August. You go and take a course, you get certified. You launched the business by like December 17th, everything's done and you had made $150,000. Would you, true.\r\n\r\n\r\nAnne McGinty (17:35.571)\r\nYeah, I mean, we still had to take the lights down, we took the lights down between January 1st and 6th. We had everything down. That's how fast it comes down.\r\n\r\n\r\nNikolas Hulewsky (17:43.956)\r\nOkay, so would you then take that, that money and right away launch into, hey, we're also doing, I don't know, Valentine's Day, hey, we're also doing Easter, hey, we're also doing 4th of July, or would you like wait another year to do the Christmas thing again and build up a big bank and then launch into those other services?\r\n\r\n\r\nAnne McGinty (18:06.395)\r\nI think it would really depend on the first season. And if the first season you were able to employ a number of people that you thought you could easily bring back again just seasonally, I would probably take a break and then go back to the Christmas season and grow it first and grow the team. And then when it came to the point where the team was needing another reason to stick around, I would start bringing in more services.\r\n\r\n\r\nNikolas Hulewsky (18:34.036)\r\nYou could even test sort of dynamically with the pricing on that first season and be like, hey, like how much would it cost to decorate a home with Christmas lights? High end home, $5,000?\r\n\r\n\r\nAnne McGinty (18:45.723)\r\nIt would really range. I mean, we had some clients who spent $30,000 with us. So, and that's multiple, you know, that's, I'm not saying there's one person who spent that. That's why I mean ultra high net worth, like people who have hundreds of millions of dollars because they want what they want and they'll pay for it. And so if you're...\r\n\r\n\r\nNikolas Hulewsky (18:50.694)\r\nOkay\r\n\r\n\r\nNikolas Hulewsky (18:56.506)\r\nThat's insane. my gosh. Okay, give me...\r\n\r\n\r\nNikolas Hulewsky (19:06.836)\r\nSo could you have gone, let's just say to the $30,000 person, could you have gone to them and been like, we'll do 30,000 for Christmas, or if you pay us right now, $60,000, we'll do Christmas, we'll do Easter, and we'll do Halloween next year as well.\r\n\r\n\r\nAnne McGinty (19:11.036)\r\nYeah.\r\n\r\n\r\nAnne McGinty (19:25.651)\r\nI think you could potentially bundle it that way. I guess that for me, I always was on the sales side of like wanting the customer to be really happy. Like I wanted them to be satisfied with everything. And so I wouldn't want them to feel like I was trying to finagle something. I would just provide them with an excellent service for Christmas. And then I would say, just so that you know, we're also expanding our services into XYZ and\r\n\r\n\r\nkind of gauge their interest. And if they're interested in hearing more about it, I would just explain, well, for your expansive estate, like, this is what we can do for Halloween, you know? It's like, I've got this one property in mind that we did for Christmas. And I mean, was, it was an acreage in the Bay Area and with wandering driveway with redwoods and lawns. And I'm just thinking what an outrageously cool Halloween display you could do there. Because,\r\n\r\n\r\nNikolas Hulewsky (20:18.332)\r\nYeah, okay.\r\n\r\n\r\nAnne McGinty (20:19.291)\r\nYou could do all of the headstones and the scary thing. There was just so much to work with. And then you could also do the lights. again, like these ultra high net worth families, you really don't need too many of them in order to have a secondary business. So if you can get some of them to jump on board with you, then.\r\n\r\n\r\nNikolas Hulewsky (20:37.755)\r\nI mean, $30,000 a pop, five of them is 150 grand. It's just...\r\n\r\n\r\nAnne McGinty (20:43.845)\r\nYeah, I think we had five of them.\r\n\r\n\r\nNikolas Hulewsky (20:46.452)\r\nSo when you launched this business the first time, I believe your method of getting customers was parking a van and going door to door.\r\n\r\n\r\nor flyers, sorry. How would you get customers now?\r\n\r\n\r\nNikolas Hulewsky (21:04.796)\r\nSame way. You wouldn't do anything different.\r\n\r\n\r\nAnne McGinty (21:05.158)\r\nI don't think I would do anything different. No, I would do it the same way. I would do it the same way. Maybe my flyers would not be made on a home printer because that was, but maybe there's something about that that made people go, these people are just getting started. They're gonna do a good job. So maybe there was some charm to the way that we did it that way. I think it's really getting the foot in the door. And then from there, you can prove. You can prove yourself through trust.\r\n\r\n\r\nNikolas Hulewsky (21:21.199)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (21:27.549)\r\nOkay.\r\n\r\n\r\nAnne McGinty (21:33.693)\r\nprove yourself through your work ethic and.\r\n\r\n\r\nNikolas Hulewsky (21:36.668)\r\nHere's my last question on this one. Knowing what you know now, how much revenue do you think you would generate in your first year? And what do you think your net margins would be?\r\n\r\n\r\nAnne McGinty (21:48.445)\r\nHmm. For our start today, that's a really hard one. And I want to give you as close of an honest opinion as I can. And the way that I'm going to do that is just by assuming that inflation has made the price go up so much that maybe 250,000?\r\n\r\n\r\nNikolas Hulewsky (22:04.372)\r\nSure. And what do you think your net margins, what do you think your net margins would be on that 250?\r\n\r\n\r\nAnne McGinty (22:10.235)\r\nI think you would have a net profit of at least 50%.\r\n\r\n\r\nNikolas Hulewsky (22:15.566)\r\nJeez. Is it because you'd be doing the majority of the work yourself?\r\n\r\n\r\nAnne McGinty (22:19.653)\r\nI think that you'd want to go in and do the work yourself the first year, just so that you can understand what the complexities are so that you can get better at your bidding and you can get better at training. Because if you don't know it firsthand, then you can't prepare your staff well enough.\r\n\r\n\r\nNikolas Hulewsky (22:24.02)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (22:32.276)\r\nCheers. Yeah.\r\n\r\n\r\nNikolas Hulewsky (22:37.34)\r\nIt's true. That's true. Okay. I like that one. It's a good one. All right. My turn. Here's, here's\r\n\r\n\r\nAnne McGinty (22:43.259)\r\nMy other ones are not all so different. Yeah, tell me what's one of yours?\r\n\r\n\r\nNikolas Hulewsky (22:46.792)\r\nHere's my first one. I'm cheating a little bit. Sorry. I'm like you, like you were saying. I think it's very much a function of you as the entrepreneur. What's your skill set? What do know that will determine what businesses that you should do? I totally agree with that. However, I also think if you apply this, hey, let me put some dummy insurance on it, you can marry those two things. You can marry your skill set with businesses that have a high probability of success. So for me,\r\n\r\n\r\nand I freaking love these businesses right now. I know healthcare and I would start a business in the healthcare space. So there are two businesses in particular that I would focus on. The first business would be anything services related to the elderly population. I mean, we both know elderly population is growing like crazy. And like, here's just an example. Let's hear it by 2050.\r\n\r\n\r\nAnne McGinty (23:39.155)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (23:46.612)\r\n27 % of North America will be over the age of 65. It's like 17 % right now. Yeah, so that's almost a third.\r\n\r\n\r\nAnne McGinty (23:50.611)\r\nWow. Okay. Yeah.\r\n\r\n\r\nAnne McGinty (23:56.915)\r\nOkay, but if you don't know the healthcare space, how is someone who doesn't know the healthcare space going to get the experience, knowledge, skills in order to do it well?\r\n\r\n\r\nNikolas Hulewsky (24:01.694)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (24:10.228)\r\nSo that's what's so great about the healthcare space is there are a million different ways that you can make money in this space. Let me name the second thing and then I'm gonna answer that question. The second thing are ABA clinics, autism and behavioral health clinics. Did you know like when I was born in 1985, one out of every like 400 kids had autism at birth? And today it's like one out of every 28. I'm no mathematician, but those are big changes.\r\n\r\n\r\nAnne McGinty (24:34.247)\r\nWhoa. Okay, but what do they think the reasons, okay, sorry, that's another topic, but I feel like that could be diagnosis, right? Like that could be that they're diagnosing early.\r\n\r\n\r\nNikolas Hulewsky (24:40.084)\r\nOh, well, canceled. Oh, for sure. Yeah, it's a combination of the two things. So those two businesses in particular, I love because both of them, if you look, if you just look at like the general growth rate in the United States, inflation's at 3 % our GDP is at 3%. Both of them are growing in double digits. And so if, if just that overall industry is growing at double digits, you have a lot of room to take advantage of the upside, but also you can make some mistakes as you're learning along the way.\r\n\r\n\r\nThe reason I love healthcare. Yes.\r\n\r\n\r\nAnne McGinty (25:10.393)\r\nGive me an example though, too. Give me an example of exactly what you mean by a health space service business. Like a real example.\r\n\r\n\r\nNikolas Hulewsky (25:15.689)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (25:19.785)\r\nOkay, so you can go anywhere on the spectrum from owning a medical practice, which depends on the state. So you have to get licensed, you just have physicians, they have to be credentialed, you have to do the billing and collections and all that stuff. Or all the way on the other end of the spectrum, where it's like, I don't want to work in the medical space, quote unquote. I want to have a company that sells supplies to a skilled nursing facility company, or I want to have a company that just does transcription services.\r\n\r\n\r\nfor a medical group or I wanna have a company that just does AI implementations in hospital settings. So there are, you think of any service that you do and that you've done and you can apply it to the healthcare space. Are you ready for this, Anne? Ms. Anne McGinty, you could launch a seasonal business decorating assisted, independent and skilled nursing facilities.\r\n\r\n\r\nAnne McGinty (26:02.451)\r\nMm-hmm. I want to hear what you have to say. I want to see how you would do this.\r\n\r\n\r\nAnne McGinty (26:12.536)\r\nmy gosh, we're layering on top. You and I are going into business together.\r\n\r\n\r\nNikolas Hulewsky (26:14.708)\r\nDude, you totally could. They do it every single year. Like, and when you think about it, assisted living, independent living facilities, that is those residents' home. I know like it's kind of weird and you're like, it can be icky, but more and more of us as we're aging are living in those places and you drive past them, they're decorated, they spend money on decorating them. Why wouldn't you go to that corporation and be like, it's not a ultra high net worth individual, but it is a company that has funds. They could spend 10,000, $15,000 to decorate their facility.\r\n\r\n\r\nAnne McGinty (26:24.551)\r\nYeah.\r\n\r\n\r\nAnne McGinty (26:43.421)\r\nTotally, yeah.\r\n\r\n\r\nNikolas Hulewsky (26:44.69)\r\nThat so that would be an example of, Hey, I have this skill set. There's also this macro trend. How could I take advantage and like apply it to that space? And for somebody like me, I really, really love, let's say home health hospice. I'm not scared of the credentialing and the licensing and making sure that I, you know, we're reading all the regulatory and compliance requirements, but there are tons of service businesses that support those kinds of companies, HR, payroll, accounting, anything and everything. So.\r\n\r\n\r\nIt's almost like pick your business and then apply that to a niche vertical within the healthcare space.\r\n\r\n\r\nAnne McGinty (27:18.801)\r\nOkay, so how would you get that started? How would you get your first clients if you didn't have the network that you have?\r\n\r\n\r\nNikolas Hulewsky (27:27.18)\r\nI always kind of work backwards. I, the first thing is I, you can do it one of two ways. Way number one, you're super passionate about it. I think that's a really good way to do it. So let's say that I had a child with autism and I'm just already in those communities and I'm passionate about it. And I would, I could start an autism clinic. would, I would start networking that way. So I'm not going to talk about that. I don't know anybody. I would start looking at a way to piggyback. think piggybacking is like the best way to get into entrepreneurship. Who do I know that has a relationship?\r\n\r\n\r\nAnne McGinty (27:55.507)\r\nWhat do you mean by that?\r\n\r\n\r\nNikolas Hulewsky (27:57.012)\r\nYep. Who do I know that has a relationship of one to many? Because if they have a relationship of one to many, then I can piggyback on their distribution channel to start getting business. So for example, maybe I have a neighbor who owns a medical practice. Maybe I have a neighbor who owns a med spa and he's always talking to me about how hard their collections are. And I have a skillset with accounting or AI automations, et cetera. And I just say, Hey, let me come in and take a look. I'll do it for free. We'll do a 30 day trial.\r\n\r\n\r\nand see if I can find some opportunities within there. So I would start by looking at my network and then layering on what's my experience, what's their pain point, and seeing if I could launch a business within that space. I personally would go buy a business, but I think that's kind of the lens I would start with if I was starting a business within the healthcare space. I don't know, what do you think?\r\n\r\n\r\nAnne McGinty (28:49.811)\r\nthink that if I were to get a business or start a business in the healthcare space, I would definitely need to buy one. I do not think that I have the skill set, know how, understanding of how to get something like that started to ramp up to the point that I need it to be. But if you buy an existing one, then it's a well-oiled machine, then it's really just a numbers game and it becomes operations at that point. So I would definitely buy a business. Yeah. And there's probably a bunch that are available right now.\r\n\r\n\r\nNikolas Hulewsky (28:57.171)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (29:17.046)\r\nI'm\r\n\r\n\r\nNikolas Hulewsky (29:20.628)\r\nWell, and the crazy thing about healthcare, this is going to sound really crazy people who have operated in really competitive businesses. If you talk to any provider, they will tell you the same thing. I'm so busy. what's your marketing look like? I don't really do any marketing. We just kind of opened and we started getting clients. The barrier, like the bar is so low. You're not operating against Mark Zuckerberg and Jeff Bezos. You know what I mean? Like you're operating against people who really aren't that sophisticated.\r\n\r\n\r\nAnne McGinty (29:33.554)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (29:49.328)\r\nThat's another reason why I like that space. The downside risk isn't terrible.\r\n\r\n\r\nAnne McGinty (29:54.983)\r\nHow many clients would you need in order to reach profitability?\r\n\r\n\r\nNikolas Hulewsky (29:59.732)\r\nIt depends on the business that I would launch. The one that I would focus on, well, there's two things. Me and my skill set, I would buy a business. And so you'd probably need around 50 to 100 patients in order to have it be running profitably. If I was doing just a straight services business, let's say we did the Christmas tree lighting, you probably need 10 really good clients. And you'd want to choose a high ticket.\r\n\r\n\r\nhigh-paying offering to build a business around. So, probably 10 clients.\r\n\r\n\r\nAnne McGinty (30:37.085)\r\nSounds, that sounds pretty, not too crazy. That sounds pretty doable.\r\n\r\n\r\nNikolas Hulewsky (30:37.502)\r\nCrazy.\r\n\r\n\r\nNikolas Hulewsky (30:41.318)\r\nIt's not doable. And like I said, for me, I love elder care and the autism clinics because there's also a component of that makes me feel good. It feels like I'm actually doing something good. those are businesses I would personally start, but there's a myriad of services businesses that you could get into that aren't necessarily those. So that's my number one.\r\n\r\n\r\nAnne McGinty (30:52.199)\r\nYeah.\r\n\r\n\r\nAnne McGinty (31:04.167)\r\nlove that you get purpose out of it too, because as I mentioned again, I am not great at coming up with businesses for purpose. I am good at coming up with businesses that will make you some money so that you can grow your money. This is something that I, like as I've aged, you know, from my 20s to 30s to 40s, now I'm sort of looking back in retrospect and going, okay, I didn't do a whole lot for purpose other than raise my family at the best possible way I could. What can I do now for purpose? So I'm sort of like a late bloomer in that sense.\r\n\r\n\r\nbecause my other two businesses are also equally not as purposeful. But I think that...\r\n\r\n\r\nNikolas Hulewsky (31:39.89)\r\nI see, I would just push back a little bit on you. You're successful because you did have a purpose. Your purpose was, I want to architect a lifestyle that is this, right? Like that was your goal. And so I think people really run into issues when they don't know what their goal and their target is and what motivates them. If they just think it's money, that's a problem. But if people like you are like, no, no, no, no, I want to have freedom. I want to do X, Y, and Z things.\r\n\r\n\r\nAnne McGinty (31:54.171)\r\nSure, yes.\r\n\r\n\r\nAnne McGinty (32:05.511)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (32:09.876)\r\nSo I do think you had a purpose like you shouldn't you shouldn't dog on yourself\r\n\r\n\r\nAnne McGinty (32:13.947)\r\nOkay, fine. That's fair. And I do think that the greater purpose that we felt was being the best employers that we could be. It was providing for our family, obviously. And when it came to interacting with our clients, it was kind of like becoming friends with them. So establishing that level of trust so that I wasn't being a salesy, doing it for myself kind of a person. Like, yes, we were profiting greatly, but\r\n\r\n\r\nwe also were doing it because our client truly wanted the service that we were providing. We weren't trying to tick up another dollar sign. It was just like, what is it that you truly want? And then we would let that lead the show.\r\n\r\n\r\nNikolas Hulewsky (32:54.152)\r\nthink if you were truly doing it for business, you wouldn't have said any of those words. Like if you were truly just doing it to make money, yeah.\r\n\r\n\r\nAnne McGinty (32:59.347)\r\nJust for just for money. Yeah, that's where we found the purpose and and there was a client who I one of our clients again he you know, lives in a mansion and he is one of the nicest guys and I was talking to him just about how the hardest part of the business was feeling like we were just promoting commercialization of Christmas and so it just was feeling like there was a lack of purpose as we've been saying and he said, I completely disagree every time I wake up in the morning and I drive\r\n\r\n\r\nto get out of my driveway and I see the front of my house, it makes me so happy. And then I go to work and I'm happy all day and I spread that around. And then when I come home at the end of the day, I'm happy because I see my house is so pretty. So that was nice to hear.\r\n\r\n\r\nNikolas Hulewsky (33:35.358)\r\nSee?\r\n\r\n\r\nNikolas Hulewsky (33:39.646)\r\nSee?\r\n\r\n\r\nBoom, purpose, see? Come on, Ann.\r\n\r\n\r\nAnne McGinty (33:45.659)\r\nI'm not like changing the world though. You know, it's not.\r\n\r\n\r\nNikolas Hulewsky (33:48.628)\r\nDon't do that. We all change the world. We all change the world. That's such a, I hate that. I wanna leave my dent in the universe. anyways. You should feel better. You're very talented, you're very successful and you've done a lot of cool things. What's your number two business?\r\n\r\n\r\nAnne McGinty (33:58.483)\r\nYou\r\n\r\n\r\nYou're making me feel better, thank you.\r\n\r\n\r\nAnne McGinty (34:10.097)\r\nOkay, so my number two business is fairly related. It would just be exterior cleaning and detailing for high-end homes. And this would include pressure washing, window cleaning, solar panel cleaning, and gutter cleaning. But I would package them. I wouldn't provide them as a package, but I would market my business as providing all of those services. And I would just do it really high-end, like white glove approach.\r\n\r\n\r\nNikolas Hulewsky (34:24.336)\r\nWould you package all of those together?\r\n\r\n\r\nAnne McGinty (34:39.921)\r\nfocus on the branding, focus on the service and go once again for the high net worth people because they all talk. Like we would sometimes work with home managers and the home managers would talk to each other. They started compiling booklets online. I guess they were online, but they started originally in paper. I just dated myself. But they would start doing online sharing of their home service contractors. And so,\r\n\r\n\r\nNikolas Hulewsky (34:59.134)\r\nOkay.\r\n\r\n\r\nAnne McGinty (35:08.625)\r\nThen we became, we were part of that list and it just sold itself. once again, if you're doing people, you gotta imagine these homes, they've got floor to ceiling windows. They're like 20 feet tall. They don't know how to clean them, but they want their windows cleaned. And that might be once a season. So it could be four times a year just to clean all of their windows on their house. And that can be quite lucrative, just window cleaning.\r\n\r\n\r\nNikolas Hulewsky (35:33.748)\r\nAnd again, you would go back to that lens of ultra high net worth. that's the area you're gonna target. You're not just gonna do that bundled package anywhere.\r\n\r\n\r\nAnne McGinty (35:38.331)\r\nYes. Because no, and I'm sorry for people who need that service and they're not technically in the ultra high note worth category, but the reason why is that if you're going to the expense of sending your team to one location, it'd be great if that team could stay at that location all day. Then you don't have any lost profit in transportation. You're not going from site to site.\r\n\r\n\r\nNikolas Hulewsky (36:02.376)\r\nYeah.\r\n\r\n\r\nAnne McGinty (36:05.137)\r\nAnd there is actually lost time with just the setup and the breakdown. Cause if you need ladders and things like all of that time really adds up to loss revenue. So if you can just be at one site for the whole day and all it is as a matter of I'm sending a team of two or four or six or eight, then you're just getting more efficient.\r\n\r\n\r\nNikolas Hulewsky (36:24.788)\r\nHow would you acquire those customers? What would you do?\r\n\r\n\r\nAnne McGinty (36:29.235)\r\nI would probably do the same thing that I did before. I think I would find the zip codes. I would find the zip codes. I would really look in my area to see where those people live. And then I would sort of draw regional maps, like circle them on a map and then pick within there, like what is the best place and try to get my foot in the door anywhere with them. You could even...\r\n\r\n\r\nNikolas Hulewsky (36:32.478)\r\njust canvassing the neighborhood.\r\n\r\n\r\nNikolas Hulewsky (36:54.068)\r\nSo.\r\n\r\n\r\nAnne McGinty (36:54.971)\r\nLet them know, I am willing to do this for you for free just to see how you like the service if you would be willing to refer me to your neighbors and the person will probably love that. Or you obviously with social media, there are ways that you can do this as well.\r\n\r\n\r\nNikolas Hulewsky (37:04.126)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (37:10.802)\r\nWell, I was gonna say social media. The reason I like those businesses, the cleaning businesses, pressure washing, for example, is because there's a stark before and after. in trying to acquire customers, you can go through the paid channels or you can try to grow organically through social media. And not all companies have good social media content, but companies like pressure washing, stump grinding, window washing, gutter cleaning.\r\n\r\n\r\nliterally the job, you just capture it and post it. It's good content for you to be able to create. like it fulfills two different functions. So I like those kind of businesses that is almost like two birds with one stone.\r\n\r\n\r\nAnne McGinty (37:54.931)\r\nWell, and what I like is that it's so easy to train. It's a pretty, you know, low skill, but also like high profit. It's like you're saying high margin type businesses. think, I don't know what the going rate is for like a single window pane inside and out right now, but it's probably like, I don't know. What do you think it is? Like $40 a window?\r\n\r\n\r\nNikolas Hulewsky (37:58.302)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (38:16.916)\r\nI have no idea. Yeah.\r\n\r\n\r\nAnne McGinty (38:18.757)\r\nAnd you gotta think about some, and I'm talking about a standard size window inside and out. So not like one of the giant ones. Once you start going to giant windows, it just adds up. If you're doing a mansion, that could be a $20,000 job just to clean somebody's windows.\r\n\r\n\r\nNikolas Hulewsky (38:35.314)\r\nasking Chachi Patel right now.\r\n\r\n\r\nAnne McGinty (38:39.197)\r\nChatGPD, make sure you use 4.0. ChatGPD 5 is struggling.\r\n\r\n\r\nNikolas Hulewsky (38:42.866)\r\nYeah, I know. Well, I was just doing a deep dive on this to two businesses that I thought were really cool. Pressure washing and then garage, garage epoxy businesses. So pressure pressure, pressure washing, you buy a rig and this isn't ultra high net worth targeting, but it's just pressure washing. You buy a rig, you just buy yourself. You need a truck to transport the rig, a way to get customers, but you can buy yourself as a solo entrepreneur to be doing 10 grand a month. I'm not going to say easily, but there's a, there's a like,\r\n\r\n\r\nAnne McGinty (38:50.258)\r\nYeah.\r\n\r\n\r\nSo yeah.\r\n\r\n\r\nNikolas Hulewsky (39:12.436)\r\npath to that that's pretty replicable. Epoxy floors and garages, you can be charging two to 4000, just depending on how big the garage is a pop, and you can do one of those a day with with a small crew, you could have a million dollar garage epoxy business fairly easily with high margins. And you know, you're in one spot, you don't have to be running a bunch of different crews. So I do think this home services space in particular, there's just\r\n\r\n\r\nsome variety of different businesses that you can start. You're just deciding to niche down even farther.\r\n\r\n\r\nAnne McGinty (39:45.395)\r\nWell, so the only reason I don't like the epoxy garage business as much is that it's not repeat. So another big part of how I choose businesses is that they're repeat. I'm not gonna start a painting business because you're gonna have to wait seven to 10 years before you get that client again. And customer acquisition is one of the hardest things. So if you can just get a customer, keep a customer and then grow your services with that customer, then you're becoming more and more efficient. See, I like efficiency.\r\n\r\n\r\nNikolas Hulewsky (40:11.892)\r\nThat's a cool lens. Yeah, yeah, yeah, no, that's a cool lens. is the, what's the recurring or reoccurring revenue with this customer? Cause Christmas lights is not recurring revenue, but it is reoccurring revenue.\r\n\r\n\r\nAnne McGinty (40:17.394)\r\nYeah.\r\n\r\n\r\nAnne McGinty (40:24.103)\r\nI don't think I know the difference between those definitions.\r\n\r\n\r\nNikolas Hulewsky (40:26.336)\r\nin my mind, the way that I understand it, recurring revenue is like every single month they're paying me this set fee. Recurring revenue would be, I know that I'm going to do this job for them again at certain time points. So, you know, it's going to happen again, but it's not necessarily locked into a contract that you have MRR.\r\n\r\n\r\nAnne McGinty (40:31.61)\r\nOkay.\r\n\r\n\r\nAnne McGinty (40:46.193)\r\nI didn't realize they were two different words like that. I just, I've always said recurring.\r\n\r\n\r\nNikolas Hulewsky (40:50.566)\r\nYeah. mean, so like recurring revenue businesses, SaaS businesses with, really easily measurable MRR typically valued a lot higher than reoccurring. Yeah. Businesses like the difference in the difference in valuing a home alarms company and a Christmas lighting company, right? Like one's going to go for much higher multiples than, the other. it's because it's, it's a, it's much stickier and it's monthly. Yeah. Yeah, exactly. chat. GPT says,\r\n\r\n\r\nAnne McGinty (40:56.518)\r\nYeah.\r\n\r\n\r\nReoccurring. Mm-hmm. yeah.\r\n\r\n\r\nAnne McGinty (41:07.485)\r\nMm-hmm. Yes.\r\n\r\n\r\nIt's a monthly, it's set, it's like a subscription.\r\n\r\n\r\nNikolas Hulewsky (41:20.5)\r\nReally helpful here, between eight and $40 per window. So that's very helpful.\r\n\r\n\r\nAnne McGinty (41:25.083)\r\nAnd see, I'm in the Bay Area, so I'm going on the high end. Eight? I've never heard anybody paying eight. Like 20 years ago, I think it was $20. And...\r\n\r\n\r\nNikolas Hulewsky (41:29.396)\r\nI don't know, that's a good question. I don't, maybe the window's like this big. They're like, like eight.\r\n\r\n\r\nAnne McGinty (41:41.134)\r\nNo, my husband before, when he was in his early 20s, he worked with a window washer and I think back then they were charging 22. So that was long time ago.\r\n\r\n\r\nNikolas Hulewsky (41:50.548)\r\nThat was one of my first jobs as an adult was a window washer. Yeah, I got fired very quickly. I was not good at it. It's not good. Okay. Here's my second business. And we'll probably just have to do two because we talked too much. Second business going in the same vein. I'm gonna describe this business for you first. And then I want you to guess what it is. Okay. This business is growing in the United States at.\r\n\r\n\r\nAnne McGinty (41:52.625)\r\nWas window washing? You too.\r\n\r\n\r\nAnne McGinty (42:02.535)\r\nOkay, what's your second business?\r\n\r\n\r\nNikolas Hulewsky (42:20.02)\r\nover 15 % a year and annual annualized growth rate. It's going to do about $50 billion is going to grow. It's doing $18 billion in 2023. It's going to do $50 billion by 2030. And the average revenue per location is approximately $1.5 million.\r\n\r\n\r\nAnne McGinty (42:41.531)\r\nWhoa!\r\n\r\n\r\nAnne McGinty (42:45.509)\r\nNot a clue. that is on my list. You stole my.\r\n\r\n\r\nNikolas Hulewsky (42:45.556)\r\nIt's a med spa, med spa. Sorry. I freaking, yeah. I mean, so you're looking at things like for men, testosterone replacement therapy, other hormone replacement therapies. For women, there's this thing that I'm just now learning about, don't ask me how, called perimenopause, which is like the period before you reach menopause.\r\n\r\n\r\nAnne McGinty (42:53.519)\r\nYes, longevity, wealth and health and wellness. Yes.\r\n\r\n\r\nAnne McGinty (43:06.504)\r\nYes.\r\n\r\n\r\nAnne McGinty (43:12.463)\r\nyeah?\r\n\r\n\r\nNikolas Hulewsky (43:15.986)\r\nthat has been under invested, understudied. Like people are not, they haven't necessarily been treating this, but they are starting to treat it now with hormone replacement therapy for women. Yep. In particular. and then there's other things like obviously Botox fillers, other injections as well. To me, that would be the kind of combination here is taking advantage of that macro trend is we're getting older. We're not just vain, but we want to be healthier too. And so we'd like these things like\r\n\r\n\r\nAnne McGinty (43:43.251)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (43:45.428)\r\nknow, platelet replacement therapies, testosterone therapies, hormone replacement therapies. And I just think that that's a macro tailwind that you could step into. I've never met a med spa owner who wasn't crushing it or like complaining because they were too busy. I just, they just seemed to always be busy.\r\n\r\n\r\nAnne McGinty (43:58.962)\r\nWhat?\r\n\r\n\r\nThe episode that just dropped on my podcast today is with a hormone replacement therapy specialist. she's, yeah, she started a business called Interbalance. It's BHRT, so bioidentical hormone replacement therapy, and it's available in soon to be 50 states. But currently the problem is that this is, it's considered a luxury item. So it is not readily available. It's not covered by insurance. So you do have to...\r\n\r\n\r\nNikolas Hulewsky (44:08.467)\r\nIs it really?\r\n\r\n\r\nNikolas Hulewsky (44:26.228)\r\nIt's not covered by insurance.\r\n\r\n\r\nAnne McGinty (44:32.307)\r\nand med spas are also costly to build. So.\r\n\r\n\r\nNikolas Hulewsky (44:35.38)\r\nThey can be, they can be, but there's some other things that you can do that aren't as costly. I just talked to a business yesterday. They do all the consulting for MedsBoz and they also offer the medical director for MedsBoz. So if you're doing anything medical, it has to have a physician signing off on us. So you have to have a medical, medical oversight. This company is doing 7 million, like this is like the third year operating $7 million top line, $2.5 million bottom line.\r\n\r\n\r\nAnne McGinty (44:47.429)\r\nokay.\r\n\r\n\r\nNikolas Hulewsky (44:59.886)\r\nAnd they're able to service people all over the country because their physicians are board certified in all the states that they operate in. But yeah, no, no. As a physician, you can be licensed in multiple states. And so me, Nick, if I'm licensed in five states, I could do oversight for all of those med spas in those different states. Yes, you got to take the boards. Yeah, some...\r\n\r\n\r\nAnne McGinty (45:06.542)\r\nbecause they have one for every state?\r\n\r\n\r\nAnne McGinty (45:22.931)\r\nDo you have to take the board exam in every single state? Okay, every single state?\r\n\r\n\r\nNikolas Hulewsky (45:29.628)\r\nWell, some states have reciprocity. So it's like if I'm licensed in this state, I'll have a reciprocal license in another state. Some states will say, well, if you're only doing this scope, you don't have to get another license. But most states, you have to take the board. have to become board certified in that state in order to operate. So I just love that business now because it's like I could do it where I don't have to have a physical location. I could be offering.\r\n\r\n\r\nAnne McGinty (45:35.847)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (45:58.174)\r\nkind of a lot of support services to people, either with a physician oversight or just helping them start up or helping them understand which services to offer. I love that space. Another thing in that that I've loved recently is have you heard of these clinics? Man, I'm debating whether or not, I'm just gonna say it. So my wife and I are gonna go this year, you pay between 10 and $20,000 depending on the plan, and they just do a full workup. They do a blood panel, they look at your hormones.\r\n\r\n\r\nThey do a stress test on your heart. They do an MRI, everything. And then based on that, you meet with a bunch of different specialists and they give you recommendations first on, hey, we noticed that these are your genetics. You should be careful. Don't eat any more wheat because you actually have gluten. You didn't know about it. Or, you had this much plaque buildup in your arteries. Be careful about X, Y, Z. But it's concierge. And now you have a baseline. so anytime that you have an issue and you get labs drawn, you can sort of mark it against the baseline.\r\n\r\n\r\nAnne McGinty (46:49.565)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (46:56.038)\r\nI think services like that where you just go to one place, you pay some money, and again, it is ultra high net worth, but it's hands off, it's white glove and these nurses take your blood and they walk you through these things and it's sort of adjacent to a med spa. I think those are amazing businesses, just incredible businesses.\r\n\r\n\r\nAnne McGinty (47:12.177)\r\nYeah. I wouldn't have the first clue how to get through all of the licensing for something like that. You need like a radiologist and you need flambotomist and you need, I mean, you would need a whole...\r\n\r\n\r\nNikolas Hulewsky (47:26.13)\r\nYeah, what I would do is I would find, I would partner with a physician because like you can't own a medical practice anyways without partnering with a physician. So I would just find a physician who's entrepreneurial and in that space. And it's like, you'd be utilizing their license for the most part. Yes, there are some other business things that you'd have to get, but I would just piggyback off of what they're already doing and think about how do I go and market to the customers? Because if I bring the demand, I know I have a physician and a team who can fulfill it.\r\n\r\n\r\nAnne McGinty (47:34.375)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (47:55.188)\r\nAnd it's not that much research. Sure, need a bottomless to take the blood. You need a nurse to help with the stress test. Obviously, you need an MRI machine that could be expensive, but I'm sure you can rent those. You also need different specialists. So do a little bit of research and see what specialist you're supposed to have, a dietician probably. But I just think that those are amazing businesses because, like you said, wealthy people want to do that.\r\n\r\n\r\nAnne McGinty (48:15.303)\r\nThe body is, yeah, so that's interesting to me that you're doing the body scan. I was curious about that. Have you heard of Function Health? Yeah, so we did Function Health recently. that's, it's just a, Function Health is anywhere. It's online, it's an app.\r\n\r\n\r\nNikolas Hulewsky (48:25.864)\r\nWhere is that?\r\n\r\n\r\nNikolas Hulewsky (48:30.342)\r\nSo yeah, what this is called is functional medicine because, so typically what happens now is I go to a primary care physician and I'm like, hey, doc, I'm not feeling so great. And he's gonna ask some questions and prescribe something based on my symptoms. But he's not talking to my cardiologist, to my dietician, to whatever other specialists that I have, right? It's very siloed and so it's not.\r\n\r\n\r\nAnne McGinty (48:35.003)\r\nYeah, that's... yeah.\r\n\r\n\r\nAnne McGinty (48:56.071)\r\nYeah. Yo, yeah.\r\n\r\n\r\nNikolas Hulewsky (48:58.814)\r\nfor lack of a better word, holistic. Functional medicine is really looking at the whole picture and that's why it's becoming, yeah, because these things are so interconnected.\r\n\r\n\r\nAnne McGinty (49:02.535)\r\nYeah, exploding right now. So yeah, well, and this is a whole nother conversation, but I don't know if you knew. So I had two autoimmune conditions that I went to probably 12 endocrinologists for over the last 13 or so years, maybe 14 now. And for all of that time, well, it's okay because for all of that time, I told them that I thought I could cure it and they...\r\n\r\n\r\nNikolas Hulewsky (49:14.611)\r\nNo.\r\n\r\n\r\nNikolas Hulewsky (49:22.152)\r\ngoodness, I'm sorry.\r\n\r\n\r\nAnne McGinty (49:29.617)\r\nwould say it's impossible. Autoimmune conditions are not curable. And I was like, well, I don't believe you. think that they are. So three years ago, I went down my own rabbit hole and checked out all the books from the library and started seeing integrative physicians, acupuncturists, functional medicine doctors, whoever I could see. And then I just did my own research. I've cured myself. My blood tests are now completely normal. All of it.\r\n\r\n\r\nNikolas Hulewsky (49:51.037)\r\nNo way.\r\n\r\n\r\nAnne McGinty (49:53.349)\r\nAll of it is in the normal range, except for actually, not all of it. All of it for my thyroid related disease is in the normal range. I did find on the function health test that, you know, there are other things I need to look at like cholesterol, but beyond that, yeah, no, I have cured myself and I know there are like hundreds of thousands of people around the world who have also cured their own diseases that the conventional medical world says is not possible. So you do need to like,\r\n\r\n\r\nNikolas Hulewsky (50:21.586)\r\nThat's what, that's.\r\n\r\n\r\nAnne McGinty (50:23.197)\r\nPrimary care is like, sorry, I come from a family of doctors. I'm like, primary care physicians is just like, that's like basic sort of knowledge. Sorry for anybody that's listening out, that doesn't agree. But the specialists even, if they haven't seen it in a double blind study, then they're not gonna prescribe it or follow it. I literally was told diet will do nothing, it'll revert back. Lifestyle will do nothing. It might work for three months and then it'll revert back. And they just don't know.\r\n\r\n\r\nAnd so when they don't know, they just tell you what they do know as fact.\r\n\r\n\r\nNikolas Hulewsky (50:57.748)\r\nWell, primary care physicians are amazing. All doctors are smart. They're in it for the right reasons, for the most part. I'm sure there's outliers, but they're like a mechanic, right? You bring your car in and it's like, something's wrong. And the mechanic goes and they're like, I think it might be this, but this isn't Audi. I don't work on Audis. I need to bring in a specialist, right? So it's not like they know everything about everything. And that's why the functional approach where you're looking at everything holistically has become\r\n\r\n\r\nAnne McGinty (51:09.235)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (51:27.398)\r\nmuch more popular because we're not doing that and we should be doing that.\r\n\r\n\r\nAnne McGinty (51:29.041)\r\nYeah.\r\n\r\n\r\nWe should be doing that. I think that's the future of healthcare. And as AI starts to grow, feel like healthcare, education, those two I think are gonna be the biggest ones that we see.\r\n\r\n\r\nNikolas Hulewsky (51:34.91)\r\nTotally agree.\r\n\r\n\r\nNikolas Hulewsky (51:42.228)\r\nAnd back to macro trends, people with disposable income, higher net worth, they're willing to spend and they are spending more on these types of things. They're worried about where their food comes from. They're worried about what they're putting into their body and what's around them. They're worried about microplastics and what bottles they're drinking out of. So they're willing to spend more on these things. And I think that's, to me, that's just another macro trend that you're like, ooh, I could do something in this space to take advantage of it. And the med spa, the wellness space, it still feels like we're very early in it.\r\n\r\n\r\nAnne McGinty (51:50.811)\r\nyeah.\r\n\r\n\r\nNikolas Hulewsky (52:12.052)\r\nAnd I just love that.\r\n\r\n\r\nAnne McGinty (52:12.657)\r\nIt, I agree. talked to my business broker the other day and he said the exact same thing. He was like, don't steal my idea, but Med Spa, longevity space in 10 years time is gonna be, I forget what quote he said, 10 times bigger than a five times bigger. I don't know. He just said, that's what he's seeing as well. But then you don't wanna be a part of the fad too. So yeah.\r\n\r\n\r\nNikolas Hulewsky (52:30.099)\r\nWell...\r\n\r\n\r\nNikolas Hulewsky (52:34.068)\r\nI don't think it's not a fad. It's not a fad. This is the way I look at it, right? Like we said mobile IV hydration. So getting hydrated is just really important. And there are now places where you can go to and it's nice. You got a comfortable chair and I can just get hydrated and I'm feeling kind of sick. Hit me with some vitamin C or you know what, my whatever, energy levels are low. Hit me with X, Y, and Z. So they've already got these like\r\n\r\n\r\nAnne McGinty (52:56.627)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (53:02.514)\r\ndistribution channels for med spas and these mobile hydration clinics, et cetera. And then at the same time, they're working on things that have even faster click because of CRISPR and the technology that they've developed for gene editing that I think in the next few years, we're going to see rapid improvements and innovation in longevity, in treating diseases and treating diseases and helping our cells kind of reverse aging, but they need a distribution channel in order to get that to the masses.\r\n\r\n\r\nAnne McGinty (53:30.355)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (53:30.376)\r\nWhat are they gonna piggyback off of? They're not gonna piggyback off of my primary care physician. They're gonna piggyback first off of those med spas and those locations that kinda seemed a little woo woo at first. Fringe it, yep, exactly. That's where they're gonna push through. So to me, it's not a fad. This stuff is happening and it needs a distribution channel. I think that that's gonna be part of the distribution channel, which is why I like getting into the med spa space right now.\r\n\r\n\r\nAnne McGinty (53:40.691)\r\nFringy, they're the ones that are exploring, yeah.\r\n\r\n\r\nAnne McGinty (53:55.539)\r\nYeah, no, I 100,000 % agree with you, but it might also be because where I am in my headspace and where my husband is and most of the people we know who are in their early mid 40s are all looking at this right now for their own personal use, their personal reasons. And so we're seeing the trend happen in real life. Like, I don't know if people in their 20s would necessarily have the resources or ability to take advantage of something like that, but how?\r\n\r\n\r\nHow old are you? You can take this out, but how old are you?\r\n\r\n\r\nNikolas Hulewsky (54:26.119)\r\nI will be 40 in October.\r\n\r\n\r\nAnne McGinty (54:28.113)\r\nYeah, see, okay, so we're similar in age. this is, and my business broker is, he's not too far off, he's around the same age. But I think this is sort of where we are in our lives too. It's like this midlife area where we're like, gosh, okay, how are we going to age well and live as long as we possibly can? But yeah, there's a lot. I saw the other day.\r\n\r\n\r\nNikolas Hulewsky (54:30.364)\r\nimage. Yeah.\r\n\r\n\r\nNikolas Hulewsky (54:42.813)\r\nI\r\n\r\n\r\nNikolas Hulewsky (54:51.252)\r\nBut it's not.\r\n\r\n\r\nAnne McGinty (54:53.659)\r\nWell, there's just a lot of science that's coming out right now. I neuroscience, quantum physics stuff. There's also a food allergy institute. I don't know if you heard about it down in LA, but they can completely eradicate food allergies for people with severe allergies if they're between the ages of 18 months and 25 years old. Like kids who were going into anaphylactic shock with a peanut are now eating 58 peanuts a day and they're fine because they're doing something by...\r\n\r\n\r\nNikolas Hulewsky (55:02.196)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (55:17.22)\r\nmy gosh.\r\n\r\n\r\nAnne McGinty (55:22.031)\r\ngiving small doses of like a molecular, it's not identical, but it's closely identical. It's closely similar to like the structure of the peanut. And then they're gradually just increasing it and it's at it's administered at home through gummies. And it takes somewhere around two and a half to four, four years.\r\n\r\n\r\nNikolas Hulewsky (55:38.418)\r\nWow.\r\n\r\n\r\nMy gummies usually don't have that in them. My gummies are usually like sour worms. It's not eradicating things. It's probably causing more problems than I should be. But that's what I love about entrepreneurship is that they're gonna develop these things and then in order for them to get distributed, they're gonna need entrepreneurs to do that. For example, Ozempic. We've all heard of Ozempic. Their stock has...\r\n\r\n\r\nAnne McGinty (55:54.524)\r\nYou\r\n\r\n\r\nAnne McGinty (56:05.149)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (56:10.1)\r\nactually kind of taken a massive hit because I can't remember who their owner is, Nordic. I don't know. Anyways, no, all these generic GLP ones. So these generic GLP ones have come out and then entrepreneurs were like, we could actually spin this up and have some virtual telehealth prescribe this to people and make some money. And so like all these small virtual providers have popped up and are writing the prescriptions.\r\n\r\n\r\nAnne McGinty (56:12.925)\r\ncompetition.\r\n\r\n\r\nNikolas Hulewsky (56:39.028)\r\nThey're not going to Ozempic, they're going to these sort of generic GLP ones. But in doing that, it's gotten to a lot more people a lot quicker than it would have if it was just kind of held with Ozempic. So I think the same thing's gonna happen. There's gonna be entrepreneurs who see, oh, this is a cool development. How can I jump on this to make some money? And the money incentive is not a bad incentive because that money incentive is actually gonna drive people to have greater access. anyways, I get excited about the next 10 years.\r\n\r\n\r\nAnne McGinty (57:03.965)\r\nThat's true. No, that's true. I think I read something the other day too about a study that was recently done showing that Ozempic can, you can get the same effect as Ozempic with a healthy gut flora, gut microbiome.\r\n\r\n\r\nNikolas Hulewsky (57:18.883)\r\nreally?\r\n\r\n\r\nAnne McGinty (57:19.793)\r\nI think so. Yeah, I'll forward it to you. It was a scientific study that was pretty much saying that like, people can get this from their own bodies. They can achieve the same result, but they don't want to. The population is sort of, that's the thing. The population is stubborn and, or maybe they lack the time and the resources too, but.\r\n\r\n\r\nNikolas Hulewsky (57:30.182)\r\nYeah, it's probably a lot harder.\r\n\r\n\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (57:40.092)\r\nIt's probably not as easy, know, as EMPICS just like, cool, I take this once a day, whatever. And whereas what you're talking about is probably like, you'd have to have this diet and then you'd have to eat at these hours and you'd have to make sure that the biome is at these levels and people are like, too hard, give me the pill, I want the pill.\r\n\r\n\r\nAnne McGinty (57:45.628)\r\nI know it, yeah.\r\n\r\n\r\nAnne McGinty (57:56.435)\r\nTotally. Yeah.\r\n\r\n\r\nNikolas Hulewsky (58:02.548)\r\nYeah, that's how it is. I'm glad that we both had meds pause though.\r\n\r\n\r\nAnne McGinty (58:07.825)\r\nI know med spas and well, I haven't been to a med spa, but I have been very curious about just aging well. You know, I have my collagen, I'm taking my ashwagandha or the it's adrenal health. So it's got like all the things in it, holy basil and ashwagandha. And that helps keep my cortisol levels at a sustained level. So I don't spike and I go for like a walk every day pretty much for four miles. Like just because that\r\n\r\n\r\nNikolas Hulewsky (58:29.446)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nAnne McGinty (58:37.391)\r\nis like the best kind of exercise you can get is if you're...\r\n\r\n\r\nNikolas Hulewsky (58:39.08)\r\nAre you wearing a lab coat right now? Are you a doctor? Like what is happening? I've got Mahatma Gandhi that I take in the morning and then I take my, I do my, I manage my O2 levels. What the freak? Jeez dude. So good.\r\n\r\n\r\nAnne McGinty (58:46.963)\r\nSauna, I do my sauna a couple days a week. No, I'm in Northern California.\r\n\r\n\r\nAnne McGinty (58:55.971)\r\nI feel like out here, that's just how it is. Everybody's sort of, they're doing the ice baths and the cold plunges and the, there's so much information now on how to stay healthy. It's just, you have to do it. No, it's great. It feels good.\r\n\r\n\r\nNikolas Hulewsky (59:08.004)\r\nfeels like too much. Too much information.\r\n\r\n\r\nNikolas Hulewsky (59:14.932)\r\nWell, okay, this has been awesome. We only got to two of the three, but I think that they were really good ideas for us to talk about. People can come find you on how I built my first small business. Did I say it right? Dang it. How I built my, Anne McGinty, one of my favorite people, how I built my small business, go and find her. She's crushing it. In the podcast world, go and find her for this short period of time, because she's probably going to stop. And I don't want you to miss out on her wisdom.\r\n\r\n\r\nAnne McGinty (59:25.959)\r\nor how I built my small business, how I built my small business. Or they can just go to my website. Yeah.\r\n\r\n\r\nNikolas Hulewsky (59:43.655)\r\nBut this has been awesome. I appreciate you.\r\n\r\n\r\nAnne McGinty (59:45.863)\r\nWell, I think I look forward to interviewing you in a couple of weeks.\r\n\r\n\r\nNikolas Hulewsky (59:48.948)\r\nLet's do it. It's on the books. We'll talk soon. All right, stay at.\r\n\r\n\r\nAnne McGinty (59:51.975)\r\nI wanna know what your third business is.",
  "metadata": {
    "duration": "",
    "date": "2025-08-25",
    "platform_source": "Google Drive"
  }
}