{
  "episode_number": "105",
  "episode_title": "TOP PICK! How to Build a 50k Local Newsletter in 6 Months Using AI with Jas Singh",
  "guest_name": "Jas Singh",
  "business_name": "Local Newsletter",
  "transcript": "﻿Nik (00:01.038)\r\nAll right, Jazz, welcome back to Niconomics. You're my first returning guest.\r\n\r\n\r\nJas (00:06.503)\r\nYeah, I I came about six months ago, so I mean it's a full circle moment.\r\n\r\n\r\nNik (00:09.132)\r\nYeah. It's a circle of life. I'm super excited. So you posted something the other day about your newsletter and I'm it just piqued my interest. I wanted to hear how things were going. So invited you to come back on. Why don't you give the people a brief background? What have you been doing the last six months?\r\n\r\n\r\nJas (00:29.591)\r\nYeah, so I mean, previously I made a lot of content on Twitter, but then for the past six months, I haven't posted much and decided to run away with this like local newsletter thing. And in the last six months, we now have a total audience of about 50,000 people here locally in Winnipeg. Yeah, five zero. So it's grown a good amount. then, yeah, so\r\n\r\n\r\nNik (00:48.088)\r\nFive zero.\r\n\r\n\r\nJas (00:56.631)\r\n35,000 is about on Instagram and then we have an email list of about almost 16,000 people now.\r\n\r\n\r\nNik (01:04.142)\r\nCongratulations, man.\r\n\r\n\r\nJas (01:06.175)\r\nYeah, no, thank you. mean, it's honestly like the community feedback has been great from the city as well.\r\n\r\n\r\nNik (01:12.44)\r\nWhat made you decide to go into a local newsletter? Why not just do a traditional newsletter?\r\n\r\n\r\nJas (01:18.411)\r\nYeah, so I mean, I previously a little background would be that I actually grew a Twitter account to about 35,000 followers in four months, but in the AI niche. So I did that last year. And from there, I had built like an AI newsletter and like sold it for a few thousand dollars. And then I had seen this guy, his name is Ryan Snell, I'm not sure if the viewers know, but he kind of like popularized the idea of local newsletters. So.\r\n\r\n\r\nI'd watched a bunch of his podcasts and dabbled with the idea for about a year now. And I was like, you know what, like Winnipeg as a city is very much like, it's a large population, but it's not a tech savvy city by any means. So I always saw like bigger cities like Toronto and Vancouver have these kind of places that you could go to for all the events that are happening in the city and that sort of thing. But Winnipeg never had one. So I was like, you know what, we have a million people here.\r\n\r\n\r\nI think there's a great opportunity for me to kind come in and own that space. Ryan grew his kind of news that it took 20,000 in a 50,000 people city. And I was like, with my million people, I'm sure I can at least get to 100,000 people, right? And so that's kind of where the journey started in April and now here we are.\r\n\r\n\r\nNik (02:35.768)\r\nDude, well, I'll level set for some people. So newsletters have become more and more and more popular. But the reason that they're popular is because people who have an audience on let's say Instagram, YouTube, Twitter, Facebook, they are at the mercy of the algorithm. So if YouTube decides to change how they're recommending your videos or if Twitter decides to change how they're recommending your content or extrapolate that to any other platform, then all of a sudden your reach is limited.\r\n\r\n\r\nYou may have worked over years to acquire, like you said, 35,000 subscribers or followers on Twitter with the AI newsletter. But then all of a sudden overnight, if they change the algorithm, you don't have access to them, right? You may post something, but how do they see what's new? And so all that value that you've sort of accrued to yourself is gone. But with an email newsletter, because you have their emails, you can take them off platform and you own the relationship. You're not dependent on this middleman third party algorithm to dictate the relationship. You own the relationship.\r\n\r\n\r\nwith your customers. And what I've seen is they're kind of broadly two types of newsletters. There are local newsletters that you're talking about. And I had Ryan on my podcast. was a freaking awesome conversation. So there's local newsletters. And then there's like general newsletters for a specific niche. But local newsletters are becoming more and more and more popular because people are looking for things to do in their local markets. So did I do good job of like explaining the newsletter?\r\n\r\n\r\nJas (04:01.707)\r\nYeah, I mean, I would say it's kind of like the modern day, essentially, newspaper, right? Like no one is wanting to pay for these newspapers. And it's very much like, you know, an old jargon that they speak in a sense, like very much traditional English, whereas like local newsletters, you kind of want to position them as like a community-led initiative almost.\r\n\r\n\r\nwhere the community is a part of your growth, you're involving them in the decisions you're making and that sort of thing, where they feel like they're part of it as the newsletter is growing itself.\r\n\r\n\r\nNik (04:37.346)\r\nSo what is your newsletter about in Winnipeg?\r\n\r\n\r\nJas (04:40.265)\r\nYeah, I mean, we kind of cover a pretty broad spectrum of things. So we cover like, we cover everything that's away from crime and politics. So any like community initiative. Exactly. Any community initiatives, any news related to like, let's say students and the city itself, any development happening in the city businesses, and then the kind of the biggest\r\n\r\n\r\nNik (04:51.66)\r\nNothing controversial.\r\n\r\n\r\nJas (05:08.801)\r\npart of our newsletter is the events section where we cover like 30 to 50 different events and then like tickets to their, like direct links to their tickets essentially.\r\n\r\n\r\nNik (05:18.988)\r\nThat's really interesting. See, like you're very similar to Ryan's newsletter. So Ryan has a newsletter in Annapolis, Maryland, 40,000 people, 20,000 subscribers, and you have a very similar sort of, do you do the weather like he does too?\r\n\r\n\r\nJas (05:32.273)\r\nI don't do the weather, no, not as relevant here.\r\n\r\n\r\nNik (05:33.61)\r\nOkay. It's either cold or freezing cold where you are right? It's like\r\n\r\n\r\nJas (05:39.293)\r\nExactly, it's kind of like the... like the Arctic here.\r\n\r\n\r\nNik (05:43.182)\r\nOkay. so what I want to do, I think, I think your newsletter is awesome. And you've, you know, gained 35,000 or 15, 16,000 subscribers in the last six months. I, my goal is for whoever's listening to walk away from this conversation, a hyped, motivated to do it in their local market and B feel like they have the tools necessary to actually do it. So I want to go through and ask you a bunch of questions. Is that cool? If we kind of just like go through the process.\r\n\r\n\r\nJas (06:13.055)\r\nYeah, for sure. Let's dive into it.\r\n\r\n\r\nNik (06:14.806)\r\nOkay. So how did you pick your newsletter? In my mind, there's three kind of broad things you can pick to do a newsletter on. You can do it geographically. So whether you're in a big city or a small city like New York City, okay, I'm going to cover the Bronx or I'm going to cover Hell's Kitchen. So you can do it geographically. You can do it by topic. Okay. We're a pizza review newsletter or we are a sports newsletter or some amalgamation of those things.\r\n\r\n\r\nOr can do it by demographic. All right, or a newsletter for millennial dads. Or a newsletter for senior citizens. In my mind, those are the three kind of categories that you could pick from in order to niche down on one of these local newsletters. Is there anything I missed?\r\n\r\n\r\nJas (06:59.753)\r\nNo, would say generally that definitely is the is like the three different paths that you can take. Now, there can be a combination of some like New York is too big. So you can say restaurants in New York, you can say events in New York. So you can definitely like combine some of these as well. It just depends on like, you don't want the audience to be too big in the sense that you don't know who you're able to target or not target.\r\n\r\n\r\nNik (07:26.764)\r\nWhat is too big? I think that's the first question I'd want to ask is like, how do I define my parameters for the local newsletter? What's too big?\r\n\r\n\r\nJas (07:34.667)\r\nI think for a local newsletter anything over like 900k to a million would be a little too large because at that point events start to get way too broad right like I'm covering something in the west end of the city and if it takes someone an hour and a half to get there most people are not going to go there so it's not as relevant to them for example\r\n\r\n\r\nNik (07:52.846)\r\nMight as well be a different state or county or province. Yeah.\r\n\r\n\r\nJas (07:55.991)\r\nExactly. Now here in Winnipeg, I know that generally anyone can go from one end of the city to the other in 30-ish minutes. So no matter which position I'm covering or what side of the city I'm covering, it's kind of relevant to everybody. So that's why it made sense for me to just cover all of Winnipeg and not like one particular side of\r\n\r\n\r\nNik (08:19.342)\r\nOkay, so the upper bound is kind of 900 is a million, let's call it. basically, anytime you're getting to the crossing the threshold of people that identify as a different geography, like that's too big. So I'm from Southern California, I would say San Fernando Valley is different than the San Gabriel Valley. And if anyone who's listening is like, okay, I know what that is. Orange County is different than Santa Monica, right?\r\n\r\n\r\nJas (08:23.978)\r\nYeah.\r\n\r\n\r\nNik (08:46.243)\r\nIf you identify as being from a certain place, that's probably the first place. How did you land on being just the geographic newsletter of like, okay, I'm going to do everything in Winnipeg. Why not pick one of those topics or demographics?\r\n\r\n\r\nJas (08:46.337)\r\nYeah.\r\n\r\n\r\nJas (09:01.643)\r\nWell, because in Winnipeg, I would say Winnipeg is not a tech savvy city at all. So there's nothing like this in Winnipeg at all. So rather than me covering one particular thing, was like, might as well target all of Winnipeg and kind of be the first to have the first mover advantage as well. And that would lead to the quickest growth as well because I would be able to target everybody here in Winnipeg rather than like a set group of people.\r\n\r\n\r\nNik (09:25.848)\r\nAll right, so you found your market, you found what you're doing. How did you decide on frequency?\r\n\r\n\r\nJas (09:33.079)\r\nstarted out actually as one time a week because it started for me started out as a side thing like I was doing a full nine to five essentially and I was like you know what I'm gonna start this as a side thing I don't want this to take too much effort started it once a week and then I just saw that there was too much information for me to cover in that one times a week newsletter\r\n\r\n\r\nNik (09:53.154)\r\nWere you were you writing then? Are you sorry? Were you writing the newsletter at that time? And are you still writing it?\r\n\r\n\r\nJas (09:59.571)\r\nYeah, yes to both. So I was writing about that and I'm still currently writing it at the moment. And then planning to soon hire someone for it.\r\n\r\n\r\nNik (10:08.078)\r\nCool. Are you daily at this point?\r\n\r\n\r\nJas (10:10.847)\r\nNo, we're at three times a week at the moment as well. So now we know that three times a week is a good balance where we can cover all the news in Winnipeg and the events without having to cut anything important out.\r\n\r\n\r\nNik (10:24.246)\r\nWhy? So tell me why three times a week works. When you say like, it's enough balance to cover, like what, what does that mean? Can you go a little deeper on that?\r\n\r\n\r\nJas (10:33.407)\r\nYeah, for sure. So in once a week, in once a week, there's too many events. So Beehive has, or any news that are platform that you're using, has a limit of amount of words and essentially space a newsletter can take, right? So you, it's like a word count almost when you're writing some sort of essay or a story. And for me, I've noticed that's about 2000 words, including some images in the email. So in 2000 words, I have to cover everything that's happening in Winnipeg.\r\n\r\n\r\nand still be short enough that someone doesn't get bored going through it. So that's why I this about three times a week.\r\n\r\n\r\nNik (11:06.418)\r\nokay.\r\n\r\n\r\nSo it sounds like you had to kind of decide on the content first, and that's now dictated your frequency. OK. What?\r\n\r\n\r\nJas (11:15.901)\r\nExactly, exactly. Yeah. So I, so I dictated essentially like what different things I want to target in the city and now that's dictated how many times I'm sending it out.\r\n\r\n\r\nNik (11:25.27)\r\nOkay, so tell me what things are covered in your newsletter. When you say events, what does that mean? Like what events?\r\n\r\n\r\nJas (11:31.477)\r\nYeah. Yeah, exactly. we cover. So we in the beginning, I basically went and manually just pulled every single news website, city website, province website. And I was like, OK, before I write this news letter, I'm going to go through all of these. So what it covers is city news, any city updates, any business news or new businesses coming into town. Right. Again, in the news aspect of things, it's anything that's away from politics and crime.\r\n\r\n\r\nNik (12:00.748)\r\nAnd is it, are these in sections? Are you like, have a new section, I have a community section, I have an event section, I have a food set, like they have sections? Okay.\r\n\r\n\r\nJas (12:01.043)\r\nAnything that... Go ahead.\r\n\r\n\r\nJas (12:09.781)\r\nYeah, exactly. it's essentially we have a news section. That's our top story underneath that top story is like a sponsored section underneath that sponsored section. We have like a specialty section. So for example, in Monday's newsletter, that's a restaurant of the week in Wednesday's newsletter. That's charity of the week. Friday's edition. It's live music, right? So it's a specialty section underneath that. Then comes all the community news. So, hey, this business is opening up or\r\n\r\n\r\nNik (12:28.398)\r\nMm.\r\n\r\n\r\nJas (12:38.485)\r\nThe Winnipeg Jets or hockey team won this game or lost this game, so on and so forth. And then underneath that, they get the very end is all the events. And that's actually very strategic because it forces anyone opening the email to have to scroll all the way down to get through all of our content to find the events. then the events are even split up by like categories, essentially.\r\n\r\n\r\nNik (13:03.566)\r\nAll right, so from the newsletter construction perspective, you have the top story and then you have like a, I don't know, rotating section where one's the charity and one's the, I can't remember all the other things. Then you have the community section and then you have the events. Okay, you told me this before, but how did you get the idea for this? Will you just tell me that really quickly?\r\n\r\n\r\nJas (13:22.035)\r\nExactly, exactly. Yeah.\r\n\r\n\r\nJas (13:30.781)\r\nYeah, I mean, I essentially was saw Ryan go on a bunch of podcasts and I was like, okay, there's nothing like this here in Winnipeg. So let me just spin it up here. And I actually just went through all 20 of his podcasts and I was like, okay, I'm going to jot down all the notes, see what crosses over and then just do it here in Winnipeg.\r\n\r\n\r\nNik (13:51.544)\r\nfreaking I freaking love that because it's free. It's out there. Cool. I'm gonna go listen to every single one of his interviews. I'm gonna put put those pieces together and then I'm gonna launch it because you saying the words I put the events at the end because those are the most sought after thing. That's exactly what Ryan said to me when I talked to him on my podcast. He's like, I put that at the end because that ensures that people will actually get to the end of the newsletter. So anyway, I yeah, that's a whole separate topic that I would love to talk about is just like the ability to\r\n\r\n\r\nJas (14:06.923)\r\nYeah.\r\n\r\n\r\nJas (14:12.374)\r\nYeah.\r\n\r\n\r\nNik (14:18.836)\r\nact quickly because there's so much information available to you on the internet. I'm curious about your content though. So you're, you're editing it. Like there's a lot of editorial discretion on what you're putting in and what you're not. However, you used to write an AI newsletter. Like it would seem to me that you would come in here and be like, cool, I can systematize X, Y, and Z. I'm going to go and scrape all of these websites. It's going to bring me the news stories. This is how they'll pick it and it'll just auto-generate. Why aren't you doing that?\r\n\r\n\r\nJas (14:32.054)\r\nMm-hmm.\r\n\r\n\r\nJas (14:35.872)\r\nYeah.\r\n\r\n\r\nJas (14:40.843)\r\nYeah.\r\n\r\n\r\nJas (14:49.333)\r\nbecause a big thing about a local newsletter is the fact that you're not talking like the news, right? So actually we do use AI. So I use ChatGPT to write a lot of the newsletter. It's just that when I'm using ChatGPT, again, because I come from a little bit of an AI background, have, I use specific prompts to at least make it seem like it's written by a local Winnipegger, right? So.\r\n\r\n\r\nthe way the English is written, it's a Canadian way rather than an American way. Then, for example, another thing is I say specific things in the newsletter that only a Winnipegger would know or specific events, which is why the curation of the events is so, it has to be manual at the moment simply because of the fact that there's specific events that ChatGPD won't even know about because it's specific to Winnipeg, right? It's not just\r\n\r\n\r\nthe large events we cover for example in our events section it's like I'll go to Facebook events and check every little event that's happening and then add that in my newsletter essentially.\r\n\r\n\r\nNik (15:56.046)\r\nSo when you say you use chat GPT prompts, are you gathering information via AI or is that all manual?\r\n\r\n\r\nJas (16:04.031)\r\nNo, the gathering is manual, but it only takes me about 20 minutes because I have like a little bookmark list.\r\n\r\n\r\nNik (16:09.998)\r\nAnd how did you decide who you're going to go pull manual information from?\r\n\r\n\r\nJas (16:15.019)\r\nYeah, so I mean, over time, the links have honestly just grown. So we, you know, we check all the new sites, we check all the university websites, and over time, links have just added on top of each other. So in the beginning, we weren't covering certain events. And then people actually made us aware that, this is happening, this is also happening. So over time, the links have just added. And anytime we find like a new website, we just add it in that list.\r\n\r\n\r\nNik (16:40.014)\r\nOkay, so if I was listening to this and I was gonna go to a new city and start this, how would you go and replicate this in another city knowing what you know now? Specifically the content, like I'm not talking about everything else, just the content piece.\r\n\r\n\r\nJas (16:49.387)\r\nYeah, I know. Yeah.\r\n\r\n\r\nYeah, from the content standpoint, I would simply go to the news websites that are happening in the city because you're not competing with news channels, right? Like in your, for example, our newsletter, we say as reported by CTV News, for example, right? Like we're not trying to take credit for things that we have not written. So I would go to all the news channels and news sites in the city. Then I would pull up the city website, the state website.\r\n\r\n\r\nAnd then I would see like, what's before I write the newsletter, hey, what's the newest thing that's happened since the last time I wrote essentially, right? Or in the last day or two, what are the things that have happened? I generally try to collect about seven different stories. Two for like our main header stories and then five for like the community section. Yeah, and then from there I would then go to the events and do the same thing.\r\n\r\n\r\nNik (17:28.856)\r\ninteresting.\r\n\r\n\r\nNik (17:46.382)\r\nAll right, so you laid out the sections, you laid out how you gather information. What do you use chat GPT for?\r\n\r\n\r\nJas (17:53.271)\r\nYes, I use ChatGPT for not plagiarizing essentially. Like I don't want to. I don't want because well, I got called out for once. Like it was a very similar thing that I had pulled from a news article and I wasn't aware of it in the beginning. And then as now time has gone, used ChatGPT to first write the article differently essentially. So the article that let's say a news channel is writing is 1500 words or something.\r\n\r\n\r\nI need to condense that down to 150 words because all the reader is getting is a snippet of what's happening in the news. They're not getting the full article from us. If they want to read it, go ahead. Yeah, exactly. And then we link to either the full article or the city announcement or whatever the case may be.\r\n\r\n\r\nNik (18:36.152)\r\nAre you then, are you linking to that article?\r\n\r\n\r\nNik (18:43.342)\r\nSo you're in many ways, you're a news aggregator. have you decided on that 150 words as like, that's kind of just the best way to do it through trial and error? Or is that a thing? Like, is that that does that exist?\r\n\r\n\r\nJas (18:55.447)\r\nthink coming back to the original point of the 2000 capacity of the whole email, we know that we have to also write the events section and so on and so forth. So I don't try to make the main news stories over 150 words. And then the snippets, so for example, in the community section, it's like small snippets of everything that's happening. That's like 100 to 125 words. Yeah.\r\n\r\n\r\nNik (19:18.99)\r\nOkay, love that. My next question is, how did you decide on Beehive?\r\n\r\n\r\nJas (19:25.441)\r\nHonestly, I had used it for my AI newsletter and not like shitting on any other like news platforms. Yeah.\r\n\r\n\r\nNik (19:36.876)\r\na convert kit or a Hujabi or yeah.\r\n\r\n\r\nJas (19:41.023)\r\nYeah, yeah, like not not shitting on any of those ones, but it's just that I've seen Behive execute at a very high level. Like they when you when you submit something to them, they'll fix it really quickly. Any bugs or anything of that nature. So whenever I've seen that happen, I'm like, OK, this is really the platform that I want to go with. Essentially, they all have very similar features. It just comes down to your preference. Right. Like I know a lot of people that have started with ConvertKit and then switched later on.\r\n\r\n\r\nIt's just that you don't want to go through the hassle of switching afterwards.\r\n\r\n\r\nNik (20:11.47)\r\nYeah. Okay. Now we're getting to the good stuff. You ready? you grew this within six months to 15, 16,000 subscribers. That's a lot. for those, for those who don't know Chris, my business partner, he launched a newsletter a year ago and he's grown 20,000 organic subscribers, but he's never paid a cent in advertising. How, how did you get to 16,000 in like less than six months?\r\n\r\n\r\nJas (20:34.997)\r\nYeah.\r\n\r\n\r\nJas (20:39.379)\r\nYeah, so I mean, honestly paid ads, like there's no other way around it. I think in the beginning, so something that we had done was we have a local subreddit here. So what I did was I just got the first 200 subs from the subreddit with like posting, let's say events and that sort of thing to test out the news that and what the feedback is from the community. Once we had brought, I'm sorry, go ahead.\r\n\r\n\r\nNik (21:00.012)\r\nLet me, so hold on, me double click on that. So you went to Reddit and you just said, hey, I have a newsletter for local events. What do you guys think? how did you, cause Reddit can be freaking ruthless when they think you're trying to sell something. So how did you actually test it?\r\n\r\n\r\nJas (21:13.405)\r\nYeah. Yeah. So what we did was we just put the events list the same that we were going to put in our email newsletter. We just put that same list on Reddit and at the end was like, hey, if you want this on a weekly basis, go subscribe here. That's it.\r\n\r\n\r\nNik (21:27.374)\r\nDid you get that from Ryan or was that you?\r\n\r\n\r\nJas (21:30.851)\r\nno, that was me. I don't know if Ryan did that.\r\n\r\n\r\nNik (21:31.874)\r\nThat's a good. That's a really, really good strategy. All right. So you, tested it, obviously it picked up some traction. And so you started going that way. What are the different acquisition channels that you could have?\r\n\r\n\r\nJas (21:44.181)\r\nYeah, I would say probably the four big ones you're going to find are referrals, paid ads is the biggest one for sure. And then you have kind of like organic and then SEO is kind of the fourth one that we're unlocking right now.\r\n\r\n\r\nNik (21:58.958)\r\nOkay, give me one second. What's up buddy? Whoa, where'd you get those sticks from? my gosh. Did you get them from outside?\r\n\r\n\r\nJas (22:20.299)\r\nSo cute.\r\n\r\n\r\nNik (22:21.55)\r\nSorry about that. tell me again, four acquisition channels.\r\n\r\n\r\nJas (22:28.533)\r\nYeah, so the biggest four I would say that you can target and probably in this order would be paid ads would be number one by far. Then you have referrals, then you have organic Instagram and so on and so forth. And then you have SEO.\r\n\r\n\r\nNik (22:43.63)\r\nOkay, so let's talk about paid ads really quick. You're talking about Google, Facebook, Twitter, or where are you doing paid ads?\r\n\r\n\r\nJas (22:50.803)\r\nOnly Facebook. So we don't do anything else. We just do Facebook ads. And then there's two ways to run that. You can either do straight to your landing page or you can just run a form in the Facebook ads, which is what we do at the moment. And then we use Zapier to automate it. The big difference is I think the platform credibility. You'll hear probably Alex or Mozi talk about this a little bit, when you're using a form for Facebook ads,\r\n\r\n\r\nNik (22:52.077)\r\nOnly face.\r\n\r\n\r\nNik (23:05.646)\r\nWhat's the difference?\r\n\r\n\r\nJas (23:18.401)\r\nYou're borrowing Facebook's credibility essentially. So the person can just put their email in there and then sign up to the email. Whereas when they're coming to your website, sometimes Facebook can also say like, hey, are you sure you want to go to this website? That's an extra step that the person has to go through. Yeah.\r\n\r\n\r\nNik (23:32.046)\r\nFriction. Okay, so when you're on Facebook ads, you're targeting specific people and they can fill out the form natively on Facebook is what you're saying.\r\n\r\n\r\nJas (23:43.251)\r\nExactly, exactly. And in terms of like the demographic and everything like that, I don't even worry about it. I just set it by the city. And then the only thing that really is going to make a difference for your Facebook ads in terms of cost for acquisition of a subscriber is going to be your creative. That's it.\r\n\r\n\r\nNik (24:00.504)\r\nHmm. Okay, so tell me what was your customer acquisition cost through paid ads?\r\n\r\n\r\nJas (24:05.801)\r\nYeah, so I mean in the last six months it's about been 82 cents Canadian dollars per subscriber that we get. Yeah\r\n\r\n\r\nNik (24:10.05)\r\nWow. What was it in the beginning?\r\n\r\n\r\nJas (24:14.507)\r\nIt was like 25 cents, 30 cents. And then over time now it's about a dollar 10 that we're getting it up.\r\n\r\n\r\nNik (24:19.884)\r\nWhy did it get more expensive?\r\n\r\n\r\nJas (24:22.495)\r\nWell, it's just as more and more people that have already been interested in the beginning sign up.\r\n\r\n\r\nNik (24:28.622)\r\nSo you got the you got the lower hanging fruit in the beginning and now it's it's harder and harder to convert people.\r\n\r\n\r\nJas (24:35.017)\r\nYeah, which is why I would never actually I don't plan on selling the newsletter is because it's almost impossible for competitors to come in and compete because any new competition coming into the space has to get their initial subscribers at a dollar 20 right or three dollars or something like that. So it makes it very hard for a new competitor to come in the city and do the same thing.\r\n\r\n\r\nNik (24:57.954)\r\nWhat did you think it was going to be when you started? Did you think it was going to be 25 cents or were you like, all right, I'm budgeting for $2?\r\n\r\n\r\nJas (25:04.183)\r\nYeah, my idea was $2. I thought I would get each sub at about $2. And the goal when we had started in April was to grow to about 8 10,000 subs by the end of the year.\r\n\r\n\r\nNik (25:15.792)\r\nWhat do these ads look like? Like you said the creative is important. Are you just being off the wall or is it like check out my newsletter and just like very straightforward? What like what is it?\r\n\r\n\r\nJas (25:25.247)\r\nYeah, so I mean, I use, so I actually went through probably seven, eight different local newsletters that run ads in other parts of the country. And I just copied all of them and saw which ones worked the best.\r\n\r\n\r\nNik (25:36.724)\r\nmy god, that's genius.\r\n\r\n\r\nJas (25:39.081)\r\nYeah, so we did that. So you can do that just by going to like Facebook Ads Library and putting in specific companies and you can see their Facebook Ads that they're running.\r\n\r\n\r\nNik (25:47.054)\r\nso you went around and you're like, okay, these are seven local newsletters around the country. I know the names. I'm going to go to Facebook's ad center, specifically look at their creative and then not mimic it, but take the best parts from it and make your creative pop.\r\n\r\n\r\nJas (26:04.211)\r\nYeah, I mean, not even mimic it, copy and paste it. know, like I didn't even, I'm not even gonna, like there's nothing to hide here. You know, it's like, it works, why not just use it? And so, and so we did that. And then over time, we have now figured out what works, what doesn't. And now we have our own creative that we've put in.\r\n\r\n\r\nNik (26:10.454)\r\nYeah, yeah,\r\n\r\n\r\ngenius man.\r\n\r\n\r\nNik (26:22.798)\r\nTell me about the subscribers that you acquire specifically through Facebook paid ads. Are they churning really quickly or like how long are they actually staying subscribed? What does that look like now?\r\n\r\n\r\nJas (26:34.263)\r\nYeah, so I mean, honestly, we probably have had like we have unsubscribed rates in the beginning. It was actually 0.5 % per email that we sent out. Now that number is down to like 0.02 or something like that. So yeah, so it's been great. Like I would say the churn is now super low because we've really dialed in the content and we know what works, what doesn't work.\r\n\r\n\r\nNik (26:50.51)\r\nJeez, that's great.\r\n\r\n\r\nNik (27:01.014)\r\nOkay, so through paid acquisitions, you're looking at between a dollar and $2. Right now you're $1.20, but in the beginning you were much lower. Tell me about the other acquisition channels that you mentioned. We'll leave SEO last because I think that that's, I think that just builds over time because you're producing content. Talk to me about the other two.\r\n\r\n\r\nJas (27:08.844)\r\nYeah.\r\n\r\n\r\nJas (27:15.639)\r\nYeah.\r\n\r\n\r\nJas (27:20.214)\r\nMm-hmm.\r\n\r\n\r\nYeah, so mean, the second is referrals and referrals and organic content are probably pretty neck and neck. Referrals is just simply, you know, they will refer to people to you using their unique URL or whatever that they have in their email. And once they do that, automatically something will be sent to them like a restaurant guide or something. We have a restaurant guide that we have curated for when you refer to people to us.\r\n\r\n\r\nNik (27:51.576)\r\nMm.\r\n\r\n\r\nJas (27:51.671)\r\nI know the morning crew did like, you get a cup at 15 and all of that, but 90 % of people are simply only going to refer two people to you. So just focus on the first achievement or the goal that they're going to get.\r\n\r\n\r\nNik (28:04.04)\r\ninteresting. when you said referral program, you weren't talking about like going and placing ads in other newsletters. You were talking about, if you refer a friend to this, you get something from me.\r\n\r\n\r\nJas (28:13.875)\r\nExactly, exactly. Yeah. And then it's then it's all automated as well, actually. So I know some people do like stickers and stuff, but that gets hectic because you're actually, physically shipping out things. For us, we've gone and just created like a notion guide that they get a link to and all people do it anyways.\r\n\r\n\r\nNik (28:24.824)\r\nYeah.\r\n\r\n\r\nNik (28:33.966)\r\nYeah, it's like a traditional lead magnet. Did you advertise in anybody else's newsletters ever?\r\n\r\n\r\nJas (28:36.287)\r\nYeah, exactly.\r\n\r\n\r\nJas (28:41.527)\r\nWe have tried that. It doesn't really work the best, Yeah, like I wouldn't say that you... Like we get like 50 subs or something like that from like a 10,000 people email list and I was like, okay, I'm never doing this again.\r\n\r\n\r\nNik (28:43.758)\r\ndoesn't work.\r\n\r\n\r\nNik (28:54.7)\r\nWhat about just organic? What were you doing for organic customer acquisition?\r\n\r\n\r\nJas (29:00.893)\r\nYes, organic meaning like Instagram videos and Facebook videos in that sense. So we actually post every single day and we have been for the last six months. And that's been the big unlock for us.\r\n\r\n\r\nNik (29:14.56)\r\nOkay, so you at the same time launched the socials on Instagram, just Instagram or anywhere else.\r\n\r\n\r\nJas (29:19.221)\r\nYeah, exactly.\r\n\r\n\r\nInstagram and tick tick tock only like a month like actually two weeks ago Instagram was a big focus because of the fact that that audience for me matters the most to anybody that you're advertising to\r\n\r\n\r\nNik (29:33.708)\r\nAre you, I lost my train of thought. What was I gonna say? Are you, why not YouTube? Why not Facebook?\r\n\r\n\r\nJas (29:47.379)\r\nWell, Facebook on Instagram, yeah, but we do post on Facebook, but it's simply the toggle that you switch on like, hey, yeah, when I post to Instagram, just post to Facebook as well. That's about it. The reason for not YouTube is it's really hard to build a local community on YouTube. And for local things, Instagram and Facebook are probably your best bet.\r\n\r\n\r\nNik (30:08.846)\r\nYou should look at YouTube. There's this guy on YouTube. He's like Dallas Fort Worth real estate guy or something. can't remember exactly what it is, but he has like 150,000 subs and he probably makes hundreds of thousands of dollars a year just monetizing off of YouTube. I mean, Dallas is obviously a lot bigger than, than Winnipeg, right? I do think there is some opportunity there. How do you get people to convert from Instagram to the newsletter? Because if you've got 35,000 Instagram followers, but only 15,000 newsletter subs, obviously not everybody is.\r\n\r\n\r\nJas (30:21.803)\r\nBe interested.\r\n\r\n\r\nJas (30:25.344)\r\nYeah.\r\n\r\n\r\nJas (30:32.983)\r\nThank\r\n\r\n\r\nNik (30:38.862)\r\nyou know, talking over to the newsletter.\r\n\r\n\r\nJas (30:38.933)\r\nYeah, yeah. So actually, Instagram does this one specific thing for you when you're running ads. And this is something that we have personally noticed is when you have an established Instagram page, your ads will convert a lot better because there's like a trust factor that's already been built into it because of the fact that people can click over from your ad over to your Instagram page, for example, and that builds a lot more credibility to you.\r\n\r\n\r\nNik (31:04.748)\r\nBye.\r\n\r\n\r\nNik (31:08.558)\r\nSo here's a really dumb question. You were doing Facebook ads and obviously Facebook owns Instagram. Were those ads cross posted or do you have to do specific ads for Instagram and specific ads for Facebook?\r\n\r\n\r\nJas (31:15.937)\r\nYeah.\r\n\r\n\r\nJas (31:23.293)\r\nNo, so when you're doing Facebook ads, it gives you the option to, if you want to just do, let's say, Facebook feed or Instagram feed, and you're able to select any type of placement that you want. We only do Facebook and Instagram feed, and that's the only thing that we do.\r\n\r\n\r\nNik (31:38.392)\r\nDid you know a lot about ads before this? Did you self teach or D are you using an outside agency?\r\n\r\n\r\nJas (31:44.861)\r\nNo, I self-taught myself. Like I used to, I sold like an e-commerce company or something when I was like 18-ish. So I dabbled in Facebook ads a little.\r\n\r\n\r\nNik (31:54.136)\r\nSo if somebody is watching this at home and they want to like launch their own local newsletter, would you recommend going with an agency or would you recommend like, teach yourself? It's not rocket science.\r\n\r\n\r\nJas (32:02.997)\r\nI wouldn't recommend going with an agency because most people, a lot of people that are looking to start this are looking to start this as like a side thing. Rather than dumping money into an agency, it's a lot easier to spend five hours and learn it off of YouTube. Yeah.\r\n\r\n\r\nNik (32:16.248)\r\nOkay, all right, I'm gonna pivot now. Monetization, the moment everybody's been waiting for, monetization, tell me for your local newsletter, how are you monetizing?\r\n\r\n\r\nJas (32:29.075)\r\nYeah, so one side again is the consumer facing side, which is the reader. You're reading the newsletter. The other side is more B2B. So my sell is essentially to local businesses, right? I come in and it's a sell to local businesses and there's generally two types of places we can give ads to and that's either newsletter or our Instagram, right? Now, again, where Instagram actually plays the biggest factor is\r\n\r\n\r\nyou cannot display your email news that are subscribers. Yes, I can write it in like a media kit or something, but people can't search my name up and know how many email subs I have. Whereas in Instagram, it adds to that vanity metric that, they're actually an established brand. And then...\r\n\r\n\r\nNik (33:14.338)\r\nThat's not even a vanity metric. It's trust building in that context, right? Yeah.\r\n\r\n\r\nJas (33:17.855)\r\nYeah, yeah, exactly. And then the biggest thing is when you add the six months to it. So when I say, we'll build 50,000 people in six months, then they're like, wait, what? Say that again? Like, you know, that's when that's when they switch their tone. They're like, wait, excuse me. Wait, can you see that? How?\r\n\r\n\r\nNik (33:34.51)\r\nSo, okay, so hold on. You've created the content, you've launched, you've started now acquiring customers. Traditionally, what I understand, there's three kind of ways to monetize. There are ads. I can sell ads to my newsletter. There are affiliates. So I could put a link in and every time somebody clicks that and makes a purchase, I get a percentage of whatever is sold. And then there's like,\r\n\r\n\r\nJas (33:46.881)\r\nMm-hmm. Yeah.\r\n\r\n\r\nJas (33:52.801)\r\nMm-hmm.\r\n\r\n\r\nNik (34:04.492)\r\nthe most organic and highest margin, which is you own your own business and you sell your own product through your newsletter's distribution. Did I miss any? Are those the three?\r\n\r\n\r\nJas (34:13.875)\r\nNo, no, yeah, you hit you hit all of them on the spot, I would say. And I think a lot of people right now looking to start these newsletters are a lot more business owners who already own HVAC companies and that sort of thing. But essentially, so when I had started the newsletter, my idea was this that, OK, I am going to spend twenty thousand dollars into building this thing and then I just have to sell two annual advertisers.\r\n\r\n\r\nto make that money back.\r\n\r\n\r\nNik (34:44.959)\r\nOkay, me, no, walk me through the math. What does that mean?\r\n\r\n\r\nJas (34:48.599)\r\nSo you will usually sell ads when you're... Okay, so going back to your three different types of newsletters, you usually sell ads on a CPM basis. So cost for every thousand impressions, right? For us, that number looks like $750. The reason is back of the napkin math, 15,000 email subscribers, 7,500 of them open, and that's $750 that we can charge per email at $100 CPMs.\r\n\r\n\r\nNik (35:18.19)\r\nOkay, hold on, sorry, sorry, I'm really stupid. You have 15,000 email subs. Is the cost or the CPM, is that based off of the open or the total number of subs?\r\n\r\n\r\nJas (35:25.014)\r\nYeah.\r\n\r\n\r\nJas (35:30.677)\r\nYeah. It's based on the open.\r\n\r\n\r\nNik (35:34.286)\r\nOkay, cool. So 7,500 open. And you're sending it three times a week. Are you charging per week? Are you charging per month?\r\n\r\n\r\nJas (35:37.344)\r\nYeah.\r\n\r\n\r\nJas (35:41.077)\r\nYeah.\r\n\r\n\r\nJas (35:45.623)\r\n$750 that's like per addition\r\n\r\n\r\nNik (35:48.366)\r\nOkay, so you get $750 for essentially every edition that you send out.\r\n\r\n\r\nJas (35:56.948)\r\nExactly, exactly, yes.\r\n\r\n\r\nNik (35:59.118)\r\nSo that's $10 per open.\r\n\r\n\r\nJas (36:06.205)\r\nYeah, yeah, exactly. Well, yeah, exactly.\r\n\r\n\r\nNik (36:06.818)\r\nRight? Right?\r\n\r\n\r\nOkay, so that's why you're saying if I send and I'm going to do on my calculator here 50 50 weeks a year three times 7500. Well, well on my way off 7500 times.\r\n\r\n\r\nJas (36:24.407)\r\nNo, it's three times 750 times the month and then times that by 12. Yeah.\r\n\r\n\r\nNik (36:33.486)\r\nI get it now. I it's 10 cents. It's 10 cents per subscriber per edition. Okay. Okay. so three times 7,500 times 52. That's 1.1 million times 0.1. So that's $117,000 a year in ad revenue right, right now.\r\n\r\n\r\nJas (36:37.696)\r\nYeah.\r\n\r\n\r\nJas (36:54.71)\r\nYeah.\r\n\r\n\r\nJas (36:58.217)\r\nIf I want, yeah, like that's if you extrapolated and if you sold every single primary, yeah, there is, right?\r\n\r\n\r\nNik (37:02.998)\r\nRight. Holy crap, man.\r\n\r\n\r\nJas (37:06.817)\r\nSo the thing is though is that you can actually make a lot more and I'll tell you how it's because it's\r\n\r\n\r\nNik (37:13.218)\r\nWell, that that that translates to about $15 per subscriber per year per like per opening subscriber per year, essentially.\r\n\r\n\r\nJas (37:18.87)\r\nEx-\r\n\r\n\r\nI just say it as generally like the math that I did is $7 a subscriber. That's it. Right? Like because half of them are not going to open half of them are going to open $7 a subscriber for per year. And so even if you're acquiring a subscriber for three, $4, you're still two Xing your money in a year. And then after that is just gravy on top.\r\n\r\n\r\nNik (37:27.63)\r\nSure. Right, right, right, right.\r\n\r\n\r\nNik (37:41.134)\r\nWell, I mean, and depending on your churn, but you just said your churn is less than like .002%. So like you're hardly churning anybody. So your LTV is probably going to be like. I mean, .02 % is like 10 years.\r\n\r\n\r\nJas (37:56.915)\r\nYeah, yeah, exactly. That's the last thing we had done as well.\r\n\r\n\r\nNik (37:58.274)\r\nHoly crap. It's like $150 LTV for even you call it $2 customer acquisition cost. Dude, insanity. Have you started monetizing? Like have you started selling these ads yet?\r\n\r\n\r\nJas (38:05.569)\r\nYeah. Exactly. Yeah.\r\n\r\n\r\nYeah, yeah, yeah. So, so getting around to, so we've sold about 50,000, 50 ish thousand in ads up until now. now what that looks like is we have now just started selling annual advertisers. I barely do any. So coming back to the same math that we just did like a second ago, it was my idea is, okay, I sent 12 additions in a month. If one annual advertiser is on average going to get\r\n\r\n\r\ntwo ads in the newsletter per month. That means I just need six advertisers for the whole year, right? Make the hundred and whatever $20,000. And then any one-off events can be a secondary ad placement, right? So I've guaranteed that I'll make a certain amount of money and then anything on top is a secondary ad placement in the newsletter.\r\n\r\n\r\nNik (38:48.75)\r\nMm.\r\n\r\n\r\nNik (39:04.334)\r\nDude, that's, at what threshold can you turn ads on? Cause it's not like, I have a thousand subscribers and they're going to pay me, you know, 10 cents per open, whatever, per issue. Like at what point is it, are you actually able to monetize?\r\n\r\n\r\nJas (39:18.839)\r\nSo\r\n\r\n\r\nJas (39:22.369)\r\nSo if you're going to start a local newsletter, do not tell your advertisers that you're charging them on CPMs because they first they don't know what CPMs are. So you're going to get into this whole education aspect of the sale that you don't want to get into. Exactly. And so the best part is you want to package everything together. So when I send like packages to, let's say a company, I'm like, hey, for the next year, you're going to get 24 ad placements and four Instagram reels.\r\n\r\n\r\nNik (39:36.686)\r\nJust ignore it.\r\n\r\n\r\nJas (39:52.439)\r\nfor this much at $100. Now if they ask, how are you pricing us? That's when I kind of break down the math to them.\r\n\r\n\r\nNik (39:59.586)\r\nWell, do you do 24 placements and Instagram reels or whatever? Do you also assign a number of eyeballs to that? Are you like this is OK? And are you charging? No, no, no, you go.\r\n\r\n\r\nJas (40:06.295)\r\nYeah. So they'll go ahead. Yes, I was saying they'll know exactly how many impressions they're going to get from the email newsletter. And that's our sell actually to them. I'm like, you're going to spend $500 on a billboard ad. You don't know how many people drove by. You don't know how many people looked at the billboard. You don't know any metrics regarding that ad. Now, whereas we come in and we can guarantee you.\r\n\r\n\r\nfrom past metrics that, we're going get a 50 % open rate. And if you book with us for the next year, you're also locking in the growth pricing, right? So that means that you're not going to have to pay as you go. And then an additional thing, the two things that really sell advertisers is exclusivity and renewals. So the two things that they get are\r\n\r\n\r\nHey, you're going to be our exclusive partner. If you sign up for over $10,000, we have three of these annual advertisers in the last month now, by the way. So if you sign up for the whole year, which is over $10,000, you will be our exclusive partner in your niche. So that means that competitor A, B and C, we can never work with them, right? Until we have a contract with you.\r\n\r\n\r\nNik (41:18.518)\r\nInteresting. Yeah, that makes\r\n\r\n\r\nJas (41:20.597)\r\nAnd then once our contract expires, you get first rights to renew.\r\n\r\n\r\nNik (41:25.4)\r\nHow do you price the Instagram ads? Are they on a CPM? I mean, I know you're not telling them it's a CPM, but do you internally say like, okay, CPM for an Instagram view is the same as a CPM for newsletter open?\r\n\r\n\r\nJas (41:37.591)\r\nHonestly, like I am mainly just trying to advertise the newsletter. So Instagram ads are a little bit more like just bonuses. So they'll get like maybe three or four Instagram ads or something like that. And I usually pay them about a thousand dollars each.\r\n\r\n\r\nNik (41:53.08)\r\nWould you recommend that if somebody is going to start a newsletter, they also start some type of a social media and connection? They have to, okay.\r\n\r\n\r\nJas (42:01.451)\r\nThey have to. They have to. It's probably the highest ROI thing that I have done for the local newsletter because we actually get inbound inquiries from the Instagram and then I convert them over to the newsletter.\r\n\r\n\r\nNik (42:19.371)\r\ndude, is... Okay, what are you currently spending on customer acquisition costs right now per month?\r\n\r\n\r\nJas (42:20.47)\r\nYeah.\r\n\r\n\r\nJas (42:28.791)\r\n$3,000 Canadian and then another five ish hundred dollars for like softwares.\r\n\r\n\r\nNik (42:34.99)\r\nAnd I know like you've been ramping up, right? So what you're generating today is not going to be what you're generating a year from now. But like in the month of September, how much revenue did you generate?\r\n\r\n\r\nJas (42:45.175)\r\nBooked or like how much did we like just booked ads? Yeah, so in terms of collection we probably collected about three four thousand dollars now there's a few checks so for annual advertisers they can pay us upfront or monthly one of them is deciding to pay us upfront which is going to be a fifteen thousand dollar check so that's going to be coming but then I would say like yeah in the last four weeks we'll probably booked about\r\n\r\n\r\nNik (42:49.048)\r\nDo both. How many booked ads and then how much did you collect?\r\n\r\n\r\nJas (43:13.949)\r\n40ish thousand dollars of revenue so most of our\r\n\r\n\r\nNik (43:17.23)\r\nOkay, so these ads, if an advertiser signs with you, you have a system where they don't have to pay upfront, they pay on a monthly basis?\r\n\r\n\r\nJas (43:27.029)\r\nYeah, they can do either or. The only thing is in the contract that we do write that, hey, if you cancel beforehand, like you can't cancel unless we do something stupid or something on our end.\r\n\r\n\r\nNik (43:37.71)\r\nOkay, so you brought in $3,000. Other than your time, what were your hard costs? Like what did you spend to keep the business running?\r\n\r\n\r\nJas (43:47.778)\r\njust the advertising. That's she means the\r\n\r\n\r\nNik (43:49.368)\r\nBeehive, beehive is probably going to be, I don't know, $100 a month. Because I think, I think beehive is free under a certain threshold, like 10,000. But then once you get above it, it costs money. So, so you got beehive, maybe some tech stack. Do you have any VA's? Like, is anybody doing any work for you?\r\n\r\n\r\nJas (43:52.117)\r\nYeah. And then that's\r\n\r\n\r\nJas (43:58.839)\r\nYep.\r\n\r\n\r\nJas (44:08.056)\r\nNot at the moment looking to hire my first one right now that will be mainly doing like sales and admin work.\r\n\r\n\r\nNik (44:14.668)\r\nOkay, here's my question that's on everybody's mind. Is this a side hustle that you would recommend to other people?\r\n\r\n\r\nJas (44:22.177)\r\nthink definitely. I think the reason is because you can launch other businesses off of this in the future. Right. And this is one that anybody can start. know, it's that's what I did. listened to the first Ryan podcast. It was with a guy called Matt McGarry and I actually couldn't sleep that night. Like it was I'm not even going to lie. This was yeah, this was last year in August. I remember still. And I heard the podcast and I was like,\r\n\r\n\r\nNik (44:28.536)\r\ntotally agree with that yes.\r\n\r\n\r\nNik (44:44.365)\r\nYou were so excited.\r\n\r\n\r\nJas (44:52.531)\r\nWait, so you're telling me that anybody in the world can just go and do this for their local town, right? So it really is like a side hustle that anybody can start no matter where you are. And most people, they complain about locally in my city, there isn't like a startup scene or something like that of that nature. And you actually don't want that for this because the less tech savvy people are, the more monocular.\r\n\r\n\r\nThe more you can monopolize this just for yourself.\r\n\r\n\r\nNik (45:23.374)\r\nthat's so good. That's so good. Well, I'll just I'll say the last thing like Ryan, but when I was talking to him, he's now launched a porta potty business, he wants to buy a restaurant like, yes, it's a small town, but he now knows everybody. He's got connections with everybody. He's a man about town, restaurants, fill it, you know, get him in. He doesn't even just slip them a 20 because he's writing them reviews like you get put especially if you're going to stay in your town long term, all of a sudden you are you are one of the difference makers like you're one of\r\n\r\n\r\nthe people in town who makes things happen. I think that part's awesome. Jazz, this was amazing. I learned so freaking much. Where's the best place for people to come find you or for people to be like, Jazz, I want to pay you to do this with me in another market. Let's do this thing. Like, where should people reach out to you?\r\n\r\n\r\nJas (46:10.635)\r\nYeah, I mean, you can just reach out to me on my Twitter, which is just creating jazz. That's the handle and yeah, I mean, all things newsletter.\r\n\r\n\r\nNik (46:18.99)\r\nOkay, yeah, and jazz isn't actually offering any consulting services. I just threw that out there in case anybody wants to entice him with money. Cool, man. Well, I can't wait to hear the update in a year from now and we'll talk soon.\r\n\r\n\r\nJas (46:29.537)\r\nPerfect, thank you brother.",
  "metadata": {
    "duration": "",
    "date": "2025-01-08",
    "platform_source": "Google Drive"
  }
}