{
  "episode_number": "15",
  "episode_title": "Can Laundromats Really Make You a Millionaire with Tyler Purcell",
  "guest_name": "Tyler Purcell",
  "business_name": "The Laundry Spot",
  "transcript": "﻿Welcome to Nikonomics.  Tyler Purcell is with me today. Tyler, I've been stoked to have you because we're You run, in my opinion, the quintessential small business sweaty business.\r\n\r\n\r\nIt's like you run laundromats and it's the business that Cody Sanchez got really famous for, which is like, anybody can buy a laundromat. All you have to do is X, Y, and Z. And then she's blown up. And I've talked to so many people over the years who have just been fascinated. They're like, Oh, that's going to be my first business.\r\n\r\n\r\nWhy do you think that  It started? And why do you think there's still a healthy fascination with laundromats? Yeah, I think it's an essential service. People always talk about recession proof businesses and laundry is one, right? Like you have to wash your clothes.  So I think that's a big reason why.  Yeah.\r\n\r\n\r\nHow often is another choice, but so yeah, I think that's a big reason. Another big reason, a lot of gurus talk about passive, right? Like I hate that word. You know, a lot of businesses aren't very passive in the beginning, but you can build them there. And I think we've gotten to a spot where it's, you know, passive.\r\n\r\n\r\nSo I think that's another big reason. Do you think of it as passive at this point? I would call it semi passive with our structure and how we have it built out. I think it's about as passive as it can get for myself and my partners. We're focused on the, The big vision, the growth, the next move where it's running itself day to day.\r\n\r\n\r\nOur GM is a rock star. Our assistant GMs are great. Talk to me really quickly. How did you get into the business? What drew you to it? My father in law. So  awesome. Back when I was dating my wife, I knew her father had a laundromat. And fast forward a few years, we get married. He approaches us. He's like, Hey, I think I got a good thing going.\r\n\r\n\r\nThis laundromat business seems to be cool. It's making good money. Would you guys want to join me and open up more stores?  And I think I was 28 at the time. I'm a finance guy. And so I was like, eh, laundromat isn't the coolest, sexiest business, but you know, if it makes money, let's, let's figure it out. \r\n\r\n\r\nSo he opened up his books. I looked and I'm like, wow, these things, these crank, if we could have five, 10 of these, what was good about it? Tell me what was well about it. So back then, eight, eight years ago, I think they were netting like 200 K. Okay. Each location off of what revenue? Like his stores at that time, we're doing like five 50,  about 550 K top line, five 50 and netting 200. \r\n\r\n\r\nYeah. Margins are great. That's another reason people, gosh,  holy crap. That's incredible. I didn't know that.  Oh yeah. I mean, his stores. We're running at about 50 percent profit margin. Jeez Louise. Okay. We need it. We need to just end this episode now. This is going to make even more people get into space.\r\n\r\n\r\nThis is ridiculous. Yeah.  Yeah. So I'm like, wow.  How long had he owned the business before you started looking at it? Wow. His first laundromat was 2006.  Long enough. Long time. Long time. Yeah. He's an OG of the laundry business.  So he opens his books to you. He says, look, Tyler, welcome to the family. You married my daughter and now you're taking over the family business. \r\n\r\n\r\nAnd you liked what you saw and decided, all right, let's do this. Let's go into it.  Yeah. So my other partner is my brother in law. So he approached my wife and then also his son. It's great.  He's, he's great at all things. I'm not great at. So. Graphic design, software engineering background. So we came together, we wanted to rebrand everything.\r\n\r\n\r\nMy father in law's store was called coin laundry at the time.  Okay. So we're like, okay, it says what you do, but it's not terrible. Maybe we can,  maybe we can spice this up a bit. Yeah. So we got together and dreamed up the laundry spot, created the logo, the branding, and so.  Super proud of what we created. We love the brand, love the name.\r\n\r\n\r\nWalk me through really quickly before we get into like the nitty gritty of the business. So that was eight years ago. You get into the business, you've gone from zero. Well, one location to four.  What did that progression in timeline look like? Was it like one store every two years or did it get backend loaded? \r\n\r\n\r\nYeah. So there was a lot of learning for us because I knew nothing about the laundromat industry. So Before we even had our first location picked out, I think we were learning and looking for about two years  and then, yeah, found our first location, got that one up and running. That one took about six months for build out before it was open.\r\n\r\n\r\nSo about two and a half years. That's  all on. You said found your first location. I thought you already had a location up and running. You're saying your first like next location. Our first location. Yes. Our first laundry spot, technically with us as a team.  Oh, okay. Are you involved in that other business with your father in law? \r\n\r\n\r\nThe coin? Yeah. He rebranded. Okay.  Yeah. He rebranded his store laundry spot. So all of our stores are now under the spot name. I have to tell you this quick story. I used to watch shark tank and there's one of my favorite videos of this guy and he's like pitching to the sharks and they're grilling him and they're like, well, how can you find such good manufacturing costs?\r\n\r\n\r\nAnd he says, well, uh, my wife's father in law actually owns a manufacturing facility in Romania. And And the sharks are like,  your wife's father in law, you, you mean your dad? And he's like, yes, sir. That's correct.  This is so funny. Oh, I don't know. That's not the same as what you're,  that's not the same as what you're explaining, but you know, it's family ties and it's incestuous.\r\n\r\n\r\nOkay. Walk me through that process. When you said you were learning and looking, I get the learning. I get that. You're just like trying to understand the business, the industry, et cetera. But when you were looking,  what are you looking for? Are there key metrics? Are there? Cars per day. Is it like what the population growth is?\r\n\r\n\r\nLike, what are the key metrics when you're trying to find a laundry spot?  Yeah. So I'll actually rewind a bit because I get this question a lot. Why do you choose to build from the ground up or build from a white box instead of buying laundromats?  And we started by looking at a pack of four laundromats to buy. \r\n\r\n\r\nSo as we were doing that due diligence and everything, digging into the weeds, going to all these stores, we realized like,  why would we buy these old laundromats? The infrastructure is usually poor. Utilities need to be ripped out and updated. Bigger water lines, bigger gas lines. Layouts are poor. We were going to need to replace the equipment.\r\n\r\n\r\nAnyway, you're going to have to put money in it and do it anyways. Why not do a new build? Yeah. We're like, why not go across the street from this laundromat? Why pay them customers when we could just be right across the street from them and take them anyways.  So  we kind of shifted our view to that. So you already know it's a good location because there's a laundromat there.\r\n\r\n\r\nAnd on top of that, if a crappy laundromat is able to be there and be there for a long period of time, then there must be enough demand. To support a new nice laundromat coming in. Is that kind of like the way you're thinking about it with your thesis? Exactly. Yeah. So all, you know, we'll go out and we'll look around and if we see a pocket of three or four laundromats and a decent radius of each other.\r\n\r\n\r\nAnd then we'll dive into each one. Okay. What do they look like? Are they shitty old laundry mats? What are their Google reviews?  We're going to get back to the show in one minute, but I just wanted to tell you about today's sponsor, which is, uh, me. Oh, it's me. I'm sponsoring the show. Yeah. Cause I'm doing this for free.\r\n\r\n\r\nDo me a favor, like, and subscribe right there, right at the bottom. Move your yep. It's right there. Yep. Awesome. Thank you. What are their Google reviews? We'll go to each store. And even do a load of laundry in there to just get the experience and see what would customers want better than what's being offered.\r\n\r\n\r\nIf you saw two areas, they each had the same concentration of laundromats within, let's say, a five mile radius.  But the three in the one  are all new laundromats and the three in the other are all old crappy laundromats. Are you going to go invest in the crappy laundromat?  Competitors or are you like, Oh, there's more demand over here.\r\n\r\n\r\nThey've been building new ones. We should go like, like which of those two paths do you usually follow?  No, we'll go after the, what we call them zombie mats. So laundromats that opened 20 years ago and basically they eat themselves till they're just a shell of their former self. So they've gotten the nickname zombie.\r\n\r\n\r\nI love that. Is that an industry nickname or did you give them that nickname?  I did not create that. That is kind of like an industry nickname, things like that. So yeah, we look for those, right? Like, if there's two or three brand new stores  It's almost, yes, we'd be the best one, but how we operate, like we need the whole market share for the numbers we want to have.\r\n\r\n\r\nSo we want to go in where that, that pocket of three or four zombie mats is and take out all three or four of them,  which we will over time.  So over the course of our four stores, we've put out 11 other laundromats, like literally put them out or they're just like, they've closed their shutter, their stores and they're out of business. \r\n\r\n\r\nYeah, they're completely you, you greedy hearted capitalist. How dare you?  Oh my God. No rinse and repeat for those guys.  It sounds bad. Part of me is cringes when I say it, but you know, Hey, if you're going to be in your community and not offer a better product, they've extracted all the value over the years and they haven't reinvested.\r\n\r\n\r\nI get it. That makes total sense. What kinds of ratio and demographics do you look at? Do you look at like stores per person? Do you look at stores per person in 20 and 50? Do you look at age and income? Like what? What are sort of your key metrics that you look at as you're evaluating?  Yeah. So really in the laundromat industry, when you're talking about self serve customers who walk in, put quarters or pay at the machine, your own laundry, you really want to dial it in within a mile radius of your store.\r\n\r\n\r\nThat's going to be your main demographic. And we're looking at certain income levels below a certain income level, the percentage of renters, education. We're looking at a few different things that line up with our past models and our past stores.  Okay. Do you have a pretty plug and play model at this point?\r\n\r\n\r\nAre you like, yeah, we know whether or not it's going to work within five minutes of due diligence.  Yeah. So to kind of prove that each store that we've opened has done better than the previous one. That's awesome, man. Along the way, we've just learned how to get better. And then now, yeah, we have a rubber stamp.\r\n\r\n\r\nDo you own the real estate or do you lease all your stores? Yeah, we own three of the four buildings and then we lease our other location. All right. So you walked me through some of the economics of it. Is it 40, 50 percent net margin? Is that normal?  Yeah. Yeah. For the industry. If you're running a good store, like 40 percent is not out of the question.\r\n\r\n\r\nI love that little smirk. Oh, he's just like, if you can't, those of you who can't see him, I asked him before I even finished, he was already smirking.  That's amazing. Yeah. Yeah. X is all is full of home services businesses, right? And then you get into the numbers of that and you see, okay, 10 percent bottom line, 15 percent bottom line, 20 percent if the thing is firing on all cylinders and us lowly laundromat.\r\n\r\n\r\nWell, they're selling a service and it has to be done by people and people are expensive and hard to manage. And  anyways, that's, man, that is fascinating. So  how do you find customers?  Yeah. So we actually, we do a big push before we even open a store. So, I've posted a few things, but I'll give you kind of how we go about a new opening, a grand opening.\r\n\r\n\r\nSo, one big thing we did new this time is we had a  red carpet VIP event for business owners, city council members, media,  at our store. We had a saxophone player. We had catered food, a bartender in a laundromat.  Yeah. Awesome, man. That's awesome.  So we're like, what can we do? That's just, people are going to be like, what, excuse me?\r\n\r\n\r\nAnd they're going to be intrigued. And that's what we came out.  That's awesome. The word of mouth. So we got about 60 attendees  from that party. So we, from that, from the media that were there, we had articles written about us. We had video on the local news. And so the word started to spread. We also do physical mailing, postcard mailing.\r\n\r\n\r\nSome people say physical mail's dead, but we find it very, very positive in our industry. So we'll do a coming soon mailing. What about digital? Do you do any SEO, pay per click? Any of those types of marketing?  Yeah, we do. And I'm probably not the one to ask my brother in law is the one who heads all that up, but yeah, we do, we do.\r\n\r\n\r\nJust your response to it kind of tells me like, that's not the main avenue you're getting customers through.  Right. Correct. Yeah. So, yeah, so it is a little different business model. I mean, it's, it is somewhat of a build it and they will come.  So we did that VIP event. We get the postcards out, the physical mail.\r\n\r\n\r\nWe do our research on what areas where we think our ideal customer's living. Send those out. We do digital ads, Google ads, Facebook. We couple that with  a double grand opening weekend free laundry.  So we do a Saturday and Sunday, two weekends in a row, completely free wash and dry. And.  It's just madness. I mean, complete madness, chaos. \r\n\r\n\r\nAnd that's what we like because the buzz just explodes. Bring as much clothing as you want, wash as much as you want. And one, it's great for the community. One, everybody's telling their friends, do you have something you need to wash your bedsheets, your old curtains, whatever, just bring it.  And so we run those two weekends and that's like all the marketing we need. \r\n\r\n\r\nI mean, it is just amazing how many customers we get in the door  from that. So I'm hearing you, I'm hearing you talk.  It's got great margins.  It's a build it and they will come model. You're not necessarily competing against the most sophisticated incumbents in the industry because you have these zombie stores.\r\n\r\n\r\nWhy the freak are you only at four stores?  You've been doing this eight years. I'd like, it just seems like it's a printing money machine that you just like, you put the inputs in and the outputs come out. Like, you know what I mean? Like, why are you only at four stores?  Well, I, my answer to that question is I have the other best job in the world and it's financial planning.\r\n\r\n\r\nSo that is my career. That's what I love. It's a phenomenal job. I love what I do. So. I don't want to give that up to jump fully into the laundromat business. It's just as good or better. So the same scenario is kind of with my partners. We all have successful day jobs. No one really wants to take that leap.\r\n\r\n\r\nSo over the last six, eight months, we've really been talking with each other. How do we,  how do we have 20, 30, 40, 50, a hundred, 200 stores. And so. We've been throwing some things around. Do we want investors, operators, the franchise model? So we've been looking and talking with people in the background. So there's some things don't get on me too much.\r\n\r\n\r\nI figured it. I won't. I won't. All right. My last question before my like rapid fire questions, if I wanted to buy a laundromat in Boise, what would I do? Like, just walk me through  the process. Do I go to buy, sell and look for one for sale? Or should I just go and look at where the current ones are? All right, go, go. \r\n\r\n\r\nI do a Google search. Search your laundromats in your area. Find a pocket. Of two, three, four,  then create, but you're an Excel spreadsheet guy. Create a spreadsheet on every single one of them. Go to each one.  When you say pockets, you mean like within a mile radius or like, what's the radius I'm looking at?\r\n\r\n\r\nWhat are pockets? I would say within three miles, if you can find a couple within three miles, two, three, four, within three miles of each other, that's going to be a darn good market for, for laundry. Go to each one, get their equipment, their sizes, how big you think it is. They're pricing. Do they offer other services?\r\n\r\n\r\nDo they offer wash, dry, full? Do they offer pickup and delivery? Do they offer commercial laundry? They have vending. Do they do dry cleaning and build out your competitor spreadsheet? And then once you have that, then start looking for real estate. In that area,  pick out three or four locations that you think might be good.\r\n\r\n\r\nThen run the demographics on those specific locations within a mile. You run the demographics after you find the space. Well, after we find a couple of spaces to whittle it down, we already know the general area where it's going to be successful. Now we want to find the perfect spot. You're going even tighter.\r\n\r\n\r\nYou're going like a three mile radius of demographics. That's what you're saying.  One mile radius.  Son of a holy crap. Really? Yeah. Yes. That's an okay. That is.  Yeah. We go out to three miles just to see what that extended market is like, but the money's made within a mile. I think there was a poll out not too long ago of laundromat owners and they said the average customer doesn't drive more than like 12 minutes to a laundromat. \r\n\r\n\r\nLike it, it needs to be close  to that. Okay. I mean, it blows my mind, but it also makes sense, which is really interesting. Okay. So then run the one mile demographics. What am I looking for in the one mile demographics? You're looking for highest percentage of renters, older apartment complexes that may or may not have in unit washer dryer.\r\n\r\n\r\nTheir capacity may be poor. You're looking at older homes, older single family homes, low property value.  You're looking at income levels in our area. We have a certain number. So this is Cincinnati, Ohio. It's going to, going to vary wherever you're at. But you know, we're, for example, we're looking for average incomes under 50, 000 in, in our one mile. \r\n\r\n\r\nAre all your stores close to you? Like, could you drive to the mall within an hour?  All of all four of our stores are within 20 minutes.  Oh, okay. So you stayed in a geographic area that you know well and that you can get to really quickly.  Yeah. Not that I need to get there. I only go to the store once a month. \r\n\r\n\r\nWhen you look at people like me who are like, Oh, I have some money. I could start a laundromat.  What do you say to them? Are you like, don't do it? Or are you like, yeah, man, you should, if you can afford to do the things that I just said, you should like, where do you fall on that spectrum?  Absolutely. I tell everybody they should look into it and I tell them to give me a ring.\r\n\r\n\r\nI'm happy to help.  All right. Happy to help. That answer.  Run through things. People come to me and say, Hey, there's this laundromat for sale. I'll help them evaluate it if that's the right choice for them. But absolutely. Laundromat business is amazing. Not only is the business good,  we are going into communities where great brands are pulling out,  right?\r\n\r\n\r\nBut we're coming into these communities. We're giving these communities. A dignified place to do their laundry. They're used to possibly a roach infested, dirty old laundromat. So one cool thing about this business is we feel like we're part of the community, we're helping these people and they do appreciate it.\r\n\r\n\r\nThat's awesome. The stories from our. The stories from our free laundry weekends.  I mean, I could sit here all day and tell you just like how many people come up to us and tell us how thankful they are. So that's another part I really love about our business. We're not mining these communities for their money and then ditching out on them.\r\n\r\n\r\nWe work with a lot of nonprofits. We do a lot of things for the community to give back.  The way I would lean right now is like, I'm not going to buy a laundromat.  How much money though, would it take for me to get up and running? Yeah, so if you were to do our average size store, which is about 4, 000 square feet, it's probably going to cost somewhere around 1.\r\n\r\n\r\n5 million. \r\n\r\n\r\nAnd so that 1. 5 million produces what in revenue, like as you're doing your proforma, obviously year one's not going to be what year three is, but like what you're hoping it to be in year three, let's say a year three, we'd hope to be seven 50 to 1 million on a new store top line. So right now, if you just looked across our four stores, our newest store has only been open for a year and a half.\r\n\r\n\r\nBut currently, if we looked at last year's financials, we did a little over 3 million, almost 3. 1 million total revenue and just over a million net.  So,  and mainly that new store is the one dragging that net down because the upfront costs getting up and going. Stores mature around that two to three year. \r\n\r\n\r\nThank you for being so open and transparent. This has been fascinating. All right. I got some rapid fire questions for you. What do you love about this business? I love that. It's a, it's not only is it a great business, but again, we're, I feel like I'm helping people, right? If you put a McDonald's in a location or something like that, are you really helping the community that much?\r\n\r\n\r\nUh, I feel like we are. Yes, you are. What do you hate about this business?  I don't think I hate anything, but it has its trials and tribulations like any business, but hate hates a strong word, man. I don't hate anybody don't hate any businesses. So I'll say nothing. Okay. What keeps you up at night?  Why I don't have a hundred laundromats already. \r\n\r\n\r\nThat's a good answer.  Is there somebody on Twitter business Twitter that you aspire to be like in five years? Should I say you, since I'm on your podcast?  No, please don't say,  all right, I like this question, business guys are really jealous of real estate guys because they look at the real estate and they're like, Oh man, I'd love to have some asset backed business, steady Eddie, consistent cash flows, no headaches.\r\n\r\n\r\nAnd then the real estate guys look at the business guys and they're like, man, it would be really nice to have like a business that could grow and it has cash flows and they've got flexibility, yada, yada. It's this grass is greener sort of mentality. What industries are you most jealous of right now?  Ooh, that is a tough one. \r\n\r\n\r\nI mean, I love the commercial real estate bros. Like we technically own some commercial real estate with the laundromats. So I would love to have some of these warehouses, the commercial real estate warehouse properties, these guys building these 2 million square foot facilities and leasing them out to Amazon are just absolutely killing it. \r\n\r\n\r\nThat's funny.  You're not the only person. You're not the only person who said commercial real estate. I've gotten commercial real estate a couple of times. It's great. Yeah. And I guess that's a little more specific area inside of commercial real estate, but that's always intrigued me, man. I have near my, my neighborhood, they just put in some massive facilities  and I just always wonder the numbers behind that.\r\n\r\n\r\nYou know, you should get somebody on here who, uh, deals in that space. Dude, that's awesome. All right. Here's my last question. What are you obsessed with right now?  I've been spending a lot of time trying to grow this laundromat thing. So I mentioned there's a lot going on in the background, but man, my, my head's been  going crazy with ideas on how to get 400 laundry spots out there in the U S where can people find you?\r\n\r\n\r\nWhere's the best place is Twitter's email. Yeah. Online. Yeah. Find me, find me on Twitter at Tyler Purcell, 24 Mr. Laundry and finance. I don't talk a lot about the financial planning side of things, but I love that side of the business as well. Just find that Twitter likes laundromat more than they like RIAs, so.\r\n\r\n\r\nAll right, Tyler. This was awesome, man. Thank you so much for joining me. Have a good one. Thanks, Nick. Had a blast, man.  See ya.",
  "metadata": {
    "duration": "",
    "date": "2024-06-04",
    "platform_source": "Google Drive"
  }
}