{
  "episode_number": "12",
  "episode_title": "When Insanity Meets Genius: A Wild Business Talk with Jon Matzner",
  "guest_name": "Jon Matzner",
  "business_name": "Sagan",
  "transcript": "﻿Welcome to Nikonomics. John freaking Matzner is my guest. I'm not going to lie to you, John. There are about 10 people I lined up to do this and you were the one I was looking forward to the most. I look forward to hearing myself talk every day. So that makes two of us. \r\n\r\n\r\nI was going to ask you this before we jumped in, but I think we should do a podcast.  Maybe it's like a once a month thing. I don't know, but I thought we had good chemistry at SM bash. I think we'd do a good podcast.  I think you fall into the category of people who are insane and smart. And when you find other people who are insane and smart, you have to hold onto them tightly because you are like I am insane.\r\n\r\n\r\nAnd you make me think I'm like conservative Christian, just like in terms of sweets. I do, I saw your business partners freaking email talking about  cogs on.  Dog dog  freaking funerals. I'm like, this guy's insane.  Did he send me a text? He sent me a text last night. His brother-in-law's dog died. \r\n\r\n\r\nAnd he texted his brother in law, Hey man, sorry to hear about your dog. Do you have any cremation plans?  It was like, it was 95 percent trolling, but yeah, he's please don't post it. He's but it wasn't, but it wasn't, but it wasn't, but it wasn't. All right. Who keeps track of these days?\r\n\r\n\r\nYeah. John Matzner, the anti guru has a Matzner mind. Matzner debater. Dude.  I could give you an introduction, but  you own several companies. You just launched a company called Sagan, which is bringing the Costco model to global talent. Give me in two sentences, what is Sagan and what do you do? \r\n\r\n\r\nSagan launched about a year ago. Sagan passport is a product, but it's essentially eaten up the whole company at this point, which is.  A subscription for global talent hiring plus a community. And so we are able just like Costco through a membership based model to  really reduce prices compared to our competitors in terms of hiring people globally.\r\n\r\n\r\nAnd then within that membership model, we are doing a variety of other benefits to include things like Training automation, work operational documentation workshops, things like that. So it's a different take on how to hire globally, which has only been classically done via two other methods.  So I think the reason, a couple of reasons I like what you're doing is you're very passionate about the way you describe your business.\r\n\r\n\r\nYou're not. Outsourced and you're not overseas VAs, right? If anybody says those terms, when describing what you do, you immediately jump to the defense of those employees because they're global talent, right? They are, they're your employees. They're not a pejorative virtual assistant. They're not, just overseas or outsourcing offshoring.\r\n\r\n\r\nThese are people who you are having to join as members, full fledged members of. A company's actual team, correct?  Correct.  Why do you think the space has gotten so popular in the last 10 years or  five years transaction costs? Its cost is the theory of the firm. If you go back to your economics, which is here, we go this size and shape of businesses are defined by transaction costs.\r\n\r\n\r\nAnd because 20 years ago, you had to hire McKenzie and pay a million dollars to hire people in the Philippines and they all had to sit in an office because that's the only place there was internet and you couldn't send money there. And there was no video conferencing. Now I can have somebody in Africa build me a landing page for 9 this afternoon. \r\n\r\n\r\nAnd because the transaction costs have lowered, it means that Accessing a global talent pool has pushed downwards into the market, not just fortune 500. There's two business models right now, or at least two traditional business models. The first is, Hey, we will place someone at your company for a placement fee of three to 5,000, or we will staff someone at your company.\r\n\r\n\r\nWe continue to employ them. And then you pay us a premium on top of what we're currently paying them. Let's call it. I don't know, 500 per employee per month.  Is that a fair representation of what the current business model is for this? Yeah, except it's more and where I see our opportunity is in both of those cases, you greatly diminished the markup and the spread.\r\n\r\n\r\nSo support shepherd charges 35 percent of projected year one revenue, which on a 2, 000 a month revenue is 10 grand in fees. Yeah. 35%. So if I hire you somebody who's two grand, they're 24, 000 for the year as their salary. They take 35 percent of that.  Wow. So that's 10 grand in fees for one hire.  And then the staffing markup model.\r\n\r\n\r\nIf you look at somebody like a clipped or growth assistant or get landed, they charge you 3, 000 a month for someone in the Philippines is probably about 900 a month.  Makes sense. Why? So you were right with the models, but your markup was about  50 percent too low.  Samsonite. I was off. Okay. I was way off.\r\n\r\n\r\nI was way off. So basically what you're doing with Sagan is giving people a membership to a community, which is awesome. But these are individuals who have been hired globally before  and have access to a talent pool that they can go in and verify and vet themselves as opposed to you being the middleman to go and source recruit place interviews.\r\n\r\n\r\nIs that an accurate representation or tell me the differentiation between those models now. Nope. So the only thing in terms of people hiring before is that's just our, that's just our ICP. That's just our avatar. We've seen, even though 99 percent of businesses haven't hired globally, there will be people who build wonderful businesses going out and targeting those people, but they're a different category of buyer.\r\n\r\n\r\nWe target only high knowledge buyers and that is people who have hired globally before. So that's just an ICP avatar thing. That's not actually a perfect mechanic  within the membership. Yep. We offer six hires per year. Oh, it depends on the level all the way up to 30. And we do beyond that too,  within the membership.\r\n\r\n\r\nThat's why I call it a subscription, not just a membership. We will do one on one hiring with our recruitment team on the ground at our main street level. It's six hires per year. So they put in a request to go to our recruiters two to three weeks later. We deliver you a  video editor.  So going back to the model and Parker just recently did a, I think it's very similar to what you're doing, or he would say it's very different, but you're essentially disrupting two different models that have really good margins.\r\n\r\n\r\nYou have the placement model, 35 percent of the first year's revenue, and then the staffing model, which is an even larger on a percentage basis, markup on a monthly basis, but by offering the subscription model, you're eating the margin of both of those. Why hasn't somebody done this already? I think somebody hasn't done it because  the market wasn't ready  in that there weren't enough advanced users to create a market that was based on a more sophisticated business model in that when I think about what support shepherds should do, they just raised a bunch of money at a large fat.\r\n\r\n\r\nValuation their margins, whatever they need to go out and figure out cold traffic. They need to target the 99 percent of business owners who are not price sensitive, who they can, they don't have downward price pressure on. But if I was trying to sell Nik, you help with your global talent. You're like, what are you nuts?\r\n\r\n\r\nI'm not paying you nine grand. There were not enough of those people floating around.  Five years ago even but now specifically on Twitter, but other places as well that I'm not going to talk about There are other watering holes where we can target people who are high knowledge buyers Who say I'm not going to pay you three grand for somebody who's 800 bucks I'm not going to pay you nine grand for a hire out of Columbia, but I do Want to use global talent effectively.\r\n\r\n\r\nAnd so I am willing to pay at this price point. So the market wasn't mature enough for a more sophisticated business model.  Are you worried at all? It becomes a race to the bottom  because these businesses traditionally have had fat margins  you're coming in, I'm sure you'll still have good margins, but you're undercutting them, right?\r\n\r\n\r\nAnd there'll probably be somebody who comes in and undercuts you at some point and tell the market gets to an equilibrium of what the natural margin should be. Are you worried about that at all?  There are three long term differentiation strategies that I think about. Customer intimacy, product innovation, and operational efficiency. \r\n\r\n\r\nWe are built from the ground up to fight and win a operational efficiency battle, meaning it's not about being lower priced. It's about high quality at a low price. And so when I think about it's, if somebody comes in and knocks us off by a thousand bucks, I'm not worried about it. It's the dealt, it's the intersection of price and value, not price.\r\n\r\n\r\nSo price is how I'm currently whacking the shit out of our competitors, but I won't go all the way down. I don't need to, frankly. All right. Let me ask you some questions about the business. How do you find customers currently? What's your current funnel? A hundred percent word of mouth and my Twitter currently,  is that the plan?\r\n\r\n\r\nI know that's not the plan long term, but what would be the next funnel? I guess that you would move into probably affiliates.  Oh, interesting. Okay. Would you go? I thought about this a lot. Huber was support shepherd, right? I think it's, I think Huber. Cody and Puri, I think those are three influencers that are a part of support shepherd.\r\n\r\n\r\nI've always thought it would be interesting to take a model of like mid tier influencers, right? Like people who had,  I don't know, 20 to 50, 000 followers and have some type of an affiliate arrangement. Maybe they have a piece of equity. I just think those individuals are going to be more. Inclined or they're going to feel excited.\r\n\r\n\r\nOh, I'm, I got invited to the dance. It's the first dance I've ever been invited to. They're going to be bought in. They're going to be excited. Like they got this deal. How do you think about affiliates with this?  It's a little bit about what we talked about at SM bash, which is, I think it's where the underpriced attention is and do those eyeballs have high, um, kind of product market fit.\r\n\r\n\r\nAnd so I could go to somebody who's got a million followers on YouTube, but if they're all for makeup videos, it means nothing. Or I could go to a guy who has 8, 200 followers on LinkedIn and find 200 customers because all he writes about is notion and notion people love global talent. So I actually, I think it's about underpriced attention, not about volume of audience size.\r\n\r\n\r\nOr I think. The name of the game is finding underpriced attention. Whether that's billboards, radio, influencers, affiliates, YouTube channels. And I have some very particular thoughts about where underpriced attention currently lives. It does not live with the big influencers because they all think they're big business people and want half.\r\n\r\n\r\nSo I'm not going to do that, but there are other sources of underpriced attention that I will gladly reap.  I think you're one of the not few people, but there's only a handful that I've actually spoken to who think about their Twitter audience as a means of distribution.  And maybe that's because most people don't get to a size where a distribution model makes sense with their Twitter audience.\r\n\r\n\r\nBut  for you, you have an audience. That can actually achieve some distribution. Why did you pick Sagan? What about Sagan made sense to you? Was it because you were already in it? It  was actually the other way around. So I was, I built an audience before knowing what I wanted to distribute, but I knew that audience was optionality. \r\n\r\n\r\nAnd so I spent two years writing about global talent. I did some advisory work, tried a couple things, experimented. And part of what I was writing about was me trying to find a business model that I thought. Popped and when I finally had it, we went from,  I don't think, I think I've shared enough. We built over a million dollars in AR, ARR after less than a hundred days only off my Twitter  and not like bullshit staffing ARR, like SAS, like ARR.\r\n\r\n\r\nIf you were to go back in time, is this, would you still pick Sagan? Like why global talent? I've devoted my whole career to it. So I left the government and I've spent more time living abroad than I have in the U. S. as and as an adult. And when I think about the through line of Sagan, it's, There are really smart people all around the world.\r\n\r\n\r\nYou should use them to build great companies. And that's been, I was studying Arabic flashcards my freshman year of college, 20 years ago. This isn't something I started getting excited about six months ago. Cause I read some fucking thread. This is who I am. I will do things, global business, international talent for the next 20 years, I've done them for 20.\r\n\r\n\r\nI'll do them for another 20.  Yeah. That's why you're going to win too. You're getting into it because you're passionate about the business, not because of you. Oh, I have this audience. So I fell into a distribution model. What is, if you were to go into some of the metrics for Sagan, what's a lifetime value of a customer? \r\n\r\n\r\nWe don't know our renewal rate yet. We have a lot of things in motion, but we have annual only memberships. So it's at least 12 grand cause that's what our annual membership is. So it's more than 12 grand.  If you were to guess customer acquisition costs, how much does it cost you to acquire a customer? \r\n\r\n\r\nI don't know because I haven't paid for any traffic. It's all, you were going through and like 14, 000 times  the problem, I've tweeted 14, 000 times, like either it's an incredible investment cac or a terrible investment. Cat depends on how you count. It's either zero or a ton. I don't know, \r\n\r\n\r\nOkay. What kind of CAC would you be aiming for when you go to, like you said, some of the underpriced distribution models? Let's say you start going pay per click with YouTube not YouTube, excuse me, Facebook, Instagram, YouTube, Google, et cetera. What are you targeting? I think you'd look at the comps and set.\r\n\r\n\r\nI think you'd look at comps and SaaS, and if we pretend our LTV is 12 grand, roughly speaking in SaaS, 15%, 20% is what you're looking at for cac.  Okay.  Now, obviously if we have renewals. That gives us more CAC to play with and we expect a high rate of renewal based on certain things. Have you started thinking about like, all right, ROAS, what's going to be my return on ad spend?\r\n\r\n\r\nWhat,  how, what channels am I going to go through next? Or are you still in the phase of I've got more business than I know what to do with Twitter? Our currently our Calendly, we onboarded three salespeople today. Currently, my account is booked out three weeks. So I definitely have some opinions and these are not like I want a part time VA there.\r\n\r\n\r\nI run a lower middle market private equity firm and we need to make eight hires over the next year. We're getting referrals from our members. We're getting all sorts of great stuff. So I don't I've, it's what product market feels like our people are buying. They're already renewed.\r\n\r\n\r\nThey're, it's. And when I get some more sales capacity, we have some initial thoughts about what some channels look like, but I don't need to right now. Cause we're, and we have net negative working capital PS. \r\n\r\n\r\nWe get paid membership before we have to incur any costs associated with membership. Oh, so you're charging a hundred percent upfront. It's not like 50 on the backend. It's, we give a disc, we give a discount if they pay fully upfront, which happens very often. We give 10 percent off.\r\n\r\n\r\nSo when they become a customer, they wire us 11 grand day one. We haven't done it yet. What are you doing with that cash? Are you just sitting on it? Isn't treasuries? Or is it just reinvesting into the company? Or like, how do you think about cash management with a company that you're getting cash up front for?\r\n\r\n\r\nWe have a sweep account and all that kind of fun stuff. But for right now, there is a lot of, there is a lot of product improvement that we're working on. So we just launched Sagan university, which is yeah. Free for our members and it's to upskill their global talent And so we're investing a lot of time and resources into product improvement The product's not yet where I want it to be.\r\n\r\n\r\nIt's awesome. But I think we could just put Miles between us and our competitors through some intelligent spending because they're all just derivative our high margin competitors We're just going to chew up and then our knockoffs are just derivative and they won't be able to keep up  Talk about your team a little bit  Do you have an office where your Sagan team works out of?\r\n\r\n\r\nIs everybody a hundred percent remote? Yeah, I guess that's my first question.  Yeah. A hundred percent remote.  We are recruiting team. We've probably got  20 recruiters on our team right now, and they're from eight different countries.  How do you manage? So we get to drink our own champagne. That's awesome.\r\n\r\n\r\nIt's not my partner says don't say we don't eat our own dog food. Say we drink our own champagne. Perfect how do we manage that same as you'd manage any, we have team leaders we have group leads. We have a head of x we have a head of y we have pods, you know I just like you I think I built my operational skill set in way more difficult businesses and so a business that's fully virtual that doesn't have cogs and I don't get sued by the california labor board is like a You know it's a unicorn farting sprinkles.\r\n\r\n\r\nIt's so much better. So I'm assuming too, given your experience, like you're, your whole corporate experience has been remote in some capacity or another, right? Like you're international working for, I can't remember if you work for the state department or one of the other agencies, but working internationally.\r\n\r\n\r\nYour boss, or at least your boss's boss or boss's boss. They're not there. Like you're talking about, I would say above the ambassador. Yeah. Above the ambassador. So working out of an embassy the ambassador is the head of the U S delegation and Tunisia or wherever it is.\r\n\r\n\r\nBut then that person's boss is back in DC. Yeah. When did you launch Sagan? The company launched about a year ago, but Sagan passport, which is the subscription business launched about 95 days ago. Can you give me any numbers? How many people have joined the subscription? What kind of revenues are you doing?\r\n\r\n\r\nThere's  208 people in our school right now.  That's awesome, man. So 208. And if I were looking at that 208, but what's your annual membership? I'm just going to do rough numbers. 500 grand. 12 grand, 12, 000  Samsonite. I was way off. Okay. Two, 200 people, 12 grand. So what is that? 200 and no, is that 2. 4 million?\r\n\r\n\r\nWe're growing very well.  Yeah. I don't get neither confirmed nor denied. That's fine. I'm just throwing out numbers. Okay. 2. 4 million ARR for a business like this, let's just say it's 2. 4 million error.  How is it valued, right? Let's say a year from now, private equity firm comes to you and says, love what you're doing with Sagan.\r\n\r\n\r\nWe want to buy it. Here's the value. Like how would you say it's  with those numbers? You're not confirming or denying that those are the actual numbers. How would this business be valued?  It's above main street. So we get to look at. Juicier multiples. Okay. I think if my partner was a Goldman Sachs investment banker or Lazard, whatever given some of the attributes of our business model A key part of what we're doing is to build serious enterprise value quickly Because of who our customers are  the nature of our relationship with them the nature of our cash conversion cycle So we would  I don't think we would be valued Quite like a SAS, but in the SAS family of valuation, which is a multiple of ARR.\r\n\r\n\r\nSo I would be targeting, I would be targeting 10 times ARR, 15 times ARR. SAS companies, I think the reason that they're I don't think part of the reason they're valued off of AR is because their net margins are so close to their AR, right? Because the overhead that they have is exceptionally low. \r\n\r\n\r\nWhat do your margins look like at Sagan? I will speak about them very broadly.  Perfect. You heard my talk at, you heard my talk at SM bash.  Yeah. About AI and small business. And one of the best ways that you can use AI in small business is to deliver your product at a better price than your competitors. \r\n\r\n\r\nEvery single thing that we do is infused with automation and AI, which puts us in the conversation  with SaaS like margins. That's all I'll say in that we are not a service consulting business. We are infused with a lot of AI and software that if you looked under the hood when we turn off this, and that's part of the reason why I'm comfortable triggering a price war, is because my operating model is so vastly superior to my competitors. \r\n\r\n\r\nFrom a margin standpoint, from a cog standpoint.  Awesome. All right. So I'm going to, I'm just going to pencil in here 50 to 80%. What would you call the industry that you work in? I'll tell you, by the way, I'll tell you when we stop.  P. S. I'll tell you when we stop recording.  Okay. Yes. I'll tell you exactly what the number is.\r\n\r\n\r\nYeah.  Tell me  like cause they're going to be, but we were looking at this man, I'd fricking love to do a business like that, but I don't know anything about global talent. What would you call this industry? Cause it's not SAS. It's not a traditional small business. Is it out outsourced isn't even the right word.\r\n\r\n\r\nIs it white collar  professional services? You could call it productized service  and productized services. Oftentimes our businesses where the software just isn't good enough yet.  That's how I think about productized service. This guy, Michael Greenberg, who handles Gentive Tech, he's Hey, the software's not good enough yet, so I'm gonna, I'm gonna charge more money, put a human there, and now I'm gonna be able to write your newsletter for you.\r\n\r\n\r\nOne day, the software can write your newsletter, but for now, I'm gonna create a productized service that delivers you five newsletters a month.  That's what Vivaldi is. The software is not yet good enough, but product is my service. Yeah. So five years from now let's just say currently Sagan is 2 million business. \r\n\r\n\r\nAre there industry tailwinds? Where do you think you are five years from now with this business?  I think we've been Acquired by a strategic who uses our member network to distribute other products,  given the nature and the scope with which our relationships have developed with our membership and the affluence of our members our membership model allows for  absolutely incredible.\r\n\r\n\r\nCross pollination of things like software, things like CRM, things like, like we would be we probably wouldn't be a good target for HubSpot, but we're probably too small, but, or there's not enough customers is what I mean. The customer base isn't big enough, but something like consulting shop or something like that would see us as a, basically that's how I think about it.\r\n\r\n\r\nThat's where I think we're at. Somebody buys us for our relationship with our members.  Yeah. The other thing I'll tell you, the other big thing I'm betting on that I've talked about a lot is, I think global talent is a predecessor to automation and AI. We talked about that in the talk. And so I think that, There are going to be venture backed companies that want to use our distribution to push automation and AI because we already have a relationship where we're helping them document processes.\r\n\r\n\r\nWe know who their CSRs are, so a company that has a AI CSR solution is going to look at us and say overnight we can use their distribution and their relationship to bring our. AI CSR solution to the main street.  So for the people who are really stupid, I know what CSR means, but for like stupid people,  what does CSR mean?\r\n\r\n\r\nCustomer service rep person who answers. All right. All right. So when Salesforce finally has a good enough voice model to answer the phone for small businesses, they're going to go shit, I need to go out and find people And I'm going to be like, Sagan helps people hire CSRs. We help them build their processes with CSRs.\r\n\r\n\r\nWe have this super consultative relationship. We, I'm going to buy them and I'm going to push my AI product through this distribution channel.  That's what I do it.  All right. So before we look at some businesses, I'm going to ask you. A couple of rapid fire questions.  You ready? Do you need me to do one more button or undo one more?\r\n\r\n\r\nYou know what?  Do one more. How's it feel? Do one more. I don't want to what do you love about this business?  Net negative working capital. It's the best thing that's ever happened since the birth of my son.  What do you hate about it? All I think about is distribution growth.  What keeps you up at night?\r\n\r\n\r\nFinding a way to put capital to work effectively.  Interesting. Because you're sitting on so much cash because of that net negative working capital or.  Interesting.  You get a huge spike in valuation. You show you can put capital to work.  And I do not yet have a scalable solution.  Dude. That's fascinating.\r\n\r\n\r\nOkay. Name a person on Twitter  that you hope to be like in five years.  Co founder neck. \r\n\r\n\r\nYou, you achieved that already five years ago. Okay. Last question. What are you obsessed? You know why? You know why? You know why? Oh, you know why? No. Cause you're sucking up to me. I don't know. I'm jealous. I want more kids.  Oh man. We've John. There's too many, man. I'm jealous. I made a mistake.\r\n\r\n\r\nJealous.  Okay. What are you obsessed with right now?  It could be anything. It doesn't have to be work related. If you had a two hour stretch where you knew you weren't going to be doing anything and you could do whatever you wanted.  Getting back in shape, probably I've sacrificed my body at the altar of entrepreneurship.\r\n\r\n\r\nI used to be a collegiate athlete and now I just, what did you get out of breath? You know? I played. College baseball, then I did triathlons and then I was a sponsored CrossFit athlete. What's funny is I didn't start going to the gym regularly until I was 34,  32. And but I was always an athlete.\r\n\r\n\r\nLike my dad was a professional athlete. I love playing sports.  And I woke up one day and I was like, I'm getting winded wrestling with my sons. This is not a good situation. So  I get it. Yep. That's that's my current focus is how to layer in my,  my, when I have two open hours in the afternoon, rather than start another business or try out a new distribution channel to go work out, go on a walk.\r\n\r\n\r\nYeah. And that's really hard for me because I'm an addict. I am too. I am too. All right. So I want to look at a couple of businesses with you. I think this will be fun. I'm going to go to biz by sell. And first I'll share my screen. Yeah. Can I tell you, and I actually will be open to your opinion on this. \r\n\r\n\r\nIs that okay? Yeah. I think that there is an opportunity to acquire people at very, at low multiples. Keep management in place and use their existing B2B relationships to distribute my product.  So there is a crappy staffing firm out there that you can buy for two times SDE, leave the guy in place on an earn out, and the only reason you buy him  is to, he's got 75 B2B relationships and I know that if I can convert 10 percent of those into passport memberships,  I'm in the black and I think you could do that with digital marketing agencies.\r\n\r\n\r\nI think you could do that with staffing. My acquisition to build distribution.  My friend, you are talking to someone who's owned two staffing companies. Would that work? That's a really interesting, that is a really interesting idea. I own healthcare staffing companies.  Obviously they're not pretty supposed to use Sagan because  their staffing is clinically based.\r\n\r\n\r\nWe work with some of the biggest hospice care providers in the Northeast. We work with a ton of them because they use us for their back office.  Interesting. So you're thinking of if there was a staffing company and this guy has 75 relationships with other businesses, that's potentially a distribution model for Sagan to cross sell.\r\n\r\n\r\nHey, I know I've helped you find some in home health aides. How are you guys answering your phones?  And they've already tested this. They already they already have relationships with people who they, you, who for through via staff augmentation, it's not a difficult bridge to cross that into high margin little town. \r\n\r\n\r\nDude, that is, that's really interesting. Have you tested it yet with any companies?  No, because what we did, we, I've looked at some reseller relationships, which we could white label and then they sell it, but I've actually, I it's hard to they're uncreative, frankly, where I could do it, they're just a pain in the butt, I'd rather just go grab like a small franchisor,  go buy a small franchisor who's got 23 locations, buy Okay.\r\n\r\n\r\nMinority could be majority, whatever, keep management in place. You could finance that transaction and then say, there's a new thing in the briefcase, guys fly to headquarters. We're going to teach you how to sell global talent. Here's our referral relationship with each of you. It's another skew. You already have the relationships with all these people and I can buy my way to distribution using capital.\r\n\r\n\r\nThat's I've been chewing on it. I haven't come up with the final version of it, but that's how I put capital workers start buying distribution.  So let's, we can look at some companies like that if you want. I'd be interested in your perspective. Yeah. Yeah. Okay. Okay. Good. Let's do it. So I'm going to share my screen. \r\n\r\n\r\nHow would he being though? I do not want to buy a 600 K SDE staffing business. I'd rather jump off a cliff. Let's be very clear. All right. Let's go to some filters. I'm going to just gonna say businesses that have been added in the last 30 days. So tell me a minimum cashflow that you want.  I want to keep management in place.\r\n\r\n\r\nSo probably a million bucks,  a million dollars. Perfect. I'm just going to hit apply.  We could pick some industries. Let's see here,  or let's just look  home improvement giant. No  turnkey. No, not a restaurant wholesale distribution. No  profitable direct lending and real estate investment services. This could be interesting. \r\n\r\n\r\nLet's open that first. Let's we'll hold that for a second. Amazon marketplace facilitator. These catching your eye personal home care for older adults, pre engineered metal building, erection, can you search by sector? Can you do services? \r\n\r\n\r\nDoesn't allow \r\n\r\n\r\nme. Let's just choose one of these. Let's choose which of these financial pet golf cell phone. I. T.  How about How about it and software that could work? All right. I think you'd also do  it with marketing. There's  only two in the last 30 days. This is a SAS platform for sales performance management,  2.\r\n\r\n\r\n5 million in cash flows, 15 million asking. This one is a well positioned to serve managed service provider. Ooh.  Oh, I like that. A million dollars in cash flows, 3. 9 million asking. \r\n\r\n\r\nDo you want to look at this one or just go to the other one?  Nah, I wouldn't like this one. That looks like B2C.  All right. So well positioned service provider. It's in Virginia says it's relocatable  asking prices 3. 9, about four cash flows, a million gross revenues are 4. 3. 25 percent net margins.\r\n\r\n\r\nThat's pretty good established in 20, 2003. So it's been around a while. It's got 21 employees.  It looks like the owner is.  I'm just going to say the owner is retiring. They're willing to stay on for a small period of time. They're willing to offer 10 percent owner financing. So for a business like this,  good size, it's got more than enough cash flows for you to either hire or keep existing management on  what would be like, what's your next question or thought on a business? \r\n\r\n\r\nWhat is the profile and quantity of their B2B customer base?  Let's say that this was a, this company just did government infrastructure and they just worked on like schools, hospitals municipal buildings, those types of things. Let's say those are their customers. Any interest? If it was laid out under the thesis that you and I discussed about me buying distribution, then it's a pass. \r\n\r\n\r\nIn that case, agreed. But if it's,  if they have 200 main street and lower middle market businesses that they do offsite data management and web hosting, and they have 200 of them with outside sales force and a couple channel partners.  And I think I can ride along the back of that distribution.\r\n\r\n\r\nThen I would keep going as a counter. I've seen government in here like four times. So I'm assuming it's more of a government business. So for you, if it's government though, it'd be a pass. Why would it be a pass? Because I can't sell global talent to government.  Really? Maybe you can. I'm not familiar with it. \r\n\r\n\r\nI have product market fit and it does not include government currently. Somebody might be able to, but just not me.  Let's try. If I was going to add one thing  in a different life, there is absolutely an opportunity for somebody else to buy that company. It's fully remote and essentially juice it by taking 50 percent of its FTEs, moving them globally, adding 600 K to its adjusted earnings and selling it in 36 months.\r\n\r\n\r\nThat is absolutely a great strategy.  I'm just staffing agencies. Let's look and see if there's any staffing agencies that have come for sale. Oh, profitable medical staffing agency in Connecticut.  1. 8 million in cashflow is 4. 5 asking price.  You want to take a look?  Sure.  It's loading. \r\n\r\n\r\nYou're from New Jersey, right? Is that right? Yeah, I grew up there.  All right. Gross revenues, 2. 3 cash flows, 1. 9 medical staffing business, lots of established contracts.  The. Reason for selling can ask owner. Cool. That's a great reason. Only five employees. That is interesting. They only have five employees.\r\n\r\n\r\nThey're all 10, 10, 10 99. That makes sense. That makes sense. Okay. So their back office is all dude you're literally asking me, you ran a medical staffing company. I have no goddamn clue.  You're asking me, I don't know.  What do you think? You ran a medical study. I don't know. Would this be of any interest for you to buy and integrate? \r\n\r\n\r\nMedical staffing seems scary to me. I think in order for this cross pollination strategy to work, I have to believe that the acquisition can stand on its own. I can't rely on me cross selling to make it worth it. And I wouldn't want to own a medical staffing company. It would have to be ownable enough on its own, and I'm like, Yep.\r\n\r\n\r\nI can do okay with this. I'll do fine. I don't really know medical staffing, but then as the booster, what makes all the butt pain worth it, then I have to see a path to cross selling. But if it doesn't stand on its own, I don't want to like,  I don't want to, I don't want to subsidize it with my cross selling mental masturbation.\r\n\r\n\r\nMatt's nervation risky.  Yeah, Masturbation. Did you see my master margin munch cereal? That was your idea. Dude is amazing. Are you gonna start producing it?  Dude, I have a graphic designer on staff. So any dumb idea you have Just tag me on Twitter and bang three hours later. We got master margin munch. \r\n\r\n\r\nOh, dude. That is such a good one master I'm the margin muncher I freaking love it. Okay. Dude, this was a jam packed action packed 35 minutes. Thank you for joining me. If people want to come find you where do they find you? Where's the best place? Generally speaking, I recommend following co founders Nik on Twitter.\r\n\r\n\r\nHe subtweets me a lot and via his profile. You can then find me. Yeah, I'll find you. That's what I would say. All right.  All right, man. This was awesome. I can't wait for us to do this again.  Pleasure.  See ya.",
  "metadata": {
    "duration": "",
    "date": "2024-05-23",
    "platform_source": "Google Drive"
  }
}