{
  "episode_number": "128",
  "episode_title": "How a Family Business Scaled from Local to National Retail (6000 Stores) with Andrew Johnson",
  "guest_name": "Andrew Johnson",
  "business_name": "Good Foods",
  "transcript": "﻿Nikolas Hulewsky (00:00.11)\r\nuntil it uploads, but we'll be good. All right, Andrew, I'm super stoked to have you. And the reason I'm so happy is because I saw a story, I don't remember where it was, it was on Reels or Instagram or what, there's too many platforms at this point, but it was of you and your dad. And I'm gonna butcher it and then I'm gonna let you correct me. But it was essentially the story of your company, Good Foods. Your father was a project engineer. He ended up leaving that company, starting this brand, he grew it.\r\n\r\n\r\nAndrew Johnson (00:03.784)\r\nGosh.\r\n\r\n\r\nNikolas Hulewsky (00:29.258)\r\nover a number of years, eventually you came into the business and started working your way up. And then during COVID, you guys expanded from sort of a niche offering in 200 stores to like a few thousand, I think 4,000 is the number in my mind. I might have to go look at the post again. And then your dad passed away, I think recently or within the last few years. And now you're running the business as a family-owned business.\r\n\r\n\r\nAnd I just, saw that story and it resonated with me because I have four little boys and I just thought it was so beautiful to see this father son history, a period of time of building that business. Did I mess it up? Was that, is that like broadly speaking, the brand story?\r\n\r\n\r\nAndrew Johnson (01:10.996)\r\nNo, that was a good summary. I would say, you know, we've been around for 20 years. So even that post, you know, it was tough to get every detail. But yeah, my father started in pharmaceuticals. So long story, very long. My mom was a microbiologist. And so my mom was a microbiologist on the pharmaceutical side. So, mean, you know, science lab, right, right, right.\r\n\r\n\r\nNikolas Hulewsky (01:13.272)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (01:18.862)\r\nFor sure.\r\n\r\n\r\nNikolas Hulewsky (01:35.384)\r\nSo your parents are pretty dumb. Yeah. jeez.\r\n\r\n\r\nAndrew Johnson (01:40.82)\r\nSo she's in the lab. She originally started out, you know, lab coat, you know, formulating different drugs and testing. But they both worked at Abbott. That's kind of how, where they met in Columbus, Ohio. And so the story goes is that both, both Ohio born and raised and Abbott said, Hey, you know, we want my mom to relocate.\r\n\r\n\r\nNikolas Hulewsky (01:51.534)\r\nMmm.\r\n\r\n\r\nAndrew Johnson (02:04.914)\r\nAnd my mom said, well, you know, my husband is also on the sales side. So my dad was more, he's a salesman at heart. Entrepreneur at heart was selling, you know, doing car washes, you know, early on, five years old, going up and down the block, you who needs a car wash? So he, he had that spirit. He's a hustler, you know, but definitely a sales guy. You know, so she was everything under the book and we'll get into it. But so the story kind of goes, they both relocated to Chicago.\r\n\r\n\r\nNikolas Hulewsky (02:21.196)\r\nHe's a hustler. Yeah.\r\n\r\n\r\nAndrew Johnson (02:33.84)\r\nAnd my dad, if you remember in the early 90s, I know you're a little bit younger, like in my generation, but you you probably grew up on insure and Pedialyte, short formula, right? So most 90s babies did and 90s kids. So my dad was part of that launch. And so he was the regional sales director for Abbott. And so as most people at their jobs feel undervalued at some point, right?\r\n\r\n\r\nNikolas Hulewsky (02:43.781)\r\nyeah. Yeah.\r\n\r\n\r\nAndrew Johnson (03:01.072)\r\nstory kind of goes is that he was part of their launch where they, you know, they were initially doing a couple hundred million, but that product, that CPG retail side of the business hadn't grown. You know, they were really more B2B selling to doctors, hospitals, but when they launched Pedialyte, which kind of competed with Gatorade and then the Insure formula, the company took off. And so he didn't really feel like he was valued in what he had brought to the table as far as helping their sales growth.\r\n\r\n\r\nAnd so at a certain point he said, look, I've gone to all these stores for you guys. I'm representing you. I know all these people now. I got the contacts and you know, the Costco's and Albertsons and why can't I just start my own business? Right. And so, and it also went along with, me being a kind of a local football guy. And I guess probably junior year, got honorable mention all state and he had missed a bunch of games just from him traveling around.\r\n\r\n\r\nNikolas Hulewsky (03:45.646)\r\nRight.\r\n\r\n\r\nAndrew Johnson (04:01.364)\r\nAnd I'm in the North Suburbs of Chicago, right? So this is a basketball state, so it's not that impressive, okay? being a football player in Chicago is not a huge deal, but I wanted to see more games. Sorry.\r\n\r\n\r\nNikolas Hulewsky (04:06.707)\r\nHahaha!\r\n\r\n\r\nyou\r\n\r\n\r\nWhen was, time frame, when was this? So junior year high school probably would have in late 90s or early 2000s?\r\n\r\n\r\nAndrew Johnson (04:20.98)\r\n2000 yeah 2004 2004 yeah\r\n\r\n\r\nNikolas Hulewsky (04:23.63)\r\nOkay, so your dad's working at Abbott. This launch goes really well. And he's kind of like, cool, I think you said in the post, I'd have to go look. was like, what was the reward he got for like a billion dollar launch?\r\n\r\n\r\nAndrew Johnson (04:38.802)\r\nYeah, so the story is, so he started in 86. So he was with them for a long, they treated him well. And sometimes in the story people get that twisted. They're like, man, they did it wrong. They were compensating him fairly well, cause he would have left a lot sooner. But when he kind of started doing the math, it wasn't math. And yeah, he got a, at his highest compensation, we would go on these Al Capoco trips. They would send them on.\r\n\r\n\r\nNikolas Hulewsky (04:49.133)\r\nYeah.\r\n\r\n\r\nAndrew Johnson (05:06.196)\r\nAnd he would get his little bonus check, like $10,000, know, 15,000. And then we, cause I grew up going to Al Capoca. I never knew why. Like that was like the vacation spot. Now I realize it was cause that was his bonus, right? From work. Yeah. And I love Al Capoca. Like one of my favorite cities, unfortunately, you can't really travel there now. But so he, at a certain point just said, Hey, I'm, I'm not really getting compensated. And he'd always wanted to start his own business. That was the other, you know,\r\n\r\n\r\nNikolas Hulewsky (05:10.018)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (05:18.668)\r\nBut work, yeah, work was sending in there as prize. Yeah, yeah, yeah.\r\n\r\n\r\nAndrew Johnson (05:35.892)\r\naspect of it and so at a certain point with the combination of him not seeing my games and wanting to sort of control his own hours he said hey I got enough so it's about coming to like 2001 ish and so that's when he officially quit Abbey and then he started coming to more of my games probably sophomore year he started seeing more games 2003 2004 and then that's when he launched the business so mind you like he's a regional sales rep one of the top pharmaceutical companies in the world\r\n\r\n\r\nBarely, I never saw him but it was weekends because he's on the road all day all week So I'll go from like barely seeing him now. He's like, you know, he started off you open up his house He's there all the time like then you break, know, but it was cool, know seeing him a lot more But you know, you know, goes father's home relationship. So see you don't appreciate it's older, you know,\r\n\r\n\r\nNikolas Hulewsky (06:17.41)\r\nHe's there too much.\r\n\r\n\r\nNikolas Hulewsky (06:27.79)\r\nYeah. Yeah, you went from him being an absent dad to all of a sudden he's like Archie Manning or Lamar Ball. It's just you're like, you're here too much,\r\n\r\n\r\nAndrew Johnson (06:37.02)\r\nI was just gonna- LeVar Ball like- before LeVar Ball- Yeah. And yeah, I'm sure they would've got along if they ever met, but\r\n\r\n\r\nNikolas Hulewsky (06:46.045)\r\nGive me an idea today if you can. I don't know what you can share, what you can't. Just like the size of good brands. So I know you're in 6,000 stores. Can you give me an idea of like number of units sold per year or top line revenue per year or number of employees? Like what does that mean for the size of the business?\r\n\r\n\r\nAndrew Johnson (07:04.84)\r\nWell, I'll tell you this. now as far as the number of employees, a lot smaller at our peak, you know, we had eight or nine on the staff. probably two admin, three sales reps, and then me, my father, and then a full-time marketing intern, which we were kind of rotate, based on availability. But it was all, it's always been, you know, my dad's whole philosophy.\r\n\r\n\r\nNikolas Hulewsky (07:17.422)\r\nMm-hmm.\r\n\r\n\r\nAndrew Johnson (07:33.364)\r\nAnd hopefully your followers can appreciate this, is keeping your liabilities low. so, know, us being a, so he, so he, you his history in pharmaceuticals kind of led him to win this contract with the government agency in Chicago called WIC, Women and Infant Children. If you're familiar with that, so if you have a child that's at the age of four.\r\n\r\n\r\nNikolas Hulewsky (07:51.244)\r\nYep.\r\n\r\n\r\nAndrew Johnson (07:54.856)\r\nyou can redeem these coupons. But in Chicago, they have these actual grocery stores, like almost like an Albertsons type of chain, 25 centers. So like imagine you go into Albertsons and everything on the shelf is coming just from us. So we call it the golden, yeah. So we call that area the golden age of good foods because as you, if you know about retail, you know, we don't have to put any markdowns. It's just kind of more showing up to the donation events, showing up to the fundraisers and you kind of get the business. So.\r\n\r\n\r\nNikolas Hulewsky (08:23.692)\r\nYeah, I mean, that was the contrast I was like trying to draw is like, okay, cool. You guys have grown and expanded to where you are today. But when you're, when he was jumping out, yeah, he had some relationships, but he was starting this business from scratch, right? Like, did he know he was going to do food? Or was it like, I\r\n\r\n\r\nAndrew Johnson (08:40.116)\r\nYeah, he knew he was gonna do food because just being his background and healthy food too, especially, being a, and he dealt with WIC obviously being in the baby formula side of Abbott. So it was gonna be along those lines. But initially, you know, he started out selling Eda's, this brand called Eda's Sugar Free Cookies. So 2003,\r\n\r\n\r\nNikolas Hulewsky (08:45.56)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (08:52.174)\r\nMm-hmm.\r\n\r\n\r\nAndrew Johnson (09:04.498)\r\nHe had made these contacts. So Eda's sugar free was like his, he was a broker. So the company started out as a brokerage firm. So the good brand.\r\n\r\n\r\nNikolas Hulewsky (09:11.158)\r\nOkay. What does that mean? Like how does that work? The brokerage.\r\n\r\n\r\nAndrew Johnson (09:15.004)\r\nIt's like, so we were a broker slash distribution company. So basically we were the rep for the brand. So it's like an extension of their sales team commission based only. So we would, because of my dad's relationships he had with the stores, a lot of brands can't get into it. So I use brokers now to this day are distributors. So we had the contacts, they had the product. So what they would do is hire us as the sales rep. We would go to headquarters, make the call, make the sale, manage the account.\r\n\r\n\r\nNikolas Hulewsky (09:22.318)\r\nSo the brand.\r\n\r\n\r\nNikolas Hulewsky (09:27.213)\r\nAndrew Johnson (09:45.202)\r\nyou know, do the promotions, you know, whatever needed to be done. And then we would get a commission, you know, based on.\r\n\r\n\r\nNikolas Hulewsky (09:52.974)\r\nWhen and how did he like when and how did he decide like okay cool I'm selling sugar free cookies. I'm gonna go into I Don't know what what was the first product that you guys started selling?\r\n\r\n\r\nAndrew Johnson (10:03.76)\r\nunder our brand. So yeah, so he did eat a sugar-free cookie. will you, I'll just let you know this. You could probably appreciate this. So we had the eat a sugar-free contract. Then he randomly, randomly was in Scotland at St. Andrews golfing, okay, with his buddy. He's golfing behind\r\n\r\n\r\nNikolas Hulewsky (10:05.101)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (10:24.91)\r\nOkay.\r\n\r\n\r\nAndrew Johnson (10:28.468)\r\nthe largest butter cookie factory in the world called Jacobson's Butter Cookies. So if you ever go, if you, if you ever like go into see those blue tin Danish butter cookies, we were the sole representative all North American accounts. literally he's golfing behind the owner, Jan Jacobson. And you know, if you knew my dad, he's someone who's just going to start talking. You're going to let you know what he does. That's just him in spirit. Very charismatic gentlemen. And so\r\n\r\n\r\nNikolas Hulewsky (10:37.068)\r\nYeah. Yeah.\r\n\r\n\r\nAndrew Johnson (10:57.588)\r\nThey kind of learned about his credentials, his history at Abbott. He had already gotten his own business going as a rep, sugar free cookies. So like, hey, you want to represent all the North American accounts? Because they're out, you know, they're on Denmark. So he got that contract. Then from there, we want, he won a government contract to supply the WIC centers. So that's now we're fast forwarding to like 2006.\r\n\r\n\r\nNikolas Hulewsky (11:11.821)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (11:20.366)\r\nAnd what was he supplying to the WIC centers? Was it these cookies?\r\n\r\n\r\nAndrew Johnson (11:23.346)\r\nSo when I say everything in the grocery store, like we were talking about going to Albertsons, dairy, eggs, produce, canned fruit, frozen fruit, milk, baby formula.\r\n\r\n\r\nNikolas Hulewsky (11:35.99)\r\nOkay, I'm an idiot. So I know what WIC is. worked, one of my first jobs was in a grocery store, right? And I was a cashier. And so we would get people, you have to qualify it's income based women and infant children. But you're not necessarily buying everything under the sun. It's very specific. It's like two gallons of milk, two dozen eggs. Like it's almost like it spells out what they're buying as opposed to the dollar amount that they can just spend on whatever they want. But like I get him becoming a rep. That makes sense to me.\r\n\r\n\r\nAndrew Johnson (11:42.612)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (12:05.516)\r\nCool, now I'm selling for these companies who don't have distribution. How does he all of sudden win the contract for these WIC stores to supply everything? It's not like he's doing one thing. does he get that contract first and then he's got to go find suppliers to fulfill the contract?\r\n\r\n\r\nAndrew Johnson (12:19.624)\r\nYes, yeah, so it kind of went like him just touring the country, man. Toured every farm from California to New York, every supplier, every small farm to large farm, conglomerate. went, I eventually, well, mind you, so I'm just graduating high school, probably in college, but I did start going with him to like some of the farms, but he did a lot of that on his own, you know?\r\n\r\n\r\nNikolas Hulewsky (12:28.664)\r\nnowhere.\r\n\r\n\r\nNikolas Hulewsky (12:32.321)\r\nDid you go with them?\r\n\r\n\r\nNikolas Hulewsky (12:43.246)\r\nMm-hmm.\r\n\r\n\r\nAndrew Johnson (12:46.492)\r\nAnd then he, you know, I had to work my way up, you know, we get to it, but I started taking the trash out. I didn't just come in, you know, I was the owner's son, as you know. So it's like, you gotta have some type of order, right? You you got these, you got some old times.\r\n\r\n\r\nNikolas Hulewsky (13:02.222)\r\nBut so how did he get the contract? It's like if he...\r\n\r\n\r\nAndrew Johnson (13:05.652)\r\nSo man, that's a whole like story. And you know, might have to talk about that offline. But you know, it's all networking. So he was, he had gotten, he was dealing with a lot of these folks through Abbott, right? So the same guys, he was selling the insure formula for Abbott, he had built a connection with, right? Especially in the early 90s, you know, when they were throwing money at these guys, right? You could take the buyer.\r\n\r\n\r\nNikolas Hulewsky (13:09.6)\r\nLet's hear the story. okay. Okay. All right.\r\n\r\n\r\nNikolas Hulewsky (13:18.2)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (13:23.341)\r\nMm.\r\n\r\n\r\nAndrew Johnson (13:35.706)\r\nuse the Abbott, you know, budget, fly them out here, fly them there, you know, going to the Bulls games. So he had used a lot of their funding naturally to build these relationships. Then when he started his own company, he circled back around, you know, so you gotta, you gotta imagine he was in front of all the top guys through Abbott. So he kept the relationships, which is huge, as you know. And then when he started his own business, he circled back around everybody. Hey man, I got my company.\r\n\r\n\r\nNikolas Hulewsky (13:59.917)\r\nYeah.\r\n\r\n\r\nAndrew Johnson (14:05.022)\r\nthere any opportunity with you. So that's that's really it.\r\n\r\n\r\nNikolas Hulewsky (14:07.278)\r\nYeah, what I think is interesting is there are a lot of entrepreneurs who get to the place where your dad was. And Ava didn't treat him bad, right? They treated him well. They sent him to Aquapoco every year. They gave him some bonuses. I'm sure he had a good salary. But you get to this place where you're like, man, I'm adding so much value to this company. I think I could do this on my own, right? That's the moment. It's not.\r\n\r\n\r\nAbbott's treating me terribly, right? It's like, no, I know I can add more value than I'm currently creating for myself. And so he jumps out and he leverages his network, right? Like some people have very specialized skills. Maybe they're an engineer or maybe they have a patent. I don't know. Or maybe they're a biologist like your mom, microbiologist, but he's like, Hey, I have this network. And so then he goes and dives into it and leverages it. And all of a sudden, I love the St. Andrews story, man. He's just golfing and strikes up a conversation. And all of sudden he's the distributor for the largest butter cookie.\r\n\r\n\r\ncompany in the world, but I just love the way that he sort of transitioned into the business where it's like, okay, this is my skillset. This is my unique value prop. I'm going to go ahead and leverage it and whatever I can get, if I have to supply the WIC stores, I'm going to supply the WIC stores. We're going to go that way. When did you get into the business? What did the business look like when you finally were like, all right, that I'll take out the trash. I'm ready to come work for the business.\r\n\r\n\r\nAndrew Johnson (15:25.938)\r\nYeah. So I probably got in, you know, so when he started, like, I mean, I was with him every step, like from the first office building that, he got his, he opened up his little office space at, but it was never full time, you know, he'd be like, Hey, come to this little event with me. So, you know, we could show that we're a family and before he started getting reps, you know, and getting his team together.\r\n\r\n\r\nNikolas Hulewsky (15:47.502)\r\nMm-hmm.\r\n\r\n\r\nAndrew Johnson (15:50.804)\r\nSo I was always somewhat involved on a very, very small scale, no impact at all, just more like, hey, I got another guy helping me maybe set up the booth at the WIC exhibition to get approved in all the states, something like that. probably full time, man, I was doing my own thing for a while. I tried to start a radio app one time. and somebody's out of college doing a radio streaming app for independent artists in Chicago.\r\n\r\n\r\neverybody and their mom was trying to get into music in like 2013-ish and that failed. I'm like, and I saw my dad sort of like grow into retail and it kind of got fun, you know, because, you know, when you're young, you're looking at them, like the government contract, that sounds cool now and very impressive, right? But as a kid, you're like, I don't care, dad. Like, I don't know what that means, you know? So he got into Walmart.\r\n\r\n\r\nNikolas Hulewsky (16:35.094)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (16:39.022)\r\nYeah, you're not telling your friends, you're not gonna be like, hey guys, my dad just won this government contract. It's pretty cool, huh?\r\n\r\n\r\nAndrew Johnson (16:47.028)\r\nThat's all that now they're like, dude, that's amazing. You know, cause we're older now, we're in business, we're involved. But he got into Walmart. That's when really like it lit up and me and my sister were like, that's cool. I know Walmart. I go to Walmart all the time. This sounds cool now. And so I probably started.\r\n\r\n\r\nNikolas Hulewsky (16:59.406)\r\nMmm.\r\n\r\n\r\nWhat was the product that got him into Walmart?\r\n\r\n\r\nAndrew Johnson (17:05.17)\r\nSo I'm kind of bouncing around, but so long story short, like you said, everything has been serendipity. He never did any business before he got the opportunity first. So it was all based on demand. There was never a time where he's like, all right, I want to do cans. I want to do frozen. He was like, hey man, I can get in contact with anybody. What do you need from me? And I'll go get it. So.\r\n\r\n\r\nNikolas Hulewsky (17:30.445)\r\nInteresting.\r\n\r\n\r\nAndrew Johnson (17:30.708)\r\nDid the WIC contract came and then basically what happened was one of the items that we were supplying for WIC which was canned food So it can beans canned vegetables and canned fruit at a certain point He said hey, I'm gonna just brand this stuff under my own because I know all the farmers and the suppliers And I've built this relationship. Why don't I just start this good brand and so in Chicago? The Albertsons stores are called Juul Asco so Juul\r\n\r\n\r\nthrough some connections. had grown up with the president's son just randomly playing sports and just up in the North. But my dad was also connected. know, he's one of his best friends. He's a big time broker. it's, it all, there's a bunch of moving factors, but long story short, they found out he was a local guy.\r\n\r\n\r\nAnd they're like, hey, why don't you bring your products in? And he said, you know, put up a billboard on 994 and we'll give you full distribution. So my dad put up a massive, this is before social, right? Like right when Twitter was popping off. So my dad puts up this massive billboard on 94 and then one on 90, which is like some major highways in Chicago. And then he's like, just make sure you say that it's at Juul Osco. So that's how he got in. You see, he put up these two billboards, said we're at Juul.\r\n\r\n\r\nNikolas Hulewsky (18:27.18)\r\nYeah.\r\n\r\n\r\nAndrew Johnson (18:44.404)\r\nSo the best how the good brand started and then the good brand started, you know We started slowly instead of just supplying other people's stuff. The brand was building through wick So people were seeing it in there then they were seeing in retail on the local side so canned beans and canned vegetables was the first item under the good foods brand and Yeah, and he was kind of just trucking along but the business was always majority government and so\r\n\r\n\r\nNikolas Hulewsky (19:09.419)\r\nHe\r\n\r\n\r\nAndrew Johnson (19:13.658)\r\nEven to this day, like people seeing us in these five, thousand stores now. And they're like, I'll get a comment or I'll see my sister will tell me there's a message like, man, I didn't know you guys are retail or like, I didn't know this is a real brand. They all think it was a government item, you know, the U S the country owns. They're like, wow, you guys in stores now, this is, there's a family business, you know? So it's pretty cool seeing it full circle, just us being around 15 years. People have grown up on it. Now they're adults.\r\n\r\n\r\nNikolas Hulewsky (19:27.67)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (19:31.767)\r\nYeah, yeah, yeah, yeah.\r\n\r\n\r\nAndrew Johnson (19:43.124)\r\nYou know, they grew up on WIC redeeming it and now they're adults like buying us in retail, you know, full circle.\r\n\r\n\r\nNikolas Hulewsky (19:49.208)\r\nSo he was always just a problem solver. It's like, hey, you have a need? Cool, let me fix that. And he just built up these relationships over time and eventually got to the point where he's like, I know these farmers, I know these manufacturers, we could white label this. Like we could just sell this through our own brand. And he started doing that. What year did the good brand start?\r\n\r\n\r\nAndrew Johnson (20:00.274)\r\nYeah. Yeah.\r\n\r\n\r\nYeah. Right.\r\n\r\n\r\nAndrew Johnson (20:08.884)\r\nSo the Good Brand probably started in 2008. 2008-ish, yeah. we were, yeah good. So yeah, so I was just, so we were still majority, majority of the revenue was government. And that probably didn't change up until really the pandemic.\r\n\r\n\r\nNikolas Hulewsky (20:12.31)\r\nOkay. And no, no, you go.\r\n\r\n\r\nAndrew Johnson (20:30.012)\r\nAnd so we were kind of trucking along, still just moving along with WIC. So we were the sole supplier. Then over time, as you know, relationships fade, new buyers come in. And so, especially that, it's really not about how much you can sell. It's more about the relationship, you know, when the government's had. Because they can go and get their own guys. Everyone's trying to get those contracts, you know. So, without throwing anybody under the bus, you know, it's ruthless out there, you know.\r\n\r\n\r\nNikolas Hulewsky (20:47.886)\r\nSure.\r\n\r\n\r\nNikolas Hulewsky (20:57.912)\r\nSo you ended up losing the government contract essentially at some point.\r\n\r\n\r\nAndrew Johnson (21:01.202)\r\nYeah, over time, it just kind of started, well, they got better prices here. And then, and then we were like, you know, as I got into it more, I'm like, yeah, we got to focus on the good foods brand. And then, and then it got to a point where, you know, especially, know, about the WIC items, people wanted to see brand. They didn't want to feel like they were going to like a government contract WIC agency. They wanted to feel like they're going to Albertsons. So they're like, well, we want to see the big brands in here.\r\n\r\n\r\nNikolas Hulewsky (21:04.238)\r\nYeah.\r\n\r\n\r\nAndrew Johnson (21:28.658)\r\nSo was like at a certain point I was like, we gotta just focus and build up good foods brand. So they can't say, well you guys are only in just a couple Chicago stores in the Chicago market.\r\n\r\n\r\nNikolas Hulewsky (21:37.966)\r\nWhat year was that that you were like, hey dad, we should go into these other stores. We should really try to expand our footprint.\r\n\r\n\r\nNikolas Hulewsky (21:49.186)\r\nWhat was his, and what was the response there? Like, did it make sense to him or was it, was he stubborn? Like, was he like, yeah, Andrew, trust you. Let's do this thing.\r\n\r\n\r\nAndrew Johnson (21:58.044)\r\nYeah, he was stubborn, but he trusted me too. Because he's a salesman, not a marketing guy. So he was like, you know, if I could sell it, I'm in, but you know, I got to do the branding and the marketing. That was never like a huge deal to him. But he saw the opportunity, there was extra revenue, but he was always government contract first. Because, you know.\r\n\r\n\r\nNikolas Hulewsky (22:09.858)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (22:15.426)\r\nSo who came up with the good brand then? Was that you? okay.\r\n\r\n\r\nAndrew Johnson (22:18.218)\r\nthat was my dad. No, that was all my dad. He came up with a good brand. He was talking with his lawyer. He's like, I want to have the word good in it. And of course they couldn't find any name that was already not used. they're like, I guess the story goes, lawyer, the lawyer said, why don't you add an E at the end and make it silent, you know, and you can still use good. So that's literally how it started. That's good food.\r\n\r\n\r\nNikolas Hulewsky (22:38.434)\r\nHahaha\r\n\r\n\r\nThat's awesome.\r\n\r\n\r\nAndrew Johnson (22:44.372)\r\nAnd then his aunt coincidentally was our last name was good. She was a Creel out of Texas So there's a little bit of a background story So we kind of were old with that we kind of started rolling it really was the lawyer like hey you know to eat yeah You know and so but so yeah, so we went into retail and it was a jewel You know the Albertsons local store, but then as I mentioned Walmart\r\n\r\n\r\nNikolas Hulewsky (22:53.058)\r\nYeah, so you're like, yeah, no, it's family. It's a family name. That's it. Yeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (23:01.934)\r\n.\r\n\r\n\r\nAndrew Johnson (23:13.94)\r\nI was like that we got to get in the Walmart. This is a massive company and at first they were like no They were like you if you want You know, you're not coming up to headquarters. We don't really care to meet with you In a very in a more polite way, but if you want to to local so good\r\n\r\n\r\nNikolas Hulewsky (23:28.428)\r\nYep.\r\n\r\n\r\nWell, how does...\r\n\r\n\r\nHow does that work? I want to hear this story, but like, let's say I have a product and I want to sell into Walmart. Do I just email Walmart or do I have to go through local buyers? Like, does it start regionally and then go up or do you have to go to headquarters first? Like, what does that process even look like?\r\n\r\n\r\nAndrew Johnson (23:50.612)\r\nEspecially for, you know what I would say, especially for retail, it's like the journey of like an actor. I mean, it's that, it's so difficult. Like I couldn't even tell you, like I can't, it's hard to pinpoint one, like sometimes it is a combination, you know, different factors, like somebody putting a word in, you bug in the local guys so much that they call maybe some customers are, you know, requesting you at the local store and then.\r\n\r\n\r\nAnd a lot of people don't get it. It's difficult, man. It's very difficult. I wish it was that easy to just email people, because I would be in every store right now.\r\n\r\n\r\nNikolas Hulewsky (24:23.96)\r\nSo you gotta, so you gotta go, you gotta go kind of grassroots up. You gotta find like the local decision makers and then they gotta run it up the chain essentially.\r\n\r\n\r\nAndrew Johnson (24:33.138)\r\nYeah, and there's so many ways. There's so many ways, and then, we go on for hours, but like, you know, if you're the big guys, you can pay your way in there. You give Walmart a hundred dollars and they'll put you in some stores. our whole thing was like, you know, we're not going to pay to play. You know, first of all, it's, it's, outrageously expensive, especially for a small brand, but these big corporations, they pay a sliding fee every year just to keep it on the shelf. Now, a lot of those, you know, these guys are doing huge revenues, they can afford it, but yeah.\r\n\r\n\r\nNikolas Hulewsky (24:59.534)\r\nReally.\r\n\r\n\r\nAndrew Johnson (25:03.432)\r\nMost, 99 % of the brands that are, know, these publicly traded companies, they gotta pay. That's most of the revenue from the store. They make it on the sliding fees. It's half food, but it's half like real estate, you know? Like you're going to Albertsons. They call them sliding fees, which is basically like the pay to play. Like you gotta pay your annual fee just to get on the shelf, just to keep your products on the shelf.\r\n\r\n\r\nNikolas Hulewsky (25:19.914)\r\nlighting fees?\r\n\r\n\r\nNikolas Hulewsky (25:31.032)\r\nYou know, I was talking to this guy who I met through Twitter. I'm going to find his bio right now. He was on, he's on the team. Apparently there's four people at Walmart that buy candy. And it's like each one of them have a different role. I don't exactly remember. I think he does like the analytics and one person does the sourcing and one person does the negotiation and one person does quality or like, it's like something like that, right? And, but he's, he's handling.\r\n\r\n\r\nbillions of dollars worth. Can you imagine the volume of candy that sells through Walmart? But he was talking about his experience with Feastables, with Mr. Beast. And just like, yeah, he looks at all the analytics. What's selling, what's not, and then gives the information to the buyer, essentially, so that they can have better negotiating. But I didn't realize just how sort of specialized, I guess, that role is within a large company.\r\n\r\n\r\nAndrew Johnson (26:03.528)\r\nYeah, yeah Walmart's handy there.\r\n\r\n\r\nAndrew Johnson (26:27.728)\r\nyeah. Yeah, same with cans. They got a whole team analyzing. There's a buyer who like makes the decision on the brand side. And then there's someone who's analyzing all the details and there's somebody who's setting up the planogram. Okay, they should be in this shelf space or they should be in this shelf. Then there's somebody deciding how many SKUs of which item. Yeah, it's a lot more detailed than some people think.\r\n\r\n\r\nNikolas Hulewsky (26:50.968)\r\ntoo.\r\n\r\n\r\nSo how did you end up getting into Walmart then? They gave you the stiff arm for a while and then eventually like what was the thing that broke through?\r\n\r\n\r\nAndrew Johnson (26:59.976)\r\nSo we went to like the couple of local ones up here in the North suburbs in Chicago. And I literally just walked in the store. Sometimes I would call before and say, hey, can I talk to the store director? We're a local brand, love to come in and just pitch our product. And initially, was like, if you know about retail, we ship trucks now and got a warehouse. initially,\r\n\r\n\r\nI to deliver it from the trunk of my car. That's the story, part of the story you saw. So me and my dad were delivering, like, we would pull up, I'd have to sell it to him. I'd have to convince him the brand was worth bringing in and giving us a test. Then usually they would say, okay, we'll test it out for a couple of weeks, bring the product in. So I would go in the back as if I'm a trucker, which, you we don't do this anymore, but that was the initial, like I did the whole roll, which really prepped me for today. Cause I know every roll of-\r\n\r\n\r\nNikolas Hulewsky (27:55.885)\r\nAnyway.\r\n\r\n\r\nAndrew Johnson (27:58.578)\r\nthe process from shipping to selling it to then branding it and putting it on an end cap placing. So I went in there, we built the end caps, you know, at the end of the store in the middle aisle. And it didn't do that well. We ended up pulling it. was also not cost effective, right? For us to scale, you know, me and my dad couldn't be shipping them. This is the time we was also growing his team and our sales team. So we ended up pulling it out and just said, okay, you know, that's not for us right now.\r\n\r\n\r\nAnd then at same time, baby food. He got a baby food opportunity because the WIC Center's baby food supplier went AWOL, maybe on the pricing or whatever the reason was. So we had a brand called Pick Select Fresh.\r\n\r\n\r\nsecond stage baby food container, plastic containers. And if you go on Google, there's still articles about us, but we ended up rolling with that. So literally up until the pandemic, so that's about 2014, started the baby food company, still had the WIC contracts, and then we were in the dual, local Albertsons with our cans. And we're kind of trolling along, and then the baby food kind of blew up because there was some callbacks with Gerber, some recalls.\r\n\r\n\r\nNikolas Hulewsky (29:13.806)\r\nMm-hmm.\r\n\r\n\r\nAndrew Johnson (29:14.59)\r\nSo our name kind of started circulating. Walmart brought us in, got into a couple Kroger's and literally, you and the cans were still there, but it was a flat category, you know, as far as canned beans and vegetables. It wasn't like a new hot energy drink or like a feastable candy. So long story. Up until the pandemic, man, if you would ask me like what we do, would have said we're a baby food company because the baby food was just launching, started to take off.\r\n\r\n\r\nexpanded to like a couple hundred stores. And then based on the whole Gerber issue, like we saw a huge demand in that. And so we were like, okay, all hands on deck, the good foods, we're to let that live in the local, you know, Julio's goes in Chicago, but let's push this baby food. then that pandemic kid, man. And when that pandemic kid, the cane started flying because there was a food shortage. People, know, if you remember, if you go deep into the psychology,\r\n\r\n\r\nNikolas Hulewsky (30:09.122)\r\nYeah, yeah, I remember.\r\n\r\n\r\nAndrew Johnson (30:11.858)\r\nWe didn't know what the world was gonna come to, right? So people are stacking up like it's a apocalypse coming. So all of a sudden this became like a hot category. So, and then people traditionally were like, I don't eat cans or, you know, they weren't necessarily eating as many vegetables or beans. Started buying, stocking up. And then we saw this huge growth where people were like, wow, this is good. know, cans evolved too over the years, you know? It's not the old green giant tin good.\r\n\r\n\r\nNikolas Hulewsky (30:38.286)\r\nSo did you see a massive, you just saw a massive boom during COVID?\r\n\r\n\r\nAndrew Johnson (30:42.788)\r\nWe sold it is crazy. It was like I Remember, I was in Columbus and there's like February what? And then it hit in March something like that. I came back home and like the sale we had sold out a whole year's worth in 30 days\r\n\r\n\r\nNikolas Hulewsky (30:53.678)\r\n2020.\r\n\r\n\r\nNikolas Hulewsky (30:59.746)\r\nWhat?\r\n\r\n\r\nAndrew Johnson (31:00.66)\r\n30 days. But you gotta remember, everybody was selling out. mean, you remember the shelves were empty, right? So, but for us, yeah, yeah, yeah, yeah. But for us, that was astronomical, you know? So, immediately like, okay, well, and the baby food wasn't as hot. So we're like, okay, let's shift. We're gonna, we'll throw out with good food. So.\r\n\r\n\r\nNikolas Hulewsky (31:05.142)\r\nYeah. Toilet paper in particular.\r\n\r\n\r\nAndrew Johnson (31:26.386)\r\nBecause of that new demand, mean, the stores were out of stock too. So because of our relationships with our farmers, we were able to get product when some of these massive conglomerates weren't able to. So when Green Giant would sell out, yeah.\r\n\r\n\r\nNikolas Hulewsky (31:39.438)\r\nCan you?\r\n\r\n\r\nI was just like, can you give me an idea? You said you sold a month, a year in a month. Like how many cans was that? Or like, what was the revenue? just give me some context for what that means.\r\n\r\n\r\nAndrew Johnson (31:52.852)\r\nprobably at that time probably like 800, 900, 800,000 maybe? Yeah.\r\n\r\n\r\nNikolas Hulewsky (31:57.08)\r\nJeez. Were you like, what were the conversations like between you and your dad right then? Where you're like,\r\n\r\n\r\nAndrew Johnson (32:03.438)\r\nIt was nuts. was nuts. Like we, we had to, I mean, it was, was a, it was a blessing. You know, it was such a dichotomy, you know, as you remember, cause people were suffering. And honestly, up until then, man, we were like, the good brand might fall off because it's a flat category. like, we're just going to take our chance on this baby food. We had lost some of the contracts. So we were like kind of dead water, man. Like it was like, let's put everything in this baby food and cross our fingers.\r\n\r\n\r\nNikolas Hulewsky (32:32.59)\r\nYeah, well, like, I'm just doing some math, right? You're doing 70 grand a month, let's say in good food. And you're like, nah, I don't know. It's kind of stagnant. And then all of a sudden in March, you sell $800,000, $900,000 worth of product that has to be a massive mental shift from, all right, we're going to shut this thing down and we're going to go all in on baby food too. Hold on. Uh, I think Ken might, he might be taking it off. Uh, was it, was it.\r\n\r\n\r\nAndrew Johnson (32:32.658)\r\nbecause\r\n\r\n\r\nAndrew Johnson (32:56.82)\r\nyou\r\n\r\n\r\nAndrew Johnson (33:00.594)\r\nIt was a magical time. It was a magical time. mean, words can't describe it, man. Because it was a time, like I said, there was so much suffering going on. the family had, we were in the North, you know, we're in Chicago, so everyone's stuck inside. So the family got to be a lot closer. And then, know, folks who weren't traditionally in it were now full time, like my sister joined on. We got some warehouse space on the west side of the city.\r\n\r\n\r\nNikolas Hulewsky (33:02.478)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (33:15.373)\r\nMm-hmm.\r\n\r\n\r\nAndrew Johnson (33:28.796)\r\nAnd so it was amazing because it brought the whole family together. And so we all sort of rallied together. We're like, yo, this is nuts. And I'll tell you this, it's a mind, like you said, mind shift. Up until then, my dad was like, let's just, if anything, we could be like the biggest canned vegetable in Chicago. He was always like, let's just be the best local guy. And I'm always telling him, no, we're bigger than this. But when that hits, we're all like.\r\n\r\n\r\nNikolas Hulewsky (33:37.986)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (33:54.304)\r\nYeah.\r\n\r\n\r\nAndrew Johnson (33:57.052)\r\nYo, maybe we can do this. Maybe we can reach out to like California and Connecticut, right? And be a coast to coast brand. So from there, man, it is a blessing because these stores were out of stock. So the same companies that were probably ignoring us the last three or four years, ignoring our reps, giving us the runaround. Hey, they were answering calls real quick, you know, when you're out of stock.\r\n\r\n\r\nNikolas Hulewsky (34:19.318)\r\nAnd were they answering? That's what I was going to say. Were they answering calls because you could get stock while everybody else couldn't?\r\n\r\n\r\nAndrew Johnson (34:25.108)\r\nExactly. 100%. And then, know, the other thing is we were playing off the whole family on because a lot of people, as you know, they love like, you know, these conglomerates, they send in a broker and I've been on the broker side. So I understand, you know, you look at these, they're more like numbers. These guys are robots. A lot of times there's no conversation. They don't care about who the buyer is, what his family's doing. It's like, Hey, I'm representing this brand. Can you give me this?\r\n\r\n\r\nNikolas Hulewsky (34:27.105)\r\nInteresting.\r\n\r\n\r\nNikolas Hulewsky (34:33.741)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (34:48.75)\r\nMm-hmm.\r\n\r\n\r\nAndrew Johnson (34:54.196)\r\nI need to do this. So they appreciate the human one-on-one connection. think also up until then, they appreciated my dad's story. So this is a combination of that and then running out of products. And so everybody just gave us a shot.\r\n\r\n\r\nNikolas Hulewsky (35:04.578)\r\nYeah. I mean, you play the hand you're dealt, right? Like the fact that you're a family, that's a great story. Who doesn't want to support a family-owned business that's growing? You know what I mean? Of course I'd want to support something like that. And of course you would play into it, because it's like, I can't go and outspend these conglomerates. What do I have? I have this story. Cool. I'm going play the story. It makes total sense. Did that demand stay?\r\n\r\n\r\nSteady? it go up? Did it go down? Like if you went from, let's say 70,000 a month in sales to $800,000 in that month, did you stay at that 800 mark? Did you grow? Did you shrink? Like what did it look like during COVID?\r\n\r\n\r\nAndrew Johnson (35:44.796)\r\nNo, it grew. It grew maybe three, 400 percent. Because from from there, it didn't stop for like maybe three years, you know, so from like pandemic hit like the top of twenty twenty two. So Kroger first came in. So, mind you, up until twenty twenty two, we're in about 200 stores for the cans and about 300 stores for the baby food. And then, you know, the majority of revenue was still kind of a little bit of government. But that was tapering off.\r\n\r\n\r\nNikolas Hulewsky (35:51.125)\r\nWow, man.\r\n\r\n\r\nNikolas Hulewsky (36:00.963)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (36:14.35)\r\nRight.\r\n\r\n\r\nAndrew Johnson (36:14.484)\r\nSo we basically went from two, like I said, the story goes, we went from 200 stores. Kroger brought us into like 2000. So that was the first time we got out of Chicago and out of Illinois. And we're, you know, they put us all the way down to Texas, all the way East is Virginia. So we're like on a super high, you know, we went down to headquarters. It was super, it was awesome, man. The whole family's there. We're doing a demo in front of the whole corporate team. Um, and then from there, you know, when you get into Kroger, everything trickles from that.\r\n\r\n\r\nNikolas Hulewsky (36:40.589)\r\nWas it hard for you?\r\n\r\n\r\nAndrew Johnson (36:43.73)\r\nYou know what I'm saying? So Walmart who is, mind you, seven, eight years earlier was like, hey, you guys are local. If you want to go sell them, that's cool. Now they're inviting us to headquarters. They gave us 400 stores. I don't have to deliver. We're shipping a truck over there. They're doing, like a real business is. And so from then, it was like Meyer and then a bunch of other stores.\r\n\r\n\r\nNikolas Hulewsky (36:44.322)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (37:02.392)\r\nYeah.\r\n\r\n\r\nDid you have a hard time meeting demand? I mean, that's a big jump to go from, and I'm saying these numbers, right? You're not telling me these numbers, but I'm guessing. It's a big jump to go from $70,000 a month in revenue to call it.\r\n\r\n\r\nto a million dollars a month in revenue, maybe more. There's a lot that has to happen. You have to scale up your production capacity, your distribution capacity, potentially even inject money into the business because you've got to fund these things. Was that difficult or did you find the scaling fairly easy?\r\n\r\n\r\nAndrew Johnson (37:23.154)\r\nYeah. Yeah.\r\n\r\n\r\nAndrew Johnson (37:38.972)\r\nNo, and anybody who says it was easy is I have to question them or they had partners and investors and we had neither. Fortunately, if you see this story and there's a lot of formats of the story going by right now, mean, even, side note, we just got approached by Lifetime to do a movie on it. But, you know, my mom, thank God, was a very supportive wife and had done pretty well at Abbott.\r\n\r\n\r\nNikolas Hulewsky (37:46.828)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (37:58.776)\r\nthread.\r\n\r\n\r\nNikolas Hulewsky (38:07.406)\r\nMm-hmm.\r\n\r\n\r\nAndrew Johnson (38:07.492)\r\nSo, you my dad was lucky to have her and so, even from the jump when he said, I'm going to quit, she was supporting him all throughout that way. You know, so, but he was initially, and he's, he's also someone who never wanted to invest. He's always like, I make the last decision, but it wasn't easy at all. we had to, it was just meticulously flipping, saving, and then investing. And luckily we did it in the right way.\r\n\r\n\r\nNikolas Hulewsky (38:36.066)\r\nWhat did you have to invest in? What infrastructure is necessary besides just scaling up production of the cans? Did you have to invest in a sales team? Did you have to invest in a backend team? you have to invest in what? What was costly about the growth? No.\r\n\r\n\r\nAndrew Johnson (38:50.77)\r\nNo. No. that's the one beauty I will say about it, is that the internet, if anyone on here can take away anything from here, is utilize the internet. And thank God, everyone was doing Zooms, right? So when the pandemic hit, no one had anything to do. So everyone was like, on Zoom, that cut a lot of cost out. I didn't have to travel places. And then people were actually\r\n\r\n\r\ncreating relationships on LinkedIn. So I got to Target through LinkedIn, just connected with one of the buyers. She kept sending her messages, sending her emails, and know, one year, and she connected me with the buyer at Target. So LinkedIn, man, was a huge part. I tell people we built the brand, not the government side, but the brand on two or three apps. You know, LinkedIn, I say Instagram, and Instacart.\r\n\r\n\r\nNikolas Hulewsky (39:22.787)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (39:50.624)\r\ninteresting.\r\n\r\n\r\nAndrew Johnson (39:51.41)\r\nYeah. So, you know, LinkedIn was a huge part in us getting to these B2B players. So I can't tell you, we got a lot of meetings through that. Wait, like you said, when you get a guy like Kroger, everybody's looking at them as the standard. So it becomes a lot easier at that point. It took a lot. It took a lot of hard work to get to them. But once you get them and then you get like a Walmart, everyone's OK. Well, if Kroger and Walmart took them, let's take a chance on.\r\n\r\n\r\nNikolas Hulewsky (40:20.91)\r\nYeah, there's almost like that credibility piece where you get one guy or whatever to back you. And then it's like, oh, okay, well, if they're doing it with so-and-so, then we can give them a shot. It makes total sense. Tell me about how has it been post COVID? Have you stayed kind of at that level? Has there been a drop off? Like, what has it been like being, cause I'm sure there are a lot of businesses that saw massive spikes and then have come back down somewhat, but.\r\n\r\n\r\nAndrew Johnson (40:22.868)\r\nThe credibility piece,\r\n\r\n\r\nAndrew Johnson (40:31.294)\r\nYeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (40:49.23)\r\nWhat has it been like for Good Foods?\r\n\r\n\r\nAndrew Johnson (40:51.612)\r\nYeah, no, you you described it. It was it was a huge peak. And then we kind of we kind of flat line came back to. But, you know, the coming back down is a lot higher than the norm from before just because of the demand. So the category overall is projected to be on a higher growth rate than it was before covid. But yes, still sales. That was definitely a big spike.\r\n\r\n\r\nNikolas Hulewsky (41:06.093)\r\nYeah.\r\n\r\n\r\nAndrew Johnson (41:20.756)\r\nSo we came, you know, we kind of came back to normal now. And so now it's really just about diversifying the products. And we just added a new cranberry sauce line this past holiday. And so we'll be looking at a canned pumpkin for this next coming holiday. So those are the two new skews. at this point it's about.\r\n\r\n\r\nNikolas Hulewsky (41:40.302)\r\nThanks, fam.\r\n\r\n\r\nAnd you're still a hundred percent, you still a hundred percent family owned. Like there's no outside investors, no.\r\n\r\n\r\nAndrew Johnson (41:49.652)\r\nNo, no. So my father passed. I met with a lot of private equity investors and different entities. And, you wouldn't believe the number of like celebrities or what you call athletes that reached out looking to partner. Fortunately, you know, I just I kept we were able to it's difficult. There are a lot of times I'm like, man, maybe we should get a partner. Maybe they can see my disease.\r\n\r\n\r\nYou know, I want to pass this down to my kids and at the end of the day I think you know, especially with the internet we're we're so blessed I just think about my dad and trying to start this brand in the early 2000s before the internet You know, you got to put up million dollar TV ads, right? You got to pay a million dollars just to create the video then another million just to run it Now, you know, I'm reaching you gentlemen like you through a free post Twitter's free\r\n\r\n\r\nThat little post took a couple minutes to make, it was all free to make and was free to distribute. So we're in a blessed age, honestly. I think about it, I'm so humbled because the story went how it was supposed to. I don't know if we could have built this brand. I don't think, not without any investors in the early 2000s, it was impossible.\r\n\r\n\r\nNikolas Hulewsky (43:09.87)\r\nFor sure. Yeah, for sure. And the fact that your dad had those relationships, that network, mean, that's incredibly valuable. I don't know how you put a dollar amount on that. Dude, Andrew, this has been fantastic, man. This has been, yeah, one of my favorite conversations. Because like I said, there's not only the business component, but there's the human element to it. And I love it. Is there anything I didn't ask that you wish I would have?\r\n\r\n\r\nAndrew Johnson (43:17.054)\r\nExactly.\r\n\r\n\r\nAndrew Johnson (43:37.524)\r\nNo, we covered a lot of it. Unfortunately, my father passed. That was a huge hit because, yeah, maybe this is last thing we close out with for all the aspiring entrepreneurs. I was probably at the peak, the director of marketing, and I had just gotten promoted to VP of Sales. And my dad's the type of guy to walk in the office and say, hey, I'm\r\n\r\n\r\nI just put up a resume on monster.com. We're looking for a VP, you know, like, dad, what do you mean? I'm right here. You he kept the playing field level. It was never like, hey, you're guaranteed this, you're guaranteed that. But once he saw the way I was able to use the internet, because it kind of went, you know, when that pandemic hit before, like I said, we were...\r\n\r\n\r\nKind of on the verge of like, man, my dad was in his sixties too, right? So he was like, he had already kind of did his thing. He's like, I'm ready to relax, retired. She's like, if you want to take this over. Cause it was branding at that point. He knew it was a branding game. You know, said the government was over. He's like, if you want to do this, I'll let you run it and I'll be your mentor. And you know, I'll stay on as sort of the CEO in the face, but this is yours. Cause I'm not doing this data tape. You want to go golf, you know, go back to Scotland and golf.\r\n\r\n\r\nNikolas Hulewsky (44:43.032)\r\nMm-hmm.\r\n\r\n\r\nAndrew Johnson (44:57.894)\r\nSo I really just took it upon myself and sort of grew it. But I probably wouldn't have seen myself being the CEO or owner probably maybe even up until now. Maybe not even now, maybe like five years, six years online from when my dad passed. So it was lot of learning quickly, man. Still making mistakes.\r\n\r\n\r\nNikolas Hulewsky (45:12.162)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (45:19.589)\r\nLife's Yeah, life's weird. You know, the stuff that happens and the situations that come up and it's never as clean as you hoped, right? Like it never kind of goes to the plan that you were hoping for, but well, I'm excited to follow along. I'm excited to see how you guys do in the future. I'm sure you'll do great. Let's stay in contact. I'm gonna stop this right here.",
  "metadata": {
    "duration": "",
    "date": "2025-03-03",
    "platform_source": "Google Drive"
  }
}