{
  "episode_number": "197",
  "episode_title": "How AI Legal Battles Are Reshaping the Tech Landscape with Elizabeth Knopf",
  "guest_name": "Elizabeth Knopf",
  "business_name": "",
  "transcript": "﻿Nikolas Hulewsky (00:01.26)\r\nLiz full docket today. We're going to talk about potentially the marriage of Johnny Ive and Sam Altman already going through a divorce. We've got some updates on Google's deep mind as well as potentially some fair use rulings for Claude and Meta. And then in the second half of the conversation, you're going to walk me an idiot through the process of artifacts and Claude. You know those things that where when you're like working within a Claude chat and you actually create a document or a dashboard or\r\n\r\n\r\nAnd then you have to go back and think like, where was that thing? did I save that to my desktop? Okay. Well, Claude has now made that way easier for you to go back and look at the artifacts that you created and generated. And you are going to walk us through how to navigate the new system because I'm stupid and I need to actually see how it's done. So I'm excited. That's all going to happen today. But first what's going on with IO?\r\n\r\n\r\nElizabeth Knopf (00:53.508)\r\nSo all of a sudden, about a little bit over a week ago, there was obviously that big announcement with Johnny Ive and Sam Altman. They had fun little pictures together. And then things went dark. The websites started getting scrubbed and everyone was like, what is going on? And it came out that they have been sued by a company called IO, not I-O, but I-Y-O. And apparently it's over the trademark of it.\r\n\r\n\r\nbut it sounds like there's a lot more underneath that's a bit fishier and sketchy. So people have sort of been distrustful of Sam Altman. I don't know, know, everyone have your opinion of it, but basically what happened was apparently this company IYO that was a spin out of Google's X lab or something. They basically have developed these really interesting wearable airbud technology and we're trying to get acquired by open AI.\r\n\r\n\r\nAnd then about a week later, they announced this marriage between Johnny Ive and OpenAI. So apparently there's been data that was shared. Who knows? We'll probably find out more in the coming weeks. But it doesn't smell so good on the surface.\r\n\r\n\r\nNikolas Hulewsky (02:00.302)\r\nHmm\r\n\r\n\r\nNikolas Hulewsky (02:11.658)\r\nAnd IO, was this what they were calling the new product or this new division within OpenAI? Yeah, it does not look good. looking through this, IO, IYO, like you said, was spun out from Google X. was one of their projects that they were working on. They've raised over $60 million. They met with Johnny Ive and Sam Altman twice, potentially to acquire them. I don't know under what circumstances.\r\n\r\n\r\nElizabeth Knopf (02:17.656)\r\nYes. So.\r\n\r\n\r\nNikolas Hulewsky (02:41.166)\r\nAnd then they decided to get together, obviously Sam Altman and Johnny Ive, they launched it. It's called IO, you know, the letters IO as opposed to IYO. And now the video has been scrubbed. A lot of information has been scrubbed online. Like it doesn't, it doesn't look good. What do think the odds are? The chances are this gets unwound.\r\n\r\n\r\nElizabeth Knopf (03:03.832)\r\nI mean, I think it'll be fine, honestly. I think this is a lot of, mean, they have, I don't know how much cash they have in the bank because they've been spending from what I understand, but I mean, they're doing fine from at least a revenue standpoint. So I think they'll figure out and navigate how to manage. It seems to be a trademark issue. You know, there are plenty of, I'm not a lawyer, but I think they'll figure out a way to navigate it so that they can create a wearable.\r\n\r\n\r\nNow, again, I think it's like if there was some interesting IP, they were going to leverage that in actuality. There you go. But again, it seems like they'll either pay them off and in a settlement or they'll figure out like how to create a whole so that it doesn't actually conflict. Like there will be some kind of payout on this, but\r\n\r\n\r\nNikolas Hulewsky (03:52.408)\r\nmean, it does feel like Sam Altman is just continuing to craft this image of ruthless Machiavellian leadership. Again, these are just facts right now. Elon Musk is disputing the relationship that he had with Sam Altman and the understanding they had of what OpenAI was going to be. He's now turning it from a nonprofit into a for-profit. There's lots of questions around that.\r\n\r\n\r\nHe's also got into it now into a TIF with IO, right? It's like he goes and gets Johnny Ive and now there's this weird relationship where it's like, wait a second, did he steal their IP? What's happening here? I think Mark Andreessen was the venture capitalist who said, basically, if Sam Altman was left on an island with everybody else in Silicon Valley, he would become the Lord of the Flies within a year. Like he would be the leader of that island because he understands how to work the room and the politics behind it.\r\n\r\n\r\nI don't know, just all these little data points. Sam very much plays this like, you know, we're just, it's gonna be world changing technology and kumbaya. And behind the scenes, he's a killer. mean, he's, I don't mean like an actual killer, but he's like, he's got the mamba mentality. You know, he's going out and executing.\r\n\r\n\r\nElizabeth Knopf (05:07.15)\r\nCutthroat. Yeah. Yeah. No, absolutely. mean, and that brings up another challenge that they've had with another acquisition that they were trying to do with Windsurf, which a couple of months back, this was sort of the competitor to cursor, which is how people are basically coding with AI. And they were going to acquire it for over $3 billion. And then Claude basically cut off their data.\r\n\r\n\r\nto windsurf and it's sort of, are some rumors it's unclear if that's going to continue. I'm sure the acquisition will continue. But it was basically in response to a lot of the stuff that Anthropic Cloud, I'll use those interchangeably, doing because they are really going aggressive on code and starting to be more focused in that regard. And they have been sort of praised as a leader. mean, some people will argue O3 is better, whatever, but even last week,\r\n\r\n\r\nClaude came out with or a couple weeks ago Claude came out with something called Claude code and really sort of moved the needle So it's basically like these wars that are going on between them around coding and then so after Claude cut off windsurf from their data because it was basically seen as windsurf was gonna be Utilizing that for open AI and doing some training off of it and obviously Anthropic doesn't trust open AI\r\n\r\n\r\nSo it's unclear now how things are going to play out. Yeah. So it's like, it's wars basically right now between the LL.\r\n\r\n\r\nNikolas Hulewsky (06:33.966)\r\nSo crazy.\r\n\r\n\r\nNikolas Hulewsky (06:38.306)\r\nWe already don't trust people with the data and now it's like, also you have this supercomputer. Yeah, sure. Take my data and use the supercomputer to plot against me. It's just freaking nuts. In other supercomputer news, actually, before we get to that next story, something I'm noticing is I don't hear as much about AGI anymore, which for those who don't know, AGI stands for artificial general intelligence, which is effectively\r\n\r\n\r\nElizabeth Knopf (06:43.448)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (07:06.158)\r\nintelligence that's on the same level or above that of a human. And they used to talk a lot about, talk about it a lot, like, oh, it's around the corner. AGI is coming, and I just don't feel like I've heard it. Now it's sort of changed to this new term, super computing. I can't remember what Meta's new division is called, super intelligence. yeah, that's more just an observation. I think it's interesting how it's kind of like shifted and they're admitting AGI is not around the corner.\r\n\r\n\r\nElizabeth Knopf (07:21.796)\r\nSuperintelligence, new marketer.\r\n\r\n\r\nElizabeth Knopf (07:33.592)\r\nWell, you know, I think there's a lot, like just looking at where we are now versus a year ago, I mean, the level of sort of agentic capability, meaning that AI can go and do tasks on its own. It's now incorporated into a lot of tools, but you still have to sort of guide it. so, you know, however people, I don't even know if there was a clear definition to say like the yes or the no it was created, but yeah, I mean, it seems like\r\n\r\n\r\nThere's more optimism in that humans are somewhat important. But I think also the value of what was historically created with code and what AI can now sort of take over from a task perspective, like the value there is getting crushed. So, I mean, it's hard to predict. I would be foolish to say I have any sort of clarity on this because nobody does and anyone that sort of like suggests that they do have that view. Maybe some of the cool sci-fi people do, but yeah.\r\n\r\n\r\nNikolas Hulewsky (08:08.013)\r\nHmm.\r\n\r\n\r\nElizabeth Knopf (08:32.194)\r\nI don't know where it's gonna go, but yeah, they're, think, just remarketing things, whether or not they just need a new term to get people excited, or this sort of moving benchmark is just, you know, unclear of what it actually would be, so.\r\n\r\n\r\nNikolas Hulewsky (08:43.948)\r\nYeah, maybe they're real. To your point, yeah, they're either realizing it's harder than it should be or than they said it would be or the rebranding it. Yeah, it's one of it. It's one of the two things that lead that leads us though into the next discussion that we highlighted in the beginning, which is this fair use and what on anthropic is going through. So I'll highlight really quickly what fair use is and traditionally what it's been. And then we can talk about what it means for anthropic fair use.\r\n\r\n\r\neffectively means if I publish something and I have a copyright or a trademark or I've created a piece of content or media, somebody else can't just take it, repost it and do whatever they want with it and then generate dollars or make money off of it. That wouldn't be okay. Let's say that you wrote the Grapes of Wrath and I ended up taking it, self publishing it and then selling it on my own website, the Grapes of Wrath. It's like, what?\r\n\r\n\r\nNick, didn't write the Grapes of Wrath. Why are you selling it? I can't do that. What Fair Use does though is it allows you to take a work and make it your own, make it unique. So if Liz posts a video about AI and I take a 60 second clip of it and I show her talking and then I do a talking head response to it, that can be considered Fair Use. Or if I take a clip of a show and I maybe put myself on a green screen behind it, that might be Fair Use. Or if I buy a copyrighted thing and then give attribution, that might Fair Use.\r\n\r\n\r\nFair use has sort of evolved as the internet age has come about, but now there's a ton of other fair use questions because these models are using copyrighted materials to train. So how are the owners of that intellectual capital compensated? And there's a lot of questions. so Anthropic right now is in the middle of a lawsuit regarding fair use.\r\n\r\n\r\nElizabeth Knopf (10:31.576)\r\nYep. So over the last week, there's actually been two sort of pivotal results. So both Anthropic as well as Meta. So essentially they were training on publicly accessible data sources. Meta was using books to transform their llama model. And they were again trying to prove this, this very use context. And then Anthropic also was using copyrighted books.\r\n\r\n\r\nbut essentially this, there was, guess, a term called like exceedingly transformation formative transformative, that was enabling them to sort of get around this. So as they say, you know, good artists, what a copy and then great steal. and so this is essentially what we're seeing is that by, you know, combining all these different, data sources, whether it's the, I guess, entropic use something called the lib gen library.\r\n\r\n\r\nNikolas Hulewsky (11:12.76)\r\nCopy.\r\n\r\n\r\nElizabeth Knopf (11:26.116)\r\nIt has seven million pirated books. And so they were sort of saying, well, these are, you know, pirated and this and that. But apparently, again, this just is enabling them to utilize publicly information. so basically, as they say, you know, if you don't want it, well, I guess anything you put out there is being utilized now by the algorithms and AI. So if you want to keep something private, don't share it.\r\n\r\n\r\nNikolas Hulewsky (11:29.646)\r\nCheers.\r\n\r\n\r\nNikolas Hulewsky (11:51.308)\r\nYeah, I mean, it's a very weird thing because they can go and they can crawl and they can train all their models on this stuff and then there's no attribution for it. I don't know. I'm not smart enough to have an opinion on it. But I do think that for us, as we're looking at it, there will be cascading effects down the road. mean, Hollywood in the form of entertainment is going to change. I just look at what it did to newspapers in the first iteration of the internet.\r\n\r\n\r\nRight? It's probably going to do to entertainment in the second iteration of the internet. anyways.\r\n\r\n\r\nElizabeth Knopf (12:20.312)\r\nMm-hmm. Yep.\r\n\r\n\r\nElizabeth Knopf (12:28.76)\r\nWell, actually on that note, there was a statistic that came out this last week saying that even the traffic to new sites because of AI, not even because of social media, but because of AI has gone down by like 23 or 20 some percent over the last two years. So that is already having a huge impact. Yeah. So.\r\n\r\n\r\nNikolas Hulewsky (12:46.221)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (12:51.138)\r\nWell, let's get to the meat and potatoes because I'm excited to really look at this. I want to know about Claude's artifacts because I use Claude a lot. I use it for very specific things. I love the way that they have projects. But this issue of artifacts has been a consistent issue for me. And for people who are listening, think of an artifact just effectively as something that you created.\r\n\r\n\r\nElizabeth Knopf (12:57.656)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (13:14.86)\r\nIt could be a template. could be a document. It could be a dashboard. It could be an Excel spreadsheet. Anything that you used AI to help you create, create any time. We're going to just call that an artifact. We're not saying document or spreadsheet or whatever the term might be. It's, it's artifact. and clouds had this ability for a little while, but they just did something recently in the last week. At least this is what Liz tells me that has made the ability to search, find, and utilize these artifacts much easier and accessible.\r\n\r\n\r\nElizabeth Knopf (13:43.714)\r\nYes. So before over on this little sidebar over here, you would just have chat and projects. And now you have artifacts. So again, before what you would do is you would go into one of your chats and let me pull up. Okay. I was looking at Riley Brown's, some of his, he's has a great podcast on stuff. And so when you go in and you create, let's say I took a transcript, I wanted to summarize to give me a guide for growing my audience. And so it created a document like that.\r\n\r\n\r\nNikolas Hulewsky (13:52.841)\r\nElizabeth Knopf (14:13.565)\r\nbut now, and then for, for more like,\r\n\r\n\r\nNikolas Hulewsky (14:17.228)\r\nSo if you're just listening or watching, effectively what it spit out was a word document of a step-by-step, hey, copying this person, here's how you could grow your audience. But it's in the word document format.\r\n\r\n\r\nElizabeth Knopf (14:29.792)\r\nExactly. And then in other instances, like I would generate a cool little tool, but I'm like, okay, this is cool. I have it here. I was talking about last week. It was really hard to export this. And then I had to share a link and all that. And then in other cases, it's like you're building little, you know, HTML dashboards or software tools that are interactive. Whoops. And so it was one really hard to find, as you mentioned, once you created them.\r\n\r\n\r\nNikolas Hulewsky (14:34.274)\r\nyeah.\r\n\r\n\r\nElizabeth Knopf (14:54.806)\r\nAnd then two, it was sort of was like, okay, great, this is cool, but now how do I make it useful? And so what this allows, so first off, if you create anything, you have now just an easy way to access them. So here are all the ones you created. And then if you publish it by going back into the chat, let's see, okay. So here you basically would go to, publish, and then you can copy a link and share that with other people.\r\n\r\n\r\nNikolas Hulewsky (15:10.202)\r\nwow.\r\n\r\n\r\nNikolas Hulewsky (15:19.502)\r\nWhy would you publish it?\r\n\r\n\r\nElizabeth Knopf (15:22.116)\r\nThis is again, just making it shareable for other people. So you created this cool little dashboard and I didn't want to say, hey Nick, check out my pitch deck here. And then you can share this link and other people can access it. They can interact with it. This one was a PDF, so it's not really interactive, but you can have like dashboards and things. so...\r\n\r\n\r\nNikolas Hulewsky (15:25.287)\r\ngot it.\r\n\r\n\r\nNikolas Hulewsky (15:29.708)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (15:37.581)\r\nOkay.\r\n\r\n\r\nAnd so within Claude on the left hand side, there's chats, projects, and now it says artifacts. Okay.\r\n\r\n\r\nElizabeth Knopf (15:44.832)\r\nYes, that is correct. So the cool thing though, so again, now it's like, yes, it's helpful for search and accessibility organization. Okay, I get excited about that. But what's more interesting is they are now helping to guide people to actually produce these little tools. And so they have this tab called inspiration, which I just thought was pretty cool. So now they obviously\r\n\r\n\r\nNikolas Hulewsky (16:10.082)\r\nWhere is this inspiration tab? I'm sorry.\r\n\r\n\r\nElizabeth Knopf (16:11.886)\r\nThis is literally just go to click on artifacts and it'll pop you right over there. And that's the first thing you see. So there's an upper thing that says inspiration and the next to it is my artifacts.\r\n\r\n\r\nNikolas Hulewsky (16:18.956)\r\nOkay.\r\n\r\n\r\nGot it. Can you search? It doesn't look like there's a search function within your artifacts.\r\n\r\n\r\nElizabeth Knopf (16:25.508)\r\nNo, uh, let's see. Yeah, not yet. That's unfortunate. I'm sure they'll have that point here. Um, so that's still a bit of a challenge, but anyhow.\r\n\r\n\r\nNikolas Hulewsky (16:31.383)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (16:36.839)\r\nand so is this inspiration other artifacts that other people have published?\r\n\r\n\r\nElizabeth Knopf (16:39.66)\r\nYes, exactly. So it's like there are some common use cases that I'm sure Anthropic sort of looked at their own code and did an analysis where people build regularly.\r\n\r\n\r\nNikolas Hulewsky (16:47.51)\r\nYeah. So if you're again, if you're listening, we're we're in Claude on the left hand side, there's chats projects and others artifacts. We're in under inspiration and even under inspiration. There's like these sub tabs of learn something life hacks, play a game, be creative, touch grass. And we're scrolling through what other people, Ooh, a trivia game. Look at that. Look at that. Hold on. Go. So click on that. I'm curious. Yeah. Okay. So she just clicked on the trivia game.\r\n\r\n\r\nElizabeth Knopf (17:12.555)\r\nWhere's trivia. Okay. Yep\r\n\r\n\r\nElizabeth Knopf (17:17.634)\r\nAnd so now you can do first, gives you the prompt. So it helps guide you in learning better prompts. It'll give you then the full chat of how this was generated, because it wasn't like one-shotted.\r\n\r\n\r\nNikolas Hulewsky (17:29.87)\r\nWait, oh, wait, wait, wait, I could look at the chat that you used to create something.\r\n\r\n\r\nElizabeth Knopf (17:34.338)\r\nYes, and then we'll get into the customization. So I just clicked on the chat. And so as you can see here, it goes all the way up to the top, create a trivia game, trivia app and react, I won't read the whole thing. But you can click on it, it provides that it analyzes data gives you sort of the flow. And then it said, Okay, I like it. The glow should you know, it had some iterations and stuff. And so I don't Yeah.\r\n\r\n\r\nNikolas Hulewsky (17:57.528)\r\nDude, that is so interesting. Chris and I were just talking about this, not even on a podcast, we were just like on the phone and he was like, I think there could be a cool community where people would share their chats to show how they got to an output. He's like, do you think people would pay for that? And I was like, I mean, I think people would be interested in it, but I don't know exactly how it worked, but that's exactly what this is. You can publish these artifacts and see exactly how they got to it. They're like, it's their train of thought.\r\n\r\n\r\nElizabeth Knopf (18:23.49)\r\nYeah. And that actually brings up a whole other point too. It's like all of these little ideas of even building trivia tools or whatever and little apps. just feel like the LLMs are just getting into the space and crushing all these little startups. Like I've seen, there was a startup that I even saw that built a couple of tools that are just like crushed if you have, you know, but.\r\n\r\n\r\nNikolas Hulewsky (18:38.476)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (18:44.696)\r\nWell, back to that trivia thing, because it said you could customize it.\r\n\r\n\r\nElizabeth Knopf (18:49.368)\r\nYes, this is where it gets exciting. So now you can adapt it to your needs. It gives you the framework and now we can prompt if you want to change basically the functionality, if you want to change the categories, what the goal is, like you can change all of that now. So because it's given you now the artifact as a starting point, as a template.\r\n\r\n\r\nNikolas Hulewsky (19:05.838)\r\nOkay, so Liz clicked on this and as I'm looking at it now, on the left-hand side in the prompt window, Claude's basically telling me, transform any artifact into something uniquely yours. Here are the elements you can do. One, you could change the topic. You could adapt the content for a different subject. Two, you could update the style. Three, you could make it personal. Four, you could share your vision. And then it asks you, where do you want me to begin? So this is a trivia game right now that says, test your knowledge with Claude-generated trivia questions and there's categories, et cetera. So I, for example, actually,\r\n\r\n\r\nTry this, Liz. Say, I'm a 39-year-old parent. I have two boys ages 11 and eight. I would like to have a round robin trivia game with them where the questions difficulty is tailored to each person's age.\r\n\r\n\r\nNikolas Hulewsky (19:56.839)\r\nI wonder if it will be able to do that. It should be.\r\n\r\n\r\nNikolas Hulewsky (20:04.682)\r\nShe's just typing that out. She hit enter. And I'm sorry, Liz, if you're not 39, because now it's going to be like, wait a second. Liz is 30. it's transforming it. I will transform this into a family round robin trivia game. And you can see it's pumping out the code right now. Right in front of our eyes. What the freak? By the way, your kids are kind of my kids ages. Have you ever played trivia games with them on in chat, GPT?\r\n\r\n\r\nElizabeth Knopf (20:13.614)\r\nyou\r\n\r\n\r\nYes.\r\n\r\n\r\nElizabeth Knopf (20:32.964)\r\nWe did a family road trip. had ChatGPT give us ideas for games, and then we did that like, here's a story, then have the next one add to the story. And it basically was able to remember the whole story, and it added a little bit to it. So it was like really fun. We did it for about an hour and it worked really well. It was actually a really fun game. So we didn't do trivia, but we did that on our road trip.\r\n\r\n\r\nNikolas Hulewsky (20:34.39)\r\nor Claude.\r\n\r\n\r\nNikolas Hulewsky (20:56.738)\r\nThat's amazing. Can I tell you, my dad came last week and one of the things I did is, you know how it is when grandparents come, they're just always talk. Well, at least my dad, he's always talking and telling stories. And he's super interesting. was born in Germany, raised in Brazil, came to the United States, professional soccer player. But I gave my son my pendant and I turned it on. You know, my little limitless AI. And they talked for hours while he was here over the course of time. And so it recorded all their conversations.\r\n\r\n\r\nElizabeth Knopf (21:00.214)\r\nhuh.\r\n\r\n\r\nElizabeth Knopf (21:17.005)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (21:25.132)\r\nAnd now I have his voice, obviously, but I just, have the stories and I thought that's going to be a really, really cool memory for my kids. And it's like, now I can take those stories and I wouldn't have happened if I hadn't had, you know, AI or the ability to record them. So I thought that was really cool.\r\n\r\n\r\nElizabeth Knopf (21:38.744)\r\nI mean, that is, yeah, no, that is so cool. And I know you and Chris have like sort of even talked about those ideas before on one of your pods about, you know, being better memory catcher, but like that's huge because we're all are losing our family stories and we all want that history. I love that.\r\n\r\n\r\nNikolas Hulewsky (21:46.178)\r\nYep.\r\n\r\n\r\nNikolas Hulewsky (21:54.702)\r\nAlright, so this is, I don't know how close it is, I'm gonna see, oh! There it is.\r\n\r\n\r\nElizabeth Knopf (21:57.532)\r\nThere we go. Perfect timing. cool. Okay. So we'll buddy, we'll say, whoops, they put in so you can categorize like eight years old categories, general knowledge, sports history. Very cool. All right. Questions per player. All right. So let's just press go and see what happens.\r\n\r\n\r\nNikolas Hulewsky (22:01.6)\r\nmy gosh.\r\n\r\n\r\nNikolas Hulewsky (22:20.11)\r\nSo if you scroll up, there's no way to add, you could add another player if you wanted to.\r\n\r\n\r\nElizabeth Knopf (22:21.187)\r\nyou\r\n\r\n\r\nElizabeth Knopf (22:25.698)\r\nYeah, okay. Oops, maybe we need to because for some reason it was struggling a bit there.\r\n\r\n\r\nNikolas Hulewsky (22:30.006)\r\nNo worries, but I just think that's amazing that it actually did that. Sorry to like derail you, but holy crap, I can take other people's artifacts and just tailor it to myself. That's amazing.\r\n\r\n\r\nElizabeth Knopf (22:37.22)\r\nNo, no, Exactly.\r\n\r\n\r\nElizabeth Knopf (22:43.172)\r\nTotally, totally. So a couple other things I just wanted to share, because I think there's some other use cases that might not be as obvious for people to consider. So a couple of weeks ago, we started sharing about MCP, Model Context Protocol, and hooking up Claude to that. So one thing I've started playing around with, and I haven't perfected this workflow, so hopefully this works. But once you get some of these, you can sort of think of your MCP as the data retrieval, and then these little\r\n\r\n\r\ntools and artifacts with that nice UI that helps sort of guide you through your prompting or whatever you want to create as the visual output, that it helps populate the data. So you don't even have to write things. It'll access some of the data populated into your tool and then output it. So let me give an example. So I just ran this and I can redo it for time's sake. What I asked this meeting note summary tool to do\r\n\r\n\r\nwas to use my Google Drive that it has access to, to then find one of the most recent meetings I had, and then to populate those raw meeting notes into this little box here, and then I press summarize, and it went ahead and summarized it. So we can just sort of recreate this here. Let me go back over. Yeah, so that was one example. Let me just see if I can do it live to show something cool.\r\n\r\n\r\nNikolas Hulewsky (24:07.946)\r\nyou know what this is doing is like this is taking on sort of the lowest level of lovable and replete like this is the rapper that we all talk about like now you can natively create a rapper by creating these artifacts within Claude\r\n\r\n\r\nElizabeth Knopf (24:15.074)\r\nYes, yes.\r\n\r\n\r\nElizabeth Knopf (24:23.384)\r\nYep. And it's like, you know, there's the AI automation piece within AI agents, which essentially are doing tasks and they can do them more recurringly. Unfortunately, Claude doesn't really have that recurability yet. I've been trying to solve that here, but like a lot of stuff you still want to iterate through. But one of the challenges is, that, you know, you, even though you might give your project knowledge, some general instructions of how you want an output to help with the recurring prompt.\r\n\r\n\r\nSometimes it's visual, sometimes there's just like different decision points and this just creates like a nice way to interface with as well. So like you can easily go through those steps. And so that's why I really like again, wrapping around whatever your workflow is with these tools. And then again, granting creative of using calling your MCP to gather the data that you have elsewhere to then bring it over here and go.\r\n\r\n\r\nNikolas Hulewsky (25:14.862)\r\nSo when I have workflows that I've set up through Zapier, for example, they're calling on OpenAI's API and I'm paying for the token usage. Why wouldn't it be the same here? Am I paying for the token usage if I share this with people?\r\n\r\n\r\nElizabeth Knopf (25:19.619)\r\nYes.\r\n\r\n\r\nElizabeth Knopf (25:28.548)\r\nNo, no, actually, that's a good question. That's actually a very good question. I don't know the answer to that error, because I mean, essentially, so I have the max plan. So I wouldn't say it's like it's not unlimited, but it sort of is close enough. Like I haven't hit a rate limit and I use it pretty regularly. But the lower level plans, you do hit rate limits. So I'm sure if you do share it, I don't know if it pulls from your your rates. Now.\r\n\r\n\r\nNikolas Hulewsky (25:35.329)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (25:40.824)\r\nSure.\r\n\r\n\r\nNikolas Hulewsky (25:54.776)\r\nDo you have to, are you only able to use this within the cloud ecosystem or can you publish this to like a landing page that then I could go and use a quiz or something?\r\n\r\n\r\nElizabeth Knopf (26:01.55)\r\nSo when you, yeah, you'd have to export the files to have it hosted elsewhere. If you want it hosted on Claude, it basically gives you like a Claude link. But if you wanted to actually copy the code, you can easily do that and export the code. Like it absolutely loves to that as a part of it.\r\n\r\n\r\nNikolas Hulewsky (26:19.618)\r\nHmm. Because then then you would copy the code, export it, and then you could go to lovable or replant and say, here's the code. I want you to have an API tie with Claude or open AI, and then then you would pay for the API. OK, that makes sense.\r\n\r\n\r\nElizabeth Knopf (26:35.018)\r\nAbsolutely. Yeah. But again, like there are certain workflows where it's like API costs are actually more expensive. So being able to like just use it in your sort of single player mode or your iterative, it might make more sense. There's plenty of, I think, use cases and workflows that people are still like in this browser versus just needing a full automation that they're not touching until sort of the end results that I've seen at least. it seems.\r\n\r\n\r\nNikolas Hulewsky (27:00.876)\r\nI mean, I was thinking of the artifact as just being, this is the Word document or Excel document that I created. But these are, it's almost like you're creating custom wrappers.\r\n\r\n\r\nElizabeth Knopf (27:07.428)\r\nYes, that's essentially what you're doing. Yeah. Like they're just little tools.\r\n\r\n\r\nNikolas Hulewsky (27:13.344)\r\nIt's and it's more than a GPT like a GPT is just hey, here's the prompt. Do this this has. Yeah, the output is much different than just a custom GPT. I wonder like what would be an example of a good workflow.\r\n\r\n\r\nElizabeth Knopf (27:28.996)\r\nOkay, so right now I have the email writing assistant, which they had as one of their templates. So now what I'm doing, I'm gonna ask Claude to say, get my most recent email from Nick and...\r\n\r\n\r\nNikolas Hulewsky (27:33.934)\r\nOkay.\r\n\r\n\r\nElizabeth Knopf (27:44.709)\r\nand populate.\r\n\r\n\r\nElizabeth Knopf (27:51.608)\r\nthe respective fields in this artifact based on that email. We'll say using Gmail CPTool. All right, so let's see if it does that. I had also tried to add like a couple other steps to it. Let me just pop over there while this is working to see if it actually worked.\r\n\r\n\r\nNikolas Hulewsky (28:15.765)\r\nbecause you've already got Gmail tied in. Now I can go to Gmail, pull what Nick's last email was, and then do, wow.\r\n\r\n\r\nElizabeth Knopf (28:18.658)\r\nYeah, exactly.\r\n\r\n\r\nElizabeth Knopf (28:24.46)\r\nYeah. So like I started adding to, started customizing that specific workflow to say like, could I also have it go? So I have Appify, which is a scraping tool to help get more data. Could it also help add that in? So it was able to like break out here, sender info. And then I was going to have it sort of as a workflow from getting the sender info to then go and scrape data based on the user. So I haven't tested that yet, but that's how sort of I'm thinking about it is like, what are all those steps of\r\n\r\n\r\nNikolas Hulewsky (28:33.325)\r\nYep.\r\n\r\n\r\nElizabeth Knopf (28:53.262)\r\nthat I would have that maybe, you know, the MCP or it would have a long prompt or it would.\r\n\r\n\r\nNikolas Hulewsky (28:56.748)\r\nWell, yeah. So that, that leads me to the next question. Cause so now, especially because Claude integrates with Zapier, is there a box? I don't even know what words to use it when you're creating, when you're creating the email, you know, you have the email template thing. if you're, if people who are looking at this, Liz went to the artifacts, she found this email template. can you put in there not only pull Nick's email, but then also through Zapier go to.\r\n\r\n\r\nElizabeth Knopf (29:08.162)\r\nYeah. Yeah!\r\n\r\n\r\nNikolas Hulewsky (29:26.712)\r\nI don't know, Lemlist or some other email software and actually send it through that? geez.\r\n\r\n\r\nElizabeth Knopf (29:35.368)\r\nYes, I would guess so. I'm going to play around with that for next week because I just started playing around with this this week. And so there's still a lot to figure out here. But I'll test that. had to unfortunately disable Zapier here because it was causing some...\r\n\r\n\r\nNikolas Hulewsky (29:49.814)\r\nMy brain is breaking by this Liz. I'm like, my gosh.\r\n\r\n\r\nElizabeth Knopf (29:53.848)\r\nBut let's, let's me, I'll figure out a fun workflow we can use for next week where we will incorporate in Zapier with artifacts and some NCP excitement. And we'll see what we can come up with to see if we can blow some minds or if it's really possible to do what we would hope.\r\n\r\n\r\nNikolas Hulewsky (29:58.274)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (30:13.568)\r\nBecause with artifacts you can pull in other APIs, that like that's the thing that's.\r\n\r\n\r\nElizabeth Knopf (30:18.254)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (30:19.788)\r\nMan, that's the thing that's really crazy about it. you could build something that's like, hey, build me a valuation calculator. And the valuation calculator needs specific information. say it's a business. Like, well, I the revenue. I need the bottom line. I need where it is. I need what it does, blah, blah, But theoretically, you could have a spreadsheet database of all of those characteristics. And it could go out, pull that data, and bring it in without you having to copy and paste it in or do some random work around.\r\n\r\n\r\nElizabeth Knopf (30:49.38)\r\nAbsolutely,\r\n\r\n\r\nNikolas Hulewsky (30:50.828)\r\nWow. Okay, well, you win. You officially blew my mind this week.\r\n\r\n\r\nElizabeth Knopf (30:55.884)\r\nYeah, well good. I'm glad and yeah, so here's like a project dashboard here. So that's like a good starting point for anyone that wants to do some of that dashboarding. But yeah, this is pretty exciting.\r\n\r\n\r\nNikolas Hulewsky (31:05.293)\r\nCool. All right. Well, I hope somebody builds some cool stuff with it and lets us know what they're doing. Until next week, this was great, Liz. Thank you.\r\n\r\n\r\nElizabeth Knopf (31:14.404)\r\nThank you.",
  "metadata": {
    "duration": "",
    "date": "2025-07-02",
    "platform_source": "Google Drive"
  }
}