{
  "episode_number": "35",
  "episode_title": "How to Use ùïè Spaces & DMs to Grow Any Biz with Gav Blaxberg",
  "guest_name": "Gav Blaxberg",
  "business_name": "Wolf Financial",
  "transcript": "﻿So I go to a lot of conferences. I'll do one or two conferences a month. Sometimes when I'm traveling, I get to the conference and I never buy a booth myself. My goal is to walk around and talk to every single person that has bought a booth there. If they bought a booth, that means they have at least an expendable marketing budget they're looking to promote.\r\n\r\n\r\nAnd then I just walk around and just figure out who is looking to actually do influencer marketing. \r\n\r\n\r\nThere's a saying in venture investing that first time founders focus on product, Second time founders focus on distribution and every successful entrepreneur understands that the ability to sell your product is really more important than the product itself. I know it sounds weird, but if people don't know your product, you can't sell it to all our distributors.\r\n\r\n\r\nWell, what if your company enabled that distribution,  do you think you could build a media company that manages over a billion impressions per month, manages 13 million subscribers across combined accounts?  Oh, and could you do it at 25?  Well, welcome to another episode of Nick and Onyx, the show for entrepreneurs and watchpreneurs curious to learn how other businesses work.\r\n\r\n\r\nMy name is Nicholas Helusky, and I've owned and operated more than a dozen.  Generating more than 30 million a year in revenue and employing 300 people. And on today's episode, I sat down with Gav Blacksburg. He's the owner and founder of Wolf Financial, which is a full scale media and marketing agency that specializes in social media and influencer marketing, and I'm obsessed really with just one question.\r\n\r\n\r\nHow does a 25 year old build one of the most successful media companies in the world by using one strategy where he had no competitive advantage? DMs.  Let's find out together.  Quick announcement, guys, before we hop into the show,  I want more reviews on my show. You want money to that end. I am going to give money to people who leave reviews.\r\n\r\n\r\nIt's very simple, leave a review, screenshot it, send it to me, Nick at cofounders. com. And every four episodes, I'm going to pick one person to give a hundred dollar Amazon gift card to, and I'll announce it to everybody. So again, let's get some people paid, leave a review, send me the screenshot and tune in to see if you win. \r\n\r\n\r\nAll right. We're in Gav. Welcome to Nick economics. I'm freaking super excited to have you. I've been looking forward to it since we originally messaged. For those who don't know you, why don't you just give a brief introduction of what your business is and how you make money?  Sure thing. I have a couple of companies.\r\n\r\n\r\nThe main company that people know me for is Wolf Financial. Wolf is now turned into a full scale media and marketing agency. We've worked with over 150 different companies, helping them to run social media marketing campaigns. That's a very broad term. There's a lot that goes into it, but in essence, we have our own assets, such as Twitter, email, Instagram, newsletter, whatever it is.\r\n\r\n\r\nAnd we help people reach their target audience through those. Usually people are trying to target investors in my case. And then on the other side, I also manage a bunch of other content creators. What I found as a role for myself is that there's so many people on the internet who have amazing talents beyond what I could ever do.\r\n\r\n\r\nAnd the content that they create is fantastic. And they want to do that full time, but What they're missing is the business and people skill side of things to actually go out and do contract work. And some of them want to stay anonymous, right? It makes it very difficult for you to go and do contract work.\r\n\r\n\r\nAnd I have built a business off of representing them. In addition to myself creating collaborative packages and then serving clients.  Okay. The second business, essentially you're an agent, you're representing these clients. You're like Rich Paul and Clutch Sports representing, you know, LeBron James's of the world.\r\n\r\n\r\nAnd in the first business,  I don't even know what to call it. Is it digital? It's not digital marketing. It's, is it social marketing? Like describe it for me one more time. Yeah. I call it social media marketing at a high level. People call it influencer marketing. Now they call it key opinion leaders.\r\n\r\n\r\nThere's a million terms for how does that work with people that, yeah, it's a great question. So I think it starts with Being, you know, yourself online, right? Being something that's going to come and show up every single day and build an audience for me. This started on Twitter, really with Twitter spaces.\r\n\r\n\r\nIf you go back three plus years, I became really the first official beta tester for Twitter spaces. And that happened just for me coming onto Twitter every single day. You know, tweet my heart out. I actually started with the live tweeting, the GME trial when that was really happening, I had like no followers.\r\n\r\n\r\nI just spamming tweets about the GME trial. This is like how this all starts. And  over time, you know, people, if you're coming at it every single day and you're also putting in research and providing value, they'll start following you. But for me, it really happened with spaces. I became that first initial beta tester for spaces just by doing really cold outreach to the spaces team.\r\n\r\n\r\nAnd then after six months of hosting. They hired me as a contractor. I started doing internal meetings with the team, helping them build out features that really funneled a lot of followers to my account during that time. And then after I finished up with them, I went full time hosting 40 hours a week, essentially a live show.\r\n\r\n\r\nAnd at this point, you know, once we're hosting and we're getting tens of thousands of people coming through a week, of course, that's when you could do what, you know, podcasts and TV shows have been doing for a long time, which is advertising shows. Yeah. Okay. Okay. So. The social media marketing, are you helping influencers understand how to market their product?\r\n\r\n\r\nIs that essentially what the business does? It's varying different depending on the influencer. There are some influencers who are really all over the scale. You'll have people that are extremely uber competent. They're already working with clients. They already know how to market their business. And they're just looking now to bring in more business.\r\n\r\n\r\nThey're telling you, Hey, I've got more capacity than I'm currently selling. Do you have more people that would like to work with me? And then I build a connection with them. You have people that are starting from zero, have they could have a million or two million followers and never made a dollar online. \r\n\r\n\r\nSo specifically they're coming to you and saying you have this reach with your spaces.  Can I pay you essentially to access your, your audience? No, a little bit different than that. That's typically where the companies are coming in, right? Companies coming in and saying, you have this reach. I want to talk on your spaces and be interviewed.\r\n\r\n\r\nI want you to read an ad read on your spaces and people can see this, you know, coming into my spaces. We work with a bunch of different companies in the finance world. We've worked with like trend spider, who a lot of people use for their charting. We've worked with trade areas. That's a brokerage. A lot of my friends use, right?\r\n\r\n\r\nThese are their target audience, right? These traders and investors in a space when it comes to the. Creator side. They're not coming on the spaces necessarily. They're already doing their own thing, right? They might host their own spaces. They might have their own podcasts. They might have their own email list, but they're looking for is clients.\r\n\r\n\r\nAnd that's where I help assist them. For them, the client would be their target demographic, whoever they want to be selling to. If I sell a course, I'm looking for, we're going to buy my course or how do you help them?  So there's a two part process to this. One of them is my day to day is connecting with people.\r\n\r\n\r\nSo I'm always just looking to be involved. So I go to a lot of conferences. I'll do one or two conferences a month. Sometimes that I'm traveling to, I get to the conference and I never buy a booth myself. My goal is. Walk around and talk to every single person that has bought a booth there. If they bought a booth, that means they have at least an expendable marketing budget they're looking to promote.\r\n\r\n\r\nAnd then I just walk around and just figure out who is looking to actually do influencer marketing. And then based on what type of companies they are, who do I know that would be a good fit? Number two is through cold outreach, right? We have systems of cold email outreach, cold DM outreach. I've gone through periods where I've scaled up in different areas.\r\n\r\n\r\nRight now I've scaled back and concentrated, but I had a period where we were doing a thousand DMs a week  over Twitter. And yeah, and just shooting them out and just seeing, you know, like who's interested in here. It's really a life, life's of numbers game is what I found. And I'm curious if you can testify that at all with your business experience.\r\n\r\n\r\nBut I've often found that the greater you increase your odds and your chances, the more something's going to hit. It's actually brings me back to one of my first real jobs was door to door sales. For gas and electric company, and we would knock on 100 houses doors every single day. And the goal was to get about 6 clients out of 100 houses.\r\n\r\n\r\nAnd so what we learned was, hey, every single time you're not going to do, and they say, no, you're 1 step closer to the yes, because you average. Every 18 or whatever it is, 17 doors, you're going to get a yes. So I would just knock and be like, okay, cool. I'm one step closer to that. Yes. And then you just translate that over into sales. \r\n\r\n\r\nYou know, it's interesting. You're young. How old are you?  I'm 25.  25. Okay. So there are people like you and I'm going to lump you in with Mr. Beast. So you can, you can be as flattered  or not flattered as you want. I'll take, I'll take it. I'll take it. Cool. You're young. You're super smart. And you've figured out a way to take eyeballs and an audience and turn it into a real business, right?\r\n\r\n\r\nLike Mr. Beast has a real business. He now has feastables and he has these other lines, merch that he sells a million in revenue last year. It nuts, right? Like it's just, it's just mind boggling. And you through building the spit, the spaces audience have now turned that into a real business to help other content creators.\r\n\r\n\r\nGrow their audiences, not just grow their audience, but, but grow their client lists. People now want to advertise with you. And then you, you, you're also adding on new businesses all the time. So it's, I just think it's really cool to see you building this business. How  did you arrive here? You know, like Mr.\r\n\r\n\r\nBeast was like, Oh, since I was 11, I've been making YouTube videos every single day. And I, whatever he talks about how much time he's put into it. But for you, like, was this always something that you knew? Hey, I want to be an entrepreneur and this is the vehicle that I think can get me there. Or did you kind of just stumble upon it? \r\n\r\n\r\nIt definitely went through stages. I think when I was really young, you know, at that 11 year old age, Mr. Beast is talking about, I certainly had that entrepreneurial spirit. I started two companies prior to going to college. I had one, which was basically like a lawn care company around my neighborhood, helping people out, right?\r\n\r\n\r\nClassic kid. And then I did actually start, I found a kind of unique niche. When I was in 11th grade, I grew up in this ultra Orthodox Jewish neighborhood. And two things, you know, we Jews love to do, celebrate and eat, right? And when it comes to eating, The food has to be certified kosher for these events.\r\n\r\n\r\nAnd so they can't just go and use any caterer and waiter. And so when I learned about this, and I've got six siblings, so we did plenty of our own events, you know, birthdays and whatever.  And I realized like, Hey, this has got to be expensive. Like everyone's throwing these giant, you know, meals and there's tons of people coming in.\r\n\r\n\r\nAnd I started talking to people, my parents asked me, I'm like, how much are you paying for this? And the numbers really blew my mind, especially as a kid who had no money. And I was like, I could totally just come in with my friends and we could do this for half the price as what everyone's getting charged.\r\n\r\n\r\nWe can just, because what I realized was you had to get the food from the caterer, but the caterers were then also saying, Hey, you're using our food, use our staff. And so I started a kosher catering and waitering business because there were only literally two people in town. That were competition. I came in and I charged 50 percent of what they were charging, hired all my friends for like 10 an hour and was coming in and was basically making some pretty solid margins.\r\n\r\n\r\nI would just go to the caterer, buy the food off them, take it to the event. And then we would do everything else. So families are saving thousands of dollars. And I think that that entrepreneurial spirit was there. Yeah. Went through college and I think I got more into like the, I'm going to work for a company that I really admire mindset.\r\n\r\n\r\nI think it's hard when you're in college to think coming out of college, you're going to have your own business and you're going to build, right? You've got bills and expenses to look at and expectations. And I had some great experiences and there were companies that I wanted. To work for and had opportunities even to kind of work for full time throughout college.\r\n\r\n\r\nI was kind of like going on and off a little bit between classes. I got some really cool experiences in private wealth management, private equity, full time working at these companies in a role on staff teams.  But the luck of the draw moment was COVID hitting, right? I think the pandemic that changed so many people's lives for worse or for better in my case, by the pandemic hitting.\r\n\r\n\r\nI was actually working at a private equity firm at that time, also finishing up school. And I, where were you, by the way, like, where were you going to school? Drexel  in Philly. Yes. And so essentially  the pandemic hits, I'm kind of winding down this job in private equity, but it ends up being perfect timing because their whole firm wasn't ready for it.\r\n\r\n\r\nEveryone shifts online. And within about a couple of weeks, I get a call from a friend who says, Hey, we've got all this free time now, right? We, everybody was going out and hanging out and stuff like that. We want to start a company. And I was like, this sounds interesting, right? Like, what do you want to do?\r\n\r\n\r\nAnd they wanted to build a stock app, very similar to public or stock twits that people could use to engage with each other on social media and just talk finances. Long story short, By getting into this app, I then get into building on social media. I start getting involved with Twitter and Twitter spaces.\r\n\r\n\r\nThere comes a pivotal moment, December of 2021, where we realized that what we were building with the app wasn't going to work out, but there were pieces of it that had a lot of promise specifically. We had one piece of patented technology that was more of a software piece. And the number two, we had a strong brand that I had built online.\r\n\r\n\r\nWe split the company into two pieces. I separate from the rest of the team and the app and everything that they were building. And I just go full time into building a social media brand. And so that's kind of how it got started. It was not. Yeah. So let me just recap. Cause I'm like trying to keep up with your, I love your energy, by the way.\r\n\r\n\r\nFreaking love it. So you got onto social media because you wanted to start promoting this app that you were building.  You nailed it. And, and through the promotion, you're growing this audience, you know, you reach out to Twitter. You're like, can I get onto spaces? Et cetera. And at the same time that you're realizing this app may not go the way that I'm hoping it will go.\r\n\r\n\r\nWere you also getting people reaching out to you saying, Hey man, you've got a lot of followers. I love what you're doing. Can I pay you to do X, Y, and Z? Like, did you, did you already have something that was pulling you in a direction or were you like, Oh, this app's not going to work. I need to pivot. What should I do? \r\n\r\n\r\nSo I had a very small amount of people like one or two who had reached out with small offers. But of course, I couldn't take those because that the social media was still for the company at the time. Right. I think in my mind, I just looked at the trends that were happening. And I said, Hey, you know, this account has 30 to 40, 000 followers at this point.\r\n\r\n\r\nAnybody that is getting this many impressions with this amount of followers per month, you can probably make Realistically 50, 50 to 60 K a year on social media. If you have some business savvy skills, right? In worst case, you know, somebody will want to hire you to run their social media because they see you doing such a good job.\r\n\r\n\r\nAnd that's maybe an 80 K a year type job. And I will be honest, it was a big leap of faith. Yeah, I had a, I had this moment, so we're kind of getting into the depths here, but I basically went down the month that this was all happening. I went down to Miami for a month. I just needed to get out of Baltimore and I was like, I need to go down there.\r\n\r\n\r\nI didn't know anybody in Miami at all. And I would go down, I'd sit on the beach and it's like 10 p. m. at night. Just looking out over the stars, like God, like send me a sign. Like, what do you want me to do here? The company is changing. I don't know what's going to happen to me. I, by the way, at this point had not been also, the company wasn't making any money, right.\r\n\r\n\r\nIt was startup. I'd been working unpaid for like 17 months  and I had very little savings. And I was like, what do you want me to do? And I ended up just getting in contact with a guy who became a mentor for me, had already been a mentor for me, actually shot him out, Brian Hanley at bullish. Great guy.\r\n\r\n\r\nHello, Brian. And  there we go, Brian. And I was on the phone with Brian and Brian basically like drills in and he's like, You built this like this isn't something that don't just let them take it from you, right? Like the social media like yes It's owned by the company and maybe you can just go and find another job But like why would you let this go you built this it is you um fight for it You deserve it and I never had anyone tell me Like you deserve this.\r\n\r\n\r\nAnd the right thing to happen is for you to take it and run with it. And that's really was just powerful for me. Cause in my mind, I wasn't thinking that way. I was like, I built this, but for the company, I didn't have that entrepreneur mindset of like, this is mine. I deserve it. And once someone told me that the next day I was in meeting saying, this is how this is going to work, right?\r\n\r\n\r\nThis is going to be mine. We're going to have a fair and equitable exchange. I basically gave back a small portion of equity that I'd owned in the company back to them. So it was a trade off. You got to have compensation both ways. And then I was like, I'm just going to go full time. Within two weeks, I had my first client  balls of steel, man.\r\n\r\n\r\nThat's incredible. I mean,  you know, it's funny. Every, every entrepreneur I've, I've spoken with has been like,  they look back at the first one, not necessarily every endeavor they do, but like the first big thing that they do. And they're like, knowing what I know now, I don't, I don't know that I would do that again. \r\n\r\n\r\nAnd, and I've done this a few times myself where, you know, I've had successful exits and then I look back and I'm like, man,  that one conversation or that one moment, or like one or two things that are different. And my whole life is different  today than it is right now. So I think like just even that conversation that kind of triggered you to realize, no, this is really valuable.\r\n\r\n\r\nI need to stick with this. And then make the decision to jump into a full time is  a very pivotal moment that you'll be looking back on for years. And, and probably just very grateful that you had that experience. And then we're able to act on it. What happened with the, with your other partners? Like, so what happened with you split from the company?\r\n\r\n\r\nWhat did they do? Technology that they were working on was super interesting. And so I don't want to make it like I had no interest in being a part of that. It just wasn't a public facing technology. What they were actually building was a insurance program for stocks. So just like when you go and you buy a flight ticket or a concert ticket, and when you go to check out, it says, Would you like to buy insurance on this in case you can't make it?\r\n\r\n\r\nThey were building that for stocks. Now, of course, people know that as puts nowadays, but the problem with puts is they're called a hedge and they have, they're mostly used by hedge funds. And the reason for that is it's for people with large quantities of money, right? You have a ton of money and knowledge.\r\n\r\n\r\nYou can use puts accurately this firm, and this is not the legal term, but I don't work for the company. So I can say this. The goal was basically fractionalizing puts the same way that you fractionalize shares, taking a put, which hedges you to a hundred shares. Fractionalizing it. Now you can buy a put against one share, two shares, half a share and love the concept.\r\n\r\n\r\nAnd the investors were fascinated by it, but that type of product makes money by going and really being sold by an, to an institution like Robin hood or someone else, right? It's not the type of products where you have someone going on social media every day.  However,  after two years of building, they recently in the last several months ended up finally getting into market and realizing that there was a market for retail investors.\r\n\r\n\r\nBy this point, I had built an audience of hundreds of thousands of followers. We reconnected and I'm actually assisting them with the marketing campaign to target retail investors. And ultimately this will be a product that does end up, I think, Being bought by a brokerage because it just makes so much sense for it.\r\n\r\n\r\nBut yeah, it was  Yes,  that's really cool how it came back together, right? Like just  Life can be beautiful like that sometimes but for you to go out on your own They're out on their own and then both from the positions of success you're able to work together furthering each other's Vision. I think that's, that's really, really cool.\r\n\r\n\r\nMy  COO who's incredible has told me that the number one thing that I taught him about how I operate is I never burned bridges. I just traveled them less often. And that's what happens. You know, we, we splintered, but we never like had a bad outfall or anything. And it wasn't like we were talking all the time, but we still anybody that wants to be in contact.\r\n\r\n\r\nI'm here.  All right. So you now have, you have wolf financial and it has the social media marketing arm. It has the selling ads to corporations arm on your platform. There's a third arm and now I'm blanking on it.  It's the agency where we're managing other content creators. And also I will say underneath Wolf Financial, we have built multi brands that are actually have their own accounts now hosting spaces.\r\n\r\n\r\nSo we do have Wolf Sports, which just finished their space right now. We do a betting show every Friday. We've got Wolf News. Which does news and politics shows pretty much daily. And then we have wolf web three, which is probably the most popular brand outside of will financial, which is fully dedicated to crypto and web three.\r\n\r\n\r\nSo you'd like, you're describing a really sophisticated  channel strategy, marketing strategy, as well as product strategy. Where did this come from? What did you major in at Drexel?  Okay. Major in finance and Drexel, but the stuff that you're describing doesn't come from a finance background. Like you're building a media company.\r\n\r\n\r\nThat's different than a finance company. How in the freaking world did you get up to speed? Like,  do you have team members that you've added? Is it just consumption? Like, are you know, are you modeling after what are those guys names? Who dang it. I'm totally blanking. The guy who has like pizza Fridays and.\r\n\r\n\r\nBar stool, are you just like, is this pathy or, oh, no, no, no. Bar stool. Yeah. Yeah.  Like are you just looking at them and thinking like, okay, I'm gonna reverse engineer that. Like where is this coming from? This like level of sophistication that you have. I think a lot of it  in regards to the being a creator side.\r\n\r\n\r\nAnd operating as a creator and help out my friends a little bit with getting them some business that was going just by me being me. And I was doing that for a couple of years. Now, things changed within the last eight months. I would say about eight months ago, I hired a COO who came on board and added structure to the company.\r\n\r\n\r\nThat really was not a structured firm. It was simply me kind of like showing up every day, right? It was me saying, Hey, if I show up every day and I work 10 to 12 hours a day, good things are going to happen.  But by bringing in a COO that added structure to it, and my COO actually was the one who had the vision of saying, Hey, you built this amazing brand.\r\n\r\n\r\nWhat if we start now creating brands underneath it? And he launched wolf web three, almost solo, um, pretty much and got it structured. And now we've hired multiple more team members that actually run that. And he's kind of built them up into their positions. He also was the one that was telling me, Hey, Like you should be an agency, right?\r\n\r\n\r\nHe designed our entire website so that we could become an official agency. He found a dev team to help build it out. So I think it's surrounding yourself with the right people. We now have, I think, eight people on payroll. Dude, that's amazing. That's a real team.  So it's a real team.  Oh my gosh.  Walk me through the decision to make that hire at COO.\r\n\r\n\r\nI mean, you're probably making good money, you know, getting ads, easy decision.  Why, why was it an easy decision?  He made it an easy decision because he's a fantastic human being. And the way that it started was actually with a cold DM to me that was sent by him simply telling me, Hey, I think, so I put out a schedule every week with all my spaces and that to me, it's always kind of, I think set me apart from others is nobody else was doing that a full design schedule.\r\n\r\n\r\nEvery speaker has a spot on it. It shows people time slots and everything. And he said to me, just cold DMS me and says, Hey, I think I could do a better version of your graphic that you're putting out each week. And I reply and I said, happy to see it. Not really interested in paying for something like that, but I'll give you a shout out publicly if I use it.\r\n\r\n\r\nAnd he goes, no, I don't need any credit. I just want to help out. And I go, okay, like let's hop on a call and talk. So well, actually, first I was like, let me see what you got. So I see him like he sends me the next day, like modeled out stuff. And I'm like, wow, this dude just put like four or five hours Into this overnight, and I literally told him, like, I'm not going to pay him or anything.\r\n\r\n\r\nI was like, let's get on a call. So we get on a call and he starts showing me. I'm like, wow, you've just been spending all day on this. Like, this is just what you've been doing at a whim. And he just starts throwing big ideas at me. Well, like after I finished this, what if I worked on this for you? Well, then what if I did this for you afterwards?\r\n\r\n\r\nWe have not disclosed any type of payment. Basically works for me for a month for free. He made the best pitch ever. It was,  Hey, would you possibly just be able to give me enough money that I can afford to keep doing this for you? Right? Like it's such a different mindset that I think people are like, pay me and then I'll do work for you.\r\n\r\n\r\nHis was, I'm going to do work for you. Hopefully you will compensate me so I can keep doing more work for you just so I can afford to came in with, you know, Hey, let me go at least working for a day or two with a week for you. And then it was like, all right, I just need you full time, you know, and now, you know, we're just, we've scaled up every single month, um, to be honest.\r\n\r\n\r\nAnd we just, we just keep increasing. And where was he from? What was he doing at the time? So really interesting backgrounds. He was a designer for a decade. He worked in, yeah, design roles at a number of. Sizable firms. And I think that this dude just had such a knack for operations that maybe he didn't even know that he had and because he started out doing design work for me.\r\n\r\n\r\nBut then I saw this operational decisions that he was making and what he was doing. And I actually used to work as C. O. O. Previously at my startup that I was at beforehand. And I was like, you can be exactly what I did for them. And I just started shoveling them into that role and it worked out perfectly. \r\n\r\n\r\nThat's amazing. We just hired a chief of staff for, for our companies and similar experience, right? We talked to him, we meet him very bright, exceptional intellect and experience. And when it came down to the compensation, it was basically like, I don't care what I'm paid. I just want to work with you guys. \r\n\r\n\r\nAnd we were like, that just. It's just signifies a level of commitment that you can't  fake.  And it's been an amazing decision for us because they just, they're just bought in, they're bought into the vision and they really want to see it be successful. So I, I love that story, man. I don't ever want to run, like I'm not a leader by fear or any of those types of things, but I expect excellence.\r\n\r\n\r\nRight. And I expect the highest quality and, and things like that. I've always basically been taught, if you can't get the little things right, why would somebody ever trust you to do the big things, which some people don't think that way. They think I need to nail the big things. Who cares about the little things, but I see it the opposite way.\r\n\r\n\r\nAnd so when someone can come in and they have a passion for the company and they're doing it that way, it really speaks to me.  Was it a financial hardship for you to hire him?  With the company that was like, Oh no, we can afford this. And it makes sense. So I think, you know, right in the beginning, it was a little bit of a leap of faith, but  I will say, ever since we brought him on, we've been by far having our best year as a company.\r\n\r\n\r\nAnd so it's really shown the value, right? Like, Now at this point, I mean, he just closed me a contract. That's probably going to pay for him for like six months. I mean, he's gotten to the point where he's going out and creating value every single day. And I've told my other employees that I've hired the same exact thing.\r\n\r\n\r\nI was like, look at what he did. He made himself invaluable to the company. And he actually is making the company more than I am paying him, which makes it the biggest no brainer in the world. Yeah. To hire him, give him raises, everything like that. And so that's how the other guys, like, I just tell them, like, look at that example, like go out and make me more money than I'm paying you.\r\n\r\n\r\nAnd I will keep giving you raises. Oh, and I think that experience is a perfect example of what many entrepreneurs go through when they're growing. For the first time they're like, Oh, I'm growing. I found this cool person. Can I afford them? No. And you know, they're looking right now at the way the business is currently constituted and the cash flows that it's currently generating and thinking, I don't know, can I afford this person? \r\n\r\n\r\nAnd after you've gotten some experience, you realize, Oh, by bringing this person, it's going to unlock all of these other things, right? He starts taking administrative tasks off your plate or the things that maybe you're not as talented at. Frees you up to do. What your world class at and what happens all of a sudden you're generating more business.\r\n\r\n\r\nAll of a sudden you're more profitable and he more than pays for himself. But it's that first time that you like, take that step and make that higher. And it's scary that it's, it's hard. Uh, but looking back, you're like, okay, that makes sense. And it just gives you more confidence to hire that next person. \r\n\r\n\r\nYeah, 100%. And now our model that we've worked off of is as I hired new people, I've had a lot of people that have come in And I either intern for a few months, shown that value really like, Hey, I am somebody that wants to be here and I am a value add. And then they move on to getting paid. I've had people that come in off Revshare of the business that they're touching, the business that they're bringing in.\r\n\r\n\r\nAnd then after a few months, they start getting a base in addition to Revshare. So I like to create just different models, depending on the person. So you've got a lot going on. You've got, like I said, you've got companies coming to you saying, Hey, can we market with you? So they're buying ads essentially from you.\r\n\r\n\r\nYou are also helping influencers get more customers. And then you you're acting as an agent to influencers as well.  You also are now creating these media brands,  which of them are your favorite? When you sit back and look at it and you're like, Oh man, I just love what.  X is doing right now. Well, it's different when you say, Oh, I see what you're saying.\r\n\r\n\r\nWhen I hear someone, I would say, I love what X is. Oh, why? Sorry. Sorry. Yeah. In my head. Yeah. Yes. You're good. Throw me off for a second there.  Okay. So I've told everyone I love finance and specifically why I love finance and the whole side of things. I've shared this on podcasts before, but my family took it really tough in the crash of 08.\r\n\r\n\r\nMy dad was a doctor prior to that. He was making a ton of money. Okay. He decided to go all in on real estate in 07, lost pretty much everything, had to declare bankruptcy. I wasn't that old, but I completely remember everything. Like my whole life shifted and changed. I felt like overnight and I went into a very different thing, splintered the family a bit, so on and so forth.\r\n\r\n\r\nAnd I came out of that. And I was like, I just want to be able to show others that it's not just about how much you make, how much you keep right. And how much you keep for generations. And so I've really built a model around making sure that nobody has to go through that because, you know, we didn't have to go through that.\r\n\r\n\r\nLike, it could have been like, Hey, I'm just going to put 25 percent of what I have in 50%. It doesn't have to be 100%  Into a risky thing. And so for me, finance is a passion for that. But my true passion, like what gets the blood going is sports. And so when we were able to, you know, I was trying to like join into other sports shows and throw them here and there.\r\n\r\n\r\nAnd I was like, somebody do something fun on here with sports. They can be a part of it. And eventually I was like, you know what, I'm just going to do it myself. And we launched Wolf Sports. I found hosts to run three shows a week. We have multiple sponsors interested in working with us. We just are finishing our first collaboration, which is going to be with karate combat, which is essentially like a UFC style sports league.\r\n\r\n\r\nWe are going to have a booth at the next karate combat events, ringside doing live commentating for Wolfsports.  So for me, like that's where the blood gets going. And so it's not. It's not profit. I mean, we actually,  what's your, what's your favorite sport?  I love football. Yeah. I love football. I like basketball a lot too.\r\n\r\n\r\nYes. Big Ravens fans stadiums about 20 minutes that way. Who's your team with basketball? Is it, is it the wizards or the bullets or the whatever they're called? Basketball is a pain. So yes, the wizards are technically the closest team. They were the team growing up when we had John Wall, you know, we would hit the John  I went to school in Philly, so I do have an affinity for the Sixers, but God bless that maniacal team of misfits.\r\n\r\n\r\nAnd then outside of that, you know, I, I do like players, right. And I definitely have like players around the league that I'll really like, you know, Steph Curry. I think I really enjoyed for a long time because, you know, I think people look at it like, damn, that dude is literally the same exact size as me.\r\n\r\n\r\nAnd he's out there on the court, you know, doing this. I love Lou Dort. Nobody will ever stop me from doing that. I like guys that defend, I like Lou Dohrt, I like Drew Holiday. I'm friends with Jalen Brown's brother, me and Jalen Brown's brother. I've hung out a few times and his cousin. So Jalen Brown, man, I just read the, I just read that ESPN story on him.\r\n\r\n\r\nHe is a visiting professor or maybe a visiting lecturer at MIT, the youngest visiting lecturer. Ever. And he's teaching in robotics. It's not even like he's like sports media or something like that. He's teaching robotics. Like that guy is on another level, man.  Yeah. And then, and then I really love sports commentating, especially with combat sports, but also, I mean, NFL and everything I've done a lot of like I'll do voiceovers.\r\n\r\n\r\nAll these sports commentating, but I've always just done it for myself and for the fun of like screaming in my room. And now there's people that actually want to hear it, which is very interesting to me, like getting out there and actually like watching them walk into the ring and like shouting out, you know, like fighting out of the red corner, you know, it's like doing the intros and everything.\r\n\r\n\r\nIt gets really fascinating. You're like,  Ladies and gentlemen, welcome to literally, yeah, that's awesome. You know, I love, I like have like intros memorized, you know, for better BF. It was like 19 and out a mixed martial artist Heralding from, and you know, just kind of going down my line. Michael Buffer or whatever it is. \r\n\r\n\r\nDude. That's amazing. Can you, before I get into like the ending questions, how comfortable are you sharing  the size of where you are now? Because obviously you've been doing this for,  is it three years that you've really been like a little bit over a little bit over three years. Yeah. Okay. And in three years you've built.\r\n\r\n\r\nObviously a lot of different service lines. You've got different brands. It says, you said you had eight people on payroll. Now,  can you give some like size and scope? Like what does that represent in terms of revenue or what does that represent in terms of, you know, the number of creators that you're representing or what does that represent an ad spend that is funneling through your agency, kind of whatever way you measure.\r\n\r\n\r\nSize.  Oh, yeah. Yeah. I can give a little bit of context. So in regards to follower size across all of our channels, we have about half a million followers at this point that are underneath the Wolf brand.  And then when you add up all of the creators that we're managing impressions wise, it's about half a billion impressions a month.\r\n\r\n\r\nHalf a billion impressions a month.  Yes. Yes. And about 13 million followers. Maybe right around there  that it's hitting so yes, so it's pretty sizable at this point across several channels and especially, you know Sometimes you just meet like one connect and then they're managing, you know, a bunch of stuff now you bring them into your organization It's like, okay cool.\r\n\r\n\r\nNow we have so much more reach So yes, the numbers are pretty big about half billion impressions a month half a million of our own followers, which is great That's incredible  Tens of millions of impressions across their own content every single month, you know, revenue and other numbers wise, they don't share too much of that publicly, but enough that we can support a staff, right.\r\n\r\n\r\nAnd we can continue to build. When I look at the company, it's hard to put like a perfect value on it with where things are going and revenue. But like,  I think it's certainly worth, you know, at least a few million dollars, maybe several, maybe more than that. But he would put, you know, the valuation on it.\r\n\r\n\r\nIt's, it's, I've never been acquired, so I wouldn't really know. I like to think so. Are there any businesses that you look at as like a model? Obviously for me, barstool comes to mind because they did something very similar in the sports media space. But is there any, are there any other models that you look at that you're like, okay, they did it, right?\r\n\r\n\r\nI think I want to model some things. And it may be a couple of companies that you look at, but how do you think about where this company is evolving into?  Yeah. So it's honestly tough to compare because we have a very large focus. So when you talk about, you know, traditional, like the agency side, there's a lot of agencies.\r\n\r\n\r\nIn fact, the agency that we modeled off of for like our website and our initial ideas was the agency that manages Mr. Beast. So it's funny enough that you kind of like message mentioned him. I'm trying to remember what they're called. It's like night. co.  Yes. So Knight Talent or knight. co, if you take a look at them, they manage pretty much all the big YouTubers.\r\n\r\n\r\nWhen you go through that page. So yeah, they have like, like a ton of them. Knight. co is their big thing. And so they're the guy who's running that. I think that, you know, he's done a great job and they actually have built a similar vision to what I want, because when you look on their website, they have more than just, you know, our roster of talent.\r\n\r\n\r\nThey have something called labs, which is where they're actually like a venture studio. That pairs with creators and operators to build company. Interesting. And maybe at some point we can have a venture arm. So many people have asked us like, Hey, why don't you have a fund and stuff like that? I'll be honest.\r\n\r\n\r\nIt comes back to my essence of doing this, which is wanting people to build their finances. In the right way. And if I was going to do a fund, you know, I wouldn't want to just jump into that because like I have audience, I would want to have someone on board that has done that previously experienced provided great returns for investors, right?\r\n\r\n\r\nLike I wouldn't want to just take a chance because it can make me money. There's not how I operate. And then, and then they have ventures. So, so like I model off them, but specifically for us, we're like super spaces focused, we're doing 60 hours a week of live spaces across our ecosystem, which is pretty much,  pretty much more than anybody else in the world.\r\n\r\n\r\nMaybe, maybe Mario to fall with his company is doing a similar amount of hours. I don't think that there's too many others. And I. Certainly don't think anyone's doing it across four different channels. Maybe he is, he has like crypto roundtable and a couple of others. So there's like three of us maybe in the world that are pioneering this business model.\r\n\r\n\r\nAnd I was the first one to do it.  Why are you so bullish on spaces?  Bullish on spaces. First off, I think I had the competitive advantage. Like there's a lot of competitive advantages you can have. My competitive advantage was that I was first, right? Yeah. And just by being first to it and knowing it inside and out, I have actually hosted a space every single week for the last three years and two months.\r\n\r\n\r\nI haven't missed a single week, even once man. It doesn't matter if I'm sick. It doesn't matter if I lose my voice or if I'm on a cruise ship. I still have hosted spaces throughout. The entirety of that time, or I figured out a way for my team to be live and I jump into the space from another place and host.\r\n\r\n\r\nAnd so there's so much consistency to it. But for me, the reason that I think I love the spaces is I love live content and I love podcasting and I think it would be very difficult for me to be on camera for 7 to 8 hours a day, but I can host spaces. For as long as the day is I've done days where I do 11, 12 hours straight on spaces with no breaks regularly.\r\n\r\n\r\nAnd so I just think that, you know, it's such a unique type of technology and the other beauty to it is it's where my audience is. Right. And so it's like, I'm not sending them to Spotify to something. It's just live right there when they come in.  How do you think about spaces in relation to like YouTube?\r\n\r\n\r\nYou can, you can just live stream. On YouTube and people can come and join and ask questions. It's not the same obviously with the interaction because their comments versus people actually, you know, asking you and interacting. But  how do you think those two compare?  I think that there's a ton of value in YouTube.\r\n\r\n\r\nIt's probably the hardest platform to grow on out there. I do like the reason I got this whole streaming set up was because I wanted to do a stream to YouTube and the spaces hasn't really happened in the way that I'd like to yet. But I did do a recent YouTube stream the other day. And I think that honestly, it just makes sense to do both to me.\r\n\r\n\r\nLike. That's the beauty to creating content is you can disseminate it across multiple channels. So a lot of my content, I'm not perfect at this. Matt Gray is probably like the epitome of doing this properly, where he'll like write a newsletter and then that newsletter gets turned into a thread. And then that thread gets turned into three videos.\r\n\r\n\r\nRight. And it's just like a trickle down forum. And so I need to get better at that. But for me, I think spaces are just like, Hey, what's the way that I can do content that I enjoy and I'm passionate about, and I can do it all day without burning out.  Well, let me just say at 25, I can't freaking wait to.\r\n\r\n\r\nWatch you over the next 10, 20 years, build what you're building. Cause it's, you're obviously very bright. You're passionate about it. You've got a clear vision on what you want to do, but you're also consistent about staying focused, which I think is really hard for entrepreneurs, it's easy to get distracted, but you've got this like level of focus and commitment that is admirable.\r\n\r\n\r\nBecause someone in your position, it's seductive to look at your audience and think, Hmm, I've got distribution. Hmm. I could do this. I could do that. I could do this. But, and I compared you to Mr. Beast earlier. It, you know, it's a similar mindset where you're very particular about what opportunities you bring on.\r\n\r\n\r\nAnd I think that's going to accelerate your growth. It's not going to decelerate it. It'll be an accelerant. So  it's been awesome. Yeah. I will just say, I'm super impressed by Jimmy, you know, Mr. Beeson, what he does, because what took him to the next level is that confidence is such a high confidence in what he was doing, that he reinvests all profits back in.\r\n\r\n\r\nAnd he's spoken about this on a lot of podcasts, how like, you know, they'd make a hundred dollars, they put a hundred dollars back in and make a hundred thousand, they put a hundred thousand back in. I think for me coming from my background, that place of insecurity financially, I have, you know, really tried to get savings going and things like this that I just.\r\n\r\n\r\nSaw people not having, and so I negatively affecting them. And so I'm so impressed by him with like the cohonies to actually just go all in every single day. And I don't know, maybe that would have been better for my business. Maybe it would have put me in a tough mental state, but if you can do that, you know, props to you. \r\n\r\n\r\nYeah, I think I'll, I'll just add my own psychological advice here. Like when I sold my companies, I remember talking to our wealth manager and he was like, I asked him, I'm like, how much cash should I have on hand? How much should I have in stocks? How much should I put in these companies? And  basically his advice was like, whatever helps you sleep at night.\r\n\r\n\r\nI'm not saying that  Jimmy has done it right and you've done it wrong or you've done it right and he's done it wrong. I think you've done it right for you. And I think you got to, you have to get comfortable with the level of risk that you're willing to take. But what's admirable about what you've done is you're not allowing distractions to come in. \r\n\r\n\r\nAnd take you off of mission because you, you know, you're still very committed to what you're trying to do. And, and he's done that as well,  but even though you, you're not necessarily reinvesting a hundred percent of everything back into the business, the fact that you're focused  in my mind is like, you are reinvesting a hundred percent of your time and energy and talent, and that, that is exceptionally valuable.\r\n\r\n\r\nSo I wouldn't, I wouldn't discount that at all.  Yeah. And then it comes from that, that circle and you could see it in his early videos, right? He had, you know, Chris and other people around him that were just, I think, believing in him, right? And saying, you're gonna go do this. And you clearly got a family kid walking in.\r\n\r\n\r\nAnd, you know, for me too, like, that was a big thing with my company and just having people around me that were like, We believe in you. You're going to be able to do this. Um, they knew that I'd go and put in 10, 12 hours a day consistently every single day of the week. They didn't have any doubt about that, but you know, they just looked at me and like, Hey, you need to talk to us about anything.\r\n\r\n\r\nYou need support. If you really need us to come through on this area or this area, when I've really needed people, they've stepped up.  That's awesome, man. All right. I got some rapid fire questions for you to wrap things up. You ready?  What do you love about this business?  Ooh, great question. I love the energy of the business.\r\n\r\n\r\nWe are a high energy business. Every single day I can show up and it doesn't matter if I'm having a terrible morning or if I'm tired, people will expect me to get on that mic and be booming. And when I get into calls, people just draw it out of me. And  I was at an event this weekend. I was sleep deprived, but the second I was around people, I was lively and I didn't even feel it until five hours later.\r\n\r\n\r\nAnd I think so for me, it's like people and energy. I'm not in an office, you know, stuck all day. Even though I sit in this room, I'm really out there in the digital world communicating every single second.  Uh, okay. What do you hate about it?  That's a good question as well. What do I hate about it?  Hmm. I don't know if I hate anything about this.\r\n\r\n\r\nI will say probably, you know, by putting yourself out online in the social business, you attract negative energy, right? Like I'm Jewish and I probably every single day, like somebody is anti Semitic, right? Like on the internet, probably once a day, at least other stuff like that. And it's hard. You know, just as like a person, I think anybody, when you have like hate coming your way and you're like, they don't even know me, like they don't know, I know I do this or do this for the world.\r\n\r\n\r\nYou know, they see one specific thing and you take that. So like, I try to just like put myself in a place of like, you know, these are not real problems. Like people that are online have this, there's much bigger problems with the world I've been through worse, but it can be tough, you know, just being out there and facing it. \r\n\r\n\r\nGood perspective.  Okay. This next question, all of us, it's a human, it's a human characteristic that all of us kind of see grass is greener sometimes. For example, real estate guys are really jealous of business guys. Business guys are really jealous of real estate guys. Cause they all think that, Hey, what they're doing is actually easier.\r\n\r\n\r\nAnd it'd be so much nicer to have an asset or steady cash flows as you sit here in  2024. What businesses are you jealous of right now?  Ooh, good question there as well. Businesses that I am jealous of. I, I mean, you might've nailed it there with like barstool and some of these items because they've taken this model and they've really scaled it for sports.\r\n\r\n\r\nAnd I think people that have these strong sports conglomerates and items like that, because I'm just getting started there. So I do have a little bit of that jealousy, right? But it's not a jealousy of like, I hate them. It's a jealousy of like, I'm impressed by what they did. And I would love to have something of that caliber one day. \r\n\r\n\r\nThat's a good answer. Second to last question. Okay. If you have two hours in your day, you don't have to worry about work. You don't have to worry about family, nothing, and you can do whatever you want.  What are you obsessed with right now?  Okay. So it depends if I've already worked out that day. If I've already worked out in the morning.\r\n\r\n\r\nSo I try to work out five to six days a week lifting usually. And I try to get that done in the morning. Like right when I wake up, if I haven't done it in the morning because I had to get some sleep or something came up like a meeting and I have two hours during the day, even if an hour, really an hour 15, I'm going in and working out.\r\n\r\n\r\nThat's like number one thing. If I have free time and I don't work out, I get really mad at myself later in the day that like, what are you doing? Why didn't you go work out? Right? Like you should have been, you should have been doing that. So that's like, number one thing. Number two is probably going to be eating.\r\n\r\n\r\nI am on shows sometimes 12 hours a day. I eat. Between I bites, like my bites in between, you know, this, and when I have like 20 minutes to like go and actually make food and eat, it's kind of like a treat. Almost. I don't have a lot of meals where like I sit down and I just have like a normal meal, but it's always very hurried and running and stuff like that.\r\n\r\n\r\nSo. Like, honestly, I think those two hours are like taking care of myself, to be honest, is what I'm obsessed with. Like when I have the free time, because all the other time goes to work. So working out, eating, doing my laundry, cleaning all the things that I just don't have time for all the rest of the day. \r\n\r\n\r\nLove it. All right. Last question.  What advice would you give yourself five years ago,  five years ago?  So I would tell my usually I usually say 10 years ago, but you would have been 15. So I'm like, yeah, we'll go. We'll go five. Yeah.  Yeah. Five years ago. Honestly, I was really going through some, some crazy times in life five years ago.\r\n\r\n\r\nI would have really told myself like one, you're going to create your own business and it's going to work out. And two, All the stuff that you're going through this year and next year, it's all going to work out and you're going to come out of it. Okay. And to be honest,  it'll like all the craziness that you're dealing with in life.\r\n\r\n\r\nThat's going to make you throw yourself into work. There's a reason that it's happening and it's, it's for the best.  That's a really great perspective, man. I beautifully said,  well, this, did anybody say invest in Bitcoin?  Nobody said invest in Bitcoin yet.  That would be some pretty good  invest in NVIDIA and Bitcoin.\r\n\r\n\r\nNo, no, no. Go and leverage. No, anyways. Well, that that's a whole nother conversation. This was fantastic, man. I really appreciate you taking time. Where's the best place for people to come find you  Twitter at Wolf underscore financial. You can find me there and then you can find all of our other stuff by going through that channel.\r\n\r\n\r\nOur website is also just www. wolf. financial.  Perfect. Can't wait to continue to watch your eyes, man. This was fantastic. We'll talk soon.  Thank you so much. All right. That's it. Another one for the books. I I'm fired up. I don't know what else to say. I hope you found something valuable in that conversation.\r\n\r\n\r\nI hope you learned something. I hope there's something that you can apply to your business today, tomorrow in the future that. It makes you money. It makes you more successful. It gives you more time with your kids. If there was something I'd love to hear about it in the comments below, you know, give me some feedback.\r\n\r\n\r\nAnd if you like actionable advice and you want more of this, I write a weekly newsletter that gives insights, tips, and tricks into the world of entrepreneurship. Subscribe in my bio.  And if I can help you in any way in your entrepreneurial journey, don't hesitate to reach out to me. Nick at cofounders.\r\n\r\n\r\ncom. Sorry, Kelly, for more emails. And the last thing is. Remember,  curiosity is a superpower and you can use it to your advantage. As my mom used to say, there's no such thing as a dumb question.  Only dumb people.  We'll see you next time.",
  "metadata": {
    "duration": "",
    "date": "2024-07-24",
    "platform_source": "Google Drive"
  }
}