{
  "episode_number": "117",
  "episode_title": "How He Used Legacy Media to Build a $100M+ Business Empire with Craig Fuller",
  "guest_name": "Craig Fuller",
  "business_name": "Freight Waves, Sonar, Firecrown",
  "transcript": "﻿Nikolas Hulewsky (00:00.673)\r\nOkay, Craig, you're a prolific entrepreneur. You move fast. You've got a lot of businesses. I tried my best to summarize everything that you're doing. So I'm going to list it out and you tell me where I'm wrong. Okay? So we've got Freight Waves, which is the largest shipping distributions logistics media company in the world. Then you've got Sonar, which is attached to it, which the way that I think about it is like Sonar is the Bloomberg terminal. Freight Waves is like Bloomberg Markets, the media arm of Bloomberg.\r\n\r\n\r\nCraig Fuller (00:30.04)\r\nYou nailed it. You nailed it. Yeah, that's right.\r\n\r\n\r\nNikolas Hulewsky (00:30.911)\r\nIs it okay? Cool. I've listened to a couple of interviews and I've heard you talk about Bloomberg and I haven't heard you explicitly state that, but I'm like, seems like that's.\r\n\r\n\r\nCraig Fuller (00:37.282)\r\nNo, that is the exact interpretation.\r\n\r\n\r\nNikolas Hulewsky (00:40.201)\r\nOkay. And then you've got Firecrown, which are sort of an amalgamation of these, the way you call it, affluent enthusiast magazines or subscription media companies. Flying Magazine is one of them. Yachting Magazine is one of them. Model Trains, I don't know the exact name. Magazine is one of them. Did I miss anything in there?\r\n\r\n\r\nCraig Fuller (01:02.884)\r\nNo, mean, it's really just happens to be transportation. Even Astronomy magazine, which has, you know, it's ultimately about, it's a science publication, but there is a transportation element, obviously rockets is a part of that. So it's really, it happens to be around transportation and it happens to be around affluent. Freight waves is obviously what I think the best way to sort of think of it is what Bloomberg does in the financial side of the economy.\r\n\r\n\r\nbetween sonar, our data business, and between freight waves, our media business, we aspire to do in the physical goods economy. And that's how we think of\r\n\r\n\r\nNikolas Hulewsky (01:39.798)\r\nCan you give us just an idea of what's the revenue breakdown from each one of those company's employee counts?\r\n\r\n\r\nCraig Fuller (01:47.19)\r\nYeah, between all of the companies, over $100 million, if you looked at it in terms of employees, you're about 400 folks that are sort of full time. And then we have a number of contractors, particularly in the media side where we're paying someone to write a regular column and that's measured a couple hundred as well.\r\n\r\n\r\nNikolas Hulewsky (02:06.945)\r\nHow do you look at it? Do you look at them all separately or is it like, okay.\r\n\r\n\r\nCraig Fuller (02:11.182)\r\nyeah, they're totally different businesses. In fact, there's different cap tables, there's different investors. So Sonar, the data business. So Freightways is really my first sort of business that I founded associated with media. And we found it hard to sell data. Venture backed businesses, know, media is not an attractive venture investment. And so anyone that's an aspiring media entrepreneur should not look at venture capital as the right way to go raise that capital.\r\n\r\n\r\nBut we found that if we wanted to create a data business that we had to both educate people with new data sets, but also evangelize it, we found that media was the right path to do that. Michael Bloomberg has written about that in Bloomberg, by Bloomberg, which is really the concept of using their own media business to drive top of funnel to the data business and the data terminal business. And it was the same way we built Sonar, which is our data business, but really was driven by Freightways Media. That was where I discovered media.\r\n\r\n\r\nand then I had a knack for it and a love for it and a passion for it. And so I bought Flying Magazine, went and bought another, I think we own 50 different publications now. And then earlier, well, this is in 2024, I ended up buying the Freightways media business. So a totally separate cap tables, totally separate operations. Firecrown is our truly media business and Sonar is the data business.\r\n\r\n\r\nNikolas Hulewsky (03:37.153)\r\nCan you give an idea? All right, so if I'm going to break it up into three categories, fire, ground, fray wave, sonar, percentage basis of the 100 million in revenue where...\r\n\r\n\r\nCraig Fuller (03:42.649)\r\nMm-hmm.\r\n\r\n\r\nthe media business is far greater as a percent than Sonar. Yeah, because like in terms of valuation, if you were to evaluate those businesses, the data business is exponentially worth more on a multiple basis than media. Media trades at a multiple of EBITDA, subscription data businesses trade at a multiple of revenue. And so if you looked at it from a value standpoint, Sonar is the most valuable asset that I run.\r\n\r\n\r\nNikolas Hulewsky (03:48.16)\r\nIt is.\r\n\r\n\r\nCraig Fuller (04:13.956)\r\nbut the predominance of revenues go through the media business.\r\n\r\n\r\nNikolas Hulewsky (04:18.921)\r\nDo you lump freight waves and Firecrown together as media?\r\n\r\n\r\nCraig Fuller (04:22.976)\r\nYeah, correct. So Freightways is now, Freightways Media, this is so confusing, because Freightways Media, which used to be a separate company, is now a part of Firecrown and Sonar is a separate business entirely. what happened is that, know, media businesses, only 25 % of it is sort of value-added to a consumer. In other words, if you think of media being the product, the content is the product, a very small portion of what it takes to run a media business is actually content production.\r\n\r\n\r\nNikolas Hulewsky (04:31.956)\r\nokay.\r\n\r\n\r\nCraig Fuller (04:52.004)\r\nin the product itself, the predominance of is an infrastructure. It's ad cells, it's editorial that's non-value additive, it's layout if you're in magazines, it's audience development, it's all this stuff that frankly you and I as consumers of media could care less about, but if you run a successful media business, we have to have that infrastructure. And as we looked at the media business for FreightWaves, it made sense that you had all of these, all of this infrastructure.\r\n\r\n\r\non the fire crown side that we could then layer into freight waves and get more economies of scale. At the same time, the data business is far more valuable for investors.\r\n\r\n\r\nNikolas Hulewsky (05:32.299)\r\nSo a lot of times we look at founders as like clairvoyant. man, they had a vision and they executed it and that's all they did. know, Henry Ford and Steve Jobs are the ilk of, hey, if were to ask the customers what they wanted, they would ask for a faster horse. You know what mean? Were you that way? Were you like, all right, I'm starting Freight Waves. We're to be a freaking media company. Or was this meandering process?\r\n\r\n\r\nCraig Fuller (05:45.066)\r\nYeah.\r\n\r\n\r\nCraig Fuller (05:52.566)\r\nNo. And I wonder how many of those, it's always like the victors write the history and you sort of look back in time, whether it's Steve Jobs, Elon Musk, know, some of the great founders, Henry Ford. And I would argue that again, I'm not, don't know their personal biographies, but I would argue that oftentimes in business, what you start out with as an idea and a concept is often not where you end\r\n\r\n\r\nAnd I think what makes successful founders and entrepreneurs certainly been the case in my case, but I know many others, is that you're malleable and you are responsive to information. And you may have the same goal in mind, but how you get there and what the journey that it takes is quite different. So when I started FreightWaves, it never was a media company to begin with.\r\n\r\n\r\nThe goal is to bring transparency to freight markets. It's this big, huge industry that's quite opaque and nobody really knows what's going on. And our goal is to create a, idea was a futures market was the idea that we're gonna, futures markets is like wheat and oil and gold things and commodities. And you can trade those things and you sort of know what the real time pricing of those products are, but you also know what the future pricing is. And there's this whole information ecosystem that's around it.\r\n\r\n\r\nThat was the original idea, was to create more transparency and help companies understand what was happening in the market. We ended up launching futures contracts, but they weren't very successful in themselves. But out of that, we found that the market needed data and it needed information and news. And a friend of mine dropped off Michael Bloomberg's biography, Bloomberg by Bloomberg. And I read it and that was in many ways the playbook that I've adapted into Freight Waves.\r\n\r\n\r\nAnd so that's how I got into media. You know, if you had asked me a decade ago, if I'd be a media executive, I would have thought you were nuts because again, writing, I was a lazy, lazy student and writing assignments. And I went to a school where we had never seen a multiple choice exam. it was an all boy boarding school in Tennessee. And, I had never seen a multiple choice exam until I got in college and you have these Scantrons that you would take.\r\n\r\n\r\nNikolas Hulewsky (07:58.34)\r\nYeah.\r\n\r\n\r\nCraig Fuller (08:15.958)\r\nEverything was writing and I hated and loathed writing. It wasn't until I started freight waves and really after a couple of months that I realized I was actually kind of, I was good at writing, but also that I could build a media business out of it. and that sort of came about, but I think it was more opportunity, that I found that, I had a knack for it and was able to build it. And now it's, you know, it's something I really am passionate about.\r\n\r\n\r\nNikolas Hulewsky (08:41.217)\r\nSo I'm an idiot and I try to break things down in a way that I can understand it. But many companies are like this, but commodities in particular are different from other asset classes because you can trade them 24 seven. They're also, there's this big lag in between sourcing and then the end user actually purchasing the product. So we may know that there's a chocolate shortage or a cacao shortage around the world now because a monsoon hit Western Africa.\r\n\r\n\r\nCraig Fuller (08:54.98)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (09:11.019)\r\nHowever, the price of chocolate isn't necessarily going to go up for six to eight months because you currently have inventory on the shelves that is sitting there that they're going to make chocolate bars out of. so there's this lag time in between the prices, but the futures market prices that in right away, not necessarily the end consumer. Was that the idea with freight waves as you were like, hey, there's a lag for logistics in between whatever, shipping, sourcing, placing orders for different trucks or transportation vehicles.\r\n\r\n\r\nWe're going to be the company that finds that data first and gives people access to it. Was that the idea?\r\n\r\n\r\nCraig Fuller (09:45.154)\r\nYeah, that's right. So it wasn't even data necessarily. It was in our first pitch deck. it was more of building a futures market, which is a data product itself, but it was more to actually create a liquid market that to your point, there's a physical market, which is if you're in talk trucking or oil or whatever, the physical market is the consumption. It's like where the point of consumption happens in the goods. It's where the rubber really meets the road. It's like, if I'm at the gas station, that's the physical market. And that thing is open.\r\n\r\n\r\nall the time and I can go buy fuel. There's this whole financial market that's in the background that really determines the price of both today's cost of goods, but also the future cost of goods, because there's all this arbitrage built into whether if commodities are likely to go up in the future, if we know if we have information, whether it's a storm perhaps that's hitting and knocking out the Gulf Coast and all of a sudden oil prices shoot up by 20 % or $10 or whatever it is, a barrel.\r\n\r\n\r\nthe price today will somewhat reflect that in the future, even though that event may not impact the physical market for months out. And so the idea in trucking is that this is massive fragmented market of hundreds of thousands of companies that are in it. There was no market to really understand and find price discovery. And so we set out to build that. And what we found is that building a futures market is a grand idea that's incredibly difficult to execute.\r\n\r\n\r\nWe were able to pull it off and actually launch futures contracts, but they never became liquid. But what we discovered along that journey is that what the market really wanted was better information. It wanted news and information and it wanted data. And that was ultimately the products we developed. So if go back to the original foundational idea, we ultimately executed what I said we were gonna do, which was bring transparency to the market. But the journey to get there, the products that we released, i.e. media,\r\n\r\n\r\nwere never, they never made the, in fact, when we raised our Siri seed round, which is in venture world, it's sort of like the, sort of the first round you raise, once you get into institutional, because you can raise money from friends and family, which is typically called an angel round. And the seed round is that first sort of like real institutional round. It's not a big, a lot of money, but it's sort of a validation from these institutional investors. Media never even made the pitch deck. In fact, my investors didn't even know.\r\n\r\n\r\nNikolas Hulewsky (12:11.979)\r\nJeez dude.\r\n\r\n\r\nCraig Fuller (12:13.086)\r\nthat they were invested in a media and events company until they came to the first board meeting. And there's what's that? Yeah, exactly. Well, it's a little story here. My investor, who's a very conservative guy, wonderful guy, was at a firm called Fontanellis. And he loves to tell the story to his name is Chris Dahlman. And he came to the first board meeting and he had just been made partner and our deal like was sort of the first deal he had done. So he couldn't screw this up because this a lot of credibility was on\r\n\r\n\r\nNikolas Hulewsky (12:18.721)\r\nSurprise.\r\n\r\n\r\nCraig Fuller (12:43.394)\r\nAnd then we had only raised at this point, $3 million. And he comes to the first board meeting and there's only three of us. It was me, my CFO and him is this is a tiny little board. And I start telling them we're going to do this event in Atlanta. And he's like, wait, what do you even know about running events? And I'm like, and he's like, well, who's going to show up to this thing? And I was like, we're going to have 500 people. And I started listing off the names and he's like, well, that's impressive. But in his mind, he didn't tell me this.\r\n\r\n\r\nis that he had imagined this was gonna be the fire festival because he didn't know that we could pull off an event. In his mind, this is gonna be an utter disaster and we were gonna blow all the money that we had just raised and this is gonna go down in infamy as like a complete disaster. Well, we had this event, 700 people show up. It actually made a profit the first time around that we did, think over a million dollars in revenue. And that became sort of a core part of our business model. But he was like,\r\n\r\n\r\nNikolas Hulewsky (13:16.671)\r\nNo.\r\n\r\n\r\nCraig Fuller (13:37.984)\r\nHe tells, now tells a story. goes, after the board meeting, I didn't know how I was going to go back to my partners and explain that all my capital in this business, I didn't just invested in it was going to go to some event. And, this founder had decided to do this without talking to anybody about it. And so, it just like media never made our pitch deck. never even imagined I would be doing it.\r\n\r\n\r\nNikolas Hulewsky (13:58.027)\r\nWell, a quick aside. So my business partner, Chris and I, I don't know if you've seen him mobile home park guy. He's all over the place right now, but we have this thing where we talk about the fire festival where it's like, not that I'm saying it's okay, but I can understand.\r\n\r\n\r\nCraig Fuller (14:13.198)\r\nDude, the festival was epic. The fire festival was poorly executed, but brilliantly marketed. Like the reason it's so infamous isn't because it was poorly marketed. It was because it was brilliantly marketed, poorly executed. mean, I think the founder of the fire, I can't remember his name, but he's infamous in the fact that he was able to build this groundswell. He executed the marketing effort really well.\r\n\r\n\r\nNikolas Hulewsky (14:19.88)\r\nRight. Right.\r\n\r\n\r\nNikolas Hulewsky (14:39.585)\r\nYeah, it's amazing.\r\n\r\n\r\nCraig Fuller (14:41.944)\r\nBut he just didn't realize you have to actually deliver the prize.\r\n\r\n\r\nNikolas Hulewsky (14:44.225)\r\nBut we, mean, Chris and I talk about it too. We're like, every founder's got this like fake it till you make it part, right? It's like.\r\n\r\n\r\nCraig Fuller (14:50.486)\r\nI think that's, we're all, like at the end of the day, we're all frauds. And if you go back and look at, mean, that's, you have to sort of, cause you have to suspend belief for some period of time. Because ultimately, if you look at all the data, we'll say you are likely to fail. There's a 95 % chance. And if it's just an idea and you're in the ideation, there's a 99.9 % chance that the idea that you have will fail to succeed.\r\n\r\n\r\nNikolas Hulewsky (15:02.816)\r\nYeah?\r\n\r\n\r\nCraig Fuller (15:20.322)\r\nAnd I think what happens with founders is that you are fundamentally a fraud early on because you haven't built anything and you have to sort of defy logic that you're to go build this thing and it makes absolutely no sense. And everyone looks at you like you're completely nuts and you have to tell yourself you're going to make it. You have to believe in it. And I think what makes the difference between the successful ones that get to come on podcast and talk about their business and the ones that\r\n\r\n\r\nsort of fade away in the limelight are the ones that are able to, despite all the odds, sort of manifest something out of nothing. And that's what makes entrepreneurship magic in some ways, because you're able to really build something that just didn't exist before.\r\n\r\n\r\nNikolas Hulewsky (16:05.919)\r\nYeah, and even if you're not founding the newest app or software or something that's literally world-changing, no one's ever done it, you've never done it before, right? The first time it's like, you're going to buy an ice cream franchise? Well, you've never done that. What business do you have doing that?\r\n\r\n\r\nCraig Fuller (16:13.86)\r\nCorrect.\r\n\r\n\r\nCraig Fuller (16:18.116)\r\nMost businesses, fact, FreightWaves is a tech business, but we are not, we're not that smart. Like in the sense that we're not creating something that hasn't been proven before. And frankly, Firecrown's business model of buying media, legacy media businesses and using that for top of funnel for other product offerings. Isn't that original? Like these aren't original ideas. In fact, the more original an idea is, the more likely it will fail.\r\n\r\n\r\nbecause the market has to sort of accept something they understand. so the most successful founders are not the ones creating these crazy, even Uber, which is the most successful startup in history in terms of revenue growth and speed of which it grew, was not an original idea. I the idea of providing on-demand transportation services.\r\n\r\n\r\nAnd there were dozens of startups doing this. In fact, I was in payments and there was a founder in Chattanooga that had created an on-demand taxi card. It's like a prepaid card that you could buy and he had created a call center where you could call in a taxi and you get it anywhere else. What Uber made, Uber brilliant, think, is they took the idea of centralizing dispatch, but then applying it to where you could essentially sell your...\r\n\r\n\r\nNikolas Hulewsky (17:42.069)\r\nMm-hmm. Good time, yeah.\r\n\r\n\r\nCraig Fuller (17:42.574)\r\nyour transportation services, or to sell it into a marketplace. But they adapted ideas that had been borrowed from other types of industries. And I think that's what makes most ideas work is that right time, right place, sort of right nuances that make it work to make it successful.\r\n\r\n\r\nNikolas Hulewsky (17:57.983)\r\nYeah, whenever I have somebody DM me, he was like, Hey, I this business idea. Are you interested? yeah, tell me about it. I'd really like you to sign an NDA first. I'm like, dude, there is no idea out there that's novel, right? It's all about the execution. And then you as the founder, are you the one who's going to be able to bring it to fruition? may hate Travis Kalanick, but the dude did something that nobody else did before him.\r\n\r\n\r\nCraig Fuller (18:06.712)\r\nYeah\r\n\r\n\r\nCraig Fuller (18:21.796)\r\nExactly. mean, he, he, he's a machine when it came to work and execution. And he was, he, he, he, it was a fanatic and many ways created a cult in the Uber culture that was, they were able to defy all of the rules and not really care about the municipalities. didn't really care about the taxi regiment were being threatened both physically and potentially through, you know, these are in many ways mafia-esque, tight businesses and.\r\n\r\n\r\nNikolas Hulewsky (18:52.321)\r\nThe medallion system in New York City, mean the medallions that we're selling for taxi drivers in New York City was incredible. There was a secondary market for it that, anyways, it was crazy.\r\n\r\n\r\nCraig Fuller (18:52.461)\r\nHe doesn't care!\r\n\r\n\r\nCraig Fuller (19:00.354)\r\nYeah, so you have to in some ways suspend belief. he had gone out and told, if we were having this conversation in 2006 and he was sharing the vision or the folks that founded these on-demand car services were sharing their vision, we all would have looked at them like they're completely nuts. Like who would do that? And I think at some point,\r\n\r\n\r\nThe founding team behind Lyft and Uber and a couple of the other car services believed that the market was, the timing was right to execute on it, but these ideas are oftentimes not original.\r\n\r\n\r\nNikolas Hulewsky (19:35.605)\r\nYeah, I think for many founders, whether you're founding a startup company that becomes a multi-billion dollar company or even a company that has $5 million a year or less, you have to be inflexible about the what. Like, hey, what am I providing? But you have to be flexible about how. And that's what I'm hearing from you, right? You're like, I'm bringing transparency to this market. We didn't think we'd do it through media, but now that's what's happening. And you are flexible on that side of things. If you want to listen to how you built a business, you've done a million podcasts on that.\r\n\r\n\r\nCraig Fuller (19:50.2)\r\nExactly.\r\n\r\n\r\nCraig Fuller (20:04.184)\r\nBefore you do that, Nick, I want to say something. The whole NDA concept is the most ludicrous thing. These founders, and I get, a lot of folks reach out to me on X or LinkedIn and it's a founder that has an idea and maybe a vertical I know. Hey, I, can I spend, can I pick your brain or I want to visit with you and I have an idea. And then you're like, fine, I'll spend 30 minutes just hashing out the idea knowing that it, that I'm not going to benefit directly from that. Like, like\r\n\r\n\r\nIt's good pay it forward. If I was a young founder, there were people who are gracious enough to spend time with me along that journey. But then they asked for an NDA, asked me to sign an NDA and I'm like, wait, why would I sign an NDA for you to share an idea that I'm going to spend the next 30 minutes giving you feedback on your idea that I don't personally benefit from. And yet you want me to sign something that restricts my rights. Makes no sense. So founders, it's offensive when you even ask it.\r\n\r\n\r\nBecause any time you're sharing an idea, whether an NDA has been signed or not, you have to assume that that idea, if it's good enough, has been A, heard before, and B, that the person you're sharing it with, you're not gonna teach them anything that they don't already know.\r\n\r\n\r\nNikolas Hulewsky (21:14.005)\r\nDude, I totally agree. The only time I'm really good about NDAs and I honestly, I only do this with people who I'm trying to show, hey, you're fine. We can trust each other. I'll give them the NDA is when they've got a specific deal. If they're like, hey, I'm looking at this deal. Can you help me look at the structure of it? You know, am I financing it appropriately? Does the purchase agreement look anyways? If I'm giving feedback on that end, I'll sign an NDA. But if it's just, can I get your feedback? I'm like, no.\r\n\r\n\r\nCraig Fuller (21:40.448)\r\nNo, what's the point? You had at that point, don't even, and oftentimes they won't even tell you what the idea is about. It's like, great. I want to hear about it. Like you have to sign it. It's a, I, that is a pet peeve of mine. I've talked about this before because I find it completely ludicrous that's that a founder would ask that of someone that they're asking advice from. now NDAs, you're buying a business or you're evaluating a deal and you're getting confidential information, but most NDAs are worthless anyways. Let's just be completely frank. Like how often do you ever hear about an NDA being enforced?\r\n\r\n\r\nNikolas Hulewsky (22:01.355)\r\ndifferent.\r\n\r\n\r\nNikolas Hulewsky (22:09.461)\r\nAlmost there.\r\n\r\n\r\nCraig Fuller (22:10.392)\r\nRarely, rarely, unless somebody has some real deep intellectual property that they have perhaps built and there's some need to protect that. But for an idea exchange.\r\n\r\n\r\nNikolas Hulewsky (22:19.795)\r\nAnd it has to be so obvious and provable. mean, it's hard to prove that somebody broke an NDA in the first place, right?\r\n\r\n\r\nCraig Fuller (22:25.592)\r\nExactly. Unless there's an ex- and there actually wasn't a case of explicit theft of intellectual property. In Uber's case where Google's IP was stolen for autonomous trucking and the guy ended up, was, Levin Dosky ended up going to prison or being indicted for theft, IP theft from Google or Uber.\r\n\r\n\r\nNikolas Hulewsky (22:29.761)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (22:47.403)\r\nWow.\r\n\r\n\r\nCraig Fuller (22:49.232)\r\nIt was a Travis speaking to Travis Kellen act. was a guy who worked directly for him. He was pardoned ultimately by the Trump administration, but like I said, NDAs just aren't.\r\n\r\n\r\nNikolas Hulewsky (22:59.709)\r\nSo I like this framework. again, if you want to go listen to the how you built freight waves, you've got it's an amazing story. But you talk about asymmetric bets, you know, taking small risk bets that have, you potential for high upside. And one of those bets was this media company, you launched the conference and you ended up growing on the media side, which has been really cool. I think what's really interesting is, it's almost like you were looking for your own distribution.\r\n\r\n\r\nand said, screw it, I'll just do it myself.\r\n\r\n\r\nCraig Fuller (23:31.022)\r\nThis was something I learned years ago, predates FreightWaves. I was in payments and this is my first sort of technology startup. I'd been in trucking and then was in the fleet card payments business that we had called TransGuard. And for years, we spent all of our time building and engineering processing technology that we would say was better than anything out there. Nobody knew about it, right? Like that was the problem.\r\n\r\n\r\nThe idea that you build it and they will come just doesn't work in business. And we ended up signing a deal with the American Bankers Association. And we went from signing up two banks in five years to over the course of a year and a half signing up 400. And I saw that the ABA, the American Bankers Association, when they put out a press release and sent it out via email, I think that day we had a couple of hundred come.\r\n\r\n\r\nbanks, community banks that responded, they wanted more information. And it was this aha moment for me because it was like the secret all along wasn't building better technology. The secret all along was distribution. And when I set up Start Freight Waves, regardless of what my product was, and when I started this business, we didn't have a product. Like that was literally like futures contracts. We didn't launch futures contracts into 2019 and we were raising money in 2016.\r\n\r\n\r\nIt was three years before we had a real product, but you could actually create a product. Like we were literally like raised money. We're sitting in room doing whiteboard stuff, waiting for regulatory approval on this futures contract. And a bunch of really smart people sitting around a room, naturally you want to go do something. And we ended up creating our own media business because we wanted to own our own distribution. That was the rule that I had in any business is\r\n\r\n\r\nNikolas Hulewsky (24:57.206)\r\nthings.\r\n\r\n\r\nCraig Fuller (25:22.188)\r\nIt's actually, and you see this in so many different companies and so many different places is people that own distribution, founders that have figured out how to capitalize on distribution end up winning every market they're ever in. And I think that is something most founders, particularly technical founders don't understand is how important distribution is. And so one of the things that I really did at Freight Waves was ensure that I got distribution. I just happened to do that through media.\r\n\r\n\r\nSo another moment was sort of formative when I was in payments as well, is there was a guy, he's gone out and built multiple conferences like Money 2020, Shot Talk, and he was sort of this, it was in the payments business. He was this very influential guy. ended up selling a business to Google called TXVIA. And what I found really interesting about him is he was this sort of social, he was sort of the center of the social currency was his number one product.\r\n\r\n\r\nHe built the event for the industry. He had a publication for the industry and for the payments industry. And he was this guy that was highly revered because he was behind the community, if you will. It was sort of the godfather of the community. Correct. And he had all this power and Google bought his business, which they paid $300 million for. And I think they ended up shutting it like nine months later. They paid 300 million for this business that they ended up not doing anything with.\r\n\r\n\r\nNikolas Hulewsky (26:33.089)\r\nThe super connector, the lubricant, the conduit.\r\n\r\n\r\nCraig Fuller (26:49.346)\r\nAnd I just remember having this impression that there was this ecosystem and payments that I was an outsider for that, that you could navigate if you got his endorsement, because people were like, what all of a sudden their fortune would change and be like, what happened to them? And it was like, they got the blessing or connected with this guy who sort of blessed them into the access of the ecosystem. And I saw how much magic could be created in momentum in a business if\r\n\r\n\r\nthis gatekeeper, this network industry gatekeeper had decided that you and your ideas were worthy of opportunity. And I thought that was a really interesting thing. And so those were the moments that really formed my understanding of how we could build freightways and be successful was building both the idea that distribution is important, but also trying to be the center of a center connector in an industry concept.\r\n\r\n\r\nbecause of the amount of social currency that that ends up creating.\r\n\r\n\r\nNikolas Hulewsky (27:48.961)\r\nSo I'm not a big venture investor. I've made a couple literally like angel investments, but there is a saying in venture. The first time founders focus on products, second time founders focus on distribution because they realize it doesn't matter necessarily how good my product is. If I don't have a way to get it out there to people to buy and look at, my company's not going to grow. One statistic that always has stuck out to me, and there's obviously no exact number on this, but somewhere in the ballpark of between 40 and 60%. So let's just call it 50 % of every venture dollar raised.\r\n\r\n\r\nis spent on Google and Facebook. Acquiring customers, like that's what they're doing. They're spending it on distribution. So if you can reverse engineer that, and that's why we have some influencers like Cody Sanchez or the guys on My First Million, they've built this distribution network. And Cody Sanchez, when she invests in businesses or Alex Hormozi, they invest in media accelerated businesses because they've now owned the distribution channel. I think what you've done is very interesting because you've gone out and\r\n\r\n\r\nCraig Fuller (28:21.093)\r\nyeah.\r\n\r\n\r\nNikolas Hulewsky (28:47.621)\r\nyou're not necessarily outside of FreightWaves building from scratch this distribution channel. You're going out and buying legacy media. Talk a little bit about, I guess like Flying Magazine is like the perfect example. That was your first acquisition. What did that look like?\r\n\r\n\r\nCraig Fuller (28:56.899)\r\nYeah.\r\n\r\n\r\nCraig Fuller (29:03.94)\r\nSo it was just like, I'm a pilot. grew up reading flying magazine when I was sort of in my formative ages as a teenager as a pilot and had the opportunity at this point when I bought flying magazine, I understood the power of content and understood the power of media, the power that you have to influence the way people think about a topic for better or worse, by the way, like media has this really powerful influence and\r\n\r\n\r\nit does shape the way people think about topics, good or bad. But I realized that there was an enormous amount of power in that. And I bought Flying Rows, a passion project, because I love media and I love being able to tell stories. And when I bought it, the idea was I know there's something there, there to offer the community. I didn't know what that was. We've since gone out and realized that we could, the model of taking the audience and selling things works out.\r\n\r\n\r\nWe've done it now in e-commerce, we've done it in finance, we've done it in real estate. And the truth still holds that if you own an audience, you can effectively drive distribution. When I built FreightWaves, I built that through my own, if I'm an influencer, then I built it through my own influence, if you will. That's hard, especially today. It's much harder today than it was in the past to build that kind of influence the way we did it.\r\n\r\n\r\nNikolas Hulewsky (30:19.809)\r\nMm-hmm. Yeah.\r\n\r\n\r\nCraig Fuller (30:27.586)\r\nbecause the social networks have made it so hard to sort of use their platforms to bring traffic to your own organic systems. It is just so much harder. They want you to live and create inside of their world, not your own. It would be harder to cold launch freightways today than it was when we did it just because the rules were different back then. But one of the things that I realized is,\r\n\r\n\r\nthat these legacy magazines and flying's been around since 1927. We have a magazine called Yachting, which has been around from 1907. Most of them are multi-decade old magazines. And they still have paying subscribers and advertisers, which means they're doing something right to survive that long for people still to pay them. So there is an audience that cares deeply about the content if you've got people who are subscribing to it. And what I realized is that most investors have\r\n\r\n\r\nNikolas Hulewsky (31:11.307)\r\nYeah.\r\n\r\n\r\nCraig Fuller (31:22.582)\r\nsort of ignored traditional print media because they because those businesses are actually quite hard and they're they sort of have a cyclical or secular decline element to it which makes it less attractive from investor but the most valuable asset that these magazines have is the brand equity that they've built over decades and the audience subscriber database that exists and the social credibility that\r\n\r\n\r\nexist inside that community. And if you can buy those publications and find some non-media way to make money, then ultimately you've bought, you've arbitraged the algo, if you will, because you're doing the same thing that an influencer would do, except you're not having to go do the 40 years or 50 years, a hundred years of work, or in the case of a lot of influencers, the years of work to build up credibility in a community.\r\n\r\n\r\npretty much are inheriting that through your acquisition. And that is the power, I think, of buying traditional media is that you're already getting all of the social credibility and currency that that community has to it.\r\n\r\n\r\nNikolas Hulewsky (32:38.187)\r\nWhat did you buy Flying Magazine for?\r\n\r\n\r\nCraig Fuller (32:40.452)\r\nI pay two and a half million in cash for that business. I think three and a half all in with some debt.\r\n\r\n\r\nNikolas Hulewsky (32:44.097)\r\nOkay. And you're still providing content, media, but you launched a fly in, fly out community. I don't even know what the name of it is. Like you bought some land. You used the media publication as a distribution essentially to sell lots to that land. You've launched a finance company that helps people finance planes. I think you bought an e-commerce business with your son. So it's like you've built monetization mechanisms around.\r\n\r\n\r\nCraig Fuller (32:56.29)\r\nother films.\r\n\r\n\r\nNikolas Hulewsky (33:14.293)\r\nthe media property. think the paradigm shift is VC private equity have looked at media properties and said, how do I make money off of the existing legacy monetization models? Right. And you're looking at these as like almost what's the business model and then what's the property I can go and get to provide distribution for that. Is that fair?\r\n\r\n\r\nCraig Fuller (33:35.236)\r\nSo I'm buying, ultimately I'm buying the audience and I'm buying the credibility. Content is the product, right? Ultimately it's what media is. The content has driven social credibility in that community that's then gone out and created an audience that then resonates with it. And effectively what I'm doing is I'm not buying stuff that's sort of fresh and new and sexy. I'm buying stuff that's old and established. Someone pointed out there's a concept called the Lindy Effect.\r\n\r\n\r\nwhich is a really interesting, if you sort of dive into it. And the idea behind this is that if the longer something's been around, the more likely it is to be around. In other words, if a book has been printed for 50 years, it's likely to be printed for another 50 years. If a piece of music has been around for 100 years, it's likely to be around for 100 years. If the Bible's been around for 2000 years, it's likely to be around for 2000 more years. And...\r\n\r\n\r\nThat is exactly the way I think about magazines, is if a magazine has been around for a decade and it's survived, know, typically multiple decades, it's survived multiple pandemics, it's survived multiple economic recessions and perhaps depressions, wars, chances are, flying's been around since 1927, yachting's been around since 1907, chances are that we look 20 years from now and these magazines will still be around because they've been tested.\r\n\r\n\r\ntested over and over and still have people who care deep enough to subscribe to them, to pay money. They're not buying and subscribing because it's new and it's sexy and it's cool. They've gone through multiple generations, grandfathers and great grandfathers. And you talk to the communities, the subscriber communities that we buy these things. And what is really interesting is you'll hear younger people talk, well, my father, had...\r\n\r\n\r\nNikolas Hulewsky (35:05.089)\r\nRight. Right.\r\n\r\n\r\nCraig Fuller (35:29.398)\r\nMy father had every issue of flying magazine ever printed. And I've got this whole like in my basement or in some box, I've got every issue of flying. like, would you like them? Would you like them? I know we have every issue. But there is a level of, or you talk to people who are like, hey, when I first started to learn to fly or first learning to sell a boat or learning about fishing, I was reading the magazines, formative. And there's something about that that you can build upon.\r\n\r\n\r\nto offer other products and services to the same community, and effectively you're not paying Facebook, Google, Pinterest, et cetera, to acquire the customer because you already own them. Over 50.\r\n\r\n\r\nNikolas Hulewsky (36:08.177)\r\nmedia properties do you have now? Okay. When did this thesis start and how long have you been doing it?\r\n\r\n\r\nCraig Fuller (36:15.044)\r\nWell, the magazine, I started buying Fly Magazine in 2021. So about three years. Yeah. Yeah. Yeah. Almost this will be our fourth year in it. Uh, so yeah, about 50 in three years.\r\n\r\n\r\nNikolas Hulewsky (36:19.034)\r\nWow, so 50 media properties within three, four years. Holy crap.\r\n\r\n\r\nNikolas Hulewsky (36:27.541)\r\nI mean, I know you move fast. I saw you post on Twitter that you were like, hey, I'm looking to buy a museum. And somebody random responds to you and says, hey, there's this railroad model railroad museum that's that's closing down. And within a week, you had flown out there and it was over Christmas, you negotiated it sign of the you're shipping this now back to tennis Chattanooga, Tennessee. All within a week, it's freaking that\r\n\r\n\r\nCraig Fuller (36:51.492)\r\nYeah, it's pretty epic. So I actually tweeted that I wanted to build a transportation museum in Chattanooga, Tennessee, which is my hometown. It's also where our headquarters are. And I thought it would be pretty cool because firecrown and freightways happens to be the center of sort of transportation media, if you will. And I thought, Hey, it'd be pretty cool to have a museum that sort of celebrated and gave us, we have access to every artifact and company. if, you know, whatever it is, we have the content, but we also have access to.\r\n\r\n\r\nto be able to create, to basically program the museum. So I tweeted this idea. At the time, I thought, we'll get an 8,000, 9,000 square foot building. I'd had this grocery store in my mind, local grocery store identified as sort of the spot. I tweeted on a Friday and on Saturday, somebody sent me this article about the largest indoor railroad exhibit in the world, 80,000 square feet. And you probably have seen on social media, the Hamburg thing, where they're all the miniature value. This is actually bigger in terms of total square foot.\r\n\r\n\r\nNikolas Hulewsky (37:45.355)\r\nMm-hmm.\r\n\r\n\r\nCraig Fuller (37:50.16)\r\nbut the difference is that, that Hamburg does much broader than just trains. This one only focuses on trains. so anyways, it's being liquidated. It's going to get shut down in two weeks from, from the date that this article. And I was like, here's an idea. I should go see if I could go acquire it because what if something's being effectively liquidated, that means you can buy things on the cheap. Right. And I don't mean to dismiss it, but it's also an element of like, wait a second. There is someone who spent their life where these are handcrafted.\r\n\r\n\r\nhand-built, like this is 18 year, 80,000 square feet, two miles of railroad track and a miniature village all hand-built. This is decades worth of man hours of work. And the money and the time and the energy spent, and look, when you go see it, you can't go see it now, but you will eventually see it in Tennessee, you'll see how much detail has been poured in love and passion. This thing is,\r\n\r\n\r\nNikolas Hulewsky (38:26.399)\r\nmy god.\r\n\r\n\r\nCraig Fuller (38:46.358)\r\nIt's very Disney World-esque, very clean and beautifully laid out and just an amazing experience for people. And I was like, this is something that needs to be preserved. The community needs to preserve this because this is someone's life at work. I am not a model railroader, but I have an appreciation for someone who built something. And literally, he built this museum and it's not cheaply done. It's done at the top notch of what you could do in a miniature world.\r\n\r\n\r\nAnd I went up there and looked at it. I was like, this is epic. We got to bring this to Chattanooga. And so we did a deal. I met him on a Sunday. It was my first visit. And by Tuesday, three days later, we had a deal in principle and we signed a contract a week later. And basically they shut down and now my team is up there moving this stuff. got it. think it was 25 truckloads. estimate 53 foot truckloads of product moving from Cincinnati to Chattanooga, Tennessee. And I, I,\r\n\r\n\r\nNikolas Hulewsky (39:37.797)\r\nmy god. Holy crap.\r\n\r\n\r\nCraig Fuller (39:44.194)\r\nToday, I got the contract, hopefully I'll be able to announce this soon, of where this is going, which is gonna be an even cooler spot in Chattanooga. We're gonna do it, but imagine what we get to do here now, is now we have a physical manifestation. This is the magic of all of it. So what makes Disney World so powerful is not the mouse and it's not the Donald ducks and the avatars and all the things that sort of go into the...\r\n\r\n\r\nor the Pixar, the magic of, like the movies and our characters create imagination and formative in so many kids' lives. But what makes Disney, and I think Walt Disney figured this out perhaps better than anybody, was that he created a physical world where you could have an experience. And he did it in a way, when you go to Walt Disney World, you're suspending belief, and that's where the magic is, for hours or days.\r\n\r\n\r\nAnd I have young, I have five kids, but we took our daughters who, one of my daughters is really obsessed with Mickey Mouse. And I remember her face of seeing Mickey for the first time, believing this thing is real. This mouse is like right there. And like, she gets to spend time with this celebrity in her mind, this thing that she's seen on TV. And for that moment, as a father,\r\n\r\n\r\nThis is the, we're in a world, we're in her imagination, if you will. We're able to experience it. And that is what's so powerful. And so we have the same opportunity, slightly different, right? I'm not creating characters, but I am able to program content in a physical manifestation. So what I do is trucking and rail and aviation stuff. That's cool for people who like the stuff, love it. Most people think that's cool.\r\n\r\n\r\nNikolas Hulewsky (41:13.683)\r\nIt's the real world manifestation of their imagination.\r\n\r\n\r\nCraig Fuller (41:38.488)\r\nLet's go on to the next topic. But if I can get someone and I can create a similar sort of experience for an hour or a couple of hours, then I've done the same thing that Walt Disney pulled off, which is I've allowed you to go into your imagination and experience the world in something immersive. There's an enormous amount of power in that in terms of influence on how people think about topics and experiences. And that is what we plan on doing is taking this museum and programming it for a physical destination.\r\n\r\n\r\nNikolas Hulewsky (42:03.777)\r\nAmazing.\r\n\r\n\r\nCraig Fuller (42:08.47)\r\nrelated to the content that we cover every day.\r\n\r\n\r\nNikolas Hulewsky (42:11.115)\r\nWell, I mean, especially since COVID, in-person events, physical events, the real world, there's a massive amount of demand for it. I've got four boys, and under. They would love to go to a train museum, a planes, trains, an automobile museum. We go to the airport and just watch the planes take off and they're like, my gosh, what a cool.\r\n\r\n\r\nCraig Fuller (42:31.032)\r\nThat is, yeah, exactly. It's so cool. And what's interesting about this is I've seen a lot of model layouts. They call them model train. A lot of this stuff is really small, like real small scale. This is G scale, which is the big garden scale. call it. This is like, these are like really big. Like when you walk in, the buildings are taller than you are. That's what I'm not talking about the little village where you're looking over it. You're talking about these buildings and they're, you know, these things are 10 feet tall.\r\n\r\n\r\nLike we have to have 16 feet clearances on the ceiling just to be able to fit the thing in. And so it's going to be so epic. I'm so like of all the things I've done, this one is going to be the most exciting because now I get to create and you know, it's interesting. We host physical events. I've talked about this. That is hard to do for two to three days to create an event where people do not get bored and have to program. And you're like so on for two to three days. It's like putting on a wedding. You're constantly just like everything's constant.\r\n\r\n\r\nNikolas Hulewsky (42:58.177)\r\nThank you.\r\n\r\n\r\nNikolas Hulewsky (43:06.465)\r\nThat was pretty cool.\r\n\r\n\r\nCraig Fuller (43:26.54)\r\nIt's actually, this is actually gonna be easier because you can iterate as you go. You can create something, hey, this isn't popular, people don't like this, people don't like this. You're constantly iterating and you have the chance to do that over the course of potential years versus doing it over the course of days.\r\n\r\n\r\nNikolas Hulewsky (43:31.777)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (43:37.312)\r\nthe feedback loop is\r\n\r\n\r\nNikolas Hulewsky (43:42.549)\r\nRight, the feedback loop is way quicker. It's not a year until you're putting on that next event. It's two days or next week or next month.\r\n\r\n\r\nCraig Fuller (43:44.418)\r\nAbsolutely.\r\n\r\n\r\nExactly. only get it when you have physical event, you only get to do that once because if you if you offend the audience or you bore the audience or whatever, you're never going to get them to repeat where and you don't know that information until it all comes out the day of the event. So if a weather system hits, you're kind of screwed. Like there's all sorts of things that can happen at events in a physical location with what we're talking about with our museum. This is something we can constantly iterate on. I'm so pumped about it.\r\n\r\n\r\nNikolas Hulewsky (44:16.481)\r\nOkay, here's my last question. I love the museum idea. I also, I love the idea of buying the distribution channel and then backing into it with a business or having a thesis of a business and then buying the distribution channel. I think that's fantastic. But I wanna pick your brain. Sorry. okay, yeah, yeah, I'll send it to you later. I'll send it to you later. On,\r\n\r\n\r\nCraig Fuller (44:36.516)\r\nNo NDA. I'm all fired.\r\n\r\n\r\nNikolas Hulewsky (44:41.833)\r\non your framework for identifying these opportunities. So there's a couple that I've written down after hearing you speak. One of them is long tenured audiences. So you mentioned the Lindy effect, right? Hey, they've been around for a long time. They'll probably be around for a long time. So that to me sounds like something that's within your framework of identifying media properties. I think high ticket potential items.\r\n\r\n\r\nCraig Fuller (45:04.418)\r\nYeah, it certainly helps. It certainly helps because big ticket means you don't have to have massive amounts of volume of transactions.\r\n\r\n\r\nNikolas Hulewsky (45:13.369)\r\nmagazines are another thing that I'm pulling out from this. like, it's not just like, I'm to buy Yahoo or BuzzFeed. You're buying physical magazines.\r\n\r\n\r\nCraig Fuller (45:19.822)\r\nCorrect. Print is something, and I think what's interesting is print is now making a comeback with younger generations. If you live in a digital world, another website is not that impressive. Like, let's be honest, a podcast, no offense to you, Nick, or anyone who puts podcast on. Like 20 years ago, 15 years ago, when these first came out, that was cool, right? There's nothing really that cool about.\r\n\r\n\r\ndigital media sites or somebody who's putting content on YouTube. What's different about a magazine is that they are, particularly younger people, there's a luxury element to physical because they grew up in a digitally enabled world where they were so surrounded in digital. And there's something physical that I think is viewed differently today than even my generation viewed it 10 years ago because younger people...\r\n\r\n\r\nNikolas Hulewsky (46:03.574)\r\nMmm.\r\n\r\n\r\nCraig Fuller (46:15.574)\r\nunderstand the power of something physical. There's also a much bigger moat. It's a lot more cost going in to do something physical than digital, which is different than it used to be because to do something successful physically is much harder to execute than digitally. And I think that's why one of the reasons I like it is because if it's been tested in the market, chances are it's going to be going back to the Lindy effect.\r\n\r\n\r\nNikolas Hulewsky (46:39.497)\r\nIs there anything else in the framework I'm missing? Is there anything else that you like?\r\n\r\n\r\nCraig Fuller (46:41.86)\r\nThere's also, there's one other thing about physical that I didn't appreciate when I first felt flying, because I was actually going to shut down the print magazine. I was like, dinosaur reprint. Like who reads a print magazine? was my thought.\r\n\r\n\r\nNikolas Hulewsky (46:51.445)\r\nYeah, because this was a few years ago and that was still the thesis.\r\n\r\n\r\nCraig Fuller (46:54.498)\r\nYeah, I'm still the except that, mean, people still, some people still think this case. The difference between print and digital devices is that when I'm in print, just like going to Walt Disney and walking into Walt Disney World is you are, when you're in that experience, imagine a good movie or a good article or a book you're reading. It's, you're not getting inundated in a feed. Like when you're,\r\n\r\n\r\nYou know, you going to a sporting event where you're enamored with the content, you're not looking at your phone or watching a movie, you're not looking at your phone or you're at the amusement park with your family, you're not looking at your phone constantly. You're like, you forget that you're, you're in the device. And the nice thing about a magazine is it does exactly that is for the 10 minutes that you're reading the magazine, the article or zooming through it, you're not looking at your phone at the same time. have got, I've captured you for a couple of minutes of your time.\r\n\r\n\r\nNikolas Hulewsky (47:27.265)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (47:49.717)\r\nYou're indistractable.\r\n\r\n\r\nCraig Fuller (47:51.126)\r\nIndistractable. And that is what makes print so powerful for big ticket. That if I want to influence you to buy a boat or an airplane or a piece of land, these are big ticket. I have to have your undivided attention for just a minute. That's where print has such an effective pull on you.\r\n\r\n\r\nNikolas Hulewsky (48:04.341)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (48:10.401)\r\nThat is such a cool observation because if I'm on Twitter, if I'm on Facebook, if I'm in my email, if I'm on the web, ding, notification. Oh, somebody said something to me. I could be in the middle of the most important email in the world, but if I get that notification, it draws my eyes even for a second.\r\n\r\n\r\nCraig Fuller (48:21.696)\r\nIt's distracting. And and the algos, these platform algos are meant to do that. And so digital media, digital advertising is both inexpensive, but it's also inundated with so much just noise. And, and, it's, you're never going to get someone's undivided attention on, on any kind of physical device. It's almost impossible. Remember the last time that you saw a tweet or an article and you're like, that's really interesting. And you remember reading about it. You were like, I want to come back to that.\r\n\r\n\r\nYou're probably going to forget that you didn't exist 30 seconds later. But in print and a physical manifestation, I have your attention for a couple of minutes. And imagine as an advertiser, it's true of the art that people we saw advertising to is you've got them. But also if I own a product that I'm able to sort of solicit for you to buy, I've got you for a couple of minutes. And that is your time is very important to advertisers. Everyone's time is.\r\n\r\n\r\nI had the chance to influence how you think about a topic for just a couple of minutes and I think there's an enormous amount of power in that. That just, you can't get through any other...\r\n\r\n\r\nNikolas Hulewsky (49:26.593)\r\nI love that articulation of it, because I do think right now there's a big shift to physical experiences. Community has always been big, right? We have social media, Facebook, Twitter, whatever. Oh, that's fantastic. But now it's like, I want to go out and meet people. Like, I wish you and I were talking right now in a studio, right? So we could be interacting. This is cool. Yes, yes, it's very difficult.\r\n\r\n\r\nCraig Fuller (49:43.236)\r\nAbsolutely. There's something about the chemistry you can develop somebody in person, you can do. And I think COVID in some ways forced that upon us because we spent 12 months or whatever, maybe even longer, isolated. Even if we went out, other people weren't going out, our old friends weren't going out. Going to the office is it's lamer than it used to be because not everyone's, the magic is gone.\r\n\r\n\r\nI think physical, that's one of the reasons I've started to love print. And look, let's just be frank, it's a massive arbitrage. If the most valuable part of that asset, imagine if the amount of money I spent, I spent $2.5 million to reach 50,000 pilots. I own that audience, of which now I'm generating a profit on producing content for them, right? That's negative cap. But I own that audience. I don't have to go to Facebook and Google. Imagine the amount of, if I told an aircraft manufacturer,\r\n\r\n\r\nNikolas Hulewsky (50:31.851)\r\nYeah.\r\n\r\n\r\nCraig Fuller (50:40.452)\r\nthat they could own 50 like a subscriber database of 50,000 and never have to render never again. And new people come in and subscribing. They, that is worth more than two and a half million dollars. promise. But I also happen to have a business model that's profitable in generating its cashflow. So I, why are these things so cheap? I don't have a clue, but I'm glad that they are because I can, as long as this arbitrage opportunity exists, I will continue to buy.\r\n\r\n\r\nNikolas Hulewsky (50:48.928)\r\nRight?\r\n\r\n\r\nNikolas Hulewsky (51:03.637)\r\nWhat?\r\n\r\n\r\nNikolas Hulewsky (51:08.181)\r\nThere's a reason why Amazon has started sending out around Christmas their little books. You know, ready? Yeah.\r\n\r\n\r\nCraig Fuller (51:12.13)\r\nthe kids. Like you got four kids. I've got five and my my now five year old and my three year old daughters them and they start. He circles everything in the book, by the way. It's not very helpful. But my wife gives him the book and he's like, it looks it's a girl thing. It's getting for him. It's like everything gets there. Like I don't really helpful but they get that right. They're like, this is this is the way to kids can't kids cannot interact with the screen.\r\n\r\n\r\nNikolas Hulewsky (51:21.313)\r\nEverything.\r\n\r\n\r\nCraig Fuller (51:41.134)\r\nthey can interact with a book. And I think there's something really cool about\r\n\r\n\r\nNikolas Hulewsky (51:42.785)\r\nYeah. So I want to brainstorm with you in the last few minutes. If I'm an entrepreneur listening, I'm like, I'm not in the logistics space. I can't buy a media company. I think a lot of people are going to fall in love with buying media companies, but they're going to forget about actually creating good media in order for those companies to survive. But I have a healthcare background. How would I go about thinking about or looking for opportunities to buy media companies to then pair with businesses?\r\n\r\n\r\nCraig Fuller (52:10.552)\r\nYou know, there was a local business in Chattanooga called true North publishing. And I actually think the hospitals kind of figured this out. And so if you're in healthcare, you may, and you probably get one in your local town where the local hospital will send a health magazine to you and it has like nutrition tips. has like health tips. That is a piece of marketing literature is the local hospital or the care, the advertisers and a lot of it's like,\r\n\r\n\r\nthe hospitals buying the entire magazine and they're programming the content around the stuff they want you to know. And they're approaching it through health. They're driving top of funnel because in Chattanooga we have four, three or four hospital systems that are of any significant scale and they're all competing for patients, right? Because ultimately if I can get you in the door, same way universities get you in the door. The idea is that these healthcare companies, these hospitals,\r\n\r\n\r\nare using nutrition and health advice and content to drive some level of brand equity so that when you're thinking about your doctor network or where do you go, which emergency room do you walk into, you walk into the one that you think has the highest brand equity. I think, by the way, think academia has figured this out in groves through college football. think I'm a huge college football fan, but the, I went to Baylor University and my son,\r\n\r\n\r\nNikolas Hulewsky (53:27.199)\r\nWhere'd you go to school? Okay.\r\n\r\n\r\nCraig Fuller (53:31.138)\r\nLike if it wasn't for football or sports, I don't know that I would care. Like I had good memories at Baylor, but like that was 20 years ago. What I really care about where my son went to, unless there was some constant way to keep me engaged in the brand and the unit like act like college athletics have done that for, for has created a loyal alum base to sort of root for something and create some identity.\r\n\r\n\r\nNikolas Hulewsky (53:53.547)\r\nYeah, that's a great. I went to USC, by the way, the real USC, Southern California. Yeah. That's right.\r\n\r\n\r\nCraig Fuller (53:58.594)\r\nYeah, so it's the same idea, right? You're a Trojan and you root for the Trojans and you have some brand, you may give money to the school, you may buy merch. There is an element of that, it's the same concept.\r\n\r\n\r\nNikolas Hulewsky (54:09.589)\r\nYeah, I mean somebody else who went to USC. The first thing we talk about football. Yeah.\r\n\r\n\r\nCraig Fuller (54:13.11)\r\nExactly. And you now have some, and you like that person instantly, slightly better than you did the moment you found they went to somewhat common view that you have about the world. And that's what I think. so this, this rule can be applied to anything. You talked about healthcare, can be applied to education. You know, even construction, you could be in building homes. And if I were a local builder, I would probably go create some type of\r\n\r\n\r\nof magazine that I could send out to the top thousand prospects in my community for building.\r\n\r\n\r\nNikolas Hulewsky (54:48.683)\r\nWould you create or would you go and buy a legacy property?\r\n\r\n\r\nCraig Fuller (54:52.548)\r\nWhat I would do is go buy a legacy property. Uh, yeah, but I mean, like, you don't have to go buy them. You can certainly go create them. go to a couple of custom publisher and have them create a look book of what your, your house. Like that's why builders build these model homes and you, like I lived in Texas and so all these neighborhoods would pop up in Dallas and they would build like 500 homes in two years.\r\n\r\n\r\nNikolas Hulewsky (54:55.393)\r\nBecause you have more scale and the ability to buy a lot.\r\n\r\n\r\nCraig Fuller (55:19.81)\r\nyou would always go to the neighborhood and the model home would be like the ultimate aesthetic. would have the premium pool and the premium kitchen and have every fixture that you could possibly do. And it was staged to create an experience. And if you've ever tried to buy a home, you realize that the home that you're looking at in the model home is probably 40 % more than what you would traditionally buy. Cause you're like, I don't want to spend the extra.\r\n\r\n\r\nNikolas Hulewsky (55:43.401)\r\nRight. Right.\r\n\r\n\r\nCraig Fuller (55:47.3)\r\nIt's the same idea. think if I were to be a construction, if I were to build homes, I would create content that would be in front of my target audience on a continuous basis. And you could do it through print pretty efficiently. You could also do it digitally to ensure that they always are seeing content about the vision that I have for my business. So if I'm a builder and I'm gonna build\r\n\r\n\r\n20 homes this year or 10 homes this year, I'm gonna figure out who my 20 prospects, my 2000 prospects are, and I'm gonna continue to send them content that relates to this. Now, if I'm really entrepreneurial, I would go buy some type of home magazine in that community and use that to then go invest in building homes or doing real estate.\r\n\r\n\r\nNikolas Hulewsky (56:37.025)\r\nAll right, this is the last thing. It's a little bit harebrained, but I hope you enjoy it. I have a media property that I think you should buy.\r\n\r\n\r\nCraig Fuller (56:43.972)\r\nOkay? What is it?\r\n\r\n\r\nNikolas Hulewsky (56:45.505)\r\nI think you should buy Sports Illustrated. Did you really?\r\n\r\n\r\nCraig Fuller (56:47.236)\r\nI tried. I did, I did. So when they had the, when they shuttered, so Arena Group owned it. It was publicly traded. There was this whole thing where they were shutting it down, they laid off, it just a whole mess. And there was a moment where I actually got introduced to the group that owned the licenses. It's a really weird deal. And you can go to the public record and read all this stuff. Cause at one point it was a public company. It's now owned by another company. But we submitted a bid.\r\n\r\n\r\nWe submitted a proposal on what we would do with it. Because I thought, hey, this is an iconic brand. has strong brand equity. has a very, or at least had a very defined audience at a very specific demographic. It had a moment of glory. It was the definitive sports magazine in the 90s. And an enormous amount of brand equity with stories and content subscribers, that's a dream for someone like me.\r\n\r\n\r\nBut I just couldn't make the numbers work at a place that we would be competitive in the bit.\r\n\r\n\r\nNikolas Hulewsky (57:49.695)\r\nYeah, I mean, it's we, you know, growing up in the 90s, we're now entering the age where we have the most disposable income would be the perfect market to go from a nostalgia standpoint to be like, sports illustrated is back. also think that they didn't monetize and maybe they did the swimsuit editions, whether they could have.\r\n\r\n\r\nCraig Fuller (58:04.088)\r\nWell, they kind screwed that one up. They didn't, in the nineties they did, but the new buyer, the owner, the prior owner, Arena Group, started going into, okay, think about the core demographic of Sports Illustrated. It's people like you and I, 40s to like, say 65, maybe even older. Mostly white males is sort of like the core demographic. They went woke and I think offended a lot of the core demo. Like there is a thing of media of like staying inside your lane, like...\r\n\r\n\r\nand building something for your audit. The New York Times, whether you love or hate the New York Times or love or hate Fox News or MSNBC, what you find is that the reason the New York Times has such content that pisses people off is because it's core subscribers. It resonates with the core subscribers. They're reinforcing the engine, whether you like it or not or agree with it. But Fox News does the same thing. It's reinforcing the engine.\r\n\r\n\r\nSports Illustrated did the opposite, is it said, our core demo is this, and we want to be open for younger people, so let's go and attract this younger audience. What I would have done if I were running Sports Illustrated, it said, this is the core demo, and I'm okay that that demo is shrinking. Model trains, the people doing model trains, it's shrinking. I am well aware that there is a perpetual end to that, that revenue will melt away. It is a, in some ways, model railroad magazines are a melting ice cube.\r\n\r\n\r\nNikolas Hulewsky (59:20.083)\r\nYeah.\r\n\r\n\r\nCraig Fuller (59:27.468)\r\nI have to outrun the cashflow from two ways. One is continuing to find new channels to get more dollars out of the audience that exists, which is like a physical location could do. And the other thing is I've got to get enough cashflow to pay back the investment I made. And if I can pull those things off and I'll do that in 18 months, by the way, I like, I'll be able to pull that off in the first 18 months.\r\n\r\n\r\nNikolas Hulewsky (59:52.897)\r\nAmazing.\r\n\r\n\r\nCraig Fuller (59:55.424)\r\nI own that and like if it declines in 10 years, who cares? Because in that time I'm able to make a lot of cashflow out of that. And so a private equity firm would not typically go after that because they worry about who's gonna buy it in four years and not on top of that. But sports industry screwed up because what they should have done and they did some of this. They built a casino or a sports book. They decided to open a hotel really smart.\r\n\r\n\r\nNikolas Hulewsky (01:00:01.227)\r\nYeah, yeah.\r\n\r\n\r\nCraig Fuller (01:00:19.842)\r\nBut what they should have done is said, I don't need to address younger people. Even if you look at the old Sports Illustrated versus the new Sports Illustrated, the old Sports Illustrated was written for people like us. But if you look at the new Sports Illustrated, it's almost like us weekly. If you've ever seen these old teen periodicals at Newstand, it's got this young, immature layout and design aesthetic to it that appeals to young people. Sports Illustrated should have gone way up market.\r\n\r\n\r\nNikolas Hulewsky (01:00:34.731)\r\nMm-hmm. Yep.\r\n\r\n\r\nCraig Fuller (01:00:47.628)\r\nIt should have continued to serve the core audience it had. And the swimsuit edition should have been a fashion show. It should have been a sports bar. There's so many things that could have done with that. But they decided to go, and I don't care what your view is. If I owned a super liberal, BuzzFeed and HuffPost as an example, so BuzzFeed is a Someone had brought me an opportunity to invest in that and the idea.\r\n\r\n\r\nNikolas Hulewsky (01:01:10.625)\r\nYeah.\r\n\r\n\r\nCraig Fuller (01:01:17.548)\r\nAnd HuffPost is a super liberal publication. And I was explaining to the person looking at it, was like, this is great. You have a defined audience and you don't have to necessarily agree with everything your audience agrees with, but lean into what works in that audience if you're a founder. And so, I don't know, that's just the way I think of media.\r\n\r\n\r\nNikolas Hulewsky (01:01:36.129)\r\nWhat about MadTV or Mad, remember that Mad?\r\n\r\n\r\nCraig Fuller (01:01:38.22)\r\nI mean, Mad, again, it's the same demo. mean, Sports Illustrated and Mad, it's sort of like the 80s and 90s were great. I Mad did some stuff. It's a little harder because Mad was sort of, comedy is a much harder thing, I think, to keep. Comedies of the time. I I remember taking my now 18-year-old during COVID and we watched movies every night, was sort of our thing, and trying to show him some like Adam Sandler movies from the 90s or even Dumb and Dumber.\r\n\r\n\r\nNikolas Hulewsky (01:01:44.277)\r\nI\r\n\r\n\r\nCraig Fuller (01:02:07.8)\r\nComedy doesn't travel well through generations. You think it does, it doesn't travel that well. And I learned that the hard way by watching him react to these movies thinking they're hilarious and him being like this Adam Selma guy just isn't that funny. And I'm like, how do you not think this is hilarious? so comedy like with Mad is one of those things because it is a sort of a comedy snarky. It's hard to travel that through generations. It's hard work versus talking about airplanes, model railroad.\r\n\r\n\r\nNikolas Hulewsky (01:02:10.849)\r\nYeah, that's true.\r\n\r\n\r\nCraig Fuller (01:02:37.066)\r\nastronomy, even health, those things are perpetual and you can constantly, constantly program against it.\r\n\r\n\r\nNikolas Hulewsky (01:02:40.648)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (01:02:44.673)\r\nWell, I've talked to you, you're off. This has been fantastic. Thank you. Appreciate you coming. Yeah, where's the best place? Any website you want to plug or any.\r\n\r\n\r\nCraig Fuller (01:02:49.028)\r\nNick, appreciate your time,\r\n\r\n\r\nCraig Fuller (01:02:54.884)\r\nWell, you can find me on X at Freight Alley as my handle. And then if you're interested in our media business, you can go to firecrown.com. And if you're interested in freight and supply chain logistics, you can go to Freightways.\r\n\r\n\r\nNikolas Hulewsky (01:03:06.505)\r\nAwesome, this has been great. I'm gonna stop it here.",
  "metadata": {
    "duration": "",
    "date": "2025-02-05",
    "platform_source": "Google Drive"
  }
}