{
  "episode_number": "133",
  "episode_title": "Chris Knows Who Satoshi Is! How to Disrupt Payment Systems with Chris Koerner",
  "guest_name": "Chris Koerner",
  "business_name": "",
  "transcript": "﻿Chris Koerner (00:02.872)\r\nYou ready for this?\r\n\r\n\r\nNikolas Hulewsky (00:04.31)\r\nLet's go!\r\n\r\n\r\nChris Koerner (00:08.824)\r\nReady? Okay, sorry. How's this for a hook? I'm fairly certain I know exactly who Satoshi Nakamoto is.\r\n\r\n\r\nNikolas Hulewsky (00:08.866)\r\nYes, I'm ready for this. Let's freaking do this. Geez.\r\n\r\n\r\nNikolas Hulewsky (00:19.273)\r\nWhat? Okay.\r\n\r\n\r\nChris Koerner (00:20.12)\r\nI I learned it secretly by myself from a tweet that had over a million views.\r\n\r\n\r\nChris Koerner (00:29.944)\r\nI'm so bad at this. I'm so bad at this. All right. I'm gonna give you the answer.\r\n\r\n\r\nNikolas Hulewsky (00:36.95)\r\nIf it's Jack Dorsey, if it's Jack Dorsey, I'm going to be real bad hurt.\r\n\r\n\r\nChris Koerner (00:40.971)\r\nIt's Jack Dorsey.\r\n\r\n\r\nChris Koerner (00:44.982)\r\nWhy are you butthurt?\r\n\r\n\r\nNikolas Hulewsky (00:45.23)\r\nBecause we read the same tweet and I didn't have as good of a hook.\r\n\r\n\r\nChris Koerner (00:48.234)\r\nYeah, but most of our listeners have not. Okay. I, like many others have been wondering this and I've, I have never thought it was how Finney for those listening that don't know the story. Bitcoin was created by a named Satoshi Nakamoto who's completely anonymous. There are lots of clues pointing to about a half a dozen different people. I'm convinced as Jack Dorsey. Can I tell you why? Okay. I read that tweet. I threw away about half of the quote evidences. I'm going to\r\n\r\n\r\nNikolas Hulewsky (01:09.474)\r\nYes.\r\n\r\n\r\nChris Koerner (01:15.53)\r\nI'm going to read to you a lot of the ones that sound the most convincing to me. Okay. For those that don't know Jack Dorsey, he is the founder of both Twitter and Square, the payments platform. And for a while he was running both of them at the same time. Did you know he's a billionaire, very eccentric, kind of weird. I heard him speak at a conference once. Very weird. Of all the tech companies in San Francisco, Twitter and Square were two of the very first to accept Bitcoin payments.\r\n\r\n\r\nNikolas Hulewsky (01:29.486)\r\nat same time. He's a billionaire.\r\n\r\n\r\nNikolas Hulewsky (01:43.298)\r\nYes.\r\n\r\n\r\nChris Koerner (01:45.526)\r\nHmm. Okay. So that's, that's not in the tweet. I just find that interesting. One thing that never made sense to me. And the reason I thought it was half any more than any other person is the fact that whoever is Sustosha is, is worth, I mean, I mean, what is a hundred thousand times a million? A hundred billion. one is yeah. Like one of the top 10, 20 richest people on the planet. Right.\r\n\r\n\r\nNikolas Hulewsky (01:47.502)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (02:06.478)\r\n$100 billion? No. Yeah, close to that.\r\n\r\n\r\nChris Koerner (02:16.48)\r\nIt's really hard to not sell that Bitcoin. It's going to be really hard. I don't care who you are. Okay. You either have to be dead like how Finney is dead, or you have to already be wealthy and not really need the money. Jack Dorsey is a billionaire.\r\n\r\n\r\nNikolas Hulewsky (02:31.001)\r\nSo, okay, I'm gonna go ahead for those people who are, for people who are like me that are morons and haven't known this stuff for forever, Bitcoin was invented, quote unquote invented, created, whatever you wanna call it. 2010, what was the year? 2008? Okay, somewhere in that ballpark. And the creator, the founder of it, Satoshi Nakamoto, no one has known who he is. And there's been a lot of intrigue around it. Who is this guy? He created this thing and then he just,\r\n\r\n\r\nChris Koerner (02:34.06)\r\nThat's fine.\r\n\r\n\r\nChris Koerner (02:46.968)\r\n2007.\r\n\r\n\r\nNikolas Hulewsky (02:59.448)\r\nbounces, he just disappears. And as the price of Bitcoin has gone up, because Bitcoin is what they call an open ledger, you can verify every transaction. We know whose wallet is associated with Satoshi Nakamoto and that wallet has just been sitting there untouched. So every year, even as Bitcoin has gone up and down, we know, it's worth $100 million. now it's worth a billion dollars. Now it's worth $50 billion. Now it's worth $100 billion and people are just watching it.\r\n\r\n\r\nRight? And so that's why the theory is, either this guy died and he doesn't have access to the wallet anymore or, you know, the keys died with him or he doesn't need the money and he's, you know, doing something else with it. So there's been a lot of guesses. There was a documentary that came out recently that pointed the finger at, who did it point the finger at?\r\n\r\n\r\nChris Koerner (03:48.697)\r\nwhat was that guy's name? I don't remember.\r\n\r\n\r\nNikolas Hulewsky (03:51.534)\r\nI can't remember. I can't remember who it was. But yeah, there's like a small group of people that it could be. I hadn't really heard Jack Dorsey's name thrown around until the last few years, to be honest with you. I don't know why that is. But this tweet that we're referencing, the evidence is Jack Dorsey has been hyper involved with cryptography since the beginning. was one of like 2000 cipher punks in 1997. He wrote his graduate thesis on\r\n\r\n\r\nChris Koerner (04:01.1)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (04:18.154)\r\ncryptography and doing something that would impact the world and then disappearing. He launched Bitcoin around the same time that he was launching these other companies. He started running Twitter and Square at the same time that Satoshi pulled out of being an active member of the Bitcoin community. Jack has played up the joke. He talks about Satoshi all the time. He makes references to him and he knew all these people.\r\n\r\n\r\nI'm convinced too. I wish I could take the other side here and be like, no, that's not it.\r\n\r\n\r\nChris Koerner (04:51.148)\r\nWell, let me read some things. I mean, also he was asked on the Lex Friedman podcast if he was Satoshi and his answer was if I were, I would never tell you. so some more evidences. He wrote a manifesto on making a mark without leaving a trace in 2001. Okay. He made a blog post shortly thereafter joking about that. He was building something in secret. That would be a\r\n\r\n\r\nNikolas Hulewsky (05:00.939)\r\nokay.\r\n\r\n\r\nChris Koerner (05:18.744)\r\na payment network for drug traffickers. 2003 he posted a blog about how he's interested in cryptography, pseudonyms, hacks, hacks happening at 4 a.m. specifically and more. Posted in 2003.\r\n\r\n\r\nNikolas Hulewsky (05:32.974)\r\nOkay, so why the f- are we gonna find out why the 4AM is important later?\r\n\r\n\r\nChris Koerner (05:35.138)\r\nWe're gonna get there. We're gonna get there. Yep. He posted in 2003 that he's trying to end his dependence on the US dollar and creating a barter network. He referred to himself as Jack, J-A-K as a pirate, like a sailor. He had lots of sailor references, okay?\r\n\r\n\r\nNikolas Hulewsky (05:49.998)\r\nLike Michael Saylor. Is it? I'm just kidding.\r\n\r\n\r\nChris Koerner (05:52.298)\r\nlike Michael Scaler there. Jack tweeted around the horn and home again for that's the sailors way it back in 2008 Bitcoin was created the very next day. Okay.\r\n\r\n\r\nNikolas Hulewsky (06:06.062)\r\nOkay, are we going to talk about why, like, I don't get why that quote's important.\r\n\r\n\r\nChris Koerner (06:10.976)\r\nI'm, you gotta hear me out. You gotta, we're gonna get there. Okay. Jack's Twitter profile from 07 to 09 had him listed as a sailor. Okay. The original Bitcoin source code included an old sailors adage, never go to sea without two chronometers, take one or three. There are references to sailors in the Bitcoin source code multiple. Okay. The original Bitcoin source code documents\r\n\r\n\r\nNikolas Hulewsky (06:12.216)\r\nWe will get there, we'll get there. Okay, I'm so sorry. I'm sorry.\r\n\r\n\r\nChris Koerner (06:39.424)\r\nare all time stamped at 4 a.m. Jack always talked about being a hacker at 4 a.m. Okay. He accidentally logged in to edit the source code without masking his IP address, which he always did. it was an IP. Yes, Satoshi did. And it was an IP address listed in California. Okay. Well, California is a big state, but that's where Jack was at the time. The first Bitcoin transaction took place on Jack's mom's birthday. Okay.\r\n\r\n\r\nNikolas Hulewsky (06:43.038)\r\nI didn't know that.\r\n\r\n\r\nNikolas Hulewsky (06:46.744)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (06:55.576)\r\nToshi you're saying.\r\n\r\n\r\nChris Koerner (07:09.464)\r\nSatoshi joined the Bitcoin forum on Jack's birthday and Satoshi's last mind block was on Jack's dad's birthday. This, this, now this is something that I find pretty convincing. Satoshi in the forum told people not to donate Bitcoin to WikiLeaks. This was on December 5th, 2010. Exactly nine days later, Twitter is hit with a secret core order with a gag requirement.\r\n\r\n\r\nNikolas Hulewsky (07:19.189)\r\nChris Koerner (07:37.976)\r\nSo like this was happening in the background when Satoshi posted that like WikiLeaks do not support WikiLeaks. Nine days later, WikiLeaks comes out against Twitter. Okay. The day before that happened, before that gag order, Satoshi posted for the last time ever in the Bitcoin forum. He never came back. Okay.\r\n\r\n\r\nNikolas Hulewsky (07:43.022)\r\nHmm.\r\n\r\n\r\nChris Koerner (08:05.72)\r\nTwitter's tech lead a year later suggested that Twitter is gonna integrate Bitcoin payments. Jack Dorsey calls Bitcoin an amazing movement in September 2012. Square publishes a book in January 2018 to explain the legend of Satoshi Nakamoto in which it makes the Satoshi character look like Jack.\r\n\r\n\r\nNikolas Hulewsky (08:25.816)\r\nSo would people at Squared have known that? Okay, so that's more of just like a coincidence.\r\n\r\n\r\nChris Koerner (08:28.532)\r\nI don't think so. I don't think so. But who gave someone at squared the idea to make that book in the first place? And then the last one, Craig Wright, who is a guy that has purported to be Satoshi, no one really believes that he's a total hack and a fraud. There's a big lawsuit involving them. Craig Wright's attorneys argue in early 2024 that if Craig Wright was not Satoshi, then the real Satoshi would have been expected to come forward to counter the claim. It did not dawn on them.\r\n\r\n\r\nthat the person countering the claim was Jack Dorsey, who was the basis for this exact legal challenge to begin with. Jack Dorsey came forward to counter the\r\n\r\n\r\nNikolas Hulewsky (09:08.226)\r\nI guess I don't know much about the claim. Why would they have not known that Jack Dorsey had?\r\n\r\n\r\nWe don't know enough about it.\r\n\r\n\r\nChris Koerner (09:14.496)\r\nI think Jack Dorsey was just stepping up as like\r\n\r\n\r\ntrying to be a responsible party on behalf of Bitcoin.\r\n\r\n\r\nNikolas Hulewsky (09:21.078)\r\nOkay. Let me ask about some of those. The birthdays, like his mom's birthday, dad's birthday, Jack's birthday.\r\n\r\n\r\nChris Koerner (09:27.318)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (09:29.07)\r\nThose are interesting coincidences. And what were the things that were done on those birthdays?\r\n\r\n\r\nChris Koerner (09:33.868)\r\nlike the last mind block, the day he joined the Bitcoin forum, which is where all of this went down. And then the day Bitcoin was created.\r\n\r\n\r\nNikolas Hulewsky (09:42.446)\r\nBecause so many things were happening during that period of time, I'm sure that there would have been something where it's like, you could have chosen his mom's date and found something that happened, but I guess those are pretty important things. So is Jack known to be a guy who's into sending secret messages like that? I guess if he's into cryptography, he is, right?\r\n\r\n\r\nChris Koerner (09:49.205)\r\nRight.\r\n\r\n\r\nFor there to be three is kind of crazy.\r\n\r\n\r\nChris Koerner (10:05.164)\r\nRight. Here's here's just just backing up Bitcoin like people think of Satoshi as like some really smart nerdy guy in a closet. But Bitcoin is not just code. It is a business. Like Bitcoin is a business. A business has to grow a business needs to acquire users, a business the best businesses acquire network effects like Uber or Facebook. Bitcoin has all those things. Twitter has those things. Square has those things right millions of people\r\n\r\n\r\nselling products through Square. Jack is a hacker, like a growth hacker, a marketer, a businessman, a coder. He's all of the above. I feel like it takes a genius like Elon or Jack to actually get something like this out to the world. Like there are probably a lot of people that could write the code for Bitcoin, but who can actually grow it like a business? Like I think Jack has done.\r\n\r\n\r\nNikolas Hulewsky (10:54.722)\r\nWell, and if you look at it, Satoshi didn't just create this thing in his closet and then release it to the world. There have been a lot of people who have worked on this. I can't remember his name. This guy came out and was like, hey, you have this back door that could allow anybody to access any Bitcoin wallet at any time. cool. So they fixed it. Bitcoin Cash is a fork off of Bitcoin. Litecoin is a fork off of Bitcoin.\r\n\r\n\r\nChris Koerner (11:03.436)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (11:12.353)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (11:21.016)\r\nThat's why Hal Finney was so important and thought to be Satoshi is because he was actually contributing to the creation of Bitcoin. yes, there was like this thesis, but then over time, a group of people worked together to create Bitcoin. And there's still a group of people that manage Bitcoin, so to speak. The miners secure the network, people who are mining new Bitcoins, they're the first statement in the ledger. So they're making sure that we continue to have\r\n\r\n\r\nChris Koerner (11:47.138)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (11:50.318)\r\nvery clear delineation of provenance. Where did it come from? Who did it go to and where is it now? So it's always been a community. Like it is a social network in that sense and it kind of a weird way to think about it, but it is.\r\n\r\n\r\nChris Koerner (12:00.12)\r\nMm-hmm.\r\n\r\n\r\nYeah, I'm convinced. Like I'm just convinced. I don't think those bitcoins are ever gonna move. I think it's Jack Dorsey. He doesn't need a few more billion. And I think it's amazing. It's incredible. One of Yeah, but but if that Bitcoin moves Bitcoin crashes, right? Period. End of story because it's like, people that own Bitcoin or people that are in the know it's supply and demand. Like we're writing that off. And there have been a few times like with this these court orders.\r\n\r\n\r\nNikolas Hulewsky (12:11.458)\r\nfew more billion, like he could have... Go, finish that and then I'll say mine.\r\n\r\n\r\nNikolas Hulewsky (12:19.874)\r\nWhy?\r\n\r\n\r\nChris Koerner (12:31.574)\r\nwhen we thought that Bitcoin was about to move and Bitcoin crashed because people just thought Satoshi's wallet was about to move. And Jack knows that. So whatever he gains monetarily, he loses in the grand scheme of things because the total market cap drop.\r\n\r\n\r\nNikolas Hulewsky (12:47.99)\r\ninteresting. It's almost like I mean, Satoshi's kind of became become this myth like figure if anybody was to be out of this Satoshi, it'd be it'd be a letdown. It doesn't matter who it is, it would be a letdown. Like, because he'd be like, Oh, man, it was because you've like built him up to this mythical, like figure. I people have theories that he came from the future. Like, oh, he came from the future to create I don't know if you've read any of those. I go down all those rabbit holes like\r\n\r\n\r\nChris Koerner (12:58.458)\r\nMm Yeah.\r\n\r\n\r\nYeah, and he knows that.\r\n\r\n\r\nChris Koerner (13:08.428)\r\nMm-hmm.\r\n\r\n\r\nYou\r\n\r\n\r\nNikolas Hulewsky (13:16.962)\r\nHe came to the future because he knows the dollar is going to crash. And so he wanted to create a currency that would, and it was like, well, okay, this is a well thought out theory. I guess I, I'm more mean from the standpoint. Let's, I don't know that he wanted to sell Twitter. He could have had the money to buy Twitter if he had gone. And there are now sophisticated financial instruments that will allow you to borrow against Bitcoin as an asset. Right? So he could have done that. I guess there would have been a risk that it would have leaked.\r\n\r\n\r\nChris Koerner (13:41.57)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nit would have he would have had to have moved it though. You can't keep it in your own wallet if you borrow against it. Because you have to collateralize it. You've to like put it with an escrow service and then you borrow against it.\r\n\r\n\r\nNikolas Hulewsky (13:49.004)\r\nWhy?\r\n\r\n\r\nYou can.\r\n\r\n\r\nso you can't.\r\n\r\n\r\nNikolas Hulewsky (13:58.976)\r\nOkay, so you can't collateralize it unless it's in a third party.\r\n\r\n\r\nChris Koerner (14:02.37)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (14:08.334)\r\nThere would have to be, there could be a way around that.\r\n\r\n\r\nChris Koerner (14:09.558)\r\nYeah, one of the one of the arguments against it was he was too busy. He was too busy founding, you know, Twitter and square to do it. And it's just like, that's like saying Elon couldn't have founded, you know, the boring company Neuralink, like you name it, like it's Parkinson's law, these guys, like they need to be founding five things at once. That's how they operate. I think that's a really weak argument.\r\n\r\n\r\nNikolas Hulewsky (14:36.706)\r\nI think that's part of it, also they're complimentary, all of them, and their accelerants. The underlying philosophy of Twitter was they would never go in and delete tweets. It would be there. It's a public record. It's the open ledger, so to speak. The network is supporting it. Same with the payments platform that he's doing with Square or Block now. The idea was to disrupt our current\r\n\r\n\r\nChris Koerner (14:41.261)\r\nYeah.\r\n\r\n\r\nChris Koerner (14:49.4)\r\nMm.\r\n\r\n\r\nMm-hmm. Yeah.\r\n\r\n\r\nNikolas Hulewsky (15:05.931)\r\npayment system, which is still primarily ACH, which is just nuts to me.\r\n\r\n\r\nChris Koerner (15:10.23)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (15:12.654)\r\nAll right. I'm in. Cool. I have a framework that I've been thinking about this week. Can I run it by you? All right. Framework Fridays. I love it. I've talked to a few founders this week and\r\n\r\n\r\nChris Koerner (15:12.696)\r\nAnyway, I thought that was cool.\r\n\r\n\r\nChris Koerner (15:20.162)\r\nFramework Friday.\r\n\r\n\r\nNikolas Hulewsky (15:29.518)\r\nThis is something that I always find funny. I don't know. I don't know. You've heard me joke about it. Lots of times when you're starting a business, you're like, Oh yeah, I'll buy a business. I'll just hire an operator. Right. Like I'll just get someone to operate the business or they haven't ever gotten into the business yet. And they're like, Oh, I don't want to be working in the business. I want to be working on the business. I got to get out of the weeds. Right. You've we've heard all of these where people think we've said these things. So I think this is a framework that\r\n\r\n\r\nChris Koerner (15:38.828)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (15:49.026)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (15:52.748)\r\nWe've said this.\r\n\r\n\r\nNikolas Hulewsky (15:59.648)\r\nentrepreneurs should think about and really, really take to heart. There's a period of time where you are the business. You're the business. And then there comes a point where you become the bottleneck and the business becomes the business. And this is how I'm kind of thinking about it.\r\n\r\n\r\nYou go from having a job so you started. We talked to Tyler. He's got a job right now. Right, he's got no systems, no processes. It's on Google Sheets. There's nothing that can be replicated. Pretty soon he'll have a high paying job, which will be great, and then eventually he will have a business. And the way that I define a business is this is an entity. That can operate on its own, generating cash flows without you for at least three months. And the reason I said three months on there is because.\r\n\r\n\r\nChris Koerner (16:26.957)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (16:50.476)\r\nI really don't think any business should be operated without its leader, quote unquote, right? But there's a period, like it has enough systems and expectations in place and SOPs that it can continue to run and operate without you. But it takes time to get to that point. And if you as the founder are thinking about, I got to get out of the weeds first, you're discounting the most valuable thing about your business, which is you. Because in the beginning of your business, your differentiator, your product is you.\r\n\r\n\r\nChris Koerner (16:54.604)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (17:20.386)\r\nYou might be smarter than somebody in a certain way. You might have a specific skill. You might have a innate genius, whatever it is. You're the differentiator. And if you try to remove that too quickly, you're removing your differentiation and your competitive advantage. So I like to think of it in three phases. There's phase one where you're doing all of the work. Sorry, four phases. Phase one where you're doing all of the work. You're the business, you're the agency. Phase two, where you start outsourcing.\r\n\r\n\r\nChris Koerner (17:33.645)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (17:47.896)\r\nthings that are non-differentiated, payroll, accounts payable, admin work. And then there's phase three where you start outsourcing things that are differentiated but that are not your zone of genius. So maybe your sales process is different or maybe your marketing tactics are different. Chris Kerner's highest and best use is not on the operations. He may be doing something that's differentiated on the operations, but that's not his highest and best use. So you offload those things first.\r\n\r\n\r\nAnd then the last phase is you offloading your zone of genius. And I think what a lot of founders do instead is they focus on, I just got to get myself out of the business right now. And they think they have to offload everything at first. And as a result, the business suffers because of it. They don't take this measured approach of like, okay, first things that don't need me. Second, things that do need me, but aren't differentiated. Third, the things that do need me and are differentiated, I'll do last. And I, I just think that's a\r\n\r\n\r\nChris Koerner (18:28.567)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (18:40.386)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (18:43.852)\r\nGreat framework to think about if you're starting up a business is, what phase am I in? Where can I afford to be operating? Just so you have a roadmap for what's next and what's coming. What do think?\r\n\r\n\r\nChris Koerner (18:54.912)\r\nI agree. And not only does it suffer because of the fact that they're outsourcing things too quickly, but they don't even know that it's suffering because they don't know what it would look like had they not done that. Right. It's like, there's no AB test for that. Let's say, let's say they're growing 30 % a month. They step out and they're growing 20 % a month. and it's like, okay. yeah, I'm okay with that. But what they don't know is like, they could be growing 40 % a month because it was a seasonal business and they were rounding the corner to March and April.\r\n\r\n\r\nRight. so 20 % of month is actually half of what they would have done if he wouldn't have stepped out too soon. So that's the hard part. There's a lot of times you don't know what you don't know and you can't truly a B test life out.\r\n\r\n\r\nNikolas Hulewsky (19:36.238)\r\nAnd they fall in love with this idea of, I'm going to remove myself from the business. It's going to be passive income. It's going to be like, okay, maybe when you're a $10 million company, but you're trying to do that at like $200,000 a year in revenue. You haven't built the thing yet. It's not big enough to have the things that you need in order for it to be quote unquote passive. You need systems, you need processes, you need SOPs, you need people. So you can't have one without the other, but they try to remove themselves.\r\n\r\n\r\nway too quickly. We've done this. mean, how many times have you and I freaking done this? Hopefully we've finally learned our lesson, but...\r\n\r\n\r\nChris Koerner (20:08.428)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (20:11.96)\r\nProbably not.\r\n\r\n\r\nNikolas Hulewsky (20:13.432)\r\nYeah, we'll probably do it again.\r\n\r\n\r\nChris Koerner (20:15.464)\r\nI think this is true at any scale size business. I had this conversation just yesterday with someone about Elon Musk. Who's winning the self-driving car wars right now? I'll tell you, it's not Tesla. It's Waymo. And Tesla should be winning. Tesla had such a head start. They had millions of cars on the road, billions of miles worth of data. Two reasons why they're not winning. In my opinion, one, Elon said, we don't need LIDAR. We don't need it. It's irrelevant.\r\n\r\n\r\nNikolas Hulewsky (20:27.63)\r\nQuemo.\r\n\r\n\r\nChris Koerner (20:44.728)\r\ncameras and sensors are fine. Well, you're biased because you can't sell Teslas profitably with LIDAR on the car, right? Whereas Waymo is like, we need LIDAR. This is gonna be a $300,000 car, but that's okay because we're just learning right now. And now Waymo is winning. Like they're winning in the accuracy department, right? My question to you, Nick is,\r\n\r\n\r\nIf Tesla is the only business that Elon's running, there's no Neuralink, there's no boring company, there's no solar city, anything, you name it. Are they, are they still losing? I don't think so. I don't think so. I think Elon is the world's greatest entrepreneur hands down, no hold barred. But the fact that all of his companies have CEOs, but he's the owner, but he's not really in the weeds because he doesn't have enough time to be in the weeds that the CEOs were like, they don't really feel accountable. Like\r\n\r\n\r\nOnly the owner cares about the business. I don't care how many shares the CEO owns or the executive team owns. They will not care about that business ever as much as the owner ever will. And if the owner owns six businesses, even if he has competent CEOs, I'm just saying it will, it will be underperforming compared to what it could be doing if it was their only thing.\r\n\r\n\r\nNikolas Hulewsky (21:53.4)\r\nWhat?\r\n\r\n\r\nI'm gonna say it a different way. think that when big companies like that lose their core, their zone of genius, that's when you start to see the decline. I'm likening it to these small businesses, Like, okay, Chris Kerner's zone of genius is growth marketing, zero to one, all right? And if you started a business and that was core to that business and then all of a sudden you removed yourself from that business, it's not going to do as well in that area as you would have.\r\n\r\n\r\nyou can still systematize everything, but at some point, it's not as good as you. Apple is a very good corollary for this. It loses Steve Jobs and what happens? Still highly profitable. It's still growing, but they're not coming out with cool new products. They're not cutting edge anymore. Tesla is probably an example of that. Elon moves on to found other things. The LiDAR versus camera sensors debate, yeah, they're losing on that. It's because the guy who's the driving zone of genius in that company\r\n\r\n\r\nChris Koerner (22:26.37)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (22:49.848)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (22:56.114)\r\nnow replaced himself. So it is a trade-off, I think. But at that scale, Elon can do that and maybe he takes a 20 % hit in market value. But if you're like a $100,000 business and you're an entrepreneur, you can't afford to do that yet. You don't have the flexibility to lose that much market value because your business crashes. But it's the same concept, right? You're removing the thing that made it what it is. It's not going to do as well.\r\n\r\n\r\nChris Koerner (23:10.626)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (23:25.206)\r\nYeah, and you just have to be aware of it. Like, I'm not even saying Elon's doing anything wrong. Like he's deading out way ahead. His net worth is way more that he has all these things, right? And just like owning a hold, a hold co or a parent company, right? It's like just know what you're going into. And you know what? That's not optimal. That's not optimized. That's an optimized, but that's okay, because I want to own six different things. And I'm cool with that. But like you said, if it's a $200,000 business, and this is supposed to support your, your income, and you just quit your job, just just\r\n\r\n\r\nNote that.\r\n\r\n\r\nNikolas Hulewsky (23:56.046)\r\nYeah, because you're just not there yet. You're not Elon. You're not Tim Cook. You're not Mark Zuckerberg. You're running a B2B agency that does digital marketing, all right? Like get to a million dollars in revenue first, and then we can start talking about whether or not you have a leadership team and what your ethos is. You can't borrow problems that aren't your problems yet. You've got to deal with the problem set in front of you, otherwise you're never going to get to one, five, 10, 20 million dollars.\r\n\r\n\r\nChris Koerner (24:06.808)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (24:22.294)\r\nYeah. Yeah. They say good is the enemy to great. And my question is like, what good or great are you measuring? Are you measuring the financial performance of a company or your quality of life? Like I'm measuring for, I'm optimizing measuring for the quality of my life. So I'm okay having good companies if my life is great because of it, because if I have a great financial performing company, then it means my life is probably good because I'm not enjoying it as much.\r\n\r\n\r\nNikolas Hulewsky (24:27.374)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (24:50.434)\r\nYeah, that's great. So that's the thing I've been thinking about this week.\r\n\r\n\r\nChris Koerner (24:54.69)\r\nI like it. I like it. I got something for you. You ready? Let's just get back to the basics. We're to talk about good old fashioned business ideas. Okay.\r\n\r\n\r\nNikolas Hulewsky (24:58.286)\r\nAlright, let's do it.\r\n\r\n\r\nChris Koerner (25:07.928)\r\nYou ready?\r\n\r\n\r\nNikolas Hulewsky (25:08.909)\r\nI'm ready, Freddy.\r\n\r\n\r\nChris Koerner (25:11.906)\r\nthink someone needs to start like think of toro okay for those who don't know toro is like the Airbnb for cars you buy a car you can rent it out to others and it's doing really well and the best toros are the interesting vehicles like Cybertrucks right if you buy a Camry put it on toro you're not gonna do great kind of like Airbnb's Airbnb's are a little saturated you want to do well you got to have a freaking tree house on the side of a cliff okay you got to be unique\r\n\r\n\r\nWho out there is renting out like cyber trucks by the half hour or by the minute or by the hour? I think that would be a thing. I think cyber trucks are a novelty. They're really cool. They're fast. They're Instagrammable. People just want to see what it's like. It's $300 to rent one for a day. You don't need it for a day. You just want to take your girlfriend out on a date in it or something or just test drive it. Why isn't there a system for that? What are we doing?\r\n\r\n\r\nNikolas Hulewsky (26:09.842)\r\nOkay, I'll give you my feedback. I think it's hard logistically. Okay, let's say someone has it for an hour, then someone's got to go pick it up. It's got to go to a place. They've got to clean it. They've got to get it ready for the next person who's going to be renting it. just inherently, obviously the per hour basis is going to be a lot higher than a daily basis, but then the per hour rate on a daily rental. But I think that's probably the biggest thing logistically. If we had self-driving, then I think it becomes\r\n\r\n\r\nChris Koerner (26:12.44)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (26:38.442)\r\nWay simpler.\r\n\r\n\r\nChris Koerner (26:40.956)\r\nYeah, I think it's just a logistic, a logistical issue to manage. I don't think you need to clean it every time. depending on how long you take it out, think renting it for a hundred dollars for an hour.\r\n\r\n\r\nThat's a great price. and you could do that 10 times a day.\r\n\r\n\r\nNikolas Hulewsky (27:00.258)\r\nOr you could do it, you could do the Chris Kerner special. You could go and market our usages of a Cybertruck and then go rent a Cybertruck for a day, just like have it planned out. Go rent the Cybertruck for a day and then take it and let people use it for an hour.\r\n\r\n\r\nChris Koerner (27:15.01)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (27:20.28)\r\nYep. Uh, I think the heart, the hard part is insurance when you do stuff like that. Um, obviously I'm never going to let insurance stop me from launching something, but imagine if you had a cyber truck, you had it wrapped QR code, everything drive this for a half hour, 30 minutes for $50 and you just start driving. It's like a veil. Like if you see me driving, I'm available right now. And you just start driving around like a walking billboard wherever there's, you know, downtown areas, bars, outdoor shopping.\r\n\r\n\r\nAnd it's, more of an impulse buy than anything. It kind of like an Uber driver just kind of drives around these areas waiting to get jobs. You do the same, but you're just giving rides and you sit in the passenger seat and they're, they're governors put on it so they can't go crazy. And there is a risk of insurance, but I think someone could make a lot of money doing this. And I think someone could make even more money if they did the harder route, raised a bunch of money and launched a platform for this.\r\n\r\n\r\nNikolas Hulewsky (27:56.238)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (28:13.934)\r\nYou, your idea gave me an idea for something else.\r\n\r\n\r\nChris Koerner (28:17.74)\r\nThat's the whole purpose of this show.\r\n\r\n\r\nNikolas Hulewsky (28:19.118)\r\nOkay. Would you have a... What did you think we're doing here, Nick? So would the truck have a QR code on it? Okay. Here's something I've always wondered. And like, I can't believe you and I have never spoken about this. Cause your mind, I know would just take this to levels. It has hitherto been unforeseen.\r\n\r\n\r\nChris Koerner (28:28.662)\r\nYeah, absolutely.\r\n\r\n\r\nChris Koerner (28:41.72)\r\nAll right, Maroni.\r\n\r\n\r\nNikolas Hulewsky (28:42.99)\r\nYou ever been on the plane flying back from Hawaii? I took a long video. My wife's like, let me get that video. And what do I do? Do I text my wife that video? No, Chris, what do you do? You got to airdrop that shiz because it's too big. It's too big a file format. So all right, cool. I airdrop it. I go to airdrop it. There are dozens of people who I could have airdropped it to. And I've been thinking about this and I can't believe we haven't spoken about it, but it just finally popped back up.\r\n\r\n\r\nChris Koerner (28:52.524)\r\nNope, airdrop it.\r\n\r\n\r\nChris Koerner (28:57.527)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (29:04.705)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (29:10.51)\r\nI don't know, because I'm not as creative as you, okay? How could you use that for a good bait and switch? could you go to, and I don't know what the product would be, but let's say you have a product that you just want to get out, or let's say that you want people to go and tune into your podcast. You just go to the mall and you're like, all right, I have a link to my podcast and I'm going to airdrop it to whoever just shows up. Bloop, bloop, and you just airdrop it. It seems like,\r\n\r\n\r\nChris Koerner (29:13.88)\r\nyou\r\n\r\n\r\nChris Koerner (29:18.572)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (29:26.957)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (29:37.08)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (29:40.406)\r\nA viral growth hack that I've never heard of anybody taking advantage of.\r\n\r\n\r\nChris Koerner (29:44.408)\r\nAre we talking about eBasses here?\r\n\r\n\r\nNikolas Hulewsky (29:47.308)\r\nWhat an E, an E-Bass? What's an E-Bass Chris?\r\n\r\n\r\nChris Koerner (29:49.576)\r\nit's an ethical bait and switch. Is that not the biggest oxymoron you've ever heard ever?\r\n\r\n\r\nWe've talked about these.\r\n\r\n\r\nNikolas Hulewsky (30:01.152)\r\nnever heard of a sea bass, I've never heard of an e-bass.\r\n\r\n\r\nChris Koerner (30:02.648)\r\nSo I love this. I've seen like memes and like reels about people that have trolled others on planes doing this, right? Like taking a crazy ugly picture and airdropped it to everyone on the plane. But you're right. There could be something there. It reminds me of a reel that I posted a while ago of a guy that posted QR codes all around the city. And it just said, you cheated on me. I can't believe you did that. And then anyone walking by will scan that.\r\n\r\n\r\nNikolas Hulewsky (30:11.488)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nChris Koerner (30:30.634)\r\nAnd when they scan it, it just leads to some guy's Instagram page, which is like the lowest and worst use of someone's captive attention. Right. But it's the same principle. So I think you need to have something high ticket enough. You got to find that balance between mass market enough and high ticket enough, because you're not going to be able to airdrop this to thousands of people an hour, right? It's going to be like dozens of people an hour, if you're in the right place, because proximity, like you have to be close enough to that many people. Go ahead.\r\n\r\n\r\nNikolas Hulewsky (30:52.429)\r\nWhy couldn't you?\r\n\r\n\r\nNikolas Hulewsky (30:56.942)\r\nHear me out.\r\n\r\n\r\nHere to be out my friend. All right, I'm gonna go to me. Let's say I wanted to promote the podcast. How could I do that? How could I go and find a place where many people are gathering at the same time? What if you went to concert, sporting mat, a conference? Conference! Maybe I go to like the industry conference. Like why could I not drop a thousand links to my podcast just walking around a conference?\r\n\r\n\r\nChris Koerner (31:06.102)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (31:11.128)\r\nConcert, a sporting event?\r\n\r\n\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nChris Koerner (31:25.708)\r\nYou could, but you know what it, it reminds me of retention.com, the software that where you can basically swipe email addresses from people browsing on your website without them opting in. People do that. It's a billion dollar business, but those opt-ins are very, very, very low intent because they didn't opt in, you know? So that's your problem there is it's a low ticket offer. It's just a free podcast and it's low intent. So you can do it.\r\n\r\n\r\nNikolas Hulewsky (31:27.937)\r\nI know I'm asking what\r\n\r\n\r\nNikolas Hulewsky (31:54.53)\r\ndon't disagree with you.\r\n\r\n\r\nChris Koerner (31:55.038)\r\nhow many people will actually subscribe and listen.\r\n\r\n\r\nNikolas Hulewsky (31:58.168)\r\nI'm saying it's a spray and pray type of an approach. If I'm doing email marketing or SMS marketing or whatever, it's the same kind of, it's just a numbers game at that point, right? So maybe I spend zero money, but I go walk around a conference and I send it to a thousand people and I get five subscribers out of it, which would suck. I wish I got more, but I didn't spend any money. I guess you'd count my time walking around the conference.\r\n\r\n\r\nChris Koerner (32:01.077)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (32:27.084)\r\nYeah, so I guess your framework would be much better. What would be a high ticket item you could do that with and where would you go? To sell that high ticket item.\r\n\r\n\r\nChris Koerner (32:31.479)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (32:36.024)\r\nSo let's go back to conferences. I like we're going to hold Co-conf in a mother do right? A conference for hold Co-business owners. Let's say we had a competing conference. Okay. That was six months later. We would, it would make sense for us to buy a ticket to this and airdrop this to everyone there and say like anyone who gets this airdrop gets a 30 % discount, but you have to book today. Like that is a very captive audience.\r\n\r\n\r\nNikolas Hulewsky (32:57.87)\r\nHmm.\r\n\r\n\r\nChris Koerner (33:04.432)\r\nLike it's captive, it's relevant, has, you know, they can afford your conference because they just paid eight grand for this one. It's high ticket. Like that could be like the sweet spot.\r\n\r\n\r\nNikolas Hulewsky (33:15.266)\r\nThat's really interesting. What are some other like other is high ticket impulse buy on oxymoron?\r\n\r\n\r\nChris Koerner (33:23.448)\r\nMm It's like it's an oxymoron, but it's surely a thing, right? Like it's a thing for people that can afford it.\r\n\r\n\r\nNikolas Hulewsky (33:23.704)\r\nprobably is an oxymoron. I'm trying to think if there's any other high ticket.\r\n\r\n\r\nNikolas Hulewsky (33:31.138)\r\nYeah, I like I think of a car brand or a or a. Maybe expensive luxury handbag. You know you go to a conference where a lot of people. that would be interesting. OK, they have these bridal conferences. Have you heard of these like they're like bridal expos in different geographies and they get like tens of thousands of women come out to these. Because you know they're getting married and they spend a lot more time on the bridal expo's.\r\n\r\n\r\nChris Koerner (33:50.827)\r\nYeah, yeah.\r\n\r\n\r\nChris Koerner (33:59.146)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (34:00.214)\r\nYou could go to a bridal expo if you're a venue in that town and literally just airdrop people. That would be a really cool use case, because otherwise you got to pay for a billboard or you got to pay. You got to pay to be a sponsor of you probably get kicked out. But, you know, who cares? You'd have to pay to be a sponsor of that conference. But you just walk. buy tickets and walk the floor and like, all right, airdrop.\r\n\r\n\r\nChris Koerner (34:05.932)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (34:13.698)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (34:21.516)\r\nYeah, dude, how about this? This is gonna be very specific, but you can take it to be anything. You buy a ticket to a Green Bay Packers game. Cheapest ticket you can buy. Nosebleeds, okay? Let's say you have some affiliate or some, let's just pretend that you have a business that sells, you know, Brett Favre autograph memorabilia. You got hundreds of these things. Cards, know, shoes, balls, whatever.\r\n\r\n\r\nYou walk down to like the part of the field where the rich people are right the expensive seats close to the field or the suites and you're just walking you didn't buy a seat there and you're just freaking air dropping everyone that you that you get near you can't tell me you wouldn't sell something from that hundred dollar ticket to get in.\r\n\r\n\r\nNikolas Hulewsky (35:06.606)\r\nBro, Chris, I have an idea. I think you're gonna crap your pants. You might even tell Mohammed to edit this out. I swear on my life. Are you ready? I swear on my life. You could pay someone to go to the busiest Buc-E's close to you and just walk the floor or stand in the parking lot and every customer for a week, every customer who comes in and out, airdrop the link to Texas snacks. That's your target demo, dude.\r\n\r\n\r\nChris Koerner (35:10.648)\r\nOkay.\r\n\r\n\r\nOkay.\r\n\r\n\r\nChris Koerner (35:23.842)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (35:27.65)\r\nMmm. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (35:36.344)\r\nYou're trying to get people who shop at Bucky's, then, you know, can't buy it where they are. Tell me that's not a good hack,\r\n\r\n\r\nChris Koerner (35:36.418)\r\nI know.\r\n\r\n\r\nI know.\r\n\r\n\r\nChris Koerner (35:44.042)\r\nIt's a great hack. The only problem is I love Buc-E's and I want to stay in their good graces because I've thought about many things I could do along these lines. I've literally planned out flyers on cars, sign spinners as you pull in and pull out. We literally put up a billboard on the highway as you left the Buc-E's in Temple, Texas that said, you know, buy Buc-E's online, TexasNex.com. So I'm totally with you and I would do that if I didn't want.\r\n\r\n\r\nBucky's corporate to hate me. It's a great idea.\r\n\r\n\r\nNikolas Hulewsky (36:16.108)\r\nIt is a great idea.\r\n\r\n\r\nChris Koerner (36:17.848)\r\nIt's a really great app. But what do we think about that as memorabilia though? Come on.\r\n\r\n\r\nNikolas Hulewsky (36:21.462)\r\nOK, well, I mean, it's the same idea, right? You're you're just you're thinking about where can you find your target demo that is going to meet in person at like a specific time and place like, yeah, that that agreement Packers you sell that memorabilia go to agreement Packers game if you sell, I don't know. The brand new is that your favorite band? Yeah, if you sell brand new merch, go to a freaking brand new concert and just.\r\n\r\n\r\nChris Koerner (36:27.607)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (36:31.767)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (36:44.018)\r\nMm hmm. Yeah.\r\n\r\n\r\nNikolas Hulewsky (36:50.198)\r\nAir drop everybody in that place.\r\n\r\n\r\nChris Koerner (36:52.504)\r\nYeah. How have you tested? Like how quickly can you airdrop 30 people if they're all popping up? I want to test this. I'm gonna try it at church. Say I won't. Yeah. Why not? Okay. What's that? What's that? Is that a chip on my shoulder? Looks like a chip. Weird.\r\n\r\n\r\nNikolas Hulewsky (36:59.702)\r\nI've never tested it. I never tested 30 people. Are you? You won't. You won't try it. I know you won't, dude, because you're a freaking. What's that on your? It's growing. What is that thing? Why are you leaning so hard to the left?\r\n\r\n\r\nChris Koerner (37:18.22)\r\nThat's a good idea. I, I just love the idea of brainstorming stuff like this, you know, like walking through first class, those are wealthy people. What could you airdrop to them? They're traveling. Maybe they're business travelers. Like I like the idea of getting even more granular, finding an event with thousands of people going to the part of the event with the wealthy people, because that equals the high ticket, finding a high ticket offer product service that is super relevant to that. he's got an idea.\r\n\r\n\r\nNikolas Hulewsky (37:27.982)\r\nHmm?\r\n\r\n\r\nNikolas Hulewsky (37:32.142)\r\ncolleges.\r\n\r\n\r\nNikolas Hulewsky (37:46.722)\r\nDude, I'm gonna do this.\r\n\r\n\r\nChris Koerner (37:47.712)\r\nHe's got an idea. He's got an idea.\r\n\r\n\r\nNikolas Hulewsky (37:51.106)\r\nI'm going to a conference next week.\r\n\r\n\r\nChris Koerner (37:52.994)\r\nOkay, and Boise.\r\n\r\n\r\nNikolas Hulewsky (37:55.094)\r\nIt's in Southern California. Gosh, I'm trying to think of how specific, whatever, dude. I'll just say, it's not going to come out next week anyways. I'm going to my brother-in-law's skilled nursing facilities annual meeting. At the annual meeting will be every single sniff administrator. He owns 60 plus buildings. Okay. We have been trying to get this product that we have into their sniffs and their sniffs love it. They do the ones that have seen it, but it's just hard. got to get into in front of every single administrator.\r\n\r\n\r\nChris Koerner (38:07.798)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nChris Koerner (38:22.678)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (38:25.462)\r\nI'm going, I'm going to airdrop a link to Volterra. I'm going to do it. Why would I not do it?\r\n\r\n\r\nChris Koerner (38:30.05)\r\nMm-hmm.\r\n\r\n\r\nYou have to do it. Do it in a certain way for me. Will you? I'm just thinking of this on the fly. Okay. Google doc. The best copywriting you've ever put together in your life. I'll help you chat. GPT can help you anyway. Yeah. Just like, just like heart stopping copywriting because heart stopping copywriting combined with a really interesting marketing methods, such as airdropping strangers at a conference equals.\r\n\r\n\r\nNikolas Hulewsky (38:36.43)\r\nOkay, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (38:45.326)\r\nOkay, so I'll ask you to do it, okay.\r\n\r\n\r\nChris Koerner (38:59.17)\r\nThey will for sure read everything in that Google Doc provided it's not too long. So it's just like, yeah, this is awkward. You're sitting in a conference right now and some stranger just airdropped you. Guess what? That stranger is me. Here's why I airdropped you. This will be worth your time. I've been in your shoes. I've been a sniff administrator. You know what sucks about it? CPT codes, right? Or you're billing your, your billing coordinator is doing control find.\r\n\r\n\r\nNikolas Hulewsky (39:08.173)\r\nand\r\n\r\n\r\nChris Koerner (39:27.532)\r\nto find things to bill Medicaid for. It's the worst. What if AI could fix that for you? Don't go too long and then just put a link in there, a tracking link so you know who is clicking and are they clicking? dude, that could be worth a lot of money.\r\n\r\n\r\nNikolas Hulewsky (39:41.57)\r\nI'm so excited. I'm so excited, dude. Next Friday, I'm back next Friday. So we will talk about how it went. And most of these people know me. So they're going to be like, why am getting a text from Nick? What the freak? Like they're going to read it.\r\n\r\n\r\nChris Koerner (39:55.0)\r\nYeah. I mean, at our current, at what we think our LTV lifetime value and our churn is, I mean, $500 a month. Let's say they stick around for two years, could be much longer. Okay. That's $12,000. Let's say our lifetime value of a customer.\r\n\r\n\r\nNikolas Hulewsky (40:11.982)\r\nHigher than that. It's a thousand, a thousand per month. That's our pricing.\r\n\r\n\r\nChris Koerner (40:15.672)\r\nOkay. So for $24,000, let's say that's our LTV, our churn is close to zero, $24,000. Our margins are, they're healthy. Cause it's just software, right? But what kind of evaluation does that add to the business? I mean, this could be like a 10 X revenue business from evaluation perspective. So if you, if you do that to a hundred people and one of them signs up as a customer, you're adding a quarter million dollars worth of value to our\r\n\r\n\r\nNikolas Hulewsky (40:47.502)\r\nI'm excited to try this dude. Hold on a second. Look at Chris over there. So we're done? Yeah, yeah, yeah, that'll do it. Yeah, yeah.\r\n\r\n\r\nChris Koerner (40:47.574)\r\nHmm. I'd say that dog will hunt. Will that dog hunt? Hey doggy, are you gonna hunt?\r\n\r\n\r\nChris Koerner (40:59.35)\r\nHey daddy, will that dog hunt? Is that dog gonna hunt daddy?\r\n\r\n\r\nMy gosh, we're so stupid.\r\n\r\n\r\nNikolas Hulewsky (41:06.574)\r\nI love this. All right. I love it. All right. Tune in next week to find out if it worked or not.\r\n\r\n\r\nChris Koerner (41:12.556)\r\nI'm excited. That's good.\r\n\r\n\r\nNikolas Hulewsky (41:14.254)\r\nOkay, that's it, that's the show. Leave on the cliffhanger, 40 minutes.\r\n\r\n\r\nChris Koerner (41:17.865)\r\nWow, that was good.",
  "metadata": {
    "duration": "",
    "date": "2025-03-14",
    "platform_source": "Google Drive"
  }
}