{
  "episode_number": "221",
  "episode_title": "From W2 Employee to a $18M Pool Business with Malcolm Marshall",
  "guest_name": "Malcolm Marshall",
  "business_name": "Poolology",
  "transcript": "﻿Nikolas Hulewsky (00:00.15)\r\nfine. But I'm trying not to go longer than 60 minutes. I don't think we're going to go longer than 60 minutes. So just heads up. right. Shut up. All right, Malcolm. I'm really, really excited to talk to you today because I think you have an amazing story. And you represent the hope that many people who are in a W-2 want to see that then transition into entrepreneurship. So by way of background,\r\n\r\n\r\nMalcolm Marshall (00:06.692)\r\nOkay, yeah, I don't think I'm that interesting.\r\n\r\n\r\nNikolas Hulewsky (00:30.456)\r\nYou're currently the CEO of a company named called Poolology, which is a central Texas based company. You've got not only are you building pools, but you also do maintenance. You built that to an $18 million a year operation. Before that, you started as a VP of finance. can't remember the exact title for a company. I can't remember the parent name of the company, but it's C4. If anyone's done the pre-workouts, C4. I think extend is another thing that you take post-workout.\r\n\r\n\r\nSo you've seen a lot, you made the transition, you're super freaking accomplished. You've got a large company. Here's my first question I'm gonna ask you, you ready for it? If I dropped you into a brand new city tomorrow with $90,000, what would your first move be to replicate the success that you've seen at Poolology?\r\n\r\n\r\nMalcolm Marshall (01:05.938)\r\nSo I'm ready.\r\n\r\n\r\nMalcolm Marshall (01:16.752)\r\nYou know, maybe I wasn't ready. That's a tough one because it's been a grind over the last 10 years. Didn't happen overnight for sure. I think starting a business starts with customers, right? But I'm probably not going to spend any of that $90,000 on customers. If we're bootstrapping this thing, I'm mainly going to focus on starting with the right people.\r\n\r\n\r\nNikolas Hulewsky (01:18.761)\r\nHahaha!\r\n\r\n\r\nMalcolm Marshall (01:45.65)\r\nhow to acquire the right people for $90,000. think that's mainly operational at that point. And I'm being as grassroots as I can on lead acquisition and customer acquisition.\r\n\r\n\r\nNikolas Hulewsky (01:49.108)\r\nMm. That's interesting.\r\n\r\n\r\nNikolas Hulewsky (01:57.307)\r\nWhen you started poolology, how did you do it? Was it acquisition or was it de novo from scratch?\r\n\r\n\r\nMalcolm Marshall (02:02.214)\r\nSo we started Pooology primarily as a service company. We didn't really anticipate doing the amount of construction that we do. And even when we started doing construction, we were like, this will always be a secondary offering. Now it's become our primary offering. But to start Pooology, all we did was we bought a route, a pre-existing route. had 43 pools in Austin, Texas. And the guy was moving to Hawaii, so it was...\r\n\r\n\r\nThey in about 12 months of revenue and we picked it up. That's how we got started, pretty simple.\r\n\r\n\r\nNikolas Hulewsky (02:36.286)\r\nso it was just pool servicing, 43 accounts. What was the monthly revenue on that or yearly revenue?\r\n\r\n\r\nMalcolm Marshall (02:38.77)\r\nWe should just pull service, yeah. 43 accounts.\r\n\r\n\r\nSo it was about $180 a month. So it's about 2200 times, about $90,000 of annual revenue. Of course it was recurring. was monthly recurring revenue.\r\n\r\n\r\nNikolas Hulewsky (02:52.972)\r\nWow. Okay.\r\n\r\n\r\nAnd you said we, you said we multiple times. Who was the we in that equation?\r\n\r\n\r\nMalcolm Marshall (03:00.274)\r\nYeah, I have a business partner. name is Michael Jerob. He runs our service operations still. And we work together at C4, so we've got a long history together.\r\n\r\n\r\nNikolas Hulewsky (03:10.786)\r\nHmm. Where is C4 located?\r\n\r\n\r\nMalcolm Marshall (03:15.46)\r\nAt the time, was in College Station, Bryan, Texas, Bryan College Station. They moved to Austin about two years after I left.\r\n\r\n\r\nNikolas Hulewsky (03:16.652)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (03:24.216)\r\nSo walk me through this. You're working for a fairly large company. I don't know what they're doing in revenues, but I'm assuming north of 20 or $30 million. You don't have to blink twice if I'm in the ballpark.\r\n\r\n\r\nMalcolm Marshall (03:34.77)\r\nWe're way off. So we're talking about C4. Yeah, I'll run you through C4. It's fantastic story if you want. So I started at C4 in 2008 before C4 existed. At the time it was a sports nutrition brand called Cellucor, parent company called Woodbolt. And there was about maybe 10 of us. We're doing $8 million in revenue a year.\r\n\r\n\r\nNikolas Hulewsky (03:38.316)\r\nWait, yeah.\r\n\r\n\r\nNikolas Hulewsky (03:45.806)\r\nPlease. Yeah.\r\n\r\n\r\nNikolas Hulewsky (04:04.588)\r\nOkay, I can tell I'm already off. yep. I was way off.\r\n\r\n\r\nMalcolm Marshall (04:04.796)\r\nAnd.\r\n\r\n\r\nSo, we launched C4 in 2011. And it was at the same time that Jack Jack Jack 3d some people call you know, the pre workout. They had gotten pulled off the shelf because they had an ingredient in their product that was banned by the FDA and they kind of pushed back and was like, Hey, this shouldn't be banned. We're going to keep it in here.\r\n\r\n\r\nNikolas Hulewsky (04:20.362)\r\nYep.\r\n\r\n\r\nMalcolm Marshall (04:33.522)\r\nAnd so they got pulled off the shelf and we had just launched C4 and C4 was primed and ready from a branding perspective and a relationship perspective to just fill the shelf space. so it is, and at the time it was just a powder. Now you can buy it in a, you know, ready to drink can at convenience stores. But we went from 8 million in 2008 to\r\n\r\n\r\nNikolas Hulewsky (04:45.74)\r\nand C4 is pre-workout.\r\n\r\n\r\nMalcolm Marshall (05:00.754)\r\nFast forward to 2011, we did about 50 million in revenue in 2011. The next year we did 85 million, then 155 million. And when I left in 2017, we finished that year around 300 million.\r\n\r\n\r\nNikolas Hulewsky (05:04.57)\r\nmy gosh.\r\n\r\n\r\nNikolas Hulewsky (05:16.716)\r\nDude.\r\n\r\n\r\nMalcolm Marshall (05:17.33)\r\nIt was, it was wild. It was work all the time, which is a lot of what motivated me to get here.\r\n\r\n\r\nNikolas Hulewsky (05:23.886)\r\nHow much of that revenue was just C4, just the pre-workout?\r\n\r\n\r\nMalcolm Marshall (05:30.706)\r\ncan't remember, but greater than 50%. Greater than 50%.\r\n\r\n\r\nNikolas Hulewsky (05:32.27)\r\nLike above 50 %? Geez. That's a lot of dudes just freaking jacked going into the gym wired to the hilt off a C4. That's insane. $350 million by the time that you left?\r\n\r\n\r\nMalcolm Marshall (05:39.695)\r\nRight.\r\n\r\n\r\nMalcolm Marshall (05:46.29)\r\nAnd from my understanding, that I left in 2018, 2017, 2018, about 10 years after I got there, my understanding is that this year they'll do somewhere around 900 million. So they've tripled since then.\r\n\r\n\r\nNikolas Hulewsky (05:51.128)\r\nUh-huh.\r\n\r\n\r\nNikolas Hulewsky (05:59.054)\r\nAre they privately held? they bootstrapped? VC backed?\r\n\r\n\r\nMalcolm Marshall (06:03.954)\r\nThey are privately held. Actually, they sold a third of the company in 2022 to curate Dr. Pepper. But it's still majority owned by mainly by one owner who I had the privilege to work under and learn a lot from. His name's Doss Cunningham. And, you know, I'm not sure if he owns a majority at this point or not, but I would imagine he owns somewhere around 50 % of the company.\r\n\r\n\r\nNikolas Hulewsky (06:11.426)\r\ninteresting.\r\n\r\n\r\nNikolas Hulewsky (06:24.184)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (06:31.852)\r\nSo you were, what was your role there?\r\n\r\n\r\nMalcolm Marshall (06:34.884)\r\nI was vice president of finance, which really developed as years went along. So when I started in 2008, I was the only accounting and finance person on the team. was fresh out of college, didn't really know what I was doing, but I learned as it went. And then it was so fast paced. just, had no choice but to keep up. So we built a team. By the time I left, there was probably 30 people in accounting and finance.\r\n\r\n\r\nIn about 2015, I stopped working in the accounting function and became primarily at P &A, at P &A of financial planning analysis.\r\n\r\n\r\nNikolas Hulewsky (07:14.392)\r\nWhat's PNA? FPNA. Yeah, yeah, yeah. So not CFO though, cause like a lot of FPNA is CFO role, right? You're just on that team.\r\n\r\n\r\nMalcolm Marshall (07:25.456)\r\nYeah, so.\r\n\r\n\r\nI was the leading financial, but I left when I was 30. We hired our first CFO in 2015, so was 28. So it was just...\r\n\r\n\r\nNikolas Hulewsky (07:41.934)\r\nSo I'll fill in the blanks. I'm to fill in the blanks here. What Malcolm is hemming and hawing around is that, cause I've been a part of companies who have done this. You've grown. You're at the scale where the company needs a CFO and a COO and a CIO, all these C level suites of people who understand how to manage a hundred, 200, $300 million businesses. And you've been the guy who's been doing it since day one and you're 30 years old, but you don't necessarily meet the qualification of the criteria to be CFO, but you've been acting like the CFO the whole entire time. So that's.\r\n\r\n\r\nI think that's probably why you're hemming and hawing, because you're like, I was basically the CFO, but I didn't have that title necessarily assigned. Yeah.\r\n\r\n\r\nMalcolm Marshall (08:15.89)\r\nRight, exactly. You know, I didn't have the boardroom experience. I didn't have the relationships. And it was the only company I'd ever worked at. And so I understood the company very well, understood what we need to do to grow and how to execute that growth. compared to the rest of the management team, would have been pretty green.\r\n\r\n\r\nNikolas Hulewsky (08:28.024)\r\nDude, that...\r\n\r\n\r\nNikolas Hulewsky (08:41.038)\r\nI'm really curious. So 2008 million, 2017, 350 million? Okay, that's nine years. That is not a long time. That's an insane amount of growth. I'm gonna tell you a story and then I'm gonna ask you a question. When I was getting my MBA at UCLA, I had a professor who was the CFO of a company called Packard Bell. Have you heard of Packard Bell?\r\n\r\n\r\nMalcolm Marshall (08:46.875)\r\nYeah, around that.\r\n\r\n\r\nMalcolm Marshall (08:54.556)\r\nOK.\r\n\r\n\r\nMalcolm Marshall (09:03.929)\r\nI think so.\r\n\r\n\r\nNikolas Hulewsky (09:05.152)\r\nOkay, yes, that is the exact answer. So Packard Bell was a company that manufactured, they were a computer manufacturing company. And the reason they chose Packard Bell is because it sounds like Hewlett Packard, and it also sounds like Alexander Bell Telephone Company, Pacific Bell Telephone Company. And so they picked those names very intentionally, Packard Bell, so that people would think like, yeah, I've heard of that company. That's an existing company, but it wasn't. It was founded in the 80s. And within a course of like 10 years,\r\n\r\n\r\nThey went from zero to a billion dollars in revenue and they, this guy was the CFO. And so he talked about their experience. so their experience going from zero to a billion. And I can't remember if it was 10 years, but it was a short period of time. I think it might've even been shorter than that. He was like, we were robbing Peter to pay Paul because it was a capital intensive business, right? They had to have actual pieces to do the manufacturing. And so all he was doing was like, I know our terms are net 30, but I'm to have to pay you in 90 days. He was just.\r\n\r\n\r\nLiterally negotiating with vendors the whole entire time. He said it was insanely stressful, but they ended up IPOing and they're now defunct, but it was a whole thing. Whenever I hear of people with that growth, like you just did, I think of that professor. Cause I'm like, that's gotta be super stressful. It doesn't matter if it's a SaaS company that has really high margins or a company that does manufacturing. It's just stressful, that kind of growth. So what was the biggest stressor during that period of time?\r\n\r\n\r\nas you were growing.\r\n\r\n\r\nMalcolm Marshall (10:36.53)\r\nI think it was how many things we needed to do at one time, not necessarily one thing, but how many things we did at once. So in 2014, we sold a third of the company that was eventually bought back, which is how they sold a third of the company again. But in 2014, we implemented a new ERP. We built a new facility which greatly intensified accounts payable while\r\n\r\n\r\nNikolas Hulewsky (10:44.494)\r\nMm.\r\n\r\n\r\nMalcolm Marshall (11:05.265)\r\ngoing through a nine figure transaction. And all of those things at one time was just how fast can you get all this done? And so I slept at the office a lot and those sort of things. And there wasn't a large team around me at that point either. And me being, I was the most experienced, maybe the oldest person on that finance team at 27 years old.\r\n\r\n\r\nNikolas Hulewsky (11:09.486)\r\nCheers.\r\n\r\n\r\nNikolas Hulewsky (11:30.958)\r\nDude, so what's so interesting is that most people on the finance team are the guys who say no. No, we can't do that. No, we can't do that. Was that your initial inclination when stuff was happening like this? When it was like, hey man, we got to build a new facility. And you're like, with what money? Everything we have is in inventory. We don't have a line of credit.\r\n\r\n\r\nMalcolm Marshall (11:50.994)\r\nYou know, at first it was, so by 2014, our cash stresses weren't as bad as probably 2012 and before. 2008 to 2012, I was doing a lot of accounts receivable, or accounts payable management, a lot of that. Hey, I can't pay you this week, I can't pay you this month. I have this coming in, don't worry, I'm gonna pay you first type of stuff.\r\n\r\n\r\nNikolas Hulewsky (12:11.382)\r\nYeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (12:20.302)\r\nAnd in 2012, sorry, what was revenues in 2012?\r\n\r\n\r\nMalcolm Marshall (12:23.982)\r\nit was 85 million. So that's about the time where we started seeing some cashflow.\r\n\r\n\r\nNikolas Hulewsky (12:26.19)\r\nOkay, so if we're on.\r\n\r\n\r\nSo for entrepreneurs who are like, Oh, it must get better once I'm like past 10 million in revenue or 5 million in revenue, even 85 million in revenue, you still play in that shell game sometimes of like, don't cash that check yet. Oh shoot payrolls about to hit. Oh my gosh. Is our ABL maxed out? I don't know. Let's go check. Like dude, it's so funny when you're hyper scaling, you think it's going to be so much better because you have so much more revenue, but it's still the same problems.\r\n\r\n\r\nMalcolm Marshall (12:39.515)\r\nYeah.\r\n\r\n\r\nMalcolm Marshall (12:53.586)\r\nRight, yeah. So there was a time where, and Doss was an extremely aggressive entrepreneur, always, you know, he always has a very optimistic outlook of how things are going to turn out and he's going to put the necessary pieces in place and he's gonna figure out how to, you know, if he runs into financial stresses, because of it, he's gonna figure that out later, but he's gonna make the moves that he thinks is going to help him grow, which is why the company's been so successful.\r\n\r\n\r\nBut there was a time where I was like, what are we doing? We can't hire this outside sales team because I can't pay for the labels that we bought for these, you know, the C4 canisters.\r\n\r\n\r\nNikolas Hulewsky (13:36.142)\r\nWhen did it flip for you? When did it flip from like, no, no, no, to you realizing you can't say no to business? You have to figure it out. really?\r\n\r\n\r\nMalcolm Marshall (13:46.532)\r\nAfter I left, it was really after I left it. At some point I just realized he wasn't, he wasn't going to listen to me. that it didn't matter if we had the money or not, you know, so we were going to figure it out. and so I don't think it really flipped until after I left and I started running my own business and started thinking about it. And I was like, you know, I, I see, I see his approach now and\r\n\r\n\r\nNikolas Hulewsky (14:00.216)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (14:14.401)\r\nReally?\r\n\r\n\r\nMalcolm Marshall (14:15.154)\r\nAnd then sometimes I have to push myself to mimic that approach, right? I have to push myself to stay that aggressive in the face of risk.\r\n\r\n\r\nNikolas Hulewsky (14:19.117)\r\nYeah.\r\n\r\n\r\nDude, do you ever think how lucky you are to have that guy as an example? Like, I'm not gonna put words in your mouth. I'll give you my anecdotal experience. I worked at a company, they were part of a public traded company, but the segment of the business was doing like $15 million a year in revenue when I joined. Three years later, they were doing $150, $200 million in revenue. Massive growth, right? And it was similar to your experience. I call it the pulse test, where they're like,\r\n\r\n\r\nMalcolm Marshall (14:27.494)\r\nYes, all the time.\r\n\r\n\r\nNikolas Hulewsky (14:50.03)\r\nOh, we need someone to fill this role. Well, what's the test? Well, does he have a pulse? He's alive. Okay, throw him in. You know what mean? So I'm I'm grateful looking back that I had that experience because I wouldn't have gotten that experience if I wouldn't have been within that company. But when I left, had there were a lot of things I was like, man, they should have done this different. Oh, I can't believe they did. I just had a lot in my mind. I wouldn't say animosity. But yeah, probably a little bit probably a little bit of animosity. It wasn't until years later when I had a business that I owned where I was like, ah,\r\n\r\n\r\nThat's why they cared so much about collections. that's why bad debt was a thing. Okay. And it gave me just a whole other level of appreciation for those people. Did you have a similar experience?\r\n\r\n\r\nMalcolm Marshall (15:23.663)\r\nRight.\r\n\r\n\r\nMalcolm Marshall (15:35.92)\r\nI did, yeah. Like I said, I really didn't realize how lucky I was until I left and what that approach was until I left. especially looking back now, I may have started a business, had I not started there, I may have started a business one day that was more of an operation, more of a job, right? Versus the way I look at business now, which is this,\r\n\r\n\r\nNikolas Hulewsky (16:00.59)\r\nMm.\r\n\r\n\r\nMalcolm Marshall (16:06.31)\r\nthis platform to grow multiple things on it, to see where I can take it. And I feel like there's no limits to what can be accomplished. And I really contribute that to my time there at C4.\r\n\r\n\r\nNikolas Hulewsky (16:22.894)\r\nHow much money were you making in your last year at C4?\r\n\r\n\r\nMalcolm Marshall (16:26.756)\r\nAbout 200,000 annually.\r\n\r\n\r\nNikolas Hulewsky (16:29.236)\r\nDid you have equity or shadow equity or was like there any piece of that?\r\n\r\n\r\nMalcolm Marshall (16:32.72)\r\nI did, and I still have some because it, well, we cashed out a third of it a couple of years ago, but I do have a, well, for what the business is worth now, a significant amount of equity.\r\n\r\n\r\nNikolas Hulewsky (16:46.946)\r\nthat's so interesting. If you wanted to sell it, what would you do? Is there a secondary market for it? No. So if you wanted liquidity, you'd have to go to the owner and be like, Hey man, I really want to buy this house and I need some money. Okay. Really?\r\n\r\n\r\nMalcolm Marshall (16:52.316)\r\nThere's not, no, I'm just.\r\n\r\n\r\nMalcolm Marshall (17:00.004)\r\nI would, and I don't think he would do it. So I'm pretty much waiting on a liquidity event.\r\n\r\n\r\nNikolas Hulewsky (17:05.388)\r\nWhy? Why wouldn't he do it?\r\n\r\n\r\nMalcolm Marshall (17:07.502)\r\nI just, I think when you see that sort of success, you start getting a lot of people coming to you, I think he's asked out. I think that he's just, he's adopted a mentality. He may, he may for me, I don't know. I probably would never ask, because I saw how many people were just reaching and grabbing at him as success started to find him that I would probably just never ask.\r\n\r\n\r\nNikolas Hulewsky (17:12.162)\r\nIs he still in hyper growth mode?\r\n\r\n\r\nNikolas Hulewsky (17:27.714)\r\nYeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (17:33.376)\r\nSo, okay, the point I'm making is you're making good money, you had some equity in this business, and it was a massive business. Why the freak would you buy a 43 person account or however many pool route? That doesn't make any sense to me. I would understand if you left and you're like, I bought this company and now it's a platform and it was doing 5 million a year, but 100 grand a year pool route company? What were you thinking?\r\n\r\n\r\nMalcolm Marshall (17:58.707)\r\nSo we started Poology in 2015. So I actually stayed on at C4 for two years after. I wasn't sure if I was going to do that or not when we started Poology. But I told you about the hardest time in the business, 2014, where we were implementing an ERP. were selling a third of the business, rebuilding facility. And that's probably just the start.\r\n\r\n\r\nNikolas Hulewsky (18:07.95)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (18:23.81)\r\nLet me, let me just hop in here. So ERP, you've said it a couple of times. So it's an enterprise resource planner, procurement. I don't know what the P stands for platform. There we go. but basically if you're in a company, think of all the things that you use. You've got payroll, you've got accounting, you've got accounts payable. You've got, HR onboarding. You've got where people track their hours. All of, all of those things are probably different softwares that you use. What an ERP does is it takes all of those softwares and effectively\r\n\r\n\r\nMalcolm Marshall (18:31.25)\r\nplatform, maybe.\r\n\r\n\r\nNikolas Hulewsky (18:52.984)\r\ngives you one place or actually probably in your case, you're doing a lot of inventory management as well. So that's tying into the system. So it brings it all under one umbrella. But as the larger you get, the harder it is to pull all of those systems together. So an ERP integration, for example, my brother-in-law's company that is doing $500 million a year in revenue, they just got quoted. Who was the company? I can't remember who the company was. Like a $5 million three year ERP implementation cost and process.\r\n\r\n\r\nWhen he says ERP, you might just like gloss over. That's a really massive deal at the same time that you're also getting a probably a nine figure or eight figure investment that you've also got to be pulling the financials forward and getting you to deal in the city investors on, right? Like it's, it's a whole thing. So I just wanted to like set the table.\r\n\r\n\r\nMalcolm Marshall (19:36.083)\r\nRight. Yeah. So yeah, so we're sleeping at the office. We're working all the time. Me and my business partner, Michael, and at some point it made it kind of a statement about the future of us at C4. was something that was like, one day when we do this, and he said, you know, if we're going to work this hard, we might as well just work for ourselves. There's no way we could fail if we just work for ourselves.\r\n\r\n\r\nNikolas Hulewsky (20:06.446)\r\nHow old were you at the time?\r\n\r\n\r\nMalcolm Marshall (20:08.312)\r\nI was 27.\r\n\r\n\r\nAnd I had always been interested in entrepreneurship, but I wasn't. And I had some small things going on, some kind of side hustles. when he said that, that was, we started digging in more pretty much immediately. It was like, okay, well, this sucks. We're working all the time. We're...\r\n\r\n\r\nNikolas Hulewsky (20:31.576)\r\nMm-hmm.\r\n\r\n\r\nMalcolm Marshall (20:39.92)\r\nin a sense, underappreciated for it. We're still dealing with a lot of kind of flack from what's not getting done. Let's just go work for ourselves. So we started looking around. We started looking at businesses, to understand, you know, understanding different opportunities. I have like an idea a day that I'm throwing out at him and he's shooting most of them down and telling me that they're stupid. And one day I saw this pull truck drive by, a pull service truck.\r\n\r\n\r\nand I started digging into that industry a little bit. I thought I had a really great marketing plan. I thought it would be really easy to scale. I thought it would be really easy to get people to clean a pool every day because how hard could that be? I thought the margins were a lot stronger than they were. Pretty much everything I thought was wrong, all the research that I did, one thing that I was sure was the market was the industry is very fragmented. It's still pretty fragmented.\r\n\r\n\r\nIt was very fragmented at the time. There were almost no large players, maybe no large players. And so I was like, hey, we can roll some of these up and I think we can do really well and scale really fast.\r\n\r\n\r\nNikolas Hulewsky (21:51.566)\r\nWhen you say no large players, you mean nationally or do you mean locally where you were looking in Austin? Okay.\r\n\r\n\r\nMalcolm Marshall (21:57.605)\r\nNationally, locally, a large service company is more than 300 accounts even still. So there weren't a whole lot of large companies even in the market. But anyways, so we just kind of had this.\r\n\r\n\r\nNikolas Hulewsky (22:05.666)\r\nRight. Cheers.\r\n\r\n\r\nMalcolm Marshall (22:16.851)\r\nthis moment where we were like, we're going to work this hard, let's just work for ourselves. And then we started diving in and looking for potential businesses. And we were relatively young and inexperienced and thought we found this industry that we were going to be able to scale quickly in and have higher margins and be able to do some consolidations. And so we jumped in.\r\n\r\n\r\nNikolas Hulewsky (22:44.142)\r\nOkay, so it was thought about more of a, this is gonna be something we scale. Man, okay, I'm gonna ask this quick, that's not a quick question. I'm gonna ask this question, then I'm gonna get back into that.\r\n\r\n\r\nYou said something in there that I always say are the famous last words of any watchpreneur, which are how hard could it be? How hard could it be? We'll get someone to clean the pool. How hard could it be? And then you get into it you're like, I knew everything I knew now. Holy crap. So I do love that. But you also had this mentality of like, dude, we're contributing so much value, right? I was working at a company where I was supposed to get 3 % equity. And when I first got that, I was like, this could turn into like $3 million.\r\n\r\n\r\nthis could be three minutes like that's life-changing month three million dollars and then by the end I was like all this for three million dollars so doesn't work like that's a so it's a kind of a weird mind shift change is that kind of where you got to right is that the point you're speaking to is like that shift\r\n\r\n\r\nMalcolm Marshall (23:46.023)\r\nWell, I was from the, you know, I had equity and I knew that the equity was growing quickly and that it was going to be worth a lot of money. From a career choice in finance, I was also starting to question that. I like finance, accounting, I like numbers, but I was noticing that the payroll of the people around me was growing faster than mine, especially on the sales front.\r\n\r\n\r\nNikolas Hulewsky (24:11.918)\r\nMm.\r\n\r\n\r\nMalcolm Marshall (24:14.767)\r\nespecially when you go from selling 8 million to 85 million and you're watching these salaries and commissions grow around you. And it wouldn't call it India's, but it was more like, okay, maybe I should have picked it. Maybe I should have made another career choice if I really wanted to be as successful as I wanna be. And so,\r\n\r\n\r\nNikolas Hulewsky (24:26.572)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (24:35.694)\r\nMmm.\r\n\r\n\r\nMalcolm Marshall (24:42.321)\r\nI wasn't unhappy with my salary compared to the industry and especially people my age. I was doing really well. But I was seeing that, you know, even when we added a CFO later, I was like, this is one of the lowest paid executives on our staff. Is this where I want to be? Is this where I want to grow my career?\r\n\r\n\r\nNikolas Hulewsky (25:03.598)\r\nSo I get the thesis, right? Hey, we're gonna roll up the pool space or pool maintenance. Was it pool maintenance at the time, not construction? Okay, we're gonna roll up the pool maintenance space. What I don't understand is the entry point. Usually if you're gonna do a roll up, you will target a larger company that has systems and processes that have a management team in place because what you, you're trying to scale pretty quickly and you need that deep bench of talent. You need that.\r\n\r\n\r\nMalcolm Marshall (25:12.209)\r\nYeah, maintenance.\r\n\r\n\r\nNikolas Hulewsky (25:31.054)\r\nthose systems that can scale. don't want to have to be the one to create them. $90,000 or $100,000 business is not that. Do you regret? Do you regret buying that first business for $90,000? Would you do it differently or walk me through why you made that decision?\r\n\r\n\r\nMalcolm Marshall (25:46.693)\r\nYeah, I do differently. Knowing what I know now, I don't think I understood that then. I didn't understand that then. I didn't really understand this concept of a platform business. so, you know, we're really relying on what we thought would be a successful marketing plan, targeting individual pool owners in an aggressive way that wasn't all that special.\r\n\r\n\r\nNikolas Hulewsky (25:51.148)\r\nOkay.\r\n\r\n\r\nMalcolm Marshall (26:15.219)\r\nin hindsight. And so we thought that that 40 pull her out was going to be sufficient. We also thought that understanding pulls was going to be a lot simpler than it is. So it was just, maybe it's a bit of arrogance. you know, I don't know, but it was, it was, we were wrong.\r\n\r\n\r\non a lot of fronts, on a lot of fronts that really required us to grind and really work our asses off in order to overcome some of those things.\r\n\r\n\r\nNikolas Hulewsky (26:45.58)\r\nWell...\r\n\r\n\r\nNikolas Hulewsky (26:53.824)\r\nI almost any entrepreneur has this moment or this saying of like, it was way harder than I thought it was going to be. So I don't think you're unique in that sense. Scott Galloway is kind of this famous media personality now, but he has this saying, and he's invested in a lot of companies. He's been on the board of a lot of companies. And he's like, I've learned that when I became an activist investor and I wanted to get on the board of the company, once I got in the room, they weren't.\r\n\r\n\r\nAs there's no, I wasn't as smart as I thought and they weren't as dumb as I'd hoped. And that's like a quote that's always stuck with me, but it's the same in any of these spaces, right? Like you're evaluating the pool space. You're like, well, how hard could it be? Like we'll go get business. We'll hope it's easy to differentiate. And then you get into it you're like, crap, I'm not as smart as I thought. And they're not as dumb or as bad as this as I had hoped. And like, you just have this realization when you did that realization, did you go by or did you just double down on growing organically?\r\n\r\n\r\nMalcolm Marshall (27:53.363)\r\nWell, the primary realization was it's going to be really hard to staff this business. And so we immediately had people issues. We weren't ready for that. It wasn't something that we had really experienced at C4. And so when we realized we weren't going to be able to staff as well as we hoped and...\r\n\r\n\r\nand the marketing plan wasn't coming to fruition quite the way we wanted. We did slow down a little bit. We really did focus on organic growth. We did primarily door to door. It was the primary means of growth, door to door.\r\n\r\n\r\nNikolas Hulewsky (28:34.21)\r\nHmm. So that first year sales, you bought it, it was doing 99,000. What did you do for year one after you bought it?\r\n\r\n\r\nMalcolm Marshall (28:45.811)\r\nWe grew from 43 accounts to like 83 accounts. So about doubled the business. Yeah, 100,000 to 200,000.\r\n\r\n\r\nNikolas Hulewsky (28:49.804)\r\nAnd did that translate?\r\n\r\n\r\nNikolas Hulewsky (28:55.298)\r\nAnd then year two, what did you do year two?\r\n\r\n\r\nMalcolm Marshall (28:57.639)\r\nWe grew to about 200 accounts. So maybe about, I believe it was about 400,000 in revenue with repair revenue that year.\r\n\r\n\r\nNikolas Hulewsky (29:00.077)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (29:06.104)\r\nSo when was that moment of like, okay, we're just gonna double down on organic, we'll go knock doors. Was that early or did you end up doing that later?\r\n\r\n\r\nMalcolm Marshall (29:15.475)\r\nI wouldn't call it a moment. So it was kind of a slow transition. was like we slowly gave up. Slowly gave up on what we thought the plan was.\r\n\r\n\r\nNikolas Hulewsky (29:17.239)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (29:21.95)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (29:27.374)\r\nWell, because those first two years you were still working at C4, right? So it's like you could, yeah, maybe it is kind of a slow trickle.\r\n\r\n\r\nMalcolm Marshall (29:31.631)\r\nI was.\r\n\r\n\r\nMalcolm Marshall (29:36.369)\r\nYeah, so my business partner, Michael, he was here running the day to day and I was primarily working at night on lead acquisition and marketing type things. So go ahead.\r\n\r\n\r\nNikolas Hulewsky (29:50.062)\r\nSo it was after that second year you did 400,000 that you jumped in full time or what was the impetus for you saying like, I gotta do this?\r\n\r\n\r\nMalcolm Marshall (30:00.083)\r\nThey, so in 2015, C4 hired their first CFO. And I had gone, this was before they hired the CFO, I had gone to DOS, the owner, and I had said, hey, I need to adjust my schedule a little bit. I'm gonna move back to Temple and I wanna be remote two days a week. And so we had to work through that. But I continued to run the day-to-day of the finance and accounting operations, hired our first CFO.\r\n\r\n\r\nNikolas Hulewsky (30:05.518)\r\nMm.\r\n\r\n\r\nMalcolm Marshall (30:29.181)\r\nfired him about a year later, I stepped back in. And then when we hired the second one, that was really what drove me out of the business and drove me here to get started full time focusing on this. was...\r\n\r\n\r\nNikolas Hulewsky (30:44.11)\r\nWas it getting passed over or was it like, I'm not gonna get the opportunity that I thought I was going to get? Like what was different?\r\n\r\n\r\nMalcolm Marshall (30:51.183)\r\nIt was dealing with another CFO. wasn't that my feelings were hurt. It was that I had just gone through somebody come in for their first 100 days and want everybody to change the way they're doing things and work around the clock. And then here we were six months later and I was about to do it again. And I was just like, I don't think that...\r\n\r\n\r\nNikolas Hulewsky (30:53.87)\r\nMmm, okay. Yeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (31:16.589)\r\nYeah.\r\n\r\n\r\nMalcolm Marshall (31:19.219)\r\nThis is something that I want to go through. I think that I would rather go and drive this business that Michael's been able to grow the operation. We've been able to push on the marketing side. I think it's big enough to support both of us now. Let's go ahead and jump in.\r\n\r\n\r\nNikolas Hulewsky (31:35.374)\r\nAnd so at that point it was about 200 accounts. You just done $400,000 total in revenue. It still wasn't at the space where it was able to pay you what you were making at C4, right?\r\n\r\n\r\nMalcolm Marshall (31:45.469)\r\nNo, no.\r\n\r\n\r\nI'm not sure what the income gap was. It was big. It was, there was a lot of years of just taking the absolute bare minimum in order to, you know, stay afloat.\r\n\r\n\r\nNikolas Hulewsky (31:53.518)\r\nIt was big.\r\n\r\n\r\nNikolas Hulewsky (32:03.798)\r\nWalk me through the growth of the company, because obviously you're 18 million now. You're about 10 years on, maybe eight years from when you left C4. What did the growth pattern look like in terms of top line revenue?\r\n\r\n\r\nMalcolm Marshall (32:13.447)\r\nMm-hmm.\r\n\r\n\r\nMalcolm Marshall (32:20.115)\r\nSo in 2017, so we had grown to about 200 accounts. We had a fairly slow growth year. We only added like 50 accounts. So we were like 250 accounts and I'm pretty disappointed with the way things are going. But I talked with a friend who, he was more of an acquaintance then. I know him much better now, but he started telling me about the pools he was building and the margins that he was receiving.\r\n\r\n\r\nAnd it got me interested in the construction piece. And so in 2018, we started building pools. In order jump in, we hired a superintendent, experienced superintendent who had worked at a well-known company in the area and started building in 2018. And so that's when we really started seeing fast growth.\r\n\r\n\r\nNikolas Hulewsky (32:58.048)\r\nInteresting.\r\n\r\n\r\nNikolas Hulewsky (33:12.631)\r\nDid you sub out everything or was everything in house?\r\n\r\n\r\nMalcolm Marshall (33:16.379)\r\nSub out everything, even still. Yeah.\r\n\r\n\r\nNikolas Hulewsky (33:17.824)\r\nSo that is still your money. So we, own a tree trimming business in Dallas and I call it, it's basically just like a lead gen company. So we have an entrepreneur who's operating that business. We get the lead, we work it, close it, et cetera. And then we just sub it out to, basically managing the process of managing all these subs. At some points, it probably makes sense when you have enough scale to bring it in house. Maybe there's some margin opportunity, but yeah, we, sub everything out as well. When did you realize, well, I guess\r\n\r\n\r\nWhat did you do that first year? 2018 you started building pools. How much did that add?\r\n\r\n\r\nMalcolm Marshall (33:51.229)\r\nWe built like 15 pools. Some of them were at cost. Trying to get our foot on the ground. So that year we did.\r\n\r\n\r\nNikolas Hulewsky (34:00.418)\r\nWell, for context though, sorry, finish without I cut you off.\r\n\r\n\r\nMalcolm Marshall (34:06.035)\r\nThat year we did about a million and a half of revenue. So it went from 400,000 to about a million and a half.\r\n\r\n\r\nNikolas Hulewsky (34:12.078)\r\nWell, and so one account on the pool maintenance side is $1,200 a year. Is that what you said?\r\n\r\n\r\nMalcolm Marshall (34:17.651)\r\nIt's probably at this point is about $3,500 a year. Then it was probably $2,500 a year.\r\n\r\n\r\nNikolas Hulewsky (34:21.294)\r\nOkay, so back then, $2,500 a year, that's one account, but one pool is how much in revenue?\r\n\r\n\r\nMalcolm Marshall (34:31.635)\r\nThen it was probably about 70, now it's 100 to 110.\r\n\r\n\r\nNikolas Hulewsky (34:36.814)\r\nAll right, so 70 grand though, like that's a much bigger ticket price than the $1,500. And you've got this cool opportunity all of a sudden where if we can build the pools, we can also then supplement it with this recurring aspect of we'll do the maintenance as well.\r\n\r\n\r\nMalcolm Marshall (34:38.717)\r\nYeah.\r\n\r\n\r\nRight.\r\n\r\n\r\nMalcolm Marshall (34:54.151)\r\nWhen we jumped into construction, that was one benefit was more pulls to service, right? I mean, we were a service company first and we also understood that there was more enterprise value in monthly recurring revenue.\r\n\r\n\r\nBut one thing that we were thinking is, well, let's make this money. The market was still very fragmented at the time. Let's make this money from these construction projects and reinvest it into service and buy more service accounts and add them into our current business. And so really, we looked at construction as a means to grow the service business.\r\n\r\n\r\nNikolas Hulewsky (35:33.838)\r\nAnd when you say buy service accounts, what did you mean? Was that like buy them through paid acquisition or were you going out and buying routes?\r\n\r\n\r\nMalcolm Marshall (35:41.093)\r\nMost service, yeah, buying routes, buying routes. So most service companies out there, no more than 200 accounts. Even some of the most longest established, kind of well run in the area, in the Austin area are 250 accounts.\r\n\r\n\r\nNikolas Hulewsky (35:43.961)\r\ninteresting.\r\n\r\n\r\nNikolas Hulewsky (35:57.334)\r\nIs that normal to grow through routes?\r\n\r\n\r\nMalcolm Marshall (36:03.707)\r\nI think in our industry, I think it is.\r\n\r\n\r\nNikolas Hulewsky (36:06.454)\r\nAnd what you said that routes typically trade at one times revenue, is that right? At that size? Okay, and like, what does that translate to as a profit multiple?\r\n\r\n\r\nMalcolm Marshall (36:11.665)\r\nYeah, 12 months, 12 months, 12 months revenue.\r\n\r\n\r\nNikolas Hulewsky (36:26.254)\r\nIf I'm doing $100,000 in a route, what would my expected net margins be on that? 10,000?\r\n\r\n\r\nMalcolm Marshall (36:32.019)\r\nWell, yeah, not much. Yeah, we're expecting about 8 % on our 8 % EBITDA margins.\r\n\r\n\r\nNikolas Hulewsky (36:35.118)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (36:43.107)\r\nso that's like a 12X, even a multiple then.\r\n\r\n\r\nMalcolm Marshall (36:44.627)\r\nYeah, yeah, but you know, if you're if you're operating with you and three service techs and you have a 200 pull route, you're probably your margin is going to be a lot higher than that. You probably don't have an office space. You know, you're even a margin is going to be a lot higher than that. Probably closer to 15 to 20.\r\n\r\n\r\nNikolas Hulewsky (37:04.631)\r\nDo those multiple scale as well? Is it 12 times EBITDA? Let's say you're doing a million dollars a year in profit and you've got a bunch of recurring accounts. Is that business a $12 million business?\r\n\r\n\r\nMalcolm Marshall (37:19.824)\r\nIt's not lower.\r\n\r\n\r\nNikolas Hulewsky (37:24.342)\r\nLower or higher? Lower, okay. How do those typically trade then?\r\n\r\n\r\nMalcolm Marshall (37:30.523)\r\nSo I just kind of went through a kind of informal business valuation. But I'm having to mentally break the company apart between construction and service in order to kind of think through the multiples. Obviously, construction is going to receive a much lower multiple, anywhere from three to six acts, where the service business with the monthly recurring revenue\r\n\r\n\r\nNikolas Hulewsky (37:36.236)\r\nThank you.\r\n\r\n\r\nNikolas Hulewsky (37:45.919)\r\nSure, sure.\r\n\r\n\r\nNikolas Hulewsky (37:52.653)\r\nRight.\r\n\r\n\r\nMalcolm Marshall (37:59.493)\r\nI want to see is more in the, you know, eight to 12, depending on scale. It is. It is. I feel like, you know, from where we're at right now, right now we have 900 accounts that we go to every single week. And, you know, right now we're still probably only do we probably get somewhere between a six and an eight multiple for the size that we're at and the EBITDA that we're producing.\r\n\r\n\r\nNikolas Hulewsky (38:03.098)\r\nOK, so it is still really high.\r\n\r\n\r\nNikolas Hulewsky (38:07.96)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (38:28.654)\r\nfor the, for the pool construction piece, I find that that really interesting because it is, it is different. You're going, you have a re recurring revenue model. You don't necessarily have contracts with these people, but they're pretty sticky, right? Cause once you have a pool guy or gal, you're not going to switch. but the construction of the pool is project-based. it's, it's almost Feaster family. We got to go out and, and I actually win those jobs. I don't even know how you acquire customers for you that first year.\r\n\r\n\r\nHow did you even get 15? That seems like a lot in year one to me. Maybe I'm crazy.\r\n\r\n\r\nMalcolm Marshall (39:02.863)\r\nYeah, so I have another business partner. His name is Chubba. Chubba cases, not his real name, but that's how everybody knows him. So I won't even tell you his real first name because it doesn't matter. So anyways, Chubba is not afraid to talk to anybody. And so he went out and basically found us most of those projects to do, to break ground on. You know, we did have at that point, had\r\n\r\n\r\nNikolas Hulewsky (39:08.918)\r\nNikolas Hulewsky (39:12.622)\r\nOkay.\r\n\r\n\r\nMalcolm Marshall (39:32.243)\r\n250, 300 service accounts. And so we have six or seven trucks on the road. And so we do have some relationships in the community and some brand. And then we really relied on Chubbett to shamelessly plug us everywhere he could.\r\n\r\n\r\nNikolas Hulewsky (39:40.152)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (39:44.974)\r\nHow do you?\r\n\r\n\r\nHow do you acquire customers now? obviously the acquisition of routes on the maintenance side, but the pool construction, how do you acquire those customers?\r\n\r\n\r\nMalcolm Marshall (39:56.273)\r\nYeah. So obviously word of mouth is number one. We do a lot of advertising on Google and on Metta. Metta is strongest for new pool cells and new construction leads. Google is stronger for service.\r\n\r\n\r\nNikolas Hulewsky (40:20.28)\r\ninteresting. Do you know what your customer acquisition cost is on Meta? Like how much does it cost for you to acquire a customer who's going to build a hundred thousand dollar pool?\r\n\r\n\r\nMalcolm Marshall (40:22.169)\r\nMalcolm Marshall (40:30.459)\r\nIt's probably right now about $140 a lead. and then, so it's probably about 1500. We're probably converting one in 10 of those. So, $40. Yeah, I may be overshooting there. I may be overshooting. So I pay pretty close attention to the cost per conversion and the conversion just being\r\n\r\n\r\nNikolas Hulewsky (40:32.43)\r\nA lead. Okay.\r\n\r\n\r\nNikolas Hulewsky (40:43.852)\r\nWow, that's a high intent lead.\r\n\r\n\r\nNikolas Hulewsky (40:48.152)\r\nI don't know my opinion it is.\r\n\r\n\r\nMalcolm Marshall (40:57.681)\r\nDid they click on our ad and give us their information? After that, I primarily focus on how many contracts are we signing. And we have a marketing budget. Are we acquiring leads at a good cost? And are they eventually converting to drive our overall contract number that we're trying to achieve? And so I don't have a CAC Israeli available.\r\n\r\n\r\nNikolas Hulewsky (41:00.472)\r\nGot it.\r\n\r\n\r\nNikolas Hulewsky (41:24.302)\r\nThat's fine. What percentage of those customers who purchase a pool through you convert to maintenance?\r\n\r\n\r\nMalcolm Marshall (41:33.843)\r\nabout 45 % convert to maintenance. Should be higher. Yeah. You know, I think part of it is we don't build, sometimes we build high-end pools, but for the most part, we build pretty modest pools. And so we get a lot of DIYers.\r\n\r\n\r\nNikolas Hulewsky (41:37.89)\r\nThat just seems really low. Why is that so low?\r\n\r\n\r\nNikolas Hulewsky (41:55.502)\r\nOh, have you ever measured it by like, okay, jobs we could have won, if that makes sense, where it's like, all right, if there's 100 jobs, 50 of them are, tell us they're gonna be DIY. And so of the 50 that we could win, we win 40. So like an 80 % win rate is a lot better than a 40 % win rate. You know what I mean? Do you ever look at it like that?\r\n\r\n\r\nMalcolm Marshall (42:16.893)\r\nYeah.\r\n\r\n\r\nI don't, I like it, I like looking at it that way better. It sounds better. Yeah, I do know, I haven't looked at this information in a while, but five years ago, maybe a little longer, I did look pretty closely at how many people are DIYers versus paying for service. And at the time it was like 20 % were paying for service, 80 % were DIY.\r\n\r\n\r\nNikolas Hulewsky (42:23.534)\r\nMakes me feel better.\r\n\r\n\r\nMalcolm Marshall (42:49.883)\r\nYou know, so from that standpoint, our conversion rate would be really good. But I think it could be higher. I think that if we really thought about how to bring that customer on and show them the value, I don't think many of them would cancel if we were a little more aggressive with promotions up front.\r\n\r\n\r\nNikolas Hulewsky (42:55.758)\r\nIt'd be really great.\r\n\r\n\r\nNikolas Hulewsky (43:08.842)\r\nYeah. And I think that, I think that's a really good point, right? So it's like, okay, there could be 50 % of people who are DIYers. And so it's like, there was only 50 % that could have been winnable jobs. But then when you look at it from the perspective of, why did the other 50 % go DIY? Was it really because they couldn't afford it? Or was it really because they didn't want the service? Like did we do a good enough job in explaining what we do so that they would make the purchase? So that, that's a good perspective as well to have. landing the\r\n\r\n\r\nlanding the plane here. couple of questions. My first question is 10 years ago, you made this bet. We're sitting 10 years later. Are you glad you made this bet? Is this still the industry that you think that you thought it was when you got into it in terms of a potential upside opportunity? You've built an amazing business like an $18 million home services business that you've built is pretty incredible. The vast majority of people don't crack 1 million, 5 million, 10 like\r\n\r\n\r\nName your number and it gets smaller and smaller. So that's incredible. But from your perspective, looking back, is it what you thought it was going to be?\r\n\r\n\r\nMalcolm Marshall (44:14.503)\r\nWhen I look at it compared to...\r\n\r\n\r\nmy W2 job, I couldn't be happier that I made the bet. Sometimes when I look at the opportunity cost among industries, like, you know, maybe I probably could have picked a better industry, especially on the construction side, where the multiple is so low and even fast growth is, you're seeing marginal changes in your enterprise value. You know,\r\n\r\n\r\nNikolas Hulewsky (44:33.038)\r\nMm.\r\n\r\n\r\nMalcolm Marshall (44:47.717)\r\nI think, hey, I could be pouring my energy into something else that would multiply faster. Also, it is a tough industry. People tend to be emotional about the project you're putting in their backyard. They're there the entire time. You're disrupting their lives with this project. And it's a little different than a house build where maybe they go over there every three days and check things out. They see what's going on every single day. And so...\r\n\r\n\r\nFrom that standpoint, it's not always easy to, it's easy to build a swimming pool. It's the customer management piece that's a challenge that makes you want to really earn a high multiple when you're doing it.\r\n\r\n\r\nNikolas Hulewsky (45:30.01)\r\nYeah. Where do you think this business is in five years? If today is at 18 million, where do think it is in five?\r\n\r\n\r\nNikolas Hulewsky (45:42.936)\r\nDon't think, don't think, don't think, just say it. Just do it.\r\n\r\n\r\nMalcolm Marshall (45:43.953)\r\nYeah, sorry. Yeah, so I think we're pushing 35 to 40 million.\r\n\r\n\r\nNikolas Hulewsky (45:50.414)\r\nDang, is that all organic or is that through acquisition?\r\n\r\n\r\nMalcolm Marshall (45:54.019)\r\nmost of it will be organic. We are about to add a spa business, which is kind of an acquisition. It's really somebody wants to retire and he's giving it to us because he's that eager to retire. So we'll add the hot tubs. It's not a huge gainer, but there's tons of opportunity down south. Just south of us is.\r\n\r\n\r\nNikolas Hulewsky (45:56.983)\r\nWow.\r\n\r\n\r\nMalcolm Marshall (46:20.133)\r\nAn hour is Austin, so we have all the suburbs north of Austin that are growing very quickly with high income levels, and we are working to push our way into that market more and more. And we also have Waco 40 minutes north of us. And so I think there's some geographic expansion that gets us there, but I think there's opportunity here as well. So I think that we can grow in this central market to\r\n\r\n\r\nNikolas Hulewsky (46:39.139)\r\nGot it.\r\n\r\n\r\nMalcolm Marshall (46:48.915)\r\n25 million and then my goal would be to duplicate that business in each of those other two marks. say duplicate, what I mean is replicate the business, but 50 % down south, 50 % up north. think that we could do that in the next five years.\r\n\r\n\r\nNikolas Hulewsky (46:57.069)\r\nReplicate.\r\n\r\n\r\nNikolas Hulewsky (47:03.554)\r\nYeah. So you feel like you've gotten the sales channels, your customer acquisition channels down, right? Like, okay, we know what we need to do for Google. We know what you need to do for Metta. We know how we go acquire customers. Now let's go. We've nailed it. Now let's go scale it into new markets.\r\n\r\n\r\nMalcolm Marshall (47:19.123)\r\nI don't know if we've dealt it yet, but I do think we're better at it. Yeah. I think we're better at it than most people in our industry, and I do think that it will help fuel growth in other markets.\r\n\r\n\r\nNikolas Hulewsky (47:22.862)\r\nI mean, $18 million a year is, you've nailed something, man. You've nailed something.\r\n\r\n\r\nNikolas Hulewsky (47:34.926)\r\n$18 million top line translates to what bottom line? A million? Two million?\r\n\r\n\r\nMalcolm Marshall (47:40.143)\r\nAbout a million and half. Our even margins are about 8%. Obviously, we're trying to scale that up. I think that we can find ourselves somewhere between 12 and 15%. 15 is the goal. And a lot of that has just grown into the infrastructure that we created.\r\n\r\n\r\nNikolas Hulewsky (47:41.806)\r\nI'm gonna get a half.\r\n\r\n\r\nNikolas Hulewsky (47:47.384)\r\nWow, okay.\r\n\r\n\r\nNikolas Hulewsky (47:59.726)\r\nCool. All right. Here's my last question. You have all the knowledge that you have, but you could go back in time 10 years. You cannot pick this business again. All right. So that's from the get-go. You can't pick pool ology. Obviously you would pick it again because you know so much more. You do so much better anyways. What business that you see or what opportunity that you see right now. Do you would you hop on? What would get you excited about like, man, knowing everything I know now.\r\n\r\n\r\nThis is kind of the space I would be focusing on if I was a first time entrepreneur.\r\n\r\n\r\nMalcolm Marshall (48:36.983)\r\nSo I don't know that all the experience that I have in the pool business really would contribute to this. But if I was starting a business today, I would be focusing on AI infrastructure.\r\n\r\n\r\nAnd when I say that, I mean that there's going to be a massive amount of likely manufacturing. So something that I'm extremely interested in right now is the infrastructure in order to support AI between power, between data centers is massive. And so what a lot of people are looking at for opportunities in AI is how do I automate my business? How do I?\r\n\r\n\r\nNikolas Hulewsky (49:04.462)\r\nMmm.\r\n\r\n\r\nMalcolm Marshall (49:26.727)\r\nhow do I build a tool using AI? But I think that there's as much opportunity or more in how do I help support AI infrastructure that is going to be required to be built over the next 10 years.\r\n\r\n\r\nNikolas Hulewsky (49:39.726)\r\nDude, that is a really, that's a very thoughtful and good answer because I think, I don't remember how many were, I think we're at three terawatt, two or three terawatts in the United States. And in order for us to get to the level of energy production that we would need to get to in order to realize this AI adoption that everyone talks about, we'd have to get, we'd have to at least double. China is going to be at like 10 terawatts in the next few years. So they've leaked frog dust. And in order for us to utilize AI,\r\n\r\n\r\nWe've got to have the power infrastructure necessary to power it. There's already estimates that by the middle of next year, they'll start limiting how much we can use of AI just because these models use so much energy and there's only so much energy to go around. So that is really interesting because there is a huge push and there will be an even bigger push around infrastructure projects to facilitate the creation, the transmission, the storage, the management of power. That's, I like that. That's really cool.\r\n\r\n\r\nThat's a good idea.\r\n\r\n\r\nMalcolm Marshall (50:38.771)\r\nYou know, and pools don't necessarily feed into that, but what I've learned around people, probably primarily people, I'd say that's biggest lesson I've learned in business. If I could go back and change anything, it would be the way that I've built teams and managed people. You know, I think it could set me up for success in anything. you know, I think that, I don't know, I think that that is extremely, extremely interesting opportunity. I think that it's...\r\n\r\n\r\nThere's gonna be a lot of money to be made there.\r\n\r\n\r\nNikolas Hulewsky (51:10.35)\r\nThat's a one. Okay, where can people come find you? Poolology? Where do you hang out? Twitter? LinkedIn? Facebook? Okay.\r\n\r\n\r\nMalcolm Marshall (51:17.219)\r\nYeah, so I don't really hang out anywhere anymore. But you should look the business up. We're heavily focused on content. So you'll find us on Facebook, TikTok, YouTube, Instagram. We post twice, two videos every day. So a lot of new content coming out every day. A lot of it's fun. Some of it is kind of more subject matter expert type content.\r\n\r\n\r\nLots to see there at Poloogy on any of those major social platforms.\r\n\r\n\r\nNikolas Hulewsky (51:52.622)\r\nRight man, well, I appreciate you stopping by Malcolm. This was awesome and can't wait to talk to you again.\r\n\r\n\r\nMalcolm Marshall (51:58.835)\r\nAll right, thanks, Nick. It was fun.\r\n\r\n\r\nNikolas Hulewsky (52:00.11)\r\nOkay, stay on.",
  "metadata": {
    "duration": "",
    "date": "2025-08-22",
    "platform_source": "Google Drive"
  }
}