{
  "episode_number": "176",
  "episode_title": "AI SERIES: 16 - The Non-Coder's Guide to AI App Building with Billy Howell",
  "guest_name": "Billy Howell",
  "business_name": "Stupid Simple Apps, OX Labs",
  "transcript": "﻿Nikolas Hulewsky (00:01.006)\r\nAll right, Billy, you are prolific. I'm excited to have you because you don't have a technical background and yet you're coding and building tools all the time, all with AI. Here's my first question to you that I ask everybody. What is your favorite model and what are you using it for?\r\n\r\n\r\nBilly Howell (00:17.946)\r\nI use OpenAI 4.0 for most stuff right now. When I'm doing a first pass at building out an app or like an integration or something, it usually can get the job done for almost anything and you can even use it for like image recognition right now. So I was building an app the other day to scan, let me see, I can show you, graded trading cards like Pokemon cards, baseball cards.\r\n\r\n\r\nNikolas Hulewsky (00:45.323)\r\nyeah, yeah, yeah.\r\n\r\n\r\nBilly Howell (00:47.186)\r\nAnd I didn't know, I didn't want to do the research on like an image scanning and parsing solution. So I was like, I'll just use ChatGPT for now, put 4.0 in, it's got a 100 % accuracy rate when it comes to identifying these cards and reading off the slab information. So it's really good.\r\n\r\n\r\nNikolas Hulewsky (01:03.502)\r\nWhat are you using it for? Okay, so what is it identifying for you?\r\n\r\n\r\nBilly Howell (01:07.25)\r\nYeah, so I don't have an example at my downstairs desk. Yeah, but they come in from a grading company. You'll encase them in what's called a slab. And there will be a label at the top with like, here's what set it's from, here's what it's called, here's its condition. And so I just needed something to read that, identify the grading company, what the playing card was, what condition it was on a scale of one to 10 based on what the label says.\r\n\r\n\r\nNikolas Hulewsky (01:12.002)\r\nLet's go. mean, you had, okay, so you have this trading card. It's a Pokemon.\r\n\r\n\r\nBilly Howell (01:35.62)\r\nSo really just like reading something in an image and OpenAI turned out to be a good stopgap until I do it the technically correct way using like an image parser that's just code and cheaper,\r\n\r\n\r\nNikolas Hulewsky (01:35.822)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (01:49.942)\r\nOkay, that's awesome. So OpenAI or ChatDBT is kind of your go-to. Do you use any of the other models?\r\n\r\n\r\nBilly Howell (01:58.822)\r\nI use 3.0 sometimes in my local chat GPT, but I'm not really sure why.\r\n\r\n\r\nNikolas Hulewsky (02:02.606)\r\nOkay, it's, but it's all chat TPT. You're not using like Claude, you're not using Gemini or Gra-\r\n\r\n\r\nBilly Howell (02:06.613)\r\nother models, other models. I have right now, I don't have a good workflow. When you're developing apps, usually I do some model shopping to see which one works best. But I'm behind on testing out Gemini and Claude. I downloaded Claude on my phone yesterday for some coding stuff, visualizing some HTML. I wanted to make a chart for myself for golfing, because I play golf and like...\r\n\r\n\r\nI want to remember like here's how you had to draw, here's how you had to cut, all that. So GPT made me a chart, but it didn't look good visualized. So I said, all right, do it with code. And I couldn't get it to show me the code rendered in my phone, but Cloud was able to. So that was a really cool thing Cloud could do.\r\n\r\n\r\nNikolas Hulewsky (02:36.814)\r\nYeah, yeah,\r\n\r\n\r\nNikolas Hulewsky (02:50.082)\r\nYeah, Claude does some really good visualization. Is there any that you hate? Any of the models that you hate?\r\n\r\n\r\nBilly Howell (02:56.047)\r\nNo, I don't think so.\r\n\r\n\r\nNikolas Hulewsky (02:57.89)\r\nNo, okay. What was your background before this? Cause you're like, you're non-technical, but you are obviously kind of, you've gotten yourself to a level where you're understanding some of the technical stuff. But what were you doing before you got into vibe coding?\r\n\r\n\r\nBilly Howell (03:10.171)\r\nGeneral Management Consulting with the DOD.\r\n\r\n\r\nNikolas Hulewsky (03:13.233)\r\nI just fell asleep. What was that? Jeez.\r\n\r\n\r\nBilly Howell (03:16.695)\r\nI was in government accounting compliance. Yeah, it sounds like the, like literally like the movie Office Space. It's like my favorite movie and it was just like that, like the TPS reports.\r\n\r\n\r\nNikolas Hulewsky (03:20.578)\r\nNo way.\r\n\r\n\r\nNikolas Hulewsky (03:29.454)\r\nCan get those TPS reports on my desk by Friday? How long were you there?\r\n\r\n\r\nBilly Howell (03:30.789)\r\nYeah. Yeah.\r\n\r\n\r\nBilly Howell (03:34.994)\r\nthree years out of college. And then I kept kind of accidentally starting businesses. So I quit in 2021, kind of wandered and did a bunch of different things and did crypto trading for a while. But, you know, hard to build stuff that lasts there and feel like you don't really learn anything. And then I kind of just started doing some freelance work and that turned into my agency, OX Labs to do marketing. And so I've been doing, I'm still running that.\r\n\r\n\r\nNikolas Hulewsky (03:49.486)\r\nOf course, who hasn't?\r\n\r\n\r\nBilly Howell (04:05.201)\r\nAnd that kind of led into me building a lot of internal tools for startup clients using AI, right? So to start, I would be just trying to automate something and Google Sheets for them and pasting a bunch of code into Chat GPT saying, fix this, then putting it into like Google Sheets, Google Apps scripts, and then testing it. So like really caveman debugging.\r\n\r\n\r\nAnd then cursor came along and I was like, whoa, this is like zero to one. Like I can really build stuff in here. And then I had found replica like four or five months ago and it just like turned me into a sicko. Like just making apps, just staying up all night. Like I got to make this app idea. And so I haven't like released or published a ton of them, but I've probably, I probably, I think I built like 40 or 50 before I ever sold one just cause\r\n\r\n\r\nNikolas Hulewsky (04:57.07)\r\nCheers.\r\n\r\n\r\nBilly Howell (04:59.299)\r\nIt's just so fascinating to me and I have all these ideas that I can visualize and then I would make one and be like, but what if I did it another way? All right, let's start over, right? So a lot of people kind of ask me like, you know, what's the best way to learn all this? And it's kind of difficult to replicate that struggling with chat GPT, then the next step up cursor, then the next step up replet because most people want to start right at like replet or lovable, you know, which you can cause they're like so good, but that was kind of my path.\r\n\r\n\r\nNikolas Hulewsky (05:28.302)\r\nSo what's the agency you have? Tell me it's a marketing agency.\r\n\r\n\r\nBilly Howell (05:31.387)\r\nSo my marketing agency is OX Labs, O-W-E-X Labs, and we do ICO and newsletter marketing for startups, but then my app agency is Stupid Simple Apps, and I was kind of born out of me selling some apps on Upwork and then making videos about it, and now I just have so many inbound calls that I was like, I gotta get a team, so now I've got a team of, yeah.\r\n\r\n\r\nNikolas Hulewsky (05:53.272)\r\nWell, what I think is interesting is that like, my natural inclination with a lot of this stuff was like, I don't want to take time to learn it because it's just going to change or like, AI is just going to figure it out. But what I'm starting to realize more and more is that specifically the models that we have right now are really good at synthesizing past data, but they're not good at is coming up with novel ideas, new ideas, right? And so you still need the human element of like,\r\n\r\n\r\nBilly Howell (06:17.841)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (06:23.246)\r\nfly in here of like, okay, cool, I've done all this learning, now I'm gonna put the pieces together and you're using the tools to accelerate you as a developer, as a coder, as a manager, whatever it is, but they're not necessarily coming up with the idea, you're still coming up with the idea and then utilizing those tools.\r\n\r\n\r\nBilly Howell (06:39.525)\r\nYeah, exactly. And any kind of industry or niche knowledge that you have can really help you. if you're building, and I was just talking to a guy who needs customized CRM for nonprofits, and just understanding how that industry works gives you an advantage over an AI right off the bat, and maybe a developer that's not familiar with the industry. So you'll know the ins and outs.\r\n\r\n\r\nI guess what I'm saying is like, if you have a niche, like you can make a useful app with AI better than someone else who doesn't know your industry.\r\n\r\n\r\nNikolas Hulewsky (07:16.76)\r\nSo you were using Cursor, but then you went to Replet, which is interesting because a lot of coders that I know are always like, Replet? Cursor is so much better. They just love Cursor. I'm on Lovable, which I'm like, cool. I know how to do Lovable. I'd bet it's similar to Replet, but obviously a little bit different. Why didn't you stay on Cursor? Why did you go to Replet?\r\n\r\n\r\nBilly Howell (07:31.056)\r\nYeah.\r\n\r\n\r\nYeah.\r\n\r\n\r\nBilly Howell (07:40.946)\r\nI still love cursor and I know some of those guys so I like that team. I'm not going to say anything bad about them. And I still do use cursor sometimes to debug locally. Right now I also use windsurf to debug stuff locally. So they're different tools, Like, replit is kind of like a prototyping tool. I can get from idea to something usable and demoable very quickly in like minutes. And in cursor it's a little slower because you got to think about packages and use the terminal and this and that.\r\n\r\n\r\nI don't the Composer tool I didn't really like for scaffolding apps, like at the time I was using it for that. So for me, it's more of a like, if something like Replet or Lovable is reaching like its bandwidth, like of how smart its brain is, Cursor or Windsurf can kind of troubleshoot that. I think they're a little smarter and precise for like very precise problems. Probably just cause it's running locally, right? And not in the cloud. But then, yeah, sorry.\r\n\r\n\r\nNikolas Hulewsky (08:34.19)\r\nFor a lot of people who are listening, they're like, I'm not a developer, I'm never gonna develop an app, this is over my head. Here's my question to you though, what's your response to them? They're small business owner and they're like, man, Billy knows all of this stuff, I'm never gonna use this stuff to actually build an app. How do you think about building these apps? How do you come up with the idea? How do you kind of identify what might be a good use case for these?\r\n\r\n\r\nBilly Howell (08:39.333)\r\nYeah, yeah, yeah, yeah, yeah.\r\n\r\n\r\nBilly Howell (08:46.833)\r\ntoo.\r\n\r\n\r\nBilly Howell (08:53.819)\r\nYeah.\r\n\r\n\r\nBilly Howell (09:01.041)\r\nSure, well, my whole thing is like I don't, now that I have like an agency and I've built all these apps for myself, like I don't build stuff unless it's paid for. So I try to sell B2B apps, so I try to have people who come to me, people come to me with interesting problems and then we figure out how to build it. If you're a business owner though and you're kind of intimidated, like I think you could make something useful for your business in Replit or Lovable like very easily. I'm training a guy who,\r\n\r\n\r\nowns a hair care products, econ business, and he's opening a barber shop and he's like, I want my own serum for my barber shop and I want to grow it and then in five years, know, how other barbers pay me to use my platform. And I kind of thought he was crazy, but he's kind of just like done some strategy calls with me and I'm like call three and I'm like, this guy's gonna do it. He's just kind of hacking away at Replet. And he's just asking me like, hey, what should I do here? Okay, great. And so\r\n\r\n\r\nYou know, people who are biased towards action, like a lot of small business owners, if you're biased towards action and, you know, making decisions and not, well, should I use cursor or Windsor for, should I use this or that? Like, I think you have a tremendous leverage with these tools.\r\n\r\n\r\nNikolas Hulewsky (10:12.782)\r\nHere's kind of a framework that I've been thinking about tell me how you think of this I think if you're a small business owner and You have a prompt You can turn that into an app. You can create a wrapper. Here's an example I have a friend of mine who called me today and he was like, hey, I I do a lot of flips I flip houses and What I really want to do is I fired my interior designer and I want to build an app That would allow me to just say here's a picture of the space\r\n\r\n\r\ngive me some recommendations, and then once I decide on the recommendations, it then spits out a price list for me. Like, could I do that? But I don't have any coding skills, and I was like, yeah, you could easily do that. That's a prompt. You're literally just building a wrapper around OpenAI, and it's the same prompt that you would do when you go into OpenAI and ask the question to ChatGPT, except you go to Lovable and you actually build an interface. And now that becomes an app, and it's something replicable that you can do.\r\n\r\n\r\nover time and you could even sell it to other people who want to do stuff like that. So in my mind, it's like, if you have a prompt, you can build a wrapper. That doesn't mean that you're necessarily building a complex software, but you can at least build an app. What do think of that?\r\n\r\n\r\nBilly Howell (11:08.091)\r\nYeah.\r\n\r\n\r\nBilly Howell (11:19.963)\r\nI think that's completely true. I know someone who built an automation like this for like a moving company and he scaffolded it out in I think in 8n or make.com. So if you're intimidated by doing code, start out in like make.com or any and you can visually drag out. You're basically just connecting like authentication to like your database. Like if you're using Google Sheets to store data, you would log in through Google and then you connect it to an API. So like there's probably an API.\r\n\r\n\r\nNikolas Hulewsky (11:26.451)\r\nreally?\r\n\r\n\r\nBilly Howell (11:50.108)\r\nto let you use that vision, like the image vision for OpenAI. And that's how he built it. And he was able to just build something that they still use to quote how much would it cost to move everything in this house. Homeowner just walks around, takes pictures and sends it to them and the AI can synthesize. Yeah. So, I don't know. That's a good question. But like, if you wanted to do it again, he could do it in like four hours. It's just learning the first time, right?\r\n\r\n\r\nNikolas Hulewsky (12:05.902)\r\nThat's amazing. How long did it take him to build out?\r\n\r\n\r\nNikolas Hulewsky (12:16.578)\r\nYeah, because it's not complicated.\r\n\r\n\r\nBilly Howell (12:18.405)\r\nNo, and doing, I think it's a good exercise to lay stuff out in an automation tool for business owners. If you're not familiar with programming or just like what the app logic should be, you'll be like, okay, like I need to drag in Google Sheets. Like, okay, now we need OpenAI. It's a very useful way to kind of V1 your app and you can just interact with it through like, like I said, like Google Sheets or sending it an email or something.\r\n\r\n\r\nNikolas Hulewsky (12:41.55)\r\nWell, dude, the other thing that it does is it helps them map their process. Because a lot of these small businesses, don't even map it. They're like, well, first Jimmy goes here and then Johnny goes here. And then they call here and then it gets sent to this person. And that's the reason they don't scale is because they don't have processes that they can actually replicate. But in creating the automations, you create the processes. That's an amazing benefit to it as well.\r\n\r\n\r\nBilly Howell (12:45.487)\r\nYeah, exactly.\r\n\r\n\r\nBilly Howell (13:02.587)\r\nYeah, and the other benefit is in something like a make.com or N8n, it again biases you towards action because you may not even know a solution exists, but if you search around in like the integrations in either of those, you'll find something you didn't know about, which is harder if you're looking at a blank code repository and you're like, okay, does something exist to automate calling? Does something exist, like let me go research the best one.\r\n\r\n\r\nNo, if you're in make.com or N8N, you're just gonna use whatever one they tell you to and it's gonna move you towards your goal faster. So I think it's a really good starting point if you just know nothing.\r\n\r\n\r\nNikolas Hulewsky (13:39.0)\r\nWell, I've talked to many business owners who are like, I want to use this in my business. And they might, they might use it locally, like chat GPT locally on their computer. But then they're like, yeah, I told all my employees to use chat GPT as well. and I asked them like, well, how are they logging in? well, they're using their email. Like it's their personal email. Maybe it's their work email. They don't have a tight system in place that actually protects the data. And that's why I'm like, okay, go to flow wise or go to lovable or go to replet, whatever it is.\r\n\r\n\r\nNow you build a wrapper, your employee can just use that wrapper. And they're now using ChatGPT, but they're using it on top of a wrapper, and you've now controlled the environment as opposed to them just logging in in their own whatever, their own personal use.\r\n\r\n\r\nBilly Howell (14:24.276)\r\nthat's smart. It kinda... Cause that is almost trivial to knock out and could protect you against data spillage.\r\n\r\n\r\nNikolas Hulewsky (14:30.508)\r\nRight. It's very, and not only that, now you are starting to track what questions they're asking. You can now be like, yeah.\r\n\r\n\r\nBilly Howell (14:37.221)\r\nYep. How do I murder my boss? What if they ask that?\r\n\r\n\r\nNikolas Hulewsky (14:44.43)\r\nWell, I mean, how many times do you ask employees, I don't know what your management experience was like at the DOD, but you ask employees, you're like, hey, what's the hardest part of your job? And they're like, uh, most of the time they'll pick one thing, but like the second and third order things they're not as quick at, you can just go and look at, what websites are they visiting the most? What questions are they asking over and over? then all of a sudden you have kind of the solution to that.\r\n\r\n\r\nBilly Howell (15:00.559)\r\nYep. Yep. Smart. Smart.\r\n\r\n\r\nThis is an agency on its own. Just setting this up for small businesses, You know, I go say, hey, we'll set you up your own chat GPT, your employees won't have to pay for licenses, and you'll get to see what they're asking so you can identify problems. It's an agency, easy, I should do this.\r\n\r\n\r\nNikolas Hulewsky (15:09.784)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (15:13.102)\r\nThat's a great idea.\r\n\r\n\r\nNikolas Hulewsky (15:24.984)\r\nNo, no, no, no, no,\r\n\r\n\r\nBilly Howell (15:34.735)\r\nReplayed in OpenAI. I mean, I would use React for the interface.\r\n\r\n\r\nNikolas Hulewsky (15:38.795)\r\nSo tell me, I don't know what React is, tell me what React is.\r\n\r\n\r\nBilly Howell (15:41.091)\r\nIt's JavaScript, it's what most people use. I think Zuckerberg or Facebook invented it and most web applications are built on it.\r\n\r\n\r\nNikolas Hulewsky (15:50.35)\r\nCause if I go to Replo or Lovable, I could build something out right now. Why do I need React?\r\n\r\n\r\nBilly Howell (15:52.262)\r\nYeah.\r\n\r\n\r\nBilly Howell (15:55.698)\r\nYeah, it probably uses, well, probably uses React. Oh, you're just asking, I thought you were asking like, I'm answering a nerdy question than you're asking. No.\r\n\r\n\r\nNikolas Hulewsky (16:03.904)\r\nI'm asking a really stupid question and you're like, this guy must be smarter than he actually is. He must be asking about this. No, I'm asking like, what color is the best crayon? Yeah. Okay.\r\n\r\n\r\nBilly Howell (16:08.337)\r\nYeah, yeah.\r\n\r\n\r\nBilly Howell (16:14.371)\r\nI would use Replet and I would use OpenAI or Claude or let the user kind of switch out which one they want to use.\r\n\r\n\r\nNikolas Hulewsky (16:23.138)\r\nSo,\r\n\r\n\r\nBilly Howell (16:23.921)\r\nAnd then it's like, I mean, you could even find people, businesses in there, like, are your employees using chat GPT? Like, are you paying for it? Like, you don't have to pay $20 an employee or whatever, you could just use your key and based on usage, right?\r\n\r\n\r\nNikolas Hulewsky (16:38.114)\r\nWell, and that's the other thing is many large companies, my brother-in-law has a healthcare company, $500 million healthcare company, they've got the Google, not the Google suite, the Microsoft suite rolled out and so they're using Copilot. And I think there's a native chat GPT, so they don't have to log in to their individual accounts. But that's if you have like this corporate level software solution that's rolled out, right? But these smaller businesses, they don't have that. They're just like piecemealing it together.\r\n\r\n\r\nBilly Howell (17:04.145)\r\nWell yeah, and you could put in like your mission statement, your docs, your SOPs, stuff about, all your company policies, right? So you could have like an HR bot too.\r\n\r\n\r\nNikolas Hulewsky (17:14.414)\r\nThat's a really good, yeah. Yeah, because I've always, I do think that's a really, really good use case, onboarding and orientation. Because what happens now in most of those companies is like one person sitting next to them and they're just learning from that person all day. But if you can actually offload a lot of that information and then they've got the chat bot that they're learning from all day, then that other person is freed up to actually do more work as opposed to just sit next and train somebody.\r\n\r\n\r\nBilly Howell (17:39.922)\r\nYeah, yeah, I like that. And I know for the people watching this that are like, this already exists, it's a solution. I don't care. You could go sell this to companies. Do you think most blue collar companies know about whatever, you know, software there is to install your own chat bot? They don't want to do it on their own, right? Like they want white glove consulting. And I mean, that's where there's always money to be made is installing stuff for\r\n\r\n\r\nbusy founders, busy CEOs, business owners who they may know that there's a way to do something themselves but they want to pay for someone to do it because it's not worth their time. Like I don't want to go down eight hour long rabbit holes installing like little tools. I don't have to pay someone to do it for me. I think just think I would switch switch mentalities because a lot of people think like that.\r\n\r\n\r\nNikolas Hulewsky (18:26.862)\r\nWell, dude, think about it. you're any company and you've rolled out a CRM, if you're using Jobber, if you're using HubSpot or Salesforce, any of these, you're probably using 5 % of all of the functionality of that CRM. Very few companies are using more than 20 % of the functionality. So it's like one or two things that you really need. And now with AI, you can build that software for somebody so cheaply that you don't need to sell them that.\r\n\r\n\r\ncustom enterprise level solution, you can go and just be like, hey, how does this work? that's your process? Cool, I could build that for you. And you just have to charge me this and this is the ongoing maintenance fee. It's literally just sales at this point and the backend fulfillment is so much simpler and you don't need all the bells and whistles because they're not gonna use them anyways.\r\n\r\n\r\nBilly Howell (19:12.369)\r\nYeah. It's great. I mean, I was talking to a guy the other day that was like, and he had paid to do like a strategy call on how to build this app and he works for a real estate firm and he was like, Hey, I'm building this in replica. It's a CRM for managing like our properties and comparing them to other ones on the market. and he was like, is this too easy? Like, am I missing something? Cause I've gotten like 80 % of the way there and I know nothing about coding. And I was like,\r\n\r\n\r\nNikolas Hulewsky (19:37.422)\r\nYou\r\n\r\n\r\nBilly Howell (19:39.634)\r\nNo, mean, like I said, that final like 20 % is what you would hire like someone like my agency to do, right? All the stuff to make it robust and like enterprise level. But for testing out with your team of five people, you could go ahead with this. And he said, great, because like we don't use all the functionality in Salesforce and we want to replace it. And I said, oh really? Like how much do you pay? Like he said, they pay $200,000 a year for their Salesforce seats.\r\n\r\n\r\nand this app that he's building could make it redundant and he could go sell it to other companies after. 200 grand. 200 grand to look at what properties do we own? How much are they worth? What do other ones on the market look like?\r\n\r\n\r\nNikolas Hulewsky (20:11.828)\r\nmy gosh, that's insane.\r\n\r\n\r\nNikolas Hulewsky (20:22.488)\r\nSo do you know what a GPO is? It's a group purchasing organization. So many times when you're a small company, you don't get the same pricing power as Walmart, right? Walmart, they're huge, they're behemoth. They can get the cheapest prices because they're so big, they have such large buying power. I think that companies like Salesforce are gonna turn into GPOs for processing power.\r\n\r\n\r\nBilly Howell (20:24.517)\r\nUh-uh.\r\n\r\n\r\nBilly Howell (20:38.17)\r\nhuh.\r\n\r\n\r\nNikolas Hulewsky (20:47.842)\r\nBecause at some point, people don't need Salesforce anymore, but what they will need is like the Salesforce network of people who have been on Salesforce. Salesforce is gonna be able to negotiate the processing power for them down from 10 cents a token to one cent a token. So it's like, okay, cool, I'll join the Salesforce network. I don't think that the iteration of Salesforce that we see today will be the Salesforce like company in 10 years from now.\r\n\r\n\r\nBilly Howell (21:12.209)\r\nYeah, I totally agree. And everything that charges by seat that has an API is gonna get burned. I did one for a client where they need data visualized in a way in HubSpot that HubSpot can't do, so I made them a dashboard. Big media company, big opportunity to do it for some other companies. But anyways, while I was in there, I was like, hey, you guys are paying $250 a seat per month.\r\n\r\n\r\nper employee, you got a lot of employees. I have access to all your data and I can put it in a dashboard and we can modify the data. Couldn't I just make all of these seats redundant and have them interact with HubSpot in your own dashboard for the people who are doing just simple data entry? So we're kind of exploring that, but I think yeah, the rules are APIs and seats and billing are all gonna change at these SaaS companies.\r\n\r\n\r\nNikolas Hulewsky (22:07.0)\r\nDude, it's incredible. All right, here's my last question for you. I've built a number of these apps. Chris has built a number of these apps. And what we've noticed is like, like you said, we can get them to the 80 % and then it's like, we kind of get to a place where we're stuck, where it's not exactly doing what we want it to do because the AI just takes liberty with what they decide to do and not decide to do. If I don't like the color scheme or if I don't like the way it wrote something or if I don't like the...\r\n\r\n\r\nI don't know, formatting of the website. I'll be like, I don't like it this here. And then it'll spit something back out. And it's like, change that, but then something else has changed and it causes a whole bunch of issues. So how do small businesses or people like me who are like, oh, I'm building these apps and I get to that spot. How do they end up finishing it? Cause it's that last like 20 % that's difficult.\r\n\r\n\r\nBilly Howell (22:43.503)\r\nYeah.\r\n\r\n\r\nBilly Howell (22:56.777)\r\nOne, you have to be disciplined about rolling stuff back that doesn't work so that you're not just piling up junk code on top of junk code. So if you tell the AI agent in Loveable or Replet or wherever to do a new feature or debug something and then they do it and it doesn't work, if it's like the same as before or something else is broken, roll that code back. Don't try to fix the bad code. You have to be diligent about that and it'll save you so many headaches down the line because\r\n\r\n\r\nNikolas Hulewsky (23:24.782)\r\ninteresting.\r\n\r\n\r\nBilly Howell (23:24.815)\r\nWhen I started, I would look at my files and it would be like 3,000 lines long and I would be like, this isn't a complex app, why is this? And I realized it's because the agent was just writing new code, then writing code to fix the old code, then writing code to make both of those work together. it's just, being diligent about rolling back bad code.\r\n\r\n\r\nNikolas Hulewsky (23:41.646)\r\nSo tell me, what do you do at that point? Do you tell the AI, you're like, all right, cool, get rid of this? Or do you have to go back and, I don't know, copy and paste? How exactly do you?\r\n\r\n\r\nBilly Howell (23:53.262)\r\nIn cursor, Winsurf, Replet, and I would think lovable, there's like a rollback button that's essentially using Git. So it's just, if you were coding locally, you would use this thing called Git to manage all your files. And you would say like, go back to the last time I saved my data, like in a video game. So you're basically doing that.\r\n\r\n\r\nNikolas Hulewsky (23:57.43)\r\nIt is.\r\n\r\n\r\nNikolas Hulewsky (24:13.144)\r\nHmm. So even if I've iterated to the point where I fixed the code, right? Let's say it's like, it took me five iterations to finally fix it. I've built up probably a bunch of dead code in there that I don't need. How then do I get rid of that? Like, let's say that I went through and I've\r\n\r\n\r\nBilly Howell (24:29.029)\r\nTechnical debt,\r\n\r\n\r\nSo, okay, so here's what would happen, like, what you're describing. I've got a problem, I don't know how to solve it. It takes me five prompts, then we solve it. Now I know how to solve the problem, I'm gonna roll it back to that initial checkpoint, tell them how to solve it the right way so that we don't have five prompts of bad code. It's habits like that that save you time down the line. And then just from the start, planning your app to be, I'm sorry, I interrupted.\r\n\r\n\r\nNikolas Hulewsky (24:47.118)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (24:53.4)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (25:00.28)\r\nNo, no, no, no, keep going.\r\n\r\n\r\nBilly Howell (25:01.945)\r\nIt's just planning at the beginning. I'm going to make my app so stupid simple that like it's not going to be complex at the end. Like this is we truly only need like these two features and this one integration. So really paring it down because you don't need a lot of complexity and to get the job done.\r\n\r\n\r\nNikolas Hulewsky (25:19.736)\r\nYou don't need a lot of complexity. think that's where people, even like myself, have this misconception where you're like, I'm building an app. Ooh, that must be really complex because the companies I've heard about have to raise hundreds of millions of dollars and it takes them years to roll out. no, no, no. The apps we're talking about are, hey, anytime someone goes to my website, I want it to run to a Google Sheet that then I pull and then gets automatically entered into my CRM. And you can now do that.\r\n\r\n\r\nwith AI and you could do that with a lovable interface. That does not require the new sales force. It just requires sort of a wrapper, if you will, that you're utilizing AI for. So it's like this mind shift, like you were saying. It's not complicated. We've got like two databases that we need to connect. How do we make sure they connect?\r\n\r\n\r\nBilly Howell (26:07.727)\r\nAnd then the other thing I would tell people is if you are, so everyone always needs a custom CRM for their business. People are tempted to fill that up with lots of different use cases. like for example, I don't know, if a moving company needs that quoting app, I said, but they also want that chat GPT internal app, they may be tempted to put that all into one house, one CRM.\r\n\r\n\r\nDo not start there, build both of them separately and get the stakeholders to use it and give you feedback to find out is it worth building this, investing in it, and then two, what's the right way to do it. And then once you got a good idea, people have used it and you've got feedback, then maybe you can, in a new AI agent, combine them into one app, but you don't need to mix those complexities from the start. It's gonna be okay if people on your team have to click to two different links to test something.\r\n\r\n\r\nNikolas Hulewsky (26:55.022)\r\nMmm.\r\n\r\n\r\nBilly Howell (27:03.673)\r\nAnd in fact, I even think that's a better approach to start so people don't get paralyzed when they go into your CRM. Like, should I use this or should I use this? They have to think, I want to do this task, I'm going to pick this tool, right?\r\n\r\n\r\nNikolas Hulewsky (27:16.526)\r\nOkay, so someone's gonna code or build their own app. Replet, ChatTPT, OpenAI. Is there anything else, any other tool that you're like, hey, this is the other tool, two or three tools that I would use if you're starting out.\r\n\r\n\r\nBilly Howell (27:29.327)\r\nYeah.\r\n\r\n\r\nI like v0 to make nice looking UIs. Versel owns it. just v0.dev.\r\n\r\n\r\nNikolas Hulewsky (27:34.904)\r\nWhat's that? V's zero?\r\n\r\n\r\nNikolas Hulewsky (27:43.394)\r\nnever even heard of that. All v0.dev.\r\n\r\n\r\nBilly Howell (27:45.788)\r\nThey make really clean layouts and I think they do better than most other ones. Although, Levelable does a pretty good job, but they use this cool component library that I like. So I will sometimes use that and then grab the UI. It used to be only UI. Now they can build full apps like any other platform, but I'll grab a page, throw it into Repliter cursor and say, hey, I really like this. Can we use this for our interface and they'll integrate it.\r\n\r\n\r\nSo yeah, V0 for prototyping, visually, Replet for prototyping, how the app works and looks, that's kind of the all in one solution. And then if you need to code locally and really troubleshoot something, try Cursor, Windsurf. Even just ChatGPT, the desktop app is really good for troubleshooting code. And I know the Claude stans are probably going to say Claude's better for this. It probably is, I'm just used to doing it in ChatGPT.\r\n\r\n\r\nSo like chat GPT, they're always gonna have the best, latest and greatest models and integration. So it's always gonna be really useful for debugging code.\r\n\r\n\r\nNikolas Hulewsky (28:50.35)\r\nYeah, I'm looking at V0 right now.\r\n\r\n\r\nBilly Howell (28:51.247)\r\nOr Claude too. go, if you go, my point is if you go right to the agent where it's coming from, they're probably using the latest and greatest compared to like whatever API cursor is connecting to.\r\n\r\n\r\nNikolas Hulewsky (29:02.382)\r\nWell, dude, mean, like I think about all this stuff the same way that I think about people who are like, I want to lose weight. Should I do the, should I do the keto diet or the carnivore diet or should I do, I don't know, intermittent fasting? Should I do a strength training? Should I? It's like, yeah, do a bunch of research, go, go look it up. But here's the main thing. Eat less than you're eating right now and do more exercise. It's like, that's it. Right? So all these tools get you there.\r\n\r\n\r\nBilly Howell (29:16.881)\r\nthen you tell them to go research, right? Do a bunch of reading before they start, right?\r\n\r\n\r\nBilly Howell (29:27.291)\r\nYeah, exactly.\r\n\r\n\r\nSick.\r\n\r\n\r\nNikolas Hulewsky (29:32.024)\r\nYou're going to work your way through them, but go use them. So hey, if you want to build something, cool. Find an LLM and then find a tool that's actually going to build the code for you. Totally agree. I totally agree.\r\n\r\n\r\nBilly Howell (29:40.239)\r\nYeah, you gotta stop trying to optimize everything. Do stuff that doesn't scale. You should run towards stuff that doesn't scale. That's my last thing. Run towards things that don't scale.\r\n\r\n\r\nNikolas Hulewsky (29:49.538)\r\nRun towards things that don't scale. I haven't heard that before. It's not move fast and break things. It's run towards things that don't scale. I like it.\r\n\r\n\r\nBilly Howell (29:53.381)\r\nYeah, made it up. I don't know.\r\n\r\n\r\nBilly Howell (29:58.117)\r\nYou should, it's directionally the right way to go every time in my experience.\r\n\r\n\r\nNikolas Hulewsky (30:04.056)\r\nTell me, where's the best place for people to come find you?\r\n\r\n\r\nBilly Howell (30:06.757)\r\nBilly J Howell on Twitter. Same thing on YouTube. I don't know. I'm in Arlington, Virginia. If you ever want to play golf or shoot hoops, can find me here.\r\n\r\n\r\nNikolas Hulewsky (30:18.19)\r\nAnd if you've got apps that are 80 % of the way done, we call you.\r\n\r\n\r\nBilly Howell (30:21.337)\r\nYeah, yeah, stupid simple apps with hyphens in between dot com. You can book a call with us and we'll get you a quote on building your app. We'll do it for you. And then also like you could pay me. There's a Calendly on my Twitter. If you just want me to sit down with you and be like, is this possible? What's the best way of building this? Like, can you debug this for me? I love doing those calls. I've done so many of those. There's a huge demand for that.\r\n\r\n\r\nNikolas Hulewsky (30:43.214)\r\nThat's right, All right, this was awesome. Thank you, Billy. Stay on for a second. Let's let this upload.\r\n\r\n\r\nBilly Howell (30:45.744)\r\nThank you, Nick.",
  "metadata": {
    "duration": "",
    "date": "2025-05-22",
    "platform_source": "Google Drive"
  }
}