{
  "episode_number": "202",
  "episode_title": "AI SERIES: 18 - Why Directories Are the New Gold Rush in Lead Generation with David Jaeger",
  "guest_name": "David Jaeger",
  "business_name": "Therapy Practice, ABA Directory",
  "transcript": "﻿Nikolas Hulewsky (00:00.076)\r\nYeah, okay. David Yeager, super excited to talk to you. Entrepreneur, digital agency, you're in healthcare. You have you and your wife own a practice for mental healthcare, but something caught my eye the other day on Twitter that I just had to talk to you about. So I'm going go to your, let's.\r\n\r\n\r\nYou posted this and you said, directories already killed lead gen agencies. They just don't know it yet. Directories have driven $5 million plus to one of my businesses alone. That's freaking mind blowing. Cause everybody's talking about directories right now and like, anybody could throw up a directory, blah, blah. But I haven't seen the like second half of it, which is how do you monetize it? And so when I saw that you said directories have already driven $5 million to one of my businesses, I knew I had to talk to you. And then,\r\n\r\n\r\nAnd then you go on to finish the post with like a comparison of agencies and directories. So an agency, you have to convince one client at a time to pay you $5,000 a month. A directory of 12,000 businesses fighting to claim their profile. An agency you beg for attention, directory, they beg you for rankings. An agency, hey, we'll get you leads. Directory, pay us or your competitor will. The game has changed, most are playing checkers still. So that was your post.\r\n\r\n\r\nBut I, so like, I have to ask you, are they really dead or is this just for social media?\r\n\r\n\r\nDavid Jaeger (01:27.042)\r\nNo, I think that being in the agency world and quite frankly not enjoying it. I've been on a journey of it. You're commoditized and it's only going to get worse with AI. It's the ability to knock out so much. Really, really not, you know, for the right agencies, it'll turn them into superpowers and we definitely have superpowers. But at the end of the day, that value prop is lessened.\r\n\r\n\r\nyou wouldn't be just drop AI into any entry level person with processes and or even without the person behind the wheel and all of a sudden like the stuff gets done.\r\n\r\n\r\nNikolas Hulewsky (02:09.88)\r\nSo let's level set this for people who are listening. I think most people have seen like, you could spin up a directory. And I think most people know, an agency is a business that anybody could spin up. So we have these two things, directories and agencies. Can we just define really quickly, what do we mean when we talk about directory and what do we mean when we talk about lead gen agency?\r\n\r\n\r\nDavid Jaeger (02:31.484)\r\nSure, so there are many different types of marketing agencies, different models, but any of those, for the most part, most of those models are commoditized. It's very, very, whether you're paid on performance, whether you're selling SEO or you're selling Google Ads, which I do, Facebook Ads also do, website design development, these are all very...\r\n\r\n\r\nThose are all agents. That's what I would call agencies. And even lead gen agencies, I sell leads on performance in some verticals. And that also, it's a very challenging environment. Again, if you're successful, you can be wildly successful. And there are very many wildly successful people.\r\n\r\n\r\nBut the challenge, think, is, yeah, so that's the agency side. The directory side is basically owning your own brand and being able to create your own. It takes a tech environment. You could just, hey, I'm going to get a directory and find one of these off-the-shelf softwares and build something. And I've done that before. I've never really been able to turn it into a brand, and I never really loved it.\r\n\r\n\r\nNikolas Hulewsky (03:17.709)\r\nOkay.\r\n\r\n\r\nDavid Jaeger (03:42.992)\r\nbecause it was just really hard to build and it didn't feel like I was adding value. Now with the AI side, I'm seeing a massive opportunity with using that to build your own brand that you own.\r\n\r\n\r\nNikolas Hulewsky (03:58.083)\r\nSo, okay, so help me, help me understand. And my understanding of directories is like, you say, pickleball courts. I'm going to create a directory of pickleball courts. And it's like Yelp meets Craigslist where, okay, here are different businesses that offer pickleball courts. You can go and search, you'll find it and it'll be geo-fenced, yada, yada, yada. And then the agencies I understand, cause that's a business. I outsource my marketing essentially to an agency and the agency goes and then generates leads for me. And hopefully I get business. Both of those can produce,\r\n\r\n\r\nbusiness results, but I'm having a hard time like understand like why have directories killed Legion agencies? Are you saying like every company should have their own directory?\r\n\r\n\r\nDavid Jaeger (04:37.542)\r\nI'm so what I'm saying is that an agency is a rat race. It's only until you're the next cool thing only until the next space and there's downward marketing pressure on the AI side. Whereas directories you own the brand and if you have any vertical where there are directories that are adding a massive amount of traffic or value they just they kill it. There are so many different models and at the end of the day they own the brand they own the customer and\r\n\r\n\r\nwhen they own the customer, they're never going away.\r\n\r\n\r\nNikolas Hulewsky (05:11.886)\r\nOkay, so this company that you said, one of my businesses.\r\n\r\n\r\nDavid Jaeger (05:12.434)\r\nAnd that's where agency is. I'm sorry?\r\n\r\n\r\nNikolas Hulewsky (05:17.114)\r\nWhat did you, so in the post you said, one of my businesses has already driven $5 million alone from a directory. You may not be able to share because this might be a client of yours, but can you give me in this example?\r\n\r\n\r\nDavid Jaeger (05:26.77)\r\nhappy to share.\r\n\r\n\r\nAbsolutely.\r\n\r\n\r\nNikolas Hulewsky (05:31.725)\r\nSee you again.\r\n\r\n\r\nDavid Jaeger (05:32.708)\r\nYeah, I'm sorry. think we we are having some like there's absolutely I'd love to share it. I'm clear to basically the we run a psychotherapy practice and 90 of our leads come from one directory. I have my mic. My seo is garbage my my like relationships with payers like not really there like there's it's literally one a one thing and we've I we've\r\n\r\n\r\nNikolas Hulewsky (05:34.285)\r\nYeah.\r\n\r\n\r\nDavid Jaeger (06:02.612)\r\nWe've got other traffic channels, but the volume that we've gotten has built our practice. again, we have 20 clinicians. have millions and millions of dollars.\r\n\r\n\r\nNikolas Hulewsky (06:14.158)\r\nDo you own the directory?\r\n\r\n\r\nDavid Jaeger (06:16.205)\r\nSo no, that's the thing is I'm the client and I pay it and it's a no-brainer. It is the dumbest stupidest. There's no better ROI. I remember like I have a CFO does work or whatever fractional CFO slash bookkeeping company and he has a whole bunch of behavioral health companies that he that they do that they do the numbers for so I get to benchmark my performance against other behavioral health companies and he was like, hey, so\r\n\r\n\r\nSo what's your CAC? And I'm like I'm zero. I don't pay CAC. The last time I ran Google Ads was in 2020 for a month. And then my wife got mad at me, turned it all off, and we've been sailing ever since.\r\n\r\n\r\nNikolas Hulewsky (07:01.336)\r\nDude, you're kind of blowing my mind because it sounds like it sounds like an agency could say, hey, look, I specialize in mental health services, right? And I'm going to go and target mental health practices. How would they go and get those practices in the past? They would go out and cold call people like you and your wife. You're like, hey, owner, we'll do digital agency services for you. We'll do pay per click. We'll do SEO. We'll do all this other stuff. But\r\n\r\n\r\nLike there could be a place where this agency says like, okay, we specialize in mental health services. Let's build a directory. And the directory will not only be a lead gen for the patients, but it will also be a lead gen for like these companies to come after us.\r\n\r\n\r\nDavid Jaeger (07:43.622)\r\nYes. Yes.\r\n\r\n\r\nNikolas Hulewsky (07:44.962)\r\nThat's a brilliant model, dude. so that's why you're saying, okay, directories are killing lead gen agencies because it's like, okay, if you can get first to own like one of the best lead gen funnels, these directories, you're kind of staking out your territory.\r\n\r\n\r\nDavid Jaeger (08:01.651)\r\nheck yeah. Heck yeah.\r\n\r\n\r\nNikolas Hulewsky (08:06.398)\r\nSo, okay, so the company who has this directory, right, that you get the majority of your referrals from, are they a digital agency?\r\n\r\n\r\nDavid Jaeger (08:10.802)\r\nNo, they are a publishing platform that has that like a prestigious journal in the space that also has a directory but there's like\r\n\r\n\r\nI don't know, that's crazy. There's probably a hundred directories in the psychotherapy world. like the top software company has a directory and it's a massive bolt on to their business because it's like sign up for our EHR and you get listed in our directory and our directory is the only way to get in. It's not like I can go sign up. So for me, honestly, there's a part of me that if I knew there was enough traffic there, I'd spend 60 bucks a user a month to have my\r\n\r\n\r\nNikolas Hulewsky (08:45.687)\r\nin our directory.\r\n\r\n\r\nDavid Jaeger (08:58.388)\r\nprofiles there because you know what there are other directories that charge 60 bucks a month without the darn HR\r\n\r\n\r\nNikolas Hulewsky (09:06.254)\r\nDude, there would be some lead time, right? Like I'm in home health and hospice. So let's say that I wanted to start a digital agency targeting home health and hospice agencies. I'd have to build out the directory, get to a point where it's generating enough traffic and lead flow to start sending to different agencies in different markets. But then at that point, I'd have a captive audience because I'm sending them business and I have a shoe and a beach head into their business where I could do other things for them.\r\n\r\n\r\nDavid Jaeger (09:25.841)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (09:36.524)\r\nMy question is like how long would that take? Like how long would it take to, I know how long it takes to like build the directory. How long does it take to get it where there's traffic going to it? Because for me that's the missing step is like, anybody can build a directory, but how do you get it so that it's indexed on Google and so that traffic's actually going to it that it's ranked? That's the part that I'm having a hard time with.\r\n\r\n\r\nDavid Jaeger (09:57.714)\r\nSure. I think the, so here's, I guess coming from the paid ad side, right? Like the, for me and my models, when I master vertical, it starts with the paid ads. So driving traffic is never a problem. The problem is always the client being annoyed, not being able to work the leads properly, having all these complaints.\r\n\r\n\r\nNikolas Hulewsky (10:15.758)\r\nHmm.\r\n\r\n\r\nDavid Jaeger (10:24.804)\r\nand they have no fear of losing me because it's their brand, their ad account and half the time when you're successful enough, they'll take it in house because they're like, why should I pay him? I'll just do it myself. It was me that was successful anyway. With directories, you own the brand, so you monopolize and there's a FOMO there. So there are a lot of traffic channels. Quite honestly, I don't even know how long SEO is gonna hang out for with the whole.\r\n\r\n\r\nNikolas Hulewsky (10:38.211)\r\nYeah.\r\n\r\n\r\nDavid Jaeger (10:51.49)\r\nAI and the transition in, you really have to build a unique content base. Just slapping up a list of vendors or providers does not cut it. So I'm not relying on my short-term plan.\r\n\r\n\r\nNikolas Hulewsky (11:07.15)\r\nWait, wait, Time out, time out. I'm so sorry. I'm an idiot. I'm a neanderthal. Hold on. SEO traditionally has been, hey, I'm going to put all of these keywords and articles and backlinks, et cetera, so that I rank high when somebody searches for that in Google. Google's AI has kind of killed that, right? Because you'll search for something now and Google will have an AI answer. And now there's even links in the AI answer that people click through. So you can kind of optimize to get into the AI answers.\r\n\r\n\r\nDavid Jaeger (11:32.934)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (11:37.036)\r\nThe rest of those results that people used to get really hung up on ranking for, it's changed. It's totally changed the dynamic. Are you saying, hey, directories are a buffer against that? Like, hey, if you can get into the right directory or the right network, you're no longer at the AI's whims of whether or not they answer?\r\n\r\n\r\nDavid Jaeger (11:55.346)\r\nAbsolutely, Because there's so many entry points. When you own your own brand versus running as an agency, you can say whatever the heck you want. And all of sudden you can start pursuing your own traffic channels. there's so many, I'm gonna hang out on X long enough, and there's so many guys going, or gals doing so many innovative traffic channels that drive a massive amount of volume.\r\n\r\n\r\nAs a paid ads person, every single commercial keyword gets about 60 % of that generally can go to paid ads. If it's a local keyword, localized like, I don't know, home hospice near me, right? The SEO is pushed down. You've got your paid ads, you've got your Google Maps results which take out more than the number one, like you get 15 % of\r\n\r\n\r\ntraffic from the number one listing on the Google Maps side. And the Google Maps side is basically that number one listing gets you more traffic than all three paid ad results put together. Now that doesn't include LSA. Yeah.\r\n\r\n\r\nNikolas Hulewsky (13:08.876)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (13:13.39)\r\nSo you want to optimize that Google business profile basically in order to rank. Okay.\r\n\r\n\r\nDavid Jaeger (13:18.428)\r\nYeah, one of my one of my AI tools, but that's another another conversation. The SEO side, I'm not knocking SEO because SEO is a phenomenal value and it's never going away. It'll change, but it's never going away. And it's just it's seeing the future of it. And I think from that side, building a directory and thinking that you're going to rank on Google for it is not.\r\n\r\n\r\nNikolas Hulewsky (13:23.466)\r\nHahaha\r\n\r\n\r\nDavid Jaeger (13:48.306)\r\nI'd be scared. That feels to me as if somebody with an investor mindset too, like that feels like one shaky leg that is gonna fall apart pretty quickly, even if you're a very experienced SEO.\r\n\r\n\r\nNikolas Hulewsky (13:58.756)\r\nSo.\r\n\r\n\r\nNikolas Hulewsky (14:02.252)\r\nOkay. So one of the things we were talking about before the call was like, you can get all these leads, but the question, and you said this just a minute ago, you get all these leads, but the question is how do you service them? How do you handle them? Do you respond in a timely manner? and especially with directories, it's not exactly a directory, but like Angie's list or thumbtack or, Google LSA are similar to that where you get a referral and it's like, okay, whoever responds to it first gets the referral. how, how do small companies, small businesses who don't have the budget for\r\n\r\n\r\nDavid Jaeger (14:22.162)\r\nMm-hmm.\r\n\r\n\r\nDavid Jaeger (14:26.268)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (14:32.576)\r\na full-time QSR or not QSR, what do they call them? CSR. How do they respond to these leads?\r\n\r\n\r\nDavid Jaeger (14:37.687)\r\nare yes any known.\r\n\r\n\r\nSo it's a fantastic question. tend to deal with a little bit of the larger client, like the ones doing one to five mil, but even my tools can work for smaller people also. we basically, talked a little bit about this, but the biggest thing is that especially leads coming in from directories or leads coming in from forums where the users filling out more information about themselves, the worst, what happens is that lead just dies, right? They never get in, they never get a,\r\n\r\n\r\nlike 60 % of the time nobody responds to that message until they can get around to it. Until they're well you know now I finally have time let me go look at all my leads that I've never responded to. Or they will follow up the next day which by that time your user depending on the traffic channel is gone. Most of the time they're just gone. Right. I don't know if this person's legit. I don't know I don't know not.\r\n\r\n\r\nNikolas Hulewsky (15:32.536)\r\nCause there's friction. Cause it's like, this is too hard. I don't want to fill out the rest.\r\n\r\n\r\nDavid Jaeger (15:40.156)\r\nAnd that's one of the big things that we win with in our therapy world is we have an instant SMS that goes out and it's generic. In most verticals, I have an AI tool. It's just given the liability in the mental health world. I built the AI responder that personalizes based on their messaging, but it's an instant message, even a generic one that asks for a little bit more information. Ideally, have an AI bot that\r\n\r\n\r\ntexts back and forth. People do not pick up phones, people do not respond to emails, they do respond to text. It's just really, really freaking convenient. So you go back and forth via text and this is one of the reasons why Go High Level or my white label, GrowNow.app is so...\r\n\r\n\r\nso powerful is because you set up these flows. Again, we just set it up with an AI bot and we've spent hundreds of hours tweaking it in very competitive verticals. And I'd love to show you that too if we have time. But it absolutely... 2x14? Yeah. Yeah, this is... It's a mind-blowing little tool. I was hoping we can get to directories because directories are fun, but the 2x14 is killer.\r\n\r\n\r\nNikolas Hulewsky (16:43.362)\r\nYeah, so is this the framework you were talking about, the two by 14?\r\n\r\n\r\nDavid Jaeger (16:57.314)\r\nWe basically took all the work that we spent and automated it with AI like three answers and bam it knocks out crazy stuff for you.\r\n\r\n\r\nNikolas Hulewsky (16:58.05)\r\nWell, I mean.\r\n\r\n\r\nNikolas Hulewsky (17:06.734)\r\nWell, mean, directors are cool and I like directories. It just feels like it's one part of the equation. It's like, okay, cool, you're generating leads, but the next step of the flow is now that you've got the leads, what are you doing with them? And it feels like there's less focus on that, which makes sense, right? Like it feels good, I generated all these leads.\r\n\r\n\r\nBut for the business owners, like, well, how many of those actually converted into revenue? How many of those actually converted into paying customers? And if you don't have the systems on the back end, it doesn't matter how many leads you're generating. So that's why I get curious about how do you automate the response to these leads so that they end up converting? Like, how do you make your own AI customer service rep?\r\n\r\n\r\nDavid Jaeger (17:44.562)\r\nWell, absolutely. I can show that to you in a moment, but I think the more important thing is that when you're an agency, what feeds you is leads. Your own like direct business owners, small business owners, to large business owner prospects. I I run paid ads very pretty successfully. can generate leads in most verticals of business owners, but there's a lot of friction.\r\n\r\n\r\nThe directory honestly, I'm about to just spin up a ton of cold email and go reach out at 12,000 providers in my directory list. I'm going to offer it's basically a sneaky backend in to open up a conversation and sell them something. It doesn't make a difference what the hell I sell them. Claim your listing here questionnaire bam bam bam do you need help with funding? Are you looking for acquisition? Can we like what's your number one challenge? And I can go through I've built that.\r\n\r\n\r\nNikolas Hulewsky (18:32.908)\r\nYeah, yeah, yeah.\r\n\r\n\r\nDavid Jaeger (18:39.568)\r\nneeds a little bit more tweaking, but.\r\n\r\n\r\nThat right there, how many responses do you think I'm going to get when I say, referrals for X and it's like, hey, we're running this directory, we've created this listing for you, maybe I'll cherry pick the ones that have amazing reviews and send it to them first. We'd love to have you claim your listing and customize and blah, blah, blah. Can we go through this question? And then if they respond, send them the link, hey, claim your listing here. Bam, done. Now I've got it's mandatory. What are the things that they're struggling\r\n\r\n\r\nwith. Now I have a conversation opener.\r\n\r\n\r\nGreat, we've approved your listing. By the way, I noticed X, would you like to schedule a booked call or automate that on the back end? as soon as they do that, drop a thank you page message with that in there. So it's a sneaky back end in that can open me up to the whole freaking industry. And now the question is how do you monetize that? So I don't even care about the lead issue like that. Yes, I can sell that, but I need to know that that's a problem first. Because different business owners, even with the same problem,\r\n\r\n\r\nNikolas Hulewsky (19:43.02)\r\nYeah.\r\n\r\n\r\nDavid Jaeger (19:44.34)\r\nthere's a certain amount of solution awareness and predisposition to issues that they have. So like I have clients that use our 2x14 system and they don't they customize it like I've given them I was like here let me hand it off to you and then they just don't use it.\r\n\r\n\r\nNikolas Hulewsky (19:51.565)\r\nTotally.\r\n\r\n\r\nDavid Jaeger (20:00.498)\r\nor there's a ton of support that's involved and it's like, dude, like follow the damn lines, the dotted lines. And so every single business has like, you can't just hand something over necessarily. And every business has their own pain points. Some of them have cashflow challenges. Some of them are just burnt out. Some of them want your marketing. Some of them hate paid ads and they want to do SEO. And all you gotta do is open up a conversation and that's a give. It's a give first. It's like, hey,\r\n\r\n\r\nlike, know, can I give you, can I have you verify your information, claim your listing so that we can send you resources, you know, we can send you referrals.\r\n\r\n\r\nNikolas Hulewsky (20:41.144)\r\nSo what do want to show me? Like, did you build something for that in particular, or is that just your thesis of how I entered this market?\r\n\r\n\r\nDavid Jaeger (20:46.157)\r\nI... No, it's built. It's about to get launched on the marketing side. So you can have a little sneak peek preview of it. Yeah, shoot, we don't have a lot of time, but I have to tell you that this business, this vertical that I moved into, actually came from you. Yeah, from you, dude. Oh, shoot, wrong screen.\r\n\r\n\r\nNikolas Hulewsky (20:54.818)\r\nCan I see it? Can I see the preview? Yeah.\r\n\r\n\r\nNikolas Hulewsky (21:09.166)\r\nFrom me?\r\n\r\n\r\nNikolas Hulewsky (21:14.492)\r\nWrong tower.\r\n\r\n\r\nDavid Jaeger (21:15.794)\r\nThey're an ass.\r\n\r\n\r\nscreen.\r\n\r\n\r\nscreen. There we go. So remember you posted like a year ago you're like somebody gave you 100 grand would you build or buy what would you build?\r\n\r\n\r\nAnd at the time I was dealing with, we have hundreds, close to 500 clients a week that we see. you've been in the billing space. It's out of control. Primary, secondaries, who's the managed care plan? This, that, and it's like your AR goes crazy. And it's just obnoxious. And I was like, I looked at it and it's like, my clinicians cost a boat ton of money. I'm competing with venture capital funds. So our payroll keeps going higher to receive the\r\n\r\n\r\nthing and so margins get squeezed a little bit. It's still a damn good business but it's you know it's challenging and I was like oh you know what like I like ABA. ABA sounds really exciting like instead of 450 clients I can have 45 and I make the same amount of money at a better margin and anybody can be a behavioral therapist like this sounds amazing and so I posted about that and how I build instead of buy because the marketing chops I have and I actually have a client in\r\n\r\n\r\nDavid Jaeger (22:32.372)\r\nin ABA because of that guy reached out and started opening up a conversation. Yeah, and so we've added millions of dollars in ARR in the ABA space and we're talking about how do we go national? Like what's the play? What's the so what? Yeah, so I owe.\r\n\r\n\r\nNikolas Hulewsky (22:35.404)\r\nNo way.\r\n\r\n\r\nNikolas Hulewsky (22:46.446)\r\nThat's amazing.\r\n\r\n\r\nDude, that's okay. So, so David's while David's pulling that up, basically I love the ABA space. And for those who don't know, ABA is applied behavioral analysis. It's for children who are on the spectrum, who have autism. What's crazy is I want to say when I was born, it was like one in 500 kids were diagnosed with autism. And just last year, it's now like one in 28. It's crazy. It's like an, it's an insanely high number. And so these children need more and more services.\r\n\r\n\r\nAnd there's just simply not enough services for them to meet the demand. And they need people to help them understand how to navigate the real world, how to navigate their feelings. These kids are on a massive spectrum of, you know, some of them are nonverbal and some of them are highly verbal. But it's growing like crazy. I think it's an amazing business. I think it's an amazing mission of a business. And so it's something I want to get into someday. That was what I posted about it. But it's freaking cool to hear that you like took it and just ran with it.\r\n\r\n\r\nDavid Jaeger (23:47.258)\r\nYeah, yeah, it was funny. You just posted like what vertical would you be in and That was that was what I posted. I just need to I want to find one more thing. It's a little bit awkward\r\n\r\n\r\nNikolas Hulewsky (23:52.184)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (23:57.581)\r\nWell, because I love businesses with tailwinds behind them. That's why I love healthcare, especially elder care, because our population is aging so fast and there's not enough demand to meet the supply. So you can kind of be anybody and be successful if you enter that space just because there's so much demand. can ride the tidal wave. ABA is like that as well, right? Like there's so much demand.\r\n\r\n\r\nDavid Jaeger (24:16.838)\r\nYeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (24:22.562)\r\nHonestly, when I was in healthcare, I didn't know what CAC was. I didn't know what LTV was. I didn't know about pay-per-click ads, because we don't use those, at least in my home health and hospice. We don't acquire customers online. There's just so much demand that we kind have to just go out physically and let people know that we exist, and then we get lots of patients.\r\n\r\n\r\nDavid Jaeger (24:38.514)\r\nPlease.\r\n\r\n\r\nAnd we were so funny because we're the opposite. we directories just drove everything for us. And it was like, there's the one biggest, most affordable directory and everybody talks community outreach and Google ads and all this stuff. we just, we did, I had a no index, no follow on my freaking homepage for three years. And I was just stupid. I just threw it up and I never came back to it. And I was just like, came back. like, Oh my goodness, rookie mistake three years later. And\r\n\r\n\r\nWe should just go full.\r\n\r\n\r\nNikolas Hulewsky (25:13.742)\r\nAmazing.\r\n\r\n\r\nDavid Jaeger (25:14.87)\r\nYeah, but yeah, ABA is really big. You're doing something meaningful. It's recession-proof. It's high revenue per client, very, very high revenue per client. Margins are defensible.\r\n\r\n\r\nIt's a tough business from the insurance space, again, other conversation. Bottom line, I love it and I want to be in more and try to get my my greedy little hands in. So, you know, for me, a lot of it is a lot, you know, the healthcare side, these practices, a lot of them aren't necessarily well run. And so I'm always looking for acquisition opportunities too. And even if it's not my own money, like.\r\n\r\n\r\ngo put something together and like, hey, let's do it. Single asset fund, multi-asset fund, go bring it to people that are already in the industry, bring it to new people. There's so much wheeling and dealing, and it has so much more value than the agency side. So even if I don't get paid by the business owner, this is gold. So the problem that I've had,\r\n\r\n\r\nNikolas Hulewsky (26:11.918)\r\nSo you built an ABA directory?\r\n\r\n\r\nDavid Jaeger (26:15.026)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (26:16.942)\r\nI'm so excited. All right, sorry, keep going, keep going.\r\n\r\n\r\nDavid Jaeger (26:19.206)\r\nYeah, I you can go see it. It's live. So basically up until I I tried the WordPress thing and fray on YouTube and ship your directory guys awesome He has a lot that he does around us. I don't plan on building a brand around the directory world. I'm just I'm\r\n\r\n\r\nneed to be locked into what I do. But the WordPress side did not do it for me. I tried to get a guide to build something on lovable disaster, just absolute disaster, overthought, and it's a pain. I have development shops, but I was not gonna give this to my developer, A, because lots of other things to do. B is I wanna kinda mess around with it myself. And so I got my tech stack done. You can see right here, I got it to a place where, A,\r\n\r\n\r\nscraped 12,000 plus ABA providers. I also downloaded all of their reviews from Google. Now hopefully maybe we have to delete this on off of YouTube whenever Google starts getting nuts but I'm not too worried. And so basically I just I've been chatting with Windsurf. I've been using Windsurf and Claude code with a whole bunch of things and have built it in like the most... I'm not really a developer. I'm a fake developer.\r\n\r\n\r\nNikolas Hulewsky (27:12.194)\r\nHoly crap.\r\n\r\n\r\nNikolas Hulewsky (27:18.444)\r\nHahaha\r\n\r\n\r\nDavid Jaeger (27:33.36)\r\nI have a developer that works for me but he's front end. We've never always struggled with getting good backend enterprise guys. It's expensive as heck. And Claude Opus and Claude Coder, the last month, it's just nuts. I've messed around with this stuff for years, different ways and this is just, I can be a dumb ass, excuse my language, and it just can get built.\r\n\r\n\r\nSo going to here, there's a lot here. So I have like a little matching quiz and this is to generate leads. And again, there's still a little bit more work, but it's pretty highly conversion optimized. And you can literally just go into Claude or Windsurf and say, hey, look at this, build me something like this. And so this is to get the lead for the prospective client. Again, this is not as clean as I'd like it. There are cleaner versions, but...\r\n\r\n\r\nNikolas Hulewsky (28:06.57)\r\nsweet. That's genius.\r\n\r\n\r\nDavid Jaeger (28:27.442)\r\nThe bottom line is it's super smooth and this whole thing loads really, really quickly. And that took a bit of work. But again, did all the heavy lifting. So let's just say right here, I'm on the... Tell me if I'm moving too quickly.\r\n\r\n\r\nNikolas Hulewsky (28:45.57)\r\nNo, you're good, you're good. No, I love the quiz. I think that's a really cool identifier.\r\n\r\n\r\nDavid Jaeger (28:46.994)\r\nOkay, so.\r\n\r\n\r\nDavid Jaeger (28:51.516)\r\nThank you. Thank you. So yeah, so basically I built this as front end and back end. I'll show you through the back end as well. But basically we scraped Google, we scraped all the reviews, we scraped all the providers. It's not perfect. You can see there's some speech and language in here. It's probably a little bit messy. There's some pediatrics. It's not perfect, but it's definitely, know, it's the bottom line is like this is, so here this would be the picture if their Google Maps image was there. I guess there's an issue with the image which happens, but bottom line.\r\n\r\n\r\nis I have this massive thing and so I have a listing I have all of their views here you can see all their views you have more see you visit the website find more providers and then I have this little button and it says own this practice and so basically where this goal had been I guess I have to rebuild this so basically I was gonna ask this is gonna be once again a sequential form I have to just chat with Claude and we won't have time to go through and show you how to show you how I do\r\n\r\n\r\nthat. This is life. Go to AutismCareFinder.com. No. No. But again, my thing is cold email. It's coming out this week. I'm literally gonna go out cold email every single one of these providers, open up conversations. I don't need traffic because I can turn on traffic on a dime if I have a contract. I don't even necessarily have a business model.\r\n\r\n\r\nNikolas Hulewsky (29:51.584)\r\nIs this been, is this live?\r\n\r\n\r\nAre you getting traffic right now?\r\n\r\n\r\nNikolas Hulewsky (30:15.342)\r\nWhat would you do to turn on traffic?\r\n\r\n\r\nDavid Jaeger (30:17.682)\r\nFacebook ads, Google ads. I can talk about the long-term play. If there's margin in it, sure. Sign up, tell somebody I have a directory, we get a client, we get leads, here's what it costs.\r\n\r\n\r\nNikolas Hulewsky (30:21.248)\r\nyou would just start paying.\r\n\r\n\r\nNikolas Hulewsky (30:29.24)\r\nDude, I love the directory strategy that you have that's not just like, I'm just gonna get a lot of traffic. It's no, I'm gonna build the directory, which is effectively gonna be a marketplace for me to go and pick and choose which clients I wanna work with, and then I'm gonna cold email all the clients, tell them about the directory. They're gonna go to the directory, I'm gonna create some FOMO for them to effectively then reach out to me and say, I'd like to rank higher on this. And like.\r\n\r\n\r\nyou're both the chicken and the egg. Like you're creating both pieces to the equation. That's a really interesting strategy.\r\n\r\n\r\nDavid Jaeger (30:59.312)\r\nYes.\r\n\r\n\r\nYes, but i'm also I am adding real value. So I want to talk about the long-term traffic the mid-term traffic play\r\n\r\n\r\nSo because the thing is is I think a lot of people get stuck I'm in go mode meaning I need to do something I need to validate come from poor person mindset like it's got a it's got a crack up and show me that to Validate it that it makes sense I'm not here to mess around because I've got other things lots of other things to do and I even though I'm working many long hours I don't want to so it's got a crack out where there's an actual validation So for me, I just want to get 40s 30 to 40 sale 30 to 40 sales calls\r\n\r\n\r\nNikolas Hulewsky (31:32.067)\r\nYeah.\r\n\r\n\r\nDavid Jaeger (31:39.092)\r\nout of this. 10,000 cold emails over 90 days. I want to see my response rates. I'm going to get it knocked out and then I want to sell them what they need.\r\n\r\n\r\nI plan on building like I want to get roll ups out of this like to me there's an opportunity for a national roll up opportunity. I want to see are there people that will say hey I'm looking for somebody to buy my business. Hey I you know the marketing side is an opportunity like all these things I'm opening conversations. That's the biggest thing right here is get me on the phone to listen. Then on top of that there is a traffic and a brand play and that is the Facebook pages Pinterest pages social AI.\r\n\r\n\r\nUGC regular UGC Like there's some Facebook groups there There's really is adding value like if you look at it like got what? Parents of children with autism it becomes their whole life. It's all consuming This is all the e-breathing live and they're lonely like most people they're like you living in a bubble\r\n\r\n\r\nfriends don't understand how your life has been turned upside down. So by understanding the audience and being able to cater to it, it's just going to build its own traffic. And I just have to build wherever it is. And so the directory is a brand opportunity. So as an example, another fun thing that I've pushed into, I'm sorry, I hope I'm not running too far. This is a fun one.\r\n\r\n\r\nBut basically, I built an AI chatbot. so I took the whole, I'm almost done. I can show you the back end in a little bit, but.\r\n\r\n\r\nDavid Jaeger (33:13.522)\r\nBasically, I built this off of Google Gemini and this is all a chat embedding of all those reviews and so the angle is this. is that why you know the gotchas, right? You do all this research. You spend all this time searching, researching for a provider for X. You want to do home improvement, you're looking around, you're reading their reviews, you're talking to friends, you're doing all these things and I can shortcut it.\r\n\r\n\r\nNikolas Hulewsky (33:22.104)\r\nWow.\r\n\r\n\r\nDavid Jaeger (33:39.226)\r\nI've just downloaded 170,000 reviews, dumped that into an embedding and say, hey, parent, what are you struggling with? How can I help you? And now I have real reviews to reference, real experiences, real stories. again, built a normally that's a very high-end tech project and just built it with Windsurf.\r\n\r\n\r\nNikolas Hulewsky (34:02.958)\r\nDude, that's incredible.\r\n\r\n\r\nDavid Jaeger (34:03.246)\r\nSo I have, and again, this is all built by AI. Like I just gave it rough ideas and it, it works for me. Like I've got it all.\r\n\r\n\r\nNikolas Hulewsky (34:13.038)\r\nYeah, you're not only using AI to build a product, you're using AI to help you identify the pain points, your value proposition, how you're selling to people, what you're solving, like in non-traditional ways. Like that's a really cool way to think about it. It's like, I'm gonna go and scrape all the reviews to find their pain points. Like, why would you not do that?\r\n\r\n\r\nDavid Jaeger (34:26.694)\r\nYes, exactly. Thank you.\r\n\r\n\r\nDavid Jaeger (34:33.202)\r\nAbsolutely, and we use that when we run ads we just scrape a ton of providers and then we use that to build actual copy Which I'm not the only one that does it but here look at this So there's like what's called a rag embedding. So you're embedding all this information into the chatbot I have this running through Gemini because to me Google Gemini is the largest context window fastest provider. They're just freaking Blazing when it comes to loading things and the biggest problem with AI is things just take time\r\n\r\n\r\nNikolas Hulewsky (34:38.626)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (34:46.606)\r\nYep.\r\n\r\n\r\nDavid Jaeger (35:03.76)\r\nAnd so I have a, like this is Bill, I've been dying to have an excuse to build something with Google Gemini top to bottom, and I did it. And again, I didn't have to know so much of the technicals. So this is basically, this is the model. And again, the traffic I'm gonna build, but I wanna wait to invest the time and the money into that and get the paying customers upfront for whatever it is, anything that it is.\r\n\r\n\r\nNikolas Hulewsky (35:17.347)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (35:33.587)\r\nThis is awesome. I really love the way that you're thinking about not only the business problem, creating the solution, but also how you bring customers to you as opposed to just relying on cold outreach. it's pretty cool the way that you've like used directories, which are these, they've been around for a while, but they're this hot thing to talk about in AI right now. And you're using that as sort of a platform to launch a business. that's a, man, that's really cool.\r\n\r\n\r\nDavid, where's the best place for people to come find you?\r\n\r\n\r\nDavid Jaeger (36:05.18)\r\nOkay, so if it's okay, I'm just gonna jump you through. talked about the two by 14 and the follow-up issue. I'm gonna run you through this. Best place to find me, because this is the, basically, and I'll drop the link on the homepage, but my CRM platform, aicrmisgrownow.app.\r\n\r\n\r\nNikolas Hulewsky (36:10.637)\r\nYeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (36:14.904)\r\nOkay.\r\n\r\n\r\nDavid Jaeger (36:22.513)\r\nWe have a model called the 2x14, which follows up with people really quickly. So what I want to show you is the 28 messages that you're going to use to follow up for any of your businesses using SMS. Our platform uses that layers in AI to personalize it to every single prospect, but we're basically hitting your pain points 28 different ways. So if you don't mind, I know we're running close on time. Can you give me a business name of any business you're interested in and we'll just run through it and see how it works?\r\n\r\n\r\nNikolas Hulewsky (36:52.398)\r\nFast tree care.\r\n\r\n\r\nDavid Jaeger (36:58.192)\r\nSo tell me what the business type is but specifically use as much as you can pre-build into the AI to tease it to tell you about your value.\r\n\r\n\r\nNikolas Hulewsky (37:06.03)\r\nIt's a tree trimming business.\r\n\r\n\r\nDavid Jaeger (37:09.83)\r\nand what's cool about the true training business.\r\n\r\n\r\nNikolas Hulewsky (37:12.76)\r\nWhat's cool about it?\r\n\r\n\r\nDavid Jaeger (37:14.054)\r\nYeah, like what makes Fast Tree Care better than any other tree trimming business?\r\n\r\n\r\nNikolas Hulewsky (37:19.438)\r\nWe respond really quickly. Let me think what else. We...\r\n\r\n\r\nkind of human touch. Gosh.\r\n\r\n\r\nDavid Jaeger (37:31.908)\r\nAlright, we're gonna, I'm just gonna, I'm shortening this down. Your business type is tree trimming in a day. I'm just gonna make it up. Maybe it's not a day, but let's just make it up. And we're gonna put, I'll put my email, one of my emails.\r\n\r\n\r\nDavid Jaeger (37:56.238)\r\nWe'll wait a moment. This basically, so we use this, we use this right now across thousands of leads in the legal vertical, which is very, very, very competitive. And they get hit with an AI bot that follows up with them after the lead form based on their AI landing page where they share information. And then it's followed up with AI SMS. And then we hit them 28 times, twice a day, 14 days. Most of the time,\r\n\r\n\r\nwhen you deal with this follow-up process for most businesses, even when they have a call center, it's just obnoxious. People get really pissed off because they just, it feels like it's just cold. It's a take, take, take. You have basically buyers' remorse after filling out that form afterwards. Like, well, are they legit? Did I really do it? Should I really do it? I don't really want to talk on the phone. And so it creates a very obnoxious experience\r\n\r\n\r\nNikolas Hulewsky (38:26.446)\r\nCheers.\r\n\r\n\r\nDavid Jaeger (38:56.052)\r\nwhereas when you text them and you show that you understand them, it's a game changer. So check this out. So I have a business sequence set up. We've had, we basically set up a business personalization question. Well, what's the main reason you're looking for it? Overgrown storm prep, HOA notice, how many trees are you concerned about? What are the pain points? Overgrown branches, blah, blah, blah, blah, blah, all these different things. Again, made it, the AI made it up and it's going to turn these into 28 different comments. All right, ready?\r\n\r\n\r\nNikolas Hulewsky (39:01.955)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (39:17.25)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (39:24.942)\r\nOkay, yep.\r\n\r\n\r\nDavid Jaeger (39:32.786)\r\nAre you reading this? So, hey, contact first name is fast tree care. So you're looking at the tree trimming. What's the biggest headache with your trees? All right, here we go. Morning to an AM message. Morning. A lot of people we help are just tired of looking at messy trees. Is that kind of how you're feeling? Hey, when you're looking at your trees, what's the number one thing you wish was different? Just curious.\r\n\r\n\r\nNikolas Hulewsky (39:42.925)\r\nHuh.\r\n\r\n\r\nNikolas Hulewsky (39:53.87)\r\nDude, this is awesome.\r\n\r\n\r\nDavid Jaeger (39:55.25)\r\nYeah so it goes through again this is 28 messages at the end of the day like at some point prospect cries uncle and you're the only one they're talking to. So anyways I'll have this on grownow.app on the homepage that people can fill out but the biggest thing again that's the personalization one of the many things we do with AI on top of the directory and so yeah I'm sorry I took up too much time from you I hope it's okay.\r\n\r\n\r\nNikolas Hulewsky (40:16.366)\r\nI love it. I love it. Well, no, no, it's good. I got to run. have a hard stop. It's great to see you and we will talk soon. So stay.",
  "metadata": {
    "duration": "",
    "date": "2025-07-10",
    "platform_source": "Google Drive"
  }
}