{
  "episode_number": "25",
  "episode_title": "TOP PICK! From College Day Trader to a $1M Biz In Less Than 5 yrs with Bodhi Gallo",
  "guest_name": "Bodhi Gallo",
  "business_name": "Dumpster Rental Company",
  "transcript": "﻿If you're anything like me, most of us grew up fantasizing about being a dumpster rental company owner, said no one ever. But you wouldn't know that from Twitter and all social media. It's a sexy thing right now to have a dumpster rental company or a trailer rental company. Well, today I sat down with Bodie Gallo.\r\n\r\n\r\nHe's otherwise known as the dumpster rental guy on Twitter and gosh, dang it. I just love talking to young, hungry entrepreneurs. In this episode, you're going to learn everything you've ever wanted to know about owning, running and launching a dumpster rental business.  You're going to want to stick around for the very end because he talks specifically about how much it costs to buy a dumpster.\r\n\r\n\r\nWhat the startup capital is, what your margins look like, what the payback period is. And it's really a masterclass from him in launching a business built off of the back of relationships. So if you like this episode, please like, and subscribe. But with that, let's just hop into the show and we're in Bodie Gallo.\r\n\r\n\r\nThank you for having me. Super stoked to have you, man.  I'm just going to hop right into it. Tell me in its simplest terms, what does your business do and how do you make money? Simplest terms. What my business is, is we haul garbage. The way we make money is we drop dumpsters into people's driveways or into commercial parking lots, commercial spaces.\r\n\r\n\r\nWe drop either 10, 15 or 20 yard dumpsters into these areas. The customer fills it up and we haul it away. The way we make money here though, is we charge a drop off fee and we make money off the weight of the dumpster. So I'll charge a drop off fee and I'll charge a wait fee. Okay. So you drop off and you pick up.\r\n\r\n\r\nYes, we drop off and we pick up. Cool. There's a lot on Twitter right now. So my business partner, Chris Kerner, I'm a Home Park guy.  He's posted a couple posts about things like dumpster rentals, trailer rentals, those types of things. And they've just gone viral. They've exploded. Cause it's like tapped into this.\r\n\r\n\r\nHey, this is an easy business. It's never going away. Sweaty business, blah, blah, blah.  How did you? Get exposed to this business. How did you get into it? When did you get into it? Why did you get into it? Like, I'm just curious where you started from. So it's a crazy story in college. I was playing division 2 lacrosse. \r\n\r\n\r\nOne of my teammates on my lacrosse team's dad owns a huge asphalt company.  Me and this teammate just started to click at the time. We were trading a ton of stocks. Like I traded a lot of stocks in college to make money. So was he. And pretty much we just became really close. And all of a sudden he starts coming to me with all these business ideas.\r\n\r\n\r\nAt the time I had a stock, what's it called? Stock website called Financial Freedom 101. All I really did though on that website was talk about index funds and credit cards. I made a blog post about credit cards one day that kind of just blew up, discovered what SEO was, and got a job that summer. I made 5, 000 from credit card bonuses.\r\n\r\n\r\nGot a job that summer at a company. I'm a marketing agency working on accounts like Kroger firehouse subs. Then I worked for Benjamin Moore and co the paint company. So it's just some little background of how he might kind of click in timeout before we even move on to the dumpster business.\r\n\r\n\r\nYeah. You like glossed over a bunch of really cool stuff in there. Yeah. Yeah. I'll get to it. You've always been a hustler. Yeah, I've always been a hustler. Yeah. I've been making money since I was like 16 illegally or legally. Like I was making money at all times. I'm not going to lie to you. Oh my gosh. Is this Jay Z here?\r\n\r\n\r\nWhat's going on? I, yeah, kind of, I didn't grow up like my dad. My dad was a correction captain at Rikers Island. He didn't really start making good money until his fifties. My dad. So pretty much my dad taught me how to work and how to make money. But like he was in the police force, he retired at 44 from the police force, and had to reinvent his career.\r\n\r\n\r\nAnd he makes good money now, but like at the time he really wasn't. So growing up, I grew up with a lot of rich kids. I'm not going to lie. Like a lot of kids I grew up with were wealthy. So my three best friends, super wealthy, but me, I just came from a regular middle class family. And I always wanted that for myself to make money.\r\n\r\n\r\nSo I've always had mentors growing up like those of people that were in like corporate America or whatnot, and all those things, and I always had mentors growing up and my best friend's dad always, my dad was always like, you're going to become a police officer. Like that's what he saw like in me or like an operator of someone else's business.\r\n\r\n\r\nAnd my friend's dad who worked for Google is, he was like the CIO of DoubleClick who got acquired by Google. Oh, wow. I'm a very wealthy guy. He always said, no, like Bodie, you're going to do good things in life. You're a smart kid. Like you, just school isn't for you. And he always believed in me and I always just knew I had to hustle and make money somehow in some way.\r\n\r\n\r\nGraduated high school with a one seven GPA. So yeah, I'll go all the way back. I graduated high school, like a one seven GPA, one nine, one nine. Maybe it was a one nine. I don't know. It wasn't good. It wasn't pretty. Mine was, mine was a one nine. I barely graduated high school, but the only way I got in the car, I went to some small D two college, like outside of New York city, local college, the only way like I was able to get in college, it was like a sports scholarship and it's not even like I was that good at lacrosse.\r\n\r\n\r\nI was just good enough to get a scholarship for it. Yeah. And pretty much I got a scholarship at like two division two schools, took one of them knew first year I was undecided, knew how to get my shit together. Pretty much knew how to get my shit together, undecided. Then I got into marketing and social media marketing.\r\n\r\n\r\nAt the time I was like, I'm fascinated with making money. All my friends, families were in like corporate America, doing great, great, great. Yeah. I was addicted to getting internships and whatnot, started a finance blog about credit cards. Okay. So before I, there's like a million things I want to say really quickly.\r\n\r\n\r\nSo it's fascinating. I grew up exceptionally poor. I'm one of nine kids. My parents like never made more than 30, 000 a year combined. My mom now listens to this podcast. So shout out to mom. I love you. That's awesome. She's the smartest person I've ever met. My mom, like to this day, smartest person I've ever met.\r\n\r\n\r\nAnd she did something. I don't know, knowing or unknowing, but we had church friends  that were all hyper successful, dentists, lawyers, corporate executives, et cetera. And so when we went to church, those were our friends. When we went over to their houses,  that's where they were living. And we saw like how they lived.\r\n\r\n\r\nI'm not like you. I wasn't always like, Oh, I gotta make money. I want to make money. It just wasn't how I was wired. But it did expose to me, like, Oh, what's possible out there. And so I think it's just,  I'm grateful for my parents being the worst house in the best neighborhood because it showed me what was possible.\r\n\r\n\r\nAnd I think you had a very similar experience growing up with your friends and it just drove you to want to be better. How the freak did you get into stocks though?  Like my friends, my friend's dad from Google. So. My parents. Were you day trading? Option trading? No, I wasn't day trading. We were just buying, like, I bought Microsoft like $90.\r\n\r\n\r\nWe were just buying stocks for a long-term gain. I wasn't day trading like. I'm not really a gambler at all. No day trading. Really just pretty much buying stocks just for the future. We screwed up on Tesla.  That's one thing we really screwed up on, but like pretty much my parents always had me save money, always had me save money.\r\n\r\n\r\nSo I came out of college with 5, 000, I mean high school with 5, 000, which a lot of money at the time. Yeah. And I just put that all into stocks. That's when Robinhood pretty much just hit the scene.  And I remember being on vacation, August of I graduated high school in 2017. Yeah. I was on vacation, August of 2017.\r\n\r\n\r\nAnd we just started like with my friend's family and my family. And we just started like buying stocks, talking stocks. The great thing about my friend's family, they're some of the wealthiest people I ever met, but they don't act like it and I could hang out with them. Like they just never acted like it.\r\n\r\n\r\nAnd they always just took me under their wing and mentored me. And pretty much. We started buying stocks midway through my freshman year of college. We started Financial Freedom 101. When we started that, it was just for us to get internships and just for us to get jobs. That's pretty much why we started it to be financial freedom.\r\n\r\n\r\nFinancial freedom. One on one. Was that like a blog? Was it a course? Yeah. Financial freedom. One on one. Dot blog. Pretty much. It was just a blog. And we spoke about like personal finances, credit cards, index funds, nothing too crazy. Like just basic stuff. Our slogan was like the importance of investing in like your future as a young adult.\r\n\r\n\r\nSomething like that. That was my first, not the longest slogan I've ever heard. Yeah. Something like that. I don't even remember at this point, like the importance of investing in your future, like something silly. That was my first time ever, like building a website. And I built an Instagram to like 3k followers.\r\n\r\n\r\nMy partner and my marketing business today, we met through stocks. I'll get to that later,  but pretty much we wrote this blog and I got a job that summer at a company called active international. And That's where I really dive into marketing, their marketing and media company.  And I worked with them for six months.\r\n\r\n\r\nSo the stocks thing was really a means to an end. You wanted to  do this blog so you could get internships. That's how it started. So I loved it, honestly, yes. But honestly, I, at graduating college, I had an offer at financial or what the hell is it called? The British company UBS. No, that's sweet. It's a finance blog.\r\n\r\n\r\nI can't believe I can't even think of it right now. No idea. I'll get it later. I'll tell you later.  Financial times. What the hell? Financial times. I had a job offer with financial times, but my goal was to get into finance, but I wanted to get my door in finance, like of marketing finance,  but I worked at ads of international. \r\n\r\n\r\nMarketing, media agency, worked on accounts like Kroger, Firehouse Subs. The creative director really turned a liking to me and started letting me pretty much learn as much as I wanted, work on what I wanted. Like it was a really great internship, really great opportunity for me. And I would have lunch with him every day.\r\n\r\n\r\nHe was just a great mentor. The following year I worked at Benjamin Morinco, the paint company, the Warren Buffett owned paint company. Yeah, I'm with a Warren Buffett dolls in the office all over the place. It was pretty cool. And I worked with them just in their marketing department, but the lady that hired me, she got laid off during COVID.\r\n\r\n\r\nSo then I worked with a VP of marketing at Benjamin Moore and they were low on staff. So pretty much what they were doing was having an intern do like the marketing managers work. And that's where I really just excelled in marketing and learned a ton, absorb stuff like a sponge. I just like a ridiculous opportunity at the times during COVID.\r\n\r\n\r\nSo stocks were going crazy and my dumpster rental business partner transferred to my school. I've always known him from local lacrosse. Like we've always known each other, but finally he was on my team. And like growing up in youth lacrosse, like I hated him. I hated his guts. He was good at lacrosse. He was cocky.\r\n\r\n\r\nI'm cocky. Like we just hated each other. And then we became teammates and just clicked, just became really good friends. Talk stocks every day. Blah, blah, blah, ended up. His dad owns a huge asphalt company in my town. Paves roads, government contracts. His dad is really good friends with my girlfriend's soon to be wife's grandpa, who's another mentor of mine.\r\n\r\n\r\nAnd pretty much I went from having your girlfriend. Oh, your girlfriend's soon to be wife. Okay. It sounded like you said my girlfriend's soon to be wife. No, no, no, no. Okay.  He's progressive.  Yeah, none of that. No, I'm definitely not progressive either.  So they were like, we got to get these two together. My girlfriend's  brother's dad owns like her half brother's dad owns like the biggest garbage company in the Bronx, blah, blah, blah, all garbage people.\r\n\r\n\r\nSo my girlfriend's grandpa got me together with my partner's dad and my partner. We had a sit down and we were like, let's get these two together running a business. They came to me with three different business ideas.  And this is like, I'm a senior in college. Like we're in the middle of our lacrosse season.\r\n\r\n\r\nAnd they're like, this kid's school is not for me. Let's do something else. We're sitting on the lacrosse field every day, running miles, breathing and everything like that, just sweating our balls off. And what's it called? We're just sitting on the lacrosse field and we're like seeing trucks go by. And my partner is saying to our coach, like, dude, we could be making money right now, like, what the hell are we doing here?\r\n\r\n\r\nHe came to me with like three different business ideas. And the dumpster rental business was the only one I was like, I'll do this. I won't do landscaping. I'm not cutting someone's lawn. I'm pretty sure the other one was like steel coating, which is terrible for your lungs. Um, still coding would have been great because his dad would have got us all the contracts, but I was like, I'm not  terrible.\r\n\r\n\r\nHe hated it too. I'm not dying of 50th. Exactly. Lung cancer. It's not worth it. So hold on. Let me tie the garbage idea. Yep. I'm going to tie a bow on this real quick.  So you're in high school, you're playing lacrosse. And you and your now partner are star crossed lovers, the Montagues and the Capulets. You got Romeo and Juliet over here.\r\n\r\n\r\nYou didn't know it at the time. Get to college. You start this financial blog, gets you some really cool internships. You end up getting placed with the VP of marketing at Benjamin Moore paint company through a series of events, which I think is awesome. I think luck is when preparation meets opportunity.\r\n\r\n\r\nSo. I think you were like ready and primed for that opportunity.  But from there, your buddy transfers to your school. You thought you hated each other. Turns out. You guys are our bros now and through those connections, you start having conversations about  business, like for whatever reason he grew up rich, you grew up poor, but for whatever reason, you guys have this shared love or passion for business and building something.\r\n\r\n\r\nAnd so his dad and grandpa sit you down and say, Hey, here are some ideas.  Of businesses for you guys to start. Is that a good synopsis of kind of like, that's pretty much it. And he loves me as a teammate. He was like, cause I was like a defensive middie and in lacrosse, a defensive middie, you're like a goon in hockey. \r\n\r\n\r\nLike you have the toughest job on the field.  And he was a scorer on the lacrosse team, but he was like, I love you as a teammate. Like you're a great teammate. I want to do business with you. And then like halfway through my senior year, he was like, Commenting with all these ideas. I had job offers at Benjamin Moore and Financial Times.\r\n\r\n\r\nAnd that's what I thought I was done ho doing because up to that point, all of my people I looked up to were in corporate America or made their money from corporate America and exited. So to that point, that was everything to me. Corporate America was the path. Yeah, everything pivoted. Once I met my partner's dad and then my girlfriend's grandpa is also a wealthy guy.\r\n\r\n\r\nHe had a candy store, but his candy store distributed to all food marts and gas stations and whatnot, distributed all food to those places. He had a pretty big exit from that. What kind of candy?  Just like all different types of candy, real candy. All different types of like, yeah, like he, Hershey, he was doing cigarettes.\r\n\r\n\r\nLike he's had Marlboro,  yeah, but all sorts of like anything that's in the convenience store, he supplied. Okay. So like a good part of all of New York City, all of Westchester County, Rockland County, all over the lower part of New York. And yeah, so he took me under his wing and he was like, you got to do a business.\r\n\r\n\r\nLike, you're too smart for corporate America. I don't want you doing that. And he's like a grandpa to me now. Like my girlfriend's grandfather, like he's  my mentor. He gave me a ring, gave me a Rolex. Like he's an 85 years old and he's the man. He's still trying to figure it out. He gave you a ring?  Yeah, he gave me a ring.\r\n\r\n\r\nHe's an old school Italian. I come from an old school Italian culture. Like, I really come from an old school Italian culture. This guy loves me, and I love him. Like, it's, we have a really great relationship. Was he like, And, Bodhi! Welcome to the family! No, pretty much Don't screw this up! The story was like, She has six aunts and uncles, and we're all out to dinner at their beach house in New Jersey.\r\n\r\n\r\nAnd so there's 30 of us deep at a table, 35 of us. And he's like, I want you to have this  pretty much. Like I want you to have this,  like his wife was looking at it. My girlfriend's grandma was looking at the ring and she was like, guys, I want to make an announcement and you gave me the ring, like just for total craziness.\r\n\r\n\r\nLike I come from a really, it's. Italian background, he pulled you aside and he's like, if you ever heard my granddaughter, you'll wake up with a horse's head in your bed.  Pretty much.  And  that's amazing, man.  It's amazing.  It's amazing. But yeah, so pretty much like. Gone to his garbage business, bought out the company, 120, 000.\r\n\r\n\r\nOkay. So you bought it. We bought it out, right? We didn't start it for fresh. We bought it out, right? I'm a firm believer not to start a company at this point in the service industry. I think if you buy an existing company, you have a big edge there. So the guy selling the company to us, 65 years old,  he was just done.\r\n\r\n\r\nHe was losing it.  And he was like, I just want to sell this company. I want to move upstate. He had a bunch of land in upstate New York. He's like, I'm just done with this area. Yeah. We bought out the company old 2006 Ford F 750 with like 400, 000 miles, 20 beat up dumpsters.  All he had was a customer list and where all his dumpsters were at the moment in someone's driveway.\r\n\r\n\r\nSo I was driving around looking no books, no website, no Facebook, absolutely nothing. And when I sit down, sat down with my father and my partner and his father, like when we sat down, I was like, guys, I can blow this up. There's no doubt in my mind. I could absolutely blow this up in my market. Why, why did you think you could blow it up?\r\n\r\n\r\nThey had no website, no Facebook, nothing. And for the past four years of my life, all I was trying to do was build a personal brand on Instagram and online. That was like. This is easier than that. Like this will be way easier than that. How many followers did you get up to on Instagram? Instagram? I got all of the 3000, which is not that many, but my finance blog at 1200 subscribers on a new email newsletter.\r\n\r\n\r\nIt's fascinating though, because I know a lot of guys  and girls, mainly guys, cause that's who are in the entrepreneur world, unfortunately.  I know a lot of guys who like. Get some experience, cut their teeth one place,  and then they just go all in on something. Right. And it's like their experience, their track record wasn't that impressive.\r\n\r\n\r\nNick Huber's one of those, right? Like his track record. It wasn't that impressive. He started a moving company and maybe he had one self storage deal, but then all of a sudden he figures out his edge. And he's goes hard into commercial real estate. So it's not surprising to me that even though you didn't like blow up in these previous companies or things that you were doing, you had, you'd gained a lot of skill and knowledge and then you applied it to this company.\r\n\r\n\r\nYeah. I was playing a harder game to play in year one, where I knew I could succeed with the SEO business. I see this all the time. People want to start these companies in Austin, Texas, Dallas, Texas. And I'm like, dude, like the opportunities outside of those places.  Well, what's interesting is we don't operate in the same.\r\n\r\n\r\nSpace, right? Like you have a dumpster rental company. I have a tree trimming business. They're both in the home services business. I would say though, right? And the home services industries.  And I totally freaking agree with you. People want to focus on these primary markets, LA, San Francisco, Sacramento, these massive cities, New York.\r\n\r\n\r\nBut the opportunity is really in these like secondary and tertiary markets where it's like, okay, don't go to Dallas, go to McKinney or don't go to New York, go to Long Island or like people don't think about that because it's not as big and it's not as sexy. What's better about these secondary and tertiary markets, less competition, less sophistication, so much easier for them that they don't need to be sophisticated.\r\n\r\n\r\nSo you bring a little sophistication in. And you can crush the competition. Exactly what I did. That's literally exactly what I did, where my competition wants me to do marketing for them now, because they don't even understand that doesn't, that doesn't even make sense. They don't even understand it.\r\n\r\n\r\nThat's how behind they are. Cause like I'm like 45 minutes outside of New York city. How big was the company when you bought it? Revenue wise? Honestly, we didn't even look at books.  We took a shot. We took a shot in the, I love you buddy. Yeah, we didn't even look at books pretty much. Like I said to you earlier, I'm a cowboy.\r\n\r\n\r\nWhen I see an opportunity, I know I could seize it. I know I can seize the opportunity whenever I see one. Like  I just saw it and I was like, I can blow this up. I had the right people backed behind me where there was just no reason not to be able to blow this type of thing.  My market, it's tough to get a license in.\r\n\r\n\r\nYou have to know the right people. That's the great thing about the New York market in the dumpster space where places in Texas, like anyone can start a business there where my market, you need the right licensing and you need to have know the right people to get those licensing from your perspective, it wasn't a, it wasn't a thesis of like, ooh, this company's doing a hundred thousand, I could take it to 500,000.\r\n\r\n\r\nRight. You, or, or a thesis of like, okay, if we get five dumpsters per person, I know the geographic area and we've got this many, this is the population. Like it wasn't that you looked at it and you were like, old business, no website,  a commodity. That's like not going out of style. People are always going to throw away their. \r\n\r\n\r\nI'm in and my best friend's stepdad also owns the biggest business in our county, the biggest garbage business in our county. And my  girlfriend's half brother's father owned the biggest business in New York city. So for me, I'm going to have to like whiteboard this out. Like, okay. It's crazy.  I had too many connections where like, for me, it was just too perfect not to take this opportunity.\r\n\r\n\r\nLike, I knew we could just dominate pretty much like I just knew we could absolutely dominate the market. What I love about you and you know, this is us, you and I have known each other messaging, right? But we've never had a conversation, but I can tell in the first 20 minutes you're just the type of person you're earnest.\r\n\r\n\r\nWhich is sometimes a rare trait where you say what you mean. And I don't think there's anything behind it. That's like, Oh, what's this guy's real angle. And it gets people to like you quickly. Right? So all those people that you just mentioned, yes, you have a lot of connections, but you have a lot of connections because you're likable.\r\n\r\n\r\nYou're smart. You're hardworking. You're earnest. You're genuine. Like people, people just tend to be drawn to that stuff. And I, and you've  so far capitalized on that. It sounds like you're like, Oh, I know that I can exploit people, but you've capitalized on that in a way that has given you a lot of opportunity moving forward.\r\n\r\n\r\nAnd you're what? 24, 25. Yeah. I just turned 25. Dude, you may not feel young. And I always hated it when guys said this to me, but. You've got a very bright future ahead of you to just, anyways, I'll stop. But I'm not appreciating. Yeah. I love people. I love making connections. That's one thing I love doing. It's so needed, especially with the business that you hopped into, right?\r\n\r\n\r\nThis isn't a game where you're trying to differentiate yourself based on. Being smarter than somebody else  with home services, you're differentiating based on can you work harder? Can you close better than other service? Communication is everything in sales. Like, am I? There's a franchise in my market and I just love picking on franchises.\r\n\r\n\r\nI'm sorry for anyone listening. It was a big franchise guy. Because as a owner op, I could charge lower than them and still make the same margins. So something I did a lot was I would see franchise dumpsters in other people's parking lots and see parking lots, driveways, and see a roofer in those driveways, I would go right up to the roofer and say whatever they're charging, I'll be like, without an issue.\r\n\r\n\r\nNot even because I'm undercutting them, because I know I could.  Eat the price and still make what I want to make on each dumpster. Like I might, it's not a race to the bottom. People will tell me that, but it's not because I'm still charging the same price,  but these franchises just charge ridiculous fees.\r\n\r\n\r\nI know someone with a junking franchise and he gets killed on fees every month. So Chris and I, when we're looking at businesses have a couple of criteria that we use to judge whether or not we're going to invest.  And what the question we ask ourselves is, do we have an unfair competitive advantage in one of these areas?\r\n\r\n\r\nAnd so it's like, do we have a unfair competitive advantage in capital distribution expertise? And the fourth one is. \r\n\r\n\r\nYou being young have an unfair competitive advantage against these franchisers with time, right? Like you don't need to make a half a million dollars this year. You can go in and undercut and build your business because you've got a very long timeline and runway. And you were very smart about going in and advertising your services and saying you could undercut them.\r\n\r\n\r\nI know you didn't say undercut, but  yeah, you may or may not have known this, but you were just very strategic in the way that you were playing the cards you were dealt. And that was one of your strongest hands to play is that you have time.  Yeah, no, pretty much.  That's why my first crazy story, my first year in business, I only paid myself like 20 grand.\r\n\r\n\r\nAnd I remember putting all my money into the business and then going out to dinner with my friend and him being like, dude, like I was like, only have a thousand cash. He was like, I remember going to dinner with him in New York city and him feeling bad. He says, Holy shit. Like it's all the money you have right now.\r\n\r\n\r\nLike it was just craziness. And I,  It was just a total, but I knew I wanted to do that. Like I wanted to hit rock bottom and then build back up. And that's exactly what we did. I don't like competing against guys like you because you have nothing to lose. Like guys like me, I've got a house. They've got a mortgage, they've got kids, they're playing sports or they're going to college, right?\r\n\r\n\r\nLike they've got a lot to lose. And in many respects,  those are hard people to compete against as well. But when you're 20 something, you have no money anyways. Like  I could live on 10 grand  exactly on ramen and rice. It was, I was in my parents house for a long time. Like I was in my parents house till I was 24, which like I got out of there a couple of months ago, but  yeah, pretty much I had nothing to lose.\r\n\r\n\r\nI'm going to sound really old. Do you know that you're an outlier in your generation? Yes. A hundred percent, but I see that as opportunity because I know I'm not going to try to sound egotistical right here, but I know I can dominate a lot of other people in my generation just because I've been dominating.\r\n\r\n\r\nI'm a big Gary. I'm a big Gary V guy. And like me and my partner, Andy always say like, we got to eat shit no matter what. Yeah. I've let customers step all over me all the time, but I have to, I don't have a choice. And that's, what's crazy. I got in this business at like 21 years old. And And I'm dealing with 55 year old contractors that are just out of their minds.\r\n\r\n\r\nLike I'm collecting money. I'm owed like 15 K. I'm up at four o'clock in the morning. Like, Holy shit. I'm owed 15, 000 by 10 different people or like 20 different people. Like I got to collect this money. So that's just the accounts receivable is about 20 percent of the business at all times.  Have you ever met Gary V? \r\n\r\n\r\nNo. Oh, man. I got him. I want to meet him just so I can be like, are you on TikTok?  Are you doing content?  I can't. I've been listening to him. I was in marketing class and I was listening to Gary V. Like I was.  Did you listen to his My First Million episode you just did a week ago? No, I got to listen to that.\r\n\r\n\r\nSo good. I gotta listen to more podcasts. You got to listen to that episode. It's a really good episode.  Okay. I could go down these rabbit holes all day. Cause I just find it fascinating. I love meeting people and I just love hearing their backstory.  Let me ask you about the economics of the dumpster business. \r\n\r\n\r\nHow much does it cost you to acquire a customer? Free. Can't be free. My first two years in business, I spent about 45, 000 in Google ads, like 90, 000 my first two years. But at this point, I don't pay a dime to acquire a customer. My only form of marketing, really, it's all SEO. I only form of marketing now is SEO.\r\n\r\n\r\nAnd I have a Facebook manager, which is my girlfriend and she just posted Facebook groups for me. But otherwise I don't pay a dime for marketing at this point. And that's really what my biggest edge is in this business. What about like, do you look at your customers as like,  As having an LTV or have you not been in it long enough to know?\r\n\r\n\r\nIt's weird. I've had some customers for three years now, so it's weird to say an LTV because some customers are residential. Some customers are contractors. My ideal customer is a contractor. My ideal customer is a roofer. My biggest customer who I took from that franchise, who I actually do SEO for now, he does five roofs a week through me.\r\n\r\n\r\nAnd I found him from picking up the phone and calling him. Okay. So your customers may be homeowners, but they also may be, you know, contractors. I'm at a 75, 25 split from contractors to homeowners. What's the 75? What's the 25? 75 are contractors. 25 percent are homeowners. So if I lose a contractor, it doesn't happen often, but usually it's about pricing.\r\n\r\n\r\nAnd at the end of the day or sizes, you're not getting customers through SEO residential. You're going out and beating the pavement, meeting these contractors. That's why you're saying you you're driving around looking for roofing companies. Cause you're like, okay, cool. Yeah. Yeah. Potential customer, potential customer for exactly.\r\n\r\n\r\nAnd I'll call them right away or I'll text them right away. And with this customer, this roofing company, we're really good friends. Now. He's a couple of years older than me. I'm flying back to New York. I'm flying back to New York Friday for my KPI meeting, and I live in Florida now, part time. You probably already do this. \r\n\r\n\r\nYou need to talk to Chris, my business partner,  because you guys are very similar. But one of the things that we do, like we started this company called Repeat Leads and we ended up putting it on the back burner. But the thing that we did is we reached out to contractors in particular.  We got their phone numbers.\r\n\r\n\r\nI won't say how we got them. It was legal. And then through ringless voicemail jobs or text message campaigns, we got them to respond to us and they ended up being the best distribution channel for what we were trying to do at the time. Yeah. But I could see you're probably already doing this. I could just see you using that as a distribution channel to just blow up your business, right.\r\n\r\n\r\nTo just go out. If someone posts in a Facebook group was a contractor or next door, I'll just cold message them because I'm not afraid to do that. Yeah. I'll just pull up my gym, say, Hey, I'm Bodhi.  This dumpster company, if you need anything, please reach out. These are my prices. I only offer 10, yard dumpsters.\r\n\r\n\r\nA lot of people will say, Oh, you need 30, you need 40 yard dumpsters. People always tell that to me. The reason being is all my trucks are under CDL. My trucks are all 26. So you need a CDL to operate garbage trucks. But what's a CDL? I don't know. Commercial license. Oh, you need a commercial license to have like X amount of weight.\r\n\r\n\r\nSo what we do is like anything over 26, 000 pounds. Is a CDL truck. All my trucks are 26, 000 pounds and I can plug anyone in. I can train anyone in those trucks for a weekend where I get a CEO. If I do,  if I do need a CDL, you need a special license. It costs more money to pay the drivers. So I based my business off of a franchise called binmare dump that.\r\n\r\n\r\nAnd the reason why contractors like to work with me spelled, is it spelled B I N there B I N there dump that, which is amazing. Branding amazing name, great brand. And  my dumpsters can fit in all driveways. So that's how I actually like brand my business is like, we can fit in all driveways. No driveway is too tight.\r\n\r\n\r\nSo how do you charge? I, you said it at the beginning. So you have a drop off fee and that depends on the dumpster size and then it's by weight, right? Cause dump is going to charge you by weight. So I have contractor pricing and I have residential pricing. The dump charges where my town is very regulated or in New York waste management is very regulated there.\r\n\r\n\r\nSure. One 24 a ton for every single dumpster company has to get charged one 24 for a ton by the town. 120 or 1 and 20 cents.  124. Sorry.  I charge my contractors a 300 drop off fee plus one 24 per ton and price is determined on the weight. One ton is four 25, two tons is five 50. And then it goes up from there.\r\n\r\n\r\nHow did you come to your numbers? Were you like, Oh, I just want to have this gross margin. Or did you go and look at what the competitors were charging in that market? We started at 200 a drop off fee and we've gone.  Yeah, we've done 50 percent gross margins. Haven't had any pushback from there. But with my like homeowners, I'll charge them up to two tons.\r\n\r\n\r\nSo a 10 yard dumpster, I'll charge them five 25 up to two tons. Anything over two tons, tons. I'll charge that one 40 a ton. How much does a dumpster cost to buy? 5, 000 4, 500 just about that much. So let's say 5, 000, 5, 000 gets me how much tonnage for that dumpster? Five. You're saying how much to meet for me to buy it or for my consumer?\r\n\r\n\r\nNo, no, no. Just for, let's say somebody was like,  How do I start one of these businesses? I'm just like about 5, 000. So you 5, 000 for the dumpster, but you got to spend for the car obviously as well. So that's going to be, I don't know, 25, 35, 55, but it's not going to be like my truck's like 120, 000.  Oh my gosh.\r\n\r\n\r\nI was way off.  Okay. All right. How do you. Judge efficiency of the dumpster usage. The spiel that I tell everyone is you're going to start a dumpster business. You need at least a hundred thousand dollars and you got to buy a truck new. Don't buy an old truck. Some people will argue against that. I'm all about buying new trucks.\r\n\r\n\r\nOkay. Finance the truck because you can always make money with a truck. Sure. Never finance the dumpsters. If you're financing the dumpsters, that 5, 000 dumpster will turn into 6, 000 real quick. And if that dumpster is not making you money, it's sitting there and losing money. Okay. So that was going to be my question.\r\n\r\n\r\nHow do you judge efficiency of a dumpster? Right? Like if I own commercial real estate, I know what my occupancy is. How many flips I do per month? How many pickups I do for month? What's a good pickup for you on one dumpster? How many flips? Flip. It depends at this point. Cause I have 60 of them. I try to hit one 40 a month, one 20 to one 40 a month is what I try.\r\n\r\n\r\n140 flips. No, no. Like for all my dumpsters, not per dumpster. That'd be insane. Okay. Okay. Okay. So we're talking, let's see if you have 60 dumpers, dumpsters, 140. So we're talking two to three flips per month per dumpster is what I try to do. If I'm like Joe Schmoe, I buy a car, I buy a dumpster, I've spent 5, 000 on a dumpster.\r\n\r\n\r\nI'm hoping to get three flips a month of that dumpster. If you have one singular dumpster, you're probably, if you want to be profitable, you probably need three a week.  Really? It's a volume game, but I'm on the game. I'm playing now is on a monthly schedule.  Um, I'm not even worrying about my weekly schedule.\r\n\r\n\r\nI try to hit my monthly numbers. So if I'm trying to flip three times a week,  tell me really quickly, like what's the revenue I can generate from one flip on that 5, 000? Every market's different for my market, for revenue wise, for a homeowner, I'm looking at 525 for one flip. Okay, we're a contractor. I'm looking at 525 to 750 for one for it.\r\n\r\n\r\nOkay. So let's just say it's a homeowner 525. I do three flips a week. I'm at 1, 600 a month. I'm just gonna round up 1, 600 a week, excuse me, four weeks. So I'm generating around 6, 000, 7, 000 a month in dumpster income. But then I've actually, then I've got to go pay the dump. So what's my net on 6, 000 of dumpster income?\r\n\r\n\r\nI charged 525 to a homeowner. If a homeowner is just doing like a household clean out,  they're looking at one ton of debris. So my gross on that is one is 401.  If it's a homeowner or 10 yard dumpster, my gross in that is 401. And my net on that is probably around 325 to 300.  That's on a homeowner. Okay, so on a contractor, my net is more of like 200 to two 15.\r\n\r\n\r\nLet's just stay with the homeowner example. You're let's, and I'm gonna say 300, just to make it easier. You're netting 300 and you're doing. 12 of these, is that right? Four weeks, three times a week, 12 of these a month. So 3, 600 net is what's your,  is what you're netting. But then from that 3, 600, you've got to pay your truck,  um, note, which is probably going to be in the range of, I'm just going to guess like 1, 500 to 2, 000 a month.\r\n\r\n\r\nSo then, so then you're going to, so  backing out of that from the 3, 600, you're down to 2, 000.  But then obviously you got to pay yourself, you got to do a bunch of other things. So like the 2000 isn't terrible, but let's just say you net out 1, 000 a month after a lot of the capital. That's not terrible. But to your point, it's a volume game.\r\n\r\n\r\nIf you're going to get into it, you got to buy a couple dumpsters. Yeah, you have to. Last year we did 750, 000 in revenue and our net was about 98, 000 off that after paying myself after all expenses and whatnot, we netted like 98, 000. Which is, I paid myself about a hundred thousand last year, give or take, it's pretty good gross profit, like last year net profit.\r\n\r\n\r\nWhat are your plans with this business? What do you want to do with it?  I don't know. Grow it? Scale it? Yeah, at this point, like, my partner's in New York, I am in Florida. He's more of like an operating partner, where I'm more on the back ends, and I'm in Florida for six months on one day. And he's in South Carolina for six months and one day, pretty much.\r\n\r\n\r\nWe're just like flipping the game. We're playing the game, flipping back and forth, but we have a good office lady in check and we have reliable workers and without his dad, we couldn't do any of this.  Why? What does that mean?  His dad lets us use his yard. His dad has a lot of. Connections within our county, we have, I have big edge in this business.\r\n\r\n\r\nI am competitive advantage. I'm I have an unfair competitive advantage. I for sure do. And his dad is the best. Like he's one of the greatest people I ever met and he will do anything for us if needed. And he's a great mentor of mine. I can go to him for anything. Like, even if. I ended up in jail and for some, and the night I could call him and I know he'd be like, Oh, what the hell Bodhi, but you would help me out. \r\n\r\n\r\nAnd that's just, we've built that relationship like where for us, we're pretty rock solid on that side of things. And we all trust each other and can do whatever we need to make it successful. That's awesome. He's like Bodhi. Why did you fight that officer? Yeah, yeah. He's like, Oh, I'm friends. I'm friends with that officer.\r\n\r\n\r\nLike, come on, buddy.  Let's end this with some rapid fire questions.  What do you love about this business?  It's semi passive. It's not fully passive because nothing's fully passive. But at this point, I had a lady answering the phones. I have someone doing all the drop offs and pickups for me. It's a semi passive business and the barrier of entry is high, which I like because less competition.\r\n\r\n\r\nWhat do you hate about it?  What I hate about it is accounts receivable is a pain in the ass.  That's like 90 percent of my time goes to my SEO agency. Honestly, 10 percent of my time goes to my dumpster business at this point and that 10 percent is just accounts receivable. Where's my money? When am I getting paid?\r\n\r\n\r\nWhat keeps you up at night?  My driver crashes.  My driver crashes  and we get sued. That keeps me up at night, but that's just the game we play.  Okay.  What are you obsessed with right now? Growing an online presence is what I'm obsessed with right now. You're doing a great job. Building my personal brand on Twitter is what I'm obsessed with.\r\n\r\n\r\nBut I'm also just obsessed with internet marketing. Like I love connecting with people on the internet, meeting new people on the internet, seeing what drives traffic to websites.  Like I'm overly obsessed with marketing. That's why I like having a dumpster business because anything I learned online or learned in the past, I just practice on that company and see what works and what doesn't. \r\n\r\n\r\nDude, that's a really interesting way to look at it. And Chris and I feel the same way.  Where we're like, we have these businesses that we can test ideas on, which is fun, right? So that anything else new that comes our way, we can apply those learnings. That's a really cool idea. Real estate guys are really jealous of business guys because they're like, Oh man, it must be nice to have a business.\r\n\r\n\r\nThey could scale. They could go to other markets. It's capital light. And business guys are usually really jealous of real estate guys. Cause they're like. It must be nice to have that real estate. What industry are you most jealous of right now? That's so funny. I have a mentor of mine who's big in real estate and triple net leases, and he loves the garbage business.\r\n\r\n\r\nI love what he does.  What I'm jealous of right now, I don't even know. What I'm trying to do right now is to get my stock portfolio to a million dollars. That's all I really want to do is get my stock portfolio. End of this year, I'm planning to get to 500 grand in my stock portfolio. Yeah, like real shit.\r\n\r\n\r\nThat's what I'm only thing I'm interested in and there's nothing else. I'm really, I'm not interested in real estate right now. I have a condo in Florida that I live back and forth in, but I don't see edge in real estate at this moment and I'm not going to even play that game.  Oh my gosh. All right.\r\n\r\n\r\nHere's my last question. What advice would you give yourself five years ago? You not other entrepreneurs, you like, what advice would you tell yourself five years ago? Believe in yourself. It's pretty much it.  Like, I love it. That's just believe in yourself because you can do it. And like growing up.  The way I did, I was always not the smartest thing, like academically, but it doesn't matter how smart you are.\r\n\r\n\r\nLike you will make money no matter what you do. If you just put your head to it.  This was, this was awesome, man. Thank you so much for where can people find you? What's the name of your company? You can find me on Twitter at I ran dumpsters and you can find my marketing company at striker dash digital.\r\n\r\n\r\ncom. I can't disclose my garbage company because nasty SEOs have attacked me. I've got a ton of one star reviews from just posting on Twitter. So I gotta be very careful out there. And there's a lot of jealous people, unfortunately. Well, man, I'm a future's bright for you. Can't wait to continue to watch.\r\n\r\n\r\nYour maturation. This is awesome. Thank you. There's a lot of fun. All right. That's it. Another one for the books. I'm fired up. I don't know what else to say. I hope you found something valuable in that conversation. I hope you learned something. I hope there's something that you can apply to your business today, tomorrow in the future that.\r\n\r\n\r\nIt makes you money. It makes you more successful. It gives you more time with your kids. If there was something I'd love to hear about it in the comments below, give me some feedback. And if you like actionable advice and you want more of this, I write a weekly newsletter that gives insights, tips, and tricks into the world of entrepreneurship.\r\n\r\n\r\nSubscribe in my bio.  And if I can help you in any way in your entrepreneurial journey, don't hesitate to reach out to me, Nick at cofounders. com. Sorry, Kelly, for more emails. And the last thing is. Remember,  curiosity is a superpower and you can use it to your advantage. As my mom used to say, there's no such thing as a dumb question. \r\n\r\n\r\nOnly dumb people.  We'll see you next time.",
  "metadata": {
    "duration": "",
    "date": "2024-07-01",
    "platform_source": "Google Drive"
  }
}