{
  "episode_number": "118",
  "episode_title": "How to Start a High-Profit \"Convenience\" Business (That's Not a Scam) with Chris Koerner",
  "guest_name": "Chris Koerner",
  "business_name": "Pest Control",
  "transcript": "﻿Chris Koerner (00:01.838)\r\nYou want to start us off?\r\n\r\n\r\nLet's do it.\r\n\r\n\r\nNikolas Hulewsky (00:06.721)\r\nAll baby. So I know we're on an AI kick right now. I'm going to start with a non AI kick. And because I talked to somebody this week on my podcast, Nickonomics, this freaking an incredible conversation. I had a conversation with the pest control guy on Twitter. I think you've met him before. I can't remember. But Casey. Yeah, it was close. It was close. Anyways, let me just make sure my mic's correct. Yeah.\r\n\r\n\r\nChris Koerner (00:23.768)\r\nCorey?\r\n\r\n\r\nCasey, I haven't met him in person, I see him.\r\n\r\n\r\nNikolas Hulewsky (00:36.865)\r\nDude, you and I are LDS, we're Mormons. So we've grown up around sales bros. Solar, roofing, windows, pest control, alarms, all of that, right? Because we come back from our missions and it's like, I have a skillset. I have a very particular set of skills. We know how to knock doors and get rejected. And so it's like, you go to these door to door and you become door to door sales bros. Did you ever do summer sales?\r\n\r\n\r\nChris Koerner (01:01.037)\r\nMm-hmm.\r\n\r\n\r\nYou act like we haven't been best friends for 17 years. You don't know my life? No, I don't do these fake questions. Let's do real questions. Okay?\r\n\r\n\r\nNikolas Hulewsky (01:06.069)\r\nI'm teeing. I'm teeing you up, bro.\r\n\r\n\r\nYeah\r\n\r\n\r\nNikolas Hulewsky (01:15.199)\r\nI never did summer sales either, but we've obviously had friends who've done summer sales and they've done exceptionally well. I remember guys.\r\n\r\n\r\nChris Koerner (01:22.306)\r\nSometimes, I have a lot of friends that didn't do well.\r\n\r\n\r\nNikolas Hulewsky (01:25.589)\r\nBut the guys who do exceptionally well that do it year after year after year, they'll go and they'll sell for the summer and they'll make like 300 grand. Something ridiculous. anyways, we both been infatuated by this business model, but we've also both kind of stayed away from it because we feel gross about it. Am I right? Is that fair? Okay.\r\n\r\n\r\nChris Koerner (01:30.242)\r\nMm hmm. Yeah.\r\n\r\n\r\nChris Koerner (01:45.12)\r\nyeah. Cause there's a, there's a direct correlation between the, much money a sales guy makes and how slimy he can be.\r\n\r\n\r\nNikolas Hulewsky (01:55.775)\r\nYes, well, I would say that's my perception.\r\n\r\n\r\nChris Koerner (01:56.864)\r\nIt well, there are exceptions, but I think that the rule is the more money you make in sales, the kind of more you flirt in the gray area. And there are exceptions that are very ethical men and women that do really well at sales. They're very forthcoming and ethical, but I think there are outliers and exceptions personally.\r\n\r\n\r\nNikolas Hulewsky (02:15.699)\r\nInteresting. You're saying sales in general. So would you say the stuff that you do is very grey hat? It's just different.\r\n\r\n\r\nChris Koerner (02:21.538)\r\nWhat do I do?\r\n\r\n\r\nNikolas Hulewsky (02:23.777)\r\nI mean, scraping lists of people who didn't opt in to have their texts notified, ringless voicemail drops, emails that aren't publicly available that you figured out a way to get, right? People would look at that and be like, that's not ethical.\r\n\r\n\r\nChris Koerner (02:34.883)\r\nYeah.\r\n\r\n\r\nChris Koerner (02:38.968)\r\nYeah, I think that's great.\r\n\r\n\r\nNikolas Hulewsky (02:40.897)\r\nBut wouldn't, that's interesting, I wouldn't put those in the same category. I don't know why I feel grosser when it's like a guy who's at the door, hard selling a single mom. You know what I mean?\r\n\r\n\r\nChris Koerner (02:52.618)\r\nYeah, no, I definitely agree all else equal the door to door sales guys are much slimier than an average sales guy. But I'm just saying in general, like a car sales guy or a core sales guy, like the more effective they are, like they're persuasive, they're convincing, they're tactical and like, that just gets in the gray.\r\n\r\n\r\nNikolas Hulewsky (03:08.105)\r\nRight, right, right, right.\r\n\r\n\r\nOkay. Well, I went off on a tangent there. thought that was, for those of who've done summer sales, we're sorry for offending you. Anyways, Casey did summer sales. He worked for this company. He did summer sales. And in his first year, he made like a hundred grand in three months. He was like, holy crap, this is amazing. He told me there's guys who make seven figures doing summer sales, which blows my freaking mind. I don't know what they're selling, but they're making a lot of money. So he saw the inside, he saw the economics of that business and he decided to start his own pest control company.\r\n\r\n\r\nI want to tell you the economics of the business because I don't know if you've ever, I'm sure you have, but I don't know how much you've dived into this. It blew my mind. Are you ready?\r\n\r\n\r\nChris Koerner (03:50.36)\r\nFirst you asked me if I've done summer sales, then you asked me if I know anything about pest control when I literally worked that job for four years. Selling? No. Pest control? Yes.\r\n\r\n\r\nNikolas Hulewsky (04:00.287)\r\nI asked you if you the economics. didn't ask you if you knew about the business. All right, so here we go. Here we go. The average customer, they have them on this like yearly maintenance program, right? It's pretty normal. So if I'm a customer and I'm like, I have pests. I need to have my house sprayed. I don't want spiders and ants and scary things. They can do some upgrades. They'll do rodents. They'll do whatever else, but I'm just talking about strictly pest control. Every quarter, I want you to guess how much a customer pays them.\r\n\r\n\r\nChris Koerner (04:04.034)\r\nYes, anyway.\r\n\r\n\r\nNikolas Hulewsky (04:30.005)\r\nfor that quarterly maintenance.\r\n\r\n\r\nChris Koerner (04:30.348)\r\nMm. It's like 180.\r\n\r\n\r\nNikolas Hulewsky (04:34.017)\r\nWell, $134.25 is what an average customer pays him. right. So what are they paying them for? They're paying them for a treatment. So the guy goes out, sprays around the house. How long do think it takes for them to spray around the house?\r\n\r\n\r\nChris Koerner (04:48.696)\r\ndid this four summers in a row took me about three to six minutes.\r\n\r\n\r\nNikolas Hulewsky (04:54.111)\r\nOkay, so Casey told me 20, but three to six minutes, even better.\r\n\r\n\r\nChris Koerner (04:57.73)\r\nWell, including drive time, like I would think it averages out at 20 if you include, if it's, cause I would, I would clock in and I'd get a route for the day. You're doing these 23 homes. And so if I were to take the hours I work divided by 23, it'd probably shake out to 20 minutes, but most of that is drive time.\r\n\r\n\r\nNikolas Hulewsky (05:06.903)\r\nMm, okay.\r\n\r\n\r\nNikolas Hulewsky (05:14.113)\r\nOK. Did you do any like, he said they do like some cobweb cleaning, they do some like, I'm saying like light maintenance, maybe something inside. Did you do the same thing?\r\n\r\n\r\nChris Koerner (05:19.043)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (05:22.956)\r\nWe would do that just as like a sign of goodwill, but it wasn't like strategic or anything.\r\n\r\n\r\nNikolas Hulewsky (05:28.929)\r\nOkay, so you're an hourly employee making 20 bucks an hour, and I'm just gonna say it's 20 minutes. All right, so about a third. So it's about $7 in labor, and then $4 is what he estimated for the chemicals. So if you just do the math, boop, boop, boop, boop, boop, boop, boop, boop, boop, boop, boop, boop, boop, boop,\r\n\r\n\r\nChris Koerner (05:57.218)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (05:58.529)\r\nThen after that, once a business is stabilized, there's not a ton of administrative costs. These are like 40 % net margin businesses. And they can expect 30 % year over year growth while still maintaining a 30 % net margin. So they're insanely profitable, insanely profitable. And he told me about these companies that will come in and they'll either buy a business, but most of the time they don't buy a business. They'll come and they'll say, hey, we're going to hire a sales team.\r\n\r\n\r\nChris Koerner (06:05.304)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (06:12.184)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (06:28.009)\r\nWe know it's going to generate X in sales. We're willing to pay you 1.3 times first year's sales in order to do that. So there are these like professional sales crews. They're just like mercenaries. They go out, they go and get business. Let's say they generate a million dollars in business. The pest control company, these large pest control companies will pay them $1.3 million. They're out. And then those customers stay on forever because the lifetime value of these customers is so long and they are very sticky.\r\n\r\n\r\nChris Koerner (06:55.032)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (06:57.771)\r\nSo anyways, okay, what?\r\n\r\n\r\nChris Koerner (07:00.296)\r\nI just have so much to say. I'm so glad we're talking about this. okay. I'm sitting up in my chair. First of all, I agree. The lifetime value of these customers can be very long. And in Casey's case, probably are because he's doing a good ethical job at selling them what they actually think that they're getting. But I had a long conversation with Matthew, our friend who does this every summer about the LTV of customer. Go ahead. He sells it. Yeah. And he said that\r\n\r\n\r\nNikolas Hulewsky (07:22.347)\r\nYep, He does pass control or does he, did he just, okay, okay.\r\n\r\n\r\nChris Koerner (07:30.274)\r\nthe shadiest companies do the most sales and their LTV is the worst. They will have cancellations out the yin-yang because they're promising whatever they need to promise. Like just outright lying to the customers just to get them to sign on the dotted line and then three, six months later, half have churned. But if you do it right, like Casey probably does, the LTV can be amazing, the lifetime value.\r\n\r\n\r\nNikolas Hulewsky (07:35.744)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (07:49.621)\r\ninteresting.\r\n\r\n\r\nNikolas Hulewsky (07:54.189)\r\nso if you go out and just hire these mercenaries, they're like, whatever, I'll sign up anybody and everybody because I'll get 1.3X of whatever I sell in the first year. They don't care about the fulfillment side of things.\r\n\r\n\r\nChris Koerner (08:02.412)\r\nYeah, cause yeah, and a lot of these, there's like three to five nationwide companies that sell pest control and some have a good reputation. Some have a bad reputation. The bad reputation is don't buy those contracts. Like if you're Terminix, you don't want to buy from X, Y, or Z company because the multiple stinks because they churn so fast. So it all comes down to how ethically you sell them at the door.\r\n\r\n\r\nNikolas Hulewsky (08:20.769)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (08:26.313)\r\nWhen you say there's five companies in the country that sell pest control, are you talking about the Termin-X or are you talking about those hired guns that\r\n\r\n\r\nChris Koerner (08:29.568)\r\nMm hmm. Mm hmm. I'm talking about like the guys out of Utah that are building multimillion dollar businesses. They're just building a book of business door to door. engineered to sell to a big pest control company never intending to actually service those contracts.\r\n\r\n\r\nNikolas Hulewsky (08:35.425)\r\nYeah, yeah\r\n\r\n\r\nNikolas Hulewsky (08:47.413)\r\nYeah, and like those guys are just constantly looking for new assignments, right? Like constantly looking for new markets that they're opening. Like that is just their whole thing. They're just going and they're selling cold. Here are a couple other things that I found really interesting about it. Casey was saying, if you're an investor and you want to get into the space, you could just go and say, hey, I'm going to invest a million dollars and know that that's essentially going to get you about a million dollars worth of business. But because it's sticky,\r\n\r\n\r\nChris Koerner (08:52.355)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (09:17.537)\r\nyou're essentially spending a million dollars to get a business that has like $2 million of enterprise value. Yeah, not just receivables, but it's like, okay, I built the business. I spent a million dollars. got, let's just say, a million dollars of business. It's 40 % net margins. I'm getting $400,000 a year in cash flows. Five times cash flows is a $2 million business, right? Like that's just generally how they're.\r\n\r\n\r\nChris Koerner (09:26.582)\r\nReceivables, yeah.\r\n\r\n\r\nChris Koerner (09:45.442)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (09:46.877)\r\ntheir value. So I thought that was interesting from like an arbitrage standpoint. The other thing I thought was interesting is there are whole businesses, and I didn't realize this, of guys who just rent out their licenses. So in order to spray these chemicals, you have to do it under somebody who's licensed. And in order to be licensed, you have to have done it for a certain number of years and then pass certain tests, right? And then guys who have done that, they don't even do it anymore. They just supervise it they sell their license to the companies that are getting up and running. So\r\n\r\n\r\nChris Koerner (09:59.427)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (10:11.64)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (10:16.743)\r\nA, I thought the business model was super interesting, but B, I thought this idea of finding professionals who have specialty licenses, could be a contractor, could be pest control guys like this in the skilled nursing facility world, they hang licenses on the walls well. And then working as a marketplace or a middleman to place the licenses with license demand. Now, I hate marketplaces, but I thought this would be a really interesting idea for somebody who's very ingrained in a specific space that knows about licenses.\r\n\r\n\r\nChris Koerner (10:39.512)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (10:46.603)\r\njust working as the broker between the demand and the supply side. What do think?\r\n\r\n\r\nChris Koerner (10:48.206)\r\nMmm.\r\n\r\n\r\na great idea and then just take a cut. It's almost like equity, right? Like I need 10 % equity in your business and you're gonna I'm gonna hang my license with you. Then the broker could say, All right, if that 10 % you you have, have 3 % or just give me 30 grand today. Right? And I'll connect you\r\n\r\n\r\nNikolas Hulewsky (11:05.739)\r\nYeah, because like I asked Casey, I was like, hey, how did you find your guy? He's like, he was a family friend and we just had some conversations. It was just somebody he knew somebody, right? But how many companies are there who like they want to start up and they don't they don't even know where to find somebody like this or the other end of the spectrum. Guys who have these licenses, maybe they're not. Maybe they're an owner of a pest control company or maybe they're not doing it anymore. It's like there's still value there. They could be supervising and getting paid something for it. But but they don't know who to go place it with, right? Like you could be.\r\n\r\n\r\nChris Koerner (11:13.485)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (11:30.892)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (11:34.981)\r\nAnd I think you can rank for this pretty easily through either programmatic SEO, mainly programmatic SEO is my idea, or if you wanted to spend a lot more money, go to like paid ads. But I think programmatic SEO would be the place to start and just focus on those keywords and those specific markets of like that you know it's going to rank.\r\n\r\n\r\nChris Koerner (11:50.979)\r\nYeah.\r\n\r\n\r\nSo the regulations to start a pest control company vary by state, but in Florida, it's so funny, because you and I have talked about this a lot. Danny was my boss in the pest control business. It was called Quantum Pest Control. He sold the Terminex while I was working there. Like I was there as they were doing due diligence. They were going through all the tickets. Like I cut my small business teeth in this industry. And I just like smile thinking back on it, because I had no idea at the time how transformative it would be on my life. But I just remember driving around in this, this wrap truck asking like,\r\n\r\n\r\nHow do you sell contracts? Like what are they paying per contract? How much? And I wasn't using these terms. I didn't know these terms. They're like, what was your churn like? Like what was the LTV? Asking all these things in very ignorant ways. And in a way, like these questions were, I found these questions interesting since the day I was born, right? But that gave me like a fertile playground to learn and ask these questions. And then in my twenties, I actually got to start doing those things myself. So Danny's partner was named Glenn and\r\n\r\n\r\nGlenn had no operational role in the business, but he graduated from the University of Florida with an entomology degree, which is like bug sciences. And in Florida, at least as I remember, you had to have an entomology degree to launch a pest control business. Because I remember asking Daniel, I'm going to start one these when I get out of college, he's like, it's not that easy. Like, there's a lot of barriers to entry, etc. And that's exactly what you're talking about with the licensure requirements. So that's interesting. And then I'm you're talking about the margin on the actual\r\n\r\n\r\nchemicals and he said $4 and I bet you anything it's like way less than that. He just he didn't want it to sound I'm speaking for him. I could be wrong. He didn't want it to sound because he's in the industry. You know, there's some conflicts of interest but as someone who's not in the industry, this is what I would do. This was my job. I was 16 years old. I had a Chevy s 10 and every morning I would I would go to Ted's diner in Ormond Beach. I would eat. would have a\r\n\r\n\r\nNikolas Hulewsky (13:30.911)\r\nRight, right, right, right.\r\n\r\n\r\nChris Koerner (13:50.446)\r\ncountry fried steak covered in gravy with two cans of Coke with all the pest control guys and Danny. Then we go to the office. We'd have our morning meeting. We talk about all the tickets for the day. And then I would get like a stack of tickets. There's like 10 to 15 of them, uh, like the carbon copies. And I'd go in the truck and I had a physical map. Like there was no Google maps, right? This is 2000, like summer of Oh three, Oh four. I had this physical map and I would drive all over new Smyrna beach, Daytona beach, Ormond beach.\r\n\r\n\r\nNikolas Hulewsky (14:12.065)\r\nyou\r\n\r\n\r\nChris Koerner (14:20.216)\r\nHolly Hill and just service these accounts and I'd roll up and these guys, I had the same amount of tickets as like the 40, 50, 60 year old dudes, but I would finish by like 11 a.m. or noon and then like go home and play NCAA football, right? I got paid, Nick, I got paid $5 an hour, $5 an hour, below minimum wage. I was not licensed, I was not on the books.\r\n\r\n\r\nNikolas Hulewsky (14:41.995)\r\nTo spray?\r\n\r\n\r\nChris Koerner (14:49.23)\r\n$200 a week, 40 hours a week. And then I got my meals paid for biggest ripoff ever, but honestly not based on how much I learned, but this was my whole job. This was my job. This is it. Okay. You talking about all these different bugs. This is Florida, more bugs than anywhere on the planet. I had a metal can with like a manual pump. There was like a one, a one gallon can. And I had picture like, like a protein powder container, a small or like a supplement container.\r\n\r\n\r\nNikolas Hulewsky (15:10.016)\r\nYeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (15:17.195)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (15:19.436)\r\nIt was like that, maybe like 16 ounces of powder with a scoop. And I would roll up to a house, open the can, go up to the customer's hose, fill it up with water, scoop one scoop per can, shake it like this. You know, it's really hard to shake. And then I would manually pump it and I would just go, I would just hold the trigger and walk around the perimeter of the house once and then leave. So tell me how long it takes to walk around a 2000 square foot house. That's it. That was the job.\r\n\r\n\r\nNikolas Hulewsky (15:47.553)\r\nDude, do you ever do you ever like think about not just this instance, but any instance where it's like, that powder could have been nothing. It could have been flour for all you know. And you wouldn't spray around that like you could see a business owner being like, Oh, we don't need this much. The people don't even know any ways. I think they're gonna get their bug sprayed. Jokes on them. You know what I mean? Just like trying to save costs.\r\n\r\n\r\nChris Koerner (15:49.346)\r\nGo ahead.\r\n\r\n\r\nChris Koerner (15:57.324)\r\nYeah. Yeah.\r\n\r\n\r\nChris Koerner (16:06.69)\r\nYeah. Yes. And I remember going to Danny and I was like, after a month or two, I was like, Danny, this is this all I'm doing? Did you give me like the easy job or is this what everyone's doing? Like we're just talking like, you'd think that like, I have a whole toolbox full of different powders. I'm like, you're seeing you're seeing banana spiders, I'm going to use this like a whole recipe. And it's like, I had one ingredient.\r\n\r\n\r\nNikolas Hulewsky (16:21.12)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (16:29.301)\r\nYeah, yeah, yeah.\r\n\r\n\r\nMm. Mm.\r\n\r\n\r\nChris Koerner (16:35.694)\r\nand a can of water. And I remember asking, he's like, yeah, that's it. And then I went to my coworkers and I was like, is this really, is this the whole shtick? And one of my coworkers, he was like, listen, man, pest control is a scam. Okay. I'm just going to say it. It's a scam. Like this is just a scam. This thing that we're spraying, you can buy a Home Depot. Anyone can buy it at Home Depot. And I never forgot that sentence, pest control is a scam. And that's like from the quote inside. And so I tweeted about this like six months ago.\r\n\r\n\r\nPest control is a spam scam. Go buy spectro side for 997 at Home Depot. Spray your house once a year and you're good. And like Casey got super triggered by that. He quote tweeted me all these reasons why I'm wrong and I'm ignorant and insurance and all this. But like 95 % of the comments and there were hundreds of comments were like, yeah, it's a scam. This is exactly what I do. I haven't seen a bug in years. So it's like there are outliers. There's like, well in this area and that area, sure, they're outliers, but by and large, that's all I do.\r\n\r\n\r\nNikolas Hulewsky (17:15.713)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (17:35.02)\r\nand it works.\r\n\r\n\r\nNikolas Hulewsky (17:35.297)\r\nYou know, maybe this is a framework as well. Many businesses are a scam. Like I go to Mc... Yeah, yeah, like I go to McDonald's. Right, but like the point I make, I go to McDonald's. Well, you could just make your own food at home. Yeah, that's true. Or, I mean, this is more of a scam. The water filtration systems in your house where it's like, oh, here, let me test your water. Oh yeah, you got arsenic. Oh my gosh. Do you love your kids?\r\n\r\n\r\nChris Koerner (17:42.006)\r\nIf you're looking at scams with this framework, I agree, right? Like it's not actually a scam, but right.\r\n\r\n\r\nChris Koerner (18:00.878)\r\nMm hmm. You have cancer right now. wow. Yeah, right now you just got it. Here to take a sip of your water real quick. Yep, now you have cancer.\r\n\r\n\r\nNikolas Hulewsky (18:05.247)\r\nYou have it right now.\r\n\r\n\r\nBut like how much.\r\n\r\n\r\nNikolas Hulewsky (18:13.205)\r\nHow many businesses are there that are quote unquote scams? But like basically we're assigning scam to something that is a convenience business where you could do it yourself, but you decide to pay for somebody else to do it, right? Like pest control, you could do it yourself, but you pay for somebody else to do it once a year because of the framing. Well, are you licensed? wow. Do you even know what kind of bugs are around here? I saw some. Exactly.\r\n\r\n\r\nChris Koerner (18:32.643)\r\nMm-hmm.\r\n\r\n\r\nYeah. Yeah. You're buying peace of mind. You're buying a third party support and a quote expert. Yeah.\r\n\r\n\r\nNikolas Hulewsky (18:42.625)\r\nExactly. So in a strange way, I think that's an interesting framework to look at and think, okay, what kind of businesses are there that are convenience businesses? Because those can get probably spun up pretty quickly, make some really good money. Dude, I talked to a lady yesterday, Christmas lighting. She started it. She's a hustler. Year one, she starts it in August on November 30th.\r\n\r\n\r\nThey had $150,000 in the bank. And she was like, wait, wait, what? And she ran this business for 13 years. It became an eight figure business. And she ended up selling it and like it did exceptional well, even when it got to scale, was doing like 30, 40 % net margins. But that's a convenience business, right? And she focused on where the convenience demand would be the strongest. She went to like very wealthy areas. She was like, yep, I went to the best neighborhoods. I looked at the best houses. I literally parked my van in those neighborhoods. It was in San Francisco.\r\n\r\n\r\nChris Koerner (19:15.534)\r\ncrazy.\r\n\r\n\r\nChris Koerner (19:25.304)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (19:39.329)\r\npark my van in those neighborhoods. It was free advertising. I placed flyers on every single door. And guess what? When Mary Jane down the street started getting her lights up and her neighbor comes out and is like, Mark, Mary Jane's putting up her lights. I think we should put up our lights. You know what she's like? It was. She's like in retention was 85%. She's like the business just grew every single year and it was high margin, but it's it's a it's a it's a business that is not maintenance. What's the word? Nice to have.\r\n\r\n\r\nChris Koerner (19:46.755)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (19:53.23)\r\nThose are so cute!\r\n\r\n\r\nNikolas Hulewsky (20:09.013)\r\nRight? Like we're talking about with pest control.\r\n\r\n\r\nChris Koerner (20:09.024)\r\nMm hmm. It's a vitamin, not a painkiller.\r\n\r\n\r\nNikolas Hulewsky (20:13.958)\r\nis that a framework? I've never heard that before. Huh, anyways.\r\n\r\n\r\nChris Koerner (20:16.45)\r\nHmm. Hmm. But like, yeah, the word scam gets clicks, right? Like that it's salacious, but like it's not literally a scam. like I would, I would hire a pest control guy to come get a raccoon out of my attic, right? I wouldn't pay him 150 bucks a quarter to do something I can do almost for free.\r\n\r\n\r\nNikolas Hulewsky (20:23.137)\r\nFor sure.\r\n\r\n\r\nNikolas Hulewsky (20:37.013)\r\nNo, that's like, feel like that maintenance is like the high margin upsell for having to do the crappy stuff of like, come get the snake out of my house. You're like, okay, I'll do that at cost, but I'm freaking, I'm charging you an arm and a leg. Cause I hate snakes.\r\n\r\n\r\nChris Koerner (20:40.845)\r\nYeah.\r\n\r\n\r\nChris Koerner (20:47.201)\r\nRight.\r\n\r\n\r\nChris Koerner (20:52.888)\r\nHere's a, I mean, you mentioned Christmas lights. I got a little side hustle idea for anyone out there. You ready for this? Okay. You heard of Jellyfish Lighting? Jellyfish is a, I don't know, eight or nine figure brand, and it's a franchise, and they sell permanent lighting through franchisees that own territories across the US. Permanent, yeah, it's like, it's not permanent Christmas lights, because you can use them year round, but it's an alternative to Christmas lights that stay up year round.\r\n\r\n\r\nNikolas Hulewsky (20:56.929)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (21:13.217)\r\npermanent lighting of what?\r\n\r\n\r\nChris Koerner (21:22.766)\r\nthat are led that you can control with your phone. can change colors. They can do patterns, you know, on St. Patrick's day, you make them green Valentine's day, make them red. It's growing in popularity and it's cost like 1500 to $3,000 to get them installed, but you never take it down. So really it's an, it's an investment in your future because you say you save money.\r\n\r\n\r\nNikolas Hulewsky (21:32.201)\r\nInteresting.\r\n\r\n\r\nNikolas Hulewsky (21:40.705)\r\ntrue. You're just adding $3,000 in value to the house.\r\n\r\n\r\nChris Koerner (21:44.674)\r\nWell that and you don't have to pay $400 to the Christmas light guys every year. So after five years you break even right? This is a good deal. No, but seriously like anyone listening to this jellyfish is going to hate me for saying this, but you can find the equivalent.\r\n\r\n\r\nNikolas Hulewsky (21:52.961)\r\nGood point. Good point. Good point.\r\n\r\n\r\nNikolas Hulewsky (22:35.905)\r\nThat's a pretty cool sales channel. Yeah.\r\n\r\n\r\nNikolas Hulewsky (22:45.215)\r\nYeah. Especially when you've hired a company because many times those Christmas tree, I keep saying Christmas tree, the Christmas lighting companies, they do install some hardware on your house so that when they come the next year, it's just way easier, right? Like they're not just hanging the lights and then taking everything down. They're putting in some type of an impish. I don't even know what I would call it, but some type of infrastructure. What?\r\n\r\n\r\nChris Koerner (23:01.102)\r\nand you'll never have to pay $500 every Christmas ever again. You're fishing. It's great because you're fishing where the fish are you know that those people value lighting on their homes. They're probably going to 85 % chance as you said Nick that they're going to do it again next year. There you go.\r\n\r\n\r\nNikolas Hulewsky (23:16.693)\r\nThere's nothing up top that just makes it easier for them to lay. Both of my brother-in-laws have it and that was like the thing is like year one they come out and it costs more because there's the setup fee, which in the first year I guess is expensive because they've got to put all of that stuff in. And then each year it's cheaper because they don't have to do the setup. It's just pretty plug and play. And it makes sense for the tree, the tree freaking A. It makes sense for the lighting company because it.\r\n\r\n\r\nChris Koerner (23:30.26)\r\nThere's nothing special.\r\n\r\n\r\nChris Koerner (23:35.488)\r\nNo, they just clip them in. That could be different.\r\n\r\n\r\nNikolas Hulewsky (23:44.905)\r\nIt's way quicker every single year for them to put down the same lighting along the tracks that they've already laid.\r\n\r\n\r\nChris Koerner (24:04.11)\r\nSo that could be one model, but how they do it here is it's more expensive the first year, just as you say, because you're buying the lights. But then they store the lights, they keep them every year. So you pay for the lights up front once. And then, let's say the first year is $700, every year after that will be 350, because you've already bought the lights, you're just paying for the labor. But there's nothing different being done every year, no foundation being laid.\r\n\r\n\r\nNikolas Hulewsky (24:14.977)\r\nYeah. Anyways, the point I was making with that is I was talking, so her name is Anne McGinty and she reminded me of you a lot in this sense. They had the idea in July, they launched it in August and by November 30th, they had $150,000 in their bank because they'd done the work, right? She just did it. She just went out and was like, yep, I'll figure it out. And they, you know, they wrapped their car.\r\n\r\n\r\nThey bought some equipment. They did pay for a course. So they took a course and they figured out how to do it. You gotta, gotta. So that's like one end of the spectrum of entrepreneurship. Those are just like the, hey, make hay while the sun shines. And then there's like the other end, which would be probably a little bit more me, which is, I'm sure there's a franchise that does it. I don't want to reinvent the wheel. How do they do it? Oh, maybe I could go sign up. Oh, jellyfish exists. Cool. I'll go see what they're doing and I'll buy a territory from them. But it's like, if it's July me,\r\n\r\n\r\nChris Koerner (24:49.187)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (25:06.766)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (25:11.037)\r\nNick, I'm not going to have that Christmas lighting business up until December of the following year. Whereas Chris, you're going to have it up by December of this year, but you're also going to have to go through all the headaches. You're going to have to like, yep, I'm going have to go to Lowe's. I'm to have figure it out. I'm like, it's probably not going to look as good for the first couple of customers, et cetera. But like you just, got in and you got it done. And I just think it's interesting how there's this broad spectrum of entrepreneurs within entrepreneurship, right? Like we're just not, we're not all the same.\r\n\r\n\r\nChris Koerner (25:16.515)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (25:31.149)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (25:48.451)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (25:48.769)\r\nWow.\r\n\r\n\r\nChris Koerner (25:51.502)\r\nI just talked about the same principle on my podcast two days ago with a guy that owns a pressure washing business and he started doing Christmas lights, but it took him five years to go from pressure washing to his second service, which was window washing five years. He's like, I'm only doing it. And he, said no to ever, ever, you know, everyone was like, can you do landscape? Nope, nope, nope. And then he did a window washing and then two years later he did Christmas lights, but he did what this lady did and he took a course and he actually learned how to do it. And we had this conversation. I was like, I wouldn't even pay for a course.\r\n\r\n\r\nNikolas Hulewsky (26:20.447)\r\nThat's an interesting way to think about it. Yeah, I'll just refund my customers instead of paying for the course.\r\n\r\n\r\nChris Koerner (26:21.196)\r\nI would just freaking go buy a ladder and start hanging those things and it would look like crap. And there's no, there's not a right or wrong way to do it. It's just a spectrum, right? So he pays for a course and I pay for refunding my first few customers because it looked terrible.\r\n\r\n\r\nNikolas Hulewsky (26:26.923)\r\nDo you not, okay, this is just an interesting question. Do you not think courses help you skip the line?\r\n\r\n\r\nNikolas Hulewsky (26:36.075)\r\nHmm, interesting. Has that changed over the years at all? Like, are you more likely?\r\n\r\n\r\nNikolas Hulewsky (26:46.389)\r\nAre you any more likely today to buy a course than you were 10 years ago?\r\n\r\n\r\nChris Koerner (26:47.246)\r\nI'm sure they could. I'm just cheap sometimes to my detriment.\r\n\r\n\r\nNikolas Hulewsky (26:53.569)\r\nThat's interesting. I am. I'm way more likely today to buy a course than I was 10 years ago. Like I would have never bought a course.\r\n\r\n\r\nChris Koerner (26:55.64)\r\nCan't teach an old dog new tricks. Tiger don't change his stripes, Nick.\r\n\r\n\r\nNikolas Hulewsky (27:10.571)\r\nHmm. It could be different. It could be different perspectives as well. Cause like I did a hospice from scratch and you like, you screw up the licensure within a hospice, literally a T not crossed or an I not dotted. Well, you can go to jail. That is very true. You can go to jail, but you have to prove intent. But even if you don't have intent and you just mess up, you could be billing for a year. And then they come back to you and they're like, all that money you build for you have to pay it back. It's like, well, I took care of these patients.\r\n\r\n\r\nChris Koerner (27:12.46)\r\nI think when you, I think when you teach yourself things, it's more painful, even though it's more affordable, it's more painful, but the lessons sink more deeply and you're able to learn a lot faster in the future.\r\n\r\n\r\nThat's my hindsight bias.\r\n\r\n\r\nChris Koerner (27:34.85)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (27:38.413)\r\nstraight to jail.\r\n\r\n\r\nNikolas Hulewsky (27:39.931)\r\ndoesn't matter. You actually missed this on the form. And so because of that, you got to pay all this money back. So I wonder if that's my own hindsight bias, right? It's like, I'm so concerned because of where I came up in through entrepreneurship that I'm going to miss one thing and there's just going be a ton of liability associated with it.\r\n\r\n\r\nNikolas Hulewsky (28:00.577)\r\nDid I lose you? Beeler?\r\n\r\n\r\nChris Koerner (28:03.042)\r\nI lost you. Hold on. I lost you.\r\n\r\n\r\nOne sec.\r\n\r\n\r\nNikolas Hulewsky (28:23.329)\r\nokay. Okay, I'll stop recording.\r\n\r\n\r\nIt should just be a second. Okay, would you want me to stop or no? I would stop the recording,\r\n\r\n\r\nChris Koerner (28:36.174)\r\nMy internet cut out. It's like reconnecting.\r\n\r\n\r\nOkay, I'll text you here in this. It should just be a second. All right. I would stop the recording. Yeah.",
  "metadata": {
    "duration": "",
    "date": "2025-02-07",
    "platform_source": "Google Drive"
  }
}