{
  "episode_number": "94",
  "episode_title": "Why This Stanford MBA Left a $16M Business for Family and Wrote a Book About His Journey with Christopher Hillier",
  "guest_name": "Christopher Hillier",
  "business_name": "Employee Benefits Brokerage and Consulting Firm",
  "transcript": "﻿Nikolas Hulewsky (00:01.23)\r\nAll right, I'm having a hard time. I want to call you Elder Hillier. I'll have to go with Chris. First of all, I love all the books behind you. It's fantastic. Why don't you give us some of you even read? Okay. It'd be better if you hadn't read any of them because because then you're just trying to show off. Anyways, tell me a little bit about your background. What have you done? You had a recent exit. And now you're\r\n\r\n\r\nChris Hillier (00:04.555)\r\nHahahaha!\r\n\r\n\r\nChris Hillier (00:14.34)\r\nSome of them I've even read.\r\n\r\n\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (00:30.432)\r\nin the wilderness. What are you doing?\r\n\r\n\r\nChris Hillier (00:32.086)\r\nYeah, I mean, as I look back, as an investor, a board member, even an operator, I've been involved with a number of companies over the years. But the main company I spent my time building over the past 15 plus years is an employee benefits brokerage and consulting firm where we've worked with employer organizations to develop a strategy and manage their employee benefit programs, primarily insurance coverages, medical, dental, vision, life, disability.\r\n\r\n\r\nOur business model was unique in that we didn't simply broker packaged plans or products that insurance carriers were putting out there. For the vast majority of our clients, we were actually custom building and then assisting our clients to partially self-fund those programs over time. So this would be like an alternative to buying a fully insured plan from a carrier.\r\n\r\n\r\nNikolas Hulewsky (01:22.542)\r\nSo that was going to be my question. Were you working with primarily companies that were self-insured or self-funded?\r\n\r\n\r\nChris Hillier (01:28.484)\r\nPrimarily, yeah. I we worked with employer groups of all shapes and sizes and all kinds of industries. I mean, some of our largest clients were thousands of employees, but we had clients that were as small as just a few people. But I would say where kind of our sweet spot tended to be was with employers between maybe 50 and 500 employees. They were large enough to do some really kind of creative and customized things with their programs.\r\n\r\n\r\nbut they weren't served well by the big house brokers who weren't able or willing to do those types of things for these mid-market companies. And the smaller independent brokers didn't have the expertise or the sophistication right to implement these types of strategies.\r\n\r\n\r\nNikolas Hulewsky (02:14.03)\r\nSo let's level set for a lot of people who are listening. So most entrepreneurs, you own a business, you're required by the Affordable Care Act to provide benefits if you're over a certain number of employees. can't remember what the threshold is. Is it like 20 or something? Okay, yeah. So 50 full-time employees. Under the 50 full-time employees, your employees are able to go to the exchange. They are able to go and buy their own healthcare, health insurance plans. Above 50, you as the employer are required\r\n\r\n\r\nChris Hillier (02:27.236)\r\n50 full-time FTEs.\r\n\r\n\r\nNikolas Hulewsky (02:43.458)\r\nto provide them an employer plan. So that's why you're saying you targeted the, you know, 50 was sort of the minimum up to 500 employees. Is that right?\r\n\r\n\r\nChris Hillier (02:50.712)\r\nYeah, and I think just the types of strategies that we were really differentiated in offering fit well for that type of company or that size of company. We were able to bring essentially the strategies and the solutions that really large companies out there were implementing down market to serve that employer group of a few hundred employees, for example.\r\n\r\n\r\nNikolas Hulewsky (03:13.742)\r\nCan you describe if I'm an employer and I go out, what's the difference between being self-funded and just having a regular insurance plan?\r\n\r\n\r\nChris Hillier (03:23.748)\r\nYeah, so one of the things I would say is even if you have a regular kind of traditional fully insured plan, in my mind, it's important for people to think about the fact that really at the end of the day, everybody's self-funded. you're shouldering the cost of these programs. And one way or another, right, you're gonna end up paying. It's just kind of a difference in the financing mechanism. And so...\r\n\r\n\r\nfor a partially self-funded plan. And I say partially self-funded because there are protections built in, right? There's reinsurance and stop-loss protections built into those plans to protect an employer from large catastrophic claims or just generally really high utilization. But the idea is as opposed to paying a whole bunch of premium to an insurance carrier, right? And then hoping that, you know, things go well there and they treat you right and they price their policies fairly and so on.\r\n\r\n\r\nAt least for the smaller dollar claims, the majority of stuff that's coming through, you actually are just paying dollar for dollar, funding those expenses as they happen. And so there's cost savings to be had in doing that and doing that right. But beyond that, there's also an incredible amount of flexibility and customization that can go into the process because you're not buying that shelf product, right? That's just built the way that the carriers built it. You can plug and play and design and\r\n\r\n\r\nand really put a program in place that meets the needs of your employees and meets the needs, kind of the goals and objectives that you might have as a business.\r\n\r\n\r\nNikolas Hulewsky (04:46.766)\r\nYou\r\n\r\n\r\nNikolas Hulewsky (04:54.03)\r\nLet me see if I can explain it and then you'll be like, okay, that was really dumb, but it's a starting point. So here's what it actually is. So if you're a company over 50 and you need to provide health insurance for your employees, typically what will happen is you'll go to, let's just say United Health Care. I know that there's nuances to this, for argument's sake, you go to United Health Care and you say, hey, this is my employee population. I need an insurance plan. And so they'll look at your employee population. I'll take some of that data based on age.\r\n\r\n\r\nChris Hillier (04:57.924)\r\nLet's hear it.\r\n\r\n\r\nNikolas Hulewsky (05:20.846)\r\nweight, demographics, income levels, et cetera. And they will say, based on our underwriting models, this is the estimate of what your employee contributions and the employer contributions will be. Actually, even before that, they just say, this is the estimate of the per employee cost. And then you as the employer can make a decision of what the employee versus employer contributions will be. Cool. The self-funded model is you're not going to UHC or UnitedHealthcare.\r\n\r\n\r\nYou are the insurance company, essentially. And so any claims that come in, you as the employer are paying, right? And typically what will happen is these insurance companies, underwrite it and they say, this is our estimate based on our underwriting models and the actuarial tables that we have. And then at the end of the year, their hope is that they're keeping the Delta. That was their estimate. If they can keep it under that estimate, then they make money. And so essentially what you're doing is you're removing them as providing the estimate and you're allowed to, hopefully if you're self-funded, keep those savings.\r\n\r\n\r\nDid I explain it somewhat accurately?\r\n\r\n\r\nChris Hillier (06:20.105)\r\nYeah, no, that was awesome. And for a lot of our clients, they might buy actually bits and pieces of what a UnitedHealthcare, for example, has to offer. So there's all these different components that make up the program, right? And there might be some things that a large insurance carrier offers that are really helpful. In some cases, for example, their provider network, where we're actually buying access to\r\n\r\n\r\nthat provider network and picking up on the very same pricing, the discounts and the negotiated agreements that United has with the provider community. But we're paying just a small fraction of what would otherwise be a premium for access to that network. And then we're kind of plugging and playing with other components where we feel like there's better options, kind of best in class that we can.\r\n\r\n\r\nNikolas Hulewsky (07:06.574)\r\nAnd so your business was, I, again, going with the analogy, I'm the business owner and there's United Healthcare, you were the broker helping the business navigate and understand, which insurance company should I go with? Is that, that's fair. Okay.\r\n\r\n\r\nChris Hillier (07:21.134)\r\nYeah. Yeah. Yeah. We were essentially kind of an intermediary right between these service providers, insurance companies and others and the employer groups themselves.\r\n\r\n\r\nNikolas Hulewsky (07:31.768)\r\nSo how did you make money?\r\n\r\n\r\nChris Hillier (07:34.424)\r\nYeah, so depending really on the client arrangement, we could either earn a commission that was paid to us by those carriers and those vendors, or we could be paid a consulting fee directly by our clients. The more upmarket you go, for example, the more typical it would be to see a consulting fee type arrangement. For smaller plans, the commissions were most commonly paid as like a PEPM, a per employee per month fee.\r\n\r\n\r\nNikolas Hulewsky (07:43.918)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (08:03.342)\r\nGive me one second. I don't know why my camera just shut off. That was...\r\n\r\n\r\nI know it's my but it's my laptop. That's not what I want. All right, hold on one second.\r\n\r\n\r\nChris Hillier (08:10.382)\r\nThere you are, you're back.\r\n\r\n\r\nNikolas Hulewsky (00:01.203)\r\nSo you would actually be incentivized PDPM? Well, I'm thinking PDPM. That's a healthcare side, but per member per month.\r\n\r\n\r\nChris Hillier (00:07.14)\r\nYeah, per member per month, per employee per month. And again, that was generally for, I'd say, smaller plans where those commissions were paid by the client, but through the carrier or the insurance provider. For a lot of our clients, especially as you go upmarket, it would become more common to be paid a consulting fee directly from the client.\r\n\r\n\r\nNikolas Hulewsky (00:27.234)\r\nOkay. I love these businesses, but Chris, my business partner, I he'd be half asleep by this point. Actually, he probably would have been asleep for last five minutes.\r\n\r\n\r\nChris Hillier (00:36.442)\r\nDole businesses are some of the greatest businesses. It's not sexy, but...\r\n\r\n\r\nNikolas Hulewsky (00:38.754)\r\nI know, I know. But like, you went to Stanford, you're Stanford MBA, you're in Silicon Valley, you're graduate, you're around really smart people, you could have gone into any tech company. Why the frick did you move to Denver and decide to work in this space? Like this is, this is not a sexy space. This is not a, hey, we have SAS like margins and the multiples are incredible. You know what I mean? Like, how, how did you go from Stanford to this space?\r\n\r\n\r\nChris Hillier (01:06.886)\r\nSo it's actually a really interesting story. So I was applying to MBA programs out of undergrad, not really understanding at the time the value of work experience prior to going in and getting involved with an MBA program. And I actually received a deferred enrollment from Stanford where they said, hey, go out, work for a year, do anything you want, essentially.\r\n\r\n\r\nNikolas Hulewsky (01:14.766)\r\nThank\r\n\r\n\r\nNikolas Hulewsky (01:31.47)\r\n.\r\n\r\n\r\nChris Hillier (01:37.22)\r\nand then come back and your guaranteed admission to kind of next year's class. And so I was kind of left with this year of having to do something. My father had worked in the industry his whole career. Over many years, he built a insurance brokerage and that company was sold. It went through a series of mergers and acquisitions. And when he had completed his time there, we decided just as I was kind of undergrad that it would be fun to do something together.\r\n\r\n\r\nBoth my brother and I had an interest in doing something entrepreneurial. So my brother joined us a couple years later. And after my dad faced out of business, my brother and I actually ran it together for quite a while.\r\n\r\n\r\nNikolas Hulewsky (02:20.27)\r\nThat's interesting. Harvard has a similar program. It's a two plus two program where essentially like you get in, you work for two years and then you go to business school, but this is a one year thing.\r\n\r\n\r\nChris Hillier (02:23.748)\r\nOkay, yes, someone.\r\n\r\n\r\nChris Hillier (02:29.638)\r\nWell, it was actually a two-year thing. so it was interesting. I was applying to other business schools and getting some pretty decent offers, even out of undergrad. And so I kind of thought again at the time, not knowing what I didn't know, that, I'll just take advantage of one of those. Nice scholarships and the rest. So I went to Stanford to visit, and I sat down with the dean of admissions. And because I kind of had already decided that it wasn't something I was going to do, I actually negotiated with him.\r\n\r\n\r\nNikolas Hulewsky (02:45.624)\r\nYeah, yeah,\r\n\r\n\r\nChris Hillier (02:57.124)\r\ndown to one year, which looking back is not something that you do. It's not something I'd recommend, but I kind of figured like worst case, right? Like I go see more adults and it's no big deal. So it was originally a two year term and I negotiated it down to a one year. Say that again.\r\n\r\n\r\nNikolas Hulewsky (03:05.505)\r\nYeah, yeah, yeah.\r\n\r\n\r\nWhere did you think you're gonna do? You didn't think you're gonna go to Stanford?\r\n\r\n\r\nI said, what did you think you were gonna do? You didn't think you were gonna go to Stanford?\r\n\r\n\r\nChris Hillier (03:16.142)\r\nNo, I thought I'd go maybe somewhere else. And I had offers from a number of other business schools.\r\n\r\n\r\nNikolas Hulewsky (03:18.744)\r\nWhere?\r\n\r\n\r\nyou stop being stop being modest where like where else did you have offers from\r\n\r\n\r\nChris Hillier (03:24.966)\r\nI was on the wait list at HBS at the time. I had offers from some schools out in Chicago, from Thunderbird down in Arizona. Yeah, I mean, there were a number of options that I had. I mean, Stanford was my first choice, but I didn't want to wait. I mean, looking back on it now, it all worked out exactly the way that it should have.\r\n\r\n\r\nNikolas Hulewsky (03:37.026)\r\nYeah, yeah, Thunderbird?\r\n\r\n\r\nNikolas Hulewsky (03:46.35)\r\nYeah.\r\n\r\n\r\nChris Hillier (03:52.678)\r\nand was super beneficial the way that it played out. But yeah, we started the company in 2008 when I was kind of waiting on that one year to pass. I worked even while I was out at Stanford, I kind of worked for the company from afar on various projects and things and then kind of returned after graduation and picked up where\r\n\r\n\r\nNikolas Hulewsky (04:11.342)\r\nSo how does it work? Did your dad have a book of business that you guys worked from? Or was it like, hey, I'll show you the ropes. This is how you do it. Go do it yourself.\r\n\r\n\r\nChris Hillier (04:20.708)\r\nYeah, he, I mean, he, he more or less showed us the ropes. We started from scratch. his, his prior company was, was, was sold and, and he wasn't involved there anymore. So we, we started from scratch, but I mean, that was crucial, right? Like just having somebody who knew the business that had relationships that had experience. I mean, it was super generous and super kind of him to get involved and, he did it because he wanted to help my brother and I out. So.\r\n\r\n\r\nNikolas Hulewsky (04:46.702)\r\nWas that weird for you? Like, you? Was there any like, I don't want my dad helping me out.\r\n\r\n\r\nChris Hillier (04:52.45)\r\nNo, I don't think so. And I can see how that could be the case. And I don't know, maybe at times I felt a little bit of that. But I think regardless of whether it's family or somebody else, right, some other mentor, coach, leader, like we all need help to kind of move along that path and in that journey. Like you can't do it alone. And so it was actually a super awesome experience.\r\n\r\n\r\nNikolas Hulewsky (05:13.656)\r\nYeah.\r\n\r\n\r\nChris Hillier (05:21.242)\r\nBeing involved in a family business is challenging in a lot of ways. And there are definitely some unique dynamics to work through, but it was an amazing experience being able to do that together.\r\n\r\n\r\nNikolas Hulewsky (05:33.656)\r\nWell, the reason I ask is my own pride is like, I have two brothers that went to Oxford University, very accomplished lawyers, tons of connections. And for whatever reason, I just was like, I don't want to ask them. No, that's the easy way out. And now looking back, like you're such an idiot. Why would you not take advantage of every opportunity that's open to you? So I'm glad to hear that you were emotionally mature about it and did not view it like I did.\r\n\r\n\r\nWhat did you do when you went back? you came back when your brother started it. You spent a year on it. And then you went back to school and just let it run or were you running it while you're getting your MBA?\r\n\r\n\r\nChris Hillier (06:11.856)\r\nSo my dad was still involved at the time. Over those initial few years, he kind of phased himself out, but he was still involved at the time. And then my brother came into the business and we had a team. We began hiring folks that were gonna help us, especially on the service side of things. so they were working diligently at the business and I was doing the best I could from Northern California. And then when I came back, we were kind of firing on all cylinders at that point.\r\n\r\n\r\nNikolas Hulewsky (06:39.566)\r\nSo you've done what many people dream of doing, right? Started a business, grew a business, sold a business. Except there is one thing that you do that I hate when I hear people say that they're going to do, which is like, I just hired an operator. I think that's the dumbest thing. Anybody who's like, I'll buy a business and hire an operator. like, okay, good luck. You didn't necessarily do that. But the point I'm making is,\r\n\r\n\r\nHow did you architect it? Because a lot of people are thinking about this as they're getting started. How did you architect it in a way where you could go get your MBA and still be helpful to the business? you theoretically got this business that's just getting started. It's scaling. You've now got employees, but you've got to get your MBA. How did you construct it in a way that allowed you to do both?\r\n\r\n\r\nChris Hillier (07:27.494)\r\nYeah, again, I think that's where my father and my brother shouldered the heavy load during that period of time. I mean, even beyond that, this is a relationship business. I mean, when you go out and you sell your services, what people are really buying is you, right? Your ability to provide guidance and advice and consultative services that are gonna be beneficial to them. So there's really no...\r\n\r\n\r\nyou know, selling something and then just turning it over to the team to handle, right? And being longer involved. You're intricately and intimately involved in the entire process and the entire client relationship from start to finish. And so, yeah, so during that period of time, it was them. And when I came back, we did it together and...\r\n\r\n\r\nNikolas Hulewsky (08:18.382)\r\nWas that hard? Was that was their tension there? It's like, must be nice. Chris is getting his MBA and we're over here doing all the work or like, how did you guys work through those dynamics? I could just imagine having had partners before that that could have been an issue.\r\n\r\n\r\nChris Hillier (08:31.823)\r\nYeah.\r\n\r\n\r\nYeah, you probably have to ask somebody else that question to really get a truthful answer. No, I think it worked. My brother, when we started in 2008, my brother was actually still finishing up his undergrad. So he came into the business a little bit later. So that year, for example, that I was working, he was still at school doing his thing. And again, I think...\r\n\r\n\r\nas it relates to my father, like we're just incredibly fortunate. He did this, he got involved out of the goodness of his heart, right? He didn't have to get back involved. In fact, he probably didn't really want to. Like he'd already lived that, done that, didn't need to do it again, but he wanted to provide us with that opportunity. And so, yeah, incredibly grateful to him and it all worked out in the end.\r\n\r\n\r\nNikolas Hulewsky (09:13.25)\r\nYeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (09:23.831)\r\nDo you think you're lucky or do you think there's anything that you did with your brother in particular that allowed you guys to have a good working relationship?\r\n\r\n\r\nChris Hillier (09:32.302)\r\nYeah, I think at least the way I always thought about it, we had to be incredibly intentional about the way we went about things because, I mean, there will be and there are and there have been just those situations that come up where you think about things differently. You have a different perspective, you have a different opinion. yeah, and to kind of balance or to keep things in perspective, for me, it was always\r\n\r\n\r\nNikolas Hulewsky (09:52.504)\r\nAnd then you couple the fact that your family, like it's.\r\n\r\n\r\nChris Hillier (10:00.324)\r\nthese family relationships are more important than anything else. And so whatever happens in the business, right, good and fine, and we'll work through it, but we've kind of got to leave it there, right, and not let it impact the rest of the family dynamic. And that's much easier said than done, right? Like that takes real intentionality and real discipline, but I think that's key when you're involved in working with family.\r\n\r\n\r\nNikolas Hulewsky (10:18.382)\r\nWell.\r\n\r\n\r\nNikolas Hulewsky (10:25.806)\r\nWell, I just think getting into entrepreneurship, especially if you have a partner, you don't understand how hard it gets. There will be moments where one of you is doing more than the other, or at least perceived to be doing more than the other. How do you address those? How do you work through it? How do you communicate? How do you even communicate upfront who's doing what? I've just seen that so many times. I mean, I've been on the receiving end of that so many times where if you don't have clear expectations going into it, it can cause a big problem. Anyways,\r\n\r\n\r\nChris Hillier (10:54.126)\r\nAnd clearly defined roles and responsibilities, right? Understanding from the outset, here's what each of us is responsible for and where we're going to spend our time and our energy and staying in our lane, right? And trusting and relying on your partner to kind of manage their own roles and responsibilities.\r\n\r\n\r\nNikolas Hulewsky (11:13.666)\r\nGive me an idea, just because I think it will set better context for as we talk about this. So you start in 2008, you go and get your MBA. When did you sell the business?\r\n\r\n\r\nChris Hillier (11:22.843)\r\nin late 2018. And then I stayed on with the company working for our parent company at that point for about five years before I left last year.\r\n\r\n\r\nNikolas Hulewsky (11:25.25)\r\nOkay, can you me an idea of...\r\n\r\n\r\nNikolas Hulewsky (11:33.432)\r\nCan you give me an idea of how big the business was when you sold? mean, revenue would be great and sales price would be nice, but I don't think you want to disclose that. Just anything that kind of gives some context there.\r\n\r\n\r\nChris Hillier (11:43.302)\r\nAt the point of sale, we were doing about 16 million in top line revenue. We had really healthy margins. That's one of the really attractive things I think about this particular type of business and industry.\r\n\r\n\r\nNikolas Hulewsky (11:58.286)\r\nThose businesses are usually like 40 % margins starting out, right? Like you can get higher than that, but is that fair?\r\n\r\n\r\nChris Hillier (12:04.71)\r\nYeah. So obviously it's a service organization. So there's not a ton of overhead and fixed expense. I think industry-wide margins in the 30 % 40 % range are pretty common. We were actually pretty unique in how we ran our agency. And our margins actually were up in the 60 % plus range. Yeah. No, we...\r\n\r\n\r\nNikolas Hulewsky (12:23.442)\r\ngeez. I just got intimidated. boy.\r\n\r\n\r\nChris Hillier (12:31.844)\r\nI think part of it was we were just super disciplined in running the business very lean, right? And we took a ton upon ourselves as owners, but there were some other contributing factors, unique things. I'll tell you about one of them. So we became incredibly proficient in this stop loss space, right? Which again is kind of one of the components of what we were doing for our self-employed clients.\r\n\r\n\r\nNikolas Hulewsky (12:52.526)\r\nBut talk to me like I'm a five year old. Stop lost, I know what that means.\r\n\r\n\r\nChris Hillier (12:55.558)\r\nOkay, so you're self-funding your health plan, but you're still seeding risk to an insurance company just for the really large shock-type catastrophic claims.\r\n\r\n\r\nNikolas Hulewsky (13:10.264)\r\nYep, somebody gets cancer and it's like really expensive or they have an ongoing illness.\r\n\r\n\r\nChris Hillier (13:14.586)\r\nreally expensive and you don't want something like that. You want to take advantage of all the benefits of self-funding, the cost efficiencies, the economics, the flexibility, but you don't want a situation like that that's unpredictable and unexpected to come and just blow up your plan or maybe even blow up your business. So you purchase reinsurance or stop loss for those types of situations, which isn't your full premium, right? It's just a small percentage of your overall plan costs specifically for that type of protection.\r\n\r\n\r\nNikolas Hulewsky (13:20.717)\r\nOkay.\r\n\r\n\r\nChris Hillier (13:43.138)\r\nWe actually at one point in time acquired an MGU, Managing General Underwriter, a company that specializes in underwriting stop-loss policies and processing claims. So that was something we acquired and we built and we grew and we sold that a few years ago too to a different buyer. But anyways, this was just an area that we became kind of really focused on and proficient in.\r\n\r\n\r\nAnd over time, we started to actually build relationships with brokers who would utilize us to help them secure stop loss coverage for their clients. And we became kind of a backroom of sorts for brokers and TPAs, third party administrators across the country. And for us, this was extremely profitable business, really high margin, because we weren't involved in the day-to-day servicing of those accounts, right?\r\n\r\n\r\nNikolas Hulewsky (14:23.566)\r\nfood\r\n\r\n\r\nChris Hillier (14:37.914)\r\nBut it was a really critical part of the business for these brokers and TPAs because it was essentially what allowed them to renew and retain business. And so there were things like that that we did that were a little bit uncommon and unique that allowed us to be very profitable and\r\n\r\n\r\nNikolas Hulewsky (14:54.754)\r\nWell, and it's similar to like there are examples of companies who've taken large cost centers to them and turn them into profit centers. So an example of this would be Amazon. Amazon had a ton of hosting costs, right? They have to have a ton of servers because of their business. So they decided to start Amazon Web Services. They invested a bunch in Amazon Web Services and now they're selling that cloud space to a lot of other people. And that's literally the most profitable segment of their business. It sounds like you did a similar thing, right? Like, Hey, this is a cost center to us. We've got to make sure we're really good with the\r\n\r\n\r\nstop loss, reinsurance, and you got so good at it that people started then coming to you and you were able to offer that as another service to them. Smart.\r\n\r\n\r\nChris Hillier (15:30.458)\r\nYeah. And it was a pretty unconventional move because I mean, there's a lot of retail brokers out there and then there's wholesale wholesalers out there, but nobody was really trying to do both. And one of the main reasons that you wouldn't consider doing both is because, you know, if you're a broker and going to outsource this critical aspect of your business, you wouldn't want to do so to a competitor, right? For example, and\r\n\r\n\r\nAnd so anyways, you know, that, that took kind of some, some working through. And, at the end of the day, I think that type of concern was, was unfounded. would tell our, our broker partners all the time, for example, that the minute we kind of took advantage of the situation, right, tried to steal a client or whatever the case might be. Like that was the same minute we no longer had a business because nobody would ever work with us again. But, but it really came down to the reputation we had as a firm and as people, those relationships of trust and.\r\n\r\n\r\nWe built incredible partnerships with other brokers across the industry and always just had to really stay true to our word and do things right. And that was actually a big boost for us in terms of one of the ways we grew our business.\r\n\r\n\r\nNikolas Hulewsky (16:43.384)\r\nMan, there's a ton of questions I have, because I want to know how you grew, but I don't think I have enough time for all of that stuff. Here's what I really want to know. $16 million a year revenue, but 60 % margins. Cool. So it's $8 million a year profit. Why would you ever sell? I mean, that just seems like you just have a money printing machine. It's healthcare, so it's sticky. Now it could be that you're like, I got an offer I couldn't refuse, which is totally reasonable as well.\r\n\r\n\r\nBut like, how did you and your brother after building this company to where it is, get to a place where you're like, maybe we should sell. Like, what was the motivation behind that?\r\n\r\n\r\nChris Hillier (17:22.288)\r\nSo first of all, we weren't planning to sell or looking to sell or even maybe wanting to sell when we did. I mean, there were a number of factors, way more again than we probably have the time to get into. But I think one thing that I'd mention is we actually fell in love with Acresure, who acquired us, and the business model, and the opportunity that we had to become part of something even bigger.\r\n\r\n\r\nNikolas Hulewsky (17:24.523)\r\nit.\r\n\r\n\r\nChris Hillier (17:49.292)\r\nAcresure's business model, at least at the time, was they were buying quality agencies that were growing. They were allowing them to really run autonomously. And so, you know, we were giving kind of all the advantages of running our own business, but also the resources that were available with just a really good, great, big company. You know, offloading all the administrative stuff, HR, payroll, accounting, those types of things that we really weren't very good at to begin with. But also,\r\n\r\n\r\nbut also resources that we were able to provide to clients in the form of legal and compliance and some of those types of things. So for us, Acresure was kind of the best of both worlds where we got to continue to run our business, continue to do what we loved doing for clients while at the same time tapping into these resources. And a significant portion of the purchase price was actually paid in the form of company stock. So it gave us a chance to say that again.\r\n\r\n\r\nNikolas Hulewsky (18:46.766)\r\nAre they public? They're publicly traded?\r\n\r\n\r\nChris Hillier (18:50.916)\r\nThey are not. They're a private company, a huge private company at this point, but we reinvested into the company, right? So we were able to take some chips off the table while at the same time kind of reinvesting into the company and wait for maybe even a bigger liquidity event, which by the way, we're still waiting for.\r\n\r\n\r\nNikolas Hulewsky (19:09.902)\r\nWhy not? You went to Harvard, not Harvard, you went to Stanford, right? Roll ups are a thing. If you have that cash coming in the way that you were, why not take that cash and just do your own roll up? Like become, is it actor? How do you say it? Actor, yeah, yeah. Why not become them? Why make the decision to sell? Why not make the decision to double down and grow?\r\n\r\n\r\nChris Hillier (19:25.84)\r\nYeah, for sure. Yeah.\r\n\r\n\r\nChris Hillier (19:33.22)\r\nYeah, I mean, like I said, I think there were other other reasons at the time that that it just started to make sense to sell the business. And I think one of those was and you know this, you've been involved in these types of companies like you can you can only only go for so long. I mean, grinding the way that we were. There's a real sense of burnout and the stress and the pressure and just I mean, everything that goes into it.\r\n\r\n\r\nIt was a lot, right? And it was a sacrifice. It was a sacrifice well worth it. But I think there was also kind of a time when I realized that there were other aspects of my life that were really being neglected and that I wanted to focus on and I wanted to pay more attention to. so, yeah, mean, typical stuff, right? Family.\r\n\r\n\r\nNikolas Hulewsky (20:22.157)\r\nCan you talk about some of this? If you're willing.\r\n\r\n\r\nChris Hillier (20:29.102)\r\nI've got, I've got five kids. my wife's amazing. but like I wasn't around for, for those, those years. And, and again, I think at the end of the day, I'm incredibly grateful for what it was and the experience I had. actually had a business school professor, who gave me the advice once to, front load your career and just, make those sacrifices early on, right. That we're going to pay dividends for.\r\n\r\n\r\nyears and years to come, which is essentially what I feel like I've done. But yeah, I was looking forward to the opportunity to kind of restore some balance in my life, focus on my own personal wellbeing and health, pay attention to some of those family dynamics, right? And be there for my kids in a way that I was.\r\n\r\n\r\nNikolas Hulewsky (21:16.28)\r\nConnie, so I have four boys under 10, right? So they're all really young. I was talking to this entrepreneur yesterday and he has a company that's, I think he does like $300,000 a year in revenue, right? So it's not a big company. And then after expenses, I don't know, he's probably netting 50 to a hundred thousand. I didn't know exactly where he is, but you know, this guy's not making mega bucks, but he's like, I love it. I control my schedule. It's amazing. I'm doing something that I love.\r\n\r\n\r\nAnd he's like, you know, it's not, it's not success, but like it's, is for me. And I like had to stop them. I'm like, man, that's success. Like don't ever tie it to a specific dollar amount. Like if you can control your schedule and you're investing in the relationships that you want, like that is something that Elon Musk and Warren Buffett, not maybe not Warren Buffett, but Bill Gates and all those guys that they will never have. And it's enough because they're always going to be chasing that. And that was important to me when I sold it. It's like, okay.\r\n\r\n\r\nI need to reprioritize some things in my life. I think it's really important to say what you just said because yeah, you could double down. You could have gone and done a roll up strategy. You could have gone and consolidated a bunch of stuff, but at the end of the day, you're looking at it you're like, I only have so much time. Where am going to spend it?\r\n\r\n\r\nChris Hillier (22:30.778)\r\nYeah, which by the way...\r\n\r\n\r\nthe title of my new book here. It's About Time. I appreciate it. I wasn't even necessarily going to mention it. But yeah, that's something I've been doing a lot of this past year is writing. And my first book is actually going to be released in the next few weeks. And it's a lot about that, right? Like how do we find meaning and purpose in what we're doing and where we're spending our time?\r\n\r\n\r\nNikolas Hulewsky (22:35.488)\r\nIt. That's hilarious. I wish that I was could say I was planned and strategic enough to say it's about.\r\n\r\n\r\nChris Hillier (23:03.842)\r\nAnd a lot of it's just my real life lived and learned experiences, personally and professionally. And I think this opportunity now to reflect back on this entrepreneurial journey and everything that took place, there's a lot of lessons learned and some things that I would have of course done differently and some things that I want to do differently and I'm doing differently now and especially kind of this season in my\r\n\r\n\r\nNikolas Hulewsky (23:27.596)\r\nAny regret coming out of Stanford not going into tech.\r\n\r\n\r\nChris Hillier (23:34.231)\r\nyeah, I think about that. I think about that from time to time.\r\n\r\n\r\nNikolas Hulewsky (23:39.63)\r\nI'm gonna guess, do you have any classmates who just like are billionaires? They're probably billionaires.\r\n\r\n\r\nChris Hillier (23:43.044)\r\nI've got classmates that have made it big. I also have classmates, though, I will say. I mean, I think everybody that comes out of Stanford Business School is successful, right, at some level. they're achieving success, whatever their definition of that is. But there's also folks out there that, I mean, similar to your friend that you just mentioned talking to, right, that haven't made it huge, right? And maybe they've tried and failed or are still\r\n\r\n\r\nNikolas Hulewsky (23:59.022)\r\nSure. Sure.\r\n\r\n\r\nChris Hillier (24:11.526)\r\nare still working towards that. you just, you just never know. I've always been kind of envious of tech businesses because of the scalability and like operating a service business. Like we grew and we scaled and I think we did phenomenally well, but, scaling a service business like that is, is just brutal. I mean, such a grind. And so yeah, I mean, there's\r\n\r\n\r\nNikolas Hulewsky (24:36.386)\r\nDo I agree with you? I don't think people understand that because what is your product? Essentially, it's people. It's good people that are providing the service. I grew a home health and hospice to $12 million and it's freaking hard because you can only grow if you hire good people and you're probably in a similar book software. It's like, all right, I built it one time and there has to be product market fit and probably there's probably other things obviously we don't know or familiar with that are a pain in the butt. Yeah.\r\n\r\n\r\nChris Hillier (25:01.382)\r\nBut if you get it right, it can happen quick, right? You give that a few months, a year, a couple years, like.\r\n\r\n\r\nNikolas Hulewsky (25:06.19)\r\nYeah, services businesses, people based businesses. Those are hard. Those are really, really hard. I totally agree with that.\r\n\r\n\r\nChris Hillier (25:12.624)\r\nBut I love the business of people. And that was one of the things I loved about this industry and the business that we built was it was a relationship business. It was a people business. And just the interactions with customers and clients, but vendors and service providers and employees, the opportunity to really kind of work with amazing individuals and make a difference like that was something that always felt very meaningful to me.\r\n\r\n\r\nNikolas Hulewsky (25:28.172)\r\nIs it?\r\n\r\n\r\nNikolas Hulewsky (25:39.438)\r\nOkay, give me some red meat. you have any offers from companies coming out of Stanford or any friends that were like, you should come work at this company called Airbnb with me. Tell me some of the news.\r\n\r\n\r\nChris Hillier (25:50.054)\r\nYeah, I had some offers and some options. And again, looking back on my story, we had already started this company. So I was in kind of a unique situation where it was like, could have gone and done something different. It would have been fine. But I had already kind of, in a sense, committed myself to this was something I wanted to do. This was a path that I wanted to take. I'll tell you one quick story that was\r\n\r\n\r\nNikolas Hulewsky (26:01.314)\r\nYou are locked in.\r\n\r\n\r\nChris Hillier (26:18.31)\r\nThis one was maybe a little bit hard to turn down, but I'd always been kind of intrigued by sports management. And I've been a sports fan my whole life. I'm a big hockey fan. And I did a project while I was out at the GSB for one of the owners of the San Jose Sharks. And kind of organized a group of students. We were looking at collective bargaining agreement nuances and just terms and things. anyways.\r\n\r\n\r\nIt was a lot of fun, like sitting in the owner's box and watching these hockey games and the project that we actually completed. It was shared ultimately with a number of teams in the NFL, the MLB and the NBA. And anyways, I got a job offer from Kevin, which was kind of who we were working with on this project.\r\n\r\n\r\nLike I knew at the time, and I still know looking back, like it wasn't the right fit. It wasn't really what I wanted to do. It just wasn't the environment, the culture, the just, it wasn't going to be lifestyle, right? That I was looking for. but that was, that was a little hard to turn down because that was just such kind of a, a unique and opportunity that was in an industry and in a, in a space that like, I've always just been intrigued.\r\n\r\n\r\nNikolas Hulewsky (27:34.04)\r\nSo how are you thinking about what's next? You're doing one of the two things that are my business bucket lists. So there's two business bucket lists. I wanna be a professor at a university. Adjunct is fine. I think you're doing adjunct. So it's on my bucket list. The other thing on my bucket list is I wanna buy a company for parts. I don't know why, but I just wanna like, somebody's like, I'm shutting it down. You can have this thing for, you know.\r\n\r\n\r\nChris Hillier (27:47.546)\r\nThat's what I'm doing, yeah.\r\n\r\n\r\nNikolas Hulewsky (28:01.262)\r\n$200,000 and then it turns into a $5 million come or whatever. I just think that would be so fun to try to figure out is there something here. Anyways, you're living one of my two bucket lists. I'm curious, what are you focusing on now? What's next for you?\r\n\r\n\r\nChris Hillier (28:17.286)\r\nYeah, I think it's still a work in progress. I'm doing some consulting, I'm doing some advising, I'm working with some clients on some things. I'm adjunct professing, I'm writing. I actually, I think I mentioned to you, I'm actually most the way through my second book, which I don't know. So the second one is on character. And again, same concept, right?\r\n\r\n\r\nNikolas Hulewsky (28:38.316)\r\nWhat's the second one?\r\n\r\n\r\nChris Hillier (28:45.296)\r\npersonal and professional experiences, lessons learned when it comes to developing character and living the type of character that we intentionally choose in our lives. So that takes time, writing and publishing. So I'm trying to do things in a more balanced way, but it's been a lot of fun because it feels a little bit more project-based, if you will, where I can kind of spend time where and when I want to on kind of a variety of things. when I was really kind of in it,\r\n\r\n\r\nwith the benefits business. I was all in, you had to be. And that was kind of the primary and really the sole focus at the time.\r\n\r\n\r\nNikolas Hulewsky (29:25.718)\r\nIs there, I'm gonna wait for my camera to turn on, here we go. All right, looking back, is there any tactical advice either you would give to yourself, your pre-entrepreneurial self, or just somebody who's looking to get into entrepreneurship and is looking at you and like, man, that guy did it the way I wanna do it. What advice would you give to people? Or like, what do you think people miss as they're thinking about getting into entrepreneurship that you wish you would have known earlier on?\r\n\r\n\r\nChris Hillier (29:51.824)\r\nYeah, sorry, you cut out for just a minute there, but I think you were asking tactical advice. Tactical, tactical advice.\r\n\r\n\r\nChris Hillier (30:02.916)\r\nI don't know. I mean, it's not super tactical or technical, but I will say just more in terms of the experience being an entrepreneur. There's a quote that I love by Mark Twain that goes, I'm an old man and have known a great many troubles, but most of them never happened. And I feel like that defines my entrepreneurial journey. Like so much pressure, so much stress, but looking back now, I can hardly think of anything that really was so\r\n\r\n\r\nconsequential long-term, right? That it matters today. And so I think for anyone starting a company, buying a company, kind of in those early stages, like just keeping perspective and understanding and realizing that there's gonna be a lot of challenge and there's gonna be a lot of adversity, but you'll get through it, right? And most of what is keeping you up at night and really causing you like heartache, give it a few months, right? Or a few years at most and...\r\n\r\n\r\nNikolas Hulewsky (31:01.176)\r\nheard Tom Hanks gave a quote. There's a video of him talking and he's like, things suck right now. It's the worst it's ever been. Give it time. And then he's like, you're on top of the world. You made a million bucks. You're amazing. Give it time. You just like the highs and the lows kind of even out over time. That was a good quote that I really like. One of the things that I struggle with though with that is\r\n\r\n\r\nChris Hillier (31:01.35)\r\nyou\r\n\r\n\r\nChris Hillier (31:18.726)\r\nTim tenor.\r\n\r\n\r\nNikolas Hulewsky (31:29.422)\r\nI feel like it's easy now to be like, hey, just relax a little bit. But looking back, I don't know if I would have been as successful if I would have been able to do the things that I needed to do without that stress. it's like, it's just, it's such a hard balance. Cause I fully agree with that. 99 % of the things that you thought were going to happen never actually happened. But by the same time, was, it's such a motivator.\r\n\r\n\r\nChris Hillier (31:53.498)\r\nWell, a lot of the stressors too are stuff that's outside your control, right? Focusing on those things that are within your control, I think is one thing, but you know, stuff would come up. We started our company in 2008, which was a really interesting time to start a company because we're right in the midst of the Great Recession. That said, it turned out to be a huge advantage for us because the economy was not in a great place. A lot of companies were out there struggling and our whole business model was focused on finding savings for\r\n\r\n\r\nNikolas Hulewsky (32:06.904)\r\nright here.\r\n\r\n\r\nChris Hillier (32:23.398)\r\nplan sponsors and more effectively managing their employee benefit plan costs. We were getting opportunities to talk with companies that probably would have never entertained a conversation with us at any other point in time. When things are going well economically and businesses weren't feeling kind of so constrained financially, they're much less inclined to make changes or consider things that even if there are savings to be had. And another example of that when the ACA was passed in 2010, right, this was a huge\r\n\r\n\r\nconcern. Nobody really knew what it meant for the industry, what it meant for their business, but people weren't feeling great about it. And as it turns out, it actually turned out to be a huge boost for our business, where employer groups had to more heavily rely on their brokers and their consultants, digging into compliance and new legislative requirements and navigating a more complex health care environment. I mean, that was\r\n\r\n\r\nthere were guys out there that closed up shop and decided like, this wasn't what they signed up for. This wasn't what they wanted to do. Maybe they were kind of in their sunset years and just didn't want to invest the time and the energy into it. And for the rest of us, for us at least, like this whole deal expanded the industry and it started out as this huge like concern and challenge and something we were trying to figure out, like how are we going to get through it or what are we going to pivot to?\r\n\r\n\r\ndo in our business is kind of a moot point.\r\n\r\n\r\nNikolas Hulewsky (33:53.804)\r\nWhat percentage of your success would you say is luck? What percentage would you say is you? Hard work.\r\n\r\n\r\nChris Hillier (34:05.669)\r\nA healthy dose of both, don't know. I'd probably, because it's what I see and know kind of the most about, I'd probably say it was a large percentage hard work and just grit and grind and hustle, but I'm sure I'm totally underestimating the luck.\r\n\r\n\r\nNikolas Hulewsky (34:08.974)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (34:26.318)\r\nI just I think that like a Paul Graham has a quote that's like the industry or the wave that you're riding is way more important than the business. Right. And like you get into health care 2008. First of all, you started business in 2008. It's probably these economic downturns are some of the best times to start businesses because there's not really any lower you can go right. A ton of opportunity. And then the Affordable Care Act gets passed in 2010. And it's like,\r\n\r\n\r\nChris Hillier (34:48.762)\r\nYeah, I mean there's a kind of opportunity that's born out of it.\r\n\r\n\r\nNikolas Hulewsky (34:57.132)\r\nNow, unfortunately, premiums have skyrocketed, but there's also been a ton of need for your services, right? And it's like, you wouldn't have known that sitting in business school, mapping it out, saying like, we're going to have these huge tailwinds. You didn't even know it at the time once it was passed until it was actually implemented. In hindsight, you've been able to look back and see it was successful. obviously, you're super smart. had a good experience. You work hard. That's a given. But there are these little pieces as well that you're like, man, if that wouldn't have happened in that way at that moment.\r\n\r\n\r\nI don't know if I'd be sitting here the way that I am. So I like that stuff.\r\n\r\n\r\nChris Hillier (35:29.796)\r\nNobody else from my business class that I'm aware of went into insurance. just isn't, not one of those industries that people are looking out and jumping into, but it's a great business. It releases December 10th. Available for pre-orders currently, anywhere books are sold. I'm super excited about it. It's been a really fun project to work\r\n\r\n\r\nNikolas Hulewsky (35:35.79)\r\nThat doesn't happen. Well, this is ad man. When did your book come out?\r\n\r\n\r\nOkay, December 10th, it's about.\r\n\r\n\r\nNikolas Hulewsky (35:53.816)\r\nOkay, well, this will probably be released around the time that your book comes out. So we'll make sure to link to it in the show notes, but it's been awesome. Thanks. I'm gonna stop the recording, but stay on.\r\n\r\n\r\nChris Hillier (36:04.134)\r\nThank you.",
  "metadata": {
    "duration": "",
    "date": "2024-12-09",
    "platform_source": "Google Drive"
  }
}