{
  "episode_number": "136",
  "episode_title": "The Never Touch Plastic Revolution: Building a Marketplace for the Concerned with Chris Koerner",
  "guest_name": "Chris Koerner",
  "business_name": "Never Touch Plastic, Jumbo Mail Marketing, Doge (Department of Government Accountability), Qualtrics",
  "transcript": "﻿Chris Koerner (00:02.446)\r\nAll right, ask me if I got something good today, Nick.\r\n\r\n\r\nNikolas Hulewsky (00:02.702)\r\nChris, do we have something good today or what?\r\n\r\n\r\nChris Koerner (00:06.464)\r\nIf you would have asked me that 15 minutes ago, I would have been very concerned because I had nothing. But let me tell you what, Nick, let me tell you what, when you're procrastinator, a habitual procrastinator of 38 years, you get pretty dang good at packing a lot of work into 15 minutes. Okay. Over the course of the last 15 minutes, I went from very concerned about this episode to very excited. And partly that is thanks to our friend, deep research because prompt boom.\r\n\r\n\r\nNikolas Hulewsky (00:23.489)\r\nyeah.\r\n\r\n\r\nChris Koerner (00:35.968)\r\nOpen another one prompt boom, open another one prompt boom. It spits out 10,000 words and then I say, no bullet points. Boom, boom, boom. Five minutes later, I've got so much good stuff.\r\n\r\n\r\nNikolas Hulewsky (00:46.478)\r\nDude, I did the same thing. That's so funny. I felt the same way like 20 minutes ago. It like, it was actually 10 minutes ago when you, when I called you to make sure that we're still on. I was like, F me. But I went to my running list and I was like, I got good stuff on here. And then I had one thing that I didn't finish up with deep research of John, like stoked to talk about. got it anyways. I'm stoked, dude. The people expect value. We're going to deliver value, bro.\r\n\r\n\r\nChris Koerner (00:50.616)\r\nYes.\r\n\r\n\r\nChris Koerner (00:57.966)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:04.75)\r\nOkay, we're gonna deliver. And you know what? The retention chart on this episode will tell us if the procrastination actually worked or not. Data don't lie.\r\n\r\n\r\nBut funnily enough, I'm going to start with something that I was prepared for. This is something that I've been noodling on for about a week. Anytime I have a business idea, I try to save it for this for us, right? Because it's fresh and the energy is there and you can feel it and the listener can feel it and it's just very authentic. Okay. And sometimes, sometimes I get an idea and I'm like, I legitimately want to do this. Therefore I don't want to talk about this.\r\n\r\n\r\nsomeone's going to do this. Okay. But hey, law of abundance. That's why we're here, right?\r\n\r\n\r\nNikolas Hulewsky (01:48.334)\r\nYeah.\r\n\r\n\r\nChris Koerner (01:55.34)\r\nRight? I'm sorry, are you here for the law of\r\n\r\n\r\nNikolas Hulewsky (01:55.522)\r\nDude, I'm, yes, right. I'm,\r\n\r\n\r\nDiminishing returns? That's me. I'm a diminishing returns guy. I'm a scarcity guy.\r\n\r\n\r\nChris Koerner (02:05.334)\r\nLaw of scarcity. Is that you? Okay, enough. This is dumb. This is dumb. Let me just spit it out. Okay. Here's my framework Friday for us today. Okay. Framework Friday, we talked about trends. We talked about tidal waves. You want to ride a tidal wave, make it easier on yourself. Here's a framework Friday for you. We want to combine two tidal waves. Okay, so take two mega trends and put them together. And you're probably likely to get something even more legitimate.\r\n\r\n\r\nOkay. Absolutely. Can I tell you what I have in mind today? Okay. These, these two, these two things are trending right now. Sourdough. Everyone's bacon sourdough. Okay. Microplastics. Right. Same page.\r\n\r\n\r\nNikolas Hulewsky (02:35.298)\r\nYeah, a mega mega trend. Okay. Yes, come on. We're two minutes in dude. She's\r\n\r\n\r\nNikolas Hulewsky (02:53.144)\r\nOkay, quick aside, this would be a great segment for us to continue to do where we just find two random trending things and figure out a way to bring them together. That's pretty good. It's pretty good.\r\n\r\n\r\nChris Koerner (02:58.348)\r\nMm-hmm, mm-hmm.\r\n\r\n\r\nMohammed, remind us of that. Mohammed's like, I'm not your assistant. That's not my role.\r\n\r\n\r\nNikolas Hulewsky (03:03.31)\r\nMom was like, I don't even speak English. I don't know what you're saying.\r\n\r\n\r\nChris Koerner (03:11.592)\r\nAlright, sourdough and microplastics. sometimes if I'm short on ideas, which I'm never short on ideas, I like to log into my Namecheap account and look at all my domain names and just think, alright, Chris, what were you thinking when you bought BuckcracksAnonymous.com or whatever it is, right? What were you thinking, Chris? I just made that up. I don't actually own that domain, okay? Yes. So a few years ago,\r\n\r\n\r\nNikolas Hulewsky (03:13.934)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (03:20.44)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (03:27.554)\r\nbutt cracks anonymous.\r\n\r\n\r\nThey're a recovery group. They're addicted to butt cracks. I don't know what you want me to say. There are dozens of us.\r\n\r\n\r\nChris Koerner (03:40.012)\r\nI bought a bunch of domain names about plastics and microplastics. One of them is never touched plastic.com. Okay. Like to buy things that have never touched plastic, like water, bottled water that at any point in the supply chain, it has never been in contact with plastic. Okay. So, okay. I don't plan on doing anything with that anytime soon, but then I started making sourdough this week. Okay. And\r\n\r\n\r\nNikolas Hulewsky (03:58.625)\r\nOkay.\r\n\r\n\r\nChris Koerner (04:08.716)\r\nI'm going to assume Nick that you don't know anything about sourdough because you're not. OK, so. Sourdough bread is made of three ingredients, flour, water, salt. OK, there's no yeast because the sourdough is a natural yeast. You combine one part flour, one part water, mix it every day. You dump out half of it and you replace it with one part flour, one part water every day for a week or two. Then you got sourdough because the bacteria basically creates.\r\n\r\n\r\nNikolas Hulewsky (04:10.74)\r\nI know, I do. I know nothing about sourdough.\r\n\r\n\r\nNikolas Hulewsky (04:34.542)\r\nyou can make sourdough from scratch? I thought you needed a starter for sourdough.\r\n\r\n\r\nChris Koerner (04:38.892)\r\nThis is, I'm talking about making starter, which you use to make sourdough bread. Yeah. You can make it from scratch.\r\n\r\n\r\nNikolas Hulewsky (04:42.582)\r\nNo, I know. I just always thought anything anything that has a starter like what's that? What's that yogurt that has a starter? my gosh, I can't believe I'm blanking on it. Not kimchi. Anyways, there's there's lots of like things that have starters that you can only do it if you have the starter, but you can make a starter for sourdough. Anyways, keep going.\r\n\r\n\r\nChris Koerner (04:50.382)\r\nMm.\r\n\r\n\r\nChris Koerner (05:05.698)\r\nYeah, it's just bread and water or flour and water. Anyway, so I've been making some starter and it's done and it's awesome and it smells amazing. And I today I made my first loaf of sourdough with my own starter and it's cool. All right, it's fun. But you know, I put my starter in a glass jar because if I, you know, it gets warm in there and plastic breaks down and I don't want microplastics in my starter. So I start talking to our friend, Chad GPT and I said, Hey, tell me about microplastics in sourdough starter.\r\n\r\n\r\ntheoretically, if I have microplastics in my sourdough starter, will I have microplastics in all of my loaves of sourdough bread for the next century? So yeah, theoretically, you know, there'll be less and less and less but but you will. Right? So my huh, that's, that's fearful. Fear sells. How can I sell that? Okay. And so I've been very cautious to not put any plastic in contact with my sourdough starter. And then I thought\r\n\r\n\r\nNikolas Hulewsky (05:45.294)\r\nRight. Okay.\r\n\r\n\r\nChris Koerner (06:04.59)\r\nOkay, starter is a commodity. You can buy it for $5 on Amazon Facebook Marketplace anywhere. There needs to be an ultra premium sourdough starter that has never touched plastic, that is made with the finest of water, hand-milled flour, whatever it is. It doesn't matter how premium the ingredients, because the cost will be very, very low regardless. Because in order to start starter, you just need a little bit. So basically, you make sourdough starter,\r\n\r\n\r\nand then you dry it out, you remove all the water, and then you can sell it on the internet as just a powder, and then they can mix it in with flour and water and create their own starter from your starter. So that's idea number one, is like an ultra premium sourdough starter that has never touched plastic.\r\n\r\n\r\nNikolas Hulewsky (06:49.838)\r\nOkay, so this is already a thing, like never touch plastic is a thing.\r\n\r\n\r\nChris Koerner (06:53.462)\r\nNo, it's my domain name, it's my website. It's not a thing.\r\n\r\n\r\nNikolas Hulewsky (06:55.786)\r\nOkay, so you have a never touch plastic domain site and there's different niches within that. Sourdough could be one of them. Hey, this is never touch plastic and you could have a whole host of other things of quote unquote never touch plastic.\r\n\r\n\r\nChris Koerner (07:02.274)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (07:08.204)\r\nYeah. And I love the idea because of the angle behind the idea, which is like a tick tock video. That's like, why are you putting microplastics in your sourdough starter? Your grandkids will be eating your microplastics that's still in your sourdough starter, right? It's like, it's fear cells and it's fear. So that's like idea. Number one is just to sell a sourdough starter. That's literally never touched plastic. Okay. Idea. Idea. Number two is like a marketplace, like Etsy.\r\n\r\n\r\nNikolas Hulewsky (07:29.132)\r\nYeah. Okay. Love it.\r\n\r\n\r\nChris Koerner (07:37.434)\r\ncalled Never Touch Plastic, where people can, it's like the Etsy for things that have never touched plastic, like sourdough starter, where anyone can, can build, buy and sell on the marketplace to each other.\r\n\r\n\r\npeople that are most concerned about microplastics.\r\n\r\n\r\nNikolas Hulewsky (07:56.012)\r\nlooking something up right now. So banana, Muhammad edit that part out. Alright, so there's two things the idea itself. Whatever. I'm like, sourdough, you know me, I'm like, that sounds stupid. However, like there's a business there, right? I love the like you said, the idea behind the idea, which is people are really concerned about microplastics. And they're doing a bunch of things now to focus on that. Like you have the brickie or how or, you know, the fabricki\r\n\r\n\r\nIs that what it's called? The water dispenser that is not the Berkey. I'm so dumb, but the Berkies are popular, right? You can get your water that's stored there. There's no microplastics involved. So I like the trend behind the trend. also, I love that we're always thinking about the distribution angle of it where you where you're like, do you think of the video that could kind of push this and promote it? And\r\n\r\n\r\nChris Koerner (08:30.104)\r\nBerkey.\r\n\r\n\r\nChris Koerner (08:51.075)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (08:54.584)\r\nParadoxically, I like the idea of the marketplace better than just the niche idea. I like the idea of you turning Never Touch Plastic just into a marketplace like Etsy, where it is a bigger idea, but I also think, I don't think it, like you could, could be Reddit-like. Like it doesn't need to have a slick user interface to get it launched.\r\n\r\n\r\nChris Koerner (09:03.502)\r\nThat's a bigger idea.\r\n\r\n\r\nChris Koerner (09:13.134)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (09:17.656)\r\nWell, there are companies like share tribe, share tribe that will allow you to launch your own marketplace without any coding experience. Super easy. Like your own eBay, basically a hundred bucks a month.\r\n\r\n\r\nNikolas Hulewsky (09:27.278)\r\nYeah. And I think there could be, mean, you're a part of a lot of Reddit groups, Facebook groups, I think you could pretty easily get people going to that website and exchanging ideas, even if it was just started as Hey, my sourdough idea. And then all of sudden, it's it's like it's it's Reddit for never touch plastic. And then people are starting different subreddits, quote unquote, or whatever, that are talking about specific niche ideas. I don't know, like\r\n\r\n\r\nChris Koerner (09:42.958)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (09:48.248)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (09:54.24)\r\nFood would be one of them. Is there anything with clothes? There's got to be like never touch plastic for clothes, right? That's got to be a big one.\r\n\r\n\r\nChris Koerner (09:57.166)\r\nClose, yeah. yeah. Yeah, and what you can do on this site is you can have like a certification program where they can pay me or the site owner to send in their product to third-party labs that test for microplastics. Because there is like a measurable number attached to microplastics.\r\n\r\n\r\nNikolas Hulewsky (10:15.566)\r\nOkay, dude, I just thought of this. What if instead you didn't, I mean, yes, it's a marketplace, but you just went and like aggregated all of the never touch plastic things. So you went to Berkey, you went to whoever's doing this, Brian Johnson's company, because there's probably no consolidated place where people can actually go and find these things, right? So it's literally just a landing page that directs people to these different websites that offer.\r\n\r\n\r\nChris Koerner (10:28.642)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (10:36.11)\r\nRight. It could just be affiliate links. Yeah.\r\n\r\n\r\nNikolas Hulewsky (10:44.352)\r\nat a certain threshold of whatever parts per million of plastic companies that are certified to sell on the website, then you don't even need to worry about the community thing.\r\n\r\n\r\nChris Koerner (10:51.086)\r\nI mean,\r\n\r\n\r\nYeah, I it could be, I mean, I was never really thinking of community. I'm thinking like a marketplace, like eBay, right? But it could literally just be a Shopify store where you list a Berkey for sale and it's just drop shipped. And I don't say drop ship in the spammy like the spammy way. I mean in the literal way where you sell a Berkey at X price when it sells, Berkey gets a notification and they ship it to the end customer and you take a margin there.\r\n\r\n\r\nNikolas Hulewsky (10:58.55)\r\nOr marketplace, sorry, sorry, I marketplace. Yeah.\r\n\r\n\r\nChris Koerner (11:22.37)\r\nright? So you're not fulfilling any products.\r\n\r\n\r\nNikolas Hulewsky (11:24.674)\r\nDude, you remember how early on we decided you can't bring up an idea unless you had distribution? I think I have a new thing we need to add. You can't bring up an idea unless you talk about how you would use chat GPT or AI. In particular, it's like this is I would use deep research to be like, okay, find me all the premium products that market themselves as plastic free. And I would just start getting a list and.\r\n\r\n\r\nChris Koerner (11:29.528)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (11:37.474)\r\nMmm.\r\n\r\n\r\nChris Koerner (11:49.102)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (11:51.786)\r\nknow, we know about affiliate marketing, I then would start reaching out to those people. You could do it through operator, but operators just not there yet. But now you have the list. You could automate it. You start reaching out to them and say, Hey, can I have an affiliate link? And you just start building out this website and then everything that we've talked about with programmatic SEO, you start building out a programmatic SEO that's all pointing to never touch plastic. And then you have the affiliate links that then when people come there, they're then clicking out like it would probably take six months to a year. But I would think then you just have this passive, literally passive.\r\n\r\n\r\nChris Koerner (12:14.382)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (12:21.258)\r\nincome based on a website that you've built using deep research to identify the products that you want to have on the website and then automating the outreach so you can get the affiliate links.\r\n\r\n\r\nChris Koerner (12:31.79)\r\nhere for it.\r\n\r\n\r\nNikolas Hulewsky (12:32.845)\r\nI think that's a really cool idea.\r\n\r\n\r\nChris Koerner (12:35.042)\r\nWe just talked about passive income and drop shipping in the same conversation. Like all the legitimate, all the legitimate listener listeners have already turned us off. Retention just fell off a cliff.\r\n\r\n\r\nNikolas Hulewsky (12:38.03)\r\nIn a non-ironic.\r\n\r\n\r\nNikolas Hulewsky (12:47.246)\r\nand then you can sell a course on how to do it.\r\n\r\n\r\nChris Koerner (12:49.55)\r\nhuh. Yeah.\r\n\r\n\r\nNikolas Hulewsky (12:51.342)\r\nI like that idea. Let's go on. Okay, you ready?\r\n\r\n\r\nChris Koerner (12:54.83)\r\nThat's good. Yeah, let's do it.\r\n\r\n\r\nNikolas Hulewsky (12:59.416)\r\nSo I'm not going to get political on here, but I am to bring up something that has politics involved. Doge. You're familiar with what's going on with Doge, right? Department of government accountability, not as kind of efficiency. There we go. It's actually really funny. Did you know that Doge is not a new government entity like he they couldn't create a new government organization. They just rebranded an existing government organization as Doge. Yeah, it was like the.\r\n\r\n\r\nChris Koerner (13:10.926)\r\nEfficiency. Efficiency.\r\n\r\n\r\nChris Koerner (13:26.648)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (13:29.282)\r\nI can't remember what it was. It's like IT informatics, some department, whatever. Anyways, something that needed rebranding. So you got Doge coming in. And I heard a couple of really cool ideas this week. One of them just automatically sent a light bulb in my mind because we you and I talk a lot about piggybacking. I love piggybacking. So I'm going ask you this question, Chris.\r\n\r\n\r\nChris Koerner (13:32.334)\r\nMm hmm. Something something that needed rebranding.\r\n\r\n\r\nChris Koerner (13:50.254)\r\nAre you are you about to bring up a piggybacking idea cuz I'm gonna follow you\r\n\r\n\r\nNikolas Hulewsky (13:56.654)\r\nI'm about I'm about to bring it up, bro. I want I want you to guess which government program subsidizes entrepreneurs the most more than any other program more than the SBA more than probably even tax credits.\r\n\r\n\r\nChris Koerner (14:19.022)\r\nUmmm... Man.\r\n\r\n\r\nIs it, I don't know.\r\n\r\n\r\nNikolas Hulewsky (14:25.004)\r\nOkay, you ready for this? And we're going to go through an example. The United States Postal Service. I don't think people think about this a lot. I don't think people think about this. So the United States Postal Service is subsidized by the government. It is not profitable. It has not been profitable for a very long time. In fact, just in the last few days, they moved the the Postal Service under the Department of Treasury so that it's now being managed by the Treasury as opposed to.\r\n\r\n\r\nChris Koerner (14:32.088)\r\nI'm, I was not about to guess that. I was not about to guess that, but that's a good point.\r\n\r\n\r\nChris Koerner (14:41.422)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (14:54.37)\r\nbeing a standalone agency. So I did some research because I used deep research for this and the stuff that I freaking blew my mind. If I were to send 10,000 postcards, just regular four by six postcards, one ounce, and I were to send that through FedEx, give me a give me a ballpark per postcard what it would cost me.\r\n\r\n\r\nChris Koerner (15:18.51)\r\nI mean, they don't really do that. You would have to, it would be multiple dollars per postcard in my experience.\r\n\r\n\r\nNikolas Hulewsky (15:26.38)\r\nYeah, in the realm of like $1.25 per postcard. Now, granted, I could be off with my research, but that's what I'm coming up with. The United States Postal Service, how much does it cost to send on a per postcard basis?\r\n\r\n\r\nChris Koerner (15:39.406)\r\nOh, geez. 20 to 40 cents?\r\n\r\n\r\nNikolas Hulewsky (15:43.726)\r\nSo it costs right now between 33 and 36 cents per postcard. So right there, let's just say a dollar and then let's say 33 cents, 67 cent difference, 67 cent cost savings by going through the USPS versus FedEx. But wait, there's more. If you have bulk rates, so you actually have a permit to send bulk items through the USPS, that rate actually will come down.\r\n\r\n\r\nto anywhere between 20 cents and 29 cents per postcard for those. I know, know dude, that's okay. So tell us your idea with chunky mailers.\r\n\r\n\r\nChris Koerner (16:16.376)\r\nYou're talking to the former owner of chunky mailers, Nick. Come on now. Chunky mailers is built on the thesis that people do not throw away packages. They throw away postcards and spam mail, but not a package with something in it. So chunky mailers is an outsourced mailing service for small and medium sized businesses where, you know, we would send out an advertisement, a flyer inside of like a padded envelope.\r\n\r\n\r\nwith some sort of an item in there, maybe like a disposable toothbrush or something, just to get them to open it and be more likely to read the ad.\r\n\r\n\r\nNikolas Hulewsky (16:52.61)\r\nYeah, so people are going to throw it away and it's a marketing channel. So that was the idea behind chunky mailers. We worked with Christian rough. Shout out to Christian for like a hot minute.\r\n\r\n\r\nChris Koerner (17:01.43)\r\nAnd it's called jumbo male marketing now, by the way. It's still a thing.\r\n\r\n\r\nNikolas Hulewsky (17:03.404)\r\nYeah. So anyways, people have been in physical mail. It has very different rules and regulations as opposed to email like from what I you would know this better than me. Like you can say whatever the freak you want through the mail, but there's lots of rules about spamming emails. It's crazy, right? Like emails. Hey, you gotta have a like opt out list and you can't spam people and you'll get banned from from Gmail if you're sending too many spam emails. But the US Postal Service.\r\n\r\n\r\nChris Koerner (17:19.342)\r\nWhich is crazy to me.\r\n\r\n\r\nI mean.\r\n\r\n\r\nNikolas Hulewsky (17:32.814)\r\nCause I'm whatever the frick you want.\r\n\r\n\r\nChris Koerner (17:33.122)\r\nNick, my mailbox is literally 200 feet from my front door. And you know how many times I walk all the way out to the mailbox, huffing and puffing only to pull out a bunch of junk mail? Like, because there's you're right, like, I can easily delete an email or just set up a filter to never even see those emails. But the people who do that to me like, could be fine or worse. But anyone can mail anything to anyone they want.\r\n\r\n\r\nNikolas Hulewsky (17:42.946)\r\nHa ha.\r\n\r\n\r\nNikolas Hulewsky (17:59.98)\r\nIt's crazy, it's freaking crazy, but I want to walk. So I want to walk through these numbers just like OK, that sounds cool. Let's just say the average cost savings is 70 cents. Per postcard, OK? What does that mean? This is a marketing channel. Let's say we have two founders and they each send out 10,000 postcards to acquire a customer for founder number one. They do it through the through FedEx founder number two does it through the USPS FedEx. They just spent $10,000.\r\n\r\n\r\nto send out 10,000 postcards. Founder number two just spent $300 to send out 10,000 postcards. And let's say that their percentage of conversion is the same. So of the 10,000, let's say that they convert, and I'm just gonna use like really easy numbers, because I'm painting a picture, right? Of the 10,000, they convert 1%. So they convert 10 people, and each of those 10 people represents a lifetime value of, let's just call it $100. All right?\r\n\r\n\r\nSo for the first founder who spent $10,000 and got 10 customers, what's the customer acquisition cost?\r\n\r\n\r\nChris Koerner (19:07.214)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (19:11.374)\r\n$1,000 or that.\r\n\r\n\r\nNikolas Hulewsky (19:14.402)\r\nRight? Yep. Yep. They spent $10,000. They got 10 customers. It was $1,000 per customer. Customer acquisition cost was $1,000 per customer. Right? Founder number two spent $300 and got 10 customers. Their customer acquisition cost was $30. So you already there, you're like massive different 33X. Then you go to the LTV and you say each one of them, each customer has $100 LTV. All right. Like, sorry, excuse me, lifetime value and the way that\r\n\r\n\r\nChris Koerner (19:31.854)\r\n33x difference.\r\n\r\n\r\nChris Koerner (19:40.397)\r\nlifetime value.\r\n\r\n\r\nNikolas Hulewsky (19:44.13)\r\npeople will look at these equations, not equations, but ratios is like, if your lifetime value to customer acquisition costs is three or higher, that's fantastic. Like you're doing a really good job, but that's the ballpark that you want to be in. Right? So founder number one has spent a thousand dollars to acquire one customer whose LTV is 100. So they've got a literally a negative ratio of LTV to CAC. Founder, founder number two, it's not negative, but it's, it's a decimal as opposed to a whole number. Founder number two,\r\n\r\n\r\nspent, what did we say? $30 for $100 LTV. So he's got an LTV of 3.33. So he's in the golden range. Now they're selling the same product, but if your customer acquisition cost, excuse me, your LTV to customer acquisition cost is three versus 0.0001, which business model is viable? The second founder, because he has distribution.\r\n\r\n\r\nChris Koerner (20:18.146)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (20:26.798)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (20:44.92)\r\nSo why did I just go through all that stupid math? Hopefully not a lot of people checked out. The point of it is the United States government, at least for right now, is subsidizing one of the biggest marketing channels in the world that I think a lot of people forget about, which is postal. We think about email marketing. We think about texts. We think about Facebook and Google ads and all that other crap. But we don't think a lot about postal. So I wanted to talk with my boy and think about what are some cool business ideas we could piggyback?\r\n\r\n\r\nChris Koerner (20:59.608)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nChris Koerner (21:10.926)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (21:15.246)\r\noff of the postal service. We already talked about Jumble Mailers. That was rad. Here's one idea to get us started. Do you remember your idea about the Uber drivers like a couple months ago that they would become like marketers? They would work for you and okay. Is there a way we could do that with postal service drivers? Like, okay, they have routes. Like, is there something we could do with postal service drivers where\r\n\r\n\r\nChris Koerner (21:27.362)\r\nMm-hmm. Yeah,\r\n\r\n\r\nChris Koerner (21:34.19)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (21:40.93)\r\nWe just have a survey of postal service drivers. It's like, hey, how many houses did you see for sale? Or, you know, maybe it's informatics that we're collecting from them. Maybe it's sentiment we're collecting from them. Maybe it's like, hey, I want to know how many houses are in foreclosure in this area or like which area has unkempt yards or there's got to be something that we could like glean from these postal drivers because they like they just know their routes exceptionally well. So like, could there be a way for us? OK.\r\n\r\n\r\nChris Koerner (21:47.534)\r\nChris Koerner (21:57.485)\r\nMm-hmm.\r\n\r\n\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (22:05.582)\r\nI an idea.\r\n\r\n\r\nI've got an idea. What do you want? Can I say it?\r\n\r\n\r\nNikolas Hulewsky (22:12.59)\r\nYou\r\n\r\n\r\nChris Koerner (22:14.786)\r\nDude, so I tweeted a while ago about driving for dollars, right? The best way to find good real estate deals. What do we say on this podcast? The harder way is usually the better way, which is the whole thesis of stop cold emailing because it's easier. Therefore it's not as good, right? They're their exception. Sure. But direct mail is hard and it's a lot more expensive than cold email, but it's probably the better way, right? So when you're looking for off market real estate properties, everyone wants to do the sexy thing. They want a cold call, cold text, cold email.\r\n\r\n\r\nNikolas Hulewsky (22:36.664)\r\nYeah, yeah.\r\n\r\n\r\nChris Koerner (22:43.352)\r\nOkay, but the best way, the most efficient way, because efficiency and effectiveness are always at odds with each other, the most efficient way is driving for dollars. Driving around, let's talk about single family, driving around neighborhoods, finding the ugly homes, going online, looking up the tax records, getting someone on the phone that has an ownership interest in that home. Okay, so I had a business partner that used to find these ugly homes by hiring people in all kinds of markets across Texas and Oklahoma on Craigslist.\r\n\r\n\r\nNikolas Hulewsky (22:52.11)\r\nHmm. Okay.\r\n\r\n\r\nChris Koerner (23:11.81)\r\nto go around with flyers and put a flyer on the door of a house like this and then they just wait. And after they put the flyer on the door, they would take a picture of it, write down the address, send it to my business partner, and then he would get to work at finding them. But he needed physical people on the ground to drive for dollars and he would pay them per door. So why not just, and I've done this, roll up to the post office in the morning when they're all about to leave for their routes at the same time, because they do, say, hey man, first of all, there's\r\n\r\n\r\nNikolas Hulewsky (23:13.678)\r\nMmm.\r\n\r\n\r\nChris Koerner (23:41.118)\r\napps that you can download to your phone that are like it will basically tie your phone's camera to the address of the house using you know just turning on your geo location services right and say hey man like it's just an app that takes pictures that will tie the picture to the address of the house so like you take a picture of a house and then it will show over the picture what the address is so hey man yep we download this app anytime you see a house that looks like crap take a picture of it text it to me this number right here i'll send you 10 bucks\r\n\r\n\r\nNikolas Hulewsky (23:51.246)\r\nWhat do mean?\r\n\r\n\r\nNikolas Hulewsky (23:56.041)\r\nokay. Got it. Yeah, yeah. Got it.\r\n\r\n\r\nIt's got a geo stamp. Yeah.\r\n\r\n\r\nChris Koerner (24:10.936)\r\nfor everyone. This is what I do. I buy houses like these yada yada yada. Boom. Give it a shot.\r\n\r\n\r\nNikolas Hulewsky (24:14.84)\r\nWow, that's a really cool idea. Here's my next question. Why doesn't the government monetize this? I know that, gosh, I can't believe I even said that. my gosh, I hope I get roasted for even saying that. I'm so stupid. But in all seriousness, if I'm the government, why would you not turn these people who are, they're already delivering packages into another, I guess, revenue channel?\r\n\r\n\r\nChris Koerner (24:27.512)\r\nThere it is. There it is. Mohammed, leave this in.\r\n\r\n\r\nNikolas Hulewsky (24:43.83)\r\nSo like, for example, how crappy are surveys? Have you ever tried to get a survey, right? Like of a sample set of random people who are willing to take a survey. Do know how the surveys work by the way? I'm gonna go like a rabbit hole right now. I have a friend who works at, he works at Qualtrics. Qualtrics is like the preeminent survey company, right? They do surveys for corporations, governments, whoever else.\r\n\r\n\r\nChris Koerner (24:52.504)\r\nHmm.\r\n\r\n\r\nChris Koerner (24:55.916)\r\nMm-hmm. What? Sure. Let's do it.\r\n\r\n\r\nChris Koerner (25:07.854)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (25:11.916)\r\nAnd this is the way that they currently do their surveys. There are opt in lists of people who have said, yep, I'm willing to do a survey. And so then so they contact those people. And most of time, there's some like monetary incentive involved with it. It's like, hey, we'll pay you X because the corporation has said, here's the budget for us to conduct the survey. And so people who have opted into the survey are getting a little bit of a financial incentive. There's two problems with that. The first problem is you have a biased sample set. So the people who have opted into the survey, it's not necessarily representative of the whole population. The second.\r\n\r\n\r\nChris Koerner (25:18.318)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (25:23.406)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (25:41.698)\r\nThe second problem is they're opting into the survey for financial reasons. So you don't know whether or not the information that they're giving you is correct. They could have just said they just wanted money, and so they're going to get an answer. But it's the best that they have. And so they do their best based on these surveys to extrapolate information and then make decisions. Now, we saw what happened in the 2016 election with polling data. Yes. With polling information where it's like, Donald Trump's going to lose. Donald Trump's going to And then he freaking pulls it out.\r\n\r\n\r\nChris Koerner (26:02.776)\r\nRemind me to give you a business idea after this.\r\n\r\n\r\nNikolas Hulewsky (26:11.182)\r\nThere's obviously big error rates because of not only who is participating, but how they choose to answer the questions that they're participating in. All right, so that's problem number one. Why wouldn't the government, like why wouldn't they let Qualtrics use their distribution channel of people who are delivering mail to conduct surveys? You know what I mean? Charge Qualtrics however much money.\r\n\r\n\r\nChris Koerner (26:32.418)\r\nI mean, the government could let any, any company use all of their many distribution channels, the post service being one of hundreds or thousands for any number of monetization purposes, right? Like amen.\r\n\r\n\r\nNikolas Hulewsky (26:43.106)\r\nRight. Because like, don't well, that's my point is like, Doge is just focused on cutting costs. And that's important. Don't get me wrong. What about increasing revenue, not increasing revenue through taxation, but like increasing revenue through generating revenue, like literally generating revenue, they have all these vacant office buildings, sell the leases, there's revenue there that they could generate, right?\r\n\r\n\r\nChris Koerner (26:54.263)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (27:02.776)\r\nWe need a doge for the government's profit center, not just for their cost center. That's what you're saying, right? What are we doing?\r\n\r\n\r\nNikolas Hulewsky (27:07.97)\r\nYes. Yes, we need a doge for revenue, dude. What? my, did we just invent that, dude?\r\n\r\n\r\nChris Koerner (27:14.67)\r\nDid we just invent revenue?\r\n\r\n\r\nNikolas Hulewsky (27:17.336)\r\nThey're Doge and this is Dogger, the Department of Government Revenue. Ho, ho, ho, ho. I'm a dirty boy, my friend.\r\n\r\n\r\nChris Koerner (27:21.55)\r\nWow.\r\n\r\n\r\nChris Koerner (27:28.312)\r\nThat's what, who do we get on this? We getting Bezos on this? What are we doing? He's retired, right?\r\n\r\n\r\nNikolas Hulewsky (27:34.126)\r\nCould you, you're the influencer now between the two of us. Could you like talk to Elon? Do you any poll? Be honest. Do have any poll?\r\n\r\n\r\nChris Koerner (27:37.176)\r\nBut, I'll see what I can\r\n\r\n\r\nNikolas Hulewsky (27:42.978)\r\nYou\r\n\r\n\r\nChris Koerner (27:44.472)\r\nCan I give you my business idea that's built off of what you just said? Surely you saw that tweet of the guy that launched the business that can basically predict if you're going to go viral on Twitter before you ever tweet. Did you see that? Yeah. Yeah. It's like a thousand bucks a year or something. And you like upload it, like it connects to the Twitter API. You type in your tweet and it pulls all the data points and it's like, yeah, this isn't going to go viral or this is going to go viral with 84 % certainty. Yeah. Pretty cool. Pretty cool. Right.\r\n\r\n\r\nNikolas Hulewsky (27:46.092)\r\nYes. Yes.\r\n\r\n\r\nNikolas Hulewsky (27:56.684)\r\nNo, no.\r\n\r\n\r\nNikolas Hulewsky (28:11.222)\r\nNo way.\r\n\r\n\r\nDoes it work? Okay. Okay. Let's assume it works. Keep going. Is this Alex Finn?\r\n\r\n\r\nChris Koerner (28:15.02)\r\nI don't know. He's like onboarding people right now. We'll assume it works.\r\n\r\n\r\nNo, but he's copying that. He's launching his own version of that because that guy's tweet went viral and he's getting a lot of crap for it. But he's like, Hey, don't hate the player. Like whatever. It's a good idea. Anyway, here's the idea. Qualtrics built on AI. What are we doing? You take a company that has all this survey data. It knows that a 36 year old in Omaha, Nebraska that makes $74,000 a year that has three kids that's Christian, that's Republican yet. It knows how they\r\n\r\n\r\nNikolas Hulewsky (28:23.392)\r\nOkay. Dude.\r\n\r\n\r\nChris Koerner (28:49.966)\r\nFill out surveys, right? You upload all this survey data into AI and you say, all right, give me the survey results for all these questions based on this demographic within 80 % reasonable certainty. How much does Qualtrics charge? A stupid amount. Like a stupid, it's a multi-billion dollar company. You could charge a fraction of what Qualtrics charges. It's the, it's like what Chamath said about 80, 20, right? It's like, or it's like 90 % of the features for\r\n\r\n\r\nNikolas Hulewsky (28:51.278)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (29:16.942)\r\n90 10.\r\n\r\n\r\nChris Koerner (29:18.83)\r\n90 % less cost. So it's the AI version of Qualtrics for 90 % less.\r\n\r\n\r\nNikolas Hulewsky (29:24.396)\r\nWait, wait. So you're saying like Qualtrics has already done all of these surveys and they're just kind of repurposing the surveys and you're mining it through AI? OK. Sorry.\r\n\r\n\r\nChris Koerner (29:30.2)\r\nForget Qualtrics. Just like any company, whether it's like a corporation that sends out surveys, or could be Qualtrics, that already has survey data, or not. Or like one company aggregates all the survey data they can, uploads it to AI, and then a company's like, all right, I want these 38 questions to be answered based on this type of person in the United States, or in Moldova, or wherever, and it just spits out the answers.\r\n\r\n\r\nNikolas Hulewsky (29:53.4)\r\nBroski Broski Broski. OK. This isn't necessarily an idea for specific business. Do you know what the big problem was with social media a few years ago when they're making so much money and user data? People are like. I'm the product. Why are you making money off of me? This is ridiculous. You just I don't know if this anyways. I think in the future, why would you not be able to opt into these surveys and say, hey, look, this is my agent?\r\n\r\n\r\nChris Koerner (30:07.64)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (30:21.272)\r\nThey have access to all of my information. They've seen my emails. They've seen my texts. You know, maybe they've got air, air.ai pendant. They know everything about me. I don't have to answer a stupid survey. My AI will know the answer. They'll do it for me and I can opt in and you can pay me and it's like revenue generating off of your agent because they want to know that information and they want it to be accurate, right? And you're like no skin off my back. I'll just use my agent to answer the questions and I generate a little bit of money. Why would you not do that?\r\n\r\n\r\nChris Koerner (30:26.424)\r\nMmm.\r\n\r\n\r\nMm-hmm.\r\n\r\n\r\nThey'll do it for me. Yeah.\r\n\r\n\r\nChris Koerner (30:49.89)\r\nYeah. So it's basically the other side of that marketplace you're saying, right? That's kind of solving the consumer side of it. So instead of Qualtrics giving a $10 Starbucks gift card to John, it's given a $10 Starbucks gift card to John's agent and John's chilling path making passive income. That's the second passive income mention of the episode.\r\n\r\n\r\nNikolas Hulewsky (30:53.55)\r\n100%.\r\n\r\n\r\nNikolas Hulewsky (31:04.504)\r\nJust.\r\n\r\n\r\nBro, will, that's really, dude, that is really gonna be a pass, like, 10 years from now, you're gonna, people who are gonna be like, this is passive, bro, all you have to do, spin up an agent, put your information on there, you could be making 10 bucks a day. You know what I mean? Like, and why not? Why wouldn't you do that?\r\n\r\n\r\nChris Koerner (31:12.654)\r\nlegitimately.\r\n\r\n\r\nChris Koerner (31:23.886)\r\nAnd Qualtrics is like, we can't give you 10 bucks because it's an agent. OK, give me five bucks. I don't care because it's going to take a thousand of these a day. Whatever.\r\n\r\n\r\nNikolas Hulewsky (31:31.842)\r\nDude, and how much more money would people pay for that survey data than just the random? I'm on YouTube. I put videos on YouTube. I made 100 bucks on YouTube last month. You don't need to worry about me, OK?\r\n\r\n\r\nChris Koerner (31:44.596)\r\nOkay, I'm not worried about you now. I was.\r\n\r\n\r\nNikolas Hulewsky (31:49.326)\r\nAnd there are times where I'm trying to watch a YouTube video and it's like to have no ads in this video, fill out this brief survey. It's like, which rental car did you use in the last month? I don't even read the questions. I just pick one. I'm like, pick next. You know what I mean? I am a rebel. like that is. I can either confirm or deny, but that's another question we need to talk about. When our temple recommends can be fully digitized. I'm tired of carrying around my recommend.\r\n\r\n\r\nChris Koerner (32:02.914)\r\nYou're a rebel, Do you have a temper recommend? Huh. Okay.\r\n\r\n\r\nNikolas Hulewsky (32:18.166)\r\neverywhere. It's starting. Anyways, dude, why would you not? Dang it, I just lost my fucking you. I'm answering the stupid YouTube survey. That's that didn't give them any good information. Because I didn't actually do those things. But they're going to take it and be like, this is good information. So why would I not use AI, which actually knows those things about me, which is like, Hey, well, in the last month, which of these rental car companies did you use? Well, it's a good question. Let me go look at\r\n\r\n\r\nChris Koerner (32:18.562)\r\ndoing here? What are we doing guys?\r\n\r\n\r\nChris Koerner (32:25.87)\r\nSorry, that's on me.\r\n\r\n\r\nChris Koerner (32:33.486)\r\nMm-mm.\r\n\r\n\r\nNikolas Hulewsky (32:45.772)\r\nNick's credit card information. he used enterprise and he used Avis. interesting. Okay. Boop, boop. And then they have better information. I didn't have to do it because I think people just want to get through the survey as quickly as possible. and I can make money off of it. That would be amazing.\r\n\r\n\r\nChris Koerner (32:51.118)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (33:01.262)\r\nDo you think YouTube discounts your answer if you answer really quickly? There's a side note. I have to. that was Nick again. Nick, come on.\r\n\r\n\r\nNikolas Hulewsky (33:05.634)\r\nThey must write. They're so smart. They're like, it's too quick of an answer.\r\n\r\n\r\nNick. Nick, can't answer that quick.\r\n\r\n\r\nChris Koerner (33:14.222)\r\nGrrrr\r\n\r\n\r\nNikolas Hulewsky (33:18.382)\r\nyour go back to the old stuff. This is just a cash grab Chris. Sorry.\r\n\r\n\r\nChris Koerner (33:19.128)\r\nQuickie-nicky.\r\n\r\n\r\nChris Koerner (33:27.662)\r\nThat's a bunch of good ideas. That's a bunch of good ideas.\r\n\r\n\r\nNikolas Hulewsky (33:30.998)\r\nI'm really interested to see when and if that starts happening because that feels like a no-brainer to me.\r\n\r\n\r\nChris Koerner (33:34.252)\r\nThat's going to happen. It's going to happen. Yeah. We don't need people taking manual surveys anymore.\r\n\r\n\r\nNikolas Hulewsky (33:41.174)\r\nWell, dude, and we already know that open eyes selling our information to Google, whoever the advertisers are that want to know what we're searching currently in chat GPT. So it's like it's going to happen.\r\n\r\n\r\nChris Koerner (33:56.622)\r\nAll right, so you had a piggyback idea. Can I, can I give you mine? All right. Longevity blowing up, right? Brian Johnson, longevity. It's blown up. It's not going anywhere. We're not going to want to suddenly start living less. Okay. What's the creme de la creme of longevity? I'll answer it for you. Plasma transfusion. Okay. Did you know that Brian Johnson swaps blood with his like 18 year old son?\r\n\r\n\r\nNikolas Hulewsky (34:02.722)\r\nBlown out.\r\n\r\n\r\nNikolas Hulewsky (34:14.958)\r\nThank you.\r\n\r\n\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (34:20.909)\r\nOkay.\r\n\r\n\r\nthe weirdest sentence I've ever... No, he doesn't swap blood, he swaps plasma.\r\n\r\n\r\nChris Koerner (34:25.837)\r\nI\r\n\r\n\r\nChris Koerner (34:30.168)\r\nSure, the liquid part of blood.\r\n\r\n\r\nNikolas Hulewsky (34:33.728)\r\nIs plasma the liquid part of blood?\r\n\r\n\r\nChris Koerner (34:35.446)\r\nAccording to Chad GPT.\r\n\r\n\r\nNikolas Hulewsky (34:37.262)\r\nI thought they take blood and they put it in the centrifuge and they spin it and so it separates the plasma from anyways, whatever he gets plasma and yeah, yeah. Okay.\r\n\r\n\r\nChris Koerner (34:44.878)\r\nPlasma is the liquid part of your blood. Anyway, and it's like, you know, it's kind of what Lance Armstrong did. And some of the science says it helps you live longer. Some of the science is like, eh, not really. It doesn't really work like that. Nevertheless, we're not going to let real science stop a good business idea, right? Or else there'd be no skincare companies or yeah. So are you ready for this?\r\n\r\n\r\nNikolas Hulewsky (35:00.846)\r\nHmm. Never has. I'm sorry, would Dr. Osby in business if that happened? No.\r\n\r\n\r\nChris Koerner (35:13.388)\r\nWhy aren't any entrepreneurs out there piggybacking on dialysis clinics to do plasma transfusion?\r\n\r\n\r\nfor the wealthy.\r\n\r\n\r\nNikolas Hulewsky (35:26.349)\r\nWow.\r\n\r\n\r\nChris Koerner (35:26.604)\r\nAll the equipment's right there. You think dialysis clinics have no capacity? You think they're just cranking out patients 24 seven?\r\n\r\n\r\nNikolas Hulewsky (35:35.298)\r\nmean, it does depend on the dialysis clinic, I will say that, because I actually know the space a little bit, but yeah, yeah, yeah. Okay, this is really interesting. here's, for those people who don't know dialysis, dialysis is for people who have kidney failure, kidney disease, I'm not sure the exact definition or word that I should use, but the kidneys don't function properly, and so they have to go in frequently depending on the severity of their diagnosis.\r\n\r\n\r\nChris Koerner (35:40.807)\r\nThat's why I'm talking to you about it. Increase your operating hours.\r\n\r\n\r\nNikolas Hulewsky (36:04.246)\r\nto have dialysis and what dialysis is essentially an artificial function of their kidney that they're going in. Yep. Which is what your kidney does. So typically dialysis centers are very popular with the elderly population. Like, yes, there are people who have this disease that are younger, but typically it's as you age, you're more likely that your kidneys stop functioning well. So they're dealing with like Medicare, Medicaid, that type of population. Recently, I've started seeing mobile.\r\n\r\n\r\nChris Koerner (36:09.464)\r\nfilters their blood.\r\n\r\n\r\nNikolas Hulewsky (36:33.058)\r\ndialysis clinics, but what they're doing is they're going to skilled nursing facilities and piggybacking off of a skilled nursing facility distribution. But this is not that this is premium, right? Like this is this would be high end dialysis that is offered to people. Why would you? Yeah, why would you not do that? You go to you go to a company that already has the infrastructure and use its legal perfectly well. And you say, I just want to test this. How would you test it? All right, that's my next question. All right, I'm with you.\r\n\r\n\r\nChris Koerner (36:38.712)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (36:52.973)\r\nlegal.\r\n\r\n\r\nNikolas Hulewsky (37:03.532)\r\nFind someone, they have the equipment, they have the expertise, they have the clinical team, they could go and actually provide dialysis to somebody. How would you test demand for this in your market?\r\n\r\n\r\nChris Koerner (37:12.543)\r\nI think you would need to generate some like organic PR for it. And I think it's the type of topic that could be able to do that fairly easily because it's polarizing and controversial.\r\n\r\n\r\nNikolas Hulewsky (37:26.37)\r\ndude. Okay, I know where I would go. I talked I talked to a I won't say his name, but he's a he's a pediatric physician. And he his wife is an nurse practitioner, he wants to open a med spa. He's like, I want it to be a high end med spa, though. I don't want to be just like doing Botox, we want to be doing like, good.\r\n\r\n\r\nChris Koerner (37:39.395)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (37:45.166)\r\nHas anyone out there ever said I want to open a low end med spa? mean, come on.\r\n\r\n\r\nNikolas Hulewsky (37:50.51)\r\nWell, granted, this guy's making a couple million dollars a year. So I'm and lives in Beverly Hills. So I'm sure it will be a high end med spa. But I think that. Give me, me, me, me. I think that piggyback would then be on. Meds boss. Right, I'm like, OK, hey, or or like testosterone replacement therapy. Lots of guys who are on TRT.\r\n\r\n\r\nChris Koerner (37:56.626)\r\nThat's where I want to be.\r\n\r\n\r\nWeezer reference.\r\n\r\n\r\nChris Koerner (38:04.014)\r\nSorry. I had to say.\r\n\r\n\r\nChris Koerner (38:15.612)\r\nMmm. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (38:20.718)\r\npeople who are doing other hormonal therapy treatments, like just going to them and be like, Hey, what's your population like? I'm more concerned about people who are paying cash and not insurance because I think that they would like this dialysis product and then going going through that I think that would probably be the best.\r\n\r\n\r\nChris Koerner (38:21.496)\r\nThat's smart, yeah.\r\n\r\n\r\nChris Koerner (38:30.296)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (38:35.61)\r\ndude, dude. Yeah, so let's say you own a med spa. You got a thousand customers. You're to take the top 20 % that just buy all the things. They're there every month or every two weeks. They're buying all the things. Okay. You're high rollers. You're going to next time they come in in person, hopefully you've trained your person at the front desk. They're going to say, Hey, you know, next Tuesday we're going to have a plasma transfusion facility here expert professional, and you could use one of the mobile.\r\n\r\n\r\ndialysis clinics to do this. And they can literally just roll up from one to six and you could just pre-sell it. Like, would you, you know, if you book it now, you can get 30 % off and you could educate them. Go ahead.\r\n\r\n\r\nNikolas Hulewsky (39:06.926)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (39:16.984)\r\nDude, okay, I'm gonna build on like, we love the model with the middleman. You don't ever hold any inventory, you're not ever actually doing the service. You're just connecting, you know, the buyers and sellers essentially.\r\n\r\n\r\nChris Koerner (39:29.1)\r\nMm-hmm. You're white lab- you're like white labeling plasma transfusion.\r\n\r\n\r\nNikolas Hulewsky (39:34.37)\r\nDude, you just you you find a clinic, a med spa, you find someone who does dialysis, and you're just like, Hey, I want to try this idea. What do you guys think? And you set it up. And then they do all the fulfillment. Like you're not worried about you don't have to go and get licensure. It's like, okay, just pay me an affiliate fee. Because if you started then doing it at these med spas, I'm just thinking logistically, it's like, okay, it's healthcare, I have to be licensed, I have to get the state on board with it, I have to go through a certification process, I've got to get the insurance because\r\n\r\n\r\nChris Koerner (39:40.417)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (39:51.502)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (40:03.894)\r\nit's healthcare and so there's a lot more risk associated with it. Then I got to manage the employees like logistically it would kind of be a nightmare, but you don't have to do that. You can be a middleman. You just go and hook up the buyers and sellers. hey dialysis person come meet med spa person whoop.\r\n\r\n\r\nChris Koerner (40:11.95)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nChris Koerner (40:16.686)\r\nThat's it. Piggyback.\r\n\r\n\r\nNikolas Hulewsky (40:20.142)\r\nThat'd be a perfect piggyback, dude.\r\n\r\n\r\nChris Koerner (40:21.826)\r\nYou know who would be your other market for this? Frickin cyclist Lance Armstrong style. Because it's only illegal if you're competing, right? But most like. Pants farm strong. That's my alter ego. Yeah. You know that the top one to 3 % of these guys would be into it because they hear about Lance Armstrong like what he cheated blood doping and it made him how much faster? what a piece of crap like but like how did he do it? Logistically speaking, how does one do that?\r\n\r\n\r\nNikolas Hulewsky (40:26.787)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (40:30.306)\r\nVance, Vance Farmstrong? Pants Farmstrong, dang it. Pants Farmstrong.\r\n\r\n\r\nChris Koerner (40:51.308)\r\nWhat a piece of crap. You know they would pay for that.\r\n\r\n\r\nNikolas Hulewsky (40:53.85)\r\nYou know, it would be another interesting thing is if you could go to sauna, cold plunge distributors and just ask like, who's your customer list? I want to contact them. Because if somebody's dropping 10 grand for a sauna, I don't know. It's probably more than that. I don't know. But if you're dropping 50 grand for a sauna, you probably also would be interested in getting platelet or excuse me, plasma treatments",
  "metadata": {
    "duration": "",
    "date": "2025-03-21",
    "platform_source": "Google Drive"
  }
}