{
  "episode_number": "79",
  "episode_title": "How to Do Less, Earn More, and Have Way More Fun with Jessica Miller",
  "guest_name": "Jessica Miller",
  "business_name": "Jessica Miller Coaching",
  "transcript": "﻿Nik (00:01.218)\r\nJessica Miller, welcome to Nikonomics. Very excited to have you here. Why don't you just give the people what they want and tell us what your business is and how you make money.\r\n\r\n\r\nJessica Miller (00:10.448)\r\nThank you so much. I'm so happy to be here. So my name is Jess Miller. I run a business called Jessica Miller Coaching. We focus on growth and sales consulting. Our goal is really to help you run your business in the most efficient and powerful way that you can, which means helping you double your revenue the boring way with what you already have in your business so that you can stop chasing clients and money and essentially leverage all the hard work that you have already done and grow your business with ease in that way.\r\n\r\n\r\nNik (00:38.136)\r\nOkay, so you're working with business owners. I mean, that's your target demo. You're not necessarily working with, I guess, divisions of large corporations or anything like that. You're individuals who own businesses and want to optimize. What's your background? How did you get into this?\r\n\r\n\r\nJessica Miller (00:49.476)\r\nYes, founders and individuals,\r\n\r\n\r\nSo actually by training, I'm actually a pharmacist that I have at MBA. I worked in the pharmaceutical industry for years and then, yep, that's where I started. I was an executive in the companies helping to build teams and grow different products, really with the idea of getting these lifesaving drugs into the hands of the people that needed them. And I started to realize that I wanted to have a bigger impact. I wanted to help people grow. And then I had a very significant health scare, which ended up shifting my life.\r\n\r\n\r\nNik (00:59.33)\r\nNo way.\r\n\r\n\r\nOkay.\r\n\r\n\r\nJessica Miller (01:23.386)\r\nto take that plunge of becoming an entrepreneur, which I thought those were special snowflakes. I was not one of them. But I took the leap and I did it. And I started helping people really focus on making money because I think money is an amazing tool to create what you want in the world. And when I started my business, biggest shocker was that so many amazing, capable people had these great ideas in these businesses, but they were making no money.\r\n\r\n\r\nAnd when they were making the money, they were making it in a very hard and difficult way. And I just thought, what the heck is going on here? I need to help people with this.\r\n\r\n\r\nNik (01:58.828)\r\nThat's a really interesting value proposition. mean, most of the time when I think of coaching, for example, at least the first words that come to my mind aren't, I'm here to help your business make money, right? It may be, you know, I'm here to help you optimize your true self or like, you know, find the things that give you the most satisfaction and passion, et cetera, but I like that you've put those things together, right? Like, yes, I'm coaching you, but my ultimate goal, and I'll know if I'm successful,\r\n\r\n\r\nis if your business makes more money.\r\n\r\n\r\nJessica Miller (02:30.234)\r\nCorrect, yes, yes. And also holding that, like having benevolence for the business. Because when you have goals and you want to do something with your business, sometimes you're in the way of the growth. And sometimes you need someone to help you really say, if this is what you want, here's the path to get there. How do we include you in that? Of course, because you're the most important asset.\r\n\r\n\r\nBut sometimes people are making choices that are making it really hard for them to hit their goals. But there are those opportunities that you can really kind of see fall out when you look at it. Yeah. yeah.\r\n\r\n\r\nNik (03:00.972)\r\nSo I'm not a pharmacist, but I worked in healthcare for a while. Home health and hospice in particular was where I cut my teeth. And there are just a lot of physician -owned, clinician -owned companies that get started because they have the heart for it they want to continue to take care of patients, but they just have no business sense. It doesn't mean they're not smart enough to figure it out. They just don't know. They don't know what a PNL is. They don't know what the difference between your EBITDA and cash in the bank, right? It's just, they have no sense of how to run\r\n\r\n\r\nJessica Miller (03:17.776)\r\nCorrect.\r\n\r\n\r\nJessica Miller (03:26.713)\r\nYes.\r\n\r\n\r\nNik (03:30.54)\r\nbusiness. In your experience, is that kind of your your target demo of like individuals who are passionate about something that sort of fell into business? Or is it is it something different with the individuals who kind of you get in contact with?\r\n\r\n\r\nJessica Miller (03:44.558)\r\nYeah, that's a really good question. So I do work with a lot of med spas who are physician led or they're led by somebody in healthcare. And exactly what you just mentioned, they're in that space. Like they know what they're doing. They're amazing clinicians. But as far as a client journey and understanding how the pieces fit together, understanding where they're leaking money and losing people, it's really difficult for them to figure that out. And everybody thinks it's a traffic problem. Everybody does.\r\n\r\n\r\nNik (03:48.736)\r\nYeah.\r\n\r\n\r\nJessica Miller (04:12.972)\r\nSo they're chasing that and adding people and throwing money at it and ads and all the things because they don't have a sense of how that business works cohesively. So MedSpas are a lot of people reach out to me in that space. The target client that I'm looking for, usually it's a business that's established. They're over a million dollars and they are feeling like they are working really hard to make money. They're doing all the things and they're hitting a plateau.\r\n\r\n\r\nIt might also look like they're working twice as hard to make the same money they made last year. They're like just, kind of grinding. They're hiring people, they're trying to do all these things and it's just not working. And they're almost like working harder than ever, even though they're doing all the things.\r\n\r\n\r\nNik (04:56.494)\r\nSo typically I like to do these episodes where I just dig into the business, And like, tell me about your revenue and financials. I'm to do a little bit of that. But so humor me for the next few minutes. But in the second half of this conversation, I really want to dive in to what you're talking about here with like helping these business owners understand not only why they're doing what they're doing, but like the value prop that they provide to the potential customer.\r\n\r\n\r\nJessica Miller (05:09.624)\r\nAbsolutely.\r\n\r\n\r\nNik (05:26.209)\r\nThat's a sneak preview for what's going to happen in the second half of this conversation. But before we get there, give me an idea how your business is it just you have a team.\r\n\r\n\r\nJessica Miller (05:34.062)\r\nIt's me, I have a small team, a few people, and they're all contractors. I don't have any FTEs in my business, so it's mainly me.\r\n\r\n\r\nNik (05:41.816)\r\nHow big is the business? Do you measure it by number of people you're coaching? Do you measure it by revenue? How do you look at it?\r\n\r\n\r\nJessica Miller (05:47.856)\r\nIt's a variety of things. So I essentially have two different offers. One offer is focused on creating what I call your hell yes offer. So at the epicenter of every thriving business, you need to have something people really wanna buy. We call that a hell yes offer. That offer informs everything else. Your marketing, who you talk to, where you go hang out, all the pieces. So that's one arm of it. Then I have my consulting arm, which is a focused growth consulting focus with businesses that are more established. So they have a hell yes offer. It's working, they're making money.\r\n\r\n\r\nbut now they need to optimize that business and that offer for profit so that it runs with ease. So there's two pieces.\r\n\r\n\r\nNik (06:23.502)\r\nSo which one of those, which one of those did you say was a million dollars plus? Are they both a million? That's the consulting. Okay. So essentially you've got the one hand, they're like getting started. You're, helping them. Hey, what is your hell yes offer? You want to start a business? Cool. How do you know what are you actually selling to people? The other one is getting people to tighten up their business operations, maybe even optimize their offer. Okay.\r\n\r\n\r\nJessica Miller (06:27.012)\r\nThat's the consulting, the consulting offer. Yeah.\r\n\r\n\r\nJessica Miller (06:34.382)\r\nYes. Yes. Correct. Yes.\r\n\r\n\r\nJessica Miller (06:44.622)\r\nYes, optimize their offer, optimize their client journey, make sure that people can move very easily to that sale with as little friction as you can possibly get. So they're not leaking people out.\r\n\r\n\r\nNik (06:53.678)\r\nOkay, so it's not necessarily, let me optimize your business. You're not going in and like, what's this cost? What's this expense? How do your operations work? Although that can be a part of the sales function, but your focus specifically on sales and marketing.\r\n\r\n\r\nJessica Miller (07:04.474)\r\nSome piece of it, yeah.\r\n\r\n\r\nJessica Miller (07:09.296)\r\nYes, how do we drive your bottom line, get you more cash based on what you're already doing in your business in the easiest way? Like put one unit of time, money, energy in, get 10 back. What is that quickest way to the sale there?\r\n\r\n\r\nNik (07:24.46)\r\nbig is the practice? Do you measure it by like number of clients?\r\n\r\n\r\nJessica Miller (07:27.184)\r\nSo we don't carry more than 20 clients. We cap it at any given time, yes.\r\n\r\n\r\nNik (07:31.022)\r\nOkay, at any given time. And can you give me like a broad, like what size of a business is that? Is this like a half a million dollar a year business, two million dollar a year business? kind of where do you fall?\r\n\r\n\r\nJessica Miller (07:42.094)\r\nWe fall, we're about at a million.\r\n\r\n\r\nNik (07:44.206)\r\nOkay. How long do your customers typically stay with you? Is this like a, hey, thank you for the month intensive and I'm done? Or is this like a recurring, you everybody loves the recurring revenue style businesses. What does it look like for you?\r\n\r\n\r\nJessica Miller (07:54.594)\r\nyeah. It's a little bit of both. And actually this is going to probably like break some marketers brains, but I'll tell you exactly what we do and why we do it. So for our consulting, we are focused on driving your bottom line and value. have your business and what you want at the center of our focus. We always start with three months. So we are a month to month type of a company.\r\n\r\n\r\nNik (08:04.184)\r\nOkay.\r\n\r\n\r\nJessica Miller (08:17.776)\r\nWe start with three months for the sole reason that we work in 90 day years. So we're going to map out that first 90 day year. And then there's all like the onboarding things of getting used to your business and stuff that.\r\n\r\n\r\nNik (08:27.758)\r\nSorry, I'm an idiot. What's a 90 day year?\r\n\r\n\r\nJessica Miller (08:30.768)\r\nWe work, we think of a year in 90 days. So a lot of people try to speculate what you're gonna be doing 12 months from now. We think that's great, but you have the most control really over the next 90 days. So we work in that vein. And so we wanna carve out your first 90 day year. So we use that horizon. That's where we come up with the three months. There's onboarding and understanding you and getting into the logistics that we need to do. So that first thing that you sign into is three months.\r\n\r\n\r\nNik (08:35.34)\r\ngot it.\r\n\r\n\r\nJessica Miller (08:59.64)\r\nOur goal is to get you a result within that timeframe or less time. At the end of those three months, we move to a month to month basis. There is no long -term contract. The way we look at this is like, hey, if you wanna make money and you're soaring and things are great, we're gonna wanna probably stick with you and you're gonna wanna stick with us. So our value prop is really high. Like if you're doing it, you love it, you're making money, you're getting toward your goals, let's keep working together.\r\n\r\n\r\nNik (09:20.866)\r\nand\r\n\r\n\r\nJessica Miller (09:25.154)\r\nIf you don't like money anymore, you don't want to grow and you hate your goals, then we probably shouldn't keep working together.\r\n\r\n\r\nNik (09:30.542)\r\nOkay, well, that's interesting. So it's not necessarily cool. I've got you spun up to a good place, know, fly, fly little child. Are you doing services for them?\r\n\r\n\r\nJessica Miller (09:40.88)\r\nWe don't do services, we work with them. However, there are certain tech deliverables that if they are very closely tied to their 90 day plan, again, to driving that sale, we have some tech solutions that we will help leverage that result, but we're not acting as their team, we're advising them.\r\n\r\n\r\nNik (09:58.619)\r\nSo when you say tech solutions, are you talking about like a CRM that they might?\r\n\r\n\r\nJessica Miller (10:01.774)\r\nIt could be a CRM, could be some sort of email solution or SMS solution or things like that that we can.\r\n\r\n\r\nNik (10:10.454)\r\nMaybe I'm correct me the way I'm hearing you describe this. There's a there's a really popular trend going on right now where it's like fractional CFO fractional COO. This sounds like almost like a fractional CMO like chief marketing and sales officer where you're sort of functioning as that executive. They don't necessarily have the budget to hire somebody full time to come in and fill that role and build out and manage their team. But they're you know they're reaching out to you because they need the help. Is that is that a fair characterization is your kind of?\r\n\r\n\r\nthis fractional chief marketing officer for them. Okay.\r\n\r\n\r\nJessica Miller (10:41.946)\r\nSo it's a little bit different. We don't ever act as an internal person. So part of the companies that we work with have that team in place, have someone that's going to be, you know, conducting the orchestra. Maybe the people under their team are contractors. They don't have to be FTEs, but there is someone that's going to be like leading that orchestra. We don't become that person in the company. We advise and we might work with, you know, a chief marketing officer or even a project manager, depending on the company.\r\n\r\n\r\nSo they're at a level where they have that infrastructure. We're not being hired for that. There are some people who work in that capacity where they're like on retainer as a team member, as a chief marketing officer for a company. We're not that, we advise. No, yeah.\r\n\r\n\r\nNik (11:23.148)\r\nYou're not doing that. You're like, I'm staying away. I don't want any of that. I don't want to manage anybody.\r\n\r\n\r\nJessica Miller (11:27.216)\r\nCorrect, none of that. I love you, but no.\r\n\r\n\r\nNik (11:32.175)\r\nHow do you find customers or clients? Because I mean, I'm telling you right now, like I'm sold, right? Like I talked to you for five minutes. I'm like, dude, sign me up Jess. But how do you get in front of the right people?\r\n\r\n\r\nJessica Miller (11:35.106)\r\nYeah, that's a great question.\r\n\r\n\r\nJessica Miller (11:44.558)\r\nYeah, it's speaking to a lot of people. So I'm very strategic and this kind of goes along with the whole foundation of what I'm trying to help people within their business. There are certain levers that you can pull in your business that are gonna get you bigger results than others. What people do to grow is they pull every lever. And in the process of pulling every lever, if that doesn't work, they come up with other levers and break the ones that might actually be working to get other things. They just make it so complicated. So even for me, it's where are my people to your point.\r\n\r\n\r\nwho are the people that are going to actually care about this message? Who are the people that are growing and working really hard? Maybe they're in that income bracket or maybe there's another piece of their business that's driving the desire for that growth. And how do I go and talk to them? I am very, very specific about how I spend my time and where I do that and where I share this message. And so I spend a lot of time doing that. And then it's sort of created a flywheel. People are getting results. They're telling other people, where is it?\r\n\r\n\r\nNik (12:39.693)\r\nWhere is that?\r\n\r\n\r\nJessica Miller (12:43.278)\r\nIt's on podcasts. I do a lot of podcast guesting. I do a lot of guest speaking in people's intimate groups. So if they have a high level mastermind or something like that, that's a great place. Yes, correct. So it's in those pieces locally. live in the Boston area. So there are some big women's organizations and things like that. also am very, you I care about my own personal development. So I'm in a lot of masterminds with other business owners. It's their networks. It's sometimes it's them where they're\r\n\r\n\r\nNik (12:51.668)\r\nYPO, EO, masterminds.\r\n\r\n\r\nJessica Miller (13:11.95)\r\nreally struggling and they need someone and they're like, I've been waiting for you. So there's all of those pieces. But I try to make sure I stay in a place where I know that the person that's going to hire me is going to get the value. And I think about that really seriously because when I started my business, I had a lot of people that hired me when they really shouldn't have been hiring me. It wasn't my program wasn't broken. It could get them the things that they wanted, but based on what they were making and their willingness to put in the work and the time,\r\n\r\n\r\nNik (13:40.493)\r\nOkay.\r\n\r\n\r\nJessica Miller (13:41.2)\r\nLike their readiness to step into that next level of growth, they just weren't there. And so whatever I charged was putting a strain on them, it was just not where they were supposed to be. So I am really particular about who I get in front of. And because of that framework of my business, as I mentioned, I don't need 150 people. Like I'm looking for 20 people max.\r\n\r\n\r\nNik (14:00.684)\r\nI would, it's funny, I was fully expecting you to say like social media, Facebook, Twitter. You don't get a lot of inbound from there. Yeah. Yeah. I mean, you're, you're so well spoken. You obviously you're charismatic. You come across well, you're knowledgeable and you have one of the rare qualities that I've seen. There are lots of businesses. This is all, this always cracks me up, especially in digital marketing where they're selling something.\r\n\r\n\r\nJessica Miller (14:04.898)\r\nNo, no, although I should be on linkedin more maybe but i'm not yeah\r\n\r\n\r\nNik (14:28.726)\r\nIt could be pay -per -click ads. could be optimizing your search engine optimization. could like whatever it is. And yet they don't use their own product. And I'm always like that, you know, red flag. But you, I can tell in a minute, like you're very dialed in with your offering, right? It's like, not only is my offering very specific to helping businesses optimize their sales flow, like you are yourself very clear on what you're offering and how you communicate that to people. And I think that is\r\n\r\n\r\nJessica Miller (14:37.263)\r\nYeah.\r\n\r\n\r\nNik (14:58.294)\r\nrefreshing because it just reinforces what you're offering to people. Yeah. How have you gone about whittling, not whittling down, qualifying people that you start to work with? Because like you said, that your first couple of clients, it wasn't really a fit. Maybe they couldn't afford it. Maybe they weren't willing to do the work. But you're also probably in this place where you're starting the business and you're like, well, I kind of need clients and income. How did you kind of gradually\r\n\r\n\r\nJessica Miller (15:02.48)\r\nThank you. I try.\r\n\r\n\r\nNik (15:26.584)\r\nget to a place where now your clients are qualified when they start working with you.\r\n\r\n\r\nJessica Miller (15:32.61)\r\nYeah, that's a great question. So it was an evolution over time. Like I started with the people who were trying to make money and trying to get that consistent cash flow. They needed that hell yes offer. And then they started to grow really quickly. And then many of those people actually outgrew that offer. And I started, I love quick wins. I love that. That's my personality. So those people were really driven to succeed.\r\n\r\n\r\nand do the hard things like I alluded to in the beginning where it's like you gotta get out of your own way or you have to get uncomfortable if what you're saying you want in your business is what you really want. And so I wanted to run with those people. And so I started to work with more of them and then the people that they knew that branched out. And now because it's so dialed in, I can sort of spot where someone is gonna be a right fit or not. We always have a call, no one just signs on. It doesn't work like that. There's always that call in the beginning, but it's asked.\r\n\r\n\r\nNik (16:05.858)\r\nMm\r\n\r\n\r\nNik (16:26.414)\r\nWe knew.\r\n\r\n\r\nJessica Miller (16:27.114)\r\na lot of questions around those things.\r\n\r\n\r\nNik (16:28.856)\r\nSo it sounds like though you had to go through a similar process of like refining your offering as well.\r\n\r\n\r\nJessica Miller (16:32.464)\r\n100%. Yes, 100%, yes. And to that end, talk to a lot of people that weren't the right fit. Sign on some consulting clients that weren't gonna get those results. To be honest, a lot of the pieces of the puzzle where people were not getting results, where they were not ready for it. They weren't ready to level up.\r\n\r\n\r\nNik (16:52.302)\r\nSo yeah, this is a very good segue. What are the two or three, or if you have a top five, cool. Biggest mistakes that you see business owners making when it comes to their sales and marketing.\r\n\r\n\r\nJessica Miller (17:08.334)\r\nYes, okay, so number one, I always tell my clients, do not make it hard for people to pay you who wanna give you their money. The sales process, what I mean by that is, the sales process by which somebody who comes in who might be interested to get to the place where they can buy the thing is often so complicated and convoluted. I'll give you an example. I have a lot of restaurants that are clients of mine. And one of the things that bugs,\r\n\r\n\r\nNik (17:29.582)\r\nMmm.\r\n\r\n\r\nJessica Miller (17:36.164)\r\nthe heck out of me personally, is I like to take out for meals for my family. I will go to a website or I will go to their social media. And number one, I can't figure out where they are and how to get to their website. Like super simple thing. I am ready to buy this thing. Let me get there. And then I will get to their website and I am like, you're like burying the lead. Where, just tell me, do you do take out? And if you do, there needs to be a giant button that says like order here.\r\n\r\n\r\nNik (18:04.696)\r\nYeah.\r\n\r\n\r\nJessica Miller (18:04.984)\r\nor do you take reservations, right? So that path to sales becomes so hard. People make it so difficult. My job is to figure out where are your sales coming in, what is working, and how do we make it easier for people to get right there?\r\n\r\n\r\nNik (18:20.212)\r\nOkay, okay, that's really cool. So that's kind of your framework for this is, all right, remove friction from the ability for people to pay. But you start by looking at where your sales currently coming in and what does that sales process currently look like you're not like you said, you're not pulling levers that aren't even existing, you're looking at like their current infrastructure and how it functions and whether or not there's something you can optimize currently to make a sale easier. Interesting.\r\n\r\n\r\nJessica Miller (18:27.758)\r\nYes.\r\n\r\n\r\nJessica Miller (18:32.719)\r\nYes.\r\n\r\n\r\nJessica Miller (18:37.914)\r\nCorrect.\r\n\r\n\r\nJessica Miller (18:43.312)\r\nCorrect, correct, correct. Most people that hire consultants, the consultants come in and they say, let me tell you all the things you're doing wrong and let me give you all these new things with the hope that you're gonna grow as a result of them. What I'm saying is you're successful. You spent so much time building your business and you've got something that's working. We wanna find out where in this business it is working the best and how do we make the most efficient\r\n\r\n\r\ncustomer journey and the most efficient decisions to optimize that so the money and the people are not falling off, essentially, this is a very basic version of it, falling off on the way to that sale. Because the easier you can make that and the more repeatable you can make that and the longer the people do that, the more money you make and it is so much easier.\r\n\r\n\r\nNik (19:34.798)\r\nSo I have a very simple example for this. My business partner, Chris and I, crazy story. This tweet, Instagram post, TikTok went viral. 20 million people saw it. And off of the back of it, we ended up launching this business. It's called perfumevending .com. We're selling perfume vending machines. Crazy. We got 2 ,500 people to reach out. They're like, we're interested in buying these machines. About $50 million worth of order value from those 2 ,500 people, right?\r\n\r\n\r\nJessica Miller (19:39.471)\r\nMm\r\n\r\n\r\nJessica Miller (19:46.842)\r\nMm -hmm. Wow.\r\n\r\n\r\nJessica Miller (19:54.042)\r\nOkay.\r\n\r\n\r\nNik (20:02.862)\r\nAnd so the last two months have been us like trying to figure out, okay, how do we make this work? One of the things that he and I went back and forth about was like, we need to make the phone number a required field. And he's like, now if we do that, we're going to lose 10 % of the leads. Like the only required field we need is the email. Anyways, that's not the, that's not the part, but, you know, we're going through that whole process. And then, so we're building out the sales team and a couple of weeks ago, so this is about a month in we're like, Hey Matt, how are you qualifying people?\r\n\r\n\r\nJessica Miller (20:19.928)\r\nYeah.\r\n\r\n\r\nNik (20:32.654)\r\nHe's like, what do mean qualifying them? I'm like, well, you know, when you, when you call them, when you reach out to them to ask them about their interest, right? Cause we have 2 ,500 people that reach out. What are they saying? And he's like, no, no, I don't do any outbound sales. And I was like, what do mean you don't do any outbound sales? He's like, well, no, yeah, I don't reach out to them. That's outbound, right? I'm not cold calling. I'm like, Matt, don't think you understand what cold calling is. That's not cold calling, man. These are leads. He's like, no, no, no, I have a.\r\n\r\n\r\nJessica Miller (20:41.869)\r\nRight,\r\n\r\n\r\nNik (21:01.87)\r\nthis link where they can go and sign up on my calendar. And like, so it was just like aha moment for all of us when we were like, wait a second, you're not targeting the most likely customers to purchase, right? You're not targeting that want 30 units. You're just saying, Hey, here's my calendar. And then it fills up with whoever signs up. Right. And so you're like, there's an opportunity cost that cause you're missing out on anyways. That, was like kind of a piece for us where we were like, okay, we got to rejigger this and make sure that we're\r\n\r\n\r\nJessica Miller (21:05.744)\r\nMmm.\r\n\r\n\r\nJessica Miller (21:15.194)\r\nRight.\r\n\r\n\r\nJessica Miller (21:25.829)\r\nYes.\r\n\r\n\r\nNik (21:31.882)\r\nactually qualifying people. so to your point, that was an example is like, there are so many things like this in the sales process that you just kind of just become legacy because you've been doing it for years.\r\n\r\n\r\nJessica Miller (21:36.037)\r\nYes.\r\n\r\n\r\nJessica Miller (21:39.737)\r\nYes.\r\n\r\n\r\nYes, exactly. And you know this from what you just said, and I think we forget this as business owners because we're always focused, it's always a traffic problem. We're always focused on the cold traffic. It's about like bigger audience, right? And I am not here to suggest you don't need an audience. You totally do. But the person that you can really capitalize off on helping and making money off of is the person who already loves you. They've already raised their hand, right? They're in there. They are primed to buy.\r\n\r\n\r\nand they bought already and they're primed to buy again. again, this is a very simplistic version because it's nuanced. It's very nuanced to a business, but somewhere when you are not putting in the effort to understand how to do that optimally at a very high quality level in a very streamlined fashion, you are leaking money and people and you're leaking them in your most seamless and easy channel, right? So it's that part that we want to really look at.\r\n\r\n\r\nNik (22:33.592)\r\nYeah, cheese.\r\n\r\n\r\nNik (22:39.564)\r\nyou. Okay, I love that. So that's number one. That you know, there's too much friction involved in the buying process. Would you say there's a two or a three that's like the biggest\r\n\r\n\r\nJessica Miller (22:47.76)\r\nYes. So that's number one. Number two, constantly changing their mind. So when we do these 90 day plans, the reason we do them is to give the business owner clarity on exactly how they can get to their goal. So we do a high level, like here are all the strategic opportunities, here are the growth opportunities. So we're tying those strategies to the actual tactics and opportunities that they have.\r\n\r\n\r\nSo for example, if you want to like increase revenue per customer and you are a restaurant, then we're gonna talk about maybe one of those growth opportunities is an upsell process, having a process for doing that. And I don't mean like just tell people to offer more things. It's like for your restaurant based on what is working for you, what makes sense for these clients, where can we increase the order volume? So we attach things in that way, very clear KPIs. And then we go one step.\r\n\r\n\r\nfurther where in those 90 days, here's how we literally break it down. So if you're going to do an upsell focus, for example, we're going to talk about like on this day, what that is, and we're going to create the guardrails and the one pager that you're going to handle your staff. The next time we meet, we're going to do something else. Very, very clear. I would say 0 .05 % of the time do we ever change that plan? Because\r\n\r\n\r\nNik (23:58.69)\r\nHmm.\r\n\r\n\r\nNik (24:05.944)\r\nWow.\r\n\r\n\r\nJessica Miller (24:08.912)\r\nIf it is your best opportunity now, guess what it's gonna be in the next 90 days? Still your best opportunity or six weeks from now. So it's about sticking to the plan. Now you have to be opportunistic and nimble, right? We're business owners and we wanna do that. But we don't wanna deviate completely from this plan. Like, hey, I talked to Nick and there's a shiny object and I think I should run this kind of campaign. Like, no, right? Like people, the order volumes are still your best opportunity for you.\r\n\r\n\r\nNik (24:13.55)\r\nSo you've missed opportunity. Yeah.\r\n\r\n\r\nNik (24:37.281)\r\nWell, it's really hard because I mean, you said it earlier, you're like, I like quick wins. All entrepreneurs are like that, right? They want to see sales. They want to see, you know, something new. And it is hard to like have this plan that you stick to because there is this feeling of like, well, I got to act. I have urgency. I got to change something. It's, it's, like the upside of the downs or it's the downside of the upside, I should say, right?\r\n\r\n\r\nJessica Miller (24:41.006)\r\nYes. Yes.\r\n\r\n\r\nJessica Miller (24:52.472)\r\nYes. Yes.\r\n\r\n\r\nJessica Miller (24:58.288)\r\nTotally, yes. To that end, what I wanna say to that is two things. Number one is strategically, when we look at those levers, we're looking for the most powerful levers that when we pull them, we know from our experience and our expertise with your business, it's going to create the biggest result. So strategically, we are crafting that 90 -day plan to get you those wins quickly so you have that feeling like what you're doing is actually working and it is working. So we don't wanna have this long tail thing like,\r\n\r\n\r\nTrust us, Nick, in 12 months you'll make more money. It's like, your goals are this, we're reverse engineering them and we're strategic in how we put that together.\r\n\r\n\r\nNik (25:31.554)\r\nYeah!\r\n\r\n\r\nNik (25:35.726)\r\nSo if I'm a business owner and it's like, all right, 12 months from now, we want to double your revenue. Cool, great. What do I need to do to double my revenue? Well, I need to triple my leads because I know that this is the conversion rate for my leads currently. Okay, so if we want to triple our leads, these are the inputs that we need to do in order to triple them. Yep, that makes sense. All right, so here's the 30, 60, 90 day kind of milestone benchmarks that we're hoping to hit. This is how you'll know whether or not it's being successful.\r\n\r\n\r\nAnd we'll look to these metrics like is that what you mean? Is that is that kind of like part of the plan that you're setting up?\r\n\r\n\r\nJessica Miller (26:07.024)\r\nYes, but I'm going to use your example just for this example of what I'm about to share. If you have leads coming in, and let's pretend you're converting at 50%, okay? And let's pretend you're selling something that is $1 ,000, okay? And you got 100 leads coming in, 50 of them are buying, it's $1 ,000 you're making, right, $50 ,000. We could go after your cold leads, but we're probably not going to do that. We're going to look at you in your sales team and say,\r\n\r\n\r\nListen, you've got hundred people that are raising their hand to actually tell you they want this. If we could take your conversion from 50 % to 65 % and get 15 more people to come into this thing, and you're gonna make $15 ,000 off the bat in, let's pretend it's like six weeks, depending on how quickly your sales team, so we could run after your cold traffic, but we're not, I'm telling you, we would not do that with you.\r\n\r\n\r\nbecause you have something that's working, you're converting. How do we make you convert better for the people who already wanna buy? Like there's people that are dropping out of there that actually wanna say yes to you, that because of your process, they're not saying yes. Let's get them so they say yes is faster than trying to run the cold traffic lever. It will also cost you more money. Let's say you're running ads, it's gonna cost you a lot more money to run more ads, to get more leads, to convert at 50 % than if we have you convert at 65.\r\n\r\n\r\nNik (27:32.724)\r\nclose the loop on my example really quickly, but essentially what I was trying to say is like, there's KPIs and then there's like milestone, mile markers essentially for you to look at. But what you're talking about, I think is just so freaking valuable because people think, Hey, I I have a bucket and I need to go collect some water from the well. And meanwhile, they keep dipping their bucket in the, in the well, but they've got three holes in the bucket. They're not, they're not addressing the underlying issue, which is conversion, right? Retention.\r\n\r\n\r\nJessica Miller (27:38.958)\r\nYeah. Yes. Yeah.\r\n\r\n\r\nJessica Miller (27:50.192)\r\nCorrect. Yep.\r\n\r\n\r\nJessica Miller (27:56.528)\r\nCorrect.\r\n\r\n\r\nJessica Miller (28:02.149)\r\nYes.\r\n\r\n\r\nNik (28:02.574)\r\nHow do you identify what conversion should be right? Like if you come into my business and I'm converting 50%, how do you know if that's good or not? Or you assuming that there's always a way to improve?\r\n\r\n\r\nJessica Miller (28:11.354)\r\nYeah, I mean.\r\n\r\n\r\nI mean, yes, there is always a way to improve. From working with so many businesses, we see the trend. So we also see the trend for using sales conversions as a specific example. If you are a founder and you are converting at 50%, we can get you up because we're seeing founder conversions much higher than that. So there is a nuance to it versus like if I was trying to sell your product, although I love sales, so if somebody like me would probably have a high conversion rate, but we're always looking at the nuances to optimize what you have already.\r\n\r\n\r\nNik (28:42.968)\r\nHm, I will.\r\n\r\n\r\nJessica Miller (28:43.706)\r\nSo it's not a flat answer of like everybody can improve. They can, but we're also seeing those trends about like where do those numbers kind of, where does it settle out?\r\n\r\n\r\nNik (28:53.41)\r\nYeah, yeah. So what I what I really like about your process is that you start with some fundamental questions that need to be answered like there's a lot of introspection involved. Whereas the natural inclination is to look at technology. I'm not tracking my lead. Maybe I need HubSpot. yeah, yeah, yeah, we should we should get HubSpot in here like I don't have a Zapier integration to get my emails to flow to my drip campaign and you know whatever email system that you're using.\r\n\r\n\r\nJessica Miller (29:04.591)\r\nYes.\r\n\r\n\r\nNik (29:22.818)\r\nLike there's a natural inclination that you think, it's the next quick fix or technology or app that I can put, but you're not even starting there. Like the stuff that you're doing is not even about here. Here's the tech stack you need. It's about you as a business, understanding what your fundamental offering is and where you have opportunities in the business and then attacking those opportunities with vigor, essentially.\r\n\r\n\r\nJessica Miller (29:27.589)\r\nYes.\r\n\r\n\r\nJessica Miller (29:47.696)\r\nCorrect. And on the tech note and the data note, we don't make decisions in a vacuum. We are always leveraging the data. So to your point, when we're looking at people coming through, if we use your example, if 10 ,000 people are going to this page and your call to action is sign up for a call and you're getting 10 calls, we know what's going on there, right? If you have 100 people and they're go...\r\n\r\n\r\n50 % of them are going to a call and you're converting them. We always lean on the data. So we're not waving a magic wand. It's very focused. But as I was saying in the beginning, it's almost, it's the boring stuff. Everybody wants the fancy tech stack. wants that. But we've gotten so good at being able to hone in on those pivot points for you, on those areas where we see you're leaking the money and we're following the data.\r\n\r\n\r\nNik (30:29.528)\r\nYeah. Yeah.\r\n\r\n\r\nJessica Miller (30:44.014)\r\nAnd yes, we do leverage some of these technologies and things that we know we're integrating with other systems and things like that if you're doing them, but we're not gonna overhaul your business and layer all this tech on there to complicate your life and distract you, make you feel better. Okay, yeah.\r\n\r\n\r\nNik (30:58.136)\r\nSo I want to get to the fun part now, the second half that I promised. One of the things that I talk about them a lot is that I think the safest way to get into entrepreneurship is to build an agency around your specific skill set. So if you're an architect, you start an architect agency. If you're a CPA, you started a CPA firm. If you're an artist, maybe you start coaching other people to teach them how to do art, right? Like it's taking your skill set and it's monetizing it. But many times,\r\n\r\n\r\nJessica Miller (31:23.023)\r\nYes.\r\n\r\n\r\nNik (31:26.166)\r\nthose individuals who are really talented with a specific skill set, they don't know exactly how to frame it. They don't know how to charge. They don't know where to market or how to convert, or they feel weird at a dinner party, like talking about their business, right? And so there's this period of time where they're like doing self discovery or, know, it takes them years to kind of get to a place where they really honed their message. And I was messing around, I told you this before we started, I was messing around on your website, just doing like a little bit of research and you have this lead magnet.\r\n\r\n\r\nJessica Miller (31:32.132)\r\nYes.\r\n\r\n\r\nJessica Miller (31:37.7)\r\nRight?\r\n\r\n\r\nJessica Miller (31:46.298)\r\nYeah. Yeah.\r\n\r\n\r\nNik (31:55.994)\r\nis the best I can say, where it's like a self -assessment of, hey, do you have a hell yes offering? And so I thought it would be really fun to go through this with you and kind of talk about why you put these questions in here, because I think it's really intentional. Is that okay? Okay. So here's the first question you ask. Is your program business helping people create results that they want to tell everybody about? And then there's a star rating system.\r\n\r\n\r\nJessica Miller (32:01.188)\r\nYes. Yeah.\r\n\r\n\r\nJessica Miller (32:12.634)\r\nTotally, yes. Let's do it.\r\n\r\n\r\nNik (32:23.918)\r\nof one to 10. One is like, haven't even had anyone complete my program and 10 is I have zero doubts about this. I have evidence, I have testimonials, et cetera. Why is this the first question for you? Why do you ask that upfront?\r\n\r\n\r\nJessica Miller (32:36.718)\r\nYeah, because, okay, so the thing I think that makes my offer, my hell yes offer model unique is the hell yes part. So people really discount this idea of the energetic part of making a binge -worthy offer. If you are someone and I believe that you should price and create your offers based on value.\r\n\r\n\r\nWhen people really value those results, value working with you, value what they're creating, when it is a 10 out of 10, like hell yes, like hell bet for glory, it creates a flywheel. And it creates a flywheel with your clients because when they're having those kinds of results, they come back for more, they tell other people about it, they're making a big ripple in the world, it's super valuable. So that's the first piece is like, if you're doing this or you're thinking about doing this, are you a 10 out of 10? Like, is that what's happening?\r\n\r\n\r\nNik (33:29.294)\r\nI like the psychological frame because it's like, hey, are you are you delivering results or not? Are you are you you current? Yeah, yeah.\r\n\r\n\r\nJessica Miller (33:33.518)\r\nRight, is it hell yes? And is it hell yes for you? Right, is this like a love fest? Are you your clients getting results and you're like super excited? So that's what that first question is really about.\r\n\r\n\r\nNik (33:42.7)\r\nOkay, I love that. think that's an incredible framing, especially for people like the physicians that we talked about earlier or creatives, because I think many times they don't give themselves enough credit for the value they're creating. And this is what it was like for me in healthcare. It's like once the clinicians understood the value that they're creating, it was much easier for them to talk about compensation or revenue, right? Because it's like those two things are inextricably linked. So I like that framing. Okay, number two.\r\n\r\n\r\nJessica Miller (33:50.45)\r\nYeah.\r\n\r\n\r\nJessica Miller (33:56.048)\r\nAgreed.\r\n\r\n\r\nJessica Miller (34:04.302)\r\nYes. Yes.\r\n\r\n\r\nTotally.\r\n\r\n\r\nNik (34:10.668)\r\nWhen you meet new people at networking events, who do you tell about your offer and what you're selling? And the options are like, nobody, I feel like it's pushy. I tell people when they ask or see, I tell everyone I meet, I have people to help me. What does it say? I have people to help and the more people who know, the more I can find my people. I screwed up the delivery on that one. But why this question? What is this assessing for you?\r\n\r\n\r\nJessica Miller (34:31.588)\r\nYeah.\r\n\r\n\r\nYeah, this is kind of like the dovetail of what I was just talking about. What do people do when they are really excited, bought in and in belief about their offer and what it creates for people? They tell everybody about it. There is like this compulsion. So after the thought of like, my gosh, this is an amazing offer. If somebody buys this, it's a slam dunk. The emotion is, know, pride, excitement, whatever, fill in the blank. The action that comes after that is like, this is what\r\n\r\n\r\nPeople mostly say, I wanna yell it from the rooftops. That's what they say. So when there's alignment around that, they're out telling people about it because they have clarity and belief in what it is that they're creating.\r\n\r\n\r\nNik (35:17.294)\r\nSo for you, this is measuring the level of conviction around the entrepreneur or business owner.\r\n\r\n\r\nJessica Miller (35:23.012)\r\nconviction and are you actually making offers? Are you talking about the offer? There's a lot of people who are making no money because they're not talking about their offer. They're not making offers. So it's kind of a multi -pronged, like how do you feel about it and are you out there telling people about it? And then there's like the practical tactical piece of like how much exposure is this offer actually getting?\r\n\r\n\r\nNik (35:27.914)\r\nOkay.\r\n\r\n\r\nNik (35:44.238)\r\nOkay, that one makes sense. I like this last one. Rate your hell yes energy on what you currently sell. Like are you jumping out of bed every morning screaming hell yes to sell or deliver and then your options are A, shoot me now, B, it's a C plus and C, I can't believe I get paid to do this. How is that different than the former question? Because they feel like they're kind of measuring the same thing.\r\n\r\n\r\nJessica Miller (35:48.26)\r\nMm -hmm.\r\n\r\n\r\nJessica Miller (35:59.674)\r\nYeah\r\n\r\n\r\nJessica Miller (36:11.106)\r\nYeah, and so there's like a couple of nuances in there, but I think it's just like digging into more of, you know, their own perception of their offer. So the other one was like, are you telling people about it? What do you think about the offer? Are you out there sharing it? So are you visible? And the other part is like, are you in belief, especially the way that last option is worded, I can't believe I get to do this work.\r\n\r\n\r\nNik (36:25.442)\r\nMmm.\r\n\r\n\r\nJessica Miller (36:36.752)\r\nI think that also feeds very heavily into how you price your offers for value. You know, I always tell people, like, if we're talking about that entrepreneur that's trying to figure out how to price, I always tell people aim for the price that feels awesome and that you think, listen, if I sell this thing for $2 ,500 and Nick buys it, this is like he just hit the jackpot.\r\n\r\n\r\nLike you feel good about making the money and you know that the value of your offer is never ever going to be less than what Nick just paid for it. Right? Whatever they're going to get if FAR exceeds whatever they pay. And for really valuable offers, you could charge 10 times that, right? And it's never going to be less than that.\r\n\r\n\r\nNik (37:08.888)\r\nHmm. Yeah.\r\n\r\n\r\nNik (37:18.456)\r\nOkay, so the first couple of questions were all internal, right? Like how do you view these things? This next question is kind of an external measuring stick. When I tell people about my programs, the common response I get is A, nod and crickets, B, recognition that they often ask for more information, and C, they ask me where I've been all their life, they've been waiting for me.\r\n\r\n\r\nJessica Miller (37:39.184)\r\nYeah, so that's the positioning like how are you talking about it? Is it resonating with people?\r\n\r\n\r\nNik (37:45.422)\r\nBecause in your mind, you're getting crickets, let's say you have a valuable offering. If you're getting crickets, then we've got to work on how you're positioning or how you're communicating. If B, you explain to people and they're like, wow, that's really cool. I'd love some more information. maybe we need to work on follow up or maybe we need to work on commitment.\r\n\r\n\r\nJessica Miller (37:56.132)\r\nRight, how you're talking about it. Exactly, exactly. Some piece of that offer is not optimized there, yeah.\r\n\r\n\r\nNik (38:15.288)\r\nThat's cool. Okay, this one I was curious about. didn't know why you asked it. How long have you been selling your offer? And how often do you roll out a brand new offer program or service? Like, why would you care how long they've been selling their offer?\r\n\r\n\r\nJessica Miller (38:20.08)\r\nOkay.\r\n\r\n\r\nJessica Miller (38:30.156)\r\nFor that reason I was talking about earlier, which is people think the key to growth and making money in your business is to constantly iterate. So if people are like, I change my offer all the time. I'm constantly adding new offers. I'm like, okay, that is part of the issue. Like you want an offer, you want to do it really well. It's about quality. So how do you take the offer and make it hell yes versus\r\n\r\n\r\nNik (38:38.051)\r\nMm.\r\n\r\n\r\nJessica Miller (38:55.948)\r\nadding on a bunch of random offers with the idea that that's going to generate growth and momentum in your business, because it's often not. Right?\r\n\r\n\r\nNik (39:02.807)\r\nSo if I'm an entrepreneur and I'm listening to this right now and of the three options, A, I've been selling the same thing for a long time, B, I roll out one to two new things a year or C, is every other day too short of an answer? If they're feeling like, yeah, C kind of describes me, I'm rolling out new stuff all the time, it's probably an opportunity for them to stop and really evaluate.\r\n\r\n\r\nJessica Miller (39:14.564)\r\nYeah, right.\r\n\r\n\r\nJessica Miller (39:26.158)\r\nYes, they're doing a lot of things, mediocre and not great. And they could be doing a lot less and doing it really well, making a lot more money and having a whole hell of a lot more fun to do it. It would be a lot easier.\r\n\r\n\r\nNik (39:36.504)\r\nWell, what do you say to people entrepreneurs who are like, I'm just iterating. I'm just kind of see what works.\r\n\r\n\r\nJessica Miller (39:40.728)\r\nI would say, how's that working for you? Again, right? If it's working and they're doing it they're all optimized and they have a big team and they can do that, right? There's no right answer. But for most people who are doing that all the time, they're burnt out, they're making no money, they're running around like crazy. So it's not working. And then I'll ask them, what would be ideal? You would be so surprised how many people are like, if I could just do...\r\n\r\n\r\nNik (39:50.488)\r\nMm\r\n\r\n\r\nNik (39:58.157)\r\nInteresting.\r\n\r\n\r\nJessica Miller (40:06.008)\r\nthis group program all the time and make all of my money, I'd be thrilled. I'm like, okay, let's talk about that. Let's talk about that offer.\r\n\r\n\r\nNik (40:14.102)\r\nSo here's the next section, the math. Describe your friendliness with your business's numbers. A, I know my math and I love spreadsheets and track them regularly. B, spreadsheets? They're the enemy of my brain. And C, I did them once, but it's all intuitive for me from here on out. For you, what is this question assessing?\r\n\r\n\r\nJessica Miller (40:17.732)\r\nYes.\r\n\r\n\r\nJessica Miller (40:26.948)\r\nYeah.\r\n\r\n\r\nJessica Miller (40:36.43)\r\nYeah, people need to know their numbers. It's like a dirty word and most people do not know their numbers. It doesn't matter how much money or little money you're making, how big or small your business is. Some people have gotten to places they're not even really sure how they get there. Like when we get into the nuance, they don't even necessarily know those numbers and how they're moving. yeah.\r\n\r\n\r\nNik (40:56.876)\r\nYeah, so the next question you have is like, what's your revenue goal, which is a great question and people pick it. And then the following question is, do you have clarity and a plan around how many programs or services you need to sell in order to hit your monthly sales targets? And then there's some options. Yeah, I'm always shocked by how many people don't do this, where they're like, okay, what's my end goal? Cool. All right. How do I get there? What do I need? Well, my conversion is this, this is where this is how many leads I'm getting. This is my current\r\n\r\n\r\nJessica Miller (41:08.984)\r\nYep, this is reverse engineering that. Yep.\r\n\r\n\r\nJessica Miller (41:14.97)\r\nThey don't.\r\n\r\n\r\nNik (41:25.662)\r\nLTV, this like those are it's just math. At the end of the day, it's not some like secret science or hocus pocus that you got to figure out.\r\n\r\n\r\nJessica Miller (41:34.968)\r\nit's very hard for people to kind of mentally back into that. And the thing that is really dangerous about that, I was just talking to some of my clients today about, you year end planning. Do you come up with these goals, these KPIs, whatever they are, and you come up with some plan that is so disjointed and so much harder to get to where you want to go, then it needs to be, if you start with that end in mind and you reverse engineer it.\r\n\r\n\r\nNik (41:56.759)\r\nMm -hmm.\r\n\r\n\r\nJessica Miller (42:02.96)\r\nI've seen this all the time. You have someone that's selling a very high ticket offer. So maybe they're running a webinar to a high ticket offer, and then they have like a membership on the backend or something. And we're like, okay, great. How many people do you want to get into your paid signature offer? And they're like, 10. I'm like, okay, well. So then the plan that they have though is this blown out thing. They're doing all this crazy stuff. like, if you only need 10 people, what is the easiest way to get to that sale? What's the easiest sales process?\r\n\r\n\r\nLet's look at what you're doing. you're doing this and it's working. Well, and you're converting at this amount because we can see it. How about if you just did that? And they're like, right. Yeah.\r\n\r\n\r\nNik (42:41.536)\r\nNo, that's too hard. That's too hard. Okay, here's the last the last two questions that I have. I mean, there's other questions, but these are the last two I want to I wanted to ask. I have blank people looking at my monthly offer. A. How can I even know this? B. I know this because I regularly look at my Google Analytics. C. I know I need to know this, but need some help finding out how and then D. I don't have a web page linked to my offers anywhere online yet.\r\n\r\n\r\nJessica Miller (42:50.384)\r\nOkay, yeah.\r\n\r\n\r\nNik (43:10.818)\r\nWhat is this speaking to?\r\n\r\n\r\nJessica Miller (43:12.09)\r\nYeah, this is kind of what you were talking about earlier. you know, in order, it's not enough to just have an optimized offer. You want that, it's the epicenter of your business. But the other piece is like, how many people know about your offer? And I've had a lot of people who have great offers. They may not be hell yes, but they're great. But then when we actually look at this, like how many offers have you made or how many people are seeing this, you go to their webpage and there's like three.\r\n\r\n\r\nAnd they're like, I talk to people about it all the time. You send them to your sales page? Yeah. How many people hit that sales page? 10. You know what I mean? So those numbers, right? To your point, you want to make sure the bucket's not leaking, but you don't want to pay the money or the energy to drive 10 ,000 people to a bucket they're just going to fall out of. And if the bucket's awesome, you don't want just three people showing up at this bucket. So those numbers of traffic is really important. Like what is the exposure?\r\n\r\n\r\nthat people are seeing this offer as well. So again, figuring out where are those holes to them making their money.\r\n\r\n\r\nNik (44:13.55)\r\nAnd if you want to, I think it's a really good self assessment quiz that you have. And if anybody wants to take it, Jessica Miller coaching .com. And then like, there's literally just a link and you go and take the quiz. But I think it's so valuable, especially as you're starting out to be thinking about these things. I guarantee anybody who goes through this, there will be at least one question where it's like, yeah, I should be thinking about that more. How much revenue do I want? How many email subscribers do I have on my email list? How many, you know, leads am I generating from it's like,\r\n\r\n\r\nJessica Miller (44:27.14)\r\nYes.\r\n\r\n\r\nNik (44:41.782)\r\nIt's stuff that you don't think about, because you're so wrapped up in the operations of the business that you can't even see the forest through the trees. So I like that. I have some rapid fire questions to end this. Are you ready? What do you love about this business?\r\n\r\n\r\nJessica Miller (44:45.936)\r\nTotally. Yes. Yeah.\r\n\r\n\r\nOkay. I'm ready.\r\n\r\n\r\nmy gosh, I think I mentioned it earlier. I love quick wins. I love helping people create a lot with very targeted, focused time, energy, and money. Like these are our biggest resources. I am on a mission to help entrepreneurs do this really well. We do not have to sacrifice everything in order to get what we want. You can do things really well in your business and create a whole lot on the back end.\r\n\r\n\r\nNik (45:17.666)\r\nYeah, you don't seem very excited about it, so... What do you hate about it?\r\n\r\n\r\nJessica Miller (45:19.792)\r\nI have nothing to say about that.\r\n\r\n\r\nJessica Miller (45:26.9)\r\nwell, if I'm being honest, as I said earlier, I'm sort of like a quick study. So I always want like fast, quick wins. I've really trained myself to like slow down to speed up, but I still have like that synapse in my brain is still firing like, faster, you're gonna be behind the eight ball. Like, no, it's okay, it's gonna work. All right, but it's there.\r\n\r\n\r\nNik (45:44.674)\r\nYeah. What businesses or industries are you the most jealous of? Like for me, it's commercial real estate because I'm like, man, it'd be so nice. Triple net lease. It's mailbox money. I don't have to manage anybody like commercial real estate is like the end all be all for me. What about you?\r\n\r\n\r\nJessica Miller (45:49.986)\r\njealous of? That is a really good question.\r\n\r\n\r\nJessica Miller (46:05.38)\r\nYeah, I would say, I mean, as far as like ease or things like that, I'm not sure, but I would say I love the music industry. And I think anyone who could work in marketing and sales around the music industry, cause like you were talking about, most musicians are not sales and marketing people, right? So I'm like, my gosh, if this person did this, I'm constantly thinking about it. yeah, they're having so much fun.\r\n\r\n\r\nNik (46:19.534)\r\nNo, they're not.\r\n\r\n\r\nNik (46:26.52)\r\nThat's why I'm so shocked. That's why I'm so shocked you're not on social media because like the thing I'm noticing about social media is there are a ton of content creators, a ton who have big followings and they couldn't care less about monetizing or they just have like no idea how to monetize. And like I'm sitting here like, are you kidding me? You could be doing this and this and that. Anyways.\r\n\r\n\r\nJessica Miller (46:36.771)\r\nNo.\r\n\r\n\r\nI don't I don't know. And they're so talented. You're like, okay, you just need to do this. You'll be like, sorry, thank me later. Yeah, I agree.\r\n\r\n\r\nNik (46:48.45)\r\nI know it's crazy. If you have two hours in your day, you have no family stuff, you have no work stuff, you can do whatever you want. What are you obsessed with right now? What's taking up like mind share?\r\n\r\n\r\nJessica Miller (47:00.368)\r\nplaying my guitar. I started playing guitar, yep, in February. I bought a guitar 25 years ago when I was much younger than I am now. And I played it for like, I don't know, a few months, put it down. And I've been wanting to start it up again. I've been thinking about this for years. Finally, in February, I was like, I'm gonna do this. And I picked up that guitar and I love it. It is such a great outlet. I love music. I think I have a parallel life where I was a rock star. I don't know. But I love it.\r\n\r\n\r\nNik (47:02.029)\r\nReally?\r\n\r\n\r\nNik (47:21.582)\r\nGood for you.\r\n\r\n\r\nNik (47:27.318)\r\nYou do. Everybody does. What kind of guitar?\r\n\r\n\r\nJessica Miller (47:30.96)\r\nIt's a Kala 3 quarter guitar.\r\n\r\n\r\nNik (47:33.759)\r\nis a steel string, nylon, electric, acoustic, electric.\r\n\r\n\r\nJessica Miller (47:36.976)\r\nSteel string, acoustic, not electric. That'll be the next thing.\r\n\r\n\r\nNik (47:39.638)\r\nOkay. My dream my dream guitar is a nylon string, thin body acoustic electric, I don't know, I just love the feel on the way they sound like nylon strings for me, I cannot pick up a car guitar for years because it's been there have been periods of time where I haven't picked up a guitar for years. And I can just easily play it when I'm playing with the steel strings, depending on you know, the gauge of the string or like the tension of the net that they're they're drawn on the neck.\r\n\r\n\r\nJessica Miller (47:48.528)\r\nCool.\r\n\r\n\r\nNik (48:08.046)\r\nI can only play for like 10 minutes and then my hands are just killing me, you know?\r\n\r\n\r\nJessica Miller (48:09.84)\r\nWhat do you like to play? I didn't know you played guitar. This is awesome.\r\n\r\n\r\nNik (48:14.094)\r\nI love playing acoustic guitar. I was a singer songwriter and I thought that's what I was going to be. And I met my wife early on and obviously we got married and we decided we decided together for those who can't see I'm doing air quotes. No, she was right. A musician lifestyle would have just been hard for you know, trying to have a married family. anyways, I love music. I love the creative outlet. I just think it's yeah, I love it. I'm on the same page.\r\n\r\n\r\nJessica Miller (48:27.097)\r\nYeah\r\n\r\n\r\nJessica Miller (48:39.322)\r\nYeah.\r\n\r\n\r\nYeah. Yeah. I mean, I think that there is such an amazing intersection of skills for the type of skills that you have that I have and that whole industry that could really make it so much fun. know, maybe I, you know, won't be the next Stevie Nicks, but there's so many opportunities to really fill your life with music and in a really productive and fun way, I think. Yeah.\r\n\r\n\r\nNik (49:02.796)\r\nI totally agree. All right. Here is my last question. What advice would you give to your pre entrepreneurial self?\r\n\r\n\r\nJessica Miller (49:12.034)\r\nMy pre -entrepreneurial self, I would say do one thing at a time and do it really well. Like go all in and commit to that thing you want to do and figure out how to do it really well and make it work. Don't bounce around all over the place. Don't like burn all these candles at both ends. Like get clear and then really hone your skills into that offer and go all in on it. You could always iterate on it.\r\n\r\n\r\nNik (49:33.998)\r\nHow do you, how do you do that? Cause like, you have the personality, you like quick wins, right? So you like to move on to new and different things. And many of us, especially entrepreneurs with ADHD and or shiny objects syndrome all over the place. It's hard. Like in theory, sounds good. Of course I'm going to focus on one thing and become really good at it. But then in practice, it's really, really hard to do that. How do you do it?\r\n\r\n\r\nJessica Miller (49:39.962)\r\nvideo.\r\n\r\n\r\nJessica Miller (49:57.028)\r\nYeah, I think people get really distracted, myself included. Like shiny objects are fun and they are exciting and our brain is thinking like that's gonna get us to our goal faster. think, you know, in all fairness, we're creative so it happens. I think it's really having the mental discipline to commit to a goal and go toward it, including surrounding yourself with people that can help you getting in those rooms you need to get in with, you know, and really making that focus.\r\n\r\n\r\nrock solid and clear. It is a lot of rewiring your brain. Like I think, you know, it's hard. It's hard. It's not easy.\r\n\r\n\r\nNik (50:32.622)\r\nOne thing, one thing that's one thing that's really helped me and I've been trying to do this a lot more over the last few years is time boxing. So essentially what that is is like, I try to schedule my week out to 15 minute increments. And it's like, here's what I'm doing in those increments. And I know for most people, they're like, that sounds horrible. But when you're constantly distracted, if you are overbooking yourself, it's, it's much easier to go from one thing to one thing to one thing and not stop and think, what should I work on?\r\n\r\n\r\nJessica Miller (50:40.324)\r\nYes.\r\n\r\n\r\nJessica Miller (50:54.543)\r\nYeah.\r\n\r\n\r\nNik (51:02.51)\r\nLet me check Instagram really quick or like, let me go to this website, right? So for me, time boxing has been really helpful. But yeah, I like that advice. That's man. That's very, very good advice. Yeah, please do. This has been awesome. Where's the best place for people to come find you?\r\n\r\n\r\nJessica Miller (51:04.771)\r\nmy gosh, yes.\r\n\r\n\r\nJessica Miller (51:12.59)\r\nYeah, yeah when I master it I'll let you know.\r\n\r\n\r\nJessica Miller (51:22.372)\r\nYeah, find me, JessicaMullerCoaching .com is a great place. I am on Instagram and Facebook as well and a little bit on LinkedIn. So I'm all over the interwebs. I would love to see anybody there. Thank you.\r\n\r\n\r\nNik (51:32.716)\r\nAwesome. Thank you, Jess.",
  "metadata": {
    "duration": "",
    "date": "2024-11-04",
    "platform_source": "Google Drive"
  }
}