{
  "episode_number": "245",
  "episode_title": "He Built a 9-Figure Business & Helped Over 1 Million People Start Theirs with Stu Draper",
  "guest_name": "Stu Draper",
  "business_name": "Stucant, GetFoundFirst",
  "transcript": "﻿Nikolas Hulewsky (00:00.224)\r\nStewart.\r\n\r\n\r\nStuart Draper (00:01.558)\r\nsoon.\r\n\r\n\r\nNikolas Hulewsky (00:03.084)\r\nAll right, I got a freaking treat for you today on economics. I'm talking to Stu Draper. Now, Stu is incredible. He's helped over a million people, a million people go through his EdTech program to learn marketing. He's had an eight figure exit, big eight figure exit. Two of his companies have been on the Inc 5000, a total of 10 times, but his biggest flexes are the fact that he has a professional sized baseball field in his backyard. He's got an indoor outdoor pool in his fun barn and he's got three batting cages on this property.\r\n\r\n\r\nWe are talking to Ed today, or Ed, we're talking to Stu today. He's gonna help us understand. All right, I'm an entrepreneur. I'm getting into the game. How do I just get my first customer? How do I get business? How do I get started? Because that's been his bread and butter for a long time. Stu, welcome. I'm stoked to talk to you,\r\n\r\n\r\nStuart Draper (00:50.012)\r\nNick, thank you so much for having me. You are doing so much good for founders with Nickonomics. if I can help founders, like that's a big part of my goal. I have a goal to help over a thousand people become millionaires. And so to get to do that through startups and this world, I love it and love being a part of this.\r\n\r\n\r\nNikolas Hulewsky (01:12.222)\r\nDo you ever just sit back and think like, I've helped a million people. I've helped a million people go through a marketing course. that doesn't happen, man.\r\n\r\n\r\nStuart Draper (01:17.736)\r\nyeah, I think one of the biggest moments was celebrating passing the million mark of people that we had touched. I guess I'm weird. don't know. Like I would sit as a, as a young man at the counter and see the Cheerios box and go, how cool is it that someone created this brand Cheerios that literally everyone on the planet knows? Like I want to create something like that. And I haven't done that yet.\r\n\r\n\r\nNikolas Hulewsky (01:30.222)\r\nI'm\r\n\r\n\r\nStuart Draper (01:46.7)\r\nBut my company, Stucant, has now helped over a million students learn digital marketing or other marketing subjects. And it's been so fun to be a part\r\n\r\n\r\nNikolas Hulewsky (01:55.032)\r\nSo just a quick overview. You had a digital marketing agency and then you started this EdTech company, is StuCamp.\r\n\r\n\r\nStuart Draper (02:01.292)\r\nYeah, yep. I started getfoundfirst.com in 2008. I got laid off from a job. The recession had just started, but all these small businesses were looking for help with their digital marketing at the time. Most of them hadn't started digital marketing and needed to get going. So it was a great time for me, a hard time for the world, but a great time for me to start getfoundfirst.com. I grew that from late 2008 to 2015 when I sold it.\r\n\r\n\r\nNikolas Hulewsky (02:09.358)\r\nCheers.\r\n\r\n\r\nNikolas Hulewsky (02:16.6)\r\nYeah.\r\n\r\n\r\nStuart Draper (02:29.1)\r\nBy then I had already started my other business stucant.com that I ran from 2013 to 2024 as the CEO.\r\n\r\n\r\nNikolas Hulewsky (02:37.383)\r\nAnd then you, so you exited it in 2024.\r\n\r\n\r\nStuart Draper (02:40.684)\r\nThat's when I stopped being the CEO. had our, I had my first payday, you could call it, by partnering with a private equity group called Tritium Partners in 2021. And then in 2024, we hired a new CEO. So I passed the baton.\r\n\r\n\r\nNikolas Hulewsky (02:57.07)\r\nDude, that's awesome. Tell me, why didn't you buy a Lamborghini? What's up with the backyard? You got a professional-sized baseball field, an indoor-outdoor pool, batting cages. Is this childhood fantasy being relived or were your kids just nuts about being outside?\r\n\r\n\r\nStuart Draper (03:06.164)\r\nYeah\r\n\r\n\r\nStuart Draper (03:13.728)\r\nI mean, there's a TikTok that I posted that has like 400,000 some views at Draper's Stew on TikTok. You can go see the baseball field, but yeah, you know, I love horses. We bought a four acre property and I put horses on it, loved horses, but I was traveling so much for work that it became just nothing but a chore and headache for my wife and kids while I was away. And they were like, this is dad or Stew's thing.\r\n\r\n\r\nhere we are taking care of it while he's off working. And so, and like, we like to boat and my sons love baseball. And so I decided to like, I want to do the things that my family will love the most while I have my family home. And then I can turn it back into a horse pasture later, right? And so we put in a full-size baseball field. mean, the field of dreams, the show, the movie, like that was always an inspiring thing for me as a kid. I loved it.\r\n\r\n\r\nBut then when I realized, when I started this vision of like, my gosh, like I have the space. I remember vividly walking out to the back 40, right? I got to the edge, far backside of the field and I stepped how many steps to get to my windows at the house. And I went, my gosh, like you have to be an elite high school baseball player with a metal bat to hit my windows. And you gotta be a lefty basically, cause it's in right field to hit the windows. So what I realized I could do is like,\r\n\r\n\r\nI am gonna make this happen. Like this is what we're gonna do. So forget the Lamborghini, not my thing. I love to be with my family. I'm a family man. Raised four kids while growing the business. And yeah.\r\n\r\n\r\nNikolas Hulewsky (04:54.07)\r\nInsane. Did you build the field yourself? Or like, did you like how much of it did you subcontract out? And how much of it were you like? No, man, I'm going out there with my skid steer. I'm figuring out how to get the mound the perfect height. what? did you do it?\r\n\r\n\r\nStuart Draper (05:08.772)\r\nyeah, I definitely for that big of a space, I had to hire in the big guns and they brought in the dozers and pushed it off perfectly flat for me and got it ready. They brought in these big old 10 foot wide pieces of sod and laid it rolled them out with big equipment. It was such a fun thing. I should have done more cool like hyperlapse videos of that process because it was so cool. But yeah, I just.\r\n\r\n\r\nNikolas Hulewsky (05:31.498)\r\nYeah. I'll have to I need to come out there next summer. And then you need to come out here as well next summer. Our house, we're on a couple of acres, we have a our tennis court, we have a like a pool, basketball court, all that stuff. And we have four boys. And so it's it's a boys paradise. But I mean, baseball field. I mean, I don't know you compete with a baseball field, Okay, let me let me ask you this. Do you see any? I'm shifting gears a little bit.\r\n\r\n\r\nStuart Draper (05:53.804)\r\nHahaha\r\n\r\n\r\nStuart Draper (05:59.799)\r\nSure.\r\n\r\n\r\nNikolas Hulewsky (05:59.95)\r\nDo you see any similarities between 2008 and today between the rise in the need of digital marketing agencies for small business owners and the rise in need of AI automation agencies now for small business owners?\r\n\r\n\r\nStuart Draper (06:15.487)\r\n100%. Yeah, when I talk to young college students that connect with me on LinkedIn, you can find me, just search up Stuart Draper on LinkedIn. The people that are there in college right now, thinking about what they're gonna do to get started at a time when there's not as many job openings and things like that, there is demand for those that have a good solid foundation and understanding of AI.\r\n\r\n\r\nNikolas Hulewsky (06:17.358)\r\nThank\r\n\r\n\r\nStuart Draper (06:42.654)\r\nAnd frankly, you don't have to be like a language learning model expert. don't, all you need to do is know enough about AI and how to apply it to a skill like marketing or a skill like accounting. And then the number of openings for you are almost endless. Like you have a job and frankly, as a 20 something, you can be looked at as the expert.\r\n\r\n\r\nAmong at a big table of C-suite level executives in their forties, fifties and sixties, you can be the 20 something expert. That was me in my twenties with digital marketing. was such, I'm so grateful. I named my company Stu Kent. It plays on the word student. We're an ed tech company. My name's Stu. My professor's name was Kent. I'm so grateful that in 2007, Kent stood up in front of the class and said, Hey, we're going to learn digital marketing. Like I don't know it. I didn't learn it in college, but.\r\n\r\n\r\nNikolas Hulewsky (07:24.195)\r\nYeah.\r\n\r\n\r\nStuart Draper (07:35.196)\r\nIt has blessed my, it's going to bless your lives if you learn it, right? And straight enough, like half of that classroom, bro, we were all millionaires by like 32, 33 years old because we caught that early wave and there is a new wave where they are for sure.\r\n\r\n\r\nNikolas Hulewsky (07:39.565)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (07:48.022)\r\nYep. Well, I think people forget what it was like back then. We think of digital marketing now and it's like, okay, we got, we got to know exactly how and when to buy ads. We got to know exactly what, what's the creative going to be and when are we placing it and how do we actually get people to click and what's our CAC and all these things. Back then it was like, do we have a Facebook page? Do we, do we do Instagram? Wait, what's Google search? I don't SEO. I've never even heard it. Like it was, the bar was so low just because we were figuring it out.\r\n\r\n\r\nmobile was just coming out. Like mobile is really what opened up the opportunity for people to actually take advantage of Google search, right? Google business profile, SEO, keywords, rankings, all those things. And basically, if you knew anything about like, if you knew like one of those words, it was like, I'll hire Stu. He's been on Instagram before. And I like see it being similar now with AI, because these business owners are like, well, I got to get in on AI and\r\n\r\n\r\nMark said he uses anthropic. I've never heard of anthropic. He must be like a genius or something. So we'll just go ahead and hire. You know what? It just seems so similar. If you can, if you're, if you're young and you're starting out now, like that's the wave to really jump on and catch.\r\n\r\n\r\nStuart Draper (08:58.132)\r\nYeah. absolutely. AI for any small business is still like very much a black box for most of them too. And so getting experience and helping those companies see how it can like be implemented in their business to help their small business. That's like the number of new consultants and small business agencies that will help that group. That's like for the next six, seven years, a mega opportunity.\r\n\r\n\r\nNikolas Hulewsky (09:28.046)\r\nDo you ever look at it and be like, man, I want to do that and then remember what it was like to start and grow a business and then talk yourself out of it or are you chomping at the bit to get back at the game?\r\n\r\n\r\nStuart Draper (09:38.045)\r\ndude. Yeah, no, part of me cannot help but start thinking about the next ideas, but I'm very careful now because I don't want to go back entirely to the garage. Like I'm done with the garage days. That was an awesome time and I worked really hard, but, and I actually, and I could do it again. I know I could. The thing is when I think about doing it again, I'm like, I've, I\r\n\r\n\r\nI don't want to miss my son's baseball. And I don't want to have my wife say, we were going to go with my parents to New York for next weekend. And now you can't go because you have this commitment to go and be somewhere like that. just, it's, everyone needs to go through that phase where they say like, I'm making some sacrifices. I'm not doing the New York trip because I got to hustle and work and grind on my startup. Now I've done that.\r\n\r\n\r\nAnd I don't want to, I want to be careful where I'm, so I'm trying to put my money into founders, right? And, and, support them and advise them from a place where I get to pick my time in days, right? Very careful.\r\n\r\n\r\nNikolas Hulewsky (10:46.572)\r\nI'm with you. Okay, so let's go pretend. Let's pretend like we're whatever at that stage in our career. And maybe we've got an idea of what the business is or maybe we're still trying to figure out what the business is. What do you think is the best way to approach getting that first customer? Like how do you go from zero to a million dollars when you don't even know how to go from zero to a hundred dollars? You know I mean? Like what's the first step that you see as being the most important?\r\n\r\n\r\nStuart Draper (10:53.516)\r\nYeah.\r\n\r\n\r\nStuart Draper (11:14.536)\r\nNot being afraid to ask. the fear of failure, the fear of rejection keeps so many people from going and getting their first customer. If you know AI, if you have some ways that someone like a plumber\r\n\r\n\r\nNikolas Hulewsky (11:17.272)\r\nWhat do mean?\r\n\r\n\r\nStuart Draper (11:38.817)\r\nthat's doing two million a year in sales and they have figured out how to generate leads but they don't do a good job of getting back to their leads fast enough and you could go to that plumber and say, hey, I've got a way for you to use AI to ask more questions and set the appointment for you at 2 a.m. so that you can get with them at 7 a.m. when you wake up.\r\n\r\n\r\nIf you have that skill, if you know how to make something like that happen, and you've like dreamt of being your own boss someday, don't be afraid without an LLC formed yet, and without having built your own website yet. It's okay. You don't need your at newbusiness.com email even. Use your Gmail. Shoot them an email that says, I have a way that I can help you.\r\n\r\n\r\nSet your appointments at 2 a.m. using AI, and I think it can be a game changer for your business, right?\r\n\r\n\r\nNikolas Hulewsky (12:40.814)\r\nTell me about your first customer. What was your first customer? How did you get your first paying customer?\r\n\r\n\r\nStuart Draper (12:44.956)\r\nMy very first paying customer came from a free customer. I, my brother, yeah, yeah. yeah. So I think most startups go through a phase where they got to give some significant discounts if not work for free. absolutely. So my first business, I think a lot of founders do start their first business as a service-based business. Have you seen that Nick?\r\n\r\n\r\nNikolas Hulewsky (12:51.906)\r\nFree customer.\r\n\r\n\r\nNikolas Hulewsky (13:00.302)\r\nthe freemium, the freemium model.\r\n\r\n\r\nNikolas Hulewsky (13:11.566)\r\nDude, totally. Yeah, I totally agree. Agency business. And I think that that's honestly the best way to get started is an agency services business, right? Like either around a specific skillset or something that you know really well. It's the lowest risk way. High cash flow, not as well positioned from an asset standpoint, but yeah, totally agree.\r\n\r\n\r\nStuart Draper (13:16.052)\r\nIt's such a great idea, right? Yeah.\r\n\r\n\r\nStuart Draper (13:24.213)\r\nAbsolutely.\r\n\r\n\r\nStuart Draper (13:29.406)\r\nAbsolutely, business valuation's not gonna be as good, great first business to cut your teeth and learn how to be an entrepreneur and be successful. You can bootstrap it easily as well. You don't take as much risk and get investors involved. Anyway, so for me, I was working my first job out of college. I'm selling for them. It's going well. I get laid off. But at the same time that I got laid off,\r\n\r\n\r\nNikolas Hulewsky (13:41.667)\r\nYeah.\r\n\r\n\r\nStuart Draper (13:52.797)\r\nI was due at night, would moonlight for my brother-in-law, he's a dentist in Salem, Oregon, and he had three record-breaking months of new patients. If you searched for dentist in Salem, he was like fourth page, I got him the first page, I helped him get a good Google Maps listing and get start getting reviews and three record-breaking months of new patients for free, right? didn't.\r\n\r\n\r\nNikolas Hulewsky (14:11.022)\r\nSo you went to him and you're like, hey, I think I want to do this. I had this professor say something weird about it. Can I just try it for you? Like you just pitched him as, let's just try this.\r\n\r\n\r\nStuart Draper (14:18.994)\r\nExactly. Yep, bingo. And so when I got laid off, it was like my third time. Say what?\r\n\r\n\r\nNikolas Hulewsky (14:22.668)\r\nAnd then at the end at the end of three months he paid you right? At the end of three months he paid you right? I'm just kidding.\r\n\r\n\r\nStuart Draper (14:28.724)\r\nYeah, yeah, so he started paying me in January. So October through December, it was all free. In January, he started paying me and I could use him as a testimonial to go get other people to pay me. Right? And so that's how I got my first customer was using my free customer as a testimony.\r\n\r\n\r\nNikolas Hulewsky (14:39.31)\r\nMm.\r\n\r\n\r\nThank\r\n\r\n\r\nNikolas Hulewsky (14:51.222)\r\nWell, so just going back to your point about service based businesses, I love them so much because if I go start a business that has a lot of capex, all of a sudden I've got this overhead, potentially I've got debt, I've got a lease that I've signed. It forces me to go full time. It forces me to sink or swim. These agency businesses, services based businesses, I could do it as a side hustle.\r\n\r\n\r\nI could kind of moonlight and test it out and like really understand what the product offering is. Can I actually do the fulfillment? What does it look like to scale? It doesn't require me to just jump in, put every sign on the dotted line, right? Like it's way riskier in my experience to kind of go that other route. And it sounds like that's what you did. I don't know if you were working doing something else at the same time, but you know, you got a couple months of experience and then you could actually go and say, all right, I know how to do this. I've nailed it. Let's go and scale it.\r\n\r\n\r\nStuart Draper (15:42.143)\r\nYeah, no, that's exactly right. That's how I did it. And I think that the idea of trading your skills and expertise for hours and dollar and those hours for dollars, it's like a job. Service-based businesses, you're working yourself into a job and then you have to find a way to hire people to, and like work yourself back out of that job into a leadership and ownership role instead of like.\r\n\r\n\r\nNikolas Hulewsky (15:57.869)\r\nYeah.\r\n\r\n\r\nStuart Draper (16:10.656)\r\ndoing the day-to-day grind work. I never really figured that out while I was in the service space. No, not very well. So I sold that business when I had a successful product-based business that was two years old. And I waited until it was two years old, because I wanted to make sure it was going to work before I gave up the other thing that buttered me right. So that's StuKent, my tech company. did simternships and simulations. We call them simternships and e-cops books.\r\n\r\n\r\nNikolas Hulewsky (16:14.722)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (16:29.602)\r\nWhat was the product based business?\r\n\r\n\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (16:38.104)\r\nSimternships?\r\n\r\n\r\nStuart Draper (16:39.636)\r\nYeah, simulated internships.\r\n\r\n\r\nNikolas Hulewsky (16:42.072)\r\nDude, I love how all in you went on the terminology. think the like the best, I don't know how else to say this, but the best companies are cult like they have their own language, like their own shared language around things and people are bought in and really have a shared ethos. So like a symptom ship. Hey, we're both LDS dude. Like it was like, of course we could talk Colts.\r\n\r\n\r\nStuart Draper (16:59.274)\r\nYeah. Okay. Can we talk Colts? Can I share a Colts story?\r\n\r\n\r\nNo, this is not church related, I promise. Although I am a firm believer that God has guided and directed everything in my career. But from a cult perspective, as it relates to businesses, in 2019, so we were now like a six year old business, we had quote unquote made it by now, we felt like we had over 100 professors pay to come to\r\n\r\n\r\nWest Yellowstone, Montana to be at our first ever user conference. Right. We called it ProfCon and at ProfCon people are like coming up and hugging me to thank me for what I've built for them. Like that was, that meant the world to me. I was like walking out of this event going, why did I do this two years ago? I needed those hugs two years ago. But on stage, I had given my team a vision that was this, what Under Armour was to Nike and Adidas.\r\n\r\n\r\nNikolas Hulewsky (17:46.124)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (17:51.896)\r\nHahaha\r\n\r\n\r\nStuart Draper (18:01.098)\r\nThat's what Stukent will be to Pearson and McGraw Hill. And I had shared that internally within the organization for like three years, okay? But, and I can dive into why I came up with that later if you'd like. But at the conference, I shared that vision with the professors in the audience. I said, I believe that someday what Under Armour was to Nike and Adidas, that's what Stukent will become to Pearson and McGraw Hill.\r\n\r\n\r\nAnd in the back of the room, one of the professors was doodling while I was speaking from Oklahoma State University. And Jerry, he finished his little doodle and he just left it on the table. And his colleague sitting next to him, Kinda, she looks over and she's like snickering and laughing. And she's like, Jerry, you have to show this to Stu after. So they walk up to me after and they show me this doodle. Okay, on the doodle is a fish.\r\n\r\n\r\nNikolas Hulewsky (18:43.395)\r\nThank\r\n\r\n\r\nStuart Draper (18:56.608)\r\nthat says Stukent written out inside the fish. And then there's three little fish being about to be chomped by the Stukent fish and it's McGraw Hill. There's three little fish and one says Mc and it one says Gras and one says Hill. Okay, like two weeks, three weeks later, I got a t-shirt in the mail from my customer that had the Stukent fish eating McGraw Hill. My customers,\r\n\r\n\r\nwere that on board with my vision that we could change the EdTech world. And that was a huge aha moment for me. It was obviously like a measuring stick of success and brand power, but really what it did to me was it told me like, have to not only give as the CEO, if you're gonna grow a scalable business, you have to give your team a vision of what's possible, and then you have to go give your customers\r\n\r\n\r\na similar vision. That is ultra powerful. And so I do wish, still today, that instead of starting ProfCon after year six, I'd started it after year three or four. It wasn't a winner for me financially, like we didn't make a lot of money off the conference. The long-term brand power, so were.\r\n\r\n\r\nNikolas Hulewsky (20:00.205)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (20:06.093)\r\nYeah, I\r\n\r\n\r\nNikolas Hulewsky (20:13.934)\r\nI think about that a lot because if you're starting a business as an entrepreneur, you can get pretty far just by yourself. You're going to drag people along with you, but you hit a ceiling. It comes to a point where, all right, now I need other people around me to get me to the next level. And to your point, in order to get to the next level, when you have those people around you, you've got to give them a vision and you've got to give them shared language. And typically, shared language is created in this.\r\n\r\n\r\nsort of exercise that we do around what are our core values? What's our mission statement? What's our vision statement, right? But if you don't have that shared language, then you're going to stay at that ceiling because you as the founder, you can't be in every meeting. You can't talk to every new hire. As you expand past 30, 40, 50 employees, you just don't have enough time to do it. And the only way that you can scale what you've started is to have shared language and like, yeah, hey here, man, we have...\r\n\r\n\r\nStuart Draper (20:51.052)\r\nYeah.\r\n\r\n\r\nStuart Draper (21:07.262)\r\nabsolutely.\r\n\r\n\r\nNikolas Hulewsky (21:09.398)\r\nWhat was it again? The internship? Yeah, the simternship. Hey man, our simternships have to be really spot on. I don't know what that means, but everybody I'm sure in your organization knew what a simternship was. I'm sure there was lots of other sayings like that, but if you're going to grow, you have to have that shared language. And many times, obviously, you see that in Colts, but you also see that in these businesses where people believe they buy into you. They're buying into Stu. They're like, no, we're going to eat McGraw-Hill.\r\n\r\n\r\nStuart Draper (21:12.0)\r\nWhat? The same? the Simternship. Yeah, we call them Simternship.\r\n\r\n\r\nNikolas Hulewsky (21:38.882)\r\nThose three fish are going to be chomped. Let's go and do this. Let's create somebody, an enemy, not an enemy, like a shared foe for us to go and conquer. I love that stuff for entrepreneurs when they get to that level.\r\n\r\n\r\nStuart Draper (21:38.956)\r\nMm-hmm.\r\n\r\n\r\nStuart Draper (21:52.833)\r\nYeah, new hires on their first month of being hired, I ask everyone to come in for what's called the Under Armour Speech with Stu. And so I give them that vision. We talk mission, vision, values, right? All three of those things. And I think for a lot of founders, they're like, that's bogus stuff. It can be bogus if you don't have your own mission, vision, and values as the founder.\r\n\r\n\r\nNikolas Hulewsky (22:05.954)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (22:19.694)\r\n100%. 100%.\r\n\r\n\r\nStuart Draper (22:21.12)\r\nBut if you actually have a vision and a mission and you have some values as a founder, you get to lead out and make it not bogus.\r\n\r\n\r\nNikolas Hulewsky (22:32.023)\r\nWhat was your aha moment for that? Like, when did you realize that was necessary in order to, cause you, cause you said you weren't good at it, right? You did this digital agency and you kind of hit a ceiling or you, you couldn't figure out how to grow. Is that right?\r\n\r\n\r\nStuart Draper (22:41.804)\r\nOh yeah, for sure. Yeah, no, 100%. I think for me, my aha moment was multiple aha moments where my vision could be expanded. Okay? When I first had the idea for Stukent, I went to my mentor and I said, hey, if I can get a hundred students at a hundred universities that'll pay me a hundred dollars, that's a million dollars. A hundred times a hundred times a hundred is a million.\r\n\r\n\r\nAnd if I can do that twice a year, that's a $2 million business. Like I'm onto something here, right? And then I was like, well, that's only a hundred of them. I know there's thousands that I could go get, right? And so that was a first aha vision moment for me was when I said that a hundred times, a hundred times, a hundred. And then I started sharing that with the team, right? Well, then we did 2 million in sales. Our sales went up.\r\n\r\n\r\nNikolas Hulewsky (23:33.496)\r\nWell, who was the, and who was the team at that time? Sorry, who was the team?\r\n\r\n\r\nStuart Draper (23:36.878)\r\nso small. mean, I had a CRO that did the sales. He, at the time, I think I called him VP of sales or sales leader. don't know. And then I had a VP of marketing. and I think I called him CMO very fast. and I had another sales guy. Yeah. It was small team, right? Yeah. The first founding team is so small.\r\n\r\n\r\nNikolas Hulewsky (23:52.142)\r\nSo it's like three of you, three or four of you. And he did a million dollars or $2 million in that first year with just that team.\r\n\r\n\r\nStuart Draper (23:59.949)\r\nOh, no, by the time we did 2 million. So our sales were 100 grand year one. That was the three man team kind of stage, right? Then and we were probably four man team. Then we did 500 grand year two, a million year three, two million year four. And every time we kept hitting goals and setting new, bigger goals and proving to ourselves we could do it and hearing from the market that we were actually fulfilling our mission, which was help educators help students help the world.\r\n\r\n\r\nNikolas Hulewsky (24:04.558)\r\nOkay. Okay.\r\n\r\n\r\nNikolas Hulewsky (24:15.566)\r\nMm.\r\n\r\n\r\nStuart Draper (24:27.754)\r\nand we could like celebrate that we were fulfilling this mission. Dude, from there, everything got, the vision was able to expand. And here's where I came up with this idea for the vision, the vision statement around what Under Armour was to Nike and Adidas. So every day someone in the company is in charge, and I think they still do this at Stukent 12 years in, every day someone's in charge of a motivational moment.\r\n\r\n\r\nthat everyone can go look on Slack and see what the motivational moment of the day is, right? It was my turn to give the motivational moment. We were like a 10, 12 person team at the time. And I'm scrolling across YouTube and I found Kevin Plank, the founder of Under Armour, speaking to his alma mater, University of Maryland. And in his talk, he shared the first five or six years worth of sales numbers for Under Armour.\r\n\r\n\r\nAnd Stu Kent's beat Under Armour's numbers the first five years. And I was like, no way. Like we are going and growing faster than a household name global brand that's now doing billions in sales. Like our first five years in little Rexburg, Idaho, our education technology company is out performing Under Armour. For me, that was a...\r\n\r\n\r\nNikolas Hulewsky (25:50.318)\r\nDid you learn that?\r\n\r\n\r\nStuart Draper (25:52.299)\r\nThat gave me vision, right? And then when I caught that vision, I pulled everyone into a room as fast as I could to watch that video with me, right?\r\n\r\n\r\nNikolas Hulewsky (25:54.488)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (26:01.048)\r\nDude, did you learn that before or after you made the, what Under Armour was to Nike, we're gonna be to McGraw Hill. Did you know that before or after you said that statement?\r\n\r\n\r\nStuart Draper (26:09.736)\r\nno, that was after, after I watched that, that was when I had that aha moment and I created that kind of new.\r\n\r\n\r\nNikolas Hulewsky (26:12.736)\r\nokay.\r\n\r\n\r\nI was going to be like, dude, that, that would have been nuts. You're like, you said this, and then all of a sudden you're like, wow. And we're growing faster than them. Tell me about the first few years. So you had the digital agency. Did that effectively fund your ability to grow this, the ed tech, right? Cause you said you did a hundred thousand dollars in year one sales, but you had a team of three people plus you. it's not like unless they were working for free, I don't think that that was necessarily supporting them. How did you balance the two?\r\n\r\n\r\nStuart Draper (26:46.58)\r\nSo seed funding is what got us through. I had an angel investor put in a first 25 grand and when he did, he shot me a note with that 25 grand that said, hey, this is your first investor money and I'll help you raise the rest. You gotta quit everything else you're doing and go all in or don't cash the check kind of thing. And so I did, I took the money and said, I'm gonna do this. By the way,\r\n\r\n\r\nNikolas Hulewsky (27:05.902)\r\nMmm.\r\n\r\n\r\nStuart Draper (27:12.908)\r\nWhen he wrote that check, I had worked on the business plan for two years. had, and he had been my mentor. Like we would go to breakfast at Perkins. He was very aware of my idea, what I was working on and kind of coaching me through the market research phase where we called over hundred professors at a hundred schools and 60 % were unhappy with what they were teaching and 40 % still weren't even teaching digital marketing yet.\r\n\r\n\r\nAnd this was a decade after digital marketing had gotten going with Google making their money online. Right. And so it was like high time for higher education to catch up. so Stu Kent's slogan is stay current because it was like, wow, the education space is really behind if 10 years in we can be the innovator. Right. So, uh, it was a fun opportunity for us to come in and innovate fast and be the savior that they needed. I think if you're a founder.\r\n\r\n\r\nNikolas Hulewsky (27:47.246)\r\nCheers.\r\n\r\n\r\nNikolas Hulewsky (28:01.965)\r\nYeah.\r\n\r\n\r\nStuart Draper (28:10.538)\r\nlooking at starting a business and you're going to create a pizza company, like how are you going to be the savior in your town? Are you the first pizza company? Is that why? Are you the first pizza company to do X, Y or Z that none of the other pizza companies do? Okay. Like you might be innovating and finding a way to be the savior. For me, like the education world had been beat up in the media for years.\r\n\r\n\r\nLike my whole life, basically, I've heard that the US is behind in education, behind all these countries, right? So I knew there was a problem and I wasn't that excited about my experience getting my four-year degree. And so I knew there was a better way and then I felt like I was onto an idea that could create that. Up-to-date textbooks.\r\n\r\n\r\ninternships that gave students hands-on real-world experience in real time as they're learning. And so that's what we did. And I think you've got to ask yourself if you're doing that. For me, once we did that, everything worked itself out. The product market fit was there and we found a way to\r\n\r\n\r\nNikolas Hulewsky (29:15.726)\r\nI always, when I talk to founders, I always say that agency businesses, like we talked about services businesses are the best way to go. Cause Hey, if you're an engineer, cool. Now you have an engineering consulting agency or if you're a CPA, I just started my own CPA business. But what it allows you to do is get into entrepreneurship. You just start understanding what is a P and L, how do I manage cash as it comes in and how do I manage cash as it goes out? And then very analogous to tech, you can land and expand. So if you had one product offering,\r\n\r\n\r\nWell, pretty quickly you can, Hey, I get in with this one company that liked my payroll software. Well, what do they do for accounts payable and what do they do for HR onboarding and what do they do for accounting? And right. So it gives you an opportunity. just in the game. And when you're in the game, you have opportunities that come your way for you was the digital agency. Did it serve that purpose? Was it like kind of cut your teeth and then you saw this opportunity and we're like, yep, I've gotten this experience. I'm going all in.\r\n\r\n\r\nStuart Draper (30:11.86)\r\nyeah. Yeah. Yeah. So I was high. Yeah. I'm hiring students for get found first that have the basics of digital marketing from college. My professor Kent was kind of feeding me some of his talent. He'd be like, Stu, this is a good hire. You should consider this student. Right. So I was hiring away students out of college and going, man, I have to train them a lot still. And then all new one day said, Hey Stu, will you come back and teach digital marketing? And I was like,\r\n\r\n\r\nNikolas Hulewsky (30:27.771)\r\ncool.\r\n\r\n\r\nStuart Draper (30:40.092)\r\nHey Kent, like, I don't know if you knew this, but I don't have a master's degree. And he's like, well, dude, that's okay. I'm the dean of the school and I get to decide if you can be an adjunct faculty member without a master's degree. I said, okay, well yeah, I'll happily teach. I've always thought it'd be cool to be a professor. And so I started teaching digital marketing and that's when I went, okay, wait, the same stuff Kent taught me four years ago is kind of what I'm learning or what he gave me as curriculum.\r\n\r\n\r\nto teach now and that's not good enough, right? And then it was like only a Word document with hyperlinks to places online, half the links didn't work right. Students didn't know how much to read, whether they had to click to additional pages or not. And they were like, this is unfair. I don't want to be quizzed and tested on. And so I was like, well, I should write a textbook. And that was at first such an outlandish thought. I didn't even have a master's degree, but I took that one and I didn't have AI right at home.\r\n\r\n\r\nNikolas Hulewsky (31:10.595)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (31:34.328)\r\nYou didn't even have AI to write it for you.\r\n\r\n\r\nStuart Draper (31:39.265)\r\nWhat I did have was in the market research phase of deciding if this was an idea worth doing, I found a professor that had gotten his PhD at Wharton that was teaching at BYU's Marriott School of Management, a top 20 business school, and he was willing to test our new simulation that we created. And after he tested it, he went, hey, by the way, I told you originally I wasn't that interested in the textbook idea, but if you want, I'll co-author one with you. And so,\r\n\r\n\r\nThose ideas, they were one little idea that turned into a bigger idea that caught a bigger vision and had more potential as I just kept working through the process of getting going. As I took one more step in the dark, I got to the light.\r\n\r\n\r\nNikolas Hulewsky (32:23.406)\r\njust love how your story articulates what I think people don't quite understand about entrepreneurship, where just getting in the game, you have no idea where you're going to be in five years. You got laid off, so you're like, I'm going to start this digital agency. you do it. then obviously you have this relationship with the professor who's sending you students. And you do a good job. And then all of a sudden, that leads to you want to come be adjunct. then all of a sudden, that leads to do you want to write a book? And then you meet somebody else. And now they're co-authoring a book with you. And then all of a sudden, it's like, I'm going to go to 100\r\n\r\n\r\nuniversities around the country and you get those universities and then pretty soon it's 2024 it's 10 years down the line and you're selling the business for eight figures and none of that would have happened had you not been pushed and laid off in the first place. I shouldn't say none of that. You might have gone into entrepreneurship maybe down the road but like you got pushed.\r\n\r\n\r\nStuart Draper (33:07.668)\r\nYeah, yeah.\r\n\r\n\r\nStuart Draper (33:12.522)\r\nI got pushed man, yeah those failures young pushed me into decent, I I sold alarms for a summer, sucked at that, I thought man maybe sales isn't for me. I sold used cars and got fired two months in. They closed the business like another month after that, those dirt bags should have just held onto me and let me get laid off with the business dying and they knew it was dying but I thought I just sucked. Anyway, like I had some real failures young.\r\n\r\n\r\nthat led to me being able to decide I need to just go find my own way. Like that's where I'm gonna win is in my own thing. I kind of had dreamt as a kid that I would be my own boss someday, but no idea it would start that fast and yeah, I needed to be laid off. But I wanna point something out Nick to listeners today. You mentioned earlier the P &L, which I think scares people, profit and loss statement. Hearing balance sheet, income statement, I didn't go to business school and I don't know those things.\r\n\r\n\r\nFolks, go get sales. Go find ways to make money. And if you can make money, you can hire all the help you need. I was running an eight figure, very successful, high growth business that had been on the Inc 5000 list seven times when I finally stepped down as CEO, or six times, I guess, going on into its seventh time. And I didn't read the P &L that closely.\r\n\r\n\r\nI didn't study the income statement or balance sheet that closely because I had hired a very good CFO that I gave equity in the business. He's still running as CFO today, loving his job and the work that he gets to keep doing after me leaving. And it's so cool that he gets to do what he's good at and I got to do what I was good at. I was really good at the marketing, really good at the sales and\r\n\r\n\r\nNikolas Hulewsky (34:59.054)\r\namazing.\r\n\r\n\r\nStuart Draper (35:07.878)\r\nIf you figure those two things out, you can solve everything else. You can hire a talent to fix your products and services. can.\r\n\r\n\r\nNikolas Hulewsky (35:12.204)\r\nI-\r\n\r\n\r\nThat I learned that lesson early on my first job that I got fired from I did really good. I was an operator and I got into a position where they needed marketing and sales and I didn't know the first thing about it and I was like, well, I'm just going to look in the spreadsheets for some more operational efficiencies. I got fired because you can't cut your way out of growth. And I like I had to learn that lesson the hard way. It's so true. Go get sales. Go bring revenue into the business. It's the lifeblood of any business.\r\n\r\n\r\nStuart Draper (35:43.597)\r\nyeah, 100%. Hey, we only have so much time, I wanna share another thought or two. Are you cool with that? Dude, I caught this quote yesterday and it was like such a aha moment for me. John F. Kennedy is known for saying, change is the law of life. And those who look only to the past or present are certain to miss the future. Like you guys.\r\n\r\n\r\nNikolas Hulewsky (35:48.91)\r\nYeah, let's do it. Yeah, of course.\r\n\r\n\r\nStuart Draper (36:11.468)\r\nI got to ride that digital marketing wave. It was such a wave and there is still opportunity to go help people and be a digital marketer and it can be fun and exciting. If you're going to do it, learn it from the perspective of someone that knows how to utilize AI to win with digital marketing. Get into the game of AI at some level.\r\n\r\n\r\nor find the other things changing in this world where you can become the expert younger and it will turn decades into days for your career. Okay. Yeah, I mean, I appreciate you giving me a platform Nick to share it. Cause I read that and I'm like, yeah, I'm so grateful that.\r\n\r\n\r\nNikolas Hulewsky (36:47.755)\r\nThat's such good advice.\r\n\r\n\r\nNikolas Hulewsky (36:52.258)\r\nYeah.\r\n\r\n\r\nStuart Draper (36:57.532)\r\nI learned young how to change, how that change is the law of life and it's always going to keep happening. Frankly, after you sell a business, you still have to keep changing and evolving and decide what's next for you in life.\r\n\r\n\r\nNikolas Hulewsky (37:10.552)\r\nAll let me ask you this last question. If you were starting over today, knowing what you know now and all the businesses, all the opportunities that are out there right now, what are some of your favorite opportunities that you see in this space?\r\n\r\n\r\nStuart Draper (37:24.33)\r\nman. I obviously AI being one of them. I think that there is a ton of opportunity in the service-based businesses, the main street folks that haven't learned how to advance via digital, advance via social.\r\n\r\n\r\nimprove processes via AI. I think that if I was going to start a service-based business tomorrow, I'd be first going and learning more because I don't know enough. But I know that that stuff is going to change and the companies that figure that out are going to leave the other companies in the dust. So yeah.\r\n\r\n\r\nNikolas Hulewsky (38:12.43)\r\nI love that. It's true. Yep. Alright, Stu Draper. This has been an incredible conversation. Where's the best place for people to come find you?\r\n\r\n\r\nStuart Draper (38:22.16)\r\ncome personally meet me. I'll give you a big hug and cheer you on as a founder. If you come to one of my startups with Stu retreats, you can go to startupswithstu.com and learn more about the retreats in person that I host. I love to have people there. I had Rudy Rüdiger from the movie Rudy come on to the last one. That was so fun.\r\n\r\n\r\nNikolas Hulewsky (38:39.502)\r\nI don't know why.\r\n\r\n\r\nStuart Draper (38:43.5)\r\nI think one of my next ones I'm gonna have Curtis Matsko, the founder of Portland Leather Goods. If you don't follow him, his story, they're eight years in. I think coming up on nine years in, 500 million in lifetime sales in that business. I think this year over 200 million will be their number. So just a mind blowing success story, selling leather bags. What? Like he didn't, he innovated in this crazy space that's been around for a century and he's killing it.\r\n\r\n\r\nNikolas Hulewsky (38:59.054)\r\nCheers.\r\n\r\n\r\nStuart Draper (39:12.151)\r\nCurtis Matsko's a great follow, but I am Startups with Stu. You can find my podcast there on Spotify, almost at Shopify. But yeah, Nick, thanks for giving me some time today. Let's go start your businesses and go succeed, guys.\r\n\r\n\r\nNikolas Hulewsky (39:21.58)\r\nMaybe Shopify. Course.\r\n\r\n\r\nI love it. All right, stay on for a second.",
  "metadata": {
    "duration": "",
    "date": "2025-10-20",
    "platform_source": "Google Drive"
  }
}