{
  "episode_number": "183",
  "episode_title": "Turning AI Ideas Into Real Income with Chris Koerner",
  "guest_name": "Chris Koerner",
  "business_name": "Porta Quartz, Augusta Lawn Care Services",
  "transcript": "﻿Nikolas Hulewsky (00:00.148)\r\nbest friend.\r\n\r\n\r\nChris Koerner (00:05.905)\r\nAll right, do we just want to jump into it? Just like the old times?\r\n\r\n\r\nNikolas Hulewsky (00:09.742)\r\nLet's just jump into it. Well, yeah, or do you want to talk about what we want to talk about?\r\n\r\n\r\nChris Koerner (00:16.225)\r\nNow, I'll just make an intro once I know what we've already talked\r\n\r\n\r\nNikolas Hulewsky (00:19.17)\r\nOkay.\r\n\r\n\r\nChris Koerner (00:21.027)\r\nAll right, are you ready?\r\n\r\n\r\nNikolas Hulewsky (00:21.772)\r\nWait, Yeah, I just want to make sure it's happened to me earlier today. Or not earlier, last week. OK, mic is right, camera's right. OK, OK, I'm in.\r\n\r\n\r\nChris Koerner (00:33.081)\r\nOkay, so I am chock full of ideas today, but I have one that's literally 10 minutes old. Like I just bought the domain name 10 minutes ago and Replit is building it literally as I speak, because I just can't wait. Okay?\r\n\r\n\r\nNikolas Hulewsky (00:42.712)\r\nWhat? Is it called 10minutesold.com?\r\n\r\n\r\nChris Koerner (00:46.219)\r\nNo. And I'm not gonna lie, Nick, you kind of inspired this idea.\r\n\r\n\r\nNikolas Hulewsky (00:52.015)\r\nam I going to be offended by this? Okay, okay.\r\n\r\n\r\nChris Koerner (00:53.857)\r\nNo, no, no, you're not. So recently on your podcast, economics, you've been asking people every day how are they're using AI, right? And so I've just been thinking of that question. How are you using AI? How are you using AI? And it's like, I feel like that's going to become a standard question over the next decade, right? It like, what do you do for work? What do you do for work? What like that question will never get old, but instead it's going to be not let's going to replace it, but it's\r\n\r\n\r\nNikolas Hulewsky (01:15.224)\r\nYeah.\r\n\r\n\r\nChris Koerner (01:21.465)\r\nIt's gonna be that type of question where it's like, how are you using AI? Right? Cause that is the hardest part with all of this is just thinking of how to use it. Like, my gosh, this new feature is amazing. It's gonna change the world. How do I use it? Or more importantly, where in my business or where in my life do I apply this? Cause I just don't know, you know?\r\n\r\n\r\nNikolas Hulewsky (01:24.937)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:38.658)\r\nYeah, and it's too much. You don't even know where to start. You don't even know which question to ask to get started. Like, okay, which of these tools do I even use to get started? I totally agree. It's crazy time.\r\n\r\n\r\nChris Koerner (01:41.635)\r\nYou don't know where start.\r\n\r\n\r\nChris Koerner (01:46.861)\r\nYeah, okay, so I went to Namecheap and I looked up how do you use ai.com and it was not taken. It was not taken. So I bought it and then I'm gonna share my, it's a good name, I'm gonna share my screen and I went to Google Trends. I did this after I bought it to be fair and I'm sharing the Google Trends chart of the phrase how do you use AI, okay?\r\n\r\n\r\nNikolas Hulewsky (01:53.716)\r\nNo. No!\r\n\r\n\r\nSuch a name.\r\n\r\n\r\nNikolas Hulewsky (02:09.198)\r\nHold on a second. I'm on a podcast, Jess.\r\n\r\n\r\nChris Koerner (02:13.145)\r\nIt peaked like at the local peak was February, which is interesting. I think operator, maybe operator came out in February. That sounds about right. But it's still climbing. Like if you're just listening, it's a good looking chart. Okay. And so I started thinking, and this is literally 10 minutes old. So this is probably a bad idea at this point, but you'll help me make it a good one, Right. Okay. What?\r\n\r\n\r\nNikolas Hulewsky (02:14.412)\r\nSorry, good God.\r\n\r\n\r\nNikolas Hulewsky (02:23.414)\r\nYeah, operator. Yeah, that sounds about right.\r\n\r\n\r\nNikolas Hulewsky (02:37.068)\r\nYeah.\r\n\r\n\r\nChris Koerner (02:39.949)\r\nWhat can this be? And I'm not thinking of a billion dollar idea right now. I'm just thinking of a wrapper, some sort of a website, a gimmicky website, maybe a newsletter or something. And so I thought I've got, this is what I have replica building me right now. Can I read you the prompt? Okay. I want to build a website where people can merely submit ideas to others of how they're using AI, but you can, this is the key, but you can only see everyone else's use cases once you submit your own use case.\r\n\r\n\r\nNikolas Hulewsky (02:53.443)\r\nYes.\r\n\r\n\r\nChris Koerner (03:07.831)\r\nAnd then you can upvote others ideas of how to use AI after you submit your own. So it's like you have to give to the system before you get back from the system. And then I put, you got to give. Did you give? And then they can subscribe to be notified of all the top upvoted ways people are using AI every week. So upvotability, you can't see anything on the website until, and when you go to the website, it's just an open cursor box, just like you see on Replit or ChadGPT or anything.\r\n\r\n\r\nNikolas Hulewsky (03:15.148)\r\nYep. You've got to give.\r\n\r\n\r\nChris Koerner (03:38.133)\r\nOnce you type, and you can type in ABCD and get something. It doesn't matter, right? And then once you type it in, you can see a bunch of use cases. You can upvote, yada, yada, yada. And then as like a newsletter play or an email capture play, you could say, hey, we'll take the top five most upvoted ideas and email them to you every week. What do we think?\r\n\r\n\r\nNikolas Hulewsky (03:56.59)\r\nI love it. I think it's an amazing idea. It's the same reason why, it's kind of how I feel about AI, generally speaking, is it's an idea generator. I used to be, I'm the guy who's in a group when we're trying to figure something out, I'll throw out the first bad idea. Because we kind of need that first bad idea, at least to just, maybe all of them. Maybe every idea is a bad idea.\r\n\r\n\r\nChris Koerner (04:06.328)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (04:13.453)\r\nYes, you do. And maybe the second through 13th.\r\n\r\n\r\nall about it. Maybe every idea that comes up that's bad in that conversation is they're all from you. For instance.\r\n\r\n\r\nNikolas Hulewsky (04:24.142)\r\nBut when you're brainstorming, you need somebody to throw out something first, and then you can make a decision. It's kind of like when you're at home and your wife's like, hey, honey, do you like the blue color for this wall or the yellow color for this wall? No matter what you say, she's going to go with the opposite. Because it just finally gives her an opportunity to be like, yeah, I don't like that. I'm going to go the other way. That's kind of how I view AI, is I get the first iteration from it, and I'm like, I don't like that. And then I start working with it.\r\n\r\n\r\nChris Koerner (04:30.584)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (04:41.059)\r\nYeah.\r\n\r\n\r\nChris Koerner (04:45.869)\r\nYeah. Yep.\r\n\r\n\r\nNikolas Hulewsky (04:53.41)\r\nYeah, I think there's a ton of demand from people just to hear how other people are using AI just for an idea that they can kind of steal and apply to their lives.\r\n\r\n\r\nChris Koerner (05:02.411)\r\nOr like if you want her to spend time with you, you say, hey babe, you want to spend time with Raul or myself tonight, your private tennis coach? And you always suggest Raul because then she'll hang out with you, right?\r\n\r\n\r\nNikolas Hulewsky (05:05.121)\r\nYou're still on it.\r\n\r\n\r\nNikolas Hulewsky (05:15.84)\r\nYeah, know, oddly enough, just always tends to pick Raul. It's really weird.\r\n\r\n\r\nChris Koerner (05:22.455)\r\nNo matter, there's really no correlation to what I say. Sometimes she doesn't even wait for my answer.\r\n\r\n\r\nNikolas Hulewsky (05:25.646)\r\nYeah, and he always goes.\r\n\r\n\r\nIt's like she knew what I was thinking. Okay, here's why I like this idea. Again, you and I don't talk before we do these things. One of my ideas today is I love personality quizzes. I know everybody does because you're like, I want to know which house of Gryffindor, or which house of Hogwarts I would be in. Am I Gryffindor? Am I Slytherin? And do this personality quiz. Like my son, he wants to know which Marvel character he is. Like we all want to know.\r\n\r\n\r\nChris Koerner (05:30.573)\r\ngone.\r\n\r\n\r\nChris Koerner (05:44.345)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (05:50.019)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (05:57.826)\r\nwhat our personalities are. And I've actually created a few of these. I'm going to share my screen right quick. Because I think that there was a.\r\n\r\n\r\nChris Koerner (06:06.905)\r\nediting note, this can be edited out. I really like the sharing the screen as much as possible because on Greg Eisenberg's episodes, the ones that crush, there's like a direct correlation between where he shares the screen a lot and when he doesn't. And I don't think it hurts the audio at all, you know?\r\n\r\n\r\nNikolas Hulewsky (06:13.9)\r\nsoon.\r\n\r\n\r\nNikolas Hulewsky (06:25.358)\r\nEvery one of my ideas today has a share screen. all right. So I'm gonna go find this, here we go.\r\n\r\n\r\nChris Koerner (06:28.419)\r\nCool.\r\n\r\n\r\nNikolas Hulewsky (06:34.924)\r\nHang with me for a second. promise that this is gonna make sense. I interviewed a bunch of people for my podcast and I was just like trying to figure out what do they do with AI? And so from all of their answers, I was able to kind of understand which LLMs people use for which use cases. And so then I went to ChatGBT and I was like, help me create this quiz based off of all of this data. so it created this, helped me create this quiz. I went then to Lovable and here it is, right?\r\n\r\n\r\nThis the entrepreneur's guide to LLMs. Which AI model is right for your business? And there's ChatTPT, there's Claw, there's Perplexity, and there's Grok. And the quiz helps you identify which AI model aligns with your specific business goals, your ideal AI implementation strategy, and which AI tools deliver the highest ROI for your situation. You start the quiz, and then it just starts asking you questions. What's your comfort level with tech, et cetera, et cetera. So I'm not going to go through the whole thing. But to your point, the thing that\r\n\r\n\r\nChris Koerner (07:21.145)\r\nHmm. It's a great idea.\r\n\r\n\r\nNikolas Hulewsky (07:27.754)\r\nAI is really good at right now, these LLMs, is taking a ton of filtering it, and kind of regurgitating it in a way that is concise. It's not yet good at creating novel ideas, but it's really good at taking a lot of information and synthesizing it and giving it to you. So along the lines of what you're talking about, I think that there are tons of opportunities to use AI to give other people ideas of how to use AI. This is one example.\r\n\r\n\r\nThis will give you an idea of like, should I go with Grok? Should I go with ChatTPT? Should I go with Google? You know, which one of those you go through this quiz, you answer some questions and it just spits out a general, hey, you're not very tech savvy. Just go to ChatTPT. It's the best user interface. Right. But I think there's a million sort of niche implementation or offerings that you can create around this. How do you know yourself better? And then like, I'll just go through this really quickly. I'm just going to click on some of these blah, blah. And I'll show you at the very end. This is what it looks like.\r\n\r\n\r\nChris Koerner (07:55.331)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (08:09.987)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (08:25.58)\r\nAnd again, it's using the LLMs. Of course, I gotta have a gating mechanism. You gotta put in your email if you wanna see your score.\r\n\r\n\r\nChris Koerner (08:30.903)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (08:34.818)\r\nAnd then it, boom, here's my profile. I'm the client whisperer. Yeah. My primary model is Claude. And then it gives me all the reasons for that, et cetera. So your idea, which is like a community of sharing idea, and in order to get into it, you've got to give, I think is freaking brilliant because it just automatically gets people to engage. This is another type of idea playing on that. How do you get AI to reach into you and your insights and give you a recommendation?\r\n\r\n\r\nChris Koerner (08:37.335)\r\nMmm. Mmm!\r\n\r\n\r\nChris Koerner (08:45.752)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (09:03.51)\r\nof what might or might not be useful to you. And obviously this is one way I've kind of applied it.\r\n\r\n\r\nChris Koerner (09:10.019)\r\nThat is amazing. How long did this take you realistically?\r\n\r\n\r\nNikolas Hulewsky (09:13.794)\r\nSo this was the first time I did it. So it took me a couple of hours. If I were to do it now, probably an hour. Cause what you have to do is I have to take all the data, synthesize it, put it in a format where then I can go to ChatGPT and say, Hey, create the quiz for me. And then ChatGPT creates the quiz. And then I go to lovable and I go back and forth, blah, blah, blah. And then it creates this. So it's honestly doesn't take that much intellectual power. It just kind of takes some time to go through the steps. I'm sure there's a way I could even automate it. I just haven't done it.\r\n\r\n\r\nChris Koerner (09:26.713)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (09:42.125)\r\nYeah, this is beautiful.\r\n\r\n\r\nNikolas Hulewsky (09:45.878)\r\nSo can I keep building on this? Okay, so along this idea, I think there's a huge opportunity for someone to step into this space with, have you heard of Dribbble? Okay, and there's another company, well found. I was doing some research, Contra. Like these are niche job boards effectively, where they're only targeting one specific skillset. Like Dribble is very specific. These are designers, yeah.\r\n\r\n\r\nChris Koerner (09:48.493)\r\nYeah, please.\r\n\r\n\r\nChris Koerner (09:59.171)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (10:11.341)\r\nDesigners. Yeah.\r\n\r\n\r\nNikolas Hulewsky (10:13.198)\r\nWell found, I believe is very specific. It's like Angel List job listings or something like that. So these are like VC Angel Listing startups. But they found a niche. They're not in everything to everybody. I think by coupling this like quiz idea with a job board, you could match job seekers and job offers, employers with each other. That's personality based and not necessarily.\r\n\r\n\r\nChris Koerner (10:35.417)\r\nHmm\r\n\r\n\r\nNikolas Hulewsky (10:40.91)\r\nskill or background based because many times you get into a position. It's like, oh, they just didn't match. They mesh. They weren't a cultural fit. And most companies is my belief. If they're a cultural fit, you can kind of train them on the things that you want them to do. So you could apply this thing to any niche globally. You could apply this to any niche. You could build a company that's just matching people who are, I don't know, digital designers for painting companies. Maybe that's too specific. But I think pretty easily you could build a wrapper. You could build a software platform, cetera.\r\n\r\n\r\nChris Koerner (10:43.459)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (10:52.782)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (11:10.658)\r\nThat's like high level VC land tech opportunity. But I think for smaller companies, so for people like you and I, we could create our own internal quizzes. You're hiring people for your content team. I'm hiring people for my content team. Here's a quiz.\r\n\r\n\r\nChris Koerner (11:22.457)\r\nLike a Myers-Briggs for the culture that we want to see in our companies.\r\n\r\n\r\nNikolas Hulewsky (11:27.008)\r\nExactly. And we have so much data about us, right? We can say like, hey, chat, T-P-T, create a quiz that somebody can take that will mesh with me, right? And like...\r\n\r\n\r\nChris Koerner (11:30.658)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (11:38.635)\r\na quiz that will prove if someone is good working for someone that's very insecure, you know what saying? Yeah. Like for that would be for you not like not me. Yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (11:42.912)\r\nYeah.\r\n\r\n\r\nThat would be for me. That would be for me. Yeah. But it would be pretty, it's asymmetric, right? Like I don't have to pay for Myers-Briggs access. I don't have to have them log into a specific website or get credentials for it. like, hey, I created this wrapper, take this quiz. I want to see if we're a mesh. And at least it would give me some insights into where their strengths and weaknesses are. So that would be like an internal thing that.\r\n\r\n\r\nChris Koerner (12:01.998)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (12:05.868)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (12:14.456)\r\nPretty much any company pretty easily could create a wrapper that would do that.\r\n\r\n\r\nChris Koerner (12:16.865)\r\nYeah, dude, dude, what I mean, what are gonna pay a recruiter to place someone like we're talking 30 % of first year salary? That accurate?\r\n\r\n\r\nNikolas Hulewsky (12:26.306)\r\nYeah, usually 10 to 30%. I mean, it just depends on the role and the recruiter. Yeah.\r\n\r\n\r\nChris Koerner (12:29.357)\r\nLet's say it's 10, $150,000 a year salary, $10,000 to place someone. Let's say you set up an automation to message everyone on LinkedIn that is in HR or in hiring. And you say, listen, I match people with HR departments, based on their personality type or their culture fit. But this is very unique. I want to know exactly what your company's culture fit is. Would you mind simply taking this quick quiz?\r\n\r\n\r\nAnd I'm going to tell you exactly what your score is. And then worst case scenario, I send you some qualified applicants and then that hiring decision maker, they fill this out and it might take 10, 20 minutes. It's like a type form. You don't know when it ends. You've got sunk cost fallacy. You're just answering, answering, answering, and it's building a purse, like an archetype of your company, exactly the type of person that you like to hire. Right. And then it spits out a result. It's like a numerical result or something. And then on the other side of that equation,\r\n\r\n\r\nNikolas Hulewsky (13:10.21)\r\nYeah. Yeah.\r\n\r\n\r\nChris Koerner (13:26.841)\r\nyou send a similar quiz that matches it up with job seekers. And then you can send notifications to the hiring managers of saying, hey, let's say it's a scale of one to a hundred, right? Hey, your perfect score of a perfect candidate is an 87. Look at these 87s that we just found that just filled out the same form, right? Look at these 85 to 88s that we just found. And then you could match them and place them.\r\n\r\n\r\nNikolas Hulewsky (13:51.822)\r\ndude, okay, I'm gonna go on the other side of it. This could be a massive differentiator for any company that they build their own quiz. It's like, hey, and I don't know, you're better at this than I am. I don't know how they would get people to take it, but let's say they build their own quiz. It's a lead magnet, people start taking it, and then they're just building. In order to get the quiz results, you've gotta put your email in, so they're just building this list where anytime they have an open position coming up, they can go to the list and be like, oh yeah, Shonda 857, she was a nine in these skillsets, let's reach out to her.\r\n\r\n\r\nChris Koerner (14:04.547)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (14:18.157)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (14:21.9)\r\nSo a company that had, let's think of a company that has a really good.\r\n\r\n\r\nChris Koerner (14:22.337)\r\nMm hmm. It's like they could white label it from us, right? Like they would use it internally.\r\n\r\n\r\nNikolas Hulewsky (14:27.724)\r\nYeah. Yeah. Or let's use you as an example. How many followers do you have across platforms now? Three million. Let's say that you decided, I don't know, next week that you're like, hey guys, I built this cool quiz with AI. It only took me 20 minutes. Check it out. And it was specifically for this. Like it was asking questions about potential employees. And for every video that you post, how many views do you get?\r\n\r\n\r\nChris Koerner (14:35.321)\r\n3 million.\r\n\r\n\r\nChris Koerner (14:54.937)\r\n800,000.\r\n\r\n\r\nNikolas Hulewsky (14:56.384)\r\nOkay, 800,000 to a million, and let's just say 1 % of those people. So 8,000 people to 10,000 people actually go and fill out the survey. You've got 10,000 people who filled out the survey with an email address that you can go at any time now to query if you're looking for a position. If you're like, I need an accountant. I need a whatever social media manager. I'm to go look at this list right now and see how many of them actually matched with my company's culture score.\r\n\r\n\r\nChris Koerner (15:12.025)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (15:24.249)\r\nIt's a no-brainer.\r\n\r\n\r\nNikolas Hulewsky (15:25.487)\r\nDude, think about that for HR departments, even like big companies, HR departments, they could easily build this within an HR department. It's not hard.\r\n\r\n\r\nChris Koerner (15:31.447)\r\nYeah, yeah. And you don't even have to include questions about their skills. It could only be questions about their personality, you know, or their preferences.\r\n\r\n\r\nNikolas Hulewsky (15:39.032)\r\nTotally.\r\n\r\n\r\nDo you ask any random questions in your interviews?\r\n\r\n\r\nChris Koerner (15:45.432)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (15:46.604)\r\nWhat are some of them?\r\n\r\n\r\nChris Koerner (15:48.121)\r\nlike historically throughout your life, what have you been like abnormally obsessed with?\r\n\r\n\r\nNikolas Hulewsky (15:53.902)\r\nThat's a pretty good one. One question that I always ask is which one of these scenarios stresses you out more? Being dropped into the middle of a foreign country with no plan, no itinerary, no idea where you are, or going to a foreign country and every minute of every day that you're there is scheduled out to a T and you have no flexibility.\r\n\r\n\r\nto do anything outside of what's scheduled for you. Now, which one of those would give you more stress?\r\n\r\n\r\nChris Koerner (16:22.265)\r\nMmm.\r\n\r\n\r\nHmm.\r\n\r\n\r\nThis is a one for sure.\r\n\r\n\r\nNikolas Hulewsky (16:29.646)\r\nYeah, it's second one, right? Like, so usually if I'm interviewing a marketer, to be honest, if they're like, the first one would stress me out more. I'm like, yeah, you're not going to be a good cold collar. Like if you don't do good in ambiguity, I'm not. And I know like there are a lot of other factors there, but that's one of the questions that I ask. So to me, the whole quiz would be those types of questions. It's not going to be like, how would you rate yourself as a team player? Because everybody's going to answer that question the way that they think the employer wants to hear it.\r\n\r\n\r\nChris Koerner (16:39.001)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (16:52.237)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (16:57.271)\r\nYeah, that's good. That's like asking like, because if you ask him, do you have a high tolerance for ambiguity? Absolutely, I do. But you don't really know if that's true. But that's what you're really getting at, right? Like\r\n\r\n\r\nNikolas Hulewsky (17:06.152)\r\nYeah. Right. Another just quick interview question I love is kind of, it's very similar to yours. And I think I stole this from My First Million, but it like, what was the last project you spent all night working on or lost sleep over? I just want to hear what they nerd out about. Like, what are you obsessed with?\r\n\r\n\r\nChris Koerner (17:21.209)\r\nMm.\r\n\r\n\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (17:28.888)\r\nSo.\r\n\r\n\r\nChris Koerner (17:29.005)\r\nYeah, that's a really interesting question. Okay, can I go next? All right, so.\r\n\r\n\r\nNikolas Hulewsky (17:32.62)\r\nI love that one.\r\n\r\n\r\nNikolas Hulewsky (17:36.44)\r\nYeah.\r\n\r\n\r\nChris Koerner (17:42.509)\r\nHave you played around at all with Manus's new feature of creating pitch decks? All right. I feel like this is the most underrated things in AI right now. We're not talking, no one's talking about it. Why aren't we talking about this? I'm gonna share my screen and I've got.\r\n\r\n\r\nNikolas Hulewsky (17:48.234)\r\nNo. I've read about it, but I have not played it.\r\n\r\n\r\nNikolas Hulewsky (17:55.522)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (18:00.736)\r\nWhile you're pulling that up, I've messed with GPT-4.0, right? And the PDFs and the slide decks that they can build are incredible, but you have to build them sequentially and you have to build them one at a time. It's not just going to spit out 10 slides for your slide deck. So what you're saying is Manus actually spits out the whole deck. Holy crap.\r\n\r\n\r\nChris Koerner (18:17.625)\r\nMmm.\r\n\r\n\r\nMm hmm. All right, so I'm going, I'm going to share my screen.\r\n\r\n\r\nNikolas Hulewsky (18:28.75)\r\nI've got some deck insecurity right now.\r\n\r\n\r\nChris Koerner (18:29.065)\r\nMmm.\r\n\r\n\r\nChris Koerner (18:34.115)\r\nAll right, so this is Manus. This is my prompt. This is the whole thing. Make a PowerPoint deck for me showing the growth of the RV park industry. Like no details, nothing. Okay, and it worked, it worked, it worked. It worked for 12 minutes and 31 seconds and it spit out this. 12 slides.\r\n\r\n\r\nNikolas Hulewsky (18:56.462)\r\nHoly crap. Wait, did it get that? Hold on, I'll go back to the first picture.\r\n\r\n\r\nDude, I could be wrong. Have you used this picture before in an RV deck? Yeah.\r\n\r\n\r\nChris Koerner (19:03.255)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (19:07.499)\r\nIt looks really familiar. It looks like one that I have used, but I don't think I've used this exact one.\r\n\r\n\r\nBut I mean, look at this.\r\n\r\n\r\nNikolas Hulewsky (19:16.108)\r\nmy North American market growth RV ownership. Holy crap. Now does Manus do you have this deck in Manus like is it pulling from stuff you've already created or is this totally on its own?\r\n\r\n\r\nChris Koerner (19:19.469)\r\nThis looks like the deck that I use for the same purpose.\r\n\r\n\r\nChris Koerner (19:30.073)\r\nNo, I've never even asked it about RV park stuff. Yeah, I didn't teach it anything. Isn't that crazy? I just shared the wrong screen. That was 12 slides. Yep. Yep. Now, here's another prompt that I just gave it that I haven't even looked at. So this is the big reveal. I gave a keynote speech a couple months ago about the role of a CEO. And it's 70 something slides, I think.\r\n\r\n\r\nNikolas Hulewsky (19:36.482)\r\nHow many slides was that?\r\n\r\n\r\nNikolas Hulewsky (19:42.222)\r\nSo it took about one minute per slide. You said it took 12 minutes to think and it produced 12 slides.\r\n\r\n\r\nChris Koerner (19:59.673)\r\nAnd I said, great job. Now make this attached deck have no, it's not 70 sides. It's like 30 something, but it's 70 megabytes. Now make this attached deck have much better design while leaving the content the same. So I haven't looked at this yet. So it might be embarrassing, but I want to show you what it looked like before. Um, it is ugly. Like I don't, I don't put any thought into my decks. Okay. Can you see my screen here? Very basic, very ugly.\r\n\r\n\r\nNikolas Hulewsky (20:26.798)\r\nOkay, so this is the original deck. Cover your assets, perfect. Take advice from the right people, sure.\r\n\r\n\r\nChris Koerner (20:28.887)\r\nThis is the original. Okay. It's just as ugly as you get because I don't, I don't care. Right.\r\n\r\n\r\nNikolas Hulewsky (20:36.14)\r\nRight, content's generic, it looks generic, like I get a surface level.\r\n\r\n\r\nChris Koerner (20:39.553)\r\nIt's all basic. Yes.\r\n\r\n\r\nAll right, so let's see what it spit out for me, because I have not looked at this yet. I'm really, I'm just now learning this for the first time.\r\n\r\n\r\nNikolas Hulewsky (20:54.638)\r\nOh, Nicholas, a tiny dancer. Do-do-do. Round the headlights on the highway. She was a really great woman. Okay, I'm, wow, I'm just hearing this for the first time. RBG, RIP, okay.\r\n\r\n\r\nChris Koerner (21:05.741)\r\nhave to...\r\n\r\n\r\nChris Koerner (21:16.503)\r\nRBG.\r\n\r\n\r\nNikolas Hulewsky (21:18.062)\r\nRuth Bader Ginsburg, that's the clip.\r\n\r\n\r\nChris Koerner (21:19.839)\r\nthat's what he's talking about in that clip.\r\n\r\n\r\nNikolas Hulewsky (21:22.584)\r\nYeah, they're telling him that she died and he's hearing it for the first time.\r\n\r\n\r\nChris Koerner (21:26.914)\r\nAll right. Here's what the new one looks like. It's even worse. It looks terrible. OK, it's bad. Look, it took my picture and made it AI generated.\r\n\r\n\r\nNikolas Hulewsky (21:34.35)\r\nOkay. wow. So let me ask you the question about the first one, which was, hey, we're so early. It's so bad. The first one was a slide deck, 12 slides of the RV industry. So when I use chat GPT, it spits it out as a PDF. It's uneditable. Is this editable?\r\n\r\n\r\nChris Koerner (21:43.149)\r\nWe're so early. We're so early.\r\n\r\n\r\nChris Koerner (21:50.31)\r\nhuh. Yup.\r\n\r\n\r\nChris Koerner (21:57.591)\r\nIt's spit it out as a PPT, as a PowerPoint. Yeah.\r\n\r\n\r\nNikolas Hulewsky (22:00.578)\r\nReally? Holy crap, man. That's... Okay, so side quest here. How much are you using Manus right now?\r\n\r\n\r\nChris Koerner (22:12.757)\r\nNot that much. I just started playing around with it when this new feature came out. I was using it a month or two ago, but I just moved on.\r\n\r\n\r\nNikolas Hulewsky (22:19.17)\r\nWhat were you using it for a month or two ago?\r\n\r\n\r\nChris Koerner (22:21.881)\r\nIt's like agentic like features. It kind of acts like operator, but it wasn't as good in my experience. And so when I didn't like that output, I just I went back to ChudgePT.\r\n\r\n\r\nNikolas Hulewsky (22:34.89)\r\nWhat are people using Mantis for right now?\r\n\r\n\r\nChris Koerner (22:37.675)\r\nManus. I think they're using it for this a lot, but I don't know. It is like it's a Chinese owned company and so kind of TBD on what's happening with our data here, but we'll see.\r\n\r\n\r\nNikolas Hulewsky (22:40.266)\r\nYeah, that's what I said.\r\n\r\n\r\nNikolas Hulewsky (22:52.078)\r\nBecause I've heard a lot about mannus.\r\n\r\n\r\nNikolas Hulewsky (23:02.968)\r\nthink it'll work out, but we'll see.\r\n\r\n\r\nChris Koerner (23:05.836)\r\nJust as Theo Von said when his cousin got bit by a gay guy, we'll see.\r\n\r\n\r\nNikolas Hulewsky (23:09.698)\r\nWhat? What the freak?\r\n\r\n\r\nChris Koerner (23:12.985)\r\nYou can edit that out, Mohamed. Please. You never heard that joke? It's one of his stand up bits. goes, so my cousin got bit by a gay guy and then he just sits and like he sits on it. Everyone's laughing. So we'll see.\r\n\r\n\r\nNikolas Hulewsky (23:15.374)\r\nPlease do. Banana, no.\r\n\r\n\r\nNikolas Hulewsky (23:28.524)\r\nHahaha\r\n\r\n\r\nChris Koerner (23:30.807)\r\nThat's like the whole bit. It's so good.\r\n\r\n\r\nNikolas Hulewsky (23:35.918)\r\nCan I share something?\r\n\r\n\r\nChris Koerner (23:38.553)\r\nWell I wanted to attach some business ideas to this. Okay and you're gonna like it. You're gonna like it. Okay. All right so how big is the pit? How big is the pitch deck industry? It's multi-billions right? Corporate America, the corporate world is built on PowerPoint pitch decks. Yeah. There's\r\n\r\n\r\nNikolas Hulewsky (23:39.758)\r\nOr do you have more with Manus? Oh, OK, yeah, yeah.\r\n\r\n\r\nOf course I will.\r\n\r\n\r\nWe'll see.\r\n\r\n\r\nNikolas Hulewsky (23:55.48)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (23:59.928)\r\nPitch text. Yeah, it's the modern idea conveyor that we use, yeah.\r\n\r\n\r\nChris Koerner (24:05.369)\r\nYes. So there's a guy on Twitter. I think he's the pitch deck guy and his whole business. This is it. He goes and he scrapes like the filings, uh, sec filings when people launch a new fund or anything with, you know, people that are about to need a really nice pitch deck and he will do cold outreach to them in the right time, the right moment and say, Hey, I saw you launched a fund for buying single family homes. Congratulations. I'd love to make a pitch deck for you. Here's my portfolio. What does he charge? 3,500 bucks.\r\n\r\n\r\nOkay. And they look really good. They're really good. So Nick, Manus has an API. Who's stopping you or anyone from building an agent or an app or anything. It could be just an automation with, Gumloop or Lindy or Zapier that scrapes all those SEC filings, finds the funds that are launched permissionlessly goes to Manus through the API and says,\r\n\r\n\r\nNikolas Hulewsky (24:37.068)\r\nLove it. Yep.\r\n\r\n\r\nChris Koerner (25:03.041)\r\nHere's all the information for this fund. want you to make a really good looking pitch deck. According to these pitch decks, I want it to have this design and send it back to me. Boom. You get it. Then you go to Apollo or any other feature that finds people's contact information and you cold email the pitch deck to them with watermarks that says, Hey, congratulations on the fund. I made you a pitch deck. Would you like to buy this? Here's the first five slides. That's that could be fully automated as of today.\r\n\r\n\r\nNikolas Hulewsky (25:28.814)\r\nYeah.\r\n\r\n\r\nThat's, well, okay, so there's the pitch deck guy and then there's Matthew Gore. I had him on my podcast. He's the pitch deck cowboy. has a, like that's his business is he build pitch decks for people. Funny story really quickly. I was on my way to bogus basin in Boise, Idaho. I'm buying a fricking burrito at this random place. Order it. I'm picking it up. And this guy next to me goes, are you, you on Twitter? I was like, why yes, I am. It's like, are you co-founders Nick? I'm like, yeah, yeah. It's like, I'm the pitch deck guy.\r\n\r\n\r\nChris Koerner (25:40.841)\r\nyeah.\r\n\r\n\r\nNikolas Hulewsky (26:02.318)\r\nI'm like, wait, what? It's like, yeah, I'm the pitch deck guy. I live in Dallas, but I'm actually from Boise. So just like random, yeah, randomly on my way up the hill, I met him, which was, which was fricking cool. Yeah, totally random. I think that the ability to convey a story is like so valuable that most people think of pitch decks as like, a major presentation or I'm trying to raise money or it's like something super serious. I think just the ability of pitch decks to convey any idea.\r\n\r\n\r\nChris Koerner (26:07.797)\r\nWhat are the chances?\r\n\r\n\r\nThat is crazy.\r\n\r\n\r\nChris Koerner (26:21.314)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (26:27.15)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (26:31.904)\r\nis so valuable that yes, there's the SEC filings, but you could permissionlessly offer this as a marketing agency as a way to get as a way to get clients. You're like, hey, Ethan, what's his name? He's on Twitter. Ethan. He's the branding guy. my gosh. Driscoll. Yeah, yeah. Ethan Driscoll. This would be a perfect like cold outreach for him just to permissionlessly have Manus take all of his ideas, put them into a slide deck.\r\n\r\n\r\nChris Koerner (26:39.927)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (26:50.288)\r\nDriscoll or?\r\n\r\n\r\nNikolas Hulewsky (27:01.698)\r\nby scraping whatever the list is that he's created off the internet and just generate business that way. Yeah, I love your idea. I also think there's a bunch of different applications you could use for cold outreach.\r\n\r\n\r\nChris Koerner (27:02.029)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (27:14.841)\r\nTwo more ideas. You heard of slideshare.net. It's either five or 10 million visits a month. Okay. It's just a website for uploading your slides, your decks to like to be hosted, to be viewed, right? So if you go to slideshare.net, you can see like Netflix's famous 125 slide presentation on culture there. And then you can also see, you know, econ 101 from Alabama community college, some\r\n\r\n\r\nNikolas Hulewsky (27:16.632)\r\nOkay. No.\r\n\r\n\r\nNikolas Hulewsky (27:24.631)\r\nWhat the fu-\r\n\r\n\r\nNikolas Hulewsky (27:38.978)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (27:44.351)\r\nstudent group, they uploaded there so they could present it in class and like it has three views, right? Hundreds, if not thousands of slides are uploaded to slideshare.net every single day. This company sold to LinkedIn in 2012 for 112 million. And then they sold from LinkedIn to Scribe for I don't know how much it wasn't disclosed. So this is a big business. It's a nine figure business. Why not like do the same thing with that? Like create a permissionless thing.\r\n\r\n\r\nNikolas Hulewsky (27:47.864)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (27:55.054)\r\nOkay.\r\n\r\n\r\nChris Koerner (28:12.365)\r\nthat anytime a new slide is uploaded to slide share, you revamp it, you redesign it. So instead of making one from scratch for the SEC filings, you're just redesigning them, sending them back to the original creator and saying, hey, you may like this better. You may not. If you do buy it for 20 bucks, 200 bucks, whatever, or an automated, teachers paying teachers, teachers pay teachers.com. It's a place for teachers to sell layered lesson plans. You could go on there.\r\n\r\n\r\nNikolas Hulewsky (28:26.286)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (28:30.359)\r\nand automate it.\r\n\r\n\r\nNikolas Hulewsky (28:39.746)\r\nThat's such a good name. Hey, teacherspayingteachers.com, what do they do? Well, they pay teachers.\r\n\r\n\r\nChris Koerner (28:41.611)\r\nIt's a good name. You could go on there and like DM mass DM all the teachers that are selling lesson plans and say, hey, why don't you sell a pitch deck alongside the lesson plan like a lesson plan plans great, but you'll probably sell even more if you have a pitch deck version. I'll convert that for you for 20 bucks. What are we doing? What are we doing?\r\n\r\n\r\nNikolas Hulewsky (29:03.438)\r\nShoot, that's... Or anything with a lesson plan. People who teach church, like, let's say we have a lesson plan for Sunday. What do we typically do? Are we like, maybe we have something on our iPad, whatever. We could just easily upload an outline and be like, hey, create a PowerPoint presentation based off of this. What are we talking about right now, dude? What, why are we even talking right now? We need to be grinding, building. My gosh. Maria, plan the rest of my day.\r\n\r\n\r\nChris Koerner (29:20.226)\r\nMm What are we doing? What are we doing? Why are we still talking?\r\n\r\n\r\nChris Koerner (29:29.677)\r\nwasting our time.\r\n\r\n\r\nNikolas Hulewsky (29:34.286)\r\nI don't know who Maria is. Okay. Can I build off of this for a second? All right. So I think it's pretty, it's not easy, but you and I are talking and we're like, Oh dude, why wouldn't we do this? All we have to do, go to ChachiBoutini, enter this prompt, and then it automates here. And all of a sudden we've got a product. I still think for many people, the prompt is like the hardest thing for them to get past. like to think creatively enough in order to get the prompt to give you the output that you want.\r\n\r\n\r\nChris Koerner (29:36.569)\r\nanyways, please.\r\n\r\n\r\nChris Koerner (29:58.414)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (30:04.526)\r\nis incredibly hard and I found something this week that I want to share with you that it's going to be stupid simple and you're going to make fun of me but I think has one of the best pieces of advice I've ever gotten when it comes to prompting. Are you ready for it? All right, here we go. I don't think you're ready for this jelly if I'm being 100 % honest with you right now.\r\n\r\n\r\nChris Koerner (30:24.791)\r\nI'm right, no I am, I am though, I promise.\r\n\r\n\r\nNikolas Hulewsky (30:28.718)\r\nAll right, so you've probably seen this. This was a Reddit post. And this guy's talking about how he uses the LLM to generate prompts for him. So in the example that you just gave, where you're sitting there and you're like, OK, I want it. I want man is to create me a slide deck based on this information. But how do I even give it the specific information that I want in order for it to create the slide deck? He's essentially teaching you how to create the prompt by using the LLMs to create the prompt.\r\n\r\n\r\nSo the first thing that he does is he tells the LLM, generate a detailed prompt, engineering guide. The audience is, let's say graphic designers. So you can fill in the role there. And the role might look like book author, software developers, customer support, whatever. And then he pastes in five examples of how I want my prompt to work. So what he's doing there is he's giving it context to draw on. He's helping the LLM understand what exactly he's looking for by providing it with five examples of products that he really likes.\r\n\r\n\r\nChris Koerner (31:24.747)\r\nAmen. You gotta give it more context, no matter what you're using it.\r\n\r\n\r\nNikolas Hulewsky (31:27.342)\r\nYou've got to give it more context. All right. And now, let me make sure. This is probably the best advice I've ever read. This next one. I then instruct it to quote, generate a prompt that could have generated the examples outputs and include a better set of examples. Dude, that blew my mind when I read it. So he's sitting there and he's like, hey, this is who you are. You're a graphic designer.\r\n\r\n\r\nHere are five outputs that I really, really like. Now I want you to reverse engineer it and think of what the prompt would be that would create the outputs that you're currently seeing. So it's getting the LLM to think about, OK, what are all the different elements within the examples that are given to me that I need to get to in order for this prompt to generate something similar to what I'm seeing? What do you think of that?\r\n\r\n\r\nChris Koerner (32:07.673)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (32:20.067)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (32:23.737)\r\nThat's genius. want to hang up right now and test this.\r\n\r\n\r\nNikolas Hulewsky (32:25.496)\r\nHave you?\r\n\r\n\r\nHave you read this before? I feel like this is something that you... Okay. It blew my mind because it's like so simple and yet it's going to be so... I've already started using it and the outputs that I'm getting are way better than I've ever used, than I've ever gotten before. It's pretty incredible.\r\n\r\n\r\nChris Koerner (32:31.329)\r\nNo, I've never seen this.\r\n\r\n\r\nChris Koerner (32:46.329)\r\nHow long does it take though to put all this together?\r\n\r\n\r\nNikolas Hulewsky (32:50.902)\r\nWhich part? Like the five examples?\r\n\r\n\r\nChris Koerner (32:53.878)\r\nMm-hmm. Yeah.\r\n\r\n\r\nNikolas Hulewsky (32:56.044)\r\nNot well, I mean, obviously it depends on what you're trying to build, let's, I've been using it for content and like podcast ideation. So from that perspective, it's, it's been fairly easy cause I, I kind of know exactly what I'm looking for and I can go and find the outputs. If I was starting a business from scratch, like we were just talking about the slide deck generator, I would probably have to go and find just five slide decks that I think look really good. I don't know where I'll go and look.\r\n\r\n\r\nChris Koerner (33:26.169)\r\nSo then the key is to say, all right, look at these five slide decks, give me a prompt that would produce something that looks like these five. Interesting.\r\n\r\n\r\nNikolas Hulewsky (33:29.486)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (33:33.346)\r\nYeah. And again, back to what we were originally talking about, it may not even give you a good output, but it'll at least start you down the road of messing around with this. So you're going to see the next steps actually build on this. So then he goes to a new chat and he says, generate a detailed prompt evaluation guide. The audience is graphic designer. So.\r\n\r\n\r\nChris Koerner (33:42.605)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (33:50.137)\r\n.\r\n\r\n\r\nNikolas Hulewsky (34:01.858)\r\nWhat that's saying, what it's telling me that LLM is basically help me audit a prompt and give me a guide that I can use to audit that prompt. He then takes that what it's created and he pastes it into the original prompt. And then he tells it generate three improved alternative prompts based on this, based on the evaluation of the prompt. And then he picks the best one. So effectively what he's doing is he's like getting the LLMs to massage it to a point where he likes it and it makes sense.\r\n\r\n\r\nNow, there were some comments on this that I thought were hilarious. One guy who was, like, I honestly thought of that guy who you love on Instagram who's always making fun of the business gurus. And the quote was like, and then what I do is I write a prompt that asks it to evaluate the prompting that I wrote in order to evaluate the prompt that evaluates prompts. It was like, wait, what the freak? So it does get pretty meta here, but you're using the LLMs to leverage your time.\r\n\r\n\r\nChris Koerner (34:31.34)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (34:40.525)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (34:59.478)\r\nand get you to a place where you can actually create these prompts really quick.\r\n\r\n\r\nChris Koerner (35:04.281)\r\nI'm so excited to use this. This is perfect. Yeah. Like I've heard about asking the LLM what to ask it, right? Like, all right, here's what I want. Here's what I'm looking for. I want to make a delicious tomato salad. What should be the prompt I give you to give me the best output possible? That's like level one. This is like level seven of that.\r\n\r\n\r\nNikolas Hulewsky (35:06.03)\r\nI know, it's pretty cool,\r\n\r\n\r\nSo I.\r\n\r\n\r\nNikolas Hulewsky (35:25.932)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (35:31.084)\r\nThis is, there are two things that I can remember that have been like, that's genius and always have stuck with me when it comes to AI. One of them you gave me, which was remember this. So when you're working on a thread and it tells you something or it spits something out and you're like, hey, remember this, makes a mental note. The other one is this. It's like, okay, I would like this graphic design or I like this ad copy. What's a prompt that you would have written in order to get this output?\r\n\r\n\r\nChris Koerner (35:40.729)\r\nMm hmm. Yeah.\r\n\r\n\r\nChris Koerner (35:58.934)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (35:59.456)\r\nLike that to me is genius because you are reverse engineering. And that's effectively what we're trying to do anyways when we see stuff that we're trying to copy.\r\n\r\n\r\nChris Koerner (36:06.915)\r\nthat's gold. It's gold, Jerry.\r\n\r\n\r\nNikolas Hulewsky (36:07.694)\r\nI don't know.\r\n\r\n\r\nI dunno.\r\n\r\n\r\nChris Koerner (36:12.761)\r\nAll right, you ready?\r\n\r\n\r\nNikolas Hulewsky (36:16.359)\r\nIs the pope Catholic?\r\n\r\n\r\nChris Koerner (36:17.955)\r\nCough\r\n\r\n\r\ncheck lately, he?\r\n\r\n\r\nNikolas Hulewsky (36:22.51)\r\nI'm selling some air.\r\n\r\n\r\nChris Koerner (36:25.177)\r\nAll right, what do you know about perplexity labs?\r\n\r\n\r\nNikolas Hulewsky (36:31.49)\r\nI mean, I know a lot, but assume I know nothing. Yeah, yeah, yeah, yeah, yeah. Because I know a lot, but I know our audience doesn't.\r\n\r\n\r\nChris Koerner (36:35.513)\r\nCool. Well, yep. Yep. So I didn't know much about it until earlier. I've been playing with it quite a bit. You do have to have the $20 a month perplexity plan, but at first I was like, this is just deep research. Like perplexity already had deep research. It was fine. This is just more deep research. No, no, no. So here's how perplexity is different from deep research. So let's say I want to know\r\n\r\n\r\nthe like the market landscape of all the keto apps out there. Okay. I want to build a keto app and I want to know how profitable are the ones that already exist. what's their cost per acquisition? If they're using Facebook ads, how many downloads do the top five keto apps get? I want to know all this stuff. I'm going to go to perplex or to deep research either on perplexity or on chat, GPT, and give it that prompt. And it's about 10 minutes later, it's going to give me thousands of words, with like a really thorough output. Okay.\r\n\r\n\r\nHere's what perplexity labs does. I just prompted this and my prompt was build an interactive chart showing the correlation between sourdough baking and RV traveling in a post COVID world. I don't know why I just, that's all I can think of. So it gives you like multimedia. gives you the information you're looking for in different ways. It will use charts. It will use PDFs that you can download where appropriate.\r\n\r\n\r\nNikolas Hulewsky (37:51.406)\r\nIt's so good.\r\n\r\n\r\nNikolas Hulewsky (38:02.828)\r\nWow.\r\n\r\n\r\nChris Koerner (38:04.811)\r\nIt's kind of the difference between having an intern go do a little research for you and sending you a memo and then having a six figure employee that's like a researcher going out and spending weeks aggregating all this data, knowing when to use a chart, when to use text, when to use pictures, when to use a PDF. That's kind of the difference between perplexity labs and deep research.\r\n\r\n\r\nNikolas Hulewsky (38:24.386)\r\nYeah, so what we're looking at, if you can't see this right now, is there's an interactive chart. What's on the X and Y axis?\r\n\r\n\r\nChris Koerner (38:31.737)\r\nsourdough market size in millions and then I can't see it I think I gotta zoom out\r\n\r\n\r\nNikolas Hulewsky (38:40.366)\r\nI'm assuming like RV hours used or something like that.\r\n\r\n\r\nChris Koerner (38:42.2)\r\nYeah.\r\n\r\n\r\nChris Koerner (38:46.131)\r\nLet me zoom out. there it is. Time period. Yeah. then market size and RV shipments in thousands. So RV shipments in thousands is over here.\r\n\r\n\r\nNikolas Hulewsky (38:47.064)\r\nThat's interesting.\r\n\r\n\r\nNikolas Hulewsky (38:54.466)\r\nso I'm assuming that the red is RV shipments. So that's seasonal, basically. Interesting. And so you asked if they were correlated. Does it say it's correlated?\r\n\r\n\r\nChris Koerner (38:57.261)\r\nYes.\r\n\r\n\r\nhuh. Yep. Goes up in the summer.\r\n\r\n\r\nChris Koerner (39:06.976)\r\nYep, it's negative point zero four weak negative correlation suggests inverse relationship during certain periods\r\n\r\n\r\nNikolas Hulewsky (39:15.69)\r\nInteresting, All right, so it gives you the chart so you can visualize it, but then it actually gives you a write-up.\r\n\r\n\r\nChris Koerner (39:22.829)\r\nYeah, like just as and here's a non interactive chart showing the same thing. And then.\r\n\r\n\r\nNikolas Hulewsky (39:24.29)\r\nHoly crap.\r\n\r\n\r\nNikolas Hulewsky (39:29.524)\r\nBut these are proprietary charts. These are not like, I went and scraped the web and found some Yahoo who made this and posted it.\r\n\r\n\r\nChris Koerner (39:34.893)\r\nit made these. Yeah. I think it just took raw data from the web and made these itself. And look, here's a PDF or a CSV I can download. So sometimes it gives you a CSV, PDF, whatever you want, the sources on everything. So how do we use this? How do we make money on this?\r\n\r\n\r\nNikolas Hulewsky (39:39.713)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (39:50.85)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (39:56.226)\r\nI make money on this. I gotta figure out how to make money on this.\r\n\r\n\r\nI mean, to me, it just goes back to this allows you to leverage your time even more as companies get bigger and they have more resources. They can throw more resources at smaller problems. So this would be an example of a smaller problems. Like in the past, I'm growing a company. I need to do all of this research, but you, Chris Kerner, as you're doing on the market research, you're kind of like internalizing all of this stuff, right? You're looking at different websites. You're reading different blog posts, whatever you're reading different charts.\r\n\r\n\r\nChris Koerner (40:08.515)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (40:32.141)\r\nThis gets you all the information that you would have otherwise gone out and just surf the web for quickly and in a format that you can digest. to me, it would be a business built around servicing decision makers, people who have high leverage positions that are making decisions all day. And that's kind of where you get to as you grow your businesses.\r\n\r\n\r\nChris Koerner (40:58.457)\r\nDude, like look at this prompt result asking about the keto app market. It's all right here. All the iOS ratings, the annual price, how many weekly downloads, weekly revenue, active users, like, and it has 37 different sources for this data.\r\n\r\n\r\nLike this is crazy. This would be like if, if I got in this ideation frenzy late at night, as I often do and wanted to, I really wanted to launch this keto app. I would stay up all night, like just doing this research that it did for me in 11 minutes.\r\n\r\n\r\nNikolas Hulewsky (41:21.826)\r\nHaha.\r\n\r\n\r\nNikolas Hulewsky (41:29.806)\r\nYou know what this, okay, here's a lead magnet. think it would be really cool. Um, digital agencies that are either doing, they could be doing anything. They could be doing automation. They could be doing AI implementation within a company. Um, they could be digital marketing, graphic design, anything. If they use this and they generated a report for every company that's on their list, cause every, every one of these businesses has like an ideal customer. And let's just say your ideal customer is importers of.\r\n\r\n\r\nPastel Fabrics, I don't even know. You generate that report one time and you email it to them as a lead magnet to get your foot in the door. So then it spurs the next conversation. Because you're giving them something of real value where it's like, hey, next year, these are the projected, I guess, don't even know, tastes that are going to be in the pastel market. I know you make these decisions every single year around this time. Hopefully this helps you. The Automation Guys at AutomationLabs.com, whatever it is.\r\n\r\n\r\nChris Koerner (42:00.846)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (42:20.291)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (42:28.973)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (42:29.774)\r\nThey're gonna read that, they're gonna see that. You can track whether not they open it and then you can easily follow up with them next day, next week, whenever, but it's a really cool lead magnet. That's really valuable. We talked about this before, IBIS World War I worked. They're charging $2,000 reports. That's a $2,000 report potentially right there that you can just use as a lead magnet now. As a lead magnet, think about that.\r\n\r\n\r\nChris Koerner (42:43.769)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (42:53.219)\r\nYeah, I know. Like if you're a consultant, like how big of retainers could you get with by leading with something like this, you know?\r\n\r\n\r\nNikolas Hulewsky (43:03.586)\r\nI think any business, dude, any business that wants a customer, name a business. That's B2B, that's B2B.\r\n\r\n\r\nChris Koerner (43:09.801)\r\nHVAC. HVAC supply.\r\n\r\n\r\nNikolas Hulewsky (43:13.966)\r\nCool, HVAC Supply. I'm an HVAC Supply company and I'm looking for HVAC business owners. Why don't you just send an industry report for their specific market to every single HVAC owner? Hey, yeah. Yeah, here's where the growth trends are of your market overall. Here's the age of properties in your market. Here's the, I don't know, typical home value. Here's the supply, whatever. It gives like the whole entire thing. Thought you might like this.\r\n\r\n\r\nChris Koerner (43:23.001)\r\nMm hmm. Mm hmm. Yeah, it pulls in real estate data. It pulls it. Yeah.\r\n\r\n\r\nNikolas Hulewsky (43:42.638)\r\nfor your market. Hope you enjoy. Let me know if you have any questions. You're giving value to them right away. And who are they going to call the next time? Well, mean, not necessarily everybody's going to call, but just in terms of a lead magnet and building trust with people, that would be phenomenal in B2B sales, any B2B sale.\r\n\r\n\r\nThat's a freaking cool idea.\r\n\r\n\r\nChris Koerner (44:02.777)\r\nThat's a freaking great idea.\r\n\r\n\r\nNikolas Hulewsky (44:06.23)\r\nI don't care who you are, that's freaking smart.\r\n\r\n\r\nChris Koerner (44:09.465)\r\nShould we end this segment?\r\n\r\n\r\nthis episode.\r\n\r\n\r\nNikolas Hulewsky (44:14.179)\r\nYeah.\r\n\r\n\r\nChris Koerner (44:16.339)\r\nAll right, what do you got?\r\n\r\n\r\nNikolas Hulewsky (44:19.95)\r\nDo you me to start? he's stretching?\r\n\r\n\r\nChris Koerner (44:21.881)\r\nNo.\r\n\r\n\r\nNikolas Hulewsky (44:28.961)\r\nsuck\r\n\r\n\r\nChris Koerner (44:31.367)\r\nI could go or you can go.\r\n\r\n\r\nNikolas Hulewsky (44:33.201)\r\nOkay, just give me a second, just give me a second, let me look around.\r\n\r\n\r\nNikolas Hulewsky (44:38.126)\r\nHold up.\r\n\r\n\r\nChris Koerner (44:38.307)\r\nI'm going in a non-AI direction.\r\n\r\n\r\nNikolas Hulewsky (44:47.043)\r\nme a second.\r\n\r\n\r\nChris Koerner (44:50.937)\r\nbut I also have another AI idea.\r\n\r\n\r\nChris Koerner (44:58.905)\r\nNikolas Hulewsky (45:37.166)\r\nThat was my last one.\r\n\r\n\r\nNikolas Hulewsky (45:44.771)\r\nyeah. this is it.\r\n\r\n\r\nthis.\r\n\r\n\r\nNikolas Hulewsky (45:56.11)\r\nThis is it. Okay.\r\n\r\n\r\nNikolas Hulewsky (46:00.952)\r\nChris, we've kind of talked about this idea before, but I'm kind of falling more in love with it, especially with AI. I think you could build an easy wrapper around it. And you, my friend, you in particular, I'm not talking about anybody else, nobody listening, screw the listener, you. I'm not kidding. You could make a hundred grand a month off of this easily. Are you ready for it?\r\n\r\n\r\nChris Koerner (46:14.787)\r\nHere's the thumbnail.\r\n\r\n\r\nChris Koerner (46:25.175)\r\nYes,\r\n\r\n\r\nNikolas Hulewsky (46:26.062)\r\nAll right. People struggle with staying consistent. True or false?\r\n\r\n\r\nChris Koerner (46:32.121)\r\n100%.\r\n\r\n\r\nNikolas Hulewsky (46:33.122)\r\nWhat's the biggest problem with staying consistent?\r\n\r\n\r\nChris Koerner (46:36.355)\r\nheart entropy, we're fallible.\r\n\r\n\r\nNikolas Hulewsky (46:37.484)\r\nIt is hard. In my experience, in my experience, it's accountability. Like there's no accountability loop that they've set up for themselves. If you say, I'm going to go to the gym tomorrow and you wake up at 6 a.m., how easy is it to hit snooze versus if I say, I'm going to the gym tomorrow and I'm picking you up at 6 a.m., which one of those, it's night and day, right? Because there's actually somebody who's going to be there. They're going to hold you accountable and they're going to follow up with you. I think there's a huge opportunity utilizing AI.\r\n\r\n\r\nChris Koerner (46:57.367)\r\nIt's nine day. It's nine day. Yeah.\r\n\r\n\r\nNikolas Hulewsky (47:07.854)\r\nto have an accountability partner app. But it's not just an accountability partner app that pushes notifications like, hey, did you check in today? Hey, did you do X, Y, and Z today? It's an app that actually gets to know you and has conversations with you. So you told me this a long time ago. I didn't even know this was a thing. You can, it's green bubbles, you can set up notifications to come to you through an API.\r\n\r\n\r\nChris Koerner (47:16.611)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (47:35.126)\r\nin a text. So you can actually text with ChatDBT if you wanted to. You don't have to go to their interface. You could just go to their phone number and text them, and then there's an API call that you have to pay for. So I would set it up that way. I would set it up so that the interface is texting. It's not necessarily an app. It's like, this is a friend of mine who's asking me. But in order to get started, you've got to do this comprehensive checklist. We've talked about quizzes before. I freaking love quizzes. So it's comprehensive checklist. Who you are, what motivates you, what do you struggle with, how do you like to be talked to? Please upload seven emails.\r\n\r\n\r\nChris Koerner (47:38.915)\r\nMm-hmm.\r\n\r\n\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (48:04.814)\r\nIt's like, it just gets to know you, your humor, whatever. And then it creates a custom chat bot that even if it's just uploaded to a single prompt that can interface with you and at least give you some tailored encouragement and guidance. So let me hit some stats to show you what kind of market opportunity this is. The wellness and productivity app market. Does that sound niche to you?\r\n\r\n\r\nChris Koerner (48:06.168)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (48:29.697)\r\nIt does, but I know productivity is big business.\r\n\r\n\r\nNikolas Hulewsky (48:32.194)\r\nI know, I know, but it's like, if I told you, yeah, I've got a business that we built a wellness and productivity app, you'd be like, I'm sorry, I fell asleep halfway through that sentence. What is it? It's an $8 billion market. With a B.\r\n\r\n\r\nChris Koerner (48:40.717)\r\nYeah. Yeah.\r\n\r\n\r\nChris Koerner (48:45.913)\r\ncould just get 1%.\r\n\r\n\r\nNikolas Hulewsky (48:48.27)\r\nBro, I'm just telling you, bro, if we could get 1%, a 1%, that's $8 million, bro. Okay. So that's number one. Number two, what do people love about the self-help market, about the productivity market? They love coaches. They wanna have a friend, a familiar face. So you don't just want a normal AI, do you? You wanna a friendly AI. You wanna TKO AI. You wanna a current office who's gonna be, who's,\r\n\r\n\r\nChris Koerner (49:15.225)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (49:16.95)\r\nYou want to turn her office is going to be like, Hey, did you get your cookie in the cookie jar? Okay. Did you get bit by that gay guy? We'll see. We'll see. You know what saying? But it's going to be somebody that they know that they're familiar with that is like showing up to hold them accountable. There's this AI coach on this product called replica. Apparently there's over 10 million active users right now. And it honestly kind of looks janky. Sorry, replica. If you're listening.\r\n\r\n\r\nbut I think that you could pretty easily, even if you weren't starting a new company, just build a wrapper for yourself of reminders, check-ins with a familiar chat bot that knows you well, that would get, that would hold you more accountable and have you achieve your goals much easier. And I think somebody like you or somebody who has a large audience could brand it as the Chris Kerner accountability partner. And boom, you've got a really easy app that holds people accountable. Cause really the main thrust of the app.\r\n\r\n\r\nis accountability, it's not Chris Kerner's personality, it just so happens that it has part of Chris Kerner's personality. What do think?\r\n\r\n\r\nChris Koerner (50:24.185)\r\nI love it. It's yeah, it's a no brainer. I've talked about a similar idea on this pod before a couple months ago. The only worry that I have for it is like, are there any stakes to that? Right? Like if you're showing up to my house to take me to the gym, there are real stakes there. I don't want to let you down, right? But are there really stakes to an AI app like bugging you? is it just as easy to ignore?\r\n\r\n\r\nNikolas Hulewsky (50:36.558)\r\nbut it was.\r\n\r\n\r\nChris Koerner (50:53.761)\r\nas it is easy to ignore an alarm clock going off.\r\n\r\n\r\nNikolas Hulewsky (50:58.118)\r\nso if I were to look at it and say the percentage of people who stick with their routine from an in-person conversation versus this, I think the in-person interaction is going to be higher. I just think that's the way that we are period. But I think that this would be higher than no interaction at all. So if you had no interaction versus this AI interaction, I think this AI interaction is going to be better. So I do think the outcomes will be better.\r\n\r\n\r\nChris Koerner (51:13.038)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (51:27.96)\r\nBut beyond that, why I think branding it with like a personality and the delivery mechanism being a text and not an app, it just feels more personal. If I get a text, even if it's like, your school is letting you know that you're something got out early today. Like it pisses me off because I'm why do they have my phone number? Whereas if that was in an app that I had to go to and actually look at, I'm not going to be pissed off. Right. So I do. I just think a text is more personalized and then having your personality around it would allow for better accountability.\r\n\r\n\r\nChris Koerner (51:35.801)\r\nYeah, it's true.\r\n\r\n\r\nChris Koerner (51:58.307)\r\nTrue. You could even work in like some AI calling to have a conversation where it's like, you missed your call today. And there's like some real stakes attached to it. Like maybe you have to, maybe you charge their card every time they miss a call, you know, it just, they have to pay for it somehow. Maybe, maybe it's a free app, but they only pay for it when they don't do what they're supposed to do. And so it's like, it's a hundred percent free lifetime for everyone that does what they're supposed to do.\r\n\r\n\r\nNikolas Hulewsky (52:02.734)\r\nthat would be super interesting.\r\n\r\n\r\nNikolas Hulewsky (52:09.036)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (52:28.44)\r\nOkay, this is a tangent, it's related, but totally different. Why aren't personal trainers and coaches using AI more in their business? It seems like that would be the perfect, okay, here's the app, log all of your information, log everything that you're doing. And then for the coach, they don't have to spend the time necessarily reading all of that log. They just ask AI to tell them what they need to follow up with on their client. And they're saving like an hour or more a week per client, giving them better solutions, more tailored solutions.\r\n\r\n\r\nChris Koerner (52:51.544)\r\nMm-hmm.\r\n\r\n\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (52:57.698)\r\nfeels like there is an opportunity even there to use AI.\r\n\r\n\r\nChris Koerner (53:02.551)\r\nIt could, you could just use an, wrapper, like build a simple wrapper that is chat GPT, but for personal trainers that they pay for every month to make their, their lives easier.\r\n\r\n\r\nNikolas Hulewsky (53:13.358)\r\nTotally, that would be it.\r\n\r\n\r\nChris Koerner (53:14.125)\r\nLike the offer could be like save an hour per week per client with this $10 a month app.\r\n\r\n\r\nNikolas Hulewsky (53:21.452)\r\nWell, and this was a continuation of the other idea, but you could build this internally. You could have an internal accountability mechanism for your company, right? Where it's like, okay, cool. And then the chat bot notifies everybody 24 hours after a meeting happened, or it's set to notify you, Chris, of a deadline that you agreed to on a previous call, 48 hours, 24 hours a week. you could have, hey, notify Chris that this is due a week in advance.\r\n\r\n\r\nChris Koerner (53:30.638)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (53:36.312)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (53:50.648)\r\ntwo days in advance and 24 hours in advance. You know what I mean? So it's not this like race at the last minute to kind of put something together.\r\n\r\n\r\nNikolas Hulewsky (54:02.976)\r\nOkay. He loves it. He's speechless. All right, what do you got?\r\n\r\n\r\nChris Koerner (54:06.553)\r\nAll right, I'm take a left turn here, you ready?\r\n\r\n\r\nNikolas Hulewsky (54:09.422)\r\nRoca?\r\n\r\n\r\nChris Koerner (54:15.873)\r\nShare my screen. Date. That's that.\r\n\r\n\r\nChris Koerner (54:26.893)\r\nme just get this set up.\r\n\r\n\r\nChris Koerner (54:32.345)\r\nAlright, there we go.\r\n\r\n\r\nChris Koerner (54:44.643)\r\nAll right, you see my screen?\r\n\r\n\r\nNikolas Hulewsky (54:47.021)\r\nYes, sir.\r\n\r\n\r\nChris Koerner (54:48.419)\r\nDo you see my tweet about building a pickleball club, secret pickleball club? Okay. So I've been using Facebook ads to generate leads and or pre-orders for this pickleball club. And I've talked about this a little bit on the pod, so I won't go into deep detail, but the whole business model is this 99 bucks a month, reserve a court, play doubles or singles with two, you one or three other people.\r\n\r\n\r\nNikolas Hulewsky (54:52.686)\r\nI did. I did.\r\n\r\n\r\nChris Koerner (55:16.153)\r\nYou guarantee for 99 bucks a month, you're guaranteed the ability to play X times per month, and then you can pay extra to play more times per month. But I have no idea yet if people want to play 30 times a month, three times a month, will they even pay 100? A lot of the people in the comments on Twitter were like, no one wants to go to a pickleball club. If they can't be seen by other people playing pickleball. I'm like, dude, nobody wants to be seen playing pickleball. Where have you been? Like, are you kidding me? This isn't a gym.\r\n\r\n\r\nNikolas Hulewsky (55:40.984)\r\nHahaha\r\n\r\n\r\nChris Koerner (55:45.911)\r\nYou know, it's not a flex. It's never been a flex. In fact, it might be quite the feature for no one to see you playing pickleball, especially if you're a beginner.\r\n\r\n\r\nNikolas Hulewsky (55:49.153)\r\nYou\r\n\r\n\r\nNikolas Hulewsky (55:55.64)\r\nLike, dude, we've all been there. Your wife walks in on you late at night, 11 o'clock at night, practicing your pickleball grip. And she's like, she comes, what are you doing? And you quickly put the handle down. You quickly put the paddle on you, like having an affair. Because you don't want her to think that you're playing pickleball. I get it.\r\n\r\n\r\nChris Koerner (56:05.497)\r\nI any of us have been there, Nick.\r\n\r\n\r\nChris Koerner (56:11.259)\r\nmy gosh.\r\n\r\n\r\nChris Koerner (56:15.129)\r\nthat was my favorite comment. This doesn't work because most of these pickleball clubs have 15 courts and they want to be seen by other people playing pickleball. I'm like, okay. But maybe he's right, right? I wanted to know before I go get my septic system fixed and expand my building. I wanted to know. So I'm going to share my screen and I'm going to show exactly what I did to generate these leads. Okay. All right. Can you see my screen right now?\r\n\r\n\r\nNikolas Hulewsky (56:21.454)\r\nWhat the freak are they talking about?\r\n\r\n\r\nNikolas Hulewsky (56:27.214)\r\nSure, sure.\r\n\r\n\r\nNikolas Hulewsky (56:37.336)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (56:41.208)\r\ncan. Yes.\r\n\r\n\r\nChris Koerner (56:43.193)\r\nAll right, so I would like Mohammed to blur out the exact cities, because I don't want people to know where I live. But I'm in Meta Ads Manager right now. And if you can just see the radius, this is the location of the shop plus six miles. And I chose six because I didn't want to go all the way over here or up here. It's hard to describe. But I just kind of know where everyone lives in this area. Six miles was perfect.\r\n\r\n\r\nNikolas Hulewsky (56:45.048)\r\nWhat are we looking at? Set it up. What website are you on?\r\n\r\n\r\nChris Koerner (57:12.153)\r\nAnd so Facebook says, okay, oh, there's 174,000 to 205,000 people within that radius. And honestly, I had already done this math myself and I got 220,000. So it's like extremely close, okay? And then, thank you very much. Yes, you have. And then I said,\r\n\r\n\r\nNikolas Hulewsky (57:26.594)\r\nYou're an amazing estimator. I've always said that.\r\n\r\n\r\nChris Koerner (57:33.047)\r\nYou know what? Use your AI to show it to the people in that radius that you think want to see it. So I didn't say show it to people that follow me, show it to people that interact with my stuff, show it to pickleball players, show it to boomers. I didn't say any of that show to whoever you want, as long as they live here, because they do have to live there. Okay.\r\n\r\n\r\nNikolas Hulewsky (57:40.59)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (57:47.854)\r\nOkay. Does that cost more or less than you just telling it exactly what you want it to show? Or is it the same?\r\n\r\n\r\nChris Koerner (57:53.259)\r\nIt's mean, it's mean edge. Sorry, that was Hungarian. Sorry. Sorry. It makes no difference. If there is a difference, I don't know what it is. So then I tried multiple types of ads. I did the same video, but I tried Instant Form where you get their name, email and phone all within the Facebook ecosystem. And then I just did a link to a type form. And then I did Instant Form.\r\n\r\n\r\nNikolas Hulewsky (57:55.926)\r\nOkay. I'm sorry for our audience who didn't know what that meant. Okay.\r\n\r\n\r\nChris Koerner (58:21.857)\r\nthat forwarded to the type form afterwards. And the third one, one is like the best bang for your buck is I captured their name and their email before I get anything else. And then I auto direct them to, I'm gonna share. Yep, I'm gonna share this type form. Go ahead.\r\n\r\n\r\nNikolas Hulewsky (58:35.374)\r\nReally? So wait, can you, what was the?\r\n\r\n\r\nWas there ad copy? what was the ad that you were showing them?\r\n\r\n\r\nChris Koerner (58:44.383)\r\nI'll show you that in a minute, but Mohammed, you could edit out this personal info here, I'll go back to the ad copy and show you that. It's not, it's.\r\n\r\n\r\nNikolas Hulewsky (58:55.308)\r\nAnd even before the ad copy, why did you decide to go to Facebook? Like why not go to Perplexity and do some research? Like how is this better than going to say a deep research LLM?\r\n\r\n\r\nChris Koerner (59:07.725)\r\nI mean, that's just all hypothetical, right? Like I want to real people in this area to tell me would they pay for this and how most importantly, how often do they want to play? What time of day do they want to play? Do they do play in doubles or singles? Cause those are all very relevant. If everyone plays singles, then I can only have half as many members. If they all play doubles, I can have twice as many members. If they all want to play 30 times a month, then I can only have 50 members. If they all want to play 10 times a month, I can have 200 members, you know, but\r\n\r\n\r\nNikolas Hulewsky (59:22.86)\r\nYeah.\r\n\r\n\r\nChris Koerner (59:37.077)\r\nRight now, all of this is just hypothetical and chat GPT got me there, right? So to your point, it got me to here, but I don't know if real people actually desire those things yet.\r\n\r\n\r\nNikolas Hulewsky (59:39.266)\r\nYes, so that. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (59:46.978)\r\nSo like going into deep research or for Plexity, that's static data that anybody can go access. This is dynamic data. This is like real time, whether or not people want to use it, how much they'll pay, et cetera.\r\n\r\n\r\nChris Koerner (59:53.4)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (59:57.241)\r\nYeah. And so this is what my ad looks like. It's a 17 second video and you won't be able to hear it. Can you hear that or no?\r\n\r\n\r\nNikolas Hulewsky (01:00:03.182)\r\nDon't I? Yeah.\r\n\r\n\r\nChris Koerner (01:00:05.655)\r\nYou can hear it? Okay, then I'm gonna start over. All right, so here's what the ad is. And this is one of three variations that are all pretty similar.\r\n\r\n\r\nChris Koerner (01:00:30.819)\r\nSo I added that myself, obviously, because I didn't wanna wait for my editors to do it. And so it's like, I could have put like an overlay of what it looks like that's AIGEN, I could have done so much more. But even with all that, say what?\r\n\r\n\r\nNikolas Hulewsky (01:00:31.746)\r\nParker!\r\n\r\n\r\nNikolas Hulewsky (01:00:35.875)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (01:00:41.664)\r\nFirst of all, dude, amazing ad. Like just the way you painted it, scarcity. It's secret, so it feels exclusive. Like you're whispering. Like even though I could just turn my headphones, AirPods up, it's like I'm leaning in like, whoa, wait, what's going on? It's just, gosh, it was so good.\r\n\r\n\r\nChris Koerner (01:00:45.977)\r\nThank you.\r\n\r\n\r\nChris Koerner (01:00:59.897)\r\nMm-hmm.\r\n\r\n\r\nThank you. Thank you. And I named the cities, right? So they know this is, cause those are small cities that I named. They know this is personal to me, right? Here are my results so far. 74 leads, $2.64 per lead. Okay. But it gets even a hundred. I spent 200 bucks to get 74 leads, but it gets better. And Muhammad, I'm going to hide these columns here so they can't see the names of phone numbers.\r\n\r\n\r\nNikolas Hulewsky (01:01:12.792)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (01:01:20.238)\r\nOkay, so you've spent 150 bucks, 200 bucks.\r\n\r\n\r\nChris Koerner (01:01:32.865)\r\nSo I've got, is what you're seeing here. You see how there are these line breaks with no data. So these line breaks with no data are people that filled out the Facebook instant form and I got their name and phone, but then they didn't go to the type form. And so the people that did give me all this info, they're usually on the row right next to the person that I got their instant form data and their type form data. And it's a 19 question type form. Like I'll share my type form screen again.\r\n\r\n\r\nNikolas Hulewsky (01:01:39.47)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:01:48.174)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (01:01:59.244)\r\nWow. Yeah, what were some of the questions?\r\n\r\n\r\nChris Koerner (01:02:02.209)\r\nSo this is the intro, AI, one prompt, AI generated ugly logo. This is the concept. Here's what it looks like, 99 bucks a month. Boom. How can we reach you? Name and phone. What's your t-shirt size? So I put that in the beginning so they can see like, I'm gonna get something free. Yeah, I wanna keep going on this forum. Cause I get something free, you know? What is your pickable skill level? Now these are actually, this is like how pickable players are rated. And I didn't know that till I asked you about it. So I just pasted those in.\r\n\r\n\r\nNikolas Hulewsky (01:02:28.674)\r\nWow.\r\n\r\n\r\nChris Koerner (01:02:30.745)\r\nHow many times do you currently play per month? How many times do you plan to play per month? Because I'm assuming they're gonna wanna play more than they do now, if it's convenient nearby. How long do you play for? What time of the day will you prefer to play? That's very important. You play doubles or singles. Would you pay $99 a month for everything described? Yes, no other. How many friends do you have that may be interested in joining? Because if play doubles, that could be three other people, right? Would you be interested in an ambassador program where we would reward you for bringing friends on as members?\r\n\r\n\r\nNikolas Hulewsky (01:02:53.378)\r\nGood one. Yep.\r\n\r\n\r\nChris Koerner (01:03:00.205)\r\nwhich I'm not gonna do because the demand has been so good. There'd be no, no reason. I have a fixed supply, right? So I'm not gonna give out discounts. And then is there anything we should change about pricing? And I got some really good data here. Like, man, this other club charges 15 bucks per or maybe I'll want to bring a guest, but he's not a member. Can he just pay 10 bucks? Like really, really good data. What else would you like this pickleball club to have? People were like, I'd like a room to practice my dinks or there's this\r\n\r\n\r\nNikolas Hulewsky (01:03:04.086)\r\nYeah, well, what's the point?\r\n\r\n\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:03:27.961)\r\n$2,000 machine that will serve to me. I'd like to practice by myself. Like I didn't know any of these things. And then I put on a scale of one to 10, if this club has all the features I describe, how likely are you to become a founding member at $99 a month? 10 equals take my money and one equals get lost. And then any other questions. So then if you go look at the results, so it's very interesting. Go ahead, go ahead.\r\n\r\n\r\nNikolas Hulewsky (01:03:49.71)\r\nSo, were the 75 leads people who, 75 people who filled out the 19 question type form, or was it even those people who gave their name and number but didn't fill out the type form? Does that make sense what I'm asking?\r\n\r\n\r\nChris Koerner (01:04:03.705)\r\nYeah, so 74 people filled out the instant form and I got their name and number and then 45 or 42 people filled out the type form. So over half did both.\r\n\r\n\r\nNikolas Hulewsky (01:04:08.418)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (01:04:17.142)\r\nOkay, before I color it with my opinion, if I'm listening to this and I hear you say, I did this quiz, I got all this information and 55 people answered me or filled out 19 questions, I might think that that's not a lot of people. How do you feel about the response to this survey?\r\n\r\n\r\nChris Koerner (01:04:31.758)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:04:37.785)\r\nDude, think of it this way. Let's say that the average member brings one other member. And by nature of this, it's not like a gym. You don't need to bring a friend to a gym. Most people don't, right? With this, you can't play by yourself. So let's just say conservatively, every person brings another person. So that's $200 a month from one person, right? Because they have to all be members if they're playing doubles or singles. Let's say they stay for a year. Maybe it's two months, maybe it's 10 years. I don't know. Let's say a year.\r\n\r\n\r\nNikolas Hulewsky (01:04:47.522)\r\nnow.\r\n\r\n\r\nNikolas Hulewsky (01:04:51.608)\r\nYeah.\r\n\r\n\r\nChris Koerner (01:05:08.073)\r\n$2,400 LTV lifetime value of each person. I just spent, now let's go to this column P one 10 scale. How likely are you to join 10, nine, eight, eight, seven, seven, seven, Like these are high intent people. And then over here, would you pay? Yes, yes, yes, yes, yes, yes, yes. Like I'm asking them multiple times. Number of friends did you bring one to two, four to six, seven plus four to six, four to six. Like they could be bringing four on average.\r\n\r\n\r\nNikolas Hulewsky (01:05:21.806)\r\nJeez, yeah, these are high intent.\r\n\r\n\r\nChris Koerner (01:05:36.665)\r\nSo it's like $2,400 lifetime value and I've spent $200 in ads to potentially sell out the whole club, right?\r\n\r\n\r\nNikolas Hulewsky (01:05:46.456)\r\nDude, I'm so glad you answered it that way. Cause what you like anybody listening, you hit the nail on the head. It's not necessarily the total number people that responded. It's the number of quality people that responded to have 50 plus people who filled out 19 questions and probably the average rating of how interested they are. Let's just say is an eight or seven and a half. That's, that's the whole club. Like you, you just launched a business. Yeah. You're full off of half of those people potentially. Right? Like it's.\r\n\r\n\r\nChris Koerner (01:05:56.845)\r\nThe intent. Yeah.\r\n\r\n\r\nChris Koerner (01:06:03.129)\r\nand insane.\r\n\r\n\r\nChris Koerner (01:06:11.065)\r\nThat's it. I'm full.\r\n\r\n\r\nChris Koerner (01:06:16.109)\r\nLike, yeah.\r\n\r\n\r\nNikolas Hulewsky (01:06:16.886)\r\nIt's such good data for you because it was such a small geographic market. was such a niche number of people demographic. response kind of blows my mind to be honest.\r\n\r\n\r\nChris Koerner (01:06:29.337)\r\nIt's crazy. like this, my costs on this would be insurance, a cleaner, some tech, wifi, utilities. There's probably 30 to $40,000 upfront, but if I'm sold out, that's 20 grand a month top line, maybe 16 grand a month bottom line. Like what are we talking for? For $200 in ads?\r\n\r\n\r\nNikolas Hulewsky (01:06:48.962)\r\nHold on, hold on. Yeah, let me just make a call. Hey Warren, yeah Warren, is that a good investment or a bad investment? Okay, it's good, okay. Yeah, Warren Buffet says that's a good investment. It's incredible.\r\n\r\n\r\nChris Koerner (01:07:01.687)\r\nYeah, so like, it's just, it's incredible. And anyone could do this. Like anyone that lives in an area where people have a metal building in their backyard that's not being utilized, you could go rent it from them. Like rent it. This isn't commercial. I don't need commercial. I want to paint lines on your floor and post Facebook ads.\r\n\r\n\r\nNikolas Hulewsky (01:07:18.798)\r\nWell, dude, can I pivot just a little bit, but kind of stay on or you have more? OK, so my wife's been playing a ton of tennis for the last year, which is actually pretty cool. OK, but she joined the USTA, which is the US Tennis Association. She's playing, she's rated nationally, which is like a self-reported rating system. I'm assuming it's very similar to what pickleball is. But here in Boise, they have these teams and you.\r\n\r\n\r\nChris Koerner (01:07:22.809)\r\nPlease.\r\n\r\n\r\nChris Koerner (01:07:27.619)\r\nDude, I got more for you about this, okay?\r\n\r\n\r\nNikolas Hulewsky (01:07:47.086)\r\nYou pay to join the teams. There's somebody who organizes it. They play once a week. And then at the end of these seasons, they then have tournaments. And so they'll play locally. The winner of that goes to sec divisions, sectionals. I don't know. Um, and then the winners of that go to regionals. And then the winners of that go to nationals because it's the USDA. It's all around the country. Um, and so we went to Pocatello this weekend because she, they won in Boise. They went to Pocatello. My wife's out there with a fricking stress fracture.\r\n\r\n\r\nChris Koerner (01:07:55.715)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:08:07.853)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:08:15.062)\r\nShe won all three of her matches because she's a freaking beast. She got the dog in her. But not this dog. Yeah, sorry. I'm sorry. I sorry. did that out. Banana. But they won. And so now they're going to go to regionals. And if they win that, they'll go to nationals. I don't I'm sure that there's something like this within pickleball. We talked about my brother-in-law who wants to launch this company. It's called Porter Quartz.\r\n\r\n\r\nChris Koerner (01:08:21.849)\r\nI'm sure she'd love being described as that way. OK. Edit that out.\r\n\r\n\r\nNikolas Hulewsky (01:08:43.022)\r\nand their whole idea is portable pickleball courts so you can go and play and you can arrange tournaments, yada, yada, yada. I think there's something there even with this idea that you have that you can copy from the USTA where it's like, okay, in Dallas, you could organize tournaments. You could have a tournament at your house or your house could be like in the NCAA tournament. It's just one of the regions that people play into as they're going to the finals. Do you know what I mean? Like you could find probably\r\n\r\n\r\nChris Koerner (01:09:10.585)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:09:11.982)\r\n20 other pickleball owners and create your own sweet 16 tournament and have people play into it at each one of those locations. And then the winners go to a predetermined location, which everybody likes or something like that. But I just, like this idea of piggybacking off of what the USDA has already built and just copying it. It's been like, Oh yeah, we'll do that except for pickleball. Cause it's a proven model. And now that you have a pickleball court in your backyard, yes, you can have the club, but you can also kind of expand it by creating a league or creating these teams.\r\n\r\n\r\nChris Koerner (01:09:17.241)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:09:30.691)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:09:40.441)\r\nDude, endless options. mean, then vending machines, you could do private lessons, you could, you could find pickleball tutors and like take a margin between them and them. You could match them up. But what I was thinking about you, Nick, you've got a freaking covered pickleball court in your backyard. What's preventing you from doing this and a tennis court.\r\n\r\n\r\nNikolas Hulewsky (01:09:42.22)\r\nAnd yeah, it'd freaking amazing.\r\n\r\n\r\nNikolas Hulewsky (01:09:47.148)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (01:10:01.71)\r\nHer name is Beep Beep\r\n\r\n\r\nI beeped out my wife's name, for those of you who don't know.\r\n\r\n\r\nChris Koerner (01:10:10.957)\r\nShe doesn't have to know. She doesn't listen to this podcast anyway.\r\n\r\n\r\nNikolas Hulewsky (01:10:14.498)\r\nJust random people showing up in the backyards. He's like, what is happening here? Why are they here? Don't worry about it. They then went to be $5.\r\n\r\n\r\nChris Koerner (01:10:20.875)\r\nExactly. Or you could rent it out for private basketball lessons, get private basketball tutors and youths. That's a big business right there. That's right.\r\n\r\n\r\nNikolas Hulewsky (01:10:30.275)\r\nyouths.\r\n\r\n\r\nWell, I have some sad news. I think the bubble's coming down. So. You're so stupid.\r\n\r\n\r\nChris Koerner (01:10:37.145)\r\nYou just burst my bubble dude. What you I'm really not going to drop that right there.\r\n\r\n\r\nNikolas Hulewsky (01:10:44.13)\r\nOkay, but in all seriousness, we've been having clinics at my house. These people don't have to pay for it, but we've been having clinics at my house. So my wife and some other ladies in the community will come to our house. have a tennis court and they have an instructor who comes, they pay the instructor and he hosts there. He doesn't pay us anything. We don't charge him anything. We probably should charge him something for hosting, but it is kind of cool to have a spot where people can come and congregate. And that's how I like your pickleball court. I think we'll be something very similar to that.\r\n\r\n\r\nChris Koerner (01:10:52.589)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:11:10.137)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:11:14.393)\r\nWell, dude, here's another idea for you. You know what Swimpley is? Have you heard of Swimpley? It's like the, it's the dumbest name ever. It's Airbnb for pools, where if you have a pool, you can list it on Swimpley and people can come book it for an hour or 10 hours. And there are people that make six figures net profit per year, just renting out their pool or people will, yeah, I swear people will rent a house. Like let's say you're in Gilbert, Arizona. You rent a house that has a pool, $3,000 a month.\r\n\r\n\r\nNikolas Hulewsky (01:11:19.693)\r\nNo.\r\n\r\n\r\nNikolas Hulewsky (01:11:27.372)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (01:11:34.678)\r\nNo way.\r\n\r\n\r\nChris Koerner (01:11:43.031)\r\nAnd the house sits empty and you just rent out the pool on Swimpley. That's it. It's like, that's it. That's the whole business.\r\n\r\n\r\nNikolas Hulewsky (01:11:49.229)\r\nNo, man.\r\n\r\n\r\nLet me ask you question. How much do you think this pool will rent out for on Swimpley?\r\n\r\n\r\nChris Koerner (01:11:57.325)\r\nthousand dollars a second.\r\n\r\n\r\nNikolas Hulewsky (01:11:59.15)\r\nA thousand tallies a second.\r\n\r\n\r\nChris Koerner (01:12:00.793)\r\nWas that too bullish? That was a little bullish.\r\n\r\n\r\nNikolas Hulewsky (01:12:05.17)\r\nmy gosh, this is our backyard. Look at that pool, dude. my gosh. I'm gonna listen on Swimpley today.\r\n\r\n\r\nChris Koerner (01:12:10.553)\r\ncool pool.\r\n\r\n\r\nno, but anyway, I didn't even get to the idea. The idea would be to build like a Swimpley for Pickleball courts because people are building sport courts like crazy. Like would you rather build a pool for 150 grand or a sport court for 30 grand? In Texas, people are building sport courts like crazy.\r\n\r\n\r\nNikolas Hulewsky (01:12:26.104)\r\nBro, that's Owen's idea. That's Porta Quartz.\r\n\r\n\r\nChris Koerner (01:12:31.001)\r\nNo, no, no, I don't know. I know, but this is like people that had a sport court with pickleball on it in their backyard could list their property on this website and rent it out to other people like other pickleball players with pickleball ads or Facebook ads.\r\n\r\n\r\nNikolas Hulewsky (01:12:37.091)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (01:12:42.646)\r\nNo, I know. So I have a brother-in-law, Owen, love him to death. And he had this idea to start a portable pickleball court company. Yeah. And he like built out the whole app, right? Cause in the whole app is like a community of people and they can put on courts online and they can get together. And like, I'm looking at this and I was like, geez, this is overbuilt. But that's effectively his idea. He's already built like, he's literally already built the ecosystem for it, where you can go and say, this court's ready for us to go and rent or just show up to and play at.\r\n\r\n\r\nChris Koerner (01:12:49.727)\r\nlike the app side of the idea? yeah, yeah.\r\n\r\n\r\nChris Koerner (01:12:59.149)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:13:12.364)\r\nLet's all go and you coordinate and communicate with your friends. Now I think you could do it with an AI rapper, but he's actually built out the whole entire app. But I agree, I think it's a great idea.\r\n\r\n\r\nChris Koerner (01:13:15.117)\r\nYep.\r\n\r\n\r\nChris Koerner (01:13:23.735)\r\nYou could, they have these AI tools now that uses Google Earth to identify certain homes. Like if, let's say you had a solar company, you could go identify the homes that have like max sun exposure on the roof. You could use a tool like that to find all the homes with sport courts and you could proactively list them on this marketplace. And then as they start to get inquiries, then you could use that as the reason to reach out to the homeowner and say, Hey, we listed your, your sport court on this marketplace. We blurred out your address for your privacy, but if you ever want\r\n\r\n\r\nNikolas Hulewsky (01:13:30.434)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (01:13:38.382)\r\nHmph.\r\n\r\n\r\nChris Koerner (01:13:53.027)\r\nfree money, go ahead and verify your listing. It's kind of like a Google business profile, how Google will automatically add all the businesses and then the owner has to go and verify it. could be the same strategy.\r\n\r\n\r\nNikolas Hulewsky (01:13:54.414)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (01:13:59.277)\r\nYeah.\r\n\r\n\r\nthat's interesting. Any risk of Google kicking you off or listing places that aren't yours?\r\n\r\n\r\nChris Koerner (01:14:09.357)\r\nNo, you wouldn't have anything to do with Google. It would just be on your website.\r\n\r\n\r\nNikolas Hulewsky (01:14:12.622)\r\nI love that idea. Okay, can I share an idea?\r\n\r\n\r\nChris Koerner (01:14:18.551)\r\nHmm do it\r\n\r\n\r\nNikolas Hulewsky (01:14:21.486)\r\nAll right, so we moved a couple of weeks ago. And this is my backyard. posted this on Twitter, actually.\r\n\r\n\r\nIt's freaking amazing. I went from 0.3 acres to three acres. And I'm going to stand by what I said. It is harder. It's harder doing that than going from two to three kids for me. All right. But this is the backyard. It's amazing. And you know me, I'm a city boy. Like I'm not mowing this whole thing. Now I got a weed and I got an edge. Technically speaking, actually that is correct. I have this company named Augusta, lawn care services. I don't remember their exact name.\r\n\r\n\r\nChris Koerner (01:14:39.225)\r\n10x.\r\n\r\n\r\nChris Koerner (01:14:50.113)\r\nMm-mm. You're not mowing any of it actually.\r\n\r\n\r\nNikolas Hulewsky (01:15:03.478)\r\nIf you ever want to come onto the podcast, let's have a conversation. They take care of my yard. But the point is one of the reasons that we bought this house was because we wanted to have a house where we could host people. Like you have a house where you can host people and it's beautiful. You got a big backyard. You got a big house. You love cooking for people. And I've been jealous of that, right? Like we lived in a smaller house. wasn't, it was nice, but it's not like we could have a bunch of people over. And so we moved from, from a third of an acre to now three acres.\r\n\r\n\r\nAnd in the first couple of weeks that we've been here, we've had my youngest son's soccer party and my net, oldest son, excuse me, my second son's soccer party and my oldest son's volleyball party at the house. they swam in this pool back here. And it was amazing, dude. Like good conversations. The family was, there. The kids were excited. My house was amazing on the inside. Like it didn't get dirty at all. Cause nobody went inside. They were just outside playing the whole entire time, which is freaking awesome. But as I was talking to people out here,\r\n\r\n\r\nand having a conversation around this beautiful pool, I talked to this guy and I find out he's an entrepreneur. And I'm like, oh cool, tell me about your business. He's like, oh, well, I do bathtub refinishing. And I was like, what? He's like, yeah, bathtub refinishing. And I was like, that's a thing? He's like, yeah, yeah, that's a thing. I was like, oh, what is that? He's like, well, know, if you have an acrylic bathtub or if you have a stainless steel bathtub or.\r\n\r\n\r\nChris Koerner (01:16:13.389)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (01:16:29.102)\r\nwhatever it is, they all have a surface and it might get chipped or it might get rubbed the wrong way, whatever it is. And to replace those is like $10,000, $15,000. But to just get it refinished is like $600 to $900. And lots of people don't necessarily realize you can just get it refinished as opposed to having to buy a whole new bathtub or like have to actually redo your whole bathroom. You know what I mean? It gets really expensive. And obviously having that conversation with them was like, tell me more.\r\n\r\n\r\nChris Koerner (01:16:51.683)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:16:59.094)\r\nSo we just, first of all, we just started talking about his specific business. Before I get into that though, did you know that's a thing?\r\n\r\n\r\nChris Koerner (01:17:05.238)\r\nI heard of it. Yeah. I've seen like short form videos of like the before and after, but I don't know anything about it. Yeah.\r\n\r\n\r\nNikolas Hulewsky (01:17:09.518)\r\nReally? Okay. So this guy was talking about his business. He started this like five years ago and he's got like the quintessential dream entrepreneur lifestyle, right? He's got this business. He's got one or two employees that do the majority of the work. He's, if I were to guess, he's probably making anywhere between two and $500,000 a year. So he's like content with where he is. He's making great money. And, he's also not like,\r\n\r\n\r\nChris Koerner (01:17:36.865)\r\nMm-hmm. He could scale if he wanted.\r\n\r\n\r\nNikolas Hulewsky (01:17:40.206)\r\nHe could scale exactly. He's not like, got to, I got a triple quadruple the size of this business. And he picked a business that is like so niche and not sexy that not a ton of people are entering it. And on top of that, is AI going to disrupt this space? Is AI going to come and refinish your bathtub? Like, no, it's not going to come finish your bathtub. average ticket price, $6,900. Margin on that is like 30%.\r\n\r\n\r\nNet margins, obviously if you get an employee that it brings down your net margins, but I want you to check this out. Okay. This is the treasure valley. So where I live and there are about 800,000 people that live in this area. I just searched bathtub refinishing Boise, Idaho. Look how many competitors there are.\r\n\r\n\r\nThere's 800,000 people that live here, probably somewhere in the order of like 250,000 homes, 250,000 to like 400,000 homes. And there are like maybe six.\r\n\r\n\r\nChris Koerner (01:18:41.027)\r\nYeah. Crazy.\r\n\r\n\r\nNikolas Hulewsky (01:18:42.338)\r\nLike this Jacuzzi bathtub remodel, they're not doing refinishing. This new finish is definitely a competitor. Refinish is a competitor. Boise bathtub refinishing, this is the guy who came to my... Yep, that's him. That's the guy who came to my son's volleyball team party. Miracle finishing, let's see what this one is. Bathcrest, no, that's not a refinisher. That's just a remodeler. And then refinish Nampa. So we're talking about five or six actual competitors.\r\n\r\n\r\nChris Koerner (01:18:53.741)\r\nname checks out.\r\n\r\n\r\nNikolas Hulewsky (01:19:11.83)\r\nin a market that's freaking massive. And I started talking to him, like, how do you acquire customers? It's like, well, Google, he's like SEO. He's not doing any real paid ads. He's tried to use other agencies in the past, but he's like, it just doesn't work. Like I just am not getting the type of business that I want to out of, out of actually paying the money to do that. So the best form of leads right now is Google SEO. That's all, that's where I get like all of my leads from. And I think, I know this isn't sexy. I know this isn't AI.\r\n\r\n\r\nThis to me is like, hey, you want to start a pressure washing company? Hey, you want to start window washing? Bathtub refinishing is like the perfect sweaty non-sexy business to start in any market. Think about how old the homes are in any market. An aging population, people don't want to pay a ton of money to have it like totally remodeled, 10 to $15,000, six to $900. That's a way more affordable price point. I just think that this would be an awesome opportunity for any enterprising person who wants to get into home services.\r\n\r\n\r\nChris Koerner (01:19:46.435)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:20:11.154)\r\nOr you could build up like a Legion site, a programmatic site, and just sell these leads to these guys.\r\n\r\n\r\nNikolas Hulewsky (01:20:16.268)\r\nThat's a great, dude, that's a freaking great idea. my gosh, that's a great idea. How easy, how easy would it be?\r\n\r\n\r\nChris Koerner (01:20:21.379)\r\nSomeone's gonna be doing it now that we talked about it.\r\n\r\n\r\nYeah, all day, twice on Sunday.\r\n\r\n\r\nNikolas Hulewsky (01:20:26.902)\r\nActually, this would be a perfect directory.\r\n\r\n\r\nChris Koerner (01:20:29.741)\r\nYeah, be great for that too.\r\n\r\n\r\nNikolas Hulewsky (01:20:31.532)\r\nRight? Could easily spin up a directory. Directories are so, MCP directory, Claude, you just start, we're just throwing the words out now. Yeah, you know me. So that was a real world business model that I just think is, could be really cool.\r\n\r\n\r\nChris Koerner (01:20:33.593)\r\nDirectories so high right now.\r\n\r\n\r\nChris Koerner (01:20:40.409)\r\nYou down with MCP?\r\n\r\n\r\nChris Koerner (01:20:51.257)\r\nI like it.\r\n\r\n\r\nChris Koerner (01:20:54.777)\r\nThat's good.\r\n\r\n\r\nShould we wrap it?\r\n\r\n\r\nNah.\r\n\r\n\r\nNikolas Hulewsky (01:21:01.71)\r\nus a rap.\r\n\r\n\r\nChris Koerner (01:21:03.257)\r\nShould we wrap it? Sorry, I don't know. This is a protein bar.\r\n\r\n\r\nNikolas Hulewsky (01:21:05.486)\r\nSo good.\r\n\r\n\r\nNikolas Hulewsky (01:21:11.886)\r\nSo good. I love it.\r\n\r\n\r\nChris Koerner (01:21:12.217)\r\nalright",
  "metadata": {
    "duration": "",
    "date": "2025-06-06",
    "platform_source": "Google Drive"
  }
}