{
  "episode_number": "204",
  "episode_title": "Building an Eight-Figure Empire from a Window Washing Business with Brandon Vaughn",
  "guest_name": "Brandon Vaughn",
  "business_name": "Wise Coatings, Hirebus",
  "transcript": "﻿Nikolas Hulewsky (00:00.77)\r\nBrandon Vaughn, we have a freaking treat today. You own 12 companies. You're an eight figure entrepreneur, employ hundreds of people. But we were just talking before this and I think the coolest thing that you said to me was you started window washing with your dad at age 13. Tell me about that.\r\n\r\n\r\nBrandon Vaughn (00:22.004)\r\nMy dad was an owner operator window cleaner for 33 years. You my definition of an entrepreneur or at least my version of what I knew was my dad who was owner operator between zero and one employees for 33 years. So a long time on the tools and I was one of them. So age 13 homeschooled through high school and he paid me five cents a screen to wash screens with them when I was younger. And then eventually\r\n\r\n\r\nNikolas Hulewsky (00:37.159)\r\nmy gosh.\r\n\r\n\r\nBrandon Vaughn (00:49.005)\r\nHe put me on performance pay where I got to make commission on what we earned. I mean, that just taught me how to just hustle and work really fast.\r\n\r\n\r\nNikolas Hulewsky (00:54.712)\r\nDude, I can hardly get my son to take out the trash. How did your dad get you to like, let's go work together? Did he need a worker or was he trying to instill in you some work ethic?\r\n\r\n\r\nBrandon Vaughn (00:57.613)\r\nyou\r\n\r\n\r\nBrandon Vaughn (01:03.243)\r\nYou know, it's funny, he now that I have kids and I struggle with man, it's just so hard to get the kids up and get them going and get them into a good routine. My dad had all of that with me, probably to an extreme degree. He'd have to come in and wake me up almost every single morning for work because I would sleep in. I hated waking up. I was not a morning person. I complained. I whined. I did all the normal things that a teenager would and bless him for being consistent because looking back on it, like I learned so much.\r\n\r\n\r\nNikolas Hulewsky (01:23.01)\r\nYeah.\r\n\r\n\r\nBrandon Vaughn (01:31.359)\r\nwork ethic and customer service skills from working alongside him. So I'm trying to do that same thing with my kids now who are teens as well. And it's tough. He is.\r\n\r\n\r\nNikolas Hulewsky (01:38.71)\r\nYeah. Is your dad still around? What does he think of what you're doing now? mean, because you just said zero to one employee for 33 years. So it's not like he had this big operation. What does he think of the fact he's like, man, Brandon, you got a company with 39 locations. You're doing, you know, $2 million a month in that space. I never did anything like that. What does he say to you?\r\n\r\n\r\nBrandon Vaughn (02:01.047)\r\nYou know, it's funny because the day I turned 18, I went out and got my own business license, kind of carved my own path. It came full circle. 2012, my dad was walking on the treadmill and collapsed. Walked on the treadmill every day, very, very healthy fit. You'd look at him. I mean, he looks way younger than he is, but he had a heart disease and it went undiagnosed for a period of time. Put some stents in. Doctor told him he couldn't work physically anymore.\r\n\r\n\r\nSo this was 2012 and he had no savings, no retirement. And what that kind of transpired into was us circling up as a family and me stepping in and buying the business from him for three grand a month for life. And this is at the time was doing about $8,000 a month. So there was not enough meat on the bone to feed all of us. You know, my cause my mom wasn't working. So I kind of was forced to grow and\r\n\r\n\r\nNikolas Hulewsky (02:47.086)\r\nWow.\r\n\r\n\r\nBrandon Vaughn (02:59.949)\r\nBefore that, I had kind of ran every business that I had very similar to my dad, owner operator, doing the tools, know, like sell the job, go do the job, sell the job, go do the job. That's like all that I knew. So 2012, 2013, like I had to really, really get uncomfortable with growth and try to figure out, okay, how can this business make enough to work and feed two families and, you know, me not have to work 80 hours a week and good coaching, good mentorship and lots of pain and suffering.\r\n\r\n\r\nNikolas Hulewsky (03:07.544)\r\nYeah.\r\n\r\n\r\nBrandon Vaughn (03:29.003)\r\nyou know, we kind of started figuring it out.\r\n\r\n\r\nNikolas Hulewsky (03:31.49)\r\nWhat? Dude, so you had other businesses at the time and you just stepped in to start doing window washing?\r\n\r\n\r\nBrandon Vaughn (03:37.033)\r\nI had, yes, I had a, I had a company called Vaughn creative works where I did web design, like on Craigslist, I found some towing companies and would cold outreach to a few different companies taught myself how to do like lightweight HTML, CSS coding type of a thing, some graphic design stuff. And right before that, I failed a construction business. So like, wasn't, I'm not like crushing it in business at this time. You know, when I bought the, let's see.\r\n\r\n\r\nNikolas Hulewsky (04:03.084)\r\nYeah. How old were you?\r\n\r\n\r\nBrandon Vaughn (04:06.765)\r\n20, let's see, this was 13 years ago, it was 2012. I'm 41 now, so 28, 28 years old.\r\n\r\n\r\nNikolas Hulewsky (04:16.462)\r\nDude, so 28 years old, your dad collapses. His sole source of income is a window washing company. And you step in to buy it from him three grand for life, which obviously you need to able to support yourself, but you're now supporting your dad. And did you even think about it at the time? you, you know what I mean? Like looking back, you probably look at that and you're like, holy crap, that was crazy. But at the time, did it just feel like, no, this is what I'm supposed to do?\r\n\r\n\r\nBrandon Vaughn (04:44.971)\r\nYeah, 100%. Yeah, it's just like, other choices there? Like, of course, of course we're to take care of my mom and dad and figure it out. And honestly, I was excited. You know, I'm an undying optimist and I think that you kind of have to be to be an entrepreneur. You have to just be like, well, of course, of course it's going to work out. Why wouldn't it work out? And then you find out later that, God, everything is horrible. And this is a hundred times harder than I thought it was going to be.\r\n\r\n\r\nNikolas Hulewsky (05:13.709)\r\nYeah.\r\n\r\n\r\nBrandon Vaughn (05:14.283)\r\nAnd then hopefully your desire to just, you know, your refusal to quit and your work ethic to just, I'm going to make this work no matter what that willpower allows you to not collapse on yourself like a dying star. And, and I feel like that's kind of the recipe for good entrepreneur is you have to have enough optimism to be able to be like, we're just going to send it. You know, we're just going to, we're just going to go for it.\r\n\r\n\r\nNikolas Hulewsky (05:38.005)\r\nHahaha\r\n\r\n\r\nBrandon Vaughn (05:38.893)\r\nYou know, this is going to be great. You know, and I'm selling my wife on it. Like, it's going to be awesome. Like, I want to grow this thing and I want to get this and be like this whole thing. We're to keep the second generation thing going on. And it was way the heck harder than I thought it was going to be. but at the time it's like, no, the courses we're going to, we're going to do this and we're going to get it figured out. So I'm glad I'm glad that I did.\r\n\r\n\r\nNikolas Hulewsky (05:57.162)\r\nSo, okay. So what happened with that business? You take over that business. You're like, I got some window washing experience. I used to do this as a kid. I'm a freaking bro. You step in, your wife, you convince your wife to do it, which, you know, bless our wives. I don't know how they stick with us. Way harder than it was. Where did you get to with that business over time?\r\n\r\n\r\nBrandon Vaughn (06:04.62)\r\nYeah.\r\n\r\n\r\nBrandon Vaughn (06:18.957)\r\nWell, I had some really hard peaks and valleys with it. I had over half of my team quit on me while we were booked out for two months solid. Like a couple of years into it, we started growing like five, six, seven, eight people. And honestly, I would say that the biggest, one of the most pivotal things for me was a book called The E-Myth by Michael Gerber. I read that at the time and it kind of taught me about A, working on the business.\r\n\r\n\r\nAnd one thing I realized is when I was sitting in front of a computer and I was creating systems and processes and checklists and like, you know, manuals, and I was extracting information out of my brain, my dad's brain and putting, you know, like automation stuff in place. That's where I realized I was making the most amount of money. We were scaling the fastest. Our teams were doing the best. It was easier to bring people in and train them up to speed. And we kind of hit this critical like inflection point where\r\n\r\n\r\nWe doubled and started tripling every year and about five, five and a half years later, I was at 70 employees and we had 24 service vehicles. And it was, it was, I would say it was my first big boy pants business that I had because every business before that was a dumpster fire owner operator kind of hot mess. And this was still, don't get me wrong, like lots of dumpster fire moments, but it was.\r\n\r\n\r\nNikolas Hulewsky (07:41.144)\r\nSure.\r\n\r\n\r\nBrandon Vaughn (07:43.661)\r\nYou know, it got to a place where I'm like, okay, I'm only working five hours a week in the business. runs itself pretty much. was speaking a lot. was doing lots of, know, teaching at industry events for home services. And then just had someone just randomly approached me, asked me to go out for lunch after one of my speaking sessions and offered to buy my business. And we like sold within a couple of months after that. was crazy.\r\n\r\n\r\nNikolas Hulewsky (08:01.505)\r\nSweet.\r\n\r\n\r\nNikolas Hulewsky (08:05.326)\r\nOkay, so at the end of the five years, when you sold the business, what was it like your trailing 12 months top line? I know you said 70 employees, but what kind of revenue was it doing?\r\n\r\n\r\nBrandon Vaughn (08:14.989)\r\nYeah, the month that we actually exited, we were doing about 500K a month. so there's seasonality that, you know, that of course kind of goes with that, you know, in the winter time. And we were adding like a truck a month. So it was like, boom, boom, boom, boom, boom. We were really kind of scaling up a lot. So, you know, 12 trailing months was obviously less. wasn't 500K a month for the last 12 months, because we were growing really rapidly. But that's really where it kind of settled into.\r\n\r\n\r\nNikolas Hulewsky (08:19.529)\r\nWow!\r\n\r\n\r\nSure.\r\n\r\n\r\nNikolas Hulewsky (08:39.99)\r\nWhat would your dad say as you were scaling? What would your dad say every time you're like, hey, we gotta get a new truck. Hey, we gotta hire new people. Like, what would he say?\r\n\r\n\r\nBrandon Vaughn (08:42.861)\r\ntell you when he did say it. truck number two, he goes, are you sure you want to grow this much? Like, are you sure you want to do that? And then truck number three, whoa, Brandon, like this is, I mean, I'm not kidding you. He was, he really was horrified, nervous, really freaked out. Like any moment that I had that was just super stressful, he's like, see, I told you, like, this is why you think it's small, it's simpler.\r\n\r\n\r\nNikolas Hulewsky (08:53.198)\r\nNikolas Hulewsky (09:08.874)\r\nI told you. See?\r\n\r\n\r\nBrandon Vaughn (09:11.585)\r\nThis is why I always kept it this small. You know, there's lots of complications and he wasn't wrong. It was way simpler. It way easier, but you know, he had a bus score of one and bus score is how many people, how many people need to get hit by a bus in your company before it ceases to exist. And for, for my dad, that number was one, like we want that number to be as high as possible.\r\n\r\n\r\nNikolas Hulewsky (09:22.67)\r\nWhat's?\r\n\r\n\r\nNikolas Hulewsky (09:32.334)\r\ndude, did you make that up, bus score of one? I love that.\r\n\r\n\r\nBrandon Vaughn (09:35.469)\r\nNo, no, I didn't make it up. yeah, I heard, heard, I can't remember. can't remember who it was that I heard it from, but it was a, it was an author and that, yeah, how many people need to get hit by a bus? And your goal is to have that number be as high as possible. He got hit by a metaphorical bus. And, you know, so as you kind of scale and kind of grow, he was very, very uncomfortable with that thought, but I had more redundancy. Like I had more.\r\n\r\n\r\npeople whose jobs it was, their livelihood was dependent upon selling stuff and getting work done and completing things. Like, and everyone was on performance pay and it was tied to KPIs and metrics. So it became a lot more redundant and stable to where if something happened to me, I wasn't at risk of the whole business.\r\n\r\n\r\nNikolas Hulewsky (10:18.764)\r\nYeah, I mean, you get to a point where you've built a real business. You have systems and processes and it's things that can exist without you necessarily being the one to be there to drive it. Two things. The first thing is I don't call it the bus score. I would call it the lottery score. So a few years back, I stopped saying like, well, you know, if somebody got hit by a bus, who would be able to do, or if you got hit by a bus, who would do your job? And I started saying, well, if they won the lottery.\r\n\r\n\r\nwho would be able to do their job the next day? Because it's still the same idea, right? Like you win the lottery and you're just, you're out, yeah, yeah. I worked in hospice, so I think my team was like, can we not like have our own team die? We're already taking care of dying people. What's happening here? Why are there so many bus accidents? But the second thing is, my dad was an entrepreneur, not very successful entrepreneur.\r\n\r\n\r\nBrandon Vaughn (10:49.517)\r\nThat's a little bit less grim. Yeah, it's less grim. Fair.\r\n\r\n\r\nBrandon Vaughn (11:01.005)\r\nare we all getting hit by a bus, man? What's wrong with you?\r\n\r\n\r\nNikolas Hulewsky (11:11.594)\r\nAnd when I bought my first business, was a $3.2 million business that I purchased for the first time. And I was talking to him on the phone and I'm talking to him and he had never purchased anything that big. Like when we bought cars, they were salvaged title cars that he fixed up. When we bought anything, it was like used to be fixed. He built our own house pretty jankily. But anyways, I'm talking to him on the phone and he's like, he's an immigrant. He says, well, how much is the business? And I was like, it's about.\r\n\r\n\r\nIt's $3.2 million. Oh, Nikolai, that's too much. That's too much money. Come on, millions of dollars. And I was like, Dad, I did the due diligence. It's a good business. We're going to buy it. He's like, oh, you could go out and start a business for half of that money and grow it 10 times. and then I end up selling it years later, and it's an amazing outcome. But it was a very similar experience, right? It's like my dad is like, whoa, whoa, whoa, whoa, whoa.\r\n\r\n\r\nWhat are you doing here? That's too big.\r\n\r\n\r\nBrandon Vaughn (12:11.349)\r\nYeah, yeah, yeah, I'd say, you know, it's one of those things that you'll always be surrounded by those types of individuals and they, you know, it's with love. Like my dad deeply cared, your dad deeply cared for you. And all these things are said with the best of intention, the best of meanings, but man, there's something about getting around other people in a community of those that are doing big things because...\r\n\r\n\r\nNikolas Hulewsky (12:21.39)\r\nfor sure.\r\n\r\n\r\nBrandon Vaughn (12:37.069)\r\nI could tell you what, every friend that I've grown up with, every colleague, every family member looks at me like a three-eyed alien when they ask me, like, you know, I don't even like telling people what I do for a living because they're like, what do do for a living? I'm like, I have a, I do garage floor coatings. Like I don't even get into it because it's just, it's too weird. And a lot of people can't wrap their brain around it. And I'm just a normal person. I'm a homeschooled kid that didn't go to college.\r\n\r\n\r\nthat has made every mistake you could possibly imagine. And I still have no idea what the heck I'm doing. Like that's kind of like the whole point. I mean, like you probably don't know what you're doing because if you're doing something new all the time in order to grow, like that's just kind of part of it. And it's like getting comfortable with being extremely uncomfortable is, is it's a right of passage as an entrepreneur.\r\n\r\n\r\nNikolas Hulewsky (13:25.646)\r\nI still hate talking to people about what I do. It's why it's one of the, I never even asked that question to somebody because I feel weird about it, but we were renting our house out and we went and met with people who were going to rent it. And the guy was there with my wife and he's like, well, what do you do, Nick? And my wife's like, yeah, what do you do? And like, I've sold a couple of companies. I have investments. I own multiple businesses, but it's not like there's only one thing I do. And so my go-to line now is just like, I dick around on YouTube.\r\n\r\n\r\nBrandon Vaughn (13:33.581)\r\nThat's\r\n\r\n\r\nBrandon Vaughn (13:44.173)\r\nYou're like, boy.\r\n\r\n\r\nBrandon Vaughn (13:55.233)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (13:55.788)\r\nAnd they're like, and they're like, what does that mean? You know, they're like always spurs a conversation. But yeah, it's it's weird trying to explain what you do to people who don't understand entrepreneurship anyways. So for them, it's it's always just a foreign concept. That's why I like. my one of my favorite stories of years that we were talking about is you swing for the fences, right? And like people who swing for the fences are weird.\r\n\r\n\r\nHome run hitters are weird. Like why would you risk all of that? That's weird. Why would you risk people looking at you when you fail? That would hurt my feelings. You did this thing where you started a YouTube channel that was basically chronicling your path to a million dollars. And I think for most people that would be freaky, right? Because what if you fail? What are people gonna say to you? What's my wife gonna think? What are my friends gonna think? I'm putting this out on YouTube. I don't even have an audience yet. And I'm like chronicling this like.\r\n\r\n\r\nman, I'm a dummy. I know this because I've gone through the social media space. Talk about that experience of you launching this YouTube channel to get to a million dollars.\r\n\r\n\r\nBrandon Vaughn (14:57.101)\r\nOh, it was horrifying. My wife was like, this is the stupidest idea you've ever had. I'm like, it's going be so good. Cause you need to understand something. Like, let me tell you about the stakes. I owned a business coaching company called Conquer. So I, you know, I, while I was growing my service business, I did lots of public speaking. had tons of people ask me for coaching. And so I went out and found like, you know, eventually got up to close to 50 coaches that all owned seven and eight figure businesses. We kind of made this group together. It was.\r\n\r\n\r\nNikolas Hulewsky (15:01.119)\r\nHahaha!\r\n\r\n\r\nBrandon Vaughn (15:25.749)\r\nUnbelievable. We did so many cool things with that business. You know, we got the Guinness World Record for the world's largest virtual business conference. it just, yeah, it was just the, was, had 20, 20, almost 21,000 home service business owners attend like our event, the home service super summer. But like, I had a lot of eyeballs on me and I was, and it kind of gnaws at you and people like, well you just sold your business. So you're kind of a sellout.\r\n\r\n\r\nNikolas Hulewsky (15:33.602)\r\nNo way.\r\n\r\n\r\nNikolas Hulewsky (15:42.322)\r\nBrandon Vaughn (15:52.689)\r\nand those who can't do, they teach. And it just always ate on me a little bit and definitely some ego and some pride. So I told my wife, okay, I want to start this business. It's going to be a YouTube thing. The rules are no work in the field from day one, no sales. I can't go even do a sales call. In fact, I won't even answer a phone call from day one. We have this small like little startup budget of 15K.\r\n\r\n\r\nAnd I'll pick an industry. have no experience in won't use any of my previous contacts whatsoever. In fact, I won't even make a single phone call to any of my previous contacts. Like as far as people are concerned, they wouldn't even know that I'm like even involved because the phone rings to my salesperson on like a VoIP phone and started this company called wise codings. And we went from zero to a hundred thousand dollars a month in four months. So month four, we hit a hundred K and\r\n\r\n\r\nwe hit seven figures our first year inside of our first calendar year. And then about six months into it, I decided to franchise it and found a CEO slash partner who was going to earn equity into the business or get equity in the business as part of launching this. And, we franchised it six months in and cashflow this thing. And now it's 39 locations and it's, it's just this crazy, crazy bizarre.\r\n\r\n\r\njourney of, you know, kind of what's possible. But at the time, I mean, we, we literally at one point went down to $50 in our bank account. And I was positive that I was going to go bankrupt and fail or have to have like an episode in the business bank account. Yeah. So we were really transparent with, know, exactly how much we spent. We went to seven employees within like the first two and a half months, I was spending 10 grand a month on, on Facebook within like, you four months.\r\n\r\n\r\nNikolas Hulewsky (17:29.39)\r\nWait, wait, like $50 in your personal bank account? In the business bank account, okay.\r\n\r\n\r\nBrandon Vaughn (17:47.435)\r\nlike I laid out the exact step by step of how we did this, but we had this gnarly job, you know, about month two where it's like, okay, this is bad. We're gonna, we're gonna take this\r\n\r\n\r\nNikolas Hulewsky (17:59.47)\r\nThat's what I was gonna ask. All right, so when you announce it, right, and you're like, hey, I'm doing this, it sounds, dude, in hindsight, it's like, oh, that's a cool story. But when you do it at the time and you're like, hey, I'm doing this, it's similar to when you start a business in entrepreneurship, because your friends and family are around you you're like, hey, I'm doing this thing, and you're still worried. But when you do it on YouTube and it's like this public thing, it almost, you're worried about compounding the humiliation, if you will.\r\n\r\n\r\nBrandon Vaughn (18:20.651)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (18:29.934)\r\nSo zero to four, $100,000 by month four, that's cool. But dude, how did you feel in month one and two and three? Were those the longest months of your life?\r\n\r\n\r\nBrandon Vaughn (18:39.937)\r\nYou know, it's interesting because my, you you understand something. I had a full-time job at this time. So like I was CEO of Conqueror. We had a bunch of coaches. We had thousands of clients that were like working with us. And so most of my time was just spent in just filming. So I had a videographer that would come out in the studio. We'd film, we'd document everything like, okay, here's how we're building the website. Here's our unique, you know, selling propositions. We're going to go talk to customers.\r\n\r\n\r\nNikolas Hulewsky (18:44.866)\r\nas a coach.\r\n\r\n\r\nNikolas Hulewsky (18:56.782)\r\nMm-hmm.\r\n\r\n\r\nBrandon Vaughn (19:06.068)\r\nSo like a lot of the work was more just spent on documenting the first four months of kind of growing this business. And my actual time spent in the business was very, very low because I still had this full-time job. But that was kind of the point, you know, is, is, Hey, you can even some of your listeners listen to this. You can, you can start a business. You just have to be really good at finding great people.\r\n\r\n\r\nand recruiting good people. have to be good at systems. You have to be good at marketing. You have to understand how to go buy customers. And really that's kind of like the recipe to success in a lot of ways, especially for home services is it's like a teeter totter. You know, one side you have your, your, your sales and marketing motions and your other side, have your people, your trucks, your services, your production side of the business. And it's just, it's just kind of like balancing that you booked out too far. Okay. We're going to spend more money on.\r\n\r\n\r\nNikolas Hulewsky (19:47.48)\r\nMm-hmm.\r\n\r\n\r\nBrandon Vaughn (20:01.537)\r\nyou know, on, people so that we get more people hired. And it's just kind of like balancing it. So yeah, it was, it was, it was pretty wild experience to kind of get that set up and have people watch.\r\n\r\n\r\nNikolas Hulewsky (20:14.402)\r\nWhat year was this?\r\n\r\n\r\nBrandon Vaughn (20:16.205)\r\n2021.\r\n\r\n\r\nNikolas Hulewsky (20:17.582)\r\n2021. Okay. So we're still like kind of in the thick of it and you live in Washington, Oregon. So, you know, it wasn't the most open. Those aren't the most open States during COVID, which, know, you're launching this online, but where was the first market you launched him? Portland. Okay. I'm going to fast forward and then jump back fast forward. You now have a company called hire bus that is helping people make better hiring decisions.\r\n\r\n\r\nutilizing AI, right? So obviously between 2021 and today, AI has come out and just kind of changed everything about everything that we do. As you launched the business and you started scaling, which 39 locations is freaking incredible, especially when you bootstrap that in the first couple of years, at what point did you realize, Hey, there's this AI thing that can actually accelerate these real world businesses that I am doing because\r\n\r\n\r\nBrandon Vaughn (20:48.673)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (21:13.186)\r\nYou're real cool business. You're washing windows. You're obviously coaching people. You're doing garage coatings. These are home services type businesses that people don't usually see as, AI can help actually accelerate these businesses. When was the aha moment for you?\r\n\r\n\r\nBrandon Vaughn (21:30.189)\r\nI'd say 2023 was really the big.\r\n\r\n\r\neye-opening moments where we could really start building a lot of the stuff that I was already building and already kind of using. Like we were using Google Sheets. We were, we had really good recruiting processes and I've, I've built really solid systems for recruiting. Like the general thesis behind recruiting is A, it's a marketing problem to solve. So all the same things, internal customers, external customers, like same things, videos, marketing motions, know, messaging, speed to lead.\r\n\r\n\r\ncustomer experience, like all of it applies, like direct proxy parallels. And then the second part of it is you need to always be recruiting, not just when you need someone, you need to be doing it 365 days a year, but that's hard to do because you doing those interviews and talking to people and putting them kind of on a waiting list, building this little talent bench.\r\n\r\n\r\nIt's just difficult for a lot of business owners to do. So we built out a ton of automations to kind of accomplish this. And then when AI started really becoming a lot more accessible, that's when we launched Hirebus as an AI recruiting company that does the job writing, the posting, the scheduling, the management, the communication with candidates, the interviews, their screening process, the resume analysis, the benchmarking, like all of it, and just tease up the top 3 % of talent.\r\n\r\n\r\nwithout anyone having to like do a lot of that manual work. So it saves people tons and tons and tons of time and gets you the best quality fit for people. And that all kind of worked out really well because I kind of built it with wise coatings is kind of one of my first real needs to kind of have that process built in. And then also built it for our conquerors who are my coaching clients at the time, because they were saying like their number one biggest pain point was trying to get people.\r\n\r\n\r\nBrandon Vaughn (23:24.107)\r\nSo that led to me exiting Conquer and sold that to Housecall Pro and then moving into HireBus full-time, which is what I'm doing now. I still own Wise Codings. I still have a several, a bunch of other businesses that I own as just a absentee owner, kind of an investor, but HireBus is my full-time focus right now.\r\n\r\n\r\nNikolas Hulewsky (23:42.926)\r\nSo I grew a most recently home health and hospice company and we went from zero to $12 million in a few years and those services businesses are highly people intensive. And so we had a couple hundred employees by the time that we exited. And that was always the problem, right? Where do we find good clinicians? Where do we find good people to hire? I'm curious, even if you can screen share like\r\n\r\n\r\nWhat does that look like that you built? Did you just build out, hey, these are the best processes or are these actually going and integrating with Glassdoor and Indeed and I'm trying to think of something, LinkedIn? Like, is it helping on the sourcing side of things? Is it just helping on the qualifying side of things? How would I even look at this as a business owner?\r\n\r\n\r\nBrandon Vaughn (24:31.039)\r\nYeah, it helps out with all of those areas. you know, you have kind of like your main funnel of all the different stages of, where they come in their right seat, assessment, interview, et cetera. And then the actual view of a candidate specifically, we have all these different benchmarks for different positions. So like, you're, if you're trying to hire an outside salesperson, one of our\r\n\r\n\r\ncore things that we have is called the right seat assessment. And it's a single question assessment. It only takes a few minutes to complete and you get back 21 different behavioral benchmarks on how well they are, you know, aligned from zero to a hundred. And each one of these roles has a different set of benchmarks that correspond against the highest performing people inside of those roles. So like for sales, you, this is kind of like the ideal range.\r\n\r\n\r\nNikolas Hulewsky (25:12.408)\r\nWow.\r\n\r\n\r\nBrandon Vaughn (25:22.815)\r\nhigh productivity, high aggression, low self-control, high creativity, high criticality. You want them to spend that paycheck as fast as they make it. And this is that benchmark that the top highest performing salespeople that are in outside sales typically have. So you'll get a score that has that side of it, but then you also see their entire behavioral benchmark.\r\n\r\n\r\nNikolas Hulewsky (25:27.17)\r\nHehehehehe\r\n\r\n\r\nBrandon Vaughn (25:48.889)\r\nwhat their networking score is, support, exhibition, productivity, dominance, endurance,\r\n\r\n\r\nNikolas Hulewsky (25:54.03)\r\nIs this the same assessment given to every employee who applies or every person who applies? then it just obviously is not tailored, but measured against here the benchmarks for sales, here are the benchmarks for ops, here are the benchmarks for whatever other position.\r\n\r\n\r\nBrandon Vaughn (26:07.861)\r\nYes, exactly. Yep. So it's the same, same modality of assessment that goes through. then this, you know, our AI will analyze their resume and extract some information. Now resumes are only so helpful. And so the actual real part of it is having a conversation with our AI interviewer. So we do our first round of interviews. So the process looks like when a candidate applies, they can instantly be talking and having an interview.\r\n\r\n\r\nNikolas Hulewsky (26:09.421)\r\nOkay.\r\n\r\n\r\nBrandon Vaughn (26:35.505)\r\nAnd with that gets the speed to processing someone so much faster. and then if they're not a perfect fit right now, if there's not an opening, we put them on a waiting list. And then when there is an opening that pops up, we were able to blast out to all the candidates that applied and get them pulled in. So speed and higher is very.\r\n\r\n\r\nNikolas Hulewsky (26:55.342)\r\nHow are the applicants coming in? it a proprietary posting system or is it just you post to the websites you're going to post to and then the applicants funnel to hire bus?\r\n\r\n\r\nBrandon Vaughn (27:08.471)\r\nYeah, our platform posts on all the job boards. And then we also do passive outreach as well. going on LinkedIn, we have AI agents that'll go in and actually talk to people that are passively, they're not actively searching, but they're just kind of more in passive mode and find out where they're at in their process, if they would be interested. And then we pull them into top of funnel as well.\r\n\r\n\r\nNikolas Hulewsky (27:33.56)\r\nDid you originally build this for you? Were you like, I want to build something so I can screen people quicker? Yeah, well.\r\n\r\n\r\nBrandon Vaughn (27:38.445)\r\n100%. Yeah. Yeah. For us, us and our coaching clients too.\r\n\r\n\r\nNikolas Hulewsky (27:43.202)\r\nWell, and what's interesting too is like you have the assessment, which is rad, but I also think that there are different things that are important to different organizations. I mean, that's what core values are, right? Are you able to tailor it where it's like, Hey, here we really find punctuality to be incredibly important. So please weight that heavier. Or is it just, I know that that's more important to me. And so I'm going to look for that on the output from the assessment.\r\n\r\n\r\nBrandon Vaughn (28:12.139)\r\nYeah, so what the cool part is, some of the larger organizations that we work with, we can make complete custom benchmarks specifically to them.\r\n\r\n\r\nSo interviewing their employees, having all their employees take the assessments, going through, finding out like kind of what that benchmark looks like that's just right for them. And then we can load that in. you if you want to find someone that's really good core value fits, or there's certain things that just are, you know, the sales team, the sales organization really values, those things can be added in as well. So it's really customizable, which is neat.\r\n\r\n\r\nNikolas Hulewsky (28:43.95)\r\nHmm.\r\n\r\n\r\nWell, I think what's cool about this is I think for everybody, anybody who's managed people and who at least like learns from it, you kind of go through three phases. The first phase is just the pulse test, which is, do you have a pulse? Well, I need somebody. Okay. You have a pulse. Cool. You're hired. This, the second phase is like, you realize the pulse test doesn't work. You no longer say, they were a terrible employee or they were a bad hire. And you recognize like, I did a bad job. I should probably fix this. So the second phase is like,\r\n\r\n\r\nYou're more clear. You ask better questions in that interview where you're like, OK, well, what was your background? How did you do that? And then the third phase, in my opinion, is you have it's not a working interview, but you actually see their output. Maybe you give them a quiz or maybe you ask them to do some function of the job that they're going to be doing because you don't ultimately know what that might look like. What's interesting about this is like.\r\n\r\n\r\nHe kind of gets you in between levels two and three right away because it's already asking them the questions so you can just jump into the conversation. You don't have to spend a ton of time asking them all the background information so you can get a feel for them. You're just in the thick of it you're like, OK, cool, Here are the things I find most important. Let me see how you operate it. So it eliminates a lot of the time talking right?\r\n\r\n\r\nBrandon Vaughn (30:04.459)\r\nThat's the biggest thing. Yeah. If you just think about, you know, reducing the amount of time that an owner or someone on the team has to, you know, focus on for like, you know, up to 80 % of their time and just eliminates that and prioritizes who you should be talking to. We still want the human in the loop component of it. Like you don't want to get rid of that because these are going to be people that you're going to be bringing in and working alongside you and your culture and everything else. So\r\n\r\n\r\nIt just drastically, drastically reduces the time and the errors.\r\n\r\n\r\nNikolas Hulewsky (30:36.44)\r\nWell, especially for small businesses, home services businesses, you don't have a full HR team. You don't have a department that's like, I got 50 applicants. You know what happens when you have 50 applicants and you're running your small business? You look at the applicants, probably the first five, and you don't look at the other 45 because you're like, I don't have time and it sucks. But how do you even sift through those? so you end up getting to the first five and then you hire somebody.\r\n\r\n\r\nBrandon Vaughn (30:55.723)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (31:07.02)\r\nI agree with you is always a problem. How do I get quality? How do I get applicants who are coming in? How do I then qualify them in a way where they're actually going to work out? Because in my experience, no matter how good you vet them, it still is a coin flip sometimes. Like you still don't fully know how they're going to turn out.\r\n\r\n\r\nBrandon Vaughn (31:27.021)\r\nAnd I think the biggest miss where a lot of people have in recruiting is because it is a a marketing problem to solve. The messaging to go out and find those individuals is not really thought through enough. It's like, Oh, you must have a clean criminal background. must have a driver's license. You must be able to lift 60 pounds. And it's just so vanilla. And the reality is that the people that you get even at the top of funnel along that approach is, is so vanilla.\r\n\r\n\r\nAnd the goal really, I mean, even if just your listeners do nothing else except just think through like a marketer, hey, what's a tougher sell convincing, you know, someone to come and buy a garage floor or convincing another human to spend more waking hours than they even spend at home with their own families working inside of this job with this career with us as a boss, you know, like this is being there. Like it's way harder to convince another human to do that for years.\r\n\r\n\r\nNikolas Hulewsky (32:20.312)\r\nYeah. Yep.\r\n\r\n\r\nBrandon Vaughn (32:21.809)\r\nBut we don't put enough thought, energy and effort into the marketing and sales process of telling someone what the opportunity is. Yeah.\r\n\r\n\r\nNikolas Hulewsky (32:26.574)\r\nhave a business idea. I have a business idea for you. And you might be already doing this, so I'm sorry if I'm preempting it. When you're bringing on customers, or you have customers who are potentially interested and they're going to post job postings, I now use ChatGPT to write my job postings because it knows me so well. But if you created a custom prompt and were like, hey, business owner, put this into your ChatGPT and then give me the output.\r\n\r\n\r\nyou could start tailoring those job descriptions to the job owner. So for example, if I'm posting, I'm like, hey, I'm looking for an assistant, chat, you write me a job description. It's going to be like, okay, you need to be able to follow up with Nick and be okay with the schedule changing frequently. know, inappropriate jokes, not sexual harassment, just, you know, jokes that a 12 year old would make. But it tailors a job description that's like me, they're going to know me. So I'm attracting the right people right away.\r\n\r\n\r\nBrandon Vaughn (33:16.279)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (33:25.058)\r\nDo you do anything like that to like?\r\n\r\n\r\nBrandon Vaughn (33:26.797)\r\nYeah, that's exactly what we do. So we have, yeah. So as part of our onboarding process, we sit down and we interview the business owner and we actually load all that into our, our platform. So we have the full system prompt that outputs and then we'll post three different job ads. We'll split test them. We'll see which one's the better performer.\r\n\r\n\r\nNikolas Hulewsky (33:29.327)\r\ndang it.\r\n\r\n\r\nBrandon Vaughn (33:47.243)\r\nAnd then we optimize for it continually. So yeah, we write the job ads, we post the job ads, we monitor the performance of them. We look at the hooks, we look at click-throughs, we look at, you know, funnel applications, cost per applicant, cost per employee, and we optimize all that. So our model has just gotten more more and more more more intelligent to knowing exactly what gets people brought in to a funnel that actually perform well on a job.\r\n\r\n\r\nNikolas Hulewsky (34:10.222)\r\nYou know what I've also started doing is recording my interviews where it's like, cause I don't want to be sitting there and just, okay, pen to paper and like, that's an interesting, you did that? cool. Okay. Well, like I want to be able to have a conversation with them. And then I go back and ask the questions like, well, was there specific experience requisite for this role and like have AI sort of have a conversation with me? Are you doing any of that? Are you recording any of the conversations?\r\n\r\n\r\nBrandon Vaughn (34:15.467)\r\nYeah.\r\n\r\n\r\nBrandon Vaughn (34:22.349)\r\nI know.\r\n\r\n\r\nBrandon Vaughn (34:36.449)\r\nYeah, yeah, we record the interviews, we give transcriptions, we summarize it, we talk about red flags that were mentioned. Yeah, we do all that too.\r\n\r\n\r\nNikolas Hulewsky (34:45.326)\r\nDude, okay, man, this is now starting to sound like an infomercial, I'm sorry. Okay, so I'm gonna pivot to one thing. I do like hire bus. There's a saying, it's like, do you have the right people in the right seats on the bus? And you you had like you said, the right seat assessment. So it's, you know, it's important that you don't only have the right people on the bus, but they're in the right seat. So I like the hire bus thing.\r\n\r\n\r\nBrandon Vaughn (34:50.327)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (35:13.742)\r\nBut also dude, you're a hustler and you are obsessed with AI as are many of our listeners. Can you show me you talked about you created this internal app to do some marketing and business development and I know this is like totally separate from hire bus but. I'd like that you're constantly thinking like hey, how can I use these tools for my own benefit? That's why you built hire bus. What's this tool that you've built to to market?\r\n\r\n\r\nBrandon Vaughn (35:42.263)\r\nSo the biggest thing that I have been just kind of obsessed with is a lot of these different marketing campaigns of getting in front of customers, they historically would feel very generic. Like if you're gonna send a postcard campaign out to a bunch of homeowners to talk about garage floor coatings, like you're gonna design a postcard and then you're gonna send like that postcard out. But now with what you can build with AI and you can build.\r\n\r\n\r\nautomation tools and these types of things that kind of like exist, you can create really, really customized bespoke options. So I'm going to share kind of one view of what this looks like of what we're doing for wise coatings. So this is in essence, what it looks like. So this photo that you see here gets captured off of their Google street view.\r\n\r\n\r\nSo there, you know, we have the database of all of our homes that's publicly available. That's really easy to kind of target, but then it'll capture the front of their home. It'll place it on this postcard. It'll create a dynamic video with me talking to them. And this is all AI talk.\r\n\r\n\r\nNikolas Hulewsky (36:49.986)\r\nWait, wait, wait, wait, wait, wait, wait,\r\n\r\n\r\nBrandon Vaughn (36:54.221)\r\nto this QR code. Yes. So this QR code, it's a dynamic QR code that will pop up. And then when they scan it, says scan here to watch the video recorded for you. takes them to a landing page. We can track click throughs. can track conversions, et cetera. But then that video basically is like, know, Hey, my name is Brandon with wise coatings. I know you don't know me. It's probably really weird to get a picture of your house delivered to you on a postcard.\r\n\r\n\r\nNikolas Hulewsky (37:08.59)\r\nWhat the\r\n\r\n\r\nBrandon Vaughn (37:21.609)\r\nThis is literally just you though. This is one of the tools that we use, you know, just to kind of introduce ourselves to neighbors. We were next door working at one of your neighbor's homes and wanted to just kind of get your attention and tell you a little bit about what we do. you know, one of the things that, and then we just kind of like launched into the pitch. So it's just a, it's a dynamic video. And when you think about like the possibilities with anything you can imagine on marketing campaigns, et cetera.\r\n\r\n\r\nNikolas Hulewsky (37:38.402)\r\nWhat?\r\n\r\n\r\nBrandon Vaughn (37:51.309)\r\nIt's really limitless, especially, I mean, can recolor a house now using chat GPT. You can put Christmas lights and have it be at night on a house. So all these different things, I have about a billion different app, app ideas. This is the problem about more you work with AI and you're a creative is that you come up with so many ideas you can't execute on all of them. But, uh,\r\n\r\n\r\nNikolas Hulewsky (37:56.706)\r\nDude, that would be so interesting or.\r\n\r\n\r\nNikolas Hulewsky (38:03.212)\r\nYes.\r\n\r\n\r\nBrandon Vaughn (38:15.401)\r\nit is as much as people can learn how to use tools like super base and eight and you know, Vercell v zero lovable replicates, everything.\r\n\r\n\r\nNikolas Hulewsky (38:27.128)\r\nWell, dude, me share this with you. This is a little bit embarrassing, but I'll just share it real quick. All right, so I took these pictures of my front yard and it was like, it's a mess out here. It's not good, right? I'm like, I don't even know where to start. It's just totally out of control, overgrown. And so I'm like, here's some pictures of the same area of my front yard. It feels out of control. It's literally what I said.\r\n\r\n\r\nBrandon Vaughn (38:41.825)\r\nI love it, yeah.\r\n\r\n\r\nyou\r\n\r\n\r\nNikolas Hulewsky (38:56.984)\r\nCan you generate an image of what it could look like if I cleaned it up a bit? And so then it generates this image. I was like, yes, that would be incredible.\r\n\r\n\r\nBrandon Vaughn (39:02.241)\r\nRight? Now imagine getting that on a postcard.\r\n\r\n\r\nfor a landscape. You know, what if you think about what's possible and this is this is the cool part is that you the way you know that AI is good is when it dazzles and it wows and and it's doesn't like it's like wait what how did they do that? Like that's that's the aging part where people now are wondering you can't you can't get more highly engaged postcard view them people see a picture of their own house on a postcard. They're like wait what like\r\n\r\n\r\nNikolas Hulewsky (39:27.511)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (39:38.638)\r\nDude, I'm thinking like pressure washing companies, painting companies, new windows, new siding, roofing, solar. Dude, that, all right. Tell me what do the economics look like? Have you tested this?\r\n\r\n\r\nBrandon Vaughn (39:38.967)\r\nWe've had people call out.\r\n\r\n\r\nyeah.\r\n\r\n\r\nBrandon Vaughn (39:47.97)\r\nRight.\r\n\r\n\r\nBrandon Vaughn (39:53.601)\r\nWe have, yeah, yeah, we have tested it.\r\n\r\n\r\nit, it, crushes. mean, like the ROI on it is insane. It's, it's extremely high, is very difficult to build the street view agent because the way that the API works and some of the angles, like getting actually the house framed in and then interpolating and stuff. right now that the economic costs of how much some of these API calls costs with AI make it a little bit more on the expensive side to actually send, but the economic bill\r\n\r\n\r\nNikolas Hulewsky (40:08.046)\r\nMmm.\r\n\r\n\r\nBrandon Vaughn (40:25.897)\r\nout as far as like no one else no one else does this in the planet right now to my\r\n\r\n\r\nNikolas Hulewsky (40:26.382)\r\nBut that's a custom app for you. You made that custom app for yourself.\r\n\r\n\r\nNikolas Hulewsky (40:32.11)\r\nAll right, so either you could sell it or somebody who ends in home services could build their own version of the app, but.\r\n\r\n\r\nBrandon Vaughn (40:38.379)\r\nYeah, they should. They should build it. Like, you know, like that's a beautiful thing about what can exist.\r\n\r\n\r\nNikolas Hulewsky (40:41.804)\r\nWha-\r\n\r\n\r\nDo you have anything off the top of your head? What percentage actually click or look at the QR code or set up a call? Do you have any metrics around that?\r\n\r\n\r\nBrandon Vaughn (40:54.029)\r\nYeah, the actual like engagement percentages is 15%. 15 % where the word. Yes, yes. Now that's not like actually generating calls. I'm just talking about they've scanned the QR code. Yes, they've scanned the QR code. Yeah, as far as actual like lead generation part of it, it's closer to like 3%, you know, which is insanely high.\r\n\r\n\r\nNikolas Hulewsky (40:57.326)\r\n15? From a postcard?\r\n\r\n\r\nNikolas Hulewsky (41:09.806)\r\nClick the QR code. What? That-\r\n\r\n\r\nNikolas Hulewsky (41:22.28)\r\nStill, 3 % sounds insane to me.\r\n\r\n\r\nBrandon Vaughn (41:23.169)\r\npeople who do postcards, people who do postcards when you start kind of seeing it, a half percent click through where it leads to an estimate is actually pretty good. And so, I mean, yeah. And there's more optimization that we can do. There's some more parts of the process, but it's crazy, man. This would have been so hard to build.\r\n\r\n\r\nOr require you have a human sit down full time just in front of a computer, you know, designing this stuff. And now that with what exists with AI agents, mean, this is a, this is kind of a vanilla use case right now of an automation compared to what's possible.\r\n\r\n\r\nNikolas Hulewsky (41:53.442)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (42:00.654)\r\nOkay, so 3 % set up a call, said. What percent convert to a paying customer?\r\n\r\n\r\nBrandon Vaughn (42:04.523)\r\nYeah.\r\n\r\n\r\nBrandon Vaughn (42:09.133)\r\n30%.\r\n\r\n\r\nNikolas Hulewsky (42:10.926)\r\nOkay, close to 1 % of all the postcards you send out turn into a paying customer. How much is a postcard?\r\n\r\n\r\nBrandon Vaughn (42:17.249)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (42:20.98)\r\nThat's how much it costs to send a postcard.\r\n\r\n\r\nBrandon Vaughn (42:23.277)\r\nwith the actual API, with the API components, like built in the API calls, the image generation, yeah, the hosting on the pages, all of it, yeah. It's about a dollar.\r\n\r\n\r\nNikolas Hulewsky (42:28.247)\r\nEverything.\r\n\r\n\r\nNikolas Hulewsky (42:33.934)\r\n$1.\r\n\r\n\r\nOkay, and how much do you make from one, on average, from a customer? You go in and coat their garage floor.\r\n\r\n\r\nBrandon Vaughn (42:43.69)\r\nAverage see is four grand.\r\n\r\n\r\nNikolas Hulewsky (42:45.432)\r\nDude, it's a money printing machine. Are you kidding me? A dollar customer acquisition cost? my camera just died. This is not good.\r\n\r\n\r\nBrandon Vaughn (42:48.556)\r\nI know.\r\n\r\n\r\nYeah. Yeah.\r\n\r\n\r\nBrandon Vaughn (42:57.729)\r\nWe broke the hardware. That's how good it was.\r\n\r\n\r\nNikolas Hulewsky (42:58.36)\r\nThat.\r\n\r\n\r\nIt's fine. It's fine. We'll keep talking because you have a pretty face. Dude, that's blowing my mind. A dollar customer acquisition costs and you're talking about a $4,000 ticket cost.\r\n\r\n\r\nBrandon Vaughn (43:12.173)\r\nWell, no, no, no, the dollar dollar is not customer acquisition cause that's how much a postcard costs. So it's a hundred dollars. Yeah. A hundred dollars, a hundred dollar customer acquisition costs against a $4,000 average ticket.\r\n\r\n\r\nNikolas Hulewsky (43:17.646)\r\n$100, I'm sorry. You're right.\r\n\r\n\r\nNikolas Hulewsky (43:25.004)\r\nStill, that's what, a 48X ROAS? Like, that's insane.\r\n\r\n\r\nBrandon Vaughn (43:28.103)\r\nYeah, it's insane. It's insane. Like Facebook, the way that I built Wise Codings at beginning was a 10x ROI benchmark. So we would spend $10,000 a month on Facebook and that would get us $100,000 a month in work. So it's a 10x ROAS. And yeah, yeah, yeah. So it's really, really powerful.\r\n\r\n\r\nNikolas Hulewsky (43:49.132)\r\nAnd this is four times better than that.\r\n\r\n\r\nNikolas Hulewsky (43:55.886)\r\nDude, that is freaking incredible. Is this the app that you built? Is that like on a marketplace or is it you're like, I'm onto this bad boy.\r\n\r\n\r\nBrandon Vaughn (44:03.821)\r\nI don't know, to be honest. mean, like right now it's just, it's just for me. I have a lot of different businesses and one of the biggest things that I have is serial startup syndrome and I have to be careful about that because it gets me into trouble sometimes. so I, I've been, I've been focused a lot more on like acquisition being my, biggest place. I have a company called Hammer and Forge and we buy electrical companies. We just bought a electrical company and we're going to do like a roll up.\r\n\r\n\r\nNikolas Hulewsky (44:24.109)\r\nYeah.\r\n\r\n\r\nBrandon Vaughn (44:31.543)\r\nkind of underneath the electrical space. And I've been trying to stick a little bit more to that as opposed to just these startups. But if I find like a really good entrepreneur that's like, want to take that idea and I want to run with it, like I'd partner with them and let them run with something. I don't do startups. Serial startup syndrome, Entrepreneurial ADD, It's a real thing.\r\n\r\n\r\nNikolas Hulewsky (44:45.624)\r\nHi, I'm Brandon and I'm a serial starter addict.\r\n\r\n\r\nI have it. I have it too. It's hard. It's hard. was just talking to somebody about this. Like there's no shortage of good ideas. There is no shortage of good ideas or opportunity. That is not the problem. The problem is time allocation. Are you good at allocating your time? So I'm in 100 % agree with you. That's really hard for entrepreneurs, especially when they see an opportunity to not chase it down.\r\n\r\n\r\nBrandon Vaughn (45:06.039)\r\nThat's right.\r\n\r\n\r\nBrandon Vaughn (45:15.233)\r\nTime's the ultimate currency and the wealthy will trade their money to create time and manufacture time. Wealthy think about collapsing of time rather than like, how do I make a million dollars? It's like, no, how do I make a million dollars in like a minute? Because a fry cook at McDonald's will make a million dollars over the lifetime of his career as a fry cook at McDonald's.\r\n\r\n\r\nbut wealthy don't think in terms of money. It's just like, okay, how could, you know, collapse this down into a certain timeframe. And that involves, okay, I want to spend money over here to get the right team, the right people. want to pay an agency to come in and do this work. I don't DIY my own Facebook ads. don't DIY my SEO stuff. Like I work through people. And the more you kind of work on that delegation exercise, that muscle,\r\n\r\n\r\nI think the lot more effective you become an added and effective delegator. And that's what ultimately buys you back more time. It took me years to get better at that. And I'm still working on it every day. But to me, like that is the key to be able to be a successful entrepreneur is that the ability to be able to delegate and tee people up for success.\r\n\r\n\r\nNikolas Hulewsky (46:25.39)\r\nBrandon, this is freaking amazing. Where's the best place for people to come find you?\r\n\r\n\r\nBrandon Vaughn (46:30.067)\r\nIf they go to hirebus.com slash Nickonomics, actually will have a gift for them. So speaking of, know, setting people up for success, if you're in home services and you want job descriptions, role blueprints, we have a packet that's for your industry, specifically every single role blueprints of every role that kind of exists in a home service business doing up to 20 million in revenue. And you can see like, you know, specifically how much\r\n\r\n\r\nrevenue or what their roles or responsibilities will look like for that given role. So if you go there, we'll send you that over. No strings attached. Just send you an email with a Google drive link that you can just download and customize for yourself. And then if you're interested in having us hire someone for you, let us know too. Hope you out.\r\n\r\n\r\nNikolas Hulewsky (47:11.085)\r\nlover.\r\n\r\n\r\nNikolas Hulewsky (47:14.816)\r\nAwesome. All right, Well, I can't wait to check in with you in like a year and see how your kingdom looks. It's gonna be rad. Yes, sir. Yes, sir. All right. We'll talk soon. Stay on.\r\n\r\n\r\nBrandon Vaughn (47:21.133)\r\nWe got checking a lot sooner than that. But yeah, it's great talking to you. I haven't been on. Awesome. All right, see ya.",
  "metadata": {
    "duration": "",
    "date": "2025-07-14",
    "platform_source": "Google Drive"
  }
}