{
  "episode_number": "126",
  "episode_title": "SMB M&A Secrets: Navigating Small Business Acquisitions with Eric Pacifici",
  "guest_name": "Eric Pacifici",
  "business_name": "SMB Law Group",
  "transcript": "﻿Nikolas Hulewsky (00:01.134)\r\nAll right, so I'm gonna start by telling a story because it's one of my favorite stories and you can't guess who it is until the end. But in 2022, a young man was having a hard time. Like many of us, he was in the middle of lockdowns trying to figure out what to do with his life. He was an attorney, he was an associate at a large law firm and he started posting content to Twitter about deals. And at the time he was anonymous and I thought he was posting some really good content. So I messaged this anonymous person.\r\n\r\n\r\nEric Pacifici (00:04.975)\r\nAlright.\r\n\r\n\r\nEric Pacifici (00:09.411)\r\nOkay.\r\n\r\n\r\nEric Pacifici (00:19.971)\r\nGosh.\r\n\r\n\r\nNikolas Hulewsky (00:30.316)\r\nAnd I just was like, hey man, love the content. It's fantastic. This was back in 2022. He had, I don't know, less than a thousand followers, somewhere in the ballpark. And we stayed in touch and I watched this young man work his way up. He kept tweeting, he kept amassing more followers. Pretty soon he dropped the Anon status. Then he founded a law firm. And from his tweets and the audience that he built, this law firm has done over a billion dollars in transactions. It's helped hundreds of people.\r\n\r\n\r\nEric Pacifici (00:30.696)\r\nhuh.\r\n\r\n\r\nEric Pacifici (00:39.599)\r\nAlright.\r\n\r\n\r\nNikolas Hulewsky (01:00.12)\r\nget into their first businesses. And it's just growing more and more. I think at this point, they've got dozens of associates around the country. They are literally the preeminent law firm doing mergers and acquisitions. There's nobody who does more SMB transactions than this law firm. I want you to guess who that was. And you would be correct. It's Kevin Henderson. Kevin Henderson founded the SMB Law Group.\r\n\r\n\r\nEric Pacifici (01:16.963)\r\nWell, yes, yes, yes.\r\n\r\n\r\nEric Pacifici (01:23.363)\r\nNo, for sure. Shout out to Kevin. Kevin is fantastic. I do want to just clarify a couple of things. One, billion dollars in enterprise value, right? Not revenue, a billion dollars in value of businesses acquired by our clients since 2022. that does not include busted deals. That's closed transactions. And honestly, at this point, it's potentially multiple billion that we've worked on. So it's been really fascinating.\r\n\r\n\r\npreeminent law firm that's those are your words, not mine, but in SMB, right? There are amazing law firms like my, I'm an alumni of Kirkland and Ellis. think they're, they're the best and a law firm on the planet. They do the a million dollar billion deals. If I was trying to do a hostile takeover, the Walt Disney company, I'm going and hiring Kirkland and Ellis, Cravath. You're not hiring SMB law group. but we, we, we are,\r\n\r\n\r\nNikolas Hulewsky (01:57.155)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (02:05.71)\r\nMm-hmm.\r\n\r\n\r\nEric Pacifici (02:20.819)\r\nYou know, there's not many people like us in lower, lower middle market &A, right? And I think if you flash forward a couple years, you know, I think that we will be our own thing and there will be some competitors. But what's fascinating about the law is most lawyers have practices. They do not have businesses, right? We are a business.\r\n\r\n\r\nNikolas Hulewsky (02:25.825)\r\nNo.\r\n\r\n\r\nNikolas Hulewsky (02:37.038)\r\nWhat do mean you'll be your own thing?\r\n\r\n\r\nEric Pacifici (02:49.421)\r\nWe are built like a business that you would want to acquire, Nick. That's our goal. Let's build something that is scalable, repeatable, that, you know, isn't a mile wide and an inch deep. It's built like a high quality small business, which is awesome because that's what our clients are trying to do. Also, they're trying to buy and build high quality small businesses. And so I feel like we relate to and receive back from our clients.\r\n\r\n\r\nvalue like no other lawyer does. know, most lawyers are trying to bill a few hours and then move on. That's my perspective.\r\n\r\n\r\nNikolas Hulewsky (03:29.506)\r\nYeah, I think the other thing that's really interesting and the reason I said the billion dollar number and again, you've probably worked on more transactions than a billion dollars. Anybody who's listening to that that doesn't have context is like, I don't know if they're working on hundred million dollar deals. That could be like one or two deals that did a billion dollars in transactions. But what we're talking about is SMB space. Most, the vast majority of your deals are $10 million or below, fair?\r\n\r\n\r\nEric Pacifici (03:53.901)\r\nYeah, two to $25 million range, but our median deal is like 4 million bucks. You know, these are people who are buying subscale businesses, you know, businesses that are just beginning to be valued by EBITDA, not by SDE in most cases.\r\n\r\n\r\nNikolas Hulewsky (03:59.533)\r\nYeah. So you take.\r\n\r\n\r\nNikolas Hulewsky (04:10.126)\r\nHow many transactions have you guys done since you started?\r\n\r\n\r\nEric Pacifici (04:13.709)\r\nI don't have that number in front of me. I think it's somewhere in the couple hundred range. I think last year was like 113 and the year before that was like 93.\r\n\r\n\r\nNikolas Hulewsky (04:22.368)\r\nWell, and the reason I like your perspective is because it's not just two or 300 done in Florida. It's two or 300 done across the entire country. So you also have insights into what's going on even in different markets or what's just going on generally amongst buyers across different markets. So the reason I say preeminent is because there is nobody doing it at your scale. There's no one who's done as many transactions as you have done. And so you've like had to systematize the deal templates.\r\n\r\n\r\nEric Pacifici (04:31.503)\r\nYeah.\r\n\r\n\r\nEric Pacifici (04:40.684)\r\nand\r\n\r\n\r\nEric Pacifici (04:51.791)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (04:51.918)\r\nYou know, how to help buyers get in the frame of mind of what's important in structuring the deal. I know you've got some affiliation with the boot camps. We're actually getting them ready to buy the business by going through due diligence, et cetera. Like you said, you've built a business and you've actually systematized it. How many associates do you have on your team now?\r\n\r\n\r\nEric Pacifici (05:12.675)\r\nWell, so we're licensed in New York, Florida, Texas, California, Colorado, Michigan, Minnesota, North Carolina, Georgia, Massachusetts, Illinois. So most of the states where people want to be now, we have had the ability to do deals in other places as well. So we're not all 50 states licensure, but most states give you the ability and other ethics rules to participate. If you know, sometimes you need supervision, sometimes you just need to not hold yourself out or not establish a systematic presence.\r\n\r\n\r\nNikolas Hulewsky (05:23.566)\r\nI guess.\r\n\r\n\r\nEric Pacifici (05:41.391)\r\nWe do, we have done deals in almost every corner of the, of the country, which is fantastic. Um, associate wise, we only have a handful. We have about 15 total lawyers. We've got some contract lawyers on our team. We've got, um, some partners, we've got some true associates. so, um, but, but most everybody is top 14 educated, big law trained, you know, really experienced MNA attorneys. It's not, uh, you know, most of our competition or most of the people that we are doing deals opposite of.\r\n\r\n\r\nNikolas Hulewsky (05:57.262)\r\nWow.\r\n\r\n\r\nEric Pacifici (06:11.199)\r\nare, you know, Main Street lawyers, right? They're not &A trained, you know, elite educated attorneys. So it's a fascinating thing.\r\n\r\n\r\nNikolas Hulewsky (06:19.906)\r\nTell me, this is my favorite story. Tell me the story about who the hell is Kevin Henderson.\r\n\r\n\r\nEric Pacifici (06:24.067)\r\nYeah. So there's a part two to it coming too, because so Kevin Henderson, my principal partner, he's one of two people that I founded the firm with along with Sam Rosati, who is also very well known in the space. Fantastic. But Kevin is in Dallas, Texas. And I worked with Kevin in my prior life. We decided to start the firm together. And in 2023, our first full year of operations, according to the Texas law book,\r\n\r\n\r\nhave enclosed more worked on and closed more &A transactions in the state of Texas than any other attorney, which includes the elite firms, includes the Kirkland Ellises, the Gibson Dunn and Crutchers. Now it's a different thing, right? know, Rob Little at Gibson Dunn, who's doing private equity &A, you know, he's doing much larger deals. Kirkland Ellises is doing much larger deals. So it's, you know, that's the, obviously the elephant in the room, but nonetheless, he closed more &A transactions than anybody else.\r\n\r\n\r\nAnd when the Texas law book ran the numbers and saw the table, the guy literally was looking at it and he said out loud, one of the two editors, said, who the hell is Kevin Henderson? And so they wrote the article and the article was titled, Who the Hell is Kevin Henderson? And we had a Who the Hell is Kevin Henderson party for him being the number one &A attorney in Texas by deal count. And it's fascinating because we've continued to grow and obviously we closed more deals in 2024.\r\n\r\n\r\nNikolas Hulewsky (07:47.854)\r\nAmazing.\r\n\r\n\r\nEric Pacifici (07:52.367)\r\nthan we did in 2023. Well, the market actually, the M &A market actually pulled back in aggregate deal number in 2024. I don't know. That could be that some of these lawyers on the list did more and everybody else did less, but we don't know yet, but the overall pool of closed deals got smaller, but Kevin did more in 2024. did two roughly, according to the numbers that we have, we did roughly 2.2 % of all closed M &A transactions in the state of Texas that were reported.\r\n\r\n\r\nObviously there are probably many that were not reported. So really cool. mean, that's cool. mean, to think that, yeah. it's, you know, lot of our former Kevin and I's big law background is in Dallas and Houston. It's in Texas. So a lot of the people that were on that list are, you know, our mentors and people we'd worked for. And so to see Kevin's name was a really cool moment.\r\n\r\n\r\nNikolas Hulewsky (08:24.193)\r\nWow.\r\n\r\n\r\nThat's amazing.\r\n\r\n\r\nNikolas Hulewsky (08:45.26)\r\nHow of those deals did Kevin work personally and how many those were worked on by an associate? Did he work on all of them? I don't know how it works. I don't know.\r\n\r\n\r\nEric Pacifici (08:51.587)\r\nWell, all of them. Yeah, yeah, all of them. don't, we're not a shop that, that, you know, brings work in and just hands it off for two to see everyone that was reported he worked on. so we don't, you know, we don't do the thing. We don't bring it in and say, Hey, you know, it's only a $4 million deal, Nick. So it's not a big deal. So I'm just going to give it to Gary the second year and good luck everybody. I'll be off, you know, tweeting or whatever. That's not the case, right? Because our ethos is\r\n\r\n\r\nNikolas Hulewsky (09:01.102)\r\nMm.\r\n\r\n\r\nEric Pacifici (09:17.895)\r\nAnd why we exist is that, you know, there's lots of good &A attorneys for $500 million deals, right? Lots of them. They're very expensive. They know &A. There are almost none. If you look at the backgrounds, even the ones that are branded SMB and have followed in my footsteps, know, kudos to them. If you dive into their backgrounds, you know, many of them are, we're prosecutors or we're litigators or, now they've seen the opportunity in the space. And so there's very few real &A attorneys that are doing these deals that have &A training.\r\n\r\n\r\nAnd so that's been part of our ethos that like, Nick, if you go buy a $4 million business, two, three, $4 million business, if I go buy a two, three, $4 million business, I got little kids, like that's a big, excuse me, like it was a big fucking deal, right? Like it's a big fucking deal for a to go buy a two, three, $4 million business. And he should have counsel that is reflective of that, not a M &A attorney that, you know, hands it off to Gary the second year and checks out or a Main Street guy that.\r\n\r\n\r\nyou know, doesn't eliminate all.\r\n\r\n\r\nNikolas Hulewsky (10:18.19)\r\nI think it's a bigger deal than most even traditional search funds, right? Like the digital search fund, they're gonna get out of school, they're gonna raise some money, they're gonna go buy a business that's doing, I don't know, at least $20 million in top line and they're gonna try to roll it up. They're not signing a personal guarantee. They're not putting their house on the line, right? So like the $4 million deal is a bigger deal personally, even though the top line revenue number doesn't necessarily reflect. Didn't they change the rules on reporting because of Eric or because of Kevin?\r\n\r\n\r\nEric Pacifici (10:39.363)\r\nHuge deal.\r\n\r\n\r\nEric Pacifici (10:45.283)\r\nWell, so they've created new categories. So they're now going to be categorically say like, and I don't know what the split is, but it's what I acknowledged in the first, if you're doing billion dollar transactions, obviously us doing more $4 million deals than you did in billion dollars, those are two different things. So it makes sense, but it's cool to know that we forced them to change the categories and shout out to the guys at the TechSlawBook. They've been fantastic. They're really nice guys. came to the Kevin Henderson party and\r\n\r\n\r\nNikolas Hulewsky (10:49.132)\r\nNew categories, okay.\r\n\r\n\r\nNikolas Hulewsky (10:54.956)\r\nYeah, yeah, yeah.\r\n\r\n\r\nEric Pacifici (11:14.765)\r\nTruly great guys that run a great business. So I think that's amazing.\r\n\r\n\r\nNikolas Hulewsky (11:17.464)\r\nSo walk me through, I've never done a hundred million dollar deal. So I don't know what those deals look like, but in my experience from 50 million all the way down to a few hundred thousand, the amount of work that our attorneys do is kind of similar. I don't know about the total number of hours. It's definitely more on the bigger deals, but you still have to have the same components in every deal that you go through. How have you been able to systematize, I guess the process like\r\n\r\n\r\nIs Kevin just working 120 hours a week or how is he able to do, how are you guys able to process so much deal flow?\r\n\r\n\r\nEric Pacifici (11:53.549)\r\nYeah. Well, so the premise is a little bit off in those larger deals and we've worked a hundred million dollars. I've worked on multiple billion dollar deals for Amazon and Jerry Jones and folks in those deals. You're negotiating the hell out of everything. The LOI, you're going back and forth on LOI for weeks, right? Small business, you're not doing that. You're not going back and forth as much. There is a lot of negotiation on Main Street though, but it's different, right? And the problem is most of time you're opposite of sellers council that don't know &A.\r\n\r\n\r\nAnd they come for crazy stuff. So a lot of what we've had to troubleshoot over the last couple of years is how do you overcome them asking for, you know, a confession of judgment or, know, multiple personal guarantees or a lease assignment or asking that the non-compete falls away if you default on the promissory note or on and on and on all these little things that will kill your deal. so actually a quick plug, we took three years worth of busted deal data and baked it into a new LOI.\r\n\r\n\r\ntemplate for 2025, both asset and stock. If anybody wants that that's listening, just reach out, happy to share that. It's got a lot of footnotes and qualifiers. And our goal now is to help buyers address all of those little traps for the unwary upfront. So your deal is less likely to die and will close more quickly. But it's a lot of little stuff like that. And also one of the biggest issues is you can go hire Kirkland and Ellis to do your $4 billion deal,\r\n\r\n\r\nThey're not well suited for the deal. They're not well suited to negotiate opposite of a family business, right? They're going to negotiate the hell out of stuff that the, it doesn't matter. And that they don't, you know, care about, right? And they're not, they're not going to have an appetite to have multiple red lines going back and forth and people dying on Hills over indemnification, but also SBA debt, right? Most of the transactions are funded by SBA and SBA is an amazing product. Everything except for the personal guarantees, an amazing product. It's very high.\r\n\r\n\r\nNikolas Hulewsky (13:32.28)\r\ndoesn't matter.\r\n\r\n\r\nNikolas Hulewsky (13:37.39)\r\nMm-hmm.\r\n\r\n\r\nEric Pacifici (13:53.135)\r\nleverage debt, it's covenant light. It's relatively easy to get in substance. The process is a nightmare and their lawyers are going to comment on the documents and get involved in the process. We've done so much of it now that our templates, when it comes through Live Oak or one of these other banks, most of the time they go, oh, hey Eric, great to see you again. And send me the documents when they're executed and thanks for covering up all the SBA stuff up front.\r\n\r\n\r\nNikolas Hulewsky (14:20.898)\r\nYeah, because there are are SBA specific as in the government organization, the Small Business Administration specific, but then each bank also has their interpretation or their standards and requirements that they want to have. it has to be in the purchase agreement. Like it has to be in the deal in order for them to lend. Right.\r\n\r\n\r\nEric Pacifici (14:40.323)\r\nYeah, and what happens process wise too is that the bank does not bring in their lawyer to the three yard line. They're not gonna take you seriously until you're very, very late. So if you have a bunch of stuff in the LOI that you can't do, and then you have a bunch of stuff in the purchase agreement that you can't do, and the seller believes that they're gonna stay on for three years and that the node and all this different stuff, and then you get to the point where the deal becomes, everybody gets deal fatigue down the stretch. Everybody, every deal, you get to that point where they're like,\r\n\r\n\r\nwhat the fuck's going on? When are we going to close? Right. If you get to that stage and then the bank slur comes in and goes, Hey, I know you thought you were getting that working capital adjustment or that personal guarantee or this carve out to the non compete or that you weren't backstopping indemnity or that you were going to stay on for three years in an asset deal, but you can't do that. And then you got to go back and renegotiate to the at that stage. That's a really bad recipe. So that's part of our, secret sauce is that we've just done this so many times now that those\r\n\r\n\r\nNikolas Hulewsky (15:30.968)\r\nMm-hmm.\r\n\r\n\r\nEric Pacifici (15:39.065)\r\nthings stop, they've stopped happening, you know, or we're able to tell the buyer upfront that like, listen, this is almost certainly going to be an issue. So make sure you are communicating that and foreshadowing it to the, the cell, to the seller. they're not blindsided.\r\n\r\n\r\nNikolas Hulewsky (15:52.654)\r\nYour point about you never know who the seller's counsel is across the table is so true. Although I do know every time I'm working with an attorney who's got a real estate background, because when I'm submitting the LOI and we're talking about going into due diligence, they're like, we can't do due diligence until we have a signed contract. I'm like, what are you talking about? Well, you've to have the signed purchase agreement. I'm like, you're a real estate attorney, aren't you? Because they don't move forward with any of that stuff until they've got their signed\r\n\r\n\r\ncontract and and then they go and work through all the stuff and due diligence and there is still some back and forth but That's always a flag for me. I'm like, okay, you know real estate great. This is gonna be fun\r\n\r\n\r\nEric Pacifici (16:31.875)\r\nYeah, and they conflate inspection periods with, you know, in earnest money deposits and you've got this amount of time to diligence. It's just a very different thing, right? Like when you're buying a dynamic organization with people and contracts and employees and skeletons in the closet, a lot different than sending an inspector out there to spend six hours kind of looking at the foundation and the attic and the roof and, and, and then, you know, making judgment calls. It's a\r\n\r\n\r\nNikolas Hulewsky (16:38.126)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (16:54.594)\r\nYeah. Yeah. Last thing I'll say on that point in particular, if you're doing a deal, get an attorney who does deals. Don't get the family friend. Don't get your, like, I have two brothers who are attorneys. One's a real estate attorney and one is an entertainment attorney. They're not writing my purchase agreement. Like I can get counsel from them. They can give me advice, but don't go to people that you just know. Like, they're an attorney. They're a family office. They can go ahead and do this deal. Like get someone who has actual deal experience because it will, I mean, it will ruin you potentially if you don't have someone who knows what they're doing.\r\n\r\n\r\nEric Pacifici (17:25.111)\r\nYeah. Well, yes. And I'm biased, right. But also financial diligence, right. Go hire a QE expert who specializes in, you know, that level of purchase price and that level of business, you know, 10,000, 20,000, 30,000. I don't give a shit as long as they're going to identify stuff. the one of the best things that can happen in your deal is that they suss out problems in advance and your deal dies because otherwise you're living with it for multiple years. And that's going to be a horrible, incredibly difficult thing to over.\r\n\r\n\r\nSo, you know, I'm biased like asking a barber if you need a haircut. But when we talk about business buying, because people are, you know, they're critical business buying all the time and they pull these statistics and yada yada. But I characterize it as blue chip entrepreneurship through acquisition. Entrepreneurship through acquisition is kind of the term of art in the schools and all that. But it's different than if you're going to go buy the local, you know, Greek restaurant, you know, and take a wild risk on a very poor\r\n\r\n\r\nquality small business and have to work it all day, every day. mean, the buyers that we have are buying businesses that are 750,000 to 1.5 in earnings. They've got barriers to entry. They're smart businesses. They're running them through sophisticated SBA lenders that look at, you know, thousands and thousands of deals. They're doing quality of earnings with sophisticated financial accountants, and then they're hiring an experienced transactional attorneys. And so when they're getting those deals done, the failure rate,\r\n\r\n\r\non those deals, it happens, it's entrepreneurship. I'm not going to say it doesn't happen, but it's vastly different than compacting all this buy sell buying statistics into one basket and drawing conclusions.\r\n\r\n\r\nNikolas Hulewsky (19:01.55)\r\nIt's true. It's true. I posted something the other day that was like, if you're your first business, you need to do at least one of these three things. You need to hire a coach, do a bootcamp or pay for a course. I fully believe that because you need to understand soup to nuts, how the deal process works. And then I started getting some comments that were like, wow, actually you need to pay for a Q of E and actually you need to have an attorney. It's like, that's table stakes, man. Like I'm not saying that's a Q of E. If you don't do it, like you have to do that.\r\n\r\n\r\nif you want this thing to be successful. A competent attorney, you have to do that in order for this thing to be successful. I would even pay for consultants to come in and look at your insurance, have your attorneys come in and look at your contracts, not just writing the PSA, but the contract, but actually looking at the contracts that you have with customers. Like spend the money upfront, otherwise you're going to pay for it on the backend. I didn't believe that the first time that I did a deal and I got lucky, but every deal that I've done since then, I pay the money upfront.\r\n\r\n\r\nEric Pacifici (20:00.643)\r\nYeah, yeah. And some courses are better than others. But I agree with that. And what we've seen too, after closing deals, is we quickly realize like, papering up these deals is not enough, right? Papering up these deals is not enough. you know, our business, the reputation of our business, the health of our segment, sector is going to depend on the success of our clients, right? And so after seeing every issue under the sun, because every deal has an issue, working capital, sellers that compete, assets that they walk off with.\r\n\r\n\r\nemployee issues, key manage, everything, insurance, every issue. You know, we have transitioned to now being kind of that medium term support for people post-closing to not just, you if you want to go find a piece of paper to do your deal, you can find a piece of paper to do your deal. And if you're doing like a sub million dollar, you know, deal by a $600,000 bait and tackle shop and you, it blows up and you can recover, you know, that's great. Take the risk. But if you're buying a $3 million business and you're an average person, that's going to destroy.\r\n\r\n\r\nNikolas Hulewsky (20:41.532)\r\ninteresting.\r\n\r\n\r\nEric Pacifici (20:59.139)\r\ndecades of financial opportunity, you gotta be thinking more, how do I make sure I'm in the best possible position post-cold?\r\n\r\n\r\nNikolas Hulewsky (21:08.024)\r\nSo is that like a fractional in-house council almost offering that you guys have now?\r\n\r\n\r\nEric Pacifici (21:10.959)\r\nYeah, it is. Yeah, it is. We offer all our clients a bunch of stuff post-closing to make sure that they are in a really strong position and that they have somebody to call, right? They have somebody to call. Most lawyers, you know, you close the deal, you hang up, call them a week later and ask for a contract and they go, I'm sorry, who is this? Nick, okay, Nick, we're gonna need you to sign a new engagement letter and you know, thank you for the phone call. I'm gonna bill you for this phone call even. And it's just not in line with the ethos of kind of making sure that the client is.\r\n\r\n\r\nNikolas Hulewsky (21:31.192)\r\nRight, right.\r\n\r\n\r\nEric Pacifici (21:38.505)\r\nsuccessful in the acquisition, not just in the transaction.\r\n\r\n\r\nNikolas Hulewsky (21:42.894)\r\nAll right, let's transition. I got some questions for you that I think would be really interesting for people to hear, especially from somebody who's done so many deals. What, let's say I'm a first time business buyer. What are the things that first time business buyers screw up the most?\r\n\r\n\r\nEric Pacifici (22:02.93)\r\nFirst time business. Well, number one, think that people are first time buyers are nervous, you know, and they don't have that level of confidence that they should have. Right. And they're very quick to lay down an acquiesce to the broker, to the seller's demands and very quick to try to gloss over a piece. Yeah. To get through. And what I tell everybody is I'm like, listen,\r\n\r\n\r\nNikolas Hulewsky (22:21.784)\r\nPeace.\r\n\r\n\r\nEric Pacifici (22:27.135)\r\nWhen you're investing multiple millions of dollars into something, you don't need to walk on eggshells. You don't need to walk on eggshells. Don't be a dick, be diplomatic and be a problem solver, but approach it unemotionally. And that's very hard to do. Elliot Hollins, once you pass LOI, it's very tough for them to be unemotional, particularly when they have the pressure of their wife saying, or our spouse saying, where are gonna live? Let's get a lease. When are we closing? Everybody's going, when are we closing?\r\n\r\n\r\nNikolas Hulewsky (22:42.488)\r\nMm-hmm.\r\n\r\n\r\nEric Pacifici (22:56.079)\r\nYou know, you got a bunch of people counting on you expecting it to happen. And so the pressure is on, but you've got to lay out in advance, like you said, your table stakes of what is, what you can and cannot live with. Right. And so if they start asking you to scrap promissory notes and put down big, you know, non-refundable or this money deposits or, you know, agree to confession of judgments, things like that, you've got to be ready to walk away from that deal. If that line gets crossed.\r\n\r\n\r\nNikolas Hulewsky (23:25.742)\r\nWhat's a confession of judgment? I don't know what that is.\r\n\r\n\r\nEric Pacifici (23:27.863)\r\nYeah. So there is a great episode of acquiring minds that highlights the danger of this mechanism. And so I would encourage everybody to Google that and go find that episode if you're serious about buying a business, because it's a good case study of what can happen for your business to actually fail. And in that episode, in that case study, the business failed primarily because of the confession of judgment, mechanism, other things happen, but it was the final, nail in the coffin.\r\n\r\n\r\nAnd what a confession of judgment mechanism is, is it says that in your promissory note, if you default, you are waiving your procedural rights to go to court and defend yourself. You are confessing to the judgment. So instead of the seller having to take the note and go, Nick hasn't paid me in three months. And when you're not paying, most of the time it's because you're going, well, I'm not paying you because there's problems, right? There's a bunch of shit going on. I think I have indemnity claims. I think I should have an offset. You're not supporting the transition like you're supposed to, whatever. Similar to this case study.\r\n\r\n\r\nbut when that confession of judgment mechanism is in the document, they can take it right to the clerk of court. They don't even have to go to court and they can put you in default. And then when they do that, they actually leapfrog the senior lender because the senior lender, the SBA hasn't even put you in default yet. And they can start freezing your bank accounts and basically implementing the judgment. And in that case, it was a construction business. They froze the bank accounts. They had to walk off the job site and the business was dead right then and there. And.\r\n\r\n\r\nIt is illegal. It's due process. It's not even allowable in New York, Florida, California, many jurisdictions, but there are states like Virginia and Maryland and others that allow this and sellers councils will ask for it. And if you don't know what it is, don't know to look for it. You get nailed.\r\n\r\n\r\nNikolas Hulewsky (25:11.022)\r\nLet me restate what you just said. I'm buying a business, it's $5 million. I can get the bank to lend four and I get the seller to finance one. Let's just assume I don't put any money down, whatever. And so I'm paying the seller. The seller's carrying a note for me. I missed three months of payments. If that mechanism is there, confession of, what do I call it again? Confession of judgment. If that's in there, they can go to the bank\r\n\r\n\r\nEric Pacifici (25:34.265)\r\nConfession of judgment.\r\n\r\n\r\nNikolas Hulewsky (25:40.536)\r\nor not to the bank, they can go to the court and say, hey, they haven't paid me on my note. I want you to freeze their accounts because they owe me this money.\r\n\r\n\r\nEric Pacifici (25:47.533)\r\nYeah, they can go get the judgment at the clerk and then implement the judgment immediately.\r\n\r\n\r\nNikolas Hulewsky (25:52.91)\r\nHow does that get past the SBA? I thought the SBA doesn't allow anybody to be in a senior position to them.\r\n\r\n\r\nEric Pacifici (25:56.907)\r\nIt should. But how SBA debt works is they have banks that lend on their behalf and then the banks are supposed to follow the SOPs, the standard operating procedures of the SBA. And if they do, then the SBA will backstop them if the deal blows up on the back half. And the banks have lawyers that review the documents and all this, but they're not ultra sophisticated and they look for very specific things. They look at the non-compete, they look at the indemnity.\r\n\r\n\r\nNikolas Hulewsky (26:14.126)\r\nInteresting.\r\n\r\n\r\nEric Pacifici (26:23.467)\r\nAnd in this case, and in many cases, they'll miss it. And if you don't have a lawyer, because oftentimes what I have to do, Nick, is I have to take the crazy stuff that the seller's council is asking for and I have to go to the bank and I have to go, Hey, do we really want to make, you know, do we really want to allow them to not backstop the note and have this carve out to the non-compete and this confession of judgment mechanism and these limitations on indemnification? Cause doesn't this seem like it's going to put all of us, and the buyer in a very weak position post-closing. then they go,\r\n\r\n\r\nyeah, you're right, Eric. And our credit committee is not comfortable with that risk. And I go, great, thank you for telling me that. And then I go back to the seller and I go, hey, talk to the bank and they're not gonna go for it. But if your lawyer doesn't know that, doesn't do enough of these deals to identify that stuff, there's a good chance like in that acquiring minds episode I referenced where it will get through and you'll be in a very bad position.\r\n\r\n\r\nNikolas Hulewsky (27:01.39)\r\nSorry, it's the bank.\r\n\r\n\r\nNikolas Hulewsky (27:15.246)\r\nOkay, so don't walk on eggshells. Be clear on your non-negotiables. What other mistakes do first-time buyers make?\r\n\r\n\r\nEric Pacifici (27:20.367)\r\nUh, not asking for enough transition services, right? And I know that I get some pushback on this. My, one of my, uh, you know, probably most useless, but most important pieces of advice is buy a good business from a good person, right? Good business, obvious, good person, not so obvious in 90 to a hundred days. It's, hard to confirm that somebody's a good person, but in 9,200 days, it's pretty easy to tell if someone's not a good person, right? And if they're a talk to their employees, talk to people who are around them, you'll figure it out pretty fast.\r\n\r\n\r\nNikolas Hulewsky (27:47.182)\r\nYeah. Yeah.\r\n\r\n\r\nEric Pacifici (27:50.663)\r\nand so, you know, you want to buy a good business from a good person and then nothing is going to save you more than having that person around for a period of time, three months, six months, nine months, a year to, tell you what you don't know, to help keep customers in place, to help keep employees in place, and provide that level of confidence. but, but buyers are reluctant to ask for that.\r\n\r\n\r\nNow, they always, are sellers always helpful to have around? Are they always productive? No. Um, we had one recently that, you know, he asked him to leave immediately, you know, because of diplomatic issues. Um, but that, that's, if you can find a supportive seller on the backend, I wouldn't, uh, met with John Mahoney who's in Eastern Tennessee was expanding. He's doing fantastic. Shout out to John Mahoney. Um, and the seller, uh, Mr. Bailey was there.\r\n\r\n\r\nyou know, a year later at the, they're expanding the facility and he was there and he said some words at the transition and you know, yeah. And it's, you know, that's great. That's great to have on your team. Buyers are reluctant to ask for that because they feel like they're, you know, going to be asking the seller for too much.\r\n\r\n\r\nNikolas Hulewsky (28:50.702)\r\nNo, that's cool.\r\n\r\n\r\nNikolas Hulewsky (28:56.493)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (29:03.49)\r\nWell, the advice I give to people when they're looking at buying a business is you've got to build a relationship with the seller. And the first conversation, like don't ask about price, just ask them about them, their business. Like get to know them and build a relationship because if you can form that now, the deal is going to fall apart two or three times. There's going to be something that comes up that is emotional and intense. And if you can't pick up the phone and call the seller to at least like talk it through,\r\n\r\n\r\nodds of the deal dying go up significantly, but also post-close. mean, with the SBA, you referenced it earlier, you can't have the seller stay on for three years. There's a defined period of time where the seller can actually stay on in a capacity where you're paying them. And after that, they're not supposed to be working in the business. So you want to be able to have a good enough relationship where even after a year, you have a customer issue and you're like, hey, Brian, this guy's being a real jerk.\r\n\r\n\r\nEric Pacifici (29:34.383)\r\nThank\r\n\r\n\r\nNikolas Hulewsky (29:57.719)\r\nTell me the story with them. You want the seller to be collaborative with you and be invested in your success.\r\n\r\n\r\nEric Pacifici (30:05.103)\r\n100%. Yeah, 100%. And if they're a good person too, it's, you know, their business is most cases is going to reflect that. It's going to be a lot more goodwill among the employees and the clients. And you're just, you're going to have a better outcome almost always.\r\n\r\n\r\nNikolas Hulewsky (30:21.614)\r\nAll right, question number two. What are you seeing right now in the &A market, specifically for SMBs, right? Like not up market, but just 10 million in revenue or enterprise value and below. What's it like out there?\r\n\r\n\r\nEric Pacifici (30:37.167)\r\nIt's, it's, there's a lot of activity. You know, I've been tweeting for a few years about the silver tsunami and people are like, ah, it's not true. You know, it's not happening. Um, you know, and Nick, it's not happening because most of these businesses aren't saleable. They're one man bands. know, they, they'll, never be sold. They should be shut down. That's true. Right. But we're talking about seven to $10 trillion, according to some estimates of assets that need to be sold. Um, there's, there's a ton of opportunity in there. Um,\r\n\r\n\r\nAnd, and even if the opportunity isn't that, you know, Hank's HVAC business is saleable. Well, when Mr. Hank shuts the door, where'd all the clients go? Right. They go to the competitors. So it's a really good time to be building a business, a really good time to be building business. And if you can just do the fundamentals, you know, answer the phone, provide good service, build a real business with a real digitized reputation. people are doing extremely well. And so we're seeing asks now.\r\n\r\n\r\nYou know, we transitioned, we did a lot of and A, we've done a lot of and A and now our clients are coming back to us with every need under the sun in general corporate and holding company and tax and buying new businesses and everything. So it's an inch to the starting lot or sorry, it's a mile to the starting line and then an inch to the second, third, fourth thing for most of these entrepreneurs. You know, there's some failure that happens and there's a lot of struggling that happens. Struggling is pretty much the ante to play for the first couple of years.\r\n\r\n\r\nNikolas Hulewsky (31:52.686)\r\nMmm\r\n\r\n\r\nEric Pacifici (32:02.337)\r\nAnd if you're paying your debt, you know, if you've got, you know, if you buy a $5 million business, I had actually one of my, one of my favorite clients, he bought a eight and a half million dollar business. he's this January was his two year anniversary and he's just always a ho homnick. It's just, everything is not going well and da da da da da. And I asked him, go, I go, you're paying your debt though. Like you're\r\n\r\n\r\nNikolas Hulewsky (32:24.312)\r\nHahaha\r\n\r\n\r\nEric Pacifici (32:29.887)\r\nyeah, yeah, that's being paid. Everything's fine on that front. I go, you're, you know, you're a millionaire, right? Like you are like, maybe on paper, sure. And your business is not super liquid, but you you've paid off two years of payments towards a 10 year term for a business that's worth eight and a half million dollars. Like you've, you know, you've gained over a million dollars in net worth, like\r\n\r\n\r\nNikolas Hulewsky (32:55.726)\r\nYou've got equity.\r\n\r\n\r\nEric Pacifici (32:58.871)\r\nIt's been hard, like, how else would you have done that? What other job would you have, you know? So, it's a fascinating thing, because we're getting to the point now where it's, we've seen a couple years of maturity in a lot of transactions and very few people fail, very few people crush it, right? There's very few people that have these amazing projections and they realize them. Some do, some do, in both cases, but,\r\n\r\n\r\nNikolas Hulewsky (33:06.232)\r\nTotally.\r\n\r\n\r\nEric Pacifici (33:28.771)\r\nYou know, almost everybody's grinding real hard to the right and it's hard, but it's still an amazing proposition for almost.\r\n\r\n\r\nNikolas Hulewsky (33:36.682)\r\nWhat are you seeing with valuations? we know two years ago, rates started going up and that was just a thought in many people's minds. It's like, well, these valuations can't be justified anymore because the cost of borrowing becomes a lot higher. Have prices come down? Have they normalized or is it still like crazy prices?\r\n\r\n\r\nEric Pacifici (33:53.895)\r\nThe thing about SBA debt is it's always placed a natural limitation on what's possible. You're never going to get more than four and a half to five times through an SBA lender. And that's still an amazing proposition. And one of the things I love about our space, it initially drew me to it and has drawn many people to it is you're buying a dollar for four and a half to five times. You go buy a million dollar business for four and a half to five million bucks and you're 27.\r\n\r\n\r\nand you spend five, six, seven years paying off, you know, a good portion of that debt, if not all of it, you've got a million dollar cash flowing asset, right? That you've bought for four and a half to five million bucks. It's, that's pretty cool, right? And it depends on the nature of the business. Many businesses, you know, never hit those limitations. You know, they're one X to two X to three X businesses. Most businesses are two X to four X, you know, multiples. But,\r\n\r\n\r\nYou know, so it has an influence in as much as you would think.\r\n\r\n\r\nNikolas Hulewsky (34:55.182)\r\nI know in the SBA space, it's like, hey, the bank's just going to be looking at, you cover the debt, essentially? The problem is when you start getting in the million dollar plus EBITDA range, you're now competing with some private equity funds. And they don't care about paying a four to five X multiple. They look at that and they're like, well, we're rolling this up. And with the size it's going to be, we're now putting this into this platform deal. So it's not valued at four to five, it's actually valued at eight to 10. So we can pay six times earnings.\r\n\r\n\r\nAnd people like you and I who are trying to buy these businesses, we get outbid and outcompeted because they're setting the price so high, right? It's not necessarily I'm coming in and saying the price is really high. Have you seen that dynamic change at all? Because that was really hot two years ago when I was selling my businesses. I don't know what it's like now, though.\r\n\r\n\r\nEric Pacifici (35:42.671)\r\nYou're seeing a lot less of that private equity is a lot less active than the lower middle market is a lot less active. Generally those roll ups of HVAC and roofing and all that, you know, that you've heard of, um, I have stopped most of them and you, but you're right, right? If you're going to go buy a business and I think the threshold is really a million and a half in earnings north of two, for sure. The multiples are going to skyrocket, right? Which is a pretty cool proposition. Cause if you think about it, go buy a, you know, a million dollar, um,\r\n\r\n\r\nNikolas Hulewsky (35:51.565)\r\nMm-hmm.\r\n\r\n\r\nEric Pacifici (36:12.333)\r\nearning business EBITDA business for two and a half to four and a half times and then grow it. And what happens when you get that business, you double that business and it's doubling, not necessarily easy, but if you can get that thing to two, two and a half, three million bucks, all of a sudden your two to four multiple goes to eight to 12. And that's a pretty amazing.\r\n\r\n\r\nNikolas Hulewsky (36:34.274)\r\nYeah. And you've still got a cash flowing business. the example that you gave of the guy who was like, you've paid off $2 million of an $8 million value business. If he grew the EBITDA of that business, well, now it's like you paid $2 million off of $8 million in debt, but now your businesses were $12 million. So you've got even more potential equity upside that you've built because you've actually grown the business.\r\n\r\n\r\nEric Pacifici (36:43.151)\r\nThank\r\n\r\n\r\nEric Pacifici (36:57.335)\r\nRight. Yeah. It's a cool proposition and it's risky, right? And it's hard. Like it's hard to get through those transactions. Not everybody is going to get through convincing the broker, convincing the seller, convincing the bank, convincing the employees, convincing the customers, you know, having that. We see a lot of people that post-closing, know, didn't have necessarily that backbone that they ideally would have to give everybody confidence.\r\n\r\n\r\nThat's why I'm so hot on military veterans that are buyers. know, people that have led, right. If you, and if you're buying an accounting firm, very different than if you're buying a foundry, right? So certainly something, one of, one of my most, engaged tweets over the last couple of months was a picture of Josh Schultz, doing a day one announcement at a transition of a foundry. And my question was, you know, you want to buy a business\r\n\r\n\r\nNikolas Hulewsky (37:48.448)\r\nMm. Yeah, yeah, yeah.\r\n\r\n\r\nEric Pacifici (37:52.943)\r\nmake sure it's the right one because I could not stand in that room in front of those guys and be taken seriously. Now I could go to an accounting firm and probably be taken seriously, but not a foundry. so, really important that you find the right business, but the opportunity is great. And the opportunity for investors. I have people that are calling me, no exaggeration, a new person a day and repeated people being lied breakfast with somebody yesterday is like, how do I get in? How do get in? Because the,\r\n\r\n\r\nEconomic proposition for investors is crazy in our...\r\n\r\n\r\nNikolas Hulewsky (38:25.934)\r\nYeah, what does that look like? Tell me a little bit about what the structure of these deals with investors actually looks like in the SBA. Because the SBA is interesting. If you've got 20 % or more ownership in a deal, you have to sign a personal guarantee. So it puts a limit on many times these investors will be like, well, I'm going to put in 100,000. I want 50 % of the business. But then they're like, I don't want to have a personal guarantee. How do the structures look? And what do the economics look like for investors in the space right now?\r\n\r\n\r\nEric Pacifici (38:54.297)\r\nYeah. So before I say this, have to qualify it because anytime I talk about self-funded search economics and particularly what it looks like for an investor, they're like, you're lying. You're Charlton. You're full of shit. Right? Like, okay, fine. More for us. know, seriously. you know, I'm a lawyer. I'm not a investment banker. We're not going to talk about IRRs and the like, but I will talk about multiples and what the terms are. So when you invest in self-funded search, the market and the market's a little wide, but\r\n\r\n\r\nIn most cases, you receive a step up on your invested capital plus a preferred return. What does that mean? If you got a million dollar purchase price business, okay, the buyer is going to have to, in most cases, put down 10%. There are some cases where you can put down less than 10%, but let's just use 10 % for our numbers. Somebody's got to put up a hundred thousand to buy that million dollar business. In most cases, banks are going to ask you as the buyer to put up at least one to 3 % of the purchase price. So 10 to 30,000 of that money has to come from the buyer.\r\n\r\n\r\nIn most cases, there are exceptions to that, but in most cases, the rest can come from investors. So let's say you're an investor and you put up just again, to use round numbers to make it simple, you put up a hundred thousand of the a hundred thousand down payment. Doesn't mean that you get 10%. Well, so a couple of things happen. In typical investments, you would say, well, I put up all the capital, so I should get a hundred percent of the business, right? Well, no, because the searcher\r\n\r\n\r\nis taking a personal guarantee, they're gonna be running the whole business. You as the LP, and this is the part that people are like your full shit, you as the LP, you're gone, right? You invest that capital in most cases, unless you're investing a lot of capital, like in this hypothetical, but most cases, if you're investing two to three to 5 % of the value of that business, you're out of there, dude. And like, if it fails, they're probably not even calling you to talk about it. probably don't even, you you're off doing other things, completely passive, completely passive in most cases, right? So,\r\n\r\n\r\nYou're putting up a hundred percent of no payment.\r\n\r\n\r\nNikolas Hulewsky (40:49.358)\r\nThis is the real passive income.\r\n\r\n\r\nEric Pacifici (40:52.663)\r\nThis is real limited partner. This isn't a laundromat. This is real, you know, I've got a couple of these, know, great people running these businesses. don't ever talk to them. I see their investor updates is great, you know, but they're not calling me. They even run in a mold remediation business. You're calling me, you know, like, what am I? I'll help you if it's a legal thing, but so you put the full 10 % up, but you're not just gonna take 10%, right? Because also it is risky.\r\n\r\n\r\nNikolas Hulewsky (40:54.39)\r\nin a laundromat.\r\n\r\n\r\nEric Pacifici (41:22.573)\r\nright? They're illiquid investments. They can go to zero. you know, subscale businesses carry a lot of risks. So you're going to say, I'll put up 10 % of the capital, but I'm not just taking 10%. So you get a step up on that of one and a half to two and a half times. So if you put down the 10%, you should get 15 to 25 % of the business pro rata. You also get a preferred return. So you usually get between eight to 12%. Most of time it's north of 10%.\r\n\r\n\r\nNikolas Hulewsky (41:43.275)\r\nMm-hmm.\r\n\r\n\r\nEric Pacifici (41:49.903)\r\non that invested capital until its return. So if you put it hundred K, you're to get paid or accrue eight to 12 % interest on an annual basis. So 8,000 to 12,000 bucks in interest per year until it's paid back, incentivizing the sponsor, the buyer to pay you back quickly. Once you're paid back, you get your a hundred thousand dollars back, plus your interest, then you participate alongside the common. if you get, again, you get your step up, own 15 to 25 % of the business.\r\n\r\n\r\nEvery time the business distributes a dollar thereafter, you are receiving 15 to 25 cents of that dollar as an investor in perpetuity. Now there are ways it puts in calls and all this to build in mechanisms to potentially sell your equity back to the business or have the business buy your equity back at some point in time. Those are negotiated and somewhat controversial, but the upshot is if you're an investor, you can put in a portion of this, get a one and a half to two and a half time step up.\r\n\r\n\r\npreferred return, be paid back first, and then participate alongside that operator in perpetuity, legitimately completely passive. So it's a fantastic proposition. And the searcher is a great proposition for the buyer too, because they're keeping a hell of a lot more of that business than they would be in under ordinary circumstances. So it really is a pretty cool one.\r\n\r\n\r\nNikolas Hulewsky (43:08.878)\r\nThey're buying into a cash flowing business and they're effectively not paying a three to five X multiple. They're paying like a one to two X multiple because of the step up.\r\n\r\n\r\nEric Pacifici (43:20.109)\r\nYeah, that's the part. And again, you know, I'm not a mathematician. We're not here to talk about IRRs and MoAC and all this stuff. But if the buyer is paying two to four times for that or for those earnings. So for you know, they're paying two bucks to four bucks for every one buck that comes in or theoretically is going to come in and you come in and you get a two X step up. How much are you paying? You're paying one dollar to two dollars for every dollar of cash that that business generates. Completely passive, Completely passive.\r\n\r\n\r\nNikolas Hulewsky (43:49.122)\r\nI knew you were a charlatan. I freaking knew it. This is too good to be true.\r\n\r\n\r\nEric Pacifici (43:51.149)\r\nWhen I say that out loud, those are the facts. Those are the facts. And when I say that out loud, people are like, this guy, went viral on Twitter for tweeting that out and going, hey, once you discover this, it's pretty, and you know what's amazing is the investors in the space, they're DMing me going, shut up, shut up, shut up, why are you talking about this? Stop, why are you telling everybody about this? And everybody else is going, I had somebody say that they were gonna go to the Colorado bar and report me for being a snake, for misleading information, for tweeting out these.\r\n\r\n\r\nNikolas Hulewsky (44:00.122)\r\nmy gosh.\r\n\r\n\r\nNikolas Hulewsky (44:05.752)\r\nShut up, Eric. Stop it.\r\n\r\n\r\nNikolas Hulewsky (44:17.784)\r\nPeople are so stupid. Sometimes I hit anyways. All right, we're gonna finish up here. I wanna know, these are rapid fire questions. All right, your spiciest, hottest takes. What's the one industry trend that you're seeing right now that you think is overhyped?\r\n\r\n\r\nEric Pacifici (44:34.511)\r\nStock deals. Yeah, stock deals. People are buying equity, right? And they're doing buying equity partially because they think it'll be easier and the partial buyout rules of the SBA, meaning rollover equity, which you couldn't do two years ago. They said you can do, but it has to be an equity deal. So we saw it balloon up. It's usually like 10 to 20%. It was like 40 to 60 % of deals. And that's going to have really bad long-term implications because you're inheriting all the historical liabilities. We had one, and I won't get too specific, but\r\n\r\n\r\nNikolas Hulewsky (44:36.002)\r\nTalk to yous.\r\n\r\n\r\nEric Pacifici (45:04.387)\r\nguy buys business and then within a year, you know, big state government said, Hey, that seller, know, that million bucks in revenue of that seller is from a kickback program that he was running illegally, which trouble damages, yada, yada. It's all that buyer's responsibility to figure that out. kill your company. Right. So\r\n\r\n\r\nNikolas Hulewsky (45:24.736)\r\nIt doesn't matter what indemnifications you have or clawbacks you have with the seller, like it doesn't, because you have to then go and get it. The state's going to come to you as the legal entity.\r\n\r\n\r\nEric Pacifici (45:30.179)\r\nTo me he has it. Yeah, and hopefully it's not criminal. And you know, he's on a catamaran in middle of the ocean or he's dumped all the proceeds into his mortgage and he doesn't have the cash anymore. You're in big trouble. I really, I cannot emphasize enough that you should only be buying assets unless there is a very, very good reason to buy stock. And then if you're going to buy stock or equity, then you have got to negotiate very, very aggressive.\r\n\r\n\r\nNikolas Hulewsky (45:34.849)\r\nRight?\r\n\r\n\r\nNikolas Hulewsky (45:42.926)\r\nOkay.\r\n\r\n\r\nEric Pacifici (45:57.913)\r\nprotections in the contract and make sure you've got real ways to recover, super-sized ways to recover if there's problems post-closing.\r\n\r\n\r\nNikolas Hulewsky (46:06.126)\r\nOkay, what do you think is the most underhyped trend that you're seeing? Or a thing that you're like, nobody's really taking advantage of this sector or this opportunity with the SBA or this type of business, like whatever it might be. What do think people are missing right now?\r\n\r\n\r\nEric Pacifici (46:18.263)\r\nsale and lease back transactions, sale and lease back. You buy a business that also has real estate. Okay. And when you do that, you buy the real estate, but you immediately flip it to a REIT or some sort of real estate investor. And oftentimes, and we've seen when I had one and I'm going to screw the numbers up. these are, you know, these illustrate the point. don't remember specifically, but, many sellers will undervalue their real estate.\r\n\r\n\r\nNikolas Hulewsky (46:20.726)\r\nGo on.\r\n\r\n\r\nEric Pacifici (46:47.157)\r\nAnd what you can do is you take that real estate, let's say you buy it for a million, you immediately sell it for two. Well, guess what? If the business is a million and a half dollar business purchase price, you just got a million and a half dollar business for 500K. And in some instances, and I'm not exaggerating, I've seen people completely cover the business price with the proceeds of the sale and lease.\r\n\r\n\r\nSo if you find a seller that has real estate and they're like, I want to sell the business and I want to sell the real estate, when you're in diligence, you should be calling real estate investors, sale and leaseback experts and asking them to value that property because it's quite possible that you can buy it, immediately flip it, offset some of your purchase price and get really good valuations as a result.\r\n\r\n\r\nNikolas Hulewsky (47:32.098)\r\nYeah, the other thing I would add to that is many times the SBA will lump those two loans together and so you'll get even much more favorable terms for buying the business, right? So like right now it's a 10-year amortization, 10-year term. If the business and the real estate are lumped together, then all of a sudden your amortization period goes to 20 years or even longer. I think 15 is the max.\r\n\r\n\r\nEric Pacifici (47:51.407)\r\nIt becomes a 504 and it's got a longer period of time. has to be more than 51 % of the value of real estate, but you're right. And you talked to a broker.\r\n\r\n\r\nNikolas Hulewsky (47:54.924)\r\nYeah. Right.\r\n\r\n\r\nNikolas Hulewsky (48:00.44)\r\nYeah, anyways, dude, this was fantastic. Thank you so much for coming on.\r\n\r\n\r\nEric Pacifici (48:04.505)\r\nThanks for having me, man. You're the best. I appreciate you having me on.",
  "metadata": {
    "duration": "",
    "date": "2025-02-26",
    "platform_source": "Google Drive"
  }
}