{
  "episode_number": "21",
  "episode_title": "RE Development: Where $20M Is a ‚ÄúSmall‚Äù Project with Clint Murphy",
  "guest_name": "Clint Murphy",
  "business_name": "Frame Properties",
  "transcript": "﻿Hey, what's up guys. Welcome back to another episode of economics. I am so excited for you to hear today's guest, Clint Murphy. I hope you could put your running shoes on. I hope you had your morning coffee. I hope you snorted that Adderall, whatever you do to get yourself up in the morning, because today is going to be like Alexander Hamilton non stop.\r\n\r\n\r\nNow Clint Murphy, if you don't know who he is, you've probably been living under a rock, but you've probably seen his stuff across social media. He has almost half a million. Followers across social platforms who follow him for daily living advice, how to live a better life, how to live a more fulfilling and financially free life.\r\n\r\n\r\nBut in his private life, Clint has worked as a CFO for the last 20 years. He has an accounting background and has worked for some of the largest real estate development companies in Western Canada. Well, recently, in fact, on the day that I spoke with him on his last day, Clint became an entrepreneur. He launched his own fund  and.\r\n\r\n\r\nYou don't get to be as large on social media as Clint without being a master communicator. And the reason I love this episode so much, and I'm so excited for you is because Clint articulates real estate development in particular, the GP and LP fund structure in a way that a first grader could understand.\r\n\r\n\r\nI finally get it to me. I finally understand how a real estate development game works. And if you are interested in real estate development in any way, if you've been curious about how the two and 20 works and how they get their money back, what the returns are like, this episode is for you. Don't skip this one.\r\n\r\n\r\nYou'll be glad that you listened to this episode. So if you liked it, if you enjoy it, please, you know what to do, like subscribe, share with a friend. But with that, let's hop into the show.  All right.  Super excited to have you here today. My first question is just getting down to it.  What is your business and what exactly does it do?\r\n\r\n\r\nYeah, Nick, I like to use the phrase that we're a home builder, build homes for people to live in real homes for real people. A lot of people on the outside looking in will say it's residential real estate development. When you use real estate developers, you are the big bad guy. But when you tell people, hey, I build homes, it's hard to hate you. \r\n\r\n\r\nI love that framing man. How did you get into that? Yeah. What's your background?  The background leading into this. My first 10 years were at KPMG. So while I was at KPMG, there was a couple year gap in the middle, but most of that time was spent in the private enterprise group. So small to medium sized businesses and it was spent in real estate.\r\n\r\n\r\nWhen I flipped out of there, I joined a local developer in Vancouver. They're now probably 1 of, if not the largest developer and landlord in Western Canada. And was with them for 3 years before flipping to my current shop, where I've been the CFO for the last 8 years. And we're probably 1 of the top 7, I would say, real estate developers in our city.\r\n\r\n\r\nAnd that's multifamily residential real estate development. So we're talking townhomes would frame apartment buildings and concrete mid rise and high rise building. Okay. So you just like taking it way back. You went to college masters in accounting coming out of school. Did you go straight to KPMG or did you start somewhere first? \r\n\r\n\r\nYeah, so I I went straight to KPMG while I was still in school. So cool. Summer internship, right? I did the summer did well enough that they were like, Hey, you're coming back. They give you a laptop, give you all the swag. So you go back and start recruiting your friends and, uh, finished my last year and then came right back into it.\r\n\r\n\r\nAnd fortunate enough that my wife had just been KPMG. Girlfriend at the time had also been accepted into KPMG. So our first three or four years, well, actually probably six in hindsight, we're at KPMG together. All right. So you have a really interesting profile. You're an accountant, masters in accounting, went to work for KPMG,  then spun out and worked for a developer, a home builder, excuse me. \r\n\r\n\r\nAnd now you're starting your own company. So you, um, There are some interesting dynamics there on the one hand, a high percentage of entrepreneurs who start their first business are over the age of 40.  On the other hand,  CPAs accountants don't typically start their own businesses outside of the CPA and accounting world.\r\n\r\n\r\nWhat made you go out on your own? First of all, and second, why home building?  Yeah, the first one would be, I would say, yes, I'm a CPA by training, but I've never identified with the label, right? It's just that it's a label. I've looked at it and just said, hey, I'm an intelligent guy who can do almost anything you want.\r\n\r\n\r\nAnd what do I choose to do? And for 25 years, my wife wanted stability. Right. She's risk averse, wants stability. And I provided that. And then I said, at some point on that journey, I said, Hey,  I've given you that for this amount of time,  we've built a certain amount of wealth and it affords some opportunity to take some risks.\r\n\r\n\r\nAnd the 2nd half is my half  is going to get real. And I'm going to go for it. And why did I start when you. When you're an intense person and you're driven and you always want to be better at what you do, the last stop is ownership, right? You can't stop at a role. You can't stop at CFO or chief marketing officer, because that's not the end game.\r\n\r\n\r\nAnd Nick, I look back at reading that post that you wrote. And reading the promises and the conversation and i was having those same conversations right i joined the company with the idea that i would be an owner  and i started having the conversations when i became a cfo and a year later it became oh hey not yet three years later it became never  and when it became never. \r\n\r\n\r\nI started to put the plan in place. I had a very similar experience as you, where my wife is the daughter of a CPA who owns his own firm, incredibly risk averse. And I've always wanted to be an entrepreneur. I always wanted to do something. And in 2020, it was like, okay, I'm ready to do something. I'm very grateful for her  because if I hadn't done those things, I wouldn't have been prepared to take the swing that I took.\r\n\r\n\r\nThat's right.  But to your point, it's like, all right, we did it this way. The first half. We're in a good place. Now I want to go do what I've always wanted to do. So I resonate with you very much from that perspective.  What about home development? Cause I don't know. I think home development, I think capital intensive, I think regulatory burden because you have to work with the city and the county or whatever to get the permitting, do I just have a bad misconception or what, what did the economics of home building look like? \r\n\r\n\r\nThe no, you are absolutely correct. I was chatting with Tyler from. Twitter yesterday, and he does strip malls in Dallas, Fort Worth, Texas. And we were talking about the fact that as a developer, you It's the Mike Tyson trainer quote where everyone has a plan until you get punched in the face. And the challenge you have with development is not only are you getting punched in the face, but it's similar to, I don't know if you've read about torture, but what they say is, you know, it can't be, it can't be like programmatic.\r\n\r\n\r\nLike, you know, when they flood the lights and loud music, so you can't sleep, you can't have it so that it's every  20 minutes exactly, because the human mind can actually just knock that out and go to sleep. It has to be like 20 minutes, and then 17, and then 32, so you just can't get ready. And that's what development is. \r\n\r\n\r\nUnpredictability, it's like, oh, it's not punched in the face, I just got a kidney shot. So, and it's every day, right? Every single day we get a new email from Someone about something.  And so that's true. That's a challenge in the regulatory is increasing. So there's always new rules coming out about seismic requirements, heating requirements, air conditioning requirements, like always, always changing in from a capital intensive perspective. \r\n\r\n\r\nSuper capital intensive. So, you know, you talked about the fact that I'm leaving one shop where I was the CFO and the capital is less of an issue there because we've been around 25 years. We've built up cash reserves. We have working capital balances and we have a strong balance sheet we can rely on. So it's a totally different world  when you're starting out as a residential real estate developer or a home builder.\r\n\r\n\r\nYou  buy your 1st site.  And you put your cash in to buy the land. Two years later,  you get your construction permit. Two years later, you close on those homes. So from the time you put your money in until you get your money out is four years.  And if you're doing three projects, that's a lot of dough in to get dough out.\r\n\r\n\r\nAnd from a capital requirement perspective, Land cost. It depends always. Real estate always depends on where you live. I happen to live in a high cost of living city. So the even to be in Vancouver first site, I live in Vancouver, Canada. Yes, and we're developing on Vancouver Island. Um, some listeners may know it as Victoria and in in Victoria.\r\n\r\n\r\nI'll give you a simple example. If you're paying. 4, 000, 000 for  2 single family lots or 3 single family lot.  The bank on your land closing will give you about 60 percent funding. So now you're needing to come up with 1. 5M yourself. Right. And I've got 3 partners. There's 4 of us. We've got some capital, but we, we don't have 1.\r\n\r\n\r\n5 million for 4 different projects.  I mean, that's big dollars. That would, that would be  6 million that we would need to come up with between us. That would be 1. 5 million each. So what you have to do is you have to go out and find capital partners. And that becomes part of the business is raising capital from 3rd parties who trust you.\r\n\r\n\r\nBelieve in you have a relationship with you and are willing to put money in your business knowing they're going to put that money in and they're not going to get it out for 4 years. So, and so when you're starting out,  yeah, I was just gonna say, are those capital partners bank? So is this debt financing or these family offices, private equity funds, real estate funds?\r\n\r\n\r\nYes, yes. So it's high net worth individuals, family offices. Some of the family offices are in real estate themselves. So generally what you'll find in the progression of a real estate development world is when you first start, you're doing real estate development.  And you're using as partners in addition to the banks,  once you have enough scale, you reduce the measure you're using and now you're developing on your own. \r\n\r\n\r\nThen you've got so much and it's all for sale in in the US. It's a little different because of your laws. A lot of people don't like to do for sale development because you get sued to  then you flip to hey, we're not selling at all. We're we're obtaining some of it. Eventually, you're retaining all of it.\r\n\r\n\r\nEventually, you have so much cash that you become a lender. And so, that this step, those become your capital partners. They've gotten so far down the food chain that they're not doing as much development anymore. They have a huge income portfolio, spitting out cash. They find young guys who want to get punched in the face all day.\r\n\r\n\r\nAnd they start to, they start to lend it to them and earn a 20 percent IRR. What are those terms typically look like? Are they, are these equity terms, are these debt terms that are backed by real estate or something totally different?  Yeah, I'll give you, I'll walk you through an example. So  on, on a deal and in some people are more aggressive and your terms can get more aggressive in favor of the general partner as you have experience and track record and have proven yourself.\r\n\r\n\r\nRight. So, but when we're starting with a deal, it may look as simple as this. So you're describing a GPLP model,  similar to like PE and, and small business investing. We're just applying this to real estate. A hundred percent. Oh, okay. Yeah. That's right. Okay, cool. I'm caught up. Sorry. Keep going. So  we're coming in as the general partner.\r\n\r\n\r\nWe're managing the project. We're doing the work. And for that, we'll earn a 25 percent come up.  Okay. The way the structure works is  first we do a 7 percent prep on the capital that's in the project.  Above the 7 percent prep,  75 percent to the limited partners, 25 percent to the general partner.  And then for us, we'll have some cash. \r\n\r\n\r\nWe may have even a third of the capital in the limited partner. So if we have a third of the capital, we're getting 25 percent of the 75%. So we're coming close. To  50% by putting 30%. So if I put some percent the capital lp, if, if I put some easy numbers on it and we'll just do one year because I don't, then I'll have to do like compounding industry interest rates.\r\n\r\n\r\nYeah. And we say you go out, you raise $1 million  at a 7% preferred return with the 25 75 GP LP split. I'm not gonna say you put any money in, I'm just gonna say it's all LP money. That's right. That's right. And then a year from now you then you sell that, let's just say four. $2 million.  So the LPs would get their $1 million back plus,  yep.\r\n\r\n\r\n$70,000, which would be their 70 plus they would get. Yep, that's right. Yep. And then 75% of the $930,000.  So let's just make it easy and say 750,000, $750,000, and then the GP would get 250,000 for that project. Is that that's right? Generally. Okay. Yeah.  Interesting. So how do you,  I understand that conceptually, but you just said it takes four years. \r\n\r\n\r\nSo how do you live for four years? Right? Cause cool. You'll have a liquidity event four years from now, but  what are you doing in between now and four years? That's a long time. Very sparingly, very sparingly. So there's a few, there's a few things along the way. So one of the things is, Okay.  And the one caveat on that IRR structure is, you will modify the deal slightly, so that if you actually did do it in a year, like you had a really favorable flip, and sometimes you have that, because land prices go through the roof, you had a really big site, and you're like, hey guys, we can actually make 20, 000, 000 just by flipping this site.\r\n\r\n\r\nYou're going to do it. And so what you usually do is you have a bit of an IRR waterfall. So if you achieve a, if you achieve an IRR of this, it goes from 7525 to 6040. And then if we achieve 25%, it goes to 5050,  right? So you're putting waterfalls in place that that will help you as you scale up. And so that's something on future deals we'll look at and then you have to look at does our investor prefer IRR or do they prefer a multiple and how are we going to structure it so that they get what they want and we get what we want because we're incented by our IRR  because we're trying to make it one of the things we're trying to do, Nick, and I'll come back to your question, but I love it.\r\n\r\n\r\nThis will make sense to you. We're trying right now while the market's low.  To put our deals under contract in a way where we have time.  So we're buying time. We're saying to that seller,  you want maximum price interest rates are too high right now. If we buy it today and we hold it for four years, we can only afford to pay you this,  but if you give us time,  so we're going to work through the due diligence process, we're going to get the development permit.\r\n\r\n\r\nWe're going to then have this much time to close.  That interest savings, we're going to share that with you so we can pay you a little more and you've got houses on there. You can rent those out. You're going to be okay. We're going to close closer to building permit. And when we do that, our cash goes in and we get the money back 18 months later.\r\n\r\n\r\nOkay, so you can see that really favors an IRR model because we just closed the gap.  So you want to work with an investor that prefers an IRR model because now you've got an investment that will deliver them. Very good results relative to the metrics you're they're looking for and you'll get cash sooner.\r\n\r\n\r\nThat's 1 thing. The other thing you look for along the way is.  And this is why we're going to relook at the project sizes we're doing. I had a lunch with a friend who started his shop about 6 years ago, and he said something that really planted a flag for me  is your fees. So, on that project, you'll probably earn around.\r\n\r\n\r\n3 and a half percent of revenue is your fee. So if you're doing a 10, 000, 000. Dollar project, you're getting 350, 000 dollars in fees.  So that 350, 000 dollars pays your salaries. Is that like an asset management fee, likening this back to private equity, right? 100%. 100%. That's exactly, that's exactly right.\r\n\r\n\r\nBecause you have to hire a development manager to take it through the entitlement process. It just so happens that in our situation between the four partners, we had a deal guy. We have a marketing and sales person. We have a development person who's. An architect and before being an architect was a plumber, so he handled the development construction side.\r\n\r\n\r\nAnd then I handle back office. So, between all of us,  we handle every scope of that process. And so we're getting that development fee. It's giving a little bit of money, but not much.  And that's why we need to scale to larger projects. That's exactly what I was going to ask. It sounds like you're just incentivized.\r\n\r\n\r\nNext. To start big. Yeah. You're incentivized to start big and maybe big isn't the right word, right? Cause big to me, maybe a 20 million project and big to you. Who's been in the industry is like a 2 billion project. But I guess what I mean is  you need some income in order to pay for all that stuff that you're doing in the interim, your, even your own personal funds, but also the development and entitlement process. \r\n\r\n\r\nSo you need 10 million, say at a minimum. Of projects so that you can charge that 3 and a half percent, whatever the number is in order to pay for the operating expenses along the way. You can't you're not going in with a 2 million dollar project.  No, no, no, no, that's buying a single family lot is somewhere around 150 grand or sorry.\r\n\r\n\r\nSorry. 1 and a half million. Right so you're  our 1st project. Is targeted around 15 million in revenue. Our second project is closer to 20 and those are too small. We should be targeting 40 to 50 million in revenue on our first project or on our project three and four. We've put paper out already. Project three and four will be around 25 to 30.\r\n\r\n\r\nAfter that, we want to go 40 and above. What does revenue mean to you? Like you've said revenue a couple of times. I think of revenue as like cash generated by the business, but in real estate, what is it?  Yeah, that's exactly right. Just the sales price? So you,  well, we're always careful. Real estate's interesting because sales is one thing, closings is another.\r\n\r\n\r\nSales are when we sell the homes. So that first project, we're selling right now.  We hope to have our first sale locked in on Monday, but we're closing in  18 months when it's built.  So, so we separate the sales and closing revenue.  So the sales is when you lock in the deal. The closing is when you get the cash in your jeans.\r\n\r\n\r\nWhen I say revenue, I'm always talking closing. Like you actually handed the keys to someone and they've given you the money from the way you're looking at it. That's right. And I'm assuming though, when somebody comes in and says, I want to buy this, even if they're not closing for 18 months, are you taking.\r\n\r\n\r\nA non refundable deposit, or is it just, yeah. Okay. So there is some deposit that you're getting  10 percent right now. And depending on the size and scale of the project, you'll collect up to 20. I've worked on some projects where we averaged 30 percent deposit. And that was beneficial because you, when you talk about the capital stack and you talk about financing these projects, there there's a product called deposit protection insurance. \r\n\r\n\r\nAnd deposit protection insurance is you work with an insurance company and they're really underwriting your balance sheet and your execution ability. So they believe in you, they know your track record and they will lend against those deposits at a rate of around 0. 8%.  Wow. So when you look at your capital stack, if you can make 10 percent of your capital stack.\r\n\r\n\r\nDeposit protection insurance, it's the lowest cost of funds you can get. And so if you're building a wood frame apartment building, it could take 24 months to construct.  And you've got 10 percent of your capital stack is that at the 0. 8%. The other thing you're trying to do. So going back to how are we going to afford it?\r\n\r\n\r\nOne is you got to get the fees.  The other is early in your life to build to the point where you're just operating your business.  That's the goal, right? Because we're going to make the most money. By building real estate, but early in the life cycle of a company in this field, often you're doing consulting services.\r\n\r\n\r\nWe're partnering with other developers who don't have all the in house aspects that we have, and we're helping them to get their projects to the finish line, or we're, we're handling 1 of the scopes within that project life cycle. Whether it's the entitlement, the due diligence feasibility.  Yeah, maybe it's helping them raise capital.\r\n\r\n\r\nOr as an example, I'm talking to 4 different groups about  fractional CFO services  and providing that for a fee. It's fascinating because you're, you're essentially trying to generate revenue until you get to the point where you're consistently, but it sounds like there's like that 4 year gap where. It's a little touch and go, so to speak, because you got capital tied up.\r\n\r\n\r\nYou know that there's a liquidity event at some point, but until you get to that point, you've got to create stability. And so you've got some consulting services  along the way is the four years.  Start to finish is like year at the end of year four, you've sold all the homes or is it four years, excuse me, closed on all the homes or is it four years until you can start closing  four years until you can start closing in an ideal world, in an ideal world.\r\n\r\n\r\nThe tour coterminous in that as you, I never, I never knew that I'd use coterminous on a, on a podcast. As you work through the construction process, you're selling along the way, because the last thing we want is the idea of standing inventory.  Because when you look at how it works with your bank is they get paid out first.\r\n\r\n\r\nWe close a home, proceeds come in, bank gets paid down. So if we're left with four homes out of those 15 that we haven't sold, and it's a million dollars each. Let's say two homes, because that'll be our equity. Now the bank's fully paid out. Those last three, let's say three, those last three homes for three million dollars, that's our equity and our profit that's sitting in those three homes,  because the bank's gone.\r\n\r\n\r\nThey've been paid.  And until we sell and close those homes, our equity and profits locked up. I just had coffee with a guy yesterday that met him through Twitter. He reached out and said, Hey, I'm Wilmer. I live in this area just happens to be down the street for me. And he's like, I'm also in real estate development would love to chat with you sometimes.\r\n\r\n\r\nSo I grabbed him for coffee. He built a project that's right up the street.  It's beautiful.  And  he's got 3 or 4 units that haven't closed.  That's his equity.  In this situation, maybe not profit, maybe a slight loss,  but that's three to four where he lives. These are more expensive.  4 to four and a half million dollars just sitting there, locked up until they can sell those homes. \r\n\r\n\r\nAnd so you want them all sold before you get to the end of construction.  I'm so excited we use the word coterminous. How many more times can we use coterminous in this episode? How do you think about the sales process?  How are you selling the homes? Are you just going through traditional real estate agents? \r\n\r\n\r\nYeah, we're trying not to, so we're having a little bit of a battle with this one right now, because we're selling in an area where we don't have as much experience  being on Vancouver Island being in Victoria. That's not where my shop does development. We do it in the lower mainland from.  For anyone who's listening who knows Vancouver, we go all the way from North Vancouver through the valley to Abbotsford and  we have a very strong pre sale market.\r\n\r\n\r\nSo you put a campaign together, you use social media, you use signage, you use a lot of digital, and you drive a bit of a fevered pitch.  And you're working with the realtors behind the scenes, and you get it so you have a launch event. And often on that launch event, and I can give you an example. We have a. \r\n\r\n\r\nToday's my last day, which, you know, through Twitter, so I'll probably still use. We launched in December a tower project in  so let's say 220 homes.  And.  Now we're in May. We launched in December. We've sold 80 percent  of those homes. Wow. So you're looking at 180 out of 220 sold. Five months. So the amount of effort and signage and people knew our story for that project  weeks before we launched.\r\n\r\n\r\nMy friend who works at probably the largest developer in the city, he's their CFO.  He said to me, and whatever you guys are doing, I know your three bullet points, no one sold in eight years,  he listed them all, he's like, I can't stop seeing it everywhere I look, and I, you know, I know the price tag for what it took to get that, so we built a fevered pitch, and when we pressed go,  The sales happened.\r\n\r\n\r\nIt's not easy. Our team worked their ass off over the Christmas break to lock in. We were probably 50 percent sold within a week of the launch. So you have to have that launch dial.  We're attempting to replicate that on Vancouver Island. So we had, we put together a really strong reservation page with renderings.\r\n\r\n\r\nWe put it, we put together an email marketing campaign. We have good signage on the site. So we're driving as many eyeballs as we could.  We're working with a local realtor group who had a strong list, and the list, if you will, is similar to  copywriting. Your sales are only going to be as good as your list.\r\n\r\n\r\nSo you have to build a good list, and then your idea is to add to that list. And so through our paid acquisition strategy, we're adding about 25 people per day to the list, and that realtor may have had 3, 000 people on their list. By, through the signage we have on the site. Through the adverts that we're doing, and through the  events we're doing in the area, and I'll explain 1 of those events.\r\n\r\n\r\nYou'll love it. We  ended up, we're probably now around 450 people on our list and adding about 20 to 25 people a day. And so that's been good. And we expect we have seven different groups were in conversation with to write a contract. We expect another group to come in Monday to potentially write a deal.\r\n\r\n\r\nSo we're, we're very excited where we are, because what we want to avoid,  we want to get sort of that 4 or 5,  6 or 7 sales in advance of going on to MLS,  because once you go on to MLS, you're kind of in what we call a tempo campaign where you're just it.  Trying to get that one sale at a time. We want to have that competition aspect.\r\n\r\n\r\nThat's really driving a bit of a fever pitcher up. So you offer incentives to the realtors to say, Hey, if you do, this is what's going to happen. Instead of waiting till these homes close, we're going to pay you 50 percent of your commission on firm when the deal goes firm. For these types of projects, let's say it's a 50 million project takes four years.\r\n\r\n\r\nWhat are your projected net margins on that?  Yeah, generally, you underwrite real estate. Most of us underwrite, and again, depends on geography. I'd say here in Western Canada, most of us underwrite  real estate to a 15 percent margin. A lot of developers will do 15 percent on cost. We do 15 percent on revenue. \r\n\r\n\r\nAnd so if we're doing, let's keep it simple. If we're doing a 20 million project, we're expecting that will cost us 17 million. So we'll make 3 million on that 20 million project. So you're incentivized again to go bigger, right? Because  four years worth of work for a 3 million payoff and four partners and your whole team, it sounds like a lot of money, 3 million, but if that's spread over four years and you've got a team and that's not, those aren't massive margins. \r\n\r\n\r\nNo, and that's where having the background that I have,  that's where it gets fun is the financial engineering,  right? In, in the gearing. So, when you look at that relationship, you and I talked about earlier between your GP and your LP,  sometimes you simplify it and you don't necessarily say, well, here's the GP, here's the LP is instead you do what's called a 75, 25, 50, 50.\r\n\r\n\r\nSo, hey, you're the capital partner. You're going to put in 75 percent of the equity. I'm going to put in 25 percent going to split the profit.  So that's a two to one gearing, right? I'm putting in 25%, I'm getting 50.  And I can then take a step back. I can say of my 25 percent equity, I can go find a different capital partner  who wants to take a smaller piece.\r\n\r\n\r\nThey're not as big as that person who's going to handle the 75,  but they can handle a piece of the 25. And I can do that exercise again. I can say to that partner, Hey,  I have to put 25 percent and I'm going to get 50%.  I can give you the same opportunity as that 75, 25, 50, 50. So they're getting a negative 3 to 3 to 1 on their money. \r\n\r\n\r\nSo you can put in 18 percent and you're going to get 6 percent of the 25. Yeah. Right. And so you're working it out. So they're getting the exact same math as that big partner, but they're taking a piece of the smaller partner. So now you're putting in 7 percent of the capital stack  and you're getting a pretty good number for that.\r\n\r\n\r\nRight. And so that's the slicing and dicing of the stack.  All right. So I have one and you've got the senior bank, right?  No, finish that thought. I want to hear it. So you've got the bank.  So when you're first starting, you're not going to get as high as  a leverage, but let's say you're getting 75 percent leverage.\r\n\r\n\r\nSo that's costing 20 million. The bank's in for 15 million,  your capital partner. Now you've got 5 million Delta. You've got to close. There's 75 percent  of that 5 million. So you're only 1. 25 million. Yeah. And now if you slice that again, Okay. You're 400 grand in that project,  and you're ending up with about 30 percent of the, of the 3 million in profit.\r\n\r\n\r\nSo you're 400 grand in your 900 grand out. I often fantasize about operating in real estate, and this conversation has disabused me of.  Of that, because I don't want to go and compete against guys like you,  just like, I just know so little here's my last operational question. What's your goal with this business?\r\n\r\n\r\nDo you want to just cash flows or are you hoping to grow it and sell it?  It's hard to sell a real estate business because almost no one puts goodwill to a real estate business, right? It's different if you're a real estate business that owns doors. And we have a separate business that we may be creating to do that or are creating to do that.\r\n\r\n\r\nWe're having some dialogue with another partner outside of our main business.  In the development business, most of most people just value it based on your dirt. So you look at the dirt, you say, hey, we're going to either value it on a discounted cash flow comp approach or a residual value approach. And we'll pay you for the value of your dirt.\r\n\r\n\r\nSo it's hard to sell. So what do we want to do?  We want to scale the business over the next 7 years  until we're so by 2030, we want to be operating at somewhere in the 150 to 200 million a year in revenue range. And continue to scale from there if we're there in 7 years, and that might even be some small thinking  the goal would be to take it from 200 to  somewhere in the 250 to 500 range over the next 15 years.\r\n\r\n\r\nSo, if we're able to operate at 250, 000, 000 a year in revenue, the amount of cash generally, while you're still pretty heavy meds dependent. You're dropping 8 to 10 percent to the bottom line after paying your whole, after paying all your team, including, you know, healthy salaries for you as owners of the business in Europe and it's great breaking out.\r\n\r\n\r\nSo owner versus manager, you're earning healthy salaries and then you're earning your dividends on top of that. So it's very healthy. And once you reduce the amount of meds, because you've been reinvesting your capital in the business, then those margins, uh, will drop about 10 to 12 percent to net income before tax.\r\n\r\n\r\nThat's awesome.  All right. So I have, these are my rapid fire questions at the end.  All right. What do you love about this business?  What I love about the business specifically is it relates to starting with guys versus what I was doing is  one of the things we all realize was when we were in a larger company, we were in a role, right?\r\n\r\n\r\nYou're the development guy. You're the this guy. You're the accounting guy. Now that we're starting this business together, we're developers and I love.  That I get to do copywriting for the website. My backstory, you know what I'm doing on social media. And so to be able to touch the copywriting feels like what I should be doing feels like I should have some role with my team there.\r\n\r\n\r\nTo be able to be involved in the rendering and the design. So, hey, you're not just an accountant. You've been looking at real estate for 20 years. Like, hey, what do you think this should look like? And being able to be part of the team. Right? That's the key. Part of the team. Say, hey, what if we did this?\r\n\r\n\r\nWhat if we did that?  And so now I get to touch every single aspect  and I haven't talked much about real estate on Twitter because I was working for someone, but this is what I've been living in breathing for 15 years because outside of doing it as a day job, Nick, this is what I've done investing to grow my wealth is just buying real estate over the last decade.\r\n\r\n\r\nSo I love homes. I love Product I love design in the last part. We're not there yet, but as we build the team.  I love the idea that I'm going to be able to build the team and be part of an ownership group that gets to create the culture that team gets to experience for the next 20 plus years. I love that too.\r\n\r\n\r\nThat's 1 of my favorite parts. Of owning a business is the ability to create the culture.  It's such an awesome responsibility. For sure. I am often jealous of real estate guys  because I think, Oh man, they just got an asset. It produces cash flows, easy peasy. And many times real estate guys are jealous of small businesses because they have cash flows that are consistent. \r\n\r\n\r\nWhat industry are you jealous of and why  it's interesting. The, I wouldn't say jealous of, I like other industries and like learning what's happening because we all have different pros and cons.  I mean, the easy one to throw out is tech industry, like. My God, it doesn't make any sense. Like those guys don't cash flow.\r\n\r\n\r\nThey don't actually make any profit. And they're trading at insane multiples of eyeballs. What does that even mean, Nick? Right. And so,  but, but I've always said this, I've always said, Hey, look, I'm smart enough.  Sorry, take a step back. I'm not smart enough to create a world changing app. I'm not smart enough to send rockets to Mars.\r\n\r\n\r\nI am smart enough to design a home that somebody wants to live in  and sell it to them.  So I can be jealous all I want, but until I can do what those people are doing, I'll stick to homebuilding.  Uh, all right, here's my last question. What are you obsessed with right now? Like if you have a spare hour or two. \r\n\r\n\r\nWhat are you doing? What are you reading, researching, thinking about that holds your attention?  Yeah. The, for me, that's an easy one right now is the copywriting because the copywriting is regardless of what industry we're in.  We're selling  right. Regardless. And so I just finished the Boron letters and I'm going to go back through and document my notes and really try to absorb it and try to think, how do I write like Gary Halpert?\r\n\r\n\r\nOkay. And what are the resources he referenced? I've got to go read those next. I have about 9 or 10 other books on copywriting on the shelf that I'm going to start working my way through. And while I'm working my way through those, I'm also, I've got Warren Buffett's shareholder letters. I'm working my way through those.\r\n\r\n\r\nBecause the, Warren is doing copywriting of his own, right? He knows what he's doing. Aw shucks, right? That's Warren's copywriting approach, the aw shucks grandpa who you want to be friends with, and he's the shrewdest shark out there who will eat you if you step into his water, but he comes across as this  Kind, gentle grandfather is going to offer you a war.\r\n\r\n\r\nThere's original. So how did he create that persona? And how does he write to his investors in a way where you're like, I want to put money in Berkshire Hathaway because that's a big part of what we have to be able to do is we're, as we're building this base of capital partners, I have to be able to tell them about our business in a way where they trust us with their money. \r\n\r\n\r\nAnd  how do I write to them? To them in that way, convey the information  so that they want to say, Hey, we trust you with our money and we want to invest with you. Yeah. So understanding that for the investors, understanding how to sell that home to the eventual home buyer. It's all copy. So I'm obsessed with copy right now. \r\n\r\n\r\nClint. I love it. This has been an awesome conversation. Where's the best place for people to find you is Twitter the best place, or do you want to direct them to your website?  Yeah, I'd say two right now. The, the growth dot guide is where is my personal website. So if they want to learn, and I'm going to start talking as early as next week, more about real estate, more about entrepreneurship, because I'm excited for that life and not constrained by someone, but these ideas of capital stacks and coterminous building, like we'll talk about that on the timeline.\r\n\r\n\r\nAnd then the. And then if they want to see what we're doing in the real estate world, frame dot properties, framed properties. Cool. All right. Well, this has been an awesome conversation. We'll tell people to check those out. Yeah.  Thanks, brother. This was fun.  What'd I tell you? What'd I tell you? I told you it was going to be a good episode  for me.\r\n\r\n\r\nI think as I've had a chance to think about it and reflect on our conversation. The thing that sticks out to me is  many times in life, we're so anxious to get to where we think we want to get to. We think there's not enough time. We think that  we have to act now. Otherwise we're going to miss our window or miss our opportunity.\r\n\r\n\r\nBut what I was reminded of is don't be so anxious  to get to where you think you want to be when you're not ready  because you just might get there.  And when you do, you're going to be in for a really rude awakening. You know, I spent 10 years before I bought my first business.  And at first it was because my wife wasn't comfortable with me buying a business.\r\n\r\n\r\nI thought I knew everything there was to know about buying a business. I was fine. I could have run it.  But as I look back on that experience, there's no way in the heck I would have been successful had I bought a business. There's a lot I've needed to learn. I needed to learn on other people's dime. I needed to understand how to manage people, how to negotiate an acquisition, how to finance it,  how to grow a team.\r\n\r\n\r\nThere were so many lessons that I was fortunately able to learn on other people's dime that I then applied to that business that I'm incredibly grateful to my wife's persistence in particular in keeping me in check.  And, you know, Clint is in a similar situation, he's, you know, over 40 and he's finally starting his first business.\r\n\r\n\r\nAnd it's because he and his wife had this agreement where  while the kids were growing up, she wanted stability. He stayed in his job. He could have left at any time. I mean, he has a very large social following, but  it was their experience and their arrangement that allowed them to keep focused and to ultimately be successful. \r\n\r\n\r\nSo, I would just encourage you to remember  your life is your life.  It's easy to compare to other people, but you need to find your own path. And what works for you is not going to work for somebody else. What worked for Clint isn't going to work for me. You need to figure out where you are in your progression.\r\n\r\n\r\nAnd try and take a really clear eyed approach to assessing your current situation  so that you can be successful in the future. Now, as we end this episode, I just want to say thank you for joining me and please remember there's no such thing as a dumb question.  There are only dumb people  afraid to ask the dumb questions.\r\n\r\n\r\nI'll see you next time.",
  "metadata": {
    "duration": "",
    "date": "2024-06-21",
    "platform_source": "Google Drive"
  }
}