{
  "episode_number": "112",
  "episode_title": "Why Marketing is MORE Important than Ever in the AI Age with Chris Koerner",
  "guest_name": "Chris Koerner",
  "business_name": "",
  "transcript": "﻿Chris Koerner (00:01.262)\r\nOkay, let's start off with a question. I've got to fill in the blank question for you, Nick.\r\n\r\n\r\nNikolas Hulewsky (00:05.108)\r\nAlright.\r\n\r\n\r\nChris Koerner (00:06.542)\r\nOkay. I'm pretty sure I know how you're going to answer this, but we'll see.\r\n\r\n\r\nNikolas Hulewsky (00:07.699)\r\nAll righty.\r\n\r\n\r\nNikolas Hulewsky (00:12.702)\r\nOkay.\r\n\r\n\r\nChris Koerner (00:15.724)\r\nGrant Cardone and Tony Robbins are world class at fill in the blank.\r\n\r\n\r\nNikolas Hulewsky (00:22.526)\r\nsales.\r\n\r\n\r\nChris Koerner (00:24.206)\r\nOkay. Okay. Absolutely. You went you got it. Because like one's a motivational speaker, one's a guru, but like, the overlap is marketing, right? Would you believe they both learned their marketing prowess from the same person that most people have never heard of?\r\n\r\n\r\nNikolas Hulewsky (00:25.523)\r\nmarketing.\r\n\r\n\r\nNikolas Hulewsky (00:36.628)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (00:45.107)\r\nReally?\r\n\r\n\r\nChris Koerner (00:47.886)\r\nHold on one sec. What's up? Okay, I'm recording.\r\n\r\n\r\nChris Koerner (00:56.078)\r\nSure\r\n\r\n\r\nNikolas Hulewsky (00:59.7)\r\nHi, Jessie. she can't hear me no more.\r\n\r\n\r\nChris Koerner (01:01.762)\r\nBye, Nick.\r\n\r\n\r\nNikolas Hulewsky (01:05.106)\r\nTell her I said hi. Tell her you didn't tell her I said.\r\n\r\n\r\nChris Koerner (01:09.602)\r\nHe doesn't say hi.\r\n\r\n\r\nAlright. Yes, really. His name is Frank Kern. Have you ever heard that name? No, you're in the business world. I'm in the business world. Most people have never heard of Frank Kern, but if you're Alex Bromozi, you love Frank Kern. He talks about him every now and then. He loves Frank Kern. Frank Kern is the Tai Lopez before Tai Lopez. He was the OG Internet marketer. The OG guru, the original guru.\r\n\r\n\r\nNikolas Hulewsky (01:14.932)\r\nStupid.\r\n\r\n\r\nNikolas Hulewsky (01:22.131)\r\nNo.\r\n\r\n\r\nNikolas Hulewsky (01:41.332)\r\nWait, wait. Oh, you're not saying he was an Internet marketer. You're saying he was the original guru.\r\n\r\n\r\nChris Koerner (01:45.794)\r\nHe invented internet marketing gurus, Frank Kern. He's the godfather of it.\r\n\r\n\r\nNikolas Hulewsky (01:50.888)\r\nHe's the OGG, Original Gangsta Guru!\r\n\r\n\r\nChris Koerner (01:54.326)\r\nYes. Can I tell you how we got to start?\r\n\r\n\r\nNikolas Hulewsky (01:56.466)\r\nYes, I'm freaking sitting on pins and needles.\r\n\r\n\r\nChris Koerner (01:58.638)\r\nAll right, he grew up in a trailer, obviously. It's funny how he probably grew up in like a 4,000 square foot house in Santa Clarita or something, but no. Anyway, grew up in a trailer, went to college at Syracuse, dropped out early, started selling things door to door.\r\n\r\n\r\nNikolas Hulewsky (02:01.556)\r\nship on shoulder.\r\n\r\n\r\nNikolas Hulewsky (02:06.372)\r\nBut it was on trailer street. I grew up in a trailer. OK.\r\n\r\n\r\nNikolas Hulewsky (02:19.636)\r\nGive me a year. When is this? He was born in 1973?\r\n\r\n\r\nChris Koerner (02:21.666)\r\nGive me your born in 73. Born in 1973, started selling door to door in like the late 80s, early 90s.\r\n\r\n\r\nNikolas Hulewsky (02:32.35)\r\nWell, he's younger than Grant Cardone and Tony Robbins.\r\n\r\n\r\nChris Koerner (02:35.96)\r\nYes, is.\r\n\r\n\r\nNikolas Hulewsky (02:37.544)\r\nSo how did they learn from him?\r\n\r\n\r\nChris Koerner (02:39.498)\r\nHe trained them.\r\n\r\n\r\nNikolas Hulewsky (02:41.38)\r\nyou train them specifically on internet marketing. got it, got it, got it. Okay. Okay. I'm up to speed. I'm a bit of a stupid idiot. Now I understand.\r\n\r\n\r\nChris Koerner (02:43.746)\r\nYeah, yeah.\r\n\r\n\r\nChris Koerner (02:53.452)\r\nHold on, let me pull up my notes so I get this right.\r\n\r\n\r\nNikolas Hulewsky (02:56.008)\r\nYou\r\n\r\n\r\nNikolas Hulewsky (02:59.848)\r\nOkay, so because Grant Cronone was already doing things in life, Tony Robbins was already, I mean, he's been a world famous motivational speaker for a long time. They were doing their thing. This guy, Frank Kern, either came to them or taught them like, hey, this is the ultimate distribution channel, the internet, selling to the masses, one to many.\r\n\r\n\r\nChris Koerner (03:20.15)\r\nYes. Yes. So let me back up. So he starts selling credit card processing door to door, which is a very, very hard sale. And then he says, huh, what if I sell credit card terminals on this new thing called the internet? So he starts selling critical card terminals on the internet for 300 bucks. See some success there, some success, but not a lot. And then he, don't know how his mind goes there, but he thinks, what if I start selling pet training manuals on the internet via audio books? Okay.\r\n\r\n\r\nNikolas Hulewsky (03:26.868)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (03:50.626)\r\nThat's what he did. That's where he made his first millions. I want you to guess how many pet training manuals this guy sold over the course of seven years.\r\n\r\n\r\nNikolas Hulewsky (03:59.838)\r\nSeven years, number of pet training manuals, 100,000.\r\n\r\n\r\nChris Koerner (04:04.878)\r\n$300,000 for $47 a piece.\r\n\r\n\r\nNikolas Hulewsky (04:09.3)\r\nGeez Louise, what does that come out to? $12 million?\r\n\r\n\r\nChris Koerner (04:12.206)\r\n1414 male give or take basically 100 % margin it's an audiobook okay so now so now he's hooked\r\n\r\n\r\nNikolas Hulewsky (04:19.39)\r\nYeah, it was a digital. It was literally a digital course. It was literally a digital product.\r\n\r\n\r\nChris Koerner (04:23.586)\r\nDigital course. Yep. And what happens when you start selling digital products, you become Tai Lopez Jr. Okay, before Tai Lopez was Tai Lopez, he was addicted. So he starts, like, he just invents all these terms that Alex Hormozi talks about on a daily basis. Alex Hormozi is white labeled Frank Kern. That's not a joke. Like, Alex Hormozi. Probably.\r\n\r\n\r\nNikolas Hulewsky (04:29.972)\r\nAnd you get addicted.\r\n\r\n\r\nNikolas Hulewsky (04:49.022)\r\nDid Frank Kern invent the term white label?\r\n\r\n\r\nChris Koerner (04:52.352)\r\nAlex Hormozi took everything Frank Kern did and like packaged it in like a social media way that Frank Kern never really excelled at. He's got a YouTube channel, he's got Instagram, but he's not very big on any of them. That's why most people haven't heard of him. Alex Hormozi put it in his books, $100 million offers, $100 million leads, and it's all he talks about in his content. And it's basically all built on Frank.\r\n\r\n\r\nNikolas Hulewsky (05:16.212)\r\nI love this because there's like seven frameworks I'm already thinking of.\r\n\r\n\r\nChris Koerner (05:19.342)\r\nMm hmm. Mm hmm. Okay. All right. So Frank Kern.\r\n\r\n\r\nNikolas Hulewsky (05:21.364)\r\nKeep going.\r\n\r\n\r\nChris Koerner (05:28.61)\r\nHe has an eight step process for selling anything. Okay. Here's a framework before you get to your frameworks. Here's mine.\r\n\r\n\r\nIf you want to learn how to sell or to market things, you don't buy any courses from the gurus and the marketers. I take that back. You do buy the courses from the gurus and the marketers, but not to read what's in the courses, but to reverse engineer how they're doing it. Okay. How they sold you, what their funnels are like, how often are they emailing you? Are they texting you? Are they calling you? Is there a VSL, a video sales letter? Is it, is it a one landing page? That's a mile long on a click funnels form. Like there is so much more to learn.\r\n\r\n\r\nNikolas Hulewsky (05:50.868)\r\nHow they sold you.\r\n\r\n\r\nChris Koerner (06:05.976)\r\nfrom the funnels that these guys employ then from the actual content that they're selling. But a lot of times you have to buy the content to learn the funnels, right? Alright, so go ahead. Exactly. OK, so this is the. Eight step process for selling anything in the world as invented by Frank Curran and I only found this Nick on the Warrior Forum. Sorry Warrior.\r\n\r\n\r\nNikolas Hulewsky (06:13.448)\r\nRight. Yeah, yep. Because it wouldn't be, they wouldn't be using it if it wasn't working.\r\n\r\n\r\nChris Koerner (06:35.598)\r\nforum message boards. So I went deep 16 years old. found this post. Okay.\r\n\r\n\r\nNikolas Hulewsky (06:37.342)\r\nYou and Deep.\r\n\r\n\r\nNikolas Hulewsky (06:42.548)\r\nAll right, so am I gonna be like a 70 year old woman that you're about to sell to?\r\n\r\n\r\nChris Koerner (06:46.56)\r\nExactly. Here's how to sell anything in eight steps. Number one, here's what you get. Okay, you list out all the products and features. Okay, boom, boom, boom, boom, overwhelm them with value. Number two, establish the value. All right, this product is worth $3,000, but you're getting it for 30. This product is worth da, da, da. So list everything out in the beginning.\r\n\r\n\r\nNikolas Hulewsky (07:05.748)\r\nMm.\r\n\r\n\r\nAll these components combined are $17,000, but we're giving it to you today for the low price of $16.99. Yeah.\r\n\r\n\r\nChris Koerner (07:11.98)\r\nExactly.\r\n\r\n\r\nExactly. And we've seen this stuff, but we don't really know the framework around it or why it's a framework. Number three, number three bonus. And you know what? I shouldn't be doing this, but go ahead and buy this. And I'm going to add it. So now they're like, Oh my gosh, this is so much value. Oh, only for the cost.\r\n\r\n\r\nNikolas Hulewsky (07:31.297)\r\nyou would add that? Is it coming out of your paycheck? I'm so sorry.\r\n\r\n\r\nChris Koerner (07:35.692)\r\nOnly for the cost of a cup of coffee per day, I'm gonna get all this? Okay, the bonus is number three. Number four, price. Then you drop the price, okay? You hit them at the price, but you're only half way through the steps.\r\n\r\n\r\nNikolas Hulewsky (07:46.11)\r\nHmm. You anchor. So you anchor them with a high price and then by number four, you're already dropping the price.\r\n\r\n\r\nChris Koerner (07:53.358)\r\nYeah, because when you hit the value, it's like, Oh my gosh, this is $25,000 worth of value. Like, he's probably gonna give me a discount and sell it to me for 20,000. Right? Like, I guess that would be that's a good deal for me. 20,000. Oh, geez. Okay. And then you hit him with the price and you're like, it's only 4997 $5,000. That's it. Not 20, not 25. Only 5000. Right?\r\n\r\n\r\nAutomatically, they're like, geez, that's a that's a big value, but you're not done. You're only halfway through the steps here. Number five, you got to trivialize the price. This is a Frank Kern quote, an FKQ. OK, trivialize it, which is like, listen, really, if you if you divide that out and amortize it over 30 years like a mortgage, that's that's only like the cost of a cup of coffee per day. Right. That's nothing really. Five thousand dollars is nothing because how much is tuition at a top tier university?\r\n\r\n\r\nRight. Five thousand a semester bare bones. Right. Then\r\n\r\n\r\nYou add the guarantee and you know what? I shouldn't be doing this but full money back guarantee. You're literally stupid if you don't take me up on this. There's no risk. There's no risk. And I'm glad I just said risk because that's number seven. Risk reversal. Honestly, think of a used car salesman. Honestly, if I sell you this Camry for $9,800, I'm kind of worried about my job. Honestly, my manager is not going to be happy about this because he told me out the door,\r\n\r\n\r\nNever sell this Camry for under $12,000 and you're going to get for 9,800. So really, I don't even, I'm kind of changed my mind. Honestly, this is a big risk for me, right? You turn it around.\r\n\r\n\r\nNikolas Hulewsky (09:34.42)\r\nI'm feeling like I want to buy now. What are we talking about? I don't want you to get fired. I don't want you to get fired, but I want to get a good deal.\r\n\r\n\r\nChris Koerner (09:39.928)\r\nGeez, I'm hmm. I might buy this camera for myself. This is such a good deal. Risk reversal. That's number seven. That's at the end. Okay, almost at the end. Number eight. This is the most important. Scarcity. You have to have scarcity. And I went to perplexity and I dug deep on every time that Frank Kern has put an offer out there with scarcity. And I saw a current modern day example of\r\n\r\n\r\nOkay. So 13 years ago in the same warrior forum, which is a, a, a message board for degenerate internet marketers. Okay. 13 years ago, there was this viral message board post of this angry guy saying, Frank Kern just released his new course, but what the heck? The order page was only open for 15 minutes and then he closed it. Did he actually sell out or is this yada yada yada? And then like everyone was arguing saying like, it doesn't matter. It's genius.\r\n\r\n\r\nNikolas Hulewsky (10:18.612)\r\nHahaha\r\n\r\n\r\nChris Koerner (10:37.944)\r\nWe're all arguing about it and talking about it because his order page was only open for 15 minutes. He only let people buy it for 15 minutes. He might've sold four. He might've sold 4,000. We don't know, but he was doing that 13 years ago and he's doing that today. And I'll give you an example in a minute. So you think there's something to it, right? Scarcity. You gotta have scarcity. Why would you not have scarcity when selling anything? Nick, give me a good reason. I'll listen.\r\n\r\n\r\nNikolas Hulewsky (11:02.548)\r\nI mean, it's FOMO.\r\n\r\n\r\nChris Koerner (11:04.576)\r\nalmost seriously. Yeah, we don't do it.\r\n\r\n\r\nNikolas Hulewsky (11:07.028)\r\nYeah, you have to instill some sense of urgency. Why now? Right? Because we may think it's the best offer. We may see all the benefits. We may know it may actually help us. But if we don't have a motivation to do it now, we'll put it off or we'll forget about it or something will happen in the intervening time period. So you have to build in a mentality of urgency and scarcity does that.\r\n\r\n\r\nChris Koerner (11:28.642)\r\nYeah, I look at like conferences, conferences sell half of their tickets, the day leading up to their event. But they start selling tickets a year in advance, six months in advance. There's no scarcity. There's no sense of urgency.\r\n\r\n\r\nNikolas Hulewsky (11:39.38)\r\nI had this name Spencer on my podcast. He does music festivals, lantern festivals, like 150,000. Oh, sorry. Nikonomics, the podcast exploring businesses. Anyways, so on my podcast.\r\n\r\n\r\nChris Koerner (11:49.39)\r\nWhat's your podcast called?\r\n\r\n\r\nChris Koerner (11:54.882)\r\nOkay.\r\n\r\n\r\nChris Koerner (11:58.702)\r\nAnd you only allow 10 downloads per episode, right? So.\r\n\r\n\r\nNikolas Hulewsky (12:01.832)\r\nYeah, honestly, that actually might be a really cool, that's a really cool idea that we should think about. Just like a way to start something in a podcast or social media. It's like Snapchat is scarcity, right? Like I can only see it once and it disappears.\r\n\r\n\r\nChris Koerner (12:06.638)\r\nYeah.\r\n\r\n\r\nChris Koerner (12:13.016)\r\nDude, that's just a whole framework apply scarcity to anything. Scarcity as a service, right? Like you could be a scarcity consultant, Nick. Yeah, I've got I sell a SaaS product. What's that? A scarcity as a service.\r\n\r\n\r\nNikolas Hulewsky (12:17.106)\r\nYeah, I freak. Okay, I'm gonna rip. I don't want to rabbit hole.\r\n\r\n\r\nAnd you I only take two clients.\r\n\r\n\r\nChris Koerner (12:31.758)\r\nKiller multiples.\r\n\r\n\r\nNikolas Hulewsky (12:34.118)\r\nAnyways, he was saying they had, I think, 200,000 people that attended their events last year. And then 50 % of their tickets they sell in the last week. And they do it on purpose. So you can buy for a year, but they wait till the last week because they know that if somebody goes to buy, they're going to be OK paying a higher price because they're like, yeah, I could have bought this ticket a year ago.\r\n\r\n\r\nI didn't know a year ago. So of course it's triple the price now. Yeah, it makes sense. In your mind, you're already justifying it and it's part of their strategy. So yeah, you have to have scarcity in any model that you're offering.\r\n\r\n\r\nChris Koerner (12:58.978)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (13:03.862)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nChris Koerner (13:11.458)\r\nYeah, but we don't do it like we all know this, but we break our own rules all the time.\r\n\r\n\r\nNikolas Hulewsky (13:17.012)\r\nSo let me, here's a couple of, I guess, tactics that I saw in those anchoring. So like he anchors you in a couple of like the price, that's a lot of money. Then he brings you down, right? Or he anchors you.\r\n\r\n\r\nChris Koerner (13:23.342)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (13:29.707)\r\nExplain from a negotiations perspective what anchoring is.\r\n\r\n\r\nNikolas Hulewsky (13:33.108)\r\nOh, thank you. It's a great question, Chris. So if I'm negotiating with you, Chris, and I want to buy your house, and you think your house is worth a million dollars, and I think your house is worth probably a million dollars, I know that there's going to be some back and forth. If I offer you a million, you're going to say, oh, that's the floor.\r\n\r\n\r\nChris Koerner (13:36.206)\r\nSo scripted.\r\n\r\n\r\nNikolas Hulewsky (13:55.636)\r\nI bet I could get more and you're going to come back and we're going to go back and forth and we'll probably settle at like 1.2 million or something like that. Even though we both went into the negotiation thinking the house is worth $1 So what I'll do is I'll anchor you. I'll come in with a very low ball offer. I'll say $500,000. And what that does is it reframes in your mind, not only the value of your house, but my perspective as a buyer. All of a sudden it goes from, this guy has a lot more money to he's only offering $500,000. I guess if I move him up.\r\n\r\n\r\nto $900,000. I just almost doubled his offer, right? Or even if you get a million, it's like, well, I started at 500, but I got up to a million. So there's a psychological effect on the part of the buyer who's like, I got a win here. But it just starts the negotiations at a much better place because you know there's going to be this back and forth haggling. And that's what he does. He anchors you at this. The value of this is $25,000. Names all the benefits, goes through it, blah, blah, and you're thinking in your head, man, I can't afford this. And then\r\n\r\n\r\nChris Koerner (14:28.43)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (14:52.968)\r\nhits you with a, I could offer it to you for 500 bucks. And then he reinforces it over and over. I'll probably lose my job. I don't know. You know, like the reverse risk, tons of emotional manipulation, tons of emotional manipulation. I'm probably going to lose my job for this, but I think I can, I think I can get this, I think I can get this figured out. The guarantee, man, you're creating a no risk scenario for people.\r\n\r\n\r\nChris Koerner (15:02.711)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (15:11.79)\r\nI don't know if you're allowed to do that.\r\n\r\n\r\nNikolas Hulewsky (15:22.482)\r\nAnd reason the no risk scenario is so important is not because you're worried about giving the rebate or the refund, but you know that most people are not going to get the refund. Do you know there are billions of dollars worth of gift cards that have gone unclaimed? And it's because people have those gift cards and they just don't spend it. They just keep it there. Like that's real money on a card. Yeah, that's not even a refund. That's just, I had the money there and I didn't do anything with it. So.\r\n\r\n\r\nChris Koerner (15:39.224)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (15:45.368)\r\nfirst principles. Yeah, we're human.\r\n\r\n\r\nNikolas Hulewsky (15:52.04)\r\nThe guarantee makes you psychologically feel like, there's no risk to this. But you also know that a certain percentage of those people are never gonna even call to get the guarantee. Yeah.\r\n\r\n\r\nChris Koerner (16:01.484)\r\nYeah. And like I talked about this about LCD cycle on a podcast earlier this week, we started the lifetime return policy. We were the first company in the industry to do it. And I just assumed, all right, three to 5 % of people are going to do that. So let's just raise our prices by three to 5%. And that's a guess I could be way wrong. And we could, you know, have to reverse that decision, but it was more like 2%. So we netted out ahead and now everyone in that industry does it.\r\n\r\n\r\nNikolas Hulewsky (16:26.15)\r\nAnd it's really smart from a selling perspective because what you're trying to do in any environment is build trust. You need them to trust you in order for the sale to close. And by offering the guarantee, even if they never use the guarantee, it's like, they're willing to give a guarantee? I trust them and their product. And many people use that for evil. think people who have good intentions use that a lot of times, but here are the frameworks that I thought. Sorry, go ahead.\r\n\r\n\r\nChris Koerner (16:32.152)\r\nMm-hmm. Yeah.\r\n\r\n\r\nChris Koerner (16:48.202)\r\nI was gonna say it's like we've talked about like to sell anything you need to get someone from like they don't know who you are they don't trust you to they're your good friend because we buy from our friends and family right so getting them to trust us a little more just moves them further down that spectrum\r\n\r\n\r\nNikolas Hulewsky (17:01.192)\r\nRight, right.\r\n\r\n\r\nNikolas Hulewsky (17:06.612)\r\nAll right, so here's some of the frameworks that I saw as you were talking. The first one is Alex didn't reinvent anything. He just copied. He took exactly what's been done and he copied it. And a lot of times we think, well, I've got to add my spin on this. I've got to do something new. Like just go copy what's already working.\r\n\r\n\r\nChris Koerner (17:29.634)\r\nYeah. And like naturally though, when we copy something, we're going to add it to our personal experience of let's say turning around gyms, right? And it will become our own naturally. But we don't have to like be deliberate and purposeful like, all right, I can't just copy this. I got to make this no like copy it and then see where that takes you. And then it naturally will become your own.\r\n\r\n\r\nNikolas Hulewsky (17:36.66)\r\nFor sure.\r\n\r\n\r\nNikolas Hulewsky (17:50.768)\r\nThe second thing, well, before I move on, I just think there's, I've fallen into this trap where I want to do something. Social media, for example. I want to post this video. Okay, Nick, we'll do this thing and that's what's going to work. Nah, everybody does that. I want to do my own thing. And then you learn, you're like, well, there's a reason why everybody does. Follow me for more because a lot higher percentage of people actually follow you if they read your posts, right? If it's working, it's working for a reason. Don't be afraid or ashamed to copy.\r\n\r\n\r\nChris Koerner (18:07.33)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (18:10.723)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (18:15.576)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (18:20.18)\r\nI think the second thing that I found interesting just hearing about that is – and and I talked to James Camp this week. My episode is not going to come out for a little while, but one of the things he said was, people crap on course creators or information sellers. He's like, but anybody who's built a business, anybody who's actually gone through the process and scaled and sold understands how operationally intensive it is to build something of value. so when you see money coming in,\r\n\r\n\r\nfrom selling knowledge, from selling a course or access or coaching, and you're like, wow, I can do this and make this living without having to do all of the operational headache. It's very understandable why they sell info products. And I think anybody who hasn't done it just does not have an appreciation for the decision-making process. And yeah, they're a guru. Ooh, they're just selling people on the dream. but until you've actually built something and you understand how hard that is.\r\n\r\n\r\nalso don't understand the appeal of this is cool. I get to help people at scale. get to sell an idea and information. This is much easier than scaling up a business.\r\n\r\n\r\nChris Koerner (19:23.266)\r\nWell, dude, like to support your point, I forgot to tell you in Frank Kern's story, before he sold $14 million worth of pet training manuals, he bought a course for $150 from someone and that taught him skills to sell those. So that like A, set the president for him selling a course because he knew it was a thing. B, helped him make $14 million.\r\n\r\n\r\nNikolas Hulewsky (19:35.133)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (19:45.022)\r\nI just posted about this. There's a lot of crapping on course sellers. And I think for good reason, there's some weird stuff that people do. Like I heard some of them have hardline sales tactics where they'll have you finance the course. they're like, it's only $10,000 and you can finance it. And it's like, yeah, people who can't afford it, I don't know how I feel about financing, whatever, that to the side. But I posted, if you're going to buy a business, you need to either buy a course, attend a bootcamp or hire a coach.\r\n\r\n\r\nAnd then I got some people who were like, well, actually, why didn't – you should actually have a CPA and a lawyer. And it's like, yeah, those are table stakes. No, duh. Of course, I have to have a CPA to do with my quality of earnings. Of course, I have to have a lawyer write up the purchase agreement. Of course, I need to have potentially a broker that I pay help me understand what's going on in the smart – of course, I'm not saying that. But if you're going into something and you have no experience, it's a cheat code. I'm going to pay someone to teach me quickly and I can jump the line. I don't have to go through the iterative process. I think that\r\n\r\n\r\nThere's a real place in the market for people who sell info products.\r\n\r\n\r\nChris Koerner (20:47.702)\r\nYeah, it's funny. We talked about Alex hormones. He just copying Frank Kern because Frank Kern, he just copied this guy named Gary Halbert. Remember the national inquirer? Like the crazy sensationalist headlines that was all Gary Halbert and Gary Halbert had this framework that he called the desperate nerd theory, which was basically like, even this freaking idiot over here lost 80 pounds, right? You could too. Like he invented this direct response style marketing.\r\n\r\n\r\nNikolas Hulewsky (20:56.392)\r\nHmm. Yeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (21:10.408)\r\nHahaha\r\n\r\n\r\nChris Koerner (21:17.006)\r\nFrank Kern learned from him, put his own spin on it. Alex Hermosy learned from him, so on and so forth. And before Gary Halbert, there was a dude named Claude Hopkins who had this marketing method that he called scientific advertising that basically appeared to, or appealed to first principles that Elon Musk always talks about to get people to buy more of your stuff. like, there's always been marketers, nothing's original, right?\r\n\r\n\r\nNikolas Hulewsky (21:39.39)\r\nYeah. Okay, so two more frameworks. One framework was, or not framework, but just observation. He went from selling payment processors to selling, what was it? Pet training videos or pet training books? Okay. Credit card terminals to pet courses, essentially. And you look at that on its face and you're like, the freak was that? But there's two things in there. Number one, when you start the process, you don't know where you're going to finish. And so you need to be flexible.\r\n\r\n\r\nChris Koerner (21:51.926)\r\nNo, credit card terminals.\r\n\r\n\r\nNikolas Hulewsky (22:08.796)\r\nAnd I don't I'd be really fascinated to hear how he went from credit card terminals to pets. So because I'm sure maybe he went door to door and I was like, no, everybody kept talking about their pets. And I had this idea like there's something in there that he saw and he was flexible and he moved on it. The second piece of it is the only reason he was able to take advantage of that is because he had obviously amazing sales skills. He had this skill set. He was trying to apply it to this credit card terminal process or whatever wasn't working. Then he sees the pets and he's like, cool, I can apply my skill set here. So.\r\n\r\n\r\nChris Koerner (22:13.347)\r\nYeah.\r\n\r\n\r\nChris Koerner (22:29.304)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (22:38.388)\r\nIt's like he had no pride about it. He just saw what was working and he moved to where it was working. So I think those two observations are really interesting. Sometimes you don't know what the idea is going to be until you actually get in the weeds and start working on it. And then two, you really need to be opportunistic about where your particular skillset works and then go all in on it once you see something working.\r\n\r\n\r\nChris Koerner (22:55.34)\r\nYeah, like I bet I bet you anything. He started going door to door. He's probably desperate broke. He sees some success. He learns how to sell and he's like, okay, there's something to this sales thing. And you know what? There's something to this credit card industry thing. But going door to door sucks. Hmm. Well, I heard about this internet thing. So what if we sell credit card processors, or like the actual hardware on the internet? So then he starts doing that. wow. internet money is pretty cool. But like shipping stuff really sucks. This is not fun.\r\n\r\n\r\nHow can I keep making internet money without having to ship stuff? Hmm, what about like an audio book that people can just download? In retrospect, you can see the dots that he connected, but in the moment, he was just fricking trying stuff. He was testing everything except drugs, maybe drugs too, I don't know.\r\n\r\n\r\nNikolas Hulewsky (23:29.257)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (23:36.82)\r\nAnd there's a million examples of this too, right? Amazon started selling books on the internet and then all of a sudden they started selling a bunch of products on the internet and then they started growing and they're like, crap, we have demand. Let's start selling these product skews. So they start adding more product skews. Then they have so much demand, their servers are out of whack. So they got to find more more server space in order to meet the demand of people going online and buying their products. Then they get to the point where they're like, the server space is a cost center. It's so expensive for us. How could we solve this problem? I don't know.\r\n\r\n\r\nChris Koerner (24:05.07)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (24:05.864)\r\nmaybe let's buy some servers ourselves. Let's stand up our own server center. So then they stand up what has become AWS, Amazon Web Services, and they start building it out and they realize, hmm, we have all this excess capacity because we bought all these servers, we're doing it for growth, all these other companies have a need too. Let's start selling our excess server space. And now the most profitable unit of their business is Amazon Web Services. If you look at any profitability from Amazon, it is not from their core business, which is selling things online, it is mainly from Amazon Web Services. And it all came from this like, you start as a bookstore online,\r\n\r\n\r\nto Amazon Web Services doesn't make sense, but you look at the dots that connect it and Jeff Bezos was obviously maneuverable enough to say and seize the opportunities when he saw them.\r\n\r\n\r\nChris Koerner (24:44.567)\r\nExactly. The whole reason I found out or I dug deep on Frank Kern is because we were supposed to bring an AI idea to this episode, right? And so I start looking and I am so we've talked about high level a few times. They have these award ceremonies every year called the SASpreneur Awards and they have the silver, gold and platinum award. Silver award means you have over a hundred SAS customers on their platform.\r\n\r\n\r\nGold is 500, platinum is 1,000. if anyone listening to this Googles Sasspreneur Award, go high level, you'll see this list.\r\n\r\n\r\nNikolas Hulewsky (25:23.472)\r\nDo they they're awarding these to affiliate marketers?\r\n\r\n\r\nChris Koerner (25:26.264)\r\nto their customers that are white labeling high level to build businesses. Yeah. And so if I'm like looking for ideas, I'll go to this website and look at who won all the awards for 2024. And I know I can reverse engineer what their MRR is because I know how many customers they have and I can see on their website what they're charging. Okay. So I was doing this and one of the gold awards is it's amazing. One of the gold award winners was it was called Rainmaker AI.\r\n\r\n\r\nNikolas Hulewsky (25:29.62)\r\nGot it. KKK, got it.\r\n\r\n\r\nNikolas Hulewsky (25:50.068)\r\nI could love that. Yeah.\r\n\r\n\r\nChris Koerner (25:56.408)\r\nSo I go to this website and I had no idea what it was or who was behind Rainmaker AI or what it even did. So I go to this website and it's rainmakerai.com and it says rainmaker, this is the whole website. There's nothing you can click on. Rainmaker AI has done the unthinkable, all caps. friend, and look, that's copywriting, right? Copywriting is get person, get the person to the next sentence. Do whatever you can, just get them to the next sentence.\r\n\r\n\r\nNikolas Hulewsky (26:14.324)\r\nWhat? Tell me more.\r\n\r\n\r\nChris Koerner (26:24.814)\r\nOkay, so Rainmaker AI has done the unthinkable. Well, I have to keep reading because what did they do? Right? Yeah. So it says we have stopped accepting new customers. Okay, why would I keep reading? I want to know why. Okay. All right. The reason why is we already have a lot of existing customers who pay us every month. Oh, geez, why do you have so many customers? That sounds nice. How can I have a lot of customers?\r\n\r\n\r\nNikolas Hulewsky (26:29.758)\r\nWhat? I can't even think of it.\r\n\r\n\r\nNikolas Hulewsky (26:46.516)\r\nWait a second. To quote Greece, tell me more, tell me more.\r\n\r\n\r\nChris Koerner (26:52.27)\r\nThey okay, they are awesome. And we really like them a lot. Also notice this is very much Donald Trump language. And people have studied this he speaks it like a third or fourth grade reading level and that's strategic rainmakerai.com\r\n\r\n\r\nNikolas Hulewsky (27:04.456)\r\nWhat's the website?\r\n\r\n\r\nNikolas Hulewsky (27:09.052)\r\nRainmakerai.com. Okay, let me reread this for you. Dear friend, we've stopped accepting new customers. The reason why is we already have a lot of customers, the most, the best customers who pay us every month. They're awesome. We like them a lot. They're the best. They just called me yesterday. They said, hey, listen here, AI Rainmaker, you're the best customer we've ever had. And I said, that's true. Have you seen a lot of people? I'm getting a lot of people who are coming to me. They're sending me their worst customers. I don't want those customers.\r\n\r\n\r\nChris Koerner (27:12.27)\r\nOkay. Okay.\r\n\r\n\r\nChris Koerner (27:31.458)\r\nA lot of people.\r\n\r\n\r\nNikolas Hulewsky (27:38.556)\r\nI want the best art. Sorry, keep going.\r\n\r\n\r\nChris Koerner (27:40.11)\r\nHe's a marketer.\r\n\r\n\r\nNikolas Hulewsky (27:43.262)\r\nDude, he's the freaking best. is so I love him or hate him. That guy is a savant when it comes to marketing. Yeah.\r\n\r\n\r\nChris Koerner (27:49.016)\r\nHe's a marketer. Yeah. And people anyway, so he's using a third grade reading level. They are awesome. And we really liked them a lot. Like my eight year old would write that sentence. Okay.\r\n\r\n\r\nNikolas Hulewsky (27:59.217)\r\nDude.\r\n\r\n\r\nSo true.\r\n\r\n\r\nChris Koerner (28:02.798)\r\nSo it's like, on the base level, wow, this guy's an idiot. He doesn't know how to write on the cert, you know, go a little deeper. This guy's a genius because he's writing like an idiot. Okay. So next line. So we're putting 100 % of our focus on creating the best experience possible for them. When we're ready to take on customers, you'll know, thanks for stopping by. So I'm like, what is going on here? Who doesn't? and my first thought was, all right, so they went out of business. Got it. Okay. And then I keep depth deep.\r\n\r\n\r\nNikolas Hulewsky (28:10.11)\r\nYeah. Yeah. Yep. Yep.\r\n\r\n\r\nNikolas Hulewsky (28:29.086)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (28:30.998)\r\ndiving in rainmaker and it's like, this is Frank Kern's company. This is like his, his go high level white labeled CRM business dashboard that he's selling to people that buy his course only. So he doesn't need a landing page because he's pushing this to people on his email list through a different URL. It's scarcity. more scarcity.\r\n\r\n\r\nNikolas Hulewsky (28:51.852)\r\nAnd when they get it and they click on it, they're like, what is this? We're not accepting new customers. wow. Frank's letting me. Wow. Holy crap. This software is only being accepted by people he invites and he invited me? my gosh. All right. I guess I'll do it.\r\n\r\n\r\nChris Koerner (29:01.282)\r\nNow I want it. yeah, I'm special.\r\n\r\n\r\nChris Koerner (29:08.65)\r\njeez. I guess I'll give them a lot more of my grandma's life savings. Huh.\r\n\r\n\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (29:18.152)\r\nThat's incredible. How much money is that one doing? You reverse engineered it. How much money are they doing?\r\n\r\n\r\nChris Koerner (29:19.15)\r\nAnyway, so this is like a...\r\n\r\n\r\nChris Koerner (29:24.398)\r\nI don't know what he's charging for it because I'm not in his community, but he has 500 to 1000 customers and a lot of people are selling the same thing, right? And they usually cost between 200 and 400 a month. So.\r\n\r\n\r\nNikolas Hulewsky (29:30.899)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (29:39.422)\r\nto the end user or to go high level.\r\n\r\n\r\nChris Koerner (29:42.902)\r\nNo, they pay go high level tiny fraction out to the end user.\r\n\r\n\r\nNikolas Hulewsky (29:46.772)\r\nOkay, so let's just say 400 for math's sake. So 400 times how many users in this community?\r\n\r\n\r\nChris Koerner (29:51.054)\r\nLet's say 500. So that 200,000 a month. 20,000 a month. Yeah. 200,000. Yeah.\r\n\r\n\r\nNikolas Hulewsky (29:57.116)\r\nIt ends white labeled. It's $200,000 a month.\r\n\r\n\r\nChris Koerner (30:02.732)\r\nAnd his, his go high level bill is maybe a couple thousand dollars. Like with all those sub accounts.\r\n\r\n\r\nNikolas Hulewsky (30:09.076)\r\nIt's all customer acquisition. Dude, we've talked about this before. When a venture company goes and raises money and they raise it, it's a $50 billion valuation and they raised $100 million. Do you know where 50 cents of every dollar goes? It goes to Facebook and it goes to Google to acquire customers. That's not an opinion. That is a fact because the majority of those dollars are spent getting their name out there.\r\n\r\n\r\nChris Koerner (30:11.214)\r\nI'll see you later. Yeah.\r\n\r\n\r\nNikolas Hulewsky (30:37.236)\r\nand acquiring customers. So if you can understand sales and marketing and you build a distribution through social media or this, you know, Frank has figured out how to leverage the internet. The most expensive part of your business, which is the customer acquisition cost, all of a sudden becomes the biggest profit center of your business because you figured out a way to do it better than 99 % of people. And that's, that's why Alex Hermosy is successful. This Frank Kern is successful. That's why these course creators are successful at like.\r\n\r\n\r\nMarketing and sales, I used to crap on and not think that it was important. It's as important, if not more important than any other aspect of the business. I don't care how cool your product is or how good your operations are. If you don't know how to market and sell, you're done. You have no business.\r\n\r\n\r\nChris Koerner (31:17.176)\r\nWell, next, where do think the other 50 % is going? Okay, I'll tell you overhead and salaries, salaries to coders and developers, which AI can basically do now and is growing by leaps and bounds every day. Therefore the marketers are about to have their heyday again. So marketing is more important than ever. Attention is more important than ever because AI is taking all those binary tasks like code and, democratizing it.\r\n\r\n\r\nNikolas Hulewsky (31:41.885)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nSo on that note, I've been thinking a lot about AI since our last conversation, because our last episode was just all AI ideas, which was fun. It was awesome. And it just got me thinking. like, we have a lot of these types of ideas. Let's keep talking about them. I have a framework that I've been thinking about. I want to talk it through with you and see what you think.\r\n\r\n\r\nChris Koerner (31:59.149)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (32:03.746)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (32:05.214)\r\nI think there's two possible investment strategies when it comes to artificial intelligence. I think the first strategy is a cigarette butt strategy. Have you heard of this?\r\n\r\n\r\nChris Koerner (32:16.77)\r\nI don't think so.\r\n\r\n\r\nNikolas Hulewsky (32:17.874)\r\nOkay, so the cigarette butt investing philosophy strategy is what Warren Buffett started his investment career at, where you're just trying to extract as much value as possible out of something that has lost a ton of value and is probably going to continue to lose value. I think, I'm blanking on his name. Warren Buffett was a pupil of a famous investor and I'm anyways, at Columbia University.\r\n\r\n\r\nChris Koerner (32:42.743)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (32:44.402)\r\nWarren Buffett offered to work for him for free and the famous investor was like, it's too expensive because he knew how much it would cost. But this was his strategy, the cigarette butt strategy where they would see declining businesses and they'd buy into them. So some examples of this would be like Philip Morris. Well, around the world, smoking cigarettes, these types of products are consistently decreasing in their total volume.\r\n\r\n\r\nChris Koerner (33:04.873)\r\nliteral cigarette butt strategy.\r\n\r\n\r\nNikolas Hulewsky (33:12.136)\r\nbecause people are getting healthier and they're focusing on healthier things. However, the business is still exceptionally profitable. And so for the next 50 years, it's still gonna make really good money, but it's a shrinking market over time, right? Warren's first investment wasn't an investment, but type of a business, it was called, do you know?\r\n\r\n\r\nChris Koerner (33:30.382)\r\nis it textile?\r\n\r\n\r\nNikolas Hulewsky (33:31.486)\r\nBerkshire Hathaway. Berkshire Hathaway was a text. Yeah, it was a textile company and the textile company was declining year over year every year and I can't remember his exact thesis on it, but it was like, the value of this business on the balance sheet is greater than it's currently worth. I can get in there, extract the value and that was it was a reverse. I think it was a reverse public anyways. I can't quite remember what the circumstances were around it, but that was his first investment and then it changed. He and Charlie Munger got together and and they decided to then we're just going to buy\r\n\r\n\r\ngreat businesses at a fair price. And that to me is the investment strategy number two.\r\n\r\n\r\nChris Koerner (34:06.598)\r\nWait, I thought Andrew Wilkinson invented that,\r\n\r\n\r\nNikolas Hulewsky (34:09.658)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (34:13.556)\r\nDude, I can't wait to make a video with you where we talk about the top 10 red flags. Somebody says who's not an entrepreneur. That is one of my top 10 red flags is someone who's just like, I don't know. just, I just want to buy a good, great business at a fair price. I don't know. I know it's stupid.\r\n\r\n\r\nChris Koerner (34:28.686)\r\nIt's like, it's the non-LDS equivalent of saying, my management style? I don't know. I try to teach them correct principles and let them govern themselves. I don't know. I'm quirky like that.\r\n\r\n\r\nNikolas Hulewsky (34:38.196)\r\nI don't know where I got that from, but anyways. Anyways, to me, those are kind of two investment philosophies. One is I'm going to extract as much value as I can knowing that there's a finite shelf life on this because there's still value there, but people are fleeing it because it's not as long-term. Or I'm going to buy a great sustainable business with a moat, sticky customers, all of these other parameters, and I'm going to invest in that over time because it's a great business.\r\n\r\n\r\nChris Koerner (34:42.988)\r\nI probably made it up originally by myself.\r\n\r\n\r\nChris Koerner (35:05.869)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (35:08.658)\r\nSo I'm applying.\r\n\r\n\r\nChris Koerner (35:08.824)\r\nSo cigarette butt and what's the other, like what's the corollary to that? Okay.\r\n\r\n\r\nNikolas Hulewsky (35:11.828)\r\nLet's just say long-term. Yeah. So I think that applies to AI. I think that a lot of businesses that we talk about are cigarette butt businesses. we could implement this AI process to do X, Y, and Z. Like we're accelerating the transition to artificial intelligence. We are eliminating those positions, but after a certain amount of time, the ability to implement them or the actual usefulness of those AI tools is just going to be ubiquitous.\r\n\r\n\r\nstarting up an agency to implement this or a company that's just built around coding and collections. It's just they're going to not exist, but that market and opportunity that TAM is going to disappear over time because there's a short window of time where you can take advantage of it. That I think is the cigarette butt strategy. And I think there's a ton of cool applications for it. But I started thinking about sort of this long-term strategy where it's like, what is not going to be replaced by AI? What are the things that are going to\r\n\r\n\r\neven with AI, probably become even more important. And so that's the investment philosophy. What do you think of the way I'm thinking about it?\r\n\r\n\r\nChris Koerner (36:12.301)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (36:18.222)\r\nYeah, I'm totally with you. I know there's a million things I could say right now.\r\n\r\n\r\nNikolas Hulewsky (36:20.018)\r\nOkay. Okay. So from there, I took it a step further. Do you remember in the nineties when we watched cable and when you turn on the key, okay, when you turn it on, you're at the mercy of whoever the cable provider is and their plot and their programming.\r\n\r\n\r\nChris Koerner (36:27.532)\r\nMm-hmm. I still do when I go to hotels.\r\n\r\n\r\nChris Koerner (36:34.894)\r\nYeah, we talked about remember a Jerry Springer stop the scroll\r\n\r\n\r\nNikolas Hulewsky (36:38.408)\r\nThat's right, that's right. That is so funny. Second highest rated episode ever. So over time, people didn't want that. They wanted to be able to watch what they wanted to watch when they wanted to watch it. And so we got an unbundling with Netflix and Amazon Prime and all the other streamers. So you went from this old model and technology to this new model, which was streaming online. And now the new model is doing what Chris?\r\n\r\n\r\nChris Koerner (36:51.565)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (37:06.872)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (37:06.91)\r\nThey're rebundling. You've got Thursday Night Football on Amazon Prime. You've got sports, you've got video game, you've got a millionth live events now on Netflix. They're like rebundling these things and these streaming providers are going bankrupt and selling to the other streaming providers. And so there's consolidation happening. And I think there's this really interesting framework that happens where what's old has become new again. And you see it with trends in fashion. You see it with music.\r\n\r\n\r\nYou see it in the business cycles. You sound like you wanted to say something.\r\n\r\n\r\nChris Koerner (37:41.038)\r\nThere's a famous famous I don't know of anyone that knows about this tweet than I do. But I never sometimes you see a tweet and you never forget it. Right? This lives rent three in my head. January 17 2022 Jim Gaffigan the famous comedian tweeted, they should bundle all the streaming services together and call it cable. 13,000 retweets. So yes, that's why I'm smiling.\r\n\r\n\r\nNikolas Hulewsky (37:49.972)\r\nOkay? Okay.\r\n\r\n\r\nNikolas Hulewsky (38:06.068)\r\nIt's so good, dude. my gosh. So I've got these two ideas that were just popping in my head. One was the cigarette butt and the long-term investment. And then the other was what's old again, or what's old has become new again. And I started thinking, how could I apply that to AI? And there are some examples that are already happening. In-person events. We went from community being in real life\r\n\r\n\r\nto digitizing it and moving it to social media, social platforms. And now we're seeing a big shift to community again, in-person events, detox events, conferences, experiences, those types of things. And I think it's a really interesting framework to apply to thinking about AI and the age of AI and the opportunities. So here's, I made my first principles and I'm gonna list them out for you. I think prioritizing human interaction.\r\n\r\n\r\nSo businesses that prioritize human interaction, healthcare, gyms, fitness, conferences, focus on fundamental human needs, healthcare, food, purpose, religion.\r\n\r\n\r\nChris Koerner (39:10.552)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (39:22.228)\r\nscale your authenticity. So it has to feel like a human. Have you noticed on social media when you read posts now, like I've written some posts recently that are freaking bangers, amazing hook, amazing post. Here are the top 10 reasons why you should start a franchise today making $4 million a year. Like two years ago, that would have been a banger post and amazing, but now people are seeing it it's like, it's too good. It's too good of a post. did AI write that? It's too cura- even though\r\n\r\n\r\nChris Koerner (39:47.488)\r\nIt's too curated. Yeah.\r\n\r\n\r\nNikolas Hulewsky (39:51.13)\r\ndidn't use AI to write it. It's too good. People are self-selecting to things that are authentic.\r\n\r\n\r\nChris Koerner (39:56.59)\r\nis my daughter, my 12 year old daughter would call this being a try hard or pick me. That's what's called being a pick me. Also shout out to my daughter, her and her friend made made this at a farmer's market at least shout out keep going.\r\n\r\n\r\nNikolas Hulewsky (40:06.228)\r\nNikolas Hulewsky (40:10.26)\r\nShut up. then the last two. So leveraging the human nature. So like I think face to face interaction, just aspects of human nature that that persist over time and independent of technology. So a physical hug, a handshake, meeting in person, those types of things. So that's like my framework that I've created that I want to start thinking about more. And when we talk about AI ideas, it's not just going to be, hey, what's the thing we can automate?\r\n\r\n\r\nChris Koerner (40:19.363)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (40:40.296)\r\nto get us faster to the implementation of AI. It's also the, what's the business that's gonna be sticking around even after AI has taken over and we have way more free time than we know what to do. What are things that people are still gonna want and how could you create a business around that?\r\n\r\n\r\nChris Koerner (40:57.88)\r\nI just find it so fascinating how the pie just keeps growing. Like, like we've been expecting automation, technology, AI to take all of our jobs for years now. And the opposite is happening, right? Just look at people that want to start businesses, the aspiring business owner, how many of them from over the next five years are going to go start a tree trimming business versus an AI app, right?\r\n\r\n\r\nLike anything home services is going to be, already a huge opportunity. It was a huge opportunity five years ago, 10 years ago. It's going to be even more so of an opportunity because all the attention is going to AI, going to the internet and technology more than it ever has been. So it's just a bigger pie. It's a rising tide, right? So I'm at, I'm a thousand percent with you. we're, all going to benefit more.\r\n\r\n\r\nNikolas Hulewsky (41:33.288)\r\nMm-hmm.",
  "metadata": {
    "duration": "",
    "date": "2025-01-24",
    "platform_source": "Google Drive"
  }
}