{
  "episode_number": "187",
  "episode_title": "Building a Pickleball Club for Only $200 with Chris Koerner",
  "guest_name": "Chris Koerner",
  "business_name": "Bathtub Refinishing",
  "transcript": "﻿Do you see my tweet about building a pickleball club? I've spent $200 in ads. That's the whole club. That's it. I'm full. Anyone could do this. Like anyone that lives in an area where people have a metal building in their backyard that's not being utilized, you could go rent it from them. You could make a hundred grand a month off of this easily. I talked to this guy and it's like, I do bathtub refinishing. And I was like, what? He's got one or two employees that do the majority of the work. He's making anywhere between two and $500,000 a year. Bathtub refinishing is like,\r\n\r\n\r\nthe perfect business to start in any market. Is AI gonna come and refinish your bathtub? Like, no.\r\n\r\n\r\n\r\n\r\nWe've kind of talked about this idea before, but I'm kind of falling more in love with it, especially with AI. I think you could build an easy wrapper around it. And you, my friend, you in particular, I'm not talking about anybody else, nobody listening, screw the listener, you, you could make a hundred grand a month off of this easily. People struggle with staying consistent, true or false? 100%. What's the biggest problem with staying consistent? It's hard. It is hard. my experience.\r\n\r\n\r\nmy experience, it's accountability. Like there's no accountability loop that they've set up for themselves. If you say I'm to go to the gym tomorrow and you wake up at 6am, how easy is it to hit snooze versus if I say I'm going to the gym tomorrow and I'm picking you up at 6am, which one? It's nine days, right? There's actually somebody who's going to be there. They're going to hold you accountable and they're going to follow up with you. I think there's a huge opportunity utilizing AI to have an accountability partner.\r\n\r\n\r\napp, but it's not just an accountability partner app that pushes notifications. They're like, Hey, did you check in today? Hey, did you do X, Y, and Z today? It's an app that actually gets to know you and has conversations with you. So you told me this a long time ago. I didn't even know this was a thing. You can, it's, green bubbles, but you can, you can set up notifications to come to you through an API in a, in a text. So you can actually text with chat, TBT, if you want it to, you don't have to go to their interface. You could just like go to their phone number.\r\n\r\n\r\nand text them and then there's an API call that you have to pay for. So I would set it up that way. I would set it up so that the interface is texting. It's not necessarily an app. It's like, oh, this is a friend of mine who's asking me. But in order to get started, you've got to do this like comprehensive checklist. We've talked about quizzes before. I freaking love quizzes. So it's comprehensive checklist. Who you are, what motivates you, what do you struggle with, how do you like to be talked to? Please upload seven emails. It just gets to know you, your humor, whatever. And then it creates a custom chat bot that\r\n\r\n\r\neven if it's just uploaded to a single prompt that can interface with you and at least give you some tailored encouragement and guidance. So let me hit some stats to show you what kind of market opportunity this is. The wellness and productivity app market. Does that sound niche to you? does, but I know productivity is big business. I know, I know, but it's like, I, if I told you, yeah, I've got a business that we built a wellness and productivity app. You'd be like, I'm sorry. I have to sleep halfway through that sentence. What is it? Yeah. Yeah. It's an $8 billion market.\r\n\r\n\r\n\r\n\r\nWith a B. We could just get 1%. Bro, I'm just telling you, bro, if we could do 1%, that's $8 million, bro. Okay. So that's number one. Number two, what do people love about the self-help market, about the productivity market? They love coaches. They want to have a friend, a familiar face. So you don't just want a normal AI, do you? You want a friendly AI. You want a TKO AI. You want a current office who's going to be...\r\n\r\n\r\nYou want to turn her office is going to be like, Hey, did you get your cookie in the cookie jar? Okay. Did you get hit by that gay guy? We'll see. We'll see. You know what I'm saying? But it's going to be somebody that they that they know that they're familiar with that is like showing up to hold them accountable. There's this AI coach on this product called replica. Apparently there's over 10 million active users right now. And it honestly kind of looks janky. Sorry, replica. If you're listening, but\r\n\r\n\r\nI think that you could pretty easily, even if you weren't starting a new company, just build a wrapper for yourself of reminders, check-ins with a familiar chat bot that knows you well, that would hold you more accountable and have you achieve your goals much easier. And I think somebody like you or somebody who has a large audience could brand it as the Chris Kerner Accountability Partner. And boom, you've got a really easy app that holds people accountable. Because really the main thrust of the app is accountability. It's not\r\n\r\n\r\nChris Körner's personality. just so happens that it has part of Chris Körner's personality. What do think? I love it. Yeah, it's a no brainer. I've talked about a similar idea on this pod before a couple months ago. The only worry that I have for it is like, are there any stakes to that? Right? Like if you're showing up to my house to take me to the gym, there are real stakes there. I don't want to let you down, but are there really stakes to an AI app like bugging you? Or is it just as easy to ignore?\r\n\r\n\r\nas it is easy to ignore an alarm clock going off. So if I were to look at it and say the percentage of people who stick with their routine from an in-person conversation versus this, I think the in-person interaction is going to be higher. I just think that's the way that we are, period. But I think that this would be higher than no interaction at all. So if you had no interaction versus this AI interaction, I think this AI interaction is going to be better. I do think the outcomes will be better.\r\n\r\n\r\n\r\n\r\nbeyond that's why I think branding it with like a personality and the delivery mechanism being a text and not an app. It just feels more personal. If I get a text, even if it's true, like, your school is letting you know that you're some good out early today. Like it pisses me off because I'm like, why do they have my phone number? Whereas if that was in an app that I had to go to an actual look, I'm not gonna be pissed off, right? I just think a text is more personalized and then having your personality around it would allow for better accountability. It's true.\r\n\r\n\r\nYou could even work in like some AI calling to have a conversation. interesting. Where it's like, you missed your call today. And there's like some real stakes attached to it. Like maybe you have to, maybe you charge the card every time they miss a call. They have to pay for it somehow. Maybe, maybe it's a free app, but they only pay for it when they don't do what they're supposed to do. And so it's, like, it's a hundred percent free lifetime for everyone that does what they're supposed to do. This is a tangent. It's related, but totally different.\r\n\r\n\r\nWhy aren't personal trainers and coaches using AI more in their business? It seems like that would be the perfect, OK, here's the app. Log all of your information. Log everything that you're doing. And then for the coach, they don't have to spend the time necessarily reading all of that log. They just ask AI to tell them what they need to follow up with on their client. And they're saving like an hour or more a week per client, giving them better solutions, more tailored solutions. Feels like there is an opportunity even there to use AI. You could just use a wrapper.\r\n\r\n\r\nLike build a simple wrapper that is chat GPT, but for personal trainers that they pay for every month to make their their lives easier. The offer could be like save an hour per week per client with this $10 a month app. Well, and this was a continuation of the other idea, but you could build this internally. You could have an internal accountability mechanism for your company, right? Or it's like, OK, cool. And then the chat bot notifies everybody 24 hours after a meeting happened or it.\r\n\r\n\r\nit's set to notify you Chris of a deadline that you agreed to on a previous call 48 hours, 24 hours a week. you could have, Hey, notify Chris that this is due a week in advance, two days in advance and 24 hours in advance. You know what I mean? So it's not this like race at the last minute to kind of put something together. I love it. Okay. He loves it. He's speechless. All right. What do you got? I'm gonna take a left turn here. You ready? Roka.\r\n\r\n\r\n\r\n\r\nI gotta share my screen. Hey, I don't know if you remember this, but when we started this podcast, we entered into a social contract. I would spend time, energy and money producing this podcast, interviewing these individuals and giving you insights into how to build, buy, start, grow your business. And you would like, subscribe and leave me five star review. Now out of that, we both get to talk to really cool people and hear really cool insights. We both get a ton of value, but I just want to help you keep your word. So would you do me a favor?\r\n\r\n\r\nWe go leave a five-star review for me on Apple or Spotify. It would really help. And if you want even share this with a friend, do you see my tweet about building a pickleball club, a secret pickleball club? did. I did. Okay. So I've been using Facebook ads to generate leads and or pre-orders for this pickleball club. Okay. And I've talked about this a little bit on the pod, so I won't go into deep detail, but the whole business model is this 99 bucks a month.\r\n\r\n\r\nreserve a court, play doubles or singles with two, you know, one or three other people for 99 bucks a month, you're guaranteed the ability to play X times per month. And then you can pay extra to play more times per month. But I have no idea yet if people want to play 30 times a month, three times a month, will they even pay a hundred? Right. A lot of the people in the comments on Twitter were like, no one wants to go to a pickleball club if they can't be seen by other people playing pickleball. I'm like, dude, nobody wants to be seen playing pickleball. Where have you been?\r\n\r\n\r\nLike, are you kidding me? This isn't a gym. You know, it's not a flex. Never been a flex. In fact, it might be quite the feature for no one to see you playing pickleball, especially if you're a beginner. Dude, we've all been there. Your wife walks in on you late at night, 11 o'clock at night, practicing your pickleball grip. And she's like, what are you doing? And you quickly I don't think any of us have been there, Nick, you quickly put the paddle on you like having an affair. Don't want her to think\r\n\r\n\r\nthat you're playing pickleball. get it. Oh, that was my favorite comment. This doesn't work because most of these pickleball clubs have 15 courts and they want to be seen by other people playing. freak are they talking about? Maybe he's right, right? I wanted to know before I go get my septic system fixed and expand my building. I wanted to know. So I'm going to share my screen and I'm going to show exactly what I did to generate these leads. Okay. Wow. Okay. All right. Can you see my screen right now? I can. Yes.\r\n\r\n\r\n\r\n\r\nAlright, so I'm in meta ads manager right now and if you can just see the radius, this is the location of the shop plus six miles and I chose six because I didn't want to go all the way over here or up here. It's hard to describe, but I just kind of know where everyone lives in this area. Six miles was perfect for me and so Facebook says OK, oh there's 174,000 to 205,000 people within that radius and honestly.\r\n\r\n\r\nI had already done this math myself and I got 220,000. So it's like extremely close. Okay. You're an amazing estimator. I've always had that. Thank you very much. Yes, you have. And then I said, you know what, use your AI to show it to the people in that radius that you think want to see it. So I didn't say show it to people that follow me, show it to people that interact with my stuff, show it to pickleball players, show it to boomers. I didn't say any of that show to whoever you want, as long as they live here, because they do have to live there. Okay. Okay. Does that cost more or less than you just telling it exactly what you want it to show?\r\n\r\n\r\nIt's mean, it's mean edge. Sorry, that was Hungarian. I'm sorry for our audience who didn't who didn't know what that meant. It makes no difference. Okay. If there is a difference, I don't know what it is. So then I tried multiple types of ads. did the same video, but I tried instant form where you get their name, email and phone all within the Facebook ecosystem. And then I just did a link to a type form. And then I did instant form.\r\n\r\n\r\nthat forwarded to the type form afterwards. And the third one one is like the best bang for your buck is I captured their name and their email before I get anything else. And then I auto direct them to really share. Yep. I'm gonna share this type form. Was there ad copy? Like what was the ad that you're showing them? I'll go back to the ad copy and show you that even before the ad copy. Why did you decide to go to Facebook? Like why not go to perplexity and do some research like\r\n\r\n\r\nHow is this better than going to say a deep research LLM? I mean, that's just all hypothetical, right? Like I wanted real people in this area to tell me would they pay for this. Most importantly, how often do they want to play? What time of day do they want to play? Do they do play in doubles or singles? Because those are all very relevant. If everyone plays singles, then I can only have half as many members. If they all play doubles, I can have twice as many members. If they all want to play 30 times a month, then I can only have 50 members. If they all want to play 10 times a month,\r\n\r\n\r\n\r\n\r\nI can have 200 members, you know, but right now all of this is just hypothetical. ChatGPT got me there, right? So to your point, it got me to here, but I don't know if real people actually desire those things yet. So like going to do deep research or perplexity, that's static data that anybody can go access. This is dynamic data. This is like real time, whether or not people want to use it, how much they'll pay, et cetera. Yeah. All right. So here's what the ad is. And this is one of three variations that are all pretty similar. Secret Pickup all opens on July 30th.\r\n\r\n\r\ncapping the memberships 24 seven key card access reserve a court when you need a court one private court lounge vending machines bathroom shower all close to home Alan Lucas Fairview Murphy Parker Wiley become a founding member here so I added that myself Parker obviously because I didn't want to wait for my editors to do it yeah so it's like there's a I could have put like an overlay of what it looks like this ad yet I could have done so much more but first of all with all that see what amazing ad thank you like\r\n\r\n\r\nJust the way you painted it, scarcity. It's secret, so it feels exclusive. Like you're whispering. Like even though I could just turn my AirPods up, it's like I'm leaning in like, whoa, wait, what's going on? It's just, oh gosh, it so good. Thank you. Thank you. I named the cities, right? So they know this is, cause those are small cities that I named. They know this is personal to me, right? Yeah. Here are my results so far. 74 leads, $2.64 per lead. Okay. Okay. So you've spent 150 bucks.\r\n\r\n\r\nI spent 200 bucks to get 74 leads, but it gets better. And what you're seeing here, you see how there are these line breaks with no data. these line breaks with no data are people that filled out the Facebook instant form and I got their name and phone, but then they didn't go to the type form. And so the people that did give me all this info, they're usually on the row right next to the person that I got their instant form data and their type form data. And it's a 19 question type form like\r\n\r\n\r\nI'll share my type form. what was in the questions? So this is the intro one prompt AI generated ugly logo. This is the concept. Here's what it looks like. 99 bucks a month. Boom. How can we reach you name and phone? What's your T shirt size? So I put that in the beginning so they can see like, oh, I mean, I I'm free. Hey, I want to keep going on this one. So get something free, you know. What is your pickable skill level? This is like how pickleball players are rated and I didn't know that till I asked you LGBT so I just paste it doesn't.\r\n\r\n\r\n\r\n\r\nHow many times do you currently play per month? How many times do you plan to play per month? Because I'm assuming they're going to want to play more than they do now, if it's convenient nearby. How long do you play for? What time of the day would you prefer to play? That's very important. You play doubles or singles. Would you pay $99 a month for everything described? Yes, no other. How many friends do you have that may be interested in joining? Because they play doubles, that could be three other people, right? Would you be interested in an ambassador program where we would reward you for bringing friends on as members?\r\n\r\n\r\nwhich I'm not going to do because the demand has been so good. There'd be no, no reason. What's the point? I have a fixed supply, right? So I'm not going to give out discounts. And then is there anything we should change about pricing? And I got some really good data here. Like, man, this other club charges 15 bucks per or maybe I'll want to bring a guest, but he's not a member. Can he just pay 10 bucks? Like really, really good data. What else would you like this pickleball club to have? People were like, I'd like a room to practice my dinks or there's this\r\n\r\n\r\n$2,000 machine that will serve to me. I'd like to practice by myself. Like I didn't know any of these things. And then I put on a scale of one to 10. If this club has all the features I describe, how likely are you to become a founding member at $99 a month? 10 equals take my money and one equals get lost. And then any other questions. So then if you go look at the results, so it's, it's very interesting. Go ahead. with the 75 leads, people who 75 people who filled out the 19 question type form or\r\n\r\n\r\nWas it even those people who gave their name and number but didn't fill out the type? Does that make sense what I'm asking? Yeah. So 74 people filled out the instant form and I got their name and number and then 55 or 42 people filled out the type form. So over half did both. Okay. Before I color it with my opinion, if I'm listening to this and I hear you say, I did this quiz, I got all this information and 55 people answered me.\r\n\r\n\r\nor filled out 19 questions. I might think that that's not a lot of people. Yeah. How do you feel about the response to the survey? Think of it this way. Let's say that the average member brings one other member. And by nature of this, it's not like a gym. You don't need to bring a friend to a gym. Most people don't, right? With this, you can't play by yourself. So let's just say conservatively, every person brings another person. So that's $200 a month from one person, right?\r\n\r\n\r\n\r\n\r\nbecause they have to all be members if they're playing doubles or singles. Let's say they stay for a year. Maybe it's two months. Maybe it's 10 years. I don't know. Let's say a year. It's $2,400 LTV lifetime value of each person. I just spent, now let's go to this column P, one 10 scale. How likely are you to join 10, nine, eight, seven, seven, seven, seven, Like these are high intent people. And then over here.\r\n\r\n\r\nWould you pay? Yes, yes, yes, yes, yes, yes, yes. Like I'm asking them multiple times. Number of friends did you bring one to two, four to six, seven plus four to six, four to six. Like they could be bringing four on average. So it's like $2,400 lifetime value. And I've spent $200 in ads to potentially sell out the whole club. Right. Dude, I'm so glad you answered it that way. Cause like anybody listening, you hit the nail on the head. It's not necessarily the total number of people that responded. It's.\r\n\r\n\r\nthe number of quality people that responded. Yeah. Have 50 plus people who filled out 19 questions and probably the average rating of how interested they are. Let's just say is an eight or seven and a half. That's the whole club. Like you just launched a business. Yeah. You're full off of half of those people potentially, right? Like it's, it's such good data for you because it was such a small geographic market. It was such a niche number of people demographic. Like this response kind of blows my mind to be honest.\r\n\r\n\r\nIt's crazy. like this, my costs on this would be insurance, a cleaner, some tech, wifi utilities. There's probably 30 to $40,000 upfront, but if I'm sold out, that's 20 grand a month top line, maybe 16 grand a month bottom line. Like, what are we talking for? Hold on. For $200 in ads. Yeah. Oh, let me just, Hey Warren. Yeah, Warren, is that a good investment or a bad investment?\r\n\r\n\r\nOkay, it's good. Yeah, Warren Buffett says that's a good investment. Yeah. So like incredible. It's just, it's incredible. And anyone could do this, like anyone that lives in an area where people have a metal building in their backyard that's not being utilized, you could go rent it from them like rent it. This isn't commercial. I don't need commercial. I want to paint lines on your floor and post Facebook ads. Well, dude, can I pivot just a little bit? But it's kind of stay on or you have more. Okay. So my wife's been playing a ton of tennis for the last year.\r\n\r\n\r\n\r\n\r\nWhich is pretty cool. I got more for you about this. Okay. She joined the USTA, which is the US tennis association. She's playing she's rated nationally, which is like a self-reported rating system. I'm assuming it's very similar to what pickleball is. But here in Boise, they have these teams and you, you pay to join the teams. There's somebody who organizes it. They play once a week. And then at the end of these seasons, they then have tournaments. And so they'll play locally. The winner of that goes to\r\n\r\n\r\ndivisions, sectionals, I don't know. And then the winners of that go to regionals and then the winners of that go to nationals because it's the USTA. It's all around the country. And so we went to Pocatello this weekend because they won in Boise. They went to Pocatello. My wife's out there with a freaking stress fracture. She won all three of her matches because she's a freaking beast, but they won. And so now they're going to go to regionals. And if they win that, they'll go to nationals. I'm sure that there's something like this within pickleball.\r\n\r\n\r\nWe talked about my brother-in-law who wants to launch this company. called Porter courts and their whole idea is portable pickleball court so you can go and play and you can arrange tournaments, yada, yada, yada. I think there's something there even with this idea that you have that you can copy from the USTA where it's like, okay, in Dallas, you could organize tournaments. You could have a tournament at your house or your, your house could be like in the NCAA tournament. It's just one of the regions that people play into.\r\n\r\n\r\nas they're going to the finals. Do you know what I mean? Like you could find probably 20 other pickleball owners and create your own sweet 16 tournament and have people play into it at each one of those locations. And then the winners go to a predetermined location, which everybody likes or something like that. But I just, like this idea of piggybacking off of what the USDA has already built and just copying it. It's be like, Oh yeah, we'll do that except for pickleball. Cause it's a proven model. And now that you have a pickleball court in your backyard, yes, you can have the club, but you can also kind of expand it by.\r\n\r\n\r\ncreating a league or creating these teams. Dude, endless options. And yeah, be freaking amazing. Then vending machines, you could do private lessons, you could, you could find pickleball tutors and like take a margin between them and them, you could match them up. But what I was thinking about you, Nick, you've got a freaking covered pickleball court in your backyard. What's preventing you from doing this? And a tennis court? Her name is beep. I've got my wife's name.\r\n\r\n\r\n\r\n\r\nShe doesn't have to know. She doesn't listen to this podcast anyway. Just random people showing up in the backyard. She's like, what is happening here? Why are they here? Don't worry about it. They've been money. Five dollars. you could do you could rent it out for private basketball lessons, get private basketball tutors and youths. That's a big business. That's right. Well, I have some sad news. I think the bubble's coming down. So you just burst my bubble, dude.\r\n\r\n\r\nYou're so stupid. Why? I'm really not going to drop that right there. OK, but in all seriousness, these people don't have to pay for it. But we've been having clinics at my house. So my wife and some other ladies in the community will come to our house. have a tennis court and they have an instructor who comes. They pay the instructor and he hosts there. He doesn't pay us anything. We don't charge him anything. We probably should charge him something for hosting. But it is kind of cool to have a spot where people can come and congregate. And that's how I like your pickleball court.\r\n\r\n\r\nI think would be something very similar to that. Well, dude, here's another idea for you. You know what Swimpley is? Have you heard of Swimpley? No. It's like the it's the dumbest name ever. It's Airbnb for pools where if you have a pool, you can list it on Swimpley and people can come book it for an hour or 10 hours. And there are people that make six figures net profit per year just renting out their pool or no way. Yeah, I swear people will rent a house like let's say you're in Gilbert, Arizona. You rent a house that has a pool.\r\n\r\n\r\n$3,000 a month and the house sits empty and you just rent out the pool on Swimpley. That's it. That's the whole business. Let me ask you a question. How much do think this pool rent out for on Swimpley? $1,000 a second. Was that too bullish? That was a little bullish. Oh my gosh. This is our backyard. Look at that pool, dude. Oh my gosh. I'm going to listen to Swimpley today. No, but anyway, I didn't even get to the idea.\r\n\r\n\r\nThe idea would be to build like a Swimpley for pickleball courts because people are building sport courts like crazy. Like would you rather build a pool for 150 grand or a sport court for 30 grand in Texas? People are building sport courts like crazy. That's Owen's idea. That's Porter courts. No, no, no, I don't I know, but this is like people that had a sport court with pickleball on it in their backyard could list their property on this website and rent it out to other people like other pickleball players. No, I know. So they have a brother-in-law, Owen.\r\n\r\n\r\n\r\n\r\nlove him to death. And he had this idea to start a portable pickleball app side of the idea. Yeah. And he like built out the whole app, right? Because in the whole app is like a community of people and they can put on courts online and they can get together and like, I'm looking at this. I was like, geez, this is overbuilt. But that's effectively his idea. He's already built like, he's literally already built the ecosystem for it, where you can go and say, Oh, this court's ready for us to go and rent, or just show up to and play at. Let's all go and you coordinate and communicate with your friends.\r\n\r\n\r\nNow I think you could do with an AI wrapper, but he's actually built out the whole, the whole entire app. But I agree. I think it's a great idea. have these AI tools now that uses Google earth to identify certain homes. Like if let's say you had a solar company, you could go identify the homes that have like max sun exposure on the roof. You could use a tool like that to find all the homes with sport courts and you could proactively list them on this marketplace. And then as they start to get inquiries, then you could use that as the reason to reach out to the homeowner and say, Hey,\r\n\r\n\r\nWe listed your sport court on this marketplace. We blurred out your address for your privacy. But if you ever want free money, go ahead and verify your listing. It's kind of like a Google business profile, how Google will automatically add all the businesses, and then the owner has to go and verify it. could be the same strategy. Any risk of Google kicking you off or listing places that aren't yours? No, you wouldn't have anything to do with Google. It would just be on your website. Yeah, dude, I love that idea. Can I share an idea? Do it.\r\n\r\n\r\nSo we moved a couple of weeks ago and this is my backyard. I posted this on Twitter actually. It's freaking amazing. I went from 0.3 acres to three acres and I'm going to stand by what I said. It is harder. It's harder doing that than going from two to three kids for me. All right. But this is the backyard. It's amazing. And you know me, I'm a city boy. Like I'm not mowing this whole thing. Not going to weed. You're not going mow any of it actually. Technically speaking.\r\n\r\n\r\nActually, that is correct. have this company named Augusta Lawn Care Services. I don't remember their exact name. If you ever want to come onto the podcast, let's have a conversation. They take care of my yard. But the point is, one of the reasons that we bought this house was because we wanted to have a house where we could host people. You have a house where you can host people and it's beautiful. You got a big backyard. You got a big house. You love cooking for people. And I've been jealous of that, right? We lived in a smaller house. was nice, but it's not like we could have a bunch of people over.\r\n\r\n\r\n\r\n\r\nAnd so we moved from from a third of an acre to now three acres. And in the first couple of weeks that we've been here, we've had my second son's soccer party and my oldest son's volleyball party at the house. And they swam in this pool back here. And it was amazing, dude. Like good conversations. The families were there. The kids were excited. My house was amazing on the inside. Like it didn't get dirty at all because nobody went inside. They were just outside playing the whole entire time, which is freaking awesome. But as I was talking to people out here and having a conversation around this beautiful pool, I talked to this guy.\r\n\r\n\r\nAnd I find out he's an entrepreneur. And I'm like, Oh, cool. Tell me about your business. It's like, Oh, well, I do bathtub refinishing. And I was like, What? He's like, Yeah, bathtub refinishing. And I was like, that's a, that's a thing. He's like, Yeah, yeah, that's a thing. I was like, Oh, what is that? He's like, Well, you know, if you have these, if you have an acrylic bathtub, or if you have a stainless steel bathtub, or whatever it is, they all have a surface and it might get chipped, and it or it might get rubbed the wrong way, whatever it is. And to replace those is like 15.\r\n\r\n\r\nthousand, 10, $15,000. But to just get it refinished is like six to $900. And lots of people don't necessarily realize you can just get it refinished, as opposed to having to buy a whole new bathtub or like have to actually redo your whole bathroom. You know what I mean? It's like, gets really expensive. And obviously, having that conversation with him was like, but tell me more. First of all, we just started talking about his specific business before I get into that. Did you know that's a thing? I'd heard of it. Yeah, I've seen like short form videos of like the before and after.\r\n\r\n\r\nReally? I don't know anything about it. Yeah. Okay. So this guy was talking about his business. He started this like five years ago and he's got like the quintessential dream entrepreneur lifestyle, right? He's got this business. He's got one or two employees that do the majority of the work. If I were to guess, he's probably making anywhere between two and $500,000 a year. So he's like content with where he is. He's making great money and, he's also not like, could scale.\r\n\r\n\r\nIf you want to scale exactly. He's not like, got to, got a triple quadruple the size of this business. And he picked a business that is like so niche and not sexy, not a ton of people are entering it. And on top of that, is AI going to disrupt this space? Is AI going to come and refinish your bathtub? Like, no, it's not going to come finish your bathtub. So average ticket price, $6,900 margin on that is like 30 % net margins. Obviously if you get an employee that it brings down your net margins.\r\n\r\n\r\n\r\n\r\nBut I want you to check this out. Okay. This is the treasure valley. So where I live and there are about 800,000 people that live in this area. I just searched bathtub refinishing Boise, Idaho. Look how many competitors there are. There's 800,000 people that live here. Probably somewhere in the of like 250,000 homes, 250,000 to like 400,000 homes. And there are like maybe six. Yeah. Like this jacuzzi bathtub remodel.\r\n\r\n\r\nthey're not doing refinishing. This new finish is definitely competitor refinishes a competitor. Boise bathtub refinishing. is, this is the guy who came to my name checks out. Yep. That's him. That's, that's the guy who came to my, my, son's volleyball team party, a miracle finishing. Let's see what this one is. Bathcrest. Nope. That's not a refinisher. That's just a remodeler and then refinish Napa. So we're talking about five or six actual competitors in a market that's freaking massive. And I started talking to him like, how do you acquire customers?\r\n\r\n\r\nIt's like, well, Google and he's like SEO. He's not doing any real paid ads. He's tried to use other agencies in the past, but he's like, it just doesn't work. I just, I'm not getting the type of business that I want to out of, out of actually paying the money to do that. The best form of leads right now is Google SEO. That's all. That's where I get like all of my leads from. And I think, I know this isn't sexy. I know this isn't AI. This to me is like, Hey, you want to start a pressure washing company? Hey, you want to start window washing?\r\n\r\n\r\nbathtub refinishing is like the perfect sweaty non-sexy business to start in any market. Think about how old the homes are in any market. An aging population, people don't want to pay a ton of money to have it like totally remodeled, $10,000 to $15,000, $6,000 to $900. There's a way more affordable price point. I just think that this would be an awesome opportunity for any enterprising person who wants to get into home services. Or you could build up like a Legion site, a programmatic site, and sell these leads to these guys. That's a great.\r\n\r\n\r\nDude, that's a freaking great idea. Oh my gosh, that's a great idea. Someone's going to be doing it now that we talked about it. How easy would it be? Yeah, all day. Actually, this would be a perfect directory. Yeah, it'd be great for that too. Right? Could easily spin up a directory. hard right now. Directories are so, MCP directory. Claude, you just start, we're just throwing words out now. You down with MCP? Yeah, you know me. That was a real world business model that I just think is. like it.\r\n\r\n\r\n\r\n\r\nCould be really cool. That's good.\r\n\r\n\r\nShould we wrap it?\r\n\r\n\r\nThat's a rat. Should we wrap it? It's protein bar. All right. Hopefully you liked that episode. And if you've made it this far, you're either really committed or you're stuck doing yard work and you can't actually skip on your phone. So while I have you, the show is growing, but I have a favorite ask of you. Will you please help me grow the show? I want to reach more people. There's a couple of things that you can do.\r\n\r\n\r\nLike and subscribe is the simplest thing. Obviously you want to get notifications for when the next episode is coming out. But if you go the next step, will you leave me review five star on Spotify or Apple? What that does is it tells the algorithm that, hey, this is a high value podcast because more people are leaving reviews for it. And it then pushes it out to more people. So that's why when people are like, will you log in, subscribe and put the five star rating, it's not just to make themselves feel better. It's actually to get more exposure for the show. So.\r\n\r\n\r\nIf you do that for me, I would greatly appreciate it and I'll see you next time.",
  "metadata": {
    "duration": "",
    "date": "2025-06-13",
    "platform_source": "Google Drive"
  }
}