{
  "episode_number": "82",
  "episode_title": "How to Buy & Run a $10M Textile Biz with a $3M Moat with Kevin Bibelhausen",
  "guest_name": "Kevin Bibelhausen",
  "business_name": "Heritage Fabrics",
  "transcript": "﻿Nik (00:00.834)\r\nAll right, Kevin, welcome to Nikonomics. Let's just hop into this thing. Tell us, what is your business and how do you make money?\r\n\r\n\r\nKevin Bibelhausen (00:09.118)\r\nI am the owner of a textile company based in North Carolina. I bought it via a self -funded search. know, textile is not exactly the kind of business that people are immediately thinking of when they're going in and using it as be allowed to buy a business, know, usually something home services or manufacturing or, kind of a weird hybrid business, you know, like we have a lot of characteristics of manufacturing.\r\n\r\n\r\nbut we're really more of a distributor wholesale company. We don't actually make anything, we're importers. So we do all the design work here in North Carolina. I got a team of designers here that make, that design textiles for drapery product, for upholstery. We've got product in costume shops all over the world, like Disney costumes. We've been in different movies. We've had product in like Star Wars and Yellowstone and all this kind\r\n\r\n\r\nNik (01:04.024)\r\nWow.\r\n\r\n\r\nKevin Bibelhausen (01:04.726)\r\nSo yeah, I mean, it's a very broad business. mean, the bulk of it is drapery and upholstery, but we do all the design work, like I said, here in North Carolina, and then contract manufacture overseas, and then import large quantity back to the States and sell sort of in the NAFTA region. So Canada, US, Mexico, we sell what's called open line. So we basically have a line of products, and those products can be sold to any distributor in the US.\r\n\r\n\r\nyou know, people who are going out and aggregating a lot of different textile brands and then offering, you know, literally everything in the world to their customers. You know, we're part of that. So they would come to us for, kind of rounding out their line.\r\n\r\n\r\nNik (01:48.248)\r\nDumb question. What does that mean, textile? Like what does that product look like? What does it feel like?\r\n\r\n\r\nKevin Bibelhausen (01:56.542)\r\nYeah, so there's a lot of different kinds of textiles, right? I've actually just got something in my inbox about more like, this isn't the right way to say it, but like tactical textiles, they're like technology textiles, right? It's for like a commercial use, like water filtration or something oil and gas related, or like even textiles are used in that too, right? My business is on the decorative side.\r\n\r\n\r\nNik (02:12.342)\r\nOkay.\r\n\r\n\r\nNik (02:21.703)\r\ninteresting. Yeah.\r\n\r\n\r\nKevin Bibelhausen (02:25.724)\r\nSo I get to do some of the fun artistic work and design work with my team here. And so I kind of feel like I'm the person kind of getting that creative energy out of them and creative vision out of them. Yeah, so we sell to, right now we sell to distributors, manufacturers, hospitality type companies. So somebody who's redoing a Marriott.\r\n\r\n\r\nNik (02:39.982)\r\nWho would be your end customer? Like who do you sell?\r\n\r\n\r\nKevin Bibelhausen (02:54.408)\r\nsomebody who's we're doing, know, any kind of hotel, we sell to them and we do a little bit of retail. The end consumer is you and me, you know, but goes through several layers to get to you. So we would sell to, you know, typical path would be selling it to a distributor. That distributor would then sell to an interior designer and then that interior designer would sell to you. So there's a lot of hands that passes through. Yeah, which I think is the opportunity, right? Is that the...\r\n\r\n\r\nNik (03:02.818)\r\nMmm.\r\n\r\n\r\nNik (03:07.405)\r\nOkay.\r\n\r\n\r\nNik (03:18.369)\r\nInteresting.\r\n\r\n\r\nKevin Bibelhausen (03:23.774)\r\nthe amount of middlemen in the system, there's a lot of hands in the pot. everybody's got their market that they're putting on the goods along the way. So something that starts out, $5 for me that I'm purchasing overseas ends up being $100 a yard for you at the end of the day. So it's pretty interesting the amount of opportunity that there is in this business.\r\n\r\n\r\nNik (03:44.75)\r\nThe people that you sell to, they typically sell it wholesale, like by the yard, or are they buying it by the yard from you and then turning it into a shirt or drapes or...\r\n\r\n\r\nKevin Bibelhausen (03:54.878)\r\nYeah, yeah. So good question. we would buy so like typical kind of orders kind of down the chain. So we would buy it kind of like a 500 to 1000 yard minimum for a pattern and then a color. So it'd be 500 yards of each skew or color in that pattern, which we would, you we stock, you know, all of that in our warehouse. So we have very, very high inventory cost. But that's kind of also our moat in the industry is that\r\n\r\n\r\nit's very expensive to get started in this business and nobody in their right mind is starting this business. It's, it's, it's incumbent players only because if I were to, like the way the sales cycle works, like you would need, so on a, on a, on a $9 million revenue business, $10 million revenue business, we've got about half of that in inventory. So our working capital is very high. And so effectively, if you were going to compete with me, you would need to take a few million bucks, go plunk it down for inventory. That's going to take\r\n\r\n\r\nat least 12 weeks to get here. And then you've got to get it placed in a book. And then that book's got to hit the street. You're talking two years before you see a return on that investment. no, nobody's coming into this business. It's a bad investment to do that.\r\n\r\n\r\nNik (05:02.744)\r\nHmm.\r\n\r\n\r\nNik (05:06.626)\r\nHmm. So what was your, what was your background before you got into this?\r\n\r\n\r\nKevin Bibelhausen (05:13.254)\r\nNot in textiles, my background was in healthcare and technology. Yeah, so I started my search looking for a business in the healthcare industry. It was pretty hot at the time, it's still hot, right? Like everybody's trying to do home health or senior care or something.\r\n\r\n\r\nNik (05:26.956)\r\nYeah, what was your background?\r\n\r\n\r\nKevin Bibelhausen (05:29.532)\r\nSo I worked in, I've worked all over the healthcare industry. I worked in a drug wholesaler. I've worked in a software company where I did sort of industry ERP, a healthcare specific nation ERP. And I've worked in a provider, which is a hospital. So my last job was basically being the deputy chief information officer for a large public health system. So I had kind of done the digital transformation piece. That was more my skill set and it had just been within the healthcare industry.\r\n\r\n\r\nNik (05:58.542)\r\nMy background was home health and hospice. Yeah, so that's where I started my corporate career and then I actually, I owned a company, just sold it last year, did a startup on the home health and hospice side. So yeah, I'm familiar with the space. When you were searching, how do you go from healthcare to textile? Because one of the things that I tell people that are searching is like at least for the first business,\r\n\r\n\r\nKevin Bibelhausen (06:01.434)\r\nright on, okay.\r\n\r\n\r\nKevin Bibelhausen (06:05.564)\r\nOkay.\r\n\r\n\r\nKevin Bibelhausen (06:14.641)\r\nYeah.\r\n\r\n\r\nNik (06:27.67)\r\nlook for something that you either have direct or analogous experience in direct experience being like we'll go to the healthcare example. For me, I worked in home health and hospice, so I'm going to buy a home health and hospice. Analogous experience would be I worked at a supply company that provided supplies to home health and hospice, but I want to buy a home health and hospice. So like I didn't have home health and hospice experience, but I at least had analogous experience. I was familiar with it. You went from healthcare to textiles that like breaks my framework. How did you get there?\r\n\r\n\r\nKevin Bibelhausen (06:55.486)\r\nYeah. it was very, it was aggressively practical. so what I, I started this last search in January 22 and acquired in January 23. So a year end to end, and that was very purposeful. So I kicked off the search. Like I said, I was targeting healthcare businesses and I was targeting pretty much MSPs. Like I had pretty much narrowed it down on the, on the IT side that I still really like. Yeah.\r\n\r\n\r\nNik (07:19.224)\r\nCan you, yeah, will you define that for people who are listening? What is an MSP?\r\n\r\n\r\nKevin Bibelhausen (07:23.88)\r\nservice provider, MSP is managed service provider. It's basically just outsourced IT or some IT functions. It could be like desktop stuff, right? Like the computers and the hardware, but it could also be, you know, phone systems, VoIP, can be cloud services. could be all kinds of different stuff, different flavors of IT. Great, great businesses, but I found them all overpriced because we were coming out of COVID for, you know, healthcare, healthcare with all\r\n\r\n\r\nYou know, everybody was trading on record years during, you know, 20 and 21. Didn't want to pay those multiples or multiples on that EBITDA. That wasn't sustainable. And MSPs I had found, I had found way overpriced for the, for the size that I wanted. If you get them in the smaller range, like under 500 SDE, they're, they're a little bit more reasonable, but when she started getting something at scale, mean, private equity loves MSPs for good reason. They're very, very sticky. So I just, couldn't afford it.\r\n\r\n\r\nAnd so I had to get a little bit more broad in my criteria. I wanted to be in Texas or specifically in the Dallas area, or I wanted to be in the Virginia Carolinas region. So I had, I had found this business through a network referral broker to broker. So I was friends with Clint Fiore working with him a little bit. And he actually introduced me to this broker in North Carolina who was representing this textile business. And I mean,\r\n\r\n\r\nIt's funny because, here's why I liked it. Really steady top line. It's, pretty much just does, you know, between nine and $10 million every year. Okay. Like clockwork gross margin rock solid right around 45%. Like it's very boring. You know, like you look at the numbers and I also had 10 years of reviewed financials. Like they had, they had managed this business very well. It was, it was professionally run and I liked.\r\n\r\n\r\nNik (09:12.865)\r\nWow.\r\n\r\n\r\nKevin Bibelhausen (09:19.026)\r\nthe fact that I knew what I was buying, it was very steady. It seemed like a very, it's not as nimble of a business as a lot of like the asset light kind of service businesses that we tend to see, but it's very sticky because once I get a product place in a distributor's book, that books on the streets for at least five years in order for them to get a return on their investment. So once I develop a product and I get it placed, I effectively earn on that for\r\n\r\n\r\nNik (09:31.49)\r\nMm -hmm.\r\n\r\n\r\nNik (09:43.662)\r\nCheers.\r\n\r\n\r\nKevin Bibelhausen (09:48.766)\r\nat least four to five years. And so it's nice and, people talk about reoccurring revenue, it's not recurring, but it's definitely reoccurring, right? I had the same top 10 customers for the last 20 years.\r\n\r\n\r\nNik (10:01.804)\r\nreoccurring.\r\n\r\n\r\nNik (10:06.616)\r\nHow old is the company? How established is it?\r\n\r\n\r\nKevin Bibelhausen (10:09.886)\r\n22 years now at this point.\r\n\r\n\r\nNik (10:11.894)\r\nAwesome. How did you stumble across textiles? well, let me ask another question first. Were you self -funded in your search or did you go raise?\r\n\r\n\r\nKevin Bibelhausen (10:23.166)\r\nI was self -funded. I actually worked, I left my hospital job and I worked, as a independent consultant doing IT projects and all of that. just kind of digging around, making sure I could pay my mortgage, you know? So, and it was during, you know, right after the, right after the pandemic. So there was still a lot of work home. So like, I was kind of threading this needle, no textile pun intended, but like I threaded the needle of like having the work from home opportunity.\r\n\r\n\r\nNik (10:42.808)\r\nMm -hmm.\r\n\r\n\r\nNik (10:51.213)\r\nRight?\r\n\r\n\r\nKevin Bibelhausen (10:51.346)\r\nand then consulting, so now I'm independent, and then I can take calls and work with brokers kind of on the side. It was a very good time for me to kind of go all in on this. Now with a lot more return to work, it's a lot harder for people now.\r\n\r\n\r\nNik (11:01.528)\r\nHow did you?\r\n\r\n\r\nSure. How did you identify textiles? Like that's, was it by accident?\r\n\r\n\r\nKevin Bibelhausen (11:08.902)\r\nI didn't, let it kind of identify me. I liked the characteristics of this business. Like I said, know, stable top line, stable gross margin. You know, I understood the business. I understood what they were doing. And it more, I'm more like...\r\n\r\n\r\nIt's almost like I had to put the clothes on or I had to like try the business on to see if I could just like, this the kind of business I want to run? Cause I remember talking to investors at that point. And you know, lot of these guys are buying healthcare businesses and home service businesses. they're like, textiles, really? You really want to do this? They're sort of like poo pooing here, right? And I'm like, yeah, I kind of think I do.\r\n\r\n\r\nNik (11:48.109)\r\nOf\r\n\r\n\r\nKevin Bibelhausen (11:50.078)\r\nAnd here's why, like I'm a, I have a very non -traditional background. Like I don't come from finance. don't come, you know, I don't have a bachelor's degree in business or anything. My bachelor's degree is in music. So I started as a musician and I was going to go like, that was my path, man. I was going to go do that. And then I realized that, you know, it was very difficult to make a living doing that. And I was married and like, well, I probably ought to go do something else and try and make a little bit more money. So that's how we got into corporate, you know, the corporate world, but\r\n\r\n\r\nNik (12:03.021)\r\nawesome.\r\n\r\n\r\nKevin Bibelhausen (12:18.076)\r\nI mean, I was working for myself as a musician. I enjoyed doing that. And as soon as I got into corporate, I'm like, yeah, maybe I'll do my own thing someday. So it was kind of one of those, like, I was always gonna go and do my whatever. I was something on my own, you know, because I knew I couldn't hack it in corporate forever. And I think, you know, the symptom of that was just being a job hopper. was never fully satisfied. So every two to three years, I just churned because it was unfulfilling.\r\n\r\n\r\nNik (12:30.542)\r\nSure.\r\n\r\n\r\nNik (12:43.392)\r\nI'm a musician as well, by the way. So, okay.\r\n\r\n\r\nKevin Bibelhausen (12:46.46)\r\nYeah. So you'll, you'll kind of appreciate the fact that like getting into a creative business is kind of like, it's, it's good for your soul. It's, it's an outlet. Like I'm not the day to day designer, but what I can do is I can walk in the studio and I can see what's going on and I can lay down the table and we can have conversations about, know, what this story is and what, you know, you get to have those artistic conversations. And I think as somebody who, who can.\r\n\r\n\r\nNik (12:54.888)\r\nMm -hmm.\r\n\r\n\r\nNik (13:01.816)\r\nMm.\r\n\r\n\r\nNik (13:11.406)\r\nThat's cool.\r\n\r\n\r\nKevin Bibelhausen (13:13.934)\r\nAnd you'll know this too, just how many musicians have you worked with that like can't do basic adult activities? And I mean, just like, they're just not left brain oriented. They're all completely either in the clouds or they're just pretty human beings. And I think it's a pretty rare skill set to be able to do both. Cause I mean, like, my designer now is a classic, very much head in the clouds, huge ideas.\r\n\r\n\r\nNik (13:27.48)\r\nYeah.\r\n\r\n\r\nKevin Bibelhausen (13:41.704)\r\nBut like very, my job is basically to keep the feet on the ground, right? Cause and I can, I'm able to do that because yeah, I can, I like to live in the clouds too, but I've also got, you at this point, like I've got a decade plus of business experience at an MBA. You're like, I've been through it.\r\n\r\n\r\nNik (13:54.414)\r\nI've always thought music helped prepare me for entrepreneurship because you're constantly, for me as singer songwriter and then you play in bands and it's like, I got to figure out how to get people on the same page, playing the same notes. So there's a team aspect to a band or to playing with other people. But then there's the creativity side of things where it's like, that was an interesting chord. Somebody messed up and they're like, that, well.\r\n\r\n\r\nKevin Bibelhausen (14:20.467)\r\nYeah.\r\n\r\n\r\nNik (14:22.082)\r\nLet's kind of like dive into that. Let's see if this works here. And so you have to figure out a way to be creative and problem solve. And I think that problem solving serves a lot of entrepreneurs because you have to think outside the box. can't solve a problem within the system that was created. Otherwise, the system that created it would have already been able to solve the hence the problem. back to the question, how did you find textiles? A broker just\r\n\r\n\r\nKevin Bibelhausen (14:43.303)\r\nYeah.\r\n\r\n\r\nNik (14:51.628)\r\nRan across it and gave it to you or you were looking and said, I like the multiples here.\r\n\r\n\r\nKevin Bibelhausen (14:57.086)\r\nYeah, yeah, I liked it. like I thought it was a well priced deal. And I mean, I got it for I got it for a decent multiple. It came with a lot of so I got three and a half million dollars in networking capital in the deal. So I mean, effectively, you know, I got over a million dollars in AR and I got $4 million in an inventory and then I had payables too. So but the net working capital, three million dollars, so\r\n\r\n\r\nNik (15:10.342)\r\nwow, okay.\r\n\r\n\r\nNik (15:23.608)\r\nWell, I mean, most searchers aren't buying as capital intensive businesses as the one that you have, right? So that's where I'm like, that's interesting that obviously textiles came across. Was it hard to convince investors to put money in? Yeah.\r\n\r\n\r\nKevin Bibelhausen (15:27.101)\r\nRight.\r\n\r\n\r\nKevin Bibelhausen (15:34.174)\r\nYeah, yeah, it was. I was raising very quickly. I my whole story just I mean, I've told it a million times, but just briefly for for your listeners, like I, I raised $800 ,000 from ideal. I went out, I had a capital provider at the beginning. And that capital provider bailed on me three days before I signed my LOI. We had a contract signed and everything. And they just tore it up. And they're like, Yeah, anyway, good luck. So then I had to figure out if I could raise capital on my own.\r\n\r\n\r\nNik (15:55.118)\r\nCheers.\r\n\r\n\r\nKevin Bibelhausen (16:03.166)\r\nAnd I decided I was going to do it. Didn't tell the broker that my capital provider had bailed. And so I just had to figure it out and, you know, got in contact with a few people who had made search investments. And then it was just sort of word of mouth and emailing and calling a bunch of people. probably reached out to 300 people. and they were all, I don't have friends and family money. Like I don't come from that world. And so anybody, I mean, everybody that, that's on my cap table is at some level, a professional investor.\r\n\r\n\r\nRight? They're higher net worth individuals. This isn't their first rodeo investing in things. And, you know, they weren't friends before, but they're friends now. And so I had to go from zero to convincing them to give me minimum $50 ,000 in five weeks, because I was raising between Thanksgiving and Christmas of 22. So, yeah, so all of this to say, like, I mean, it was difficult.\r\n\r\n\r\nNik (16:51.438)\r\nMan man\r\n\r\n\r\nKevin Bibelhausen (17:00.424)\r\njust because of the time pressure, but it was also difficult because it was kind of an out of the box industry and it didn't fit the typical mold and great question.\r\n\r\n\r\nNik (17:08.206)\r\nDid you walk into every raise meeting and you were like, guys, I'm ask you a question. What do I have in common with Berkshire Hathaway? Textiles, textiles.\r\n\r\n\r\nKevin Bibelhausen (17:20.258)\r\nI use that joke many times. Yeah. So you want to know that's the punchline to that joke. I actually have one of my investors who, who, who did this, who did this to me too. so I said, one of the things was, you know, it worked out pretty well for Warren Buffett, you know, and then, and then this investor would come back to me and he's, he was like, didn't Warren Buffett say that was his worst investment.\r\n\r\n\r\nNik (17:37.974)\r\nYeah.\r\n\r\n\r\nNik (17:47.502)\r\nYeah.\r\n\r\n\r\nKevin Bibelhausen (17:47.79)\r\nYeah, that's the joke like it's Warren Buffett bought a mill You know as as that's declining in the US right like yeah, it was a bad investment for him a great name He got to keep the name But as far as a big no textile mill, yeah, it's it's tough being a textile mill. Yeah\r\n\r\n\r\nNik (18:03.564)\r\nIt's so funny. All right, to walk me through the economics of the business. I think like wholesale businesses are really interesting just because you have so many middlemen. Where are you sourcing product from?\r\n\r\n\r\nKevin Bibelhausen (18:17.19)\r\nWe source primarily out of Turkey and India. Yeah, so there's some European mills left. There's some South American mills left. mean, you can find mills. There's some US mills left. It's just we have to hit a certain price point and in order to hit that price point, you're looking at Turkey, India, Pakistan, those kind of places. lots of China. We don't do anything out of China. We're a little bit more upmarket, but China is a huge player in this. Yeah.\r\n\r\n\r\nNik (18:45.422)\r\nOkay, so you're sourcing overseas. how are you then, walk me through the process, because I thought this was really interesting where you were describing the moat essentially that you have. Walk me through the process of selling to the end user. Like you talked about the book, you talked about having all the fabric, talk like, it sounds very old school.\r\n\r\n\r\nKevin Bibelhausen (19:11.942)\r\nYou think? Yeah. It's a pretty old business. Yeah. you're, you're, you're a hundred percent. Yeah. It's an old business, man. Like it's, the best joke I heard on it was that, you know, textiles is the, is the second oldest profession. The first being prostitution, you know, like it's a pretty old business and, and, and it functions that\r\n\r\n\r\nNik (19:12.706)\r\nAnd I don't know how you like you can't circumvent it, right? Like you're trying, you want to feel the fabric.\r\n\r\n\r\nNik (19:32.025)\r\nYeah.\r\n\r\n\r\nKevin Bibelhausen (19:37.456)\r\nYou know, and for me, that's the exciting piece about coming in with a digital transformation background is like, there's a lot of, there's a lot of meat on the bone, right? In order to get something to, to operate in a 21st century modern way versus, Hey, we're using technology from the sixties here, just because that's the way grandpa did it. Right. we have, we have investment in the business.\r\n\r\n\r\nNik (19:55.97)\r\nYeah, I mean, how do you automate getting fabric to a decision maker more quickly? I don't see how that happens.\r\n\r\n\r\nKevin Bibelhausen (20:06.024)\r\nHmm. It's not necessarily that piece. It's the piece about managing stock. It's the piece about, you know, having an ERP that can, that can help you with the inventory. And it's not just spreadsheets and, you know, random, true income and string systems put together, some good examples. the founder of this business, used an AOL email address. He, you know, every, I'm trying to see if I had got one here.\r\n\r\n\r\nBut every week we go through a report about that thick and it's 11 by 17 and it's every single skew that we have. And that's how we reorder. There's no order points. There's no, we go line by line and we look at what I'm serious. What's on the water, what the sales have been for the last three months, what's currently in a whip or on the water. And then we, know, what do I think we're going to do in the next?\r\n\r\n\r\nyou know, three months and that's how we place orders. So all of that can be more efficient, right? Like that's what technology brings to businesses like this. It's, it's, it's the more efficient management of inventory. So in order just to kind of describe like the whole, the whole chain, so we would import the large quantity. We would then sell it to, I'm just going to use the distributor path as an example, cause it's the easiest to kind of go through, sell it to a distributor by the, by the role.\r\n\r\n\r\nSo I buy 500 yards and then the rolls are between 30 and 50 yards. So they're going to buy a certain number of rolls or a certain number of yards, which is made up of a certain number of rolls, send them the rolls. They, they would make, I'll come back to this, but they make books out of some of the sample yardage that we give them. And then those books are take a while to make. It can take nine months to make a book because they send it all to China. Yeah.\r\n\r\n\r\nNik (21:57.08)\r\nThey sent it back?\r\n\r\n\r\nKevin Bibelhausen (22:00.168)\r\nSometimes.\r\n\r\n\r\nNik (22:00.408)\r\nSo it gets shipped here and then they're sending it back to China to make the book? my God.\r\n\r\n\r\nKevin Bibelhausen (22:04.892)\r\nYeah, sometimes. Sometimes. Yeah, they could do it in Mexico too. But when in China, it's, I mean, it's dirt cheap. It's dirt cheap to make books. It's still an expensive, you know, endeavor, but it's much cheaper in China. So the amount of just inefficiency is wild. So we would sell by the roll, the distributors then would sell by the yard. So they would make smaller cuts.\r\n\r\n\r\nNik (22:19.49)\r\nThat's insane.\r\n\r\n\r\nKevin Bibelhausen (22:31.974)\r\nout of that role to send to interior designers. the interior designer doesn't have any use for a whole big bolt of fabric, but they need three yards, they need five yards because they're going to cover somebody's couch or they're going to cover a chair or whatever. And then you also have a different online avenues that are doing smaller cuts and all of that. But like, that's kind of the path, right? It starts at huge quantities with us and it goes to smaller quantities and then smaller quantities still.\r\n\r\n\r\nNik (22:45.73)\r\nMm -hmm.\r\n\r\n\r\nNik (22:59.33)\r\nWhy? Why do you have to have so much working capital? I'm an idiot, right? So I'm looking at this and I'm like, okay, make the book. And then the distributors tell you how much they need. And then it's like, on demand, right? Like you, you order it as you get information from the field, you know, what the demand is for that, like, why do you have to hold a bunch of inventory? You said when you bought the business, you had three and a half million dollars of inventory, right? How much how much top line does the does the company do?\r\n\r\n\r\nKevin Bibelhausen (23:23.902)\r\nYeah.\r\n\r\n\r\nNik (23:28.418)\r\nOkay, so you had a third of the year's revenue sitting in inventory when you bought the business. That just seems exceptionally high. Like why?\r\n\r\n\r\nKevin Bibelhausen (23:36.882)\r\nIt is, it is very high. And it's because again, you know, I go back to the whole moat thing. The moat is we're in stock. We have things in stock and so we ship same day. So the lead time to get something woven is usually about eight weeks. And then you've got four weeks on the water. So if you're kind of doing that, if you're thinking like just in time inventory, right? Like there's a few ways to think about this.\r\n\r\n\r\nThe only way to do what you're saying is essentially to air yardage in, which obviously makes the cost astronomical. Now for some people, that's not a problem. For most people, that prices them out of the market. So there is a competitive advantage of having the inventory in stock, stateside, we can ship, can service you the same day versus, hey, let me pass the order to my mill and then they can...\r\n\r\n\r\nNik (24:17.644)\r\nSure.\r\n\r\n\r\nKevin Bibelhausen (24:34.234)\r\nknow, fulfill for us or, you know, whatever, whatever that arrangement would be. Some of the distributors do buy directly from the mills, but the reason that we're in business is because we do stock. Otherwise they're going to go to the mill, you know, so we effectively take some of that risk and our business stock the inventory. And that gives us, that gives us more power, the state side to be able to, have these, to have, to have these sales. Does that make sense?\r\n\r\n\r\nNik (25:00.59)\r\nIt does make sense. But how do you grow then? Like if that's your competitive advantage and you like, I want to go from 10 million in revenue to $20 million in revenue, like, okay, in order to go from 10 million to 20 million, I've got to buy an additional $3 million just to get there.\r\n\r\n\r\nKevin Bibelhausen (25:05.054)\r\nThanks, everyone.\r\n\r\n\r\nKevin Bibelhausen (25:19.182)\r\nYeah, so the trick is the trick is finding other ways to use the inventory that's on the shelf So one of the biggest one of the biggest challenges in the business is obsolescent inventory So I mean at the end of the day, it's a fashion business, right? It's home fashion. It moves slower than like fashion apparel, right? That moves season by season home moves in like three to five years cycles, you know, something's hot You know, we had the millennial gray\r\n\r\n\r\nRight, it was hot for a long time and every single house flip that you saw was all grayscale. Okay, well that's passe now, that's out. Right, so we've had a transition into, now it's warmer tones and it's this and it's that. Okay, so we've moved on from millennial gray, so a lot of our grays have been discontinued. They're now obsolescent because nobody wants them anymore.\r\n\r\n\r\nNik (26:04.502)\r\nYeah, but you have half a million dollars in millennial gray inventory.\r\n\r\n\r\nKevin Bibelhausen (26:07.422)\r\nbut I got a bunch of them, but what do I do with it? The typical path for this business has been, so let's say the average cost per yard is six bucks for me. I would mark a product down to maybe 50 cents a yard and then just blow it out, right? It's just a liquidation. people who buy seconds come buy this from me and you start to sell, you know, tens of thousands of yards at a time just to clear your warehouse, right?\r\n\r\n\r\nNik (26:37.176)\r\nYep.\r\n\r\n\r\nKevin Bibelhausen (26:37.308)\r\nWell, obviously you're taking a pretty big hit, you know, on that markdown. so the idea for me is to find a way to eliminate that obsolescent inventory or at least reduce it. So one of the things I'm working on is acquiring a manufacturer and that manufacturer would be able to make product out of the inventory. I already have on my shelf. The kind of manufacturer I'm talking about is called a work room. It's, it's literally just a building with sewing machines in it. Like all they're doing is they're making.\r\n\r\n\r\nThey're making curtain panels, they're making pillows, they're making bedding, they're making, you know, all of that kind of soft goods merchandise can be made out of the fabric that I have on the shelf. So the idea would be instead of marking things down to 50 cents, maybe you take a little bit of a mark down, but I put a little bit of manufacturing labor into it. And then I suddenly have a finished product that's worth more than the yardage that's on the shelf. So I can sell the pillow for $35, right?\r\n\r\n\r\nAnd I can recoup some of that cost. so I don't need to make any money on it. I just need to break even. If I break even on my fabric, I win. I don't have to mark it down to 50 cents. That's a win. So, so for me, like you asked how to grow to me, that's, that's the next best step is to figure out how to turn some of that inventory faster and start selling it on more consumer facing channels. Like I'm just going to use Amazon as an example, right? Cause you can go and you could put in a whole little program.\r\n\r\n\r\nLet's say I've got, you know, 5 ,000 yards of a certain product on the shelf and like, gotta get rid of this shit. Like it's, it's, it's dying on the vine, you know? Okay. Well, I'm going to send it to my manufacturer. I'm going to have them make, you know, a hundred sets of curtain panels. And we're going to put them on Amazon and we're going to blow them out. Right. And instead of 50 cents that I'm getting from a closeout person, maybe I can get 1999, right. Or whatever it is.\r\n\r\n\r\nNik (28:26.862)\r\nWhat are your current margins? What's your bottom line performance?\r\n\r\n\r\nKevin Bibelhausen (28:33.726)\r\nYeah, no, where are you? Like what's our EBITDA margin? Yeah, about 15 to 18%.\r\n\r\n\r\nNik (28:37.71)\r\nSure. okay, that's like way higher than I was thinking it would be.\r\n\r\n\r\nKevin Bibelhausen (28:43.998)\r\nYeah, our gross margin is usually about 50. we have, it's a range, right? It's blended, but like the majority of our sales are in that 50 % range.\r\n\r\n\r\nNik (28:48.75)\r\nSo.\r\n\r\n\r\nNik (28:55.565)\r\nIs that good for your industry? 15 to 18 % net margins.\r\n\r\n\r\nKevin Bibelhausen (29:00.594)\r\nYeah, I think that's about right. I've seen a few other companies that compete in the same space and I've seen financials even of international companies and that's pretty standard. Pretty standard.\r\n\r\n\r\nNik (29:02.03)\r\nor is that?\r\n\r\n\r\nNik (29:10.04)\r\nWow, okay, that is surprising. I for whatever reason, I just thought of it as a commodity business and expect in any couple on top of that wholesaler.\r\n\r\n\r\nKevin Bibelhausen (29:16.894)\r\nSo did every investor I talked to, right? Like they see textile and they think like cheap crap. They think commodity. And it's not that we don't have commodity goods. We do have commodity goods. But it's also, we have highly decorative things too. We have special things, we have unique things. So we sell both, right? We sell the, yeah.\r\n\r\n\r\nNik (29:33.71)\r\nSure. Yeah, no, I don't. I'm not saying I'm not saying I think, cheap crap. I'm wholesaler wholesalers typically don't have really high margins and you are playing the middleman between manufacturer and distributors in the United States. And then fabric just that just for whatever reason seems to me like a commodity, not, you know, not cheap crap. It's just, hey, everybody can get fabric. There's no real differentiator. But what you're saying is actually there are differentiators in the market.\r\n\r\n\r\nLike you can have high end fabric goods like you have, and then you could also have the cheap commoditized crap, essentially.\r\n\r\n\r\nKevin Bibelhausen (30:08.906)\r\n-huh. Yeah. Yeah, exactly. And there's a space for all of it, right? Just, I mean, you can control, you can have, you know, offerings for all different price points in the market. know, Heritage itself was built on the back of JCPenney. So Heritage was built on a more commodity based good. That's not all of what the company is today. Like the company purchased, we've acquired a number of different brands over the 20 some odd years that we've been in business. And, you know, some of the brands that we've acquired have been\r\n\r\n\r\nmuch higher end. We're working on developing those out a little bit further. So we have the commodity piece and we have a higher end piece. And so we can cover more of the market with differentiated offerings. yeah, there's lot of variety.\r\n\r\n\r\nNik (30:51.064)\r\nWhat would happen the working capital piece is just like kind of the, where my mind just stops, you know, like the record player is like, just can't get past it. yes, in a second. No, actually, no, break my brain now. I'm ready for it, Kevin, freaking hit me.\r\n\r\n\r\nKevin Bibelhausen (31:00.602)\r\nYou want me to want me to break your brain before you break up? Okay.\r\n\r\n\r\nKevin Bibelhausen (31:08.638)\r\nAll right, Nick, how about this? How about doing how about running a working capital intensive business where Outstanding AR is typically about 1 .2, which is 60 days payment terms is pretty normal for us with no line of credit\r\n\r\n\r\nNik (31:22.146)\r\nOkay, yeah.\r\n\r\n\r\nNik (31:31.532)\r\nNo? Line of credit?\r\n\r\n\r\nAre you just not paying? Are you just not? For? Are you just not paying what you order basically? Like, okay, so you have accounts receivable, but also any orders that you place? Are you like net 90 days? Like, how the freak does that work?\r\n\r\n\r\nKevin Bibelhausen (31:35.71)\r\nI did it for two years. I did it for two years.\r\n\r\n\r\nKevin Bibelhausen (31:48.062)\r\nWe have good supplier terms. There's 60, you're usually about 60 days. So pretty equivalent to the customer terms. But yeah, the truth is it's like, look, it's tight. It's tight because you want to make investments to grow. And like you said before, well, that requires more inventory. Yeah, it does. Right. Yeah.\r\n\r\n\r\nNik (32:06.542)\r\nWell, okay, that was my question. That was the question I was gonna ask you is like, what would happen if tomorrow somebody came to you and was like, hey, we want to make you the guy or target and we're rolling out. I don't even know. Whatever. We want to order $10 million worth of fabric this quarter.\r\n\r\n\r\nHow do you even do that? Could you do that?\r\n\r\n\r\nKevin Bibelhausen (32:29.918)\r\ntell me, yeah, well, tell me not to figure it out. Right. But like the truth is like, you know, we we've got, I don't know, a dozen different manufacturers that we work with overseas and actually growing our supplier base. They so here's a good example. One of our mills is the main supplier for Ikea. So like, they're no they're no stranger to volume. You know, they can do a lot of volume and being manufacturing, they prefer volume.\r\n\r\n\r\nthey need to keep those machines running constantly and run multiple shifts, right? Like that's just better for the business. So volume is the least of my concern. If we can, if we were able to get an order like that, like I think, you know, I think a lot of people would be very happy. Yeah, it's more that, you know, there's so much product in the marketplace, to your point, like fabric is,\r\n\r\n\r\nIt's the design that's the difference. It's design and construction and quality and all that kind of stuff. But at the end of the day, like it's still fabric, you know, and are you really gonna, are you really gonna notice a difference between a $30 fabric and a $15 fabric on a day -to -day basis? Maybe, probably not.\r\n\r\n\r\nNik (33:44.718)\r\nSo if you're, if your differentiator is time to ship and you're doing, let's just say 15 % margins, is your max organic growth probably that 15 %? Like if you decided I'm going to plow everything that the business might generate back into the business and just buy more fabric so that I can keep my competitive advantage and grow. Is that the way you're growing organically or what does your organic growth\r\n\r\n\r\nlook like.\r\n\r\n\r\nKevin Bibelhausen (34:16.026)\r\nit's multifaceted, right? that's certainly one, one play. I wouldn't say we're restricted to that. Like, like we've hit the ceiling on, on the margin. I do think it could come up a little bit and that's just a function of staffing. It's a function of technology that's, that's in the business. So as you know, if we're able to put in, you know, some more technology, technological capabilities and things like a quality ERP.\r\n\r\n\r\na better warehouse system, all these kind of things that we all talk about, CRM, right? Get rid of the tax machine, like all the dumb things that we all talk about. Like that does matter. You will create some operational efficiencies by doing that and cut costs. Staffing, I mean, there's no reason for a business that's global to only use local talent. So one of the things that I've been focusing on is, I've just hired a controller.\r\n\r\n\r\nI've hired a marketing person, the controller is stateside, the marketing person is global. He lives in Pakistan. So I believe in sort of this hybrid approach of like, okay, well, let's get some really quality players, U .S. and for things that like an accountant, it makes sense for me, like a controller, a CFO level candidate, like they ought to be stateside, right? But other things like marketing doesn't necessarily have to be stateside or somebody that's helping customer service certainly doesn't need to be stateside.\r\n\r\n\r\nNik (35:38.702)\r\nSo how do you currently acquire customers? What are your main channels?\r\n\r\n\r\nKevin Bibelhausen (35:43.73)\r\nSo we have an outside sales staff. That outside sales staff is usually prospecting in their territories. So they've got.\r\n\r\n\r\nNik (35:50.102)\r\nlike physically or are they cold calling or sending emails? Okay.\r\n\r\n\r\nKevin Bibelhausen (35:53.918)\r\na bit of both, both, yeah. They're independent contractors. So I mean, they're running their own businesses. So they have their book of accounts and they are incentivized to add to that book of accounts. That's one. The other one was we just launched our website. So our entire, when I bought the business, there was no products that you could see online. It was basically just a webpage with a picture of the building that we occupy, which is very funny. Like, you know, here's the crown jewel of Heritage Fabrics.\r\n\r\n\r\nNik (35:57.826)\r\nMm.\r\n\r\n\r\nKevin Bibelhausen (36:23.474)\r\nwarehouse. And so now you can go online, you can see all the product, you can shop, can play samples, you can, you know, you can do all the things that you would normally do on a website. You have to have a trade account, you have to have an EIN, you have to be a registered business. But once you're approved, you can go and you can go and do all that stuff. We're getting quite a few leads actually on the website. People tend to, you know, they can, if they Google a pattern name, you know, we're the manufacturer, so we'll show up.\r\n\r\n\r\nNik (36:52.643)\r\nMm\r\n\r\n\r\nKevin Bibelhausen (36:53.628)\r\nRight. And that's what a lot of people do when they go into retail stores, they'll find the pattern name and then they'll go find it online or they'll try, you know, we, we won't sell directly to a consumer, but you know, they'll definitely try and get it cheaper than what they can find in the store. but yeah, we've, we've, we've registered a number of different new accounts just by having a new website up without, with, I mean, zero marketing on the website. Like we're not doing any ads. We're not doing, we're just not very yet. And I'm not even sure we need ads. Like it's just not that business, you know,\r\n\r\n\r\nNik (36:57.07)\r\nInteresting.\r\n\r\n\r\nNik (37:21.955)\r\nMm\r\n\r\n\r\nKevin Bibelhausen (37:22.974)\r\nBut yeah, people are finding us organically. And then we go to trade shows, we go to, you know, we do all that kind of stuff. So, yeah.\r\n\r\n\r\nNik (37:31.022)\r\nHere's my last question on the business. What's your plan? Like what do you want to, is this a buy and hold? You're the textile guy for the next 30 years or are you a, Warren Buffett. I'm turning this into a holding company. what's your thesis?\r\n\r\n\r\nKevin Bibelhausen (37:48.85)\r\nYeah. yeah, a little bit of column, a little bit of column B. I actually really liked this industry. And one of the things that's been unique for me and coming into this space is expressly different than a, than a service business is that it's not geographically focused. So if you were to buy a pool cleaning company in Tampa, Florida, your network is pretty much going to be in Tampa, Florida. Well, in my business, I sell internationally. I, my suppliers are international.\r\n\r\n\r\nSo I have a trip to India coming up in December. I usually go to Germany in January. We have a trade show in Lake Como, Italy in May. I've got suppliers in Turkey that I need to visit. it's, the Como show is at the same, like it's, they're bought up against each other. So actually the Milan furniture show wouldn't be the fashion show. I don't know what the fashion show is, but they're probably all around the same time to be honest with you.\r\n\r\n\r\nNik (38:31.736)\r\nAre you going to Milan for Fashion Week?\r\n\r\n\r\nNik (38:38.497)\r\nOkay.\r\n\r\n\r\nNik (38:43.81)\r\nNo idea.\r\n\r\n\r\nKevin Bibelhausen (38:47.932)\r\nBut yeah, mean, it's a different life than if you would have acquired sort of this like geographically focused business. My plan is to actually build, the thing that I kind of keep putting out there to my team is sort of an LVMH type model or Hermes type model where you're a luxury goods holding company and you have like one flagship brand. So I'm working on doing something like that. I like the idea of rolling.\r\n\r\n\r\nor acquiring several different, like, consumer luxury goods type brands. So bags, shoes, you know, all that kind of stuff that, that would be sort of, DTC focused or, or maybe an older brand, like a, like a shoe company or something that just has sold for a hundred years. And now they need to transfer it from the, you know, from the fifth generation or whatever. Like that's the kind of stuff I want. You know, I want those super niche.\r\n\r\n\r\nNik (39:41.123)\r\nYeah.\r\n\r\n\r\nsense.\r\n\r\n\r\nKevin Bibelhausen (39:46.14)\r\nyou know, very high quality, you know, just like things that people love, brands that people are just like drawn to and obsessed with, you know, like once they're a customer, they're kind of a customer for life because they, they like the, they like styling, they like the quality, they like the, you know, the whole thing about.\r\n\r\n\r\nNik (40:01.294)\r\nthis.\r\n\r\n\r\nNik (40:05.474)\r\nYeah, something special about the physical goods, which is which is really interesting. And like, I mean, everything from the book, like just the fact that you have to spend a year almost creating this book so people can actually touch and feel and get a sense and then and then obviously place their order. Yeah, it's just freaking so fascinating. I have some rapid fire questions for you to end up. All right. What do you love about this business?\r\n\r\n\r\nKevin Bibelhausen (40:20.147)\r\nYep.\r\n\r\n\r\nKevin Bibelhausen (40:28.828)\r\nAll right, let's do it.\r\n\r\n\r\nKevin Bibelhausen (40:33.148)\r\ndesign, fashion.\r\n\r\n\r\nNik (40:35.126)\r\nOkay. What do you hate about it?\r\n\r\n\r\nKevin Bibelhausen (40:38.16)\r\nsample allowance, we have to give out free yardage. It's those books you're talking about. Usually we're giving away yardage for a significant discount or free to get in those books.\r\n\r\n\r\nNik (40:48.716)\r\nOkay, how much does a book cost?\r\n\r\n\r\nKevin Bibelhausen (40:52.702)\r\nOoh, depends on where you make it. I've actually never made one of the books, but I think I last I heard I think it was about 30 bucks a book. And they usually make thousands of those books.\r\n\r\n\r\nNik (41:00.184)\r\nOkay.\r\n\r\n\r\nWell, how much yardage are you giving away? Like what's the yardage allowance in dollars?\r\n\r\n\r\nKevin Bibelhausen (41:05.95)\r\nUsually, usually about 100 yards per skew it can be.\r\n\r\n\r\nNik (41:16.386)\r\nWhat does that mean in dollars? I have no idea.\r\n\r\n\r\nKevin Bibelhausen (41:21.438)\r\nSo on one of our recent placements with a deep color line, we were basically giving customers somewhere between 20 and $30 ,000 in free goods.\r\n\r\n\r\nNik (41:31.488)\r\njeez. Okay.\r\n\r\n\r\nKevin Bibelhausen (41:35.718)\r\nAnd there was five customers who are on that pattern. Meaning we did it five times.\r\n\r\n\r\nNik (41:40.878)\r\nYeah, yeah, $150 ,000. Okay. What\r\n\r\n\r\nKevin Bibelhausen (41:47.218)\r\nSo that month wasn't a very good month on the P &L, what it does is like, it's funny because my CFO would come and be like, what the hell happened this month? I'm like, yeah, well, when we get those sales back in a couple years, it's gonna be okay. Like it's gonna balance, we're gonna make money on it. It's just, an investment right now. Like that's the way you have to look at it. Yeah, my least favorite part.\r\n\r\n\r\nNik (42:00.12)\r\nYeah. Yeah.\r\n\r\n\r\nNik (42:06.454)\r\nIt's insanity. What business are you most jealous of right now?\r\n\r\n\r\nKevin Bibelhausen (42:14.246)\r\nMmm\r\n\r\n\r\nKevin Bibelhausen (42:20.198)\r\nI'm not doing very good at the rapid fire piece.\r\n\r\n\r\nNik (42:22.24)\r\nNo, it's okay. For me, it's it's commercial real estate because I'm like, dude, mailbox money, triple net lease. I don't have to worry about anything.\r\n\r\n\r\nKevin Bibelhausen (42:26.237)\r\nReally?\r\n\r\n\r\nIndustrial. Industrial. Like I want to own this building. know, like these warehouse buildings. That's part of my five -year plan is to build my own and do that. I think I really like, I was talking to a guy who was doing septic. I really like the septic industry. Am I jealous of it? No, but I just like that business, especially in high growth kind of south, southern region.\r\n\r\n\r\nNik (42:38.893)\r\nOkay.\r\n\r\n\r\nNik (42:55.884)\r\nYeah, mean, jealous, jealous is a term that can elicit a lot of different emotions. I just mean as you sit there and you're like, man, it'd be nice if I had a business that was like, you and that.\r\n\r\n\r\nKevin Bibelhausen (43:04.382)\r\nYeah, here's what it is. And it goes with all these home service businesses. It'd be really nice if I could juice my business with Google Ads. If I could pay Google or I could pay Meta or I could pay whatever, like all the home service guys do, that would be awesome. You know, if I just give you a credit card and then I give you a dollar and you give me $5 in sales or whatever the ratio is, right? I can't, it doesn't work that way for me.\r\n\r\n\r\nNik (43:13.335)\r\nMmm.\r\n\r\n\r\nNik (43:19.798)\r\nInteresting.\r\n\r\n\r\nNik (43:26.669)\r\nYeah, yeah, yeah, yeah.\r\n\r\n\r\nNik (43:30.828)\r\nYeah, interesting. Okay.\r\n\r\n\r\nKevin Bibelhausen (43:31.538)\r\nNo, I'm jealous of that, of the ability to like kind of do that lead jet, you know, create those funnels.\r\n\r\n\r\nNik (43:36.82)\r\nIf. If you have two hours in your day and you don't have any family time, no work responsibilities, you don't have to do anything. What are you obsessed with right now? What are you spending your time on?\r\n\r\n\r\nKevin Bibelhausen (43:50.568)\r\nHmm. I am trying to, it's, you know, honestly, it's, thinking about what the end state for, for this company and my, for lack of a better word, holding company looks like. I, I think a lot about what my, my background and inspiring and helping other people with creative backgrounds, kind of get into owning.\r\n\r\n\r\ntheir creativity and owning the fact that what makes them different and unique is actually a valuable skill set in today's world, especially with things like AI. And you look at how quickly AI can do some of the calculations that we've, this is something that a financial analyst does or it's all chatty, but he can spit it right out. What AI can't do is,\r\n\r\n\r\nbe a creative human being, problem solve, be more like do the things that are essentially human. And I think that's what I like about my industry and building the kind of company that I wanna build is that it's centered around what makes us uniquely different as a species versus the rest of the animal kingdom. It's like, it's design, it's creativity, it's problem solving, it's those kinds of things.\r\n\r\n\r\nNik (45:06.541)\r\nMm\r\n\r\n\r\nThat's awesome. All right, second to last question. Knowing what you know now, would you go back and buy this business again or would you want to buy into another industry?\r\n\r\n\r\nKevin Bibelhausen (45:19.356)\r\nNo, I'd it again. I'd do it again in a heartbeat. The only thing I would do is make sure I got a lot of credit closed when I got my documents. But yeah, no, I love what I do.\r\n\r\n\r\nNik (45:25.169)\r\nAll right, last question. What advice would you give your pre entrepreneurial self?\r\n\r\n\r\nKevin Bibelhausen (45:37.501)\r\ntake the leap faster. I tried to do it in 2018 when I first learned about ETA. I read the Harvard Business Review Guide, fell in love with the book and the story of a guy buying a port of potty business and was like, that's what I want to do. Like that is what I want to do. And I had a deal under LOI in 18, fell apart, but I got at least got to go through the process, kind of licked my wounds, went back to corporate, thought I could climb the ladder there, thought I might be able to be fulfilled, but it took kind of, know,\r\n\r\n\r\nIt took COVID and it took getting sick and it took, you know, having a whole health crisis for me to kind of realize that I wasn't in the place where I should be. And what I really wanted to do was work for myself and be an entrepreneur. So I think, I think being honest with myself earlier and not being afraid to, to ask questions, to get out there, to go find like -minded people.\r\n\r\n\r\nNik (46:24.536)\r\nGreat answer. Where's the best place for people to come find you?\r\n\r\n\r\nKevin Bibelhausen (46:28.434)\r\nI'm pretty active on Twitter and LinkedIn. Like, look, there's not many people with my last name. It's either me or they're related to me. I, I'm also a Bebelhausen. Bebelhausen. Yeah. And so my, own my last name domain. So that's the easiest place to find me is bebelhausen .com. You links to my socials links to newsletter stuff, all that kind of stuff. And then we're raising for, for fruition capital. I'm a partner in a, in a small fund that we invest in these self -funded deals. So, you know, we've got to, I've got to,\r\n\r\n\r\nNik (46:33.614)\r\nHow do you say it?\r\n\r\n\r\nBeabelhausen art.\r\n\r\n\r\nKevin Bibelhausen (46:56.848)\r\na thing you can click on the website and learn more about that if you're interested in either buying a business or you're interested in passively investing in small businesses.\r\n\r\n\r\nNik (47:03.086)\r\nWhat's the focus of the next fund?\r\n\r\n\r\nKevin Bibelhausen (47:06.556)\r\nSo we're looking, we're pretty up market. in terms of self -funded deals, you know, we're looking at north of, it's really gotta be north of a million for sure. I'd say more than likely north of one and a half million dollars in EBITDA. Yeah, yeah. And then.\r\n\r\n\r\nNik (47:18.126)\r\nOkay. I was gonna say it's enterprise value. I'm like, that's up market.\r\n\r\n\r\nKevin Bibelhausen (47:24.112)\r\nNo, no, no, no, no, even. And but we're doing a lot more independent sponsor deals. So that's been that's been a nice growth area for the fund because we have more cash to deploy. So we're looking we're looking at those deals, the two and three million dollar even the deals, but still very much attracted to self -funded search. And we'd like to serve as an anchor investor for those deals.\r\n\r\n\r\nNik (47:44.704)\r\nAwesome dude, this is a great conversation. I blew my mind probably every two minutes. And I can't wait to check in with you after you've rolled up this industry and found your Charlie Munger and have you know officially become. Sweet man, I will talk later.\r\n\r\n\r\nKevin Bibelhausen (47:49.052)\r\nYeah, good to connect.\r\n\r\n\r\nKevin Bibelhausen (47:56.862)\r\nYeah, there's a Charlie out there. Come hit me up. Let me know. All right, see you. Thanks.\r\n\r\n\r\nNik (48:05.52)",
  "metadata": {
    "duration": "",
    "date": "2024-11-11",
    "platform_source": "Google Drive"
  }
}