{
  "episode_number": "178",
  "episode_title": "How Facebook Ads Nearly Killed This $12.5M Brand with Hans Dose",
  "guest_name": "Hans Dose",
  "business_name": "Tentacle",
  "transcript": "﻿Nikolas Hulewsky (00:01.994)\r\nAll right, let me make sure we got our mics set up correctly. Yes. Yes. Yes. Cool. Hans, dude, I think the coolest thing is I'm really excited to introduce everybody to you because you're a real deal entrepreneur. You built a product, a product business. You went on the shark tank, pitched a product, and then you built that business into a 12 and a half million dollar business in top line revenue. And then you saw what was coming down the pipe. You saw\r\n\r\n\r\nthe changes that were happening with relation to our trade standing with China. And you were like, e-commerce, consumer facing products have no idea what's about to hit them. Why aren't we on-shoring? Why aren't we reshoring? Nobody's manufacturing silicone, which is an integral product in every single one of our retail products. And you started looking around, there was nobody who was doing it. And so you decided, I'm going to start a manufacturing company in California of all places to re-onshore silicone.\r\n\r\n\r\nwhich like just all of those moves in a row are incredible adventures. But I think what I have to ask you first is, do you ever get tired?\r\n\r\n\r\nHans Dose (01:12.629)\r\nyeah, and I have two babies so I get extra tired. Yes, it's a lot.\r\n\r\n\r\nNikolas Hulewsky (01:19.732)\r\nAll right, in the introduction of you, was there anything I missed in there in high level?\r\n\r\n\r\nHans Dose (01:24.692)\r\nI mean you could say that this is my last move like you could lose it all, you know I Don't know it. I think it grabs the attention a little bit more To be like this is this is make or break Yeah, I don't know up to you though\r\n\r\n\r\nNikolas Hulewsky (01:42.584)\r\nWell, I had Craig Fuller on here and it's such a massive shift in our international relationships, commerce relationships, especially with China, where we've built everything for cheap for so long. And then now we're like reshoring, onshoring. And obviously you saw a hole in the marketplace where you're like, okay, they manufacture silicone here, but not for retail products. Like nobody is, why is nobody doing this? I know you like looked around and pinched yourself a couple of times because you were like, am I the idiot here? like nobody else is doing this in the United States.\r\n\r\n\r\nHans Dose (01:46.313)\r\nYeah.\r\n\r\n\r\nHans Dose (02:12.358)\r\nYeah, there was one company that would do it that I finally found, but the pricing was high and they're getting inundated with everyone trying to onshore. And when I actually looked at the process of what it is, it's super simple. It's basically like a waffle maker that squishes the material and keeps it hot for like a minute. And then the product's done and vulcanizes.\r\n\r\n\r\nNikolas Hulewsky (02:32.962)\r\nYeah.\r\n\r\n\r\nHans Dose (02:39.712)\r\nAnd I just found that all the manufacturers in the U S that are producing silicone parts are large scale industrial contract manufacturers that are making like gaskets and seals and things for medical pharmaceutical aerospace defense, like all these big multimillion unit per year, very predictable things and, manufacturers. And the issue here in the U S is.\r\n\r\n\r\nNo one will take these small small run ever changing consumer products are changed by quarter by quarter So it's very fast pace and you need to be versatile and just no one in the US is taking it on seems like\r\n\r\n\r\nNikolas Hulewsky (03:25.23)\r\nYeah, I had Dan, I can't remember Dan's last name, Thompson. So I had Dan Thompson on. He owns a silicone manufacturing facility, but they're all, like he does 75 million units a year, I think. So that's what you're saying. Like they're doing commercial. But let's back up and educate people who are listening right now. I started before we hopped on here, I was like, okay, silicon manufacturing. Yep, silicon, silicon. And you're like, it's silicone, dummy.\r\n\r\n\r\nHans Dose (03:30.76)\r\nYeah.\r\n\r\n\r\nHans Dose (03:36.626)\r\nYeah. Massive commercial industrial. Yep.\r\n\r\n\r\nHans Dose (03:51.76)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (03:52.84)\r\nSilicon and silicone are different. So will you explain really quickly what the freak is silicone? Why is it so important for e-commerce and consumer facing products?\r\n\r\n\r\nHans Dose (03:58.323)\r\nYep.\r\n\r\n\r\nHans Dose (04:02.482)\r\nYeah, so silicone is actually comes from silica, which is ground up quartzite mixed with, it goes through this process with like charcoal burning and it's the whole thing. And then it makes silicone or silica and then you can either make silicone or silicone with that. So silicone are items that you see that are like squishy, rubbery feeling. like things like pacifiers.\r\n\r\n\r\nto menstrual cups, to windshield wipers. There's a lot of items that are silicone and then silicone are things in computer chips and solar panels, stuff like that. So silicone is that squishy rubbery type thing. The benefits of silicone is it doesn't break down. So it doesn't produce like microplastics and it's totally inert and it's not poisonous like.\r\n\r\n\r\noil-based plastic products and rubbers are. So there's a lot of benefits to silicone and super high heat resistance, all kinds of crazy properties that silicone.\r\n\r\n\r\nNikolas Hulewsky (05:09.058)\r\nYeah, here's some of the stuff that I was looking up. So it's durable and lasts a long time. Like you were saying, it doesn't break down. It's flexible and versatile. So like you're saying, you can heat it up and put it into the waffle maker and you said vulcanize it.\r\n\r\n\r\nHans Dose (05:21.234)\r\nYep. Yeah. So vulcanizing is a process that makes all the atoms link together the right way so that stays in that form.\r\n\r\n\r\nNikolas Hulewsky (05:27.778)\r\nThat's yeah. My brain is just like you make hot then make new form. Okay. Anyways. So it's flexible. It's versatile. like you said, it's, non-toxic, which is a big deal right now. Temperature resistant, waterproof, weatherproof, sustainable, which I thought was interesting. It's a more environmentally friendly than other plastics and it's easy to manufacture. So,\r\n\r\n\r\nHans Dose (05:32.788)\r\nYou make hot, stay safe.\r\n\r\n\r\nHans Dose (05:41.726)\r\nYep.\r\n\r\n\r\nNikolas Hulewsky (05:55.576)\r\nAnd the things that you were saying, I'm going to read this list that I saw pumped out. was like things you don't even think of kitchenware, personal care, baby products, toys, phone cases, chargers and cables, wearable devices, key pads, medical tubing, implants, surgical tools, seals and gaskets, dashboard materials, wiper blade, sealants, insulation, stretch fabrics, waterproofing, mold making, lubricants and greases, food storage, baby food, gloves, wound care, seals and insulators, arts and craft and furniture. there's a lot more than that too, right? Like, but basically\r\n\r\n\r\nHans Dose (06:20.387)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (06:24.526)\r\nIf you're selling any consumer product. In your category, there is some form of a silicone product of that or a product that uses silicone. So if you're an e-commerce manufacturer and you're deciding, hey, I'm going to make this in China because it's cheaper and I'm going to import to the United States. Those are low margin businesses, right? Like you were telling me on twelve and a half million dollars in top line revenue for your product, you were making like a million dollars or less.\r\n\r\n\r\nHans Dose (06:45.268)\r\nyou\r\n\r\n\r\nHans Dose (06:50.876)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (06:54.292)\r\nin net income. it's it's, yeah, it's low margin. It's a volume game, right? And if all of a sudden you're the price that you're paying for that goes from zero to 145%, like because the tariffs are in effect, you've got to figure out how you're going to manufacture that at a level that makes it actually affordable because your margins just gone at that point. So I think that's the problem set that people are facing. You're very interesting because\r\n\r\n\r\nYou had a silicone product that you created. What's it called?\r\n\r\n\r\nHans Dose (07:26.26)\r\nTentacle, bendable legs and suction cups like an octopus. So it mounts phones, cameras, tablets, anything anywhere. I'm really good at that pitch now because I've it so many times. I've done it so many times.\r\n\r\n\r\nNikolas Hulewsky (07:34.434)\r\nReally? So have you ever thought about branding it as like, sorry, say the name of it again one more time. It is tentacle, okay. Tentacle, we really suck.\r\n\r\n\r\nHans Dose (07:42.868)\r\nTentacle. Yeah. Yeah. Yeah. Yeah. We've had some ads run like that. They play well. Yeah. We run the puns.\r\n\r\n\r\nNikolas Hulewsky (07:49.174)\r\nWe're the suckiest brand you'll ever meet, and you'll love it.\r\n\r\n\r\nNikolas Hulewsky (07:57.068)\r\nYeah. So anyways, you created it and then you went on Shark Tank and pitched it.\r\n\r\n\r\nHans Dose (08:03.74)\r\nYep, gotta deal with Damon John.\r\n\r\n\r\nNikolas Hulewsky (08:06.648)\r\nDamon? Damon's my favorite.\r\n\r\n\r\nHans Dose (08:08.178)\r\nYeah, he's my favorite too. I went in wanting a deal with Damon and I walked out with a deal with Damon. It was awesome.\r\n\r\n\r\nNikolas Hulewsky (08:14.626)\r\nmy gosh, I'm so pissed right now. Is this going to be a three hour episode? shoot, I have to pull out the thread. The product, did you have the product spec'd out when you went onto Shark Tank or was it the idea?\r\n\r\n\r\nHans Dose (08:19.283)\r\nYeah\r\n\r\n\r\nOkay.\r\n\r\n\r\nyeah, we were already selling. had already done like 1.4 million in sales at that point or something. Yeah. So we were critical. This is 2021.\r\n\r\n\r\nNikolas Hulewsky (08:33.921)\r\nOkay, so what year is this?\r\n\r\n\r\nOkay, 2021, you've got the product, you've done a million and a half dollars in sales, you go on to Shark Tank. Why did you go to Shark Tank?\r\n\r\n\r\nHans Dose (08:42.706)\r\nYep. few reasons. One, I ran out of money. needed money. So that was one reason. Low margin business ads are expensive. yeah. So I didn't want to like get more debt, that sort of thing. So I went on Shark Tank. and number two, Shark Tank is an ad. You get people's attention for 12 minutes long and you get to talk about your story and your products, and do all that.\r\n\r\n\r\nNikolas Hulewsky (08:49.368)\r\nHa!\r\n\r\n\r\nNikolas Hulewsky (09:06.946)\r\nYeah.\r\n\r\n\r\nHans Dose (09:10.832)\r\nSo, you know, I really tried to treat it like just have a good time and make good TV and whatever happens happens. But yeah.\r\n\r\n\r\nNikolas Hulewsky (09:19.502)\r\nDid they take a percentage of you? I have never talked to somebody who did, but I like read somewhere that like Shark Tank takes a percentage of your business, whether or not you get a deal.\r\n\r\n\r\nHans Dose (09:26.1)\r\nNo, they used to. So yeah, the first like two seasons they were doing that. And then Mark Cuban came in and apparently and was like, no, this has to stop. You don't get it. Yeah. So even was the one from what I heard that stopped ABC from taking a percentage of these brands, but the sharks do. I mean, they're actual investors. It's a real process. You go through due diligence, anything like any other deal. And it is real. So\r\n\r\n\r\nNikolas Hulewsky (09:37.274)\r\ndang.\r\n\r\n\r\nNikolas Hulewsky (09:45.162)\r\nWow. Of course.\r\n\r\n\r\nNikolas Hulewsky (09:54.424)\r\nOkay, so you pitched to Damon. What did you pitch to Damon? How much for what percentage?\r\n\r\n\r\nHans Dose (09:57.262)\r\nyeah, I pitched a 200 K for 10%. So throwing it at like a $2 million valuation. you know, I think the sharks don't like when people come in with some wild valuations, just kind of ridiculous. So trying to be realistic, on the show ended up getting not that deal. I totally opened the kimono. It was just like, here's all the problems with my business. And I think it made for your TV and it played well, but it certainly hurt my, valuation there.\r\n\r\n\r\nNikolas Hulewsky (10:04.461)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (10:22.764)\r\nYeah.\r\n\r\n\r\nHans Dose (10:27.156)\r\nBut then, you know, things kind of progressed in the due diligence process and they realized, this is good business. And it kind of changed a little bit for my benefit, but I don't know if I'm allowed to.\r\n\r\n\r\nNikolas Hulewsky (10:38.062)\r\nCan you tell me, okay, so you went in 200,000 at two million. Can you tell me what you ended?\r\n\r\n\r\nHans Dose (10:42.652)\r\nYeah, 100K and I own almost 90 % at this point. So a little bit better for you. Yeah.\r\n\r\n\r\nNikolas Hulewsky (10:50.478)\r\nOkay, alright. Yeah, much better. Are you still, you and Damon have a good relationship?\r\n\r\n\r\nHans Dose (10:56.606)\r\nyeah, yeah. Last year I sponsored a NASCAR driver and had him come out and we hung out the whole day in, I think it was November last year and he was the announcer for the get ready to start your engines. It was so fun. It was, it was a blast, but yeah, we've, we've had some, some time together certainly. And we talked here there.\r\n\r\n\r\nNikolas Hulewsky (11:12.62)\r\nred.\r\n\r\n\r\nNikolas Hulewsky (11:20.334)\r\nHow long was it between filming and when it aired?\r\n\r\n\r\nHans Dose (11:23.348)\r\nThat was like six months it was a brutal six months because I was kind of stuck. Yeah\r\n\r\n\r\nNikolas Hulewsky (11:26.99)\r\nOkay, so that's what was gonna ask. Was that like the calm before the storm? Were you just like, is this gonna happen? Like, are we actually gonna?\r\n\r\n\r\nHans Dose (11:33.48)\r\nYou know what, I'm gonna get vulnerable here. I totally fell into a depression, because I was like, I don't know what's happening. don't, you know, the deal isn't done until it even airs. That sort of happens too, because you don't know if you're even gonna air. You film and you don't know what's gonna happen after that. You may not air, they may not show your episode ever. They may show your episode.\r\n\r\n\r\nNikolas Hulewsky (11:38.798)\r\nNikolas Hulewsky (11:56.716)\r\nWait, so Damon shakes your hand at the end of the episode and like, we got a deal. That deal may not happen unless it airs.\r\n\r\n\r\nHans Dose (12:04.596)\r\nSometimes, and not only because it airs, I think that's one of the factors that they would prefer that it airs because that's going to be a big boost. We didn't actually finalize finalized until after it aired. It was a long due diligence process, but yeah, we didn't actually finalize until after it aired.\r\n\r\n\r\nNikolas Hulewsky (12:22.254)\r\nWell, one, like you kind of fell into a depression because you needed the money. That's why you went on to Shark Tank.\r\n\r\n\r\nHans Dose (12:29.714)\r\nYeah, I needed it. It was gnarly. And I, you know, I was working odd jobs on the side, just trying to like, keep things going. And I was doing a home design for like backyards and home remodels. It was like playing Sims all day. It was really fun. You got to design all these crazy things. I worked for this company. helped, I learned a lot about like sales funnels and stuff, cause I got to help build up their business and it was\r\n\r\n\r\nNikolas Hulewsky (12:40.258)\r\nLike what?\r\n\r\n\r\nHans Dose (12:58.964)\r\nIt was cool. But yeah, a lot of odd things.\r\n\r\n\r\nNikolas Hulewsky (13:01.198)\r\nBut you were just piecemealing it for six months. You were just like piecemealing it. You're like, I hope this airs. Did you have any idea of like, is it going to air? Is it not going to air? Or were you literally just up in the air until?\r\n\r\n\r\nHans Dose (13:09.492)\r\nJust hope, just hope and prayers and knowing that I did my best and I felt, I felt really good coming out of it that I was like, there's no way that this doesn't air. And I fought for my spot too, because, because I live local, it was like, you may not actually air, you may not actually be able to pitch because you're local and you might have to just come in as an alternate, that sort of deal. So yeah, it was kind of crazy, but.\r\n\r\n\r\nNikolas Hulewsky (13:34.627)\r\nGosh.\r\n\r\n\r\nHans Dose (13:37.294)\r\nI fought for my spot, got my spot, did the whole thing. It was like full Hail Mary mode for me. It's just, needed something good to happen out of it. And it was, it was, yeah, it was a very, very crazy time. And I'm super grateful for it. My wife and I moved into an RV during that period too. Like from trying to get on the show to actually like going on the show is when all the,\r\n\r\n\r\nNikolas Hulewsky (13:37.313)\r\nWhat?\r\n\r\n\r\nNikolas Hulewsky (13:44.718)\r\nDude, make it happen mode.\r\n\r\n\r\nHans Dose (14:07.252)\r\nAd stopped working all these problems started happening and things started to go south and so from the time that I was like Submitting to get on the show to the time I actually like walked out into the tank things had gone from like oh, yeah This is a decent business to oh crap. I really need this. Let's let's go Yeah, so it was it was just one of those moments. I mean, it's such a risky industry\r\n\r\n\r\nNikolas Hulewsky (14:25.12)\r\nmy gosh.\r\n\r\n\r\nNikolas Hulewsky (14:29.794)\r\nAnd then it was six months, and then it was six months from that point until it aired.\r\n\r\n\r\nHans Dose (14:33.628)\r\nAnd then it was six months from that point until it actually aired. I mean, I was still running the business and I still had receivables coming in and, you know, things were kind of going.\r\n\r\n\r\nNikolas Hulewsky (14:43.138)\r\nGive me an idea. Okay, so how big was the business at that time? A month?\r\n\r\n\r\nHans Dose (14:47.348)\r\nUm, so prior to, actually airing, um, I think we're doing like 30, 60 grand a month. And then the months leading up to airing, like the last two, we were down to like, I think it was like five or 10 grand a month, like next to nothing. Yeah, no, I wasn't making anything from it. was just, it was just, let's keep the dream alive as long as stay in the game as long as possible. That's always been the thing.\r\n\r\n\r\nNikolas Hulewsky (15:03.931)\r\ngosh. Well, and your margin on that was less than 10%. So you're like...\r\n\r\n\r\nYou weren't making any money.\r\n\r\n\r\nWould you have shut it down if you didn't have the shark tank potentially airing?\r\n\r\n\r\nHans Dose (15:21.364)\r\nI don't think so. I always find a way. I don't know. I feel like I always find a way. But I knew I was banking on that. And that was the thing. At that time, I was banking on that and nothing else really mattered. And I just believe that it was going to air because I did as much as I possibly could to make it the best possible. if you watch the episode, it was a good episode. And I just...\r\n\r\n\r\nNikolas Hulewsky (15:23.922)\r\nokay.\r\n\r\n\r\nNikolas Hulewsky (15:45.763)\r\nYeah.\r\n\r\n\r\nHans Dose (15:48.948)\r\nI don't know, for some reason I just knew it was all gonna work out.\r\n\r\n\r\nNikolas Hulewsky (15:52.302)\r\ncan't wait to hear the punchline to this, but I'm intentionally just teasing it out. So before it aired, you got down to $10,000 a month. Were you in due diligence with Damon at this point?\r\n\r\n\r\nHans Dose (15:55.122)\r\nYeah. Okay.\r\n\r\n\r\nHans Dose (16:07.172)\r\nyes. no, not, not before it airs. wait. Yeah. I'm sorry. Before we filmed, that's where I was at. I think once after we filmed, it was starting to creep back up a little bit. It wasn't much though, but yeah, that those are the numbers we were getting during that period. Yeah.\r\n\r\n\r\nNikolas Hulewsky (16:08.812)\r\nOkay, when did... Okay.\r\n\r\n\r\nNikolas Hulewsky (16:23.374)\r\nOkay.\r\n\r\n\r\nOkay, pre-filming you were there. Where did you think it was gonna go after it aired? Like what was your hope that it would get to after it aired? Obviously you're like, a million a month would be amazing. then you're like, okay, more realistically, if I can get to this spot, I'd be happy.\r\n\r\n\r\nHans Dose (16:37.321)\r\nYeah.\r\n\r\n\r\nHans Dose (16:41.364)\r\nYou're gonna laugh. My three-year goal was to get it up to five million a year. We're now three years later at 12 and a half million. So it went way better than I thought. mean, Tank certainly helped, but that's only a spike during that period. And I was really fortunate. Part of the reason why I ran out of cash is because I bought all this inventory. So I was really fortunate that I had the inventory ready to turn. And when that airing hit, like we sold out in...\r\n\r\n\r\nNikolas Hulewsky (16:53.88)\r\nYeah.\r\n\r\n\r\nHans Dose (17:10.644)\r\ntwo or three days, it would knock. I'm sorry. I really didn't. Yeah. So it and their teams actually told me that was one of the better results, sales results in recent years compared to like the earlier days of Shark Tank when that would happen frequently. Yeah, I don't know.\r\n\r\n\r\nNikolas Hulewsky (17:11.138)\r\nThat was, dang it. That was gonna be, no, no, no, dude, don't apologize. It's your freaking story. I was so curious about that.\r\n\r\n\r\nNikolas Hulewsky (17:30.624)\r\nMm-hmm. So if you were doing 30 grand a month, you're doing 30 grand a month, you got a bunch of inventory and then Shark Tank airs, what did you do in that first month, second month, third? Like when did the spike hit?\r\n\r\n\r\nHans Dose (17:41.14)\r\nSo it aired in December, which was the perfect timing. was like December 17th, right before the holidays. It was awesome. I think that month we did like 640K or something like that, like just in that month. I mean, this business honestly, yeah, yeah. It was about a two week period that we did all of that. I think that was the number, about 600 something K. Yeah, it was awesome. It was like, oh, nice. We're a real business now. Let's go.\r\n\r\n\r\nNikolas Hulewsky (17:53.836)\r\nWell, and just in that two weeks probably, right?\r\n\r\n\r\nNikolas Hulewsky (18:01.016)\r\nWhoa!\r\n\r\n\r\nHans Dose (18:10.162)\r\nAnd then it's like, okay, now what? Like right after that, you have to keep some momentum going. So really just lean hard into it. Started pitching to retail, which has been difficult. I've got, yeah, actually it is. Here it is packaged. I just had a meeting before this with one of our distributors. So my packaging happens to be here. I wasn't planning this, but yeah, this is it.\r\n\r\n\r\nNikolas Hulewsky (18:24.064)\r\nIs that the product behind you by the way? Yeah, sure.\r\n\r\n\r\nNikolas Hulewsky (18:34.286)\r\nIt's so awesome. Will you grab the one you have out? I wanna see it. I know it's a light.\r\n\r\n\r\nHans Dose (18:38.002)\r\nYeah, so this is the fun part about this brand is made the platform, which is the tentacle. It's mount stuff anywhere. So the next move was let's make the stuff it can mount. So not just phones and cameras, but let's do lights and fans and speakers and all kinds of things that we can mount anywhere. Yeah, so it bends, it wraps, it's suction.\r\n\r\n\r\nNikolas Hulewsky (18:46.946)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (18:54.926)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (19:02.114)\r\nOkay, but those were the things you had in inventory. You didn't have the lights and all that other stuff when Shark Tank went live. Yeah. And so month one, or really first two weeks, 640,000, what did you do in January then? Do remember?\r\n\r\n\r\nHans Dose (19:06.704)\r\nNo, yeah, this is all I had in inventory. Yep.\r\n\r\n\r\nHans Dose (19:15.964)\r\ndrops. I mean, January's always dropped. think that January, especially because we had sold out, we were back down to like just scraps. It was like leftover stuff. So down to scraps, like 10K a month or 5K a month. Yeah, it was because we sold out. Not only because we sold out. usually Q1 to Q2 are pretty rough months for this business.\r\n\r\n\r\nNikolas Hulewsky (19:30.414)\r\nbut it was because you sold out.\r\n\r\n\r\nNikolas Hulewsky (19:41.752)\r\nMm-hmm.\r\n\r\n\r\nHans Dose (19:44.07)\r\nMainly because it's hard to bulk to individuals. For a product, people really only need one, maybe two or three at the very most. But when the holidays come around, we crank on like 10 packs, 12 packs, like stocking stuff for this. And so like last year, that 12 and a half million, I think we did eight of it in Q4, like a little over eight. Yeah, it's just, it's a very seasonal.\r\n\r\n\r\nNikolas Hulewsky (20:09.806)\r\nHoly crap. It's a stressful business.\r\n\r\n\r\nHans Dose (20:14.036)\r\nYeah. So it goes, wow, wow, wow. It's such a rollercoaster. So partly why I want to open this factory is, uh, you know, de-seasonalize, um, things a bit. It's just a very, I mean, most consumer items that are non-essentials tend to go through cycles like that. Or if it's like a, a pool floaty business, what you're going to do most of that in summer. Um, yeah.\r\n\r\n\r\nNikolas Hulewsky (20:19.337)\r\nNikolas Hulewsky (20:37.774)\r\nSo tell me about the unit economics, the amount that you had. What does that typically cost you and what are you selling it for? Because you're.\r\n\r\n\r\nHans Dose (20:42.718)\r\nYep.\r\n\r\n\r\nHans Dose (20:47.292)\r\nYeah. So when I went into Shark Tank, that cost me six bucks to make, and I was selling it for 45 ish. Perceived value, I mean, it's a really handy product. It's all your mounts in one. It's a great, know, so perceived value is pretty high. Our average selling price now is in the low thirties range, high twenties range, depending on the season.\r\n\r\n\r\nSo unit economics now back on Shark Tank, was $6. We now have it landed about $4.65 per unit and our average selling price being high 20s, low 30s.\r\n\r\n\r\nNikolas Hulewsky (21:30.446)\r\nI don't get it. Why then why is your net margin less than 10 %?\r\n\r\n\r\nHans Dose (21:34.132)\r\nFacebook ads. It's ads. To get that volume, to get that volume, you gotta crank marketing up all the time. And that's where most of the money goes is to advertising. I think last year we spent like four and a half million in ads. It's a lot of money going to Zoc. It's crazy. Yeah. But that's what that takes.\r\n\r\n\r\nNikolas Hulewsky (21:37.458)\r\nreally?\r\n\r\n\r\nNikolas Hulewsky (21:54.744)\r\nSo how many units did you sell last year?\r\n\r\n\r\nHans Dose (21:58.804)\r\nA little over 300,000 units last year.\r\n\r\n\r\nNikolas Hulewsky (22:02.35)\r\nSo 300,000 units, $4.5 million in spend is, what is that, $12 a unit?\r\n\r\n\r\nHans Dose (22:06.216)\r\nMm-hmm.\r\n\r\n\r\nHans Dose (22:10.484)\r\nAbout 12 a unit, yeah.\r\n\r\n\r\nNikolas Hulewsky (22:13.25)\r\nDude, wow, more than double your cost of production is your cost to acquire a customer.\r\n\r\n\r\nHans Dose (22:17.682)\r\nYeah, 100%. The only company that's really made that much off of this is Meta. They have ranked it in. I always laugh. I'll see a watch that Zuck's wearing or something. I paid for that.\r\n\r\n\r\nNikolas Hulewsky (22:24.226)\r\nhahahaha\r\n\r\n\r\nNikolas Hulewsky (22:32.75)\r\nYeah, you see that, you see that, you see that right there, that screw on the band? I paid for that screw. That's, that's insane, dude. Cause you hear, you explain the unit economics. It's like, Oh, we charged $35 and it costs us $4. Oh dude, let's do that all day. But, Oh, I...\r\n\r\n\r\nHans Dose (22:37.126)\r\nYeah, I'd pay for that. Yeah, sometimes it feels like you're at a...\r\n\r\n\r\nHans Dose (22:49.808)\r\nYeah. But to sell a lot of them, I mean, I had to make the market for this. People don't know that they need a flexible octopus mount to mount their phone anywhere. You got to shout from the hilltop and make it known. And the, and the easiest way to do that at scale is ads running, running marketing. I mean, you got to think what hex clad spends per year on their marketing goal. It's not so, it's the Gordon Ramsey,\r\n\r\n\r\nNikolas Hulewsky (23:13.23)\r\nI don't know who that is.\r\n\r\n\r\nHans Dose (23:20.318)\r\nKitchenware things, Hexclad, it's a big one. There's a bunch of big e-commerce companies that that's how they built their brands up is purely through performance.\r\n\r\n\r\nNikolas Hulewsky (23:21.718)\r\nOkay. So.\r\n\r\n\r\nNikolas Hulewsky (23:28.238)\r\nSo you've been doing this for a number of years. You manufacture this in China. You've gotten it to a point where it's like, all right, $4 a unit. You've got really clean unit economics. And now, because it's a low margin business, you've got to have volume. And then all of a sudden, when the tariffs come in, or at least they're being talked about, you're like, how do we make this work? And really, for the last several years, the government...\r\n\r\n\r\nHans Dose (23:42.632)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (23:53.87)\r\nand executives within industry, they've been preaching to executives, out of China. Because it wasn't just the tariffs. It wasn't just, Trump's going to come in here and raise tariffs. It was also, they may attack Taiwan. We never know what geopolitical risks there might be. You're overexposed in China. And so people have been looking at outsourcing outside of China. One of the things that I found very interesting is I've heard many people say China's not where you go to make stuff cheaply anymore.\r\n\r\n\r\nHans Dose (24:12.958)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (24:22.338)\r\nLike it's not like the labor is way cheaper. It's where you go because they've got the manufacturing expertise. Is that true? Blows my mind.\r\n\r\n\r\nHans Dose (24:27.88)\r\nYeah, that is true. Yeah, absolutely. Yeah, I think it's a big problem that the US is facing that we've slowly not realized. I think manufacturing is pretty unsexy. Smart people want to go into tech. They want to build a SaaS business. They want to do all that. But how many SaaS businesses can you have?\r\n\r\n\r\nNikolas Hulewsky (24:49.26)\r\nYeah.\r\n\r\n\r\nHans Dose (24:53.022)\r\nwhen there's no brands to actually pay for the SaaS company. It really comes down to bits here and the bits being the items that are on shelves that people consume.\r\n\r\n\r\nNikolas Hulewsky (25:07.246)\r\nDid we as the United States just outsourced all of our manufacturing know-how and capacity to China over the years because it was so much cheaper and now there's nothing locally? Or do we have it locally, we just don't know how to scale the infrastructure?\r\n\r\n\r\nHans Dose (25:23.316)\r\nI think it's more we have the technical knowledge locally. We don't have the infrastructure to build it up. it's kind of a, it's a broad problem. You know, machinery here in the U S so for the factory I'm starting, all I need is like a 200 ton press and I'll get multiple of these that same 200 ton press in the U S costs, you know, a hundred grand to 300 grand made in USA.\r\n\r\n\r\nthat exact same spec'd out everything overseas, same quality, same everything, about eight grand. So the difference just in the machinery alone kind of starts to really change things. And then I think the field itself has sort of skipped a generation. There's just not enough people doing it. And I think...\r\n\r\n\r\nwith this new sort of manufacturing renaissance with the tariffs and everything, as much as they're painful to go through, they could end up being a positive thing in the long run if more people just build startups to make things. I mean, that's...\r\n\r\n\r\nNikolas Hulewsky (26:35.63)\r\nCan you describe how manufacturing facilities work right now?\r\n\r\n\r\nHans Dose (26:41.212)\r\nYeah. So in the U S most factories are set up for those long-term large scale contract manufacturing where they, bid on a contract with a company like Volkswagen or whatever. We're we'll make this component and we'll, we'll charge you this much. Okay. Great. You have it. Here's your five year contract to do that. And then they build out everything for that one component or however many components that they're making. It's very,\r\n\r\n\r\ndeal driven, long-term predictable, and that's great. But when it comes to, yeah, super, you're making the same thing millions of times. What China did really well is they created a lot of small, mean, they were very entrepreneurial and created small scale, super efficient factories that will take those low minimum order quantities of like,\r\n\r\n\r\nNikolas Hulewsky (27:16.44)\r\nhigh volume, large dollar contracts, predictability.\r\n\r\n\r\nHans Dose (27:39.774)\r\nwe'll do 3000 units for you, here's the price. And they just hustled it out and just like took all as much business as they possibly could. And eventually consumer brands in the US just got used to working with China because they'll hustle it out and get decent costing for things that are, you know, lower minimum order quantities. While I think the US just got used to\r\n\r\n\r\nlarger runs of the same thing and maybe got complacent on, you know, I don't want to do all that. And it feels like it skipped a generation. and I think that's why brands are just so used to producing overseas because they were able to really optimize for that small scale stuff and use them.\r\n\r\n\r\nNikolas Hulewsky (28:29.23)\r\nSo if I'm a large $100 million plus brand and I'm doing a high volume, I might be doing some domestic manufacturing because it's high volume, high dollar amount, predictable, et cetera. But for many of these companies that are e-commerce brands that are white labeling, dropshippers, anybody who's a small business that's selling a product, they would be outsourcing that to China.\r\n\r\n\r\nHans Dose (28:55.933)\r\nMm-hmm.\r\n\r\n\r\nHans Dose (28:59.358)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (28:59.458)\r\nBecause what you're saying is China's effectively figured out how to efficiently create these smaller runs without having to invest a massive amount in the infrastructure.\r\n\r\n\r\nHans Dose (29:05.33)\r\nRight. With the infrastructure, right, with the infrastructure being a place, I think if a massive brand wanted to move all their manufacturing here in the US, they'd have to build out an entire setup. You know, it's a lot to build a whole warehouse and optimize it for that. It is a lot, even at the large scale stuff, it's even worse or harder.\r\n\r\n\r\nNikolas Hulewsky (29:12.142)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (29:22.7)\r\nWha- the thing-\r\n\r\n\r\nNikolas Hulewsky (29:29.036)\r\nThe thing that you said to me on our pre-call and just blew me away is you were like, basically, we've got to copy China and bring what they're doing here to the United States. And it was like, whoa, I'm always hearing about, no, China's copying us. They're stealing our IP. But what you're saying is the opposite of that.\r\n\r\n\r\nHans Dose (29:35.956)\r\nYeah.\r\n\r\n\r\nHans Dose (29:42.27)\r\nYeah. You know what?\r\n\r\n\r\nYeah, we need to steal China. China's strategy, essentially. Yeah. So it's funny. That's my plan with this factory startup is steal the playbook of small scale. Just get a few rudimentary machines that produce the parts efficiently in a small shop, get it running and going, scale it from there. And that's what they've been doing. Like the\r\n\r\n\r\nNikolas Hulewsky (29:50.67)\r\nYou\r\n\r\n\r\nHans Dose (30:16.882)\r\nThe factory that produces my products, that's what they are. They're a small warehouse. have just a few of the machines that they need to produce for me and a few other brands. And they crank and they do, you know, good work and they're fine with smaller minimum order quantities. So, you know, my, my thought is if we're going to compete on the global scale of manufacturing, we have to kind of copy that playbook. We can't just be doing massive factories every, it needs to be small scale satellite operations.\r\n\r\n\r\nNikolas Hulewsky (30:44.558)\r\nWell, here's my question. Like you're doing a ton in sales with your other company. Why didn't you just look at the way that everybody else is doing it and think, I'll near shore it. I'll do it in Mexico or I'll do it in Central America or I'll go to Vietnam or one of these other countries. It seems like everybody else would have priced us out and said like, we could bring it back to the United States or we could do these other places.\r\n\r\n\r\nHans Dose (31:01.161)\r\nYeah.\r\n\r\n\r\nHans Dose (31:07.314)\r\nYep. Yep.\r\n\r\n\r\nNikolas Hulewsky (31:11.702)\r\nSo the smart money is going elsewhere. Like, what do you see that they're not?\r\n\r\n\r\nHans Dose (31:15.54)\r\nWell, it's twofold. Number one, I love a good opportunity and I see this as an opportunity. I know a few other brands in the space that were struggling. I've made a post that I'm planning on doing this and boom, right out the gate, know, this company could be doing more in revenue than my other company. So number one, opportunity. Number two was the... So I have molds in Mexico. It's been difficult to...\r\n\r\n\r\nkind of keep the process going. They just don't move as fast. And looking at Vietnam, looking at these other countries, it doesn't change the geopolitical uncertainty that's happening in the space. Taiwan and China might break out. What happens to all the freight that's like...\r\n\r\n\r\nUS has to pick a side. Maybe they embargo all the ships going across the Pacific and then now everyone's screwed. Doesn't matter where in South Asia or South Pacific or that region that you're shipping from. And then Central America and all that, it's starting to feel like everyone is going there and there's only so much infrastructure and only so much in place that can accommodate everyone. And so even now, a lot of those shops are\r\n\r\n\r\nNikolas Hulewsky (32:13.294)\r\nMm-hmm.\r\n\r\n\r\nHans Dose (32:37.272)\r\nseemingly raising their prices a bit. and we're only just getting into this. There's so much uncertainty. My thought was if I did it in my backyard here, nothing can get it in the way of that. And, and I know for certain that my product is being made here in the U S and I don't have to worry about what's happening globally.\r\n\r\n\r\nNikolas Hulewsky (32:44.299)\r\nSo what?\r\n\r\n\r\nNikolas Hulewsky (32:58.19)\r\nSo how does it pencil? Because most people that I hear talk about this are like, you can't do it in the United States. Nobody wants those jobs. Wages aren't there. And then the next piece will be, and we don't have the infrastructure. We don't have the natural resources like China does. Let's just go somewhere else. And then you decide, also, I'm going to put it in California, California, New York, Massachusetts have the worst, from an employer perspective, labor laws.\r\n\r\n\r\nThey've got regulatory and compliance laws on businesses. They're just burdensome. In my mind, it doesn't pencil. How does it pencil in your mind?\r\n\r\n\r\nHans Dose (33:34.196)\r\nYeah, so let's go through each of these. first thing, regulatory stuff. Silicon is super clean and safe. That's great. The waste is very minimal. If any, it can get ground up and reused. So that's good. Energy also, the efficiency of these machines. mean, yeah, they're 54 kilowatt hour energy cost. But\r\n\r\n\r\nWhere I'm looking at putting this is in Riverside County in California. So the energy is abundant when you factor in solar and it's reliable energy. And the space is cheaper than, I mean, I'm not putting in Orange County. So space is a bit cheaper. Getting into labor, let's do some quick math on, napkin math on how this works. So.\r\n\r\n\r\nNikolas Hulewsky (34:21.624)\r\nSure.\r\n\r\n\r\nHans Dose (34:30.84)\r\nmachine producing my product it has a mold which is like a big waffle maker and that mold can have any number of cavities that can fit within the space of the plate of that press so in my case for the tentacle item it's a six cavity mold so I know for every run that it does it's gonna produce six tentacles the cycle time of this\r\n\r\n\r\nis about 60 seconds. So one machine operator working at one of these machines every 60 seconds is pumping out six tentacles. So in an hour, they're making 360 units in a single hour. If I pay them really well, let's say $36 an hour for simple math, that's 10 cents per unit in labor costs.\r\n\r\n\r\nyou know, breaking down from $36 an hour divided by 360 units per hour, that's only 10 cents in labor costs per unit. So the math on labor, you know, like you said earlier, people don't go to China anymore because of cheap labor. In some cases, if it's sewing or things like that, yeah. But for an item like this, that's much more automated, it pencils out.\r\n\r\n\r\nNikolas Hulewsky (35:31.63)\r\nMm-hmm.\r\n\r\n\r\nHans Dose (35:52.084)\r\nJust on the labor and then what's even better is the machines that I'm getting have a center console and there's actually that runs to Side-by-side and they cycle every 60 seconds alternatively. So every 30 seconds The single machine operator is actually working two machines so I can get 12 units\r\n\r\n\r\nNikolas Hulewsky (36:11.83)\r\nSo where does the unit economics get down to? So you were saying it started at six, it went down to four. Where do think it'll be in California?\r\n\r\n\r\nHans Dose (36:15.54)\r\nYep. my 465 is my landed cost. It's actually 344 from the factory if I didn't have to freight it. So my factory overseas charges me 344. And then with freight and tariffs and customs and all of trucking, getting into the warehouse, everything brings it up another dollar and 20 cents ish. And that's the, that's the tariffs.\r\n\r\n\r\nprior to the jump. So that was our 2024 tariffs. So just imagine now I'm paying $11 a unit just to get it here, which doesn't make sense. It doesn't, it doesn't matter. So raw materials cost for my product, it's 3.7 ounces of silicone. Silicone costs about four to six on the high end per pound, dollars per pound. So 3.\r\n\r\n\r\nNikolas Hulewsky (36:47.309)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (36:54.348)\r\nI'm afraid. Geez Louise.\r\n\r\n\r\nHans Dose (37:14.266)\r\nseven ounces. I'm looking at about a buck 20 ish is about the range. And that includes sorry, that also includes the steel metal that's inside. So I'll have to stamp the steel, put that in there, overmold the steel with the silicone.\r\n\r\n\r\nNikolas Hulewsky (37:31.79)\r\nI'm like the guy in the GIF right now who's like confused and he just sees math numbers floating around his face. I'm like, okay, you could say, you could literally say anything right now and I'd be like, you win.\r\n\r\n\r\nHans Dose (37:36.646)\r\nYeah, I am too. I'm pretending like I know it all. I'm not even the math in my head. I wrote it down for something else and I just remember it kind of. So if my math is incorrect, just trust me on this. It's okay. So I'm about a buck 20.\r\n\r\n\r\nNikolas Hulewsky (37:57.326)\r\nOkay, believe you have, you have efficiently proven that you're an expert. So I believe whatever number you say to me right now, I'm going to believe is your fully loaded costs. So, so where do you get to?\r\n\r\n\r\nHans Dose (38:06.236)\r\nOkay, yeah. So we'll get to about $3.15 is what I mapped it out to, $3.15. That's with packaging. And because I don't have to freight anything, that's it. So then you have to factor in margin for the factory because what the factory was charging me was $3.44. They were making a margin on that. So clearly they're making it cheaper than I am here.\r\n\r\n\r\nNikolas Hulewsky (38:19.884)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (38:27.831)\r\nAhem.\r\n\r\n\r\nHans Dose (38:33.619)\r\nMost of that really comes down to the raw materials itself, because China actually subsidizes their silicone so they can get silicone for cheaper, almost half of the price here. But still, you factor in all the freight and all that stuff, it kind of evens out somewhere down the line. yeah, it just makes sense for me to do this here. if I, let's say I charge a 30 % margin to my products,\r\n\r\n\r\nNikolas Hulewsky (38:51.822)\r\nkind of washes out.\r\n\r\n\r\nHans Dose (39:02.174)\r\nfrom the factory, 30 % is decent. think the average in manufacturing is around 20 % is what I've heard. So 30 % gets me to that, essentially the same land cost that I was paying previous. Yeah.\r\n\r\n\r\nNikolas Hulewsky (39:17.454)\r\nSo, okay, here's my question for you. I think that...\r\n\r\n\r\nThere are five words that get you into entrepreneurship and get you into a lot of trouble, but you wouldn't have done anything if you hadn't done these, if you hadn't said these words to yourself. But the five words are, how hard could it be?\r\n\r\n\r\nHans Dose (39:31.248)\r\nMm-hmm. Yep.\r\n\r\n\r\nHans Dose (39:41.748)\r\nIt's going be hard. I will admit that.\r\n\r\n\r\nNikolas Hulewsky (39:43.69)\r\nAnd like, well, no, no, listen to me, listen to me where it's like, I've penciled it out. Let me just make sure that's all five. How hard could it be? Cool, five. All right. We're like, no, I penciled it out. Yeah, it's there, but you've never done it before. Do you know what I mean? And then everybody, they'll get into it and they're like five years in and they're like, if I knew everything I knew now, there's no way in heck I would have freaking done this. know, this is way too hard.\r\n\r\n\r\nHans Dose (39:48.52)\r\nRight.\r\n\r\n\r\nHans Dose (40:05.844)\r\nSame exact story with the tentacle business. Yes, I was so naive going into it, but now look, 12.6 million a year business or whatever.\r\n\r\n\r\nNikolas Hulewsky (40:08.845)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (40:14.914)\r\nWell, that's what I'm saying is like, you have some experience, so you know that that's like a reality of entrepreneurship. My question to you is, how are you getting up to speed? Like, are you contracting with people in China who have built out these manufacturing facilities that understand what it takes? Or are you just like Googling and chat GPT? Because I'm assuming that... Okay, go ahead.\r\n\r\n\r\nHans Dose (40:33.096)\r\nYeah.\r\n\r\n\r\nI wanna every-\r\n\r\n\r\nYeah, sorry. I didn't mean to you off. So initially my first dive into this was number one, looking at what my factory was doing and seeing the videos that they sent over of like, okay, what are they actually doing to make my product? And then going on a deep dive on YouTube and I would actually like translate it into Chinese. What I was looking for compression molding silicone kitchenware goods. And then I would put it in Chinese and then I would go to like,\r\n\r\n\r\nNikolas Hulewsky (40:41.326)\r\nHmm\r\n\r\n\r\nNikolas Hulewsky (41:03.053)\r\nReally?\r\n\r\n\r\nHans Dose (41:06.387)\r\nI would type it all out in Chinese in YouTube because it was translated and then I would get more direct stuff from factories in China showing their processes and that stuff. a bit of a run-of-the-hole. then chat to GPT is certainly helpful. And then people are incredibly helpful. You spoke about Dan Thompson that was on your podcast. I had a lovely conversation with him after hearing your podcast.\r\n\r\n\r\nNikolas Hulewsky (41:18.174)\r\ndang, you went deep.\r\n\r\n\r\nHans Dose (41:35.758)\r\nAnd he was incredibly helpful on some things to watch out for, things to think about, that sort of thing, and technical stuff as well. He actually, one of the cool things that he told me, some of their most efficient machines are like 100 years old and they just crank and they never break down. I thought that was pretty cool. And that's a cool thing to share. so the, yeah, there's a bit of research. then other folks, just yesterday I spoke with\r\n\r\n\r\nsomeone for a while. He's also starting a factory in Mexico. So he's doing the Mexico route. And he's been in this space for a long time. We chatted for a while. Yeah, it's just people are really supportive of the idea and people are coming out to share what they're learning. And, you know, that's the cool thing about starting any business. As long as you're telling people what you do, people want to help. And that's been really, really cool.\r\n\r\n\r\nNikolas Hulewsky (42:17.752)\r\nWhat's?\r\n\r\n\r\nNikolas Hulewsky (42:32.238)\r\nIt's really interesting with some of the old technology, like you said, first of all, it makes me really happy to hear that you listened to a podcast that I did with Dan and then got connected with Dan. like, you know, now you've got, what is it? 10, $20 million of like potential commitments to the factory that you're launching, which is incredible. But actually you were at this dinner with me. I heard this guy explain qubits, because we were talking about quantum computing.\r\n\r\n\r\nHans Dose (42:48.574)\r\nYeah.\r\n\r\n\r\nHans Dose (42:58.342)\r\nMm-hmm. my brain was breaking. I was trying to keep up, but yeah. So tough. Yeah.\r\n\r\n\r\nNikolas Hulewsky (43:01.752)\r\nDude, my brain was done. My brain was absolutely fried. He was freaking so smart. But one of the things he was talking about with quantum computing is in order for us to get one qubit worth of power, we essentially have to have like 500 qubits or something ridiculous. It's like some crazy number.\r\n\r\n\r\nHans Dose (43:20.82)\r\nMm-hmm. Yeah.\r\n\r\n\r\nNikolas Hulewsky (43:22.958)\r\nAnd it's worked its way down over time. And I don't, again, I don't know all the technical stuff and some nerd is listening to this. They're like, well, technically it's not cubits to power. It's cubits that give like, I don't know, but that's just what he told me. Okay. I'm repeating it. And so I asked him about traditional computing bits, not cubits, but bits. And I was like, okay, what's the ratio there? Cause like I get it several hundred cubits to get one cubit of processing power. How many hundreds of bits does it take to get one bit of processing power? And he was like, it's\r\n\r\n\r\nHans Dose (43:29.178)\r\nYeah.\r\n\r\n\r\nHans Dose (43:38.633)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (43:52.448)\r\nalmost one to one. And I was like, really? He's like, well, we've just had it for so long. And we've gotten so efficient with it. know we've done all the shortcuts. We've optimized it as much as we can. It's like almost one to one. And so when you say that there's a hundred year old machine that Dan has, it's like his most productive. It kind of makes sense, right? It's like it's been around the longest. So we've had the most time to optimize that machine. Whereas these new machines, we haven't, we just haven't had as much time.\r\n\r\n\r\nHans Dose (44:19.6)\r\nYeah. And his whole thing about it was there's just too much tech in these new machines. And when they break, I mean, it's like working on an old car. I've always had a dumb old classic car that I, right now it's a classic Mini Cooper and I love tinkering on them because it's fun to work on cars, but you can't work on new cars. It's just too darn complicated. And same goes with machinery. And that's kind of part of our plan is actually buying used machinery. bunch of the machinery that I sourced is...\r\n\r\n\r\nNikolas Hulewsky (44:28.238)\r\nI was just gonna say that.\r\n\r\n\r\nHans Dose (44:49.276)\r\na lot cheaper and it's a lot older, but it just does the job. And that's kind of the important thing. I think, again, back to why is manufacturing in the US so expensive? I think a lot of it comes down to like,\r\n\r\n\r\nthe capital expense going into it, like maybe just try to be more frugal in the capital expense going into it and just get what works and don't go for the ultimate. Yeah.\r\n\r\n\r\nNikolas Hulewsky (45:15.895)\r\nI mean.\r\n\r\n\r\nNikolas Hulewsky (45:19.47)\r\nI think we're going to see some really cool stuff. mean, the old saying, necessity is the mother of invention. And you've got all these companies like yours who are like, well, tariffs are here. I got to figure this out. think we're going to... It's what I would call the upside of the downside. It's one of my favorite sayings. It's like, of anything that's good, there's a downside, right? So it's like, this is the downside of the upside. And for anything that's bad, there can be an upside. So it's like, this is the upside of the downside. I don't know why. I just love that saying.\r\n\r\n\r\nHans Dose (45:24.68)\r\nYep.\r\n\r\n\r\nNikolas Hulewsky (45:48.686)\r\nAnd I think this is gonna be a forcing function for people to figure out how to do it, probably domestically. That's the upside of the downside.\r\n\r\n\r\nHans Dose (45:51.732)\r\nI think so too. And it may not be 100%, you know, one for one cost difference from overseas. That's our goal is to get it to the same cost and have additional benefits. You know, you don't have to freight it for 45 days. It takes 10 days to get from our shop to your warehouse than 45 days. Just think of like, you know, how much cash outlay that is in your cash conversion cycle that's stuck on water. You know, things like that.\r\n\r\n\r\nNikolas Hulewsky (46:09.71)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (46:19.756)\r\nYour whole inventory, your working capital is just tied up in inventory.\r\n\r\n\r\nHans Dose (46:21.074)\r\nYeah. Exactly. I think that there's a lot more benefits to producing here in the U.S. And I think that wages, you know, as long as it's not super labor intensive, you can keep decently high, great, livable wages for, you know, folks on the floor producing stuff here in the U.S. and still be competitive with overseas pricing. I think it's just going to be some technical stuff we're going to have to hurdle. Yeah.\r\n\r\n\r\nNikolas Hulewsky (46:48.078)\r\nSo for entrepreneurs who freaking out right now, they have an e-commerce business or they sell a product and they're like, how am going to survive with these tariffs? I got to onshore this or I got to near short, I got to blah, blah. How can they find you? Where can they reach out to you?\r\n\r\n\r\nHans Dose (47:02.684)\r\nYeah, on X it's hansdos underscore does, hansdos does. And LinkedIn, just hansdos, it's D-O-S-E like medicine. Happy to help. If you are looking at on-shoring, obviously if it's any thermoplastics or silicone, things like that, let's talk. But even just finding other facilities, know, I've...\r\n\r\n\r\nMy network has grown quite a bit since I've been working through this and, even nearshoring in Mexico as well. I'm kind of swinging a big swing here. In some ways it's a Hail Mary for the tentacle business. Cause I just have to do something. And so I'm taking a big leap of faith and there's certainly a need for it. But I'm happy to help anyone who needs to reshore do that. Or if anyone wants to get involved in the American manufacturing Renaissance.\r\n\r\n\r\nWe need help. We need money too. Thank you. Thanks, Nick. Good hanging out. Bye.\r\n\r\n\r\nNikolas Hulewsky (47:59.982)\r\nWell, rooting for you Hans. This is awesome. Talk soon.",
  "metadata": {
    "duration": "",
    "date": "2025-05-26",
    "platform_source": "Google Drive"
  }
}