{
  "episode_number": "172",
  "episode_title": "How to Build a $700k Business with 50% Margins with Bryant Suellentrop",
  "guest_name": "Bryant Suellentrop",
  "business_name": "Elevate and Delegate",
  "transcript": "﻿Nikolas Hulewsky (00:00.91)\r\nAll right, Bryant, tell me about your business. What do you do and how do you make money?\r\n\r\n\r\nBryant Suellentrop (00:05.548)\r\nSure, happy to Nick. Thanks for having me. My name is Brian Solentrop. I live in Charlotte, North Carolina and I run a offshore recruiting company called Elevate and Delegate. So we help mostly small businesses hire offshore and do it the right way and do it on a one-time fee basis so that that person becomes a part of their team and they can get back to work. That's basically what I do.\r\n\r\n\r\nNikolas Hulewsky (00:30.599)\r\nGive me an idea how big is Elevate and Delegate?\r\n\r\n\r\nBryant Suellentrop (00:33.816)\r\nSo over the last four years, we've done about 1,200 placements. So we're not the giant behemoths in the industry. For people in this industry, they know that there's multibillion dollar companies. mean, there's companies that do the outsourcing for firms like Facebook and Airbnb or support those kinds of guys. And they're massive companies. I like to think of myself as just a more consultative play where\r\n\r\n\r\nWe work with small business owners and just keep it, keep it lean. We have a team now, we've shrunk our team actually because of how much automation and AI we've been able to use on the recruiting side, which has been really exciting. So now it's just me and four others. We've had as many as 13, 14 people on the team, but it's just not necessary for us anymore.\r\n\r\n\r\nNikolas Hulewsky (01:25.208)\r\nOkay, give me an idea though. Give me something juicy. Top line revenue last year. What was it?\r\n\r\n\r\nBryant Suellentrop (01:30.104)\r\nYeah, sure. Top line revenue last year was... I know that you're not going to believe me when I say like, I don't remember off the top of my head, but I think we were probably somewhere around like 700K last year, 650, something like that. And we did that the year previous kind of similarly.\r\n\r\n\r\nNikolas Hulewsky (01:38.156)\r\nI don't believe you.\r\n\r\n\r\nNikolas Hulewsky (01:52.79)\r\nAnd then margin performance. What do these types of business do?\r\n\r\n\r\nBryant Suellentrop (01:56.95)\r\nYeah, we've kind of gone through some, I mean, I would say these types of businesses generally operate at something like a 50 % margin. But that has, there's so many variables, right? We operate on a one-time fee basis. So we get paid once, right? For the companies that do the management fee where, you know, they're just taking a percentage of that person's salary, like in perpetuity, they have a lot more revenue on the longterm.\r\n\r\n\r\nNikolas Hulewsky (02:04.6)\r\nPoof.\r\n\r\n\r\nBryant Suellentrop (02:25.848)\r\nBut their margins may be 10%, right? Like something much smaller. Yeah, so it's a volume play and recurring revenue play.\r\n\r\n\r\nNikolas Hulewsky (02:30.274)\r\nvolume.\r\n\r\n\r\nNikolas Hulewsky (02:34.062)\r\nDude, that's incredible. right, $700,000 business with 50 % margins. I've always talked to, I know you're not saying that that's your exact business, but I'm just extrapolating here. Whenever I talk to people, sometimes they're like, well, I only have a business that does $700,000 a year. I'm not saying you say this, but $700,000 a year and 350 in net income. And like from my world, healthcare, to get to a 350 in a net income.\r\n\r\n\r\nYou've got at least a $3.5 million business, not a $700,000 business. And I don't have four employees, a $3.5 million business. I've got like 60, 70 employees that I'm managing. So the operational complexity is very different and the margin is just nowhere near as good. So revenue, yes, it's like a, it's a big number and whatever. It's a vanity metric sometimes in my opinion, but that bottom line, holy crap, man. If you do, if you pull in $350,000 a year, like that's\r\n\r\n\r\nChef's kiss, it's beautiful.\r\n\r\n\r\nBryant Suellentrop (03:32.886)\r\nYeah, don't tell my mother-in-law. I don't want people to know that we actually make money, okay? It's just for the podcast world, just for our private corner of the internet. yeah, it's a great business. I love it.\r\n\r\n\r\nNikolas Hulewsky (03:36.066)\r\nHahaha!\r\n\r\n\r\nYeah, yeah, yeah, yeah, My wife's grandfather used to say about, he's like, yeah, I went and saw my friends. He's like, yeah, what'd you guys do? we're just sitting around telling lies. Okay, you are, Elevate and Delegate, would say, and correct me if I'm wrong, you're playing in the same lane as somewhere, Sagan,\r\n\r\n\r\nBryant Suellentrop (03:53.656)\r\nPerfect, perfect. Exactly.\r\n\r\n\r\nNikolas Hulewsky (04:11.854)\r\nParker Cox has Pivago, but these companies on Twitter that are primarily catering to business owners and you're helping them hire outsourced talent. Fair assessment?\r\n\r\n\r\nBryant Suellentrop (04:23.522)\r\nThat's exactly right.\r\n\r\n\r\nNikolas Hulewsky (04:24.886)\r\nOkay. The cool thing is that almost all of those people started on Twitter with a network with something different. And then they went into the space where they were like helping people find overseas talent. And typically it was because they were trying to grow their own business. And so they built their own talent team. And then all of a sudden they're like, Hey, I could do this for somebody else. And so they start offering it to other people. How did you get into this?\r\n\r\n\r\nBryant Suellentrop (04:48.376)\r\nSimilar story, I was running a janitorial services business in Eastern North Carolina, grew that thing to 20 or so employees, much like healthcare. It's incredibly difficult because the margins are so small. Like you think you want the giant recurring contract and it's 5 % margins. It's terrible, right? It's like, oh, I landed this $100,000 contract. I'm gonna make five grand and I'm gonna pull my hair out every single day because\r\n\r\n\r\nNikolas Hulewsky (05:02.702)\r\nMm-hmm.\r\n\r\n\r\nBryant Suellentrop (05:17.74)\r\nyou know, Joe left the building with the alarm on and now the police are showing up at XYZ preschool and absolutely difficult business to run. Okay. It's I don't envy people. And when people post about it on the online, like it's easy. There's reason I'm not in it anymore. Right. I've discussed this at length and other places, but I was in that situation where I was, I had all these cleaners, right. But I was doing all the admin myself. I was doing everything myself. And what I really needed help with was recruiting because churn is so high.\r\n\r\n\r\nand we get all these applications. so a friend said, hey, you need to hire somebody offshore. Hire somebody in the Philippines. I said, bro, I don't even know where the Philippines is on a map. I'm like whipping out the Google Maps. And hired this girl. Her name was Hazel. She was great, worked with me for probably four years. carried her into Elevate and Delegate. But it was life changing because I was like, hey, I can actually afford with my tiny margins to\r\n\r\n\r\nNikolas Hulewsky (06:11.54)\r\nMm.\r\n\r\n\r\nBryant Suellentrop (06:15.916)\r\nto hire somebody for some help. And so that's how I got into it. And then if you remember some of the other cleaning guys, Johnny and Liam Kircher, he's not on Twitter anymore, but those guys were big on Twitter at the time and I was kind of showing them like, hey, you guys need to do this. And it changed their businesses a lot. And then so on and so forth goes on to about 1200 hires deep now, four years later.\r\n\r\n\r\nNikolas Hulewsky (06:42.584)\r\nDo you still have the cleaning company?\r\n\r\n\r\nBryant Suellentrop (06:44.641)\r\nNo, I closed it.\r\n\r\n\r\nNikolas Hulewsky (06:46.605)\r\nYou closed it, you didn't sell it, you just closed it.\r\n\r\n\r\nBryant Suellentrop (06:50.883)\r\nSo I've gone back and forth with it. Like what should I have done? Because of course you do like the after action report here. I'm glad I just closed it because it needed to just cease function because it was causing too many headaches. And I knew that to get it to a place where it would be saleable for something that I want, know, something valuable or worth taking my eye off the ball, like to get it to $100,000 sale price or 200 or\r\n\r\n\r\nNikolas Hulewsky (07:12.27)\r\nMm-hmm.\r\n\r\n\r\nBryant Suellentrop (07:18.776)\r\n300 I would have had to do so much more and it was just I Was making so much money with elevating delegate. There's like I'm not gonna do this I just it was it was a huge time suck. So\r\n\r\n\r\nNikolas Hulewsky (07:27.726)\r\nto the opportunity cost.\r\n\r\n\r\nNikolas Hulewsky (07:32.019)\r\nSo how big did the cleaning company get?\r\n\r\n\r\nBryant Suellentrop (07:35.0)\r\nA few hundred thousand dollars in revenue a year. It was a bunch of employees, but you know how that it's part-time employees and it's crazy.\r\n\r\n\r\nNikolas Hulewsky (07:44.45)\r\nreally difficult, really difficult to know. Yeah, it's really fricking difficult to manage. get it. No, I have a love-hate relationship with cleaning bros. It's mainly a love relationship, in that I love to make fun of it, but I also just respect it so much. the reason I love to make fun of it is because there are guys like you who, as soon as they get to a certain level, it's like,\r\n\r\n\r\nBryant Suellentrop (07:56.301)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (08:14.83)\r\nAll right, now making 20, $30,000 a month. I'll launch a course showing you how to make 20 or $30,000 a month, or you pivot into something else. So I just think that that's funny. But the thing that I respect about it is like, for many of you, that's what got you into entrepreneurship. Like you cut your teeth on one of the hardest businesses. I freaking hate cleaning companies because the switching costs are so low. The customers are so high maintenance. The employees, the staff are so difficult to manage. The margins are razor thin.\r\n\r\n\r\nBryant Suellentrop (08:21.229)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (08:43.598)\r\nLike it's a very operationally complex business. It's a difficult market to operate and it's highly competitive. Like you might have had a customer for five years. You come home and they got to take off.\r\n\r\n\r\nBryant Suellentrop (08:54.388)\r\nNo, I'm just going to tell you, just think about the business. If you do your job perfectly, you leave that place spotless. like that place looks amazing. What is, what is the customer experience? What is the before and after? It's, it's nothing. Like if you crush it, they're not going to notice you were there. Think about how hard of a business that is to run. You only get complaints. Absolutely.\r\n\r\n\r\nNikolas Hulewsky (09:16.46)\r\nYeah, and if you leave one piece of hair, if you leave one piece of hair, it's like I'm out. I'm going to somebody else because it like the switching costs are low that yes, you're perfectly articulating it like people have asked me before. Like would you get into cleaning business like no, I would not because anybody can start one right. The various to entry are exceptionally low. The startup costs are exceptionally low. The switching costs are exceptionally low. The people are hard to manage. The margins are razor thin, blah, blah. But for all those reasons, it's also an amazing business to start with, right? Because you.\r\n\r\n\r\nBryant Suellentrop (09:44.088)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (09:45.152)\r\nYou didn't need a ton of startup capital. You could very easily go and get your first customers. You could spend a little bit of money advertising through Facebook ads, Google ads, flyers, knocking doors, whatever, and get your first paying customers in. it's like, cool, now I have a business. Now I've actually replaced my income. Anyways, so I do legitimately have a ton of respect for the guys who launched cleaning businesses. I just then think it's funny because it's a tell. It's like, you know how crappy a business is with how many of them launch courses showing you how to start that business.\r\n\r\n\r\nKuh-huh-huh.\r\n\r\n\r\nBryant Suellentrop (10:16.491)\r\n1000 % and if you sell a thousand courses and you can get three guys to give you a good testimonial, you can launch a course. You have all of the credibility you need to keep that course going, essentially. And you come to find out that most of those people are struggling. And then you go start the course business. Well, then someone rips your course and they launch it under a different name. And now all of a sudden we've got a hundred remote cleaning course bros and...\r\n\r\n\r\nNikolas Hulewsky (10:25.57)\r\nYeah, yeah.\r\n\r\n\r\nBryant Suellentrop (10:45.208)\r\nYou know, that's why people hated it.\r\n\r\n\r\nNikolas Hulewsky (10:46.262)\r\nNo, I respect the game. Look, I've run businesses, nothing ever huge, but I've gotten to the point now where I'm like, info products, throwing a course, teaching people, coaching, like, dude, that's so much easier.\r\n\r\n\r\nBryant Suellentrop (11:02.136)\r\nNick, you have nothing to sell us. Trust me, I have nothing to sell you. Just a $100,000 course. Just a $60,000 mastermind.\r\n\r\n\r\nNikolas Hulewsky (11:07.693)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (11:13.622)\r\nLook, what's your time worth? Do you want to invest in your family or not? Anyways. Okay. So when did you shut down the cleaning company?\r\n\r\n\r\nBryant Suellentrop (11:15.416)\r\nWhat is your time worth?\r\n\r\n\r\nBryant Suellentrop (11:24.895)\r\nWell, I kind of had a couple clients that dragged on for a little while, but I effectively, when I moved from Eastern North Carolina to Charlotte, I just stopped putting effort into it, because that was at the same time the Elevate Delegate was taking off. So that would have been in 2022, I believe.\r\n\r\n\r\nNikolas Hulewsky (11:42.774)\r\nHmm. Okay. So Elevate and Delegate was taking off and you kind of just got to the point where you're like, it's not worth the operational headache. I'm going to shut down the cleaning company. How big was Elevate and Delegate at that time?\r\n\r\n\r\nBryant Suellentrop (11:50.732)\r\nThat's right.\r\n\r\n\r\nBryant Suellentrop (11:54.956)\r\nWe were probably doing like 40K a month or something like that, or 35K a month. Yeah.\r\n\r\n\r\nNikolas Hulewsky (11:58.986)\r\nokay, so really good size.\r\n\r\n\r\nBryant Suellentrop (12:02.56)\r\nYeah, well, and was actually making money. Like, actually money was in the account at the end of the month. So that was super cool.\r\n\r\n\r\nNikolas Hulewsky (12:07.65)\r\nYeah. It was what they call a cash flowing business. No, man. I think the opportunity cost thing is a very difficult thing for myself included, for many people to like wrap their minds around where you're like, no, I've put all this time and energy and effort into building up this company. I can't just shut it down. And so people like you who are actually able to pull the trigger like that and say, and divorce yourself from the emotion of like, yeah, it'd be nice to sell it, but.\r\n\r\n\r\nIt's not worth the time to get it to a place where I can sell is a, that's a difficult place to get to. Was it easy for you or was it like you had to kind of work your way there?\r\n\r\n\r\nBryant Suellentrop (12:48.076)\r\nI mean, it was easy because the money was green. But since getting involved in Elevate and Delegate and growing this business, I would say it's been harder because I had success with this business and thinking, well, maybe we should pivot. Maybe there's another avenue that we, you know, from a marketing angle, what should we be doing differently? Like, it's been harder in this business because I had success. It was easy to get away from something that wasn't making a lot of money. But once I've gotten into this and realizing in hindsight, it's like,\r\n\r\n\r\nWell, I thought organic Twitter, I know this is crazy, but I thought organic Twitter would be there forever. I thought, can do stuff on LinkedIn. I'll be able to get clients. It'll be no problem. I never built an email list, I never instituted good follow-ups. I never got customer reviews until a year ago. There's just so many things where the way we should have done business, even within the same business, should have changed dramatically, and I didn't realize until...\r\n\r\n\r\nToo late, or not too late, but you you got what saying.\r\n\r\n\r\nNikolas Hulewsky (13:49.39)\r\nSo when you launched Elevate and Delegate, your customer acquisition was coming through organic, Twitter.\r\n\r\n\r\nBryant Suellentrop (13:57.272)\r\n100 % Nick, 100%.\r\n\r\n\r\nNikolas Hulewsky (14:00.17)\r\nAnd like, did you just thought, hey, this is always going to be the way that it happens.\r\n\r\n\r\nBryant Suellentrop (14:06.336)\r\nI should have like grabbed a screenshot from 2020, whenever that was, when I launched the company, right? And showed you my Google calendar. I'm talking about, I would have 40 meetings in a week, totally organic. I couldn't find enough time in my day to take all these freaking calls,\r\n\r\n\r\nNikolas Hulewsky (14:25.206)\r\nmy gosh.\r\n\r\n\r\nBryant Suellentrop (14:31.498)\r\nI had no idea what I was sitting on. Nick Huber did, and therein lies the difference. He already had the operational chops from his storage business and everything else. I mean, know he got involved in Somewhere later, but if you look at his courses and stuff that he launched and sold and all of his consulting, he knew how to action that so much faster.\r\n\r\n\r\nNikolas Hulewsky (14:47.854)\r\nMm.\r\n\r\n\r\nBryant Suellentrop (14:59.286)\r\nbecause he'd done his moving and storage business. And I just didn't, I didn't have that like kind of frame of reference, if that makes sense. I didn't realize how amazing it was to get all these free meetings.\r\n\r\n\r\nNikolas Hulewsky (15:06.894)\r\nKiss off.\r\n\r\n\r\nNikolas Hulewsky (15:11.47)\r\nSo your customer acquisition cost was effectively zero for a long time. When did that change?\r\n\r\n\r\nBryant Suellentrop (15:14.69)\r\nZero, zero.\r\n\r\n\r\nBryant Suellentrop (15:20.888)\r\nProbably about a year in. mean, it wasn't as good as it... mean, the first... Anybody can tell you this. You grow a following to 25,000 followers. The first time you ask them for something, you're just going to get flooded, right? So that initial flood that you get, that's not going to be there the next month probably. But it was consistent. It was relatively consistent. And people knew me as a go-to person for that for probably a year.\r\n\r\n\r\nwith before there was numerous competitors. It was like Support Shepherd, now Somewhere, it was me, and then it was like Growth Assistant, and that was basically it on Twitter.\r\n\r\n\r\nNikolas Hulewsky (16:04.514)\r\nHmm, when did you start doing paid acquisition?\r\n\r\n\r\nBryant Suellentrop (16:08.236)\r\nPaid acquisition, probably about two years. I mean, from the beginning, I wanted to try different things, right? I knew that it wasn't like perfect. So I tried things, but I burned a lot of money. I mean, I worked with a TikTok agency, $10,000 burned. I worked with a Google ads agency that is very good, but around my offer, it didn't work because I was competing for a Google ad space against companies that were in that recurring revenue model. You know, I was trying to compete for\r\n\r\n\r\nkeywords that would have generated those people, $50,000 lifetime value for me, it's $2,500. So I could never pay enough for my Google Ads. And so I didn't figure anything out on the paid side until probably about 18 months ago we started to get more business.\r\n\r\n\r\nNikolas Hulewsky (16:57.582)\r\nBut the organic launch, you had distribution with some followers, the organic launch got you to a place where, okay, cool, I've got customers, I've got revenue, I've got profit and cash that I can reinvest. I do the same thing, but I also try to tell myself that it was a learning experience. But yeah, you burn cash. You're like, okay, learn from this, learn from this, learn from this. It's kind of just the tuition that you pay to get to where you need to be in order to actually build out.\r\n\r\n\r\nBryant Suellentrop (17:01.687)\r\nYes.\r\n\r\n\r\nBryant Suellentrop (17:07.98)\r\nThat's right.\r\n\r\n\r\nNikolas Hulewsky (17:25.518)\r\nthese different channels where you're acquiring customers. mean, I talk to Chris all the time. You know how much money that guy has quote unquote wasted, right? Like my wife, if she was looking at it, she'd be like, are you freaking kidding? How much money did he waste on this stuff? Cause that's my wife's mindset. And frankly, it's a little bit more my mindset, but Chris and like where I've come around to is like, nah, it's the tuition. It's the tuition that I needed to pay in order to learn how to actually acquire these customers and leverage these distribution channels. It's not free.\r\n\r\n\r\nBryant Suellentrop (17:32.512)\r\nYeah.\r\n\r\n\r\nBryant Suellentrop (17:51.672)\r\nThat's right.\r\n\r\n\r\nBryant Suellentrop (17:56.842)\r\nNope, but given the different opportunity sets out there, right? There's all kinds of different ways to get into business. If you're gonna mess up a whole bunch, I recommend doing it without a personal guarantee. That is just my side of the story. A lot of people have had varying and different experiences where they've crushed it, but I am so glad that none of that, you know, get a loan thing was out there yet when I was first starting to get into business.\r\n\r\n\r\nNikolas Hulewsky (18:11.63)\r\nHahaha\r\n\r\n\r\nBryant Suellentrop (18:25.24)\r\nbecause I would have absolutely been calling you from the debtor's prison.\r\n\r\n\r\nNikolas Hulewsky (18:30.946)\r\nI think people have kind of perverted that in a way. Like, I'm a massive believer in buying a business. I think that it's better for me than starting a business from scratch. But if you don't have experience, if you don't have a skill set, if you don't understand the risk that you're taking, it can be a massive gamble. Like right now, if you were to be presented an opportunity to buy a business in your space, you are way more equipped. And you may not want to buy a business, that's fine, but you are way more equipped.\r\n\r\n\r\nto understand the risks associated and the upside associated with that particular business. So you're in a much better position to actually buy that business. But first time buyers, it's like they've never run anything in their life. They have no operational experience. They're just going to go and sign a personal guarantee and purchase a business. No, my advice always is go learn on somebody else's dime first. Go make, I did go make multi-million dollar mistakes on somebody else's dime first. And then you can take those experiences after you get fired and go and buy your business because otherwise\r\n\r\n\r\nIt's a huge gamble and you're gambling with your personal guarantee and your family's future. And I'm not even saying it won't be successful. It's just the downside risk is so much higher for those types of risks than if you actually have experience.\r\n\r\n\r\nBryant Suellentrop (19:43.348)\r\nAnd we don't have to beat it to death, but the thing is know yourself. Know yourself, know where you're coming from. And if you have a unique set of skills, absolutely. Get into a business that benefits that unique set of skills. But if you are going to go buy something, go talk to 50 people that are not in your market that are in that business already, especially if it's a local business. You're going go buy a janitorial business. Go talk to 50 people in a different state that are in that business and understand as much as you can.\r\n\r\n\r\nYou know, because you're going to be kicking yourself if you don't do that.\r\n\r\n\r\nNikolas Hulewsky (20:15.086)\r\nDude, so I have a quick story. I have some friends who went and started a company and their strategy was to grow through acquisition and then grow organically. And there was a group of them, let's say that there was five. I'm changing some numbers and names and dates so that it's a little less obvious. Let's say there was five of them and the agreement that they had in between the five of them was each of us will buy a business, we'll take out a personal guarantee through the SBA and then we'll merge those things. Cause back then,\r\n\r\n\r\nThe SBA limit was five million. still five million, but you had to do, you had to purge, you know, buy out the whole business. In fact, it just changed recently. I don't know if you saw this, but the SBA said, Oh no, the seller can actually not sell everything. And now they're like, yeah, they don't have to sell everything, but now they have to personally guarantee it. Anyways, it's, it's a mess. Nobody's going to do that. No, no, nobody's going to that. Anyways. So they did that. They bought all these businesses and they had never owned businesses before.\r\n\r\n\r\nBryant Suellentrop (21:02.552)\r\nWhich, which, which, who's gonna do that, right? So.\r\n\r\n\r\nNikolas Hulewsky (21:14.324)\r\nAnd while things were good, things were good. But then once things started to go bad, it was like a contagion effect. And the way that they had structured all these things was really, really messy. And they had taken on some risk in the businesses that they purchased. And it was a domino effect. Boom. One after the other, after the other, after the other, after the other. And they came this close to bankruptcy, this close to bankruptcy. And do you know what saved them? COVID. Because of PPP loans.\r\n\r\n\r\nLike all of a sudden they just, they got all this free cash and then that cash bought them time to fix the things that they needed to fix. And now, you know, they're, they're in a much better place, but that could have easily gone the wrong way for them. It didn't, thankfully it didn't go the wrong way for them, but they won't ever make those mistakes again. Now they, they pay the tuition on their own dime and I'm sure that they would look at that situation and say like, yep, I'll do that again. I, I would be, I'm unwilling to do that.\r\n\r\n\r\nBryant Suellentrop (21:44.472)\r\nHuge cash in.\r\n\r\n\r\nNikolas Hulewsky (22:10.542)\r\neven though it worked out, I just don't want that level of stress and risk. And I know my wife wouldn't deal with it well, I wouldn't deal with it well. And so to your point, it's like, know yourself. If you are the gambler, is like, put it all in black? Okay, cool, like go roll the dice. But for most of us, that's not a good thing.\r\n\r\n\r\nBryant Suellentrop (22:28.47)\r\nYeah, think you nailed it. Because I've met people before that are like, they're going to go be ambitious in some kind of way. Like, they're going to kill themselves over something. And it's like, well, OK, might as well go make some money while you do it. Go for it.\r\n\r\n\r\nNikolas Hulewsky (22:36.045)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (22:44.782)\r\nWell, and that's what's interesting about what you did, right? Like you just picked a really hard game at first with cleaning companies. And then really quickly, you're like, game's too hard. I'm to go into elevate and delegate where I have 50 % margins. That's the smart way to do it. Chris, we've always had this conversation. What he's, I might edit this out. We'll see. What he's doing now is by far the most success he's ever had.\r\n\r\n\r\nAnd I mean that in terms of like income per month, lifestyle, all that stuff. And it's, the majority is content, but it's because Chris picked freaking hard businesses before he picked these like operationally intensive, low margin businesses. And so he cut his teeth. got like all these chops on how to actually get customers, but the businesses he was picking freaking sucked. They suck. then now all of sudden he's turned that into, okay, well,\r\n\r\n\r\nIt's not acquiring customers. I'm acquiring subscribers now. interesting. And within a year, he's grown to like 3 million subscribers across platforms. He's getting over like 200 million views a month. He's probably, I don't know the exact number, probably making $100,000 a month just from people who are like, hey, can I sponsor your podcast? You know what I mean? And so he's picked now a better game for himself. And I don't fault him for that because he's taken all the skillset that he's accumulated over the years. And now he's like,\r\n\r\n\r\nthis is the game I'm picking and he's freaking crushing it. He's crushing it. It's all about picking the right game for yourself. And if you get into the game too early and personally guarantee it, all of a sudden you've balked yourself in and now you've got to commit to this operationally intensive business that you hate because your house is on the line.\r\n\r\n\r\nBryant Suellentrop (24:29.72)\r\nYep, I got a guy that I know that's in that situation right now where he is just, realized, cause you're gonna create a prison of your own making, right? Like it's, you bought yourself a ticket to sit in a prison that you've got to fight your way out of and you cannot just throw the keys across the table and give it to them. That's not how it works. Cause the keys you throw are gonna literally be your house keys. It's gonna be the situation. So anyway, yeah, I think that's great to know your skillset, know your risk tolerance.\r\n\r\n\r\nhow like, no, if you're married, right, that's different than if you're not married, if you have family, all that kind of stuff. It's such a catch-22 though, because then I look at myself before I was married, before I had kids, and I'm like, well, maybe I should have personally guaranteed something back then, you know? But hey, that's why we do this and play the right game.\r\n\r\n\r\nNikolas Hulewsky (25:17.742)\r\nNo, it's, know, yeah, hindsight's, hindsight's always 2020 for sure. It's always 2020. Okay. Here's what I want to, here's what I want to ask you now though. So you're doing elevate and delegate. One of the things that's really interesting is sort of the evolution of these offshore companies over the last few years. The first iteration has been people like John Mastner launching Sagan where they're going away from this placement fee and they're going more towards this subscription model. You know, everybody loves SaaS.\r\n\r\n\r\nBryant Suellentrop (25:28.12)\r\nMm-hmm.\r\n\r\n\r\nBryant Suellentrop (25:33.186)\r\nDefinitely.\r\n\r\n\r\nNikolas Hulewsky (25:46.67)\r\nOh, I got recurring revenue, my MRR, my ARR. And so that's been an interesting shift. That's my first question. But then my second question is going to be AI. And I feel like many of the tasks that we're offshoring to people are either able to be done now or going to be done by AI in the future. So I'm curious to kind of get your thoughts on AI. But let's go to the business model first. Has that changed for you? You're still charging $2,500 a month. Are you thinking of changing it? that?\r\n\r\n\r\nimpacted your business? they two different businesses? How do you think about them?\r\n\r\n\r\nBryant Suellentrop (26:18.872)\r\nYeah, so to be clear, the way that we operate is somebody comes to us with a need. Let's say they want to hire a customer service rep. Let's say we say to them, all right, it's going to be $800 a month to find a customer service rep for you in the Philippines. They'll work 8 to 5 Eastern Standard Time. They're fluent in English. They work hard. And they got the skills that you need. We will get you that person within a week. And we charge $2,500 to do that. We really charge $3,000 for the first one and $2,500 for any after the first one.\r\n\r\n\r\nWe just charge a fee once and then you work with them directly, right? So we don't get, we don't continue to get paid. And that means they get a CSR at 800 bucks a month. The problem with that is we made, sorry, customer service rep. Yeah. So the problem with that model is AI is going to give us all these productivity gains, right? And so one customer service rep, I used to have somebody come to me and they would say, Hey, I need,\r\n\r\n\r\nNikolas Hulewsky (26:58.094)\r\nDefine CSR really quick,\r\n\r\n\r\nBryant Suellentrop (27:16.755)\r\nfive people to do data entry.\r\n\r\n\r\nNo one needs five people to do data entry now. That person who was formerly a $13,000 or $12,000 customer for me is now like, maybe they need one, maybe they need two, right? And so all of a sudden, my value per customer is dramatically lower. And so I see the benefit of a membership model. That makes a lot of sense to me. Like, I like what John's doing. I talk to John. I mean, you've met John. I've met John.\r\n\r\n\r\nNikolas Hulewsky (27:39.032)\r\nHmm\r\n\r\n\r\nBryant Suellentrop (27:49.784)\r\nI've met Nick. I think the way it's going to go is the higher level roles are they're going to continue to operate on a similar model to what we're doing or people are going to charge more. Most of the firms that are top, top technical talent are charging 30%, 35 % of first year salary. Sometimes they're going for fees of eight to $10,000 to $12,000 for one hire still.\r\n\r\n\r\neven though it's offshore. So we've never done that. We've really been in the data entry, admin, customer service, all these, you know, basic sales, basic ops. But you just don't need as many people. And so like if somebody, if the membership model makes a lot of sense, John's doing what he's doing and he's offering a bunch of other things too. Super cool. The bigger opportunity I think, yeah, the bigger opportunity I think for so many people now is\r\n\r\n\r\nNikolas Hulewsky (28:42.328)\r\nBut it's different.\r\n\r\n\r\nBryant Suellentrop (28:49.236)\r\nSell the outcome. Chris was just on your podcast talking about how people need to be using AI to go after outcomes. He was like, if you're going to do AI, do it towards an outcome. How do you close more deals? How do you get more customers? If you can sell people money, you can sell a lot of that. If you can sell them revenue, there's such an opportunity if you say, can bring you more sales.\r\n\r\n\r\nAnd using offshore talent coupled with AI, there's so many opportunities in that space and that's what I think people should be pursuing.\r\n\r\n\r\nNikolas Hulewsky (29:20.406)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (29:26.958)\r\nOkay, so you kind of answered my second question, so I'm gonna do another follow-up question. If you were Brian Sule and Chop four years ago today, before you started this company, would you start an overseas talent company or, okay, what would you do?\r\n\r\n\r\nBryant Suellentrop (29:44.664)\r\nI would pick a niche and in the same way that...\r\n\r\n\r\nSo you had all these website companies that did like websites for dentists, websites for plumbers, websites for, and then now you've, and then you had, we're offshoring for dentists. We're customer service offshoring for SaaS or whatever. What I would do is I would do, you know, we are sales for dentists or we are, sales for dentists sounds stupid, but what I would do is AI and offshore.\r\n\r\n\r\nNikolas Hulewsky (30:18.862)\r\nThis sounds stupid.\r\n\r\n\r\nBryant Suellentrop (30:20.106)\r\nI would sell them the outcome, right? I would sell them on, hey, we're gonna come into your business, we're gonna do an audit, we're gonna do, we are gonna do all of that, no cost, right? And then you're gonna pay us some kind of implementation fee to implement the AI systems, and then where your membership, right, you pay some kind of recurring fee to get that support, and it'll be outcome driven. And yeah, you're gonna use some offshore talent here and there. You're gonna use offshore talent to build it, you're gonna use offshore talent to...\r\n\r\n\r\naugment the operational processes that need to take place where AI can't yet take something from, where there's not an API, right? Or where there's not an opportunity to automate or use AI. You're going to have offshore people plugged in there. But if you can tell a dentist office that, hey, you actually need one office person now instead of two, you're saving him $70,000 a year, right? You can charge\r\n\r\n\r\nNikolas Hulewsky (30:58.733)\r\nYeah.\r\n\r\n\r\nBryant Suellentrop (31:19.114)\r\nyou can charge really good money for that. You're actually probably saving him a whole lot more, but you get what I'm saying.\r\n\r\n\r\nNikolas Hulewsky (31:24.046)\r\nSo are you, are you, are you saying to like pick a vertical and then pick a off offering within that vertical? So it's like, not only do I pick dentistry, but think sales within dentistry, or are you just saying pick a vertical, get in there, be the AI solution for them and then find where they have opportunities.\r\n\r\n\r\nBryant Suellentrop (31:29.847)\r\nYes.\r\n\r\n\r\nBryant Suellentrop (31:43.584)\r\nIt's being screamed at everyone right now that they need to be using AI in their business and no one knows how to do it.\r\n\r\n\r\nNikolas Hulewsky (31:49.826)\r\nYeah, it's true.\r\n\r\n\r\nBryant Suellentrop (31:52.14)\r\nI would just walk in, understand the problems, I would take a niche, I would build a website with AI in 20 minutes, saying we do AI and automation for dentists or for laundromats, whatever it is. And I would go, I would do a cold email campaign to 10,000 people in that space. I bet because we're still early in the AI space, you need to do more than 10,000. You need to do like 50,000, but you get what I'm saying.\r\n\r\n\r\nBecause we're still so early in AI, a lot of people I think would take your calls. Offshore, there's so many people. I get 20 emails a day now with people offering me offshore help. Easy. Yeah, cold emails. And so most people are just so familiar with it and so not in it and that you're not unique, you know? Whereas when I came into the offshore space, I was kind of a special flower. People didn't know about it.\r\n\r\n\r\nNikolas Hulewsky (32:34.038)\r\njeez.\r\n\r\n\r\nNikolas Hulewsky (32:45.858)\r\nWhat?\r\n\r\n\r\nNikolas Hulewsky (32:50.178)\r\nI've been talking recently to people and one of the things that I've seen in these companies who know that AI is important, but they don't understand how to use it is they will give it to their IT department. So it's like their IT department is now running their AI initiatives. And what I've been telling them is that's totally the wrong thing. IT and AI are very different. Like, yes, okay, they're tech focused, but...\r\n\r\n\r\nWhat you need is AI and operations. Like it needs to be someone in operations who can go and say, okay, this is the process flow. These are the things that we can automate. I T traditionally in these companies is going to be troubleshooting. Hey, my device isn't working. Hey, how much storage do we need? Do we need to get go with Microsoft or, or the Google suite? what does our backend look like? Like it infrastructure, those types of things. But when it comes to actually implementing AI, it's not your IT team.\r\n\r\n\r\nIt's the it's an operator. So it's like instead of picking IT, you need to pick an operator in your business to be the champion and then let them go and run with it. And you need IT to help facilitate that and support them. But it to your point, it's like pick something that you know. That's what I would like to tell the people. If you're looking to get into entrepreneurship and you know something, it's like, oh, I've been working in the car wash space. Even if even if you're in the corporate office, I've been working in the car wash space for 10 years. Cool. Go start cold calling on car washes.\r\n\r\n\r\nLike you're going to understand the process flow better than most anybody and where they have opportunities to actually automate things.\r\n\r\n\r\nBryant Suellentrop (34:22.742)\r\nThat's exactly right. That's what I'm trying to hit at. That's exactly what I would do because I think there's so many... You go and you hit, like go to manufacturing companies that do a lot of relationship driven sales. Maybe they're companies between five and 50 million. Those guys, a lot of those guys are still doing deals like handshakes and emails and dinners and all those kinds of stuff. It's like, okay, but...\r\n\r\n\r\nNikolas Hulewsky (34:25.742)\r\nIt's perfect.\r\n\r\n\r\nNikolas Hulewsky (34:49.101)\r\nYeah.\r\n\r\n\r\nBryant Suellentrop (34:50.592)\r\nIf I can help your sales guys, you're gonna have the sales guys buy in. If you tell them that like, we're gonna be able to help you make 50 % more commission this year, you're gonna have everybody's buy in, right? And you get in there, you help set up the systems, you get them what they need.\r\n\r\n\r\nNikolas Hulewsky (35:03.926)\r\nIt's once you show, it's once you show them. I have this thing, I don't talk about it a ton, but Chris and I have this AI healthcare startup. We launched it two years ago. It's been two years in the making. It's called Glide and we help long-term care facilities optimize their revenue. That's not true actually. I hate saying it like that because that sounds like we're just billing fraudulently. It does a couple of things. It optimizes their revenue, makes them more compliant, reduces their administrative burden and allows for more time at the bedside with patients.\r\n\r\n\r\nIt's a phenomenal product. I'm like stoked about it. And we just talked to this one skilled facility company that has a hundred facilities. And it's really hard to sell into these types of organizations because it's just a slow sales process and they're hesitant. And then we audited four of their buildings and showed them, Hey, look, this is the difference. And if you implement it across your organization, this is a difference of like, what was it? It's like 20,000 man hours and $10 million a year in revenue and something ridiculous.\r\n\r\n\r\nAnd then the light bulb went off and they're like, why don't we have this in all of our facilities yet? You know, so once you show them all of a sudden they understand, but it's being able to get to the place where you can show them and then to show them, need credibility. You need to get in the door. You need to get in the room. Like there's a whole host of things. So yeah, to your point, it's like pick something that you know that you can actually get in on and then show them what the opportunity is.\r\n\r\n\r\nBryant Suellentrop (36:24.696)\r\nAnd I think there used to be so much cost associated with the labor behind doing that audit, right? Everyone always said, audit your time. It's like, that's kind of like a hard thing to do. Now we've got the technology to audit people's time, right? You get access to someone's email inbox or you capture what they're doing on their screen or you just follow them around for a day. or they, they, they say into their little device, you know, your little pendant or whatever, what am I doing right now? Or they hear everything that they're doing.\r\n\r\n\r\nNikolas Hulewsky (36:26.093)\r\nCough cough\r\n\r\n\r\nNikolas Hulewsky (36:54.54)\r\nYeah, this thing.\r\n\r\n\r\nBryant Suellentrop (36:54.73)\r\nIt's a no brainer. that all that costs nothing. I mean, essentially nothing. And so you can feed that all into AI and actually get good. And it's not, they still need you. They like desperately need you. They are not going to do this themselves. Especially if they hand it to their IT department. my gosh.\r\n\r\n\r\nNikolas Hulewsky (37:11.95)\r\nThey don't have the time to do it.\r\n\r\n\r\nNo, they don't have the time to do it. Like I was talking to my wife about this. I went and spoke at Holdco conference and last minute they asked Chris and I to speak about AI. And we hadn't prepared anything, but like the night before we were like, okay, what are some talking points? And we kind of just threw it together. And then we gave this presentation and it was mind blowing to people. And I had a couple of people come out after me and they were like, hey, could you help us actually implement this? And my wife was like, well, why would they come talk to you?\r\n\r\n\r\nnot, actually wasn't in a negative way. was just a curiosity. Like, why would they come talk to you? And I'm like, because I'm the only one who has time to like, Dick around on YouTube and not have a real job, right? Cause like they're running a real company right now. I'm not, I can go and learn about lovable and cursor and Gemini. I like it. All of these other tools, they don't have it. So if you can just spend the time, even if you're working at nine to five, like two hours a night, understanding how this stuff works.\r\n\r\n\r\nBryant Suellentrop (37:53.368)\r\nYeah, that's right. Yeah.\r\n\r\n\r\nNikolas Hulewsky (38:11.212)\r\nYou're leaps and bounds ahead of most people. Most people have heard about AI at this point. They have no idea how to utilize it.\r\n\r\n\r\nBryant Suellentrop (38:18.71)\r\nRight. Which is why I think the biggest opportunities right now are building some kind of productized offering or maybe it's audit driven and consultative, but that is outcome based where you use the AI, you use the offshore people, but you don't sell the people. That's just not the direction things are moving. Things need to move towards outcome. And then to your point, it's like, well, if we can drive $50,000 or a million dollars worth of revenue, what does that work?\r\n\r\n\r\nThat's just such an easier conversation to have than, hey, if I hire you three more customer service reps, how much money does that save you? Or it's just so not fun.\r\n\r\n\r\nNikolas Hulewsky (38:58.062)\r\nBut, Brian, is, it was amazing, man. I'm glad we did this. It was too long in the making. Tell people where they can come find you.\r\n\r\n\r\nBryant Suellentrop (39:06.55)\r\nYeah, I'm on Twitter probably too much and I've also been hanging out on LinkedIn more and I would recommend people do that because there's starting to be some more cool people on LinkedIn.\r\n\r\n\r\nNikolas Hulewsky (39:16.686)\r\nOkay, we'll do that thing. It's good to see you. soon. All right, stay on. Let me just hit the stop here.\r\n\r\n\r\nBryant Suellentrop (39:18.392)\r\nAll right, yeah, thanks, Nick.",
  "metadata": {
    "duration": "",
    "date": "2025-05-16",
    "platform_source": "Google Drive"
  }
}