{
  "episode_number": "77",
  "episode_title": "How a Former Marine Built an $8M Landscaping Biz with Nolan Gore",
  "guest_name": "Nolan Gore",
  "business_name": "Residential Lawn & Landscaping",
  "transcript": "﻿Nik (00:00.858)\r\nAll right, Nolan Gore, super stoked to have you on economics, my friend. Let's just jump right into things. Tell me, what is your business and how do you make\r\n\r\n\r\nNolan Gore (00:11.95)\r\nI run a residential lawn and landscaping business. We mow about 1700 lawns weekly or every other week. And then we do a bunch of additional work for those people. So landscaping jobs like planting, planting plants and sod and mulch and doing some fertilization. Actually, we sell our fertilization, but irrigation. But generally we cut tall grass to short grass and then we sell additional things to those\r\n\r\n\r\nNik (00:42.418)\r\n1700 people once every couple times a\r\n\r\n\r\nNolan Gore (00:48.878)\r\nYep. it is, we actually just today, it was unfortunate, we just today had someone, they're moving, but they've been a client with us for 11 years. And that was really cool to see. Yeah. So of course not everyone ends up being that\r\n\r\n\r\nNik (00:49.904)\r\nas insanity.\r\n\r\n\r\nNik (00:58.374)\r\nWow. Wow. How big.\r\n\r\n\r\nSo 17 ,000, 100 customers, give me an idea of scale. Like how many crews is that? How much revenue per year? What does your business look\r\n\r\n\r\nNolan Gore (01:12.782)\r\nYes. So revenue this year will be around seven and a half million. Um, we have about 80 employees. It's somewhat seasonal and so it kind of flexes up and down. Um, five of those are overseas. Um, and I fully count that as employees, obviously. Um, and then\r\n\r\n\r\nFrom a crew perspective, what that actually looks like every day is somewhere between 18 and 21 crews and then three irrigation vans. And a crew is usually three guys, but sometimes\r\n\r\n\r\nNik (01:48.946)\r\nAll right, so you are living the dream, some would say the SMB wet dream of buying that first business and just growing it and scaling it. Sorry, mom, if you're Tell me about your background. Like, how did you get into this in the first place?\r\n\r\n\r\nNolan Gore (02:06.328)\r\nWell, I assume your joke was in reference to the irrigation department. And so no harm, no foul. I will start by saying many years ago, many years ago, several years ago, I would have told you and everybody, you should get into small business. And it is really hard. And so this so -called dream is just extraordinarily\r\n\r\n\r\nNik (02:10.49)\r\nIt was actually, thank you. Yes, yep,\r\n\r\n\r\nNolan Gore (02:34.176)\r\nIt's an honor, it's humbling, and it is fun and rewarding, and it's still really hard. so there's like still, anybody that does these things will tell you that you've experienced it yourself. There's a lot of days still that you don't want to be doing it. And on every day that I have a good day, like I've slept enough and had enough caffeine and worked out, and I can look at myself and go, I know this is actually exactly what I'm supposed to be\r\n\r\n\r\nbut you have a bad sleep day and you wake up and you're like, don't know if I want to do this.\r\n\r\n\r\nNik (03:07.122)\r\nEspecially, especially in home services or businesses that have low switching costs. Like you just there are times where you just feel like you're on a treadmill because you cool. got 10 customers this week. Oh, we churned for like what just happened with those customers. So I it's a grind, man. It's a grind. But getting past that five million dollar mark in my experience could be different in your industry. That's kind of like that's the differentiator for people. And my camera just shut\r\n\r\n\r\nPause here for a second,\r\n\r\n\r\nHold please.\r\n\r\n\r\nNolan Gore (03:43.086)\r\ncode please.\r\n\r\n\r\nNik (03:54.212)\r\nYes am.\r\n\r\n\r\nNik (04:02.418)\r\nSo I just said that was the differentiator. I'm gonna mark this so can go in and edit. Is that what you found? Like kind of where is it in your business where it's gone from you, one man crew, to now like scaling?\r\n\r\n\r\nNolan Gore (04:17.87)\r\nI definitely think actually your, your 5 million marks probably not quite off. I, um, I think that what I mean by that is I've started to be less the only problem solver. Um, which is really nice. I don't really deliver plants or mulch anymore and I'm not usually jumping on a crew when someone doesn't show up. Um, and I haven't done that for about a year or two now. Um, but I do think I'm probably.\r\n\r\n\r\nor three more years out from being like really just a leader of leaders. And some of that self -imposed I actually enjoy and I think it's important for my soul to be like connected all the way down to the bottom of the organization because it reminds me of how hard these guys work and how blessed I am to be in the position I am and I don't have the like I say this mostly jokingly but I was almost a real estate bro and\r\n\r\n\r\nThat world is so disconnected from the guy that sweats and like cuts the grass or cleans the windows that there it's really easy to become discontent in that world. and think your problems are really hard and maybe they are, but like, really love seeing Rogelio and being like, that guy kicks ass. He does his job really well and often does his job better than I do my job. And so like that's important to me. So some of this like down in the weeds is self -imposed.\r\n\r\n\r\nThat's That's generally a take.\r\n\r\n\r\nNik (05:49.33)\r\nWell, you're a guy who gets down and dirty. I think your background's super interesting. Why don't you tell us a little bit about that? How did you even think about this business? Where did it come from? How did you get into\r\n\r\n\r\nNolan Gore (06:05.046)\r\nYeah. So I am the son of a small business guy. We say small business people because entrepreneur implies starting something in my head. It's not exactly, but that's kind of what I view. And I don't, I don't have any desire to start something that's really hard. I, but I ran around the office at these various companies. My dad built, in some cast in some cases started and,\r\n\r\n\r\nnever realized that was strange. And then I went to Texas A married my high school sweetheart and went into the Marine Corps. And in retrospect, at the time it wasn't so, but in retrospect, part of the reason I was doing that was to run away from my dad's shadow. I have a great relationship with him, but he's extraordinarily gifted and that's intimidating. And so I wanted to go do something that\r\n\r\n\r\nmy own thing. And so I did the Marine Corps and my wife says that was a bit of a bait and switch because when I had her fall for me, by God's grace, I wasn't thinking about the Marine Corps and I don't know if she would have, if that was the case, but once I had her hooked, we, that's what I decided to do. And so I did four years in the Marine Corps and that was shaping, character shaping for obvious reasons. And I had a really, really good experience in the Marine Corps. was an officer.\r\n\r\n\r\nNik (07:31.228)\r\nWere you deployed or what was that experience\r\n\r\n\r\nNolan Gore (07:34.668)\r\nYeah. So I was deployed to Iraq at the beginning of the ISIS stuff. when we went back into Iraq for that, now I was fortunately, I can say now, fortunately not kicking in doors when you're a Marine, there's this like weird screw loose where you just kind of want to be the guy that's doing that. And all my guys wanted to be the guy that was doing that. but of course now in retrospect, it is a good thing that I didn't have to do that. we were doing a lot more training and whatnot.\r\n\r\n\r\nNik (07:40.817)\r\njeez\r\n\r\n\r\nNik (08:00.412)\r\nYeah,\r\n\r\n\r\nNolan Gore (08:04.76)\r\nAnd then I did an additional, it wasn't a full deployment, but several months over in Oman, doing a big exercise over there. And by the time it was time to think about whether or not I wanted to stay in, we had our first kid, a daughter, who did this beautiful art above me, which I will sell for the right price for anyone who is looking here to start her career. We'll put a link in the show notes here too.\r\n\r\n\r\nNik (08:23.3)\r\nAwesome. Lincoln bio.\r\n\r\n\r\nNolan Gore (08:34.74)\r\nAnd so I, we had had such a good experience actually because it was such a good experience. I was apprehensive about staying in because I knew it was probably just going to get worse. and so I was looking to do what was next and was going to do the obvious thing, which was go get an MBA because that's a punt and it's okay sometimes, but sometimes it's a pun and even then that's okay. but this, someone came to my dad and said, Hey, this little Thanksgiving businesses, I'd love to.\r\n\r\n\r\nNik (08:51.516)\r\ncourse.\r\n\r\n\r\nNolan Gore (09:04.458)\r\nget rid of it because it's not my real thing and I ended up owning it because of some legal stuff\r\n\r\n\r\nSo my dad called me and said, do you want to put your life savings into a little landscaping company that's not making much money? If any. And so I said, that's a great idea.\r\n\r\n\r\nNik (09:24.134)\r\nThis is an interesting question. Dang it, why does my camera keep shutting\r\n\r\n\r\nWhen did that shut\r\n\r\n\r\nNolan Gore (09:33.43)\r\nIt just did. It just did.\r\n\r\n\r\nAnd if you want me to hit that last bit again, I can.\r\n\r\n\r\nNik (09:38.276)\r\nNo, no, you don't, you don't. I just wanna make sure it turns out, here we go. Okay, so this part I find interesting. Why didn't your dad say, come into the family business, so to speak? Why did he say, you should buy this and do your own thing,\r\n\r\n\r\nNolan Gore (10:02.078)\r\nI think there's a couple of reasons and I don't know how explicit he would have been about this or if it's something we kind of see in retrospect, but one, and very importantly, we didn't know if I was any good. and I had general characteristics that implied I had the potential to be decent at this job or a job. But, I think we've talked, we talked about this offline before where\r\n\r\n\r\nNik (10:16.56)\r\nYeah.\r\n\r\n\r\nNolan Gore (10:31.502)\r\nJust as someone can run a really fast 40 and jump really high and has really great hands, does it mean they're going to be a really good receiver? And so just the fact that I was relatively smart, grit, can work hard, and an inclination towards leadership doesn't necessarily mean that I will be successful in business. And I think we're seeing a track record now that implies that maybe someday I'll actually be decent at this, but I think part of it was.\r\n\r\n\r\nYou don't want to put me in a situation with his organization that could not go well. Secondarily, he knows I want to do my own thing. we've talked about, had, we've talked for years about me joining him. And there was a point there actually where I tried and it just didn't work out for various partnership reasons from his side of things, with one of his partners. but I.\r\n\r\n\r\nI think we decided that this was a good chance at seeing whether or it was worthwhile. And I think also it was a small enough risk. mean, it was a big risk, but it was not something that was going to sink my life type risk, that it was a good practice route. So if it didn't go well, it would be really painful, but not debilitating to my life. I was still only 27 at that point. So I think that those reasons combined.\r\n\r\n\r\nNik (11:57.65)\r\nIt's a, do you, when you were in the position, were you like, this makes perfect sense. My dad has experience, I have experience. It's a sweaty business. Let's roll. What's the worst thing that could happen? Or were you thinking, I don't really want to do this. I kind of wanted to do something else and like begrudgingly took the opportunity. What was your mental state like at that\r\n\r\n\r\nNolan Gore (12:24.079)\r\nFirst of all, I didn't know what the acronym ETA was until like last year. I had like, I saw it on Twitter and I like had to Google it and it was like, actually a hard Google because it obviously is not the first acronym. Yeah. And so I didn't, not a thing in my brain. One. Two, I am blessed and cursed.\r\n\r\n\r\nNik (12:37.874)\r\nIt's made it time of arrival.\r\n\r\n\r\nNolan Gore (12:51.638)\r\ndepending on the day or the moment to have extreme self -confidence. And so there wasn't really a, I wasn't like scared. I was naive. And so it was like, I actually don't remember that process very much. I remember looking at like cash to apply for schools and I want to go back to Austin because that's where our families are. And here's an opportunity. I could probably pull that off. Let's do\r\n\r\n\r\nNik (13:13.234)\r\nHuh. Okay, so you were just like, you were in it. You're ready to roll. That's actually really cool. How big was that first business?\r\n\r\n\r\nNolan Gore (13:20.046)\r\nWell, and I don't recommend necessarily to do it the way I did it. Like it was only doing 1 .6 in revenue, which is not only, it's obviously a sizable business, it was, I didn't look at, like I looked at some spreadsheets, I didn't have a finance background, but I didn't like know the business at all. I looked at the website. I like didn't really visit. There was a,\r\n\r\n\r\nguy here who's still my business partner, who was helping run it at the time. He didn't have equity and we brought him in to the partnership. And we had done some background to make sure he had character and he does and all that stuff. other than that, we met kind of one time before I showed up as a 26 year old guy being like, I'm one of the new bosses.\r\n\r\n\r\nNik (14:00.583)\r\nDude.\r\n\r\n\r\nNik (14:04.866)\r\nI personally believe there's so much luck involved with success. Like I look back on things and I think, what was I thinking? Dude, X, Y, and Z could have gone wrong. I could have lost my house. I could have gone into debt. Like it could have been a terrible, terrible situation, but it worked out and I'm grateful that it worked out. And so I look back on my gosh, man, so many cool breaks that happened and like what you're describing to look back, you're like,\r\n\r\n\r\nI met him a few times and partnered with him and thankfully it's worked out. But I think there's a certain level of naivete that an entrepreneur needs to have to get in. Because if you knew everything that was gonna happen, I'm not sure that you would actually do that first thing because it can be so risky.\r\n\r\n\r\nNolan Gore (14:54.356)\r\nI agree. And I think that, I mean, you're almost inevitably going to be bad at the job when you first start. I mean, for years. And I don't know if you've seen the Dunning -Kruger effect or whatever the graph is, but there's a lot of people that are a lot of similar ideas, but it's basically the idea of, and I experienced this a hundred percent, that's why I'm going talk about it. You like, I am really good at this job.\r\n\r\n\r\nAnd then you get a little bit more time and you go, shit, I am really bad. And then it's a slow progression to, and I'm like off screen, but it's a slow progression to competency. And that was a hundred percent. My first year I was like, I have my shit together. The economy was awesome. So we were growing. I like raised prices and people stuck around and I was like, this is, I don't know what everyone says here. And then year two, and I remember like cringing conversations with people being like, yeah, man, come watch it. I'll show you how I do it and all this stuff.\r\n\r\n\r\nNik (15:30.139)\r\nYeah, yeah, yeah,\r\n\r\n\r\nNik (15:49.298)\r\nI think I know a thing or\r\n\r\n\r\nNolan Gore (15:50.582)\r\nAnd then like year two, yeah. And year two was just, and it wasn't even, year two I think we did better financially, but I just realized how much I didn't know. And it was so scary. And I mean, I'm on year, almost about to do my eighth year at this point. I'm like, I mean, I was listening to one of your things earlier and realizing, yeah, I mean, that's another hole in my business I just do not get at all.\r\n\r\n\r\nAnd it's just like when I make the joke about like someday I might be good at this like I mean that like I'm I'm We're going and I need the gate keep going so I can actually maybe get good at this But back to what we were saying earlier you have to be naive and the only reason that people do it again is because they've actually Overcome like that. I think I can do it now like if I tried again with that skill set No way if I can just try again with this skill set. I now understand what it's gonna take and that's gonna be pretty hard, but\r\n\r\n\r\nNik (16:50.096)\r\nYeah, dude, my my first job out of college, I had experience with actually doing acquisitions. This is amazing. What the F is going on here. I'm so irritated. I know I promise this has never happened before.\r\n\r\n\r\nNolan Gore (16:50.176)\r\nI probably can do it again.\r\n\r\n\r\nNolan Gore (17:05.868)\r\nNo, you're totally great.\r\n\r\n\r\nNik (17:06.866)\r\nI'll say that to all the girls. Freak.\r\n\r\n\r\nOkay, let's, I just keep turning my camera on and off. There has to be a reason. Anyways, my first job out of college, I had a lot of experience with doing acquisitions, transitioning them, et cetera. And on the first three or four that I did, I crushed it. freaking, I'm, dude, I was the man. Made so much money. Everybody was like, how did he do it? He's he's a wonder kind. You know, I'm like 27, just crushing. And\r\n\r\n\r\nNolan Gore (17:32.418)\r\nYes. Yes.\r\n\r\n\r\nNolan Gore (17:39.406)\r\nspeaking German already.\r\n\r\n\r\nNik (17:41.04)\r\nI was I was like, that's good. Yeah. And then we bought this business in Southern California. And I'm like, I could do it. And it dude, it's it was a such a crappy business. Business was declining. Operation sucked. The product was terrible. ton of things. But I'm like, I could turn it around. Spoiler alert, I did not turn it around. I got fired. And I'm lucky I learned on somebody else's dime. But now I there's so much I learned from that experience. Like, okay, I'm not the sales\r\n\r\n\r\nNolan Gore (17:43.81)\r\nHahaha\r\n\r\n\r\nNik (18:11.472)\r\nI'm the ops guy, but I'm not, am not the sales guy or, there's these things I needed to do and do diligence. And to your point, if you can take those and fail forward, if you can take your failures and learn from them, then the next time you see something similar, you have some pattern recognition and you can actually make a really, really good decision for yourself. So I, I like the way that you're articulating\r\n\r\n\r\nNolan Gore (18:31.704)\r\nWell, and I'll add to that to say you've got these tangible skill sets, but you also have built the like emotional, the ability to deal with these things emotionally. To understand what's, yeah, just like, this problem is really bad or this person quit and that seems like it's going to sink us. But I've been through three or four of these. That person is essential to the business and no, we figured it out.\r\n\r\n\r\nNik (18:44.988)\r\nFortitude,\r\n\r\n\r\nNolan Gore (19:01.866)\r\nI need to find someone good. And every time you find someone good again, you're like, was that luck or am I actually good at finding people? Both. And so it just gives you like additional emotional capacity to deal with the really hard ups and downs of this whole thing.\r\n\r\n\r\nNik (19:17.394)\r\nI think of business as baseball. Like if you're in baseball, this is what's crazy. Ted Williams, like the greatest hitter of all time. I think he had a career batting average of 400. Actually, it's probably less. He probably had a few seasons of 400, but high\r\n\r\n\r\nNolan Gore (19:34.366)\r\nabout my batting average in t -ball.\r\n\r\n\r\nNik (19:37.266)\r\nYeah. Well, here's the thing. When you say, oh, he had a batting average of 400, what that actually means is 40 % of the time he hit the ball, 60 % of the time he struck out. So you're telling me to go like the greatest hitter of all time struck out 60 % of the time, 60 % of the time he's walking back to the dugout with his head down because he just struck out or grounded out or whatever it is. Okay. But if you can hit the ball 35 % of the time, you're going to make a hundred million dollars.\r\n\r\n\r\nover the course of your career. It's nuts to me. And that's how I think of business. You you're not 100 % right all the time. But you can get to a point where if everybody else is right 50 % of the time, and you're right 65 % of the time, you're doing better, you're doing business better than other people, because there's always a risk is always downside into your comment, like did I was I lucky to learn how to hire them? No, man, you're learning how to hire people the right way. And you're mitigating your risk. So that if on average,\r\n\r\n\r\nsomebody hires someone and it works out 50 % of the time, but you've gotten to the point where it's like, okay, 75 % of the time, I know it's gonna work out. That's great. You're outperforming the market. It's exceptional performance, but you're never ever gonna get to 100%. There's nobody who has the 100 % track record of success. And if they tell you that, they're probably just trying to sell you a course.\r\n\r\n\r\nNolan Gore (20:56.27)\r\nI that I actually on this wall over here have a business card that we're talking about the hiring thing. And it's a business card of a guy that I hired and fired within two and a half days. Big, a big hire. And like, I just totally screwed it up. And like we were on Talibet so much that we got business cards within a couple of days. And I mean like, just a hilarious mess that people bring up all the\r\n\r\n\r\naround here to make me small, which is who I bring it up to. But poor Ryan, poor me for screwing that up. Frickin' team for me screwing that\r\n\r\n\r\nNik (21:36.306)\r\nBut here's the thing. Like, yes, you're going to be wrong a good percentage of the time. The question is, how do you respond to your mistakes? Do you double down on them or do you iterate? And you fired quickly. Like, it's so important to fire quickly. So important. If you know, you know. And it's not fair to them to keep them in that role. It's definitely not fair to your team. So kudos to you. I am going to murder this camera.\r\n\r\n\r\nmy gosh.\r\n\r\n\r\nNik (22:11.282)\r\nNow you're going to be like, can we do this again actually because you screwed up so much? Um. Mark this again. OK, so along those lines. You did your first acquisition. 1 .6 million in revenue. I don't remember what the purchase price was, but you grow that baby to I'm going to guess 6 to $7 million or $6 million a year in revenue. But you've done an acquisition recently, correct?\r\n\r\n\r\nNolan Gore (22:15.328)\r\nNo, no, no,\r\n\r\n\r\nNolan Gore (22:41.042)\r\nSo just about nine months ago at this point, bought a competitor. And I can talk you through how we found that, in quotes, and then how that's gone and some of the stories along the way, if you think that'd be interesting.\r\n\r\n\r\nNik (22:55.974)\r\nYeah. No, I'm super curious because a lot of people who are listening want to buy their first business or they bought their first business. Things have gone fine. They want to buy a second one. I think it's important to understand that just because you've done one thing once successfully doesn't mean the next one's going to be successful. So make sure you have as much knowledge or you're going into it with as much forethought as possible of the potential downside. So yeah, I would, I would love to hear how you found it, how you did due diligence, what happened during the transition.\r\n\r\n\r\nNolan Gore (23:25.122)\r\nYeah, so I found it by eating enchiladas. Highly recommend. I'm usually a tortilla soup guy. And so the fact that it was enchiladas is important. But no, I have a, I just try to get lunch with other people running these businesses as much as possible because there's a lot of grass and we can learn from each other and I'm relatively young. And so I go to these guys and say, Hey,\r\n\r\n\r\nsomeday you're going to want to be done and I'm going to be doing this for a long time. And so when you want to be done, let me know. Um, and so there's a couple around town that I've been eating with for years. And, um, one of these guys came and we had an hour and 10 minute lunch and just talked about all the things. And then at the very end, like literally 70 minutes in, he was like, Hey, by the way, I'm thinking about selling. Like, do you want to? And I was like, sure.\r\n\r\n\r\nWhy didn't we talk about this from the beginning? And so it turned into another conversation. But the reason that we did that, there's a couple nuggets along the way. One, he was about a third my size, which is a really good tuck -in size because it's big enough and chunky enough that it makes a big difference, but it's not so big that it's gonna sink you and it's not gonna, it doesn't like.\r\n\r\n\r\nNik (24:26.777)\r\nYeah, yeah, yeah.\r\n\r\n\r\nNolan Gore (24:52.887)\r\ncompletely disrupt your culture.\r\n\r\n\r\nNik (24:54.684)\r\nSo people talk a lot about tuck -ins. What is that? What do you consider that to\r\n\r\n\r\nNolan Gore (25:02.19)\r\nso I'll just tell you what, why this was classically a tuck in for us. I actually don't know what classically it means, but a tuck in being we're going to add, another business into our existing business that does pretty much the exact same thing. obviously every business does things systems wise very differently, but we were a residential along and landscaping company. They were residential on a landscaping company. were in South Austin. They were in South Austin.\r\n\r\n\r\nNik (25:18.194)\r\nCough\r\n\r\n\r\nNolan Gore (25:30.926)\r\nThey used the same subs as us. They used the same software as us. So a lot of things aligned for this to make sense.\r\n\r\n\r\nNik (25:38.846)\r\nAnd the other thing I would add is like, when people are talking about tuck ins, they're thinking, okay, they have a leadership team, we have a leadership team, we can keep the work that's being provided, the services that being provided by the actual people, the same, but we can eliminate some positions and realize some economies of scale. So usually, that's one of the reasons that there's a tuck in because it's like, cool, I can add more revenue and it's going to juice the earnings to the bottom line. Boom, makes a lot of\r\n\r\n\r\nNolan Gore (26:11.958)\r\nAnother reason people might do tuck ins is if there is like one or two and actually you may not call it the tuck in but you're you're buying the ability to do another service So like if they have a department if we do 80 % the same But that other 20 % is something that I want to be able to do So like if I wanted to do irrigation and they had a strong irrigation department, that would be another reason to add it and you can then take their Systems and apply it across your entire\r\n\r\n\r\nset of clients is another good reason to do something like this. that would mean it would be worth more to me than it would be to someone else.\r\n\r\n\r\nNik (26:51.932)\r\nI'm just gonna leave it. Yeah, we're\r\n\r\n\r\nNolan Gore (26:53.474)\r\nYou weren't. So the, there's a lot of reasons, a lot of good reasons to do this on paper. and he was eager to be done. but one of my big takeaways is that I then became eager to do this because it sounded like fun and people talk about doing these things and I want to be someone that does these kinds of things. And.\r\n\r\n\r\nNik (27:16.952)\r\nSorry, it just stopped recording on us.\r\n\r\n\r\nNik (27:22.07)\r\nNo, it didn't stop recording on us. Never mind. Keep going.\r\n\r\n\r\nNolan Gore (27:24.684)\r\nIt turned back on. You're good. so we, we started the conversation and he wanted to get it done quickly. and I kind of pushed back on moving the closed date, because of seasonality and whether or not I wanted to actually figure out if I could do this and bring my team along instead of just knowing we're going to do it. anyway, we worked through the whole thing and,\r\n\r\n\r\nWe could talk a little bit about assessing that, cetera, but they'd had some rough years and so applying a standard multiple to an EBITDA member was not an appropriate way to value it because it would have basically been worth essentially zero. And so we looked at it from an asset perspective and from a client perspective and really valued it that\r\n\r\n\r\nNik (28:12.174)\r\nTell\r\n\r\n\r\nTell me, how did you underwrite this business? So yes, it's tucking, right? But what were you looking at or looking for to make the decision of like, should we or shouldn't we buy this business for an agreed upon purchase price?\r\n\r\n\r\nNolan Gore (28:33.728)\r\nSo kind of what I was saying there is I don't think I did that super well. I don't think I had a line in the, in the, like, this is where it will be worth it. And this is where it won't be because I just wanted to do it. And so a big learning lesson for Nolan going forward. And I'm, and this isn't going to turn out to be a horrible thing for us. We, it's a, going to be okay to good. in the next five years,\r\n\r\n\r\nOne thing that no one needs to learn is like, need to separate the emotions of something from the reality of it and be able to be more competent and analytical in these decisions. But we had the money and I wanted to grow because I want to be someone that runs a bigger business. so, I say that with sarcasm, right? Like that's not a good reason to do something. But we...\r\n\r\n\r\nWe looked at it and essentially, like I said, we couldn't value it top down. So we had to be like, okay, all the vehicles are worth X number of dollars. All the clients are worth X number of dollars. Don't I wish I had a better understanding of what my CAC was because that would be really useful in this moment. All of their, you know, like all that kind of stuff. And we kind of threw some stuff together and I was with a friend who was very good at acquisitions and he helped me like, be like, no, you don't want to pay\r\n\r\n\r\nYou want to pay this much?\" like, I can, but he's like, no, I helped me work through what was wise. And we got to a point and it didn't make the seller all that happy, but we kept working through it and we got to a point where we could both get there. And I'll tell one story about financing and then I can tell you more about like day one, if you want, or if you have another question.\r\n\r\n\r\nNik (30:17.154)\r\nYeah, no, no, no, keep going. Keep going. I'm listening. Because you had some financing complications.\r\n\r\n\r\nNolan Gore (30:21.294)\r\nSo yeah, so we were going to do it with SBA and do it based off of my company's cashflow because in a SBA deal where you're getting the same NAIC code, you can either do NAIC, but you can base it off of your own company's cashflow and in some cases do a zero down. And so that was like for my...\r\n\r\n\r\nNik (30:37.357)\r\nNext.\r\n\r\n\r\nNolan Gore (30:49.09)\r\nfinancial instrument perspective, that's you were planning on doing. was going to be really great. Well, our bank cut their SBA department mid this whole process. they, but they said, Hey, we'll, but we'll carry this one through. We just can't do anymore. I was like, okay, cool. and we kept, but, I'm the kind of person that was texting him once a week going, we're still good, right? Hey, we're still good,\r\n\r\n\r\nNik (30:59.773)\r\nto race.\r\n\r\n\r\nNolan Gore (31:15.658)\r\nAnd then on like a Friday afternoon, my banker called me and said, Hey, let's get lunch on Monday. And I was like, you're about to kill it. Aren't you? And he was like, no, no, no, no. mean, stop for Monday. I was like, if you're going to kill it, tell me, cause I got to figure this out. And, and he, we went to lunch on Monday and they killed it. and so I went to a different bank and we didn't do SBA. did, just lending or financing based off of the assets. So it was a lower financing amount.\r\n\r\n\r\nthe ability to do the deal anyway. And we figured it out that way, frustrated me. think the takeaway for people is you need to have multiple banking connections. Not just, even if you're best buddies with that one guy or gal, like have multiple ways of getting funding. And even afterwards, even though it frustrated me, I've still kept the relationship. Part of me wants to burn that bridge because it'd be fun, but like that's just not useful.\r\n\r\n\r\nI was literally texting with the banker that shut down the deal right before we go on this call. I try to keep all the options open because winning is moving the ball forward for the next several decades. And I'm going to need all of these opportunities I can get, whether or not I think that they handled something appropriately or not. I just need to make sure I'm prepared for\r\n\r\n\r\nNik (32:35.694)\r\nTell me, tell me in, now that you've transitioned it, and there are all the transitionary things that you need to worry about, but what are the pieces in due diligence that you will never miss again? What was it about the deal that looking back you're like, man, it's not a home run, it's only gonna ever be good to great, or excuse me, okay to good because of X, Y, things.\r\n\r\n\r\nNolan Gore (33:02.786)\r\nThree super easy, just null and look stupid things. One, better job of assessing the assets, the vehicle specifically. Big part of the valuation was off of those vehicles and they were horrible. I mean, one of them broke down the drive from there to our office on day one. Another one I went and pulled off the side of the highway day two.\r\n\r\n\r\nAnd so we ended up putting a lot of money into assessing what was keepable versus what we should just transition away or sell. And so we went through a tremendous administrative process of getting them all into our name and then offloading them. And we spent a lot of money in the process. And so that was just super frustrating. We ended up having to get 50 K back from the seller in that process. And he handled it with a lot of grace and I don't think he was malicious.\r\n\r\n\r\nBut it was, it was something that I wish I could have done better. Secondarily, really, an inexpensive issue. mean, it hurt the economics of the whole thing pretty significantly. Second one I'd say is, this is like a small, very tactical piece, but I didn't put enough weight on how they thought about holidays. And so like they traditionally had a bunch of time around Christmas that they gave employees.\r\n\r\n\r\nNik (33:59.608)\r\nsure it was still an issue.\r\n\r\n\r\nNolan Gore (34:29.408)\r\nas like their annual kind of PTO. And we didn't. And I just looked over that and it turned into a, I mean, I still feel sick about that because these guys are all planned on having time around Christmas off. And I was like, we can't, that's a huge expense. And so I should have gone to the seller and said, Hey, we're going to, we're going to split this. You're, you guys are still going to get that, but you're going to assume part of that cost because you've basically been building it up all year. It's not been.\r\n\r\n\r\nexplicit part of conversation, but it's something everyone thought they were going to get. So that turned into a trust issue. It was frustrating for everybody. was horrible.\r\n\r\n\r\nNik (35:05.73)\r\nWell, you're hitting on something that's actually really important that a lot of people don't think about, which is when you buy a business or when you sell a business, your employees have accrued benefits, whether that's sick time, vacation time, holidays, whatever they are. And so on the balance sheet of a seller are going to be those liabilities.\r\n\r\n\r\nIf you step in and you either assume them or don't assume them, but it hasn't been communicated to the employees and the employer didn't pay out those benefits when they left, then you look like a jerk come Christmas, right? And like, so like he was, what I would have done or what that was one thing I had to learn is like, okay, seller, you either pay out the benefits or we lower the purchase price commensurate with.\r\n\r\n\r\nwhat the benefits are going to be. Or we go to working capital and there's a working capital adjustment. But it sounds like you didn't even have that conversation with\r\n\r\n\r\nNolan Gore (36:12.812)\r\nYeah, and they weren't official explicit benefits. It was just something they'd done for years and counted on. And so I don't think I handled it great. I really don't. But I don't, I just under, I I undervalued that thing. I just didn't understand it. I wanted to get the deal done and move to the process. And it was one more thing that I should have really worked through. And I'll give you a third one. And this one's probably the most important of the three is\r\n\r\n\r\nWe didn't have shared language on services and I thought we did. And so when they said that they have a basic lawn maintenance, to me and our company, that means we just mow the lawn, edge it, get off the property. And so I went through a hundred of their clients and checked pricing. I was like, you know, these are priced pretty well. There's some weird ones, but it's pretty weird. we're going to be in a good spot here. But when you started to dig really deep in what that basic lawn maintenance meant to them, meant.\r\n\r\n\r\nOn this house, we're going to do the weeding in that bed and mow. On this house, we're going to pick up the leaves every time and mow. On this house, we're not even going pick up, we're not even going to mow, we're just going to blow off this surface and do this other thing and then wash the dog. They didn't actually wash the dog, lots of random stuff. Yeah, no. And that turned into a huge disaster, right? Like the transitioning of how they built their packages and our software\r\n\r\n\r\nNik (37:15.075)\r\nMm -hmm.\r\n\r\n\r\nNik (37:24.568)\r\nAwesome.\r\n\r\n\r\nNolan Gore (37:36.974)\r\ncommunicating to the customers and disentangling those services and Hey this person basically getting a price raise because we're taking one of those services away even though we're not raising the dollar amount Just I mean talk about a huge problem 650 clients\r\n\r\n\r\nNik (37:50.542)\r\nOr if you. That's what I was going to ask. OK, so of your 1700 clients, this was 650. I mean, that's a third essentially more a little more than a\r\n\r\n\r\nNolan Gore (38:00.046)\r\nWell, so was basically maybe only half of their clients had that stuff. So 300, um, and these are rough numbers, but we had to go and have those conversations and then look at all the other ones and be like, okay, this one's good. Oh, but their pricing is bad. Let's go fix it. You know, like all that kind of stuff was hard. So those are my three big, like I'm never going to screw that up again. Those are, and in retrospect, anybody that's done it like you did, you would have had the checklist to catch all that stuff. And I should\r\n\r\n\r\nNik (38:26.958)\r\nNow I would now I would but I mean and luckily I learned learn on other people's dimes but Yeah, man, like my first couple acquisitions. I honestly just got lucky that they were good acquisitions But you don't really need the checklist for the good acquisitions. You need the specifically for the bad ones because when they go bad, they go really really bad and I had to learn. Okay, what is important? Thankfully now I have a good sense But it's an acquired skill. It's not something that anybody just knows innately because\r\n\r\n\r\nyou'd like the benefits thing. You don't think about that. Who thinks about that when they're negotiating a deal? Nobody thinks about that. But when you are sitting with an employee six months later, and they're like, well, what happened to all my PTO? I had $5 ,000 built up. And you're like, yeah, what does happen? Did the seller pay you that? No. Oh, I'm sorry. I you don't have that anymore. They don't care about the seller anymore. They care about you. Like, what are you going to do to fix it? And then it becomes a whole massive issue. So I got some questions\r\n\r\n\r\nto finish up. Are you\r\n\r\n\r\nNolan Gore (39:26.702)\r\nPlease,\r\n\r\n\r\nNik (39:30.531)\r\nHow big do you want\r\n\r\n\r\nNolan Gore (39:33.966)\r\nWe explicitly state that we want to be the largest residential lawn and landscape company in Texas. I think it's going to take a decade to get there and I don't have a clear line on who that is because almost all the big boys are commercial. So I know that it's probably in the 40 to 50 million range. And I will say the reason for that is because I believe in the one, I think it sounds fun.\r\n\r\n\r\nAnd that's not a good reason, but I think it sounds like a good challenge and really fun. And I've seen big businesses built and it sounded like a great challenge for us. But two, think that one of our, one of the things we really want to provide is just like opportunity. And right now there's like not that much, I mean, there's, there's, opportunity. We're getting to be a larger business, but like you look at the guy on the front line was like, where are the bus things asked me? He's like, where else do I go? It's like, there's not very many stacks next steps. And is as we get bigger, there's more opportunity for.\r\n\r\n\r\nthe team. And so I'd love to see\r\n\r\n\r\nNik (40:36.546)\r\nDo you think growth is more through acquisition or startup?\r\n\r\n\r\nNolan Gore (40:43.496)\r\nI think that we will do more acquisitions and that will be a useful tool. But I think that the majority of it's going to come organically. for any listeners out there that want to come and help me figure out how to do that better, I would love for you to call me because it's hard. It's hard to figure out and all the pieces are moving all the time. know, what,\r\n\r\n\r\nNik (41:05.742)\r\nWell, it's a good thing you had a bad experience with the transition early because now you'll have a lot of lessons learned, which is great. Saves you a lot of headache. You'd rather do that on a million dollar deal than a $10 million deal. You know what I mean? What do you love about this business?\r\n\r\n\r\nNolan Gore (41:24.79)\r\nI mentioned it earlier, but it's that it's that it I am made to be in a heavy human business. and what I mean by that is like, God made me to be around people and to lead a lot of messy humans. that doesn't mean it's fun, but I know that's what I'm supposed to do. And so I get a lot of, groundedness from being around.\r\n\r\n\r\nthe guys on the front lines. I like being in a business\r\n\r\n\r\nIt's not. So what's up? What's things about being in air conditioning is like, they only call you on a bad day in landscaping. It's like an essential, but they also, it's like, they're happy at the end of it. Right. You go home and like your guards mode and you're like, this feels great. Or you go home and you have a new bed that's really well maintained and new plants. you're like, this is great. our, our product actually appreciates as it matures, as opposed to depreciates if you're doing it right.\r\n\r\n\r\nAnd so we get to have a lot of happy conversations. Of course, most people that call are grumpy because that's how the world works. it's that those are some things that I really love about this business in general. And it's just, there's, love nature. I mean, shows me what God does and I get to go out there and learn about all these little weird plants and talk about them. And that's fun for\r\n\r\n\r\nNik (42:56.418)\r\nWhat do you hate about\r\n\r\n\r\nNolan Gore (43:00.654)\r\nIt's really hard not to become cynical around a, what do love the most people, what do hate the most people? It's hard not to become cynical around a, let's be honest, it's generally a lower income demographic that's running on these crews. And generally, not entirely, because we have a whole bunch of them that aren't problems, but generally, there's a lot of life problems.\r\n\r\n\r\nAnd so every morning, every morning, you get, yeah, you get some people calling in and it's hard not to be like, are you just being incompetent or unreliable? is that a really a life problem or, so it's hard not to, what I don't like is like when I start to feel cynical around teams, performance and reliability. And I know that that happens in all every business, when you're running stuff,\r\n\r\n\r\nNik (43:32.206)\r\nTriggered!\r\n\r\n\r\nNik (43:57.752)\r\nSo I'm gonna tell you something hopefully to make you feel\r\n\r\n\r\ndoesn't change with income. Like I've managed a lot of people who are making high five figures, low six figures. And there are still those ones that are always calling like, sorry, my daughter's sick or sorry, I'm late today. Like there's always an excuse for it. And that, yeah, that is very, very frustrating. Unfortunately, it doesn't, you would think that it would scale better. Like, well, these are people who are in better positions and they went to college and\r\n\r\n\r\nNolan Gore (44:06.659)\r\nYeah.\r\n\r\n\r\nNik (44:32.322)\r\nBut man, it's just one of the problems with dealing with employees. It's hard to manage all of that stuff.\r\n\r\n\r\nNolan Gore (44:38.798)\r\nOne thing I will say, it's been like a treat in the last 18 months is starting to work with people overseas. They're so hungry. And because of that, the reliability and I also, get like, you pay well comparatively, like you get very high quality people. Um, and just, mean, we have one girl on our team that she, I texted her early one morning, Hey, can you do this thing? And she was like, Hey, is it okay? I already told my manager, but\r\n\r\n\r\nNik (44:55.256)\r\nsome real talent.\r\n\r\n\r\nNolan Gore (45:07.874)\r\nI've got two feet of water in my house. So I'll get to it, but can I have a little bit of time?\" And I was like, what are you, of course. Yeah, like, no, take care of your family. And she was just repeatedly apologetic. And I was like, no, this is, she sent me the pictures, right? No, this is a legit excuse. Like you, you're hungry, she shows up on good days and bad days, wants to be there, wants the job, wants to work. And that's so fun.\r\n\r\n\r\nNik (45:13.038)\r\nCould you give me 15 minutes?\r\n\r\n\r\nNik (45:24.782)\r\nShe is always.\r\n\r\n\r\nNolan Gore (45:36.488)\r\nyou work with people like that. And we have people here in the US that are the same way, percentage -wise, I found it to be really refreshing to start working with more people overseas.\r\n\r\n\r\nNik (45:46.552)\r\nAll right, let's build on that. So all of us are jealous in some capacity. I'm curious for you, what businesses or industries are you the most jealous of right\r\n\r\n\r\nNolan Gore (46:02.926)\r\nI'm super proud of what my brother's building. know you've had him on. Go listen to that episode number, I don't know the number, but we'll put a in the show notes. He's so smart and so good at what he does. He builds very, very high quality pitch decks for people trying to raise money specifically in venture. And I find myself on days\r\n\r\n\r\nNik (46:06.926)\r\nYeah. Number 1724, Lincoln Bio. Yeah, Lincoln Shona.\r\n\r\n\r\nNolan Gore (46:31.7)\r\nmy team isn't reliable or whatever being like, shoot, if I could just go do something like that. And doesn't mean he doesn't have his problems. He does, but he's got a great team right now and he's, they're killing it. And so that sounds, that sounds really fun. Like white collar services sometimes sounds really nice. secondarily, have good friends who are in the commercial space around cleaning and security and let's see my best friends.\r\n\r\n\r\nAnd they've built reputations over decades with my dad actually, where they have a lot of really great connections. And so one of my friends started two companies in the last like 18 months or two years. And both of them are going to probably pass me in revenue size, like the next year, if not already. it's like 99 % of me is just so psyched for my good friend because he is that good and they're really good operators and really good at serving people.\r\n\r\n\r\nNik (47:16.006)\r\nmy gosh.\r\n\r\n\r\nNik (47:24.588)\r\nYeah, but there's the one, there's the one percent, there's the one percent that you're like, why did I pick the wrong freaking business? I get\r\n\r\n\r\nNolan Gore (47:32.684)\r\nYeah, he like adds a downtown skyscraper and he adds a million dollars in revenue. That's an overstatement, but it's like the chunkiness on that stuff sounds so fun. Whereas I go and like hustle and sell foreground. I'm like, and it's not to say he's not hustling stuff. So I think those two are just the personally, it's like some of my closest people that I get to see. But also I get to learn from and celebrate and I don't, it's okay if they're bigger.\r\n\r\n\r\nNik (47:47.906)\r\nYeah, totally agree.\r\n\r\n\r\nNik (47:57.976)\r\nYeah, no, I mean, I asked that question. I asked that question doesn't mean you're like, I'm gonna quit and this is what I'm doing next. But we're all jealous of different aspects of different businesses. So I'm always curious to hear people talk about like, man, like I love commercial real estate. It just seems like sign me up, triple net lease, send me a check in the mail every month, I don't need to worry about anything. But they have their own issues and problems. So for you, if you have two hours in the\r\n\r\n\r\nAnd I know this is hard because you have a special needs son who requires a lot of time, energy and attention. But let's just say you have two hours in the day, you have no family time or no family responsibilities and you have no work responsibilities. What are you obsessed with? What are you spending your time\r\n\r\n\r\nNolan Gore (48:43.438)\r\nI am very physically inclined. I'm going to take that time and work out almost every time. That's just the funnest for me. But right now what that looks like is I got as a good 30 year old would do, dad of four, I got into jujitsu in the last year. And so I've been going at lunch.\r\n\r\n\r\nNik (48:51.267)\r\nNo.\r\n\r\n\r\nNolan Gore (49:08.396)\r\nAnd let me tell you, it has been the most fun I've had in a long time because it is highly competitive, highly physically rigorous, technical. and it's been, it's just been, it's hit everything. I needed it this year with my really hard year with my son, just giving me my ability to completely turn off everything. You literally can't think about your problems when someone's trying to choke you. Like you can only think about that arm and what you're going to do with your body to get out of that situation.\r\n\r\n\r\nNik (49:36.268)\r\nYeah, I mean, you can you can think about your problems, but unfortunately, there's only one problem, and it's that python around your neck just squeezing like that's the only problem that's on your brain.\r\n\r\n\r\nNolan Gore (49:42.958)\r\nExactly. And I'm still so junior at this that there's a lot of jokes coming at me every day that I go. And so that's, I would go, I do that every single day if I could for at least an hour, maybe more than an hour. then I love reading. I do most of my reading through audio now.\r\n\r\n\r\nNik (49:52.362)\r\nYeah.\r\n\r\n\r\nNik (49:59.224)\r\nThat's right,\r\n\r\n\r\nNolan Gore (50:11.884)\r\nbecause of my life circumstances and my drive and stuff, but I'm probably gonna end up reading and working out, sometimes both at the same\r\n\r\n\r\nNik (50:21.301)\r\nIt's a great answer, man. It's a great answer. All right, last question. What advice would you give yourself 10 years ago? Nolan, he's probably enlisted 10 years ago. I'm not quite sure, but he's either just gotten out or he's still in. What advice would you give yourself?\r\n\r\n\r\nNolan Gore (50:45.27)\r\nI'm going to come back to the question. If I was giving it to someone else, because I did this on accident. I was in the Marine Corps at that point. I was an officer then, but getting leadership experience is if you're, if you're trying to, if you're considering running a business, like you need to know what it feels like to make decisions for other humans, good and bad. And whether or not you actually want to carry that. And so I got that in the Marine Corps.\r\n\r\n\r\nI got that all over life before that, but the Marine Corps in a really big way. And so that was super, super useful to me and what I decided to do after the Marine Corps. And I didn't understand that's what I was doing at the time, but just making hard decisions that were unpopular and figuring out how to execute with a team was very, very helpful for me. And I think a lot of people idealize running a company.\r\n\r\n\r\nNik (51:36.142)\r\ncreated this.\r\n\r\n\r\nNolan Gore (51:42.638)\r\nbut have never actually led, managed, accountable anybody, and it's not fun a lot of the time. And so you have to know whether or not you actually really do want to do that thing. For me, I think, what advice I would give myself 10 years ago.\r\n\r\n\r\nNolan Gore (52:02.592)\r\nI don't know, really, it's not to say that I it all figured out, but like, I think working hard on understanding what would, like, a big part of my life story is I'm probably not gonna be as good at business as my dad, and that's okay. And so working on my personal identity a little bit more, I think would be good, just kind of humbling me a little bit and taking out a little bit of that self -confidence in a positive way, because it's not all bad.\r\n\r\n\r\nNik (52:32.29)\r\nYeah, that's great. Well, this has been, there's been a ton of fun, man. Where's the best place for people to find you and follow\r\n\r\n\r\nNolan Gore (52:41.038)\r\nIf I'm going to be on the internets, I'm going to be on the Twitters. You can go find me on there. think I'm my search Nolan Gore SMB long cowboy is my but my handle is leadership at Cad One. That's probably it. Otherwise, if you're in Austin, I'll cut your grass from tall to short and do other things for\r\n\r\n\r\nNik (53:10.306)\r\nI love it. freaking love it. This has been awesome, man. Thank you so much for coming on and I can't wait to actually meet you in person.\r\n\r\n\r\nNolan Gore (53:18.21)\r\nYou're doing an awesome thing with this right now. The production's amazing. The people you're getting are really great. I really appreciate you having me on, especially after having my brother on, know, because he's way smarter than me. So go listen to that one if you're hearing this one and you liked\r\n\r\n\r\nNik (53:32.706)\r\nYeah, yeah, to be yeah, to be honest, I was like, man, no one's got to be great. This is what his brother's like. All right, my man, you have a good\r\n\r\n\r\nNolan Gore (53:39.566)\r\ngosh.\r\n\r\n\r\nNolan Gore (53:47.49)\r\nYou too.",
  "metadata": {
    "duration": "",
    "date": "2024-10-30",
    "platform_source": "Google Drive"
  }
}