{
  "episode_number": "37",
  "episode_title": "How a Side Hustle Became a $50K/Month Business with James Lincoln",
  "guest_name": "James Lincoln",
  "business_name": "Goodly Growth",
  "transcript": "﻿What do you hate about it? I hate that. It literally feels like it could fall apart tomorrow. You know, it just does. I tell my wife all the time. I'm like, this could be done. This could be done tomorrow. And I could like, I have to go get a job. And in reality, that's probably not true, but it just feels that way.\r\n\r\n\r\nYou know, a lot of entrepreneurs feel that way. A lot of us, we just feel like, dude, this could just be done tomorrow.  You know, these three things happen. I'm done. I'm out. \r\n\r\n\r\nYou've heard of a side hustle, right? Something you do on the side to make you more money while you focus on something else. Well, the thing about side hustles is they're supposed to stay on the side. It's kind of in the name, but what happens when you wake up one day and your side hustles generating 50, 000 a month? \r\n\r\n\r\nEven better, what happens when your side hustles making 50, 000 a month, but you're about to graduate with your MBA and there's this social expectation that you'll get a real job or buy a business.  What do you say to your wife at that point? Well, that's exactly what happened to today's guest.  Welcome to another episode of economics.\r\n\r\n\r\nThis is the show for entrepreneurs and entrepreneurs who are curious to know how other businesses work. I'm your host and chief curiosity officer, Nicholas Helusky. I've owned and operated more than a dozen businesses generating 30 million a year in revenue and employing more than 300 people. And on today's episode, I sit down with James Lincoln.\r\n\r\n\r\nHe's the founder of a digital marketing agency, goodly growth. And I'm obsessed with just one question.  How did James, this 27  year old with no experience. Who was getting his MBA at the time managed to build a 50, 000 a month digital agency. As a side hustle.  Let's find out together.  Okay, guys, we're going to get back to the show in just one second.\r\n\r\n\r\nBut first a message from a sponsor who is, uh, me. Oh, it's me. Cause I'm doing the show for free. Listen, I want to give you a hundred dollars.  All you have to do is go to Apple or Spotify.  Give me five stars, write a review, screenshot that review, send it to me, Nick at cofounders. com and you will be entered to win a hundred dollar Amazon gift card.\r\n\r\n\r\nEvery four episodes. I'm going to choose a winner at random and I'm going to do this five times, 500 for five stars. I just made that up. That's what I'm calling it. Please go to Apple or Spotify, leave a review, screenshot it, send it to me, Nick at cofounders. com and you'll be entered to win a hundred dollar Amazon gift card.\r\n\r\n\r\nAll right, let's get back to the show.  All right, James, welcome to Nickonomics. I'm freaking stoked to have you on. I know you called in before, but now we're deep diving into your business. For people who don't know,  tell us really quickly, what is your business and how do you make money?  Yeah, stoked to be here, dude.\r\n\r\n\r\nMy business is called Goodly, Goodly Growth. We're a digital marketing agency. We do local SEO for Home services businesses. And we make money by helping these home service businesses get more leads, right? They get more jobs off of Google. You're just SEO. You're not doing any pay per click or anything else.\r\n\r\n\r\nYou're just doing SEO for these companies.  Just SEO. I actually, in the last month launched a separate agency with a partner from my MBA program doing paid ads. So we've got two different companies that serve different verticals. I don't know why I felt like it'd be better to separate them out and be like, yeah, we got a paid ads company over here.\r\n\r\n\r\nMaybe it's like the wannabe Nick Huber and me.  That's like, we're just gonna have different companies for different things. But yeah, so just launched that a month ago. Do I know him? Do I know the NBA partner? Hunter. I think you do Hunter. Yeah. That's awesome, man. You and I originally met. Gosh, I don't know, probably almost a year ago at this point, maybe not a year ago, eight months ago.\r\n\r\n\r\nYeah. So talk about the launching of your agency because you haven't been around that long, right?  No, it's been, I was just doing the math. It's been like 17 months. It's tech. I say 17 months. It's technically been a little longer than that. Right. So if I were to like to go back and give you the short version of everything, I decided to come back and get an MBA.\r\n\r\n\r\nLike I was down in Texas working in software portfolio management. I'd done a startup when I finished my undergrad, had a baby and was like, Oh, I'm gonna go get a real job and start a career. And I love that job. Like that was an incredible job. You know what I mean? Like phenomenal people looking out for me, phenomenal opportunities,  just like a great place to work.\r\n\r\n\r\nIt didn't,  Uh, so I worked for Baylor, Scott and White Health. They're like a top 10 non profit health system in the U. S. You know, it's like a big health system. For anybody that knows about health systems, Epic is like Epic Systems. It's out of Madison, Wisconsin. They're like the big, uh,  EHR.  Yep, exactly. So them and Cerner.\r\n\r\n\r\nSo Baylor, Scott and White was an Epic shop. I started there as an Epic analyst. And then just, again, like it goes to show the value of having people like you in your corner. I had a guy that I had cold emailed. Off of like the BYU alumni database that was a director down there. I had a job offer in 48 hours right through this guy.\r\n\r\n\r\nAnd I moved my family down in Texas and like he took care of me and helped me help me get settled. And as the company went through, as we went through COVID, they did a massive outsourcing of it and he was retained. So like they laid off like 95 percent of like their 1500 person IT staff. And I was retained on a team of 12 at the company to kind of oversee the portfolio now that it was managed all out of house, right?\r\n\r\n\r\nSo they needed an in house team to manage the portfolio. So I did a lot of like vendor  relationship management and relationship management. I've worked in oncology and cardiology and transplant. I worked with all of the leaders across the system in those areas. It was literally, it was an unbelievable opportunity.\r\n\r\n\r\nAnd like. Crazy. Like people told me I was crazy to leave, but I'm just like, man, I just, I have an itch and this isn't quite scratching it. And I love the people I work with. I made great money. I was like a 27 year old kid  with a psych degree making like a hundred K a year living in Texas with a 1, 500 a month mortgage.\r\n\r\n\r\nI'm like, literally there was, we were living the life.  And, but you decided to go back and get your MBA. You went back to BYU, got your MBA. At what point during your program were you like, I've got health experience. I'm going to start a digital agency.  Well,  it actually started before the program.  You know, I had a business partner in the first.\r\n\r\n\r\nbusiness I started and we had done, we were doing a review software for small businesses, right? So we built this little software to help people get reviews back when that was like  kind of a cool space. It's everything's kind of consolidated to a few big players now, but what do you mean Ray back then?\r\n\r\n\r\nSo like we basically, the software was like really, really like lightweight software that we built. That was like, you put in a customer information. So like you go clean someone's carpet and you say, Hey, I cleaned Nick's carpet. Here's his phone number. You put that into the system. And then it sends you a text message and it sends you a follow up text message and a follow up text message.\r\n\r\n\r\nThat's like, Hey, here's a link to leave a review on Google. Yeah. Okay. So like the Google, my business or the Google business profile. Exactly. Got it. Okay.  And it helped people get way more reviews, right? Like that action of texting and giving them a link made it like so much easier to leave a review. So I'd like learned a little bit about SEO and digital marketing and Google through that process.\r\n\r\n\r\nThanks And my business partner in that, and actually that still exists today. We still have people on our software. It doesn't make much money, but that business partner and I like part of ways. And he called me up and was like, dude, I've been doing this little agency thing. You got to do it. Like it's easy money and you'd be way better at it than I would.\r\n\r\n\r\nLike you should totally be doing this, dude.  And I'm like, nah, I don't want to do an agency. Like agencies aren't for me. Agencies are the worst. Yeah. You know, it'd be good to have some cashflow during the MBA program. So like it was July of 22.  And I started the little agency. I did it for like two weeks, three weeks.\r\n\r\n\r\nI got one customer and, and then shut it down when I was like, got to the NBA. Cause I'm like, this is too much work with one customer. It's like too much work. And I'm like doing school full time.  And then it wasn't until February of 23  that I actually jumped back into it.  And in that span, so from September to February, I went to get my MBA cause I wanted to buy a business.\r\n\r\n\r\nYou know what I mean? Like that was my thing. And. From September to February in that time period, I had a business under contract. It was a woodworking business. They built like little wooden boxes that were like gift boxes. It was a great deal. It came through the MBA program, classmates, aunt ran it and her husband had died and like she needed to sell it, had it under contract and it fell through because it was like really high customer concentration and the customer said, we're not.\r\n\r\n\r\nWe're not going to buy any more boxes you sell.  Yeah. I think they were like strong arming her a little bit. They ended up buying it from her like eight months later for pennies. So that was kind of a bummer for her,  but it fell through in January. And I was like, man, that was kind of a bummer. Good experience though, but I'm like, I'm not financially in the place I need to be to go buy a business like I thought I was right.\r\n\r\n\r\nLike I needed to go get a home equity line of credit. I was gonna have to borrow money from friends and family. I'm like, I need to be in a little bit better spot financially, so I'm gonna, I'm gonna set myself up to be able to search for business after the program by starting an agency and just cash flow.\r\n\r\n\r\nAnd so that was the motivation to start. I started in February. I did have a, I actually had gone back to the health system in February as well. And so I was working a full time job, doing my MBA and starting my agency.  And, uh,  and then I left the full time job in September of 23,  finished my MBA in April, this past April, April 24. \r\n\r\n\r\nAnd now I'm full time in the agency. So tell me about the beginning, the early days of the agency. You started in February. You're like, I want to get some cash so that I can buy a business after I graduate.  What did it look like starting it up? Did you like, were there some investments up front that you had to do?\r\n\r\n\r\nYeah, I'd put two grand in. And I'd put that 2 grand in. So like, I'd set up kind of the framework for it back the previous summer when I was like, Oh, let me give this a try. I put 2 grand in the business. I signed one customer up and like maybe made like 1200 bucks off that customer. I didn't have a ton of costs.\r\n\r\n\r\nSo I think when I like launched in February, maybe I had like 3 grand in the bank, right? Like  maybe a little bit less. It was like 2700 bucks. So like minimal investment. I don't know, man. Maybe it's just my philosophy, but I'm like, you just got to sell, right? Like you just have to sell. Yeah. And, and you're never going to have a business if you don't sell.\r\n\r\n\r\nSo  I didn't hire anybody, I didn't build out systems, I just hired a cold caller. I didn't have time to cold call, because I'm like working full time and doing the MBA. So I hired a cold caller, and Just had them cold calling businesses and sending me warm leads and I would close warm leads. Tell me about that.\r\n\r\n\r\nLike, how did you get your first customer? Like literally  all the business in the country or like what businesses were they calling? Was it geographic in nature? How did you identify what the list was that they were even going to call?  I pulled the list off of Google. The nice thing about what I do is I target businesses on Google, so it's like super easy to get their information because.\r\n\r\n\r\nThey're on Google, right? They're out there for like you to find a carpet cleaner, right? So my father in law had some experience, like he's a carpet cleaner, so I had some experience working in his business a little bit. And so I started with a list of carpet cleaners. Um, we just started cold calling in Utah in like the country, like where, yeah, I pulled the East coast because I have a 518 number and I'm, I'm from New York.\r\n\r\n\r\nAnd so I was like, Oh, if I have a 518 number and I'm calling people, they'll probably answer if it's like, let's buy it. Right. Got it. And so my cold caller got set up with like the cold caller uses like local price and styling regardless. But it's like, Oh, I want a number that like, I can. Dial and it was like I had something I could talk to those people about.\r\n\r\n\r\nI'm like, yeah, I'm from the east coast. Yada, yada, yada. So yeah, we just pulled these coast carbon cleaners. How long did it take you to get that first customer? Not long. I mean, I had my first customer in February. I closed one deal in February.  Nice. Okay. You know, it's like an 800 a month deal and I don't know where it fell in February.\r\n\r\n\r\nMaybe it was like the second or third week of February, but yeah, it was within a couple of weeks. I got my first customer. What were you doing for them? So explain a little bit what SEO is and then kind of what. If your agency does anything specific or niche. Yeah. So SEO search engine optimization, the whole point of it is like the search engines Google, namely, right.\r\n\r\n\r\nIt's like the only one we focus on are presenting businesses to people searching for that service. So it's like, if you're looking for carpet cleaning, Google determines who you see.  And they want to make sure that you as a customer, right? Nick is the customer of Google.  They want to make sure you get reliable information from Google.\r\n\r\n\r\nThat's like their whole business model is providing you with good information.  So you keep coming back to Google. And so they have an algorithm that determines what businesses show up when you search for carpet cleaning. Part of that, part of that algorithm is how close they are to you, right? They're not going to show you a carpet cleaner in Florida because you're not in Florida, right?\r\n\r\n\r\nThat's irrelevant to you. Part of it is how reputable that business is. Like, Have other people reviewed that business? Does that business have a website? Does that business have a good website? Does the business offer services pertinent to what you're searching for, right? Like, all of that is factored in, and so what we do is we try and, like, manipulate That algorithm to some extent where we're saying we can optimize this business to show up when Nick is searching for coverage. \r\n\r\n\r\nSo what are you focusing on? Are you focusing on the keywords on the website? Are you creating content for them? Are you focusing on getting them reviews like you did with your previous company? Where are your focus as an agency?  Yeah, all the above, right? So getting them reviews is massive. If somebody doesn't have any reviews, like that's the first thing is like they gotta get some reviews.\r\n\r\n\r\nYou gotta have more than 10 reviews. If you have less than 10 reviews, like you're just in no man's land. So, you gotta get above 10 reviews. You gotta have a website that's responsive. Like, it's what works on mobile. So, yeah. If your website isn't designed for mobile nowadays, like Google will ding you. So you got to have a website designed for mobile.\r\n\r\n\r\nWe build out obviously the keywords on the site, you know, like carpet cleaning, Boise carpet cleaning, Eagle carpet cleaning, right? Like you got to have  services and cities, right? So that's kind of what it boils down to is you've got cities within a service area and you've got services that you offer.\r\n\r\n\r\nAnd so you have to build a website with landing pages for cities, landing pages for services, landing pages for cities and services. And so, you know, you have a business that offers 10 different services to. 15 different cities and you got 150 pages you got to build out. Right. So you can take some time and we build that over time.\r\n\r\n\r\nThat's not like all at once. Are you also doing content for them? Like, are you writing a blog? Are you posting on social media or is that separate from SEO? Yeah, we don't do social social isn't true SEO, right? There are some signals that come from social media, but, but it's mainly like, do you have a page?\r\n\r\n\r\nLike you have a page on Facebook, you have a page on Instagram.  It's less like how active is that page. There are some like really good strategies people can use on social and actually like what Hunter and I are doing is primarily social media ads.  Um,  but yeah, it's, we do content, right? So we'll post blogs.\r\n\r\n\r\nYeah. We come up with the content for all the service pages. Businesses will give us like a sense of like what they're offering. Do they have any guarantees? Yada, yada, yada. And like, you just build out content for those pages. Is that content static? Is that like, here's what we do. Or is it like a blog where weekly it's updated with a new focus? \r\n\r\n\r\nYeah, so  the pages are static, right? So like you build out a page for carpet cleaning boy, right? That's static and like largely doesn't need to be updated all that often the blogs like we do post blogs and that'll go up weekly or monthly depending on the level of content.  Talk a little bit about the economics of the business.\r\n\r\n\r\nHow do you acquire customers? What does it cost you to acquire those customers? And what's like the lifetime value of those customers? Up until a couple of months ago, I continued only acquiring customers through cold calling.  That was just the only method. And frankly, like up until  a month. Month and a half ago.\r\n\r\n\r\nI wasn't even planning on being in this business full time. You know, I'm like, Oh, this is just running. I'm just going to like go buy businesses. So a lot of what you're going to ask me, I'm like, I'm kind of learning a little bit myself and applying some of the things I learned in my MBA program to the business.\r\n\r\n\r\nCost to acquire a customer. I don't have a great number for you. I wish I did. You know, frankly, that cost to acquire a customer would just be like all the costs.  I mean, I pay, I have two cold callers right now. That's what I was gonna ask you. So last February you acquired one customer. How much did you pay that cold caller  for the month of February last year for that month? \r\n\r\n\r\n500 bucks. Yeah, so for that month,  500 bucks to acquire one customer. Right. You could probably easily extrapolate that over the year where it's like, okay, I paid this much in cold calling and these are how, this is how many customers I got. Would $500 to acquire a customer? Sound like a lot or a little to you? \r\n\r\n\r\nDoes that sound like it's in the right ballpark?  No, it's in about the right ballpark. Yeah. Okay. So it's, you know, anywhere, anywhere between like 400 to 800, especially. 'cause now I've got a commission, I've got commission, I pay out to a salesman. Like costs have gone up to acquire customers, and now that you have a benchmark and you're trying out paid ads, you can actually go and say like, oh wow, I, I'm acquiring customer for a hundred dollars  on the paid ad side, but 500 for the cold calling.\r\n\r\n\r\nLet's put some more money onto the paid ads.  And that's what I found with email marketing. We just launched email marketing probably two months ago and are like really trying to ramp it up. I'm going to be able to get it in front of so many more business owners, a lower close rate per person contacted, but more volume, the cost to, yeah, exactly the cost.\r\n\r\n\r\nI'm going to be able to reach my goal in the next 12 months is to reach, you know, 1. 4 million business owners. So 120, 000 business owners every month. And I'm going to be able to do that for about 3, 600 a month. To do that cold calling would cost me about 20 grand.  Sheesh. Okay. That's amazing. I can't wait to check in with you in a year and see if you hit 1.\r\n\r\n\r\n4 million business owners. I know. We'll see. The downside of the email marketing is it costs a lot to get it set up, right? It's not cheap. We're like cold calling is pretty cheap, right? I can pay somebody 500 bucks and they're just going to cold call full time and email marketing. I've tried it a few times throughout the past 18 months.\r\n\r\n\r\nAnd it's like, It didn't work and I like stopped doing it and I tried it again and it didn't work, and I stopped doing it. Like, you gotta have your content, like your copy dialed in, you gotta have your systems dialed in, you gotta be able to send the volume and you have to have good lists. Like it's not as easy as I thought it was gonna be.\r\n\r\n\r\nSo when you acquire that customer, you, like you said, $800 a month was one of the customers that you cited, is that normal? Like, is that at average $800 a month per customer, or what's the average range of a customer? That you have with your agency.  Yeah, I'll actually pull it up. I can tell you exactly what it is.\r\n\r\n\r\nIt's not 800. It will get closer to that. Okay. As I've come in full time, we're making some changes to our pricing. Our average revenue per customer is 382.  Okay, so 382. And how long do your customers stay with you?  There's two parts to that question. So what we found is that like lifetime, I've signed up 188 customers over the life, they last 17 months or whatever, about 33 percent of those customers are no longer customers.\r\n\r\n\r\nSo that sounds like really, really high. You know what I mean? That's like, man, a third of your customers out the door. What I've, as I dove into the data, you know, I'm coming in here full time. Right. So like it was a month ago, I'm like, let me look at how things are going. Anybody that's like, I dove into the data and anybody that stayed longer than a month, if they paid for their second month, that churn rate goes down to 9 percent lifetime. \r\n\r\n\r\nSo I'm like,  which is a much better number.  And what we found out was like, we're losing most of our, like most of our customers that leave are leaving the first month and it's primarily because when they go to cancel whoever they're currently working with, their price gets slashed. Or they get convinced to stay and they're just like, you know what?\r\n\r\n\r\nLike I'm, I'm actually not going to switch. And that was a customer success problem. Onboarding problem. Like we need to be better at retaining those customers. 33 percent over 17 months. Isn't terrible. It's like, what is that? Two or 3 percent a month that you're churning. And so in order to get. Like your current  customers, it would take you, I don't know,  what is that?\r\n\r\n\r\n20 months, two years, essentially. So it's not a terrible thing, but like the thing about SEO that I find difficult is that there's a lag in between the amount of work that you put in and the results. So you like, you may bring on a customer, it may take six months for them or even a year for them to see.\r\n\r\n\r\nThat the changes that you've made to their website are actually putting them first with the Google algorithm. How do you manage that?  It's hard with a lot of the customers we work with. And this is kind of like a product of cold calling, right? Like when you're cold calling, you're primarily getting people that are owner operators because if they're not, they got gatekeepers.\r\n\r\n\r\nTheir job is to keep you from talking to them, right? So a lot of the customers we've signed up have been smaller businesses that are  certainly a little more price sensitive,  but also like, um, They're low hanging fruit in that they haven't done anything online, right? Like I'm not walking into many scenarios where it's like, they've got a hundred reviews and they're fourth on Google.\r\n\r\n\r\nAnd they're like, we just got to get into second or third. And it's like, well, what do we do? Like, we just have to like rebuild some stuff and let time take effect. We're working with people who like, don't even have a Google business profile sometimes. Or like they have one, maybe they have three and they like, they don't know how to get into any of them.\r\n\r\n\r\nAnd it's like, well, let's consolidate. Let's get you, let's get one, let's get you set up. And then they just start getting leads because like you hit 10 reviews. And if like people within a mile radius of your business are like inevitably going to find you because you're there now and you're sending the right signals to Google and you're just like, like the biggest ranking factor in the algorithm is proximity.\r\n\r\n\r\nSo you're always trying to beat proximity. You know what I mean? Yeah. Businesses that are like, I know Utah, so we'll go back to, well, I'm going to stay at Idaho because all I know, Boise and Eagle are the two places I know in Idaho. Um, so let's do, let's do Utah, right? Like if you're in Salt Lake City. And you want to rank in Provo, right?\r\n\r\n\r\nLike 40 miles South, you got no shot because it's just like, you'll never overcome that proximity. And so when these businesses get on board and we're getting set up with Google business profiles, like they can actually start seeing results in a month or two because they're not doing anything. And so that's helpful, but you do end up starting to, you do start to see people that just a little stagnant and, and you're right.\r\n\r\n\r\nIt does take time to really see the real effects. And for us, that comes down to customer  education, right? Customer success and customer education. Like we have to make sure in the sales process, they understand what they're signing up for. We have to make sure that we tell them that again in the onboarding process and remind them of that regularly.\r\n\r\n\r\nLike, This is an investment. Honestly, what it comes down to is it's like people on it. They'll just be like, look, this doesn't work. I'm not getting any leads. Like this doesn't work. And it's really simple. I like, I look them in the eye or I'm on the phone and I actually don't do this anymore, but like, you know, this is the play.\r\n\r\n\r\nYou just tell them like  it does work, right? If you're seeing a business on Google, it's because they've invested in SEO and the biggest companies out there are investing millions of dollars in SEO, the Amazons and the Walmarts and the Nikes and, and like your competitors are doing this. This is like table stakes, almost, you know, you need to be investing in this because if you're not someone else is just going to like jump ahead of you.\r\n\r\n\r\nAnd when you explain it like that, I think they just have to learn. They have to be educated on it. And a lot of these business owners, especially the small ones, feel like they're getting ripped off because We're sending a check out every month and nobody talks to him and nobody tells him what happened.\r\n\r\n\r\nAnd then it gives agencies a bit of a bad name. There's a right way to do it.  Okay, guys, we're going to get back to the show in just one second, but first a message from a sponsor who is, uh, me, Oh, it's me. Cause I'm doing the show for free. Listen, I want to give you a hundred dollars. All you have to do is this.\r\n\r\n\r\nGo to Apple or Spotify.  Give me five stars, write a review, screenshot that review, send it to me, Nick at cofounders. com and you will be entered to win a hundred dollar Amazon gift card. Every four episodes, I am going to choose a winner at random, and I'm going to do this five times, 500 for five stars. I just made that up.\r\n\r\n\r\nThat's what I'm calling it. Please go to Apple or Spotify, leave a review, screenshot it, send it to me, Nick at cofounders. com and you'll be entered to win a hundred dollar Amazon gift card. All right, let's get back to the show. So if I'm just doing like some back of the envelope math, 500 to acquire a customer.\r\n\r\n\r\nIf you're churned 3 percent a month.  Your lifetime value is about 36 months. So let's just say  300 a month, 36, you're at like 15, not 15, probably 12, 000 lifetime value of a customer. That's really, really good return on ad spend. I mean, what are that? 60 times.  But what are your bottom line?  Metrics look like what's profit on  a customer per month is like, are these SAS margins where they're 90 percent or are these service margins?\r\n\r\n\r\nOther service businesses where they're like 20%.  Yeah. So gross margins per customer ranges between 88 and 93%. It might come down a little bit from 88 with some of the stuff we're doing now. I think that I've projected out with some of our new service offerings to get down around like 84%, but also we're going to be charging, like we charge, now we charge like a thousand to 2, 000 a month.\r\n\r\n\r\nYou know, we're not charging 300 a month. Like I, we haven't sold a 300 deal in months and months. So anywhere from. 85 to 92%. So yeah, similar to SAS bottom line. Yeah. Oh, sorry. No, that's gross margin. Bottom line right now for my business has been about 42 to 50, 51%.  Yeah. And that's after, that's after paying myself and like, I'm on salary. \r\n\r\n\r\nThat's after paying myself. So, I mean, that's like true. Now I am, I'm like building this out from the context of like, how do you sell a business? I'm like, I'm just going to bake myself into the operations and report numbers as if I'm an employee. That's smart. And for those who can't tell, James is in Hawaii spending the month.\r\n\r\n\r\nLiving in Hawaii. So  you're obviously doing something right. I'm not in Hawaii. I know you can't,  you can't really see. I don't know if you can see the ocean out that far, but it's out there. You know, I can see the tropical trees though.  Okay. Briefly. Tell me  what's your agency doing per month right now?\r\n\r\n\r\nLike top line.  We just crossed 50 K last week.  Congratulations. That's amazing. She's yeah, no, it's great. It fluctuates like in stripe. We again, dude, you get into a business. I'm like, I've done this  Less than part time for so long. And now I'm like getting into it. I'm like, why does our Stripe MRR not match our like Google sheets MRR?\r\n\r\n\r\nRight. And so like in Google sheets, we're like 50 K, but we have some payments that didn't go through and got to go collect some money like that happens that you do technically still have some accounts receivable, even if you're on a subscription. So we just crossed 50 K and like revenue we should be collecting.\r\n\r\n\r\nWe're probably at like 48 ish. That's like, hasn't had issues. Where were you two months ago? I'm going to pull up stripe here, dude. I'll tell you everything in, in March, we were at 36,  36. Jeez. That's a big jump, man. 36 to 50 in two months. Where do you think you'll be? What's your goal in a year from now? My goal at the end of the year is a hundred K.\r\n\r\n\r\nI don't like the way I've set my goals up. I don't have a 12 month running goal, but I want to be at a hundred K by the end of the year. That'd be amazing. Three years from now, I want to be doing. Uh, 5 million top line,  right? Which would be like double, double, double. I don't know, man. I'm like, I'm in it full time.\r\n\r\n\r\nI still want to buy businesses.  Right. But I'm like, if I'm going to do this, I just don't really have a mode of like, let's just the cashflow and live a great lifestyle. Like I'm like, I'm going to build it and like, build it,  build it, you know what I'm saying? I'm just going to build it. And like, yes, I'm in Hawaii.\r\n\r\n\r\nSo maybe I am like a little cashflow, good lifestyle, but this is more of a gift to my wife for putting up with me for the last few years. We'll see how you feel in a year when you're cash flowing a million dollars a year, how you feel about going and putting it all on black to buy a business.  All right.\r\n\r\n\r\nI have some rapid fire questions for you to wrap things up. You ready for it?  Well, what do you love about this business? I love  just what it's bought me. You know, I just love what it's bought me, buys me the freedom. Like it's everything that I wanted. That I didn't have when I was working at my W2. Yeah. \r\n\r\n\r\nOkay. Which it is. And I love that job. So I, it's just, it's every, it's freedom.  What do you hate about it? I hate that it literally feels like it could fall apart tomorrow. You know? It just does. I tell my wife all the time, I'm like, this could be done. This can be done tomorrow. And I could like.  And in reality, that's probably not true, but it just feels that way.\r\n\r\n\r\nYou know, a lot of entrepreneurs feel that way. A lot of us. I mean, we just feel like, dude, this could just be done tomorrow. Yeah. You know, these three things happen. I'm done. I'm out. Why do you feel that way though? Do you feel like this was just grown really quickly and you're worried that, well, if it grew quickly, it could probably disappear quickly.\r\n\r\n\r\nOr is that just a mentality you've had for  since you're a child? I think it's, I mean, hard to say like back to being a child. I mean, I didn't even know what entrepreneurship was until like seven years ago, so I think. It's a mentality though. It's  never being comfortable and always like preparing for the worst.\r\n\r\n\r\nI guess like, yeah, if I go back to being a kid like my dad and scouting and everything, it's like just be prepared. That's literally the motto of scouting is be prepared. And so am I gonna look out to the future and say we're gonna be at 100k at the end of the year? Like for sure that's my goal, but I better be prepared for it to fall apart.\r\n\r\n\r\nAnd like, I always have a back pocket. Like, what am I going to do when this thing inevitably just, everybody calls me on the same day to cancel, you know, which my wife, my wife is like, she always reminds me like that won't happen, you know, but. But it could, and it feels like it's just that close. And that's a tough, frankly, that's taxing.\r\n\r\n\r\nAnd that's what I hate about it is when, like,  we don't have a massive stockpile of cash in the bank, right? It's, it's massive compared to like where I was two years ago, but I'm not sitting on half a million dollars. If I was, I'd probably feel more comfortable.  I'll check in with you at Christmas. We'll see.\r\n\r\n\r\nWe'll see when you're sitting on a half million dollars at Christmas. What, how do you feel? So segueing from that,  you said you want to buy businesses. And I feel like everybody, every entrepreneur is jealous of somebody else because we all kind of think the grass is greener as you sit here. Like what businesses or what types of businesses are you the most jealous of right now? \r\n\r\n\r\nDigital  info product businesses.  It's just like, you build it once and it's done, I actually know we're rapid firing. Let me give you like my 60 second, like pitch on why I think what's like got my brain kind of turning right now is like, I think that education, now I just came out of an MBA program, mind you.\r\n\r\n\r\nRight.  I think that education over the next 10 years will boom online  and I think that the universities know that and they're like shifting their university education, like getting a degree to online. Right.  And then I think you've got like a, like bottom feeder mentality and like, of course, creators who just build like kind of crappy courses and sell, like, I have a course right now that I've got a beta group in, like of how to start a digital agency and like, they're doing good.\r\n\r\n\r\nThey are like, they're doing, I've got like, you know, a handful of people and they're doing a really good job, but with those courses,  I don't know, it's not a great course.  What makes it not a great course if people are succeeding because of your course?  I don't know what makes it not a great course. It probably is an okay course.\r\n\r\n\r\nTheoretically, what makes a good course? I think what makes a good course is a good teacher and a good curriculum. And so like, that's what the higher education system has, is like good teachers and good curriculum, like curriculum. So actually I taught BYU this past semester  and I had to come up with the syllabus.\r\n\r\n\r\nIt was on acquisitions. I taught it with a buddy of mine, you know, Richie. That was so hard. It was like building a curriculum was so hard  and showing up every week to teach that class and keep the class engaged. It was like really difficult. And so my thesis right now is that over the next 10 years, there will be a gap in the market.\r\n\r\n\r\nWhere people want to upskill  and I know stuff exists around this today, it's not widely distributed enough people want to upskill and they're willing to spend two to 4, 000 for a course, but that course is like professionally done, like professionally recorded with a professional curriculum developed. \r\n\r\n\r\nAnd it's not a university education, but it's not like James in his basement recording a video and putting it up on the course. It's just higher, higher.  And I think that will sell if you combine, like when you combine the high end education with the low, like what the high end education lacks is like the experience of I've done this and now I'm teaching it.\r\n\r\n\r\nAnd that's what the lower level has. It's like, I've done this now I'm going to teach you how to do it. But inevitably people like hold back and they're like, They just aren't good teachers. And so if you combine the two and you say, Hey, here's the experience we've had, and this is why I'm qualified to teach this, and I'm going to combine it with like professional recording, professional curriculum development, and like a high level of engagement, like gamifying, like the education, I think that you'll crush it.\r\n\r\n\r\nI've let you take your rant. Now I'm going to respond to your rant.  I think. By saying what makes a good course is having a good teacher and a good curriculum is articulating what I think is wrong with higher education. That's what they focused on. They focused on the credentials of the professor and they have focused on the curriculum. \r\n\r\n\r\nFor me, the purpose of education is to help people learn  so that they can then,  in my opinion, the way to judge a course is on the results of the students, not On the credentials necessarily of the teacher or the way that it looks or the way that it feels or the way that it sounds, but by whether or not the information that you communicated actually got to the end of the row.\r\n\r\n\r\nAnd the people who you were teaching are then successful. I think everything else that you described as a marketing tool.  Does it look good? Does it sound good? Do they have credentials?  And that's what universities use, right? Like all our teachers all have, our professors all have PhDs from Harvard and, Oh, look at this cool curriculum and look how great the school is.\r\n\r\n\r\nThat's fine. But if the results aren't there and their students aren't performing post course,  what was the point of the course?  Why did you pay the money for it? So  I get what you're saying and I get feeling like, man, my course sucks because it doesn't look good or because I don't have the flashy stuff or whatever.\r\n\r\n\r\nBut if you've figured out a way to convey your knowledge  to them so that they can incorporate it and act on it, then you've got a good course.  And I wouldn't, I just encourage you to not feel like a bottom feeder just because it doesn't look good yet. That's the easy part, man, making it look good and sound good.\r\n\r\n\r\nYou just need a little bit of money and it will look good. But  the curriculum getting communicated to those students and then them being able to act on it, that in my opinion is what Defines a good course. So  I do agree with you though. I do agree that,  that it's a growing industry. There's a lot of people who want to learn, not necessarily in the formal settings, but from people who are selling courses and info products.\r\n\r\n\r\nSo I love it. I'm going to give you a quick rapid fire. What's like a good success rate? I'm like in the thick of this, what would you say results? What's like a good success rate for a student? 25 percent of students being successful, and it depends on how you define success. But what I've seen is like people, they're the big risking courses.\r\n\r\n\r\nLet's assume a course is like phenomenal, great content, great curriculum, maybe still like on the lower end, like take my course, for example, if I get 10 people in there and it's great content, the risk becomes like personal risk, right? Like commitment risk. Right. Are these people paying 2, 000 to get into a course thinking like, that'll be the magic bullet.\r\n\r\n\r\nBut like they realize, Oh, I actually still have to work. And then 50 percent of them don't do anything. So what's a good success rate? I'm going to answer that question.  The short answer is a hundred percent. The long answer is no.  If you want to get to a place where you can actually sell courses, and this is my opinion,  then you need to get to a place where you can afford the production value  to go out and buy a bunch of paid ads to push the course.\r\n\r\n\r\nBut in order to get to the place where you have the money,  you've got to have credibility. So I think when you do your first course,  And you've kept it small, which is awesome. You need to handpick who's coming in  and do go above and beyond to make sure that they're successful. Do things that you're not necessarily going to do on later courses, because you're going to learn  what curriculum you need to add, but you're also then going to have testimonials, hopefully from 10 people that you can throw up on your website and that can say like, James was rad.\r\n\r\n\r\nThis is what I learned from him. This is my company now, and this is what I'm doing that's successful because those testimonials will then feed  the rest of you trying to sell other courses. So, yeah, I mean, I'd love for it to be a hundred percent. I would say above 50 percent to me would be a really, really successful  course.\r\n\r\n\r\nIf half of your students launched a business and they're making a living,  then that's awesome. You have five testimonials of people so that when other people look at James Lincoln, they're like, Oh, James is legit because. I know Freddie did it and Freddie is super successful now. So I would just focus on making sure their experience is exceptional and their results are exceptional and spend more time on it now than you would otherwise do maybe down the road.\r\n\r\n\r\nJust so that you have the credibility to lean back on. Oh, that's interesting. And actually, I think that that would be kind of cool for courses. Maybe I'll like bake this in is like the higher education system. Uh, 82 percent of our graduates like, Left with a job, it's like you boil it down to courses.\r\n\r\n\r\nIt's like, Hey, 46 percent of our graduates, like people that finish this course are making 8, 000 a month, you know?  And then people are going in eyes wide open to say like, Oh, I got a 46 percent chance  of making this work. And it's like, just on me to make it work, you know, not like the course doesn't make it work.\r\n\r\n\r\nI love it. Cause, and then when you start like actually selling it later,  you're coming from a perspective of, I know that this works.  You're not just like a snake oil salesman. You're like, look, I did this. I taught this cohort. This was the success rate. I know if you follow X, Y, Z steps, you have a more than 50 percent chance to be successful  period.\r\n\r\n\r\nAnd then the next time you do a course, you'll have better information to weed out the types of personalities who won't be successful, right? And so then you can sort of select the people who will be successful and have a weeding out process. But I love that answer. Here's a last two questions.  What are you obsessed with right now?\r\n\r\n\r\nIf you have two hours in your day, you don't need to worry about work. You don't need to worry about family. They're gone. You can do whatever you want. What are you doing with those two hours?  I've been like pretty obsessed with fitness lately. Like probably for the past, like seven months. Okay.  So yeah, good.\r\n\r\n\r\nThat's a good answer.  I think that like I'm getting too soft  and I need to like find ways to push myself beyond  what I think I can do. So like I'm training for an Ironman. I want to find some way to simulate like a, like elite military training. I know that there's like places out there you can go, but I just want to put myself through it and be like, can I do this?\r\n\r\n\r\nI don't know. Just like, can I push myself? I'm young enough. Then I'm like, I should be in like phenomenal shape and it'll just make me harder. So that's what I've been obsessed with. That's a great answer, man. Last question. What advice would you give yourself 10 years ago?  Oh, that's funny. You actually just was sitting on the beach.\r\n\r\n\r\nThinking about 10 years ago. So 10 years ago I was on, I posted on Twitter about this, but 10 years ago, I was on a plane coming home from Brazil this month, I came home from an LDS mission in Brazil 10 years ago. And I was like, totally bon dia. Yeah.  I don't speak anymore, so don't, don't test me.  10 years ago, I was like,  so scared about the future, you know, I don't have anything ahead of me.\r\n\r\n\r\nI was just like terrified. And.  I was lacking any sense of perspective in my time, you know, I was 20 years old, I was a kid,  and it was like literally I was like terrified, like I came home terrified on that airplane.  I'm like, this is the peak for me. And then I'm like, I was thinking about this.  It just happened that like 10, 10 years ago this month.\r\n\r\n\r\nAnd I was like sitting on the beach and I'm like, man, if I could look back 10 years to  myself  and like, tell me, Hey, 10 years from, from now, you're going to be sitting on a beach in Hawaii with like your two beautiful daughters and your wife and like, you'll be running a business. I wouldn't have believed it.\r\n\r\n\r\nAnd so I think if I was the advice I'd give myself is just like, be patient, you know, and like, don't stress, just like live your life and be patient and like time. I don't know. I'm still young, you know, 20, 29. Right. So I'll be 30 this year. I'm like, be patient,  be patient. You know,  it's a great work hard.\r\n\r\n\r\nYou still got to work hard, but yeah, be patient. Well, James, this was, this was rad. I'm glad you called in from, from Hawaii. I'm a little jealous, but where's the best place for people to find you? I'm on Twitter X, I guess. I'm on there. You can find me on LinkedIn, find me anywhere. I'm pretty responsive. So yeah, just people can hit me up.\r\n\r\n\r\nThe name of your company again?  Goodly growth. Goodly growth. Okay. Cool, man. Well, this is rad. We'll talk soon.  Okay. Thanks, Nick. Appreciate it, man. I'll let you hop to your other call, but  thank you. That was great. That was awesome. All right. That's it. Another one for the books. I'm fired up. I don't know what else to say.\r\n\r\n\r\nI hope you found something valuable in that conversation. I hope you learned something. I hope there's something that you can apply to your business today, tomorrow in the future that. It makes you money. It makes you more successful. It gives you more time with your kids. If there was something I'd love to hear about it in the comments below, you know, give me some feedback.\r\n\r\n\r\nAnd if you like actionable advice and you want more of this, I write a weekly newsletter that gives insights, tips, and tricks into the world of entrepreneurship, subscribe in my bio.  And if I can help you in any way in your entrepreneurial journey, don't hesitate to reach out to me. Nick at co founders.\r\n\r\n\r\ncom, sorry, Kelly, for more emails. And the last thing is. Remember,  curiosity is a superpower and you can use it to your advantage. As my mom used to say, there's no such thing as a dumb question.  Only dumb people.  We'll see you next time.",
  "metadata": {
    "duration": "",
    "date": "2024-07-29",
    "platform_source": "Google Drive"
  }
}