{
  "episode_number": "246",
  "episode_title": "Costco's Big Secret: How to Buy Everything 90% Off with Shannon Jean",
  "guest_name": "Shannon Jean",
  "business_name": "Reselling/Flipping",
  "transcript": "﻿Nikolas Hulewsky (00:00.736)\r\nAll right, Shannon Jean is one of my favorite people. We're kind of like brothers. We haven't spoken in a while, like face to face, but it's just like, you pick up where you left off. I'm to do a quick intro. So Shannon's a serial entrepreneur. He's been incredibly successful, but he over the last like two years has found this niche of helping thousands of people get into reselling specifically with auctions. And I mean that thousands of people in his mastermind, his $5 a month, stupid mastermind, $5 a month.\r\n\r\n\r\nShannon Jean (00:03.916)\r\nHey, likewise.\r\n\r\n\r\nShannon Jean (00:11.149)\r\nYeah, do it.\r\n\r\n\r\nNikolas Hulewsky (00:29.238)\r\nIt's ridiculous how cheap it is. There's over 1700 people or about to be 1700 people that are a part of that every single month sharing wins and fails learning from each other, etc. And then you probably got thousands of people on top of that who have actually listened to his podcast that had gotten into the flipping game. And today, Shannon is going to walk me through soup to nuts. A deal we're to look at a couple of deals, we're going to do the research on them, we're gonna actually make a decision. He just told me before we hopped on that I didn't prepare enough. And so I don't have a resellers license.\r\n\r\n\r\nShannon Jean (00:54.254)\r\nIt's your fault.\r\n\r\n\r\nNikolas Hulewsky (00:55.458)\r\nSo we'll have to actually like push the button on buying something next time, but we're going to get up right to the point of actually buying something. And then we're going to dive into, we're going to dive into probably the reason 95 % of people fail at this. And it's honestly not knowledge or capital. It's going to be something that you aren't expecting. So you're to want to stick around for the second half of the conversation. So Shannon, without further ado, what did I mess up?\r\n\r\n\r\nShannon Jean (00:59.052)\r\nYeah. Yeah, we'll do part two.\r\n\r\n\r\nShannon Jean (01:16.238)\r\nHey, No, you did. Yeah, all all that stuff is great. I'm thrilled to be back here. It's my second time on your show. I think we did one before, right? But yeah, yeah. But yeah, I mean, it's the reselling auction stuff really took off on X and I've been doing it for so long. I kind of just didn't really think of any big deal like, it just isn't everybody do this. But once I started sharing it like about a year ago, just\r\n\r\n\r\nNikolas Hulewsky (01:25.266)\r\nyeah. Not enough.\r\n\r\n\r\nShannon Jean (01:46.336)\r\nit went crazy. And then, you know, just, I still do. I love it. I, you know, I can't stop talking about it. It's changed my life. I'm sitting up behind my house on the hillside looking down at my house and everything in my backyard has come from an auction. One way or another. Yeah. And you know, like patio sets, pool stuff, this, that, and the other. And so you're, it is definitely life changing. And it doesn't take it. I think it's the most accessible, accessible.\r\n\r\n\r\nform of entrepreneurship there is right now.\r\n\r\n\r\nNikolas Hulewsky (02:18.156)\r\nWell, Chris and I talked about this. We had an episode where we were like, if we had to make a million dollars in six months, or I think that was the number, what would we do? And we gave out all these ideas. think both of us chose auctions or flipping as, the number one way to do it. Now there are caveats to that, but I just think, I don't know of a better entry point into entrepreneurship. You're buying assets that are, that have a known sales price.\r\n\r\n\r\nShannon Jean (02:34.904)\r\ncourse.\r\n\r\n\r\nShannon Jean (02:43.256)\r\nCorrect. You should never buy anything unless you already know what you can sell it for. If that's the number one thing you learned today, and what, there's a couple of big mistakes people make. First is thinking that the product is the most important thing. It's just not. It's the system and your backend and your mind and how you think about it and the research that you do. I can show you how to buy any product every single day at pennies on the dollar.\r\n\r\n\r\nNikolas Hulewsky (02:49.868)\r\nGet the-\r\n\r\n\r\nShannon Jean (03:11.15)\r\nIt's not a big mystery. I share it every day on X. You've seen it every single day. I'm like, good, go buy this. It's, you know, it's $85,000 and it's just sold for, it's going to sell for $3,000. I mean, it's over and over and over. But the mindset is that I just have to buy that. But the key is the other, the second mistake is they, go buy first. They buy with emotion. And then when they go do the math, it doesn't, it doesn't work.\r\n\r\n\r\nNikolas Hulewsky (03:15.148)\r\nYeah, yeah, yeah.\r\n\r\n\r\nShannon Jean (03:40.334)\r\nSo I constantly harp, it's on the back of my t-shirt, not the one I'm wearing, is buy with math, sell with emotion. Not the opposite, or you'll be in trouble. And I see it. I see it our mastermind people. I don't even know who they are. And all of a sudden they come roaring into the chat the first time, say, bought four pallets of this and it doesn't sell. It's not selling and I don't know what to do. That's a disaster. And we want to try to avoid that, right?\r\n\r\n\r\nNikolas Hulewsky (04:07.872)\r\nIt's hard because on the one hand, I feel like if it wasn't for those impulse decisions, I wouldn't have gotten into a couple of entrepreneurial endeavors. You know what I mean? Because it's like, well, at least it got me in the game. But the flip side is as you get farther along, you realize, you buy with math and you sell with emotion. And hopefully that first bet is a low enough risk that it doesn't bankrupt you.\r\n\r\n\r\nShannon Jean (04:17.442)\r\nYeah.\r\n\r\n\r\nShannon Jean (04:28.406)\r\nYeah, that's right. And I'm excited about it too. I'm like, you know, this guy I get totally excited. I can't I can't you know, I like I always say don't watch Netflix watch auctions because that's what I do at night. I sit, you know, chilling out with my family. I'm sitting on the couch. I got my laptop. It's like, what's going on? What's happening? And what should I get, you know, prepared for? What do I need to learn? But the the key is to know we like okay, if you're to look at this product, if you're going to buy patio furniture, you just need to know, okay, where do I live? if I live in\r\n\r\n\r\nUpstate New York, the window on patio furniture is closing, right? Because it's wintertime. So don't buy it there. But if you live in Florida, you should be buying in Upstate New York and sending it bringing it down to Florida because it's going to be 70 degrees for the next three months or whatever. So you just have to think about that stuff.\r\n\r\n\r\nNikolas Hulewsky (05:14.584)\r\nOkay, so you said three things there that I want to hit on before we start actually looking at deals that I think are incredible. The first two are your first two commandments. So if you're listening and you want to get into this, like inscribe these on the walls of your house, wherever you have to like the Notre Dame team that slaps, you know, whatever, be a champion today, put these up on your wall. Never buy anything unless you know what you can already sell it for and buy with math, sell with emotion. So those are the first two that I'm like, I love. And then the third thing that you said was, and you and I have like gone back and forth on this before.\r\n\r\n\r\nShannon Jean (05:29.71)\r\nYeah, exactly.\r\n\r\n\r\nShannon Jean (05:35.854)\r\nThat's right.\r\n\r\n\r\nNikolas Hulewsky (05:45.144)\r\nis you said it's about systems. It's not about a hack. And we went back and forth about goals. And I was like, set your goals. Yep.\r\n\r\n\r\nShannon Jean (05:48.492)\r\nYep. No, that's Yeah, I don't like goals. Yeah, I'm not a goal guy. I'm a systems person. Because I don't do good with goals. I just don't. I just it's like this thing you hang out and I'm just not motivated. I'm motivated by dopamine. Right? I want to feel success every single day. I want to measure and for better or worse, I measure it in $100 bills. Unfortunately. So I want to succeed daily. And that helps me grow to like\r\n\r\n\r\ncreate a flywheel to make more money, right? Because we all have this goal we want to make, oh, I want to make whatever $10,000 a month. Okay, putting that goal out there doesn't motivate me. But when I go, okay, how can I just make as much money as possible each day and improve each day? That motivates me. And I feel better at end of the day.\r\n\r\n\r\nNikolas Hulewsky (06:36.44)\r\nWhy do you manage that though? Because sometimes I will almost use building the systems as a form of procrastination of actually doing something.\r\n\r\n\r\nShannon Jean (06:43.554)\r\nYes. Yeah, you to me it's the I'm looking for the reward. And the way I do it is it's my it's my end of day. Like I don't keep to do lists, but I keep to did lists. So at the end of the day, I want to make a list of what I got done. And if I if I didn't, if I don't put much down, I don't feel very good about my day. And I'll lay there in bed and I'm like, I just suck, you know, and I hate to think that way because it's not good.\r\n\r\n\r\nNikolas Hulewsky (07:01.644)\r\nThat's awesome.\r\n\r\n\r\nShannon Jean (07:12.396)\r\nSo I've learned that if I don't stack up things during the day and check them off, I have a little whiteboard that's on my desk, a little small thing. And I go, okay, I that. did this, I did that, I did this. I feel good. And I walk in and I refresh everything that makes me money. So I'm like, okay, where am I at? Okay. Like now it's like, I want to make a thousand bucks a day. Let's just say that number. like, okay, where am I at? Did I get close? Why didn't I quite hit that? Or what have I got going on? So that's what I do.\r\n\r\n\r\nNikolas Hulewsky (07:40.432)\r\nI love that, to-did list, because it's like this mechanism of what did you actually do? You talked a lot about what you were gonna do. You made your to-do list. I'm gonna do all these things. But what did you actually get done at the end of the day?\r\n\r\n\r\nShannon Jean (07:47.478)\r\nYeah. I don't. Yeah, I don't do it. I'm like, and then I feel bad. But in actuality, what happens with that to do list is I miss a bunch of stuff. So if I set like I track a lot of stuff, I have this AI little thing I wear, right tracks everything I do all the talking and I track it online. I have a thing on my computer. I have it's called limitless. Yeah, it's great. It's awesome. And and then I have the they their software on my Mac and attract so I can just go review the day.\r\n\r\n\r\nNikolas Hulewsky (08:05.368)\r\nWhat do you have?\r\n\r\n\r\nNikolas Hulewsky (08:09.208)\r\nOkay, yeah, yeah, you got the pendant, cool.\r\n\r\n\r\nShannon Jean (08:17.998)\r\nAnd then I'm always like, Oh, I got more done than I thought. I feel good. I want to feel good. It's just like I said, I'm a dopamine hunter. I just can't not do it. And it works for me. You know, so it's but you got it. I will say caveat, you kind of have to have a foundation of, you know, I talked like freewheeling and I can jump around and see it. But you know, I've got a lot more gray hair than probably the people listening here today. So are watching. So I've, you know,\r\n\r\n\r\nNikolas Hulewsky (08:20.695)\r\nYeah.\r\n\r\n\r\nShannon Jean (08:46.304)\r\nrun a bunch of businesses, started a bunch of companies, but, and I had lots of good administrative people around that I'm sure had amazing to do lists that helped me get to this level to where I could just kind of look back at the end of each day. Yeah.\r\n\r\n\r\nNikolas Hulewsky (09:00.104)\r\nI love that. Well, let's let's make sure we have a good to did list by the end of this podcast. I know a lot of people want to jump into the sexy of let's go look at deals right now that we're going to buy. You actually if you're talking to someone who's like, hey, I want to get into flipping. I only have a thousand bucks. The advice that you give them is not which websites to go to and how to get the resellers license. It's exactly talk about that. What do you what do you mean? Don't buy anything.\r\n\r\n\r\nShannon Jean (09:03.776)\r\nYeah. Yep.\r\n\r\n\r\nShannon Jean (09:21.134)\r\nDon't buy, don't buy anything.\r\n\r\n\r\nThe first thing I usually first say I tell people is don't buy anything because yeah, you're not equipped. You're not equipped to buy with math. You don't know the math and you don't have being successful as a reseller takes credibility just like every other business. You don't have any. Now, if you came to me and said, oh, I have this store and I have this shop and I'm I've sold for 10 years on eBay. Well, that's a different discussion.\r\n\r\n\r\nNikolas Hulewsky (09:28.588)\r\nHuh? What?\r\n\r\n\r\nShannon Jean (09:51.79)\r\nBut typically people come and say, hey, I want to be a reseller. I need to make this much money so I can leave my nine to five W-2. And I say, great. OK, well, now we need to do a bunch of homework, a bunch of research. we need to see like your, ask questions like, what's your, can I share my screen? I'll show you what I ask people. Yeah, here. Let me share my screen here. OK. Yeah, yeah, yeah, I've done this, I think. And I need to find, oh, allow.\r\n\r\n\r\nNikolas Hulewsky (10:11.938)\r\nYeah, please, this would be amazing.\r\n\r\n\r\nShannon Jean (10:21.71)\r\nwindow. Okay. So if you're listening, you can't see this. But if you're if you're I call this route, the recombust system, because that's what we do, right? We sell stuff that's most of the time already been sold and returned customer returns. That's where the I think that's where the delta is. So I wonder if can make this a little bigger. Yeah, look at that. Let me see. So this is the I call this a credibility funnel. And this is what I asked. This is my\r\n\r\n\r\nget and teach people when we first start talking about it, because they forget all this. Because if you go spend 10 grand and you don't have any of this stuff behind you, you're gonna have a bad time. It's not gonna work. And so the first one's like your story. What is your noble cause? Why are you doing this? And it's not just making money. It's like, I want to spend more time with my kids. I need to send my kids to private school or I want to retire my wife, I want her to be able to stay home and do that your family or whatever it is, my father's ill and I'm gonna make him this I want to buy my dad a hot rod, whatever.\r\n\r\n\r\nNikolas Hulewsky (10:53.304)\r\nMm.\r\n\r\n\r\nShannon Jean (11:20.236)\r\nThat's a very important part of selling because that really brings people, that narrative brings people to you, right?\r\n\r\n\r\nNikolas Hulewsky (11:26.69)\r\nWell, and if anyone's ever read that book by Simon Sinek, which is start with why he has this famous line he says over and over and over again, people don't buy what you do. They buy why you do it. That's why companies are successful. It's like, what's the why behind what you're doing? So love that start from there.\r\n\r\n\r\nShannon Jean (11:41.806)\r\nThat's it. Yeah, that's your story. And then credibility, like your why should they trust you? Have you been? Are you a member of the community? Are you soccer coach? Do you have? Have you started a business? How you don't have a reputation as a reseller yet. So we have to create one for you and build that first so you can talk and create what I call a credibility statement. And that statement goes in everything you sell. My name is Nick. I've started these businesses. I\r\n\r\n\r\nNikolas Hulewsky (11:51.8)\r\nHmm.\r\n\r\n\r\nShannon Jean (12:10.774)\r\na soccer ref, maybe not a very good one, but I'm with my community. And people read that stuff and they go, I'm going to buy this from Nick, not from some faceless listing or whatever. So it's important.\r\n\r\n\r\nNikolas Hulewsky (12:22.104)\r\nLet ask you a question about this because many people are like, the gurus would be like, you buy a palette, you could sell it on Facebook Marketplace. You'll make your money back in 30 seconds. But the credibility piece, you're talking about reselling at scale, right?\r\n\r\n\r\nShannon Jean (12:30.19)\r\nThat's a lie.\r\n\r\n\r\nShannon Jean (12:35.106)\r\nYes, I want to build an evergreen revenue system here. I don't like the word side hustle, because I think it's kind of demeans what you're building here. I want to build this thing that's going to kick off revenue for as long as you want to put energy into it. So this is why I back everybody up and start here, because the products are the easy part. And it is sexy. The product is very sexy. That's why all these so-called gurus push that\r\n\r\n\r\nNikolas Hulewsky (12:41.624)\r\nMmm.\r\n\r\n\r\nShannon Jean (13:03.074)\r\nthat idea out there. And I talk about it too. Don't get me wrong. I post deals every almost every day on social, because it gets attention. But then I bring him in and I'm like, okay, slow your roll. Now that I got now that I got you watching me. Let me explain this part of it. And\r\n\r\n\r\nNikolas Hulewsky (13:14.328)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (13:19.746)\r\nCause it was back to what we talking about, right? Where sometimes you're so worried on the systems, you don't act, but actually if you act too soon, it's a problem. I err on more of the side of like, you want people to act, like you want to see that motivation and then you can reel them back and be like, okay, okay, I'm glad I got you excited, but let's go back to square one.\r\n\r\n\r\nShannon Jean (13:33.378)\r\nThat's right. Yeah. Yeah, that's right. And these are all there's action steps involved in all of this stuff. I'm like, okay, go go write this, create this, this kind of thing. And the next is like your unfair advantage. Well, what do you know? Who do you know? And what resources do you have at your disposal? Those are all very important to identify before you start any business, but especially this kind of business. Do you have a place to store stuff? What's your financial? Do you want to can you spend\r\n\r\n\r\nNikolas Hulewsky (13:53.218)\r\nMm-hmm.\r\n\r\n\r\nShannon Jean (14:01.038)\r\nyou know, five grand or do you only have $500? You know, do you have expertise? Are you do you work in a lab? Do know lab equipment? Because that's a huge one. Are you a restaurant person? Because I can show you how to make millions of dollars selling restaurant equipment? Or are you a fashion person? have a you know, that that kind of stuff is has to be identified to make you know, I'm trying to build confidence with you. And so you know that, oh, I've you know, I have a woman that sells\r\n\r\n\r\nNikolas Hulewsky (14:17.77)\r\nYeah, this is really good.\r\n\r\n\r\nShannon Jean (14:29.236)\r\nluxury that I've been coaching for, you know, almost a year. And she's worked in all these industries. And I'm like, great, we're gonna tease that out. And we're gonna talk about that. And so that this side is, is it's kind of soft, but it's\r\n\r\n\r\nNikolas Hulewsky (14:43.128)\r\nWell, it's really no, this is so good. This is really interesting. This almost exactly mirrors what I go through with entrepreneurs when they want to get into entrepreneurship, where it's like, okay, why are you getting in? What's your credibility and what's your unfair advantage is translated to like, why are you getting in? What do you know? What's your experience? What do you like to do? It's like that, you know, that Japanese Ikagi, which is like things you're passionate about things, the world will pay for.\r\n\r\n\r\nShannon Jean (14:52.526)\r\nIt's the same.\r\n\r\n\r\nShannon Jean (15:01.869)\r\nMm-hmm.\r\n\r\n\r\nShannon Jean (15:05.964)\r\nYeah. Yeah, exactly.\r\n\r\n\r\nNikolas Hulewsky (15:10.722)\r\nthings that you're good at and that sort of overlaps to where you should actually be spending your time. I think, so this, this applies not, not only just to flipping, but to a reselling, but to entrepreneurship in general, but that unfair advantage thing is so important because people think, I'm getting into, you know, liquidating reselling. What does my engineering experience have to do with anything? It's like, well,\r\n\r\n\r\nShannon Jean (15:25.25)\r\nIt is.\r\n\r\n\r\nShannon Jean (15:32.406)\r\nYeah. that's huge. Correct.\r\n\r\n\r\nNikolas Hulewsky (15:34.616)\r\nLet's think about it. Maybe you know somebody in that space. Maybe you know a certain product spec better than anybody else. Like there's something in there that you are better at or know more than 99 % of people. Let's exploit that.\r\n\r\n\r\nShannon Jean (15:44.066)\r\nYeah. And trying to figure it out on your own can be challenging, right? So it's great to talk to other people and come up with this stuff and it works out good. And then the follow up is tools and resources. software, what other things do you have to have? It's identifying these things that you need to be successful. Pretty straightforward. Second to last, your presentation. Are you comfortable behind the camera?\r\n\r\n\r\nNikolas Hulewsky (15:48.888)\r\nMm-hmm.\r\n\r\n\r\nShannon Jean (16:10.926)\r\nDo know how to do time lapse videos? And they look at me like, why would I need to do that? Like, well, because social commerce is the way the world works now. So are you comfortable sticking the phone in your face? Most people are not. So we ease them into that because we want you to be on camera because they want to buy from Nick and Shannon, you know, that kind of thing. They want to see where this stuff is and stuff. It's really important. Your verbal appeal, what everything looks like. Do you know how to take great photos? If not,\r\n\r\n\r\nWe got to fix that. Do you have the right equipment? Your presentation is everything. Super, super important. And lastly, what everybody forgets, but is crucial, is what do you know about customer service? Because every business is the customer service business, right? And if you don't do good customer service, your flywheel that you're trying to build here is gonna come to grinding halt because people are gonna leave you terrible reviews.\r\n\r\n\r\nthey're gonna not spread the news of how great you treated them. Doesn't matter how good the deal is. When the problems arise, cause they will, if you don't understand customer service and how to thrill your customers, cause you know, people want Walmart prices and Tiffany service and you've got to kind of maneuver, how do you operate in there? you know, they do dude. I want it too. I always want the great, I just have, yeah, I just.\r\n\r\n\r\nNikolas Hulewsky (17:26.2)\r\nThat's awesome. People want Walmart prices and Tiffany's service. That's freaking great. So good. Yeah.\r\n\r\n\r\nShannon Jean (17:35.054)\r\nI'm saying we're all the same. So this is the when I you back everybody up. You work on this first, you build this this circular thing, this flywheel and and then you start researching product or you can do it at the same time concurrently. But you can't run out and buy a pile of stuff because you it's 10 % of MSRP.\r\n\r\n\r\nNikolas Hulewsky (17:57.41)\r\nThis is what I'm looking at here is like, look, you are serious about this and you want this to actually be something to replace your income or to go into entrepreneurship or to pay for that addition that's gonna help your mother-in-law move in or that's gonna send your kids to college, this is what you need to do. If you just wanna go flip stuff on Facebook Marketplace, fine, go whatever, go buy stuff and resell it. Yeah.\r\n\r\n\r\nShannon Jean (18:15.726)\r\nYeah, it's different. Yeah, make a couple grand a month, no problem. But you will be frustrated in many levels. I you know, there's no doubt about it. And your customers will be frustrated if you don't understand this.\r\n\r\n\r\nNikolas Hulewsky (18:27.948)\r\nHow long does this process usually take somebody?\r\n\r\n\r\nShannon Jean (18:31.454)\r\nUh, yeah, it depends on how, how quickly they and what their background is. Um, I would say a month to three months. Yep.\r\n\r\n\r\nNikolas Hulewsky (18:31.564)\r\nI know it depends, but just like...\r\n\r\n\r\nNikolas Hulewsky (18:40.13)\r\nOkay. Okay. So once they have their positioning, let's call it, then it's really about setting them loose and giving them the tools of like.\r\n\r\n\r\nShannon Jean (18:47.5)\r\nYeah, and they could be as you're as you're working on this stuff, as you tell people, they're researching looking at auctions, getting look at this thing. And you're getting excited, excited as well. But and you may be halfway through here and go, Yeah, that looks like a good deal. You should go buy that. But in the meantime before it, because it's got to ship to you, and you got to get it and you got to prepare it. Because some of this stuff you can't, like visual the presentation, everything you need some stuff to take pictures of, you know, and I tell people, just walk around your house, go get some stuff to sell.\r\n\r\n\r\nAnd if you're not comfortable, just turn your camera on and I'll tell you what's that thing in the corner because everybody has stuff to sell.\r\n\r\n\r\nNikolas Hulewsky (19:21.408)\r\nYeah, that was one of my favorite things that you say is like, go sell something first. Don't buy it. Just go around your house and like list it. See how you like the customer experience. Like, did you actually post good pictures? Did you get good hits? Did you understand how you're actually going to get it to the end user? I think that's really good advice for people.\r\n\r\n\r\nShannon Jean (19:25.506)\r\nYeah, don't, don't buy it.\r\n\r\n\r\nShannon Jean (19:36.332)\r\nYeah. Yeah, how does it because you don't know if you even like this. Don't go spend thousands of dollars. You're like, I don't really enjoy this. Like, like Facebook Marketplace is a huge resource for people in my mastermind that they sell and they love it. But quite frankly, I don't really I don't want people coming to my house. I just this is not my thing. So I'm an online seller. I want to ship on eBay Poshmark. I want to sell on my website. I want to do whatever. But there are people, you know,\r\n\r\n\r\nNikolas Hulewsky (19:41.665)\r\nYeah.\r\n\r\n\r\nShannon Jean (20:06.028)\r\nkilling it. And I'll share the information with you here as we as we go through this that love Facebook marketplace.\r\n\r\n\r\nNikolas Hulewsky (20:12.66)\r\nOne of my favorite things that you say, don't watch Netflix, watch auctions. Like I've heard you say that now a couple of times, dude, stop scrolling, stop scrolling Instagram, go scroll auctions.\r\n\r\n\r\nShannon Jean (20:18.688)\r\nIt's true, dude. I say it every day. You're wasting your time. Yeah, look at auctions. It's just as fun. You'll see it. Once the math you start looking at the math, you just be like, my gosh, that's crazy. You know, and then that should motivate you to build the system. Right? It because it's endless. All that stuff we just talked about. People get that and they're like, I can't go by this thing. Like, yeah, you can. But let's just ease into it and\r\n\r\n\r\nNikolas Hulewsky (20:32.469)\r\nRight.\r\n\r\n\r\nShannon Jean (20:48.536)\r\nbuild that support because it's not easy. It's a simple business, but it's not easy. You gotta get your hands dirty and you're gonna solve lots of problems. mean, there's just like any business, right? And if you're not prepared, it's bad.\r\n\r\n\r\nNikolas Hulewsky (21:01.176)\r\nWell...\r\n\r\n\r\nI think, can't remember what the saying is, but there's some saying that's like bullets then cannons, which is basically like, hey, sure. Like let's say you're about to jump into this and you're like, well, how do I do all this stuff first? It's like, yes, you do have to do this stuff, but like, sure, go spend a hundred bucks or go spend 200 bucks doing something, but don't spend 40 grand on a pallet before you've even done that part of the job.\r\n\r\n\r\nShannon Jean (21:08.462)\r\nYeah, that makes total sense. Totally.\r\n\r\n\r\nShannon Jean (21:16.206)\r\nYes.\r\n\r\n\r\nShannon Jean (21:20.512)\r\nYeah, right. Whatever. I'll share some deals here that you could be like, go ahead and buy it, you know, but no.\r\n\r\n\r\nWell, I'll tell you that I just had a call with a great guy, super smart, and he got caught up in the motion. He was going to spend nine grand. That was his ceiling on this deal. And he didn't use my bid and walk away. And he wound up spending $34,000. And he bought, And it was not anywhere near worth $34,000. So I was trying to help him.\r\n\r\n\r\nNikolas Hulewsky (21:46.524)\r\nno.\r\n\r\n\r\nShannon Jean (21:57.42)\r\nyou know, back himself out of that bad decision. And I hate to see that because it's very, it's avoidable. It's about Yeah, it definitely happens. Yeah. Yeah, let me show.\r\n\r\n\r\nNikolas Hulewsky (21:57.528)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (22:03.21)\r\nIt happens. Yeah, dude, it definitely happens. Let's see some of the sites. want to see like, what are your favorite sites to go to for first time? Flip.\r\n\r\n\r\nShannon Jean (22:12.482)\r\nYeah, I love first place. I always tell people that they should learn from is Costco. You should buy their Yeah, you should buy Costco stuff. You should buy Costco excess inventory and store returns and customer returns because they sell Costco sells $250 billion worth of stuff a year. You know, e commerce returns are 20 to 30 % from every company. And they need to move this product. Their number one thing is they have to sell and\r\n\r\n\r\nNikolas Hulewsky (22:19.544)\r\nCostco.\r\n\r\n\r\nNikolas Hulewsky (22:26.314)\r\nOkay, so.\r\n\r\n\r\nShannon Jean (22:43.746)\r\nCostco will let you buy this stuff.\r\n\r\n\r\nNikolas Hulewsky (22:43.768)\r\nWell, they're effectively offloading the carrying costs onto you, right? Because they're like, we can't carry this inventory anymore, sure. If you think you can sell it, we know it's going to take six months. If you have six months, cool. Take this off of our hands. I just returned this couch that my wife ordered to UPS, and we didn't pay anything extra for shipping. And I just remember thinking, how does the math work on something like this? But anyways, that's a whole other story.\r\n\r\n\r\nShannon Jean (22:48.034)\r\nCorrect.\r\n\r\n\r\nShannon Jean (22:54.05)\r\nYeah, that's right.\r\n\r\n\r\nShannon Jean (23:06.23)\r\nYeah, yeah, no, no, I could. Yeah, it's it's it's different. But like this is I've let's jump into some of these like it again, if you're listening, I'll talk it through. But otherwise, go watching on YouTube. But like this is a Costco deal. It's these are customer returns. It's 3000. I'm at I'm at if you want a list of every site I'm going to talk to, just go to Shannon Jean dot com slash auctions. That's all you got to do. And you can download the entire list. This is there's a\r\n\r\n\r\nNikolas Hulewsky (23:23.34)\r\nWhere are you? What site are you on? I'm sorry.\r\n\r\n\r\nNikolas Hulewsky (23:31.8)\r\nOkay. Okay.\r\n\r\n\r\nShannon Jean (23:35.722)\r\na platform called B stock. They are one of the larger ones. There's there's another one liquidation.com there's a bid spotter, there's a bunch of sites that kind of aggregate companies, but B stocks probably the largest. And Costco sells their excess inventory and their customer returns through B stock. So does Target. So does Kohler. So does Granger. It's about 80 companies that sell up here that you should go get registered for that all you need is a resale permit.\r\n\r\n\r\nNikolas Hulewsky (23:44.812)\r\nthat do this.\r\n\r\n\r\nNikolas Hulewsky (23:52.31)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (24:03.224)\r\nWow.\r\n\r\n\r\nShannon Jean (24:05.054)\r\nAnd if you need that, just let me know. Come find me on Nexon.\r\n\r\n\r\nNikolas Hulewsky (24:07.35)\r\nAnd if I'm sitting down and I'm like, I'm not watching Netflix tonight. I'm looking at auctions. I pull up B-stock. And then is there something else I pull up just to start like getting familiarized with what the market price is or what I could resell it for? Does that make sense what I'm asking?\r\n\r\n\r\nShannon Jean (24:20.502)\r\nYeah, the market. So if you pull up like this pet supply deal that we're looking at right now, you should go look at Facebook Marketplace because these are big items. Okay, so you're to go look you're to look at the manifest. One of the rules is that you never buy anything without a manifest. Let me say that again, never buy anything without a manifest unless you are like a bin store or it's something but especially in the beginning, you don't know enough to buy without a manifest.\r\n\r\n\r\nNikolas Hulewsky (24:47.256)\r\nSo for really stupid people who don't know, I know what it is, but like what is a manifest?\r\n\r\n\r\nShannon Jean (24:51.532)\r\nYes. It's basically a spreadsheet that lists everything you're going to get on these pallets without that manifest. And there are plenty of deals that are sold. So basically, they have counted this stuff. They've said, okay, we're selling pet supplies. And there are 57 pieces on these many pallets of this is three pallets, two pallets. And in those 57 pieces, these are the items you're going to get. And if you don't have this\r\n\r\n\r\nNikolas Hulewsky (25:18.978)\r\nWow.\r\n\r\n\r\nShannon Jean (25:20.534)\r\nYou can't make a decision like there's this, you know, this big pet enclosure here that's a thousand bucks, thousand forty nine. That's very good to know. There's another one is two hundred dollars, one twenty four. And then, you know, it down.\r\n\r\n\r\nNikolas Hulewsky (25:33.4)\r\nHmm. So it's not all 57 units of one thing. It's 57 units of like onesies, twosie. Okay. Sure. Sure. Okay.\r\n\r\n\r\nShannon Jean (25:39.31)\r\nSometimes, yeah, we're gonna find, I'm gonna show you some that are all one thing. But like in this deal, so the key thing, the takeaway here is that this is $3,800 was a Costco price. Most of the time, I always tell people the retail price is a lie because most retailers discount, right? So always remember that the retail price is a lie. But another reason I like Costco is they're not a retailer, right? They're a club. They only make money on their membership.\r\n\r\n\r\nNikolas Hulewsky (25:55.16)\r\nYou\r\n\r\n\r\nYeah, yeah, yeah.\r\n\r\n\r\nShannon Jean (26:09.43)\r\nIf you look at their earnings, pretty much their entire profit is what people pay for the membership every year. Everything else they sell their markups like 14%. And that just covers all their costs. So you're already buying it at a lower price and they're not marking it down like 50 % like a target or another type of retailer would. So go ahead.\r\n\r\n\r\nNikolas Hulewsky (26:16.28)\r\ncrazy.\r\n\r\n\r\nNikolas Hulewsky (26:30.04)\r\nSo I'm looking at this palette and it's like, all right, the retail price for it is $3,800. And I've gotten broken it out by like on a per unit basis, whatever. How do I, like, do I take that at face value?\r\n\r\n\r\nShannon Jean (26:41.454)\r\nYeah, that's right. And so this auction, you're going to look at market price. You're going to go, OK, how much is this big enclosure? There's some pictures here. How much is this cat thing sell for? Oh, there's dog food in here. What's the story with that? And you look at these pallets, like we can make it bigger. There's dog beds. And this is you're going to go through the manifest. Like these are very expensive cat litter boxes or something like that that do some crazy stuff. There's a lot of stuff here.\r\n\r\n\r\nNikolas Hulewsky (26:48.511)\r\nOkay.\r\n\r\n\r\nShannon Jean (27:10.35)\r\nI don't know anything about pet supplies. Like, I wouldn't buy this without doing a ton of research, so I would know it. But there's a few entry level deals that I just want to talk about. Somebody says, okay, I have less than $500. What do I do? This is 3800 bucks. It's sold for $335. That's what the auction sold for. So now if you're on the East Coast, I wouldn't buy this because it's sold in Arizona. So you want to keep the shipping price as much, you know, as much as you can, cheap as you can. Okay. But\r\n\r\n\r\nNikolas Hulewsky (27:25.624)\r\nHoly crap.\r\n\r\n\r\nShannon Jean (27:38.51)\r\nthe manifest, you would go through it and say, wow, what are these pet safe, cozy up things sell for? Well, you're not Costco, so you're not gonna sell for 125 bucks, but can you sell for half a Costco? I would argue you could probably sell for more than that, probably about 70 % of the Costco price. Not everybody even has a Costco near them, right? So you...\r\n\r\n\r\nNikolas Hulewsky (27:56.344)\r\n$335?\r\n\r\n\r\nShannon Jean (27:59.406)\r\n$335 is what this sold for.\r\n\r\n\r\nNikolas Hulewsky (28:02.264)\r\nThat's insane.\r\n\r\n\r\nShannon Jean (28:03.278)\r\nYeah, so the average price at Costco was $67.97. They just kind of average it divided by, it sold for $5.88 per unit. So let's go to another one. So this is two palettes, indoor games and musical instruments, right? So this is, if you click on this picks, these are, is it air hockey? I think there's a couple of them. And there's a Roland, some sort of piano thing. Okay.\r\n\r\n\r\nNikolas Hulewsky (28:14.178)\r\nHoly crap. Okay. Yeah. Let's go. one.\r\n\r\n\r\nNikolas Hulewsky (28:29.271)\r\nnice piano, yeah.\r\n\r\n\r\nShannon Jean (28:31.81)\r\nThis is the actual pictures. Another great thing with Costco is they're going to show you the actual pictures of the pallets. So you see things in boxes. Always a good sign. OK, we want to see things if they're protected. They're in a box. Here's some of these. Yeah, yeah, we're not gambling. We're taking calculated risk. This is not gambling. We are not in Las Vegas, dude. It's this, you know, OK, so again, this is a small deal. You're not going to make millions of dollars.\r\n\r\n\r\nNikolas Hulewsky (28:45.634)\r\nWe're looking for things that are going to de-risk our bid, our investment. Yeah.\r\n\r\n\r\nNikolas Hulewsky (28:56.248)\r\nYeah, yeah, yeah, yeah.\r\n\r\n\r\nShannon Jean (29:01.71)\r\nOkay, here, and these are, there's only five, six items. There's four air hockey games that are 300 bucks a pop. There's this Roland digital thing that's 1300 bucks and another Roland thing that's $700, okay? So $3,200 is the Costco price and it's sold for $326. So you can find these deals every day over and over and over.\r\n\r\n\r\nNikolas Hulewsky (29:22.9)\r\nCheers.\r\n\r\n\r\nNikolas Hulewsky (29:28.236)\r\nLike, Okay, why did it sell for that cheap? Was it because it was truly that's kind of just the average of what people pay for it? Or was it a certain time of day or like, just from your opinion?\r\n\r\n\r\nShannon Jean (29:37.646)\r\nAll of those things. Yeah, so it closed on the 15th. So it closed yesterday at two o'clock and there was only three bids. You see up here in the little hammer? it's all who does the most research. That's the person that always wins because somebody says, okay, well, I know I could sell these things. They're not worth 3,200 bucks. It's just not, but I would have a hard time thinking it's not worth 1,500 bucks.\r\n\r\n\r\nNikolas Hulewsky (29:48.706)\r\nYeah, yeah.\r\n\r\n\r\nShannon Jean (30:06.412)\r\nMaybe even $2,000 and you're going to pay three, three 26 plus some shipping.\r\n\r\n\r\nNikolas Hulewsky (30:08.6)\r\nSo the last two that we looked at, the purchase price or whatever, the winning bid versus the MSRP, let's call it, was about 10%. Is that normal? what is the typical, is there a rule of thumb where it's like, hey, stay under 50 % or?\r\n\r\n\r\nShannon Jean (30:17.87)\r\n10%.\r\n\r\n\r\nShannon Jean (30:25.016)\r\nThere isn't a rule of thumb, but for Costco, if you can get them landed to you at 20 % of the Costco price, that's including the freight, the shipping, you're very well protected, right? Every deal is different. Like if we look at another one, we're gonna look beyond Costco too, but I wanna show you. Yep, yes you can.\r\n\r\n\r\nNikolas Hulewsky (30:28.407)\r\nHmm\r\n\r\n\r\nNikolas Hulewsky (30:35.16)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (30:41.356)\r\nWell, hold on. Can I look at that Costco one really quick? Was there really only there was only three units.\r\n\r\n\r\nShannon Jean (30:47.882)\r\nNo, there was six units, four air hockey and two different pianos.\r\n\r\n\r\nNikolas Hulewsky (30:51.544)\r\nFour area hockey tables, two pianos. Like I could have just, I could have said like, I need a piano and come on here and cool. Sure.\r\n\r\n\r\nShannon Jean (30:57.836)\r\nRight. It's a great, well, yeah, you got to have your resale permit, to your point, buying something that you could use when you first start is a great way to start, right? Because you're like, well, you know, got two buddies, I can give them the air hockey for their basement and my kid needs a piano in case they don't sell. Because you want to get your spouse on board with this too, that's really important. So it's a good way to do it.\r\n\r\n\r\nNikolas Hulewsky (31:08.682)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (31:16.767)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (31:22.603)\r\nIs it?\r\n\r\n\r\nShannon Jean (31:25.014)\r\nYes, it is. If you're not a seasoned entrepreneur, you won't understand that, but it's really important.\r\n\r\n\r\nNikolas Hulewsky (31:30.04)\r\nThere have to be people who have done this, not gotten their spouse on board, and then all of a sudden their spouse comes home and it's like, why do we have a semi dropping off a pallet?\r\n\r\n\r\nShannon Jean (31:36.43)\r\nWhy can't I park in the garage? I hear it all the time. I hear it all the time. Okay, one last like really like no brainer. This is seasonal arbitrage, right? It's October 16th today when we're recording this, we're getting into fall. In the fall, I always say the best time to buy Christmas trees is in January. It's the same with this stuff. The best time to buy stand up paddle boards and outdoor games and blow up water things.\r\n\r\n\r\nNikolas Hulewsky (31:41.476)\r\nHa ha ha!\r\n\r\n\r\nNikolas Hulewsky (31:48.93)\r\nMm-hmm.\r\n\r\n\r\nShannon Jean (32:05.966)\r\nis in the winter because they don't sell for anything. Right. So this is let's sort this stuff by the highest. This is cave adventure. Four hundred bucks. These are stand up paddle boards. Four hundred dollars. Four hundred dollars. The first like 10, 12 items are two hundred dollars or more. So the Costco price was six thousand dollars and it sold for nine hundred and seventy five dollars. It just sold on the 14th. And so.\r\n\r\n\r\nNikolas Hulewsky (32:17.688)\r\nCheers.\r\n\r\n\r\nNikolas Hulewsky (32:32.607)\r\nTaron. If you were...\r\n\r\n\r\nShannon Jean (32:33.976)\r\nThese are just like three examples of entry level deals that anybody could make money on.\r\n\r\n\r\nNikolas Hulewsky (32:40.278)\r\nAnd if you're a company, if you're just patient, you could buy really cool swag for your employees that you already do on a yearly basis from these auctions.\r\n\r\n\r\nShannon Jean (32:48.802)\r\nThat's true. There's a ton of it. It's exciting, dude. That's why I don't. Yeah, so here's here's. So here's something not to buy. OK, everybody gets excited about consumer electronics. And I will tell you, I was in that business for 20 plus years and it was great and I made a ton a lot of money. But it's brutal. And the first thing you notice is like, wow, OK, this auction ends in six minutes. OK.\r\n\r\n\r\nNikolas Hulewsky (32:51.896)\r\nwas very freaking exciting.\r\n\r\n\r\nShannon Jean (33:17.494)\r\nWe're watching it live right here. The first problem is you have 24 bidders, right? 24 bids. There's 1,661 people watching this auction, which is not a good thing. And the Costco price was 7,600 bucks. I'm sorry, Costco price was about $10,000. The bid is at $7,600 right now. So that's just not good. You shouldn't buy this product.\r\n\r\n\r\nYes, you can sell it often if you have credibility in the marketplace. If you are in this business already, you can probably sell more, sell it for more than Costco did because Costco discounts it, But stay away from consumer electronics. It's just, you're not going to, you're not gonna have a great experience no matter how many I tell people.\r\n\r\n\r\nNikolas Hulewsky (33:48.151)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (34:02.808)\r\nWell, it's just typical market dynamics, right? The more buyers that you have, the harder it is going to be for you to make money because it's just going to work its way down to basically break even.\r\n\r\n\r\nShannon Jean (34:11.299)\r\nYou got it.\r\n\r\n\r\nThat's right. You're right. So stay away from that stuff. I also don't like vacuums. Even though Dyson is totally cool. Don't buy vacuums. It's a problem. They're just not going to be in good shape and you're going to have a hard time. I don't like exercise equipment, but there are people in our mastermind that do really well with exercise equipment, especially with January. Now is the time to buy exercise equipment so you can sell them in January because that's when all of us think that we need a new treadmill or a rowing machine or whatever. And you can buy, you know,\r\n\r\n\r\nNikolas Hulewsky (34:31.16)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (34:40.076)\r\nYeah.\r\n\r\n\r\nShannon Jean (34:43.584)\r\nmassive amount you can buy exercise equipment for next to nothing i mean it's very very inexpensive and if we go to costco see if i can pop in real quick we'll do a little yep\r\n\r\n\r\nNikolas Hulewsky (34:54.84)\r\nWell, the nice while you're looking for that, the nice thing about the marketing industrial complex is that there's always another holiday. Like, you know, if we miss Christmas, then we've got Valentine's Day and then we've got Easter and or actually St. Patty's Day and then Easter and then, you know, whatever.\r\n\r\n\r\nShannon Jean (35:01.687)\r\nYes. Yes.\r\n\r\n\r\nShannon Jean (35:09.23)\r\nYes, you got it. Yep. So like just just a quick example. Like here's here's this $5100 worth of exercise equipment. It's it closes in 43 minutes. And the bids at 150 bucks.\r\n\r\n\r\nNikolas Hulewsky (35:25.766)\r\nWhat the f- How many people are watching it?\r\n\r\n\r\nShannon Jean (35:26.99)\r\nThree.\r\n\r\n\r\nNikolas Hulewsky (35:30.055)\r\nmy gosh. So it's not like, whoa, dude.\r\n\r\n\r\nShannon Jean (35:31.234)\r\nRight? Yeah, here's $7,600 worth of exercise equipment, six pallets. It's going to close in 21 hours, but the bid is at 50 bucks. Because it's hard to deal with this stuff, right? It's heavy, it's bulky, it's kludgy, some stuff's going to be broken. you know, can make, you know, people make good money on it. But what I find is people buy it because it's cheap, and then they go, yeah, you know, I made money on it, but I'm not going to buy it anymore. Right.\r\n\r\n\r\nNikolas Hulewsky (35:44.14)\r\nYeah.\r\n\r\n\r\nShannon Jean (35:59.586)\r\nbecause it's a lot, it's a lot, it's heavy. It's a lot of work. So let's go away from Costco for a minute and talk about Footlocker. So Dick Sporting Goods, they bought Footlocker and Dick is clean in house. whenever that's one thing to take advantage to keep an eye on acquisitions in this, the retail space is anytime a company buys another company, they're gonna go through and be like, okay, we gotta get rid of all this excess inventory.\r\n\r\n\r\nNikolas Hulewsky (36:00.856)\r\nThis is a lot of work. Yeah, it's.\r\n\r\n\r\nShannon Jean (36:27.086)\r\nAnd what do do with it? Well, they look they liquidate the auctioned off. So you know, this stuff is it's these auctions are not closing for three days. But they're sitting they typically start them at about 10 % of the retail price. Remember, the retail price is a lie. So I like to just cut it in half. So like on this first auction, or second auction years, the footlocker price is about $20,000. So I cut it in half, say, okay, let's say it's worth 10 grand. Well, the bids it, you know, starting bids at 2100 bucks.\r\n\r\n\r\nCould you sell it for 10 grand? Maybe. So you have to do your research and then you could bid and say, okay, well, if I can, if the shipping's a thousand bucks and the bid's at $3,500, okay, so the max, or I can bid 35, 45, would I be happy making $3,500 profit? If you're happy making that, you go enter that bid and walk away. Don't sit there and watch it.\r\n\r\n\r\nNikolas Hulewsky (36:59.49)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (37:17.656)\r\nI would think that shoes would be hard. Like just because there'd be so many in order like.\r\n\r\n\r\nShannon Jean (37:23.884)\r\nThe way you yeah, the way you sell shoes is live selling. It's way better. You use whatnot, Poshmark live selling eBay live selling. So you don't have to handle every single item and like take photos and create listings. We have a whatnot seller in our mastermind that they sell about a pair of shoes every 60 seconds. And so he'll do a two hour show and blow through 120 pairs of shoes.\r\n\r\n\r\nNikolas Hulewsky (37:29.47)\r\nNikolas Hulewsky (37:33.944)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (37:50.52)\r\nWell, and this might be one of those things where you're like, hey, if you know you don't like being on camera and that's not something that you enjoy doing, don't ever buy shoes. Stay away from things that sell really well in those environments.\r\n\r\n\r\nShannon Jean (37:56.866)\r\nYeah, or.\r\n\r\n\r\nCorrect. Or reach out to companies that sell shoes, other resellers and say, okay, what would you pay? Here's the manifest. I have access to this product. I'm a liquidator. If you're interested, let me know your price and work the deal backwards. You could do this with anything, apparel, flooring, I mean, anything, anything at all. This is Kohler. It's one of my favorite. They don't have any live auctions, but these just recently closed.\r\n\r\n\r\nNikolas Hulewsky (38:04.814)\r\nright, okay.\r\n\r\n\r\nShannon Jean (38:27.296)\r\nAnd the reason why I really like him is because everybody needs a showerhead. Every house has sinks, every house has faucets. It's super boring, but boring products can make you rich. No doubt about it.\r\n\r\n\r\nNikolas Hulewsky (38:33.41)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (38:36.824)\r\nAnd I'm guessing they don't go out of style really quickly. So even if you don't move it today, like shoes potentially change styles. Yeah.\r\n\r\n\r\nShannon Jean (38:42.552)\r\nshoes big time. Yeah, shoes are style. Yeah, style thing. But like this is stuff they sell at Home Depot or, you know, people come in, I need a faucet, I need this. the another reason I like it is because it sells, you know, really cheap. Here's 72,000 worth of shower heads and hand showers that sold for $3,600. Okay, so you have a lot of room to make mistakes. And you will make mistakes. But mistakes are tuition.\r\n\r\n\r\nRight? You're going to start off and to your point, bullets instead of bombs or whatever you said. That's right. You're going to, yeah, you're going to make small mistakes and you're like, oh, I spent 3,600 bucks, but are you going to lose money when you have, you know, 495 things to sell? I don't think so. Even if you sold them at 10, know, even if you sold them at eight bucks a piece, you're going to get your money back. Right. So that that's what I love about these, these, these kinds of deals. Right. Yes.\r\n\r\n\r\nNikolas Hulewsky (39:12.834)\r\nYeah, bullets, cannonballs.\r\n\r\n\r\nNikolas Hulewsky (39:29.368)\r\nto.\r\n\r\n\r\nNikolas Hulewsky (39:33.544)\r\nOkay, let me ask you two questions. The first question is your newsletter. Is that a personal newsletter or do you have a newsletter that's like, hey guys, just giving updates of this company's buying this company, go check out that liquidation or this holiday is coming up, here's something to pay attention to or X, Y, Z happened. Cause I feel like that there's a lot of current events that will just happen that I wouldn't even think might play into this. And you, since you've been doing this for 20 years are like, oh,\r\n\r\n\r\nHere are the downstream effects of how this could work. Do you do any of that stuff or no? You do.\r\n\r\n\r\nShannon Jean (40:02.956)\r\nYep. Yeah, I do that in my news that I talk about all the time. Like when I read about lovesack closing a bunch of their stores. And I was like, you watch and sure enough, within I don't know, maybe not 30 days 45 days, they were they were auctioning off tractor loads trailer tractor trailer loads full of demonstration lovesack couches. And everybody was excited about it. So same same kind of thing you see all the time. And\r\n\r\n\r\nSo yeah, you can get shannonjean.com slash subscribe. And we've got about 6,000 people on that list to get that newsletter once a week.\r\n\r\n\r\nNikolas Hulewsky (40:38.21)\r\nOkay, I wanna thank you for showing all those auctions. I kinda wanna move toward to talking about what I think is, and this is my theory, I wanna get your opinion on it. I think that 95 % of people who launch these types of businesses fail for one reason, and it's because they don't have support. because it's hard, right? Like you're out there, you're by yourself, and it's, and.\r\n\r\n\r\nShannon Jean (40:43.106)\r\nYeah.\r\n\r\n\r\nShannon Jean (40:51.478)\r\nYep. Let me stop sharing.\r\n\r\n\r\nShannon Jean (40:59.619)\r\nYeah.\r\n\r\n\r\nIt is very hard.\r\n\r\n\r\nNikolas Hulewsky (41:05.334)\r\nbecause they don't have support, it's then easy to quit. If I buy a business and I signed an SBA loan, quitting means I go bankrupt. But if I, right. But if I buy some stuff off of a pallet, like I could give up fairly easily, because the downside is low. And I think one of the superpowers that you've had is you build community wherever you go. And that's what I enjoy doing as well, is there's like this built-in mechanism for.\r\n\r\n\r\nShannon Jean (41:12.543)\r\naccountability built in right there.\r\n\r\n\r\nShannon Jean (41:22.968)\r\nCorrect.\r\n\r\n\r\nNikolas Hulewsky (41:32.874)\r\naccountability, you're learning from other people, you see wins, you get motivated, et cetera. And I think that like 95 % of people fail because they just don't have a support network in place. True or false?\r\n\r\n\r\nShannon Jean (41:44.652)\r\nYeah, I don't know what the I think it's true. I don't know what the percentage is, but it is high. Because, you know, you're right, there's no accountability. I like, you know, the the spouse part where you fill your garage up with pallets and then you're what you know, your husband or wife are like, Okay, dude, what do you I tripped over these things, these pressure washers today? What's going on? That that's a big motivator. But yeah, I and I would say I probably didn't realize how important\r\n\r\n\r\nNikolas Hulewsky (42:01.089)\r\nYeah, that.\r\n\r\n\r\nShannon Jean (42:12.718)\r\ncommunity was until I started my $5 reseller mastermind and how fast it grew. was like, holy smokes, right? Because, you know, we've got just about 1700 people in there now. And it the stuff that's happening in there is mind blowing on the network effect and how I just see the support. It's not me getting up there and like, you yeah, I do workshops and I teach and all that kind of stuff. But it's like everybody else. It's like, oh, Nick Guy and\r\n\r\n\r\nFlorida, bought these and I got this problem and these couches showed up and I'm missing these feet. What do I do? And then it's Joe from Arkansas says here, you can go buy couch feet from this company and put it together and let me show you how to fix it. Or you know, on that pressure washer that leaks, all it takes is this 75 cent little washer that you put in there and it fixes that problem. And it's just problem solving and identifying opportunities. It's just huge. And how do I do this and what works?\r\n\r\n\r\nNikolas Hulewsky (43:07.896)\r\nWell, I've seen a couple of guys, I've seen a couple of guys on Twitter. can't remember his name, but he was like, all right, I'm trying, I'm going to try reselling. And he was like tracking it by month. And, and, and this month their goal was to sell like $2,500 worth of stuff. And he, it might've been September. can't remember. Joe pool. That's it. That's it. and he was like, guys, it's the 12th and I've already hit my goal. Like, what are we doing here? It's like to see, okay, you found it.\r\n\r\n\r\nShannon Jean (43:20.428)\r\nYeah, this is I think I yeah, it's Joe pool. It's Joe pool. Yeah.\r\n\r\n\r\nShannon Jean (43:34.54)\r\nLook, I'm going to show you this.\r\n\r\n\r\nNikolas Hulewsky (43:37.558)\r\nJust to see the traction and the feedback of, this actually works? Holy crap.\r\n\r\n\r\nShannon Jean (43:37.75)\r\nYeah. I love it, dude. Yeah. Yeah. So this is this is Joe pool. This is our this is our mastermind. He's like, Hey,\r\n\r\n\r\nNikolas Hulewsky (43:47.734)\r\nBy the way, just wanna clarify. I'm not a part of this. Shannon's not paying me. This isn't like a pitch. I just think that this is, yeah, I just think this is really cool.\r\n\r\n\r\nShannon Jean (43:52.238)\r\nNo, no, we're just I'm just talking about you. Yeah, Yeah, come join. It's five bucks. It's $5. So I mean, if you want to learn about you don't have to pay five bucks to learn about it. You can just go on X and I talk about it every day, you know at Shannon Jean. But if you really want to get into it and make some money. But like you know here, our goal for September was $1500 and you know they hit their that was in September their midway they hit their you know hit their goal and he's sharing his profit.\r\n\r\n\r\nNikolas Hulewsky (43:59.16)\r\nI know, it's stupid. Stupid.\r\n\r\n\r\nNikolas Hulewsky (44:21.688)\r\nyeah, this is the screenshot. Yeah, yeah, yeah, yeah.\r\n\r\n\r\nShannon Jean (44:23.084)\r\nYeah, so they did. His goal was like 1500 bucks and they sold $7900 worth of and made $4300. And it's a young family. And they're like, you know what, we're doubling down because he wants to quit his job. And he's like, I know how much I have to make I do this, this kind of thing. It's awesome. And he's like, I hope this helps anyone else out there.\r\n\r\n\r\nNikolas Hulewsky (44:32.247)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (44:35.64)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (44:40.374)\r\nWell, in the coupe and the cool part is he probably my guess is he won't be a reseller for the rest of his life. Maybe he will be, but he probably won't be a reseller for less for life. Boom. That's it. He got into entrepreneurship. He's going to learn. He's going to meet a bunch of people. He's in the game now and now opportunities are going to come his way that weren't even there before.\r\n\r\n\r\nShannon Jean (44:48.342)\r\nNo, you learn entrepreneurship.\r\n\r\n\r\nThat's it.\r\n\r\n\r\nShannon Jean (44:56.364)\r\nYeah. All those people on exit he's sharing his story with and like, if you look at the it says reseller mastermind, the community for entrepreneurs. is reselling is is the the fund the crazy the accessible part of it. But we're teaching them how to be entrepreneurs and how to take calculated risks and how to go through and you know. No, this is on Kajabi. I hosted on Kajabi. Yeah, it's way more robust. I had to get\r\n\r\n\r\nNikolas Hulewsky (45:14.487)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (45:18.304)\r\nIs this on X? What am I looking at? Okay, okay.\r\n\r\n\r\nShannon Jean (45:24.908)\r\nI had the first hundred people I did on X and I was like, we got to get out of here. But I just couldn't do it. But like here's a guy who, you know, he's like, hey, he bought this big red truck on govdeals.com, tons of great stuff. And he's like, well, I bought it for like, you know, $4,000 because it has a $4,000 welder that's strapped to the top of the truck. Right? Like, well, that's pretty interesting. And then he drove it home, posted in the mastermind, sold it the next day, made $4,000 profit. Right?\r\n\r\n\r\nNikolas Hulewsky (45:44.76)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (45:52.812)\r\nDude, the Gov auction one, like you're posting like fighter jets the other day. What the freak? What are we doing?\r\n\r\n\r\nShannon Jean (45:55.022)\r\nDude. Oh, I love it. You helicopters, blackhawks. I love you can buy anything. It's awesome. Yeah, it's. Yeah, this is another one I love. This is so great. This is Mindy. She she got in here and she bought two pallets of books on Gov deals. She bought the two pallets for $1. And she made $5,000 in sales on eBay with that two pallets of books. It's amazing.\r\n\r\n\r\nNikolas Hulewsky (46:01.89)\r\nDude, if I was in the Taliban, they would have just given it away for free to me, but you know, gotta, sorry.\r\n\r\n\r\nNikolas Hulewsky (46:18.466)\r\nThat's right.\r\n\r\n\r\nNikolas Hulewsky (46:23.116)\r\nHmm. Dude, that's insane. That's so funny. It's like the dopamine trick, right? It's like, hey, just get in, and now you're hooked.\r\n\r\n\r\nShannon Jean (46:25.806)\r\nRight? I spent less than an hour a day. It's totally the dopamine trick. You're like, every time you're like, I spent a dollar and you're telling the story you're sitting here like my whole draw in life in store. I'm a story guy and I want to sit around the campfire. That's why I sent you a campfire. I want to sit around the campfire and tell my story when I'm and I get to do it like my kids. My son brings his buddies over. We're all hanging out talking and I start telling glory day stories, but they're they're happening right now.\r\n\r\n\r\nNikolas Hulewsky (46:43.042)\r\nThank you, yes.\r\n\r\n\r\nShannon Jean (46:55.19)\r\nAnd I can talk about this lady's invested a dollar. Don't tell me you don't have any money. And she made 5,000 bucks over the summer. And I love telling these stories, And like Mindy's learning, she just bought a bunch of stuff. I wanted to show you. Let's see if I can find it. Yeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (47:12.342)\r\nOkay, while you're looking for the next one, what do you think's a realistic hit rate? not, I made 100 % gross profit, whatever, on this deal. Just, I didn't lose my money.\r\n\r\n\r\nShannon Jean (47:24.066)\r\nThat's a first step. If you're just getting started, if you don't lose your money on the first couple of deals, you are a rock star. Huge, huge win, dude. Even if you lose a little bit of money, you're learning. Maybe you don't like that category. Like if you're not mechanically inclined, well, I shouldn't say that. We have an accountant that sold over 700 pressure washers this year alone. Yeah.\r\n\r\n\r\nNikolas Hulewsky (47:30.338)\r\nto win.\r\n\r\n\r\nNikolas Hulewsky (47:49.335)\r\nWhat?\r\n\r\n\r\nWhat the freak?\r\n\r\n\r\nShannon Jean (47:53.23)\r\nYeah, I got him up. He's up on X now doing it. it's Yeah, if you can just protect your investment when you're getting started, whether you invest, you know, $300 or $3,000, you're just on the right track. There's you're just you're figuring it out. You're solving problems. I mentioned this. This is a interesting category. I really love luxury and fashion. I had an experiment where I did handbags and sold about $3.7 million worth of bags over three years.\r\n\r\n\r\nNikolas Hulewsky (48:16.056)\r\nMm-hmm.\r\n\r\n\r\nShannon Jean (48:23.138)\r\nthis, you know, rent the runway. You know that, I'm sure your wife does. They rent high end clothing. And they when they've rented them enough, and they start to show little signs of wear and stuff, they auction them off. So Mindy has taken her $5,000 that she made by buying two pallets of books for a buck. And now she's buying rent the runway product. And she's going to live sell it on whatnot. She's to have these back. Look at the look at this is\r\n\r\n\r\nNikolas Hulewsky (48:45.858)\r\nHmm.\r\n\r\n\r\nShannon Jean (48:53.134)\r\nThis auction just closed. Now, I'm gonna say this number and you're gonna remind me what I said earlier. MSRP, $206,240. Okay, what did I say earlier, Nick? Okay, so let's just say they're lying by half my number. So that's $103,000. Let's go ahead and just say they're really liars. So we'll take another, so let's say it's $55,000. Okay, well it sold for $4,200.\r\n\r\n\r\nNikolas Hulewsky (49:03.628)\r\nRight. It's a lie.\r\n\r\n\r\nNikolas Hulewsky (49:20.034)\r\nYeah. It's a quarter. It's a quarter of what it, yeah. Jeez.\r\n\r\n\r\nShannon Jean (49:23.31)\r\nYeah, so $7 per dress. When you look at the manifest, look at these dresses. I'm sorry, I'm yelling. I get little excited. I just want to reach through the screen. Look at this. You know, these dresses, $1,140, $890, $890, $875, $850. Okay, let's say you can only sell it for 10 % of that. You paid $7.14.\r\n\r\n\r\nNikolas Hulewsky (49:32.12)\r\nHe's too excited. I love it.\r\n\r\n\r\nNikolas Hulewsky (49:46.232)\r\nCheers.\r\n\r\n\r\nShannon Jean (49:52.61)\r\nThis is not gambling, okay? And this stuff is perfect for live selling. Live selling has solved the problem of dealing with massive amounts of stuff that you would like, I gotta take a picture of, because there is 591 units. The thought of taking 10 photos of 591 units so you could list them for sale, that fills me with dread. But the fact that you could say, okay, I'm gonna do an hour sale and I'm gonna, it's two minutes per item.\r\n\r\n\r\nNikolas Hulewsky (49:55.437)\r\nNo.\r\n\r\n\r\nNikolas Hulewsky (50:16.009)\r\nYeah.\r\n\r\n\r\nShannon Jean (50:21.548)\r\nand I'm going to hold them up and show it and I'm going do it sold and it's going to sell for 20 bucks or whatever 50 bucks and your cost is $7.15 and you you know your spouse to sink your rock star you know and so that's how you do this business you start small.\r\n\r\n\r\nNikolas Hulewsky (50:35.576)\r\nThat's insane.\r\n\r\n\r\nHow long between like, let's say, hey, I want to get started. Let's somebody joined your mastermind. How long between joining your mastermind and buying their first deal? Average.\r\n\r\n\r\nShannon Jean (50:50.51)\r\nMonth.\r\n\r\n\r\nNikolas Hulewsky (50:52.022)\r\nmonth. Okay. And then how long between buying that first deal and then buying a deal that's like significant and by significant, I'll say $10,000 or\r\n\r\n\r\nShannon Jean (51:03.534)\r\nYeah, so we had a guy in that this pressure washer example, I'll use the name Joe Earl, and he started bought a couple of pallets. I think he spent maybe 1500 bucks in the beginning. This was maybe coming on 11 months ago, a little maybe a little less than a year. And he then ramped up ramped up and he just bought his first truckload in. Yeah, September. So last month.\r\n\r\n\r\nand he posted in the mastermind and he posted it on X because I pushed these people to do it publicly is they were profitable in 36 hours after buying the truck truckload. Yeah, cover their cost in 36 hours because maybe it's like 10 grand. you know that so he definitely moved up and and but the after I would say the average buyer is spending about you know, three to $5,000 at a time.\r\n\r\n\r\nNikolas Hulewsky (51:44.086)\r\nHow much was the chocolate?\r\n\r\n\r\nShannon Jean (51:59.256)\r\nbut they're buying over and over. So you buy and then you're getting, you got your systems in place and then the shipment shows up. And as soon as the shipment shows up, you're selling it and you're buying again. You just, constantly having this product come in. There's a company that sells a flat pack furniture. It's called Walker Edison. And they want to be kind of the Ikea of online, you know, flat pack. And you can buy truckloads, their retail price, which is again, a lie. It's like a hundred.\r\n\r\n\r\n$12,000, but you can buy truckloads for like four grand, you know, they sell like all the time. And I was on a call with a young guy, we were talking through it. And you know, he bought it. He's like, Yeah, I had to ship it to a freight forwarder because I'm a house you can't get a full truckload to my house. And then I did this, I did that. And it took him about three weeks to sell 300 pieces. And, and he still had, he was in the black and he still had about 100 pieces left to sell.\r\n\r\n\r\nAnd he was talking about going to his senior year and I'm like, what are going to do after college? And he goes, dude, I'm in high school. I was like, what? was like, you're gonna be so rich, dude, because your, your brain is so like, I was, this kid's in high school, a junior in high school. And he's figuring it out. I can't chip it to my house, got to pay for each forwarder, then I can send it to my my\r\n\r\n\r\nNikolas Hulewsky (53:12.284)\r\nmy gosh.\r\n\r\n\r\nNikolas Hulewsky (53:18.701)\r\nYeah.\r\n\r\n\r\nShannon Jean (53:25.249)\r\nself-storage unit, then I do this and I do that. it's crazy. And you know the bottom line, Nick, it's so fun. It is so fun. You know, if you don't like problem solving, it's not a business for you. Or if you don't like it, then just buy brand new stuff. But if you enjoy puzzles and problems, oh man, this business is, it's glorious chaos. Let me tell you, it is fantastic.\r\n\r\n\r\nNikolas Hulewsky (53:29.686)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (53:40.406)\r\nIt's yeah.\r\n\r\n\r\nNikolas Hulewsky (53:53.667)\r\nWell, dude, I mean, I didn't even get to all the stuff I wanted to talk about. We're already bumping up against an hour. Let me ask you this, going into, we're now in Q4. If I'm somebody who wanted to get into this, what do you think are like the best, like what's the best way in this last quarter of the year to just start dipping my toes into the water?\r\n\r\n\r\nShannon Jean (53:57.11)\r\nI know, I know. I could talk all day.\r\n\r\n\r\nShannon Jean (54:16.738)\r\nYeah, I think toys are great, but I would only buy brand new. You could buy some outdoor toys are different. You can sell open box stuff, whatever, but there's tons of brand new stuff available. Target is a good site to get into to buy Legos. There's always Lego auctions. I think it's fantastic. would want, ideally, you know more before October 15th because\r\n\r\n\r\nNikolas Hulewsky (54:36.44)\r\nlike us.\r\n\r\n\r\nShannon Jean (54:42.636)\r\nlet's say you bought today, you're two weeks out, so you're into November before you get the product. And it's tough. Again, if you're already in business and you have a good eBay store or a good Facebook marketplace reviews, different story. But if you're just getting started, I would say you should focus on things that people, what they do after Christmas, and you should save your money because the largest return phase like,\r\n\r\n\r\nNikolas Hulewsky (54:54.872)\r\nYeah, different story. Totally different story.\r\n\r\n\r\nShannon Jean (55:10.094)\r\nJanuary, February, March are absolutely unbelievable. It's like a fire hose of returns, right? Because it's after Christmas. That is, you could buy enough in Q1 to carry you through the rest of the year, depending on what you had going on.\r\n\r\n\r\nNikolas Hulewsky (55:17.997)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (55:25.464)\r\nAll right, can I tell you my takeaways from this? All right, here are my takeaways. I love these couple of commandments. Buy with math, sell with emotion. I think that's applicable whether you're doing reselling or just anything in business. Never buy anything unless you know what you can already sell it for. Like that is just, it's great. I loved the retail is a lie and I don't watch Netflix, I watch auctions. think those are really cool.\r\n\r\n\r\nShannon Jean (55:39.342)\r\nbuying a business like you talk about all the time. Yeah.\r\n\r\n\r\nShannon Jean (55:49.998)\r\nI always feel I should be in the t-shirt business because I love those phrases. I'm like, that should be on a t-shirt.\r\n\r\n\r\nNikolas Hulewsky (55:56.576)\r\nDid you just like little slogans? The other thing that I really like you talk about is have you ever heard of this book called a random walk down Wall Street is by Peter Lynch. He's a really famous investor and he talks about like some of the things that if you want to start investing in stocks, this is what you should do. And like the first thing he talks about is just buy what you know. Hey, you like Nike, buy Nike stock. You like general mill cereal, buy general mill stock. And that's kind of what you're saying in this reselling game. It's like,\r\n\r\n\r\nShannon Jean (56:05.856)\r\nNo. Yeah, yeah, I know Peter Lynch.\r\n\r\n\r\nShannon Jean (56:18.062)\r\nThat's cool.\r\n\r\n\r\nNikolas Hulewsky (56:25.644)\r\nYou want to get into it? Like buy stuff that you know. Like don't just.\r\n\r\n\r\nShannon Jean (56:27.99)\r\nYeah, do you want to buy I love Blackstone grills. I love deals with Blackstone's all my buddies have Blackstone's because they got them from me. And you know, when you can buy them for like 100 bucks a piece. Why wouldn't you buy them and like I have vacation rentals and I'm like, well, we need new patio furniture for all these houses. Let's go buy four or five pallets of stuff and you get you know, I think I bought $12,000 worth of stuff for like 1100 bucks. You know, we push that and Costco does\r\n\r\n\r\nNikolas Hulewsky (56:34.616)\r\nThat's amazing.\r\n\r\n\r\nShannon Jean (56:55.198)\r\nAfter the holidays, they back up and sometimes they'll do that probably a couple times a year, they do free shipping, which is unbelievable. And you can buy heavy and really load up on that time. So there's always ways to do it. Yeah, there's a there's a woman. There really is. Yeah, there's there's a woman an hour and half from me that sold $86,000 worth of customer return carpets, rugs, eight by 10s, big, big, big money.\r\n\r\n\r\nNikolas Hulewsky (57:08.984)\r\nThere's levels to this game.\r\n\r\n\r\nShannon Jean (57:22.062)\r\nand you can buy them for nothing because nobody wants to deal with them. So we could just go on and on and on. We should come back. You get your resale permit. We'll buy a deal. Bring it in, handle it. You can bitch and moan about everything. And then yeah, what what are you doing? And then we'll put it on Facebook Marketplace or eBay wherever you want to sell it. And we'll track through the whole thing. It'll be fun. Yeah, it'll be great. I love talking about this stuff, dude. I can't stop. Good to see you too, Nick. Yeah.\r\n\r\n\r\nNikolas Hulewsky (57:28.29)\r\nto it. Okay.\r\n\r\n\r\nNikolas Hulewsky (57:33.996)\r\nYeah, I can film my wife seeing it for the first time.\r\n\r\n\r\nNikolas Hulewsky (57:44.056)\r\nAlright, Shannon, always good to see you. I'm gonna hit the stop here.",
  "metadata": {
    "duration": "",
    "date": "2025-10-22",
    "platform_source": "Google Drive"
  }
}