{
  "episode_number": "181",
  "episode_title": "Franchising a Roofing Business with Clayton Edrington",
  "guest_name": "Clayton Edrington",
  "business_name": "Bumble Roofing of South Sound",
  "transcript": "﻿Nikolas Hulewsky (00:01.262)\r\nAll right, Clayton, my first question is why do roofers make so much money? You like that? Just right out of the gate?\r\n\r\n\r\nClayton Edrington (00:06.292)\r\nyou\r\n\r\n\r\nThat's an amazing question. I don't know. I'm waiting for that day to come, but we'll see. Find out one day.\r\n\r\n\r\nNikolas Hulewsky (00:13.134)\r\nHa\r\n\r\n\r\nNikolas Hulewsky (00:17.474)\r\nwell, okay. So when I sold my businesses, I didn't know much about franchising and, it's been a big curiosity for me to like figure out how does it work? Like, why would I go with a franchise? And there's a million different franchises out there. you're the owner and operator of a, is it Bumblebee Roofing?\r\n\r\n\r\nClayton Edrington (00:38.556)\r\nJust bumble, bumble roofing of South Sound.\r\n\r\n\r\nNikolas Hulewsky (00:39.982)\r\nOkay, sorry. Bumble roofing. And how big is Bumble as a franchise?\r\n\r\n\r\nClayton Edrington (00:43.092)\r\nYou\r\n\r\n\r\nClayton Edrington (00:48.606)\r\nYeah, I think we're up to almost 30 owners, I believe, locations all across the US. The founding location in LA is in Texas, Colorado, Idaho, East Coast, all up and down it. So good amount.\r\n\r\n\r\nNikolas Hulewsky (01:01.634)\r\nHmm. Dude. So I have good friend of mine, Cole Simpson. He's a roofer. He's with the Mighty Dog brand, is, is horsepower brands. Is Bumble owned by like a larger brand owner or is it just Bumble?\r\n\r\n\r\nClayton Edrington (01:09.939)\r\nYeah.\r\n\r\n\r\nClayton Edrington (01:13.492)\r\nYeah, it's owned by Empower brands. So yeah, they're pretty big as well, just like horsepower, own Quala insulation, Superior Fence and Rail, bunch of bigger brands like that.\r\n\r\n\r\nNikolas Hulewsky (01:23.33)\r\nSo home services are super hot. Everyone's like, ooh, I gotta get an HVAC company or I gotta do plumbing or whatever. Window washing. Roofing is one of those though. Like roofing is a home services company that people look at and say, man, that seems like a cool business. How did you get into it?\r\n\r\n\r\nClayton Edrington (01:27.621)\r\nyou\r\n\r\n\r\nClayton Edrington (01:41.492)\r\nYeah, I mean, honestly, I went down the exact same train of thought as you just mentioned. initially when I started looking at franchises, I looked at everything. I looked at pressure washing. I looked at HVAC. I looked at plumbing. I looked at insulation. I looked at paint striping. Pretty much everything. Yeah, yeah. I went through quite a process to actually find the one that I landed on. yeah, roofing to me was...\r\n\r\n\r\nNikolas Hulewsky (01:46.39)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (01:58.187)\r\ndang!\r\n\r\n\r\nClayton Edrington (02:09.97)\r\nthe most attractive business model. I could see the ability to scale quickly to high revenue with relatively low capital involved with it.\r\n\r\n\r\nNikolas Hulewsky (02:21.806)\r\nCan you kind of explain what the business model is for roofing? Because I didn't know how these roofing companies work. Can you talk about how you make money really quick?\r\n\r\n\r\nClayton Edrington (02:26.803)\r\nYeah.\r\n\r\n\r\nYeah. So our business model is pretty simple. You know, you have your marketing arm of things, your sales side of things. And then what I'll just bucket is like production side of things. Production is managed by us, but the actual execution of the labor is subbed out. So if you really want to distill it down to something simple, you know, we are a marketing and sales machine that oversees the production.\r\n\r\n\r\nside of things as well.\r\n\r\n\r\nNikolas Hulewsky (02:59.15)\r\nYeah. What was your, so before I ask that question, I think it's interesting. I didn't really realize it, but like sales is really the main function. Like you just said, your sales and marketing machine, and then you're subbing everything else out, which I always thought like, a roofing company, I got to get whatever, all the equipment and all the guys, yada, yada, yada. But the actual startup costs are not what you think that they would be to start a roof. There are still startup costs, but.\r\n\r\n\r\nClayton Edrington (03:20.094)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (03:26.454)\r\nIt's not the same type of capital intensive that you'd actually need to be a full on soup to nuts roofing company that's going out and actually doing the fulfillment as well, right? Okay, what did you do before this?\r\n\r\n\r\nClayton Edrington (03:34.342)\r\nYep, exactly.\r\n\r\n\r\nClayton Edrington (03:39.006)\r\nSo prior to this, I was in the tech industry, worked at Amazon for like four or five years, tech consulting before that. I do have a formal education in civil engineering. So I have some construction side to me, some heavy civil type of construction, but zero roofing experience at all going into this.\r\n\r\n\r\nNikolas Hulewsky (03:55.682)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (04:01.451)\r\nSo it sounds like you kind of knew you wanted to get into entrepreneurship. How did you get down the road of, hey, I want to do franchising?\r\n\r\n\r\nClayton Edrington (04:06.726)\r\nYes.\r\n\r\n\r\nClayton Edrington (04:13.044)\r\nYeah, it's a great question. And it kind of started off as, know, I had this entrepreneurial itch. A lot of my community, family and friends own businesses. And I've always wanted to own one, know, call me a entrepreneur or whatever you want. It's always been kind of, kind of like that.\r\n\r\n\r\nNikolas Hulewsky (04:30.336)\r\nI don't think it's a bad term. We were all entrepreneurs at some point.\r\n\r\n\r\nClayton Edrington (04:34.84)\r\nExactly. And you know, the golden handcuffs of Amazon, it's, it's hard to step away from that. So I kind of had this, this itch and I went down the path of like, let me try this, you know, SaaS startup. I kind of put half effort into something like that. Let me try some tech consulting of my own, put some effort into that. Then I started thinking about the idea of buying a business. I did not get fully invested into the whole ETA route, but I did explore it, had a couple of conversations.\r\n\r\n\r\nNikolas Hulewsky (04:39.414)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (04:51.469)\r\nMm-hmm.\r\n\r\n\r\nClayton Edrington (05:04.66)\r\nBut I kind of came to the conclusion of, you I'm not sure I'm comfortable giving up, you know, a personal guarantee and a ton of debt, all for something that, you know, maybe I don't know exactly how to grow the revenue of that business and execute perfectly. It just seems super risky to me if, you know, being humble, like who am I to step into a $15 million plumbing company and be like, we're going to change everything. We're going to fix all of your problems and grow revenue by 30%. So\r\n\r\n\r\nYeah, then I came across franchising kind of on accident. I think it was on a podcast. It might've been actually Chris's podcast that I came across it. So I started to explore that a little bit more. I previously had a perception, a bad perception of franchising. Just stereotypical kind of ideas behind that. But digging into it more, was like, okay, maybe this is a path I could go down that's a happy medium between\r\n\r\n\r\nstarting something on my own and actually buying something. Yeah.\r\n\r\n\r\nNikolas Hulewsky (06:07.246)\r\nYeah. How long was that process? So you said you could, you were getting the edge, you're doing tech consulting. Like how long was the process between like, yeah, I want to get into entrepreneurship all the way to February. Spoiler alert. You launched your brand in February. How long, how long was that?\r\n\r\n\r\nClayton Edrington (06:21.063)\r\nYeah.\r\n\r\n\r\nSo from the time I started seriously looking at franchises, I'd say it was prior to that, maybe like April is when I kicked it off. I had a pretty tough long process going through it or what I thought was. But yeah, so April to February the. Yes, yep.\r\n\r\n\r\nNikolas Hulewsky (06:35.65)\r\nWell, it's April of 2024.\r\n\r\n\r\nNikolas Hulewsky (06:40.494)\r\nJeez, you feel like that was too long?\r\n\r\n\r\nClayton Edrington (06:43.838)\r\nTo me it was. I'm impulsive. I want to move quick.\r\n\r\n\r\nNikolas Hulewsky (06:45.102)\r\nDude, that's funny. Well, I'm sure a lot of you are listening to me like, yeah, that's not that long. I mean, it feels like a long time when you're in middle of it you're like just trying to figure out how to get into it. But I think your experience is right down the middle of the road. In fact, probably on the quicker side, less than a year where you hop into it. Why the sweaty businesses? Like, you know tech, you worked in Amazon, you're a civil engineer, and here you are.\r\n\r\n\r\nClayton Edrington (07:05.491)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (07:13.622)\r\nowning a roofing company, but you tested all these other things out. said like paint striping and window, like whatever else. Why the sweaty?\r\n\r\n\r\nClayton Edrington (07:14.196)\r\nYou\r\n\r\n\r\nClayton Edrington (07:20.626)\r\nYeah. Yeah. mean, so the, the like final straw for me for, for leaving Amazon, you know, I had amazing manager, amazing team, all that good stuff, but it's tough being behind Slack and the rest of your teams halfway across the country or the world. you know, like I mentioned before, I've, have a super close, you know, community connection and involvement. And it felt like, almost like a double life, right? Like I'm behind this computer all day grinding for Amazon.\r\n\r\n\r\nAnd then after work, I go see my friends, you know, and we have this whole community type of concept going, but I'm not able to relate to a lot of that, right? It's like, how do I explain to them what's going on within Amazon and Luxembourg for them to really understand?\r\n\r\n\r\nNikolas Hulewsky (07:56.739)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (08:07.256)\r\nWhat? Okay, you said golden handcuffs at Amazon. Can you tell me how much were you making at Amazon a year?\r\n\r\n\r\nClayton Edrington (08:10.867)\r\nYeah.\r\n\r\n\r\nClayton Edrington (08:14.324)\r\nUh, good amount over 300,000. I think my last year was like 330,000 or something total comp. I am.\r\n\r\n\r\nNikolas Hulewsky (08:17.015)\r\nOkay.\r\n\r\n\r\nAre you married? Okay, so you're making over 300 grand a year. What did your wife say when you were like, yeah, I think I'm gonna go start a roofing company.\r\n\r\n\r\nClayton Edrington (08:30.26)\r\nSo I think I'm extremely lucky or I know I'm extremely lucky with my wife. She's also in the tech industry. She actually works for AWS now after I left Amazon. But she was extremely supportive. She I think is all on board, if not more of this dream than I am. So that was a huge part of it as well, is making sure that she's on board and able to support.\r\n\r\n\r\nNikolas Hulewsky (08:44.79)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (08:57.464)\r\nSo did you talk to her upfront? you like, hey, I'm thinking of leaving. This is kind of my plan? Or was it like later down the road where, I found a franchise I like.\r\n\r\n\r\nClayton Edrington (09:07.27)\r\nNo, was a conversation from the beginning. know, she heard me complaining all the time about Amazon and trying to find ways out and these startups I was trying. So she knew and she was prepared.\r\n\r\n\r\nNikolas Hulewsky (09:16.478)\r\nand I think, I think a lot of people who are listening that may be in the same situation that you are in are probably asking the question, like, how did you prepare? Were you thinking about, okay, I got to save up X number of dollars to have some runway to look. Were you thinking I'll look at the same time that I'm saving and excuse me, that is I'm working so I won't have to like lose an income. Was there a certain dollar amount that you wanted to hit? Like for you, as you were preparing to make the jump, how did you think about kind of\r\n\r\n\r\nbridging that gap.\r\n\r\n\r\nClayton Edrington (09:47.412)\r\nYeah. Yeah. So in my mind, the gap that I to bridge was don't take an income for a year and obviously cover the franchise costs and startup costs. So I wanted to be pretty low risk with this. That's the reason I chose the franchise, like I mentioned. So it really, for me, it was preparing for like mentally, okay, year without a salary and all of your startup costs.\r\n\r\n\r\nNikolas Hulewsky (10:15.148)\r\nAnd a year without a salary being after you started or did you look for a year?\r\n\r\n\r\nClayton Edrington (10:20.808)\r\nA year without a salary. While I was looking, I was fully employed at Amazon.\r\n\r\n\r\nNikolas Hulewsky (10:25.438)\r\nOkay, so you're just thinking like, first year I'm gonna launch this business. I'm not making any money. So that's what you plan for. Dude, I think a question I would have is how much were you working at Amazon? Like, okay, I know you're making 300 plus a year. How many hours a week were you working at Amazon?\r\n\r\n\r\nClayton Edrington (10:30.277)\r\nExactly. Yep. Yep.\r\n\r\n\r\nClayton Edrington (10:43.828)\r\nEbs and flows, that's for sure. I mean, there were some parts of my career where you're grinding, you know, all night, all day. So however many hours you want to associate to that. There are other times, wasn't doing too much. Also a funny timing of all of this is my first daughter was born in the spring. So I was on paternity leave for three months. So I had a lot of time to do the searching. So that was a huge benefit.\r\n\r\n\r\nNikolas Hulewsky (10:53.07)\r\nOkay.\r\n\r\n\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (11:06.904)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (11:10.99)\r\nWell, like the reason I ask is because I have a wife as well. And I was working for, how do I put this? The company that purchased my last company. So it was a larger company. They purchased my last company. They wanted me to work for them for a period of time. And I did, I knew them really well. They were awesome. They took really good care of me and they paid me really good money. And the stuff they were asking me to do wasn't super demanding. And I got to the point where I was like, Jess, I gotta quit. like, what? do you mean?\r\n\r\n\r\njust do whatever you're gonna do on the side and just keep collecting the paycheck. know what I mean? Internally, I was just like, can't feel good about that. I gotta quit. Is that how you thought about, hey, I can't have a side hustle while I'm doing this stuff at Amazon?\r\n\r\n\r\nClayton Edrington (11:53.98)\r\nYeah, you're spot on. So, you know, I went on that paternity leave and then I came back in the fall. And that was when I was like really in the thick of it. I signed my franchise agreement in October. And that's when that feeling came in is like, I can't, it's another double life that I'm living, right? It's a lot of guilt. And, you know, I even ended my employment at Amazon after a good stock vest so that I didn't keep dragging that on. I probably could have drug it on for quite some time.\r\n\r\n\r\nNikolas Hulewsky (12:10.198)\r\nYeah, yeah, true.\r\n\r\n\r\nNikolas Hulewsky (12:18.911)\r\nMm-hmm.\r\n\r\n\r\nClayton Edrington (12:22.836)\r\nYou're spot on.\r\n\r\n\r\nNikolas Hulewsky (12:24.706)\r\nI'm gonna, okay, here's a question I have for you. How long did you work at Amazon?\r\n\r\n\r\nClayton Edrington (12:28.5)\r\nI think maybe like four and a half years or a little bit over four.\r\n\r\n\r\nNikolas Hulewsky (12:31.086)\r\nOkay, so let's say you just have some good money in stock. How do you think about that stock now? Like now that it's vested, do you, I've always wondered this from people who like got maybe large equity grants. And again, you're not telling me how much you got, but do you think like, oh, it's just there, that's my retirement? Or are you like selling a little bits of it at a time to like diversify? What do you do?\r\n\r\n\r\nClayton Edrington (12:53.884)\r\nYeah, so at the advice of my financial advisor, I was telling, we were selling most of the way. So I just viewed it as part of my income, but it would just be delayed six months or whatever the best period was. yeah, RSUs.\r\n\r\n\r\nNikolas Hulewsky (12:59.245)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (13:05.996)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (13:09.908)\r\ninteresting. Was it options or were they RSUs?\r\n\r\n\r\nWow, man. OK, so do you own any Amazon stock at this point?\r\n\r\n\r\nClayton Edrington (13:17.813)\r\nWe do, but just not an oversized amount, just something diversified.\r\n\r\n\r\nNikolas Hulewsky (13:23.768)\r\nCan I, okay, do you ever go back and look and be like, man, if I wouldn't have sold or the other way, I don't know, cause I haven't looked at Amazon stock, but like, glad I did sell. Do you ever do the like, what if math?\r\n\r\n\r\nClayton Edrington (13:27.924)\r\nyou\r\n\r\n\r\nClayton Edrington (13:34.962)\r\nWe've had, we've had both of that, especially with my wife working there and you know, previously she's worked at Disney, it's been up and down a ton. We've had, we've had a lot of that. Amazon, yeah, Amazon not so much. I joined it at high time. Yeah.\r\n\r\n\r\nNikolas Hulewsky (13:38.431)\r\nHa\r\n\r\n\r\nNikolas Hulewsky (13:42.496)\r\nYeah. don't get me started on Disney. Don't get me started on Disney, man. I've held I love Disney and I've held Disney for like 10 years and Disney's just still in the 90s, low hundreds. And I'm like, what? Why is it? Why is it trading? Anyways, I freaking love Disney because I just think the intellectual property they have. And yet they're stagnant. Okay, so you look but\r\n\r\n\r\nClayton Edrington (13:58.76)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (14:10.688)\r\nYou were like paint striping all these other random businesses. Give me the list of like the other franchises that you looked at.\r\n\r\n\r\nClayton Edrington (14:17.362)\r\nYeah, plumbing, HVAC, insulation, pressure washing.\r\n\r\n\r\nNikolas Hulewsky (14:22.222)\r\nOkay, so why'd you pick, walk me through how you thought about the right franchise for you.\r\n\r\n\r\nClayton Edrington (14:28.562)\r\nYeah, I I ended up landing on a pretty new franchise in franchise terms. And to me, I think there's kind of two paths of franchisees, of people that are looking for this. There are the type of people who want this plug and play business in a box, give me all the structure and it's just gonna be a solid financial investment. Or there's the other side where I see myself falling.\r\n\r\n\r\nis someone who is willing to grind and treat it like a startup. And they're just looking for fuel to pour onto the fire. So that's kind the more of the approach that I was looking for. being an early franchisee, I think there's a lot of additional opportunity there. And they're still providing that fuel to help me grow fast.\r\n\r\n\r\nNikolas Hulewsky (15:18.734)\r\nOkay, so for you is about the feel of the opportunity. It wasn't like, this is the type of work that I like. This is the type of experience that I have. This is the geography that I want to be in. Like, obviously those are important factors in making a decision, but those were not the driving factors. Yours was what you just said. Okay.\r\n\r\n\r\nClayton Edrington (15:30.259)\r\nYeah.\r\n\r\n\r\nClayton Edrington (15:35.716)\r\nYeah, yeah, no, those are important, obviously, but for me, it really was just like the business model and what's the potential of this business.\r\n\r\n\r\nNikolas Hulewsky (15:44.302)\r\nOkay, so the business model of a roofing, not necessarily of the brand, the franchise or.\r\n\r\n\r\nClayton Edrington (15:51.774)\r\nCorrect, yeah. I mean, they go hand in hand, but yeah, mostly of the brand.\r\n\r\n\r\nNikolas Hulewsky (15:54.764)\r\nWell, mean, of the things I always think about is like, does it matter? Like, let's say you got in early with Bumble roofing. What does it matter if you got in early? It's not like you have an equity stake in all of Bumble roofing or like, does that make sense? Like, help me understand why that's important.\r\n\r\n\r\nClayton Edrington (16:06.58)\r\nYeah. Yeah. Yeah. So one is territory, right? That's something I ran across a ton is territory availability. You know, I'm south of Seattle. It's a decent size market. So there's that. And then the other side of it is being able to help grow and shape the brand itself. A little bit intangible, you know, and we'll see how this plays out. But in my mind, that's pretty important to me being able to provide input.\r\n\r\n\r\nNikolas Hulewsky (16:14.05)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (16:23.052)\r\nOkay.\r\n\r\n\r\nClayton Edrington (16:35.604)\r\ninto how things are going to shape out and what sort of long-term support we need.\r\n\r\n\r\nNikolas Hulewsky (16:40.012)\r\nWhat does that mean when you say like help to shape the brand long term? So the franchisor is not just like, Hey bro, here's our playbook. it and leave it. are they, do they have like a workshop, not workshop, but like a, work group that's like helping them improve the brand that you can be a part of. I guess help me.\r\n\r\n\r\nClayton Edrington (16:53.555)\r\nYeah.\r\n\r\n\r\nClayton Edrington (16:57.5)\r\nYeah, exactly. Especially being early on, know, they're taking feedback from all of us franchisees. So it's not just like a take or leave it type of situation. It's, you know, what's working, what's not working. Let's hear this feedback and improve on it. They're going through, you know, a growth as a business just like I am. So I think it's an important partnership that we keep going on.\r\n\r\n\r\nNikolas Hulewsky (17:04.216)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (17:14.094)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (17:21.794)\r\nMaybe I'm selfish, but I would have a hard, for me, I'd have a hard time thinking like, well, I just helped them get way better and I'm gonna get more franchisees and they're gonna make way more money. And how do you think about it? Is it like, well, this improves or increases the value of my local location. So helping the mothership helps me, or do they like, do you have like an extra stipend? you get paid differently if you're, you know what I mean? Like, how do you think about being compensated for helping them build their brand?\r\n\r\n\r\nClayton Edrington (17:30.611)\r\nYeah.\r\n\r\n\r\nClayton Edrington (17:46.004)\r\nYeah, yeah.\r\n\r\n\r\nYeah, mean, compensated in terms of like, you know, some sort of kickback doesn't exist, right? Correct. The way I see myself being compensated is yeah, helping my brand grow, you know, from a national accounts perspective, from the support I need perspective to help scale this business. I just, just view that as a partnership that, that that's going to pay off in the long term.\r\n\r\n\r\nNikolas Hulewsky (17:56.696)\r\nDoesn't exist, okay.\r\n\r\n\r\nNikolas Hulewsky (18:14.734)\r\nOkay, so when you were looking at all these different brands, how was Bumble, how did they communicate that to you? Like how did you walk away like, cool, not only is this a good brand and it's a good market and it's a good territory, but there's somebody I'm gonna be able to collaborate with. It's not going to be a top-down approach necessarily.\r\n\r\n\r\nClayton Edrington (18:34.708)\r\nYeah, I think it was a combination of, you know, meeting the team and actually feeling them out, feeling out their personalities, and then looking at a bit of their track record, right? Like I mentioned, it's, it's owned by Empower Brands, which owns other large brands that have been through this process. So, you know, when I went out there and actually did my confirmation day kind of trip, they helped me. Yeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (18:39.726)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (18:57.24)\r\nconfirmation day? Is it a religion?\r\n\r\n\r\nClayton Edrington (19:01.65)\r\nor called E-Day, sorry, not confirmation day.\r\n\r\n\r\nNikolas Hulewsky (19:04.27)\r\nWhat? Okay, you had me for a second. I was like, Welcome to Bumble confirmation day. Next you're tell me they're based in Provo, Utah. And I'm like out. You know? Okay, okay. No, American FARC, not Provo, Utah. on. Sorry. Okay, you said E-Day?\r\n\r\n\r\nClayton Edrington (19:12.148)\r\nNo, no, not quite, not quite.\r\n\r\n\r\nit.\r\n\r\n\r\nClayton Edrington (19:22.46)\r\nYeah, yeah, like their Empower Day. It's basically like your Discovery Day. You get to go out there, learn about them, meet everyone that's associated with the brand and just get an actual feel for it in person.\r\n\r\n\r\nNikolas Hulewsky (19:33.046)\r\nOkay. How did you go about identifying brands that might work for you? should ask you this earlier, but like there are so many franchises and there's crappy franchises, great franchises. How did you go about identifying the ones that you even were interested in, let alone going to the E-Day, right?\r\n\r\n\r\nClayton Edrington (19:50.632)\r\nYeah. Yeah. Good question. So I initially, like I mentioned, started out, heard about a pressure washing podcast or a pressure washing company through podcasts, I felt them out and that was the first first company I talked to. Then, you know, I saw a post about them on X. I messaged someone randomly just asking their thoughts and their experience behind it. And then they mentioned that they work with franchise consultant.\r\n\r\n\r\nConnor Gross is who I used, and I ended up connecting with him and we kind of hit it off. So I decided to go down the path of using him to help me navigate all of this and then find the right brand.\r\n\r\n\r\nNikolas Hulewsky (20:33.046)\r\nAnd did he come to you and was like, tell me about yourself. And you like laid on the couch and told him about your deepest, darkest dreams.\r\n\r\n\r\nClayton Edrington (20:36.596)\r\nYeah, big, therapy session and yeah, yeah, no, it is true. You definitely need to get to know the person as a franchise consultant, which he did. And the biggest part too, was me feeling out him and you know, he's a very casual laid back person. We just kind of hit it off immediately. So I felt like he could grasp and represent.\r\n\r\n\r\nNikolas Hulewsky (20:43.906)\r\nBut kind of, right? Like, I mean, he had to get to know you a little bit before he could make recommendations.\r\n\r\n\r\nClayton Edrington (21:05.17)\r\nwhat I was looking for super quick, which is awesome.\r\n\r\n\r\nNikolas Hulewsky (21:07.854)\r\nThe franchise consulting, how much does that cost you? Like, do you have to pay them a like, so you're not paying them a like retainer or anything upfront. How do they get paid? They get paid by the franchise or?\r\n\r\n\r\nClayton Edrington (21:11.804)\r\nZero.\r\n\r\n\r\nClayton Edrington (21:17.682)\r\nNope, nope, zero.\r\n\r\n\r\nYeah, exactly. It's like buying a house, having a real estate agent. Buyer never pays anything just to sell it.\r\n\r\n\r\nNikolas Hulewsky (21:28.46)\r\nSo how much time did he devote to you? Because it's probably not an easy process to go through. Was it like one call at one time, here are some things? Or was it like, let's have a weekly call to check in?\r\n\r\n\r\nClayton Edrington (21:33.106)\r\nYeah.\r\n\r\n\r\nClayton Edrington (21:38.524)\r\nNo, yeah, at least weekly. you know, when we're in the thick of it, we're talking maybe even daily, like pretty often. the only time we weren't talking was like lag time of like, okay, I know you're meeting with them on Wednesday. Like, let me know how it after you meet with them. but it's a good amount of communication.\r\n\r\n\r\nNikolas Hulewsky (21:54.006)\r\nSo upfront, did you set out like, hey, I'm looking for here the parameters for a franchise, but also this is how much I want to put down. Cause you said that you're like, I, you basically planned for the first year, not making any money and buying into the franchise. So like how much, how much money did you set aside for that? And how did it, sorry, my alarm went off. How much money did you set aside for that? And how, how did it compare to actually, you know what? I'm going to ask this a different way. I'll, I'll, I'll redo this.\r\n\r\n\r\nClayton Edrington (22:08.574)\r\nYeah.\r\n\r\n\r\nClayton Edrington (22:21.481)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (22:24.234)\r\nWhen you were looking at the franchises to join, how important was the money in, right? Like the investment in, or was it way down on your list?\r\n\r\n\r\nClayton Edrington (22:39.304)\r\nYeah, I mean, it's definitely important. I definitely have a cap to it of how much I was looking to invest. But you know, I was, I was kind of, you know, shooting as big as I could. So I, you know, I explained that, I do have this kind of cash cap of what I have on hand, but like, bring me any opportunity that looks attractive, and I'll figure out a way, you know, if I need to finance it or however to make it happen.\r\n\r\n\r\nNikolas Hulewsky (22:44.408)\r\nSure.\r\n\r\n\r\nNikolas Hulewsky (23:05.676)\r\nSo when you got in with Beehive, what were they looking at? Because I know that these franchisers have a pretty strict criteria of what kind of franchisees they want to bring on. From what I've heard, obviously they're going to interview you. There's a net worth requirement. There's a liquid capital requirement. There's a buy-in requirement. And then I believe you also have to fund up the business. don't know exactly. How did it work with Bumble? I'm so sorry, Beehive. Freaking moron. How did it work with Bumble?\r\n\r\n\r\nClayton Edrington (23:32.18)\r\nYeah, yeah, so I think they, you know, they do definitely have some sort of formal minimum of net worth, I think, to advertise like 250k net worth 50k liquid. But you know, in my mind, like I mentioned, you're going to need a lot more than that to have a low risk type of scenario. You know, it's all dependent on your risk tolerance of how much you want to actually put out. So when I\r\n\r\n\r\nWhen I started, I bought two territories, which ended up being somewhere around $90,000, as well as a truck with a full wrap on it. I think that ended up being like $45,000. And then miscellaneous things.\r\n\r\n\r\nNikolas Hulewsky (24:05.763)\r\nSo.\r\n\r\n\r\nNikolas Hulewsky (24:16.93)\r\nYou didn't finance it, you paid like just straight cash for it.\r\n\r\n\r\nClayton Edrington (24:20.188)\r\nI did. paid cash. Lucky enough to be in a position where I could do that. But yeah, financing to me.\r\n\r\n\r\nNikolas Hulewsky (24:22.147)\r\nWhy?\r\n\r\n\r\nNikolas Hulewsky (24:28.522)\r\nEven if you're lucky enough, why not finance it? Was it just like a mental thing of like, I don't even want to have to worry about debt.\r\n\r\n\r\nClayton Edrington (24:35.676)\r\nYeah, yeah, that's definitely a huge piece of it. Not having to worry about debt and that being a more low risk scenario, as well as, know, just rates of the time and making that sense.\r\n\r\n\r\nNikolas Hulewsky (24:42.478)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (24:47.074)\r\nYeah, they're insane. That's true. That's very true. So $250,000 net worth requirement $50,000 buy in for the territory. Obviously, you spent 90 because you wanted to get two territories. What were the territories you got?\r\n\r\n\r\nClayton Edrington (25:02.516)\r\ncouple.\r\n\r\n\r\nClayton Edrington (25:06.437)\r\nkind of the heart of where I lived, Como, Washington, and a little bit North going up into a federal way. And then I actually ended up buying a third one. that's bringing me up into Seattle.\r\n\r\n\r\nNikolas Hulewsky (25:12.726)\r\nrent in federal way.\r\n\r\n\r\nNikolas Hulewsky (25:17.998)\r\nOh, that's awesome, man. So $50,000 in and then do they have like a recommended, this is how much you need to spend in order to fund up? Even though we were talking about, it's not a huge capital investment. I'm sure, like you said, you had the truck. What other types of investments do you have to make before you even launch?\r\n\r\n\r\nClayton Edrington (25:37.428)\r\nYeah, so you have some fixed ones. you have your drone is highly recommended. This catch all system like net system that goes around the customer's house, small things like that, as well as insurance, which is super expensive for roofing. So those are kind of the investments that you got to put up front.\r\n\r\n\r\nNikolas Hulewsky (26:00.0)\r\nOkay, as you were, so you're looking at all of this and you're thinking, all right, $50,000 in, how much on top of that do you think you needed to put in to get started? Another $50,000?\r\n\r\n\r\nClayton Edrington (26:11.572)\r\nYeah, so then you kind of look at your variable costs that are going to be coming in. So marketing, I knew I want to be pretty aggressive with it. So I forecasted just saying like, 10 % of whatever forecasted revenue I want to do is going to go towards marketing. say you're targeting a million dollar your first year, that's at least 10, you know, around 10 grand a month going towards marketing.\r\n\r\n\r\nNikolas Hulewsky (26:36.378)\r\nso I get the thing that I'm getting at is like, let's just say you put in a hundred thousand dollars, right? I'm just saying that that's the number a hundred thousand dollars. And you're looking at this and you're like, all right, cool. In order to get into Bumble roofing, I've got to put in a hundred thousand dollars. How did you, the other side of the equation, right? That's the cost side. How did you think about the ROI? How did you think about, okay, what is this going to produce for me? Cause like you said, they're a new franchise, so they don't necessarily have.\r\n\r\n\r\nClayton Edrington (26:41.672)\r\nMm-hmm.\r\n\r\n\r\nClayton Edrington (26:51.753)\r\nYeah.\r\n\r\n\r\nClayton Edrington (26:55.902)\r\nMm-hmm.\r\n\r\n\r\nClayton Edrington (27:04.168)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (27:05.696)\r\na ton of history, but you still bet on them and you're still putting in a significant amount of money, what did you think the economics were going to be when you were evaluating the deal?\r\n\r\n\r\nClayton Edrington (27:16.116)\r\nYeah, yeah. So I looked at their FDD and they forecasted, you know, say 10 % net profit coming out of it, which I thought was reasonable based on my own validation research within the roofing industry. And that's after fees.\r\n\r\n\r\nNikolas Hulewsky (27:26.136)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (27:30.638)\r\nWas that 10 % ongoing or was that like, first year you're gonna do 10 % and then after that you're doing blup, blup, blup. Okay.\r\n\r\n\r\nClayton Edrington (27:37.588)\r\nOngoing ongoing. So so yeah to reach that 10 % of course, it's gonna take a little bit of time to reach You know get to that point in my mind, you know, I said, okay I I'm pretty confident I could get to some sort of stability within three years So, you know if I'm hitting a million dollars the first year and I'm breaking even I'm I'm a happy camper and from there I think you know, I can definitely grow beyond that and increase that\r\n\r\n\r\nNikolas Hulewsky (28:05.454)\r\nIt's interesting. For whatever reason in my mind, had roofing at like, good roofing companies are like 15 to 20%. But the FDD, they can't be like, you could make up to 20 % net margins. Right. So the 10 % is kind of like their middle of the road assessment. Is that right?\r\n\r\n\r\nClayton Edrington (28:21.512)\r\nYeah, yeah, definitely. And in my mind, that's like what I'm hoping to be conservative. So I think you can grow definitely beyond that. But yeah, 10 % is the number I plan with.\r\n\r\n\r\nNikolas Hulewsky (28:29.934)\r\nAnd is that is that FDD a projection or are they like these are the actual locations that we have and this is the actual profit and loss that they're doing.\r\n\r\n\r\nClayton Edrington (28:40.478)\r\nSo it's based on actual locations. That 10 % when I joined was based on the LA founding location for Bumble.\r\n\r\n\r\nNikolas Hulewsky (28:43.841)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (28:51.022)\r\nHow did you do due diligence? Did you like secret shop any of these other franchise locations or just like call in or try to get in this like, because that's got to be a big piece of it, right? Like, cool. I've seen the FDD, but you've only got 30 locations. So it's not like you're massive yet. You're putting a good amount of money in. It's still a risk, even though you're not signing a personal guarantee, there's still obviously a risk associated with it. How did you get comfortable with the jump?\r\n\r\n\r\nClayton Edrington (29:04.947)\r\nYeah.\r\n\r\n\r\nClayton Edrington (29:16.37)\r\nYeah, so there is like franchisee validation calls they can go through so you can pick up phone actually chat with these other franchisees and get their take on everything. So, you know, you can take it as you will some might give you a super can happy rosy answer and others are going to be brutally honest, which is why you know talking with as many as possible is definitely a great idea.\r\n\r\n\r\nNikolas Hulewsky (29:40.864)\r\nWere those franchisees ones that the franchisor gave you or did you go out on your own or was that something Connor helped you with? Like how did you actually do that?\r\n\r\n\r\nClayton Edrington (29:50.002)\r\nthe franchisor helps provide the names of them. So they gave us a full list of everyone and said, have at it.\r\n\r\n\r\nNikolas Hulewsky (29:52.834)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (29:56.462)\r\nThe skeptical part of me would be like, I'm not taking your list. I'm gonna go find my own list. Yeah. How do I know this isn't just you 35 times? Okay, so you launched in February. When did you make the decision that you were going with Bumble?\r\n\r\n\r\nClayton Edrington (30:01.268)\r\nThese are fake numbers.\r\n\r\n\r\nClayton Edrington (30:20.02)\r\nI signed my franchise agreement in October of 24, so a few months prior to that.\r\n\r\n\r\nNikolas Hulewsky (30:27.148)\r\nSo let's say October, November, December, four months of prep and then you launch in February. To me, that doesn't seem like a lot. Is that normal? Is that short? Is that long? Like where does that fall on the continuum?\r\n\r\n\r\nClayton Edrington (30:31.102)\r\nYeah.\r\n\r\n\r\nClayton Edrington (30:38.45)\r\nYeah, I'd say it's maybe on the average side, maybe a little bit shorter than most, but I think it's typically, it's a pretty quick process. You know, you sign your agreement, you need to get to training and then just get all your ducks in a row and you can launch.\r\n\r\n\r\nNikolas Hulewsky (30:50.222)\r\nYeah, that's what I was going to ask. What is training? you're surprised you work at Amazon. You are not a roofer. How did you get up to speed?\r\n\r\n\r\nClayton Edrington (30:59.57)\r\nYeah. So the initial training we did is it's like, I mean, it's two weeks. went to Richmond, Virginia, where the empower headquarters is, you stay, stay there for the full two weeks. and they help you get going on a lot of fundamentals. you know, the, the two weeks I would say is the max that your brain can hold, information. If there's any longer, you know, you, you forget it all. So for me, it was adequate getting there for two weeks.\r\n\r\n\r\nNikolas Hulewsky (31:21.582)\r\nYeah.\r\n\r\n\r\nClayton Edrington (31:27.122)\r\nlearning fundamentals of selling something I've never done being at Amazon. It's just kind of how, you know, roofing one-on-one type of concepts.\r\n\r\n\r\nNikolas Hulewsky (31:34.892)\r\nSo was it really sales focused? It wasn't like, this is how roofing works.\r\n\r\n\r\nClayton Edrington (31:41.416)\r\nDefinitely an overview of everything. How roofing works was a huge part of it. And then sales for me, like I mentioned, I am familiar with construction. So in my mind, that wasn't as worrisome. So for me, it was really focusing on sales and learning the roofing industry.\r\n\r\n\r\nNikolas Hulewsky (31:58.51)\r\nOkay, so over the four months though, that's a two week bootcamp. Did they hook you up with like a mentor? Did they hook you up or preceptor? did you go to other locations to shadow for a day? how, I'm assuming you seem like a pretty calculated and obviously very smart guy. I'm assuming you were like, hey, I gotta get up to speed quickly. What else did you do?\r\n\r\n\r\nClayton Edrington (32:17.234)\r\nYeah. So I, so after the training, you know, you have these resources that you can call on. So you're doing weekly calls with the, the franchise or helping you get up speed. our brand president, David, you know, you have the cell phone number, you can text call, ask any questions you need. but for me, the huge part of it was also kind of the community, like the group I went to training with first and foremost.\r\n\r\n\r\nas well as the broader group of franchisees. If you want to put it in non-franchise terms, it's like a mastermind kind of type of concept. You have people doing similar things as you.\r\n\r\n\r\nNikolas Hulewsky (32:57.187)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (33:00.494)\r\nNo, I mean, it's really smart with a peer group. Do you maintain that peer group even as you've launched?\r\n\r\n\r\nClayton Edrington (33:06.066)\r\nYes, 100%.\r\n\r\n\r\nNikolas Hulewsky (33:08.086)\r\nIs it formal or is it informal?\r\n\r\n\r\nClayton Edrington (33:10.994)\r\nInformal, we mostly are just over like Microsoft Teams, but we pick up the phone like I'm talking to at least one person, you know, every week we are constantly chatting with each other.\r\n\r\n\r\nNikolas Hulewsky (33:14.838)\r\nYeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (33:22.028)\r\nAll right, so as you were going through this process, I know you projected that you wouldn't make any money the first year, or at least you wouldn't pay yourself anything the first year. When you were doing it out on the spreadsheet though, what did you think your sales were going to be in year one? Top line.\r\n\r\n\r\nClayton Edrington (33:38.546)\r\nYeah, so I put the magic nice $1 million number out there. Honestly, like, yeah, nice and round. All the projections are really just that, right? It's a guess. Like you, unless you have super hard data and you know you can execute perfectly, it's tough to actually project something accurate. So I put that $1 million number out.\r\n\r\n\r\nNikolas Hulewsky (33:42.414)\r\nMm. Mm. It's a number.\r\n\r\n\r\nNikolas Hulewsky (34:03.704)\r\nI\r\n\r\n\r\nClayton Edrington (34:04.99)\r\nthere to get an idea of what a business like this would look like from a math perspective. But I prepared myself mentally for it could be a lot worse or you know, hopefully a lot better.\r\n\r\n\r\nNikolas Hulewsky (34:15.17)\r\nWell, you're three months in, or say February, March, April, you're in the middle of May. So this is called three and a half months. How has it gone the first three and a half months? Where are you at?\r\n\r\n\r\nClayton Edrington (34:21.961)\r\nYeah.\r\n\r\n\r\nClayton Edrington (34:28.212)\r\nYeah, things have gone good for me so far. February, I had a little bit of a panic attack. We started out, I wasn't getting any leads. The leads I did get, I wasn't closing anything. I had a chat with my wife, I was like, man, we're in for a long road. But once I got a little bit of experience under my belt, things started to really hit March. In March, I sold around 140,000.\r\n\r\n\r\nNikolas Hulewsky (34:57.357)\r\nWow.\r\n\r\n\r\nClayton Edrington (34:58.045)\r\nAnd in April I sold a little bit over a hundred thousand and, you know, hoping to improve that even in May as well.\r\n\r\n\r\nNikolas Hulewsky (35:06.498)\r\nThat's awesome, man. By the way, I talk to Cole all the time. Cole's company is on pace. This is his second year. He's on pace to do $8 million this year. And every week it's either like manic Cole or depressive Cole. And it's usually depressive Cole because it's like, hey man, how's it going? I don't know. Sales are down again. I don't even know what to say, I'm like, Cole, you're in year two and you're going to do like $8 million this year. It's not good enough. So just buckle up. You'll feel that way for a while.\r\n\r\n\r\nClayton Edrington (35:08.691)\r\nYeah, thank you.\r\n\r\n\r\nClayton Edrington (35:22.453)\r\nHahaha\r\n\r\n\r\nClayton Edrington (35:34.536)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (35:36.558)\r\nBut so about $300,000 in the first three and a half months.\r\n\r\n\r\nClayton Edrington (35:42.512)\r\nof projects sold, correct? Nope.\r\n\r\n\r\nNikolas Hulewsky (35:44.236)\r\nYeah, yeah, yeah. No, no, I get it. That's nuts, man. That's awesome. That's good, right?\r\n\r\n\r\nClayton Edrington (35:50.684)\r\nyeah, yeah, that's way better than I projected or thought was possible. So I'm extremely happy with it.\r\n\r\n\r\nNikolas Hulewsky (35:56.642)\r\nDid you, did you like launch into the busy sea? Like, is there a busy season of roofing? I know in the South, it's like hurricane season, but like where, what is it in Tacoma, Washington? Is there a busy season?\r\n\r\n\r\nClayton Edrington (36:06.78)\r\nYeah. So we're not necessarily like a store market here. so it's mostly retail, but yeah, there definitely is busy season. It's coming out of winter. you know, hitting spring and summer, then it's full speed ahead. so I've heard, so we'll see. mean, yeah, sorry. So spring and then summer is crazy. And then fall starts to taper towards the end of it. yeah, yeah, yep. Yeah. So I'm definitely seeing that definitely seeing things pick up. but\r\n\r\n\r\nNikolas Hulewsky (36:21.506)\r\nIn the fall, you mean?\r\n\r\n\r\nNikolas Hulewsky (36:27.818)\r\nyou're saying full speed ahead right now. Got it, got it, okay.\r\n\r\n\r\nClayton Edrington (36:35.516)\r\nI'm all open to getting even more busy.\r\n\r\n\r\nNikolas Hulewsky (36:39.222)\r\nOkay, second to last question. How do you think about cashflow management? is Bumble helping you with that? Right? Because sometimes you do use, you make all these sales and you're like, I'm sitting on a hundred thousand, $200,000 of cash in the bank. And unless you're either disciplined or smart or like understand the cycles of the business, you can delude yourself into thinking, I can take a distribution. we're doing great. Or I can hire this person or that person. are they like, do they help you with the cashflow management?\r\n\r\n\r\npiece of roofing.\r\n\r\n\r\nClayton Edrington (37:11.484)\r\nYeah, I mean, I'd say something from training that did stick with me pretty well is, you don't rob Peter to pay Paul. So you can get, you know, all of these deposits and your bank account can start to look pretty big, but you got to remember those, those trailing invoices coming from supplies and actually paying your subs and things like that. you know, there's definitely guidance and warnings that are given.\r\n\r\n\r\nNikolas Hulewsky (37:20.066)\r\nYeah.\r\n\r\n\r\nClayton Edrington (37:37.992)\r\nBut it's definitely something as a franchisee you need to stay on top of and you need to be aware of.\r\n\r\n\r\nNikolas Hulewsky (37:43.214)\r\nAll right, here's the last question. What advice would you give to anybody who's going through the process right now? Whether they're looking at Bumble, whether, whatever, they're just looking at making the jump, they're looking at franchises, looking back now on the process. What are your learnings?\r\n\r\n\r\nClayton Edrington (37:58.996)\r\nYeah. So, you know, if you're, if you're willing to grind, if you're have that kind of startup mentality, um, I think most of these franchise businesses are a franchise for a reason. You can make the model work, uh, one way or another, nothing's guaranteed. But I think the biggest piece of it that I maybe didn't quite consider, but I looked into is the sacrifices you're going to make on your personal life. Right. So.\r\n\r\n\r\nwith your wife, your kids, your friends, your running, your health, whatever it is. It sounds pretty cliche, but I think it's a most important piece of success. know, without my wife who is working a full-time demanding job at AWS, taking care of our daughter when I'm not there in the mornings and evenings, and taking care of me because I'm more or less a child of how busy I am. I need to be fed and my clothes washed and everything like\r\n\r\n\r\nWithout that level of support, it's going to be really tough, really tough. I don't think you'd be able to have success without that.\r\n\r\n\r\nNikolas Hulewsky (39:07.362)\r\nDude, well, I can't wait to check in with you in a year from now after you've got three locations cranking in the Pacific Northwest. It's exciting times. It's exciting times. All right, my I appreciate this and we'll talk soon. Stay on for a second. Let's let it up.\r\n\r\n\r\nClayton Edrington (39:13.81)\r\nLet's hope so. Let's hope so.\r\n\r\n\r\nClayton Edrington (39:20.104)\r\nYeah, sounds good. Thanks, Nick.",
  "metadata": {
    "duration": "",
    "date": "",
    "platform_source": "Google Drive"
  }
}