{
  "episode_number": "74",
  "episode_title": "From Self-Made Billionaire at 35 to Bankruptcy Just 12 Months Later with Zac Prince",
  "guest_name": "Zac Prince",
  "business_name": "RE Cost Seg",
  "transcript": "﻿Nik (00:01)\r\nAll right, Zach, welcome to Niconomics, my friend.\r\n\r\n\r\nZac Prince (00:04)\r\nNick, excited to be here, man. I'm a fan of the show and your Twitter account and the type of content that you put out there. So I'm pumped. Thanks for having me.\r\n\r\n\r\nNik (00:13)\r\nHey, and that 50 bucks is in the mail that I paid you to say that. So thank you for saying that. Really quickly, why don't you give people an idea of what you're currently doing and how you make money?\r\n\r\n\r\nZac Prince (00:24)\r\nsure. So, I'm currently the CEO of a company called RE Cost Seg. our business provides cost segregation studies to real estate investors, which sounds complicated. The short and easy way to describe what we do is we save real estate investors money on their taxes. If you've heard stories of folks who have cash flowing real estate and they're getting income from that real estate, but they don't pay taxes on it, cost segregation.\r\n\r\n\r\nThe studies are one of the key tools in that toolbox that real estate investors use to keep more cash in their pockets. So RE Costseg is a newer cost segregation study firm. built some technology and tools that enable us to deliver cost segregation studies better, faster, cheaper than some of the sleepy providers. So that's my experience.\r\n\r\n\r\nNik (01:12)\r\nSo we're going to get into the nitty gritty of RE Cost Seg because I am very curious about that business and that industry. But you are, I think, an, you're like the Dos Aqis guy, you know, one of the most interesting men in the world because you've been over this roller coaster. You had experience with BlockFi, which we'll talk about. Then publicly BlockFi goes through bankruptcy and now you're joining onto RE Cost Seg with any...\r\n\r\n\r\nfor anybody who's on social media, it's a Huber company. so, know, Huber, Nick Huber has his own brand that's kind of big and everybody knows about. And so you've stepped into the CEO role there. So anyways, you've got like this really cool background that I know about, but tell me about Zach growing up. Like what were you like, where were you from? What's your background and how did it kind of get you here?\r\n\r\n\r\nZac Prince (02:04)\r\nYeah, sure. I grew up in San Antonio, Texas. I would say, you know, middle, middle -class family. I was always kind of entrepreneurial. Like I was one of the, you know, kids that was selling candy on the bus in seventh grade. I got, actually got suspended. I got suspended from the bus because the driver told me to stop selling candy and I did. Yeah. And I came home with a little like, you know, suspension from the bus. Parents weren't too happy with, but.\r\n\r\n\r\nNik (02:24)\r\nReally?\r\n\r\n\r\nZac Prince (02:31)\r\nI was a very competitive sports player in particular tennis. was, like top 100 in the country as a, as a junior tennis. put myself through school as a semi -professional online poker player, back in the day when that, you know, ESPN just started showing the world series of poker and you could take a credit card and deposit, you know, money on poker or poker stars. And everybody was doing it before.\r\n\r\n\r\nNik (02:39)\r\nHoly crap.\r\n\r\n\r\nZac Prince (02:59)\r\nbefore some laws got passed that made that, you know, illegal or, or a lot harder. and I graduated college and I graduated in May of 2009 and really had no clue. You know, I graduated from like a tier two university, tier three, maybe Texas state university. mean, great school, love it, but, not, not a place where like McKinsey goes to recruit people in the, in the graduating classes. And, I had about six months where I had no idea what I was going to do.\r\n\r\n\r\nnationally and then luckily a friend of mine from high school came home during Thanksgiving and he's like how you doing and I'm and I was like bad I don't like I don't know what I'm gonna be when I grow up and he was like well I'm working for this startup in in New York City and I'm pretty sure I could get you an interview you know we're hiring and he got me an interview and I joined my first tech company and it ended up being that first company that I joined ended up being a really\r\n\r\n\r\nkind of career defining experience for me. was employee number 15 at a fast growing digital advertising startup. And, you know, I worked my ass off. was like, first person in the office every day, last person out every day and fast forward three years, I had moved from just complete bottom of the barrel intern when I started to like the top producing salesperson on a team of 200 people. And we got acquired by Google. We got acquired by Google.\r\n\r\n\r\nNik (04:26)\r\nshe needs.\r\n\r\n\r\nZac Prince (04:29)\r\nYeah, so that was my first job.\r\n\r\n\r\nNik (04:29)\r\nDude, that's incredible.\r\n\r\n\r\nSo before you keep going, you said a bunch of stuff in there that I was fascinating. Did you play tennis in college?\r\n\r\n\r\nZac Prince (04:40)\r\nno. So, you know, top 100 in the U S juniors is like, is, is solid, but it's not get a scholarship at a good university worthy, rankings. like I had scholar, I had a couple of scholarship offers from schools that just, I didn't want to go to, and I knew I wasn't going to go pro. so I did not, I played club in college. I did not, I did not play, competitively.\r\n\r\n\r\nNik (05:04)\r\nInteresting. My, so I just started playing tennis. My wife and I just joined a tennis club here where we are. And a couple of times a week we'll take off at like two o 'clock and just play for two hours. And it's been amazing dude. It is so it's been fun. I mean, I suck at it, but it's just been nice to have like a sport I could play with my wife and be active. But\r\n\r\n\r\nZac Prince (05:28)\r\nthe grades and I think I think there are really wonderful, you know, athletic and exercise things that come from tennis, but I think it also teaches a ton of kind of like mental toughness, especially singles tennis, you know, like if you're someone who's got kids and you're thinking of things to do to like make them mentally tougher, like playing tennis, I think is a big one. Team sports are one thing and they're great in their own regard, but\r\n\r\n\r\nNik (05:43)\r\nOkay.\r\n\r\n\r\nLove it.\r\n\r\n\r\nZac Prince (05:57)\r\nThere's something about having no one to blame but yourself if you lose a match that you get from tennis and any other individual sport that I think is really special.\r\n\r\n\r\nNik (06:08)\r\nIs that what you think you took from tennis? Is like, hey, it's me, it's on me. There is nobody else to blame when things go bad.\r\n\r\n\r\nZac Prince (06:18)\r\nIt's one of the many things I mean, it's also just fun, you know, I mean I played tennis this morning I like racket sports in general. I picked up squash in New York City because playing tennis is really hard There's just not a lot of words I also recently started playing the Dell In New York City, but now I'm living in Michigan and I don't think there's any pedal courts out here yet. That's like it was invented in Mexico It's kind of like a hybrid between school It's awesome\r\n\r\n\r\nNik (06:42)\r\nI've seen them. Yeah, they're the ones with like the all glass. Yeah, I've seen those.\r\n\r\n\r\nZac Prince (06:47)\r\nSuch a fun sport, such a fun sport.\r\n\r\n\r\nNik (06:50)\r\nDude, and like the workout looks freaking intense. I can't even.\r\n\r\n\r\nZac Prince (06:56)\r\nYeah, the rallies are really long. hard to, you know, like in tennis, you can hit a good shot. It can be a winner. mean, just your serve, the point can be over. In Padel, once you kind of know what you're doing, similar to pickleball maybe, but like more athletic, there's a lot more rallies. And so, you know, the cardio can be really good.\r\n\r\n\r\nNik (07:12)\r\n-huh.\r\n\r\n\r\nI actually had somebody pitch me a couple of months ago to fund the construction of a Padel Court in Utah. Because there's a large Hispanic community in Utah, and there's only a few of these courts. Anyways, I didn't know anything about it, and then I started obviously looking into it and thought it was super cool. I love that you played poker, so obviously you're very bright. But will you talk about what it was like to graduate college?\r\n\r\n\r\nin 2009, I got married in 2008, and actually started college in 2008. You graduated in 2009, I'm guessing we're about the same age. I'm 38. You're probably 39, 37 in that range. Okay, cool. So we're very close in age. And so to graduate from a university and not have a job during that time was very stressful. What did you think you were going to do? Like if this guy hadn't come up?\r\n\r\n\r\nZac Prince (07:57)\r\nYeah, turning 38 in a month.\r\n\r\n\r\nNik (08:15)\r\ncome up to you and be like, hey, I think can get you job at this tech company. Where did you think you were headed?\r\n\r\n\r\nZac Prince (08:20)\r\nI didn't know we're good, man. I didn't know. you know, so poker, I was a I was playing poker until about my junior year of college. That was when you know, that was like a year after Congress passed a bill called the UI GEA unlawful internet gambling enforcement act, which really dried up the poker games. And so\r\n\r\n\r\nNik (08:44)\r\nMm\r\n\r\n\r\nZac Prince (08:45)\r\nYou know, when I, my senior year of college, I had actually worked at a new hotel in San Marcos, Texas, as a room service captain, which is a fancy word for, you a room service, like delivery guy. and so was doing that. Like the hotel, like was nice enough to give me like an internship in HR, you know, unpaid, but just like starting to, in theory, learn some type of, you know, desk job type of thing.\r\n\r\n\r\nNik (08:59)\r\nYeah.\r\n\r\n\r\nZac Prince (09:16)\r\nWhich by the way, I'm a horrible candidate for any HR position. Literally, I was applying for, I had no idea. I no idea. I wanted to do something in sales, I just didn't have family connections. I didn't have a good degree from a great school. I was kind of flapping in the wind, really concerned for myself.\r\n\r\n\r\nNik (09:21)\r\nHahaha\r\n\r\n\r\nOkay, so I just think it's cool to find these pivotal moments in people's lives that at the time, yes, you were stressing about, but you just have no idea what the impact is going to be years down the road. It takes you to New York City, you work in the startup scene, and then many things that followed have really been a result of that kind of first experience, or at least were set in motion because of that first experience. For you, when you guys grew and you sold to Google, did you have a liquidity at that time? No.\r\n\r\n\r\nZac Prince (10:12)\r\nNo. mean, I did. Well, a lot of people did. You know, a lot of people at the company, but I got hired as an intern. And maybe three months after I was hired as an intern, I had a lot of back and forth with the company because they wanted to make me full time. But I didn't want to go full time because the salary I was going to make full time relative to the cash I was getting from\r\n\r\n\r\nworking, you know, 6665 to 80 hours a week as an intern was I was going to like take a pay cut. And I was like a poor kid in New York City sleeping on my friend's couch. So like, so equity was not a concept that I was like advocating for when I transitioned to a full time employee. So I basically had whatever the lowest amount I think I got seven grand or something as a result.\r\n\r\n\r\nNik (10:51)\r\nI guess.\r\n\r\n\r\nIf let's say that you had agreed to take.\r\n\r\n\r\nZac Prince (11:07)\r\nI everybody else make a lot of money. And then I was like, I need to, I need to pay attention to this equity thing. Because\r\n\r\n\r\nNik (11:16)\r\nOkay, so tell me, let's say that first conversation you had been like, okay, yeah, I'll take the full time even though it'd been a pay cut. Would you have gotten equity at that point?\r\n\r\n\r\nZac Prince (11:25)\r\nI don't know. I got equity when I went to full time. think like, I think the, I think the initial full time offer was, you know, some amount of equity, but I was so hung up on getting as much cash as I could that they're like, all right, well, we'll reduce some of the equity.\r\n\r\n\r\nNik (11:28)\r\nYeah, but if you had earlier.\r\n\r\n\r\nOkay, what my appetite here, so how much money do you think you lost by optimizing for that?\r\n\r\n\r\nZac Prince (11:46)\r\nmean, not a ton, like I was junior, but probably half a million, two million bucks, something like that. mean, my buddy who, my buddy who brought me into that company, he, got a little under a million dollars and he's similar to me started, you know, started as an intern, like a year before I did.\r\n\r\n\r\nNik (11:59)\r\nIncredible.\r\n\r\n\r\nOkay, so that was a big lesson to you. Like, dude, equity is paramount. Is it more, yeah, man, if I had, I actually lost a couple million dollars of equity once, twice, I should say. And those were very formative experiences for me. Like, I don't ever want to be in a position where somebody else can make the determination of whether or not I'm gonna get this equity. What did you do next?\r\n\r\n\r\nZac Prince (12:08)\r\nImportant.\r\n\r\n\r\nSo I hated Google. know, like in hindsight, I would have stuck around Google longer, but at the time I was like very, uninterested in like the big company vibes that existed at Google. I thought it was all really lame and I thought I was going to make less money. because the compensation, the compensation for the sales team at the, the, at the company AdMill that got acquired was like 80%.\r\n\r\n\r\nbased on what you as an individual were producing and 20 % based on the team. at Google, that was flipped. It was 80 % what the team did and 20 % what you did. So I was like, screw this. And I left with some of my colleagues from AdMeld and we launched the North American operation for a German based ad tech company.\r\n\r\n\r\nNik (13:08)\r\nHmm.\r\n\r\n\r\nWhen was this by the way?\r\n\r\n\r\nZac Prince (13:30)\r\nThis is probably like 2013 -ish, 2012 -2013 timeframe.\r\n\r\n\r\nNik (13:38)\r\nAnd did Google, did they purchase with stock or with cash?\r\n\r\n\r\nZac Prince (13:44)\r\nIt was a $400 million cash deal.\r\n\r\n\r\nNik (13:46)\r\nOkay. So you weren't getting any Google stock at that time. You would have potentially gone out with a partner compact.\r\n\r\n\r\nZac Prince (13:52)\r\nNo, Google gave people, yeah, I also left money on the table. Yeah, no, Google, Google tried to get me not to leave. Like they were like, dude, why are you leaving? I'm like, sucks. They're like, we can pay you a lot more money. And I was like, I don't like the big company vibe. I'm to go to a startup again. Yeah. Yeah, no, I've, friends who, know, from that first company who are still at Google and I'm sure they've, you know, Yeah. Yeah. Of course.\r\n\r\n\r\nNik (14:07)\r\nmy gosh. my.\r\n\r\n\r\nmulti -millionaires.\r\n\r\n\r\nZac Prince (14:21)\r\nBut, but I made money at the thing I went to. you know, I got, I got, half a point, you know, like 50 bips of equity in this new German ad tech company that we launched in the U S, me and two of my colleagues from the company that Google bought. And, we grew really quickly from like zero to 15 million of, of annual revenue, in about 18 months, just in, for the U S operation.\r\n\r\n\r\nNik (14:50)\r\nSay that one more time, zero to what in 18 months?\r\n\r\n\r\nZac Prince (14:52)\r\n$15 million in revenue.\r\n\r\n\r\nNik (14:54)\r\nin ARR or is it just revenue?\r\n\r\n\r\nZac Prince (14:59)\r\nIt's hard to say it was ARR. So I mean, what we were doing, I would say it's ARR -esque, but it was performance -based advertising. So these were the early days of dynamic retargeting. So retargeting is like someone comes to your website, they don't buy something or they do, you're able to serve them an ad somewhere else on the internet later. We think of that as no big deal now, but it was a big deal back then and it was very new.\r\n\r\n\r\nand we did dynamic retargeting. were one of the first movers in dynamic retargeting, which basically meant instead of just showing the user an ad for gap, we're going to show a user an ad for the exact black sweatshirt that they had in their cart that they did not buy. We're going to remind them of exactly. And so it worked right. And we went to, primarily fashion, but other types of retailers with our dynamic retargeting. were a first mover and,\r\n\r\n\r\nNik (15:43)\r\nYeah, okay.\r\n\r\n\r\nZac Prince (15:57)\r\nYou know, their advertising budgets would be performance based, meaning, you know, it needed to produce certain conversion results and we needed to operate within a CPA, you know, guideline, but, it was, it was semi recurring and it was high margin, you know, our margin on it was like 40 % or something, you know, speaking. So.\r\n\r\n\r\nNik (16:19)\r\nGeez Louise. So you do that within 18 months. I'm assuming, how are they valued? How are those types of companies valued? Are they valued off of top line revenue, bottom line revenue? Like is it considered a SaaS company?\r\n\r\n\r\nZac Prince (16:25)\r\nand then.\r\n\r\n\r\nI don't know. It's probably in between. mean, it's like, it's more like, like, take the midpoint of an advertising agency and a fast company. And it's probably, it's probably at the midpoint, but that company got bought after I was there for 18 months, it was sold to Dunn Humby, which is like a European holding company kind of a thing. The biggest thing they own is Tesco, is Tesco, the grocery stores. So my friends were giving me a hard time that I was, you know,\r\n\r\n\r\nNik (16:40)\r\nMm\r\n\r\n\r\nZac Prince (17:01)\r\ngoing to be like working at grocery stores after this acquisition, but it got acquired. had full equity was imposed to me. So I had built into my like equity agreement that I got accelerated vesting on a change of control transaction. my like, my like half a point of equity actually turned into actually turned into real money. And so that was good.\r\n\r\n\r\nNik (17:05)\r\nBut... But... Go ahead.\r\n\r\n\r\nThat's awesome. You don't have to confirm or deny, but I'm guessing $15 million in revenue, applying a multiple to that, you probably had $750 to like $1 .5 million that you walked away with at that sale.\r\n\r\n\r\nZac Prince (17:43)\r\nYeah, roughly. it was paid out over, there was an earn out where it was paid out over, you know, a couple of years. Not all at once upfront, but, but yeah, it was one to 2 million.\r\n\r\n\r\nNik (17:54)\r\nHow old were you?\r\n\r\n\r\nZac Prince (17:57)\r\n26 maybe, 20.\r\n\r\n\r\nNik (17:59)\r\nOkay, so you're freaking 26. You probably think you're the richest person who's ever lived because you have, you know, one to $2 million. Did you stay? What did you do next?\r\n\r\n\r\nZac Prince (18:10)\r\nWell, I was in New York city, so I wouldn't say that I necessarily felt rich and it was, it was out over like three years. and you know, it was after that acquisition, I basically went from having roommates to having my own apartment, which, know, it was still a department like in Manhattan, but it was like a five floor walk up. You know, it's not like I was, pulling my fancy car into a marble driveway at a doorman building and, in, the upper East side, but.\r\n\r\n\r\nNik (18:14)\r\nYeah.\r\n\r\n\r\nBig deal.\r\n\r\n\r\nSure, sure.\r\n\r\n\r\nZac Prince (18:40)\r\nBut it was great. It was great. And yeah, then after that, I moved into financial technology. So I always had dreams of being like in the finance world. And I got the opportunity with a friend to be an early employee at a financial technology company that he had founded that was built off of some of the ideas that we saw work in ad tech.\r\n\r\n\r\nNik (19:07)\r\nMm\r\n\r\n\r\nZac Prince (19:07)\r\nbeing applied to the online lending industry. So this was the early days of like Lending Club and SoFi and Prosper and some of these online, you know, lending businesses. so I did that for about two years. I was the first salesperson, built a sales team at a company called Orchard Platform. met my wife at that company.\r\n\r\n\r\nNik (19:36)\r\nNice, nice. Well worth it.\r\n\r\n\r\nZac Prince (19:37)\r\nYeah. And then worked at another FinTech company as SVP of sales in client service before starting a company myself.\r\n\r\n\r\nNik (19:51)\r\nGive me one second. What's up, dude? Hey, is mom home? Yeah. Yeah. She's home. Can you say hi? Can say hi, Zach? All right. Let's go find mom real quick. Give me one second. Let's go find mom. big baby. Did you have a big day? Yeah. I thought you found a new song.\r\n\r\n\r\nZac Prince (19:58)\r\nDavid, yeah.\r\n\r\n\r\nNik (20:35)\r\nHe's two and he's just figured out how to open doors. So now I realize I need to lock that door. So that's cool. That was the first time that's happened. All right.\r\n\r\n\r\nZac Prince (20:44)\r\nThat's awesome. We have a two year old and he's obsessed with doors. Like literally anywhere we take him, I have to like, hey, just so you know, our kids really into doors. Like are there any doors at your house that like you really don't want opened or something? I'll make sure that he like doesn't touch that door. yeah, he's going to It's the strangest thing, man.\r\n\r\n\r\nNik (20:50)\r\nReally?\r\n\r\n\r\nHe's really into doors. I can't wait to his, his stories like he's gonna have a door company. Alright, so you meet your wife at this fintech company, you spend a couple years there. Was this the fintech company prior to founding block fire? Like what was the founding story of block five?\r\n\r\n\r\nZac Prince (21:13)\r\nYeah.\r\n\r\n\r\nThe founding story of BlockFi was when I made that move to FinTech, I started a blog just as a side project where I was writing about new companies that offered kind of modern digital first financial products for consumers. So I was writing about online lending platforms. I was writing about robo advisors and writing that led me to discover crypto.\r\n\r\n\r\nI was writing on this blog that, no one read, back in like 2015, that I thought Bitcoin and, and later Ethereum were really spectacular, venture -esque bets that anybody could make with any amount of money. and, know, I followed my own advice and bought, bought some, and then I was at another FinTech company in 2017.\r\n\r\n\r\nAnd Bitcoin and Ethereum were appreciating substantially. It was the bull market of 2017 for crypto. And it was the ICO boom. somebody sent me an ICO for a company called Salt Lending, which was going to make dollar loans with cryptocurrency as collateral, basically an online lending business.\r\n\r\n\r\nNik (22:28)\r\nI remember, yeah.\r\n\r\n\r\nMm -hmm.\r\n\r\n\r\nHmm.\r\n\r\n\r\nZac Prince (22:49)\r\nAnd I looked at it and I looked at the team and you know, like most of the team had been like working together, managing a restaurant most recently. And I'm like, if these guys, if these guys are going to pull off a $50 million or whatever it was, ICO for a lending business. And I actually have experience and know what I would do to build an online lending business. And I believe in the cryptocurrency sector.\r\n\r\n\r\nIf I don't start a company, if I don't leave the company I'm at and start a company right now, I'm always going to regret having not done it. so basically being an investor and kind of following the market coupled with my experience working at FinTech companies is what led me to the, you know, the kind of light bulb moment for, for.\r\n\r\n\r\nNik (23:26)\r\nTotally.\r\n\r\n\r\nGet, I don't, mean, personally, I wanna get into the nitty gritty of BlockFi, but I actually don't wanna spend a ton of time on BlockFi. Will you just give a, 30 second overview of like, what did BlockFi do? What was the service?\r\n\r\n\r\nZac Prince (23:55)\r\nSure. mean, the original idea was just to make loans with cryptocurrency as collateral. So you own Bitcoin. It's an asset that's worth a lot of money. You don't want to sell it like any other asset, your house or your portfolio of stocks. You should be able to get a loan with your Bitcoin as collateral. Obviously traditional banks back then weren't going to do that. They're still not doing it today. So there was an opportunity for an alternative lending business. And that was the original idea for BlockFi. But if you fast forward,\r\n\r\n\r\nNik (24:22)\r\nand your company went from your company went from go. I was just gonna give like give like the high level. Alright, so you found block by it goes from zero to what valuation and what period of time.\r\n\r\n\r\nZac Prince (24:25)\r\nYeah, go ahead.\r\n\r\n\r\nWe went from zero to a $3 billion valuation, 700 employees, 15 billion in client, 15 billion in client assets on the platform, five products. wasn't just loans. were basically a bank. from our business model was basically a bank from a regulatory perspective. were not a bank. and that took about four years, maybe four and half to the peak.\r\n\r\n\r\nNik (25:01)\r\nWere you a billionaire?\r\n\r\n\r\nZac Prince (25:04)\r\nI was, I mean, on paper, was close. I think I was a billionaire at one point in time, but\r\n\r\n\r\nNik (25:08)\r\nWere you? How much did you own a BlockFi when it was a $3 billion valuation?\r\n\r\n\r\nZac Prince (25:14)\r\nprobably between 25 and 30%.\r\n\r\n\r\nNik (25:19)\r\nGeez, Louise, dude, you're a billionaire. I know it's on paper. I get it. But like, do you remember when XRP had that run? And like the founder of XRP was like the second richest person in the world for a period of time. So freaking nuts. So nuts. So what's funny is Chris, my business partner, I think he had a BlockFi credit card or had, I can't remember if it was a credit card or the account for a period of time.\r\n\r\n\r\nZac Prince (25:26)\r\nYeah.\r\n\r\n\r\nYeah.\r\n\r\n\r\nfavorite product.\r\n\r\n\r\nNik (25:48)\r\nAnd like, so I've known about BlockFi for a while. We've known we've been into crypto for a long time. We have a crypto business. I shouldn't say it's a crypto business. We sell hardware to crypto miners. So I'm a believer in this space. I think it's I think it's a great space. You your company, unfortunately, was caught up in the tidal wave of the first domino being Luna Terra, kind of having liquidity issues. And then I don't know, there was a confidence crisis in the entire market. Am I\r\n\r\n\r\nmy articulating that appropriately or like how did did unravel?\r\n\r\n\r\nZac Prince (26:18)\r\nYeah, I think I summarize it as there being three big things that kind of caused BlockFi's downfall. The first was regulatory stuff. So, you know, there's a history in the FinTech industry of new innovations, regulatory enforcement, but then after the enforcement, a path being carved for the innovator to exist. And this was part of our strategy. Like a lot of our\r\n\r\n\r\nbig VC investors came from the Peter Thiel PayPal mafia side of the world. So we had a view all along that we would have some type of regulatory reckoning, I think reckoning is too extreme of a word, but there'd be a regulatory moment where, you know, some stuff would need to get figured out specifically for this product we had that paid people interest on their cryptocurrency holdings. It's the first couple weeks because we had that moment, but it was\r\n\r\n\r\nNik (26:49)\r\nMm, right.\r\n\r\n\r\nZac Prince (27:14)\r\nway more severe than any of us could have ever anticipated. So when these moments happen to like PayPal and Lending Club, the fines would be two to maybe 10 million bucks on the super high end. And the conclusion would be some adjustments to the business model, some regulatory clarity, and then the business goes on. In BlockFi's case, it was a hundred million dollar fine, and it was a complete shutout from the US ARC it for that product.\r\n\r\n\r\nSo that was one. Second thing was, imagine you're in a country and the country is called crypto and there's five of these new bank type of things. One day out of the blue, two of them shut their doors and say to everybody, you can't get your money out. What do you think happens to the other three? There's a run on the bank. And so two of our biggest competitors, Celsius and Voyager, after Terra Luna, they blew up. And so we went from\r\n\r\n\r\n12 billion to 2 billion in client assets on the platform in a period of like two weeks. So as that was happening, we were, you know, looking to strengthen the business from a capital perspective and withstand this storm that we were in the middle of. And the way that we decided to do that was to sell the business to FTX, which for\r\n\r\n\r\nNik (28:16)\r\nmy gosh.\r\n\r\n\r\nZac Prince (28:39)\r\nwhich for a moment in time, which for a moment in time we thought was was a great outcome.\r\n\r\n\r\nNik (28:45)\r\nSo, okay, before we talk about FTX, I wanna talk about the first two, because the FTX thing is a whole other thing. What you're describing on the regulatory side of things is actually very similar to the cannabis industry, where federally it's still illegal, but each one of the states has kind of done their own thing. And so in many states it's legal and they're not enforcing it, but it's still illegal at the federal level. And so there's a question of clarity around, okay, what do we do with marijuana?\r\n\r\n\r\nAnd it looks like Congress is looking to actually schedule it as a class two, I can't remember, drug. it would take the criminality out of it. It was the same type of bet that was made in the crypto market, which was, okay, there is a question. There's not clarity yet on how Bitcoin, Ethereum, these other crypto assets are going to be viewed by the SEC. Are they assets? Are they commodities? And the hard part was, especially when you have the ICO boom,\r\n\r\n\r\nthey get conflated where it's like, no, they're commodities. Well, how do we treat Bitcoin? So you're talking about they came out with some regulatory clarity that impacted your business and you got fined $100 million, right?\r\n\r\n\r\nZac Prince (30:00)\r\nWell, I would say they did not provide the clarity, but they hit us with the $100 million fine and the shutdown for one of our products in the US market, irrespective of not finding the clarity.\r\n\r\n\r\nNik (30:09)\r\nGeez Louise.\r\n\r\n\r\nOkay, so you're dealing with all this crap and then you talk to FTX, which is the white knight, savior of the industry. Just on a personal level, did you ever meet Bankman Fried and his crew or was it all done through lawyers?\r\n\r\n\r\nZac Prince (30:31)\r\nI did. No, no, I probably had with Sam specifically, I had maybe five zoom calls and one in person meeting.\r\n\r\n\r\nNik (30:46)\r\nWhat was that time like? it, for you, it like, red flag, yellow flag, or was it like, I wasn't even thinking about that. I was just trying to save the customer assets on the platform in order to make sure that there was a viable entity post transition.\r\n\r\n\r\nZac Prince (31:03)\r\nNo, I mean, we thought they were so, you know, us selling to them wasn't the only relationship we had with them. We had been a lender with their trading arm, Alameda, for a long time, for years. They were one of our top five counterparties that we lent money to. And interestingly, around that time period, they were one of the best counterparties in terms of their responsiveness to us unwinding loans.\r\n\r\n\r\nSo BlockFi business, we had the interest account on one side, and then we lent that out to generate the interest that we were paying to folks on the other side. And this was all short duration in nature. The deposits were short duration and the loans were short duration. But you know, that, that gets stress tested. Customers start withdrawing. You've got to call the folks who have borrowed it and tell them we need it back and we need it back fast. And one of the ways you,\r\n\r\n\r\nYou know, one data point in terms of your, your borrower, you know, performance is how quickly they respond in those scenarios. And Alameda responded better, better than most better than, you know, traditional. Wall street firms who were also, you know, great borrowers. they fully repaid all the loans we had to them, which all of our, most of our institutional borrowers had to do at the time because of the capital outflows we were experiencing.\r\n\r\n\r\nNik (32:19)\r\nCheers.\r\n\r\n\r\nZac Prince (32:30)\r\nSo we had a lot of data points with them that pointed to them being a very remarkable, very profitable, you know, just a truly exceptional business. you know, knowing what I know now it's because we were being fed, you know, false information. but one of the, one of, think the most interesting things about Sam and the FTX story is that\r\n\r\n\r\nwithout the level of greed that I think existed and the level of kind of lack of an ethical compass that's kind of wired the same way as most people, they could have had just a huge business. Like FTX was wildly profitable. It was like a crypto exchange. If you could look back and say, all right, it's 2016 and you can start any business.\r\n\r\n\r\nNik (33:21)\r\nYeah.\r\n\r\n\r\nZac Prince (33:27)\r\ncrypto exchange would be on the short list of fastest most profitable businesses you could have possibly started and they had it was printing money. They just spent more money than it was printing. It's insane. But we thought they were, you know, we thought they were an incredible business. They had been a good borrower. They performed better than than almost any institutional borrower in a time of crisis and\r\n\r\n\r\nNik (33:37)\r\nBut they got great.\r\n\r\n\r\nZac Prince (33:57)\r\nWe thought the right strategy for BlockFi was to attach it to a larger, more financially stable business so that it could weather whatever the outcome of the period of volatility that all the markets were going through at the time.\r\n\r\n\r\nNik (34:17)\r\nWhat do you think Sam was thinking? Do you think Sam was like, I'll be able to weather this because I'll go raise more money? Or did he think he was going to make more money on trades? Was he just high on his own supply thinking he was the smartest guy in every room?\r\n\r\n\r\nZac Prince (34:32)\r\nI don't know. mean, God, it's so hard to say. I had to guess, if I had to guess, I don't think that my guess would be that they weren't, you know, they weren't insolvent at the time. But I think they...\r\n\r\n\r\novervalued equity like instruments, crypto tokens that they were the majority owner of. know, like if I have 100 shares of stock and I own 90 of them, you know, me selling 10 % of what I own is the equivalent of doubling what the market needs to consume of, you know, of that vehicle, whatever it is.\r\n\r\n\r\nbut I don't know, man, I don't purport to know. didn't know him that well, you know, like I didn't know him that well. I, the, person I worked with most closely, I won't say their name, but they, they weren't one of the people that got, like indicted. They were like one layer outside of the founding crew and, a fantastic person, you know, that, that I saw like.\r\n\r\n\r\nNik (35:27)\r\nYeah, that's okay.\r\n\r\n\r\nEnjoy it.\r\n\r\n\r\nteeth.\r\n\r\n\r\nZac Prince (35:50)\r\nI saw them in person a few weeks after everything kind of came to light. And it was, it was almost like talking to a ghost. Like this was someone who changed his whole life because he bought into the FTX story, invested his life savings on the platform, worked, you know, 24 seven. and you know, had just found out that like,\r\n\r\n\r\nThere was all this fraud stuff that had gone on. mean, it's, it's, it's a devastating story. basically when FTX went bankrupt, that was about four months, four or five months after we hitting to deal with them for FTX to acquire BlockPy. And so FTX. Yeah.\r\n\r\n\r\nNik (36:32)\r\nSo that's what I, that's what gonna ask you. What was the timeframe between, I'm a billionaire and FTX, you know, essentially going belly up.\r\n\r\n\r\nZac Prince (36:43)\r\nbetween one and two years. Like I'm a billionaire was like probably sometime in 2021 and the the block five bankruptcy was filed in November of 2022. It's fast.\r\n\r\n\r\nNik (36:54)\r\nto what I can't even imagine what those two years were like being not only in the in the industry, but like the eye of the hurricane. What did you do afterwards? Like I know BlockFi still going through some bankruptcy proceedings. I know, you know, there are still some unresolved issues. But after everything went down, did you just have like a nice holiday? Not a nice holiday. But like we did you decide I'm not going to work? I've got\r\n\r\n\r\n$20 million in crypto because I invested in Bitcoin in 2012 and I'm gonna take it easy. Like, did you lose everything? Like what was the next year like after the FTX crap hit the fan and it was obvious, you you were gonna be working through this for a couple of years with BlockFi.\r\n\r\n\r\nZac Prince (37:37)\r\nYeah, well, two quick things I would mention. There's been some good news out of the BlockFi bankruptcy recently, which is that customers are getting back 100 % of the value that they had on the BlockFi platform. the US customers will get that before the end of this year. I stayed on as CEO of BlockFi through the conclusion of the bankruptcy plan process, which took about a year or so.\r\n\r\n\r\nNik (37:52)\r\nThat's awesome.\r\n\r\n\r\nZac Prince (38:08)\r\nyou know, I had an experience in bankruptcy world, which is a wild world that I wouldn't wish on, you know, anyone. It's just take whatever you think is bad about lawyers and multiply it by 100. And then you're dealing with like bankruptcy lawyers. But anyways, you know, so that my time at BlockFi, my like full time at BlockFi ended in November of 23. So November of last year. And\r\n\r\n\r\nNik (38:35)\r\nOK.\r\n\r\n\r\nZac Prince (38:38)\r\nI thought I was going to stop working at least for a little while, maybe retire forever, you know, and\r\n\r\n\r\nNik (38:47)\r\nHad you built up a nice nest egg because of crypto? Did you have Bitcoin or Ethereum or did you have a nest egg from other things?\r\n\r\n\r\nZac Prince (38:55)\r\nno, it's, mean, there's public information out there. mean, there were like, you know, at the peak of block five, we did like when we did our series D we did a, a tender offer and like anyone that owned equity earlier, investors, employees was able to, you know, get some liquidity. So there were liquidity events at block.\r\n\r\n\r\nNik (38:57)\r\nIf you can't share, that's fine too.\r\n\r\n\r\nI'll see. So you took like a secondary. Okay, got it. Okay.\r\n\r\n\r\nZac Prince (39:19)\r\nThere were liquidity events at BlockFi. There were also, you know, just like savings and, you know, good investments that I had made earlier on in my career. And we decided as a family to move from New York City to Michigan. So I was also looking at, you know, a dramatic reduction in cost of living. So I was like, I'm going to retire. And that did not work at all. Didn't work for anyone. Didn't work for me.\r\n\r\n\r\ndidn't work my wife. and I kinda, you know, I kinda realized that I really, I really enjoy working. I don't know that I need to have like as high of an octane high volatility work experience as BlockFi ever again, but I really enjoy working, you know, the competitiveness of business, the interpersonal relationships, the intellectual stimulation. I think making money is fun. Like I enjoyed, you know, I enjoyed,\r\n\r\n\r\nmaking money. yeah, so I spent about two months trying to be retired playing racket sports and reading books on the couch, you know, getting dirty looks from my wife and like our nanny and whatever for you know, being lazy. I'm using air quotes like lazy. And, and then I learned about cost segregation studies through Twitter and I pinged Nick Huber when he tweeted about looking for a CEO for one of his companies hoping that it would be\r\n\r\n\r\nNik (40:23)\r\nYeah. Yeah.\r\n\r\n\r\nZac Prince (40:47)\r\nyou know, the, cost segregation study company, and, started spending some time with him and the rest of the team at RE cost seg and got really excited about it and, joined here as CEO in February of this year. So I was actually not working for about, you know, two and a half months, three months.\r\n\r\n\r\nNik (40:50)\r\nCheers.\r\n\r\n\r\nSo that like you talked about when Google bought the first business that you were part of how important equity was. And that's been a lesson that stuck with you coming out of the BlockFi experience. What was I guess what are the one or two things that were really driving you to look in something totally different?\r\n\r\n\r\nZac Prince (41:33)\r\nYeah, I would say.\r\n\r\n\r\nstability of business model and quality of life, work -life balance. I think illegal crypto bank would be on the short list of most volatile business models you could potentially ever be involved with probably.\r\n\r\n\r\nNik (41:49)\r\nWait, crypto is not stable?\r\n\r\n\r\nThat's what's so funny about you is like, you're obviously smart, you are thoughtful, and yet you found it and we're running an illegal bank. You know, like when you stop and think about it, you're like, that's kind of what I know. And I know I'm like generalizing and that that's not exactly what it was. like, man, how did I how did we get here? It's interesting how crazy crypto has been over last five years.\r\n\r\n\r\nZac Prince (42:16)\r\nYeah.\r\n\r\n\r\nYeah. I look, I wouldn't, I wouldn't change anything about the experience. I think at the time when I started it, it was, was a good idea. I really enjoyed the ride. the, the, the, think block fires, a tragedy. Like we did so much good stuff. worked with such great people. We delivered so much value, for so many clients and it had a really tragic ending, that, that could have been different.\r\n\r\n\r\nNik (42:36)\r\nThank\r\n\r\n\r\nZac Prince (42:57)\r\nyou know, if any, if any one of a number of things would have gone slightly differently, Chris would still be Chris and I would still be using the block five Bitcoin rewards credit card today. Everything would still everything would still be here and that would be cool. But you know, you can't change the past. You just got to you just got to move on. But like, I would say lower volatility and then also, you know, work life balance like it was the because of the 24 seven nature of crypto and because of block five's business model.\r\n\r\n\r\nand venture capital capital base that we had that prioritized growth over everything else. It was the type of job where six days a week was kind of baseline and complete lack of ability to be offline for any period of time was baseline. There was crazy stuff.\r\n\r\n\r\nhaving to pull having to pull you know all -nighters when markets were volatile having to leave the you know having to leave the Thanksgiving you know family and go sit in a room and you know be on risk management calls with our team because you know Bitcoin was down 25 % in the last 24 hours and yeah so it was highly volatile so you know I think\r\n\r\n\r\nNik (43:59)\r\nHmm, yeah, can't even.\r\n\r\n\r\ndinner early because you're\r\n\r\n\r\nZac Prince (44:23)\r\nYeah, like I said, I don't know if I'll put myself in that volatile of a situation ever again.\r\n\r\n\r\nNik (44:27)\r\nSo here's what I find interesting though is like I said, you're exceptionally bright. Even though you went to a state school, you're exceptionally bright. Your experience is incredible. Anybody who talks to you would understand, yeah, I he built this company and then because of this set of events, it crashes. I get it. It seems like you could have done anything. Like you could have raised a fund. You probably could have started another company from scratch.\r\n\r\n\r\nMaybe even could have gotten a cush job at some corporation. Why Ari Kostsek? And I'm not knocking Ari Kostsek. I think it's a cool business. I think it's growing, but that just seems so different in its scale, I guess, from where you were to kind of where you are now.\r\n\r\n\r\nZac Prince (45:11)\r\nYeah, a few things. So, you know, one, I like real estate and I believe in real estate investing. I've done some real estate investing over the years. think it's a great asset class and one that I'm interested in intellectually and I think is, you know, it's like sexier than stocks because there's something tangible there. You can look at a building and so I'd like to...\r\n\r\n\r\nNik (45:12)\r\nThank\r\n\r\n\r\nWell, it's it's a very similar. It's a very similar investment thesis to Bitcoin, right? You're like, it's a controlled volume or like they're not making any more land is the old saying, right? Like, you have a scarce resource with real estate. So yeah, I get it.\r\n\r\n\r\nZac Prince (45:48)\r\nTotally.\r\n\r\n\r\nSo I liked that. I liked that Ari Kostek was kind of making a technology enabled like democratization play in a product category that was filled with, you know, traditional kind of sleepy competition.\r\n\r\n\r\nYou know, like I learned about cost segregation studies only because of Ari Kostek's existence and marketing on Twitter through Nick's account. Like I would have never heard about him. I heard about him. I looked into it. owned an Airbnb. I owned an Airbnb property in the Palm Hills. I went to my CPA and I was like, should I get a cost segregation study? And he's like, absolutely. And I'm like, well, why didn't you tell me this before? He's like, I thought you could only get them on commercial buildings.\r\n\r\n\r\nNik (46:22)\r\nYeah.\r\n\r\n\r\nYeah.\r\n\r\n\r\nZac Prince (46:42)\r\nOr, you know, he's like, I thought they were so expensive that it only made sense to consider it if you owned a commercial building and you just have a little, a little single family home. and so I liked that democratization play. And then, I also liked the idea of running a profitable business and, know, the kind of like the diversification of experiences aspect of taking something that was bootstrapped and profitable from day one and continuing to grow it.\r\n\r\n\r\nNik (46:44)\r\nThat's so funny,\r\n\r\n\r\nYeah, yeah,\r\n\r\n\r\nZac Prince (47:10)\r\nAt the bottom line, not just the top line, which was really the focus at, almost every company I worked at previously, you know, which were all venture backed. And it was like, you know, like the goal at our, at, BlockFi or at other VC backed companies would be three X minimum year over year top line. That was kind of what we were aiming for, generally speaking. and you know, it already called at our cost.\r\n\r\n\r\nNik (47:36)\r\nThat's insane.\r\n\r\n\r\nZac Prince (47:38)\r\nYeah, at BlockFi, we are invested for a minute there for a few years. Our executive annual bonus plan target thing would get set at 400 % year over year. 4X the business, what a year was the goal. So then you contrast that with something that's profitable and you're like, hey, if we grow 50 % a year at the bottom line, we're high -fiving. Like,\r\n\r\n\r\nNik (48:05)\r\nYeah, yeah, yeah. Right.\r\n\r\n\r\nZac Prince (48:08)\r\nSo, yeah, you know, and I met the team and I really liked the team. So, yeah, I decided to join and it's been a great experience so far.\r\n\r\n\r\nNik (48:21)\r\nTalk about the democratization piece of it, because I think that's interesting for, I know you already explained this, but I'm going to say my layman's term. You know, if you buy a piece of real estate, there is this thing in the tax code currently that allows you to do a cost segregation study where you can break out the assets of that real estate and depreciate them according to different time schedules or depreciation schedules. Historically, those cost segregation studies cost a lot of money.\r\n\r\n\r\nbecause you have to get somebody to go out there and actually conduct it and tell you what is or isn't depreciable. You know, there's different rules. You have to depreciate the land at a different rate than the building itself. In fact, I don't think you can appreciate the land, can you? Yeah, okay. So how is RE -CostSeg achieving the democratization, like you said, of cost segregation studies?\r\n\r\n\r\nZac Prince (49:03)\r\nYou cannot depreciate.\r\n\r\n\r\nBasically, we've built some, I think of it as kind of like three things. So we've built some technology that enables our team to do this work faster and more efficiently. We've outsourced parts of the org to other countries that don't need, you know, for roles where we don't need to have someone in the U .S.\r\n\r\n\r\nThose two things together we're using to do virtual site visits instead of flying one on a regional plane to go show up. and lastly, we're, doing a lot of digital marketing that the traditional accounting firms and cost segregation specialist firms just aren't familiar with. Like our competitors are not on Twitter. Our competitors are not doing podcasts like this. and so, you know,\r\n\r\n\r\nNik (49:44)\r\nHmm.\r\n\r\n\r\nZac Prince (50:04)\r\nThose I think those three things together have been what's you know enabled re cost to you know grow Pretty quickly and in a little under three years of existence to being a 45 person company today and Yeah, last year we did 2 ,000 cost segregation studies for our clients this year. We'll do between 3 ,500 and 4 ,000 and\r\n\r\n\r\nNik (50:19)\r\nWow.\r\n\r\n\r\nOkay, that's only 2x, so, yeah.\r\n\r\n\r\nZac Prince (50:32)\r\nYeah. And it's a great value prop, man. If you interview 100 people on the street and you say, would you like to save money on your taxes? I mean, how many say yes? Like 99, 98 maybe? Maybe 100 out of 100? The value prop is great. And yeah, I think of us as just doing it kind of better, faster, cheaper. And so the price point, we can do a study for a single family home for $895.\r\n\r\n\r\nNik (50:48)\r\nTotally.\r\n\r\n\r\nZac Prince (51:02)\r\nLike three years ago before RE CostSeg existed, that price point did not exist in this industry.\r\n\r\n\r\nNik (51:09)\r\nWhat was it? Like, give me an idea.\r\n\r\n\r\nZac Prince (51:11)\r\nsix grand, seven grand. You know, I got quotes for my single family home and RE cost seg was $2 ,200. And I got two other traditional providers to give me a quote. One was 5 ,000 and the other was like 8 ,300 or something. Yeah. For my like, you know, little like four bedroom, three bath Airbnb and the cat skills.\r\n\r\n\r\nNik (51:12)\r\nCheers!\r\n\r\n\r\nWait, was this for your Airbnb or was this for your personal residence?\r\n\r\n\r\nYeah, dude, the only problem I have with the cost segregation, and this is not cost segregation specific, it's real estate is I currently have a lot of passive losses. And I can't, I can't use them. They're just like sitting there. Do know what I mean? So need to figure out a way to be generating some passive gains. So I can actually, yeah, so could actually use them. Because it's a, it's a night like last year, we we paid, I won't say it on air, but we you know, we paid mid six figures in\r\n\r\n\r\nZac Prince (51:46)\r\nYou can't use it.\r\n\r\n\r\nThat's it.\r\n\r\n\r\nNik (52:04)\r\nin taxes that I was planning on not paying, thinking like an idiot, like, we just took this loss on passive income, we'll be fine. It's like, actually that doesn't offset. So anyways, that's my only problem with it. how big is the business? You said 3 ,500, can you give me an idea of revenue or is that like under lock and key?\r\n\r\n\r\nZac Prince (52:27)\r\nI think we're, I don't think we share revenue publicly right now. wouldn't, I wouldn't want to do that, but.\r\n\r\n\r\nNik (52:36)\r\nYour metric, that's fine. So your metric is number of studies conducted. That's like what you get.\r\n\r\n\r\nZac Prince (52:41)\r\nYeah. And you can think of the average study value as being, you know, between 895 and 2000. So, know, look, that gives you a feel like we're in the kind of, we're in the kind of three to 5 million top line, healthy, you know, healthy margin business. So we're, you know, we're, dropping seven figures to the bottom line as well.\r\n\r\n\r\nNik (52:49)\r\nYeah, three to five million dollars.\r\n\r\n\r\nDo you have any idea of what your customer acquisition cost is?\r\n\r\n\r\nZac Prince (53:06)\r\ncustomer acquisition costs. mean, we weren't doing paid marketing until probably three or four months ago. It was very organic. Growth had been very organic through Twitter largely and the power of Nick's account and the account that Melanie Baldridge, one of the founders of the company built.\r\n\r\n\r\nNik (53:16)\r\nNo way!\r\n\r\n\r\nHmm.\r\n\r\n\r\nZac Prince (53:36)\r\nWe just started doing it. It's in the, it's in the, it's a couple hundred bucks. Like I think right now our Google row as is like 400%. And so at a ticket value of 1600 bucks, let's say it's $400 that we're able to get one, you know, converted customer.\r\n\r\n\r\nNik (53:47)\r\nOkay, that's good.\r\n\r\n\r\nYeah, that's great.\r\n\r\n\r\nAre you dusting off those paid ads, those marketing chops that you hadn't used for a little while or like, was that one of the reasons you got excited about it? Because you're like, hey, I think I can actually add the digital component to grow in this business.\r\n\r\n\r\nZac Prince (54:09)\r\nif, if by that, mean calling up someone who I thought would be a great fit to join our team and, encouraging the day and then say yes, then absolutely. No, we brought in someone who I've worked with before who's very, very good and very, very talented and he's been crushed. Yeah.\r\n\r\n\r\nNik (54:15)\r\nYeah, that's what I mean.\r\n\r\n\r\nI know you're not I know you're not -\r\n\r\n\r\nYeah, no, I didn't. I didn't think you were the buyer. I was just, you know, obviously you have experience in that space before you got in to block five. So that that's pretty cool that you have some some analogous experience.\r\n\r\n\r\nZac Prince (54:36)\r\nYeah, yeah. And we're making a big push in, in like partnerships and affiliate marketing, which was our number one driver of customer acquisition at BlockFi. We're building tools for, you know, the types of partners that we're looking to work with, which is, CPA firms, you know, real estate brokers of different types, whether it's loan brokers or actual transaction brokers, influencers who talk about investing or real estate. And then, you know,\r\n\r\n\r\npublishers that talk about investing in real estate. We built a depreciation calculator that they can plug into their site for free and it's a great lead generation tool for them. We built some infrastructure to actually power a really efficient partner program with tracking and reporting and payouts and all the baseline stuff you need to do high volume referral marketing type stuff.\r\n\r\n\r\nNik (55:11)\r\nAll that.\r\n\r\n\r\nWhat do you think of Nick's strategy? I think he's one of the things I think he's been genius at is finding product audience fit. So launching products that fit his audience. So Ari Kostseg is one of them. I think support shepherd is one of them. I'm trying to think of the rest of brokerage, right? Cause he, like a lot of his audience are entrepreneurs, business owners, real estate professionals, and they need those types of services. And he's done a good job. think of launching businesses enough to get them viable.\r\n\r\n\r\nand then hand them off, right? Because his audience alone isn't necessarily going to grow it. Is that intentional from your guys' perspective or was it just like happenstance?\r\n\r\n\r\nZac Prince (56:14)\r\nI think it's absolutely intentional these days. How intentional it was, you know, three years ago when it was starting to happen, I'm not sure. yeah, think, you know, Nick's success was a part of what attracted me to the Ari Kosig opportunity. It's fun to work with, you know, driven people who are really good at what they do, who...\r\n\r\n\r\nNik (56:17)\r\nOkay. Yeah.\r\n\r\n\r\nZac Prince (56:42)\r\nyou know, are successful and I've really enjoyed working with Nick. And I think, it's also inspiring to, you know, meet folks. And I've met many of them now who are, doing things because they got information or inspiration from some of the content that Nick has put out there. you know, I use some of the lines that he uses now when I'm just talking to people, like, I think there's, I think there's something to this notion that\r\n\r\n\r\nventure capital -backed technology startup is not the thing that the majority of people should be doing. Like someone who's been in the VC world for 95 % of my career, I think, and someone who experiences the pain of dealing with traditional service providers in all kinds of different categories and sees the opportunity to make those businesses even just a little bit better.\r\n\r\n\r\nNik (57:18)\r\nYes.\r\n\r\n\r\nZac Prince (57:40)\r\nI think encouraging young people to explore those types of fields and think about ways to build something that's profitable. I mean, it's funny because it's actually like the stuff you learn about business in elementary school or whenever you first hear about business. Like a business is made to produce profits. But when you get raised in VC Techland, like I kind of unintentionally did, that's not what you're taught. That's not what you're taught at all.\r\n\r\n\r\nNik (58:06)\r\nNo. No, no, I mean, and it's, I view it very similar to like the the the yen carry trade, right? In the sense that for 15 years, the cost of borrowing money was almost zero. And so of course, the venture community got to a spot where it's like, well, if I can put $1 in and I get $5 out and I can borrow at 0%.\r\n\r\n\r\nI'm gonna do that all day. you're just obsessed with growing customer base. And now it's been as we've raised rates that you're seeing that change and profitability is becoming the focus. But I think you're the nail on the head. Like it's just, it's crazy to me how you kind of are, many people have fallen out of the businesses exist to generate profits. It's pretty simple, pretty simple.\r\n\r\n\r\nZac Prince (58:51)\r\nGreat.\r\n\r\n\r\nI had to unlearn things, you know, like I'm, showed up to Ari Koss, you know, day one and I'm like doing stuff and I'm like, like the way I used to think about that is actually kind of ass backwards because like when you're actually running a profitable business, makes no sense to think of it that way. Like I've had a few of those little moments and, but it's great. I believe in that message. You know, I think it's a, I think it's a good message to be putting out into the world. that doesn't mean I wouldn't recommend folks to, you know,\r\n\r\n\r\ntake a big swing at a tech company if that's what they wanted to do. I'm not discounting the value that that's created. Exactly. Exactly.\r\n\r\n\r\nNik (59:32)\r\nNo, it's just that's not the only way to do business. Yeah, I totally agree. All right, man, I got some rapid fire questions for you to wrap this up. You ready? What do you love about this business?\r\n\r\n\r\nZac Prince (59:39)\r\nOkay. Yeah.\r\n\r\n\r\nthe value proposition.\r\n\r\n\r\nNik (59:46)\r\nWhat do you hate about it?\r\n\r\n\r\nZac Prince (59:50)\r\nsensitivity to interest rates and whims of the legislative tax code stuff.\r\n\r\n\r\nNik (59:55)\r\nThat's a pretty good one. All right. This is going to be interesting because I'm afraid you're going to give me a really mature answer, but I think all of us have some jealousy in one way, or form. I'm really jealous of commercial real estate companies because I just think triple net lease, mailbox money, easy. What industries or businesses are you the most jealous of right now?\r\n\r\n\r\nZac Prince (1:00:26)\r\nI would say, you know, I was a sales guy my whole career. I'm not the technologist. like, I feel if there's anyone I had to pick, I would say I feel jealousy towards like, technical founders of cybersecurity SaaS businesses. I just think like\r\n\r\n\r\nNik (1:00:48)\r\nOkay. Okay. You started that as if it was gonna be like a generalized statement, but you got so specific. Technical founders of cybersecurity. Okay, amazing. That's awesome. That's a freaking great answer.\r\n\r\n\r\nZac Prince (1:01:01)\r\nIt's just such a no brainer, dude. Like if I could be one of those guys, I feel like you're just, you would have to really do something stupid to not make a ton of money with that specific skillset.\r\n\r\n\r\nNik (1:01:14)\r\nOkay, all right. Note to self, find someone who has that specific skill set. All right, if you have two hours in your day, no family responsibilities, no work responsibilities, you don't have to focus on those, but you could. What are you obsessed with right now? Like what are you spending your time on when you're in control of your time?\r\n\r\n\r\nZac Prince (1:01:34)\r\nwell, I just moved. mean, like right now I just moved from New York city to Michigan. So I'm like working on establishing networks of people to play racket sports with particularly 10. and I'm also dabbling a little bit in the legal and regulated, online poker scene.\r\n\r\n\r\nNik (1:01:46)\r\nOkay. Love it.\r\n\r\n\r\nHe's back, baby. Back to his roots.\r\n\r\n\r\nZac Prince (1:01:59)\r\nI played like my wife is doing her crossword at night while we're trying to you know get ready for bed. I'm playing two three tables of Omaha.\r\n\r\n\r\nNik (1:02:11)\r\nI just have this I know that it's not like this but I just have this like mental picture of your wife she's like reading and then you're just sitting next to her with your headset on again I know you don't have a headset on but you're just like yeah I'll raise 500 ,000 and let and just your wife like\r\n\r\n\r\nZac Prince (1:02:25)\r\nI'm playing, you think very highly of me. literally playing, I deposited like hundred bucks and I'm playing $10, know, $10 a table type of stuff. I like the mental stimulation of it.\r\n\r\n\r\nNik (1:02:34)\r\nThat was awesome.\r\n\r\n\r\nLove it. All right, last question for you. What advice would you give yourself 10 years ago?\r\n\r\n\r\nZac Prince (1:02:45)\r\nBoom.\r\n\r\n\r\nThat's really, that's a tough one. Stay at Google. Was I at Google yet? Just like hang, spend a year at Google, you know, just like maybe don't leave after two months, you idiot.\r\n\r\n\r\nLike maybe just chill out, like take a chill pill and just hang out at Google for a minute is probably what I would have told myself if I could.\r\n\r\n\r\nNik (1:03:13)\r\nThat's amazing. Dude, this has been a freaking blast. I didn't know what to expect and this was amazing. Where can people come find you?\r\n\r\n\r\nZac Prince (1:03:21)\r\nRE Cost Seg's website is recostseg .com. My Twitter handle is Cost Seg Zach. and, yeah, don't hesitate to reach out. My DMs are open. we'd love, we'd love to give you a free proposal for a Cost Seg if you own any investment property and, yeah, keep doing the great work that you're doing, Nick. I really love your content as well. And, like I said earlier, I'm a fan, so thank you again for having me on.\r\n\r\n\r\nNik (1:03:48)\r\nYeah, of course, Well, I can't wait to talk to you in a year, see what you guys are doing. See you soon.\r\n\r\n\r\nZac Prince (1:03:52)\r\nYeah, sounds good. Thanks.",
  "metadata": {
    "duration": "",
    "date": "2024-10-23",
    "platform_source": "Google Drive"
  }
}