{
  "episode_number": "96",
  "episode_title": "Don't Miss Out On The $150 Billion Pet Industry Boom: Ideas You Can Start Today with Chris Koerner",
  "guest_name": "Chris Koerner",
  "business_name": "",
  "transcript": "﻿Chris Koerner (00:00.814)\r\nAll right\r\n\r\n\r\nDo mind if I lead us off?\r\n\r\n\r\nNikolas Hulewsky (00:05.839)\r\nAbsolutely, Chris. It's good to see you.\r\n\r\n\r\nChris Koerner (00:07.374)\r\nI'm gonna, good to see you. So I'm gonna do something a little different. So we talk about ideas, this and that, this and that, but I'm gonna make this first segment more of like a journal entry. Here's what I did this week. Here's what I've been thinking about this week. Here's what I've been scheming on this week, okay? Also, I just noticed I say things in threes a lot, right? I say, why do I do that? Why do I do that? Da, da, da, da, da, da, da. It's like, too redundant. I gotta fix that.\r\n\r\n\r\nNikolas Hulewsky (00:13.587)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (00:20.947)\r\npleased you.\r\n\r\n\r\nNikolas Hulewsky (00:31.891)\r\nYou're predictable. You gotta fix it, dude. You don't want to be predictable.\r\n\r\n\r\nChris Koerner (00:34.87)\r\nI know. All right, so three days ago, I'm sitting around right here at my desk and I'm thinking\r\n\r\n\r\nChris Koerner (00:46.156)\r\nWhy can't I buy beef jerky that imitates the exact taste of authentic Texas barbecue? And what I mean by that is authentic Texas barbecue is a few things. It's an offset smoker. None of that pellet grill crap. You got post oak logs with a specific moisture content of about 14%. Okay. You're cooking at about 250 degrees. It's got to be brisket, lightly trimmed.\r\n\r\n\r\nNikolas Hulewsky (01:07.155)\r\nto be moist.\r\n\r\n\r\nChris Koerner (01:13.934)\r\n50 to 50 salt and pepper ratio on the rub. That's it. You wrap it at 165 degrees. You pull it at 205 degrees. You let it sit for an hour. You slice it. Okay. That's Texas brisket. End of story. Why can't I buy that in a jerky version? Why can't I? It doesn't exist. All right. If you want to go eat jerky that has a smoky flavor to it, they're going to use liquid smoke, which is fake smoke. It's not real. It's an imitator. It's a copycat. Okay.\r\n\r\n\r\nNikolas Hulewsky (01:41.843)\r\nIt's like vape jerky? Ew.\r\n\r\n\r\nChris Koerner (01:43.982)\r\nvape smoke basically. Now they've got peppered beef jerky they've got but I'm not talking about a beef jerky that tastes very different. I'm talking about a beef jerky that's branded differently. An ultra premium you know brisket in your car beef jerky. Okay so was curious about this. Just so happens I love excuses to go smoke some meats right? twist my arm no no I gotta go smoke some meats and play with fire all day no.\r\n\r\n\r\nI guess.\r\n\r\n\r\nNikolas Hulewsky (02:14.269)\r\nBig pieces of meat, a grill, and the outside cold weather. I touched my arm.\r\n\r\n\r\nChris Koerner (02:19.054)\r\nSo that day, coincidentally, my wife was picking up the two deer that I shot last month and she was going to Costco.\r\n\r\n\r\nNikolas Hulewsky (02:30.803)\r\nOkay, too dear from the butcher?\r\n\r\n\r\nChris Koerner (02:31.682)\r\nYou think I'm? Yeah, yeah, from the processor. really? Do you shoot venison? Have you ever shot venison?\r\n\r\n\r\nNikolas Hulewsky (02:34.195)\r\nI call it venison. But yeah, I get it. That's now you shoot deer you idiot. I would never say I shot a venison. The meat is called venison. Get it together.\r\n\r\n\r\nChris Koerner (02:42.157)\r\nYeah.\r\n\r\n\r\nEven when you call me an idiot in a joking tone, it still hurts my feelings. I want you to know that this is critical feedback for you.\r\n\r\n\r\nNikolas Hulewsky (02:55.227)\r\nSo she goes to the butcher, picks up the meat, goes to Costco.\r\n\r\n\r\nChris Koerner (02:57.688)\r\npicks up the meat, goes to Costco. say, get me a brisket. Okay. So she comes home with a bunch of meat and this was like an hour after I had the idea. Okay. You throw the brisket in the freezer cause it has to be pretty stiff when you slice it. Hold your jokes. Hold your jokes.\r\n\r\n\r\nSo I slice it up and I 50-50. I put half of it in like your standard jerky marinade and the other half 50-50 salt and pepper just like a brisket would be. Put it out on the smoker, put some post-oak logs in there, light it, get back to work, check on it every hour. By the end of the day, I've got jerky. So the question is, how did it taste? How do you think? It was fine. It was kind of It was kind of mid.\r\n\r\n\r\nNikolas Hulewsky (03:39.207)\r\nDid it taste?\r\n\r\n\r\nChris Koerner (03:46.186)\r\nIt tastes like beef jerky that, you know, it's like, we talk a lot of crap about food companies that put all this crap in our food, but that kind of makes it taste really good. You know, like is, is a peanut or Reese's Pieces going to taste any different in 50 years? No, no, it might have different ingredients, but it's going to taste the exact same because you just can't screw that up. Right. So\r\n\r\n\r\nNikolas Hulewsky (03:56.583)\r\nVery good.\r\n\r\n\r\nNikolas Hulewsky (04:04.189)\r\nHopefully not.\r\n\r\n\r\nNikolas Hulewsky (04:10.983)\r\nWell, no, we know people put things into our food to make them taste better. Perfect example. Everyone will resonate with this. Chris, do you like Coke?\r\n\r\n\r\nChris Koerner (04:16.514)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (04:21.07)\r\nIt's literally the first thing I drank this morning. It was full sugar Coke.\r\n\r\n\r\nNikolas Hulewsky (04:24.699)\r\nOkay. I love Coke. I freaking love Coke. Is there a difference between McDonald's Coke and Coke you buy at the store?\r\n\r\n\r\nChris Koerner (04:33.39)\r\nIs there a difference between men and women? Like, are you kidding me right now? What are we talking about?\r\n\r\n\r\nNikolas Hulewsky (04:37.661)\r\nDude, absolutely. You know McDonald's does something to their Coke. It tastes so much better than regular Coke. So yes, I believe you that your smoked jerky was mint because you probably didn't add all the preservatives and other flavors that people do.\r\n\r\n\r\nChris Koerner (04:41.74)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (04:53.452)\r\nYeah. Side note, tangent. Did you know why McDonald's Coke is so much better?\r\n\r\n\r\nNikolas Hulewsky (04:58.547)\r\nI'm guessing because they add more syrup.\r\n\r\n\r\nChris Koerner (05:01.646)\r\nNo, I don't think so, but they have this big expensive filtration system where they filter the water before they add it to the syrup and They make their straws because there's something about the science of Drinking through a wider straw like activates more taste buds Those are like the two main things but there's actually like six to ten different things that they do to make it taste better It's very intentional on their part\r\n\r\n\r\nNikolas Hulewsky (05:10.449)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (05:26.991)\r\nAgain, you know, there's two Mormons talking about alcohol, but I know that when you're drinking wine, you're supposed to aerate it or something. I don't know, but like it changes the taste in it. Edit this out, Mohamed. But I believe it. I believe that filtering the water and whatever, creating more surface area of what you're drinking makes it taste better. All right, keep going.\r\n\r\n\r\nChris Koerner (05:34.264)\r\nI'm not going there.\r\n\r\n\r\nD-\r\n\r\n\r\nChris Koerner (05:46.966)\r\nAnyway, there's got to be a business there, right? Like, yeah, taste mid first round one try. I'm not going to chase it. I wanted a reason to chase it. But more broadly speaking, the business model of just taking a commodity, let's call it a food product that everyone's already buying, pricing it higher and just framing it in a different way. Right? Like it's you, you can make jerky out of chicken, right? So could be like a buffalo wing jerky that tastes just like a buffalo wing, but in a bag in a car.\r\n\r\n\r\nunrefrigerated.\r\n\r\n\r\nNikolas Hulewsky (06:16.615)\r\nYeah, or you could or you could do like liquid death. You're selling water in a can, but you called it liquid death and through some cool marketing on it. You could you could have jerky and just call it jerky boys. You know what I mean? Or like some creative, some creative name that makes it sell. I agree with you. You're talking about the idea of just taking something boring that everybody knows and slapping some marketing on it.\r\n\r\n\r\nChris Koerner (06:19.342)\r\nAhem.\r\n\r\n\r\nChris Koerner (06:34.542)\r\nOkay, we're not.\r\n\r\n\r\nChris Koerner (06:41.122)\r\nYes, and I am saying this is a public call to action. Someone do this. Like someone make authentic Texas brisket in a bag in a jerky form. I promise it will sell. Like you can make it taste better than mine, but it would sell. There's a free idea for you.\r\n\r\n\r\nNikolas Hulewsky (06:54.003)\r\nI'm glad. Good idea. Good idea. All right.\r\n\r\n\r\nChris Koerner (06:57.934)\r\nOne more one more food idea real quick. One more just real quick. Just because just we're just going to lump in the food ideas together. Okay. A lot of food ideas. So I got a pizza oven. I've had a pizza oven for years. I got a different one. Propane powered called Gosney. I cooked in it last night. It's really fun. It's delicious. I'm a pizza snob. You got to cook it at 900 degrees. You got to use authentic mozzarella. You got to use San Marzano tomatoes. You can't put too much crap on it.\r\n\r\n\r\nNikolas Hulewsky (07:01.299)\r\nOkay. Okay.\r\n\r\n\r\npost Thanksgiving, you got a lot of food ideas. I get it.\r\n\r\n\r\nChris Koerner (07:26.574)\r\nThis pizza cooks in 60 seconds. Okay. Anyway, I thought it would be so cool. We have a farmer's market here where we live and I thought it'd be so cool to bring the pizza oven because it's like it's industrial grade. You could cook on that thing all day if you want it and you can crank them out every 60 seconds. If you have someone preparing the pizzas, this is a $15 product, right? The cost, the cost at what I paid for these Amazon and Costco ingredients is like\r\n\r\n\r\na dollar 80 per pizza. It's like a 90 % 80 to 90 % gross margin business. Roll up at a farmer's market, set it up. You got one person making pizzas and accepting payments. You got another person cooking the pizzas. You got one option, margarita, one size, one option. Keep it simple. No drinks, nothing. cause we're having a farmer's market this weekend for Christmas and there's not like any food vendors. And I was this close to signing up.\r\n\r\n\r\nto be a food vendor, just to literally take my pizza up and down the road and start slinging pizzas. But then I learned you got to have a food handlers permit. So what do we think? What do we think? Because I'm gonna do that.\r\n\r\n\r\nNikolas Hulewsky (08:30.957)\r\nToo hard.\r\n\r\n\r\nNikolas Hulewsky (08:34.557)\r\nDude, I just want to say first, really love, have you ever had, have you ever had it? So it's like, first you take a hot dog and you wrap it in a pizza and then you stuff it with some Jack cheese and you got 30 rock reference there. So I hate food businesses. I just hate them because it, cause that might make sense individually, but like the ability to scale them freaking sucks. However, if you're going to do it, you do the in and out model, which is like,\r\n\r\n\r\nChris Koerner (08:46.67)\r\nYeah, you got cheesy blasters.\r\n\r\n\r\nNikolas Hulewsky (09:04.071)\r\nThese are the options. Nah, we're not like this isn't build your own. This isn't blaze where you're coming in and building your own pizza is like one type of pizza. Take it or leave it like then that helps you scale. I think I think pretty quickly so. I like it. I think it's a good way for someone to like test entrepreneurship like take their pizza oven, sell it a local farmers market, but I do. I just think you hit a scalability ceiling so I had somebody. I had somebody on my podcast and he makes hot sauce.\r\n\r\n\r\nChris Koerner (09:10.723)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (09:31.985)\r\nAnd he was on you've seen the YouTube series hot wings. Right with their hot ones area, hot ones where they're like doing interviews and they're eating and it gets progressively hotter. So like his his hot sauce was on hot sauce. Hot one. This is on hot ones. I'm gonna go find his name really quick because I am totally blanking. And I want to be able to. What's his name?\r\n\r\n\r\nChris Koerner (09:35.17)\r\nYep, hot ones, hot ones.\r\n\r\n\r\nChris Koerner (09:43.234)\r\nHmm. Hot ones.\r\n\r\n\r\nNikolas Hulewsky (10:01.043)\r\nMohammed, edit this out. Okay. Lucky dog hot sauce is the name of it. And this is how he sells. So everything sourced locally, like literally within a 60 mile radius, everything except for the glass bottle, which he's like, I have to import that from China because I can't not. And he goes to local farmers markets and that's where he sells them. But he has a scalability problem because it's just him. He's like at $300,000 a year. It's a really good product. It's won a bunch of awards.\r\n\r\n\r\nbut he's like, I don't know how to scale it. Yeah, exactly. So I think you could do that. think you could like do the farmer's markets to test the idea, but then you have to have the thought of like, all right, am I cool with just a two to $300,000 a year revenue business that I make personally, maybe a hundred grand and I just essentially created a job for myself or is there something I can do to scale this?\r\n\r\n\r\nChris Koerner (10:32.834)\r\nNow what?\r\n\r\n\r\nChris Koerner (10:51.534)\r\nLet me zoom out two frameworks for you. Totally agree. 100 % 100 % very hard scale. Number one, I'm speaking to the guy that's just a capitalist of heart, right? The guy that just wants to turn $1 into two like that. I don't care how wealthy I ever get. I'm always going to want to go do that. The hustle. I'm just speaking to the hustler out there. Okay. It's just fun. Number two, we're overlooking farmers markets. Why aren't we talking about farmers markets?\r\n\r\n\r\nHow many different selling venues can you get immediate direct feedback face to face from the person consuming your product? It doesn't happen. You could take that feedback and scale the feedback, scale your product globally or nationwide based on the feedback that you get face to face. You don't have to only scale through a farmer's markets, right? So let's say you're, some people are short on ideas. Maybe that's why they're listening. You spend a Saturday, go to four different farmers markets and you just take note. Where's everyone lining up?\r\n\r\n\r\nNikolas Hulewsky (11:34.909)\r\nI'll see you the feedback.\r\n\r\n\r\nChris Koerner (11:49.038)\r\nwow. Interesting. Huh? Okay. Wow. Everyone's lining up at the pizza place. But it's up this other farmers market doesn't have a pizza place. But it's a half hour away. Surely these people want pizza. Just as much as these people. You're not going to find a pizza place at every farmers market. You could find out where the supply and demand imbalances are just by farmers market hopping and then go learn how to make pizza and selling it at a farmers market. Right?\r\n\r\n\r\nNikolas Hulewsky (12:11.635)\r\nThat's an interesting framework in and of itself. Go to the farmer's markets, see which products have long lines, like which ones are really popular. The ones that are made to order, maybe you don't focus on, maybe you just focus on the ones that are packaged goods and you're like, hey, do you sell online? I can help you set up a Shopify store or I can help you with your e-commerce or if you have a marketing agency, you can help them with their marketing or paid ads or like that might be a really cool place to go and get customers or to find businesses.\r\n\r\n\r\nChris Koerner (12:39.618)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (12:41.383)\r\nto support and grow on scale. I like that idea. That's a really cool.\r\n\r\n\r\nChris Koerner (12:43.586)\r\nYeah, there should be like an Etsy for farmers markets where you can go like an online website where farmers markets could list their wares. It's a marketplace and anyone worldwide could buy something from someone that primarily sells through a farmers market. They can have their own Shopify store. That's fine. It's not like they're only selling through farmers markets, but just an online farmers market.\r\n\r\n\r\nNikolas Hulewsky (13:05.917)\r\nWould it be like the online version or the Etsy version of Goldbelly?\r\n\r\n\r\nChris Koerner (13:12.152)\r\ngood way of putting it. yeah, I guess it doesn't have to be food, right? Cause like at our farmers market, food is maybe half of the stuff. One guy sells handmade cutting boards or all kinds of handmade jewelry and trinkets and whatnot. So it's, you know, as everything is mass produced, the pendulum swing towards, you know, local one-on-one bespoke custom, et cetera.\r\n\r\n\r\nNikolas Hulewsky (13:14.611)\r\nCause well, Gold Belly's more like, I go to a restaurant and this is this. Yeah.\r\n\r\n\r\nNikolas Hulewsky (13:37.927)\r\nYeah, it would be hard to do, but if you create like you say in that platform and then you can start in real time identifying like, these are the products that are taking off in the local markets and then go to them and say, hey, we have this e-commerce store. Let's have an affiliate relationship. That would be really interesting.\r\n\r\n\r\nChris Koerner (13:53.582)\r\nYeah, I mean, you could start by putting tag, taking the McKinney farmers market and putting it online, right? And just going all in on the McKinney farmers market, leaving the brand broad enough to expand and then maybe add a second at some time or a third.\r\n\r\n\r\nNikolas Hulewsky (14:00.051)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (14:07.409)\r\nYeah, because who? I don't know the answer to this. Who owns the farmers market? Is it the city who puts it on?\r\n\r\n\r\nChris Koerner (14:12.462)\r\nSometimes in our case it is, but sometimes it's private landowner and they charge one to $300 for a 10 by 10 spot.\r\n\r\n\r\nNikolas Hulewsky (14:14.323)\r\nThank\r\n\r\n\r\nNikolas Hulewsky (14:22.803)\r\nCause that could be something as you go to private landowners and you're like, let them rent your land. I'll do the, the admin and then you collect all of the vendors information and you tell them, I'm going to list this. This is now the, this is now the McKinney's farmers market. And this will allow you to sell product online as well as market when the next farmers market is going to be. So you're like building in a distribution e-commerce store as well as a marketing tool for the farmers market itself.\r\n\r\n\r\nChris Koerner (14:29.592)\r\nMm-hmm.\r\n\r\n\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (14:47.032)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (14:52.433)\r\nThat would be interesting. Yeah, you're essentially you're setting up local marketplaces is what you're doing.\r\n\r\n\r\nChris Koerner (14:54.477)\r\nYeah, because you don't.\r\n\r\n\r\nYeah, yeah, that's a whole other idea that like in Folshire, Texas, when we live there, there was a farmers market just off the side of the road, maybe on three acres, you don't need power, you don't need gravel, you don't need a parking lot, you need a grassy field. And provided it's not wet or muddy, you could set up and if the vendors need power, they bring a generator, right? So you really don't need anything. You need a grassy field and some hopefully drive by traffic. And a lot of times these landowners are just sitting on the land waiting for it to appreciate.\r\n\r\n\r\nThey're not trying to build a Taco Bell there. They're just holding it. So might as well generate some revenue.\r\n\r\n\r\nNikolas Hulewsky (15:32.211)\r\nI like that. That's a really cool idea. All right. geez. 15 minutes in.\r\n\r\n\r\nChris Koerner (15:34.312)\r\nOne more thing, just about farmers markets. No, it's the same thing. Same thing is if you are interested in farmers markets, look at your state and their laws about selling food because in Texas, they have what's called a Texas cottage law, which means if you sell baked goods or things that don't need to be refrigerated, you don't need any food license. You don't need any licensing whatsoever. You can make baked goods in your kitchen and you can sell it to the public.\r\n\r\n\r\nBut in Texas, the differentiator is the refrigeration. If your product has to be refrigerated, they basically treat you like a restaurant. That's why I couldn't do pizza, right? So look up, look to see in your state if there's a Texas cottage law variation and that can determine what you can and can't do.\r\n\r\n\r\nNikolas Hulewsky (16:09.148)\r\nInteresting.\r\n\r\n\r\nNikolas Hulewsky (16:14.739)\r\nWell, and the lucky dog, Hoss Hoss guy, I he's in California and they're very stringent with their regulations on what they sell even at farmers markets. So yeah, you're definitely different for each day. All right. I had a guy on my podcast last week in economics and he sells pet supplements. So I'm going to give you an overview of his business. Did you know pets have leaky gut?\r\n\r\n\r\nChris Koerner (16:24.131)\r\nHmm.\r\n\r\n\r\nChris Koerner (16:41.134)\r\nhome. Don't I'm not doing this. I'm not doing this. I'm opting out of this segment. No, I'm just kidding. I'm just kidding. It's just like, it's just like, of course they have leaky gut and they suffer from depression too, don't they? So we should pay to fix that.\r\n\r\n\r\nNikolas Hulewsky (16:45.965)\r\nWhy?\r\n\r\n\r\nNikolas Hulewsky (16:57.139)\r\nAll right, let me give you some stats. In 2004, Americans spent $34 billion on their pets. Last year in 2023, they spent $150 billion on their pets. That's a massive increase. And it's not just because people care more about their pets. Listen to this, in 2004, 66 million households owned a pet. Today, it's about 87 million. So,\r\n\r\n\r\na massive jump in number of people that own pets and a massive jump in the willingness of people to spend on their pets. So we know that there's a big industry and market for pets. right. So his in particular, he started out where he wanted to just sell supplements. And then in the process of doing his research, he found someone who had a protocol for fixing leaky gut and he combined the two. So can you hear that static?\r\n\r\n\r\nNo, you can't.\r\n\r\n\r\nChris Koerner (17:54.744)\r\nI don't, but, I, I, I mean, I've been meaning to tell you this. I can't hear that your chair squeaking. Like when I listened to our episodes on Spotify. So FYI.\r\n\r\n\r\nNikolas Hulewsky (18:04.787)\r\nOkay, maybe I'll put my headphones in. We can cut after this one and do the second episode and I'll put my headphones in and we'll see if that helps. Anyways, so they have leaky gut and leaky gut just essentially means that exactly what it sounds. You're not holding in the nutrients and you're making yourself sick. So he has this protocol. Essentially what they do is they do three things. They get the dog on new food, they detox the yeast.\r\n\r\n\r\nin their stomach using some oil that he has. And then they reintroduce and repopulate the gut with healthy bacteria. And it's a three month regimen. And after the three months, there's a maintenance thing that he has. He has about 300 to 400 active customers. Their current monthly revenue is $15,000 a month, but they've got like 50 % margins. So they're making decent money. But he's sold over 5,000 customers. So he has like a significant amount of churn.\r\n\r\n\r\nChris Koerner (19:01.592)\r\nIs this the guy that that heard our segment about dog electrolytes that we were emailing with? Okay, very cool.\r\n\r\n\r\nNikolas Hulewsky (19:04.999)\r\nYeah, yeah, yeah. So it was a really, really cool conversation. And his current channels for acquisition are Facebook ads, a TikTok account that he runs that has 2000 subscribers and a list of 70,000 French bulldog owners that he bought from somebody like those are that's his that's how he currently gets customers.\r\n\r\n\r\nChris Koerner (19:24.782)\r\nOkay, a list of 70,000 French Bulldogs.\r\n\r\n\r\nNikolas Hulewsky (19:29.043)\r\nNot their owners, just the bulldogs. There are a lot of Fido's. Did you know people named their dog Fido a lot? Anyway, so that's his business and it's recurring revenue, it's mail order, he sends this stuff to them and I'm like talking to him and I'm just thinking, dude, there's so many cool opportunities I think people could do. So number one, I really liked what he did with the French Bulldog owner list.\r\n\r\n\r\nChris Koerner (19:30.572)\r\nThis is Salesforce, just the both of us.\r\n\r\n\r\nNikolas Hulewsky (19:58.835)\r\nAnd so I kind of want to work my way back from a distribution model into ideas. So I think what I would do first is I would go and look at how many small pet related businesses there are in the US. And where I would go is like, you know, the site we've talked about the site built with. And I would go and just try and find companies that sort of fit maybe less than $5 million a year in revenue criteria.\r\n\r\n\r\nand just see what kind of offerings they have. Generally speaking, what do they do? Do they offer food? Do they offer insurance? Do they offer supplements? what accessories, what is it? And then I would look at, I wrote myself like five, six categories. I would pick from one of these product categories, pet food and treats, which there's a big push into natural foods right now, pet insurance, pet supplies, pet grooming, pet accessories, and then pet technology, know, trackers.\r\n\r\n\r\nin particular, and they do now have technology that tracks their vitals, which is nuts. then I would piggyback. I would contact these store owners essentially and say, can I have access to your email list? What? Okay.\r\n\r\n\r\n\r\n\r\nChris Koerner (00:00.174)\r\nI just get right back into it.\r\n\r\n\r\nNikolas Hulewsky (00:00.979)\r\nYou okay. Yeah. So anyways, I would, I would pick one of those categories. I really like supplements. think supplements is a really cool category. And then I would start reaching out cold to some of these businesses and say, Hey, I want to piggyback off of your list. You've got a lot of customers that you've sold to. And I think they could really benefit from XYZ product. What do you think? And then you can have either an affiliate relationship. You could have a equity relationship. You could, or you could buy the list from them.\r\n\r\n\r\nThe other place I've thought of going is to like Flippa or Quietlight, like some of these sites that sell e-commerce brands. so just off and we talked about buying email lists before, but offering to buy pet specific email lists and then launch a business around around the product using the distribution that you've essentially either piggybacked your way into or purchased. What do you think?\r\n\r\n\r\nChris Koerner (00:56.962)\r\nI love it. I love it. Why not Facebook groups? There's so many Facebook groups for pet owners. like, I like the idea of starting with a breed, like going that niche, like X, X toy or insurance or whatever for French Bulldogs, golden doodles, whatever it is.\r\n\r\n\r\nNikolas Hulewsky (01:02.913)\r\nThat would be a freaking great one.\r\n\r\n\r\nNikolas Hulewsky (01:10.017)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (01:17.249)\r\nThat's why he started with French Bulldogs is because supposedly they have the worst leaky gut. That's why he bought the list and those have been primarily his customers. By the way, I did ask him the difference between leaky gut and Taco Bell and he said they're synonymous. Yeah, it's really interesting. I have leaky gut, just so you know.\r\n\r\n\r\nChris Koerner (01:22.446)\r\nMm.\r\n\r\n\r\nChris Koerner (01:32.331)\r\ninteresting. Huh. Huh.\r\n\r\n\r\nI both words originate from the Latin origin of chalupa. I think so. I'm pretty sure.\r\n\r\n\r\nNikolas Hulewsky (01:47.265)\r\nI think the Facebook groups would be the perfect way to market it. In fact, like we talked about the other week, you could buy a Facebook group around a niche breed. You could do this with cats. You could do this with dogs. could do this with... I'm trying to think of what are some other really common... Cats and dogs are the two most common pets that people are going to have in their homes. That's probably where I would start. But you could even go even more niche if you wanted to. Like ferrets. North American swallow ferrets are the ones that I'm going to...\r\n\r\n\r\nstart targeting. the industry is just growing like crazy. The supplement industry, I didn't know this, it's like $3 billion a year just for pet supplements and it's projected to double in the next 10 years. So you could just be a supplement bro, slang and supplements using the distribution of existing businesses on Shopify that just haven't thought about growing their business other ways.\r\n\r\n\r\nChris Koerner (02:23.788)\r\nYeah.\r\n\r\n\r\nChris Koerner (02:45.932)\r\nLike why not? I would go to built with I would get only Shopify brands that are selling pet products and then I would let's say\r\n\r\n\r\nChris Koerner (02:57.752)\r\nLet's say we're selling supplements. We find all of the toy, the dog toy brands. So they're, they're not selling in there. They'll never be selling supplements and just say, Hey, just put my product on your website. That's it. And every time it sells, we'll have an automation that tells me I need to ship that order over there. that's it.\r\n\r\n\r\nNikolas Hulewsky (03:17.345)\r\nSuper easy. Yeah, why would you not do that? Can you unbuild? Okay, I don't know. mean, you know, built with much better than I do. Can you sort, like, does it tell you business type or does it just tell you the business name?\r\n\r\n\r\nChris Koerner (03:29.218)\r\nBoth.\r\n\r\n\r\nNikolas Hulewsky (03:30.979)\r\nokay. So it will actually tell you the category. like this because it could be a pet food sales company, but it's you know, Alabama. You're like, what's Alabama? that's a pet food company. You know what mean? People pick these cute names that aren't descriptive of what they actually do.\r\n\r\n\r\nChris Koerner (03:33.87)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (03:44.556)\r\nYeah. You can export lists by category. So you could export, like you could set the filter for Shopify pets that export like that.\r\n\r\n\r\nNikolas Hulewsky (03:56.455)\r\nThis was another idea that I'll bring up another time, but I also was like, how many dead Shopify stores are there that you could just contact and get their email lists? Now, you wouldn't know if they're dead or not necessarily from Builtwith. Maybe you could. Maybe Builtwith would say they haven't had a sale in six months or something like that, but those would be really interesting to target as well just for their lists.\r\n\r\n\r\nChris Koerner (04:02.85)\r\nMmm.\r\n\r\n\r\nChris Koerner (04:06.444)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (04:18.424)\r\nWell, it's interesting you bring this up because Shopify has a marketplace for selling your store. Did you know that?\r\n\r\n\r\nNikolas Hulewsky (04:27.551)\r\nI don't think I mean, I know I didn't.\r\n\r\n\r\nChris Koerner (04:30.318)\r\nIt's pretty genius. It's basically like an eBay for Shopify stores that's hosted on and owned by Shopify. And the reason for doing it is brilliant. Reduce churn. That's it. Cause if you go out of business, you're not paying them 79 bucks a month anymore, or in some cases, $2,000 a month. So they would rather you sell that and not even take a percentage of the sale. They just want your store to stay open so they can keep that revenue going. So\r\n\r\n\r\nNikolas Hulewsky (04:57.853)\r\ndo they take a percentage if you sell? Or is it just like, we're just helping facilitate the transaction?\r\n\r\n\r\nChris Koerner (05:03.692)\r\nWhen I checked, they didn't, they might now, but it's, it's, it's quite genius because it's all verified by Shopify. You don't really have to trust anyone. Shopify will say, this is their revenue. This is how long they've been in business. This is how big their email list. Whereas if you sell a Shopify store on any other marketplace, it's like, what am I getting? I got to trust this guy.\r\n\r\n\r\nNikolas Hulewsky (05:25.121)\r\nYeah, if you go to his website like Flippa, do not do diligence process, but they do verify. And I think that they request financials from you, but I don't know if it's like an integration with Shopify. It may be self-reported, but that's even better, right? Because it's like, Shopify is telling me, cool, that works.\r\n\r\n\r\nChris Koerner (05:39.714)\r\nYeah. I, yeah.\r\n\r\n\r\nthink someone like Flippa has an API integration with Shopify where they will pull your data directly and essentially do the same thing, but it's not as trusted.\r\n\r\n\r\nNikolas Hulewsky (05:53.889)\r\nYeah, that makes sense.\r\n\r\n\r\nChris Koerner (05:55.598)\r\nI'm going to see if they still have it on.\r\n\r\n\r\nNikolas Hulewsky (06:00.139)\r\nBy the way, dude, I forgot about Flippa. I started messing around with Flippa this week. How you are about subreddits and business ideas, like the Smoke Brisket thing, right? You're just always going to be trying to slang Smoke Brisket. Smoke Brisket is a euphemism for businesses. Anyways, I got on Flippa and I'm like, that business is for sale? Holy crap, they have how many newsletter subscribers? I just forgot how much time I can lose.\r\n\r\n\r\nChris Koerner (06:16.301)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (06:29.449)\r\nlooking at business listings. Holy crap.\r\n\r\n\r\nChris Koerner (06:31.106)\r\nI know like window shopping for businesses. and that's how we found mining syndicate. So for better, for better or worse, that's how we found it.\r\n\r\n\r\nNikolas Hulewsky (06:34.369)\r\nThat's terrible.\r\n\r\n\r\nI know, but I do not need to spend another $100,000 on a business this year. I do not.\r\n\r\n\r\nChris Koerner (06:45.598)\r\nso I just looked it up and it was called, the exchange marketplace and they decommissioned it two years ago. Shopify did.\r\n\r\n\r\nNikolas Hulewsky (06:54.369)\r\nCut this out, Mohammed.\r\n\r\n\r\nChris Koerner (06:56.202)\r\nNo, I mean, it's an opportunity for someone, right? Like there's an opportunity for someone to do what Shopify was doing. and what, what I was about to say, if this was still existing is this is a perfect use case for that distilled IO tool that we talked about where you could track changes on a website because I, I guarantee you the majority of the listings that make it to that old exchange marketplace were people that were going to close their store anyway. So if it doesn't sell,\r\n\r\n\r\nAnd if it's lists been listed forever, you can come in there and be like, Hey dude, I'll give you a hundred bucks. I know it's listed for 20 grand. I'll give you a hundred bucks. Cause we both know you're just gonna, you're just gonna shut this down. So.\r\n\r\n\r\nNikolas Hulewsky (07:34.741)\r\nYeah, you're freaking bargain shopping. Before we move on to your next idea, how proud of you? How proud of me were you when I brought up Bill with?\r\n\r\n\r\nChris Koerner (07:37.742)\r\nAhem.\r\n\r\n\r\nChris Koerner (07:46.188)\r\nI'm... I had to edit out me crying.\r\n\r\n\r\nNikolas Hulewsky (07:50.273)\r\nYeah\r\n\r\n\r\nChris Koerner (07:52.558)\r\nLet's just put it that way. You're like, Chris, I was watching you. You didn't edit anything.\r\n\r\n\r\nNikolas Hulewsky (07:54.433)\r\nDude, I was...\r\n\r\n\r\nwas thinking about this idea and I was writing about it. I'm like, I could just go to Built With and find just because of the conversations we've had. It was cool. It was just cool. It was a cool moment. Full circle.\r\n\r\n\r\nChris Koerner (08:07.982)\r\nIt's a flex. It's a flex.",
  "metadata": {
    "duration": "",
    "date": "2024-12-13",
    "platform_source": "Google Drive"
  }
}