{
  "episode_number": "193",
  "episode_title": "AI Psychology and the Quirks of Digital Minds with Elizabeth Knopf",
  "guest_name": "Elizabeth Knopf",
  "business_name": "",
  "transcript": "﻿Nikolas Hulewsky (00:00.811)\r\nLiz, another week, more AI coming at us. Let's start. We've got some techno optimists, at least this week. Tell us what's going on.\r\n\r\n\r\nElizabeth Knopf (00:12.046)\r\nWell, I'm glad that there's some optimism because I feel like there's been a lot of doom and gloom lately, but there is some lights. So we're gonna sort of highlight on two discussions this week. One from Andre Karpathy and another from a Stanford survey, both giving again, some optimism to not everybody is gonna be losing their job and things are just awful. So first Andre Karpathy, so who is he? He is one of the most\r\n\r\n\r\nwell-respected people in the AI field. He was one of the founding members of OpenAI. He was also, I believe, head of Tesla's AI. So he really knows what he's talking about. Also PhD, super smart, and has recently started his own company. And he has amazing tutorials on YouTube, which I highly recommend if you want to get into the nuts and bolts of AI. But it's also accessible for sort of the average person. So he is just fantastic.\r\n\r\n\r\nAnd he also coined the term vibe coding. So if you want to know where that comes from, that's the guy. Yeah, he's, he's where it started. He is the, yes, the origin. exactly. Exactly. Even though there's that picture of, I don't know, Rick, I don't know what his name is the Rick Rubin, Rick Rubin. he's sort of the face, but Andre is actually the, the one who created it.\r\n\r\n\r\nNikolas Hulewsky (01:13.433)\r\nhe did.\r\n\r\n\r\nNice! The grandfather of vibe coding, Andre Karpathy.\r\n\r\n\r\nNikolas Hulewsky (01:29.591)\r\nOh yeah, yeah, yeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (01:36.171)\r\nRick Rubin never expected to be the face of anything. That guy.\r\n\r\n\r\nElizabeth Knopf (01:39.072)\r\nNo, no. Anyhow, okay. So what did he have to say? So he was sort of talking about this shift in what the software landscape is going to look like. And so obviously we all have heard the phrase, or I shouldn't say everybody, but most likely heard the phrase that software is eating the world. Well, LLMs are now eating software as he sort of shared on his presentation. And so we've gone through now a shift from obviously the traditional code.\r\n\r\n\r\nneural networks and now being able to communicate via English to software to create that. Exactly. Yeah, not even English I should say because we have other probably people speak other languages. you natural language. So LLMs are going to become some of the the key points that he shared were LLMs are going to be the operating system so closer to electricity and sort of foundational which I think we're also all seeing that shift.\r\n\r\n\r\nNikolas Hulewsky (02:15.467)\r\nNatural Language.\r\n\r\n\r\nElizabeth Knopf (02:36.27)\r\nbut then also there's, the ability to have control over AI in terms of how involved it is in the creation is super important. And so one example of this is like cursor. So cursor is sort of this thing called an IDE, which you basically type on to create code, whether that's again, using natural language, but you can also write inline code if you have that skillset. And so they've sort of given you both tools of like,\r\n\r\n\r\ngo old school or be able to also do a vibe coding. And I think that's the direction where you can essentially toggle the engagement and involvement of AI versus it's, okay, AI is gonna generate it and you can't really edit or do much interaction, or it's purely old school. And so that's the direction, which again, I think is maybe somewhat obvious, but just again, reinforcing that. So that was another point.\r\n\r\n\r\nhe made and there's just gonna again be more human AI cooperation. So I feel like that is a bright spot overall. And then building for agents. So this is the other sort of I think big shift in paradigm within the overall internet and the world where obviously users have historically been the ones interfacing with the browser, but we're having a new world. We're now agents or bots are going to be all over the internet and doing things on our behalf. And so how do you actually build\r\n\r\n\r\ntaking that into account where they aren't gonna need to have like cool UIs where you click, they're gonna start shifting in how they actually communicate. And that might even look different than what historically has been called the API, which is again, sort of the way to access the information and code from another software tool. So I think that was interesting. And then everyone's basically gonna become a programmer. So where it's like, we all use Word today on a computer, if you have a computer.\r\n\r\n\r\npeople use word that's probably going to be similar to how it is for creating software. Everyone's going to be a vibe coder. so that creates a massive new market, massive new skillset. And I mean, if you think of people like, miss Excel, people are still learning how to use Excel from Tik TOK videos and stuff. that just creates a ton of educational opportunity across the board because there's so many different use cases on how to use AI across everything. And we're still early. So I think there's\r\n\r\n\r\nElizabeth Knopf (04:57.814)\r\nMassive opportunities for entrepreneurs to take advantage of that. Those were some of the key ones. this one last cool thing that I think was interesting. He sort of got a little bit spiritual, let's say, and said that AI actually has aspects of human spirits. And again, that's basically because it's mimicking us. But at the same time, they're sort of taking on, you know, different behaviors and biases.\r\n\r\n\r\nNikolas Hulewsky (05:19.263)\r\nboy.\r\n\r\n\r\nElizabeth Knopf (05:25.448)\r\nhallucinations and so they have their own quirks and so taking that into account both gives us an advantage like we have memory we actually have a better memory even though they can handle more context they don't have as much memory in the same way as we do so there's going to probably be a whole AI psychology that comes up out of this too what that means I have no idea I have no idea but that's just another thing food for thought so I'll yeah good\r\n\r\n\r\nNikolas Hulewsky (05:46.879)\r\nmy gosh.\r\n\r\n\r\nNikolas Hulewsky (05:52.951)\r\nDude, that one scares the crap out of me. I can imagine there being a college course, AI Psychology 101. I mean, it makes sense, right? Because in order to fully utilize these models, you have to understand what they prioritize, why they prioritize it. And so if you understand what they prioritize and why, you can ask the right questions and prompt it the right way. I mean, these things...\r\n\r\n\r\nElizabeth Knopf (05:58.476)\r\nYeah. Yeah.\r\n\r\n\r\nElizabeth Knopf (06:02.828)\r\nYeah.\r\n\r\n\r\nElizabeth Knopf (06:18.478)\r\nExactly.\r\n\r\n\r\nNikolas Hulewsky (06:19.551)\r\nVibe coding is a cute name, but what vibe coding essentially does is it unlocks anybody's ability to build something with natural language. So we can say English or we could say Spanish, whatever, but just natural language. Hey, I want you to build me this website. This is the functionality here. The specs that unlocks a whole new world where anybody can build almost anything. but in order to do that, you need to be able to prompt AI in a way where you're to get the outcome that you want. that yeah, Ooh, Ooh, AI psychology, freaky.\r\n\r\n\r\nElizabeth Knopf (06:46.754)\r\nYeah. Well, it's interesting too, because there's been, you know, a bunch of papers recently and fear mongering around like it not wanting to shut itself off and it obviously manipulating us and like other sort of horror stories around it. But on the flip side, it's like humans also are manipulating it. And so obviously you could say it's smarter, but I don't know. Again, it's going to be interesting in how we manipulate the AI or is it manipulating us and therefore, you know, everything else, but.\r\n\r\n\r\nNikolas Hulewsky (07:15.671)\r\nYeah. Yeah. I mean, it's like this with every technological turn, we don't know what it's going to look like. And so we build up all of these potential, you know, worst case and best case scenarios. Neither one of them really come to fruition. Typically we go middle of the road and somebody will say, well, this time it's different and it may be different this time, but typically we kind of figure it out and things shake out the right way. You know, what's crazy is I was looking at this report that came out this week and\r\n\r\n\r\nit gave some sentiment on AI from small businesses. Do you want to hear it? Okay. So 57 % of small businesses are using or planning to use AI this year.\r\n\r\n\r\nElizabeth Knopf (07:46.52)\r\nMm-hmm.\r\n\r\n\r\nwould love to hear it.\r\n\r\n\r\nElizabeth Knopf (08:00.101)\r\nThat is wild. That is wild.\r\n\r\n\r\nNikolas Hulewsky (08:02.935)\r\nWhy is it, okay, okay, okay, okay, okay, why is it, why do you think it's wild?\r\n\r\n\r\nElizabeth Knopf (08:05.686)\r\nOkay, because, okay, I've tried to sell to small businesses software before. It is like a nightmare because one, it's convincing people they need it. There's a price point element and then it's like the adoption aspect. So for people to actually be, you have demand pulling it. It's just such a shift from history. Yeah.\r\n\r\n\r\nNikolas Hulewsky (08:24.439)\r\nHmm. Okay. Wait, wait, wait. Is 57 % high or low?\r\n\r\n\r\nElizabeth Knopf (08:29.134)\r\nOh, sorry, the 57 % is high that people want to use it. Yes, super high. Super high. I mean, think about any other big shift in technology, cloud. Oh my gosh, that was super painful to get anyone to do on-prem and putting in a CD or downloading something to then actually using on the cloud. then you'll...\r\n\r\n\r\nNikolas Hulewsky (08:34.199)\r\nokay, all right.\r\n\r\n\r\nNikolas Hulewsky (08:52.331)\r\nYeah?\r\n\r\n\r\nElizabeth Knopf (08:53.016)\r\nmobile and mobile was like, I don't really need it. Why would I need it? And then, mean, how many businesses don't actually even have websites still. it's like, you know, for people to be this excited about it is, I'm excited. I'm probably more excited than they are, but\r\n\r\n\r\nNikolas Hulewsky (09:00.385)\r\nCrazy, I know, crazy.\r\n\r\n\r\nNikolas Hulewsky (09:09.045)\r\nYeah, it's I think there's two ways to look at it. One way is holy crap, 57%. That's insane. That's how many people are using it. And then there's the flip side of it's only 57%. Like the market penetration. I heard this crazy statistic. I was listening to the acquired podcast episode on Microsoft. There's a part one, part two. It's like eight full hours, which is actually it's crazy. In 2003 when I think you and I are the same age, I might be older than you, but I graduated high school in 2003 and okay.\r\n\r\n\r\nElizabeth Knopf (09:19.463)\r\nYeah, yeah.\r\n\r\n\r\nElizabeth Knopf (09:36.504)\r\nYeah, we're saving. Yeah.\r\n\r\n\r\nNikolas Hulewsky (09:38.359)\r\nAnd in 2003, I want to say the percentage of the American population that had a PC in their home was like 63 % or no, no, no, maybe it was like 73%, somewhere in that ballpark. But it was like, that was it. Like there was still 30 % of the population that just, didn't have a PC in their house. That's unthinkable. It's crazy. So there's still, there's still a ways to go.\r\n\r\n\r\nElizabeth Knopf (09:56.962)\r\nGreat. And then on the flip side of that, like also think how many people still have AOL email addresses. Like, yeah, my mom's still has it. Yeah.\r\n\r\n\r\nNikolas Hulewsky (10:08.279)\r\nYeah. Whenever I see the Comcast.net, AOL.com, SBC Global, that's another one. If I see an SBC Global, I'm like, okay, I want to talk to this guy. All right. Here are the top three use cases. What do you think is number one?\r\n\r\n\r\nElizabeth Knopf (10:17.58)\r\nYep, exactly.\r\n\r\n\r\nElizabeth Knopf (10:26.808)\r\nfor AI. Yeah.\r\n\r\n\r\nNikolas Hulewsky (10:27.777)\r\nFor those people, so those small business owners, they're using AI and these are the top three reasons or use cases that they use AI for. This one surprised me.\r\n\r\n\r\nElizabeth Knopf (10:34.282)\r\nOkay. that they've already implemented in their business is that.\r\n\r\n\r\nNikolas Hulewsky (10:40.843)\r\ntop uses of AI in their business.\r\n\r\n\r\nElizabeth Knopf (10:42.87)\r\nOkay. All right. Sorry. I'm overthinking this one. I would say, I mean, what I think they should be doing probably isn't what it is, but like AI customer service. Okay. Yeah. The, the, all right.\r\n\r\n\r\nNikolas Hulewsky (10:51.573)\r\nNo, content creation.\r\n\r\n\r\nWell, no, no, no, no, no. I think it's a dud of people who are on social media because they're like, well, yeah, they should be using it for social. Outside of the bubble, that surprises me. That surprises me. They're using it for content creation. Number two, data analysis and research, 41%. So they do it. And then number three, marketing sales and strategy, 39%. So all of these are not decision making. These are.\r\n\r\n\r\nElizabeth Knopf (10:59.618)\r\nFair enough.\r\n\r\n\r\nElizabeth Knopf (11:11.096)\r\nmakes sense.\r\n\r\n\r\nNikolas Hulewsky (11:23.615)\r\nconsultative. These are, hey, I'm getting advice, I'm getting help with certain things. I think that's really interesting. 81 % still say that AI stresses them out.\r\n\r\n\r\nElizabeth Knopf (11:34.048)\r\nInteresting. Did they give any more reason or detail than that? okay.\r\n\r\n\r\nNikolas Hulewsky (11:37.495)\r\nWell, here we go. 56 % worry their business could be replaced by AI or automation. That one's crazy. All right, and here are the two stats that like kind of blew my mind. What percentage last year in 2024 said that AI tools are essential to their business?\r\n\r\n\r\nI think I told you that number. Never mind. I'm sorry. 72 % 72 % said last year 2024. Hey AI is essential to my business this year. 87 % That's a that's a massive jump.\r\n\r\n\r\nElizabeth Knopf (12:03.498)\r\ngosh. Okay.\r\n\r\n\r\nElizabeth Knopf (12:17.782)\r\nYeah, that's not even usually you'll see like maybe an incremental 1 % 2 % but like that is that's huge. That's the\r\n\r\n\r\nNikolas Hulewsky (12:21.973)\r\nYeah. A 15 point jump in a year. It is that that blows my mind. But then this one is like it blows my mind and it makes sense. And that's why I love doing this podcast with you, because it helps me. 82 % say they want to consolidate those AI tools as quickly as possible, because it's true. It's like, OK, what do I go to chat GPT for Gemini and like, then there's this wrapper that I use on top of it that's using AI to help me with my bills like.\r\n\r\n\r\nElizabeth Knopf (12:26.914)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (12:52.033)\r\nThere's just this kind of, there's this proliferation of tools and it's really, really hard. That's why I think MCP and you showed me that last week can become so valuable is because that can be the portal through which you can utilize all of those tools. But it's just one place that a business owner can do. Anyways, I thought those were super interesting. Didn't you think?\r\n\r\n\r\nElizabeth Knopf (13:05.973)\r\nExactly.\r\n\r\n\r\nElizabeth Knopf (13:11.022)\r\nNo, that's I mean, I'm at all again all makes sense. One thing I thought too was like, going back to your point earlier of like, it's only this number like who who's also the 13 % that don't think it like that, you know, don't think it's essential. Maybe I want to buy their business. I don't know.\r\n\r\n\r\nNikolas Hulewsky (13:29.355)\r\nYeah, yeah, you're like, can I get the methodology for this survey? Because I want to talk to the 13 % by those businesses. Yeah, I totally agree.\r\n\r\n\r\nElizabeth Knopf (13:32.814)\r\nExactly. And then I think the consolidation that's I mean, I get it, like, I'm probably in a new I'm shiny odd object syndrome on steroids. And so like, I'm trying everything new. And I feel that overwhelmed. But like, even on average, like when you're just using chat GBT, and you have everything there, and then it's like, then there's Claude. And then there's like, these other things and automation and eight and it like it gets very, very scary. Because there's\r\n\r\n\r\nNikolas Hulewsky (13:57.527)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (14:01.036)\r\nYeah.\r\n\r\n\r\nElizabeth Knopf (14:01.762)\r\nFOMO, and if you're online at all, FOMO is real.\r\n\r\n\r\nNikolas Hulewsky (14:04.875)\r\nI've had this conversation with a few different people. think for those of us who are in it, like you or I, I don't hate putting us in the same, in the same category, but we look at the same stuff. Yeah. We say this, we look at this stuff often. We know that there's a massive difference for certain functions between different softwares, right? We're like, man, chat GPT is way better at whatever collaboration than Claude and Claude's a way better writer than chat GPT, whatever our opinions are. But most people, they don't have the time to figure that out. And for them.\r\n\r\n\r\nElizabeth Knopf (14:13.356)\r\nYou are a liar.\r\n\r\n\r\nNikolas Hulewsky (14:33.623)\r\nto go from here of no AI to even what we think would be a bad AI is still such a dramatic jump and an improvement in the quality of their life that it doesn't matter that let's say, let's say I think Claude's a better writer and they go to chat GPT. They don't care that chat GPT is a, excuse me, that Claude's the better writer. They don't care because they've already done it with chat GPT and it's like solved their problem 80%. Who cares if it's another 10 % improved?\r\n\r\n\r\nAnd I think for people who are vibe coding or who are building products right now in particular, getting to market is so important because the end consumer is not going to be able to differentiate between a product that gets them 80 % better or 90 % better. They don't care. The extra 10 % does not matter to them because it's already moved them 80%. And if you've missed the market, even if you have the best product, you're kind of SOL.\r\n\r\n\r\nElizabeth Knopf (15:25.994)\r\nExactly. And I heard of an interesting stat last week that might be slightly off, but in a weekend on lovable, 200,000 apps or whatever people were doing with lovable were created in a weekend. And so if any of those people are launching things or using internally, you have so much more competition and so much more noise in the market that like before, when you were choosing between, know, no one likes going through and like going through the sales process of buying software and similar with AI. like\r\n\r\n\r\nNikolas Hulewsky (15:45.781)\r\nand see.\r\n\r\n\r\nElizabeth Knopf (15:55.352)\r\nyou're gonna be evaluating like two tools now it's like you're evaluating 20 tools and like and no one wants to do that and yeah\r\n\r\n\r\nNikolas Hulewsky (16:02.633)\r\nOkay, I totally agree. All right, so in a world where the products are almost commoditized, let's just say, all right, the speed to market is so fast, what becomes the most important thing?\r\n\r\n\r\nElizabeth Knopf (16:06.67)\r\nyou\r\n\r\n\r\nElizabeth Knopf (16:19.56)\r\nEase of use. Ease of use. okay. Okay.\r\n\r\n\r\nNikolas Hulewsky (16:21.407)\r\nWell, yes, ease of use. I agree. Sorry, I did. I that thing with the professors like asks a question and they have a specific answer in mind. And then the you know what mean? Then we do what they hate anyways. I'm sorry I did that. In my opinion, the most important thing is now becoming a trusted distribution channel. Because you have these sea of options and me the end consumer. I don't know. It's like just OK Liz. I trust Liz Liz. What should I use? Claude cool. I'll use Claude.\r\n\r\n\r\nElizabeth Knopf (16:32.296)\r\nThat's okay. Yes.\r\n\r\n\r\nElizabeth Knopf (16:39.672)\r\nAbsolutely, yeah, that too.\r\n\r\n\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (16:50.743)\r\nThat's why I think distribution is going to become even more powerful and even more important, like the ability to go on markets and videos cool, but it's not going to be done by the most creative videos or whatever. It's going to be from people or brands that they've trusted for a long time that are coming out with these solutions that it's going to be. Anyways, I think it's going to be even more important. So.\r\n\r\n\r\nElizabeth Knopf (17:12.248)\r\nWell, that just validated that validated a couple of business ideas I have that I'll have to talk to you about afterwards. But I'm also realizing, okay, maybe I can monetize shiny objects syndrome. That's pretty exciting. Finally. Yeah.\r\n\r\n\r\nNikolas Hulewsky (17:21.847)\r\nHahaha\r\n\r\n\r\nWell, Chris, mean, know, Chris, my best friend mobile home park guy, he's monetizing shiny object syndrome, like, because he's built an audience now. And it's like, that distribution channel is insane for him. Okay, so I want to hone in on this one. 82 % of people are like, there's too many tools out there. I don't like what do I even use? How do I consolidate? I want to talk about one thing that you brought up last week, we didn't have time for that I think can solve a lot of people's problems.\r\n\r\n\r\nElizabeth Knopf (17:37.838)\r\nAbsolutely.\r\n\r\n\r\nNikolas Hulewsky (17:55.009)\r\nwho are in the game of communicating. And by that, mean presentations, slide decks, PowerPoints. There's some really, really cool use cases in technology now that will allow me to generate a PowerPoint without me spending almost any time to get it set up. And you're gonna walk me through how to do it. That's what I'm freaking excited for. Save me from the PowerPoint, Liz.\r\n\r\n\r\nElizabeth Knopf (18:16.27)\r\nAbsolutely. So I feel like the PowerPoint deck with AI is the Turing test for iBankers and business consultants. I feel like, okay, so that was basically like, can you actually be sort of, what is the good, hold on, let me give us, go for it, go for it.\r\n\r\n\r\nNikolas Hulewsky (18:24.151)\r\nWhat is the Turing test?\r\n\r\n\r\nNikolas Hulewsky (18:34.679)\r\nCan I do it? Okay, Alan Turing was a mathematician and his theory was, we will know that artificial intelligence is real when I can no longer tell the difference between a human and a computer answer. That's the Turing test, essentially, right? Someone's gonna be listening to, technically speaking, what he said was, but that's the way we've used it is, will the output that's generated now be indistinguishable from a human's? And so what you're saying is,\r\n\r\n\r\nPowerPoints have kind of passed the Turing test now for investment bankers, VC, investors, people who use PowerPoints on a daily basis.\r\n\r\n\r\nElizabeth Knopf (19:10.926)\r\nYep. Cause as we've been sort of talking about over the last couple of weeks, 50 % of white collar jobs. Now, huge point part portion of white collar jobs, if you're in banking and consulting is creating PowerPoints and doing something called creating pixel perfect PowerPoints. And I talk about this because I hate creating PowerPoint text. So this was like my first, can we do this? Cause I don't like drag and dropping, but I will say we're not quite, I don't think we're quite there yet, at least from\r\n\r\n\r\nNikolas Hulewsky (19:29.591)\r\nMe too.\r\n\r\n\r\nElizabeth Knopf (19:39.298)\r\nGoldman Sachs, those analysts still have a little bit of a job. It's close. I think within the next year we'll be there, but I would say we're not there. So I'm gonna share my screen and show you some of the stuff I've been working on. I was building out a deck for some investors over the last couple of weeks and I wanted to do it all AI and I'll share what happened.\r\n\r\n\r\nNikolas Hulewsky (19:57.943)\r\nOkay, so while you're pulling that up, I just wanna say really quickly, I also detest PowerPoints, but I think PowerPoints are great because they force you to figure out how to communicate and articulate complicated ideas. And that's really what they're for, right? It's like, they can almost be a test of like, how smart is this person? If you come to me with a 30 page PowerPoint presentation, it's like, okay, you weren't smart enough to get it down to 10. But it's very, very effective. So even if you don't use PowerPoints,\r\n\r\n\r\nWhich I don't, I'm going to use them a lot more now that I know AI can build them because they are so effective in communicating these ideas. Now, what are you using? Are you using Manus? Like Chris showed me Manus can do PowerPoints really quickly, but did you build your own PowerPoint like builder?\r\n\r\n\r\nElizabeth Knopf (20:44.344)\r\nSo real quick, you see, what do you see on the screen right now? Perfect, okay. Okay, so I went down this path of anytime a new AI tool comes out that claims they can do AI slides, I'm on it. So I have tried a lot of them. And what I have found is that, so I started with Claude.\r\n\r\n\r\nNikolas Hulewsky (20:46.997)\r\nvocational education roll up.\r\n\r\n\r\nNikolas Hulewsky (20:58.355)\r\nHahaha\r\n\r\n\r\nElizabeth Knopf (21:08.366)\r\nCloud actually does beautiful generation of visualizations for business, which we've gone through and I've done it before. But if you actually want to put it into a format that's usable, there's huge amount of friction. And so that's where I started, because I basically created all the context I needed for my research, which you can see here. Let me pull this up. So here was sort of the context I put in.\r\n\r\n\r\nNikolas Hulewsky (21:35.703)\r\nSo I'm sorry, what am I looking at right now? Am I looking at Claude? Okay.\r\n\r\n\r\nElizabeth Knopf (21:38.734)\r\nYes. So this is Claude. This is just a chat. I had a bunch of context in a project. So I'm looking at trade schools right now. And so I did a bunch of research on it, also using some AI. And then I put that into Claude, both in the project knowledge as well as into the chat. And then I created a prompt, just create a seven to 10 slides of the same aesthetic. I gave an example and basically how did it create something. And this wasn't the original prompt, but\r\n\r\n\r\nI...\r\n\r\n\r\nNikolas Hulewsky (22:08.855)\r\nOkay, hold on, hold on. You are so freaking smart and you just like blew through this so quickly. Cause I think you assume everybody's on your same level and you're just like, okay, so what I did was I coded this really quickly and then I threw it into MCP and I was like, okay, well you lost me like 20 steps ago. So you're in Claude and you have a project that you've created. Let's start there. And within that project you have context. Okay, so here we are, cool. And you've got a couple of context documents.\r\n\r\n\r\nElizabeth Knopf (22:25.326)\r\nyou\r\n\r\n\r\nYes. Okay, so I have.\r\n\r\n\r\nNikolas Hulewsky (22:38.645)\r\nAnd the context documents being what? Some industry research, some analysis, what it...\r\n\r\n\r\nElizabeth Knopf (22:43.82)\r\nYep. So we, me and my business partner had created, I think it was like a 20 page, just research report going through what a typical business plan, you know, market research, go to market, number of\r\n\r\n\r\nNikolas Hulewsky (22:53.801)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (22:58.231)\r\nAnd you did this because you're thinking like you're like, Hey, we're looking at investing in all these different industries, potentially doing a roll up in a bunch of different places. Trade schools was one of them. Why don't we create a project that would just keep all of my notes and thoughts. Is that the idea? Okay.\r\n\r\n\r\nElizabeth Knopf (23:05.474)\r\nYep. Yep.\r\n\r\n\r\nElizabeth Knopf (23:11.212)\r\nYep. Yes, that was that was the idea. And so I also have stuff in Google Drive that I can access that I think one of these might have been from. And so I can pull things in and out as I need it. And so that also opens up your context window. I've been talking to lot of people that are hitting max limits in the chat. And so this opens it up a little bit. And so that's super useful to just have that.\r\n\r\n\r\nNikolas Hulewsky (23:20.747)\r\nsweet.\r\n\r\n\r\nNikolas Hulewsky (23:29.323)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (23:34.839)\r\nCan you show, so there are two parts of the project. One are the context documents and one are the instructions. Do you have specific instructions for this project?\r\n\r\n\r\nElizabeth Knopf (23:45.871)\r\nI don't have instructions for this one. just cause it's been, yeah, too inconsistent in terms of what I've been engaging with it on. but yeah, that\r\n\r\n\r\nNikolas Hulewsky (23:47.969)\r\nThat's Okay.\r\n\r\n\r\nNikolas Hulewsky (23:53.591)\r\nCool, okay. All right, so we've got all that stuff and now you've created a chat because you want to what? Put your analysis into a doc or like what exactly are you trying to put into PowerPoint?\r\n\r\n\r\nElizabeth Knopf (24:02.702)\r\nYeah. So now, yes. So I am now going to investors sharing what we're talking about, where you have whatever, so trying to basically get our investors on board. so creating a story on that. So if I, if I didn't already have that context, I would have looked up, okay, how can I find an investor pitch deck as an example, and provided that sort of as a framework to give Claude so that it would know how to do that.\r\n\r\n\r\nNikolas Hulewsky (24:16.863)\r\nOkay, sweet.\r\n\r\n\r\nNikolas Hulewsky (24:25.535)\r\nMm-hmm.\r\n\r\n\r\nElizabeth Knopf (24:32.136)\r\nOr I would have asked Claude, find all of the popular frameworks for pitch decks to give me that outline and structure that then I could use as a starting point.\r\n\r\n\r\nNikolas Hulewsky (24:42.935)\r\nRight, because if you were to build it yourself, you need to give Claude the context necessary for it to then build it. And so you would have been doing a bunch of research, finding a bunch of things, seeing what you like, blah, blah, blah. But now Claude already kind of has that built in natively. So you can actually build slides.\r\n\r\n\r\nElizabeth Knopf (24:49.313)\r\nThank\r\n\r\n\r\nElizabeth Knopf (24:59.246)\r\nExactly. And what I did before, I don't think it's in this one, but I had it give me an outline. Is this the outline? I had to give me an outline so I know what was going to come. Yeah, this is not the one with the outline. Yeah, this may have been the outline. Yeah.\r\n\r\n\r\nNikolas Hulewsky (25:12.279)\r\nThat's fine. So what was the first prompt in this chat? Was it like, hey, I want you to build me a PowerPoint. like, were you, how specific or non-specific? Are you okay sharing that?\r\n\r\n\r\nElizabeth Knopf (25:19.544)\r\nMm.\r\n\r\n\r\nYeah, let me see, because I had a couple chats going where I had first done the outline. So I don't want to also waste time here where I should have had that pulled up. But I think I basically said I bet it the what I'm pretty sure I did was I fed it the research document. Then I said my goal is to create an investor pitch deck. I don't remember if I gave context or not as to what an outline would be, but that is a way to get it better.\r\n\r\n\r\nNikolas Hulewsky (25:33.089)\r\nThat's okay.\r\n\r\n\r\nNikolas Hulewsky (25:50.891)\r\nMm-hmm.\r\n\r\n\r\nElizabeth Knopf (25:50.926)\r\nthen, at said the audience are investors. We're trying to get investment for this roll up opportunity, create an outline for an investor pitch deck. And so that was sort of the starting point. then it basically just did it within visualized it without even me or actually, sorry, it created the outline. And then from the outline, I created a visualization of it.\r\n\r\n\r\nNikolas Hulewsky (26:04.886)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (26:17.619)\r\nWow, and so this is the end state of all that?\r\n\r\n\r\nElizabeth Knopf (26:20.49)\r\nSo here's where it gets interesting and tricky. And this is what I want to share about like the ideal version of this and what the reality is and what I ended up actually using. So this was an interactive HTML site that was basically our analysis in this. What is this here? Whoops.\r\n\r\n\r\nNikolas Hulewsky (26:40.661)\r\nAnd was this an interactive HTML site that Claude generated? Cool.\r\n\r\n\r\nElizabeth Knopf (26:43.842)\r\nYes. So Claude did all of this. I didn't touch this. I didn't give any visualization. It created some charts and interactive. So this is all exciting. I'm like, yes, great. All of my time is done. But then, then I realized, wait, I need to send this to somebody. And I'm not used to sending just a link, which maybe I could have done, but I like to have something downloadable and knowing my audience, you need to still have something downloadable in a PDF versus a website they might have not liked as much.\r\n\r\n\r\nNikolas Hulewsky (27:08.873)\r\nMm-hmm. Yep.\r\n\r\n\r\nElizabeth Knopf (27:12.652)\r\nSo I tried then converting it to a PDF. At first I was like, we'll just do a PowerPoint. That failed miserably. So like there is still an issue with format conversion. Like it is the death of me when it comes to this stuff. Cause I was really pumped and this was just clean. I'm sure it could be a lot better, but it was really hard to get it into a nice PDF. like this is sort of the version that was closest, but still when I exported it, it just was like,\r\n\r\n\r\nNikolas Hulewsky (27:21.143)\r\nNo\r\n\r\n\r\nNikolas Hulewsky (27:31.039)\r\nWow.\r\n\r\n\r\nElizabeth Knopf (27:41.08)\r\nkind of ugly. And so this is the closest I got. Let me see if I can even.\r\n\r\n\r\nNikolas Hulewsky (27:45.599)\r\nAnd has all acquisition strategy, leadership team, market analysis. Like, I mean, this makes me think that you would just set up a project, have all of your branding within that project, like your style guide and all of that stuff. And then feed it the context when you're ready to create a new PowerPoint so that it looks the way you want it to look. It has the color scheme, maybe even the pictures that you want. And it's like, just able to generate every single time.\r\n\r\n\r\nElizabeth Knopf (27:59.416)\r\nMm-hmm.\r\n\r\n\r\nElizabeth Knopf (28:13.208)\r\nSo it was less about that. It was literally just getting it into a PDF format. It's like, okay.\r\n\r\n\r\nNikolas Hulewsky (28:17.503)\r\nNo, no, sorry. I agree with you. I'm sorry. I was like commenting on something else. I'm like, I'm just thinking about creating your own PowerPoint presentations. It would be so easy if you let's you don't like the style like you can get it to the style that you want and then create a style guide and then create your own like PowerPoint project. So how did you solve that? The power of the PDF stuff?\r\n\r\n\r\nElizabeth Knopf (28:22.411)\r\nOkay.\r\n\r\n\r\nElizabeth Knopf (28:37.518)\r\n1000 % so yeah, so I didn't and I used a different tool You know, it's at some point at some point you're like is this am I gonna spend more time with this problem Versus, know just doing an easier, you know lower friction path So I still have it in on my to-do list of solving that because I think that will be useful But I went down the path of using another tool that I think is fantastic. Here it is called gamma\r\n\r\n\r\nThey've already solved this, so I went down the path and started using gamma instead. I have a couple versions here, so I don't remember which one I used, so let me just pull up a couple and we'll see which one here. So gamma is an awesome tool, so let me back up a sec actually. So gamma, can give it, you can start from scratch, you can import stuff, so again,\r\n\r\n\r\nNikolas Hulewsky (29:08.512)\r\nOkay.\r\n\r\n\r\nElizabeth Knopf (29:26.796)\r\nIf you have themes you want to import, you can make it more aesthetically appealing. They will generate images for you, which is another thing I hate doing. So that is like super helpful. You can paste in your text and help break it up. You can generate it from one line or again, import from a URL. So let me just go back up here to what I had imported. So again, I had created that outline. I did sort of a free form and then had it broken out into cards, which are essentially sides.\r\n\r\n\r\nNikolas Hulewsky (29:39.457)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (29:42.987)\r\nWow.\r\n\r\n\r\nElizabeth Knopf (29:55.47)\r\nAnd you can adjust this pretty easily. So editing the cards, you can arrange them, you can change images, formats, even the model, you have access to multiple models. so I found gamma is really good, but there are some limitations which we'll get to in a second. So let me go back to, like this is an example of one of the outputs.\r\n\r\n\r\nme put in present mode. So again, this I can easily output. You know, this is nice. It's pretty standard for like bullet and things, does this, can download as a PDF. Yeah. Or put it in other formats. I can do PowerPoint, Google slides. So this they've, figured out the pat, conversion process. but again, it's like every one that was created, like I tried doing different ones, like they all have pretty simplistic.\r\n\r\n\r\nNikolas Hulewsky (30:28.825)\r\nwow.\r\n\r\n\r\nNikolas Hulewsky (30:33.696)\r\nIs this a PDF?\r\n\r\n\r\nOkay.\r\n\r\n\r\nElizabeth Knopf (30:53.355)\r\nlike this was a table but like didn't generate a chart, you know, so it was like something I was not as thrilled with. because I have\r\n\r\n\r\nNikolas Hulewsky (30:57.771)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (31:02.017)\r\nHow easy are they to manipulate afterwards? Let's say you're like, ugh, slide three, want a chart instead of a table.\r\n\r\n\r\nElizabeth Knopf (31:07.766)\r\nYeah, I would say pretty easy. let's even see if we can figure this out here. So you can go here and you can do, okay, card styling. Then you could also go here, edit to improve writing, fix grammar, translate, make longer shorter, break into bullets, add a summary. But what I would also probably do is go back to, let's see how we can get back to the cards if I remember how to do that.\r\n\r\n\r\nNikolas Hulewsky (31:33.356)\r\nYou better.\r\n\r\n\r\nElizabeth Knopf (31:34.666)\r\nAnd so here you can also drag and drop stuff. So you can definitely interact and like change it like you normally would or convert it to a typical PowerPoint. But cards, where are the cards, cards, Card template. Okay, so you can change obviously the layout and format. And I was there before, so.\r\n\r\n\r\nNikolas Hulewsky (31:58.475)\r\nWell, either way, it's a better first draft than anybody could come up with. Can you download these as PowerPoints?\r\n\r\n\r\nElizabeth Knopf (31:58.816)\r\nAmen.\r\n\r\n\r\nElizabeth Knopf (32:05.022)\r\nExactly. A thousand percent. So when you export them, could do PowerPoint, Google Slides, PNG.\r\n\r\n\r\nNikolas Hulewsky (32:09.153)\r\nOkay.\r\n\r\n\r\nBecause then if you download a PowerPoint, you can go and mess around with it.\r\n\r\n\r\nElizabeth Knopf (32:14.99)\r\nExactly. So again, I wouldn't say that's replacing the banker, but that's replacing the average person doing a presentation for a person. And again, it gives you images too, which is beautiful and nice. And it actually sort of figured this out. Like I didn't generate this myself with any prompt. It had the context of the slide and created that. So that was awesome.\r\n\r\n\r\nNikolas Hulewsky (32:22.643)\r\nMm-hmm. Right.\r\n\r\n\r\nNikolas Hulewsky (32:38.177)\r\nWell, I mean, I also think it just, even if it doesn't eliminate those jobs of the analyst who's putting the stuff together, it eliminates like 20 hours a week, you know, like the first draft and the iterations and just so much easier.\r\n\r\n\r\nElizabeth Knopf (32:47.482)\r\nElizabeth Knopf (32:52.47)\r\nAbsolutely, and I'm not gonna go through a full demo but wanted to give a shout out to another product that if you want to get a little bit more sophisticated Something called flash docs which integrates. It's a chrome extension that integrates directly into Google slides now I wouldn't say I'm like a huge fan of Google slides, but it works and they have like they'll give you more Interesting charts this is from a set of Kinsey guys, so they really understand this and you can change stuff So that's also really good\r\n\r\n\r\nNikolas Hulewsky (33:08.054)\r\nMm-hmm.\r\n\r\n\r\nElizabeth Knopf (33:22.6)\r\nthere's other ones out there that I like Jen spark, pop AI, beautiful slides. Like there's a ton of them out there, but so far I would say those are the ones that I've been most excited about.\r\n\r\n\r\nNikolas Hulewsky (33:33.771)\r\nWell, this is awesome. People should go out and just play with this. I'm gonna go play with it in Claude, because I think that Claude, I like the output that Claude gives. But what was the other one? Sorry, now I'm blanking on the name.\r\n\r\n\r\nElizabeth Knopf (33:46.71)\r\nYeah, there, gamma it's just gamma G a a gamma app AI. You'll find it if you Google it.\r\n\r\n\r\nNikolas Hulewsky (33:49.547)\r\nGamma, okay.\r\n\r\n\r\nNikolas Hulewsky (33:54.679)\r\nI have to think all these little AI companies are going to get consolidated, bought up by big players and just integrated. You know what I mean? It's just going to be, oh, this is a feature we wanted. Buy it and integrate it. Just so many right now. It's crazy. Anyways. All right, Liz, this was awesome. Can't wait till next week. I'm sure something crazy will happen and we will talk soon. All right.\r\n\r\n\r\nElizabeth Knopf (34:05.834)\r\nAbsolutely. Yeah, it is to keep up. Yeah.\r\n\r\n\r\nElizabeth Knopf (34:15.32)\r\nSounds good. Thanks.",
  "metadata": {
    "duration": "",
    "date": "2025-06-25",
    "platform_source": "Google Drive"
  }
}