{
  "episode_number": "56",
  "episode_title": "How to Achieve Financial Freedom With Real Estate & Business Investments with Justin Donald",
  "guest_name": "Justin Donald",
  "business_name": "Lifestyle Investor",
  "transcript": "﻿Nik (00:01.061)\r\nAll right, Justin, welcome to Niconomics. Stoked to have you here. In one sentence, could you give us an idea of who you are and what your business\r\n\r\n\r\nJustin Donald (00:12.194)\r\nYeah, Nick, great to be here. Great to connect here at Capital Camp. Nice little shout out to the organizers there that allowed us to meet and really our friend Mike who connected us. So shout out to Mike. Yeah, so I started a company called Lifestyle Investor. It's one of many companies, but this one is kind of like my baby because it was a passion project that I never even thought.\r\n\r\n\r\nNik (00:26.991)\r\nShout out to Mike Higgins.\r\n\r\n\r\nJustin Donald (00:40.972)\r\nthat it was gonna become a for -profit business that ended up becoming my main source of joy from a business standpoint. And so, I always tell people I love teaching others how to buy their time back, how to create true financial freedom.\r\n\r\n\r\nto do that by buying assets that produce income so that way people don't have to work but they get to work and they get to work on what they want to what inspires them where they're uniquely gifted for the time frame that is best suited for them and then they can be intentional with their time that they're not working to really pour into the people that matter most\r\n\r\n\r\nNik (01:19.311)\r\nSo to give people some context here, Justin, you wrote a book recently called The Lifestyle Investors, a Wall Street Journal bestseller. You are on the speaking circuit. You've had some really cool people on your podcast. was looking at it, know, Cody Sanchez, Sam Parr, Noah Kagan, Brandon Turner from BiggerPockets that this world would know. But then you've also shared the stage with people like I think Richard Branson, Sam Zell. There was one other, Robert Kiyosaki.\r\n\r\n\r\nyou know, the OG of rich dad, poor dad. So you're somebody who's seen in this space as having authority and having accomplished a lot. My question is, how did it start? Like where were you as a 25 year old and when did you kind of develop this thesis of I want to be an investor?\r\n\r\n\r\nJustin Donald (02:11.052)\r\nYeah, you know, I've been blessed with some great friendships and some great mentors over the years. You name some people that are some of my dearest friends and some people that I've learned an immense deal from just, just tons of knowledge. So, I mean, I would say that, you know, my first real educator on things that I was most interested in is Robert Kiyosaki. You know, and it's cool that we've gotten a chance to get to know each other and hang out. but, you know, it his books that really kind of opened my eyes.\r\n\r\n\r\nOf course, I feel like most people have read Rich Dad Poor Dad. For me, it was actually his second book, Cashflow Quadrant, that just blew my mind. And I was running a business at that point in time, but I was a slave to the business. I was a true slave in every sense of the word. I spent so much time. I kind of played this game of whoever works the hardest is the best or whatever. And so I\r\n\r\n\r\nyou know, my badge of honor was work ethic. And I think, by the way, that's a great badge of honor when you don't have other, you know, unique skills and giftings that, you know, are, you know, maybe superior to it, right? So like to have a great work ethic is much better and totally trumps being lazy. But if you have really good skills,\r\n\r\n\r\nyou know, work ethic can actually erode some of those good skills if you don't have time to be thinking sharp, if you don't have time to be pouring in or using those giftings the way that you should. So, you know, it's a double -edged sword. It served me until it didn't serve me. And luckily, I figured out that I probably need to be smarter than not. It's not that I have to work this hard. It's that I need to work really smart. I need to surround myself with the right people.\r\n\r\n\r\nNik (03:55.077)\r\nHow old were you when you read, did you say the cashflow quadrant? Is that what it's called?\r\n\r\n\r\nJustin Donald (03:59.15)\r\nYeah, you know, I probably read that one. So let me back up because I would have read Rich Dad Poor Dad when I was in college and then I would have read Cash Flow Quadrant probably the year I graduated. So I would imagine it was 2002 or 2003.\r\n\r\n\r\nNik (04:23.173)\r\nAnd so you were 22, 23, and when you say you were running a business, was that a business you owned or were you working in the corporate setting?\r\n\r\n\r\nJustin Donald (04:25.912)\r\nYeah.\r\n\r\n\r\nJustin Donald (04:30.304)\r\nNo, well, it's actually an interesting description. It was a business I owned.\r\n\r\n\r\nAnd I thought that I had more ownership than I really did. It's where I really learned about, you know, having equity. So I owned a company that, you know, basically was like a recruiting and sales arm for a much bigger company where, you know, I owned my LLC, but really didn't own the business. So it was an interesting experience. was a great experience on many levels where, you know, I got a chance to kind of learn and grow and flex my entrepreneurial skills,\r\n\r\n\r\nbut having a back office and a fulfillment side of things that could complete the business. So it was running a business, but maybe not a full business.\r\n\r\n\r\nNik (05:18.607)\r\nSo you're doing that for, how long did you kind of serve in those roles?\r\n\r\n\r\nJustin Donald (05:24.435)\r\nYou know off and on in you know that capacity for probably about a decade a little bit less, know some a lot more hands -on and and more time invested. I mean what I remember the beginning I was the only person so I was doing everything and over time I built out systems I hired the right people and so I got to a point where I was putting in you know, maybe\r\n\r\n\r\n20 hours a week to that. And I had time for a side hustle and I started doing, you know, a few other things like real estate on the side. And really that's where everything took off. It was like, I figured out how to create enough systems to pull myself out, to buy some time back. And then I took the profits and started investing them in mobile home parks very early on. You know, we're talking.\r\n\r\n\r\nNik (06:08.997)\r\nWhy mobile home parks? Why was that the first thing you started doing?\r\n\r\n\r\nJustin Donald (06:13.024)\r\nWell, technically, you know, got into, you know, single family homes and or like condos, just like at first.\r\n\r\n\r\nWhen I got into this, wasn't as a rental. I bought my own place, turned it into a rental. Then we were looking to scale some single family homes and just realized that that model was a lot more time intensive, labor intensive, capital intensive than at scale. It takes a lot of scale to kind of get it to where we wanted. And so I had some mentors and some friends, both, that were in this space. And they said, hey, you should really learn\r\n\r\n\r\nthis niche because it's less work, mobile home parks are less consolidated than any other real estate asset class. So you have the opportunity to buy some great deals from baby boomers looking to retire. And all that was very true. We bought our first mobile home park and that single investment we bought from a baby boomer wanted to retire. In his words, I want to ride off into the sunset. So he did a seller finance deal with me. So he carried the note\r\n\r\n\r\nthis, but he literally said, I'm looking for a buyer that will just pay me. I'll have money show up every month and I can just ride off into the sunset. And so I remember using that with him when he was debating between who he's going to sell it to. And I'm like, I'm your guy. I will help you ride off into the sunset. but, but that whole situation was great because that one investment, literally, retired my wife. I mean, within a thousand dollars, like that produced enough cashflow that my wife is a teacher. was within a thousand dollars. She was\r\n\r\n\r\nNik (07:34.38)\r\nThat's awesome.\r\n\r\n\r\nJustin Donald (07:56.56)\r\nable to $1 ,000 of our annual income.\r\n\r\n\r\nNik (07:57.935)\r\nWhat year was\r\n\r\n\r\nNik (08:07.769)\r\nSorry, we had to pause there. I'll make sure to edit that out. What year was\r\n\r\n\r\nJustin Donald (08:15.406)\r\n15 -ish years ago.\r\n\r\n\r\nNik (08:18.277)\r\n2010 2009. So so right, right during but right at the bottom of like, the real estate market after the great financial crisis. So you bought you started buying mobile home parks. I'm curious because you were running businesses. Most people at least from my perspective when I was doing it, I was running businesses and I decided I want to buy a business because I'm tired of working for somebody\r\n\r\n\r\nJustin Donald (08:21.641)\r\nYeah, 10, 11, maybe it's 11.\r\n\r\n\r\nJustin Donald (08:30.05)\r\nThat's right.\r\n\r\n\r\nNik (08:44.567)\r\nYou, however, were taking that cash flow and funneling it into real estate.\r\n\r\n\r\nJustin Donald (08:50.594)\r\nWell, the reason primarily was that I thought it would be less work to do that than to run a business, to buy another business. Now, the reality is it probably just all depends. It depends on the business. It depends on the real estate. It depends on scale. It depends on infrastructure systems, all that. But I mean, today I've done both and I can tell you the pros and cons to each of them. But at that time,\r\n\r\n\r\nI felt like that was the better move. was less time for more return. And I do believe that that was accurate.\r\n\r\n\r\nYou know, I figured out today how to be a better buyer of businesses where I'm not buying a job. That's what you got to be the most careful of that you can buy a business that has the ability to afford an operator and that you have the ability to hire a great operator to actually run it. And so I've done that well and I've done that poorly. Luckily I did it poorly first so I could figure out how to do it well later. But you know, otherwise you truly are buying a job like you you think you're buying a business. You think you're making a great investment.\r\n\r\n\r\nis just a total time and energy suck, and then it may not actually make you money.\r\n\r\n\r\nNik (10:01.529)\r\nWhen did you invest in your first business?\r\n\r\n\r\nJustin Donald (10:06.019)\r\nOutside of the primary one that kind of got me going, I started a marketing, well, really it's more like a consulting.\r\n\r\n\r\nNik (10:08.452)\r\nYes.\r\n\r\n\r\nJustin Donald (10:18.574)\r\nrecruiting company and that one again was a start. know, the first one that I bought was, let's see, we got into some franchises early, bought a dog training company. That is a one -off was probably the best single one -off we ever bought. had had a, you know, basically, basically an 11\r\n\r\n\r\nNik (10:33.976)\r\nthese noise.\r\n\r\n\r\nNik (10:37.733)\r\nSo between between 2002 and 2012, we'll call it you had your primary thing that you had equity in. But then you were you were investing in real estate. And the first kind of investment that you made outside of the real estate in your primary thing was kind of what\r\n\r\n\r\nJustin Donald (10:58.882)\r\nLet's see outside of real estate. Yeah. Well we did real estate for quite some time. So, we probably did real estate.\r\n\r\n\r\nJustin Donald (11:12.27)\r\nfor a good seven or eight years before we ever invested in any businesses. So we built up quite the business there and built teams and infrastructure on that. that kind of became the real estate holdings and that real estate arm became a pretty big business in itself. We're today a top 75 owner of mobile home parks. We've never raised money. So my wife and I are the only equity\r\n\r\n\r\npartners or holders in that. So that business has actually grown pretty big and it's one of our biggest businesses.\r\n\r\n\r\nNik (11:50.809)\r\nAnd how many parks do you own? or how many pads? How would you measure the size of that\r\n\r\n\r\nJustin Donald (11:55.29)\r\nYeah, around 1500 pads, it's about 20, 19, 20 parks. And we just kind of did that, you know, one park at a time over the last 15 years and it just added\r\n\r\n\r\nAnd our goal wasn't necessarily to acquire so many. We just had a great system and great people in place and kept getting good deals. And we bought a bunch of other real estate at the same time. mean, we got into multifamily. We got into self -storage, industrial. I mean, our second largest holding is industrial. We've done very well on that, which has been great because of major real estate.\r\n\r\n\r\nsectors that's the largest performing real estate the last six years in a row of You the sectors that are big enough that they measure you mobile home parks. I actually still think outperform it but If anything it they're they're neck -to -neck one and two\r\n\r\n\r\nNik (12:47.557)\r\nWhat was the dynamic like with the company where you were and the fact that you were growing this massive real estate company or portfolio? Did they know about\r\n\r\n\r\nJustin Donald (13:01.56)\r\nYou know, at first I kept it pretty quiet and then later, you know, think it, unfortunately, I think it became a point of contention. You know, more than anything, the organization I worked with,\r\n\r\n\r\nreally saw me or some of other things I was doing is competition, which they probably should not have. I mean, there was no real competing going on, but I think they just worried that I was just gonna recruit all those people into another business, which I never did. I was never gonna do that, never intended to do it. And even though that breakup wasn't on the best of terms, unfortunately, more to their doing and the way that they kind of wanted to\r\n\r\n\r\nand exit, you know, as like, it's been a a decade, you know, and we never still recruited anyone. So, how that went\r\n\r\n\r\nNik (13:55.205)\r\nWas there, so did it get to a point, did it get to the point where they're like, man, Justin's more successful than we are, and it like just created a weird dynamic between you guys, or was there something else that caused that rub?\r\n\r\n\r\nJustin Donald (14:09.056)\r\nYeah, I mean, I think it was that I think it was that I was doing things in a different way. was I was spending less time on it. I was getting better results than than most doing it that way. And maybe that wasn't the example that they wanted to see. You know, maybe.\r\n\r\n\r\nNik (14:25.491)\r\nAnd what was, remind me again, what was that company?\r\n\r\n\r\nJustin Donald (14:29.042)\r\nWell, the name of the company that I first started with is Cutco. And so that was kind of how I got my start in the business, the sales and entrepreneurial world. so, yeah, lot of dear friends. I'm so thankful for that time. But yeah, I think it was a bit short -sighted on the path that they took. And that's okay.\r\n\r\n\r\nNik (14:33.499)\r\nyeah,\r\n\r\n\r\nNik (14:42.317)\r\nAwesome. Lots of successful people start with Cutco.\r\n\r\n\r\nJustin Donald (14:58.306)\r\nIt's totally fine, but I do think that there was an animosity or like maybe they're unsure what's going to happen because financially I didn't need that business. That business actually did very well and we were one of the top performers under their umbrella, but I actually didn't, I got to the point where I didn't need any of that income and I think that was scary for them.\r\n\r\n\r\nNik (15:20.751)\r\nSo you're mid -30s, you've built up a really good cutco business, you've also built up these real estate holdings. How much were each one of those cash flowing at the time that you decided to say, I'm going all in on these investments?\r\n\r\n\r\nJustin Donald (15:38.71)\r\nWell, before I felt like, I mean, I think there's like two different paths you can take. Path number one is you can jump ship at any time and say, hey, we don't have our finances covered by passive income yet, but we'll figure it out. And then path B is I'm going to wait until all my expenses are covered. And then once I'm there, then it's easier to make the choice to jump ship or, you know, to be a little more open and vocal with, you know, kind of my intentions, my path, right?\r\n\r\n\r\nMy wife is more on the conservative side, so she really liked the idea of, let's have this all planned out. Let's make sure that we're not doing anything too crazy. We're not just hoping that there's some sort of a net down below to catch us after we take the plunge. So we worked really hard to first cover our survival income, which, survival income just to get by, not...\r\n\r\n\r\nNik (16:15.513)\r\nYeah.\r\n\r\n\r\nJustin Donald (16:35.342)\r\neating fancy meals and great trips and all that. Like just to get by, bare bones, you know, I think it was like around 60 ,000 a year and we could, we could hit all of our expenses at that point in time. And then the next step, so that was survival income. Then it was, you know, how do we get to lifestyle income? And at that time it was 120 ,000 a year, so 10 ,000 a month.\r\n\r\n\r\nAnd so, you we wanted to kind of accomplish that. That was going to be a big milestone because then you really don't have to work, right? You get to work. But we actually decided it might make sense to stay on and wait until earned income was covered. So, you know, what does that look like? So that was, at that time it was about 350 ,000 that we considered earned income. And, you know,\r\n\r\n\r\nNik (17:15.971)\r\nYeah, what is\r\n\r\n\r\nNik (17:25.157)\r\nHow did you define lifestyle income was just what? Hey, all of our bills are covered. We can eat at the restaurants we wanna eat at. We could take a couple vacations a year. Life is good. Is that kind of what lifestyle? Okay, so what is earned?\r\n\r\n\r\nJustin Donald (17:36.398)\r\nThat's right. Yeah, and you could upgrade, like you could look at, what would an upgraded, you know, or ideal lifestyle income be?\r\n\r\n\r\nBut I got to the point where I was saving over half of the money that I made and I was putting that towards different investments. So like I started saving at 15 % and then I bumped it to 20 % and 25%. And over time, my income increased, I just maintained the same lifestyle or had small increment increases or one -off increases. so the goal is if I just keep\r\n\r\n\r\nour lifestyle, well then we're not going to accelerate the compounding on wealth. But if I can just keep our lifestyle, which we had a good lifestyle, we had, you know, figured out a lot of things that we were able to do. At that point, we lived a good life and we did it rather inexpensively.\r\n\r\n\r\nUm, then this surplus income, you know, you're instead of like working hard to save 15, 20 % of your income, the surplus income that was a hundred percent going to wealth creation or impact, right? Charitable giving. Um, and so that to me was like how you get ahead. I mean, you got a hundred percent of these surplus dollars that can now go towards some sort of, uh, wealth creation and impact giving. Like that's cool.\r\n\r\n\r\nNik (19:00.101)\r\nWhat did you define? How did you define earned income? So 120 lifestyle, 350 earned income. Like what is earned income? What does that\r\n\r\n\r\nJustin Donald (19:06.828)\r\nYeah, just based on how we're taxed, right? So, you know, your highest tax rate is earned income. And so, you know, what are you actually being taxed on? There are unique tax strategies that you've been able to work it out,\r\n\r\n\r\nNik (19:18.173)\r\nyou were you were just trying to, to equal what you were making between cut co and the investments with okay, I get now I get it. Sorry, that's, that's this is really interesting, because a lot of entrepreneurs do this. It's similar, right? They'll start a business, maybe it's an agency business, or maybe they'll buy a business. And that business becomes their cash cow, their cash flow machine. And they start taking those cash flows, and they start placing them other places.\r\n\r\n\r\nJustin Donald (19:26.978)\r\nYeah, that's right. That's right.\r\n\r\n\r\nNik (19:47.749)\r\nbecause they don't need it. They kind of have reached this level where they're like, I'm good at $120 ,000 a year, like you're saying. Now we can go buy real estate and put our money into these other places. And that first business really serves as the catalyst for all of these other ventures. You with your cut co -agency business, effectively we're doing that, right? Like you're generating really good income and then you're just putting it in other places that is creating wealth, but also has this passive income.\r\n\r\n\r\neffect on it. Did you know you were doing that? Or has it only been kind of looking back that you're like, yeah, that's an interesting strategy that I\r\n\r\n\r\nJustin Donald (20:27.126)\r\nYeah, in the moment, I definitely knew I was doing it because I had read enough books and had enough mentors that that was kind of what they said. It's like, hey, how do you get your passive income to equal your, you know, what it costs you to live? And so I just had been doing that ever since I read that ever since I started learning about that concept. was like, that's brilliant.\r\n\r\n\r\nWhy am I flaving away here and not doing anything to replace this? Why am I putting this in the stock market and I don't get the utility today of that? And it's not that I'm negative on the stock market. I look at what the wealthiest people in the world invest their money in. And if you take a look at the wealthiest people, family offices here in the US, you'll see that they only put about 15 to 25 % of their net worth in the stock market. At that time, I was putting 100 % of my net worth into the stock market.\r\n\r\n\r\nAnd that just wasn't a good equation. And I also just felt like I didn't want to be in a system where people were making money when I didn't make money, which was happening at that time.\r\n\r\n\r\nNik (21:27.193)\r\nYeah, you bring up something interesting where the majority of people put their money in the stock market because that's kind of the only vehicle that's available to them. A lot of these private investments, private equity in particular, most people, unless they're an accredited investor, they don't have access to those types of investments. So they can't put their money there. But one area that everybody has access to is real estate. And so it just seems like you're like, okay, well, if I can't go to the VC or if I can't go private equity, I'll start in real estate.\r\n\r\n\r\nYou built up your nut there and then you started shifting into these private investments. So that's kind what it sounds like. Is that\r\n\r\n\r\nJustin Donald (21:56.642)\r\nThat's right.\r\n\r\n\r\nJustin Donald (22:03.394)\r\nThat's totally it. And the same thing is true. Once we were able to make that transition on the real estate side, know, every additional park that we bought was just more surplus income, right? So it's more money that could just be compounded. And for us, we didn't feel like we needed to upgrade our lifestyle. We loved, you know, our life. We felt like we were living a good life. So it wasn't like we needed to buy more toys. It wasn't like, hey, let's buy another home. Let's buy a boat. Let's buy it like\r\n\r\n\r\nWe just, that wasn't our thing. We wanted to spend some money on experiences. That to us is like the best use of capital is experiences and relationships. And then from there, we'll just, we'll let the rest of it be, you know, growth, know, net worth growth and impact related.\r\n\r\n\r\nNik (22:48.133)\r\nSo I think I read it was in 2017 that you ended up going full time or maybe you're 37 when you ended up going full time there. Okay.\r\n\r\n\r\nJustin Donald (22:56.11)\r\nYeah, it's 37, yep. Yes, I definitely could have sooner, but again, the plan was.\r\n\r\n\r\nhow do I make sure that my wife feels good about the transition and, you know, knowing that we had everything covered, life wouldn't change whether I worked or I didn't work. I think that was a very comforting thing for her and she was on board, I was on board. So we waited probably longer than we needed to and we probably had our survival income covered a couple years before that. Probably when I was 35, I really didn't need to be working because everything was covered. But in those two years, I also set up a bunch more systems. I also worked a lot less\r\n\r\n\r\nthat primary business that was generating income and I figured out how to keep it making just as much if not more income with significantly less time. So then I started pouring into other resources. I started pouring into real estate. I started pouring into mentorship. Who can I be around? Who, you know, what are the peer groups that I should be in? Right. So it's like I had this two years of what I would call a master's\r\n\r\n\r\nNik (23:50.765)\r\nmy gosh.\r\n\r\n\r\nJustin Donald (23:57.994)\r\neducation and really just being around some of the wealthiest, smartest investors and entrepreneurs in the U\r\n\r\n\r\nNik (24:06.437)\r\nIt's funny, I feel like I'm in a similar boat. I think I'm one year into my master's degree. I'm not two years yet. But a little bit different. I sold multiple businesses. So I don't have a passive stream of income that replaced what I was making. But I have this large nut that I obviously didn't have before. So I'm in the process of thinking through, like, okay, what does the rest of my life look like? But I've had many conversations with my wife because she's the same way of like, okay.\r\n\r\n\r\nWhat's our stability here? What's our level of comfort? Can we do XYZ projects? And I'm just not ready to commit to any one thing yet. I'm in that master's program. I'm a year older than you were, I'm 38, but I'm like, I don't know yet. I'm trying to figure out kind of what I go all in on. Was there a moment when you were 37 that you were like, okay, I'm ready because of XYZ or was it just\r\n\r\n\r\nJustin Donald (25:00.578)\r\nWell, I think more than anything, was that the plan was when my earned income was covered, we were good to go. And that was it. It was like we hit the number. So it was like, OK, well, now I don't really, I don't need to be doing anything else. So it was more that like we had this game plan, this roadmap, and we had a few years to hit it and we hit it and we're ready to make the transition. I was also ready for something new. I needed to be\r\n\r\n\r\nI needed to be challenged. I needed a new environment and surrounding of people that could help grow me into the next version of me, that could help me think outside the box, that could help me just understand the game of like wealth creation and investing and business building at a whole new level, at a higher level.\r\n\r\n\r\nNik (25:54.149)\r\nHow old were you when you hit like a seven figure net worth, eight figure, I mean, you're probably nine or 10 figure at this point, but like, can you say like what those milestones were for\r\n\r\n\r\nJustin Donald (26:07.682)\r\nYou cut out. you repeat it?\r\n\r\n\r\nNik (26:09.12)\r\nshoot. Yeah. What ages were you when you hit a seven figure net worth eight figure net worth and nine figure net\r\n\r\n\r\nJustin Donald (26:18.024)\r\nman, I'll try and do this justice. So seven figure was probably.\r\n\r\n\r\nJustin Donald (26:34.126)\r\nseventh figure was probably about eight years ago, nine years ago. Let's see, what am I? I'm 44.\r\n\r\n\r\nNik (26:45.253)\r\nSo right around the time that you left, 35, 36.\r\n\r\n\r\nJustin Donald (26:49.354)\r\nActually, take that back. probably would have been, yeah, no, it probably would have been really close, somewhere between 35 and 37. Because I had, well, one important thing that I like to point out is I had financial freedom. So actually, would have been probably.\r\n\r\n\r\n36 or 37 because I had financial freedom before we were ever a millionaire, but then we bought a bunch of properties way under value Per mark, you know for what the market was and we and we got just several killer killer deals And those you know, one of them specifically we probably got for half what it was worth and it later was appraised At I mean, think it was\r\n\r\n\r\nlike 120 % more than what we bought it for.\r\n\r\n\r\nNik (27:45.093)\r\nYou have an interesting kind of growth trajectory because you were earning a lot of money when real estate values were just crushed after the great financial crisis. And so you started buying these properties at a discount and all of that appreciation that you were seeing, you could cash out refi and that income potentially you're refining for a higher value than you bought it for.\r\n\r\n\r\nthat income is not taxable and you could put that back into real estate. So you had like this flywheel compounding effect that was really special for those 12 years post great financial crisis. At the same time though, you've doubled, tripled your net worth from business investments. It's not just real estate. Will you talk about some of the investments you've made since kind of pivoting into private investments?\r\n\r\n\r\nJustin Donald (28:42.446)\r\nYeah, sure. And really it's interesting because it took a long time to become a millionaire, but I was financially free first. So I actually recognized, Oh, I thought I needed to be a millionaire. I don't even need to be a millionaire because all I wanted was financial freedom, but it took me way longer to become a millionaire than it did to become a deca millionaire. that one to 10 went actually really fast because we were able to cash out refi exactly what you said. We bought a bunch of properties. And\r\n\r\n\r\nAnd then from 10 to 100 plus was also a quicker transition, but we had other money and this is where some of the businesses come into play. you know, I started a single family home maintenance company with a couple of friends and that really took off. And then we, it's called Stellar Inc. And that.\r\n\r\n\r\nNik (29:27.557)\r\nWhat was that called?\r\n\r\n\r\nHmm. Do you still own that company?\r\n\r\n\r\nJustin Donald (29:33.75)\r\nYeah, I'm still part owner of it. You know, we've got VC money and so the VCs have, you know, control of that. But it's I mean, it's a great company doing awesome things. And there's kind of like a sister company that we helped start as well. Also in the single family home maintenance space that has done very well. So those two have been huge. And from dollars to value, it was pretty exponential. So those I can't get into the exact figures because there's there's VCs involved in in\r\n\r\n\r\nNik (29:52.239)\r\nHow big are they?\r\n\r\n\r\nJustin Donald (30:03.646)\r\none of them, but I invested, we're talking just thousands of dollars and have made a return of millions of dollars on each of those. And then those dollars got reinvested into some other companies that really took off. mean, one company that we bought was a dog training company.\r\n\r\n\r\nthat ended up doing very well. And we timed it just right. was during COVID. And I noticed that everyone was buying dogs in our neighborhood. Even people who didn't want dogs ended up with dogs in their house and they were just destroying the house. And I was like, man, I think a dog training company might make a lot of sense. And so we found this dog training company and we just, we just totally cleaned house on the team, the staff, the processes really cleaned it up and then boosted the SEO, you know, made\r\n\r\n\r\nthat we were doing the right work online, creating better systems, opening up the window for being able to book appointments, creating a demand, creating a wait list, all these different things. And so we sold that one at a year and a day for an 11X return on our money, which was pretty significant. And then rolled that into some other businesses. And then some of these, like some of what I invest like today, even though I've done\r\n\r\n\r\nowner operator stuff. I've done some franchises. We do a lot more investing in, I want to say we just my wife and I like we do a lot more investing in companies that have a team in place. We'd rather be on the investor side.\r\n\r\n\r\nIt's just at scale, it's a lot easier that way. I know some people prefer to have more control. We don't, but we've had a few businesses that have really taken off in value and several that have had exits, several that are probably due for an exit in the coming year or two. the thing about real estate is if you buy right, it's hard to lose money, but you're probably...\r\n\r\n\r\nJustin Donald (32:07.374)\r\ngrowing it at like 10 to 15 % a year, right? Like your appreciation and like what you're able to do. I mean, if you buy something that's, you know, super low occupancy and you can get the occupancy up, you can have a, you know, bigger returns than that. like, even if it's something's fully occupied, you're probably still going to be growing on average 10 % plus per\r\n\r\n\r\nSo you got a little bit of a ceiling depending on the type. Now business, you buy a business, you have way more risk because it could go to zero. But if you hit it right, you can have exponential returns. So for me, it wasn't that I wanted that it's not that I think this is better than that. I think they're both great and they both have pros and they both have cons. And I think\r\n\r\n\r\nNik (32:37.167)\r\nRight. Way more upset.\r\n\r\n\r\nJustin Donald (32:51.948)\r\nthe better you understand those, the easier it is to decide where to start, where to end, or what to get involved in and what not to get involved in. I just happen to like both of them and I feel like I've learned how to be good at both of them. So they both served us well.\r\n\r\n\r\nNik (33:03.385)\r\nYeah. And you know, starting starting in real estate allows you a safe base that then you can take some of the riskier bets, right? Like, this is, you know, higher risk, higher reward, but cool, I'll place my money in some of these places. And you're diversifying your risk a little more. I want to talk about this thing that I find fascinating with you. You have real estate holdings, which are massive. You have business holdings, which are massive. You didn't say it, but you were an early investor in Orange Theory, which\r\n\r\n\r\nJustin Donald (33:12.216)\r\nThat's right.\r\n\r\n\r\nNik (33:33.401)\r\nhas done really well. But then you also have this business of masterminds. And when I have seen individuals with masterminds, usually that that's their business. And then they invest in these other things just to say like, I'm a businessman. But I got to know you at capital camp. It's the total opposite. You love helping people. And like for you, this is an opportunity for you for you to like give people access to knowledge.\r\n\r\n\r\nTell me, when did you launch your masterminds and why do you love masterminds so much?\r\n\r\n\r\nJustin Donald (34:09.198)\r\nWell, I'm a huge fan of masterminds because I think it's the biggest shortcut to like, growing your wealth, growing your education. To me, it's like the best money I ever invest into myself. So you know, part of the reason I love it so much is because I'm in so many masterminds. I'm in, you know, I have two masterminds, but I'm in 14 others. And it sounds crazy. I mean, back in the day, I was in one or two, and it just kept growing. And I, know, but this is where I learned this is where I grew. This is how I upgraded my peer group.\r\n\r\n\r\nto be around people that played the game of life and business at a higher level than me, or people that at least like, you know, had aligned values, but bigger thinking than me, or, you know, it's, that's really what I wanted. And so, you know, it cracks me up because you have all these social media influencers that have raised tons of money or they have their group and they, you know, they've made all this money, but what they teach.\r\n\r\n\r\nisn't actually what they've made money on. And in fact, they don't know much about what they teach. And in fact, we're starting to see a lot of these people having major slip ups and we're starting to see that like they probably shouldn't have been teaching this. But you know, right now in the marketplace, younger, naive, more immature, you know, investors or new entrepreneurs, they look for\r\n\r\n\r\nvalidation in number of followers that doesn't validate how successful someone is what their experience is they're just a good marketer they're just they can collect eyeballs so yeah\r\n\r\n\r\nNik (35:45.765)\r\nWell, there's a lot of hunger from people who are young to learn as well, right? They wanna know, Justin, how did you make your first million? man, in your mid thirties, you owned all these multifamily rentals. How did you do it? And they're willing to pay for it, which is amazing. But then there's these people who, maybe they did one or two small deals and all of a sudden their business is now the business of educating you as opposed to actually doing those things that they're selling education on.\r\n\r\n\r\nYeah, to your point, it's it's frustrating because you get labeled with this guru title, but there's a huge demand for it. People want to know how to get better, how to make money, how to invest.\r\n\r\n\r\nJustin Donald (36:26.99)\r\n100%. And I just think I try and tell people in a day and age where everyone's a life coach, everyone's a social media influencer, and apparently the newest polls for what high school students want to be when they grow up when they graduate is social media influencers, number one, which is really sad, but it's it's the reality. It's just you got to be even more of a detective on who you're following and who you're going to take advice from. I only want to take advice from people that have done the exact thing that I want to do. They have a track\r\n\r\n\r\nthat is provable. They're not just saying they're good at something. They haven't just been doing it for a year or two and now all of a sudden they make more money on the education that they sell via social media than their actual knowledge or expertise. I just, I'll get off my soapbox, but that's the biggest thing and the biggest danger that I see out there. And I just thought it'd be really cool to create my own community. So I was part of all these other communities, but none of them had exactly what I was looking for.\r\n\r\n\r\nI thought, you know, to me, top of the rung, most important thing is like connection and networking. And I want a group where like every person is someone that I would love to connect and learn and grow with.\r\n\r\n\r\nSo it needs to be like highly vetted and high criteria to get in. Number two is tons of education. Education I can use today, education I can use for a lifetime. Number three is killer tax strategy. Like as you make more money, you want to be smarter about taxes. And then number four is deal flow, like vetted deals that we can get preferred terms on because we have purchasing power, right? But no one had a group like that. So I was like, well,\r\n\r\n\r\nWhat if I just build my own and I created on those foundations and those become the pillars of our community. that's, know, five years ago we started Lifestyle Investor. So the book came out, the book, the podcast and the mastermind literally all came out at the same time. The mastermind came out a little before the book, which a lot of people don't know. And then the book came out and then the podcast came out and they're all just weeks from each other. And I never thought the book\r\n\r\n\r\nJustin Donald (38:28.576)\r\nwas gonna be such a huge hit. Like I just put it out and thought, you know, if I had a few people that bought it, that'd be cool. I didn't have a social media following then. I didn't have a big network. I didn't have a big email list. I mean, I was really rather invisible on social media because I just don't really care for social media. I don't do a whole lot on it.\r\n\r\n\r\nThat book ended up becoming number one Wall Street Journal bestseller and USA Today bestseller. And as of last year, January, a top 1 % of all books ever sold by volume, which is pretty cool. And all the proceeds go to human trafficking. this book is, we've donated hundreds of thousands of dollars on behalf of this book alone, which is cool. And the updated and expanded edition of the book just came out where we have, I don't know, 20 to 25 % additional content in there.\r\n\r\n\r\nNik (39:05.896)\r\nmy goodness.\r\n\r\n\r\nJustin Donald (39:14.456)\r\nthat I'm so excited about and this goes live like any day, which is pretty cool.\r\n\r\n\r\nNik (39:19.301)\r\nSo that's amazing, man. That is really cool to hear. And all the proceeds go to fight human trafficking, which is incredible. You're a part, when we were at Main Street, I think the thing that I enjoyed most about you, we were at dinner and I met you, Levi, Bankert was across from us. And I didn't know anything about you until like 20 minutes in. And I felt the same way about Levi. And I'd hope you guys felt the same way about me. was\r\n\r\n\r\nWe didn't know what your back, like how much money you made or what businesses you had. We were just having a nice conversation about life and like philosophy. And that's what I've admired about you. It just seems like that ethos flows through. having a community that is focused on education just is a no brainer that it's associated with\r\n\r\n\r\nJustin Donald (40:08.418)\r\nWell, thank you. appreciate it. And, you know, it is a pet peeve to me when people posture based on those things. And it's like, hey, man, this stuff's all fleeting. You know, you can be a millionaire one day and dead broke the next if you're not smart. so I just I don't you know, a lot of people use net worth and, you know, the finances as a hierarchy or a ranking system. And I just yeah, it to me, it's just the worst.\r\n\r\n\r\nNik (40:31.289)\r\nYeah, scoreboard.\r\n\r\n\r\nJustin Donald (40:36.694)\r\nIf you're gonna have a scoreboard, that's the worst scoreboard because it doesn't, it's not a good measure of like true character. To me, the scoreboard's probably more like values, character.\r\n\r\n\r\nand unique gifts like that would be, are people truthful and are people putting the relationship before money and all that. There's so many better scoreboards, but unfortunately from a societal standpoint, that I think is what most people look at. I think that's what moves the needle the most for most people.\r\n\r\n\r\nNik (41:10.501)\r\nIt is. It's an easy thing to point to and you know, people feel proud about it for whatever reason. But the thing I found crazy was you looked at your phone and you were like, I'm a part of 14 masterminds like what and you let you showed me the list. I took a picture of the list because I was like, I didn't even heard of most of these. Are you comfortable sharing how much you spend a year on\r\n\r\n\r\nJustin Donald (41:29.71)\r\nYeah, I mean, it's between coaching and masterminds, it's somewhere between 350 and 500 ,000 a year. So the private coaching, so I've got a coach that I pay about 150 a year, and I'm generally in that price point depending on the coach. maybe I spend,\r\n\r\n\r\nNik (41:39.109)\r\nThat's incredible.\r\n\r\n\r\nJustin Donald (41:49.774)\r\nyou know, what is it 150 to 200 ,000 a year on masterminds plus whatever, whoever the coach is for the year that I've hired.\r\n\r\n\r\nNik (41:59.941)\r\nBut for you, it's a no brainer. Like that's what was we were talking. You're like, yeah, I get way more value than I, than I put into it. What, what is it for you that you've mentioned some of the things, but like, what is it for you specifically about masterminds that so\r\n\r\n\r\nJustin Donald (42:15.214)\r\nWell, I think if you're looking at it linearly and a lot of people do, they say, Hey, I put in, you know, for your mastermind, like lifestyle investors, 55 K. So I need to get a return of 55 K, uh, you know, in, in year one, like that's a very linear look at it. And though a lot of people do, um, I do think that's a bad way to look at it. Like for example, um, you know, what if you join and you save over 55 K in taxes year one,\r\n\r\n\r\nthat same strategy allows you to say we're 55K in year two, year three, year four, year five. And that's just one example. But for me, I like to look at it more abstractly where maybe some of the things I learn or some of the relationships that I make in these masterminds, maybe they aren't, the fruit isn't produced year one, it's in year three.\r\n\r\n\r\nLike that's when you know, an idea actually lands or hits or a relationship that I've met and nurtured actually sparks and blossoms into, you a cool partnership. You know, maybe, I mean, tons. Yeah. There's so many where like, I mean, it's funny, there are some deals that I've done today that I would have never even had the chance at being an investor in these deals had I not created a relationship. I mean, we got one group that I invest with.\r\n\r\n\r\nNik (43:15.301)\r\nDo you have any stories from\r\n\r\n\r\nJustin Donald (43:33.71)\r\nthat literally like I got to be careful not to mention their names, but think about so this group invests only family office money and they invest with the biggest family offices out there and they typically do deals 100 % with that family office, right? So no one else is involved per\r\n\r\n\r\nNik (43:53.389)\r\nAnd so people who are listening, a family office, we just explained that really quickly.\r\n\r\n\r\nJustin Donald (43:58.12)\r\nA family office would be an organization that's built around someone that is wealthy enough to have a team and a staff that can do everything for them, manage their finances, do their investments, handle their estate, all that sort of thing.\r\n\r\n\r\nNik (44:11.801)\r\nYeah, so some people get so wealthy that they develop, they hire an office, a CFO, they hire a chief operating officer and they literally manage the family's money. mean, these are multi, know, a hundred millionaires, billionaires that we're talking about here. So that's a family office. So you've built a relationship with one family office that, go ahead. Sorry, I cut you\r\n\r\n\r\nJustin Donald (44:32.342)\r\nI built a relationship with one investment group that they invest for the Ford family, they invest for the Musk family, they invest for the Bezos family, they invest for, I mean, like, you name it, like, this group does the work. And somehow I have been able to create a relationship to get in on investments with this group and alongside some of these families, right? So\r\n\r\n\r\nthat to me is.\r\n\r\n\r\nthat that's like a return that you can't even like, how can I actually draw a return on that? Right? Like, how can I actually say the money I spent, you know, like, just to get access to these deals and to have repeat deals. And now I've done several deals with this group, but like, just access alone is worth it. Not to mention, these have been really good returns. And there's a lot more deals in the pipeline. And you know what I mean? It's, it's just another level. So like, I've made my money back, like,\r\n\r\n\r\nNik (45:33.647)\r\nWhat would\r\n\r\n\r\nJustin Donald (45:36.854)\r\na hundredfold on just one connection. I mean that that one connection covers all the masterminds I've ever done every year for all my life.\r\n\r\n\r\nNik (45:48.357)\r\nWhat would you say to somebody young or who doesn't have the money to join a mastermind? Or maybe they think they don't have the money to join the mastermind. What advice would you give to\r\n\r\n\r\nJustin Donald (45:58.894)\r\nI mean, you got to get clear on what you have to invest in yourself and what you don't. think you should always be investing in yourself. you know, whether it's at the level, mean, most masterminds are going to be somewhere between, you know, a hundred, let's, let's call it 10 ,000 to a hundred thousand dollars. That's where most of them are going to fall. And I would actually say the majority are probably going to be in the 15 to $40 ,000, 15 to $50 ,000 price range. Okay.\r\n\r\n\r\nThat's going to be very common across the board. All right. So do you have the ability to afford that? If you do, you should, but you should do your homework, do your research and find the one where you can get a return on that investment sooner than later. If you don't, that's okay. Save up to the point that you can, but don't cop out and not learn. now it's\r\n\r\n\r\npodcasts and books and taking people out to coffees and picking their brain like be intentional. I mean for 20 plus years I have taken someone smarter than me in some area of life, someone that I wanted to learn from to coffee, lunch, breakfast or dinner at least one time a week. I mean I've even done this on vacation by the way but at least one time a week for 20 plus years. So I mean the compounding effect that I've gotten\r\n\r\n\r\non just those, that education, those relationships is profound. So before I had the ability to start a mastermind, just, you I created my own even early on, but I, you know, when I first started learning podcasts didn't even exist, right? So I mean, what a great resource I'd be all over. I'm still all over those, but I'd be all over those as as a youngster and then, you know, and, books and just anyone that's playing the game of life at a higher level.\r\n\r\n\r\nNik (47:42.725)\r\nYeah. I'm a I'm a big fan of just accumulating good people. And you know, those are masterminds as well, right? Just finding people who are there also striving to be successful. They're trying to get to that next level, somebody who's kind of in the same boat as you. Hey, let's do this together. doesn't necessarily mean $50 ,000 a year to have access to that. finding other individuals that you can share the wins and the losses with is just really valuable. I have some\r\n\r\n\r\nJustin Donald (48:05.986)\r\nAll\r\n\r\n\r\nBut maybe just make a budget. Maybe just say, hey, this is how much I'd like to invest in myself this year. And then find whatever serves that best, right? Because when you were in college, most people went to college, you're probably investing 10 to 20 ,000 a year into your education there, except now you can actually pinpoint it more accurately to like what you want to do and where you'll actually get a return on your investment. So it's funny, like people all of a sudden become cheap, like you're the poorest you've ever been in college yet finding a way to afford, you know, 10, 20, 30, 40, $50 ,000 a\r\n\r\n\r\nNik (48:22.255)\r\nYeah, that's a really good point.\r\n\r\n\r\nJustin Donald (48:38.264)\r\nBut then people are like, I can't invest this into myself. Give me a break. But I used to go through that. That's like the scarce mindset that I lived in early on when, you know, my parents and many people around me helped condition me to have this, this like poor mindset of like, scrimp, save, you know, don't buy that latte from Starbucks because, you know,\r\n\r\n\r\nIf you don't do that for 20 years, the extra change compounded at such interest rate means you're a millionaire, whatever. I think you got to live life and you've got to be willing to invest in yourself and invest in relationships.\r\n\r\n\r\nNik (49:17.155)\r\nAmen. I love that recommendation. I totally agree with that. All right, I got some rapid fire questions to end this. Are you ready? What do you love about investing?\r\n\r\n\r\nJustin Donald (49:24.749)\r\nReady.\r\n\r\n\r\nJustin Donald (49:31.01)\r\nI mean, at first it was that it was part of the plan for financial freedom. Then it was that it just became a game and it was really fun. It was fun to play like Monopoly. And then it was, it's really boring just to do it myself. I really want to help my friends do it. And as my influence and peer group grew, it began to grow beyond just my friends that I wanted to help. So it's like kind of different levels of it.\r\n\r\n\r\nNik (49:57.509)\r\nIt's awesome. What do you hate about it? What do you hate about\r\n\r\n\r\nJustin Donald (50:02.59)\r\nWell, I hate when deals don't go as planned. You know, I hate I hate a loser deal. I mean, that that stinks. You know, that's and by the way, as an investor, it's gonna happen. You know, every investor is gonna have a bad deal lose money like that. The best lessons are going to come from that. But what do I not like? I don't like when groups lie to you. I don't like when groups have bad intentions or or don't do as they say they're going to do like that. That is a big pet peeve of mine.\r\n\r\n\r\nNik (50:05.765)\r\nThat never happens.\r\n\r\n\r\nJustin Donald (50:31.086)\r\nIt's one thing if you miss the business plan and you don't hit projections. It's another thing if you don't have your investors' best interests at mind.\r\n\r\n\r\nNik (50:41.157)\r\nYou're invested in a lot of different industries. You've got real estate, but you also have businesses. What industry or business are you either the most jealous of or the most bullish on over the next 10 years?\r\n\r\n\r\nJustin Donald (50:55.938)\r\nYou're gonna have to re -ass that one we cut out.\r\n\r\n\r\nNik (50:57.477)\r\nI froze up. What what business or industry are you the most bullish on over the next 10\r\n\r\n\r\nJustin Donald (51:09.474)\r\nGreat question.\r\n\r\n\r\nJustin Donald (51:13.846)\r\nI would say on the business side, anything in home services. On the real estate side, anything in.\r\n\r\n\r\nJustin Donald (51:29.048)\r\nProbably more of the affordable or blue collar rental.\r\n\r\n\r\nNik (51:35.333)\r\nOkay, second to last question. If you have two hours in your day and you can do anything you want, you don't have family responsibilities or work responsibilities, what are you obsessed with right now? What are you spending your mental energy\r\n\r\n\r\nJustin Donald (51:53.85)\r\nI mean, if it's just pure recreation, two -on -two sand volleyball or pickleball. I mean, I love that. But I mean, I read for an hour to two hours every day. So I just, love to read. love to, I'm an eternal student. So I might even make the, be able to make the argument that like just becoming a novice in something and learning something is probably where I would spend at least half of that time, if not all of it.\r\n\r\n\r\nNik (51:58.607)\r\nReally? Okay.\r\n\r\n\r\nNik (52:16.805)\r\nThat's awesome.\r\n\r\n\r\nNik (52:20.933)\r\nOkay, and if you had to give yourself advice, 3037 year old no no no no 27 year old Justin Donald, what advice would you have given yourself?\r\n\r\n\r\nJustin Donald (52:33.102)\r\nStart sooner. It's okay to make some mistakes. You're gonna learn some great lessons from those mistakes, but if you wait to make moves, then you don't get that education early on. So you might as well start as early as you can and surround your, and start being intentional with surrounding yourself with the right people that can help you learn and grow and also have your best interests in mind.\r\n\r\n\r\nNik (52:54.617)\r\nLove it. Well, this was a fantastic conversation. Where can people find\r\n\r\n\r\nJustin Donald (52:59.822)\r\nThe best place is lifestyleinvestor .com. There's tons of things on there. We've got courses, master classes. I've got all kinds of free content, a blog, a podcast, the books there. You can get that on Amazon as well. All the proceeds go to fight human trafficking. And something I'd love to do for your community, we do these strategy calls.\r\n\r\n\r\nYou know, we kind of help people figure out how do I get from point A to point B and everyone's in a different, unique situation or circumstance. And so our goal is to just help people take one step towards the right, you know, the direction of financial freedom. So we do these $500 strategy sessions, but for your community, I'd love to do them for free. So anyone that listens to this, you know, that from, your, uh, economics, uh, community.\r\n\r\n\r\nNik (53:48.037)\r\nOkay. Wow.\r\n\r\n\r\nJustin Donald (53:48.954)\r\nWe'd love to host a free strategy session. If you go to lifestyleinvestor .com forward slash consultation, this has been a really big hit amongst the people that have taken the opportunity to talk with our team.\r\n\r\n\r\nNik (54:03.845)\r\nThat's amazing, man. Okay, so lifestyleinvestor .com slash consultation. I'll make a note of that and make sure we drop it in the show notes. That's amazing. I hope people take advantage of that because that's freaking incredible. This is, yeah, this has been awesome. I can't wait to come see you next time I'm in Austin. Have a great summer.\r\n\r\n\r\nJustin Donald (54:13.357)\r\nMe too.\r\n\r\n\r\nJustin Donald (54:18.562)\r\nPleased to do. Thank you. You do the same. Great to connect as always.\r\n\r\n\r\nNik (54:23.363)\r\nAlways, we'll talk soon.",
  "metadata": {
    "duration": "",
    "date": "2024-09-11",
    "platform_source": "Google Drive"
  }
}