{
  "episode_number": "116",
  "episode_title": "How This Mom Built a 7-Figure Business from Home and How You Can Too with Jayne Havens",
  "guest_name": "Jayne Havens",
  "business_name": "Snooze Fest by Jane Havens",
  "transcript": "﻿Nikolas Hulewsky (00:01.667)\r\nAll right, Jane, excited to have you. If you would, I know you've given it a million times, but tell me about your business and how you make money.\r\n\r\n\r\nJayne (00:11.246)\r\nSure. First of all, thank you so much for having me. I'm really excited to be on your podcast. My name's Jane Havens. I'm from Baltimore, Maryland. I grew up here. I live here as an adult. It's fantastic. I have two kids and I'm married and I run a sleep consulting business. I support parents through the process of teaching their little ones to sleep independently and through the night. When I first started working in this field, I was supporting primarily families with infants.\r\n\r\n\r\nthree, four, five, six month old babies. And over the years, my business has shifted a little bit. Now I work with toddlers and preschoolers primarily, three, four, five year olds, which I love. It's really meaningful work. sort of marries sleep consulting and parent coaching together because I really help parents to set limits with their children. I call it loving limits or respectful boundaries. And I do this work entirely virtually. So,\r\n\r\n\r\nMy clients are all up and down the East Coast and some, you know, in other parts of the world, but primarily New York, New Jersey, Connecticut, and I'm in Baltimore. So, you know, I don't have to physically be there to help them. All of my work is done by text message and email and, you know, all the good stuff. So it's really, it's really special.\r\n\r\n\r\nNikolas Hulewsky (01:30.723)\r\nme set some context. Quickly, tell me what year did you start the business and then this year, let's say 2024, how big is the business in terms of revenue, number of employees, maybe number of families helped. I don't know what other metrics you might use.\r\n\r\n\r\nJayne (01:43.916)\r\nYeah, sure. So I started business, my business in 2018. And I think it was actually really the end of 2018. So my first full year in business was 2019. That year, I think I did like $56,000 in revenue, which I was really proud of. It was my first year in business. My business was intended to be a side hustle and it very quickly was like a very legitimate business and something that I was really excited about. Year two, I think I doubled it.\r\n\r\n\r\nNikolas Hulewsky (02:02.191)\r\nYeah.\r\n\r\n\r\nJayne (02:13.774)\r\nAnd then after that, I actually launched my sleep consultant certification program. So my income increased drastically from there. But if we're just talking sleep consulting revenue, I think I do about $8,000 to $10,000 a month-ish. And it's been, yeah, it's been pretty consistent for the past couple of years. I have...\r\n\r\n\r\nNikolas Hulewsky (02:32.751)\r\nOkay, so let's say 120-ish.\r\n\r\n\r\nJayne (02:40.61)\r\nI've sort of gotten into this steady flow of I'm not spending a whole ton of time marketing my business anymore. I've been doing this for enough years where most of my business just comes to me word of mouth, friends of friends, friends of former clients. And so it's, it's pretty steady.\r\n\r\n\r\nNikolas Hulewsky (02:56.815)\r\nAnd the agency, how big is the agency?\r\n\r\n\r\nJayne (02:59.084)\r\nSo it's not an agency, it's an online training program. So I don't actually have contractors working under me. I just teach people how to do this work and then they go and start their own businesses. Last year, my total revenue was like $750,000 or something like that. Pretty cool, right? Like I literally sit at my kitchen table, I wear leggings and a sweatshirt.\r\n\r\n\r\nNikolas Hulewsky (03:18.703)\r\nIt's amazing. Yeah.\r\n\r\n\r\nJayne (03:25.934)\r\nand like barely ever put a face of makeup on and run my business from my phone and my iPad. And, you know, I crack open my computer every now and then. And I have a pretty legitimate business, which is so crazy. Yeah. It's legit. Yeah. Pretty cool.\r\n\r\n\r\nNikolas Hulewsky (03:39.407)\r\nNot a pretty, you don't need to qualify pretty, it's legitimate. You have a seven figure business teaching people how to sleep basically. teach them how to Okay, that's amazing. Thank you for setting the context for me. Help me understand. You said you went from infants, which makes total sense to me. We've had five children. So I'm very familiar with the sleeping training. But you said you go from infants to toddlers? Like what does the ideal customer look like? Or what is a typical\r\n\r\n\r\nI don't know, parent, customer look like when they come to you, what's their problem set?\r\n\r\n\r\nJayne (04:13.164)\r\nYeah, so almost all of the families that I work with, regardless of their child's age, they all have the same struggle. They have a child that either doesn't know how to or is seemingly unwilling to fall asleep without support, right? So little infants, know, four or five, six month old babies, they literally don't know how to fall asleep unless a parent is helping them because that's just always the way that they've done it. So\r\n\r\n\r\nyou know, their entire lives, their tiny short little lives, they've been fed to sleep, they've been rocked to sleep, they've been pushed in a stroller or driven in a car to fall asleep, and they don't know how to get their bodies to fall asleep without that support. So we literally teach them how to do it. We give them an opportunity to try. With older kiddos, you know, two, three, four-year-olds, most of them,\r\n\r\n\r\nwere falling asleep independently at some point and something happened, whether it was sickness or travel or separation anxiety kicked in or something scared them and it led them to no longer feel comfortable falling asleep without help from a parent. And for three and four year olds, that generally looks like a parent sitting in the room with the child while they fall asleep, rubbing their back.\r\n\r\n\r\nSometimes it's not always the parent helping them fall asleep. I've worked with kids who want to listen to their Tony box or they want all the lights on or they need to watch their iPad to fall asleep, all sorts of stuff. And the problem with that is that when a child requires support or accommodations to fall asleep at bedtime, then when their bodies rouse awake in the middle of the night, which like that happens to all humans, it's just normal human behavior.\r\n\r\n\r\nBut when our bodies rouse awake in the middle of the night, they're expecting that same support or those same accommodations. And we really want to get kids to a place where they can just lie down in their bed and close their eyes and let their bodies relax. And next thing they know, they're asleep. And so that when they rouse awake, they can do that in the middle of the night again.\r\n\r\n\r\nNikolas Hulewsky (06:23.501)\r\nAnd why would a parent come to you? Are they like, can't sleep through the night? Or are they worried that their child isn't falling asleep by themselves? And so it's more about what concerns your child.\r\n\r\n\r\nJayne (06:32.364)\r\nWell, what happens is these parents are up all night with their kids because if they're helping them to fall asleep at seven or eight o'clock at night, they pop awake at 1030, they pop awake at 12, they pop awake at two and four and six. And so they're up all night long needing help getting back to sleep. And so these parents are exhausted. And the primary reason that I would say parents come to me for support is because kids cry when we work on it. And...\r\n\r\n\r\nThere's a lot of negativity in this current climate of parenting when it comes to kids crying. Parents have a lot of guilt around their kids being upset and it's really sort of triggering to them. It's raising their blood pressure, their cortisol is soaring and frankly they feel like bad parents because they can't get it straight. And so hiring a sleep consultant or a parent coach\r\n\r\n\r\nreally positions them to have accountability and support and to have like a really clear process for how to go about improving the situation.\r\n\r\n\r\nNikolas Hulewsky (07:37.849)\r\nI want you to talk to this hypothetical man who's 39 years old, that has a four year old, that he lets fall asleep with him every night. Why is that bad? Okay.\r\n\r\n\r\nJayne (07:49.92)\r\nIt's not, it's not bad. It's not, does your four, is this year a four year old? Okay. Yeah.\r\n\r\n\r\nNikolas Hulewsky (07:54.595)\r\nfour year old. I met him before we started Robbie. Oops, Mohammed, take that name out, please. But I just I can't he was born during COVID. He's a COVID baby. Literally, he was born in February was like, I call him my two two weeks to slow the spread babies four years old. And my older kids are getting older. And I just look at him and I'm like, you're growing up so fast. And I, I just tell stories with him. We talk with whatever until he falls asleep. And I enjoy it. But he doesn't wake up in the middle of the night. And he doesn't come into our room.\r\n\r\n\r\nJayne (08:20.386)\r\nYeah, yeah, so there's no problem. Right. Yeah, right, so that's fine. That's fine if that, first of all, I always say, like, if you're helping your kids to sleep either at bedtime or in the middle of the night, and if that's working for you, then like, no problem. Parents come to me because it's not working for them. Like, either bedtime is taking two hours and their children are stalling and, you know, mom has to...\r\n\r\n\r\nmake lunches for the next day or needs to get back onto the computer to get some work done. You know, if that bedtime routine is no longer working for you and you're no longer enjoying it and you're starting to dread bedtime because it's taking forever, then I would empower you to feel confident to make a change. But if you feel like it's a beautiful time and you're connecting and you love it and it's cuddly and you're sleeping through the night, then like, amazing. It sounds sounds beautiful.\r\n\r\n\r\nNikolas Hulewsky (09:14.863)\r\nCan you tell my wife that? So I really love the way that your business started because you found a real problem that you're now solving. mean, parents have been struggling with bedtime for years and generations. And now we have a generation that doesn't like the kids to cry. please teach me how to make my kid not cry when I put them to bed. It's interesting though that you've gone from doing it really well\r\n\r\n\r\nJayne (09:16.514)\r\nYeah, she'll listen, right?\r\n\r\n\r\nNikolas Hulewsky (09:43.417)\r\nbuilding this train the trainer model. And I love it because it allows you to scale. And I think that it's really smart. But can we go back to the beginning? When did you realize this could be a proper business because you haven't always been doing sleep training?\r\n\r\n\r\nJayne (10:00.206)\r\nAll right, yeah, so I have a former background in catering sales, actually. I used to be an event planner. I was really creative. I'm a foodie. I would help families and corporations plan really important, meaningful events. And I did that for, I don't know, eight or 10 years before having my son. I quit. No, I worked for a big catering company in Washington, DC.\r\n\r\n\r\nNikolas Hulewsky (10:22.841)\r\nWas it your company? Okay.\r\n\r\n\r\nJayne (10:29.048)\r\nBut I was operating almost like an independent business owner. I had a lot of agency. I was my own salesperson. So I was in charge of writing the menus and booking the florist and booking a DJ if they asked me for help with that. And all of that was like my own thing. And I kept track of my own budgets and where I had extra money to spend and where I need it. I was really, it wasn't entrepreneurial, but yeah, but it was good training for the work that I do now.\r\n\r\n\r\nNikolas Hulewsky (10:53.231)\r\nYou got some good training.\r\n\r\n\r\nJayne (10:57.434)\r\nespecially from like a customer service aspect, like, right? Like when you're working in catering, the, the customer is always right. And I, when you're working with stressed out families, like they're always right as well. Right. So, so it really did help me. I gave up a six figure career in events to be a stay at home mom. And I was home with my son for four years and I loved it. It was, it was a really special time.\r\n\r\n\r\nNikolas Hulewsky (10:59.897)\r\nYeah.\r\n\r\n\r\nJayne (11:25.678)\r\nWhen my daughter was born, stay at home mom life all of a sudden got really, really challenging. She was colicky. She had a milk soy protein intolerance. She was literally crying all the time. And I was like, I gotta get a job. I gotta get out of here. And so I kept thinking, what can I do to use my brain, earn some money, feel like a highly functioning individual again without...\r\n\r\n\r\nputting my kids in daycare without hiring a nanny. I really still felt like I wanted to be the primary caregiver, but I wanted to like get back to work. And I was always really good at getting my own kids to sleep. Like I figured it out with them at a really early age, both of them. And I was the one who, you know, my friends were asking me for help and then their friends would reach out to me and ask for help. I literally did this work for free, I think for like four or five years before I actually realized.\r\n\r\n\r\nWait a second, I should like get certified and start a business. So one day on a whim, I just said to my husband, like, I think I want to take a training. I think I want to like actually turn this hobby of mine. It was literally just something I did for fun. And I was like, I think I want to turn this into a business and it'll just be a side hustle. I'm not going to like do this full time. just going to, I'm going to dabble.\r\n\r\n\r\nAnd very quickly, it was like a very successful business right out of the gate. I had no problem finding clients. I had people who were ready to work with me and it just sort of steamrolled from there.\r\n\r\n\r\nNikolas Hulewsky (12:52.489)\r\nOkay, have you always been entrepreneurial? Like had you always had in your mind like, yeah, I wanna start a business.\r\n\r\n\r\nJayne (12:59.592)\r\nNo, but I come from a very entrepreneurial family. My father is an entrepreneur. One of my brothers is a true entrepreneur. The other, I would say, is a wannabe entrepreneur. He's a lawyer, yeah, one entrepreneur. He's a lawyer, but he has other things that he works on. He's always trying to make money in interesting ways. So would say that he's entrepreneurial as well. And I was always given this...\r\n\r\n\r\nNikolas Hulewsky (13:12.735)\r\nentrepreneur.\r\n\r\n\r\nIt's okay.\r\n\r\n\r\nJayne (13:26.414)\r\nI don't want to say like safety net, but I was always given this like blessing to go do whatever I wanted. You know, I was raised by parents who believed that I could follow my dream. I could follow my interests. I didn't need to just be a doctor or a lawyer. I could go and like do something interesting. And that I think allowed me to figure out how to be successful in my own way.\r\n\r\n\r\nNikolas Hulewsky (13:32.259)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (13:48.941)\r\nWell, a lot of people want to be entrepreneurs. People use want entrepreneurs like a pejorative. I don't think it's a pejorative. I think it's descriptive. You want to be an entrepreneur before you're an entrepreneur. So in that phase, you're a want entrepreneur. But they're trying to figure it out. Like, OK, when's the right time? When do I make the jump? How do I do it? What was the trigger for you? Like, why did you decide at that point? You've been doing it for four years. Why not continue to just do it? Like, why were you like, I'm going to take a course and start a business.\r\n\r\n\r\nJayne (14:13.56)\r\nSo I think the one thing that I think is really different about me and my personality than most of the people who I see who are wantrepreneurs or whatever that word is, right? I'm not scared. I don't know why that is, but I'm just not scared. Like I talk to people all the time who want to start their own businesses and they're like, I don't know if now's the right time. I don't know if I'm going to be able to figure it out. I don't know if this, I don't know if that. I don't have any of that in my brain. I just go and work on it and I figure it out. And sometimes things work and sometimes things don't. And I kind of don't.\r\n\r\n\r\ncare either way. I think because I think it's fun. And so I don't have all of these things holding me back that I see a lot of aspiring entrepreneurs have in their minds. My moment, I think, was just that I was so frustrated with my daughter to be completely transparent. She was wearing me down. I don't know if any of your kids ever cried nonstop.\r\n\r\n\r\nNikolas Hulewsky (15:11.009)\r\nNo, they've never cried.\r\n\r\n\r\nJayne (15:11.736)\r\nBut okay, so like my daughter cried nonstop. She was, it was brutal. She was a beautiful sleeper. Like when she was sleeping, she was sleeping, but when she was awake, she was crying. And I was done. was like, you know, I like, I gotta get out of here. So I just, needed an outlet. I needed something. Yeah.\r\n\r\n\r\nNikolas Hulewsky (15:29.133)\r\nThis was an outlet for you. What was your family situation like at the time? Were you guys like, hey, it'd be really nice, Jane, if you got a job, because we want to get to a bigger house or we want to take a vacation or were you already comfortable enough where it's like, it wasn't going to make a difference necessarily one way or the other.\r\n\r\n\r\nJayne (15:45.038)\r\nSo we definitely were not, I was not doing this for the money, not at the time. We were comfortable. My husband has a good job. He was sort of like, he's a lawyer and he was sort of steadily climbing the ladder. And he had had some like really good work opportunities. Of course, like more money is always great. But when I got into this, it wasn't for the money. It was for an outlet to do something creative. And I thought, you know, if I make a little extra money,\r\n\r\n\r\nNikolas Hulewsky (16:03.896)\r\nYeah.\r\n\r\n\r\nJayne (16:14.447)\r\ngreat, I'll wallpaper my powder room or I'll, you know, like, well, maybe we'll go to the beach for a few extra days in the sun, you know, like we weren't thinking that this was going to make a major impact on our bottom line. I just felt like I needed to function as like a smart adult again. And, and that was my main motivation at the time.\r\n\r\n\r\nNikolas Hulewsky (16:36.591)\r\nI was just telling somebody this. So my mom is the smartest person I've ever met. She's a genius. She was tested as a child. Like she was actually a genius, but she grew up in the sixties, fifties and sixties. And I always think it's funny that back then it was like, you're a genius. That's great. You're going to make really good dinner. You know, you're going to wallpaper that powder room someday. But you know, she's, she's exceptionally bright and she was always doing things with us, like helping us work through mentally.\r\n\r\n\r\nJayne (16:53.592)\r\nRight.\r\n\r\n\r\nJayne (16:56.995)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (17:06.371)\r\nhow different things work. So it's fascinating to me to hear your story, right? Cause you're like, I needed an outlet. So I started a business and for many people, that's how it starts. They're passionate about something. They like doing it and they need an outlet. And then all of sudden the business, the passion project kind of becomes the main thing. How did you get your first customer?\r\n\r\n\r\nJayne (17:26.7)\r\nI think it was in a Facebook group. I think, I'm almost positive. The interesting thing, I do remember my very first client was a mom with a six year old little girl, which is crazy because when I got into this line of work, I thought I was going to be working with babies. My own kids weren't even six at the time. So like that felt really out of my comfort zone, right? And the first person to hire me,\r\n\r\n\r\nNikolas Hulewsky (17:47.087)\r\nJayne (17:54.744)\r\nhad a six-year-old who was sleeping in bed with her, and that was no longer working for their family. And so was really scary and really overwhelming, but I accepted the challenge. And she didn't know that she was my first paying customer. And we actually had a great outcome. And that gave me a lot of confidence because it was a case that I really thought, you know, I was like, I don't know what to do with this, right? But I figured it out and I gave her\r\n\r\n\r\nall of my attention and it was great.\r\n\r\n\r\nNikolas Hulewsky (18:27.247)\r\nSo you went out, you got certified. I'm doing this. And then the first place you went was Facebook. You're like, I'm gonna find somebody in a Facebook group.\r\n\r\n\r\nJayne (18:34.828)\r\nYeah, so I'm in my early 40s. I'm like one of the first Facebook adopters, right? Like Facebook came out, I think it was my sophomore year in college was when Facebook became a thing. And I went to school in Boston. We were like the third school to get Facebook, right? So Facebook is just like a part of my life. And I feel like it always will be. If I'm just on the internet, I'm probably on Facebook. And I think around this time is when Facebook\r\n\r\n\r\nNikolas Hulewsky (18:49.187)\r\nYeah, yeah, yeah, yeah.\r\n\r\n\r\nJayne (19:03.15)\r\ngroups were becoming a th my business. So there were local groups or interest literally facebook groups fo at Nordstrom or there are\r\n\r\n\r\nNikolas Hulewsky (19:16.015)\r\nThere are so many Facebook groups now. You can find your tribe. Like in the past, you weren't finding other weirdos. Now you can find your other similar weirdos. It's amazing.\r\n\r\n\r\nJayne (19:27.072)\r\nYeah, so I'm pretty positive that that mom found me in a Facebook group. In the very beginning, when I first started my business, I was basically searching all the Facebook groups for the word sleep, because, right, like I would just go into that search bar. Yeah, I would just go into the search bar, not all of the Facebook groups, but the Facebook groups that I was most active in.\r\n\r\n\r\nNikolas Hulewsky (19:40.311)\r\nOkay. Manually?\r\n\r\n\r\nwow. No, I get it.\r\n\r\n\r\nJayne (19:49.29)\r\na couple of times a day, would just search the word sleep or bedtime, and I would filter to see the most recent posts with those words. And then I would just chime in on posts where moms were saying that they were struggling at bedtime or struggling with their child's sleep. And I would offer to get on a quick call with them and, know, see if it would be a good fit for me to support them. And somebody said, yes. Yeah.\r\n\r\n\r\nNikolas Hulewsky (20:11.247)\r\nInteresting. know, there are businesses now that where that is their business model is that they're like, hey, I don't know, pressure washing company. I will go join local Facebook groups in your area. And when I see someone has a need, I'll chime in. And they pose as like the business owner. They have a VA doing it essentially, but it's through Facebook groups. So you were effectively doing that, or at least recognized the power of the distribution channel on Facebook, probably before most people saw it. Was it effective? Were you getting leads that way pretty quickly?\r\n\r\n\r\nJayne (20:39.884)\r\nYeah, yeah, I was and I still do today. I mean, I don't spend as much time doing that now because I have, you know, hundreds, if not thousands, I've worked with thousands of families at this point. So most of my business comes to me because, you know, somebody got my name from their sister-in-law or from their old college roommate. And, you know, I helped them with their kid and now they're reaching out for help. But I still hang out in Facebook groups just because I think generationally, like that's what's comfortable for me.\r\n\r\n\r\nAnd the way Facebook works, the algorithm shows you what you are engaging with, right? So if I'm engaging with posts about sleep, then that's what's coming up on my feed. And if it comes up, I comment. So I still do it to this day.\r\n\r\n\r\nNikolas Hulewsky (21:23.823)\r\nHow did you charge that first customer? Like how did you know what to charge them? was it?\r\n\r\n\r\nJayne (21:28.718)\r\nYeah. So I, what I did was when I completed, I completed an online certification course to, to like say that I was a certified sleep consultant. And what I did was I Googled around and I looked to see what other sleep consultants in my area were charging. And at the time it was like, you know, $450 or $475 for a two week virtual consultation seemed to be like the going rate in my area.\r\n\r\n\r\nAnd so I was brand new when I lowballed it a little bit and I started it for 25 and I very, very quickly raised my prices because, you know, as a brand new business owner, like you don't realize, but you know, if you're taking credit cards, the four 25 becomes, I don't know, like four 16 or something. And I don't know what it is, but like, you know, very quickly, like you have credit card fees. I\r\n\r\n\r\nI send out thank you notes and pajamas to all of my clients after they're done working with me. And the pajamas I get wholesale, they're like nine or $10. But the packaging and the thank you note and the postage, right there, that's another, it's all in probably like $16, $17. So I saw what was eating into my profits. So I very quickly wanted to make the 425 not just start it. I wanted to clear 425, right?\r\n\r\n\r\nI inched up to 450 and then 475. every couple of months I raised my prices. I'm currently charging $750 for the two week consultation. It's pretty much the same service that I've always offered. And I definitely could charge more at this point, but I don't know. I've sort of settled into that pricing. And at this point, more of my income comes from training others than supporting families. So it just doesn't feel like it's going to make that big of a difference to my bottom line.\r\n\r\n\r\nNikolas Hulewsky (23:20.911)\r\nWhat does the two weeks look like? So you went and got certified. Cool. You're, you're a sleep certified coach. don't even know. There we go. So I come, I pay you $750. My kids are driving me crazy. I'm sleeping with all of them in my bed. What does Jane do for me?\r\n\r\n\r\nJayne (23:22.572)\r\nYeah.\r\n\r\n\r\nJayne (23:27.382)\r\nYeah, certified sleep consultant is what I call myself and.\r\n\r\n\r\nJayne (23:37.742)\r\nYeah, so first of all, I would prefer to just work with one kid at a time. So if all of your kids are in your bed, we're going to like work one by one because I find that parents are too tired to really hold the boundary with more than one child at a time. So what that looks like is my clients go to my website and pay. I have, you know, the payment checkout cart embedded into my website. Once they pay, they get an automated email from me that\r\n\r\n\r\nasks them to fill out a questionnaire and they tell me all about their kid, you know, what their bedtime routine looks like, what their daytime schedule looks like, you know, for older kids, I'm asking, are they potty trained? You know, are they, there's lots of questions that I'm asking. I take all of that information and I write a written plan for them. The written plan outlines everything from,\r\n\r\n\r\nyou know, daytime schedule, bedtime routine, for older kids, communication strategies, role play techniques, you know, big picture, all of it. I send that over to them and they hop onto my calendar for a call. We spend about 30 minutes talking through the plan, answering their questions, make sure they feel confident with whatever it is that we're gonna be working on together. And then they have my support and accountability and coaching.\r\n\r\n\r\nfor two weeks, largely via text message and some voice notes. If I need to get back onto phone calls here and there, happy to do that. But I just ask that they schedule them rather than like calling me in a panic at 5.30 when I'm trying to feed my own kids dinner. And right. And then we usually do a wrap up phone call at the end. The wrap up call is a great opportunity to get questions answered pertaining to like, know, parents want to know about, well, what happens when we travel or what if he gets sick or.\r\n\r\n\r\nNikolas Hulewsky (25:11.631)\r\nYeah.\r\n\r\n\r\nJayne (25:27.394)\r\nWhat happens when teething or separation anxiety crops up, right? So we sort of cover all of that on the wrap-up call.\r\n\r\n\r\nNikolas Hulewsky (25:30.404)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (25:33.931)\r\nthey're paying you for you to create a schedule for them to just be very prescriptive. This is what you do. This is how you communicate. Here's some role playing strategies, et cetera. And then effectively a once a week accountability call. How's it going? Fill me in.\r\n\r\n\r\nJayne (25:48.514)\r\nWell, we're communicating by text daily, most of my clients. I do like a morning check-in. After I get my kids off to school, I will shoot off all of my text messages. You know, good morning, how was the night? And they give me the rundown and then I can sort of send them a voice note back. Yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (26:03.759)\r\nDid you do it?\r\n\r\n\r\nYou don't have like a VA or an assistant who's automated that for you. my God, Jane, Jane.\r\n\r\n\r\nJayne (26:10.282)\r\nNo, I do that all on my own. No, I would never turn that over. I would never turn that over because people hire me for me. Like they hire me because they've heard that I'm the best, not because, you know, my VA is the best. No, like they hire me for me.\r\n\r\n\r\nNikolas Hulewsky (26:15.342)\r\nWhy?\r\n\r\n\r\nNikolas Hulewsky (26:27.471)\r\nI'm not saying you should have your VA text them. What I'm saying is if you have a specific time that you text everybody every day and it's a general check-in, hey, just checking in for the morning, that's it. Just schedule that so you don't have to physically go in and type it. And if they respond, of course you respond to them. I'm not saying to take away.\r\n\r\n\r\nJayne (26:45.484)\r\nYeah. So, but like an automated text message from your cell phone, you can do that. I think you can schedule text. I think in the recent Apple update, you can do that, right?\r\n\r\n\r\nNikolas Hulewsky (26:50.809)\r\nYeah. Yeah.\r\n\r\n\r\nYou and I, so I'm 39. You and I are at that age where we're like, we are starting to turn into boomers. We're like, I don't have to figure that out. And that just sounds hard.\r\n\r\n\r\nJayne (27:01.068)\r\nYeah. Totally. I always joke with my husband, like, can you imagine how successful I would be if I only knew how to use my own computer? Like, I say that to him all the time because he's like my tech support. I'm like, can you help me print this out bigger or it's not fitting on the page? Right. And he's like, my God, like, what is wrong with you?\r\n\r\n\r\nNikolas Hulewsky (27:22.978)\r\nNo, I mean, but it's cool because you found your system that works and it works for you. So you don't have to go and change the game. And the only reason you'd really be worried about automating that stuff is if you need it to save time so you could scale or you're trying to get more, but you've you found the rhythm that works for you. So that that part's fine. Do you do you offer like money back guarantees or hey, if you're not happy, I'll do X, Z.\r\n\r\n\r\nJayne (27:45.774)\r\nSo I want all of my clients to be happy, of course. That being said, the work that we're doing together, like I cannot guarantee their success because they have to do the work, right? So it's sort of similar to, know, if you hire a trainer at the gym or a nutritionist, but then you come home and you like stuff your face with pizza and ice cream. that's not.\r\n\r\n\r\nthat's not the nutritionist's fault, right? And so my work is very similar. Like I can give them the information, I can do my best to coach them and hold them accountable, but ultimately they need to do the work. So I don't offer a money back guarantee. What I will say is that for families who I feel are really coachable and who are doing exactly what they should be doing, if we're not getting the results that I would expect to get, then I stick around for a little bit longer.\r\n\r\n\r\nYou know, I hold their hands for a little bit longer. I help them to the finish line. You know, just because it's a two week consultation, I don't leave them high and dry at day 14 if I feel like they're doing everything right. And we're just, you know, we're not exactly where I want to be. It costs me nothing to give them a few extra days. So that's that's how I treat it.\r\n\r\n\r\nNikolas Hulewsky (28:55.407)\r\nSo I really like, this is kind of how I frame when I look at businesses is we first start with the thesis. Like the thesis has to have a problem. And the problem set is people have kids that have a hard time sleeping and or parents have a hard time getting their kids to sleep. Okay. So you've clearly articulated that, which I really like. And then you've defined the product. Hey, I am, it's a two week sprint. Here's what I'm going be doing for you. I create the calendar. We have check-ins.\r\n\r\n\r\nI'm an accountability partner as well as a support and a coach, et cetera. So I like all that. It sounds like you've got your systems set up. You've also identified the distribution, which is like Facebook groups. It seems pretty straightforward to me if I was, I'm going to say mom, it's going to be 99.9 % moms who are going to be doing this type of work. My question though is, and this is the part that seems crazy to me, you have a ton of customers. Like how do you, you stay at,\r\n\r\n\r\n$8,000 $10,000 a month. I'm just going to do some back of the envelope math. That is, let's just say two weeks. So that means there's two periods of time. So that's four. Nope. Got it. Okay. $750 goes into $8,000. Let's just say 10 times. So you've got to at least be getting five people every two weeks that are essentially starting with you. That seems like a high churn.\r\n\r\n\r\nJayne (30:15.777)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (30:19.523)\r\nThat seems like a lot of work to be getting people in. Have you just set up really good systems and funnels to constantly keep a full pipeline?\r\n\r\n\r\nJayne (30:25.42)\r\nNo, I actually really don't have any funnels. I really don't have any funnels. have\r\n\r\n\r\nNikolas Hulewsky (30:30.083)\r\nYou may not call the funnel, but I'm sure you have something that's like, okay, this is how I keep myself organized.\r\n\r\n\r\nJayne (30:35.778)\r\nyou'd be surprised. yeah, I really don't. my, like, I would say that I'm really busy because I'm good at what I do. So I get family's results. It's life-changing. You know, I just, I'm working with a mom and dad of a four-year-old right now who had not slept through the night in two years. They waited two years to get help. And in two nights,\r\n\r\n\r\nNikolas Hulewsky (30:38.297)\r\nme.\r\n\r\n\r\nNikolas Hulewsky (31:02.606)\r\neasily.\r\n\r\n\r\nJayne (31:05.428)\r\nI got that little stinker sleeping through the night, okay? In two nights. And we've only been working together, we're on day like seven or eight at this point. And literally every single day I send them a text and I'm like, just checking in, everything's so good. And they're like, my God, our lives are changed. Like we're literally telling everybody about you. So, you know, it's not always that easy. Like sometimes I have to work harder to get the results that I want my clients to get. But regardless of if it takes two days or two weeks to get the results, it's\r\n\r\n\r\nabsolutely life-changing for these families to go from a place of like extreme exhaustion and sleep deprivation and this feeling of like hopeless despair all the way to feeling like they're on the top of the world because they're getting a full night of sleep. So that transformation that I'm able to provide for my clients is what I think allows me to continue to have more families coming in the door because\r\n\r\n\r\nmost parents know somebody whose kids aren't sleeping. I actually think it's the majority. think that more than half, I mean, I don't have actual data on this, but just based on what I see in conversations and in Facebook groups and what preschool directors tell me and daycare owners tell me, more families are struggling with sleep than not. So for this family that I'm helping with a four-year-old,\r\n\r\n\r\nI bet you half their friends have kids who don't sleep. So that one customer can potentially turn into like five customers, you know? So, you know, that doesn't happen every single time, but it really does position you to grow.\r\n\r\n\r\nNikolas Hulewsky (32:46.479)\r\nYou're probably not marketing heavily right now. That's fine. But if I'm, let's say I'm a mom and I'm listening to this and I'm like, gosh, that sounds really cool. I think it's something I would love to do. I know a lot of people, I'm active in local Facebook groups or Instagram or just even in my circle of friends, my church, whatever, it's local. But they're like, how long would it take me to build up to five grand a month, right? If it's just word of mouth. If you were speaking to them,\r\n\r\n\r\nJayne (32:49.325)\r\nI'm not.\r\n\r\n\r\nNikolas Hulewsky (33:15.213)\r\nWhat would be your, like, how long did it take you to build up to where you wanted to get to?\r\n\r\n\r\nJayne (33:18.988)\r\nYeah, so my business grew pretty quickly. And I think that that's a combination of me being a hustler. Like I did work really hard in the beginning. Like I did, I hustled in Facebook groups. I networked with, you know, family photographers and occupational therapists and therapists who were supporting moms. You know, like I, I was definitely like, you know, making connections and trying to like get referrals from others who are sort of supporting.\r\n\r\n\r\nNikolas Hulewsky (33:37.088)\r\nYeah.\r\n\r\n\r\nJayne (33:46.83)\r\nparents in other capacities with their children. I was earning $5,000 a month within the first, I think, like three to six months of my business. Like it was really fast. I don't see that happening for most people who are getting into the industry. And I don't think it's because it's not possible. I think that it's because there's a learning curve for most people who are starting businesses. They need to learn how to position themselves as experts. They need to gain their confidence.\r\n\r\n\r\nNikolas Hulewsky (34:13.647)\r\nMm.\r\n\r\n\r\nJayne (34:15.17)\r\nThey need to land on verbiage that feels comfortable for them. Those are all things that sort of came more easily to me, I think, maybe because I had a background in sales. I already knew, you know, when you work in catering, every single time someone comes to a caterer to get a proposal, whether it be for a wedding or a corporate holiday party, they're calling three caterers. They're not just calling you. Everybody gets bids. So I was very used to hearing the word no.\r\n\r\n\r\nNikolas Hulewsky (34:24.579)\r\nYeah, because you'd already worked in sales,\r\n\r\n\r\nJayne (34:45.219)\r\nRight. I lost plenty and that didn't kill me because it was just part of the business. It didn't kick me down and knock me out. It was just like part of the job, you know? And so I think when people get into starting their own businesses, they have a really hard time with hearing the word no and rejection feels like the end of the world. And for me, I was unfazed by the rejection. I still talk to people all the time. I think I spoke to like three people yesterday about\r\n\r\n\r\nNikolas Hulewsky (35:04.303)\r\nMm-hmm.\r\n\r\n\r\nJayne (35:13.996)\r\nworking together and honestly, don't think any of them are gonna hire me. And like, I'm okay with that. Like, it literally still happens all the time and I'm unfazed by it. So I think that the reason it takes people time to really get going is they let their emotions get the best of them. They get knocked down and then they're like, this is hard. Nobody wants to hire me. Nobody wants this type of service. And that's really not true. I just think to some degree, it's a little bit of a numbers game. So.\r\n\r\n\r\nNikolas Hulewsky (35:42.255)\r\nBut you get knocked down and you get up again and you're never going to keep me down. No, Timbalamba? No? Okay, never mind. Okay. So my second to last question.\r\n\r\n\r\nJayne (35:47.71)\r\nThat's right. That's right. Yeah, of course. I knew what you were doing.\r\n\r\n\r\nJayne (35:56.28)\r\nBut I didn't answer your question. I think the answer to the question is if you're hardworking and if you're not gonna give up on yourself and if you're really gonna commit to growing a successful business, I think it probably would take six months to a year to get to the point where maybe you are earning $5,000 a month if your pricing was similar to mine.\r\n\r\n\r\nNikolas Hulewsky (36:14.777)\r\nSo you and you've switched, many people do this, right? They start out kind of as a one man, one woman show agency where they're doing the work and then it's growing so much and then people start coming to them and like, hey, could you teach me how to do that? I don't need you to sleep with my kids, but like, how do I do that? Or you're just thinking, I have so much demand. I got to train other people to do it. What was the moment where you decided, hey, I'm going to do the train of the trainer model?\r\n\r\n\r\nJayne (36:38.542)\r\nYeah, so what I realized was that it was really fun to grow a business and it was really fun to start making some very real money. You know, when I first started, was, you know, if I made $2,000, not that that's not real money, but like, you know, I started making like really good money and I was like, okay, how am I going to...\r\n\r\n\r\nI'm in like one big fat competition with myself. It's like a video game where I'm the only one playing. And it's like, I want to get to the next level. And it's not even about what everybody else is doing. It's like, I want to beat my own high score. That's sort of how my brain works. So I got to the point where I was so busy with clients, I couldn't really beat my own high score anymore because I was just so busy.\r\n\r\n\r\nAnd so my two options were really, I bring on other consultants to work under me as sort of independent contractors or do I create my own training program? Those were really like the two options that came to mind. And I am, I guess a bit of a control freak. I don't really trust people to do work for me under my own name. Like, I don't know. I like to do everything myself.\r\n\r\n\r\nI do have some people in my business that support me, very limited. do most, I basically am a one woman show. And I don't really, I don't think I was gonna be a good fit for having other sleep consultants support families under my name and my reputation. I just like didn't trust them to do that. So I felt like it was a better fit to create my own training program. I also thought there was need for improvement in the training world.\r\n\r\n\r\nThe programs that existed prior to me launching the Center for Pediatric Sleep Management were lacking in a few areas, namely support for their students. It was sort of like a, just like an online course in your on your own kind of thing. There was no accountability. There was no support. There was no camaraderie. There was no community inside of these programs. And they were sort of like promising that, but not delivering. And I can say that because like I was in one and I...\r\n\r\n\r\nJayne (38:39.723)\r\nLike they told me that there was going to be like mentorship and support. And I was like, okay, where's that? You know, so like I saw that that was lacking. And the other thing that was lacking was business training. nobody was teaching sleep consultants how to be entrepreneurs. Like, you know, sleep consultants are really, like heart centered people. They're helper people. They're not people who want to get out there and grow a successful business. That's not the way their brains work. So I really felt like there was room to create a program.\r\n\r\n\r\nNikolas Hulewsky (38:55.055)\r\nOkay.\r\n\r\n\r\nJayne (39:08.332)\r\nthat was really comprehensive and evidence-based with regard to teaching sleep, but also to provide a really comprehensive education on how to grow a successful business.\r\n\r\n\r\nNikolas Hulewsky (39:19.553)\r\nYeah, that is interesting. I come from the world of healthcare, home health and hospice. And many people who work in that space, running a business, making money is gross. They feel gross, right? Like asking for money or charging for money. And so there is, you have to help them get over that. So your course, I don't even know if I should call it course, training, not only trains them on the product that they're delivering, which is sleep training, but it also trains them on, hey, how do you position yourself?\r\n\r\n\r\nHow do you market? How do you run a business? How do you charge? All those things. On top of the fact that you also have a community then that they can join and be a part of brainstorm, troubleshoot, et cetera, after they start.\r\n\r\n\r\nJayne (40:01.89)\r\nYeah, that's exactly right. So I have experts in various fields that have come in to train inside of my program on sales, on marketing, on business growth strategy, on mindset work. I actually think mindset work is the most important component because if you don't believe that you're capable of growing a successful business, then you're not, right?\r\n\r\n\r\nNikolas Hulewsky (40:07.779)\r\nThank\r\n\r\n\r\nNikolas Hulewsky (40:22.959)\r\nYou're low churn. people like do people not opt out after they join the community? So churn just means how frequently the your members are coming in and coming out. So if for example I have 5 % churn a month and I have 100 customers, that means that I'm losing five customers every month.\r\n\r\n\r\nJayne (40:28.119)\r\nWhat do mean by that?\r\n\r\n\r\nJayne (40:42.742)\r\nWell, I don't lose any because mine's lifetime access. It's not they don't pay monthly. Yeah, it is. Well, it's ongoing in that it's lifetime access. But I don't have any churn. mean, people might quietly leave if they decide they're not going to finish the course or they decide they're not going to grow a business or maybe they don't whatever. You know, there are people who probably quietly opt out, but there's no official churn because they just pay one time and then. Yeah, exactly.\r\n\r\n\r\nNikolas Hulewsky (40:47.318)\r\nOkay, so it's not ongoing.\r\n\r\n\r\nI get it.\r\n\r\n\r\nNikolas Hulewsky (41:10.127)\r\nis this lifetime actor? Okay. That makes total sense. Dude, this is like the modern day better version of Amway. Or what was that other one where they would get like a pink Cadillac if they increase their sales? Hold on, hear me out. was gonna I said it's it's like it but better. It's like it in the sense that you are like those targeted stay at home mom. I know, know, I know, know. Don't worry. I would have let you kill me.\r\n\r\n\r\nJayne (41:21.836)\r\nYeah, but OK, so it's really it's not it's not multi-level marketing like.\r\n\r\n\r\nJayne (41:29.251)\r\nYeah.\r\n\r\n\r\nJayne (41:32.928)\r\nYou saw it in my eyes. was about to go. I was about to like.\r\n\r\n\r\nNikolas Hulewsky (41:39.139)\r\nlike it's targeting stay at home moms. And you know, they're not any dumber than men, they just have a different occupation, right? And so they're targeting these, these women that could be high achievers that just have untapped potential, except in those it's been like, bring your friend on and you'll get a piece and then you have downstream and but it's they're still like selling a product that their advertisers like having their own business. Lula Rowe was like this for a while where it's like you can have your own business. This is not like that in that sense, right? It's like it in the sense that\r\n\r\n\r\nJayne (41:45.134)\r\nYeah.\r\n\r\n\r\nJayne (42:05.889)\r\nNo, not at all.\r\n\r\n\r\nNikolas Hulewsky (42:07.823)\r\nyou're creating entrepreneurs. They are creating their own businesses. There's no downstream. They're paying to be a part of your course. They're getting a good education. They have a community that they're involved with and you're teaching them how to run these businesses. I think that's amazing. think that and that's what I mean is like the modern day better version of those is it's fulfilling the dream that was sold to many people when we were growing up that really didn't come to fruition. I think what you have is really special. I just think it's really cool.\r\n\r\n\r\nJayne (42:33.238)\r\nYeah, so like I don't take a cut from anybody like people who go through my program and start successful businesses. Like I don't make any money off of that. I just get to brag about the fact that they have successful businesses. It just it makes my program look great when I can say like check out Danielle. She's doing X, Y, and Z and look at Heather and this is what she's accomplishing. So like I don't get anything from their businesses other than like bragging rights on their behalf.\r\n\r\n\r\nNikolas Hulewsky (42:43.343)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (42:56.985)\r\nYeah.\r\n\r\n\r\nJayne (42:59.468)\r\nWhat I will say is that like we've talked a lot about stay at home moms, but actually a majority of the women who enroll in my program are not stay at home moms, believe it or not. They are teachers, they're nurses, they're occupational therapists, they're doulas who are burnt out in their existing jobs and looking to either transition out of their jobs or they're just looking for a way to make extra money without hating their job.\r\n\r\n\r\nNikolas Hulewsky (43:07.789)\r\nOkay, I did.\r\n\r\n\r\nNikolas Hulewsky (43:26.415)\r\nHmm, that's really interesting. So it's not just people who are like, I wanna make some side income and I've been a stay home mom for a while. Like these are, these are.\r\n\r\n\r\nJayne (43:35.736)\r\nProfessionals. Yeah, a lot them. Yeah, we I mean we have a ton of teachers in the program and one of the most one of the most special things that anybody has ever said to me and actually a lot of teachers say this to me is that Becoming a sleep consultant has made them hate their existing their nine to five less Because you know, they they were so burnt out Yeah, like they were so burnt out in their nine to five but they didn't feel like they could leave their job because they have this health insurance and they have their steady income and\r\n\r\n\r\nNikolas Hulewsky (43:40.719)\r\nlike that.\r\n\r\n\r\nNikolas Hulewsky (43:54.927)\r\nThat's really cool.\r\n\r\n\r\nJayne (44:05.106)\r\nthey're not in the position to just ditch their job and build a business from scratch, but they keep their jobs and they do this on the side and it makes them less salty about their existing job because they can just look at it as like, go there, it's a quiet quitting. They go and they collect their paycheck and they have their health insurance and they're less miserable because now they have work that maybe doesn't fully support them, but it fills their...\r\n\r\n\r\nNikolas Hulewsky (44:32.633)\r\nmeaningful.\r\n\r\n\r\nJayne (44:33.728)\r\nIt's meaningful and it's extra income and it just makes them feel better all around. And I love that.\r\n\r\n\r\nNikolas Hulewsky (44:39.631)\r\nThat is really, really cool because...\r\n\r\n\r\nAll of us crave meaning in our work. I mean, how many people have you met that make a lot of money that are just miserable, unhappy people? mean, your husband's a lawyer. He, you know, there you go. But you know, a lot of people hate their job. They feel trapped because they don't get the fulfillment from it. And I think there's something really, really valuable in being able to do something that you enjoy and that's solving a real need. these parents need this. You are solving a real need. Anyways.\r\n\r\n\r\nJayne (44:53.102)\r\nHe would tell you he's miserable. I mean, I don't think he is, but he would say that he is.\r\n\r\n\r\nJayne (45:12.845)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (45:14.979)\r\nI'll stop pontificating. Is there anything I didn't ask that you were like, I wish we would have talked about this?\r\n\r\n\r\nJayne (45:21.325)\r\nmy gosh, those are always such hard questions to ask. It's like,\r\n\r\n\r\nNikolas Hulewsky (45:23.479)\r\nOkay. Okay. Forget that question. Here's one of my favorite questions. I've never asked it before. You're my first, but I've heard it asked. What is something that you believe to be true, but you don't necessarily have data or evidence to support it? So it could be with these children. I think that these children are the result of parents who grew up eating too many gummy bears from microwaves. You probably don't believe that, but I'm sure that you've developed an intuition around this stuff.\r\n\r\n\r\nJayne (45:38.382)\r\nJayne (45:49.484)\r\nYeah. Yeah.\r\n\r\n\r\nYeah, well, what I will say is that my work is getting harder, not easier with regard to, especially when it comes to parent coaching with the older kiddos, three, four or five year olds. My work is getting harder. And I think that that is because of the climate that like we are in parenting wise these days. And it's a few things. Number one, especially I'll speak for Americans, because I don't know if you have an international audience, but like at least here in the States,\r\n\r\n\r\nMost households have two working parents right now. And that is not the way that we were set up like 50 years ago, right? There was a parent present for the children kind of at all times. And that is not the case anymore. So parents are really stretched thin. They're overworked, they're exhausted. They don't have the time or the energy or the patience to really like give their kids what their kids are craving.\r\n\r\n\r\nand the kids are feeling that and that's making bedtime hard, you know? And then also I just think we're in this era of like gentle parenting, which has really evolved into permissive parenting. And so parents are being steamrolled by their three-year-olds and do not have control over their household.\r\n\r\n\r\nAnd I would argue that we were better off with parents who felt, know, the way our parents talk about, like my parents say all the time, like, we never would have allowed that or we never would have, right? Like, I think we need to get back to that a little bit. Like I'm a little bit more old school when it comes to my parenting style. you know, I'm like very straight into the point and like I do what I say and I say what I mean. And I think we need to get back to that a little bit. I think all parents would benefit.\r\n\r\n\r\nJayne (47:48.194)\r\nfrom getting back to a little bit more of like an authoritative parenting style, not authoritarian, but authoritative and really sort of like taking back the head of household position because when a three-year-old or a four-year-old is in charge of your household or even if it's just bedtime, usually that doesn't really go very well, right? And so, right? Like I always tell parents, like we don't let our kids decide where they go to daycare. We don't let them decide what...\r\n\r\n\r\ncar seats they sit in, those are mommy and daddy decisions. And like what bedtime looks like, that also needs to be a mommy and daddy decision. And parents are seemingly pretty uncomfortable with that. And like, we need to get to a place again, where parents feel confident to be head of household and say to our three year old, like, I love you, but like, we're done here, you know?\r\n\r\n\r\nNikolas Hulewsky (48:37.507)\r\nDude, Jane, this has been awesome. What's the name of both companies, the training company and the...\r\n\r\n\r\nJayne (48:44.14)\r\nYeah, so my consulting business is called snooze fest snooze fest by Jane Havens and actually an event planner friend helped me come up with the name of that business. So I have to give her a credit, give her credit there. And my online course is called center for pediatric sleep management.\r\n\r\n\r\nNikolas Hulewsky (48:48.687)\r\nThat is amazing\r\n\r\n\r\nNikolas Hulewsky (49:03.919)\r\nI love it. Okay. Well, I can't wait to check in with you in a year when you got a $10 million business. I'm gonna stop recording for a second.\r\n\r\n\r\nJayne (49:07.598)\r\nThank you.",
  "metadata": {
    "duration": "",
    "date": "2025-02-03",
    "platform_source": "Google Drive"
  }
}