{
  "episode_number": "46",
  "episode_title": "How to Find a Profitable Franchise: Tips from an Expert with Tim Michaels",
  "guest_name": "Tim Michaels",
  "business_name": "Kickstart My Franchise",
  "transcript": "﻿nik (00:00.96)\r\nAll right, Tim, welcome to Niconomics. Stoked to have you, man. For those who don't know you, why don't you give us just a brief introduction of what your business is and how you make money.\r\n\r\n\r\nTim (00:05.29)\r\nexcited to be here.\r\n\r\n\r\nTim (00:13.514)\r\nSure, happy to. So Tim Michaels, name of my business is Kickstart My Franchise. So we are a franchise brokerage. So essentially the way I always describe that to people is we are kind of like real estate agents, except for franchises. So let's say you're an entrepreneur, you're sick of corporate America, you just got laid off, you're trying to figure out what's next. You can come to me. I'll talk to you, ask you a bunch of questions.\r\n\r\n\r\nand then essentially recommend different franchise options. If you end up going through the process, and purchasing a franchise, that franchise will send me a commission.\r\n\r\n\r\nnik (00:55.552)\r\nSo typically if I were looking for a business, I might go to a brokerage or a biz by sale or a specific broker. And I'd say, hey, I'm looking for a business. What businesses do you have for sale? You are sort of that, but you have this other layer of, you know, all of the franchises. So you're kind of almost playing matchmaker as well, where you're like, okay, you want a franchise, tell me about yourself. I'll place you with somebody. Is that kind of how it works?\r\n\r\n\r\nTim (01:21.866)\r\nYeah, exactly. There's 4000 different franchises out there in the US. So it's very overwhelming. You know, when you start going on these different websites, franchise, Gator, different portals, hundreds and hundreds are listed there. It's very hard to tell, you know, which ones are actually making money, which ones are growing. So I can help shorten that process, shorten the funnel for you and take it down to, you know, maybe five, 10 different brands that you look at versus.\r\n\r\n\r\nnik (01:36.704)\r\nMm -hmm.\r\n\r\n\r\nTim (01:50.986)\r\nyou know, 4 ,000.\r\n\r\n\r\nnik (01:52.608)\r\nSo again, if I'm looking for a business in the broker space, there's usually, there could be something called the SIM, which CIM, I don't know why they say SIM, it's weird, confidential information memorandum, where it talks about the business and sort of how it's performed and you got to sign an NDA and all that stuff. How does it work in the franchise space? So let's say I wanted to learn more about rolling subs or I wanted to learn more about, I don't know, pinks window washing. How do I find out about those businesses?\r\n\r\n\r\nTim (02:19.786)\r\nYeah. So, I mean, it's either you can work through a broker like myself, you can go directly to a franchisor. It's typically, you know, a multi -step process. First step would be just having an intro conversation, having them walking you through a presentation, giving you an overview of what exactly that business is, how they're going to support you, why you should give them a franchise fee and pay them a royalty. Cause that's obviously a big concern of a lot of people.\r\n\r\n\r\nnik (02:49.504)\r\nAnd they all have FDDs, right?\r\n\r\n\r\nTim (02:54.218)\r\nYep. Franchise disclosure document. It's legally required document, you know, typically 200 pages, very overwhelming to look at. You know, you typically really only need to look at what I'd say three areas. Item seven, which is going to show you the different investments required to all the different like line items. You know, this, this amount for equipment, this amount for working capital.\r\n\r\n\r\nyou know, basically give you a sense of what the range of the total investment could be. Item 19, which is the actual earnings claim. That's typically the most important, but also needs to be heavily scrutinized, which will show, you know, sometimes just one location, sometimes no locations, sometimes every single location in a full P and L. but that's very important for people to check out and analyze critically. And then the item 20, which shows, have they been growing? Have they been shrinking?\r\n\r\n\r\nnik (03:49.12)\r\nSo for the first one, it's basically just an idea of, okay, how much capital am I going to have to invest into this business? Like, what am I spending money on to get up and running? The second piece, and I can't remember the number, seven, 15.\r\n\r\n\r\nTim (04:02.378)\r\nItem seven is the first one, item 19 and 20.\r\n\r\n\r\nnik (04:05.76)\r\nOkay, 7, 19 and 20. And then 19 is they're just giving like a broad overview of what a typical franchise looks like and how much money they make.\r\n\r\n\r\nTim (04:16.682)\r\nSo in the 19, it has to be a specific location. So.\r\n\r\n\r\nnik (04:20.256)\r\nOkay, so it's not a general hey on average this is like Cincinnati, Ohio.\r\n\r\n\r\nTim (04:24.298)\r\nWell, sometimes it will be an average. I apologize. I did misspeak slightly, but sometimes it will be an average. Sometimes it will be like a quartile. It'll say the first, you know, top quartile, second quartile, third, fourth. It really varies drastically. And I think that's one of the issues a lot of people have within the franchise community is there's not too many standardized ways of presenting this. And oftentimes it's a bit misleading. It will be.\r\n\r\n\r\nnik (04:28.96)\r\nI'm sorry, I'm sorry.\r\n\r\n\r\nTim (04:53.802)\r\nyou know, a location that's from 2000. And it's like, you know, I, I think.\r\n\r\n\r\nnik (04:56.832)\r\nSo I've talked to a couple of franchisors and both of them were just careful about, I guess, the representations that they're making for how much a specific location makes. Why is that? Is it because like, what are the rules around these franchise disclosure documents? Could I go and sue somebody? No, I know, I know, I know. But broadly speaking, why are they so careful about what they represent?\r\n\r\n\r\nTim (05:18.282)\r\nSo I'm not in a hurry, but...\r\n\r\n\r\nTim (05:25.706)\r\nYeah, essentially it's people can come back and sue if you make a false earnings claim. So I have to be very careful in my shoes as well, but the franchisor has to be even more careful if they misrepresent. As has happened throughout history, there have been numerous cases of people misrepresenting their earnings claim. That's grounds for somebody coming back and suing for essentially misrepresenting what was possible out of that investment.\r\n\r\n\r\nnik (05:54.08)\r\nAnd is that because essentially the government has said, hey, look, we're trying to protect people who are evaluating franchises. Franchise or we don't want you to act in a predatory manner just to try to get more fees in order to get more franchisees by lying about what somebody can make at a location. So in order to hold you accountable, if you make misrepresentations, you can be sued. I mean, is that like kind of the general idea of why they're okay?\r\n\r\n\r\nTim (06:19.082)\r\nYeah, yeah, that's the gist of it. I would say all franchisors coach their salespeople to only say what is in the legal document. That's what any good lawyer is going to tell you. Do not say anything that's not in that document.\r\n\r\n\r\nnik (06:34.976)\r\nAnd then, and then section 20, you said whether they're growing or shrinking, shrinking, what does that mean? Like the, the company as a whole or that location? Like what kind of information are they giving?\r\n\r\n\r\nTim (06:44.618)\r\nSo the actual franchisees, so for instance, if, you know, let's say it's Subway, there were 4 ,000 locations or whatever it was, then the next year it'll show, it typically shows three years. So we'll show like the next year was 4 ,200, then 4 ,400. So you can see a trend essentially of, okay, they're opening more locations, but then you'll go to a different company. Let's call it, I can't remember the name of it. It's a burger joint that people,\r\n\r\n\r\ndon't go to anymore, but it's essentially been shrinking. No, not five guys. They have milkshakes. I'm blanking out completely, but that's probably why they're going out of business. But like if you look at it, it'll show like they've been shrinking, you know, 20, 30 units per year.\r\n\r\n\r\nnik (07:16.704)\r\nFive guys? No, not five guys.\r\n\r\n\r\nnik (07:32.128)\r\ninteresting. So that just gives you an idea of like how strong the brand, how strong the pull is of that franchise.\r\n\r\n\r\nTim (07:40.074)\r\nI mean, you don't want to catch a falling knife, right? If people are closing their locations, that's typically not a good indicator.\r\n\r\n\r\nnik (07:46.912)\r\nI've always found it interesting in the franchise disclosure documents that they also get into specifics of how the business operates.\r\n\r\n\r\nI almost feel like why are they publishing this? That like people could just go and copy it and, you know, start their own similar business. Why did...\r\n\r\n\r\nTim (08:02.25)\r\nThere's definitely a lot of good information in there. If somebody wants to sort of circumvent the whole franchise route, you can definitely glean a lot of info from looking at those.\r\n\r\n\r\nnik (08:05.248)\r\nYeah.\r\n\r\n\r\nnik (08:13.248)\r\nAll right, so the franchise disclosure documents, they are public, correct? They have to be made public?\r\n\r\n\r\nTim (08:19.434)\r\nYes, they are public.\r\n\r\n\r\nnik (08:20.864)\r\nWhere would you go and get them? Like, do you just Google it and find it or are there specific places you have to go, you have to pay money for them?\r\n\r\n\r\nTim (08:27.946)\r\nYeah. So I always go to the state of Wisconsin's website. They have, I'd call it 80 % of the disclosure documents up on their website. So you just search for the company name. you can find it on there. I find it wild, but I have clients all the time who are paying different services, like 50, you know, $70 for an FDD when you can just go online and get them for free.\r\n\r\n\r\nnik (08:50.08)\r\nCheers.\r\n\r\n\r\nBecause they have to file them with the state, is that right? The state they operate in? Okay. So there's no like federal repository of all franchises. It's a state by state.\r\n\r\n\r\nTim (08:56.234)\r\nYeah, exactly.\r\n\r\n\r\nTim (09:04.714)\r\nI believe so.\r\n\r\n\r\nnik (09:05.697)\r\nOkay, well, I just always think like, maybe this is just the enterprising person in me where I'm like, I would just like to go see if I'm interested in a business, look at a franchise because the franchises do a really good job of building the cookie cutter approach, the systems necessary to then scale. And I think if you if you've spent the time and money to create a franchise disclosure document and your franchise that's growing quickly, you can just get a lot of value just by reading the document itself.\r\n\r\n\r\nTim (09:33.994)\r\nAbsolutely. And I think the one thing that I always tell people is, you know, it's very hard to actually get to the item 19. Like, sorry. But basically you have to, you have to like go through many rounds of different conversations with the franchise or in order to just get to the item 19, typically, if you go through them, you can go online because typically they're going to give you a presentation. They're going to do a territory review with you.\r\n\r\n\r\nnik (09:56.768)\r\nWhat do you mean?\r\n\r\n\r\nTim (10:03.818)\r\nAnd then they'll share the full disclosure document with you. So it's really important, you know, like most people don't know where that website is and it is a little hard to find the state of Wisconsin's website and go to the actual thing. So if you come to someone like myself, you know, I've already looked at all those item 19s and I've sort of discarded the ones that weren't personally attractive to me. And so that's, you know, a way of sort of streamlining the process for people.\r\n\r\n\r\nnik (10:07.872)\r\nnik (10:25.344)\r\nMm -hmm.\r\n\r\n\r\nnik (10:29.504)\r\nHow did you get into this? Like how did this, your business and what's it called again? I'm sorry.\r\n\r\n\r\nTim (10:35.402)\r\nIt's called Kickstart My Franchise.\r\n\r\n\r\nnik (10:37.216)\r\nKickstart my franchise. It's been around since September of last year. Where did the idea to start this come from?\r\n\r\n\r\nTim (10:45.45)\r\nYeah. So I was in franchise brokerage since 2012, but it was more of a side hustle. I got into this business after I had sort of a failed, futures trading career did it for about three years. You know, it was trading the night shift, doing all these different things and just didn't really pan out how I wanted it to. and so I looked at buying a Jimmy John's.\r\n\r\n\r\nnik (11:06.016)\r\nWere you working for a large brokerage? Were you working for a, I don't know, a finance company that trades in futures? Or was this like on the side you were trying to do futures?\r\n\r\n\r\nTim (11:16.65)\r\nYeah, so smaller proprietary trading firms. So not the big names, you know, like UBS or Goldman, but smaller firms that, you know, people in the trading community would probably recognize. But essentially, you know, just didn't work out. And so wanted to do something else. There was actually a picture of a guy.\r\n\r\n\r\nwho owned multiple Jimmy Johns in the trading room of one of the places. And so that's kind of what got my wheels turning about. This is kind of something interesting where, you know, you own five Jimmy Johns and you just kind of sit on that investment and have a great lifestyle. And so that's what initially was sort of the dream or catalyst for me looking at these different things. And at the time I bumped into a franchise broker and thought it was an interesting way to like look at all these different businesses before jumping into something.\r\n\r\n\r\nAnd so I started back in 2012, but then went back to business school and did a bunch of things. And I always had this idea in my head of sort of doing a Redfin, except for franchises. And so that's what really differentiates us from all the other brokers out there, is that we're going to actually share a portion of our commission after closing with our clients. So they're going to get a few thousand dollars back in their pocket, somewhere up to $10 ,000 just for working with us.\r\n\r\n\r\nnik (12:33.216)\r\nMmm.\r\n\r\n\r\nnik (12:37.12)\r\nAll right, so you've been interested in this space for 14 years, 12 years -ish, but you just started the business last September. What was the catalyst to actually start the business? What was the moment that was like?\r\n\r\n\r\nTim (12:43.146)\r\nYeah.\r\n\r\n\r\nTim (12:50.698)\r\nAdelaide was, yeah, so I was head of strategy and &A for a private equity backed company and I got laid off the day after the Superbowl. So it turns out the intern meeting was not to discuss the actual summer intern program. But, you know, I spent, I spent, you know, six months call it trying to figure out what I wanted to do. Did I want to go back and get another corporate job?\r\n\r\n\r\nnik (12:58.976)\r\nmy gosh.\r\n\r\n\r\nnik (13:05.76)\r\nHa!\r\n\r\n\r\nTim (13:19.85)\r\nAnd I just couldn't find anything that really appealed to me. And I just had always had this entrepreneurial edge. And so, you know, one day I just sort of bought some stuff off of Amazon to, you know, create a podcast studio, sort of like what you're doing here. And just started talking to the camera.\r\n\r\n\r\nnik (13:39.776)\r\nSo, late off in February, because that's around when the Super Bowl is, right? And then between February and September, you were just having conversations, you were laying the groundwork for this business. Like, what were you doing? Did you know in February that you wanted to do this business? Or like, how did it evolve into the idea of the Redfin for franchise brokering?\r\n\r\n\r\nTim (14:04.362)\r\nI'd always had that idea sort of just floating in my head, but I was scared. I was scared to do it. like most entrepreneurs, I think, it was a lot safer.\r\n\r\n\r\nto just go back and get another job. And I think once you reach a certain point in your career, you know, mid thirties is start, you know, when you start to get paid a lot more, people started looking at 200 to $400 ,000 compensation range starts getting progressively harder to jump off the cliff and really start something on your own. And so I was really at that point where it's like, well, I was looking at pretty large paydays if I stayed in corporate America, but it just didn't feel right in my gut. And so.\r\n\r\n\r\nI just didn't find anything that was a good fit. And like I said, one day I don't know what really pushed me over the edge, but I think just feeling like I had to do something because I'm just a person who likes to achieve and just sitting there on my hands, so to speak, even though the wheels were churning, I just felt like I had to do something. 37.\r\n\r\n\r\nnik (15:09.152)\r\nHow old are you?\r\n\r\n\r\nfamily, wife? 34, mid 30s. You said mid 30s earlier, right? I had a clue.\r\n\r\n\r\nTim (15:13.066)\r\nHow old were you going to guess? 34. People always think I'm like 25. I had a guy at an expo call me 25.\r\n\r\n\r\nnik (15:24.896)\r\nDang man, that would be nice. Not me. My kids are like, you're like 45, right dad? Screw you guys. Wife, kids, no family.\r\n\r\n\r\nTim (15:27.978)\r\nHa ha ha.\r\n\r\n\r\nTim (15:37.962)\r\nYeah, no, I've got a wife and three kids, seven, four, and three.\r\n\r\n\r\nnik (15:41.408)\r\nman, okay. I got, I have four boys that are 10, seven, four and two. So busy houses. all right. So you're like, you're going through this process. You've obviously had good, successful corporate positions in the past. You've got a wife, you got young kids at home. you know, we were talking earlier, you're obviously smart. You went to university of Michigan MBA program, which is not, I mean, that's\r\n\r\n\r\nTim (15:47.722)\r\nNice, nice. I'm in the thick of things.\r\n\r\n\r\nnik (16:11.52)\r\nnothing to sneer at. How are you feeling in those, I don't know, six months in between the Super Bowl and Halloween? Like, how are you feeling about like internally about kind of where what you were doing?\r\n\r\n\r\nTim (16:21.578)\r\nYeah.\r\n\r\n\r\nTim (16:27.722)\r\nYeah, I mean, I feel like the first month or so, you're kind of in this period where it felt kind of nice not to have a job. And it was kind of exciting to figure out what was next. And then I think as the months went on, slowly got sort of more difficult, more challenging, started feeling each day, like, what am I doing with my life? How did I sort of get to this point?\r\n\r\n\r\nI was in a wedding for one of my best friends and everybody there was a partner at a big four or some major consulting firm driving fancy cars. And it's hard to not start sort of getting it to a point where it's like comparing yourself to your peers and wondering sort of where did you make the wrong decision? Why aren't you in their position?\r\n\r\n\r\nSo it got hard. And I think, you know, even the first several months of starting this business, it was really hard.\r\n\r\n\r\nnik (17:29.12)\r\nAs, as you were going through those experiences, why didn't you just go back to corporate America then? Right? Like in my mind, it would have been easy to think, Hey, I've got a great degree. I've got great work experience. I'm just going to go back and get a job. Like these past three months have been fun, you know, figuring it out. But I don't like telling people who are partners at other companies that I'm, you know, an entrepreneur.\r\n\r\n\r\nTim (17:50.162)\r\nYeah.\r\n\r\n\r\nnik (17:58.112)\r\nWhat was it that kept you going and didn't allow you to revert back to just going and finding a corporate job?\r\n\r\n\r\nTim (18:06.026)\r\nI think it was just knowing that I wasn't happy in those other positions. Straight out of my MBA program, I was a consultant for Parthenon EY. So we were doing a lot of commercial diligence for private equity clients, a lot of great people at that firm. But it's a grind doing 70 hour weeks. That would probably be the logical step for me to go back there.\r\n\r\n\r\nbut I knew I didn't like it and I knew it wasn't a good fit for a family, especially with small kids. And then in the corporate setting, why is it not a good fit? Yeah, just too many hours. I mean, my wife also works. So, you know, we both need to sort of contribute on both levels as far as like not just having a career, but also at home. So, you know, my kids are worth more to me than that upside.\r\n\r\n\r\nnik (18:37.28)\r\nWhy? Is it too many hours? Yeah.\r\n\r\n\r\nnik (18:53.088)\r\nYeah. Okay.\r\n\r\n\r\nTim (18:59.274)\r\nBut then, you know, from a corporate standpoint, I was at a Fortune 500 in their corporate strategy department for four years. And there are a lot of great aspects about it, but quite honestly, I was bored. It was sort of the opposite of what I had experienced in consulting where, you know, I was probably working, working realistically 20 to 30 hours a week.\r\n\r\n\r\njust because I was pretty efficient and I could get my job done and Fortune 500 company, it's a slow moving machine. You can sort of get lost within it and nobody really tracks it that well. But I wasn't fulfilled and I kind of felt the same way where it's like, what am I doing with my life?\r\n\r\n\r\nnik (19:38.272)\r\nIt's interesting, I'm going through a similar phase at the moment. Last June, I sold the last of the companies that I was kind of working on. And then I stayed on with the company that purchased for eight months, I guess. And it was fine. But I got to the point where I'm like, I just can't, I can't do it. And so in February, for the first time ever, I am without a W -2 income.\r\n\r\n\r\nAnd so like even in the businesses that I owned, I still had a W -2 that I was paying myself. And it's June now, right? I'm coming up on four months of not having a job and my wife is, is, much more conservative than I am. But it's for her, it's like getting to that point of like, okay, what are we, what are we doing? It's not that like we're good. it's not that we need cash right now, but.\r\n\r\n\r\nI'd like to see some type of evidence that this is moving in the right direction. So what's happening? And I'm going through that personally, right? Because like, I'm really invested and I believe in what I'm doing. But I haven't yet seen or found the way to generate the income. And I want to be able to show my wife that like, I'm not just, you know, dinking around on YouTube all day. I really am. I really am trying to build something that will allow us to have\r\n\r\n\r\nTim (20:59.498)\r\nHahaha.\r\n\r\n\r\nnik (21:04.32)\r\nthe lifestyle that we want moving forward. So I'm kind of like in that phase that you were very similar, right? February of this year, right after the Superbowl for you was right after the Superbowl. So this is like a personal question for me. When did you land that first customer? When did you get that first dollar that validated the thesis way back in February to go all in on this new business idea?\r\n\r\n\r\nTim (21:35.562)\r\nWell, I guess the short answer is I had to go all in before I got that first dollar. And the main reason is because it's such a long sales cycle. People don't, you know, it's not like buying a car. You don't go in and buy a franchise the same day. So the average person, you know, it's going to be somewhere in the two to six months, you know, timeframe from talking to them to actually closing a deal. So I didn't close, you know, my first deal until the end of January.\r\n\r\n\r\nand so that was, you know, five months in, I guess, and I've heard many other stories.\r\n\r\n\r\nnik (22:08.48)\r\nFive, well, five months in, what do you mean five months in?\r\n\r\n\r\nTim (22:12.65)\r\nFive months after, you know, I really sort of started the business up in September, essentially.\r\n\r\n\r\nnik (22:17.568)\r\nOkay, so February you're laid off, between February and September was like this soul searching period essentially to identify what am I gonna do? September is when you went all in.\r\n\r\n\r\nTim (22:26.282)\r\nYep. Yep, September is when I went all in. Yeah, and so very long, you know, sales cycle. And I know, yeah.\r\n\r\n\r\nnik (22:31.168)\r\nOkay.\r\n\r\n\r\nnik (22:35.808)\r\nAlmost a year, so almost a year between being laid off and generating that first dollar. I don't want to tell my wife that.\r\n\r\n\r\nTim (22:41.898)\r\nYep. I also, I did have a few side consulting gigs that brought in a little bit of revenue, just more on the strategy consultant side, which helps, you know, pay a few bills. But yeah, more or less, there wasn't anything coming in.\r\n\r\n\r\nnik (23:03.008)\r\nCongratulations man to have the conviction to continue to do that when you've got young kids and a family and geez Louise balls of steel Tim.\r\n\r\n\r\nTim (23:12.234)\r\nI mean, it puts a lot of pressure on everything, right? I mean, especially with kids, three kids in daycare at the time, you know, that's a big bill right there.\r\n\r\n\r\nnik (23:23.968)\r\nHow were you living just off of savings?\r\n\r\n\r\nTim (23:26.506)\r\nMy wife has, she works for PWC. So, you know, I'm very thankful for that.\r\n\r\n\r\nnik (23:33.152)\r\nSo January comes, this is January 2024. Is that correct?\r\n\r\n\r\nTim (23:38.73)\r\nYeah, January of this year, yeah.\r\n\r\n\r\nnik (23:41.152)\r\nOkay, so January comes and you finally get paid your first dollar. Amazing. Tell us a little bit about the business. So how does it work? How are you currently acquiring customers?\r\n\r\n\r\nTim (23:54.538)\r\nYeah, so acquiring them through a lot of different channels. There's all these different paid portals like franchise gainer, franchise opportunities, where you essentially pay them, you know, 30 to $50, sometimes $60 per lead. Oftentimes you can't even get ahold of the person. So you'll sit there, you know, maybe get five leads in a day, pay $200 and maybe you'll speak to one person. Maybe you won't.\r\n\r\n\r\nAnd so there are many long days where, especially early on where it's like, well, I just spent another $200 just spent another there. and you're like, what am I doing? Is this, does this make sense? Am I ever going to see the ROI? and some people don't quite honestly with you because they either can't talk to people. They don't have the background to sort of get that credibility. but some people who hang in there like myself, it can be.\r\n\r\n\r\nvery lucrative. I wouldn't say I'm at the point yet where it's very lucrative, but I'm at the point where I've sort of proven it could be, yeah, or, you know, it could at least be a stable income that could give me a decent lifestyle.\r\n\r\n\r\nnik (24:58.08)\r\nYou can see it. You can see it getting there.\r\n\r\n\r\nnik (25:06.976)\r\nOkay, so one of the lead sources are these portals. Is that the only lead source or are there other channels that you're getting leads from?\r\n\r\n\r\nTim (25:16.042)\r\nYeah, so there's basically messaging people on LinkedIn. We're doing some automated messaging there. There's going to different expos. So I've gone to maybe four different expos. Sometimes my wife goes with me. Sometimes my brother franchises expos. And sometimes...\r\n\r\n\r\nnik (25:37.568)\r\nIf you were to break down like a percentage, what percentage come from those portals and what percentage comes from direct messaging and the conferences?\r\n\r\n\r\nTim (25:49.29)\r\nSo it varies a lot over time. The main goal I would say to you is to gradually get away from those portals. So initially you're gonna pay for all your leads unless you have some crazy network or you have a very large social media presence. You're gonna have to pay for the ads initially. The goal though would be over time to grow sort of your LinkedIn, your Twitter, your social media accounts, YouTube, whatever it is.\r\n\r\n\r\nso that people are coming to you. That's when things really flip, but it's very hard to sort of last long enough to get to that point, if that makes sense. And I realized I didn't answer your question about the percentages. Yeah, but essentially it starts out very high paid and then over time starts to shift.\r\n\r\n\r\nnik (26:28.704)\r\nYeah, totally makes sense.\r\n\r\n\r\nnik (26:34.048)\r\nWhat do you mean?\r\n\r\n\r\nthat's OK.\r\n\r\n\r\nnik (26:43.488)\r\nSo are you experiencing with any SEO paid, you know, pay -per -click, trying to think of anything else, any of those traditional digital marketing channels and funnels?\r\n\r\n\r\nTim (26:55.178)\r\nnot a ton. I would say I've started doing some Facebook ads, Facebook leads, again, very hard to get ahold of people even after they fill out the forms. You know, you call it's a very low percentage. They actually pick up the phone. so it's, you know, it's, I would say this is an endurance game. It's, you know, you, it's not for somebody who needs to, needs to make a sale immediately because this is a long game.\r\n\r\n\r\nnik (27:23.36)\r\nSo let's just stick with the portals for now. From the portals, how many leads does it take to turn into a customer? Do you know those numbers?\r\n\r\n\r\nTim (27:35.658)\r\nI would say for the portals, if you have the right setup and everything, you could probably do like one out of 200.\r\n\r\n\r\nnik (27:46.624)\r\nOne out of 200.\r\n\r\n\r\nAnd how much are you paying per lead?\r\n\r\n\r\nTim (27:49.994)\r\nYeah.\r\n\r\n\r\nIt depends somewhere in the 40 to $60 range. So I would say on average, it's probably going to cost you eight to $12 ,000 for one sale.\r\n\r\n\r\nnik (28:02.144)\r\nHoly crap, seriously. Okay, so your customer acquisition cost is, we could just call it 10 grand, but eight to $10 ,000.\r\n\r\n\r\nTim (28:06.342)\r\nYeah.\r\n\r\n\r\nTim (28:13.514)\r\nthrough those sources, yeah.\r\n\r\n\r\nnik (28:15.68)\r\nAnd I'm taking notes by the way, so I'm not just banging out a tweet. Wow. So like you potentially if you're starting out a business like this, you do need capital to get started.\r\n\r\n\r\nTim (28:18.25)\r\nYeah.\r\n\r\n\r\nTim (28:29.354)\r\nYeah. And I think that's one thing that some of the networks are maybe a bit misleading about. You know, if you, if you go on and you see, you know, I'm a part of a network and most people are because essentially they come with all these preexisting contracts. Most of the networks will tell you, you know, put in 25, 30 ,000 for the initial investment for to pay us basically to let us let you in the network. And then you're just going to, you know, start selling these things. You can spend a thousand, 2000 a month.\r\n\r\n\r\nI think in reality you have to spend more like $5 ,000 plus a month to have a realistic chance of this turning into something.\r\n\r\n\r\nnik (29:08.992)\r\nOkay, so tell me about the, I guess, value of a customer then. If you're spending $8 ,000 to $12 ,000 just to acquire a customer, what's the typical LTV of a customer?\r\n\r\n\r\nTim (29:23.006)\r\nSo if a customer actually goes through and buys, right, then, you know, the average commission, you're probably looking in the $30 ,000 to $35 ,000 range.\r\n\r\n\r\nnik (29:35.616)\r\nHow does that work? Is it a set fee per franchise or is it a set like percentage? Like, is there an industry average for what's typically paid to franchise brokers?\r\n\r\n\r\nTim (29:44.138)\r\nI would say the industry average is about $30 ,000 for one location, one territory, and then $10 ,000 for each additional territory.\r\n\r\n\r\nnik (29:53.568)\r\nOkay, so you are incentivized to have them purchase more territories essentially.\r\n\r\n\r\nTim (29:58.538)\r\nYes, yeah absolutely.\r\n\r\n\r\nnik (30:01.568)\r\nWow, OK, so still you're looking at a what is that? 30 to 10 at a 3X return on ad spend. That's not great.\r\n\r\n\r\nTim (30:15.722)\r\nI mean.\r\n\r\n\r\nnik (30:16.0)\r\nI'm not saying it's I mean, you're making money. I'm not saying you're not making money. But you know, some of these businesses that I've spoken to are like, yeah, we 10x our ad spend, you know, we're kind of an ad spend but\r\n\r\n\r\nTim (30:24.106)\r\nYeah, no relative with some other industries. Certainly, I'm sure there are ones with better returns out there.\r\n\r\n\r\nnik (30:30.56)\r\nBut this is much higher ticket, right? Like those ones may have a 10X and it's a $50 item, but this is a $30 ,000, $35 ,000 item. Do you need any special certifications or like to be licensed in order to do this? Or like, could I just decide, I'm gonna spend 10 grand this month, find a lead and make 35 grand?\r\n\r\n\r\nTim (30:33.514)\r\nHigh ticket, I know.\r\n\r\n\r\nTim (30:55.338)\r\nSo there are a few states where you have to like register. I think it's, I want to say it's like Washington and I can't remember what the other one is, but you have to fill out some paperwork. Outside of that, it's a little bit like the wild, wild west. Yeah. I think, you know, they're, they've started to introduce some legislation like out in California and stuff where they're going to make brokers disclose.\r\n\r\n\r\nnik (31:10.624)\r\nReally.\r\n\r\n\r\nnik (31:20.64)\r\nCalifornia introduced legislation. I'm shocked. I don't believe you. Just kidding.\r\n\r\n\r\nTim (31:23.53)\r\nYeah, but yeah, for the most part, there's pretty low barriers to entry.\r\n\r\n\r\nnik (31:33.056)\r\nOkay, let me just like, I wanna push on this a little bit. Could I today decide I'm gonna start spending $10 ,000 a month? I get a customer, they go through the process. Like you said, it's a long sales cycle. So let's just say two months down the road, they actually make the purchase. And then a franchise is gonna wire me $35 ,000. Do I have to like go through an accreditation process with the franchises? Like, do I have to get registered with them? Like what, is there a like,\r\n\r\n\r\nI don't know, even administrative process where I have to get up and running.\r\n\r\n\r\nTim (32:05.578)\r\nyou would at least need to sign referral agreements if you didn't go through a network. So I'm a part of a network called Franserv. Essentially, it's called Franserv. There are probably five to 10 main networks out there all have slightly different tweaks as far as the pitches are concerned. But essentially,\r\n\r\n\r\nnik (32:14.112)\r\nWhat's it called?\r\n\r\n\r\nTim (32:28.394)\r\nbeing a part of one of these networks gets you all those contracts. So you don't have to go around and sign 800 different contracts. It gets you up to speed very quickly versus if you just start today yourself, it'd take a while to sign those contracts, figure out everything. Another thing is on the backend, like if you were my candidate and I was talking to you, I could run 20 different territory checks at one time with one click of the button, whereas,\r\n\r\n\r\nnik (32:56.896)\r\nWhat does that mean? Sorry, I don't know what that means.\r\n\r\n\r\nTim (32:58.986)\r\nYeah, so a territory check would essentially mean, you know, me verifying that your area of interest, your zip code, whatever part of the country you're interested in is available. There's not an existing franchisee there or that franchisee has the right to do business there.\r\n\r\n\r\nnik (33:12.8)\r\nGot it.\r\n\r\n\r\nis that public or do you have that access because you're part of Franserv?\r\n\r\n\r\nTim (33:22.826)\r\nIt's not public typically. I mean, some websites will show you like hot, hot maps, you know, but typically it's not public. Yeah.\r\n\r\n\r\nnik (33:30.112)\r\nSo that's because, okay, that's interesting. So you join France or if you pay them a fee, I'm assuming, right?\r\n\r\n\r\nTim (33:37.93)\r\nYeah, there's an upfront fee and then, you know, they take an additional 5 % off the top.\r\n\r\n\r\nnik (33:45.792)\r\nthey take a 5 % of the referral fee. Okay. How much is the fee? Did you get started in France?\r\n\r\n\r\nTim (33:53.738)\r\nI don't want to misspeak. I believe it's around 25 ,000.\r\n\r\n\r\nnik (33:57.184)\r\nOkay. Okay. All right. This is interesting. So like, there's not necessarily barriers to entry from a regulatory standpoint, although some states do have them, but it costs a lot of money to get started in this space. And you have to have a network.\r\n\r\n\r\nTim (34:13.77)\r\nYeah, I would say you need a bit of capital. Ideally, you would have more of a white collar background because those are the people with the capital to typically invest in franchises.\r\n\r\n\r\nnik (34:28.896)\r\nAnd wow, that's really blown my mind. I had no idea about this space. In what? No, no, I don't want to build anything, man. That's it's funny. I have these conversations a lot with Chris in particular, and we're both like, at the point where we know the operational headache it takes to scale something up. So any, anything that we're attracted to, we also know that the flip side, which is like,\r\n\r\n\r\nTim (34:34.726)\r\nAm I creating a competitor?\r\n\r\n\r\nTim (34:52.298)\r\nYeah.\r\n\r\n\r\nnik (34:57.984)\r\ngoing to take a lot of time and energy more than you thought in order to get scaled up. For for this space, like what is the closing look like? You finally get somebody on the hook and they're interested. How much liaison are you doing in between them and the franchise? Like are you doing a lot of hey, tell me about yourself qualifying them and then making the recommendations.\r\n\r\n\r\nTim (35:02.474)\r\nYeah.\r\n\r\n\r\nTim (35:22.73)\r\nYeah, it's mainly on the front end. Ideally, you're going to stick with that candidate throughout the entire process and help them with things like funding, finding attorneys, just helping them as far as being a resource to bounce ideas off of. One thing I'm constantly coaching my clients on is you need to do franchisee validation. You need to call five plus people.\r\n\r\n\r\nwho are already going through this franchise to see, are they happy? Are they making money? Because there are way too many people who just like the sales pitch, jump into a brand and then, you know, two years later still are just breaking even or, you know, have some other horror story.\r\n\r\n\r\nnik (36:06.496)\r\nSo how much time do you spend, would you say, on average per client from lead to close? Is it like a couple hours a week? Is it less than that? What does it look like?\r\n\r\n\r\nTim (36:19.594)\r\nTo close, it really varies on the client, honestly. I have some clients who refuse to talk to me after the first recommendation and they still end up closing. I have other clients who will message me, they'll text me several times a day and it will be ongoing for three, six months. So highly variable, I would say an average person, it's probably one touch point a week.\r\n\r\n\r\nover a three to six month period.\r\n\r\n\r\nnik (36:52.832)\r\nBut the thing that is consistent is there's that initial upfront conversation kind of guiding them to maybe a franchise or two that you would recommend. After that, it's highly variable with how much they want to be involved with you.\r\n\r\n\r\nTim (37:05.578)\r\nRight, exactly. Yeah, that initial conversation, you know, is probably around 45 minutes, getting a better sense of that person's situation, their skill set, their income goals, personal interests, really what they're trying to accomplish and just understanding the context of their life. And then from there, you know, doing territory checks, making sure the brands I'm choosing fit what they're financially capable of, and then presenting them those options and letting them sort of choose from there.\r\n\r\n\r\nnik (37:36.224)\r\nWhat's the last question on this? What's the typical length of the sales cycle? Is it three months? Is it six months?\r\n\r\n\r\nTim (37:43.626)\r\nOn average, I would say it's probably three months.\r\n\r\n\r\nnik (37:47.52)\r\nIs your goal like, hey, I want to get one close a month. They're like, where are you right now?\r\n\r\n\r\nTim (37:53.034)\r\nSo at the beginning of the year, I set my goal at one a month, which is about the pace that I've been on. I would say the end goal would be two a month because that's really once when your income can start taking off. But right now for this first year, one a month.\r\n\r\n\r\nnik (37:58.304)\r\nNice.\r\n\r\n\r\nnik (38:05.8)\r\nMm -hmm.\r\n\r\n\r\nnik (38:09.888)\r\nYeah, because even if you're, let's say you make, let's say you get 35 ,000 and you've spent 10 ,000. So you got $25 ,000 left over. Cool. That's, that's great per month, but you've also got the 5 % fee that you're paying to France serve, which takes off. What is that? 1750. So now you're down to like 23 ,000, let's just say. And then you're also giving a portion in your model. You're giving a portion of that back to the franchisee. Correct.\r\n\r\n\r\nTim (38:38.25)\r\nThat's correct, yeah.\r\n\r\n\r\nnik (38:39.04)\r\nWhat percentage are you giving back to the franchisee? Are you allowed to say? Okay, all right.\r\n\r\n\r\nTim (38:41.258)\r\nI don't disclose an exact percent. Let's say that the average, if somebody buys one territory, on average, it's gonna be around $3 ,000 that they're gonna get back from us. That scales up all the way to 10 ,000, but it's directly tied to sort of the commission structure on the backend.\r\n\r\n\r\nnik (39:00.736)\r\nCool. So essentially $20 ,000 is going to be your gross margin per lead. That doesn't include, not per lead, excuse me, per customer closed. That doesn't include all the time that you've spent with people who didn't end up closing. It doesn't include all the time and energy you've spent qualifying them, recommending them, all the administrative work and burden, et cetera. So, I mean, your net margins are probably closer to the 10 to $15 ,000.\r\n\r\n\r\nper close range, which sounds like a lot of money, but in the grand scheme of things, it's $100 ,000, $150 ,000 a year. That's why you're saying two a month is really where you get to the spot where you're making real, you know, consistent good money.\r\n\r\n\r\nTim (39:43.338)\r\nYeah, I mean, the other thing to factor in there, though, is, you know, most people are going to buy more than one territory. So, you know, if you sell a three pack, which is standard, what I'd say for most people is three pack, then you're looking at closer to a $50 ,000 commission. If you found that person via social media, it was free. Well, there are there is a huge sort of spectrum as far as like what it can look like.\r\n\r\n\r\nnik (40:05.184)\r\nYeah, true.\r\n\r\n\r\nnik (40:11.776)\r\nOkay, well this is fascinating on the business stuff. Thank you for being transparent and answering my questions. I have some rapid fire questions to wrap up. Are you good with that?\r\n\r\n\r\nTim (40:23.082)\r\nI'll try.\r\n\r\n\r\nnik (40:23.872)\r\nOkay, nine months in, what do you love about this business?\r\n\r\n\r\nTim (40:28.49)\r\nIt's meeting people who want to start their own thing. I just relate to that a lot.\r\n\r\n\r\nnik (40:34.784)\r\nWhat do you hate about it?\r\n\r\n\r\nTim (40:37.898)\r\nAll of the cold calling essentially where people just don't answer the phone. You know, the constant, you know, not knowing if the deal is going to close there several times where it's like, is this $50 ,000 deal going to close or not? And you might have two deals that don't close and two deals that do close. And suddenly it's a, you know, a hundred thousand dollar swing.\r\n\r\n\r\nnik (41:01.152)\r\ninsanity, man. For you, a lot of people are jealous. Like we're just grasses greener on the other side. Like you said, you go to the weddings and it's like, man, must be nice to be a partner at your firm. And as you say here in 2024, what businesses or what industries are you the most jealous of right now?\r\n\r\n\r\nTim (41:22.282)\r\nI'm the most jealous of. I'd say roofing. Roofing just seems to take off. Like there's several people on X, for instance, who've scaled 5 million plus businesses, it seems like, overnight. And from all the numbers I've seen in talking to people, roofing can be scaled very quickly.\r\n\r\n\r\nnik (41:35.872)\r\nYeah.\r\n\r\n\r\nnik (41:42.976)\r\nWow, okay. The first answer given of roofing. So that awesome. If you have two hours in your day, no kids, no work, you can do whatever you want. What are you obsessed with right now? Where does your mind drift to in the moments where you're not required to be thinking about anything?\r\n\r\n\r\nTim (41:47.754)\r\nHahaha.\r\n\r\n\r\nTim (42:05.258)\r\nI feel like I don't have those moments. But if I did, I'd probably just be thinking about golf, honestly.\r\n\r\n\r\nnik (42:07.616)\r\nHahaha!\r\n\r\n\r\nnik (42:14.016)\r\nGolf? Okay. Are you a golfer?\r\n\r\n\r\nTim (42:16.266)\r\nYeah, just some no, not really. But, you know, I could shoot like 94.\r\n\r\n\r\nnik (42:23.36)\r\nBetter than me. That's like my front nine score. All right. What advice would you give to yourself 10 years ago?\r\n\r\n\r\nTim (42:28.074)\r\nThere you go.\r\n\r\n\r\nTim (42:37.418)\r\n10 years ago, I would say go start something. I think people in their 20s, you have very little commitments, even if you're married, you can take those risks if you don't have kids. Once you have kids, everything changes. It becomes a lot more difficult. Like for me to jump off the cliff and do this with three daycare bills and a large mortgage, a lot more difficult than, you know, if I had done this in my 20s when I was living in a condo or paying rent. So take those risks.\r\n\r\n\r\nnik (43:06.4)\r\ngood advice. Well, Tim, this was a great conversation. Thank you for being open and candid with things. Where can people find you and follow you along? Where's the best place?\r\n\r\n\r\nTim (43:17.802)\r\nTwitter probably, Kickstartmyfrank, or you can email me, Tim at Kickstartmyfranchise .com.\r\n\r\n\r\nnik (43:24.0)\r\nAll right, Tim, this was great. Can't wait to check back in with you in a little while to see how the business is doing and we'll talk soon.\r\n\r\n\r\nTim (43:30.666)\r\nYeah, appreciate your time.\r\n\r\n\r\nnik (43:32.32)\r\nThanks, Ben.",
  "metadata": {
    "duration": "",
    "date": "2024-08-19",
    "platform_source": "Google Drive"
  }
}