{
  "episode_number": "207",
  "episode_title": "No Agencies Allowed: Creating Massive Home Service Growth without an Agency with Steve Hunsaker",
  "guest_name": "Steve Hunsaker",
  "business_name": "Valley Christmas",
  "transcript": "﻿Nikolas Hulewsky (00:00.764)\r\nAll right, Steve, Hunsaker, I can already tell we're gonna have a freaking amazing conversation. And the reason I know it's going to be amazing is because we're talking about the sexiest, unsexiest business, which are home services. And you already teed it up for me. It's like I have the YouTube clip already in my mind, which is if you have an agency that's not doing a million dollars a year, stop paying outside agencies to do marketing. You're a plumber, you're an electrician, you're an HVAC, you're a window washer, and you're doing less than a million.\r\n\r\n\r\nDon't pay people to do outside marketing, do it yourself.\r\n\r\n\r\nSteve Hunsaker (00:32.43)\r\nYeah, for sure. Yeah. So if you have a if what we believe and I will argue with anybody on this is if you have a home service or blue collar trade of any kind. So if you're a lower ticket one, it's probably like 500 K to 700 K a year if you're like a window cleaner or pressure washer. If you're like a construction guy, a pool construction, landscape construction, you're that number is probably like one and a half mil, whatever it is. But if you have a\r\n\r\n\r\nIf you have a blue collar home service or contracting trade that does less than one and a half million dollars a year, less than a million a year, you can't afford a good agency. So the only people you can afford to make the numbers make sense are ad agencies. And a lot of this conversation is in meta ads, but it's like you can't afford a good one. So the people you can afford are the thousand dollar a month retainer agencies that bid them cheap, stack them deep. they go and their churn is higher than\r\n\r\n\r\nMost of these guys will never tell you the truth, but most of these type of agencies that target lower revenue home service businesses probably have close to 20 to 30 % monthly churn. Therefore, that is the market telling them that their system is broken. And so I'm a firm believer that every home service business owner, whether they're an owner op or have like at least a small team, should be running at least meta ads internally themselves. Firmly.\r\n\r\n\r\nNikolas Hulewsky (01:39.162)\r\nmy gosh.\r\n\r\n\r\nNikolas Hulewsky (01:53.094)\r\nSo if I'm sitting at home or listening to this or watching YouTube, whatever, I'm probably thinking to myself, well, who the frick is Steve Hunsaker to tell me I shouldn't spend lots of money on my home services business that's doing less than a million dollars a year? Tell us your background, man.\r\n\r\n\r\nSteve Hunsaker (02:08.814)\r\nYeah, well, I've owned three in the last five years. So I just turned 30. I started my first one when I was 25, 24, 25. So in 2020, I own I currently own a temporary Christmas light business that in that two months every year. Last year, we did eight hundred thousand dollars over a two month period. So it's like fifty six install days or something like that. Middle of October to like early December. And then I owned a junk removal business in the past that I\r\n\r\n\r\nNikolas Hulewsky (02:11.056)\r\nK?\r\n\r\n\r\nSteve Hunsaker (02:36.49)\r\nstarted after the Christmas light business to just keep the main core Christmas staff employed year round. know, know that went up like it was like basically like side hustle stuff just to keep you guys busy. Got that one to like low six figures. It was not impressive. And then I now have we've since gotten rid of the junk removal business and now I have a permanent lighting business that my crews basically operate themselves year round. That's like the permanent mobile app color changing lights on like the people's house that's getting really popular.\r\n\r\n\r\nNikolas Hulewsky (02:39.772)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (03:05.468)\r\nYeah, yeah, yeah, yeah. Bro, when you- Go ahead.\r\n\r\n\r\nSteve Hunsaker (03:06.678)\r\nYeah, which funny enough, completely different market from the temporary business. Our temporary business is like super white glove pro athletes, celebrities, like 10 million dollar houses, five million dollar houses, three million dollar houses. The permanent Christmas lights is much more like middle upper class family, like family people things. It's very interesting.\r\n\r\n\r\nNikolas Hulewsky (03:13.03)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (03:27.066)\r\nWell, yeah, I mean, let's be honest, they look junky. Okay? I'm sorry. I'm not putting lights on my house. I know I'm attacking your business right here, but like, you know, come on, who's doing that? The light show?\r\n\r\n\r\nSteve Hunsaker (03:34.796)\r\nNo, I don't know. Well, yeah, well, ours you can't see during the day. So like they don't look junky because they they're hidden. It's like matched like it's in a track that's like matched.\r\n\r\n\r\nNikolas Hulewsky (03:46.832)\r\nI, I agree. I agree. The problem is that you see them at night. That's the problem.\r\n\r\n\r\nSteve Hunsaker (03:52.398)\r\nWell, yeah, well, it's crazy. What's crazy is like you've probably got annoying neighbors. A lot of our customers put it on security lighting mode where it's like every seven bulbs is dimly lit warm white and it looks like down lighting on the house. It doesn't look like Christmas. So I agree with you. If my neighbor had like rainbow lights in June, I'd be like, dude, what the hell are you doing? But there's a market for it. Who am I to tell these people not to do it with their life?\r\n\r\n\r\nNikolas Hulewsky (04:15.42)\r\nWhat do we do? No, I'm just kidding. Dude, there's totally a market for him and Chris, my best friend and business partner on a couple things. He's like, he loves that. I think he's doing it at his house this year because he's like, dude, it totally makes sense. It looks good. It's cheap. And you can actually program it and change things. Whatever. Here's what I really want to talk to you. When you say the words $800,000 and two months, 56 day install days, I think everybody listening like perks up a little bit. They're like, come again. What?\r\n\r\n\r\nSteve Hunsaker (04:38.316)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (04:44.924)\r\nWhat was that?\r\n\r\n\r\nSteve Hunsaker (04:44.992)\r\nYeah. Yeah. Our model's insane. It's it's I just got lucky. Like they're just I got into it. I got into a market and I picked a niche where there wasn't a lot of like high quality competition four and a half years ago. And I just got lucky. Like I don't think that if I started a roofing company five years ago, it would be nearly as successful because I got to learn without like dog competition. But now like now it's seemingly doing OK. So.\r\n\r\n\r\nNikolas Hulewsky (05:06.992)\r\nStill.\r\n\r\n\r\nSteve Hunsaker (05:11.118)\r\nYeah, I'll break down the model. So basically what we do, what we do is I'm in Scottsdale, Arizona. So a little bit of money, but like every market has their version of Scottsdale. Every major metro market has their version of Scottsdale. Right. So a little bit upper class. A lot of a lot of second home people, everything else. So what we do is in 2020, I went on sweaty startup on Reddit and I was a sales bro at a tech company and I was forced to go over the phones and I was calling CFOs to, you know, sell them.\r\n\r\n\r\nNikolas Hulewsky (05:11.708)\r\nPlease.\r\n\r\n\r\nSteve Hunsaker (05:40.91)\r\nlike HCM services and like the mid market enterprise level. And they're like, I just laid off a thousand people, dude. Read the room. And I'm like, all right, all right. I can't, I'm not going to do this. You know, we were all staying home. So I went on sweaty startup. I looked at like cool ways to make money. And then one like tiny little subreddit was holiday lighting. And so I then went into a Christmas light group and I saw a lot of dudes in there that were like saying they're doing, you know, a hundred grand a season, 50 grand a season. I found this one dude in the East coast who said he didn't even graduate high school.\r\n\r\n\r\nNikolas Hulewsky (05:45.009)\r\nlove it.\r\n\r\n\r\nSteve Hunsaker (06:09.926)\r\nAnd he was doing like three or four hundred K a year or something like that. And I was like, damn. So I found this dude, got the sauce from him. And I realized that like what in my market what was happening is there was a lot of guys hanging Christmas lights, but it was a lot of like handyman, high school kid, landscaper that does it on the side, window cleaner that does it on the side. And there wasn't just like the white glove high end what these people in three, five, ten million dollar homes.\r\n\r\n\r\nNikolas Hulewsky (06:14.524)\r\nCheers.\r\n\r\n\r\nSteve Hunsaker (06:38.926)\r\nare used to being served like in their other transactions. There wasn't that business that was like branded well, whatever white glove for temporary Christmas light displays. So I started that in 2020 and I sold a chiropractor at my gym, like a 1200, $1,300 install and was like, oh, okay, proof of concept, you know, whatever. So I started running some Google ads, whatever else.\r\n\r\n\r\nNikolas Hulewsky (06:40.828)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (06:44.657)\r\nYeah.\r\n\r\n\r\nSteve Hunsaker (07:01.65)\r\nAnd I like to tell this part because I think every entrepreneur has like this moment. I was like 24, 25, whatever, never owned a business in my life. And I got in touch with this guy who had just sold his, he had just owned a bunch of rehab centers and had exited for like 100 mil. And so I roll up to this quote and keep in mind, frame it. Never like ran a business myself ever. Let's frame it properly.\r\n\r\n\r\nNikolas Hulewsky (07:25.498)\r\nOkay.\r\n\r\n\r\nSteve Hunsaker (07:27.106)\r\nSo I roll up this dude's house and he's got a Lambo up front and I'm like, I don't even know how to sell this stuff, you know, like whatever else. And I give him this quote on the roof line and from that Facebook group, I'd had the sauce, you know, I buy the product for about two dollars a foot. I sell it for eight at that time. Now we sell it for a lot more, but sell it for eight. Pretty good. Four X on your cost of goods, whatever else. Pretty solid. If I'm doing the labor myself, that's a pretty good hustle. So I quote this guy, I quote this guy and his roof line was like, you know,\r\n\r\n\r\nNikolas Hulewsky (07:47.6)\r\nYeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (07:51.708)\r\nYeah, it's freaking great, Martin.\r\n\r\n\r\nSteve Hunsaker (07:56.718)\r\nfourteen hundred bucks. And he was like, cool, man, sounds good. And I was like, OK, and there's just like some silence. And then he was like. What else could we do? And I was like. What else? Like, we're already at fifteen hundred bucks. What do you mean? I didn't know that there was this like I was still that in that stage where as a business owner, you're like selling out of your own pocket, you're like fifteen hundred bucks. I would never pay that. And then he's like, what else we do? And so I'm just like.\r\n\r\n\r\nNikolas Hulewsky (08:09.798)\r\nHahaha!\r\n\r\n\r\nNikolas Hulewsky (08:18.204)\r\nMm-hmm. Yeah, yeah,\r\n\r\n\r\nSteve Hunsaker (08:22.638)\r\nYeah, you know, and so I'm like looking around his yard and I was like, oh, well, this tree and he's like, how much would that cost to wrap? And I was like, oh, oh, well, and I started doing the math. OK, if I buy this strand for ten dollars a strand and I hang it for forty five, I sell it to him for forty five. It's like a three and a half or four and a half X. OK. And so I was like, that tree would be four fifty. And he's like, OK, cool. What else? And then I was like, well, we could do a wreath here. And I like never hung a wreath.\r\n\r\n\r\nNikolas Hulewsky (08:44.556)\r\nmy gosh.\r\n\r\n\r\nSteve Hunsaker (08:47.084)\r\npricing on reads, you know, whatever. And by the end of it, we were at like a three thousand three. It was like a three thousand three hundred dollar ticket, whatever else. And I remember like I remember, so I was in person with him, walked through it. And then when I got back to my when I got back to my desk and I was on the phone with him, that was when we were, you know, he was what else can we do? What else can we do? And I the picture of his house in front me. I just kept it. We got to thirty three hundred. And I remember he was like, cool, you want my MX? And I was like. Yeah, yeah, I do. I do. Yeah.\r\n\r\n\r\nNikolas Hulewsky (08:54.15)\r\nHmm.\r\n\r\n\r\nSteve Hunsaker (09:15.714)\r\nYeah. Okay. Let's let's let's take that AMEX. Actually, I thank God I did. But it's shocking. So I remember I so he gave me 50 % down. And I remember I hung up the phone, processed the credit card and I just stood up from my desk and I walked over to my roommate's room. I was living with five dudes at the time. And I walked over to my roommate's room and I was like, this guy just gave me 3000 something dollars to hang Christmas lights. And he was like pumped about it.\r\n\r\n\r\nNikolas Hulewsky (09:17.584)\r\ndon't have a way to process that, but yes.\r\n\r\n\r\nSteve Hunsaker (09:45.89)\r\nAnd my roommate was like, was a financial advisor, he was training for the CFP or whatever. He was like, what the f... You know, just like we both were like, that can't be real. And so then I just cranked it from there. That first year we did like just it was like 98K, something like that, like right at 100K. Let's round up and call it 100K. Yeah. And I did everything myself, did the sales myself, hired like a few under the table friends to just like help me do a few installs. And then year two, I offloaded the Ops.\r\n\r\n\r\nNikolas Hulewsky (09:52.272)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (10:04.219)\r\nOkay.\r\n\r\n\r\nSteve Hunsaker (10:15.81)\r\nAnd we ran up to like 250 K in year two. then I just did sales and then I had guys installing year three. We ran up to like 350 K terrible year that like almost went bankrupt. Long story. I won't I won't. I'll bore the people with the sob story. So I hired a bad operator.\r\n\r\n\r\nNikolas Hulewsky (10:35.248)\r\nWait, hold on, let's get to the bankruptcy. Let's get to the bankruptcy. Before that, I want to back up. So very similar at Anne McGinty on this podcast. She did a Christmas lighting business. Her first year doing it was right around $100,000. And she was like, shoot, this is a real thing. And I only did this in three months and it's awesome. She though went and took a course. She got certified. She like paid to understand how to do it. You reached out to a guy on a subreddit.\r\n\r\n\r\nSteve Hunsaker (10:52.462)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (11:03.856)\r\nwho was successful, I guess, on the East Coast. Did you pay him? Was it like, hey, dude, I'll, no.\r\n\r\n\r\nSteve Hunsaker (11:07.16)\r\nNo, free, completely free. Just phone calls. Just phone calls. Completely free. Yeah, a lot of these guys and I will always commend them for that. There's a lot of guys in the home service space who just like they hit that certain number. They're not on money Twitter. They're not on social media. They just like they hit a certain number and they're happy with it. They don't want to make a scale there, you know, whatever else. And then like when young dudes call them and they just like are hungry and they're not in their market, they were they like giving back.\r\n\r\n\r\nNikolas Hulewsky (11:10.853)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (11:33.808)\r\nThey like giving back.\r\n\r\n\r\nSteve Hunsaker (11:36.224)\r\nYeah, and that was kind of that that moment and it was insane.\r\n\r\n\r\nNikolas Hulewsky (11:37.99)\r\nDid you did you get certified at all? Were you like how did you learn how to install these like? Because if for anybody listening, it's not just I'm getting on a ladder and I'm hooking onto someone's gutter. Well, I guess I don't know your exact business, but my assumption is you actually go on and you install these plates effectively so that every year you can kind of come back and reinstall those lights. I don't know if that was what you were doing, but. Did you like how did you learn how to do that stuff? No, not even.\r\n\r\n\r\nSteve Hunsaker (11:42.67)\r\nyou\r\n\r\n\r\nSteve Hunsaker (12:02.978)\r\nNot even.\r\n\r\n\r\nYeah, no. So no, no plates, none of that. That's just the permanent lighting. The temporary is just like clips and stuff like that. Very simple. But we're out there like so what we do is we buy bulk socket wire, like commercial grade socket wire, bulk bulbs, whatever else. we wire cutters like cut these lights, slap a male plug on one side, female plug on the other, create our own extension cords on that jazz. And we fit the roof line lights to the roof. So if you go to Home Depot and buy lights, it's like\r\n\r\n\r\nNikolas Hulewsky (12:13.285)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (12:20.326)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (12:33.04)\r\nMmm.\r\n\r\n\r\nSteve Hunsaker (12:34.454)\r\nwhen you, you know, maybe you bought a 50 foot strand, you only use 45, you got five feet hanging on the side, it looks like crap, you tuck it in the gutter, you can still see it. Ours are like, cut to fit their roof. So the bulbs right in the peak of like the dormer or whatever else, it looks really nice. So that's our model. Yeah. But no, I...\r\n\r\n\r\nNikolas Hulewsky (12:35.984)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (12:45.948)\r\nNikolas Hulewsky (12:50.278)\r\nBut you can do it, you can do it where you like run some type of metal frame along the house so that every year you come back and you just easily clip it in,\r\n\r\n\r\nSteve Hunsaker (12:59.628)\r\nYeah, in Arizona, we don't have gutters and like any houses. so like track systems don't play as well here. But honestly, most of the temporary light companies are just clipping. Like almost everybody's just clipping. Yeah.\r\n\r\n\r\nNikolas Hulewsky (13:02.746)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (13:10.628)\r\nOkay, Arizona's just like, it doesn't rain here, so we're not gonna have gutters. Sure, yeah, makes sense. So what do you do with the lights? You just store them?\r\n\r\n\r\nSteve Hunsaker (13:15.756)\r\nYeah. Yeah. So like drainage is a nightmare. Yeah. Drainage is a nightmare when it does rain. But yeah, very rare. Yeah. So I stored them in the spare bedroom in my house for year one. And then we got storage units in year. We had storage unit in year two and then storage units in year three and then bigger storage units in year four or beginning of year four. And then last year and before the season started, we moved to a warehouse in Scottsdale, like by the airport.\r\n\r\n\r\nNikolas Hulewsky (13:28.01)\r\nmy gosh.\r\n\r\n\r\nNikolas Hulewsky (13:41.916)\r\nSo you probably have data on this. What percentage of people do it one year and then never have you back?\r\n\r\n\r\nSteve Hunsaker (13:49.326)\r\nSo we retain our retention is kind of interesting because this is where Arizona becomes very different. When you when you sell the high end in Arizona. These people are not all Arizona residents. It's a lot of it's a lot of Chicago snowbirds. It's a lot of Canadian snowbirds, a lot of whatever else. And so we retain like in terms of in terms of like actual people that liked us are in Arizona the next year didn't move, whatever else like high 60 percent. But.\r\n\r\n\r\nNikolas Hulewsky (13:54.972)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (14:01.804)\r\nyeah.\r\n\r\n\r\nNikolas Hulewsky (14:18.363)\r\nHmm.\r\n\r\n\r\nSteve Hunsaker (14:18.85)\r\nWe lose about 20 % every year just off of, Steve, we're not gonna be in town this year. Like we're actually Christmasing in Maui. We're actually Christmasing in the Bahamas. yeah. We're actually Christmasing in our, like one of my customers who, this one hurt, one of our residential installs is like 15 grand and they love us, like think we walk on water. And then last year they're like, Steve, we're going to our Bozeman estate this Christmas, so we'll be back in two years. And I was like,\r\n\r\n\r\nNikolas Hulewsky (14:24.273)\r\nWow.\r\n\r\n\r\nWe're Christmasing. They say Christmasing? that that? that? We're Christmasing? Oh my god.\r\n\r\n\r\nNikolas Hulewsky (14:47.608)\r\nmy gosh. 15 grand. Do people say we're Kwanzaa-ing in South America this year? We are Hanukkah-ing. We're Hanukkah-ing this year in upstate New York. That's so funny. Christmas-ing.\r\n\r\n\r\nSteve Hunsaker (14:48.588)\r\nYou know, so that happens.\r\n\r\n\r\nSteve Hunsaker (14:54.611)\r\nYou know, I haven't heard.\r\n\r\n\r\nSteve Hunsaker (14:59.798)\r\nNo, no, just nothing like that yet. Yeah. Yeah. It's a very interesting.\r\n\r\n\r\nNikolas Hulewsky (15:04.476)\r\nWhat do you do with the lights that you custom fit? You just throw them away or do you try to reuse them?\r\n\r\n\r\nSteve Hunsaker (15:10.636)\r\nYeah. So the bulk of the cost is in the bulb. The socket wire is pretty cheap. So the socket wire is like I can get I can get, you know, a thousand feet of socket wire for two hundred thirty bucks. So it's like. Yeah. Or just like if we're busy, just a new customer, just rip out a new roll. But the bulk of the cost is the bulbs. And so the bulbs are about 80 cents to a dollar 10 a bulb, depending on who you're buying from.\r\n\r\n\r\nNikolas Hulewsky (15:15.783)\r\nokay.\r\n\r\n\r\nNikolas Hulewsky (15:21.34)\r\nso you can refit it.\r\n\r\n\r\nNikolas Hulewsky (15:36.924)\r\ndang. Okay.\r\n\r\n\r\nSteve Hunsaker (15:37.526)\r\nYeah. And so if you're doing, you know, a 300 foot house, that's not nothing. And so if somebody does not come back, we just recycle the bulb somewhere else.\r\n\r\n\r\nNikolas Hulewsky (15:45.084)\r\nWhat kind of margins do you have on that business?\r\n\r\n\r\nSteve Hunsaker (15:48.054)\r\nLast year, we ended at about a little over 30 percent. But. But. The growth is expensive. So like what I mean is we're still installing product I bought in year one because it's a commercial grade product that's only being used for two months a year and then being stored in a climate controlled spot. Yeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (16:09.904)\r\nWhat? Did you go hog wild? Like, why did you buy so much product in year one?\r\n\r\n\r\nSteve Hunsaker (16:14.606)\r\nUh, no, I mean, like when people leave, we'll recycle it and it's still, it's still active. And so what I, and so what I mean is like the growth is expensive. So in year four, we did 500 K and year five, we did 800. And so that $300,000 of growth is a lot of product. It's about.\r\n\r\n\r\nNikolas Hulewsky (16:17.858)\r\nOkay. got it. Got it. Got it. Okay.\r\n\r\n\r\nNikolas Hulewsky (16:32.635)\r\nOh, I see what you're saying. So is 30 %? Here we go.\r\n\r\n\r\nSteve Hunsaker (16:34.626)\r\nSo if I ever decided, like if I ever decided that we didn't want to grow, we could very easily operate at about 45%, 50%.\r\n\r\n\r\nNikolas Hulewsky (16:45.242)\r\nThat's insane, man. Jeez.\r\n\r\n\r\nSteve Hunsaker (16:47.246)\r\nBut I like growth. I'm a big fan now, like, entrepreneurially. Like, I'm a very big fan of feeding managers and feeding leadership positions. Like, I want it as big as humanly possible so that, one, I don't have to do everything. And two, the people that stick with me and that I hire as manager or installers and they become shift leads and they become managers and they become director of operations, all that jazz. Like, my guys are comped very well.\r\n\r\n\r\nNikolas Hulewsky (17:11.622)\r\nYeah.\r\n\r\n\r\nSteve Hunsaker (17:15.222)\r\nAnd so like, I'm going to keep growing it so I can keep comping people very well and keep firing myself from every position. So.\r\n\r\n\r\nNikolas Hulewsky (17:22.662)\r\nSo how did you grow? I mean, that's really interesting to me because are you out knocking doors? Are you sending flyers out? What are you doing to grow?\r\n\r\n\r\nSteve Hunsaker (17:32.118)\r\nNever knock the door in my life. Ever.\r\n\r\n\r\nNikolas Hulewsky (17:34.66)\r\nOkay, that's surprising, but okay.\r\n\r\n\r\nSteve Hunsaker (17:37.174)\r\nWell, I mean, I knocked doors in sales like when I was in my first sales job as an entrepreneur. As an entrepreneur, I have never knocked a door. So this is where like the this is where like what am I, Gen Z or millennial? This is where like that comes out where like like when I was knocking doors as a sales bro, it was like the bait of my existence. Like I used to go I used to sell freight services for my first job and I would go park at warehouse like big warehouse freight park areas and door knock eight hours a day, five days a week.\r\n\r\n\r\nNikolas Hulewsky (17:40.974)\r\nyeah, yeah, yeah, okay.\r\n\r\n\r\nOkay?\r\n\r\n\r\nNikolas Hulewsky (17:50.876)\r\nYou\r\n\r\n\r\nSteve Hunsaker (18:07.32)\r\nSo once I started this, I was like, I need to find a way to get customers to come to me. I hated being told to f off 100 times a day. So what we do and how we've grown the entire time is largely like to get it off the ground. was a lot of Google ads that has changed. So Google ads from year one to three were like Google pay per click. We're like it like that was like I would just max that thing out. Give me every click. I know I have the sales process. Good.\r\n\r\n\r\nNikolas Hulewsky (18:11.59)\r\nYeah. Yeah, yeah,\r\n\r\n\r\nNikolas Hulewsky (18:33.296)\r\nMm-hmm.\r\n\r\n\r\nSteve Hunsaker (18:37.376)\r\nIn 2021 or 2022 season, so year three, there was eight people competing with me for Google Pay Per Click ads. This year, this last year, there was 30 something. So Google, like every other home service and blue collar contracting trade, Google Pay Per Click has gotten twice, if not three times expensive for the trades. And so what I cracked in year four was Facebook ads and I don't use agencies.\r\n\r\n\r\nNikolas Hulewsky (18:50.347)\r\ndang.\r\n\r\n\r\nSteve Hunsaker (19:04.758)\r\nSo we use Facebook, Instagram ads and we scale the ever living schnoz out of that. But the key, the key with Facebook ads is like a lot of people say Facebook ads don't work. So if you want to get like, if you want to get tactical here, there's I firmly believe that there's two types of home service business owners. There's home service business owners who say Facebook ads don't work. And then there's home service business owners who have tested four or five video creatives before they find the one that works. That's the only two.\r\n\r\n\r\nNikolas Hulewsky (19:31.228)\r\nDoes it do it too?\r\n\r\n\r\nSteve Hunsaker (19:34.37)\r\nbecause Facebook has 190 million active American users every month. Instagram has like 169 million, something like that. That was like 2024 data. And so if you think about that, the arrogance to say that a platform that has half of the US population active on it weekly does not work. Meanwhile, Facebook is like, I think they're a trillion dollar company now, depending on the stock price when we're talking like market cap.\r\n\r\n\r\nNikolas Hulewsky (20:00.41)\r\nHmm\r\n\r\n\r\nSteve Hunsaker (20:02.562)\r\nYou're going to say a trillion dollar company just doesn't work across the board when there's guys like me and thousands of other home service business owners that are making it work. And so usually that's a self-limiting belief.\r\n\r\n\r\nNikolas Hulewsky (20:10.662)\r\nSo.\r\n\r\n\r\nOkay, so here's my question. It works. If it's that difficult to make work, right? Because like you said, there's either the ones who said it doesn't work or the ones who tested four five ad creatives before they actually go with one. Many home services companies under a million dollars, they don't have the time to sit and iterate, test, figure out what exactly works and what doesn't work. Your contention is if you're doing under a million, under a million and half, depending on the business,\r\n\r\n\r\nSteve Hunsaker (20:33.614)\r\nYou\r\n\r\n\r\nNikolas Hulewsky (20:41.69)\r\nYou can't afford an agency, so you gotta learn it yourself. How do you balance the two? It seems like those are conflicting ideas.\r\n\r\n\r\nSteve Hunsaker (20:47.574)\r\nOkay, so let's start with the economics behind paying an agency when you're small, right? Let's start there. So let's do, let's say agency comes to you and says, yeah, our retainer's 900 bucks a month, a thousand bucks a month, okay? And so let's say you're doing a hundred thousand, you want to hit a hundred thousand dollars. And.\r\n\r\n\r\nNikolas Hulewsky (21:05.404)\r\nand articulate what an agency does for anybody listening.\r\n\r\n\r\nSteve Hunsaker (21:08.31)\r\nYeah. like if you're if you're an ad, if an ad agency is essentially like if we're talking about Facebook, an ad agency will say they'll come to you and say, we're really experts at running Facebook ads. And we can if you if you sign up with us and pay us our thousand dollar monthly retainer, we have the secret sauce that can help you generate leads on Facebook. And that what and that was the case five years ago.\r\n\r\n\r\nNikolas Hulewsky (21:24.272)\r\nBecause it-\r\n\r\n\r\nAnd they kind of do three things. You're going to tell me I'm wrong, but I'm, I'm just summarizing here. They kind of do three things. They can write the ad copy. They do. Yes. They do the creative, which is the visual component of it. And then they understand how to do all the knobs, bells, and whistles on the backend of meta to get it to focus on the right people. And then they ate supposedly, hopefully they're AB testing, which ones work, but like those are the three functions. Is that fair? Okay.\r\n\r\n\r\nSteve Hunsaker (21:28.942)\r\nday.\r\n\r\n\r\nSteve Hunsaker (21:53.134)\r\nAll right. Yeah. Yeah. Let's go through the three functions. This is great. So those three functions you listed writing ad copy, I could screen share with you right now and have chat GPT write me. I like highly converting ad copy in five minutes. So AI has displaced that. Now let's go to let's go to creative. Right. We did a 10.87 X ROAS on ten thousand eight hundred dollars last year.\r\n\r\n\r\nNikolas Hulewsky (22:06.886)\r\nK. K.\r\n\r\n\r\nSteve Hunsaker (22:22.816)\r\nand Facebook ad spend with no agency spend with videos filmed with an iPhone and an Amazon lapel mic with that was that's like forty five dollars. And then if you want to make it look really nice because for anybody listening where it's like but like maybe my videos look like trash and iPhone in twenty twenty five has a better camera than what Hollywood studios were using in the early 2000s. So get that out of your head. So it's not like the agency is doing something crazy but the other\r\n\r\n\r\nNikolas Hulewsky (22:44.891)\r\nYeah.\r\n\r\n\r\nSteve Hunsaker (22:50.154)\r\nWhen we talk about creative, the creative that sells on Facebook now and the thing that stops the scroll is what we talk about is they want to see the owner. so like still image works still, but not as well. The ads that work for us is me getting on the screen, like me on camera. And we do five things in every single ad or most ads we like when someone's brand new, we tell them do these five things. It's call out the location that the ads are showing the first words out of your mouth.\r\n\r\n\r\nSo if you're running a Facebook ad in Scottsdale, Arizona, the first words out of your mouth are, what's up, Scottsdale, Arizona? Because boom, if I live in Scottsdale and I see an ad that says, what's up, my neighborhood, oh, interesting. Whereas if you heard someone say, what's up, Philadelphia? You'd be like, what? Scroll, let me see another dog video. So call out the location you're targeting, first words out of your mouth, who you are, what you do, why you're different, expiring value proposition at the end in the form of a discount. That's it, right? So like,\r\n\r\n\r\nNikolas Hulewsky (23:27.825)\r\nhe knows me.\r\n\r\n\r\nYeah, yeah, yeah, yeah, yeah.\r\n\r\n\r\nSteve Hunsaker (23:46.636)\r\nNick, you started a roofing company, right? What's up Paradise Valley, Arizona? My name's Nick. I own Nick's Roofing. Boom. Insert value proposition. We're the number one highly rated. It doesn't even have to be good. It's like we're the top reviewed roofing here on Google. Here's a screenshot of our Google business page. All of these are verified reviews with photos. We hire 100 % background checked employees. Blah, blah, blah. Insert background proposition, you know, whatever else. So now you're already in 30 seconds.\r\n\r\n\r\nNikolas Hulewsky (24:10.203)\r\nYeah, yeah, yeah.\r\n\r\n\r\nSteve Hunsaker (24:15.242)\r\nintroduce, call out the location, who you are, what you do, why you're different. And then for the next, for the, until the end of this month, the next 10 people that reach out to us will get a primary discount of so and so and so and so, boom, click get quote now to get started. Boom, run it. And so then what you do is you just follow that framework and you film three or four like that. And then let's go to facet three, which is setup. Mark Zuckerberg has said himself that the\r\n\r\n\r\nWith the Russia stuff and everything else that happened in 2020, the Apple iOS changes where you couldn't target. for example, like, do you watch Alex Ormosy? OK, so like when they have Jim launch, they talk about like the entire their entire business that they built to like, you know, one hundred million dollars or whatever was largely like ad arbitrage. And back then you could target in 2020 when the agencies were having their heyday, you could target people by like in 2020 we were targeting conservative Christian\r\n\r\n\r\nNikolas Hulewsky (24:46.588)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (24:51.708)\r\nI've seen this stuff,\r\n\r\n\r\nNikolas Hulewsky (24:59.344)\r\nRight, right.\r\n\r\n\r\nSteve Hunsaker (25:12.302)\r\nright-leaning entrepreneurs with our ads. You can't do that anymore, right?\r\n\r\n\r\nNikolas Hulewsky (25:17.084)\r\nWell, yeah, the difference is Apple was allowing people to track across applications and then they were selling that data to ad companies, specifically Meta. mean, Meta would just freaking game the crap out of it. And then they made the switch where they give people the option of whether or not they can track. And it kind of screwed Meta for a minute until they figured out how to get back in the game.\r\n\r\n\r\nSteve Hunsaker (25:22.563)\r\nCorrect.\r\n\r\n\r\nSteve Hunsaker (25:36.504)\r\nCorrect. And so now what they do is it's all algorithmic. So targeting is dead. So when I talk about how we did, we sold a hundred something thousand dollars of jobs from Facebook alone last year, running my ads myself, my targeting is Scottsdale. Open targeting. That's it. It's just Scottsdale. There's no interest targeting. There's no demographic targeting. There's no income targeting. It's just boom, run it.\r\n\r\n\r\nNikolas Hulewsky (25:56.377)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (26:00.858)\r\nReally?\r\n\r\n\r\nSteve Hunsaker (26:04.15)\r\nAnd then because now Facebook's and Meta's algorithm, so this is Facebook and Instagram, their algorithm finds the people for you based on who interacts with your creative. And so when we talk about the creative, why we do it in that structure is the only people that will be interacting with our creative at scale are people that are interested customers. Right. And so then we run lead forms. So we make people, we give a little bit of friction. So it's first name, last name, city you live in, you know,\r\n\r\n\r\nNikolas Hulewsky (26:11.9)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (26:23.45)\r\nInteresting.\r\n\r\n\r\nSteve Hunsaker (26:32.32)\r\na few questions so that when that Facebook pixel, that algorithm does fire, it learns who to show the ads to. And then after a day or two, it's showing it to your primary demo.\r\n\r\n\r\nNikolas Hulewsky (26:43.708)\r\nSo, okay, so there's the three things. So creative is effectively either the visual, the video, whatever it is that's selling to them. Ad copy could be a part of that or it's not a part of it.\r\n\r\n\r\nSteve Hunsaker (26:59.65)\r\ncould be. Yeah. Ad copy is yeah, for sure.\r\n\r\n\r\nNikolas Hulewsky (27:00.412)\r\nIt could be, okay. What's crazy to me is like, you can go and look at every ad that's being run by certain companies on Meta right now. You're like, that's my, yeah, that's my competitor. I'm gonna go steal their stuff and it's just, go copy it. It's crazy to me.\r\n\r\n\r\nSteve Hunsaker (27:09.262)\r\nYou can look at every single one of mine.\r\n\r\n\r\nSteve Hunsaker (27:16.406)\r\nIt's part of it's part of Facebook's terms of service. If you want to play, you got to play by that rule. And so what's really funny is since I started Home Service Accelerator and I have like a shred of a personal brand like a lot of Christmas like companies and permanent Christmas like companies follow me and I will see my ads repurposed all over the country all the time, like all the time. Well, it's honestly not even irritating because like I just if they were in my even guys in my market do it, but like\r\n\r\n\r\nNikolas Hulewsky (27:34.363)\r\nReally?\r\n\r\n\r\nIt's both flattering and irritating.\r\n\r\n\r\nSteve Hunsaker (27:46.21)\r\nI just know that their back end systems aren't going to be as good as ours. So you can copy me all day long, but my closers will be better. My process will be better. My cost per booked appointment will be better. My cost per given quote will be better. All of that will be better. So you can copy me all day long, but that's it.\r\n\r\n\r\nNikolas Hulewsky (27:46.492)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (27:58.588)\r\nOkay. All right. So backing up though, we're talking about agencies that home services companies can use when they're under a million dollars. They're outsourcing all of that, right? They're outsourcing the ad copy, the creative, and then the setup on the backend. Now you just explained all of that and I'm sitting here like, crap, I could never get up to speed. Right. But you are very passionate that people who are that size of a company or smaller should do it themselves. like, how, do you balance it?\r\n\r\n\r\nSteve Hunsaker (28:29.378)\r\nWell, I have, I could say it all day long and just, you could listen to me or I have 320 people that have joined home service accelerator, which is the program where we do this and show people how to do it. We're like, people call me like the grim reaper of ad agencies. Like it started with my own team doing it. Like, and then now it's like, that's like my thing on Twitter. and so what's funny is the only agencies that get upset at that are bad agencies. Big agencies agree with me. Like,\r\n\r\n\r\nNikolas Hulewsky (28:41.978)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (28:56.464)\r\nMm.\r\n\r\n\r\nSteve Hunsaker (28:58.848)\r\nEvery good agency agrees because the good agencies don't target small home service businesses because they know this. And so, yes, to answer your question, to...\r\n\r\n\r\nNikolas Hulewsky (28:59.131)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (29:06.512)\r\nWhat is it about the small companies, the small home services companies, when you say they can't afford it?\r\n\r\n\r\nSteve Hunsaker (29:12.878)\r\nIt's the economics. It's the economics behind it. Right. And so if you're going to meet these small businesses where they need to be price wise, you don't have enough infrastructure as an agency to service them the way that it would make sense. So if you go through the economics, right, if you want to spend like if you're a small business, you want to spend 50 bucks a day on ads. Like if say, let's say peak season, like Christmas season, you're a small business, you want to hit 100 grand. You're like, OK, I can spend 50 bucks a day on ads. This agency is coming in and being like.\r\n\r\n\r\nNikolas Hulewsky (29:34.492)\r\nMm-hmm.\r\n\r\n\r\nSteve Hunsaker (29:40.342)\r\nYeah, our retainers, a thousand bucks, our retainers, fifteen hundred bucks. So if it's let's just call it easy math. Let's see. Let's say it's a cheap agency. So if it's thousand dollar a month agency and you're there now, you're now paying them thirty three dollars and thirty three cents a day to run your ads. No money is given to Facebook yet. So just to turn your ads on, you're giving them thirty three dollars and then you're actually putting in.\r\n\r\n\r\nNikolas Hulewsky (29:59.994)\r\nRight. Right.\r\n\r\n\r\nSteve Hunsaker (30:06.446)\r\n$50 a day in the ad algorithm. So you're spending $83 a day on your Facebook ads, but only 50 of it's going into meta buying eyeballs and the other 33 is going to management. Whereas what we do is we say like, hey, my husky who's sitting in the other room could beat the agencies if they were spending $50 a day and he was spending $83 a day with AI and a few little crappy creatives because by law of big numbers, like I'm spending way more than you over the course of a month.\r\n\r\n\r\nNikolas Hulewsky (30:28.955)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (30:34.684)\r\nAre those agencies doing what you said earlier? Because there are kind of two phases of it, Like generating the lead, they fill out the form, they see the ad copy, whatever. But then there's, you got to get them on the phone, you got to get them booked, you got to close them on the sale. So are agencies... Okay.\r\n\r\n\r\nSteve Hunsaker (30:48.99)\r\nNone of the, no, none of the agencies at this size will be setting appointments for you. And if they are, they're gonna try to upsell you and then it becomes even worse because then you have an\r\n\r\n\r\nNikolas Hulewsky (30:54.918)\r\nSo is that?\r\n\r\n\r\nNikolas Hulewsky (30:59.524)\r\nIs that part of the problem though? Is that part of the problem where it's like, yeah, okay, even if you are gonna spend and you have the money, quote unquote, where it makes sense for you to spend on a larger agency, you don't have the backend infrastructure necessarily figured out to even capitalize on the leads that are being generated.\r\n\r\n\r\nSteve Hunsaker (31:14.808)\r\nFor sure. And so this is what we say a lot. Like I tell people like my system, like I'm like with my speed to lead, like the systems that I have set up, like when a Facebook lead comes in, like they're getting a call from us in under 60 seconds. And you're like, that's like, no, a hundred percent. So I have a system where the second that client clicks submit on a Facebook ad, my sales guys phone rings and says, you have a new lead, press one to get connected. He presses one. It instant connects him with that lead. Right. And so like if you look at the data,\r\n\r\n\r\nNikolas Hulewsky (31:29.456)\r\nDang.\r\n\r\n\r\nNikolas Hulewsky (31:41.286)\r\nThat's rad.\r\n\r\n\r\nSteve Hunsaker (31:43.958)\r\nRight. Like if you look at like like SaaS companies or any sort of service business, the data is crystal clear. they Harvard Business, Harvard Business Review did a study on this and it's like the businesses that take that take an hour or longer to get back to people on the first touch will be three to three point five times more expensive customer acquisition costs than the businesses that give people an answer in under in under a minute. Because what's happening if you get to him in under a minute, right, if your process is dialed in?\r\n\r\n\r\nNikolas Hulewsky (32:04.913)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (32:08.741)\r\nHmm.\r\n\r\n\r\nSteve Hunsaker (32:13.964)\r\nthey don't go call your competitors. Most of them are like they got they got it off their list. Now, some will still go call your competitors. But if you're looking at the law of big numbers, if 100 leads come in and I'm getting to 100 leads in 60 seconds and getting appointments in person book, pre-qualifying them and all that, and then the other business guy is out doing the installs, whatever else, I'll get to him when I get to him. I'm already there, baby. I'm already there with a sales rep in person.\r\n\r\n\r\nNikolas Hulewsky (32:34.844)\r\nWell, that's what makes Google LSA, Angie's List, Thumbtack hard is because you're competing against everybody and they're all like, whoever gets there first effectively is going to get that at least at a much higher rate, I should say. So you're just taking the time out of it. You're just like, OK, cool. If we get a lead, we respond to them right away. There's no question about that.\r\n\r\n\r\nSteve Hunsaker (32:52.142)\r\nfor sure.\r\n\r\n\r\nSteve Hunsaker (32:58.968)\r\nyeah. And then if they don't, but if they don't answer, my system will auto drop them a voicemail that says, Hey, it's Steve with Valley Christmas. I saw you reached out. I'm going to send you a text right now. Reply to this text whenever you're ready. And then we'll get you started on this quote. So now they just got an auto voicemail drop and an auto text. And then they respond to that text. My guys get a notification. Hyenas go. Flesh go. Boom.\r\n\r\n\r\nNikolas Hulewsky (33:06.352)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (33:24.412)\r\nWell, it is interesting because there are a lot of companies who outsource things that should be their core competency. And in this business, effectively what you're saying is if you're outsourcing your marketing when you're under a million dollars, you're hoping that that agency or that company that you're working with will deliver the results that you need in order to stay alive. And so if you're under a million, under a million and a half dollars, you need to go figure it out first.\r\n\r\n\r\nyou need to understand the full system, the process, soup to nuts. And then when you have some margin, you can outsource and hire somebody in who has the expertise necessary to keep your business going. under a million dollars, it just doesn't make sense for you as the business owner to not do it.\r\n\r\n\r\nSteve Hunsaker (34:05.262)\r\nIt doesn't make sense. No, because what does it also do when you start making creative? Now you have organic content. You got better at organic content because you and your team made creative. And it's like, what's winning now in 2025? It's like human beings, founder led content, whatever else. so like, you're like Nick, if you're getting, if you're on your social media right now and you and you're at your house or whatever, you're like looking for, you know, a dog groomer and like one ad you see is a still image that says bye bye bye.\r\n\r\n\r\nNikolas Hulewsky (34:12.934)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (34:18.298)\r\nFounder-led content. Yeah, founder-led content.\r\n\r\n\r\nSteve Hunsaker (34:34.35)\r\n$100 off dog grooming and the other one is like, hey, I'm Steve. I've had two Mastiffs since I was 10 years old. I've owned this dog grooming company, whatever. Here's five reviews. I'm local, grew up here. Which one is going to convert you?\r\n\r\n\r\nNikolas Hulewsky (34:41.399)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (34:47.228)\r\nI mean, just even you saying, hey, here's the structure. And that first thing where you're like, Lucas, Texas, what's up? This is Nick. Like just right away, they know, oh, this isn't plug and play, like just random to everybody. This is for me. It's way more personal than the bye bye bye, 30 % off this weekend.\r\n\r\n\r\nSteve Hunsaker (35:03.447)\r\nRight.\r\n\r\n\r\nSteve Hunsaker (35:07.692)\r\nYeah. But then think about this too. The agency, even if they agree with my concept on how to acquire customers, right? The agency will then, when you sign up with them, they can't fake that they're you. And so they're going to be like, Hey Nick, will you go film this video for me? And now you're already doing the work. You're already doing the work anyway. And then maybe they'll edit it, but you can learn CapCut in two minutes. Like it's so easy. Or you can go on Fiverr.\r\n\r\n\r\nNikolas Hulewsky (35:21.414)\r\nNo.\r\n\r\n\r\nYeah, they still need you to do the filming.\r\n\r\n\r\nNikolas Hulewsky (35:33.531)\r\ntrue.\r\n\r\n\r\nSteve Hunsaker (35:36.194)\r\nYou can go on Fiverr and pay a guy in Sri Lanka fifty five dollars to cut your ads up for you. You just send him the raw iPhone footage and have him cut it up for you. So it's like I will argue with anybody on this and like people that say, it's going to take too much time. It doesn't because like if you look at the grand scheme of things, the people that join the people that like we work with, like I do this with like three hundred twenty home service businesses, 60 year old plumbers, 20 year old window cleaners, anyone in between.\r\n\r\n\r\nLike I've had window cleaners that signed up on Monday and they had ads live on Tuesday. Now that guy's a dog. Like he went out and did it like fast, but like it's not that complicated to go film an iPhone video and\r\n\r\n\r\nNikolas Hulewsky (36:07.824)\r\nJeez.\r\n\r\n\r\nNikolas Hulewsky (36:11.846)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (36:17.69)\r\nWas that the idea behind the accelerator then? When you're like, dude, they don't need an agency to be on retainer for a thousand bucks a month. They could just go through, here, let me just throw you through a boot camp, focus on these things. This is exactly what you need to do. Go run.\r\n\r\n\r\nSteve Hunsaker (36:20.526)\r\nfor sure.\r\n\r\n\r\nSteve Hunsaker (36:29.131)\r\nYeah.\r\n\r\n\r\nYeah, it's like they can pay somebody to fish for them and learn to fish and fish for the rest of their business's existence and then teach their staff when they grow how to do it and then whatever else. It's so it's so easy to and like this is coming from a guy who owned three home service businesses over the last five years. I've had six or seven terrible agency experiences like I know I've hired them and fired them. Every home service business or business owner that is listening to me knows that this is true. Like every single one that is under a mill knows this is this is true.\r\n\r\n\r\nAnd even if you are getting decent results from an agency, it's not penciling as much as it would if you do it yourself. They're not doing anything creative anymore. Like they're not doing any targeting. There's no skill set anymore. It's all creative. It's all structure. create the Mark Zuckerberg is saying that the algorithm is good enough now that the creative finds the customer for you. It's did Nick watch my video for 30 seconds? OK, cool. What else does Nick interact with on Facebook? What else does he interact with everywhere else? OK, cool. He clicked the profile, but he didn't submit yet. Let's serve him another ad like that's all algorithmic.\r\n\r\n\r\nNikolas Hulewsky (37:10.246)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (37:29.5)\r\nDude, it's insane. It's insane. All right, let me ask you this. I'm super curious to know. You have had how many people? 300 people? 320 people go through?\r\n\r\n\r\nSteve Hunsaker (37:30.72)\r\nall algorithmic. Yeah.\r\n\r\n\r\nSteve Hunsaker (37:40.45)\r\nThe 320.\r\n\r\n\r\nNikolas Hulewsky (37:43.42)\r\n320 companies go through the accelerator. Okay. Perfect. Perfect. For you, as you're looking 2025, I know when you started doing the Christmas light business, it was great. Like you said, there's eight competitors and now this year you've got 30 competitors competing. So, and that happens, it's become a more saturated market. If you were starting over today, what are your three favorite home services businesses?\r\n\r\n\r\nSteve Hunsaker (37:43.854)\r\nIn 324 as we're recording, 324.\r\n\r\n\r\nNikolas Hulewsky (38:11.93)\r\nthat you're like, dude, easy money. I would go to this, this and this and tell me why.\r\n\r\n\r\nSteve Hunsaker (38:16.438)\r\nYeah. Yeah. OK. So I it's it's this is good. So I have multiple answers. The first one I would do is I would find a trade that has high barrier to entry. So if I if I did it.\r\n\r\n\r\nNikolas Hulewsky (38:30.916)\r\nlicensure expensive for equipment. Okay.\r\n\r\n\r\nSteve Hunsaker (38:33.71)\r\nYeah. Yeah. There's so there's so much competition now in every home service trade because home services are the darling of 2020. And as AI keeps going, home service businesses will continue to be the darling. Private equity flying in, everything else. Everybody thinks they everybody in finance thinks that they can go buy a mom and pop home service business and be a millionaire tomorrow. So. The first thing I would like if I could go back to 2020, I would actually go to an electrician apprenticeship and I would be an electrician.\r\n\r\n\r\nNikolas Hulewsky (38:54.076)\r\nThey can't?\r\n\r\n\r\nSteve Hunsaker (39:02.262)\r\nand I would start an electrical company and I would be at this with my skill set now. I would be a multi multi millionaire in five years like multi.\r\n\r\n\r\nNikolas Hulewsky (39:11.908)\r\nWhy? Because there's just no competition on the ad side. You're like, there's just.\r\n\r\n\r\nSteve Hunsaker (39:15.512)\r\nSo, yes, so electricians specifically, there's because of the hours needed to be certified, all that jazz, the training, everything else, the apprenticeship hours, whatever else, there's a fraction of the competition. The competition that does exist is old. There's an electrician shortage. They talk about it on Fox News and CNN all the time. There's skilled trade shortages. Everything I'm talking about, whether it's Google Ads, Google Maps optimization, Google Ads, Facebook ads, whatever it is, organic Facebook.\r\n\r\n\r\nNikolas Hulewsky (39:33.008)\r\nYeah.\r\n\r\n\r\nSteve Hunsaker (39:45.806)\r\nbecause that is so boomer heavy in a trade, you will dominate them with like 2025 internet, internet type of marketing. And so that to me, electrician is the answer. The other answer is I would go into an MRR business if I had money. So this is the key. If the person's broke, I would not go into an MRR business if you're trying to pay yourself from that, because it's really hard to get going. But if you have a little bit of cheddar,\r\n\r\n\r\nNikolas Hulewsky (39:52.848)\r\nHa ha ha!\r\n\r\n\r\nSteve Hunsaker (40:14.072)\r\nAnd you don't like have to because, you know, it's like if you start a pest control company, you're not going to be like paying yourself 10 grand a month for a while. Right. But the MRR businesses have exit potential. My Christmas light business is an income generator. I'll never sell it for a good multiple ever. No one will buy it for a good multiple. It's an income generator. It's. lawn care pest control pools, but I would not start a pool company. Lawn care pest control.\r\n\r\n\r\nNikolas Hulewsky (40:28.475)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (40:32.538)\r\nWhat's an MRR business?\r\n\r\n\r\nSteve Hunsaker (40:42.158)\r\ndog poop scooping is becoming really popular, that's like so that's so minimal entry. Yeah, it's so minimal entry that I mean, you could do it, but like I don't. There's no barrier to entry to pick up dog poop, so I like the ones that are just going to have less competition because I like to scale ads. So what I mean by for anyone listening, what I mean by scaling ads is like when I run an ad campaign, I spend $50 a day and it works. So $350 a week and I got back, you know, 3000, 4000.\r\n\r\n\r\nNikolas Hulewsky (40:44.412)\r\nDude, I just heard about that.\r\n\r\n\r\nNikolas Hulewsky (40:59.142)\r\nYeah, yeah,\r\n\r\n\r\nSteve Hunsaker (41:09.582)\r\nI'm going to go the next week and I'm going to spend $75 a day. And then did something break in my business? No. Great. Bumped to $100. Is it still penciling? Fantastic. Bumped to $125. And then this is for any home service business owner or contractor listening. It's like so many times I see these guys that I'm like, dude, like they'll come into the program and they'll be like, dude, the Facebook guys are crushing you. You changed my life. And I'm like, dude, that's awesome. And then they're like,\r\n\r\n\r\nI look at their ads and they're spending $50 a day for the last three months. And I'm like, dude, are you getting ready? And I'm like, my dude, are you getting ready to hire? And they're like, yeah, yeah, yeah. And I'm like, why are you? I mean, I'm assuming you're booked out solid, right? Yeah, yeah. I got some a few days open. I'm like, well, if it's working and you want to be X, like you want to have three trucks on the road, four trucks on the road, 10 trucks on the road, like why are we not scaling it? And then it's usually like, because that's scary.\r\n\r\n\r\nNikolas Hulewsky (41:39.699)\r\nthey haven't scaled.\r\n\r\n\r\nSteve Hunsaker (42:04.952)\r\nBut it's like, I'm here to tell everyone if you have a working marketing avenue, right? So let's say you're a yard sign guy, you do a hundred yard signs a month and it's penciling positively. The next month, you should do 150. Like, it's very like, you should not be doing if the ad thing is working and you don't have an operational lag, meaning your schedule is full, you need to train more, whatever else. Like, if you don't have that problem, like you have open spaces in your calendar.\r\n\r\n\r\nYou should be scaling the working ad until either the advertising avenue breaks or a system in your business breaks. And then you go fix that system and you keep going.\r\n\r\n\r\nNikolas Hulewsky (42:40.454)\r\nSo really quickly, you said it earlier, you said ROAS. I think most people know what that means. Will you just define that really quickly?\r\n\r\n\r\nSteve Hunsaker (42:46.732)\r\nYeah, return on ad spend. So if I give $10 to a machine and it spits back out $100, I just got a 10x return on my ad spend.\r\n\r\n\r\nNikolas Hulewsky (42:53.51)\r\nPerfect. What is a good ROAS for these home services businesses?\r\n\r\n\r\nSteve Hunsaker (42:57.646)\r\nOkay, this is where it's gonna get really technical. Okay, so like I would say, I would say like anybody would be pretty thrilled with like a 5X, right? Like that's, you gave him 50, you got back 250, you can scale that up. You're at 20 % customer acquisition cost. It's not great, however, however.\r\n\r\n\r\nThis is what you have to do to make it great. It's like, so anything over five is like a win in most cases. But my ads get 10. Most people in Home Search and Celebrator get better than that.\r\n\r\n\r\nWhat we do after we get that Facebook lead is where it pencils. And so this is where like we get tactical. So the reason we mega scaled was we do five things on every job site once we get a job. Five things. SOPs for my installers every single time. They park the branded vehicles on the road. Brand touch point one. They see a branded vehicle, Touch point two. I have A-frames that they put in the middle of the street that's made to look like\r\n\r\n\r\nMen at work slow down. so if the car is parked on the curb, right? And like my chin is the middle of the street, my guys put the A-frame like two feet into the road. So it doesn't stop traffic, but it impedes traffic. And on the A-frame it says, elves at work, book your free estimate. And then there's a QR to our website and our phone number. So now you have touch point two is the A-frame. The A-frame.\r\n\r\n\r\nNikolas Hulewsky (44:19.919)\r\nNo, man.\r\n\r\n\r\nNikolas Hulewsky (44:24.923)\r\nYeah.\r\n\r\n\r\nSteve Hunsaker (44:27.124)\r\nexplicitly invites neighbors to come bother the crew. Right. So that's like the truck wrap is a branding play. It's not a great CTA like called action machine. It's more of a branding play. The A-frame is a call to action machine. Most people get a second A-frame and put it at the entrance of the neighborhood. So the cars leaving now get a third brand touch point. So see it in front of the vehicle. They see the vehicle now and they're driving the kids to soccer practice. They see three. So now you've got two to three touch points there. Third one.\r\n\r\n\r\nNikolas Hulewsky (44:40.07)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (44:48.689)\r\nYeah.\r\n\r\n\r\nSteve Hunsaker (44:55.106)\r\nThe closest 10 to 15 neighbors get a door hanger that says, you know, either A, sorry for the noise or B, we just did your neighbor's X. We just did your neighbor's lights. We just did your neighbor's whatever. We love the opportunity to, you know, whatever else. Expiring offer on the bottom. So now you have three touch points, right? Fourth one, when they're done with the install, when they're done with it, with whatever job they're doing, we convince the customer with a carrot in the form of either A, a discount on their service or B, a Chick-fil-A gift card for 15 bucks, 20 bucks, whatever.\r\n\r\n\r\nNikolas Hulewsky (45:02.545)\r\nYeah.\r\n\r\n\r\nSteve Hunsaker (45:23.672)\r\nto let us put a branded yard sign in their yard until the next time they mow their lawn. That in most... Yeah, yeah, because like you can't like force them to do it forever. So we just say like, that's just like the way that you can mentally let it process for them. And most of the time, like some of these people will be champions for your brand and then they'll just put it back in. Like it doesn't matter. Like if they love you, they love you. But if they throw it away, big deal. It's $4 sign. So now we've got four touch points in the neighborhood, right? The fifth one is our techs have the Google Tap cards.\r\n\r\n\r\nNikolas Hulewsky (45:28.926)\r\nthat's it. Just till the next time they mow their lawn.\r\n\r\n\r\nNikolas Hulewsky (45:36.603)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (45:46.203)\r\nYeah.\r\n\r\n\r\nSteve Hunsaker (45:53.432)\r\nAnd we say like, hey, if you leave us a photo review, I get a bonus. And then I've got either you can either do just like I Jack the installer, get a bonus for every review I get. If you were happy with your service, would you mind leaving like a photo of you? I'd be happy to take a picture with you or whatever else or just a review. About half of those people will leave a review. About one third of those people leave a photo review. Photo reviews make you rank higher a lot faster. That's why we try to push for photo reviews. So now we've got five things that we do every single time on site that then\r\n\r\n\r\nWe bought a lot of these opportunities from Facebook, but then we get neighbors, neighbors organically. And then it's like, now I'm not just on the paid ad hamster wheel. Now I've got a bunch more juice happening on the side. And then the sixth thing we do, and this is the cheat code, is yeah, the sixth thing we do is you calculate what it costs for you to buy your customer. So customer acquisition costs. So for us, it's anywhere between like a hundred, $150, depending on the time of year.\r\n\r\n\r\nNikolas Hulewsky (46:27.034)\r\nYou organically are accelerating. Yeah.\r\n\r\n\r\nNikolas Hulewsky (46:38.362)\r\nOoh, ooh, ooh, an extra, okay. Bonus tip.\r\n\r\n\r\nSteve Hunsaker (46:50.382)\r\nAnd so what we do is we give the customer who just paid and just got happy two gift cards to us. And they look like Best Buy gift cards and say $100 to value $100 off to value Christmas lights. The customer's name that just got the job done is written on the back of that card. So if I just did Nick's house, right, you get two cards on the back of it. It says gifted by Nick. And I say, Nick, give this to your friends and family. This is tracked back to you.\r\n\r\n\r\nEvery time this gets redeemed, we're gonna send you a $100 gift card to Mastro's Steakhouse. Steak 44. Whatever else. Whatever it is.\r\n\r\n\r\nNikolas Hulewsky (47:23.903)\r\nLiz.\r\n\r\n\r\nSteve Hunsaker (47:25.965)\r\nHello.\r\n\r\n\r\nNikolas Hulewsky (47:27.687)\r\nShe's heard I have a podcast right after this. That's so funny. No, you're good. You're good\r\n\r\n\r\nSteve Hunsaker (47:29.63)\r\nshoot. Yeah. Yeah. So then we\r\n\r\n\r\nNikolas Hulewsky (47:33.904)\r\nto masks, it's dude and it's $100 acquisition costs. Like it's the cheapest.\r\n\r\n\r\nSteve Hunsaker (47:37.858)\r\nYeah. But the difference here for my more technical guys is the operational lag on your sales team with those referrals will be way less. So even though you're paying a hundred dollar acquisition cost, your salespeople will close that job.\r\n\r\n\r\nNikolas Hulewsky (47:53.885)\r\nyeah. Yeah. Way better close rate.\r\n\r\n\r\nSteve Hunsaker (47:54.414)\r\nWay better because it's a referral like way better. And so now it's less operational lag It's more of a like because the neighbors probably told them how much you cost already, too So then boom rock that\r\n\r\n\r\nNikolas Hulewsky (48:04.764)\r\nOf Yeah, of course I can tell. Dude. my gosh. You don't know very much about this stuff. So I'm glad. I'm glad we got Rain Man on here to talk about ads in home services.\r\n\r\n\r\nSteve Hunsaker (48:12.169)\r\nI love it. It's like I don't have I don't have\r\n\r\n\r\nI don't have hobbies. I don't have hobbies. This is all I, like, I don't have hobbies. It's actually impacted me interpersonally in the relationships. I don't have hobbies. This is all I like. It's great. It's the life I chose. This is all I like to do. Like, this is it.\r\n\r\n\r\nNikolas Hulewsky (48:28.538)\r\nAll right, Steve Hunsaker, home services accelerator. Go find him, he just joined Twitter, so go find him on Twitter, show him some love. I just told him he's about to hit a wall, so you proved me wrong out there, and I can't wait to talk to you in like six months when you've blown up another Christmas season.\r\n\r\n\r\nSteve Hunsaker (48:37.55)\r\nThank\r\n\r\n\r\nSteve Hunsaker (48:48.108)\r\nYeah, dude. Thanks for having me on.\r\n\r\n\r\nNikolas Hulewsky (48:49.788)\r\nis right. Yeah. All right.",
  "metadata": {
    "duration": "",
    "date": "2025-07-21",
    "platform_source": "Google Drive"
  }
}