{
  "episode_number": "111",
  "episode_title": "How to Get Started in Property Management with Peter Lohmann",
  "guest_name": "Peter Lohmann",
  "business_name": "RL Property Management",
  "transcript": "﻿Peter (00:16.288)\r\nSo I own a residential property management company in Columbus, Ohio. So we manage rental homes and apartments on behalf of the property owner or landlord. And we've been doing that about 11 years and we have about really close to 700 total units under management. It's a mixture of single family homes and small apartment buildings.\r\n\r\n\r\nNikolas Hulewsky (00:37.807)\r\nWow, all right, I'll let this part out. Just so you know, I get uncomfortable, I get insecure. If you see me doing this, looking down, I'm not texting or tweeting. My notes are down here. My monitor is up here. If it was me on the other end, I'd be like, am I not interesting enough? So it's more of me for my own insecurities. No, no, no, I'm not bored. I just wanna make sure that I'm taking the right notes. Okay, cool.\r\n\r\n\r\nPeter (00:47.935)\r\nYeah, no worries.\r\n\r\n\r\nPeter (00:53.418)\r\nIt's your show. If you're bored, that's not good.\r\n\r\n\r\nPeter (01:00.446)\r\nYeah, you're good.\r\n\r\n\r\nNikolas Hulewsky (01:05.422)\r\nSo 700 doors, that sounds like a lot to me, but I have no idea what that means in property management. Tell me a little bit like what's revenue on 700 doors.\r\n\r\n\r\nPeter (01:15.742)\r\nYeah. So it's just a hair under three million in annual revenue. And that's probably on the better end. It depends on sort of how leaned in the owner operator is to the industry and to sort of optimizing the business. Some of the older mom and pop property management companies who have been around forever would have like less revenue per door. And some of the newer folks who are really tuned in to optimizing that will even have higher. Also depends a little bit where in the country you're located.\r\n\r\n\r\nIf you're in California, you probably make more per unit than here in central Ohio. Yeah.\r\n\r\n\r\nNikolas Hulewsky (01:51.086)\r\nIs that your main metric is like, okay, revenue per door.\r\n\r\n\r\nPeter (01:54.3)\r\nIt's a very important metric. I wouldn't say it's like the main metric, but it's one of the top five for sure.\r\n\r\n\r\nNikolas Hulewsky (02:00.63)\r\nInteresting. And what is a good revenue for Dwarf?\r\n\r\n\r\nPeter (02:03.922)\r\nA good revenue per door, I would say starts to get good around $150 per unit per month. I would probably shoot for like a $200 minimum to be like a nice sort of profitable business. Once you start getting up into like the upper 200s and into the 300s, now you're talking about sort of top 10 % in terms of performance and profitability. Again,\r\n\r\n\r\nslightly weighted depending on where you are in the country. yeah.\r\n\r\n\r\nNikolas Hulewsky (02:34.126)\r\nAlright, so you're doing 3 million top line 700 doors. What does that translate to to bottom line?\r\n\r\n\r\nPeter (02:41.312)\r\nIt depends on the year, but we varied anywhere from 10 % to 18 % profit margin.\r\n\r\n\r\nNikolas Hulewsky (02:48.078)\r\nWow. All right. So between three and $550,000, that's incredible. Tell me a little bit about what are your customers like? Do you call them customers? Do you call them clients? What do call them?\r\n\r\n\r\nPeter (02:51.828)\r\nMm-hmm.\r\n\r\n\r\nPeter (03:00.576)\r\nSo the interesting thing about property management is that we really have two customers. We have the property owners. These are the people who've hired us to manage their properties. We call them clients or owner clients or owners. And then we also have the tenants. We have a lot of responsibilities to the tenants as well. And the sort of new lingo is you call them residents, not tenants, but in any case, that sort of...\r\n\r\n\r\nNikolas Hulewsky (03:16.621)\r\nBye.\r\n\r\n\r\nPeter (03:26.969)\r\ncustomer dichotomy is one of the things that does make this business somewhat challenging.\r\n\r\n\r\nNikolas Hulewsky (03:32.814)\r\nSo, and what do you do with property management? I know this is like, it should be pretty self-evident, but you're talking to property owners and then they're having you do what, collect rent?\r\n\r\n\r\nPeter (03:42.43)\r\nYeah, so there's three main things you do as a property manager. Collect the rent, deal with maintenance, and lease up vacant units and deal with lease renewals. So rent collection, maintenance, and leasing is sort of the three big categories that I think of.\r\n\r\n\r\nNikolas Hulewsky (03:55.574)\r\nAnd what are your typical? I'm going say clients for property owners and I'm going to say tenants for tenants. your clients, what's their typical profile? Are they, they have one or two units or are they a hundred units? Like what, what does that look like?\r\n\r\n\r\nPeter (03:58.612)\r\nMm-hmm.\r\n\r\n\r\nPeter (04:11.36)\r\nThe one or two units for sure. We have a lot of folks, we call them accidental landlords. These are people who moved out of the property and decided to rent it out for one reason or another instead of sell it. Or maybe they inherited it or something like that. And then we have intentional investors. These are folks who purposely bought a rental property. And these are the kind of folks you'll find hanging out in like bigger pockets and going to the real estate investing meetup groups in your city.\r\n\r\n\r\nNikolas Hulewsky (04:22.339)\r\nMm-hmm.\r\n\r\n\r\nPeter (04:39.552)\r\nAnd those folks are more likely to have a handful of units rather than just one. But I believe about 60 % of our clients have just one unit. And then it kind of scales up from there where our biggest client has like 60 units.\r\n\r\n\r\nNikolas Hulewsky (04:56.088)\r\nThis is my own ignorance, but I would think if I owned one or two units, I would manage the property. Like, why would I have a property management company come in and do that?\r\n\r\n\r\nPeter (05:03.71)\r\nYeah, great question. So first, a lot of people do. about about half of those folks do self-manage. But reasons you would hire a property manager, there's a few. One, bear in mind, a lot of these folks are moving away or they don't live in Ohio. So it becomes much more challenging to manage the property when you're not local. Also, there are a lot of legal and regulatory gotchas when it comes to landlord tenant law, fair housing and things like that.\r\n\r\n\r\nNikolas Hulewsky (05:31.15)\r\nOkay.\r\n\r\n\r\nPeter (05:33.256)\r\nAnd so using a professional property manager will help you insulate yourself from those risks and make sure that you're kind of doing things the right way so that your tenant doesn't sue you. Or if they do, you have all the right insurance and protection.\r\n\r\n\r\nNikolas Hulewsky (05:45.43)\r\nOkay, so that makes sense. they're these accidental landlords or they inherited it, they're probably overwhelmed at the prospect of managing the property. So for them, it's like, out of sight, out of mind, cool, I'll pay the property management company just to take it off my plate because I don't want to worry about it.\r\n\r\n\r\nPeter (06:01.118)\r\nYeah, so it could be for like a risk reduction, but it also may just be sort of like for convenience. It's like, you why do people hire house cleaners? They don't know how to clean. It's like, well, no, they do know how to clean. It's just they'd rather have someone else do it. They got other things they'd rather be doing.\r\n\r\n\r\nNikolas Hulewsky (06:07.342)\r\nAlright, go ahead.\r\n\r\n\r\nNikolas Hulewsky (06:14.742)\r\nSo for the accidental landlords, how do they pay you? Is it a percentage of collections or is it a fee based? thanks for managing my property. Here's 100 bucks this month.\r\n\r\n\r\nPeter (06:18.398)\r\nMm-hmm.\r\n\r\n\r\nPeter (06:27.812)\r\nSo you can do both or either. Excuse me. So we happen to do a flat monthly rate, a flat monthly fee per month, but a lot of property managers, I would say actually most property managers, charge a percentage of collected rents.\r\n\r\n\r\nNikolas Hulewsky (06:41.558)\r\nOkay. And for your clients that are larger, that don't just have the ones you choose, they're not accidental landlords, is it the same? You're just charging a flat fee?\r\n\r\n\r\nPeter (06:45.3)\r\nMm-hmm.\r\n\r\n\r\nPeter (06:50.154)\r\nSimilar, yep, we do offer discounts. Like if you have 20 units with us, we're gonna give you a better price than somebody who has one or two, but yeah, same thing, flat monthly fee.\r\n\r\n\r\nNikolas Hulewsky (06:59.288)\r\nAnd for your business, you're just doing residential, correct? All right. Are there commercial property management companies?\r\n\r\n\r\nPeter (07:02.944)\r\nCorrect.\r\n\r\n\r\nThere are, yep. There are far fewer of them because there's far fewer commercial properties and they're also a lot easier to manage actually. But yeah, that's the thing.\r\n\r\n\r\nNikolas Hulewsky (07:15.586)\r\nWhen did you launch your business?\r\n\r\n\r\nPeter (07:17.6)\r\n2013.\r\n\r\n\r\nNikolas Hulewsky (07:18.926)\r\nyou've been in this while. Okay. I was thinking like, maybe 2020. Because you saw a bunch of people buying homes and then a bunch of people thinking, I'll house hack or I can buy a rental property or probably a lot of people who bought Airbnb's that are now either can't get rid of it or are just turning it into a investment property. Tell me a little bit about the history. So 2013 until until this year $3 million. How long did that ramp take?\r\n\r\n\r\nPeter (07:20.607)\r\nMm-hmm.\r\n\r\n\r\nPeter (07:47.808)\r\nSo the history is that prior to 2013, I was working as an engineer. I have a degree in electrical engineering and I was working as a control systems engineer. My business partner, who's also an engineer, he and I had started buying up single-family rentals here in Columbus, Ohio in 2008. We bought our first one. So we were buying and owning and self-managing single-family rentals for a few years there while we were working as engineers and we were self-managing. And then in 2013,\r\n\r\n\r\nWell, about a year leading up to that, we decided, hey, we want to own our own business. We want to do our own thing. We don't want to work for other people. What can we do? Well, we already know how to manage properties. Why don't we just start a property management company? So in 2013, I quit my engineering job and started RL Property Management. At the time we had zero units, no clients, nothing. It was me in my apartment. That was it. And over the next year, we just started adding clients and\r\n\r\n\r\nMy business partner quit his engineering job, came on board full time. So from 2013 till today has been just a slow but steady ramp up of units under management, revenue, employees. You know, we figured everything out the hard way because we had no experience in professional property management or real estate other than the small handful of units we owned. We didn't have any family in the business or anything. So we honestly made every mistake in the book and I\r\n\r\n\r\nA lot of what I do these days, other than keeping an eye on my own management company is trying to put out content that's helpful for other people who are starting or growing a management company, sharing a lot of the stuff that I wish I would have been able to read or consume when I was getting started. Because, I mean, there's so much to it with all the accounting and all the ins and outs of leasing and how do you deal with these clients and what happens if you have to file an eviction. And there's just a lot to it.\r\n\r\n\r\nNikolas Hulewsky (09:42.606)\r\nMy business partner, Chris and I, have a, every Friday we do this thing called Hold Clubros. It's on his podcast, but last week we talked about a business in a box idea that I had, which was there's a lot of people who just, they're trying to do side hustles or they're trying to launch a business and they don't want to spend on QuickBooks or they don't want to buy HubSpot or they don't, you know, they're not ready for Salesforce, but they still need to be organized. And so I was like, man, that'd really cool to just have a business in a box. Cool. This is how you set up Google Sheets. This is how you set up.\r\n\r\n\r\nYou know, these automations with Zapier in order to get the flow of things. So I think that that's just a huge piece that's very intimidating to people when they're getting into things is not understanding just how to organize.\r\n\r\n\r\nPeter (10:22.228)\r\nYeah, and there are a few franchises in our space that are seeing success and they sort of help with some of that stuff. So that's an option you can look into. But a lot of folks who start companies, start businesses, they're doing it because they want the freedom, right? They don't wanna be under a franchise or bound by someone else's idea of how things should be done. So it's interesting to watch sort of the different approaches that people take.\r\n\r\n\r\nto help other people start management companies.\r\n\r\n\r\nNikolas Hulewsky (10:53.41)\r\nSo I think of property management, again, I'm an idiot when it comes to this stuff. It's like, I got to go out to the house if there's a problem with maintenance. Collections, you can probably just set up online, but you probably have to collect paperwork at some point unless, probably everything's all digital. Is your team fully remote? Are you on site? Like, what does the management of the actual properties look like from your team?\r\n\r\n\r\nPeter (11:01.504)\r\nMm-hmm.\r\n\r\n\r\nMm-hmm.\r\n\r\n\r\nPeter (11:17.652)\r\nYeah, so we are a mixture. We have a pretty sizable office here near central Ohio where most of our team works, including all of our maintenance guys and a lot of the day-to-day PM operations. You do need some real life component that's near to the properties you're managing because you need to go out there and deal with issues, meet inspectors, show vacant units and things like that.\r\n\r\n\r\nNikolas Hulewsky (11:40.654)\r\nMm-hmm.\r\n\r\n\r\nPeter (11:44.436)\r\nSo you couldn't have like a fully remote company. You do need people who live in the area where the properties are being managed. But we've moved more and more of the functions remote. So, and that's a mixture of US-based employees as well as global talent more and more. Yeah.\r\n\r\n\r\nNikolas Hulewsky (12:06.316)\r\nWhat functions are you doing remotely? What functions do you still have to do locally?\r\n\r\n\r\nPeter (12:10.322)\r\nMm-hmm. Yeah, so again, anything where you need someone physically going to the property, obviously that needs to be local. But a lot of property management is communication and that can be handled by a remote team member. And a lot of it is accounting and paperwork, know, answering the phone, following up on emails. So a lot of like the leasing activity that's not actually showing the unit that's handled remotely.\r\n\r\n\r\nNikolas Hulewsky (12:19.982)\r\nand then\r\n\r\n\r\nPeter (12:36.274)\r\nA lot of the lease renewals, property management agreements, our sales function, marketing, a lot of the compliance and accounting, all that is handled or all that can be handled very easily with a, we, in our industry, we call them RTMs, remote team members, but basically global talent or even US based, you know, remote employees.\r\n\r\n\r\nNikolas Hulewsky (12:56.248)\r\nYeah, they're remote. Are the majority of the properties that you manage in Ohio or are you all around the country at this point?\r\n\r\n\r\nPeter (13:03.274)\r\nThey're all in Columbus, actually, all in the, Correct, because I don't wanna figure out how to have a person in 50 different cities, you know, who's gonna run around and put a lockbox or whatever. Now there's some groups who are going after that, and they do like a city by city approach where like they grow to a few cities and then they either acquire a management company in a new city or they start a new one and then they grow that and then they go to the next one, yeah.\r\n\r\n\r\nNikolas Hulewsky (13:05.454)\r\nAnd that's by design, I'm assuming.\r\n\r\n\r\nNikolas Hulewsky (13:20.366)\r\nsnail.\r\n\r\n\r\nNikolas Hulewsky (13:30.158)\r\nBecause I'm assuming the administrative functions, those are easy to outsource, right? Sending and collecting invoices, compliance, renewals, all of those things. like you said, showing the units, maintenance, anything that breaks, it's got to be done by somebody locally. So you've got to have a local network that you outsource to. So it's like this weird, not weird combination, but it's a combination of being able to do remote and locally. Have you ever seen these guys on Twitter or social media?\r\n\r\n\r\nPeter (13:48.832)\r\nCorrect. Yep.\r\n\r\n\r\nNikolas Hulewsky (13:59.886)\r\nwho were like, I started a remote cleaning business. It seems like an oxymoron to me, but it's similar to what you're talking about, right? Where it's like, you can have remote components to it, but you have to have somebody locally in order to fulfill the services.\r\n\r\n\r\nPeter (14:02.899)\r\nYeah.\r\n\r\n\r\nPeter (14:15.25)\r\nYeah, I think a lot of those companies are kind of like glorified lead resellers. And they're fulfilling a lot of that, or actually all of that work is through contractors, subcontractors. Now, I think that works with cleaning because cleaning is a very straightforward, narrowly defined type of business where it's like, okay, go to this house, clean it, tell me when you're done. And it's sort of like, it's either clean or it's not. And if it's not clean, you send someone back and then you're done.\r\n\r\n\r\nNikolas Hulewsky (14:20.142)\r\nNikolas Hulewsky (14:27.342)\r\nPeter (14:44.244)\r\nWith property management, it's such a huge surface area that you have to cover. I mean, from leasing to maintenance to accounting to everything in between that you could never just have a bunch of subcontractors and run a successful property management company. Now, I do think you could, and I know some people who have started or run property management companies and they don't live in that city anymore, but the company will have an office or some sort of a location with\r\n\r\n\r\nW2 team members, at least a handful who are where the properties are located. Yeah.\r\n\r\n\r\nNikolas Hulewsky (15:19.182)\r\nParker Cox, is a friend of mine, he lives here in Boise and he has a property management company they manage. I want to say they have a thousand doors. I don't know how many doors. But they've got the Bay Area, Southern California and Boise are like the three markets that they're kind of playing in at the moment. But how did you get your revenue per door so high? I was just doing some math. It says it's like $350 per door per month. I just did 3 million divided by 700 divided by 12.\r\n\r\n\r\nPeter (15:27.752)\r\nYeah, he's over a thousand, yeah.\r\n\r\n\r\nPeter (15:36.756)\r\nMm-hmm.\r\n\r\n\r\nPeter (15:46.548)\r\nYep.\r\n\r\n\r\nNikolas Hulewsky (15:48.263)\r\nYou said a good revenue per door was like 150.\r\n\r\n\r\nPeter (15:51.786)\r\nSo there's one caveat there. When you calculated my revenue per door, which you did the math correctly, that's including revenue from our maintenance department. So we have an in-house maintenance function that performs work at the properties that we manage. Now that's optional. A lot of management companies don't have that. And when I was giving you like the benchmarks for a good revenue per door or revenue per unit, that would be without the maintenance revenue included.\r\n\r\n\r\nSo about 35 to 40 % of our revenue comes from that maintenance component. So once you back that out, I can't do the math off the top of my head, it's mid 200s, I guess, is our actual number.\r\n\r\n\r\nNikolas Hulewsky (16:26.702)\r\nYeah, let's say it's 30%. 30 % of 3 million would be 900,000. So 2.17. So it's about $300 per door. mean, it's still a really good number. Wait, no, it's less than that actually because it's divided by 12. So two.\r\n\r\n\r\nPeter (16:44.554)\r\nWell, 30 % is from the maintenance. So 70 % is from the other stuff. Yeah, there you go. Sounds right.\r\n\r\n\r\nNikolas Hulewsky (16:50.542)\r\n250, so about 250 per door per month. Still great. Okay. If I'm sitting at home and I'm entrepreneurial and I'm listening to this, I'm like, man, okay, great margins. And it seems like I could go out and get some doors. I want to try this business. How would you go about starting one of these businesses? Would you start it? Would you acquire it? Where would your mind be if you wanted to get into property management?\r\n\r\n\r\nPeter (17:18.386)\r\nIf you've not run a small business, I would not buy one. I would not buy a property management company to start. I think there's other types of small businesses that you could buy with no experience running a small business and probably figure it out. I wouldn't wanna try and do that with property management due to just the complexity of the business. I would start one if you wanted to do that. And the first thing I would do there is check your state.\r\n\r\n\r\nregulatory requirements. Most states require you to have a broker's license, a real estate broker's license to start a property management company. Some states don't require it. It's easier or harder in some states to get that. Or sometimes if you have a buddy who's in real estate, you can ask him and he'll kind of let you operate under his brokerage for a while. So that's the first thing is just check with your state requirements. But once you get that figured out, yeah, I mean, you just basically\r\n\r\n\r\nPut your shingle up and start going to real estate investor groups and.\r\n\r\n\r\nNikolas Hulewsky (18:15.896)\r\nAnd that's what I gonna ask, how would you get your first door?\r\n\r\n\r\nPeter (18:18.42)\r\nYeah, I think the way we did it is I spent a lot of time on bigger pockets and I would just go there and I would talk about the fact that I offered property management and I would try to offer value to other folks who were asking questions about real estate in my area.\r\n\r\n\r\nNikolas Hulewsky (18:31.704)\r\nSo I don't know bigger pockets that well. mean, I know it's a thing and I know they have forums. Why would you go to bigger pockets?\r\n\r\n\r\nPeter (18:36.508)\r\nIt's just probably the highest density of real estate investors anywhere on the internet. And so you can set up search terms for their forums where like anytime someone mentions Boise, you'll get an email. Then you can jump in and see, they're talking about, does anyone know a good plumber in Boise? And then you can jump in there and say, yeah, here's a great plumber I used last week. By the way, I run a management company. If you ever wanna just be done with these headaches. So it's kinda like that.\r\n\r\n\r\nNikolas Hulewsky (18:42.729)\r\nokay.\r\n\r\n\r\nNikolas Hulewsky (19:02.966)\r\nOkay, so you would start with bigger pockets. That's kind of the area that you would go first.\r\n\r\n\r\nPeter (19:06.484)\r\nI would go bigger pockets online and for offline stuff, I would go to real estate investor meetup groups. And there's two or three or five of these in every city. They're usually held monthly and I would try to be at every single one.\r\n\r\n\r\nNikolas Hulewsky (19:18.35)\r\nI don't know what those are. Real estate, I mean, I can figure it out. But who organizes them? Are these all just self-organizing? Are they a part of an organization?\r\n\r\n\r\nPeter (19:27.22)\r\nThey're usually independent, just somebody or some small group of people wants to meet other like-minded folks and they tend to change hands over the years and to sort of be passed down to the new generation of real estate investors. These groups are hit or miss. I would try going to a few of them. Some of them are really heavy on the sales pushes, sort of like get rich quick real estate stuff. Others are very much organic, just a bunch of guys hanging out talking real estate.\r\n\r\n\r\nThese tend to be amateur real estate investors, meaning this isn't their full-time professional job. They usually have a job. They're buying, they're flipping, they're renovating, there's hard money lenders there, there's realtors, there's title company people, stuff like that. I literally just search, know, Boise Real Estate Investor Meetup. Yeah.\r\n\r\n\r\nNikolas Hulewsky (20:10.414)\r\nHow do you find those? If I wanted to find one, just Google?\r\n\r\n\r\nNikolas Hulewsky (20:19.758)\r\nall right. So it's not like, they're usually on bigger pockets, or they're usually on Facebook, or they're usually\r\n\r\n\r\nPeter (20:22.95)\r\nNo, they're kind of organic. Definitely look on Facebook too, but I would start with Google search.\r\n\r\n\r\nNikolas Hulewsky (20:29.204)\r\nAll right, so let's say I go to BiggerPockets or I go to real estate investor meetups and I've got a fish on the line. When you got your first customer, first client, excuse me, was it one door? Was it a package of doors? Like how did you land that first client?\r\n\r\n\r\nPeter (20:46.016)\r\nI believe our first client was a small handful of doors, I think that was just chance.\r\n\r\n\r\nNikolas Hulewsky (20:56.022)\r\nAnd did you offer discount? Were you like, Hey, I'm just trying to get into this. Let me, let me do it for a month or.\r\n\r\n\r\nPeter (21:01.138)\r\nI mean, I think that back then I didn't offer a discount exactly, but our pricing was really low because I knew that I needed to offer something to entice people since we didn't have experience really. And what I said to our early customers was like, listen, we're a young small company. I am young and hungry. I want to make this work. You're going to get a ton of personal attention from me to make sure that everything's going well at your property, which was a hundred percent true.\r\n\r\n\r\nNikolas Hulewsky (21:10.178)\r\nMm-hmm.\r\n\r\n\r\nPeter (21:27.964)\r\nAnd so in those early days, it's like, hey, you're going to be my 13th client, but that means you're going to get a ton of attention from me. And I have a background in engineering and we own our own rentals. And so we know, you know, we're going to treat your rentals just like our own. So you got to work with what you got, right? So these days, I don't say that. In fact, I don't even talk to our customers, but the sales pitch that our salesperson gives us completely different than that and leans on the strengths that we have today.\r\n\r\n\r\nNikolas Hulewsky (21:46.67)\r\nThank you.\r\n\r\n\r\nNikolas Hulewsky (21:54.604)\r\nInteresting. So my background was healthcare and in hospice, there are sort of these benchmarks. Once we get to 10 patients, it's like, okay, we have a team. Once we get to 30 patients, that was the point where it's self-sustaining and profitable and you have a good agency, quote unquote. And then 50 is another benchmark, which like, all right, you're at 50. Now you're kind of a real player in the market.\r\n\r\n\r\nPeter (22:05.172)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (22:22.318)\r\nyou have some sophistication and then over 100 you're one of the big guys. Those are broad, that's generally what it is. Are there benchmarks like that in property management? Like let's say once you start, is there a certain number of doors you're aiming for? What does that look like?\r\n\r\n\r\nPeter (22:37.76)\r\nYeah, there definitely are. So hundred doors is a big deal. When you start a management company, you'll be able to do everything yourself for the first 50 to 100 doors. Once you hit that hundred door mark, first, that's a big milestone for a few reasons. One, you're generally gonna be able to afford to hire your first full-time employee. And you're gonna start to need someone at that point, because you're gonna be stretched really thin.\r\n\r\n\r\nNikolas Hulewsky (22:59.938)\r\nOkay.\r\n\r\n\r\nPeter (23:04.096)\r\nAlso, by the way, you would then qualify for Crane, which is my paid private community for property management business owners. Crane, yep. Yeah, so Crane is a community of property management business owners that I started a year ago with a friend of mine, Wolfgang Krosky. He owns a management company too. And it's a place for those who are already up and running and looking to grow to communicate with each other, share best practices. do, you know, we do\r\n\r\n\r\nNikolas Hulewsky (23:10.446)\r\nbrain. I've never heard of that. Please tell me more.\r\n\r\n\r\nPeter (23:33.608)\r\nreal life meetups as part of the conferences and things like that.\r\n\r\n\r\nNikolas Hulewsky (23:35.896)\r\nDude, those communities are so valuable. Because you're learning from other people. It's not necessarily, I am Peter here to distill all of my knowledge onto this community. I'm assuming, I don't know Crane, but most communities are like, hey, what are you doing in this market? How does this work? Would anybody talk to a lawyer who's done a transaction before, et cetera? They're just invaluable as you're trying to get up and running.\r\n\r\n\r\nPeter (23:39.362)\r\nThey're great. Yeah.\r\n\r\n\r\nPeter (23:55.419)\r\nExactly.\r\n\r\n\r\nPeter (23:59.204)\r\nYeah, and there's actually a bunch of these groups on Facebook too, and they're really valuable as well, but on Facebook, first of all, it's super noisy, right? And you have all different skill levels, you have vendors mixed in there, you never know what you're getting. And then the other thing with Facebook is that because it's not really private, there's no vetting, people are not comfortable sharing sort of what's really going on. What I like about a paid private community is you...\r\n\r\n\r\neveryone who joins is highly vetted by myself and my co-founder. And then once you're inside, everyone agrees to a code of conduct where what happens inside there stays in there. So you get people sharing very transparently and very, very raw experiences. And then that's where the magic happens, where the real juice is. So anyway, so that's 100 doors. And once you reach 100 doors, it's sort of like, you can make a living off this.\r\n\r\n\r\nyou're not going to have to go back to your normal job if this is something you started on the side or whatever.\r\n\r\n\r\nNikolas Hulewsky (24:56.686)\r\nBecause theoretically, sorry to bust in there at 100 doors, I'm doing anywhere between 1505. No, no, I'm doing 15,000 and 30,000 a month in top line revenue. And I'm netting, let's just call it 15%. So like.\r\n\r\n\r\nPeter (25:08.968)\r\nRight. Yep.\r\n\r\n\r\nPeter (25:16.394)\r\nYou're probably netting more actually as a percentage when you're that small because you're doing everything yourself. You haven't reached the point where you have to buy a bunch of heavy SaaS products and you don't have an office really, or you have a tiny one. So like your overhead is still small.\r\n\r\n\r\nNikolas Hulewsky (25:19.916)\r\nbecause you're doing everything yourself.\r\n\r\n\r\nNikolas Hulewsky (25:29.026)\r\nHmm\r\n\r\n\r\nNikolas Hulewsky (25:33.686)\r\nOkay, that makes sense. All right, so when you hit 100 doors is like, this is a proper business. It's not it's no longer you're just a solo entrepreneur, trying to figure out you hire your first employee. What's the next?\r\n\r\n\r\nPeter (25:39.2)\r\nMm-hmm.\r\n\r\n\r\nPeter (25:46.848)\r\nYeah, so the next break point is probably in the 200 to 300 door range. That's where a lot, a lot, a lot of property management companies get to. That's like super common size. I would say that's kind of like the median size. And at that point, you're have a handful of employees, you're gonna have a small office, you're gonna have very predictable revenue every month.\r\n\r\n\r\nNikolas Hulewsky (25:59.886)\r\nHmm.\r\n\r\n\r\nPeter (26:11.828)\r\nYou're going to have a set of customers coming in the door every month because you've probably been around a little while. You've got a brand in your local area of some sort, and you could compare that size to like. Kind of like any old Main Street business, or it might be similar in size to like a franchise. Like if you went out and bought a smoothie king or something like.\r\n\r\n\r\nNikolas Hulewsky (26:35.054)\r\nYeah, at 300 doors and now just say $200 per door per month, you're at 60 grand a month, you're doing $700, $800,000 a year in top line revenue and your margins are probably in the 20 % range. yeah, mean, that's a good business, but it's still, you know, it's not a business that you can necessarily unplug from, right? And you're like, I got an operator in there and I handed it off to them. Like if you own that, you're probably also running it.\r\n\r\n\r\nPeter (26:39.84)\r\nMm-hmm.\r\n\r\n\r\nPeter (26:45.447)\r\nExactly.\r\n\r\n\r\nPeter (26:59.488)\r\nCorrect.\r\n\r\n\r\nCorrect.\r\n\r\n\r\nNikolas Hulewsky (27:05.654)\r\nin the weeds.\r\n\r\n\r\nPeter (27:06.022)\r\nExactly right. You're not big enough yet to have like a whole leadership team where you could step away and things like that. Yeah.\r\n\r\n\r\nNikolas Hulewsky (27:12.76)\r\nAre you, but let's say at the 700 mark, is that big enough to have a leadership team where you can step away?\r\n\r\n\r\nPeter (27:17.606)\r\nAbsolutely. Yes. And so we've got a full leadership team here at RL and I actually take a month off every year where I fully disconnect from the business. Yeah.\r\n\r\n\r\nNikolas Hulewsky (27:26.222)\r\nYeah, not just the business, you're off social media too. I don't know how you do that. I'm addicted. My dopamine receptors would freak out.\r\n\r\n\r\nPeter (27:29.184)\r\nhaha\r\n\r\n\r\nPeter (27:33.61)\r\nYeah, it's interesting. this will be coming up here, it'll be my fourth year doing it, I think. It started to become sort of like something I'm known for, but yeah, that's really, I view that as sort of the goal. It's like, you start your own company, that's great. And once you're making some good money, that's awesome too, but until you can really step away from it and come back and you've added doors and...\r\n\r\n\r\nsomeone's been hired and someone's been fired and like things are still going good. That's when you really know you've got a true business and you don't, you the sort of derogatory thing that people say here is like, you know, you bought a job, right? You don't want to do that. So.\r\n\r\n\r\nNikolas Hulewsky (28:13.622)\r\nYeah. It's like, yeah, but I bought a job that I'm the only person I could fire myself from. So I'm in control. That's that's a massive deal. So I have a friend of mine who when he goes into something like YouTube or a business, he looks at art, what's the minimum threshold that I want to get to? And how do I get there? And how much money do I need to spend to get there in order to get there quickly? So and I think that's an interesting framework. That's not how I think but he's kind of changed my mind on it.\r\n\r\n\r\nIf I was sitting at home and I was like, are a hundred doors, how can I get there within six months? And let's say money is no object. What would you do? How would you go and get a hundred doors within six months?\r\n\r\n\r\nPeter (28:59.232)\r\n100 doors in six months would be a big challenge, I'll say that. I would probably allow for like one year to 18 months. All right, so if you had to do it in six months and money was no object, you would obviously crank up the online ads to the max. So you would saturate Google with PPC. There's also a few pay per lead vendors in our space and you would wanna saturate those as well.\r\n\r\n\r\nNikolas Hulewsky (29:07.564)\r\nNo, no hedging six months. You have six months. What would you do?\r\n\r\n\r\nPeter (29:27.584)\r\nto make sure you are getting every lead possible from the internet search world. I would also go to every single possible local meetup, every real estate investor meetup group, every realtor meetup group, every real estate networking event. I mean, there's usually like a dozen of these a month. It's just trying to figure out who all's hosting them and where they are and how you can find out about them. And then, go ahead.\r\n\r\n\r\nNikolas Hulewsky (29:51.352)\r\nSo no, no, no, you go. You're spitting gold here.\r\n\r\n\r\nPeter (29:55.648)\r\nSo that's the internet. I would focus a lot on my Google score and my Google business profile. That's a big thing with property management. And so I would have all my friends and family leave me reviews. I would have all of my first customers leave me reviews. You really want to be at like a 4.2 or higher in that range of your Google score so that you show up high on like the Google map pack. I would also invest in an outstanding website and\r\n\r\n\r\nhopefully a group that's really, really good at SEO, because you ideally want to rank highly organically in Google as well.\r\n\r\n\r\nNikolas Hulewsky (30:32.108)\r\nAll right, so I know you're do all those things pounding the pavement with the digital stuff. And I had, I don't know if you know who Buddy Rothmahl is, but he has a Google business profile agency. And so I've been diving deep on that. I freaking love those agencies. If you were to rank, let's say stack rank in order of priority one, two, and three, one, or excuse me, the three options being Google business profile being optimized, building out a really sick website and the SEO PPC.\r\n\r\n\r\nPeter (30:42.281)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (31:01.528)\r\nside of things. What would be the stack order rank of those three?\r\n\r\n\r\nPeter (31:07.892)\r\nthink if you can get your Google Business profile like set up such that you're ranking in the map pack on a search on specifically on a search for property management Sacramento or whatever your city is, best property manager your city. If your little business with its location shows up on that map pack on the first page of Google, that is going to be a great source of leads for you. So that would be probably top priority.\r\n\r\n\r\nI would probably then focus on the PPC because that's kind of instantaneous. The SEO stuff takes a while no matter what you do, so I would do that probably third.\r\n\r\n\r\nNikolas Hulewsky (31:45.262)\r\nI think it's interesting. A lot of people, I come from a more operational background, but a lot of people when they're doing these, think, just got to get customers, customers, customers, I got to grow revenue, grow revenue. But there's a whole other side of the equation, which is fulfillment, right? So it's like, okay, I could get a hundred doors within six months. But then there's the fulfillment. There's actually doing the property management piece. I would, and again, constraints are within six months.\r\n\r\n\r\nAre there plug and play like, hey, here's your operating system that you need. You know, use these softwares. This is how you intake someone. This is how you do a background check, et cetera. Or do you have to figure that out on your own every single time?\r\n\r\n\r\nPeter (32:27.082)\r\nSo there's a healthy ecosystem of vendors and software products and suppliers in our industry now. This wasn't the case like 10 years ago, but today it is. And so you can sign up with a company like Rentvine or Bildium or AppFolio and they will have most of what you need to do the basics. They'll have some sort of a built-in tenant screening. They'll have a way for you to send leases electronically. They'll have a way for you to collect rent online.\r\n\r\n\r\nNikolas Hulewsky (32:36.099)\r\nNo.\r\n\r\n\r\nPeter (32:53.906)\r\nAnd a lot of that is going to be built for you and you can kind of stand up and start operating the management company. That is the good news. The bad news is that property management is filled with an operationally complex nightmare of intricacies and details. You're dealing with structures that are continuously depreciating and falling apart.\r\n\r\n\r\nYou are dealing with people and their house, their home, where they live and they come there every night and their kids are there and their guests are there and there's refrigerators and there's air conditioners and there's bathrooms and there's doors and there's windows and there's blinds and all of these things. And you are also dealing with money and it's not your money. It's you are in trust. The property owner is entrusting you to deal with their money.\r\n\r\n\r\nAnd so there's a much higher level of expectation around things like accounting and reporting and transparency when you are handling money in trust, which you are as a third party property manager. By the way, this is also people's largest monthly bill, that is the rent, and it's your client's largest asset. And so the stakes are very, very, very high for everybody involved. And if anything goes wrong, you get blamed. So it's a lot.\r\n\r\n\r\nAnd, you know, this offer is great and everything, but the day-to-day reality of running a property management company is that it is difficult. I will say that.\r\n\r\n\r\nNikolas Hulewsky (34:20.451)\r\nNo pressure.\r\n\r\n\r\nNikolas Hulewsky (34:31.544)\r\nYeah, I agree. All right. So I'm going to ask you two final questions. One of them is what opportunities you think are the biggest opportunities within property management. And the other question is, what opportunities do you see right now that you're excited about outside of property management? But before I do that, because if I do this at the end, everyone's going to just like skip and tune out quickly give us where can people come find you?\r\n\r\n\r\nPeter (34:53.664)\r\nMm-hmm.\r\n\r\n\r\nPeter (34:58.186)\r\nYeah, so you can find me on my website, peterlohman.com. So if you go there, if you do nothing else, I would sign up for my newsletter. I write a weekly newsletter. It's all about property management. We've got property management companies for sale, news from around the industry. I'm sharing kind of what's working, what's not working about my business. Like earlier last year, I wrote an article about how we lost over 100 doors in six weeks and got a lot of feedback on that. Kind of, I'm sharing all the highs and lows of everything. So if you're into that, go ahead and sign up there.\r\n\r\n\r\nNikolas Hulewsky (35:27.342)\r\nCool. All right, first question. What do you think are the biggest opportunities within property management right now? Let's say that you had to start a business that was adjacent to the property management space. So you couldn't necessarily own a property management company, but you could be maybe one of the vendors or within the real estate space. What opportunities are you seeing?\r\n\r\n\r\nPeter (35:35.242)\r\nMm-hmm.\r\n\r\n\r\nPeter (35:48.416)\r\nSo honestly, right now there's a bunch of big sort of private equity or VC backed groups that are acquiring and have been acquiring property management companies all around the US. And there are honestly, a lot of them are not doing a great job. And so the clients who were previously with like some local management company that got sold, they are looking.\r\n\r\n\r\nAnd so even now, I think what we talked about earlier, like starting a company and growing it to hundred doors is still a great opportunity. That is still a viable path. And there are still a ton of groups rolling up property management companies. If you can get to like 200, 300 doors, you can sell your management company to any one of a dozen different strategics and do very well. And you could even...\r\n\r\n\r\nNikolas Hulewsky (36:18.072)\r\nInteresting\r\n\r\n\r\nNikolas Hulewsky (36:43.694)\r\nWhat does that mean very well? Like, okay, I have 300 doors, I'm $800,000 of your top line, $200,000 of your bottom line. What does that sell for?\r\n\r\n\r\nPeter (36:55.04)\r\nSo at that size, I would expect you could get at least 1.5x top line for your business. And the bigger you get, I would expect to get more like 2x top line. Yep.\r\n\r\n\r\nNikolas Hulewsky (37:02.222)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (37:07.576)\r\nThat's like five, six times even.\r\n\r\n\r\nPeter (37:10.154)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (37:11.564)\r\non the smaller end and they, wow, that's incredible. Is it just because the customers are so sticky?\r\n\r\n\r\nPeter (37:16.092)\r\nIt has to do with, yeah, the nature of the business. It's an operational nightmare, like I talked about, but the business sort of fundamentals are strong, which is that it's a sticky, contractually recurring revenue. Most of these folks are on one-year agreements, minimum. And then there's also really great cashflow dynamics. There's very few expenses that you have to outlay, capital expenses. And you also collect your fee right from the rent.\r\n\r\n\r\nSo there's literally no AR. We don't have an AR function in the business because we just get paid right from the rents. And if you set it up right, you can actually have like a negative cash conversion cycle. So there's a lot of things that make it attractive, but basically these big groups that are funded by private equity and VC money, they see that you have 300 doors in some city and they're just like, yeah, we wanna get into that city.\r\n\r\n\r\nNikolas Hulewsky (37:45.55)\r\nRight.\r\n\r\n\r\nPeter (38:07.36)\r\nWe want to expand and they just pay up for it because they want all those contracts. It's like selling a book of business for most of these guys.\r\n\r\n\r\nNikolas Hulewsky (38:15.566)\r\nThat's freaking awesome. All right, well, I was going to ask you what opportunities you're seeing outside of property management, but that's too good. I don't want to distract anybody outside of property management.\r\n\r\n\r\nPeter (38:24.352)\r\nI don't want to make it sound easy though. I hope that came through. It's not easy. But you can do it. Yeah.\r\n\r\n\r\nNikolas Hulewsky (38:28.008)\r\nI know it's not. This is my opinion. Pick your heart. Everything's hard. Anything that looks like it's easy from the outside is difficult. You get into it. I think we were talking about this, right? You think it's easy, you get into it, you quickly realize it's not that easy and that there's a reason why many people aren't doing what you're trying to do. It's just a function of whether or not you have the ability to actually stick through it.\r\n\r\n\r\nYeah, I'm a big believer just in pick your heart. So this was awesome, man. I appreciate you. And yeah, I'm going to end it right here. And I'll stop recording, but.\r\n\r\n\r\nPeter (39:07.744)\r\nAll right.",
  "metadata": {
    "duration": "",
    "date": "2025-01-22",
    "platform_source": "Google Drive"
  }
}