{
  "episode_number": "57",
  "episode_title": "How She Makes $300K/Year with Self-Storage with Lauren Rothlisberger",
  "guest_name": "Lauren Rothlisberger",
  "business_name": "Self-Storage and Dumpster Rental",
  "transcript": "﻿Nik (00:00.851)\r\nAll right, Lauren, welcome to Niconomics.\r\n\r\n\r\nLauren Rothlisberger (00:04.136)\r\nhey, thanks for having me. It's good to be on.\r\n\r\n\r\nNik (00:07.751)\r\nAwesome. Well, let's just hop into it. Tell me what is your business and how do you make\r\n\r\n\r\nLauren Rothlisberger (00:12.718)\r\nSo as I wrote you earlier about this, I'm in self storage. also, we won't really talk about it. I also have a dumpster roll off business and those kind of went hand in hand. But the one I think we'll focus on today is self storage, which I've been doing for longer.\r\n\r\n\r\nNik (00:27.197)\r\nOkay, so I'm excited to talk about self storage because I think that real estate Twitter and SMB Twitter have fetishized the self storage space. And we're going to get to like all the reasons why. But I want to first start by asking, how did you get into this because you have a really, really interesting\r\n\r\n\r\nLauren Rothlisberger (00:47.406)\r\nSo the pretty short version is I'm a military spouse. We've moved all over the country slash world for the last 20 years I knew I wanted to get into real estate just on the residential side because I had had family members that bought did it and I kind of had the mindset like just buy something every time we move and You know, and then we'll take that investment and you know hold it and and so we did that But as I started to learn about commercial real estate, I was like, you know, this just seems like this is the next place I want to go with this\r\n\r\n\r\nAnd so eventually we have sold off all of those homes and then put it into commercial real estate. So that's kind of a slow ramp up. But over the last few years, I've really kind of gone full time into that and that's been great.\r\n\r\n\r\nNik (01:30.229)\r\nCool. On the self storage side, can you give an idea, just some perspective on how big are your holdings currently? I don't even know how to measure the self storage. Do you do it on number of units? Is it by revenue?\r\n\r\n\r\nLauren Rothlisberger (01:41.454)\r\nyeah. So you could obviously do it on any of those. I, number of units is popular or square footage is popular. I, I do number of units just because it's a little bit easier for me to calculate out. I have a tiny, tiny portfolio compared to many, many people, but, you know, I've got like 350 units or something like that. So it's, it's very small. you know, there's lots of people on Twitter with thousands and thousands of units. what's interesting is that I'm actually.\r\n\r\n\r\nThey're in a better place because it's totally in economies of scale. So like there's places where I'll expand eventually and add more units and that it's better to be bigger. But getting my foot in the door, that's kind of where I landed right\r\n\r\n\r\nNik (02:24.597)\r\nYeah, and you said that there's lots of people who own thousands of units. You own 350, which to me sounds like a ton of units. Talk about the business in particular. What exactly is self storage?\r\n\r\n\r\nLauren Rothlisberger (02:38.956)\r\nYeah, so I mean, it's interesting because the product base is really different. So when you talk about self storage, you've got like your class a super nice climate controlled. Some of them you can drive into. they're sort of like the four seasons. And then you've got all the way down to just like drive up kind of, you know, gravel lots, maybe a little more like a days and Motel six style. but they're both do really well. Those are two totally different client bases and they're looking for different things. Like I have drive up storage.\r\n\r\n\r\nyou know, that's easier to get into when you acquire, if you want to put something really nice in there, I will be the first person to tell you, this is not the place for you. Go somewhere else with some climate control. so I mean, that's kind of essentially what you're doing, right? You've got a space, different, very, you know, variations of unit sizes and then people, you know, rent them for you. It's a month to month basis. So it's kind of nice because pricing is very dynamic. you don't have, you don't have long leases and you spread the risk some over.\r\n\r\n\r\nthe number of tenants, right? So it's a pain in the neck to have hundreds or thousands of tenants, but you're also not going to have a huge, massive tenant exit where you go to zero likely overnight. So that was actually one of the things that I liked a lot when I was looking at the business is I'm not afraid of risk, but I'm also like trying to make sure it's smart. So to me at that time, I was like, okay, this, this, this makes me feel more comfortable because I feel like I can buy something and you know, I, won't lose everybody all at once. Even if I raise a rent or if I,\r\n\r\n\r\nOnce I figured it out. So those are all the things that kind of attracted\r\n\r\n\r\nNik (04:08.213)\r\nSo it's an asset class that has kind of a broad spectrum, right? So you have anywhere from extra space storage is like the publicly traded company that I know of. Class A, like you said, climate controlled, all the way down to anybody who's driven in the remote parts of the United States to see random storage units in the middle of nowhere, are not climate controlled, gravel, and everything in between. This is just like a personal question. Did you ever watch the show Storage Wars?\r\n\r\n\r\nLauren Rothlisberger (04:15.18)\r\nYep.\r\n\r\n\r\nLauren Rothlisberger (04:24.11)\r\nYep. 100%. Yep. Yep.\r\n\r\n\r\nLauren Rothlisberger (04:35.378)\r\nEverybody always asks this and I've actually never seen an episode of it, but I can see the appeal to like, you know, like throw it open the door and discovering what's in there, which rarely do you discover anything good. I've known a couple of people to discover the best, the best and worst discovery is a great car, but it's the worst because it's a title vehicle, which means like, you're not just going to auction it off in the regular process. Almost every state makes you like tow it and it's a whole complication. So, yeah, I think, you know, it's.\r\n\r\n\r\nyou're likely to not really discover anything great, but sometimes, you know, we discover some decent stuff and it sells well in an auction.\r\n\r\n\r\nNik (05:11.433)\r\nWell, like, and the reason the reason I brought up the storage wars is because, A, I've always thought that was cool, but B, that was like my first exposure to self storage. And it feels very different to me than typical commercial real estate where commercial real estate, have these triple net leases where the tenant is taking care of pretty much everything. But with these storage units, they have to get the auctioneer to come out. They're opening up the unit.\r\n\r\n\r\nLauren Rothlisberger (05:20.238)\r\nwas\r\n\r\n\r\nNik (05:38.579)\r\nyou know, helping people bid on it, and then people got to go remove stuff. So it seems like it's more business intensive than the traditional commercial real estate, but you still have the commercial real estate side of things. Am I like, am I understanding that\r\n\r\n\r\nLauren Rothlisberger (05:46.147)\r\nIt is.\r\n\r\n\r\nLauren Rothlisberger (05:51.402)\r\nYou do. Yeah. So it's kind of nice because you've got the property side of the commercial real estate. And a lot of people tell you storage is the greatest covered, you know, covered land play. Like you're putting something on there produces income and, know, depending on how, how many, you know, maybe it never comes to fruition, but for a lot of places like that eventually comes a piece of land that has development happens around it. That becomes far more valuable as something else. You sell out, but you made all that, all that money off the land in the meantime, because you're not putting up, they're not particularly expensive buildings. I mean, it's been more\r\n\r\n\r\nmore costly to build now than it was, like compared to most anything else, I mean, they're, pretty simple. so yeah, it's a fully like people definitely have to understand it's a fully operational business. mean, you know, we answer the phones every day. We have to deal with auctions. have an online auction system that we use. have a property manager like you, know, there's no tenant that's taking care of anything for you. So it's kind of a little bit of a hybrid in the way that, you know, you always say, there's no toilets at, at storage facility. That's true.\r\n\r\n\r\nHowever, there is a lot of other crap. it's not, it's yeah, right. it's like not, it's really not just like a slap it out there. And, in fact, those are the kinds of people you want to buy from. Cause there are people that just kind of like they rent, never, they don't chase down people that don't pay their stuff builds up. And you know, it just becomes kind of a nightmare because it's really a day to day operation business.\r\n\r\n\r\nNik (06:51.807)\r\nNot in temple.\r\n\r\n\r\nIt's not.\r\n\r\n\r\nNik (07:12.127)\r\nSo like talk to me, the business side of things, how big is your\r\n\r\n\r\nLauren Rothlisberger (07:17.058)\r\nSo I have a customer service rep. Well, we have two customer service reps. We actually do kind of a shared services model and split some of that with the dumpster rentals just because they're kind of, they follow a lot of similar operational things. So we do that. And then a property manager and I'm lucky in my places are close enough that I can use one property manager to go throughout the places. So I didn't used to have that,\r\n\r\n\r\nNik (07:39.615)\r\nAre they pretty geographically similar? Like are your storage locations close to your dumpster business?\r\n\r\n\r\nLauren Rothlisberger (07:45.408)\r\nI, yes, yes, they are. actually my dumpster businesses on the property of one of my storage locations, which is great because you don't pay rent. I made a decision about probably a year and a half ago to be like, I'm pretty much geographically going to focus on one area. And it makes acquiring much, much harder because I'm unwilling to go anywhere other than pretty much an hour from my house. which is funny because I'm not really the person that goes out there, but,\r\n\r\n\r\nI have a hard time just buying in areas that I know nothing about. The municipalities can make huge, huge, make or break decisions that impact your property. And so I like that I read the local paper every morning. I read the planning agendas of the towns. Like I try to really keep up with what's coming in this particular area. And I just don't think I could do that in all those locations, not with the tiny team that I want to run. So for me, I'm geographically focused and that's pretty much where I plan on sticking.\r\n\r\n\r\nNik (08:42.235)\r\nNorth Carolina or where are\r\n\r\n\r\nLauren Rothlisberger (08:44.31)\r\nNorth Carolina. Yeah, even down to like pretty much like three counties, three to four I'd pretty much look at.\r\n\r\n\r\nNik (08:48.159)\r\nWell, I think it's interesting. You know, there's a lot of people on SMB Twitter in particular, I'm sure real estate, I don't know real estate Twitter as well, but I'm sure they're very similar where they're like, we just got to scale. We're going to anything that comes across our desk, we'll take it down. the cap rate looks good. So this makes a lot of sense. But, and that's one strategy and it can work. But my, like my philosophy is I want to mitigate downside risk and those philosophies while they're going to\r\n\r\n\r\nLauren Rothlisberger (09:09.688)\r\nYeah.\r\n\r\n\r\nLauren Rothlisberger (09:14.702)\r\nMm -hmm.\r\n\r\n\r\nNik (09:17.429)\r\nlet's say 80 % of the time, they're a lot higher risk because you don't know those markets. Whereas you're focusing on your core competency, essentially, right? Like Warren Buffett talks about this, he takes the fat pitch for things that he knows. You're focusing on the areas, know, so yeah, deals may come up a lot less frequently, but you're probably willing to pay a little bit more for them because you know the area, and you're going to do a lot better in the long run because you understand that market's dynamics, right? So your probability of success goes up to like 98%, and your downside\r\n\r\n\r\nLauren Rothlisberger (09:25.75)\r\nRight, Yep.\r\n\r\n\r\nLauren Rothlisberger (09:41.09)\r\nRight, right.\r\n\r\n\r\nNik (09:47.253)\r\nyou risk is like 2%, whereas the other model is 80 % success with 20 % downside. I don't think that either one of them are like right or wrong. For me, I prefer being slow and like understanding my risks. So I, you don't have to like qualify it or say like, well, you know, I'm just focusing on my, my small area here. think it's a very, very smart strategy.\r\n\r\n\r\nLauren Rothlisberger (10:08.694)\r\nYeah, I think like the whole concept, I think, which is amongerism is like, you know, no called strikes in business. It's just like, I don't have to do those things. And I mean, I saw plenty of people go out and do it, especially in kind of in the boom. And I don't know. mean, it could have been very successful for them, but I also, kind of a blessing, I think it turns out is I'm pretty limited. Like it's really hard for me to get on a plane and go some somewhere and look at a property at a moment's notice. Like I have four kids.\r\n\r\n\r\ncan't just do that. And so it actually became, I think, a really good constraint because it forced me to start thinking about like, I don't want to be I don't even want to have to do that. So and then it kind of slowly evolved to me being like, No, I'm not comfortable with that. And that's just all it was for\r\n\r\n\r\nNik (10:51.701)\r\nChris and I, so my business partner Chris and I, we bought a mobile home park or RV park in Waco, Texas. No, it wasn't Waco. Some city, I can't remember what it was. And it looked great. Cap rate was amazing. Chris had experience in that space, but it was a crappy investment because we didn't understand the city dynamics. And one past ordinance that was in the pipeline kind of screwed us from our underwriting thesis perspective.\r\n\r\n\r\nLauren Rothlisberger (10:57.07)\r\nThank you.\r\n\r\n\r\nLauren Rothlisberger (11:11.886)\r\nThank you.\r\n\r\n\r\nNik (11:19.975)\r\nAnd we ended up having to divest the park. We didn't lose money on it, but we didn't make what we thought we would. And that was just a reminder to me of like, okay, it may look good on a spreadsheet and you may feel good about your underwriting criteria. But if you don't know the local market, right? And you're like, I'm narrowed to three counties. If you don't know the local market, stuff can just happen that you're not expecting. And it was a lesson to me for\r\n\r\n\r\nLauren Rothlisberger (11:42.348)\r\nYeah. Right. Right. And I mean, you know, probability says if you, if you have enough money out there, it's like a fund model, right? And you sort of distribute your risk. And if you have great wins and great losses, you're going to come out maybe on top anyway. I mentally don't really operate that way. I don't, anyway, it's a, it's for me, it's best to stay focused.\r\n\r\n\r\nNik (12:03.061)\r\nYeah. So you have 350 units. How many properties is that across?\r\n\r\n\r\nLauren Rothlisberger (12:08.718)\r\nSo that right now is three properties. had kind of an interesting three years because I bought my first place. I ended up deciding to sell it, take chips off. Like I could see that the market was probably going to turn. I was like, let's take a win as a win and move on. Even though I originally bought it, I was like, I'll just hold it for a long time. But I've since learned that my theory is more to probably, if you were going to say a ratio built by three, you know, sell two, keep one kind of like in the long run, that's sort of the idea I'd go with.\r\n\r\n\r\nknow, we'll see what comes of it. But it's hard to hold everything because it's hard to then pull money back. anyway, I sold one, bought another one, but then actually we sold a big chunk of it to the state for a road expansion, which we knew was coming and we did quite well on that sale. But and then since then, I've been trying to place that money as I got it. And it's that's been a real struggle because there's really nothing that pencils so kind of stuck there. And then bought another one last summer. That's about\r\n\r\n\r\nNik (12:52.058)\r\ncool.\r\n\r\n\r\nNik (13:06.613)\r\nSo I wanna talk about two things. The first one is like the nitty gritty business economics. And then the second thing is sort of general philosophy, general strategy. I'm very curious on the strategy side of things, but I tend to get too ADD on things. And so I'm trying to help you help me focus myself. So on the 350 units, how do you measure, how do I put\r\n\r\n\r\nLauren Rothlisberger (13:25.69)\r\nHehehehehe\r\n\r\n\r\nNik (13:35.893)\r\nWhat's your average revenue per unit? Let's just start\r\n\r\n\r\nLauren Rothlisberger (13:39.15)\r\nyou know, I'd have to really break that down because it's not, it's not that simple because we have all different sizes, right? So it's not, I'd have to get into square feet, which I don't have in front of me. you know, I'm hundreds of thousands in revenue. It's nothing crazy, but, like over the year. So I wish it was over a month. I need, I need a lot more than that, but yeah. so it's tough to say, so like, you know, we kind of go by square foot. like, if you have a five by 10.\r\n\r\n\r\nNik (13:53.415)\r\nA year or a month.\r\n\r\n\r\nover the year. Sorry, this is\r\n\r\n\r\nLauren Rothlisberger (14:08.398)\r\nyou're going to have a higher per, you know, a higher per square foot amount. So maybe it's a dollar 25 or whatever, the larger your unit gets, the more diluted it gets. So then you start having less per square foot, but you can't just be like, we'll put it, put all five by tens in there. Well, no, because those don't really rent that well. So you have to find this balance and like what the market wants and then find the right rate to match it. So, you know, it's a little harder question.\r\n\r\n\r\nNik (14:30.869)\r\nOkay, so 350 units typically by square footage. What was your top line revenue last\r\n\r\n\r\nLauren Rothlisberger (14:41.838)\r\nI knew you were gonna ask this question. I know it gets complicated because I sold some stuff and I'm trying to think back and then I bought something. Yeah, I mean, 300 ,000, something like that. Yeah, without the sales or anything, I'm talking just revenue.\r\n\r\n\r\nNik (14:47.561)\r\nYou can, you can ballpark it. Nobody's going to be looking at your tax returns.\r\n\r\n\r\n300 ,000. Okay.\r\n\r\n\r\nSure. Yeah, yeah. Yeah. Okay. So 300 ,000 on 350 units. rough, rough estimate, $1 ,000 per year per unit. You're looking at somewhere in the ballpark of like $80 per month per unit on average.\r\n\r\n\r\nLauren Rothlisberger (15:12.908)\r\nYep. Yep. That's that is pretty as a very fair average to use. So give give take for sure.\r\n\r\n\r\nNik (15:17.213)\r\nOkay. My question is like I come from the healthcare world and in skilled nursing facilities, occupancy is like a really big deal. And I know that in commercial real estate, occupancy is a really big deal. What is occupancy like in the self storage space?\r\n\r\n\r\nLauren Rothlisberger (15:27.758)\r\nMm -hmm.\r\n\r\n\r\nLauren Rothlisberger (15:37.358)\r\nSo this has been very interesting for me because I came in sort of in the boom, right? So I bought my first place in June of 2021. And things were like, you're thinking everything in occupancy is like 90 to 95%, which then allows you to push up your rates quite a bit. I think people that have been in the business much longer, which luckily I've done a good amount of listening to, I'm talking 10, 20 years, it's gonna vary a little bit, but if\r\n\r\n\r\n75 % occupied, you're probably in a pretty normal average range. mean, ideally you're hitting 80, 85. But I think if I'm going to underwrite it today, I'm going to underwrite, well, initially I'm going to underwrite a big drop because I'm probably going to raise the rent if it's a value add. But I mean, I'm going to underwrite it probably like 70 % occupied and call that fairly stable to 75.\r\n\r\n\r\nI think that's a huge expectation management that's been having to be done among people with storage, like getting back to what it used to\r\n\r\n\r\nNik (16:31.209)\r\nAnd you say so them in the middle.\r\n\r\n\r\nNik (16:38.773)\r\nSo the majority of the deals that you're looking at, you're gonna raise rent.\r\n\r\n\r\nLauren Rothlisberger (16:42.496)\r\nYeah, I generally don't think I'm the person to come by right now if I can't raise the rent just because I'm trying to do value add. I would love to be in a position where I was a little more okay with just a stabilized core asset, but you just don't get as much off of it. So there's definitely more money to be made in value add.\r\n\r\n\r\nNik (16:58.869)\r\nYeah. So so off of $300 ,000 a year in revenue, what do you net off of\r\n\r\n\r\nLauren Rothlisberger (17:08.654)\r\nso about 25%, it's kind of where we land. Yeah. It's, not bad. now, you know, for, for during your debt after that, but, yeah, it's, it's pretty decent on, on, revenue margins, but I will say this too. And it's the reason I'm struggling to answer some of these is because each of these are their own entities. So like all the, numbers don't get it put into a pool for me. I, they're, they're different. so one of the things with storage is that the smaller your facility, the worse your\r\n\r\n\r\nNik (17:12.028)\r\nWow.\r\n\r\n\r\nNik (17:18.397)\r\nYeah, yeah,\r\n\r\n\r\nNik (17:31.795)\r\nYeah yeah\r\n\r\n\r\nLauren Rothlisberger (17:38.382)\r\neconomic sell -off. Yeah, so like, you know, way better to have more units and your profit margin is going to be much better the more units you have because your costs just don't go up that much.\r\n\r\n\r\nNik (17:39.061)\r\neconomics home.\r\n\r\n\r\nNik (17:51.871)\r\nSo like you were telling me you have two customer service reps, a facilities manager and what were the other positions?\r\n\r\n\r\nLauren Rothlisberger (17:58.766)\r\nThat's it. That's all. I mean, I just have those.\r\n\r\n\r\nNik (18:01.749)\r\nOkay, so if you added, you know, another 350 units, literally double the size, do you need to add like what other positions would you need to\r\n\r\n\r\nLauren Rothlisberger (18:08.11)\r\nMm -hmm. Mm -hmm.\r\n\r\n\r\nLauren Rothlisberger (18:13.42)\r\nI would probably add more hours to my property manager because I don't even have, like they don't even need to work full time. mean, it's not, they cycle the facilities and take care of things. I mean, and that doesn't, they don't do lawn care. Like we pay that stuff out separately, but just on management, I would have to add very little. My customer service reps. The reason I have two is just because like I said, we do shared service. So we kind of roll in answering the phones on both. And so that just gives us more hours of the week and some flexibility, some backup. So it's.\r\n\r\n\r\nIt's kind of paid out almost like time and a half really instead of two full people. So I really wouldn't need a lot more at this point. Sure. There's a point I would.\r\n\r\n\r\nNik (18:49.747)\r\nInteresting. Yeah, yeah. So who does the invoicing? Who does the collections follow up? Who does the contracting? Like all of that administrative\r\n\r\n\r\nLauren Rothlisberger (18:59.126)\r\nall my customer service reps. do all that. So it's not just answering the phones. they do all the making sure that payroll is not payroll, sorry, that all the rent is run and then they chase people down and call and bug them and text them. And they run the auctions process as well. there's a whole process you have to follow every state's different.\r\n\r\n\r\nNik (19:01.202)\r\nokay, so they handle all\r\n\r\n\r\nNik (19:19.893)\r\nAnd are they onshore or are offshore? Okay. So I'm just doing the math in my head, right? Like I have two offshore, even if they're full -time customer service reps, one full -time property manager. I'm probably looking somewhere in the ballpark of a hundred thousand to $150 ,000 a year, fully loaded costs. What are the other, and like, you don't have to tell me high or low, I'm just doing it in my mind. What are the other expenses that you're paying? Cause you're getting to 25 % net margins\r\n\r\n\r\nLauren Rothlisberger (19:23.03)\r\nOffshore.\r\n\r\n\r\nNik (19:49.685)\r\nBut there's obviously I'm getting to 50%. So like, where's the other 25 coming in?\r\n\r\n\r\nLauren Rothlisberger (19:54.082)\r\nYeah. So marketing a lot in marketing dollars, you pay a lot to Google ads. That's definitely where we spend a whole bunch. And especially in the beginning, like I've actually started to pull back some of my Google ads pretty recently because we have a lot more SEO going for us than we did in the beginning. But in the beginning you have nothing. I didn't, I, when I, when I bought my place is I didn't keep any websites. I didn't keep names. I started from scratch. First of all, actually two of them didn't even have websites. So I, I, know, I'm, rebranded like I, you\r\n\r\n\r\nNik (20:19.797)\r\nAwesome.\r\n\r\n\r\nLauren Rothlisberger (20:23.726)\r\nSo I dumped a lot into Google Ads. There's a bunch there. Lawn care, some repairs. the other thing you to, I mean, some of its capital improvements, we do some of that too, but like if a door goes down, it's a pretty expensive repair. So you definitely have these things that chew up your, know, into your operating expense, but marketing is our biggest one.\r\n\r\n\r\nNik (20:45.717)\r\nOkay, I'm gonna drill into marketing. I wanted to circle back on something you said earlier that you said your dumpster rental business was good because you don't have to pay rent because they're housed at one of your locations. You are like paying rent though,\r\n\r\n\r\nLauren Rothlisberger (21:02.662)\r\nLike to the business. Yeah. I mean, I should be paying in it, but I, so let's put it this way. I have it as a line item, but I've only been doing that for like four months. So yes, it should be done that\r\n\r\n\r\nNik (21:09.459)\r\nOkay. I was gonna say like, you could be saving a lot on taxes. If you're paying that.\r\n\r\n\r\nLauren Rothlisberger (21:15.79)\r\nYeah, yeah, yeah, yeah. I'm so early in that business. I haven't done it yet, but I will just because I'm trying to get like cash flow positive on it and it's just don't want to do it yet. But yeah, it's also like a funny one because those are only owned by my husband and I outright. So it's all passed through. So it's going to like, I mean, it's an in its student expense, like in write off, of course, but that one's a little bit different. So right now I have 12. So yeah.\r\n\r\n\r\nNik (21:26.495)\r\nDid you?\r\n\r\n\r\nNik (21:38.965)\r\nHow many dumps do you have?\r\n\r\n\r\nNik (21:43.975)\r\nOkay. You know, I talked to, I did an episode with a buddy Gallo. He's the dumpster rental guy on Twitter. I don't know if he saw that one.\r\n\r\n\r\nLauren Rothlisberger (21:49.378)\r\nYeah, yeah. yeah. Yeah, I've talked to him. I talked to him a decent amount. So not like a we chat.\r\n\r\n\r\nNik (21:55.028)\r\nIt\r\n\r\n\r\nIt was a really, really interesting conversation how he got into it, all that stuff. my takeaway from it was like, all right, if you're to do it, don't just buy one or two dumpsters. got it. There's a certain point where you kind of have to buy at least 10 to 15.\r\n\r\n\r\nLauren Rothlisberger (22:09.39)\r\nyou at a hundred percent. Like you cannot make it on those tiny little numbers. mean, even where I'm at now, like I started this in February, I bought my truck in January and then we had to wait for some dumpsters to come in. So we kind of started in February. I mean, you know, and I've, started with four and got up to 12. Like ideally the thing about this business and I didn't listen to his episode yet, but I imagine he'd echo it, which is like, you need to get to two trucks and the dumpsters.\r\n\r\n\r\nand probably 25 to 30 dumpsters as fast as you can. Because one, if you have one truck, you technically have no trucks. Because as soon as it breaks down, you're in trouble. So you're sort of gambling until then. I'm in the very fortunate position that I have just someone I've befriended that has the same business. We're not really competitors, but he's got two trucks. And so if I got in a pinch, I can like sort of pay him to use his truck for a day or two. So that's kind of my current backup plan. But what's\r\n\r\n\r\nNik (23:05.759)\r\nAnother reason why it's good to be local.\r\n\r\n\r\nLauren Rothlisberger (23:09.11)\r\nYeah, no, exactly. it's, you know, so that's, so we do that, but yeah, I don't think you can survive in this business if you don't get a good number of dumpsters fast and you have to hit marketing really hard. so yeah.\r\n\r\n\r\nNik (23:21.589)\r\nSo on the self storage, talk to me about your customer acquisition costs. Do you know what your customer acquisitions costs are is?\r\n\r\n\r\nLauren Rothlisberger (23:26.862)\r\nYeah, it's about $65 a person. which is in the next question, you're ask me is like, what's your lifetime value? Well, that's where it gets really tricky because it could be, it could be three days, it could be like, I moved in, but then I decided that I didn't need this, I'm gonna move out. And I mean, they paid a month, but like there's it's month to month lease, right? And then you have people that will stay for years and years and pay for the junk that is in there. And it's not all junk. But like, there are definitely people that are paying for junk.\r\n\r\n\r\nNik (23:55.465)\r\nWell, the math I like to do on it is to take your churn. So do you know what your churn is per month?\r\n\r\n\r\nLauren Rothlisberger (23:56.568)\r\nto be in there.\r\n\r\n\r\nLauren Rothlisberger (24:04.866)\r\nlet's see. We, that's pretty small percent. I mean, we have, it's not that high. I, I'm, it's a good question. I mean, we churn like, I don't know, three to five people a month.\r\n\r\n\r\nNik (24:12.201)\r\nGive me a\r\n\r\n\r\nNik (24:19.797)\r\nOkay, three to five people, that's 1%. Sheesh. All right, let's say, that's amazing. That's great, that's great. Okay, so let's, for me, it's just gonna be easier to do this this way. Let's say it's 5%. Okay, that's way, way, way, way, way higher than you are, but let's just say it's 5%. What that would mean is if 5 % churns every single month, it's gonna take 20 months for you to turn everybody over. And so I usually use that 20 month as\r\n\r\n\r\nLauren Rothlisberger (24:24.598)\r\nYeah, it's not that many. It's not that many.\r\n\r\n\r\nNik (24:50.069)\r\nThat's the lifetime length per customer. And so if I'm charging $80 per month per customer and it's 20 months, then what is that? $1 ,600? Yeah. So you've got a pretty good return on ad spend. $65 customer position cost.\r\n\r\n\r\nLauren Rothlisberger (25:01.582)\r\nYeah.\r\n\r\n\r\nLauren Rothlisberger (25:06.978)\r\nRight, right. It's pretty, yeah, I think it's one of things that people like about storage is generally your return on your spend is pretty good. And of course it varies. If you want to get in the nitty gritty, it varies much by unit size. Like the small ones are turned much faster. The big ones, people put too much crap in there, they didn't want to move it. then, so they stick a lot longer. So you get into those economics as well.\r\n\r\n\r\nNik (25:32.149)\r\nHow did you buy your first? Was it just you and your husband? Did you go out and raise money? Did you have just a small lump of cash you bought through the SBA? What did that process look\r\n\r\n\r\nLauren Rothlisberger (25:40.304)\r\nso we tried to go through the SBA originally, did not end up going that route mostly because the seller, who's a friend of mine now, he didn't want to turn over his tax returns, which is a non -negotiable for SBA. like he's just like an, an old, you know, these old kind of, I love them, but old curmudgeon guy just like did not want to do it. and when he, he's the kind of person that's like, he says, no, he's just, that means just means no.\r\n\r\n\r\nNik (26:05.717)\r\nYeah.\r\n\r\n\r\nLauren Rothlisberger (26:07.81)\r\nWe did have a little bit of family help. So my mother -in -law threw in a small amount to the investment and then my husband and I, so it was just the three of us in that one. And the long and the short of it is that we ended up going out to a commercial bank and got a loan, but I had to get a portion of it done with the seller and the broker I was working with. I've really only used a broker one time before,\r\n\r\n\r\nIt was for this first buy and he was like, he's, he's never going to do seller financing. He'll never do it. And I was like, well, I mean, let's just go talk to him. So luckily I persuaded him to do the seller financing and that was kind of what got it over the finish line. so that was, you know, that was that at the time, I mean, it still is now like people buy stuff so much more money, but for me, it was a lot of money to, to make that purchase.\r\n\r\n\r\nNik (26:57.006)\r\nHow big was it? How much did it cost?\r\n\r\n\r\nLauren Rothlisberger (27:00.43)\r\nSo that was like 720 ,000. It was 80 units, I think, if I recall. I've since sold it. I did pretty well on sale. it was just a great learning experience, right? I mean, it was awesome. I kind of figured out like, yeah, this does work. Yeah, I got in the game. sometimes I don't want to say regret. I'd love to own everything I've ever bought. I wish I didn't ever sell anything. But that allowed us to kind\r\n\r\n\r\nNik (27:13.577)\r\nYou got him again.\r\n\r\n\r\nLauren Rothlisberger (27:27.183)\r\nLike I said, take some chips off and then reinvest it into something else that's a better buy.\r\n\r\n\r\nNik (27:28.809)\r\nYeah. I feel the way. I feel the same way. have like my best sale that allowed me to, you know, just have a lot of financial freedom is also the one where I'm like, I wish I wouldn't have sold it. Because I just really like that. I really like that business. But talk me through. Now we get to the to the sexy part. Everybody loves self storage space like Nick Cuber's done an amazing job\r\n\r\n\r\nLauren Rothlisberger (27:41.966)\r\nYeah.\r\n\r\n\r\nNik (27:55.807)\r\nHey, look at me, it's what he started up, know, raises money from people on Twitter and grows a self storage space. What makes it, in your opinion, so attractive to\r\n\r\n\r\nLauren Rothlisberger (27:56.342)\r\nYes. Yeah, yeah,\r\n\r\n\r\nLauren Rothlisberger (28:06.368)\r\nI think what really hooked me was, actually years and years and years ago, my uncle who owned a ton of real estate in Texas was like, you know, self -storage seems like a great thing to buy. and I looked at it at that point in time, but we were just about to move overseas and the whole remote management thing had not really come to fruition. And so was like, I don't know about like having to have someone on the ground and then I'm going to be far. And so I kind of put it on hold. And then by the time we had moved back, you know, the remote management thing.\r\n\r\n\r\nreally kind of worked out. I think that's something that's very attractive. Like I kind of mentioned earlier, I like that you have a lot of tenants. So it felt like the risk was of just going to zero, which was slower. I like that I can dynamically price each and every unit. I mean, I can do it by season. can like, can change it as I need to. So I really like that aspect of it. And I mean, I think the remote thing is, it's pretty big for me. I love that you can kind of set it up and not have to be there.\r\n\r\n\r\nNik (29:03.807)\r\nTotally. What do you think people get wrong about\r\n\r\n\r\nLauren Rothlisberger (29:08.846)\r\nwell, I think what people get wrong about it is occupancy for one thing, which is partially because that's what everybody was told for the last couple of years is that, you know, 95 % occupied, like that's normal. It's not normal. mean, I guess maybe it could be somewhere. I think they also get wrong that it's just a commodity. people are going to go to the place that's close to their house. If it's three miles away, that's pretty much where they're going to go.\r\n\r\n\r\nAnd I mean, again, if they're choosing between a place that's climate controlled and the place that's not, because of what they're storing, sure, that might be a difference, but like, there's nothing you're going to do to storage facility that's going to make them want to drive five, 10, 15 miles away to store something. There's just not. So this idea, like somebody the other day was trying to pitch me like a luxury storage facility. And I was like, I don't even know what that means. Like what are the amenities? I don't understand.\r\n\r\n\r\nNik (29:59.231)\r\nthis. The conversation is reminding me of my conversation with Tyler Purcell, who, who builds laundromats. And he's got this philosophy where it's like, all right, I go and find three laundromats in this small area. And if they are dilapidated, right, they haven't been updated in a long time, that tells me that there's demand, even if the experience sucks. So I'll go find a place in that location after doing a bunch of demographic research apartment complexes, washing, whatever.\r\n\r\n\r\nLauren Rothlisberger (30:06.487)\r\nyeah.\r\n\r\n\r\nLauren Rothlisberger (30:25.888)\r\nMm -hmm.\r\n\r\n\r\nNik (30:28.249)\r\nAnd then I'll build new and I know that there's already demand there. So I'll kind of eat the business of these zombie laundromats. I don't know that it's the same with self storage because self storage requires a lot more real estate, doesn't\r\n\r\n\r\nLauren Rothlisberger (30:43.106)\r\ndoes, it requires a lot more real estate. I think there's something to be said for like, newer buildings, newer doors, drainage is a really big thing. So in some of the older places, you'll see that like the drainage wasn't done right. So you're fighting water all the time. I mean, I would love to build something from the ground up and just now that I know what I know, like do it, do it right. Right. So yeah, we're going to expand on one of our places. just now is not the time to do it, but\r\n\r\n\r\nNik (31:04.661)\r\nYou'll get\r\n\r\n\r\nNik (31:12.693)\r\nTell me how are these businesses valued? Are they on cap rates? Are they on a multiple of EBITDA? Are they on a multiple of the number of units? What does that look like? Cap\r\n\r\n\r\nLauren Rothlisberger (31:22.68)\r\nCap rates. Yeah, the cap rates. So your NOI. Yeah. And that was a huge light bulb moment for me. Like that was kind of what drove me from residential to sort of the commercial side, which, you know, storage is still considered commercial because I was, when I finally understood that like, so the value of this piece of real estate is something that I can make better. And it's not just like what do me and my neighbors sell my house for? I mean, that's in residence, residential, you're so capped at sort of just the comp value. Whereas.\r\n\r\n\r\nIf I can improve the income, which we've been able to do everywhere we go, I mean, it's huge. So, I mean, you can increase your value massively.\r\n\r\n\r\nNik (32:01.493)\r\nCan you can you quickly explain what a cap rate is to people who are like cap rate? What is I just know no cap means not to\r\n\r\n\r\nLauren Rothlisberger (32:06.648)\r\nYeah.\r\n\r\n\r\nRight. So a cap rate is going to be like when an appraiser comes in, this gets very complicated, right? So you have these, the compression of a cap rate. So an appraiser will come in and just say that, you know, you have X amount of income and then we're going to divide it by this cap rate. And they pretty much determine what the cap rate is. They look at the market, they look at what other things have sold for, the type of facility it is, what other, you\r\n\r\n\r\nIs it nice? Is it not nice? All that kind of stuff. And then you divide your NOI by that cap rate, the capitalization rate. That's like basically what saying what kind of income you would make off of it. And then that gives you your value. So it's incredibly subjective. Like it's kind of crazy when you think about how it's done that you're like, this appraiser could basically say that we're going to use this cap rate and it's going to add hundreds of thousands of dollars to the value.\r\n\r\n\r\nNik (33:02.933)\r\nWell, the way that I like to think about it is the NOI, that operating income, is the return. And the purchase price is essentially the investment. And so the cap rate is the expected return on that investment every year. So if you have a property that's doing $200 ,000 a year in profit, NOI, and the purchase price is a million dollars, you would have a 20 cap rate. It'd be a 20 % rate of return.\r\n\r\n\r\nthe better the facility. So the the newer the higher end, because real estate is so stable, the closer it actually gets to like the federal funds rate. So like you be selling these properties for on average a four or five 6 % rate of return. And then the worse they get, the higher the cap rate will go. And those are typically going to be 10, 11, 12, maybe even 50 % cap rates. But I don't think people really understand\r\n\r\n\r\nat least I didn't for long time how that how real estate was valued. But that's how it's that's really how it's looked at is like this net operating income is our return. And so we'll set the price based off off of that. You could say multiples, they're just using a percentage as opposed to a number of multiple.\r\n\r\n\r\nLauren Rothlisberger (34:13.164)\r\nIt is, yeah. And I think what took me a long time to wrap my head around is like, you know, when you're talking about when you're buying something and when you're talking about when you're selling something, you want the cap rate to compress and show the stability of it. That's good for value for you. But when you're buying, don't, mean, high cap rates could be good because maybe there's opportunity there, but also like you can come in with something that actually the revenue is terrible on, but if you know you can improve it. you can't look at it too much when you're buying because\r\n\r\n\r\nEspecially if you're to do value add. I mean, if you're thinking you're buying something stable, that's totally different. If you're to do value add, don't worry too much on what the income is, what is being produced at the time. Just know what you can produce.\r\n\r\n\r\nNik (34:51.989)\r\nSo it sounds like your strategy has been buy, raise rents or rehab, sell, roll it into something else. Is that fair?\r\n\r\n\r\nLauren Rothlisberger (35:00.812)\r\nYes, so far. So far. There's one for sure that I'd like to hold. But yeah, that's kind of where I've been right now.\r\n\r\n\r\nNik (35:10.933)\r\nWhat's your goal over the next, let's just say five years? Where do you see this company going?\r\n\r\n\r\nLauren Rothlisberger (35:16.91)\r\nthat's a great question. I you know, I, I've changed a few times just because I think the economy has made it a little bit harder to get where I want to go. But, I, I generally am like, if I could just add two to three properties a year, that'd be amazing. I've not been able to do that at all the last couple of years. and I'm certainly not going to make bad decisions because, you know, there's a goal. think my long -term goal would be more along the lines\r\n\r\n\r\nbuild stuff, eventually do a sale where it's a portfolio sale, and then get to the point where I'm more an LP side and not running as much. mean, when I look at like a 10 year span, I'm in my mid forties, I'm kind of like, there's a point where I'd be out on the operational side. Like that's definitely the weeds and the grind. I'd like to LP eventually, but I mean, it's tough because you're never gonna make as much money as when you GP on the deal.\r\n\r\n\r\nNik (36:12.947)\r\nWhat do you, what advice do you have for somebody who's mid 20s to mid 30s who wants to get into their first self storage real estate deal?\r\n\r\n\r\nLauren Rothlisberger (36:21.896)\r\nI was very shy and didn't even understand really about the investor opportunity. And it actually took me a long time to take any outside investors. That wasn't like a family member. I was super, super nervous about it. but, and I'm not, I have no desire to be someone that's sort of like, I guess more of the syndication model. Like I'm just taking tons of different investors. That's, and there's nothing wrong with that. mean, there's people that have done very well with that.\r\n\r\n\r\nIt's not my comfort level, but I think if you're in your twenties, find a capital partner, they're probably out there and you just don't realize it. And then do, do something, do a quadplex, you know, something kind of small and learn how to do it. And then you could bring in another partner or two. Like one of my favorite guys that owns storage. mean, his story is just so great. Cause in five years you really went from like single family, just to thousands of units. it, and took.\r\n\r\n\r\nJust a few partners, like people he knew, and they just kind of built and built and built. And I mean, you know, there's some, some boom on your side too, sure. But like, you don't have to, it's not, I think people think it's like all on your own or syndicate with, you know, tens of hundreds of people. you know, and there's an in -between.\r\n\r\n\r\nNik (37:32.883)\r\nWhat advice would you give to, I don't know, someone in their late 30s living in Boise, Idaho, who has some disposable money that would love to get into the self -storage game, but doesn't know where to start? Like, would you tell me not to do\r\n\r\n\r\nLauren Rothlisberger (37:43.214)\r\nLauren Rothlisberger (37:47.338)\r\nNo, no, I wouldn't tell you not to do it at all. I definitely tell you to it because you know all the operations and we didn't really talk about AI and what's coming there. But I think like there's going to be like another iteration of probably more and more automation. Like I've been thinking a lot more about not just how do I increase revenue, but how do I compress my costs even more? Bring those expenses down. Like how can I make that even better? So yeah, I think there's tons of opportunity.\r\n\r\n\r\nNik (38:11.221)\r\nCause I'm looking at making some investments and the two spaces that are the most appealing to me, well, commercial, I'm gonna start with commercial real estate is most appealing to me, but the two spaces within commercial real estate are self storage and mobile home park RV parks. But on the self storage, know that it's not just gonna be, I'll hire an operator or set it and forget it, it's passive.\r\n\r\n\r\nLauren Rothlisberger (38:37.826)\r\nRight, no.\r\n\r\n\r\nNik (38:39.965)\r\nAt the same time, I know it's not going to be as operationally intensive as some of the other businesses that I've run, but I am just trying to weigh it out, pros and cons. What advice would you give to me? Should I partner with somebody? Should I buy something and just take it slow? What would you say?\r\n\r\n\r\nLauren Rothlisberger (38:55.854)\r\nWell, you you're good at partnering things that probably find part and you guys do this right like you do the partner with an operator you can probably find a young operator that's gonna Do most the operations for you and then get a of the equity and you know That's one of your playbooks So the other thing I look at is like and this is it I'm in the process of building one of these right now is more the trade contractors so very similar to self storage But you're talking like I'm doing a 12 ,000 square foot building\r\n\r\n\r\n1500 ish bays, about eight bays. Those numbers aren't quite right, but that's generally what it is. And that's kind of this nice blend between like some of the good stuff about self storage, but some of the good stuff about industrial. it kind of meets in the middle. Leases are still shorter, not quite as as self storage.\r\n\r\n\r\nNik (39:37.429)\r\nYeah. It's fun. wanted to get into that, but I'm like, okay, we're already at 40 minutes. But like that was going to be one of my questions because you're kind of already doing that with your dumpster rentals, right? It's just about now like expanding it. And you said you were building, you were doing additions. I didn't know if that was going to be a part of the strategy or not.\r\n\r\n\r\nLauren Rothlisberger (39:44.75)\r\nYeah,\r\n\r\n\r\nLauren Rothlisberger (39:56.876)\r\nYep. Yeah. I have one place I'd like to expand and that's part of why I haven't done it yet is I'm like, do I expand self storage or do I actually expand something a little more business oriented? on the self storage, you're very B2C. I mean, you may rent to a small business, but it's still pretty much a B2C thing. Whereas if you start to go into trade contract or storage and then of course into just a flat out industrial building, you're getting much more of your business, the business side. And there's something nice about that. I mean, we deal...\r\n\r\n\r\nI like a lot about self storage, you definitely deal with some questionable individuals. I just had my first real sting operation the other day to get these people out that I was like, I don't know what you're doing wrong, but I just know you are. So you have some of that stuff, but every one of these businesses comes with a downside. You just have to pick it. But yeah, I think I'd look at any of that stuff.\r\n\r\n\r\nNik (40:29.635)\r\nyeah. yeah. yeah.\r\n\r\n\r\nNik (40:41.471)\r\nNik (40:52.149)\r\nOkay. All\r\n\r\n\r\nLauren Rothlisberger (40:53.334)\r\nIt's tough to buy existing because the prices are so dang high. If you can find anything off market, but I mean, even that's hard right now because everybody's attacked any, any, anything you can find online. People like every VA under the sun is called for, you know, on some acquisitions team. And the other, the other part about it is that they told a lot of these owners like some pretty crazy numbers. So it's really hard to get them back to the reality.\r\n\r\n\r\nNik (41:09.203)\r\nIt's ridiculous. It's ridiculous.\r\n\r\n\r\nNik (41:21.993)\r\nYeah, they're still stuck. They're still stuck at a lot of those high valuations that we had during the bubble. All right, I got some rapid fire questions to end this. You ready? All right, what do you love about this business?\r\n\r\n\r\nLauren Rothlisberger (41:23.628)\r\nYeah.\r\n\r\n\r\nLauren Rothlisberger (41:35.682)\r\nwell, I love that it actually is, flexible. And I mean, that was huge to me. Like, again, I've, I've got four kids. I do. I, you know, I have a crazy life and the fact that I could kind of do this on the go and be flexible and be where I want to be at the same time, like it's pretty incredible.\r\n\r\n\r\nNik (41:51.529)\r\nWhat do you hate about\r\n\r\n\r\nLauren Rothlisberger (41:52.814)\r\nI don't, I, there's actually nothing I hate about it, but, I, you do sometimes deal with some people that are less than, you know, they're not the most upstanding citizens. so, and I'd like to think that it's just me and like, like my crappier storage, but I have a feeling that you come across those people. It's either you go like the entitled row and they're mad, or you go, they're like, just maybe not the salt, you know, not the best people in the world. So yeah, I mean, that's, it's not, it's not great, but I don't hate it.\r\n\r\n\r\nNik (42:22.565)\r\nI like this question. What businesses or industries are you the most jealous of? It's funny because your business is the one I'm the most jealous of right now. So curious to hear what you're doing.\r\n\r\n\r\nLauren Rothlisberger (42:30.894)\r\nWell, I've recently decided that being in site work might be one of the best things you could ever be in. So, so, so when you go to build a building and you have to get it graded and the whole land made to whatever it needs to be, right? Whatever the engineers have said, mean, retention ponds, whatever, I mean, they make an unbelievable amount of money. like around the range of about, at least in my little area, which is probably much lower than most places.\r\n\r\n\r\nNik (42:39.529)\r\nI don't look at\r\n\r\n\r\nLauren Rothlisberger (43:00.398)\r\n$3 ,000 a day, $5 ,000 a day, like, and they move around dirt. And I'm not saying that what they're doing is not important, but I mean, they rake in money. And if you're in an area of growth, you know, I think it's just that you, I think it depends on how you run it. Like there's a lot of equipment, right? So you're, you know, you've got to, I've never even looked at all the numbers because I actually don't want to sit in that vehicle, but I'm fascinated by the fact of how much money they make.\r\n\r\n\r\nNik (43:10.101)\r\nAnd their cat tax is probably crazy,\r\n\r\n\r\nNik (43:26.897)\r\nI love that answer. It's first time I've heard that answer. Now I have a new business for research. If you have two hours in your day and you don't have business responsibilities, you don't have family responsibilities. What are you obsessed with? What are you spending your time\r\n\r\n\r\nLauren Rothlisberger (43:29.836)\r\nYeah, you're a little looking good. It's wild.\r\n\r\n\r\nLauren Rothlisberger (43:43.914)\r\nI really love just reading and listening to business. Like, I mean, I, I love the podcast. I like just, I don't know, I I just think it's super interesting. right now I've definitely been diving into sort of the AI world to see what that's going to look like. I'm old enough to remember when the internet came to fruition and it feels a little like that. I'm not someone that thinks robots are going to take over the world, but I do, I do think that\r\n\r\n\r\nIt's more of just a leveraging tool. Like I think the tool sets that are going to start coming out are going to be amazing. Like I think we're really going to see some, pretty cool stuff.\r\n\r\n\r\nNik (44:18.613)\r\nAgreed. What advice would you give yourself 10 years ago?\r\n\r\n\r\nLauren Rothlisberger (44:22.798)\r\nbuy commercial real estate sooner.\r\n\r\n\r\nI mean, I just wish I had done it like earlier for sure. I, I couldn't figure out how to do it and I didn't really know who to ask. And truly getting on Twitter was like life changing to me. And I know that sounds very extreme, but like, just all of a sudden was like taught things that I, I just never had exposure to.\r\n\r\n\r\nNik (44:49.141)\r\nWell, Lauren, this has been a fantastic conversation. You're obviously exceptionally bright, hardworking, driven. I love your investment philosophy and thesis. I think that it's a breath of fresh air in a world of people just trying to get to $50 million in one year. So I appreciate you being candid and open and coming on and sharing your stuff. Where can people come find\r\n\r\n\r\nLauren Rothlisberger (45:05.411)\r\nYeah.\r\n\r\n\r\nLauren Rothlisberger (45:11.662)\r\nI am on Twitter. think I'm a LC Rothfussburger. and I'm on there. I'm, haven't been as active this summer because, honestly, my kid, my kids have sucked the life out of my Twitter, my Twitter life, but, in a good way, in a good way, trying to kind of lean into the summer. But yeah, I'm on there. I mean, and then I'm pretty easy to find from that\r\n\r\n\r\nNik (45:33.685)\r\nCool. Well, I can't wait to check in with you in a year when you've got 7 ,000 units under management.\r\n\r\n\r\nLauren Rothlisberger (45:39.67)\r\nYeah, not likely, but I will keep kind of, you know, we keep just grow slow and nothing wrong with that. So I appreciate you having me on. It's fun.\r\n\r\n\r\nNik (45:48.757)\r\nOf course, of course. All right, well, we'll talk\r\n\r\n\r\nLauren Rothlisberger (45:51.64)\r\nAll right, sounds great. Thanks.\r\n\r\n\r\nNik (45:52.863)\r\nYeah.",
  "metadata": {
    "duration": "",
    "date": "2024-09-13",
    "platform_source": "Google Drive"
  }
}