{
  "episode_number": "62",
  "episode_title": "From Architect to Developer: Managing $350M Projects with Antonia Botero",
  "guest_name": "Antonia Botero",
  "business_name": "Mad Project",
  "transcript": "﻿Nik (00:00.748)\r\nAll right, Antonia, welcome to Niconomics. I'm really, really excited to have you here. Let's just get to the meat and potatoes. Tell me, what is your business and how do you make money?\r\n\r\n\r\nAntonia (00:11.386)\r\nThanks for having me, Nick. This is super exciting. My business is called Mad Project and we are a development management company. Essentially, we manage real estate development projects for other people. And that's basically how we make money.\r\n\r\n\r\nNik (00:26.712)\r\nSo I'm gonna ask you a bunch of dumb questions, because I don't know. There is a weird overlap between SMB Twitter and real estate Twitter, but I don't really know real estate Twitter. many of these questions are gonna be really stupid. But when you say development, are you talking about commercial projects? Like we bought some ground and we wanna build something from the ground up, or are you residential, custom home builds, those types of things?\r\n\r\n\r\nAntonia (00:49.655)\r\nSo we do mostly commercial projects, either multifamily or hospitality. That's sort of the niche where we play. We've also done some master planning resort communities. And it's mostly in the commercial space where the projects are part of an investment process rather than them being single family homes.\r\n\r\n\r\nNik (01:12.056)\r\nSo I talked to Marilyn Motinger. Have you seen her on Twitter? she's freaking awesome. And I felt like such an idiot talking to her. Not because she used a bunch of fancy words, but she explained it so simply to me that by the end of it, I was like, yeah, how did I not know that? It seems so obvious. But she's focused more on residential. And she talked about what her firm does, which is playing the quarterback, everything from design to architecture.\r\n\r\n\r\nAntonia (01:15.608)\r\nOf course, she's a friend. She's great.\r\n\r\n\r\nNik (01:41.644)\r\nmarkets, manage the sub crews and all that stuff. What does it look like for you? Are you playing just the quarterback advisory role or do you have more of a hands -on role in the projects you develop?\r\n\r\n\r\nAntonia (01:47.834)\r\nThank you.\r\n\r\n\r\nAntonia (01:54.724)\r\nSo that's actually super interesting starting point comparing to Marilyn and how she works because she is an architect, like you said, in the residential world and she also does some commercial work too. And that background of being the quarterback really comes from that architectural training where you're managing all the consultants. And in Marilyn's case specifically, she also worked for a general contractor so she has that experience.\r\n\r\n\r\nIn that same, in that way, we're kind of similar. Like I'm also an architect. That's my background. I am registered in several states and I've also worked for a general contractor, but I've worked more specifically in the very large commercial side of things. She kind of went into the side of residential architecture. I basically always worked in commercial architecture. And as soon as I became a registered architect, I jumped ship and I went to work in development. So.\r\n\r\n\r\nwe kind of just took very different routes, but we do have that similar sort of background in architecture. She's also like, she's taught, she's fabulous, by the way. She's so great. So I went more like into the commercial development world from the beginning. Even when I was an architect, I was working on commercial development projects as an architect. So that's really kind of the big difference. But again, that quarterbacking and that kind of management of the work and management of\r\n\r\n\r\nNik (02:59.084)\r\nShe's very smart.\r\n\r\n\r\nAntonia (03:17.996)\r\nof the whole team really comes from a background in architecture, I'd say. What happened?\r\n\r\n\r\nNik (03:23.077)\r\nhold on, I'm gonna pause it because my camera just went off. That's super weird. Hold please.\r\n\r\n\r\nNik (03:33.646)\r\nLet's see if that will fix it.\r\n\r\n\r\nNik (03:38.946)\r\nAnd we're back. All right. So when Marilyn broke it down for me, she talked about all the different phases, right? There's like the initial design, you're working with the architecture, you've got to get an estimator out, and then you bring the sub, or not the sub, but the general contractor in, they work with a bunch of subs. Is it the same? I mean, obviously it's not the exact same, but are those the same pieces when you're dealing with commercial development projects like you're dealing with, or are they different pieces?\r\n\r\n\r\nAntonia (04:06.466)\r\nYeah, they're different pieces. They're the same pieces generally for the actual project, but the way that we're involved and because of my background, like I shifted into development fairly quickly after I became registered. So I do have the architectural background, but then I went on to work in fully in -house for a real estate developer. And then you begin to see the different aspects of the work that happened before you even hire the architect or the design team at all. So.\r\n\r\n\r\nNik (04:34.979)\r\nMm.\r\n\r\n\r\nAntonia (04:35.47)\r\nWe would look at, you know, generally like market data, understanding like what kind of product you're going to bring to the market, like why understanding the investment thesis, looking through like financials, understanding where you're going to get your money from your equity, your debt, like that kind of stuff, the strategy behind it, the strategy behind your media, your marketing, your it really, it's all the stuff that even happens before any of those pieces come into play. So once you get to that moment, the pieces are the same, but\r\n\r\n\r\nNik (04:56.45)\r\nHmm.\r\n\r\n\r\nAntonia (05:05.75)\r\nI began to see the process and work for companies that handled the process before those pieces even came into play.\r\n\r\n\r\nNik (05:11.886)\r\nInteresting. you're maybe I'm maybe I'm wrong. It sounds like on the commercial side, because it's a business, there's a lot more forethought into the marketing of it, as well as the financing pieces, the business model of it, because like, are you trying to pre sell those units, potentially before you even break ground?\r\n\r\n\r\nAntonia (05:30.488)\r\nYeah. Right. Yeah. And not only that, but also you have to understand what kind of units you're bringing into the market. Like what audience are you targeting? And once you understand what audience you're targeting, that should come before the design of the units. Yeah. You're not going to build the same if you build like market rate apartments versus let's say like a luxury condo. Like it's a completely different process. It's a completely different unit size, different finishes.\r\n\r\n\r\nNik (05:45.882)\r\nAntonia (05:58.094)\r\nprobably a different neighborhood in most major metro areas. So understanding all of those things and really kind of how you approach that work. And don't get me wrong, a lot of architects are able to help a little bit with that. But because their focus is so deep into the detailing and managing the team, that it really is the developer's job to ensure that whatever it is that they're bringing to market is effectively going to sell because that's\r\n\r\n\r\nhonestly at the end of the day, you make money for your investors and now you're seeing business.\r\n\r\n\r\nNik (06:30.008)\r\nSo after you graduated with your degree in architecture, you went and worked for a real estate development firm doing these types of things?\r\n\r\n\r\nAntonia (06:35.802)\r\nNo, so I graduated in 2008. So there was no jobs to be had. We were basically told, you're all going to have to go to grad school because nobody's getting a job here. So I went on to grad school and I got a degree in urban design. And from there, I went and I worked for a large architectural firm in Manhattan doing commercial projects, commercial development projects in New York. So I basically worked for an architect\r\n\r\n\r\nwho did all of these projects for developers. was a staff architect and we did work all the way from feasibility to, sometimes they needed certain models done, ensuring how many units can you get, can you squeeze it to the site, like what massing needs to look like. So we would work, even New York has very complex zoning. So we would work with zoning council to make sure that your massing is correct.\r\n\r\n\r\nNik (07:09.39)\r\nAnd what did you do for them? Were you an architect?\r\n\r\n\r\nAntonia (07:35.851)\r\nThen we would do all the layouts, do all the schematic design, make sure that, you sometimes we had a lot of historic preservation components to it because you are in New York, so you're working with existing buildings or an historic district. So we would then make sure all those presentations were adequate to get all your approvals through historical preservation and also through building departments.\r\n\r\n\r\nNik (07:55.746)\r\nThat piece that we were just talking about, the like, I don't even know, market analysis or, you process, et cetera. Do you offer that in your current firm? Okay, how did, so how did you learn that? That seems like a very specific skill set that you're not necessarily taught in architecture school, unless I'm sorely mistaken.\r\n\r\n\r\nAntonia (08:01.237)\r\nYeah.\r\n\r\n\r\nAntonia (08:04.848)\r\nYeah, we do that. We do that.\r\n\r\n\r\nAntonia (08:13.83)\r\nNo, no, you're right. As an architect, think you understand that it's a force and an important part of development, but it's not necessarily where the majority of the focus is for an architect. think for me, a lot of that, and really when I came to understand that was when I went to work in development. So I worked in architecture. I practiced for a while. I became registered. And then I went to work for a real estate developer in Manhattan.\r\n\r\n\r\nAnd that's where I began to really understand the sales and marketing and sort of the planning stages that happened before you engaged the design team. So that's where I picked up a lot of that sort of knowledge.\r\n\r\n\r\nNik (08:50.958)\r\nGive me an idea of the size and scope of these types of projects, either that you're working on now or that you were working on, just so can have an idea of what's a commercial project.\r\n\r\n\r\nAntonia (09:02.554)\r\nYeah, well, mean, obviously you can have commercial projects that are $2 million. But I was working in large scale stuff in Manhattan. The first two projects that I worked in development in New York were each half a million square feet. They were office to residential conversions. So we converted office buildings into apartments. So I wouldn't say that a lot of people have had that kind of experience, but that's where I started.\r\n\r\n\r\nNik (09:29.198)\r\nHow do they charge? Like, do they charge by the square foot? Are you like, well, it's a half a million square feet and we typically charge $10 a square foot. And so it's $5 million for this project. I have no idea how the pricing works.\r\n\r\n\r\nAntonia (09:40.602)\r\nYeah, that's a good question. there's several people who make money off of this, right? So the developer obviously has some fees. Generally, a development fee on a project this size is somewhere between 3 and 5%. And that gets charged to their investors. And that's upfront. And that's part of your business model and what you present to the people that you're raising money from. As basically an owner's rep or development manager, which is what we do now, it is industry standard to charge a percentage of the cost of the work that you're managing.\r\n\r\n\r\nSo sometimes that means a percentage of the cost of the work of the design team and the construction. So it varies depending on project size. It could be somewhere between 3 and 10%. Again, the larger the project, obviously the smaller the percentage you're going to be charging. But we don't charge that way, not my company. So just because it's a terrible incentive, I think. Yeah. Yeah.\r\n\r\n\r\nNik (10:35.054)\r\nOkay, well, I'm going to get to how your company charges in a little bit, but I'm trying to address wrap my mind around like a half a million square feet sounds like a lot to me. What what does that translate to in dollars? Like what is the the total cost not not just to your firm that was designing it, but like the development cost for that conversion.\r\n\r\n\r\nAntonia (10:43.117)\r\nIt's large.\r\n\r\n\r\nAntonia (10:48.835)\r\nYeah!\r\n\r\n\r\nAntonia (10:52.346)\r\nYeah, I mean you're looking I mean and I can't speak specifically about those projects for multiple reasons but I could tell you something like that in New York is probably gonna be somewhere between definitely north of like 300 million dollars and I would say somewhere between really you know five and eight hundred million dollars today if you were to do between the acquisition cost and the cost of the work that's what you're looking at.\r\n\r\n\r\nNik (11:12.748)\r\nWow.\r\n\r\n\r\nNik (11:16.43)\r\nCould you? Okay, let's just I'm just going to use because I'm a simple I'm a simple man, Antonio. Let's just use 500 million because that's like an easy number 500 million for 500 or half a million square feet. If I were to do that same project in say, Dallas, or just pick any other city that's like lower cost. What would it what would it like comparable cost be to do that same element?\r\n\r\n\r\nAntonia (11:26.319)\r\nYeah.\r\n\r\n\r\nAntonia (11:38.542)\r\nYeah.\r\n\r\n\r\nAntonia (11:41.914)\r\nHmm. That might be tough. don't know. We would have to pick a specific specific market because every market is really different. Like we've built in about 35 different jurisdictions at this point across the U .S. And whenever we price things, it can vary tremendously. mean, obviously, commodities are commodities and they cost what they cost. But your labor costs are going to be super different in Houston versus New Jersey.\r\n\r\n\r\nNik (12:09.036)\r\nIs there a market outside of New York that you know really well?\r\n\r\n\r\nAntonia (12:12.57)\r\nI mean, I know a few markets really well at this point from having worked in them.\r\n\r\n\r\nNik (12:17.045)\r\nOkay, name one, name one that you know really well.\r\n\r\n\r\nAntonia (12:20.986)\r\nI mean, I know Salt Lake City pretty well, actually.\r\n\r\n\r\nNik (12:23.97)\r\nOkay, Salt Lake City, if we were to do a half a million square foot commercial project in Salt Lake City, give me like a ballpark range of like similar to the one you did in New York, right? You're converting converting. Yeah, you're good. You're either owning a friend or using your calculator.\r\n\r\n\r\nAntonia (12:32.142)\r\nlike residential.\r\n\r\n\r\nAntonia (12:36.602)\r\nI'm using my calculator, so let me... I mean, here's the thing, and I'll just caveat that. That project in New York, the one that I can speak to, there is some... This is all public. Like, Tony Broad Street, it's actually been in the news recently. I won't talk about that part. But it was... I know that it was a ground lease from tornado at $185 million. That was the acquisition of the building, essentially.\r\n\r\n\r\nAnd then the actual work originally, the owner of the development company has been quoted saying that the work was going to be $100 million. But that was like back in like 20, I want to say 2015. The work ended up being more than that, but not, you know, not insanely more. But at the end of the day, like, let's say it was another 150, you're talking about a $300 million.\r\n\r\n\r\nNik (13:20.428)\r\nyeah, way too\r\n\r\n\r\nAntonia (13:34.106)\r\nProject All -In and that was converting 500 ,000 square feet of office to residential. Now, if you look at Salt Lake City, I don't know that we have a 500 ,000 square foot building to convert to residential.\r\n\r\n\r\nNik (13:43.79)\r\nNo, no, you don't. I'm and I'm not trying to trap you. I'm just trying to like, okay, if it's 300 million in New York, is it is it 200 million in Salt Lake? Or is it like 50 million in Salt Lake? You know what mean? I'm just trying to like, get an idea.\r\n\r\n\r\nAntonia (13:49.441)\r\nYeah.\r\n\r\n\r\nAntonia (13:55.13)\r\nYeah, so yeah, it's such a hard question to ask. Let me see if I can answer it in a different way. If we, for example, if I'm looking at new construction in Manhattan, which I am, and I'm looking to do luxury residential, I am going to be underwriting things depending on the neighborhood because that has access implications and level of finishes that I'm looking at. At somewhere between $700 and $850 a square foot for new construction, right?\r\n\r\n\r\nNik (14:01.346)\r\nThat's okay. That's okay.\r\n\r\n\r\nAntonia (14:24.538)\r\nIf I'm underwriting the same thing, if I'm doing like the highest end thing that I could possibly do in Salt Lake City, and I'm looking to underwrite that for new construction, I would probably be underwriting that at like 450 to 500.\r\n\r\n\r\nNik (14:41.58)\r\nit's way lower. Yeah. Dude, why did my camera shut off? I'm gonna have to mark this again. I promise this, I promise this never happens. Hold on, hold on. Let me just.\r\n\r\n\r\nAntonia (14:42.969)\r\nYeah.\r\n\r\n\r\nYeah, we lost you. We lost you. That's okay.\r\n\r\n\r\nNik (15:04.858)\r\nWell, if it happens again, I'll just have to...\r\n\r\n\r\nNik (15:11.002)\r\ndo the same thing.\r\n\r\n\r\nNik (00:00.846)\r\nAll right, so from 750 to 450 is $300. it's almost a 50 % reduction. crazy. Tell me, now that I let us down that rabbit hole for no good reason, I'm sorry. When did you kind of have the moment where you were like, I should start a business around this. I think I could actually go out on my own.\r\n\r\n\r\nAntonia (00:09.439)\r\nCorrect. Yeah. Yeah. Yeah.\r\n\r\n\r\nAntonia (00:25.128)\r\nand\r\n\r\n\r\nNik (00:28.886)\r\nYeah, just walk me through kind of what you were thinking and why you decided to make the leap.\r\n\r\n\r\nAntonia (00:30.931)\r\nYeah. So there were a few things. think, you know, the first thing was when you kind of really get into development, you work for, so I worked for that developer in New York and then I worked for another developer who did national projects, but they were a REIT. So, and I think that that was the first time once I really started understanding how the REIT worked and how the fees worked. I had a P &L for my team at the time when I was there and think very quickly, you realize like how much\r\n\r\n\r\ndevelopers are charging their investors for the work and then the salaries for the team that you actually need to do the work. And there's a good arbitrage there. So I think at one point, obviously, there was that sort of economic aspect of it, obviously. But going out on air, there's no joke, right? Especially in an industry where so much of it is based on reputation and word of mouth. So\r\n\r\n\r\nNik (01:09.059)\r\nHmm.\r\n\r\n\r\nAntonia (01:27.999)\r\nthere's a real consideration there where like it's not just the money. So at one point I did realize that if I did go on my own that I was going to be making a whole lot more money than I was working for someone else. And the value that I was bringing to my clients was probably also going to be well beyond what they would be paying me anyway. So it was a great value prop there.\r\n\r\n\r\nNik (01:49.07)\r\nLet me dig into this because that is interesting what you said. I'm trying to wrap my mind around it. In my mind, the developer goes and says, hey, I found this piece of ground and I want to build this project and the project's gonna cost $100 million. But after it's done and we get it stabilized, it's gonna be worth $200 million. And so there's a delta there. And as the developer, I take a certain percentage of that delta.\r\n\r\n\r\nthe investors get the rest of the Delta. But it sounds like what you're saying is because there are fees associated with building it, they're also passing that through to the investors and it's not just like an at cost thing there. Or are they saying it's at cost and they're just marking it up?\r\n\r\n\r\nAntonia (02:34.645)\r\nCorrect.\r\n\r\n\r\nNo, when you're doing commercial work, it's fully audited and investors can see what they should be able to see what your costs are. But the developer has to charge for, you need a team to build these projects, right? Like you've got half a million square feet, you're going to have two or three people working on that thing. It's an incredibly stressful job for the project managers, especially if they're on site, they're there every day. You're going to have people who have degrees, qualifications. There's another aspect to\r\n\r\n\r\nget paying your project manager as well, but I'll touch on, but that costs money that that has, that's like a real cost. And so just the same way that, there are some reimbursable costs or fund or, or an SPD, a developer will go and charge investors for it. They'll say, look, these are my reimbursable costs, but also like, it's going to cost me. I don't know, 5 % to do this. and there's a lot of conversation around.\r\n\r\n\r\nespecially around syndicators who do sort of smaller commercial stuff, they charge like really high fees. Sometimes you'll see projects that don't have a meaningful amount of project management or like, let's say that it's not development, but let's say it's value add. And you'll see a syndicator charge like 8 % on construction. And you're just like, what are you doing? Like there isn't like, you're not really managing that much. Like why are you charging that much money? And there's a huge debate. Yeah.\r\n\r\n\r\nNik (03:58.574)\r\ninteresting. So that so that he can be gray, right? You're like, it's 5 % or it's 8%. And like, well, you know, we, have an on staff music therapist that helps our team relax so they can design the best, I don't know, architecture, whatever in the world. That so that's what you're talking about is like, hey, there's, there's a big delta there. So there's economic incentive that isn't necessarily aligned with the investors. And then from your from your perspective.\r\n\r\n\r\nAntonia (04:13.277)\r\nYeah.\r\n\r\n\r\nAntonia (04:22.068)\r\nYeah.\r\n\r\n\r\nAntonia (04:25.439)\r\nRight.\r\n\r\n\r\nYeah, I mean, you do want them to charge some fees. You do want them to hire a good team, right? But there's sort of that, there's a line there, right? Where beyond a certain point, are you really paying a good team? Are you just making a bunch of money on fees from investors? And regardless of how the investment goes, you're going to make money anyway. And that line is a, it's a fine line. It's a real conversation to have. And it's a real question to ask sponsors, developers.\r\n\r\n\r\nNik (04:33.016)\r\nAhem.\r\n\r\n\r\nAntonia (04:54.767)\r\nWhat are you doing with that money and like, how are you thinking of it? And why do you think that percent is fair? And there should be an answer to that.\r\n\r\n\r\nNik (04:59.256)\r\nSo when, I think, yeah, I think that's, I think that's a good question. Was that a question that was a driving force for you to decide to go out on your own or is it just looking back that you're like, that's why we've been successful is because this is a differentiator that we're able to offer.\r\n\r\n\r\nAntonia (05:13.909)\r\nSo, I mean, it's a mix. I think understanding the economic component and how the fees worked was one of the catalysts for me to think about, okay, well, a developer is charging 5%. They don't necessarily want to build the team that you need that is gonna be sort of institutional level and highly qualified to do the work the way that my experience follows, which was institutional. I worked for major developer in Manhattan. We have that experience.\r\n\r\n\r\nhiring me full time and hiring two project managers to sort of do all the strategy that we do, plus all the technical stuff that we do would probably cost, I would say, I always say it's like the million dollar team. So it would cost you a boatload of money to keep us on payroll. And if you don't have the pipeline to do it, it doesn't make sense. So at that point, the best value prop that you're going to have is hire somebody that will work per project.\r\n\r\n\r\nAnd there are fees that you're charging investors that are tied to that project. So you're not having to carry all these people as part of your payroll. And real estate has cycles, right? So up and down, up and down. Like, what do you do with all these people who are now on your payroll who, if there's a change in rates, now you can't make a few deals pencil. And so what do you do? Do lay them off? Like, what do do? So my answer for some people is don't hire an in -house team at all.\r\n\r\n\r\nThat's why owners' exist. And that is not something I invented. That's just the industry. Where I found that we had an edge and a much better way of approaching it is, number one, in the way that we manage the work and the way that we structure our fee, just because I think it's a better model versus the typical charge as a percentage of the construction costs, because it's a terrible incentive.\r\n\r\n\r\nSo I think, and I managed reps while we worked for developers, like there were reps that we hired for themes, especially for the national read because we had worked all over the place, it super big. I was at the beginning of the creation of that team and prior to that, they hired reps. So seeing how they charged and there was a lot of, it wasn't a super transparent process. So there were a lot of lessons from the managing reps that I learned that I said, you know.\r\n\r\n\r\nAntonia (07:39.391)\r\nIf I were to do this on my own, these things are things I wouldn't do that.\r\n\r\n\r\nNik (07:42.35)\r\nokay. So you you were managing these owners reps, the ones that you're saying is like, hey, don't bring an in house team, just consult with us when you need projects done. I think one thing that's interesting that I didn't really think about is, have you heard of cost plus with the government? I don't know about real estate, but in the government, they sign a lot of these defense contracts. And their cost plus right and surprise, surprise all of the contracts tend to go over budget. So weird.\r\n\r\n\r\nAntonia (07:47.124)\r\nYeah.\r\n\r\n\r\nAntonia (07:58.057)\r\nYeah.\r\n\r\n\r\nAntonia (08:04.145)\r\nYes, cost plus control.\r\n\r\n\r\nAntonia (08:10.645)\r\nCorrect. Yeah. Yeah.\r\n\r\n\r\nNik (08:12.014)\r\nAnd so there is this economic incentive, or at least there's an economic disincentive for them to be efficient. right, because you know, where is the penalty? Whereas with with you, it sounds like your company is not necessarily charging a percentage base, they're they're a fee based firm. Okay. What year was it that you decided to go out on your own?\r\n\r\n\r\nAntonia (08:19.157)\r\nCorrect.\r\n\r\n\r\nAntonia (08:28.917)\r\nCorrect. Yeah.\r\n\r\n\r\nAntonia (08:35.317)\r\nSo I officially started my company in 2017 and that initial motivation was less about the economics of it and it was more about really thinking that, you know, in development and construction, we, you know, we're not saving lives. It is super stressful. Like we do have some projects where if you don't open a hotel at a certain date, you're losing like a hundred thousand dollars a day and that's real pressure. Yeah. So that...\r\n\r\n\r\nNik (08:59.95)\r\nShe's the man.\r\n\r\n\r\nAntonia (09:04.117)\r\nI think despite understanding that it was a high pressure environment, high pressure job, you didn't need to make people's lives miserable and you didn't need to be a horrible human being in order to. And that was my initial that I, so I started my company in 2017. So before I, before I worked for the REIT, I sort of got to see a lot of how development worked and how people treated other people. And I said, you know,\r\n\r\n\r\nI think there's a better way. And if you really truly believe that like, open up your own shop. So I started just doing side work for like friends in New York, people who didn't necessarily know how to go through building department process. So that's kind of how I started. then, and then just doing side things like building conditions reports and all kinds of other architecture adjacent things that touch development in some ways.\r\n\r\n\r\nNik (09:45.04)\r\nMm\r\n\r\n\r\nNik (09:59.534)\r\nI talk to people a lot and I'm like, in my mind, the safest way to enter entrepreneurship is to launch a business or an agency around you and your specific skill set, right? Because it's like, I know how to do this stuff. I'm already getting paid X number of dollars, I can do it. And you're like, super smart, you're charismatic. I'm sure you connected really well with people that you're working with. Did you find it easy though to effectively replace your income or like how long did it take you to get to a spot where it\r\n\r\n\r\nAntonia (10:09.737)\r\nYeah, yeah, yeah.\r\n\r\n\r\nAntonia (10:28.564)\r\nYeah.\r\n\r\n\r\nNik (10:29.052)\r\nyou felt good about where your business was.\r\n\r\n\r\nAntonia (10:31.541)\r\nYeah, I mean, that's a good question. I started officially in 2017, didn't fully go all in until, so I moved to Utah for family reasons. And the idea was that when we moved to Utah, I was going to wind down at the rate where I was working. I was on a plane 10 ,000 miles a week. was insane. It wasn't sustainable. So I was like, I'm going to open up my own shop. I'm just going to do national work and it's going to be chill. And then COVID happened. And so my entire team got laid off and I had...\r\n\r\n\r\nNik (10:47.267)\r\nNON\r\n\r\n\r\nAntonia (11:01.237)\r\n23 open contracts across the country, I needed to make sure that we didn't get sued and I ended up having to stay for longer than I expected. But at the same time, I knew that that team was winding down. So I was also going to be let go at some point. So I had to start immediately. So it was one of those like, it took me longer than I would have wanted to be on my own. But at the same time, I had to start my shop quicker than I had expected. It was this very weird COVID related. Yeah.\r\n\r\n\r\nSo I started my company and no employees. I really, more than anything, we're in lockdowns. I'm in Utah. I don't know anybody. I don't have a network. My entire network's in New York. I did have some national contacts just because I had been doing national work for the rate for about two years at that point. And so I got on social media and I just started posting and I started meeting a bunch of people. And sort of it was weird because we didn't know.\r\n\r\n\r\nhow well the economy was gonna do during COVID. So those first months were really strange. And then I was fully, fully on by the middle of, I would say 2020, because what I did is, what you're supposed to do when you open up a new shop is you pick up the phone, you call everybody and you tell them like, hey, I'm doing this. And so it's the middle of COVID, like things are really weird. And I'm calling everyone, I'm like, guys, I'm like, I started a new company. Doing work that I remember when I started, someone that I'm super close with.\r\n\r\n\r\nNik (12:20.642)\r\nyou\r\n\r\n\r\nAntonia (12:27.509)\r\nwho is in the industry was literally like, what are you doing? Like, nobody knows who you are. Like, how are you going to get clients? And I was just like, watch me. So we, I basically called everyone. Yeah, exactly. Essentially by the end of 2020, I had fully replaced my, like I was already making more money. I had fully replaced my salary. I was making more money on my own than I was as an employee.\r\n\r\n\r\nNik (12:36.558)\r\nSkip on shoulder, activated.\r\n\r\n\r\nNik (12:55.201)\r\nMm -hmm.\r\n\r\n\r\nAntonia (12:55.677)\r\nimmediately. it was, it it took, I want say maybe like two months and I had more. Yeah.\r\n\r\n\r\nNik (12:59.171)\r\nWow.\r\n\r\n\r\nNik (13:03.252)\r\nSo what is your customer acquisition process? Because I can't imagine some large commercial real estate company is like going to Google. How do I find an owner's rep? You know what I mean? It's not Google or Facebook ads. How are you currently acquiring customers?\r\n\r\n\r\nAntonia (13:18.005)\r\nWord of mouth, repeat plans, and I have a newsletter and I post on social media. I don't do any paid outbound. It's all inbound.\r\n\r\n\r\nNik (13:24.341)\r\n-huh.\r\n\r\n\r\nNik (13:27.992)\r\nWell, in like your line of work's really hard. Everybody loves SAS, right? Because it's recurring revenue. Your line of work is, it can be reoccurring, right? It can happen again from the same client, but it's not recurring. You're not necessarily like just paid on a retainer. So you constantly have to be out there prospecting or like finding new business. Which one of those is the best funnel for you? Like where do you get the best leads from? A newsletter, social media, or word of mouth?\r\n\r\n\r\nAntonia (13:38.941)\r\nYeah. Right.\r\n\r\n\r\nAntonia (13:53.748)\r\nI mean it.\r\n\r\n\r\nIt's tough to pinpoint because a lot of times it'll be word of mouth. Like someone will recommend me to someone. And then that person's like, yeah, like I sign up to her newsletter. yeah, like I've heard of her or like, yeah, like someone else also recommended her. So it's a very tough, it's tough to pinpoint at this point really. I would say the stickiest is certainly word of mouth. It's people that I've worked with who know me and my repeat clients. mean, I think that\r\n\r\n\r\nNik (14:11.875)\r\nHmm.\r\n\r\n\r\nAntonia (14:27.157)\r\nI want to say to now, in the last five years, everyone that I have worked with, about 50 % of them I've worked with twice.\r\n\r\n\r\nNik (14:38.153)\r\nIt happened again. Give me a second.\r\n\r\n\r\nAntonia (14:40.191)\r\nThere we go.\r\n\r\n\r\nNik (14:42.862)\r\nThis is so weird.\r\n\r\n\r\nAntonia (14:45.597)\r\nIt's unhappy today.\r\n\r\n\r\nNik (14:47.554)\r\nI mean, I've had days where I've gone, I've had literally like six podcasts. I've never had my camera turn off and now I think it just doesn't, it doesn't like my face. All right. It's not you, it's me. It's just like, so how many subscribers do you have to your newsletter?\r\n\r\n\r\nAntonia (14:55.54)\r\nYou're good.\r\n\r\n\r\nYou don't like me?\r\n\r\n\r\nAntonia (15:08.053)\r\nwe're at 10 ,000 right now.\r\n\r\n\r\nNik (15:10.638)\r\n10 ,000. Did you start that at the same time that you launched the firm or were you like, wow, I'm getting a lot of social media inbound. Maybe I should capture these people in a newsletter. How did that work?\r\n\r\n\r\nAntonia (15:21.307)\r\nNo, was a mix. was more of wanting to... Like I got back in a time when social media or Twitter specifically was a lot more of a community and there were a lot more interested people. I would get a lot of very complex and thoughtful questions. And so I was like, you know, there's got to be a better way of addressing this because we also didn't have the...\r\n\r\n\r\nthe chunky tweets, right? Like we could only do threads and you were capped to 280 characters. And it was just very like, okay, like this just makes no sense. It's like a stupid format. So I started the newsletter just cause it was a good way to share longer form. Like that's kind of why I started it. So.\r\n\r\n\r\nNik (16:11.384)\r\nWell, hey buddy, what's going on? You want to say hi? Say hi. Can you say Ellis? He's not a talker yet, but let's go find mom. How did you find me? Are you back now? Are you back now? Here, let's go ask.\r\n\r\n\r\nAntonia (16:19.487)\r\nHi, what's your name?\r\n\r\n\r\nAntonia (16:30.876)\r\nYou\r\n\r\n\r\nNik (16:53.23)\r\nSorry, it's not my camera. It's my kids. Man, he's I love that kid. He's so funny right now. Two years. I was gonna ask you on the customer side of things. It must be kind of weird because word of mouth is important, but you also have strict non -disclosure agreements with these developers. You know what I mean? Like in my mind, your business would be perfect for Instagram.\r\n\r\n\r\nAntonia (16:56.147)\r\nNo worries.\r\n\r\n\r\nYou're so cute.\r\n\r\n\r\nAntonia (17:15.571)\r\nYes. Yes.\r\n\r\n\r\nNik (17:21.378)\r\nTake a picture of a project you worked on and post it, right? But you can't necessarily do that stuff, can you?\r\n\r\n\r\nAntonia (17:23.786)\r\nNo.\r\n\r\n\r\nI can't do that at all. And it's, you know, it's odd because people are like, what do you feel about that? And honestly, I prefer it. would rather like, let's talk about the project in five years when we're done. Like, I'll be super happy to show the finished things. I think there's a mix of obviously the very private business things that happen on a project that would hurt the project if I share them.\r\n\r\n\r\nAnd you don't always know what those things are. And so I'd just rather not share anything at all because my job is to move that project forward and to look out for the job. And I don't want to make a mistake that would hurt the project. That would be like not doing my job at all. So.\r\n\r\n\r\nNik (18:16.92)\r\nOkay, here's the last thing I'm like really curious about your business. You live in Utah. Most of your, I don't know, most of your projects are not in Utah, I'm assuming. How, like what's your differentiator? How are you managing all of this stuff around the country and continuing to get new business? Cause you're obviously doing a good job if the majority of your business is coming from word of mouth. Like what do you feel like is the differentiator for you?\r\n\r\n\r\nAntonia (18:22.345)\r\nYeah.\r\n\r\n\r\nAntonia (18:26.633)\r\nCorrect. I don't have any projects in Utah.\r\n\r\n\r\nAntonia (18:45.449)\r\nI mean, I have a kick -ass team. I work with really great people. I'm not a one -man band. Like, there's no way I could do the work all myself. I'm extremely fortunate, but also I've been working with these folks for a while, about five, six years. We have very tight processes. We understand how the process works to the extent that we can carry that process.\r\n\r\n\r\nto many different jurisdictions. We rely a lot on local teams, like local civil geotech architects. And also too, having our clients believe in us and what we do and sort of empower us in front of the team. And that's also a huge part of it. So I don't...\r\n\r\n\r\nI mean, I think partly the way we charge, the way that we're very available upfront, we're very agile, we're very quick. We're also very technically strong. My project managers, we're all either registered architects or professional engineers. We all have construction experience, consulting experience and development experience. We put the job in front of the client, you know, and I, and so that I think is really what makes us a bit, a bit different than, than most.\r\n\r\n\r\nNik (19:58.531)\r\nDo you?\r\n\r\n\r\nNik (20:04.172)\r\ncurious, do you have any international talent? Like you're you're working in Utah, right? You're not necessarily in each one of the markets. Is this a business where you could outsource to, you know, South America or Southeast Asia or Europe?\r\n\r\n\r\nAntonia (20:08.905)\r\nGood evening.\r\n\r\n\r\nAntonia (20:20.401)\r\nNo, I mean, a lot of our work is extremely technical. It's extremely relationship based. There's like a ton of trust that we need with everybody on the project. And a good portion of it, I say we're remote, but we're not remote in the sense that we do see our jobs. We see every job once a month. So it's not remote in that sense. Like we're not hands off.\r\n\r\n\r\nNik (20:41.346)\r\nWow. Okay, so you are still traveling a lot.\r\n\r\n\r\nThat's okay. I have some rapid fire questions for you to wrap up. Is that cool? All right. What do you love about this business?\r\n\r\n\r\nAntonia (20:50.367)\r\nLet's do it. Yeah.\r\n\r\n\r\nAntonia (20:55.561)\r\nthe people.\r\n\r\n\r\nNik (20:57.52)\r\nyour team or the customers, clients.\r\n\r\n\r\nAntonia (21:00.289)\r\nBoth, and the outside teams too. The fact that we get to see such a wide breadth of humanity is pretty neat.\r\n\r\n\r\nNik (21:10.341)\r\nWhat do you hate about it?\r\n\r\n\r\nAntonia (21:15.157)\r\nHmm, that's a good question. What do I hate about it?\r\n\r\n\r\nNik (21:22.018)\r\nYou gotta have something you hate about it.\r\n\r\n\r\nAntonia (21:23.829)\r\nThe fact that it's, but I also love it. So it's the tough one. I love it and I hate it, but I hate it that it's incredibly difficult to scale for sure.\r\n\r\n\r\nNik (21:28.814)\r\nThat's okay.\r\n\r\n\r\nNik (21:35.532)\r\nIs it difficult to scale because it's so dependent on you?\r\n\r\n\r\nAntonia (21:39.481)\r\nand not just me, but it is dependent on a person. It is dependent on the project manager of the job.\r\n\r\n\r\nNik (21:45.026)\r\nHmm. So basically if you wanted to double in size, you got to find twice as many project managers.\r\n\r\n\r\nAntonia (21:51.337)\r\nwhich I wouldn't want to double in size. Yeah, exactly.\r\n\r\n\r\nNik (21:53.89)\r\nYeah, no, I'm just saying that, like, because it's so people focused, it's not like you can all of sudden find a new technology that leverages one person to double their efficiency. You know, it's Yeah, that's interesting. All right. This is one of my favorite questions. What industry or business are you the most jealous of right now?\r\n\r\n\r\nAnd don't give me some emotionally intelligent bull crap answer like I'm not jealous of anybody.\r\n\r\n\r\nAntonia (22:20.295)\r\nNo, no, no, no, I'm trying to find people that I'm jealous of. So I'm this is a bit I'm on this group text with the ladies who play tennis in my neighborhood and they have this constant chatter of like they're always looking for they always play doubles. I am incredibly jealous of these ladies who play tennis at two thirty in the afternoon on Tuesdays. I'm jealous. So maybe being retired is the thing. I don't know.\r\n\r\n\r\nI'm jealous of those people who can be outside all day.\r\n\r\n\r\nNik (22:50.318)\r\nI'm gonna go ahead and tell you right now, you can add me to the group text because I go and play tennis at 2 .30 on Tuesdays. My wife and I just joined a tennis club and she was trying to convince me for a long time and we finally joined it. And at least once a week we sneak away for like a midday date and play. Dude, it's so fun. I can't believe how fun it is. Anyways.\r\n\r\n\r\nAntonia (22:59.704)\r\nRight?\r\n\r\n\r\nSo great.\r\n\r\n\r\nAntonia (23:08.213)\r\nSo fun.\r\n\r\n\r\nAntonia (23:15.763)\r\nYeah, exactly. Those people I'm jealous of. the people who can, not just like on Tuesday, but it's like Tuesday, Thursday, Wednesday. It's like four or five days a week are playing tennis in the middle.\r\n\r\n\r\nNik (23:25.622)\r\nYeah, yeah, because your business in particular, you're like you're in control. But it's hard to remove yourself from the business.\r\n\r\n\r\nAntonia (23:33.909)\r\nWell, but stuff needs to get done too, right? Like yesterday, for example, I played tennis at lunch. I played tennis at 1 PM. But, you know, I started my day at 7 30 and I ended my day at 6 30. So, know.\r\n\r\n\r\nNik (23:46.715)\r\nAll right, this is an I've never asked this question before, but I'm going to try to sneak it in on you. What's the biggest dollar amount project you've ever worked on? How much was it?\r\n\r\n\r\nAntonia (23:55.797)\r\nAbout $350 million.\r\n\r\n\r\nNik (24:00.526)\r\nThat's big, okay. If you have two hours in your day and you don't have any work responsibilities and Bear's not there, you know, trying to get you to take him on a walk or family responsibilities, what are you spending your time on? What are you obsessed with right now?\r\n\r\n\r\nAntonia (24:16.277)\r\nplaying tennis. But also, I started a development company in New York. And so I am kind of obsessed right now too with just, you know, street view, walking around the streets of New York if I'm not in New York. So, also.\r\n\r\n\r\nNik (24:19.448)\r\nOkay, great answer.\r\n\r\n\r\nNik (24:33.166)\r\nOkay. All right, last question. What advice would you give to your pre -entrepreneurial self?\r\n\r\n\r\nAntonia (24:44.531)\r\nthat all that technical, all the studying, all the legitimacy, all the technical skills that I had spent a lot of time learning and all those relationships I picked up along the way.\r\n\r\n\r\ndefinitely paid off. Like, because there were so many times when you're just like, should I really be studying? Exactly. Like, you know, do these people really think that I did a good job? So, yeah.\r\n\r\n\r\nNik (25:06.636)\r\nIs this really worth it? Yeah.\r\n\r\n\r\nNik (25:18.702)\r\nThey don't. They don't. I'm sorry, I'm just kidding. All right, well, this has been awesome. Actually, this has been a freaking blast. Where's the best place for people to come find you?\r\n\r\n\r\nAntonia (25:23.827)\r\nyou\r\n\r\n\r\nAntonia (25:31.155)\r\nThey can find me on my website, madproject .com, -A -D -D Project, singular. You can find me on Twitter. I'm easy to find. Yeah, that's just.\r\n\r\n\r\nNik (25:34.936)\r\nHow do you spell it? Okay.\r\n\r\n\r\nNik (25:45.23)\r\nAll right. Well, next time I am down in Utah staying at the montage, we'll play some tennis. All right. Thanks, Antonio.\r\n\r\n\r\nAntonia (25:50.205)\r\nLove it. Love it. It's a date. I like it. All right, Nick. Thank you.",
  "metadata": {
    "duration": "",
    "date": "2024-09-25",
    "platform_source": "Google Drive"
  }
}