{
  "episode_number": "54",
  "episode_title": "Rebuilding a $8M Business After Buying It Back with Cathryn Lavery",
  "guest_name": "Cathryn Lavery",
  "business_name": "Best Self",
  "transcript": "﻿Nik (00:00.642)\r\nAll right, Catherine, welcome to Nikonomics. I am stoked to have you. Why don't you give people a background and just briefly explain what your business is and how you make money.\r\n\r\n\r\nCathryn Lavery (00:12.256)\r\nYeah, so my business is bestself .co and we create tools around productivity, relationships, different areas in your life where you could become the best version of yourself. So I got really into personal development back in like 2012. I used be an architect. So I come from a very like making buildings background and like making things. when I got into personal development, was like, and I also had ADHD, which was\r\n\r\n\r\nDiagnosed super lia. So I always was like creating these frameworks for myself to be able to Do things I didn't realize at the time I like literally had a ADHD so I'd always have like these systems to just be able to like get through my day and so I Once I got into personal development. I was like, my god Why didn't I learn this stuff at school? Like why am I? Learning about the powerhouse of a cell when I don't know anything about like what habits are actually gonna make you more successful and so I kind of dove in the deep end and then because I had a\r\n\r\n\r\ndesign background, I was like, okay, I want to create this product for myself. And so the first product I came out with was called the self journal, which was the first like goal based journal. So you set a goal at the beginning, we show you how to break it down. So you hit it in three months. And it was like an analog tool because I don't know about you, but my phone's like a productivity app graveyard where I'm like, this is the thing. And then two weeks later, I'm like, I don't even remember what that app was. And so I'm very into using technology, but also like the physical\r\n\r\n\r\nNik (01:30.722)\r\nYes.\r\n\r\n\r\nCathryn Lavery (01:39.882)\r\nproducts and like the things that are on our desk and in our lives are actually the things that we usually get more done if it's like right in front of our face and it's not an app that we can close down. So that's where the business started. And then we got into more relationship products because personally I went through something where I'm like, actually your business can be doing well, but if your personal life isn't where you need it to be, it like doesn't really matter. And so\r\n\r\n\r\nLuckily, I called the company Best Self because then it could kind of, and I did that because I knew like there was possible for expansion. But when the business started, it was like type A, your best self is your most productive self. And now it's more like who is your best self and how do we help you in different areas of your life?\r\n\r\n\r\nNik (02:21.188)\r\nOkay, so there's kind of two components to it. It's not just the physical product that you have, but there's also an educational component to help draw out your best self or to help you with goal setting, to help you with organization, to help you with whatever thing is sort of keeping you from your best self.\r\n\r\n\r\nCathryn Lavery (02:37.227)\r\nYeah, pretty much. we'll just help you benchmark where you are, figure out what's important, and then give you a structure that you could see every day to help you get there. it's in like, we sell $25, $30 products. So it's not like we're this big training. just were like, how do we make people successful with our product? Because we knew like, at the beginning, I'm like, if people don't find success with our product, they're not going to come back and rebuy. And that's the key\r\n\r\n\r\nrunning a business, like having people come back time and time again. We've had people using our journal since we launched. So literally eight years of, like I've had people like send me these stacks, like this is all the journals I bought from you guys. So it's pretty cool seeing and also seeing people that I've seen use it and where they are now is pretty awesome.\r\n\r\n\r\nNik (03:17.592)\r\nThat's awesome.\r\n\r\n\r\nNik (03:24.868)\r\nGive me an idea of size and scope. What's your top line revenue per year? How many employees do you have? What does your business look\r\n\r\n\r\nCathryn Lavery (03:33.792)\r\nSo that's a good question. when I, I'll tell you, so chapter one of the business, I actually sold the business to private equity in 2022. And I sold it fully and it was bootstrapped. So it was, and I owned the full thing when we sold. And so my team stayed on at the time. I had about eight full time people ish and we were doing about 8 .2 million a year.\r\n\r\n\r\nand we were lean, but we definitely could have been leaner because, know, one of my customer service people had been with me for six years. so like, she was awesome. I loved her, but if I was like really pushing the profit alone, like I could have got someone for overseas for maybe a third or a quarter of the price, but that's not really what I was trying to do, especially, you know, I had this core team. so when I sold the business,\r\n\r\n\r\nthere was a six month retention. So I paid a three month bonus and then they paid a six month bonus. And I was like an ambassador for a year, supposedly helping with product and things, but they didn't really ask anything of me. I tried to give them the advice, they didn't really take it. And so after five and a half months, they told me that they were gonna be letting everyone go and moving to like an agency model, which was fine. That was their prerogative. And so I actually helped.\r\n\r\n\r\nmy old team like get jobs elsewhere with, you know, cause I'm like, okay, I want them to find success elsewhere. And actually I have a friend who runs an e -comm company that's way bigger than mine. And he hired like three or four people that used to be my people. And so I kind of like just helped them went on my way. And then in December of, I was supposed to get an earn -oil for the, selling. was like part of the deal that was tied to revenue and they didn't hit that for a bunch of reasons that they basically like.\r\n\r\n\r\nNik (05:13.135)\r\nwow.\r\n\r\n\r\nCathryn Lavery (05:28.946)\r\nThey were like a new private equity holding company. So they were basically like starting their company while also buying brands. So they bought, I believe, three brands, including mine. Ours was the first one. And so they're like trying to fly the plan, but also build at the same time. And then even though I had a team and I wasn't even really working in the business when I sold it, which is why I was able to sort of just walk away. But they kind of took all the autonomy away from the team being able to like do their job. So whereas before it'd be like forecasting\r\n\r\n\r\nwe need to order this much inventory. Suddenly, like they couldn't over order inventory because they didn't have approvals. And so then what should have been handled was delayed by two months. And then they didn't have inventory for Q1, which is our biggest quarter. So there's like all these dominoes that just kind of collapsed. So the quarter I sold, so Q4 of 2022, we were up 20 % for that Q1. I was like, this is going to be great. Because they had to hit 90 % of gross revenue for me to get my earn right. And then Q1 was\r\n\r\n\r\nI don't know if I can swear, but it was not good. I think we hadn't had a worse one since like 2018. had like way less products. It was dying a lot. So that was when I was like, okay, I'm not going to get this or not. And so what happened was I, the CEO reached out to me in early December of 23. So basically a year and a bit later and was like, yeah, we're actually shutting down the whole firm.\r\n\r\n\r\nand selling off the brands that we bought, you're not going to get your earn I put. Do you want to buy the company back? That's pretty much how the conversation went. And so, you know, things look different. Like the revenue was done maybe 25%. There was no team left. And so there was a lot of, but there was the brand there and the products there and there were sales, but there was just a lot of things that were not like they were when I sold it. Like when I sold it, we were\r\n\r\n\r\nI don't know, 65 % direct to consumer and 35 % Amazon. And buying it back, they'd sort of only focused on Amazon. And the reason they did that was because this P firm had hired a bunch of people from, what's that? Like Amazon aggregators essentially. And so like, they're just looking, if you're a hammer, everything's a nail. They're like, everything's Amazon. So then they kind of starved out the D to C and moved to Amazon, which is like the last profitable channel. So coming back.\r\n\r\n\r\nCathryn Lavery (07:55.252)\r\nthe structure and how things looked channel wise is different. But, you know, I got myself a good deal. So I was like, okay, let's roll up my sleeves and do it again.\r\n\r\n\r\nNik (08:03.108)\r\nSo let me see if I can reframe or not reframe, just restate what you said. Built a company going well. You sell to a private equity firm that not only was brand new, had a new thesis, a new untested thesis and was buying you at really peak asset prices, right? 2022. For whatever reason over the next year, year and a half, they couldn't execute on their vision.\r\n\r\n\r\nprobably ran into a bunch of roadblocks. And then he calls you back and says, we're shutting down. Do want to buy this company back? And you were able to, and you were able to buy it back. Like, was it a steep discount? Or was it like the same that you sold it for?\r\n\r\n\r\nCathryn Lavery (08:39.818)\r\nPretty much.\r\n\r\n\r\nCathryn Lavery (08:46.73)\r\nyeah, it was steep. basically bought it back for a per like the inventory cost. So, you know, they paid me the multiple plus inventory when I sold it and then I basically like bought the inventory back from them at a discount.\r\n\r\n\r\nNik (08:52.824)\r\nWow.\r\n\r\n\r\nNik (09:04.932)\r\nThat's incredible. Did you, so you bootstrapped it, you're by yourself, you own it 100%, you sold it to them. Did you buy it back 100 %? Do you have investors now? Okay, bought it back 100%. It's really interesting.\r\n\r\n\r\nCathryn Lavery (09:12.744)\r\nYeah. I was looking, I was actually considering, I was considering.\r\n\r\n\r\ntaking on someone to sort of run it. But then I actually had a business partner when I first launched it, he left spiritually, mentally, physically in 2018, but not legally until 2020. And so that, you know, it was just like really stressful in the business dealing with business partner issues, especially 50 -50, like never do that again. And so when I was considering bringing someone on or maybe looking for investors, I'd...\r\n\r\n\r\nthis all happened very quickly. Like I put my offer in in December with the goal of like closing quickly because the price was the price, right? So the longer that they held it, the less inventory I had and the more sales they had. And so my whole thing was like, Valentine's Day is coming up. If I can get it, I can capitalize on that with the inventory I already have with the goal of like, I want to buy the business block. I don't want to put any more capital into it. want the sales revenue\r\n\r\n\r\nNik (10:00.184)\r\nOkay.\r\n\r\n\r\nCathryn Lavery (10:18.814)\r\nto be enough to capitalize the business, which I've been able to do. But that was kind of how I was thinking. So when I was considering at first, getting investors or taking on a partner, I was really like, well, I'm negotiating this deal. I don't want to also negotiate another deal at the same time. So I was like, let me get the business back. I know how to like fix things. And then I'm also coming at it from more position of strength anyway, because like, I don't need the money to buy it back. So let me just get it back, get it in a better position. And\r\n\r\n\r\nIt would be worth more as\r\n\r\n\r\nNik (10:52.164)\r\nWhat was it doing at that time? where you said you're about 8 million now in revenue. you sold it around 8 million in revenue.\r\n\r\n\r\nCathryn Lavery (10:57.557)\r\nno, that, we were at eight.\r\n\r\n\r\nYeah, it was at, I think last year they did 6 .7 ish. Yeah, and then I'm not like where we're trending right now, we're probably gonna do five ish. But it's good because the profit, like I've been running a much different like this time. like, the profit from this year will be more than we made when it was 8 .5.\r\n\r\n\r\nNik (11:06.564)\r\nOkay, big job.\r\n\r\n\r\nNik (11:31.342)\r\nThat's awesome. Lean down.\r\n\r\n\r\nCathryn Lavery (11:32.51)\r\nSo I actually, I'm running it differently this time, because I'm thinking of like, don't really care, because before it was like, we have to always be growing for like, you know, well, for a few reasons, like if you're not growing your revenue, it's like, you're failing, like what's going on? And I look at it differently this time, it's like, before like margins were getting tighter and while we were growing, our margins were getting lower and we were actually less profitable.\r\n\r\n\r\nNik (11:37.347)\r\nEh, eh.\r\n\r\n\r\nCathryn Lavery (11:59.264)\r\nbut you're still like, we're doing over 8 million, blah, blah. I'm like, don't really care about that anymore. And you were almost sort of like, for me, was like building myself this prison that I had to always be growing. had this payroll of people that was dependent on me. I also, when I sold, I'd had my first baby, she was six months when I sold. And so, you know, I hadn't really taken time off. You know,\r\n\r\n\r\nNot fully because even though you can like have people running things, you know, you watch you see the news It's like always a recession coming. Am I gonna have too much inventory? Like I don't know what's gonna happen and because I'm like bootstrap There's no like magic investors in the background like that all comes back to me So even though technically I wasn't the day to day I was still mentally You know dealing with the weight of this company. And so when I sold there was a lot of reasons I want to take time\r\n\r\n\r\ndo mom life for a bit. also wasn't sure where the economy was going. I was like, I think it's smart to sort of take money off the table because I've been constantly reinvesting in it for so long and buying it back. When I first heard, was like, I don't know if I like to be honest, when he first brought it up, I'm like, I'm not sure if I want to do that. But then I was sort of journaling on like how I would do it differently. So I'm not building myself into this prison that I don't even want. And it would be like, like when I sold\r\n\r\n\r\nChatGP hadn't come out yet and I'd spent the sort of year plus, you know, learning how to code and learning how to use AI. I'm like, okay, there's just so much I could do with AI that I wasn't able to do before. And so that was one of the reasons where I was like, I could probably get away with a much leaner team by just being smart with hiring and things like that. And so that's, that's, I kind of put some things in play us. And I was always like, look,\r\n\r\n\r\nNik (13:29.496)\r\nMm -hmm.\r\n\r\n\r\nCathryn Lavery (13:50.302)\r\nIf I'm buying it back for a percentage of the inventory, I could always just sell through the inventory, potentially like sell the company again. So because I got it back at a good deal, there's a lot of options that I could.\r\n\r\n\r\nNik (14:00.996)\r\nYou weren't gonna necessarily lose money on the deal as a whole. Right.\r\n\r\n\r\nCathryn Lavery (14:03.9)\r\nYeah, but I don't know if I didn't enjoy it, but I was able to get it back on track. could sell it, but I really coming back in is like, how do I build a company that's like fun making things that I enjoy serving customers correctly that I could sell on it because everything's set up correctly, but I don't have to sell because I actually like working on\r\n\r\n\r\nNik (14:25.284)\r\nI want to go circle back to a statement you made like really, really early on, like in our first 30 seconds, you said you had ADHD. So I'm assuming you found the cure. I'm just kidding. I know it was a joke. I have ADHD as well. And like hearing you talk about you always had to like build yourself systems and and frameworks. I'm the same exact way. And when I meet\r\n\r\n\r\nCathryn Lavery (14:35.052)\r\nno, I still have it. I wish.\r\n\r\n\r\nNik (14:50.232)\r\nand they're getting to know me for the first time and they see that side of me, they're like, you must be so organized. man, you must be just so good at all of these little pieces. And when I try to tell people, like, no, you don't understand. I need this so that my brain understands how things are supposed to go and I can actually function. So I've always found that part interesting. Did you have the same experience?\r\n\r\n\r\nCathryn Lavery (15:14.064)\r\nyeah, I was like not organized at school. I actually like, I was thinking back because I didn't get diagnosed till I was like 30. And I remember in school, I had a locker, right? But I would lose my locker key all the time. And if I didn't lose my locker key, I literally had to cut locks. Like I remember like at least four times going to the janitor's thinking to get the lock cutter, because I would just lose my keys all the time. And then I would also...\r\n\r\n\r\nNik (15:33.911)\r\nHahaha\r\n\r\n\r\nCathryn Lavery (15:41.386)\r\nforget what books were for like what class. I just would, I'm pretty small, so I would have this like huge backpack because I was just like, fuck it. I'm just gonna bring all of the books all the time. And then I don't have to be like stressed about it. So I was just like not organized and I would have to come up with these like, and I still do it, these like systems to just like, like I literally have an app that's connected to my washer dryer because otherwise I'll wash my clothes. I'll forget they're in there and then I have to rewash them because they've been sitting damp. And so now I will\r\n\r\n\r\nNik (16:08.33)\r\nYeah.\r\n\r\n\r\nCathryn Lavery (16:11.21)\r\nping my phone like, hey, it's up. So like, and I have so many of those just to run the highest to just like function like a normal human being.\r\n\r\n\r\nNik (16:20.324)\r\nI'm curious, because again, I have ADHD and many times I have epiphanies about myself. I'm like, I'm never going to do that again. And then many times I find myself in the same situation again. What did you do differently when you bought back the company? You said you had been journaling, but what did you do differently where you were able to not build yourself the prison that you had built yourself the first\r\n\r\n\r\nCathryn Lavery (16:47.616)\r\nI mean, I think one of the things was prior, you know, we had an email, we had, you know, I think we had too many people and we were trying to do too many things, which at the time, like, even though on the scale of 2022 and where we were, because we didn't have investors and we were running off sales and, know, a line of credit and things like that, there wasn't, we had, it's not\r\n\r\n\r\nWe could be unprofitable for long, the margins were getting smaller. And so when I was coming back, I was like, okay, what are the basics that we need to be able to like get things done without it's like, do we need a specialized person for this? I don't think so. And also just, just like things like, do we need a Shopify developer? No, I don't think so.\r\n\r\n\r\nbecause guess what, we have chat between I and you can literally like solve and write scripts on there and use themes and all this stuff that was like unnecessary for like 2024 might've been necessary in 2021 when we didn't have as many options. you know, and just getting a small team and then giving them the tools that they needed to be able to do more. like I constantly, I'm so, you know,\r\n\r\n\r\ndoing something and I'm like, this would actually be helpful to show the team how to use AI differently. And then I'll record a video and then I'll share it. Like now we have like a shared prompt thing so that I am like showing them how to be thinking about things so that they can do more, which just wasn't possible before. so now I have things that, and also just minutia of like dumb things that ADHD, I would either like pay tax on by ignoring it, or I would hand it off to someone else. And now I can literally\r\n\r\n\r\ndeal with it in five or 10 minutes with chat, GPT or Claude or something like that. And so that itself keeps me from feeling like I'm in a prison because I'm like, God, I have to deal with all these like paperwork and sales tax and like all this stuff that like really bogs me down from like the creative work that I really want to be doing.\r\n\r\n\r\nNik (18:59.118)\r\nSo tell me your business right now. How do you acquire customers? Where are they coming from?\r\n\r\n\r\nCathryn Lavery (19:04.766)\r\nOui.\r\n\r\n\r\nCathryn Lavery (19:08.414)\r\nI mean, we have more organic now than we used to because we've been focusing on organic content. also do like Facebook ads, Google ads, and we're starting to do TikTok. Or we do TikTok, but we don't get a ton of like things that we can track on there. So I don't know if I would count that right now. And then Amazon is a big channel.\r\n\r\n\r\nNik (19:31.764)\r\nDo you have any idea what your customer acquisition cost is? Like how much it costs you to acquire one customer?\r\n\r\n\r\nCathryn Lavery (19:37.024)\r\nIt's cost 20, 25 ish depending on what the depends on the product on what we're trying to sell. to be honest, like because we have low price products, it is difficult to spend what we used to on because again, I want to be making money on every sale instead of losing money on the first sale. We've actually generally historically been pretty good, but it's gotten very difficult. And so\r\n\r\n\r\nNik (19:41.188)\r\nOkay, and then any idea?\r\n\r\n\r\nCathryn Lavery (20:06.59)\r\nTo be honest, haven't like our sales are lower than they used to be, but I've been focused on like, look, if it's not profitable on the first sale, like I don't want to do it right now. And again, this is like a quieter season for us. So like Q1 and Q4 are biggest. And so I've actually been using Q2 and Q3 to sort of get the business like structurally back on track and develop some products that we have coming out so that Q4 and\r\n\r\n\r\nNik (20:16.548)\r\nAnyway.\r\n\r\n\r\nCathryn Lavery (20:34.654)\r\nbuilding up the assets for marketing and things like that so that when we're ready, we can spend more on marketing in a way that makes sense. I don't want to be like spending a bunch in the quarters where like quieter when generally and historically Q4 and Q1 are, so I'd rather save some dry powder for them.\r\n\r\n\r\nNik (20:54.178)\r\nYeah, for your busy season essentially. What are your net margins?\r\n\r\n\r\nCathryn Lavery (20:59.924)\r\nnow that's like after we pay, I'm like, I'm, goal for the company is like 20 % margin for the\r\n\r\n\r\nNik (21:07.342)\r\nOkay. Yeah, it's just really hard to grow organically when you're trying to stay profitable, right? And like everything's just been poured back into the business. Talk to me about like, what are your current offerings? So like I get the journaling products. You said you have some community things. It sounds like you have, I don't know, some type of education piece. Are there different verticals that you sell into?\r\n\r\n\r\nCathryn Lavery (21:34.464)\r\nWe're mostly physical products, like that's 90, 95 % of our revenue. So we sell little card deck games, we sell journals, essentially a lot of paper products we sell. So whether it's like productivity or games for your relationship with you and your kids, we have icebreaker decks, we have the intimacy deck, and they were the first sort of early,\r\n\r\n\r\nNik (21:42.346)\r\nCathryn Lavery (22:01.322)\r\nThey're kind of what I would consider like Trojan horses of personal development. So it's like you come in, you're like, okay, I want to connect with my wife or my kid more. so rather than like create an app, it's like, how do we get people away from their phones and just have something in their environment that they can like pick up and have a good conversation, which is helpful with cars because you don't know how much.\r\n\r\n\r\ninner voices you get if someone was just to ask you one of these questions yourself. So if I was to ask you one of these questions and you don't know what's coming from a card in your mind, you're like, why is she asking me that? What, like, what does it mean? And so there's all these like defense mechanisms, like people in relationships can come up with that actually gets in the way of this having a like real vulnerable conversation. And so one thing that the card games that we've came up with is like, it allows people to be more open because they don't feel like there's an ulterior motive to the question.\r\n\r\n\r\nNik (22:57.934)\r\nWhere do you sell into? What are your sales channels? Are you all direct to consumer e -commerce? Are you trying to sell into Walmart and Target and some of these big box stores?\r\n\r\n\r\nCathryn Lavery (23:09.182)\r\nWe sell Barnes and Noble on common goods, some small retailers, but mostly it's, and then we sell on Amazon, and then we also sell, teams will buy it, corporate companies will buy it for their teams, but those are more wholesale options.\r\n\r\n\r\nNik (23:28.356)\r\nWhy is there a love -hate relationship in e -commerce with Amazon?\r\n\r\n\r\nCathryn Lavery (23:33.332)\r\nI think it's Amazon. First of all, they just changed or increase their fees all the time. It's also like one thing I dealt with right after I got the company back was we were dealing with like counterfeiters where like somewhat people had like ripped off our product, but it was like these like shitty versions. So it's like spelling mistakes all over and like, and trying to get them off your. So like on Amazon, you might create a product from scratch. You're the only distributor for the product. You put it on Amazon.\r\n\r\n\r\nBut then other people like, I also sell this. And so Amazon's whole thing is like they want to get the customer the best possible price. And so let's just say you were selling like Tide Pods, you could have gone to Walmart or the Dollar Store and gotten like a bunch of that art, like that whole retail arbitrage. So that is actual Tide Pods that were bought. But then there's a lot of products that they just like basically copy and try even if you have trademarks, like it's you just have to be like on it to be able\r\n\r\n\r\nprotect your brand. so that's one reason it's like, you know, you have all these like Chinese sellers, like gaming reviews, they'll either like buy a product, there's nothing with higher reviews, and then they'll sell a completely different product, like fake reviews, all this stuff. And then, you know, if Amazon just done, they'll just launch another one the next day. And\r\n\r\n\r\nNik (24:43.694)\r\nThank you.\r\n\r\n\r\nNik (24:50.616)\r\nBut the onus is really on you as the business owner to like prove to Amazon you are the original, not the\r\n\r\n\r\nCathryn Lavery (24:58.056)\r\nYeah. And I think a lot of us sellers, because they're dealing with Amazon, like this is their like livelihood and their company and they have to stick by like specific rules. Whereas like you have a lot of Chinese manufacturers coming on the platform that like, if Amazon throws them off, they'll be back tomorrow with another name and just start again. like Amazon's making money either way. And so actually Amazon have invented this thing called a, it's called this like transparency code.\r\n\r\n\r\nAnd it's this little QR code looking thing. And basically if that's on the product, then only products coming into FBA with that little code will be accepted. And so it's funny, cause you almost have it like, they're the mob that they created this problem. And they're like, actually now you have to pay like five cents a unit for this little code to be able to like sell your own product legit legitimately and making sure nobody else gets it. And so there's just stuff like that where you just don't know.\r\n\r\n\r\nwhen the tides are going to turn with\r\n\r\n\r\nNik (25:59.556)\r\nTotally. I have some rapid fire questions for you. Is that okay? All right, first question. If you were starting over, you knew everything that you knew right now, and you're starting over from scratch, what business would you\r\n\r\n\r\nCathryn Lavery (26:18.28)\r\nAs a cliche, I'd probably do something with AI, but not in like the tech forward way. I'd just go to like a really profitable niche that's old school and like does things slowly and figure out how to make them save a ton of time or make more money with AI. And I would just do\r\n\r\n\r\nNik (26:26.712)\r\nNo, no, no.\r\n\r\n\r\nNik (26:38.382)\r\nProbably something with a lot of human input, documentation, conversation. Like I think a lot about healthcare and documentation of the patient record. Like you were talking about Claude, Claude has a really good model.\r\n\r\n\r\nCathryn Lavery (26:48.554)\r\nYeah. Yeah. Actually, I was with a friend who's a ER doctor and he was telling me how much he uses AI for like helping him like with patient notes and things like that. And, know, the health space, there's just so, there's, mean, the whole space, there's so much money and like small little niches in that. I've heard of an AI company that's basically in like a doctor's office, you'll have these people in charge of coding to be able\r\n\r\n\r\nNik (27:14.724)\r\nYep.\r\n\r\n\r\nCathryn Lavery (27:17.118)\r\nAnd then you have to call the insurance company and it's like, they're basically talking to a robot with these codes. And so now they have this program where it's like AI robots talking to AI robots. And now you're saving a whole person's salary that used to be spending like on the phone and now they're doing something that's much more high leverage. So just things like\r\n\r\n\r\nNik (27:38.692)\r\nI used to own a medical billing and medical practice management company. very familiar, very familiar with that. 100%. Yeah, 100%. I get back into it. I think like you were saying, I think AI is going to eliminate a lot of jobs for sure. But I also think it's going to be really high leverage. So it's going to make that coder now able to do 10 times the amount of work that they were able to do without artificial intelligence. So I, I'm a\r\n\r\n\r\nCathryn Lavery (27:42.267)\r\nnice. Would you get back into it? Now that you could like do stuff like that? Yeah.\r\n\r\n\r\nCathryn Lavery (28:03.925)\r\nYeah.\r\n\r\n\r\nNik (28:08.238)\r\nopponent of it. I think it's fantastic. I also think it's going to improve outcomes. Anyways, so yes, I would get back into it. I think it's a great space. I can't because I sold it to PE and I have a non compete for three more years but but I would\r\n\r\n\r\nCathryn Lavery (28:19.434)\r\nWow. I think architecture, so I come from an architecture background. That's another thing where it's you know, now with AI models and a lot of what we learned in architecture school, like that could be unfortunately done with AI. Cause like, okay, I want, this is the location. This is the site plan. Here's the sun map on it. And where it comes in, I want you to like, you can come up with\r\n\r\n\r\nendless options for floor plans based on all that in different themes almost instantly.\r\n\r\n\r\nNik (28:54.5)\r\nI think that's a really interesting potential use case where you just upload all of your plans, drafts, designs, whatever. because it will like it will get multimodal at some point right now it's language, but it will get multimodal and then it's able to spit you out a first draft of what you might do that then allows you to build off of like people who are using it in the creative space to write right now. We're getting first drafts spit off all the time, but design man, that would be a really interesting use case for it's like, Hey, here's all my past designs. Here's what I'm into.\r\n\r\n\r\nspit me out of first draft.\r\n\r\n\r\nCathryn Lavery (29:24.882)\r\nAnd also, you could also license like, Frank Lloyd Wright's entire history of everything he's designed. And so then you're like, essentially getting these masterpieces done in the same like, and you're also interviewing, like, if you could put all of their interviews of like Frank Gehry and like Corbusier and all these people where it's like gathering all the info, and then you just feed it and be like, this, this is, yeah, it's just like endless.\r\n\r\n\r\nNik (29:38.254)\r\nThat would be interesting.\r\n\r\n\r\nNik (29:52.426)\r\nlike, like, like Frank Lloyd Wright, as the example, you could go and say, here is where he went to school. And this was the curriculum at the time uploaded. Here is his first job. And here, like, here's every design he ever did. Boom, upload, here are all the interviews he ever did, boom, uploaded. And then, and then go to a, I don't know, raw piece of land and say, design me a house over the stream. And in the fashion of Frank Lloyd Wright, that would be really freaking cool.\r\n\r\n\r\nCathryn Lavery (30:01.397)\r\nYep.\r\n\r\n\r\nCathryn Lavery (30:21.0)\r\nYeah, pretty. So these things like that, it's pretty insane. it would also see of our, cause architects, you know, there's a lot of time wasted on, you you're doing these details of a wall, but if you could load them in from something that exists already, I mean, we, they already have that a lot with like X -Raphs and stuff, but there's just so much possibility that would take out a lot of like the...\r\n\r\n\r\nNik (30:47.298)\r\nWaste of time. Inefficiency.\r\n\r\n\r\nCathryn Lavery (30:47.508)\r\ngrind work of like, I remember once when I was an intern, I was like an intern after someone else who was a terrible intern. It was awesome for me because it made me look quite better. And so I guess one of the last projects they gave this guy was like, quite the amount of parking spaces that you can get into this space, because, you know, we have to get so many in for like building rags or whatever. And so he's like, yeah, I was able to get the amount in that we needed. And they're like, really? that's that's a relief. Because like, we didn't think\r\n\r\n\r\nwe didn't think that was possible and we're gonna have to make some shifts. He's like, yeah, I mean, they didn't fit at first, but then I just made them all smaller.\r\n\r\n\r\nCathryn Lavery (31:27.411)\r\nAnd so rather than, so he was like an early LLM, but now you could have AI just like come up with 10 different versions of how a car park could work, which is just such a drudgery if you're an architect, like having to do that stuff.\r\n\r\n\r\nNik (31:28.728)\r\nthe\r\n\r\n\r\nNik (31:41.688)\r\nWell, in healthcare, here's a specific use case that I'm working on right now. I don't know if you knew this, but did you know that there's two types of PDFs?\r\n\r\n\r\nCathryn Lavery (31:51.861)\r\nNo.\r\n\r\n\r\nNik (31:53.156)\r\nsomeone who's listening is going to listen to this and be like, okay, but they're gonna call me out on\r\n\r\n\r\nCathryn Lavery (31:54.9)\r\nIs that like a, yeah, like a Photoshop PDF and an Acrobat PDF?\r\n\r\n\r\nNik (32:00.292)\r\nYeah, so the way I understand it is like one PDF is created in HTML. So like maps to a website. Another PDF is just a picture essentially. So somewhere in the ballpark of like 75 % of PDFs are those HTML mapped PDFs. 25 % are these pictures. Well, if you can imagine in healthcare, if you can take a PDF and even control F, I'm gonna find, you know, date of birth or diagnosis and you can find those things really quickly.\r\n\r\n\r\nWell, 25 % of these PDFs you can't do that in because it's not mappable. Well, with artificial intelligence, we can now map it. We can now map those PDFs and read them. So they're searchable, they're saveable, and you can pull in that information without it having to be re -entered by a human being into the system. That now, again, 25 % of all work can now be done with artificial intelligence. So that's just one use case of artificial intelligence coming in and kind\r\n\r\n\r\ntaking the job of some human that now they can focus on higher use cases as opposed to reentering in codes from an unreadable PDF.\r\n\r\n\r\nCathryn Lavery (33:10.366)\r\nYeah, so there's just a lot of manual boring jobs that will not be needed anymore, but I think it leaves space for people. Like, I don't know anyone that's like, I love doing that. The only people that love doing that is if they can listen to a podcast at the same time and like get through their day. But imagine they did something that like lit them up and they were excited to do.\r\n\r\n\r\nNik (33:26.18)\r\nTotally.\r\n\r\n\r\nNik (33:31.425)\r\nMan, I wanna do another whole separate podcast with you on just riffing on AI ideas. Because our ADD minds and our interest in AI, I we could do some, I don't know that anybody else would listen to it, but I think we would find a lot of fulfillment in riffing on those ideas.\r\n\r\n\r\nCathryn Lavery (33:36.98)\r\nYeah, we should.\r\n\r\n\r\nCathryn Lavery (33:46.398)\r\nYeah, nobody else wants to listen. Like my wife's like, okay, cool, cool, cool.\r\n\r\n\r\nNik (33:49.476)\r\nWhat industries are you the most jealous of right\r\n\r\n\r\nCathryn Lavery (34:02.046)\r\nWhat's jealous of?\r\n\r\n\r\nNik (34:03.17)\r\nor business models, business types, businesses that you're the most\r\n\r\n\r\nCathryn Lavery (34:05.55)\r\nbusiness models. mean, if I was starting over, like I've been doing e -commerce for so long, but it's a tough business model because you're dealing with inventory and physical product and you have to this like wide array of knowledge about different things. Like, I don't know anything that's more wide ranging than just dealing with the e -com because you touch on so many different things. like software. And I think\r\n\r\n\r\nto continue on the AI thing. Like I think because software is going to get easier to make, that's kind of going to go away a little bit. But I definitely am jealous of like the margins on software.\r\n\r\n\r\nNik (34:44.324)\r\nYeah, that's a very common answer. I think I know what you're obsessed with right now, because we just talked about artificial intelligence. So I'm going skip to my last question. What advice would you give to yourself 10 years\r\n\r\n\r\nCathryn Lavery (35:01.088)\r\n10 years ago, what would I do? think, I mean, the advice, when I first moved to the US, I like was making 30 ,000 a year as an architect with a master's degree. And so one of the things I worked on was like, okay, how do I just\r\n\r\n\r\nNik (35:09.924)\r\nif\r\n\r\n\r\nCathryn Lavery (35:19.198)\r\nget skills and grow myself because then I can potentially do other things. And so I think a lot of people are like, I don't know where I'm supposed to be in life. It's like, okay, just like learn useful skills. like, there's a really Scott Adams has a really good book and it talks about how to lose every, how to fail at almost everything and still win big. It's a really good book. And he's talking about like these random things that he failed at. And then he was just like,\r\n\r\n\r\nNik (35:43.652)\r\nBye.\r\n\r\n\r\nCathryn Lavery (35:47.998)\r\ngood at humor, was like half decent artist, but not very cartoonist, and he had a corporate background, and so he created Dilbert, and so I look at what skills could you get, so I started learning copywriting, and I knew how to do design and products, and so always, if you're not making much in your job, how do you become really good at AI and CHIFT, and really just like, you don't have\r\n\r\n\r\ndo that much to be able to like learn how to use it so that could apply it to an industry that's not doing anything. And so if I was to go back 10 years ago, it's like, that's pretty much what I did was just like learn skills that were valuable in the marketplace. And if you're learning things where almost nobody has the same like skill, like an architect that like learns copywriting, knows design, and also can like physically make things like products, buildings, like whatever, like\r\n\r\n\r\nis only a specific skill set of people that can read personal development books, come up with an idea in their head and actually create it within a couple of days. For a long time I was trying to replace myself in my business with someone that could, I'm not gonna give them a brief, they're just literally gonna come up with ideas and then also be the same person that can make it come to life and that's actually much more difficult. So I don't know if I answered your question, but yeah.\r\n\r\n\r\nNik (37:09.998)\r\nWe did. Good answer. Learn valuable skills applied in the marketplace.\r\n\r\n\r\nCathryn Lavery (37:14.634)\r\nTown on Stock.\r\n\r\n\r\nNik (37:16.258)\r\nYeah. Well, this has been awesome. Great conversation. Where is the best place for people to come find\r\n\r\n\r\nCathryn Lavery (37:22.664)\r\nYou can find every product I've talked about, can find on bestself .co and I talk about everything on the behind the business on littlemight .com.\r\n\r\n\r\nNik (37:31.652)\r\nOkay, awesome. Can't wait to check in with you in a year and see you be a $50 million business. All right. Something like that. Awesome. Well, will talk to you. We'll appreciate you. Bye.\r\n\r\n\r\nCathryn Lavery (37:36.69)\r\nAwesome. From your lips to God's ears. All right, thanks, Nick.",
  "metadata": {
    "duration": "",
    "date": "2024-09-06",
    "platform_source": "Google Drive"
  }
}