{
  "episode_number": "129",
  "episode_title": "You Aren‚Äôt Crazy! Your Phone Is Listening to You and He Makes $1M/year From It with Brad Smith",
  "guest_name": "Brad Smith",
  "business_name": "Automation Links",
  "transcript": "﻿Nikolas Hulewsky (00:01.208)\r\nHi Brad, I mainly had you on here because I'm the most curious. You seem like the most interesting man in the world. You just got like hands in different things, but you've got a ton of experience, offer your expertise. What is your business and how do you make money?\r\n\r\n\r\nBrad Smith (00:16.948)\r\nWell, it's funny you say that because I'm only a 50 % of that pie. There's a wife that's a co-owner with me behind the camera. there's like double of me. So that's super helpful.\r\n\r\n\r\nBut I would say she's 60 % on 40. So I got lucky.\r\n\r\n\r\nNikolas Hulewsky (00:34.19)\r\nOkay, that sounds about right.\r\n\r\n\r\nWe all got lucky. That's for darn sure. I got super lucky with my wife. What's your business?\r\n\r\n\r\nBrad Smith (00:41.876)\r\nSo there you go. So, automation links is our primary business right now, lifelong entrepreneur. And this one helps businesses automate their marketing. So a lot of people have a business, but everything's not puzzle. The puzzle is not together. You've got a CRM over here. You want to do some emails over there. Maybe you think you should do social media here, but everything's random. You don't have a system. So we go in there and we build a system so you can just let it run while you build 10 years ago.\r\n\r\n\r\nNikolas Hulewsky (01:09.016)\r\nWhen did you start this business? Okay, 10 years and how big is it now?\r\n\r\n\r\nBrad Smith (01:14.836)\r\nYeah. So we've, felt over 2,500 businesses 10 years later, um, 150 active clients with us every month, just a small lean team of six. We're actually hiring two more right now. Um, but it's been a lot of fun 10 years, a lot of pivots as well. So be ready to pivot.\r\n\r\n\r\nNikolas Hulewsky (01:30.894)\r\nI'm sure, man, especially in your space, marketing. Can you give me an idea of revenue? So you have 150 clients. What does that mean in the top line?\r\n\r\n\r\nBrad Smith (01:39.188)\r\nYeah, we're right at around 100K a month, 80 % margins.\r\n\r\n\r\nNikolas Hulewsky (01:43.074)\r\nWow, man, that's fantastic.\r\n\r\n\r\nBrad Smith (01:44.692)\r\nSo yeah, we automate it.\r\n\r\n\r\nNikolas Hulewsky (01:47.374)\r\nHave margins always been like that?\r\n\r\n\r\nBrad Smith (01:49.17)\r\nAlways. Yep. It's pretty cool. Yeah.\r\n\r\n\r\nNikolas Hulewsky (01:51.502)\r\nJeez, Louise, that is fantastic. When was your aha moment? When were you like, holy crap, this is a money printing machine.\r\n\r\n\r\nBrad Smith (01:59.25)\r\nwhen somebody asked what my margins were like six years ago and I told them and they're like, what?\r\n\r\n\r\nNikolas Hulewsky (02:05.966)\r\nHow long have you been this size?\r\n\r\n\r\nBrad Smith (02:08.34)\r\nWe're going we've actually doubled almost every year start off really small for a few years part-time which will will probably dive into but last four years we've been about this size and\r\n\r\n\r\nNikolas Hulewsky (02:20.11)\r\nAll right, the biz, sorry, I cut you off, keep going.\r\n\r\n\r\nBrad Smith (02:23.284)\r\nI've always thought I wanted to grow it, but I haven't just because I'm enjoying life right now and I have a few other investments. So technically we could just stay here. We're gonna grow it a little bit more over this next year by getting an office and hiring two more, but that's about it.\r\n\r\n\r\nNikolas Hulewsky (02:39.31)\r\nIt's interesting with really high margin businesses like this. Like I always look at it from my perspective. In order for me to have had a business, my main background is in healthcare. In order for me to have had a business in healthcare that was doing, let's just say 100,000 a month, 1.2 million a year, 80 % net margins is going to be, what is that? Holy crap. Like a little over a million dollars a year in profit, okay? In order for me to have had a million dollar a year profit business, I would have had to have had a 10 to $15 million.\r\n\r\n\r\ntop line revenue business, which in healthcare it's big. That's at least 250 employees that you have that you've got to manage a ton of just operational overhead and infrastructure. So many times you're chasing that top line because you know it's going to translate to the bottom line. But yeah, if I was in your position, it's almost like at that point, why would you push to grow?\r\n\r\n\r\nBrad Smith (03:31.902)\r\nExactly. And so the nice part is we're getting presented investment opportunities, just like, you know, Alex and Lila Hermosy do they invest in businesses, without having to do much, but because of our systems that we have, I can easily go and invest in a business. know it'll be profitable and just kind of do that on the side. That's pretty exciting.\r\n\r\n\r\nNikolas Hulewsky (03:51.694)\r\nThat's a really interesting analogy. Do you know much about Alex? Have you ever done any of his courses or read up on him?\r\n\r\n\r\nBrad Smith (03:59.078)\r\nI haven't, but a lot of people say we're like them. My wife and I, came up from a fitness business before this business. So it's pretty funny story, pretty similar.\r\n\r\n\r\nNikolas Hulewsky (04:05.11)\r\nyeah, okay. Well, before we get into the fitness business, I thought what you said was interesting because what Alex's kind of philosophy is right now is they'll invest in businesses, but really he's focused on systematizing sales. It sounds like what you're saying is you'll invest in businesses, but you're also bringing your own systems.\r\n\r\n\r\nBrad Smith (04:26.61)\r\nWe bring in our whole team and we systemize their ads. Yep.\r\n\r\n\r\nNikolas Hulewsky (04:31.566)\r\nOkay. Okay, I'm an idiot. So will you explain to me, first of what's the name of your business?\r\n\r\n\r\nBrad Smith (04:32.382)\r\nSo pretty cool stuff.\r\n\r\n\r\nBrad Smith (04:40.102)\r\nautomation links.\r\n\r\n\r\nNikolas Hulewsky (04:41.614)\r\nOkay, what does that do? What does your business do? How does it work?\r\n\r\n\r\nBrad Smith (04:45.652)\r\nYep. and real quick, can I touch on the thing? Um, a hundred K a month, a lot of people watching and listening, we are oversold the million a month. Oh, we should be making a million dollars or all of this. Well, coming from me doing it 10 years, you'd rather stay small and profitable, such a much better quality of life. And then it allows you to just invest in other things. So just wanted to touch on that. Like the goal isn't for me to be that huge. So\r\n\r\n\r\nNikolas Hulewsky (05:14.254)\r\nNo, so I feel the same exact way because you get to a certain point where I say, I say, I don't want to be a billionaire. I know some people are like, Oh, I'd want a billion dollars, but I don't want to be a billionaire because I know what it would take to get to be a billionaire. It's a lot of sacrifice. It's a lot of hard work. It's a lot of time missed with your family or with your friends or doing things that you want to do. Maybe you get really lucky and you inherit it. Maybe you get really lucky when the lottery or you invent an app and you don't actually have to work that hard. But for most people, it's a very difficult thing to do.\r\n\r\n\r\nAnd what they don't understand is you get to a certain point. So like for you, if you're to grow, your margin is probably going to go down because you need to invest in a team. You need to expand. There'd be a lot more operational complexity to the business. And at that point, it's like, for what? My life's already great. Have you ever heard the Mexican fisherman? Not analogy, but what's it called? Parable. okay, so this is Mexican fisherman and this\r\n\r\n\r\nBrad Smith (06:00.244)\r\nExactly.\r\n\r\n\r\nBrad Smith (06:04.446)\r\nUh-uh.\r\n\r\n\r\nBrad Smith (06:07.837)\r\nNo.\r\n\r\n\r\nNikolas Hulewsky (06:12.898)\r\nAmerican businessman. And the American businessman is down there and he's vacationing and he's watching this Mexican fisherman. And every day the Mexican fisherman goes out for two or three hours, fishes, catches fish, comes back, sells them at the market. And the American businessman sees this a couple of days in a row. And he's like, man, this guy actually does a really job. He's really efficient. He can make more money. So he goes and talks to the Mexican fisherman. He's like, hey, right now you're working two hours a day. It's like, if you worked eight hours a day, you could triple your output.\r\n\r\n\r\nyou could go to the market. like, okay. And then when you triple your output, you could bring on some other people and you could buy more boats and you could have a larger fishing enterprise. And you continue to scale that, you continue to scale that and all of a sudden you've got a pretty big business. And the Mexican fisherman is like, okay, well, and then what do do? He's like, and then you just sit on the beach all day, hang out with your friends and play music. And he's like, well, that's already what I do. I fish for a couple hours a day and I hang out with my friends. So it's like, I like that parable.\r\n\r\n\r\nBrad Smith (07:11.557)\r\nLove it.\r\n\r\n\r\nNikolas Hulewsky (07:12.652)\r\nbecause many times you're chasing, you're chasing just to get to the thing that you're already doing. So I like you calling that out.\r\n\r\n\r\nBrad Smith (07:17.876)\r\n100%, yep, that's a great parable. I'm gonna use that, I'm stealing it.\r\n\r\n\r\nNikolas Hulewsky (07:21.582)\r\nAll right, so tell me, how does it work? Automated links.\r\n\r\n\r\nBrad Smith (07:25.394)\r\nYep. Yeah. And I'll, I love doing like analogies and explaining it. Cause I could say I automate people's businesses and that's just boring. but have you ever said something and this happened to me last summer, we were out on our boat, Nick. And I sit, my wife said something about an energy drink out on the boat, not on our phone phone sitting next to her. And all of a sudden we go, she goes on Instagram and there's the energy drink as an ad in her feed.\r\n\r\n\r\nNikolas Hulewsky (07:32.014)\r\nThanks\r\n\r\n\r\nNikolas Hulewsky (07:52.76)\r\nHuh, huh, no, that's never happened to me. No, absolutely, yeah, happens all the time.\r\n\r\n\r\nBrad Smith (07:58.243)\r\nSo yeah, so some call it stalking, but some call it brilliant. That's what we do. So we enable a business to show their ads and retarget people everywhere. So they never forget. And nowadays, back in the day, you remember when they said you had to sales call someone seven times and they become a customer? Well, now the stats come out where it's, got to see you 24 times on four different channels and then they trust you.\r\n\r\n\r\nNikolas Hulewsky (08:25.047)\r\nWow.\r\n\r\n\r\nHold on a second, 24 different times on four different channels, is that what you said?\r\n\r\n\r\nBrad Smith (08:31.582)\r\nYep, yep. And that's where we're at now, which we'll touch on. Yep.\r\n\r\n\r\nNikolas Hulewsky (08:34.478)\r\nHow much aggregate time? How much aggregate time is that?\r\n\r\n\r\nBrad Smith (08:38.27)\r\nThat usually is a right on two week, two to four week process where they see that many times.\r\n\r\n\r\nNikolas Hulewsky (08:43.51)\r\nOkay, so the first question I have is, wait, are you actually listening to people's conversations when their phones are off?\r\n\r\n\r\nBrad Smith (08:48.968)\r\nWe are. Yep. Well, not me, but I would love to.\r\n\r\n\r\nNikolas Hulewsky (08:50.59)\r\nReally? Kate, I know you're not, but is that, how does that work? Cause I thought app, so I'm an Apple user. Apple for every single app that you use says, would you like to track across, you know, different apps? And I say, no. How is it still listening?\r\n\r\n\r\nBrad Smith (09:07.934)\r\nSo if somebody is super strict on their phone, you shut off Siri completely, you shut off the listening on every single app, then no, that won't work. But there's a lot of ways that bypasses if you have the Google app on your phone, if you don't shut off Siri, there's all kinds of different ways that bypasses there.\r\n\r\n\r\nNikolas Hulewsky (09:25.9)\r\nand obviously it's legal.\r\n\r\n\r\nBrad Smith (09:27.892)\r\nIt's legal. mean, when you sign up for Facebook, you say, hey, sell all my info.\r\n\r\n\r\nNikolas Hulewsky (09:29.016)\r\nthink that...\r\n\r\n\r\nNikolas Hulewsky (09:32.75)\r\n99 % of people I have to believe when they hear that are like, that can't be legal. Is it just in the terms of service? He's just like, click.\r\n\r\n\r\nBrad Smith (09:39.08)\r\nWell, mind blowing right now, guess who's selling all their data to Apple right now? Chat GPT.\r\n\r\n\r\nNikolas Hulewsky (09:48.641)\r\nReally?\r\n\r\n\r\nBrad Smith (09:49.652)\r\nSo whatever you put into chat GPT, they're selling that data to Apple right now.\r\n\r\n\r\nNikolas Hulewsky (09:54.434)\r\nWhy wouldn't they be selling it to Microsoft? I thought they were in a partnership with Microsoft.\r\n\r\n\r\nBrad Smith (09:58.676)\r\nI don't know. Maybe they're selling it to everyone.\r\n\r\n\r\nNikolas Hulewsky (10:02.412)\r\nOkay, all right, so is that a core piece of your business or is that just like, this is something we do along with all of these other targeting marketing strategies?\r\n\r\n\r\nBrad Smith (10:03.454)\r\nSo anyways.\r\n\r\n\r\nBrad Smith (10:13.694)\r\nThat's the core piece now. We used to help people with their Google ads and set up their CRM, but that was still just putting puzzle pieces together. Now we strictly just say, we know your puzzle's not put together, so we're just gonna go do your CRM, your emails, show your ads everywhere, just make you omnipresent.\r\n\r\n\r\nNikolas Hulewsky (10:32.92)\r\nOkay, so CRM, I wanna set the table and I'm gonna explain what I think I understand and then you tell me why I'm wrong. When it comes to digital marketing from what I understand, there are a couple of different channels that you can utilize. The first thing is not a channel, but you mentioned CRM, that's your client or customer relationship management system. So that's gonna be Salesforce, HubSpot, Jobber, any of these systems where you track customers. But you can market to people through\r\n\r\n\r\nSEO, which is search engine optimization. So you can optimize your website. You can have keywords and backlinks and all these other things that you're optimizing for the web to find you. You can have paid ads. So you can pay Google and Meta to actually run ads and put them in front of your target demographic. You can have your Google business profile that you optimize to make sure that when you're searching on maps in particular, your business pops up. And then you can have organic social.\r\n\r\n\r\ncontent, right? So you build a social media team and you put out content about your business, who you are, what you offer, et cetera. It's called organic. mean, it's still marketing, but you're not necessarily paying ads to get that in front of people you're trying to rely on. can boost your organic social, but for the most part, it's not the same as necessarily paid ads. Did I miss anything? Are those sort of the channels with digital marketing? I did miss some. Okay.\r\n\r\n\r\nBrad Smith (11:47.252)\r\nit.\r\n\r\n\r\nBrad Smith (11:56.382)\r\nbut wait, there's more. No, don't think you missed them, but there's so many. And that's where it gets really frustrating and overwhelming for business owners. It just took you what, 60 seconds to spit out all those different channels of business needs. And then, I'm supposed to go do all of that? I don't even have time to do this one thing. I gotta pick up my kids from school. So it's very overwhelming.\r\n\r\n\r\nNikolas Hulewsky (12:00.289)\r\nEducate me.\r\n\r\n\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (12:20.846)\r\nGive me one second, hold on.\r\n\r\n\r\nHey, I'm on a call. I'm on a call right now. Can you, can I go find mom for you?\r\n\r\n\r\nNikolas Hulewsky (12:55.374)\r\nSorry about that. Naked baby, was an exciting one. All right, it took me 60 seconds to name all of that. That's where I set you up, keep going.\r\n\r\n\r\nBrad Smith (12:56.434)\r\nyou're good. That's awesome.\r\n\r\n\r\nBrad Smith (13:04.212)\r\nCool. Yeah, I mean, when you, it takes you 60 seconds just to name all the channels a business owner should be doing. I mean, it's so hard to nail one of those. back, you're supposed to be doing SEO all these years, but SEO takes a year to get results. But now you don't have to do SEO now cause everyone's using chat GPT. So I just wasted all that time. I mean, it's just very overwhelming for business owners. And if you know, small business owners, you can just focus on maybe one of those and get minimal results. But\r\n\r\n\r\nNikolas Hulewsky (13:13.762)\r\nYeah.\r\n\r\n\r\nBrad Smith (13:32.561)\r\nWe work with businesses that truly want to scale. So our average business is making over 20,000 a month. They want to make it to 300,000 a month. We build that system for them because it's so overwhelming.\r\n\r\n\r\nNikolas Hulewsky (13:43.662)\r\nWell, and the other overwhelming thing is even if you know all of those channels, which channel is the best for your business, right? Is it paid ads? Is it organic? you don't even know most of the time and you got to go do a bunch of research and become an expert in that. So it's really difficult. Where does the stocking come in? Like which line does the stocking that you guys do fall under?\r\n\r\n\r\nBrad Smith (14:09.778)\r\nYeah, so I'll go back to that. Nope. That stat I gave you. I like people seeing me 24 times over four channels. And then when I get on that sales call, they're like, I'm ready to sign up. I see you everywhere. Like they already know and trust you. So you got to find those four channels. Your customers are at email automation is one you can email market and remind people through that way. let's just say you're a B2B business. They're on X or LinkedIn. You can market there. but what the stocking comes in is, Hey, you see me, you come to my website once.\r\n\r\n\r\nor maybe you follow me on Facebook, right? The stalking comes in where you then you see me the next day. Then you see a different version of me the day after. And we do this through the ads. You see my email, then you see my Facebook posts, then you see my YouTube ad and you just start seeing me everywhere. Always following up omnipresent those 24 times. That's where the stalking comes in.\r\n\r\n\r\nNikolas Hulewsky (15:01.496)\r\ndo you get my information? it, I go to your website once and then all of sudden it's like, I'm tracking you now everywhere that you go or like what's the initial point of contact that you come into a potential customer?\r\n\r\n\r\nBrad Smith (15:12.424)\r\nNow I want to drill this in because this is an action item I want your audience to take today is setting up your pixels on every channel, even if you're not ready to do ads yet. So a lot of times a business owner doesn't even have pixels on their website or in their market. There you go. Yeah. Yep. Yeah. So Facebook has it. Every platform has a pixel, a code, HTML code that you put in the bottom of your website for tracking purposes.\r\n\r\n\r\nNikolas Hulewsky (15:27.426)\r\nI don't even know what that means.\r\n\r\n\r\nI'm an idiot. Okay, what is- I don't know what that means.\r\n\r\n\r\nNikolas Hulewsky (15:42.35)\r\nReally?\r\n\r\n\r\nBrad Smith (15:43.346)\r\nReally, and so what you have to do is you go to Google, you get a pixel, put it your website. Go to Facebook, grab their pixel, put it in your site. Every single channel, I have one for X, one for LinkedIn, one for YouTube, and so what happens is you can start collecting all that data so when you're ready to run ads, you can just say, show my ads to anyone that's been on my website.\r\n\r\n\r\nNikolas Hulewsky (16:04.462)\r\nOkay, so if I go to LinkedIn, I go to YouTube, I go to X, whatever, I get the pixel and I put it on my website. I don't know how to do that, but I'm assuming it's fairly easy to add to your website. could probably Google it. What does that do? Someone visits your website and now you'll get their LinkedIn, you'll get their Twitter, you'll get their Facebook.\r\n\r\n\r\nBrad Smith (16:23.198)\r\nSo you don't get that. You can just go back to Facebook and you can say, here's an ad, show my ad to anyone that's been on my website in the last 60 days. And I can.\r\n\r\n\r\nNikolas Hulewsky (16:33.195)\r\ndoes that does that person have like a unique identifier that Facebook knows who they are?\r\n\r\n\r\nBrad Smith (16:37.822)\r\nThey do. Each channel has its own identifier through the pixel.\r\n\r\n\r\nNikolas Hulewsky (16:42.958)\r\nWhat? Okay, so you're blowing my mind here. Wait, wait, wait. No, no, no, don't go another step. I need to understand this. I'm so sorry. I go to your website. I'm just Nick Kulinski. I come to your website. Bloop, bloop. And you have this pixel thing set up, right? What information do you take to then go to Facebook and say, hey, target this? Like, did I show up to your website because I've already opted into Facebook's notificat- whatever.\r\n\r\n\r\nBrad Smith (16:44.56)\r\nIt takes another, another step forward is you actually, that's awesome. Good.\r\n\r\n\r\nNikolas Hulewsky (17:11.47)\r\nterms of service and I'm bringing my personal Facebook ID with me and then it leaves it on your website and now you take my personal Facebook ID and you go back to Facebook and you're like target this person.\r\n\r\n\r\nBrad Smith (17:23.678)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (17:26.346)\r\nI love the fact that you are just saying yes and no and you're not hedging and you're not like, well, it doesn't exactly work like that. This is gold. Thank you so much. Okay.\r\n\r\n\r\nBrad Smith (17:36.764)\r\nWe don't need to explain it, but it works.\r\n\r\n\r\nNikolas Hulewsky (17:39.978)\r\nYeah. my gosh. This is why tech companies are so valuable. This is why the social platforms, Instagram, LinkedIn, Facebook, TikTok, they're so valuable because they have the user information. Is this why this was such a big deal a couple of years ago when Apple said, hey, look, Facebook, we're not going to allow you to track across multiple apps? Because then all of sudden Facebook lost the ability to see where else these people were going.\r\n\r\n\r\nBrad Smith (18:00.084)\r\nHuge deal.\r\n\r\n\r\nBrad Smith (18:05.128)\r\nHuge deal. But now there's ways we can get around that. So we get around it now. But that was a huge deal. But that goes into my next point, which is you can actually pixel people on platform. They don't have to go to your website as well. if you... Yeah, so I'll break it down. You see one of my posts on X on Twitter. And if you stop and read my posts for three seconds or more, this is on YouTube.\r\n\r\n\r\nNikolas Hulewsky (18:10.614)\r\nOkay. Okay. All right.\r\n\r\n\r\nNikolas Hulewsky (18:21.208)\r\nWhat does that mean? Sorry, I don't know what that means. Pixel them on platform.\r\n\r\n\r\nBrad Smith (18:33.682)\r\nmet every channel. If you stop for at least three seconds, that platform grabs your pixel and I can retarget you now. I can say, hey, a hundred people have stopped on this post in the last 30 days, show my next ad and say, hey, I saw you were just reading my post yesterday. This is an ad. Go click on my website now.\r\n\r\n\r\nNikolas Hulewsky (18:55.438)\r\nSo if I'm scrolling through the feed on my phone.\r\n\r\n\r\nBrad Smith (18:57.544)\r\nand you stop for three seconds.\r\n\r\n\r\nNikolas Hulewsky (18:59.458)\r\nI just stopped for three seconds. It will know that I'm looking at your post. Do I have to set that up or is that something that Twitter just does or X does automatically?\r\n\r\n\r\nBrad Smith (19:07.39)\r\nyou gotta enable that pixel. And that's where I wanted everyone to take action today.\r\n\r\n\r\nNikolas Hulewsky (19:10.798)\r\nOkay. How would I, so let's say I'm on Twitter. How would I enable the pixel on Twitter?\r\n\r\n\r\nBrad Smith (19:18.77)\r\nYou go to Twitter ads, you click on more in the bottom left and you'll see a button that says ads and you basically just create your ad account. You don't have to turn on your ad, just create the account and you're gonna do this on every channel. Set up, turn on the ad, the pixel and take that code and go put it in your website and you can just leave it for now. But that's gonna start collecting data. So in a few months when you're ready to run ads, you've got thousands of people that have already seen you.\r\n\r\n\r\nthat you can show your ad to.\r\n\r\n\r\nNikolas Hulewsky (19:50.86)\r\nI would go back to Twitter and I would say, hey, these are all the people that stopped on my post for three seconds or more over the last month. I want you to target them.\r\n\r\n\r\nBrad Smith (20:01.424)\r\nOnly them, they already know me like me and trust me. They've seen me at least once.\r\n\r\n\r\nNikolas Hulewsky (20:06.862)\r\nSo Twitter in particular, I get, let's say like last two weeks ago, I had a post that had a 1.5 million impressions on it.\r\n\r\n\r\nDo you know if that's 1.5 million people or if that's just like 500,000 people that saw on average three separate times?\r\n\r\n\r\nBrad Smith (20:23.476)\r\nthink that's 1.5 million.\r\n\r\n\r\nNikolas Hulewsky (20:26.776)\r\nSo I could, holy crap, dude. So I could set that up and have said, go target these 1.5 million people who saw my post and thought it was interesting.\r\n\r\n\r\nBrad Smith (20:35.719)\r\nExactly.\r\n\r\n\r\nSo that's where a lot of people are missing out because they don't have those pixels set up. So you have a 1.5 million posts, probably don't have your pixels set up. So now you can't just go run an ad to those specific people. So let's say you have an event or maybe you just don't know what you're gonna do yet. Just set up those pixels now. So let's say you have an event in a month, you can say, hey, everyone that already knows me, sign up for the event. And they're all gonna sign up for the event because they already know you. If you try doing that to people that have never seen you before, you're gonna get really low results.\r\n\r\n\r\nNikolas Hulewsky (20:39.062)\r\nI need to make a call.\r\n\r\n\r\nNikolas Hulewsky (21:06.958)\r\nDoes that work on Instagram too? If let's say I post an Instagram video.\r\n\r\n\r\nBrad Smith (21:11.858)\r\nYep, same thing.\r\n\r\n\r\nNikolas Hulewsky (21:12.236)\r\nYou're saying yes. I love your brevity.\r\n\r\n\r\nBrad Smith (21:14.868)\r\nIt's even YouTube. So my magic sauce is YouTube, as you can see right here.\r\n\r\n\r\nNikolas Hulewsky (21:20.782)\r\nOkay, I wanted to ask, so here's what this is. I wanted to ask you this, okay? I have started a YouTube channel. I have like 1700, I think subscribers. It's taken me nine months to get that. Chris, my business partner, he started his YouTube channel. He's up to like 120,000 subscribers. It's taking him nine months. Like he's he's very gifted at that. But as you're growing on these social platforms, like Twitter, for example, I've noticed, this is more anecdotally.\r\n\r\n\r\nBut I've noticed people and I've spoken to people who have run ads. They've said the second I ran ads, my organic reach tanked. Like the posts that I was posting like no longer reached the people that I was hoping it would reach. It took a while for me to get my organic reach back. I've never, on YouTube, I know that you can't monetize. You can't get to the number of hours that you need in order to make money from AdSense by doing paid ads. So there's obviously some component there where they don't like.\r\n\r\n\r\nads to drive growth. Is that a thing like on Twitter? Like if I all of a sudden I started using paid ads, does that limit your organic reach?\r\n\r\n\r\nBrad Smith (22:29.554)\r\nIt used to be, it's not anymore. It still is for YouTube. But let me, you're thinking about it wrong. And most people are thinking about it wrong. You're thinking I'm gonna run ads to build up my channel, right? But you wanna build your channel up organically and then use ads to remind people to take an action.\r\n\r\n\r\nNikolas Hulewsky (22:38.542)\r\nPlease.\r\n\r\n\r\nNikolas Hulewsky (22:54.402)\r\nVery good framework.\r\n\r\n\r\nBrad Smith (22:56.104)\r\nRight? Continue building organically, 1.5 million views on an organic post, and then use an ad to say, remember me? You like my post. Now go click on my website.\r\n\r\n\r\nNikolas Hulewsky (22:57.164)\r\nYeah, that's a very good framework.\r\n\r\n\r\nNikolas Hulewsky (23:06.446)\r\nSo if I'm using ads to grow, that's when I might see the negative side effects from growth. But if I'm using an ad just to say, hey, please take this action, it's not necessarily the same thing. That is freaking fascinating.\r\n\r\n\r\nBrad Smith (23:19.924)\r\nIt's not. So here's the cool part. YouTube, and I just heard this yesterday actually, wealthy people pay 20 bucks a month to not be shown ads on YouTube now. This is what we do. You watch my organic YouTube video, you learn something from me, right? I don't tell you to go click on anything, but I pixel you and now you see my ad, cause you watch my YouTube video on all of Google's networks.\r\n\r\n\r\nYou'll see my ad in your Gmail. You'll see it on other people's websites. You'll see it on Google search. You'll see it on the Google app, all because you watched my YouTube video. Even if you have YouTube ads turned off, you'll see it on all of other Google's networks.\r\n\r\n\r\nNikolas Hulewsky (24:07.554)\r\nWhat kind of businesses are best for this? as I'm listening, it's like, okay, if you have an audience on these social platforms, then this pixel tracking is fantastic because you can see all the people who have come in and out and then you can target them. But if I'm a small business and I don't necessarily have a social presence, does this work for me?\r\n\r\n\r\nBrad Smith (24:29.352)\r\nYes, at a small scale, one channel, one ad, not four channels, every single, you know, try to be everywhere. So what I...\r\n\r\n\r\nNikolas Hulewsky (24:38.254)\r\nBut either way, they've got to have a social channel or would email count? Like, let's just say they have an email list.\r\n\r\n\r\nBrad Smith (24:43.186)\r\nat least one.\r\n\r\n\r\nBrad Smith (24:47.944)\r\nHow are they getting email subscribers?\r\n\r\n\r\nNikolas Hulewsky (24:51.246)\r\nPlus they say they have a website. I don't know. Google business profile that drives to their website. That's a good point. Yeah, yeah.\r\n\r\n\r\nBrad Smith (24:53.832)\r\nHow, yeah, per, good. Well, Google business profile, that means they're doing SEO. So that's our one channel. They're focused on Google SEO, getting someone to do Google My Business. They get to the website and then they follow up with those emails, 24 emails. Just keep following up with them.\r\n\r\n\r\nNikolas Hulewsky (25:11.086)\r\nSo if it's coming to your website from Google, because you've got the Google Pixel, you're able to go to Google and say, I want to target these people. And that's when you're able to go into Gmail. You're able to go into Maps. You're able to go into search and target them with ads.\r\n\r\n\r\nBrad Smith (25:25.172)\r\nLet's use a couple of business examples. Local restaurant, right? Somebody looks for a local food. They go to their Google My Business profile. I'm not gonna eat there today. Well, then they can set up a retargeting ad to say, hey, don't forget to come to our restaurant next weekend.\r\n\r\n\r\nNikolas Hulewsky (25:28.654)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (25:41.846)\r\nHmm, really?\r\n\r\n\r\nBrad Smith (25:43.488)\r\nHow about a solopreneur? Somebody that is starting out, they're trying to start their online business. Let's say they just are specializing in one thing for businesses. Go to X, start doing organic posts where you're helpful, set up those pixels, and then a couple months later after you get some people to engage, show another ad and say, hey, by the way, you followed me, go to my website now.\r\n\r\n\r\nNikolas Hulewsky (26:06.684)\r\nDoes it cost anything to do those pixels to set them up?\r\n\r\n\r\nBrad Smith (26:09.3)\r\nSo to set them up, it's free. You just have to create the ad account, but actually turn them on. You got to pay per click. It's an ad\r\n\r\n\r\nNikolas Hulewsky (26:16.782)\r\nWhen you say, oh, so when I'm running the ad, of course, yes, I have to pay. I have to pay per click. But when I'm just collecting the data, I don't have to pay.\r\n\r\n\r\nBrad Smith (26:26.938)\r\nA quick tip for someone maybe a little bit more advanced, just go to a software like Fiverr or Upwork and they'll set up all your pixels into a Google Tag Manager. So it's one code and just hire someone for 15 bucks to go do all those for you.\r\n\r\n\r\nNikolas Hulewsky (26:42.598)\r\nInteresting. What's the best profile of business or typical profile of a business that you work with that are using this strategy in particular?\r\n\r\n\r\nBrad Smith (26:51.828)\r\nWell, since I know every business needs customers and sales and they want to show 24 times any business, but that's a trick question. About half of our clients are like entrepreneurs, B2B style business owners. And then the other half are e-commerce. So.\r\n\r\n\r\nNikolas Hulewsky (26:59.502)\r\nshirt.\r\n\r\n\r\nNikolas Hulewsky (27:09.249)\r\nYeah, this would make a lot of sense for e-commerce. That makes sense. Wow. All right. So if I'm a business owner and let's say I'm listening to this and I don't have any socials set up, maybe I'm on Twitter, right? Or maybe I have a personal Instagram or maybe whatever it is, but they're a novice when it comes to this. And they're sitting here and like, Brad, I don't even know how to take advantage of this. Like what's my first step? What would you tell them?\r\n\r\n\r\nBrad Smith (27:37.278)\r\nSo choose one channel that you know your customers are gonna be at or some channel you enjoy being on as long as your customers wanna be on there. Let's say you just like text writing, go to Twitter. So choose one channel you will become the expert on and be the educator on. So I'm gonna start there. You have to choose a channel and you have to be the educator on that channel. As an example, I call my YouTube channel boring. All of my content starts on my YouTube channel.\r\n\r\n\r\nSo I choose one channel, that's YouTube, and I make one educational boring video teaching someone something. So choose Twitter and few times a week, post an educational piece, helping and teaching somebody. If you're new, maybe you don't have that experience. So you could simply just talk about what you're learning for yourself, sharing something you failed at and how you changed it and how it's working for you now.\r\n\r\n\r\nand then stick with that one channel.\r\n\r\n\r\nNikolas Hulewsky (28:36.013)\r\nWhat if\r\n\r\n\r\nWhat if even before that, even before start posting to a channel, I'm gonna say, I'm just gonna assume everybody listening to this right now who's a business owner has some type of an SEO strategy, some type of a search strategy. Would that be the easiest first step? It's like, just put the Google Pixel on your website and start collecting data so that you can see kind of who's coming. And then maybe a month or two down the road,\r\n\r\n\r\nyou know, run a targeted ad. Would that be the first easiest step?\r\n\r\n\r\nBrad Smith (29:14.792)\r\ndon't think so. know. think building up and just teaching on one social platform, because you have to think where people are. So I think less and less people are reading articles now and less and less people are just going to Google. I was on a client who's in his twenties and young twenties and we get access to their Google accounts. I logged in. First thing I did was brought me to chat GPT instead of Google.\r\n\r\n\r\nNikolas Hulewsky (29:16.097)\r\nNo, okay.\r\n\r\n\r\nNikolas Hulewsky (29:30.862)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (29:40.568)\r\nReally?\r\n\r\n\r\nBrad Smith (29:41.384)\r\nHe doesn't even have Google enabled on his browser. So it brought me to check. So the younger people are going to TikTok and chat GPT for their searches now. So.\r\n\r\n\r\nNikolas Hulewsky (29:43.854)\r\nThat's amazing.\r\n\r\n\r\nNikolas Hulewsky (29:51.308)\r\nWell, if I'm a home services business, this would be like the only counter to that. I would think just because I'm a consumer of this, if I'm like, crap, I need someone to turn my trees or I need a plumber or I need an electrician, I'm going to Google. I'm Googling locally who are those people or I'm going to Google Maps and I'm looking for those people. Is that not the case anymore? Like I agree with you on the chat GBT because I go to that for questions over Google at this point.\r\n\r\n\r\nbut when I'm searching for specific services in my area, I still go to Google.\r\n\r\n\r\nBrad Smith (30:22.664)\r\nYeah, and what did they show first? They show Google Maps now, don't they? Yep. So I think you just led me into that. If you're a local business, the best place to be is Google Maps, optimizing the SEO for that. But did you know you can show your ad at the top of Google Maps?\r\n\r\n\r\nNikolas Hulewsky (30:26.734)\r\nhuh, yeah.\r\n\r\n\r\nNikolas Hulewsky (30:42.498)\r\nI did not know that,\r\n\r\n\r\nBrad Smith (30:44.084)\r\nSo have a client, local pizzeria here. He's got five locations here in Wilmington. And anytime someone types in pizza or pizza in Wilmington, he's number one every time because we do a sponsored ad at the top and he has zero competition. No one else is running ads on Google Maps. He's the only one. So that's key.\r\n\r\n\r\nNikolas Hulewsky (30:54.933)\r\nsingle time.\r\n\r\n\r\nNikolas Hulewsky (31:03.596)\r\nI mean, I've deep dived into digital marketing. Obviously, I'm not an expert. I've never heard the pixel thing before. Is this just like the best kept well-known secret or was I just an idiot and didn't pay attention to it?\r\n\r\n\r\nBrad Smith (31:17.524)\r\nI think idiot didn't pay attention. I'm kidding.\r\n\r\n\r\nNikolas Hulewsky (31:20.28)\r\nReally? Geez. Hey, that wouldn't be the first time, Wouldn't be the first time.\r\n\r\n\r\nBrad Smith (31:24.628)\r\nThat's awesome. No, it's just something that no one thinks they need right now. Oh, I'll do it when I'm ready for ads or so you, a of people don't think they should do it now, but I just say do it now and had set it up to collect data.\r\n\r\n\r\nNikolas Hulewsky (31:36.984)\r\nCould you collect, so you collect this data, could you then go and look at it and see like, okay, what's the age demographic of people who are coming to my site from Google? What is the, are they males, are they females? What's their, like, what are all the demographic information that I would get by setting up the pixel?\r\n\r\n\r\nBrad Smith (31:52.66)\r\nMale, female, age, location. Like it's probably 70 % accurate, 80 % accurate, but once it's at scale and you have enough numbers, it's pretty good.\r\n\r\n\r\nNikolas Hulewsky (32:02.286)\r\nBut beyond that, it's not telling me like household income or I'm trying to think of anything, job type or any of that other stuff. It's just the basics, age, sex, location.\r\n\r\n\r\nBrad Smith (32:13.438)\r\nBasics and quantity, how many people.\r\n\r\n\r\nNikolas Hulewsky (32:18.771)\r\nOK, so it will give you unique visitors, right? Somebody comes to your site 10 times, it's not going to tell you there were 10 different people.\r\n\r\n\r\nBrad Smith (32:26.056)\r\nRight, exactly. It'll say you can retarget to a thousand people. So for a local business, I say you do that on Google, especially somebody does a Google search, they see you on the Google maps, and then you just want them to see you next time they're on Google or next time they're on YouTube. For that pizza shop, if they come to their website, they then see them on YouTube as a YouTube ad to come back and eat pizza there.\r\n\r\n\r\nNikolas Hulewsky (32:31.533)\r\nCheers.\r\n\r\n\r\nThank\r\n\r\n\r\nNikolas Hulewsky (32:50.466)\r\nI'm gonna tie a bow on this piece. I'm gonna just summarize what you said and I want you to tell me if this is at least somewhat close and you can correct me where I'm wrong. If I'm listening and I'm a service based business that gets a lot of traffic from Google, I would go right now and turn on your Pixel. That'd be my first thing. If I'm any other business that is using social media, I would either pick a channel or double down on putting,\r\n\r\n\r\ncontent out and turn the pixels on for all of those channels. Or if I'm not on social media, I would pick one channel, start educating in a hyper niche way on that channel and turn on the pixels. That's all pixel related.\r\n\r\n\r\nBrad Smith (33:33.801)\r\nBingo.\r\n\r\n\r\nSet those pixels up now so you can retarget later. Also, one last point on that. If I try to run ads to just people that have never heard of me before, your cost is much higher. So let's just say, if I just say, hey, I'm gonna run this ad on whatever platform and say, you've never heard of me, but go to my website, you'll probably pay two bucks for that person to click. But if I run my ad to a pixel, somebody that's already seen me before, that's on my pixel, it's about a quarter of the cost. So you'll pay maybe 50 cents instead of $2.\r\n\r\n\r\nNikolas Hulewsky (34:06.05)\r\nWow.\r\n\r\n\r\nBrad Smith (34:07.284)\r\nSo your cost per click will be much lower once it's time to turn those ads on.\r\n\r\n\r\nNikolas Hulewsky (34:11.726)\r\nBecause if I'm going to Meta and I'm running ads, they'll ask me, hey, how specific do you want to get? Where do they live? What's their household income? What's their sex? How many children do they have? they married? Are they divorced? Whatever. And I can push ads to them. But what you're saying is, hey, this is my ideal customer. Go find them. The pixel is, these people have already come to me. Retarget them.\r\n\r\n\r\nBrad Smith (34:32.936)\r\nYep. For a quarter of the cost. And they already know me. So bingo. And that's how a business truly scales.\r\n\r\n\r\nNikolas Hulewsky (34:36.024)\r\nFour quarter of a cost. Geez. right. Brad, love I freaking love this has been. I think this is the best tactical episode I've ever had. You're fantastic at conveying this information. Here's my last question, because I wanted to ask it. You said earlier or maybe I watched it in one of your videos. I think SEO is getting massively disrupted right now and.\r\n\r\n\r\nBrad Smith (34:51.732)\r\nThat's awesome.\r\n\r\n\r\nNikolas Hulewsky (35:05.482)\r\nWhat's been interesting is if you go and Google anything, ask it a question, any qualitative question, Gemini is now responding back to you with an answer. And so that is severely limiting all of the SEO that people have invested in over time that we're relying on those types of questions and keywords. But you've said that there's like a four step ranking system in the new AI answers that Google has. Do I understand that right?\r\n\r\n\r\nBrad Smith (35:30.718)\r\nYeah, that's actually what grew by YouTube channel was when I realized that about a year and a half ago, Google said that they were going to start doing generative AI answers at the top to give their users a quick response, a quick summary, and they're going to pull that data from sites. So gone are the days where Google said, go read a full article if you want to learn something, just stay on Google and we'll tell you what it is in a quick summary.\r\n\r\n\r\nAnd so what I did was I reverse engineered that I signed up for the beta and I started searching, searching, searching, finding what all those first things were Google was showing and what they were doing was four simple answers to your one question. And so for stages of four, here's four. Yeah. How do. Yeah. How to grow a business. And then they would say, here's four steps to grow a business. And each one of those four would either come from one article or four different articles. That makes sense.\r\n\r\n\r\nNikolas Hulewsky (36:13.88)\r\nlike those kind of articles essentially.\r\n\r\n\r\nNikolas Hulewsky (36:20.718)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (36:26.254)\r\nInteresting. Yeah, yeah, yeah. Okay.\r\n\r\n\r\nBrad Smith (36:28.244)\r\nSo I said, all right, well, where are they getting that info? Well, they're getting it from websites. Well, how are they finding that info on the website? Well, they gotta go search for it. And then I realized they were starting to find it from the FAQs on websites as well. So what I started doing was I would do four simple answers to your question at the top of every single one of my blogs. I gave Google the exact four things I wanted them to put at the top as the answer.\r\n\r\n\r\nNikolas Hulewsky (36:59.329)\r\nInteresting.\r\n\r\n\r\nBrad Smith (36:59.336)\r\nAnd they did it. I've got 10 YouTube video blogs that ranked number one on Google.\r\n\r\n\r\nNikolas Hulewsky (37:05.442)\r\nOkay, so you started as a video and that turned into a blog.\r\n\r\n\r\nBrad Smith (37:08.948)\r\nSo that's where I talked earlier, YouTube is where all my content starts. So I create a YouTube video and what that does is it generates my blog post and all my social media post. So what I would do is take that YouTube video transcription, write the blog post, and then give it those four simple answers at the top to where you literally don't have to read my blog, because I'm just giving you exactly what you search for at the top.\r\n\r\n\r\nNikolas Hulewsky (37:31.886)\r\nI watched one of your videos and you have like a clear content calendar strategy. Can you talk a little bit about that?\r\n\r\n\r\nBrad Smith (37:40.584)\r\nWell, I'm actually gonna be releasing that soon. That'll be great.\r\n\r\n\r\nNikolas Hulewsky (37:43.63)\r\nI put out a lot of content and I'm always like, what am I posting today? Hmm, what should it be? Like, I feel like I spend a lot of energy trying to figure out what I'm posting. And I think if I was a business owner, I would be overwhelmed. Well, what am I supposed to post? When do I post? How do I post? Where do I post, et cetera? You have a really simple system that you're releasing. What is it?\r\n\r\n\r\nBrad Smith (38:02.174)\r\nSo it's themed days. have a day, every day is a theme for me. Motivational Monday, Testimonial Tuesday, Website Wednesday, Throwback Thursday, that's my favorite, and FAQ Friday, and then Relatable Saturday. And so I'm like, I don't know what to post. And I came up with this years ago, and I've been using it ever since, and it's what's really helped me grow, is I know every Tuesday, I'm posting testimonials on all my channels. Every Thursday, I'm going back at the,\r\n\r\n\r\nNikolas Hulewsky (38:30.35)\r\namazing.\r\n\r\n\r\nBrad Smith (38:32.228)\r\noldest ugliest picture of myself and I'm posting that because it's a throwback.\r\n\r\n\r\nNikolas Hulewsky (38:36.162)\r\nYeah, I mean, back to the Alex Ramosi conversation, you've systematized it, right? Like, you're only as good as the systems that you create for yourself. And it's hard to stay consistent if you don't have a real system. I love that. When are you releasing that?\r\n\r\n\r\nBrad Smith (38:42.078)\r\nsystem.\r\n\r\n\r\nBrad Smith (38:50.228)\r\npretty cool. This, I'd say beginning first week of February. I'll put, if you could post that link down below, I want to send it to everyone.\r\n\r\n\r\nNikolas Hulewsky (38:58.712)\r\nOkay, I'd love one, man. I need to play around with it. Well, this has been a fantastic conversation, I really, really appreciate you coming on and I'd encourage anybody listening to go check out Brad's company, Automation. Is it automated or automation links?\r\n\r\n\r\nBrad Smith (39:01.684)\r\nYou gotta get it.\r\n\r\n\r\nBrad Smith (39:12.637)\r\nAutomation links.\r\n\r\n\r\nNikolas Hulewsky (39:14.378)\r\nautomation links. Go check out his YouTube channel as well. It's fantastic content on there and we'll talk soon. Alright, stay on for a second.\r\n\r\n\r\nBrad Smith (39:20.148)\r\nAppreciate it.",
  "metadata": {
    "duration": "",
    "date": "2025-03-05",
    "platform_source": "Google Drive"
  }
}