{
  "episode_number": "41",
  "episode_title": "Training 1500+ People to Grow Their Own Home Services Biz with Johnny Robinson",
  "guest_name": "Johnny Robinson",
  "business_name": "Home Service Academy",
  "transcript": "﻿I said, Hey, I'm going to build this house cleaning business to 20 K a month or 30 K a month. I forgot what I said in 90 days, watch me do it. And that's exactly what happened. We ended up getting it to 12 grand its first month with 4k of profit and then 20 grand the second with eight grand of profit. \r\n\r\n\r\nIf you're anything like most entrepreneurs, you've probably dreamed about launching a new and profitable business. Just selling your services, no product, no overhead, no employees to manage, just you running a one man shop. Profitably. And you've probably done the calculations in some Excel spreadsheet and conservatively projected that in the first year you could do a half a million dollars in revenue. \r\n\r\n\r\nWell,  what happens when launch day finally comes  and you don't hit those numbers? In fact, you're not even close to that 9, 000 a week that you were projecting. You're triple.  What's your plan now? How do you deal with that? Holy crap. Moment.  My name is Nicholas Helusky and welcome to another episode of Nickonomics.\r\n\r\n\r\nThis is the show for entrepreneurs and watch for those who are curious to hear how other businesses work. I've owned and operated more than a dozen businesses generating 30 million a year in revenue and employing more than 300 people. And my guest today is Johnny Robinson. He Nickonomics. Just what I described.\r\n\r\n\r\nHe is the founder of the home services Academy. And in this episode, you'll hear how he launched his company to do 2. 8 million in the top line and 1. 5 million in its first nine months,  how he's helped more than 1500 entrepreneurs start their own cleaning businesses and what it was like for him letting his mom know that she could retire from her job as an Uber driver. \r\n\r\n\r\nFreaking great conversation. You're not going to want to miss this one. Enjoy. Okay, guys, we're going to get back to the show in just one second. But first a message from a sponsor who is me. Oh, it's me. Cause I'm doing the show for free. Listen, I want to give you a hundred dollars.  All you have to do is go to Apple or Spotify. \r\n\r\n\r\nGive me five stars, write a review, screenshot that review, send it to me, Nick at cofounders. com and you will be entered to win a hundred dollar Amazon gift card every four episodes. I am going to choose a winner at random and I'm going to do this five times, 500 for five stars. I just made that up. It's what I'm calling it.\r\n\r\n\r\nPlease go to Apple or Spotify, leave a review, screenshot it, send it to me, Nick at cofounders. com and you'll be entered to win a hundred dollar Amazon gift card. All right, let's get back to the show. All right, Johnny, welcome to Nickonomics, my friend. Stoked to have you.  Dude, thanks for having me, man. I'm a big fan of what you and Chris are doing on Twitter.\r\n\r\n\r\nI followed you guys for a while. I'm really excited to be here. Same. This is like the first time in a long time  we get to actually talk to each other. Yeah, a hundred percent. And don't think I didn't see your tweet about, oh, my business does more, or I pay more in taxes than your cleaning business.  Maybe we'll talk about that.\r\n\r\n\r\nYou know? Yeah, we will talk about that. But you know, what's funny about that tweet? I tweeted cause I was very upset that I was paying a lot in taxes. I tweeted that, Hey, this year I'm going to pay more in taxes than your top line revenue of your cleaning company. And then I got a lot of people reaching out to me, they're like, that's freaking messed up, bro. \r\n\r\n\r\nI didn't feel, I felt a little bad about it, but Oh no, I don't feel bad. Yeah. I thought it was funny. You're the OG  of cleaning Twitter. And I'm stoked to have you on here because I think you just will offer a really interesting perspective in  what that's looked like over a long period of time. But before we get into that, will you just give a brief introduction of what your business is and how you make money? \r\n\r\n\r\nYeah. So I run a education company called Home Service Academy. The best way I could describe it is like a low cost alternative to a franchise. People will lump it in with courses and that's fine. You can do that. There is a course component to it. But largely it's a service business where we have a big staff of coaches that work with you one on one to help you build a cleaning company in 16 weeks to about five months.\r\n\r\n\r\nSo depending, and they work with you one on one, they go from dirt to 10, 20, 30 K a month, as much as you want to put into it. And then we'll say, Hey, once you get to that point, join our mastermind. And so it's this big education company. We've helped over 1500 people start cleaning businesses at this point in the last two and a half years. \r\n\r\n\r\n1500 1500 people. That is incredible. Do you track them post? Like are they all in business? Like what percentage of them would you say are still in business? I would say probably around 50 to 60 percent of them are still in business. We've had some like just smash successes and for some reason they shut down the business.\r\n\r\n\r\nWe had a guy in Atlanta who got up to 30, 000 a month, about 10 K a month in cashflow for brand new business. It was only four months old and he decided to shut it down because it was too stressful. And so a big learning from me with helping people is one, it's like a college class, right? You're going to have the A students, the B students, the C students.\r\n\r\n\r\nYou're going to be able to fail no matter what you do and how hard you try. Obviously we try to get as much success as possible because if we're going to take credit for. People who win. I also want to take credit for people who lose. You can't do both. 1500 people who've gone through your program and you've got 700, 700 to 800 that are still out there active.\r\n\r\n\r\nThat's pretty incredible. How long have you been doing it? When was HSA founded? January,  2022.  And before you founded HSA, what were you? Yeah. So I didn't have any background in business or anything, which I'll tell the story real quick. Me and Serge. So Serge was my best friend since the seventh grade. I've known him.\r\n\r\n\r\nWe were still in business together, 50 50. It's been like that since we started our first business. And so he's like a brother to me. I just, he just had his wedding. I was, I'd give a best man's speech. So we're in this like relationship now, you know, but we got together after college. We were 19 and we were like, dude, what can we do?\r\n\r\n\r\nWhat can we do? Like, what do you want to do after we graduate? And I had this bright idea to start a business cause I had just found out that you didn't need a degree to start a business. I thought you needed to go to school, get a business degree and start a business. And this is pretty like a small business, Twitter money, Twitter, or maybe it was there, but I didn't know about it.\r\n\r\n\r\nThis is 2017. We're talking about this, right? Not a lot of content out there on how to build businesses. At least as much as there is now.  And so we're like, okay, how do we make money tomorrow? We, we came to the conclusion that we want to start this business together. And so it was between landscaping and window cleaning.\r\n\r\n\r\nWe decided we wanted to do window cleaning. We started with 150 bucks. I pitched in 75, he pitched in 75. We ordered some stuff off Amazon and we just went and started knocking doors. And slowly but surely over the next four and a five, four and a half years, we built up still to this day, that orange window cleaning.\r\n\r\n\r\nIs the number one window cleaning business in orange county. We outrank Yelp. We're the number one on the map pack. If you look up window cleaning in orange county, where you're going to see orange window cleaning at the top of everything. And we got that business to about 65. We had 170, 000 a month, but consistently 65, 000 a month.\r\n\r\n\r\nWe ended up buying businesses, merging them together. It was pretty cool. It was what we learned a lot. We staffed the team.  It got to the point where workers comp in California was really expensive for us because it's like 22 for every 100 of payroll insanity. Yeah. And it just wasn't where we had two partners.\r\n\r\n\r\nWe had to live off the business too. Plus reinvest into trucks and equipment. So we're like, Hmm, let's try this contractor thing. After we had an employee leave and say, Hey, if you ever need work done, I'll take a 50, 50 split. And I'm thinking in my mind, hell no. Am I ever going to give you 50%? You're not going to, you're not going to come in our wrap truck.\r\n\r\n\r\nYou're not going to have our, our branding on.  And we got into a bind where we really needed to get this big job done. So I called him up and he's like, yeah, I'll take care of it. Went and took care of it. Two days later, showed up to the office with the check for four grand. And I was like, oh my God, that was so easy.\r\n\r\n\r\nI don't have to pay a worker's comp. I don't have to pay apparel. Then we switched the whole model to contractors only on 50 50 splits and raised our profit and basically removed us from having to go in the field because we can staff contractors very quickly.  And so converted the whole business started tweeting about it and people like, how the hell do I do this window cleaning thing?\r\n\r\n\r\nAnd I was like, you really can't because it depends on the market really heavily for window cleaning to work because you need a lot of specialized equipment to get to those 2nd and 3rd story windows. And it's, you don't want to do that with ladders a lot of the time because it's very risky, which is why the worker's comp is so high.\r\n\r\n\r\nAnd so window cleaning won't work, but you know what would work and people would eat up is a house cleaning business. And at the time my mom was a full time single mom raised me and she was, I'm not talking like 40 hour work, but she's like 50, 60 hours driving Uber, 3, 200 a month rent in orange County. \r\n\r\n\r\nAnd I wasn't to the point with the window cleaning business where I was like, here, mom, here's like five grand a month. Just.  Just chill, right? You're old. Go retire. You're getting old. Go retire. So I was like, but I can use my, I could use my skills  to replace her income with the cleaning business where all she has to do is pick up phone calls and hire the cleaners and send them to jobs.\r\n\r\n\r\nAnd I can also continue to build my audience and not got too birch with one phone. And so that's what I did. I called my shot and I said, Hey, I'm going to build this house cleaning business to 20k a month or 30k a month. I forgot what I said in 90 days. Watch me do it. And that's exactly what happened. We ended up getting it to 12 grand its first month with 4k of profit and then 20 grand the second with eight grand of profit.\r\n\r\n\r\nAnd, uh, she's never worked Uber. Since that's happened. And she now is opening her second location here in Las Vegas. That's awesome, man. Yeah. Marianna Mott finished at 180, a little over 180 grand so far at the end of June on the year. So she pays about three 60 with 50 percent of that being net. So the margins are really great.\r\n\r\n\r\nUh, and then congratulations. That's a really cool thing to be able to do for your mom. Thank you. Yeah, it's been awesome. I completely changed her life and she made 150 grand in take home income last year on the tax return. So it's more money than she's ever made and she's stoked and she's, I'll just say it.\r\n\r\n\r\nI have five boys and I watched my wife give birth to all of those kids. I'm like, she gets like whatever she wants, whenever she wants, man, carrying you around, raising you.  Yeah. Women go through a lot. So that's rad. You were able to. Yeah. A hundred percent. I mean, you got to think, especially as a single mom too, I don't think they get enough love.\r\n\r\n\r\nLike you watch your mom struggle and have to do both jobs as a parent. Oh yeah. As a young man, I'd hope that you'd want to help, help that person out, you know? So you started the window washing business in orange County, by the way, window washing was one of my first jobs and I got fired very quickly cause I sucked at it.\r\n\r\n\r\nIt does take some skill, believe it or not. It does take some skill. My problem was I was too freaking slow. Good buddy of mine got me the job and we were like working. He's like, I don't think it's working out for you, man. It takes you like 20 minutes to do three windows. But anyways, it's, it's hard to do. \r\n\r\n\r\nSo you started the window washing business. From there, you just through serendipity, had this experience where this guy paid you half of the job that you were able to generate, and so you kind of had this thesis, Hey, I could generate jobs and just sub them out and then charge a fee essentially for those jobs, which is very, very similar to Chris and I.\r\n\r\n\r\nWe have a tree trimming business in Dallas. We don't have any crews on payroll. We sub out everything, so everything's. Generated. We bring it in, we close the lead and then we sub out to other crews. So I, I really, I like that business model, but there are a ton of different home services. What made you start  pivot into the cleaning?\r\n\r\n\r\nI think you said when you were looking originally it was window washing and. Landscaping. Landscaping. Why not go into landscaping? Like, why cleaning? Well, because I knew house cleaning, the availability of contractors was really, really high. You could hire anyone because anybody can go to Home Depot, get some cleaning supplies and go clean the house.\r\n\r\n\r\nLandscaping, you still need lawnmowers. You still probably need a truck to carry that around. There's a little bit more of a barrier there as opposed to something like house cleaning, where you can readily hire pretty much anyone to go clean houses. And so that was literally the deciding factor and no barriers to entry or there's no trade licenses you need for cleaning or anything like that. \r\n\r\n\r\nWhat made you make the switch from, all right, I've got a profitable cleaning business first month. I think you said you did 12, 004 net or so 12, 000 top line, 4, 000 net. And then second month, I think you said 20, 000 top line, 10, 000 net somewhere.  Yeah. 8, 000. Okay. So in that ballpark, so like you're growing, you're profitable.\r\n\r\n\r\nYou understand what you need to do in order to generate leads and then close them, sub them out. When did you have the idea? Like how long between starting that business and having the idea of maybe I should open a university where people can come and get trained on how to start these businesses. Those two months were November, December, and then people like the amount of people that were DMing me on Twitter to understand how to start a cleaning business because no one was doing this just because you posted about it just because you're like, Hey guys, I'm calling my shot.\r\n\r\n\r\nI'm going to do this. And then you did it. And people were like, take my money. Yeah. Right. Back in the day, you got to keep cleaning. Twitter was non existent dude. Like I liked, I'm very proud to claim like the whole remote cleaning term. I was the one that tweeted that first. Like nobody was tweeting remote cleaning before me.\r\n\r\n\r\nYes. 100%. Nobody was doing this stuff. And I, this is before I knew all the referral agency rules to about the 50 50 split. We just happened to do that in the window cleaning business. Right. And then I found some other people like Neil who runs a franchise like, okay, so there's like some actual like guidelines behind this stuff. \r\n\r\n\r\nWhat happened was the amount of inbound interest in starting a cleaning company, which is so overwhelming. I was like, okay, Sergio, let's,  let's see if there's some, see if there's a business here. Let's pre sell packages. At 4, 200 and let's cut it off after two weeks and let's coach these people for three months and see if we can get them results.\r\n\r\n\r\nAnd if we get them results and why 4, 200,  I, you know, looking back, you just feel like you're like,  hold out my ass, you know?  And so  4, 200 was the price point. And what happened was we were like, okay, we didn't have a product. We didn't have anything. And I just hopped on sales calls for two weeks. I ended up collecting 50, 000 in two weeks.\r\n\r\n\r\nWhat?  50, 000 in two weeks? In two weeks, 50k in two weeks and I cut it off. 15 people.  Let's back up here. So cleaning courses on Twitter are a popular thing. And one thing that I notice is  some of these guys will start a cleaning company that gets 20, 000 a month in revenue. And then all of a sudden their new business model becomes selling courses on how to get to 20, 000 a month in revenue.\r\n\r\n\r\nAnd it's not just cleaning companies, you know, landscaping, pressure washing, like all these other businesses do it on Twitter, but it's because they have a captive audience of individuals who are like looking for that side hustle or looking to make a quick buck for you. How big was your audience  that was able to generate 50, 000 in two weeks?\r\n\r\n\r\nAre we talking like, did you have like 50, 000 followers that you tweeted this out to? Or like, what, what was the size of your target demographic? I want to say I had like 7, followers at the time. What?  Okay. Seven or 8, 000 followers. They're following you along. You're successful. You're making money. And then,  and then they essentially generate 50, 000 of lead flow, not even lead flow of closed business in two weeks.\r\n\r\n\r\nOkay. Yeah. That's dude. That is mind boggling. It could have been more, but I closed it off after two weeks because I wanted to make sure we could get results. So we collected the 50 grand and then we're like, Holy crap. Like, so yeah, what did you do? All right. So you have the 50 grand it's sitting in your bank account.\r\n\r\n\r\nIt's cool. Like you must feel great because you have your idea validated where you're like, Oh, cool. There actually was demand here,  but now you have to like figure out how to train these people. Right. Did you have any experience in that? We didn't even have a product. So we built it in a weekend because it was like January 1st and we started the sales calls.\r\n\r\n\r\nJanuary 17th was the launch day. And so we set up everything. We had like the community on circle. We were on school yet. We switched to school like a month later, but we had circle, we were like figuring out how to host the course. We figured out how to do everything. And you launched January 1st and January 17th is when the course starts.\r\n\r\n\r\nYeah. And we didn't have anything. So you have a 17 day sprint where you got to figure out what does the curriculum look like? How do these people coordinate? How do we communicate that to them? You know, how are we making sure they're getting the value that they're paying for? I'm guessing you had a money back guarantee, but it's like, yeah, we don't want to give 50, 000 back to these people.\r\n\r\n\r\nOur original guarantee was a two to one ROI money back guarantee, which if you don't make at least double what you invest into, by the end of the year, we'll give you your money back.  That's right. Did anybody try to collect on that?  No. So what did those first two weeks look like? Like between January 1st and January 17th, where you just, okay, I'm going to look at school and circle and slack and text it and like, okay, that's how we're going to communicate.\r\n\r\n\r\nAnd how did you even figure out what this was supposed to look like?  So every, every sale call, every sales call get on, I would close, like I would close almost every one I would talk to and I would get on FaceTime with search. Like I got another one. We got another one. And like, dude, we'd never like we had had 50 K months, 60 K months, 70 K even, but never just pure profit.\r\n\r\n\r\nRight. And so it was just a whole different feeling. And like,  All I can talk about that don't about not getting blindsided by that, because what we did was we took that money and we invested into all the tools we need in the software. We're kind of like scheming around what we're going to use to host the course.\r\n\r\n\r\nHow are they going to communicate about the community platform? Right. And Sergio really figured out most of that stuff because I was, how it's always been is I do sales marketing. Sergio does everything else  and yeah, and that's. That's the relationship we've always had. And so he kind of figured out most of that.\r\n\r\n\r\nI added some, some curriculum in there myself on like the sales portion, but and the marketing, but he kind of built everything out himself. But really what happened was after that we launched and we were getting really good results for people. And we took that 50K. We didn't pay ourselves any of it. And we just invested everything back into hiring staff immediately off the jump.\r\n\r\n\r\nAnd so our first hire was a videographer. I was like, okay, well, we only make content on Twitter. Let's go to YouTube now. So immediately we started doing YouTube long form and Tik TOK and YouTube shorts and Instagram reels. And then we had editors. This was January 22nd. 22. Yep. No. Oh, wait. 22. Okay.  Did you have the NIH GM? \r\n\r\n\r\nWhat does that mean? Make it happen.  Yeah. Make it happen. January 1st, 50 grand. January 17th. This course launches. All right. Let's make it happen.  Jeez. Louise.  How long was that first course? I think you said it was. Two weeks. And then it was three months of support. Yeah, it was up until March. And then April we started selling again.\r\n\r\n\r\nSo for the first three months, we didn't sell another package until we knew that we were confident in getting results. What was your first hire? You said you reinvested that back in the team. What was the first hire? It was a videographer and then it was a sales guy, an appointment setter. Who is still,  so your first hire was like, your first hire was, Hey, let's keep the funnel moving.\r\n\r\n\r\nWhy, why wasn't it like, okay, let's hire a business office manager or let's hire someone to manage the curriculum or let's hire a facilitator for the community. Why was it marketing? And why wasn't it something operational?  You know, I'd like to have some really smart intellectual answer for you on how, like, I'm this genius.\r\n\r\n\r\nAnd I knew this was a marketing business. I just knew that my thought process was we're only getting customers off Twitter. I don't want to  have to rely on my personal brand to make sales. So let's build out our personal brands across all the other platforms. TikTok, Instagram, YouTube. So we can start getting traffic from there as well for free over a long enough time horizon.\r\n\r\n\r\nAnd so videographer was first and then actually before the sales guy was a media buyer. So we brought in a media buyer to run paid so we can run paid simultaneously on top of the organic content. So we can have both and diversify the acquisition channels outside of just Twitter.  And so that was my thought process.\r\n\r\n\r\nIt's really interesting. I don't know if you ever have like taken stock of what you've done, but  you know, Hormozy Cody Sanchez, Nick Huber, these people spend hundreds of thousands in Alex Ramos's case, supposedly millions of dollars a year on content,  but it's really only been in the last year that they'll talk about that openly.\r\n\r\n\r\nYou were doing this in 2022. Do you ever kind of look back and say,  dang, that was a great bet? Or is it just like, was it so obvious to you that you don't even think about it was a bet?  I didn't even think it was a bet. I just figured this was the right thing to do because I had run a business for five years at that point, you know, and we'd spent a lot on ads and we knew how to hire, we built all the skills of sale, marketing and recruiting.\r\n\r\n\r\nWe did all that. And so it was very easy in this business at the, at least the beginning on top of having the audience to be able to do that. Are you a sports fan at all?  Yeah. Big, big Cowboys fan. Actually. Cowboys fan. All right. My condolences.  Dang. He is a big Cowboys fan. So in baseball, there is this famous hitter.\r\n\r\n\r\nHis name is Ted Williams. He's one of the best hitters of all time.  And he talked about his hitting strategy and he said he waits for his fat pitches. He breaks down the strike zone into, I want to say like 30 different sections. I can't even remember, but he knows that certain areas of the strike zone, he has a higher batting percentage.\r\n\r\n\r\nThan others, and he waits for those pitches. And Warren Buffett has a similar strategy to this where he, he says he waits for the fat pitches, but what you're articulating is what many entrepreneurs go through before they have that first huge success is they had to grind it out in the crap. They had to learn like, okay, how do I get a customer?\r\n\r\n\r\nHow do I manage people? How do I make sure that I've got cash flow to cover expenses? And then when they see an opportunity. They go really hard at it. And it like, to me, you're just articulating your own strategy for that fat pitch. You were like, this is it. We're not even gonna take a distribution 50 grand.\r\n\r\n\r\nWe're reinvesting this and we're going to continue to grow. Is that a fair characterization of kind of how it went for you? Yeah. A hundred, 100%, man. And I even tell people too, who are looking to get in the cleaning business, like, okay, is the cleaning business going to make you rich? Like maybe like 0.\r\n\r\n\r\n0001 percent of you, if you really build a big ass cleaning company, but for most of you, no, but it can generate you some cashflow and it'll teach you all of the core skills with a very low cost, low barrier to entry business.  You do 50, 000 and then it's March or April before you launch your second, your second cohort.\r\n\r\n\r\nWhat did you end up doing that first year?  In revenue.  Yeah. So once we launched from April to December, we did 2. 8 million of revenue of cash collected. We did 1. 5 million of net profit.  Holy balls. That's incredible. Yeah. We took out a lot of that for ourselves, like dummies. But looking back, I wish we would've kept a lot of that back in to continue to grow. \r\n\r\n\r\nYeah, it was an awesome experience because we went from making like five to 10 K a month off the cleaning company to one month. We made 72 grand each, like take home 72, 000 in a month. And I was just like, dude, I'm the fucking man. Right. \r\n\r\n\r\nDid that change? Like, has the market changed for, or demand for this? Product in particular changed over time or has it remained pretty steady? No, it definitely changed. So, I mean, do we learned a lot? Like home service academy is a very difficult business. Like me, even me and Sergio talk and we look back like, dude, if we had just stuck with orange window cleaning, imagine how big orange window cleaning would be as opposed to pivoting off and starting this whole new company, because we've had to learn a bunch more stuff, right?\r\n\r\n\r\nWe've had to learn how to hire. Management and leaders and manage leaders who also lead teams and also learn how to not make sure the culture stay strong and like communication is still going when you hire, you know, over 20 people, you've got a big chain, a big web of different communication arms that's happening and stuff can get really messy.\r\n\r\n\r\nAnd so learning that on top of that, CPAs and your CACs go up and you're competing against them. The Airbnb arbitrage is of the world. The Amazon FBA is the dropshippers. We're selling these courses. It's not just the other people sending cleaning offers,  all the different make money, build a business online.\r\n\r\n\r\nYour core demographic isn't necessarily, you're not necessarily segmenting it as, Oh, we're looking for people who want to start cleaning companies. Your core demographic is we're looking for. Entrepreneurs who want to hop into starting their first business. And they're assessing all of these other things out there, like, you know, I don't know, laundromat, pressure washing or whatever else.\r\n\r\n\r\nSo you got to compete against those people.  Trucking automation, all types of stuff. Wow. That is fascinating. And I think it's interesting. Chris and I launched a business at the tail end of 2021.  So it was a crypto business.  So we launched this at the tail end of the bull market. And the business was selling is we still have it selling hardware, mining hardware to retail miners.\r\n\r\n\r\nI won't get into like the mechanics of what Bitcoin mining is, but suffice it to say there's a market for it.  And in the first three months  we did 10 and a half million dollars in sales and about a million dollars in profit. In three months.  It was, yeah, it was nuts. It was nuts. And we're like, same types of conversations, right?\r\n\r\n\r\nLike just calling each other every day. Like, are you, did you look at the Shopify account? Did you see the wire that just hit? But we had both seen bear markets before and bull markets before. And so we were like, look, okay, this is great. And  Let's just keep this money in here for a minute. And then we can reassess down the road.\r\n\r\n\r\nAnd you know, we made a million dollars in those first three months and we've lost like 700, 000 over the last two years. You know what I mean?  Just, you just don't know what the cyclicality of those things are going to be. And it sounds like you kind of caught a wave on, on, I don't know what we would call it, but like an entry entrepreneurship products.\r\n\r\n\r\nAnd there's been a lot of entrance into that market. So it's brought down the profitability for you guys. Are you still experiencing crazy growth or. Like, where are you right now in the maturation of your business? Okay, guys, we're going to get back to the show in just one second, but first a message from a sponsor who is, uh, me.\r\n\r\n\r\nOh, it's me. Cause I'm doing the show for free. Listen, I want to give you a hundred dollars. All you have to do is this go to Apple or Spotify.  Give me five stars, write a review, screenshot that review, send it to me, Nick at cofounders. com and you will be entered to win a hundred dollar Amazon gift card.\r\n\r\n\r\nEvery four episodes, I am going to choose a winner at random and I'm going to do this five times, 500 for five stars. I just made that up. It's what I'm calling it. Please go to Apple or Spotify, leave a review, screenshot it, send it to me, Nick at cofounders. com and you'll be entered to win a hundred dollar Amazon gift card.\r\n\r\n\r\nAll right, let's get back to the show. I mean, we're still growing. We'll do probably between four and a half, 5 million. We did 3. 6 last year before four to five this year as well. We'll land depending on the stuff we're working on now, how that will play out. The problem with the course businesses that people don't talk about, because  I love when I see people tweet, Oh, Oh, you just start, start a course.\r\n\r\n\r\nCause it's easy. It's like, if you're just selling a PDF and some stuff where you don't have to provide actual staff and service to, then yeah, I mean, it's a great business, right? It's good. Like it's a good side income, but if you're actually trying to build a course business at scale. Well, you can't get stuck in the problem of selling more courses to cover your costs because then you're going to have to sell people who aren't qualified and aren't a good fit, which is going to affect your success rate, which might lead to bad reviews, which you obviously no, no business wants. \r\n\r\n\r\nAnd so there's this problem of starting from zero every month. In the course game. And most people can't figure it out. I know most people can't figure it out because I know all the guys that do this because of joint, I've spent hundreds of thousands of dollars on masterminds and I've gotten to know the guys that at the top of this in this space.\r\n\r\n\r\nRight. And so that was a problem we ran into is like, like, damn dude, like we have to keep selling courses  programs to cover our costs. And fundamentally, it's just a bad business. You'd like some predictability in there, right? Some recurring revenue. And so what we did was we created a backend. And so everybody that comes in about 16 percent of the time will ascend to our back end product, which is a year long.\r\n\r\n\r\nIt's more of like a mastermind. It's a lot more one on one. You get an accelerator. It's called accelerators. You get an accelerator coach as opposed to a front end coach, and we'll help you scale your business and build a million dollar cleaning company. That's kind of the idea there. And so that's helped a lot with extending LTV.\r\n\r\n\r\nAnd that was by far one of the most challenging things that we had to figure out and why I'm. Very convicted in home service Academy. Cause I don't think a lot of our competitors can do that, especially when they only get their business to 20 K a month and they want it. They want to go off and, you know, teach people how to get to 20 K a month.\r\n\r\n\r\nTalk about, cause I'm curious, like I had Neil Parekh on here. I talked to Neil. It was a great conversation. He's a really good friend of mine.  Okay. He's down in Southern California as well. Actually. Yeah. We had a podcast together actually. Did you? Yeah. Yeah. Me and Neil are really tight. We're doing some affiliate stuff together.\r\n\r\n\r\nSo yeah, he said you suck. That's why I wanted to ask you this question. I'm just joking. No, he has a, I think like three or four corporate locations and then the rest are franchises. So he's kind of turned into a franchise or, and you're close to Neil. So I'm sure you've had lots of conversations with him about  the course versus the franchise or what made you stay The course vertical, as opposed to becoming a franchisor.\r\n\r\n\r\nIt's something that's in the pipeline, man. Like we have about 20 million or so of revenue that we've helped create just last year alone, this year will be more.  That's awesome, man.  And so what we've been throwing around is this idea of acquiring our, our students locations, and that's what we're working on right now actually is, will it be a franchise possibly?\r\n\r\n\r\nWill it be just a massive corporate owned business? We could do that too, where we do like equity roles and stuff. I just heard this story. Who did I hear it from? Hormozy invested, Alex Hormozy invested in this teeth whitening clinic  and the teeth whitening clinic was a franchisor.  And so they had franchises, I think in the Western United States and Hormozy was Why are you selling the franchises?\r\n\r\n\r\nLike you're giving away your margin. So he convinced them to buy back all of the franchises essentially, and then go all in on the teeth whitening because there was a very clear customer acquisition cost. They knew exactly through, you know, through their funnels, how much it would cost, what the LTV was, et cetera.\r\n\r\n\r\nSo,  and I'm not saying you're gonna do the same thing, but is that something you're toying with is like, Hey, we kinda have all these leads with individuals who have locations around the country. We could go back to them and say, we'll buy back.  Your business, and then through an economies of scale, realize the margin savings are like, what, why go back to those  individuals who've actually gone through your course.\r\n\r\n\r\nWell, it's exactly what you said is very clear CAC and very clear LTVs. And we've already coached them on how to build a business, exactly how we would build them with great profit margins, with great PNLs that we review every single month to make sure that they're enjoying their costs properly. And so we've just had this army of people essentially build the businesses that, that we know how to build the way we want them to be built with clear CACs and clear LTVs, whereas the course business is very up and down.\r\n\r\n\r\nAnd like, we, I like to think we created a lot of sustainability around that, but again, like. I mean, home services, it's in my blood mental. I've done the last seven years. I know I can run a cleaning business and I know I can build a cleaning business and the M and a activity in home services as opposed to education and course businesses. \r\n\r\n\r\nYeah. It's night and day. It makes sense to know my goal. So my goal is I want to sell a company for a hundred million dollars. Like that is my Superbowl. I want to sell, exit a company. Maybe it's not a hundred million, maybe it's 10, 20, whatever it is. I want a big exit under my belt. And then I want to do it again and again and again.\r\n\r\n\r\nCause I just, I love it.  How old are you? I'm 26. You'll get there. Jeez Louise, man. How would you go about doing it? Are you going to go out and raise outside capital? Do you think you could bootstrap the purchase of these locations? Or like, how are you thinking about expansion? Yeah, we're in talks with one right now.\r\n\r\n\r\nThey only do about 30 K a month, but he's, he's in Southern California, which we have a, it's like a huge pool of companies to pull from. So he's going to be kind of the platform. And I mean, it's not big enough for a platform, really small, but then we can add on all the other 30, 40, 50 K a month companies and we're just seller financing.\r\n\r\n\r\nWe wanted to raise capital. We could do that. Some people might ask for like a big lump sum, the more established ones that are doing two, three, 400 grand a year in profit, but that's something we're still kind of talking about. But have you ever heard of a DSL?  Okay. I'm going to explain something to you.\r\n\r\n\r\nCause I think that it might actually work for what you're trying to do. It's a dental services organization. There's also MSOs, which are like medical services organizations. Essentially what they do. I've heard her Mosey talk about this on a podcast. Yeah. So obviously they're really attractive because dental care is not going away.\r\n\r\n\r\nAI is not going to automate that out. And there's a lot of dentists who are retiring, et cetera. Anyways,  it's been really big in the private equity space because private equity looks at these businesses and they say, Oh, there's a dental practice.  It's doing, let's say 300, 000 a year net income,  and it's going to be valued at five times earnings.\r\n\r\n\r\nRight. So 1. 5 million to buy this one dental practice.  Well  the multiple ranges change as your EBITDA grows. So you may be doing 300, 000 a year and your EBITDA multiple is going to be five times. But if you get up to like 5 million a year in EBITDA, your EBITDA multiple of what you could sell for is now eight to 10 times. \r\n\r\n\r\nSo what these private equity funds will do is they'll say, Hmm, why don't we go out and buy? 10 of these dental practices. And we won't pay five times. We'll pay six or seven times.  And we'll tell the owner we're going to pay them six or seven times.  And now we have 30, or excuse me, 10 of these we're doing 3 million a year.\r\n\r\n\r\nIt's worth, let's just say eight times. So 24 million, but we can buy it for. 18 times, excuse me, 18 million because they're in that like six times EBITDA range. So all of a sudden there's this spread where just pooling them together creates more value because you now have more EBITDA at the bottom line.\r\n\r\n\r\nSo they spend 18 million to get them and they're now worth 24 million. So it's like multiple arbitrage.  But the way they structure it with these dentists is they'll say, look,  I don't want you to retire. You can stay on for a little while. You can sell me your practice at a six X. So you're already getting a good deal.\r\n\r\n\r\nAnd the dentist is like, great, cool. Sign me up.  But we're only going to buy 70 percent of it.  You are going to roll together 30 percent  because in five years we're going to sell this package and you're not going to get a six X multiple. You're going to get a 10 X multiple on what you have left. So the dentist is then incentivized to stick around, help them grow it because they're going to get a second bite at the apple, so to speak.\r\n\r\n\r\nYeah. You can do something really similar with these cleaning locations where it's like, Hey,  Seller finance will buy 50%,  but here's the deal. You'll get a second bite at the Apple later because when we sell, we're not going to sell for three, four, five X EBITDA. We're going to sell for 10 X EBITDA. And now your, your location is going to be worth 10 X, not three X what you could sell on the open market.\r\n\r\n\r\nIt's the exact idea, man. I mean, this is exactly the conversation me and Sergio have been having is like the whole second, third, fourth, fifth bite of the apple. And  Sergio is kind of leading that. And he's been reading all that and Adam coffee stuff. And he talks about this. And so we've been on that kick and I think it'll work really well, man.\r\n\r\n\r\nLike again, we're in between that versus franchise and we kind of haven't been able to decide what we want to do, but that's the end goal, right? Like I don't want to stay in the info business. I think what we have is great and we have a great team, but  how we're going to get to our goal is doing this is doing what we know, which is building cleaning companies and then selling them for a larger multiple by pulling our whole network together.\r\n\r\n\r\nAnd I don't think enough people who are in the business opportunity, make money online course business, or even thinking like this, cause they're just in the business to tell them which courses, you know, they haven't been in it long enough. Like you have to see like, Oh, there's another side to us. This is another opportunity within the space.\r\n\r\n\r\nAll right. I have some rapid fire questions for you. You ready? Yep. Hit me. All right. What do you love about this business? I love the team, man. I love the team. It's a win, win business. It's a win, win, win business when you do it. Right. So when I say your employees, when, especially your sales reps, because you're selling information and get really high commissions for it, you can make a lot of money if you get good.\r\n\r\n\r\nSame thing with the account managers, because we have to sell the backend package, which is really expensive and they're handsomely compensated. And so they're really happy. We have good times. Whenever we do our offsites, the clients win because we're teaching them how to build a sustainable cash flowing asset for themselves.\r\n\r\n\r\nAnd then we win because the margins can be really great when run correctly.  What do you hate about it?  The people that come in and don't do anything, expect some crazy result. And maybe that's a result of our poor marketing. But at the same time, like I've seen the insides of lots of these businesses and you can't, like, if I could get results for everyone, I would, but you just can't, you just can't do it.\r\n\r\n\r\nI don't care how good of a product you have. And this is a very marketing and sales heavy business.  And I hate the idea of the, I hate the lack of recurring revenue. Yeah.  It's very hard to make recurring revenue work.  All right. So  we are all jealous and always think grass is greener other places. For me, the business or company that I'm like most jealous of is commercial real estate.\r\n\r\n\r\nI just think it'd be amazing to have a building that you own triple net lease, get monthly payments  for you as you sit here and look, what industries are you most jealous of right now?  Software.  Software. All right. We've thrown around that idea so much cause like we, we refer everyone to booking Koala and we've referred over 1500 people to booking Koala that built a cleaning company.\r\n\r\n\r\nAnd it's just like  what I would do to have a software company. With that 1500 customers on recurring, the multiples we can get there, the enterprise value that we built for that company. And so we've thrown around the idea of like, maybe we should start our own software, but again, we're an education coaching company right now.\r\n\r\n\r\nSo we're not going to get distracted, but that's also another play that's available to us because we kind of create our own customers. All right. So for you, if you have two hours in your day and you don't have anything else going on, no work responsibilities, no personal responsibilities.  What are you obsessed with right now?\r\n\r\n\r\nWhat are you spending your time on?  That's a good question, man. No one's ever asked me that on the podcast. Dude, I don't spend my time doing much. Like I'll, I'll go to the gym here and there, but really I, what I nerd out on is I'll go to like, I have crunch, a crunch based pro subscription and I also have a merger subscription.\r\n\r\n\r\nSo M E R G R. And I just look at companies that are getting bought and sold and I read the press releases and I'm like, no way this random company got sold that does like  crocodile farming or some shit. You know what I mean? And it's like,  that sounds pretty rad. Crocodile farming. Yeah. Yeah. It was a company that got bought by private equity doing crocodile farming in Florida.\r\n\r\n\r\nI forget the name, but yeah, it's just random stuff like that. And I'm like, dude, it's so cool because no one talks about it on the internet. You know, it's why I really like what you and Chris tweet about is because you guys are always doing these random business writeups. I'm like, it's really interesting to me to know how other businesses work.\r\n\r\n\r\nSee what I can learn. And also kind of use it as motivation and be like, dude, this random company just sold for this much. Like why not me? You know, it's insane. It also opens your eyes to how many people there are out there that are hyper successful that you've never heard of.  People do you see in your daily life?\r\n\r\n\r\nIt's like, Oh, that guy has a hundred million dollars in his bank account and you've never even heard of the product that he does. You never even heard of the industry that he built the product for. You know what I mean? You're like, well, I don't, that's a thing. Yeah. I love it. Okay. What advice would you give yourself five years ago as you're starting the entrepreneurial journey?\r\n\r\n\r\nWhat would you tell yourself? I would say, dude, the grass is not always greener. It's like you said, the grass is greener where you water it. The grass is greener where you water it. And most people think. Like, Oh, if I start this new business, it's a better opportunity. Every business has shit that sucks.\r\n\r\n\r\nEvery business does. You can't get a one. There's no way around it unless you're going to go start like the next NASDAQ or New York stock exchange. But that, I mean, they have a monopoly on those things. Even that sucks. Yeah. I mean like  every business sucks. So whatever you're doing, just stick with it and you'll see success.\r\n\r\n\r\nI promise you. I mean, I had success with the damn window cleaning business. I love that advice too. Cause I, and I think everybody thinks that their business sucks. Is the hardest or like their business sucks the most. And you're like,  everybody sucks. Like you have to get to a level of comfort with the suck. \r\n\r\n\r\nI like that. Every business is going to have its pains in the and people think, Oh, you're in the course business. It's so easy, dude. It's the hardest business. It's one of the hardest businesses you want to have. Everybody thinks their business is the hardest. I just said it.  It's true though. It is a hard business.\r\n\r\n\r\nYou're competing against a lot of people. Johnny, this was freaking awesome, man. I can't wait to watch you over the next 10 years. Just build your empire. Where's the best place for people to find you and interact with you?  Yeah. Johnny and Sergio across all video platforms. So Tik TOK, Instagram, YouTube, and then squeegee God on Twitter or X now, I guess it's called, and then just Johnny Robinson on LinkedIn.\r\n\r\n\r\nOkay. Awesome. This was fantastic, man. Thanks for joining me. That's a lot of fun. Thanks for having me.  All right. That's it. Another one for the books. I'm fired up. I don't know what else to say. I hope you found something valuable in that conversation. I hope you learned something. I hope there's something that you can apply to your business today, tomorrow, in the future that.\r\n\r\n\r\nIt makes you money. It makes you more successful. It gives you more time with your kids. If there was something I'd love to hear about it in the comments below, you know, give me some feedback. And if you like actionable advice and you want more of this, I write a weekly newsletter that gives insights, tips, and tricks into the world of entrepreneurship.\r\n\r\n\r\nSubscribe in my bio.  And if I can help you in any way in your entrepreneurial journey, don't hesitate to reach out to me. Nick at co founders. com sorry, Kelly, for more emails. And the last thing is. Remember,  curiosity is a superpower and you can use it to your advantage. As my mom used to say, there's no such thing as a dumb question. \r\n\r\n\r\nOnly dumb people.  We'll see you next time.",
  "metadata": {
    "duration": "",
    "date": "2024-08-07",
    "platform_source": "Google Drive"
  }
}