{
  "episode_number": "14",
  "episode_title": "How a Former Wall Street Investor Left It All to Remotely Run a $4M Business with Chris Munn",
  "guest_name": "Chris Munn",
  "business_name": "The Fairfield Group",
  "transcript": "﻿Welcome back to Nikonomics today on the podcast. We had Chris Munn, the owner, founder of the Fairfield group. He owns two facilities management companies. He has an offshore recruiting company. He has an entrepreneurial peer group that he owns and runs. He's from Detroit. Worked on wall street, worked at a hedge fund, went into corporate M and a, and then he went into small business.\r\n\r\n\r\nAnd what you're going to get today is some insight into what it takes to run a business a hundred percent remote. Chris doesn't work at any of his businesses. He runs them all remotely and it's just fascinating. I think you're going to pick up a lot of tips and tricks on what to do.  Here's my shameless plug.\r\n\r\n\r\nI do this podcast for free. My only question and request to you is to like, and subscribe, share it with your friends. If I'm doing well, drop me a note. If I'm not doing well, send me a carrier pigeon. I just want to know how I can improve. So with that, let's hop into the show. All right. Chris Mann, welcome to Nikonomics.\r\n\r\n\r\nStoked to have you here today. I even wore a golf shirt for you because I knew you love golf so much. I've  already given your introduction  before this, so I'm just going to hop into it. And I want to ask One question.  What is bugging you the most about Twitter right now? \r\n\r\n\r\nLack of value that I find from it. Mostly lack of value.  Yeah. I was thinking the other day, I saw two people post about  how many impressions they had gotten. I was like, I wonder why they mentioned impressions. So then I click on the analytics and the first thing is impressions.  And so then I, I'm like, okay, so they're conditioning us  to shoot for impressions, which  on Twitter right now, it's not really a good sign of value as a sign of  interaction and usually controversy.\r\n\r\n\r\nSo the anti authority Chris Munn was like, F this, you're trying to get, you're trying to condition me to worry about impressions. I'm not doing it. So my, I haven't posted a lot lately, but my thing is not, you can't track what I want to track. You have to do it manually, but it's bookmarked. How many people bookmark my stuff?\r\n\r\n\r\nBut there's no, you can see the bookmarks, but it's not like a stat that you could pull like the other ones. So I track it. I have a VA track for it. Yeah. Same. I track it. That's all I care about. I'm like, how many people are saying this is good enough that I want to come back to it later. The other ratio that I really like to look at is, and I'll probably cut this out because most people don't give a F about Twitter right now, except people who are on Twitter.\r\n\r\n\r\nYou know what I mean? The other metric that I really like is this metric that I track, which is. Impressions to followers. Yeah. So a good ratio is like 1500 to 2000  impressions to follower. Yeah. If you start getting like 10, 000 impressions to follower, it's okay. You posted engagement bait. Cool. You got a bunch of eyeballs, but what did that?\r\n\r\n\r\nYeah. Nothing pisses me off more than having a tweet that goes viral, quote unquote. And I don't pick up any followers because I'm like, what was the point of that?  And then,  but the dopamine makes you want to do it again. So. I get why people do it, but I don't want to read any more stuff about,  should you live in Florida or South Carolina?\r\n\r\n\r\nI don't give a shit.  All right. So you own several businesses. You have two commercial facilities management companies. You have an offshore recruiting company. You've got an entrepreneur, a peer group, which is called tent. Is it Tenzi?  Yeah.  Yeah. Which is doing well. But what I want to talk about today is your unsexy, boring business facilities management company.\r\n\r\n\r\nTell me in like the simplest terms. What does that business do?  Yeah. So I think the easiest way to explain it is most big commercial facilities have either a property manager or facility manager who are responsible for.  The maintenance and upkeep of that building. And so we service those facility managers.\r\n\r\n\r\nSo we try to complete maintenance and upkeep of commercial building.  Is that because most people who are in commercial buildings don't own the building and they're just leasing it or is it just a function of the industry? Yeah, I think it's more of a function of an industry. So like a, even like a big healthcare facility, right?\r\n\r\n\r\nLike they may not own the building, but like everything inside the building, they're usually responsible for it. So the cleaning, the floors, high dusting, all that kind of stuff, like they are still responsible for it. Not the landlord per se. Bye. Yeah, I've worked in healthcare post acute care. My brother in law owns a skilled nursing facility company and they have, that's a full time position is a maintenance guy or facilities management.\r\n\r\n\r\nYou aren't necessarily like placing people as a staffing agency. You're the people they call to, to do what, to do like weekly maintenance or is it like heavy maintenance? The way we get in, I think our model is the way we get in the door. We try to sell. Nightly cleaning services. That's the best way to get in.\r\n\r\n\r\nIt's a hard way to get in the door,  but that's the best way to get in the door. Because  when you are in a person's facility every day, they have a lot of trust that you can sell them other services that are much higher margin. Okay. So dumb question. Why isn't it just called commercial cleaning? Why is it called facilities management? \r\n\r\n\r\nBecause we do more than cleaning basically. So we'll, we have trucks on the road every day. We're out doing floor care, which is we stripped it like in the hospital. You've learned that we stripped the wax off the floors and put the wax down. We do power washing. We do, we replace basketball courts, like.\r\n\r\n\r\nWe'll do any kind of maintenance. Some we subcontract mostly do in house, but some places, some people are just commercial cleaning, but we try to offer more because we think it makes our, it makes us stickier.  How do you make money? So are these on, um, subscription kind of agreements or they are, so that you're in contracts with these people, they pay you every month and then you come out and provide services.\r\n\r\n\r\nCorrect. They pay us every month. We provide services. And then usually the that's on the cleaning. And then usually on the upsells, it's usually one time revenue, which is a little more, a little bit more chaotic operationally operational wise. Yeah. But the margins are much better. What do contracts look like in the industry?\r\n\r\n\r\nDo they have,  are you their sole provider or the, can they go to somebody else? Obviously they're going to use you for cleaning services, but for those other maintenance services, can they go to other people? Yeah, they could go to other people usually. But our job is to make the facility manager as lazy as they can be.\r\n\r\n\r\nThat's what we want. We want them to not shop around, not go to eight different vendors for everything. And if it's big enough, sometimes it's like in the rules that they have to,  $30,000 job. They might have to bid it out. Yeah. But if it is  $5,000 worth of worth of work here, 12,000 there, sometimes they won't bid it out.\r\n\r\n\r\nThey'll just call us. So like you're a super smart dude, worked on Wall Street corporate m and a, worked at a hedge fund. Most recently you worked at a, I can't, I think I remember it was a pipeline company. Yeah, yeah. Pipeline Like you were buying other companies. Why the freak did you buy  a facilities management company? \r\n\r\n\r\nOn the other side of the country.  I'm passionate about business services. Like all my businesses are business service businesses. So I've sticking in that niche. Why across the country? I just want to buy a business in a basically a red state that was growing because they're the most business friendly.\r\n\r\n\r\nAnd California is not red or growing, and it's hard to do business there. Orange County. So I would not, Orange County is definitely red for sure. So I would not want to live in a red state that's growing, but I do want to do business there. I figured if the, if it's growing and I'm just keeping it afloat, at least I'll be like the worst bartender at spring break.\r\n\r\n\r\nI'll still come out.  It's a great thesis, man. How do you find customers?  So with this company in particular, yeah. So cold calling, cold email, dropping in, like you, we can find what the big buildings are through like real estate data. So we can see, Hey, and the bigger the building, the bigger the contract, this is pretty simple and straightforward, but like getting those relationships is like a really long process because we have a really long LTV with our customers.\r\n\r\n\r\nLike we just lost a customer. I got an email a couple of days ago. We lost a customer and the letter read, we are discontinuing services. From the original contract dated  October 23rd, 2000, but we've had the customer for 24 years, but it's like long care or your snow guy, as long as they don't do it, but a bad job.\r\n\r\n\r\nAnd as long as they're not charging 3 times market, you probably would never get rid of them. Yeah. So it's hard to get in the door. But once you're in the door, they can last a long time if you provide good service. So a bunch of cold call, cold email and dropping it. It's not a lot of like pay per click.\r\n\r\n\r\nYou're not doing SEO. You're not going on Facebook or Google. Okay. Interesting. It's just old fashioned sales calls. It's old fashioned because I think people want the services so infrequently that yeah, maybe they'll go on Google, but more than likely you want to be the person that they think of before they even would click on Google.\r\n\r\n\r\nOh, those guys came in here. Yeah. The last three years. Let me give them a call.  We're going to get back to the show in one minute, but I just wanted to tell you about today's sponsor, which is, uh, me. Oh, it's me. I'm sponsoring the show. Yeah. Cause I'm doing this for free. Do me a favor, like, and subscribe right there, right at the bottom.\r\n\r\n\r\nMove your yep. It's right there. Yep. Awesome. Thank you. If you're like a individual facility, your facilities guy probably isn't scrolling LinkedIn or not on Facebook. Yeah. That was like,  It's yeah, that role is interesting because it really vacillates between very blue collar and very white collar. So like some of our contacts are super white collar.\r\n\r\n\r\nThey work through email, they college degrees, they sit in the office and some of our contacts are like the guys who walk around with 80 sets of keys on their hip,  that you can't reach those guys.  It's Santa Claus. He's jingling and jangling down the hall. Correct. Correct. That's exactly who it is. Yeah, the old grumpy guy that's walking down the hall.\r\n\r\n\r\nThat's him. Yeah. Oh man. I know those guys.  So what does your team look like? I'm assuming you have a lot of techs in the field, but like back office, what does it look like? Or I guess before I ask that, how big is your business? If you're willing to share. Yeah. We do about 4  million in revenue right now. \r\n\r\n\r\nThat's, we have a lot of employees because we have low skill labor. So techs in the field, we probably have. 40  and like office staff or management staff, we have eight, some offshore, some onshore for your office staff, eight, do you have a sales team?  We have three people on the sales team. You have three sales, two, two back office  and no, I'm sorry.\r\n\r\n\r\nSeven, three sales, two back office and two ops managers like field managers. Okay. For, I think it's interesting. You have a, an offshore recruiting company, like everybody else.  Yeah, dude. It feels crowded because Twitter has a lot of them, but I actually think do you eat your own dog food? So to speak?  Oh, yeah, certainly.\r\n\r\n\r\nWe hire, we're like, we hire salespeople to come in off, off for cold callers. I use our services because I think they're really good. That's originally why I got involved with the offshore. I didn't start the offshore business. Parker and David and Ahmed started it and brought me on because I used the services and I was super impressed.\r\n\r\n\r\nBut you're the reason for its success. We can all be honest.  Pavago wasn't going to make it on its name alone.  No, the name wouldn't ring out in the streets, but At least you weren't called somewhere.  Could be worse. That was, yeah, that was interesting. That was a lot of money to pay for.  For a domain for a domain.\r\n\r\n\r\nYeah. If you buy something for 50 million, you got to grow it. I'm sure.  So tell me really quick, what are the types of positions that you could out offshore outsource sales? Cold calling makes sense to me, but what else do you have in your business that you're currently offshoring? So all our back offices.\r\n\r\n\r\nSo like everybody that does invoicing, AR, AP, that's all accounting, accounting. Yep. All that kind of bookkeeping. Then we have this part of the back office role. Now it would be separated out, but like customer success. Making sure your customers are happy following up with them, seeing what they need, seeing, making sure everything's done because the ops managers are kind of field workers.\r\n\r\n\r\nThey're going out, they're out every day. And so they, they could use support in an office that's like on the computer all day because they're in the car, almost like a sales, like a traveling salesman would be in the car. And he has to sit in the car for an hour to type everything in a CRM. Like we just try to make sure that they don't have to sit in a car and type in anything.\r\n\r\n\r\nOur office is doing that. When, when you say customer success, do you mean like account managers  similar to an account manager? Yeah, similar to an account manager where they would literally. Contact our people every week or so and just check in and see how things are going and make sure they're happy.\r\n\r\n\r\nSome of like software companies do.  Okay. Yeah. If we don't have to have a physical  person on the ground, then we can offshore. Are you somewhere else or are you at home?  No, I'm in my office. This is, I had this made, but I certainly, I had it made. I just had to report  you. Have you, you ever watched the water? \r\n\r\n\r\nNo, I know what it is, but no, never we're not talking anywhere in the pocket. Okay.  canceled.  Dude. It's the best show ever. I know, man. I know, I know, but literally, but like literally, I don't even, no, I know. Everybody says, everybody says, I don't watch tv. I literally do not watch tv. And I will watch The Wire like every year because it's that good.\r\n\r\n\r\nYou gotta get into it. But it's, it is a, it is a scene from the Wire. Okay. The problem is my wife and I, we got four kids under 10 and I was just, I literally was talking to my wife about this the other night. Like we don't watch any TV anymore. Yeah. Like by the time the kids are in bed, like we just have a few minutes to catch up with each other and then like we're out  anyways, let's be, let's be, except for the wire.\r\n\r\n\r\nApparently that show went off in 2007. So I know you're past this. You're past this date. Tell me a little bit about, all right, 4 million top line companies in your industry. What's like a typical gross margin. What's a typical bottom line.  Yeah. So there's two business models in my industry. So one is where your self use self service, which means your employees do the actual work that you're contracting. \r\n\r\n\r\nOkay. Those margins can be anywhere between 15 and 25%. Then sometimes 30%, if you're really good,  then there's the subcontractor model, which is all we are as a sales organization. We go out, we win contracts and once we win the contract, we, uh, subcontract that work out to people who couldn't win this business on their own. \r\n\r\n\r\nSo in those businesses, margins are super small, maybe 5%, yeah, like 6%. So they can get, those can be like, so for instance, I looked at a deal a few months ago.  They were doing like 23 million top line  and they were doing like 1. 5 in EBITDA. And that's not that far from like where my stress me out, man. Yeah.\r\n\r\n\r\nThat's what I said. Out, but they only had seven employees.  I get it. It's still,  it was still stressed me out, right? Yeah.  No control. I don't like not having any control over my service because we are a service business. And so I've thought about it a ton, but  if I'm going to be in the service business, I want to provide good service.\r\n\r\n\r\nLike, I remember doing a lot of research when I first bought a business and I was like, how much cash should I have on hand? Right. Cause like you're making money and you're like, Oh, cool. I got a half a million dollars in the bank. Maybe I should take a distribution, but then you don't think about working capital.\r\n\r\n\r\nAnd I remember Googling and looking, it was like nine to 12 months of cash on hand is what a business should have. And. I remember thinking back to my time working in healthcare where we had businesses that were doing 5% margins, and I started doing the math. I'm like, okay,  let's just say out of a hundred dollars, 50% is not controllable.\r\n\r\n\r\nSo 50 $50 is not controllable every single month. So you're telling me I need to have $500, $600 in reserve? Guess what I make? Five a month. $5 a month. It's going to take me a hundred months.  Are you kidding me? I'm not going to take any distribution for 10 years. It just blows my mind. So when you have that thin of a margin business, it just freaks me out.\r\n\r\n\r\nCause I'm like, you just have no margin of safety. No, you have none. And  the businesses in the space will act like that too, because. You'll find if they get in a pinch,  all they do is they pinch their subcontractors. Like it's shady, but cause their subcontractors are usually  like people who don't speak great English, so they can't go out and get the contracts themselves, but they have their own business and they do a good job.\r\n\r\n\r\nAnd so those big companies will just say, Hey, we owe you 50, 000, but we're paying you 35 and just let's make it, let's make it work next month. And the subcontractor has no real recourse or doesn't know what the recourse is. So you get a lot of situations. Yeah, they get pinched for sure. Like I'm sure they're in cash crunches all the time.\r\n\r\n\r\nThey have no margin. My last like operationally focused question. Do you know how much it costs to acquire a customer?  You ever done that exercise? It's a little bit different, right? Cause you're not using traditional.  So  I don't know. So we started, we had, all right, so my, the business that I most recently bought the facilities business  has been around like 23 years and they never had a salesperson and never did sales.\r\n\r\n\r\nIt's all referral. So we just implemented ourselves stuff this year. So we've acquired maybe four or five customers so far, which is like a good clip for, Uh, business of my size, like I said, because they're so sticky that if you're acquiring like a customer a month, you're doing a really good job, but I would imagine it probably costs between  2, 500 to acquire a customer.\r\n\r\n\r\nSo  this is like just a question.  I didn't ever even hear about CAC. That's not true. I heard about CAC. I never used CAC  in the businesses that I ran. Because it wasn't traditional like healthcare in particular,  you're not getting patients who are clicking online. You have sales reps to go to the hospital.\r\n\r\n\r\nThey build a relationship. The hospital sends you a referral. I just never thought in terms of customer acquisition cost. Yeah. Do you think that's a like tech thing that has led over to SMB Twitter? Yeah, I for sure think it's a tech thing because they have to be very They're not profitable, right? So they're burning the cash.\r\n\r\n\r\nSo they have to realize what is our customer acquisition costs because they have to know how much cash burn they have. So it's very important. We're like, if my business is profitable,  it's not something that I'm thinking about as much now. It is helpful because  as I think about our LTV,  it has helped me realize like, Oh, I can spend a lot more to get a customer than I do.\r\n\r\n\r\nSo where I might've been cheap before, if I spent 5, 000 and I haven't won a customer, Or I spent 5, 000 and I won one  500 margin customer a month. I might be like, that was too much money, but if my LTV on that customer is 60 months. That's fine. So I think it has helped me reframe a little bit, but I do think it's overblown because we're profitable businesses where a tech company really has to like dial in their spend. \r\n\r\n\r\nI agree. I think CAC is a very useful tool to help you understand and analyze your business and how you get customers and whether or not you're profitable and acquiring them. But there's like a huge emphasis on it, I think in SMB, because there's like a bleed over. Yeah, that's all right. Tech is not a good, uh, place to learn how to do business. \r\n\r\n\r\nIt's a good place to learn how to spend money. Oh, for sure. It's a good place to learn how to spend money and they do know how to acquire customers. Like they're very. Their marketing stuff is great on how to acquire customers, but like that, you can't take tech companies and be like, this is how you should run a business.\r\n\r\n\r\nYou will run out of money,  especially the old boring businesses like you're running, right. Or healthcare that they don't care about technology. The relationships that are being built are built by technology. Person to person. They're not being built through Google ads or paper clip or whatever. Nope. Nope.\r\n\r\n\r\nAll right. I got some rapid fire questions for you. All right. What do you love about this business? Stickiness of the customers and the ability to upsell because we have so much where we see our customer every day. It's a rare business where you actually see your customer every day. So our ability to upsell and the trust that we have with the cut with the customer gets pretty deep.\r\n\r\n\r\nSo I like that.  What do you hate about it?  Revenue per employee. It's not a great revenue per employee business, so I have to manage a lot of people. That's another metric I'd never thought about before getting in on SMB Twitter. Is that something you'd looked at a lot or is that just no? Yeah. It's just something that I really like when I see people and say, Oh, we have nine and it shouldn't be revenue per employee.\r\n\r\n\r\nIt should be even our cashflow per employee. Let me rephrase  that. Say, yeah, I get it. Yeah. Revenue doesn't matter, but, but yeah, it's like, how many people are you managing? Because  You know, this, you run businesses. The hardest thing is that people are messy and they all have different goals. And it's like, it's hard to get five people to row the same way.\r\n\r\n\r\nIt's even harder to get 55 people to row the same way. Especially in businesses where the product is your people,  right? Like in a tech company, your product. Is the product it's technology. It can scale infinitely, but in services, businesses, the product is the people. Yep. And if they're not performing well, and they're not representing you well, your business does not do well.\r\n\r\n\r\nYeah, exactly. I don't have a good business. Exactly. So you have to sell them.  That's the hardest part. Yeah. It's just, you have a big army of people that all need to be on the same page. So  do you think about AI at all? And if you do, does it scare you? For your industry. No, it's I think our industry, they have some like autonomous machines, but they're so fricking expensive that it's not probably, I can't do what people can do yet, especially in the physical world.\r\n\r\n\r\nIf you woke up tomorrow with an extra a hundred thousand dollars,  what would you do with it  in my business or just in your business? Yeah. Not personal. We could go personal.  If personal, I'm joining a golf club, but my business,  Get more talent. I think that's just what kind of talent like growth talent. I really like my team.\r\n\r\n\r\nWe have great people, but there's a difference between like a, a steady state employee and like a growth employee. I think that they have two different characteristics.  And so now we have steady state employees because when you buy a business, you PGA, you're scared. You've got a lot of risk. You don't want it to go bad.\r\n\r\n\r\nSo you're like, let me just get people in here. Who are going to do their job and we, we've done an awesome job at that. And now I would like some people across the aisle or across the cubicle. That are like, let's move fast and break shit, um, because we want to grow fast. So do you,  I'm just thinking about this right now.\r\n\r\n\r\nDo you know who Brian ceiling is on Twitter? No, he was a searcher. He lives in Tampa. He just bought a business. They do a  commercial kitchen appliance repair. And maintenance,  I have to be careful about saying that because I used to say hood cleaning and that's not what they do, but I, it's even worse.\r\n\r\n\r\nYou're about to find out. I invested in his business. He was a searcher. He needed some gap funding in order to close. And so we're invested in the business.  And for me, the thesis is very similar to what you said, red state growing, but it's also a business. You're not automating that stuff. Out, right. But he's in Tampa.\r\n\r\n\r\nI should introduce you to, I think it'd be a good time. So a lot of real estate guys on Twitter look at business guys and think, Oh man, that'd be so awesome to have a business. Just kicking off cashflow that I could grow and  fund my lifestyle. And a lot of business guys on Twitter look at real estate and think, man, it'd be nice to have a, just a asset that grows.\r\n\r\n\r\nAbout with inflation and kicks off steady cash flows that I don't have to worry about  as you look at other industries, what industries are you jealous of right now? I'm jealous of all the course guys, like the guys who make the,  yeah, man, they print money.  Everybody gives them shit on Twitter. I'm like, are you jealous? \r\n\r\n\r\nThey are because they have a 95 percent margin. So like the guys who do it at scale, not just guys that sell one course for 500 or whatever, but like  people who have found big audiences and have used their media to sell guys and courses and books and all that kind of stuff. The margin is just so high.\r\n\r\n\r\nJustin Welch, J clouds. Yeah. Like those guys. Awesome. I'm like, I never shit on those people. I'm like, look, there's only one reason everybody's doing this. You can act like, Oh. You know, we're revitalizing America and all this shit, like you  to make money.  And so it's great things that come along with it.\r\n\r\n\r\nLike I love being able to provide jobs for short, but if I didn't get paid to do it, I wouldn't be doing it. And if I got paid like a W2 worker, I wouldn't do it either. So there's the main reason I do it is for the economic incentive. And so those guys have maximized that. So to me in the game of business, not necessarily game of life or whatever, but in the game of business.\r\n\r\n\r\nVery  well said. I do have a question for you though.  I view it the same way and I'm always curious at what point do they flip from being looked at as like a wannabe  to a legit  and we can say guru, but whatever you want to say, because there are like a lot of people who are grinding out there and you look at them and they're like, Oh, they're selling a course.\r\n\r\n\r\nOh, wow. They have a cleaning company that, that they started two years ago. And what's that? There's a guy on Twitter. I can't remember his name right now. He's 23 and he started a cleaning company and he's, I'll show you how to get to 60, 000 a month. And you're like, this guy's selling a tour, of course. But if, but there's a guy who I think he sells window washing squeegees or something, of course.\r\n\r\n\r\nYeah. Yeah. That guy started with a really small business and now his main business is selling courses. And you look at him, you're like, Oh dude, that, that guy's legit. Like he's an industry.  Yeah. Like at what point does it flip? You know what I mean? I've always just been.  I don't know. I think it's consistency and the way you sell, right?\r\n\r\n\r\nLike I ultimately think that really good ones are really good content marketers. They'll give you, they'll give you everything in the course for free. And if the course is good, you'll get all this value just piecemeal and say, I'll give you every chapter of the book just 1 month at a time. And then, you know, maybe 3 chapters in, you're like, I want to buy the whole book.\r\n\r\n\r\nAnd if it's valuable, then I think they start to scale that. So I just think that the really good ones are just like, giving away value after value. And the bad ones are like. Hey, I made a hundred thousand dollars. Here's how you can't do it by my court system. That's not how you do it. You've got to give people all the tools to make their a hundred thousand dollars.\r\n\r\n\r\nAnd then you package it up as best as you can. And in a way that's digestible and teachable and you sell that, what keeps you up at night? Nothing. I sleep great.  Okay. Let me ask you a different way  in your business. What are the biggest threats that you see over the next five years? Yeah, we have, I think in the facility space, there's always concern about your customers because.\r\n\r\n\r\nBecause they're sticky and because you get so few and you try to grow within those customers, you end up having some  significant customer concentration risk over time. Because, you know, you get in with a big, let's say a big healthcare facility. That's like all across the state. And you get in with them and you start growing your business with them.\r\n\r\n\r\nNext thing you know, they could be 40%, 30 percent of your revenue, right? And you're just growing. And of course, you're never going to say no when they call you  for more business.  But then when that 30 percent of your revenue.  Oh, what happens when they pay two weeks late? What happens when  they're, they face  tough financial times like that?\r\n\r\n\r\nThat's like probably the scariest thing to me. Yeah. I have some stories on that. I'll tell you someday. But all right. My two favorite questions now, is there a person on Twitter that you hope to be in five years? No, there's no, I want to grow my business, but I also want to,  I enjoy doing a lot of other things and maybe it's because it's, it's just people don't want to hear it on Twitter, but the Twitter crew is so business focused and I just never want to be like that.\r\n\r\n\r\nJust there's so many more aspects to life.  Let me ask it a different way,  because I have, now that you've said that I have somebody in my mind, but yeah, who do you think is doing it the best  of the personalities on Twitter? If you had to choose, right? Who do you think is playing the best game?  Gurley seems like he has fun. \r\n\r\n\r\nHe enjoys his life and he, you know, he gives a lot of business content, but it's not super serious. It's not super deep. And I like that. I would have thought you said, be sure.  I don't like Brent. Brent doesn't post though. That's what I'm saying is if in five years you're like Brent where you like you post,  but you're successful, right?\r\n\r\n\r\nYeah. Yeah. Brent. I really like Brent. I really like what he's done. He has a lot of good relationships. That's yeah. You know what? Now that you mentioned that I do, what I like most about Brent is he has really good, strong relationships with a lot of people. And I feel like I'm starting to build good relationships with a lot of people.\r\n\r\n\r\nUm, and that has been the most valuable thing that I've gotten from Twitter more than I haven't really sold anything. I probably could, but I just haven't.  When I got the main street invitation or whatever for this year's main street, and I see Chris Munn's name on the top line,  I'm like, what the freak?\r\n\r\n\r\nHow is Chris Munn on the top line? I love you to death. I think you're amazing. Right? I don't know how I'm on the top line either. But I'm like, holy crap. He's on the top line. And I think that,  I think that speaks to your ability to genuinely connect with people quickly. Right? And they, and you're not just chasing the views or the clout.\r\n\r\n\r\nI also think there's an aspect of.  I hope you don't take offense. If you do, I'll know what you're about to say in your career. There aren't many black people on SMB Twitter, you know what I mean? So it's not many black. Yeah, not it. Not really at all. Not at all. Not a lot of women.  And so it makes sense.\r\n\r\n\r\nThat dude, that is the.  That's the bigger thing that surprises me. Like black people as a percentage of the population, 13, 14%. So I'm like, okay, I get it under representation, but women are 50  what? And there's no big women accounts. It's just, it's mind boggling to me. I've been like seeking it out and trying to find some good ones in there.\r\n\r\n\r\nAnd there are some decent ones on there, but I just, anyways, it's weird. Yeah, no, it's prominent Twitter person  DME. I won't say who it is.  And asked me how they could get more women at their events, more women and minorities at their events. That's cool. And yeah, it was cool. I was like, okay. Yeah. I gave them a very long, very detailed answer  about how to do it.\r\n\r\n\r\nAnd I said,  you have to show up for these people. You have to make them feel like they're welcome because no matter what you can say, Hey, it's open to everyone, but  this is going to be a bad example because this is not the SMB Twitter crowd, but I'm just using it as an example. Yeah. If the Nazis one day just changed their thing, you're like, Hey, we're open to everybody. \r\n\r\n\r\nLike, we're not fucking coming. So like you, you have to like make efforts or let's just say even the Germans, right? Like the Germans in 1948 are like, Hey, black people, Jewish people, come on back. They're going to be like, no, we're not doing that at all because we don't feel like we're a part of this. And it's not even about the hateful stuff.\r\n\r\n\r\nIt's just, we don't see our representation anywhere over there. And so I told them, I told the person like,  it's a long game. Like you have to  champion women, you have to advocate for them. You have to think about them when you're like, Who should I pop? Who should I interview on my podcast? Who should I invite to my event?\r\n\r\n\r\nWho should I invite as a speaker? I'm like, it's a really long game and you have to be willing to do that. And if you're not, then you're going to get accused of, Hey, yeah, I saw you at this event, but it was all white guys. So what the fuck? And so those are your choices. And the person was, eh, that sounds too hard, even if you don't feel that way, right?\r\n\r\n\r\nLike even if you're the least racist person or you're the most accepting person, correct. If you don't architect an environment for people to feel comfortable, then it doesn't feel comfortable. Yeah. And it's not anything. It's not nefarious. Like I'm like, if there's all white people, all white miniature of it.\r\n\r\n\r\nI don't think that was a nefarious thing that you did, but I will say you're going to get criticized. Like when you post pictures and it's seven, you're like, Oh, we had this event for business owners and it's 65 white guys. Like you're going to face the criticism. So if you don't want that, you got to do the work.\r\n\r\n\r\nAll right. Here's my last question for you. What are you obsessed with right now? I've been really into like Japanese culture stuff. I don't know. Why? Yeah. Like really? Go on. Yeah. Super fascinating. Like, even like business culture, they are so disciplined and organized. Mm-Hmm. . And  maybe not fun, but like, we went to this, me and my wife went to this Oma place in New York.\r\n\r\n\r\nI don't know what that is. Oma. What? What's Oma like? Uh, they like, they just bring out place of sushi. You don't get to order. Okay. Right. Like, you know, just bringing it out. Like they're making it right there. There's no stove. It's just like a guy and fish. It's like fish, a knife and a guy. That's it. That's right.\r\n\r\n\r\nAnd I'm just watching the guy and he's so disciplined and so exacting.  And it just fascinated me because Americans aren't like that at all. We're just like,  You know,  you know, McDonald's just throws anything on your fucking burger and hands it to you. So it was very, I'm very fascinated with their culture and how they have. \r\n\r\n\r\nIs it the organization? Is it the discipline? Yeah, it's the organization and the discipline and the ability to like, they're the only big country that really has very little American influence. Like Japanese, like when I went to Japan,  it was hard to find people that spoke English and I've been to like some, I've been to Sapa, Vietnam.\r\n\r\n\r\nI've been to like Phnom Penh, Cambodia, and you can find tons of people that speak English and in Tokyo  wasn't a ton. And so really. They've kept, yeah, they've kept America, you know, they might have some beef with us for a couple reasons, but what's interesting about them is they've, they have for a long period of time had this policy against immigration. \r\n\r\n\r\nAnd I won't say, I don't know a better way to say it. That's just they've limited immigration. Yeah. And it's only been recently, I want to say even this year that they've started to loosen the restrictions on that because they're having net growth.  They're not having families. They're not having babies.\r\n\r\n\r\nSo yeah. That's good. That will be interesting to see if they can keep their culture that strong. Yeah. I mean, it'll be hard to keep like the Japanese traditions that strong when you let in a New Zealander or Australian or Indian person, like it'll be hard. And you know, that's part of what we struggle with in America, right.\r\n\r\n\r\nYou know, we have this hodgepodge of culture and it clashes sometimes, right. But yeah, it's very cool. Yeah.  Yeah, I've just been diving into that kind of stuff. It's been cool to me. That's rad, man. Japanese culture. What's the best way or place for people to find you? Is Twitter the best, or is there somewhere else you want people to find you?\r\n\r\n\r\nThe golf course is the best place to find me, but if not, get me on Twitter. It's a Chris X one on Twitter. And, uh, yeah,  this is rad, man. Thank you for doing that. I appreciate it. I always like talking to you.",
  "metadata": {
    "duration": "",
    "date": "2024-05-31",
    "platform_source": "Google Drive"
  }
}