{
  "episode_number": "09",
  "episode_title": "Breaking Ground & Banking Profits: How This 28 Year Old Built a Multi-Million $$ Wedding Empire with Alex Nelson",
  "guest_name": "Alex Nelson",
  "business_name": "Midnight Gem",
  "transcript": "﻿Nik (0:0.942)\r\nAll right, welcome everybody to Niconomics. We have an awesome conversation today. We have Alex Nelson, otherwise known as the wedding venue guy. I've been following Alex for, gosh, when did you first get on Twitter?\r\n\r\n\r\nAlex Nelson (0:13.378)\r\nAbout a year, a little over a year ago now, so.\r\n\r\n\r\nNik (0:15.918)\r\na little over a year ago. So I've been following Alex since he was a We account. ⁓ And Alex is just fascinating. So he's actually built a wedding venue from the ground up in Iowa. It's called Midnight Ventures, Midnight Gem, excuse me. And I think the coolest thing is just been able to see your journey, not only in written form, but like visually, you just announced a new venture that you have going on. So I thought it would be really interesting to get you on and have a conversation about the wedding venue business in particular, and then just any other.\r\nthoughts you have on business in general. ⁓ So did I do a good description of your background? Anything you'd add to that?\r\n\r\n\r\nAlex Nelson (0:52.098)\r\nYeah, no, that's great. Hit the nail on the head.\r\n\r\n\r\nNik (0:54.510)\r\nOkay, perfect. All right, so in a sentence, what does your business do?\r\n\r\n\r\nAlex Nelson (1:2.818)\r\nYeah, so we are the venue that hosts, we're mostly like weddings and events or weddings focused. So, you know, we host a lot of weddings, but we can also do other events. I'm not doing a good job staying at one sentence here, but yeah, we are the building for the most part.\r\n\r\n\r\nNik (1:22.798)\r\nYou're fine.\r\nSo you host weddings ⁓ and events in Iowa and you built it from the ground up, right?\r\n\r\n\r\nAlex Nelson (1:34.914)\r\nYeah, yep. So my wife and I built it from the ground up. We opened in October of 2022. It was quite the journey and quite the process. Took us about two years from start to finish. And then, so it feels like we've been open forever at this point. And we started taking bookings like well before we were even done being built. I think we finished with around 100 weddings before like construction was finished, which is crazy.\r\n\r\n\r\nNik (1:56.782)\r\nWow, that's awesome. How old are you?\r\n\r\n\r\nAlex Nelson (2:1.826)\r\nI am 28, about to be 29, I think, yeah.\r\n\r\n\r\nNik (2:6.382)\r\nOkay, most 28, 29 year olds aren't like, I wanna open a wedding venue. Why the wedding venue? Like why the event or wedding space?\r\n\r\n\r\nAlex Nelson (2:11.394)\r\nThank you.\r\n\r\n\r\nAlex Nelson (2:16.258)\r\nYeah, so it really started like my wife and I, we got married five years ago now. We've been together since middle school, actually. So we went to high school together and then went to college together. So it was no surprise when we go way back. So it was no surprise like after we finished college that we were probably going to get engaged soon. And ⁓ then my wife was already looking at venues before we were even engaged. She was going to be a teacher. So she wanted to get married during the summer when she was off.\r\n\r\n\r\nNik (2:26.526)\r\nyou go way back.\r\n\r\n\r\nAlex Nelson (2:44.610)\r\nSo she's looking at these venues and they're booking like a year or two years out and we realized like we needed to book like a venue soon. Otherwise we're gonna have to like wait like a whole nother year. So that was really like kind of like the light bulb moment there I guess. Like these big beautiful pieces of real estate are being booked two years in advance. Like what? What don't I know about this? Like what is going on? Sort of thing. So we kind of went down the rabbit hole then. We obviously saw like all the venues in our area. When we got married we're touring it and then...\r\nyou know, fast forward to like mid COVID, my wife was teaching, like I said, and it was not going great. It was just a mess for teachers. So she's looking for something else to do. She's always loved weddings. We had a bunch of friends and family getting married. So it kind of went down like the wedding planning path, but then we kind of decided to go bigger a little bit. I always wanted to start my own business. I've always been interested in like finance, real estate, that sort of thing. So it was kind of, kind of a mix of the two worlds for both of us.\r\nSo it made sense at the time.\r\n\r\n\r\nNik (3:44.046)\r\nWhat were you doing at the time? So your wife was a teacher, what were you doing?\r\n\r\n\r\nAlex Nelson (3:49.250)\r\nYeah, yeah. So I went to Iowa, graduated with a business degree, applied for probably 100 jobs. My first job out of college was doing the one job I got ⁓ was selling for like a plumbing wholesale company. So they'd sell for like plumbing manufacturers. Definitely not for me. I knew nothing ⁓ about the plumbing industry or world. ⁓ But...\r\n\r\n\r\nNik (4:9.550)\r\nsounds amazing.\r\n\r\n\r\nAlex Nelson (4:17.354)\r\nyeah, so I didn't last very long there. Then I got a, like a remote job working for a real estate brokerage. ⁓ actually I had a Minneapolis, so I was helping out with their online leads and, and doing, ⁓ so some things like that, setting up appointments and whatnot. ⁓ and then I got another remote job. ⁓ I actually started working for my brother's startup, ⁓ that I did. So I did two, two remote jobs and they both ended up.\r\nbeing like full time, so I had like two full time jobs for like two years. And that's basically how we saved up enough cash to be able to do anything.\r\n\r\n\r\nNik (4:50.894)\r\nSo that's interesting. So you already, you had some digital experience, like you had some marketing experience before you hopped into this.\r\n\r\n\r\nAlex Nelson (4:57.922)\r\nYeah, yeah. ⁓ Yeah, definitely learned a lot on that. ⁓ Yeah, definitely. Just like from setting everything up and like dealing with like online leads and how to communicate that way and CRMs and then the marketing aspect of it as well. It's translated pretty well actually. ⁓ So yeah.\r\n\r\n\r\nNik (5:0.782)\r\nInteresting. Has that helped you at all?\r\n\r\n\r\nNik (5:19.630)\r\nHow did you find the business?\r\n\r\n\r\nAlex Nelson (5:23.874)\r\nHow did we find the business?\r\n\r\n\r\nNik (5:25.550)\r\nYeah. Where did you find it? How did you find it? Like what? ⁓ Yep, the wedding venue business.\r\n\r\n\r\nAlex Nelson (5:27.874)\r\nLike the wedding? ⁓\r\nYeah, so I mean, we built it from the ground up. So we found we were like, we knew we wanted to do get in the wedding worlds or the venue worlds. And we knew we wanted to do it like around where we lived. So we had like a pretty specific like radius that we were looking at. And we knew we wanted to build it from the ground up. There's just not a ton of like venues for sale, or at least we're in at the time, you're starting to see more and more pop up now. But we wanted to also like do it different. We wanted to be, you know,\r\noffer different things out of the venues we're offering was kind of like the big reason why we wanted to do it.\r\n\r\n\r\nNik (6:2.414)\r\nLike ⁓ what, right? Like you're doing weddings, but like what are the differentiators that you guys looked at and you're like, we should be doing a golf course. I think I saw you have like a little putting green there, but.\r\n\r\n\r\nAlex Nelson (6:11.974)\r\nYeah. ⁓ Yeah, so we have a putting green. That's a big part of it is basically like the indoor outdoor flow, right? It's like restaurants ⁓ and everything. Breweries are going to everything. You know, so like the back wall of our building, our big like bifold doors open up all the way. And then we have like this courtyard area, we call it, we have like your cocktail hour that has like fire pits and games and the putting green. ⁓ So that was a big part of it is like having that indoor outdoor flow that no other venues had around us.\r\nAnd then also, we design our building to have like the bridal suite on one end and the groom suite on the other end. So they're in complete opposite sides. So they basically get like their own like wing of the building. Because that's also like a big part of the day now is like having all your bridal party get ready with you and hang out in the morning. A lot of venues ⁓ didn't used to didn't have those like getting ready suites. Now it's almost like a must. They Yeah, they went from like not having any.\r\n\r\n\r\nNik (6:55.278)\r\nInteresting.\r\n\r\n\r\nNik (7:5.870)\r\nWhy was it important?\r\n\r\n\r\nAlex Nelson (7:8.066)\r\nused to be like a ballroom, an open room sort of thing. And now, you know, they're turning into these like full on designated like properties, purpose built sort of thing. So like that meant in the user, we can just keep getting piled on basically.\r\n\r\n\r\nNik (7:17.934)\r\nYeah.\r\n\r\n\r\nNik (7:22.766)\r\nWhy was the indoor outdoor flow thing important? Like I wouldn't even think of that.\r\n\r\n\r\nAlex Nelson (7:28.642)\r\nYeah, yeah, so it kind of goes down like the ⁓ the experiential like hospitality route of like, it's all about like the experiences and like doing doing different things. It's more amenities, more experiences about the Instagram photos, you know, doing just different things than that haven't done. Haven't always been done in the past, I would say. So, yeah, having more amenities like the putting green, you know, that's something cool. Like everyone loves to take pictures at it and do and like.\r\n\r\n\r\nNik (7:35.694)\r\nMmm.\r\n\r\n\r\nAlex Nelson (7:56.578)\r\nSomething else other than just like dancing to do throughout the night, I think is becoming more and more popular. So being able to hang around fire pits, you know, throughout the night versus just like sitting there, either at the table or on the dance floor.\r\n\r\n\r\nNik (8:8.942)\r\nSo you found ⁓ the real estate. How much was the real estate, if you're willing to share?\r\n\r\n\r\nAlex Nelson (8:15.170)\r\nYeah, so the land was 330, I believe 330 ,000.\r\n\r\n\r\nNik (8:18.670)\r\nOK. And then you had to do all of the planning and architecture, and I'm sure that cost ⁓ like how much was the planning and architecture? I don't even know the right words to use, but how much was the planning phase?\r\n\r\n\r\nAlex Nelson (8:30.818)\r\n⁓ Yeah, so you had to do, you got to get with like a civil engineer. They'll do like your site map and, you know, plan out like how your building is going to be with your parking lot and make sure you're hitting all like the codes there. ⁓ So civil and then architect, you know, it's like your MEP. So your mechanical engineering, plumbing ⁓ plans, all that. ⁓ I want to say we, ballpark, we were into it about a hundred grand before we even knew if we're going to get approved financing wise. We had been, you know,\r\n\r\n\r\nNik (8:34.798)\r\nMm -hmm.\r\n\r\n\r\nNik (8:59.118)\r\nHoly crap.\r\n\r\n\r\nAlex Nelson (9:0.738)\r\ntalking with banks and stuff and making sure we're on the right path. But like nothing was official until, you know, we had to keep the ball rolling kind of and keep moving forward. So, you know, it's just keep keep plugging things.\r\n\r\n\r\nNik (9:5.166)\r\nMm -hmm.\r\n\r\n\r\nNik (9:10.158)\r\nDid ⁓ you have ⁓ in your mind like, ⁓ this is what I want the venue to look like? Or did they come to you with a, cool, Alex, you're buying a wedding venue? This is a typical wedding venue. And then you sort of like piece -mailed it.\r\n\r\n\r\nAlex Nelson (9:24.706)\r\nYeah, so a few like the contractors GCs we worked with, you know, we did start we switched a few times So we started with one that had built a venue or a couple venues actually and they had like ideas to give but we wanted to do something completely different So, yeah, we always had the idea of like what we wanted the venue to look like we still have like their original like drawing that we just drew like at our kitchen table and honestly ⁓ We don't have a friend. We should have it framed. I\r\n\r\n\r\nNik (9:39.598)\r\nOkay.\r\n\r\n\r\nNik (9:48.558)\r\nDo you have it framed?\r\n\r\n\r\nNik (9:53.806)\r\nYou should do it.\r\n\r\n\r\nAlex Nelson (9:54.466)\r\nBut I think I have it somewhere. We plan to eventually. ⁓ But honestly, from that original floor plan that just my wife and I drew up, it stayed pretty true to what we were thinking. We tweaked some things that made a little more sense. But we didn't have some big architect firm draw out and do everything for us and design it for us, really. It was just off the top of the dome.\r\n\r\n\r\nNik (10:17.166)\r\nAlright, ⁓ so 300 ,000 -ish for the land, 100 ,000 for all of that work before you even knew whether or not you're going to get approved. How much did it cost to build?\r\n\r\n\r\nAlex Nelson (10:26.466)\r\nYeah. ⁓ Yes, I don't know the breakdown exactly, but basically we ended up about 2 .9 million all in. ⁓ So that's the land, parking lot, building, all the utilities, ⁓ and then all of them like FF &E as well. Yeah, so we went down like the SBA path ⁓ and we went like all the way down to the wire. We got like term sheet, we got approved, but...\r\n\r\n\r\nNik (10:41.486)\r\nHow did you fund it?\r\n\r\n\r\nAlex Nelson (10:54.882)\r\nWe were buying our land from this developer. So he was developing this big like 48 acre parcel We were just buying a chunk of it in the corner It was nice because it had like city water and utilities ready to go and it's gonna be zoned, right? Well, it was all good but we bought it like before he was done in our county what they had is like a pretty like a preliminary plat and then a final plat had to be the final plat needed to be done before we could actually get our building permits and start\r\nbreaking ground and things like that of this development. And so we kind of bought it in the meat in the middle of all of that. And basically it was supposed to be ready to build on July of 2021. It didn't end up being ready to build on until April of 2022. ⁓ You know, so we were back in. ⁓ Yeah, I was back in like March, April, May of 2021 that we're working on pricing and all this stuff. And, you know, COVID had just happened and it was still going crazy. Lumber was going crazy. So.\r\n\r\n\r\nNik (11:39.118)\r\nShe's always. ⁓\r\n\r\n\r\nAlex Nelson (11:51.970)\r\nEvery time we found out that like it was getting delayed, we would go back and get new bids from all the subs and everything and it'd go up 50, 60, 80 grand, like every single time. So then we'd have to go back to the bank and ask for more. So I think we got approved for like three, ⁓ three like raises on the loan or three loan amount increases. And then on like the fourth one, they, they turned us down. So then we kind of had to go back to the drawing board and start scaling.\r\n\r\n\r\nNik (12:18.926)\r\nDuh. Screw the bank.\r\n\r\n\r\nAlex Nelson (12:22.082)\r\nback. ⁓ But then that whole time we were already like booking weddings and taking deposits in and doing these things. So we had to like hold true to like what we were saying the building was going to be. So it's going to be anything significant. ⁓ Anyways, we were very or I was.\r\n\r\n\r\nNik (12:39.278)\r\nSo it wasn't stressful. It wasn't stressful at all at that time, right? It was pretty. ⁓\r\n\r\n\r\nAlex Nelson (12:42.946)\r\nIt's very, very stressful and it's hard to even communicate like what that process was like, because it was just like a whirlwind and it was wild and all the moving pieces. ⁓\r\n\r\n\r\nNik (12:49.934)\r\nDude, that is, okay, hold on. Let me just reframe that. Like you're trying to build something that you've never built before to run a business you've never run before. You've gotten commitments from people who you've potentially never met. They've paid you money for a date to be completed. And you're sitting there thinking, I don't even know how I'm gonna fulfill. Like how did you even manage that? Did you have to do any refunds?\r\n\r\n\r\nAlex Nelson (13:15.970)\r\nYeah, so we did, so like we gave ourselves like, it was supposed to start building on July 2021, we didn't start taking bookings till July 2022, because like our build was supposed to be like seven -ish months, so we're giving ourselves like a four or five month cushion there for delays and all this stuff, you know, we thought we were being smart at the time, clearly very wrong. ⁓ So we didn't have weddings from like July until October, so I think we had to cancel 19 weddings. ⁓\r\nwhich was terrible, it was like the worst thing we ever had to do, you know, that was not our intention. Like we didn't care about the money. We gave all the money back. If they wanted to stay with us, we would give them like half off. So basically they would have to pay like the remaining amount that they owed. And then for anyone that we had to move, we did like the research and found and contacted all the venues and gave them like a huge list of like all the venues that were still open for their dates that they originally had. ⁓\r\n\r\n\r\nNik (13:45.862)\r\nmy gosh.\r\n\r\n\r\nAlex Nelson (14:12.290)\r\nSo, I mean, we did like a couple other things, like someone had sent out an invite, we refunded them for their invites that they sent out, and we tried to do ⁓ as much as we could. ⁓\r\n\r\n\r\nNik (14:17.774)\r\nI ⁓ worked in hospice ⁓ for 12 years and that is an incredibly stressful environment. Okay, you're dealing with death and dying. But I've always told people there are like four events that are the most important in anyone's life. Birth and death are obviously the top two, right? And if we screwed up a death, we didn't get to give a refund, we didn't get to 50 % off your next visit, right?\r\nthat someone dies one time and we screwed that up. Like it sucks. But then like, and I would say this to my team, I'm like, then there is the birth of a child. I think that's like the number three most important moments in people's lives. But number four is a wedding. Like you, so you, like you picked a very stressful, happy, joyous, but also stressful industry to be in. It's, it's, it's pretty interesting because most of the time people don't think like, yeah, the wedding industry that is stressful. It's stressful.\r\n\r\n\r\nAlex Nelson (15:18.434)\r\nIt's stressful. And yeah, a lot of people don't, you know, especially like the venue side, you know, if you're, if you're one of the other vendors that are like, you know, straight service side, I think people might see that like you have to deal with brides, but they don't, I don't think people realize as much that how many like questions and then things that we have to deal with on just the venue side as well. Like you should see our inbox and the amount of questions that we get and like, you know, dad's calling, mom's calling, people want to swing by and like all these things when they already have like skin -fed meetings and it's just...\r\nIt's pretty much never ending. ⁓ But you know, yeah, that is like, that's the world that we live in and the rabbit hole that we went down, I guess. ⁓ But, you know, and that's why, why they are expensive. There is a lot to it. So, you know, complain or big dollar amounts and think we're raking it in and things, but there's a reason for it. So it's not all sunshine and rainbows by the means. ⁓\r\n\r\n\r\nNik (16:7.598)\r\nSo let's ⁓ talk a little bit about that now. So you've built the facility, you've got weddings coming in. How do you make money? ⁓ You have a couple of revenue streams, just from what I've seen on Twitter. What are your revenue streams?\r\n\r\n\r\nAlex Nelson (16:22.306)\r\nYeah, so big things are rental income. ⁓ So it's just like what we're renting ⁓ the building for. Like in that price, there's a bunch of things that are included as far as like tables, chairs, you know, you get the whole building, the suites, all the furniture. There's like two staff members on site, like we'll have cleaners come in afterwards for you. All those things, that's all included in like the rental price. And then we also make money on the bar. So it's our next biggest revenue driver.\r\n\r\n\r\nNik (16:28.558)\r\nOkay.\r\n\r\n\r\nAlex Nelson (16:49.858)\r\ndriver and like they have to buy all the alcohol from us. We do let them like pre -purchase like kegs and cases of wine and things like that. So there's that. Otherwise we don't do a ton of like decor rental or we don't do anything with the catering. They bring in their own caterers.\r\n\r\n\r\nNik (17:8.014)\r\nYeah, I was going to ask what it so they bring in their own caterers. Have you developed like a preferred relationship with a certain catering company or like their opportunities for that or is it pretty siloed?\r\n\r\n\r\nAlex Nelson (17:12.034)\r\nYeah. ⁓\r\n\r\n\r\nAlex Nelson (17:20.834)\r\nYeah, yeah. So we started, we have like what we call like an open vendor policy. So really the couple can bring in whoever they want. As long as they're like licensed insured, you know, legit vendors. It's not, you know, their family cooking out of crock pots and stuff like that. But so they can bring in whoever they want. We do now have like a preferred list. They don't have to pick from this list. And then on the on that like list, there's preferred vendors and those vendors do give us a kickback a little now.\r\nWe didn't want to do that right away. We were young, just getting an industry. We didn't want to go to all these vendors and be like, yeah, well, you give us a cut of your business just because we're going to refer people out to you or whatever. So we waited until we actually made relationships and figured out who we liked and didn't like and who was doing the job and who we want to be associated with. ⁓ So we do do that now. But yeah, I mean, the point of the open vendor policy is so that people can pick their own vendors. I think...\r\nIf you zoom out on the industry, you used to get married in, most people used to get married out of church and then you'd go to like a hotel or some sort of ballroom, right? And like they would usually do the catering or you have to go through their one caterer, where things kind of shifted is going towards these like what I call like standalone venues. So it's like a venue where you can do the ceremony, reception, cocktail hour, all in one location. And I think part of the reason why those got so popular is that you can bring in your own vendors, like you don't have to pay.\r\nyou know, the hotel can bring prices and be like locked into like this one thing that they're just copying and pasting over and over again. So we always wanted to hold true to like, they can bring in who they want and make it their own. So.\r\n\r\n\r\nNik (18:58.926)\r\nMakes sense.\r\n\r\n\r\nNik (19:3.886)\r\nHow do you get customers?\r\n\r\n\r\nAlex Nelson (19:7.714)\r\nYeah, so a lot of it is just word of mouth at this point. When you are having close to 70 weddings and you hold 300 people, so weddings are between 180 to 300, and you're doing two of them a weekend, so you're talking ⁓ three to 600 people getting in the door every weekend. ⁓ A lot of it is just coming from that, now that they know that we're there. There's only so many venues around here. So...\r\nYou're basically bound to find us. Like if you're getting married in like the surrounding area, you're probably going to find our venue. Mostly, you know, we're, we're on the not in the wedding wire. Yeah. Mostly word of mouth. We don't pay a ton or do much on SEO. I think I had someone look at our website and our ranking was like not that great, but like, it kind of doesn't matter at this point, but I'm not saying that we can't get better at it and do more things, but.\r\n\r\n\r\nNik (19:43.054)\r\neither through word of mouth, ⁓ SEO I'm assuming.\r\n\r\n\r\nNik (19:59.758)\r\nHmm.\r\n\r\n\r\nAlex Nelson (20:3.106)\r\n⁓ like I said, there's only so many. Well, I mean, we obviously have Facebook and Instagram and I've done some like boosted and some ads here and there, but they don't, they don't convert super duper well in my opinion. ⁓ so I just don't do them a ton at this point. ⁓ so yeah, we're not paying a ton in like marketing or paid ad spend, ⁓ by any means. The biggest thing is like we pay to be on the knot and the wedding wire, the knot bought the wedding wire a few years back. So it's all one platform.\r\n\r\n\r\nNik (20:3.406)\r\nWhat about like Facebook or Instagram?\r\n\r\n\r\nAlex Nelson (20:32.035)\r\nI think we pay like 500 bucks a month or so to be on that platform. It's like a big one in kind of the wedding world. They pay a ton of SEO, you know, so if you Google wedding venues near me, that's probably going to be the top thing on Google is going to be the knot in the wedding wire where they have a list of ⁓ 10, 20, 30 venues in the area. So.\r\n\r\n\r\nNik (20:49.390)\r\nSo you don't even look at your customer acquisition cost. You're not sitting here calculating, OK, how much did it ⁓ cost for me to acquire ⁓ one customer? ⁓ That's really interesting.\r\n\r\n\r\nAlex Nelson (20:53.794)\r\nCough cough\r\n\r\n\r\nAlex Nelson (21:0.002)\r\nYeah, no, I don't because we're not spending a lot of marketing. Yeah. ⁓\r\n\r\n\r\nNik (21:2.991)\r\nAre you ⁓ really busy? Like how do you measure ⁓ your, ⁓ is it capacity? Are you like, okay, what's our occupancy rate or what percentage of potential filled ⁓ weddings do we have? Like how do you measure your operational efficiencies?\r\n\r\n\r\nAlex Nelson (21:20.642)\r\nYeah, yeah, so there's what you call like a peak season in every area around the country is a little different because it's mostly around weather. ⁓ So like for us, it's May through up until like Thanksgiving, pretty much. That's our peak season. So we expect to pretty much book every Friday, Saturday throughout that season. And then off season or off peak would be like March, April. No.\r\nMarch, April, November is kind of what we call off peak, even though, and then it's like May through October, so it's like peak peak. And then off season would be like December, January, February. So December through February, we're not getting many weddings. It's a slow season. If we get anything there, it's honestly a bonus sort of thing. And then, yeah, we expect to be full during peak. And then off peak is usually where we're booking like only Saturdays for that time. So like all day, probably on all of our Saturdays booked, but not Fridays.\r\n\r\n\r\nNik (22:1.038)\r\nOkay, so you have a slow season.\r\n\r\n\r\nAlex Nelson (22:20.194)\r\nsort of thing. So. ⁓\r\n\r\n\r\nNik (22:20.430)\r\nTalk about high level. For this one location, how much revenue are you doing? What are your gross and net margins on that business?\r\n\r\n\r\nAlex Nelson (22:31.010)\r\nYeah, yep. So last year we did like 780.\r\n\r\n\r\nNik (22:32.462)\r\nAnd if you're not willing to share like specific, ⁓ sorry, go ahead.\r\n\r\n\r\nAlex Nelson (22:36.866)\r\nNope, I will. And you can go to my Twitter and find, it used to be my pin tweet for the longest time, like 20 .3 numbers. ⁓ And I ⁓ should know these probably off the top of my head, but I don't. ⁓ Yeah, so last year we did like 780 in revenue. ⁓ And I think our NOI or ⁓ net on that was like 3, 43, 50 or so. So that's not including that. But.\r\n\r\n\r\nNik (22:38.190)\r\nOkay.\r\n\r\n\r\nNik (23:1.294)\r\nWow.\r\n\r\n\r\nAlex Nelson (23:6.018)\r\nYeah. And then I think we should do more like nine, closer to 900 ,000 this year. We raised prices, raised bar prices, kind of getting more weddings, getting more non -wedding events in there, getting those referral kickbacks start coming in. So those sort of things kind of added some, some more revenue drivers there. And I think we'll, we'll top her out.\r\n\r\n\r\nNik (23:21.454)\r\nSo ⁓ 780, you'll hit nine. I'm cutting you off. I'm stepping all over you. I'm sorry. Finish your thought. You'll top out.\r\n\r\n\r\nAlex Nelson (23:31.170)\r\nNo worries. All good. I think we're lagging for a sec. ⁓ Yeah, my thought was like, we'll do more like nine probably this year. I think we'll top out around a million or so per year going forward after this. And that's kind of the goal. And you know, one location, you could do more than that, but you're probably adding in other revenue drivers, you're probably doing more rental decor, you're getting into catering, or things like that. So.\r\n\r\n\r\nNik (23:45.358)\r\nWhat?\r\n\r\n\r\nNik (23:58.254)\r\nI mean, I'm just taking a guess here. $340 ,000 NOI based on what you told me, 2 .9 million all in. ⁓ I'm guessing your debt servicing on that is $250 ,000 a year.\r\n\r\n\r\nAlex Nelson (24:0.674)\r\nCough\r\n\r\n\r\nAlex Nelson (24:13.378)\r\nNo, we got lucky. ⁓ Yeah, we're way lower. I think it's about 170 ⁓ per year. ⁓ The rate we got on that was like 3 .5. Yeah, right now, we'll have to refine. We have five -year bloom. So, it'll change eventually, ⁓ but yeah.\r\n\r\n\r\nNik (24:14.414)\r\nNo, not even close. Okay.\r\nawesome.\r\n\r\n\r\nNik (24:25.422)\r\nCool, so you're in a really good spot.\r\n\r\n\r\nNik (24:34.798)\r\nThat's awesome. ⁓ Is that normal? These like 780 ⁓ top line, 340 NOI, I mean, what is that? 40 % net margins. Is that normal for wedding venues?\r\n\r\n\r\nAlex Nelson (24:49.410)\r\nYeah, I think it is. You know, overhead is just not a ton, right? Like we had like one person ⁓ beyond like a salary and like that's our manager, you know, she's doing the tours all like we do like a three month meeting or two week meeting. So she's doing all the meetings and answering all the leads and inbox and those sort of things, you know, the stuff throughout the week. And then, you know, on event day, we're paying two people hourly to be there. We actually outsource our bartenders.\r\n⁓ to like a traveling bartender company and then the couple has to pay for those bartenders like on the bartender tab. So it's basically a wash for us.\r\n\r\n\r\nNik (25:25.262)\r\nI believe ⁓ bartenders are called mixologists. I think you have to legally call them ⁓ mixologists. I don't think you can call them a bartender.\r\n\r\n\r\nAlex Nelson (25:33.858)\r\n⁓ Yeah, why not? ⁓ We all want to be called that. ⁓\r\n\r\n\r\nNik (25:36.558)\r\nI'm just kidding. I'm just kidding. ⁓ So before I get to some rapid fire questions, let me ask you two last questions. What is your cash conversion cycle look like? I'm assuming you're getting like 50 % up front and then 50 % on the back end. Or is it all in the back end? Is it all up front? Like, how do you charge?\r\n\r\n\r\nAlex Nelson (25:55.394)\r\nYeah, so it's 50 % down to book. ⁓ You know, so people right now are looking at 2025 and 2026 for the most part. So 50 % down to book to hold that date nonrefundable. And then the remaining 50 % would be due three months out from their date. I'd say it's pretty standard. I've seen it broken up into threes. I've seen it broken up into fours. I've seen 50 % down now, 50 % down like six months out. Kind of just depends. We have like a three month meeting.\r\n\r\n\r\nNik (26:12.878)\r\nSo you're.\r\n\r\n\r\nNik (26:22.574)\r\nSo you're carrying a lot of cash because people are booking ⁓ these events far in advance, right? ⁓ So you probably just have a lot of cash on your balance sheets. How do you manage ⁓ that cash? Is it just sitting in cash? Are you parking it in treasuries or what's your cash management strategy?\r\n\r\n\r\nAlex Nelson (26:25.890)\r\nCough\r\n\r\n\r\nAlex Nelson (26:31.490)\r\nCorrect.\r\n\r\n\r\nAlex Nelson (26:40.386)\r\nYeah, yeah, parking on treasuries. I hold a lot of them. Meow. Have you ever heard of them or seen them? Brandon is active on Twitter. ⁓ So I think they're checking and getting like 5 .2%. Even if I leave in checking. ⁓ So yeah, yeah, holding those deposits usually sitting on a lot of cash, which is nice. Go ahead.\r\n\r\n\r\nNik (26:46.478)\r\nyeah ⁓ see\r\n\r\n\r\nNik (26:54.670)\r\nAwesome. Okay.\r\n\r\n\r\nNik (26:58.606)\r\nAnd then.\r\nThat is awesome. ⁓ In this space, ⁓ how are businesses like this valued? Is it off of a multiple Vibhida? Is it off of the value of the land? Is it a combination of the two? ⁓ What's common?\r\n\r\n\r\nAlex Nelson (27:16.610)\r\nYeah, because it's pretty niche. ⁓ And a lot of ⁓ these ⁓ venues are just mom and pop owners, right? Like there's not, for the most part, no big P companies coming in and rolling them up. ⁓ If they're bigger, they're getting more thrown into the hotel space. ⁓ The closest thing to it is a hotel. So however you want to value a hotel. What I'm seeing for...\r\n\r\n\r\nNik (27:20.782)\r\nHmm\r\n\r\n\r\nNik (27:30.446)\r\nyet.\r\n\r\n\r\nAlex Nelson (27:41.698)\r\non bettys for sale. And I looked at quite a few, especially when I first got on Twitter, I was getting thrown a ton of opportunities and I was thinking I'd maybe go buy a bunch more. I sense kind of regressed from that strategy. ⁓ But what I, the issue that I would see is they want to value the business on some sort of multiple, you know, two to three times EBITDA. And then they wanted to throw like a real estate value in there. But it just doesn't make sense because ⁓ with interest rates and everything, you know, to go get the debt for that, like the NOI won't come close to\r\nyou know, actually covering that debt services. So it just doesn't make sense. So me personally, you know, ⁓ it should just be more valued one or the other, you know, either putting like some sort of like business value on it, or you just like value the real estate on some sort of cap rate or however you want to do it. But you can't like...\r\n\r\n\r\nNik (28:12.078)\r\nRight. Covering it.\r\n\r\n\r\nNik (28:29.519)\r\nYep. Is there, is there a standard cap rate that you would value these at?\r\n\r\n\r\nAlex Nelson (28:36.482)\r\nI haven't seen a standard, you know, again, closest thing you could find is like a hotel. ⁓ but I mean, it's more of a specialty property, so it should be like 10 to 15, I would say. ⁓ that's just ballpark. It really depends, you know, location, tons of other things matter, but.\r\n\r\n\r\nNik (28:37.070)\r\nWas it like, no, okay.\r\n\r\n\r\nNik (28:42.798)\r\nOkay, that's fair.\r\n\r\n\r\nNik (28:48.206)\r\nYeah. Okay.\r\n\r\n\r\nNik (28:53.550)\r\nI have some rapid fire questions for you and then I want to go and look at a couple of deals, see if there's any, I don't even know, I haven't researched, so this might be a dud, ⁓ but okay. Rapid fire questions, what do you love about this business?\r\n\r\n\r\nAlex Nelson (28:54.530)\r\nand stop.\r\n\r\n\r\nAlex Nelson (29:2.914)\r\nCool.\r\n\r\n\r\nAlex Nelson (29:8.322)\r\nYeah, the cash cycle is the best probably is getting my cash upfront, you know, always sitting on a lot of cash helps me sleep at night. So.\r\n\r\n\r\nNik (29:12.462)\r\nYeah, that's a great answer. What do you ⁓ hate about it?\r\n\r\n\r\nAlex Nelson (29:20.034)\r\nWhat do I hate about it? ⁓ It is stressful. It's a high stress day. Anything that's not perfect at the building or the venue, there's always maintenance stuff. But anything that's not perfect for their wedding day, we're stressing about getting it fixed right then and there. It's not like we can call someone and get it fixed in a week. It needs to be fixed now. So stressful. High stress day.\r\n\r\n\r\nNik (29:41.582)\r\nTrue, it was very time sensitive. ⁓ What are you obsessed with right now? ⁓ This could be business or non -business. Yeah.\r\n\r\n\r\nAlex Nelson (29:48.738)\r\nWhat am I obsessed with right now?\r\nThat's a great question. ⁓ Probably ⁓ Twitter has ⁓ been my obsession over like the last year. ⁓ Twitter, yeah. Learning a lot online, meeting a lot of cool people, building some cool things on there. Yeah, yeah. It's been nice. I never thought of myself as a content creator. I hate that word. But it's been cool to be on there. ⁓ So that and then...\r\n\r\n\r\nNik (29:59.726)\r\nTwitter.\r\n\r\n\r\nNik (30:6.574)\r\nbuilding a network, building an audience.\r\n\r\n\r\nAlex Nelson (30:20.578)\r\nI'm just, I'm fascinated with a lot of different businesses. You know, I'm the wedding venue guy on Twitter, you know, but I don't want to only be that. Like, we are buying like a coffee company right now. My wife's opening like a baby boutique. I'm starting a marketing agency. You know, I'm partnering on that project. He mentioned at the beginning with Ben Wolf and his team, it's a huge like landscape hotel. So, so all the things I like.\r\n\r\n\r\nNik (30:34.606)\r\nawesome.\r\n\r\n\r\nNik (30:43.886)\r\nI mean, you've seen ⁓ my business partner, Chris, pivot from mobile home park guy to Chris Kerner, right? He still has that handle, ⁓ but it's possible. It'll happen. I'm not worried about it for you. ⁓\r\n\r\n\r\nAlex Nelson (30:53.186)\r\nI know it is. I know I need to ⁓ need to study up on go way back on his Twitter and see how the transition went. I would like eventually to.\r\n\r\n\r\nNik (31:0.270)\r\nHe should. He should.\r\nAlright, last rapid fire question. Many guys who own businesses like myself that have cash flowing businesses, they look at real estate and they're like, man, I wish I could get into the real estate business. It's just so easy, steady Eddie and many guys in real estate who have real estate businesses are like, man, I wish I could get into cash flowing businesses. So like everybody's jealous of everybody else. What business or industry ⁓ are you jealous of right now?\r\n\r\n\r\nAlex Nelson (31:35.202)\r\nYeah, it's a good question. ⁓ Yeah, shiny object syndrome is a thing, especially when I'm talking about Twitter and seeing everything on there. ⁓ Like I said, I have the venue, ⁓ it's kind of real estate, then it's also business, servicy, I'm doing all these ⁓ things that are very in -person and heavy, so anything online that's super scalable.\r\n⁓ you know, and like low overhead, low, low, like startup costs, ⁓ you know, everything I have done to this day, like very capital intensive and, and in person and tough. ⁓ so anything, anything like that I get jealous of, ⁓ you know, so -and -so started it for five to 10 grand and they scaled it to 150 grand a month. ⁓ Yeah. ⁓\r\n\r\n\r\nNik (32:5.262)\r\nFair answer.\r\n\r\n\r\nNik (32:25.038)\r\n$100 million company scale. All right, I love it. Love it. ⁓ All right, let's look and see if we can find maybe just one or two deals. So the point of this kind of section is we've talked about ⁓ the wedding venue business up until this point. So you've like, you've given us amazing answers, right? Like general revenue numbers, general costs to get into it, how it's run, margins, those types of things.\r\nAnd hopefully we're taking that context and just applying it to businesses that we see. And so two things I'm curious about. One, which of these businesses are you like, ⁓ that's interesting. I want to learn more. And then two, as we look at those businesses, what follow -up questions would you have? Because obviously these listings are not comprehensive. So is that fair?\r\n\r\n\r\nAlex Nelson (33:14.978)\r\nThat's fair.\r\n\r\n\r\nNik (33:15.438)\r\nFair. All right, cool. Let's go here to first of the filters. I'm going to say keyword. Should I do just do wedding venue?\r\n\r\n\r\nAlex Nelson (33:25.108)\r\nYeah, probably best.\r\n\r\n\r\nNik (33:25.358)\r\nThis is where things are gonna fall apart, because we'll see if there's anything even on here. All right, wedding venue, apply.\r\n63, we got 63 results. Yes. All right, and we got it sorted from highest cashflow to lowest. ⁓ Instagram worthy events and catering business in trendy downtown North Carolina. Cashflow, ⁓ 763. Purchase price, 2 .7 million. Red flag, green flag, yellow flag.\r\n\r\n\r\nAlex Nelson (33:59.010)\r\ncash flow seems very, very great for what they're pricing it at. Yeah, I think so. ⁓\r\n\r\n\r\nNik (34:3.422)\r\nreally?\r\n\r\n\r\nNik (34:7.150)\r\nWait, so this is a low price you're thinking?\r\n\r\n\r\nAlex Nelson (34:10.626)\r\nI would say from what I've seen in the past. Yeah. Not saying that it's not a fair price and what it should be, ⁓ but.\r\n\r\n\r\nNik (34:13.774)\r\nOkay, ⁓ well, no, no, walk me through like why is it low? Help me understand why you think it's low. What should it be?\r\n\r\n\r\nAlex Nelson (34:24.386)\r\nYeah, I was looking at a lot of venues for sale last year, and I think people were just unrealistic. So, I mean, and I don't think it's truly low 750 times three, let's say, 2 .2. Yeah. ⁓ You know, it's.\r\n\r\n\r\nNik (34:28.014)\r\nMm -hmm.\r\n\r\n\r\nNik (34:43.438)\r\nCause what is that number? 763 into 270 is a cap rate of five, six percent.\r\n\r\n\r\nAlex Nelson (34:53.122)\r\n⁓ Is ⁓ that right?\r\n\r\n\r\nNik (34:54.894)\r\nNo, let's do some math. ⁓ So 763 and the purchase price was 2 .7. ⁓ So. ⁓ Samson, I was way off. It's a 28 % you know, 28 cap rate. ⁓ Jeez, edit that out. ⁓ Interesting, OK, so that so yeah, back to your point like that's a really good cap rate. ⁓\r\n\r\n\r\nAlex Nelson (35:12.514)\r\nYeah. ⁓\r\n\r\n\r\nAlex Nelson (35:21.506)\r\nYeah, good cap, right? And then if you're going more like multiple wise and still like starting like, you know, business, I think it's like a three and a half multiple. ⁓ That's like EBITDA. ⁓\r\n\r\n\r\nNik (35:26.798)\r\nWell, let's see. You know, it could be that the could be that the real estate is not included. Maybe so that would be a good question is like, is the real estate included in this or not included? It first furniture, furniture fixtures and equipment are included. It looks like the real estate is not. No, it is furniture. Interesting anyways, OK, so that that would be something you'd want to ask is like, OK, what is actually included? ⁓\r\n\r\n\r\nAlex Nelson (35:33.314)\r\nYeah. Yep.\r\n\r\n\r\nAlex Nelson (35:47.010)\r\nYeah, see that's.\r\n\r\n\r\nAlex Nelson (35:56.546)\r\nRight.\r\n\r\n\r\nNik (35:56.910)\r\nWhat about this one? Pasadena, Texas wedding events venue on a four plus acres real estate SBA approved $3 .5 million asking $670 ,000 cashflow.\r\nWhat are your initial thoughts on this? It's not terrible or it is terrible?\r\n\r\n\r\nAlex Nelson (36:13.314)\r\nThat's terrible.\r\n\r\n\r\nAlex Nelson (36:17.986)\r\nIt's not terrible, but I need to know more. ⁓ So what I like to do, let's go long calculator, you know, look at SBA loan right now, if you go 7A, you're going to be at like a 10, 11 % interest rate. So let's say even 10 % interest rate, 25 year term, three.\r\n\r\n\r\nNik (36:21.614)\r\nOkay, what would we need to know?\r\n\r\n\r\nNik (36:36.366)\r\nYeah, so. So it's a 25 year term. OK, so I'm going to. 21 divided by 12.\r\n\r\n\r\nAlex Nelson (36:42.754)\r\nto your finance.\r\n\r\n\r\nNik (36:46.254)\r\nWhat's 25 times?\r\n\r\n\r\nAlex Nelson (36:47.554)\r\nYeah, you know people.\r\n\r\n\r\nNik (36:50.638)\r\nlistening. Keep going.\r\n\r\n\r\nAlex Nelson (36:53.634)\r\neven if you put 500k down ⁓ 10 % interest rate 25 year old ⁓ did it wrong on my end hold on\r\n\r\n\r\nNik (37:5.006)\r\nprice on it 3 .5. Yeah.\r\n\r\n\r\nAlex Nelson (37:6.498)\r\nI'm just trying to go like all park, you know, 27 ,000 a month times 12.\r\n\r\n\r\nNik (37:15.310)\r\nat $3 .30 a year.\r\n\r\n\r\nAlex Nelson (37:18.242)\r\nYeah, it's called 330 a year. What was it? ⁓\r\n\r\n\r\nNik (37:19.470)\r\nwould be.\r\nand the cash flows 670. So I mean, you're more than covered from a debt service covered ratio, right?\r\n\r\n\r\nAlex Nelson (37:27.138)\r\nYeah.\r\nYeah, it's actually not terrible.\r\n\r\n\r\nNik (37:31.694)\r\nAnd then ⁓ the six, and let's see what it is on a cap basis, a 670.\r\nIt's a 19 cap, 19 % return. So that's in that range that you're talking about, like 15, 20 % cap rate for specialty businesses like this. That makes sense. Okay. What would you want to know more about this business? So this is in Pasadena, Texas. ⁓ What stands out to you? It's like, I'd be curious to know how.\r\n\r\n\r\nAlex Nelson (37:59.234)\r\n⁓ it's hard to tell in that picture, but does that look like a tent to you?\r\n\r\n\r\nNik (38:3.694)\r\nIt does look like a dent to me, but I also don't know because these are glass windows on the side, right? They could have just had it. ⁓ Decorated that way.\r\n\r\n\r\nAlex Nelson (38:6.210)\r\nYeah. ⁓\r\nYeah. Yeah, maybe. Right. You know, obviously, like you're buying the real estate, the real estate is important. You know, if they're the majority of their receptions are happening on our tent. Personally, yeah, just. I do want the real estate and I don't want to be operating out of a tent. This seems like a headache and ⁓ something's bound to happen and you have to replace it all the time. You know, it's just not like a true like physical structure, in my opinion.\r\n\r\n\r\nNik (38:17.582)\r\nIs that a deal breaker for you? You want the real estate? Okay.\r\n\r\n\r\nNik (38:37.614)\r\nYeah. Yeah.\r\n\r\n\r\nAlex Nelson (38:39.326)\r\nI ⁓ think you can dress them up nice. You can do some wedding there, but I don't think long -term people are going to love that.\r\n\r\n\r\nNik (38:41.486)\r\nOoh, what about that?\r\n\r\n\r\nNik (38:46.958)\r\nWhat about this one? I want to get into the wedding business Hill Country wedding venue. I have no idea where Hill Country is in Texas, but it just sounds beautiful. ⁓ A $1 ,000 ,000 asking price. Cash flows 300 ,000, so it's like that is a very good multiple. ⁓ If you consider purchasing OK.\r\n\r\n\r\nAlex Nelson (39:6.114)\r\nRevenue is nine.\r\n\r\n\r\nNik (39:8.910)\r\nSo the real estate is not included.\r\n\r\n\r\nAlex Nelson (39:13.922)\r\nYeah, that makes sense.\r\n\r\n\r\nNik (39:13.966)\r\nBut ⁓ it's revenue of 1 million cash flow of, excuse me, sorry, revenue of 950 cash flow of 307. So not quite as good as your business from a margin standpoint, but still decent margins. ⁓ Let's see here. Real estate is owned. Doesn't say what the real estate would be purchased for, but would this be something you're interested in or no?\r\n\r\n\r\nAlex Nelson (39:30.178)\r\nSee you soon.\r\n\r\n\r\nAlex Nelson (39:40.738)\r\nPersonally, no, because ⁓ the real estate's not involved. I just don't want to lease it. ⁓ Part of the business is you're buying the building, paying all the tax benefits of real estate and paying it down and holding it long -term. That's my personal philosophy. ⁓ These numbers are better than what I was seeing about a year ago. I haven't really looked a ton.\r\n\r\n\r\nNik (39:42.478)\r\nNo. He said no.\r\n\r\n\r\nNik (39:49.806)\r\nInteresting, okay.\r\n\r\n\r\nNik (40:1.038)\r\nNo, I love it. Yeah, I said, ⁓ I love it. Well.\r\n\r\n\r\nAlex Nelson (40:10.562)\r\nright now. So maybe it seems like some sellers are being a little more realistic ⁓ sort of thing. But yeah, I have to verify the cashflow. You know, some of these are growing off, you know, SDE, like you gotta verify all their ad backs. ⁓ Other questions I would want to know is how involved are the sellers? Are they like the ones like, you know, we don't work the events ourselves. I'm not out there like every single weekend, you know, working weddings, you know.\r\n\r\n\r\nNik (40:16.142)\r\ncould be.\r\n\r\n\r\nNik (40:35.566)\r\nYeah, yeah.\r\n\r\n\r\nAlex Nelson (40:37.538)\r\n40 weekends out of the year is just not realistic if you want to have any sort of family life. ⁓ Unless that's your thing, but you know, go ahead.\r\n\r\n\r\nNik (40:44.110)\r\nWhere do you?\r\nWhere do you look for businesses? Is it BizBiz or do you have a place where you're like, this is where you look for wedding venues?\r\n\r\n\r\nAlex Nelson (40:55.778)\r\nYeah, I think BizBizSell is fine. That's actually where I found the coffee company that I'm buying, coincidentally. ⁓ Venues, though, are kind of in a weird niche. They could fall on Zillow. It could just be listed as a big property or a house sort of thing. It could be on there. It could be on Loopnet. It could be on BizBizSell. It really just depends. Like I said, it falls into a weird category of real estate and business.\r\nsort of thing, sometimes both, you know, it depends how people are looking at it. ⁓ But yeah, you'll see them listed with like residential brokers, you'll see them listed with business brokers or commercial real estate brokers, kind of all over the map. There's really no like standard right now.\r\n\r\n\r\nNik (41:38.242)\r\nWell, ⁓ dude, this was a great conversation. Thank you for walking us through your business. Thank you for looking at a couple deals with us. ⁓ Where can people find you? Is Twitter the best place? Anywhere else? Okay.\r\n\r\n\r\nAlex Nelson (41:48.418)\r\nTwitter's the best place. It's pretty much all I'm on right now. Twitter, yeah, DM me on Twitter.\r\n\r\n\r\nNik (41:54.158)\r\nAlright, alright, well this was this was fantastic. I can't wait to check in with you in a year and see all the 17 venues you own and operate as you as you take over the world as an operator. And yeah, we'll talk to you later. OK, see you man.\r\n\r\n\r\nAlex Nelson (42:2.978)\r\nWhat's the head?\r\n\r\n\r\nAlex Nelson (42:8.898)\r\n⁓ thanks,",
  "metadata": {
    "duration": "",
    "date": "2024-05-14",
    "platform_source": "Google Drive"
  }
}