{
  "episode_number": "224",
  "episode_title": "Business Broker Reveals Which Businesses AI Can't Touch (Buy These Now) with Jackie Ossin Hirsch",
  "guest_name": "Jackie Ossin Hirsch",
  "business_name": "Atlantic",
  "transcript": "﻿Nikolas Hulewsky (00:00.456)\r\nAll right. My mic is set. Kelly. Yeah. Say hi to Kelly. When she watches this, she'll be like, Jackie said hello to me. She's, she's an English. She's in the UK. Hello, Jackie. dude, I am ex I am excited to have my friend Jackie Hirsch on here because I wanted to get the lay of the land of where things currently stand in the and a market. There's been some changes in the SBA and how you can buy businesses. There's a lot of, you know, macro uncertainty, blah, blah, blah. And I thought,\r\n\r\n\r\nJackie Hirsch (00:03.741)\r\nI'm gonna say hello, shout out to Kelly.\r\n\r\n\r\nJackie Hirsch (00:14.653)\r\nFault of two.\r\n\r\n\r\nNikolas Hulewsky (00:30.434)\r\nWho better to talk to than Jackie? Last year, her company, Atlantic, did $40 million in transactions. She's trending to do more than $50 million this year. So she sees a lot of deals happening. She's got a lot of deals. It's fantastic. Anyways, and I think people like Jackie can give us insights and help us avoid boneheaded mistakes. You the stupid mistakes that end up costing us million dollars, like...\r\n\r\n\r\nJackie Hirsch (00:46.675)\r\nThat was great.\r\n\r\n\r\nNikolas Hulewsky (00:59.074)\r\nsomebody who you just dealt with recently. Tell me about this buyer who cost himself a couple million dollars.\r\n\r\n\r\nJackie Hirsch (01:01.639)\r\nMan.\r\n\r\n\r\nWell, Nick, was a sad story. It was a very sad story. I had a great business on the market. We had a number of buyers. And so the seller said, OK, I'll go with these people. And we had like five LOIs on this. And they said that they can move quickly. They're ready. But of course, in the middle of the deal, because we're in July, at this point, everybody goes on vacation. And they said, we can still handle it, even though we're on vacation. And I said, I really need you to get the contract in.\r\n\r\n\r\ngoing through due diligence and they went with a bank that we didn't want them to go with. Still a reputable bank, but we know which banks can do deals. So they go with this other bank, well-known bank, and the bank decides to do a whole ad back verification as part of the deal. Okay, so clearly the business shows 1.4, okay, EBIT, okay, clearly, but the seller is saying 1.58 EBIT, not a stretch.\r\n\r\n\r\nIt's not something egregious, right? There's a few other ad backs. provide all the data. The bank comes back after four weeks with 1.4. They didn't look or acknowledge a single other ad back and we wasted four weeks, but they still said they'd do the deal. It was insane. And my seller, I think was so mad because it was so much extra work that when they got this other full price, all cash offer from out of left field, they took it.\r\n\r\n\r\nNikolas Hulewsky (02:32.056)\r\nBoom.\r\n\r\n\r\nJackie Hirsch (02:32.199)\r\nAnd the buyer had this non-binding LOI that expired end of July. And they insisted on that. They didn't want it binding. They wanted it to expire and they were out. They were out, you know. So.\r\n\r\n\r\nNikolas Hulewsky (02:38.104)\r\nGosh.\r\n\r\n\r\nNikolas Hulewsky (02:44.27)\r\nWait, so the bank wasn't just doing a quality of earnings. were doing kind of above and beyond the quality of earnings?\r\n\r\n\r\nJackie Hirsch (02:51.443)\r\nThe bank didn't do a quality of earnings. The bank asked for all general ledgers for all years. Fine. The bank asked for, you know, um, just every document and support for these ad backs, which is like the sellers, Amazon purchases and the sellers like stuff for her new house and, know, but it wasn't like an egregious amount. It was like an extra 150 some thousand, right? But like legit like stuff. And then they just didn't do it. They just like flaked and didn't do it. And then\r\n\r\n\r\nNikolas Hulewsky (03:06.988)\r\nYeah, yeah,\r\n\r\n\r\nJackie Hirsch (03:20.253)\r\nthink the seller was so annoyed at how much extra work it was. And then we still don't have the commitment letter. We still don't have the commitment letter. So 60 days passed and she's like, you're out. Totally. And the buyer even said that.\r\n\r\n\r\nNikolas Hulewsky (03:24.202)\r\nyou know this.\r\n\r\n\r\nNikolas Hulewsky (03:27.788)\r\nYou you know, time kills time kills deals. Like the more the time goes on. Time kills deals. It's it's it's a pain. Was the buyer was this a first time buyer? It's so hard because it's a first time buyer. You have to learn some lessons at some point and it's like when I'll go with the bank, Jackie, I get that you have a bank that you say you've worked with and can close deals, but I'm to go with this bank that I talked to and for could bite some of the butt.\r\n\r\n\r\nJackie Hirsch (03:36.252)\r\nyou\r\n\r\n\r\nJackie Hirsch (03:47.333)\r\nIt's hard to learn.\r\n\r\n\r\nJackie Hirsch (03:58.599)\r\nand then they're out and they've been looking for deals for like two years.\r\n\r\n\r\nNikolas Hulewsky (04:00.098)\r\nAnd then that what? my gosh, was it a good deal?\r\n\r\n\r\nJackie Hirsch (04:05.427)\r\nIt's a great deal. It was a really freaking great deal. Like this business has been there for like 40 years. It just every year incrementally does a little bit more like for years. It's not like a one-off. it just shows up like full management team in place, sellers hands off, know, great books, incredible assets. Like.\r\n\r\n\r\nNikolas Hulewsky (04:23.148)\r\nIs the the is the buyer how pissed was the buyer? Were they pissed at you? Were they pissed themselves? Did they like realize it was their fault? Just pissed.\r\n\r\n\r\nJackie Hirsch (04:30.163)\r\nthink they were like pissed all around. I think they handled, they were actually very nice about it. I mean, they did make some threats, but like they were very nice about it. They realized like, I'm sure they showed their LOI to an attorney and they're like, you're out. You're out. So yeah.\r\n\r\n\r\nNikolas Hulewsky (04:34.817)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (04:44.526)\r\nOkay, so what's interesting is what I'm seeing in the &A market right now is there's still a ton of demand. Like there's still more buyers than sellers.\r\n\r\n\r\nJackie Hirsch (04:53.203)\r\nhuge.\r\n\r\n\r\nIt's been like that for 27 years, ever since I've been in this business. Yes, forever. Yes, is. People are always surprised. It is always more buyers than sellers. It is always a seller's market. Always.\r\n\r\n\r\nNikolas Hulewsky (04:58.584)\r\nHas it? Really?\r\n\r\n\r\nNikolas Hulewsky (05:10.518)\r\nIt's always a seller's market.\r\n\r\n\r\nJackie Hirsch (05:12.473)\r\nAlways a seller's market. It's like being a woman in Alaska. You can get a date all the time. Like, it's like that. Is that inappropriate? I don't know. I mean, but that's what it is. Like my understanding is like 70 % male, 30 % women. You can always get a date in Alaska. Yeah, that's my understanding.\r\n\r\n\r\nNikolas Hulewsky (05:15.405)\r\nWhat?\r\n\r\n\r\nNikolas Hulewsky (05:23.918)\r\nNo.\r\n\r\n\r\nWhat?\r\n\r\n\r\nIt's like a female on an oil rig. She has no shortage of dating options. is free. It's a great analogy. I'll tell you that much. It's a great analogy. Well, I'm just saying from what I'm reading, I would have thought because rates went higher, you would have less of these full cash offers because private equity pulled back. mean, they did pull back, right? wasn't this isn't like made up. They did pull back. But you're not necessarily you're not necessarily seeing that at the deals at your price point.\r\n\r\n\r\nJackie Hirsch (05:32.987)\r\nYes. Nope. Whatever she wants. is supply and demand. Yep.\r\n\r\n\r\nNikolas Hulewsky (06:00.428)\r\nRight? Because you're lower middle market, right? Okay.\r\n\r\n\r\nJackie Hirsch (06:01.733)\r\nRight, correct. our okay, so I did this post and Cody Sanchez reposted it. It was pretty funny. I had all these goats running down a road. Okay. And like that was the video and I got it from somebody like who was posting about all these goats running down a road and I posted that this is what my deals. This is what my inbox looks like when I put a deal of a million EBIT on the market. It's strategic. It's private equity come private equity groups. It's individuals. It's first time buyers. It's people who have bought 10 companies like it's\r\n\r\n\r\neverybody for these deals, these small add-ons. And so I get everybody and I'm talking to all these people. you know, the the company that's buying this company that I told you where the buyer lost out, they own 30 companies. They yeah, like they can come in and they can just like buy this and they know it they're in, you know, so it was just a no brainer for the seller to say yes.\r\n\r\n\r\nNikolas Hulewsky (06:44.944)\r\ngeez. Yeah, so they could come in and make a full cash offer.\r\n\r\n\r\nNikolas Hulewsky (06:54.778)\r\nCan I tell you a funny goat story? I just found out about these businesses. These are real businesses where their business is brush clearing with goats. It's goats as a service. I didn't realize this.\r\n\r\n\r\nJackie Hirsch (06:56.775)\r\nyeah, definitely. I love good stories.\r\n\r\n\r\nJackie Hirsch (07:03.185)\r\nyeah, definitely. It's amazing. But you know, yes, that's environmentally sound. There's people that do that in Florida. mean, Florida has endless grass growing, endless. It is year round. Grass is a year round business in Florida. July it gets in.\r\n\r\n\r\nNikolas Hulewsky (07:11.906)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (07:17.868)\r\nYeah, but don't the alligators just like, there's a goat frrrr? Isn't it? Not really. I'm so ignorant. I have no idea. It feels like there's a lot of alligators there.\r\n\r\n\r\nJackie Hirsch (07:21.945)\r\nNo, not really. I mean, it could happen. It could happen. There's plenty for that. Yeah, there's plenty for the alligators. Okay, so there's a lot of alligators here. But what happens is they take them out of the lakes where people live, and they dump them in some other lake. So there's some lakes that have like crazy amounts of alligators. And so that's why it seems. Yeah.\r\n\r\n\r\nNikolas Hulewsky (07:37.614)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (07:42.328)\r\nDude, feels like living in Florida's Russian roulette if I wanted to go swim somewhere.\r\n\r\n\r\nJackie Hirsch (07:48.657)\r\nIt's a swampy, sweaty, moldy, mildewy, buggy place. I like it, but it's not for everybody. And so I think like, yeah, it's sending a gorgeous, but like it's like sweaty and buggy. And so when people like the national flower shouldn't be the dogwood or the state flower, it should be like mildew or mold. That should be mildew should be the state flower for sure. Totally.\r\n\r\n\r\nNikolas Hulewsky (07:52.398)\r\nBut it's sunny all the time.\r\n\r\n\r\nNikolas Hulewsky (08:08.926)\r\nMildew should be the state flower. That's a ringing endorsement of Florida if I've ever heard it.\r\n\r\n\r\nJackie Hirsch (08:13.767)\r\nWell, if you want a pressure washing company, you have plenty of work. Yeah.\r\n\r\n\r\nNikolas Hulewsky (08:16.245)\r\nIt's Florida. It's Florida. What are you seeing right now? Like what kinds of companies are coming to market?\r\n\r\n\r\nJackie Hirsch (08:21.255)\r\nYeah, interesting. we were still having a very robust year because it's Florida. So I don't know how other states are, but Florida is one of those states. It's people are endlessly moving here. Always. They're always moving to Florida. It's a very transient state. It also means they do move out because sometimes it's like, my God, I had no idea there are so many bugs and it's so sweaty here and they move out. So that does happen. But there's more opportunity here than ever before since COVID because I feel like we used to joke that\r\n\r\n\r\nNikolas Hulewsky (08:28.3)\r\nWhat do you mean? Sorry, it's Florida. What does that mean?\r\n\r\n\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (08:48.802)\r\nOkay.\r\n\r\n\r\nJackie Hirsch (08:51.091)\r\nwe get a lot of calls from Ohio, let's say in January, if the winter was really bad, they're like, that's it, we're moving to Florida, right? Because winter's hard and it's hard when it's snowing and you're shoveling and that's no joke. So we have our own problems here, right? But other states have theirs. So we're seeing always an influx, but what I'm seeing now, last year at this time, 720 businesses had transacted in Florida and this year it's only 635.\r\n\r\n\r\nNikolas Hulewsky (09:07.852)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (09:20.046)\r\nSo it's done.\r\n\r\n\r\nJackie Hirsch (09:20.101)\r\nAnd of that in our system, yeah, it is down because I think, you know, we had the election and so there's that trepidation no matter who's elected. There's always like a pause. And then we had the tariff non-starter, which was, you and I told everybody, I'm like, this is going to be fine. And everybody's panicking and it's going to be fine, as I said. So they'll sort that all out.\r\n\r\n\r\nNikolas Hulewsky (09:27.725)\r\nMm-hmm.\r\n\r\n\r\nJackie Hirsch (09:45.517)\r\nand but it does cause a little bit of pause and so now you'll see third and fourth quarters just be off the hook. But usually first quarter yeah usually first quarter after an election is dicey and i'm sure we could pull up historical data on that.\r\n\r\n\r\nNikolas Hulewsky (09:52.302)\r\nIs that what you think?\r\n\r\n\r\nNikolas Hulewsky (09:57.228)\r\nWell, I was looking nationally at the deal volume. looks like we're down about 4%, quarter over quarter, 25 over 24. And time on market is actually lengthening. that may not be the case in a state like Florida, but nationally. It also looks like, according to this, some slight softening for multiples on the lower end. So we're talking about\r\n\r\n\r\nJackie Hirsch (10:07.571)\r\nOkay. Yeah.\r\n\r\n\r\nNikolas Hulewsky (10:26.19)\r\nprobably million dollars or less of EBITDA businesses. And then what was the other? because of some changes in the SBA, there's been some hesitancy. That's the softening. Let's talk about the changes. Talk about these changes, these unprecedented changes that have never happened before.\r\n\r\n\r\nJackie Hirsch (10:34.771)\r\nRight. That's, that's the softening. That's the softening. It's not the, yeah. Okay. So, oh my God. So when the changes came out, my brother and I just started laughing because what happened? It went back to the way things used to be. That's all that happened. And I would say from 2016 on, it was a very, they really maybe opened it up too much and they were getting too many defaults. And that's real.\r\n\r\n\r\nLike not every SBA business is a winner. And so they were getting a lot of defaults. So there's some different things. Like there's a survey business that I'm selling and the buyer has to have the license. Otherwise SBA doesn't want to do the deal. And if the buyer doesn't have the license, they want the seller to go on the note. This is how it used to be.\r\n\r\n\r\nNikolas Hulewsky (11:23.203)\r\nMm-hmm.\r\n\r\n\r\nJackie Hirsch (11:24.359)\r\nSo was hard to sell a trades business. It was hard to sell HVAC before 2016. It was hard to sell like all these other, you know, things that required this license. And you used to be able to get an HVAC business with probably like a million EBIT for like a 2X or a 3X. You used to be able to get that all day long.\r\n\r\n\r\nNikolas Hulewsky (11:41.646)\r\nSo yeah, let me try my best to paint the picture and then you tell me what I got wrong. The reason that it used to be easier, or excuse me, harder, and the reason it got easier is because there were some rule changes with the SBA. So the SBA, the Small Business Administration, they have this program called the 7A program that allows people to buy small businesses for as little as 5 % down, but typically 10 % down for that business. And then the SBA backs those loans. They historically have really low delinquency rates, et cetera.\r\n\r\n\r\nRight around 2016 and then 2020 they changed even more. They started changing the rules. It used to be that if a seller was going to stay on in the business in any capacity, they had to personally guarantee the the loan, excuse, the business to the SBA. On top of that, if there's this like kind of way around that you can get around 10 % down and it's if you had the seller contribute equity, which was a seller note,\r\n\r\n\r\nJackie Hirsch (12:24.135)\r\nRight. Yeah.\r\n\r\n\r\nJackie Hirsch (12:35.901)\r\nCorrect. Right.\r\n\r\n\r\nNikolas Hulewsky (12:38.744)\r\nWell, that note now has to be on full standby, which means if I'm buying a business for $5 million and I tell and the seller says, yes, I will do a seller note for $1 million. And the bank looks at that and says, okay, we're counting that as contributed equity. But you've got to wait to make note payments until 10 years from now until the SBA is paid off. So it's now disincentivized these sellers to retain equity or do creative seller financing because they've either got a personally guaranteed loan or\r\n\r\n\r\nJackie Hirsch (12:41.67)\r\nRight.\r\n\r\n\r\nJackie Hirsch (13:04.595)\r\ncorrect.\r\n\r\n\r\nNikolas Hulewsky (13:08.43)\r\nThey've got to wait 10 years if the note's on full standby. Right.\r\n\r\n\r\nJackie Hirsch (13:10.483)\r\nRight? And that's what it's been before. So people have to put in, put down 20%. That's what it used to be. People put down 20%. And when you put down 20%, then it's different. No, it's different if they put down 20%. Things change.\r\n\r\n\r\nNikolas Hulewsky (13:16.728)\r\nYeah, well, and that's why these HP. Good, sorry.\r\n\r\n\r\nNikolas Hulewsky (13:24.182)\r\nRight. Well, and if you put down 20%, you don't have to go through the SBA. can go the traditional lending route. Obviously, they don't necessarily have as good of terms, right? So they're not necessarily going to be 10-year loans, and they're not necessarily going to have the same interest rates. But if you have the cash to put 20 or 30 % down, and then the assets that the bank can look at and say, I'm going to loan against those assets, you could go the traditional financing route. But the SBA just not only made it much easier to buy these businesses, they made you could be like way more creative.\r\n\r\n\r\nJackie Hirsch (13:27.443)\r\nMmm.\r\n\r\n\r\nJackie Hirsch (13:35.122)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (13:51.278)\r\nAnd so these HVAC companies, like you're saying, these services businesses, the multiples just exploded because it was much easier for first time buyers to get in. Now there's kind of a pullback because these first time buyers aren't able to do that, which I find very interesting. It says here, the loan default actually got estimated 5 % in 2024, which is a decade high for the SBA. Are you seeing any of that with your buyers in Florida?\r\n\r\n\r\nJackie Hirsch (14:04.68)\r\nRight.\r\n\r\n\r\nJackie Hirsch (14:19.795)\r\nI'm not, but mean, 5 % is not huge, right? It's something, but the taxpayer does have to pay that, right? That's the taxpayer that has to do that. And basically the SBA guarantee is an insurance policy to the bank. So the bank wants at least 15 % down, right? So if you put down 5 % and then the seller has a 10 % note, right? That's kind of the exposure. And then the rest would be paid to the bank. So the bank's never really out.\r\n\r\n\r\nNikolas Hulewsky (14:20.898)\r\nNo.\r\n\r\n\r\nJackie Hirsch (14:48.89)\r\nif there's a default.\r\n\r\n\r\nNikolas Hulewsky (14:50.752)\r\nNo, the bank's not out and they've started tightening their underwriting policies. Anyways, I agree. Are you seeing still the same amount of like first time entrepreneurship through acquisition buyers? It's the same amount. It's not more, it's not less.\r\n\r\n\r\nJackie Hirsch (14:55.537)\r\nYeah. Yeah. So it's interesting.\r\n\r\n\r\nJackie Hirsch (15:04.147)\r\nAlways. It's always been, yeah, I mean, that's always been 90 % like of the buyers that we deal with our first time buyers, even for larger deals, like it's, there's a lot of first time buyers and we're there's not\r\n\r\n\r\nendless investment banking jobs, where all these MBAs gonna go. There's all of these sales people for software that's been going away and moving offshore too. So those jobs are going away. So there's a lot of six figure jobs, like mid six figure jobs that are going away and those people have to do something.\r\n\r\n\r\nNikolas Hulewsky (15:35.96)\r\nto their looking at businesses. What are popular right now? What are you seeing coming onto the market?\r\n\r\n\r\nJackie Hirsch (15:37.469)\r\nso they look at businesses.\r\n\r\n\r\nJackie Hirsch (15:42.385)\r\nanything that makes money. mean, anything really like anything that makes money. Like really, that's what people are looking for. It's cashflow. So as long as it's like, so survey company, here's the issue though. You have to have some knowledge and you have to have that license and is a very niche specialty that they do. So there's stuff like that or there's, have a material. Yes. Yeah.\r\n\r\n\r\nNikolas Hulewsky (15:43.884)\r\nAnything.\r\n\r\n\r\nNikolas Hulewsky (15:50.552)\r\nTell me about the survey company.\r\n\r\n\r\nNikolas Hulewsky (16:02.567)\r\nIs it like land survey? it, we're going to go do a land survey or are they conducting survey? Okay.\r\n\r\n\r\nJackie Hirsch (16:07.719)\r\nYeah, land survey. So, but it's a specific niche in the construction industry, more specific than just land.\r\n\r\n\r\nNikolas Hulewsky (16:14.097)\r\nAnd to your point, the reason those now are going to be harder to sell is because in the past, because they're licensed, I saw this in healthcare as well, you need that owner license to hang on the wall at least for a period of time while you have this transition. Maybe you are the buyer and you can hang your license, but most of the time these first time buyers, don't have that yet. And so the way they've gotten around that is, hey, you leave your license on the wall, you can roll equity, or hey, you leave your license on the wall, you can do a seller note. But now the SBA is requiring the personal guarantee.\r\n\r\n\r\nAnd it's like, no, I'm not willing to personally guarantee your loan.\r\n\r\n\r\nJackie Hirsch (16:45.309)\r\nWell, no, they'll always, right. The buyer always is personally guaranteeing. They're now asking the seller to personally guarantee. Yeah, that's where it's gotten crazy is it's somebody else guaranteeing your loan. Yeah, they're saying no.\r\n\r\n\r\nNikolas Hulewsky (16:50.67)\r\nSure, that's what I'm saying. Yeah, yeah, yeah, sorry.\r\n\r\n\r\nThat's what I'm saying. If I'm the seller, exactly. If I'm the seller and I'm like in the past, sure, I'll roll some equity and I don't have any personal guarantee anymore. That sounds great. And you can use my license now. Wait, you want to use my license? Okay. But in order to do that, I've got to personally guarantee your loan. I'm not doing that. So the buyer is now in a much trickier situation of trying to figure out, okay, how do I not get somebody to come in and have that license?\r\n\r\n\r\nJackie Hirsch (17:21.437)\r\nYeah. Yeah. Pretty intense.\r\n\r\n\r\nNikolas Hulewsky (17:24.59)\r\nAll right, tell me, I want to hear some of the other cool businesses you've got going on. Land surveying, I like that. What else you got?\r\n\r\n\r\nJackie Hirsch (17:30.355)\r\nSo yeah, we have a underground site construction, site utilities. that one, yeah, like 7 million EBITDA on that one. I have a materials testing business. do, yeah, yeah, some real, yeah.\r\n\r\n\r\nNikolas Hulewsky (17:40.968)\r\nSeven million EBITDA? my gosh. No searchers buy in that business unless they've got a proper search fund behind them.\r\n\r\n\r\nJackie Hirsch (17:48.813)\r\nNo, maybe an independent sponsor. Maybe. But yeah, we have a whole list and we're going to do the list privately. So if you're not on that list, you won't see that. It's not going to be anywhere.\r\n\r\n\r\nNikolas Hulewsky (18:04.366)\r\nDude. okay, sorry. Okay, so underground construction.\r\n\r\n\r\nJackie Hirsch (18:07.133)\r\nAnd that's what happens. So that's why people are always trying to contact brokers. Like, how can I get on your list? And I don't just randomly throw people on my list. Like, it has to be purposeful, right? And the list is then approved by the seller. Or like, I have a materials testing business. And so we're going to, it's a non-destructive materials testing business. So we're going to like specific companies that own other non-material destructive testing businesses. You know, they take a piece of...\r\n\r\n\r\nan aerospace part and they stick it in something that like matches it a bunch of times and they look at how much it was dented and then they pick off like the coating of the paint and you know this is all measured yeah and they've been doing that for 30 some years\r\n\r\n\r\nNikolas Hulewsky (18:44.226)\r\ninsane. I just talked. I just talked to a company there is semiconductor company who like make specialty parts for Northrop gum Northrop gun room. How are the frick you say it? Thank you. The Defense Department subcontractors. I've never heard of them. You've never heard of them. They're making probably eight nine figures as a company very profitable. But they're like just one specialty part they do one thing.\r\n\r\n\r\nJackie Hirsch (18:55.965)\r\nGrumman, yeah, yeah.\r\n\r\n\r\nJackie Hirsch (19:00.989)\r\nMm-hmm. Yeah.\r\n\r\n\r\nNikolas Hulewsky (19:12.75)\r\nAnd it's an amazing business for people that you've just never heard of. What was the last business you saw that you were like, oh man, I want to buy this business.\r\n\r\n\r\nJackie Hirsch (19:16.039)\r\nYeah, you see that all the time.\r\n\r\n\r\nJackie Hirsch (19:21.685)\r\nGod, that happens all the time. There's like, there's certain businesses and like you just fall in love with them. I do love construction and I love aerospace and manufacturing. I like all that stuff. You know, my dad was a rocket scientist and you know, he had a manufacturing facility at one point. So that stuff is like very exciting for me. And I think people would not realize that's exciting for me. But really all businesses like there's some we know and they're starting this like certain like sports.\r\n\r\n\r\nNikolas Hulewsky (19:23.499)\r\nHahaha\r\n\r\n\r\nJackie Hirsch (19:48.741)\r\nTraining franchise and I just like had so many questions But I didn't want to overwhelm them because I he didn't know what I did for living my it's like how big is the space? What kind of turf are you using? Are you getting the turf like from different areas? Like I just so many I get very excited about it. It's fun\r\n\r\n\r\nNikolas Hulewsky (20:00.822)\r\nYeah, yeah,\r\n\r\n\r\nAnd he was like, whoa, whoa, whoa, whoa, whoa,\r\n\r\n\r\nJackie Hirsch (20:06.801)\r\nYeah, he liked it. I was like, you know, turf is like, it's a little bit soft this year. So you might be able to negotiate between the different turf. And he's like, really? I'm like, yeah. He's like, well, they the company recommended this turf company. I was like, okay, you might want to call this guy. And then there's this company out in this other part of Florida that cuts turf. That's all they do is they cut turf. And so they might have some people so you know, if you want to save\r\n\r\n\r\nNikolas Hulewsky (20:30.97)\r\nDude, see your love of business just like plays perfectly to you being a broker. You just get to nerd out and ADD out on every cool business that comes your way, which is amazing.\r\n\r\n\r\nJackie Hirsch (20:34.867)\r\nProbably, yeah. Yeah. yeah. on Sesame Street or Electric Company, whenever they'd show a manufacturing facility, I was like, how do I get there? Like, how can I have that? Yeah.\r\n\r\n\r\nNikolas Hulewsky (20:49.954)\r\nYou were like, can you tell me how to get to that manufacturing company? And they were like, not Sesame Street? Can you tell me how to get to that manufacturing company?\r\n\r\n\r\nJackie Hirsch (20:54.747)\r\nYeah, exactly. Exactly. No, my favorite book as a kid was like, what do people do all day and they had all these different jobs. It was just fascinating to me. I never got tired of that. I love that. Yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (21:08.022)\r\nMy kids always say that. What do you do all day? What?\r\n\r\n\r\nJackie Hirsch (21:13.525)\r\nwell, I tell I tell Melina like what I do. She knows what I do. Like she, you know, I show her numbers and then, you know, she was making bracelets. I was like, okay, let's do a PNL for this. We did like a whole PNL and like attributed her labor costs to like each bracelet. She's like, I think I need to be charging more. I'm like, that's right, sister. Charge more.\r\n\r\n\r\nNikolas Hulewsky (21:16.995)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (21:31.65)\r\nThat is so, dude, it was so funny. So my oldest, Royce, he's 11, and we were talking and I don't like to tell my kids, Republican good, Democrat good, or Republican bad, Democrat bad, right? Because I want them to think for themselves and I don't really think in those binary choices. So we were talking and he's asking me some questions. He's like, dad, what do you think is better, Democrats or Republicans?\r\n\r\n\r\nJackie Hirsch (21:48.295)\r\nRight. Yeah.\r\n\r\n\r\nNikolas Hulewsky (22:00.782)\r\nI was like, well, okay, so we talked through it. I'm like, well, know, Republicans tend to believe in limited government. They don't believe that the government should be the one who's consolidating decision making power, money, and then making decisions. They think, oh, I can make my own decisions and help people in that way. Democrats think that's the reason for community. We should have a government that's actually helping people and makes it easier for people to afford things or have access to things, et cetera. So I'm like, so, you know, they have good arguments on both sides. I'm like, what do you think Royce? He's like, I think.\r\n\r\n\r\nI think I'm a Republican because if you want to improve your life, you just got to make good choices. you you dad, you grew up poor and you just make good choices. So I just think that that's the way you should do it. I was like, okay. Oh, no, I'm not kidding you. A week later, my younger son wins a raffle. It's beautiful, like new rackets, like $200 racket. And my oldest son is just like, I wanted a new tennis racket. That was the one I wanted. He just was like,\r\n\r\n\r\nWoe is me, crying, sad. And he just starts asking, like, can I have that racket, Audub? Can I share that racket with you? Please, please. And finally, my eight-year-old is like, okay, we can share the racket. And so my son now is sharing this racket. And I see this whole interaction happened. I'm like, Royce, let's go to McDonald's real quick. He's like, okay. Because I wanted to talk to him. I was like, I don't like the way that you got that racket. Like, what do you mean? I like, well, you just wind until you got your way.\r\n\r\n\r\nJackie Hirsch (22:59.239)\r\nYeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (23:27.246)\r\nWell, I really wanted the racket. I was like, okay. Well, do you remember last week when we were talking and you said, I'm a Republican because I think people can just make good decisions and they can earn things if they do do things the right way. I was like, remember that? He's like, yeah. I was like, do you see how you contradicted your own logic? He was like, oh my gosh. Yeah. I'm like, why didn't you think how could you earn extra money? Could you do a job? How do you find the racket? Could you start maybe a side business and then get some extra income and go and buy the racket yourself? He was like,\r\n\r\n\r\nYeah, I see what you're saying. I also understand more now. think government should do more for people. And I was like, gosh, no, okay. Now we're like, anyways, it's so funny when you're talking to your kids and they're learning through these things. So I love the fact that you're doing PNLs with your daughter on how she's making your bracelets.\r\n\r\n\r\nJackie Hirsch (24:05.523)\r\nIt's so hard.\r\n\r\n\r\nJackie Hirsch (24:13.127)\r\njust you just have to do it. Yeah, I mean, it's really important to talk about money and explain like how it all works. So, okay, I thought maybe we'd talk about real deals, right? Like, have some real deal. Okay, the real deal segment. Okay, so I get all these calls, right? Because I'm an LP and a number of deals. So I'm an LP investor. And then I also sell companies and then a bunch of my friends own businesses. So like, they call me with like, business therapy type problems. So when my\r\n\r\n\r\nNikolas Hulewsky (24:23.886)\r\nLet's do it. Yes, yes.\r\n\r\n\r\nreal deal segment.\r\n\r\n\r\nJackie Hirsch (24:42.547)\r\nOne of my buyers calls me and was like, hey, I think the seller's doing drugs. And I was like, okay, tell me more. You think it's like illegal drugs or legal drugs? Okay. And there's a reason I asked. And so he said, I don't know, but I heard something being chopped up in the background and something snorted. And I was like, hmm, okay. Yeah.\r\n\r\n\r\nNikolas Hulewsky (25:06.112)\r\nlike real drugs. shoot.\r\n\r\n\r\nJackie Hirsch (25:09.331)\r\nOh yeah, this was like not a one-off like, like this was like, I'm very concerned. And I said, okay, all right, so let's talk about this. No, it's not, it's actually not. Different state, but every state has drug problems. Like, let's be real, every state. So I said, okay, this is my logic. This is my logic on this. I was like, okay, just cause they're chopping it up doesn't mean it's illegal. It could be a legal drug, but they're taking it a different way.\r\n\r\n\r\nNikolas Hulewsky (25:16.27)\r\nI mean, it is Florida, right? you know. Okay, okay.\r\n\r\n\r\nNikolas Hulewsky (25:38.136)\r\nYou're the best. I like you. You're such a good person.\r\n\r\n\r\nJackie Hirsch (25:38.691)\r\nAnd maybe it's stable, like maybe it's stable, right? Because maybe it's a consistent thing. Because the concern was, are they buying something illegal that could be laced with fentanyl? This is a real concern. And so we started walking through talking about this. Yeah. Yeah, a buyer who's also a friend buying this company and we're having this conversation and we're trying to figure out if the seller is doing legal or illegal drugs.\r\n\r\n\r\nNikolas Hulewsky (25:52.718)\r\nSo, sorry, this is a buyer and a seller or a friend, okay.\r\n\r\n\r\nJackie Hirsch (26:07.815)\r\nto know if they are in danger, right? Because if they're buying illegal substances, then they might be going to places that might not be safe and have people after them, right? So we're trying to sort this mystery out. I think we sorted it out. It's a legal drug that's being used differently. And we're just trying to clean them up. I'm like, let's clean them up.\r\n\r\n\r\nNikolas Hulewsky (26:15.064)\r\nYeah, yeah.\r\n\r\n\r\nJackie Hirsch (26:29.743)\r\nand get him some help and support him because I think he's a good guy. Yeah, this is a real deal. So that we can get this deal done. It's a multi-million dollar company.\r\n\r\n\r\nNikolas Hulewsky (26:39.758)\r\nDid you have to have an intervention?\r\n\r\n\r\nJackie Hirsch (26:42.451)\r\nWe are not there yet, but we've mentioned like maybe some healthy living choices that seems to be going well. So yeah, they're reducing, like they've already reduced alcohol consumption. So I mean, we're getting there, you know? Then, yeah, yeah. Should we talk about the seller that went to jail or no?\r\n\r\n\r\nNikolas Hulewsky (26:47.313)\r\nmy gosh.\r\n\r\n\r\nNikolas Hulewsky (26:56.472)\r\nThis is what brokers have to do. This is what they have to do to get deals across the finish line. my God. Yeah. Yes, real deal. Hello.\r\n\r\n\r\nJackie Hirsch (27:04.915)\r\nOkay, all right. So I get a call, I get a call and my friend who bought this company said, I realize the seller has been to jail. I said okay.\r\n\r\n\r\nNikolas Hulewsky (27:19.16)\r\nGive me an idea how big this company is.\r\n\r\n\r\nJackie Hirsch (27:22.439)\r\n15 million in sales. Like not a small company. Okay, real company. Yeah, real company. And I said, so a seller went to jail and is it like murder? Is it like they stole money from old people? Is it they were just kind of a drug addict mess and like beat up somebody? Like where are at?\r\n\r\n\r\nNikolas Hulewsky (27:26.53)\r\nYeah, it's a real company. Yep.\r\n\r\n\r\nJackie Hirsch (27:45.011)\r\nRight? what's like, think, I think they like stole a car when they were in their twenties, like early twenties and they were from like a really bad family and like on drugs and all sorts of stuff. I'm like, hmm, okay. Okay. So have they done anything like this recently? And they got in some argument with somebody. So I feel like this person has like a lot of trauma. So this is what I said to them. said, I feel like this person has a lot of trauma and like can't handle their\r\n\r\n\r\nstuff well, right? When something goes wry and loses it and\r\n\r\n\r\nNikolas Hulewsky (28:16.942)\r\nWait, wait, wait, so why did they care? Why did the buyer care that they had been arrested in their 20s?\r\n\r\n\r\nJackie Hirsch (28:20.241)\r\nBecause they're, yes, because they are having some issues with getting along with the seller and they still need the seller for some functions of the business. But the seller like blew up and they had met the seller many times before closing, but the seller like blew up and the seller like caused the GM to quit and like stuff, right, stuff. And I said, okay. And he's like, and I've been praying about it and I'm not coming up with anything. I was like, okay. I think.\r\n\r\n\r\nNikolas Hulewsky (28:28.888)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (28:33.368)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (28:41.09)\r\nYeah. Yeah.\r\n\r\n\r\nJackie Hirsch (28:50.397)\r\nwhat we have to look at is this person definitely has some trauma, right? Because there's unresolved trauma and it doesn't sound like they have a lot of friends. And so I think you need to like meet them where they're at and just like love them for like a second. Like you just need to like love them and see their creation, see what they built. And now they have...\r\n\r\n\r\nNow you own their creation and they have lost it because that was their whole identity and they do not know what to do. So they are making a mess like a bull in a china shop. So he's like, okay, this is very interesting, Jackie. I did not think about this. And so he's like, okay, I will look at this. And like since then, there has been like peace. So like he just kind of reformatted and tried to like love this guy who has some problems and\r\n\r\n\r\nNikolas Hulewsky (29:38.348)\r\nYeah.\r\n\r\n\r\nJackie Hirsch (29:43.539)\r\nnot be his friend, but just meet him where he's at. Sometimes that's all you have to do is just meet somebody where they're at as an individual because there is no course on grieving or trauma or how to deal with failure or loss or anything in school. Right? And there's this book called Letting Go by Dr. David Hawkins. It's like one of the best books I've ever read. read it four times and I recommend it all the time, but there's a chapter on like\r\n\r\n\r\nhow to handle failure and you just don't have stuff like that or how to handle trauma. And people don't teach kids that. Now luckily for Melina, a few years ago we had four family members die all in one year. So she's a pro. yeah, she knows how to handle all of this. No, it's hard. Yeah, it was a rough time. But I will say she is such a wise person.\r\n\r\n\r\nNikolas Hulewsky (30:26.656)\r\nLuckily for Melina, luckily, luckily for Melina.\r\n\r\n\r\nmy gosh. Yeah.\r\n\r\n\r\nJackie Hirsch (30:38.331)\r\nand has such wisdom and is really able to support her friends anytime they have something tragic. Like she had so much thrown at her that she can like make it through. Like really, she's so balanced. She's a Libra.\r\n\r\n\r\nNikolas Hulewsky (30:51.832)\r\nWell, just like me, I'm a Libra October 19th. there's this, there's this book called leadership and self-deception. It's written by this company, the Arbinger Institute, and they have a bunch of books out, but their whole thesis, their whole philosophy is like, you are the problem. So if there's an issue, like you are the problem and you need to figure it out and you're probably doing something that's leading to these issues. So if you can just change your mindset and reframe it,\r\n\r\n\r\nJackie Hirsch (30:55.375)\r\nnice. Okay. Yeah. Balanced.\r\n\r\n\r\nJackie Hirsch (31:03.314)\r\nInteresting.\r\n\r\n\r\nJackie Hirsch (31:16.467)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (31:22.008)\r\nyou're probably also going to change the whole dynamic of the situation. And I think you learn, you tend to learn that in entrepreneurship, the hard way you get in at first, you're managing people and you're like, well, this guy's always late. He's must be a terrible person or this guy's whatever doing X, and Z. And you've got to have this balance. Like you do have to move quickly, but you also learn you can't throw the baby out with the bathwater when you're trying to close multimillion dollar deals. Like, do you want to be right? Or do you want to get the deal done? And sometimes those two things are in conflict.\r\n\r\n\r\nJackie Hirsch (31:42.919)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (31:51.022)\r\nIt doesn't matter how right you are. You're not going to get the deal done or you're not going to get it across the finish line. So I like this. You have a good mindset. We're like, okay, all right. They're chopping some stuff up. Okay. Okay. And it's white. It's white. Okay. That's not good. It's white. How do they act after they chop it up? Other manic high manic high. Okay. Lots of energy. Let's not assume it's what we think it is. Let's ask some questions.\r\n\r\n\r\nJackie Hirsch (32:12.027)\r\nRight. Yeah. I mean, we're trying to solve it. We're trying to help him, right? We're trying to like, we're trying to help this guy and like figure it out. But you know, Taylor Swift has that song and she says, it's me. Hi, I'm the problem. It's me. Right? Like people know that they're the problem, but it is tricky. And I do wish that\r\n\r\n\r\nNikolas Hulewsky (32:18.423)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (32:26.701)\r\nYeah, yeah, yeah.\r\n\r\n\r\nJackie Hirsch (32:32.786)\r\nmore was taught. And I don't know if it's because I'm a middle child as one of four kids and I don't know if your middle children are like off doing their own thing and like just kind of sorting things out. But you have to like mediate and you've got to like sort it out and try and see it from the other side, which sometimes is very hard, especially when you're in it very hard.\r\n\r\n\r\nNikolas Hulewsky (32:50.732)\r\nme, that's the difference between getting deals done and not getting deals done is your ability to problem solve. Because every deal, maybe not every deal, maybe there's a deal out there that's just like, it was smooth sailing. But for the most part, every deal dies a couple of times. And if you can't figure out how to resurrect it, then you're going to lose the deal. know, stuff comes up. shoot, I forgot to add that back. did I not tell you about this employee doing X, Y, and Z? And then the buyer is like, that was material.\r\n\r\n\r\nJackie Hirsch (32:53.735)\r\nYeah. Yeah.\r\n\r\n\r\nJackie Hirsch (33:08.881)\r\nRight.\r\n\r\n\r\nJackie Hirsch (33:15.571)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (33:17.602)\r\nAre you kidding me? You didn't disclose that before we my gosh, deals off. We're gonna retrade this, you know, and so it's, it's really, really difficult to get a deal done until you've learned that lesson of like, you got a problem song.\r\n\r\n\r\nJackie Hirsch (33:31.847)\r\nSam Rosati says all the time that a deal dies three times. But the deal I did with Sam only died one time. It only died one time and then it was back on. So it was only dead for five days. It does, but sometimes they die and then they don't come back. Like that deal I mentioned, they don't come back. So sometimes they do die. I think that there's always blips and problems\r\n\r\n\r\nNikolas Hulewsky (33:40.834)\r\nThat's how good you are. You should put that as your slogan. I'm such a good broker, my deals only die once.\r\n\r\n\r\nJackie Hirsch (34:01.883)\r\nIt's just not, the deal is a living breathing thing. And the people behind it are living breathing things, which is why we have to like support that. And it's difficult. It's not just a flat thing.\r\n\r\n\r\nNikolas Hulewsky (34:11.618)\r\nYeah. I always tell people, I tell people who are buying businesses for the first time, the most important thing, you can tell me I'm wrong. That's okay. I think the most important thing that you can do buying your first business is not do all the market analysis and all the due diligence and hire the best team to do your financial underwriting, blah, blah. That's all table stakes. The most important thing is building a relationship with the seller because\r\n\r\n\r\nIn my experience, every single deal gets to the point where are we going to close or are not going to close? And if you can't call the seller and be like, hey, man, I just found out that actually you've had all these expenses on the side that kind of crushes our valuation. What should we do? If you guys can't have that conversation, you're done. And if after you close and you don't have a good relationship and you're like, hey, this main, this key customer just left. This key employee is really being a pain in the butt. What can I do?\r\n\r\n\r\nJackie Hirsch (34:57.201)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (35:09.152)\r\nYou're just at a severe disadvantage. So I think building trust and having a good relationship with the seller is the most important thing. All the other things come second to it. I'm not saying they're not important, but if you can just focus on and leverage, not leverage, what's the word I'm looking for? Optimize, there it is. If you could just optimize one thing, it's the relationship with that seller.\r\n\r\n\r\nJackie Hirsch (35:15.836)\r\nHuge.\r\n\r\n\r\nJackie Hirsch (35:19.315)\r\nYeah.\r\n\r\n\r\nJackie Hirsch (35:28.531)\r\nYou know what's interesting? I was on a broker panel a couple years ago and the Southern Brokerage, their philosophy is that the buyer and seller shouldn't be friends and there should be like a little bit of animosity between them. like, my God, no wonder all of their deals are like that. Like.\r\n\r\n\r\nNikolas Hulewsky (35:45.752)\r\nYeah, seriously.\r\n\r\n\r\nJackie Hirsch (35:46.715)\r\nI start thinking like, my gosh, like I hear all these stories, but it's almost like they're creating that stage where I'm trying to always like foster friendship and like help everybody see each other in the best light and like, how can we support them? And like, what can we do? It's a whole different thing. Like I would say it is very frequent that my buyers and sellers are friends after the transition. Like there was a, there was a deal I did earlier this year and.\r\n\r\n\r\nWe had a love fest first meeting, we had offers and then I hear like bickering and I was like, okay ladies, it was two guys. So was like, okay ladies, we're all gonna go on a second date. And I told everybody that so we do a Zoom call and I was like, I would like to welcome everybody to the second date. And everybody started laughing and I said, I will tell you both this, I know you both well, this is Byron Seller. I know you both well and I know a lot about each of you, none of which I've shared with the other.\r\n\r\n\r\nBut what I will tell you is that I believe after this deal is done, you both will be friends forever. Because you have a lot in common. Okay, and that was all true. And they talk every week. Not about business, like they just talk every week. Yeah, it was pretty funny because I saw one of them and they're like, yeah, yeah, I just talked to so and so. So yeah, that's my aim. My aim is that they're friends after.\r\n\r\n\r\nNikolas Hulewsky (36:46.222)\r\nThat's awesome. That's awesome.\r\n\r\n\r\nNikolas Hulewsky (36:56.524)\r\nWell, especially for sub $10 million businesses, you know, SBA style businesses, the relationship is so important. Maybe up market, it's less important and you're just, it's just a transaction. But if you don't build a relationship with that seller, then it's just going to be transactional. Both of you, you're trying to get it to pay for as little, they're trying to get as much as possible. And you're just always going to be at odds.\r\n\r\n\r\nJackie Hirsch (37:05.437)\r\nDefinitely.\r\n\r\n\r\nSo important.\r\n\r\n\r\nNikolas Hulewsky (37:25.08)\r\nto get anybody to sort of acquiesce, there has to be the relationship there with them wanting to see you win and vice versa. So I just think building that relationship with the seller, I didn't know that. Like my first couple of deals that I did, I just didn't know that. It took time to understand that that was a real thing. But the best deals that I've done have been because I've had good relationships with the seller.\r\n\r\n\r\nJackie Hirsch (37:47.153)\r\nIt's hard. mean, Nick, you're super likable, so I could see where they would really like you. And I think you have a great people skills as far as how to work with them. And that makes a huge difference too. So I think a lot of times people won't get to multiple deals, right? So then you have the deal background. it was easy for them to respect you even more as you went on and did more and more deals, because they see you've done it. so I think the first deal for both buyer and seller a lot of times is very hard.\r\n\r\n\r\nNikolas Hulewsky (37:54.635)\r\nThank you.\r\n\r\n\r\nNikolas Hulewsky (37:58.638)\r\nIt's true.\r\n\r\n\r\nNikolas Hulewsky (38:08.908)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (38:15.608)\r\nThat is so funny, because for many sellers, it is their first deal. And it's their baby, it's their biggest deal ever. So they're like, well, who is this person that wants to adopt my baby and pay me money for it? Do they even know what they're doing?\r\n\r\n\r\nJackie Hirsch (38:18.642)\r\nYeah.\r\n\r\n\r\nYeah. yeah.\r\n\r\n\r\nJackie Hirsch (38:29.583)\r\nEven when I sell something for like tens of millions of dollars, like it is often their first deal. And it's their baby, yeah. So something to think about. Yeah, it's a lot. It's stressful and I'm trying to mitigate that stress. I have people cry. You just do what you can. It's hard. I mean, it's a big life shift.\r\n\r\n\r\nNikolas Hulewsky (38:35.458)\r\nReally.\r\n\r\n\r\nMy goodness. Yeah.\r\n\r\n\r\nNikolas Hulewsky (38:49.868)\r\nAre you seeing AI impact you or your businesses that you're selling more and more? Or is it still kind of on the fringes? Is it still like, that's not really material?\r\n\r\n\r\nJackie Hirsch (39:02.181)\r\nYou know, right now I am getting more emails from AI than ever before. So I'm getting like AI blasts of emails. I definitely think it's helping speed things up. It's a great tool. I love listening to some of your episodes on all the different ways it can speed things up and you can do more with AI. And I think that that's how it will be for a long time. It's basically going to be like to assist the person to get to the next level and do more.\r\n\r\n\r\nNikolas Hulewsky (39:04.654)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (39:20.002)\r\nMm-hmm.\r\n\r\n\r\nJackie Hirsch (39:30.693)\r\nI do think it will replace some jobs, like cars took away all of the different horse and wagon jobs. So yeah, it'll do that. And Web3, different things. So I see it, but will AI replace a realtor or a business broker, if you will, or?\r\n\r\n\r\nNikolas Hulewsky (39:38.149)\r\nfor sure. Yeah.\r\n\r\n\r\nJackie Hirsch (39:52.751)\r\nany of those jobs, you know, they've been saying for years, we're going to replace realtors. And sometimes I feel like you need them more than ever before to kind of cut through a lot of the noise and fake photos.\r\n\r\n\r\nNikolas Hulewsky (40:04.03)\r\nSo I agree. think I actually think that relationship businesses are going to become even more valuable because it's you want to trust a human in the process. But I guess kind of where I'm going with it, I just talked to a searcher this week who a couple of years ago closed on a business and really quickly they found one thing that they automated in their business and just automating that because it changed the speed to lead. It closed way more of their, they were a sales company closed way more of their customer sales. They\r\n\r\n\r\nthey doubled almost overnight just by solving that one problem, right? And that was a, hey, cool, AI kind of helped us, assisted us to identify and then implement the solution. I guess that's kind of what I'm asking more of, like, are you seeing, you are seeing that?\r\n\r\n\r\nJackie Hirsch (40:35.955)\r\nAmazing. Yeah.\r\n\r\n\r\nJackie Hirsch (40:46.385)\r\nYeah, I'm definitely seeing that. Yeah, definitely. I'm definitely seeing that. we're using it when we build our lists. So we pull lists from different sources when we're going to market strategically our businesses that we have available that are engaged.\r\n\r\n\r\nSo we're definitely using it for that. We're using it for some of our write-up, but not all of it. Sometimes AI pulls all sorts of crazy stuff, so you have to really watch it. And the prompts do matter, and then I try and add things in the prompts. So I use it to rewrite different things. And then you have to add.\r\n\r\n\r\nlike a personal element after it, right? So you have to like humanize it again. So you take some human items, you put it in, you get a dehumanized thing back and then you rehumanize it to its final form. That's kind of what I feel like I'm doing in writing. And that seems to work for us. So we're definitely using it for data aggregation and then trying to just summarize certain things.\r\n\r\n\r\nNikolas Hulewsky (41:26.99)\r\nSure.\r\n\r\n\r\nNikolas Hulewsky (41:52.344)\r\nHow do you see the big, beautiful bill and tariffs? Or you can just take one of them at a time. you think those are an accelerant to people buying small businesses? Do you think they're holding them back? Really.\r\n\r\n\r\nJackie Hirsch (42:02.099)\r\nI don't think it matters. I don't think it matters. think the tariffs, look, people are always buying cashflow. There's gonna be ups, there's gonna be downs. Even in 2008 and 2010, in 2020 during COVID, people were buying and selling businesses. So there's always an element that's buying and selling no matter what is going on. And Warren Buffett says when there's blood in the water, there's even more deals happening. So I hear that tariffs are affecting certain things.\r\n\r\n\r\nAnd then when they realize it was fine, then it kind of goes back to normal. So there was a business that I was talking to and there was kind of a blip and then it kind of all went back to normal. And, you know, it's just what it is.\r\n\r\n\r\nNikolas Hulewsky (42:45.587)\r\nThe blip, that's fine.\r\n\r\n\r\nJackie Hirsch (42:47.879)\r\nIt is it's like a price shock. I would call it like a price shock or price hit. You know, price jump, and then it kind of stabilizes versus inflation where like you don't know where that wave is going. Right. So I don't feel like we're there. There was like a blip, and everybody kind of accepted it and then kind of move forward. But I mean, I go ahead.\r\n\r\n\r\nNikolas Hulewsky (43:06.67)\r\nother.\r\n\r\n\r\nAre there any trends, any businesses that you're particularly excited about right now? any, tell me.\r\n\r\n\r\nJackie Hirsch (43:14.491)\r\nYes. Okay. So I have requests for businesses where AI can't touch it. Okay. AI can't touch it. AI cannot fix your sink. AI can't do it. Right? Anything where AI can't touch it, right? Or the other thing I'm seeing, and this is, this is really unique. Can't touch it. Can't touch it. I love this. That was such a great video.\r\n\r\n\r\nNikolas Hulewsky (43:23.47)\r\nCool. Go on.\r\n\r\n\r\nNikolas Hulewsky (43:37.136)\r\nMC Hammer, MC Hammer businesses. You can't touch this.\r\n\r\n\r\nJackie Hirsch (43:43.277)\r\nSuch a great video. I'm going to do that next time. We'll do it on film. You and I will cut back and forth of us doing the MC Hammer dance. Neither of us doing it well. It'll be great. It'll be great. I can also do Running Man. But for middle-aged women, I don't know if it's a good look. It's not a good look. So anything AI, anything that AI can't touch, we're seeing physical businesses.\r\n\r\n\r\nI'm seeing boutiques come back, which is so interesting. A bunch of clothing boutiques and a bunch of gift stores have closed, but there's an element of boutique that's coming back because people wanna be able to try on in person. And so I'm seeing in very high volume areas, a really good boutique that's uniquely curated, something very different. That has been interesting. Other trend I'm seeing is restaurants that come back.\r\n\r\n\r\nNikolas Hulewsky (44:13.358)\r\nWhat does that mean, boutiques?\r\n\r\n\r\nJackie Hirsch (44:38.211)\r\nand they're just doing a few good things. They have a few items on the menu, like very nichey nichey restaurants. Now, I always find it interesting when buyers are like, I do not want a restaurant. I will never own a restaurant. I do not like that kind of business. I don't think it's a good business. It's very risky. And I'm thinking so 40 % of the businesses on the market are restaurants nationwide.\r\n\r\n\r\nNikolas Hulewsky (44:59.246)\r\nThat's insane, 40 %?\r\n\r\n\r\nJackie Hirsch (45:01.075)\r\n40%, okay, so you're now saying no to 40 % of the businesses. The other thing is I don't care how skinny a person is, everybody I know eats. Like I've never met somebody who does not eat. Even if they don't eat much, they still eat. And so I still find the restaurant business fascinating. Here's the trends that I see in restaurant businesses. Again, these microscopic menus, like I just do this and I do this really well. There's that. Two, these, in and out, exactly.\r\n\r\n\r\nNikolas Hulewsky (45:26.734)\r\nlike in and out.\r\n\r\n\r\nI do four things, boop, boop, boop, okay.\r\n\r\n\r\nJackie Hirsch (45:31.419)\r\nRight, right, or I make, you know, these like dumplings and I have this sauce and this is what I do, right? Simple, okay? But I sell a ton of it and we're like cranking that out. So I see that. The other thing I see are these, I'm seeing like still gastropub type.\r\n\r\n\r\nNikolas Hulewsky (45:38.094)\r\nOkay, yep.\r\n\r\n\r\nJackie Hirsch (45:49.223)\r\ntype stuff on a very high level and expensive. And people who have money, they just don't care. They're eating. Yeah, gastro, like a fancier menu. Like everything's organic. They get it from like, you know, they try a new farm table, those types of things. Right, Our sauce is amazing. Yeah. This is from...\r\n\r\n\r\nNikolas Hulewsky (45:53.314)\r\nI don't know. I'm so sorry. Gastropub? What's that?\r\n\r\n\r\nNikolas Hulewsky (46:02.702)\r\nIt's locally sourced. Yeah. What's the name of this chicken? Can I go and meet the chicken? Can I go to the farm?\r\n\r\n\r\nJackie Hirsch (46:11.443)\r\nExactly, exactly. Like in Portlandia, that's like the funniest thing ever where they go to the farm. Oh my gosh, I love that. So there's that. And then lastly, I am seeing a trend of like super healthy menu. Okay. And it's starting to come back. But that'll be very interesting because our food is very polluted and our food has a lot of issues. So all these people now have these issues like they have glyphosate issues, they have issues with you know, you know,\r\n\r\n\r\nNikolas Hulewsky (46:13.91)\r\nYes, yes, that's answer. Yes, it's so good.\r\n\r\n\r\nJackie Hirsch (46:40.291)\r\ndairy and other allergens, know, whether it be nuts. And so people are trying to do these micro focused restaurants on super healthy eating. I'm also seeing private chef services really on the rise. Mike Gurdley will be very excited about that because he loves private chef services. So, you know, there's some different things that are on the rise. I do. We just got one. It's yeah. So 17 bucks a meal, all organic, all\r\n\r\n\r\nNikolas Hulewsky (46:59.662)\r\nDo you have a private chef?\r\n\r\n\r\nNikolas Hulewsky (47:03.726)\r\nCan you tell me about it?\r\n\r\n\r\nNikolas Hulewsky (47:08.782)\r\n$17 meal per person? OK.\r\n\r\n\r\nJackie Hirsch (47:10.643)\r\nYeah, 17, no, 17 bucks a meal. Yeah, per person. So if you get like nine meals a week and you're not doing any of the cooking, the grocery shopping, you're not doing any of the prep, you like stick in the oven and done.\r\n\r\n\r\nNikolas Hulewsky (47:23.246)\r\nHmm. Is he good?\r\n\r\n\r\nJackie Hirsch (47:26.323)\r\nIt's incredible. Yeah.\r\n\r\n\r\nNikolas Hulewsky (47:27.886)\r\nOkay, so they're not coming to your house and like food prepping, freezing it in your freezer. These are pre-made being delivered to your house.\r\n\r\n\r\nJackie Hirsch (47:31.133)\r\nNope.\r\n\r\n\r\nThey're made locally at their commissary and then they're delivered. And I know like this, the chef that we are working with like works with some pretty like important people in the Orlando area. Yeah, so pretty awesome. And I sold this company to this other chef 18 years ago and I called him, I was like, hey, we need some chef services. Like we're just struggling here. And I'll go offline with that whole story, but it starts with the dog. Yeah, yeah. And he's like, you need to call.\r\n\r\n\r\nNikolas Hulewsky (47:43.34)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (47:57.153)\r\nHe hooked you up.\r\n\r\n\r\nJackie Hirsch (48:00.615)\r\nyou need call Chef Connor. So shout out Chef Connor. He's making our lives like 100, 100 % easier. Yeah. I'll text you one of his menus. Yeah. He does private chef services. He does a menu every week. He texts his menu out to his clientele and I want two of these, one of these, know, three of these and shows up on your doorstep Monday.\r\n\r\n\r\nNikolas Hulewsky (48:03.662)\r\nJeff Connor.\r\n\r\n\r\nThat's his business.\r\n\r\n\r\nNikolas Hulewsky (48:11.384)\r\nAll you gotta tell me about is business.\r\n\r\n\r\nNikolas Hulewsky (48:24.27)\r\nHave you ever heard of my chef? What's his name? Boyardee? Yeah, Chef Boyardee. No, nobody? Okay. So, okay. Does he have a good business?\r\n\r\n\r\nJackie Hirsch (48:31.293)\r\nIt's working, yeah.\r\n\r\n\r\nJackie Hirsch (48:36.647)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (48:37.966)\r\nDo you like, are you able to disclose how big it is or no?\r\n\r\n\r\nJackie Hirsch (48:41.789)\r\nI don't know. Maybe we have him on. Maybe we have him come on. Okay.\r\n\r\n\r\nNikolas Hulewsky (48:43.202)\r\nBut okay, I would love to talk to him. Because does he have just like a central kitchen that he's preparing these meals from freezes them in the chips?\r\n\r\n\r\nJackie Hirsch (48:49.459)\r\nYeah, yeah. He used to be a chef at a restaurant. And then I think he wanted something more normal, right? Because it's a lot of evening hours and this is like daytime, right? He might work a few days on this and then he gets it all ready and it's all ready to go on Monday. And then you have your meals for the week.\r\n\r\n\r\nNikolas Hulewsky (49:05.58)\r\nWell, I mean, I've, I've, I've heard of these businesses, not only ghost kitchens. So ghost kitchens are a thing, but also some of these large, more famous, I guess eateries, restaurants, eateries. Who am I? These more famous restaurants in other places. I know they'll open ghost kitchens in like smaller markets and then they'll, they'll deliver. Cause like door dash is just so freaking popular at this point. So I just think those businesses are fascinating. I don't have to deal with any of the overhead of like serving.\r\n\r\n\r\nJackie Hirsch (49:09.649)\r\nYeah.\r\n\r\n\r\nJackie Hirsch (49:15.665)\r\nRight? I don't know. That was very Midwestern of you. Yeah. Yeah.\r\n\r\n\r\nJackie Hirsch (49:29.458)\r\nYeah.\r\n\r\n\r\nIt is.\r\n\r\n\r\nNikolas Hulewsky (49:34.594)\r\nbusing, seating, the logistics involved with whatever rowdy customers, I just make the food and ship it to people and cut down significantly on the overhead. think that would be a really cool business.\r\n\r\n\r\nJackie Hirsch (49:36.721)\r\nYeah.\r\n\r\n\r\nJackie Hirsch (49:45.479)\r\nSo again, like I think food and food prep is gonna continue to be on the rise. I think as people get busier and busier, I think, know, pet services, you know, people got all these pets in the pandemic and then they went back to work and they're like, what do we do with this like, you know, this animal that we used to spend time with? And so like the pet daycare thing is still going, but it's expensive.\r\n\r\n\r\nNikolas Hulewsky (49:50.594)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (49:57.102)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (50:03.694)\r\nSo you like the pet crematorium I'm invested in?\r\n\r\n\r\nJackie Hirsch (50:08.615)\r\nThat is a really very good business. Can I say that? It's a very good business.\r\n\r\n\r\nNikolas Hulewsky (50:11.67)\r\nIt is a good business. No, no, no. It's not only a good business. I actually think it's a good service for people.\r\n\r\n\r\nJackie Hirsch (50:19.963)\r\nIt is, it's a great service. Do you deal with the specialty earns? Do they have specialty earns? I know of a company that provides that if you want, because that could be an addition that they could provide to the customers a specialty earn that these people do. Let's make some money. Let's make some money. Okay.\r\n\r\n\r\nNikolas Hulewsky (50:25.994)\r\nI do not know the answer to that question, but.\r\n\r\n\r\nNikolas Hulewsky (50:33.718)\r\nReally? okay. Let's make some money. No, like you said, people adopted a bunch of pets during COVID. then at the puppy boom is real. Pretty soon there's going to be a lot of pets who are passing on. And then you've got these families who are like, what the frick do I do with my dog? Do I like bury him? I don't want to bury him in my backyard. I throw him away? don't throw him away. Like, who do I call? Ghostbusters? No, like that's a pet crematorium. So I like those businesses.\r\n\r\n\r\nJackie Hirsch (50:40.593)\r\nYeah, yeah.\r\n\r\n\r\nYeah.\r\n\r\n\r\nJackie Hirsch (50:49.777)\r\nRight. Right.\r\n\r\n\r\nRight. Yeah.\r\n\r\n\r\nI know one of my parents friends like taxidermied their pet. I always thought it was strange. So like their pet was like at their house like taxidermied. I don't know. It just was never the same for me. But you could do that. Maybe it's very Florida. Is it very Florida taxidermy?\r\n\r\n\r\nNikolas Hulewsky (51:06.888)\r\nhard pass. no, no, no, no, couldn't do that. That would be so freaky.\r\n\r\n\r\nNikolas Hulewsky (51:14.914)\r\nI don't know if it's Florida. It could be anywhere. That'd be so weird. You just like get up in the middle of the night to grab a drink of water and you're like, whoa, buster, buster, ow, buster.\r\n\r\n\r\nJackie Hirsch (51:22.673)\r\nYeah, it's just like, yeah, I mean, like, it looked real. It was crazy.\r\n\r\n\r\nNikolas Hulewsky (51:28.294)\r\nyeah, don't do that. Don't do that. What businesses are you seeing that are like, yeah, these are harder to, getting harder and harder to move?\r\n\r\n\r\nJackie Hirsch (51:36.325)\r\nI think a small restaurant is always harder to move. When we sell restaurants, we typically sell something that's minimum half million EBIT. So I think the smaller, very small restaurants, the micro restaurants are hard to sell. There has to be some money. And when we sell restaurants, we often sell it with property. So it's a pretty robust business or a chain at this point when we sell something. But I still think...\r\n\r\n\r\nNikolas Hulewsky (52:01.719)\r\nInteresting.\r\n\r\n\r\nJackie Hirsch (52:03.335)\r\nthat so I think that market's difficult and you can't get funding often for like a smaller restaurant. But a restaurant that's doing a half million EBIT like there's plenty of plenty of banks that will take that deal especially if it's very consistent and the buyer has background. I don't think I'd sell a restaurant to a buyer that didn't have any restaurant background.\r\n\r\n\r\nNikolas Hulewsky (52:20.798)\r\nNo, you're an idiot if you're buying a restaurant with no, well, I shouldn't say that. I shouldn't say that. My personal opinion is I would never do a restaurant, but if you're gonna do a restaurant, you either need to go and get some experience in the restaurant space or you already have the experience and you need to be passionate about it. I think you have to have experience and be passionate about it. Otherwise, man, that is a hard business. You're working nights, you're working weekends, you're working holidays, high turnover staff, fairly low margins.\r\n\r\n\r\nJackie Hirsch (52:38.717)\r\nYeah.\r\n\r\n\r\nJackie Hirsch (52:44.583)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (52:48.59)\r\nIt's pretty commoditized because it's food. It's just, man, not with us. I want to end with some fun. no, no, go.\r\n\r\n\r\nJackie Hirsch (52:51.047)\r\nRight. The other thing is like, yeah, okay. Well, no, like different like specialty ag products, like we buy microgreens from somebody locally that has like, grow, they made this whole shed and their kids are involved and they, yeah. And so they sell microgreens and also sell like their eggs. have like some chickens in their backyard and they sell the microgreens. And you know, we pay a pretty penny for those. And I think specialty products like that will continue to sell and grow. So that's another direction.\r\n\r\n\r\nNikolas Hulewsky (53:04.724)\r\nthat's really cool.\r\n\r\n\r\nNikolas Hulewsky (53:11.853)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (53:19.052)\r\nAnd those businesses don't have to be $10 million businesses. It's like, I make a couple hundred thousand dollars a year net. I love what I'm doing. I have control of my time. I'm yeah. Like those are freaking great businesses. All right. I want to end on some fun ones. What are what are some not not red flags, but yellow flags where you instantly know someone is trying to get on your list as a first time buyer.\r\n\r\n\r\nJackie Hirsch (53:21.981)\r\nNo.\r\n\r\n\r\nCorrect. From your backyard.\r\n\r\n\r\nJackie Hirsch (53:34.161)\r\nOkay, let's do it.\r\n\r\n\r\nJackie Hirsch (53:46.771)\r\nI mean, there's so many, right? And I love how you called it last time, the low integrity yellow flags, like a low integrity flag. Sometimes these buyers will use all of this nomenclature that is directly from, and I love Walker Dybul, but it's directly from Walker Dybul's book or, you know, the HBR guide, you know, it's directly from there. And they are sure that that is the only way to do it because they've read that book.\r\n\r\n\r\nNikolas Hulewsky (53:54.37)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (54:13.944)\r\nGive me an example. Give me an example.\r\n\r\n\r\nJackie Hirsch (54:16.177)\r\nWell, I just did post on this about meeting all of the staff before closing. And some sellers just cannot get on board with that. So I have a deal that they do about 10 million and they just do not want the buyer to meet the staff. Now they've been to the facility ahead of time. They've taken a tour. They've met the people just like they've seen them, right? They know they exist. It's a big facility. There's 75 staff. There's a fleet of vehicles. So like somebody can't just pick this up and move this. Like you can't do it. It's too big.\r\n\r\n\r\nNikolas Hulewsky (54:20.878)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (54:45.358)\r\nIt's so funny too, if you're listening to this right now and you wanna buy a business and you're like, well, what's the big deal? Why can't I meet the staff? You don't understand because you've never been in it before, but deals fall through all the time. The seller may or may not have told the staff that they're selling at this point. And it's not because they're trying to hide anything from them for bad reasons. It's because if it falls through,\r\n\r\n\r\nJackie Hirsch (55:02.567)\r\nRight, right.\r\n\r\n\r\nNikolas Hulewsky (55:10.506)\r\nNow you've got people who are like, well, do I have a job? Who's the new buyer? I don't know the new buyer. Are they going to like me? Are they going to pay me? Are they going to pay me that raise that he promised me? Well, I take every Friday off and I've already negotiated that with my boss. So is he going to honor that? Like all of a sudden the billion questions come out. And if you open Pandora's box, you can't shut it. You can't shut it again. So I would never let somebody come on premise to quote unquote, meet the employees. I would absolutely hire someone and tell my employees like, look,\r\n\r\n\r\nJackie Hirsch (55:13.587)\r\nCorrect. Correct.\r\n\r\n\r\nYes, exactly.\r\n\r\n\r\nJackie Hirsch (55:24.742)\r\nYep.\r\n\r\n\r\nJackie Hirsch (55:31.047)\r\nYeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (55:40.29)\r\nThis is my succession plan. He's taking over. She's taking over the business, blah, blah. But my God. Yeah, I'm thinking of buying this business. No, you're meeting the staff when the deal is closed.\r\n\r\n\r\nJackie Hirsch (55:42.195)\r\nMm-hmm.\r\n\r\n\r\nJackie Hirsch (55:51.313)\r\nYeah. So there's a lot of people. I had a lot of pushback. Like I would never buy that business. I'm like, then this business wouldn't be for you. That's the deal. Like then, you know, then you wouldn't buy this business and that's okay. It's not for you.\r\n\r\n\r\nNikolas Hulewsky (56:00.492)\r\nRight?\r\n\r\n\r\nNikolas Hulewsky (56:04.674)\r\nYeah, some of the other things that I really love when I'm talking to like first time buyers is it's not a bad thing, but there is a fake it till you make it culture. And I just, want to tell all first time buyers like embrace it, just be open. Be like, yeah, this is my first deal, but here's my experience. Cause you're going to tell on yourself. You're not going to know that you tell on yourself, but you're to tell on yourself really, really quickly when you're like, so what's the EBITDA on this business? Now know some people say EBITDA, but nobody says EBITDA. All right.\r\n\r\n\r\nJackie Hirsch (56:18.055)\r\nYeah.\r\n\r\n\r\nJackie Hirsch (56:31.846)\r\nYou\r\n\r\n\r\nNikolas Hulewsky (56:34.054)\r\nOr if you're like, that's really interesting. What's the customer concentration like? are the clients sticky? You're like, okay. What would you say the moat is like in this business? You're you're using words you just don't, you don't know, right? Or.\r\n\r\n\r\nJackie Hirsch (56:45.331)\r\nAll right, you know, I had an interesting call yesterday. One of Helen Guo's buyers called me. So Helen Guo, I guess, teaches people to buy businesses also. And this lender knows I know them. And the lender told them, he's like, I think you're just getting something really funny. I want you to call a friend of mine. So the lender texts me. He's like, hey, will you talk to these people? I was like, sure. I don't know what it's about. And they call and they tell me that the broker who's from California\r\n\r\n\r\nis saying they only have 10 days due diligence and they have to put down 10 % deposit, so $275,000. And after the 10 days, it's non-refundable and they have to pay broker fees. And I'm like, something is up. Like, this is strange. Like, I was like, this is crazy. And they're like, well, we still really like the business. And they keep saying, well, you can come back with something. I was like, okay, then I mean, come back with, you know, an LOI, but.\r\n\r\n\r\nNikolas Hulewsky (57:30.798)\r\nYeah.\r\n\r\n\r\nJackie Hirsch (57:42.355)\r\njust know that this is unreasonable and egregious. Like, just know that. And I wish you a lot of luck. Like, I'm hoping that they look for something else.\r\n\r\n\r\nNikolas Hulewsky (57:50.446)\r\nWait, that was the seller's demands or that was the buyer's demands?\r\n\r\n\r\nJackie Hirsch (57:53.427)\r\nthe seller's demands, demanding like 10 day due diligence and a 275,000 deposit upon LOI. Actually, they didn't want an LOI, they just wanted a contract, which I get it, some people do want that. But I think a non-refundable 275,000 is, it's sketchy. It's sus, right? It's sus.\r\n\r\n\r\nNikolas Hulewsky (57:57.515)\r\nmy gosh.\r\n\r\n\r\nNikolas Hulewsky (58:05.55)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (58:12.494)\r\nYeah, that's that's what I'm saying. You tell on yourself. Yeah, you tell on yourself when you're like, it's it's there's no Riz in that Ohio. I don't know.\r\n\r\n\r\nJackie Hirsch (58:21.715)\r\nI mean, you know I always put the fries in the bag. So I mean, it's stuff like that. Like, just... Well, Kelly said I should come back on. Shout out to Kelly.\r\n\r\n\r\nNikolas Hulewsky (58:31.982)\r\nYes, yes she did. I know you, you win, you win everything. All right, Jackie, where's the best place for people to come find you?\r\n\r\n\r\nJackie Hirsch (58:39.101)\r\nYou know, LinkedIn's good. You know, it's like an office party and you want to go home, but sometimes I talk to people there. But yeah, so LinkedIn's good. And you know, I'm on X, so SMB Jackie Hirsch. So that's also probably even easier. Let's do it. Yeah, yeah, yeah. It's gonna be good. It's gonna be good. Okay.\r\n\r\n\r\nNikolas Hulewsky (58:51.106)\r\ncan't wait to talk to you next quarter when we get your Q3 update of like hot and heavy, it is busy. It's gonna be good stuff. All right, I'm gonna hit.",
  "metadata": {
    "duration": "",
    "date": "2025-08-29",
    "platform_source": "Google Drive"
  }
}