{
  "episode_number": "233",
  "episode_title": "Political Pressure on Entrepreneurs: Should You Take A Stand?",
  "guest_name": "Trenton Hughes & Chris Munn",
  "business_name": "",
  "transcript": "﻿Nikolas Hulewsky (00:00.782)\r\nLet me just mic check here real quick.\r\n\r\n\r\nNikolas Hulewsky (00:09.582)\r\nall right. I I said it, I said it kind of as we got started on the pre-call. So weird yesterday was a weird day for me to see, Charlie Kirk got assassinated. And, all I can think about was the fact that this 31 year old young man, whether you agree with him or don't agree with him, was murdered in front of his wife and his two kids. One of them being a year old and the other one being three years old and the fact that they're going to grow up without.\r\n\r\n\r\na dad and like, I felt very similar to the way that I felt when some of these other mass shootings have happened, like the Uvalde shooting at the elementary school. There's just like a visceral reaction to the fact that somebody has gotten so animated and so angry that they choose to go to violence as opposed to debating ideas, which is kind of what our country was founded on.\r\n\r\n\r\nAnd it's been heavy. It's been a heavy day for me. And I've also been thinking about kind of what this means for the next day, week, month, year, because I go onto Twitter or I onto social media or Blue Sky or threads. And it's all anybody is talking about. Some people are like, congratulations, you just radicalized me. I'm now a radical right. Some people on the left are\r\n\r\n\r\ncelebrating the fact that this guy was murdered. And then there's people in the middle who were just like, what does this mean? Like what is going on? Why is, does there seem to be so much more political violence? We had an assassination and kidnapping plot against Gretchen Whitmer in Michigan. That's her name, right Chris? it Megan Whitmer? Gretchen. We had the president survive an assassination attempt. We had those...\r\n\r\n\r\nChris Munn (01:57.935)\r\nYeah, great.\r\n\r\n\r\nNikolas Hulewsky (02:06.446)\r\nstate legislators in Wisconsin that I think it was Wisconsin that were murdered. Now Charlie Kirk gets murdered. It's like, what, what is going on? There's, you know, it's a lot of people just trying to understand what is going on. And I don't know, I'm kind of in the, in the same spot as well. I'm just trying to understand what does this mean for us? Um, not as, not just as a country, but just as, as parents and family members and friends moving forward. Um,\r\n\r\n\r\nIt feels like there's a visceral reaction to this. And I've seen a lot of entrepreneurs in particular, like taking a stand and this is not new that taking a stand is not new. But it's almost like we're seeing it draw out more and more like employees want to see their owners or entrepreneurs. Issue a message or take a stand or we know that Gen Z and millennials want to see that more than older generations. But then you see the backlash where somebody does.\r\n\r\n\r\nquote unquote, take a stand and Bud Light is boycotted because they hired this Dylan Mulvaney or the MyPillow company aligns really closely with Trump. I'm sure their employees loved it, but then they see sales just freaking tank. And I think a lot of entrepreneurs are probably sitting there like, not just scared about the future for themselves and their family and their kids and their communities, but also like, how do I, how do I navigate these waters? Like, what is the best step for us to take? So.\r\n\r\n\r\nTrenton (03:33.4)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (03:33.516)\r\nI don't know if that's even a good question or way to articulate it, but I'm just kind of stewing over this thought right now of as an entrepreneur, how do you navigate these waters moving forward?\r\n\r\n\r\nTrenton (03:42.638)\r\nYeah. Yeah. That's what I saying. It hit me as well. I actually didn't really know who he was, but seeing him as a dad and a husband and someone that was just trying to have conversation, controversial or not, really hit me and hit a lot of people. I think that one of the things that was striking is social media was hard to be on yesterday because of that. And that kind of evolved quickly from shock to uncertainty to anger and outrage.\r\n\r\n\r\nNikolas Hulewsky (04:11.169)\r\nAnger.\r\n\r\n\r\nTrenton (04:12.566)\r\nYeah, and a lot of business owners that I know in all kinds of different businesses, almost every single person seemed to come out and say something. But what surprised me was to see how harsh some of the stances were or how intense some of their stances were. You've just turned me into a radicalized right or like you said, somewhere celebrating. I think I'm curious about what's going to happen from here too.\r\n\r\n\r\nBack in like 2020, we had Black Lives Matter and we had some pretty heavy political movements happen back then. In the teens, we had it as well. we started to see businesses take stands and business owners, that's more importantly, business owners take stands on the different sides. And it really polarized and either drew people in or pushed people out.\r\n\r\n\r\nI don't know if every business owner thought through or cared about the ramifications. And oftentimes these business owners would go with what was popular, the thing that was going to be the most popular and give them the least amount of friction. And I can go into some stories myself of some things that we dealt with as business and as a business owner for employees and customers when they wanted to see us take stands on certain things.\r\n\r\n\r\nBut I'm very curious to what's going to happen because there's some people now that are swearing that they're going to go out and, you know, be one way or the other and be very political going forward and maybe even more than that.\r\n\r\n\r\nNikolas Hulewsky (05:51.438)\r\nEspecially with companies that are founder-led brands, where the founder is out.\r\n\r\n\r\nTrenton (05:56.95)\r\nwhich almost every, and almost every company needs to be that or is that like there's a CEO or a founder or someone at the top that really is that the face of that company. And almost all of these people have opinions whether or not they express those opinions is a different thing but it feels like we're about to see that expressed from here.\r\n\r\n\r\nNikolas Hulewsky (06:17.378)\r\nWell, it's hard to Chris and I have talked about this a lot, like on the one side of things, I do want to see someone who's a leader stand up and say, this is what I think, or this is what I believe, right? Because then I think, cool, then they'll attract the people that agree with them or like then they'll attract their tribe, et cetera. But then the flip is, I love talking to people of all different walks of life. And so I don't like the idea of siloing into, well, I just go to Twitter, which you know,\r\n\r\n\r\nfor my conservative takes and I go to blue sky for my liberal takes and I go to, you know, this business for conservative stuff and that business for liberal stuff. I think that stuff is bad for our country. And it just, it just feels like there's more and more of an expectation of people to take, you know, quote unquote a stand. But I mean, Chris, you're incredibly thoughtful about the stuff you read a ton. I don't know. How do you think about just messaging around this or how, like, how are you addressing it with your teams? You got.\r\n\r\n\r\nTrenton (06:56.75)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (07:15.916)\r\nmultiple companies.\r\n\r\n\r\nChris Munn (07:17.327)\r\nYeah, mean, it will sound trite, but I think it's just, I just go about business as business. And to me, like what happened yesterday really has nothing to do with that.\r\n\r\n\r\nIt's, you know, not to get too deep into it, but it's just who we are. There's never been a time in this country that we haven't been violent. People will say, you know, oh, this this will radicalize me. I don't believe it. It's like this country has been violent for 250 years. So and that has nothing to do with my businesses. So I have I have very strong opinions about things that happen, but.\r\n\r\n\r\nI don't really share. If my team asks, I'll share it with them. I don't make it a secret, but I don't leave with that. It's not my job. People on my team can vote for who they want to believe, who they want to watch, what YouTube videos they want. Just come to work and do a good job now. You know, so I think it'll just be business as usual.\r\n\r\n\r\nNikolas Hulewsky (08:11.33)\r\nYeah. Yeah.\r\n\r\n\r\nTrenton (08:18.729)\r\nWhat?\r\n\r\n\r\nNikolas Hulewsky (08:22.83)\r\nHave you set it up that way? Was that like, like, cause is that been just your company culture from day one?\r\n\r\n\r\nChris Munn (08:29.125)\r\nYeah, I mean, I think we get aligned around tasks and goals, right? And those tasks and goals usually have nothing to do with what's going on in the culture or climate. So, you know, if I don't like Taylor Swift and they do, I don't care, you know? That's not my business.\r\n\r\n\r\nTrenton (08:49.518)\r\nWhat do you do if you have an employee who's super political, posts a lot, talks with other people a lot about it? What do you do there?\r\n\r\n\r\nChris Munn (09:01.199)\r\nYeah, I mean, I wouldn't discourage it, to be honest, if people want to be political in the workplace. I don't discourage it. It's just not my thing. I feel like maybe I'm libertarian in that that regards. Like if you want to talk politics at work, doesn't make me a difference as long as you don't make people feel.\r\n\r\n\r\nostracized or discriminated against. It doesn't make me a difference. But I mean, I don't know, what are you guys doing in your business? Like Trin, you've been in some of these, like have you had employees that want you to take a stand or be thoughtful about that stuff?\r\n\r\n\r\nTrenton (09:42.542)\r\nYeah, not currently, but I've had two different businesses where I've had this type of thing come up. And one of them was George Floyd and the Black Lives Matter movement. We were like over thousand employee company and we had all hands meetings with over a thousand people on those meetings. And we have an open forum in that and they can submit questions. And so we had dozens of questions of what our stance was on everyone can see it.\r\n\r\n\r\nAnd I think what we did was just true to us. We weren't thinking about what is this going to mean for the business as we take a stand, but we just said we're supportive of Black Lives Matter and, you know, completely against any sort of police brutality or anything like this. And it was just the stance that made the most sense to us and was true to what we felt.\r\n\r\n\r\nNikolas Hulewsky (10:36.815)\r\nDid you feel pressured into making that statement at all?\r\n\r\n\r\nTrenton (10:39.36)\r\nI think, I mean, at a certain point, yes, when everyone is saying it was for sure on everyone's mind at that moment. It was a very big moment. And yeah, I don't know.\r\n\r\n\r\nNikolas Hulewsky (10:51.746)\r\nYou didn't feel pressure in the sense like you didn't believe the words you were saying. You just felt like, I have to say something because people are asking for it.\r\n\r\n\r\nTrenton (10:57.932)\r\nYeah, we came at it with conviction of what we believed. I will say that we didn't just do what was politically best, like, you know, and you can argue what we said was right or wrong. but, but yeah, we, you know, we did feel pressured to say something. And this is a point where almost every business I felt was saying something as well, but we were in a meeting where they're asking us to say something. I did have one more instance happen.\r\n\r\n\r\nNikolas Hulewsky (11:26.082)\r\nI just gonna say, I've known a bunch of business owners during that time who made statements that didn't agree with the statements they made. You know what mean? They were just like, it seems like we should make a statement about this. And then I'm like, dude, you've never been super animated about these types of issues. You've never talked about police brutality or systemic racism and your press release or your message to the team is this. To me, it felt disingenuous.\r\n\r\n\r\nTrenton (11:31.894)\r\nMmm, wow.\r\n\r\n\r\nTrenton (11:47.598)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (11:55.939)\r\nI think to your point, it's like, you need to be able to release a statement that is genuine to what you think and what you believe. It's probably worse to release something that you don't actually think or believe because over time people just see the inconsistency.\r\n\r\n\r\nTrenton (12:01.806)\r\nYeah.\r\n\r\n\r\nTrenton (12:08.876)\r\nAnd I will say like that was a very emotionally charged moment for a lot of people. It was for me. And there's different points where I have felt like, man, I would like to take bigger stances here. But I also understand like business is business. And this is these do live separately most times. And I don't know that like that most people think through the consequences of what they do when they take stances, especially when they're emotionally charged. I did have one more. Yeah.\r\n\r\n\r\nNikolas Hulewsky (12:34.99)\r\nIt's just hard not to say anything. Yeah.\r\n\r\n\r\nTrenton (12:37.23)\r\nAnd I think that's what a lot of people are feeling right now. They're saying like, need to say something. And I guarantee over the next weeks and months, we're about to see a lot more people take pretty harsh stances one way or another.\r\n\r\n\r\nChris Munn (12:38.319)\r\nWell, yeah, think that's...\r\n\r\n\r\nChris Munn (12:51.227)\r\nYeah, I also think that it's the leader's job to acknowledge that people are being emotional, right? Like it's an emotional time. whether, you know, Trump gets shot or like if we, God forbid, a president died or something, really wouldn't matter what side of the aisle you are on. It's like, this is an emotional time for people. And I think you can make the space to acknowledge that. I think that's something that a leader should do.\r\n\r\n\r\nI don't believe that because I, and maybe this is the idolization of business leaders in America, like why are we even asking what the business leader thinks? But it's not my job to be the spokesperson for our political stance on our business. Like the business doesn't have a political stance. I have a political stance, but my political stance has nothing to do with the business. But I will acknowledge that if people come to work,\r\n\r\n\r\nand are feeling like, man, it's just a tough day, like because of X, Y, and Z what happened. Even if that doesn't affect me, I think we should make the space to acknowledge that and acknowledge that people are going through something and maybe feeling some kind of way and maybe just want to talk about it, right? And it's like, that's what you do. We used to do around the water cooler, but to me that is the leader's job. It's not my job to be the voice of my opinion.\r\n\r\n\r\nNikolas Hulewsky (14:04.974)\r\nYeah, I feel that way. I just look at the data and it's like Gen Z and millennials are two to three times more likely to want to hear their leaders say something about what's going on, right? Or take a stand, quote unquote. For us, it was a little bit different than your experience, Trenton. We didn't have 1,000 employees, but we had between 100 and 200 when all of this stuff was happening in 2020.\r\n\r\n\r\nIt felt like every six months there was something else during 2020 that we had to talk about, whether it was COVID or the mask mandate or the vaccine mandate, because I was in healthcare, or, you know, George Floyd, Black Lives Matter. And the way I approached it was like, I was never talking to people about bodily autonomy or systemic racism or, you know, DEI or any or any of these things.\r\n\r\n\r\nBut we had to look at it. What do we talk to people about? It's our core values and our core values were among them, empathy, right? And so we talked about it from that lens where it's like, look, there's a lot going on. We empathize, you know, please be kind, respect each other, et cetera. In the instance with the vaccine mandate and we were a healthcare company, was like, Medicare is mandating this for us. I'm sorry. And if you can't accept that, we will help you exit the organization.\r\n\r\n\r\nBut like, what were we going to do at that point? Screw you, Medicare. And then we just like lose all of our patients and all of our funding. it wasn't, we just, we weren't in a place to take any type of stand against that. So anyway, I, I just think they're, just hard situations to navigate. Cause as a human, want to react, but as a business owner, you're like, how does this affect things downstream?\r\n\r\n\r\nTrenton (15:52.418)\r\nYeah, you do need to be thoughtful. I think you gotta let the time settle for emotions. But I had one more too that this was our influencer and sports agency and we represented different influencers that had big, big amounts of influence, millions of followers. One of them was trans and they were upset because this is a time where they felt like trans rights and LGBTQ rights were being really\r\n\r\n\r\npushed to the limits and a couple years back and they were upset that some companies were choosing to take neutral stances on this. And then they got upset with us for not advocating for them because of those neutral stances. We had to decide ourselves, do we want to stay neutral or not? A lot of our employees were LGBTQ in the entertainment industry, that tends to be the case. And then a lot of our influencers were as well.\r\n\r\n\r\nThis is another one where we stayed kind of true to ourselves and back to you on the value, which was...\r\n\r\n\r\nOf course we are pro LGBTQ. We have tons of these people on our staff that are clients. But at the same time, we don't think that every business needs to be political. One of our core values was kill them with kindness. And we just thought that if we treat everyone kindly and are accepting of different perspectives and...\r\n\r\n\r\nthat being neutral, like a business is being neutral, should be okay. Like businesses shouldn't have to ship pick one side or the other. And so we kind of took that stance as well. Like of course we're supportive of LGBTQ, but we're also supportive of businesses not being political. And we ourselves are not necessarily going to be super political as well, cause we're a business. We're not a political organization. And what happened is we lost that influencer, the influencer talked about it. We lost some more influencers, not a lot.\r\n\r\n\r\nTrenton (17:56.942)\r\nBut I think most people understood where we're coming from. We definitely had some employees on our side that were LGBTQ that wanted to see what we were going to say as well. I think that they liked the way that we handled it, but it was a tricky one because you're right. I think your employees and even your customers sometimes want to know where you stand on things. And I'm a big believer in alignment though.\r\n\r\n\r\nyou'll find the alignment with the people that align best with you. And if they need to see that you're political, then they're probably not gonna align. And if you are super political and they align with you, then great. You're gonna definitely have people that are not aligned. But I think that that's where businesses need to it best.\r\n\r\n\r\nNikolas Hulewsky (18:29.891)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (18:36.566)\r\nI just freaking, I just hate it. I really hate it. Where they're like, well, what do you think? Do you think Joe Biden is a lizard person or not? You know what I mean? Or like, do you think that trans women are women or not? And it's like, dude, I'm just, I'm trying to run a B2B SaaS company, man. You know?\r\n\r\n\r\nTrenton (18:43.564)\r\nYeah.\r\n\r\n\r\nTrenton (18:56.878)\r\nI'm trying to get you guys paid. I'm trying to get everyone fed like\r\n\r\n\r\nChris Munn (18:57.974)\r\nThis is.\r\n\r\n\r\nNikolas Hulewsky (19:02.222)\r\nYeah, like, it does not everything has to be political, we don't have to agree on everything. Some of my closest and best friendships are with people that I don't agree with on a lot of things. Like, why are we like, why is that the top thing that we're identifying as? Anyways, it's hard. It's hard to navigate.\r\n\r\n\r\nTrenton (19:18.83)\r\nI, it, if I was giving any advice here though, having come from this and Chris, think nailed it like.\r\n\r\n\r\nEmotions are going to be high right now. And I think us as business leaders just need to be really thoughtful with how we approach this and approach politics in general, because it's going to have ramifications. And I don't know that that's the place of a business to get involved. And so I think it's best to really just come at it and think before we talk sometimes. And yesterday, a lot of business owners talked. And so we'll see what that means.\r\n\r\n\r\nNikolas Hulewsky (19:59.096)\r\nI don't think it's bad. I really don't think it's bad. If you're coming out and taking a stand and you're a business owner and you want to stand for something like more power to you, I just don't think that you should feel pressured into saying or doing something that you probably may or may not feel a certain way on because over the long run people are going to see an incongruence.\r\n\r\n\r\nTrenton (20:15.479)\r\nYou\r\n\r\n\r\nthat I mean whether or you feel that way a lot of businesses and people are forced into it and and so what do do with that and then you not taking a stance is also taking a stance to their to them as well so yeah whether\r\n\r\n\r\nNikolas Hulewsky (20:29.826)\r\nYeah, that's true. That's true. But that's why we get paid so much money as entrepreneurs, though, you know, to make the hard decisions.\r\n\r\n\r\nChris Munn (20:31.237)\r\nYeah, not taking a stance is taking a stance. That's true.\r\n\r\n\r\nChris Munn (20:40.409)\r\nWell, I mean, it's, it's, it's, it's why the buck stops with the entrepreneur is why you are the leader. And I mean, I think it says something about society that maybe there's a moral vacuum and now we're seeking business owners or business leaders for moral compass advice, which seems absurd to me. not the, not the group that I would tag for morality.\r\n\r\n\r\nNikolas Hulewsky (20:54.2)\r\nMm-hmm.\r\n\r\n\r\nTrenton (21:01.646)\r\nBut why does it seem absurd actually? Because I think people are looking to leadership as like these people lead them in their life and maybe are the biggest influence in their leadership perspective for their life. Like why do you think it doesn't matter? Like do you care if you had a manager or leader that you reported up to and they were one way or another, would you care yourself?\r\n\r\n\r\nChris Munn (21:29.723)\r\nWell, one, let me say that I reject that I lead any of these people in their life. I just flat out reject that.\r\n\r\n\r\nTrenton (21:36.394)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (21:39.818)\r\nYou\r\n\r\n\r\nChris Munn (21:43.323)\r\nNo, no, I reject that. So like your church leader, your friends, your family, your spouse, your kids, that's who I hope leads you in your life. If I'm leading you in your life, we've already got problems. But to answer your second point, it depends. Like I said, it depends. So I had a, I'll tell the story. had a manager who I go first day, he tells me where he lived.\r\n\r\n\r\nNikolas Hulewsky (21:44.302)\r\nyou\r\n\r\n\r\nChris Munn (22:13.079)\r\nThis was in Georgia. And it's just like I had this weird memory of like something about that where he lived. And then it would come to find out it was like a town that didn't have its first black person until the 90s because they just didn't let black people live there. But whatever. I'm like, this is 2015. Whatever. Doesn't matter. But then he says, yeah, it was just a KKK rally outside my house the first day I moved in. And he didn't. Yeah, obviously, he didn't say he joined or anything, but.\r\n\r\n\r\nTrenton (22:36.877)\r\nyou\r\n\r\n\r\nChris Munn (22:41.005)\r\nin my mind, I was like, and you stayed? You know, like, that was just kind of weird to me. Like if there was a, you know, anti-Jewish parade every day outside my house, I'd be like, I can't live in this neighborhood, right? I was like, these people are fricking weird, it's off. But you know, I still work, I still work there. Like, and obviously I'm not Jewish, but I still work there and like, but I had an opinion of him, sure.\r\n\r\n\r\nLike, I had an opinion of him. Would he be my friend? Probably not, but I don't mind working for him. that doesn't, I don't feel like I'm losing any of my morality by doing that. Like I say, this is not my leader, just my manager.\r\n\r\n\r\nTrenton (23:20.398)\r\nYeah.\r\n\r\n\r\nTrenton (23:25.038)\r\nAnd maybe it goes back to what Nick was saying, like the values of the person will speak to this more than their political stances. You how do they treat you? How do they treat the others? I think that should be top of mind for business.\r\n\r\n\r\nChris Munn (23:34.287)\r\nYeah. Yes. Yes. I think that's super important.\r\n\r\n\r\nNikolas Hulewsky (23:39.318)\r\nYeah, I'm just kind of, I'm just kind of the opinion of like, all right, if you, if you're going to let one decision, I guess, define me, like whether or not I responded the way that you wanted me to respond exactly in that moment. And then you leave, like the, don't want to be around you. Like if you can't take the long arc of our relationship and see like, he is thoughtful or, you know, I, like XYZ things and then weigh that against maybe, you know,\r\n\r\n\r\nTrenton (23:55.063)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (24:09.166)\r\nhow I do or don't take a stand, then you're not the type of person that I want in my company. You're not the type of person I want to work with long-term. And it took me a while to get to that place. I'm not saying I felt that way forever, but it took me while to get to like, yeah, I'm okay with certain people leaving. So I guess I'm just kind of entrepreneurs who might be feeling a certain way or not. Like you don't have to do anything that doesn't feel right to you.\r\n\r\n\r\nChris Munn (24:36.293)\r\nYeah.\r\n\r\n\r\nTrenton (24:36.334)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (24:38.926)\r\nYeah, it's true. All right. Yeah, I'm super curious to see how this plays out over the over the coming weeks and months, especially with people going to their favorite social media platforms to continue to reverberate. But\r\n\r\n\r\nChris Munn (24:39.183)\r\nor you don't have to do anything at all.\r\n\r\n\r\nChris Munn (24:58.479)\r\nThey stay off the internet. That's the moral of the story.\r\n\r\n\r\nNikolas Hulewsky (25:00.312)\r\nStay off, that's Chris's philosophy. Okay, we had some other things that happened this week. Chris, it looks like we've had a rate cut and I want you to kind of just go through what's going on right now and what does this mean for small businesses? Like does the Fed even matter for small business?\r\n\r\n\r\nTrenton (25:03.022)\r\nYou\r\n\r\n\r\nChris Munn (25:24.771)\r\nYes, it matters a lot for small business. a little background. 2020, we could start with like 2020 during COVID. Rates were effectively zero, which means banks can borrow money at essentially no interest and then loan it to you at a small percentage higher than that.\r\n\r\n\r\nAnd low interest rates mean lower debt payments and debt payments go to worse things like mortgages and business loans and car loans and all sorts of stuff. So with higher, and then after COVID, we obviously had a lot of inflation and the Fed has tried to keep rates high to tame inflation, keep inflation in check.\r\n\r\n\r\nSo now I think inflation is 2.9%, which the goal is always 2%. So I think we'll see rates get cut more aggressively when it gets closer to two, but it hasn't been two in a long time. So we did have a rate cut in September, but we're still super high rates compared to the last five years or so. 10 years, 20 years, super high cuts compared to the last 20 years.\r\n\r\n\r\nAnd that affects businesses in a few ways. So I think people going out to buy or sell businesses are seeing different valuations because of the debt service. If someone goes out and bought a business in 2015 and their interest rate was 5 % and now the interest rate is 10%, you know, that can be tens of thousands of dollars a month in increased interest for that business.\r\n\r\n\r\nSo what does that mean? That just means effectively, I can pay you less money, Nick, for your business than I could 10 years ago, because I have to pay the bank a lot more. So Nick might be saying, hey, I want, you know, this multiple on my business. And now I can't pay that because I can't service the debt with the high interest rates. So there's a lot of political pressure to lower the interest rates because it will spur asset buying and selling again.\r\n\r\n\r\nChris Munn (27:35.791)\r\nBut if we still have inflation that is from an economic standpoint, that is usually not a positive thing. inflation needs to get in check and then hopefully rates can get cut.\r\n\r\n\r\nNikolas Hulewsky (27:46.648)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (27:50.19)\r\nSo I bought a business in 2020 when rates were effectively zero. And when you go through the process of buying a business, you have to go through underwriting. in order for the bank to give you money to buy that business, they've got to underwrite that business. And they use this almost universally, this one metric called DSCR, your debt service coverage ratio. What that means is if a business is doing $500,000 a year in profit, the bank wants to see at least, we'll call it\r\n\r\n\r\n1.2 times the amount of profit as they do debt. So in this scenario, let's just make it easy. The max debt that they would lend is $400,000 on a business doing $500,000 a year in profit. And then we know the interest rate, we know the term, we know the amortization period, et cetera. With that $400,000, it's like a max amount that they'll loan. And so in that instance, when rates are near zero, they'll lend you a lot more money.\r\n\r\n\r\nbecause the debt service coverage ratio is a lot better because you're paying less debt. Well, when the interest rate goes up, now all of a sudden, the amount that you can afford in debt to buy that business goes way down. so what does that mean? Well, in the early days, in 2020, the reason we saw asset prices go out of control is because we could get a lot of money from the banks because interest rates are really low. We've now seen asset prices contract because they raised rates significantly because people couldn't afford.\r\n\r\n\r\nTrenton (28:52.814)\r\n.\r\n\r\n\r\nNikolas Hulewsky (29:16.994)\r\nthat debt surface coverage ratio and it has shown up in the data. So the SBA releases this data in the last year. The amount of delinquencies on SBA loans has increased dramatically. I think it's like a 20 year high from where it's been just because these individuals who bought businesses kind of at the max of their scale all of sudden now because the interest rates are floating, interest rate goes up, payment goes up, they can't afford it. What happens? The bank forecloses on those businesses. So we've definitely seen some of that happening right now.\r\n\r\n\r\nfor small businesses in particular. The SBA is really important, which I just talked about, lines of credit, but then also generally speaking in the economy, being able to hire, being able to find more workers, there's definitely a lot going on. So I am curious to see though what happens with the Fed because our unemployment has been historically low. We're still at historic lows, which is interesting because I still feel like when I talk to small business owners, mean, Trenton, we talked about this in Tribe, it's not like they're...\r\n\r\n\r\nout there saying like, man, the hiring pool is fantastic. it's so great. Like they're still complaining about finding good employees. And you would think that would be the opposite if like unemployment was so low. You would think that everybody's like in the spot that they should be doing a really good job, but that's kind of been the opposite experience.\r\n\r\n\r\nChris Munn (30:34.646)\r\nYeah. Yeah. Well, well, asset and this is the funny thing about the way the economy works. Asset prices have just been ripping, right? Like they assets are going up like crazy. So the stock market's all time high. I think the easiest way to think about this is housing. Like you've you've everybody probably knows somebody who's like, dude, I bought my house for 450 K and now it's worth 900 K.\r\n\r\n\r\nAnd like, they think that's awesome, not awesome. Like not awesome. That's not awesome. So, and the reason that's not awesome is because when asset prices go up that much, the only winners are the asset holders. Everyone not holding an asset, everything is insanely more expensive for them. And so,\r\n\r\n\r\nbecause things are so expensive for everyone else. I think that's partly why we see low unemployment. It's like, dude, I have to take a job. Everything is so expensive. Asset prices include groceries. They include cars. They include everything. So I think the economy is very interesting right now because it seems like for the asset owners, which unfortunately is a very small percentage of Americans, they're like, man, everything's up and to the right. And for people on the other side of that coin,\r\n\r\n\r\nThey're like, dude, I can't afford anything anymore. And so I think you just really see a dichotomy in, it's like a teletub economies really. It's just some people are sitting here like, man, my house tripled in value and other people are just like, I'm never going to be able to afford a house ever again. Yep, yep. It's gone up.\r\n\r\n\r\nNikolas Hulewsky (32:15.918)\r\nWell, real wages have stayed flat over the last five years, but everything else, food, groceries, fuel, whatever, has gone up like 20%. So you've got the same amount of money effectively, but everything's up. Yeah, there's no buying power. it is just really weird, because at the same time, you have 84 % of entrepreneurs who say they're optimistic about the future. 84%, that's a high optimism rate. And sure.\r\n\r\n\r\nChris Munn (32:27.621)\r\nbut no power.\r\n\r\n\r\nChris Munn (32:42.245)\r\nBut they are in the asset owner class.\r\n\r\n\r\nNikolas Hulewsky (32:45.474)\r\nThey are in the asset owner class. But at the same time, they're also in the business of hiring people. You would think they'd have a better pulse on how people are feeling out in the actual field. I don't know, Trenton, what are you seeing within Tribe?\r\n\r\n\r\nTrenton (32:47.202)\r\nYeah.\r\n\r\n\r\nChris Munn (32:51.579)\r\ntruth.\r\n\r\n\r\nTrenton (32:56.937)\r\nWell, yeah, I mean, we talked to a lot of business owners and the jobs numbers that we're seeing come out and getting revised are being revised down really low amount of jobs being created. What I'm also seeing is that business owners are taking a pause for the most part on hiring right now as they try to figure out how to implement AI into their businesses more. So like, you know, that's the worry that we hear employees talking about and people talking about, oh, AI will take jobs.\r\n\r\n\r\nI don't know that a lot of business owners for sure know how to do it yet, but I do know that they're looking at how they do it. Like, I don't know very many people that are out there like, I'm on a hiring spree right now trying to go find a bunch of people, unless you're an AI company, they are, and they're throwing these crazy bonuses at people. Maybe that will stop here soon. But...\r\n\r\n\r\nNikolas Hulewsky (33:39.298)\r\nYeah. I mean, Mark Zuckerberg's throwing out NBA level contracts to people.\r\n\r\n\r\nTrenton (33:43.79)\r\nIt's insane. Insane. Which is entertainment itself. I actually wonder like this whole, I wonder how much business will become the new form of entertainment. Cause I think it could and I think it will. But yeah, on the hiring side, I think we're going to continue to see pretty stagnant numbers.\r\n\r\n\r\nChris Munn (33:46.596)\r\nmore billion dollars.\r\n\r\n\r\nNikolas Hulewsky (33:46.815)\r\nHe signed Do Kwon for five years and $3,850,000,000 breaking on ESPN. You're like, what the f- these contracts are nuts.\r\n\r\n\r\nChris Munn (33:50.395)\r\nCrazy. Crazy.\r\n\r\n\r\nTrenton (34:10.53)\r\nI don't know that we're gonna see the layoffs yet. I just don't know that we're going to see much hiring happening. And that's what I'm hearing across the board is like people are looking at how they can be a little more resourceful and scrappy. And I think there's a lot of reasons to it. I think that the rates go into that too. Like every business owners costs are way higher as well. And if employee costs are going up, because employees want to be paid higher, these business owners are taking a pause saying, okay, well hold on, let's look into what AI can do for me instead of going and hiring an employee that costs now double what it costs 10 years ago.\r\n\r\n\r\nI actually had an interview with someone not long ago, like a few months back, for a different company that fresh out of college, she lived in New York and she wanted 120K out of college. And I think that that's what a lot of the Gen Z are expecting and thinking. So I think that that's another part of this equation is that it is way more expensive. The employees aren't looking to settle for some, you know, average paying job.\r\n\r\n\r\nand then the business owners can't afford what the employees are hoping for. So you're in this weird middle ground right now where I think we're going to see a lot more AI adoption because employers are forced to. What will happen though, and then on the other end, you have these employees who are looking at their options. So they're either moving out of state, other places, or they're looking at becoming influencers or starting their own side hustles and becoming their own employers. think that.\r\n\r\n\r\nBusiness ownership is at an all-time high right now. And think it will continue to be. And business ownership might mean something different. It might just mean a solopreneur who figured out a way to make 100k or 200k. But they have way more options than they ever had before as well.\r\n\r\n\r\nNikolas Hulewsky (35:47.95)\r\nWell, the other side of that's really interesting as well, because at least in some of this data, 20 to 30 % of listed small businesses are actually completing sales. Sellers want 20 to 40 % more than current market offers. So like there's still this huge gap between what sellers want and what buyers are willing to pay. I just had Jackie Hersh on my podcast, who's a broker, and her opinion is like, it's always a buyer's market.\r\n\r\n\r\nor seller's market. There's always people who are buying and selling companies, but she lives in Florida. When you look at the rest of the country, however, stuff is sitting on the market longer. Sellers are not necessarily getting what they wanted. And I think even anecdotally, we've had some conversations with sellers who sharing some of the stories, right?\r\n\r\n\r\nTrenton (36:34.861)\r\nYeah, we've heard of people that were very interested in selling their business and got offers. One of the things I think people overlook is that a lot of times when you sell your business, they want you to stay on for an additional year, two years, three years, and the sellers aren't really hoping to do that. They want to walk away clean. But I think that the terms that the buyers are wanting versus the terms that the sellers are wanting are distancing themselves from each other. so, yeah, I'm seeing, I know of four different entrepreneurs that have walked away from deals.\r\n\r\n\r\nand no longer plan to sell anytime soon. But we're trying to. I think that all of them were probably around a million to $2 million in revenue a year, somewhere around there, hovering around that. Yeah.\r\n\r\n\r\nNikolas Hulewsky (37:08.92)\r\nHow big were those businesses?\r\n\r\n\r\nNikolas Hulewsky (37:18.86)\r\nI mean, there's this saying in economics, which is prices are sticky. And I mean, the same goes for asset values, right? It's like, well, five years ago, my one to $2 million business was worth $5 million. You're telling me it's worth two today? I don't think so. So like, really has been this just weird dynamic because of the way that asset prices went. Chris, when did you buy your company, commercial cleaning company in Florida?\r\n\r\n\r\nChris Munn (37:46.075)\r\nfirst in 2020 and then second in 2022. So.\r\n\r\n\r\nNikolas Hulewsky (37:51.8)\r\nHow have you seen asset prices change in that market?\r\n\r\n\r\nChris Munn (37:54.883)\r\nI mean, my debt service is probably five to $6,000 a month more than it was when I bought it. And so, yeah, it's just like, now if I sold it, like if I kept, let's assume the business is the exact same as it was five years ago.\r\n\r\n\r\nNikolas Hulewsky (38:08.214)\r\nDude!\r\n\r\n\r\nNikolas Hulewsky (38:20.93)\r\nYeah. Yeah.\r\n\r\n\r\nChris Munn (38:21.869)\r\nI'm going to get less money for it than when I paid that when I bought it, right? Because people can't afford to pay what I paid in 2020. And so when you when that happens, like there just becomes less activity. Right. And I think that's what the the the Fed rate really is dictating. It's like, hey, if there's less activity, asset prices will come down. Inflation will come down.\r\n\r\n\r\nNikolas Hulewsky (38:38.144)\r\nMm-hmm.\r\n\r\n\r\nChris Munn (38:51.508)\r\nbecause there's less activity and I think maybe during COVID we just had too much activity like there was too much buying and selling back and forth.\r\n\r\n\r\nNikolas Hulewsky (38:58.892)\r\nYeah, we are in a weird place though because they haven't they haven't lowered rates for the two years. I can't remember when the rate cycle cycle.\r\n\r\n\r\nChris Munn (39:07.067)\r\nWell, they just, they just lowered them in September, but that was the first time in like, yeah, two years. Yep.\r\n\r\n\r\nNikolas Hulewsky (39:11.49)\r\nYeah, I think it's been two years. When theoretically you would have seen a lot of the negative consequences of it playing out quickly, we had so much money left over from COVID. Like there was just so much liquidity in the system. I try not to be a doomsdayer, but I'm like, man, are we just gonna hit the wall in the next few months and just realize everything caught up to us that we've kind of been putting off? I don't know.\r\n\r\n\r\nChris Munn (39:38.767)\r\nI mean, if you were a recession predictor, like there are a lot of recession predictors on Twitter, surprisingly. You would have been wrong every month. So it has shocked me.\r\n\r\n\r\nTrenton (39:49.388)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (39:50.018)\r\nWell, Ray Dalio has predicted seven of the last two recessions. So he's doing really good.\r\n\r\n\r\nChris Munn (39:58.907)\r\nHe's batting what? Freaking 500%. It's amazing. But yeah, it's just, there's just a big gap. And like, like we talked about just in the housing industry, cause it's the easiest to explain. When, when your neighbor says their house went up double or triple, you just have to think about what does that mean for their...\r\n\r\n\r\nTrenton (40:01.774)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (40:03.778)\r\nI know.\r\n\r\n\r\nChris Munn (40:20.389)\r\nfor your kid, like are they gonna be able to afford that house? And when there's a big gap between what people can afford and then the asset owners, the asset owners don't wanna sell because they're like, no, my house is worth 800 grand. And the people that don't own assets don't wanna buy because they're like, I can't afford 800 grand. And you're saying the same thing in the small business market.\r\n\r\n\r\nNikolas Hulewsky (40:41.218)\r\nWell, like I was, I was telling a lot of people and most people who listen to this podcast when the big, beautiful bill passed, I'm like, it's fricking great for me. Fricking great. Like I'm an asset holder. It's, it's only going to be a creative for my assets. Right. now if the things that they say that are going to play out, play out, could be great for everybody, but really the ones who are like highest risk are our employees, like the people who work for us. So like, what does that mean for us a year, two years, three years from now as the rest of that?\r\n\r\n\r\nChris Munn (40:48.869)\r\nYep. Yep.\r\n\r\n\r\nChris Munn (41:04.441)\r\nYes. Yes.\r\n\r\n\r\nNikolas Hulewsky (41:10.52)\r\nkind of really hits them. And that's the thing I'm still trying to work through, just trying to figure out what does the end of the year look like? Because since COVID, it just feels like everything has been different than what anybody expected. I wish I was giving like a better, more hopeful outlook for entrepreneurs, but I'm just like, man, I just don't know.\r\n\r\n\r\nTrenton (41:30.574)\r\nWell, my prediction is that a lot more competition will pop up because I think a lot of these people that are employees are looking at, don't have an ability as an employee to go make the amount of money that I'm hoping to make. And the only way I could potentially do that is become a business owner. I think we've seen business ownership just spike and it's massive. And a lot of solopreneurs, as I said, I think that it's going to lead to opportunities though. One of them, as I kind of alluded to, I'm curious to get you guys' take on this.\r\n\r\n\r\none those opportunities being in media. think that movies and movie stars and TV for a long time really had its moment. Obviously social media is where a lot of attention is. And I think that the content around business and like shows around business and podcasts around business are going to continue to go up because there's a lot more interest now in business ownership than there ever was. Your business partner, Chris Kerner, has exploded because people are interested in starting businesses. And there's a lot of other people, Cody Sanchez,\r\n\r\n\r\nIf you go look at the top 100 podcasts on Spotify, there's a ton of them that are about business ownership, but I don't think that was ever the case before. so.\r\n\r\n\r\nNikolas Hulewsky (42:35.254)\r\nYeah, I mean, I'm biased with Chris because I just I know Chris so well. I think he's the best of the bunch, but he's like very zero to one. Don't you know, don't use a ton of money. Don't go into a ton of debt. Cody Sanchez is more like I'll show you how to buy your first business. And but but yeah, it's just a lot of hey, how to get into entrepreneurship type of content. That's that's true. And they're not slowing down. They're growing like crazy.\r\n\r\n\r\nTrenton (42:57.816)\r\nYeah.\r\n\r\n\r\nChris Munn (42:58.959)\r\nYeah, and I wonder, it's very interesting because obviously we can, as business owners, people think that we have like an unlimited amount of money, but we can only pay our employees out of our profits. And if we pay them out of our profits and that's not enough money for them to, you know, live whatever life they want to live, it could just be getting by or it could be buying a house or whatever. They will come for...\r\n\r\n\r\nthey will have to become business owners, right? Like I think they will see that as a viable path to getting what they need. And so maybe yeah, content is something you can do on your own. And we probably will see a lot more of that because I do think if you don't, I don't mean us as business owners, but in general and individually, but like if we don't take care of our employees and that means giving them enough of a wage to feel like they have a respectable life.\r\n\r\n\r\nthen they have to look at alternatives. And I think the solopreneur thing is one.\r\n\r\n\r\nNikolas Hulewsky (43:57.048)\r\nWell, what's really interesting is, and you guys might not know this, Charlie Kirk. So I've actually listened to quite a bit of Charlie Kirk stuff. One of my favorite pastimes, I don't do it as much anymore, but I used to listen to, this was my like news radio lineup 10 years ago, maybe 15 years ago. I had Ben Shapiro, Glenn Beck, and Mark Levin.\r\n\r\n\r\nIt's just like that was just like the time of day I was before I was podcasting. You guys know who they are?\r\n\r\n\r\nChris Munn (44:29.913)\r\nI don't know who the last guy is. I know who the first two are.\r\n\r\n\r\nTrenton (44:31.086)\r\nYeah, I don't.\r\n\r\n\r\nNikolas Hulewsky (44:31.598)\r\nMark Levin. Oh man. Yeah, Mark Levin is he's pretty far. He's pretty far to the right. And then and then so anyways, they're very conservative, very, very conservative. And I get my news there. And then I would go and listen to Ron Reagan, who is Ronald Reagan's son, Rachel Maddow. And eventually the pod save America guys, very left, just because I like to listen to both sides. I'm like, okay, where does where does the truth maybe kind of fall? I just I just like to hear arguments for both sides of people. Anyways.\r\n\r\n\r\nTrenton (44:57.582)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (45:02.584)\r\nSo I listened to a lot of stuff that Charlie Kirk would say, because I, frankly, I did think he was more thoughtful than many of the people on the right. And he has this interview with Tucker Carlson where he says the thing he was most concerned about moving forward is the ability for Americans, young Americans, working class Americans to achieve the American dream because the purchasing power of the dollar is diminishing. There is a gap between the ultra wealthy\r\n\r\n\r\nand people who are working on the frontline. And if we can't solve that gap, then those people who are not getting it, one of the options is to become entrepreneurs themselves, Chris, but then the other option is to vote for it themselves, like to vote people into power who will then redistribute the wealth that they want if they're not given the opportunities that they need. So he was like, I'm like singularly focused on figuring out how to create more opportunity for the rising generations. And that I think is\r\n\r\n\r\nis something that we have as entrepreneurs. We can't necessarily affect policy, but be thinking about like, how do we create opportunity for people within our companies so that we don't lose them to entrepreneurship or so that we don't necessarily lose them to other things. It's just an interesting thing that it's happening. It's reality.\r\n\r\n\r\nChris Munn (46:15.321)\r\nYeah, it's our, it's our, you know, people, it's where we do our best to make money. And in making that money, we create jobs for people. Right. And like, that's the beauty of America. Anybody could start something up and provide jobs. And now people have jobs and like, that's awesome. But to the, this ties back to the race thing. If too much of the\r\n\r\n\r\nthe money and the wealth ends up in the hands of the asset owner, and then there's a big gap between the asset owner and let's call it the liability holder, then you will see it become more difficult to get the valuations that you want simply because\r\n\r\n\r\nNikolas Hulewsky (47:04.835)\r\nYeah.\r\n\r\n\r\nChris Munn (47:06.727)\r\nThere's nobody to buy it, right? Like these people can't afford it anymore. And then it creates a market that gets stagnant, which there's nothing worse than that. And so that's the problem.\r\n\r\n\r\nNikolas Hulewsky (47:15.352)\r\nWell, and then you see people who I'm seeing a ton more of, who are like, screw it, I'm not gonna buy one of these boomer businesses, I'll just start one from scratch. Like it's cheaper for me to just start from scratch and then they're not able to sell that business and it's just gone, right? I'm seeing that a ton more, people getting into entrepreneurship, they're like, wait, I'll spend $5 million or I could invest like 50 grand and I could get a business maybe half the size. Yeah, I think I'll go invest 50 grand and just do it on my own.\r\n\r\n\r\nChris Munn (47:24.741)\r\nYep. Yep. Correct. They're right. They're right. They're right.\r\n\r\n\r\nNikolas Hulewsky (47:43.224)\r\nTo your point Trenton, like, people are becoming a lot more entrepreneurial. They're just starting up. They're figuring it out in those industries that they don't need to spend a ton of money to buy a business in. For me, it's even been a weird shift.\r\n\r\n\r\nTrenton (47:55.202)\r\nI will say there's a lot of different ways to think about this too though. You know, as a business owner, the top businesses are the ones that do hire the best and have the best teams and you're only going to hire the best and have the best teams if you can incentivize them. And so as a business owner, like what's back in your control, you have to think about that. Like you have to be able to hire great people, pay them well, if you want to actually win and you know, track them in ways that aren't maybe other people aren't doing. But\r\n\r\n\r\nsome of the levers that you might be able to pull to do that when it's an economy that's a little bit weird, pricing, something for you to think about, value adds, positioning, all these different things that you can control have downstream effects for you to be able to hire better people. And if you can't take care of people, yeah, they're gonna look at going elsewhere and you're not gonna thrive as a business. And I think that the companies that are doing the best are the ones that have the most resources right now, which are able to go higher and pay a hundred million dollar bonuses. And then everyone's like, I wanna work there.\r\n\r\n\r\nbecause they're paying so well and it only attracts top talent. Meanwhile, all the talent gets pulled away from these average or bad businesses too. So I think that as a business owner, you need to be thoughtful there as well about how do I make sure I continue to get the best talent I can possibly get and what do need to do upstream in order to make sure that happens.\r\n\r\n\r\nNikolas Hulewsky (49:06.786)\r\nThat's interesting. I am starting to see a shift in the way people are viewing AI in particular. They used to kind of view it as, AI is gonna come in, I'm gonna eliminate all the jobs and I'm gonna make a bunch more money. And now it's like, no, AI is gonna do certain things. I still need really good people. And now AI is like a multiplier as opposed to a people eliminator. it's almost like when you hired a 10X employee in the past, they were 10X.\r\n\r\n\r\nNow with AI, they're a hundred X employee. So it becomes even that much more important.\r\n\r\n\r\nTrenton (49:37.134)\r\nSo again, we see a lot of different businesses within Tribe. The best business owners I see are doing one thing and not necessarily the worst, but the ones that aren't thinking super smart are doing a different thing. So the ones that aren't necessarily thinking smart in my mind are the ones looking at how do go cost costs now? How do I go eliminate all costs here to boost my profit versus the ones that I think are gonna really win are looking at how do I basically do what Ford did and create this assembly line that makes us go 10 times faster? And so they're looking at how do I keep my current team\r\n\r\n\r\nbut also add in AI and maybe even boost my team with AI to just do 80 times more than we ever did before and out-compete our competition who's meanwhile just thinking about how do I cut my costs? There's two different trains of thought and I think that one's clearly going to win in the long run. Thoughts there? Yeah.\r\n\r\n\r\nNikolas Hulewsky (50:23.392)\r\nInteresting. What are you seeing, Chris?\r\n\r\n\r\nChris Munn (50:27.663)\r\nWell, yeah, we have a recruiting business and that's a main core principle that we try to explain. So we help people hire offshore, but the way we think about it is like you have your 10X employees, right? Nick, that you just talked about. Those sit at the top of the pyramid.\r\n\r\n\r\nNikolas Hulewsky (50:46.606)\r\nYep.\r\n\r\n\r\nChris Munn (50:48.953)\r\nAnd in the middle of the pyramid are your offshore employees. And then at the bottom of the pyramid is AI and your AI is like supposed to help enable all the other employees to really do a ton more. Like offshore and AI are not meant to eliminate. They're meant to multiply and expand your capacity. Exactly. AI is no different than what the printing press is to me. It's like the printing press comes along\r\n\r\n\r\nNikolas Hulewsky (51:00.974)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (51:10.126)\r\nAccelerate.\r\n\r\n\r\nChris Munn (51:18.887)\r\nI was like, yeah, could we do books before? Yes, we could do books, but now we can do a lot of books. And so to me, AI is just a tool. It's not to say, hey, like the printing press didn't eliminate, it did eliminate some kind of jobs, but it created so many more. Like there's a person working at a bookstore now because of the printing press. And like, I'm sure at the time the printing press was invented, they were like, I'm never gonna be able to write a book again, but.\r\n\r\n\r\nNikolas Hulewsky (51:19.319)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (51:23.662)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (51:46.21)\r\nYeah, yeah.\r\n\r\n\r\nChris Munn (51:46.531)\r\nIt creates a lot more jobs because a lot more people can do stuff.\r\n\r\n\r\nNikolas Hulewsky (51:50.176)\r\nSo for offshoring, I know that the like common things, SDRs, accounting, accounts payable, trying to think, anyways, those are like common positions. What are you guys seeing people using AI for? Like what are they implementing now to be the accelerant for those things?\r\n\r\n\r\nChris Munn (52:07.383)\r\nyeah. People are hiring one. People are hiring automation engineers to like come into your to your business and then do automation's AI engineers who are just like special. Yep.\r\n\r\n\r\nNikolas Hulewsky (52:18.626)\r\nWhen you say hiring, are they like W2 employees or are these consultants that are coming into the business? really?\r\n\r\n\r\nChris Munn (52:23.791)\r\nNo, they're hiring them into their business. Yes, they're hiring these kind of people into their business because I think that if you, you know, you get a little taste of what AI and automation can do for your business. You're just like, man, this could go to my HR department, to my marketing department. And then it's just worth having them on your team, especially one. Even if you're not that large of a team. And so we, hire those people now. Yeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (52:39.276)\r\nDo I write, right?\r\n\r\n\r\nNikolas Hulewsky (52:49.612)\r\nAre you placing those types of positions as a staffing company or not staffing, but you are.\r\n\r\n\r\nChris Munn (52:53.465)\r\nYeah. Yeah. Recruiter. Yeah. Yeah. Yeah. We're placed in those kinds of positions. People want those now. AIs. And I think the biggest thing is a lot of business owners, as we just talked earlier, we're busy. And so do I have the time to like go and really learn AI? Maybe I could, but there's other things I can do like post on Twitter. So I need a, I need, sometimes I need someone in my business that can do that for me.\r\n\r\n\r\nNikolas Hulewsky (53:16.493)\r\nWha-\r\n\r\n\r\nNikolas Hulewsky (53:22.516)\r\nWhat's the average size of a business that's able to afford hiring that position?\r\n\r\n\r\nChris Munn (53:27.179)\r\nI would say if you're doing a million in revenue, you could hire that position offshore. If you want to hire onshore, you probably need to be a $5 million business.\r\n\r\n\r\nNikolas Hulewsky (53:33.517)\r\nOffshore.\r\n\r\n\r\nNikolas Hulewsky (53:37.998)\r\nWell, we have, we have Ellie, um, can't remember her last name, but within tribe, she, like her company, she's a fractional CTO. And it's kind of, at least from what I understand, she does, it's like, that's kind of what she had been working on within her agency. And that company was growing. She's now pivoting actually into a SaaS product, which is really cool. Um, it's called Yala by the way, if you want to go look at it, it's Yala. helps you map your internal software processes that you're building.\r\n\r\n\r\nbuilding software. I'm sure I butchered that, I'm really sorry, but it's a really cool product. Go check it out. Anyways, I think we have like, more than a more than a few of those within tribe, right? Companies that are kind of working as as agencies. Do you? Do you think more agencies like that will pop up? Or Chris, do think they'll actually just be like positions within companies?\r\n\r\n\r\nTrenton (54:16.878)\r\nYeah. Yeah.\r\n\r\n\r\nChris Munn (54:28.389)\r\nBoth, both, they're both gonna pop up. Like AI is huge. To me, it is the biggest thing for business since the internet. And so everything that the internet did, I think AI will do and it will create jobs that we're not thinking of right now, it create positions we're not thinking about right now. It's huge. So people are doing both. It's like, I see people who get AI consultants, automation consultants all the time. I think those businesses will grow.\r\n\r\n\r\nNikolas Hulewsky (54:45.57)\r\nYeah.\r\n\r\n\r\nTrenton (54:56.622)\r\nLike him or not, Mark Cuban just came out, it was like yesterday or two days ago, and said that this type of work, like AI implementation for businesses, will be the biggest opportunity that we've seen in decades, I think he said. So I think that that's the case, too.\r\n\r\n\r\nNikolas Hulewsky (55:12.332)\r\nIf Bark said it, mic drop. Trenton, do you say? He's a business leader. He takes stands. Trenton, what are you seeing people use AI for the most? What's maybe the first or second use case that you're seeing business owners really get value from?\r\n\r\n\r\nTrenton (55:13.398)\r\nYeah\r\n\r\n\r\nChris Munn (55:13.859)\r\nYeah, he's a business leader.\r\n\r\n\r\nTrenton (55:20.191)\r\nYeah, he definitely does.\r\n\r\n\r\nTrenton (55:32.366)\r\nThere's so many different things. I'm definitely seeing it in terms of like financials, whether that be financial forecasting or even like tax stuff is happening. Definitely seeing a lot of automations in terms of email follow-ups and like CRMs could do some of this stuff before, but a lot more there. Chat bots are really popular now. Even voice agents I'm seeing being put in businesses. The voice agents are interesting because they're actually not bad and probably\r\n\r\n\r\nNikolas Hulewsky (55:54.924)\r\nYeah.\r\n\r\n\r\nTrenton (56:01.038)\r\nYou know, like they make little mistakes, better than some others. Oh man.\r\n\r\n\r\nNikolas Hulewsky (56:07.118)\r\nChristmas dropped.\r\n\r\n\r\nThe well, the crazy thing with the voice agents is like latency has typically been the issue, but it's it's anyways. I'm not even going to give it to the voice agents. We'll cut that part. The things I'm seeing, like the two things that I'm seeing the most impactful one is using AI as a way to help you create automations. So it's not that AI is doing the automation, but you're like, hey, I have these four systems.\r\n\r\n\r\nTrenton (56:32.227)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (56:36.92)\r\nhow do I build something that just creates a report that's generated every day and then AI like helps you think through it? That's one. And then in the sales process, whether it's follow-up, whether it's after hours, text responses, or, you know, an SDR, digital SDR, I'm definitely seeing it a lot in the sales side.\r\n\r\n\r\nTrenton (56:57.122)\r\nYeah, customer service too. I think there's a million different ways that businesses are looking at how they do it. A lot of them are customer touch points though of how do we automate the customer touch points as much as possible so that we have to have less humans here. Yeah, really interesting.\r\n\r\n\r\nNikolas Hulewsky (57:10.584)\r\nTotally.\r\n\r\n\r\nNikolas Hulewsky (57:14.894)\r\nWell, this is week one. We'll see how this goes. I'll cut this part, but let's just say we're gonna start.\r\n\r\n\r\nTrenton (57:20.632)\r\nWhat are we calling ourselves? The three amigos? What are we calling ourselves here?\r\n\r\n\r\nNikolas Hulewsky (57:24.802)\r\nthe three amigos, we're gonna start doing this on a weekly basis, just getting a pulse on what's going on in the SMB world and giving updates to people. So hopefully you enjoy it, give us your feedback and we'll see you next week. Okay, I'm gonna hit.\r\n\r\n\r\nTrenton (57:30.755)\r\nYeah.",
  "metadata": {
    "duration": "",
    "date": "2025-09-19",
    "platform_source": "Google Drive"
  }
}