{
  "episode_number": "143",
  "episode_title": "AI SERIES: 2 - How to Leverage AI as Your Ultimate Business Assistant with Kirill Zubovsky",
  "guest_name": "Kirill Zubovsky",
  "business_name": "Brickworks (co-working space), Scoudsie (AI-powered project builder)",
  "transcript": "﻿Nikolas Hulewsky (00:01.008)\r\nOkay, Krill. Krill, I'm stoked to have you. You were one of the many that volunteered to show me how you're utilizing AI in your business. Your freaking camera setup looks amazing. I love your background. Tell me a little bit really quickly. Who are you and what is your business?\r\n\r\n\r\nKirill Zubovsky (00:01.4)\r\nWe're going to do it live.\r\n\r\n\r\nKirill Zubovsky (00:20.696)\r\nWell, that's a loaded question. I should have that ready, but I never do. Tell me, yeah, 30 seconds. Tell me about your life story. I mean, I should call myself entrepreneur, but I really don't like that because I don't think I have like any tremendous successes under my belt. I just like building stuff. And, know, occasionally I might be able to do something that's useful. And so recently, I mean, a couple of years ago, I built this like little startup in AI that I sold for a little bit of money. That was fun.\r\n\r\n\r\nNikolas Hulewsky (00:22.096)\r\nYeah, tell me in 30 seconds, who are you?\r\n\r\n\r\nKirill Zubovsky (00:49.134)\r\nsince then I've been playing a lot with AI. Like I mentioned, I have a brick and mortar business called Brickworks, which is like sort of like an actual business. And AI is a way to just build something for the future. And so recently I've been building a ton of stuff. If you look at my GitHub history, I probably went from like committing once a day, maybe a couple of times a week to having like 20 commits a day or more.\r\n\r\n\r\njust because that's what AI allows me to do, right? The speed with which I'm going. mean, I probably, like a couple of days ago, I was coding so much, I didn't realize I blew through $100 in a day in GPT-4 or 5 credits because it just kept working and I kept asking it questions. I kept doing stuff, right? And then Cursor sends me an alert. So you're over your limit. But that's what I've been doing recently in terms of the business. I've just been trying to build all the things.\r\n\r\n\r\nbeen yearning to build for the last couple of years and couldn't because everything would take time. I'm actually relaunching a startup that I tried and failed 10 years ago. It's called Scoudsie and it's going to enable people to build projects with AI, but not technical people like me, but somebody who might be a project manager with an idea.\r\n\r\n\r\nwill actually guide them start to finish through the entire project using AI. So that's like one of the main things I'm focused on. Sorry, go, yeah.\r\n\r\n\r\nNikolas Hulewsky (02:21.584)\r\nTell me, no, no, no, no,\r\n\r\n\r\nKirill Zubovsky (02:27.438)\r\nthat was called Smarty names and it's shut down actually, but you could generate domain names with AI and it would actually go and find available domain names and like kind of think for you how to generate clever names that weren't yet taken and would do all of that in the blink of an eye. That was a lot of fun.\r\n\r\n\r\nNikolas Hulewsky (02:36.538)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (02:49.027)\r\nWhen was this?\r\n\r\n\r\nKirill Zubovsky (02:51.406)\r\nI'd say about two years ago, it was still early. Like AI was not hyped up yet. It was like right at the beginning of the hype curve and it worked out great. And I had no idea how domain world worked at that time, nothing. So, you I started, had to learn about it. But then at some point I came to a realization. I was like, I don't actually want to know more about this space. Like I didn't do this because I was passionate about it. And so I sold it to...\r\n\r\n\r\nsomebody in Michigan and, you know, they ran it for a while and they decided to go in another direction, which is fine by me, but it was great learning experience.\r\n\r\n\r\nNikolas Hulewsky (03:25.86)\r\nYeah. What was that right when chat GPT had been really well, I hate saying that because chat GPT has been around for a while, but when it hit mainstream, was it before or after that?\r\n\r\n\r\nKirill Zubovsky (03:38.286)\r\nIt was right about then. Everything moves so fast in AI, things happen on daily basis. It's really impossible to even remember now how it was. But that tool was the first tool for domain generation using AI. And that's why it also caught on Hacker News. And people saw it. They were like, wow, this is going to totally take domain squatters out of business.\r\n\r\n\r\nNikolas Hulewsky (03:40.045)\r\nOkay.\r\n\r\n\r\nKirill Zubovsky (04:04.974)\r\nAnd I mean, when I launched, like I had GoDaddy email me like the next morning, be like, you want to sell domains through us? Like, here's a referral code, blah, blah. Yeah, it was great. I mean, you know, it made some money through referrals, but that particular business was actually a cutthroat business and domaining. It's not great. So I've learned enough to be like, I either have to really double down and maybe raise money to really compete in this space.\r\n\r\n\r\nNikolas Hulewsky (04:13.517)\r\nsweet.\r\n\r\n\r\nKirill Zubovsky (04:32.66)\r\nor not competed in it at all. And for me, was a better idea not to compete in it.\r\n\r\n\r\nNikolas Hulewsky (04:36.728)\r\nYeah, in the business space, I'm seeing a lot of a lot of companies that are either building AI products or using AI to accelerate their current business. I'm more interested in the using AI to accelerate your current business. And that's where I'm wondering how people are actually utilizing it right now, because everybody likes to talk about it. I just don't know that they're actually utilizing it in the way that they're talking about it. So you have a business.\r\n\r\n\r\nKirill Zubovsky (04:44.974)\r\nMm-hmm.\r\n\r\n\r\nKirill Zubovsky (04:53.048)\r\nMm-hmm.\r\n\r\n\r\nKirill Zubovsky (05:04.461)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (05:04.982)\r\nin Beckenridge, Colorado called Breckenworks? Breckworks. Okay. And that is what? What kind of business is that?\r\n\r\n\r\nKirill Zubovsky (05:07.598)\r\nBreakworks, breakworks, yeah.\r\n\r\n\r\nKirill Zubovsky (05:13.56)\r\nThat's a co-working space, so tourists come here on ski vacations realize they can't really work out of their B &Bs because the internet's bad and whatnot, and they just show up and work with us. And we have all kinds of offerings.\r\n\r\n\r\nNikolas Hulewsky (05:25.488)\r\nAnd are you using AI in that business right now?\r\n\r\n\r\nKirill Zubovsky (05:29.374)\r\nI it's, I'm not gonna screen share yet, but for that one, I don't really code much. I've coded everything I needed for that already, right? But the way I use AI, like this morning, I decided to test our guest network, because I'm usually in my own admin network, so everything is good, right? So I'm testing guest network and I get some pop-up about like SSL certificate not being correct, whatnot.\r\n\r\n\r\nNikolas Hulewsky (05:33.497)\r\nYeah.\r\n\r\n\r\nKirill Zubovsky (05:54.894)\r\nSo I could sit there and wonder like, what should I do? Or I just screenshot everything, go to Grok, put it in there. And I'm like, literally like, hey, look, I run this guest network on my coworking space. This is the arrow I got. What do you think I should do? And Grok's like, well, it's probably because like you're using Unifi certificate. You should go to, let's encrypt and get yourself a fresh certificate, then upload it. Here's the instructions of where you need to upload it. And then you'll be fine. It's like, great.\r\n\r\n\r\ntook hold of like 10 seconds. And it's my IT team, right? And that's like my everything team. Like the other day, this is amazing, right? Back to like brick and mortar business. And I wish I show this to all of my friends in like real businesses. Unfortunately, like a lot of them still don't even know about AI or don't even think like this could help them. It's so weird. Like you show it to people and they're like, like, I can ask it anything. You're like, yeah, literally anything. They're like, well, what I'd ask.\r\n\r\n\r\nNikolas Hulewsky (06:24.656)\r\nThat's amazing.\r\n\r\n\r\nIt's your IT team.\r\n\r\n\r\nKirill Zubovsky (06:53.58)\r\nI'll give you an example. So I needed to like patch up some holes in the walls and I have spackle. But you know, all the tools that usually put spackle in a wall. I don't know if you've ever like dealt with walls, but but they kind of wide and like or just like meant for bigger jobs. I have like really this thin narrow gaps. So I go and grok and I'm like, hey, grok, you know that thing that you used to squeeze silicon out of a tube? Like, what is it called? It looks like a\r\n\r\n\r\nNikolas Hulewsky (07:03.812)\r\nYeah, I have.\r\n\r\n\r\nKirill Zubovsky (07:23.342)\r\ncrayon and I literally that's how I explain like it looks like a crayon and you squeeze it with another device and grocks like you're probably thinking off and then gives me a whole explanations like this is what you're looking for and because they the inner tube you can buy an empty tube then fill it up with whatever you want put in and then squeeze that out I'm like great you know ten bucks on Amazon now I'm good to go for my project\r\n\r\n\r\nNikolas Hulewsky (07:45.594)\r\nWhat's it called? Is it not a caulking gun? I've just always called it a caulking gun. Okay.\r\n\r\n\r\nKirill Zubovsky (07:49.442)\r\nYou're right. It's talking gun, but like, or probably, I don't know. Let me see. But you know what I mean? It's like, but that's how I use like AI in real world. we have a lot. have so many queries. I don't know.\r\n\r\n\r\nNikolas Hulewsky (07:53.776)\r\nProbably not even that.\r\n\r\n\r\nNikolas Hulewsky (08:02.832)\r\nI used it the other day. I was like, hey, my camera's not working. This is the picture that it's spitting out. How can I make myself look better, basically, was the question. And it was like, okay, well, your exposure might be set to this, or your aperture is here, or have you tried a new lens? And it gave me a bunch of suggestions. It was really cool.\r\n\r\n\r\nKirill Zubovsky (08:10.346)\r\nhuh.\r\n\r\n\r\nKirill Zubovsky (08:13.794)\r\nGreat.\r\n\r\n\r\nKirill Zubovsky (08:23.36)\r\nLiterally this morning, like right before we jumped on this recording, right? I know I can use my iPhone to have like the back facing camera as the camera for this recording. I connected my iPhone and it's a wide angle and I'm like, Grok, why is my camera set to wide angle? Right? Well, it's because Apple changed their settings and now you have to go like click on top where it says FaceTime and then go somewhere. And then actually if you hover over the image, that's when you can zoom in and zoom out.\r\n\r\n\r\nThere is no like, here's three cameras on your iPhone, choose one. Again, right? Like, I could fiddle with settings or I can just ask the AI and it figure it out for me faster than I figure with settings. that's like real life, I think experience of like how anyone should be using this. Like, it's so good.\r\n\r\n\r\nNikolas Hulewsky (08:55.45)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (08:59.546)\r\nYeah, totally.\r\n\r\n\r\nNikolas Hulewsky (09:07.726)\r\nI'm curious because you've said it now a couple of times. You're using grok mainly as your default. Why?\r\n\r\n\r\nKirill Zubovsky (09:12.204)\r\nI do. Yes. for coding, I use a lot of sonnet thinking model. And for everything else, I use grok a lot. I used to use chat GPT. I find grok way faster. I mean, clearly, because Elon bought like billion GPUs, right? And then it's very fast. And it's also funnier, like\r\n\r\n\r\nNikolas Hulewsky (09:30.692)\r\nvery fast.\r\n\r\n\r\nKirill Zubovsky (09:38.316)\r\nChagy Pt sounds like a PhD student who's a little tired and just trying to give you like a very long response. Groxdoll like upbeat like, yeah, sure, I could do this for you. No problem. Here's three lines, you know, like I love it so much. It's just and I was going to share this in the newsletter with my subscribers. But, you know, I think like everyone should try all of these different tools and try all of these different models because it's like working with people like you like some people more than others.\r\n\r\n\r\nexcept now you can choose to just work with the people you like.\r\n\r\n\r\nNikolas Hulewsky (10:09.944)\r\nYeah, that's a really good point. That's a really good point. So Grok, for those who don't know, Grok is from XAI or Twitter, right? That's Elon's company. Sonnet is from Anthropic. They've created a model. then ChatTik, which is obviously OpenAI. So you said you use Grok for most general queries, and you use Anthropic for coding assistance?\r\n\r\n\r\nKirill Zubovsky (10:35.086)\r\nYeah, and for coding, I mean, we can get into it in detail if you want, but for coding, I use different models. So currently I use primarily Sonnet, the thinking version, because it basically takes longer to respond to you, but it creates a better response. So it doesn't just spit out. Yes, three point seven. Yeah, no, it just instead of like just spitting out the first response and can think of it literally goes through loops and gives you something better.\r\n\r\n\r\nNikolas Hulewsky (10:51.844)\r\nAnd that's, is that 3.7? Is that right? It doesn't matter, sorry. Okay.\r\n\r\n\r\nKirill Zubovsky (11:04.44)\r\nSo that's been really useful. like I said, I've tried chat GPT 4.5. That one just came out, but it's really expensive, like $100 in a day expensive. yeah, I use the also chat GPT. Well, we call it chat GPT. It's really open AI. But the 03 mini model that they created is specifically for coding. And it's very good on smaller tasks. But like...\r\n\r\n\r\nNikolas Hulewsky (11:11.726)\r\nMm-hmm. It's not great.\r\n\r\n\r\nNikolas Hulewsky (11:25.488)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (11:31.544)\r\nIs... This is a dumb question. Claude? Is Claude the same as Anthropic?\r\n\r\n\r\nKirill Zubovsky (11:36.706)\r\nYes, it's their chat GPT equivalent. So it's app. Sonnet is the model that powers Claude. Yes. Right? Because you have this base layers with models. Then you have essentially the UIs and companies that own that. So like, 03mini is a model by OpenAI that you can load in chat GPT. Right? And so forth.\r\n\r\n\r\nNikolas Hulewsky (11:40.11)\r\nSo what's sonnet then?\r\n\r\n\r\nNikolas Hulewsky (11:46.01)\r\nClaude. okay. So Claude's their interface or whatever.\r\n\r\n\r\nNikolas Hulewsky (12:01.412)\r\nGot it. Okay. Okay. I'm up to.\r\n\r\n\r\nKirill Zubovsky (12:03.726)\r\nDon't worry. They had an interview with the CEO of Antropic and he mentioned how this is a cluster nobody understands and like they should figure out how to do it better. But right now, and the irony is after he said that like, yeah, we'll do better than they released in other series of models with like complicated namings and it's not just you like literally nobody knows anymore. They're like, well, do I use this? Do I use that? And actually latest edition of cursor now allows you to just say, hey, cursor, pick the best model for me.\r\n\r\n\r\nand just do stuff. And I think eventually we'll get to where models will do that. They'll have like a router that will do this.\r\n\r\n\r\nNikolas Hulewsky (12:42.864)\r\nYeah, there's a ton of different models. People use different models for different purposes. Like you're using Claude, Anthropic, whatever for coding, Grok for most general functions. I find Grok is better because it's more real time as well. Like I can get real time information. All right, let's talk about how you're using this in your business. I'd love to see, because everybody's talking about, I'm using AI, blah, blah, But then you dig into it and you're like, you're not really using AI.\r\n\r\n\r\nKirill Zubovsky (12:52.322)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (13:10.704)\r\nLike you say you are, but it's clunky or it doesn't work the way that you have advertised. So I'm curious to see how you're using it in your business.\r\n\r\n\r\nKirill Zubovsky (13:19.63)\r\nOkay, we might have to cut some of this out if doesn't work. I'm terrible at maintaining like things that work at the same time because I push too many updates. If they break, I'm like, just tell me, you know, I'll fix it. Yeah, let me just screen share with you and then we'll go and explore. Let's see, I'm going to share everything.\r\n\r\n\r\nNikolas Hulewsky (13:22.222)\r\nThat's fine. Yeah.\r\n\r\n\r\nNikolas Hulewsky (13:29.092)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (13:36.474)\r\nOkay, while you're pulling that up, is this revenue generating or is this like cost saving?\r\n\r\n\r\nKirill Zubovsky (13:41.422)\r\nThis is aspirational that it will generate revenue. So I'll show you.\r\n\r\n\r\nKirill Zubovsky (13:51.374)\r\nthink maybe we just crushed it or something. So this is like I said, this is still coming up. This is going to be available on scouts.com, but people will have to pay for this. And the idea is that you can generate a chat and I'll see if I can show you one of the already available ones. So this is a real chat that I generated with AI. I said, I want to create a duck catching net that can be easily deployable at a park to catch wild ducks.\r\n\r\n\r\nHelp me. It's ridiculous, but I can send you a link to this full chat. have it in my newsletter. Then our AI goes and has a conversation with the user about this project. So this is like real, you know, you can literally if you don't know, if you know what you want to do, but you can't think of the steps like we have all the steps here for you, the MVP steps of how to develop a product. But\r\n\r\n\r\nbut the AI will guide you. This is a complete product, that's why you see mostly everything checked off. But you can see the AI actually having a conversation, asking user questions, and then as long as you respond, it continues to have conversations with you. there's like 76 messages in there. It asks you and then analyzes your responses. And it's specifically tailored.\r\n\r\n\r\nNikolas Hulewsky (15:14.384)\r\nWhen you say product, is this like a digital product? Could this be a physical product? Could this be a plan? An implementation plan? What does product mean?\r\n\r\n\r\nKirill Zubovsky (15:24.91)\r\nWell, in this case, I was joking with the duck catcher, right? Because I just wanted like an obscure idea to see how it behaves, but it could be anything. Right now we have it tailored for digital products. So if you want to build an app or a web app, something like that. But really, as we've been playing with this and have showed it to some people, I've started getting in bounds of like, oh, well, can you do it for a physical product? Like, can you then get me to somewhere where I can pass it to somebody who can go and make it like a CAD mockup?\r\n\r\n\r\nAnd we certainly can. so again, so this will be available. And we're kind of hoping this would be really big because this is exciting. Like a lot of people struggle with, well, what do I do? Like where do I start? This will get you completely through this.\r\n\r\n\r\nNikolas Hulewsky (16:12.676)\r\nWhat if I'm a business owner and I'm just like, I want to grow into a new territory. How do I even think about the plan to grow into a new territory? Will it help me with that kind of a project or is this just?\r\n\r\n\r\nKirill Zubovsky (16:26.83)\r\nFor now, no, because like we want to start with something simple. But since you were asking, know, like, let's go to GROK and like it's a, I have a podcast where I teach people to use AI. How do I expand it to new audience? Here, identify new audience segment, leverage guest speakers. Like you can be sitting there and thinking about how to do this.\r\n\r\n\r\nwhere you can just get a list and the beauty of AI like, okay, maybe not all of this is applicable to you. Some of it is. Why spend time on brainstorming? So we're doing this, but with very strict focus. And at the end of it, you'll be able to actually hire yourself a team if you want to take it to the next level.\r\n\r\n\r\nNikolas Hulewsky (17:14.256)\r\nYeah, I always say I like using AI as the first bad idea. It's like, just get me started. Like, give me something to go off of that I can brainstorm after.\r\n\r\n\r\nKirill Zubovsky (17:22.574)\r\nWell, let me show you like, doesn't have to be a bad idea. Come on, like\r\n\r\n\r\nNikolas Hulewsky (17:27.428)\r\nBut no, no, I don't mean it's a bad idea. I just mean like, me something to work off of, right? Because you need something to at least start with, here's a frame of reference that I can work.\r\n\r\n\r\nKirill Zubovsky (17:38.456)\r\nSo I'll show you this. had an idea. Actually, it started here. It started with subtitlesking.com. Totally goofy website. Yep, it adds subtitles. Some guys sitting in the toilet, you you can't turn on the audio. You want to get subtitles for your video as a creator. I mean, in the studio we're recording right now, they'll edit for you. But for many other use cases, it's not yet available. So this app, you just upload a video.\r\n\r\n\r\nNikolas Hulewsky (17:48.346)\r\nSome guy sitting on the toilet. Some guy sitting on the toilet.\r\n\r\n\r\nNikolas Hulewsky (17:57.177)\r\nYeah, yeah,\r\n\r\n\r\nKirill Zubovsky (18:08.162)\r\nand it will quickly create subtitles for you. That took a couple of days to figure out from start to finish how to put it all online. There's no billing here. This is free. And people use been using it, you know, it's absolutely free. Like it's just fun. But then I was like, well, how do I take this to the next level? So meet transcriptking.com. It actually does transcripts. It does translations. It uses whisper by open AI. You can do it on all the languages. And the beauty is this whole thing.\r\n\r\n\r\nWell, this took about two weeks to create, not the whole website. Well, the whole website plus all the scripts that actually do this or transcription, transcribing, blah, Setting this up on the server, getting all the certificates, building a script that updates, checks everything, saves everything, backs up everything, like everything start to finish.\r\n\r\n\r\nTwo years ago, this would have taken like three months to do. And now I was able to do it in two weeks. And it was basically done in three days, but then I spent another 10 days making it substantially better. I mean, so I, yeah, so this is like, this is the front end and cursor. I was fixing something, so I still have it open, right? Like, but this is all Next.js, front end and Next.js lives in...\r\n\r\n\r\nNikolas Hulewsky (19:19.962)\r\nWhat did you use to build it? Cursor?\r\n\r\n\r\nKirill Zubovsky (19:34.574)\r\nis hosted on Versal. But the beauty is I can easily host it by myself now because I've asked Cursor to teach me how. I just find Versal cheap enough that it's not a big deal. But the server part actually lives on my own server that costs like 20 bucks a month.\r\n\r\n\r\nNikolas Hulewsky (19:49.144)\r\nNow, do you have coding experience?\r\n\r\n\r\nKirill Zubovsky (19:52.479)\r\nI do. I've been coding for like over 10 years now.\r\n\r\n\r\nNikolas Hulewsky (19:55.738)\r\nSo how hard would it have been for somebody to build this website on cursor with no coding experience?\r\n\r\n\r\nKirill Zubovsky (20:01.698)\r\nWell, let me show you something like from my latest query. So here you go. I said, can you create an FAQ page? Replace Transcriptor, which is like the FAQ page that looked nice that I found with Transcript King and add relevant answers. Use Tailwind FAQ page style. So it goes ahead and writes this whole code basically in one shot and it's done. I actually...\r\n\r\n\r\nNikolas Hulewsky (20:27.586)\r\nWhat do do with it after it's written that code? you copy, you just copy and paste it and like.\r\n\r\n\r\nKirill Zubovsky (20:31.278)\r\nIt just works. here, well, it.\r\n\r\n\r\nNikolas Hulewsky (20:34.04)\r\nso it's connected, so the cursor's connected to your website?\r\n\r\n\r\nKirill Zubovsky (20:38.412)\r\nYes, I'm going to show you in depth because I haven't pushed the updates.\r\n\r\n\r\nNikolas Hulewsky (20:45.424)\r\nI didn't know that. Okay, so you're writing in cursor. I don't know a bunch about websites anyways, but so you're not using WordPress or any of these other platforms that are building websites. You're just using cursor.\r\n\r\n\r\nKirill Zubovsky (20:59.992)\r\nYes, and so I literally asked it to do this FAQ page and it just built it for me. So I still have to change all the content if I wanted to. It probably, I haven't even read it yet. Like literally I just did it two minutes before our call. I just like the simple style of questions and I'll update the questions. And actually what I've been doing a lot is if I change something in my code, I'll go to cursor and I say like, for example, hey, knowing everything you know about my site.\r\n\r\n\r\nCan you update FAQ with anything that's missing? Boom. And so now it's thinking, it's basically analyzing my features and has like a running memory of everything it knows that I've already built. And now it's just gonna see like all the steps about planning and processing. Like it's actually trying to figure out what my content is.\r\n\r\n\r\nNikolas Hulewsky (21:54.82)\r\nHmm. Okay, I'm an idiot, so let me just try to understand what you're saying here. I can create a website using natural language by just saying, hey, create me this website, and then cursor will actually write the script, the code for the website.\r\n\r\n\r\nKirill Zubovsky (22:10.902)\r\nOkay, let's do it. Now, well, I know you want to eat. We're gonna take five minutes.\r\n\r\n\r\nNikolas Hulewsky (22:17.293)\r\nNo, let's do this. I'm in.\r\n\r\n\r\nKirill Zubovsky (22:20.12)\r\nWe gonna go to, what are we gonna call it?\r\n\r\n\r\nKirill Zubovsky (22:27.022)\r\nWhat are we going to call our website?\r\n\r\n\r\nNikolas Hulewsky (22:30.352)\r\nLet's call it, I mean, we could just create a random website, Like create an economics podcast website. That's my podcast. Let's just create an economics podcast website.\r\n\r\n\r\nKirill Zubovsky (22:39.914)\r\nNiconomics, is that?\r\n\r\n\r\nNikolas Hulewsky (22:43.416)\r\nN-I-K-O-N, enomics. It's like economics except with a nick in the front.\r\n\r\n\r\nKirill Zubovsky (22:49.794)\r\nYeah, so anyways, I may have misspelled it, but you know, we'll do all that. So, hold on. I'm just gonna accept all the changes. See, it just updated my FAQ based on my request, because I understood what my website is about. And so if I refresh this, now FAQ got longer. Like, I didn't have to write any of this. I'll still review it. And as I've been working like this for the last couple of months, I have maybe a lot of tips and tricks of how to actually prompt it better or kind of like help it.\r\n\r\n\r\nNikolas Hulewsky (22:52.378)\r\nNo worries. Okay.\r\n\r\n\r\nNikolas Hulewsky (22:59.6)\r\nJesus.\r\n\r\n\r\nNikolas Hulewsky (23:08.336)\r\namazing.\r\n\r\n\r\nNikolas Hulewsky (23:17.626)\r\nSure.\r\n\r\n\r\nKirill Zubovsky (23:19.458)\r\ndo a better work for you, but okay. So let's just close all of this. And we're gonna do, we're gonna start super simple. Where is, hold on. I can't actually see because, whoops, hold on. We're gonna have to restart sharing. Are you still there? I can't find you.\r\n\r\n\r\nNikolas Hulewsky (23:35.984)\r\nNo, no worries. Yeah.\r\n\r\n\r\nKirill Zubovsky (23:41.23)\r\nYeah, let's do it again. So let's do a screen share. We're to open Cursors, a new window, we're just going to throw this new folder in here.\r\n\r\n\r\nNikolas Hulewsky (23:41.466)\r\nYeah. Titan Sieg.\r\n\r\n\r\nKirill Zubovsky (24:02.648)\r\nThere we go. So do you have favorite websites, podcast websites that you are inspired by?\r\n\r\n\r\nNikolas Hulewsky (24:11.664)\r\nwow, I can just go choose podcast websites. Creator Science by Jay Klaus.\r\n\r\n\r\nKirill Zubovsky (24:22.286)\r\nThere you go. creative science, you can go here and say, wow, that's, is that the right one? Creative science. can say, so I'll just say this. I really love creative science podcast website and would like one for myself called is it with the KOC, sorry.\r\n\r\n\r\nNikolas Hulewsky (24:46.128)\r\nK-N-I-K-O-N-O-M-I-C-S.\r\n\r\n\r\nKirill Zubovsky (24:48.194)\r\nNiconomics podcast, right? Can you create me a basic, we'll start with HTML, a basic HTML website using Tailwind that looks like that, but for my podcast. So see, it's generating stuff and it's like, we're asking it for basic stuff. Sure, I still need to know to maybe ask it for basic HTML stuff.\r\n\r\n\r\nmay need to know to reference Tailwind. But, all right.\r\n\r\n\r\nNikolas Hulewsky (25:21.262)\r\nAnd what if I sent you like my, let's just say loco? that helpful or is that not helpful?\r\n\r\n\r\nKirill Zubovsky (25:27.726)\r\nIt will be helpful. You can steer it. But I mean, you just give it content.\r\n\r\n\r\nNikolas Hulewsky (25:38.116)\r\nWell, was just saying, if I gave it my logo, would it then generate the website to have the same color scheme as, okay.\r\n\r\n\r\nKirill Zubovsky (25:45.9)\r\nYes. Yes, it will. fact, so we'll go back to Transcript King while that's generating. The colors were all different here. then and then like I wish I had an earlier version screenshot, but like it looks decent right now, right? Like not terrible. And so at some point I was like, hey, can you give me options for colors that look expensive?\r\n\r\n\r\nAnd it was like, OK, well, there's this dark green and beige and then there's golden and give me some options. And was like, OK, cool. This blue steam kind of appeals to me. Like, can you make me a whole website like that? Right. And he just knows. And then sometimes. what I can also do is I think I've already fixed it so it kind of looks OK on mobile right now. But for example, this section, everything, everything here was actually really narrow.\r\n\r\n\r\nLike it was kind of like right here in the middle. So I just took a screenshot of this section. I was like, hey, can you fix padding? It doesn't look very good. And it knows that I mean that I want padding on mobile.\r\n\r\n\r\nNikolas Hulewsky (26:53.776)\r\nSo you uploaded the screenshot. You just uploaded the screenshot and it knew what to look for.\r\n\r\n\r\nKirill Zubovsky (26:57.408)\r\nYeah, yeah. And well, in that particular trick is best for this sonnet 3.7 thinking. Actually, I haven't tried the Max yet. It's a new model I should try. But see, like, look, it's generating us code for the entire website. And in fact, I asked it, huh? Yes, we'll put it on GitHub and then you can like make a new website. I'm pretty sure you have a good website.\r\n\r\n\r\nNikolas Hulewsky (27:17.509)\r\ngenerating my website right now.\r\n\r\n\r\nNikolas Hulewsky (27:25.936)\r\nI do, know, yeah, my website's great. just, like, that was the only thing that I thought of. I'm not creative curl.\r\n\r\n\r\nKirill Zubovsky (27:27.726)\r\nYeah, but like, yeah, it's fine. like, look, like I told it to use Tailwind and it knows where to get it from. it's just, Tailwind is a CSS framework that like makes all websites look the same. I kind of joke for a while, I was like very much against Tailwind because it literally makes everything looks the same, but it also makes everything a lot faster to build because they've pre-built all the components.\r\n\r\n\r\nNikolas Hulewsky (27:37.508)\r\nWhat's tailwind?\r\n\r\n\r\nNikolas Hulewsky (27:44.218)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (27:53.465)\r\nOkay.\r\n\r\n\r\nKirill Zubovsky (27:56.726)\r\nSo like when I showed you the FAQ page, right? Like if you click on this and the thing expands, that takes a little bit of code. Like all the components like this, or like if we go back here, like these things, the fact that three of them are in a row and the logo is here and it looks nice, or like this thing's side by side, or like this creator comments are like laid out. It takes a little bit of time. And so they abstracted all of that and you just basically say, I want it to look like this and it builds it for you.\r\n\r\n\r\nA year ago, maybe two years ago, you still had to learn Tailwind. Here, I can give them a shout out. You know, these guys. So a year ago, see how they show you all the components? A year ago, you still had to learn Tailwind sort of notation to use it. And that's what I found annoying because I'm like, well, I might as well learn the CSS that this is based on and use that.\r\n\r\n\r\nNikolas Hulewsky (28:38.448)\r\nCould you? Go ahead.\r\n\r\n\r\nKirill Zubovsky (28:52.898)\r\nBut now you can just tell AI what you need and it builds it for you. So like you don't need to learn anything. All right. I think we're done with your website. Let's see. Yeah, let's see if we can open it. There you go. Economics podcast. Exploring the intersection technology in society. You know, like, yeah, look at that. I mean.\r\n\r\n\r\nNikolas Hulewsky (28:59.706)\r\nSo yeah, okay, that's what I was gonna ask.\r\n\r\n\r\nNikolas Hulewsky (29:08.816)\r\nAnd that's it with that one simple podcast.\r\n\r\n\r\nNikolas Hulewsky (29:18.512)\r\nAnd if I wanted it refined now, now I go in and with natural language say, this is what my podcast is about. Here's who my guests have been like, whatever.\r\n\r\n\r\nKirill Zubovsky (29:23.596)\r\nYeah.\r\n\r\n\r\nKirill Zubovsky (29:27.256)\r\nHere you can say this, I would like colors to change to gold and something fitting to gold. Can you do it? Right? And then we'll go in and think about it and we'll change it. And like, look, you've got this like little animations. We don't have any other pages yet, but it's created a read me with features and styling. And it's funny because it actually knows to, yeah. And it knows to create a read me because\r\n\r\n\r\nNikolas Hulewsky (29:43.332)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (29:51.97)\r\nWhat?\r\n\r\n\r\nKirill Zubovsky (29:56.258)\r\nI've actually instructed it behind the scenes. The new model might actually know this too, but I've specifically instructed the models I work with to create and repeatedly update the readme. as I like, I always have the most.\r\n\r\n\r\nNikolas Hulewsky (30:07.908)\r\nWhat's a... I know what a README is. I know what it is. But like, for someone who doesn't know what a README is, what's a README?\r\n\r\n\r\nKirill Zubovsky (30:16.122)\r\nWell, something that helps other people to pick up your work and figure out how it works and take it from there. Right, so it keeps track of everything in this case and explains it. I mean, this is basic, but you can ask it to explain in detail. Actually, I guess I've already closed it, but I was going to show you my like infinite long read me. But yeah, like\r\n\r\n\r\nNikolas Hulewsky (30:38.748)\r\nlike if I went to another, I don't know, coder, they'd be able to take the readme and understand how and why it was created up to this point.\r\n\r\n\r\nKirill Zubovsky (30:48.19)\r\nYeah, so they don't have to look through the entire site for hours, but me open something recent. So I'm going to open the transcript came back end and and open the read me here. And it's not that bad. But, you know, there's like API routes. I'm not sure if I should be exposing this. Somebody will hack it. But it's OK. You know, like but basically, yeah, like I send it to a friend that I work with. And I was like, hey, here's how this whole thing works. And\r\n\r\n\r\nNikolas Hulewsky (30:51.468)\r\nHmm\r\n\r\n\r\nNikolas Hulewsky (31:02.394)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (31:08.048)\r\nI'll blur it, I'll blur it.\r\n\r\n\r\nNikolas Hulewsky (31:17.134)\r\nHoly crap, Krill. So why did I just spend five grand on creating my website,\r\n\r\n\r\nKirill Zubovsky (31:22.104)\r\nWhy did you?\r\n\r\n\r\nNikolas Hulewsky (31:24.432)\r\nYou\r\n\r\n\r\nKirill Zubovsky (31:28.622)\r\nWell, and this is what I remember I told you about Scalding 2.0 that I'm working on. And that's our goal where like we give you as much as we can upfront where it gets you started. But then if you really want to make it good and like you don't want to do this, because believe it or not, a lot of people still don't want to do this, then we'll do it for you. Like I'll take on the hard work of like actually sitting here and talking to AI all day. And, you know, with practice, I'm going to talk to it faster and better than you would.\r\n\r\n\r\nNikolas Hulewsky (31:29.647)\r\nso stupid.\r\n\r\n\r\nNikolas Hulewsky (31:45.348)\r\nyeah, I get it.\r\n\r\n\r\nKirill Zubovsky (31:56.654)\r\nBut look at that, we just changed your website to gold. Looks amazing. Look, there's even like a fake picture of some podcast host that we don't know who that is. So, hey, welcome to Nikonomics 2.0.\r\n\r\n\r\nNikolas Hulewsky (32:08.208)\r\nNow, if I have specific information, like, want all of my episodes listed. Here's the link to all of them. Can it do that?\r\n\r\n\r\nKirill Zubovsky (32:18.19)\r\nPodcast, which one is yours? This.\r\n\r\n\r\nNikolas Hulewsky (32:22.957)\r\nI think that I can't see, but I think that top one. Yeah, that's my website.\r\n\r\n\r\nKirill Zubovsky (32:26.538)\r\nIs this you? Sweet. So here we can do that. Here's a list of some podcast episodes. Can you add it to this new website? Yeah. So the ability to browse, right? Because I gave it a link and now we'll actually browse, it's fairly new.\r\n\r\n\r\nMaybe like three months ago, wasn't yet available. The ability to just drop an image and for it to figure it out wasn't available previously, but it is now. And it's improving. There's a number of companies competing in the base models. There's a number of companies like Cursor who are competing for what's the development interface looks like. And like, honestly, like I told the Cursor guys the other day, I'm like, if I wasn't so hell bent on like making my own stuff, I'd go work for them because I'm pretty sure they're the next Google. And then...\r\n\r\n\r\nBut that's like saying it lightly. They're like the next internet because think about it, right? right now we can ask a model to build us a website, but that model in the background is building cursor. It's also figuring out what cursor needs to be better for me. In the next iteration of that is you have an interface that's entirely like agnostic to an interface. You just talk to it and I'm typing right now, which is like so archaic. I mean, so like yesterday, eventually you just...\r\n\r\n\r\nNikolas Hulewsky (33:41.391)\r\nYeah, yeah.\r\n\r\n\r\nKirill Zubovsky (33:47.662)\r\nIt's true. Eventually you just talk to this thing and things appear and disappear. There's no interface. There's like a canvas and you talk to canvas and you get a video or you get a block or you get a math game and it just goes in and out, whatever, right? Like your computer looks like a box that just does stuff for\r\n\r\n\r\nNikolas Hulewsky (34:07.988)\r\nOkay, let me ask you this. What is the difference between cursor and replica?\r\n\r\n\r\nKirill Zubovsky (34:12.974)\r\nOne of them works.\r\n\r\n\r\nNikolas Hulewsky (34:13.754)\r\nCause when I talk to people, dude, yep, you're right there. One of them works. When I talk to people, they're like, Replet is freaking trash, bro. Cursor is amazing. But I mean, lots of people use Replet and everyone's talking about how cool Replet is, but you think Cursor is where it's at.\r\n\r\n\r\nKirill Zubovsky (34:29.688)\r\nSo I use cursor because I started with this and it works for me, works great. My friend uses windsurf, which is another tool like cursor and he loves it. And I tried it and I couldn't make it work because it's different. And again, it's going back to like, it's like working with your friends. All of a sudden you just have certain expectations and they just don't work for you anymore. Like, look, we just asked the thing, your website. Let's see if we have.\r\n\r\n\r\nNikolas Hulewsky (34:44.464)\r\nOkay, so somebody.\r\n\r\n\r\nNikolas Hulewsky (34:51.727)\r\nYeah.\r\n\r\n\r\nKirill Zubovsky (34:58.318)\r\nWell, it updated something, that's for sure. Do we have... Let's see what it's updated. So we don't have the episodes yet. It tells us it's completed stuff. It added this bio. I'm just trying to see if it actually added episodes. look, yeah, like I guess it added like nicer placeholders, but not the episodes yet. So anyways, you know, that's not you, is it?\r\n\r\n\r\nNikolas Hulewsky (35:09.754)\r\nSo rep.\r\n\r\n\r\nNikolas Hulewsky (35:21.84)\r\nStill. Yeah. No, that's not me. Still, like, I have a website. I could go and create a website myself. I don't need... And how much does it cost to, host this?\r\n\r\n\r\nKirill Zubovsky (35:28.706)\r\nYeah, yeah.\r\n\r\n\r\nKirill Zubovsky (35:33.966)\r\nfree, it's an HTML page, can technically just throw, if it's a simple HTML page, you can throw it on GitHub pages for free. Like I said, I use Next.js for frontend framework, which I then host in Verso, which ends up costing for all the projects I have on there right now, like 50 bucks a month, which is honestly quite a bit. For the backend, I just like separation of concerns where like the logic of things ends up on a backend, not in the same application.\r\n\r\n\r\nThat I paid $29 a month for and I have like six projects hosted on that server right now. Basically all of them.\r\n\r\n\r\nNikolas Hulewsky (36:09.37)\r\nSo if I was somebody and I was like, have no coding experience, but I know I can go get businesses to pay me to create their websites or to manage their websites, I could start a business right now, creating websites for businesses, right? And like, I would just have to go ask them, hey, what did your business do? Give me some information. What are some websites that you like? And then I just feed that into Cursor and I'll get, and I'll just start iterating.\r\n\r\n\r\nKirill Zubovsky (36:22.754)\r\nYeah. yeah.\r\n\r\n\r\nKirill Zubovsky (36:35.054)\r\nYeah, essentially.\r\n\r\n\r\nNikolas Hulewsky (36:36.752)\r\nYou just, huh, yes. I was like, my gosh, that's insane. That's insane.\r\n\r\n\r\nKirill Zubovsky (36:42.638)\r\nI mean, I'm pretty sure people are already doing that already. And people cloning a bunch of apps. Like, you should look on the Apple App Store how many clones of ChatGPT there are, because it would be like, you know, ChatSystem 4X. And you don't need a lot of users. You just need some number of users to pay you like 20 bucks a month. And they're just wrapping the ChatGPT API. Yeah, yeah. Yep, yep. That's amazing.\r\n\r\n\r\nNikolas Hulewsky (37:00.092)\r\nAnd all they're doing is paying. Yeah, that's what I was saying. All they're doing is taking the ChatGPT API and then they're paying on a per call basis, whatever, but they're charging you. my gosh. my gosh. It feels like a gold rush. It's like just get in there while the getting's good.\r\n\r\n\r\nKirill Zubovsky (37:12.078)\r\nyou\r\n\r\n\r\nThat's why I'm doing this, because I think it's like once in a lifetime opportunity. I don't know where it's going to lead. I don't know what it's going to look like in three months, six months, 18 months. But like right now, it's so much fun. And it's really, and it's not just me, it's a lot of my friends too. Like we know how to code, but coding got really repetitive and boring and tiring. And with this, it's got exciting again, because I still read the code. You know, I still try to sway the AI to do stuff, but stuff like\r\n\r\n\r\nNikolas Hulewsky (37:22.319)\r\nHoly crap.\r\n\r\n\r\nKirill Zubovsky (37:45.548)\r\nYou get tired coding and if something before took a week because you got into a bunch of road bumps, you have to figure something out, you have to go read the documentation and now I did the same thing in four hours, well, I have the rest of the week to do other stuff. Like I'll still work, I'll still do more stuff. Just like, you know, I'm not blocked anymore. It's extremely more efficient.\r\n\r\n\r\nNikolas Hulewsky (37:53.765)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (38:00.08)\r\nThat's awesome.\r\n\r\n\r\nNikolas Hulewsky (38:05.028)\r\nYou're just more efficient. You're not, it's not that, yeah, you're not eliminating anybody's job. You're just more efficient. Dude, Krill, this was amazing. Thank you so much. Okay, so tell the people, your website, your newsletter, kind of where you're building.\r\n\r\n\r\nKirill Zubovsky (38:20.206)\r\nIf you want to subscribe to my newsletter, learn more about AI, it's novice.media. And my website is my full name.com, kirozovsky.com. If you want to check out Scoutsy, when it comes out, I'll put it in my newsletter. So basically just subscribe to novice.media and I'll share everything.\r\n\r\n\r\nNikolas Hulewsky (38:40.048)\r\nOkay. How big is your newsletter?\r\n\r\n\r\nKirill Zubovsky (38:44.31)\r\nNot big. We need to make it substantially bigger. Like 200 subscribers.\r\n\r\n\r\nNikolas Hulewsky (38:46.586)\r\nGive me, come on, give me a number, let's grow it. All right, dude, let's get to a thousand. Let's get it to thousand, baby. There's no reason. Your stuff's too cool to not be a larger newsletter. Dude, this was rad. Thank you so much.\r\n\r\n\r\nKirill Zubovsky (38:51.736)\r\nLet's, I'd love that. I'd love that. Yeah. Thanks. Yeah, it was great too. We can do it again. Like we can do it weekly if you want to, know. I'm happy to share it. It's so much fun.\r\n\r\n\r\nNikolas Hulewsky (39:01.136)\r\nWe will, we will stay, all right. Stay on.",
  "metadata": {
    "duration": "",
    "date": "2025-04-03",
    "platform_source": "Google Drive"
  }
}