{
  "episode_number": "72",
  "episode_title": "How to Start a Negative COGS Business with Chris Koerner",
  "guest_name": "Chris Koerner",
  "business_name": "Not Specified",
  "transcript": "﻿Nik (48:15)\r\nOkay, yes sir.\r\n\r\n\r\nChris Koerner (48:20)\r\nAll right. This isn't a billion dollar idea, but this is something that someone could start this afternoon. Okay, you ready?\r\n\r\n\r\nNik (48:30)\r\nOkay.\r\n\r\n\r\nChris Koerner (48:32)\r\nOn Instagram, they have a feature called Close Friends. Are you familiar with that? So if you put\r\n\r\n\r\nNik (48:38)\r\nHmm. I think so actually, but yeah, go ahead.\r\n\r\n\r\nChris Koerner (48:43)\r\nSo normally when you post a story, it is for the world to see. But if you add your close friends to the close friends folder, so to speak, then when you post a story, it will only show to them. Okay. And when you do post a story into close friends, it prioritizes it. Instagram puts it in the beginning of your friends' stories and they can see that they're in your close friends, right? So they feel a little special and they'll see it. So what that means is,\r\n\r\n\r\nNik (49:06)\r\nMm\r\n\r\n\r\nChris Koerner (49:11)\r\nThe views on your story go way, up. Okay. Now I, who was it? was, it was like Rihanna or Kim Kardashian or someone right after this feature came out, they somehow added all of their millions and millions of followers to close friends somehow. no, no. Like they paid someone to do it and their engagement went crazy and there are a few people\r\n\r\n\r\nNik (49:29)\r\nLike on accident?\r\n\r\n\r\nChris Koerner (49:39)\r\nanecdotally here and there that do it. And I've read message boards, I've gone deep, I've looked at forums and your engagement goes up three to six X on your stories. Okay. So here's what that means. So when I post a story with a call to action, let's say like, our school scrape, right? We talked about, we scraped Alex Hormozi's list of the top 1000 school groups, SKOL, and I posted a story to Instagram and I said, Hey, I scraped this, it away for free.\r\n\r\n\r\nNik (49:48)\r\nOkay.\r\n\r\n\r\nChris Koerner (50:08)\r\nsubscribed to my newsletter to get it. And I got like 23 ,000 views on that story, which is about 10 % of my total followers. And I got like 1500, 2000 email subscribers, which is great. But it's a ton. But if I would have been able to add all of those Instagram subscribers to close friends, theoretically, it could have been three to six X that amount, both the views and the subscribers. Okay, so\r\n\r\n\r\nNik (50:22)\r\nThat's a time.\r\n\r\n\r\nChris Koerner (50:37)\r\nI went to Upwork and I found people that can do this. There's not a lot. It's really, really hard to find someone that can do this. There's some custom code involved. but it is possible. mean, people have done it. So of course it's possible to do this. So my idea is to reach out to people that have 10, 50, a hundred thousand, 500 ,000 million followers and offer to do this for them for a flat fee. Because what I was being charged to do this, I haven't done it yet, but I will is like,\r\n\r\n\r\n30, 40, $50 to build this out for me once. So build it once, sell it a thousand times. You could charge a hundred, 500, $1 ,000 because for all the people out there, there are many, people out there that are monetizing their business on Instagram. You're giving them three to six X more engagement for a flat, flat one time fee.\r\n\r\n\r\nWhat do we think?\r\n\r\n\r\nNik (51:34)\r\nget that this would be business for you because you're already doing it, but how would somebody listening to this say, I could do that business?\r\n\r\n\r\nChris Koerner (51:43)\r\nbecause they will offer this as a service to people on Instagram that could make a lot more money if they had all of their followers and close friends.\r\n\r\n\r\nNik (51:51)\r\nOkay, so it's just two Instagram influencers essentially that are selling a product. Like that's the target demo.\r\n\r\n\r\nChris Koerner (51:56)\r\nMm -hmm. Which there are millions of, like, way more than I ever thought.\r\n\r\n\r\nNik (52:00)\r\nRight. Right. I'm just saying they wouldn't be going to like the business down the street and offering to do this for them on Instagram. They'd be going to someone who's an influencer that sells a product.\r\n\r\n\r\nChris Koerner (52:11)\r\nYeah, I mean, they could go to the restaurant that has 30 ,000 followers that post, you know, appetizer discounts in their story. Theoretically, anyone with a business or a personal brand that monetizes it somehow on Instagram could be a customer of this.\r\n\r\n\r\nNik (52:27)\r\nDude, the creator economy is just so interesting because there are so many ways to monetize it that have not yet been exploited. 30 years ago, before we had social media, how were products conveyed to people? They were either in print, in a newspaper, they were either in a magazine, they were in radio, or they were in television. Those are like pretty much the channels. Some type of print media, radio.\r\n\r\n\r\ntelevision. And a few companies that had the distribution really controlled what got out there. And not just the pricing of it, but also the supply of of what was able to be marketed. And now you've got people who have built micro businesses, they're making a couple hundred thousand dollars a year, and they've got an audience that can sell products to people. And it's like, so it's like opened up this world of\r\n\r\n\r\nadvertising that just didn't exist before and people are still trying to figure out the best way to do it. And this is an example of that. Or it's like, Instagram just introduced close friends. Hmm. I wonder if I could build a business off of this that would improve our advertising metrics. And it turns out you can because if people are close friends, that you're going to improve the rate at which people subscribe to your newsletter or see the product or buy or purchase the product, etc. So I just, it's not really an idea here. I'm just\r\n\r\n\r\nChris Koerner (53:44)\r\nMm\r\n\r\n\r\nNik (53:54)\r\nIt's crazy to me that every week there's like a new idea for how to better leverage these platforms for distribution.\r\n\r\n\r\nChris Koerner (54:03)\r\nI've got another one for you. So kind of along the same vein, I don't know who follows me on Instagram, right? I can click on my followers and swipe and I can see them, but there's 230 ,000 of, I don't know who they are. Is there anyone cool or important follows me? I don't know. I'd like to know. Maybe we could, we could do a collaboration somehow. So I, I paid a virtual assistant on Upwork a hundred dollars and they scraped\r\n\r\n\r\nNik (54:04)\r\nokay.\r\n\r\n\r\nProbably not.\r\n\r\n\r\nProbably not.\r\n\r\n\r\nChris Koerner (54:32)\r\nall of my followers into a spreadsheet. And this was actually very hard to do because I never found some, if someone finds this, please let me know. I never found a third party app that will do this for you because of Instagram's API limitations. I found one Chrome extension that will do it, but they throttle you and they'll cut you off after like one or 2000 scraped. You with. Yeah. So I found, I found a guy.\r\n\r\n\r\nNik (54:55)\r\nand you've got 230 ,000. So that ain't gonna work.\r\n\r\n\r\nChris Koerner (55:02)\r\nHe charged a hundred bucks. took him two days and he got every single one of my followers in a spreadsheet. Now here's why that's valuable, Nick, because about 10 % of my followers list their phone number and or their email address in their profile. So I've got 20 ,000 emails now that I could email. I'm not going to add them to my, my newsletter cause they haven't opted in, but I could send them a cold email and say, Hey, I don't know if you know who I am, but you follow me on Instagram. I know this is random, but I send out a free business idea every week.\r\n\r\n\r\nNik (55:16)\r\nReally?\r\n\r\n\r\nChris Koerner (55:32)\r\nWould you like to opt into my newsletter? Right. So they'll say I convert 10 to 20 % of those and boom, with a few clicks, I get two or 3000 more email subscribers. So that's cool. Or I could go to all the people that have over a hundred thousand followers and say, Hey, let's do a collaboration somehow. Like you're in business. I'm in business. We're both on Instagram. Maybe there's some way we could work together. So my whole thesis is it is really valuable for people that are on Instagram as a business owner to know who follows them. Okay.\r\n\r\n\r\nbecause it's not who you know, it's who knows you. So if you are reaching out to influencers with this pitch about adding people to close friends, this is another pitch. It's just, hey, do you mind if I send you a spreadsheet of all of your followers?\r\n\r\n\r\nNik (56:05)\r\nMm\r\n\r\n\r\nOkay, so it's just a spreadsheet. It's not a spreadsheet with like analysis, identifying who, because how would you identify who the valuable followers are?\r\n\r\n\r\nChris Koerner (56:21)\r\nIt could be like.\r\n\r\n\r\nThey have, they have Google sheet extensions where you can integrate open AI into your Google sheet, into a new cell. And you can say, Hey, I want you to just, this is what I do. I sell, cookies to wedding planners. I want you to tell me if any of my followers are interesting or could collaborate with me somehow. So you could send it to them. Like with that already done, because most people won't have ideas. They won't know what to do with them.\r\n\r\n\r\nNik (56:34)\r\n.\r\n\r\n\r\nChris Koerner (56:52)\r\nSo part of the pitch has to be implanting an idea in them.\r\n\r\n\r\nNik (56:56)\r\nAnd is the scraping just the 10 % that have the phone number and email or is it everybody?\r\n\r\n\r\nChris Koerner (57:00)\r\nEveryone. So it's our first name, last name, username, URL, if they follow you or not, if their profiles verified or not, phone number, email address, location, if it's listed website, if it's listed.\r\n\r\n\r\nSo you could say, hey, for 300 bucks, I'm gonna add all your followers to close friends. For 500 bucks, I'm gonna do that and send you a scrape of all of your followers.\r\n\r\n\r\nAnd then you pay, you just outsource all of it.\r\n\r\n\r\nNik (57:31)\r\nI wonder if you could also do that. Like, let's say there's somebody who's trying to grow a business and they have a business that sells, I don't know, healthy water. No, that's a stupid one. Healthy protein shakes. Healthy protein shakes. However you define healthy protein shakes. And you want to qualify which influencer you think is going to be the best for your brand. Could you do some analysis of their followers? Or this could be for the influencer, right?\r\n\r\n\r\nChris Koerner (57:45)\r\nadat\r\n\r\n\r\nNik (58:01)\r\nIf you're a podcaster, like we are, and somebody wants to come and buy ad time, they're going to ask you for your download information, right? They want to know how many people are actually downloading and listening to your episodes. So this could be something where you provide it for Instagram influencers to say, like, this will give you the profile of your followers that you can then give to people who are asking you for information about marketing with you. Yeah, it's like a media kit, but it's like an audience profile kit.\r\n\r\n\r\nChris Koerner (58:22)\r\nLike a media kit. Yeah.\r\n\r\n\r\nNik (58:28)\r\nThat would be interesting.\r\n\r\n\r\nChris Koerner (58:31)\r\nOr it could automatically make a media kit for you based on everything it learns from your follower base. Like, all right, you can charge this much per reel. This is the average age of your follower and all that.\r\n\r\n\r\nNik (58:44)\r\nYeah, I like that. There's like applications that I, you can't even think of all the applications.\r\n\r\n\r\nChris Koerner (58:46)\r\nAll right, cool.\r\n\r\n\r\nNik (58:54)\r\nThat was a really stupid thing to say. I'm so dumb. You can't even like think of all the ideas. There's so many of the ideas. I sound like Kamala Harris, dude. Yesterday was today yesterday and tomorrow will be today yesterday's tomorrow.\r\n\r\n\r\nChris Koerner (59:03)\r\nTim Robertson.\r\n\r\n\r\nYes.\r\n\r\n\r\nNik (59:10)\r\nAll right, you ready? I wanna go through with you.\r\n\r\n\r\nTop 10. We talked about a similar idea to this a couple of months ago. But the top 10 media accelerated home services businesses. Are you ready? All right. The thesis that we had a couple of months ago was that you could use YouTube, Instagram, Facebook, whatever, to make videos that people would then click into.\r\n\r\n\r\nto promote your services. Now we were talking about it from like an influencer standpoint because this one guy, goes around and he cleans up people's yards that are just a total mess and he's subscribed. He's gotten millions of subscribers. He makes a lot of money because it's really cool to see that time lapse. But then we started talking about like, what are some other industries or businesses that you could do this with? Well, I started thinking about if you were the side hustle type and you wanted to start a business and you didn't have money for marketing and you didn't really know what else to do.\r\n\r\n\r\nWhat are the top 10 home services businesses that would work really, really well on Instagram, YouTube, Facebook, by posting time -lapse videos of your projects? So that's the thesis here, okay? Numero uno, pressure washing. Like, dude, I don't know if you resonate with this. I think every man will. I could watch a 30 -minute video of somebody pressure washing.\r\n\r\n\r\neither like a really dirty surface a carpet there's two different in the carpet pressure washing video. the rugs my gosh. It's like it's amazing. And they and like we all do the same thing. We're like, Okay, now I'm to do a square and I'm going to clean inside the square like\r\n\r\n\r\nChris Koerner (1:00:47)\r\nyeah, the rug ones.\r\n\r\n\r\nYeah, it was a.\r\n\r\n\r\nIt's actually super embarrassing. Jesse caught me in the middle of the night watching one of those. just, I'm just kidding. We're struggling through it.\r\n\r\n\r\nNik (1:01:02)\r\nReally? I'm sorry. It's like, it's like eight years ago when I went to go visit Chris and I was staying at his house and I was I was downstairs on the couch. I had my laptop up and open and I was watching a movie and Chris Chris was like coming down the stairs and he's like, my gosh, it's midnight. Nick's watching something. What if he's\r\n\r\n\r\nChris Koerner (1:01:10)\r\nYes. Never forget this.\r\n\r\n\r\nKeep this in, Mohammed.\r\n\r\n\r\nI could see like the glow around the corner and I'm like, I thought he was asleep. And I'm like, this guy, I'm about to, okay, what's he looking at?\r\n\r\n\r\nNik (1:01:33)\r\nHe's like, what if he's watching porn? my, Chris turns the corner and there I am, 32 year old father of a few children. And I was watching the Ice Age on Netflix and laughing my head off. I love kids movies. What can I say? All right. So pressure washing, I is number one. You ready for number two? This one surprised me, but I went and looked. Pool cleaning.\r\n\r\n\r\nChris Koerner (1:01:45)\r\nLaughing. Yeah in the middle of the night in my living room\r\n\r\n\r\nNik (1:02:02)\r\nto those videos. And there is like a combination of pool cleaning and pressure washing. If you've ever seen someone pressure wash a drained pool, forget about it. Forget about it. It's amazing. Number three, this is something I've been seeing a lot more recently, home cleaning. Where like, I saw this one video of this this like guy in China who had an apartment and this guy like smoked three packs a day for years and the walls were just caked.\r\n\r\n\r\nChris Koerner (1:02:04)\r\nMm -hmm.\r\n\r\n\r\nMm -hmm. Mm -hmm.\r\n\r\n\r\nNik (1:02:32)\r\nlike brown and he went and cleaned it and then it was like before and after and the afters like the apartments clean now and I'm like dude I would never want to live in that apartment but anyways amazing\r\n\r\n\r\nChris Koerner (1:02:40)\r\nYeah, I've never seen like a time lapse of someone cleaning a hoarder house. Like a video up in the corner of the room. I've never seen one of those. Have you? Those are good.\r\n\r\n\r\nNik (1:02:46)\r\nReally?\r\n\r\n\r\nyeah. my gosh, they're so good. Especially when they're doing a kitchen, a hoarders kitchen, because you're looking at that. And you're like, there's no way there's no way they can make that look good. There's like dead cockroaches in the sink. There's you know, feces on the ground like, and then by the end of the video, you're like, Wow, I mean, yeah, the house needs updating. But holy crap, how how was that even clean? Yeah, that dude, that one's that's amazing. Number four.\r\n\r\n\r\nChris Koerner (1:02:53)\r\nHmm.\r\n\r\n\r\nNik (1:03:18)\r\ntree trimming.\r\n\r\n\r\nChris Koerner (1:03:20)\r\nyeah.\r\n\r\n\r\nNik (1:03:21)\r\nParticularly hedge trimming like the trees or whatever. But like when you got those thick bushes, those thick bushes and people just start with those machines like you're giving someone a buzz cut. I don't. They're just so satisfying to see that thing get clean over time.\r\n\r\n\r\nChris Koerner (1:03:40)\r\nSo I'm with you on that, but I'm gonna push back a little bit on the first part. The actual tree trimming, that is just as good as the hedge trimming from an algorithm perspective, because all of these videos work because of one word, retention. The algorithm knows that you want to see what happens at the end, right? So if you've got a guy like 35 feet up in a tree with a chainsaw and he's strapped in and he's cut, like you gotta see where that's gonna land. Is it gonna hit the house?\r\n\r\n\r\nNik (1:03:51)\r\nReally?\r\n\r\n\r\nMmm.\r\n\r\n\r\nChris Koerner (1:04:10)\r\nis gonna hit the yard is gonna hit the guy is the guy gonna swing off it like those videos get tens of millions of views because people have to see the end result. It's not as visually satisfying as a hedge but they want to see the end. So the result is the same.\r\n\r\n\r\nNik (1:04:18)\r\nand you articulated.\r\n\r\n\r\nYou articulated it much better than I could, but basically what I'm doing here is I'm taking the end, the distribution and working backwards because I think that these are the types of videos that will have the best retention and the best and highest likelihood of you going viral that I think will then feed into your business. So that's why I picked these ones. right. Painting. I don't know if you you seen like these painters like painting a house or or anybody who does like a mural inside of a house. I know that's a little bit different than like a commercial residential painter, but like.\r\n\r\n\r\nChris Koerner (1:04:36)\r\nMm\r\n\r\n\r\nMm\r\n\r\n\r\nNik (1:04:51)\r\nDude, it is so fascinating because like for half of the video, you're just sitting there like, what are they doing? What is that? That color there? my gosh. Why are they? Why did they start up there? And then by the middle of the video, you're like, I think I think I see it. And by the end of it, obviously, it's amazing. But the time lapse of painting are incredible. Yeah.\r\n\r\n\r\nChris Koerner (1:05:06)\r\nCan I add to that? So there's a company, I don't know if they're local or nationwide, but all they do, this is all they do, is paint brick houses white and black. That's it. Yeah, yeah, like a year ago. it was just a, it was a throwaway post, right? I was scraping the bottom of the barrel. What am I gonna post? I post, and it blew up because I realized that there is this,\r\n\r\n\r\nNik (1:05:18)\r\nYou've posted about this, I think. Yeah.\r\n\r\n\r\nMm.\r\n\r\n\r\nChris Koerner (1:05:35)\r\nthis war going on in boomers minds about painting brick because everyone's convinced that if you paint brick, then the brick will like suffocate and the whole house will eventually explode. Like I've looked into it. There's like some pseudo science to it, but like not really. And so everyone, is the most polarizing thing ever. it looked, what happened to it? It looks so much better. everything's white now. Everything's white and black. And then the other half is like,\r\n\r\n\r\nNik (1:05:40)\r\nMm -hmm.\r\n\r\n\r\nChris Koerner (1:06:02)\r\nthat's the dumbest thing you could ever do that bricks gonna fall apart. It needs to breathe. The brick has to breathe. Like, so I think that someone needs to start a company that does that paints homes. And all they do is short form video. That's how they get all their leads. That's it because it goes viral. I've seen viral short form videos, anecdotally of like, like a DIY page, a husband and wife duo and like we just painted our house. What do you think and it blows up and they didn't expect it and I looked at the comments and sure enough, the\r\n\r\n\r\nNik (1:06:16)\r\nHmm.\r\n\r\n\r\nChris Koerner (1:06:30)\r\nThat brick has to breathe!\r\n\r\n\r\nNik (1:06:33)\r\nIt hit the brain. That's actually a cool side business. That could be a business in your local area, just approaching these businesses and saying, let me film some content for you. And you actually start doing it for free. Like, hey, let me film some content for you. I'll throw it up. If it gets hits, then you pay me. If it doesn't, like whatever.\r\n\r\n\r\nChris Koerner (1:06:43)\r\nMm -hmm. Mm -hmm.\r\n\r\n\r\nYeah, or it's just, let me film you. I'm gonna keep this. This is gonna go to my account. Do you mind if I just put a tripod here? And like, I'll give you some of it if you want to use for your own channel, but they don't know what your play is. Do you hear that?\r\n\r\n\r\nNik (1:07:06)\r\nYeah, I don't hear anything.\r\n\r\n\r\nChris Koerner (1:07:08)\r\nSome, hold on, something is ringing. This is really weird.\r\n\r\n\r\nI'm getting a phone call. I am freaking out right now.\r\n\r\n\r\nI'm going to go crazy. It's ringing in my ear and it's, I don't know where the freak is coming from.\r\n\r\n\r\nNik (1:07:31)\r\nLike a phone call ringing?\r\n\r\n\r\nChris Koerner (1:07:32)\r\nIt's like a ring I've never heard in my life. And it's not for my. It's like a weird phone ring like I've never heard this noise before.\r\n\r\n\r\nNik (1:07:36)\r\nIs it like a phone ring or is it just like a weird sound?\r\n\r\n\r\nChris Koerner (1:07:45)\r\nIt's not going away. It's not going away.\r\n\r\n\r\nIt's effing Instagram. Hold on. Someone... I'm so pissed. I'm about to go off on someone.\r\n\r\n\r\nNik (1:08:01)\r\ncalling you on Instagram?\r\n\r\n\r\nChris Koerner (1:08:03)\r\nYes.\r\n\r\n\r\nHello?\r\n\r\n\r\nIs this Meta Lee Rumpf NLMLS 1769105?\r\n\r\n\r\nNever call me again. I hate you. Okay. Sorry about that.\r\n\r\n\r\nI'm so pissed off. I don't know how like, how does Instagram allow that to happen? I'm so pissed off.\r\n\r\n\r\nShe just freaking killed my vibe.\r\n\r\n\r\nI'm a princess Nick. You can't kill my vibe. Okay. I just sent you a screenshot.\r\n\r\n\r\nNik (1:08:49)\r\nYou can't,\r\n\r\n\r\nI'm scared. I'm scared.\r\n\r\n\r\nChris Koerner (1:08:58)\r\nLike what are you gonna get from me? What's the play here? What's the angle? I don't follow you.\r\n\r\n\r\nNik (1:09:04)\r\nWhat?\r\n\r\n\r\nChris Koerner (1:09:08)\r\nmy gosh. No, but like we were in the call. I just, my gosh, dude, I am the biggest hypocrite in the world when it comes to like cold outreach. I will cold call someone until the cows come home. But when someone calls, cold calls me, I am an angry man. I it's the most hypocritical thing.\r\n\r\n\r\nNik (1:09:09)\r\nDid she say anything?\r\n\r\n\r\nYou went hard.\r\n\r\n\r\nBye.\r\n\r\n\r\nYeah, yeah, it's okay. It's okay. We've all been there.\r\n\r\n\r\nChris Koerner (1:09:36)\r\nIt's okay if you're a hypocrite if you're self -aware about it. That's what I say. All right. All right. Sorry. Keep going.\r\n\r\n\r\nNik (1:09:39)\r\nThat, I think that says it in the Bible. All right. All right. So that was painting number five or number six. You'll know this one, landscaping. Dude, that video, that guy on YouTube, so satisfying. So, and I don't know what it is, but like my favorite, my favorite is when he gets that little dirt that's come over on the cement, the sidewalk.\r\n\r\n\r\nChris Koerner (1:09:54)\r\nYep. SB mowing.\r\n\r\n\r\nYou sound like Theo von right now.\r\n\r\n\r\nNik (1:10:09)\r\nI know I'm trying. He's just like just you know a little overlap right there on the sidewalk.\r\n\r\n\r\nChris Koerner (1:10:13)\r\nIt's like a like a little dirt, like a little little crumble. It's like like a little little mound of clay. It's like that Louisiana mud.\r\n\r\n\r\nNik (1:10:18)\r\nLike a little pie.\r\n\r\n\r\nBut you know what I'm talking about where like it you know overtime dirt just like accumulates and like integrates with your lawn, but it shouldn't have ever been a part of the sidewalk. And so you gotta go in there and you gotta cut it out like when you remove that so he gets the shovel going. my gosh that that is the most satisfying part of the shot. Bar none. Alright, next one window washing. Not not as satisfying, but.\r\n\r\n\r\nBut when they get the little squeegee, whoop, whoop, whoop, whoop, those guys are just like, and they end it and it's clean. It's amazing. All right. Second to last one. Gutter cleaning. It's got to be on there. Gutter get freaking disgusting. Lots of good content with gutter cleaning. And then my personal favorite at the moment, I mentioned it up front. Carpet cleaning. Dude, when you, when you watch these carpet cleaning videos.\r\n\r\n\r\nChris Koerner (1:10:58)\r\nMm -hmm.\r\n\r\n\r\nNik (1:11:21)\r\nwhen they go into like a just a disgusting house and they get that carpet from like, you know, mocha brown to pearly white. my, it's so satisfying. It's so satisfying.\r\n\r\n\r\nChris Koerner (1:11:32)\r\nSo what's the play here? What's the angle?\r\n\r\n\r\nNik (1:11:37)\r\nSo what I'm saying is if you're a side hustler and you want to get into business and even thinking, you know, you've been testing the water, you've been thinking, maybe I want to do a painting company. Maybe I want to buy an HVAC company. Maybe I want to buy a plumbing company. You maybe I want to get a sweat, whatever a sweaty business. I would start here and work your way back because I think that marketing brand awareness are incredibly important, especially as you're starting out. You're not going to have the same budget as everybody else.\r\n\r\n\r\nSo you have to do things that don't scale. You have to do the guerrilla marketing tactics. And I would pick one of these 10 to start with. Now, if you're, you know, your whole life, you're like, my name is Luigi and I'm just passionate about a plumbing, right? Like that's, that's just you. It's in your family. It's in your blood. Cool. Go be a plumber. But if you're agnostic and you just want to get into business, I would start by reverse engineering and taking a look at at least these 10 and say, okay, these are going to be a good distribution channel for me. Which one of these do I think I can scale up quickly and get business quickly? And then\r\n\r\n\r\nUse the distribution channel as gasoline on your business growth.\r\n\r\n\r\nChris Koerner (1:12:39)\r\nHow does that look though? Like if you get these videos get millions of views, how many of them are going to be in your local area where you can actually service those customers?\r\n\r\n\r\nNik (1:12:47)\r\nWell, that's the amazing thing is like there's Google business profile, which you know is incredibly important. When, somebody goes onto Google maps and they search for something, especially for home services businesses, if you can rank high, your business is going to get more leads. I mean, that's just the way that it works because people see you, there's higher trust, et cetera. But on these Google business profiles, you can post these videos. So it's not just, YouTube views are going to fuel this. You're also posting things.\r\n\r\n\r\nto the Google business profile that are eye catching. The people are like, that, whoa, that's interesting video, right? Like it just naturally draws them to your company. And it does add, it's weird, but it does add like an air of legitimacy. Cause it's like, now I've seen some of his work. Cool. I like this guy. I'm gonna, I'm gonna go out and hire him. So I'm not necessarily saying go post it to YouTube, go viral, and then feed your business. I'm saying you're going to be setting up your Instagram and your Twitter and your Facebook pages. Anyways, this is the type of content you should be filming.\r\n\r\n\r\nhosting and maybe it's a big hit and it goes viral like nationally, but most likely it's not going to do that, but it will help you locally close the deal with many people.\r\n\r\n\r\nChris Koerner (1:13:59)\r\nCan I give you an idea? Here's another option.\r\n\r\n\r\nNik (1:14:01)\r\nYes.\r\n\r\n\r\nChris Koerner (1:14:03)\r\nI think you go find a nationwide franchise or of one of these brands and partner with them and you just start a YouTube channel that captures leads and you sell those leads to them, potential franchisee leads. I think that's why a lot of these guys that own a home service business, it's very eye catching, end up just selling a course because that's the only way they're able to capture all this traffic because it's worldwide traffic, right? So they're, they're\r\n\r\n\r\nNik (1:14:29)\r\nHmm.\r\n\r\n\r\nChris Koerner (1:14:31)\r\nmain monetization angle, kind of like Johnny Robinson goes from, you know, I'm making 20, 30 grand a month on my actual business, which is great, but I can make 10 times that by selling a course because I have all these eyeballs from people that find it interesting. So I think a different angle to that could be capturing all this content and then selling the leads to that company that paints houses, right? Or paints brick houses or to a rolling suds that sells pressure washing franchises. I think that could make you a lot more.\r\n\r\n\r\nthan selling courses because a franchisee lead is worth 10 to $50 ,000.\r\n\r\n\r\nNik (1:15:10)\r\nDone. I love it. You just upleveled it. Perfect.\r\n\r\n\r\nChris Koerner (1:15:16)\r\nI just had an idea, dang it. I got an idea on the fly that I wanted to go right into.\r\n\r\n\r\nright there. You can't interrupt greatness.\r\n\r\n\r\nwait, no, there it is. No.\r\n\r\n\r\nHold on. okay. I remember. remember. All right. So thank you for bringing up home service businesses, because I've got a little tidbit for you. Little, little preview of a future pod and a little tidbit. So I'm on Instagram. Okay. You with me? Hey, Hey Nick, I'm up here. Okay. Sorry.\r\n\r\n\r\nNik (1:15:54)\r\nOkay, yeah.\r\n\r\n\r\nChris Koerner (1:16:04)\r\nI find these guys on Instagram, 19 year old college students from Chicago. One is a student at University of Nebraska. One is a student at University of Missouri. And they grew up together. They were best friends in high school. And they went home for the summer, Chicago suburbs. And here's what they did. You ready? You with me? One of their neighbors, they live near or on a lake. And one of their neighbors says, hey, guys, you home for the summer? Yeah, I'm installing a dock.\r\n\r\n\r\nNik (1:16:22)\r\nOkay. I'm here, I'm here.\r\n\r\n\r\nChris Koerner (1:16:34)\r\nin my lake, can you help me do that? I'll give you 25 bucks an hour. Sure. So they help them install a dock. And then the other neighbor is like, Hey, can you install my doc? And they're like, Yeah, sure. And then another neighbor sees him. And they asked something different. They say, Hey, what do you what do you do about all these weeds that keep floating up towards the dock? Because it's really gross. My grandkids want to swim off the dock. But it's just algae and seaweed everywhere. What do do with that? And they're just like hustlers just trying to make money. Like, we could try to clean it.\r\n\r\n\r\nI don't know. I don't know what anyone does here. And so they get these rakes, like literally a leaf rake, and they stand in the water waist deep and they just rake up this seaweed because it's stuck to the floor of the lake. Yeah. And it's like very hard work. Just, I mean, this seaweed is waterlogged and they're lifting it onto the dock. They're lifting it onto the backyard. It takes them hours and they charge like 500 bucks. And they're like, huh. And it's such a visual thing, Nick, like you were just talking about that\r\n\r\n\r\nNik (1:17:14)\r\nWhat? Okay.\r\n\r\n\r\nIt is. It is.\r\n\r\n\r\nChris Koerner (1:17:32)\r\nAll the neighbors come out and they're like, Hey, can you do mine? Can you do mine? They keep raising their prices. No one says no 500 bucks for a morning worth of work. 700 bucks for a morning where the work. Now this is hard work. Like there there's no chemicals. There's no automation. There's no machines. They literally have rakes in their hands and they're standing in this water for hours at a time, but they're making really good money. So they do this a year or two ago. Then they come back home and they're like, no more dock installation. Let's only clean ponds and lakes.\r\n\r\n\r\nAnd there are companies that do this, but they all spray chemicals and it doesn't get rid of the actual weeds. It just kills them. And so the lake is still ugly. The weeds just don't spread as much. And so literally the only way to do this without chemicals is the hard way. So then, this is such a good, what? Yes. So then they start posting videos on Instagram and Tik TOK and they get 10, 20, 30 ,000 subscribers and it's very visual and they put it, they put a camera up.\r\n\r\n\r\nNik (1:18:21)\r\nRaking, that's the hard way. Yeah, yeah.\r\n\r\n\r\nAre you a TikTok?\r\n\r\n\r\nChris Koerner (1:18:33)\r\nAnd some of their videos hit a million or 2 million views. And this guy in Chicago worth tens or hundreds of millions of dollars that owns this massive boomer, like a forklift business or something, but with like nationwide presence, he sees them on TikTok, the 63 year old. And he's like, I like you guys. You remind me of me when I was young. I want to help you out. And they're like, okay. It's like, have you ever seen this? He sends them a link to like this boat that does what they're doing. It helps clean out weeds from lakes.\r\n\r\n\r\nAnd they're like, I didn't know this exists. It's a hundred thousand dollar boat. And these guys are broke college students. And he says, let me tell you what, how about I buy this boat and I'll insure it and I'll rent it out to you. And they're like, yes, please. So he puts a hundred grand down, pays cash for it, rents it out to him for very, very fair rate. And now they have a boat. Now they're posting videos of them on their boat, cleaning weeds. And they're a lot more efficient. They have more business than they can handle. And\r\n\r\n\r\nSo like, I followed them on Instagram, and they saw that I followed them and then they DM me like, my gosh, thanks for following me, bro. And it's like, thank you for DMing me. You guys are awesome. You want to talk? Yeah, I'm like, you want to talk and you know, coming from me to like want to hop on a call. That doesn't happen. That didn't happen. So we talked yesterday. And I heard that you know, 15 minutes of their story. And I'm like, you're coming on the pod. So tomorrow, they're gonna they're gonna be on the pod. We're gonna I'm gonna interview them. Yeah.\r\n\r\n\r\nNik (1:19:43)\r\nAre you gonna get them on?\r\n\r\n\r\nyeah, yeah, it does not happen.\r\n\r\n\r\nThat's amazing.\r\n\r\n\r\nChris Koerner (1:20:03)\r\nAnd like, this is an amazing business because no one's doing it. And it reminds me of the quote from like 1 -800 -GOT -JUNK. And he said, as long as pianos weigh 800 pounds, there's always going to be a business for starting a moving business. That's always going to be around, right? Because pianos are heavy and it sucks and it's a crappy business. So we'll always stay in business basically, as long as pianos are 800 pounds. So it's like, this is like the sweatiest, ugliest, most manual\r\n\r\n\r\nNik (1:20:25)\r\nYeah, yeah.\r\n\r\n\r\nChris Koerner (1:20:32)\r\nstartup in the world, which means it's an amazing opportunity for anyone and will be for quite some time. What do we think?\r\n\r\n\r\nNik (1:20:38)\r\nDude, that's awesome. I love it. I think that's awesome. Yeah, I can't wait to hear the episode.\r\n\r\n\r\nChris Koerner (1:20:41)\r\nIsn't that cool? So it's somewhat seasonal depending on where you live and it's somewhat geographical depending on like what type of seaweed grows in these ponds and lakes. But they said like it pretty much works anywhere in some places just better than others. I'm like guys you need to like franchise like you already have a social media presence like you could use that to sell franchises like put all your SOPs in a Google Drive. It doesn't need to be franchised. It could be licensing or whatever or sell a course or whatever. But I just I think these guys are freaking awesome.\r\n\r\n\r\nand I'm excited at all.\r\n\r\n\r\nNik (1:21:11)\r\nDude, that's right. I love it. I got, I got one for you. You ready? I got this text this week. Hey Nick, I'm in Dallas. I'm Dallas based too. People always think I'm Dallas based, which is funny. Anyways, I work in, in the pallet recycling and waste industry. I was listening to your podcast and we think the same way about B2B. I'd love to buy you lunch sometime. So I was like,\r\n\r\n\r\nChris Koerner (1:21:14)\r\nYeah. So, yeah.\r\n\r\n\r\nNik (1:21:39)\r\nI'm not in Dallas. I can't buy you lunch. I was like, what are you thinking? It's like, well, one of my customers throws away thousands of tons of good, but not possible to sell vegetables. It's all going to the landfill. So I was like, what do you mean? He's like, well, they tried to sell them, but nobody can take them all. So they just have all this excess inventory of vegetables. And I was like, okay, that's, that's interesting. And so I was like, well, like what made you reach out? He's like, well,\r\n\r\n\r\nThe way that they dispose of these is they've got to put them on pallets and then ship them out, right? I want you to guess this guy's their vendor. He does their pallets. How much does this company spend on pallets a month?\r\n\r\n\r\nChris Koerner (1:22:24)\r\nHmm. Well, I was in this business a little bit with send eats because we used to have to buy pallets. that that's a whole industry, you pallet recycling, pallet repair, new pallet construction sales. geez. I don't know. I have no idea, but I know they're like five to $30 a piece, depending on the quality.\r\n\r\n\r\nNik (1:22:43)\r\nThis company apparently spends $30 ,000 a week in pallets.\r\n\r\n\r\nChris Koerner (1:22:50)\r\nCrazy.\r\n\r\n\r\nNik (1:22:51)\r\n$30 ,000 a week, so $120 ,000 a month. And it got me thinking about the reason he reached out was because of the episode where we were talking about negative cogs. Where it's like, hey, you you're obsessed with a business that could be negative cogs. So I wanted to bring this up. What kind of a business could we do with thousands of pounds a month of vegetables that they're literally just throwing away into the landfill?\r\n\r\n\r\nChris Koerner (1:22:58)\r\nYep.\r\n\r\n\r\nEasy. Easy. Eco scraps. I tweeted about this a month or two ago, those guys in Provo that started eco scraps, they took they got paid by grocery stores to take produce that was old. And then they took it to a warehouse and they mixed in some sawdust and they mix it all up. They put it in a shredder and they let it sit for three months turned into organic compost. They bagged it up, sold it to Home Depot for $5 a bag. And then\r\n\r\n\r\nNik (1:23:16)\r\nGo on.\r\n\r\n\r\nChris Koerner (1:23:39)\r\nthe major billion dollar company bought them out like 10 years ago. Yeah. What's the name of them?\r\n\r\n\r\nNik (1:23:45)\r\nWhat, really?\r\n\r\n\r\nSo like, know it's kind of negative cogs, but you'd still need to pay for the shipping out, right?\r\n\r\n\r\nChris Koerner (1:23:57)\r\nye well, like basically their pitch was they went to a grocery store and said, Hey, how much do you spend on your trash disposal? $2 ,000 a month. Okay. Can we do it for 1500 done? So they were still profitable on the transportation, but they got paid to take this stuff for free.\r\n\r\n\r\nNik (1:24:19)\r\nI got paid to take this stuff for freaking free. That's an\r\n\r\n\r\nChris Koerner (1:24:22)\r\nYeah.\r\n\r\n\r\nNik (1:24:24)\r\nWell, and this supposedly is thousands of pounds. Should we do it? Should I reach out? Should I reach out to him? He's in Dallas. Yeah. I don't want to give his name because he hasn't given me permission. So.\r\n\r\n\r\nChris Koerner (1:24:29)\r\nNo. Is he in Dallas?\r\n\r\n\r\nMan, what else could you do with that? I don't know what else you could use that for.\r\n\r\n\r\nIt's going to be like.\r\n\r\n\r\nNik (1:24:42)\r\nIf there's a listener who's in Dallas that thinks that they could capitalize on this, reach out to us.\r\n\r\n\r\nChris Koerner (1:24:51)\r\nYeah, so there was an\r\n\r\n\r\nNik (1:24:51)\r\nHe said he was... God.\r\n\r\n\r\nChris Koerner (1:24:54)\r\nThere was another business that went around to like all the cold press juice shops and took. So when you, when you juice a freaking carrot, right? You've got all the juice and you've got all the pulp and they just throw, throw that pulp away. So there was another company that would just take all the pulp for free and make like fertilizer out of it. the hard part with both of these is you've got to like shred it up in like this huge industrial food shredder. I almost started this business in Tuscaloosa and those\r\n\r\n\r\nthose things are a lot of money because if you don't shred it up, then it's going to sit. It has to sit for like three years instead of three months. so you need a truck, you need a warehouse, you need a food shredder, and then you need to buy sawdust and mix it in. Cause this yeah, chem long chem long. That was the company that bought out eco scraps. True green, true green. Yeah. True green by chem long, vice versa.\r\n\r\n\r\nNik (1:25:28)\r\nWhat?\r\n\r\n\r\nWell, I thought you'd like that story because somebody reached out to me about the negative cogs business.\r\n\r\n\r\nChris Koerner (1:25:52)\r\nThat is a good story.\r\n\r\n\r\nNik (1:25:54)\r\nAll right, leave him wanting more.\r\n\r\n\r\nChris Koerner (1:25:56)\r\nAre we ha\r\n\r\n\r\non.\r\n\r\n\r\ntrying to think if we should add just a few more minutes.\r\n\r\n\r\nNik (1:26:06)\r\nOkay, go for it.\r\n\r\n\r\nChris Koerner (1:26:19)\r\nThe last one was like 45 minutes. It's like 47. No, we're okay. Yeah, we're good. We're good.",
  "metadata": {
    "duration": "",
    "date": "2024-10-18",
    "platform_source": "Google Drive"
  }
}