{
  "episode_number": "213",
  "episode_title": "From Amazon PM to $1M Newsletter Business in 9 Months with Nic Conley",
  "guest_name": "Nic Conley",
  "business_name": "The Follow-Up (newsletter)",
  "transcript": "﻿Nikolas Hulewsky (00:01.41)\r\nAll right, Nick Connelly, I'm stoked to have you because you are the avatar that people look at and say, man, I want to be that guy. You were working at Amazon as a product manager, probably making really good money. I'm just going say a couple hundred thousand dollars a year. You leave Amazon and within nine months, sell a million dollars worth of ad sponsorships. You've got multiple revenue streams. Like the journey has just been.\r\n\r\n\r\nsort of crazy if you've got a newsletter with over 22,000 subscribers, you've got a YouTube channel with over 10,000 subscribers, so you're making money a bunch of different ways. So my first question to you is, which one is your favorite? Which baby is your favorite baby?\r\n\r\n\r\nNicholas Conley (00:45.361)\r\nWow, well thank you for that intro. That made me feel good. That question is tough. So the newsletters I would say are like my first born. They'll always have like a special place in my heart. But YouTube is like the baby that, you know, the newborn that I'm like, there's something interesting here.\r\n\r\n\r\nand I'm really excited to explore it. YouTube's super exciting to me right now, and I really think everybody should be on it, like no matter what business that you're in, I think there's a spot for YouTube in everyone's business.\r\n\r\n\r\nNikolas Hulewsky (01:21.538)\r\nWhat were you doing before you jumped in full-time to entrepreneurship? You're working at Amazon, right?\r\n\r\n\r\nNicholas Conley (01:26.011)\r\nYeah, so I would say like, you I've always been into entrepreneurship stuff growing up. was the guy that, you know, I grew up in Massachusetts outside of Boston. So I was knocking on all my neighbor's doors and, know, I'd come back after a snow day with like $300 in cash in my pocket, then graduated to like flipping Jordans, right? was the, you know, 16 years old in high school. We camp out all night outside of Footlocker and, and buy up as many pairs of Jordans as we could and then flip those on eBay. So like, I always had sort of that background.\r\n\r\n\r\nNikolas Hulewsky (01:41.006)\r\nAmazing.\r\n\r\n\r\nNicholas Conley (01:56.153)\r\nAfter school, I just got into, into sales, a few different more like startup companies, a big VC backed company that they went bust. and then I ended up with this company called drone genuity. and it's sort of like Uber or, like, yeah, Uber for drone pilots. So if you go on Google right now and type in like, you know, drone pilot near me, drone genuity is probably going to show up, one of the top five results. And basically you go on there and we're like a broker for, for drone pilots. Right? So we built out a massive map.\r\n\r\n\r\nof drone pilots all over the country. And we basically bid those jobs out. So that was like my first peek behind the curtains of like, it was me, the founder and like two other people working like a co-working office. It was really just like a bedroom converted into like a co-working office. And that's where I got to see like, okay, every dollar that comes into this company basically comes through my sales calls. Like this is, this is, you know, I really got to see like building something bootstrapped from the ground up.\r\n\r\n\r\nSo I feel like I cut my teeth there and then went to Amazon where, very much the opposite. I was still on a small team, but you're at a small team at, you know, a company with a million employees and very different scene.\r\n\r\n\r\nNikolas Hulewsky (03:11.146)\r\nWhy'd go to Amazon? You just wanted like to say you went to Amazon or you want a big company experience or what was the job? Payday?\r\n\r\n\r\nNicholas Conley (03:16.774)\r\nYeah, I think, I think at the time, like it's a little bit grass is greener, right? So it's like, Oh, you're telling me like I could go make double the money and like have Amazon on my resume and also like learn what they do at Amazon. That's different from smaller companies. Cause before that I'd only worked at smaller companies. Um, so I just really wanted to see what it was like working for the behemoth, the biggest company essentially, you know, in the United States. I was there for, I think just about three years. Um, so.\r\n\r\n\r\nNikolas Hulewsky (03:21.518)\r\nYeah\r\n\r\n\r\nNikolas Hulewsky (03:39.714)\r\nYeah, how long were you there?\r\n\r\n\r\nNikolas Hulewsky (03:45.449)\r\nthat's a good amount of time.\r\n\r\n\r\nNicholas Conley (03:47.046)\r\nYeah, yeah, yeah, totally. And what I did there is not relevant to anything I do now. I basically worked with the biggest Amazon sellers in the United States and helped them move over to Mexico and sell their stuff like FBA in Mexico. Which is, pretty random, but yeah, it's crazy what some of these sellers can do.\r\n\r\n\r\nNikolas Hulewsky (03:59.413)\r\nNo way, really?\r\n\r\n\r\nNikolas Hulewsky (04:04.792)\r\nWhat's funny is, so Chris, he has a company called Texas snacks. It's a three PL and he went and worked at Amazon for a couple of months. Yeah. Cause he's like, I'm like, how do they ship? How do they pack and ship and store and all that stuff. But he was in a warehouse. Like he worked the like, you know, 11 PM to 7 AM shift and he learned a ton from it. So you guys both worked at Amazon. Yeah.\r\n\r\n\r\nNicholas Conley (04:15.311)\r\nReally.\r\n\r\n\r\nNicholas Conley (04:30.693)\r\nYeah, yeah, we both have Amazon on our resume. That's awesome. That's incredible. It was high six figure. Well, the high one six figures. How do I say that correctly? Yeah, high ones. Yeah, just under. Yeah, yeah, I would say that. The cool thing about Amazon is when you work, I would say cool, depending on the person that you ask.\r\n\r\n\r\nNikolas Hulewsky (04:36.76)\r\nHow much were you making at Amazon in your last year?\r\n\r\n\r\nNikolas Hulewsky (04:45.326)\r\nOkay, like 200 grand? Like close to 200? Okay.\r\n\r\n\r\nNicholas Conley (04:58.789)\r\nA lot of your pay comes in RSUs, so like restricted stock units. So you take a hold of those, right? You can either sell them, sell them for taxes, right? So you sell a portion, pay taxes, and then you can hold them, right? So like, now I look back and those have gone up like, you know, 60%. It's like, oh, that year, like I guess technically I made a little more than that, right? Cause those have gone up so, so much. Yeah. Yeah. I think.\r\n\r\n\r\nNikolas Hulewsky (05:03.661)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (05:20.29)\r\nHave you held that stock?\r\n\r\n\r\nNicholas Conley (05:25.367)\r\nI sold like the first unit that I ever got and then, and then yeah, I sold for taxes and then held onto everything I could.\r\n\r\n\r\nNikolas Hulewsky (05:33.038)\r\nAll right. So if you're in Amazon, you're obviously a hustler. I think there's different types of entrepreneurs. Hustlers are one type that I've identified, which is like, you're always just scheming, right? Like, could I buy something for five bucks and sell it for six? And, man, how do I, how do I make a little more money? When you were at Amazon, did you have side hustles? Were you like constantly launching different things to see what was going to work?\r\n\r\n\r\nNicholas Conley (05:54.617)\r\nyeah, yeah, 100%.\r\n\r\n\r\nNikolas Hulewsky (05:56.878)\r\nYou\r\n\r\n\r\nNicholas Conley (05:58.958)\r\nThe thing that comes to mind is I started getting into newsletters actually when I was at Amazon. think, you know, just listening to Sean Pury and Sam Parr talk about the hustle and other newsletters that originally got me interested in newsletters. I started writing on Substack probably like four or five years ago. Yeah, like around the time I was in Amazon and I had read this article from Tyler Dank at the time about how Morning Brew grew like 30 % of their subscribers through\r\n\r\n\r\nNow there's an issue because Substack, one, they had no API access so you couldn't build external tools to use a referral program and they didn't have one themselves. So I was like, I should build a referral tool for Substack and everyone would want to use it. So I met my co-founder engineer on Reddit. He was an engineer at Google at the time and we built it and it was not successful. We sold it for like six grand.\r\n\r\n\r\nNikolas Hulewsky (06:45.23)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (06:57.346)\r\nHahaha\r\n\r\n\r\nNicholas Conley (06:58.872)\r\nBut, you know, it got my toes dipped in the water and also technically my first acquisition, right? If I could say that.\r\n\r\n\r\nNikolas Hulewsky (07:08.17)\r\nYeah, dude, that so for people who are listening, you probably know what newsletters are, but I'm just going to like high level overview. Anybody who is who has a business or who has an audience, they're dependent on these platforms to reach customers or potential end users. And so if you've got a lot of followers on YouTube or you've got a lot of customers, you're reliant on the algorithm that those platforms generate in order to reach people.\r\n\r\n\r\none change in the algorithm and all of a sudden you're not able to reach them. The reason that newsletters are so popular is because it removes that friction. If I have someone's email, I can go to them directly and I don't need to rely on Google to decide whether or not my post was good enough. So these have become more more popular for people who are trying to go directly to end users. Newsletters are growing like crazy. Tyler Dank started a company called Beehive. I think they just reached $30 million ARR. I think that's like where they are.\r\n\r\n\r\nNicholas Conley (08:04.407)\r\nThat sounds right.\r\n\r\n\r\nNikolas Hulewsky (08:06.786)\r\nprobably a nine figure valuation. And it's only becoming more and more popular because ad dollars are shifting from traditional legacy media to these niche media plays where they can actually put dollars to work and get the return out that they want. You, what you're saying is you saw this opportunity in the newsletter space to help other newsletter operators grow through a referral program. So you built this tool, obviously the tool flopped, but out of that, the thesis of newsletters stuck for you. You're like, no, I need to stay in the newsletter game.\r\n\r\n\r\nNicholas Conley (08:20.803)\r\nMm-hmm.\r\n\r\n\r\nNicholas Conley (08:35.733)\r\nYeah, I was just like, you know, something about newsletters I was like addicted to. was like, this is like the most straightforward path I've ever I've ever seen in like a business. Right. And now getting into it, it's not straightforward. But like the three steps to, you know, making money with a newsletter is essentially just you grow an audience. So you have an email list that advertisers are interested in reaching. You send them good content. So they open that email and then you sent you sell ad space to advertisers that want to reach that.\r\n\r\n\r\nNikolas Hulewsky (08:44.995)\r\nHmm.\r\n\r\n\r\nNicholas Conley (09:05.59)\r\nthat list. Right? So like, it's like, I can understand that. Anybody can understand that. I can explain that to my mom, right? It's pretty simple. Now, executing that, I would say, is a different story. But like, the concept in itself is very simple.\r\n\r\n\r\nNikolas Hulewsky (09:22.03)\r\nWell, at high level, I would say there's like four different types of newsletters. There are geographic newsletters. it's like local newsletters become super popular right now. In many ways, think of it as like what the old newspaper was. So like the, the wanna ads are the classifieds of what people would advertise. It's kind of replacing the newsletter. So there's local newsletters, super hot. There were, would say demographic based newsletters. So it's like newsletters for men or newsletters for women's or dads in their thirties or...\r\n\r\n\r\nwhatever else, like hobby, demographic, specific newsletters. And then there are brand related newsletters, like personal brand, people who have audiences, maybe that people are following them for specific reasons. And then there's, in my opinion, business newsletters where it's like, I'm a business, I should keep my customers warm. And so I'll create a newsletter. Those are the four broad categories that I think of newsletters. Did I miss anything?\r\n\r\n\r\nNicholas Conley (10:11.572)\r\nNo, think that's pretty solid. Yeah, I think you could take those and put them in different categories if you wanted to, but overall you could definitely classify pretty much every newsletter into those four.\r\n\r\n\r\nNikolas Hulewsky (10:19.043)\r\nYeah.\r\n\r\n\r\nWell, so local newsletters have been super hot. Everyone's like, I could start an local newsletter and make a ton of money. And I've had a couple of guys who've come on here that have started local newsletters and they're doing great. Talk about the economics of newsletters really quickly before we get into, I guess, the specifics. Why do people like them? Like, how do you make money?\r\n\r\n\r\nNicholas Conley (10:40.163)\r\nYeah, totally. So the way that most newsletters basically grow an audience or build their asset, right? So you could look at a newsletter in that, like the whole entire asset of the business is that list of people that are looking for your content or that you can send advertisements to essentially, right? So the way that a lot of people, most large newsletters will grow their email lists is through paid acquisition, right? So this is setting up Facebook ads, paying a dollar to $3 for someone to\r\n\r\n\r\nNikolas Hulewsky (10:56.814)\r\nMm-hmm.\r\n\r\n\r\nNicholas Conley (11:10.068)\r\nClick on that and then subscribe to your newsletter and then you have that audience that's expecting that newsletter from you Then you can go to advertisers and based on a CPM rate, right? So CPMs are anywhere from you know, call it ten dollars all the way up to you know I've seen hundreds of dollars per CPM, which is essentially the cost per mill or cost per thousand And this is done on opens, right? So let's say you have people on your list You have a 50 % open rate. So really you only\r\n\r\n\r\nhave 10,000 readers each time, right? So you're not selling that CPM based on 20,000, you're selling it based on 10. So you just take that 10,000, so that would just be 10 times the CPM rate, call it 10 times $10 CPM, you'd get $100 to sell that ad, right?\r\n\r\n\r\nB2B is gonna be much higher than that. I've seen like 100 to 500 CPM. Your consumer or maybe local, we can talk about local later, but your consumer is probably gonna be closer to like that $20 range. So that's how most newsletters make money. You also have like paid subscriptions, right? So if it's really high quality content, people wanna subscribe for, call it five to $50 a month to read that content. That's another way of doing it. Or you build a business.\r\n\r\n\r\nNikolas Hulewsky (12:29.166)\r\nMm-hmm.\r\n\r\n\r\nNicholas Conley (12:30.487)\r\non the back of it, right? So let's say you run an agency for marketing, you get marketers to sign up, and you sell them a service on the back end or whatever product you sell to them.\r\n\r\n\r\nNikolas Hulewsky (12:41.228)\r\nYeah, the only other thing I'd say is affiliate or you have an affiliate agreement where somebody sells through you and for everyone that they click and buy, you get a certain percentage for. Okay, so you looked at this and you're like, dude, newsletters are freaking cool. I'm gonna start a newsletter. What did you start?\r\n\r\n\r\nNicholas Conley (12:57.249)\r\nTotally. Yep. So I started, the very first one I actually started was a personal newsletter. It was called Three Ideas on Sunday. I essentially just sent out business ideas that I had.\r\n\r\n\r\nThat one, I don't really talk about that one ever, but that was the actual original one I started writing on Substack. The first one that I started as a legitimate business is called The Follow-Up. I still write it to this day. It actually went out a couple hours ago for today's email. And The Follow-Up is all about B2B sales. So we looked at like the hustle, the morning brews. There's tons of newsletters about marketing or finance or general business. There just wasn't a ton\r\n\r\n\r\non B2B sales, which was my background. So I started that as a twice weekly newsletter every Tuesday and Thursday. And I've been operating that for about the last two and a half years. We just crossed over about 22,000 subscribers. And recently this year, it joined the HubSpot newsletter network. So essentially, they're our biggest advertising partner.\r\n\r\n\r\nNikolas Hulewsky (13:53.966)\r\nCheers, it's awesome.\r\n\r\n\r\nNikolas Hulewsky (14:02.04)\r\nSo what are your CPMs on a newsletter like that? So 22,000 subs. What's your open rate CPMs? I'm curious.\r\n\r\n\r\nNicholas Conley (14:10.144)\r\nThat's a great question. couldn't tell you the... No, no, couldn't. I could try to do the math right now, but the CPMs change a little bit because I'll lock in deals. So let's say someone will buy six months of ads. And so they actually kind of get the better deal in that by buying the CPMs now, knowing that it's going to grow over time. So let's call it like, know, $50 to $100, just depending on when they buy the ads there.\r\n\r\n\r\nNikolas Hulewsky (14:12.15)\r\nIs it too personal? It's too personal.\r\n\r\n\r\nNikolas Hulewsky (14:23.992)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (14:37.845)\r\nAnd what are your open rates?\r\n\r\n\r\nNicholas Conley (14:39.708)\r\nOpen rates right around 55%. Click through rate depends a lot on the advertiser. So yeah, we can talk about ads as well because I've seen behind the scenes of a lot of them and what works well for advertising and newsletters and what doesn't.\r\n\r\n\r\nNikolas Hulewsky (14:42.616)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (14:55.768)\r\nTalk about that. Okay, so what works well and what doesn't?\r\n\r\n\r\nNicholas Conley (14:58.132)\r\nTotally so.\r\n\r\n\r\nA lot of advertisers or a lot of companies when they buy newsletter ads, they're just like, awesome, we're just going to write some cool copy, send them to like our landing page and they can book a demo from there. That's never going to get as good of a click through rate as a resource, right? So it all comes back to the offer. So when someone offers like a lead magnet, and if you want examples of this, find any HubSpot ad in a newsletter, it's never going to be, Hey, do want to check out, you know, our HubSpot CRM? has like all this intelligence. It's always going to be, do you want to download these top\r\n\r\n\r\nNikolas Hulewsky (15:15.342)\r\nMmm.\r\n\r\n\r\nNicholas Conley (15:29.841)\r\n100 chat, chavity prompts, or these top 50 cold email templates. They then get the email from there and they can remarket to them later. That's always going to like, I'd go as far to say like two to five X, the performance as just like a general sort of what you consider direct to consumer.\r\n\r\n\r\nNikolas Hulewsky (15:46.7)\r\nThat's interesting. From the ad buyer's perspective, HubSpot in this example, or me, let's say I wanted to grow my podcast and I'm going to go find someone who has a similar audience to me and I'm going to go to their newsletter. You would think, it's going to 22,000 people, open rates 50 plus percent, click through rates going to be X. Cool. As long as I have something that's quippy or eye grabbing, they're going to click through and they're going to subscribe because there's overlap there. But really it's about the lead magnet.\r\n\r\n\r\nI wonder why? Why do you think the lead mac, why does the offer matter so much more than just the copy?\r\n\r\n\r\nNicholas Conley (16:17.758)\r\nIt's about the offer. Yeah.\r\n\r\n\r\nNicholas Conley (16:22.823)\r\nIt's just, it's always about the offer, right? Whether you're sending a cold email or anything like that. This is why like, you know, when cold emailers originally found out, like there, you probably still get cold emails like this, like, Hey, can I send you a two minute video that I made of you? you know, or made for you custom, like that worked way better than like, Hey, are you available for like a 15 minute call? Right? It always comes back to the offer. So I said lead magnets and resource downloads, but it could also be like,\r\n\r\n\r\nNikolas Hulewsky (16:29.39)\r\nMm.\r\n\r\n\r\nNicholas Conley (16:48.935)\r\nYou know, the follow-up readers get 500 free credits if you sign up through this link. The audience just wants to feel like there's an offer there, that there's a reason that I should click on this. They're not just trying to sell me something.\r\n\r\n\r\nNikolas Hulewsky (17:03.136)\r\nI kind have this theory that I've been working on for a while, or I think that it's so stupid. I'm going to get flamed for this. Everything's built on trust. Anybody who's listening to that is like, really? Everything's built on trust. But hear me out. me out. Any purchasing decision, any switch listening to this podcast, right? If you want somebody to do something, they have to trust you. They have to say like,\r\n\r\n\r\nNicholas Conley (17:16.102)\r\nYeah\r\n\r\n\r\nNikolas Hulewsky (17:32.558)\r\nI'm going to listen to Nick because he knows how to grow newsletter as evidenced by X, Y, and Z. Or I'm going to listen to me, Nick, because he's bought and sold businesses as evidenced by X, and Z. So in my mind, you need that level of trust before somebody will make a purchasing decision. That's why there are these metrics where it's like, have to have seven touches with somebody before you close a sale. Because they need to get to know you and get a feel for you and trust you before they spend their dollars. And I wonder if the lead magnets\r\n\r\n\r\nNicholas Conley (17:47.678)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (18:01.26)\r\nAnd again, I'm sorry, people who are listening are like, no, it's like the lead magnets are kind of a cheat code to building trust. Because if I create a lead magnet, that's really valuable. It's Hey, here's a, here's a template for valuing any business. And I gave it for free immediately. Someone takes that, they use it and they're like, this works. Nick must know what he's talking about. I'm going to go click through, right?\r\n\r\n\r\nNicholas Conley (18:23.303)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (18:24.834)\r\nOr if you create a lead magnet of like, here are the top 10 newsletters that you should do in your industry. And like, I clicked it and I'm read through it I'm like, Nick Connelly knows what he's talking about when it comes to newsletters. Trust is automatically built. Therefore there's a higher likelihood of a purchasing decision being made in your favor. And again, that's the first time I've like really vocalized it like that, but I, does that make sense?\r\n\r\n\r\nNicholas Conley (18:40.53)\r\nYeah.\r\n\r\n\r\nNicholas Conley (18:44.23)\r\nNo, think it's spot on. I think the perfect example of this is Alex Hormozi probably arguably has the most trust of any business influencer on the internet right now. So whenever he tries to go sell something like his book, it's just a blowout event and everyone's buying it. Because he's built up so much trust with his audience that just like, when you see his videos, you automatically know this guy's gonna give me a ton of value and not ask for anything in return right now.\r\n\r\n\r\nNikolas Hulewsky (18:53.346)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (19:01.774)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (19:12.878)\r\nThat's a really, sorry, I'm thinking of it from the advertiser's perspective now and business owners who are trying to figure out how grow their business and they're doing pay-per-click and they're doing SEO. That one shift in your mindset, hey, what's a lead magnet that you can provide for people? I would test that. I think it might translate to more sales. If you're doing pay-per-click on Facebook and it's like, here's my offer versus here's my offer with a lead magnet, the lead magnet offer has to outperform that, I would assume.\r\n\r\n\r\nNicholas Conley (19:42.044)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (19:42.734)\r\nSo anyways, I just think that's a really interesting perspective to think from. For you and in your newsletter, so as you bring on sponsors, do you tell them that? Are you like, hey, it's actually gonna work a lot better if you have a lead magnet.\r\n\r\n\r\nNicholas Conley (19:57.681)\r\nYeah, yep, absolutely. Basically, I'll be like, hey, look, you can run whatever you want, right? You're buying the app placement. As long as I've pre-qualified them and I'm like, hey, I like their brand, I'm fine with them running in the newsletter.\r\n\r\n\r\nNikolas Hulewsky (20:03.15)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (20:11.522)\r\nMm-hmm.\r\n\r\n\r\nNicholas Conley (20:12.324)\r\nIt's like, hey, look, you can run whatever you want. Sometimes they have like a big launch coming up and they're like, yeah, we need to use this ad placement, right? Because it all comes back to like, there's someone on the marketing team buying that because they have a specific goal that they're like, you know, gold out that they have to go back to the CEO and say, this is why we're making this purchase. But it's like, hey, look, if you just want to like deliver the most clicks and most leads possible, like this is what you should do. Now, if you don't want to do that, if you just want to drive traffic and show that you got traffic to a landing page about your new launch, that's totally fine.\r\n\r\n\r\nas well, but like if this is the metric here's what you should do.\r\n\r\n\r\nNikolas Hulewsky (20:46.754)\r\nHow are you growing your newsletter?\r\n\r\n\r\nNicholas Conley (20:49.053)\r\nSo right now, I actually just shut off Facebook ads like yesterday. So I've used Facebook ads traditionally to grow a lot of it. So I'm getting anywhere from like $1.50 to $2 per subscriber, obviously.\r\n\r\n\r\nNikolas Hulewsky (20:59.148)\r\nMm-hmm.\r\n\r\n\r\nAnd when you do that, $1.52 per subscriber, are you including a lead magnet? Or no?\r\n\r\n\r\nNicholas Conley (21:10.35)\r\nNo, no, that's just like an iPhone notes app or like an app screenshot, right? If you go to actually newsletterads.co, it's a website that I built. It's just like a, I think I built it on card. It's just like links to the Facebook ads library. But if you want to see like all of the ads that a big newsletter is running right now to grab subscribers and basically just want inspiration, just go there.\r\n\r\n\r\nNikolas Hulewsky (21:12.843)\r\nInteresting.\r\n\r\n\r\nNicholas Conley (21:38.055)\r\nClick on any newsletter that you look up to or maybe is in your niche and then scroll to the bottom to find the ad they've been running for the longest. And that's how you're going to find out what's really working, right? If they've been running it for six months. Yo.\r\n\r\n\r\nNikolas Hulewsky (21:47.822)\r\nOkay, I've got it up. I've got it up. So we've got the hustle on here. We've got CRE Daily, Sahil Bloom, Tim Ferriss. Which one should I, let's go Cody Sanchez. I wanna see what Cody Sanchez is doing. So I click on Cody Sanchez and I'm, oh, these are all the Facebook ads that she has been running in order to get subscribers to her newsletter. You built this? How did you build this?\r\n\r\n\r\nNicholas Conley (22:09.596)\r\nCorrect. Yep. And these could be for, yeah, yeah. I mean, I essentially just opened up card, put a landing page, and then it's just links to the Facebook ads library. So you could search any other newsletter. So you can see in the search tab right there, it says Cody Sanchez. Any newsletter you want to look at, like you go to TLDR, Morning Brew, you could find...\r\n\r\n\r\nany newsletter you want. That's what you should use as inspiration, right? So it's like, don't have to reinvent the wheel, nor should you. You should just see what's working, go back as far as you can, find out the ad they've been running for a year because it's still crushing and use something similar to that.\r\n\r\n\r\nNikolas Hulewsky (22:50.03)\r\nOkay, so let's take a look. This Cody Sanchez, August 19th, 2024. And then I just go watch it.\r\n\r\n\r\nNikolas Hulewsky (23:08.069)\r\nMmm, this mucus is banging.\r\n\r\n\r\nNikolas Hulewsky (23:14.946)\r\nOkay, so that's her at. Did you hear that by the way? Okay.\r\n\r\n\r\nNicholas Conley (23:17.722)\r\nYeah, yeah, yep. And she could be selling something else here. So that might be going to her newsletter. That might be going to something different. Let's see. Does it let you?\r\n\r\n\r\nNikolas Hulewsky (23:28.002)\r\nsee here. What does it say?\r\n\r\n\r\nNicholas Conley (23:31.813)\r\nSo send message is a call to action. So this one's probably actually not for her newsletter, because I think the call to action there is to send her a message, which she's probably then throwing you into an automation. So she actually might not be running ads for her newsletter right now if all of the call to action here is. Yeah.\r\n\r\n\r\nNikolas Hulewsky (23:39.991)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (23:48.502)\r\neither way, she's running ads to build trust in some form of so that it can then translate into a purchasing decision. Right? So it's like, like even that ad, listen, you need three mentors. Here are the three mentors. And she probably at the end, let's watch, let's watch the end actually. Let's watch the last 10 seconds. Let's see what she says.\r\n\r\n\r\nNicholas Conley (23:55.483)\r\n100%.\r\n\r\n\r\nNicholas Conley (24:18.521)\r\nYeah. So she's saying like, I could be that mentor, right? Yeah.\r\n\r\n\r\nNikolas Hulewsky (24:19.21)\r\nOkay, usually there's some usually there's something that's like, I'm valid because I've done all these businesses, but for whatever reason, she didn't do it on that one. Anyways, broadly speaking, I can come here and I can just look at what ads are working for them. This isn't this is freaking awesome.\r\n\r\n\r\nNicholas Conley (24:39.17)\r\nYeah, yeah, I mean, it's like the the best place to start, right? It's like, don't don't take a guess. Just know and like when you first get started, you don't have to worry about like making a video like that. I would just get started with like just image, image ads.\r\n\r\n\r\nNikolas Hulewsky (24:46.125)\r\nYeah.\r\n\r\n\r\nNicholas Conley (24:57.519)\r\nThat's basically what's worked for me. sometimes the videos take a long time to produce and like if it flops, it feels like a waste of time. So like, you know, just get started running these, a lot of newsletters use these. So it's basically just like take a B roll video of like a skyline and then put text over it. Right. So it shows up as a real.\r\n\r\n\r\nNikolas Hulewsky (25:05.74)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (25:17.656)\r\nOkay, so this is Hauk's newsletter. I don't know who they are. They're called Founding Journey.\r\n\r\n\r\nNicholas Conley (25:24.888)\r\nYep, so it's all about like startups and raising money and things like that.\r\n\r\n\r\nNikolas Hulewsky (25:27.566)\r\nOkay. And this is one ad that they've been running since March 8th, 2024. So a year and a half ish. And if I\r\n\r\n\r\nAt my last startup, we raised $15 million, including a Series A from A16Z. I created a free pitch deck template crafted to help founders clearly present their startup values to investors. Click below to download for free. That was my voiceover. But yeah, it's against the New York skyline. It looks great. That's interesting. Yeah. So for something like that, if I'm starting a newsletter, that's a very low lift. That is not high quality. It's literally like 16 seconds.\r\n\r\n\r\nNicholas Conley (25:52.536)\r\nYeah, it's beautiful.\r\n\r\n\r\nNicholas Conley (26:08.322)\r\nYeah, and you can also reverse engineer that to say, okay, he's been running that for a year. It's working really well. And he's using a lead magnet there, right? So he's not saying sign up to my newsletter. He's saying, I created this free template, download it here. And when you download it, it's gonna subscribe you to the newsletter automatically. So yeah.\r\n\r\n\r\nNikolas Hulewsky (26:17.974)\r\nMm-hmm.\r\n\r\n\r\nMmm\r\n\r\n\r\nNikolas Hulewsky (26:26.83)\r\nDude, this is so crazy to me. This is like a freaking cheat code. You can go and see not only what ads they're running, but by virtue of the fact that their ads have been running for a long time, you're like, that's the best one. I'm going to go reverse engineer it. Like you don't have to make anything up. You can literally just go and see what the best are doing and copy it. It's nuts.\r\n\r\n\r\nNicholas Conley (26:38.297)\r\npercent.\r\n\r\n\r\nNicholas Conley (26:45.369)\r\n100%. Yep.\r\n\r\n\r\nNikolas Hulewsky (26:47.054)\r\nOh my gosh. Okay. tell me if you were, if you were getting into newsletters again, what would you do? You got, you got a 26 year old, 27 year old Nick Conway. It was like, I want to get into newsletters. I want to do a local newsletter. Cause I know I'm to make a lot of money in local. I've heard all that on the podcast. What would you say to local Nick or not local Nick? What would you say to 26, 27 year old Nick?\r\n\r\n\r\nNicholas Conley (27:06.273)\r\nMm-hmm.\r\n\r\n\r\nNicholas Conley (27:10.522)\r\nSo I would 100 % stay away from local newsletters. I say that as someone that owns a local newsletter. Yeah. I just lost all my friends on Twitter. Yep.\r\n\r\n\r\nNikolas Hulewsky (27:20.748)\r\nIt were eeeerrrr\r\n\r\n\r\nNicholas Conley (27:30.891)\r\nI think local newsletters are a fun hobby business. think they're probably one of the lowest leveraged newsletters you can start. And let me tell you why. When you try to go sell an ad to the local real estate shop or to the local pizza shop or landscaping company, that is playing business on hard mode. When you send a $15,000 invoice to a B2B company and it's just a line item for them, like a rounding air,\r\n\r\n\r\nNikolas Hulewsky (27:31.704)\r\nKeep going.\r\n\r\n\r\nNicholas Conley (28:00.747)\r\nThat is a much easier sale to to actually like make real money on now The local newsletters are much more approachable, right? Because it's like I can I can run Facebook ads to people just in my town\r\n\r\n\r\nNikolas Hulewsky (28:06.348)\r\nHmm.\r\n\r\n\r\nNicholas Conley (28:14.757)\r\nIt's actually really cheap to acquire subscribers. think our average subscriber like CPA is like 22 cents for the local newsletter, which is awesome. We built a list like 10,000 right away, but having conversations with these local businesses where it's like, Hey, it's going to cost you 500 bucks a month. They're like $500 a month. Like, are you kidding me? That's like our entire marketing budget. It's like, those are the worst type of customers in my opinion to work with. like if I was\r\n\r\n\r\nNikolas Hulewsky (28:23.566)\r\nCheers.\r\n\r\n\r\nNikolas Hulewsky (28:38.627)\r\nHmm.\r\n\r\n\r\nNicholas Conley (28:45.07)\r\nRestarting here. Yes. Yes over there If I if I was if I was restarting I would stay away from local newsletters now if that's like a hobby project you want to work on or like, know like Experiment with I think that's totally fine but if you expect that you're gonna make like a million dollars or have like a million dollar exit for from a local newsletter like I think you should probably look somewhere else. So Yeah\r\n\r\n\r\nNikolas Hulewsky (28:48.984)\r\nMm-hmm. Yeah.\r\n\r\n\r\nNikolas Hulewsky (29:11.214)\r\nI'm gonna say it a different way. I'm gonna say it a different way. It's not that you would stay away from local newsletters. It's that you would stay away from low ticket advertisers. Because for the most part, local newsletters are gonna be lower ticket. B2B sales are gonna be higher ticket. So like, how would I even find out? Well, sorry, before I just glaze through that, is that probably a fairer characterization?\r\n\r\n\r\nNicholas Conley (29:34.506)\r\nYeah, I just think it's, I think it's low leverage. Like, and I think the way to look at this is like, there's one newsletter, one local newsletter that I know of, owned by like 6am city. And I think they do just crack seven figures a year. And that's the like largest local newsletter that I know of. Right. And it's like, to me, like, if that is the pinnacle of what you can get to that\r\n\r\n\r\nNikolas Hulewsky (29:38.391)\r\nHmm.\r\n\r\n\r\nNicholas Conley (29:59.948)\r\ndoesn't seem like a very high leverage business. Now, like, I could go on and build a list of like 10 B2B newsletters that are making over seven figures on like crazy margins right now. And arguably, they probably work less hard, right? Like, that's what I mean.\r\n\r\n\r\nNikolas Hulewsky (30:15.64)\r\nSo you know, but you know now how much they make, right? But if you're just starting out and you're like, I want to pick a newsletter, how would I even find out what I could make? Right? Like there's a saying in tech where it's like, what's my TAM? That's my total adjustable market. Like how big could my business be? How would you even go about identifying that? Obviously you've gotten to B2B, but how do you find out the CPMs that are average in those industries? How do you find out what an advertiser is going to pay? Where do you go?\r\n\r\n\r\nNicholas Conley (30:44.375)\r\nYeah, I think you could look at like other media channels and like who's already advertising, right? So the issue with local right is a lot of those people like local businesses, maybe they've ever like advertised on like a billboard or like bought Google ads before it. They've never done it in a newsletter, right? So like look where companies are already spending money in newsletters. That's the easiest sponsor you're ever gonna you're ever gonna sell is when you reach out to them and say, hey, I noticed that you're you're, you know, running ads in this newsletter. We have a similar audience.\r\n\r\n\r\nNikolas Hulewsky (30:50.03)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (31:12.76)\r\nI agree, how do I do that though? I don't, how would I find out a company's running ads or not?\r\n\r\n\r\nNicholas Conley (31:19.531)\r\nYou gotta, you gotta look in those newsletters. No, you gotta, you gotta go out, subscribe to every newsletter you can find in your niche, right? If you're interested in a niche, that's what you're looking for.\r\n\r\n\r\nNikolas Hulewsky (31:20.258)\r\nGoogle.\r\n\r\n\r\nNicholas Conley (31:29.324)\r\nThe first thing, the real first thing though is like you want to look at a niche that you're actually interested in, right? Like I can't go write a newsletter about finance because I'm not into finance. I have no background in finance. Start with your background. What niche are you in? What are you most interested in? What do you want to go learn more about and actually be able to write about every single week? So that's where you start. You go subscribe to every newsletter in that niche. You find out what they're talking about. You find out who the big dogs are in that category, who are like just coming up and who you can like befriend and become friends with and learn.\r\n\r\n\r\nNikolas Hulewsky (31:35.278)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (31:48.75)\r\nOkay.\r\n\r\n\r\nNicholas Conley (31:59.397)\r\nfrom and figure out like who's advertising in those newsletters right who's showing up every single week who's spending a ton of money in there and the way that you know if like newsletters are are working is like if you see that advertiser show up in that newsletter a lot right they show up one time and they never show up ever again\r\n\r\n\r\nNikolas Hulewsky (32:03.586)\r\nHmm.\r\n\r\n\r\nNicholas Conley (32:18.241)\r\nprobably didn't get an ROI or it just like a one-off buy, right? If you see like an advertiser showing up in one newsletter over and over and over and over, there's a reason behind that, right? Because it's performing well. That's.\r\n\r\n\r\nNikolas Hulewsky (32:20.078)\r\ndear.\r\n\r\n\r\nNicholas Conley (32:31.809)\r\nThat's where I would start. even like, let's rewind a little bit. And before I'd even do that, I would try to do some freelancing or find a way to work with someone that's already has like a successful newsletter, right? Like you're just going to shortcut all those learnings, figure out like what they're doing that's successful. And like, that's the actual first way to make money in newsletters is to provide a service to newsletters.\r\n\r\n\r\nNikolas Hulewsky (32:58.966)\r\nto me, to me, it sounds like what you're saying is if you want to get into newsletters first, what are you interested in? Where is your skill set? It's like starting a business, right? It's like, okay, well, I want to start a business. What should I do? Well, the best way, the best way to make money is to do something that you already know how to do. Don't you know, if you're an engineer, don't all of sudden try and start a fitness brand necessarily. Maybe there's exceptions, whatever, but go and subscribe to all those newsletters. And like you said, identify\r\n\r\n\r\nWho are the up and comers in the space that are writing content? Who are the brands in the space that continue to spend? And then befriend those people who are up and comers and probably offer your services in some way. Hey Nick, I've noticed, dude, you got a freaking great newsletter. I actually have a background in, I can't remember what your newsletter is. Tell me your newsletter specifically again. I'm a freaking idiot.\r\n\r\n\r\nNicholas Conley (33:49.226)\r\nYeah, the B2B sales, the follow up, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (33:51.66)\r\nOkay, so hey, dude, I've been working as a tech salesperson for for Google for the last three years. I'd love to just write once a month an op ed on like, my best sales practices. Is that cool with you? And you're gonna say yes, because you're like, always need content. And they're going to get experience of just understanding how to write for a newsletter, how it works on the back end, they're going to build a relationship with you. And then over time, you know, you get to the point where you can kind of spin off and start your own newsletter, but get in the game effectively by\r\n\r\n\r\nconsulting or doing some work for newsletters that are already existing. Is that what you're saying?\r\n\r\n\r\nNicholas Conley (34:26.097)\r\nYes, yes, absolutely. And by the way, the hardest thing to hire for in newsletters, in my opinion, is a good writer. So like every newsletter out there is going to be looking for good content if you can provide it, right? So like before you go and try to write your own, like you could absolutely help write another newsletter if you actually have the skill or the knowledge to write in that niche. So absolutely. I think you could start there.\r\n\r\n\r\nNikolas Hulewsky (34:39.566)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (34:51.032)\r\nDude, that is such a cheat code just reaching out to people and saying like, I'll do some work for you for free. There is a story though, it's kind of the other side of things. You know who Warren Buffett is, right? Okay, his mentor, someone he really looked up to, an investor named Benjamin Graham. And Benjamin Graham was a really famous investor at the time. And Warren came up to him and was like, can I work for you for free? And Benjamin Graham was effectively like,\r\n\r\n\r\nNicholas Conley (34:56.725)\r\nMm-hmm.\r\n\r\n\r\nNicholas Conley (35:03.615)\r\nYep, I've heard of him, I think. Yeah.\r\n\r\n\r\nNikolas Hulewsky (35:20.982)\r\nHmm. Your offer is too expensive because it would take time for Ben Graham to like train him up and work with him and help him understand what you're supposed to be doing. So even though you're offering free things, Warren, I think at the time just didn't really have any experience that would have even made sense to hire him for free. So be careful when you're pitching that to somebody. Cause if I were to go to Nick and be like, Hey, can I write your sales newsletter? But I have no sales experience. I mean, Nick's probably going to be less inclined to work with me. But if so,\r\n\r\n\r\nNicholas Conley (35:48.341)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (35:50.56)\r\nAnyways, there is a caveat to that piece, but it is such a cheat code to go and just offer somebody who's 10 steps ahead of you to work for them for free.\r\n\r\n\r\nNicholas Conley (35:57.053)\r\nYeah, yeah, yeah, I think like the big thing there is like you actually have to like do the work or come with the ideas, right? It's not like, hey, where can I help you? It's like, I don't want to figure out a place for you to help me out, right? Like, tell me how you can help me and tell me the ideas that you have, because that's where like the real value is not just, you know, finding where to stick somebody.\r\n\r\n\r\nNikolas Hulewsky (36:17.326)\r\nOkay, so to recap, if you're starting over again, find a niche that you know something about and are interested in. Consume as much content as you can, subscribe to those newsletters, reach out to up and comers in the space, keep a list of advertisers, network, do some work with them, and then launch. That's the process you go through.\r\n\r\n\r\nNicholas Conley (36:36.661)\r\nYeah, that's the tried and true process. I want to throw a curve ball in there as well of one of the worst parts that can feel like one of the worst parts about running a newsletter that's based on ads is that you're 100 % dependent on advertisers to make revenue. So if they stop spending, basically all of your revenue is completely dried up.\r\n\r\n\r\nNikolas Hulewsky (36:43.904)\r\nokay.\r\n\r\n\r\nNicholas Conley (37:01.532)\r\nIf I like actually wanted to start a newsletter and make money as fast as possible, I would start something that essentially acts like a service, right? So you're sending something of value that actually takes time to put together or that brings value to the, I wouldn't even call them necessarily a reader, but like a customer. So this could be digital templates. This could be like local listings that are put together. Think about like different things you could scrape from the government that are hard\r\n\r\n\r\nNikolas Hulewsky (37:28.302)\r\nMmm.\r\n\r\n\r\nNicholas Conley (37:31.456)\r\ndefined, right? Think about like the movie War Dogs and how they bid on those projects. Like imagine scraping a list of, you know, all of those projects that are out for bid and that like you don't need like extreme.\r\n\r\n\r\nlike knowledge in order to do like putting all of that in a newsletter and then charging call it, you know, five to $30 a month in, order to access it. Right. And the reason why I love that is one, have MRR right off the bat. You're providing a service that people get a ton of value from and three, like you can go to Facebook ads and you're not just like spending money and hoping an advertiser is going to help you recoup that money in the long run. You're spending money. That's making you money right.\r\n\r\n\r\nSo you have an infinite growth loop.\r\n\r\n\r\nNikolas Hulewsky (38:17.846)\r\nIn that scenario though, you're only making money if you have an audience. Like you only have MRR if you get people to opt in. So what comes first? Like, you build a newsletter subscriber list and then turn it into this MRR thing? Or do you do that from the get go? Do get what saying?\r\n\r\n\r\nNicholas Conley (38:37.873)\r\nYeah, I think there's a few ways you could go about it, right? So a lot of paid newsletters will have like a free edition, right? So it's like, hey, if you want to get like the monthly roundup, sign up here. But like, if you want like the weekly or daily one, you're going to have to actually pay to receive it. So you could build a free list that way. But if you have like a good offer set up and you feel confident you can provide value in that newsletter, like I would, you could even test this out with like seven different niches with Facebook ads, just like we just did, right?\r\n\r\n\r\nYou can spend $100 on Facebook ads to see if you can get anybody to convert to that paid subscription and just try out different types of templates, different types of listings, tons of different issues until you've proven it.\r\n\r\n\r\nNikolas Hulewsky (39:23.352)\r\nOkay, so I think that's an amazing strategy. think what we talked about of like identifying your niche and your skill set and then kind of working your way up is an amazing strategy as well. And those two things together are fantastic. But if I'm just starting out, like the thing that I'm trying to reconcile is I'm gonna have to spend money to get subs, right? Because my whole business model is predicated on subscribers. How much money would I need to set aside to get started? Like in your mind,\r\n\r\n\r\nOkay, you got to come in here with 50 grand. Is it 10 grand? it 100? what? Where would you go? Like if you're advising somebody who's like, Hey, I want to start a newsletter. It's B2B. I'm specifically targeting home services business owners that are struggling with marketing. And I want to get started tomorrow. Like, what would you tell them? How much money?\r\n\r\n\r\nNicholas Conley (40:14.896)\r\nDepending on the niche like maybe a thousand dollars, but like if you really want something if you really want to\r\n\r\n\r\nNikolas Hulewsky (40:19.036)\r\nNicholas Conley (40:22.148)\r\nlike grow something and you don't have any money, you could 100 % do it organic. I mean, some of the best newsletters out there have done it organic. It's extremely hard. So you can't just go start tomorrow and expect to grow 100 new subscribers every day, but you can 100 % do it organic as well. Like Reddit, I've gotten a ton of subscribers from early on. actually would cold email a ton of different sales reps. I would just get their numbers from Apollo and use smartly to send them emails and say like, Hey,\r\n\r\n\r\nthought you might find this newsletter interesting, would you like to subscribe? That's how I got my first couple hundred subscribers. So you can 100 % get creative and find free ways to do it. then basically throwing Facebook ads on that is like gasoline.\r\n\r\n\r\nNikolas Hulewsky (40:54.99)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (41:07.618)\r\nWould you suggest you do that first? let's say I'm somebody who has the money. So I'm like, hey, I got 50 grand. I'll put 50 grand in right now. Would you tell me, like, don't spend yet, go do these other ways first and then throw money on it? Or would you say like, okay, cool, you got 50 grand? This is exactly what you should do.\r\n\r\n\r\nNicholas Conley (41:25.496)\r\nYeah, I would try to build up an organic base first. Basically like content market fit, right? Like if nobody at all would subscribe to this organically, you probably don't want to bury money into it, right?\r\n\r\n\r\nNikolas Hulewsky (41:33.422)\r\nOoh.\r\n\r\n\r\nNicholas Conley (41:40.757)\r\nMost of the best like newsletters start organic and then they throw Facebook ads on the mix to like really grow because Facebook ads is the one channel where it's like you put one dollar in, you get one subscriber out. That's impossible to do with organic. You're just chasing that next like viral post that's hopefully gonna send you more subscribers. So like absolutely I'd start organic at least a few hundred subscribers and then push the ads button.\r\n\r\n\r\nNikolas Hulewsky (42:08.256)\r\nat what platform would you go and start OrganiCon? Where's the best platform for organic newsletter subscriber growth?\r\n\r\n\r\nNicholas Conley (42:16.165)\r\nThat depends on the niche and you have to just look at like where your ideal subscribers are hanging out, right? So like on X, it's probably like people into AI right now, could be people into marketing. Let's see, like finance, really? Like your platforms you're probably gonna go after are like X, Reddit.\r\n\r\n\r\nNikolas Hulewsky (42:24.44)\r\nHmm.\r\n\r\n\r\nNicholas Conley (42:37.923)\r\nYouTube can be really good, like in the comments. Instagram's pretty tough, but again, if you can go viral on Instagram, you can definitely blow up. So I feel like I just said every single platform, but it really depends on what platform you like posting on.\r\n\r\n\r\nNikolas Hulewsky (42:48.942)\r\nNo, it's also, that's it. It's what platform you like posting on and that you can go viral, well, that you can get reach on. So I'll share this really quickly. Chris, the Colonel Office, friend for 20 years, and he kind of started this journey a year ago, right? That guy on every single post had a call to action. So what do you would do? His strategy was this, I'm gonna find a viral video and then I'm gonna record.\r\n\r\n\r\nsome commentary on it like, look at this freaking guy right here. He made money farting in a bag and selling it to people in China. You know what mean? And then at the very end of his video after he gets everyone to watch it, he's like, I wrote a whole business plan right here. If you want to go check it out, boom links to his landing page, you go to the landing page and you got to subscribe to his newsletter before you can actually get the business plan. So you subscribe to the newsletter and then once you subscribe to newsletter, he's got this funnel where it's like, Hey, cool. Thanks for subscribing. You probably were looking for this lead magnet in case it's not on here. Go to this page. And so now they're\r\n\r\n\r\nNow they're in the network, right? And that was his strategy for a year. And he grew to 200,000, I think he's at 200 now, subs with $0 in paid ads. Now you could say he paid for a content team or it's his time or whatever, $0 in paid ads, nothing. It was all organic. And that was his strategy. Hey, I'm gonna go viral and then I'm gonna point everybody back. I'm not going viral because I'm doing TikTok dance. I'm doing viral for this specific thing that's pointing people back.\r\n\r\n\r\nBut what he has noticed, and he tracks it meticulously, what he's noticed is that his subscribers from Instagram have a lower open rate and a lower click-through rate than his subscribers from LinkedIn. Like his highest value subscribers are still Twitter. And then every other platform is different. So each platform even brings you a different level of value for those subscribers, depending on your niche as well. But there definitely is a strategy for the organic growth. He's just done a freaking amazing job over the last year to do what he's done.\r\n\r\n\r\nNicholas Conley (44:42.566)\r\nYeah.\r\n\r\n\r\nYeah. And I have an idea there. and this is going in a totally different direction in the AI space, but, AI avatars are, are I think like a huge opportunity right now. So I have a team basically building an AI app. It's me talking at this desk and every other day they have a video of me go live on Instagram and Tik TOK and YouTube shorts. And it's just discussing a new AI trend or topic. And I didn't have to sit there and write the script.\r\n\r\n\r\nNikolas Hulewsky (44:51.31)\r\nbut I'm here for it.\r\n\r\n\r\nNikolas Hulewsky (44:56.951)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (45:13.87)\r\nAnd it's your avatar?\r\n\r\n\r\nNicholas Conley (45:14.13)\r\ndidn't have to sit there. It is my avatar. It is me talking on that. We put out just over 20 videos, by the way, and we've had maybe one comment saying, I think this guy's AI. So that's where we understand AI and we live in a bubble of X, but people don't, it's not clocking, right?\r\n\r\n\r\nNikolas Hulewsky (45:17.336)\r\nShut the freak up. What are you using?\r\n\r\n\r\nNikolas Hulewsky (45:38.155)\r\nOkay, how did you do it? did you clone yourself? How do you have an avatar?\r\n\r\n\r\nNicholas Conley (45:41.732)\r\nYeah, totally. So it's just, it's just Heygen. So I don't know the exact URL, if you Heygen, H-E-Y-G-E-N, AI. So you feed it like a two minute video of you talking directly to the camera. It's going to clone you. So then you can ask it to, you know, say anything you want. This is like an AI avatar right here.\r\n\r\n\r\nNikolas Hulewsky (45:46.392)\r\nHey Jen.\r\n\r\n\r\nNikolas Hulewsky (45:51.982)\r\nOkay.\r\n\r\n\r\nNicholas Conley (46:06.338)\r\nIt's pretty good at voice, but what we've found is there's better voices, right? So I think it's 11 Labs is like the big voice one. There's also one called like Fish Audio that I think we're using right now. It's just better at like enthusiasm and also like content breaks. So it's not like run on sentences. And so, yeah, we're just feeding it into here. Now the real, the real alpha right now is not just letting like your AI avatar talk for five minutes, cause people will be able to tell, but it's all in like the clipping, right?\r\n\r\n\r\nSo only showing your AI avatar for like four seconds, jumping to like a screen share of like the AI app, doing something, doing like a green screen. So like, that's the real alpha right here. Or at least right now, I think probably within the next six months, you won't be able to tell. But right now, you know, you can still somewhat tell.\r\n\r\n\r\nNikolas Hulewsky (46:42.574)\r\nokay.\r\n\r\n\r\nNikolas Hulewsky (46:56.632)\r\nHow are you editing that? so how are you, okay, AI avatar, jump to screen share, back to AI avatar, jump to screen share. Like, is that being generated by AI or?\r\n\r\n\r\nNicholas Conley (47:06.499)\r\nThat requires a team still, right? So, yep. So I have a team that does all that for me.\r\n\r\n\r\nNikolas Hulewsky (47:09.432)\r\nThat's a team, okay.\r\n\r\n\r\nNicholas Conley (47:15.917)\r\nSo yeah, basically what this, I feel like right now every business owner knows that short form is a big opportunity and they probably should be on there. But no business owner has the time to sit in front of a camera every day and think of a new topic and record themselves and then figure out how to edit it or get it off to the editors, right? At least not most of them. And so that's what this completely changes, right? It's like, you don't have to sit there.\r\n\r\n\r\nNikolas Hulewsky (47:39.246)\r\nOkay, so I just signed up. So it's free creator team. Which one are you on?\r\n\r\n\r\nNicholas Conley (47:45.263)\r\nthink we're probably on team for the 4K exports.\r\n\r\n\r\nNikolas Hulewsky (47:48.43)\r\nOkay, so for free I could get three videos a month, videos up to three minutes, 720p video quality, $24 a month, unlimited videos up to 30 minutes, 1080p, five minutes of Avatar, four videos per month, I don't know what that means. Must be like a better Avatar or something. 175 languages and dialects? Holy balls. All right, I'm just gonna go free for right now. Personal. I'm listening.\r\n\r\n\r\nNicholas Conley (48:09.89)\r\nYeah, that's pretty crazy, right? Yeah.\r\n\r\n\r\nSo even there, Just think about that. You could have Nick Conley USA. You could have Nick Conley Japan, Nick Conley Mexico, right? And see where your content takes off at, because you just have no idea where it's going to go viral at. so yeah, with a team of editors in this, you can pump out multiple videos a day without ever even thinking about it.\r\n\r\n\r\nNikolas Hulewsky (48:24.394)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (48:37.934)\r\nSo could I upload like my podcast and it would just create my avatar from there?\r\n\r\n\r\nNicholas Conley (48:42.272)\r\nYou probably could, but you want like a training video to where you're looking in the camera and using like sort of minimal motions. So you probably want to record your own training video.\r\n\r\n\r\nNikolas Hulewsky (48:47.596)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (48:52.95)\r\nInteresting. Okay. Dude, I can't wait to mess around with this. Nick Connelly's friggin' blowin' my mind, bro.\r\n\r\n\r\nNicholas Conley (48:57.22)\r\nyeah. There's just so much, so much cool stuff going on with AI and the internet right now. It's just like, you know, how can you not be excited about it?\r\n\r\n\r\nNikolas Hulewsky (49:01.55)\r\nI'm\r\n\r\n\r\nNikolas Hulewsky (49:07.404)\r\nAnd so you brought that up as a way to like, okay, if you can't spend a bunch of money to go acquire customers and you need organic content, this is one way to potentially, I guess, juice the system. So like more content equals potentially more eyeballs.\r\n\r\n\r\nNicholas Conley (49:19.574)\r\nYeah, yeah, I mean, you could essentially do what Chris is doing except like, let's say you had a budget of, know, to have an editing team, right? So it's like, you could just put out multiple videos per day without actually, you know, take, you could take that excuse out of the picture of like, well, I can't like sit in front of my phone all day and record.\r\n\r\n\r\nNikolas Hulewsky (49:37.848)\r\nWow.\r\n\r\n\r\nmy gosh, I can't wait to try this. Nick, where is the best place for people to come find you?\r\n\r\n\r\nNicholas Conley (49:45.295)\r\nProbably on X. Nick Conley on Twitter. X. Yep. I'll be on there.\r\n\r\n\r\nNikolas Hulewsky (49:47.662)\r\nOkay, Nick Conley. All right, I wanna link Nick's newsletter, what was it? It was the ad library website that you created. It's freaking legit.\r\n\r\n\r\nNicholas Conley (49:57.844)\r\nyeah, newsletterads.co I think is the URL. Yep.\r\n\r\n\r\nNikolas Hulewsky (50:01.966)\r\nYep, newsletter ads.co. I can't wait to have you back on, man. I need to have you back on. This great. Okay, talk soon.\r\n\r\n\r\nNicholas Conley (50:06.478)\r\nBeautiful. This is fun. Thank you for having me.",
  "metadata": {
    "duration": "",
    "date": "2025-08-04",
    "platform_source": "Google Drive"
  }
}