{
  "episode_number": "250",
  "episode_title": "Entrepreneur's Guide to Real Estate Investing",
  "guest_name": "Robert Leonard",
  "business_name": "Real Estate Entrepreneur",
  "transcript": "﻿Nikolas Hulewsky (00:00.894)\r\nAll right, welcome back to Nick economics. I've got Robert Leonard with me who is a real estate entrepreneur. He's done over a dozen real estate transactions, but I think the coolest thing that I like about him is he's had a podcast with over 15 million downloads, teaching people the stuff that we're about to talk to talk about today, which is getting into real estate as entrepreneurs. Robert, I'm stoked to have you. You're in New Hampshire, right?\r\n\r\n\r\nRobert (00:24.545)\r\nI am, I am.\r\n\r\n\r\nNikolas Hulewsky (00:26.12)\r\nOkay. I think there's this funny thing in entrepreneurship where we as entrepreneurs look at guys like you who are like, man, it must be fricking nice to have just a portfolio of real estate assets, just collecting that passive income, bro. I want to do that. But then I've known guys like you who are on the other end of the coin. They're like, man, it must be nice to have an SMB with no capped upside where I'm like, I got cashflow and I'm building real asset value in this enterprise. So there's kind of like a grass is greener.\r\n\r\n\r\non both sides of the equation, having been on both sides of it, which grass do you think is greener?\r\n\r\n\r\nRobert (01:01.408)\r\nIt depends where you are in the journey. think if you're early on in the journey, the SMB path is greener. If you're a little bit further along, I think the real estate path is greener. And we can dive into that a little bit more in the journey, but yeah, that's what I think. If you're early-ish on in your journey, I think the SMB route or just any entrepreneurial venture is the better route, the greener route. And then real estate is greener a little bit later on.\r\n\r\n\r\nNikolas Hulewsky (01:25.63)\r\nMm-hmm.\r\n\r\n\r\nWhy? Let's talk about that.\r\n\r\n\r\nRobert (01:30.88)\r\nIt takes money. It just it does. Like there's a lot of stuff out like there are a lot of strategies and sure there are some people who have done some like really creative stuff through wholesaling and subject to and some other stuff that you can do that can get really creative to get some deals with little capital. And you can snowball that by getting one or two deals and then tapping into the equity and.\r\n\r\n\r\nNikolas Hulewsky (01:53.726)\r\nYou\r\n\r\n\r\nRobert (01:55.086)\r\nputting that into two or three more deals. And so it can be done. I'm not saying it can't be done, but ultimately you'll just have a lot better experience in real estate if you do have some capital, generally speaking, if you want that to be like your real income generator and versus on the other side, like a business or SMB or any type of entrepreneurial venture, whether it's a side hustle or a real startup, it can be done with a lot less capital, especially these days. So I think that that's why.\r\n\r\n\r\nNikolas Hulewsky (02:09.875)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (02:20.542)\r\nTotally. I had Chris Berg on my podcast a little while back and he's an entrepreneur. had an e-commerce business, was kicking off a bunch of cash. And it was only, I want to say in the last five years, he's 50, but in last five or 10 years where he realized, oh my gosh, I should be putting my money in real estate because I put my money back into real estate. get all the tax advantages and then I have more money to then reinvest in my business which generates more cash that I can put back into real estate. So I agree with you like down the road when you have some cash.\r\n\r\n\r\nit's nicer to funnel money into real estate. Whereas in the beginning, you don't have cash, you're just trying to get in the game. So starting a small business doesn't really require you to go out and raise $100 million. You could start a small business with a hundred bucks or for nothing if you know what you're doing.\r\n\r\n\r\nRobert (03:07.564)\r\nYeah, exactly. And that's my exact approach is make the money in a side hustle or a business and then or even your job and then put that into real estate once you have enough. That said, there is a strategy that you can do early on that does not take a lot of money. I just don't know if I'd say it's like real real estate investing and that's house hacking. And I do think that that is great when you're just starting without a lot of money. But when it comes to just general real estate, yeah.\r\n\r\n\r\nNikolas Hulewsky (03:30.066)\r\nWhat about?\r\n\r\n\r\nWell, I've seen a lot of guys who were like, they're trying to get into real estate. Real estate is amazing, right? You have a physical asset that appreciates over time faster than the rate of inflation. Just generally speaking, I don't know what the real number is, but let's call it on average, real estate appreciates at 7 % a year, inflation is 3%. So there's a delta there. So that's one thing. The other thing is the more physical assets that you have, the more leverage you have.\r\n\r\n\r\nRobert (03:44.952)\r\nSometimes, yeah.\r\n\r\n\r\nNikolas Hulewsky (03:59.458)\r\nOnce you kind of build this portfolio, you can go out and get loans against that portfolio to buy other things. And then over time, you get this mythical thing that people like to refer to as passive income, which I always say passive income doesn't exist unless you were born rich or you have like $50 million from another business. Then you can like buy enough real estate to have quote unquote passive income. But I think, I think people love the allure of real estate kind of for those reasons. However, I've seen people try to get into the real estate game.\r\n\r\n\r\nwith things like wholesaling with things like what you say section two or like loan assumption subject to thank you. Can you talk about what those are?\r\n\r\n\r\nRobert (04:40.078)\r\nYeah, I'm definitely not an expert on the subject to piece, but the wholesale is basically say you see a house for sale and they're listing it. It's super run down, like needs a lot of work and they're selling it for say a hundred thousand. You go to them and you say, Hey, I'll buy this for a hundred thousand because you think it's worth, let's just say 120, but they're selling it for less than they should be for whatever reason. I mean, there's an infinite number of reasons why they're\r\n\r\n\r\nNikolas Hulewsky (05:06.856)\r\nRight.\r\n\r\n\r\nRobert (05:07.95)\r\nlistening for less, right? So you go to them, you get it under contract for $100,000. And then you don't actually close on it. You just get it under contract. You go find somebody else, most likely a flipper who will buy that house for will pay you 120,000. So what you do is you take that contract that you signed with the original seller and you assign that to the flipper and the flipper pays you 120, you give 100 to the seller and you keep the difference of 20,000. That's wholesaling. You could do that without any capital. So.\r\n\r\n\r\nNikolas Hulewsky (05:34.517)\r\nYeah. Well, and like the crazy thing about wholesaling is it's just a business. Like literally you just started a business and you're a broker between the buyer and the seller. So back to our original points, like totally. Yeah, it totally is. And then hopefully you get enough money over time where it's like, okay, now I have enough cash, a big enough slug to start buying the real estate as opposed to just doing wholesaling. What's the subject to? Cause I've heard this one a lot.\r\n\r\n\r\nRobert (05:39.916)\r\nYeah.\r\n\r\n\r\nIt's more like an SMB than it is real estate, really. Yeah.\r\n\r\n\r\nRobert (06:00.02)\r\nYeah, I'm definitely not an expert on that. Like so much so that I couldn't even explain it enough to make it worthwhile, but I believe it's some sort of assumption on somebody's loan, I believe. Again, I'm not an expert on that by any means. That's probably the part of real estate I know the least.\r\n\r\n\r\nNikolas Hulewsky (06:02.238)\r\nThat's okay.\r\n\r\n\r\nNikolas Hulewsky (06:14.078)\r\nYeah. No, no, you're good. get. Yeah. Anybody who's in real estate that's listening is probably like banging their head against the wall. Like you morons. It's not even called subject to the way I understand it is you as the seller could assign the loan to somebody else. Now there's a question of whether or not in the loan document, the bank is going to allow you to assign that loan. And in many cases, they're not allowed to assign that loan and the loan can become, you know, can be called due. But then there's like all these mitigation strategies.\r\n\r\n\r\nRobert (06:21.655)\r\nYeah.\r\n\r\n\r\nRobert (06:36.558)\r\nwhich is the big problem, yeah.\r\n\r\n\r\nNikolas Hulewsky (06:44.058)\r\neffectively what it is if I just translate it to the SMB world, it's similar to buying a business and assuming the debt of the business. So be like almost almost like a seller note. But there you know, there is that sort of third way where you could buy a business from a seller and just have a have them carry the note as well if you're trying to get into entrepreneurship. So anyways, those are all the hacky ways. I don't mean that in a negative way. But like those are all that kind of hacky ways to get into real estate. I wanted to just highlight because I've I've heard about them and just wanted to say like they exist.\r\n\r\n\r\nI'm more interested though in this approach that you're talking about, whereas, okay, you've got a small business or you've got some income and some cash. You don't have $500,000, but maybe you got 50 grand or maybe you have $75,000 and you want to just start getting into real estate. What's the best way to get into real estate if you are that person who has some extra cash, a good job or good business that's kicking off cashflow, what would you do?\r\n\r\n\r\nRobert (07:39.436)\r\nYeah, so I think that if you're interested in subject two, look up pace Morby. I think he's really into subject two. I stick in my vertical. Like I know a couple of different strategies and I stick there. I don't, I don't really go into the other stuff. That's why I don't know it. But so when you're, just getting started in that exact situation that you just mentioned, there's two things you could do. And I've done them both successfully. The first one is you can house hack. can dive into that very common strategy. A lot of people know it.\r\n\r\n\r\nNikolas Hulewsky (07:45.697)\r\nyeah.\r\n\r\n\r\nNikolas Hulewsky (07:49.17)\r\nHahaha\r\n\r\n\r\nRobert (08:08.654)\r\nBut we could dive into that and then you can invest long distance in real estate. A lot of people live in expensive markets, especially if you have a good paying job, you're able to save up some capital. Not to say that that can't be done in like the Midwest or some lower income, lower cost of living places, because obviously it can. But just generally speaking, a lot of people have these higher incomes in on the coast. And what they could do is take that money and invest it long distance in real estate.\r\n\r\n\r\nin lower cost areas where you could buy a property that you might not be able to buy where you are.\r\n\r\n\r\nNikolas Hulewsky (08:40.894)\r\nTalk about house hacking. is that? Are you stealing someone's house?\r\n\r\n\r\nRobert (08:43.094)\r\nYeah, house hacking, think is the best. Yeah, think. Yeah, basically. No, I think it's the best. When you're first getting started, you just you buy a property in the simplest form. What you do is you buy a property and you rent out any space on that property or in that property that you don't need. Traditionally, when like house hacking was originally created, it was buying a multi unit and renting out one of the units. You live in one. You rent out the other. You reduce your mortgage. But it's kind of a duplex.\r\n\r\n\r\nNikolas Hulewsky (08:46.717)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (09:10.142)\r\nSo you're buying like a duplex or a triplex and yeah.\r\n\r\n\r\nRobert (09:12.846)\r\nTriplex, fourplex, yep. But it's expanded from there. Like that's how it started. That was the like original, what house hacking is. But now it's kind of expanded. You could do it with a single family house and rent out some bedrooms. I go as far as saying it's still house hacking. If you buy a house with the intention of renting out some of the yard space, because you know that that's valuable and you could rent it out to people who need to store RVs or boats or whatever. That's still in my eyes, that's still house hacking because you're buying it.\r\n\r\n\r\nNikolas Hulewsky (09:41.352)\r\nWhat? People rent out yard space?\r\n\r\n\r\nRobert (09:43.745)\r\nyeah, for sure, for sure.\r\n\r\n\r\nNikolas Hulewsky (09:46.59)\r\nOkay, so I'm sorry, keep going, I keep getting you off.\r\n\r\n\r\nRobert (09:48.566)\r\nYeah, yeah. So I think if you buy any property that has additional space, whether it's inside or outside, with the intention of renting it out to reduce your housing costs, that that's house hacking.\r\n\r\n\r\nNikolas Hulewsky (09:59.826)\r\nHmm, totally agree. Tell me more about this renting your yard space. Is this somebody who has like five acres and they're like, I'm going to let someone use two of the\r\n\r\n\r\nRobert (10:10.074)\r\nIt could be. It could be or it could also be my previous house actually just moved a couple months ago, but my previous house, I didn't have a lot of land. had like a tenth of an acre. So like I barely had any and it was almost all driveway. Like I lived in the city, but a lot of places in the city, they don't even have off street parking, but I had a very large parking lot driveway. So people could either park their cars there. They could park.\r\n\r\n\r\nNikolas Hulewsky (10:22.494)\r\nMm-hmm.\r\n\r\n\r\nRobert (10:32.526)\r\nRVs there, they could park boats in the yard and they'd pay me, you know, whatever, 50, a hundred, 200 bucks a month to park that stuff there. But then also, again, this is just where I live, but it happens across the whole U S really is like, you could have people who live in the city don't really have, you know, land, but they might have suburbs that are 10, 15, 20 minutes away and people have a little bit more land and you could just rent a space for leaving your RVs, your boats or anything like that out there.\r\n\r\n\r\nNikolas Hulewsky (10:33.31)\r\nWhat?\r\n\r\n\r\nNikolas Hulewsky (10:58.536)\r\nDude, so you were renting some of your driveway?\r\n\r\n\r\nRobert (11:01.356)\r\nYeah, yeah, I've done that. But I was in a multifamily, so the main focus was renting out one of the units. But yeah, you could definitely do that for sure. There are platforms that will do that. Like, I don't know if you've seen this, but like you could rent out your pool now. Like there's Uber for pools. Yeah, so there's stuff like that. You can rent tools from your neighbors. You can do all kinds of stuff. There's platforms that actually facilitate this now. But yeah, you're basically just turning your yard or garage space or sheds into like a\r\n\r\n\r\nNikolas Hulewsky (11:03.769)\r\nNo freaking way.\r\n\r\n\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (11:17.086)\r\nI've seen that. Yeah, yeah, yeah.\r\n\r\n\r\nRobert (11:29.984)\r\nself storage facility kind\r\n\r\n\r\nNikolas Hulewsky (11:32.008)\r\nSo you view you view house hacking as like any any type of income you can use to offset that mortgage that you're using to you know to pay for the house. Interesting. Is it like it totally has to supplement or offset it like okay if I'm no it just has to reduce that mortgage and then what do you do so you just you save that money and then you buy a second house or like I get that house hacking gets you in the game but if you if house hacking is your strategy into real estate what's the next.\r\n\r\n\r\nRobert (11:38.382)\r\nYeah, yep. That's the way I view it.\r\n\r\n\r\nRobert (11:46.358)\r\nNo, no, just has to reduce it. Just has to reduce it. Yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (12:00.428)\r\nLike how do you snowball into the next step?\r\n\r\n\r\nRobert (12:03.436)\r\nWell, so there's a couple of things. One, the reason why it's the initial step is because it teaches you. You're not going to really learn about real estate if you're renting out your yard space. But if you're having actual tenants, like you, whether it's a bedroom or an additional unit, you learn all of what goes into actually having rental property. You learn how to screen tenants, find tenants, list rentals, clean up utilities, like just unit turnovers, like everything that goes into having rental properties you learn. And I basically say it's like,\r\n\r\n\r\nNikolas Hulewsky (12:12.659)\r\nYeah.\r\n\r\n\r\nRobert (12:33.548)\r\nreal estate investing with training wheels, because you're learning it on like a very small, simple scale. So there's that aspect of it is like, you just get to learn from a really like simple strategy, I guess, or a little like, without a lot of risk. And then the other piece from like a economic perspective, you'll generate, you'll generally generate equity in that property, depending on how long you've lived there. And you can tap into that equity through a home equity line of credit, or home equity loan. And then you could use that to purchase another property or\r\n\r\n\r\nNikolas Hulewsky (12:44.413)\r\nYeah.\r\n\r\n\r\nRobert (13:02.956)\r\nYou can just take the money that you saved by offsetting your housing costs, save that while you live there, and then use that money to buy another one. Whether that be a rental property or another house hack, because you only have to live in the house hack for 12 months. So one year, and then you can move. So like, if you really wanted to hit this hard, you move into one. That's what the loan loan requirements. When you signed on the note, you basically agree that you'll live there for a year. Yeah.\r\n\r\n\r\nNikolas Hulewsky (13:20.602)\r\nWait, why? I don't understand.\r\n\r\n\r\nNikolas Hulewsky (13:27.038)\r\nokay. Because I couldn't go get a loan on a place that I'm not, well, I could get a loan on a place I'm not living in, but it would, got it.\r\n\r\n\r\nRobert (13:33.006)\r\nYou could, but that's a rental. That would just be a rental property. You'd just get a 20 % down. So that's the difference, right? You're getting this loan, but you only have to put sometimes 0 % down if you're a VA or a veteran, you know, but, or 3 % down, 5 % down for these home owner occupied loans versus if you just go and get a loan and you're not going to live there, you have to put 20, 25 % down.\r\n\r\n\r\nNikolas Hulewsky (13:39.806)\r\nNikolas Hulewsky (13:44.466)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (13:55.166)\r\nokay. So that's why house hacking makes less and it's way less money down, gets you in the game. You start, you you start learning some things and then you can, you can move on to that. So you take that those 12 months like that next year and you're just learning.\r\n\r\n\r\nRobert (13:59.746)\r\nway less money down.\r\n\r\n\r\nRobert (14:07.608)\r\nsave up or tap into the equity and then buy another one in month 13 and then kind of keep doing that over and over.\r\n\r\n\r\nNikolas Hulewsky (14:13.734)\r\nSo in month 13, the loan, it doesn't do anything to the loan. They're fine. They're like, okay, yep, it's fine.\r\n\r\n\r\nRobert (14:17.526)\r\nIt's the same. No. Yep. Completely fine. Yeah. Just have to be there for 12 months.\r\n\r\n\r\nNikolas Hulewsky (14:22.352)\r\nI didn't realize that.\r\n\r\n\r\nNikolas Hulewsky (14:28.894)\r\nSo let's say month 13, you move out and it becomes a rental property.\r\n\r\n\r\nRobert (14:32.398)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (14:34.79)\r\nAre you then like depreciating the cost of that real estate? You know what mean? Like, can you go get a\r\n\r\n\r\nRobert (14:37.294)\r\n100%. Yeah, you're depreciating it the whole time though. You depreciate it while you live there and while you don't. You're just depreciating a different percentage. Yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (14:42.525)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (14:46.672)\r\nOkay.\r\n\r\n\r\nRobert (14:46.722)\r\nSo if you have a duplex and you're living in one unit, you could, and the other, let's just for simple purposes, and again, I'm not a tax professional, but let's just, for simple purposes, if you have a duplex, yeah, I pretend. The backwards hat wearing tax professional. So if you have a duplex, both units are, let's just assume both units are the same. You live in one, you rent out the other.\r\n\r\n\r\nNikolas Hulewsky (14:56.382)\r\nLet you play one on TV.\r\n\r\n\r\nHahaha\r\n\r\n\r\nRobert (15:14.176)\r\nyou can essentially depreciate 50 % of that property per year. And you can often write off 50 % of your landscaping costs or just other costs that you have that keep up the property.\r\n\r\n\r\nNikolas Hulewsky (15:26.606)\r\nReally? You could write off the landscaping.\r\n\r\n\r\nRobert (15:27.758)\r\nYeah, and then once you move out, it becomes 100%. Yeah, yep.\r\n\r\n\r\nNikolas Hulewsky (15:33.034)\r\nIt's always funny when when you know first time entrepreneurs get to taxis and they're like, well, that's a write off. Like yeah, I like it doesn't mean it's free money like you still you still pay for it. It just reduces your overall tax liability.\r\n\r\n\r\nRobert (15:41.814)\r\nYeah, yeah, it's nice, but it's not like it's not the end of the world, but it is nice for certain things, you know, like if you pay a company to do snow removal or, you know, whatever, something like that, it could be helpful. And consult with a tax professional, make sure that this is all like kosher for your situation. But yeah, yep. And then you move out and it's 100 % the way way normal rent the property would be after that.\r\n\r\n\r\nNikolas Hulewsky (15:49.597)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (15:56.977)\r\nOkay.\r\n\r\n\r\nYeah, yeah, yeah, yeah.\r\n\r\n\r\nWhen you do the house.\r\n\r\n\r\nNikolas Hulewsky (16:08.126)\r\nSo when you do the house hacking, let's say like someone wants to get in house hacking. Do you start? I know this isn't legal or financial advice, but let's just role play here. Would you start a new LLC? Are you like, you just doing it under your name, but you're methodical about what expenses you're tracking.\r\n\r\n\r\nRobert (16:20.962)\r\nNo, you just do it under your name. You have to do it under your name. You have to.\r\n\r\n\r\nYeah, you have to run bookkeeping just like you would for any type of business because you have to do taxes at the end of the year. You just you do want to be careful about your insurance. Just check your insurance. But yeah, you can't you can't do this with an LLC because you're getting the loan as a homeowner as the owner occupied loan. So it's got to be in your name. Yeah.\r\n\r\n\r\nNikolas Hulewsky (16:30.513)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (16:45.886)\r\nI see what you're saying. Yeah. Okay. That makes sense. Um, so let's talk about the other end of the spectrum. Let's say you're somebody who has 75, $100,000 and you don't want to house hack and you live somewhere, but you want to buy a rental property. The sexy thing right now is like, I'm going to buy an Airbnb. Um, are you seeing that kind of recede and people going back into single family homes or rental properties? Or are you still seeing the Airbnb market super hot?\r\n\r\n\r\nRobert (17:16.886)\r\nFrom what I've seen, and I'm not an Airbnb investor, which I can explain to you why, but from what I've seen, the headlines that I've read, it seems like the Airbnb market is cooling quite a bit. So it doesn't seem like that that's the best approach these days, but I could be wrong there. Definitely not where I focus the most.\r\n\r\n\r\nNikolas Hulewsky (17:18.429)\r\nCough cough\r\n\r\n\r\nNikolas Hulewsky (17:34.523)\r\nSo why do you not like Airbnb? Why do you like traditional single family long-term tenants?\r\n\r\n\r\nRobert (17:43.294)\r\ncause I don't like Airbnb personally. So because I don't like it, like as a, as a consumer, I don't like it. That's what I mean. Yeah. I don't like the product that much. I don't like staying in Airbnb's. I'd much rather just stay in a hotel. So, for me in anything I do, whether it's a business or real estate or anything like that, I have to be interested in it. And I just don't personally really like staying in Airbnb's that much. think they're a pain in the ass. I think they're a headache. I'd rather just check into the hotel and not have to worry about anything. So.\r\n\r\n\r\nNikolas Hulewsky (17:45.36)\r\nYeah, but why? you don't like the product? Okay.\r\n\r\n\r\nRobert (18:13.026)\r\nThat's just why I could never get into Airbnb. And then also from there, it's just really labor intensive. And even if you have a management company, all that, it's still, there's a lot of turnover and there's just a lot of stuff that can go wrong and people aren't taking care of it as well. There's just a lot more headaches that can come with that. And with rental properties, depending on how you do it, there could be, it can be a lot more passive. It's not passive income, but you have a lot less headaches and.\r\n\r\n\r\nNikolas Hulewsky (18:21.095)\r\nYeah.\r\n\r\n\r\nRobert (18:41.154)\r\na lot less turnover and issues.\r\n\r\n\r\nNikolas Hulewsky (18:43.534)\r\nI've talked to people before who were like, unless I can buy, unless I have 10 rental properties, I don't want to have just one rental property. Why?\r\n\r\n\r\nRobert (18:53.102)\r\n100 % agree.\r\n\r\n\r\nIt's just not worth it. So that's where I'm at right now, actually. I was, you had mentioned at the beginning, I had a podcast. And if you go back and you listen, my philosophy has changed a lot from back then to now. I was always a believer that, you know, even just a couple of units was great. But I think as you start to maybe learn a little bit more, maybe have a little bit more income,\r\n\r\n\r\nNikolas Hulewsky (18:59.112)\r\nSay more.\r\n\r\n\r\nRobert (19:25.23)\r\nmaybe work on some other projects, you start to realize that there's a lot of risk in rental properties. Even if you're insured, if somebody slips and falls or whatever happens, like you have a lot of risk. So is the $250 to $500 a month in cashflow that you may or may not get if there's repairs or whatever, is that worth the massive risk? And then also when I was a bit younger, not that I'm old now, but when I was younger,\r\n\r\n\r\nI was very accepting of debt. I was very happy to just like, you know, buy a property, let it appreciate a little bit, take out as much equity as I could, put it into another one, take out as much equity as I could, put it into another one, just keep having tons of debt as long as it's being serviced by the properties. But I don't personally have that philosophy anymore. I'm much more debt adverse now. become, I used to not really like Dave Ramsey at all. And I liked Dave Ramsey a lot now. And I'm much more into having no debt.\r\n\r\n\r\nSo that has changed my philosophy a lot. So basically to your point is it just You're gonna a couple units one two three units. You're gonna make 250 to 300 bucks a unit in profit on average. That's if nothing breaks and You're doing it appropriately by setting aside You know things that you need to for repairs and maintenance and things like that So with the risk and then you're probably putting you know, fifty seventy five thousand dollars into it You just make a lot more money just put that money in the stock market\r\n\r\n\r\nput in the index fund, not financial advice, and you'll just do much better. So it really just doesn't start to make a lot of sense until then. So you like 10, 20, 30 units. No, no, no. All of my deals have been great. Yeah, yeah, I don't wanna, like I honestly kind of feel like I was like enlightened. As weird as that sounds. Yeah, like.\r\n\r\n\r\nNikolas Hulewsky (20:55.794)\r\nDid you get?\r\n\r\n\r\nDid you get burned? Like have you been burned on like any particular deals? No. You're just looking back and you're like.\r\n\r\n\r\nThat's so interesting.\r\n\r\n\r\nNikolas Hulewsky (21:13.032)\r\nReally?\r\n\r\n\r\nRobert (21:17.058)\r\nI've been selling off my portfolio. I've been kind of getting out of it because of all those reasons I just said. think, yeah, I just don't think it's a great way when you're first getting started.\r\n\r\n\r\nNikolas Hulewsky (21:29.288)\r\nSo is it because the economics have changed now? Like is it because the asset value, right? The real estate underlying asset value has skyrocketed and so the returns just, they're not 15, 20 % annualized returns anymore. They've regressed pretty significantly or has your appetite changed?\r\n\r\n\r\nRobert (21:48.704)\r\nMy appetite has changed. Well, both are true. Both of those things can be true and are true. So my appetite has changed, but also the market has changed. Asset values are way higher and also interest rates are much higher, which are making the debt much more expensive. So it's definitely not as attractive of an environment right now. But also that said, like my whole portfolio, I had fixed debt. I wasn't paying more for the assets. My debt.\r\n\r\n\r\nNikolas Hulewsky (21:51.698)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (22:04.99)\r\nMm.\r\n\r\n\r\nRobert (22:16.366)\r\ncosts were fixed. So I wasn't really at the mercy of the market and I still was, I'm still exiting all of mine just because even though they were fairly profitable, just, I just didn't find it was worth it. I would rather take that money in time, put it into a side hustle or SMB and then put that money maybe into a bigger property in the future.\r\n\r\n\r\nNikolas Hulewsky (22:43.006)\r\nDude, this is funny, because I was like, I was like all into, okay, cool, we're gonna talk about how as an entrepreneur, you can funnel money into real estate, which I still think is something you should do. The house hacking?\r\n\r\n\r\nRobert (22:52.972)\r\nYou can. That's the way to do it.\r\n\r\n\r\nWell, house hacking is great, period, for anybody. But what you just said is entrepreneur funneled the money into real estate. That, I think, is great. But I wouldn't do it if you just had an entrepreneur that has enough money to buy one or two. I wouldn't do it. But if you could buy a 30 unit apartment or a 15 unit apartment building, that I would definitely consider.\r\n\r\n\r\nNikolas Hulewsky (22:59.451)\r\nNikolas Hulewsky (23:06.558)\r\nwith single family.\r\n\r\n\r\nNikolas Hulewsky (23:11.811)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (23:18.462)\r\nWhat about syndicated deals where it's like, okay, I can't buy a 30 unit apartment building, but there's this fund or I know this person who's running a deal and they have me as an LP in that fund. Does that make sense at this point? Or are you like, it can make sense. Okay.\r\n\r\n\r\nRobert (23:31.982)\r\nSure, 100%. A lot of times you'll have to be accredited for that. So depending on your income and financial situation, you might not be able to invest in those anyway, because you have to be accredited. But let's assume you can. Your returns are probably going to be lower. You have to make sure that you do your due diligence on the syndicator. sure you know who you're investing with. But it can make sense. I have some syndication investments, and they've been fine.\r\n\r\n\r\nbut you get that extra alpha by doing the work yourself, finding the deal, sourcing the deal, managing the deal, finding the debt, securing the debt. So you're definitely gonna have lower returns, but it can be a way to do it passively for sure.\r\n\r\n\r\nNikolas Hulewsky (24:06.066)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (24:12.68)\r\nThat's funny. like I outlined in the beginning of the episode, you're definitely swinging from the all in on real estate to like, I think I could probably get better returns in the SMB space. Whereas many of these SMB owners are like, maybe I could put some money into the real estate, but it's not an all or nothing proposition. It doesn't have to be. Yeah. Yeah. Let me ask you this. All right. you've owned lots of properties. You've obviously been in this space for a long time. Now let's, let's give the people what they want. Let's give them some red meat.\r\n\r\n\r\nRobert (24:28.568)\r\nNo, do both. Do both. Yeah, do both. Yeah.\r\n\r\n\r\nNikolas Hulewsky (24:41.234)\r\nWhat are your favorite home services businesses? You've seen all the headaches you've had to freaking manage tenants and plumbing and HVAC and whatever else. What are the home services businesses that you love that you maybe you're starting or you're like, yeah, if I was an entrepreneur starting out, demand is always going to be there. I love these types of businesses.\r\n\r\n\r\nRobert (25:04.971)\r\nWell, to caveat that I was a CFO for a plumbing and HVAC company for five years. So I know that I know the trades decently well. I was not out actually doing the work, but I know the trades fairly well. It was fractional and it was helping out a friend of mine who started this company. But so I think that those are the best anything that you can that is needed. like there are great businesses that are not needs. But the problem with that, in my opinion, is that\r\n\r\n\r\nNikolas Hulewsky (25:10.32)\r\nhello, okay.\r\n\r\n\r\nNikolas Hulewsky (25:16.691)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (25:28.99)\r\nOkay.\r\n\r\n\r\nRobert (25:34.08)\r\nIf it's a lot, you might have some significant economic risk versus if your heat goes out, you've to get it replaced. Whether you can really afford it or not, you're going to find a way. if your toilet stops working, your shower stops working, you know, your plumbing is not working. Like you have to do that and you'll find a way to get the money for it some way or another. But if you don't like the paint color in your house or your house is a little dirty on the outside, you might just wait to pressure wash it or get it painted or, know, something like that. You might just do it yourself even. So\r\n\r\n\r\nThose are the things I do think they are good businesses, painting, pressure washing, you know, all that kind of stuff. I think it's great, but it's a want, not a need. The caveat there is HVAC plumbing, a lot of states require a license. So it's not like you or I can just hop in and create a plumbing and HVAC company.\r\n\r\n\r\nNikolas Hulewsky (26:19.102)\r\nAll right, let's do this. I'm gonna name a a home services business. You tell me needed or not needed. All right. Plumbing.\r\n\r\n\r\nRobert (26:24.46)\r\nOkay. Okay.\r\n\r\n\r\nRobert (26:31.032)\r\nneed.\r\n\r\n\r\nNikolas Hulewsky (26:31.87)\r\nElectric.\r\n\r\n\r\nRobert (26:34.198)\r\nNeed. Need.\r\n\r\n\r\nNikolas Hulewsky (26:37.928)\r\nhouse cleaning.\r\n\r\n\r\nRobert (26:39.584)\r\nNot need, want.\r\n\r\n\r\nNikolas Hulewsky (26:40.476)\r\nNot needed, definitely not needed. Carpet cleaning.\r\n\r\n\r\nRobert (26:44.064)\r\nNot needed. Yeah, definitely not.\r\n\r\n\r\nNikolas Hulewsky (26:45.512)\r\nquickly.\r\n\r\n\r\nOn the same level as house cleaning.\r\n\r\n\r\nfeel like people are more, yeah, that's true. Yeah, yeah, okay.\r\n\r\n\r\nRobert (26:54.068)\r\nYeah. You can clean your carpet yourself. You go to Walmart and get a vacuum, a pretty decent one, and some soap for fairly little money and get that done yourself, really. Like, if times are tough, you know what I'm saying?\r\n\r\n\r\nNikolas Hulewsky (27:04.112)\r\nOkay, gutter cleaning. yeah, yeah, yeah, yeah, yeah. Is it a recession proof business? Yeah. Window cleaning and gutter cleaning.\r\n\r\n\r\nRobert (27:09.462)\r\nRecessionary time. So yeah, exactly.\r\n\r\n\r\nRobert (27:16.897)\r\nwants.\r\n\r\n\r\nNikolas Hulewsky (27:18.574)\r\nright? Landscaping.\r\n\r\n\r\nRobert (27:19.852)\r\nI mean, you're not getting granny. Granny's not getting up on a ladder and cleaning her gutters, but granny's got kids or grandkids or uncle or whatever, and they can get up there and do it. So it's definitely a want.\r\n\r\n\r\nNikolas Hulewsky (27:25.757)\r\nSure.\r\n\r\n\r\nNikolas Hulewsky (27:30.014)\r\nAll right, these next three, I think, are very interesting. Landscaping and lawn care.\r\n\r\n\r\nRobert (27:37.144)\r\nIt's also a want. It's gotta. Get out there and mow it yourself. Push it.\r\n\r\n\r\nNikolas Hulewsky (27:38.448)\r\nIt's gotta be a want for sure. This one, this one though.\r\n\r\n\r\ntree trimming and removals.\r\n\r\n\r\nRobert (27:46.39)\r\nWant. Inmote. Yes. And I told you before this, just bought Tyler's stump grinding playbook. So like I'm interested in that business, but I think it's a want for the most part. And that's my, one of my biggest hesitations with this business is that I think it's mostly a want. Are there situations where it is indeed? Sure. You have tree problems, the tree, you know, falls down, it's dead. It's going to fall and land on your house or you, you know, the roots are growing into your septic tank or into something like.\r\n\r\n\r\nNikolas Hulewsky (27:48.401)\r\nreally?\r\n\r\n\r\nNikolas Hulewsky (27:53.214)\r\nYeah, yeah, yeah.\r\n\r\n\r\nRobert (28:16.152)\r\nThose are needs, but I think generally speaking, it's probably mostly wants. I don't like this tree, I want it gone, I want to put a fence there, I want to do this, but like, if the tree has to stay there because I don't have any money, it can wait till next year or the year after.\r\n\r\n\r\nNikolas Hulewsky (28:29.084)\r\nYeah, yeah, think it kind of depends on what part of the country you're in. It definitely depends on the reasoning. I definitely wouldn't put it in the same category as house cleaning or carpet cleaning, primarily because similar to HVAC, which is not always the case, but there can be an insurance component that will pay for it. So if a tree, if there's a storm and a tree falls,\r\n\r\n\r\nRobert (28:40.61)\r\nDefinitely not. No.\r\n\r\n\r\nNikolas Hulewsky (28:54.052)\r\nyou can have an insurance claim that will pay for it. it's not just somebody coming out of their pocket, but there are these instances obviously where insurance will pay for something. But I do think it is more of a need because of the potential of harm. And yeah, that was an interesting one. But I think you're probably right. I think it is more of a want.\r\n\r\n\r\nRobert (29:13.806)\r\nSee, I think it's more of a want, but I think the piece that you have is that it's not as DIY friendly. like cleaning, somebody can go and get cleaning supplies, do it themselves, painting, gutters, whatever, they could do it themselves. Even if it's a need, they could do those things. And you could do stump grinding or tree trimming yourself if you really wanted to, if you felt comfortable, you could go get the equipment and do so. But I think a lot of people wouldn't feel comfortable renting that.\r\n\r\n\r\nand running it themselves. Some would, but a lot wouldn't.\r\n\r\n\r\nNikolas Hulewsky (29:44.83)\r\nthink that would be the same of HVAC or plumbing or electric. It's like, I could figure this out. I could get chat GPT. I'm just saying, it's a similar type of approach that you could run into. But all of those things have the same risk profile. If my toilet's clogged, that's an existential risk to my family. If a tree limb is looking pretty precarious, like,\r\n\r\n\r\nRobert (29:51.522)\r\nSome people, yeah.\r\n\r\n\r\nNikolas Hulewsky (30:13.48)\r\nthat could fall and kill somebody, you're gonna get your treat. Anyways, okay, that was an interesting one. All right, here's my favorite, you ready? Pest control.\r\n\r\n\r\nRobert (30:17.41)\r\nThat is true.\r\n\r\n\r\nRobert (30:21.389)\r\nYep.\r\n\r\n\r\nRobert (30:25.998)\r\nthat is...\r\n\r\n\r\nNikolas Hulewsky (30:28.211)\r\nMm-hmm\r\n\r\n\r\nRobert (30:33.208)\r\nTheoretically, it is a want, because you can live with the bugs, you can live with the roaches, but that could be dangerous. I understand why you would really want that gone, because you're not going to want to live with roaches or mice or whatever.\r\n\r\n\r\nNikolas Hulewsky (30:35.42)\r\nYeah, I'm surprised. Yeah.\r\n\r\n\r\nNikolas Hulewsky (30:46.494)\r\nWow, okay. That one surprised me that you were like even hesitant. I would have thought for sure you'd be like, We're eating crickets tonight.\r\n\r\n\r\nRobert (30:53.134)\r\nYeah, yeah, no, I think that that's that's borderline. I don't know\r\n\r\n\r\nNikolas Hulewsky (31:00.028)\r\nOkay, roofing.\r\n\r\n\r\nRobert (31:04.75)\r\nWhat was that one?\r\n\r\n\r\nNikolas Hulewsky (31:05.959)\r\nRoofing.\r\n\r\n\r\nRobert (31:07.81)\r\nThat's a need.\r\n\r\n\r\nNikolas Hulewsky (31:09.298)\r\nIt is a need. Fence building and repair.\r\n\r\n\r\nRobert (31:15.596)\r\nThat's a lot.\r\n\r\n\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (31:19.752)\r\nHere's one, pool cleaning and maintenance.\r\n\r\n\r\nRobert (31:25.688)\r\nThose are two different things in my opinion. Yeah, well, in my opinion, because cleaning is a want. Maintenance or like repair is a need. If your pool breaks and needs actual maintenance, like repairs, well, maybe guess maybe maintenance is cleaning is the same as cleaning. I guess maybe those two are the same. Those are are wants. But because you could do the maintenance yourself, you can clean it yourself. But the repairs are probably more of a need.\r\n\r\n\r\nNikolas Hulewsky (31:26.012)\r\nIt's a want to get the pool. Are there two different things? Why?\r\n\r\n\r\nNikolas Hulewsky (31:53.552)\r\nAlright, last two. I'm going save that one for last. Garage door repair.\r\n\r\n\r\nRobert (32:01.08)\r\nThat's a need. Yeah.\r\n\r\n\r\nNikolas Hulewsky (32:02.238)\r\nIt's gotta be need for the same reasons that HVAC electric are gonna be needs, right? Like you're not just gonna figure out like, how do I put this spring? How do I reload this spring on my garage door? Like it's just not gonna happen. Septic tank. Oh, yeah.\r\n\r\n\r\nRobert (32:14.648)\r\nBut at the same time, one quick pushback on that is if it was economic times, 2007, 2008, like you're really struggling, you're just gonna use a different door and you're not gonna go in the garage for a little bit. Yeah, exactly, exactly. So.\r\n\r\n\r\nNikolas Hulewsky (32:25.544)\r\nThat's true, or you're just gonna open it manually.\r\n\r\n\r\nNikolas Hulewsky (32:31.902)\r\nI know this one. Septic Tank Services.\r\n\r\n\r\nRobert (32:36.438)\r\nThat's a need. Yeah, you're not diving in there yourself. If anybody has a septic tank, you know you're not diving in there.\r\n\r\n\r\nNikolas Hulewsky (32:37.532)\r\nThat's gotta be me, dude. no.\r\n\r\n\r\nWe just moved in. We just moved in this place with a subject tank. My brother and sister-in-law used to live here. Long story. But they have a subject tank and he's like, all right, well, here's where the subject is. And just make sure your kids aren't throwing in, you know, gobs of toilet paper and paper towels, because you're going to have to get in there and clean it out. Like, wait, what? like, yeah, I've had to get in there a few times. OK, friend.\r\n\r\n\r\nRobert (32:56.632)\r\nYeah.\r\n\r\n\r\nRobert (33:06.254)\r\nYeah, my cousin swims in those for a living. Yeah. Well, that's what they do. They do septic repairs. do, you know, stuff's clogged and you're not going in there yourself. He pays company and he goes and does it. Puts on a suit and jumps in. No, he doesn't. No, he gets paid like 22 bucks an hour and goes swims in poop all day. Yeah, I swear to God.\r\n\r\n\r\nNikolas Hulewsky (33:09.918)\r\nWhat the f- What do you mean swims in them?\r\n\r\n\r\nNikolas Hulewsky (33:21.328)\r\nDoes he own the company or does he work?\r\n\r\n\r\nNikolas Hulewsky (33:27.927)\r\nWhat? Are you serious?\r\n\r\n\r\nDoes he like it?\r\n\r\n\r\nRobert (33:34.478)\r\nUhhh, he doesn't hate it.\r\n\r\n\r\nNikolas Hulewsky (33:37.434)\r\nmy gosh, you just swimming around and like declogging crap literally all day.\r\n\r\n\r\nRobert (33:41.901)\r\nYeah, yeah, swimming in those septic tanks.\r\n\r\n\r\nNikolas Hulewsky (33:45.206)\r\nmy, I'm not, I won't go down a huge rabbit hole here, but it's jobs like that where I'm like, that's why men live not as long as women. Cause they're the, they're the ones doing freaking cleaning out septic tanks, getting Giardia just as a occupational hazard. my gosh. That's insane.\r\n\r\n\r\nRobert (33:55.137)\r\nYeah.\r\n\r\n\r\nRobert (33:59.788)\r\nYep. Yeah. Yeah, you couldn't pay me enough for that job.\r\n\r\n\r\nNikolas Hulewsky (34:05.591)\r\nNo, although I would own that business. That'd be a great business to own.\r\n\r\n\r\nRobert (34:09.088)\r\nI would too, but I would not, wouldn't do it.\r\n\r\n\r\nNikolas Hulewsky (34:12.102)\r\nIf I can manage it. Okay, so I like the framework. any home services businesses that you could look, pressure, I should have said pressure washing, pressure washing. Definitely want, you could easily go around pressure washer. But yeah, basically, if you're evaluating these businesses, it's like, all right, in a downturn, is this a need or a want? If it's a need, I'm all in. If it's a want, I don't know. Like the stump grinding, why even entertain it if it's a want business?\r\n\r\n\r\nRobert (34:21.634)\r\nDefinitely a want. Definitely.\r\n\r\n\r\nRobert (34:41.752)\r\nWell, just because it's a lot doesn't mean it's not a good business. It doesn't mean you shouldn't consider it. It's just something you have to consider. what, in my opinion, you have to think about like, what am gonna do in a downturn? How am I gonna overcome this? What am I gonna offer? How am I gonna make an income? Like what is gonna be the solution here? And think about that before you go into it.\r\n\r\n\r\nNikolas Hulewsky (34:58.514)\r\nFor you, you're rotating out of your real estate, like a lot of your real estate holdings. What are you rotating into?\r\n\r\n\r\nRobert (35:04.12)\r\ncash, paying down some debt. That's really it.\r\n\r\n\r\nNikolas Hulewsky (35:09.522)\r\ncash for what? like you're just sitting in cash in case there's a crash, you're trying to buy a business you want to just\r\n\r\n\r\nRobert (35:14.486)\r\nWell, I guess I shouldn't say cash. I invest a lot of it in equity markets. That's like a lot of my background is stock investing as well. Stock, stock, traditional equities and crypto.\r\n\r\n\r\nNikolas Hulewsky (35:27.144)\r\nGo on.\r\n\r\n\r\nRobert (35:28.442)\r\nI just I'm a believer in crypto. Nothing. Yeah, I guess. But I don't I don't like day trade or anything along those lines. I just put some in Bitcoin and I guess you would say I'm a Bitcoiner and just let it ride.\r\n\r\n\r\nNikolas Hulewsky (35:29.768)\r\nYou just dabble. You're a dabbler.\r\n\r\n\r\nNikolas Hulewsky (35:42.62)\r\nI just can say, are you a full corner?\r\n\r\n\r\nRobert (35:45.718)\r\nYeah, I would say I like Bitcoin. I like Bitcoin. Yeah. The dollar's not doing so hot.\r\n\r\n\r\nNikolas Hulewsky (35:47.614)\r\nright? Chris and I had a company that sold crypto mining rigs, so like crypto mining hardware. I don't have, like my crypto holdings are not massive relative to the rest of my holdings. I have some crypto, but I'm not a crypto millionaire.\r\n\r\n\r\nRobert (36:08.226)\r\nThat's how I am too. It's definitely not the majority of my holdings by any means.\r\n\r\n\r\nNikolas Hulewsky (36:14.078)\r\nDude, okay. Well, I love this, man. This has been an awesome conversation. Didn't end the way that I was thinking, but it ended better than I was thinking. So that part was really fun. What do you think is like the one piece of advice you would give to somebody who is an entrepreneur trying to get into real estate that is like wanting to make the jump either this year or they're like, it's gonna be their new year's resolution for 2026 to get into real estate. What would you say, hey, you're new, you're a rookie. This is my one piece of advice for you.\r\n\r\n\r\nRobert (36:41.742)\r\nWell, if you're a rookie, if you're a rookie real estate, there's two different ways. One, if you have, if you're looking to start a business or you're like business is doing okay and you really want, you just need more income. I think a great way is to house hack because if you can reduce your largest expense, that gives you more money that you can invest into starting a business or growing your existing business. So I think house hacking is great for people that are new entrepreneurs or want to become entrepreneurs. You can.\r\n\r\n\r\nNikolas Hulewsky (36:52.594)\r\nRobert (37:11.222)\r\nreduce your housing costs to put more money into your actual money generating business ventures. You gotta live somewhere, yeah, yep. So if you can, instead of spending 2,000 on rent or a mortgage and you can get that down to 1,000 by offsetting your cost through house hacking, that gives you an extra 1,000 bucks a month that you can put into your business or marketing or whatever. So I think if you're early on, that's a great way to go. If you're not willing to house hack or you are maybe a little bit further along in your...\r\n\r\n\r\nNikolas Hulewsky (37:15.88)\r\nCause you have to live somewhere anyways. Yeah.\r\n\r\n\r\nRobert (37:38.83)\r\nyour venture, you have some capital, you want to start investing. I would say, can you buy a 10, 15, 20 unit property? And if you can't, I probably would maybe reinvest that money in your business, try to find a way that you can reinvest that money in your business, or maybe find a syndicator that you could invest with, because you will still get tax benefits that way. But I probably wouldn't try to start a second business. If you already have one successful, I wouldn't start a second real estate business if you're just going to buy.\r\n\r\n\r\ntwo or three units and stop there.\r\n\r\n\r\nNikolas Hulewsky (38:09.619)\r\nYeah.\r\n\r\n\r\nThat's funny, man. It's kind of like buying a boat or even buying a house for that matter. Like, okay, I can afford a $70,000 boat, $200,000 boat. Great. But can you afford the $20,000 a year of maintenance? Right? Like, or even if you buy a house, like, I could afford a million dollar house. Okay. But can you afford the $50,000 a year cost to maintain that house? Cause it's not just the cost of the asset. It's the ongoing maintenance of it. So I think that's, that's interesting. It's like, if you can't afford a 10,\r\n\r\n\r\nRobert (38:14.914)\r\nYeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (38:40.552)\r\nbuilding portfolio, then maybe just reinvest in your business for now to get enough cash flow to then do that.\r\n\r\n\r\nRobert (38:44.462)\r\nYeah, because think about it. Think about it, right? Let's let's say you're going to put, I don't know, 50 grand into a that's probably way too little, honestly, to even get a property. But let's just say it's 50 grand. And somehow you can buy four units. On average, you're probably going to make, I don't know, three hundred a month in profit per unit. That's a decent rental after you put aside repairs, maintenance, vacancies, that kind of stuff. So now you're making twelve hundred a month times twelve. Like, what? That's not that much money a year. Could you take that?\r\n\r\n\r\n50 or 60,000 that you had to put down to buy that property and generate that income from your business? Probably, probably. With a lot less risk.\r\n\r\n\r\nNikolas Hulewsky (39:21.342)\r\nEspecially and especially when when real estate asset values aren't appreciating at the same rate that they were five years ago, right? Like it's not like in five years that $50,000 you put in is all the same going to turn into $150,000. It's probably going to be $70,000, but that's mainly because you paid down the principal on that. Yeah, makes sense. Cool. All right. Where's the best place for people to come find you if they want to check you out, learn more from your wisdom?\r\n\r\n\r\nRobert (39:39.468)\r\nYeah, exactly. Exactly.\r\n\r\n\r\nRobert (39:46.25)\r\nI'm not really active. I'm not very active anywhere on social except for Twitter. So I just Twitter. That's it. Yeah, I don't know. I just kind of got burnt out of it when I was doing the podcast. I had done too much social, too too many, yeah, too much stuff going on. And so just Twitter now. Yeah, just Twitter.\r\n\r\n\r\nNikolas Hulewsky (39:49.736)\r\ndon't. Why? Okay. All right.\r\n\r\n\r\nNikolas Hulewsky (40:01.63)\r\nFair, fair, I get it. I get it. Cool, all right. Robert, this was great. Hold on for a second. I'm gonna hit.",
  "metadata": {
    "duration": "",
    "date": "",
    "platform_source": "Google Drive"
  }
}