{
  "episode_number": "218",
  "episode_title": "Sam Parr: Getting Fired from Airbnb at 22 to Approaching a 9-Figures at 34",
  "guest_name": "Sam Parr",
  "business_name": "Hampton, The Hustle",
  "transcript": "﻿Nikolas Hulewsky (00:00.372)\r\non, usually it's people who have like actually done podcasts. I'm yeah, I feel like with people who haven't done podcasts before, it's it's nerve wracking to see the record button. And so I like to keep it off at first just to sort of get them comfortable in\r\n\r\n\r\nSam (00:01.264)\r\nWhat do you mean, professional people? Who do you think I deal with?\r\n\r\n\r\nSam (00:15.046)\r\nYeah, I would challenge that. I think that it's my job as a host to make them feel good. So like there's ways to do that where you like break them down. Usually like I'll make fun of myself or I'll make fun of them and like, but there's there's ways to do it. But like, and we tell them even on it while we're recording, we're like, if you say anything that you didn't mean to or something like that, we'll go back and delete it. But yeah, we record everything.\r\n\r\n\r\nNikolas Hulewsky (00:42.35)\r\nWell, I guess I'm off to a strong start. I'm a terrible host and I didn't record the first part, so great.\r\n\r\n\r\nSam (00:49.422)\r\nNo one does that by the way, like when we do that, because I just thought it made sense, but no one else does it. I don't know why.\r\n\r\n\r\nNikolas Hulewsky (00:59.118)\r\nI'll tell you from my perspective, at least when I've been talking to people, I just want them to feel like there's an off the record moment for them as they're getting started. And to your point, I guess if I'm already recording it, it's my job to make you feel comfortable. But I found that as just a low friction way to get somebody comfortable as opposed to relying on my natural charm and charisma. But that's why you're you and I'm me.\r\n\r\n\r\nSam (01:23.858)\r\nNo, think that that's not true. think that\r\n\r\n\r\nSam (01:34.194)\r\nYeah, I don't know. just, I want to get all the good stuff and it's like, I don't want to like get someone to perform. And so it's hard though. Like I don't, we fail. I fail at it all the time. But like yesterday we had like a billionaire on and he was like an older guy and he was pretty uptight or not uptight, but like you would have, like I would have like thought he was going to be uptight. And I sensed that.\r\n\r\n\r\nNikolas Hulewsky (01:42.766)\r\nHmm.\r\n\r\n\r\nSam (02:01.458)\r\nAnd I made a joke about, he was like, I was like, do you know what this podcast is about? He's like, not really, it's called My First Million. I was like, no, it's about like your, first time you've ever lost your virginity. And we're go into like super in-depth detail, like on it. And like, he laughed, I mean, he thought it was silly. I was, and so like, use, like there's ways to do it. It's basically flirting. So like, there's ways to flirt, right? And that's all it is.\r\n\r\n\r\nNikolas Hulewsky (02:13.528)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (02:27.886)\r\nWell, let me explain to you just a couple things. So there's one housekeeping item that I always tell people. I get really insecure when I'm talking to somebody if they're doing like this, right? They're like, oh, I feel like they're doing other things. I have a monitor up here with the camera and I have my computer down here with all my notes. So if you see me as you're talking, looking down, I'm locked in. I'm just looking at my prep. it's more for you. It's more for me than it is for you. I just want you to know like.\r\n\r\n\r\nSam (02:52.21)\r\nThat's cool.\r\n\r\n\r\nNikolas Hulewsky (02:58.062)\r\nI'm not anywhere else.\r\n\r\n\r\nSam (02:59.556)\r\nEvery once in a while, right above my screen, my camera, I'm looking at another building. We're in New York City, so you'll see a lady walking around in her bra or a guy with his shirt off. So if you ever see me, look above. Just know that I'm looking at someone naked. So I'm not paying attention to you. I'm looking at someone who's naked.\r\n\r\n\r\nNikolas Hulewsky (03:19.894)\r\nYou have a better view than I do apparently. When did you move back to? When did.\r\n\r\n\r\nSam (03:22.778)\r\nIt depends who's changing. I moved back here three weeks ago.\r\n\r\n\r\nNikolas Hulewsky (03:28.785)\r\nman, how was it? How was the move? We just moved into a new place and moving always sucks. Really.\r\n\r\n\r\nSam (03:34.042)\r\nIt was great. It was easy enough. Yeah, because I don't actually own anything. So whenever I rent places, I rent furnished places. So like I own very little things.\r\n\r\n\r\nNikolas Hulewsky (03:44.238)\r\nSee, we've got four boys, 11 and under. And it's like, when you move, it's not so much about the things. It's like, okay, there's a new space, there's a new routine. Who's gonna be in what room? Where are their friends coming over? And we had to set up the gardener, the people who come out and do, anyways, there's just like a million things you gotta set up. I live in Boise, Idaho, right outside Boise. Yeah, I am. Yeah.\r\n\r\n\r\nSam (03:55.813)\r\nYeah.\r\n\r\n\r\nSam (04:04.05)\r\nWhat city do you live in?\r\n\r\n\r\nThat's cool. Are you Mormon? Nice. I have a whole bunch of Mormon friends. I've been infiltrated or I've infiltrated the crew many a times.\r\n\r\n\r\nNikolas Hulewsky (04:15.886)\r\nHave you been to Boise?\r\n\r\n\r\nSam (04:18.902)\r\nYeah, yeah, one of my good buddies is Nathan Barry. So I've been over to his place a few times. And then I had a billionaire on Moneywise and he seemed like good father. And I was like, hey, can I come over to your house and see how you live? And I didn't know this, but he's like king of the Mormons. He's like on the board at BYU. And so I spent like four days in his house. so his whole family was there. So I've had plenty of exposure.\r\n\r\n\r\nNikolas Hulewsky (04:23.018)\r\nyeah, yeah. ConvertKit.\r\n\r\n\r\nNikolas Hulewsky (04:48.141)\r\nWell, then there's other guys like Al Doan. I know you're like, you know, Al Doan. Yeah. Yeah. Alan and I have a joke where it's like, yeah, yeah. If you just, hey, part of the club or what, dude? You just got to that collar down a little bit. And then, so like my best friend of 20 years, we met as Mormon missionaries. You know, Chris Kerner, Kerner office.\r\n\r\n\r\nSam (04:50.82)\r\nI know Al. I didn't know Al was part of the tribe for a long time, but it makes sense now that I- once I learned it, I was like, that checks out.\r\n\r\n\r\nSam (05:02.482)\r\nYeah.\r\n\r\n\r\nSam (05:10.459)\r\nI don't know them well, but yeah, we're acquaintances.\r\n\r\n\r\nNikolas Hulewsky (05:13.174)\r\nI know he was just on my first million, but as we've as we've been doing this, we're like, man, there is like a Mormon mafia. It's kind of crazy in the I know Ben who has his own podcast now. It's part of the tribe. But we're kind of like Jews. That's how like to say it. Just why do I mean, I am Jewish. That's why I have the curly hair. So I have like the best of both worlds. You'd be surprised. OK, the last thing\r\n\r\n\r\nSam (05:20.658)\r\n100 % is\r\n\r\n\r\nSam (05:29.817)\r\nYeah, just white Jews.\r\n\r\n\r\nSam (05:36.23)\r\nMan, you're unselfable.\r\n\r\n\r\nHeh\r\n\r\n\r\nNikolas Hulewsky (05:43.182)\r\nI don't really want to do an interview that you've already done. I feel like you've done a lot of just the same type of stuff. So I have a bunch of kind of off the wall questions for you that I'm more interested about than, hey, tell me about the first time you launched a business and did you look at the CAC to LTV ratio? So in lines with that, like, is there anything that's off limits? Like, is there anything you're like, I don't really want to talk about this.\r\n\r\n\r\nSam (06:09.156)\r\nIf you ever ask anything that's off limits, I'll just tell you.\r\n\r\n\r\nNikolas Hulewsky (06:12.29)\r\nPerfect. Okay. Last question before we start, other than being a cool person, what would make this conversation a home run for you? Or is there anything that you're hoping to get out of it?\r\n\r\n\r\nSam (06:25.906)\r\nI hope it's popular.\r\n\r\n\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (06:30.392)\r\nPopular, you're gonna be popular. Okay, sounds good. I'm gonna do just a brief intro of you and then we'll get into it. Is that cool?\r\n\r\n\r\nSam (06:42.108)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (06:44.014)\r\nWhat are you drinking?\r\n\r\n\r\nSam (06:46.908)\r\nSpin, thrift, just water, lemon water.\r\n\r\n\r\nNikolas Hulewsky (06:50.126)\r\nOkay, what? is it, oh, is it like the LaCroix stuff?\r\n\r\n\r\nSam (06:56.85)\r\nI don't know, it was just in my freezer at my office. Real squeezed fruit with sparkling water. I don't know anything about it. I'm a caveman, if I see it I just take it. Yeah. Yeah, I have an office.\r\n\r\n\r\nNikolas Hulewsky (07:06.2)\r\nAre you at an office right now?\r\n\r\n\r\nAre you? So how often do you go into the office?\r\n\r\n\r\nSam (07:14.492)\r\nFour days a week, Monday through Thursday. And Friday I'll do stuff at home. And because it's summertime, I'll probably bail at like 3 o'clock.\r\n\r\n\r\nNikolas Hulewsky (07:16.236)\r\nfour days a week.\r\n\r\n\r\nNikolas Hulewsky (07:22.818)\r\nWhat are your hours in the office?\r\n\r\n\r\nSam (07:25.042)\r\nUm, well, I would say between 9.30 and 5.\r\n\r\n\r\nNikolas Hulewsky (07:30.95)\r\nyou're there all day.\r\n\r\n\r\nSam (07:32.624)\r\nYeah, yeah, I think people misunderstand my life. think like, I'm like a working man, like I like do stuff. Like, and they think that I have like I have one company, I have one job. I do that 40 hours a week. And I intend to do it for about 30 years, or however long it takes.\r\n\r\n\r\nNikolas Hulewsky (07:52.206)\r\nI guess I wouldn't think that you have a job or that you're doing things where you need to be in an office. That's more my question. It's not that I don't think you're a working man. It's just like, why go to an office?\r\n\r\n\r\nSam (08:01.084)\r\nDo I need to be? I don't think I need, because the troops are here. I don't know, like, you gotta be part of it, I don't know. just, I'm a much more boring person than most people actually think.\r\n\r\n\r\nNikolas Hulewsky (08:13.89)\r\nWell, no, I mean, I think of you more as like a solopreneur, right? It's like, okay, you have the media company, you're making investments, you don't necessarily have a large team. So it makes sense to me when you say the troops are there.\r\n\r\n\r\nSam (08:21.008)\r\nI don't make investments, so I have like 25 full-time employees and I think that over the next handful of years we're gonna have hundreds. Yeah, like.\r\n\r\n\r\nNikolas Hulewsky (08:29.816)\r\nDo you treat them as a family? Is it like more of a family office? Like, are they working on all, like a bunch of different projects? No.\r\n\r\n\r\nSam (08:32.708)\r\nNo.\r\n\r\n\r\nNo, this is why people get wrong. No, I own a business. It's a family business, right? Hampton, Hampton is my company. And it's a company that I tell people I want my grandkids to intern here. So I want it to last for a long time. But no, they have one job. I hire wonderful people. give a lot of autonomy to them and I check in with them. no, like, I, I'm a solopreneur in the sense that I own things that make money that require no one to work on them. But my skill set is building companies.\r\n\r\n\r\nyou know, like my last company, the hustle, it was run really well. It was, I had an executive team, and I made a lot of mistakes and I could have ran it even better, but for a 27 year old or however I was when it was doing well, it was tight. It was a tight org.\r\n\r\n\r\nNikolas Hulewsky (09:21.336)\r\nHmm. Well, so I'll give you a little bit of my perspective. Health care is by my background. Bought, sold, started multiple companies. The last two big companies that I had was a $15 million home health company and about a $7 million medical billing company. And at its peak of all the companies we had, were doing like $30 million a year. So not your size type companies, but they're good companies, right? And we had a good exit, but I had people on those teams that like will always work for me for the rest of my life.\r\n\r\n\r\nSam (09:41.628)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (09:50.062)\r\nthat I just freaking loved. And so no matter what I do next, yes, they're a part of the team and they may be working on the thing that's the priority right there. But I also then have them working on, hey, we're getting credentialing for this position on this other thing we're launching, Sarah, we work on this or like, hey, Christie, we're trying to do this billing thing on this other thing. Could you go and like, do some work over here with this team? So it's not that I'm thinking you don't have a team that you work with. I just didn't realize it was like, oh, they're just Hampton 25 people just Hampton, they don't do anything else.\r\n\r\n\r\nSam (10:13.37)\r\nNo, I look, I think. Yeah, they're Hampton. Yeah, those people just have to. But I mean, I guess there's a time and a place like Hampton's and we're not at the phase in Hampton where where I can deviate any focus. Like I need to focus on it maybe one day. And like I'm tight with all like at the hustle, one of my great points of pride. I think we had I don't remember how many people we had, maybe 30 people when we sold the company. But like.\r\n\r\n\r\n15 of them are like millionaires or something, or in that ballpark because of businesses that they own. And I'm close with many of them, or acquaintances with many of them. And I take a lot of pride in that because we found really good people and we train them and like, it's like a, I think we do a good job of running things. So like I had.\r\n\r\n\r\nNikolas Hulewsky (11:02.766)\r\nI had an exit, low seven figures. I guess I'll probably cut this in later. I wasn't planning on it. I had an exit, mid seven figures, and I made some investments. The hardest thing, honestly, the hardest thing for me post exit has been what do I do next? Not because there's not enough choice, but because there's too much choice.\r\n\r\n\r\nSam (11:07.698)\r\nIs this the pod, by the way?\r\n\r\n\r\nSam (11:12.274)\r\nAlright great, this is the pod.\r\n\r\n\r\nSam (11:17.874)\r\nThat's great.\r\n\r\n\r\nSam (11:29.806)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (11:30.134)\r\nAnd you're on a show where it's like every day idea, idea, idea, talking to cool person, cool person. How the freak are you only doing one thing? Like, how are you only doing Hampton? I would, I'm in the position where I've got a bunch of different investments and I'm like, I'm like the poor man's poor man version of Sam.\r\n\r\n\r\nSam (11:41.98)\r\nSo.\r\n\r\n\r\nPeople think that I have more, so first of all, nearly all of my money is just in Vanguard index fund. I had hired, I had a CEO of my company and when I did, I had a little bit of free time and I made one or two weekend projects, one of them being like Sam's List, but that's not my, I don't work on that. talked to her, I talked to her like weekly as like a friend or acquaintance, but Kimmy and I like meet quarterly, so like I spend virtually no time, she owns, she's the majority owner of the company, I gave it to her.\r\n\r\n\r\nNikolas Hulewsky (12:11.438)\r\nHmm.\r\n\r\n\r\nSam (12:15.386)\r\nAnd so, yeah, she's the best. And so, like, I don't have any other stuff. Like, I made this thing called Copy That. I made that before I started Hampton. And it just, like, makes money every month. And then, I don't think I have, maybe I have a few, but I just.\r\n\r\n\r\nNikolas Hulewsky (12:15.854)\r\nLove Kimmy by the way.\r\n\r\n\r\nNikolas Hulewsky (12:30.434)\r\nI get that, but how? Like how do you have no other stuff? It just seems like you're getting bombarded with opportunities. How are you not like, I could throw 50 grand at that.\r\n\r\n\r\nSam (12:35.792)\r\nBecause I just have taught, it's the other way around. I've talked to so many successful people, I know the patterns. And I know that there are very few amount of people that can do a lot of different things and succeed at a handful of them. In general, it is significantly better to focus on one thing for many decades, in general. And so I know that to be true.\r\n\r\n\r\nAnd so because I talk to all these successful people, it actually makes it significantly easier to focus. And I don't even angel invest that much, by the way. Like I say no, just about everything.\r\n\r\n\r\nNikolas Hulewsky (13:16.056)\r\nWell, so I'll push back a little bit on that. I think there's two types of focus. You've got Warren Buffett and you've got Jeff Bezos. Jeff Bezos is like, I'm doing Amazon, I'm only doing Amazon, I'm all in on Amazon all the time. And it was like, okay, he's all in on this one business. And then you've got Warren Buffett. He's got a ton of different businesses that he's invested in over time, right? Tons of different, billions of, no, he doesn't. His business.\r\n\r\n\r\nSam (13:37.712)\r\nNo, he's got one. His business is investing.\r\n\r\n\r\nNikolas Hulewsky (13:42.158)\r\nWell, I his business is, that's the point I'm making, right? Like his business is investing in other businesses. So like his core skillset is one thing. He's like, I'm a capital allocator. That's the only thing that I'm going to focus on. So I do think though, sometimes people confuse those as you're like, well, I only got to have one business. Well, you could just be the greatest marketer in the world. And that's your business is building, helping people build brands or products or like that's your agency. So there's, there's like the spice of life kind of variety of things. So that's why when I look at you, I'm like,\r\n\r\n\r\nSam (13:50.683)\r\nYeah.\r\n\r\n\r\nSam (14:06.566)\r\nYep.\r\n\r\n\r\nNikolas Hulewsky (14:11.98)\r\nYou have an amazing skill set, obviously, just like Liam Neeson, a very particular set of skills. And it's just interesting to me that you have that, I admire it, because I don't have the self-discipline to do what you're doing.\r\n\r\n\r\nSam (14:27.058)\r\nIt's not always discipline. I mean a lot of it's fear like I just want to succeed so badly that I Refuse to deviate from like the one thing that I'm\r\n\r\n\r\nYeah, I don't know how to explain it. just think that, just, I know it's better to focus and also I just don't have the, I mean, I guess I have the urge, like, I sold my company, The Hustle, that was my foundational life-changing thing. It wasn't that old. You could say it was a little, like, it was, I think we sold in year five, I had been working on it. Originally, it was a conference that kind of pivoted.\r\n\r\n\r\nNikolas Hulewsky (14:59.79)\r\nMm-hmm.\r\n\r\n\r\nSam (15:05.924)\r\nAnd so if you think that is the beginning of it, then it was maybe seven or eight years old. And then I'm still on the podcast, which the hustle owned. So in a weird way, I could be like, well, I've been working on it since 2014. So that's 11 years, but I made a lot of the money early on. but like, but so I guess I'm saying that in the sense that I don't.\r\n\r\n\r\nNikolas Hulewsky (15:18.508)\r\nSure.\r\n\r\n\r\nSam (15:30.244)\r\nalways stick to what I'm saying. Like I make the same mistake that I tell people not to make all the time, which is focus and do it for a time, long period of time. But like in general, I typically am not, can't do two things at once.\r\n\r\n\r\nNikolas Hulewsky (15:41.998)\r\nDo you regret selling any of the businesses you sold?\r\n\r\n\r\nSam (15:46.428)\r\nI've only sold one business. I've only had one really successful company. Do I?\r\n\r\n\r\nNikolas Hulewsky (15:50.958)\r\nDude, no, no, no, I was doing the research. was like small, it was like a $15,000 exit, right? You're a tech company.\r\n\r\n\r\nSam (15:56.87)\r\nYeah, that was my company. It was a roommate matching service. That was my company. It sold and then I had to go start something new. And so that was the hustle. Do I regret selling? I wish. So no, not at all. I don't regret selling. getting like I got paid like many years of annual earnings upfront. Like that's great. Also, what's great is when I started the business, I'd given equity to some people. And that was actually a\r\n\r\n\r\nNikolas Hulewsky (16:00.982)\r\nYeah.\r\n\r\n\r\nSam (16:25.862)\r\nbecause when you sell equity or give equity, you sort of have an obligation to get a return. So that was just the game I had signed up to play. I regret playing that game, but once I had signed up, you have to sell. And then I'm happy that I was able to secure financial security. I sort of wish that I was able to own it forever, but that wasn't the situation that I was in.\r\n\r\n\r\nNikolas Hulewsky (16:52.654)\r\nAnd I mean, that's the point I was kind of getting at. Over the last year, I've gotten to this point where I made a lot of decisions based on fear in the past. The medical billing company that I had was a great company. It was netting like one to $2 million a year. But in 2021, I was like, feds can start tightening, asset prices are going to come down. And I wasn't running that business on the day to day. So I was like, sell, let's get out of it. I'm scared of what's going to happen. And I look back, I wish I wouldn't have sold that business because it was a great business and it would have\r\n\r\n\r\nit would have stayed consistent. And I look at my, let's say portfolio of stocks that I've gotten in and out of many of the companies that I've sold. I regret cause they're still great companies. And I sometimes like trying to balance this. How do you kind of get the security that you want, but then also realize life is long. Like there's a lot of compounding that takes place.\r\n\r\n\r\nSam (17:39.356)\r\nWell, so you don't get both, that's for sure, right? But you, well, I guess you could, like a lot of the greats, the people who I admire, you know, I'm a big history buff, a lot of the greats who I admire, many of them were not cash rich until like their company was making billions of dollars. And so they would own a company that was, like, for example, I was just hanging out with a buddy who bootstrapped a company, it's year 15, and it's making 150 million in revenue and it's killing it.\r\n\r\n\r\nNikolas Hulewsky (17:58.894)\r\nMm-hmm.\r\n\r\n\r\nSam (18:07.814)\r\nwhatever, he's on paper, that's probably worth $500 million and he owns it. So that's a lot of money. But he was like, I still don't feel financially secure because I don't take significant income out of the business. And so I bought a home for $4 million and I have $1 million to my name. And so you're wealthy equity wise, but not cash wise. And that actually feels not always the most secure thing.\r\n\r\n\r\nAnd so I think there's a balance. Like for me, I had a goal at a very young age, like age 21, where I want to be financially set at age 30. And if I can get that, I hypothesized, then the rest of life will feel easy and I'll have more fun and I could still create things. And that's what I'm doing. But yeah, you can't have both. And me selling at a young age, that meant that I got what I wanted, but I definitely closed the door of like potential upside. There's no doubt about that.\r\n\r\n\r\nNikolas Hulewsky (18:41.166)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (19:03.286)\r\nSo what's interesting, I always tell people this is like, in my opinion, I agree with you 90 % secure the bag and then you can play the long game or you can take a little bit more risk. For me, it was about taking risk off the table. And I'm grateful that I did it. There is still that part of me where it's like, man, it's interesting that it didn't just fall apart after I sold it. Like it's still there. It's still a business. Like you have this like imposter syndrome thinking things are just gonna collapse.\r\n\r\n\r\nBut over time, as you get older and I'm almost 40, I've just come to realize like the Lindy effect, things last longer than you probably give them credit for.\r\n\r\n\r\nSam (19:41.872)\r\nThey can. They definitely can. Yeah, they definitely can.\r\n\r\n\r\nNikolas Hulewsky (19:42.798)\r\nAt least for me. right. Let me, I want to paint this. Um, I think, I think you're the most relatable, successful person that I know of in the media landscape that like talks about business, uh, because you, weren't like, Oh, I was in Silicon Valley at the right time and I was the employee number 10 of Facebook, or I was, I don't know, the guy who invented this marketplace. You've got this like compounding story. I mean, you started, uh, what was the name of your hot dog company in college?\r\n\r\n\r\nSam (20:11.868)\r\nSouthern Sam's wieners as big as a baby's arm.\r\n\r\n\r\nNikolas Hulewsky (20:14.35)\r\nfreaking amazing. And like, and then you like, you kind of just like rolled each one of these into the next thing. And obviously, you sold in, in 2021 and had a nice exit reportedly for $27 million.\r\n\r\n\r\nSam (20:29.714)\r\nDepending on how you look at it, was potentially a lot more.\r\n\r\n\r\nNikolas Hulewsky (20:33.742)\r\nOkay, so $50 million? Stop me when I hit it. 60, 150, 250, $500 million, Sam? You got 500 million. Anyways, billions?\r\n\r\n\r\nSam (20:37.84)\r\nI will never, that's all you're gonna get. That's all you're gonna get from me.\r\n\r\n\r\nMaybe billions, I don't know, who knows? look, I acquired, I sold it for some cash, a good amount of cash. I got HubSpot Equity that changed a lot while I owned it. And then also our MFM, the podcast took off. That has been good. So depending on how you look at the price of the deal, it was very good. I'm really happy with it.\r\n\r\n\r\nNikolas Hulewsky (21:11.882)\r\nAnd like the reason I say most relatable is because like I think people could look at you and be like, okay. That's like a blueprint I could follow. I'm just, I'm compounding my learnings. I'm compounding my growth. what's been interesting though is you have a podcast called my first million. You've got another podcast called money wise and you ask people about money all the time. Chris, who I mentioned earlier, we like sometimes we'll talk to each other and be like, why is Sam par so obsessed with money?\r\n\r\n\r\nSam (21:27.996)\r\nYeah.\r\n\r\n\r\nSam (21:40.626)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (21:41.612)\r\nWhy are you so obsessed with money?\r\n\r\n\r\nSam (21:43.568)\r\nI'm obsessed with manifesting. And I chose the world of business. think that money equals freedom. I also think that when I was obsessed with track and field, which I still am, I wanted to know the greats. was like, show me the workouts that you did leading up to that. I wanted to know exactly what they did. And then I also wanted to know what were they doing at the age of 16.\r\n\r\n\r\nbecause I'm going to work backwards and achieve that. And I just think that that idea of working backwards is kind of addicting. think that when you see what's possible or how to do something, it becomes very contagious and it makes it easier to achieve. I think that Jamaica is a very small country, but they absolutely dominate the 100 meter dash. Why? Or America.\r\n\r\n\r\nNikolas Hulewsky (22:19.977)\r\nyou\r\n\r\n\r\nSam (22:39.634)\r\ndominates at like a variety of things. It's like, why do we kick ass? Like, why are we so good at making movies? Why do we export culture? What is going on? And it's because you get a group of people and you put them physically in a similar space or and you teach each other how to do something, it becomes inevitable, or at least it feels inevitable. And it like removes this like self, like this like issue, like this limiting belief. And so I'm obsessed with money because I like to\r\n\r\n\r\nNikolas Hulewsky (23:00.877)\r\nMm-hmm.\r\n\r\n\r\nSam (23:07.558)\r\nfind blueprints that I can just copy so I know what's possible.\r\n\r\n\r\nNikolas Hulewsky (23:11.726)\r\nWell, there's lots of metrics though, you can kind of use for success. And especially as you get older or maybe you have your first exit and you're like, okay, 10 million wasn't the mark actually that I'm happy at.\r\n\r\n\r\nSam (23:21.82)\r\nBut I'm not just obsessed with money. Like I read, like right now I'm reading the biography of Barack Obama. I've read the biography of Ronald Reagan, George Bush Jr., George Bush Sr. Like I read all types of people who achieve amazing things. And I always wanna know how did they get there? Because I wanna do something great. And I just wanna like know what's possible.\r\n\r\n\r\nNikolas Hulewsky (23:34.957)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (23:40.43)\r\nIf you had a podcast interview with Barack Obama, tell me the odds that you would ask him what his net worth is.\r\n\r\n\r\nSam (23:51.408)\r\nWell, I don't care what his net worth is now, but what I care, yeah, because his net worth is infinity, right? When you have social capital, you could do anything you want. But to me, what would be more interesting is what you did the first 365 days leading up. I guess, what did you do the 180 days leading up deciding to run for president and then the proceeding, the post 365 days after that decision?\r\n\r\n\r\nNikolas Hulewsky (23:53.784)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (24:01.198)\r\nIt's true,\r\n\r\n\r\nSam (24:21.19)\r\nLike I would want to know like a week by week breakdown. That would fascinate me.\r\n\r\n\r\nNikolas Hulewsky (24:24.846)\r\nThat would be super fascinating. I think what's awesome about you is obviously you're insatiably curious and you've talked to a lot of people who are like 1 % in their category, whether they're athletes or entertainers or business people, et cetera. And like, just like you said, hey, what were the first 52 weeks of your presidency like? Walk me through that. How?\r\n\r\n\r\nSam (24:44.708)\r\nNo, I don't care about the presidency. want to know like, when you made the decision, like, who do you tell? Like, is there like a inbox that you email and be like, I officially declare and then like, you know what mean? Like, like, I'll be like, dude, I literally want to know, like, what do you like, what's that? Like, I would want to get really nitty gritty on that. Or it's like, so like, do you just start like, knocking on doors? I don't know. Like, I like, yeah, or like,\r\n\r\n\r\nNikolas Hulewsky (25:10.031)\r\nWho like onboards you for benefits when you become the president of the United States?\r\n\r\n\r\nSam (25:13.72)\r\nYeah, like I really just want to know these things because I just am obsessed with like manifesting like like it doesn't matter if you're Picasso or you're the person who built this big skyscraper that I'm looking at. I've just always been intoxicated with the idea that the world around us, whether it's the person who made this microphone or whatever, they had a vision and they had an idea. And after a handful of years, we have some somehow taken it for granted and accepted that it just has always been there.\r\n\r\n\r\nNikolas Hulewsky (25:43.864)\r\nMm-hmm.\r\n\r\n\r\nSam (25:43.92)\r\nBut they were able to kind of kick their dent in the world, even in the smallest way, by like making this microphone. And I just am obsessed with like, tell me how that happened. How did you stick out and stand out? And how did you like turn a vision into reality? I'm obsessed with that. Whether it's, like I said, track and field, becoming president, becoming an artist. It just so happens that I think that business and capitalism is likely the most practical way to like get that expressive kind of bit of freedom out into the world.\r\n\r\n\r\nNikolas Hulewsky (26:11.63)\r\nOkay, so you're an athlete, obviously you're in good shape. You know that you can't work out 24 seven. You've got to sleep, you've got to eat, you've got to let your body recover, you've got to rest, right? But working out is obviously really important. I kind of equate the working out, I this is a bad analogy and you'll tell me I'm an idiot. But I equate the working out piece as you going and talking to these people, like you're gathering knowledge, like you're doing the workout, you're doing the mental exercise.\r\n\r\n\r\nHow do you then integrate it? Like, how do you then digest it? Because you've got all these people you've spoken to, you've learned all these things. You have a database that you write your notes in. How do you actually take it from, cool, I learned this thing, to I'm going to now implement this into my life? Because you've got more ideas coming at you than probably 99 % of people who've ever lived.\r\n\r\n\r\nSam (27:01.528)\r\nYeah, I'm not looking for like, I guess I do a few things. Like I spend a lot of time just thinking. So like I'm in my office, I'm in like a room in a big office and I've got like books all over my desk. I have like this thing called a five year journal where I write like how I'm feeling that day. But I, yeah.\r\n\r\n\r\nNikolas Hulewsky (27:18.688)\r\nYou actually write it. You're not like using Claude or like, I'm going to journal type. No, you're physically writing.\r\n\r\n\r\nSam (27:23.908)\r\nNo, no, dude, I do so much stuff analog and by hand. But I so I guess what I do is I read a ton. I like reading a lot and I do it not because I think that it's helping me. I just do it because I just have so much fun doing it. And usually every one or two books, I'll get one interesting idea and I'll just spend hours just sitting here and I'll just think about it. So I think a ton.\r\n\r\n\r\nAnd then when I journal, I'll write out and reflect on the ideas that are in my head. And occasionally, like once a month or once a quarter, one of these ideas, I'm like, I can apply this in my life in some way.\r\n\r\n\r\nNikolas Hulewsky (28:03.704)\r\nWhat does that mean you sit and think about it for hours? you like, you're sitting in a chair just staring at the wall? like, are you, what are you doing?\r\n\r\n\r\nSam (28:10.404)\r\nWell, like right before this podcast for the half an hour leading up to this podcast. Yeah, I was just sitting. I just sat with my head down and I'll just sit and think or and I'll have my pad. Yeah. And I'll have my pad and I was just sitting here writing. Yeah. I'll literally just sit and think or I'll go and walk. like I, I sometimes I really just spend a lot of time like thinking or I'll just be just sitting here like staring off. Yeah. I spent a lot of time doing that.\r\n\r\n\r\nNikolas Hulewsky (28:18.36)\r\nSeriously?\r\n\r\n\r\nNikolas Hulewsky (28:35.734)\r\nWe had, so we just moved, we have a house, we're on three acres, it's amazing and there's just like always something to do. Like we have a landscaper who comes once a week, but I still probably spend 10 hours a week just in the yard, because I enjoy it. For me, that's where I find the best thinking time is like physically out and about.\r\n\r\n\r\nSam (28:53.284)\r\nYeah, think movement creates emotion. That's probably the best way to do it.\r\n\r\n\r\nNikolas Hulewsky (28:59.822)\r\nWhy then do you do the sitting and thinking? Is it just convenience?\r\n\r\n\r\nSam (29:03.794)\r\nCause I want to like, I'll like think and then I'll think of something and then I'll like write it down. I don't know. just, yeah.\r\n\r\n\r\nNikolas Hulewsky (29:09.55)\r\nHow long have you done this for? Like have you always done this? Was your mom like, Sam, it's time for preschool. And you're like, mom, please, I'm contemplating life.\r\n\r\n\r\nSam (29:15.248)\r\nWell, like my yeah, like I've I've always been very like, yeah, so my wife after work, she, we put the kid down and it'll between like eight and nine. Like, she'll know when I'm in like my mood where like she'll talk to me and I'll be like, I was mumbled. And she like knows like that's like, don't bother you. But yeah, I literally will just sit there and I'm just like in my head and she'll know because I'll mumble. Like you'll see my lips moving.\r\n\r\n\r\nNikolas Hulewsky (29:30.104)\r\nMm-hmm.\r\n\r\n\r\nHahaha!\r\n\r\n\r\nSam (29:44.88)\r\nbecause I'm like asking myself a question and then I'm answering it like my lips will move a little bit. It's very weird. But yeah.\r\n\r\n\r\nNikolas Hulewsky (29:51.31)\r\nBro, you need more kids. You need more kids. If I sat down, we got four boys, you under 11, 11, eight, five, and three. If I sat down and was like, honey, I'm thinking, and the boys are like fighting each other. You know, there's a Nerf war going on. They're trying to eat dinner. Someone's got a poopy diaper. And she's like, can you help? I'm like, I'm in the think zone, sweetie. I'm sorry. Like it just wouldn't, it just wouldn't work.\r\n\r\n\r\nSam (30:13.914)\r\nI, yeah, it's weird. I'll just do it. Like I take a lot of road trips or I'll drive. But yeah, I'll just like kind of sit still for a long period of time and just think it's, yeah, I guess it's weird now that I say it out loud.\r\n\r\n\r\nNikolas Hulewsky (30:26.574)\r\nWell, it's weird in the sense of like, not nobody does that. Or like, people will be like, they sit and think on their phone, or they're like, Oh, I'm on Instagram.\r\n\r\n\r\nSam (30:30.83)\r\nI, well, it's, no, it's kind of hard. I think that like Slack and Twitter has been almost a negative because it makes it really challenging to like digest new information when you constantly have stuff coming at you.\r\n\r\n\r\nNikolas Hulewsky (30:47.746)\r\nHmm. So like for this interview and for interviews that I'm like personally really excited to learn from them more so than like, this will be cool content for somebody. Like I'm just excited to learn about it. I won't, I won't go on social media for 24 hours. I'll just like sit and think with their story, maybe some of their podcasts that they've been on or like research the business. Cause I just like to let it marinate in the back of my mind and let that be there. Cause then\r\n\r\n\r\nthen I have opportunity to sort of draw on that reservoir. So I do understand it from that perspective, but I feel like if I built that time in every single day, I feel lazy or I feel like I'm like not being productive if I were to sit for 30 minutes. And like, that's a me problem, right? But did you ever feel that way?\r\n\r\n\r\nSam (31:33.926)\r\nYou know, yeah, I I feel this way all the time, but basically, like, I'm at the point in my career where, like, I'm a knowledge worker. Like, I come up with, like, ideas or I come up with an opinion, and I just say that, and I don't always do the work. So I do do the work, like, when I'm first starting. in order to get Hampton to, seven figures in revenue, it was just me and my partner Joe, and we did 100 % of everything. But, you know, with a lot of stuff,\r\n\r\n\r\nNikolas Hulewsky (31:44.078)\r\nHmm.\r\n\r\n\r\nSam (32:05.478)\r\nMy money comes from just coming up with insights and kind of talking about it. So I'm very fortunate I'm in that situation.\r\n\r\n\r\nNikolas Hulewsky (32:15.758)\r\nI definitely get that perspective. That's kind of how I use AI, is like, it's helping me work through things.\r\n\r\n\r\nSam (32:23.612)\r\nBut by the way, I can't do anything. For example, we're building the software inside of our company, and I just draw it out on a piece of paper, and I send it to our tech team, and I'm like, what do think about this? I can't actually make anything.\r\n\r\n\r\nNikolas Hulewsky (32:29.902)\r\n.\r\n\r\n\r\nNikolas Hulewsky (32:37.038)\r\nYou can't do can you do anything at home? Can you like repair stuff and like are you a man? You like fix a car.\r\n\r\n\r\nSam (32:43.632)\r\nYeah, like I know how to like, yeah, like one of my hobbies is like taking apart motorcycles and putting them together. But.\r\n\r\n\r\nNikolas Hulewsky (32:49.838)\r\nF you dude. You're rich, you're good looking, you're healthy, and you like know how to do manly things? Screw you man. This is...\r\n\r\n\r\nSam (32:53.65)\r\nWell, the way that I describe it to people is I can go really high, like I can hang out with like a billionaire and like get along with them and work with them, but or I can go really low. Like I can go hang out with like hoodlums on the street and like get along. Like, for example, this Saturday I was at the skate park for like three hours, not three hours, like an hour and a half and just hanging out with like the homeboys, like guys I don't even know, just like, you know, street guys.\r\n\r\n\r\nNikolas Hulewsky (33:00.732)\r\nyou\r\n\r\n\r\nSam (33:20.964)\r\nand I have so much joy doing it. And so I tend to, I feel comfortable being on different spectrums.\r\n\r\n\r\nNikolas Hulewsky (33:30.158)\r\nI heard this incredible story. I was listening to the Joe Rogan podcast with Bill Murray and Bill Murray was telling, he's like, yeah, I was driving Lauren Michaels Volkswagen across the country and I just was hanging out and I stopped in Aspen and I go to the lodge and I meet this guy at the bar and for like two days we're just hanging out and he tells this like whole story. They're just getting into, you know, hood rat stuff and\r\n\r\n\r\nAnd Joe's like, did you know who this guy was? He's like, no. And then he didn't know my name either. I don't think he knew who I was. They just like connected. They were just having fun. And it turns out the guy was, do know who Hunter S Thompson is or was? Yeah. And so Bill Murray and Hunter S Thompson became like lifelong friends after that. Now Hunter S Thompson is a little bit older and, and he was an investigative journalist. Like anyways, he was, he was top notch, but these two guys connected not because it was like, Oh, you're a movie star. Oh, and you're a journalist. Cool. We're both successful. They were just like at a bar.\r\n\r\n\r\nSam (34:04.045)\r\nwas it really?\r\n\r\n\r\nSam (34:10.172)\r\nThat's so funny.\r\n\r\n\r\nNikolas Hulewsky (34:25.76)\r\nit started chopping it up.\r\n\r\n\r\nSam (34:26.972)\r\nDid you know that's how I know Tim Ferriss? Yeah, Tim Ferriss and I used to go to the park and walk our dogs. Maybe he knew my first name, maybe not even, but we were like dog walking acquaintances. Yeah, we were just talking about dogs. And the neighborhood, he didn't know who I was, but of course I knew who he was, but I didn't want to blow his cover, I wanted to make him feel comfortable.\r\n\r\n\r\nNikolas Hulewsky (34:30.104)\r\nNo way.\r\n\r\n\r\nNikolas Hulewsky (34:44.556)\r\nReally?\r\n\r\n\r\nSam (34:55.14)\r\nAnd then after doing this for a handful of weeks or months, he cold emailed me, asked about newsletters and asked if he could get dinner. And I was like, yeah, yeah, let's get dinner. And I show up to dinner. He's like, wait, you're that guy?\r\n\r\n\r\nNikolas Hulewsky (35:09.07)\r\nThat's so good.\r\n\r\n\r\nSam (35:14.107)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (35:14.51)\r\nI grew up when I'm nine kids, obviously, because I'm Mormon. my oldest brother, his name is Ian Puente. He's a half brother. I have another brother who's a half brother. My oldest sister is half Chinese. I had a twin sister who was severely developmentally delayed. And then my two youngest sisters are actually my cousins. We adopted them because my aunt was a drug addict. like, my family is super close. and my dad is an immigrant. He grew up in Brazil, but he's full blood Ukrainian. He was a professional soccer player, tons of Latin American friends.\r\n\r\n\r\nSam (35:19.815)\r\nYeah.\r\n\r\n\r\nSam (35:44.018)\r\nWell see, it sounds like the UN, man. You got a very, yeah, yeah, you guys, were you like negotiating like treaties and stuff like that in your household? It sounds like.\r\n\r\n\r\nNikolas Hulewsky (35:46.69)\r\nDude, it's amazing. Tell me an accent, I'll do it.\r\n\r\n\r\nNikolas Hulewsky (35:53.262)\r\nPretty much. Pretty much. And I was the middle child, so I was the problem solver. But yeah, was like, Nikolai, what is your sister Natasha? I don't know. She's with Ian, my Mexican brother. Anyways, I've always felt like I could connect with almost anybody because of that, except for very, very wealthy people who were like, yes, we took the yacht out this weekend and went to St. Martha's Vineyard. I still can connect with them, but there's just like...\r\n\r\n\r\nyou have a life experience where I feel like I can connect with 95 % of people and it makes life way more enjoyable.\r\n\r\n\r\nSam (36:29.938)\r\nWell, a lot of times, you know, I've been fortunate. It's very strange. think there's only like two or three thousand or maybe four thousand billionaires on Earth. On MFM, we've had like four percent of them on the podcast. And so I've been like crazy fortunate to like meet these people who are like tip top of their game. And the majority, but not all, the majority of self-made entrepreneurial billionaires are fairly not like you're describing, or maybe they do live that fancy life. Many of them do.\r\n\r\n\r\nNikolas Hulewsky (36:57.39)\r\nIt's true.\r\n\r\n\r\nSam (36:59.43)\r\nBut they like, they can snap out of it like pretty quickly. Like you could be like, like, you know, you could be like, dude, like get the leftovers and don't throw away the food at the restaurant. Like I've done that before. And like, and they're like, yeah, that's a good idea. What are we, what are we crazy? We can't. And so, but like the kids or the grandkids are definitely assholes.\r\n\r\n\r\nNikolas Hulewsky (37:11.682)\r\nHahaha\r\n\r\n\r\nBut it's true. Yeah. Well, my so my brother-in-law, he's going to be a billionaire. He's just he's he's got a health care company. Five hundred million dollars that he's grown in seven years. It's growing like crazy. And luckily, I've known him for 20 years, like well before he became what he is now. And we're still like, hey, man, I got to get a colonoscopy and I need a colon cleanse. You want to take me to Taco Bell real quick? And we're like, oh, yeah, sure. Let's let's let's ride a Taco Bell. Let's get a Baja blast while we're there.\r\n\r\n\r\nbut it is that like second generation who are like, hmm.\r\n\r\n\r\nSam (37:45.106)\r\nIt's disgusting.\r\n\r\n\r\nNikolas Hulewsky (37:49.934)\r\nWhich part? The fact that I have to get colonoscopies?\r\n\r\n\r\nSam (37:50.076)\r\nsounds like the worst thing ever. Like, just how disrespectful to his doctor the next day that you're just gonna like eat Taco Bell.\r\n\r\n\r\nNikolas Hulewsky (37:58.002)\r\nDude, I'm, I hope you never have to get a colonoscopy before you're 50. Okay, that's all I'm gonna say to you. I have to get them regularly. Unfortunately, my sister died of colon cancer. So it's like, they're like, okay, starting at 35 every, every year, let's stick. the nurses, like, when did all the nurses just get super young in these colonoscopy clinics? They're all like 25 year old new grads. I'm like, okay, I guess I'm just supposed to get naked and.\r\n\r\n\r\nSam (38:21.914)\r\nI'm so excited, can't, yeah, I don't know. I can't speak to that. You could have that one.\r\n\r\n\r\nNikolas Hulewsky (38:27.096)\r\nweird. All right, let me I, I kind of feel like you hit on something there. I kind of feel like my first million has become my first 10 million, or almost like my first billion. I think it's because it's a function of you wanting to talk to like really interesting people. And it just so happens to be that the more well known your podcast has become, the more access\r\n\r\n\r\nSam (38:31.44)\r\nHa ha.\r\n\r\n\r\nSam (38:48.336)\r\nYeah, we get a lot of criticism for that. Yeah, we get a lot. No, it's not more access. We get a lot of criticism for that. And I will happily take that criticism because when we started the podcast, both of us were still kind of up and coming. And I don't care about making my first million. I, I, if I care about it, I care about money a lot less nowadays than people think. But I care about, like I said, like steps that one takes to like achieve.\r\n\r\n\r\npotential, but I definitely am more interested if I were to talk about money. It's more like, all right, tell me like about a hundred million or or hundreds or billions. Like that's definitely a little bit more where I'm trying to go. And and\r\n\r\n\r\nNikolas Hulewsky (39:33.112)\r\nCause that's a game you haven't played yet. Like that's the part you're curious about.\r\n\r\n\r\nSam (39:36.324)\r\nYeah, like I'm on my way and I wanna like learn about that stuff. But also, I think life is a lot richer than just money. And so I actually tend to care about many non-money things that MFM didn't used to discuss that now we do. So like...\r\n\r\n\r\nNikolas Hulewsky (39:53.838)\r\nSo the adjective you use to describe money is richer.\r\n\r\n\r\nIt was just funny. No, no, was just funny. Life's a lot richer without money.\r\n\r\n\r\nSam (39:59.138)\r\nNo, I just, life, I use that to describe life. No, I didn't say, I said life's richer than just money. And so like, you know, I like the idea of like, how do I make a rich life? Well, it's not, money's only one of a handful of parts to it. And so sometimes I'm interested in those other parts.\r\n\r\n\r\nNikolas Hulewsky (40:24.214)\r\nAlright, let me ask you this question. When was the last time that you thought to yourself, that you were complaining about something, that you thought to yourself, my gosh, I've become an out of touch a-hole?\r\n\r\n\r\nSam (40:37.618)\r\nI had to do, I had to do laundry the other day for the first time in like three years. I freaking hate folding my clothes. That's like a chore that I cannot stand and I had to do it the other day and, I hated it.\r\n\r\n\r\nNikolas Hulewsky (40:39.138)\r\nBecause let me give you an exa... Can I give you an example? Really?\r\n\r\n\r\nNikolas Hulewsky (40:53.728)\r\nAll right, let me flip it the other way. After talking to so many successful people and having experienced success yourself, what's something that you might have viewed as an indulgence when you were younger that most successful people do that now knowing what you know now, even if you were poor again, you would still indulge on that? Does that make sense what I'm asking?\r\n\r\n\r\nSam (41:13.426)\r\nYeah, Hiring service people around the house. think that, yeah, like cleaners, handymen, people to do my laundry, people to cook, things like that. think that, you you probably only need to spend anywhere from one to $2,000 per month to make your life like three times easier and more convenient. You know, I remember as a, however old I was when I was making, let's say, $100,000 a year, I like,\r\n\r\n\r\nNikolas Hulewsky (41:18.444)\r\nReally.\r\n\r\n\r\nSam (41:42.714)\r\ndreaded laundry. I dreaded cooking and so I would kind of eat poorly and get fat and looking back had I just spent roughly $1,000 per month my life would have been a lot better and more convenient and I would have been able to spend money on the things that I hated and I hate doing those things.\r\n\r\n\r\nNikolas Hulewsky (42:02.35)\r\nThat's interesting. So for you, what would that $1,000 have been spent on? Food prep?\r\n\r\n\r\nSam (42:08.113)\r\nJust like, no, yeah. You know, like right now I order these meals called Eat Clean Bro, so I like those. And then also, that's what it's called, and then having someone come up, just picking up, like come on picking up my laundry, doing it and bringing it back. Like it's that simple. And then I was too cheap to do it. And I don't know why. And like people are like in awe, like that I'm like, well, I don't do laundry, I don't cook. And they're like, that's like a rich guy thing. I'm like.\r\n\r\n\r\nNo, like you could do that for like a thousand, that's like you could spend a thousand dollars a month. Like you don't, if that's your thing, you don't, you can cut back on other things and indulge on that thing. And it all depends on what your money dials are, you know, and that's my dial. Services.\r\n\r\n\r\nNikolas Hulewsky (42:38.7)\r\nNow that's a me thing.\r\n\r\n\r\nNikolas Hulewsky (42:51.288)\r\nDude, I've, when did you get okay with that? Because obviously back then you weren't okay with it, but like, when did you realize?\r\n\r\n\r\nSam (42:55.718)\r\nso my financial situation was interesting. I, I paid myself very little when I ran my company. So I was cash poor, which was a huge mistake. I wouldn't suggest doing that. it's like, cause my business was making money and I should have paid myself more. And then the last year I paid myself a lot. And then also my wife worked, was an early ish employee at Airbnb and she crushed it because of a.\r\n\r\n\r\nIPO of Airbnb and then like two months later my company sold and that was like life-changing overnight and then So that was like it took me about two years to get used to what that felt like because I went very quickly from like making $50,000 a year to You know not a lot more and it took probably two years to get used to it. Maybe maybe honestly it took four years\r\n\r\n\r\nNikolas Hulewsky (43:49.454)\r\nWhat did you think your superpowers were back then? And like, what do you think they are now? Has it changed at all?\r\n\r\n\r\nSam (43:53.746)\r\nBack then was tenacity. I was a dog. Like if I was gonna, if I had my mind set on something, I was going to get it or get close. And I would work really hard. I would think really hard and I'd be laser focused on that goal. So tenacity. My superpower now, I think I have like,\r\n\r\n\r\na pretty insatiable appetite for information. I just can't stop reading and learning. Like I'm incredibly curious. Like the most used app on my phone is Wikipedia. Like I'm just on Wikipedia all day. I just cannot, I just, love learning. I love history. I just love consuming information and learning about how things used to get done so I can hopefully predict the future.\r\n\r\n\r\nNikolas Hulewsky (44:37.867)\r\nday.\r\n\r\n\r\nNikolas Hulewsky (44:50.104)\r\nHave you not started using like Chat GPT's voice mode where you can actually interact with it, ask it questions, have it give you answers?\r\n\r\n\r\nSam (44:55.5)\r\nYeah, so I'll go on like the other day, me and chat.gbt just had a huge conversation on the origins of World War Two. like, yeah, like I'll have long conversations with it.\r\n\r\n\r\nNikolas Hulewsky (45:02.446)\r\nIt's amazing.\r\n\r\n\r\nNikolas Hulewsky (45:06.264)\r\nDude, my son, he's 11 now, and he'll be like, hey, dad, who was the first emperor of Rome? I'll be like, I don't know. And we'll be on a car drive, and then for the next 30 minutes, we just have chat GPT up, and we're just asking it questions. Like, well then what happened to him? Where did Caesar come from? I didn't know that Tsar in Russia is from Caesar, and Kaiser in Germany is from Caesar. Like, you're like, whoa, all these things are connected? It's been actually really cool. This sounds so stupid.\r\n\r\n\r\nSam (45:31.74)\r\nThere's basically two guys on Earth. You know, there's guys who are interested in the Roman Empire and guys who are interested in World War II. I'm more of a World War II guy, but I understand the Roman Empire sentiment.\r\n\r\n\r\nNikolas Hulewsky (45:38.133)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (45:42.606)\r\nSo, it's interesting you didn't say the ability to connect with people as a superpower.\r\n\r\n\r\nSam (45:51.058)\r\nI'm a little bit of an autist, man. Like I don't really connect with people that well. Like I, I like spending a lot of time by myself. we have a joke in my household. We say no new friends. like I don't really want to like, like, I don't want that many new buddies. Like, I, I like solitude.\r\n\r\n\r\nNikolas Hulewsky (45:55.648)\r\nYou are. Yeah, well.\r\n\r\n\r\nNikolas Hulewsky (46:07.438)\r\nmy gosh.\r\n\r\n\r\nNikolas Hulewsky (46:16.172)\r\nWell, let me paint. Let me paint the other side of the argument here. Can you tell me about your Airbnb experience? And then I promise this this has a this has a point where when you. Yeah.\r\n\r\n\r\nSam (46:25.234)\r\nThe one where I got fired? Yeah, so basically in 2007, no, sorry, I don't remember, maybe 2010. So I was a track and field runner in college. And in 2010, I think it was, one of the most famous milers, a guy who ran the mile, he named Chris Lukasik, retired from running, enjoyed a company called Air Bedding Breakfast. And I was like, what the heck? What's that about? That sounds so interesting. How'd this guy retired at this peak?\r\n\r\n\r\nNikolas Hulewsky (46:47.982)\r\nyou\r\n\r\n\r\nSam (46:52.774)\r\nAnd so that's what I learned about Airbnb and I'd follow them forever. And then when I was a senior in college, I was like, all right, now's the time. I could email Brian and Joe, the founders, and I can impress them. And I did. And they weren't impressed by what I told them. They were just impressed that I had the courage to follow up a ton and write a coherent email, whatever. And they were like, if you're in the Bay Area, come to my office on Monday. Of course.\r\n\r\n\r\nI was not in the Bay Area. didn't know what the Bay Area even meant. I thought that meant LA. I was living in Tennessee at the time. Bay Area, yeah, didn't know. thought that I was like, is that San Diego? Like I literally had to Google, like what is that? And I had never been like west of like Colorado probably. And so I flew out there the next day and I interviewed with them and I got the job. I left school and I moved out there. But around the same era,\r\n\r\n\r\nNikolas Hulewsky (47:30.424)\r\nRight.\r\n\r\n\r\nSam (47:46.8)\r\nI was going through some stuff. I got a load of some demons in me a little bit and I had gotten arrested. I got arrested for fighting. I got arrested for DUI. Basically it all stemmed from drugs and alcohol. And I thought I was pulling a fast one because on the application it said something like, have you been convicted of a misdemeanor? And at that time, I was actually, my court date was scheduled for a later period and I was like, well, technically I've not been convicted yet.\r\n\r\n\r\nBut it was some type of like gray area, but like it was still like I was lying and I got\r\n\r\n\r\nNikolas Hulewsky (48:18.193)\r\nmy gosh.\r\n\r\n\r\nNikolas Hulewsky (48:23.82)\r\nYeah, you knew you were lying, but it was also like, well, I mean, technically.\r\n\r\n\r\nSam (48:27.002)\r\nI thought I could argue my way around it, but basically, I moved out to San Francisco and everything, and the day before I was supposed to start, they were like, you you lied, so don't show up. You don't have the job. And so I never actually got a job there. And then years later, my wife started working there, and I used to joke that it was like my alma mater and like my old stomping grounds, but I never actually worked there. And years later, a handful of months ago,\r\n\r\n\r\nNikolas Hulewsky (48:46.392)\r\nYeah\r\n\r\n\r\nSam (48:52.88)\r\nI got to hang out with Joe, the founder, and he remembered the thing. And so it worked out.\r\n\r\n\r\nNikolas Hulewsky (49:01.08)\r\nCan you, I've been curious though, like, was it, hey, piece of crap, you lied. No, you can't work here. Or was it like, dude, Sam, we like you, but come on, man. Like you lied on your app. Okay.\r\n\r\n\r\nSam (49:11.224)\r\nIt was the second one. They were very, they were respectful and like, I agreed with their decision. They were 100 % correct. So it was all love. Like it was, it was on me. I'm the one who made the mistake. But no, the hiring manager. Yeah, yeah, yeah, yeah, I did. Yeah, it was, it was all good. They, they, they were, they were in the right. I was in the wrong. There was no one to blame but me.\r\n\r\n\r\nNikolas Hulewsky (49:24.12)\r\nDid you stay in touch with, obviously not Joe, like, did you stay in touch with the?\r\n\r\n\r\nNikolas Hulewsky (49:36.942)\r\nso what I thought was interesting from that story is like, brings you out to San Francisco. And then obviously there's a lot of series of events, but you started this thing called the hustle. had hustle con and.\r\n\r\n\r\nSam (49:48.646)\r\nAnd I was going to go to SF anyway. Like I had been Googling like where do internet companies start and stuff like that. Like I knew I was like, I didn't understand like any, like I just thought San Francisco just met on the other side and I wasn't sure if it was like, I didn't quite understand. And, but I knew I was like, I was plotting. Like I remember I was like, I'm going to contact Uber. I'm going to contact like, I'm getting out there. There is some way in which I will be there. And yeah, I made it happen.\r\n\r\n\r\nNikolas Hulewsky (49:54.604)\r\nYou just didn't know it was the Bay.\r\n\r\n\r\nNikolas Hulewsky (50:01.07)\r\nSo good.\r\n\r\n\r\nNikolas Hulewsky (50:16.92)\r\nWell, like from that, just find it interesting. Like I said, you had the hustle, you had HustleCon. It seems like you've always been able to build networks where you've played a connector role. And then you've also used those networks as leverage to identify kind of trends or like, hey, this is kind of the way that things are moving in the future. And you may not feel like you're a people person, but...\r\n\r\n\r\nyou're so freaking likable and you're relatable and like you talk about your failures openly. And there's something very endearing about that you wouldn't have been able to build these networks without the ability to get people to trust you and like you. Does that make sense? What I'm saying? So like, for me, it's it's interesting to hear you say like, I'm not really great with people when it feels like that was sort of the impetus or at least the thing that got the snowball rolling.\r\n\r\n\r\nSam (51:08.396)\r\nYeah, I think that like I remember being a kid and like I grew up in an Italian neighborhood. We call it Italian. I grew up with the Italians in St. Louis and I was like the only non-Italian and but like the funny thing about Italians is they love restaurants and like everyone owns a freaking restaurant and I remember like as a kid going to the restaurant and like the owner of the restaurant sometimes you wouldn't know who they were but you just saw this guy walking around putting his hand on people's back being like how are you how's everything everything good?\r\n\r\n\r\nand they had the best energy and everyone gravitated to them. And I was like, I'm gonna steal that. I'm gonna have that wherever I go. Where I'm just gonna act like I'm the guy in charge somehow. And so when I lived in San Francisco, but even before that, I remember I lived in Sydney, Australia for a little while. Whenever I would go to the new place, I just was like, if I can do the work of organizing people around something, I will eventually become the node or become the center of it.\r\n\r\n\r\nAnd it will pay dividends. And so right when I moved out to San Francisco, I started a book club called the Anti-MBA. And that took off. That was like it wasn't like a business. mean, I spent money on it. I didn't make any money, but like I met so many amazing people. And I just I learned early on that if I just become the center, I will benefit some way. And it didn't it's not that hard to be the center. You just have to do work. You just have to like organize.\r\n\r\n\r\nNikolas Hulewsky (52:08.686)\r\nYep.\r\n\r\n\r\nSam (52:32.882)\r\nAnd so that was really important to me. But also, I was a pretty goofy kid in high school. And I wanted to meet girls, and I wanted guys to like me, like my friend. I wanted to be accepted, so I was always like, if I just organize people, girls will like me because they'll think I have power, and guys will rely on me because I'm the one doing the work. So great, I got built in friends, and maybe I'll meet a girlfriend. So I was really wanting acceptance.\r\n\r\n\r\nNikolas Hulewsky (52:59.222)\r\nYeah, I really love getting to know people and organizing things. But for me, it's been more selfish of like, I just really enjoy it and I don't want to feel left out. But what I've noticed is it totally increases your surface area of luck. Like you and I wouldn't be talking if like Kimmy and I hadn't connected, right? I didn't know that she was a part of Sandlist or whatever, but\r\n\r\n\r\nSam (53:14.627)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (53:21.964)\r\nJust the more people that you know, and the more you put yourself out there, the more opportunity kind of comes to you over time. I'm not going to say that you put out to the universe. I'm not going to say it, but it does apply here.\r\n\r\n\r\nSam (53:30.482)\r\nYeah, I agree. think I remember being in like sixth grade I read the book How to Win Friends and Influence People because I was like desperate to like\r\n\r\n\r\nNikolas Hulewsky (53:40.724)\r\nlike the oldest soul who in sixth grade we reads freaking how to win friends and influence people it's amazing\r\n\r\n\r\nSam (53:42.322)\r\nYeah, I was like...\r\n\r\n\r\nSam (53:46.148)\r\nA guy who's desperate to fit in, that's who. And so I've been, and I've also like, I've just always been obsessed with personalities. just like the, I've just, I've always been obsessed with the person who's brave enough to not fit in and been obsessed with like how this person attracts a following and gets other people to do stuff. That's just like, like I remember as a kid, I'm like, isn't it crazy that the president,\r\n\r\n\r\nthat this institution of America is just like a group of people who are like collectively buy into this. Like that's so strange to me and that's so fascinating and cool. I want to, I want to do that. And so I just was always interested in personality. And what I learned early on was people were drawn to my curiosity. And so if I do, if I make my curiosity like public or as like a spectacle for others, I just get to do what I enjoy. And also it attracts other people.\r\n\r\n\r\nyou know, like there's that saying that like you'll help someone. Like if you see a guy holding his thumb out with a flat tire versus a guy like pushing his car, like you're more likely to help the guy pushing the car. And so I was like, okay, I'm just going to like push the car in front of everyone all the time.\r\n\r\n\r\nNikolas Hulewsky (54:44.526)\r\nNikolas Hulewsky (55:01.376)\r\nOkay, here's my last like serious question. Then I have just a couple of rapid fire questions. What is your favorite way to see the signal through the noise? cause trends obviously was a company that you had, but you're still connected to a lot of people. You see things early. You probably get a lot of opportunities. You make decisions to not invest in things or to like Hampton. You're like, I'm going all on in Hampton. Like, how do you look at things that are coming down the pipe?\r\n\r\n\r\nthat the general population may not be seeing right now and where do you find them?\r\n\r\n\r\nSam (55:36.422)\r\nI think, so generally speaking, hype is just hype and the things that become popular in 10 years are the things that are not in the newspaper or if they are, they're on the hypothetical back pages. So for example, Bitcoin wasn't talked about in the news early on, it was with a bunch of freaks on a forum. But like the things that were popular like,\r\n\r\n\r\nlike the things that were hypey, they just like, that's not, those tend to be fads, not, yeah, they like tend to be fads, not trends. Because the thing that the weirdos are doing in their hobby, like as a hobby, that tends to be the stuff that actually tends to like become a thing in 10 years. And so I've always, we used to have a saying at my, at the household where our company was where you let,\r\n\r\n\r\nNikolas Hulewsky (56:06.817)\r\nAOL.\r\n\r\n\r\nNikolas Hulewsky (56:11.469)\r\nThe segue.\r\n\r\n\r\nSam (56:34.406)\r\nthe freak flag fly, meaning you can be like a weirdo and like, I will accept you because I love weirdos and oddballs. And so I just am constantly seeking them, seeking them out. And I just will be relentless on pursuing them. So I'll give you an example. Do you know who Isaac French is? Isaac French is a very successful guy. He's very young. I don't know how old he is. Probably late twenties at this mid twenties. So.\r\n\r\n\r\nNikolas Hulewsky (56:54.254)\r\nYeah.\r\n\r\n\r\nSam (57:02.578)\r\nI found Isaac, someone had told me about this guy who had an Airbnb that was interesting, I randomly, at the same time, it all kind of worked out, where I saw his page for his bed and breakfast. And his about page said, I am an accountant, I am a Airbnb owner, but I really view myself as an artist because I love painting more than anything. And I was like,\r\n\r\n\r\nWhat? This freaking guy, this is, what? Did he just say, I've never heard anyone say that in my life. You're an accountant, but also an artist, huh? And I called him. I just called him. go, hi, Isaac, my name's Sam. He didn't know who I was. I was like, your About page was incredibly fascinating. What's your story? And at the end of that phone call, I was like, I'm going to Idaho next week. Do you want to come with me? And.\r\n\r\n\r\nby the way, you should get a Twitter page, because I'm going to write about you, and I think you're going to get popular. And Isaac, who many people listening know, he had no social media at that time. But also, so Isaac is part of this religion called American Heritage, which I jokingly call him a Mennonite, because if you don't know anything about that religion, they're kind of like Mennonite-y. And when he told me all these things, I was like, you're a freak. I love you. Let's become best friends.\r\n\r\n\r\nNikolas Hulewsky (58:17.09)\r\nYeah.\r\n\r\n\r\nSam (58:26.65)\r\nAnd that's sort of like what I've done many times. Like I'll meet someone and they're just an absolute strange person. Or they have this weird combination of hobbies or interests that just, I've never met anyone like it. And whenever I meet people like that, I'm immediately drawn to them. Like I'll give an example, another example. I met this guy named Cliff. Cliff wanted to come to the Hustles office because he wanted to learn about, I don't even know why he wanted to.\r\n\r\n\r\nNikolas Hulewsky (58:47.438)\r\nThanks\r\n\r\n\r\nSam (58:53.286)\r\nWhen he came to the office, I was like, so what's interesting about you? He's like, I can do a backflip. And I was like, what? He's like, he was like, I backflip really good. I go, do it right now. And in the middle, and in the middle of my office, he did a backflip. And I was like, that's so you're like, it was so such a weird interaction. And now clip. So Cliff has a company that does nine figures a year in revenue. called speechify. But when I met him, he had\r\n\r\n\r\nNikolas Hulewsky (59:19.982)\r\nDude, have, that's awesome. I have speechify. I love speech, sorry.\r\n\r\n\r\nSam (59:23.186)\r\nYeah, so Cliff is just an example where he was 21 and he had the audacity to backflip in my office. And I was like, it just went off again. You're a freak. I love you. I want to follow you. it's always been a really good indicator of is someone going to outperform, is if they're incredibly odd.\r\n\r\n\r\nNikolas Hulewsky (59:43.778)\r\nYeah, it's like that scene in Step Brothers where they're like, what's your favorite dinosaur? Philosoraptor. What? Do we just become best friends?\r\n\r\n\r\nSam (59:47.714)\r\none. Yeah, like if I could meet someone who like, does weird shit, like here's a weird thing about me on my feet and on my legs, I have a bunch of homemade tattoos. I just read that like you could give yourself a tattoo with a sewing needle and I found that to be incredibly fascinating. If I meet someone that has another stick and poke homemade tattoo, I'm like, you're\r\n\r\n\r\nvery strange like me, tell me everything about you. And like, you could just find all these like weird stories when someone has one or two odd or off things about them.\r\n\r\n\r\nNikolas Hulewsky (01:00:24.782)\r\nDude, I love that. All right, I'm gonna end with some rapid fire questions for you. My first million guests, who has been your favorite guest?\r\n\r\n\r\nSam (01:00:39.238)\r\nRob Dierick, I've become friendly with him. He was pretty amazing and probably lair-\r\n\r\n\r\nNikolas Hulewsky (01:00:43.947)\r\nWas it the episode or was it the relationship you developed with him afterwards?\r\n\r\n\r\nSam (01:00:47.75)\r\nThe episode. He's a very unique human being. Jesse Itzler is pretty amazing. Jesse Itzler is one of the very few people who I admire all facets of his life.\r\n\r\n\r\nNikolas Hulewsky (01:01:03.47)\r\nSo, all right, this will be my next question. Which guest do you think your 80-year-old self would be most proud of if you had a life most similar to? And you might've just answered it with that previous.\r\n\r\n\r\nSam (01:01:14.194)\r\nI can give a layer Hamilton, think. Yeah. Lair Hamilton was the perfect amount of stubborn. think that he has his values and he does not bend. And I think that he's has the values that I love. Lair Hamilton is interesting.\r\n\r\n\r\nNikolas Hulewsky (01:01:18.434)\r\nReally, why?\r\n\r\n\r\nNikolas Hulewsky (01:01:35.278)\r\nWhat are the characteristics that you've seen across the successful people that you've interviewed that surprised you as being a commonality?\r\n\r\n\r\nSam (01:01:50.244)\r\nMost of them do not have as significantly higher or lower IQ than I do. And I would say that I'm like a 75 to 80 percentile smart person. they oftentimes I'll meet someone who's a thousand times more successful than I am, but they are we have the same intelligence. We have similar characteristics other than they knew what they were trying to do and they got after it.\r\n\r\n\r\nNikolas Hulewsky (01:02:00.43)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (01:02:18.188)\r\nI think.\r\n\r\n\r\nSam (01:02:18.256)\r\nLike there's not like financial situations that are significantly different. There's not, they're still afraid. They have insecurities. Like there's just not that much difference. And the only difference being they said, this is where I'm going to go and I'm going to pursue it in spite of being fearful and having all these other issues.\r\n\r\n\r\nNikolas Hulewsky (01:02:38.168)\r\nWell, and there's like, there's a thing where you have to be a certain level of smart. That's kind of like table stakes, but everything past that it's kind of just nice to have. However, the\r\n\r\n\r\nSam (01:02:45.276)\r\nThere's a handful of people that are genuinely, like their oven burns hotter, like I can never keep up with them. So like Darmash is one of them, Max, the guy who started Grammarly, like when I'm around them, I'm like, well, you just, I will never compete with you in terms of like raw IQ. You are just significantly smarter than me. But there's many, many, many other people that are as rich and wealthy and they're just more tenacious.\r\n\r\n\r\nNikolas Hulewsky (01:03:10.926)\r\nDo you think that they have one attribute that is off the charts? okay, baseline level of intelligence is whatever, 75%, 80%. Really.\r\n\r\n\r\nSam (01:03:18.928)\r\nYeah, stubbornness usually, a lot of stubbornness. Yeah, and they're disagreeable.\r\n\r\n\r\nNikolas Hulewsky (01:03:28.532)\r\nWhich of your here's one that I like. Which of your guests, by the way, these are all real questions. This is not chat GPT. But which of your guests, if you had to put your money in for the rest of your life, just like, all right, here's all my money. I'm betting on you. Who would you pick?\r\n\r\n\r\nSam (01:03:48.198)\r\nLike a young person? who, like if they...\r\n\r\n\r\nNikolas Hulewsky (01:03:49.774)\r\nNo, no, mean, I mean, I guess relatively youngish, you're not putting it in Warren Buffett at this point.\r\n\r\n\r\nSam (01:03:56.634)\r\nWell, if I had to like give like a less obvious answer.\r\n\r\n\r\nSam (01:04:03.73)\r\nWell, I would need to I've done 800 or 700 episodes. I don't remember all the guests, but like a relative, a pretty young person who I think like I would get like an amazing return if they just control my net worth would be Austin Reef.\r\n\r\n\r\nNikolas Hulewsky (01:04:16.628)\r\ntell me more. Why?\r\n\r\n\r\nSam (01:04:18.022)\r\nYeah, I just think he's an animal and he has very, he makes wise decisions. I think he's got the perfect amount of aggressiveness and conservative attitude. He is conservative, conservative, conservative and then he sees it's working and then he goes all in. And I think that that is a winning combination.\r\n\r\n\r\nNikolas Hulewsky (01:04:39.308)\r\nThat's interesting. Man, now I really want to talk to Austin Reif. Does it have anything to do with the space that he's in? mean, he's in media as well, or is it, it's him.\r\n\r\n\r\nSam (01:04:48.454)\r\nNo, he'll have the same outcome regardless. mean, you put him in a bad situation, it'll be get a good outcome. If you put him in a great situation, it's going to be a world class outcome. Like it's almost always going to be a winning situation. just the magnitude matters.\r\n\r\n\r\nNikolas Hulewsky (01:05:01.292)\r\nMark Andreessen has this quote about Sam Altmore. It's like, we left everybody on a desert island and I came back in a year, or it a Paul Graham, and I came back in a year, like he'd be Lord of the Flies. Is that Austin or no?\r\n\r\n\r\nSam (01:05:08.786)\r\nPaul Graham said that.\r\n\r\n\r\nSam (01:05:16.426)\r\nNo, Austin, he's pretty mild-mannered, so I don't think that he's gonna lead a bunch of savages, but he'll get a good return.\r\n\r\n\r\nNikolas Hulewsky (01:05:26.382)\r\nHe'll get a good return on that investment.\r\n\r\n\r\nSam (01:05:29.074)\r\nYeah, just makes, I think he just makes very good decisions. I think most people like myself, I'm ruled by my emotions, which is a pro and a con. He has a good combination where he'll be like, my emotions say this, my rational side says this, which one should I listen to? Like he does a very good job of like being rational and emotional. I tend to be a lot more emotional. And, but to be great, need both.\r\n\r\n\r\nNikolas Hulewsky (01:05:52.385)\r\nOkay, all right.\r\n\r\n\r\nThat's a safe pick. want to know, the first part of that, you triggered something in my mind. Who do you think has the most potential upside of people that you've interviewed? They can be young, right? It could be Isaac French for all.\r\n\r\n\r\nSam (01:06:12.814)\r\nNo, Isaac French is too happy. The problem with Isaac is that he's emotionally content. He seems like very happy person. He's going to be incredibly successful. I'm just joking.\r\n\r\n\r\nNikolas Hulewsky (01:06:18.402)\r\nYou need somebody, you need someone more disagreeable.\r\n\r\n\r\nNikolas Hulewsky (01:06:27.906)\r\nYeah.\r\n\r\n\r\nSam (01:06:34.61)\r\nSo the question is what? Say it again.\r\n\r\n\r\nNikolas Hulewsky (01:06:38.7)\r\nLike if you had to pick an up and cover that you think has the most potential upside of people that you've interviewed recently, let's say 30 and under if there's any, you know, or 40 and under who come to mind.\r\n\r\n\r\nSam (01:06:51.346)\r\nAll right, let me think. Well, and you could cut it to reduce the silence, but let me think. I want to give an answer.\r\n\r\n\r\nNikolas Hulewsky (01:06:51.662)\r\nLet's use.\r\n\r\n\r\nYeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (01:07:01.166)\r\nI should have come with a list, sorry.\r\n\r\n\r\nSam (01:07:04.818)\r\nNo, let me think.\r\n\r\n\r\nSam (01:07:17.515)\r\ndo you know Wade Foster? Wade Foster started Zapier.\r\n\r\n\r\nNikolas Hulewsky (01:07:21.218)\r\nNo.\r\n\r\n\r\nNikolas Hulewsky (01:07:24.822)\r\nyeah.\r\n\r\n\r\nSam (01:07:26.896)\r\nWade lives in Jefferson, Jeff City, Missouri, which is, I'm from St. Louis, Missouri, and St. Louis is nothing, Jefferson City's definitely not happening. And I think there's a world where Wade becomes worth many, many tens of billions of dollars. He's probably already worth three or four billion. I would think, I don't know what Zapier's,\r\n\r\n\r\nNikolas Hulewsky (01:07:35.384)\r\nyou\r\n\r\n\r\nSam (01:07:56.888)\r\nThis is all just public information. whatever Zapier is worth, I think they've mostly bootstrapped. so, you know, whatever that is. but that guy reminded me a lot of Darmesh. So Darmesh is the CTO of HubSpot and a multi-billionaire. And I can't say all of the Darmesh's stories because a lot of them have been off the record. That guy makes money. His hobbies make stupid, like little side things that he has done.\r\n\r\n\r\nhas made so much money. And the reason is, is because he's got this weird combination of competitiveness, but also like, he's a hacker, he, like everything is a game to him and is a hobby. And typically people who are like incredibly successful, one attribute many of them have is they, they're gamers, like not like just video games, but board games, whatever. Wade Foster has that attitude to me, where he wants to win, but not at the...\r\n\r\n\r\npoint of he's going to bend on integrity and he also seems like he seems like someone who loves games like if you taught him a board game he would like study it at night.\r\n\r\n\r\nNikolas Hulewsky (01:09:03.0)\r\nDude, that's why so many Mormons are successful in business. Settlers of Catan, you bust a settler's Catan out at a Mormon party? Gloves are off, bro. They're gonna be saying, heck, frick, what would be a problem?\r\n\r\n\r\nSam (01:09:11.354)\r\nI know you guys are animals. And drinking tons of Dutch Bros and other soda.\r\n\r\n\r\nNikolas Hulewsky (01:09:17.112)\r\nTons of Dutch pros. Dude, this was awesome. I appreciate you taking a time. I want to be respectful to your time. I'll keep it recording for this end part. I think it will. Is there anything I can do for you? I mean, I know it's a stupid question. You got more at your disposal, but anything that you're working on that I can help with? I think I saw you were looking for a research assistant recently. I don't know if you...\r\n\r\n\r\nSam (01:09:31.004)\r\nHopefully it turns out good.\r\n\r\n\r\nSam (01:09:45.97)\r\nYeah, I got like 500 applicants. like, word, like narrowing it down to like one interesting person is gonna be a pain in the ass.\r\n\r\n\r\nNikolas Hulewsky (01:09:53.176)\r\nYou know what, actually, I have something I think I can help you with. Have you ever heard of the anti-sikafant prompt?\r\n\r\n\r\nSam (01:10:01.222)\r\nI don't know what that is, no.\r\n\r\n\r\nNikolas Hulewsky (01:10:02.648)\r\nHave you ever noticed when you ask like chat, what's your LLM of choice? Is it chat, GPT Claude? Okay. Have you ever noticed like when you ask it a question, you're like, Hey, tell me what my thinking is here. And they're like, that's a great idea, Sam. my God. Yeah. Yeah. It's the freaking worst. And it makes sense. Cause they want to validate you so that you continue to use the product more, et cetera. Anyways, I've got two things. I've got a prompt that basically says don't act like that. and then I've got, do you use projects at all within chat, GPT or Claude?\r\n\r\n\r\nSam (01:10:15.11)\r\nYeah, I hate that.\r\n\r\n\r\nSam (01:10:32.58)\r\nOnly every day for eight hours a day, but yeah.\r\n\r\n\r\nNikolas Hulewsky (01:10:34.766)\r\nOkay, cool. So I have a project context document as well as project instructions, which are like, not be mean to me, but don't be nice, question my thinking, make sure that I'm, I'm seeing all my blind spots, etc. So I will send that to you because I think you would really like that.\r\n\r\n\r\nSam (01:10:46.364)\r\nThat's fantastic.\r\n\r\n\r\nSam (01:10:50.31)\r\nI would love that. think that rage and guilt and shame are such powerful emotions and I sort of chat GBT to make me feel that way more. I'm not joking. I love that.\r\n\r\n\r\nNikolas Hulewsky (01:10:56.792)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (01:11:01.998)\r\nWell, dude, like everybody talks about and it's cool. man, I set up this automation and it just goes and scrapes this tool. And then I do this at whatever. I'm like, prompts are still where it's at for me at least.\r\n\r\n\r\nSam (01:11:12.986)\r\nYeah, like I want chat jbt to call me a filthy disgusting pig more often\r\n\r\n\r\nNikolas Hulewsky (01:11:18.702)\r\nThat sounds like you have some BDSM going on. No?\r\n\r\n\r\nSam (01:11:22.564)\r\nMore so, I just want to like get ripped and like the more you insult me the better I work.\r\n\r\n\r\nNikolas Hulewsky (01:11:31.166)\r\nCan I just show you, this will be like 30 seconds, can I show you something real quick? Okay, so this is the project instructions here. And I'm gonna go to the bottom so you can see it.\r\n\r\n\r\nNikolas Hulewsky (01:11:47.586)\r\nDon't do this. Don't agree just to be supportive. Don't accept vague answers. Do this. Cut through my rationalizations, present uncomfortable truths, other aspects, actionable alternatives, blah, Here's your truth telling.\r\n\r\n\r\nSam (01:11:59.068)\r\nDo I put that as instructions on every single project?\r\n\r\n\r\nNikolas Hulewsky (01:12:02.574)\r\nWell, it depends on the project, right? Cause some of them, I don't care for it to be debating me. In fact, it's kind of annoying where I'm like, okay, cool. Like I just wanted you to, to make a picture for me for something, you Yeah. Like, Hey, I want to train this week and whatever. But for the things I'm like trying to make high leverage decisions around, I want this. And it does piss me off sometimes. Cause sometimes I just feel like it's being competitive to be competitive. However, it's, it's a very good kind of devil's advocate.\r\n\r\n\r\nSam (01:12:11.75)\r\nJust like, me some, yeah, like give me a good meatball recipe, dick.\r\n\r\n\r\nNikolas Hulewsky (01:12:32.142)\r\nSo what I would do is there's two parts.\r\n\r\n\r\nSam (01:12:33.734)\r\nI love a good devil's avocado.\r\n\r\n\r\nNikolas Hulewsky (01:12:36.334)\r\nYou\r\n\r\n\r\nSam (01:12:37.906)\r\nSo that would be great.\r\n\r\n\r\nNikolas Hulewsky (01:12:39.182)\r\nOkay, so there's two parts of this. This piece, this project coaching instructions, I would kind of use for every project that you have. The piece above it is like tailored for specific projects. So anyways, I'll send you this. I think you'll like it.\r\n\r\n\r\nSam (01:12:51.036)\r\nForward me that right now, I want that so badly. All right, I gotta go. I want that, that's the tism that came out.\r\n\r\n\r\nNikolas Hulewsky (01:12:53.582)\r\nOkay. I want that. Okay, man. Talk to you soon. Thank you so much. All right, dude. We'll talk soon. See you.\r\n\r\n\r\nSam (01:13:03.794)\r\nGod bless America, see you.",
  "metadata": {
    "duration": "",
    "date": "2025-08-15",
    "platform_source": "Google Drive"
  }
}