{
  "episode_number": "65",
  "episode_title": "Why Everyone SHOULDN'T Buy a Business with Chelsea Wood",
  "guest_name": "Chelsea Wood",
  "business_name": "Acquisition Lab",
  "transcript": "﻿Nik (00:00.822)\r\nAll right, Chelsea Wood, welcome to Nicanomics. I'm really excited to have you. We have a special episode today. And I think people listening are gonna get a lot out of this, a lot more than just how does the business work because of your background. So why don't you just briefly give us an introduction. Who are you and what do you do?\r\n\r\n\r\nChelsea Wood (00:20.04)\r\nChelsea Wood. am the co -founder of Acquisition Lab, which is an elite accelerator that helps people buy businesses. My background is I'm an industrial organizational psychologist. And so I've worked with, it's not as cool as sounds, but it's freaking awesome in my opinion. I filtered myself there. My lab members know I have a potty mouth. So I worked as a consultant most of my career. And so I started as a operational kind of advisor.\r\n\r\n\r\ncoaching leaders to kind of help them streamline operations and with a heavy focus on employee engagement. Got tired of that and wanted to, I actually started getting involved in quality improvement work and wanted to strengthen my data side. And so I took an analyst position and that is actually how I ended up in mergers and acquisitions. Yeah, I was the only analyst at a system level.\r\n\r\n\r\nNik (01:11.416)\r\nReally?\r\n\r\n\r\nChelsea Wood (01:15.936)\r\nand I built a good relationship with the executive team, because I guess I'm not really an analyst. Yeah.\r\n\r\n\r\nNik (01:23.374)\r\nCan I ask you something? So you went from being an industrial psychologist, okay, which psychologists are therapists or can be therapists, and then you became an analyst. Would you say that you became the world's first an alropist?\r\n\r\n\r\nChelsea Wood (01:30.91)\r\nOrganizational Psychologists.\r\n\r\n\r\nNik (01:48.302)\r\nPlease tell me you've seen Arrested Development. Please, like, I don't want to, otherwise it's going to make this really uncomfortable.\r\n\r\n\r\nChelsea Wood (01:54.112)\r\nOkay, so we're on a podcast or else I would totally text my husband that you just made that joke on Podcast and my children now can't watch. Thanks a lot,\r\n\r\n\r\nNik (02:08.398)\r\nIt's one of my favorite jokes in Arrested Development. Tobias is a therapist and an analyst and he has these business cards made up that say, an al -repist. And if you want to know why that's so funny, you can go Google it. Yeah, watch the show. But I had to ask. I've never actually met somebody who could fit that bill. It's amazing.\r\n\r\n\r\nChelsea Wood (02:10.048)\r\nChelsea Wood (02:21.308)\r\nwatch the show it's a great show.\r\n\r\n\r\nChelsea Wood (02:29.626)\r\nmy god, don't know if I'm gonna be able to move on from that, but thank you for that.\r\n\r\n\r\nNik (02:31.31)\r\nSorry, I distracted you. All right. So you decided you want to get better at your quant skills. So you started taking\r\n\r\n\r\nChelsea Wood (02:38.72)\r\nstarted working as an analyst. But quickly what came to pass was that I'm not actually an analyst, right? I'm a consultant. That's what I was trained to be. And so I was consulting with the data for the executive team and they never had that. It was typically just regurgitated information. And so they moved me into consulting position and hired an analyst to run the reports. And then I would interpret them for, you know, the 18 facilities in our, in our network. And then healthcare reform started and hospitals wanted to be acquired.\r\n\r\n\r\nNik (02:41.454)\r\nOkay.\r\n\r\n\r\nNik (02:47.512)\r\nNo.\r\n\r\n\r\nChelsea Wood (03:08.64)\r\nAnd so the CEO was like, hey, like we got to figure out if we want to buy this hospital. And so I ended up helping build out the &A division. I did that for four years, got married, had a child in that time, never saw either of them. So I resigned and went back to consulting, knowing that even if I was on the road 80 % of the time, I would still see my kids more if I or kid at the time if I was doing that, because I was working from home when I wasn't traveling.\r\n\r\n\r\nSo I did that for five years. I was the only one with an &A background. And so a lot of times I would come in after transactions and try to figure out what went well or what didn't. I do cleanup work with the exec team or the employees. But I ended up taking... So one of my first clients was really little. They had acquired seven employees. And what I realized was everything in my brain didn't apply because I brought 18 ,000 employees over in a transaction.\r\n\r\n\r\nNik (04:02.638)\r\nmy gosh.\r\n\r\n\r\nChelsea Wood (04:04.044)\r\nAnd so everything in my head was so institutional that it didn't really apply to small deals. And so I went through this program through the Alliance of &A Advisors to learn more about middle market &A. And so that's when I got certified as a certified &A advisor. That is also where I met Walker Dybul, who is the author of Buy Then Build. And he asked me fast forward five years to build the lab for him. And so by that point, I was a thought leader.\r\n\r\n\r\nI'm speaking conferences about &A and human capital. Walker was at the last conference I had to speak at before I was officially done with this role because I didn't want to travel anymore because I had a second child by this point that I was never seeing. And he asked, he's like, I have this idea for a business, but I don't have the bandwidth to do it. But you could do it. And I was like, I could do what? He's like, you could build this business for me. I was like, well, that's a hard pass. Probably doesn't have health insurance.\r\n\r\n\r\nwhich is something I needed. And so my husband actually convinced me to do it because he was in his second year of his career. He went to school late and had just graduated to be a chemist. So he's like, I can carry the health insurance since you've been doing it for this long. And if this is what you want to do, then go do it. So I left corporate America and started the lab the first week of March of 2020.\r\n\r\n\r\nNik (05:25.07)\r\nIt's a great week. Yeah, nothing was going on March 2020.\r\n\r\n\r\nChelsea Wood (05:29.022)\r\nI was literally packing my, I guess it wasn't a van at the time, whatever, my vehicle to go look, I was loading my car up to go see my dad. He's in a nursing home in Florida. And I got a call that the CDC had not locked down his nursing home. And then like immediately after that, we get an email that like kindergarten is canceled. And I like looked at my answer and I was like, we're gonna be homeless.\r\n\r\n\r\nNik (05:49.294)\r\nWhere do you live? Okay. Yeah, what was St. Louis like? I, this is like just a rabbit hole, but I lived in California and then in May or no, March of 2020, no, May, excuse me, May of 2020, we moved to Idaho. So we went from, my gosh, somebody has COVID within a quarter mile, we're all gonna die, California, to COVID?\r\n\r\n\r\nChelsea Wood (05:51.21)\r\nSt. Louis, Missouri.\r\n\r\n\r\nNik (06:16.894)\r\nNo, that's a conspiracy theory. doesn't exist. Idaho, right? was like this is like two totally opposite ends of the spectrum. What was Missouri like? I don't know. Is the other end.\r\n\r\n\r\nChelsea Wood (06:24.286)\r\nThat, it was that. Even our pediatrician was like, COVID's enough, like whatever, it's fine. I was like, okay. And I have chronic health issues, so we were very careful. And so yeah, it was challenging to say the least.\r\n\r\n\r\nNik (06:37.646)\r\nOkay, your March of 2020 you launch the acquisition lab.\r\n\r\n\r\nChelsea Wood (06:42.878)\r\nYeah. And then we went into lockdown immediately at the end of the week.\r\n\r\n\r\nNik (06:46.668)\r\nOkay, so high level, give me an idea quickly. How many people have gone through the Acquisition Lab?\r\n\r\n\r\nChelsea Wood (06:55.488)\r\nright under 800, so 770 something probably.\r\n\r\n\r\nNik (07:00.28)\r\nAnd then how many businesses, have they all bought businesses or is it like a?\r\n\r\n\r\nChelsea Wood (07:03.296)\r\nYeah, everyone - no. No, not everybody's one of us. That would be statistically a massive mistake. I think we're right under 200 closings since October 2020 was the first. Yeah.\r\n\r\n\r\nNik (07:14.498)\r\nInteresting. I've never read the ETA Bible of buy them built. I have it. I've bought it. It's here. I need to just listen to the audio book is what I really need to do. everybody in the ETA space is like, hey, I read that. Not everybody, but many people are like, I read this book and it opened my eyes and I decided this is what I wanted to do. You are interesting though, because your business is built around preparing people to buy.\r\n\r\n\r\nbut you started this business from scratch. Yeah, yeah, Like just walk me through and I don't think that's bad at all, but I am curious, what was your mentality like in March? Like how did you get to a place where you're like, okay, I'm gonna start this business from scratch, right? Cause you made the entrepreneurial leap to start this business. Like why?\r\n\r\n\r\nChelsea Wood (07:46.77)\r\nIt's a startup. There's an irony there.\r\n\r\n\r\nChelsea Wood (08:06.424)\r\nmy husband, a hundred percent. So my husband's a chemist. He is the most logical human you'll ever meet in your entire life. And I remember we were standing in the kitchen and I was like, okay, fourth option. And I said, and so I explained to him, you know, who Walker was, what the book was, what his, what he wanted me to do. And my husband looked at me he goes, okay, wait, I just need to make sure I understand correctly. And he goes.\r\n\r\n\r\nNik (08:08.568)\r\nThat's awesome.\r\n\r\n\r\nChelsea Wood (08:32.288)\r\nyou want to throw your career away, that you've killed yourself over for 15 years, when you finally have an executive offer, you want to say no. Instead, you want to go over here and you want to build a startup for a guy that you just said wrote a book telling people not to do startups because they fail. Instead, they should buy successful companies. Am I understanding correctly? And I'm like, yeah. When you say it like that, it sounds insane. And he said, I have not seen you excited about anything work related in like a decade.\r\n\r\n\r\nAnd so if this is exciting to you and you want to try it, we will figure out how to make it work. And I worked pretty high paying jobs, very high stress jobs for the duration of our marriage so that he could go through and get his bachelor's degree. Because he is the smartest human I've ever met, aside from his relatives, because they're all really smart. And he just, he dropped out because he's like, it was a waste of my time. I didn't know what I wanted to do with it. And I am dyslexic and...\r\n\r\n\r\nIt's not easy to go to school, right, for me and learn. And I managed to get my master's degree despite how hard it was. And it was just so sad to me that someone so smart wouldn't pursue something, right? And so he fell in love with chemistry and ended up studying chemistry. And so it was kind of like in his perspective, it was my turn, right? It was his turn to carry the load, you know, which just meant he sent me screenshots of his paycheck stub and the pie chart.\r\n\r\n\r\nHe's like, what am I even working for? I'm like, I don't know, love. I asked myself that a lot in my career. And so it was all him. I wouldn't have done it. I literally at the end of that conversation was like, I'll take this job. It pays well. It's got insurance. Like it'll be fine. I'm so glad I did. I can never imagine going back to corporate America now. But I also could never have imagined building and running a company either. So here I am.\r\n\r\n\r\nNik (10:23.8)\r\nThat's awesome. I think it's a testament to you need a supportive partner, spouse, if you're going to get into this world. You can't have somebody who's actively working against you or who's not supportive of you if you're going to build something.\r\n\r\n\r\nChelsea Wood (10:38.674)\r\nNo, no, we, it's part of why I don't charge double. Like we charge, the way we do partners is stupid from a business model perspective, but from an ethical perspective, we're good. but we will let and encourage spouses to go through for free. just because it's going to, it's going to allow you to be more successful if they feel like it's not happening to them. and so yeah.\r\n\r\n\r\nNik (10:53.973)\r\nthat's really cool.\r\n\r\n\r\nNik (11:00.334)\r\nHow many spouses take? Well, let me let me back up. So the acquisition lab is an accelerator to get people ready to buy their first business. Is that fair? Or by any business? OK, I think one of the things that's really interesting that you just said is. My wife and have a great relationship and she's my partner and she's involved in any decision that I make to invest. But at the same time.\r\n\r\n\r\nChelsea Wood (11:11.294)\r\nor by any business, but yeah.\r\n\r\n\r\nNik (11:27.822)\r\nShe hasn't read all the books. She hasn't done all the experience. She's never sat down with the bankers when we're talking about financing things. And so there is it's hard to get her up to speed certain times because she just doesn't have all that context. But if I was taking a course like this and she knew it was available to her, she would absolutely take it. What percentage of your members have their spouse take it? Is it like 50 % or is it like 10 %?\r\n\r\n\r\nChelsea Wood (11:54.332)\r\na lot. So like my 780 or whatever includes spouses and silent partners. So the actual buying, that's why the numbers like low to when people hear it. But I'd have to this is I don't publish like the percent of members that acquire because it would be magic math of me like backing out people. But I'd have to back out spouses and silent partners. And so I would say we have probably 450 to 500 folks that are actually buying.\r\n\r\n\r\nNik (12:10.84)\r\nRight, right.\r\n\r\n\r\nChelsea Wood (12:22.976)\r\nAnd then the rest are silent partners and or probably, probably I would say, well, let me, let me rephrase. So 300 of those would be spouses and silent partners, probably. And so probably what, yeah, I'd say, you know, 30, 30 % probably, but we have a lot of spouses buying together. Like we have a lot of spouses buying together, right? And it's beautiful when your backgrounds blend right. Perfectly compliment each other.\r\n\r\n\r\nNik (12:24.782)\r\nclose to 50%.\r\n\r\n\r\nThat's incredible.\r\n\r\n\r\nNik (12:35.982)\r\nstill. Three of 800. I mean, that's, that's, that's a, that's a big number.\r\n\r\n\r\nChelsea Wood (12:54.807)\r\nthere's really no better way to do it, right?\r\n\r\n\r\nNik (12:57.026)\r\nYeah, I was I was talking to somebody who started a community kind of like a YPO EO type of community and he was he was asking for my advice about this trip that they were planning and I was like, well are the the spouses coming? He's like no, not no, I wasn't planning on that, should I? And I was like if you want this to be sticky and if you want people to stay members, then you want to get their spouses involved because when the spouse comes out.\r\n\r\n\r\nand they're a part of the experience and they realize like, this is actually a really good thing. Then when time comes to renew, they're going to be way more supportive because they're going to have seen and experienced the value of it. Whereas if they have it, they're going to be like, well, why are you spending five, 10 grand a year? This ridiculous. What are you even getting out of this? So I think it's like it's genius to allow people, their spouses to come through because not necessarily for your business model, but for the acquirer.\r\n\r\n\r\nIt just allows them to have so much more buy -in from their spouse and so much more support. I think that's that's really freaking cool.\r\n\r\n\r\nChelsea Wood (14:00.766)\r\nmuch of what I do honestly is for the integrity of the product, but not necessarily a great, I would not recommend anyone model their business after my business model. It's not smart business, but to that account, just, I joined a network myself in, I guess last year after years of my members telling me to, and I never understood the value of community and these like basically the product I have, right. Until I joined one myself.\r\n\r\n\r\nand I took my husband on the retreat with me. And it was the first time he said he could actually see me being me, right? Like professionally, my friends don't know what I do. They've never, it's a joke. If you watch how I met your mother, like Barney, I've always been Barney. Ted personality wise, Barney, because no one ever knew what I did for a living, right? And this was the first time like he got it. And he got it so much that...\r\n\r\n\r\nNik (14:41.87)\r\nMm\r\n\r\n\r\nChelsea Wood (14:55.048)\r\nBecause it's for business owners, right? When you own your own business, there's not a lot of people to talk to, right? It can be very lonely. I just had a conversation with another business owner about this before I did this podcast. And I've been using ChatGPT a lot as a sounding board and my family thinks I'm insane or that ChatGPT is gonna take us over because I'm sharing so much information with it. But anyway, my husband, the value of this community, like it did like this pivot in his brain.\r\n\r\n\r\nRight? Where he has only seen corporate America as the path forward period. Right? Because that's kind of how we're raised. Right? And so he's been in the corporate world for like seven years now. I've been in it for, you know, 20. And I was ready to get out. Right? He's not quite ready yet, but he now sees a path to take upon exit. Right? Like, I know that him and I will acquire a company together at some point when I've put the lab to rest.\r\n\r\n\r\nNik (15:48.802)\r\nThat's awesome.\r\n\r\n\r\nChelsea Wood (15:51.932)\r\nbut it, was, it was beautiful. Like watching, especially cause this, group talks about entrepreneurship and family. So we actually started a company, my husband and I with our kids after that retreat to kind of teach them about commerce and online businesses. and it's just been a really, I don't know. I can't emphasize enough. The power of bringing your spouse along, right? On your ability to actually, this is such a stressful thing. Owning your own business is.\r\n\r\n\r\nbuying it with debt, extremely stressful, right? And if you can bring your spouse along, so it doesn't have, so it's just one way to mitigate risk, right? It's like.\r\n\r\n\r\nNik (16:32.418)\r\nYeah, because your spouse is coming along either way.\r\n\r\n\r\nChelsea Wood (16:35.242)\r\nCorrect. They can either feel like a victim or they can feel like they're driving, right? So anyway.\r\n\r\n\r\nNik (16:39.64)\r\nTotally agree. Yeah, I totally agree with that. So, all right. So I think the lab is fascinating what you do. Can you give me an idea? Like how big is your team?\r\n\r\n\r\nChelsea Wood (16:52.47)\r\nso there's\r\n\r\n\r\nI think there's 24 now supporting the lab.\r\n\r\n\r\nNik (17:01.058)\r\nAre you all remote or do you do these in person? How does it work?\r\n\r\n\r\nChelsea Wood (17:04.712)\r\nThey are all remote. So we have advisors all over the country. Our workforce is all over the globe.\r\n\r\n\r\nNik (17:12.376)\r\nWhat's the learning like? it asynchronous or is it, it's a mix.\r\n\r\n\r\nChelsea Wood (17:16.288)\r\nIt's a mix. Yeah. So the lab kind of intensive is what we call it, which is like onboarding. kind of equate it to like forklift training and manufacturing, just giving you enough to not be dangerous. And so that is we do live workshops, but we stream Walker's education because he tapped out after the 13th cohort and we're on 48 right now.\r\n\r\n\r\nNik (17:43.967)\r\ngeez, okay.\r\n\r\n\r\nChelsea Wood (17:46.068)\r\nAnd then I do a live workshop with a technical advisor or myself if I am the technical advisor. And then Thursdays we drop online content. it's a nice, no. No, I would never call the lab a course. The lab is an advisory service, right? So we have exercises that we put you through to help you figure out who you are and what you should be buying.\r\n\r\n\r\nNik (17:57.691)\r\nIs it a course? there like homework items or no?\r\n\r\n\r\nChelsea Wood (18:14.676)\r\nbut I would never call us, of course.\r\n\r\n\r\nNik (18:17.23)\r\nI didn't mean it in the like, I'm on Twitter and I'm selling a course. I meant it more of like university course, you know what I mean? Where it's like, you know, here's the syllabus, here are items that you have to fulfill.\r\n\r\n\r\nChelsea Wood (18:20.494)\r\nI'm fine.\r\n\r\n\r\nChelsea Wood (18:24.222)\r\nYeah, it's structured... yes. Yeah, it's structured a lot like an exec MBA. That's kind of how I built it.\r\n\r\n\r\nNik (18:32.225)\r\nhow long is it?\r\n\r\n\r\nChelsea Wood (18:34.922)\r\nSo the intensive is four weeks, but the advisory service is lifetime. So we will support all of the deals that you do. And I did that for two reasons. Number one, if I didn't keep my closers, then the people in the lab would just be a bunch of people that hadn't ever done it. Right? And my closers pivot towards operations upon closing, right? So they're not gonna need to renew. And I was afraid that there would be a false sense of security.\r\n\r\n\r\nNik (18:54.872)\r\nHmm. Yeah.\r\n\r\n\r\nChelsea Wood (19:04.87)\r\nonce they had done one deal that they could do the rest of them themselves. And most of them want to grow through acquisition, which is my background, right? And buying a business as an individual is vastly different than buying it as a company, right? Growth acquisition is much more nuanced. There's a lot more things that you need to be considering. And I didn't want our members to have a false sense of security and think that they can pull, it's the same. And so this allows us to support all of their transactions while keeping the integrity.\r\n\r\n\r\nright, of the lab.\r\n\r\n\r\nNik (19:35.032)\r\nWhat does, and what does support mean?\r\n\r\n\r\nChelsea Wood (19:38.528)\r\nSo we have office hours every day, twice on Tuesdays where they can call and ask an advisor a question about their deal, about their search, about the terms in an LOI or something they found in due diligence. And then we have a live deal where we call every two weeks where we'll help you structure your deal or we'll talk about your deal and thumbs up, thumbs down it.\r\n\r\n\r\nNik (19:58.572)\r\ninteresting. OK, so there's there's what you pay for the intensive. And then there's when you say lifetime membership, is that free or is that? OK, so the only only place that you're generating revenue is with the intensive. That's really interesting.\r\n\r\n\r\nChelsea Wood (20:14.974)\r\nIt's a really shitty business model. don't highly recommend it, but it works for us. It works for us. Like it's based off of like research and market research and like, it's the right path. like we acquired a company in March, so that will hopefully help balance out some of the revenue need, cause it will be on more of a recurring model, but, yeah, it's not a great model. don't highly recommend it.\r\n\r\n\r\nNik (20:39.758)\r\nWhat was the business you purchased?\r\n\r\n\r\nChelsea Wood (20:43.526)\r\nI can't talk about it\r\n\r\n\r\nNik (20:44.248)\r\nCan't talk about it. You could tell me, but then you'd have to kill me. I think one of the interesting things that you said is just because you bought a business with a corporate company doesn't mean you know how to buy a business by yourself. And that was my experience. So I started in corporate &A, tons of experience in that space. And there's a lot of things that transfer, right? Like how you negotiate or what due diligence looks like. But then there was a whole host of things that I just, didn't know. Like the purchase agreement, for example.\r\n\r\n\r\nI'd seen it, I had read it, but I had never been the one who was making indemnifications. I'd never been the one who was, you know, really concerned about the reps and warranties that a seller might be making and just understanding what that meant. The financing piece, it's so much easier when you're a corporation and you have a line of credit that you can draw on. But when you're an individual and you to go finance it and you got to go through the SBA and go through committee and give them all your financials. I mean, it's a whole it's a whole process. And on top of that.\r\n\r\n\r\nJust because you do one deal, like you said, doesn't mean you know how to do a second deal or that all deals make sense necessarily. So I like you kind of calling that out because it's not, there's no cookie cutter approach. And just cause you've it one time, you've done it one way. There's a million ways to potentially do it.\r\n\r\n\r\nChelsea Wood (21:58.804)\r\nWe have had corporate &A attorneys come through our program. Like we have a lot of our members, especially in the beginning, we have a lot of, know, Ivy league MBAs and, you know, high level degrees, engineering, engineering's our biggest, most common background. But everything is academic, right? And even due diligence, having done big deals, it looks very different when you're acquiring a large company and trying to get mom and pop shops to give you information.\r\n\r\n\r\nNik (22:02.423)\r\nWow.\r\n\r\n\r\nNik (22:27.214)\r\nMm -hmm.\r\n\r\n\r\nChelsea Wood (22:27.504)\r\nAnd there's a level of patience and grace that has to be shown to a seller to allow for a smooth transition of ownership. And so I do think that there's a lot that's different that you just don't know until you try to buy a small Main Street business.\r\n\r\n\r\nNik (22:47.662)\r\nThe first business I bought had a customer concentration issue. And like I had heard the words customer concentration, but when you're working for a big company, you're like, customer concentration doesn't really matter because we have all these other service offerings or I have all this help on marketing. I can do all these things. But when you're buying it you buy yourself and you're like, crap, 60 % of my business is with one customer. That freaks you out. And then you start need to start thinking about, does that affect the purchase price? Or like, how do I build this into the purchase agreement? And we built some mechanisms into the seller note that kind of protected us.\r\n\r\n\r\nYeah, I mean, there's just a million things that you kind of conceptually know, but it feels so much different when you're actually the one pulling the trigger and signing on the dotted line.\r\n\r\n\r\nChelsea Wood (23:26.88)\r\nWell, what you just highlighted there is one of the, so we have like a really low acceptance rate into the lab, but it's more of an invitation, right? So like, I'm not going to work with anyone that wants to use seller financing as a financing strategy, right? What you just described it, 100 % accurate, right? Seller financing is a risk mitigation strategy. You introduce it when there's risks in the deal. But if you're going into this wanting to buy a business with 100 % seller financing, you're probably making a mistake, right?\r\n\r\n\r\nNik (23:56.174)\r\nOkay, I have questions here because there are many masterminds or groups you can go pay and be a part of. like what they sell people is if the seller is not willing to do a seller note, then they don't believe in their own business and you shouldn't buy it. What do you think of that?\r\n\r\n\r\nChelsea Wood (24:17.95)\r\nThe seller isn't a seller note doesn't suggest they believe in their business. In my opinion, this is Chelsea's opinion. Nobody else is right. A seller note suggests that they believe you're not going to fuck up. sorry. You're not going to mess up their business. Right. Like, how does that? Yes. Good. They have faith in their business. But like you coming in and taking over, you could take the business. They know nothing about you. And so I don't know how people feel like that, but it's universal. It's a belief just like SDE is the universally used metric that I hate.\r\n\r\n\r\nLike it is the market, deal with it, right? To me, seller financing is messy. Like when you think about it from a psychologist perspective, the transition of leadership, if you still got a seller involved, especially if it's fully seller financed, the likelihood of you getting that seller out and not to have it all meddling in your business is pretty high. Like, or it's pretty low, right? Like they're going to be involved because you owe them a ton of money. Right? And so to me, it just, when you think about\r\n\r\n\r\nNik (25:09.058)\r\nYeah. Yeah.\r\n\r\n\r\nChelsea Wood (25:16.722)\r\nAgain, I think of everything like risk stacking, right? So like this is one of the riskiest things you could possibly do, right? Startups are risky, this is risky, it's all risky. It's just what kind of risk are you comfortable with? To me, having the seller be on the hook and actively involved in like hounding you about your decisions because you owe them a lot of money, like why does that sound appetizing to anyone? But the bigger issue as to why I have issues with it is if you don't have any money,\r\n\r\n\r\nand you're trying to buy a business with seller financing because you don't have any money, you could seriously end up in a bad situation because businesses cost money. And I love that people think that they don't, but they do. Right. And so I was talking to this lovely gentleman who called me a brick wall of reality. So, sir, if you're watching this like that, stay with me. Thank you. But he was wanting to buy a business with no money down. He had no money. And when I asked him.\r\n\r\n\r\nHey, like just out of curiosity, like how do you plan on making payroll? Like if there's a month where you can't make payroll, how do you plan on covering that? And he said, well, I'm buying a cash flowing business. Why wouldn't I be able to make payroll? And I said, noted, but cash flowing business doesn't mean consistent cash flowing business. You could still have something happen and be short on cash and you don't have any money to fall back on. And so how are you gonna make payroll? And he's like, I would just go to the bank.\r\n\r\n\r\nChelsea Wood (26:47.516)\r\nOkay, lovely plan, but the bank likely won't help you unless you have some kind of assets, right? Because you have no money. And so they're not, it's not an ATM machine that just magically puts out money with no pin, right? Like I think there is a glamorization and a simplification happening in social media about only businesses, right? And cashflow management is the number one top reason businesses fail in general, yet alone acquired businesses.\r\n\r\n\r\nAnd so if you don't have money, I don't think you should be buying a business, right? Like you could potentially harm yourself, your family, the community, the people that you're serving, the employees. Like there's a lot of potential risk there. And so.\r\n\r\n\r\nNik (27:30.702)\r\nYeah, whenever I buy a business, don't always put 20 % down. I've had deals where I put no money down and seller financing, but I always earmark at least 20 % to that business because you just never know what's going to happen. And one of the examples that I give a lot is in healthcare, for example, we don't get paid for 60 days, 45 to 60 days, depending on how good your collections are. on paper, if you double your census, and doubling your census means doubling your revenue. So you go from\r\n\r\n\r\n$100 ,000 a month to $200 ,000 a month in revenue. Well, in order to care for all those patients, you've got to hire nurses to care for those patients, right? And so what do you do? well, you staff up. Okay, cool. I've hired nurses, I've hired CNAs, I've bought supplies. Here's the problem. We grew, we doubled our census in August, let's say. Great, and I've had to hire all those nurses for August. Cool, September comes. I've got to do that again, pay for those people.\r\n\r\n\r\nI don't get paid for the services that I rendered in August until October. how, where's the money come from for me to hire all these nurses or for me, you know, for me to pay for these supplies that that conversation is always like a, yeah, that makes sense. But it's in the same as true when you purchase a business, like what do do when you purchase a business? Well, you got to bring the team in and you got to get everybody to get to know you and you've got to get them to sign up for their benefits. And like, there's a lot of admin time, even if that's 10%.\r\n\r\n\r\nChelsea Wood (28:44.041)\r\nhahahaha\r\n\r\n\r\nNik (28:58.232)\r\nThat's less time that they're in the field. Your sales are going to dip period end of story, but your costs are going to stay consistent because you've got to maintain that level of staffing. So what happens? It's the J curve. Like you take a dip and then you're able to to ramp up up later. But if you don't have a cash reserve to pull on. You're taking a big bet. Could it work? Sure, will it work? I don't know. I think the odds of it working are not great, but yeah, it's always eye opening to me to see people who are like, no, I can buy a business with zero money down. It's like yet you can.\r\n\r\n\r\nfor sure.\r\n\r\n\r\nChelsea Wood (29:28.628)\r\nYou can, you absolutely can. I just don't know that it's wise if you don't have any money to fall back on, to your point. And the other thing that people say is, well, I have working capital. Working capital burns so fast. It is almost always undervalued, right? And so we tell our members to take out lines of credit early, as soon as you can, so that you do have things. what I think people that have never owned a business don't understand is once you're in trouble, you're in trouble. No one's gonna touch you.\r\n\r\n\r\nRight? And so being able to get access to capital is really, really challenging. And again, cashflow is the biggest challenge with businesses. It's why, and we're not talking acquired, we're just talking businesses in general, right? Why they fail. And so I had a gentleman who I was talking to and he had four or five kids, $50 ,000 saved up and he was going to buy a business. No emergency savings, no nothing. Like that was his life savings and he was going to\r\n\r\n\r\nNik (30:22.414)\r\njust 50 ,000. wow.\r\n\r\n\r\nChelsea Wood (30:25.216)\r\nspend $50 ,000 on buying business. I had one, talk about small business owner problems. I had one month where I screwed up and somehow switched our tech stack. So only unqualified people got on my calendar. This was the brick wall week, by the way. And I talked to that person. I talked to this person. I talked to another person that was like, anyway, all of the people that I truly feel like are being taken advantage of by social media.\r\n\r\n\r\nIt reminds me a lot of like, I'm gonna age myself, but like the DVDs that people used to like pass around like the get rich quick scheme, right? And so I told him, I'm like, you have five kids, you have no savings. I wanna say like, I don't know, he was a single dad or something. I literally hung up my phone. It was a Friday by the time I had made, talked to him and this other woman.\r\n\r\n\r\nNik (31:00.236)\r\nYeah, yeah, yeah, yeah, yeah.\r\n\r\n\r\nChelsea Wood (31:17.118)\r\nAnd it was also Grandparents Day at my son's school. So my mom had happened to stop by after leaving the school. I literally fell in her arms sobbing.\r\n\r\n\r\nbecause I'm so sad that there are so many people that are like, yeah, I'm going all in. This is my savings and I'm going to get rich. It's like, you can't guarantee you're going to get rich. I can guarantee actually that the business is likely going to decline like you talked about. Right. And so there's so many things that I think are happening with this glamorization. Not everybody should be buying businesses. Some of you should just keep jobs. Right. The stability is there, the health insurance is there and that's okay. Right.\r\n\r\n\r\nwait until you have money saved up where you can do it in a less risky way. If you have a risk tolerance where you're able to go and do whatever the hell you want without any repercussions, then by all means, buy until you turn blue, right? Like, but it's not right for everybody, right? Like somebody said, well, how do I know if I should buy a business or not? My answer is always the same. Like if you are somebody who just figures shit out, you'll be fine.\r\n\r\n\r\nbecause you'll continue to figure shit out when it's your own business. But if you're somebody who needs someone to tell them what to do, right? Like you don't know what to do in a time of crisis or a challenge, like you're just not a problem solver and that's okay, right? Then don't buy a business because no one is going to be able to tell you what to do, you know?\r\n\r\n\r\nNik (32:39.342)\r\nYeah, I always I kind of give this analogy to people, especially when I'm talking to them about this. So they're like, well, I so and so did it. Right. I could do it. And I get this analogy. I'm like, if you go to Vegas or any casino and there's a game that you can play, let's say the odds at Blackjack are you will win 80 % of the time. But you only ever win like 5 % of your stack. There's another game.\r\n\r\n\r\nOr you could win 20 % of the time. But if you win, you could earn 200 % of your stack. Those those two are very different games and I am going to go play the game that has the higher probability of success, even if that means there's a lower risk or lower payback than the other game. Like could I win the other game? Sure, I could win 20 % of the time I could win, but why would I go and bet my life savings on a game that I?\r\n\r\n\r\ncould win or has a lower probability of success. I'm going to go play the game that has the higher probability of success because I know I'm putting everything on the line for that. And I just don't. I'm not saying that business is gambling, but there is a ton of risk involved. I think you need to get to know kind of where you are and what your level of appetite is. So I, I, this is the part I'm excited for. I created this little. I don't even know what it's called test.\r\n\r\n\r\nIt's not a test in the sense where it's like answer these questions and you'll know which Harry Potter character you are. I know I know number seven will surprise you.\r\n\r\n\r\nChelsea Wood (34:11.688)\r\nbut I really wanted to know!\r\n\r\n\r\nChelsea Wood (34:16.07)\r\nHufflepuff. I'm a Hufflepuff. I don't actually know what I am, but you know.\r\n\r\n\r\nNik (34:20.3)\r\nBut it is like a set of questions that I have that by the end of it, you should have a better idea of like yourself. And hopefully that helps you make some better decisions. So I'm gonna share it with you and I wanna get your opinion because you are way more knowledgeable than me, but I think this is a cool exercise to walk through. Let's do this.\r\n\r\n\r\nChelsea Wood (34:38.026)\r\nAll right, perfect. And I do want to say on the record while you pull this up, I am not saying don't go buy a business if you want to. We are all adults. I assume as long as you're an adult, go do whatever you want. Right. But do think about it, right. Very critically.\r\n\r\n\r\nNik (34:55.118)\r\nI totally agree. If you're going to spend this much money, actually think through the second and third order effects of your decisions. so the first thing that I always go through is your risk profile. And there's kind of two components to that. There's your family situation and then there's your personal appetite for risk. So I go down here, here are my questions. Family situation. I always like to, okay, what describes your current financial responsibilities?\r\n\r\n\r\nAnd so it's like high, moderate or low. How long can you sustain without a steady income? So it's like, okay, do you have an idea? What are your monthly living expenses? That's one thing that I think is fascinating is people who are buying businesses, it's like they don't even know what their monthly living expenses are. If you ask them, they're like, I don't know, don't know $10 ,000. It's like, okay, that's not a very.\r\n\r\n\r\nChelsea Wood (35:43.412)\r\nThis is why we have such a low acceptance rate, because this is what I go through with applicants on the phone to make sure that they can actually afford to buy a business large enough to support their standard of living in a lot of times they can't.\r\n\r\n\r\nNik (35:56.418)\r\nReally? No, no, that's a yes. Does your spouse work? And then how would you describe your spouse? This is the like, ultra supportive, supportive, realistic, not supportive. So that's like a personal situation. Here's my favorite question, though, on like your personal risk appetite. Are you ready for it? And I want your answer. Which of the following scenarios is more painful for you? missing out on an opportunity that later becomes highly successful or\r\n\r\n\r\npursuing an opportunity, failing and facing significant financial loss.\r\n\r\n\r\nChelsea Wood (36:32.377)\r\nOoh, that's interesting.\r\n\r\n\r\nChelsea Wood (36:38.26)\r\nProbably, so I am financially insecure. So I was homeless as a kid. So like, I don't do financial risk real well. So it would be B, like I will do nothing to risk my kids like their childhood.\r\n\r\n\r\nNik (36:46.136)\r\nOkay?\r\n\r\n\r\nNik (36:53.922)\r\nSee, like just knowing that about yourself, I think is very valuable. I'm A. For me, if I had the chance to invest in Facebook and I missed it, I just would never be able to get over that. It would be very hard for me to like move on.\r\n\r\n\r\nChelsea Wood (37:08.254)\r\nYeah, I don't care. I don't care. I'm like, that was a choice I made and then I move on. But like, if we ended up being homeless, I would not literally probably not survive that.\r\n\r\n\r\nNik (37:21.186)\r\nLike, and I think that, like, to me, this is such a powerful question to ask and answer of yourself is like, because because then you're then when you go into these situations, you're like, Okay, I know I need a craft. Like for you, I need to protect my downside risk, I need to make sure that I'm going in and crafting a situation where my downside risk is protected. Okay, so my second kind of, actually, I should I should go back down here. that's my available capital.\r\n\r\n\r\nChelsea Wood (37:25.53)\r\nit's beautiful. I would never have asked that.\r\n\r\n\r\nChelsea Wood (37:35.786)\r\nCorrect.\r\n\r\n\r\nChelsea Wood (37:40.736)\r\nCorrect.\r\n\r\n\r\nNik (37:51.95)\r\nSo the second piece is personality. Are you an introvert or an extrovert? Now this doesn't really like tell you whether or not you should buy a business. But the example I give is like if you're an introvert, either partner with somebody who's like really good with people or find a business that has like the sales marketing and people figured out. Because if you are an introvert and you're buying a business that is dependent on the owner to drive sales or to or to be like the salesperson, doesn't matter how good the quote unquote business model is.\r\n\r\n\r\nYou're just setting yourself up for failure. The opposite is true in my mind is like if you're an extrovert, either partner with somebody who's an introvert or find a business with somebody who can handle the operations that's consistent and not relying on you being the CEO. Like if you're an extrovert, go lean into being an extrovert. Be with people, drive sales, make the team feel good. Don't set yourself up to buy a business that needs someone who's like steady, Eddie, really good with the operations, razor thin margins, etc.\r\n\r\n\r\nChelsea Wood (38:51.338)\r\nSo this is the only one I don't agree with you on so far. I like how you framed it, but as a psychologist, one that struggles with this kind of classification, I don't love it. I think that as long as you have, so I agree with you about aligning to your value, right? Like don't buy a company that's gonna have a gap that you can't fill unless you have a partner that brings that strength to the business, which is what you're saying with the or.\r\n\r\n\r\nNik (38:54.132)\r\nOkay, tell me why.\r\n\r\n\r\nNik (39:03.554)\r\nTell me why\r\n\r\n\r\nChelsea Wood (39:21.14)\r\nRight? The struggle that I have with this is it's only relevant if you're like, I'm an extrovert that functions as an operator. Right? I could easily do this for a short period of time. Cause I have, I'm in year five of the lab. Does it suffer? Yes. Right? Should I find somebody that's a more of an, you know, data details person? Yes. I could do that.\r\n\r\n\r\nright in my own business. I don't think that saying that somebody that is an extrovert can't be detail oriented for a short period of time is a short is a shortcoming, right? Like I could easily replace myself with somebody detail oriented after six to 18 months, which is ideal for most people to buy.\r\n\r\n\r\nNik (40:05.995)\r\nI and I agree with you. It goes back to like my casino analogy. It's like, yeah, can you do it? Sure, you can do it for a short period of time. But do you want to set yourself up to have this business that you're, you know, are long term essentially responsible for? That is requiring you to fill a role that you're not necessarily excited about. So I would just\r\n\r\n\r\nChelsea Wood (40:29.322)\r\nCorrect. It's a semantics thing. I just don't like when people peg introverts and extroverts to things. There you go!\r\n\r\n\r\nNik (40:35.128)\r\nWell, I would just encourage you to find your operator. Okay. And free yourself, free yourself, Chelsea. I, I, read this Harvard study a number of years ago that, that basically took two groups. and the first group, said, focus on your weaknesses so that they can become better. And they were both sales. And the other group said, like, don't worry about your weaknesses. Just focus on what you're good at. And the other group performed better. And, and it's just stuck with me ever since. Cause I'm like,\r\n\r\n\r\nChelsea Wood (40:57.941)\r\nThank you.\r\n\r\n\r\nChelsea Wood (41:03.668)\r\nYou're actually right. Like what you have here is absolutely right, right? It's literally what we teach, right? Which is basically aligned to your value, right? I, as a psychologist, just have a semantics issue with pegging introverts and extroverts in this way, but I support you. I support you.\r\n\r\n\r\nNik (41:11.394)\r\nAnd maybe that's.\r\n\r\n\r\nNik (41:16.44)\r\nAlthough I like. Although I like your framing of it because you know, maybe I don't maybe I don't say introverts and extroverts. Maybe I just say find the business that aligns with your value, right? Like under.\r\n\r\n\r\nChelsea Wood (41:28.766)\r\nYou should read, drive and build. That's the entire premise of it.\r\n\r\n\r\nNik (41:31.414)\r\nIs it? Okay, maybe after.\r\n\r\n\r\nWell, spoiler alert!\r\n\r\n\r\nChelsea Wood (41:39.296)\r\nBut I love that you're promoting it without even trying to.\r\n\r\n\r\nNik (41:44.046)\r\nBuy them build Amazon to I'll include I'll include an affiliate link in the bio this episode. Okay, so the next area that I go to is experience and I have it broken out between like two phases there's exact experience. There's got to be a better way for me to say this but exact experience so like I'm in healthcare. I own I worked in home health and hospice and so owning a home health and hospice is like exact experience.\r\n\r\n\r\nAnd then there's analogous experience, which is, let's just say I owned a supply company within the home health and hospice space, or I owned a PT clinic. And so it's not exactly owning and operating a home health and hospice, but I have experience in that space that makes me less of a risk, right? If I decided to go buy a tech company with home health and hospice experience, there's no real analogous or exact experience in that space. So I like to focus on, what...\r\n\r\n\r\nwhere is your exact experience? And then is there anything else that you can kind of pull out from that to say is analogous in these other areas? Because when it comes to underwriting, the bank is really going to look at your experience.\r\n\r\n\r\nTell me where I missed.\r\n\r\n\r\nChelsea Wood (42:52.362)\r\nthink you did. mean, I think for me there's another one which is like, again, you read the book, and I promise this all makes sense, but transferable, right? Like if you're buying a business where you're going to be using the skills that you've used, and it's transferable the industry you're buying, then it's fine, typically for underwriters.\r\n\r\n\r\nNik (43:12.494)\r\nSo like if I managed a sales team before and my business is hyper dependent on outbound sales, but it's, you know, it's in healthcare and I, my work was in e -commerce or something like that. They're going to look at that and say, okay. Well he has experienced managing a team. That's essentially the core product or core service of this company. Therefore one more confidence. Is that what you mean? Okay.\r\n\r\n\r\nChelsea Wood (43:33.684)\r\nYeah, in that scenario though, the underwriters would need you to explain how you're going to fill the operational gap, which would likely mean you're relying on somebody that's going to stay with the business like an ops person, which you could potentially be giving them equity or something if it's that critical.\r\n\r\n\r\nNik (43:38.776)\r\nMm.\r\n\r\n\r\nNik (43:43.948)\r\nOkay, I like that.\r\n\r\n\r\nNik (43:49.31)\r\nSo then so then I go to skills, hard skills and soft skills. Hard skills will be like a technical knowledge or professional knowledge. So technical would be an engineer, software engineer. Professional would be CPA, lawyer, etc. Something you have a certificate for and then soft skills would be, you know, management. Great with people, systems guru, even temperament. Things that are not as easily quantifiable or that you can print out on a certificate and identifying kind of where you fall.\r\n\r\n\r\nin those ranges? What do think of the way I break out hard skills and soft skills?\r\n\r\n\r\nYou don't hate it. OK, I'll take it as a win.\r\n\r\n\r\nChelsea Wood (44:28.328)\r\nI was like, don't know, it seems logical.\r\n\r\n\r\nNik (44:31.118)\r\nAnd then this is my last step available capital. So this is where I say you need to have a conversation with your spouse. And you start with everything like how much money can I put it put for down payment like everything that you can. Maybe you have some assets you could sell maybe you have a 401k maybe you like who knows what it is at what can you and then you work your way back to like what am I comfortable putting down so maybe you start with I've got $200 ,000 but\r\n\r\n\r\nafter working everything out, you and your spouse are like, OK, we are OK with putting $50 ,000 down. Great. Now you have a starting number that helps you identify maybe what size of a business you can go out and get with $50 ,000. You're not going to able to buy a $5 million business, but maybe you can buy a up to a million dollar business or $750 ,000 business if you're going to stretch. And then worst case scenario planning. Basically, I say you need to mentally prepare having 20 % down at least.\r\n\r\n\r\nand then game plan what not taking a salary for six months or a year looks like. So that's my like thought exercise for available capital. I saw your face a couple times agreeing and then not agreeing. what did I miss?\r\n\r\n\r\nChelsea Wood (45:37.108)\r\nNo, I mean, I\r\n\r\n\r\nNo, I agree. I think that there's a gap that no one seems to talk about, which drives me crazy, which is number one, how much available, how much capital do you have available post close? Right? Like you have $50 ,000 saved up and you should not be putting $50 ,000 into the transaction. That's number one. Number two is how much do you have set aside for professional service fees? Right? So due diligence costs, legal fees also need to be accounted for. And so a lot of times on the strategy calls that I have with clients, I'm like, okay, so\r\n\r\n\r\nYou told me that you have $400 ,000 to put down. Does that include money for professional fees or is that out of a different bucket? Does that include the money that you would need to be relying on post -close?\r\n\r\n\r\nNik (46:24.622)\r\nThat's a good one. Definitely until you do that first deal, you don't realize how much it costs to do in particular. I Q of E and all the legal documents that you need done. Like those are two things.\r\n\r\n\r\nChelsea Wood (46:39.252)\r\nWell, and we, because of that, lot of people try to cut costs, which is why I have some ethical issues with raising my price, which I know I need to, because I fear that that just means they're going to pay less for due diligence. And that makes me nervous. And so I needed a discounted rate, with some service providers because I don't take referral fees. I don't, I, the challenge that I have with everybody in this market, I'm going through this right now with a lab member is everybody in the deal is getting, is incentivized for you to buy the business.\r\n\r\n\r\nNik (46:43.626)\r\nyou\r\n\r\n\r\nNik (46:52.632)\r\nNo.\r\n\r\n\r\nChelsea Wood (47:09.264)\r\nThe broker, the seller, the banker, the attorney, everybody wants you to close because they'll make money off of you. so I didn't want, Walker and I both did not want the lab to be that. We did not want to be incentivized for you to close so that we could be as completely unbiased as possible. Also why we don't want anything to do with your deals. And so I think it's really important to not cut costs, especially for your first deal.\r\n\r\n\r\nNik (47:11.33)\r\nYeah, yeah, yeah.\r\n\r\n\r\nNik (47:36.014)\r\nIs there a rule of thumb you have for professional services on a deal like 1 % or $50 ,000 or?\r\n\r\n\r\nChelsea Wood (47:43.664)\r\nNo, it'll vary with the severity or not severity, the complexity of the deal. so like, feel like a lot of people in this space do like financial due diligence, but not quality of earnings. and financial due diligence is more like a spot check than like a comprehensive review. and so I negotiated with a service provider to get a full Q of E done at a much, you know, significantly discounted rate so that our members would, would do it more.\r\n\r\n\r\nNik (48:08.738)\r\nWill you talk about that a little more? What is the difference between a financial due diligence and a QAV?\r\n\r\n\r\nChelsea Wood (48:14.132)\r\nSo most of the time QVLite or financial due diligence is more of like a spot check to make sure the numbers math, right? They're just checking to see if the math maths.\r\n\r\n\r\nNik (48:21.974)\r\nYeah, like I give I give the financials to my accountant and I'm like, Hey, does this work out and they look it over and they're like, yeah, bank statements match the balance sheet and yeah, yep, looks good.\r\n\r\n\r\nChelsea Wood (48:31.86)\r\nBut there's no detailed matching of inventory to payment of basically doing a, which the reason QAVs are so expensive is because they're time consuming. And this is what makes me laugh when somebody's like, I got a QAV from Bob and it was six grand. No, it wasn't. If it's a QAV, it wasn't six grand because of how much time it takes to actually do a full QAV. And I have a comparison for our members, but it's like financial due diligence is really, think about it like,\r\n\r\n\r\nlike quality control where it's like, we're going to check a 10 % sample, right? So like we take the population, we cut it down and we're like, this many is required for a representative sample. So they're going to check a few items. Whereas a QOV is a full, they're making sure that the money you're buying is actually there, right?\r\n\r\n\r\nNik (49:17.826)\r\nYeah. Yeah. One of my favorite things, at least in the QEVs I've gotten, and it might be different because I've had healthcare, but they always do an accounts receivable breakdown, especially if you're buying working capital, like if working capital is a part of the deal, because working capital isn't just cash in the bank, it's current assets minus current liabilities is your anyways, there's more complexity to it, but that's essentially what it is. And a part of current assets are your accounts receivable. And so in the quality of earnings, I'll take a look and say, Hey,\r\n\r\n\r\nYeah, there's a million dollars of accounts receivable in this business, but 80 % of that is over 180 days. Like it's it's all going to be written off. So you're sitting here thinking you've got a million dollars in accounts receivable. Really, you've only got maybe $200 ,000 that's going to come in. That significantly changes your planning for this deal to happen. So yeah, I agree with you. They're they're very different things and you need to spend money on the on QV.\r\n\r\n\r\nChelsea Wood (50:14.666)\r\nWell, the other thing that QAV is gonna do is it's gonna be more, I wanna use a word, but it's gonna be demeaning. I don't mean it that way. I'm gonna use the word intelligent, but I don't mean it to be like the other one's not intelligent, right? But yeah, they're gonna be making inferences and being like more of a thought partner on like what the financials are telling you about the business. And so if you ever see a QAV report, there's gonna be things, it's more of a, in Chelsea's opinion, go ahead.\r\n\r\n\r\nNik (50:26.872)\r\nthorough.\r\n\r\n\r\nNik (50:42.808)\r\nthink I think the word is qualitative, like, and I don't I'm not saying that, like, it is quality of earnings, like the quality of earnings is more qualitative on is, are these good, right? You take your numbers to a CPA, they're just going to tell you, yeah, the math, maths, great. But it tells you nothing about the quality of the revenue, the quality of your receivables, the quality of the inventory, the quality of how you're actually generating and collecting that revenue.\r\n\r\n\r\nChelsea Wood (50:46.494)\r\nYeah.\r\n\r\n\r\nChelsea Wood (51:08.416)\r\nWell, in the cycle of the business, like, I feel like you can learn a lot from a quality of earnings report versus just somebody checking the numbers or rebuilding the books. And again, it's not always necessary, right? If a business is pretty simple and you can check the math, then by all means, go do financial due diligence. But for the most part, I feel like, especially as you think about like some of the things you were saying, or like prepayments, for the love of God, prepayments, or just in general, right? Business is complex.\r\n\r\n\r\nAnd so it doesn't, in Chelsea's opinion, you are never going to regret spending money on due diligence, but you will absolutely regret not spending more.\r\n\r\n\r\nNik (51:49.774)\r\nYeah, you know, I've been just highlighting the revenue piece of it as well. mean, they'll they'll take a look at it. At least in my experience, they'll take a look at it and say, yeah, their margins were 18 percent, but they have all this real estate and they haven't had capital expenditures for the last two years. So actually, that needs to be recast because typically they should be spending X percent. So your EBITDA wasn't five hundred thousand. It should have been three hundred and fifty thousand because you're to have to put all this money into the business. Right. Like they also look at the liability side of things to make sure.\r\n\r\n\r\nChelsea Wood (52:00.478)\r\nThat's what I mean.\r\n\r\n\r\nChelsea Wood (52:17.952)\r\nThat's what I meant by intelligent. Like they are going to be making inferences that you may not have the knowledge base to make. And so people will say, cause most quality of earnings are 20, $25 ,000. And most people will say like that they don't want to spend that kind of money, but it's the, it's the education that allows them to make those kind of educated, you know, statements that you need to know as a business owner, right?\r\n\r\n\r\nNik (52:44.014)\r\nYeah, I'm always like you're either going to spend 25 ,000 or you're to spend 250 ,000. Which one do you want to spend? It's the 25 ,000, because if you don't do it, you're going to. There is going to be something. I promise you that there's going to be something that you get screwed on from a finite, and it's not because the owner was nefarious or they're trying to pull one over on you. It's just they've owned that business for 30 years, so they know which levers they need to pull, and they know which things are the ones that are like lead the cascading effect.\r\n\r\n\r\nOnce you buy that business, you don't know what those levers are unless you have that QAV done. And so when stuff starts to go down, you don't necessarily have that feedback loop hitting you right away and it gets out of control. And all of sudden you're you know, you're out hundreds of thousands.\r\n\r\n\r\nChelsea Wood (53:25.642)\r\nWell, let me be clear, you are always going to miss things. Like, I don't care if you spend a million dollars in due diligence, you're always going to miss something. And just to set expectations of people buying businesses, there are going to be things that don't come up in March when you were analyzing it that pop up in October and you're like, shit, this wasn't caught in due diligence. Like you should assume everyone that buys a business that you're going to miss things.\r\n\r\n\r\nNik (53:45.71)\r\nYeah. It's it's back to my casino analogy, though, like, yeah, 80 % of the time you win. And yes, there's going to be a 20 % of the time, but it's the best knowledge you have at the time in order for you to make right decisions.\r\n\r\n\r\nChelsea Wood (53:58.112)\r\nWell, and then you can fall back and say like, it's, I don't know, again, it's risk profile. Like I'm somebody that would say that it's worth it because looking back, if you miss something, you can say, okay, well, I didn't catch it. That's okay. As opposed to you didn't spend the money on the Q of E and now you're like kicking yourself in the ass saying, well, this cost me 200 grand and I probably should have just done the due diligence. You know what I mean? Like it's, a little self preservation of your mental health.\r\n\r\n\r\nNik (54:20.952)\r\nMm -hmm. Go ahead.\r\n\r\n\r\nYeah, I totally, I totally agree. And not everybody listens and they sometimes you have to go through that lesson to I'm very lucky because in the corporate company that I worked for, I came in at a time where they were writing off 10 % of their revenue to bad debt. And it was because they had done a very poor job upon transition, understanding their systems and processes, etc. And so for me, I'm like, I don't ever want to freaking mess with anything collections based, I want to know exactly where my AR is, I want to know exactly what my revenue looks like. So\r\n\r\n\r\nYeah, I'll pay the $30 ,000 for QV, but it's because I saw how bad it can be. And I think until you you can understand it conceptually, but when you have to write a $25 ,000 check, you're like, could I get away with this? I don't know if it's that bad. And I see people talking themselves out of it. And you're going to learn one way or the other.\r\n\r\n\r\nOkay, what do you think of my five areas? Am I missing anything?\r\n\r\n\r\nChelsea Wood (55:23.176)\r\nNo, seems, I mean, I'm sure you are, but it looks good. like, if I say no, and it's recorded, no, based on everything I've thought of up to this point.\r\n\r\n\r\nNik (55:31.138)\r\nDon't worry, there's no lawyer sitting here. I guess I need to read Buy Them Build at this point.\r\n\r\n\r\nChelsea Wood (55:37.17)\r\nYou do. One thing about risk though that I feel like everybody kind of underestimates is if you're buying with that, whether it's owed to a seller or it's owed to a bank, you need to really sit deep with how you're going to feel going to bed every night carrying millions of dollars over your head if you're buying a multimillion dollar company. Right? Like that can really erode certain people. Right? Some people absolutely have a visceral reaction to debt. Buying a business with that is probably not a great move for you as a human.\r\n\r\n\r\nRight? Like the worst thing you could do is buy a business and then have a heart attack. And I'm not kidding. Like it happens because of the stress of carrying that level of debt. And I want it to be clear. If you're buying a business, I don't care how mature the company is. I don't care if you're involved in operations or not. At the end of the day, everything depends on you. Whether you're doing the work or not, you own the business. The business is yours. Like you're on the hook for it. That is an enormous amount of stress, whether people want to admit to it or not.\r\n\r\n\r\nNik (56:33.698)\r\nYeah.\r\n\r\n\r\nChelsea Wood (56:34.113)\r\nAnd so I think that people need to understand their own mental health, right? Like how much can you handle? How much is that gonna impact you?\r\n\r\n\r\nNik (56:43.63)\r\nWell, it's really interesting because this is the kind of the opposite of that, but I think still illustrates the same point after I sold my company's, it was the first time I ever had money. I mean, not like first time I ever had money, but like, you know, a lot of money that I was trying to figure out what to do with. And I remember I went and got a financial advisor and was like, I, you know, I want somebody else helping me work through this stuff. And I was asking him, I'm like, Jeff, how much money should I have in cash? Like,\r\n\r\n\r\nI don't want to put it all into the market. I don't want to put it all into these investments. I want to make sure I have flexibility, blah, Tell me, what's the ratio?\" And he was like, honestly, whatever helps you and your wife sleep at night. And I've taken that advice ever since. I have probably more cash than most people would have, but it helps me sleep at night. And I think that's a very real assessment, like you're saying. You need to know whether or not you can sleep at night with millions of dollars of debt hanging over your head, because it's a very real thing.\r\n\r\n\r\nChelsea Wood (57:39.538)\r\nIt is. it's there's a lot of, like I said, I know that social media is making it seem like everybody should run out and buy a business tomorrow. but I just in my heart of hearts don't believe that that's true. Right. There are some people that your life is going to be better served as an employee and there's no shame in that. Right. Like\r\n\r\n\r\nNik (57:57.336)\r\nYeah, well, I this has been awesome. I can't believe we're coming up against an hour because that freaking flew by. Thank you. I just want to thank you for the free consulting that you gave me on my little self assessment.\r\n\r\n\r\nChelsea Wood (58:09.756)\r\nYeah, I would like you to say like created in conjunction with Chelsea Wood because she's amazing.\r\n\r\n\r\nNik (58:14.958)\r\nShe is amazing. Where's the best place for people to come find you if they want to learn more about Acquisition Lab?\r\n\r\n\r\nChelsea Wood (58:22.364)\r\nYou can find me on LinkedIn. You can find me on, honestly that's it. I was gonna say Twitter because I have a Twitter, but I don't go into it ever. So don't message me there. I won't see it. You can email me at Chelsea at buythenbill .com. Find out about our lab at acquisitionlab .com.\r\n\r\n\r\nNik (58:31.022)\r\nOkay, perfect.\r\n\r\n\r\nNik (58:40.142)\r\nOkay, this has been fantastic. Appreciate you coming on. All right, we'll talk soon.\r\n\r\n\r\nChelsea Wood (58:43.592)\r\nMy pleasure. My pleasure. soon.",
  "metadata": {
    "duration": "",
    "date": "2024-10-02",
    "platform_source": "Google Drive"
  }
}