{
  "episode_number": "73",
  "episode_title": "TOP PICK! Why I Still Keep My Job While Making $300k/Yr from My Side Hustle with Alex Lathery",
  "guest_name": "Alex Lathery",
  "business_name": "Blue Collar Builds",
  "transcript": "﻿Nik (00:01.102)\r\nAll right, and we're in. I'm here with Alex Lathery, which is awesome. Calling from Cincinnati, Ohio. Alex, how are you doing?\r\n\r\n\r\nAlex (00:10.251)\r\nI'm good man, thanks for having me on.\r\n\r\n\r\nNik (00:12.366)\r\nYeah, of course. All right, so I'm just going to jump into it in one sentence. Tell me what your business does.\r\n\r\n\r\nAlex (00:19.243)\r\nWe design and build websites for local slash small businesses. Very simple.\r\n\r\n\r\nNik (00:25.462)\r\nInteresting. How long have you been doing that?\r\n\r\n\r\nAlex (00:28.843)\r\nSo I've been doing that for basically three years, started it as just a side hobby hustle in college as I was finishing up college and quickly kind of turned that almost into full -time in my senior year because I basically had like no classes. And then from there, I've been basically building that for the last two and a half, three years, hired my dad last year. So it's not just me anymore and have been doing that. So we've done about 200 websites.\r\n\r\n\r\nNik (00:52.654)\r\nWhat? What? What does your dad do?\r\n\r\n\r\nAlex (00:58.124)\r\nSo my dad was in a past life, a police officer, and he retired early to come work with me full time. So he basically is, I have basically trained him to be another me. So I started him on just basic stuff, learning how to build websites. So I literally taught him, I built in web flow, which a lot of people probably listening know about. And I, so I taught him web flow from the ground up. I taught him my onboarding process, how I do projects, like what, what all of the start to finish everything goes. And now.\r\n\r\n\r\nMajority of what he does is that onboarding process? He does some of the development work and he does almost all of like the actual project launches So like all of the logistical stuff at the end\r\n\r\n\r\nNik (01:36.622)\r\nWhat is it like having your dad work for you?\r\n\r\n\r\nAlex (01:41.195)\r\nSo this is the one where some people, you know, it's like a hot topic. Some people are like, dude, never mix business and family. Like that would, that would never work for me and my family. And for us, it works pretty well. And I would say that it works well because we have a good relationship. Obviously that's kind of fundamental to that. And then it works well too, because we went into it with a couple of things that were already decided on or kind of agreed upon. One, if this doesn't work out, it's no big deal.\r\n\r\n\r\nthis was coming from him, I'll get another job. Like I'm going to retire anyway. In the next couple of years, this is just an early retirement. So if it doesn't work out, don't feel like, you know, you have to have that pressure on you, which was nice, obviously for me. And then the other side of it was, you know, you don't have to like be afraid to tell me things of like, if I'm doing something bad, if I'm doing something wrong, if I'm doing something, we just kind of had that open conversation about what to expect going in.\r\n\r\n\r\nNik (02:32.814)\r\nYeah.\r\n\r\n\r\nAlex (02:39.211)\r\nAnd then we also have a good relationship, like I said, so I know that one, I can trust him. A lot of people say that they couldn't do business with family, but when I think about doing business with anybody, especially like someone that's almost to the point of like a business partner, I don't know how I could do it with somebody that wasn't family or somebody that I really, really trusted without a lot of red tape, right? Contracts, tons of stuff.\r\n\r\n\r\nNik (03:00.96)\r\nIt's okay. So it's interesting. Interesting though. He's not only your dad, he's a cop. Was that like, I don't know. I maybe I would have been like too intimidated by my dad, but was there any problem with that transition?\r\n\r\n\r\nAlex (03:05.867)\r\nYeah.\r\n\r\n\r\nAlex (03:14.731)\r\nNo, because if you, if you don't know him, you're probably like, okay, this guy's a little like intimidating, maybe rough around the edges, but I see like a totally different side of him. And especially like, honestly, after retirement, you know, you spend 20 years, 25 years as a cop in a city, a big city, you see a lot of stuff and you deal with a lot of people. Once you're out of that, it's like a big switch, like.\r\n\r\n\r\nNik (03:23.406)\r\nYeah.\r\n\r\n\r\nAlex (03:42.667)\r\nEvery day, I mean, you gotta think about it every day you're waking up and typically, unless you're helping somebody, like somebody got in an accident, you're helping them, somebody, you know, there's, there's like two modes of that job. You're helping somebody or you're arresting or ticketing or something that somebody doesn't like. And so most of the time you're dealing with people that don't like you. And so that weighs on you. And that is kind of like every day that it does impact your mood. And so in retirement, it's a way different story. Like.\r\n\r\n\r\nEverything is bliss. Everything is joyful, especially I mean, he works for boat and he works he works for me is very chill is very flexible in that sense. He lives. So he was basically like 1015 minutes away from me. We live about 20 minutes outside of Cincinnati, technically. So yeah.\r\n\r\n\r\nNik (04:14.51)\r\nYeah.\r\n\r\n\r\nNik (04:18.606)\r\nWhere does he live?\r\n\r\n\r\nNik (04:24.27)\r\nokay. All right.\r\n\r\n\r\nNik (04:28.238)\r\nThat's rad, man. Congratulations. Yeah. All right. So how did you first get into web design? Like, was it a hobby in college that you were developing?\r\n\r\n\r\nAlex (04:37.675)\r\nSo yeah, so, so basically it started like this. I was always studying to be an engineer. I was a mechanical engineering student. And when you're studying mechanical engineering, you kind of have a couple of different things you can do. So you can go work on cars. I'm not a car guy. I did not want to do that. You can go work on planes. I love planes, but I don't know something about like doing aerospace. I just, I didn't really catch my eye that much. The other thing that you can do,\r\n\r\n\r\nNik (04:54.958)\r\nMm -hmm.\r\n\r\n\r\nAlex (05:07.499)\r\nIf you're from Cincinnati is you can go work at Procter and Gamble or GE and any of like those big kind of corporations that are in this area. And so I kind of looked at that and I said, I like consumer goods. I think P &G is a cool company. So I think I want to work there. So I had decided that basically in high school went in and then did in college mechanical engineering, because what major did I want to do that fit with that?\r\n\r\n\r\nAnd it was kind of like the most general purpose. You have the most flexibility. You can go work on cars. You can go work on planes. You can go work on diapers or toothpaste. So I did that and started with that. Really liked it. Worked at kind of like a contracting engineering firm as like my first co -op. Ended up getting into Procter & Gamble and did some internships in there. And then in 2020, COVID happened. Everything went remote. So I was doing the end of my internship remote.\r\n\r\n\r\nI was heading into a school semester, fully remote and had a lot of time on my hands because you couldn't go out and do anything. And so I was like, well, I've always wanted to learn to program a little bit. I kind of have done just like bits and pieces here and there wanted to like actually develop it as a real skill that I had. So I started to learn that and I started to do data science and I did data science because I figured I've got this mechanical background. If I learn like data science, that's a really good pairing.\r\n\r\n\r\nNik (06:23.854)\r\nMm.\r\n\r\n\r\nAlex (06:31.083)\r\nwill help me get the full -time job offer. So I started doing that and I hit after like one week. I'm like, I cannot sit here and practice data science programming on fake data. I just couldn't do it. I'm like one of those people that I feel like what I'm doing has to feel like it has a purpose or like it's meaningful. And that did not feel like it for me. So I quit that and I said, I still want to learn to code. I still got this time. I'm going to learn web development.\r\n\r\n\r\nbecause I can always build a website, right? There's always like, I can just go and make one. It's like a creative idea. It's a little bit more fun than just like, let me just crunch these numbers. Never. Never had no, no experience with it whatsoever. So.\r\n\r\n\r\nNik (07:07.726)\r\nHad you built a website before or were you like never?\r\n\r\n\r\nNik (07:15.566)\r\nDid you take a course or did you just start like doing research on, you know, Google and YouTube? What was your learning process?\r\n\r\n\r\nAlex (07:21.803)\r\nSo I pretty much, I pretty much took a course to really get started. It's called the Odin project. It's out there. It's free and it's super good. No, no, no, no, no self study, all self study. The things I, things I was learning in the classroom, fluid dynamics, strength of materials, mechanics, all kinds of physics stuff. And then outside, I like leave class and I'm going and I'm like learning how to program websites. And so I took this free online course.\r\n\r\n\r\nNik (07:30.254)\r\nbut not a university course. This is like outside of the university. Okay. Okay.\r\n\r\n\r\nAlex (07:51.851)\r\ncalled the Odin project. I went through that, learned like the basics of HTML, CSS, some JavaScript stuff, all website stuff. And that took me about two to three months to like practice that stuff, made a couple of practice projects. And then I kind of had like a pivotal moment where I was in an internship and the way that the hiring pool worked for that company was you have like this board of experts that basically watches your midterm presentation and watches a final presentation.\r\n\r\n\r\nAnd they obviously probably, yes, yes. So they, they kind of judge you based off of your performance in the assignment, you know, talking to your manager, I'm sure they do that a little bit here and there, but they also really judge you based on those presentations. And so they, they, they take your presentations, they watch yours, they watch 20 other interns across, you know, a couple of different business units. And then from that, they will say whether or not you meet the bar for technical rigor.\r\n\r\n\r\nNik (08:22.574)\r\nWas this Procter & Gamble? Okay.\r\n\r\n\r\nAlex (08:51.115)\r\ncommunication abilities, tons of different things that they grade you on. Basically, are you of a caliber that we would hire you in the R &D community? I was working in R &D. And so I was doing great. I mean, I had done great in the past two internships. This was my third one and final one. I was vying for the full -time offer. And so basically got told, and whether this was like an influencing tactic or was pretty legit, you know, hey, there's like two full -time spots open and there's like 10 of you guys that are vying for it. And it's very competitive.\r\n\r\n\r\nAnd you're going to have to really convince like this one guy that you belong. Cause a lot of the other people there, they're already kind of giving you the thumbs up. And, and so when I heard that and I had basically done everything that I could have done or done the best that I had done in the internships, I had no negative feedback, all above positive meets expectations, exceeded expectations. But there's like one dude who had not seen my work and wanted to see like,\r\n\r\n\r\nyou know, minor detail, something he was just being picky about, and was kind of dangling over my head. Like, are you going to get this job? Are you not going to get this job? And that really, really set me off because I had never had it to where I felt like, like all this stuff I had wanted to work there since I was in high school and everything aligned perfectly. I knocked the internships out of the park and then\r\n\r\n\r\nNik (10:09.746)\r\nmy goodness.\r\n\r\n\r\nAlex (10:13.899)\r\nthat happened. And so I was, it really kind of was the first lesson for me of like, I never want to feel like I'm backed into a corner with no other options. And so, yeah. Yep.\r\n\r\n\r\nNik (10:21.55)\r\nSo let me reframe it. So you're going to college, you're studying engineering, you get your dream internship at Procter and Gamble, you're doing well, you've done, this is now your third internship, you're basically at the point whether or not you're gonna find out, whether or not you're gonna get hired. Concurrently, you just decided, I wanna learn how to build a website. Was it a curiosity for you or was it like,\r\n\r\n\r\nI might. This might be a side hustle. Like, did you think of it in terms of it might be a business?\r\n\r\n\r\nAlex (10:52.683)\r\nNo, no, it was a hundred percent just curiosity. I just love learning. I kind of have that tinkering like mindset and attitude. And I was like, when I kind of thought about it, I was like, well, I just want to learn to code just because I just want to learn to code. I don't know what about it. I just wanted to do it. And I rationalized the use of my time because I was like, well, well, you know, like I've also always wanted to start a business. I had listened to like the sweaty startup podcasts and like,\r\n\r\n\r\nNik (10:56.846)\r\nOkay.\r\n\r\n\r\nAlex (11:20.235)\r\ndreamed of starting a business at some point, but never really like cared to take any action on it. So I was like, well, you know, I could also maybe make this new business one day or whatever. So I just was doing it. And then, yeah, I just, I just started taking the courses and I just liked it honestly more than I had ever liked it.\r\n\r\n\r\nNik (11:34.83)\r\nBut you did have an entrepreneurial interest. You've been interested. Okay.\r\n\r\n\r\nAlex (11:38.795)\r\nYes. I had an interest with it, but it was only like from a one -trepreneur type of standpoint, right? Like I would sit there in high school or I would sit there in college and I would listen to the sweaty startup podcast is the one that always comes to mind. And he's talking about, you know, this guy just, you know, went out there and started a custom closet remodeling or manufacturing thing and he's doing crazy numbers. And I was like, that'd be so cool. And then every now and then.\r\n\r\n\r\nNik (11:45.358)\r\nNo, no, yeah.\r\n\r\n\r\nAlex (12:05.259)\r\nYou know, I would get this crazy idea. I would throw it in my notes app on my phone. And then the next day I'm like, that idea sucks. It's probably not going to go anywhere. And I would just ignore it. And I would be fine with my day until I heard another podcast that gave me an idea. And then I shut that idea down. And it just was a cycle for four years. I never really actually started anything because all of my intention was really focused on, I want to get this job and I want to get this internship.\r\n\r\n\r\nNik (12:30.35)\r\nAll right, so you're told by this guy basically, hey, do you want this internship or not? And it just set off in your mind this feeling of, I don't want to be told what to do. I don't want to have somebody else controlling my destiny. What happened next?\r\n\r\n\r\nAlex (12:42.283)\r\nI don't want to have someone else control my destiny. That's 100 % what it was. So what happened next was I was like, well, you know what? I've been learning to program websites. I'm going to turn it into a business. And so there's two routes that you can kind of take with that to make money doing web development. You can become a programmer. And I kind of sat there and thought about what that would look like for me. And so I could spend five years really learning that probably get a job that pays basically what I was going to get paid. If I got any really good full -time job as a mechanical engineer.\r\n\r\n\r\nAnd I would probably be like very average after five years. Maybe, maybe, maybe really good, but you know, it depends on how much I was studying it and if it was like my main thing or start building websites for people, for clients, for businesses. And that can make me money that I can do a lot faster. Right. I just, I'm not, I'm not doing this programming. I don't need to keep learning this stuff. I have the fundamentals just switched to something like WordPress.\r\n\r\n\r\nWebflow, Squarespace, whatever, pick a builder. And I'm just going to start trying to actually sell these and make money. And I figured that that was kind of the better route to go because I had literally done four and a half years in school to become an engineer and felt really just stupid to like say, I'm not going to use that at all. Why not build a secondary option that is I can make money basically now with. So I decided to do that.\r\n\r\n\r\nNik (14:08.11)\r\nSo you got the job at Procter & Gamble?\r\n\r\n\r\nAlex (14:10.219)\r\nI did. Yeah, I got the job. Yep.\r\n\r\n\r\nNik (14:12.014)\r\nand you worked there for a little bit or no?\r\n\r\n\r\nAlex (14:14.059)\r\nI actually believe it or not, I still work there. I don't talk about it all the time on Twitter. I still work there. I do both.\r\n\r\n\r\nNik (14:16.302)\r\nYou still work there?\r\n\r\n\r\nmy goodness, that's awesome, man.\r\n\r\n\r\nAlex (14:21.579)\r\nSo that's always a shocker for people.\r\n\r\n\r\nNik (14:24.749)\r\nThat okay, that well, yeah, I was I was thinking you're setting the story up to say like, I flipped him the bird and went out on my own. No, he's incredible.\r\n\r\n\r\nAlex (14:31.147)\r\nNope. No. So, so there's a couple of reasons that I never did that. And this is always the one that people have very polarized opinions on. I've talked to people that maybe were more like me and they're like, dude, that's the best way to go. And then I've talked to other people who are so like big risk takers and they're like, man, burn the bridges. Like, why would you ever take that job? Like you, you already got the entrepreneurial bug. You're on that path. Like just.\r\n\r\n\r\nJust go, man. And basically for me, I struggled a lot with that decision actually, like for like six months every day, I would sit there and I would think about it and I would just have like existential dread because at that time I basically got the job offer at the end of that summer. And I had just started this thing as a business. I was making $0 basically just decided I was going to try to make money with it. So of course I got the offer. Of course I accepted the job.\r\n\r\n\r\nI then spent the next six months when I was going back to school and I really didn't have that much of a course load because it's my senior year trying to turn this into a business for four to five months. Almost nothing happened. I probably made in total, maybe $2 ,000. And that was like just enough to cover some software expenses, basic stuff. I did tons of projects for free. I did tons of projects for like a hundred bucks, 200 bucks, 300 bucks for a full website.\r\n\r\n\r\nAnd then I was growing on Twitter at the time, very slowly. I was just tweeting out what I was doing and tweeting out some of my work ended up getting connected to Johnny Robinson, who runs home service Academy. He was running orange window cleaning, a window cleaning company back at the time. I was about to launch a house cleaning business. So he was like, Hey man, he sent me a DM out of nowhere. I still have the DM. And he was like, Hey man, I want to talk about this website stuff that you're doing. Like.\r\n\r\n\r\nWe're launching a new business. Just want to talk about it. And then that ended up spurring a relationship that like we still work together. I do a lot of the work on their their home service Academy stuff. But from that, really my first big client, he had a following at the time. So he kind of shouted me out. He's like, this guy does great work. He built our website. And that like exploded my business. So I had that big breakthrough. And then I also hired a business coach who was also Johnny's business coach at the time. And he kind of taught me.\r\n\r\n\r\nNik (16:55.182)\r\nInteresting.\r\n\r\n\r\nAlex (16:58.155)\r\nsome of the stuff that I just really needed to know to run an agency. I had zero sales skills. I did not know how to like price anything. I did not know how to make an offer. I would literally sit on the phone with you and I would be like, like, what do you want? And then I would basically wait for the prospect to tell me exactly what they wanted. And then I would kind of like guess out a price.\r\n\r\n\r\nYou know, like, okay, I'll do that for like $600. And then they would, you know, and then I'll get ghosted and I had no sales skills. So I hired the coach and, those two things in combination exploded things. And so I went from in November, I sold a website for like $250 to in December, sold my first website for five figures is 1600 bucks. And then in January, I went from that. So.\r\n\r\n\r\ntotal money I had made up to that point ever in this business was like maybe like $2 ,000, maybe 3 ,500 after that December project. In January, I hit roughly $20 ,000 and I did not know what was going on. I did not know what to do with myself. I had never seen a number that big in my entire life. I literally remember looking at the Stripe dashboard and the number was just going up and it was going up and it was going up.\r\n\r\n\r\nIt was going up and I was like, holy crap, this is unbelievable. This is like four or five X what I was going to make as a starting engineer in one month. So my mind was blown. I had no idea what to do. Fast forward. I'm like, this is just one month. This could be a total fluke. I'm not calling it quits on something that I've worked for five years to get for a one month fluke. Second month comes by. I do it again. Maybe not exactly 20, but it was, it was high. It was.\r\n\r\n\r\nway multiples of what I was going to make as a full -timer. All from Twitter, Twitter and referrals, Twitter and referrals. And then month three happens, happens again, but I still keep telling myself that this could be just a fluke. It's still really risky. And then at that time I was like two or three months out from actually starting the job. And I love the guys that I work with at my job. I have a lot of loyalty to my specific mentor who like,\r\n\r\n\r\nNik (18:49.582)\r\nAnd these are all Twitter. This is all Twitter business.\r\n\r\n\r\ncrazy.\r\n\r\n\r\nAlex (19:15.659)\r\nintern for, I entered for him every single time. He taught me like tons of stuff that I knew. He really stuck his neck out for me personally. And I had a lot of loyalty for him for that. And I did not feel right. Just kind of calling it quits like last minute. And I also sat there and said to myself, you know, I'm, I'm 23 or 24 years old at the time. Like I've got a lot of energy. I got a lot of time. I don't have kids and I can do this. And I'm a, I'm an early riser. I wake up at 4 a I hit the gym or I hit work. So I was like,\r\n\r\n\r\nI can do this. And it really forced me to get serious about the business itself. I couldn't just sit there, you know, during the day and kind of just mess around, forced me to get really serious about that. And it forced me to really kind of make it a business and not just make it like, I'm just freelancing and you know, doing things here and doing things there. And I did that for the next two and a half, three years now. And like I said, I brought my dad in last year, which has helped a lot with my personal workload.\r\n\r\n\r\nNik (20:06.094)\r\namazing.\r\n\r\n\r\nNik (20:12.782)\r\nYeah. Talk about your current team. So is this you and your dad or?\r\n\r\n\r\nAlex (20:14.891)\r\nBut that's what it is.\r\n\r\n\r\nSo me and my dad occasionally work with a couple of contractors, but my dad and I handle most of the projects, especially onboarding, especially development. Sometimes what like outsource, I don't do a lot of logo design. I'm not that good at it. But we are, go ahead.\r\n\r\n\r\nNik (20:30.542)\r\nWhere are you getting clients from?\r\n\r\n\r\nAlex (20:34.539)\r\nActually, believe it or not, it's bad to still say this. I get the vast majority from Twitter and referrals still. I would say 80 % from Twitter, 20 to 30 % from referrals. And that's it. I have, I've literally taken the approach of like, I'm going to stick to one channel and I'm going to master that channel. And it has been everything that I have needed. I haven't had any need and I haven't actually really had the time or capacity to go like explode into all these other channels. Cause I just don't have time.\r\n\r\n\r\nSo.\r\n\r\n\r\nNik (21:04.622)\r\nOkay, so you've built this business over the last three years. You and your dad, sometimes with some contractors, tell me how big is the business? What are you doing on a monthly basis?\r\n\r\n\r\nAlex (21:12.843)\r\nYeah. So the business does between 200 and 300 K a year in revenue. And that's all on one -off design and development website projects. So no recurring. I have a very, very cheap, like support package where you can get like an hour or so of edits every single month. And that's, that's it. And that gives me about four to $5 ,000 a month in revenue. Not all that's profit. There's some hosting costs in there and then obviously any labor costs, but 90 % of it, it's all one -off projects and that\r\n\r\n\r\nNik (21:20.398)\r\nthere's no recurring.\r\n\r\n\r\nAlex (21:42.795)\r\nI have been able to actually maintain that for three years, which is kind of crazy. Only so only now basically I am basically kind of hitting that realization like I've been doing this for three years. Might be nice to have some recurring base in there.\r\n\r\n\r\nNik (21:47.982)\r\nSo how many hours a week do you spend?\r\n\r\n\r\nNik (21:59.438)\r\nHow many hours a week do you spend on this business right now?\r\n\r\n\r\nAlex (22:02.187)\r\nI probably spend basically I'll wake up at 4 a I'll probably spend the next three hours on it. And then I sometimes take calls like in the afternoons, the evenings, and that is probably all in all in a week, I probably spend 15 to 20 hours.\r\n\r\n\r\nNik (22:20.782)\r\non a per hour basis, where do you make more money?\r\n\r\n\r\nAlex (22:24.491)\r\nI on a per hour basis definitely make more money in the business.\r\n\r\n\r\nNik (22:28.046)\r\nWhy the freak are you still working at Procter & Gamble?\r\n\r\n\r\nAlex (22:31.595)\r\nSo I still do it for a couple of reasons. One, it has always given me the flexibility to try things in the business that I otherwise would not have had the ability to do. So I wanted to try and expand into like a lead generation arm. So rank and rent, if you've ever heard of rank and rent, like local SEO. And so rank and rent is basically, you know, all of these guys, especially on like Twitter, like\r\n\r\n\r\nNik (22:53.614)\r\nNo, I don't know what that is. Tell me what that is.\r\n\r\n\r\nAlex (23:00.395)\r\nAnd actually you guys do this, you have a tree service business, right? So you guys do all the marketing and you sub out all the work. I basically take that one step further. I do all the marketing and I have a phone number on that website and it goes to the subcontractors and they do all of the quoting, selling everything. And they just pay me because I have leads coming in the door and it's on paper, the most perfect business model that exists on the internet. Like it literally is, I mean,\r\n\r\n\r\nNik (23:03.598)\r\nMm -hmm. Yeah.\r\n\r\n\r\nNik (23:22.574)\r\nReally.\r\n\r\n\r\nAlex (23:29.611)\r\nWhen you hear people talk about it, especially people that sell courses on it, it's like completely passive. All you do is throw up a website. You're selling leads. And if you're a guy like me, you've got that background, you sell, you know, you do SEO, you do web design, like that's my bread and butter. And if I can throw something up, I can rank it. It gets organic leads or I run paid ads to it and it gets enough leads from that. I just basically partner up with a business owner. I will give you all of these leads exclusive. It's better than Google. It's better than.\r\n\r\n\r\nNik (23:34.862)\r\nYou're selling leads.\r\n\r\n\r\nAlex (23:58.699)\r\nAngie's list or whatever you guys have going on because it's fully exclusive and the cost per lead generally works out to be less. We're not also farming your leads out to seven different people so that you're competing on price. And it's if you can strike a deal, you then just get basically 600 to 1200 bucks a month depends on your lead volume and depends on the industry. And it is almost entirely passive. Now, it's way harder to land a deal than that sounds on paper. That's where the crux of it is.\r\n\r\n\r\nNik (24:12.366)\r\nYeah.\r\n\r\n\r\nNik (24:21.774)\r\nSo.\r\n\r\n\r\nNik (24:26.638)\r\nSure, that's where the rub is.\r\n\r\n\r\nAlex (24:28.683)\r\nSo to tie this back in doing things like that, I spent a decent amount of money on that and learning that and failing at Google ads and failing at learning. Like I launched three or four locations that just totally crashed and burned or awful, just a money pit. And if I was only doing the website business, that puts a lot more risk on my shoulders for one, just personal income for my family. So we just had a, we just had a kid, our kids like three months old. We just bought a house as well.\r\n\r\n\r\nNik (24:57.166)\r\nCongratulations. Yeah.\r\n\r\n\r\nAlex (24:58.955)\r\nAnd so my wife is stay at home. She stays home. She raises our kid. And so from a risk standpoint, I would have to basically have taken my agency and I would have had to follow this very traditional agency framework. Let's add on pay per click. Let's add on SEO. We'll just go and we try to stack as many monthly retainers as we can. And I grow into a stereotypical digital marketing agency. And I never really just, I just never really wanted to do that. I've always wanted to do things my way.\r\n\r\n\r\nEven if my way is maybe not the most business savvy right in the here and now, and it's not like the quickest way to money, I've always enjoyed having a very risk mitigation approach. Let me sit back. Let me learn a lot of things. Cause I also feel like I'm only 24 years old. I I'm really not like the business guru out there. Some of the guys have a lot of like, you know, ego and they're very much like, I'm just, you know, a hundred K months or I'm, or I'm dying. And I've always been on the opposite side of that.\r\n\r\n\r\nvery low in terms of like my lifestyle creep. I don't spend a lot of money on things. I do this because it's fun and I don't like to have that risk level so high. and you've, you sacrificed some reward for that, but you also get to sit back and you can kind of use this as an experiment for yourself. So I'm learning, I'm doing this web design stuff, but that doesn't have to be what I always do. I've got options. And for me, it was always about keeping the options in play, keeping my family provided for.\r\n\r\n\r\nNik (26:07.342)\r\nIt's interesting.\r\n\r\n\r\nAlex (26:25.771)\r\nAnd for me to learn what I wanted to learn. So that's kind of one piece of it is I can go and try things with my business, fail at them, succeed at some. And then at some point, probably hit what I really want to hit and scale that model. And then on the other side, it was, you know, I had invested a lot of time and energy into like wanting to get this job and wanting to see what that had for me. And if I had gotten a job that I did not like, I would have been out as soon as I made any money from this business.\r\n\r\n\r\nI love what I do on that job side. There's some things that like I have done that most people don't get to do. Like they never get to experience. I will have patents when I'm, you know, in six years when they clear the legal system. I think that's just a cool life experience. I've gotten to work on equipment and product designs that are just super fascinating to me. And so I've always liked that experience in that side of it. And I've also, I feel like learned and developed a lot personally from having that.\r\n\r\n\r\nexperience versus if I was just in this business, just doing websites, it has kind of broadened my exposure to everything. And always I have taken this attitude as well. Like people say you learn in your twenties, you earn in your thirties and your forties and your legacies and your, you know, forties or fifties and beyond. And I have taken that approach. So I've gotten exposure on massive corporate engineering, R and D super technical, super structured.\r\n\r\n\r\nsuper dialed in on every minor little detail. I've been in that world. I've been in the small business world where I have literally not even looked at what the details of this sales call is going to be. And I hop on with like two minutes ago, I just walked in the door and I'm selling something to somebody and I'm just pulling stuff from behind my ear. And I like to have the exposure to everything. And it, for me, feel like it has developed me in a much different way than\r\n\r\n\r\npeople that just go all in on one path. It kind of has diversified me, if that makes sense.\r\n\r\n\r\nNik (28:26.574)\r\nNo, yeah, it makes total sense. I'm just looking at it from the perspective of if for 20 hours a week, you're generating 200, 250 ,000 a year, you literally could double that. You're not going to any other channels besides Twitter. You're not necessarily trying to grow the business exceptionally hard. So there's a lot of opportunity within the business. But I get it. I get your approach. You're trying to learn as much as you can. It may not be what everybody would do, but it's a really, really...\r\n\r\n\r\nAlex (28:35.787)\r\nYeah.\r\n\r\n\r\nNik (28:56.43)\r\nreally cool strategy. All right, I got some rapid fire questions for you. You ready? What do you love about this business?\r\n\r\n\r\nAlex (28:59.403)\r\nGo for it. Yep.\r\n\r\n\r\nAlex (29:05.003)\r\nWhat do I love about this business? I honestly just like getting to work with the other small business centers a lot. I like that because, you know, there's like two ways that you can kind of target people from like a creative agency side. You can work with like startups, you can work with corporations. And at that level, you're working usually with a group of people and they're usually like W2 type of people. Like they have some stake in it, but it's not theirs unless you're working with like a startup founder, but\r\n\r\n\r\nNik (29:06.742)\r\nMm -hmm.\r\n\r\n\r\nNik (29:27.342)\r\nMm -hmm.\r\n\r\n\r\nAlex (29:33.291)\r\nYou're working with a group of people. It's usually not as like personal and it's usually a little bit more formal in the engagement. You're working with small business owners and they started that business. It's like their baby. And that's how I felt about my agency. I really get along with that type of people and that type of person. So I really like getting to work with support and kind of just interface with those types of guys and girls. That's kind of one, one arm of it.\r\n\r\n\r\nThe other thing that I really like about the website side of things is that, like I said, I'm an engineer, I'm a tinkerer, I'm a craftsman, if you would say that. And I just really like getting to constantly improve on something versus some of the other types of agencies you can run. I'm just running Google ads. You know, we're trying to hit metrics. We're doing this. Web design is a little different in the sense that like every project's like, let's push the needle on this project. I want this project to be something we've never done before. Crazy new idea, crazy big. And.\r\n\r\n\r\nIt's also where you can really work on that craftsmanship, like perfecting some of the small details. And I have always enjoyed having that as part of it. That's also one of the things that I don't like about the business. So it's a double edged sword.\r\n\r\n\r\nNik (30:41.71)\r\nYeah, so that's what I was gonna ask. What do you hate about the business?\r\n\r\n\r\nAlex (30:45.515)\r\nThe thing that I hate about the business is sometimes you do that, you feel like it's perfect, you know that it's the best thing to do from a strategy standpoint, and you have somebody that just does not wanna do it. I've had projects where we've done a logo for them or we've done the website for them, and we delivered something that 75 % of the people out there would say, this is phenomenal, it's better than anything else you'd see out there, but they had a very specific idea of what they wanted in their head and whether it wasn't communicated.\r\n\r\n\r\nor we just didn't do a good enough job of teasing that out of them. We then go in a process of here's what we delivered. Let's destroy every inch of it into something that at least in my opinion is far inferior. And I, because it's a client -based thing, that's what they want. That's what we'll deliver to them. But it always kind of hurts your heart a little bit when you make something that is like a quality and they just like whittle it down to like a C or a D and you still got to send it and you got to put.\r\n\r\n\r\nYou know, sometimes I don't actually put my name on that, right? Like a lot of times web designers will put their names in the bottom of the website. If it's like that, sometimes I just won't do it.\r\n\r\n\r\nNik (31:54.222)\r\nAll right, what business or industry are you most jealous of right now?\r\n\r\n\r\nAlex (31:59.019)\r\nSo I am honestly the most jealous of the rank and rank guys who've been doing it for longer than I have. So I'm in this industry. Yeah. Local SEO, lead gen, purely generation. So I started doing this this year. Google has changed a lot in the last couple of years. I mean, they change all the time, but they have really, really changed a lot since the advent of like local service ads, since the advent of all this AI stuff. Like there's so many things that have changed.\r\n\r\n\r\nNik (32:07.118)\r\nRank and rent, okay?\r\n\r\n\r\nAlex (32:28.395)\r\nAnd things are way more competitive. If you look at any of the guys that are like selling courses on rank and rent, if you look at any of the guys that have done it for like five or more years, five years ago, you could go into a market, throw up a very, very simple, very basic page and rank it in three months. And whether that's with concrete fencing, whatever, it really didn't take that much skill. You could just throw it up. You have a very basic due diligence process.\r\n\r\n\r\nAnd you can rinse and repeat this. And I am trying to do that model now in 2024. It is a lot more competitive. So to give you perspective, I have one site that I have a partnership with and that partnership is for 600 bucks a month. And that is for a fencing niche profit on that. It's basically 95%. I pay like 18 bucks a month for hosting. I pay like $2 for a tracking number. So I get $575 a month.\r\n\r\n\r\nAnd I really don't do anything to the website. I kind of talk to the business center here and there. Hey, did you close any leads? Things like that. Everything is automated. We send him all the leads automated. He gets a monthly report that's automated of how many calls he had, the call duration, all the stats. So it's almost pure profit. And to get to that one successful location, I had to learn and fail a lot. So I had to try three different locations that completely crashed and burned because there wasn't enough search volume.\r\n\r\n\r\nor the ad costs were too high. Canceled those, lost a couple of thousand dollars in those. Then really dialed in my due diligence process. I was like, I need to be better at picking a location. So I went through and I had a VA basically sort through, he's at 540 cities in the US that we have gone through and we have searched search volumes for on Ahrefs. Just to find 10 potentially viable locations, 10.\r\n\r\n\r\nNik (34:15.694)\r\nWhoa.\r\n\r\n\r\nAlex (34:23.051)\r\nthat had the search volume that fit my criteria of those 10, two of them were really, really good opportunities, like no brainers. I'm going in it. And I kind of go through another level or two of actual due diligence. Is there businesses in the area that actually look like they're legit and I can partner with, because if there's nobody that's good to partner with, you're wasting your time, even if there is search volume. So after all those levels of due diligence, 540 down to one website, and then you launched the one website.\r\n\r\n\r\nNow you gotta go and actually get enough leads to start talking to a business owner. And then after you do that, you have to close the business owner. So you go from 540 down to one or two that are really good. And then you still gotta get those one or two in a place where they're generating enough leads that you can go and basically strike a deal with a business owner. And you still have to get a business owner that's not gonna flake on you. So in the first location that we had,\r\n\r\n\r\nWe had two business owners. We got all the way through. We had sent them like three or four free projects each and they just ghosted. And so all of that pain just to get to the one deal and that guy could still cancel on us. So it's a lot harder than it used to be, but when it's done, it's a really great business. And if we deliver on leads, theoretically, this guy's not going to cancel. He makes way more money than he's paying us in advertising.\r\n\r\n\r\nNik (35:43.63)\r\nSo you're taking your skill designing and developing websites, your knowledge on SEO, and you're creating them in a way where you're funneling leads.\r\n\r\n\r\nAlex (35:54.827)\r\nExactly. 100%. And five years ago, that was way easier to do. You could launch three, four, five of these in a month, use all the ad, the profit from, you know, those two or three or four that you've already got and just start funneling through and cycling through and landing deals.\r\n\r\n\r\nNik (35:56.238)\r\nInteresting. Dude, that's...\r\n\r\n\r\nYeah.\r\n\r\n\r\nNik (36:11.118)\r\nHow do you think the changes that Google's making to their rankings now is going to affect this business?\r\n\r\n\r\nAlex (36:18.603)\r\nSo I think that from like the AI perspective, actually it's pretty shielded because if you think about what is being absolutely just destroyed by AI right now, it's like informational searches. So somebody wants to search what's the best tablecloth material for my kitchen table or, you know, what's the best way to learn how to build a website. AI will put a snippet there and half the people that's the answer that they want, they don't even click onto a website. So anybody that's getting ad revenue from a website,\r\n\r\n\r\nAnybody that's getting affiliate revenue from links on their website, like they're losing traffic day by day. And then also Google is just penalizing tons of them. So it's a really rough place to be if you're trying to create like a niche website, but the local side, AI is not that helpful in that somebody wants to search for a tree service near them. They want to find companies. They don't want an AI snippet. That's talking about, you know, how to find one like.\r\n\r\n\r\nNik (37:02.062)\r\nOkay.\r\n\r\n\r\nNik (37:13.518)\r\nYeah.\r\n\r\n\r\nAlex (37:15.403)\r\nThey just want the map pack or they want the organic listing or they want the sponsored listings. And I don't see that changing in the next five to 10 years because fundamentally when somebody is searching for a service near them, it's transactional. They just want connected to that business. Google as an AI middleman is probably never going to cut out the businesses. So you're always protected at least for now and for at least what I foresee in the future.\r\n\r\n\r\nNik (37:19.79)\r\nInteresting.\r\n\r\n\r\nNik (37:36.366)\r\nMm -hmm.\r\n\r\n\r\nNik (37:41.678)\r\nSo you're a tinkerer, you like to mess with stuff. What are you obsessed with right now?\r\n\r\n\r\nAlex (37:47.691)\r\nI'm obsessed with one of the lead generation stuff. Like I said, we landed our first deal and I really want to keep that business owner retained because I spent so much time and effort to get to that point. And then I want to now we've made it all the way through. We've made it to the end. We've closed the dude and I know the process works. It's about replicating that. So it's really probably for me going to be a slow up and coming grind on that.\r\n\r\n\r\nNik (37:57.774)\r\nHahaha.\r\n\r\n\r\nAlex (38:13.963)\r\nto get one or two of those launched a month and then over, you know, three, four, five, six months, as you start to get enough lead flow from each one, you start closing one after the other. And it's a pretty passive arm of the business. It's recurring and it's very much just a nice bolt on because it's the skills that we have. If I'm not occupied with something from a client side, I'm working on our websites. So I'm obsessed with that. And then on the other side of it,\r\n\r\n\r\nis I am really obsessed just in general on the SEO side. So I've been doing it for my, my websites and the benefit of having my own websites is that I am testing things on my own dime. So if I want to buy something really sketchy from Fiverr that I think might work from an SEO perspective, I'm just going to do it. I don't have to worry about like, you know, having to send an email to a client, like, Hey, I just destroyed your website. Like, yeah, you're probably done. We need to just launch something new. I do it on my own stuff.\r\n\r\n\r\nNik (39:03.054)\r\nYeah.\r\n\r\n\r\nAlex (39:07.403)\r\nand it kind of gives you that playground to have that freedom.\r\n\r\n\r\nNik (39:11.886)\r\nAwesome. That's hilarious. Yeah, don't ruin anybody's website testing stuff.\r\n\r\n\r\nAlex (39:16.491)\r\nNo, no, no, don't do that. I might ruin my own, but that's okay.\r\n\r\n\r\nNik (39:20.014)\r\nYeah. Well, Alex, this has been a fascinating conversation, man. Where can people find you?\r\n\r\n\r\nAlex (39:24.619)\r\nTwitter at Alex Lathery and that is pretty much the best place to find me website, bluecollarbuilds .tech. If you need web design, anything like that, I'm your man.\r\n\r\n\r\nNik (39:34.606)\r\nBlue collar builds .tech. Awesome. man, this is a great conversation. We'll talk later. See you.\r\n\r\n\r\nAlex (39:40.107)\r\nAbsolutely, man. Thank you. Thank you.",
  "metadata": {
    "duration": "",
    "date": "2024-10-21",
    "platform_source": "Google Drive"
  }
}