{
  "episode_number": "201",
  "episode_title": "Use AI to Cut 20% of Labor‚ÄîThen Hire $1,500 VAs to Scale with Parker Cox",
  "guest_name": "Parker Cox",
  "business_name": "Avago",
  "transcript": "﻿Yeah, my only one will be knowing my baby bladder and the fact that that's my second teeth since I moved to come here. We'll just see. You might have to have a pee break in there in the middle, but Tim Ferriss does it, so I know. So we're good. Well, he does like 10 hour podcasts. These podcasts are won.\r\n\r\n\r\nPeople have bigger bladders than me. Huh? I said, some people have bigger bladders than me. All right, let me adjust this so I'm comfortable kind of digging the fact that I get to deep throat this thing. So this right here is going to, this part right here is gonna adjust the pitch. So if you loose it here, you'll be able to raise it or lower it.\r\n\r\n\r\nIt's gotta be righty, tidy from this angle.\r\n\r\n\r\nYou get it? Yeah. Got it. Need some help. Good. Okay. Alright, well this is exciting, man. I don't do many in-person podcasts and somehow you blackmailed me into this, but I am, I'm here with Parker Cox. Parker and I have known each other for a couple of years. Parker is a successful entrepreneur, done multiple different businesses, uh, bootstrapped a property management company that I think you got to over a thousand doors, which is.\r\n\r\n\r\nReally good size. Um, and you've also started a number of other ventures, but the one we're talking about today is Avago, which is overseas talent. And here's the reason I'm excited to talk to you about overseas talent is because you don't bs. And I want to ask you straight up why the freak is everybody getting into overseas talent.\r\n\r\n\r\nI feel like every month I open this Twitter app and it's like I'm launching a new overseas talent company. Glee's had one. Nick Huber has one. John Matzner has one. Uh, who am I missing? You have one. I mean, they're just, they're everywhere. Or are they somewhere? Uh, but, but seriously, man, like why is everybody getting into, into this game right now?\r\n\r\n\r\nI mean, there's a really easy answer, which is easy money. I think that when you look right now, there's a brief window of a serious disconnect in a marketplace of if you have this information for how to find people and you have consumers that don't have that information, you can charge a very heavy premium.\r\n\r\n\r\nFor a very small gap. Right? Right. That's disappearing. And I think for us, we're trying to be positioned for what the world looks like as that gap doesn't widen. But look at somewhere, I mean, they're not doing extremely detailed, heavy, heavy lifting for their clients, but they're probably at like pre true cogs.\r\n\r\n\r\nThe marginal cost of a placement is under $200 for them, and they're charging their clients four or five grand. So, uh, geez, Louise. So their gross margins are gonna be massive. Yeah, they've got a lot of fluff around their labor, I'm sure. But the actual cogs, like the cost to place a single person to find you, your next executive assistant is in a, in the couple hundred dollars range.\r\n\r\n\r\nHoly crap. So charging four or five grand, two, three, $400 for placement. I'm gross margins, 36, 30 $500. Easy. Oh my gosh. Easy. I gotta make a call. Yeah. I gotta, I gotta, I gotta start my own business. Yeah. I got your next one. Uh, okay. So in your opinion, it's, it's easy money and so people see it as easy money.\r\n\r\n\r\nIs it because they have distribution and they're like, well, I can get the message out to the decision makers and it's easy money, I'm gonna go for it. Yeah, I mean, I think it's a nascent industry and you have to be lucky, right? Like this is a gold rush to a certain respect. The technology that allows small businesses to hire internationally.\r\n\r\n\r\nIs maybe really mature as of the start of COVID, right? Like Zoom and where we are. Mm-hmm. Where you don't need to be sophisticated. Like the 58-year-old accountant down the hall can actually hire that person pretty easily now, and they're used to it. I would say that the second piece though is. When it's nascent, people want to be early movers, and you really, it's going into the hills and you are pulling the gold out of the stream.\r\n\r\n\r\nYou are not digging the mine. And so these people, like someone like Huber and somewhere who I have respect for, I mean, they're a good company. I've talked to many of their clients like it's not like they're selling a bad product here, but the reality is that they're selling the easy money because they have the biggest funnel.\r\n\r\n\r\nThat is one of the major advantages. The question becomes when that is no longer the advantage. Yeah, the funnel. Yeah, exactly. When it's like, Hey everybody, we can acquire customers in a different way than they do, but when the funnel isn't the only differentiator, right? This is when the tide goes out.\r\n\r\n\r\nYeah. And who's swimming naked? Yeah. Yeah. So, um, oh, timer's going off. I set a timer so that every time you start talking longer than five minutes, I have to stop you. If, if Cole and Mike are watching this, they're gonna start laughing at that joke. Um, so when I look at somewhere, I mean somewhere they're making a ton of money, probably $20 million a year, top line, $30 million a year.\r\n\r\n\r\nTop line. Yeah. Uh, their valuations over $50 million netting at this point, maybe even into the eight figures. So it's, it's super profitable. Um, can you stop using the word nascent by the way it makes me feel stupid. Uh, I know it's easy to do, but just say early, Hey, you're the only one with an MBA from a, just say early, from, from a very high quality school, Nick.\r\n\r\n\r\nBut, um, let's articulate what the like problem set is that these companies are solving. 'cause there are bunch of different companies that I wanna talk about all the different models, but the basic problem set that they're solving is what helping small and medium sized businesses recruit. Global talent.\r\n\r\n\r\nOkay. For and for what types of positions are they recruiting global talent for? I mean, there's a wide array of companies out there. A lot of them go specific into like marketing roles or accounting roles, but to use somewhere, which is kind of the biggest in the space. Basically. Anything that isn't C-Suite, executive assistants, bookkeepers, uh, you know, salespeople, that's, well, that's interesting 'cause Huber said his next hire, I think it was the CFO, they hired.\r\n\r\n\r\nIn South Africa, which is an executive level position that that he hired. So it's not just non C-Suite. True. I would say that those of us who have the businesses are the most comfortable with the talent. Most of my clients are not hiring senior, senior people. I am. Right. Other than our co-founders, everybody's international.\r\n\r\n\r\nSo is this a fair way to say anything that is not in-person customer facing, could be. Filled with an overseas talent. Anything that can be remote, could be overseas. Okay. Well, not necessarily anything that could be remote, I guess that's an interesting definition for it. 'cause that could be somebody who's, oh, they're the dispatch for the HVAC company and they, they work in the home office.\r\n\r\n\r\nThat could be a remote position. A hundred percent. Okay. Um, and I'm, I'm assuming. Even though it's a new market, there are probably some fairly standard roles that people look for. Uh, what's the one? Uh, not QSR, but it's like a, like sales rep? Yeah, like B-D-R-S-D-R. There you go. S-D-R-B-D-R, sales reps, uh, accounting and finance positions.\r\n\r\n\r\nUh, bookkeeping, which falls into that category. Are there any other broad positions that Yeah, I'd say digital marketing in general. Okay. Executive assistants or VAs customer service reps. Um. That's probably the biggest, broadest brush strokes, right? You have have there. And what does a typical ICP look like for you?\r\n\r\n\r\nLike are these people who, Hey, I've started a business, I'm doing $250,000 a year, now I'm bringing on my first hire. Or are these people who are like, no, I'm at the seven $50 million mark. I've already made some hires. I know what I'm looking for. I just want cheaper because I wanna bring my costs down.\r\n\r\n\r\nYeah. So this is something we got wrong in our first year. Um, to answer your question in the shortest way. As much as I don't want to be snobby, our perfect ICP, the vi Venn diagram of somebody who's gonna think we're the greatest company in the entire world and have an incredible outcome. 2 million plus revenue, 10 plus employees that if you get either one, it'll work.\r\n\r\n\r\nMm. But both is where they think, you know, we just printed gold bars, you know, in Willy Wonka's factory. That's Avago though. Correct? Right. Generally speaking, is that, do you think that that's kind of the, I think that's applicable for our industry as a whole, for every, so if you're a, a solopreneur or you're somebody who's like getting up and going and you're like, I gotta scale, you wouldn't necessarily advocate that they're first hire.\r\n\r\n\r\nSomebody overseas. Correct? I mean, you could hire anyone overseas. You've had hundreds. Well, I've had experience of employees. You know how to hire someone, right? Anyone who would struggle on their first employee if they were sitting right next to 'em like you and I are offshore, creates a bigger learning curve and therefore a higher chance of failure.\r\n\r\n\r\nYeah. Anyone who knows how to hire what they look for, decent levels of management comfortable with a remote worker, of course, go offshore first. The economics make it so much less risky. Add onto that employment law and all these other things. And it's like for you and me in a global independent contractor for $1,400 a month, it's like no brainer.\r\n\r\n\r\nI can terminate them if things go wrong. Like they're gonna work harder than, you know, little Susie who just graduated at Boise State. Yeah. Who needs $3,800 a month? You know where else this applies that I've been surprised with and I, I kinda have this realization early on, but AI. If you've managed people and you have experience with managing people, you are gonna be so much better suited to leverage AI than somebody who hasn't because you, you kind of know what it takes in order to give somebody instructions and expectations and then hold them accountable and follow up with 'em and have QA and all that other stuff.\r\n\r\n\r\nWhereas somebody who's never managed someone before, there's just a learning curve associated with understanding how to leverage it. Yeah. There's a real, it's, I, I mean that exact idea. I think that's very astute. Um, thank you. Yeah. Yeah. Every once in while I went to UC Why not or are blind squirrels.\r\n\r\n\r\nRight. Um, but uh, you know, you know, I think that one of the big ones is it's just when you have a base level of infrastructure for managing someone, Hey, I use Zoom frequently. We have a way to check our KPIs. What is our phone answer rate for customer service reps? Yeah, it's really easy to plug someone in like a key secret de definition of somebody who's gonna be really successful with offshore.\r\n\r\n\r\nIf you know the role you're hiring for with a lot of specificity, you will be very, very happy with going offshore. If it's like, well, I kind of need them to do this, and it'd be great if they could, you're gonna struggle just 'cause you'd struggle to hire somebody in your office. Totally agree. Do me a favor, bring that mic up just a little bit if you can.\r\n\r\n\r\nSo that better? More? Yeah. You just want it like within good six inches. Yeah. Yeah. So like six inches is like this distance right here. Is that what she tells you? Yeah. Yeah. It's like this. That's best. Okay. What Mohamed Triple. Uh, alright, so I, I want to talk about the different models that are out there 'cause it's kind of overwhelming.\r\n\r\n\r\nYou've got Huber who does somewhere, um. Do you feel comfortable naming or should we just like, I'm fine. Yeah. Okay. So we've got Huber who does somewhere, and it's like, I will place somebody for you. Here's the fee associated with that. You've got the Sagan model that John Matson's doing. Mm-hmm. Which is join our community essentially, and there's a, a pool of talent and, and we're not necessarily going out and finding this person, we're just giving you access to these people.\r\n\r\n\r\nUm, you've got then other, I I would say quote unquote traditional staffing companies, which are like, well. We actually don't care how we place them. We do role specific placements, right? So there's kind of a smattering of these things. Mm-hmm. But we don't do anything post-hire. We don't do any support. Um, you're not paying us, you're paying them directly.\r\n\r\n\r\nI think Sagan, you're paying the workers directly. You're not paying Sagan anyways. There's a whole bunch of different ways. Uh, for people like me, it's like, well, which one do I go with and what are they doing? Can you help kind of break down? What the exact models are and who they might best benefit. So like let's start with a fully done for you headhunter service.\r\n\r\n\r\nYeah. Yeah. So I, I mean, especially for Twitter, which is where I know a lot of your audiences, so small to medium businesses that aren't dealing with what Facebook or Yeah. Any blue chips are. You have staffing, which is your renting time from a company. They employ the person, they manage the person, all of that.\r\n\r\n\r\nThen you have somewhere like sort of recruitment is what they call it. Or you'd, you know, headhunting could be way, headhunting is real simple. It's, you'd come to me and say, Parker, help me find this role. Do some screening. You have you, you cast the net. Mm-hmm. You find the fish and then I pick the catch and then they stay with me long term.\r\n\r\n\r\nI get some protection in case they don't work out. Right. 'cause you can only screen so well in the beginning and it's a one-time transaction. Right. Beyond that, the pros of that relationship are, they're pretty good at finding people and screening them and can give you guidance there, and you have a lot of flexibility and you get to pick because that's actually really important.\r\n\r\n\r\nYou don't necessarily want them to work for someone else if you find the right person. You want them internal. Yeah. It's a big upfront fee that most small businesses struggle with. And is it, is it usually just a set flat fee or is it like a percentage of first year's earnings? Yes, all of the above. All of the above.\r\n\r\n\r\nSome people will go five grand. I mean, you could basically roughly position it in your head for a standard position, it'll be about $5,000. Okay. That could be 30% of first year salary. That could be a one-time flat fee, but basically five grand. And there's a lot of pros to that because it is a short term commitment.\r\n\r\n\r\nYou get the support of the exact thing you need. And so the market is pretty saturated with companies doing that. Mm-hmm. Because like I said, it's easy money. Now you're seeing the market switch a little bit more towards staffing. So before we go to stopping though, what happens if I hire that person and they don't work out?\r\n\r\n\r\nYou'll get, I'm just out. Five grand, you'll get somewhere between a 30 to 180 day guarantee on their performance and the ability to replace them. Oh, okay. So it depends on the company, but so typically there is like a replacement. Yeah. If it's obvious, like, oh, they just, yeah, they disappeared. They never responded.\r\n\r\n\r\nIt was a bad hire. Correct. Okay. Um, and in those instances, they're setting you up, but you're having to pay them, pay the vendor or the contractor, whatever, what do we call them? I call 'em hires, but Hires. Okay. Whatever. Yeah. Teammate, whatever they, they are technically about 99.9% of these people end up as full-time international independent contractors.\r\n\r\n\r\nOkay. They're not actually a 10 99, that's an onshore designation, but they do work as contractors. The headhunt is, they work for you. Nick employs them. The contracts between your company and them for the international independent contractors. I, I, I've, I've personally used them. But I, I never had like an LLC pay for them.\r\n\r\n\r\nAre there tax implications? Like, do you need to have certain things set up? I know there's like, this is what you should do and then this is what everybody else does, but like, what should you do? So I'm not your accountant, uh, or your attorney, but, um, short answer is no, there's no. No risk in the us. The IRS doesn't care.\r\n\r\n\r\nYou're perfectly safe. Okay. It's like hiring a graphic designer. So it's just a vendor, just any other independent contractor. You, you could be outside of employment laws within the foreign country where you manage this person, right? Yeah, yeah, yeah. Most small businesses, the first off, the contractors prefer that they're saving a lot of money on their own employee taxes.\r\n\r\n\r\nMm-hmm. But most employers are like, well, if. Sri Lanka thinks my company is out of bounds. Like I'll just not work there more if I have to. Right? Sure. Like they don't know who I am. Like you're, you're kind of safe from a grand perspective risk, but it is a risk. Okay. So that's the headhunter model. You said things are moving to a staffing model Now?\r\n\r\n\r\nI've owned a staffing company before. It's what we were on a text one time and I was asking a question and Parker's like, well this is typically how staffing companies work. And I was like, I've owned a staffing company that I've never done that before, but, so like even the, the spectrum of staffing companies is very different depending on different industries, but staffing companies, essentially that person works for the staffing company and then you, the business owner are contracted with the staffing company, right?\r\n\r\n\r\nYeah. Yeah. So. Staffing at its deepest level, you can almost think of it. Instead of paying for like a person, you're almost more paying for an outcome. Like almost always you'll find staffing companies being really specified into like a single role. So we're an accounting staffing agency. Okay. And so the role is fulfilled by a person, but really what the client is hiring is like, I need my bookkeeping done is an outcome.\r\n\r\n\r\nTake care. And if that's, yeah. And. There's a spectrum within that. Like you said, it's like you and I have gone back and forth. There's a lot within there, but staffing is, they work for the agency. They might be in a cubicle in the Philippines where the boss walking around making sure they're not on Facebook, is the staffing agency.\r\n\r\n\r\nAnd so more and more you're seeing. People like there's kind of these smaller companies that are doing more of a middle ground between both, where they do act as a staffer, but it's still just a remote person who's with you full time. So it's all blending right now while this market matures and people are trying to figure out where the true product market fit is on the staffing side, I had Nathan Yap on here and he actually has, I think he has dual citizenship or his parents are from the Philippines.\r\n\r\n\r\nI can't quite remember, but. He's got a full team in the Philippines. They've got like amazing offices. He's like, it's like Google. We bust them in, they got lunch, they got a chef, we got a gym on site, all this stuff. Uh, but effectively that's his staffing agency. Mm-hmm. And they're based in the Philippines.\r\n\r\n\r\nAnd then they do work for a lot of different people. Is that a pretty tried and true model at this point? That there are these companies that are set up, let's say in a country like the Philippines or Pakistan, and they've got, I don't know, a hundred different independent contractors. And then you as. Mr.\r\n\r\n\r\nStaffing agency kind of have a relationship with that company as opposed to a hundred independent contractors? Yes. So, okay. Something that's really interesting about this Twitter sphere and the penetration of global into, uh, small businesses. Nobody seems to have done the research on what happened with blue chip companies, right?\r\n\r\n\r\nSo in the world of blue chips, right, the Facebooks and otherwise, I mean, there's several. Billion, multi-billion dollar staffing companies out there, right? Really that Facebook employees. 14,000 engineers for a company in Brazil. Right? Like wait, really? Yeah. They're what you call BPOs, business process outsourcers.\r\n\r\n\r\nAnd then there's also things that are called RPOs, which is recruitment process outsourcers. And that's where instead of staffing, which is business process, and as you see they say business. You're buying an outcome. Mm. This is the supplemental engineers. This is the at t call center that we all hate, but they employ, you know, 50,000 people in the Philippines.\r\n\r\n\r\nRight. Like that's a BPO serving that needs for the larger companies in most cases. So, okay, so sorry. BPO, business, process, organization, and then outsourcing. Business process outsourcing. Okay. And then RPO is what? Recruitment process Outsourcing. Okay. What are those? So basically just explain it to me like I'm five, it's, it's the headhunter model and the recruitment or, or, and the staffing model for SMBs at the billion dollar scale.\r\n\r\n\r\nR oh RPO is you hire us to do your recruitment process. Headhunter, headhunt, right. Business process is you staff the team we need for this role. Does that make sense? Staffing. Staffing. I'm gonna be honest with you, that is by far the cleanest, most efficient explanation. You personally, as Parker Cox have ever given.\r\n\r\n\r\nAnd I love it. It's freaking phenomenal. That was an amazing, I'm growing up, man. I'm proud of you, man. Thank, appreciate that. But seriously, that, that's an amazing type. So these have already existed. What we're seeing now is with the proliferation down to the SMBs. Exactly. Interesting. Yeah. And did this start kind of during COVID?\r\n\r\n\r\nI mean, I mean not to start, but that was even before me. I think that you see kind of the very beginning of the wave with Tim Ferris, the four hour work Week VAs. Right. And that was the earliest wave of hiring people there. I would say COVID is where it hit a bit of a crescendo. Huh? Where we all became comfortable with remote.\r\n\r\n\r\nIt's not it, it's a big grasp in 2011 to think I could hire somebody in Argentina as a, you know, seven figure entrepreneur. I. As soon as you start having, well, my accountant just moved to Charlotte, North Carolina. It's like, what's the difference between Charlotte, North Carolina and Bogota, Columbia, except $2,000 a month of savings.\r\n\r\n\r\nThe name becomes very, one is John and one is Juan. Exactly. Yeah, exactly. Becomes much easier. Dude, you blew, you blew my mind, man. People are watching this. They're like, wow, Nick. It really is stupid because it, it just, it clicked for, it just very easily clicked for me. Staffing. Headhunting. Those are the two.\r\n\r\n\r\nIf I'm an entrepreneur and I'm trying to figure out, well, who do I go with? Which company do I use? Well, do you want someone to just bring you candidates that you interview and hire, or do you have a specific business process that you want outsourced? Go and work with that company. It's a freaking beautiful way to say it.\r\n\r\n\r\nSo somewhere headhunting Sagan. Is not, I wouldn't say it's staffing. No. So Sagan is the only other company like us that is thinking about what is the next, next gen reality, uh, for small businesses. Um, a staffing would be growth assistant, I believe. Okay. That they actually, so that's Jesse Pui. Okay. Um, I believe they do actual staffing for primarily marketing roles.\r\n\r\n\r\nUm, same with, uh, HILs Company landed or something. Brian O'Connor, who I had on. That's his company is like sales. Yeah. Yeah. Um, you know, a company I really respect near for Gly, which is actually the biggest in the Twitter space, by the way, like way bigger than somewhere. Uh, when we were at, um, the whole co conference in Sundance, they had their CEO of N, who's, I wanna say he's in like Argentina.\r\n\r\n\r\nNot in Argentina. Yeah, he's in South America though. And he's the CEO of their company. Yeah. Which is pretty cool. And he's a baller. They're a great company. I have a ton of respect for them. Yeah. Um, I think they're doing a lot of wonderful things. Um. They're more staffing. Okay. What I think makes Sagan and us unique in the space, pgo pgo, um, is I think there's a gap in the market.\r\n\r\n\r\nAnd I'm either gonna be the pioneer who's early and ends up with arrows in his back, or we're gonna have a nice big, rich vein of, uh, of opportunity. We'll find out, but. So we are, we have created what's tried to be the middle ground between staffing and recruiting. Okay. A financial model that's recurring that gives you full flexibility and ongoing support.\r\n\r\n\r\nThe pros, staffing and staffing. Okay. But they work for you and we are really fundamentally giving you the recruitment outcome you need with supplemental support along the way. I did a poor job of this. So just really quickly on the staffing side, it's a recurring model because. Me, business owner, entrepreneur and paying the staffing company.\r\n\r\n\r\nYep. A fee every single month. And then the staffing company is paying the independent contractor. Yep. So it's recurring, it's predictable. Yeah. There's a good margin baked in there, yada, yada. Yeah. Um, and so what you're saying is where you and where Pgo and Sagan have kinda stepped in to the hole in the market is there's been a, a desire for sort of a hybrid approach.\r\n\r\n\r\nWhy? Well, I think that. You need to know who your customers are. Um, and that needs to guide the decisions. Most small businesses, the reason we did it, we started out as just a core headhunting model and we did really well. Um, you know, like very easy money. It was a side hustle. It was great. But I, I realized, um, that the outcome I was trying to achieve for my clients was counterintuitive or counterproductive to my model.\r\n\r\n\r\nAnd so. What we realized was the companies that do the best, they go from one person to like eight people like that. That happened to me at my property management company. That's why I started Avago. Mm-hmm. When you're charging five grand or even a staffing agency model, if you take somebody who's $1,200, you make 'em $3,400.\r\n\r\n\r\nIt's really hard for most small to medium businesses, even in the seven figure range, to actually have the one to eight outcome. It's like 50 grand on headhunting fees or $25,000 a month just isn't feasible. The costs are not beneficial enough. We wanted to create a model that facilitated that growth.\r\n\r\n\r\nMm-hmm. Not inhibited it. And so that was our idea in creating a membership where the company has access. We kind of align ourselves deeply with your recruitment process. We can help you find anyone from anywhere. So we source in a lot of different places, unlike most. We offer the ongoing support of payroll management, um, you know, these additional sorts of, of training platforms, dialect coaching, sales training, marketing training and support.\r\n\r\n\r\nWe also just launched our automation library so you can template there and our whole vision is how can we facilitate much better outcomes for our customers over the long arc of time? So they wanna hire more people and we make it cost effective. Okay. You said a bunch of stuff there. So I'm gonna try my best to like Yeah, yeah.\r\n\r\n\r\nUnpack each one of those. So you're char, you are charging the head hunting esque fee of a yearly admission or yearly membership. What is that? So we charge $500 per year. Okay. For the company? For the whole company. Cool. So that gets you in the door and that gets you in the door and gives you access to those things that you just said.\r\n\r\n\r\nMm-hmm. Like the SOP library, the dialect coaching, et cetera. Yep. When it then comes time to hire. Am I asking you to find those people and you're presenting me with, yeah. Okay. Okay. Full white glove. White glove recruiting. Okay. And then I'm also then paying you though to then pay the independent contractor?\r\n\r\n\r\nNo, we use a third party software. We do the administration on your behalf, but it goes from your bank account to them. We don't take a cut. What is the administration? What does that mean? Well, just twice a month you gotta actually run payroll. We do it, but it's your bank account. To their bank account. Do you charge for that?\r\n\r\n\r\nNope. It's just included in our fee.\r\n\r\n\r\nAgain, I'm a Neanderthal. How does that business model work? 'cause you've got these guys over here that are doing headhunting $5,000 a placement. These guys over here that have a recurring model of one placement, let's say it's $3,500 a month. Mm-hmm. Per employee. Mm-hmm. You are charging $500 once a year, plus 3 29 per hire per month.\r\n\r\n\r\nOkay. Okay. So there is a per hire per month. Mm-hmm. Administrative fees. Alright. Even still, that is significantly lower than that. From a headhunting standpoint, it's 10% of the headhunting fee. And from an ongoing staffing standpoint it's, what is that, 25%? Let's just. Let's say I'm smart and say 25, 20 5% of the recurring revenue math would tell me that your margins are gonna suck.\r\n\r\n\r\nWhy do your margins suck? Uh, our margins do not suck. Um, we, we, we are, you know, we are still very much growing, so our gross margins are good. Our net margins are about zero. 'cause we put everything back, putting everything back into the business, back into growth, and we're bootstrapping. Um. No, I mean, I think you probably underestimate just how much, how good everybody else's margins are.\r\n\r\n\r\nWe're trying to build a business. As far as I know, we're the first company in the space that will say like, without being embarrassed, I'm trying to help a million people get hired. We wanna be the first giant platform that's very different than other people who you've had on this podcast who it's like, no, they're trying to build like the next seven, eight figure company, like.\r\n\r\n\r\nThat's not our goal. I want to help a hun, a million people get hired. I want tens of thousands of clients and right now it's a service business. We're in the transition to a tech platform. We're building out a lot of our own infrastructure AI solutions to support a platform that will actually facilitate this.\r\n\r\n\r\nThere's areas of the value chain, but the reality is that we are very intentionally building the thing that scales with our clients. Can you tell me what your margins are? Uh, or where they will be at at stasis? Yeah, we, we pretty comfortably model between 50 and 70%, depending upon churn that we'll see with candidates.\r\n\r\n\r\nOne thing about our model that's different than everyone else, and it's both a benefit and a challenge for us, but it's a benefit for our clients, which is when you pay 3 29 a month and you can terminate anyone at any time, we want our clients to terminate and get only the best people. So we are actually pretty quick to encourage, if you're not super happy with this hire, start looking for the next person.\r\n\r\n\r\nThat cost will be the difference between if mm-hmm people, if, if a candidate only lasts, or a hire only lasts for 14 months on average versus 21 months on average, that's the 50 to 70% prediction. And so still, TBD, just model this out with me. Traditional staffing model. For 12 months, I hire somebody and that staffing company places them with me.\r\n\r\n\r\nStaffing company charges me $3,500 a month. They pay the independent contractor $1,500 a month, probably a little less, probably more like 1200. It'll make math easier. So just $1,500 a month. Mm-hmm. So there's a spread there of $2,000 a month that I, the staffing company I'm keeping. So for over 12 months, that is $2,400.\r\n\r\n\r\nNo. More than that. $24,000. Yeah. I'm special. Um, for you though, you hire one person and let's just say that one company comes in, they join and they pay, they hire one employee, $500 to join, plus 3 29 a month. So we're looking at 32. I'm gonna round up and just say $4,000 a year, $4,500 for those 12 months in, in aggregate revenue.\r\n\r\n\r\nThat you are getting versus what a staff, a staffing company would be getting $24,000 a year. Mm.\r\n\r\n\r\nWhat am I missing? Well, one of your favorite guests. Their margin is my opportunity. Um, what I will say is, uh, first off, the staffing agency carries a lot of risk that we don't, and I think I have a better lesson in risk than most. And it may be small for most people's perspective, but I don't employ the hundreds of people that my clients do.\r\n\r\n\r\nThat's actually really important when you scale this to 10,000 people. Staffing agents, agencies are the employer, whether they're only have independent contractors, which is its own form of risk, or they're the employer of record in the local country, they're the employer and that matters. Um, the second piece is if they are actually employing the people in this country, then.\r\n\r\n\r\nThose risks transfer, right? It's like having W twos in the us mm-hmm. As opposed to 10 90 nines, but the cost is much higher. 'cause you actually need an entity locally. You're gonna be paying the taxes. So that $1,500 employee costs could actually be 2300 or 2,400 after taxes. So for these companies, do they get to a certain size where they actually have to employ these people in those countries?\r\n\r\n\r\nBasically, if you don't wanna really piss off the Filipino government. Okay, so the government could potentially come after you? Yeah. It's just the same way, you know, every country's different, but if you have a bunch of misclassified contractors in California, that's a problem. So, I mean, it's, it's Jeff Bezos saying, your margin is my opportunity.\r\n\r\n\r\nYeah. Basically. Does it ever, does it become a race to the bottom though? Like, what's, okay, cool. Now you're at 50, 60% margins. Why doesn't somebody come in and discharge a hundred dollars a month and they'll have 30% in that margin? Do, do you get what I'm saying? Like it just a hundred percent and I, so. I think that that's a flashy headline.\r\n\r\n\r\nYou and I riff out on this sort of stuff a lot. Um, the race to the bottom isn't as real as people think that it is. Okay? Because there's a place where value becomes more important. So like we are working on a solution for people who wanna pay a hundred dollars a month. Um, how bare bones can we get this?\r\n\r\n\r\nAnd we're like, when we get really serious on what are they paying us for? You can offer that in a really good, effective way where it's like, yeah, a hundred bucks a month, you do the hiring, but we'll do the top of the net. Where do we cut off our involvement? Right? And what's our ongoing support? I think far more important than that is where is the true value?\r\n\r\n\r\nAnd we feel that we've set ourselves in a, in a robust way that gives us it. The mentality we use is we're trying to offer a wonderful service at fair prices, not a fair service at wonderful prices. I think that's a important distinction. Stealing from Warren Buffet, dude. Uh, it's Munger, but yeah, Berkshire Hathaway.\r\n\r\n\r\nThere you go. What's that? Berkshire Hathaway. But that's exactly where we took it from. And it's the same thing we tell our clients about who they should hire, hire wonderful talent at fair prices, not fair talent at wonderful prices. That principle is not a race to the bottom. That'd be like saying, is Costco a race to the bottom?\r\n\r\n\r\nIs Amazon Prime a race to the bottom? Like they found a floor. That floor has reach and that's what we're going for. That's an interesting way to put it. I don't know that a race to the bottom necessarily means bad. Like I think of it as a race to the bottom of pricing. So like nobody's gonna come and undercut Costco or Walmart or Amazon.\r\n\r\n\r\nThey can't, they don't have the scale that any of those companies have. They're not gonna be undercut. So they've kind of set the floor effectively, if you will, and now. Because nobody can compete with 'em. They have a moat and they're able to, to move forward. However, they own the distribution, which is, it sounds like that's actually a really important component of launching these companies.\r\n\r\n\r\nIt's like you have to, you have to be able to get your message out there. 'cause if everybody knew about pgo or Sagan or these other companies that are cheaper than somewhere, they wouldn't necessarily be going and paying the massive headhunter fee they'd be going, um, to these smaller companies. How do you think about growth?\r\n\r\n\r\nBecause like you said, John Matzner, I've had him on here a number of times. Think he's probably the best focused marketer on Twitter. All he posts about is his business. Every single post hitting me over the head, nom, nom, nam, I love your margins. I'm munching your margins. You know, yada, yada, yada. But he's gotta do that because he doesn't have distribution.\r\n\r\n\r\nLike Jesse Puy or, or near or, uh, what's the one that, um, Austin. Oh, Austin Reef so much. I don't know what his company's name is, but Yeah. But they, they have distribution, right? So like they don't necessarily need to Yeah. Change, hit it on every single time. How do you think about distribution and the opportunity to go out and grab market share?\r\n\r\n\r\nWell, as you can tell by my massive Twitter audience, that, and my continual posting on offshore, that's what I care about. Um, so let's say one thing clearly. I think that just about everybody you listed. Found a less ugly course. That's what offshore has been on Twitter in the past three years. It's like it is an influencer's way of driving value from their audience that is more valuable than buy my course on how to be a seven figure house flipper.\r\n\r\n\r\nRight? Like sure. There is a point there where, remember the incentives, this isn't always. Find a business and then find the best way to grow it. Often it's, I have an audience, what's a business? I can sleep at night pitching to my pe, pitching to that audience. Chris is doing that right now. Exactly right.\r\n\r\n\r\nLike Chris is trying to figure out, okay, I have this audience, what's the best way for me to monetize it? To utilize it? Yeah. And I monetize the audience. I do think to your point, like it is a course, um, like you are offering a course because there's a value proposition in hiring offshore. It's cheaper.\r\n\r\n\r\nCool. Great. There's also massive value in understanding how to onboard those people, how to train them, how to follow up with them, how to hold them accountable. How do I talk to somebody in the Philippines? Do they have the same type of culture that somebody in Pakistan has, or South Africa or South America?\r\n\r\n\r\nThe answer is no. And you are driving, you're delivering value in that space because you have these courses. You have SOP templates, et cetera, so they kind of morph from, oh, this is a course on how you hire outsource talent to. I'll just help you hire outsource talent for these influencers. Yeah. Steve Jobs has the famous thing where a CEO's job is, is two things.\r\n\r\n\r\nMarketing and getting the best people on the team. Our goal is to create a frictionless hiring opportunity for our clients that's de-risking it if it goes wrong. Mm-hmm. Fire fast, right? Hire slow. Take whatever time you need. You're in charge of this process. They work for you. I think when you really compare, and I think Huber like to go back to your question on, on distribution.\r\n\r\n\r\nHuber has spoken openly about this and, and it's something somewhere had to grapple with. We immediately went outside of audience-based distribution because I don't think, it's not that it's not a real company without that, but you have a massive key man risk that also requires like, I don't want to be Mr.\r\n\r\n\r\nPgo for the rest of my life. Yeah, I don't want it entirely dependent upon how happy or or not my audience is. So we immediately went and said, can we create consistent distribution under other methods? That has been, I think, a real advantage that has forced us to grow slower than say John or Nick or Sahil, or even near.\r\n\r\n\r\nBut it has also given us a power that over time, I think will work in our favor. Well have you. I'll try not to pontificate too much. Keynes in economics, the most famous phrase that he has is in the long run, we're all dead. Right? And, and the reason he says that is because, well actually we we're short term actors and we, we make decisions in the short term because we don't think about the long term.\r\n\r\n\r\nEven if in economics, like, well, in the long run there will be equilibrium in the short run. If you don't optimize for that, you're dead. So what I would say though is. They're optimizing for the short run to get them to the long run where it's like, okay, cool. There's this underpriced distribution channel.\r\n\r\n\r\nIt's not paid ads, it's not meta, it's not mailers. Whatever it is, it's distribution through an audience and they're pushing on it, and they're, they're, they're really trying to leverage that. From your perspective, why not lean into that? Like why not try and push that when it still is an underutilized, undervalued distribution channel?\r\n\r\n\r\nSo I don't blame anyone for doing it. We do it some, I mean, I've generated a good chunk of business from both relationships and social media posting, especially more LinkedIn than Twitter. 'cause Twitter's a little crowded. Um, but uh, at the same time it's, I think you have to have the humility that it's like, I could totally be wrong here and I could be the idiot who is proven to not know what they were doing and be totally wrong.\r\n\r\n\r\nI do think that it comes back to some of your fundamental beliefs. So out of everybody you listed who you've had on this show, I, I know a few of them. And it's like they're looking for a very cushy seven figure income. That's like, they're open about that. Yeah. That's not what I'm looking for. And I have a couple.\r\n\r\n\r\nYou want a very hard seven figures? Yeah, yeah, exactly. No, I'd actually like to make six figures really, really hard. Um, so yeah, I mean, as I've proven with all of my previous life choices, but what I'm trying to do is, is build a bigger business than that. And I have the advantage of, of kind of other companies that have me covered.\r\n\r\n\r\nYeah. And I'm one of the few out of this group that is the operator. As well as the, the voice, right? Mm-hmm. If you take Jesse Ooey, he doesn't run the company. No. It's, he's, he just the funnel, right? Sean Purry and Nick Huber, like, they're not Huber for all the way he's going out. He's just funnel. He's not like, gonna walk after this.\r\n\r\n\r\nI gotta go check in with my team and make sure that our marketing L 10 today went well. I, I honestly, I think the last year he's become more of that because he is been forced, like dude took a freaking massive swing. Sure, sure. Like a $50 million purchase. I think anybody in that position would be like, yeah, I better figure out.\r\n\r\n\r\nBut he did immediately install the CEO too. I know, right? Yeah. So I agree with you, but my only point is I think, you know, even Matzner, it's like, well, Matton's not operating that business yet. Exactly. Point being, I'm not the marketer, I'm the CEO, and so it's trying to create both levels of value, but I'm also trying to create something that eventually, hopefully will be able to exist much more strongly without my brand.\r\n\r\n\r\nAnd. Maybe that's, maybe I'm doing it in the wrong order, right? Maybe it was like I should have sold my soul, but I thought, go to where I know I'm gonna be on the back end, um, and then keep my socials as supplemental, but not the only core growth strategy. Well, I mean, we've privately had debates about that, right?\r\n\r\n\r\nIt's like you need to go harder into this. But the truth is, objectively, if you looked at this, you launched this business and your first clients came from Twitter a hundred percent, right? Like you created. Uh, I don't even know what, what's your current MRR or are you willing to say, or like, what are you guys We will break into the seven figures a RR within the next 90 days.\r\n\r\n\r\nOkay, cool. Uh, I think you are able to build a six figure a RR company just on a small, you know, comparatively small Twitter following 5,000 followers. I just look at that and I'm like, man, ROI to follower ratio is insane. If that scaled, I would just be leaning every single day. I'd be doing what Master's doing, right?\r\n\r\n\r\nIt's just like every single day hitting somebody over the head. Um, but your point of like, I'm gonna sleep better at night knowing that my distribution channel's not dependent on an algorithm change or whether or not I can reach the people who actually follow me for content or piss somebody off or whatever the key man risk.\r\n\r\n\r\nLike I totally get it. I'm not, I'm not faulting it, uh, by any stretch of the imagination. So. I wanna ask a couple, well, do you have anything to add to that? The only thing I'll say is I think that one of the key differences, and I tend to be a student of history and business biographies and otherwise, and all of the most successful companies that any of us have ever heard of are thinking in decades, not in quarters.\r\n\r\n\r\nAnd I'm trying to emulate that. That means that if Avago wins, it'll win really, really big. There is absolutely a sacrifice to not prioritizing what is the fastest way we can grow in the next 90 days. That could be wrong. Like I am full transparency. It's like if this doesn't become a decade long survivor, then we have questions.\r\n\r\n\r\nBut I don't, no, no. I don't think it's wrong. It's just a choice. It's your choice. I, I did the same thing with my home health and hospice company. I haven't talked about this a ton, but we grew from zero to $12 million in like less than three years. It was really, really fast growth. Um, but I prioritized long term 'cause I wanted to go and have multiple locations.\r\n\r\n\r\nI wanted to have a centralized team. I wanted to bring in the best people so that we could actually scale. But there had been a fundamental misunderstanding, I'll call it, with my other partners. They wanted to optimize for cash flow much quicker. And I wasn't optimizing for cash flow. And so even I, even though I had grown the top line revenue, the bottom line revenue or bottom line performance wasn't where they wanted it to be.\r\n\r\n\r\nAnd that's ultimately what got us to a point where it was like, all right, well I want to do this. You guys want to do this, let's go ahead and just sell this and we can, we can exit. It was amicable, it was fine. Like, but there were just different priorities. Right. And not that any one of those decisions was necessarily right or wrong for you, it's just.\r\n\r\n\r\nYou and your partners have made the decision, this is the way we're gonna go about it. And who cares if somebody else is doing something different? Yeah. And I think you're identifying a big piece is at some point we all have to make the choices. What are you gonna charge for your product? Yeah. Are you gonna Right.\r\n\r\n\r\nFor us, it's, it's very much we are trying, we believe that offshore is a phenomenal pathway. Um, that it's like it's gonna be bigger in five years than it is right now. That instead of doing what everybody else is doing to make a million bucks as fast as possible, we should be like the market is expanding, be prepared.\r\n\r\n\r\n'cause the pie's gonna be a lot bigger. So we've built a business model that is trying to be decided for that. We've built a system of customer acquisition. That's interesting. So you think the pie's going to get bigger in this market? You don't? AI's gonna come in and eat all these No overseas jobs? No. I think if anything, AI's gonna make it more common and more usable.\r\n\r\n\r\nWhy? That, to me, that feels like a, not a defensive take, but like, you're not incentivized to think AI is gonna eat your lunch. Right? Like, you're incentivized to think, no AI is gonna make my our job better. It just seems like all those jobs could be easily automated away through artificial intelligence.\r\n\r\n\r\nYeah. So I mean. I think you have to go role specific, right? It's like, are there gonna be as many bookkeeping jobs in the next five years? Like, probably not, right? Low level bookkeeping's, very base administrative, right? Add stuff into a spreadsheet, like really low level VA work. Probably not, but it's like, I don't think AI's taking over digital marketing anytime soon.\r\n\r\n\r\nAnd this isn't even a question of offshore or onshore. My, you know, controversial take or, or contrarian take on this is that I think we're gonna see minor job loss. I have a unique advantage of growing up in Silicon Valley in the nineties and like seeing people get rich and go through all of this. AI is gonna supplement all of what we're doing.\r\n\r\n\r\nIf I look at AI right now, it's probably replaced to the tune of 20% of my team's labor, but added all of these things we were never doing before. Sure. Hey, how, here's feedback on how your sales call just went. That we created a custom prompt and GPT workflow on, right? Like. Hey, this is how it's giving us deep research into the way that we want to go and, and implement these new things.\r\n\r\n\r\nAnd I think that when you actually look at the combination of, if my thesis around supplemental AI plus offshore means that it's gonna be more entrenched and more valuable, not less. Hmm. Um, and I think that we'll also see AI lead to a lot of, a lot more like an entrepreneurial wave in the us. And those entrepreneurs that are now doing one to 25 person companies are gonna go offshore first.\r\n\r\n\r\nSo I think penetration's gonna be greater, and I think we deeply underestimate the amount of utility that it has. You and I can walk out this room right now and it's like, see all the companies around here, how many of them use offshore? If it's 2%, I'd be shocked, like shocked. It's so new. We just live in Twitter, so everybody, it's like, well, I just hired my AI engineer from, you know, Indonesia, and it's like, that makes it sound normal.\r\n\r\n\r\nIt's like go to the auto body down the street. If you told 'em to hire a Mexican phone answerer, they'd be like, this is impossible. I don't even understand. Those are the people in the next five years that'll start to get it. How? A, from all the noise we're all making B from interacting with them, with their competitors and other companies.\r\n\r\n\r\nHmm. Um, and CI think just the exposure to the increased quality. The number one thing that is shifting right now is we're going from viewing offshore global talent as cheap to offshore global talent as great. We are so terrified of the 1997 at and t customer service. That everybody hears global talent and it's like, absolutely not.\r\n\r\n\r\nThat person can never work for me. But you hear a, you know, whether it's Pakistan or Columbia or South Africa where it's like, I didn't even know you wait. You don't live in this country. I didn't even know. Then they, the light bulb goes off. Hmm. Oh, this is better people for less, not horrible people for nothing or, or same quality people for less.\r\n\r\n\r\nI, I think one of the things that was shocking to me recently is I've been having conversations when the, all the tariff stuff was going on. Uh, and I talked to Craig Fuller and then I talked to Hans Dose, who also has a company, and both of them were like, China is not cheap labor anymore. I mean, it's cheaper comparatively to the United States.\r\n\r\n\r\nChina is where you, where they have the manufacturing expertise to do all of these limited quantity runs. We build all the manufacturing facilities to do these massive runs with Volkswagen and Panasonic and all these large companies. They have figured out a way to give access to the small business for these a hundred, 200, 300 quantity runs that we don't know how to do here in the United States.\r\n\r\n\r\nThat was an interesting turning point for me. And so and so like what you're saying is the perception needs to change from, it's not just like cheaper labor, this is also gonna be labor where. In the same way that my kids are growing up, AI native, these people are growing up remote, native. And so you're tapping into a market that potentially Yeah.\r\n\r\n\r\nDude, I use this story. My sister runs social media for a cosmetics company based outta the city. She lives in the The Hills by Sacramento. Okay. And she's actually like one of the good ones. She's 30 years old. She pr probably makes $90,000 a year. She comes in early and she stays late. When she's looking, she thinks she's competing with, you know, like Steve in LA and Cindy and Berkeley and you know Mike in Denver.\r\n\r\n\r\nAnd it's like, no, she's competing with, you know, somebody in Bogota or Ahmed in Pakistan who like, they're willing to do it for 90 grand. You could replace her entire team with four people that have five times the designations and both of them have master's degrees. I don't want to be doom and gloom around American work.\r\n\r\n\r\nI think it's still gonna be, I think offshore will be supplemental to great American workers in the same way AI will be supplemental. But the reality is that the big light bulb is when you start to realize that the entitlement issues you get with low wage, or at least like medium wage labor in the us, like, Hey boss, it's 5:02 PM Why'd you text me?\r\n\r\n\r\nLike that doesn't happen offshore. They're grateful for the work. They're gonna run through a wall for you. They've got a higher experience level, higher education level, and like they see this as their pathway. They look at their, you can take advantage of them. You can pay low wages. Yeah, exactly. Well, yeah, no that, but that is what a lot of people hear when they hear that.\r\n\r\n\r\n'cause they're like, oh, you could just take advantage of them. Oh, you can just pay 'em lower wages. The thing that's different, and I'm the son of an immigrant is. Dude, if you've seen Hamilton immigrants get the job done, man. They just have a different work ethic. They have a different mentality. They, they do go above and beyond.\r\n\r\n\r\nAnd I'm not trying to paint with a totally broad brush. I'm gonna get people who are like, you can't say that. That's totally racist. It's not racist if you are the son or daughter of an immigrant, you know exactly what I'm talking about. Immigrants have historically made this country great and they will historically make the country great as even as we move forward.\r\n\r\n\r\nSo I, I totally am with you. You can pay a lower wage and you're gonna get people who are. 110% behind you. The big downside is they didn't grow up in the United States, and so they don't necessarily have the same cultural norms. They don't necessarily, they're not AI or tech native. Uh, they don't necessarily understand which company is which company because they don't, you know, live in the States and see HP and IBM and whatever, all these other companies.\r\n\r\n\r\nSo like, there are downsides to it. But yeah, in terms of like committed workers. Freaking immigrants are amazing. Yeah. I actually find them to be more tech forward, but also it's like, I think the virtue signaling around like payload wages, it's all utter bs. Excuse me. Like what are you saying? If you hire somebody in Toledo, Ohio for the same job as San Francisco, like all of a sudden you're a monster.\r\n\r\n\r\n'cause they, it's 140 grand versus the other, it's 340. It's like we're comfortable with cost of living adjustments within our own country. It's like $4,000 a month in Mexico is more than doctors make. Yeah. People just don't wanna feel replaced. That's, that's the problem is that at least if you were like, oh, we're moving the 340,000 job dollar job to Toledo for 140,000, it's like, okay, cool.\r\n\r\n\r\nWell those are still Americans. If you're like, we're gonna move the $140,000 job for 40,000 to Argentina, then it's like, what the freak? Those aren't even Americans. So I do understand that perspective. Right. 'cause then they're feeling like, well now I'm losing jobs. Like at least I could have the opportunity to move to Toledo.\r\n\r\n\r\nMake $140,000 a year. I don't have to live in San Francisco, but I'm not moving to Argentina. Do they even have McDonald's down there? You know, so like, I, I get it. I really, I do understand that part of the argument. What I don't understand is this, like you can't compare societies, right? Like Chris had a tweet that went viral where he is like, I paid a tutor to tutor my son.\r\n\r\n\r\nShe had like a freaking PhD in Pakistan and everyone was like, you're gross. You're race. How could you pay so little? That woman from that tweet ended up sending Chris a message and was like, thank you so much. I've gotten more business than I've ever gotten. I'm making more like three times more than the average annual salary.\r\n\r\n\r\nThe local news did a story on me because it got so much publicity, like her life was changed because of that. And you want to have people who here who are like making moral calls from their cell phone sitting in a cafe, you know what I mean, in like Stockton, California or wherever they are. You can't even compare the two.\r\n\r\n\r\nSorry, I'm ranting now. You interrupt me, but I I, I'm with you. But I do understand people being worried about being replaced or like not having it here in the United States. Yeah, I mean, I think it, obviously I can understand the person who's like, well, my mom was the receptionist at the dental office for 16 years and like she came in and she did her thing and you know, they replaced her with, uh, two people in the Philippines for half her wage.\r\n\r\n\r\nYou know, anytime there is a transition to a new paradigm, there is turbulence that creates risk and challenge. But when you put it over a long enough time horizon, it's always net positive. And I think that like anytime we get reductive and fear-based in these decision make like decisions, everybody is worse off.\r\n\r\n\r\nRight. It's like if somebody is willing to work like in Pakistan, to use that example, 'cause we do a lot out of Pakistan, like $1,800 a month is like six figures. It is not cheap. You are making a ton of money locally in Pakistan at $1,800 a month. Like your wife can stay home. Your kids are going to a nice school like that is life changing, especially to use Pakistan as the example.\r\n\r\n\r\n25 years ago, their family was probably a peasant with no electricity and no running water in a village. It's like this is massive benefit for that location in that region. Alright, lemme finish this out by asking some questions. Yeah, yeah. Which I'm freaking stoked about. One of the questions is, which country's the worst?\r\n\r\n\r\nBut before I ask that question, where can people go to find you? avago.co. Look at the hat. Pa va go.co. Um, yep. And, and I believe you said anybody who enters, uh, Nick omics code will get 10% off their first year. I think that's what you No, it's just free if they answer in economics. Okay. No, I actually will create a forward slash economics that you can add for anyone who signs up.\r\n\r\n\r\nFirst off, the $500 annual membership fee is already fully refundable if you don't hire, but that'll only be 250 for the first year. So half off. Okay. Half off. That's freaking amazing. Yep. Okay. Here are my questions. Um, we know about the Philippines. What are all the other countries that people are popular?\r\n\r\n\r\nCountries that people are, are, um. Pulling from right now, um, Pakistan, South Africa, uh, Columbia, Costa Rica, Argentina, Mexico, and Sri Lanka. If we go to Europe, basically the Eastern block. Um, so you know, Bulgaria, Ukraine, Romania, all very common. Okay. Um, I gotta end this. My wife got in a car crash. Whoa. Bad one.\r\n\r\n\r\nI don't know. Just stay here for one second. Yeah, yeah. Actually this will be a good, I'm gonna run another stream.\r\n\r\n\r\nYou good? Yeah, yeah. Yeah.",
  "metadata": {
    "duration": "",
    "date": "2025-07-09",
    "platform_source": "Google Drive"
  }
}