{
  "episode_number": "107",
  "episode_title": "How This Hot Sauce Maker Got on Hot Ones with Scott Zalkind",
  "guest_name": "Scott Zalkind",
  "business_name": "Lucky Dog Hot Sauce",
  "transcript": "﻿Nikolas Hulewsky (00:00.215)\r\nAll right, Scott, Colin from the Bay. I am super excited to have you here. Why don't we just get into the nuts and bolts? Tell us about your company and what you do.\r\n\r\n\r\nScott A Zalkind (00:03.502)\r\nWell, Lucky Dog Hot Sauce is my company. I make and sell hot sauce. I have a model where I use a co-packer. I decided early on that my time was better spent out hustling the sauce and getting into stores and packing orders and doing the things that actually get sauce into people's hands rather than being in a kitchen stirring a kettle, which, you know, that's purely a time sink that\r\n\r\n\r\nI don't have the money for a giant kitchen or all the equipment. With my background in healthcare, I did some projects where I did ROIs for equipment purchases. So interestingly, I go to a commercial kitchen and I can identify the source of every piece of equipment in there and how much it costs. So was pretty easy for me right off the bat to know I don't have that money to buy a liquid filler and accumulate table, a label or shrink shrink band heat tunnel and all the fun things that go into\r\n\r\n\r\nproduction line of a physical food product. So I do partner with the co-packer. I'm now in my third co-packer and I'm super happy with where I am. I do farmers markets and festivals for retail sales. I have a website that I sell hot sauce off lucky dog hot sauce.com and I'm in a number of stores. I think I'm up to about 67 at this point. I wasn't as many as 200 stores. The pandemic wiped out quite a few and then some of the bigger chains are a little fickle. So you kind of come and go in some of the bigger chains when you get in.\r\n\r\n\r\nNikolas Hulewsky (01:31.701)\r\nThat's\r\n\r\n\r\nScott A Zalkind (01:31.981)\r\nBut in a nutshell, I make and sell hot sauce. At heart, I am a passionate hot sauce person. I love spicy food. I have my entire life. I love the creative process. I always want to do something creative for a living. And somehow I ended up in IT and project management as a career. So I was less than totally satisfied doing those things. And at one point, just lost my mind and started a business.\r\n\r\n\r\nNikolas Hulewsky (01:56.577)\r\nSo I need to talk to you every morning, because it's like I'm like getting a shot of just caffeine, just hearing you tell your story. Question for you. Well, first of all, you were featured on Hot Wings, right? your hot ones, your sauce was on one of their episodes, or is it continually featured?\r\n\r\n\r\nScott A Zalkind (02:12.938)\r\nMike Dogg was actually on 13 episodes of season nine, all 13 episodes. I was one of the first 50 sauce makers who had a sauce on the show. They have three house sauces, five, and 10 are the sort of house brands. And the bomb never goes away. The bomb is always gonna be number eight. And over the years, I think it's just become Sean's little F-U to everybody. That, you know, what people didn't realize is every year they'd announce the lineup and a million people would complain that the bomb was still on there, because it's...\r\n\r\n\r\nNikolas Hulewsky (02:20.523)\r\nAmazing.\r\n\r\n\r\nScott A Zalkind (02:41.865)\r\nAnd what they don't realize is a million people complaining is a million people talking about it, which is marketing. So if everybody got the hell up about the bomb early on, it probably wouldn't have been back every season for 25. And back then they were doing one season a year. So was, it was fun to be in that early sort of group of sauce makers that had us on the show. It's still really exciting to get on there. I'd love to get back on there. It's, it's\r\n\r\n\r\nNikolas Hulewsky (02:47.361)\r\nGood today.\r\n\r\n\r\nNikolas Hulewsky (02:53.205)\r\nYeah\r\n\r\n\r\nNikolas Hulewsky (03:05.175)\r\nSo let me ask you this, because from what I remember, you went from selling drugs to people to creating a side hustle and then starting selling hot sauce. And I say that tongue in cheek, selling drugs to people, but weren't you working in pharmacy? Weren't you working in healthcare?\r\n\r\n\r\nScott A Zalkind (03:22.314)\r\nI was working in healthcare. was a project manager for Kaiser Pharmacy for 10 years. I worked at their Health Connect area for two years doing a number of different types of projects. One of the biggest ones is the custody. They 237 internal pharmacies. It was my job for track and trace from where they make the drugs to the consumer all the way through the supply chain. it was such a cluster. But those are the kinds of things that I would do. A number of other projects that I was on that would just bore you to tears.\r\n\r\n\r\nNikolas Hulewsky (03:50.571)\r\nOkay, like those are, okay, those are real things. those are, Kaiser is a massive business for people who don't know who aren't from California. I grew up in Sacramento, by the way. So, know, stones throw from where you are in Hayward, but Kaiser is massive. So if you're working on all their pharmacies, there's a lot of internal processes, et cetera. How does that skillset where you're an internal project manager translate to building a consumer product like hot sauce and then rolling that out as a company? Did it just happen overnight or was it a slow roll?\r\n\r\n\r\nScott A Zalkind (04:19.721)\r\nDefinitely not overnight. was a hobbyist for seven years honing the rest of the people. The first three or four years, they were pretty terrible probably. I thought some of them were okay. But after three or four years, I'd get friends saying, hey, this stuff's pretty good. And then friends of friends, the bottles would find their way too. And I wasn't selling them. was just making batches and a batch would make 20 or 30 bottles. I'd keep two or three. I'd give away the rest. And then friends of friends and people who owned restaurants or chefs or people who owned grocery stores, the feedback would sort of percolate back to me that, hey,\r\n\r\n\r\ntell your friend the stuff's really good and if he makes it I'll sell it or or a chef saying hey this is the best hot sauce ever had and this is somebody who went to culinary school professionally trained cooks I'm thinking well maybe I maybe I'm on to something here so after seven about seven and half years I decided to give it a try like how hard could it be it's just you know it turned out it was pretty hard that's where the co-packer thing came in but it's funny the way you asked I loved the question actually because not only with the project management background\r\n\r\n\r\nPrior to that, I went to college and studied horticulture. I was an applied sciences major. So I did greenhouse management. I lived in the Netherlands for two years and Holland, growing roses in St. Paulia and stargazer lilies and a number of other plants, acanthus mollus. I came back here. I worked in greenhouses. I worked for Rob McClough and company. I was an orchid breeder. I bred, patella, pedal and orchids for a while. I ran their spa for orchids. and so\r\n\r\n\r\nwith a lot of career changes, know, working over here in horticulture, you know, over in Holland, you're respected as someone who studied science and working in California as a horticulturist, you're respected like the guy that mows your grandma's lawn. It's not the same kind of pay or respect as a society that appreciates what it takes to run greenhouses and such. But at every juncture, when you jump careers, you you put all this time and effort into studying something and you work at it for years and you feel like you've accomplished some things and you start over. went to night school, I started\r\n\r\n\r\nlearning about computers because I was living in the Silicon Valley. This was the 90s, everything was blowing up. Went and worked at a game company, got a job at a help desk to start, worked my way up to IT management, and then jumped from IT management to project management. Project management translates to anywhere. Took a job at Casio Permanente and spent 12 years there as a project manager, PM1, PM2, PM3, and then quit that to do this. And even jumping ship from\r\n\r\n\r\nScott A Zalkind (06:40.421)\r\nhealthcare to hot sauce, you feel like, jeez, I just wasted that 12 years. But you know, like I said earlier, when you go to a kitchen and you see the equipment, you're like, that's a capsule or a capmatic cap, right? I know how much that thing costs. So if I went to a commercial kitchen that I was thinking about working with, and I saw they used all cheap shit equipment, well, I'm not gonna wanna work with that kitchen because that's gonna be the quality of produce they buy, right? They're gonna...\r\n\r\n\r\ncut corners on a machine, they're going to cut corners on my sauce. And I wanted to make a high end product. And then same with just product management is a form of project management. It's the life cycle of a project from concept to execution to proof of life to, you know, how's this going and measurement, measurables in terms of running metrics to see what my top sellers and bottom sellers are and what the turn rate and velocity. And so all the things that I learned through horticulture, through IT, through\r\n\r\n\r\nproject management and they all add up to the sum of what I do today. that's sort of, whenever anybody asks me that question, I like to impart that no matter what you do in life, you are sitting right there talking to me right now is the result of every step you have taken in your life to get to this exact point. There are no wasted steps. There are no wasted cycles. Experience is experience and it can all build on each other. And then you'll find that it comes in handy in ways you never thought it would.\r\n\r\n\r\nNikolas Hulewsky (08:03.041)\r\nWell, and like you think a lot of times, at least I do, I don't know about you, but in entrepreneurship for me, was like, I wanted to do something that I love to do and have control over what I want it to do. And sometimes you think, well, I got to make a million bucks or I to make 10 million bucks to be free. But you've taken all of your experience. And I mean, you seem really passionate about what you're doing now. And now you have control of your time. You're doing something that you love. All that experience is sort of fed into what you're doing now and made you successful. Had you always wanted to be.\r\n\r\n\r\nan entrepreneur or was this just kind of like, it just seems like the next best step. I've been doing this for seven years and it's kind of working out. Let me be an entrepreneur.\r\n\r\n\r\nScott A Zalkind (08:39.921)\r\nWell, as a project manager, you you go on a project and you you coordinate with stakeholders and shareholders and you know on any given project as a PM three of PM twos and PM ones under you and you interface with other departments and you've got timelines and you've got budgets and communication streams have to be clean and\r\n\r\n\r\nthere are a dozen bosses sort of informally, including your own boss who is more formal, but all these other people on this project are gonna take you down every minute of every day. There's so much stress involved in that. And what I wanted to do was get away from all that stress. And so I still work for a micromanaging jerk. It just happens to be me. it's, know, somebody when I first quit my job and started this, who I know who has a business told me the best part of being self-employed is\r\n\r\n\r\nNikolas Hulewsky (09:17.75)\r\nYou\r\n\r\n\r\nScott A Zalkind (09:25.921)\r\nyou get to pick which 14 hours a day you wanna work, which I thought was the funniest takeaway ever. now 12 and a half years later, it is the single most true thing anyone has ever said to me about this. And so it's not necessarily something I wanted to do. I've always wanted to do something creative with my life. I've wanted to be artistic. I'm not a painter or a sculptor or a good pen and ink drawer. I'm not an artist, right? I think I have good ideas. Like all of my labels were my ideas.\r\n\r\n\r\nNikolas Hulewsky (09:41.623)\r\nMm-hmm.\r\n\r\n\r\nScott A Zalkind (09:55.124)\r\nBut ideas about execution are worthless. So I have good artists in my circle of friends and family. I go to them when I need a label art piece done. I tell them what my concept is and we'll go back and forth a little bit. And then I give them total artistic freedom from there. And usually that's when you're gonna get the best results because artists do better work when they have that kind of. If you in an artist, they're gonna give you exactly the box you asked for. You don't want an artist at that point, you want a carpenter.\r\n\r\n\r\nRight. And so when I go to an artist for a label like D'Adel Pedro won first place for label art, grand prize for marketing at the 30th National Fire Food Show in 2016 or the 20th, think it was the 28th annual fire food and barbecue show in Albuquerque. And it won number one for label art, grand prize for marketing and that label. I said, I wanted to deal with Martos version of my label. I'm working on a Mexican table sauce. She said, what do you want? And I said, I love sunflowers go. So she gave the dog sunflower eyes and everything else was her.\r\n\r\n\r\nAnd that label is the most beautiful label I've ever seen. And there's no way that label would have been that good if I tried to pigeonhole her into doing something that was in my mind's eye. So I had a good concept, but the execution was all in the artist. And that freedom helps.\r\n\r\n\r\nNikolas Hulewsky (11:05.943)\r\nWhat I really like about your story is like, there's a lot of people who talk about getting into entrepreneurship and it's really easy to sell the sexy dream of, do the side hustle and you'll hop into it or it's super easy. Anybody can get started and you can figure this out. It took you seven years and that's not glorified many times, right? Cause it's not as sexy. You're like, he he bet the farm. But you said something, I listened to one of the interviews that you did. You said something about the way you were iterating.\r\n\r\n\r\nScott A Zalkind (11:27.602)\r\nNo, there's\r\n\r\n\r\nNikolas Hulewsky (11:34.923)\r\nbecause it took a while for you to sort of perfect the formula. Can you talk about that process of like how you got from never making hot sauce to, right, chefs are now complimenting me on, and I should sell it.\r\n\r\n\r\nScott A Zalkind (11:46.3)\r\nAbsolutely. Yeah, so when I first started, you know, it's funny, the internet is there and I love the internet and I love when I'm arguing with a friend about something stupid like sports, because I play fantasy football and you start arguing in 10 minutes into you're like, wait a minute, I have the hitchhiker's guide to the galaxy in my hand as all knowledge of the universe. Well, why don't, why are we arguing over this? We can just look up the stat, right? And so I kind of took the opposite approach. What I looked for on the internet was how to make sauce without killing people.\r\n\r\n\r\nI want to give people botulism. What's a safe way to bottle something? And it's all about pH. That's the basic science. Again, I was a science major way back in the day. How do you make it shelf stable? How do you make it so that botulism is not going to grow in it? What time and temperature do you need to pasteurize something? Things like that. Do I want to ferment? Do I want to pasteurize? Do I want to hybrid? Start with a mash and then add things and pasteurize. sort of looked at ingredients I wanted to use.\r\n\r\n\r\nAnd then I was just going haphazard. was roasting peppers on my fire, roasting them on my Weber grill and smoking them with various woods and smoking onions and, you know, roasting garlic and just doing all the ingredients that I didn't see in commercial hot sauces. And like I said, a lot of those sauces were absolutely just objectively terrible. I call them drain sauce because you make it pour down the drain and make a lot of drain sauce before you make something edible. And it can take years to make a good hot sauce. And\r\n\r\n\r\nThe way I approached it was, again, with that sort of scientific method, I would write down all of my ingredients in gram weight. would, you know, memorialize, document the recipe in Excel and say version control, here's V1.0, and I'd make it. you sort of have to, there's an expression in project management called failing up, right? And I know that goes to a lot of things, but especially in project management. You do postmortems on your project, you review what went right, and you review what went wrong, especially,\r\n\r\n\r\nfixate on what went wrong. And it's not to be hyper critical of your staff or of the project. It's to avoid repeating mistakes you've made. So the next project is that much smoother, right? And so if there was a thing that went wrong in the project, you can make sure to focus to not make that same mistake twice. You probably still will, you know, it happens, you have different people, different projects, but with food, with making a recipe and that process of evolving a recipe, you try to fail up, you make the sauce and you try it and you try to taste\r\n\r\n\r\nScott A Zalkind (14:14.926)\r\nfor what is successful and ignore, not necessarily ignore, taste for what works in the sauce. And when you rewrite the recipe, you try to amplify those things while eliminating the bad notes, right?\r\n\r\n\r\nNikolas Hulewsky (14:28.535)\r\nTotally. I I love I freaking love that the failing up like when you said it when I was listening to it. I was like, that I love the way you said it and then you even said, I can't remember exactly how you said it. But you're like, Yeah, I made it. It was mostly crap. And then I took a little bit of good and then it was like half crap. And then I took a little bit of good and it was like 90 % good, but there's still some crap. He's like, I just kind of failed my way up. I thought it was beautiful.\r\n\r\n\r\nScott A Zalkind (14:44.43)\r\nHOT CHEW!\r\n\r\n\r\nScott A Zalkind (14:49.05)\r\nBut good is never good enough. That's the thing. I want to make great sauce, right? And with products that have won awards on the next batch, I might add 2 % more roasted garlic. I never stop tweaking sauces because they can always be just a little bit better or a little bit hotter or less hot or some note I want to express might not open up as much. so, you know, that's a never ending tweaking. I won't announce these tweaks to the world, but that and nobody is probably the I'm the only person that will taste that subtlety because I know what's in my mind.\r\n\r\n\r\nNikolas Hulewsky (15:17.825)\r\nWell, that's what I was going to ask is like, okay, like this is a product, right? Like, if I want to grow on social media, which is something I've been doing, because I'm trying to go an audience, I want to do a podcast. And you and I talked before the podcast started about how amazing social media is just how much we love the interactions. Anyways, it's very easy for me to measure whether or not something was quote unquote, good. How many views did it get? How many likes did it get? How many retweets? How many impressions? How many shares? Whatever. How do you do that with\r\n\r\n\r\nScott A Zalkind (15:18.329)\r\nI'm looking for.\r\n\r\n\r\nScott A Zalkind (15:33.198)\r\nyeah.\r\n\r\n\r\nNikolas Hulewsky (15:45.953)\r\nhot sauce? is it just you tasting it and saying, hmm, good, hmm, bad, and marking it? like, is there a scale of heat? Do you give it to other people? Are you blind testing it? Like, what do do?\r\n\r\n\r\nScott A Zalkind (15:57.334)\r\nIt's a great question. early on it was pretty much me and then I'd get feedback. I'd bring some to a party, right? This is before I had a company, I had labels and I'd like, it'd be a potluck down the street and I'd go put a bottle out with all the food and I'd be a fly on the wall. And I'd listen to what people would say critically about the sauce. And I've taken in as instructive. You know, it's easy to get your feelings hurt because somebody didn't, know.\r\n\r\n\r\nNot everybody's going to like your child, right? But you have to sort of take it with a grain of salt, right? That maybe some people just don't like kids. Same with hot sauce. everyone has their own face hole, their own tolerance. I have above average tolerant face hole and maybe what's hot to do. But you try to take an aggregate of the feedback and you try to evaluate it fairly and say, okay, well, you know, when you hear people saying, wow, this is great, who made this? You know, that's, that's, that you're getting an A plus grade, right?\r\n\r\n\r\nAnd so with future products, when I put out a product now, I just put out two for the first time in two years. put out one called Deluxe. It has Blackberry, Black Garthic, and Dragon Fruit. And I put out a wing sauce called Clucky Dog. They've both been best sellers so far. After the six, seven months they've been out. And with things like that, I bring them to the farmer's market. I bring prototypes. have regular customers that are loyal and come see me once every twice a month. And I'll usually bring that test batch there and say, hey, disclaimer, I made it in my own kitchen. If you tried this and die, it's your fault for trusting me.\r\n\r\n\r\nyou know, have a taste. I will get unfiltered feedback from customers who know my product and love it. And I'm very fortunate that I have that outlet that I can go around to various now, I might not always take the feedback. If somebody saw this really be great, put some come quad in it, I'm probably not going to go put come quad in it. But if if the majority of feedback is hey, this is fantastic, well, then I know at least on the right track. And then I'll hone in what I think are more desirable or less desirable attributes of the sauce. There's a there's a fun\r\n\r\n\r\nAdd a Jeffery up what sculptor they were talking about if it was dude of Venus de Mila. do you make it look just like her? And he says, it's easy. I start with a stone block and I chip away everything that doesn't look like her. And I the same approach to hot sauce. It's a little bit cheesy, but you you chip away everything that doesn't taste like what you want it to taste like. And there are some ingredient notes that will never go away and you have to find a way to mute them or mask them or balance them with something else so that it does become a successful.\r\n\r\n\r\nScott A Zalkind (18:17.56)\r\nThe Reaper is a really difficult pepper to work with. It's all super hot. Have a kind of battery acid, bitter note with them. So something like a scorpion pepper or a brain strain or ghost, have, you take a bite of the raw pepper, it's gonna be sweet and fruity or savory and floral. And then halfway through chewing it, goes wonk and you get this battery acid bonk into. And if the finishing note is bad, nobody's gonna wanna eat your sauce, because that finishing note draws you in for something else. It lingers nicely. gotta have some more of that.\r\n\r\n\r\nwith the Reaper that bitter notes right up front and it's got a bubblegum sweetness and that wonky bitter note to it and so that's very challenging because a lot of folks will make a Reaper sauce and they're going for the hottest thing they can possibly make because they want the bragging rights I want to make something that tastes good. So to me it's about making a condiment I'm not in that business of getting into the bragging rights Contest with other sauce makers. I'll never win it. I don't use extracts I'm not really interested that's one of the reasons I got into hot sauce because originally there were super mild sauces and\r\n\r\n\r\nstupid hot extract novelty sauces and nothing in And so I was trying to, as a project manager does, fill that gap, create something that fit into a void that I wanted to eat that had respectable heat and flavor. Now there's a whole bunch of wonderful sauce makers out there. I'm lucky to count myself as friends with a lot of them. But with the Reaper, the key to eternity, using an ingredient like mango that's sweet, because then that bolsters the good quality of the Reaper pepper and amplifies that sweetness.\r\n\r\n\r\nand then an ingredient like tamarind, it's a little tart to create a counterpoint to the sweet note. And when you've got the sweet and the tart, then that forward bitterness kind of takes a seat in between them and it's a little bit muted. So the bitterness is still there. You just don't really taste it. And the more reaper you put in, the more bitter it's going to be. So I also set out to make it not nuclear hot purposely. I brag that it's one of the milder reaper sauces on the market, but it's approachable. It's edible. It's a good analogy I make is it's like being the ugly girl in the Miss Universe pageant. She's still really hot.\r\n\r\n\r\nNikolas Hulewsky (20:00.471)\r\nI\r\n\r\n\r\nScott A Zalkind (20:15.832)\r\nShe does more. I'll find me, of course. I'm way out. She's way out. I'm out of her league.\r\n\r\n\r\nNikolas Hulewsky (20:16.106)\r\nYou\r\n\r\n\r\nNikolas Hulewsky (20:21.065)\r\nI did I this is one of my favorite things. And when I have people come on the podcast, many times I'll ask them beforehand, like, what are you really passionate about right now? Because most of what you just said could have been French, right? Like, it's a bitter note at the beginning. And then you have the end note and the way it balances that I'm like, I don't even know what you're talking about. But to hear your freaking passion for it. I know that you love this business. And it's not just a business to you. It's it's something that is like an art. And you're putting these things together. It's\r\n\r\n\r\nScott A Zalkind (20:38.577)\r\nYou\r\n\r\n\r\nScott A Zalkind (20:47.963)\r\nIt's what I do. It's a lifestyle.\r\n\r\n\r\nNikolas Hulewsky (20:50.647)\r\nAnd I think that's what people miss when they're like, I got to get my side hustle. The most successful side hustle is going to be the one you're most passionate about. And you're like the living embodiment of, of that. So the stupid question, what is a co packer?\r\n\r\n\r\nScott A Zalkind (21:07.119)\r\nOkay, so a co-packer is a commercial kitchen. In my industry, you need to work with a licensed cannery because hot sauce and it's specific, specific to California, but also many other states. The laws vary from state to state. But in my situation, I'm required to work with a licensed kitchen that is also a licensed cannery where the people that run that kitchen are licensed canners because it's a hot pack, acidified shelf stable product, right? And so.\r\n\r\n\r\nNikolas Hulewsky (21:34.775)\r\nI heard in food in particular, most of the country is sort of set to California standards because California is usually the highest standard. And so it's like, well, if we're going to mass produce for California, that might as well just be the standard that we, is that true? Okay.\r\n\r\n\r\nScott A Zalkind (21:40.676)\r\nThat's the picture.\r\n\r\n\r\nScott A Zalkind (21:47.184)\r\nIt's largely true. Yes. it's taken other some states fight it in some states. Like I know Louisiana had cottage laws for hot sauce, but I think that's long gone. I have a second. But so a co-packed facility is someone who already has a space who professionally makes product, excuse me, for other people. And in doing my research, when I was looking at starting this company, talking to friends who were already in the business, it dawned on me very quickly that everyone who started their own kitchen, because they had a hot sauce company,\r\n\r\n\r\nNikolas Hulewsky (21:55.937)\r\nSo,\r\n\r\n\r\nScott A Zalkind (22:15.951)\r\nended up becoming a co packer for other people because when you're small, like I am, you're going to whip out your years worth of sauce in about two weeks. And then what do do with your kitchen? What do you do with your staff? What do you got a bunch of stuff depreciating and using it? So they use their time and money to invest in their equipment. And then they their business model is being in the kitchen making product larger for other people.\r\n\r\n\r\nNikolas Hulewsky (22:27.275)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (22:37.493)\r\nYeah, they're manufacturers like that, right? Where it's like, I make this specific precision part and they don't necessarily own their manufacturing facility, but they rent out space and they're making a small run at that facility. So this is just on the food side, right? Like you're mass producing food. When did you get to the point where you were like, okay, it's dialed in enough for me to go to a co packer?\r\n\r\n\r\nScott A Zalkind (23:00.44)\r\nSo I started with a Copac right off the bat because you cannot sell hot sauce legally unless you have made it in a certified kitchen.\r\n\r\n\r\nNikolas Hulewsky (23:10.848)\r\nThat's what I mean. You were doing it for seven years before you quit Kaiser, right? So when in the seven years you're like, okay, I can go to a co-packer, was it year one or was it year five?\r\n\r\n\r\nScott A Zalkind (23:15.16)\r\nRight.\r\n\r\n\r\nScott A Zalkind (23:19.65)\r\nI'd say it was year zero because I continued for seven months while I was selling on the weekends at a farmer's market. So concept by, hey, I know this stuff's pretty good. I think I to start, I got it with a graphic artist. I got my business sales permit in California. You need a seller's license. So I picked up that. I did the DBA process where you do the doing business as put it in the newspaper. You're not, so you're starting a company, blah, blah, blah.\r\n\r\n\r\nTrademarking the name all those things that you have to do before and then finding a space because shit I just made 600 cases of hot sauce three flavors 200 each. Where am gonna put it? You can't put in a u-haul storage locker You have to work with an FDA approved certified warehouse that gets inspected twice a year So you got a rent palette space in a warehouse or buy a warehouse that that was not in my budget I found a space that so, you know all those things that you you and then insurance you liability insurance to sell a food product you have a million at minimum, but\r\n\r\n\r\nrecommended $2 million of liability insurance. And in 12 years, I've had one scoundrel try to jerk with my liability insurance by claiming they got injured from my sauce. But it it amounted to one email to me and me responding, here's my insurance number. Good luck and never bought it again. So if without that, though, you can get in a lot of trouble. People can make claims of harm. And if you're uninsured, know, then whoops. So that you got to see why you know, on anything you do.\r\n\r\n\r\nAnd so the decision came to use a coat packer immediately. mean, before I did anything I used, I decided I can either rent kitchen space. And at first I looked at uptown kitchen in Oakland, which shared kitchen space. The challenge is that's not legal because shared kitchen space is not a licensed cannery. even if cannery license, which would take me some time to get, I think it's a two year program, I still wouldn't be able to go in. It's not like magically make it into a cannery. Becoming a licensed cannery involves inspections by the states and certification you get.\r\n\r\n\r\nNikolas Hulewsky (25:02.581)\r\nNikolas Hulewsky (25:15.287)\r\nSo like there are these things called ghost kitchens where essentially they're prepping the food centrally, etc. But the difference for you is it has to be a cannery.\r\n\r\n\r\nScott A Zalkind (25:15.628)\r\nfree license.\r\n\r\n\r\nScott A Zalkind (25:25.023)\r\nGotta be cannery. It's a solidified product. like any other canned good, there's a risk of botulism. If there's water activity in the product, you can have bacteria and that bacteria can cause botulism. It's a terrible way to die. I don't want anybody to experience it because of at least that's my life goal is that nobody ever dies or craps themselves because of my product. They're very noble aspirations.\r\n\r\n\r\nNikolas Hulewsky (25:48.097)\r\nSo it's a very noble aspiration. Yeah, that'll be on your tombstone. My life goal was that nobody craps themselves because of my product.\r\n\r\n\r\nScott A Zalkind (25:54.174)\r\nThat's both of them. So yeah, right off the bat, used a co packer that I'm finding batch minimums that are friendly to a fledgling business is also tough. It's you know, there are co packers that will dissuade working with you'll give you some crazy high per unit quote on your product, because they don't really want to work with you. They want the unicorn customer they want me to be the already funded by VC backing, you know, the next Tabasco aspirant where I'm going to go\r\n\r\n\r\nselling million units a week and that of course that's how they make their money. And I get it because for a co-packer the first batch is probably break even or they probably lose a little on it because for every guy like me that was serious about it and actually made a product and is here 12 and a half years later still making product they probably have 20 guys that want to make an ego sauce because hey I have this hobby and I want my face on the bottle and I have this philosophy about putting your face on the bottle is it's a little quick flow chart is your name Paul Newman yes no if it's yes put your face on the product if it's no\r\n\r\n\r\nNikolas Hulewsky (26:53.911)\r\nyour face with a brother.\r\n\r\n\r\nScott A Zalkind (26:54.057)\r\nNobody reads that flowchart. There are a lot of sort of ego product. Yeah, I mean, go for it. You know, And nobody gave is so good luck. If you're successful, great. Good branding. If you're not blame the branding. But, you know, I got crap over my branding for a year. I people tell me it was terrible. People are gonna get confused because there's dogs on it. And I can know if it's for people or for dogs and like, well, rooster sauce as a rooster. They're doing all right. You know, nobody thinks roosters.\r\n\r\n\r\nNikolas Hulewsky (26:57.451)\r\nWhat about Dave's killer bread?\r\n\r\n\r\nScott A Zalkind (27:20.123)\r\nSo why not? Do you have to wear a sombrero and have a mustache eat tapatio? No, it's hot sauce.\r\n\r\n\r\nNikolas Hulewsky (27:25.463)\r\nSo getting the co-packer, getting all the insurance, doesn't sound like licensure, that costs money. At what point did you start thinking about pricing? Like at what point did you start thinking about, okay, how do I price these bottles and what is it going to be?\r\n\r\n\r\nScott A Zalkind (27:33.832)\r\nThe liability is it is,\r\n\r\n\r\nScott A Zalkind (27:42.823)\r\nIt was really challenging. That's also a good question. Nobody's had before. The challenge I had was I had no idea what I was doing in terms of pricing. I had no idea what the right margins should be. I kind of knew roughly retail wholesale margins. But I started working with a very small distributor who told me, so your price point on the shelf should be X and the store's going to make X percent off of X. They're going to stores want 30 or 40 percent.\r\n\r\n\r\nNikolas Hulewsky (27:49.663)\r\nYou\r\n\r\n\r\nScott A Zalkind (28:10.407)\r\nAnd then I'm going to take 20 % as the distributor. then whatever's left between that and what you cost to make it is what you're going to get. And I'm like, great. I get $0.27 a bottle. That's awesome. That was the wrong way to go about it. And I learned that after a year of not making money at this. Because logistics cost money. And there's so many hidden costs. Just credit card processing is 2.8%. All these little nickel dimes you lose along the way of selling a bottle of sauce.\r\n\r\n\r\ntime, everything that goes into it. You figure out pretty quickly you're not making money when you're not making money. Your bank account sort of tapers down instead of going up.\r\n\r\n\r\nNikolas Hulewsky (28:47.893)\r\nYou figure out pretty quickly you're not making money when you're not making money. Somebody write that down. Put that on a book. I'm not making fun of you. That is a freaking great quote though. That is a great quote. Sorry, keep going.\r\n\r\n\r\nScott A Zalkind (28:51.302)\r\nup.\r\n\r\n\r\nScott A Zalkind (29:01.126)\r\nSo what I realized was I got to shit can that distributor because that was a terrible idea and a terrible model. I listened to him because I thought he knew what he was doing. He went out of business three years later. So that doesn't surprise me in the slightest, but I'm surprised it took him three years. What I figured out was I'm not Tapatio, right? I don't have their economies of scale. I can't produce the sauce as cheaply as they can. And my sauce is much fancier than theirs, let's be honest. I make a gourmet product. I use locally sourced produce.\r\n\r\n\r\nNikolas Hulewsky (29:10.734)\r\ncool.\r\n\r\n\r\nScott A Zalkind (29:28.389)\r\nI have a 80 % threshold. I'm somewhere in the 90 percentile. I do certified farmers markets I'm allowed to do those because I locally source and because of that, you know California produce is gonna be more expensive than sourcing peppers from Mexico and spices from India or China or whatever and So if my cost is higher to make it well my cost on the shelf should be higher and yeah I'm not gonna sell as much as tab 29 a bottle\r\n\r\n\r\nbut nobody's gonna try my Pocante next to Tapatio and choose Tapatio. They're gonna choose Al Perro Fortunato because it's a fresh Pescea sauce with fermented cayenne and a little ghost pepper and Spanish smoked paprika and dry roasted garlic and fire roasted tomatoes. Just a much better, more layered, more complex, more gourmet product. And so it's the difference between buying like, you know, a Porsche or a Hyundai. And so it's gonna be lots more Hyundai customers, but they're not my customers. Sorry, I wish they were. I hope that...\r\n\r\n\r\nNikolas Hulewsky (30:21.239)\r\nIt's beautiful way to say you have to know who you're marketing to, right? And if you're appealing to everybody, you appeal to nobody. And it sounds like you kind of carved out your niche. What is a current price for your bottle? I don't even know what sizes they come in and\r\n\r\n\r\nScott A Zalkind (30:33.604)\r\nI'm a five ounce bottle I sell for 10 bucks a bottle. Again, tap is $2.29. So it's a massive difference between their price point in mind, right? And Sriracha as well. But they're kind of the big mass produced products that are salt, vinegar and peppers. And that's not what I do. So.\r\n\r\n\r\nNikolas Hulewsky (30:37.003)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (30:51.679)\r\nWhat's your, what are your channels for distribution? So you can self retail so you can, can actually buy space at the stores. How else do you sell? Do you sell online?\r\n\r\n\r\nScott A Zalkind (30:59.715)\r\nNot really about buying space in the stores when I sell retail, mean I'm doing farmer markets So that is my that's like having a temporary brick-and-mortar, right? That's my I don't have a brick-and-mortar. I have pop-ups So I do I do festivals. I do corporate events I have a couple of sizable corporate accounts that buy chunks of sauce from me as corporate giveaways from time to time local Barrier companies that are pretty big. I do festivals. I do the Albuquerque National Fire Food now I still do the Portland Festival in August and I do the\r\n\r\n\r\nWhat's the third one I do? the county fair. There's an 18 to 20 day fair in Pleasanton, the Alameda County Fair. And we get up typically about half a million people through there. It's a 12 hour day thing. And I tend to do very well there because I've been doing it 10 years now. So I have a 10 year built up clientele there. And those retail events are really my bread and butter because the margins are stronger. When I sell the stores, I'm selling them wholesale. The store makes more on the bottle than I do. But I'm OK with that.\r\n\r\n\r\nNikolas Hulewsky (31:56.055)\r\nWhat about e-commerce or?\r\n\r\n\r\nScott A Zalkind (31:59.09)\r\nI do sell online lucky.hot sauce.com and I sell to other e-commerce places that sell online. sell to heat hot sauce shop every now and then. Heatness buys from me New York. I've got Mikey V's in Texas. Ed Curry at Smokin' Ed's, know, the famous guy who came out with the Reaper and does the house hot sauces for hot ones. His storage carries my sauce. Well, they all sell online too. Heat hot sauce shop buys from\r\n\r\n\r\nNikolas Hulewsky (32:22.823)\r\nHow does that work? it like on consignment or do they just buy wholesale then they resell?\r\n\r\n\r\nScott A Zalkind (32:25.909)\r\nNo, no, it's wholesale. It's just wholesale. But buying a larger wholesale, I'll give them a break on the price. You know, I'll give them what would be akin to a distribution price. If they're buying a pop of sauce from me, they're going to get a better break. And that's easier for me, too, because it's coming straight from my kitchen. You know, like I said, there are percentages that get peeled off of the margin every stop that the sauce goes along the way. So if I make the sauce, I ship it to my warehouse, it gets checked out space, they charge me money for that, right? I pay for the shipping.\r\n\r\n\r\nNikolas Hulewsky (32:35.073)\r\nInteresting.\r\n\r\n\r\nScott A Zalkind (32:55.274)\r\nThen my warehouse charges me to check it in. When I pick up the sauce, they charge me to check it out. So there's little nickels and dimes off every bottle for every transaction. So if somebody wants a 20 case order, they're gonna pay closer to straight wholesale because I have to make up what I'm losing and all those little parts that are chipping away at the price. Whereas if they're getting it straight from my kitchen, I have it shipped straight from my kitchen to them, I can afford to give them a better price because I'll just knock off.\r\n\r\n\r\nNikolas Hulewsky (33:14.006)\r\nRight?\r\n\r\n\r\nScott A Zalkind (33:23.496)\r\neverything I would have lost along the way, that's the price they'll get. And so I have several customers now that take advantage of that and buy 50, 100, 200 cases from me. And they're willing to take on that amount of product. Fortunately, it has a two year shelf life and my products are fairly popular with their customers so they don't get burned on, know, no, the sauce all went bad while I was sitting here. It's a good long shelf life and they have enough, they can move it.\r\n\r\n\r\nNikolas Hulewsky (33:46.315)\r\nYeah. That was going to be one of my questions is like, okay, if everything's as organic as it can be, how long is the shelf life? But two years, that's that's a really long shelf life. What? How much revenue did you do last year? Can you tell me like top line?\r\n\r\n\r\nScott A Zalkind (33:59.999)\r\nLast year, I'm trying to think off the bat. think I did around, I want to say everything aggregated close, gross, probably close to 370, somewhere. I probably spent 340 doing it, you know.\r\n\r\n\r\nNikolas Hulewsky (34:12.447)\r\nOkay, so of the three.\r\n\r\n\r\nNikolas Hulewsky (34:17.697)\r\nHey, welcome to Entrepreneurship.\r\n\r\n\r\nScott A Zalkind (34:18.78)\r\nI'm not. not Tabasco, right? I'm not the most you know, it's funny. That's because I think I think of success. Everyone has a definition right of success. You see me on this camera that your audience won't see me but I'm smiling right now. I'm able to take an hour to hang out with you and talk about because I am happy doing what I'm doing and I'm paying my mortgage and feeding my dogs and feeding myself and I'm saving very little for the future. I'm hoping I can sell my house one day and retire you know I'm\r\n\r\n\r\nNikolas Hulewsky (34:34.783)\r\nYeah!\r\n\r\n\r\nScott A Zalkind (34:48.317)\r\nI'm in my 50s now, so at 65 and 75, I don't think I'm gonna wanna be pitching up a pop-up tent and hustling sauce out of my van and doing whatever. Eventually, maybe I'll sell the business and retire, something like that. So success is sort of in the eye of the beholder, right? And right now, success, mental health and happiness, there's a great parable called The Mexican Fisherman, and I will call it badly, because I'm not great at telling. I don't know you've read it before.\r\n\r\n\r\nNikolas Hulewsky (35:03.457)\r\nsuccess? Yes, I totally agree.\r\n\r\n\r\nScott A Zalkind (35:17.223)\r\nbut it's about an American businessman with his wife who was down in Mexico, and while she was shopping the little town market, he was walking the pier and he saw a Mexican fisherman come in at about noon, pull out a cooler full of fish, he complimented on his fish, they struck up conversation, and he said to him, hey, why are you only fishing half a day? And he says, well, because this is what I need to feed myself and my wife my kids, I'll sell them to the cannery, I'll make enough money for the couple days, and I'll...\r\n\r\n\r\ngo take siesta with my family and then I'll go into town and play music with my friends and drink some beer tonight and then I'll do it all again in a couple days and that's my lifestyle. say, well, geez, you're doing this all wrong. I'm an MBA, I'm an executive in America, I know all about the business world. Here's what you do. You go get, you stay out there longer. You stay out there twice as long, you catch twice as many fish. Now you fish every day instead of every other day. So you're catching twice as many fish, you're doing it three more days a week than you were doing it before and then you can buy another small boat.\r\n\r\n\r\nand pay somebody else to go out and fish also. Now you're doubling that production when you've already doubled it. Now you keep doubling it. Now you have a small fleet of boats. Now you can buy bigger boats and you can catch even more fish. Then eventually you can start your own cannery and cut out the middle man. And then you're really rolling. Now you're going to be turning out tons of fish and making tons of money off it. And eventually you sell the whole thing and you retire a millionaire. And the Mexican fisherman says, well, that's awesome. How long will that take me? So, you know, 20 or 30 years, says, well, what do I do then? He says,\r\n\r\n\r\nthen you can retire and you can go take siesta with your wife and you go into town and play music with your friends. It's sort of this concept of what the value of time, what's defined. That that's what makes me happy. And what do you need to do to make yourself happy? And what I left a job as a project manager where I had a bunch of people under me and I had a ton of concurrent projects all at once and everybody's your boss. And I would toss and turn every night worrying about did\r\n\r\n\r\nNikolas Hulewsky (36:50.935)\r\nAnd he's like, I'm already doing that.\r\n\r\n\r\nScott A Zalkind (37:11.436)\r\nmy subordinate's subordinate sent an email to the wrong person and shit's gonna rain down on me tomorrow. Or did this metric not get met to the project? are we going late on a timeline? is the code on this software project going south? Or do we have to outsource? do we have to, know, all these things and I would toss and turn and I'd sleep two hours a night and I was stressed out in my mind. And when I was a hot sauce hobbyist, that largely took my mind off. I slept like a baby on the weekends because I focused only on the task at hand which was making\r\n\r\n\r\nhot sauce and having fun with it on the weekends and That's why I stopped doing that and started doing this. It wasn't so I can come get rich Give me just one sec. My phone's about to die. I gotta get power\r\n\r\n\r\nNikolas Hulewsky (37:50.091)\r\nNo, you're good. Hey, we're about to get.\r\n\r\n\r\nScott A Zalkind (38:06.595)\r\nThere we go, I'm back, sorry about that.\r\n\r\n\r\nNikolas Hulewsky (38:08.223)\r\nYou're good,\r\n\r\n\r\nScott A Zalkind (38:11.821)\r\nSo yeah, it's a...\r\n\r\n\r\nNikolas Hulewsky (38:13.348)\r\nI like the Mexican fisherman parable. It's a good one, man. So good.\r\n\r\n\r\nScott A Zalkind (38:16.929)\r\nIt's not, you know, look it up. There's a better story online. I don't tell it that well, but it's that's the gist is is is defining that's for yourself really matters because a lot of people will try to define you. And over the twelve and a half years I've been doing this, the number one question I get is, so you get rich, you jeez, you a sauce on how was that must have been a huge windfall. And it was OK. They bought thirty thousand bottles of sauce. The publicity was fantastic. I'd say it helped me survive the pandemic.\r\n\r\n\r\nNikolas Hulewsky (38:21.899)\r\nBut my brother...\r\n\r\n\r\nScott A Zalkind (38:43.64)\r\nBecause when I couldn't do sampling and I had a sign that said, as seen on Hot Ones, that gives you credibility, right? And having credibility gets you into more stores. It definitely opens doors. It doesn't suck. But when somebody says, what's it like watching Trevor Noah eat your hot sauce and say nice things about it? I say, it's the same thing as watching you eat my hot sauce and say nice things about it. But 10 million other people are watching it too. That's the big difference. It's the publicity. It's the exposure you get, right? And so it's not quite the windfall people think, where you're just immediately going to get, now you're a national brand because you're on Hot Ones. No, God no.\r\n\r\n\r\nAnd I hope it never becomes like that. And that's to me, that's the credibility of Hot Ones is that you don't see Tapatio and Tabasco and Sriracha on there. Not that those aren't good sauces, but because if you could buy your way onto Hot Ones, Hot Ones would lose credibility as well. Hot Ones has been wonderful in that they, it's why I was a fan of the show for eight years before I had a sauce on it, is that small batch guys like me, that was their moment in the sun, that they gave guys like us the chance to be on Hot Ones.\r\n\r\n\r\nAnd it's all about the best of the best and the flavors they're looking for. And, you know, when I sent in product, there was no guarantee I was going to get on. I sent in product twice and I'm sure it all went into the warehouse at the end of Raiders of the Lost Ark, never to be seen again, right? with, you know, when they asked for sauce, they asked for three products. I had three shots to get be sauce number two, sauce number four, sauce number six. And they got back to me and said, well, hey, they liked all of them at Complex. Which one do you want on there? And I said, well, geez, the Thai chili pineapple just won.\r\n\r\n\r\nGrand Prize for Tasting in the National Fire Food Show, my friend's art's on it, let's go with that one. And as a fan of the show, I knew that number two kinda gets buried a little because it's not spicy, they kinda talk through it. By the time they get to number six, get a little tasting burnout, so sometimes they don't really talk about, but four is really a good wheelhouse to be in, because that was the first one to light a lot of people up, and sure enough, first one to light up the Jonas Brothers, first one to light up Jay Farrow, first one to light up, Trevor Noting, he just said it danced across his tongue like Fred Astaire.\r\n\r\n\r\nNikolas Hulewsky (40:30.999)\r\nYeah.\r\n\r\n\r\nScott A Zalkind (40:42.309)\r\nAdam Devine had nice comments Halle Berry liked it, you know I had a really good season in terms of feedback seven out of the 13 Yes, gave it like a little shout, which is cool. You know, all I want is a sauce maker is you know that one little little extra where they liked it, you know, and I have a fan of I was bummed Kristen Bell was on my season. I'm a huge Kristen Bell fan I was a huge Good Place fan, which was what she was promoting when she was on there Because you know, it's a circuit they all do hot ones in tonight show and late show and they\r\n\r\n\r\nNikolas Hulewsky (41:09.057)\r\nYeah.\r\n\r\n\r\nHoly forking shirt balls. Yeah.\r\n\r\n\r\nScott A Zalkind (41:13.203)\r\nYeah, great. great philosophical concepts. I want to go back and read the books because they're there even better. But the show is fantastic. And they show you know, the format is they show the sauce. They show them take a bite, then they go to the question. And they showed my sauce. And then they went straight to the question. I was like, what the foot and I'd heard later through a friend of the producer that she's vegan. And my sauce has honey in it. So she was eating cauliflower wings.\r\n\r\n\r\nand there were two sauces that season she didn't actually eat. they didn't cover it. So you know, I was bummed because I wanted to see Kristen Bell eat the sauce. Well, my sauce was still in the episode. They still showed the sauce. The marketing was still there, you know. So no complaints. There's no bad appears on how.\r\n\r\n\r\nNikolas Hulewsky (41:44.087)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (41:49.185)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (41:56.119)\r\nThat's okay. Before I ask my last question, tell me where's the best place for people to come find you and your hot sauce?\r\n\r\n\r\nScott A Zalkind (42:04.836)\r\nSaturday and Sunday in the Bay Area unless it's pouring rain on a little bit of a fair weather vendor these days Saturdays I'm at Oakland farmers market at Grand Lake Which is Grand Avenue and Lakeshore Avenue by Lake Merritt right across from the historic Grand Avenue theater Really nice market about a hundred vendors. They're super high quality same market org on Sundays I'm at San Rafael Civic Center, which is a historic area landmark in that it's the last commercial building that Frank Lloyd Wright ever was the architect for\r\n\r\n\r\nWe're in the parking lot out back of that in the shadow of that wonderful building and there are some 300 vendors at that one every week. I live in a cardboard world so rain is my editor. So back in the day I would go out like Captain Ahab, you know, put up the lucky dog sale while my tent blew back and forth in the wind and I'd be a trooper and do six, seven farmers markets a week. And now web orders and wholesale are up enough that one really have to be out there in those conditions.\r\n\r\n\r\nNikolas Hulewsky (42:41.591)\r\nWhat about online?\r\n\r\n\r\nYeah\r\n\r\n\r\nScott A Zalkind (43:00.327)\r\nTwo, I recognize that it's more detrimental than beneficial to be out there in those conditions. And three, I'd just rather stay home and be warm.\r\n\r\n\r\nNikolas Hulewsky (43:07.883)\r\nYeah, I don't blame you for that. What's your website?\r\n\r\n\r\nScott A Zalkind (43:10.971)\r\nIt's luckydoghot sauce.com.\r\n\r\n\r\nNikolas Hulewsky (43:13.271)\r\nOkay, all right, here's my last question for you. You've been through a lot and it's freaking cool story, right? You start out as a horticulturalist, live in Europe for a few years, come back, decide you're go into IT, teach yourself, go to night school, then you get a job with Kaiser Permanente, work there for 12 years, and then you launch the hot sauce brand. What advice would you give to your pre-entrepreneurial self? Or like, let's just say 10 years ago.\r\n\r\n\r\nor 10 years before you made the leap? Like what advice would you give yourself back then?\r\n\r\n\r\nScott A Zalkind (43:45.213)\r\nYou know, I've been asked that before and I've given answers to that before because I thought I knew what the answer was to that. But you you evolve. And now being asked that question now, I kind of think I wouldn't give myself any advice. I'd probably just go back and let myself have the trial and error that I've had because I've grown from all of it.\r\n\r\n\r\nI honestly have the knee jerk is to say don't just stay in Stay for a big company and keep your benefits and all that because right now the country's a shit show and they might actually successfully ripple with Yeah, which might make it very difficult for me to keep doing what I'm doing. The threat of tariffs are very real Last time we had tariffs glass We had a glass shortage and glass jumped in price and that threatened everyone in my business because it was hard to get glass How do you make sauce that class again? I'm very\r\n\r\n\r\nfortunate that I've built this business model to source locally. So I didn't experience the supply chain interruptions that a lot of companies did who outsource foreign products. But there are still things that come from other places that we can't help. Every label on every product mostly comes on spools, spools of my love to come from China. So if the price jumps on every label on every product, every product can go up just a little bit, right? Well, that means my manufacturing costs could go up a little bit. So I do have concerns, the political climate, I didn't want to get political on this thing, but there's\r\n\r\n\r\nSometimes politics defines you, right? And so it's tough. You can't be apolitical, the world is political. And there are very real threats to what I do and to my ability to be successful. And even in the narrow terms that I'm defining, it is just making a living and being happy. So if I could go back and give myself advice, it might be just to...\r\n\r\n\r\nNikolas Hulewsky (45:19.137)\r\nThat's not a narrow term, man. That is success.\r\n\r\n\r\nScott A Zalkind (45:26.413)\r\nLike sure, there's a lot of T's that cross and I's to dot and little things that I could have learned. Like the first year I mentioned where I had no idea how to price my sauce and what the profit margin should be. And the best advice I'd give young me or younger me would be, you know, price it to where you can make your percentage. You start with the cost of good, add percentage, add on what everybody else is going to take and that's your shelf price. And I think that's it's backwards from what every distributor will tell you.\r\n\r\n\r\nNikolas Hulewsky (45:44.887)\r\nMm.\r\n\r\n\r\nScott A Zalkind (45:53.198)\r\nbecause every distributor wants you to be that the median price. They don't want you to be the most expensive one. They don't want you to be the Porsche. They don't want you to be the Hugo because they want to make more money, right? So they want that that you want. They want you be a competitive price. They'll say, well, fuck that. Be the price to make your nut because ain't nobody else looking out. So that's probably the best advice that give young me is is watch your nut. You need to make a nut to pay your bills. And if you're spending the money to make sauce, know that you're going to lose chunks and chips here and there.\r\n\r\n\r\nand start with what it costs you to make and what margin you need to make from there.\r\n\r\n\r\nNikolas Hulewsky (46:26.311)\r\nI love, I absolutely love that advice. Nobody else is looking out for you and then reverse engineer where you want to get to. do I get to this and just, and work it back? I think that's freaking amazing. Scott, this has been awesome conversation. I appreciate you coming on, Yeah. All right. We'll talk soon.\r\n\r\n\r\nScott A Zalkind (46:33.389)\r\nExactly.\r\n\r\n\r\nScott A Zalkind (46:40.354)\r\nYeah, thanks for having me. A lot of fun. Anytime.",
  "metadata": {
    "duration": "",
    "date": "2025-01-13",
    "platform_source": "Google Drive"
  }
}