{
  "episode_number": "13",
  "episode_title": "How a Random Phone Call Turned Into an $8M Side Hustle with Shannon Jean",
  "guest_name": "Shannon Jean",
  "business_name": "",
  "transcript": "﻿The $8M side hustle\r\n\r\n\r\nShannon, this is a day I've dreamed about for a while. Super excited to have you here. The whole point of the show is to give people a better idea of. Of how to get into entrepreneurship, essentially to make entrepreneurship more attainable for individuals. And so I've talked to a lot of people who've bought businesses and have gone through the SBA process, but I haven't talked to as many people yet who have actually started businesses from scratch.\r\n\r\n\r\nAnd you remind me a lot of my business partner, Chris, your mind is just always going and I'm just excited to talk to you. You always seem to have really cool and new ideas. But the first question I wanted to ask you is  tell me your coolest entrepreneurship story. The one that you pull out at parties. \r\n\r\n\r\nYeah. Number one, thanks for having me here. I like that it's a great intro. I'm a big fan of turning side hustles into business. And I like to tell how I turned a phone call into an 8 million side hustle. And I still do this side hustle today. And that's with high end watches. I know nothing about watches.\r\n\r\n\r\nI know nothing. I don't wear a watch, but. I have relationships out in the, I've had companies that bought store returns and all kinds of overstock and left, end of life, end of season stuff. And I got a call 1 day ago.  And somebody said, man, we have a problem. We lost this client that used to buy this product.\r\n\r\n\r\nWould you help us? Do you think you could help us out?  And, I was very reliable, credible. I paid on time. I never complained, I was buying consumer electronics and different things from this company, all these returns. And I said, yeah, sure. Why not? And that  has led, over the last 7 years, I've sold 8 million worth of high end watches and.\r\n\r\n\r\nSo that's a fun story to tell. Cause people, the numbers are big and the watch thing. Yes. It's okay. Off of 8 million. What's your net income off of the 8 million now? So that, yeah, that's a good thing to bring up because it's also a lesson where I always try to let people make money off of me.\r\n\r\n\r\nIf I'm in the middle of something. And so I had to find it, it was like taking a drink out of a fire hose when I took on that deal, because it was massive. Massive. And  I didn't know that there was, I wasn't worried about the risk as much because the price points were pretty good, but I didn't have any, I went against my Cardinal rule of always having a buyer before I bought, because I was just trying to make this supplier happy.\r\n\r\n\r\nI basically scoured eBay, found every watch seller. I could start reaching out, making 87 phone calls until I finally got somebody that didn't think I was nuts. And they flew out the next day and I had, I'd already bought the first deal. I had no choice. And this Big Russian Chechnyan bodybuilder dude walked into my office and laid everything.\r\n\r\n\r\nI had everything laid out and didn't talk a lot. Shannon, show me the watches. I need to see the watches, please. Exactly. He got on the phone to his partner, Dimitri, and he said, yes the deal is good. And so they wired me the money and we've had a handshake deal for, I've sold to this customer for I don't know, eight or nine, 10 years and You've done a lot of business together.\r\n\r\n\r\nIt's been great. That's amazing, man. Again, just hearing that story makes me think of Chris. Yeah. And to answer your question,  it's a small margin. We're talking single digit numbers, but significant because I manage the relationship. I help with cash management, logistics, and that kind of thing. It's much more than just being a broker.\r\n\r\n\r\nI don't have, I'm not a big fan of brokers that don't add a lot of value. I add a lot of value. And by doing that, I left enough money on the table for Dimitri to build a business around this product and to put the money and time and effort that I could never build into a consumer facing watch business.\r\n\r\n\r\nI don't know anything about it, but I can watch the relationship between  just the kind you would think of: Rolex, Philippa tech, Rolex, Omega, Philippa tech again, I don't know anything about watches. I look at the list, I manage the relationship and I buy, this is a company I've bought tens of millions, maybe hundreds of millions of dollars worth over the last 25 years. \r\n\r\n\r\nSo if there's a specific watch I wanted, could I come to you and get it for cost?  No,  I'm not in the watch business.  I'm in the relationship business, man.  So I go out to New York, I meet my client and yeah.  What a cool way to frame it. I like it, I'm not in the watch business. Yeah, I'm not. No, I'm not.\r\n\r\n\r\nIt's just like I started, I did an experiment on my phone. I wanted to start a business after I sold tech restore. I wanted to get out of the tech space and I was like, what's the most opposite thing I could sell and it was handbags. But I wanted to see if I could start a company just on my phone. \r\n\r\n\r\nI don't know anything about handbags.  I know about the Delta between, what you buy, what you sell. And what I learned was handbags, maybe like watches. It's an emotional selling, it's like an unfair advantage. And so I started this business.  Grew like crazy, found a marketplace to sell on, found some, took him about a year to find suppliers.\r\n\r\n\r\nYou're running through this really fast. You decided I want to start a business on my phone. First of all, I love guys like you because goals like that are nuts and I would never do that, but I love hearing that like that. There's like this internal motivation.  Why on your phone?\r\n\r\n\r\nWhat does that mean? You wanted to start it on your phone. Everything's done on the phone. Yeah, I wanted to just see, I have podcasts and I was having guests on some young guys and I had these guys that started a business selling these selling some silly bracelet, but they were killing it.\r\n\r\n\r\nAnd it was all on social media, social commerce. I didn't even know those two things were a thing when I had them on the show. And I was like, I got to get into this man. And. I got to figure this out because I'm old school entrepreneur and e commerce, everything's, but social, I didn't know anything about.\r\n\r\n\r\nSo all the apps, social apps and marketplaces and stuff were on, everything was on their app on your phone. So I figured, okay, I'm going to build this whole thing, just using my phone as an experiment. And I'll talk about it on the podcast.  I started buying, it's,  and I made lots of mistakes because that's tuition and I created my own curriculum so I could learn how to sell.\r\n\r\n\r\nI didn't even know what I was going to sell, but I learned that handbags had this crazy margin and that sounded and every woman around me lost their minds once I started buying it. So it's there's something here. So that's interesting to me. Okay. So you had the thesis. I want to start a business on my phone. \r\n\r\n\r\nAnd then what you started searching and thinking, okay, what's something high margin or what's something popular? Like, how did you land on handbags?  Small size, high dollar,  low competition.  And what it turned out with these marketplaces, like one of the marketplaces I sold on there that I probably sold the most on obviously eBay, but Poshmark.\r\n\r\n\r\nAnd there was some other ones that are out there around Vestiaire and some other ones. Primarily casual sellers  that have not been in business for a long time like I had, didn't Systems in place, customer service, marketing,  the way to handle imagery, photographs, I have all that. So my competition was, the bar was pretty low.\r\n\r\n\r\nSo once I got involved, like on Poshmark,  I took, again, it took me 10 months, 12 months to really get a good supplier. But once I found him, it was great.  All of a sudden I sold like a million dollars worth of handbags on Poshmark.  And they called me in a year and a half. Like a year and a half. So they called me and were like, Hey, would you come out?\r\n\r\n\r\nWhat's what are you, what's going on? How are you doing this? Yeah. So I went to their headquarters, I met their CEO and we sat there and talked and then  I I was helping them give them back feedback. This works. This doesn't did a bunch of stuff for them. It was great. We had a great relationship when they gave me access to their IPO because I'd helped them so much.\r\n\r\n\r\nThat's awesome. It was awesome. Yeah. So it was a great experiment and then I sold on other things. So I like to experiment. And see if this stuff works or not. That's what drives me. Were you white labeling the bag or were you wholesaling? What was the, no, I was  doing B2C, but I was selling, no, not my bag.\r\n\r\n\r\nI was selling Prada, Louis Vuitton that's all the, I was buying authentic bags, store returns  from an e commerce business. That didn't want to put them back on their shelf. And I went in, I flew out, I, I swam upstream for eight, eight months or so before I found a great supplier, because that's the, you make your money on the buy side.\r\n\r\n\r\nIn my business, I'm a buy sell guy and all the profit is made on the buy. That's where all your efforts should be. That's what if you buy, the sales just follow. It's that's not the difficult part. And people miss that. I think a lot of people miss that. I want to be priced right. And I wasn't sure even after eight months could, does this business work?\r\n\r\n\r\nBut once I found that supplier, it opened doors for me for other ones too. Okay. So  I know I keep comparing you to Chris and I'm sure you guys are different in many ways, but in many ways you're similar. He's way smarter than I am. I think Chris,  he's smart. Yeah, he's smart. I don't know that he's smarter than you, but he's sharp, dude.\r\n\r\n\r\nYeah. But Chris has a very, at this point kind of refined  framework for identifying opportunities. He's never written it down, but I know him well enough that I'm like, Oh, okay. This is a Chris opportunity because I like, I've distilled  his frameworks. He looks for things where there's underutilized marketing channels.\r\n\r\n\r\nSo like he, he utilizes Reddit in particular, but Twitter really well. And then he utilizes, he looks for opportunities where he can utilize off market. Leads it, whether that's lead generation through texting or voiceless ring drops or those types of things. And he looks at home services businesses is like, Oh, this is a gold mine or trying to grow a newsletter in creative ways, et cetera.\r\n\r\n\r\nWhen you're looking at an opportunity and evaluating an opportunity, because you've had 10 businesses that you've owned, you've sold for, you've made, a million dollars plus in multiple different ways.  What's your process for identifying whether or not something is worth your time to invest in? \r\n\r\n\r\nYeah. He's said, he's way more sophisticated than I am. For me, it's energy. I love experimenting, trying new things, but at some point  in the beginning, you have to put the energy into it. So if I get an opportunity, it's okay, let's.  I don't know. I've owned, like I had a similar business than Chris, an iPhone business and I start poking at it.\r\n\r\n\r\nIs there money here? I do research and all this kind of stuff. Look around who's in the business that yeah, that's all table stakes.  What I'm looking for is the transfer of energy back at some point during this trying to prove your thesis and do all this research, the idea, the concept, the business needs to start giving you energy back.\r\n\r\n\r\nYeah, that's how I know. It's going to work. It, once I start getting energy, it's, I could talk about X right now, like I'm building on X and it's giving me energy. Now, the first few months I was like grinding. Then I met you guys were doing nuts, but now I get the energy back.\r\n\r\n\r\nSo X is feeding me. So I'm like, okay, great. Now I'm going to hire an employee to help me grow this. And I'm going to do this. I'm gonna start a business here. So the energy is crucial for me. That's the signal. Yeah. Everything else you can figure out. I can hire somebody. I'm not as sophisticated as you guys.\r\n\r\n\r\nI, I can just bring in people, partner with people that are smarter than I am in those areas to help me.  Do you have a tech stack or anything that you're like, okay, this, these are my validation tools. Obviously you go through that moment where you say, does this give me energy or not? But is there your go to of like, all right, now I'm going to validate whether or not this is a real business.\r\n\r\n\r\nAnd these are the things that I use.  Yeah, I do have a tech stack, but it's the context is different for every single thing I do. Once I found, since I'm a buy sell guy, once I learned about Terrapeak, it changed my life because I could track what  Yeah, they got bought by eBay now, it's part of eBay. So when you become a certain level of seller, you get access to Terapeak data.\r\n\r\n\r\nAnd, eBay is the biggest market maker in the world, right? Other than Amazon, but you can get access to Amazon data through Jungle Scout. And that's another Piece of software that you should use. Same with publishing a book, you can use publisher rocket, and that tells you how many books you have to sell in 24 hours to become a bestseller.\r\n\r\n\r\nSo  Tara peak  tracks, the data real world, not what things are for sale for what they sold for. And I've always lived in this secondary market, this kind of gray market, which I absolutely love because there's massive inefficiencies,  tell people, I'm like, do you want to sell shoes?\r\n\r\n\r\nCause I can show you how to make millions of dollars. If you want to sell shoes or if you want to sell whatever, just pick a, I posted today about home Depot  truck, truckloads of home Depot flooring. That's selling for, 8 cents on the dollar. You can figure that business out, but then you have to go,  what is it really selling for in the real world?\r\n\r\n\r\nAnd that a tool like Tara peak does that. And in every market, there are tools like that. Chris is. Cobbles his stuff together and seeing demand and all that stuff. You could buy cell phone data. If you're going to be a location, I've always been an online guy or a.  The biggest part is my relationship stack. \r\n\r\n\r\nI know who to call, when I want to buy,  meet somebody, let's say like when I wanted to buy from Best Buy I knew somebody at another company that could introduce me to somebody at Best Buy and I could talk to them and say, Hey, I want to buy the stuff and how do I get involved? And what's it, What's the process.\r\n\r\n\r\nAnd so I'm,  yeah, that, that's more important to me than the tools because  I'm good at that. I'm a relationship guy. Do you, you prefer products over services?  Like you prefer buying a shoe or I don't know, toothbrush or whatever else you sell online versus I think you're the first person who's ever explained market inefficiencies to me where I clicked in my mind, right?\r\n\r\n\r\nIt's I'm just thinking about these millions of transactions that are happening on eBay and Amazon, and you're going and getting pay data or pay your data, pricing data, whatever it is. And you're just looking, okay, where is there incongruence between what they're selling for and what the market wants?\r\n\r\n\r\nIs actually, and you're going and buying those and you're just making a margin there, right? Like you're opportunistic in your entrepreneurial endeavors. Yes, I am. That's exactly what I am. So when Apple invented a color laser printer let's go back. And  we were trying to learn about, this is with my company rescue systems.\r\n\r\n\r\nWe were trying to learn about, we started getting these printers in and they would have oil contaminated all over to them. So all over inside. So we did a little research, found out there was just, it's a beautiful  device. But there was just a tray of open oil in there. So when anybody moved it around,  the oil would just go everywhere.\r\n\r\n\r\nAnd so all of a sudden I started getting calls and I was like, can we fix this? And it's a massive undertaking, but I had 20 in 20, maybe 10 interns at any one time in this repair, big repair facility we had.  So we started buying truckloads of these color laser printers. And going through, you had to strip literally, it's like taking a car apart.\r\n\r\n\r\nYou take every component out and clean it and then put it back. Tell me what is the truck? How  big is the truck load? How much money is it? Depends. Yeah.  14, 8, 22 pallets, depending how big they are. Okay. And I was probably a few hundred of these at a time. Maybe you probably get a couple hundred.  In there, but I was paying like 500 for this printer,  but when we were buying them for 500 bucks, because they were worthless if you're listening at home, I'm using quotes in the air,  but it was like an 8, 000 printer and we could buy them for 500, fix it for 500 bucks, maybe, and sell them for three to 5, 000, huge,  that's an opportunity.\r\n\r\n\r\nAnd I did that over and over with, I wrote the wave, like Charlie Munger always said, find a wave and ride it. I wrote Apple's wave for 25 years until they, it just got, it was less and less stuff to fix less and less, when laptops were hot,  we won't, we were fast. We could repair laptops really quick, but we were local. \r\n\r\n\r\nBut then I got, I met a guy at DHL and they were, they came and said, Hey, we're going to buy this company called Airborne Express. They're all over the U S it's great. And he's we want to roll out products with them. Could you do, I said, great, put a, put our box in every van in the United States.  And he's what's that?\r\n\r\n\r\nI said, cause then I can pick up your laptop. You just make a call. So we developed a program with them where they had our box and every DHL truck in the country. So if you called us by 2 PM, we picked up your laptop, overnighted it to our repair center, repaired it the same day and send it back to you overnight. \r\n\r\n\r\nAnd wow, it was awesome. And they covered a huge chunk of that cost because they wanted, they wanted these programs for that. But it's relationships and the inefficiency in the laptop market was, there was this was a long time ago. There was no Apple store. There was no localized repair that was reliable.\r\n\r\n\r\nSo we're like, how do we make it local? And we just, backed in the shipping costs. This is why I always talk about our shipping bills for a quarter of a million dollars a month. And so we paid him with credit cards and got the miles. Chris and I are very different. My income has always been fairly steady.\r\n\r\n\r\nI've had peaks obviously because I sold businesses, but like my income has been fairly steady. Chris, on the other hand. Has had years where he's made a million dollars and years where he's brought no money in, right? Because it's been almost feast or famine. And I've seen things on like Twitter or Instagram where it's talking about the lion or the lion mentality.\r\n\r\n\r\nIt was like the lion lays around for 15 hours a day, but for the 20 minutes that he's active, that's when he goes and gets the gazelle and kills it for the pride, right? It's be a lion just waiting, stalking to pounce. And that's not me. I'm not just, I'm not the lion. But it strikes me that you and Chris are similar in that vein where  you just have you see an opportunity and you go a million miles an hour to take it down.\r\n\r\n\r\nBut I'm curious if, have you had lumpy years where it's like, cool, one year, I make a ton of money one year. I don't make much of anything. Or have you been fairly  Okay,  is that not stressful? Yeah, you could get my wife on here and talk about that. We've definitely, it's definitely very stressful, but I will say after a while, after our 1st or 2nd company,  we kind of normalized revenue.\r\n\r\n\r\nWhere, I just got a paycheck from company X and then once that was fulfilled, and I had a good general manager in place, then it allowed me the freedom and the confidence really to go experiment and, Take bigger leaps of faith and try to start a different company or buy a big deal.\r\n\r\n\r\nAnd I've lost tons of money. Just come follow me on X. You'll see, I post, I lost a million bucks on one deal and I had to pay it back, and it took me five years to pay it back. So  it,  You definitely it's definitely ups and downs the risk, it's never seemed very risky to me.\r\n\r\n\r\nRisky is working for somebody else, in my opinion, and letting them control your fate. And but yeah, I'd say it's up and down, but I'm not, I wouldn't say I'm like the lion thing. I needed to cover my bases 1st.  And we always lived well below our means for a long time to make that work. And then I felt confident because I knew the bills were going to get paid and  I was going to be payroll and all that kind of stuff.\r\n\r\n\r\nAnd then I could just swing for the fences when I had, once I had those bases covered. And Chris and I have talked a lot about this. I think there's some people, Jeff Bezos, but let's just use his, him as an architect  who are good being in one business for their whole life. That's what they do.\r\n\r\n\r\nAnd they become a billionaire because they're focused and they do the same thing every single day.  As Chris and I talk, we're like that we don't find a lot of joy or fulfillment in that we find joy and fulfillment in the variety of things. And  it may be that Chris could have been much more successful or I could have been much more successful.\r\n\r\n\r\nHad we started something 10 years ago and just stuck with that one thing over the past 10 years. But for us, it just wasn't as fulfilling. Do you feel the same way or do you look at it differently when you approach?  What businesses or how you're going to spend your time. Yeah.  Number one, I would say Bezos is not in this one business, right?\r\n\r\n\r\nLook at Amazon. I agree. These guys are nuts as far as all the different stuff they get into. But to your point at probably, yeah, there became some point where I really only wanted to do stuff that was interesting to me.  And  my wife used to tell me when we had, maybe it was when we had some of those down years, she's you could be successful working for somebody else. \r\n\r\n\r\nThere are corporate people that make a ton of money. And I was like, ah, that sounds miserable. I can't wear shorts every day. I can't bring my dog to work. I can't do all these cool things that I like to talk about. So I'm a huge  proponent of story  crafting my story.  Has been very important to me and has driven me and I've done it in reverse where I thought about what do I want my story to be? \r\n\r\n\r\nAnd  now that I'm older, so I'm in my mid fifties I think that was right for me because I can talk about all this crazy stuff and people are like, what? You just had that happen. So I wanted to live this interesting and uncommon life. And the only way I knew how to do it was.  To go do different things and to figure out, could we make money at that?\r\n\r\n\r\nAnd again it's easy to sound very successful when you're talking about the past. Yeah, I've been successful, built some wealth and stuff in very unconventional manner. But I've made, I've tried to buy all kinds of stuff that never worked, but that's the only, that's the tuition, that you figure out.\r\n\r\n\r\nMaybe you bought.  Six different, I could tell you stories that are miserable. Talk about those first few years before you had your basis covered. How did you think about balancing what gave you energy or what you're passionate about with just getting enough money to pay the bills? Cause you've got a wife.\r\n\r\n\r\nYou've got, I think you've got four kids, three kids,  two kids, two kids. You've got kids, right? So you had bills and things that you needed to cover until you got to that point where you were past the threshold. Yeah. How did you balance that stuff? Yeah, that's a good question.\r\n\r\n\r\nIt's think back that far like it's like having little kids, you soften the edges, right? Yeah. That's how, what a nightmare it might've been.  We'll talk about the first business then talk about that. Like one of the first businesses. So my first business was a company called Mac rescue.\r\n\r\n\r\nI had a business before that had a construction company, but then during college, then I, but my first one that really took off,  I had pretty small ambition. I just wanted to be involved in that industry because I fell in love with the Mac. It was just the truth of it. And I was like, gosh, man, if we could make a living. \r\n\r\n\r\nWe're being involved with this space. Wouldn't it be amazing? And I had found a guy who literally was a rocket scientist and I was like, come with me, help me. We'll figure it out. And so we just started and my wife had a job, so we lived on her, w two  succinctly remembered being like stoked that I could take 500 bucks a month out of this company.\r\n\r\n\r\nWhen we first started and that once we had enough money and then it took off and I didn't, it grew in a different manner. That's a whole nother story, but I was thinking we would have a, a series of repair centers and open local businesses all over the place. But then the internet really took off and I was able to meet people all over the world and realize.\r\n\r\n\r\nThis much greater opportunity. So it grew, that grew pretty slow. And we moved our business every year, until we got a building. Yeah, it was hard, but I didn't know what I was doing. Like you said, you were stoked to have 500 a month out of the company. Was it successful because your ambitions were low or was it successful because you had to make money quickly?\r\n\r\n\r\nMy ambitions were never low. That's not what I mean. But had to make money quickly. Burn, monthly burn. I probably is like the better. It had to work. I had no alternative.  I could not work for someone else. I'm patently unemployable. And so if that didn't work, I would do something else. And so  once it started to grow in a different way than we anticipated we pivoted, we stayed in the industry, but I won't go down that rabbit hole of what, how it exactly worked, but  then I realized my strength was really in relationships.\r\n\r\n\r\nAnd I had a partner whose strength was in the tech business. Side of things, rocket scientist and it, yes, the rock scientist. And it grew and grew. And I was a kid and we were doing a quarter million a month. And I was like, this is amazing. Had to talk her by the tail.\r\n\r\n\r\nYou can never make a mistake. Everything is up from here, and then I met my attorney when we finally got one, he said, Hey, don't get too cocky because I've never met anybody who's made a lot of money that hasn't lost a lot of money.  That's right. But we recovered and then you keep going.\r\n\r\n\r\nDid you ever have a conversation with your wife that was like, Hey, look, honey,  if by X date, we're not doing. Why revenue or, what, whatever the goal is, I'll go get a job.  Was it like, was that, was there ever a conversation about Shannon? You like, we got to make money for this family.  I love that you're chasing your dreams.\r\n\r\n\r\nThat's great. If you want to be an art history major, that's fine, but I need you to get a job. So you can contribute some income. No I often post up on exit. The right spouse is a force multiplier. And that in my life has been so true because she, my wife, Renee, she believed in me. And, she always,  I've always had  a certain skill set.\r\n\r\n\r\nI was doing deals, buying storage lockers with. My wife before we were married, college, going to storage auctions and buy them. Yeah. So she saw that I had the ability to make money. Now,  did I have the ability to build wealth? Those are very different skills, right? She's probably better at that than I she knew how to take money off the table and I've never wanted to take money off the table.\r\n\r\n\r\nI always want to just dump it back and put it back on black. Grow. Yeah.  Yeah. And that's not the best , that's not the best way to build wealth. Yeah, my wife is very different than that. She's very different than me. She's German and she's does the trains for run on time?\r\n\r\n\r\nOr is the trains if we not run at all and,  and yeah. And like even now, I've sold a couple companies in the last few years. And in February is the first time I've ever not had a job paying me W 2 income, even the companies that I owned. I took a W 2 salary out of those companies.  And she's okay, what's the end date?\r\n\r\n\r\nWhat's the end date where this isn't working or you don't have X level of income. And that's always just been a part of the conversation in our married life. For me, she's been a force multiplier because it forces me to have an end date. If I didn't have the end date I'd just be, yeah, I was just gonna say that.\r\n\r\n\r\nI'd be lollygagging. Yeah. So I don't think it's necessarily good or bad to have a spouse who's one way or the other. It's different. Yeah. I it's for you whether or not you have the right spouse to, to support you to achieve those things. So I just find it fascinating to hear other people talk about Yes.\r\n\r\n\r\nKind of how their spouse supports them. Yeah. Support is the way it, it could be in. Different methods and you need to be pushed. There's definitely, there's no doubt about it. I'm yeah, I need to be pushed. I want to, I've been married for 30 years. It'd been with my wife for 36 and I'm still trying to impress her. \r\n\r\n\r\nSo I'm trying to achieve things that she thinks is great. I'm trying to create a great life for her selfishly because I think it makes me look like a better husband.  It does, but I'm driven by, I want to, maybe that's my ego. I don't know, but it works. It's a system that I want my wife to drive a nice car.\r\n\r\n\r\nI wanted my wife to have a beautiful home. I want my kids to go to amazing schools. I want them. To learn to be self sufficient, but not want for things I want to do, all these kinds of things that has driven me to try these new things and experiment. And now I'm in the position where I love it because.\r\n\r\n\r\nMy kids are like, Oh, my dad's doing this crazy thing. What's going on with it now. And, I can have fun with it because I've reached the other side of the grind, so it's cool. I'm going to ask you some some rapid fire questions. Is that okay?  Yeah. All right. One thing that I really liked that I've heard you say you sent this to me in the loom that you sent over is that your mom taught you to push through everything.\r\n\r\n\r\nAnd that reality is flexible and that you're in control of everything around you. How did she teach you that? And how do you think about teaching your kids that? Yeah, good question. It she taught me by example, by, she knew the Grant Cardone text 10 X, back 20, 30 years ago of how to push.\r\n\r\n\r\nAnd as a woman achieving more and doing things. And she just opened the world to me with comments like that was like, Yeah, of course, you tell your kids you can do anything you want, but she showed me how, just by example, it's oh I'm going to do this. We're going to, we're going to move to this nice area.\r\n\r\n\r\nYou're going to live here. And I was like, rad, I was a little kid, whatever. I didn't know it mattered where you live. She did. And we did, we got there and did all these kinds of things. And .  The part about the reality is flexible. You are in control of it around you by your attitude, the people, your network, who you hang out with all those kinds of tricks, right?\r\n\r\n\r\nThat people talk about.  And I guess with my kids is I've just involved them with our lives. They've worked. My daughter's worked with them. At our businesses when all she could do was put stickers on lollipops that we were putting in boxes. My son countered inventory when I was like, somebody else is going to have to go confirm that because, you're getting them involved, they would come after school and when they wanted things, I'd be like, great, let me show you how you can do that.\r\n\r\n\r\nMake money so you can buy that and you can do this. And so they're very they're very uncommon thinkers and very, they're both very different, my son and my daughter, but yeah, so I think the best way to do it is by example, because if you just tell them and you don't do it, they see right through it.\r\n\r\n\r\nI love that. I love that. They follow, they're watching you and their eyes are on you 24 seven. All right. What do you love about business? Or being an entrepreneur. I love the zero to one part the most starting from nothing and then creating something or solving some problem. It feels so empowered. It's it feels great. \r\n\r\n\r\nAnd I love it's to sound really bad, but I liked it. Not everyone can do it.  Chris is the same way. I don't know what that says about me, but I like salt. I like solving the problem and I like telling a story. And if you tell a story to civilians, they're like, eyes are like, what? You drove a 45 ton crane down the coast of California.\r\n\r\n\r\nWhat? You bought 8 million worth of what? It's so I'm like yeah, it's totally normal, but in the outside, it seems exotic. And I guess, and that's fun. It's fun to play with. So I love that about my business. What do you hate about entrepreneurship? \r\n\r\n\r\nI hate accounting. I'm not a bottom line guy. I try to solve. I try to solve most problems with more sales and that doesn't, that works a lot, but not all the time. Okay. And I've had to surround myself with people  that can help me with that. And sometimes, most of the time, fortunately that's worked great, but there's been a few times where it hasn't worked and I've been taken advantage of and that I don't like I'm the same way.\r\n\r\n\r\nI'm very trusting. I do accounting and I do getting the math, right? Yeah. I can tell. I know you are, but I'm also too trusting. And I'm like, okay, if somebody has a handle, they have a handle and that's come back to bite me a couple of times. Yeah! So \r\n\r\n\r\nI like to ask this question because. \r\n\r\n\r\nReal estate guys are always jealous of business guys. Cause they're like, Oh man, it'd be nice to own a business that's producing cashflow that I could actually grow. And then business owners are jealous of the real estate guys. Cause they're like, man, it must be nice just to have a real asset. That's appreciating steady Eddie that I can always count on for you. \r\n\r\n\r\nWhat industry or business type are you the most or position? Are you the most jealous of? Probably the most envious of commercial real estate because I've seen how good it can be. And it's, the systems are relatively, and I'm coming from the outside. But the systems are so much less complex than on a residential, you've got a concrete box and maybe a bathroom and some offices or a warehouse or something like that.\r\n\r\n\r\nAnd I've rented those kinds of things my whole life. I wish I would have been pushed more to invest it much. It's difficult in California. The numbers are really big, but when I was younger had. I've been pushed more and been smarter. I would have bought more commercial real estate.  Yeah. This, everything, the appreciation, there's just so many, I think you need a balance.\r\n\r\n\r\nI think you need most or you need both. You need, I own real estate now and it, you need it to offset the revenue from your businesses and the income and it makes a lot of sense. All right. Last question. What are you obsessed with right now?  I'm obsessed with X right now. Tell me more.\r\n\r\n\r\nI blame you. I'm obsessed with I have a whole new audience to tell these stories that my wife is tired of hearing. And cause she lived it. So it the dopamine hit is real, you get to talk about these things. And so I'm learning to like you, I want to make entrepreneurship very accessible.\r\n\r\n\r\nI, I believe it's less risky than working for other people. I'm writing a book called escaping employment. That's all about. and not to get stuck in the trap that most people do. Cause it's much easier to get involved in entrepreneurship when you're younger. I believe I'm a builder, not a guy that buys businesses.\r\n\r\n\r\nSo that all lends itself really well to growing on a, an audience on X and, doing some coaching. And I had a great call before this and, helping people out and having people, we all want to feel important. We all want to feel needed and we all want to be seen.  And I feel that way now, and I'm, I'm all in on it right now.\r\n\r\n\r\nSo I'm having a great time. Yeah. You've grown a ton  even post, the growth madness.  What do you attribute that to? I it's interesting because now that I know you a little bit better. And I know you like to find the inefficiencies and it's almost like you, you turn it into a game where you're like, Ooh, there's an opportunity here.\r\n\r\n\r\nI think I can do this better than somebody else. And I'm going to go make some money. There has to be an aspect to Twitter that sort of triggers that in your brain.  What is it?  Yeah.  I think it's the,  it is a challenge. I think it's the two things it's authenticity and serendipity, right? You have to be the truly who you are.\r\n\r\n\r\nAnd it took me a while to get into that and share more of my story and talk about failures and stuff like that. It took me a little while. But once I got into that,  I think it did attract people and, I've gone from 500 followers to 7, 000 in, I don't know, three and a half months or something.\r\n\r\n\r\nBut I'm learning there's value followers and virality followers, right? It X is crazy and always changing. I post about a. A quick post about a truck. I like, and you get 375, 000 views. And then I put something together that I think is super valuable for entrepreneurs and want to help.\r\n\r\n\r\nAnd you only get 2000 views. So you don't know what you're doing.  So that is the challenge. And  the collaboration with people like yourself. I never would have met you. I never would have met all these guys that I talk with every day. And that we take it offline. We help grow our businesses. You and I talked about, you like, you got two minutes, jump on a call, talk about something, help each other out.\r\n\r\n\r\nI would have been  incredibly more powerful and more successful. Had I had this sort of network 10 years ago, 20 years ago.  Yeah, it would have been amazing. That's awesome. Shannon. This has been awesome. We're going to do this again because I could ask you questions all day long. It's fun. It's fantastic.\r\n\r\n\r\nThanks. Have a great time talking about what's the best place for people to find you.  Probably on X, just my name, Shannon Jean, S H A N O N J E A N and hit me up in DMs. You have questions. What's the name of your podcast? People want to go look for that  Business Brain. And it's it's the collective, all of our business brains who are going to grow together.\r\n\r\n\r\nAnd we live stream it on X. Now we publish on Wednesdays and Fridays, the episodes come out and podcast app. Awesome. Yeah. We'll talk later. Thank you, sir. Thank you. Yeah. I appreciate being here. Okay. Love talking about it. See it.",
  "metadata": {
    "duration": "",
    "date": "2024-05-28",
    "platform_source": "Google Drive"
  }
}