{
  "episode_number": "164",
  "episode_title": "Building Beehiiv into a $300 Million Dollar Business with Tyler Denk",
  "guest_name": "Tyler Denk",
  "business_name": "Beehive",
  "transcript": "﻿Tyler Denk (00:00.11)\r\nWe should do that.\r\n\r\n\r\nNikolas Hulewsky (00:01.332)\r\nAll right, Tyler, instead of asking you the same question that you're always asked on every podcast, I'm going to summarize your journey and then we'll jump into it. Tell me if there's anything I missed. So you are the co-founder and CEO of Beehive and that is a newsletter platform or was you're kind of becoming more broad than that, but you currently process over 2.5 billion newsletter impressions a month and you have an ecosystem of about 350 million unique readers. You founded this company in\r\n\r\n\r\n2020, you've raised about $50 million and you're currently paying more than like a million dollars a month to creators on your ad network. Did get that all right?\r\n\r\n\r\nTyler Denk (00:40.418)\r\nLast part, caveat, we are close to a million on the ad network, but if you include the paid subscriptions and boosts everything else, we're paying multiple million per month to our publishers.\r\n\r\n\r\nNikolas Hulewsky (00:43.24)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (00:53.268)\r\nHow old are you?\r\n\r\n\r\nTyler Denk (00:55.0)\r\nGood question. 31.\r\n\r\n\r\nNikolas Hulewsky (00:57.684)\r\nOkay, so here's my question. What's taken so long? You're already 30, so why aren't you more successful?\r\n\r\n\r\nTyler Denk (01:03.15)\r\nWell, if you heard me start off by answering a question, I almost said 29. I forgot how old I was.\r\n\r\n\r\nNikolas Hulewsky (01:09.82)\r\nIt's funny, tangent there. So let me ask you this question. So I did read you're about a million dollars paying out to creators and you're currently generating about $1.5 million a month as of 2024 December. That's what I read. Let's say that those numbers are true. A million to creators, 1.5 million in revenue. Is that 1.5 inclusive of that 1 million you're paying out or are those two separate numbers?\r\n\r\n\r\nTyler Denk (01:36.808)\r\nseparate numbers and today we're actually closer to two, two and a half million a month in revenue. So the numbers are a bit dated. But yeah, we're generating a little bit over $2 million a month right now. And then the money that we pay out to creators is not a part of that\r\n\r\n\r\nNikolas Hulewsky (01:53.008)\r\nSo what's it like building a business where your customers are almost are making almost as much money as you are from the business?\r\n\r\n\r\nTyler Denk (02:00.842)\r\nIn, aggregate, yes. And like, it's all that, that's like, that's like the name of the game, right? For that's where I get a lot of passion out of what we do because it digs both ways, right? People, if something goes wrong or if we ship a bug, people are very passionate about why something isn't working because it's not just a hobby for a lot of these people. It's like their full income and living. And so the fact that we, like I pinch myself every now and then and talk to my co-founders where I'm like, we built a platform where there's non-negligible like\r\n\r\n\r\nNikolas Hulewsky (02:02.461)\r\nYeah, it's crazy.\r\n\r\n\r\nTyler Denk (02:30.292)\r\nseveral thousand people that have built an entire business that supports themselves and their family on the backs of like this platform that we created four years ago. And so I think that's really cool. And I think a big part of my job is being able to effectively convey that story to the broader team of we're not just sending emails. We're not just adding like a new shiny feature that people use. Like people depend on us to pay the bills, to send their kids to college, whatever it may be. And I think that added a bit of responsibility.\r\n\r\n\r\nadds a lot more purpose behind what we're building.\r\n\r\n\r\nNikolas Hulewsky (03:01.972)\r\nWell, I think it's really cool. Because anytime you build a business, I build multiple businesses, and you have people that are working for you, and you see, you know, I have 130 employees. But then you start thinking about, man, that person's the breadwinner for their family. Like, not only do they depend on this job, like they depend on me to do good things. Anxiety inducing. But there's the flip side, which is also really cool that you've created something of value. I don't know, do you think about that? You're kind of heads down building. Do you ever have like moments of...\r\n\r\n\r\nTyler Denk (03:28.286)\r\nI'm so heads down and stressed all the time. Like I do try to remind myself there's something that I've read before that I like to think of, like Tyler from five years ago would have done anything to be in the situation that Tyler is in today. Me speaking about myself in third person very oddly, but like, yes, it's like very stressful the day to day, like putting out fires, waking up super early, working super late. You kind of get lost in the sauce a lot during the business building experience and it\r\n\r\n\r\nAnd I don't do it enough to take a step back and really think about like what it took to get to this point. The fact that we are on pace to do over 30 million in revenue in our fourth year in business, like a lot, we've been very fortunate and very lucky. have a lot of great people around us, but it is cool. And I don't do it enough to take a step back and really appreciate where we are.\r\n\r\n\r\nNikolas Hulewsky (04:16.287)\r\nWell, dude, so you were at Morning Brew. You started at Morning Brew 2017, Morning Brew sells in 2020, and you were a huge part of that process. And I want to talk about some of that stuff, but they sell for $75 million. And then you go from that and you start Beehive 2020. And now you just said you're going to do $30 million this year in revenue. All right. So tell me if I'm close. $30 million. Let's just say 10X.\r\n\r\n\r\nTyler Denk (04:37.516)\r\nYeah, we should. More.\r\n\r\n\r\nNikolas Hulewsky (04:44.34)\r\nARR? Are you a $300 million company? 500 million? 10 billion? Stop me!\r\n\r\n\r\nTyler Denk (04:48.014)\r\nI'd like to think we can get more than a 10X, but it depends on the markets, right? Like the markets the past few days might not give us a 10X, so who knows? the, sure.\r\n\r\n\r\nNikolas Hulewsky (04:53.822)\r\nOkay.\r\n\r\n\r\nLet's say 200 million. You know that's not normal, right? You like went from morning brew 2017 to 2020, $75 million, 2020 to 2025, and you've built something of like really significant value in these short sprints. do you know that that's not normal? Or are you like, well, it's kind of just my reality.\r\n\r\n\r\nTyler Denk (05:15.832)\r\nSo yes and no, I don't think, again, I don't think I think about it a ton until there was a point to the past, I don't know, six to eight weeks, we've been adding between 25 and 30,000 MRR per week. So like net of everything. So we're adding like over a million in revenue per month. And so I write the same, I've read an email to the team every Sunday to kind of like get all of our priorities aligned. Like this is what we're focusing on this week. Here's a milestone. Here's what we accomplished last week. These are the top things we're going to accomplish this week.\r\n\r\n\r\nNikolas Hulewsky (05:27.93)\r\nJeez, that's insane.\r\n\r\n\r\nTyler Denk (05:45.71)\r\nIt became so repetitive for me just to say, Hey, last week record record week, we grew by 25,000 MRR or 26 or whatever it is. And so I went to the chat, GPT and claw. I was like, where does this put us in like terms of growth, like make it a little bit more impactful for the team to understand like what they're a part of. again, my job is storytelling to get everyone swimming in the same direction and motivated and aligned. And it's like something like the top 0.1 % of companies grow at this pace. And obviously you see on Twitter.\r\n\r\n\r\nNikolas Hulewsky (06:04.34)\r\nMm-hmm.\r\n\r\n\r\nTyler Denk (06:12.962)\r\nThere's a lot of the AI native companies that go from zero to 20 million in like three months. Right. And you're like, okay, we are not that. So it makes you think like, we're not achieving this like rocket ship growth, but there are so many companies that struggle to get the traction and revenue that we have experienced. And like, I'm aware of that. And like, we are very fortunate. But yeah, I had to like do a little bit of research to like position to the team of like, just understand that. Yes, it is very stressful. We all like are drinking from the fire hose. We're solving problems. Like it's a very high, fast pace.\r\n\r\n\r\nNikolas Hulewsky (06:39.284)\r\nyou\r\n\r\n\r\nTyler Denk (06:42.882)\r\nhigh stress environment, but like, let's not take for granted that we're in like the top 0.1 % of like fastest growing companies. And like, you should be learning a lot and stretching yourself and gaining a lot of experience from this journey that we're on and positioning that to the team. think it is super important.\r\n\r\n\r\nNikolas Hulewsky (07:00.382)\r\nSo let me ask you just about Beehive in general. you are, doing, call it $30 million this year, top line revenue. What are the margins look like on newsletter or on this business? Cause it's not just a newsletter business right now, right? Like you have the way that you've talked about it is you're helping people with distribution, which is the newsletter part. You've got website builder, which is actually helping people get up and running and then have an integrated platform. And then you've got the third pillar, is escaping me at the moment.\r\n\r\n\r\nTyler Denk (07:29.771)\r\nThe ad network.\r\n\r\n\r\nNikolas Hulewsky (07:30.17)\r\nads, yeah, the ad network of the 30 million, like where is your revenue coming from of those kind of that pie?\r\n\r\n\r\nTyler Denk (07:38.446)\r\nGood question. I think for this year, the projection would be like 22 to 23 will be SAS, which is just like pure platform, which that that's like the email and the newsletter part combined. Essentially, the ad network will probably make up seven or eight million, ideally more of revenue this year. I think we're pacing above our projections. I'm just basing this off of what we did to start the year. But yeah, I'd say we're about 70 % SAS business, 30 % ads.\r\n\r\n\r\nNikolas Hulewsky (07:46.473)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (08:05.938)\r\nWhat does the margin look like on the SaaS and ads business? Are they effectively the same or does one have better margins than the other?\r\n\r\n\r\nTyler Denk (08:12.238)\r\nYeah. The SaaS business is like typical SaaS somewhere between like 60 and 70%. I would say, um, ads between we take between like a 10 and 20 % cut of revenue. Um, it was like our profit margin and that's like supply and demand base. So for when we have advertisers like Nike, who are like very high in demand, like we can charge more. think we take a bit of a larger spread there. Um, and then vice versa. Um, so that's all like supply side demand side, like real time bidding and understanding like.\r\n\r\n\r\nNikolas Hulewsky (08:17.236)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (08:25.534)\r\nMm-hmm.\r\n\r\n\r\nTyler Denk (08:40.75)\r\nWe cap out at 20%. So we'll never take more than 20 % of a cut from any ad placement that we place with our publishers.\r\n\r\n\r\nNikolas Hulewsky (08:48.67)\r\nSo for context, the way that many people make money on these newsletters is by selling ads or sponsors within their newsletters. they're kind of two, I'm on Beehive. And from what I've seen, there's kind of two ways you can do it. I could sell sort of a private ad. I could just put it in my newsletter natively, or there's an ad network on Beehive where I could sell a space or I could actually say, hey, I'm buying space in somebody else's newsletter. And then they would choose me.\r\n\r\n\r\nHave you found either one of those like more or less effective? Is buying an ad through Beehive, does it have the same conversion, same CAC, same LTV as one of those natively placed ads in a newsletter that's not on the ad network?\r\n\r\n\r\nTyler Denk (09:32.45)\r\nYeah, I'm happy to take a step back just for the audience even like explain what, what, is, what is like this whole ad or deal with an email situation? Like how did we get here? I think that might be helpful context. So going back to when newsletters became very popular, whether it's the skim Axios, morning brew, the hustle, almost all of them monetize almost exclusively using advertisements. So rather than banner ads within emails, they had full sales teams that sold ad placements that went directly into the email.\r\n\r\n\r\nNikolas Hulewsky (09:35.74)\r\nsorry.\r\n\r\n\r\nNikolas Hulewsky (09:42.292)\r\nYeah, let's do it.\r\n\r\n\r\nTyler Denk (10:02.104)\r\nSo using Morning Brew, which is the example I know best, they have a story, they have another story, and then they have a big ad unit of MasterCard, Visa, Apple, who will pay 60 to $70,000 to get 150 words of creative in the newsletter. And then they have other, they call them secondary, tertiary ads, like below the fold, but it's primarily that one sponsorship that does the majority of the revenue per newsletter.\r\n\r\n\r\nAnd it's a very, depends on who your audience is and the size of the audience. So for morning brew, were less specific. were pretty broad general business, but we are very large. were two, three, 4 million subscribers when I was there. And so that warranted Apple paying $60,000 to have their logo at the top of morning brews newsletter, because we, Apple knew that they were getting in front of 3 million, mostly affluent.\r\n\r\n\r\nNikolas Hulewsky (10:42.142)\r\nMm-hmm.\r\n\r\n\r\nTyler Denk (10:54.496)\r\nupward trajectory, 18 to 34 year olds that live in like New York, Miami, Austin, LA. And so when you think about what it took to do that, we had 10 to 15 people on this brand partnership team, AKA sellers who are constantly talking to different brands, different advertising agencies, trying to convince them to like move their ad budget to morning grill. And that took a huge effort. had copywriters at morning brew that took the messaging points and turned into good copy. And then we had a full like ad operations team. That's like.\r\n\r\n\r\nrunning the ads, pulling the data, reporting it back to advertisers. So I gave all that context because that was really the impetus for building Beehive. Like I saw what this well-oiled machine of like content creation and email and amazing CMS, an amazing ad team, the operations are smooth and it turned into a content management system. So like what the writers use to actually create the newsletter. So we had this well-oiled machine and it turned into a $75 million acquisition.\r\n\r\n\r\nNikolas Hulewsky (11:41.47)\r\nSay what CMS is.\r\n\r\n\r\nTyler Denk (11:53.642)\r\nAnd meanwhile, while I was there, all of these other writers, hobbyists, journalists, and people who work at these other publications were like, how are you doing this? Like, how are you building the newsletters in this template? How are you monetizing efficiently? What data are you looking at? And that really was the impetus for us building Beehive, which is the all-in-one solution to do all of that. So to fast forward to your actual question, which was, what does Beehive do? We help people create content and send email newsletters, and we also host their website as well.\r\n\r\n\r\nBut if you want to monetize, you can do what morning brew does. You can hire an ad seller. They can be in market. They can talk to Nike. They can talk to the ad agencies. They can close deals and you can put that ad in your newsletter. And a lot of our large newsletters do that. And like, that's totally fine. We don't take a cut of that. That's like your revenue. The thing is 90 % of publishers, journalists don't have ad sellers on their team or their team of one. And so the value that the Beehive ad network brings is we talk to all of those brands.\r\n\r\n\r\nWe have HubSpot, Nike, Netflix, Roku, like tons of massive brands in our ad network. And with one click, you can get an opportunity from Nike, accept it, put it into your newsletter. And it's as if you have a direct contact with Nike, but you never have to talk to anyone at Nike and you still get paid for running a Nike advertisement in your newsletter. So we play in both. We want to support people who can sell direct and we have launched features that help them sell direct and manage their inventory. We don't make nearly as much money on that, but\r\n\r\n\r\nWe're not in the game of just making money for bottom line revenue. We want to support the people who use the platform or you could use our ad network.\r\n\r\n\r\nNikolas Hulewsky (13:27.602)\r\nYeah, I mean, you want to enable the people who are doing real things. You're just trying to help them have a better experience monetizing the content that they're creating so that these small, I know it started out as creators, but I see more and more small businesses using platforms like Beehive in particular to monetize their email distribution lists. Whereas in the past it was like, I just have a list and maybe it's in Google Sheets or maybe it's in Klaviyo or some other platform like that.\r\n\r\n\r\nBut there really wasn't a way to monetize it unless they actively were selling something and launching a new campaign. Whereas now there's this sort of unlock in the ability to generate revenue because they have this, the ad network that they're able to leverage. So it's been interesting.\r\n\r\n\r\nTyler Denk (14:09.932)\r\nYeah. I mean, it's worth doubling down and like we really, I mean, yes, we need to make money as a business, but my philosophy from day one has been we want to build whatever tools and platform allows our users to succeed. And like we will extract revenue in their success without directly pulling revenue from them. So a lot of people compare us to Substack who takes a 10 % fee of every dollar that their creators earn through the platform.\r\n\r\n\r\nWe offer the same features of like, can have a paid subscription product where your readers pay you directly and we don't take a cut of revenue. Um, and then same with like us facilitating all of the direct sponsorships on the platform as well. Like we do a $10 transaction fee if you use our tools, but like, you sell direct, like that's totally fine. There's no penalties. So I think that's just like more of an ethos and philosophy thing that we want you to take home as much revenue as you possibly can and succeed because our user success.\r\n\r\n\r\nNikolas Hulewsky (14:41.453)\r\nMmm.\r\n\r\n\r\nTyler Denk (15:02.89)\r\nin the long term ends up being our success as well.\r\n\r\n\r\nNikolas Hulewsky (15:05.682)\r\nWell, like there's these really interesting trends that are happening right now is you have companies. SMB is like my experience, right? Healthcare, e-commerce, those types of businesses. And for a long time, their strategy was like, all right, get the intern and let's do a TikTok dance. And this is our social media strategy. And, but they would start to realize like, I can drive business from this, especially if they're local small businesses. But there's a, huge risk, which is called platform risk. Instagram, TikTok almost got banned Twitter.\r\n\r\n\r\nthey can change their algorithm at any time. And so the ability that you might've had in the past to reach the people who are following you changes pretty dramatically if you don't keep up with the trends, et cetera. And so there has been a big movement I've seen from business owners to take their followers off platform, one-to-one communication. Some of them do texting, but the majority is emails, right? Like sending them emails so that they have direct access to them. When you were leaving Morning Brew, was that even in your mind or was it just like,\r\n\r\n\r\nHey, creators are having a bad experience. We should create a better experience for them. That is now kind of morphed into, yeah, small businesses are actually using us or was this always part of the master plan?\r\n\r\n\r\nTyler Denk (16:16.502)\r\nOne of the first things I realized when I got to morning brew was that I wish that I had been collecting emails for the past decade. The fact that morning brew wake the input is the same, right? We, we had a team of writers who spent six hours writing the newsletter. The writing was incredible. And whether they were sending to 200 people or 2 million people, like the input is the same. The output in dollars and influence is drastically different. Right. And so if you can like hone your craft and get really good at creating content, whatever it is, whether you're serving.\r\n\r\n\r\nNikolas Hulewsky (16:23.005)\r\nYou\r\n\r\n\r\nTyler Denk (16:45.912)\r\ncontent for farmers, small businesses, crypto, like whatever your niche is. Like owning your audience and being able to say when I press send, like I sent my personal newsletter this morning, I press send, it goes to 95,000 people, whether or not they open it. Like I hope that I built the trust and reputation that they do look forward to my emails. But like there wasn't some product manager at TikTok or Facebook determining whether Tyler Dank's content today is going to be shown in the feed.\r\n\r\n\r\nor it will get buried and like get less distribution based on whatever the content is. So I'm a huge, obviously a huge believer in email. And I think once you see the light and like, it's not mutually exclusive, right? You can have an amazing YouTube, TikTok, Instagram presence and boost your newsletter, collect emails down funnel and vice versa. can use email as a way to drive more subscribers on YouTube, TikTok impressions. And I think that's where I've seen it done the best.\r\n\r\n\r\nColin Samir, like an excellent example, started off as massive YouTubers that cover the creator economy. They've done interviews with Zuckerberg and MrBeast. Like they're kind of like more or less the face of the creator economy in a lot of ways for the content that they cover. They have a newsletter in addition to their YouTube channel. That's Monday, Wednesday, Friday, goes to 150,000 people. It's not regurgitating the same content, but it's complimentary and they drive people from the newsletter to the YouTube.\r\n\r\n\r\nAnd they drive people from YouTube to their newsletter. And it's like the symbiotic relationship and it works extremely well. so there's definitely ways to do both.\r\n\r\n\r\nNikolas Hulewsky (18:18.024)\r\nIt's not even it's not even massive creators. I have a friend of mine who's on Twitter. Not a huge following. He has a podcast. I don't want to out him. I mean, he does talk about this, but he let's call it 50,000 followers across platforms. He's making five million dollars a year from his content and why it's what he's like built really good trust. He's taking people off platform and then he's partnered with businesses that sell to his audience. And so he's just like turn this into a machine.\r\n\r\n\r\nBut he's really learned like, I've got to capture not only attention, I've got to be able to interact with these people one-on-one without some intermediary that is a platform deciding based on their algorithm, like whether or not my stuff gets reach. And that that's what's been interesting for me to see change over the last few years. Content creators like Nick Huber, Cody Sanchez. I'm trying to think of some other ones, but where they're using media to accelerate their business as opposed to just media is the business. Cause they're making money from AdSense from Google.\r\n\r\n\r\nWhat was it like in 2017 when you were launching? Was that even a thing? Am I way late to the game? Am I stupid? Because this has been going on for a long time. What's your observation of the way this stuff works?\r\n\r\n\r\nTyler Denk (19:28.642)\r\nI mean, Morning Brew definitely benefited from a different time and place with the competitiveness of acquisition, whether it was Facebook, Twitter, Google. We were getting subscribers for sometimes 50 cents, sometimes a dollar, dollar 50, but we knew and we solved the equation of, know that advertisers are willing to pay this much in a CPM. We know if we can grow fast enough and if we can acquire subscribers for 50 cents, dollar, dollar 50.\r\n\r\n\r\nWe break even on that subscriber if they stay subscribed for X period of time. And so there's like, very quickly becomes like an equation of, know, that if you can grow fast enough, you know, advertisers want to get in front of your audience are willing to pay a premium rate to get in front of that audience. They pay you upfront. You put that money into growth, you grow faster. And like that is like the flywheel.\r\n\r\n\r\nIt required morning brew raising, think $600,000, which isn't a ton, but like early days, did a friends and family round to get that flywheel off the ground. But once we saw that equation, you just do the math and it, it, it scales up and like you've seen 1440, think now has 5 million subscribers. It's like another newsletter, same thing, same equation. that being said, I think you caught out something important is we've been talking about morning brew and the millions of subscribers. My personal newsletter has almost a hundred, like whatever.\r\n\r\n\r\nAll of that is, but I know plenty of writers on Beehive that have five, 6,000 subscribers who are making six figures as a side hobby. And that's just because they've like really doubled down on like a very specific niche. So they understand whether it's advertising execs or rental cars or whatever niche that they want to stay in. And they are just like the best at covering that content.\r\n\r\n\r\nNikolas Hulewsky (20:57.652)\r\nCheers.\r\n\r\n\r\nTyler Denk (21:12.942)\r\nAnd they know that they can either charge advertisers a hundred, $200 CPM to advertise, or they can charge some fraction of their audience will convert to a paid subscriber and pay a hundred dollars a month because they need it for work. And there's a lot of really interesting niche small newsletters doing ridiculous amounts of money. And some of them only put a few hours a week into it. So I think that's a huge opportunity. And that's like also one of the other benefits of newsletter, similar to, guess, social as well.\r\n\r\n\r\nYou don't need a ton of capital to get started. Like we start, we have a free tier. You can like start bringing money in risk free using email and having a website as like a testing bed to try new things. And you're not like raising capital. You don't need to hire 10 people. so I think that there's very low barriers to entry to the medium as well.\r\n\r\n\r\nNikolas Hulewsky (22:03.06)\r\nWhat would you say to somebody who's listening to this and is like, well, easy for you to say, you work in this space, you know what to write, you've got 100,000 followers. Like, what do I even write about? How does a business owner get started even thinking about the concept of writing a newsletter?\r\n\r\n\r\nTyler Denk (22:17.538)\r\nThe, do I write about is the thing that I can't necessarily solve. Right. I think there's plenty of other people who can, can help give you inspiration. think the easy thing is if you're a business owners, whatever you do or sell as a business, how, if you think through the lens of like, who are my customers, why do they come to us to buy whatever product and service? And is there any other tangential information that they would benefit from receiving that would eventually lead? And you don't have, I think the mistake that a lot of people make is they\r\n\r\n\r\nNikolas Hulewsky (22:20.958)\r\nSure.\r\n\r\n\r\nTyler Denk (22:45.858)\r\ntoo quickly try to get to the dollars, right? They're like, I'm not going to spin up this weekly email unless it has a direct call to action for them to purchase something for me. And every time I send this email, I'm making money. think way too many people look for shortcuts rather than thinking of like thinking of their customer as some one or a group of people that they can nurture and have like their brand awareness and trust build over time. And so\r\n\r\n\r\nNikolas Hulewsky (23:13.609)\r\nMm-hmm.\r\n\r\n\r\nTyler Denk (23:15.608)\r\nFor example, Brex is a big like startup credit card company who finances and does banking for tons of popular startups. They have a newsletter on Beehive for their community and it has nothing to do with like starting a new Brex account. Obviously somewhere down funnel, like that is kind of the purpose of like any distributed content that they're working on. It's to eventually have people know who Brex is to identify and like the content and brand that they're creating to eventually open a business account with Brex.\r\n\r\n\r\nBut like, that's like the long-term thinking they have a newsletter that covers all of their local community events in SF and LA, New York, things that some they do like business owner spotlights, but they're creating content that their ideal customer would benefit from and enjoy. And they're nurturing this, this funnel of leads through content, knowing that one day that person who does launch a business and does need a business credit card.\r\n\r\n\r\nThey've been on this Brex list for a year. They love all of the content. They already look favorably on Brex. And now it's the no brainer decision to create an account.\r\n\r\n\r\nNikolas Hulewsky (24:22.066)\r\nSo I want to throw my framework out at you and see what your opinion is. Cause when I first started writing, I was always like, man, this is stupid. People don't want to hear what I have to say. You're like, what do I write about? This is dumb. But when I sort of reframed the way that I look at it, changed how I do things and it changed my ability to stay consistent. I look at it in this order for me as a small business owner, writing a newsletter. one, clarity. Number two, trust.\r\n\r\n\r\nAnd then number three, sales. And what I mean by that is helps me create clarity around what I'm doing. There's just something about writing and getting your thoughts out and like being able to understand like, what is my goal here? What is my ethos? What is my strategy? Uh, and then trust building like this long form content where that people are reading, you know, all of a sudden people who don't even know you are like, Oh, I trust Tyler. If Tyler recommends something, I'm going to trust him. Cause I've seen him over a long period of time. And it's not necessarily that they\r\n\r\n\r\nbuy from you, but maybe you need to raise money. Maybe you're looking for a rock star hire. Maybe you're looking for an intro to somebody that could change your business and somebody knows that person who you're looking for. You get a warm introduction from them because they like you, they trust you, and they can not put you in touch. The third and last thing is like sales. Okay, maybe I get a sale from it for my business, but those other two things for me have been the most valuable things and they have helped me stay consistent. What do you think of that framework?\r\n\r\n\r\nTyler Denk (25:49.344)\r\nI mean, totally aligned that that's a much better phrase and thought out framework than what I just rambled on for, but it's getting to the same thing. Right. I think like another example, and it doesn't work for everyone, but my personal newsletter that I send is just about entrepreneurship and business building. so yes, I cover Beehive tangentially because that is the business that I'm building, but I am.\r\n\r\n\r\nNikolas Hulewsky (25:55.976)\r\nHahaha\r\n\r\n\r\nTyler Denk (26:13.356)\r\nMore often than not just sharing our hiring tactics, our strategies, the different things that we're doing as we build the company. And people then see that and it kind of personifies the business in the sense that. Beehive as just a brand is some new brand that I've never seen before. I don't know anyone who works there, whatever. But if I follow Tyler's newsletter and I hear about his struggles as a person, his travels, like how he's building the business, how his philosophy on hiring and running the company and the milestones.\r\n\r\n\r\nLike now I can tie a person and a figure behind the business. And when I have to make a vendor decision between Beehive and seven other faceless brands, at least I feel like I kind of know the person behind this one and I enjoy the content and I've benefited from it. Where like that has actually been the edge in us winning business, which was never like really the intention. Somewhere in the back of my mind, maybe I'd think if I send this newsletter, everything I just said would become true. But that's almost been like revisionist history of like\r\n\r\n\r\nWe've seen people come in from my personal newsletter and become a user or we've made a mistake and they've been like, Hey, like you shipped a bug and it kind of screwed me for like a week, but like I trust, I trust you and like your vision for the business. And I know how passionate you are about this. And like, it's not worth me turning off the platform to go to another like unknown platform. When I know that your head's in the right spot, I know you're determined to make this work. And I know that that was an honest mistake. And so like, it gets a lot of like,\r\n\r\n\r\nGoodwill as well again assuming you are authentic and assuming that like your authentic self is what people want It's like I'm just me all the time and it either resonates or it doesn't\r\n\r\n\r\nNikolas Hulewsky (27:51.688)\r\nYou said, I can't remember exactly what you said earlier, it, let me know. It's like, you're very mature for your age. I didn't get to this point until my mid thirties, but the main job of a CEO is I'll throw another framework out to you. In my experience, I've had organizations, I've managed several thousand employees. So I understand kind of what it takes to lead leaders and lead employees. And from what I've seen in my experience, lots of failures.\r\n\r\n\r\nA CEO has three jobs internally, recruit, retain, and inspire. You've got to be able to bring on really good people and then you've got to create an environment where they stay, right? So that the, you sold them isn't just a lie, but they're like, Oh cool. This batch is what I thought it was going to be. And then you've got to inspire them to achieve results that they probably couldn't achieve by themselves. That's your job as a CEO. Now it's not your job when you're starting a company and you're like sub $500,000 in revenue.\r\n\r\n\r\nYour job is just like fulfillment. I'm just doing the work. I'm creating the product. I'm providing the service, whatever. But there comes to a certain level where it's like, all right, I got to kind of extract myself from the business and become the communicator. And that's a hard transition for people who are so used to building because it doesn't feel as productive. It doesn't feel like, I'm actually doing anything. Was that transition hard for you? Cause I can hear like you're, you're at the spot now where you, got 90 employees. Like you've got to be.\r\n\r\n\r\na CEO, but you started this thing from scratch. So you know what it's like to get in there and build and want to just be building the product. Talk about the transition from those two.\r\n\r\n\r\nTyler Denk (29:29.88)\r\nWhat's funny about this, it's very timely, is I have not transitioned. that, like my, what I, what, why I have the gray hairs that I have is like where I think I have differentiated as a CEO is not following that accepted track, which I think is true for nine out of 10 people and leaders. is like, for that same reason, right? At the early days you were just doing like someone needs to send that email. Someone needs to build this feature. Someone needs to answer customer support.\r\n\r\n\r\nNikolas Hulewsky (29:34.108)\r\nTyler Denk (29:56.962)\r\nThere's no one else to do it. The CEO does it, the co-founder does it. And then you hire people, then you get managers. And I think there's a common acceptance that at some point it does become what you just described, right? Like your job is to communicate, to hire, to retain, to inspire. But I get more enjoyment out of actually doing as I think most founders do, but I think they blindly follow the feedback that at some point you can't do. Like at some point you have to do everything else. And I have been as hard as I possibly can pushing back on that.\r\n\r\n\r\nBeing like, like after this, I'm going to write the, I'm going to QA the new features that we're launching this week. And I'm going to personally write the product update, which will then go to all of our users, educating them on all of the new features that we're launching this week. That allows me to understand what our users want to test the actual work of the engineers and to communicate it and build a narrative that I want. You can argue at some point that like someone else, could hire someone else to do that. And I'm sure I can. And we already have people in the team that are super talented and could.\r\n\r\n\r\nBut like, that's actually where I get a lot of my enjoyment. And I think that is like the fourth stool or whatever, fourth leg of the stool would essentially be like the doing part. And maybe it's not for every founder and CEO. And at like some point, if we had a thousand employees, maybe I'm not doing that, but I actually think it inspires a lot of the people on the team and makes me a better CEO because I know what our users want because I'm actually in the work, like in the weeds doing the work.\r\n\r\n\r\nNikolas Hulewsky (31:20.094)\r\nguess.\r\n\r\n\r\nTyler Denk (31:23.182)\r\nAnd think that's a competitive advantage.\r\n\r\n\r\nNikolas Hulewsky (31:23.25)\r\nWell, so and what I would say is like, that's part of the way that you inspire people. That's part of the way that people who come on are like, yeah, what I thought I was getting, I'm getting the ethos that Tyler had in those interviews or that I'm hearing about it. I'm actually seeing it at the office or in the company because I think you guys are co-located. What I would say in response to what you just brought up is I think many young founders think, I got to hire a team and delegate. And what they do is they, like build their company to this place where it's\r\n\r\n\r\nIt's growing, the flywheel is going, they're going like crazy. And then they do something really stupid because they think they're supposed to. They outsource the thing that they had an unfair competitive advantage in. And at that point, it's like, that was the thing that made you special. It could be your ability to communicate, connect disparate ideas within this space and then effectively communicate it out to your team, right? That could be your core competitive advantage.\r\n\r\n\r\nAnd you're not in the spot yet where you can or should outsource that. Steve Jobs never outsourced product design. Sure, he brings on Johnny Ive, but he's in every single one of those meetings making decisions. When Tesla was growing like crazy, Elon Musk was sleeping on the factory floor, right? I think it's when you remove that genius or that piece that was the differentiator, that's when you have problems. so as CEO, what you'd want to do is remove all the things that you don't have a native genius in, all the things that you don't have a competitive advantage in and outsource those.\r\n\r\n\r\nand hold onto that thing that really separates you from your competitors as long as you can. So you're holding onto that thing. I, this is my opinion. I don't know for sure. You're probably holding onto that thing where you're like, no, man, this is my thing. This is our competitive event. And that's what's allowing you to continue to grow so fast. If you lose that, which a lot of founders do thinking they're getting advice from these VCs, that's when you see stagnation. And that's what that, you know, Paul Graham, when you like wrote about founder mode, that's kind of what he's talking about is, is, Hey, stick with the thing that got you here. Make sure you're keeping that thing.\r\n\r\n\r\nTyler Denk (33:12.002)\r\nYeah, exactly.\r\n\r\n\r\nNikolas Hulewsky (33:17.958)\r\nas special as possible and then you can expand but get rid of like who wants to do I don't know reconciling expenses who wants to do admin stuff setting up email like you're not doing that stuff anymore.\r\n\r\n\r\nTyler Denk (33:27.074)\r\nRight, for sure. I hope our CFO likes to both of those things. But yeah, right. I'd go one step further though, and there's something that I think it's lost in all of this, which is like beyond just like our competitive advantage, like what makes me happy and like what makes me enjoy work the most, which is like more of like almost like a meta thing, right? And.\r\n\r\n\r\nNikolas Hulewsky (33:31.752)\r\nThey do, that's right. You bring people in, you're doing those things.\r\n\r\n\r\nTyler Denk (33:49.294)\r\nI, my assumption is the company is better off when I am fully energized, happy, excited, contributing to what I am good and best at. And like leaning into all of the different teams, like fully enjoying the company building experience. And that is what I'm sure. That's why I said, it was an interesting question when you brought up of like the transition. Cause at 90 employees, like some of the things that worked at five and 10 employees no longer works at 90. In fact, most don't. And, but like me as like a startup founder, like\r\n\r\n\r\nThe zero to one, the first five, 10 employees, when you get like one conversion a day, like you get a hundred dollars at the bank account a day and you're like going crazy and you're just tinkering and building like the early company building. I personally find the most fulfilling and exciting. And as you go from 30, 50, 70 employees and my, my calendar now is recurring meetings, one-on-ones performance reviews. Like those things suck energy out of me, right? Like that, that is not actually what I enjoy doing. And so was like, I listened to a lot of like different founder content. I listened to.\r\n\r\n\r\nNikolas Hulewsky (34:37.768)\r\nHahaha\r\n\r\n\r\nTyler Denk (34:46.988)\r\nthe, the founder podcast on the CEO of Nvidia, who has 60 direct reports and had zero one-on-ones. And he's like, I've been at this company for 30 years. One-on-ones do not excite me. And if I want to continue to wake up and go to work and enjoy what I do, I need to build a schedule around like what I get fulfillment out of. And it's not meetings. And he's built one of the most successful, arguably the most successful and like largest company in the world based off of that philosophy. So I think it breaks down what a lot of companies are just.\r\n\r\n\r\npattern matching of when we raise a series B, we have to bring in three HR people. We're doing performance reviews. We're now like breaking out into teams and the CEO is going to run like recurring meetings five times a week. And I try to push back on all of those assumptions and just do what I think we should be doing, which is how are we solving problems for the customer? Like number one is I want every, I want myself and I want all of our key employees to be as close to the customer as possible always. And\r\n\r\n\r\nrecurring meetings sometimes are like a necessary like, we have to do them to get aligned. But if it's not solving customer problems, don't want it on the calendar. And so that's kind of like the company building, pushing back transition that I'm going through is like, how long can I keep this going? Because I don't have ambitions to hire 5,000 people. I don't think that sounds super fun. But how do we keep the fun and like the it that we have as long as we can and still compete in this market? I think we've done a pretty good job so far.\r\n\r\n\r\nNikolas Hulewsky (36:13.684)\r\nIt's that whole, I never know how to say it, ecoggy, where it's like the concentric circles, what you're really good at, what you're passionate about, what the world values and what you can get paid for. Once you have overlap there, it's like, I don't go to work every day, I go to fun every day. It's an amazing experience. I don't think enough people focus on, what are you passionate about and you're good at and you can get paid for? Most people are just like, well, just focus on your passion.\r\n\r\n\r\ndoesn't necessarily translate. just focus on what you get paid for. Well, you're going to kill yourself because it's like you're just going to be so depressed doing something that you hate. What's interesting though, is it sounds like you've prioritized creating an environment that you enjoy, that gets you excited, but you raised venture money, which to me is always like, I raised venture money. Now I've got, I have to hit these targets. I've got 10 bosses. It's 50 % year over year growth every single year. Otherwise there are big problems.\r\n\r\n\r\nWhy did you raise venture money? If you could have bootstrapped, sounds like your margins are fantastic, right? Walk me through that process.\r\n\r\n\r\nTyler Denk (37:18.19)\r\nYeah. I mean, going all the way back to the beginning, it was me and my two co-founders. was 27. They were 24. We didn't have a ton of capital. Like I made a little bit of money from the morning brew acquisition, but big difference between founder money and early employee money. And getting this business off the ground required like, Oh, it's a very ambitious roadmap that we need to build. Like we aren't going to build this ourselves. We need very talented engineers. So now you're in the recruiting decision of how do we attract top talent? You can sell them on the dream and the vision and the equity.\r\n\r\n\r\nBut at end of the day, lot of like the top talent is already getting paid $200,000. I get another established company. It's like a huge risk for them to come to us. Then we have vendors that we have to pay to stand up the infrastructure, to send the emails that we're sending. And most of the vendors kind of operate on like an annual upfront contract. Plus you need like the support tiers. So when we added up very quickly, like we just needed capital to get off the ground to pay ourselves, right? Like we, we didn't go full ramen diet, like living under the bridge, like sleeping in like a random friend's office and like building this company.\r\n\r\n\r\nNikolas Hulewsky (37:50.29)\r\nMm-hmm.\r\n\r\n\r\nTyler Denk (38:16.066)\r\nWe felt the company would be better if we like paid ourselves a normal salary, can pay ourselves to like put food on the table. Both of my co-founders are married and be able to like provide for ourselves and just focus exclusively on the company rather than trying to worry and focus on where's the money coming from to pay the bills. So think the whole ramen diet bullshit is like a total like scam and not something.\r\n\r\n\r\nNikolas Hulewsky (38:35.86)\r\nSo you weren't like so equity hungry that you're like, nah, man, I gotta hang on to every single piece of equity. You kind of went deliberately from the beginning, like, hey, look, we have a track record. We know we can raise money. Let's go raise some money. Yes, we dilute. We'll still stay in control. We wanna have some type of quality of life and let's run. Is that like a fair characterization?\r\n\r\n\r\nTyler Denk (38:55.138)\r\nYeah. One is like, just like the starting costs. Like there was just like a fork in the road of like, we weren't going to be able to pay the $60,000 annual contract to a vendor out of our pockets. Like we didn't have that type of money. And then like when we need our first engineering hire who, even if we pay them conservatively 120 K, where's that money? Like, is that coming from my bank account? Cause I don't have that. And my co-founders who are 24 don't have that. So I think by like a forcing function of getting off the ground.\r\n\r\n\r\nNikolas Hulewsky (39:01.672)\r\nOkay.\r\n\r\n\r\nTyler Denk (39:21.174)\r\nI'm like hugely envious of, of bootstrap business. think if you, if you have the funds or the means to go about owning as much of the company as possible and not getting on the VC flywheel, like power to you, that's amazing. We just weren't in a circumstance as 24 and 27 year olds to be able to spin up this business and attract the talent that we needed from our own bank accounts, which weren't anything at the time.\r\n\r\n\r\nNikolas Hulewsky (39:40.98)\r\nWith AI the way that it is now, do you think you could do this business without, could you have started this business without venture money? Maybe like a small friends and family.\r\n\r\n\r\nTyler Denk (39:48.782)\r\nIt's a good question. Yeah, definitely more competitive now and easier now I'd say with like the tools that are available. It doesn't necessarily solve the, are we bringing in like our first senior engineer who can help us stand up this infrastructure. You can argue like, can you use AI? And I think in like the current state to build the info, like the AI that you see that goes viral on Twitter, that's like super flashy and marketable or like fairly simple crud apps that do like basic things and they look shiny and they work.\r\n\r\n\r\nNikolas Hulewsky (40:02.068)\r\nMm-hmm.\r\n\r\n\r\nTyler Denk (40:15.714)\r\nBut like the amount of infrastructure, data engineering, security that's like built into this platform, like, and maybe this changes over the next year or so with AI advancements, but we definitely needed some of the hires that we, that we made to get off the ground. But then I'd say like, how did we get to where we are now? And I continue to raise capital. Like once you get on the flywheel, there's not even like the pressure of like, we need to deliver, especially the seed round. I think most seed investors know like they're losing money nine out of 10 times there. Like there aren't these like.\r\n\r\n\r\nNikolas Hulewsky (40:27.752)\r\nYeah. Yeah, I mean.\r\n\r\n\r\nTyler Denk (40:44.586)\r\nsuper lofty, have to be a hundred percent growth. They just hope that you make it to the next round to like an A, right? And then once you get to like a series A, raised 12 and a half million dollars. We, kind of get on this, like, it's not even like bloat, but you start to accelerate and you're growing 20, 30 % month over month. And then you are burning more capital than you're making in most circumstances. So we we've had a few profitable months, but like have almost intentionally been unprofitable to put money into growth.\r\n\r\n\r\nNikolas Hulewsky (41:03.54)\r\nshe is.\r\n\r\n\r\nTyler Denk (41:13.816)\r\nto continue to gather market share. Cause I think going, sounds like to like small business owners, maybe totally illogical to build a business that way. You have to like assume that the anxiety you're living with on a day-to-day basis, that there are dozens of other companies in this space who are going after the exact same customers that we are that are sending cold outreach emails to our current customers to win them over. And we're all like going head to head on features, functionality, competitive advantages. Like once you're on this, like, Hey, we want to compete in the big leagues. There's not like.\r\n\r\n\r\nHey, how about we slow off growth? We like maybe launch like a few less features next month. We lay off this one team. like we cut off that initiative and then we get to break even. Cause I think the hardest thing to find in any company and especially a startup is true momentum. And once you find that momentum saying like, let's just take our foot off the gas. Let's get to break even. Let's get the profitability and then we'll try to find that momentum again. I think it's the hardest thing to do. And it's something I've debated many times, right? I've come to two fork in the road moments are series a and our series B.\r\n\r\n\r\nWhere I was like, we don't need to raise money here. We can, we can pull back spend. We can slow growth a little bit. We can maybe not hire those five people that would help us get to this next level of growth. But it's like the unknown, unknown of like, if we do that, are we just shooting ourselves in the foot and not taking advantage of the opportunity that we have in front of us? Or do we raise the round, make those five hires, accelerate growth and the gain more market share in a super competitive market. And I'd rather lose.\r\n\r\n\r\nBy going for it, then looking back in five years and being like, we had such a great opportunity in front of us, but we took our foot off the gas to get the profitability when we didn't need to, to save what five, 10 % dilution. And that's kind of the decision that I've landed on twice.\r\n\r\n\r\nNikolas Hulewsky (42:56.69)\r\nWell, what's interesting is whenever I talk to entrepreneurs who are either new to the, I guess, content space or don't know it very well at all, they're like, why would you be doing that? I always ask them this question. I'm like, hey, you know Uber, right? Yeah. Do you know how you know they raised billions of dollars, right? Yeah. Yeah. Yeah. And raised billions of dollars. Do know where like half of those dollars went? No. They went to Google and Metta. Like what? What do you mean? Like customer acquisition. They were trying.\r\n\r\n\r\nto grow their market share. They're trying to attract customers. Like, yeah, I guess, yeah, that makes sense. I didn't really realize that. Like, okay. So if you could build your own brand and have a newsletter or have an audience, how valuable do you think that distribution channel is? And like, that's the moment that it sort of reframes in their mind where they're like, I guess that makes sense. Like, yeah, why wouldn't I try to grow an audience so that I have another distribution channel? And exactly what you're explaining is like, once the flywheel is going, you don't want to...\r\n\r\n\r\nyour foot off the gas because you finally have figured out product market fit. Now is the time to throw gas onto the fire in the form of whatever paid ads or marketing or customer acquisition because you know what works. So I'm in agreement with you on like once you get to a place like, sure, let's dilute and bring venture money. Just interesting seeing that you raised it from the beginning because it would seem like this was profitable enough from the outside. But yeah, mean, it makes sense.\r\n\r\n\r\nTyler Denk (44:18.125)\r\nWell, I was going to hit on it earlier. Like the ambition, you were, I think one of your first questions was like, do you ever take a step back and like, think about like where you are, like, you know, 30 million plus in revenue this year. Maybe you get like a 10, 20 X multiple, like big, big, large business, right. And like three and a half years time. And what I was going to say to that question was like, your ambition really grows a lot over time, right? Like I think, I think a year and a half in we had, who knows how relevant offer it was, but a competitor wanted to buy us for $30 million. I think we were 18 months into the business.\r\n\r\n\r\nNikolas Hulewsky (44:31.348)\r\nMm-hmm.\r\n\r\n\r\nTyler Denk (44:47.094)\r\nIf you would have told me 18 months prior, Hey, you're going to go heads down, build this thing and really grind for 18 months. And there's a $30 million offer on the other side of that. And you walk away with like eight, nine million. I'd be like, that's an amazing bargain. I would take that 10 times out of 10. But once you start to see the product market fit, you understand how you're actually solving real user problems. Like you're gaining momentum. you start to see the roadmap develop and like, you see the potential of what this can be.\r\n\r\n\r\nNikolas Hulewsky (45:00.036)\r\nYeah.\r\n\r\n\r\nTyler Denk (45:14.712)\r\nWhen that $30 million offer came across my desk, didn't even flinch, didn't consider it for a second. Cause I was like, I think this can be a multi-billion dollar business. And I'd be shooting my, and I'm also having a lot of fun. So that's like the other thing too. There's always the trade-off of like, there's a dollar amount that could be offered today where I'm like, yes, I do think this can be bigger, but like it's also my life. And like I've put, I've stressed beyond belief for four years. Yes, we could grind this out for another four or 10 years, but there's an opportunity cost there to.\r\n\r\n\r\nthe enjoyment I could get out of like maybe having a little bit of savings and money and like paying whatever versus the gray hairs and stress and struggle that will come for the next like eight years. And there's a price, but what balances that is the fun that I have doing what I do. And like, yes, I said that there's a price, but like we're not for sale. Like that is not like the immediate 12, 24, 36 month roadmap. I'm having a lot of fun building what we're building. I think the opportunity in front of us is absolutely massive.\r\n\r\n\r\nAnd then answer one of your most recent questions in terms of having 10 bosses, me and my two co-founders actually control the board. And so like we are in control of the business and we are very fortunate that we've never had it down month in the three and half years we've been doing this. So maybe we haven't felt the VC pressure of like, what are you guys doing? Get your shit together. Like we need to return this capital, but our VCs have been incredibly supportive. And so I don't feel the pressure of having 10 bosses.\r\n\r\n\r\nNikolas Hulewsky (46:37.8)\r\nThat's awesome. All right, here's my last question for you. If you were an entrepreneur or if you're somebody who's like, I want to start a newsletter. I freaking love newsletters like I really do. I think they're awesome potential businesses. You get you. have like insider information. All right. You're like Wall Street, but you know exactly when the earnings reports are coming out. What niche are you seeing that's like underserved or like what would you start? What kind of newsletter would you start and what are you seeing that's like, hey, I think in the next 12 months you're to be seeing a lot of X.\r\n\r\n\r\nin this space.\r\n\r\n\r\nTyler Denk (47:09.262)\r\nIt's hard to say what, is being underserved. Cause I feel like all I see are the ones that are actually existing. Right. So it's kind of like for someone else to determine, here's something that I'm really good at and really passionate at. And there's not enough content. I mean, that is like, again, the morning brew initial story. It's like, I'm very passionate about business news and finance and no one seems to be serving my other classmates at the university of Michigan. This is the co-founder speaking in this hypothetical. like I see a void.\r\n\r\n\r\nNikolas Hulewsky (47:14.055)\r\nOkay, fair.\r\n\r\n\r\nTyler Denk (47:36.11)\r\nAnd it gapped the fill of like, something between Bloomberg and like what students are reading who are interested in business and going into like their entry level investment banking jobs. And like that was the gap that they found. I think there's plenty of niches. I think that's like the best part of the internet. The internet, I think the quote Ben Thompson is so much larger than everyone even gives you credit for. Like you can find probably 10,000 people that love the most obscure thing that you thought you were the only person in the world that even knew existed.\r\n\r\n\r\nNikolas Hulewsky (47:45.682)\r\nMmm.\r\n\r\n\r\nTyler Denk (48:04.484)\r\nso I think there's plenty of niches out there. so yeah.\r\n\r\n\r\nNikolas Hulewsky (48:05.972)\r\nOkay, that's fair. That's fair. All right, one last thing. Can I make a recommendation? I think you should launch a podcast ad network because the newsletter space was already disparate and messy, right? If there was a place for podcasters to go and easily transact ads, I think that would be, that would like change the dynamic and the experience. would get so many podcasters who would then sign up and sort of utilize their podcast network.\r\n\r\n\r\ninto a newsletter, then also sell ads that way. Because I don't know if you've looked into it, but like the current existing podcast ad networks just stink. Not even networks, just platforms to buy and sell ad space.\r\n\r\n\r\nTyler Denk (48:46.338)\r\nYeah, my response to that is wait till our feature launch later this week.\r\n\r\n\r\nNikolas Hulewsky (48:49.844)\r\nMy visual response is no comment. Cool man, this has been rad. I'll, yeah.\r\n\r\n\r\nTyler Denk (48:56.162)\r\nYeah, appreciate you having me on.",
  "metadata": {
    "duration": "",
    "date": "2025-05-05",
    "platform_source": "Google Drive"
  }
}