{
  "episode_number": "158",
  "episode_title": "AI SERIES: 8 - How Different AI Models Excel in Specific Use Cases with Jake Colling",
  "guest_name": "Jake Colling",
  "business_name": "Carrot",
  "transcript": "﻿Nikolas Hulewsky (00:00.934)\r\nBye, Jake. I'm so excited to learn about some AI from you, from a master Jedi. Tell the people. What's your background?\r\n\r\n\r\nJake Colling (00:11.734)\r\nhey everyone, my name is Jay Cohen. I am a software developer by trade. Like many folks, both fascinated with AI and building with AI, so working on a tool to make it really easy to build and deploy AI workflows. I also just use AI a ton in my software development and all the other related parts of trying to build a business. Grew up in Minnesota, had a very classic upbringing, mowing lawns and trying to get a little odd jobs business started when I was in high school. So I have a lot of empathy for folks that are, you\r\n\r\n\r\nNikolas Hulewsky (00:35.097)\r\nThanks.\r\n\r\n\r\nJake Colling (00:39.882)\r\nalso working in home services type industries. And yeah, I just love business of all kinds and here today at Chat1A.ai.\r\n\r\n\r\nNikolas Hulewsky (00:47.228)\r\nCool. So you have your own software agency. I don't even know what to call it. Is that effectively what, or is it a startup? Is it a proper like built around a product?\r\n\r\n\r\nJake Colling (00:58.05)\r\nYeah, proper startup, yeah, proper startup building. It's called Carrot. It's gonna be the easiest way to build and use AI powered workflows. So think something like Zapier or N8n, which is way, way, way simpler and AI native from the beginning. So you can just go from a prompt to a fully generated workflow and it will just be easy and work the way you want it to.\r\n\r\n\r\nNikolas Hulewsky (01:24.74)\r\nVery cool. Yeah, I've been messing around a lot with make, Zapier, NAN, Flowwise is another one. I just know about them. I literally made my first make automation today. So I'm feeling pretty good, Tell me, which models do you use and why?\r\n\r\n\r\nJake Colling (01:40.493)\r\nNice.\r\n\r\n\r\nJake Colling (01:48.126)\r\nYou know, gotta say Gemini is very, Gemini, think Google's like the sleeping giant. I think a lot of people in the AI space have had not nice things to say about Google, but I definitely think they are a lot better positioned than people give them credit for. Of course, Quad is fantastic for code. OpenAI has some secret sauce sometimes, but these days Gemini is just really pushing the cost performance.\r\n\r\n\r\nNikolas Hulewsky (02:05.702)\r\nWow.\r\n\r\n\r\nJake Colling (02:15.177)\r\nbalance forward in really interesting way. So a lot of businesses, need a really common use case is processing documents. And Gemini is just the best for that. It's fast, it's cheap, it's good enough. actually primarily using Gemini models at this point.\r\n\r\n\r\nNikolas Hulewsky (02:29.916)\r\nYou are the first person to tell me that you're primarily using Gemini. It's not necessarily a bad thing. I did have one person tell me they use Gemini for, because Gemini knows the Google Suite really well, so if they're running automations, they'll go to Gemini to ask it, like how to set stuff up. But as far as a model goes, most people are flawed and chat GPT with a very close second of grok. Grok is like, actually surprisingly, a lot of people are using grok.\r\n\r\n\r\nJake Colling (02:35.627)\r\nYeah, that's interesting.\r\n\r\n\r\nJake Colling (02:43.583)\r\nYeah.\r\n\r\n\r\nJake Colling (02:57.227)\r\nyeah.\r\n\r\n\r\nNikolas Hulewsky (02:59.749)\r\nInteresting.\r\n\r\n\r\nJake Colling (02:59.821)\r\nYeah, well, I'd say it does depend too, like my, you know, my, I'm coding, what I'll be using is primarily Claude then, you know, within cursor, like very kind of standard coding setup for that. But then in actual product itself, I find that Gemini strikes that right balance. So I think at this point it's surprisingly use case dependent.\r\n\r\n\r\nNikolas Hulewsky (03:18.524)\r\nYeah, it really, really is. And even people who use it for creative, I've found are like, I don't like OpenAI or chat GPT because it sounds too stuffy. I like Claude, which has been interesting because I kind of it's I think this is my personal opinion. don't know. I think it's just chat GPT so ubiquitous.\r\n\r\n\r\nJake Colling (03:36.097)\r\nYeah, a little more human element.\r\n\r\n\r\nNikolas Hulewsky (03:47.772)\r\nSo you've seen the output of ChatGBT so many times. That collage is different. So it's because it feels different, it feels more human. Whereas ChatGBT, like you've seen that all over the place. Anyways, that's my personal opinion. I don't know if I'm right or not. OK, so what's interesting is you said it's use case dependent, which more and more I think that's the way it's going right now. It doesn't seem like there's\r\n\r\n\r\nJake Colling (03:50.657)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (04:15.576)\r\none ring to rule them all, so to speak, one model to rule them all. Is that fair?\r\n\r\n\r\nJake Colling (04:18.817)\r\nYeah, definitely not yet.\r\n\r\n\r\nI think we'll...\r\n\r\n\r\nNikolas Hulewsky (04:23.59)\r\nDo you see any, is there any model that you're like, one might have a chance to be the model?\r\n\r\n\r\nJake Colling (04:33.448)\r\nIt's hard. One of the things is that code is so pervasive. You can do anything with code. So in some ways, I'm worried that Anthropic is going to fall behind if they're not able to raise the capital to keep up with the bigger players. mean, Anthropic is a huge player. They just raised a couple of billion dollars. But when you compare that to Google's infrastructure and the investments that they've been making in AI for decades at this point. Anyways.\r\n\r\n\r\nI think there's some industry dynamics that are really interesting to think about if we zoom out a little bit. But Claude is winning at code and that's really worth paying attention to because so much is code and if you can write code, you can do anything with it. So I think Claude has a chance of really pulling ahead. The recent model from OpenAI, the GPT-4.5, it really does have a different flavor to it. Like it's significantly better at writing and sounding human in writing. And I find that to...\r\n\r\n\r\nNikolas Hulewsky (05:26.075)\r\nIt is.\r\n\r\n\r\nJake Colling (05:28.307)\r\nExcel for like content creation. Like if you use, that is by far the best model for sounding like a human and for having a more like empathetic writing style. And like that's a pretty, I mean, that's one of the huge use cases in AI right now is like writing content, writing copywriting blogs, writing sales emails. And so if you can make that 1 % better, you know, that's enough for you to be, you know, the winner takes all model in that space. Grok interesting for political reasons.\r\n\r\n\r\nlike, you whichever side of the aisle you're on, just, they're trying to take a really different approach to the model. And I think that's worth paying attention to and having just like real time. Yeah.\r\n\r\n\r\nNikolas Hulewsky (06:03.302)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (06:06.724)\r\npolitical.\r\n\r\n\r\nJake Colling (06:09.247)\r\nnot I think it's I think it's driving to be like as apolitical as possible I think that pushes it into different like space of political in my opinion I haven't used grok that much I'm surprised with the reaction to like a lot of people are really enjoying it this is not to say anything bad about grok I just\r\n\r\n\r\nNikolas Hulewsky (06:25.884)\r\nI've seen a lot of, I haven't seen it be political, like, you know, in the weird, like when Bard had that update and there, George Washington was black and it was like, what, well, the friggin' so on. So I haven't, that was actually political? Yeah, yeah, yeah. So I haven't, I haven't necessarily seen that from Grok. I've even seen where it's like, who's the leading purveyor of disinformation on Twitter? And it's like, Elon Musk, like even Grok. So part of me is like, cool.\r\n\r\n\r\nJake Colling (06:37.575)\r\nyeah, yeah, that was actually political.\r\n\r\n\r\nJake Colling (06:51.147)\r\nYeah, it's like Elon Musk. Yeah.\r\n\r\n\r\nNikolas Hulewsky (06:55.876)\r\nYeah. But at the same time, Grok's hard for me because I only use it in the Twitter X app, whatever you call it. And, I don't know. It just doesn't feel as useful yet as the open AI or, and I'm probably just cause I'm not using it with the ability for API integrations, I guess is what API calls and maybe Grok can, just haven't used it that way.\r\n\r\n\r\nJake Colling (07:04.183)\r\nYeah.\r\n\r\n\r\nJake Colling (07:19.168)\r\nYeah.\r\n\r\n\r\nYeah, I think they actually just announced a partnership with Versel, like the makers of Next.js to make an integration there and have API access. So I think it's coming down the pipeline. I definitely need to use GROK more before having any sort of judgment on it. I will call it like they've got frontier status super, super fast, like the 18 months from no GPUs to... They they sped...\r\n\r\n\r\nNikolas Hulewsky (07:28.334)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (07:33.82)\r\nAll right, it's coming.\r\n\r\n\r\nNikolas Hulewsky (07:44.272)\r\nWhat's that?\r\n\r\n\r\nWhat's frontier status? don't know what that means.\r\n\r\n\r\nJake Colling (07:50.929)\r\nLike a frontier model. Like it's a top tier model and they did it from zero in like 18 months and that's just incredible.\r\n\r\n\r\nNikolas Hulewsky (07:54.992)\r\nokay.\r\n\r\n\r\nNikolas Hulewsky (07:59.428)\r\nIt is incredible. They also have an incredibly large data set that they're able to pull from. Now granted, I don't know how great the data set is, but it's a data set. Let's just hop into the meat and potatoes, dude. How are you currently using AI on a daily basis? I'd love to see some of the stuff you're using it for.\r\n\r\n\r\nJake Colling (08:10.476)\r\nYeah.\r\n\r\n\r\nJake Colling (08:17.079)\r\nCool, yeah, I use AI primarily for coding. I don't have anything queued up to speak to it on that sense. can shift gears if we want to get into that, but it's all the standard coding, so I think a ton of people are talking about it at this point. The other stuff that I'm using AI for is to manage aspects of my business and also to help people manage parts of their business. So getting email reminders of leads that I need to follow up with today.\r\n\r\n\r\nNikolas Hulewsky (08:20.988)\r\nOkay. That's good.\r\n\r\n\r\nJake Colling (08:43.013)\r\nscraping website content and parsing it out into a structured data set, and then doing additional operations on that. lot of like sales enablement, either enriching data, parsing data, very useful. there was one, and then like document processing.\r\n\r\n\r\nNikolas Hulewsky (08:57.436)\r\nThat seems like, that seems to be a... Go ahead, sorry, finish your thought.\r\n\r\n\r\nJake Colling (09:02.989)\r\nNo, just document processing in general, like pulling invoice information out of invoices and storing a PDF and then the actual details that you need so don't have to manually type it out.\r\n\r\n\r\nNikolas Hulewsky (09:12.051)\r\nHmm. That is, would say probably the most pervasive use case that I'm seeing so far is in sales. outside of copyright, outside of copywriting, like copywriting is like in my mind, but the easiest case that people are using it for not just marketing, but like, to send an email and how do I word this or what, you know, what argument should I make in this response? But beyond that sales I think has been, um, very interesting to see, right? Like who should I follow up with?\r\n\r\n\r\nJake Colling (09:20.653)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (09:41.696)\r\nWhere are they in the pipeline, et cetera? Are you building custom tools for that? Or have you built your own personal custom tool? Like how are you utilizing it?\r\n\r\n\r\nJake Colling (09:51.022)\r\nYeah, really dog-fooding with care right now. I'm trying not to make it just a sales pitch, we integrate with tools. We integrate with tools like Airtable. And so I've just started to use Airtable to manage some of that. And so I have some leads set up in Airtable and a feature that we're working on today is just every day it's going to look at the leads list and I have a, make sure I follow up with this person on this date. And if I haven't done that yet, it'll send me an email. So it'll just read my Airtable instructions or my Airtable content and then send me an email of.\r\n\r\n\r\nNikolas Hulewsky (09:55.44)\r\nDo your thing, man. No, this is good.\r\n\r\n\r\nJake Colling (10:19.863)\r\nwho I haven't followed up with recently.\r\n\r\n\r\nNikolas Hulewsky (10:22.204)\r\nOkay, this is very stupid question. Airtable doesn't have that functionality already. Like, I can't set a reminder on specific prospects.\r\n\r\n\r\nJake Colling (10:31.213)\r\nYeah, I'm sure you can. It's honestly easier in something like carrot, because I can just type in like, Hey, look at my air table and do this and send me an email. And it's just English to workflow. And there's no like manually, you know, fiddling around parts. So you know, could I could definitely code all that or do an air. Yeah, let's do it. Before I share my screen, let me make sure that I don't have anything that I shouldn't be broadcasting.\r\n\r\n\r\nNikolas Hulewsky (10:44.678)\r\nCan you show me it?\r\n\r\n\r\nNikolas Hulewsky (10:49.507)\r\nI'd love to see it.\r\n\r\n\r\nNikolas Hulewsky (10:54.268)\r\nWell, and what, yeah, don't know, worries. And what you're describing, I think is what's really been interesting about this shift is it's natural language where I think you still need some coding experience to be really good at things like cursor in particular. But there are these other things like lovable, even replet, I think it's kind of a step down. Like you can be pretty dangerous even not knowing coding and you can create software using natural language.\r\n\r\n\r\nJake Colling (11:12.173)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (11:23.58)\r\nIt may take you a little longer. may have to use AI as like a co-pilot as you're doing all this stuff. like the ability to just say, Hey, I'm trying to do X, Y, and Z. And then it spits it out for you is incredible. And that sounds like kind of the idea behind carrot, right? It's like, Hey, I want to build this workflow. And it goes from natural language to actually building it out.\r\n\r\n\r\nJake Colling (11:42.03)\r\nYeah. Yep. And the goal is to go, like, if you have like a little inkling of, of technical expertise or you've read code before, you'd feel comfortable jumping into something like REPLIT or a caret. And we want to go even one layer less technical where if you can describe what you want it to do, then it can, it can do it, you know, within the systems and integrations that we have. All right. Um, it's going to be really funny because the UI is not very sexy because you shouldn't be spending that much time in the caret UI.\r\n\r\n\r\nSo there's more work to be done there, but ideally.\r\n\r\n\r\nNikolas Hulewsky (12:12.412)\r\nNo, no, no, I think it's just interesting to look at the way that you're. Yeah, you're just I'm curious of the way you're architecting things so.\r\n\r\n\r\nJake Colling (12:23.307)\r\nYeah, so let's, yeah, you should, can you see Airtable right now? Yeah, okay. So, so here we got Airtable. I should be doing a better job of keeping some of this stuff updated. This is, know, essentially a small sample, but there's a handful of people I need to follow up with. There's like some Reddit accounts that I need to follow up with. And then in...\r\n\r\n\r\nNikolas Hulewsky (12:23.451)\r\nOkay, so this is Carrot.\r\n\r\n\r\nNikolas Hulewsky (12:29.265)\r\nYep. Yep.\r\n\r\n\r\nNikolas Hulewsky (12:42.436)\r\nAnd did you hand key these in?\r\n\r\n\r\nJake Colling (12:46.573)\r\nThese were hand-keyed. Another demo that I have queued up for you if you want to get into it is one of the folks in that list actually is he sells fractional CFO services to lawyers. And so we were looking at how to use care to take the whole like Texas Bar Association and get all the information out and.\r\n\r\n\r\nNikolas Hulewsky (12:57.849)\r\nNikolas Hulewsky (13:05.5)\r\nThat's awesome. I'm curious about the air table thing. Well, the hand keys like, dude, a lot of businesses are hand keyed. you're speaking to a lot of business owners who this is what their setup looks like. So this is perfect.\r\n\r\n\r\nJake Colling (13:09.109)\r\nYeah. So then we have more details, less hand keyed.\r\n\r\n\r\nJake Colling (13:16.608)\r\nJake Colling (13:25.013)\r\nYeah, yeah. And pretty much in carrot, then all we're doing for this is we need to set up to run on a trigger, you know, as a time later, but all we're doing is click and run. You can see from some testing examples earlier, it should live demos always have a tendency to break, but it'll spin up here in a second. then\r\n\r\n\r\nNikolas Hulewsky (13:41.436)\r\nAnd what\r\n\r\n\r\nNikolas Hulewsky (13:45.678)\r\nWhat specifically is it running?\r\n\r\n\r\nJake Colling (13:50.434)\r\nThis one, sorry, I guess I didn't even walk through the creation process. This is running a really simple workflow of Airtable list records, AI generate, and then email self. So creating this workflow, let's walk through that, because I want to show you how easy this is. So I'm now going through the creation process here. I want to create a new Airtable workflow. So I select Airtable, and it'll think for a second.\r\n\r\n\r\nNikolas Hulewsky (14:03.626)\r\nMmm.\r\n\r\n\r\nJake Colling (14:17.741)\r\nand then pull up my\r\n\r\n\r\nNikolas Hulewsky (14:20.848)\r\nAnd are those the only three that you have? Google, Notion, Airtable.\r\n\r\n\r\nJake Colling (14:26.221)\r\nCorrect, yeah, we're quite early. That'll get expanded. QuickBooks and HubSpot are coming soon.\r\n\r\n\r\nJake Colling (14:35.277)\r\nSo I don't know if you saw there, but I just selected my leads table. So now when I create this workflow, it's going to have all this information. And then to create the workflow, all I have to do is say, you know, look at my leads, see who I need to follow up with today and send me an email summarizing it. And that's it. There's no like manually configuring anything, no fiddling with stuff.\r\n\r\n\r\nJust give it the English like that and get workflow created successfully and now we have a fresh workflow that\r\n\r\n\r\nNikolas Hulewsky (15:08.124)\r\nSo how does it, how does it?\r\n\r\n\r\nHow does it know who you need to work up follow up today? If you go back to the air table.\r\n\r\n\r\nJake Colling (15:15.959)\r\nThat's the magic.\r\n\r\n\r\nin this case we have, you know, last contacted next call update. So that's something I personally use to keep track of stuff. and then behind the scenes when it creates this, like essentially the list air table record step, it'll write an air table formula to, you know, to match against those columns. and so it's smart enough to know how to like work with the air table API. You don't have to configure any of that yourself. You just like kind of give it the intent. and then it'll translate into whatever the API call needs to be.\r\n\r\n\r\nNikolas Hulewsky (15:23.772)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (15:49.296)\r\nAnd with this column, next follow-up date, the software carrot understands with context, like, that's the date. so whatever today is, those are the ones I'm sending to Jake. You didn't need to explicitly say, use the date in this column. It's, it's just going to know that.\r\n\r\n\r\nJake Colling (16:07.661)\r\nCorrect. Yep. Yep.\r\n\r\n\r\nJake Colling (16:13.689)\r\nLet's see, so this is, triggered it. You should see my email now. You can also see all the test runs from earlier. So the previous workflow we generated, I just hit run on that. So we just got a fresh email at 250 and it says, know, followed with OC, Bookkeeping Pro, OXA. Oh.\r\n\r\n\r\nNikolas Hulewsky (16:26.224)\r\nI just see the air table for now.\r\n\r\n\r\nJake Colling (16:32.765)\r\nYeah, let me switch the whole screen here. Sorry for the infinite mirror there. nice. So yeah.\r\n\r\n\r\nNikolas Hulewsky (16:39.676)\r\nNice. We can edit this, don't we?\r\n\r\n\r\nso this is the email you got.\r\n\r\n\r\nJake Colling (16:49.197)\r\nCorrect, yeah. So I gave that prompt and I said, send me a summary with this information. And of course, if the air table is more detailed or my prompt is more detailed, we'd get more information. But just with that, I get a nice indication of, hey, here's today's leads follow-up summary. Here are the people that you need to follow up with today. And it actually, we can double check a couple of these.\r\n\r\n\r\nNikolas Hulewsky (17:04.166)\r\nMmm.\r\n\r\n\r\nJake Colling (17:14.996)\r\nRyan O'Connor's in the list, I do need to follow up with him today. This guy, Griffey, that's his Twitter handle, 310, so he should not be in the list. yeah, he's not in here. So it looks like it did work correctly where it matched with the people I need to follow up with today, but anyone else like Griffey or Ed Vajro, I did not have them included in the list here.\r\n\r\n\r\nNikolas Hulewsky (17:39.334)\r\nVery cool, And then the notes, you can go and say like, okay, what was this conversation about? And it just takes you to that Reddit comment. Very cool.\r\n\r\n\r\nJake Colling (17:49.163)\r\nYup, yeah, that's exactly what's going on, because these were comments that I wanted to, you know, be able to reference specifically when I followed up with them.\r\n\r\n\r\nNikolas Hulewsky (17:58.022)\r\nCool. This is awesome. Yeah, so this is your own internal use case for some automations.\r\n\r\n\r\nJake Colling (18:09.749)\r\nYep, yeah. What do you think? Do want to jump into this other one that's like a web scrape and parse into Airtable for a slightly different use case? That's not my use case.\r\n\r\n\r\nNikolas Hulewsky (18:10.652)\r\nAll right.\r\n\r\n\r\nYeah, yeah, yeah, I wanna see it. Yep.\r\n\r\n\r\nNikolas Hulewsky (18:22.556)\r\nAbsolutely, let's see it.\r\n\r\n\r\nJake Colling (18:28.045)\r\nI have just lost it there.\r\n\r\n\r\nNikolas Hulewsky (18:30.714)\r\nCan you hear me now, dealer?\r\n\r\n\r\nJake Colling (18:33.556)\r\nI can hear you now.\r\n\r\n\r\nNikolas Hulewsky (18:36.41)\r\nYeah, so this is a bunch of names from the Texas Bar Association because they are a CPA that's targeting these leads basically.\r\n\r\n\r\nJake Colling (18:46.261)\r\nYeah. Yep. Let me switch.\r\n\r\n\r\nNikolas Hulewsky (18:48.476)\r\nAnd what are they utilizing AI for? Is it for the scraping or is it for the campaign to contact them?\r\n\r\n\r\nJake Colling (18:56.077)\r\nWe can do both, but I think what you might find interesting is just the scraping part. So we won't walk through the workflow creation with this, but this is what the website looks like. And he wants to find all this information and then go through a couple of different steps of scraping. To do this initial scraping piece, though, we have a workflow. Let me pull it up. The prompt for this, to zoom out a little bit, was, hey,\r\n\r\n\r\nThis is what my air table looks like, know, lawyer name, firm name, firm size, whatever. Scrape the website and then format the data and insert it into this. And then from there on, you have do is grab the URL for whatever lawyer that you want to scrape their information on, drop it in here, click run, and it'll parse out all of their information and store it in each of these columns. And again, the magic here is that like creating this workflow, you didn't have to manually configure anything.\r\n\r\n\r\nIt was just provide information about what the air table looks like or generally what information you want to scrape and then it'll take care of it from there.\r\n\r\n\r\nNikolas Hulewsky (20:01.062)\r\nAnd this is all built on top of Carrot. This is not using Make or Zapier or any of those other automation. I don't know what to call those.\r\n\r\n\r\nJake Colling (20:11.309)\r\nCorrect. Yeah, yep. So yeah, it's all in-house. It's the software that we're building. We kind of have a target on N8n and Zapier's back. Not actually, I'm not that kind of person, but they're just really complicated solutions. They're complicated solutions. When you work with them, you eventually get into visual programming, because you have to do all these retries and if-then and...\r\n\r\n\r\nNikolas Hulewsky (20:24.72)\r\nHahaha\r\n\r\n\r\nThey are. Yeah, it's true.\r\n\r\n\r\nJake Colling (20:38.285)\r\nYou know, it ends up being like you have to be technical to use them. And there's just a whole world of opportunity where AI can do stuff for us now, but you still have to be technical to even use the non-technical stuff. And it's like, how can we really get in the hands of like the least technical person?\r\n\r\n\r\nNikolas Hulewsky (20:52.442)\r\nYeah. How long did it take you to build the current version of Carrot?\r\n\r\n\r\nJake Colling (20:59.915)\r\nThe current version of Carrot was, we've pivoted recently and we've been at it, myself and my co-founder for three or four weeks total now on this iteration of Carrot with a ton of like groundwork laid previously.\r\n\r\n\r\nNikolas Hulewsky (21:12.08)\r\nAnd how\r\n\r\n\r\nmuch has been built in Carrot using things like cursor, Claude, maybe you're using Replet. I don't think you are, but has a lot been used?\r\n\r\n\r\nJake Colling (21:26.121)\r\nNo. Yeah, all cursor and just a ton. Yeah, tons. It's definitely just a game changer.\r\n\r\n\r\nNikolas Hulewsky (21:30.108)\r\nOkay, so if three to four weeks to get you to here with those tools, how long would it have taken you with traditional tools or without those tools?\r\n\r\n\r\nJake Colling (21:43.701)\r\nYeah, let's see. I'd say, so three to four weeks is maybe a little ungenerous. It's probably longer than that. It's just hard to suss out from the previous iteration of the product. But.\r\n\r\n\r\nNikolas Hulewsky (21:52.337)\r\nSir.\r\n\r\n\r\nJake Colling (21:56.811)\r\nYou know, it's easily a, you know, let's try a different, it's like, it's like easily two or three times faster. Like I have two or three times more productive today than I was two years ago.\r\n\r\n\r\nNikolas Hulewsky (22:10.95)\r\nWow, okay, so theoretically, let's just say what used to take you three months can take you a month.\r\n\r\n\r\nJake Colling (22:21.429)\r\nYeah. Yeah, I'd say like it's, it's in, it's in that ballpark of productivity improvement. And I'd say like some of that is you need to, to get that level of efficiency, have to have a project that is set up to, to gain those efficiencies. And sometimes that's tricky in established code bases. And I don't think it's necessarily because of the complexity of the code base. It's because things aren't necessarily set up to be AI friendly, but if you optimize your code,\r\n\r\n\r\nand the structure of your project and how you're writing code to be AI friendly, then it works really, really well. And you can layer that into an existing project. It's obviously easier if you're starting with like a greenfield clean repo, but you just have to be intentional about it either way.\r\n\r\n\r\nNikolas Hulewsky (23:02.716)\r\nThat's awesome. Well, Jake, this was rad, man. Thank you so much. Can I just go to carrot.ai?\r\n\r\n\r\nJake Colling (23:13.485)\r\nYeah, I wish. We'll get the .ai domain eventually. It's caratai.app, unfortunately. You know, once we raise a couple million dollars of VC money, we'll maybe we'll go blow some of it on a domain name. But no, caratai.app, is closed as of right now while we're recording this, but by the time it's published, it will be open. And we're actually opening it later today to new signups. So yeah, if you want any help automating any parts of your business, would love to help you out.\r\n\r\n\r\nNikolas Hulewsky (23:15.748)\r\nNikolas Hulewsky (23:33.2)\r\nbe open.\r\n\r\n\r\nNikolas Hulewsky (23:37.372)\r\nAwesome,\r\n\r\n\r\nNikolas Hulewsky (23:42.492)\r\nSweet, okay, thank you Jake.",
  "metadata": {
    "duration": "",
    "date": "2025-04-24",
    "platform_source": "Google Drive"
  }
}