{
  "episode_number": "11",
  "episode_title": "Mastering the Leap: From Worker to Owner",
  "guest_name": "Various",
  "business_name": "",
  "transcript": "﻿Welcome to Nikonomics. We've got Nicholas on today. Great name. You're in Canada. I am. You've got some awesome experience and you sent me a question  recently about trying to find a business and where I might  look for those and how I might find those. So just to tee it up, give me a little bit of your background.\r\n\r\n\r\nAnd then what you're currently interested in. Graduated from university and went for business communications at Brock University. And basically it took me two years to find a career type job. And in that time I worked construction, I worked  seven days a week in a poutine truck doing concerts.\r\n\r\n\r\nInterviewed for everything under the sun and I ended up in logistics. Fast forward over the last 10 years, I have had a number of jobs. I did sales support for the top three global forwarders. Did some trucking for an American company for anywhere. I think that was between two and three years. The general feeling is you've got.\r\n\r\n\r\nYou've got a broad history. You've got a lot of history  and  you're coming to the point where you want to,  you're interested in buying a business. And so you're trying to figure out how you do that.  Okay. Yeah. Cool.  I like your background in purchasing nine  starting five from scratch. And then maybe we can go into you a little bit about what those five were from scratch. \r\n\r\n\r\nYeah. So I've got a business partner. ADHD at the wazoo, shiny ball syndrome, shiny object syndrome. And so we've started a lot of businesses from scratch, but I've also got a corporate experience. So I worked in healthcare and I decided at one point I was done working for other people.\r\n\r\n\r\nSo I'm going to buy a business. So I bought my first business and then I bought. Several other businesses quickly turned into nine businesses that I bought or started and sold. So there's, I have a lot of experience up to the 10 million  business size mark past that. I don't know.\r\n\r\n\r\nI'm useless. It's all theoretical past that. But the 10 million and under, like I have a lot of experience. In that space. And that's most people, right? That's like most people just trying to get into entrepreneurship and all right, how do I buy a business, et cetera? I always say the first step is like knowing yourself.\r\n\r\n\r\nSo  I'm going to ask just  actually, I'm not even gonna ask these questions. I'm going to tell you these questions and then we'll talk about the tactical nitty gritty stuff.  I think first you need to identify within yourself what your risk profile is.  Are you somebody who likes to put it all in black or are you somebody who  has a wife and kids and you're like and a mortgage and you're like, I can't really,  I can't miss on whatever I'm going to do next. \r\n\r\n\r\nSo I think that thinking really shapes what kind of business you're going to start or buy. I also don't know Canada exceptionally well in the United States. We have this program called the SBA small business administration where we can purchase businesses and they allow us with better terms to purchase these businesses.\r\n\r\n\r\nBut I, I don't know if Canada has the same type of  opportunity. So that may be a potentially a limiting factor.  This, the second question I would ask yourself is like capital. How much capital do I have?  Not just to buy the business,  but as a cushion.  So let's say you're looking at a million dollar business and you've got to put 20 percent down.\r\n\r\n\r\nYou need at least 200, 000 of course, but  You probably also need to plan for a year  of cushion in there. So if you make a hundred thousand dollars a year right now, you probably wanna have another a hundred thousand dollars just sitting there just in case. So really it's not the 200,000 you need down, it's probably $300,000 you just need. \r\n\r\n\r\nAnd the 200, 000 could be outside investors that come in to help you purchase that business. But you just want to think about having that cushion when it comes to capital. The next two I think are the ones that help you decide the business first. Your personal experience. It sounds like you've got a ton of experience.\r\n\r\n\r\nI would think about what you like and start to narrow down from there. Do you like being at a desk working on spreadsheets or do you like being with people? Do you like the sales process or do you like operations? Do you like just understanding where you are? Because that helps paint the picture of okay,  I know about myself that I'm active.\r\n\r\n\r\nI like to be outside. I like to be with people. Cool. You're probably going to like a services business that is sales oriented.  Or if you know that. You just like to be sitting behind a desk and a computer. Cool. I'm a find a B2B services company that doesn't require me to actually be out in front of people or have a massive team.\r\n\r\n\r\nSo anyways I think just like knowing some of those things about yourself  and then skills, right? Are you a coder? Are you an engineer?  Are those types of things? Again, going through that exercise and just like mapping it out  is the first step. And as you write out those attributes  from there, it's going to be fairly obvious, what kind of businesses you should be focusing on.\r\n\r\n\r\nIf that makes sense.  Yeah, it certainly does. Like I've asked myself a lot of those questions can I miss I could probably afford to miss my wife's got a decent job. I have some income properties back home in Ontario, moved out to BC. I've got a decent fund that I'm sitting on currently.\r\n\r\n\r\nAnd plus I got a lot of friends and I got a lot of high friends in places. And I'm just kidding. That's the DC folks. No, I can quickly access a lot of capital.  I don't think like money can really be an issue. If I take a jump, like I got  enough resources that I will land comfortably.\r\n\r\n\r\nAre there any of those like four areas? Are there any that you're struggling with?  Risk profile, capital. Personal or your skills? Is there any that you're like I dunno.  No, I think I got the skills down. So my, my previous role for the most part, I I listen to a lot of podcasts.\r\n\r\n\r\nI ask myself a lot of questions. I paint a lot of hypotheticals for myself. Okay. But I think the one that hits the most is the risk profile. And. Do I take that jump? And I think I will. But it's just  a matter of when and what, like I've done some, like I've done some exploration I've done, like there was like a paddleboard company.\r\n\r\n\r\nI'm like, that's too chill for me. I've done like a brewery. I was like, nah, I don't want to be doing that all day.  I looked at other similar profiles to what I'm currently doing because I know like a chain of owners that own warehouses, they own trucks, they own, and like I can snap it together easily, like just looking at their numbers about how to make it more profitable. \r\n\r\n\r\nHow old are you?  Me I'm 32 January, June. Any kids? No.  Okay. So I got a two and a half.  Oh, okay. You have one child. So you're young and your kids are young, right? So if you go bankrupt there's time to, to come back from that. I'm not saying you're going to go bankrupt, but yeah,  you're not, you're not twenties with no kids and no mortgage.\r\n\r\n\r\nYou have a little bit of,  A little bit. You have responsibilities.  So I think being thoughtful about that approach are you a sales guy  or are you an off? Absolutely. So I'm actually a bit of both and that answers it. So I'll just, I'll give the background to that. Yeah. So I took a number of courses, worked in operations, but then went out to sales.\r\n\r\n\r\nWhat I was going to say is if if you were an ops guy,  then I would say go for a little bit bigger of a business, right? 500,  It's probably going to be the baseline for an ops guy because they need a business that can support them right away for the year. Whereas  say again,  even after the year. \r\n\r\n\r\nYeah. No. For the year. Okay. Okay. Now you're bringing up a whole other question. The way you answered that. God has me curious. But what I'm trying to say is If you're an ops guy and you're like, Hey, I'm not great at sales. Then you want to buy a business that's already got enough to support you.\r\n\r\n\r\nDay one. If you're a sales guy, then you can go out and buy a business. Like it's a good business, but maybe the profit's not there to necessarily support you because you have the confidence to go out and say, I'm going to go and double triple the size of this business. Now if 500, 000 a year is too low for you and you're like, no, I want to buy a business with 6 million.\r\n\r\n\r\nYeah. That's a totally different conversation, right? Like most people are looking at this and they're like, all right, I want to get in,  I'm buying a small business. Small business is usually going to be a million dollars a year in EBITDA or less. So are you're looking for a larger range than that?\r\n\r\n\r\nThat's where I see the sweet spot. That's awesome. It's just different when you become the business owner,  managing a segment versus managing the, and like owning the business. Yeah. Are just different before I, I bought my first business, I managed segments that were 30, 30 million a year in revenue.\r\n\r\n\r\nAnd so it gave me really good perspective and gave me really experienced managing operations, but there were still a ton of things that I didn't know. Like getting your insurance lined up under like your payroll processors, our banking and our credit card lines and our lines of credit.\r\n\r\n\r\nAnd I'm trying to think of our ERP systems are the it setups like all of that stuff I had never done before. So while I had the experience managing people and products and sales and all that stuff, like the guts, the administrative. Functions were just new to me.  So  it's not rocket science.\r\n\r\n\r\nIt's not incredibly difficult, but there, there will be a learning curve when you go and buy your first business.  So what I would recommend is  to go and find a business, not necessarily swinging for the fences, but to get your feet wet, get some experience. And then business number two, the acquisition can be like, okay, cool. \r\n\r\n\r\nI know what I'm doing now. I'm going to, now I'm going to level up to that next thing. Okay, here, I'm going to ask you some rapid fire questions.  Do you know, like what geography you want it to be in?  Yeah, I'm thinking that I'm going to be in BC at least. Okay, cool. Do you have an idea of a size?\r\n\r\n\r\nYeah, I'm thinking like  probably a team of like 10 to 20 people max. Cause I like that. I like that small environment. Like what about revenue?  What about revenue and profit? Do you have any idea of what size business? I'm thinking about like revenue. Cool. Maybe something around like 35 40 mil and profit around like six ish. \r\n\r\n\r\nOkay. Nope. So do you know what? Okay. Is that more in the bigger shot though? Oh, it's a big shot. Yeah. But if you're saying 10 to 20 employees and you're doing 35,  To 40 million. No those are going to be very specific businesses. So do you know what kind of business that you're looking for? That's why I'm, like I said, I'm shopping right now.\r\n\r\n\r\nLike I'm interested to dive into something, but I take on something, in my world, then I could do that. If it's because if it's 10 to 20 employees, you're probably dealing with something that's software B2B. White collar,  like it's not going to be a services business. It's not going to be something that you're going and providing in inpatients homes.\r\n\r\n\r\nLike I'll give you an example. I had a home health and hospice, 150, 200 employees, and we did 11 million a year in revenue. So you saying 35 to 40 million in revenue with 10 to 20 employees,  you're not doing a home services business is what I'm trying to, what I'm trying to say. Okay.  Do you know what kind of industries you're looking at or no, I've been spread all over the map.\r\n\r\n\r\nLike I've, worked with thousands of companies that have done like tons of different things. So I'm just, I don't know, I'm a little lost in that.  Before I go tell you how to find these businesses, then let me just ask, what do you like to do? What is your favorite thing  to do?\r\n\r\n\r\nI like growing, like the company culture. I like building like actual teams and I just like building stuff. I like the reason I did this is because.  Like I've been paying a lot of attention to emotion and things that kind of get me going And I was just thinking about it. I put a smile on my face.\r\n\r\n\r\nI was like, you know what? I'll do it Let's do that. Like it's fun  I've done like events and trade shows and all kinds of stuff. Like I went to like collision It's like one of the biggest tech conferences and in the world held in Toronto and I just said  You know, lack of better terms, fuck it. I was like, I went as a, I went as a volunteer.\r\n\r\n\r\nI met a CEO of a robotics company. And a bunch of kids that were trying to find jobs. Like I just talk to thousands of different people and, I'd like to understand like their walk of the world and where they came from and like how I can take their cheat codes and apply them to my life and just, I just like exploring things.\r\n\r\n\r\nThat if I could turn that into a business, great. But that's a podcast and that's not, I think my unfair advantage is honestly like relationship building like . Okay. For the most part.  Dude, that, that's so alright. I mean that, that's good. That's a good place to start. If it's relationship building, I wouldn't buy a product.\r\n\r\n\r\nI wouldn't buy a product that you're selling direct to consumers.  I would look at a B2B product. That could be a SaaS or it could be a physical product. But you need to be in a space where you can go and build a relationship with one person and it turns and that one can turn into, hundreds of sales.\r\n\r\n\r\nSo you're selling into enterprise opportunities.  So I would stay away from the products of direct to consumer. I would look at B2B. I would probably look at, Some type of software business, if you could. But you may even look into events, businesses, because those are very relational in their orientation.\r\n\r\n\r\nI would stay away from  capital intensive businesses. So construction manufacturing,  unless you have a real passion for those, but I would stay away from those. Those are expensive. They're capital intensive. And then I would look for businesses that are close to you. I wouldn't look for a business that's remote. \r\n\r\n\r\nIf you could make it work, I'm not saying you couldn't make it work, but if your superpower is your personality and your relationships and you're like your ability to forge those and keep people together, then you need to find a business that's close enough to you that you can go in every day and run.\r\n\r\n\r\nAnd then that you can go to the customers in the community or in the wherever you are and like in person meet with them.  So that's spot on, but that's honestly spot like  just the way it is, the way that, I've even organized myself in my role. It's being close to the business. Like that even told me a little bit more about myself just from an outsider perspective, for example. \r\n\r\n\r\nNo, that's cool. That's awesome.  So like just knowing those little things about yourself, I would narrow it. I'd be like, okay, this is the geography. Cause these are the places I'm willing to move. Or this is the place where I currently live.  These are the types of industries are B2B software. I would adjust your size.\r\n\r\n\r\nI wouldn't just say. 6 million in EBITDA or bust. That could, you could do that. I'm not saying you, you shouldn't look for those types of businesses, but I would look probably a million dollars or less. And here's why, if you're going to buy a business that's doing 6 million a year or more in EBITDA,  they're going to be more expensive.\r\n\r\n\r\nAnd I, I don't mean they're going to cost more money. Because that's a no brainer, right? Of course it's going to cost more money. What I mean is the multiple that you're paying for that business is going to be more. You buy a business doing a million dollars a year in EBITDA, you're probably paying five times.\r\n\r\n\r\nIt's just a rough number. If you go try to buy as a business, it's doing 6 million in EBITDA. You're probably paying eight times EBITDA,  right? So the multi there's a higher multiple for those types of businesses. So I would, if you're that confident in your ability to build a team and to scale, I would buy something with a lower multiple that's cheaper. \r\n\r\n\r\nAnd then grow into the 6 million  EBITDA number,  because you're going to, you're going to add value, right? Like you, Oh, cool. I spent 5 million to buy a 1 million in EBITDA business. I grew it to 6 million. Now it's not worth 30 million. Cause I'm not using the five times.  It's worth 48 million because I'm using the eight times EBITDA number, right?\r\n\r\n\r\nSo you get a multiple pop as well as you grew the revenue base. So I would look for a smaller business on that. And that's why these private equity firms in particular, when they're doing search funds, they look for that million to 2 million in EBITDA range, because then they can grow it and scale it.\r\n\r\n\r\nIf your skillset is growing and scaling, then I would start with a lower base  in order to grow you and add more value. Thank you. Over, over that period of time, there are two different ways you can buy businesses. You can buy them on market or you can buy them off market  on market. You're going to be going through brokers. \r\n\r\n\r\nAnd  my advice with brokers is  get as many reps in as you can.  So you just want to talk to as many as you can and just really get your reps in once you've decided, okay, here are the geographies. Here's the type of businesses. Here's the size of businesses.  Then I would start looking for specific brokers. \r\n\r\n\r\nThat represent those types of businesses. So there's one of two ways you can with brokers, there's a couple of ways you can do it. One, you can look geographically, you can say, Oh, okay, I want to find all the brokers in BC  or all the brokers in Vancouver, right? Cause there's going to brokers don't necessarily cover the whole state that they're probably a smaller geographic region like Vancouver.\r\n\r\n\r\nSo you can look at geographically or you can say, all right, I'm going to look for brokers in the educational software industry. So there are geographic brokers, but then there are also industry specific brokers  that, that, that are just experts in medical billing, or they're just expert in construction selling, or they're just experts in whatever industry. \r\n\r\n\r\nSo I would start looking for those types of brokers first.  And maybe sometimes you have some of the overlap that it's like, Oh, he's a tech broker that specializes in Vancouver tech businesses. But those are just very rare.  So you're going to have to look for brokers in  geographically and then business specific areas.\r\n\r\n\r\nSo I would just start googling and looking for brokers in those areas. The second thing that I would do  is I would go to a bank  and I would say, look, I'm trying to buy a business.  I want you to prequalify me. You did that.  Oh, awesome. What did they qualify you up to? \r\n\r\n\r\nA loan, four and a half million dollar loan.  Perfect. Perfect. Yeah. Okay. So perfect. Now you have this letter. And so when you go to these brokers, you can say, Hey, look,  my name's Nicholas. These are the types of businesses that I'm trying to buy. The bank's already approved me up to this limit.  You're showing them that you're serious, right?\r\n\r\n\r\nCause brokers get a ton of tire kickers, but you're showing them now I'm somebody that you should work with to look for a business. And then you explain them, explain to them exactly what you want. This is the size of business. This is the industry. This is the geography. This is the number of employees.\r\n\r\n\r\nThis is the, here's the bank letter that I have. It's going to make your process just way easier to go through.  Yeah. So that's the broker out. And then I would choose one or two brokers that. That you like and just build a good relationship with them.  It's almost like a pipeline methodology where we're slowly coming down the pipe.\r\n\r\n\r\nLike where it's get your geography, get your shit together, basically figure out what you want to do. Which is like your prospecting stage and you move down to like more of your target of what you want to focus in on. And then as it gets more refined, once you have your finances and credit, then you have your limited brokers.\r\n\r\n\r\nAnd once you get to the bottom of that pipeline deal, there you go. You got what  you want. Yeah.  So this is the way I'm seeing, I'm like, I'm literally building a pipeline. As we're talking, you are no, you are, that's the broker pipeline. So now we go to the off market pipeline. I would go to your network.\r\n\r\n\r\nCPAs, lawyers, this one might surprise you. Pastors,  anybody who has relationships with high net worth of individuals. That knows. Who is coming up to retirement. And if you go to those individuals and you say, Hey, look, I'm trying to buy a business and not just the pastors, the CPAs, the lawyers that are doing estate planning, they're doing tax planning.\r\n\r\n\r\nAnd you're like, Hey look, I'm trying to buy a business. This is my background. This is the type of business I'm looking for.  They're going to know who's potentially coming up  to retirement and looking to sell. Now that's a longer sales cycle than going to the broker. Cause the broker's Oh, I already have a business that are, that's on market.\r\n\r\n\r\nThese guys are probably going to be, a little bit longer of a sales cycle. Maybe you catch one of them. Who's Ready to sell right then. But I just had somebody who I talked to three months ago and I told them this strategy and they're under LO they're under LOI for a business right now because they went to one of their CPAs.\r\n\r\n\r\nLike it works. I know that it works. But I would just start, I would just start thinking about like your network and okay, who might I know that might be retiring or who might I know that might know someone who might be retiring? And then start reaching out. I think what you're going to find  Is that  you're almost there.\r\n\r\n\r\nLike you're really smart. You have really good experience. You know what you want, but as you refine that,  as you like dial in, okay,  I'm actually looking for a business that does a million dollars a year in software sales, B2B with an owner that's retiring in Vancouver, all of  a sudden you're going to find you're getting a bunch of these types of inbound, right?\r\n\r\n\r\nBecause you're being very specific and targeted. With your approach, if you're scattered and you're just like, Oh yeah,  I don't care. I'll look at everything.  It's very hard to filter. It's very hard to filter everything. But as you get specific, all of a sudden you have a conversation with a CPA that, you're like, Oh, Hey, Brian, you're a CPA.\r\n\r\n\r\nYeah. I'm a CPA. Here's the deal, man. I'm looking for a business to buy about a million dollars a year in EBITDA, give or take it's a B2B software business. Do you have anybody who's retiring? Like in, in the Vancouver area and like you give them that specific, it triggers something. But if you're just like, Oh, Hey Brian do you have any businesses that are for sale?\r\n\r\n\r\nIt's I don't know. I have 500 clients, they're like racking their brain. But when you get very specific, all of a sudden it triggers. If I were to narrow it down, I would say as you're looking for a business, the first thing to do would be. Know yourself, know thyself. What's my risk profile?\r\n\r\n\r\nHow much capital do I have? How much capital do I have? What's my personality like? What are my skills? Then once you know that,  then you got to narrow it down and create the profile for the perfect business.  Where is it? What's the size? What's the industry? Is it B2B? What kind of product or service?\r\n\r\n\r\nAnd then you can go to on market. Here are the brokers. And here,  I'm going to start building a relationship with these types of brokers and the off market here, the CPAs, the CAs, the businesses that I'm looking for. And then I promise you, if you do that in the next month or two, you will probably have one or two very credible business opportunities that you're able to evaluate.\r\n\r\n\r\nYou may not buy it, but it's, it'll be a business that is legit. I hope I hope it was helpful. And Yeah. Let me know how it goes.  No it's definitely helpful. I'll keep you in the loop and it was a good chat. So stay in touch. Say, man. All right. We'll talk later.  See ya. All right. Thank you, Andy.\r\n\r\n\r\nCiao. Bye.",
  "metadata": {
    "duration": "",
    "date": "2024-05-21",
    "platform_source": "Google Drive"
  }
}