{
  "episode_number": "188",
  "episode_title": "How to Become a Chick-fil-A Owner-Operator with Tim Sweetman",
  "guest_name": "Tim Sweetman",
  "business_name": "Chick-fil-A",
  "transcript": "﻿Nikolas Hulewsky (00:17.649)\r\nAll right, Tim Sweetman, Chick-fil-A franchisee. I am freaking excited to talk to you, because I know nothing about this space, and I go to Chick-fil-A every single week, like 50 % of America does. And I just want to learn about it. I want to figure out how this thing actually freaking works. Let me ask you a question. How many people did your Chick-fil-A location in Delaware service last year?\r\n\r\n\r\nTim Sweetman (00:42.337)\r\nActually, I did the math on this the other day. I'll phrase it this way. So I've been doing this for seven years. And we have served close to, I think it's about 3.5 million people since we opened in 2018. For us, we average around 40,000 customers every single month.\r\n\r\n\r\nNikolas Hulewsky (00:53.983)\r\nOkay.\r\n\r\n\r\nTim Sweetman (01:11.82)\r\nIt certainly depends. And so, yeah, you can do the math on that, but we generally kind of look at that on regular basis.\r\n\r\n\r\nNikolas Hulewsky (01:21.855)\r\n40,000 customers a month. like almost 500,000 people or unique transactions, whatever the metric is, a year.\r\n\r\n\r\nTim Sweetman (01:27.948)\r\nThat's right. That's right. Yeah, an incredible opportunity for impact and influence for us. We get to see so many people. And of course, that represents transactions. It doesn't represent the fact that most of those transactions probably have more than one person that's tied to that transaction as well. And so you can multiply that across families and couples and other individuals that are coming into the restaurant.\r\n\r\n\r\nNikolas Hulewsky (01:51.241)\r\nSure.\r\n\r\n\r\nYeah, yeah, yeah.\r\n\r\n\r\nA million, a million humans coming into your restaurant probably at least every year. So I did a little bit of research before we hopped on here. This was crazy to me. I wanted to know in the United States, cause I had heard the Chick-fil-A was good. Like what's the average annual spend per location? And so I went and looked at some comparative U S food chains and I have some numbers for you. you ready? Okay. You might, you might correct me. Here we go. average sales volume of a Whataburger.\r\n\r\n\r\nTim Sweetman (02:00.076)\r\nVery possible.\r\n\r\n\r\nTim Sweetman (02:19.19)\r\nSure, let's do it.\r\n\r\n\r\nNikolas Hulewsky (02:27.167)\r\n$4 million a year. Average sales volume of a McDonald's. A little bit higher, but it's about $4 million a year. Average sales volume of a Chipotle. What do you think?\r\n\r\n\r\nMore or less. Yeah, yeah, yeah. 3.1. The next highest, here we go. Raising Canes, this was a high one. 5.7. Chick-fil-A. This blew my mind. $8 million. It gave me a range, but the middle of that range is $8 million. So Chick-fil-A on average per location does $8 million a year in revenue. On average, McDonald's does half of that, four.\r\n\r\n\r\nTim Sweetman (02:41.045)\r\nThree? Four? Maybe?\r\n\r\n\r\nTim Sweetman (02:51.957)\r\nThey're killing it.\r\n\r\n\r\nNikolas Hulewsky (03:11.379)\r\nChipotle does $3 million. Like, these are big businesses that you have 15 year olds who just tell you, my pleasure running. It's nuts to me. How does it work?\r\n\r\n\r\nTim Sweetman (03:23.147)\r\nYeah, I think even some of the most recent data from the FDD, I think Patrick Buckley had posted some of this, again, it's now north of 9 million if you include all of the different restaurants. obviously, there's a wide range that's there. I think fundamentally, one of the phrases we use is we want to win the hearts of customers.\r\n\r\n\r\nNikolas Hulewsky (03:35.103)\r\nCheers.\r\n\r\n\r\nTim Sweetman (03:52.467)\r\nAnd I heard an operator, he's been an operator for 40 plus years, say this, a couple weeks ago, is winning hearts starts with willing hearts. And so it really is all about people. It's about selection of people. It's about being on top of that selection of people and finding and acquiring those people. What I've found, and we've done some of the research on this at Chick-fil-A, Chick-fil-A by and large invests more by a\r\n\r\n\r\nhuge magnitude in leadership and people compared to everyone else in QSR. And so it's this huge bet that we are investing in selecting talent. So the way that would look is your average QSR, and I obviously can't speak for everybody, but your average QSR is going to, quick service restaurant, your average McDonald's, you're raising canes, et cetera.\r\n\r\n\r\nNikolas Hulewsky (04:28.925)\r\nWhat does that mean? Like, what are they investing in?\r\n\r\n\r\nNikolas Hulewsky (04:41.983)\r\nCan you just define quickly? I'm sorry, what's a QSR? Yep.\r\n\r\n\r\nTim Sweetman (04:51.071)\r\nis gonna sit down with a 15 year old or a 16 year old, unlikely to be 15, but a teenager and look at them and say, you fog and mirror, you're generally okay, let's go one interview, one and done and hire them on the spot. that, the pulse test. Yeah, boom, go. And that's a significant amount of industries. Chick-fil-A for the longest time and probably from the beginning has made the strategic bet\r\n\r\n\r\nNikolas Hulewsky (05:07.423)\r\nI call it the pulse test. It's the pulse test. Do you have a pulse? Okay, cool, you're hired.\r\n\r\n\r\nTim Sweetman (05:20.863)\r\nthat we would rather run short of people than hire the wrong person. Culture is superior and we understand that ultimately the types of employees that we hire are going to be what ultimately the guest experiences and then causes them to return back to the restaurant at any given time. And so it is not uncommon for there to be two to three interviews for every single employee, whether they are 16 or 60.\r\n\r\n\r\nNikolas Hulewsky (05:22.559)\r\nYou\r\n\r\n\r\nTim Sweetman (05:51.395)\r\nAnd in most cases, I would say, including my restaurant, I do every single final interview. I will not let a person be hired at my restaurant unless I personally have met them and spoken with them and make that decision. And I've heard some of the best founders out there do that as well in other industries and other brands. You need to make sure that\r\n\r\n\r\nthat person that's going to be in that front counter is representing you well. And so that's just uncommon. And I don't know that people, when I say invest, like that's a big investment, right? That's an investment of time and energy. You're probably having a person that's making 60, 70, $80,000 a year. That sole job at a chicken restaurant is to hire people, take them through orientation, train them, develop them, et cetera. And then on top of that,\r\n\r\n\r\nWe've made strategic bets for a long time that even before we had the volumes that we had, we were hiring high caliber people, paying them a lot of money, sacrificing in the short term, maybe some profitability in order to have world class leaders that were there that are also developing and growing the young people that we're hiring.\r\n\r\n\r\nNikolas Hulewsky (07:02.707)\r\nMm-hmm.\r\n\r\n\r\nLet me ask you this question. If somebody on your team does not say, pleasure, when I say thank you, do they get fired?\r\n\r\n\r\nTim Sweetman (07:13.108)\r\nThey don't get fired. have a really... They're gonna be strongly encouraged. We actually have, my director of operations, he's been in general management for a really long time, worked for an incredible brand, Lifetime Fitness, and not used to saying my pleasure ever.\r\n\r\n\r\nNikolas Hulewsky (07:15.413)\r\nThey don't get fired, but they do get written down in the book.\r\n\r\n\r\nTim Sweetman (07:40.687)\r\nAnd so we give him a hard time all the time. I would be sitting in the dining room, he'd come by, drop the tray off. A wonderful person. And the person would say, thank you so much. And he would say, you're welcome. it was just, I mean, team members immediately are going, what are you doing? You're gone. You can't do that.\r\n\r\n\r\nNikolas Hulewsky (07:48.211)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (07:55.903)\r\nHey, hey, hey, hey, hey, hey, hey, hey, hey, hey, hey, hey, hey, hey, hey,\r\n\r\n\r\nTim Sweetman (08:00.081)\r\nYeah, that's right. Not acceptable. Not acceptable. So yeah, we're\r\n\r\n\r\nNikolas Hulewsky (08:04.127)\r\nSo is that one thing, like, I mean, I just never heard it explicitly said. Hey, we don't say you're welcome here, we say my pleasure. Like, is that outlined?\r\n\r\n\r\nTim Sweetman (08:14.803)\r\nthat is outlined in the past. wasn't, it was a cultural thing. And actually it's never, it hasn't been always part of who we are. Truett experienced it at the Ritz Carlton. I think he was actually having a conversation with Horace Schultze at the time. And Horace was talking about how Chick-fil-A needed to have a similar phrase, like my pleasure to upgrade the experience at Chick-fil-A. And Truett at the time just said,\r\n\r\n\r\nI think I like my pleasure. That sounds great. And Horst was like, no, you can't do that. There's no way. You the Ritz Carlton is the Ritz Carlton, you know, ladies and gentlemen, serving ladies and gentlemen, there's no way that's going to work in a fast food restaurant. And Truett was adamant. And for years, it wasn't anything more than just an expectation. He would come back every single year as they gathered operators together and say, I want you to be saying my pleasure. I want you to be saying my pleasure. And that started in early 2000s.\r\n\r\n\r\nit kind of grew and then there was an expectation for a long time and now it is a standard in the same way that we upgrade our language in a number of other ways. We try not to use the word customers, we use the word guests. You should never hear a team member come to your table and say, can I take the trash off the table? They're gonna say, can I just clear the table for you or clear the tray for you? We try to avoid, yeah, we try to say avoid the word trash.\r\n\r\n\r\nNikolas Hulewsky (09:36.073)\r\nReally?\r\n\r\n\r\nTim Sweetman (09:39.712)\r\nif at all possible, just to upgrade that language that's there. You're never gonna hear, in theory, a team member at the front counter say, can I help the next person? They will say, can I serve the next guest? We don't want to say anything like.\r\n\r\n\r\nNikolas Hulewsky (09:53.311)\r\nWow. It's funny, while you're saying that, I'm thinking back at my own experiences and be like, yeah, I get that. Yeah, that's true. That rings true.\r\n\r\n\r\nTim Sweetman (09:59.912)\r\nThat's right. We never use numbers. We're always gonna use names. We're gonna be asking for those names. And so I think that's one of the things that people don't realize about Chick-fil-A is obviously the very explicit open my pleasure thing happens, but it's the little details that sometimes guests don't notice and it's hard for them to put into words. Why is Chick-fil-A so different? And it's all the little things that add up. It's all those pieces of language. It's fresh flowers in the dining\r\n\r\n\r\nNikolas Hulewsky (10:25.343)\r\nMm-hmm.\r\n\r\n\r\nTim Sweetman (10:28.401)\r\nYou know, it's mints at the end of your meal. It's mouthwash in the bathrooms. It's the way that team members are dressed effectively. We absolutely have mouthwash. We have mouthwash in the bathrooms for guests. That's it.\r\n\r\n\r\nNikolas Hulewsky (10:36.063)\r\nWait, wait, wait, wait, your Chick-fil-A has mouthwash?\r\n\r\n\r\nfor guests?\r\n\r\n\r\nI need, you need to call someone about the Meridian Chick-fil-A, because I need mouth washing my freaking Chick-fil-A, dude.\r\n\r\n\r\nTim Sweetman (10:48.924)\r\nYou imagine, isn't that great? I'm going, you know, it should be, you shouldn't be paying Ritz Carlton money for it, but you should be experiencing Ritz Carlton level service when you go to your local Chick-fil-A. That should be the expectation.\r\n\r\n\r\nNikolas Hulewsky (11:06.941)\r\nWhy do you think that shared language is important? Why do you think that, Hey, my pleasure. Why do you think guests instead of customer? Why tray instead of trash person, you know, like, why do you think that that's been such a focus of Chick-fil-A?\r\n\r\n\r\nTim Sweetman (11:22.151)\r\nI think when the book Unreasonable Hospitality came out and also in the past, Danny Meyer's Setting the Table book came out. Those gave some language to that. And one of the things in Unreasonable Hospitality that the author talks about is how elevated hospitality, elevated language actually elevates the person.\r\n\r\n\r\nYou have selected people that have a heart of hospitality, they have a desire or willingness to do the thing that we're asking them. And then what they find is it's kind of that, you're more blessed to give than receive thing. And so when they use that upgraded language, when they don't say, I wanna help that person, when they say, wanna serve that guest, there's something powerful in the words that you use that actually change who you are and how you think.\r\n\r\n\r\nNikolas Hulewsky (11:47.647)\r\nHmm.\r\n\r\n\r\nTim Sweetman (12:15.182)\r\nand will elevate you and your soul as a human being. And so it's this incredible flywheel effect that when, what you say, what you do, the kind of environment you create affects the whole person. And yeah, you just create this incredible environment, incredible flywheel that leads to success.\r\n\r\n\r\nNikolas Hulewsky (12:33.247)\r\nWell, I say this a lot and sometimes people laugh at it and sometimes people roll their eyes, but cults are powerful. And many times, cults are built around shared language. And so if you think about, I'm LDS, grew up Mormon, right? I'm still Mormon to this day. Many people are Southern Baptists or whatever other religion you want to talk. Or you went to the University of Southern California undergrad, or maybe you went to Notre Dame or whatever. Shared language is really powerful.\r\n\r\n\r\nAnd so when you create a shared language, you also create a shared identity and it brings people closer together. So when you've got, you know, this company culture where it's like, no, it's my pleasure. You guys are, are bonding each other. And so I've always felt like it's really important at the outset to define here's what our core values are. Here's what's most important to us here. It's the way that we will refer to certain things because it immediately creates a sense of buy-in and a sense of belonging. And it is it's cult-like, right? Like, I don't mean that in the negative sense, but\r\n\r\n\r\nIt is because you're creating now a shared experience among people that is greater than the sum of their parts.\r\n\r\n\r\nTim Sweetman (13:39.14)\r\nAnd I think what also happens is it's repelling as well. So it's both a talent magnet, you're pulling in like-minded individuals that sense and want that belonging, but it's also a magnet can be repelling as well to the types of individuals and types of people that don't fit and don't belong in that culture. It's not for everybody. And that's okay. If it was for everybody, I don't think that people would want to come.\r\n\r\n\r\nNikolas Hulewsky (13:43.187)\r\nYep.\r\n\r\n\r\nNikolas Hulewsky (14:02.665)\r\nSure.\r\n\r\n\r\nTim Sweetman (14:08.59)\r\neat with us. We're not actually trying to be all things to all people necessarily when it comes to talent. We want to serve everybody and we want to serve them equally regardless, but when it comes to the types of people we hire, there's some people that just, it doesn't make sense. They don't want to say my pleasure. They're not outgoing and engaging and that's just not for them and that's okay. That doesn't make them less of a person. It just makes them not a Chick-fil-A employee.\r\n\r\n\r\nNikolas Hulewsky (14:32.287)\r\nWell, it's also a really good, it's a really good filter too. Like you hired somebody and they're like, they're not saying my pleasure. It's like, okay, I'll see you later. know, on to the next person. What is, what does the structure of a Chick-fil-A look like? Is it like general manager, shift managers, and then like 1700 frontline employees? how does it look? Cause every time I go, I'm like, how many kids do they have working? Where did this one come from? didn't.\r\n\r\n\r\nTim Sweetman (14:40.385)\r\nAbsolutely. Absolutely.\r\n\r\n\r\nTim Sweetman (14:51.563)\r\nYeah.\r\n\r\n\r\nTim Sweetman (14:57.978)\r\nRight, right. It varies widely, would be the best way to answer that. So I'll answer it specific maybe to myself, or maybe paint a generic picture. So every restaurant has an individual owner operator. Individual owner operator is able to have up to three locations that's after extensive period of time. They start with one. So that can be a little confusing for some.\r\n\r\n\r\npeople and if there's phenomenal performance and a couple other things are met there may be additional ones. So you have the owner-operator. I think that owner-operator in the past was more the general manager. Now they serve as a combination of founder, CEO in that world. I think most Chick-fil-A's have some level of a general manager. We prefer to call them like a director of operations or an executive director.\r\n\r\n\r\nthat's gonna be a person with extensive experience. are really handling the day to day. In my particular business, for example, we run on the entrepreneurial operating system. Not every Chick-fil-A does that, but a lot of them have a similar system to that. And so in that world, you probably have the operator in the visionary seat and you have some person that's in the integrator seat. And I think most Chick-fil-As, I'm gonna kind of categorize most of the categories. You have somebody who's overseeing front of house,\r\n\r\n\r\nNikolas Hulewsky (16:06.75)\r\nInteresting.\r\n\r\n\r\nTim Sweetman (16:24.846)\r\nwhich is everything that you probably see on a regular basis, those cashiers and registers and iPads outside, and everything in the back of the house or Chick-fil-A. A lot of Chick-fil-A's like to call that the heart of the house. And that's your folks that are breading chicken and freshly chopping salads and assembling sandwiches and making sure that your food is exceptional every single time. And so there's usually somebody back a house, front a house.\r\n\r\n\r\nNikolas Hulewsky (16:37.503)\r\nMm.\r\n\r\n\r\nTim Sweetman (16:54.096)\r\nthat is overseeing those areas. There's now, I think there's usually somebody who's dedicated to marketing and events that's at a Chick-fil-A restaurant. So we get a substantial, we'd love to be involved in the community. And so you're gonna get dozens, if not more requests for donations and sponsorships and those kinds of things. it's that person that's handling that. And then there's also more often than not, what we call it a talent director. We're not trying to hire people, we're trying to select talent.\r\n\r\n\r\nNikolas Hulewsky (17:13.684)\r\nYeah.\r\n\r\n\r\nTim Sweetman (17:23.716)\r\nAnd so we, again, intentional in language, a talent director who is in charge of doing the sourcing and interviewing and onboarding. And then think the last category, I'm sure I'm missing some more categories, is probably somebody that's dedicated to training and development. And so, you know, those are the categories. So again, it's like operations, talent, marketing, training and development. I would say there's lots of different mixtures of those. Some stores have.\r\n\r\n\r\npeople that are solely dedicated to food safety and food quality. Some stores have additional director level.\r\n\r\n\r\nNikolas Hulewsky (18:00.859)\r\nIs that, but would you say that's your core leadership? Like would you call that your leadership team?\r\n\r\n\r\nTim Sweetman (18:06.081)\r\nYeah, so you have a core leadership team, some kind of director team. And then underneath of that, what you're probably seeing on a regular basis is some level of shift leader or team leader that is, they're the folks that when we call them team members, not employees, but when a team member shows up to work every day, they're going to that person, that person is telling them, okay, you're bagging food or you're taking orders today or you're breading chicken.\r\n\r\n\r\nNikolas Hulewsky (18:31.281)\r\nemployees so eight million dollars on average let's say how many employees is that at an average tick-fil-a\r\n\r\n\r\nTim Sweetman (18:37.825)\r\nYeah, hopefully I'm going to say this correctly. I'm going to guess, I'll speak for myself because we're closer to that volume. We will have around a hundred employees total. The mix of full-time versus part-time is varied. In my case, our kitchen team is predominantly full-time employees. Obviously the leadership team is full-time.\r\n\r\n\r\nNikolas Hulewsky (18:49.982)\r\nlove.\r\n\r\n\r\nTim Sweetman (19:04.629)\r\nas employees and then you tend to at night have much more part time. So I'm gonna guess it's somewhere in the 50-50 between full time and part time, maybe 40-60 depending on what's happening. But yeah, it would be surprising to me if you walk into most Chick-fil-A's and there's somewhere between eight to 10 people in the kitchen and then anywhere from 12 to 15 or more people up front total.\r\n\r\n\r\nNikolas Hulewsky (19:33.759)\r\nChick-fil-A kind of reminds me of In-N-Out in the sense that it's really strong culture. People feel really passionately about it. It's not like they have a million locations. And so there's always a line, there's high volume in their stores. But I'm curious on the comp side. So when I was growing up, this was 20 years ago, I had a friend of mine whose dad was a manager at In-N-Out. This is 2003. His dad was making $110,000 a year. I remember him telling us that.\r\n\r\n\r\nTim Sweetman (19:36.566)\r\nYes.\r\n\r\n\r\nTim Sweetman (19:44.214)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (20:02.399)\r\nAnd it just blew my mind. think about it, $2,300, $10,000 is probably, I don't know, $200,000 today. And he was the manager of an In-N-Out. I don't know if it's the same level of compensation. And that manager might be more equivalent to like the owner operator model that Chick-fil-A has, But can you talk about like those people who are on your leadership team, are these like college educated individuals who...\r\n\r\n\r\nTim Sweetman (20:08.354)\r\nMm.\r\n\r\n\r\nTim Sweetman (20:11.862)\r\nWell...\r\n\r\n\r\nTim Sweetman (20:21.282)\r\nHmm.\r\n\r\n\r\nTim Sweetman (20:28.32)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (20:28.807)\r\nare coming down and working at Chick-fil-A and thinking there's an opportunity for them to work up or are these like, hey, they've worked their way up. They're high school educated, but they're just fantastic employees that get the culture. They understand the operations and now they're in these leadership roles or both.\r\n\r\n\r\nTim Sweetman (20:42.295)\r\nYeah, it's absolutely both. The answer is yes to both of those. So it certainly depends. I I can think of myself going up and moving up through Chick-fil-A throughout the years, left for a number of years. But my own leadership team, like I mentioned, I've got two or three people that are college educated, that have been in management for a long time, that have worked for publicly traded companies, that have extensive experience.\r\n\r\n\r\nNikolas Hulewsky (20:46.322)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (21:03.252)\r\nMm-hmm.\r\n\r\n\r\nTim Sweetman (21:09.718)\r\nthat are incredibly impressive when you look at their resumes. I don't know that's always been the case for every brand, but that's one of the beauties of Chick-fil-A is that we're attracting the best of the best. And so it always blows people's mind when I tell them the kind of caliber of people. I've learned so much. I have so many people on that leadership team that are so much better than me that would be much better probably to even sit on a podcast and talk about the way that they think about people and the way that they manage and the way that they...\r\n\r\n\r\nrun business, really impressive. And then on the other side, we create an environment though, where you can have a high school educated individual or person that has moved up through the ranks and has just learned by doing. And that's the beauty of it. That's the incredible.\r\n\r\n\r\nplace that we've created where any type of person can thrive and survive. But yeah, I think in terms of comp, it's so hard to answer that because state to state, it's so different. So I imagine in California out West, you're probably making $100,000 plus if you're the top dog at Chick-fil-A or In-N-Out or something like that. But I don't think it's insane to think that\r\n\r\n\r\nNikolas Hulewsky (22:09.193)\r\nSure. Yeah, I'm just...\r\n\r\n\r\nTim Sweetman (22:26.419)\r\nif you are extremely, I think people are surprised is what I would say, at how much a person can make. Yeah.\r\n\r\n\r\nNikolas Hulewsky (22:30.879)\r\nWell, let me ask it a different way. Let me ask you a different way. When I lived in Europe for a few years, I was a Mormon missionary and people in cities, we were in Hungary, people in cities who worked at McDonald's, it was a career. Like they could support a family. was like, that's what it was. You work at McDonald's, even if you're a shift leader, you know, or manager at McDonald's, I don't know that you're necessarily supporting a family in the United States. Can you support a family in those leadership roles that you're talking about at Chick-fil-A? Like, you, okay.\r\n\r\n\r\nTim Sweetman (22:45.856)\r\nYes.\r\n\r\n\r\nTim Sweetman (22:59.037)\r\nAbsolutely. Absolutely. Absolutely. That's a great way to ask it. think that working at Chick-fil-A in a management or leadership role, especially as you get towards the higher level, more responsibility, you have an incredible opportunity to make it a long-term career. And it is for so many people, the perfect combination of the right income and the ability to impact and influence in a way that\r\n\r\n\r\nfew places allow you to do that. And you get to do it across a wide spectrum of people.\r\n\r\n\r\nNikolas Hulewsky (23:35.081)\r\nOkay, so you said earlier that you guys run on EOS and not everybody runs on EOS. You've said a couple of nuggets here where I'm like, it's not a one size fits all uniformed approach. And what's surprising to me is to hear you talk about like the owner operator model. I had always heard people talk about Chick-fil-A as a franchise. And then I feel like I talked to people who were in Chick-fil-A and they're like, well, it's not really a franchise. It kind of is, but we don't really own the rights. now like I'm hearing you like, no, we have an FDD.\r\n\r\n\r\nIt's published every year. Like it sounds like it is a franchise. So is it, is it a franchise or is it not a franchise?\r\n\r\n\r\nTim Sweetman (24:11.307)\r\nYeah, it's a franchise. It's just a very unique model. And there's people that are way smarter than me that understand the legalities of how in the heck this works. I can just speak for what my understanding of it is. And so, unlike maybe your normal franchise where you can go and just buy it, which by the way, just as a quick aside, I think...\r\n\r\n\r\nNikolas Hulewsky (24:13.267)\r\nOkay.\r\n\r\n\r\nTim Sweetman (24:37.216)\r\nThat was my understanding of a lot of these other franchises that you could say, I can just go buy it. Well, nobody can just go buy a franchise. You have to be approved. Every single one has to be approved. So same thing there with Chick-fil-A. If you want to go get a franchise, you have to go through an extensive interview process, and they have to approve that you can be a franchisee. And I think the big difference is maybe on the other side of it in that I guess the way that you would be considered is more of a\r\n\r\n\r\nNikolas Hulewsky (24:43.815)\r\nYeah.\r\n\r\n\r\nTim Sweetman (25:05.332)\r\npotentially like an independent contractor or something like that. no, you don't own the real estate and there's nothing to sell on the other side of it. So that's the big difference for a lot of people. And so that's where a lot of folks go, man, this really is not for me. But everything else, like a normal franchise, you have total and complete control over who you hire and the structure and how you run the day-to-day business.\r\n\r\n\r\nNikolas Hulewsky (25:15.327)\r\nOkay.\r\n\r\n\r\nTim Sweetman (25:30.943)\r\nAnd like any other franchisee, you are not capped on your income. So you can make as much as you want, obviously based on the performance of your restaurant and what you're doing and how you're investing. You get to turn those knobs and those dials. So yeah, that's how works.\r\n\r\n\r\nNikolas Hulewsky (25:49.727)\r\nSo what about getting into it? let's just say getting into it. Is it the same as other franchises where it's like, all right, I gotta have a certain net worth requirement and I gotta put a certain amount of money down and we've to build it out. Is it like that or is Chick-fil-A saying like, we've already got the store, we'll vet you and here's a really good profit sharing plan essentially.\r\n\r\n\r\nTim Sweetman (26:11.4)\r\nYeah, I'd encourage people to go to Chick-fil-A's website on this to get the specifics. the requirements, as far as I know, there's no net worth requirements that are there. However, there are some really important things in terms of not having bankruptcies, from my understanding. You need to be in a strong financial position. What that specifically looks like, I don't know if that's listed anywhere, but it\r\n\r\n\r\nNikolas Hulewsky (26:33.759)\r\nSure.\r\n\r\n\r\nNikolas Hulewsky (26:39.711)\r\nBut bottom line is you're not putting money down. They're not necessarily doing a net worth requirement.\r\n\r\n\r\nTim Sweetman (26:41.115)\r\nIt certainly could be. it's not just, you're not.\r\n\r\n\r\nYeah, the franchise fee is $10,000. I know that's public, it's $10,000. And that's it in terms of money. Yeah, yeah, it is. It is true. I think from the very beginning, he didn't have a significant amount of money and always wanted to make sure that he could find the best people. sometimes the best people are not necessarily the ones that\r\n\r\n\r\nNikolas Hulewsky (26:52.563)\r\nThat's it?\r\n\r\n\r\nDo they just want to see you have some some skin in the game? Is that why? Like that just seems like an exceptionally low number.\r\n\r\n\r\nTim Sweetman (27:15.397)\r\nhave this huge financial nest egg. They may not be millionaires. And so they may have been running Chick-fil-A's for a long period of time. And so there's an opportunity for people that, and that's not a requirement, you know, to have worked at Chick-fil-A or done anything there, but I think there's a number of people that because of that low bar, they have what it takes in order to be an incredible owner operator of the business. You know, but on the back end,\r\n\r\n\r\nand again it's all in the FDD, I encourage people to go find that, is the way it works is the franchise fee off of revenue ends up being 15 % and then after expenses and all of that, the profit, what we call net profit that you might see on a P &L is split particularly 50-50. That I couldn't speak to because that varies so widely, like I said.\r\n\r\n\r\nIt's up to you. You get to determine how much you invest, how much you invest in labor, how you manage your food cost, all of those pieces too. And I think the other thing, you mentioned, man, $10,000 is super low. The other reality though is you are responsible for your startup costs, and the startup costs are gonna be things like labor, and you've gotta buy all the food, you have to buy not all the equipment or anything like that, but a number of things that are in the restaurant. And I've seen the FDD.\r\n\r\n\r\nthat show kind of the variation that's there. It could be substantial. And so there's no guarantees of profitability, especially early on with a brand new build, you're gonna own the real estate and build a building.\r\n\r\n\r\nNikolas Hulewsky (28:51.561)\r\nSo the 15 % is the royalty. Do you also have to pay like a marketing expense to them? What about like bookkeeping, financials, cash flow management, those types of things?\r\n\r\n\r\nTim Sweetman (28:56.67)\r\nNo.\r\n\r\n\r\nTim Sweetman (29:03.356)\r\nAll of that falls underneath of that 15%. The support is unbelievable. It is incredible. I've had lots of conversations with people kind of comparing what's there. We have some of the most incredible human beings on the planet that are at our support center. I don't have to worry about cash flow. I have a army of consultants that are\r\n\r\n\r\nNikolas Hulewsky (29:08.863)\r\nOkay. Really.\r\n\r\n\r\nTim Sweetman (29:30.853)\r\nready and prepared to serve and help in any possible way, whether it's throughput, whether it's food costs, whether it's financial, whether it's facilities, whether it's supply chain, it's incredible. You can't ask for a better team of people, and they do a wonderful job of just supporting every single owner operator. And so yeah, sometimes you go, man, it'd be nice to be less, but then you look at\r\n\r\n\r\nthe army of human beings and the quality and then you think, man, I don't have to go out and find a bunch of random tools and systems and people that a lot of other franchisees have to kind of cobble together. got people who at Chick-fil-A, you can pick up the phone and call them or text them or see them in Atlanta in person. And you know that they understand, they share the same values as you and that they've probably gone through a similar selection process that you as an operator went through.\r\n\r\n\r\nNikolas Hulewsky (30:26.527)\r\nI'm going ask you some questions and it's going to be like blink twice if I'm close and blink three times if I'm not. I don't want to get you in trouble, but I'm just doing like back of the envelope math here. If the average McDonald's is doing $4 million a year in revenue and the average Chick-fil-A is doing $8 million a year in revenue. I'm just thinking like, okay, their size is pretty comfortable. We're not talking about, in fact,\r\n\r\n\r\nTim Sweetman (30:32.189)\r\nOkay, okay. Do my best.\r\n\r\n\r\nNikolas Hulewsky (30:56.231)\r\nmany McDonald's are actually bigger. Chick-fil-A probably has some more employees, but it's not gonna be necessarily a one-to-one ratio where it's double. And if McDonald's net margins are, from what I'm researching, like 10 to 15%, then Chick-fil-A's net margins are actually gonna be a lot better because you're getting a lot more revenue per square foot and the cost doesn't necessarily scale in the same way that your revenue scales.\r\n\r\n\r\nBut at the flip side is you're paying 15 % to Chick-fil-A versus a smaller royalty fee. So I'm guessing here, and maybe this is in the FDD, 10 to 15 % net margins for an operator like yourself, like someone who's the owner operator at a local location. Is that fair?\r\n\r\n\r\nTim Sweetman (31:39.848)\r\nIt sounds\r\n\r\n\r\nCorrect. Yeah, link twice. Yeah, that sounds like it would be accurate. Again, know, varies probably widely seasonally by restaurant. And I've known guys that have done, you know, more, I've known that people do less and everything in between. yeah, I think it's probably a fair estimate of what it looks\r\n\r\n\r\nNikolas Hulewsky (31:43.849)\r\nOkay, blink twice. You gotta blink twice.\r\n\r\n\r\nNikolas Hulewsky (31:55.455)\r\nSure.\r\n\r\n\r\nNikolas Hulewsky (32:06.687)\r\nOkay, so let's just say fair estimate, $8 million and I'm gonna use 15%. So 15 % net margins, we're talking about $1.2 million in profit. So in that case, it'd be like, all right, Chick-fil-A, here's your 600,000 and I, the operator, keep 600.\r\n\r\n\r\nTim Sweetman (32:13.564)\r\nThat'd be pretty nice.\r\n\r\n\r\nTim Sweetman (32:25.008)\r\nYeah, in that scenario, that's exactly what that would look like. Yeah.\r\n\r\n\r\nNikolas Hulewsky (32:26.471)\r\nWow. Now does the operator like yourself? Do you get a base salary or is it like you eat what you kill? You don't get any salary. You just take distributions. You know what mean? Like how does it work?\r\n\r\n\r\nTim Sweetman (32:34.748)\r\nYeah, so the way most operators, and I think this might be a requirement now, set up a LLC and usually run it as an S-Corp. And so, as you know, with an S-Corp, the way that that works is set a salary for yourself, whatever that reasonable salary is. You talk with your personal accountant on what that might look like. And then your additional profit will come into the business, and you take distributions off of that.\r\n\r\n\r\nNikolas Hulewsky (33:03.785)\r\nDo you know, like how does it compare to other, I don't know the answer to this. wish it's not a leading question, I promise. Like a franchise owner of McDonald's, are they splitting 50-50 with McDonald's the profit or are they keeping the majority? Don't know. Okay.\r\n\r\n\r\nTim Sweetman (33:07.425)\r\nYeah, sure.\r\n\r\n\r\nTim Sweetman (33:14.043)\r\nThat's a great question. Yeah, I actually don't know the answer to that. I don't know what the answer is to that. I don't think there actually is any profit split at your normal, quote unquote, normal franchises. Maybe each one is different, but my understanding is you're probably taking all of that profit. However, you also probably have debt service on that. so that's where some of the numbers may be a little bit different.\r\n\r\n\r\nNikolas Hulewsky (33:38.239)\r\nWell, I'm like.\r\n\r\n\r\nI've Chick-fil-A, Chick-fil-A selects all their locations, right? It's not on the franchisee to select them. Cause in my mind, I'm looking at it I'm like, Chick-fil-A, however they've done it, they know how to pick them. Any Chick-fil-A I have ever seen always has a line, always, except for Sundays, of course. So like there's always going to be volume there. But you said something interesting. You're like, yeah, I've known guys who've made way more than that. And I know guys who have made way less than that.\r\n\r\n\r\nTim Sweetman (33:47.141)\r\nThat's correct.\r\n\r\n\r\nTim Sweetman (33:55.503)\r\nYes, I do.\r\n\r\n\r\nNikolas Hulewsky (34:10.365)\r\nWhat's the differentiator? Like, why would a Chick-fil-A not crush it? In my mind, it's like, it's just plug and play. It's Chick-fil-A, you're gonna crush it if you get in as a franchisee.\r\n\r\n\r\nTim Sweetman (34:20.409)\r\nYeah, when I think about that, I just think of the location type. And so we have what we call freestanding restaurants, which is like mine, near normal drive-through with a dining room, et cetera. But there's other models that out there that Chick-fil-A is using. Drive-through only is another one. Inline, which is something that would be almost in a strip mall. We have Chick-fil-A's out there.\r\n\r\n\r\nNikolas Hulewsky (34:32.104)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (34:43.881)\r\nor like an airport.\r\n\r\n\r\nTim Sweetman (34:45.051)\r\nThat would be a little bit different. I would consider that as those are usually licensee locations. Those are not normally owned by a Chick-fil-A owner. Actually, they're never owned by a Chick-fil-A owner operator because like an HMS or third party facilitator is going to run those. But I was thinking more of the mall locations. know, Chick-fil-A started in malls and that's how we really grew over time. But, you know, in the last decade or so, malls have started to fall off.\r\n\r\n\r\nNikolas Hulewsky (34:51.292)\r\nOkay.\r\n\r\n\r\nTim Sweetman (35:14.903)\r\nAnd I think this is just everybody. If you have a mall restaurant, whether it's Chick-fil-A or McDonald's, I can't imagine your volume is anywhere near that of somebody else. And so that's where it drops a little bit. And I think it can be tough on margins as well as the lower volume happens because your fixed costs are your fixed costs. That's why as volumes increase, the margins certainly\r\n\r\n\r\nfeel a little bit easier to manage because your rent or those pieces are a little bit easier to handle.\r\n\r\n\r\nNikolas Hulewsky (35:50.687)\r\nSo you don't think it has anything to do with necessarily what they did differently operating? You think it's like location dependent?\r\n\r\n\r\nTim Sweetman (35:57.378)\r\nI think it's probably, in my opinion, it's really just based solely on, for the most part, just the restaurant type. I do think there are situations we've learned over the years. I'm in a very seasonal area. think there were some strategic bets on like, this store is right by the beach. Surely it's going to be great all the time. Then you realize, wait a second, maybe January and February is not so hot.\r\n\r\n\r\nYou can barely keep the restaurant afloat and you're kind of running a negative in this month. You might be even losing money. So there's scenarios like that that there can certainly be a challenge.\r\n\r\n\r\nNikolas Hulewsky (36:38.559)\r\nAll right, so a couple questions as we land the plane here. My first question would be, sounds like an amazing gig. You've got all the backing of Chick-fil-A, you've got the brand behind you, they choose the location, you come in, you're an owner operator, you're at least mid six figures. How hard is it to become a franchisee?\r\n\r\n\r\nTim Sweetman (37:00.377)\r\nYeah, that's where the rub is. I don't know the current statistics, but when I got selected, I remember getting to an interview and one of the folks that, one of the incredible people that does the selection for Chick-fil-A, and by the way, I did, I think close to 10 interviews. I sat in one of the early interviews and he got up on a whiteboard and he wrote the number, I think it was like 50,000 or 60,000.\r\n\r\n\r\nHe goes, this is how many people applied this year. And then he wrote another number and it was like 5,000 or something or 10,000. He goes, this is how many people are qualified out of that number that we have moved forward that we feel like has a chance. And then he wrote another number and it was like 100. And he goes, this is how many people we're going to select this year. This is how many opportunities we have this year. And he wrote another number, was 80. He goes, this is how many people we're actually going be able to select.\r\n\r\n\r\nNikolas Hulewsky (37:57.63)\r\nGosh.\r\n\r\n\r\nTim Sweetman (37:58.005)\r\nOut of 60,000, we're going to get down to 80 people. And so, you know, the chances of you becoming a Chick-fil-A owner operator, you have a better chance of being a first round draft pick in the NFL.\r\n\r\n\r\nNikolas Hulewsky (38:12.307)\r\nHahaha!\r\n\r\n\r\nThat's the best line. Well, can anyone apply? Anyone just goes to the website and they apply? That's how it works.\r\n\r\n\r\nTim Sweetman (38:20.856)\r\nAnybody can apply, anybody can apply, anybody can kind of go through the process, but they say no more than they say yes. And I've seen incredible people be told no, which just is confirmation. It's so cool to be around all of my fellow Chick-fil-A owner-operators when we gather. Because you kind of look around and there's about, I think there's around 3,000 total Chick-fil-A restaurants, obviously with about 20 % of Chick-fil-A owner-operators that have.\r\n\r\n\r\nNikolas Hulewsky (38:25.886)\r\nWow.\r\n\r\n\r\nTim Sweetman (38:50.102)\r\nmulti-unit, so I don't know, 2,000 or so owner-operators that exist in the world. When you meet an owner-operator, that's a special individual, every single one of them.\r\n\r\n\r\nNikolas Hulewsky (39:01.279)\r\nAll right, second to last question. What happens when you want to sell? Because like, I'm looking at this as it's great money, great career, but most business owners are making that amount of money, which is, which again, it's a good amount of money. They also look at the asset at the business itself. And so they're like, Oh, at some point I'm going to sell the business. But it doesn't sound like you can sell like, or, can you sell, they buy back the rights or is it just, Hey, you get what you get when you earn your split.\r\n\r\n\r\nTim Sweetman (39:28.397)\r\nYeah, that's exactly right. There's no selling the business. The retention rates, though, of Chick-fil-A operators are unbelievable. You don't see guys retire. You see guys do this. mean, I know some amazing owner-operators. Yeah, I mean, there's some guys that are still killing it in their 70s and 80s. They are unbelievable business owners, and they've developed an incredible team, and they just get to sit as visionaries and continue to\r\n\r\n\r\nNikolas Hulewsky (39:40.481)\r\nYou see them die. Guys don't retire, they die.\r\n\r\n\r\nTim Sweetman (39:57.1)\r\ndeliver excellent service. It's awesome. I told you, I heard that operator speak two weeks ago and he's been, I think, with the brand since the 70s or 80s and is continuing to execute at a high level. But yeah, there's no selling on the other side of it. There's not an asset that you have. And so it's up to you to take whatever income that you get and to steward that and to place it into other things that maybe you have an ability to grow that asset. But with the kind of, you\r\n\r\n\r\nNikolas Hulewsky (39:57.385)\r\nSure.\r\n\r\n\r\nTim Sweetman (40:27.104)\r\nI think cash flow and income that operators have, they're in a really strong position to be able to invest in things that...\r\n\r\n\r\nNikolas Hulewsky (40:36.361)\r\nSo that was gonna be my next question. Are you allowed, like, I'm not talking about an index bond or the S &P 500. Like, are you allowed to have ownership in other businesses?\r\n\r\n\r\nTim Sweetman (40:45.11)\r\nYeah, so I think the way that the operating agreement is written is that you must give your best efforts and your sole efforts to the Chick-fil-A opportunity. And so I think explicitly an active investment in something would not work. Honestly, it just doesn't make sense.\r\n\r\n\r\nI don't know why you would want to do it. you the more you put into this business, the better the rewards are. I don't know that you can really get a higher ROI being involved in something else. But yeah, just what makes sense to me.\r\n\r\n\r\nNikolas Hulewsky (41:23.293)\r\nWell, I would just think as a as a Chick-fil-A owner, right? Like what's the town you're in? OK, so in Millsboro, you probably know like everyone knows you or at least like the local Chamber of Commerce, you're well known, whatever. So I would think you just have opportunities where it's like, hey, Tim, I'm opening this whatever XYZ business. Could you seed it like could I get some capital, et cetera? So like I could easily see scenarios where you're doing that, not necessarily.\r\n\r\n\r\nTim Sweetman (41:28.618)\r\nof Millsboro.\r\n\r\n\r\nTim Sweetman (41:36.693)\r\nYeah. Yeah.\r\n\r\n\r\nTim Sweetman (41:47.819)\r\nRight. Yeah.\r\n\r\n\r\nNikolas Hulewsky (41:51.923)\r\nYou know, Tim is starting a competing restaurant company or or like a big business that you're putting yourself. So like, are you able to do those? Are you able to have those types of investments or is that even still like look down upon?\r\n\r\n\r\nTim Sweetman (41:55.639)\r\nSure. Yeah.\r\n\r\n\r\nTim Sweetman (42:03.383)\r\nYeah, no, think as long as it's passive investment, I don't think that there would be any issue whatsoever. think I know some incredible operators that they've been so wise with their money when it comes to, obviously real estate is a huge part for them, or yeah, seeding ventures and things like that. I've known of operators that have helped with investments around like movies, mean like some movies you would know.\r\n\r\n\r\nthat have been involved in, that have been really cool, and that they've been able to just partner with and to. So as long as they're LPs, I think that operators are incredible LPs. That's really the key. And they provide that, you know, the LP that I think is a good advisor. But the only stipulation I think is exactly what you kind of mentioned is I don't, I know for a fact, they're not going to be investing in a competing\r\n\r\n\r\nNikolas Hulewsky (42:32.302)\r\ncool.\r\n\r\n\r\nTim Sweetman (42:59.847)\r\nrestaurant. You're not going to find any operators or LPs in other restaurants. You're going to find operators that maybe are LPs and real estate funds or maybe I would say like venture funds and those types of things too, outside of your normal investments. There are some amazing guys that are just doing really incredible work there. That keeps people plenty busy.\r\n\r\n\r\nNikolas Hulewsky (43:01.417)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (43:12.039)\r\nMakes sense. Yeah.\r\n\r\n\r\nNikolas Hulewsky (43:23.347)\r\nWell, it would seem to me also that Chick-fil-A is like, it's not like they're like doing an audit of you every year, but if something's wrong, like if they, something smells funny, it's like, what's going on with Tim? Why is the store dropped? Whatever. I could see how that triggers and maybe that, that gets you kicked out. Right. Like that could be one of the okay. I'm to try something new right now. I'm going to ask you for the secret Chick-fil-A menu, but before you answer that question, I need people to go, like, and subscribe to this podcast.\r\n\r\n\r\nTim Sweetman (43:38.934)\r\nYeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (43:52.019)\r\nOkay, I'm just gonna say it. Go like and subscribe to this podcast, because I need it. I need mental validation in my mind. All right, so when you come back, Tim's gonna answer this question. So I don't know if this is the case, but is there a secret Chick-fil-A menu? Please tell me there is.\r\n\r\n\r\nTim Sweetman (44:03.029)\r\nOkay.\r\n\r\n\r\nTim Sweetman (44:07.074)\r\nI guess kind of technically. Yeah, I don't want play with you. I think there's like a number of hacks that could be considered secret menu. think when you say secret menu, it feels like that's just like the title that TikTok puts on, like putting the best combos together. So I'll tell you what I think or some of them guys think. It's been a long time. It's been a East Coast.\r\n\r\n\r\nNikolas Hulewsky (44:08.542)\r\nDon't.\r\n\r\n\r\nNikolas Hulewsky (44:27.081)\r\nWell, like in and out, have you ever been to in and out?\r\n\r\n\r\nOkay, in and out, don't put this on the menu, but you can order animal style, which is basically grilled onions. You can order, what's it called? I can't remember what it is, but it's just a lettuce wrap. There's a name for it, but it's just a lettuce wrap. You can get a two by two, three by three, four by four. You can get like six by six patties. So anyways, go ahead.\r\n\r\n\r\nTim Sweetman (44:45.046)\r\nOkay, there is the menu, then I take it back. is one. Yeah, Yeah, okay, so a couple things come to mind that I'm going, okay, what's not on the menu of that, but you can order. One example is going to be something like the wraps are a good one. So this is not super exciting for most people, but like a veggie wrap. So you can absolutely get the veggie wrap, which is actually delicious. So it's gonna get corn and beans in there instead of your chicken.\r\n\r\n\r\nNikolas Hulewsky (45:10.857)\r\nOkay.\r\n\r\n\r\nTim Sweetman (45:15.286)\r\nIt's actually pretty delicious. I'm telling you, you get it and throw that with some, I don't know if the ranch makes sense, but any of spicy dressing is gonna be pretty amazing. yeah, that's some good stuff. Most people though, I'll tell you my favorite thing, is just the combos that you can put together. So if you take the kale crunch salad and put 12 grilled nuggets in there and throw some buffalo sauce and mix it up, it is...\r\n\r\n\r\nNikolas Hulewsky (45:27.391)\r\nK?\r\n\r\n\r\nTim Sweetman (45:44.762)\r\nunbelievably delicious. I am not a huge Kale Crunch fan. This stuff is great. So\r\n\r\n\r\nNikolas Hulewsky (45:47.091)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (45:51.737)\r\nOkay, kale crunch, 12 nuggets, buffalo sauce.\r\n\r\n\r\nTim Sweetman (45:55.507)\r\nMix it up, call it a day. Amazing. I've also heard people seem very similar to that. If you want to be a little more unhealthy version of that, which is going to be grilled nuggets, mac and cheese, or regular nuggets and mac and cheese, and buffalo sauce. Throw this together in a bowl. Maybe some fries as well. Mix all that up. It's kind of animal style type of thing, what you're talking about.\r\n\r\n\r\nI've seen a lot of people do that, very, very good.\r\n\r\n\r\nNikolas Hulewsky (46:26.399)\r\nOkay, I have one that I need you to talk to the higher ups because I love root beer floats. And my son and I, every time we go to Chick-fil-A, we make our own root beer floats. Here's the problem. Those freaking cups of ice cream are too small, man. It's not enough ice cream for a root beer float. I... okay, okay, what is it?\r\n\r\n\r\nTim Sweetman (46:34.41)\r\nOkay. Yep.\r\n\r\n\r\nTim Sweetman (46:42.418)\r\nYeah, I got great news for you. Yeah. Yeah, that's two things. So one, Moch Chick-fil-A's, mine included, will do a spun soda for you. So what we'll do is we'll take that cup, fill it with ice cream, we'll basically do, it'll get the root beer, and then we'll add the ice cream and we'll spin it for you. And so it's already done, you know, it's like, it's done. In addition to that, I know for a fact that they're\r\n\r\n\r\nNikolas Hulewsky (47:09.575)\r\nWait, wait, wait, what do I have to say for that? What do I have to say to them?\r\n\r\n\r\nTim Sweetman (47:11.508)\r\nspun soda. It's a spun soda is what it's called. So you just ask them like, hey, can you just put, I just need a regular, you know, I want to, it's your regular cup. It's gonna be a small cup. Small cup, I want root beer. They'll put a little bit of root beer in there. They'll put the ice cream in there. They'll spin it like they would a milkshake. It's incredible. So you can do that. But they also, I know for fact that they are testing out root beer floats.\r\n\r\n\r\nNikolas Hulewsky (47:14.984)\r\nOkay.\r\n\r\n\r\nTim Sweetman (47:37.641)\r\njust straight up where it's in our plastic cups, which do a little bit better. So, and especially the new ones that we have a much larger plastic cup that we're using for the dragon fruit drink that we're running right now. And so anyway, I would highly recommend just ask me like, hey, can you do a spun soda? Is there any way to do that? And not every chick really does it currently, but I would do it.\r\n\r\n\r\nNikolas Hulewsky (47:41.619)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (47:50.739)\r\nYeah, yeah, we just got that.\r\n\r\n\r\nNikolas Hulewsky (47:59.935)\r\nBecause I'm buying like four cups of ice cream for me and my son to share. I'm like, there's got to be a better way, man. I'm killing it on ice cream.\r\n\r\n\r\nTim Sweetman (48:05.108)\r\nThank\r\n\r\n\r\nTim Sweetman (48:09.504)\r\nSpun soda is the way. I thought you were gonna say that you love coleslaw. I had, I know if you've ever had the Chick-fil-A coleslaw. You can still get Chick-fil-A coleslaw if you go to Atlanta and you go to the original Chick-fil-A, which I recommend if anybody goes to Atlanta, go try the original Chick-fil-A. You can go sit down, you can sit at the bar. They have all the bar stools and stuff. It's like old school diner, it's phenomenal. You can get some chicken and waffles.\r\n\r\n\r\nNikolas Hulewsky (48:13.791)\r\nI do love coleslaw.\r\n\r\n\r\nTim Sweetman (48:37.588)\r\ncarrot raisin salad, like some really amazing products you just can't get anywhere else. I have said for a long time, and so if anybody from Chick-fil-A is hearing me, I know that there's been talk of it, but I'm just going to emphasize, I think the brand would explode if we brought back, even temporarily for a limited time offer, a coleslaw. Throw it on top of a chicken sandwich, maybe some\r\n\r\n\r\nNikolas Hulewsky (49:04.94)\r\ndude.\r\n\r\n\r\nTim Sweetman (49:06.888)\r\nBarbecue sauce, think you're talking another level. It would be absolutely amazing. So that's my pitch. I think that would transform things. I also have a hunch that we could introduce a limited time offer sauce. I haven't thought of it, but we had a Chick-fil-A operator that he invented Chick-fil-A sauce and was serving Chick-fil-A sauce maybe a little under the table at his restaurant in Virginia.\r\n\r\n\r\nNikolas Hulewsky (49:11.87)\r\nI love it.\r\n\r\n\r\nTim Sweetman (49:37.203)\r\nI think it got banned for a time, but it was so popular it came back and now it is chain wide. So somebody out there has got to invent what is that next sauce? What is the iconic new Chick-fil-A sauce that could be out there?\r\n\r\n\r\nNikolas Hulewsky (49:39.743)\r\nSure.\r\n\r\n\r\nNikolas Hulewsky (49:47.293)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (49:51.039)\r\nWhat about, is there anything, any secrets in a Chick-fil-A? It's like, just so you know, every Chick-fil-A has a door right here that goes,\r\n\r\n\r\nTim Sweetman (49:59.187)\r\nYeah, I got one for you. Yeah, this is a one. Every Chick-fil-A has a large, what they call a community table in there. You've probably seen that in the middle of your dining room. It's kind of like a refurbished wood. The secret is if you go underneath, look underneath that table, there is a letter that's written, and it's written by the man who built that table. Chick-fil-A, every time you eat a Chick-fil-A sandwich, you're sponsoring or supporting the organization\r\n\r\n\r\nthat builds those tables. And what they do is they take men who have been in prison and they give them and teach them incredible woodworking skills as well as a bunch of other things, give them amazing jobs. And they use that refurbished wood in the same way so that usually the story under there is by somebody who's built it that was in prison for a long time, was kind of tossed aside, is not useful anymore.\r\n\r\n\r\nNikolas Hulewsky (50:40.095)\r\nHmm.\r\n\r\n\r\nTim Sweetman (50:54.995)\r\nand they've been rebuilt in the same way that that table has been rebuilt. So I encourage everybody, maybe a little weird for you to like lay on the floor in a dining room at some point, but go over there the next time you're at your Chick-fil-A and look underneath and check out the story and read it. It's really moving and a really powerful representation of kind of the impact and influence that we want to have on the world at large.\r\n\r\n\r\nNikolas Hulewsky (50:59.487)\r\nDang.\r\n\r\n\r\nNikolas Hulewsky (51:18.931)\r\nThat is awesome. I am definitely gonna do that. Cause my kids are always on the floor anyways. So it'll just be like, hey, what are we picking up? Read the letter. Dude, that's an amazing place to stop here. Tim, this was awesome. Thank you. People can come find you on Twitter, anywhere. my pleasure. He can't even help himself. He's never out of Chick-fil-A mode. All right, man. We'll talk soon. Stay on.\r\n\r\n\r\nTim Sweetman (51:22.822)\r\nYeah, never.\r\n\r\n\r\nDo it, do it.\r\n\r\n\r\nTim Sweetman (51:32.848)\r\nMy pleasure.\r\n\r\n\r\nTim Sweetman (51:38.012)\r\nCan't. Never.\r\n\r\n\r\nThanks so much,",
  "metadata": {
    "duration": "",
    "date": "2025-06-16",
    "platform_source": "Google Drive"
  }
}