{
  "episode_number": "177",
  "episode_title": "From Layoff to $250K: The 1-Person Agency Playbook with Zach Ashburn",
  "guest_name": "Zach Ashburn",
  "business_name": "",
  "transcript": "﻿Nikolas Hulewsky (00:01.469)\r\nOkay, the reason I'm stoked to talk to you is because we're talking about my favorite way, and I'm not making this up, you can go search my Twitter history, my favorite way to get into entrepreneurship, which is finding something that you specialized in, that you're better than almost anybody else at, and then launching an agency business around that. Because a lot of people want to get into entrepreneurship, but they always think, I got to do the big sexy thing, I got to do a tech startup, I got to buy a company, I got to go sign an SBA loan. No, the easiest and most...\r\n\r\n\r\nPredictably successful way to get into entrepreneurship is to build an agency around a specialized skill set that you have as an entrepreneur and you help entrepreneurs do that and think about How do I actually monetize this? How do I actually plan for it and achieve the result that I actually want? Is that right fair?\r\n\r\n\r\nZach Ashburn (00:47.81)\r\nYeah, that's exactly right. It's basically this bet that the corporate landscape continues to stretch horizontally and that real specialists are just primed to capitalize on the volatility and the innovation we're seeing right now. And that looks like taking what I'm doing in this corporate umbrella and doing independently as a consultant.\r\n\r\n\r\nNikolas Hulewsky (01:06.709)\r\nIt's not as sexy like, you know, Chris Kerner. My BFF, my best friend. no, he's very, he's a very sex. I have slept with him many times. No, but like the stuff that he posts about is like his wheelhouse. It's like, dude, you could go up in one weekend. What you need to do is buy this from Home Depot and you'll split it into three parts and then you'll put it on Facebook marketplace and you're gonna get people to contact you and then you'll, bought it for five, you'll sell it for 10.\r\n\r\n\r\nZach Ashburn (01:11.374)\r\nChris Kerner is not as sexy. That's what I've always said.\r\n\r\n\r\nHa\r\n\r\n\r\nWe'll tell them. Many days.\r\n\r\n\r\nNikolas Hulewsky (01:35.807)\r\nHe's a hustler. He's always been a freaking hustler. And those are for many people, like, kind of like the entrepreneur porn, like, it's going to get them into entrepreneurship. But this, what we're talking about is my favorite because it's not like this get rich quick scheme. And I don't mean to paint Chris as the get rich quick scheme at all. Right. Like I think his ability to launch businesses and to think about ways to make money is exceptional. And I think it's important for people like this who are trying to start their businesses. was just trying to create the stark contrast anyways.\r\n\r\n\r\nZach Ashburn (01:52.856)\r\nYeah, I'm with you.\r\n\r\n\r\nNikolas Hulewsky (02:05.583)\r\nbut I think like the, the best way is, Hey, I have a skillset. I know that I want to be an entrepreneur for whatever reason. I want to have control over my time. I want to have control over my, my money. want to make more money. want to, I want to travel, whatever it is. but many people want to do that at 22 and they, don't have a specialized skill set. So I tell many people, go get a job, get some experience, build a skill set, and then you can build a company around that. And then you land and expand. And then you're like,\r\n\r\n\r\nsort of build out these adjacent offerings and you continue to grow. When people come to you, are they like, hey, I've made the jump, Zach, what am I doing? Or are they like, I wanna make the jump, what do I do?\r\n\r\n\r\nZach Ashburn (02:44.46)\r\nYeah. Usually, usually we would prefer it's the latter, right? Like we'd prefer it say like we're, we're inside this maybe five year window and I know what I expect to do, but what happens more often is I've hit that moment where someone offered me a contract. Maybe it's even the company I work with and they're like, Hey, we're having layoffs, but we're going to retain you for this. And you can work as a contractor for a while. And this light bulb goes off that says,\r\n\r\n\r\nwait, if they'll pay me 30 grand for this six month contract and I could find three more and I could do this, like suddenly, wait a second, like I'm here. And so it looks more like that a lot of the time. And if we can plan it out ahead of time, naturally we prefer to, but it's really just maybe a good characterization like you're using with Chris or even yourself. Like almost no one is an empire builder.\r\n\r\n\r\nNikolas Hulewsky (03:21.845)\r\nHmm.\r\n\r\n\r\nZach Ashburn (03:40.03)\r\nI think that the truth of the matter is, especially for like our little bubble of SMB folks, it's almost no one that builds the really enormous empire. And it's almost no one who is, if I took everything away from you today, you're gonna scrap independently like that. Like as a predisposition, you can learn it, you can train it, you can grow and you can scale it, you can do all those things. But that first step, almost no one is,\r\n\r\n\r\nNikolas Hulewsky (03:56.853)\r\nMm-hmm.\r\n\r\n\r\nZach Ashburn (04:08.16)\r\nI'm straight out of high school. I'm building an empire. Watch me go. But those are the stories are here, right? That's the, that is sexy. And so.\r\n\r\n\r\nNikolas Hulewsky (04:14.175)\r\ntotally agree. I totally agree. I've talked about this with Chris where I'm like, think that there are two types of entrepreneurs. There's Chris, he's a hustler. The dude has just.\r\n\r\n\r\nZach Ashburn (04:22.95)\r\nIf you went and robbed him blind right now, tomorrow he would like, I'm gonna go mow some lawns, I'm gonna upsell them to tree trimming or whatever. And I don't know him personally, but like, I've heard enough that I'm pretty sure. Yeah.\r\n\r\n\r\nNikolas Hulewsky (04:29.939)\r\nYes.\r\n\r\n\r\nYes, and he's never had a job. He's never had a job. He's only ever worked for himself. He's just always been a hustler, right? He's like, I bought this for five bucks. I can sell it for seven bucks. Just like always looking for the flip. I'm not wired that way. And I think then there's the other end of the spectrum, which you said is like accidental entrepreneurs who are like, I'm really good in this job. I've got a great salary. And then all of a sudden a layoff happens or an unexpected life change happens. And they have this opportunity kind of fall in their lap to\r\n\r\n\r\nConsult and they're like, well, I'm not an entrepreneur. I'm just a consultant. Well, no, that's your entrepreneurship like welcome to the club\r\n\r\n\r\nZach Ashburn (05:09.036)\r\nYeah, and I mean, if you even take a further subset and say, of the people who are predisposed to being empire builders, most of them are failing, like by the numbers. It will fail a bunch of times and then hit it out of the park, right? Like that is just how it actually goes. And then we get this confirmation of, look how much people won. Versus, hey, I'm really specialized in getting approval and writing curriculum for charter schools. Almost no one can do that.\r\n\r\n\r\nNikolas Hulewsky (05:19.411)\r\nMm-hmm.\r\n\r\n\r\nZach Ashburn (05:38.26)\r\nAlmost no one in the entire country does that. And I just realized that if I don't just do that for this one organization, if I do it from on my own, I can triple my revenue and own my time. And I can just start with one project. Like how many more people are predisposed to make that little switch versus like, no, I'm gonna burn it all down and I'm gonna start from scratch right now.\r\n\r\n\r\nNikolas Hulewsky (05:52.991)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (06:01.169)\r\nYeah, so give me an example. I know that was a hyper specific example. Do you have anybody who's like, they were doing X, you don't have to out them, but they were doing this specific job role and now, you know, a year later, two years later, this is kind of where they ended up from their accidental entrepreneurship journey.\r\n\r\n\r\nZach Ashburn (06:08.279)\r\nYeah, sure.\r\n\r\n\r\nZach Ashburn (06:16.536)\r\nYeah, absolutely. So people who are in in-demand skill sets in corporate. So imagine like you're a data analyst and you've developed these skills and you're doing it really well. And you're able to take that and say, I'm good at this in my corporate bubble. And I make that connection through my personal network probably to do this for a really specific vein of industry or use. Like, and I'm thinking of a specific example. That exactly right.\r\n\r\n\r\nNikolas Hulewsky (06:41.746)\r\nI'm an engineer who focuses on, I don't know, trusses for bridges that, I don't know, expansion bridges. I'm way out of my depth here, but.\r\n\r\n\r\nZach Ashburn (06:50.134)\r\nYeah, I'm an engineer who specifically does surveys for utilities or for energy industry or something like that. Those are real examples of the types of people we've talked to before. And that's a really narrow skillset. And it turns out that as you expand our whole economy right now geographically and informationally, and I can reach out on LinkedIn Sales Navigator and find anyone who's in a decision-making role for that kind of thing.\r\n\r\n\r\nNikolas Hulewsky (06:54.709)\r\nCough cough\r\n\r\n\r\nMm.\r\n\r\n\r\nZach Ashburn (07:19.062)\r\nin like 40 seconds for 90 bucks a month that I can do that right now. And what we just see is that that that switch get flipped up. somebody even if it's like, go, go for 1000 bucks, like how you just immediately instead of being a not disposed to and being an empire builder, everyone is well equipped to say, well, they'll pay me 1000 bucks. If I do that a hundred times a year, it'd be this. What if I charge 5,000? What if I charge 20,000? And that math is easy, you know?\r\n\r\n\r\nNikolas Hulewsky (07:47.381)\r\nOkay, so I'm a brand new person. I'm in this spot. I come to you, Zach. What's the first conversation we have?\r\n\r\n\r\nZach Ashburn (07:54.606)\r\nThe first conversation around money and planning, we're always starting with income and expenses for your household because we want that we just found time and time again, the number one thing people are lacking at all levels of wealth and especially as it applies to actual decision-making is a 12-month cash flow projection. You can imagine like your business cash conversion cycle of I put money out, how long does it take me to get it back?\r\n\r\n\r\nNikolas Hulewsky (08:16.479)\r\nHmph.\r\n\r\n\r\nZach Ashburn (08:24.396)\r\nAlmost no one has that for their home. And so we've taken this, what we just call it our action plan, but we just take this template and we say, if you've got this much contract or outside income, how does that feed to your personal life? And if you've got other income, let's put that in there too. And if you've got a cash floor that you want to maintain, cause you should, we call that an emergency fund if you want to, but a cash floor for your goals in your life and your tax payments and stuff like that. When do you run out of cash?\r\n\r\n\r\nHow many contracts do you need to secure when to not run out of cash? How many do you need to secure to not run out of cash and fund your other goals and your investments?\r\n\r\n\r\nNikolas Hulewsky (09:03.733)\r\nSo are they coming to you with a business? Are they like, hey, I am doing consulting, this is my typical contract value, this is my typical scope of work, how long it takes me, blah, blah, blah. Or are they mainly coming to you like, I wanna do this, help me figure it out.\r\n\r\n\r\nZach Ashburn (09:19.95)\r\nYeah, we see both the two, the two ways it starts is I have a business and I am really not able to figure out my tax situation. Usually from like a cashflow perspective, like I'm afraid I won't have cash on hand to pay this tax bill or I find myself where, you know, I'm thinking of something they're doing around $300,000 in revenue, but there's just, it's so easy as a business owner to get into that cycle of, being a strap for cash. When, when something like a big tax bill comes in, how do I get more proactive about that?\r\n\r\n\r\nNikolas Hulewsky (09:28.789)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (09:34.197)\r\nHmm.\r\n\r\n\r\nZach Ashburn (09:49.4)\r\nThat's one area. The other is specialists that are still in corporate world who have like equity in their businesses. And they're like, I want to leverage this to make a leap. This is I've done the thing. Like this is my moment here where I probably won't have a deal that this will go this well again at a public company or potentially private company, but public company. I want to leverage that well to make this leap because I want to buy my independence.\r\n\r\n\r\nNikolas Hulewsky (10:01.205)\r\nNikolas Hulewsky (10:15.381)\r\nso they've earned some stock. have like mid six figures to low seven figures and they're like, all right, how do I make this work for me?\r\n\r\n\r\nZach Ashburn (10:22.196)\r\nYeah, you you imagine you're at one of the companies that let's just use space as SpaceX as an example and say, I'm really specialized here. I've done the thing. My stock has gone crazy. They provide exercise windows. I'm allowed to do this. And I just want like, maybe I need to move back home because my parents are getting older and I want to figure out how do I consult? And maybe I've been thinking about buying a business when I get back home, but it just occurred to me that I could secure a few contracts and make ends meet in whatever.\r\n\r\n\r\nNikolas Hulewsky (10:38.773)\r\nHmm.\r\n\r\n\r\nZach Ashburn (10:49.526)\r\nScranton, Pennsylvania without much much trouble as a SpaceX, you know on my resume.\r\n\r\n\r\nNikolas Hulewsky (10:54.239)\r\nSo I'm a W2 entrepreneur and I'm like, all right, I've got this skill set. I know I want to make the leap. I've got some cash, but how much cash do I need? How much time is it going to take me? That's when you're kind of having the conversation with some of these entrepreneurs who are making the leap. Okay, and the first piece is, all right, let's just map out your cashflow. What are your expenses every month? Because that's kind of the scariest part, right? Like you have anxiety and you're scared because you don't know.\r\n\r\n\r\nZach Ashburn (11:09.378)\r\nYeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (11:22.873)\r\nLike we're mainly scared of the unknown. Once we kind of have an idea of what the fear is, it makes it less scary for us. And that's like your first step, right? As you're like, okay, cool. Let's figure out where the outlays are.\r\n\r\n\r\nZach Ashburn (11:22.999)\r\nYeah.\r\n\r\n\r\nZach Ashburn (11:32.846)\r\nDo you know why? this, I say this all the time. Once you flip that entrepreneurial switch, and I think you'll get this, you will take radical responsibility of your income situation. Like if it all burns down tomorrow, I'm gonna figure something out. And you'll be confident you can in that optimism. Your spouse does not necessarily share that trait. And so when we map,\r\n\r\n\r\nNikolas Hulewsky (11:49.791)\r\nMm-hmm.\r\n\r\n\r\nZach Ashburn (11:59.616)\r\nmap this out and it's like this super simple spreadsheet. it's, it's, told my partner is a spreadsheet genius. I'm like, I, have to take three shots and let me hit you in the head before you're allowed to make a spreadsheet that anyone sees that we can put this in front of you and you and your spouse can both see this is how the plan actually works. Like, this is what we just said. We moved last year. This is what we did. And I was like, it seems like it'll work. This is what it looks like for it to work. And that ability to share it as a household is\r\n\r\n\r\nNikolas Hulewsky (12:25.043)\r\nInteresting.\r\n\r\n\r\nZach Ashburn (12:28.53)\r\nso incredibly empowering and different from most people's conception of how do I like do a financial plan or get advice.\r\n\r\n\r\nNikolas Hulewsky (12:35.849)\r\nYeah, so like step one isn't even who's your ICP? How do you acquire customers? What's your lifetime value? Step one is like, okay, cool. Love it. You have a skill set. Sounds like you have an idea of kind of what you want to do. Is your spouse on the same page as you and what's the financial plan? Like let's, let's build out the financial plan so your spouse can be. Yeah. Dude, I love, I actually, really, really like that. I've been tracking my net worth since 2017, which doesn't sound like a long time, but when you like,\r\n\r\n\r\nZach Ashburn (12:50.444)\r\nYeah. And how can we make them confident? Yeah.\r\n\r\n\r\nNikolas Hulewsky (13:04.703)\r\ntrack all of your accounts every single month in a snapshot starting in 2017, it actually gets really crazy. Cause like in 2020 is when I started buying and selling businesses. And then it was like, well then how do I account for like unrealized gains and how do I account for equity in my business? And how do I account for cash flows that may happen but aren't guaranteed? Cause it's very different when you have a W-2 versus being an entrepreneur, don't know what your cashflow situation is going to look like.\r\n\r\n\r\nSo when you're doing the mapping, how do you map it? Are you like ultra conservative and you're like, okay, let's just map expenses and not even look at what your income is going to be, or do you have like a base level of, yeah, and you'll probably get this amount of income coming in.\r\n\r\n\r\nZach Ashburn (13:50.028)\r\nYeah, it depends a little bit on the nature of their business, but we, use a toggle that's essentially, prospective versus, contracted revenue for, for a consultant type person, because they, we should be tracking prospects. They should be tracking prospects. Like all of us as business owners should be tracking prospects and we can say, this is where you're on the most optimistic end. And I've had some clients that really like to lean into kind of handicapping their clothes, their clothes odds and say,\r\n\r\n\r\nNikolas Hulewsky (14:01.471)\r\nOkay.\r\n\r\n\r\nZach Ashburn (14:18.53)\r\nI'm not really confident about this one. let's not count that. that can be, could decide how you want to do that, but you should do some version of it. And then definitely contract.\r\n\r\n\r\nNikolas Hulewsky (14:26.249)\r\nSo in that you're helping them set up almost like their pipeline, where it's like, okay, cool, well, let's talk about what business you have, like what your deal flow look like currently, what percentage you're gonna convert, like building out a business operating system for them.\r\n\r\n\r\nZach Ashburn (14:33.496)\r\nYeah. Yeah, it's.\r\n\r\n\r\nZach Ashburn (14:39.886)\r\nA little bit. It's really light. One of the interesting things when you make this consultant leap is that a lot of tools exist for running a business. A lot of tools exist for personal financial planning. Are you tracking your net worth? As a consultant, that then overlaps way too much. And so your cashflow feels messy because like, yeah, they paid the business, but like, this is me. maybe I paid a...\r\n\r\n\r\nNikolas Hulewsky (14:52.874)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (15:02.396)\r\nYeah.\r\n\r\n\r\nZach Ashburn (15:03.79)\r\ncontract writer. That's an example that from recently I pay, I want to pay a contract writer. So I have like this one expense, but for the most part, it's like income in expenses out. So how do I think about that? How do I go through that? And I think, you know, we as humans just aren't that good at making that realistic. we, we default to this bias called mental accounting of like, I think I know where stuff is and I'm counting my income six times as I go through how much I can spend and stuff. So we're not taught like,\r\n\r\n\r\nNikolas Hulewsky (15:27.517)\r\nMm-hmm.\r\n\r\n\r\nZach Ashburn (15:33.282)\r\ndown the line, we can get into the really fancy levels of financial planning and how do we do things to help you with tax planning and estate planning, things like that. But like, even when you're at three, four or $500,000 of revenue as an independent consultant, it starts with cash and it starts with your personal balance sheet. And these are not the lofty and sexy ideas like you're saying, but they are the needle movers. Like they really do turn the dial.\r\n\r\n\r\nNikolas Hulewsky (15:55.23)\r\nor even...\r\n\r\n\r\nNikolas Hulewsky (15:59.061)\r\nI this piece too because you've heard of EOS, like Traction. I'm a visionary, I'm not an integrator. If you've ever read Traction, that book is not, in my opinion, that book is not written for who we're talking about right now. It's not written for people who are just starting a business or people who are deciding they want to be an entrepreneur and they go through the agency route like we're talking about.\r\n\r\n\r\nThat's kind of written for businesses that have hit product market fit and they're scaling. And so it's like, oh, okay, cool. Now we need to codify who are we? What do we offer? Who's our ICP? Let's have shared language around our core values. How will we attack things? How do we set goals? And like in the book, it's like, talk to your leadership team and decide upon. And if you don't have a leadership team, like the book's very difficult to apply to your business. And so like what you're talking about right now, in my opinion, is\r\n\r\n\r\nThere isn't a lot that's dedicated to individuals who are just starting out to get a feel for how they organize themselves. Fair?\r\n\r\n\r\nZach Ashburn (17:02.51)\r\nThat's absolutely right. We've sketched out a few principles that we just call the accidental entrepreneur principles. And one of them is to tell one of the things is you are the thing you are as a business owner. And that is an important shift, especially for a specialist, we think, because you think I am a will keep data analyst as our general example, or, you know, I am a fractional CMO or whatever. Like, that's what I am like, true. But the thing you are now\r\n\r\n\r\nNikolas Hulewsky (17:08.841)\r\nGo on.\r\n\r\n\r\nZach Ashburn (17:31.84)\r\nis a business owner and you are also happen to be employee number one who's a marketer or a data analyst. And that sure informs an awful lot because it tells you like, do I need? What do need to delegate to do the key things that I have to do? And how do I go about that? And if I'm a business owner, if I'm the executive here, I don't get to just abdicate the responsibility of not looking at my books or my cashflow. Like that's actually,\r\n\r\n\r\nIt's my job. I am a business owner. And so the moment, like principle number one is that cash flow is king when we schedule those out. The moment that income hits you as a business owner of any kind, like I don't care if you've got an LLC and I don't care if you've set up your books yet, but the income hit, the moment that happens, the thing you are is a business owner. And that can inform a lot of other things that you do.\r\n\r\n\r\nNikolas Hulewsky (18:24.679)\r\nOkay, what are the other tenets?\r\n\r\n\r\nZach Ashburn (18:27.456)\r\nI'll only get a lot of the pull up to go in order. So I know I'm off the top of my head and we should go through them that we say, no one's giving you permission. just got it. No one's no, no one's giving you permission as a charter school expert to go out and put your skills on the open market as a consultant. No one has to it's and you can still do it.\r\n\r\n\r\nNikolas Hulewsky (18:30.377)\r\nNo, just pretend like you know them off the top of your head. Just kidding.\r\n\r\n\r\nNikolas Hulewsky (18:41.587)\r\nWhy is that important?\r\n\r\n\r\nNikolas Hulewsky (18:55.829)\r\nNo one has to get so you're like telling them you're like, hey look, no one has to give you permission. You got this\r\n\r\n\r\nZach Ashburn (18:57.74)\r\nYeah, there's, there's, yeah, there's no one's coming and no one's going to, no one's going to come tell you like, by the way, you know, like come closer. You already, you know this, right? We're big fans of saying the comment already hit. I think I've heard you say things like this where you didn't necessarily think of yourself growing up as a entrepreneur type, but once you did, you can't, you can't go back to before you did. It's,\r\n\r\n\r\nNikolas Hulewsky (19:03.571)\r\nRight.\r\n\r\n\r\nZach Ashburn (19:27.562)\r\nA friend of mine compares it to being a parent. Once you became a parent, you will never go back to whoever you were before. like, maybe it's because your spirit is totally broken now. Exactly right.\r\n\r\n\r\nNikolas Hulewsky (19:36.757)\r\ncan't unsee the things that I saw. I can't, I can't unsmell that poopy diaper, Zach. No, I agree.\r\n\r\n\r\nZach Ashburn (19:43.694)\r\nI will never go so many months without sleeping again. But that's it. Like I can't go back to the knowledge that I generated $1,000 on my own for the first time. It will forever shape what I do next. And that includes how well equipped I am for the next W2 role. That's fine. It's not like that's not an option, but you've shaped how that's gonna look now.\r\n\r\n\r\nNikolas Hulewsky (19:47.849)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (20:06.303)\r\nSo that first one, no one's giving you permission. What's the hardest thing for most people to get over? Because it sounds like you're trying to rewire their brain from an employee to an entrepreneur mindset. Is there a moment for most people where it's like, this is the thing they have to do in order to feel that way? Or is it different for everybody?\r\n\r\n\r\nZach Ashburn (20:28.98)\r\nyeah, I'm sure it's different for everybody. I would suggest that it's that, that light bulb moment when that first contract gets offered to you, whether it's a buddy who's like, Hey, you're, you're an accountant, right? Can you just like look at my financials over here or you're, you're a marketer, right? Can you just look at this Facebook ad I'm putting together for my business? And you're like, yeah, sure. No problem. Just like, you know, buy me lunch. And when that light bulb hits, there's this question of\r\n\r\n\r\nNikolas Hulewsky (20:37.128)\r\nHmm.\r\n\r\n\r\nZach Ashburn (20:57.288)\r\nam I allowed to do this? Is it okay for me to do this? And I don't mean like, does your company, your W2 job want you to not do that? I mean, I have a job. I allowed to go out and just do things? Everybody's been saying that lately, but it's not natural. It is a good, need that reminder. You actually can go to Waffle House with your buddy and look over their marketing plan and get paid a hundred bucks or a waffle or whatever.\r\n\r\n\r\nNikolas Hulewsky (21:14.196)\r\nYeah.\r\n\r\n\r\nZach Ashburn (21:26.638)\r\nand that changes things.\r\n\r\n\r\nNikolas Hulewsky (21:29.653)\r\nI remember this shift in thinking where, like you said, it's both positive and negative. On the one hand, it's like, don't need permission from anybody. I can do whatever I want. Wow, we could do. Should we grow to 10 million? Yeah, we could set that goal if we wanted. Should we just do a million? yeah, we could be a million. But then the flip side is also, we just got sued and it's like, well, who do we call? Well.\r\n\r\n\r\nZach Ashburn (21:40.782)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (21:54.963)\r\nThey're in the room. They're already here. It's you. You know what I mean? Like you're...\r\n\r\n\r\nZach Ashburn (21:56.398)\r\nDo you ever still as a grown adult think like, I really need a grownup right now. It'd be really helpful if I could find a grownup.\r\n\r\n\r\nNikolas Hulewsky (22:08.661)\r\nIt would be really nice if I could phone a friend right now. Yes. Yeah. I all the time and anybody who's in entrepreneurship, that is a funny thing though is like you do get to a point where you, it's also very freeing where you're like, well, we can make the decisions. Oh, we got sued. Okay, cool. Well, we're in control of this. So let's figure out who we need to talk to and how we respond to it, et cetera. But it can also be very overwhelming at times in the middle of the night when you wake up and you're like,\r\n\r\n\r\nZach Ashburn (22:11.266)\r\nYeah, mom. 100%.\r\n\r\n\r\nZach Ashburn (22:24.385)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (22:36.271)\r\nmy gosh, if we lose this customer, we lose 30 % of our business and there's nobody else who's gonna figure this out but me. Like if I don't figure out the pitch, we're done. no.\r\n\r\n\r\nZach Ashburn (22:43.886)\r\nThere's not something like that. There's not something that prepares you to be in that, like the buck stops here kind of thing.\r\n\r\n\r\nNikolas Hulewsky (22:53.983)\r\nParenthood, think, is the closest. Being a parent is the closest, but it's incredibly different, but it, yeah, it's very similar. Okay, so what's the second tenet? So no one's gonna give you permission. What's next?\r\n\r\n\r\nZach Ashburn (23:05.444)\r\nyeah, so we can walk through it. So we said cashflow is king. The moment that money comes in and hits your situation, like things change. And that has demands on what you should do with that, but it's still things change. The thing you are as a business owner, that's one of our actual principles.\r\n\r\n\r\nNikolas Hulewsky (23:17.479)\r\nOkay, don't go away. So cashflow is king. Is that one of the three or is that like a sub tenant?\r\n\r\n\r\nZach Ashburn (23:21.868)\r\nYeah, we've got seven, seven acts of entrepreneur principles that cash flows king. The moment money comes in or out, I'm spending money to grow a business. Things have changed. You are a business owner is important to embrace. That is fundamental shift in like this role I'm taking. You you can think of the E-Myth if you've ever read that as a great book around that idea. Your, your org chart you were talking about earlier is even if you fill every role, like the thing you are premium is a business owner. we talk about\r\n\r\n\r\nNikolas Hulewsky (23:40.852)\r\nMm-hmm.\r\n\r\n\r\nZach Ashburn (23:51.682)\r\nthis relentless execution as one of the principles in conjunction with, with that no one's giving you permission because you, the thing that gets you where you want to go is to just keep doing it for the most part, just keep doing things for the most part. And that comes, comes hand in hand with that. No one's giving you permission to go do those things. But if you wake up and do the most key,\r\n\r\n\r\nmost key things every day as an independent consultant type person, you have exponentially increased your surface area for likelihood of success. I would love for it to hear your feedback. You've run bigger companies than like a consultant type person would. We started out talking about delegation. We have clients who are doing things like I need to hire a contract writer. I need to outsource certain things.\r\n\r\n\r\nThe way we've actually taken to describing that that seems to resonate more than most people is like, you're bad at most things and that's perfectly fine. And, and break, lean into that a little bit more. Like you're actually just not that good at almost anything.\r\n\r\n\r\nNikolas Hulewsky (25:04.509)\r\nYes, I totally agree. Let's see, am I lagging for you?\r\n\r\n\r\nZach Ashburn (25:10.7)\r\nYou did for a minute there, you cut out for a bit, but I didn't know if you'd be back or not.\r\n\r\n\r\nNikolas Hulewsky (25:12.437)\r\nAlright, I'm out. Muhammad, cut this part out. So, dude, there was a Harvard study that I read 10 years ago, and they looked at high performers. And one group of the high performers, they said, don't worry about anything else, just focus on what you're good at. And the other group of high performers, they said, try to work on your weaknesses. And which group of high performers do you think did better?\r\n\r\n\r\nIt was the group who didn't do anything else other than the thing that they were good at. And that has stuck with me. It's really like, hey, know yourself and what you're good at and what you're bad at and delegate out. So that's like the first thing that helped me understand this concept. But the second thing is, and this is a little bit more tactical, is I think that entrepreneurs are worried about delegating too early and they delegate out the thing that is most important to their business. when, like you were saying,\r\n\r\n\r\nentrepreneurs start a business, they've got to think that that's their core competency and that they're better than anybody else in the world at. Don't under any circumstances, delegate that first ever. Find the things that you're not good at. Find the things that you don't need a specialist for. Find the things that taste like chicken in every business and start delegating those things. Payroll, AP, receivables, credential, and like these things that are just not differentiators and then slowly offload as you continue to grow.\r\n\r\n\r\nUm, but don't, don't just think, gotta, I gotta find somebody else who can do what I do. Because if you outsource you, you outsource your business and now your business is just the same as anybody else. There's no differentiator and you either stagnate or you lose traction. So I'm a, I'm a big believer in that. It's like, yes, delegate for sure, but be smart. Like do it over time.\r\n\r\n\r\nZach Ashburn (26:55.512)\r\nYeah.\r\n\r\n\r\nfor the people who are gonna be looking to build a bigger business. I think that this consultant example kind of carries some extra water where you can say, I'm here at a company being a data scientist. I'm gonna go independent and be a data scientist, partly because I wanna get rid of all the crap that comes from being under the corporate umbrella. Like don't wanna do a morning meeting with my team on Mondays and I don't wanna sit in HR meetings that don't apply to me and I don't wanna have to deal with 74 emails a day for things that\r\n\r\n\r\nSo you want to like I want to be a specialist kind of full stop and then you become a business owner and lo and behold there are other things that come to be in business owner but that's where you can say for me and increasingly so with AI and stuff that I can be a specialist business owner and delegate my bookkeeping and delegate my marketing and delegate and by delegate could be just outsourced to but that but that doesn't get you out of the specialty right and for an independent consultant type there\r\n\r\n\r\nleveraging that as much as possible, but as you build a bigger business, it's easy to lose sight of that.\r\n\r\n\r\nNikolas Hulewsky (28:02.003)\r\nYet again, delegate the things that aren't core to your business. I think that's incredibly important. Don't hold on to the things just because you want to be cheap or because you want to say it like for whatever reason, get rid of the stuff that's not core to your business. Mark Zuckerberg like has talked about this. He's like, I wear the same outfit every day because I don't even want to spend mental energy thinking about what shirt should I wear? Stupid example, but you know that compounded thousands of times a day saves mental energy and makes you more mentally acute, you know, aware, etc.\r\n\r\n\r\nSo I think there's a lot of value in that, but he's not outsourcing the key decisions at Facebook. And you should never, ever, ever do that. But you should be smart early on, like hire specialists, get people in the door who can take those things off of your plate because they still will be headaches if you don't actually create a plan for them. Like Mark Zuckerberg's plan is I'm just going to buy all the same clothes and wear the same clothes. It's not, I'm not going to worry about what I wear and then never buy clothes. Like he's got clothes that are there for him.\r\n\r\n\r\nThat'd be a big problem if he didn't have clothes there, but he's like, you know, he's whatever he's created this plan to kind of take it off of his plate. Let me, let me ask you this. I want to go back to Cassius King.\r\n\r\n\r\nZach Ashburn (29:08.001)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (29:09.901)\r\nI think that many entrepreneurs, many people who like get into entrepreneurship struggle with this for reasons that are apparent and reasons that are not apparent. Some people like to talk about profit and it's like, well, you know, all my taxes, we made a $700,000 profit, but their accounts receivable is through the roof. And so they didn't actually take home that money. Right. So cashflow is incredibly important from that perspective. You need to watch your cashflow. But I also think people don't spend enough time on pricing.\r\n\r\n\r\nunderstanding where they need to be in order to have a margin. Some people are like, I don't care about having a margin. I just want to grow my business. And then they build themselves a business that's a prison. Some people are like, well, my service is amazing. So I'm going to charge a really high number. So they get one or two clients, but then they've got, they've only ever got this like really small niche business. When you're looking at cashflow, what are the things you look at and like try to help entrepreneurs understand as they're getting their head wrapped around it?\r\n\r\n\r\nZach Ashburn (30:07.444)\r\nSo for our set of people, I have a calculation that is made up to be clear. That is how to set your consulting rate. highly recommend, for this crowd, this is different from a business that you gotta manage cogs and find your rear margins. But for this crowd, you have a lot of data because you're coming out of a corporate role where your skills were shopped on a market across the whole economy and a company said, this is what it's worth.\r\n\r\n\r\nNikolas Hulewsky (30:22.716)\r\nNo.\r\n\r\n\r\nNikolas Hulewsky (30:35.219)\r\nYeah.\r\n\r\n\r\nZach Ashburn (30:35.576)\r\nBut you can't just charge that because you've got other stuff now that you're a business owner that you've got to deal with. And so we start and I usually do this calculation and say, you need to know what your hourly rate needs to be. You probably should never price your contracts as an hourly rate because that sounds terrible, but you should know what it is. And that's going to set your bottom guard rail so that you are less prone to take on work that drains you and is outside of your goals. And we do this calculation.\r\n\r\n\r\nNikolas Hulewsky (30:57.449)\r\nHmm.\r\n\r\n\r\nZach Ashburn (31:04.95)\r\nAnd then we say two things. One, the next step is to take it to auction, take it to the market and react to the demands. If you never get a job, but you're confident in your skills and your offering, then your pricing might be too high and vice versa. But the other thing is if you've already set your rate, I'm just bent to believe that you should probably double your rates. you're a person setting your own pricing and no one has ever told you and you just went out and offered it, you're probably about...\r\n\r\n\r\n50 % of where you should be. That's the general, again, this is just like the best. If you're gonna do anything and you're going out and shopping your personal skills as a consultant, you're almost assuredly going to undersell at first, under price at first. And if people are saying yes, you should just test the upper bounds. And it's hard, man, it's so hard to do.\r\n\r\n\r\nNikolas Hulewsky (31:36.713)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (31:57.781)\r\nDo you think it's, is it easier, is it easier to pull the price back than ratchet the price up?\r\n\r\n\r\nZach Ashburn (32:04.898)\r\nYeah, don't think it matters that much. Do you mean mentally or like as a company?\r\n\r\n\r\nNikolas Hulewsky (32:09.781)\r\nWell, I'm just thinking if I'm a consultant who's doing this now and like trying to figure out how to do it full time, if I've gone out and I'm like $100 an hour and I should have priced it at $200 an hour and now I've got four or five clients and I'm like, man, it needs to be higher. That's kind of, it's harder to ratchet it up for those clients. Then in my mind, if I went out at $300, got one client and then I'm like, oh crap, I'm charging way too much. I need to ratchet it down to 200. Like I'm gonna go to that client.\r\n\r\n\r\nZach Ashburn (32:17.794)\r\nRight, sure.\r\n\r\n\r\nNikolas Hulewsky (32:39.791)\r\nEither I'll keep it at 300 or I'll ratchet it down. But it's just, yeah, it's a much easier, in my opinion, like shift than the other way.\r\n\r\n\r\nZach Ashburn (32:42.126)\r\nand they're happy with that.\r\n\r\n\r\nZach Ashburn (32:47.938)\r\nYeah, I totally agree. just don't think it's natural. I don't think it's the natural progression of things. I think we're all prone to like, I mean, you as an expert in your field could and maybe you have, don't know, you could go out and consult for a company and you could charge a lot of money. And you could say, I'm not gonna do this again unless somebody pays me double because you told them once you like, I don't need to like you could, you could say, I'm gonna go for a day to your background's healthcare, right?\r\n\r\n\r\nNikolas Hulewsky (32:50.933)\r\nHmm.\r\n\r\n\r\nZach Ashburn (33:16.686)\r\nI'm going to go to a facility and I'm going to tell, I'll go for a day and they're going to pay me $25,000. And that sounds, that's crazy. That's just bonkers because it's a day of work. But you're like, but I'm just going to do it. And you get somebody to do it and you say, I don't really like it. I won't do this again, unless it's 50. And then you just go shop and you get shopped or referred or whatever. But lo and behold, if they hit your number, then you can just go do it is far closer to the natural progression of things, whether it's $25,000 a day or it's a hundred dollars an hour where.\r\n\r\n\r\nNikolas Hulewsky (33:43.125)\r\nHmm.\r\n\r\n\r\nZach Ashburn (33:46.38)\r\nyou just realize what your guardrail should be.\r\n\r\n\r\nNikolas Hulewsky (33:49.525)\r\nHere's something I struggle with. I am terrible at pricing. Terrible. I have lots of people who reach out to me that are like, oh, would you do a course or would you do consulting for me one off? And like, how much would you charge a month? And I always feel bad. I'm always like, 5,000 a month is probably what I should charge, but that's a lot of money. Does it make sense? I don't know.\r\n\r\n\r\nZach Ashburn (33:54.03)\r\nYeah, everybody.\r\n\r\n\r\nNikolas Hulewsky (34:17.173)\r\nI just feel bad. I don't know why. It's hard for me mentally to get to a place where I charge people. Do you find that a lot with these types of cons... Or am I just an idiot and should get over it?\r\n\r\n\r\nZach Ashburn (34:28.012)\r\nNo, I think that's really you feel you feel bad. I think it's closer to something that's more insecurity for for the average person. You're saying I'm hearing you say like, feel guilty if I do this or I feel like icky or I'm a nice guy and this my friend asking for help. I would just help them. Whereas I think the average person feels more insecure. Like, can I deliver value at fill in the blank rate? It turns out.\r\n\r\n\r\nNikolas Hulewsky (34:35.893)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (34:40.863)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (34:52.253)\r\nYeah. And it was the same thing in my jobs or even when I owned businesses. Like I was never motivated by money. It didn't matter if you were like, you could get a hundred thousand dollar bonus if you do this in the next month. It just wasn't the needle mover for me. There's lots of other things that move the needle, but like the dollars wasn't it. So I just, for me, it's hard time. Anyways, keep going.\r\n\r\n\r\nZach Ashburn (35:10.83)\r\nYeah. No, think like you're just described to two separate problems. One is I feel bad for like what I'm charging or I'm insecure about it. And the other is I don't know what to charge. Like these are not those are not the same problems. And so they probably have different solutions. A friend of mine gave me this advice early on when I had gone independent and I think it's I think it's really good. He's saying, you know, your pricing is right when it makes you a little bit nauseous to quote people.\r\n\r\n\r\nNikolas Hulewsky (35:20.745)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (35:40.885)\r\nHahaha\r\n\r\n\r\nZach Ashburn (35:42.574)\r\nAnd I don't know that that's precisely true, but it's tended to be true for me. It's like, if I ever get to where I'm really comfortable with what I'm priced at, man, it's time to increase price a little bit. Well, like maybe we should try it. Maybe we should just test it a little bit and find out. And I share that with every single client. It's like, tell me how you feel about your weight. And they're like, it's really, really comfortable. I'm really happy. like, maybe you should nudge it up and just see, see what happens. And if people say no, then you know, that's all right.\r\n\r\n\r\nNikolas Hulewsky (36:11.293)\r\nIn your experience when working with these clients, what percentage of the time when they increase it, do they have to bring it back down?\r\n\r\n\r\nZach Ashburn (36:12.066)\r\nI just love that advice.\r\n\r\n\r\nZach Ashburn (36:18.686)\r\nI don't know, I can think. Yeah, not very often. Where it changes.\r\n\r\n\r\nNikolas Hulewsky (36:21.203)\r\nIf you're to guess, knee jerk.\r\n\r\n\r\nLike when you're talking to them and you're like, you're comfortable, you should double your price or you should whatever, do this. And then they do it. How often are they like, I gotta bring it back down, Zach, you were wrong.\r\n\r\n\r\nZach Ashburn (36:29.312)\r\nMm-hmm. Yeah, right.\r\n\r\n\r\nZach Ashburn (36:35.232)\r\nIf you can convince someone to increase their pricing, they get that market feedback so quickly of like, if nobody buys, then you know, but that's probably not the case for most people, right? There is a difference in kind of nuance. if you're charging contract rates and you're like a flat fee for this project, thought then, then it is all it's multiple levers. Cause you can change your scope of what you do too. And so I, what I think the trend would be is continually narrowing scope and\r\n\r\n\r\nNikolas Hulewsky (36:57.941)\r\nMm-hmm.\r\n\r\n\r\nZach Ashburn (37:04.706)\r\ncontinually higher dollar amounts for that scope. Does that make sense? Like I'm actually doing the highest, the least number of things that provide the highest value, which are the highest, that is the highest return on my time as a specialist.\r\n\r\n\r\nNikolas Hulewsky (37:08.979)\r\nIt does make sense.\r\n\r\n\r\nNikolas Hulewsky (37:20.629)\r\nIs that usually what happens when they get started as a consultant? like, yeah, I'll offer anything to everybody. And then they whittle down their services over time.\r\n\r\n\r\nZach Ashburn (37:28.598)\r\nYeah. Most of the time I would describe it as there's a blank check at the beginning to that first person who, who offered you a contract. That's what made this whole like set all this in motion. And you're like, I don't know what I'll do, but I'm going to go do it. And, and that's awesome. Like that's really formative for all. We've probably all been there at one point or another. And then you're like, there was 94 things in this that I wasn't equipped or wasn't the right person or a waste of my time or whatever. And you get smaller and you refine who you work with and you refine exactly what you do.\r\n\r\n\r\nNikolas Hulewsky (37:36.052)\r\nYeah.\r\n\r\n\r\nZach Ashburn (37:58.158)\r\nyou know, as a subset of your specialty and what the market really needs, what the actual fit is. And this is all, this is funny. We've got, haven't talked about the actual financial planning of any of it or anything, but this is the trend that we see. We've had people leave big tech companies. And right now we see the acceleration of the volatility of the, of the, that industry as a whole. And our, our bet is kind of just that, that all ripples up to the, the best and most premier specialist.\r\n\r\n\r\nNikolas Hulewsky (38:04.265)\r\nfrom your\r\n\r\n\r\nNikolas Hulewsky (38:07.783)\r\nNo. No.\r\n\r\n\r\nZach Ashburn (38:27.928)\r\nhaving the opportunity to do this if they choose to.\r\n\r\n\r\nNikolas Hulewsky (38:31.157)\r\nFrom your experience, how long does it take them to go from, all right, I'm testing this out to I'm doing this full time, I'm making good money, I've got a very clear product and offering, I'm confident in my ability, I've got a good life. Like how long is that gap?\r\n\r\n\r\nZach Ashburn (38:49.078)\r\nYeah, it's, it's usually six months less than they initially planned for whatever that is. And I can say that specifically because we regularly use what I just call stoplight. So we'll map out these, your, your income, your expected income from your projects. And that might be a alongside a W two or, or your spouse's W two or whatever. And we got red, yellow, green, and red is like, no, we we've going to keep, we've got to keep our W two jobs because that's how we're making them.\r\n\r\n\r\nNikolas Hulewsky (39:10.261)\r\nOkay.\r\n\r\n\r\nZach Ashburn (39:18.444)\r\nthe bills work. And then yellow is like, we're seeing, we're seeing the growth of the, of the contract income. Things are working. Like maybe we could just float it if we had to, cause we're prepping our cash, whatever. And then green is the target you've set for how much income you want to have usually net to make this leap. And I can say pretty consistently that when people hit yellow on an upward trajectory, like now let's go ahead and do it. I'm in, in, I'm ready to go. Yeah. And that's been fairly consistent, you know, not over.\r\n\r\n\r\nNikolas Hulewsky (39:19.541)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (39:43.669)\r\nReally?\r\n\r\n\r\nbecause they see the traction. They've got confidence at this point.\r\n\r\n\r\nZach Ashburn (39:49.662)\r\nThey see the traction and they've developed their sense of where they want to be. And that's not a data set of thousands of people that I polled to get that. That's just been our anecdotal experience with a few people who came to us with still that W2. They hadn't made the leap yet. And they're like, how am I really strategic about this?\r\n\r\n\r\nNikolas Hulewsky (39:53.717)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (39:59.411)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (40:07.061)\r\nSo, okay, so six months earlier than they planned. Like on average though, how long were they planning? Are we talking about three years? Are we talking about?\r\n\r\n\r\nZach Ashburn (40:12.462)\r\nYeah, usually it's like a 12 to 18 month window. By the time they're talking to us, If they've already started consulting, they've already got this notion. Again, that's not scientific. That's just my sense of thinking back on the...\r\n\r\n\r\nNikolas Hulewsky (40:20.861)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (40:27.571)\r\nNo, I'm gonna cut that part out. I'm gonna cut out your hedging. You're specifically saying it will only take, I'm just kidding.\r\n\r\n\r\nZach Ashburn (40:35.756)\r\nRight, he guaranteed the results of...\r\n\r\n\r\nNikolas Hulewsky (40:39.145)\r\nHahaha!\r\n\r\n\r\nZach Ashburn (40:41.356)\r\nThat's the kind of thing that gets somebody like me in big trouble.\r\n\r\n\r\nNikolas Hulewsky (40:44.149)\r\nIn big trouble, in big trouble. But dude, this was awesome. I love breaking this down and trying to figure out how to help people more tactically approach entrepreneurship. If people want to come find you, is it like your website, Twitter? Like where's the best place to come interact?\r\n\r\n\r\nZach Ashburn (41:00.15)\r\nYeah, follow on Twitter. I share all the tools that we've got routinely and regularly. We've got a lot of resources for people that are looking to make the jump and man, love them long for the ride.\r\n\r\n\r\nNikolas Hulewsky (41:11.325)\r\nAnd you told me before the call you'll do a free consultation with anybody who was referred from this podcast, right?\r\n\r\n\r\nZach Ashburn (41:17.934)\r\nDude, you know how you're joking about this? I post like four times a week, I'm taking a walk right now, if you have tax questions or whatever, hit me up. And I have probably three or four awesome calls a week with people from Twitter. And it's awesome, I love it. Like, we just hash it out, it's super fun.\r\n\r\n\r\nNikolas Hulewsky (41:31.239)\r\nOkay.\r\n\r\n\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (41:37.449)\r\nLet's just we'll position this as Zach's going to give you a free $15,000 consulting conversation. Just kidding. But seriously, reach out to you. Have a conversation, right? Like it.\r\n\r\n\r\nZach Ashburn (41:47.63)\r\nYeah, absolutely. 100%. Yeah.\r\n\r\n\r\nNikolas Hulewsky (41:51.733)\r\nOkay. All right, man. I love it. We'll talk soon.",
  "metadata": {
    "duration": "",
    "date": "2025-05-23",
    "platform_source": "Google Drive"
  }
}