{
  "episode_number": "160",
  "episode_title": "AI SERIES: 9 - How Zapier Integrations Unlock the Magic of AI in Business with Olivia Look",
  "guest_name": "Olivia Look",
  "business_name": "The Automated Agency",
  "transcript": "﻿Olivia (00:00.142)\r\nnice.\r\n\r\n\r\nNikolas Hulewsky (00:00.421)\r\nCan you, let me make sure my mic is, yes. Yes, we are good. All right, Olivia, I'm super excited to nerd out with you today. As you said in our pre-call, I'm going to learn some really cool AI stuff. For the people at home, what is your business and how are you currently using AI?\r\n\r\n\r\nOlivia (00:17.432)\r\nThank you for having me on today. My business is the Automated Agency. It is an automation agency that primarily focuses on client-facing businesses. So we do a lot of work in professional services like financial services and other agencies.\r\n\r\n\r\nNikolas Hulewsky (00:37.179)\r\nSo automation, you're not using AI very much.\r\n\r\n\r\nOlivia (00:41.166)\r\nWe use AI in our automation a ton. We started as an automation agency and maybe some rebranding needs to happen, right? We started though in early 2023, right before everything became really accessible and easy to build with and really just took over the whole world. So.\r\n\r\n\r\nWe use a ton of AI, we build a ton of AI automations for our clients as well. So as many awesome ideas as I constantly see, other people are also bringing us their awesome ideas and we get to build those out, which is a lot of fun.\r\n\r\n\r\nNikolas Hulewsky (01:17.305)\r\nWell, the cool thing about agency owners like you is I talk about this a lot with people who are like, AI is not there yet. Talk to me when it's there. I tell people, if you're just getting into AI when it's finally quote unquote there, you're behind the curve. Like you need to understand the potential use cases for AI. So when it is there, you can quickly implement things. I think of that as like automation agencies, right? You were already thinking about how to streamline, how to get things going with like touch lists.\r\n\r\n\r\nAnd then AI came along and it's like, okay, I've already been thinking about how to architect this stuff. AI is just going to supercharge my business. So that's why I like talking to people like you, because you probably just have a ton of amazing ideas.\r\n\r\n\r\nOlivia (01:55.616)\r\nYeah, it's really great. We have a bunch of ideas and everybody else has awesome ideas that they just send to us constantly. So there's a lot of really great stuff going on in every different business. There's a million applications for AI, particularly in automation.\r\n\r\n\r\nNikolas Hulewsky (02:13.253)\r\nTell me which models are you using and for what.\r\n\r\n\r\nOlivia (02:17.07)\r\nI am typically using ChatGBT almost all the time and OpenAI. That is the product that most of my clients are familiar with. I also had a very positive developer experience with OpenAI in like 2022 and I got hooked then and I'm locked in at this point.\r\n\r\n\r\nNikolas Hulewsky (02:38.299)\r\nIs that the only tool you use? You don't use any of the other LLMs?\r\n\r\n\r\nOlivia (02:41.27)\r\nWe have a couple of others that we use. That's the one I primarily use personally. And it is the most popular one amongst our client base. That said, we have a little bit, yeah.\r\n\r\n\r\nNikolas Hulewsky (02:49.339)\r\nOkay, so clients excluded, clients excluded. what do you, do you use anything else? Like a lot of people say they use Claude for coding. People use Gemini for like the Google ecosystem. People use Grok and Perplexity for real good, deep research and real time data, right? So do you use any of those for those reasons? Or are you just like, nope, I'm chat GPT all the way.\r\n\r\n\r\nOlivia (02:57.486)\r\nMm-hmm.\r\n\r\n\r\nOlivia (03:08.088)\r\nMm-hmm.\r\n\r\n\r\nOlivia (03:13.204)\r\nYes, okay, so I love that question. I am using ChatGPT personally for everything. Particularly in my business, I think it's great as...\r\n\r\n\r\nIt's great everywhere. It's really, but the difference I think in chat GPT versus Claude for like the chat interface and just kind of bouncing ideas off of like, what didn't I consider here or take a look at this file, like what's going on here? I don't think there's a huge difference in the chat based.\r\n\r\n\r\nNikolas Hulewsky (03:41.659)\r\nMmm.\r\n\r\n\r\nOlivia (03:46.398)\r\nstuff. So I'm using chat gbt for everything prompt wise, business ideas, content, file analysis, that kind of thing. And then I use perplexity when I am looking for more of that deep research. But also like this morning I saw two trees growing out of the same spot and I had a question about that. I asked chat gbt about that.\r\n\r\n\r\nNikolas Hulewsky (04:11.783)\r\nThat's a good thing to ask because it's like, what's going on here? Is the world mutating? OK, so it is cool. No, it totally is cool. But you're not using anything else for the coding because I know you do a lot of automation. Do you do custom code for your automation?\r\n\r\n\r\nOlivia (04:16.718)\r\nI thought it was cool. It is cool. I got a great explanation of it.\r\n\r\n\r\nOlivia (04:28.8)\r\nYes, we are largely a no code agency. So we typically use tools like Zapier and Make to tie automations and apps together. And then we will use code occasionally to kind of step in where there are gaps. So I occasionally use ChatGBT to write code, code, know, lines of code is not something that our agency is generating.\r\n\r\n\r\nNikolas Hulewsky (04:55.813)\r\nPerfect. Can you, before we look at your use cases, can you talk about like what is Zapier? Do you say Zapier or Zapier?\r\n\r\n\r\nOlivia (05:04.578)\r\nZappier makes you happier.\r\n\r\n\r\nNikolas Hulewsky (05:06.339)\r\nOkay. I said it was apier for years. And then I finally heard someone else say Zapier. And I was like, that makes sense that that's the name, but I just can't call it that. Anyway, these tools like make Zapier and eight and trying to think flow wise that help connect different data sources essentially, can you talk about how it works? So somebody who's listening to this name out fully understand like, what do you what do mean you use\r\n\r\n\r\nOlivia (05:13.87)\r\nIt's okay.\r\n\r\n\r\nNikolas Hulewsky (05:35.673)\r\nZapier, what does that do?\r\n\r\n\r\nOlivia (05:37.482)\r\nYes, okay. So Zapier in particular is a tool that we use often in our automations and it lets you build workflows, but...\r\n\r\n\r\nNatively, what it really does is make it really, really easy for you to connect all of your apps together. So I'm not just using ChatGBT today. I'm using ChatGBT and my ClickUp and my Gmail and the entire Google workspace. Connecting all of those tools together is what platforms like Zapier and Make and NodeMation are about, or NADN. Yeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (06:10.841)\r\nYeah, very cool. Okay. All right. I want to see some use cases. You told me you had a list and that like, just made me so happy inside. I can't wait to see some of the cool stuff you're using.\r\n\r\n\r\nOlivia (06:16.807)\r\nI do have a list.\r\n\r\n\r\nAwesome, awesome. Okay, so I do have a list. It kind of goes from lower complexity to higher complexity. So I'm gonna start with, think like a very basic idea, something that's very, very popular that we do is taking your call transcripts, which come from Fathom, which come from Riverside here, might do them as well, Zoom.\r\n\r\n\r\nNikolas Hulewsky (06:31.451)\r\nOkay, perfect.\r\n\r\n\r\nNikolas Hulewsky (06:47.513)\r\nYep. Firefly, Otter AI.\r\n\r\n\r\nOlivia (06:50.382)\r\nYeah, so everybody's got those transcripts, right? And Zapier, you can connect that app. You can connect your Zoom, your Fireflies, whatever app. And then you can trigger an automation when a new meeting is completed. So you just hang up the phone. Yes, so I don't use Fathom. So I don't have a note taker. Let me see. I also have to go through my hundreds of zaps. So let me, let me.\r\n\r\n\r\nNikolas Hulewsky (07:04.197)\r\nCan you share your screen and actually show me this? Okay.\r\n\r\n\r\nThat's fine.\r\n\r\n\r\nNikolas Hulewsky (07:18.971)\r\nWe can edit this part out. Will you try? I forgot to ask you this before we started. Will you try to share your screen? Because this has happened a couple of times where people try to share it it's like, have to do permissions and then you have to log out and log. Anyways, it's kind of a whole thing, but.\r\n\r\n\r\nOlivia (07:21.07)\r\nPerfect.\r\n\r\n\r\nOlivia (07:26.195)\r\nsure.\r\n\r\n\r\nOlivia (07:33.294)\r\nFun, okay, yes, I can share screen one, which is annoyingly on the right here. I have my monitors configured, so they go left to right. This is two and this is one, but I'm looking at, yeah, don't love the way my monitor is set up, but anyway, so let me...\r\n\r\n\r\nNikolas Hulewsky (07:37.997)\r\nOkay, cool. I just wanted to make sure that that was.\r\n\r\n\r\npossible.\r\n\r\n\r\nNikolas Hulewsky (07:45.914)\r\nYou're just...\r\n\r\n\r\nNikolas Hulewsky (07:52.603)\r\nThat's okay. That's all right.\r\n\r\n\r\nCause I think what's interesting for like people will hear that. And I've heard that for many, for a long time, but it's like, okay, it's still overwhelming to go to Zapier, Zapier, excuse me. And it's like, okay, what do I do? I'm in Zapier now. Like, what do you mean? I set up an automation. just, I did my first make automation yesterday and it was both exciting. I was like super excited and proud of myself and horrifying. Cause I was like, this is actually way harder.\r\n\r\n\r\nOlivia (08:09.547)\r\nYeah.\r\n\r\n\r\nOlivia (08:15.158)\r\nAmazing!\r\n\r\n\r\nNikolas Hulewsky (08:24.507)\r\nthan I thought it was going to be. You know what I mean? So that was my takeaway from it. I'm actually more likely to hire an agency now than I was before because before I was like, I'll just figure out how to do it. And now I'm like,\r\n\r\n\r\nOlivia (08:24.686)\r\nYeah. Yeah.\r\n\r\n\r\nOlivia (08:30.891)\r\nWhat is your?\r\n\r\n\r\nYeah, that is standard use case. All kinds of clients come to us because they start building and then are like, whoa, this got way bigger than something that I can handle right now. What is your realm of expertise?\r\n\r\n\r\nNikolas Hulewsky (08:45.295)\r\nMm-hmm. Told it.\r\n\r\n\r\nNikolas Hulewsky (08:50.587)\r\nWhen you say realm of expertise, like technology wise or business wise? I would say healthcare is where I have the deepest knowledge set, but I've operated in a lot of other e-commerce, home services, I'm trying to think of what else, real estate.\r\n\r\n\r\nOlivia (08:55.436)\r\nbusiness-wise.\r\n\r\n\r\nOlivia (09:06.644)\r\nAwesome. Okay. Okay, cool. So business savvy and technical enough to get somewhere, but not everywhere. Yeah. Awesome. Awesome. Okay. So let's start with sort of a simpler one again. So this is live for us right now. All this does right now is when I have a new recorded Zoom meeting.\r\n\r\n\r\nNikolas Hulewsky (09:17.147)\r\nTotally. Yeah.\r\n\r\n\r\nNikolas Hulewsky (09:27.343)\r\nOoh, this looks okay. Me liking.\r\n\r\n\r\nOlivia (09:36.486)\r\nIt adds a folder in Google Drive and uploads the recording. So that's all this does. It has a really big impact because the folder that all of these go into are shared. So it's then very easy for all of our teammates to access the recordings. So.\r\n\r\n\r\nNikolas Hulewsky (09:40.826)\r\nThat's all.\r\n\r\n\r\nNikolas Hulewsky (09:53.595)\r\nCan you select that zoom box, that first one? Can you show me like what's in there? Perfect. So.\r\n\r\n\r\nOlivia (09:57.358)\r\nMm-hmm.\r\n\r\n\r\nOlivia (10:00.992)\r\nAbsolutely. So the trigger here is set up. It's very visual, Zapier is. So it's very easy to add and change steps. But basically I chose Zoom from here. When you go to make a trigger or an action in Zapier, you choose the app. No problem. Do it.\r\n\r\n\r\nNikolas Hulewsky (10:25.771)\r\nWhat's difference between a trigger and an action?\r\n\r\n\r\nOlivia (10:29.816)\r\nlove it. A trigger is what starts an automation. So that's the shotgun start. This is the thing that is going to make all of the actions happen. A trigger triggers the automation to run. The actions are everything that follows.\r\n\r\n\r\nNikolas Hulewsky (10:47.195)\r\nOkay, so the trigger in this case would be the zoom one. That's the trigger. Okay, so it's you have it set up here where Zapier, I don't know how, is there a frequency where it just goes and checks zoom to see when a call is completed or like how did you set up when it goes and actually pulls that transcript?\r\n\r\n\r\nOlivia (10:50.038)\r\nYes. Yes.\r\n\r\n\r\nOlivia (11:06.24)\r\nYeah, this happens instantly. This is an instant trigger in Zapier and most things in Zapier trigger either immediately as they happen or within 15 minutes of them happening.\r\n\r\n\r\nNikolas Hulewsky (11:22.107)\r\nOkay, so I don't have to push a button for this to run. It just automatically goes. is it, I don't know. Zoom has the recording and then it's going to zoom and pulling the recording. Is that what it's doing?\r\n\r\n\r\nOlivia (11:34.214)\r\nYes. So the really cool thing about Zapier is that it has handled all of the app connections for you. So this is like a Zoom sponsored, like Zoom likely has a team, like some dedicated developers that work on the Zapier integration. So yes, this pulls directly to Zoom. This is sanctioned by Zoom. When you connect to your account, which you don't see me doing right here, but\r\n\r\n\r\nNikolas Hulewsky (11:56.409)\r\nMm.\r\n\r\n\r\nOlivia (12:03.426)\r\nYou basically choose the app, choose what you want to trigger the event or to trigger the automation. So I chose a new cloud recording. You can choose a new audio transcript. You can see there's lots of different triggers for every different app. And we have actually a really cool report that I fully automated a couple of months ago.\r\n\r\n\r\nthat basically you input the list of apps that you use for your business and it outputs a list of Zapier triggers and actions that are available for those apps. So it kind of shows you the building blocks that are available.\r\n\r\n\r\nNikolas Hulewsky (12:36.731)\r\nNikolas Hulewsky (12:40.507)\r\nThat's really cool because you don't necessarily know what it can do. I told you, I built a make automation yesterday and it was integrated Google Docs, right? And then there's all this functionality within the Google Docs. wasn't like I just connected it to Google Docs. I could go and pull on Google Doc. I could create a new Google Doc. I could add it to that Google Doc. I could edit the Google. There's a whole list of functions. I just didn't realize, it does all of these.\r\n\r\n\r\nOlivia (12:45.143)\r\nYes.\r\n\r\n\r\nOlivia (12:53.144)\r\nYeah.\r\n\r\n\r\nOlivia (13:03.265)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (13:06.607)\r\ndifferent things. That's a really cool. I want to see that. Can we see? not right now, but can we see that in a minute? Okay. Sticking on this. And again, I'm an idiot. So there may be people who are listening to like, yeah, Nick already know all this stuff. I don't. I built something last night in app scripts, app scripts. Yes, app script, Google app script. So I went to my Google sheet. I created a new app script and in there I had to\r\n\r\n\r\nOlivia (13:09.858)\r\nYeah, yeah, of course, of course. Yeah.\r\n\r\n\r\nOlivia (13:26.56)\r\nOkay, Google Apps Script, yeah.\r\n\r\n\r\nNikolas Hulewsky (13:35.099)\r\nput in the API token for the website I was pulling from. Basically what I'm trying to do is I'm trying to get my podcast downloads, which are on Buzzsprout, automatically populated into a spreadsheet every single day. Right now have my assistant doing that. I'd like to just see if I could get it automated. I just want to see if I could do it. But I had to put my API key in and then it created some JavaScript and it's now generating. It's not great, but cool. I felt proud of myself. With things like Zapier,\r\n\r\n\r\nI don't need, do I not need the API key because they, they have a native integration with I'll say Buzzsprout. Like what I have not needed necessarily that I'm not saying that it has Buzzsprout. What I'm saying is for things like zoom, I may have had to have an API key if I was building outside of Zapier, whereas within Zapier, because they have an integration and a team and that, that they have permission to use, you don't need the API key. It's, it's a lot simpler to set up.\r\n\r\n\r\nI said a lot of freaking words there. Does it make sense when I'm asking?\r\n\r\n\r\nOlivia (14:35.691)\r\nYes, yes, it does make sense. Thankfully, they handle authentication in a really smooth way. I will say sometimes you do need an API key. So what happens, and I'm not sure if, so I'll act like I'm connecting a new account here. Yes, you can see my popup.\r\n\r\n\r\nOkay, cool. So you will typically get a little pop up here and it will say, you know, you're about to add Zapier. This is a zoom window that's saying, hey, we're connecting Zapier right now. Sometimes when you pop this up, I'm already logged into zoom. So it's just granting me the permissions. Sometimes it will ask me to log in, but then once I log in, that will be here and it just stays.\r\n\r\n\r\nNikolas Hulewsky (15:19.387)\r\nOkay. I have a question for you. I'm sorry. I'm all over the place. I just think this would be really cool. Do you think, how long would it take you to rebuild this flow from scratch? Okay. That's fine. Can we, can we rebuild it together and just show people like, Hey, in Zapier, this is exactly how you build this flow.\r\n\r\n\r\nOlivia (15:21.004)\r\nYes, I love all of this.\r\n\r\n\r\nOlivia (15:28.974)\r\nTwo seconds, sorry, 30.\r\n\r\n\r\nOlivia (15:39.638)\r\nYeah, this, yes, okay, yes, but there's not any AI in this one, Nick, so I can, okay, yes, one second, so let me get rid of this, because that was a real, that was an actual zap.\r\n\r\n\r\nNikolas Hulewsky (15:44.387)\r\nI don't care. I don't care.\r\n\r\n\r\nNikolas Hulewsky (15:53.179)\r\nHere's the reason I don't care. I'm personally, what I'm realizing about AI is you can't utilize AI unless you have a really clear understanding of what your systems and processes are. And in a weird way, a system like Zapier or Make, they like force you to create a workflow. So now you have systems, right? And then once you've created it within Zapier for the first time, now all of a sudden it's like, how could I use?\r\n\r\n\r\nOlivia (16:07.553)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (16:23.011)\r\nAI in here. okay. It just uploads to the Google drive, but could I actually have chat GPT analyze these transcripts for me? Right. Then, then all of sudden there's a use case for, for AI to come in into this. But I think before then there's like these building blocks of just understanding how does the flow and process work within a system like Zapier? Cause you need that. In my opinion, the APIs are what really unlock AI.\r\n\r\n\r\nOlivia (16:42.68)\r\nYeah.\r\n\r\n\r\nOlivia (16:48.276)\r\nYeah, and I love that you mentioned that because it gets talked about a lot in the automation space and a lot of automation professionals will swear up and down that you have to have systems in place before you can automate.\r\n\r\n\r\nAnd I have personally automated a lot of stuff that did not exist previously because it was just something that I imagined. It wasn't a system that existed. I didn't do anything manually before. just came up with a system. And then, like, this is the documentation of the system a little bit. I mean, like, you look at the steps and you can see. So the way you say it, forces you to systemize and think about your workflows.\r\n\r\n\r\nNikolas Hulewsky (17:03.643)\r\nSo,\r\n\r\n\r\nNikolas Hulewsky (17:22.852)\r\nTotally.\r\n\r\n\r\nOlivia (17:31.488)\r\nIt's a part of the automation process, I think. Yes.\r\n\r\n\r\nNikolas Hulewsky (17:33.999)\r\nBecause then you can use AI. Like before you systematize it like this, can't, you can use AI if you're just prompting it or if you're uploading a transcript, like if you manually go and do this stuff, but if you want it automated and you don't want to do all of that work, you have to systematize it somewhere. And systems like Make and Zapier, they allow the API access that really unlocks the magic of AI within your business, in my opinion.\r\n\r\n\r\nOlivia (17:42.594)\r\nMm-hmm\r\n\r\n\r\nOlivia (17:57.204)\r\nYes, yes, the business workflows, absolutely. And the integrations between all of your apps. Just being able to interact with AI with all of your business data. And like you said, you didn't have to prompt it directly. You just let it be a piece of your flows. So let's build something similar here. So I have a brand new Zap here.\r\n\r\n\r\nNikolas Hulewsky (18:15.035)\r\nOkay, so we're doing Zoom. Yep.\r\n\r\n\r\nOlivia (18:23.662)\r\nDo you want to try this? This is AI in Zapier. So when a new zoom recording script is available.\r\n\r\n\r\nNikolas Hulewsky (18:34.043)\r\nSo when you say, when you open this, all of these automatically popped up. You didn't ask it to put any of this in. OK.\r\n\r\n\r\nOlivia (18:38.902)\r\nYes, this is the new fresh zap. So right here I can pop over here and just create zap. I think you can also do zap.new. Yeah, and get so anyway, this is why I have hundreds of zaps in my account.\r\n\r\n\r\nNikolas Hulewsky (18:47.547)\r\nMm-hmm. Awesome.\r\n\r\n\r\nNikolas Hulewsky (18:53.363)\r\nvery cool. So anybody. Okay. So I'm a business owner. come here. AI is now even able to assist me in creating those apps. So you're putting it into the, into this window and saying, this is what I want to\r\n\r\n\r\nOlivia (19:05.091)\r\nYes.\r\n\r\n\r\nYes, so I can build the Zapier, the Zap manually if I want to, but I can also use this and say when a new zoom transcript is available. So I will say I want to prompt chat GPT. AI by Zapier is also a built in tool that works very similarly.\r\n\r\n\r\nSo prompt chat gbt to pull questions.\r\n\r\n\r\nNikolas Hulewsky (19:44.987)\r\nOr just summarize, could you just like, I to chat with you to summarize.\r\n\r\n\r\nOlivia (19:46.03)\r\nyeah, Yeah.\r\n\r\n\r\nAnd let's see how this behaves for us.\r\n\r\n\r\nNikolas Hulewsky (19:55.003)\r\nTell me really quickly, so what is Zapier AI?\r\n\r\n\r\nOlivia (19:58.744)\r\nZapier AI, so Zapier has been putting a ton of time and effort into adding genuinely useful AI products to their tool. So some of the business apps that we've been using, like, threw a little chat bot in there and we're like, we have AI, awesome, and it like isn't really useful. Zapier has some actually useful stuff.\r\n\r\n\r\nNikolas Hulewsky (20:09.86)\r\nMm-hmm.\r\n\r\n\r\nOlivia (20:26.786)\r\nAnd that includes both this co-pilot here, which is helping me build, but also their own LLM that you can prompt and interact with.\r\n\r\n\r\nNikolas Hulewsky (20:38.457)\r\nWell, cause one of things I was going to say that I just learned about was that you can have access to open AI, right? You're going in here and you're like, Hey, summarize this transcript, but when you start doing these API calls, you're being charged for it. Is that correct?\r\n\r\n\r\nOlivia (20:57.491)\r\nthe through open AI or through.\r\n\r\n\r\nNikolas Hulewsky (21:00.603)\r\nYeah, no, no, no, through open AI.\r\n\r\n\r\nOlivia (21:03.987)\r\nYes, you do pay for the OpenAI API.\r\n\r\n\r\nNikolas Hulewsky (21:07.053)\r\nRight. So what I'm saying is like, had a regular chat GPT account. And then when I went to try to set up an automation, I had to set up, I had to like preload it with $10 because there is a certain amount that they charge you per token, essentially like per API call that they're coming in. So I didn't know that, right? Like as as a business owner, I would have just thought, well, I already have the subscription. So that should cover this, but there's actually, if you're using chat GPT in any of these systems.\r\n\r\n\r\nOlivia (21:21.866)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (21:34.171)\r\nbecause it's calling in between it. have to pay on top of that per API call. OK.\r\n\r\n\r\nOlivia (21:38.038)\r\nYes. Yes. And the usage, you can see the usage in your OpenAI account. But yes, I recall that doing that same process, setting it up the first time, having to go and preload that $10. Then I will say send a Gmail here to just tie this up neatly. So.\r\n\r\n\r\nNikolas Hulewsky (21:52.313)\r\nYep, yep. Preloaded alright, so we.\r\n\r\n\r\nNikolas Hulewsky (22:00.731)\r\nCool.\r\n\r\n\r\nOlivia (22:04.862)\r\nIt's handling this over here. It is going to select some triggers and actions and set up. So here it is suggesting an outline.\r\n\r\n\r\nNikolas Hulewsky (22:05.403)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (22:15.257)\r\nAnd as you're going through the process of you're adding each one of these softwares, do you have to log in each time to like authenticate or give it permission to add zoom or Gmail or the G suite?\r\n\r\n\r\nOlivia (22:27.374)\r\nYeah, so let me show you here we have in Zapier you actually have app connections where you can see everything, like the accounts. And these are persistent, so you will occasionally get a notification that you need to reconnect something, but typically it stays. It's really nice. Which one? is okay. So.\r\n\r\n\r\nNikolas Hulewsky (22:34.266)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (22:37.635)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (22:45.88)\r\nre-authentication.\r\n\r\n\r\nThat's awesome, okay.\r\n\r\n\r\nOlivia (22:56.79)\r\nIt says you can automate the process of summarizing Zoom transcripts and sending with this app. Here's how you can build it. And so I'll say, cool, go ahead and throw those in there. Love that. It automatically selected probably what I typically use.\r\n\r\n\r\nNikolas Hulewsky (23:10.807)\r\nMm-hmm. And what are some of the fields you have to select?\r\n\r\n\r\nOlivia (23:17.172)\r\nYeah, let me see what it said here. So it is trying to configure steps here. So I connected right here and then in the configure tab, there's the scope. So I have a business Zoom. So you can do only audio transcripts created by me or only all on the account. So there's multiple people on our Zoom.\r\n\r\n\r\nPreviously, we were having to do a separate connection for each person's Zoom account. So we'll see if the...\r\n\r\n\r\nNikolas Hulewsky (23:53.925)\r\nthat's good point, right? Because if they're all storing individually, then you can't pull it from one zap. You've got to create a bunch of different zaps.\r\n\r\n\r\nOlivia (24:01.526)\r\nYes, and that's honestly something that we work around quite often is, you know, one zap per person when that kind of scope configuration isn't possible. So then when I say test it, it finds records and this is either going to pull an audio transcript from Zoom for me or it will just give\r\n\r\n\r\nNikolas Hulewsky (24:23.803)\r\nThank you.\r\n\r\n\r\nOlivia (24:28.011)\r\nsample. So this is actually giving sample data right now.\r\n\r\n\r\nNikolas Hulewsky (24:33.509)\r\nSo it's going and just testing that it can go and pull from Zoom.\r\n\r\n\r\nOlivia (24:37.204)\r\nYes, yes exactly. And typically you'll find it will get things. So this is acting up right now and I'm curious. So if I have a new cloud recording, does that show? Do those triggers show?\r\n\r\n\r\nthese are. this, yeah, so this is an actual meeting. This, I recognize this meeting, this is not an example meeting, like this data is here. And so,\r\n\r\n\r\nNikolas Hulewsky (25:01.392)\r\nMm-hmm.\r\n\r\n\r\nOlivia (25:08.6)\r\nThis one is trickier because I don't have, see Fireflies, I know from experience with building for other people that Fireflies actually in the trigger data. all of this data is what comes out of your trigger. Fireflies actually sends the text of the transcript and Zoom gives you these download URLs.\r\n\r\n\r\nNikolas Hulewsky (25:23.685)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (25:29.947)\r\ntranscript.\r\n\r\n\r\nNikolas Hulewsky (25:38.064)\r\nreally?\r\n\r\n\r\nOlivia (25:39.23)\r\nYes, which I can potentially work with. So you're watching me build like live live right now. We're discovering feasibility as as we go. So I will say I want to find a recording and download it because that will potentially.\r\n\r\n\r\nNikolas Hulewsky (26:02.043)\r\nallow you to work around.\r\n\r\n\r\nOlivia (26:04.923)\r\nYes to grab the\r\n\r\n\r\nOlivia (26:11.095)\r\ntext.\r\n\r\n\r\nNikolas Hulewsky (26:13.947)\r\nWe will edit this to it look like it's the simplest thing in the world.\r\n\r\n\r\nOlivia (26:18.446)\r\nno, it's okay. It's okay. You know, it gets... It gets complicated. And it... Ultimately it benefits us because, you know, people come to us to... Okay, so this gave us a file. This is absolutely a video file. I'm annoyed that it didn't give me a transcript in my test data!\r\n\r\n\r\nNikolas Hulewsky (26:32.007)\r\nThat's true.\r\n\r\n\r\nOlivia (26:47.456)\r\nSo like this is just, you know, and this is what people pay us to deal with. But so just assume, let's assume we got a nice little transcript from step one. Can we?\r\n\r\n\r\nNikolas Hulewsky (26:47.643)\r\nI'm doing it.\r\n\r\n\r\nNikolas Hulewsky (27:00.719)\r\nYes, of course.\r\n\r\n\r\nOlivia (27:03.278)\r\nSo, this is very much like what you would expect to see in any given AI tool where you can feed a prompt to an LLM and receive a response. So, in this, you just put your prompt here. So, like, I would say, here's the meeting name, and then I can map the meeting name.\r\n\r\n\r\nAnd then I can say, here's the transcripts and just, hi. I'll throw sample data in here.\r\n\r\n\r\nOlivia (27:49.962)\r\nOkay. And then I'll say write a follow-up email.\r\n\r\n\r\nOlivia (28:00.216)\r\nfor this transcript. Okay, so that's my very simple prompt. Zapier also has a prompt assistant that I won't show you right now, but can help you create really awesome prompts for this kind of thing. And then if you want, you can have it output specific fields. So I can say, I want the subject line and the like email body.\r\n\r\n\r\nOlivia (28:33.518)\r\nAnd let me see if I can get away with not explaining to it what an email body and subject line is.\r\n\r\n\r\nNikolas Hulewsky (28:43.375)\r\nFingers crossed.\r\n\r\n\r\nOlivia (28:44.302)\r\nSo anyway, is... show me my test. Here we go.\r\n\r\n\r\nOlivia (28:57.848)\r\nSo this is a draft, yep. And then so this, I have this output, right? This is the best part right here, okay? So then I say, I wanna send an email.\r\n\r\n\r\nNikolas Hulewsky (28:59.695)\r\ndid it. Yeah.\r\n\r\n\r\nOlivia (29:10.894)\r\nAnd I can, you know, I can set all the two from all this. It's very like, you know how to set up an email. In the body, I can map the output of the AI step.\r\n\r\n\r\nNikolas Hulewsky (29:27.451)\r\nWhat does that mean? What do you map the output? the AI step that was just generated. You can map. To this next. To the body of the email is going to send OK.\r\n\r\n\r\nOlivia (29:34.52)\r\nYes. So that, I didn't know Zapier did that. That's beautiful. So that variable right there, basically we fed the AI, the prompt with the variables from the step before. It then took that, crunched it up, turned it into different variables. And now we have access to output variables from step two. So then in step three, we can actually map any of the data.\r\n\r\n\r\nfrom the previous steps. So there's a lot you can do. For example, I could make the subject line to be lazy, just the topic of the Zoom meeting.\r\n\r\n\r\nYeah, and this will send.\r\n\r\n\r\nNikolas Hulewsky (30:20.539)\r\nOkay, so you set this up, Zoom does a recording, it's done. Then it pushes so that ChatTPT does a summary in the format that you just said. And then you have the option to say, send this out via email to everybody highlighting these things.\r\n\r\n\r\nOlivia (30:40.534)\r\nYeah, it can be an email, can be a Slack message, it can be, I think Zapier connects with over 7,000 apps now. So, you know, even if you are using some obscure app for something or another, Zapier might have an integration for it.\r\n\r\n\r\nNikolas Hulewsky (30:58.309)\r\nWell, I know this feels super dumbed down for you, but I think most people just don't understand how this process works. So I appreciate you dumbing it down for me, really. That's the bottom line.\r\n\r\n\r\nOlivia (31:10.414)\r\nI appreciate you asking all of these questions and kind of working with me as we built this live. That was fun.\r\n\r\n\r\nNikolas Hulewsky (31:16.421)\r\nYeah. Don't worry. We'll edit it and this will be like a two minute conversation and it will look amazing. Can you show me that sheet that like shows all the different use function or like the different options you can have within Zapier?\r\n\r\n\r\nOlivia (31:21.582)\r\nPerfect.\r\n\r\n\r\nOlivia (31:31.278)\r\nYes, I have it.\r\n\r\n\r\nNikolas Hulewsky (31:35.237)\r\nI think that would be really eyeopening for people who own businesses that are like, wait, I can do that with HubSpot or I can do that with jobber or whatever their system is that they use.\r\n\r\n\r\nOlivia (31:42.09)\r\nMm-hmm. Mm-hmm. So I will say right now this is the top 100 apps on Zapier, so the top 100 most popular apps plus individual ones from just ones that people have requested. So, and if I could give you some background on this.\r\n\r\n\r\nNikolas Hulewsky (32:01.679)\r\nRight. Okay.\r\n\r\n\r\nOlivia (32:05.574)\r\nThis was actually born out of my least favorite process in my entire business. And that was we would meet new people and they would be thinking about using Zapier or maybe they were already using Zapier and they just didn't understand the full potential of it. And I'm sitting here like, just tell me what apps you use and I'll go, I'll go figure it out. And if you, for example, Google Zapier HubSpot, you will pop up.\r\n\r\n\r\nNikolas Hulewsky (32:19.355)\r\nMm-hmm.\r\n\r\n\r\nOlivia (32:32.782)\r\nclearly visited this page before. Every Zapier integration has its own page. And it will display the triggers and actions here.\r\n\r\n\r\nNikolas Hulewsky (32:37.467)\r\nMm.\r\n\r\n\r\nOlivia (32:43.084)\r\nOkay, so I want you to imagine like trying to get this into a format with like, you know, 10 different apps that a prospect can read and make sense of. And it's kind of senseless. We were spending, I mean, 30 minutes to an hour copy paste. Like it's not easy to copy and paste in here. It was my least favorite process like of all time. So, yeah, yeah, that was our inbound.\r\n\r\n\r\nNikolas Hulewsky (32:50.032)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (32:59.152)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (33:05.435)\r\nAnd this was a sales process, essentially, right? Like you're trying to a prospect, right?\r\n\r\n\r\nOlivia (33:10.286)\r\nAnd these reports would take half hour to an hour each and of course, I hate them So I'm procrastinating on them. So our turnaround time sucks so anyway, I built let me filter through all my tabs, so I initially built this giant sheet Yes, and it just holds basically\r\n\r\n\r\nNikolas Hulewsky (33:31.355)\r\nThis is an air table.\r\n\r\n\r\nOlivia (33:37.654)\r\nall the automations, all the apps, a description trigger. And I had done this for Zapier and Make at one point. So we have them separated out a little.\r\n\r\n\r\nNikolas Hulewsky (33:48.539)\r\nAnd were you doing these one at a time? You're like, OK, well, I did it for this prospect. I'll add it to the list.\r\n\r\n\r\nOlivia (33:55.31)\r\nI found a tool called Browse AI that I use for web scraping. I don't use any AI functionality that I can tell, but it's called Browse AI. Yes, and it scrapes. So what we have, well shoot, let me just show you the whole thing. So what I have is,\r\n\r\n\r\nNikolas Hulewsky (34:06.491)\r\nOkay. Browse AI, all right?\r\n\r\n\r\nNikolas Hulewsky (34:17.721)\r\nYeah.\r\n\r\n\r\nOlivia (34:28.62)\r\ntwo automations that kind of keep this alive. The first one is on a schedule and once a month it grabs all of the integration URLs. So that is in our apps section here. These are just all of the URLs and all of the apps.\r\n\r\n\r\nNikolas Hulewsky (34:49.051)\r\nOkay, so Zapier has its own landing page for each app that it's integrated with. So essentially you just have all of those landing pages in a massive list. Okay.\r\n\r\n\r\nOlivia (34:57.678)\r\nYes, I'm really giving away the secrets here. All of those are in a massive list. It's okay. So anyway, they're in a big list. So once a month in make, I have this set up to grab all of those records. It's like 150. So I paste it and have it run a scrape task with this bot that I created. So browse AI basically just let me say,\r\n\r\n\r\nNikolas Hulewsky (35:00.731)\r\nand then you're great.\r\n\r\n\r\nOlivia (35:26.574)\r\nHere's a URL, pull this data. It specifically let me pull lists, because on HubSpot there were like 10, 15 items. So it specifically had scraping functionality for lists. And anyway, now that that scraper is set up on Browse AI, I just have to feed it the origin URL, which is the URL of the integration.\r\n\r\n\r\nNikolas Hulewsky (35:51.579)\r\nHow did you set up the browse AI? Is it natural language? Are you like, I'm trying to do X, Y, and Z or did it take any coding? Was it easy to set up?\r\n\r\n\r\nOlivia (35:59.406)\r\nBrowse.ai did not take any coding. Browse.ai actually has a new visual. I think they call it Robot Studio. But you enter a URL, and it actually highlights and lets you click and choose what you want to scrape, and then name those variables. And then it pulls them all out. So then I can show you what the... I should be able to show you what it looks like when it pulls the data out. I mean, obviously, it looks like what's in here, but...\r\n\r\n\r\nNikolas Hulewsky (36:29.957)\r\nNo, that's fine. I conceptually get where it's going and how you're utilizing it.\r\n\r\n\r\nOlivia (36:32.046)\r\nYeah Cool, okay. So once a month it grabs everything and runs them just to refresh it so I have like I know this is updated monthly and then\r\n\r\n\r\nNikolas Hulewsky (36:47.378)\r\nwow, I feel overwhelmed just looking at this automation.\r\n\r\n\r\nOlivia (36:50.094)\r\nDon't just walk with me once at a time. Don't, don't, nope. All right, so BrowseAI is just watching for a task to be finished. So I set this up to just watch when the Zapier bot completes a job. So that's all this trigger is. It's an instant trigger. So every time my BrowseAI bot finishes a scrape job, it, let's make no right here.\r\n\r\n\r\nAnd then I do a little bit of filtering because we do manual ones for one offs when we add a new one that's typically a one off. And then it goes into the system. Do a little formatting, nothing crazy. Literally, I think I just don't look at that. It just is formatting the name. It just makes the name look nice. think this same thing just makes the URL look nice. Pulls any extra parameters off the end of the URL so they're not ugly in the sheet. All that does.\r\n\r\n\r\nAnd these just flow in order. So the first thing it does is finds an existing app in the Airtable here. So it looks for the URL right here. It then updates the name if needed because sometimes they will update like Microsoft 365 wants to be Microsoft, whatever, no, I let them do it. So anyway, this then next step.\r\n\r\n\r\nNikolas Hulewsky (37:58.896)\r\nMm-hmm.\r\n\r\n\r\nOlivia (38:13.282)\r\nfinds the existing automations with that, like associated with that app, so associated with HubSpot, and deletes them all so that we can get a fresh.\r\n\r\n\r\nNikolas Hulewsky (38:23.739)\r\nand it pastes in whatever the current listings are.\r\n\r\n\r\nOlivia (38:27.79)\r\nYes, this one right here actually does use AI because the data that gets scraped off of Zapier is ugly. So it basically looks like all of this text, like here, all of this text, like all. Yes. And so I say, Hey, chat, GBT, this is a description of a Zapier automation, determine if it's a trigger action or search function. I said, here's the description of.\r\n\r\n\r\nNikolas Hulewsky (38:43.835)\r\njust like run on. Yeah.\r\n\r\n\r\nOlivia (38:56.652)\r\nthe automation, tell me if it's a trigger, an action, or a search. And then I give it, of course, those variables options. And it classifies it. So that's what I use ChatGBT for there. And then I create. I don't do anything at all, actually. And then make creates all of these records with the classification from ChatGBT. So that is.\r\n\r\n\r\nhow this whole thing works. And this is just an air table view where you can like filter and you know, group things, look at whatever you want. I said a lot of financial services firms, so we're looking at QuickBooks and Microsoft, but there's Fathom right there. Fathom has only triggers and no actions. Yeah.\r\n\r\n\r\nNikolas Hulewsky (39:26.683)\r\nThat's awesome.\r\n\r\n\r\nNikolas Hulewsky (39:39.983)\r\nYeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (39:46.235)\r\nSo this was amazing. What advice would you give to overwhelmed entrepreneurs who are like trying to figure out this stuff? Where would they start?\r\n\r\n\r\nOlivia (39:57.986)\r\nHmm start small start with something easy Send yourself a notification email We have these like off transactions for example that come through stripe And to make sure that we account for those because they don't follow our standard process I just have a trigger on that type of payment and then send me an email That it happened little things\r\n\r\n\r\nNikolas Hulewsky (40:06.747)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (40:23.983)\r\nYeah, so some simple flow, just like do one to try to understand how the flow works. That's a good, that's great advice.\r\n\r\n\r\nOlivia (40:28.574)\r\nYeah, and from there it's really easy to understand how you can build with the individual building blocks, but you gotta start somewhere.\r\n\r\n\r\nNikolas Hulewsky (40:35.995)\r\nYeah, I love it. It's great advice. And the automation agency, right? The automated agency, okay. I will remember that. This was fantastic, thank you.\r\n\r\n\r\nOlivia (40:40.588)\r\nThe automated agency. The automated agency, yes.\r\n\r\n\r\nI appreciate",
  "metadata": {
    "duration": "",
    "date": "2025-04-29",
    "platform_source": "Google Drive"
  }
}