{
  "episode_number": "220",
  "episode_title": "How Claude Code Just Replaced All My Coding Tools with Elizabeth Knopf",
  "guest_name": "Elizabeth Knopf",
  "business_name": "",
  "transcript": "﻿Nikolas Hulewsky (00:00.174)\r\nI might have to restart, hold up. Nope, mic's good, camera's good. All right, okay, Liz, Liz, I don't know, it's been a couple of weeks since we've spoken, because the summer's crazy. So much has freaking happened. And what I wanna talk about today, which we're gonna get to, is Cloud Code. I think it's the only thing that has universally been talked about in a positive light. You told me just before we hopped on here, that it's gonna blow my mind.\r\n\r\n\r\nElizabeth Knopf (00:01.818)\r\nAll good.\r\n\r\n\r\nElizabeth Knopf (00:06.258)\r\nCheck,\r\n\r\n\r\nElizabeth Knopf (00:13.617)\r\nYes.\r\n\r\n\r\nElizabeth Knopf (00:22.854)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (00:25.772)\r\nand that you're kind of doing away with all of your other tools that you've been working with because Cloud Code is that freaking good. So you're gonna walk me through exactly how to open it up, install it, put it on my computer, and then like actually how to use it. But let's set the table a little bit for people before we get to Cloud Code. Right now, the model war has not only heated up, it feels like it's kind of cooled down, no?\r\n\r\n\r\nElizabeth Knopf (00:37.564)\r\nYes.\r\n\r\n\r\nElizabeth Knopf (00:51.048)\r\nYeah, yeah, a little bit. I mean, I don't know if it's the summer doldrums and, you know, people on vacation just sort of chilling, but I've just felt like people who are both doomsday folks as well as like hype, you know, EACC, whatever, you know, folks that are just like, it's going to be utopia, we're all automated. Both sides have just sort of simmered. And that's probably because of a couple of releases and also people sort of\r\n\r\n\r\nNikolas Hulewsky (01:15.735)\r\nYeah.\r\n\r\n\r\nElizabeth Knopf (01:20.392)\r\nactually seeing the adoption or even the lack thereof of adoption within organizations. So at least that's the vibe on Twitter. mean, real world, it's a different story.\r\n\r\n\r\nNikolas Hulewsky (01:28.876)\r\nYeah, I mean, okay. So the thing that was crazy to me, what we've seen over the last few months, we've seen Gemini 2.5 come out. We've seen just in the last week, Claude Opus 4.1, we've seen Grok 4 come out and now we've seen Chat GPT-5. And what has been interesting about each one of those model releases is I think everybody was holding their breath for Chat GPT-5. Sam Alton was on the press tour and he's like, GPT-5 is the first time that I actually felt like.\r\n\r\n\r\nElizabeth Knopf (01:51.186)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:58.845)\r\nWow. You know what I mean? He's like breathlessly describing GPT-5. And then it comes out and we start looking at this. So this is my chat GPT. I asked it to compare all of these new models. And the interesting thing is if you look up here on the top, we've got all of these tests that they've used to sort of score these models. This over here, this is humanities last exam. It's a crazy, crazy hard test. And you can see here GPT-5 scored 25 and 26.\r\n\r\n\r\nI don't know what the text or tools only difference is, but let's just combine those two for right now. So it's a hard test, scores a 25 out of 100. Grok 4 scores a 50. So, okay, that's weird. Grok 4 is a better model. And then I start going and playing with GPT-5. And at first I'm excited because they're like, the persistent memory has been improved. cool. Now I can remember.\r\n\r\n\r\nall of my chats across all of my projects, which it didn't used to be able to do. So that was a really cool improvement. Then they were like, and we've improved the way that we actually process your prompts, the way that we batch them. Now there's no, there's an equal weight given to your questions as opposed to being more focused on the end of your prompt, as opposed to the beginning of your prompt. The processing is supposed to be faster as well because of this new batching, I guess, technique that they've implemented.\r\n\r\n\r\nAnd they've taken away all of the 03, 03 mini, 03 mini high, know, Chachi before or whatever. And it's just kind of like three models, but I've, but I've played around with it. It's okay. It's like, it's like a little bit better, but it, it just kind of feels this time, like an iteration and not a step function change. And I think that's what you're talking about. Like the vibe has kind of shifted from you're wowed every six months with a new model to, okay, now it's just iterative.\r\n\r\n\r\nElizabeth Knopf (03:54.29)\r\nYep. And I think what's going on, so there's a couple, a number of things you just highlighted. So first off, it does feel like lot of the models and their features are just converging. They're in terms of being, having parity. So, you know, one will have this feature around video generation, the next will pop out with it. And that's sort of what it seems like is happening overall. But I do think with ChatGPT 5, like we were expecting, yes, to have it\r\n\r\n\r\nblow our minds, but one of the things that think people are at least under appreciating is sort of who the audience is and then what they did with the product. So less so about like the technology behind it, but actually the product. So I think one big challenge was that, you you had to select the model. Like most people using ChatGPT don't know what three means, 3.5.\r\n\r\n\r\nNikolas Hulewsky (04:37.88)\r\npercent.\r\n\r\n\r\nElizabeth Knopf (04:49.928)\r\nfour or five, like they don't know the difference. Then they started giving more options and there's the concept of the paradox of choice. When you have too many options, you're overloaded and you don't know what to use for what. I personally like that because you could get different outputs and you'd get some interesting nuances when you played around with those different combinations. However, for the average person, like they've simplified it and actually sort of reminds me of like Google's first.\r\n\r\n\r\nsearch bar, you know, they had just one box and now that's what chat GPT is. It's like one box, no choices, like here you go, put in your prompt. And so I think from a knowing that chat GPT has more of the average consumer across their large distribution, that's really what they came out with. And that was just, guess, somewhat of a, if you want to call it innovation now. Yeah.\r\n\r\n\r\nNikolas Hulewsky (05:42.168)\r\nYeah, I agree. I agree. They're removing friction, basically is like they're making it easier. And it's kind of the first, not the first, they've made it multi modal. And what I mean by that is typically people talk about multi modal as text, picture, video, sound, AI can do all of those things and then spit something out. That's not what I mean. I mean, in this, in this context, it can kind of toggle between the chain of thought.\r\n\r\n\r\nElizabeth Knopf (05:45.852)\r\nYeah, there you go.\r\n\r\n\r\nElizabeth Knopf (05:54.962)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (06:11.438)\r\nthat you would get with the 03 and the LLM based model that you're getting with 4.0 and the image generation. it's like making its own judgment based on its own discretion of which model to use based on the question that you're asking. So that part is cool. I think the other thing that's cool is it does a much better job at multi-step tasks. So for example, if I'm like, go do research on this market.\r\n\r\n\r\nElizabeth Knopf (06:33.767)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (06:39.0)\r\nthen take the research and run it through this criteria, then take the output from there and rank all of them from best to worst. It used to not be able to do that. It would just, that would be too much for it. It's gotten better at sort of this multi-step execution. So those things are cool, but to your point, they just made it easier to use, right? Like the iPhone has always just been the iPhone. It's just simple. Everyone knows what they're getting out of an iPhone. And I think they took a product step. I don't know if, do you think that's a Johnny Ive thing?\r\n\r\n\r\nElizabeth Knopf (06:39.048)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (07:07.47)\r\nLike, is this a Johnny Ive fingerprint or do you think this is in the works?\r\n\r\n\r\nElizabeth Knopf (07:12.328)\r\nI mean, it probably was in the works because people gave this feedback. mean, this was all over the internet from users who could sort of see this. And I think there's that piece of it. And then there's probably the cost element too, because if you run a simple prompt or deep research, that eats up a lot of costs. And while there was a lot of rate limiting everything, they're probably doing it from a cost optimization standpoint, since they're probably burning a ton of cash on the end\r\n\r\n\r\nNikolas Hulewsky (07:33.773)\r\nYeah.\r\n\r\n\r\nElizabeth Knopf (07:42.52)\r\nGPUs. So I bet that was also a factor in how they came to doing this. So it was probably some users, some of that, maybe Johnny Ive. I don't know. I don't know.\r\n\r\n\r\nNikolas Hulewsky (07:52.238)\r\nOkay. All right. Before we get it. So we talked about this. Claude code is the only thing that has come out recently where universally people are like, this is mind blowing. This is incredible. We have to do Claude code. So we're gonna get to that in a second before we do. Now after all these models have been released, how would you rank these models best to worst? And let's just use the four horsemen, Grok four, Gemini, ChatTPT, Claude. How would you rank them?\r\n\r\n\r\nElizabeth Knopf (08:20.828)\r\nOkay, so I will qualify this. It depends on the use case, but I will do a net net in terms of actually how I'm using or which ones I most frequently use. So I'll use that as my metric. So Anthropic, Claude, is my number one still. Then I would say Grok for sure. And Grok I really like for like real time information and creative.\r\n\r\n\r\nNikolas Hulewsky (08:46.638)\r\nMm-hmm.\r\n\r\n\r\nElizabeth Knopf (08:48.272)\r\nAnd then I just started using it with coding. But again, and getting back to the friction point that we'll get into with Cloud Code, there's still just so much friction with all the other ones to build things. And so when I'm just using it from conversation and research, that's, yeah. And then third, Gemini. And then I'll say, ChatGBT is my lower. Yeah, and then, yeah.\r\n\r\n\r\nNikolas Hulewsky (09:08.3)\r\nWow. Okay, so here's, here's my ranking. Number one, Grok. I don't use Grok the most. I do think it's probably the best just general purpose model at this point. Pretty crazy that they become a frontier model in like two iterations. Nuts. Two, Claude. Dude, like the 4.1 update is, it's really good. And Claude has done a really good job, I think.\r\n\r\n\r\nElizabeth Knopf (09:16.242)\r\nOkay.\r\n\r\n\r\nElizabeth Knopf (09:32.584)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (09:35.158)\r\nmaking it easy for the user. Their projects are incredible. The artifacts now, the way that you can store artifacts is I'm using it all the time. Like you were the first one to show me, I use it all the time now. It's incredible. I think third is ChatGPT and then fourth is Gemini. The reason I put ChatGPT third is just because I think it's the Honda Accord of the models. You know I mean? It's like, it's good.\r\n\r\n\r\nIt's gonna last. It's gonna get you to where you need to go. You're not driving an Audi, but you're also, you know, you're not getting a Hyundai accent. You're, you got a nice car. It does what it's supposed to. It's a good thought partner. And frankly, I still use it the most just because it has so much information on me that it can like quickly give me good answers. And I'm trying to migrate to Claude and Grok, but it's gonna take some time. So that's my ranking for right now.\r\n\r\n\r\nElizabeth Knopf (10:18.226)\r\nTotally.\r\n\r\n\r\nElizabeth Knopf (10:26.812)\r\nWell, and I think you bring up a really good point is there is a stickiness to all these products. Like we're probably power users versus again, the average person using them. Like most people, I know I've heard people say, I set things up in ChatGPT so I'm just sticking with it. Or that's the one I want to learn because there's a perception that it's hard to get into the other ones or set up all your contacts. And so like, I do think that's huge value that ChatGPT has. And so like, even if they sort of stayed at this,\r\n\r\n\r\nNikolas Hulewsky (10:43.224)\r\nMm-hmm.\r\n\r\n\r\nElizabeth Knopf (10:56.496)\r\nlevel for a while, they're not going to have much churn or attrition or see behavioral changes from people switching. Like power users, yes, maybe. But I think you're starting to see these guys sort of focus on a specific type of user, or at least like consider the majority of their base and cater their iterations and development towards that.\r\n\r\n\r\nNikolas Hulewsky (11:17.954)\r\nYeah, it's very easy to get lost in the moment and think like, oh, Chachi Petit's falling behind. Oh, OpenAI. Oh, Sam Altman. Yes, all that stuff is probably true if you're forward looking. But what they've done in the last two years, three years, however long it's been since they launched 3.0, I think it was 3.0 that was the first one or 3.5. Anyways, it's undeniable. Even if they don't grow at the same rate, even if they lose market prominence, they've got a multi hundred billion dollar company.\r\n\r\n\r\nIt's a legit company. They've got a good product now. They've got a good team. They've probably lost a lot of people to the brain drain because freaking Mark Zuckerberg is paying a billion dollars to people. It's like sports contracts. It's nuts. But they're they're entrenched. They're they're they're a market leader in this space. And to your point, I think we underestimate how sticky these products are and will be moving forward. So, OK, you're going to show me Claude Code. What do need to do? Do you me to share my screen first or do you want to share your screen?\r\n\r\n\r\nElizabeth Knopf (12:12.124)\r\nOkay, share your screen so that we can go through like step by step. So you did mention how you've gotten it set up. Yes or no, or should we go from?\r\n\r\n\r\nNikolas Hulewsky (12:15.981)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (12:24.014)\r\nYeah, well, let's do that because we were texting yesterday and you were like, two days ago and you're like, just go put it on your computer. Oh no, we were on the phone. That's right. Just go put it on your computer. And I was like, oh, okay. So I go and I'm like, what do I need to do? And now I can't even remember where I went. Oh yeah, here we go. Claude code. So I click on Claude code over here and I get this like settings. Wait, what am I supposed to, it doesn't just come up. So it's actually not in Claude. You have to open.\r\n\r\n\r\nthe terminal on your computer. So I'm going to do this step by step thing so that people can actually follow along and take advantage of this really, really cool iteration that Claude has released to us. So if you're in Claude, you come over here on the left-hand side, click on Claude code. Now, in order to Claude code, you have to have the max or the pro plan. And I think it's, is it a hundred dollars a month?\r\n\r\n\r\nElizabeth Knopf (13:16.788)\r\nI know one of them I want to say is like yeah, one of them is $100 a month\r\n\r\n\r\nNikolas Hulewsky (13:20.396)\r\nIt's not cheap, it's not cheap, but I think after you see what we're about to do, you'll be convinced. So you click here, we're gonna click on install instructions and this window pops up. Okay. And this is where I got like overwhelmed. Cause I'm like, I don't know what the, I don't know what I'm supposed to do. I'm not a coder. What's this green screen? Am I trying to hack into the Pentagon? What am I supposed to do from here?\r\n\r\n\r\nElizabeth Knopf (13:44.936)\r\nOkay, so actually just back up one sec so people aren't turned off by the $100. Pro is only $17 a month, so it's accessible. Max is $100 a month, but you will get, probably wanna graduate to the Max plan once you've utilized the Pro. okay, so Pro is $17, so it's accessible. Okay, so now you're here at this little black box, scary looking text. So what you're wanna do is in that upper right hand corner, you see that little copy.\r\n\r\n\r\nNikolas Hulewsky (13:51.904)\r\nsorry, sorry.\r\n\r\n\r\nNikolas Hulewsky (14:01.56)\r\nOkay, good call.\r\n\r\n\r\nElizabeth Knopf (14:14.6)\r\nicon, oops sorry, in the black box, not copy page, within the box. Yep, copy that. All right, so what you're going to do is go to\r\n\r\n\r\nNikolas Hulewsky (14:16.655)\r\nYes.\r\n\r\n\r\nyep.\r\n\r\n\r\nOkay?\r\n\r\n\r\nNikolas Hulewsky (14:28.366)\r\nSo you could also come, is it come here? I think I opened this link and you're gonna, you'll walk me through it, I know. But this was the link that I just clicked on and this kind of walks you through, it's like, all right, step one, install Claude code and this node.js 18, what is that?\r\n\r\n\r\nElizabeth Knopf (14:45.288)\r\nThat's just a language. So there's all these things, libraries and languages, which is basically like just thinking of it as like sets of code that your computer can access and use. They're not all set up on your computer when you open up or about to open up. So you do have to like prompt, like not prompt, but copy and paste these lines. Like you don't even need to type them, just copy and paste these lines and it'll include those. So now what we're going to do is go to your computer.\r\n\r\n\r\nNikolas Hulewsky (14:47.384)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (15:09.87)\r\nOkay, now people are gonna freak out because they're gonna see how many docs I have on my homepage. okay, so we're here, so I'm gonna go now.\r\n\r\n\r\nElizabeth Knopf (15:13.702)\r\nSo that's it. Good applications.\r\n\r\n\r\nNikolas Hulewsky (15:21.632)\r\nto my launch pad. What are you looking at right now? Can you see my screen or no?\r\n\r\n\r\nElizabeth Knopf (15:25.544)\r\nyour calendar and your WhatsApp.\r\n\r\n\r\nNikolas Hulewsky (15:29.548)\r\nRude. Okay. Well, I don't know how to do it. since you're just looking at my calendar, I'll get back here. Cause I have two monitors up. I'm very special. I'm very important. Okay. So I go to, I'm a Mac user. I go to launch pad and I search for terminal. Okay. So I've found terminal. I've now opened terminal and I'm going to bring terminal.\r\n\r\n\r\nElizabeth Knopf (15:31.336)\r\nyou\r\n\r\n\r\nElizabeth Knopf (15:43.207)\r\nof this.\r\n\r\n\r\nElizabeth Knopf (15:52.008)\r\nTerminal, yes.\r\n\r\n\r\nNikolas Hulewsky (15:59.48)\r\nto this screen so that we can look at it together. All right, so you're looking at my terminal now. All right.\r\n\r\n\r\nElizabeth Knopf (15:59.496)\r\nThere it\r\n\r\n\r\nElizabeth Knopf (16:07.004)\r\nYes. So you're going to want to copy what was from the other screen and you already copied it. Okay.\r\n\r\n\r\nNikolas Hulewsky (16:14.818)\r\nYep. And so you can see up here, I already did it.\r\n\r\n\r\nElizabeth Knopf (16:18.14)\r\nYep, so let's just walk them through.\r\n\r\n\r\nNikolas Hulewsky (16:20.184)\r\nSo, but I'll do it again. So I copied it and now I'm pasting it and I'm just going to hit enter. That says command not found.\r\n\r\n\r\nElizabeth Knopf (16:29.958)\r\nIt's just going to error because you already have it installed.\r\n\r\n\r\nNikolas Hulewsky (16:32.201)\r\nOK. OK. And now step two. geez, to me. Come on, Nick. Let's let's get let's up the production value here a little bit. Step two now is I got to do this thing.\r\n\r\n\r\nElizabeth Knopf (16:48.818)\r\nAll you have to do is copy and paste that, and then in the future, all you need to type in will be clawed.\r\n\r\n\r\nNikolas Hulewsky (16:54.254)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (16:57.71)\r\nOkay, so I copied it, enter.\r\n\r\n\r\nNikolas Hulewsky (17:02.542)\r\nAnd I wonder if I already, I already did it apparently.\r\n\r\n\r\nElizabeth Knopf (17:06.438)\r\nOkay, so now type Claude.\r\n\r\n\r\nNikolas Hulewsky (17:09.358)\r\nOkay, okay, just enter.\r\n\r\n\r\nElizabeth Knopf (17:11.622)\r\nand enter. Yep. Okay, so we missed a step. Okay.\r\n\r\n\r\nNikolas Hulewsky (17:15.803)\r\nso I didn't do it. Let's go back here.\r\n\r\n\r\nNikolas Hulewsky (17:21.41)\r\nSo let me try this again. So CD.\r\n\r\n\r\nElizabeth Knopf (17:23.404)\r\nneed to find out where you just installed Claude and you have to set up a folder. So this is within.\r\n\r\n\r\nNikolas Hulewsky (17:36.29)\r\nSo is this it? Is this the path right here? local library.\r\n\r\n\r\nElizabeth Knopf (17:43.386)\r\nNo, that's an error. should be like specifically like your what it should look like is user slash your name is usually what it is. So if you named your computer like Nick, it should be like slash user slash Nick.\r\n\r\n\r\nNikolas Hulewsky (17:58.446)\r\nIt's not this right here, user local library module.\r\n\r\n\r\nElizabeth Knopf (18:01.286)\r\nOkay, maybe it is, maybe it is on your computer. Let's see.\r\n\r\n\r\nNikolas Hulewsky (18:04.055)\r\nHow, okay, so how would I go find that?\r\n\r\n\r\nElizabeth Knopf (18:06.44)\r\nlet's look up.\r\n\r\n\r\nNikolas Hulewsky (18:13.176)\r\nSee, this is why needed you.\r\n\r\n\r\nElizabeth Knopf (18:15.432)\r\nAll right. And you know what I'm doing? I'm asking Claude. So it made me you needed Claude. Yeah. So this is always like the hard part because I forgot how I did this. okay. Okay. Okay. So you use this command, which Claude. So go back to terminal, go spell which W ICH.\r\n\r\n\r\nNikolas Hulewsky (18:32.878)\r\nthere here.\r\n\r\n\r\nNikolas Hulewsky (18:41.165)\r\nOkay.\r\n\r\n\r\nUh-huh. Space.\r\n\r\n\r\nElizabeth Knopf (18:45.086)\r\nSpace and then Claudia. Yep, and then\r\n\r\n\r\nElizabeth Knopf (18:50.952)\r\nOkay, so maybe haven't installed yet. Okay, so let's try.\r\n\r\n\r\nElizabeth Knopf (19:03.88)\r\nOkay, so let's go back up. you, okay, so you definitely did the NPM install, correct?\r\n\r\n\r\nNikolas Hulewsky (19:09.774)\r\nWell, let's try it again. Because now that I'm looking at it, this is when I did it yesterday.\r\n\r\n\r\nElizabeth Knopf (19:15.352)\r\nSo that's why you haven't done it successfully. Okay, so let's try it again.\r\n\r\n\r\nNikolas Hulewsky (19:18.432)\r\nYeah, so.\r\n\r\n\r\nStill an error.\r\n\r\n\r\nNikolas Hulewsky (19:26.006)\r\nOkay, this is going great.\r\n\r\n\r\nElizabeth Knopf (19:30.128)\r\nOkay, because you might not have Node.js installed yet. So let's say go back up. Is there anything above that to install? That might be why.\r\n\r\n\r\nNikolas Hulewsky (19:30.318)\r\nthrough\r\n\r\n\r\nNikolas Hulewsky (19:39.566)\r\nhold on.\r\n\r\n\r\nprerequisites node, JS 18 or newer.\r\n\r\n\r\nElizabeth Knopf (19:49.394)\r\nSo you clicked on that to go to that for the setup. So you might need, yes.\r\n\r\n\r\nNikolas Hulewsky (19:53.08)\r\nso I need to do this.\r\n\r\n\r\nNikolas Hulewsky (19:59.502)\r\nlook at me. I'm like hacking into the Pentagon now. Yes. I is smart. Okay.\r\n\r\n\r\nElizabeth Knopf (20:00.488)\r\nThere\r\n\r\n\r\nyou\r\n\r\n\r\nNikolas Hulewsky (20:12.159)\r\nThank you, Liz. Okay, you're the best. All right now.\r\n\r\n\r\nElizabeth Knopf (20:15.408)\r\nYou know, get it.\r\n\r\n\r\nNikolas Hulewsky (20:18.53)\r\nOkay, so for folks at home, make sure you have Node.js 18 or newer. Now we can get into this, which is installing Anthropic. So I'll come here, copy paste, fingers crossed, wait for it. No, I didn't get an error, so that's good. It's thinking. Yes, cool. Okay.\r\n\r\n\r\nElizabeth Knopf (20:39.366)\r\nI think it's thinking. Alright, so now now actually just see if you just type in Claude. What happens? Ready?\r\n\r\n\r\nElizabeth Knopf (20:52.903)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (20:53.55)\r\nOkay, so allow, allow. So is this it?\r\n\r\n\r\nElizabeth Knopf (20:57.82)\r\nOkay, this is it. This is it. You've arrived. It's like really like you're back in the 90s here. And yeah, but don't get intimidated anyone watching. This is criminal. Yeah.\r\n\r\n\r\nNikolas Hulewsky (21:07.458)\r\nNikolas Hulewsky (21:11.224)\r\nLike legitimately, I feel overwhelmed. I really do. Please help me, Liz.\r\n\r\n\r\nElizabeth Knopf (21:15.784)\r\nIt's there are better user interfaces that we'll get to maybe in a future video, but we'll keep it simple. So pick your do you like dark mode, light mode, pick your\r\n\r\n\r\nNikolas Hulewsky (21:21.23)\r\nOkay. Okay.\r\n\r\n\r\ndo I just click on it or what do I do?\r\n\r\n\r\nElizabeth Knopf (21:26.984)\r\nPut in the number. This is maybe you just type just start typing and it'll put in. Okay. Yep.\r\n\r\n\r\nNikolas Hulewsky (21:29.656)\r\nWhere do I put it in?\r\n\r\n\r\nNikolas Hulewsky (21:34.634)\r\nOne, two, what the freak, what's happening?\r\n\r\n\r\nElizabeth Knopf (21:40.41)\r\nNow it connected to it needs to log in to your actual Anthropic account. That's what's happening. So I opened up the browser on your behalf and now you got to log in to whichever account is associated with your cloud account.\r\n\r\n\r\nNikolas Hulewsky (21:46.808)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (21:54.754)\r\nI think this is my cloud account. We'll have to block this out just in case.\r\n\r\n\r\nElizabeth Knopf (21:56.712)\r\nOkay. Yeah.\r\n\r\n\r\nNikolas Hulewsky (22:01.698)\r\nHold please.\r\n\r\n\r\nNikolas Hulewsky (22:08.718)\r\nWhy can I not see?\r\n\r\n\r\nNikolas Hulewsky (22:16.622)\r\nDidn't it tell me who my... Oh, I see it, sorry. Okay, all right, I see it now.\r\n\r\n\r\nElizabeth Knopf (22:17.992)\r\nBye.\r\n\r\n\r\nNikolas Hulewsky (22:36.728)\r\nMohammed, make sure people can't see that. Individual.\r\n\r\n\r\nNikolas Hulewsky (22:44.118)\r\nOkay. I just click on it. Okay. Authorize.\r\n\r\n\r\nElizabeth Knopf (22:47.218)\r\nYep, click.\r\n\r\n\r\nNikolas Hulewsky (22:54.536)\r\ncredits to start. sounds good.\r\n\r\n\r\nAll right. Okay.\r\n\r\n\r\nNikolas Hulewsky (23:07.47)\r\nAny of my first porn's information.\r\n\r\n\r\nNikolas Hulewsky (23:15.092)\r\nWe'll be able to edit a lot of this, so.\r\n\r\n\r\nElizabeth Knopf (23:17.264)\r\nYeah, I figured. I'm not worried.\r\n\r\n\r\nNikolas Hulewsky (23:21.772)\r\nI'm probably more worried than you because I'm putting my address and my credit card information on here. Okay. All right. So we did all that. Close window and I go back to.\r\n\r\n\r\nNikolas Hulewsky (23:34.52)\r\nhere, enter to continue.\r\n\r\n\r\nElizabeth Knopf (23:34.536)\r\nOkay, yep. Yep.\r\n\r\n\r\nNikolas Hulewsky (23:39.138)\r\nSecurity notes, okay, whatever.\r\n\r\n\r\nElizabeth Knopf (23:40.794)\r\nYep, just letting you Press Enter to continue.\r\n\r\n\r\nNikolas Hulewsky (23:44.206)\r\nSo I've never worked in a module, is that what this is called? Console, wait, what's, yeah, I've never worked in a console before, so I just type, I don't like.\r\n\r\n\r\nElizabeth Knopf (23:48.316)\r\nIt's called, console, yeah.\r\n\r\n\r\nElizabeth Knopf (23:54.374)\r\nYeah, so there are some things that get annoying, like copy and paste. To go back, you have to delete, and it's not the best interface, and you'll get annoyed at certain points. But for the most part, this is the best starting just to get a sense of it.\r\n\r\n\r\nNikolas Hulewsky (24:11.096)\r\nDo I just need to make sure I remember that it's in users, Nicholas Helusky. That's my file path.\r\n\r\n\r\nElizabeth Knopf (24:18.022)\r\nOkay, for your file path, you can create new ones from here as well. So once you get into Claude, you can actually tell it, create new folders. So think about where you want to have, you know, all your files that it'll be generally accessing stored. So if you want to have it like right now, I use documents as the main folder, and then I have Claude code is literally the name of the folder. And then from there I have objects that I'll name and then have those.\r\n\r\n\r\nNikolas Hulewsky (24:31.178)\r\nInteresting.\r\n\r\n\r\nNikolas Hulewsky (24:43.566)\r\nBut it's stored locally. I'm not storing this to the Google Drive or anything.\r\n\r\n\r\nElizabeth Knopf (24:47.08)\r\nRight now this is not connected. Well, I should say it's not connected to the internet because it is it's not like the files You're generating are not going to be like hosted on a website They're gonna like when you open up what you've done It'll be on a local site called local host colon and then I'll have a number Yeah\r\n\r\n\r\nNikolas Hulewsky (25:03.736)\r\nSo it's asking me how does blank file path work? So I just enter in a document.\r\n\r\n\r\nElizabeth Knopf (25:10.689)\r\nyeah. So just say like, say like, where would you want, say create a new folder?\r\n\r\n\r\nNikolas Hulewsky (25:26.156)\r\nIt of feels MCP-ish. Am I off?\r\n\r\n\r\nElizabeth Knopf (25:29.8)\r\nSort of, I guess so, a little bit. It actually does use MCP in some ways when you need it to, but I want people just to realize you are just speaking English to it once you're in Cod, so you're not having to know what...\r\n\r\n\r\nNikolas Hulewsky (25:45.592)\r\nguess what I meant by MCP is like, I can now have access to my local files on my desktop without having to go like copy paste import. Wow. Okay. Okay. So Claude code has been created successfully.\r\n\r\n\r\nElizabeth Knopf (25:51.558)\r\nYes. Crap. Yes. Yes.\r\n\r\n\r\nElizabeth Knopf (26:00.284)\r\nYes. Okay. So now we get to build a project. So I don't know if it would be helpful for, we could kick off one, or I can maybe give a preview of some end states of things I've recently built.\r\n\r\n\r\nNikolas Hulewsky (26:11.278)\r\nSo this is it, I'm in Cloud Code.\r\n\r\n\r\nElizabeth Knopf (26:13.736)\r\nYou're in cloud code. So now let me actually, before we get started with some of my stuff, the couple of things that are important to know when you're about to get started. Okay. Number one, you, if you don't know what to do, you can literally prompt here. What do I do? Claude, like just ask Claude, what do I do? The second thing that's super important is say like switch to planning mode. Planning mode helps you actually think through and break down what you're going to be doing in your project. So think of them as a project manager who's like,\r\n\r\n\r\nyou're the hyped up CEO that like is like, I want to do this cool thing. Then someone goes and figure it out. Like, how do you do that and implement it? So that's sort of what we'll do in planning mode. It'll help break things down into smaller chunks to figure out the best way to build what you want to build. So again, it is using both Sonnet and Opus models, which is another thing to highlight is you might want to switch back and forth.\r\n\r\n\r\nNikolas Hulewsky (26:51.822)\r\nMmm.\r\n\r\n\r\nElizabeth Knopf (27:11.526)\r\nbetween those and the only sort of like pseudo code you'll need to know is like slash model and select which one. But if you go to planning mode, it'll optimize and go to Opus and then you'll switch back to Sonnet because your tokens will get eaten quickly. And so this is just like a little thing to know. There's a bunch of other, as you can see, grayed out like other things you'll be able to learn. I don't want to overwhelm people.\r\n\r\n\r\nNikolas Hulewsky (27:22.158)\r\nNikolas Hulewsky (27:32.45)\r\nWhoa!\r\n\r\n\r\nNikolas Hulewsky (27:36.824)\r\nWhat's a dwerking directory?\r\n\r\n\r\nElizabeth Knopf (27:38.6)\r\nWorking directory that's basically like your file folder. That's a directory like there's a folder. So like when you're again like the. You know, in code language would be like CD and then you know, making a directory MKDIR like other little things you would say and or type in. Yeah, you can build an agent in here like you can build like anything in here like it's really that awesome so.\r\n\r\n\r\nNikolas Hulewsky (27:42.57)\r\nNikolas Hulewsky (27:56.972)\r\nI can build an agent?\r\n\r\n\r\nElizabeth Knopf (28:04.818)\r\nPeople who maybe were like, I tried N8n or I tried make.com and it just seemed too much, like, and you may be like lovable, maybe Replet were just a bit, a bit more accessible, but then you would get stuck. This is basically that level of easiness from the Replet and lovable type thing, but add the full scope of functionality that like an N8n and make would actually fulfill. So it is really the best of everything and it does it all in code and it makes it just easy.\r\n\r\n\r\nbecause you're speaking, you're typing or speaking to it in English or your native language and it is building the things. Now, again, there's a lot of like work, go ahead.\r\n\r\n\r\nNikolas Hulewsky (28:42.03)\r\nOkay.\r\n\r\n\r\nLet me ask this question. All so I just asked it a question. said, I would like to create an agent, but I don't know what type of agent that I want. Can you help me think through what agent I should start with? Cool. I hit enter and then I could see it thinking. And then I saw this tokens. It was like tokens being used. When I went in the beginning and I had to select the $5, so I'm now paying on top of what I already pay in a membership or a subscription to use this.\r\n\r\n\r\nElizabeth Knopf (28:57.992)\r\nMm-hmm.\r\n\r\n\r\nElizabeth Knopf (29:07.314)\r\nYes.\r\n\r\n\r\nElizabeth Knopf (29:14.752)\r\nso I'm using the max plan where I don't pay attention as much for this. So, I'm probably not, and I've run. Yeah. Yes. Yes. Yeah. So that's like a, something you could maybe build to start is like track my tokens and my usage just to make sure. because then as, if you're not on the, the bigger plan, you're going to want to start optimizing for token usage. Like that will, they'll get eaten quickly. There are some tips and tricks address that.\r\n\r\n\r\nNikolas Hulewsky (29:20.984)\r\nBut theoretically, yes. If they're tracking my tokens, okay.\r\n\r\n\r\nNikolas Hulewsky (29:42.477)\r\nYeah.\r\n\r\n\r\nElizabeth Knopf (29:44.242)\r\nSo you don't do that. Number one, you want to be using Sonnet instead of Opus. Opus for planning, Sonnet for building. And then number two, you're going to want to clear your chats because what's happening right now is it's taking in the full context, meaning your whole history of your chat every time. And then it'll start taking in all your files. So when you start clearing the chats and you start building a new feature,\r\n\r\n\r\nYou want to make sure you're sort of summarizing things so that there's enough context to be added in where it's not taking in everything from before because when you're putting in everything, you're going to be eating a ton of tokens.\r\n\r\n\r\nNikolas Hulewsky (30:17.603)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (30:21.88)\r\nSo, okay, let me, one thing and then I want you to show me your project. Do I close this or do I just always keep this open?\r\n\r\n\r\nElizabeth Knopf (30:29.99)\r\nOkay, so you want to keep this open. This is the other thing. Like I've started building my own little tool for like tracking things. because when you close this, it's gone, the chat's gone, but your files will remain. So your project and your files will remain there. So you can still access your project and you'll just have to tell quad to go access the folder and then, but if you don't have a ton of like history or context, there might be things that are missed.\r\n\r\n\r\nNikolas Hulewsky (30:50.467)\r\nYeah.\r\n\r\n\r\nElizabeth Knopf (30:56.86)\r\nThe second thing is like, if you're like, it made a change and you didn't like the change, like there's not an easy way to go backwards. So you're going to want to use GitHub. And this is where you're going to have to set up GitHub. And that's a little bit of, you know, a process. Maybe we could do that next week. I don't know for right now. It will probably take a little bit of time. but that is something that's super important to do.\r\n\r\n\r\nNikolas Hulewsky (31:11.8)\r\nSure.\r\n\r\n\r\nNikolas Hulewsky (31:16.302)\r\nSo should I be like, isn't it called a markdown as you're like writing code so you save different versions or no?\r\n\r\n\r\nElizabeth Knopf (31:21.64)\r\nOkay, so this is, that's a .md file is what you're talking about markdown. So you're gonna wanna create something called claw.md, which it now sort of does automatically, it'll create this file, which is essentially your rules file. That's like your master thing to say, okay, you can tell it, okay, every time I make a change, add it to my update GitHub. And I actually think it is doing that relatively automatically or very frequently on its own.\r\n\r\n\r\nNikolas Hulewsky (31:45.262)\r\nMmm.\r\n\r\n\r\nElizabeth Knopf (31:51.56)\r\nYou'll put in the rules there like things you want to remember\r\n\r\n\r\nNikolas Hulewsky (31:53.934)\r\nOkay. We'll look at GitHub later. I wanna now stop sharing my screen and I'm gonna let you do your thing.\r\n\r\n\r\nElizabeth Knopf (32:05.896)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (32:06.774)\r\nIf I did close it, how would I go reopen it?\r\n\r\n\r\nElizabeth Knopf (32:09.32)\r\nOkay. So you would again, go open terminal and literally blank screen Claude and it'll pop up. You'll see that little like, yeah, it'll show you and then say, what do you want to do with basically? And then you just pop in and then you'll just say, go to folder X, Y, and Z. Yeah. And you'll be back. Okay. All right. So let me share my screen.\r\n\r\n\r\nNikolas Hulewsky (32:12.334)\r\nOkay, Claude.\r\n\r\n\r\nNikolas Hulewsky (32:17.752)\r\nTweet.\r\n\r\n\r\nNikolas Hulewsky (32:25.592)\r\nYeah, yeah, Okay. Cool.\r\n\r\n\r\nElizabeth Knopf (32:40.264)\r\nSo this is the end state of some projects I was recently working on. So basically what I started with and how I got here.\r\n\r\n\r\nNikolas Hulewsky (32:52.45)\r\nWell, before you do that, will you just describe what I'm looking at?\r\n\r\n\r\nElizabeth Knopf (32:54.92)\r\nOkay, so these are basically data. Okay, so this one right here is a data cleanup tool. This is like, it's very ugly, but it's functional, a data analysis tool. And this is basically the output of Claude doing the full analysis for me. And I had it in a couple of different ways. So...\r\n\r\n\r\nNikolas Hulewsky (33:15.906)\r\nAnd where am I, so what am I looking at? Am I looking at like a, I'm so stupid, I'm sorry, a Word doc? Is this like an HTML file? Like what is this?\r\n\r\n\r\nElizabeth Knopf (33:21.149)\r\nWe\r\n\r\n\r\nElizabeth Knopf (33:24.424)\r\nCan't see for some reason when I share my screen the here. me see if I pop it out if it shows no, because then it doing it on the window. Let me see if I can.\r\n\r\n\r\nNikolas Hulewsky (33:37.282)\r\nLike did you open that up from the files that were saved locally on your computer?\r\n\r\n\r\nElizabeth Knopf (33:41.218)\r\nYes. So this is something called, you can't see it unfortunately, but basically you have something called localhost colon 8,000 rather than having a URL to website up in my browser in Chrome. have localhost colon 8,000.\r\n\r\n\r\nNikolas Hulewsky (33:57.954)\r\nSo when you double click, open that file, it opens in Chrome, the local host 8000.\r\n\r\n\r\nElizabeth Knopf (34:01.874)\r\nSo when I was in Claude, I said, can you provide like an HTML site for me to see this tool? It provided me literally this address, this local host address. So then I copy and pasted it and put it in my browser. And I think I even just was able to click on it from Claude and it popped up. So if you don't know where to locate your thing, ask Claude, say, where do I find\r\n\r\n\r\nNikolas Hulewsky (34:10.87)\r\nhuh.\r\n\r\n\r\nNikolas Hulewsky (34:21.654)\r\nOkay. Wow.\r\n\r\n\r\nElizabeth Knopf (34:28.444)\r\nthis thing you just built for me? Or how can I view it in X, and Z way? How can I see it in a browser? How can I see it in some manner in a CSV file? It will tell you where to go. So if you don't know what to do again. So this is basically the end of a project. Backing up a sec with some context of what this was about. I had an Excel spreadsheet from scraping. Well, actually, first off, I was trying to get\r\n\r\n\r\nNikolas Hulewsky (34:38.912)\r\ninteresting. Okay.\r\n\r\n\r\nElizabeth Knopf (34:56.456)\r\nan analysis on what geographic locations had certain jobs that were, that there were a lot of job openings, basically to see where there might be gaps in supply and demand for certain types of jobs. So what I did was I had initially built out an NNN scraper that would use Appify and essentially scraped Indeed and a bunch of other websites. That took forever because the tool I was using was just like throwing in one by one URL.\r\n\r\n\r\nscraping it, would take some time, blah, blah, blah. Then I ended up with a CSV file that was 300,000 rows by about 30 different columns. So that was a ton of data. Then I started adding formulas into that and it just got huge and heavy and I started crashing Excel. I then, was a lot of it was very text heavy. So I was like, I need to classify the data and I needed to extract some information from that text.\r\n\r\n\r\nSo I was like, I cannot do this by hand. I can't do this with any of my like Excel skills because it would just either take too much time. It would take too much. Like it just was getting really frustrating. Cause again, it would take, you know, pinwheel a nightmare for me. So I was like, okay, let me try to build something in end end. So I went in again and I built something out and I'm like, this is going to take forever.\r\n\r\n\r\nNikolas Hulewsky (36:03.192)\r\nInteresting.\r\n\r\n\r\nElizabeth Knopf (36:19.282)\r\nGoogle spreadsheets I couldn't access from N8N, doing my local CSV was like a problem. So I updated it to like some, database by Google called Big Query, which is then a SQL database. So then it's like getting, you know, levels of complication that, you know, the average person is just not going to do. So I was like, you know, maybe I can use Cloud Code. So I went back to Cloud Code. I went to my terminal and I started down this process. So\r\n\r\n\r\nWhat I first thought was, okay, I need to think about this step by step because that's how I've been sort of taught within the context of make.com, Zapier, and you have to think through the process.\r\n\r\n\r\nNikolas Hulewsky (36:55.502)\r\nYeah, let me, I'm going to stop you for one second. So for people that are listening, when she's saying any and make.com Lindy Zapier, these are all websites that help you build automations. And so they act like the hub, but they've got very specific if this, then that rules set in place. So what she's talking about is she's kind of been trained on thinking through, all right, under the current model of setting up automations, how do I create this software?\r\n\r\n\r\nbut Claude code is not like that. sorry, keep going.\r\n\r\n\r\nElizabeth Knopf (37:27.976)\r\nExactly. So, um, so I was like, okay, the first step of what I need to do is just clean up the data where I need to basically be extracting information and then I'm going to be classifying it. So those were the two thing classifying it. And then I'm going to be analyzing it. So those were sort of the three buckets of things I needed to do. So I'm like, okay, I need to build tools specific to each. So I went through and this was the first one I did. And it didn't, I wish I had taken some screenshots of what it originally looked like. Um,\r\n\r\n\r\nBut essentially what I had was literally uploading a CSV. I didn't even prompt it really for any sort of UI elements. It just generated this on its own. And I basically pulled it. Okay, I need to, here's some context about my project. I said, here's what I'm trying to do. I need to upload the CSV. Here's some of the things. And I gave it a lot of like context. I gave it a lot of information to basically help produce a file. And here I can do this real quick.\r\n\r\n\r\nNikolas Hulewsky (38:05.902)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (38:26.99)\r\nSo you upload the CSV, what did you tell it to pull out? Did you say like, go to this column and pull this information from the specific column?\r\n\r\n\r\nElizabeth Knopf (38:27.016)\r\nThanks.\r\n\r\n\r\nElizabeth Knopf (38:31.099)\r\nYeah, so I'm\r\n\r\n\r\nElizabeth Knopf (38:36.004)\r\nExactly. So I was making specific rules based on like how I was thinking about it from, I think this is the right one. Okay. From like what I would do manually. Like I was thinking, okay, here's this data structure, because it was very consistent structures, but there was some variation of like the city first, then the job title first, or like at different parts in the sentences. So I was like breaking that down and trying to give Claude that context.\r\n\r\n\r\nNikolas Hulewsky (38:49.421)\r\nRight.\r\n\r\n\r\nElizabeth Knopf (39:03.944)\r\nrather than having it figure it out on its own. So I don't actually know if this was the right file. So let's see. It will only do a test batch.\r\n\r\n\r\nNikolas Hulewsky (39:10.678)\r\nIs that what you should have done? Should you have just let it figure it out on its own?\r\n\r\n\r\nElizabeth Knopf (39:13.788)\r\nSo yeah, so essentially what, let me just really quickly see if I can get the file so I can show you live.\r\n\r\n\r\nElizabeth Knopf (39:43.354)\r\nhave to cut this out. Okay. Give me one more second to have this ready.\r\n\r\n\r\nNikolas Hulewsky (40:05.454)\r\nI literally had almost the exact conversation about this two weeks ago.\r\n\r\n\r\nElizabeth Knopf (40:12.744)\r\nabout Cloud Code.\r\n\r\n\r\nNikolas Hulewsky (40:14.188)\r\nNo, no, no, no, like about this problem set. So I was talking to an accountant and he's the only one within his organization that reviews all of the credit card transactions and all the transactions that they do through a marketplace. and there's hundreds of thousands of them a month, maybe not hundreds, tens of thousands of them a month. And I asked him, I'm like, how do you decide when a red flag or a yellow flag is triggered?\r\n\r\n\r\nElizabeth Knopf (40:18.088)\r\nNikolas Hulewsky (40:41.944)\r\nbased on the spending habits. He's like, I kind of just eyeball it. And based on what I've seen month over month over month, if anything looks out of whack, I'll double click into it. And I was like, well, are you coding each one of these expenses? He's like, nah, not really. Anyways, he gave me his whole explanation. And I'm like, well, why don't you code it? Or he's like, well, I would have to go in and actually tell it the right rules. Look for this word, and then this word means this, et cetera.\r\n\r\n\r\nAnd unfortunately, it just doesn't have the context that it needs. And I was like, you realize you just like describe the use case of AI, right? It uses context to make decisions. And he was like, yeah, but how would I use AI to go through these massive spreadsheets and then code the expenses based on my experience where they should go? And I was like, I don't know. That's actually a good question. I was already thinking through it. This is it. It's like, you just built a tool to do that.\r\n\r\n\r\nElizabeth Knopf (41:31.656)\r\nThis is it. Yes. I mean, this comes up in so many situations and this is literally like the initial, I would say, use case of like classifying text. Yeah. So, okay. So I just uploaded a CSV. So as you can see, this one has 113 rows, 113,000 rows. So what I built was that\r\n\r\n\r\nNikolas Hulewsky (41:42.84)\r\nHoly crap.\r\n\r\n\r\nElizabeth Knopf (41:55.432)\r\nspecific to this use case, the first column that I'm basically extracting the text that I want to categorize. And then I just have also a little unique identifier just for future reference as well. We're not gonna process the whole thing because it'll take a couple of minutes, but we're gonna do a test batch and here we'll just do this, maybe like 50. through N8n, this would take a couple hours to run through to classify through an AI agent, which you could do and then you could build out parallel processing.\r\n\r\n\r\non that ending, but it would get very convoluted. Watch how quickly this is. Literally, I clicked it and it popped up. So this is within minutes. So essentially what I have here and what I had it do, and again, this is like seconds. Yeah. It'd be minutes if I did 100,000. The 50 rows was seconds. Yeah. So.\r\n\r\n\r\nNikolas Hulewsky (42:32.942)\r\nHoly crap.\r\n\r\n\r\nNikolas Hulewsky (42:39.463)\r\nminutes.\r\n\r\n\r\nseconds. Yeah.\r\n\r\n\r\nNikolas Hulewsky (42:46.594)\r\nHoly crap. Wait, so what is this confidence category type?\r\n\r\n\r\nElizabeth Knopf (42:52.328)\r\nYep, so it actually came up with this concept. I didn't even prompt it to create a confidence. It is basically how confident is it that it actually produced the right extraction. So I was trying to get this number, this count number in the count column. I also was looking for a job title and a category. So as you can see, or you probably can't see too well in here, I have the text, is...\r\n\r\n\r\nNikolas Hulewsky (43:08.802)\r\nYeah.\r\n\r\n\r\nElizabeth Knopf (43:19.048)\r\n405 jobs within housing provider. Okay, that was a generic one. Okay, so 10 SLPA home health jobs in Arizona and there's got cut off a little bit, but that's basically that and I think it has one more sentence. So I wanted that 10 number. I wanted this SPL and then I wanted Arizona. So yeah, so here it has the city. this basically says it doesn't have a city that's.\r\n\r\n\r\nNikolas Hulewsky (43:38.348)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (43:42.862)\r\nSo it didn't do the scraping, you still did the scraping.\r\n\r\n\r\nElizabeth Knopf (43:45.704)\r\nis doing the analysis. You could do the scraping though. I hadn't, but you could. So I'm actually working on some scrapers now to solve for this.\r\n\r\n\r\nOkay, so this is basically saying like based on the rules I provided, how like accurate it thinks it is based on how it categorized it. And then I had put in to classify it as like if you see certain words within this structure of like the number, the job title, and then jobs available. So that was like consistent tech structure, then extract this.\r\n\r\n\r\nSo like down here, I don't know why I put, oh, okay. I had some other rules where then we'll classify in general. And basically I created a rule set that I was prompting in. And I had to iterate through with Claude to say, oh, this classified it wrong. So here's an example. I took the text, put it back into Claude and said, here's this what happened, adjust the rule.\r\n\r\n\r\nYes, this was not a one shot and I probably could have looked for it. Yeah.\r\n\r\n\r\nElizabeth Knopf (44:57.216)\r\nI don't know if I... Yeah, hang on, let me see it. Cause I think I closed out the window. Let me just see.\r\n\r\n\r\nElizabeth Knopf (45:18.008)\r\nExactly. Yes, functioning. So let me actually pull up my folder structure just so you can see what these folders. Yeah, a thousand percent. Yeah, yeah. I mean, it will require some iteration and your domain knowledge, but okay.\r\n\r\n\r\nElizabeth Knopf (45:41.778)\r\nOkay, let's pop this in. Okay, so let's share my screen again. Okay, so just so people are aware too, like this is all of my cloud code files. So a few things I did without actually putting them in the proper place and I'll need to create project folders for these rogue things. So this was without me saying to put it in a folder, but like here was my, job scraper we were just looking at. Here's all the files it created. It created test folders. created,\r\n\r\n\r\nfourth data, the exports that I've generated. Okay, I don't know why they're not there. Data that it's using templates and sessions config checkpoints. So this is everything I did not ever come in here at all. The only thing I ever did was even ask it like, where's my CSV file I can download just to like check things out. And then it even just gave me the link or location and I'm going go in here.\r\n\r\n\r\nElizabeth Knopf (46:40.594)\r\nSo let me go back.\r\n\r\n\r\nElizabeth Knopf (46:47.447)\r\nYeah, so literally like, so maybe let's go through a little bit of a process. Let me show a couple other quick examples on like what I ended up getting to because I think this was a useful lesson that people can learn from. Hold on, let me just, where did I just go?\r\n\r\n\r\nOkay. so I went down again, this path of, okay, great. Then I got this to a point where I felt good with the data. Then I was like, need to analyze it. So then I had created a prompt of like, do this analysis. said, use like concept, cause it's simple analysis. It's like pivot tables and other things, but it's just over a large data set. There's going to be weird work. I like, I gave it a bunch of what I thought it needed to do. So again, like,\r\n\r\n\r\nwhat I have here is literally like your, I don't know if this is the right folder. Okay, so this is like thinking about my file. This is super ugly, but like this, all the rows and basically says, okay, what do I wanna do? This is actually the wrong file, but basically here's the things with data. You like calculate them. And then I like click through to like a couple other prompts that'll do and it'll generate an analysis.\r\n\r\n\r\nElizabeth Knopf (48:00.39)\r\nYeah, so basically I want job number, like really the only thing I want here are like these numbers and then let me go see.\r\n\r\n\r\nElizabeth Knopf (48:09.426)\r\nSo it's saying selected and it's going right there. jobs, this, this, this is all the things. Yep. So it's like, this is my little user interface, even though it's ugly job number.\r\n\r\n\r\nRight. Okay. So hold on. This is what I selected and then it populates. It's already there. it's showing. Yeah, it's live filtering and showing like a subset of the sum, the average, the min, the max. I can export this, you know, basically pivot table, blah, blah. Then, yeah.\r\n\r\n\r\nElizabeth Knopf (48:52.68)\r\nI mean, it could, but what I actually, this is not the part I actually wanted to get to. The next step is what I wanted to get to. So this I could still excel. Yes. The next step was then I basically said, okay, I told it to like create context and goals. We'll just say, you know, job listing results from Google, identify total jobs per category by city.\r\n\r\n\r\nAnd then basically I had some data mapping which I recommended so we're gonna just do it by an estate level job title Forgot which one it's gonna be\r\n\r\n\r\nElizabeth Knopf (49:46.888)\r\nYeah, so I just hold it like literally here. I want when you create this data analysis, make sure I can identify which column is the geography and which is the job title. And like, you don't even have to be specific on that because I'll show you in the next one what worked even better was giving it less context. So like you can craft it specifically to what you want in the workflow. But what I found, and I don't know if this is gonna fail or,\r\n\r\n\r\nor work, so let's see, because it was failing before, is, yeah, Nailist has failed. Okay, so it does work with a few of them. It did work out on a few, I have to iterate this, but when I had some bottlenecks here, I'm like, you know what, can I just give it my files and have it build me what I need? And it did. all, yeah. So don't get concerned or worried about all the stuff I just said. Like all the stuff I just said was like, have to think really hard, like don't.\r\n\r\n\r\nlike be dumb and just say, I want this answer. Say, Claude, am looking for, I have data that has jobs and cities. I want to figure out how to analyze which cities have the most jobs opening. And then you might have to iterate through and like whatever. But let me see if I actually do, I think I still do have this open. Let me see. Now I have like a bunch of others.\r\n\r\n\r\nOkay. So what I have here, okay, so this like disregard because this is stuff I didn't need. But this was basically showing job categories, statistical analysis showing the average jobs. It's interactive, it hover, and I didn't prompt it or tell it to do this. This even builds a\r\n\r\n\r\nElizabeth Knopf (51:37.17)\r\nTotally, and I didn't tell it to do any of this stuff. It just did it for me. At one point I was color-coded because the text was overlapping and it was hard to read, but those are small things. But yeah, this is pretty, this I thought was pretty cool. This shows state statistics summaries, top five categories it did for me, so I didn't have to think about that. The concentration based on the location, which I added it in to say what are the closest airports.\r\n\r\n\r\nhow far away it's from major metros, because it had a whole bunch of cities that I'm like, I can't look at thousand cities and figure out sites.\r\n\r\n\r\nElizabeth Knopf (52:25.362)\r\nThat's how I iterated to this. And I did give it the CSV file, so it analyzed it. So it basically said, here's what it is. So I gave it that context. But yeah, it figured it all out. And it did a better job than what I was coming up with. So it did the data cleaning. It did the job extraction. And it did the analysis without going through these two things. So I started from scratch.\r\n\r\n\r\nElizabeth Knopf (52:57.256)\r\nYeah, that's what thought. I was wrong.\r\n\r\n\r\nElizabeth Knopf (53:04.966)\r\nAnd give me a minute here, because I actually do want to show you the prompt I started with, because it was literally two sentences. I was like really blown away when I'm just like, my gosh. That's project management. Okay. Yep. And then I actually had it tell me. Okay.\r\n\r\n\r\nElizabeth Knopf (53:25.16)\r\nOkay, yep, here it is. Okay, let's see if we can share it. Okay.\r\n\r\n\r\nElizabeth Knopf (53:38.952)\r\nthis makes it hurt.\r\n\r\n\r\nElizabeth Knopf (53:44.007)\r\nOkay, so I first got into planning mode. So I told Claude up here, I got in here, I said, go to planning, switch to planning. So all this like grayed out text is me, the white is Claude. Says, I understand you wanna go to mode. And this is exactly what I said. I have a CSV file with 100,000 rows and around 13 or so columns. I didn't even give it exact numbers.\r\n\r\n\r\nI want to identify patterns and trends and insights based on the job title and geographies. And I even had a spelling error of the title. For context, I scraped search results based on the pattern of indeed the job title city state. That's all I gave it. And it basically gave me like, you know, earlier version of this, which, you know, had a little bit of tweaks, but essentially this, essentially what I just showed.\r\n\r\n\r\nAnd so as you can see, just so you can see what, how this played out and my interactions with it, thought through, okay, I need to do data exploration and understanding. So it loaded the CSV, figured out the structure. I did tell it, I think I did actually, did I?\r\n\r\n\r\nYeah, because I had it, yes, I had it in a file folder. So I already had it in my folder. So it actually went and looked for the CSV file in the folder. Because I remember this happened. At first, I hadn't loaded it in and it said I couldn't find a CSV file. So it found a different one. And I was like, no. And then I put it in that file folder and it found the CSV file I was talking about. Yeah.\r\n\r\n\r\nWe went through and broke down what the plan would be. So again, I didn't tell it to do data cleaning. It figured that out on its own. I didn't say do geographic analysis. It figured it out, then figured out like pattern analysis and then the visualization and how I could export it. So then it created a to-do list of what I needed to do. And then literally I was just pressing enter, like using your finger, enter, enter, enter, because it was saying, I do that? OK.\r\n\r\n\r\nElizabeth Knopf (55:53.594)\r\nYeah, so it stops after a task and I'm going to do this. Is this OK? You press enter and there's even a way you can an option where you can say like, don't ask me again, but it'll go through these steps and then you can iterate. And so then it gave me. Let's see where the local host is OK, so it processed it first. OK, reference to CSV file. It wrote a bunch of code. There were some errors. It fixed its errors. I didn't even like notice it because it was dealing with it.\r\n\r\n\r\nPerfect, he said, now it has a clear understanding, updated the to-dos, wrote it. Great, great, more to-do than writing it. So let me see where some of the end points here. So again, it's showing you the to-do list and it's going through what it's doing, what it's next, all that.\r\n\r\n\r\nAnd then here's OK, it successfully completed the job listing analysis project. It provided a summary of what it did. I didn't ask it to this. It just does this automatically. Shared key insights for me. It initially created a bunch of, I remember OK, before it created the HTML, it actually created a bunch of images of charts. And then it created reports in like JSON and MD and CSV files. So it's like OK, but I really want to see this in an interactive\r\n\r\n\r\nsaved in a local and then it said.\r\n\r\n\r\nElizabeth Knopf (57:15.336)\r\nSo then it basically created that dashboard for me.\r\n\r\n\r\nElizabeth Knopf (57:22.918)\r\nYeah, you'd have to connect and there's a couple more steps involved in that, but they do have.\r\n\r\n\r\nYeah, or actually let's even ask it right here because I still have this. So let's say, okay, we got to go. Okay. Okay. Okay. Okay. Yep. But that, yeah, here's the local host.\r\n\r\n\r\nElizabeth Knopf (57:51.644)\r\nOK, let's do it. Yeah, we'll do it with Cloud Code. We'll use Scraper. Sounds good.",
  "metadata": {
    "duration": "",
    "date": "2025-08-20",
    "platform_source": "Google Drive"
  }
}