{
  "episode_number": "43",
  "episode_title": "The $4.1M Event Decor Business: Acquisition and Growth Strategy with Jacob Becker",
  "guest_name": "Jacob Becker",
  "business_name": "Florida Event Decor",
  "transcript": "﻿nik (00:01.262)\r\nAlright, Jacob Becker, I've been chasing you for months. Welcome to Nicknomics. I'm stoked. I'm stoked to have you. For those who don't know you, Jacob, why don't you give us just a brief explanation of what your business does and how you make money?\r\n\r\n\r\nJacob Becker (00:20.209)\r\nSo it is a corporate event decor business and we make money by getting hired by either event planners, also better known in our world as DMCs, which are destination management companies. They'll work with big, large corporations doing all the event planning, you know, booking out the hotels, the transportation, the DJ, the...\r\n\r\n\r\ncatering, all the above. But part of that is if you've gone to any of these events and even seminars and different things, you know, there's, there's a lot of decor. I mean, you got to make it look nice. Like anything you need a professional presentation. And that stuff costs money. And typically, we're utilizing some of the furniture we already have in the warehouse. And then oftentimes, though, we do need to build out custom items with branding and different different.\r\n\r\n\r\nnik (01:17.391)\r\nSo you're, if I can say in a different way, essentially somebody contracts with an event planner and they sub out maybe some of the different jobs, but one of the jobs is decor. And so your company might commit, maybe it's a Ninja Turtles themed corporate event, or it's a Barbie theme corporate event. And your team is the one that's coming in and building those set pieces, et cetera. Like you started to touch on it. Do you have just a big warehouse where you keep a bunch of stuff?\r\n\r\n\r\nJacob Becker (01:21.809)\r\nYes.\r\n\r\n\r\nJacob Becker (01:34.609)\r\nYeah, yeah, yeah, yeah. Yep, yep, dude.\r\n\r\n\r\nJacob Becker (01:46.001)\r\nYeah. Yeah. And by the way, we've done both of those themes, which is funny. And this just just to answer before I answer your warehouse question, we the DMC, so to speak, they're about 75 % of our business, about 25 % and growing is the corporations coming directly to us. So, you know, it's and that's that's an area that we're really ramping up.\r\n\r\n\r\nnik (02:07.854)\r\nWow.\r\n\r\n\r\nnik (02:12.014)\r\nOkay, so the corporation may have their own internal, you know, like on the office with Phyllis and the party planning committee, they may have their own person who's kind of managing this stuff. And they're like, we need to pull this stuff together. Cool. Reach out to, to Jacob's company. What is the name of your company?\r\n\r\n\r\nJacob Becker (02:25.873)\r\nFlorida Event Décor. And ironically, and I won't put a name out there because I, you know, just to be respectful, but just yesterday we had someone who we follow each other on Twitter. They're the CEO of a large company. Did an inquiry with our company yesterday. Probably not even know. He didn't do it specifically, but then again, they have an event planner on staff that, so I thought that was kind of funny, but yeah.\r\n\r\n\r\nnik (02:40.045)\r\nAmazing dude.\r\n\r\n\r\nnik (02:46.574)\r\nYou know what would be hilarious? If you it would get taken down very quickly because of copyright issues, but if you put out a video that you've heard Taylor Swift's new song, Florida.\r\n\r\n\r\nJacob Becker (02:57.873)\r\nOkay, yeah, yeah, yeah.\r\n\r\n\r\nnik (02:59.278)\r\nIf it was like, sorry, then so the name of your company is Florida event company. Florida event decor was like Florida event decor is a hell of a drug. Florida event decor. That would be hilarious, dude. That would be so.\r\n\r\n\r\nJacob Becker (03:04.145)\r\ndecor, a Florida event decor.\r\n\r\n\r\nJacob Becker (03:17.713)\r\nI gotta get right on that. I gotta, as soon as we hang up here, I gotta get the wheels in motion. So to answer your question on the warehouse, yes, we have a 20 ,000 square foot warehouse. And I think at some point we'll probably get a bigger space. But for now it's good, you know, and then with the warehouse and then the office portion of our facility. And so you walk out there and it's just tons of cool different items. I mean, there's like,\r\n\r\n\r\nThere's like the Moon Man from MTV, if you remember that, because that's a real popular theme, the 80s and 90s in that way. So we need some of these things to bring the event to life. And so a lot of these things we do keep, a lot of them we don't keep and we throw them out, which just sounds crazy. We use them for one event and throw them out, but it's just part of the game. And then out there is also a huge section for our carpentry and scenic team, where they're building and you just...\r\n\r\n\r\nnik (03:51.758)\r\nYeah, yeah. Yeah.\r\n\r\n\r\nnik (04:15.886)\r\nMmm.\r\n\r\n\r\nJacob Becker (04:16.433)\r\ncool stuff. You will. I mean, they're always doing something cool and building this and an archway. And we just, you know, like the cool example earlier this year was was Super Mario Brothers, like building a Super Mario Brothers land, I won't say for the company. But yeah, it's a huge company that everyone knows. And yeah, so it's cool to just do all these neat things.\r\n\r\n\r\nnik (04:37.71)\r\nis so this is so awesome because you're in Orlando. And they're like there are big companies based in Orlando that work out of Orlando and you're also in one of the hubs in the United States that's like the convention hub, right Vegas is a convention hub, Orlando is a convention hub. Phoenix Act surprisingly has a ton of conventions because it's just one of the warm weather cities. So I'm sure you're like, I was dealing with a big\r\n\r\n\r\nJacob Becker (04:53.745)\r\nTotally. There you go, see that? That's the other one.\r\n\r\n\r\nJacob Becker (04:59.921)\r\nYeah. Right, exactly.\r\n\r\n\r\nnik (05:05.102)\r\ncompany the other day. I can't say their name, but it rhymes with Maxon double. And.\r\n\r\n\r\nJacob Becker (05:10.577)\r\nHa ha!\r\n\r\n\r\nThat's what I should have done, huh? And Nick, to that point, by the way, is honestly, almost none of our business comes from Orlando. Like maybe a couple percent. We're just, that's not, it's businesses all over the country that are coming to Florida and putting their events on. And we go all over Florida. Orlando's probably 60 % of our business out of the Florida type stuff. And we go beyond Florida too. We got an inquiry. I was just typing an email before this for Texas.\r\n\r\n\r\nnik (05:40.302)\r\nOkay. So I'm glad that you and I have spoken a few times and I peppered you questions before we've actually had this conversation because you said something in there that if I was listening, I'd be like, that doesn't make any sense. You're based in Orlando. How the freak are you getting people from around the country to reach out to you that are coming there for events?\r\n\r\n\r\nJacob Becker (05:42.833)\r\nSo.\r\n\r\n\r\nJacob Becker (05:58.577)\r\nOkay. Yeah.\r\n\r\n\r\nnik (06:07.438)\r\nAnd I think this is like a good spot for you to kind of give background on yourself. I know you hate talking about digital marketing, but this is not your first company. You bought this events business eight months ago. Can you talk just a little bit about like what was your history before this and how did you even get into buying this business?\r\n\r\n\r\nJacob Becker (06:26.161)\r\nWell, I'll give you the shortest version possible, but yes, it all started with the digital marketing. That is something that I just started from scratch. I really had no idea what I was doing. That was maybe like 13 years ago. I still have the company today. And I just started like learning and watching YouTube videos and then met with a couple of local people that my sister had a local consignment store that I was doing stuff for them. And people are coming to the store like, who's doing your stuff now? My mom was the store manager.\r\n\r\n\r\nAnd she was like, hey, people keep asking who's doing our Facebook stuff now. And I'm like, all right, maybe I'm kind of good at this stuff. And so the entrepreneur in me came out, just started watching, learning, just dove head first, got a couple of clients. And then just you do good. Business owners tend to hang out with other business owners. So you do a good job for a couple. They introduce you, blah, blah. So it snowballs. And so that was really me for several years is just straight digital marketing and building that agency.\r\n\r\n\r\nnik (07:10.446)\r\nYeah. Yeah.\r\n\r\n\r\nJacob Becker (07:21.201)\r\nBut along the line, I realized this is not my end all be all. I don't want, well, I will keep my agency and I will still take clients if they come to me. It's not like my big long -term goal. However, there is huge leverage in understanding how to bring customers in, get customers, get sales and leads. You can apply that to really almost any business if you know what you're doing. And so that's when the wheel started turning. And so I got into.\r\n\r\n\r\nVideo first was what happened. We started getting video requests within our agency. And so I started this video company that started to turn. And from there, just in the city I was in, which is Buffalo, I moved to Florida four years ago, is I added on photo booths and then DJ and then photography. So then we're getting now I'm in the full blown event space. So then I have all these different add -ons, so to speak, but then combine them. Well, oftentimes people will book everything.\r\n\r\n\r\nnik (08:11.694)\r\nInteresting.\r\n\r\n\r\nJacob Becker (08:18.833)\r\nAnd so that introduced me to the event space. And then from there, I had moved to, yeah, go ahead.\r\n\r\n\r\nnik (08:24.334)\r\nSo just pausing there for a second. So you're doing this digital marketing company that sort of expands into the event space. Are you still doing all of those things with that company? you are, okay. And how big is that company currently?\r\n\r\n\r\nJacob Becker (08:35.793)\r\nYeah. Yeah. Yeah.\r\n\r\n\r\nthe one I was just mentioning, the video photo booth. It's not huge. It's like, the digital marketing is its own company. So the video I spawned off and then the video added on and then DJ and then photo booth and then photography, because those are more event -driven things. Digital marketing can be used for events to sell tickets and all that, but typically,\r\n\r\n\r\nnik (08:43.79)\r\nYeah, the digital marketing.\r\n\r\n\r\nnik (08:53.422)\r\nokay.\r\n\r\n\r\nnik (09:00.046)\r\nGot it.\r\n\r\n\r\nJacob Becker (09:08.913)\r\nyou know, there's other people that are going to be better for that. So yeah, so, yep. So that's my introduction into the event space. I come to Florida, blah, blah, blah, still launching things, bought a doggy daycare in there. Just, just again, and that's all with the confidence of I can, I can leverage the digital marketing agency and apply that to any business. I go in knowing I can get business because that is such like you can have the most,\r\n\r\n\r\nnik (09:10.574)\r\nOkay. All right. I'm caught up. I'm caught up. All right.\r\n\r\n\r\nnik (09:35.598)\r\nYeah.\r\n\r\n\r\nJacob Becker (09:38.577)\r\nbeautiful restaurant on planet Earth. But if you can't get people in the door, whatever example you want to use, like you're at a huge disadvantage. So that's an advantage for me. And yeah, and ultimately the the event this one Florida VenteCorp popped up online. It was no people ask all the time because we're in the space of this real real growth in buying businesses. And this would have been January 23. So about what is it 17 months ago, and\r\n\r\n\r\nnik (09:47.63)\r\nYeah.\r\n\r\n\r\nJacob Becker (10:07.921)\r\nAnd it was literally just listed on BizBizel. There was no, I didn't get some back door, like a broker, like I got to.\r\n\r\n\r\nnik (10:14.446)\r\nAnd that's I crap on BizBizell all the time because I'm like, why would you go to BizBizell? Those are the crappy deals, blah, blah, blah. But I'm going to give them their flowers here. You found a freaking great business on BizBizell and you can find great businesses on BizBizell.\r\n\r\n\r\nJacob Becker (10:25.105)\r\nYeah. Yeah. Yeah. Yeah. Yeah. I got the doggy daycare on there too. We've done great. We've had a record. Last year was a record all time year for that company and they've been around for 25 years, 26 years. So yeah, it's definitely possible. And so that was my, and the SBA is what I did as far as the financing to get the Florida Event Decor. They like to see some kind of...\r\n\r\n\r\nexposure to the industry previously. So for the doggy daycare, I had an e -commerce company selling dog treats for about six or seven years. And again, I was leveraging my digital marketing agency. So that was my exposure to the dog industry. And then for the Florida event decor, I still to this day have the Buffalo company. So that was what they wanted to see there. And yeah, so that's kind of how it all happened.\r\n\r\n\r\nnik (10:55.054)\r\nYeah.\r\n\r\n\r\nnik (11:17.71)\r\nOkay, so you have the digital agency that you started from scratch. How big is that? Can you give like high level employees and revenue?\r\n\r\n\r\nJacob Becker (11:22.449)\r\nYes.\r\n\r\n\r\nAnd...\r\n\r\n\r\nYeah, it's not huge because I don't try to push it. It's about a million in revenue. And yeah, 8 .8%.\r\n\r\n\r\nnik (11:32.846)\r\nYeah. Okay, but all the learn I mean, all the learnings you've gotten from that have been incredibly valuable. So digital agency business. From that you created this I don't know what else to call it, but events business. And okay, entertainment business and that's still running. And I know that you're looking to expand that into other markets as well. How big is that one currently?\r\n\r\n\r\nJacob Becker (11:47.569)\r\nEntertainment, I call it.\r\n\r\n\r\nJacob Becker (11:57.041)\r\nThat's also at about a million, but what's gonna happen with that is I'm gonna split the video off because the video, excuse me, the video has the big potential. I've already kind of split it off, but I'm gonna bring it out like completely into its own LLC and everything. But photo booths and that sort of thing and DJ, it's more localized. Video, I can, and I could buy photo booths in every city if I really wanted to, but I'm probably not gonna do that.\r\n\r\n\r\nnik (12:23.758)\r\nThat's capital intensive. Yeah, yeah, yeah.\r\n\r\n\r\nJacob Becker (12:26.577)\r\nBut the video, we're already into four cities. So Buffalo, then we expanded to Rochester about two years ago. Then I come to Florida. So now we're in Orlando. And then we're in Tampa. Austin is already, we already are all set to go there. We're pretty much, we're like a week or two away. And we have a bunch of other cities that we're targeting that are already, the foundation has been laid. And so that I'm going to turn into its own entity and just go, cause video is just such a big part.\r\n\r\n\r\nof society now. I mean, think about how much video is consumed on a daily basis across these platforms and even not even on the platforms. Like your kids are like, you're just video, video, video, video. It's like, you know, so I see a lot of opportunity there.\r\n\r\n\r\nnik (13:10.19)\r\nWell, just so you know, if you I don't think people who are watching this will see me because we're actually switching the video where like who's talking pops up first. I've started taking notes when I'm talking to people and like and like your story in particular, there's just so much that you just explained. So if you see me like looking down here, I'm not tweeting. I'm like I'm literally like I'm literally like writing notes.\r\n\r\n\r\nJacob Becker (13:31.041)\r\nNo, I assumed as the host you weren't, you know, side -texting during the...\r\n\r\n\r\nnik (13:39.054)\r\nI'm so sorry. I gotta get this tweet out. My fans expect it. It's funny Chris and I will be on conversations and I like to zoom with him because I like to see people when we're talking. And I know in an instant I can hear in his voice I can see on his face when it's on video that he's distracted with something and I'll be and he'll be like, huh? Yeah, I'm like, what are you doing? And then all of a sudden I'll get a notification that Chris just sent a tweet and like dude. Come on anyway.\r\n\r\n\r\nSo irritating. Okay. We do. We do. Okay, so you start these three businesses from scratch, and then the doggy daycare sounds like it was the first one that you actually purchased through the SBA. Is that right? Can you just like give high level description of like how big that business was and what?\r\n\r\n\r\nJacob Becker (14:10.225)\r\nI think we all have a little bit of that entrepreneurial ADD.\r\n\r\n\r\nJacob Becker (14:20.497)\r\nYes.\r\n\r\n\r\nJacob Becker (14:26.865)\r\nYeah, it was, I bought it for 410 ,000 and it was doing about 680 ,000 in revenue, about 150 ,000 in profit. And yeah, and so we're up to, we're gonna, I was hoping to get to a million this year. This is our second full year, so we bought that in 22. We only got half a year in 22. 23 was our,\r\n\r\n\r\nnik (14:44.91)\r\nit\r\n\r\n\r\nJacob Becker (14:55.953)\r\nBut yeah, it's growing and honestly, we really want to open a second location. It just hasn't, the stars haven't aligned on that yet. The cool thing about the SBA, which I've tweeted about is you can do an add -on business. So if another doggy daycare in our market goes for sale, we can do that with no money down, no equity injection and be able to scoop that up. It just hasn't worked out that way yet, but it's fine. It will come when the timing's right. But yeah, that's.\r\n\r\n\r\nnik (15:16.206)\r\nYeah.\r\n\r\n\r\nJacob Becker (15:24.689)\r\nThat's kind of how that all laid out. And so the difference with that business is while I am not involved in the day to day, to be honest, I don't know if I'm supposed to admit this, but I probably only been there about 10 to 12 times over the last two and a half years, like physically in the building. So it's not, of course, you know, I'm communicating about it and that sort of thing. And I have some amazing people.\r\n\r\n\r\nnik (15:42.222)\r\nyou dirty dog!\r\n\r\n\r\nJacob Becker (15:53.201)\r\nthat are a part of that that I trust. And so ultimately, it's something that I think it has potential. And it's also something that's not a huge like moneymaker though. And yeah, so one location doggy maker.\r\n\r\n\r\nnik (16:06.062)\r\nAnd that one has an e -commerce component to it.\r\n\r\n\r\nJacob Becker (16:10.737)\r\nIt does not. I had an e -commerce business with dog treats for about seven years, which the SBA gave me the green light on, hey, he knows something about dogs. So that's, you know, that's kind of.\r\n\r\n\r\nnik (16:21.902)\r\nOkay, okay. And then, so then from there, you bought the event Decor Business. Are you able or willing to share kind of how much the business costs and sort of what that process was by that business?\r\n\r\n\r\nJacob Becker (16:33.585)\r\nYeah. Yeah. Yeah. It was a cost. Three point six five million. We took out three hundred thousand in working capital and then closing costs and all that total total amount came to about four point one million. And then with. But I mean, if you look at it, the the seller discretionary earnings on that was one point six five million.\r\n\r\n\r\nAnd so if you do the multiple on that at 3 .65, I mean, I was very happy. I was very happy with that multiple. And it was one point, prior to it was 1 .8 for the, cause there was an in -between owner, the original owner who had it for about 15 years. He sold it to the new, the guy I bought it from who only had it for a little over a year. Just wasn't his cup of tea. Tried to run it from across the country, which is really tough to do that out of the gate for this type of a business.\r\n\r\n\r\nnik (17:07.31)\r\nstreaming.\r\n\r\n\r\nJacob Becker (17:30.481)\r\nAnd so ultimately, yeah, so really, really solid numbers and solid multiple that got us.\r\n\r\n\r\nnik (17:36.751)\r\nSo I want to do two things. I'm going to explain the SBA really quickly and then I'm going to ask you a specific question. For those, for those who don't know the SBA, the Small Business Administration has a loan program for businesses that you're purchasing for $5 million or less. I shouldn't say that they will lend up to $5 million on the purchase of a small business. So you could theoretically buy $7 million business and you get a $5 million loan from the SBA and you put $2 million in. But anyways, let's just speak broadly.\r\n\r\n\r\nIt used to be that the $5 million was your cap, and now the SBA will allow you to go up to the $5 million cap per industry. So for example, doggy daycares are very different industry than event decor. So you could have theoretically gone $5 million in doggy daycare if you if you want to expand into another market, you have that option there with the SBA. You're kind of tapped out. Maybe you have a million dollars left in the event decor business, but.\r\n\r\n\r\nYou could probably pivot and you could buy a digital agency. You could buy something else. And that's one of the cool key changes that the SBA made recently. The question I want to ask you, though, is. That event business. Was very competitive to get. There were a lot of people reaching out. There were a lot of people who are interested because of course those are big numbers. 1 .2 and it did 1 .8 the year before and you're only selling it for 3 .6 or like what? Somewhere in those numbers.\r\n\r\n\r\nJacob Becker (18:55.857)\r\nYeah.\r\n\r\n\r\nJacob Becker (19:00.369)\r\nYeah, yeah, yeah, yeah, yeah, yeah.\r\n\r\n\r\nnik (19:02.958)\r\nHow did you go about winning when you probably weren't paying the highest price? You probably weren't the most liquid. You probably weren't the one with the deepest pockets, right? There are probably private equity or somebody else who was backed and yet somehow you somehow you won it. How did you do it?\r\n\r\n\r\nJacob Becker (19:16.401)\r\nYeah, yeah, he told me straight up.\r\n\r\n\r\nJacob Becker (19:21.969)\r\nSo, and by the way, on the $5 million loan on the SBA, I'll give one more extra thing on that. They are doing, starting to do loans over 5 million. The bank is starting to get involved where they'll give you the rest on that. So I thought I would, I've seen that happen more and more. So I thought that'd be cool to mention. But as far as getting picked for this business and your business partner, I talked about that, this particular thing a little bit, cause him and I had spoke.\r\n\r\n\r\nnik (19:42.702)\r\nYeah.\r\n\r\n\r\nJacob Becker (19:49.681)\r\nat SM Bash and he had the keynote there and he had talked about this particular thing about me getting picked for this business. And basically what had happened is I reached out and I went in with the mentality right away from day one. I know I'm not going to be the one with the most money. I know I'm not going to be a lot of these, but I'm not going to be the quickest to close problem. Like whatever examples you want to give.\r\n\r\n\r\nAnd so rather than going in with a...\r\n\r\n\r\nwith an attitude of like, I'm probably not gonna get this. Like there's just too many things. I actually went in with like crazy and this is what Chris had talked, like a false confidence. I did, I went in with it. I was like, I don't care what I am going to get this. And I just, I wanted to like manifest it almost. And so I went in and my approach was this, relationship. It's to me, I...\r\n\r\n\r\nI believe, and I don't have data and I haven't taken like tons of sales courses and all that, but just in my own experiences, to me, it feels like people want to work with and they choose people they like, people that they just, they vibe with that sort of thing. And that's an area of strength for me. And I've read, I forget what book it is, but it talks about your unique.\r\n\r\n\r\nI think it's like 10X something, but not great card. But it talks about your unique ability. And I've analyzed that. What is my unique ability? Because honestly, I'm not like, I'm not great at anything. Like, I don't know. I'm just, I'm versatile, very versatile. So what I actually arrived at is my unique ability is people.\r\n\r\n\r\nnik (21:17.39)\r\nThank you.\r\n\r\n\r\nJacob Becker (21:38.321)\r\nas I can, I can generally, I get along with mostly everyone. I'm able to relate. I actually care. And so these types of things. And so that was my unique ability. So I went into this thing. I remember the first meeting with him, he gave me his business card and I, you know, business cards are like kind of dated or whatever, but, and so what I do with business cards, all the business cards I've gotten in the last 12 years, I take them and I take a picture of them and that's it. I throw them out, but not this one.\r\n\r\n\r\nI was like, no, not this one. I am keeping this business card because I'm going to get this business. And I just continued to tell myself that. So then we go through, we meet, we're chatting, we talk about personal stuff and all that stuff. And then there's this, and I don't know if you want me to give you the entire story, but ultimately he calls me to go out to eat. It's like a fried, yeah.\r\n\r\n\r\nnik (22:34.51)\r\nSo hold on, hold on. Yeah, we're not gonna cover all the stuff that I wanted to cover and that's fine. I'll have you on another time. Like this, I think this is really valuable for people to hear. Tell me what was he like, right? So he gives you a business card. He's obviously older than you. I'm guessing, okay. Like what was his background? Was he somebody he was hard to connect with?\r\n\r\n\r\nJacob Becker (22:43.825)\r\nYeah, I think so too. I think so too.\r\n\r\n\r\nJacob Becker (22:52.369)\r\nYeah, yeah, yeah.\r\n\r\n\r\nJacob Becker (23:00.689)\r\nYeah, so, you know, I don't know the with the world of the internet. I don't want to go but ultimately he can't no, no, no, no, no, no, no, no, no,\r\n\r\n\r\nnik (23:04.942)\r\nokay, that's fine. Fair.\r\n\r\n\r\nYeah.\r\n\r\n\r\nnik (23:19.214)\r\nI assumed I assumed as much when you're like, yeah, it's you know, it's doing 1 .2. He bought it. It wasn't his cup of tea. So he's looking to sell it. I'm like, OK, he he probably already had come from somebody.\r\n\r\n\r\nJacob Becker (23:27.729)\r\nYeah, he was transparent about that. He's like, yeah, I was thinking about like, getting a place in Orlando and my daughters are kind of on the brink of graduating high school. I thought it'd be cool to just like get a business down there and maybe I'll get a place and then they could take it over. And then I think I just got anxious with it. And I'm, you know, I'm 50 now and like pushing.\r\n\r\n\r\nnik (23:46.638)\r\nGood for him though for being like introspective about it and realizing, all right, I got to unload it. You know what I mean? And not being prideful.\r\n\r\n\r\nJacob Becker (23:52.049)\r\nYeah, yeah, yeah, no, no, yeah. So that's, that's kind of like his story. He's, he's real successful. I mean, I, I don't care. I'll just say, like, I looked up his house and he's got like a 15 ,000 square foot like castle. Like, I'm like, I don't think he didn't really need this business. It was just like a possible thing for him. But it's, it's the event business is a lot more complicated than I think that it seems like, we make this cool stuff. it's like, well, yeah, but there's like a lot.\r\n\r\n\r\nnik (23:56.654)\r\nThank you.\r\n\r\n\r\nJacob Becker (24:21.937)\r\nthat goes into it. So, so yeah, so, so I related to him. What's that?\r\n\r\n\r\nnik (24:22.766)\r\nSo he invited me there.\r\n\r\n\r\nNo, no, keep I was saying he invited you to dinner, but.\r\n\r\n\r\nJacob Becker (24:29.457)\r\nso yeah, yeah. So he invited me to dinner and I'm like, I don't really know what this is all about or whatever, but as I know, he's talking to all these other people, he's pretty transparent about it. He's like private equity is hitting me up. He's like, to be honest too, I got another, another person that's real similar to you. I do think that you'd be a better fit for all that, like, but never really given me a fully straight thing. So he has me to dinner and he goes,\r\n\r\n\r\nI want to sell the business to you. And I'm like, you know, I'm like, I did it. And then he drops the bomb. He goes, but I just hired a GM and I want to see if we, if I can run it remotely with her running it before, before I actually, I'm like, my God. So you kind of built me up there to let me know, but it didn't even change to again, back to the false confidence and just believing in yourself and believing that.\r\n\r\n\r\nnik (25:17.87)\r\nYeah.\r\n\r\n\r\nnik (25:22.062)\r\nYeah.\r\n\r\n\r\nJacob Becker (25:29.169)\r\nyou know, this is meant to be sort of thing, man, whatever term you want to use, I don't, whether you believe in that stuff or don't, I personally do because I have so many examples throughout my life that I feel that I've stuck, put my mind to something and it ends up happening. So I didn't walk away from that meeting discouraged. I just said, all right, there's going to be a little, little delay. I know the events business. I know this guy is not going to, it's, it's just, he's going to come a point. I don't know if it'll be in a month, three months, six months, two years.\r\n\r\n\r\nbut and I'm gonna be the person he calls. So I'm just gonna be patient. So I'm just gonna move on with my life and I'm gonna just put it out of mind and I'm gonna wait for the phone to ring. And so sure enough, you know, three months later, the phone rings and I've told this story in a tweet before, but it rings and I'm like, here it is. And he goes, hey, can you help me with the new website? I'm like, my God.\r\n\r\n\r\nnik (26:24.654)\r\nmy gosh.\r\n\r\n\r\nJacob Becker (26:25.073)\r\nIt's like, I know you got that digital marketing. So then it's like another let down, but like it didn't didn't faze me. And that was only a month.\r\n\r\n\r\nnik (26:30.862)\r\nBut at least he's still at least he's like roping you in even more right like all this year if you're doing the website you're like okay I'm in I'm in.\r\n\r\n\r\nJacob Becker (26:35.377)\r\nYeah.\r\n\r\n\r\nYeah, yeah, yeah, for sure. Yeah. And I'm like, I'm going to build it really good because I know I'm going to get, I actually said this to myself. I'm going to build them a sick website and I'm going to like make it bomb SEO, all this stuff, because I know I'm going to be getting it at some point. So I'm like, actually went in, not that I wouldn't do a good job for a client, but you know what I mean? Like I had that extra. And so it was really only a month after that it rang again. I thought he was calling me about the photos and videos. I was trying to track down from him for the new site and it wasn't.\r\n\r\n\r\nAnd he's and I started talking, I immediately went into the photo and video chatter about it. And then he redirected me. He's like, well, actually, the reason I'm calling is I think it's time or whatever. And that's that's it. That was that was so the meeting at the restaurant was in January. The call about the website was in April. So there's about a 90 day thing where, again, I moved on knowing just wait for the phone to ring. And then May was when.\r\n\r\n\r\nHe said, I'm ready. By the beginning of June, it was under LOI. I used the same exact LOI. So this was part of the strategy too. Well, I do think that at that point, I maybe could have haggled a little bit and got a little bit money. I think I probably could have sweetened the deal a little bit. It's crazy that that sounds, because I feel like I was getting a good deal. I'm like, you know, let's not get greedy here. Like, let's just, the easiest path is to say,\r\n\r\n\r\nHere's the LOI we already reviewed in January. We were already both good with all this. Let's just update the date essentially and move forward with it and not. And so, yeah, so that's kind of how it all came to be.\r\n\r\n\r\nnik (28:19.534)\r\nI'm just like writing this all down because she's Louise. That's amazing. Give me just one second. Hold on. Sorry. My son's...\r\n\r\n\r\nJacob Becker (28:21.873)\r\nYeah.\r\n\r\n\r\nJacob Becker (28:30.225)\r\nYeah, yeah, no problem.\r\n\r\n\r\nnik (28:58.926)\r\nSorry. He's just screaming bloody murder out there and I'm like, that's going to bleed through. No, no, I mean, I mean, I was concerned about him. That's what I mean. I wasn't concerned about the recording.\r\n\r\n\r\nJacob Becker (28:59.921)\r\nNo, it's OK. It happened to me yesterday. I worked from home and my little one started ballin' too.\r\n\r\n\r\nJacob Becker (29:14.233)\r\nYeah, yeah, yeah, yeah. yeah, yeah. I'm sure you thought, you know, that was something real bad. You had to get out there.\r\n\r\n\r\nnik (29:20.558)\r\nWhat I was going to say is like, something I've noticed about myself and my experience is like, everything that happens in our life starts between our ears, right? So you're talking about manifesting, but it's all an attitude. And yes, things happen to us. It's very true. But how we take that, how we respond, what happens next is really the result of our attitude and how we decide to act.\r\n\r\n\r\nJacob Becker (29:41.297)\r\nInevitable.\r\n\r\n\r\nnik (29:50.19)\r\nmoving forward. But the every time that something good has happened, I've looked back and I'm like, man, I was such an idiot. What if I what if that didn't work out? my gosh, what? I bought that business. And what if the seller had been really dumb? And what if I hadn't done the due diligence and found this thing? Or what if like I used to look back and get scared and I and I still do I'm still like, geez, that's that's kind of scary that I may have missed certain things. But\r\n\r\n\r\nJacob Becker (29:51.665)\r\nYeah, yeah, yeah.\r\n\r\n\r\nNo.\r\n\r\n\r\nnik (30:21.23)\r\nBut I feel like if you're not to the place. Where you look back? And cringe a little bit at the way you're acting. Like you, you probably left some some stuff on the table and like you just want to be able to go for it. Anyways, to your to your point too, like it's easy to feel like I could probably get a better deal. I could probably negotiate something, but at a certain point, once it's negotiated.\r\n\r\n\r\nJacob Becker (30:29.937)\r\nYeah.\r\n\r\n\r\nJacob Becker (30:34.225)\r\nYeah.\r\n\r\n\r\nJacob Becker (30:40.337)\r\nYes.\r\n\r\n\r\nnik (30:50.958)\r\nAnd you're about to get it. A bird in the hand is much better than two in the bush. So it's like just close the deal, right? Like don't get greedy. I've seen too many deals blow up because people got greedy.\r\n\r\n\r\nJacob Becker (31:00.177)\r\nYeah, yeah. And it's such a small amount if you actually run the numbers and thankfully it didn't work out because the first business I ever tried to buy was a mini golf course and I lost it by like seven grand or something. And don't get me wrong, I'm super glad it didn't work out because it was like not in hindsight, like probably not a great fit for me, which is probably why it didn't work out. But like, and I didn't have nearly the same passion we're talking about with wanting to get it or whatever, but like, hey, it was seven, you talk about 7 ,000 over the course of a 10 year.\r\n\r\n\r\nLike, I don't know, I know it 50 bucks, whatever it is, you know, and like, that's what I was being so cheap about. And that I'm glad that lesson happened because I'm like, if this is going to change my life or even level me up in life and bring me an additional level of prosperity and all these other things that come with, you know, buying a good business, if you do it right, don't get lost over some miniscule.\r\n\r\n\r\nnik (31:31.022)\r\nYeah.\r\n\r\n\r\nJacob Becker (31:57.521)\r\namount, like even $100 ,000 difference when you're talking about this size of a business. I mean, even at the 1 .6 million in profit, my my loans about 50 ,000 a month. So it's about 600 ,000 a year in debt service. And so you look at that. Let's say the let's say it was 52 ,000 a month because I paid an extra 100. I mean, you know, in the grand scheme of things. So,\r\n\r\n\r\nnik (32:25.258)\r\nWhat? Well, and I think like developing this muscle of knowing. What is a big deal and what is not a big deal is so important in entrepreneurship. It does take time because the first the first time an employee shows up drunk at work. It's always a big deal. Don't get me wrong. But you're like it ruins your whole week. You're like, my gosh, Brian show. I gotta fire Brian. This can be a terrible thing. And then.\r\n\r\n\r\nJacob Becker (32:51.121)\r\nYes.\r\n\r\n\r\nnik (32:55.054)\r\nA few years later, after many events, you're like, okay, yeah, I got to deal with Brian this week, right? It doesn't derail your week. Maybe you have a bad hour, but you just learn that there's a level to the magnitude of problems. And it's that maturation process that I think makes you more successful as you go down the road, because you're like, I have experience to draw on. This isn't necessarily in the world. So knowing what is a big deal and what isn't a big deal is one of the muscles that you kind of develop over time as an entrepreneur.\r\n\r\n\r\nJacob Becker (33:08.113)\r\nTotally.\r\n\r\n\r\nJacob Becker (33:22.629)\r\ntotally. And that's when the growth happens in those moments because so many people crumble when like, gosh, this went wrong and they messed up this and like, the client's going to be so mad. And like, you're freaking out because you haven't really went through and a lot of people bail and that's all she wrote for them in that moment. Like they don't, they're not able to get through that because you do have to be able to like go through those moments to then get to the point you're talking about where at the seventh time it happens, it's like,\r\n\r\n\r\nHere we go, you know, I know how to do this. I know how to handle and you so you grew. So that's what they talk about with the hard moments is what bring out the growth in that. Because if you don't go through those hard moments, you're not able to get to the point of that 17th time that it happens and be able to know exactly how to how to compose yourself, be a leader and show the calmness amongst because as a leader, you want to you want to be the calm presence and it's all good. Everything's fine. We're going to handle it, you know, and.\r\n\r\n\r\nbut you have to work to that point. And so that's why the growth happens in those tough moments.\r\n\r\n\r\nnik (34:23.63)\r\nSo I'm going to blow some smoke up your butt for a second. I'm just warning you. A lot of people, a lot of you on Twitter, or, you know, hold co is kind of the new sexy word. And I really admire the way that you've built your, I've never heard you describe it as this. And I don't even know that you think of what you have as a hold co, but you've built, you've built a holding of, of small companies. But I think what's really interesting about the way you've built it is intentional or unintentional.\r\n\r\n\r\nJacob Becker (34:33.681)\r\nYeah, yeah, yeah.\r\n\r\n\r\nJacob Becker (34:44.401)\r\nI will.\r\n\r\n\r\nnik (34:54.19)\r\nYou've built it around this thesis of digital marketing as the accelerant. And so you had obviously your first business, which was an agency and then the entertainment business. I'm sure you're using digital marketing, the doggy daycare. You had an e -commerce business at one point and now you have the events business. The event decor business that, as you said, the majority of your customers, 75 % or some somewhere in that ballpark are coming from out of state. They're not even local people. And how do local, how do.\r\n\r\n\r\nout of state people find you it's through SEO and digital marketing and pay -per -click stuff. I wonder though, have you ever sat down and thought like, yep, I'm interested in buying companies that I can accelerate through digital marketing. Or has that just been like de facto the way you've operated and you've never really articulated it that way?\r\n\r\n\r\nJacob Becker (35:25.329)\r\nYeah, you got it. You got it.\r\n\r\n\r\nJacob Becker (35:44.497)\r\nI never articulated that. It just happened. It's just sometimes you're just so fast moving. And as an entrepreneur, you're just go, go, go, and I'm going to figure this out. And that's now I do. Now I can reflect and realize, wow, I literally owe it all. Even from the, from the video side of things, from the very first add on business, so to speak, was like, I was all driven by, cause we rank for anything you search for video in that city. Like we're coming, you know, so.\r\n\r\n\r\nnik (35:53.934)\r\nThank you.\r\n\r\n\r\nJacob Becker (36:14.193)\r\nSo no, in hindsight, now I can attribute it to that. And also I do know that going forward that any businesses now, but at the time, no, I didn't put it all together that way.\r\n\r\n\r\nnik (36:26.99)\r\nWell, and I see a lot of entrepreneurs too who are like me, I fall into this category many times. Chris, my business partner, we fall into the category where it's like, that seems interesting. I want to learn that and do that. that seems, this business seems interesting. I don't know anything about it, but how hard could it be? It's got $1 .5 million of seller discretionary earnings. And you're buying the business or you're attracted to the business because of the promise or because of what the potential upside is. And I think again, knowingly or unknowingly,\r\n\r\n\r\nyou've done this thing where you've decided to leverage your strength and folk and accelerate those businesses based on a skill set that you have in a business that you have that can be a creative day one. And I think it takes a level of maturity for most people to be okay with saying, Look, this is the thing that I'm good at. And I'm just going to double down on it. Because many of us are just distracted by other things. And it's anyways, it's admirable.\r\n\r\n\r\nJacob Becker (37:22.577)\r\nYeah, yeah, which is, well, thank you. Yeah, I appreciate that. And I'll make a point on this that I think is important. Well, you know, we tell this whole journey of my last, we'll call it about 13 years or so in this condensed little 30 minutes or whatever. And, but I want to make one thing clear that I think is relevant to anyone that would stumble across this is that even from the digital marketing standpoint,\r\n\r\n\r\nnik (37:31.31)\r\nThank you.\r\n\r\n\r\nJacob Becker (37:52.433)\r\nNone of that was an accident. I'm not saying anyone thinks it's an accident, but the point I want to make is the amount of hours that I put in watching videos, going to seminars, reading books, learning, learning this course, I'm going to get this, I'm going to do this, I'm going to become great at this. Like all to just become this incredibly seasoned digital marketer. And then even when I decided I was going to get into business buying and whatever you think of her, it just happened to be the first course I took, but I took\r\n\r\n\r\nCody Sanchez's course like four years ago because you know, she she found me on my and but the point after that is I watched that one. I remember I did a call with with her and her business partner because that was again she was not what she is now is that you know she did a call as part of the thing or whatever and ultimately it just as an example from there and then I just started studying buying businesses and it wasn't for two years after that that I officially got the first one or year and a half or so but.\r\n\r\n\r\nThe point I'm trying to make is whatever it is, you have to put in the time. All this stuff that we're talking about and it just didn't happen by accident, it was all like time and effort. And so...\r\n\r\n\r\nnik (39:01.998)\r\nYeah. I talked, I talked to somebody recently at her company and they said her husband is very good about reminding them when they're looking at businesses. Or he asked the question, is this a social media accelerated business? Right? Because she has a massive social media following. So she's not buying businesses that can't be accelerated by social media. and like just getting to the point where you've distilled a thesis.\r\n\r\n\r\nJacob Becker (39:27.345)\r\nRight, right.\r\n\r\n\r\nnik (39:32.494)\r\nis incredibly valuable and incredibly important. The other thing I would say is I talk to a lot of people who are buying their first business. And like you said, you spent all this time getting a skill, learning, going to school, getting experience. I worked in home health and hospice for 10 years before I bought my first business. And my first business was in healthcare. Why would I get all of this experience and then buy a doggy daycare? Right? For me,\r\n\r\n\r\nJacob Becker (39:36.369)\r\nYeah.\r\n\r\n\r\nJacob Becker (40:00.369)\r\nYeah, yeah, yeah, yeah, it doesn't make sense.\r\n\r\n\r\nnik (40:02.382)\r\nIt doesn't make any sense. Get the bag, secure the bag, earn your nut. Buy your business in an area that you have expertise and then you can expand out. That's that's totally fine, but go with what has gotten you here. Leverage that and then you can end up.\r\n\r\n\r\nJacob Becker (40:12.081)\r\nYeah. Yeah.\r\n\r\n\r\nYeah, yeah, yeah, totally, totally. Because you can build on it and there'll be more to come. It's not going to be the end of the, it's not like you have to stay in that industry, you know. But yeah, it's, it's cool. It's cool when you get to reflect on things.\r\n\r\n\r\nnik (40:29.934)\r\nOkay. I know you have a hard stop in two minutes. So I have two questions to ask you. I don't get to ask all my regular questions. But first question is, if you have a break in your day two hours, and no kids, no work, you don't have to do anything. What are you spending your time on? What are you obsessed right now with?\r\n\r\n\r\nJacob Becker (40:36.113)\r\nYeah, I'm good.\r\n\r\n\r\nJacob Becker (40:54.065)\r\nbreak in my day, I would go and look at the numbers of you're saying what could I, I would go and look at my companies. I go quick.\r\n\r\n\r\nnik (40:59.278)\r\nOK.\r\n\r\n\r\nWell, not even doesn't even have to be business, right? Like just what are you when you're when you allow your mind to drift and you have time. OK, say more.\r\n\r\n\r\nJacob Becker (41:10.193)\r\nSports. Sports. I enjoy sports. Yeah. Yeah. I watch everything. I watch, and not everything, but I'm interested in every sport. And so it's something that's been since I came out of the womb, just something I'm interested in. I watch, you name it. Like I'm up to date on pretty much every sport. So, yeah.\r\n\r\n\r\nnik (41:27.918)\r\nAwesome. Okay. Last question. What advice would you give yourself 10 years ago?\r\n\r\n\r\nJacob Becker (41:39.409)\r\nGosh, these are hard questions.\r\n\r\n\r\nJacob Becker (41:52.337)\r\nStay the course, keep doing what you're doing, believe in yourself. It doesn't happen overnight. But if you continue to apply yourself and learn and grow, and the key word there is grow, you need that growth mindset. You need to constantly be absorbing material and just getting better at your craft. It's like anything, just continuing to get better. And so,\r\n\r\n\r\nJust keep doing that and it will manifest into everything you ever wanted.\r\n\r\n\r\nnik (42:27.886)\r\nLove it man. Well, this has been fantastic. Jacob, where can people find you if they want to come learn more about you and your company?\r\n\r\n\r\nJacob Becker (42:35.153)\r\nI only do, I'm only on Twitter. So at success with Jake and that's a handle I made, whatever it was, back when this journey all started, because I do really, I didn't deserve to inspire people as much then, because I didn't really have much to, I didn't really prove I could do it, but I really enjoy inspiring people and helping young up and coming entrepreneurs because it can be so life changing.\r\n\r\n\r\nnik (43:02.446)\r\nLove it, Jacob. Thank you for being generous with your time, my friend. We'll talk soon. See ya.\r\n\r\n\r\nJacob Becker (43:06.801)\r\nThanks so much, Nick.",
  "metadata": {
    "duration": "",
    "date": "2024-08-12",
    "platform_source": "Google Drive"
  }
}