{
  "episode_number": "17",
  "episode_title": "How Meow Technologies Surpassed $1b in Assets on the Platform with Fewer Than 20 Employees with Brandon Arvanaghi",
  "guest_name": "Brandon Arvanaghi",
  "business_name": "Meow",
  "transcript": "﻿Welcome back to Nikonomics. I am super excited. I have Brandon Arvinagi here. He's the founder, CEO of meow. I think anybody who's been on social media or Twitter has definitely seen your company, Brandon.\r\n\r\n\r\nI'm going to be honest though. I had no idea what your company did.  And until Alex, the wedding venue guy explained it to me. So  if you could  just very briefly, what does your company do?  Yeah. Alex is great. And it's great to be here, by the way. Nick, thanks so much for having me. What we do at me out, we're a business banking FinTech. \r\n\r\n\r\nSo what does that mean? We're not a bank ourselves, but we basically found banks. We partner with banks. That are willing to pay high interest rates on operating accounts for businesses.  So we went to these banks and we were like, we can bring you folks, maybe a billion deposits, but to do so, you need to give us a really good rate for any customer, any business who onboards that in the out platform to get a business checking account through your bank.\r\n\r\n\r\nAnd they said, okay, let's see what you can do.  So that's the story. So when you'll get into a business checking account now. com website with one of our partner banks, you can expect a higher interest rate in the national average today. How do I get it conceptually, right? Like we park money with you and you're able to give us a higher interest rate on operating capital that's parked with you.\r\n\r\n\r\nSo it's the bank giving the rate, that's the important thing. So we're just like software skin. We're not the bank. We're not your counterparty. That's the nice thing. You get your own account number and routing number of the bank you choose. Now, the question is how that's the fundamental question.\r\n\r\n\r\nYou're exactly right.  So these banks are able to potentially pay a higher rate than the banks that are not Because they don't have to deal with things like customer support. They don't have to deal with things as much, right? They don't have to go to market for it, but we can help the onboarding smoother and that we're collecting the same information.\r\n\r\n\r\nSo this is a new age. Banks are very good at risk historically and like having their bank charter. FinTechs tech companies like us and meow, we're good at distribution. We're good at marketing. We're good at adding a software skin on top of it. So it's this really beautiful hand and glove relationship that allows us to do that.\r\n\r\n\r\nYeah. How does Meow compare to Mercury? So for example, I bring, I bank with Mercury, but from my understanding, Mercury's  kind of got a similar setup where they've got banking relationships and essentially they're just the skin. Like you said, the software skin that you're interfacing with those banks through.\r\n\r\n\r\nHow are Meow and Mercury similar? Are they different? Like,  how does that work? We're very similar in that we're both, neither of us are banks and we both partner with banks. So it's a very similar setup in that way. We have a comparison table on our site and Mercury is a great company, by the way. They pioneered a lot of.\r\n\r\n\r\nWhat we're seeing today where FinTech partners with a bank, they make a very smooth experience onboard to that bank partner. So hats off to them. We're very similar. And in that regard, they're definitely, there are definitely differences between us and there's comparison tables to speak to that. I guess what I don't understand is like, why wouldn't the banks just do this themselves?\r\n\r\n\r\nWhy does it, why do you need a third party software to overlay as a skin? Why wouldn't the banks just have developed the software?  Yeah, so banks run on cores and a lot of the software that they can use for their kind of front end is one size fits all and they might get the same update as a thousand other banks or 5, 000 other banks or 3, 000 other banks in a day.\r\n\r\n\r\nWhereas. Fintechs like ourselves, we are tech companies, we're technologists at heart and we can build to the next wave quicker. If we see something out there, we can build something quickly, like a skin around it on day one.  Again, banks are really good at risk, right? That's their bread and butter. And that's what we do as tech folks is bringing the other side to it.\r\n\r\n\r\nNow you think about a bank in Tennessee or a bank in, let's say, California or something like that.  Today, they're competing with Bank of America, JP Morgan. It's a global thing. When you got a bank account, maybe five, six years ago, 10 years ago, it might have been about where I can find the most ATM, ATMs around me, right?\r\n\r\n\r\nThe branches around me. Now we're a very national kind of competition. So for them, the smartest thing to do, in my opinion, is to partner with fintechs who can help them get that global reach to compete, to be able to compete, because there's a lot of banks in the U. S. and I think that's going to consolidate over time.\r\n\r\n\r\nWhere did this idea come from?  How did you come up with it?  I would just say we, this was not the initial idea.  Directionally. It was, we thought financial services were icky. We wanted to build a B2B suite. My, my co founders Midwest. I'm from Northern Virginia. So we wanted to eventually get to serving main street businesses.\r\n\r\n\r\nWhat was the original idea? We wanted to be able to build a B2B suite. We were, we were both at Gemini at the time. Um, so we wanted to build,  yeah.  Like a B2B suite. And one thing led to another, we raised a series A even for that  pivoted very aggressively. And then we made it easier for businesses to access T bills through our broker dealer partner.\r\n\r\n\r\nSo that was our idle cash. We were a treasury management company. Interesting. So you started as a web three. Or I shouldn't say you started as a web three company. Like your background was with web three because Gemini is a, or was a, are they still around? Did they get acquired? They're still around.\r\n\r\n\r\nThey're still around. Are they the ones that were backed by the Winklevoss twins? Correct. Okay. Yeah. You started with web three experience was originally a web three concept. Yeah, definitely. Our very first idea, I think it was like,  We were looking at like a DM or something like that. Remember the Facebook, Facebook had an idea of stable coin.\r\n\r\n\r\nYeah, it was a long, long, and yeah, one thing led to another. And we ended up becoming a treasury management company by making it easy for business by T bills through our broker dealer partner. We made a really intuitive UI. So what happened was we had 80 to 90 percent of businesses balances. And we were like, all right, how do we get the remaining 10%?\r\n\r\n\r\nBecause people want to do everything in one place. And we thought just being a treasury management company is For losers, because it's a nice step.  And anyone who actually powers the operating account in our opinion is the one that owns the customer relationship. You don't want to be the one that they like to flirt with or they check in on once every month.\r\n\r\n\r\nYou want to be the one that  gives you feedback every day, they're beating in the product, they're using every inch of it. And that's the operating account. So that's when we partnered with a bank to do that. So you were in treasury management with Gemini? Not with Gemini. No, but.  That was like now's wedge effectively.\r\n\r\n\r\nBut you were at Gemini and you're basically, well, I'm putting words in your mouth here. Were you at Gemini thinking we have all this cash? Where are we going to park it? Like it needs to be in treasury services or Gemini, you know, Gemini is already parking this cash. They could be doing this a better way.\r\n\r\n\r\nNo, here's our idea. No, I was a security engineer.  No. Oh, okay. Yeah. So I was an engineer and my co founder was an engineer, but we just, Would be ideating on things every day. We were just B2B founders at heart. We always wanted to start a company and Covid came around and that allowed no name people like us to raise fund funding for the first time and, and hire a team.\r\n\r\n\r\nWhere were you living? Where were you living at the time? So during Covid we did the Miami thing. We Okay. Started the company there. Is that where you were when you raised  Yes, when we did our pre-seed and seed.  Okay.  Walk me through that process because this is fascinating for me. I've bought a lot of businesses and sold a lot of businesses.\r\n\r\n\r\nI've been mainly in the SMB space. I've had some experience with private equity just because when you grow a small and medium business, that's typically who you sell to is a private equity group. That's rolling it up and then they take it up market and go public. But I don't have a lot of experience. In the VC space and it's just fascinating to me.\r\n\r\n\r\nI've always been like, I don't ever want to raise because then I'm giving away autonomy and freedom, et cetera. But walk me through the decision to raise what, like, why did you and your co founder think, Hey, let's raise, let's not bootstrap. That's very fair. All your assessments of it. And there's a huge trade off.\r\n\r\n\r\nA lot of people think when they raise it's game over. It's time to take  on Instagram. It's time to like flaunts and then their company's going to die in two years. Right. And you're not going to see a payout if you raise yourself best case for a decade, right? In my opinion, uh, for us, we did want to build up.\r\n\r\n\r\nWe wanted to build a product. We wanted to build something that could be a generational, like household name. And that was just like the phase of life that we were in.  So to do so, we needed really good engineering. We needed our best friends from different walks of life to join. That's really where the decision came from was because I couldn't convince them to work for free.\r\n\r\n\r\nProbably. So that, that led us to raise and  that was great that we had our closest friends to join the company early and start that, start the company there.  We're going to get back to the show in one minute, but I just wanted to tell you about today's sponsor, which is, uh, me. Oh, it's me. I'm sponsoring the show.\r\n\r\n\r\nYeah. Cause I'm doing this for free. Do me a favor, like, and subscribe right there, right at the bottom. Move your yep. It's right there. Yep. Awesome. Thank you. All right. So  again, I'm fascinated by this. I know nothing about it. Yep. In venture capital, what are the rounds you've got angel precede seed a B C or like our angel and precede the same?\r\n\r\n\r\nLike, what are the rounds and just briefly explain what they are? Yeah. So precede  and see, they get like mixed together. You can call it whatever you want. The first time you raise funding, you can call it either. You can get angel investors in both. Yeah, yeah. So precede and seed. First time you're raising money.\r\n\r\n\r\nLike, what are the typical sizes that you're, are you typically raising a million dollars? Is it like a hundred thousand dollars? I just have no idea. What are the ranges? Yeah, no, it's a great question. It depends on the funding and right environment and how sexy you are to VCs. So in 2021, a precede could have been like 5 million bucks and then you could have gone. \r\n\r\n\r\nYeah. And you could have gone out to market three months later with that product and extended it. Or pre seed extension or seed extension. But if you were in 2014, or like 2012, when only Mark Zuckerberg is like raising money, right? The pre seed might be like 200k or something like that. You know, it depends on the environment, yeah.\r\n\r\n\r\nBut it's It's tended to get bigger over time and the precede or the seed round. What does that money do? Are you a product markets fit in that round? Or is it like, I've got an idea, I need money to build it  again. Depends on the environment. So in 2021, you could have crapped in a box. And called it the next generation thing.\r\n\r\n\r\nAnd you could have probably raised,  honestly, you still see that to some extent, you could raise a hundred million AI now. And it's like, Oh, take my money. Exactly. Yeah. And to be clear, there's a lot of use cases for AI, and there's a lot of companies that  raise based on AI. If they put it at the front of their website, there's probably a reason for that.\r\n\r\n\r\nRight? Like they're, so yeah, it depends. I would argue that back in the days of Jeff Bezos, Mark Zuckerberg, et cetera,  That was like the cream rises raises. There was really intense diligence from investors. You'd really savage founders at the helm. Every dollar made sense. That's how companies probably should be built, but I'm, I can't be really wanting to talk.\r\n\r\n\r\nCause the only reason I was able to raise money was because of the 2021 environment in the first place. So, well, you raised, I mean, all right, so you've got the seed precede, you're raising your first round and you're like, all right, I gotta  have a product or an idea. I need money or funding to get to the next stage.\r\n\r\n\r\nWhat is a series a raise? What is that? Is that typically a company? It was like, all right, we've got product market fit. We just need gas to add to the fire. Or what do they typically look like it again? It depends. But when you're in a, you know, Depending on the environment, Series A either means you have product market fit and it's time to scale, or if it's a healthy environment, VCs might tell you, like a healthy fundraising environment, VCs might tell you that you can still graze on narrative at that point, or a bet, or  it's still in the conversation, some VCs will tell you that, some VCs will not tell you that, but when you get to B, that's like the next round, that's when you are, you know, your valuation is super high, it's a growth round, et cetera.\r\n\r\n\r\nThat's when it's, there's no more narrative. It's all about the numbers and a is about the numbers too, just to be clear. But some of them, some VCs tell you it's about narrative as well. So what rounds have you raised? You've raised a seed.  We've raised only. And yeah, so seed in series a seed in series. A when did you know you had 3 million to date? \r\n\r\n\r\nOh, awesome. Do you say three or 30,  30, three, zero.  30. Okay. That's another question I have when someone's, Oh, they raised a 30 million series a round. Does that mean the valuation was 30 million or does that mean they, they got 30 million in cash towards a hundred million dollars, whatever the valuation was  the latter.\r\n\r\n\r\nSo we were 22 million series a approximately.  Okay. And yeah, and we had a different valuation on top of that, but yeah, it's what you just described. What, when did you know you had product market fit and what did that feel like? It's a very good question because we, I think we thought we had product market fit going into the series.\r\n\r\n\r\nHey, it definitely seemed like it. Cause our growth is really strong, et cetera. Like our growth is strong going into it. Obviously that momentum was very important to getting the deal done, but then you like actually experience it, which is.  Feeling like you're getting pulled violently in a direction.  And that was post SVB.\r\n\r\n\r\nThat was a unique situation. Right. But since then, like we saw the inflows from SVB.  So billion come to the platform and in a matter of like maybe four weeks, that's a new billion, 500 million. Yes. Wow. Yes.  But post that it's been pretty consistent being pulled in a direction as opposed to having to do a little pushing yourself.\r\n\r\n\r\nWe still have to put our, put our foot on the pedal, so to speak, but  there's a pulling dynamic of customers like asking for this and customers telling their friends, which we're blessed for. So that's. I would say it was post series a, or we had real product market fit. Give me some numbers. How big is your company now? \r\n\r\n\r\nI know you can't share revenue, but is there a metric that you like to use to show just, Hey, we're, we've got this much of assets under management or head count, or I'm not sure customers. Yeah. So we're approximately 15 people and we're close. We're approaching  2 billion in assets on the platform across all of our entities.\r\n\r\n\r\nAnd you have 15 employees.  Yeah, approximately. Now, I'm quite proud of this. If you boil down the essence of meow into the stupidest, simplest kind of sentence, there's nothing innovative that we're doing. There's nothing innovative that we're doing. We're not a like pie in the sky. We're not like some like new idea from the ground up.\r\n\r\n\r\nWe are applying something very simple to a, to a gigantic industry. So financial services is 16 trillion market. We think financial services are a commodity. So to  hire a massive headcount and keep hiring and raise at a crazy valuation, like billion plus, and then hire a thousand more people.  And offer fundamentally what we consider as a commodity is a losing strategy, and it's not in the best interest of the customers, in our opinion.\r\n\r\n\r\nSo by keeping our cost structures very low, we believe that we can pass back better economics from our bank partners and win on volume  instead of on margin for what is fundamentally, in our opinion, a commodity.  Uh, it's like Amazon's approach to it, right? For the longest time, it was. Volume, not margin.\r\n\r\n\r\nAnd then all of a sudden the last five years or so has just been  a massive upswing. What do you mean? It's a commodity. Walk me through what that means to you. Well, we feel like if you get a business checking account somewhere, you're not going to.  It's not this crazy, complex software or some premium service in our opinion, right?\r\n\r\n\r\nThe relationship is valuable. We try to give a very good relationship to our customers as well. But you shouldn't be paying for that through the nose in our opinion, by way of, for example, not getting interest from that account. That's a very good example. Yeah. And you mentioned Amazon. We really like Costco.\r\n\r\n\r\nSo we're not affiliated with Costco. We can't make any definitive claims there, of course. But we really like their model. Costco, the CEO consistently says we're a volume business, not a margin business and doing Costco. If someone were to do Costco for financial services, that is an enormous opportunity in our opinion.\r\n\r\n\r\nAnd I don't think anyone has successfully or even tried that. In my opinion, I have not seen a company really try that yet. In your mind, what's the difference between saying Costco and Amazon? If I were to say, Oh, you guys are the Amazon of the finance space, or you guys are the Costco of the finance space.\r\n\r\n\r\nLike what? Why Costco? No, why not Amazon? I wouldn't. Yeah, I would. I think AWS is really the backbone of Amazon now. And that's it.  That business prints money. They make a lot of money on that. So yeah, that's good. But I think it's a great analogy though. I definitely agree.  So who's your ideal customer? Is it banks?\r\n\r\n\r\nIs it businesses? Is it retail? Who is your customer? Our customers, businesses in the U S. So we're a business banking fintech in the U S. Historically, we've served the startup market. We're very grateful for that market. We really want to serve the meat and potatoes of America, kind of the main street kind of real business as well.\r\n\r\n\r\nAnd we're growing aggressively in that market. Now we're, we're very excited about SMB Twitter, for example, uh, and folks there. And I think that's because of our backgrounds, not necessarily. Being born into the ecosystem, so to speak. Are you going to capital camp?  I was close. I was close. How do you only have 15 people on your team?\r\n\r\n\r\nThat is a very surprising number to hear. Most tech companies are raising, they've got big teams. They've got a lot of people working on disparate projects. You've got 15 people with 2 billion of assets under management. Talk me through your ethos and the structure.  Yeah, it's a great question. We're approaching 2 billion.\r\n\r\n\r\nWe're not quite there yet. It's a great question.  You would think that everyone at a company serves a purpose, but I think what the biggest alpha. Oh, that was savage. The biggest alpha break. I have my co founder Bryce and I have is that we worked at companies our whole lives before starting now. So we were cogs and machines.\r\n\r\n\r\nSo we actually understood how companies worked on the inside, because if we wanted to get something done, for example, we'd see the different committees that would have to go through and the people slowing it down and the useless people, the product perspective, for example.  So  we knew that,  uh,  you don't actually need a thousand people.\r\n\r\n\r\nIf you just keep it to the essential people and you don't hire the problem with hiring is that it's not just the people you hire, but then they hire people beneath them to promote themselves internally. And then those people, people beneath them. And then you have this runaway train where you have to raise money and you have to take it away from the customers.\r\n\r\n\r\nIn our opinion, you have to take away the economics from the customers. You have to tax them in some way for your hiring mistakes, in my opinion.  So that's the difference with us is we work with companies. If we say super lean, we take advantage of being super second mover.  We can do so. And we can try to always pass back the best economics possible to the customer. \r\n\r\n\r\nWell, I can tell you're passionate about it.  That's awesome. That's awesome. I'm very passionate. Yeah, that's no, it's fantastic. How do you currently get customers? Like, what does your customer funnel look like? Are you, yeah, I'll leave it open ended. Because we're a volume play and not a margin play, we don't make that much on any customer, right?\r\n\r\n\r\nUh, that means that we, it's very difficult for us to be sales led, like super sales led. What have, what we see a lot of FinTechs do, for example, is pay no interest or nominally, no, very little interest on the checking account from their partner bank. And they do all a huge sales led motion because they could feasibly be clipping four to five and a half percent on every customer that deposits into their partner bank's checking account. \r\n\r\n\r\nThat allows them to have a sales team, for example. Yeah, like a big sales team where they can give an enormous commissions to them. So we can't do that. That's hard for us. We have to say super lean because we're giving the customer the majority of the economics from our partner mix. So at first it was the, not quite the cold start problem, but we didn't have any customers.\r\n\r\n\r\nSo it was a lot of hand to hand combat. We had some of the angels we took money from. They had big Twitter audiences, so that was super helpful. When they would tweet about us, that gave us a wait list. Yeah. So, I dunno, like Saha Bloom or Packy McCormick. Mm-Hmm. or Austin, those folks. So they, they've been, oh, I didn't know that. \r\n\r\n\r\nThat was the beginning.  And our goal is really just to have as many customers as possible because when they, it, it has to be word of mouth trip. And thank God it's gotten to that point where people will just organically tell their friends. And I think the name Meow helps with that . 'cause you don't really forget it. \r\n\r\n\r\nI've had people forget my name a million times. They never have forgotten. Yeah, they're like, Oh, what's new again? How has me out? So that's okay. What made you pick it? Cause it is a very unique name.  So it's an S curve name. And the analogy I give is  yeah. So an S curve name is like the kind of name that like there's atmosphere when you start, but then when you get to the upper atmosphere, it's a. \r\n\r\n\r\nHuge compounding advantage. It's like kind of skating to where the puck is going. So the analogy I give is Steve jobs, ample, I promise at some point he heard no, one's going to use a company named Apple. No serious business professional is going to use a computer called Apple. You need a name like Microsoft or international business machine.\r\n\r\n\r\nYou know, you think about today, the compounding brand advantage Apple has against.  Brands like that. That's,  and it's just a happy name. It's just a very happy high ceiling. Okay. All right. That's a fair, that's a fair reason to choose a name. It sounds happy. Yeah. You're angel investors. So you have some big name Twitter people sell them against Sawhill bloom.\r\n\r\n\r\nDo you say Austin Reef?  Austin Reef, Hacking McCormick, Sawhill bloom. In some cases it's, it's like through their fund, but it's them. Um, sure. How have they been as angel investors? What is that process? Angel investors are some of the highest leverage people you can have on your cap table because here's how it works.\r\n\r\n\r\nIf you get a big name fund, like a BC fund on your cap table, they're not going to be super incentivized to actually like move mountains for you unless you're a big portion of their fund,  right? Unless you can materially affect their returns or unless they think that they can get a bigger bite of you at a future round,  right? \r\n\r\n\r\nThey're not the ones who are going to be the most helpful in most cases, but the angel investors, these are people, right? These are just people who you can call text. They've been operators in many cases. They have big answers. It's a lot easier to work with and they're great people. Thankfully. So yeah, their audiences were a big help to me.\r\n\r\n\r\nYeah. You know, saw his background, I believe was in investment banking. I can't remember exactly what it was, but something in finance. Was that why he was attracted to it? Or how did you get in? How did you get, let's say interested in investing in something like this?  I don't know. I think it was either Austin Reefer packing a corn make of like kind of the angels who started the train of deciding to come in.\r\n\r\n\r\nAnd I am, I think there's, they might share that there thing in this. And I don't remember what's all, we had just had a very good call and he was very decisive early and he's been an enormous help. He's an incredible guy as well. So I'm very lucky to work with him. All right. I got some rapid fire questions for you.\r\n\r\n\r\nLet's do it. Is that cool? I'm fired up. Yeah.  What do you love about this business?  I love that anyone can be a customer, like anyone, any business, so long as you pass your email checks. So that's great. Just pass your what checks? Just like onboarding checks, right? So long as you pass compliance requirements as a business, we can serve you in the U.\r\n\r\n\r\nS. Cool. What do you hate about this business?  Hate is a strong word, but there is, there's definitely a grass is greener environment dynamic of seeing like very high margin SaaS products, like enterprise sales, where they're pulling in like millions per deal. And it's, in my opinion, it's just as difficult to win a, the average small business.\r\n\r\n\r\nSo that's, it's a grass is greener dynamic for sure. But I  strongly prefer this on net  margins. Okay. Well, you stole my next question. You know, real estate guys typically look at business guys and they're like, Oh man, I wish I had the cash flow from those businesses. And then business guys look at real estate and they're like, man, I wish I had that asset that was just growing every single year.\r\n\r\n\r\nSteady Yeti. Not a lot to worry about. Everybody's jealous of everybody else.  As you sit and look, what are you the most jealous of? What businesses are you the most jealous of? I like our player just cause so the trade off of that Nick is that the TAM is enormous in financial services. So once you get to profitability and 16 trillion, that's the most exciting part.\r\n\r\n\r\nAnd that's the part that we get into in year five, six, but jealous in the short run, like, yeah, someone selling to a gigantic bank for Yeah, I'm not saying you're like, Oh, I'm jealous. I wish I was doing that instead of what I'm doing. But you look at people and you're like, man, that must be so nice to just have a customer base every single month, recurring revenue that, yeah, it's just natural for us to look at some of the banks.\r\n\r\n\r\nYeah, I would say that's the one that hits me.  Okay. Well, it keeps you up at night. What's on your mind in terms of, you Risks to your business right now. I would say like maintaining the same level of quality that we have in terms of customer support, as we scale to 10, 000 businesses and 20, 000, that's something that I focus on. \r\n\r\n\r\nOkay. And what are you obsessed with right now?  I'm pretty maniacal about our costs. Like I fight every single one of our vendors. And when we deal with a software vendor, it's the worst. Cause it's all margin. They're going to hand wave all margin for them. So I know that they'll do the deal. If it's a thousand dollars versus 20, 000, it's just, it's a gravy for them.\r\n\r\n\r\nRight? So what I'm obsessed with is getting those down so I can pass back. Yeah. The economics of the custom. Is there anything non business related that you're obsessed with right now? Like non meow related.  I watched the three body problem on Netflix. Have you seen that? No. What is that? Oh, man. It's really good.\r\n\r\n\r\nIt's a, it's like a sci fi show and I just, I've never been so captivated by a plot in my life. So I can't wait for the next season. It's a three body problem. Yeah. All right. All right. I'm gonna take a look at it. How old are you by the way? You like sci fi? I just turned 30.  30. Okay. I love sci fi. Okay.\r\n\r\n\r\nGreat. Yeah. Yeah. Frigging love sci fi. All right.  I, I've never asked this question, but I'm going to ask it  to you.  Chris and I own a company that sells mining rigs  that, so we mine or we don't mine, excuse me, our customers, mine crypto, and then we sell them the rigs. We used to sell the hosting as well, but we don't sell hosting anymore.\r\n\r\n\r\nSo I love crypto. I wouldn't say I am diehard believer in crypto, but I believe it has a place. I believe it's here to stay. I think there's a lot of things about the technology that are very valuable.  You worked at Gemini. You're in the financial services.  What do you think is going to be the biggest and best use case of  cryptocurrency crypto technology? \r\n\r\n\r\nYeah, that's a great question. Historically, product market fit from crypto has been speculation, right? So Coinbase speculate on assets, OpenSea was speculate on NFTs, et cetera. So a casino in a lot of ways, right? And then stable coins are true product market fit. That's a real use case, dollar backed stable coins, not like the nonsense, like algorithmic ones or The ones that are uncollateralized.\r\n\r\n\r\nSo USDC is serving in a gigantic need. That's clear cut. That's going to dominate. I think it's only going to grow like the stable coin market. Bitcoin. I'm a personal believer in, I think in a world excess, there's only one asset in my opinion that has like a fixed supply. So hard stop there. That's all I need to know about it.\r\n\r\n\r\nPersonally, it's not financial advice. So I would say that your value thesis and the stable coin. How about you, by the way? I'll answer that in a second. When did you get into Bitcoin? When I, I was speaking at a security conference. Yes. And like 2017 and the Winklevoss twins were at that conference, a friend introduced us and that's how I got to Gemini and that's when I learned about Bitcoin for the first time. \r\n\r\n\r\nThat's right, man. Yeah. What do I think? I think the biggest use case, in my opinion, from cryptocurrency is going to be blockchain technology specifically as it relates to artificial intelligence and being able to divine provenance of either works. So if you're putting out a video, if you're putting out art, if you're putting out any type of content, the ability to market and say. \r\n\r\n\r\nThis is, you know, Nicholas Lusky, or this is Brandon Armanaghi's work, and you can go back and audit it through the blockchain or just as the open ledger for other types of transactions. Especially again, especially as it relates to artificial intelligence. And I think that Bitcoin itself will be a really good store of value.\r\n\r\n\r\nI, like you said, it's a finite resource, similar to gold or silver. There's an actual commodity element to it. So I think it'll, I think Bitcoin will continue to stick around. I don't think the other coins have the same type of staying power. Ethereum to me just because people are building on top of those networks.\r\n\r\n\r\nBut the only coin I own, the only coins I own right now are Bitcoin and Solana. I'm not, I've never been a speculator. I've never gone and tried to trade that stuff. Cause I, like you said, it's just the casino.  Yep. No, you're a hundred percent right there. So yeah, I stick to the OG.  That's awesome. That's awesome.\r\n\r\n\r\nThat makes sense. This was fantastic, man. Where can people find you if they want to either get ahold of you or just learn more about meow? Yeah, just go to meow. com. I'm very proud. We got the. com by the way. It was not an easy journey. That was like the last thing. Yeah. Yeah. Can you, can you share  how much was it?\r\n\r\n\r\nI mean, meow. com four letters. Yeah, I cannot, uh, I can't, unfortunately, but yeah, that was not easy. We got the X handle as well. The YouTube handle, this was a journey. It was like collecting the infinity stones. Yeah. I would rather try to find the dragon ball for my fight. But you like fight everyone for them.\r\n\r\n\r\nOh my gosh. Then do not wish this upon. Maybe my worst enemy. Yeah. But I don't wish this upon the average entrepreneur to try to find these get assets, get brands dominance. No, the. com is incredibly important. It's four letters took Chris and I bought co founders. com for 65, 65, 000. And we were like, it's one word.\r\n\r\n\r\nIt's a good name. It's a good brand. Sawhill and Nick Huber just recently launched virtual assisting companies. And Huber just bought somewhere. com  and I'm like, yeah, I'm not a fan of the name of somewhere. com for his specific business, but. I get it. It's one word. It's memorable. It's short. That was not a cheap domain.\r\n\r\n\r\nDomains are still important.  Yeah. I'm a domain nerd. And I think, yeah, it's like digital, it's like beachfront real estate when you have a good one, right? Or like real estate in Manhattan. So it's only gonna get more valuable in my opinion. Totally. I totally agree. All right, man. Well, this was fantastic. I hope you have a good weekend.\r\n\r\n\r\nI'll tell people to check you out on, on Twitter and we'll talk soon. Thanks. Thanks. Such a pleasure.",
  "metadata": {
    "duration": "",
    "date": "2024-06-11",
    "platform_source": "Google Drive"
  }
}