{
  "episode_number": "234",
  "episode_title": "Make $10,000 in 30 days with Sponsorships with Justin Moore",
  "guest_name": "Justin Moore",
  "business_name": "Sponsor Magnet",
  "transcript": "﻿Nikolas Hulewsky (00:00.942)\r\nOkay. Justin Moore, I have been honestly really excited for this conversation for over a month. For those who don't know, Justin is not just a content creator. He is a master marketer who has also turned into a content creator and his sponsorship formula. You can see here back this book it's called sponsor magnet is incredible. He's helped over 1500 people as content creators land over $3,000 a piece sponsorship deals.\r\n\r\n\r\nHe's built a $600,000 business a year that they're doing just in coaching. He's closed over $5 million in deals personally. The dude is legit and he is here today to talk to me one about how to grow a brand, how to monetize a brand. I'm going to edit this by the way, Justin, cause it's not coming out the way that I wanted it to come out. But, we're to do three things today that I'm stoked about. If you're an entrepreneur and you're like, the content creator, shut your mouth, listen to this episode because you're going to learn a, how do you utilize\r\n\r\n\r\nunder leverage distribution channels that you already have access to. It could be a customer list. It could be people who you've served in the past. Maybe you just have their addresses. It could be anything that allows you to effectuate distribution. Number two, how do you partner with content creators? want to advertise and market on Instagram and Facebook and TikTok. How do you do that? What does the scope of work look like? Who should you be looking for? How do you know who to pick? And then number three, Justin's going to walk me through step by step how I can monetize.\r\n\r\n\r\nand get a sponsorship of $10,000 in the next 30 days. And he has promised me that it's a guarantee going to happen. So I'm freaking locked in. I'm excited. Justin, what did I miss?\r\n\r\n\r\nJustin Moore (01:32.116)\r\nyou\r\n\r\n\r\nJustin Moore (01:37.95)\r\nDude, no, I'm stoked, man. My favorite part is using you as a guinea pig and getting you to your first 10 grand. I think that's gonna be a blast.\r\n\r\n\r\nNikolas Hulewsky (01:46.222)\r\nIt's going to be amazing. Well, the really cool thing is you have a ton of corporate experience. You've done marketing and brand management on the corporate side of things. Then obviously you got into the creator business. Walk me through what was life like as a W2 employee? When did you make the switch?\r\n\r\n\r\nJustin Moore (02:02.9)\r\nDude. So I was very much not doing this. I was not in this industry at all. I was in medical devices, actually, in product management. My background's in computer engineering. So coming out of school, I was like an applications engineer for, yeah, in health care. And yeah, total nerd alert, Although for a little bit of street cred, I wasn't a metal band in high school. So let's just let's just be clear here. Yeah. But what? Yeah, Emo's not dead at all, dude.\r\n\r\n\r\nNikolas Hulewsky (02:18.787)\r\nNerd.\r\n\r\n\r\nNikolas Hulewsky (02:29.238)\r\nEmo's not dead.\r\n\r\n\r\nJustin Moore (02:33.227)\r\nUm, like what happened was my wife, April started a YouTube channel in 2009. She wasn't my wife at the time. She was my, my girlfriend. Um, but, uh, like it was very much a side hobby. Like you really could not make money on YouTube in those early days. Like there, the partner program had just started where, know, where you were making a cut of the AdSense revenue on your YouTube videos. Like that was still very, right. And was application only at that time, right? It wasn't like you just got in if you had a certain, um, criteria. So for a long time,\r\n\r\n\r\nBrands would reach out offering to send her free stuff. So it wasn't like, hey, we'll pay you a bunch of money. was like, hey, you want this free hair curler? Because she was talking about beauty and lifestyle and all that. And so essentially what happened is for years she was just accepting the free stuff. This is awesome. We were in our early 20s, no money, living in a studio, doing that whole thing. It was the free stuff. And then I decided to go back to school to get my MBA at night after work. And I started taking these classes all around advertising and marketing and negotiation. And just kind of the gear started turning, dude.\r\n\r\n\r\nwhere I was like, her videos are riddled with hundreds of comments of saying, hey, April, thank you so much for telling me about this brand. I just went out and bought it. Or, oh, I just went to their website and picked it up. Thanks so much. And I went to my wife one day. was like, I really feel like we're getting the short end of the stick here. a $30 hair curler for free is not adequate compensation for the value you're providing to these brands. And so sure enough, the next brand, I said, let's email them. I hey, do you have a budget? Can you compensate me to talk about you?\r\n\r\n\r\nNikolas Hulewsky (03:47.672)\r\nHahaha\r\n\r\n\r\nJustin Moore (04:01.876)\r\nAnd she was like, there's no way this is going to work. said, come on, let's just try it. So the next brand that reached out, sure enough, we said, hey, do you have a budget to work with her? And they said, oh, yeah, if you could talk about us in two videos a month, we will pay you $700 monthly. And dude, our minds were blown because that was like most of our rent at the time. And so our immediate first thought was like, how do we find 10 more brands just like this? Right. We were living in Southern California in Torrance.\r\n\r\n\r\nNikolas Hulewsky (04:24.654)\r\nWhere were you living?\r\n\r\n\r\nJustin Moore (04:29.428)\r\nwhich is like in the South Bay. Yeah. Yeah. Yeah. Yeah. I'm a Bruin, dude. I'm a Bruin. Yeah, dude. Yeah. Yeah, we had that connection. I'm a Bruin for undergrad and I went to Pepperdine for my MBA. Yeah. Yeah. Yeah. Yeah. Yeah. so like literally this is what this. OK, so for those of you listening or watching, I bet you can relate with this moment where it was like.\r\n\r\n\r\nNikolas Hulewsky (04:32.269)\r\nDude, I went to USC and UCLA.\r\n\r\n\r\nWhat? my gosh, that's awesome. Okay, I didn't know that. I didn't know you were down in torrents.\r\n\r\n\r\nNikolas Hulewsky (04:44.782)\r\nDude, Pepper Tad and soap, anyways, that's amazing. Okay, so rent wasn't cheap. You were making $700 a month.\r\n\r\n\r\nJustin Moore (04:59.314)\r\nThe very first taste of side hustle income that we got was like, wow, there's ways to make money in this world that don't rely on a nine to five paycheck. And it's kind of uncapped. If we could find 10 more people like this, why couldn't we make 10 times as much money? And so this is what ultimately led us down the road of doing.\r\n\r\n\r\nNikolas Hulewsky (05:11.203)\r\nYeah.\r\n\r\n\r\nJustin Moore (05:23.476)\r\nyou know, over $5 million worth of deals that that's 600 individual sponsorships with brands over the last, you 15 years. And then I also along that path decided like, hey, we actually have a really interesting skill set here of working with brands and understanding, you know, how to actually achieve results for these brands. And so I decided to start an influencer marketing agency where I went out there and got deals for other creators at this time. So I learned a whole new set of skills of like actually doing prospecting and reaching out to\r\n\r\n\r\nbrands and being in the boardrooms with these, you know, they're saying, Hey, we want to spend a million dollars now across 200 partners, not just the you April and Justin 10 K or whatever million dollars. Hey, what should the strategy be? And so ran that business for seven years, paid out millions of dollars to other people. And so this was really my perspective is like, I've been on both sides of it. And over the last five years, starting to building this business, educating creators, this is really where this perspective has come from.\r\n\r\n\r\nNikolas Hulewsky (05:53.782)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (06:19.32)\r\nWell, to give people some perspective, two things. The first thing I'll say is, do you know what a company spent on social media influencer marketing in 2024?\r\n\r\n\r\nJustin Moore (06:30.196)\r\nI'm gonna go, I know that the Goldman Sachs study said it was around 280 billion in 2023 and then it was supposed to grow from there.\r\n\r\n\r\nNikolas Hulewsky (06:36.965)\r\nOkay, so that was a worldwide number. This is supposedly United States, $24 billion in 2024. This year it's estimated to be $32 billion. So like a 30 % jump year over year. So people are spending, marketing dollars are moving here. They're shifting here really, really quickly, which I think is fascinating. But the earlier point that you said, which dude, I just love your comment, is this.\r\n\r\n\r\nJustin Moore (06:40.562)\r\nRight. Okay, just US.\r\n\r\n\r\nNikolas Hulewsky (07:05.814)\r\nSomebody posted this earlier this morning that I saw and it was about entrepreneurship. here it is. So this guy saw somebody on Twitter who was reselling, auctions. Like it's like Costco was like liquidating whatever, and they bought some stuff and then they resell it. I don't really know how it works, but someone's making money. So he decided I'm going to start doing it. And he posts and he's like, Hey, I know it's not that much, but\r\n\r\n\r\nHere's what I just started doing it. I still work full time. I started doing this. And in September, he's already made $2,500 in profit, right? And he kind of had that unlock moment where he was like, my gosh, I think I can make real money at this. And he and I were DMing earlier today. And he's like, in the process of kind of going full time with this, you had that same moment where you realize like, crap, I can make real money with this. At the at the time, did you think I'm going to systematize this?\r\n\r\n\r\nJustin Moore (07:53.747)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (08:02.508)\r\nOr did that kind of just come later through trial and error?\r\n\r\n\r\nJustin Moore (08:05.822)\r\nYou know, I think that we had to be very intentional about how we decide, because it very much was a goal early on that we saw the potential. We was like, OK, there's money here. There's consistent money here. We can diversify our revenue in several different ways from building these assets on the internet. But as with most entrepreneurs, when you're trying to convert your side hustle into a full-time thing, you kind of have to be a bit intentional, or you should be intentional, and not just quit and be like, all right, YOLO, let's make this happen. I'll figure it out.\r\n\r\n\r\nNikolas Hulewsky (08:32.363)\r\nYeah.\r\n\r\n\r\nJustin Moore (08:35.614)\r\nFor us, was like, you we were building a family. So my wife was pregnant and I was like, okay, I would love to get my job to pay for the birth at the hospital bill and all that. like, let's, actually, and so basically she quit to do, you know, social media full time in 2012, but I critically kept my job for several years because we basically, we had this, we picked this number dude. was like, okay, in order for me to also quit, we need to make,\r\n\r\n\r\nNikolas Hulewsky (08:51.438)\r\nWow.\r\n\r\n\r\nJustin Moore (09:05.236)\r\n$10,000 more per month above my full-time salary. So we wanted like a buffer. So we needed to replace my salary plus 10K a month. And that was the number. And we said, OK, once we hit that number, if we hit that number, I have to quit. Because otherwise, I'm never going to quit. Because when you still have the job, it's all fun money. It's all extra money. It's all like, this is great. It's awesome. But like, when you quit, it's like, OK.\r\n\r\n\r\nNikolas Hulewsky (09:28.12)\r\nYeah.\r\n\r\n\r\nJustin Moore (09:31.784)\r\nGame funds over now like this is this legit now we're all the eggs are in the same basket. Both my wife and I were all doing this thing now and so we were very intentional about about systematizing and process creating a process around what we were doing because we knew that there were stakes like I'm going we're going to quit. We're both going to quit and do this full time and so we can't mess around here.\r\n\r\n\r\nNikolas Hulewsky (09:53.432)\r\nI think it's really interesting that social media audience building is becoming more and more of a business. I tell founders this all the time. Companies like Uber, Facebook, when they started up, they raised a bunch of money. They raised billions of dollars. And what's interesting is, do you know what half of those dollars were spent on? Let's say Uber, for example. What were half of the dollars they raised spent on? Yes, of course there was engineering and there was the employees and there was building out the management team, et cetera.\r\n\r\n\r\nHalf of their dollars were spent on Google and acquiring customers. They were building a marketplace, like they had to get buyers and sellers to come together through Uber. So they had to pay per click and find people to educate about Uber. Half of the dollars, billions of dollars were spent on acquiring customers. Social media, having an audience, that is just another form of distribution. You can now reach people in a much easier way than you ever have been able to in the past. In fact, we're seeing that\r\n\r\n\r\nLike the customer acquisition costs or the ROI on those expenditures is way higher in the social media realm than it is in other realms. so more and more people are like getting wise to it. And then you see people like Alex Hormozi or Cody Sanchez who are actually launching businesses on the back of their audiences. It's pretty genius because now they're figuring out a way to leverage this underutilized distribution channel. So if you're a founder, you're an entrepreneur and you're kind of like, I don't really understand the content side of it. Just think of it as distribution. This is just another distribution channel.\r\n\r\n\r\nand you need to figure out a way to leverage it. you started, like 2012 just seems crazy to me that you were doing this.\r\n\r\n\r\nJustin Moore (11:25.47)\r\nDude, well, have like a very, maybe a hot take on this, which is that building a personal brand and building organic distribution is gonna be the last moat in the age of AI. Pretty much anything can be duplicated and replicated very, very easily. But if you have a following, if you have people who trust and believe in what you say,\r\n\r\n\r\nNikolas Hulewsky (11:31.022)\r\nMmm.\r\n\r\n\r\nJustin Moore (11:55.102)\r\nlike they will buy it from you if you build trust in that way. And so if you're a founder or entrepreneur listening to this and be like, why should I care about this? It's because your lunch is gonna get eaten unless you have distribution in this way.\r\n\r\n\r\nNikolas Hulewsky (12:08.578)\r\nYep. And that's why you see so many brands now that are founder led brands. It doesn't matter that it's, I'm building a SaaS company that helps with hotel reservations in a certain market. You're you need to be a founder led brand. If you want to attract good talent, if you want to have a good distribution channel, if you want to have opportunities to either have investment or sell your business, having a personal brand is, definitely, I totally agree with you. think it is also the last moat because of that trust factor in it. Okay. Let's pivot just a little bit now. So for\r\n\r\n\r\nbusiness owners, entrepreneurs, you have this method called the rope method. Can you talk about like over time how you've developed this rope method and what that is?\r\n\r\n\r\nJustin Moore (12:47.186)\r\nYeah, so I'll quickly define it and then I'll talk about how it can apply to you and your business as a founder or entrepreneur. So this framework is something that I've developed over many years to essentially do outbound pitching or even inbound pitching. It's a formula essentially to ensure that whatever you're proposing to this partner, whether it's a brand, a company, whatever.\r\n\r\n\r\nis compelling and that there they'd be interested in moving forward and discussing like a compensated partnership with you. So R stands for relevant, meaning that your pitch has to be relevant to a campaign that the brand is either currently running or has run in the past. O stands for organic, meaning that you can tie your pitch back to organic work that you've already published that illustrates that your audience has existing affinity for their brand or their product.\r\n\r\n\r\nP stands for proof, so you can show how you've helped others achieve results. And E stands for easy to execute. When they say, hey, yeah, this is actually kind of interesting. What did you have in mind? And so a lot of people have told me that actually this is just a, this is a sales formula. It's not just like about pitching brands. It's very much just about like, do you craft something where the brand understands or the partner understands what's in it for them?\r\n\r\n\r\nNikolas Hulewsky (13:57.027)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (14:03.788)\r\nThat's the reason I was listening to your book and the minute you explained it, was like, holy crap, that's for any business owner. If you have a list of previous customers or you have a list of potential customers, you have to craft that good first email and it has to be, like you said, are relevant. Why are you emailing them? What's the message that you're trying to communicate? What was the O?\r\n\r\n\r\nJustin Moore (14:27.269)\r\nO is organic, so you can tie it back to something that ensures that you have, that it's clear that your audience has existing affinity for the brand.\r\n\r\n\r\nNikolas Hulewsky (14:35.598)\r\nWhen you developed this, you in at Pepperdine or was it like years later that you're like, you know what? I need something that sounds cool. I'm going to just say rope because these are the cool.\r\n\r\n\r\nJustin Moore (14:44.838)\r\nYeah, no, this was this was in the last five years. Actually, I never named I never named the acronym until I started teaching people because I was just like, this is just what we do. This is our process. And like this is how we do our pitches and everything. But when I started, honestly, when I started doing one on one coaching, that's when I started to codify a lot of the methodologies that I had, because I was just like, like I'm trying to really it was I was trying to prove to myself that this is a repeatable thing, not just something that works for us. And so that's why I started doing the one on one coaching first.\r\n\r\n\r\nNikolas Hulewsky (14:47.853)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (15:00.814)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (15:10.251)\r\nD\r\n\r\n\r\nDo you think the rope could you make that into like an AI prompt where you're like, Hey, I want to do this cold outreach. Make sure that it follows the rope method in my messaging. And these are the kinds of the points that I want to hit on. Like, are you using it like that? You know,\r\n\r\n\r\nJustin Moore (15:24.944)\r\nI mean, I do, we have tooling in our coaching program that helps people with that. Yeah.\r\n\r\n\r\nNikolas Hulewsky (15:29.302)\r\nReally? When you say tooling, you mean AI tooling? Like you've created your own GPTs or what?\r\n\r\n\r\nJustin Moore (15:33.632)\r\nYeah, no, it's not a GP. I mean, it uses GPT and it uses perplexity and chat GPT and Claude and everything. But it's much more robust than that. It's we have our own tooling that helps do the research for you about what these brands are, what campaigns they're running. So we go and look at their. Yeah, perplexity is like a big one for the research part of it. Actually, chat GPT and even Claude are getting pretty good at the research part, too. So we're just playing with different tooling depending on the model. But yeah, we're really.\r\n\r\n\r\nNikolas Hulewsky (15:37.966)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (15:48.718)\r\nIs that why you're using Ploproxity?\r\n\r\n\r\nJustin Moore (16:02.036)\r\ntrying to develop kind of like micro-SAS to help our students with a lot of this type of stuff. It's pretty cool.\r\n\r\n\r\nNikolas Hulewsky (16:08.226)\r\nWell, it's interesting. Most business owners think of like, I'm getting leads. I'm getting business. I have to get new business, new business, new business. And so like water's going into the bucket. I to fill up this bucket. And there's this massive hole on the underside of the bucket where the water just continues to leak out. And those are customers who you've either had or service and you're losing them and you're not retaining them, whatever the reason is. If you can focus on either reselling to those customers who you've already purchased from you or keeping the customers who are already currently customers of you. All of a sudden you're going to see your revenue jump just because\r\n\r\n\r\nYour churn is lowering and a lot of it has to do with that, messaging, how you're staying in touch with them, how you're making sure you're on the same page with things. And so for me, when I was like looking at the rope method, I'm like, this is, this would be a perfect method for people to implement within their businesses.\r\n\r\n\r\nJustin Moore (16:49.278)\r\nYou know, I mean, yeah, you know, I think that like this was really at the top of mind for me when I grew this new business, this coaching business, because by the way, wasn't it was not a true coaching business when I started. It was a course business. So really what most people know me for is a cohort based course that I taught for about four years called Brandeel Wizard. And it was like a boot camp type sprint. was a four week program where I took you, you know, aid it like A to Z. Like I'm going to teach you everything that I know about how to\r\n\r\n\r\nNikolas Hulewsky (17:01.88)\r\nMm.\r\n\r\n\r\nJustin Moore (17:18.932)\r\ncreate a sponsorship system. And I put hundreds and hundreds of students through that program. And essentially what happened was that I had no coaching program, I had no ongoing support. And people would go through the program, they would learn a lot, but then they would come back like two months later and be like, Justin, I learned a lot, but this brand just emailed me yesterday and I, this is a little new, there's a little different, they want this or this, and I don't know what to say to that. I know how much to charge for that. And so the ongoing support aspect,\r\n\r\n\r\ncoaching program, which is what my business has shifted into, really came naturally from just like listening to my customers. And I think that's an important insight is that like, I thought the business is going to be one thing. But really, over time, my customers started saying, actually, that was great. But like, we really actually want to pay you on an ongoing basis on a recurring basis to provide support, you know, forever, basically.\r\n\r\n\r\nNikolas Hulewsky (17:58.606)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (18:10.702)\r\nWhat have you seen from the flip side? Like, obviously you're working with creators who want to partner with brands and they want to get sponsorships and who wouldn't want to do those things. The flip side though is as the businesses, what are some of the biggest mistakes that businesses make when they're looking for partners to sponsor either?\r\n\r\n\r\nJustin Moore (18:27.198)\r\nI mean, the number one mistake is not having clarity around what your objectives are when you work with influencers. A lot of people think, I should be doing influencer marketing, or my competitors are doing it, or this other DTC brand, they're crushing it. I see these threads on X of how they're crushing it with, you know, UGC creators, whatever, right? You see these threads. And they just say, OK, let's allocate some sort of sample or test budget.\r\n\r\n\r\nNikolas Hulewsky (18:40.451)\r\nMm-hmm.\r\n\r\n\r\nJustin Moore (18:54.91)\r\nto working with creators. So two, first mistake, not understanding what the objectives are, right? What am I actually trying to accomplish? But then the other one is like not really devoting not enough time or resources or a large enough sample size of a budget or creators to work with to really give this the old college try and really actually determine is influencer marketing gonna work for us or not? A lot of brands do this is they will devote 10 grand.\r\n\r\n\r\nNikolas Hulewsky (18:59.202)\r\nMm-hmm.\r\n\r\n\r\nJustin Moore (19:22.484)\r\n15 grand, 25 grand, even 50 grand to trying influencer marketing. And then they hire, you know, five, 10 people. They go back and they analyze the numbers and they're like, hey, but this didn't generate a bunch of sales, right? Because mistakenly, a lot of people are looking at influencers as like purely bottom of funnel conversion focused tactic, right? They're looking, okay, if I could spend this 50 grand on Facebook ads, I should be able to generate a 2X ROAS or, you know, return on ad spend or whatever. So this should generate a hundred grand.\r\n\r\n\r\nNikolas Hulewsky (19:47.726)\r\nMm.\r\n\r\n\r\nJustin Moore (19:50.28)\r\nThat's really not the right way to look at creators. Creators are really actually full funnel, right? They can help build awareness, right? They can help build consideration. You can actually get assets from them to repurpose, to use as creative in other ways. Put it on your website. And then, yeah, they can help drive conversions. But if you're looking at it from a very myopic standpoint of like, all they're going to I'm just going to look at them exactly as I would like a Facebook ad or something.\r\n\r\n\r\nNikolas Hulewsky (20:05.101)\r\nThat's interesting.\r\n\r\n\r\nMm.\r\n\r\n\r\nJustin Moore (20:19.58)\r\nIf it's a piece of banking software or something, is that a, can you look at that? Like, man, I hired this creator and only five, you one person filled out an application for our bank. No, that takes a while to like, for them to talk about it, you know, build up awareness about your product. And ultimately they may choose to sign up for your, for your, you know, bank, you know, six months after hearing it on, this podcast, right? And so, and so I think, I think it's like, you have to, look, it's another marketing channel, but you can't.\r\n\r\n\r\nNikolas Hulewsky (20:42.604)\r\nYeah, yeah.\r\n\r\n\r\nJustin Moore (20:48.532)\r\nYou have to be a bit more thoughtful about how you utilize it.\r\n\r\n\r\nNikolas Hulewsky (20:51.022)\r\nHow do you know whether not social media or content marketing is going to actually do well for your business?\r\n\r\n\r\nJustin Moore (20:59.22)\r\nYou have to test it, just like any other marketing channel. You have to decide, OK, what are we trying to accomplish? is the, if, first of all, identifying our ICP, our ideal customer persona, who, we have a hypothesis behind the fact that we think our customers are listening to influencers or listening to creators in this psychographic, demographic, whatever. So how can we go out there and identify the most influential people in this subset?\r\n\r\n\r\nNikolas Hulewsky (21:00.771)\r\nTest it.\r\n\r\n\r\nNikolas Hulewsky (21:05.326)\r\nMm-hmm.\r\n\r\n\r\nJustin Moore (21:28.978)\r\nof this persona we're trying to test and testing multiple of these people because sometimes some people might resonate more than others or the messaging wasn't resonant and we need to workshop it with them, right?\r\n\r\n\r\nNikolas Hulewsky (21:38.99)\r\nHow do they do that? it is funny with how many businesses I've talked to and work with, you would be amazed at how many of them don't actually know who their ideal customer is. They don't actually know like who they're trying to market to. But so there is a process they have to go through to like identify, yeah, who are we selling to? How do you do it?\r\n\r\n\r\nJustin Moore (21:57.734)\r\nYeah. I mean, this is a real tall question. I mean, you probably either need to hire someone who has the strategic chops to help you get there. If we're talking tactically, there are either people you can hire on a consultancy basis or hire an influencer marketing manager on your team. If you think you want to work with creators as a major part of your tactic, like\r\n\r\n\r\nNikolas Hulewsky (22:01.038)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (22:20.852)\r\nthat's interesting.\r\n\r\n\r\nJustin Moore (22:23.86)\r\nhire someone who's been around the block and done this for another brand in a similar category as you, or in the same category as you, who really understands this stuff. If they're good, they can help you arrive at this idea. I think the question you're asking, though, is broader, is not just about influencers. It's just about how do you identify your ICP? That's a much larger question.\r\n\r\n\r\nNikolas Hulewsky (22:40.59)\r\nYeah, yeah. I, yeah, well, yeah, that's a, that's a question for another podcast. I liked a lot of the advice you have, which is like, do a survey. Many business owners don't even do a survey. They don't even ask like, how did you hear about us or why are you here? They think, oh, I opened a bakery and so people are coming to me for the donuts, but really they're coming because they like, I don't know, you have like the specialty coffee that you make. So if you don't ask the question, you don't actually know what your customers are coming there for.\r\n\r\n\r\nJustin Moore (23:01.876)\r\nHmm.\r\n\r\n\r\nWell, tying back to something you said earlier in the episode around like, hey, like a lot of these businesses, they've got customer lists. They've got email lists of these people who purchase. They may not be sending a regular newsletter or a regular digest to those customers. Number one piece of advice, start. Start today. Start emailing them and understanding what's going on in their lives. And to your point, yeah, doing these surveys can be super powerful. Here's a quick example. So I am a business. I have customers who are creators that I'm coaching, right?\r\n\r\n\r\nAnd I am surveying the heck out of them because I want to know, for example, what are their biggest challenges? What are their biggest pain points? What's keeping them up at night? And I use those answers to customize and personalize the content that I sent to them. For example, if someone tells me that like the main question that I care about, really, I ask a bunch of questions, but the main one I care about is what is your biggest goal right now as a creator for this year? Like, what's your goal?\r\n\r\n\r\nand people, and I have a bunch of different questions that you ask, but like, if someone says quitting my nine to five job, that's the goal. This year's I want to quit and do this full time. When I market my products to them, my courses, my boot camps, my workshops, my coaching programs, et cetera, I send different testimonials to them depending on what they said their goal is. So if they say that their biggest goal is quitting their nine to five, I'm going to send them a testimonial of someone who said, I, I went in Justin's coaching program and I was able to quit my job.\r\n\r\n\r\nNikolas Hulewsky (24:18.466)\r\nGo!\r\n\r\n\r\nJustin Moore (24:28.606)\r\nSo it's very, very important to end this philosophy about personalizing your marketing can be applied regardless of what type of business you have.\r\n\r\n\r\nNikolas Hulewsky (24:28.748)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (24:37.038)\r\nWell, what's crazy is once you know who you are, life gets so much simpler. I'm not gonna say easier, but it gets very simple because if you don't know who you are, you don't know what you're looking for. You're just scattered. Like you have the scattershot approach. You have this story in your book of this woman who once she like refined her offer, she started saying no to brands. And I think it was like the, put some brand briefs out there and they had like a $500 offer. And she's like, I don't really think that's good for me. I don't know. You tell the story, but.\r\n\r\n\r\nShe ended up landing a much better deal for herself than she otherwise would have just because she got focused on what her offering was, right?\r\n\r\n\r\nJustin Moore (25:12.02)\r\nTotally, yeah. this was the story from Heidi from my audiobook. So one the things I did in my audiobook was I actually interviewed creators who had read the book and actually gotten results from my methodologies and kind of let them share their own stories. And so her story is really interesting. She is a fashion designer, a freelance fashion designer. So she actually creates patterns. so these large clothing companies will hire her or people like her to, a lot of times, they don't have people in house. They actually hire consultants to\r\n\r\n\r\nNikolas Hulewsky (25:21.698)\r\nYeah.\r\n\r\n\r\nJustin Moore (25:41.62)\r\ncreate new designs and new lines for different seasons and so on. And so this is her entire business. She has a podcast, YouTube channel all around this. So super, super niche, right? Freelance fashion designers, right? And, you know, she, you know, the really interesting part of her offer is that she, actually, sorry, I'm gonna need to cut this. I just realized I'm telling a different story than the one that was on the audio book. Let me read.\r\n\r\n\r\nNikolas Hulewsky (26:05.164)\r\nYeah.\r\n\r\n\r\nThat's okay, you're\r\n\r\n\r\nJustin Moore (26:08.542)\r\nLet me restart this. I the reason I did this is because I was just talking with her and this is a spree that the the the the example you were sharing was the one about a spree. So let me let me restart that. Yeah, so the example that you were sharing was from a spree D'Avora, so she runs a podcast called the Women in Tech podcast. Our women women in LA Tech podcast and yeah, to your point like she was very resistive actually to monetizing at all like she's actually had interest from brands.\r\n\r\n\r\nNikolas Hulewsky (26:12.61)\r\nthe beautiful thing about editing.\r\n\r\n\r\nNikolas Hulewsky (26:17.794)\r\nYeah, yeah,\r\n\r\n\r\nNikolas Hulewsky (26:22.19)\r\nyou\r\n\r\n\r\nJustin Moore (26:37.812)\r\nfor a long time, but she was worried about, you know, there being a, you know, her appearing like a sellout or not authentic because she's built this connection with her audience over many, many years. And so after, you know, doing some coaching with her, I basically said, look, even if they're coming inbound to you and saying, hey, we got 500 bucks, that doesn't necessarily mean that that's their only budget.\r\n\r\n\r\nNikolas Hulewsky (26:45.507)\r\nYeah.\r\n\r\n\r\nJustin Moore (27:01.074)\r\nLet's learn about their objectives like we were just talking about, right? Let's actually ask them. And funny enough, like we were talking about, like they didn't know they were like, well, we need to actually we need to think about this. Let us talk some more internally. And she kind of was was invested in, you know, in this in this conversation. It wasn't just in it for the money. Let me understand more about how I can help you. And they came back with a deal that was sixty five hundred. went from five hundred to sixty five hundred simply because she.\r\n\r\n\r\nYou know, had the audacity to ask about their goals. And so she had a very clear offer of what she was going to provide to them. And that was what got the deal over the finish line.\r\n\r\n\r\nNikolas Hulewsky (27:31.212)\r\nYeah, it-\r\n\r\n\r\nNikolas Hulewsky (27:37.454)\r\nAnd if I remember right, was like $500 one time into a $6,500 a month, like ongoing engagement. it totally paid off. This is one of my favorite things in business is going through the exercise with companies to help them understand who they are, what are their core values, what are they focused on? It's honestly one of my favorite exercises. I'll sit down with a team of executives and I'll be like, if you had to pick two people in your company that you think if you started another business, you would conquer the world with.\r\n\r\n\r\nJustin Moore (27:40.563)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (28:07.406)\r\nWho would they be? And so they were like, they'll write down their names. Jenna and Greg. I'm like, great. Now write down all the attributes that you love about those people. So they'll write down the attributes, right? Like loyal, smart, hardworking, whatever. And then you get all of them to put their attributes up on a board. So you've got maybe five or six people. They've listed two people and then you've got maybe 10 attributes per. All of a sudden you've got a couple hundred attributes and you start looking like, what are the commonalities? Like, oh, that's really interesting. We all really care about.\r\n\r\n\r\nbeing done at five so we can spend time with our family and we all really like to joke and we have potty humor. Okay, that's kind of a core value. so it's like this executive team comes together and they realize these are the types of people we want in our company. So it's not necessarily going out and getting customers, but it is who do I want to attract within the company. And once you have that, it just frees everything else up. It's like, no, these are our core values. This is what we believe in. It makes hiring way easier. It makes holding people accountable way easier.\r\n\r\n\r\nJustin Moore (29:02.238)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (29:05.934)\r\nSo I agree with you, just going through the thought process of like, what's our offering? Who are we trying to identify? Who are we trying to sell to? Freeze you up to then focus on the things that are most important.\r\n\r\n\r\nJustin Moore (29:16.37)\r\nWell, you know, one thing also that I think critical about doing this process is it will give you a lot more clarity and comfort with saying no to partnerships or business development type deals if there is not alignment there. Because what oftentimes happens when I work with creators is that they will accept a partnership that's either not enough money or the mission and the ethics and the values of the\r\n\r\n\r\nbrand or not super in alignment, but it's like, it's like money. I should take it. And then they get into the act. They get into the actual execution of the partnership and they're just resentful the whole time. They're like, man, I shouldn't have done this. Like I'm annoyed. And so like knowing like not only what you're like, heck yeah. Number is to like actually do the deal from a financial perspective, but just like be honest with yourself about whether or not this is something you even want to pursue. It's just going back to that basic, very basic Derek Sivers book. Hell yeah or no.\r\n\r\n\r\nNikolas Hulewsky (29:42.872)\r\nHahaha.\r\n\r\n\r\nJustin Moore (30:07.834)\r\nThat's very simple framework, right?\r\n\r\n\r\nNikolas Hulewsky (30:07.992)\r\nWhat was the last thing you said no to that was hard?\r\n\r\n\r\nJustin Moore (30:13.584)\r\nman, I got a good one that actually we just said no to it like two days ago. One thing that we've been wanting to pursue for our coaching business is actually sponsoring other in-person events. So actually go there and have a booth ourself and say, have a big sign that says sponsorship coaching. how, know, cause I go there a lot to these conferences and speak, but like lately I've been thinking, we should probably have a booth. Like, and people could come up and like actually\r\n\r\n\r\ntalk to us and hire us. And so we got the opportunity. There was a conference that actually wanted offered to trade coaching to help them get more sponsors for their event with we will give you a free booth. So they were gonna get basically give us like a 10 K valued sponsorship package for their event to be there and have a booth and all that to in exchange for coaching. And, they specifically wanted coaching with me and not my team.\r\n\r\n\r\nAnd so I said, no, I said, my, my goal this year, I have, I have two very specific goals this year, 10 X my newsletter. That is the over the next 12 months and, um, remove myself from basically any fulfillment related obligations as many fulfillment obligations on the coaching program as possible. that means, you know, all the other coaches on my team are handling most of the stuff.\r\n\r\n\r\nNikolas Hulewsky (31:14.222)\r\nReally?\r\n\r\n\r\nJustin Moore (31:41.724)\r\nand I'm gonna focus on content like newsletter and just like that is my superpower. And so yeah, it was hard decision, but like I made this decision. was like, this is what we're focusing on and we're gonna have opportunities come up that we have to say no to if this really is what's important.\r\n\r\n\r\nNikolas Hulewsky (31:54.36)\r\nCause what?\r\n\r\n\r\nNikolas Hulewsky (32:00.248)\r\nsaying no is a thing I'm struggling with right now. How much is one coaching client on average to your business?\r\n\r\n\r\nJustin Moore (32:09.03)\r\nSo we have a couple different programs. we have our average. It's basically two programs. It's $10,000 a year for private sponsored coaching or $3,000 a year for public.\r\n\r\n\r\nNikolas Hulewsky (32:13.806)\r\nJust say average.\r\n\r\n\r\nNikolas Hulewsky (32:22.318)\r\nOkay, so if you went to this conference, how confident are you that you would be able to get five new customers? I have no idea. Like how many new customers do think you, with a booth, could have closed?\r\n\r\n\r\nJustin Moore (32:32.572)\r\nIt's hard. It's super hard to know. There was also a other costs associated with it. I would have to have to have a teammate fly out there, you know, flight accommodations, all that. I value my time at like several thousand dollars an hour now personally. And so me committing to do personal coaching to this conference also was a opportunity cost to, the problem dude is that like having run this business for so long.\r\n\r\n\r\nThis is going to sound so weird and I don't mean this to sound weird, but there's like a, there is like a, there is a unending stream of opportunity. You can say yes to a lot of things. Lots of people wanting to do deals with you and partnerships and take it, be an advisor to this. We'll give you equity and do these deals. And like you really, really, really have to be intentional about what is important. And to me, the most important thing is 10X in the newsletter. That's all I'm going to focus on.\r\n\r\n\r\nNikolas Hulewsky (33:02.262)\r\nI'm so excited.\r\n\r\n\r\nJustin Moore (33:25.401)\r\nAnd so it means saying yes to no to really cool opportunities. And it's really hard.\r\n\r\n\r\nNikolas Hulewsky (33:29.848)\r\nWell, that, that, was the point I was going to make is you let's say you close 10 people and that would have been an additional a hundred thousand dollars to your business. You've already made the decision in your mind of what's most important right now. I agree with you. There is no shortage of good opportunities. If you ever watched shark tank and Mark Cuban's like, never be afraid to share your idea with somebody. Cause the idea is not necessarily the differentiator. It's all the hard work it takes to execute on that idea. So there's no good, no shortage of good opportunities, but there is a shortage of my time.\r\n\r\n\r\nand what I value. And I've had a lot of opportunities in the last year of people reaching out to me to start businesses or partner with them, or they have a fund, yada, yada, but I have to travel. And like, that's one of my non-negotiables, like, I'm not traveling. I want to be here at five every day to play with my kids. And so I'm not maximizing dollar values, but I am maximizing that lifestyle. But when you've got like a hundred thousand dollar check staring at you, that's where it's like, do I really, do I really want to be there after five?\r\n\r\n\r\nJustin Moore (34:09.14)\r\nRight. Yep, yep. Same, same.\r\n\r\n\r\nNikolas Hulewsky (34:28.78)\r\nI don't know my son pooped on the bed last night. I could take a break. You know what mean? Just like justifying.\r\n\r\n\r\nJustin Moore (34:34.388)\r\nAll this stuff is a balance, dude. Let me give you an even more tangible example. I stopped doing one-on-one coaching calls about a year ago. So I charged $1,000 an hour for my sponsorship coaching, and I've lots of them, lots and lots and lots of them. And to me, the old Justin, how long would I have had to work to make $1,000, and this person wants to me in one hour? Who am I to say no to these, and I have a\r\n\r\n\r\na long list of people willing to pay me $1,000 per hour. But I woke up to this reality maybe a year and a half ago where I was like, I would not look forward to like, I would wake up and I'd have like an endless stream of one-on-one coaching calls on my calendar. I couldn't, really what it was is I didn't have the space in my life or my business to create net new. That really is like, at this point in my life is like really important to me is like, yeah, I get fulfillment serving one person at a time, but\r\n\r\n\r\nNikolas Hulewsky (35:04.952)\r\nYeah.\r\n\r\n\r\nJustin Moore (35:32.88)\r\nreally what I really get core fulfillment from is teaching people at scale. And the only way in which I can do that is creating new frameworks, new methodologies, new ways to teach people, lots of people, not just this one person. And so I had to, I had to like create space in my life and my calendar and be like, okay, I'm, really going to say no to like this long list of people who want to pay me a thousand dollars an hour if I have this larger North star.\r\n\r\n\r\nNikolas Hulewsky (35:44.75)\r\nYeah\r\n\r\n\r\nNikolas Hulewsky (35:56.706)\r\nYeah, doctors and lawyers have that same problem. They're always jealous of entrepreneurs because they're like, I'm just trading my time for money, which is great money for them. But they're like, wow, I want to buy real estate or I want to have something that's passive. And I think a lot of people mistake mistakenly think about entrepreneurship. Like I want to buy a business or start a business and have it be passive or have passive income. It's like, no, no, you have to go through this period that you just described where you are trading your time for money. Many times when you're starting a business, you are trading your time for money and then build systems that scale that then allow you.\r\n\r\n\r\nJustin Moore (36:02.034)\r\nYep. Yep.\r\n\r\n\r\nNikolas Hulewsky (36:27.158)\r\nbuy it back. And now it's not like Dan Martell. But but but you know, back your time and then you know, you can do things. It's it's just cool to see. Because I have a hard time saying no. And it's like, cool. I'm glad there's somebody else out there who's going through the same process right now makes me think that there's hope for me.\r\n\r\n\r\nJustin Moore (36:29.907)\r\nYeah.\r\n\r\n\r\nJustin Moore (36:45.032)\r\nWell, there absolutely is hope for you. And I think that the other this happened to me recently, one of my best friends is a business owner and he owns like several small, small businesses, manufacturing and aerospace arena. and very successful, like doing really well. but he has juggled like, you know, different nine to fives over the years while running these kind of other businesses with operators. but he said to me, this is something the other day when I was visiting him recently,\r\n\r\n\r\nHe was like, you know, I was like complimenting. was like, man, it's amazing what you've built. Like, this is so cool. He's like, you know, I appreciate that. But like you and April, you and your wife have had time freedom for the last 12 years, basically. And I don't have that. I still don't have that. I still have to be at a certain place at a certain time, even though I own a business, you know, like I have to do this. And so like that's like a it was a very interesting comment because like I sometimes I look aspirationally to others.\r\n\r\n\r\nNikolas Hulewsky (37:43.48)\r\nTotally.\r\n\r\n\r\nJustin Moore (37:43.602)\r\nWhen in reality, I actually have like we have like a pretty amazing life. In fact, I was I was talking about this with someone the other day that like, wow, there's so many amazing things that have come from like being able to just like go to our kids field trips anytime, you know, classroom activity. We go there sick. We can stay home. We can care for them. You know, just just like so many benefits to like this particular business and life that we've built that is somewhat unique, I think.\r\n\r\n\r\nNikolas Hulewsky (38:09.58)\r\nYeah, I talked a lot of entrepreneurs and watchbillers who like are getting into the space. And I always say, you need to understand what you want. I don't care if it's if you want a lot of money. I don't care if you want to be famous. I don't care if you want to spend time with your family or if you want to be the mayor of your small town or give whatever it is, you just need to know what you want and then architect your life around that. Otherwise, you're going to build something that you're just not happy in. And I do feel lucky and fortunate in that regard. I think you're lucky and fortunate of like\r\n\r\n\r\nYou kind of knew what you wanted earlier on and have architected it, which is awesome.\r\n\r\n\r\nJustin Moore (38:44.212)\r\nYeah, yeah, I completely agree,\r\n\r\n\r\nNikolas Hulewsky (38:45.678)\r\nOkay, for the last little bit. Now after just talking about it's $1,000 for one hour with your time. And now I'm like, I'm gonna ask you for some consulting. But like, I have been very focused on growing my YouTube channel in particular, that's been my main focus. And the reason behind this, I'll give you the quick reason behind it, is I believe that building trust at scale is the most valuable thing that I can do right now. And for many founders who have founder led brands,\r\n\r\n\r\nJustin Moore (38:55.558)\r\nYou\r\n\r\n\r\nNikolas Hulewsky (39:15.468)\r\nI think it's the most valuable thing if they want to scale. I've started a venture studio with my brother-in-law. It's a healthcare venture studio where we bring in companies who are either wanting to be incubated within our company or accelerated. We have about 5,000 employees, 8,000 patients, 60 facilities. And so we use those assets as leverage to then either accelerate or incubate ideas. And I think in order for us to fully leverage that, we need to have some type of a distribution channel, either post incubator accelerator,\r\n\r\n\r\nor in order to get into the incubator accelerator and attract the best people. That's the thesis behind growing an audience at the moment. And so I've been really focused on my YouTube channel in particular. It's on entrepreneurship. It's geared towards entrepreneurs and watchmen who are trying to make their first million dollars. This isn't Larry Ellison and Elon Musk. This is, you know, people who own small businesses and are running them. And I thought it would be fun to like sit down with you and just get either an audit or just some ideas of how in the next\r\n\r\n\r\n30 days could I generate $10,000 in sponsorship revenue because I have not focused on it. Frankly, I have not cared about it, but I'm to the point now where I'm like, I get enough people reaching out to me. should probably be doing some type of revenue to offset the team that I have that I'm paying for every single month. So what do you think? Where do we start with that? Should I share my screen or what should we do?\r\n\r\n\r\nJustin Moore (40:35.774)\r\nDude, yeah, let's share the screen. Let's, let's get a lay of the land and then we'll go from there.\r\n\r\n\r\nNikolas Hulewsky (40:40.504)\r\nTell me what to do, tell me what to pull up. I am at your service.\r\n\r\n\r\nJustin Moore (40:42.472)\r\nYeah, pull so pull pull up the pull up your YouTube channel and then also I mean the the audio podcast is also a thing as well, right? So let's start with the YouTube channel.\r\n\r\n\r\nNikolas Hulewsky (40:57.518)\r\nOkay, here is my studio. I hate my face so much. Look at these stupid dumb thumbnails.\r\n\r\n\r\nJustin Moore (41:01.36)\r\nOkay, yeah, dude, it's great face, come on.\r\n\r\n\r\nNikolas Hulewsky (41:08.622)\r\nOkay, so here are analytics. No.\r\n\r\n\r\nJustin Moore (41:13.876)\r\nActually, let's take it, let's go first principles here, Before we even get into the analytics, because I think this is what a lot of people do. They go, OK, I'm getting this many views and this audience demos. Let's go back to what we were talking about earlier. How can we survey this audience using, let's say, a YouTube community post or poll? Or if you have a\r\n\r\n\r\nNikolas Hulewsky (41:26.85)\r\nRight, right.\r\n\r\n\r\nJustin Moore (41:38.482)\r\nstarted any sort of newsletter assets where you've been trying to extract some of these viewers from YouTube onto an email list. How can we learn more about where these people are at in their business journey? You have a suspicion that these people are going from zero to a million, but what if 90 % of your respondents, okay, here we go. So you've got some info. What if, yeah, what if 90 % of your respondents\r\n\r\n\r\nNikolas Hulewsky (42:03.682)\r\nYeah, yeah.\r\n\r\n\r\nJustin Moore (42:06.94)\r\nare still going from zero to one. They haven't even started the business.\r\n\r\n\r\nNikolas Hulewsky (42:09.646)\r\nSo this is a great question. This is the poll that I've had, which is, what kind of content do want more of? How to buy your first business, how to grow and scale a business, how to get started as an entrepreneur, or how to use AI to grow your business? So this is of the last, let's call it four months, people who have answered. The majority of them are hitting on this, how to use AI to grow your business and how to get started as an entrepreneur. If I go back to just the most recent newsletters, looks like it's flipping me off sideways.\r\n\r\n\r\nJustin Moore (42:13.716)\r\nOkay, here we go.\r\n\r\n\r\nJustin Moore (42:21.406)\r\nLove it.\r\n\r\n\r\nNikolas Hulewsky (42:39.754)\r\nSorry. How to get started as an entrepreneur is definitely top there. Same. How to get started as an entrepreneur. How to use AI to grow your business. Now we're not dealing with the law of large numbers here on each one of these, right? Cause we're getting like 30, 40 respondents. So that's why you're seeing such dramatic.\r\n\r\n\r\nJustin Moore (42:54.26)\r\nYeah, yeah.\r\n\r\n\r\nIt's still like directionally interesting,\r\n\r\n\r\nNikolas Hulewsky (42:59.566)\r\nYeah, yeah. So this is why this is kind of why I think it's that, hey, how do I use AI to grow my business? So these are people who have like got businesses that they're running and then that watchpreneur crowd who are like, how do I even get started? How do I find the business or buy the business?\r\n\r\n\r\nJustin Moore (43:12.82)\r\nGo back to the polls. Do you have other questions that you're asking?\r\n\r\n\r\nNikolas Hulewsky (43:18.307)\r\njust the, did I do today? Should I have more questions? This is where I'm, this is an old one.\r\n\r\n\r\nJustin Moore (43:22.26)\r\nYeah, dude, we need more questions, We need, like, I wanna know, yeah, dude, we need a lot more questions. Next question for your newsletter. What is keeping you up? What is keeping you up at night?\r\n\r\n\r\nNikolas Hulewsky (43:27.426)\r\nReally?\r\n\r\n\r\nOkay. Okay.\r\n\r\n\r\nYeah\r\n\r\n\r\nNikolas Hulewsky (43:37.442)\r\nwhat is keeping you up at night? Okay.\r\n\r\n\r\nJustin Moore (43:39.314)\r\nYeah, what are your biggest problems that you're having right now in your business? it, I don't know the answer is worried about making payroll. it work life balance? Is it, you whatever you could, you're better at brainstorming this. But yeah, so yeah.\r\n\r\n\r\nNikolas Hulewsky (43:47.234)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (43:53.026)\r\nYeah, yeah, yeah, yeah. I get what you're saying though. What are your current challenges? Like not just what are you interested in learning about? Like what are your current challenges as a business owner?\r\n\r\n\r\nJustin Moore (44:00.808)\r\nYeah, what are your current challenges? Because if the answer to one of these questions is recruiting, like retention, like I can't keep employees, they're always quitting or something, then you use that data and you go pitch a staffing agency.\r\n\r\n\r\nNikolas Hulewsky (44:21.166)\r\nokay.\r\n\r\n\r\nJustin Moore (44:23.772)\r\nAnd you say, Hey, I've got, know, look at this, look at the results of these polls over the last four weeks. Everyone is saying they're having recruiting issues. I would, I think it'd be an amazing idea for you to sponsor my newsletter for the next three months.\r\n\r\n\r\nNikolas Hulewsky (44:38.67)\r\nOkay, so let's drill down on that a little bit. let's say the two that I have are how to get started as an entrepreneur and how to use AI to grow your business. So I know that the majority of respondents are interested in those responses or in those topics. Asking what...\r\n\r\n\r\nJustin Moore (44:52.478)\r\nI, sorry, I don't think this is that interesting, bro. Being interested in a topic is very different than an active problem that I have. We're talking painkiller versus vitamin here. This is a vitamin. what content would you like to see? What problems are you having? That's what they'll pay money for, to solve their problems.\r\n\r\n\r\nNikolas Hulewsky (45:01.838)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (45:13.282)\r\nHow do I craft the survey then? Right? Cause I would think that how do you start as an entrepreneur and how to use AI to grow your business are two different subs. If I say in your business, what's the biggest challenge that you're facing? I'm not going to get answers from the how to get started as an entrepreneur crowd.\r\n\r\n\r\nJustin Moore (45:27.506)\r\nWhere are you putting these questions? Is it just like at the very, at the footer, the bottom or something of these?\r\n\r\n\r\nNikolas Hulewsky (45:33.12)\r\nI'll show you. No, it's right at the top. So maybe I'm doing it wrong. So I do a little intro and then right here, give me your feedback. And then I get into the meat and potatoes of the newsletter. But admittedly, I'm a newsletter novice. So please rip away. Tell me what I'm doing wrong.\r\n\r\n\r\nJustin Moore (45:51.475)\r\nYeah, yeah.\r\n\r\n\r\nSo the best practice here would be asking this question right after they join your newsletter on the post opt-in confirmation page. Because you'll get a much higher opt-in than in the email themselves because people just don't like answering surveys. My results have been 90 % opt-in.\r\n\r\n\r\nNikolas Hulewsky (46:02.381)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (46:06.317)\r\nYes.\r\n\r\n\r\nJustin Moore (46:18.932)\r\nor like actually filling out the questions after signing up for the newsletter right when they're joining because they don't think they're going to get on the newsletter unless they fill out the survey. But when they're on the newsletter, but when they're on the newsletter, it's like 40%. So it's like way lower. I'm on kit.\r\n\r\n\r\nNikolas Hulewsky (46:30.488)\r\nAre you on kit or beehive? Okay. And so is that a function within kit where if the ones they sent right message, okay. I'm going have to look it up. All right. So that's piece of advice. Number one, get it right when they sign up.\r\n\r\n\r\nJustin Moore (46:35.796)\r\nIt's not, I use a tool called Write Message for that. you get it right when they sign up. And then again, focus on the pain points, the actual painkiller problems, not the like nice to have stuff. And the way in which you're actually integrating it into here, yeah, can, I mean, this is okay. Like it's not like tactically bad, but making it.\r\n\r\n\r\nNikolas Hulewsky (47:02.35)\r\nIt's just generally bad.\r\n\r\n\r\nJustin Moore (47:04.244)\r\nNot generally bad. I think you're...\r\n\r\n\r\nBefore we start, give me some feedback on like your biggest pain points in your business right now so that I can ensure that I can help you solve them. Like to me, you know, something like that. To me, I think it's like being very clear that why they should be answering this question.\r\n\r\n\r\nNikolas Hulewsky (47:18.466)\r\nHmm. Okay.\r\n\r\n\r\nNikolas Hulewsky (47:28.494)\r\nWill you talk about vitamin versus painkiller? I've heard you say that. What is that?\r\n\r\n\r\nJustin Moore (47:33.074)\r\nYeah, this is like a this is a really important thing. So like people don't want to buy vitamins. They want to buy painkillers. They don't they don't something that will help them in some amorphous distant future where they have to take a vitamin every day for like 60 days, 90 days. And like maybe at some point it'll help me. People are much less interested in doing that than buying Ozepic.\r\n\r\n\r\nNikolas Hulewsky (47:46.616)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (47:50.222)\r\nMmm.\r\n\r\n\r\nJustin Moore (47:55.774)\r\nLet me take a shot and it will immediately help me do this thing. It's way easier. It's 10 times easier than doing all the diet and exercise. this is a urgent painful thing that I'm experiencing or give me the, give me the pain meds. I want the thing that is going to make my pain go away immediately.\r\n\r\n\r\nNikolas Hulewsky (47:56.558)\r\nOkay, okay, okay, yeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (48:12.81)\r\nAnd so by asking people, hey, what content do you want me to write? That's the painkiller. Cause it's like, just tell me, just tell me right away, like what I need to write about. But the vitamins are, what are you struggling with? Because that takes time for me to aggregate and to analyze and to craft and create sort of content around. that kind of a good way to think of it?\r\n\r\n\r\nJustin Moore (48:28.542)\r\nSorry, what I meant more is like the painkiller data is gonna be the thing that's gonna get you the sponsorship.\r\n\r\n\r\nNikolas Hulewsky (48:36.768)\r\nOK. Yes, sir.\r\n\r\n\r\nJustin Moore (48:38.77)\r\nBecause if you can go to a sponsor and say that like these people on my list are having this urgent active issue, that's why they're going to be more likely to purchase or patronize your product or service because they need this problem to go away immediately.\r\n\r\n\r\nNikolas Hulewsky (48:54.25)\r\nOkay, okay, so that's step one. Gather some more data. Gather some more data.\r\n\r\n\r\nJustin Moore (48:57.384)\r\nYeah. Gather some more data is very important part of this. And then step two is we go back to the rope method. It's how do we craft outreach where it's exciting to the brand to respond to me. So let's pull that example of the training or retention issue. What we're going to do is we're going to go out there and we're going to find a staffing agency. We're going to go to somewhere.com. I don't know, right? It's like.\r\n\r\n\r\nNikolas Hulewsky (49:19.864)\r\nMm-hmm.\r\n\r\n\r\nJustin Moore (49:25.01)\r\nNick Kuber's staffing agency, right? And we're going to see what campaigns they're running. Are they running some sort of campaign around like Black Friday or something, where you can get your first, you know, executive assistant for half off for the first month and they'll pay for that first month? I don't know. I'm just saying like, let's go back and research what campaigns they were running last year. Hey, are you to be running that campaign again this year? That's the R in the Rote Method is the relevancy. Going and seeing what campaigns are they running or are most likely going to run in the future.\r\n\r\n\r\nNikolas Hulewsky (49:25.613)\r\nSure, yeah,\r\n\r\n\r\nNikolas Hulewsky (49:41.292)\r\nYeah, yeah,\r\n\r\n\r\nNikolas Hulewsky (49:52.864)\r\nBecause right now all I would be able to approach them with is like, hey, this many people are interested in starting their business, or this how many people are interested in using AI to grow their business. So I have a very broad set of businesses I could reach out to. Right.\r\n\r\n\r\nJustin Moore (50:04.532)\r\nYeah, and everyone's saying that. That's what every, like, that's not interesting. There's a hundred, a thousand newsletters or YouTube video channels talking about that stuff. Right? So you need to do, what's the differentiation point here? Right? So the.\r\n\r\n\r\nNikolas Hulewsky (50:12.93)\r\nMmm, okay.\r\n\r\n\r\nNikolas Hulewsky (50:18.862)\r\nHow much data is enough data? It's like, oh, I 10 people respond or like I had 5,000 people.\r\n\r\n\r\nJustin Moore (50:21.971)\r\nI mean, a-\r\n\r\n\r\nI think directionally, getting more data, like the problem question around what's going on in their lives, what's keeping them up at night, is one piece of the data. It would be nice to get other data like revenue size of the business. I was actually just talking with a potential sponsor recently, and they told me one of their goals is maximizing the number of new businesses that are making over a million dollars in revenue on their platform. That was a goal.\r\n\r\n\r\nNikolas Hulewsky (50:27.468)\r\nYou\r\n\r\n\r\nNikolas Hulewsky (50:46.776)\r\nThank\r\n\r\n\r\nNikolas Hulewsky (50:54.286)\r\nWow.\r\n\r\n\r\nJustin Moore (50:54.418)\r\nAnd so like, I didn't have that data. I was like, okay, maybe I should add some revenue numbers to my onboarding survey so that can have some, you know, it's not HHI, like household income is like a pretty common one to ask for consumer facing companies, but like for business B2B focused companies, getting revenue figures might be interesting. So like, maybe if you had that data, that could also be potentially interesting to sponsors. So I don't know that it's necessarily like an audience size thing, but if you could show them, like 20 people responded to this that have\r\n\r\n\r\nNikolas Hulewsky (51:19.564)\r\nyou\r\n\r\n\r\nJustin Moore (51:24.328)\r\nbusinesses making over a dollars, that could be a worthwhile sponsorship, even though the sample size is small.\r\n\r\n\r\nNikolas Hulewsky (51:31.81)\r\nYeah, that's an interesting piece because I honestly with the newsletter, it's been an afterthought for me. Like I have the only reason I started even collecting emails was because somebody was like, you're getting that many views, you should be collecting emails. Like, okay. And so like, I have it and like, I send it out. But it's definitely not optimized. As you saw, I have one survey and I'm not sending anything like there's no good onboarding process. So I think for me, that's a really good takeaway is of course, you should have a better onboarding process, just like any business. What should like\r\n\r\n\r\nJustin Moore (52:02.368)\r\nWell, and you can upsell these sponsorships with the newsletter. So you say, yeah, I could talk about you on my YouTube channel and in the podcast, but I also have a segment on my newsletter of 600 businesses that have all self-identified as making $100,000 to $500,000 in revenue a year, which is what it sounds like you're trying to target. We could do a targeted blast just to that segment with this offer.\r\n\r\n\r\nNikolas Hulewsky (52:13.966)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (52:28.418)\r\nTalk to me about how do you get people to actually, so I know that upon signing up for the newsletter, you send them a survey, but let's say that I didn't do that. How do you get people to actually answer the survey? Because that's just, I mean, it's just hard.\r\n\r\n\r\nJustin Moore (52:38.9)\r\nIt's hard. It's harder. You have to incentivize them somehow, whether you can do giveaways, sometimes, you know, Amazon gift cards, like, or find something very valuable. Maybe you're going to raffle off a free coaching call with you or something. If they fill it out, you just got to figure out what's.\r\n\r\n\r\nNikolas Hulewsky (52:43.426)\r\nCough cough\r\n\r\n\r\nNikolas Hulewsky (52:50.798)\r\nWould it be better to send it in a newsletter or just a separate email that's like, hey, I'm trying to get a better psychographic of my audience. Can you just fill this out?\r\n\r\n\r\nJustin Moore (52:58.484)\r\nMy, it's not about you. No, don't say I'm trying to get, no, I'm trying to serve you. Not I'm trying to get more data, because that's a personal thing. It's how, every email you should send, you should be like, how is this gonna help my reader? This one individual person. And so that's the lens, is like, I'm trying to give you more personalized advice.\r\n\r\n\r\nNikolas Hulewsky (53:01.814)\r\nNikolas Hulewsky (53:09.377)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (53:19.374)\r\nThat feels so stupid.\r\n\r\n\r\nJustin Moore (53:20.914)\r\nYeah, no, don't don't feel stupid. I mean, this is a really common thing. Actually is like, you know, right as if you're talking just to one person.\r\n\r\n\r\nNikolas Hulewsky (53:28.214)\r\nIt's the positioning of it though, not like, hey, I need you to help me. It's, hey, I wanna help you. So help, know, answer these things. But would you do it separate? You would do it separate then.\r\n\r\n\r\nJustin Moore (53:30.162)\r\nYeah. Yeah. Yeah. Yeah. Right.\r\n\r\n\r\nI so what I like to do is I think you you do all the things you have it in the newsletter and then let's say once a quarter you could send a dedicated blast be like hey just want to make sure I have your you know like you could do it either your preferences updated or I want to serve you make sure I'm serving you in the best way possible so you could do a dedicated email like once a quarter to.\r\n\r\n\r\nNikolas Hulewsky (53:56.63)\r\nIt just give an ideal length. Is it like, don't make it 10 questions. Okay.\r\n\r\n\r\nJustin Moore (53:59.668)\r\nVery short. Yeah, make them all, make all the questions as relevant to them as possible, like, you know, clear as to why you want that info. My survey is eight questions. But I also have like logic on the question. So if they answer yes to this question, yeah, if then, then I'm going to answer, go down like a different tree of the questions.\r\n\r\n\r\nNikolas Hulewsky (54:14.679)\r\nif then.\r\n\r\n\r\nNikolas Hulewsky (54:20.45)\r\nWow, okay. All right. So I've got some work to do just identifying my customer basically like who's my ICP. What about just on my channel? Cause I'm just curious to get your feedback and thoughts. like, okay. This is the ballpark of once you get that dialed in of kind of where you could be from a monetization standpoint.\r\n\r\n\r\nJustin Moore (54:25.694)\r\nYep, yep, I think so, yep.\r\n\r\n\r\nJustin Moore (54:41.364)\r\nBro, you, this is why I don't like get hung up very much on following and viewership and all that, because like, if you could illustrate to somewhere.com that you could bring them one client who hires two employees, that's worth 10 grand to them probably, or more. So to me, it's not about the size of your YouTube channel or the size of your following. Obviously like as a proxy,\r\n\r\n\r\nNikolas Hulewsky (54:56.27)\r\nHmm.\r\n\r\n\r\nJustin Moore (55:10.836)\r\nyou know, that that helps directionally, like the more eyeballs you have, the more potential clients you have. But like, it's much more about the composition of your audience. So like, if I was, yeah, it's a lazy proxy, but it can be somewhat useful. But like, it's much more the data that you can point to and say like, you know, yeah, a thousand people watch the video, but it's like 300 of these people have businesses in all likelihood that are doing a million dollars a year or more, whatever the number is, right?\r\n\r\n\r\nNikolas Hulewsky (55:19.15)\r\nIt's a lazy proxy.\r\n\r\n\r\nNikolas Hulewsky (55:26.38)\r\nMmm.\r\n\r\n\r\nJustin Moore (55:38.921)\r\nAnd so a lot of it is like a narrative, dude. It's like how you position a sponsorship of your channel as a way for them to accomplish a business outcome.\r\n\r\n\r\nNikolas Hulewsky (55:47.928)\r\nCould I take examples from guests who I've had on? I've had guests and I do ask them, I'm like, Hey, just let me know if you got any business from the podcast. And many of my guests will message me and be like, I got business. Some of them obviously doing much, better than others, but\r\n\r\n\r\nJustin Moore (55:59.988)\r\n100%.\r\n\r\n\r\n100 % dude. could even, I would also, you could run a test for yourself. You could say, do a, sort of workshop yourself. Say, hey, put it in your YouTube community tab or whatever and be like, hey, I'm gonna do a one hour workshop on finding your next business, your next business idea or whatever it is. Using AI, you know, one of those two things, right? Using AI to blah, blah. It's gonna be $27 and I'm gonna do it at this date. You know, here's the little of simple paywall. And then if you get 60 people to sign up,\r\n\r\n\r\nNikolas Hulewsky (56:04.161)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (56:21.689)\r\nMm-hmm. Yeah, yeah, yeah, yeah.\r\n\r\n\r\nJustin Moore (56:32.5)\r\nThere you go. There's proof. When you ask people to do a thing, they do the thing. Oftentimes that's what brands are looking for is that you actually have influence, right? That people listen to you. And so you can also get first party data by running little experiments like this.\r\n\r\n\r\nNikolas Hulewsky (56:39.554)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (56:45.134)\r\nOkay, I'm gonna try to synthesize this. I'm gonna do this. Like I'm not just gonna fricking talk about this. I'm gonna do this. So people are gonna follow me. And if I fall on my face, I'm just gonna have my mom wire me $10,000 to say we did it. it's there, I did it. Don't ask who the sponsor is. So I think what I need to do and tell me what you think.\r\n\r\n\r\nJustin Moore (56:51.422)\r\nLet's go.\r\n\r\n\r\nJustin Moore (56:57.62)\r\nOr transfer it from another account. Look, I did it.\r\n\r\n\r\nNikolas Hulewsky (57:14.218)\r\nStep number one, I need to get some information on my audience. Like bottom line, send a survey out, send a couple of surveys out and start gathering more specific information about their challenges, how I can serve them. What are they facing and what do they need help with? Number two, let's get some proof. Let's get some social proof that if I asked my audience to do something, they actually do it. So host a webinar, get some testimonials from people, whatever, gather some of that information. And then let's say that's two weeks from now, then I can make some assessment of like, all right,\r\n\r\n\r\nThis is where people have made money. This is where I've actually gotten people to stay with their challenges are now go out and focus and find some brands. so that gives me maybe two weeks to hopefully at least get down the path. Is that a good plan?\r\n\r\n\r\nJustin Moore (57:58.268)\r\nIt is, and you know what the most exciting part about this thing is, is that when you secure a sponsorship, when you talk about the brand, it feels like an act of service because I said, you say, asked you, I asked you what your biggest problems are and here's the graph. Here's what you guys said. Here, I'll show it to you. Here's the little chart. And so I went out there and I struck this deal with somewhere because you were having this issue with recruiting. And so it feels much more like an act of service now versus you lining your pockets.\r\n\r\n\r\nNikolas Hulewsky (58:15.81)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (58:26.894)\r\nBecause it is an act of service. You're not just coming out there saying like, hey, I want to make money, who can pay me the most? You're going with service and mind is like, okay, I want this to be useful. And that's been my whole approach. That's why I've kind of felt weird about asking for sponsorships, because I'm like, it feels gross. Like, I just I don't want money. But when you reframe it as, well, I'm solving a pain point for people. So of course, that would be valuable for someone to come in and offer a solution to that pain point. It makes me feel a little better.\r\n\r\n\r\nJustin Moore (58:31.849)\r\nYeah.\r\n\r\n\r\nJustin Moore (58:56.34)\r\nDude, let's, think, I just thought, I just saw the mindset shift there. Let's go, let's go.\r\n\r\n\r\nNikolas Hulewsky (58:56.76)\r\nFingers crossed.\r\n\r\n\r\nLet's go. All right. In 30 days, I'm going to follow this up and whether or not I hit it, I'm going to give an update. I think I can hit 10 grand. I think we're going to do this thing. All right, Justin, where can people get this bad boy?\r\n\r\n\r\nJustin Moore (59:08.66)\r\nLet's go. Let's go. Let's go.\r\n\r\n\r\nJustin Moore (59:16.852)\r\nSponsorMagnet.com my friend. That's the best place to go. It's also available on audiobook, you know, your favorite audiobook place, but yeah, SponsorMagnet.com and you can tumble down the rabbit hole and reach out to me from there as well if you'd like.\r\n\r\n\r\nNikolas Hulewsky (59:28.366)\r\nI just, want people to know Justin's not sponsoring this. He didn't pay me anything. I was at a conference and I heard Justin get emotional talking about his motivation in life right now. And he was talking about he has young kids and his kids are like really similar to my kids' ages. And I didn't, to be honest, I didn't know who you were and I went and looked you up and I was like, he's putting out like really cool content and he just launched this book. And then I started listening to it and I got really excited because I think what you're building.\r\n\r\n\r\nis really cool. But more importantly, I think the why behind what you're building is really cool. So I just want people to know, it's not paying me to hold up his book. I legitimately think it's a great book. You should go check it out. think Justin's amazing. Go give him a follow and I can't wait to check in with you in 30 days. If you don't hear from me, you'll know why. Yeah.\r\n\r\n\r\nJustin Moore (01:00:17.46)\r\nDude, I super appreciate that man, it means a lot. This was a blast.\r\n\r\n\r\nNikolas Hulewsky (01:00:20.302)\r\nCool. All right, I'm gonna hit stop. We'll let it up.",
  "metadata": {
    "duration": "",
    "date": "2025-09-22",
    "platform_source": "Google Drive"
  }
}