{
  "episode_number": "215",
  "episode_title": "The 3-Step Framework Consultants Use to Fix Million-Dollar Problems with Maurizio Cuna",
  "guest_name": "Maurizio Cuna",
  "business_name": "",
  "transcript": "﻿Nikolas Hulewsky (00:01.26)\r\nMy guest today has the best name in the world. Hopefully I can say it correctly. is Maurizio Cuna. Did I do good? Yes, all right. He's giving me, he's giving the head nod. I'm super excited to talk to you today because you have 20 plus years worth of consulting experience. You've consulted for some of the largest companies in the world that have trillions of dollars in assets under management.\r\n\r\n\r\nMaurizio Cuna (00:09.488)\r\nPerfect, perfect.\r\n\r\n\r\nNikolas Hulewsky (00:24.844)\r\nYou've lived on multiple different continents, Australia, Asia, Europe. You speak multiple different languages. You have a newsletter that's read in 120 different countries. You've written books, you've led multimillion dollar programs. And I feel like many entrepreneurs, myself included, we're just kind of figuring it out. We're trying to think through how do I solve this problem today? Your experience is literally as a consultant, you were paid to come in and fix problems. Like your job is fixing problems.\r\n\r\n\r\nSo I'm excited to learn from you today and hopefully the audience also learns from you today. How does a consultant approach problem solving and how can I take some of these skills and apply them into my life and into my business? So I'm stoked for that. I hope everybody else is stoked as well. And Maurizio, where are you in the world right now?\r\n\r\n\r\nMaurizio Cuna (01:10.928)\r\nThank you, Nick. Thanks for the introduction and congratulations on pronouncing my name 99.9 % of the way correctly. That's excellent. It doesn't happen very often outside of Italy. I've been called all different names over the years from Marozio to Mario, standard Mario and Luigi. No, very good. Very good. Thank you.\r\n\r\n\r\nNikolas Hulewsky (01:35.768)\r\nGlad I got close. I'm glad I got close. So you're.\r\n\r\n\r\nMaurizio Cuna (01:39.664)\r\nI'm in Australia. So I'm in Sydney. live in Sydney. Originally, I'm from Italy, as you might have guessed by my name and accent that hasn't changed in the last 20 years. It's not going to change anymore. Yeah, I've been living in Australia for the last 10 years, approximately. I've lived in, as you said, Europe, in the UK for a few years. I lived in Asia.\r\n\r\n\r\nin Hong Kong and in the US also in a very beautiful place in Iowa.\r\n\r\n\r\nNikolas Hulewsky (02:14.092)\r\nNice. Where? Iowa. yes. Tropical Iowa.\r\n\r\n\r\nMaurizio Cuna (02:18.734)\r\nyes yes tropical ayua yeah it was very interesting i did a winter there and that was enough yes\r\n\r\n\r\nNikolas Hulewsky (02:30.39)\r\nYeah, winters in the Midwest are not fun.\r\n\r\n\r\nMaurizio Cuna (02:34.0)\r\nYeah, yeah, was, I think it was minus 34 Celsius. I don't know what it's in Fahrenheit, but it was very, very cold. It was very cold. I used to get... Yes, yes, yes.\r\n\r\n\r\nNikolas Hulewsky (02:44.15)\r\nWow. Minus 34 Celsius? Okay, so zero Celsius is negative 30, excuse me. Zero Celsius is 32 degrees Fahrenheit. So it's gotta be lower than zero. It's gotta be below zero. I think negative 15 Celsius is zero Fahrenheit.\r\n\r\n\r\nMaurizio Cuna (03:00.556)\r\nYeah, yeah, yeah, it was pretty good.\r\n\r\n\r\nSo used to get frostbite from going from the car park into the office. I to get all, you and I was completely covered with hats, scarves, gloves.\r\n\r\n\r\nNikolas Hulewsky (03:18.7)\r\nand you said, screw this, I'm going to Australia.\r\n\r\n\r\nMaurizio Cuna (03:22.178)\r\nEssentially, yeah, that's what happened. Yes, my wife is Australian, so that helped. Yeah, we met in London.\r\n\r\n\r\nNikolas Hulewsky (03:23.414)\r\nYeah, it's a nice trade. It's a good trade.\r\n\r\n\r\nThat's awesome. So, so tell me as a consultant, this like this is one of the things I've been really fascinated by is I've kind of created my own workflows of like, okay, identify a problem and how do I identify the problem? I gather information and then I start kind of putting the information into different buckets and I make decisions, blah, blah, blah. But I've never been trained in it. I didn't work for a consulting firm. Can you help me understand like\r\n\r\n\r\nWhat does a consultant do? What are the steps and process that they go through to not only identify the problem, but also like the root cause and what some solutions might be? What does that typically look like?\r\n\r\n\r\nMaurizio Cuna (04:07.044)\r\nYeah, sure, sure. We can talk about that, obviously. So what our consultants do is a very, very tough question, and I'm still unable to answer properly this question after 20 years. But what we can probably discuss today is how we can apply some of the frameworks that we normally use with our clients from an entrepreneur perspective, from a small business owner.\r\n\r\n\r\nAnd this conversation like I have also with some of my friends that have small businesses and they ask the same questions as you asked. How do I solve the right problem? By the way, in my experience, working with large enterprises, this is a common issue. I think even clients that work in large enterprises sometimes are\r\n\r\n\r\nNikolas Hulewsky (04:52.598)\r\nYes.\r\n\r\n\r\nMaurizio Cuna (05:06.768)\r\nit's not easy for them to identify the right problem to solve. So they think they have a problem, but most likely what they're going to give you is a symptom, right? They're not going to give you the disease. They're going to give you the symptom. And so part of the job for us is normally at the start of an engagement is to understand what the actual problem that we need to solve here is. And I would go a bunch of framework for that.\r\n\r\n\r\nNikolas Hulewsky (05:16.322)\r\nMm-hmm.\r\n\r\n\r\nMaurizio Cuna (05:35.736)\r\nthe first one that comes to mind is for example, the problem tree. So if you go to a client or if you go to a business owner and an entrepreneur and they tell you revenue is going down, which is pretty much a common issue, I would say. So you, not good, not good. So you might think that this is the actual problem that we need to fix. But then what you need to do is to go through\r\n\r\n\r\nNikolas Hulewsky (05:53.378)\r\nNot good.\r\n\r\n\r\nMaurizio Cuna (06:02.576)\r\nthe problem tree, what we call, right? So you start, you need to identify the major branches of this problem. So why, why revenue is declining? Is it because you're selling less? So it's a volume problem? Is it because you maybe are discounting too much? So it's a pricing issue. Maybe it's the product, right? Maybe the customer is moving and is buying cheaper items. So is it\r\n\r\n\r\nvolume, price, product, if you picture, right, these three getting developed into branches, then you pick the first branch, for example, the volume branch, and then you split it further down. So why volume is going down? Is it because of traffic? Is it because of conversion? Is it because, let's say, your traditional repeat customers are buying less from you?\r\n\r\n\r\nNikolas Hulewsky (06:40.108)\r\nYeah.\r\n\r\n\r\nMaurizio Cuna (07:02.424)\r\nAnd then again, you pick the first branch and you go down.\r\n\r\n\r\nNikolas Hulewsky (07:06.382)\r\nThat's, so do you just ask why over and over and over until you get to kind of a root cause?\r\n\r\n\r\nMaurizio Cuna (07:13.028)\r\nCorrect. So by the time you get, let's say, to the third layer in this problem tree, you have sort of a vague idea of all the possible root causes. And then you start asking. As you said, there is a framework called the five whys to identify the root cause. So you start asking the question why five times until you are\r\n\r\n\r\nfairly comfortable and confident that you hit the right problem. So I don't know. Let's say you have a gym. I don't know. You probably don't own a gym yet. Maybe you will one day. Yet. Yes. So let's say you own a gym and you need to solve for leads. You need more leads. You need more people to get to know about your gym and\r\n\r\n\r\nNikolas Hulewsky (07:56.118)\r\nI don't. Yet. Thank you. Yet.\r\n\r\n\r\nMaurizio Cuna (08:11.216)\r\nto eventually subscribe to your gym. So we go through the process that we just described. So we map out the tree. And then you get to understand that maybe you already have a lot of walk-ins into your gym, but nobody's signing up. So you ask, why? Why? What's happening? And then you identify that maybe the sales tour\r\n\r\n\r\ninto your gym is a bit not very good, it's a bit awkward. So then you ask, okay, the sales story is awkward, why? And then you realize maybe my personal trainers are not very warm, right? To people coming into my gym. Okay. And then you go down to the next level, why? Why are my personal trainer not warm? And then you're like, I haven't told them what to do.\r\n\r\n\r\nThere is no onboarding process, right, for them. And then again, you go down this route five times and what you land, what you end up with is probably a very different perception of the problem from the one that you started with. So it's not a marketing issue, for example, in this case, but it's more an experience and training issue because you haven't given\r\n\r\n\r\nNikolas Hulewsky (09:35.832)\r\nYeah. Can I try and rephrase it to you and you tell me if I'm understanding it right? Okay. Have you ever heard the Backstreet Boys song by the way? Tell me why.\r\n\r\n\r\nMaurizio Cuna (09:36.718)\r\nthe ammunition to your guys.\r\n\r\n\r\nMaurizio Cuna (09:46.488)\r\nYeah, I am a big fan of the Backstreet Boys. I was about 13 or 14 years old when they...\r\n\r\n\r\nNikolas Hulewsky (09:52.521)\r\nYes. Tell me why. Yeah. Okay. So let's use the gym example. You have low sales and you start digging into it. You said something in the beginning that I think is really important. You said to identify the right problem. Cause there can be multiple problems that you identify, but which one is the right problem? And sticking with the gym analogy, you have low sales.\r\n\r\n\r\nAnd you might look at the first thing and say, wow, we're only converting, I don't know, 30 % of our customers, we should be converting 50. And that could be a problem. You're like, okay, that is an issue. But then you go to the why. You're like, well, okay, well, why are we so low in our volume? Okay, well, actually, we're only getting 10 walk-ins a day. We should be getting 30 walk-ins a day. wow. Okay, so we also have a lead issue.\r\n\r\n\r\nAnd then why? Why do we have a lead issue? And then all of a sudden you drill into it it's like, our messaging sucks. We don't have a good brand. We don't have anything specific that we're marketing where people are attracted to us. So that makes it difficult to get people in the door and it makes it difficult for our team to close them once they get in the door to help them understand this is exactly what you're getting out of this gym. So if you fix the branding and the marketing sort of, you know, what are the programs that we offer? How are we going to help you achieve your goals, et cetera? You're going to\r\n\r\n\r\nnot only solve the leads, you're also going to solve the conversion problem. But if you would have just stopped at the conversion, the first step, that's not the right problem. The right problem was to go all the way back to like messaging or branding, positioning, et cetera. that like, am I understanding it right? Did I articulate it? Okay.\r\n\r\n\r\nMaurizio Cuna (11:31.276)\r\nYes, yes, yes. So first of all, you have a great voice. So you could have been the sixth Backstreet Boy. So that's very good. Then second, yes, you explained it and summarized it well. And you actually, maybe without realizing, you also identified an adjacent challenge for the consultants.\r\n\r\n\r\nNikolas Hulewsky (11:39.01)\r\nThank you. Thank you.\r\n\r\n\r\nNikolas Hulewsky (11:59.299)\r\nMm.\r\n\r\n\r\nMaurizio Cuna (12:00.622)\r\nBecause you said maybe it could be a lead issue, or it could be also a conversion issue and sort of an experience problem. So you already identified multiple problems. And normally when you do this exercise, the reality is that you come up with different causes. And sometimes, unless you have really a ton of data and a ton of information and access to\r\n\r\n\r\nNikolas Hulewsky (12:14.328)\r\nYeah.\r\n\r\n\r\nMaurizio Cuna (12:29.888)\r\nall the departments of the business, you sort of don't know which problem is really the most important. So when you do this exercise and you come up with maybe a list of 10 things that could cause the issue, then what do you do? You can't fix everything, right? At the same time. So you sort of need to come up with a prioritization framework with the model\r\n\r\n\r\nthat you can use to prioritize these problems in a way that helps you so you know what to tackle first.\r\n\r\n\r\nNikolas Hulewsky (13:11.022)\r\nDo you have to invent that? Like, do I have to create that myself or are there things out there I can kind of steal?\r\n\r\n\r\nMaurizio Cuna (13:15.578)\r\nThere are many ways that you can do this, and probably some of them would be specific to the industry and the problem, but one that I can give you right now is frequency, severity, and willingness to pay. So what do I mean by that? So frequency. How often does this problem hit the client? So how often do you see this problem happening? Severity.\r\n\r\n\r\nNikolas Hulewsky (13:38.552)\r\nOkay.\r\n\r\n\r\nAnd when you say the when you say the client, are you talking as a consultant? the business is the client or are you talking about for your business? Good.\r\n\r\n\r\nMaurizio Cuna (13:48.022)\r\nthat I'm talking about my client, right? I'm talking about my client, so which is the business, right? In your case would be the entrepreneur, right? How often does this guy see this problem happening in his business? I'm simplifying. Then severity would be how bad, when this problem happens, how bad does it hit?\r\n\r\n\r\nNikolas Hulewsky (13:57.432)\r\nCool, Yep.\r\n\r\n\r\nMaurizio Cuna (14:15.376)\r\nSo we need to understand that not all problems have the same impact, obviously. So we need to frame it that way. And then we have the willingness to pay. So this is, again, very common also with large enterprises. There are many problems that we can fix. And not all problems are as expensive or as cheap to fix. And so what is the nice to have and what is the must have?\r\n\r\n\r\nwhich means what problem do I actually absolutely need to have a functioning business and what problems that I can just sort of wait or solve with a workaround or maybe solve a bit later. So.\r\n\r\n\r\nNikolas Hulewsky (14:59.67)\r\nIs that a subjective process or like how do I decide what is and isn't vital?\r\n\r\n\r\nMaurizio Cuna (15:05.667)\r\nYeah, so you come up with, normally what we do, we have like a questionnaire or we have a scoring mechanism that we use for a certain industry and that we use as a benchmark across different clients. So that's the way. So we try to make it as quantitative as possible because otherwise there is a lot of discretion. But then also I think when the...\r\n\r\n\r\nthe experience and the expertise of the consultant comes to raise. I've seen this before. It's very rare that, so I like to say this, right? That after you do this job for 20 years, there is a lot of pattern matching happening. You already see, okay, this problem is another one of those. That problem is one of these other categories. So you already have in your...\r\n\r\n\r\nin your arsenal, you have a set of tools and almost like a field for how you should approach at least a problem because problems are always different, but the approach could be similar.\r\n\r\n\r\nNikolas Hulewsky (16:20.718)\r\nLet me ask you this. I've gone through the process many times and there's always a balance of trying to create an exhaustive list of all of the issues and scoring them and a great framework and then speed and urgency. like, need, my business is failing. Like I need to fix something. How do you balance that as an entrepreneur? mean, and you've come into these exceptionally large organizations that are\r\n\r\n\r\nvery, very complex. Do you have a process that you go through that balances the speed with, you know, making sure you capture everything?\r\n\r\n\r\nMaurizio Cuna (16:59.096)\r\nYes, I think again, I'm glad we're having this conversation because I'm noticing a lot of parallels with enterprises clients as well. Same story in the enterprise. I think the times of let's wait nine months or 12 months or a year and a half to see results are gone. Clients even now, even in large enterprise, they want to see results fairly quickly. So yes.\r\n\r\n\r\nNikolas Hulewsky (17:20.227)\r\nYeah.\r\n\r\n\r\nMaurizio Cuna (17:27.312)\r\nwe can't wait for months and months and months to go through this exercise. Normally, we can solve this problem, this challenge in a couple of ways. One, we can sort of predetermine, we can timebox the exercise. We can say we're going to run this exercise for a certain number of weeks, let's say four weeks or eight weeks, and we are going to prioritize and uncover the most important problems.\r\n\r\n\r\nput it in a matrix or using the quantitative or qualitative framework and identify the issues, the big rocks, right? And so you time box it. The other way is also to inject into this discovery phase, inject some showcases. And so work on a...\r\n\r\n\r\nsort of a rapid prototyping, rapid proof of concept mechanism that you have so that you probably look at a portion of the business and then you identify two, three problems you want to fix. You do a proof of concept, you show the results, and from there you get a feel from the client if we are taking the right direction. Otherwise, we continue with the other portion of the business.\r\n\r\n\r\nYou could use also this approach. It's really depending on what the client wants to get out of your engagement, what they expect to see, how much money they want to spend, how much time they want to spend.\r\n\r\n\r\nNikolas Hulewsky (19:09.868)\r\nSo as a professional problem solver, which one of these problems would you rather have? Would you rather be in an organization that moves too quickly or that takes an exhaustive analytical approach to articulating all of the problems?\r\n\r\n\r\nMaurizio Cuna (19:29.422)\r\nRight. So in my experience, I have worked a lot with banks all over the world, right, in different continents. And I think different cultures have also different approach to risk. But in general, I should say that financial services are very risk averse, right? It's very risk averse as an industry. And probably rightly so, because you don't want to, you know...\r\n\r\n\r\nNikolas Hulewsky (19:53.549)\r\nYeah.\r\n\r\n\r\nMaurizio Cuna (19:59.252)\r\nYou don't want the move fast, break things. Correct. mean, the Silicon Valley philosophy, move fast, break things, maybe doesn't apply that well. Yeah, exactly. Doesn't work so well. However, even within this industry, I have worked for banks that were much quicker at making decisions and moving, and for banks instead that were...\r\n\r\n\r\nNikolas Hulewsky (20:01.122)\r\nYeah, you're managing people's money. don't, right.\r\n\r\n\r\nNikolas Hulewsky (20:11.214)\r\nDoesn't work so well,\r\n\r\n\r\nMaurizio Cuna (20:29.264)\r\nthey probably were a bit slower and where I enjoy the most is obviously where there is more action. I mean, as a consultant, you want to be in the action. you want to, you want to take a, make an hypothesis, which is of course backed by data, backed by experience. And, you don't want to completely go blind into moving.\r\n\r\n\r\nSo you want to take an, make an hypothesis and take a direction and start moving. I think that's where I enjoy working more in a sort of a fast paced environment. And I think the smaller the organization is, the easier is to go into that sort of execution mode. When the organization gets too big.\r\n\r\n\r\nNikolas Hulewsky (21:21.646)\r\ndo you build a good feedback loop for that? Because I think that that's important, right? Like, hey, let's go ahead and move, let's test, let's iterate. But if you don't have a feedback loop to say, this is what we did, these are the results, let's kind of fix it, that can be a problem. So it's like, I don't know, how do you do that?\r\n\r\n\r\nMaurizio Cuna (21:41.668)\r\nYeah, that's for example, the showcase approach, right? I was mentioning before. If you have, and this is something that we routinely do these days with clients. If you have a built-in mechanism to showcase to the client some of the progress that you have done in the last two, three, four weeks, then you also have a way to ingest feedback from the client and change direction.\r\n\r\n\r\nIn the past, I can tell you like 20 years ago, when we used to have this big transformation programs, that was not the way of working. So there was this, maybe you have heard already this terminology, maybe not, but there used to be this big way of implementing software and implementing an integrated system called waterfall, right? So waterfall was...\r\n\r\n\r\nHave you heard of it?\r\n\r\n\r\nNikolas Hulewsky (22:42.254)\r\nI don't, I have not, I mean, I've heard of a waterfall approach to things, but not, I think, in the way you're describing it.\r\n\r\n\r\nMaurizio Cuna (22:49.774)\r\nYeah, so a waterfall approach was let's start, we spent six months on a blueprint, then let's do the next nine months on building, then let's do the next three months of system tests, unit tests and the problem. So the program would last for two years and only at the end of it, you would see the results. And this was a commonly accepted approach.\r\n\r\n\r\nAnd then you might have heard of Agile. Agile was originally a software development practice. So it was invented and used for software development. And then somehow, let's not go into that, somehow became also an approach for the enterprise. And then people came up with this scale Agile framework, and then they created like a whole industry out of it.\r\n\r\n\r\nAnd basically, when you hear the word agile now in an enterprise context, this means that you want to iterate much quicker and you want to show results much earlier. So it's not unusual to have every two months or every month even at the end of each sprint, what we call it, you show the result, you do a demo.\r\n\r\n\r\nand you collect feedback. You do another demo the next month and you collect feedback. So the point you were making, the feedback loop with your client is much shorter, which helps in theory, creating better product and more aligned product with the actual requirements of the client.\r\n\r\n\r\nNikolas Hulewsky (24:37.806)\r\nCan I, I have a question. this is like not off topic, but it's not what we're talking about. I have this idea in my mind that consultants make a ton of money and people, people pay them a ton of money to fix problems. But then there's also this perception of, the consultant didn't really help me fix the problem that I wanted them to help me fix. Either it was going to cost more money for them to actually implement it. And then who's going to actually run it and manage it and all those things.\r\n\r\n\r\nMaurizio Cuna (24:45.854)\r\ngood.\r\n\r\n\r\nNikolas Hulewsky (25:07.532)\r\nSo it's kind of like this weird balance where companies know that they can't identify the problem. So they got to go get a consultant. And yet many companies then complain that the consultant came in, they billed us for a bunch of hours and we still don't know what the right answer is. Is that a systemic problem within the company or?\r\n\r\n\r\nDid like our consultants just naturally trying to bill people for more and more money?\r\n\r\n\r\nMaurizio Cuna (25:35.28)\r\nSo I think obviously it's a very interesting question what you're asking.\r\n\r\n\r\nNikolas Hulewsky (25:41.166)\r\nAm I off base? You've heard that before, right? I'm not like the first person to say that to you. Yeah, okay.\r\n\r\n\r\nMaurizio Cuna (25:43.6)\r\nOf course, of course, of course, of course. In fact, I had one client, he's a great friend and very loyal client over the years he has been. And one day, this was many years ago, after we presented the outcome of one of the discovery faces working with him, he basically said, okay, so what you're telling me is that the outcome of this consulting engagement is another consulting engagement.\r\n\r\n\r\nAnd I thought it was funny, but he hired us also for the next consulting engagement. obviously the reality is when you time box and exercise, if you hire me and you would know this, right? Because in business is the same. If you hire me for three months, there's only a certain limited\r\n\r\n\r\nthings that I can uncover or do even in this time box period. And so you can expect that I come in in three months, I fix all your problems. So I can fix certain problems for you. And probably in the process of fixing some problems, I identify more. And to fix those problems that I have identified during the first engagement, of course, I need another engagement.\r\n\r\n\r\nSo there is a bit of that. I think the other problem, is, I would say more of a clients, my clients problem is that sometimes they end up depending too much on their consultants, which is never, in my view, is never a good outcome. So this is something that I always tell upfront to clients is,\r\n\r\n\r\nNikolas Hulewsky (27:38.478)\r\nyou\r\n\r\n\r\nMaurizio Cuna (27:40.624)\r\nWe want to enable you to eventually run these on your own. Like I don't want to be stuck with you forever. So part of the job for a consultant is to, as we said, uncover the issue, fix the issue, and then enabling the client's team to sort of run with it. Because we don't want to be stuck with the same client, the same department forever.\r\n\r\n\r\nWhen I say client, I mean an enterprise. So I'm very happy to be working within the same enterprise for a long time, but not on the same project or within the same department. I want to move around because this gives me also more breadth and better understanding of this client as an enterprise. So to go back to your question,\r\n\r\n\r\nI think, yeah, some consultants probably want to extend their own services and they do everything not to be transparent with the client and yeah, try to get the next engagement, the next engagement.\r\n\r\n\r\nNikolas Hulewsky (28:48.75)\r\nWell, it's an interesting dynamic because if a company has a problem and they reach out to a consultant, it's because they either don't have the person, like the manpower necessary to solve it, or they don't have the expertise necessary to solve it. So just by bringing in the consultant, you've already acknowledged one of those two things. The consultant may come in and say, here's my recommendation to fix the problem. But typically, the consultant is going to come in and say, well,\r\n\r\n\r\nin order for you to not have this problem again, you probably need to have somebody who's either an expert in this or the manpower to take care of it. So it is this kind of weird feedback loop that they get stuck in. like that part of it, I totally understand.\r\n\r\n\r\nMaurizio Cuna (29:35.44)\r\nYeah, but also I think we need to probably baseline some definitions because it's consulting. It's a very broad terminology. Right. So there is the consultant that only focuses on strategy. So they come in, they give you a strategy. A strategy is not a plan. The strategy comes with problems, obstacles, and how you're going to fix, right?\r\n\r\n\r\nNikolas Hulewsky (29:41.39)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (29:47.682)\r\nYep.\r\n\r\n\r\nMaurizio Cuna (30:04.08)\r\nthese problems that you uncovered. But then they leave. They actually do not implement those solutions for you. Then there is another, let's call it type of consulting where we uncover the problem, but then we implement the solution for you. And that's very different. The skin in the game, let's call it that way, of the second approach,\r\n\r\n\r\nNikolas Hulewsky (30:26.03)\r\nOkay.\r\n\r\n\r\nMaurizio Cuna (30:33.16)\r\nis probably much higher than the first one because I uncovered the problems and now I'm going to fix the view and I'm going to be held accountable for the implementation of the solution. I think when you go that path, there is a clear advantage that comes from hiring consulting firms.\r\n\r\n\r\nNikolas Hulewsky (30:33.262)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (30:43.139)\r\nHmph.\r\n\r\n\r\nNikolas Hulewsky (30:51.31)\r\nyou\r\n\r\n\r\nMaurizio Cuna (31:00.612)\r\nBuilding capabilities is very time consuming for a client. If you are in the business of, I don't know, telecommunications, right? You know your business very well and your business is telco. Building capabilities that are not really focused on the telco business is expensive, it's time consuming, it will take you time. So what do you do? You buy them.\r\n\r\n\r\nInstead of building them, building these skills, you buy them from consulting firms. Consulting firms have a lot of breadth because they have, hopefully, if you hire the right consulting firm, they have fixed these problems before for similar businesses to yours. And therefore, they come with a perspective and an experience that you can't have because that's not your business.\r\n\r\n\r\nNikolas Hulewsky (31:43.458)\r\nYeah.\r\n\r\n\r\nMaurizio Cuna (32:00.024)\r\nI think a lot of times working with the consultants over a prolonged period of time, then you start building these capabilities. And this is not uncommon. A lot of consultants, again, get poached by their end client, right? And they start building those departments within the client enterprise.\r\n\r\n\r\nNikolas Hulewsky (32:23.768)\r\nCan we go back a little bit? There were three things. The only thing I remember is the last one, the willingness to pay. What was that framework that you said again?\r\n\r\n\r\nMaurizio Cuna (32:30.778)\r\nYeah.\r\n\r\n\r\nMaurizio Cuna (32:34.968)\r\nYeah, so this was the framework to sort of prioritize the problem. Yeah, so frequency, severity, and willingness to base. So frequency, how often?\r\n\r\n\r\nNikolas Hulewsky (32:40.536)\r\nThat's what it was.\r\n\r\n\r\nNikolas Hulewsky (32:47.246)\r\nfrequency, severity, willingness to pay. I really, man, I like the framework just because it's an easy thing to remember and to repeat. When you work with clients, do you have like a matrix that you set up of like, okay, here's the problem. Here's how frequently, here's the severity, here's the willingness to pay. And then you go through and you're like, how do we define severity? What is it on a one to 10? How do we score this? Or is it gut? Is it like, oh, that's a 10.\r\n\r\n\r\nMaurizio Cuna (32:51.428)\r\nYes.\r\n\r\n\r\nMaurizio Cuna (33:18.18)\r\nNo, no, absolutely not. You can't, you can't do like that. No, you have obviously a very, you have a very, very strict framework that you develop. You present to client before even they engage you. So you're going to say, this is how I'm going to operate here. This is how I'm going to score the problems that we uncover. This is a very, very tight definition of each scoring.\r\n\r\n\r\nNikolas Hulewsky (33:32.974)\r\nOkay.\r\n\r\n\r\nMaurizio Cuna (33:46.192)\r\nSo of the metrics that you're going to use. And then you go through the process. You go through the one, two, three months exercise depends on the complexity. But as I said before, you want to do it as you want to keep it as quantitative as possible. You don't want to start inventing on the spot because otherwise then you get a very inaccurate result. And the more data you can.\r\n\r\n\r\nNikolas Hulewsky (34:11.278)\r\n.\r\n\r\n\r\nMaurizio Cuna (34:15.613)\r\nused to support your conclusion, the stronger your conclusion will be.\r\n\r\n\r\nNikolas Hulewsky (34:23.156)\r\nSo help me, I'm kind of going through this process right now with the company that I have. And there's always a balance. Like we talked about a little bit earlier, is like how much data is enough data? I once heard like 385 is the right number of people to have in a survey once it becomes statistically significant. But how do you architect the data collection piece? I don't know, what's enough? How do you know when you finally hit that point?\r\n\r\n\r\nMaurizio Cuna (34:50.146)\r\nYeah. I think practically, most of the times is a time box exercise. So the client, and you walk backwards from there. You say, look, I've got two months within the next eight weeks, I need to have an answer. And then what you do is to even there, you prioritize the data that you're going to, that you're going to analyze. So you can't.\r\n\r\n\r\nYou cannot physically, you cannot look at all the data that you have, otherwise you end up into another sort of scenario, which is the analysis paralysis. You have too much data and you don't do anything with it. So you need to prioritize even there and address the big rocks. But what are the major issues that you have here? Your time box exercise. I think this would be the...\r\n\r\n\r\nNikolas Hulewsky (35:47.128)\r\nMmm.\r\n\r\n\r\nMaurizio Cuna (35:47.95)\r\nthe most practical thing to do.\r\n\r\n\r\nNikolas Hulewsky (35:50.663)\r\nOkay, so time becomes the constraint, not this is how many people you need to speak to.\r\n\r\n\r\nMaurizio Cuna (35:57.36)\r\nYeah, but the problem is how much time do you have? Of course, we can decide to talk to X number of people, but this exercise can go on for a very long time. Can you afford spending that time in talking to all these people? Instead, probably a smarter way to do it would be, let's create a list of the people that ideally I should talk to.\r\n\r\n\r\nNikolas Hulewsky (35:59.214)\r\nIs that fair?\r\n\r\n\r\nMaurizio Cuna (36:27.408)\r\nNow let's rank these people who are the top X number of people that I absolutely have to speak to. Then what is the next layer? Then what is the next layer? You eventually end up that 90 % of the information that you need is within the top, I don't know, 15 people. And what you're going to get is only marginally improvement with the bottom 10.\r\n\r\n\r\nSo if you have time, go with it.\r\n\r\n\r\nNikolas Hulewsky (36:56.568)\r\nHow do you track everything? Where do you put everything? How do you track meeting notes and ideas and who you spoke with and all that stuff?\r\n\r\n\r\nMaurizio Cuna (37:05.678)\r\nYeah, in enterprises, normally, we as an external consultant, we adapt to whatever tools and software the client at enterprise level are using. You might have heard of Jira, Confluence, these are enterprise tools. So this is most commonly what we use, of course.\r\n\r\n\r\nThe Microsoft Suite is everywhere in the enterprise. So we are forced, sort of forced to use the Microsoft Suite. And yeah, JIRA conference. There are many specific specialized tool based on the exercise that you are going through.\r\n\r\n\r\nNikolas Hulewsky (37:56.215)\r\nHere's my last question for you. We're running up against the top of the art. What's something you think that most consultants get wrong?\r\n\r\n\r\nMaurizio Cuna (38:12.772)\r\nI think going back to the point that I was trying to make earlier, most consultants force or put the clients in a position to hire them again and again and again. And this is, in my view, sort of a short-term view, because you might get hired\r\n\r\n\r\nby that client again and again again, but you are not increasing your breath. And I'm talking less about the corporate consulting firms, but more about maybe the small consultants, right? The small consultant, the smaller consulting firm wants to have more breath of clients so that they see the same\r\n\r\n\r\nand that kind of the same type of problem across across multiple types of clients within the same industry, because you want to sort of niche down, especially when you are a small consulting firm. But yeah, this is this is one type, I think, problems that I see in small consulting firms. If I instead translate this question into\r\n\r\n\r\nsort of a larger consulting firms, especially when you're starting out. Consultants tend to focus disproportionately on hard skills. they only try to, and this is a consulting firm, by the way, challenges, but they train and they learn domain skills.\r\n\r\n\r\nhard skills, pure hard skills, Excel, how the industry works, how they can go deep into a specific domain and industry, but they neglect a lot of the soft skills. They will be very useful later on in their career. And this is, think it's a problem that you only realize you have\r\n\r\n\r\nMaurizio Cuna (40:39.46)\r\nwhen you are several years in your career, because hard skills are sort of table stakes. And I think now with the introduction of AI tools everywhere in the enterprise, those sort of hard skills are becoming more and more commoditized. And soft skills will become more and more important instead, even in the enterprise level. And to train and develop soft skills,\r\n\r\n\r\nIt'll take a long time. Like you can't expect that, you know, you improve your communication or you improve your ability to self-promote or you understand how to read a room. You just step in very quickly. So you'll need train and practice to do that. And that's why I wrote my book, by the way, which is,\r\n\r\n\r\nIt's called Beyond Slides. And yeah, and I think it's going to be a very helpful read for all those early career consultants or people that are planning to go into consulting, they want to address a very hot problem and become even hotter in the future of how you can improve your soft skills given the\r\n\r\n\r\nand I put that as a given, your hard skills are already solid, strong, and well developed.\r\n\r\n\r\nNikolas Hulewsky (42:11.982)\r\nHmm. Hmm.\r\n\r\n\r\nSo you think the flip with AI coming is really more of an emphasis on soft skills.\r\n\r\n\r\nMaurizio Cuna (42:22.48)\r\nAbsolutely. I am certain of this. now, okay, so I am a partner at a consulting firm. You do not get promoted to partner because you are very good at VLOOKUP on Excel. Okay. So,\r\n\r\n\r\nNikolas Hulewsky (42:26.147)\r\nWhy?\r\n\r\n\r\nMaurizio Cuna (42:45.486)\r\nThat is not the way works. So if you think that your hard skills are going to carry you forever in your 2030, hopefully decades, career long journey, you are wrong. You are wrong. And AI is only going to make the problem bigger because AI is essentially commoditizing hard skills.\r\n\r\n\r\nLike, I don't know if you saw, it was fairly big on Twitter in the last week or so. There is this guy who created the new Excel, right? The AI powered Excel. Yeah. So I can't remember the name. I'll send it to you later. But essentially is a natural language powered Excel. So you won't even need VLOOKUP.\r\n\r\n\r\nNikolas Hulewsky (43:27.672)\r\nYeah, I haven't seen it. I haven't seen it.\r\n\r\n\r\nNikolas Hulewsky (43:40.43)\r\nExcel.\r\n\r\n\r\nMaurizio Cuna (43:43.15)\r\nYou won't even need to use ViloCop. You just explain the problem and this new software will work it out for you. So that part of the skill set will be commoditized. Of course, it will take a few years. I'm not here to say AI will eat all our jobs by 3 p.m. tomorrow. That's not the way. I disagree actually with all these gurus that...\r\n\r\n\r\ngo out there and say this stuff, but it's gonna happen. It will take some time, it will take years, but it's gonna happen. And at that point, what have you got? You as a human being, what have you got? You have your soft skills. You have the ability to connect. You have the ability to communicate. You have the ability to synthesize complex problems.\r\n\r\n\r\nand explain them to your client in front of you. You can use AI tools to support your work. is absolutely as for many years we used Excel to create models, we will use AI tools to do that work. But if you neglect your soft skills, I think your career will get much more impacted in the next 10 years.\r\n\r\n\r\nthan it was in the past time.\r\n\r\n\r\nNikolas Hulewsky (45:12.504)\r\nWow, really?\r\n\r\n\r\nMaurizio Cuna (45:14.928)\r\nI am very convinced of this. And this is something by the way, I keep telling everyone, especially the young people, because they have obviously a longer timeframe to do this. It's very important that you focus on this. And I can tell you, I work even now with many people that are very good from a technical and domain perspective, but they are not very good at\r\n\r\n\r\nNikolas Hulewsky (45:26.637)\r\nYeah.\r\n\r\n\r\nMaurizio Cuna (45:44.726)\r\nexpressing all that knowledge. It's a disservice. They're doing a disservice to themselves. Imagine you have this brilliant guy in front of you and he can explain, he or she can explain all the knowledge that they have inside. It's wild. Why wouldn't, like you spent all this time building this knowledge and why wouldn't you spend any time in trying to\r\n\r\n\r\nNikolas Hulewsky (46:05.315)\r\nYeah.\r\n\r\n\r\nMaurizio Cuna (46:14.186)\r\nbuild a skill to explain this knowledge to other people. It's counterintuitive, but to me, it's kind of obvious.\r\n\r\n\r\nNikolas Hulewsky (46:26.328)\r\nWell Maurizio, this has been an awesome conversation for me. Where's the best place for people to come find you?\r\n\r\n\r\nMaurizio Cuna (46:34.704)\r\nmany places. Of course, Twitter is one. MC is what I use because otherwise Maurizio would be too hard as you found out. My handle is the management consultant, T-H-E-M-G-M-T Consult on LinkedIn, Maurizio Cuna. My newsletter is newsletter.consultingintel.com.\r\n\r\n\r\nNikolas Hulewsky (46:47.009)\r\nIt's true.\r\n\r\n\r\nMaurizio Cuna (47:04.244)\r\nAnd my book is Beyond Slides, which is available on Amazon and wherever you guys buy books.\r\n\r\n\r\nNikolas Hulewsky (47:08.13)\r\nAwesome.\r\n\r\n\r\nAwesome. Let's stay in touch. Can't wait to hear what you think the next iteration of AI is going to be like in a few months.\r\n\r\n\r\nMaurizio Cuna (47:20.656)\r\nThank you, Nick. Thanks for having me. Great conversation.\r\n\r\n\r\nNikolas Hulewsky (47:24.973)\r\nOkay, well.",
  "metadata": {
    "duration": "",
    "date": "2025-08-08",
    "platform_source": "Google Drive"
  }
}