{
  "episode_number": "182",
  "episode_title": "How to Build Your Own AI Personal Assistant with Elizabeth Knopf",
  "guest_name": "Elizabeth Knopf",
  "business_name": "",
  "transcript": "﻿Nikolas Hulewsky (00:00.875)\r\nWell, I'm still having some hangover from the Sam Altman, Johnny Ive announcement, and also just trying to catch up on everything that Google's done. At the same time, Proplexity Labs has come out. I know Manus is introducing some new stuff, which is funny because you said to me right before we started that actually, it's been a pretty slow week in AI. But even in a slow week, there's been a ton of things that people are still trying to digest from the previous weeks.\r\n\r\n\r\nWell, I don't know. What do you think of the current state of what's going on right now?\r\n\r\n\r\nElizabeth Knopf (00:32.492)\r\nI mean, it's funny because I have you ever been to the carnival before? Like a carnival? Okay, so they have this little game where you spray horses and everyone's sort of like spraying and I keep like having that in my mind of every week with AI where it's like someone's in the lead and then someone else sort of overtakes them. It's wild because, you know, Anthropic came out with just some features, but it's just to get parody with the other guys like they have voice mode this week.\r\n\r\n\r\nNikolas Hulewsky (00:43.07)\r\nhuh.\r\n\r\n\r\nNikolas Hulewsky (00:49.601)\r\nYeah\r\n\r\n\r\nElizabeth Knopf (00:59.426)\r\nwhich is their big announcement. so, and I feel like that's happening. It's like someone gets a leg up for maybe two weeks, literally, and then someone else comes and meets them at feature parody. So it's just.\r\n\r\n\r\nNikolas Hulewsky (01:09.505)\r\nWell, yeah, it's really interesting because I actually started, we're going to do this a little bit later, but I started messing around with Claude. Like I integrated my email and my calendar and you showed me how to do this like a month ago, but I finally did it. The reason I did it today was because I was getting ready for this and I saw, Oh, Claude released their voice, whatever voice to text, uh, technology. And I was like, Oh yeah, that's right. I wanted to do X, Y, and Z. It's almost like when they're announcing new features, it's just their way of staying in the news.\r\n\r\n\r\nElizabeth Knopf (01:16.27)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:38.625)\r\nIt's like, we just got to, it doesn't even matter if it's like a good feature or not. It just, they're staying relevant.\r\n\r\n\r\nElizabeth Knopf (01:39.011)\r\nExactly. Yeah.\r\n\r\n\r\nGreat, right, absolutely, absolutely. And I feel like there's, we'll talk about it in a few minutes too. I feel like they're, they've been trying to play the marketing game, playing on some fears. So they have their own marketing strategy, but I am a fan of the product.\r\n\r\n\r\nNikolas Hulewsky (01:57.301)\r\nSo, okay, let's just talk about that. Let's just hop into it. So Anthropic this week, I think the founder of Anthropic voiced some concerns with AI. And correct me if I'm wrong. I think he said like 50 % of white collar jobs are gonna be eliminated in the next two years.\r\n\r\n\r\nElizabeth Knopf (02:11.342)\r\nspecifically entry-level jobs. So to make a distinction. So if you're a senior person, know, all oldest older people maybe have some safety, maybe.\r\n\r\n\r\nNikolas Hulewsky (02:13.664)\r\nmy gosh.\r\n\r\n\r\nNikolas Hulewsky (02:21.503)\r\nWell, maybe, but last week I just listened to a podcast with Sundar. I think it was Sundar, where he said, think management is actually the level that's going to be eliminated first, basically. So it's like, don't worry, just entry level and management. Those are the two that are going to go first. It's like, wait, what? So what did he say? The founder of Anthropic? What exactly was his concern?\r\n\r\n\r\nElizabeth Knopf (02:43.182)\r\nSo, yeah, so basically he said that AI agents are going to be able to take over most of the work of folks because as people enter the workforce, they're doing a lot of data and entry work, grunt work, or even if you look at some of the more historically prized professions, well, depends who you are, but like going into investment banking or legal, some of those very paperwork.\r\n\r\n\r\nand analytical heavy, already AI is taking a chunk of those businesses. And I saw a couple of weeks ago too, McKinsey had actually laid off some of their staff. Now, again, whether that's related to AI or not, unclear. And there were a couple, you know, funny memes as a result of that one. but I mean, I absolutely, mean, AI is absolutely going to be eating away at those. And I, again, feel bad from a macroeconomic standpoint where...\r\n\r\n\r\nYou have all these folks that have gone to school, have racked up all the student debt, and as it is, having a hard time to get jobs. And now all the skills that they may or may have not prepared.\r\n\r\n\r\nNikolas Hulewsky (03:46.207)\r\nYeah, I want to talk about the veracity of his argument in a second, but I first want to ask your opinion on this. almost feels like, because he came out and he started calling for transparency. I want to say he even called for government intervention of some kind. It almost feels to me like, everybody else is getting too far ahead of me. Let's bring the government in so we slow people down. More of a tactic as opposed to like,\r\n\r\n\r\nElizabeth Knopf (03:51.022)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (04:13.661)\r\nHe actually believes this? I don't, I have no clue. I don't know the guy from Adam. What do you think?\r\n\r\n\r\nElizabeth Knopf (04:17.134)\r\nYeah, I mean, I think there's definitely some truth to that because at the end of the day, I how you, I mean, I think there's a question of like, who wins this? People have said like, who's going to win this race? You can't really say, I think even that there's going to be a winner. One, there's a lot of competition. So like, if you make a pair of LL back to win the browser days or whatever, ended up winning those with Netscape and then that shifted.\r\n\r\n\r\nLike I just think things are going to be so fast and getting so commoditized that the competition will persist. don't think there's going to be a clear winner. And I think because of the last couple of weeks, each of them are sort of picking a lane. but I think you're right that yeah, I mean, if they can have regulatory capture in some regard, they're going to try to go after it. And so you have, you know, both chat GPT sort of itching towards that. or at least they had over the, you know, last couple of years, they've sort of shifted their tune a bit, but.\r\n\r\n\r\nI think also the, I don't want to get into politics here too much, but I think some of the staff from Anthropic 2 come from the Biden administration and had some relationships with some more censorship type stuff. And when they first launched, they were much more biased, which was very obvious in their product and the results you were getting. So I think they just have probably a more tendency towards safety. I mean, that was their whole pitch leaving OpenAI.\r\n\r\n\r\nNikolas Hulewsky (05:19.233)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (05:34.87)\r\nYeah.\r\n\r\n\r\nElizabeth Knopf (05:37.011)\r\nbecause for those that don't know, that team basically came from OpenAI.\r\n\r\n\r\nNikolas Hulewsky (05:41.323)\r\nthe anthropic team came from OpenAI?\r\n\r\n\r\nElizabeth Knopf (05:43.372)\r\nyeah, yeah, think they were, all of them were like head of safety too. So, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (05:49.701)\r\nOkay. So there's something that I found interesting. I listened to the all in podcast and like, which, which I like, I think they do a good job of trying to frame the conversation. But one of the things I'm trying to like internalize is they're talking about, Hey, we think that AI is actually going to accelerate the economy. So the economy is actually going to grow faster than we've experienced in the past. So worrying about these job losses.\r\n\r\n\r\nElizabeth Knopf (05:53.71)\r\nOkay.\r\n\r\n\r\nElizabeth Knopf (06:09.806)\r\nMm-hmm.\r\n\r\n\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (06:18.737)\r\nis not worrisome because yes, those jobs may be lost, but the economy is going to grow so fast, there'll be even more jobs created. The disconnect for me in that is that's assuming that there is job creation and that the Delta doesn't just accrue to the incumbents, if that makes sense. So the rich aren't just going to get richer, it is going to get redistributed. I don't know that that's the case because if these jobs are being eliminated and these companies just become more profitable,\r\n\r\n\r\nElizabeth Knopf (06:33.005)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (06:47.573)\r\nWhat are they going to go redeploy? Like firemen at their data centers? I just don't understand the argument necessarily of, more jobs will be created. Maybe I'm just being a neophyte.\r\n\r\n\r\nElizabeth Knopf (06:59.798)\r\nNo, I mean, I have to be a tech optimist just because otherwise it's a very dark future. So I will come and be transparent about that. But I can argue myself in both directions, I think, just like you. I think if we look at history as any guidance, and again, there's plenty of things that are different about right now, but every tech transformation revolution, this has always been a fear. This is not new. I mean, when bicycles come out,\r\n\r\n\r\npeople were scared that, women would leave, know, weird things, know, people always have fear. It's really, that's whole other story that's really funny, but there have always been fears. So, and we've always had this. I mean, even when we were going from a agricultural society, we became an industrial society, like that shift of, okay, we have plenty of food now. I mean, you look back and people aren't hunting. So it's like our basic needs are met. Now the paperwork needs are met.\r\n\r\n\r\nNikolas Hulewsky (07:33.057)\r\nYou\r\n\r\n\r\nElizabeth Knopf (07:55.63)\r\nAll of these things are being taken care of. And I think with AI, like, yes, things will be able to be done for itself. But I think just there will be new problems that we can't even foresee. And I was trying to even think of like, what are examples of like problems that we have now that have happened? I mean, you wouldn't even think like, you know, well, maybe data entry was always a thing or, you know, certain parts of the DevOps stack or whatever. And I know that's a little bit more sophisticated, but\r\n\r\n\r\nI have to be optimistic that there will be new jobs. mean, maybe take some bigger picture ideas. Space, know, going to space, that's like a new frontier, right? So there's gonna be jobs around that. Yeah, maybe there'll be robots, but you still have to build those robots. There'll be maybe new opportunities, even exploring earth. And I know these are more different types of problems, but yeah.\r\n\r\n\r\nNikolas Hulewsky (08:44.991)\r\nYeah. Well, I have an idea and I could be way off base here. Some of my most enjoyable time of the week is being outside in the yard, picking the weeds, walking with my kids, doing things outside. And over the last hundred years, there's been a shift in our society from being like outside and active to this professional working class that are like inside in a cubicle at a computer. And when we were growing up, it was\r\n\r\n\r\nyou need to go to college so you're not like the plumber over there. And we sort of demonized the sweaty work. I actually think that the pendulum is going to swing back the other way, that people will find satisfaction in working with their hands or helping other people, or those jobs are gonna obviously have to change the way that they pay. And maybe that's where the dollars accrue. But we don't ultimately know. I think we talked about it a couple of weeks ago.\r\n\r\n\r\nElizabeth Knopf (09:38.968)\r\nRight. Yeah.\r\n\r\n\r\nNikolas Hulewsky (09:41.089)\r\nTo me, the trades are gonna be something that we have to invest in if we're gonna need to have the power capacity, not even power, the power generation to fuel AI. So I am interested, I do understand the fear, but I'm optimistic as you are. I think that we'll figure out our way through it, even though it's gonna be messy.\r\n\r\n\r\nElizabeth Knopf (09:45.646)\r\nExactly. Yep. Yep.\r\n\r\n\r\nElizabeth Knopf (10:00.46)\r\nAnd at the end of the day, humans are problem creating machines. That's what we do. We create our own problems. So someone needs to solve them and we'll figure out new ones to have. So yeah.\r\n\r\n\r\nNikolas Hulewsky (10:04.617)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (10:10.561)\r\nOkay, so okay, if you had to bet if you had to bet the over under he said five years within he said one to five years I'm looking at right here 50 % of entry level white collar jobs within five years will be eliminated over under.\r\n\r\n\r\nElizabeth Knopf (10:28.834)\r\nI think it, for entry level, and that specifically, yeah. No, I think that's about right. I think everything else, over.\r\n\r\n\r\nNikolas Hulewsky (10:41.963)\r\nI'm going to take the over on white collar entry level jobs. just think things take longer than you think. They cost more money and they take longer than you think. I think the technology will be there very quickly. It's going to be the adoption is going to be crazy. I wouldn't be surprised if we start seeing unions make a comeback as workers get together and are like, let's unionize so that we can stop them from implementing AI to cut our jobs. That would not surprise me in the slightest. So I just don't think five years is going to be as quick as it gets replaced unless\r\n\r\n\r\nElizabeth Knopf (10:43.329)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (11:12.011)\r\nThere's something equally as exciting on the other end where it's like, Hey, yeah, that job's gone, but actually we have this other job that you could come and work for. So anyways, that's my, that's my thought on it. okay. So talking about Claude, can I, can I show something to you? All right. I'm going to share my screen. So I've been thinking this week in particular, I just have a lot going on. think a lot of people have a lot going on.\r\n\r\n\r\nElizabeth Knopf (11:29.358)\r\nPlease do.\r\n\r\n\r\nElizabeth Knopf (11:38.712)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (11:39.677)\r\nAnd it's really, really hard to figure out how you use AI within your working life. Obviously, if you're a small business owner and you're listening to this, you're probably just trying to get some tips and tricks in order to utilize AI in your business. I'm still a big believer that right now, AI's kind of best role is as a advisor, consultant, whatever you want to call it. And I forgot that Claude could actually integrate with your email. So I went today, I integrated it with my email, freaking blew my mind.\r\n\r\n\r\nNikolas Hulewsky (12:12.141)\r\nI asked it right here. You have 201 unread emails. I asked it, hey, how many unread emails do I have? And then it gave me the top emails that I had. I integrated my calendar with it and it tells me, hey, this is what your calendar looks like tomorrow. It's an admin day. You've got a ProPod meeting, which is a company that I was an advisor for out of UC Berkeley. And then your podcast recording with Ellie tomorrow at 11 a.m.\r\n\r\n\r\nThe minute I saw this for me, I realized there's an opportunity here to use AI as an assistant. And I was like, dude, Liz could show me how to do this because I'm a Neanderthal and I think Liz can actually show me how to make this work. So this is the very next prompt. And I think if you're a business owner, this may not be the exact thing that you use, but think about how you might apply this to you. I want to create a project that acts as my personal assistant.\r\n\r\n\r\nSo within Cloud, you can have projects. It's the same thing as a project in ChatGPT. You can even think of it as a GPT. But the cool thing about projects is you can upload contextual documents. And within that chat, the history of those documents, the history of that chat will stay, and it just gets better over time. You can refine it over time. So think of it as you're training an employee, and that knowledge essentially is staying with that employee. So I said, I want to create a project.\r\n\r\n\r\nthat acts as my personal assistant. They would have access to my emails and calendar. Every Sunday, we would go through items that need to be completed in the upcoming week. And then every morning, I would check in with it to get my schedule for the day with tasks that I need to complete. So that's just the way that I'm viewing it. Hey, every Sunday, what's going on this week? What are my outstanding items? And then I can kind of schedule my week and just hear the things that I need to get done every single day. And as a business owner, so you have to do, have to...\r\n\r\n\r\nplan your week and figure out what's the top priority and what's not. To get the most out of this project, how would I set it up? So I'm asking now, Claude, the question, what contextual documents would I need and how often would I need to update them? So it's not the craziest prompt in the world, but I felt like it was a decent enough prompt to just throw out there. What do you think? Okay. All right. So here's what it spits out to me. Fantastic idea.\r\n\r\n\r\nElizabeth Knopf (14:28.93)\r\nMm-hmm. Yeah. No, this is good. This is good. Yep.\r\n\r\n\r\nNikolas Hulewsky (14:37.407)\r\nI love how complimentary these things are. Like, I don't know if it's like, hey developers, make sure it's as nice to the people using it as possible because we want them to continue to use it more and they know it's a mental trick. if the data set that they're just trained on, make sure that human interaction is really kind. I don't know, but I love how nice it is to me and reinforcing. Okay, so the key with this personal system project is progressive enhancement. Start simple and build complexity as you establish habits. Makes sense.\r\n\r\n\r\nElizabeth Knopf (14:41.23)\r\nthis is.\r\n\r\n\r\nNikolas Hulewsky (15:06.901)\r\nBased on what I can see from your current setup, you're already dealing with the exact use cases this would optimize. So here's why I love just the setup. I tried to hire virtual assistants in the past, and if you're a small business owner, I'm sure that you've thought about doing it. What you think's the hardest part about hiring and onboarding a virtual assistant?\r\n\r\n\r\nElizabeth Knopf (15:27.224)\r\nfinding quality people, mean, and then being able to communicate all the things and having to document all the things to train them. Yeah.\r\n\r\n\r\nNikolas Hulewsky (15:33.697)\r\nBoom, that's it. That's the piece. Many times we don't even know what we want them to do. We just know like we're so busy, we have to offload something to somebody. So we're like, let's hire a virtual assistant. And then they get onboarded it's like, what do I give them? How do I give it to them? And so you that are doing the internal work of trying to figure out, what day should they check in on what, who are they responding to? What items can I offload? It takes a little bit of time. This, the way that I say she, does Claude read to you as a male or a female?\r\n\r\n\r\nElizabeth Knopf (16:05.656)\r\nI actually do, boy, I think I do, guys. I don't know,\r\n\r\n\r\nNikolas Hulewsky (16:07.059)\r\nOkay, yeah, it makes sense to me. Anyways, I called a she. So what she had said to me is like, cool, this is a big project. Let me break it down for you, Nick. Here's the quick start recommendation. This week, just create a personal operating manual and weekly goals template. Next week, add the daily morning routine. Week three, introduce the Sunday planning ritual and month two, add relationship tracking. So already I'm feeling less anxiety because it's like, cool, I've got the professional here. They're gonna show me how to set this up.\r\n\r\n\r\nI don't have to figure it out on my own. And then it says some other things. The most critical success factors is consistency in weekly planning sessions. This is where the AI learns your patterns and priorities. Mr. Bini said, blah, blah. All right. So then it says, here are the contextual documents that we need in priority. the reason contextual documents are important is because it can't give you advice or input unless it knows you. So it says, all right, create a personal operating manual, weekly goals, templates, task classification system.\r\n\r\n\r\nand project context documents. I'm gonna go through how it outlines and describes these things in a minute, but I've said a lot of words. What do you think of the way I've set the setup and its initial response to me?\r\n\r\n\r\nElizabeth Knopf (17:20.718)\r\nSo quick question just to clarify, you wanna do this as a Claude project, is that correct? Okay, okay.\r\n\r\n\r\nNikolas Hulewsky (17:24.757)\r\nYes.\r\n\r\n\r\nThere could be a better way to do it. I'm just an idiot. so I'm like, projects sound good. Me upload info to project.\r\n\r\n\r\nElizabeth Knopf (17:35.95)\r\nSo I guess the question is, you, cause where I would think about this is, are you gonna want to be adding your stuff in here every week or are you gonna want it to like access a tool like Google Drive or whatever other storage system you're using as sort of it just picking up things from the organization system where you have.\r\n\r\n\r\nNikolas Hulewsky (18:00.287)\r\nYeah, it's a great question. Well, first of all, I would say what organization system? Second, I would say my hope would be that given the context of what I find to be important, which I'd have to go through that process of who I am, how I respond to things, et cetera, and then having access to my emails, having access to my calendar, there would be enough context for it to actually be helpful to me.\r\n\r\n\r\nElizabeth Knopf (18:04.096)\r\nyou\r\n\r\n\r\nElizabeth Knopf (18:11.96)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (18:26.241)\r\nBut I do think that I would have to update documents at least once a week. I don't know.\r\n\r\n\r\nElizabeth Knopf (18:34.158)\r\nSo yes, yes. Okay, so a couple things just to consider because Claude is wonderful, but the one thing and the one feature that's odd that they have yet to do without using a third party tool is you can't have like recurring prompts run like you can in ChatGPT with their sort of tasks as well. Yeah, yeah. So that's the one thing to consider, which again, I use Claude all the time. I use it more than ChatGPT even with that.\r\n\r\n\r\nNikolas Hulewsky (18:53.505)\r\nGPTs. okay.\r\n\r\n\r\nElizabeth Knopf (19:02.722)\r\nBut like, if you wanted to have, let's say, it email you something or whatever, you're gonna have to run that and prompt it versus having it do like automate that unless you're using something like a Zapier. And there's a possibility to do it with MCP, I'd have to think through where that trigger would come from. But that's just a consideration that you'll have to at least be uploading documents and then reprompting it.\r\n\r\n\r\nNikolas Hulewsky (19:28.971)\r\nSo have I ever told you my Richard Simmons story? Okay, when I was growing up, my mom used to exercise to Richard Simmons. And for whatever reason, I remember waking up at like 6 a.m. and she'd be dancing to Richard Simmons. He's super flamboyant, health nut. But for whatever reason, I've always remembered this story. And it could totally be a made up story, but for all I remember, it was Richard Simmons. He had this woman who was morbidly obese and she wanted to lose weight.\r\n\r\n\r\nElizabeth Knopf (19:32.3)\r\nNo.\r\n\r\n\r\nNikolas Hulewsky (19:58.081)\r\n800 pounds, I don't know, something ridiculous. And the woman's like, well, what do I need to do? And how can I start actually losing weight? Like she couldn't get out of bed. And so Richard Simmons said, here's what need you to do. First thing, just clap your hands a couple of times a day for like 15 minutes. And like the simple act of clapping her hands was getting the cardio going where she started to burn calories. Obviously there's the other side of the equation where she needed to eat less food, but like the cardiovascular workout started from clapping.\r\n\r\n\r\nAnd then over time, obviously she lost weight. She got more physically fit. She started doing other things like hiking and probably running and swimming, blah, blah, blah. But like that idea of like, just clap your hands. I know it sounds so stupid, simple, but that's just gonna get you started down the road. I agree with you. We could get MCPs in here. I could get every automation in the world going, but I'm an 800 pound, know, morbidly obese person. I'm just trying to clap my hands. So like, that's why for me, this is...\r\n\r\n\r\nElizabeth Knopf (20:52.046)\r\nThank\r\n\r\n\r\nNikolas Hulewsky (20:56.193)\r\nthinking I'm going to create a project and then within that project would be this. And so every day I would just come in and ask it like, what do I have to do today? Right. And then I would, I would hit that and that would just start another conversation for that day. That's my thinking. And then I just think over time, it'd be like, man, this would be a lot easier if I could automate this part of the task. If I over engineer right now, I'm just worried I won't actually follow through with it. Okay.\r\n\r\n\r\nElizabeth Knopf (21:13.038)\r\nMm-hmm.\r\n\r\n\r\nElizabeth Knopf (21:23.342)\r\nFair enough, so let's get you to 799 pounds.\r\n\r\n\r\nNikolas Hulewsky (21:27.809)\r\nYes, yes. Okay. So this is the, I find it really frustrating that Claude can integrate with Google, but ChatGPT can't because not my Gmail.\r\n\r\n\r\nElizabeth Knopf (21:42.134)\r\nIt can. It can.\r\n\r\n\r\nNikolas Hulewsky (21:46.803)\r\nI know, I know through an automation if I go to Zapier or some bull crap.\r\n\r\n\r\nElizabeth Knopf (21:49.262)\r\nOkay, no, I want to double check that that's not, that that's, okay, now you got me, because I know I was looking at, hold on.\r\n\r\n\r\nNikolas Hulewsky (21:57.281)\r\nWell, all I saw was Google Drive. Anyways, so the reason for that is because what I'm gonna do now is I'm gonna look here. Okay, she said, here are the context documents that you need to do first. And that's what she said to do this week. Perfect. Personal operating manual, the most important, and it defines how you work. So if I come over here, these are the foundational documents. The personal operating manual is gonna have my\r\n\r\n\r\nElizabeth Knopf (22:00.246)\r\nNo, you're right. It's only drive. Okay. Yeah, you're right. Okay.\r\n\r\n\r\nElizabeth Knopf (22:14.926)\r\nThank\r\n\r\n\r\nNikolas Hulewsky (22:27.201)\r\nwork style preferences, decision making frameworks, energy management patterns, and personal values and priorities. Now, if ChatGPT had this integrated already, I would just go to ChatGPT and say, answer these questions for me. In fact, that's actually what I'm going to do. So I'm just going to go here and say, I'm going to copy this. I'm going to go to ChatGPT.\r\n\r\n\r\nand I'm going to start a new chat. I'll share that tab. And I would say I am building a personal operating manual. The first, what's this thing called?\r\n\r\n\r\nYeah. Contextual document I need is to answer these questions as well enough thoroughly. I can't spell as possible.\r\n\r\n\r\nElizabeth Knopf (23:24.15)\r\nYeah, thoroughly, comprehensively.\r\n\r\n\r\nElizabeth Knopf (23:29.986)\r\nYou don't need to worry about swelling.\r\n\r\n\r\nNikolas Hulewsky (23:31.637)\r\nI know. Knowing what you know about me, please give this the information it needs to make it useful for my new GPT project executive assistant. Okay. And now we're going to see what chat GPT says about me.\r\n\r\n\r\nI haven't done this in a little bit. I know. I know. All right. So we got, here's my personal operating manual, my work style preferences. I'm a chronotype. My default is a morning person. True. Sharpest earliest in the day. And my productivity is lower at night. That makes sense. Deep work versus shallow work. Yes, that is 100 % true. You prefer 60 to 90 minute uninterrupted sessions for high level work. Typically I do one of these, one to do these per day.\r\n\r\n\r\nElizabeth Knopf (24:00.236)\r\nYeah, it's like nerve wracking, right?\r\n\r\n\r\nElizabeth Knopf (24:11.566)\r\ninteresting.\r\n\r\n\r\nNikolas Hulewsky (24:28.449)\r\nThat's great. Shallow work emails, podcasts, logistics and small ops tasks are best batched into low energy afternoon windows. That is so true about me. Geez Louise. Communication style preferences, direct, efficient and clarity driven. Dislikes fluff. Okay, kind of hurtful, but tone is friendly but sharp. Really friendly, but would you describe me as friendly but sharp?\r\n\r\n\r\nElizabeth Knopf (24:52.706)\r\nI mean, you're good to the point, but you know when to use stories. I don't, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (24:54.591)\r\ninteresting.\r\n\r\n\r\nNikolas Hulewsky (24:59.221)\r\nHmm. Okay. Decision-making frameworks. What's the upside? What's the downside? Can I live with the downside? Fair. Is this the highest leverage use of my time? That's that one right there. Is this the highest leverage use of my time right now? Is something I ask all the time. What's the next irreversible decision point? Hmm. I never thought of it that way. Will this help me hit my $250,000 a year content and consulting goal? Have I ever told you that's my goal? Yeah. that is so crazy. I haven't said that.\r\n\r\n\r\nElizabeth Knopf (25:06.444)\r\nYeah.\r\n\r\n\r\nElizabeth Knopf (25:23.744)\r\nNo.\r\n\r\n\r\nNikolas Hulewsky (25:28.843)\r\nto chat TPT in a while either. When I started all this stuff, my wife's like, what you doing all day? You just messing around on YouTube? And so for me, was like, all right, if I can show dollars coming in, at least she'll associate value with that. And $250,000 was my goal. Okay, this is really interesting. This is not robust enough, in my opinion, for a context document. What do you think?\r\n\r\n\r\nElizabeth Knopf (25:35.822)\r\nyou\r\n\r\n\r\nElizabeth Knopf (25:56.95)\r\nI mean, I am a nerd about frameworks, so I feel like we could add some own. It just depends how personalized you want it to be based on you versus like a best practice or, you know, whatever. So that's, would say, preference.\r\n\r\n\r\nNikolas Hulewsky (26:10.977)\r\nHmm. Can I ask you a question for these context documents? Like how long should they be? 10,000 words?\r\n\r\n\r\nElizabeth Knopf (26:17.026)\r\nThey can be. No, I mean.\r\n\r\n\r\nElizabeth Knopf (26:23.192)\r\nmore context you give it, the better. I don't know the right number to say, but I would say like whatever context it needs. I know that's like sort of a pop-out answer, but I mean a couple pages is good, but you also don't want to give it a necessary context if that makes sense.\r\n\r\n\r\nNikolas Hulewsky (26:32.106)\r\nNo.\r\n\r\n\r\nNikolas Hulewsky (26:38.369)\r\nI just always feel like Claude gives me, if I ask for like a context document, it gives me a ton of information. Whereas chat TPT is like as not limited, but as little as possible. It's just like trying to be as efficient as possible. I don't know. I don't know why the difference. Have you noticed that?\r\n\r\n\r\nElizabeth Knopf (26:44.13)\r\nOkay.\r\n\r\n\r\nElizabeth Knopf (26:49.098)\r\nIt's, yeah.\r\n\r\n\r\nElizabeth Knopf (26:55.134)\r\na thousand percent. That's why I use Claude a lot. You've got the, I think Claude is sort of the over retriever and then Claude is like the passing grade, sorry, chat GPC is the passing grade, yeah.\r\n\r\n\r\nNikolas Hulewsky (27:04.458)\r\nChat GPT. Well, and that's why it's frustrating is because I'd rather use Cloud for this, but Chat GPT has, I mean, I use Chat GPT for everything. So it has all of my information in it to create this. Yeah, so to your point, maybe I should break up some of these sections, ask it to expand on that, and then put it all into a context document.\r\n\r\n\r\nElizabeth Knopf (27:09.901)\r\nMm.\r\n\r\n\r\nElizabeth Knopf (27:25.506)\r\nAnd if you wanted to use for getting those frameworks, like then I would hop back over to Claude because then what it can do is actually create multiple artifacts, which are those like document pop-outs that you were showing. Yep, so off to the right, that core system, that's called an artifact. So it can actually.\r\n\r\n\r\nNikolas Hulewsky (27:38.409)\r\nOkay.\r\n\r\n\r\nOkay, hold on, I'm so sorry. What's the artifact? This thing?\r\n\r\n\r\nElizabeth Knopf (27:45.644)\r\nSo what you're looking at where you're scrolling up and down that this whole thing, the way it pops out is the technical name is an artifact. So it's basically like generating a document of some sort. So it can create multiple of those in the same prompt. So you can say like create two artifacts or two documents, maybe pick like two of the sections or something and say, search the web for best practices frameworks on maybe do your decision-making framework.\r\n\r\n\r\nNikolas Hulewsky (27:50.357)\r\nUh-huh.\r\n\r\n\r\nOkay.\r\n\r\n\r\nElizabeth Knopf (28:14.728)\r\nand personal, well, you know, and so then I can give you those and it'll give you very comprehensive things, but it'll create two separate documents you can work through unless you wanted them consolidated. But I've just found it helpful to have separated.\r\n\r\n\r\nNikolas Hulewsky (28:16.468)\r\nNikolas Hulewsky (28:26.464)\r\nNo.\r\n\r\n\r\nNikolas Hulewsky (28:29.963)\r\nSo like doing this, create two artifacts for the best practices on decision-making frameworks and let's say personal values and priorities. And then you said search the web.\r\n\r\n\r\nElizabeth Knopf (28:42.734)\r\nand say search the web for the best practices.\r\n\r\n\r\nNikolas Hulewsky (28:50.497)\r\nI found this really cool prompt advice this week. I want to see what you think of it. In the prompt advice, it said, get like five examples of things that are really good and that you really like, put them in there, and then like use this sentence. What they're looking at these examples, what prompt would you generate in order to\r\n\r\n\r\nElizabeth Knopf (29:02.466)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (29:16.799)\r\ngenerate them or like what prompt would you create to generate them? can't remember the exact wording, but effectively it's like, how do you reverse engineer it? I thought that was so fascinating. Have you ever done that?\r\n\r\n\r\nElizabeth Knopf (29:23.128)\r\nYep. all the time. Absolutely. if you go to also, okay, if you want to Google or I feel bad saying go to Google this, but it's Anthropics prompt, they have a prompting tool that will create great prompts for you. I want to say it's...\r\n\r\n\r\nNikolas Hulewsky (29:27.275)\r\nJesus.\r\n\r\n\r\nNikolas Hulewsky (29:38.441)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (29:46.463)\r\nMichael Greenberg showed this to me recently. I've never used it, but he did show it to me.\r\n\r\n\r\nElizabeth Knopf (29:49.589)\r\nokay.\r\n\r\n\r\nIt's great. Once you start getting a sense of the framework, because it's a pretty standard framework, once you start playing around with it. But it's pretty good.\r\n\r\n\r\nNikolas Hulewsky (30:03.968)\r\nOkay. Well, just for, just for, um, purposes of this conversation. All right. So now it's, it's generated me. Oh, so here's one of the artifacts. Here's the decision-making frameworks. Effective decision-making is specific executive task. Wow. Okay. So in the past where I would have had to sit down and say, like, what are the important frameworks? Well, what even is a framework? What are the, what are the core tenants that I need to have? This is now telling me the core tenants that I need to have. So.\r\n\r\n\r\nI'm going to copy that. I'm not going to go back to.\r\n\r\n\r\nElizabeth Knopf (30:36.416)\r\nActually, you don't even need to copy it. If you want to add it into your project folder, or are you going over to ChatGPT? Sorry, did I catch you? okay. Okay. Nevermind. Okay. So if you wanted to, you can't do that. Why? Usually you can add this into your project knowledge directly from here. I don't know for, no, I don't know. I don't know why it's not letting you do that, but that's okay. I don't want to distract us from that.\r\n\r\n\r\nNikolas Hulewsky (30:41.333)\r\nI was going over to JadGBT to, yeah, yeah. But no, show me how to do that. I just go.\r\n\r\n\r\nNikolas Hulewsky (30:51.232)\r\nMaybe I have.\r\n\r\n\r\nNikolas Hulewsky (30:55.777)\r\nDo I have the cheat plan? Is that what?\r\n\r\n\r\nNikolas Hulewsky (31:03.197)\r\nAlright, so I'm going go back to chat gbt and I'm going to say using these best practices, please. I don't know, generate me or create me. My. Frameworks I feel stupid.\r\n\r\n\r\nElizabeth Knopf (31:21.655)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (31:25.505)\r\nLet's see what this says.\r\n\r\n\r\nElizabeth Knopf (31:26.808)\r\nBut that's the thing is like, don't even need to know what to prompt it. It doesn't give you the right thing. You iterate. That's like the best thing about this. There's like zero costs associated with that, except for 30 seconds of your life, right?\r\n\r\n\r\nNikolas Hulewsky (31:37.941)\r\nYes.\r\n\r\n\r\nSo are these my? I need to go back and look at.\r\n\r\n\r\nNikolas Hulewsky (31:49.057)\r\nOkay, so this is telling you how to write. the spade framework, rapid framework, whatever, daisy, rice. So it's giving all of these frameworks and it feels like this response from ChatGPT.\r\n\r\n\r\nare not my specific frameworks.\r\n\r\n\r\nElizabeth Knopf (32:10.274)\r\nSo why don't you say this, say based on my personal history and what you know about me, which ones would best suit my style?\r\n\r\n\r\nElizabeth Knopf (32:22.456)\r\nfor which topic are we on the personal, like decision, this is decision frameworks for decision making.\r\n\r\n\r\nNikolas Hulewsky (32:26.27)\r\nMm-hmm, frameworks.\r\n\r\n\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (32:34.302)\r\nor what?\r\n\r\n\r\nNikolas Hulewsky (32:51.009)\r\nsee you at the office.\r\n\r\n\r\nGreat question, too. So nice. Great question and a smart next move. I just said based on my personal history and what you know about me, which ones would best suit my style or what frameworks not included on this doc would you recognize in my interactions with you? So the top frameworks from the existing dot that suit me, spade. You naturally break things into context, stakeholders, options. Okay, cool. So it gives me here the ones from this doc.\r\n\r\n\r\nElizabeth Knopf (32:57.774)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (33:22.539)\r\nAnd then it says the one's not listed, the barbell strategy. Cool, that is true. Regret minimization framework, that's yes, very true. I got a Charlie Munger in here, inversion. Rad, so now I can take this.\r\n\r\n\r\nand add it and like, would you like me to add these missing frameworks to your decision frameworks document? Yes, please. And now it's creating me a document that I can go and upload to cloud. This is so cool. Well, I can't wait to build out the rest of this because I think that it will be helpful as I'm trying to get more organized and used AI more. Let me ask you this question though.\r\n\r\n\r\nbased on what you've seen so far, any advice or like, hey, this is a really good start, but you need to make sure that you're looking for X, Y, Z things.\r\n\r\n\r\nElizabeth Knopf (34:10.19)\r\nyou\r\n\r\n\r\nElizabeth Knopf (34:19.43)\r\nWell, would say like help give it also like a because it'll just sort of so Claude will end up pulling either all of the things or it'll make the decision on what to do. So you almost want to since you now have like 10 different frameworks, this is sort of getting meta, but like how does it decide which framework to use for what? Yeah, so that's like if you have an opinion on that, if you want it to figure it out, it will do that. So I would say that's like one thing. Number two,\r\n\r\n\r\nNikolas Hulewsky (34:34.322)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (34:39.851)\r\nto apply.\r\n\r\n\r\nElizabeth Knopf (34:48.514)\r\nyour project knowledge is gonna be important, because it will pull on that even if you don't ask it to, unless you explicitly don't ask it to. So connecting specific documents to that is important. But I mean, I think you're on the right track here. It just depends how detailed you wanna get, and you don't wanna also overwhelm it. So, and when you're, yeah, so like,\r\n\r\n\r\nNikolas Hulewsky (35:14.025)\r\nYeah, that's how I feel.\r\n\r\n\r\nElizabeth Knopf (35:16.824)\r\nyou'll wanna think what are the main things. And again, it'll learn from your example. So even if you have to iterate, that's totally fine. But like, for instance, I piled in a bunch of stuff in a project knowledge document and sometimes it'll pull the wrong example than what I want it to. And so you just have to be very specific in your instructions as well. So those are just like some small tips that I think are fairly intuitive, but just to highlight and call out.\r\n\r\n\r\nNikolas Hulewsky (35:44.863)\r\nOkay. Cause I, I think there's a lot of value in helping you codify, you know, the Liz operating system or the Nick operating system. I don't want to over-engineer it, but I do want it to be there. Like, Hey, it's Tuesday. You got this email that you do need to respond to. And by the way, you're doing this later. You might want to prepare, make suggestions, even as silly as it sounds like, write me the first draft of a response to so-and-so. Cause sometimes.\r\n\r\n\r\nI have ADD and it like overwhelms me or like gives me anxiety to like respond to somebody. So I just like the idea of it getting me going. And then at some point I can automate a lot of things, but I'm just trying to clap my hands.\r\n\r\n\r\nElizabeth Knopf (36:23.724)\r\nYeah. Yeah. Well, I feel like you lost a pound today. So I think we've at least gotten through your goal, your mini goal.\r\n\r\n\r\nNikolas Hulewsky (36:31.457)\r\nYes. Yes. Okay. All right. Well, I love this. I got a ton of value. I can't wait to show you what I've built next week and don't judge me too harshly, we'll talk soon. Cool. All right. Stay.\r\n\r\n\r\nElizabeth Knopf (36:41.998)\r\nAll\r\n\r\n\r\nElizabeth Knopf (36:47.32)\r\nAll right, sounds good. Thanks.",
  "metadata": {
    "duration": "",
    "date": "2025-06-04",
    "platform_source": "Google Drive"
  }
}