{
  "episode_number": "189",
  "episode_title": "How Meta's Major Moves are Shaping the AI Landscape with Elizabeth Knopf",
  "guest_name": "Elizabeth Knopf",
  "business_name": "Meta, Scale AI, OpenAI, Microsoft, Google, Anthropic",
  "transcript": "﻿Nikolas Hulewsky (00:01.218)\r\nLiz, we've both got our caffeine. We are very ready to discuss the changes that are happening today. know, a couple of weeks ago, we focused on Google. Last week, we focused on OpenAI. And this week, it's Metta's turn in the sun. They made some pretty big moves this week. They were not ready to just sit on their hands and let everybody else do some big deals on the side. So they stepped into the sunlight. Tell us what they did this week.\r\n\r\n\r\nElizabeth Knopf (00:28.124)\r\nYep. So, MEN has sort of made very small progress lately. They haven't been the forefront of AI, which oddly enough, they probably have the most data, the most sort of AI capabilities. And maybe if you want to argue, were some of the first AI-ish, or was one of the first AI-ish companies. But they were playing catch up because they started off with their Olamma model, which was their open source model.\r\n\r\n\r\nAnd then they came out with their Meta.ai platform and sort of integrated their AI into a bunch of tools, but they're still behind. so, Zach doesn't want to be behind. And so, he made two really big moves. Number one, there was a big acquisition with Scale AI. And number two, he has secured a massive energy deal. So, which one do you want to dive into first?\r\n\r\n\r\nNikolas Hulewsky (01:19.256)\r\nDude, I want to do scale AI because we talked about the aqua hire open AI did last week with, between Sam Altman and Johnny Ive, which was like a $6 billion aqua hire, which was nuts. And Mark Zuckerberg is like, well, that's cute. You think you have a lot of money. I have even more money than you do. So I'm to go aqua hire this company called scale path or excuse me, scale AI scale path, fricking Twitter scale AI, their CEO and founder. What's his name? Andrew Wang.\r\n\r\n\r\nElizabeth Knopf (01:23.634)\r\nYeah. Yep.\r\n\r\n\r\nYes.\r\n\r\n\r\nElizabeth Knopf (01:48.158)\r\nAlexander Wing.\r\n\r\n\r\nNikolas Hulewsky (01:49.548)\r\nAlexander Wang is kind of a wonder can he's 28 years old. They tap him to now head up their AI initiatives essentially. But it's kind of weird, right? The structure is kind of different than what you would typically expect.\r\n\r\n\r\nElizabeth Knopf (02:05.096)\r\nYep. So basically they've paid, think it was like over $14 billion for 49 % of the company. But really what they wanted to do was shift Alex or Alexander over to become sort of an exec at Metta and head up with what is being termed super intelligence, which we can even talk about. Yes. Another fun term because everybody has to, you know, create terms in this world.\r\n\r\n\r\nNikolas Hulewsky (02:31.662)\r\nSo, okay, the last time they raised, they raised in 2024 at a, believe, $14 billion, yes, $14 billion Series F. This puts them at a $29 billion valuation about a year later. Could you imagine that? You start this company, you scale it, you sell it, and it's essentially an aqua hire. Like you feel amazing because you're a billionaire, but really you just another richer billionaire.\r\n\r\n\r\nacquired you because they wanted you to come work at their company.\r\n\r\n\r\nElizabeth Knopf (03:05.172)\r\nI mean, it is wild. It's sort of like the order of magnitude of these companies. Like I remember, you know, 10 plus years ago, you didn't think there would be multi-billion dollar companies. And now we have trillion dollar companies in tech. And it just seems like the numbers just keep getting bigger and bigger, especially with these guys. And I mean, everyone's throwing around a ton of money at this point, about a trillion dollars has been invested into AI over the last 10 years.\r\n\r\n\r\nAnd so investors start need to see return and sometimes that return is through an acquisition or just changing of hands of providing liquidity. So not saying that that was the case in this, I think they just really wanted this guy.\r\n\r\n\r\nNikolas Hulewsky (03:48.248)\r\nWell, yeah, and they did it in a really creative way. So they acquired less than 50%, mind blowing. So their $14 billion was less than 50%. The way I'm reading it is that they did this to avoid regulatory scrutiny. They don't want the FTC coming in and saying, these are monopolistic tendencies. They don't want have to go through the process of getting governmental approvals. So they purchased a minority stake, but-\r\n\r\n\r\nThe valuation looks insane because they just raised for 14 billion last year. Now it's 29 billion. So there's some question marks there. However, all those things to the side, you just said they really wanted this guy and they've now tapped him to run super intelligence, which is nuts. Why did they like him? What is scale AI? Like what makes him so valuable?\r\n\r\n\r\nElizabeth Knopf (04:32.85)\r\nYeah. Okay. So there's, think a couple things and I don't, there's one part that I don't know if is true, but I will speculate. So the first part is this guy, Alexander Wayne. mean, I think he has built a really good culture at his company. He started this sort of trend around meritocracy, obviously in the face of some of the other points of view on company culture with DEI and everything over the last, you know, five, 10 years here. And so he's been a strong sort of\r\n\r\n\r\ncomponent of that and leading the way among many efforts around that. But beyond that, the company is actually really interesting. So he developed this company, Scale AI, which essentially provides like data labeling, annotation, and a way to help build and train models. So that's obviously sort of the guts and core or the DevOps, if you will, of the of the models and how you actually build them. And so the thing that I'm expecting, go ahead.\r\n\r\n\r\nNikolas Hulewsky (05:25.72)\r\nSo, no no no, finish with that and then I'll...\r\n\r\n\r\nElizabeth Knopf (05:29.62)\r\nSo the thing I'm speculating on though, that I think is maybe the interesting cutthroat element is that some of their customers include the government, General Motors, but it also includes OpenAI and Microsoft. And I don't know if they have, not, I didn't see any on Google, but some other really big companies. Yeah. Okay, so they're getting insights.\r\n\r\n\r\nNikolas Hulewsky (05:51.426)\r\nNo, Google. No, Google's a really big client of theirs.\r\n\r\n\r\nNikolas Hulewsky (05:58.542)\r\nYeah, so I want to back up a little bit because I'm an idiot. You were like, oh, it's data labeling and helping with LLMS. So would a company who has just access access to a ton of data come to scale AI and say, hey, we want to create our own internal LLMS. We need your help labeling effectively all of this data so that we can actually make something out of it. Like, is that how they would use scale AI? OK.\r\n\r\n\r\nElizabeth Knopf (06:23.39)\r\nExactly. So it makes it just easier. So for instance, like if you come with data and it's, you know, the simplest way to think about it in the earlier stages before a model could know like, is this a cat or is this a dog? Or even sometimes when you go on the captures, it says, you know, drag this over to identify the bridges on these pictures or whatever. You're basically doing data labeling just in a sort of secretive way.\r\n\r\n\r\nNikolas Hulewsky (06:39.587)\r\nYep.\r\n\r\n\r\nElizabeth Knopf (06:48.018)\r\nBut that's essentially what you're doing is just saying, is this, this is that. Like, is the model correct? And then choosing the next one as to, is this the cat or is this the dog? Is this the bridge? And it creates, yeah, a more scalable way to do that.\r\n\r\n\r\nNikolas Hulewsky (06:56.855)\r\nOkay, okay.\r\n\r\n\r\nNikolas Hulewsky (07:02.008)\r\nSo to your point though, Google is actually their largest customer. And Google came out and said, we're done. We're cutting ties with them if they're going to Meta. It looks like OpenAI and Microsoft are going to do the same thing. So it almost looks like Meta had to raise their price knowing that these large customers would effectively cancel. That's how bad they wanted this guy. Is this guy the next Elon Musk? what's the deal?\r\n\r\n\r\nElizabeth Knopf (07:05.886)\r\nMm-hmm.\r\n\r\n\r\nElizabeth Knopf (07:28.712)\r\nYeah, I mean, I don't know if it's that. I don't know if it's data, because the other piece I heard too recently is that Meta is also getting rid of their content moderators. And so not to say that this would basically equate to the valuation and what they paid, but I think a combination of the data insights and how they've been able to sort of figure out the best practices, they probably will have footnotes of those insights of what those models look like or something interesting there.\r\n\r\n\r\nNikolas Hulewsky (07:50.84)\r\nHmm.\r\n\r\n\r\nElizabeth Knopf (07:56.34)\r\nPlus the people, obviously, I'm sure he hired well and also is a really interesting person they wanted to bring on. And then I think this third piece is there's actually some operational needs that they have because they are probably one of the largest scale companies with so much data that even though I'm sure they've built plenty of tooling themselves, they move fast and break things. So they probably need a tool to help build out maybe more of that infrastructure as well.\r\n\r\n\r\nand they just got rid of their content moderation team, so they're gonna start using AI for that. So I don't know if they're using this platform, if that would make sense as well. So I think there's, yeah.\r\n\r\n\r\nNikolas Hulewsky (08:35.202)\r\nThat's really interesting and it kind of puts this next story that we're going to talk about in context. Meta is basically saying, we've got all the data. We can cut teams. We can implement AI. Why are we behind in this AI arms race? Let's go out and get Alexander because we're going to make sure that we leverage this information as best we can. And while we cut people, we're also going to go on the other side of things,\r\n\r\n\r\ncreate an agreement with I didn't know this, the Clinton Foundation freaking owns a nuclear power plant for up to four gigawatts worth of nuclear energy is what they negotiated. So on the back end, they're like, okay, if we're going to cut these humans, we're going to need more power. Let's go out and secure a power contract, which is what they did this week, kind of upwelling out some other players in the space. Does that is I wonder if that's kind of the way that they're thinking about it.\r\n\r\n\r\nElizabeth Knopf (09:32.498)\r\nYeah, mean, he's figuring out, I mean, he's good about probably figuring out all the vertical, I mean, right now it's like vertical integration because again, the two biggest data providers that have the most data are Meta and Google. Open AI and Anthropic, they don't have that advantage even though they've been using the open web and other probably concerning practices or whatever. But I mean, these two incumbent.\r\n\r\n\r\nhave a leg up. So now it's figuring out how to deploy that capital to create the next leg up. And so I know that, for instance, one of the reasons back in the day Southwest used to be the only like profitable airline was because they bought Energy Futures contracts because their whole business is dependent on energy. And so Zuck, you know, sort of analogous to this industry, like energy is going to be a huge component of the future.\r\n\r\n\r\nNikolas Hulewsky (10:17.036)\r\nHmm.\r\n\r\n\r\nElizabeth Knopf (10:25.636)\r\nand probably of profitability depending upon how the landscape shakes out. And so as we sort of harped on in the last couple of weeks, he's figured out that, okay, let's buy essentially, I mean, I don't know if you can officially qualify it as energy futures, but that's essentially what he's done. He's bought a future contract over 10 years at a certain rate for a certain amount of capacity. So.\r\n\r\n\r\nNikolas Hulewsky (10:47.704)\r\nSuper smart. mean, check this out. Are you ready for this? So this year, what percentage of the total electricity consumption in the United States is consumed by AI data centers?\r\n\r\n\r\nElizabeth Knopf (10:50.206)\r\nGo for it.\r\n\r\n\r\nElizabeth Knopf (11:02.24)\r\nthis year, maybe 10%, maybe 10%. I don't know if that would even be that. Okay. 4%. Okay. Okay. That's high.\r\n\r\n\r\nNikolas Hulewsky (11:04.621)\r\nthis year.\r\n\r\n\r\n4%, 4%. Okay, five years ago in 2020, again, just AI data centers, what percent?\r\n\r\n\r\nElizabeth Knopf (11:16.98)\r\nProbably like under 1%.\r\n\r\n\r\nNikolas Hulewsky (11:19.15)\r\nYeah, yeah, about that 1%. In five years by 2030, the projection, what do you think it's, we go from 4 % to what?\r\n\r\n\r\nElizabeth Knopf (11:28.356)\r\nMaybe, okay, so maybe it is 10 to 15.\r\n\r\n\r\nNikolas Hulewsky (11:32.002)\r\nYeah, 10%. 10 % is the current projected usage. personally would bet I would take the over on that bet. But if you look at it from that perspective, it's like, we went from one in 2020 to four in 2025 to 10 % in 2030. That's as the total consumption per capita is growing. So AI data centers are sucking up a ton of energy. And what Zuck just did\r\n\r\n\r\nElizabeth Knopf (11:33.299)\r\nOkay.\r\n\r\n\r\nElizabeth Knopf (11:39.965)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (12:01.142)\r\nin one fell swoop is say, all right, I'll buy the futures contracts. I'm going to lock in these rights for the next five years. And I'm going to do it with a renewable energy source. I don't know if there's any ulterior motive for him to do this. I don't think that there is nuclear power is very cheap. It is also very consistent, which when you look at other renewable sources of energy, solar wind in particular, those are very inconsistent. They have peak hours where\r\n\r\n\r\nThey are actually effective and ones where they're not. But nuclear is really consistent. In my mind, he's like you said, he's making a bet on the future. They need this energy. And so he's buying it outright as he is seeing the pendulum swing the other way as he's cutting the workforce and using AI more in his business. mean, is there any manager better than Mark? He's phenomenal, right?\r\n\r\n\r\nElizabeth Knopf (12:54.332)\r\nI mean, it's pretty, yeah. I mean, and if you think too, he's really good at, even though he sees the future, he's able to course correct really quickly. Like he was all in on AI or in VR and the metaverse and that didn't really plan out. And so he, you know, just cut his losses and has shifted aggressively in this direction. And I'm sure at some point we'll go back to that because that was, think, just a little bit early. So, I mean, he is pretty incredible.\r\n\r\n\r\nNikolas Hulewsky (13:15.693)\r\nNo.\r\n\r\n\r\nNikolas Hulewsky (13:23.874)\r\nThat is something I do not, can't do. Like just to know when to double down and when to cut your losses. Like he rebrands to Meta, IE the Metaverse. And then just a few years later, he's like, nah, peace out. And he like totally forgets that whole portion. But man, he's done an amazing job at managing that company. I'm just, I'm super freaking impressed with him.\r\n\r\n\r\nElizabeth Knopf (13:26.056)\r\nYes.\r\n\r\n\r\nElizabeth Knopf (13:49.384)\r\nYeah, absolutely.\r\n\r\n\r\nNikolas Hulewsky (13:52.622)\r\nAnyways, we'll see how it all plays out. was cool. It's like every week it's like, shoot, Meta did something. All right, here comes OpenAI. OpenAI did something. it's Google's turn. Spoiler alert, I've ordered the Ray-Bans. really, yeah, yeah, I'm really interested to see how they look and feel because the one thing I read that tipped me was, I don't know how it works, but I'm assuming they like,\r\n\r\n\r\nElizabeth Knopf (14:09.372)\r\nyou did? Okay. Okay.\r\n\r\n\r\nNikolas Hulewsky (14:22.2)\r\ntransmit the audio through the actual whatever glasses and you don't have to have headphones in and So I'm like that would be that would be actually really cool to not have to have earbuds in my ears all the time I wonder what it would be like to have these glasses on and be able to take calls. So we'll see I'll I'll bring them on here when I get them\r\n\r\n\r\nElizabeth Knopf (14:26.929)\r\nhuh.\r\n\r\n\r\nElizabeth Knopf (14:30.168)\r\nElizabeth Knopf (14:40.668)\r\nYeah, sure. Looking forward to that one. Almost did that as a Father's Day gift, but didn't do that. My husband is not as geeky as I am, so I didn't think he would maybe go well with that, but anyhow.\r\n\r\n\r\nNikolas Hulewsky (14:43.884)\r\nI\r\n\r\n\r\nDid you?\r\n\r\n\r\nNikolas Hulewsky (14:58.998)\r\nYeah, it's like the husband who buys his wife a bread maker. it's like, the wife's like, I don't like making bread. But the husband's like, well, I really like bread. So I got you a bread maker. It's like, here, honey, I got you these Raybrand glasses. I don't even like these glasses. I know, I know, but aren't they cool? I really wanted them. That's amazing.\r\n\r\n\r\nElizabeth Knopf (15:09.512)\r\nRight, exactly, exactly.\r\n\r\n\r\nElizabeth Knopf (15:17.0)\r\nRight. I sent him an AI message for our anniversary and that didn't play out well. And he was like, I made it with a video. took one of our photos and he was like, okay. He's like, definitely thought this was cool. So I already talked about reaction.\r\n\r\n\r\nNikolas Hulewsky (15:35.192)\r\nThat's amazing. All right. Well, a week or two ago, you walked me through the process of creating my own executive assistant and it was freaking amazing and mind blowing. I've been playing around with that. And at first I thought it was cool that Google was integrated with Claude. And then I started messing around and looking at the settings and seeing integrations. And I was like, what are these? You can integrate Zapier. You can integrate.\r\n\r\n\r\nYou know HubSpot like there are bunch of integrations and all you have to do is then ask. Claude hey, can you go and pull this data for me and populate it in this spreadsheet like I can operate using the search window to do other things outside of quad and it has been mind blowing and you tell me this is this thing called MCP. What are we doing here? Liz? What is happening? Are we living in the future? What is MCP?\r\n\r\n\r\nElizabeth Knopf (16:26.13)\r\nYes.\r\n\r\n\r\nElizabeth Knopf (16:31.166)\r\nWe are living in the future and it's exciting. I'm gonna share my screen real quick here just to show, I found a sort of cool analogy and diagram that might help explain it. So first MCP starts or stands for model context protocol. So that's just jibber jabber. No one really knows exactly what that means and you don't really have to, but let me just connect here.\r\n\r\n\r\nNikolas Hulewsky (16:57.954)\r\nWell, effectively, I read about it, Anthropic developed this protocol, which allows these models access to things outside of the model itself. And here we go, using APIs.\r\n\r\n\r\nElizabeth Knopf (17:12.274)\r\nOkay. So before you had this protocol, basically what you would have to do to give access to your models or really any software was something called an API, another fun acronym. And essentially what that is, is like this lock. You can see this lock and a key. So this lock is giving access to the data of a certain software tool.\r\n\r\n\r\nBut the problem was that to connect these APIs, it was one API, sometimes with a tool in between, like a make.com, a Zapier, or other no code platform, N8n, and there's a bunch now. And then you'd have to connect it to another API. So you had these sort of two tools and this thing in between, or you could just hook up directly. But it was always one to one, one to one. And then if you wanted a new one, you had to do a one to one. And so there was a bunch of challenges in doing that.\r\n\r\n\r\nand to connect them to models, was again a little bit challenging.\r\n\r\n\r\nNikolas Hulewsky (18:12.886)\r\nYeah, so if you're if you're just listening what we're looking at here, Liz has this nice diagram up and on the bottom there are these APIs. So there's Google Mail, Google Calendars, Slack Maps. I can't read what that is. Google Drive, WhatsApp and above those is a key and then there's a lock over there. So what Liz is saying is if I wanted to go and access those things, I had to go one to one and create an API key that would allow me to access them and unlock.\r\n\r\n\r\nIs that Figma? Is that what that is? okay.\r\n\r\n\r\nElizabeth Knopf (18:45.982)\r\nYeah, that is Figma. So now what MCP has enabled is basically like a universal cable. So you can basically plug these in. You have this universal cable that then can all be plugged in in this diagram like a laptop. So you have the laptop, you have this little adapter that connects the HDMI, the USB-C, the USB.\r\n\r\n\r\nNikolas Hulewsky (18:55.438)\r\nHmm\r\n\r\n\r\nElizabeth Knopf (19:11.496)\r\nyou know, all the different things and it just makes it super easy to plug in. And you basically can do it once and then you don't have to recreate and connect them one by one every single time. I did not, I borrowed this from somebody. I don't remember who and they don't have their logo, but yeah, I found that the best analogy, the rest sort of break apart, but we all hate, put it this way, you hate having a million cables. So this helps, you know, reduce them.\r\n\r\n\r\nNikolas Hulewsky (19:22.744)\r\nThis is awesome! Did you make this?\r\n\r\n\r\nNikolas Hulewsky (19:28.235)\r\nstill looks great.\r\n\r\n\r\nNikolas Hulewsky (19:40.472)\r\nYeah.\r\n\r\n\r\nElizabeth Knopf (19:42.514)\r\nOkay, so now this has now been around since September. So it's ancient, essentially, at least in the AI world. So Anthropic created this in September, and it wasn't really popular. And it recently only has become popular over the last couple of months because OpenAI has said they're going to adopt it. And I even heard as recently as today, they're going to be rolling out potentially this week.\r\n\r\n\r\nNikolas Hulewsky (19:50.894)\r\nWow.\r\n\r\n\r\nWow.\r\n\r\n\r\nElizabeth Knopf (20:12.124)\r\nsome MCP connections. that's why it's good.\r\n\r\n\r\nNikolas Hulewsky (20:15.832)\r\nSo what I understood why it wasn't so popular is that because even though it had been created, if anybody's ever used the Zapier, you can tell me if I'm wrong here, but if anyone's ever used the tool Zapier, Zapier has created integrations with a bunch of different applications. Now, if you don't use Zapier, you can still use an API key to have an integration with, let's say Slack, but...\r\n\r\n\r\nIt's a much more difficult process to get it set up between your email and Slack. If you don't use Zapier as the middleman. And my understanding was Anthropic created the MCP. the, the, the context protocol, model context protocol, but people just hadn't, or we hadn't yet created the Zapier so to speak that, that made it much easier to connect things. And it's only been recently as open AI has kind of come on board that it's become a lot easier.\r\n\r\n\r\nto create MCPs. Okay.\r\n\r\n\r\nElizabeth Knopf (21:14.164)\r\nYep. And the other reason too is like any point of friction, you get drop-off in users. And so if you start seeing code, which initially you had to like copy and paste code, you know, it scares people away because you miss a bracket and oh, it all doesn't work or, you know, it's syntax oriented and code can be intimidating. And so what Claude has recently done to even decrease that friction, which I think we'll maybe go through this demo.\r\n\r\n\r\nNikolas Hulewsky (21:19.257)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (21:24.995)\r\nYep.\r\n\r\n\r\nElizabeth Knopf (21:40.666)\r\nis they've just now allowed you to drop a URL. So it's easier to copy and paste your URL than copy and paste code. Now there's still plenty of tools that you'll need to do the copy and paste code if you want to get a little bit more savvy, but Zapier sort of unlocks a huge number of tool sets with just dropping one URL.\r\n\r\n\r\nNikolas Hulewsky (22:01.422)\r\nSo let me see if can pull one thing up.\r\n\r\n\r\nNikolas Hulewsky (22:13.762)\r\nNope, that's my chat history. I want a new chat.\r\n\r\n\r\nNikolas Hulewsky (22:20.494)\r\nOkay, I'm gonna share my screen. So what we talked about, I think it was last week, it might have been the week before, that blew my mind was like, cool, I'm here, great, how many emails do I have? I go and look really quickly. Okay, it has access to my Gmail and then...\r\n\r\n\r\nAnd then I can ask this question and it will go and say, this is how many unread. Perfect. It's going and searching my messages. This is how many unread emails that you have. But that was just like one use case, right? Like, cool. We had an integration with Gmail. What you're saying MCP does is with that little graphic that you had is like, yeah, I can have Google and Zapier and Drive and Sheets and Docs and like every, every other application that I use now.\r\n\r\n\r\nand go from this context window and be like, hmm, you know, how many people logged into my website last week from, I don't know, from a blog post that I wrote, whereas in the past, I'd have to go and like, look at that manually that like, it can go and access that information. Okay.\r\n\r\n\r\nElizabeth Knopf (23:30.28)\r\nYep, and so you can think of it like if you're the type of person like I am that has like a million browser tabs open and you never like to close them because you might be using a tool or going back and forth, this enables you the access to all of those tools. So that's number one. And number two, you also don't have to copy and paste anymore. Like copy and paste is dead, which is pretty exciting. It's all in one.\r\n\r\n\r\nNikolas Hulewsky (23:51.918)\r\nIt's amazing, it's amazing. Hold on one second. Come over, what's up?\r\n\r\n\r\nNikolas Hulewsky (23:59.298)\r\nSee next week.\r\n\r\n\r\nNikolas Hulewsky (24:04.92)\r\nHey, I'm on a call right now, but then can I come and see it when I'm done? I love you, buddy.\r\n\r\n\r\nElizabeth Knopf (24:10.74)\r\nall good. All good.\r\n\r\n\r\nNikolas Hulewsky (24:11.969)\r\nSorry.\r\n\r\n\r\nHe found a crystal and said it gave him superpowers. all right. Cool. So do you want to show us an example?\r\n\r\n\r\nElizabeth Knopf (24:20.02)\r\nAmazing. Amazing.\r\n\r\n\r\nElizabeth Knopf (24:27.412)\r\nAll right, let's see if we can share my cloths.\r\n\r\n\r\nNikolas Hulewsky (24:49.422)\r\nI'm trying to think through, wonder if there's like a, do you have like a really good use case that you can just.\r\n\r\n\r\nElizabeth Knopf (24:55.028)\r\nI'm going to scrape some data because I think this is pretty cool for tweets and then be able to do something. So, okay. What I just want to make sure I'm on the right screen here. What do you see right now?\r\n\r\n\r\nNikolas Hulewsky (24:59.532)\r\nOkay. Perfect. Perfect. think that's the...\r\n\r\n\r\nNikolas Hulewsky (25:06.508)\r\nI see a black screen with, I can't really see, yeah, a bunch of integrations.\r\n\r\n\r\nElizabeth Knopf (25:09.908)\r\nYou see integration? OK, cool. All right. OK, so let's real quick just show you how do you even access these. So right now, you do have to have Cloud Desktop, which just Google Cloud Desktop, download it locally, and it's a pretty straightforward setup. Once you've done that, you can go up to this little Cloud dropdown. Are you able to see that still?\r\n\r\n\r\nNikolas Hulewsky (25:37.824)\r\nI still just see the black screen with... I mean, I see your mouse moving around, but I don't see the drop down.\r\n\r\n\r\nElizabeth Knopf (25:39.88)\r\nOkay, let me reshare, hold on with this.\r\n\r\n\r\nOkay, let me do it with entire screen.\r\n\r\n\r\nElizabeth Knopf (25:56.084)\r\nOkay. Now do you see, okay, do you see the cloud dropdown? Okay. Okay. So you're going to want to go up to the upper left where it says cloud. There's going to be a dropdown settings. Then when you're in settings, there's two ways to do this. The easy way, which you'll be able to configure Zapier with is you go to configure and then you go to integrations. And then you can see, I have a bunch of integrations here.\r\n\r\n\r\nNikolas Hulewsky (25:57.518)\r\nOkay. Yeah, now I see it.\r\n\r\n\r\nElizabeth Knopf (26:24.658)\r\nAnd if you scroll all the way to the bottom, these are all the MCPs I already set up. You add integration, you'll add Zapier in here, and then I'll show you where to get the URL for Zapier.\r\n\r\n\r\nNikolas Hulewsky (26:28.686)\r\nCheers.\r\n\r\n\r\nElizabeth Knopf (26:42.686)\r\nSo if you go to, okay, so you're gonna go to actions.zapier.com slash settings slash MCP. And this is a great just page in general, because if you're into the GPTs and a bunch of other tools, this is sort of like great new way they're helping to provide access to these newer tools. Then you're just gonna go to copy URL. And I'm not gonna reveal this because these little dots here are essentially like a password.\r\n\r\n\r\nNikolas Hulewsky (26:42.882)\r\nI'm gonna be doing it while you're showing me.\r\n\r\n\r\nNikolas Hulewsky (27:12.099)\r\nBye.\r\n\r\n\r\nElizabeth Knopf (27:12.596)\r\nYou don't want to reveal that to anybody, but you're going to copy and paste that back in this little window.\r\n\r\n\r\nin this place that says integration URL, and then you'll do add. So again, I already have it set up, so I'm not gonna actively do that here. But then you'll see it's connected. You can also disconnect this and just make sure as you're engaging with your MCPs, if they're connected or not, because from the browser, from the cloud desktop, if you go to these little lines with dots on them, you can see that you can turn them on and off.\r\n\r\n\r\nSometimes I've tried to access them and I'm like, why isn't it working? And it's because of all.\r\n\r\n\r\nNikolas Hulewsky (27:52.62)\r\nYeah, me too. I was such an idiot at first. I was like, why isn't this working? And then had to actually go open and enable it.\r\n\r\n\r\nElizabeth Knopf (27:59.708)\r\nIt's always the user in the chair that's the problem in the chair. So as you can see, I have already enabled Zapier, which we're not going to do right now because I was having a couple issues with them, but I'm going to do Appify, which I should have somewhere set up here.\r\n\r\n\r\nNikolas Hulewsky (28:01.813)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nElizabeth Knopf (28:21.244)\r\nOkay, and then if you add, if you also click the plus sign, you can see other ones you've added. I know I have it, so I don't know why it's not showing up here, but we're going to do, I'm going to scrape some data from Appify. So we're going to tell Claude, use the tool, Appify to get the last 20 X posts by at co-founders, Nick with.\r\n\r\n\r\nthe number of likes and other basic meta data. All right. So let's see how it responds. And a couple of things to note in your prompt is that you need to always say tool. At least that's what I have found. Otherwise, it'll either decide what it wants to use, which can become problematic, or it might not work. So the more specific your instructions are, the better.\r\n\r\n\r\nwhich is one limitation at this point with MCP, but again, it'll only get better. Otherwise, if you sort of give it a generic prompt, it might pick the wrong tools or make different decisions. yeah, so we can see that it went ahead, it requested this from this little thing on Appify, which I'll hop over to you, you can see it's actually working and it's doing some data scraping and getting Nick's last 20 posts.\r\n\r\n\r\nproviding a summary and providing some metadata on it.\r\n\r\n\r\nNikolas Hulewsky (29:50.611)\r\nCan I ask you, I know this is dumb, what's the difference between Appify and Zapier?\r\n\r\n\r\nElizabeth Knopf (29:52.264)\r\nYes.\r\n\r\n\r\nElizabeth Knopf (29:55.796)\r\nOh, no, this is not a dumb question. And that's a great question because most people are not going to know what Appify is. OK, so Appify gives you a way to scrape data. So this is like to make it super easy. That's all it does. It's a data scraper. It just makes it easy to do that. so it's but it's actually a marketplace. like you see, are you still seeing my screen with OK. So here I have Twitter, which is the one that I should have.\r\n\r\n\r\nNikolas Hulewsky (30:07.64)\r\nThat's all it does.\r\n\r\n\r\nNikolas Hulewsky (30:16.814)\r\nHmm. Yeah.\r\n\r\n\r\nElizabeth Knopf (30:24.657)\r\nshould have just ran.\r\n\r\n\r\nand we'll pull it up here. And this one basically scrapes Twitter posts. Okay, I can't display that.\r\n\r\n\r\nElizabeth Knopf (30:44.964)\r\nI don't know if I'll be able to preview this here, but\r\n\r\n\r\nNikolas Hulewsky (30:48.238)\r\nIt's okay. just was like, Appify to me sounds like, turn anything into an app, but it's not that it's go scrape data, essentially.\r\n\r\n\r\nElizabeth Knopf (30:57.116)\r\nYeah, so basically they have this Appify store that you can do, whether it's a website, Apollo, Instagram, Facebook. So like a lot of places that have a lot of data that you might want, it just makes it easier. I would say it's still somewhat of an intimidating site, and you have to like map data correctly, and there's some other little nuances, but by just hooking it up to Cloud, it actually makes it so much easier because...\r\n\r\n\r\nLike in Appify directly, you have to have perfect syntax. And sometimes if you mess that up in Claude, it'll fix that for you. So that's the beauty of it is that your instructions in Claude using MCP tools can be a bit more vague and Claude will just sort of know what to do and fill in the gaps. least that's what I found. So again, this is the worst it's ever gonna be, but it's getting better. Okay, so you can see that it did pull 20 results here.\r\n\r\n\r\nNikolas Hulewsky (31:38.222)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (31:42.316)\r\nYeah, yeah, yeah, yeah.\r\n\r\n\r\nElizabeth Knopf (31:51.508)\r\nUnfortunately, it's going to take too long probably to... Let's see. Okay. Yeah. So this did pull... It's ugly text. This is not the nice looking one, but some of Nick's recent... Happy Father's Day. So that definitely was a recent tweet.\r\n\r\n\r\nNikolas Hulewsky (32:09.196)\r\nYeah, it was supposed to be a joke. It was Happy Father's Day to all the fathers who will be unemployed next year thanks to AI. But nobody laughed at me.\r\n\r\n\r\nElizabeth Knopf (32:15.576)\r\nthere you go. Okay. That's always a warm message. It pulled a bunch of his posts here. And if we go back over to Claude, it gives like a summary. gives some, so if I improved the prompt, I probably would have gotten a better data. Like if I wanted this all in a nice spreadsheet and stuff, it would have been great. And sometimes you can investigate also it's thinking box. I like to call it, I don't know what this officially is called.\r\n\r\n\r\nNikolas Hulewsky (32:19.816)\r\nYeah.\r\n\r\n\r\nElizabeth Knopf (32:44.724)\r\nthat also shows you some interesting stuff. So always make sure to check those as well. So that's like one example.\r\n\r\n\r\nNikolas Hulewsky (32:51.502)\r\nAnd this is Claude, this was Claude showing you their thought process basically. Okay.\r\n\r\n\r\nElizabeth Knopf (32:54.45)\r\nYes. Yes. So like another quick example I'll do is I found this really cool. Okay. Use the PupTier tool to get screenshots of Page En's website. Okay. I just randomly thought of that.\r\n\r\n\r\nSo I have a tendency to not like having to go and take screenshots of things or basically having to browse and do a bunch of things. I don't even know if you just saw my computer just pop open. Hey Jen.\r\n\r\n\r\nNikolas Hulewsky (33:31.702)\r\nNo, I mean, I see it now. I didn't realize that.\r\n\r\n\r\nElizabeth Knopf (33:33.468)\r\nOkay, I didn't touch anything hands free here. I just did that for me. So it went ahead and use this little tool called puppeteer, which is another tool that helps scrape data, but it is browser based. So it interacts with your browser versus using the code base that's underneath the website. And this is very helpful when you're like doing scraping, scraping data that won't allow you to access that data.\r\n\r\n\r\nNikolas Hulewsky (33:37.358)\r\nElizabeth Knopf (34:02.836)\r\nbut it allows you to also take screenshots. And so what I just asked it to do was take a screenshot of this website for, know, whether I want to use it for content or something else. So I don't know what it's doing now, but okay. So it asked me permission. said, always allow. And it will always ask you that if you enable those settings, by the way, to use, your tools so that you can sort of create a guard rail in case it can go nuts. Sometimes you use whatever tools.\r\n\r\n\r\nSo right now it is going through the website and taking a screenshot. I just think this is super cool. So let's see if it did it.\r\n\r\n\r\nNikolas Hulewsky (34:43.118)\r\nFingers crossed. Did it take the screenshot?\r\n\r\n\r\nElizabeth Knopf (34:44.542)\r\nLet's see.\r\n\r\n\r\nElizabeth Knopf (34:49.332)\r\nAll right, so it analyzed.\r\n\r\n\r\nNikolas Hulewsky (34:49.804)\r\nwriting lots of words.\r\n\r\n\r\nNikolas Hulewsky (34:57.366)\r\nIt's still thinking.\r\n\r\n\r\nTo quote Psych, wait for it.\r\n\r\n\r\nElizabeth Knopf (35:10.142)\r\nThere we go. There it is. Okay. So this is where I was like bummed because I was like, it didn't work. It didn't work. But then I went into this little thinking area, this little tool and it came right here. So this is cool too, because you can go in and like, here's a use case. I was building a website for somebody and I had to analyze a website and understand all the different components of it. So it broke down and created basically the requirements document.\r\n\r\n\r\nNikolas Hulewsky (35:11.342)\r\nBoom.\r\n\r\n\r\nElizabeth Knopf (35:37.012)\r\nfor that website. You could also go on your competitor's website and figure out what is converting well or do an analysis there, or again, just get data from these websites. So there's a ton of different use cases, but I just thought that was a super cool one because it's unique and different. Yeah.\r\n\r\n\r\nNikolas Hulewsky (35:52.226)\r\nYeah. So there may be people listening or watching this that are like, okay, I'm not, I'm not using, was it Hey Jen? Yeah. Okay. Whatever. I'm not using Appify or Hey Jen or blah, blah, blah, blah, blah. But so I want to, I want to paint a scenario for them right now that hopefully brings it back home. If you want to get the most out of AI right now, at least\r\n\r\n\r\nElizabeth Knopf (36:00.124)\r\nYeah, was, it was a red one.\r\n\r\n\r\nNikolas Hulewsky (36:19.232)\r\nI've been taking documents that are outside of AI, bringing them in and asking it for help analyzing them. Podcast transcripts, financial data, business listings, maybe even a book or an article. And so what I'll do is I'll find that outside of the AI and I'll plop it in. But that takes time. I've got multiple windows open.\r\n\r\n\r\nMaybe I'm, I want to do some analysis of YouTube and I want to do some analysis of my financials and I want to do some analysis of, you know, my email marketing, open rates, whatever. I've got to go to all of those websites. I've got to open them up. I've got to go find the report and run it myself. And then I got to save it and copy it and paste it and put it into AI in order to get the analysis necessary. So what this does, let's say I'm a small business owner. I want to know how our financials were last month. Hey, what was our net income last month?\r\n\r\n\r\nI can ask that within Claude and say, use my whatever, Great Plains or QuickBooks online tool and tell me what our top line revenue was, gross margin was, and net income was. Great. And it'll spit that information out. I can also sit there and say, hey, use my Zapier tool to look at my Beehive analytics. How are my open rates for the last three newsletters?\r\n\r\n\r\nIt runs it, pulls the data and then gives you the analysis. So in the past where you had to actually get the data, clean it and then put it into the AI in order to get some type of a useful output. Now you can ask the AI to go do those things on your behalf and then it will give you the output without you having to go and do those things. That's the power of MCP. So did I do a good job of like kind of explaining potentially use cases for businesses?\r\n\r\n\r\nElizabeth Knopf (38:08.924)\r\nAbsolutely, you're consolidating your real estate and where you have to be into one window, bringing your content in. Less copy and paste, less switching browsers or tabs.\r\n\r\n\r\nNikolas Hulewsky (38:15.054)\r\nYeah. Yeah.\r\n\r\n\r\nYeah, there's no context switching. You're not having to go to each one of those individually. It's like, cool, once you get those all integrated, boom, you can operate. I mean, think about that. Hey, what was the last email I got from Liz? Are there any outstanding items? Boop, here's last email from Liz. Yep, you need to respond on this. Oh, that's right. Liz asked me to take a look at this pitch deck. Cool. Could you take a look at that pitch deck for me and based on what you know about me, find me the top five red flags and green flags. Boop.\r\n\r\n\r\nhere you go. The top five red flags and green flags that you might like. Okay, let me read into this a little bit more. that's interesting. She's trying to pitch me a biotech company. Hmm. Will you go into my email and take a look at this data that I collect? Like all of a sudden, it's your all purpose executive assistant as opposed to you then having to go and bring all those things that that's that's what's the power of MCP will be. And that's just like my Neanderthal brain thinking about it. I'm sure the second, third, fourth level unlocks are going to be insane.\r\n\r\n\r\nElizabeth Knopf (39:21.8)\r\nAbsolutely. And if you've ever worked with a CRM, I know when I used to work with sales teams, it was like everybody wanted everything in the CRM because they wanted all the context right there. And it's the same thing, but now you can have it like your dashboard for whatever use case and purpose in one spot. So with intelligence, it's awesome.\r\n\r\n\r\nNikolas Hulewsky (39:39.15)\r\nThat's so freaking cool. Liz, Liz, always, mind blowing. Thank you. If you're not, go follow Liz. Find her on Twitter, Leveraged Upside, or wherever her social platforms are, Elizabeth Knopf. We'll talk next week.\r\n\r\n\r\nElizabeth Knopf (39:56.948)\r\nThanks so much.",
  "metadata": {
    "duration": "",
    "date": "2025-06-18",
    "platform_source": "Google Drive"
  }
}