{
  "episode_number": "206",
  "episode_title": "87k MRR & 30% Net Margins? Her Doggy Daycares Print Cash with Shaina Denny",
  "guest_name": "Shaina Denny",
  "business_name": "Dog Drop",
  "transcript": "﻿Nikolas Hulewsky (00:02.757)\r\nNo, let me just make sure my yes. Mike is good. Cool. Shana, you are a venture backed franchise or which I think is freaking fascinating. You've got doggy drop, which is a effectively doggy daycare, but you've got a new spin on it because you've you're adding a tech a tech component to us. It's a tech enabled business. You've got currently four locations open 15 under development. You're growing like crazy. Tell me.\r\n\r\n\r\nWhat attracted you to the sexiest business in the world? Doggy daycare.\r\n\r\n\r\nShaina Denny (00:36.43)\r\nThat's a good one. Well, I always say dog drop isn't new, but I think the way we're doing it is before we started, before I started dog drop, I was working for an electric vehicle startup. So totally different industry. got a dog and everyone always says you must be obsessed with dogs, obsessed with dogs. I was like, I was trying to get rid of my dog for like two hours a day so I could get work done.\r\n\r\n\r\nNikolas Hulewsky (00:49.925)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (00:57.787)\r\nYou\r\n\r\n\r\nShaina Denny (00:59.554)\r\nBut yes, I am obsessed with dogs and I came from a very different background and somehow was just every day having the same pain point of where can I just drop my dog off for an hour or two so I can get some work done.\r\n\r\n\r\nNikolas Hulewsky (01:13.755)\r\nSo I don't have dogs, I have cats. And for cats, it's like, if I leave for the day, they've got food, they've got a litter box, they're like self-sufficient. I've never had a dog, so like this is an issue, you can't just leave your dog at home.\r\n\r\n\r\nShaina Denny (01:26.274)\r\nSo can leave them at home. My dog was a puppy at the time that I got her. If anything, I was working from home too, even pre-pandemic. And I just wanted to head down and get some work. I'd take her on a walk. It wasn't long enough. I would play with her. It wasn't long enough. If you have kids, I think it's a similar pattern there. And so I just was like, I don't need all day dog daycare. If anything, I'm home and that's kind of one of the perks of working from home and being flexible.\r\n\r\n\r\nAnd I just wanted a place to drop her off so she can get her energy out. And that's really what we're doing. It's not that dogs can't be left at home. What I laugh is we've launched during the pandemic when there is no better time in the history of but everyone is home and people were still going to dog drop every day for a couple hours at a time.\r\n\r\n\r\nNikolas Hulewsky (02:07.685)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (02:15.875)\r\nSo what's the business model like for a doggy daycare? Is it subscription based? it by the hour? Like how does it function?\r\n\r\n\r\nShaina Denny (02:23.33)\r\nYeah, kind of bingo. We wanted to have a common sense business model. So pay for what you use. It's a membership. We even charge in 30 minute increments. If you drop your dog off for 90 minutes, you pay for 90 minutes. You don't have to make appointments, everything the way that people want to use the dog daycare and it's, it's recurring revenue model. So how many, yeah.\r\n\r\n\r\nNikolas Hulewsky (02:43.398)\r\nOK, so there is a membership component to it, but there's also a usage component.\r\n\r\n\r\nShaina Denny (02:48.182)\r\nYep, so each membership, we have a couple different tiers and it's correlated with utilization. So you kind of are buying a bank of hours. And if you use up your hours or your half hours, technically, you can just pay as you go on top of it. Your card, we build all of our software ourselves. Your card's on file. It's kind of like Uber. There's a drop-off pickup and there's no physical transaction.\r\n\r\n\r\nNikolas Hulewsky (02:58.702)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (03:11.185)\r\nGive me one second.\r\n\r\n\r\nSorry, my wife is texting me. It's summertime here, so our kids are like, obsessed with their computers and I've hidden my son's computer and she's like, where's his computer? He's earned it back. So.\r\n\r\n\r\nShaina Denny (03:19.734)\r\nI know.\r\n\r\n\r\nShaina Denny (03:27.382)\r\nIt's 9 a.m. He's earned his computer back.\r\n\r\n\r\nNikolas Hulewsky (03:29.913)\r\nYeah, give me a second. Give me a second. We'll cut this out. Don't worry. Hey, sweetie. On my side in the closet on the very top shelf. It's like, know, the drawer with my socks and exercise. OK, so up up on the very top is this computer. OK, look. Great, now everyone knows where I store my my secret stuff.\r\n\r\n\r\nShaina Denny (03:32.7)\r\nthat's funny.\r\n\r\n\r\nShaina Denny (03:51.246)\r\nThat's where I keep mine too.\r\n\r\n\r\nI tried to look it up. Did you give your password too? Yes.\r\n\r\n\r\nNikolas Hulewsky (04:00.945)\r\nYeah, I did. I always do. Is that the normal business model for doggie daycares? There's this subscription with usage component?\r\n\r\n\r\nShaina Denny (04:09.582)\r\nI think some have adopted and lean that way. I started, lived in LA in Long Beach at the time. It's not like there weren't dog daycares. I started going to place, it was half day or full day packages. I wanted to drop off my dog, I missed the drop off time. I wanted to pick up my dog, was like I had to wait till the end of the day. I'm like, I'll pay the whole day, I don't really know or care. I just want to get her in the middle of the day. They're like, well, we don't have the receptionist to bring her. And so it's just like so many pain points.\r\n\r\n\r\nNikolas Hulewsky (04:21.969)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (04:35.344)\r\nYeah.\r\n\r\n\r\nShaina Denny (04:39.61)\r\nAnd so I wanted to think about it from the way that we use like in a boutique fitness or a human lifestyle of like membership based businesses where I could have access to any location and not go through this very cumbersome experience.\r\n\r\n\r\nNikolas Hulewsky (04:52.835)\r\nInteresting. How much does it usually cost? Like, you don't have to necessarily say doggy daycare, like, excuse me, doggy drop, dog drop. I'm going to get that right. I promise. Generally, generally speaking, like how much does it usually cost per hour? Just generally, not, not your specific franchise.\r\n\r\n\r\nShaina Denny (05:01.614)\r\nThat's okay. drop.\r\n\r\n\r\nShaina Denny (05:09.338)\r\nYes. Well, for a lot don't even have hourly options. I'm not to say none, but most it's half day or full days or packages as well. It's very much varies. I'll talk in California, it can be 30 to 60 plus dollars per day. Totally depends. For us, it's six dollars every 30 minutes and with the daily cap of 60 and it can vary by location.\r\n\r\n\r\nNikolas Hulewsky (05:14.477)\r\nShaina Denny (05:34.882)\r\nSo we're pretty in target with the higher end of the band for most alternatives. But what we do is make it really accessible to people who want to drop their dog off for an hour or two, who are like, hey, I don't have to pay for all day. can drop my dog off for 30 minutes of off-leash play for six bucks. I mean, it's kind of a massive win.\r\n\r\n\r\nNikolas Hulewsky (05:55.099)\r\nAnd then they have a bank of hours effectively where they can pull from. And if they go over that, then you charge them. Okay. So if I'm somebody who was like, need five, five days a week, eight hours a day. Do you have people like that? Yeah.\r\n\r\n\r\nShaina Denny (06:08.398)\r\nYeah, fanatic. Yep. We got, don't worry. We got something for you. Uh, that's our fanatic membership, which is unlimited exactly what it sounds like. It's about 700 a month and that's pretty much in target. And, um, I think our South Florida location, it's around 550 a month. So it does vary by market, but I mean, even in LA, there are places that charge 900 plus a month. I'm in the Bay area now upwards of 900 a month.\r\n\r\n\r\nNikolas Hulewsky (06:13.189)\r\nHow much does that usually cost?\r\n\r\n\r\nNikolas Hulewsky (06:28.721)\r\nHmm.\r\n\r\n\r\nShaina Denny (06:36.002)\r\nIt totally varies by facility and market, but we try to be as as possible.\r\n\r\n\r\nNikolas Hulewsky (06:38.641)\r\nWhat do I get for that? $700 a month.\r\n\r\n\r\nShaina Denny (06:42.648)\r\nfor a year. Yeah, if you're fanatic, it's 7am to 8pm all day, every day. No, no, we're closed on Sundays as well. But it's exactly what it sounds like. You're not paying any extra. What's also super cool is you could access any dog drop location and not pay more. So I don't know any other.\r\n\r\n\r\nNikolas Hulewsky (07:00.273)\r\nHmm?\r\n\r\n\r\nthat's awesome.\r\n\r\n\r\nShaina Denny (07:03.508)\r\nIf yours that do that, but you have 700 bucks a month and you could access any location. We've had our LA members visit Denver, vice versa. They're going, you know, on a trip. People want to travel more with their dogs. There's dog friendly Airbnbs, dog friendly hotels as well, but they still want to go out skiing for the day or go to Universal or they have a business dinner that they can't leave their dog at the hotel for. So then they would have access.\r\n\r\n\r\nNikolas Hulewsky (07:13.551)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (07:27.259)\r\nSo when I drop the dog off, what's the dog's experience? Are they manicured? Do they get chef treatment? Is it all gluten-free? Free range chicken? What do they do at the doggy daycare?\r\n\r\n\r\nShaina Denny (07:43.896)\r\nWe do use vegan dog treats so that we don't have any animal proteins on the park is what we call it. It's not a bougie Beverly Hills dog daycare. I always say this, it's for the masses. It's very high quality. I equate our brand much more to like a Warby Parker. So Warby Parker, it's clean, it's affordable, it's consistent, and it's also good quality, but it's not some super bougie eyewear brand, right? And so that's really important to us.\r\n\r\n\r\nNikolas Hulewsky (08:10.149)\r\nWhen I My wife and I have a have a membership at the YMCA now coming from California hearing about the YMCA I'm always like YMCA's are junkie, know But here here in Boise like the YMCA's are actually super nice and as a part of our family membership at YMCA we get two hours a day where our kids can go to it's either kids zone or kids club or the YAC the youth activity center anyways\r\n\r\n\r\nShaina Denny (08:15.191)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (08:38.639)\r\nIt's pretty nice though. I've actually been really impressed with it. I've gone to some gyms where it's like, yeah, we have daycare and they just plug them in front of a TV and then like leave them alone. But my kids, they have an indoor outdoor, they can play outside, there's coloring, like the people that are there are really involved with the kids and they have a good time. They met a lot of really good friends there. Is like, can that happen at a doggy daycare? I've always seen dogs, usually they're like, yapping at each other and about to fight. Like, do you have them?\r\n\r\n\r\nmingling with each other? Are they just like in different corners?\r\n\r\n\r\nShaina Denny (09:09.013)\r\nOh no, it's really cool. mean, you have to follow our social media accounts. You get a kick out of it. It's more of a structured daycare approach. So it's not a free range approach. mean, the dogs are all off leash. They're not in kennels and crates all day throughout the day unless they're having a feeding. We do feed dogs separately. I always laugh when people ask, do you feed the dogs open? I'm like, you clearly haven't had a dog. If you think.\r\n\r\n\r\nWe're gonna put a bowl of food down with 30 other dogs. And then our dropper is the daycare attendants. They're CPR certified, they're trained. And what's cool is like these folks are really, I don't wanna say easy to recruit, but we get a lot of applicants. Even before launching our Florida location earlier this year, we had over 402 applicants to our daycare attendant role. And so I think that's one thing that this is really need to look at.\r\n\r\n\r\nNikolas Hulewsky (09:34.737)\r\nYou\r\n\r\n\r\nNikolas Hulewsky (09:58.98)\r\nWhat?\r\n\r\n\r\nShaina Denny (10:02.018)\r\nis am I going to be able to attract talent? And I think from being in the pet care industry, we had that going for us. And then with our brand and the way they see how we do things, we get so much great talent that wants to work with us. And so it's very cool. And even from the Cummingson window vinyls alone, we'll get applicants. And I'm not saying they're all highly qualified, but it's great to be able to attract that many. Yeah.\r\n\r\n\r\nNikolas Hulewsky (10:28.241)\r\nThat's awesome. Okay, so I'm gonna share my screen and if you're at home, you need to go watch this on YouTube or if you're on Spotify, you can take a look at this. this is the Hollywood location, Dog Drop Hollywood. And it looks like we have two employees out here. No, no, no, no, what you do thing? So we're walking in. Oh, this is cool. Here's the drop.\r\n\r\n\r\nShaina Denny (10:40.456)\r\nyeah? Yep.\r\n\r\n\r\nNikolas Hulewsky (10:57.847)\r\nOkay, we got some hats, some merch. you can buy merch. poop bags. Wow, the branding and looks fantastic. my gosh, I love this.\r\n\r\n\r\nAlright, so we're looking at some text playing with some dogs. cool.\r\n\r\n\r\nNikolas Hulewsky (11:18.289)\r\nAlright, so you're showing different levels of activities that they can play with.\r\n\r\n\r\nman.\r\n\r\n\r\nI don't think I've ever wanted a dog more at this point. my gosh. Okay, so there are like different levels of activities that they can do. It's not outside though. Like the Hollywood one looks like it's inside.\r\n\r\n\r\nShaina Denny (11:36.418)\r\nYeah.\r\n\r\n\r\nShaina Denny (11:40.46)\r\nIt's all a door. And so when we think about sites selection, everything is intentional. People like, that's so convenient that you do that. And you're like, well, it's not just by accident. So we wanted to pick a business in a massive industry, pet care industry. We also picked dog daycare alone. I always laugh. I know if someone's operated a business by the first question they ask me is, well, can we do grooming and day and overnight? I'm like, you haven't operated it. Anyone in pet care? The first thing they say to me.\r\n\r\n\r\nNikolas Hulewsky (11:51.551)\r\nHahaha\r\n\r\n\r\nShaina Denny (12:10.062)\r\nI love that you just do dog daycare. it's so, oh yeah. So our model, it's a one to many model. So very fit, very similar to boutique fitness, right? One instructor to a whole class. So one drop rate, or if you sell our folks, they all wear the dog drop overalls. It's pretty cool. Like even we've had a dog dress up. The parents on Halloween bought the Dickies overalls and a black t-shirt and had the dog walk in.\r\n\r\n\r\nNikolas Hulewsky (12:13.553)\r\nNot at like a doggy hotel or a pet hotel.\r\n\r\n\r\nNikolas Hulewsky (12:23.654)\r\nMm-hmm.\r\n\r\n\r\nShaina Denny (12:38.99)\r\nas a dropperator. So everything with the brand is for Halloween one time.\r\n\r\n\r\nNikolas Hulewsky (12:42.009)\r\nWait, wait, wait, wait, wait, what did you just say?\r\n\r\n\r\nNo, no, no, no, no. What did you name them? A dropperator?\r\n\r\n\r\nShaina Denny (12:48.788)\r\nthe dropper. yeah, it's a thing. Our daycare attendance. Yeah. Yeah. It's a serious role.\r\n\r\n\r\nNikolas Hulewsky (12:53.019)\r\nThat's what your daycare attendant's called, is a dropperator.\r\n\r\n\r\nPlease tell me that you... my gosh. You need to have like a bunch of video... Like... dropperator... Smooth dropper... I love this. This is the case. Amazing branding. And for people who are listening, like, you need to go watch the video that I just did. That's Dog Drop Hollywood.\r\n\r\n\r\nShaina Denny (13:04.59)\r\nI think we'll have you grounded to it. We'll bring your mic.\r\n\r\n\r\nNo, just like...\r\n\r\n\r\nNikolas Hulewsky (13:19.161)\r\nLike you've got a bunch of really good branding. It looks like you even sell merch at your locations. Like you got tennis balls that are dog drop. You got hats, you got shirts, you got little looks like poop bags that they can.\r\n\r\n\r\nShaina Denny (13:27.662)\r\nCompostable waste bags, right? And so we can have them on subscription to anything that's a daily essential that folks kind of go through, right? So compostable bags, individual pond bum wipes, everything. we don't, only, and what's really cool about operating a dog drop as well is we don't have a ton of inventory. So a lot of brands get, you know, kind of crushed from the franchise or they have to hold so much inventory of things that aren't selling.\r\n\r\n\r\nNikolas Hulewsky (13:38.042)\r\nYeah.\r\n\r\n\r\nShaina Denny (13:55.032)\r\nSo we, it's, when I tell people when they're looking at dog drop, I'm like, don't even look at the retail, the business is, it's a membership based business. Can you acquire and retain members and create that vibe? And that's what you're selling. You're selling the feeling of trust, safety and security to the pet parents. It's a vibe. Yep. Because when someone walks in, you get right away, it's dark, it doesn't smell good, whatever. Now you're going to drop your.\r\n\r\n\r\nNikolas Hulewsky (14:13.241)\r\nIt's a vibe. That's amazing.\r\n\r\n\r\nShaina Denny (14:23.266)\r\ndog off there, it's the same with the kids daycare. All the people didn't make eye contact with you. They didn't come out. It's that feeling. It's the same thing approach with our employees. I'm like, doesn't matter what you say. It's the way you made someone feel. And it's the same way of the vibe and environment that you have in your daycare setting. Doesn't matter. I can tell a pet parent, we'll take such good care of your dog and everything. But if they don't get that feeling that we will, then they're not going to choose us.\r\n\r\n\r\nNikolas Hulewsky (14:27.045)\r\nYeah, it's\r\n\r\n\r\nNikolas Hulewsky (14:53.777)\r\nSo let me ask this, because I do have a bunch of questions on the branding side. think that's a really interesting component of it. But high level, if I'm looking at this, I think you said $6 every half hour, so about $12 an hour for these pets, roughly is where we are.\r\n\r\n\r\nShaina Denny (15:09.342)\r\nthe daily cap of 60. So it works very similar. I always say like a parking garage, right? Six bucks an hour, daily cap of 60.\r\n\r\n\r\nNikolas Hulewsky (15:13.105)\r\nOkay. Yeah, yeah.\r\n\r\n\r\nFor the franchisee, excuse me, how many members, or what's the cap on the number of dogs, I guess, or hours that they can have per location? Do you have a way that you look at capacity?\r\n\r\n\r\nShaina Denny (15:33.422)\r\nYeah, yeah, definitely. And what I like, we're the the anti planet fitness model. So we have super high utilization that our members typically go over their membership. So on average, our memberships are around 250 a month is what the average members targeted to spend. And you could probably have about 350 monthly members.\r\n\r\n\r\nNikolas Hulewsky (15:46.033)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (15:51.121)\r\nOkay.\r\n\r\n\r\nShaina Denny (15:56.982)\r\nAnd again, it's going to depend on your membership mix. But even if you looked at our website and you take our memberships, that's probably the average membership price as well. We do have higher tiers. We have lower tiers.\r\n\r\n\r\nNikolas Hulewsky (16:07.793)\r\nHoly balls. Hold on. So 87, I'm just doing math. 250 times 350. 87,500. Yeah, I'm doing my own math here. Cause we're to have a debate later about item 19 of the FDD. $87,500 a month of revenue that one of these doggy daycares, if they're in that ballpark of 350 members and $250 per member per month.\r\n\r\n\r\nShaina Denny (16:16.609)\r\nYou do your own.\r\n\r\n\r\nShaina Denny (16:36.088)\r\nYeah, that's.\r\n\r\n\r\nNikolas Hulewsky (16:39.013)\r\nGood.\r\n\r\n\r\nShaina Denny (16:40.11)\r\nSo off of our locations, it's probably about how many members you can have. And you have a ramp up period as well. We target opening a location with the 100 would be a goal for a franchisee. So it's very similar to, it's called like an orange theory or a rumble, a fitness play in terms of founding members. And then you can look at the memberships and see, what's the average membership price and kind of go from there. Each membership mix may be different by\r\n\r\n\r\nNikolas Hulewsky (16:46.373)\r\nOkay. Sure.\r\n\r\n\r\nNikolas Hulewsky (16:56.207)\r\nYeah, yep.\r\n\r\n\r\nNikolas Hulewsky (17:06.329)\r\nWhat?\r\n\r\n\r\nShaina Denny (17:09.186)\r\nby location and it totally varies on the owner.\r\n\r\n\r\nNikolas Hulewsky (17:12.753)\r\ncost side of things. You said that there was a ratio that you guys like to have for 350 members a month. What is a typical, like what would a staffing ratio look like for that?\r\n\r\n\r\nShaina Denny (17:23.128)\r\nSure, so of course, and you can kind of do your own utilization as well of how many members each day. Obviously, if you see, you saw that Hollywood location, if anyone is listening and this in our FD, yeah, and that was a walkthrough. That was a walkthrough video as well. I think that was even right before store opening. So it wasn't even completely full. The lobby was still missing. So I think our sign and a handful of other items in the parks, that was before the store is fully open. But our ratio is one dog.\r\n\r\n\r\nNikolas Hulewsky (17:28.847)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (17:34.427)\r\nThey were well staffed.\r\n\r\n\r\nNikolas Hulewsky (17:39.557)\r\nYeah, that's true.\r\n\r\n\r\nShaina Denny (17:52.718)\r\nor sorry, one dropper eater for every 15 dogs and a location. Our locations are around 2200 to 2600 as a sweet spot. have locations a little smaller and a little bigger. But when we talk about site selection, we have a very, very specific edge. My favorite part of my business is our real estate strategy. And so we look for much smaller square footage places.\r\n\r\n\r\nSo you're not having three, it's not like 100 % of your members are showing up every day, right?\r\n\r\n\r\nNikolas Hulewsky (18:22.353)\r\nYeah. Okay. So you said one to 15 drop writer.\r\n\r\n\r\nShaina Denny (18:26.51)\r\nSo let's say you have 70 dogs in a day, or even you can go off of 30 dogs in a day. If you have 30 dogs at any given time, you should have two dropperators working. If you have 45 dogs, you have three dropperators working. And I know we got that math down here, the econ guy.\r\n\r\n\r\nNikolas Hulewsky (18:41.915)\r\nThat's amazing. I love the, I love Droparator. That's incredible.\r\n\r\n\r\nShaina Denny (18:48.524)\r\nI'm going to get, I'm going to send you some overalls. You got to wear it. it's so fun. if anyone who didn't see all of our drop Raiders, the whole team, I wear them too. And I go in, we all wear the duck Brown, the car heart or the Dickies overalls, the famous duck Brown. And what's super cool is like, I'll have friends when they see someone out in the wild wearing like the car heart.\r\n\r\n\r\nNikolas Hulewsky (18:50.833)\r\nYes, I'll wear them. Don't tempt me. I'll do it.\r\n\r\n\r\nShaina Denny (19:15.736)\r\nduck brown overalls and send a photo and they put like Dromperator in the wild sort of thing. So it's pretty fun.\r\n\r\n\r\nNikolas Hulewsky (19:23.537)\r\nThat's, that's freaking incredible. Okay. So I'm doing back of the envelope math again. You can neither confirm nor deny it. That's okay. 350 members and you've got the average revenue per month. Excuse me. Yeah. Yeah. Average revenue per month of $250. That works out at $12 an hour. And again, I know this isn't exact to about 30 hours per member. And you guys are open. You said Monday through Saturday.\r\n\r\n\r\nShaina Denny (19:50.894)\r\nSo Monday through Fridays are typically 7 a.m. to 8 p.m. Every location vary. We do and we focus on convenience and flexibility for our members. We want to be open earlier and later. If you don't choose us for anything else, you choose us because we're open. And I'm sure you'll like other things that we have to offer. And then Saturdays may vary by seasonality as well.\r\n\r\n\r\nNikolas Hulewsky (20:13.007)\r\nOkay, I'll just take Saturdays out of them. I'll take Saturdays out of the mix. So you're open for a total of 252 hours a month on average. Again, I'm doing some back of the envelope math here. Each member uses you for 29 hours, which would be, hold on, I'm doing this. You can't stop me.\r\n\r\n\r\nShaina Denny (20:36.398)\r\nYou're not bad at this.\r\n\r\n\r\nNikolas Hulewsky (20:37.777)\r\n10,000 hours so it's a 10,000 hours which would mean drum roll please on any given day you're seeing about I don't have no idea if this is correct 40 dogs tell me if I'm in the ballpark\r\n\r\n\r\nShaina Denny (20:56.244)\r\nI'm not, I can't tell you exactly, but I can say our locations off square footage can fit probably that you're looking at closer to 75 daily dogs on any day. And it's going to depend on your ramp up period. So do we see 40 dogs at any given time? Sure. And you can go and see.\r\n\r\n\r\nNikolas Hulewsky (21:00.123)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (21:07.984)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (21:11.611)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (21:15.508)\r\nWell, okay, so I'm gonna do 70. So that means like at any given time, you need to have between four and five dropperators if you guys are fully staffed. And I'm gonna say a dropperator again.\r\n\r\n\r\nShaina Denny (21:29.326)\r\nWhat, what the, before you go too far, what I also share is a lot of our members in, um, might even just stay for a couple hours at a time. Right. So that's one thing actually, it's really important to our business model and our software is we built in labor management. Um, so let's say this is hypothetical situation. Let's say we saw, I'm going to use 60 because it's a nice number for me, 60 dogs in a day. Right. Um, let's say maybe at that peak, there was only\r\n\r\n\r\nNikolas Hulewsky (21:45.809)\r\nSo yeah.\r\n\r\n\r\nShaina Denny (21:58.35)\r\n45 dogs at the peak, but some came in from, you know, and it's like a bell curve. Some dogs aren't there from, they're not there from 7 a.m. to 8 p.m. So your labor's gonna shift throughout the day. And from a business owner, like, well, how do I know who to staff, right? Actually, that's kind of our magic with the software is that you can see, we've built in this technology. So if anyone's gone to Google and they're like, hey, when is the Starbucks busy? And you can see that bell curve. Hey, 8 a.m., 9 a.m., 10 a.m.\r\n\r\n\r\nStarbucks busy 24 seven and you can see about how many people are there. We have the same thing that on every hour on a Monday through Sunday, even though they were close Sundays, that we can see trends that on every hour how many dots a location has at any given time.\r\n\r\n\r\nNikolas Hulewsky (22:43.151)\r\nDude, I'm I'm struggling here, Shayna. Because even if I said that for 12 hours a day, you're staffed with five dropper raiders at $25 an hour, now that might be low or high. I'm just like doing my own back of the envelope. Yeah.\r\n\r\n\r\nShaina Denny (22:57.646)\r\ntheir hourly wage. So hourly wage is it'll everyone varies by their state we typically pay about a dollar higher than anywhere. So for instance in California we might start at around $18 an hour.\r\n\r\n\r\nNikolas Hulewsky (23:15.185)\r\nOkay, great. even $25, let's say that's like, let's say that's fully loaded, whatever insurance benefits, like whatever the other employer costs are. I'm still only getting to like $32,000 a month versus your $87,000 in top line revenue. So as far as I'm looking at it, you've got incredibly healthy gross margins. And the square footage of these stores is not massive. got it. I got to like estimate somewhere in the ballpark of $5,000 or less.\r\n\r\n\r\nif you're at that like 1500 square feet. So either these are money printing machines or I'm missing something. Like are there other major costs associated with these locations?\r\n\r\n\r\nShaina Denny (23:57.632)\r\nAnd we run our payroll. You're pretty good at this. I think you're pretty close. I'd say one thing, rent totally varies by location. And I'm happy to chat more about our real estate strategy, but that's it's, it's pretty cool what we do. And a lot of that's on the initial investment.\r\n\r\n\r\nNikolas Hulewsky (24:00.197)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (24:19.555)\r\nSo the thing that you've done differently that I think is really interesting is you went and raised venture money. And from what I was reading, the reason you raised venture money is because there is this tech component to it, specifically on, it sounds like labor management. Can you walk through like what? Yeah, so tell me like what.\r\n\r\n\r\nShaina Denny (24:33.39)\r\non it. There's a very big difference in the business.\r\n\r\n\r\nNikolas Hulewsky (24:38.662)\r\nWhy did you go venture and like, what is a differentiator from your company as a doggy daycare versus, you know, corporate day doggy daycare.\r\n\r\n\r\nShaina Denny (24:50.35)\r\nSweet. So my background, I know I spoke really quickly. I've only worked with like early stage tech businesses. To be honest, as naive as it sounds, I'm laughing to anyone here. Like when I started this, I didn't even really know what an SBA loan was. I didn't even know you could like go to a bank. Like everything I had ever known was like venture, venture, venture, startups, tech. Like that's, I never even knew about any other options as well.\r\n\r\n\r\nNikolas Hulewsky (25:10.96)\r\nMm-hmm.\r\n\r\n\r\nShaina Denny (25:17.39)\r\nAnd those were the kind of businesses that I was like inspired by in and that was my world. So when I started Dog Drop, it wasn't to start a single dog daycare. It was how do we build the largest network of dog daycares? And I had to work backwards. Yeah. And so my, my thought was, well, let's start with the pilot. So we raised venture to open our first pilot location. This was in 2019. We started building the first Dog Drop location, which opened\r\n\r\n\r\nNikolas Hulewsky (25:30.057)\r\ninteresting, okay.\r\n\r\n\r\nNikolas Hulewsky (25:38.705)\r\nAnd when was this?\r\n\r\n\r\nNikolas Hulewsky (25:43.473)\r\nOkay. Okay.\r\n\r\n\r\nShaina Denny (25:46.358)\r\nJanuary 2020 as well. And so we want to see does it even work? And I had three things that I was like, this is what I'm testing against. One, do people want to drop off their dog even for an hour or two? So if we can do that, we exponentially open the market size. So currently the dog daycare market was people Monday through Friday, nine to five hours, right?\r\n\r\n\r\nNikolas Hulewsky (25:49.937)\r\nOkay.\r\n\r\n\r\nShaina Denny (26:08.462)\r\nAnd so I look against something like Uber. Uber could have said, well, this is the taxi market and we can take all taxi riders onto our platform. So I could have opened Dogdrop and been like, well, this is the dog daycare market and I can take all these existing dog daycare users onto my platform. But then I said, well, let's create something so convenient and accessible that I've created an entirely new market. So someone living in LA at this time, I never\r\n\r\n\r\ndrove, rode a taxi, right? But then with Uber, I'm like, I have my own car, I'm however much on my car per month, plus another 250 to $300 a month on Lyft or Uber, right? And so the same thing of how do you take an existing market, and even if you can take all those existing users onto your platform, is that big enough? And now how can I 10X it? And that's what we, that was point number one. Point number two was pricing, right?\r\n\r\n\r\nNikolas Hulewsky (26:48.464)\r\nYeah, it's not cheap.\r\n\r\n\r\nShaina Denny (27:06.284)\r\nlike any early stage business that what's what you're trying to figure out. Can I make money?\r\n\r\n\r\nNikolas Hulewsky (27:09.777)\r\nWell, that's what I was going to say. was like, well, I'm not surprised your subscription model, if you're VC backed, right? That's just like all the, it's tech, right? Software as a service is a subscription model revenue.\r\n\r\n\r\nShaina Denny (27:18.604)\r\nAnd you'll then when I talk about our franchise model, it's it's looks exactly like a software model. You pay for something, you get a service delivery. It's not the other way around. So I we were like, yes, people want to say we launched and then the pandemic happened. Right. So people are still dropping their dogs off. I was like, this actually was the most proven way to show that people want to drop their dogs off for two to three hours at a time. So we're like, OK, that was point number one. Point number two was\r\n\r\n\r\nCan we put these models in more convenient locations? I talk about convenience all the time. And so there's not dog daycares on the ground floor of Class A multifamily properties. So that's what we went for first. And so working, and can we get these landlords to subsidize most of our costs? That was number two, yes. Super high TI dollars.\r\n\r\n\r\nNikolas Hulewsky (28:07.131)\r\nWhat do mean?\r\n\r\n\r\nShaina Denny (28:10.924)\r\nSo we put dog drops on the ground floor of apartment complexes and landlords give us a ton of tenant improvement allowance dollars, which highly subsidize our build out costs because they see dog drop as an amenity. The pet amenities are the number one requested amenity. And we have data now that we can help them attract and retain residents if there's a dog drop on site. So we were like.\r\n\r\n\r\nNikolas Hulewsky (28:26.449)\r\nInteresting.\r\n\r\n\r\nNikolas Hulewsky (28:32.987)\r\nSo when you say, let's talk about our real estate strategy, is that the real estate strategy that you're talking about?\r\n\r\n\r\nShaina Denny (28:39.062)\r\nYep, that's part one of it.\r\n\r\n\r\nNikolas Hulewsky (28:41.707)\r\ninteresting. So effectively what you're saying is like, hey, we're going to cut down on the initial investment that any franchisee has to make because you're have to build out these locations anyways. So why not focus somewhere that's going to subsidize that?\r\n\r\n\r\nShaina Denny (28:52.63)\r\nNo, because it's a different model.\r\n\r\n\r\nShaina Denny (28:57.518)\r\nExactly. And then point number three is how much are people willing to pay? And so we tested that and we hit all those marks. Our assumptions were right. And we said, I even, said, let's say we're wrong on everything. Let's say we're completely wrong. People don't want to drop their dog off for a couple hours at a time.\r\n\r\n\r\nNikolas Hulewsky (28:58.641)\r\nInteresting.\r\n\r\n\r\nShaina Denny (29:18.69)\r\nPeople want to pay half day and whole days. People want more inconvenient locations. They don't want to be able to walk downstairs from their apartment. They want to drive 20 minutes off the side of the freeway. So let's say we're wrong. I was like, I can still turn this asset into a standard traditional dog daycare model and make money. Because when I started Dog Drop, I called probably between 60 to 80 dog daycares, boarding facilities, training facilities all throughout California. I'm talking from like\r\n\r\n\r\nRiverside to Fresno and everything else, first trying to see if I could buy their business. Yeah, no one wanted to sell. And that's when I said, yup, that's a good sign. If you call the operators in an industry and no one wants to sell, something that they're willing to do in any industry.\r\n\r\n\r\nNikolas Hulewsky (29:55.045)\r\nThat's a good sign.\r\n\r\n\r\nNikolas Hulewsky (29:59.62)\r\nOkay, so\r\n\r\n\r\nNikolas Hulewsky (30:03.885)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (30:07.803)\r\nWell, I mean, you're benefiting from one of my investment theses that I love is investing in tailwinds, right? So it's like any industry that has a tailwind behind it and people are spending more and more on their pets every single year. So yeah, I love these types of industries that are taking advantage of pet ownership growth and disposable income being spent on their pets. So the first two points though, aren't really venture differentiating points. Yes, the pricing model is different and yes, there's a real estate strategy and component to it.\r\n\r\n\r\nBut those aren't in my mind, they wouldn't be necessarily venture differentiators. What got venture really interested in this model?\r\n\r\n\r\nShaina Denny (30:46.84)\r\nSo I agree with that, but they're critical to the business model to scale it. So those are and and through our software, we can do that. So I think for us, we worked at first with science, their venture fund outside of out of Los Angeles, they incubated Dog Shave Club, Dog Vacay, which was acquired by Rover and anyone follows anything. Rover had some pretty big outcomes, liquid death.\r\n\r\n\r\nNikolas Hulewsky (30:51.552)\r\nMmm, okay.\r\n\r\n\r\nNikolas Hulewsky (31:05.136)\r\nMmm.\r\n\r\n\r\nShaina Denny (31:11.17)\r\nthat we used to share a desk basically with the guys at Liquid Death. So they've incubated everything in between, right? And they're really strong at consumer brands. And so we say, here's out, like there is no household name in dog care. Are we inventing the category of dog care? No, there's, you know, there's wag, there's rubber, okay, there's walking services. There's, we know about the big boarding facilities too, right? There's a lot of things, but we have a specific niche. Our thing is,\r\n\r\n\r\nNikolas Hulewsky (31:15.093)\r\nthat's awesome.\r\n\r\n\r\nShaina Denny (31:40.002)\r\nDo people want to just drop off and pick up their dog and access any location throughout the US super easy? Like we think there's a market for it. I think we can solve that problem. Let's see if we can hit the core fundamentals of the business and how do we build software to make sure that that experience is consistent, that it's scalable and that we can improve the unit economics.\r\n\r\n\r\nNikolas Hulewsky (32:00.401)\r\nSo what is the software? Is it software for the end consumer, the customer who's dropping off, or is it for the franchisee?\r\n\r\n\r\nShaina Denny (32:06.286)\r\nThat's actually what we focused the least on so far, which we have a ton of opportunity there. Most of it's the back end admin and management, everything to run your dog drop business.\r\n\r\n\r\nNikolas Hulewsky (32:18.191)\r\nOkay. And we were talking about this earlier. was franchising, franchising was a part of the investment thesis when you, when you wouldn't, it was not.\r\n\r\n\r\nShaina Denny (32:28.642)\r\nI don't, I start one step at a time. Like, let's prove out these three fundamentals of this. Nothing else matters then, right? Let's see. We see a world that this can be big. I don't know how to get to that world, right? Who am I to say what? I don't like to go into something with this is the only way. I'm not sure. Let's start with one. Okay. Now we'll see it. And then what I saw after operating it, it's like the community of that. I every dog, everything. I was there all day with my co-founder too.\r\n\r\n\r\nNikolas Hulewsky (32:36.762)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (32:49.126)\r\nYeah.\r\n\r\n\r\nShaina Denny (32:58.476)\r\nrunning and operating the business. And then as you get to looking at number two, we're like, hey, you know what was so successful was us as owners. And then I looked at what is our core competency of a business that we're building. I'm like, whoa, what we're really good at is actually all the backend operations. We're doing them so efficiently. What if we can offer that to people? What if we can offer the software, right? There's so many ways to do this. And then how do we create\r\n\r\n\r\npresent this as a vertically integrated solution to someone else, which is a fancy way of literally franchising, right? I'm like, well, that's franchising, but call it what you want. And I left because I was at a conference one time soon after starting Dogdrop. And I think it was the Wolfgang Bakery founder, if anyone knows Wolfgang Groof.\r\n\r\n\r\nWolfgang Bakery and Grooming, think they have, I don't know if they have 300 or 500 or 1,000 locations, honestly, I'm not sure, but a lot of locations and they still, yeah, a lot. They're the big pink guys and they primarily do grooming. And that Wolfgang founder, they had, I think a pretty decent size PE exit about two years ago. The Wolfgang founder, I believe it was him, he said, are you gonna franchise? And I said, no, no one ever asked me that before. I never even thought about it. I never even knew about it.\r\n\r\n\r\nNikolas Hulewsky (33:59.761)\r\nThere are a lot of locations.\r\n\r\n\r\nShaina Denny (34:20.782)\r\nI was at short once he asked that question a handful of other people and I kept being like, no, I don't think so. Then I said, you know, I need to change my tune. Then I started saying, I don't know. And then I started reading and looking more into it and reading case studies and realizing internally what our business is so good at. And I'm like, hey, I think we can do this like pretty differently.\r\n\r\n\r\nNikolas Hulewsky (34:43.749)\r\nWell, it's really interesting. I'm to put words in your mouth here so you can tell me if I'm way off base here. But if I'm looking at it from the outside and I'm like, all right, I wouldn't raise venture money to do this concept, to tackle a big market. And I know that there's an opportunity here and we've done really good on the operations. But in order to scale, you're going to have to go raise more money. I you can have the TI process or excuse me, TI incentives, the tenant improvement incentives, all you want.\r\n\r\n\r\nBut there's still going to be some capital outlay in order for you to open as many locations as you need to and then build out the operator stack, the marketing stack, all that stuff. So that means you're going to have to raise another round and you still may have to raise another round. But there's another option, which is you're effectively crowdsourcing the growth by getting people who are interested in franchising, bringing their own capital to the table and starting these businesses. So.\r\n\r\n\r\nThat's one thing that I'm looking at where it's like, oh, that makes sense. And then you're capitalizing on another tailwind. We talked about the dog day, you know, the pet market, but there's another tailwind that's happening right now, which is entrepreneurship is becoming more and more popular with the younger generations. And so you've got people who are entrepreneurially minded and they want to get into entrepreneurship. They don't know how. And it's like, should I buy a business? Well, I got to sign a personal guarantee of a couple of million dollars. Maybe I'll look into some of these other businesses starting one from scratch. Oh, franchising might be a good option.\r\n\r\n\r\nAnd it's like you're tapping into that as well. That's how I see it. Is that how it's sort of evolved or did I miss something?\r\n\r\n\r\nShaina Denny (36:15.662)\r\nThat's pretty close. It's like a triangle there, right? I think one thing that I say is like, we've raised over $6 million. It's not, and I think I'll see people as like, we're a venture backed franchise. We've raised all this money. And then you ask them how much and they're like, well, we raised 200,000. I'm like, okay, well, that's going to get you through your FDD and hopefully setting up something. And then what? Then you're so reliant on franchise sales. You're so reliant on them.\r\n\r\n\r\nNikolas Hulewsky (36:18.159)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (36:42.384)\r\nYeah.\r\n\r\n\r\nShaina Denny (36:43.47)\r\nthat you have to sell to anything because that's the only way. for better or worse, we've raised over six million, closer to six and a half million dollars. A lot of that is for our technology platform, but it's also to give our team breathing room. If you look at us in the evolution of our business, I'm not going out there selling 10, 15 unit deals. We're selling a few and having these people get them open and we've gone slow to go fast, right? And we've seen these emerging franchisors.\r\n\r\n\r\nthat have said they've raised all this money, but when you ask what's that, it's like, okay, $200,000. you have 300, 800,000, and you're like, as someone that operates a branch as well, I'm like, oof, that doesn't get you far as well. And I think that's important for people to understand is who is on the support team of the branches or can they make it through the other side? Also, are you planning to raise more money to sustain the growth? Our answer is like yes to all.\r\n\r\n\r\nNikolas Hulewsky (37:27.248)\r\nWell, and that-\r\n\r\n\r\nNikolas Hulewsky (37:41.265)\r\nWell, and anybody who's listening that's like interested in franchising, these would be the questions I would be asking is like, okay, well, how well capitalized are you? How much support can you offer on the back end? Again, I did the back of the envelope numbers where I'm like, okay, 80, I'm just gonna round. $85,000 a month top line, $30,000 a month gross, excuse me, $50,000 a month gross margin. This seems like a money printing machine. Again, my word's not yours.\r\n\r\n\r\nwhy don't you have more locations sold? That would be my first question, right? I'd be like, well, this doesn't make any sense, right? If it's that good, then why don't you have more locations? You have 15 under development. That seems like a really small number. So I'll ask it to you right here. You've raised this money. You have a good thesis. It looks like the thing works. Why only 15 locations under development right now?\r\n\r\n\r\nShaina Denny (38:30.254)\r\nSo a couple things, one, we were not going out selling big vanity numbers, right? I'm not selling 15, 20 units open two to three, then we can talk about more, right? As well, so if you think about any, people are like, oh, I buy whole territory. You ask someone else, like, oh yeah, 200 unit center. And that might be 10 to 15 people who are doing 10, 15, 20 deals, right? That's advantage.\r\n\r\n\r\nNikolas Hulewsky (38:41.221)\r\nHmm, okay.\r\n\r\n\r\nNikolas Hulewsky (38:51.665)\r\nthat's really interesting. Yeah, yeah, yeah. Okay, so you're\r\n\r\n\r\nShaina Denny (38:59.022)\r\nThey're able to open those. Awesome.\r\n\r\n\r\nNikolas Hulewsky (39:01.689)\r\nSo you're capping the number of units right now. The number of units that anybody who's getting into the franchise can take on. OK, that's interesting. All right.\r\n\r\n\r\nShaina Denny (39:09.486)\r\noperator as well. We just closed a deal with someone that got very early into orange theory. They were in area red. They had a couple dozen orange theories massively successful through that system and they're starting with a couple. Let's start with the couple and get them open. Do we think that they're going to waste their time to open two to three dog drops? Why would they do that? I don't know. I don't even want to waste my time to open one to three dog drops, right?\r\n\r\n\r\nNikolas Hulewsky (39:37.478)\r\nHmm.\r\n\r\n\r\nShaina Denny (39:38.606)\r\nAnd I mean, you can make good money, sure, off of any location, off of any business that you put into it. But the people that we're talking to is how to build a really big business. So anyone listening, like when you buy a single unit, there is a ceiling, right? There is a ceiling on a location on a brick and mortar business. There is a ceiling on a home service business within a territory. Everyone wants to say it's bigger, but eventually you need more and more and more.\r\n\r\n\r\nNikolas Hulewsky (40:04.561)\r\nHow big is the territory?\r\n\r\n\r\nShaina Denny (40:07.663)\r\nIt will, it's about 250,000 population, give or take on the area, all that fun stuff, but short answer.\r\n\r\n\r\nNikolas Hulewsky (40:14.543)\r\nAnd how much how much time this is one question I was going to ask how much time does a franchisee spend in the business?\r\n\r\n\r\nShaina Denny (40:20.718)\r\nI love that question. It's not a passive investment. My expectation, unless it's not passive, not passive, not passive, 20 times not. My expectation from a franchisee is that this is their full attention. Even the people who owned and operated all these orange fairies, they're operating this with their family full time, right? They're not just starting out right away with the GM.\r\n\r\n\r\nNikolas Hulewsky (40:26.489)\r\nIt's not a passive investment. Okay, cool.\r\n\r\n\r\nNikolas Hulewsky (40:47.121)\r\nMm.\r\n\r\n\r\nShaina Denny (40:49.41)\r\nDoes everyone gonna work towards that? Of course, yes. If you need six months to do that or if you need 18 months, whatever it takes to get your location up and running, get it break even first, then to get it profitable, to have your payback period, that's how long it takes. And I'm very clear on that.\r\n\r\n\r\nNikolas Hulewsky (41:06.801)\r\nWell, that's interesting because would selfishly as well, I don't mean that in a negative way, but just selfishly as well, you don't want people who are like, oh, this could be a passive income stream that I'm going to make $50,000 a month on because you're trying to build a brand and you're\r\n\r\n\r\nShaina Denny (41:20.878)\r\nYou're close but that's your that's a yep\r\n\r\n\r\nNikolas Hulewsky (41:23.759)\r\nNo, I know, know, I know, I know. And that was was gross margin, right? We're not talking about all the net costs of brands and tech and royalties and all that stuff. But what I'm saying is you don't want that mentality because you're trying to grow a brand right now. And the success of these franchisees is going to inform whether or not people in the future want to join you. Right. So if you're bringing on people who are going to set themselves up for failure anyways, then it's a short term win suffering the long term success. At least that's how I would view it.\r\n\r\n\r\nShaina Denny (41:53.614)\r\nYeah, I mean, we actually recently sold our first ever corporate location, my pilot location. We just sold last Tuesday to a franchisee. So he's open. It's super cool to see. He's opening his store in Anaheim, California, right across the street from Angel Stadium. If anyone's familiar, great area. Drop your dog off, go to a baseball game for two or four hours. I was at the Giants game yesterday. I was like, I was pretty long. If anyone saw that.\r\n\r\n\r\nNikolas Hulewsky (42:03.27)\r\nthat's awesome.\r\n\r\n\r\nNikolas Hulewsky (42:12.635)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (42:18.022)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (42:21.295)\r\nI used to work at the Block. Do know where the Block is in Orange? Yes, yeah, really close to Inno. Yeah.\r\n\r\n\r\nShaina Denny (42:24.526)\r\nOh yeah, in Orange, yeah. I told you I grew up in Orange County, familiar with the block. There's the, is it the dance off the wall? What was it? It a skate park. Oh yeah. I don't know, my brother, we'd always drop him off there. And I just spent hours walking around the block waiting for him. Yep. Yeah, it'll give.\r\n\r\n\r\nNikolas Hulewsky (42:33.389)\r\nsure there's look at me do I look like I'm a skater come on\r\n\r\n\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (42:43.153)\r\nThat's amazing. But you just sold your first corporate location, which is awesome. That's fantastic.\r\n\r\n\r\nShaina Denny (42:50.958)\r\nfranchisee time to learn the business before he opens his Anaheim location. So like I'm super excited. People like why are you selling everything? I'm like, oh, it was tough, right? Especially that's first location, everything. But I'm like, what cooler of a proof point is that you have an existing franchisee in your system wanting to buy a corporate location. And I'm like, he's going to learn this business so quick inside and out. I was down in LA all last week spending, I saw all of our\r\n\r\n\r\nNikolas Hulewsky (43:07.814)\r\nYeah.\r\n\r\n\r\nShaina Denny (43:19.252)\r\nOG founding members and I was in there all day that they still go to dog drop. I'm like, my gosh, all these dogs are still here. It was so fun to see. And now when he opened Anaheim, he's going to be like hitting the ground running. So it's very cool to see that.\r\n\r\n\r\nNikolas Hulewsky (43:32.433)\r\nOkay, so I want to ask you some final questions. The final questions are going to be, how much does it cost to get in to one of these franchise locations? And then what are the red flags and green flags I should look for personally? Like, how would I know that this is a good opportunity or a bad opportunity for me? But before I do that, where do you want to point people? Where's the best place for them to go find you?\r\n\r\n\r\nShaina Denny (43:54.892)\r\nYeah, you can find me on X, Shayna Denny, or learn about Dogdrop if you just type in Dogdrop franchise on Google. SQ is pretty good, so it should pop up. Take it from there.\r\n\r\n\r\nNikolas Hulewsky (44:07.055)\r\nOkay, cool. And then I'll do a shameless plug. Go give this a like and follow me. Okay? If you want more interviews like this with Shana, I mean, Shana is top notch. I don't know if anybody's gonna be as good as Shana, but I try to get people on every single week that are at least close.\r\n\r\n\r\nShaina Denny (44:18.904)\r\nI'll give you some referrals, folks, much better than I am.\r\n\r\n\r\nNikolas Hulewsky (44:22.787)\r\nOkay. Night. Stop. Okay. So how much does it cost to get into one of these franchises?\r\n\r\n\r\nShaina Denny (44:31.694)\r\nSure, so for a dog drug franchise per our FDD, it's between 360 to 650 in terms of initial investment. And anyone can look at any FDD and you kind of dive right to item seven and you can see that range. For brick and mortar, it's really going to vary market meaning location. It's going to vary by the space and the renovation. At Dog Drop, one of our core things that we're super gung ho is getting a ton of tenant improvement allowance dollars.\r\n\r\n\r\nmeaning that we could substantially have the landlord pay back our franchisees for some of their construction costs. What we're seeing across the US is that it's very probable to get TI dollars between 50 to $150 a square foot in tenant improvement allowance. That's what the market is giving when you have an amenity. It's different. We can't guarantee that's just the real estate market.\r\n\r\n\r\nNikolas Hulewsky (45:06.288)\r\nGot it.\r\n\r\n\r\nNikolas Hulewsky (45:17.765)\r\nWow.\r\n\r\n\r\nShaina Denny (45:25.59)\r\nnot talking specifically about dog drop, but those are things that you should look for when you're evaluating any retail business.\r\n\r\n\r\nNikolas Hulewsky (45:32.369)\r\nSo 350 to 650, let's say that's the range. What's the buy-in? What's the franchise fee? And then what's allocated to other things?\r\n\r\n\r\nShaina Denny (45:41.966)\r\nSo you kind of brought up a couple of times, oh, it's like a software business, right? So anyone who's looked at franchising, my short answer is, maybe franchise fee is 55 or something K, right? If you look at a franchise business, it's 50 to 60 K. What we've done is we've broken up our franchise fee based on milestones and service delivery. Our franchise fee is $12,000. That doesn't mean that's your all upfront costs. It's still equal to that around that $55,000 mark.\r\n\r\n\r\nAnd then you pay us 10 days later for our onboarding fee. And then you pay us a couple weeks later for our site selection and real estate construction. And then each milestone as we go through before your store opening, you pay us for your training. You pay us for our tech development fee. Then you pay us for the site, everything from there. And that's really important because we're not living off of those, you know, I sold two units, I get 100K today.\r\n\r\n\r\nNikolas Hulewsky (46:11.473)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (46:25.35)\r\nHmm.\r\n\r\n\r\nShaina Denny (46:38.446)\r\nI sell two units, I get $24,000. I need to work every day for my franchisees. I need to tell my corporate team, we're not getting our next invoice until we've done this work for our franchisees. And that's kind of this new wave of thinking as a franchisor that's really important to see is like how are fees spread and what are the people that paid.\r\n\r\n\r\nNikolas Hulewsky (46:58.779)\r\nWell, as a franchisee, I might say, well crap, that means you don't have enough dollars to actually build out a support team that would make me successful. But then you go to the other side of it where it's like, well, we've raised money. We have some breathing room here that allows us to not be so focused on getting you the franchisee to pay for all that support up front.\r\n\r\n\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (47:28.145)\r\nOkay, so in your experience are people getting loans for these or are these like they're paying their own cash or is it a mix of the two? Is this SBA financeable?\r\n\r\n\r\nNikolas Hulewsky (49:06.789)\r\nYeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (49:18.449)\r\nOkay, so tell me then when you're looking at franchisees or if a franchisee is looking, like what are, for them, what are some qualities that you look at and say, hey, this would be a really good fit for you or this would be not a good fit for you?\r\n\r\n\r\nNikolas Hulewsky (50:12.017)\r\nTrue. Yeah, very true.\r\n\r\n\r\nNikolas Hulewsky (50:29.947)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (50:48.987)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (51:04.869)\r\nI love that.\r\n\r\n\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (51:46.415)\r\nYeah, every. That's very true. so you said no?\r\n\r\n\r\nNikolas Hulewsky (51:58.907)\r\nGood for you.\r\n\r\n\r\nNikolas Hulewsky (52:37.915)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (52:42.139)\r\nGood for you recommending another system, that's awesome.\r\n\r\n\r\nNikolas Hulewsky (52:53.275)\r\nWell, Shana, this was awesome. Thank you so much. I'm gonna talk to you soon and have a great one.\r\n\r\n\r\nOkay, stay on.",
  "metadata": {
    "duration": "",
    "date": "2025-07-18",
    "platform_source": "Google Drive"
  }
}