{
  "episode_number": "33",
  "episode_title": "The Scoop! Growing From 18 to 111 Locations in 5 Years with Cliff Kennedy",
  "guest_name": "Cliff Kennedy",
  "business_name": "Frios Gourmet Pops",
  "transcript": "﻿For real, you're sitting in traffic and you're like, I hate my life. Oh, there's some ice cream.  I can, I mean, it's an old chill road here in mobile five o'clock traffic. It's miserable. And I had to go up the street every single day. And I was like, this is miserable. All these people over here are happy. I'm going to go over and get one.\r\n\r\n\r\nAnd I was like, I mean, it's like the skies opened up. I mean, colors got more, but I mean, it's just,  it was an experience. It wasn't about the pop at that point. I was like, man. I was just miserable and now I'm smiling. It's like there's something to this. \r\n\r\n\r\nDo you remember when you were a kid? And you got a popsicle or ice cream on a hot summer day.  And do you remember the joy you felt in that moment? It's like everything else in the world was on pause. Well, on today's episode, you'll learn how Cliff Kennedy has taken that joy, packaged it into little gourmet popsicles and turned it into one of the fastest growing ice cream truck franchises in the world. \r\n\r\n\r\nWelcome to another episode of economics, the show for entrepreneurs. Curious to learn how other businesses work. I am your host and chief curiosity officer, Nicholas Helusky. I've owned and operated more than a dozen businesses generating 30 million a year in revenue and employing more than 300 people.\r\n\r\n\r\nI recently sold most of my holdings and I'm trying to figure out what's next. So now I spend my days talking to as many business owners as I can to understand their business models and learn their founding stories.  Today, I'm obsessed with just one question.  How the freak did Cliff Kennedy bootstrap his modern day ice cream truck franchise or to eight figures and 111 locations in five years. \r\n\r\n\r\nYou'll have to watch to find out. Enjoy. All right, Cliff,  welcome to Nickonomics.  Stoked to have you. Why don't you give us just a brief introduction? What is your business? How do you make money?  Yeah. Thanks for having me, Nick. I appreciate this. Long time coming. So,  Free Us Gourmet Pops. We're the modern day ice cream shop.\r\n\r\n\r\nIt's as simple as that. We sell happiness through popsicles in a franchise business. Can't get more complicated than that. I freaking love that. We sell happiness through popsicles.  Okay. Give me just a general idea. Like how big is the business right now from a brand perspective? Like how many locations do you have?\r\n\r\n\r\nHow many are coming online? How long have you been around? Yeah. So we've got a strong pipeline. We have sold 20 years to date. We've got 111 territories sold across the country.  And that's about 70, 70 franchisees. How long have you been operating? I've owned this business now for five and a half years. So when I bought it five and a half years ago, there were 18, 18, 20 locations, depending on how you look at it.\r\n\r\n\r\nSo I've just been trying to grow it ever since.  All right. So Frios pop, you said modern day ice cream truck. Is  that what it is? Is it an ice cream truck or like, are these individual retail locations? What is. What does a franchise look like at the local level? It's an ice cream shop. It's a tie dye wrapped sprinter van that has a freezer in there with a serving window and they have speakers and play music and it's the ice cream shop.\r\n\r\n\r\nI mean, we are the modern day. We just, we just open up a little bit rather than the, maybe some kind of the sketchy ice cream trucks you see in some neighborhoods. Ours are flashy and bright and tie dye and fun. That's awesome. So no retail space, no physical location. They're just kind of running routes.\r\n\r\n\r\nYou're franchisees at the local level. Like, what does it look like? Actually, before I ask that, how the freak did you get into this business? Like, that's kind of a weird random thing to buy into is no kids. Like I want to own a franchise selling popsicles and ice cream. Yeah, the quick story is I got stuck in traffic and I was miserable and I saw a lot of happy people over at the Frio stand.\r\n\r\n\r\nSo I stopped, got the key lime pie, the greatest thing that's ever happened to me. Just kept trying it and trying it and then became a franchisee May 1st of 2018. Eight months later, bought the entire company and moved its corporate office to Mobile.  For real, you were sitting in traffic and you're like, I hate my life.\r\n\r\n\r\nOh, there's some ice cream.  I can, I mean, it's an old show road here in mobile five o'clock traffic. It's miserable. And I had to go up the street every single day and I was like. This is miserable. All these people over here are happy. I'm going to go over and get one. And I was like, I mean, it's like the skies opened up.\r\n\r\n\r\nI mean, colors got more, but I mean, it's just,  it was an experience. It wasn't about the pop at that point. I was like, man, I was just miserable. And now I'm smiling. It's like, there's something to this.  So tell me what is a, I don't know what Frios pop means. Is that just Spanish for cold pop? Oh, yeah. I guess that's where the original founder developed it from, but Frios gourmet pops.\r\n\r\n\r\nAnd so. We weren't changing the names because people like it. Now it's, some people call it Frio. Some people say Frios. My mom mistakenly says Fritos, but I say, I do not own Fritos mom. I wish I did. I don't know about Fritos pop. I don't know if anybody's going to be eating a Fritos popsicle. It's just Frios pops. \r\n\r\n\r\nDude. So what was your background before that? How did you go from cool? I'm owning this franchise. It's, you know, however, well, it's doing too. I'm going to buy this whole thing.  Yeah, I was in a family business that my grandfather started out of the trunk of his car with an eighth grade education, sweeping the floors in the oil and gas space my entire life.\r\n\r\n\r\nReally? Yeah, I was heading back to school and my dad, I was helping him out because we had a disaster on our business when Katrina hit and I was literally pulling out to go back to school. School masters and he's like, Hey, need you to withdraw. I need you to join the family business now. So I was an assistant to the Dean of the school.\r\n\r\n\r\nI called him up. He's like, you will get more education. You can always come back to school. And I said, well, dad, I got to get on my clothes, went up. And then from there, it's been the family business for 13 years until this started.  That's amazing, man. And is that family business still going on? Yeah. My older brothers are in it.\r\n\r\n\r\nMy mom and dad still run it to this day. I love them. Talk to my parents every day. You went from. Sweeping floors, the sales guy, oil, gas, oil, gas, we're selling to the oil rigs and refiners, you know, all over the country and everything. And so, yeah, I went from that to selling popsicles.  Oh my gosh. You were like,  I didn't know what I was getting.\r\n\r\n\r\nAnd then I had to tell my wife who was pregnant with our third child at the time, he was like, Hey, look, I got a really good life set up over here.  I'm going to go make and sell popsicles for a living. You know, life is not a dress rehearsal. Uh, you only get one shot at this thing, so do what makes you happy.\r\n\r\n\r\nAnd I just needed to do this to make me happy. We may be kindred spirits. What is that painting behind you?  Dream Big Dreams. How did you get that? What is it? Is it Banksy? Yeah. It's not a real Banksy obviously, but it's a I know. Yeah. I wish. But, uh, no, my wife, my wife got it for me. 'cause I used to have an Alabama fan, so I used to have an Alabama picture behind me.\r\n\r\n\r\nI was like, but this just means more and it's got a lot of color to it. And so that's kind of my life. You gotta live.  That is everyone's like dream, big dreams. If not, you're just not going to be happy. I love it. If you're just listening to this cliff has a picture behind them. Obviously it says dream, big dreams, but it's very colorful.\r\n\r\n\r\nThere's a child standing in it. It's messy. And if you know who the artist Banksy is, it's a Banksy. So this picture that I have behind me is a businessman. He's walking in the rain, but the rains are coming down in colors. And there's a child  there as well. The businessman has an umbrella. He's blocking the rain from him.\r\n\r\n\r\nAnd the child's just open arms, letting the rain hit them in the face. This is not a Banksy, but Banksy helped this like local Danish cooperative paint this and they now sell it. So it's anyways, I loved this painting. Cause I'm like, Dude, don't ever grow up. Don't take yourself so seriously. Look at that kid, that kid, just enjoying life, loving everything.\r\n\r\n\r\nLife has to throw at it. Who cares if he's getting a little bit wet and the business man's like more concerned about getting to his meeting and, you know, making those facts and figures in the idea machine work. Then he is about taking in the moment around him. So it's a, that's what that is about me.\r\n\r\n\r\nAlways looking up dreaming that like you. We get to see it every day in this business with our franchisees across the country and myself as well. My kids, you know, it's always like I'm the most popular house in the street because everyone expects me to have frios. And so the kids don't even show up to say hello, hey can we come in, are your kids here?\r\n\r\n\r\nNo, they just go to our freezer and is like can I have a frios. Do you drive the van around? I haven't in a while. I have to admit, you know, with  such a large company now that's, it's tough to, to get back in the van, but that's what it's all about. It's like that vision, Nick, I, I think this all the time.\r\n\r\n\r\nIt's like, it's that stressful parent, whoever it is, adult, they're in the suit, they're all stressed out from work, and all of a sudden they're with their kids. And you give them a Frios and they just kind of that, that visual of just loosening up that Todd just a little bit and just becoming a kid again.\r\n\r\n\r\nAnd I haven't told this story in a really long time, sorry to sidetrack, but it's like, it was full circle for me was when I first took over this company, we're trying to get the vision, identity, what it is. And God rest her soul now, she's since passed away. But my neighbor at the time, Ms. Ruth, she had just turned 90 years old.\r\n\r\n\r\nAnd so me and my kids went over there and gave her some Frios pops. And so the next day I'm finishing up my run and she stops me. She says, Cliff, I just want you to know those pops made me feel like a little girl again. And like, I was like, that's it. Like, I just literally called our entire dance. Like, that's it.\r\n\r\n\r\nThat's it. It's not what we sell is what that pop makes you feel. And it's that sense of happiness. It doesn't matter what you do for just a couple of minutes out of your day. You forget about all the stress,  everything that's going on in your world that you can enjoy with a kid. You can be an adult. And so that's what I'm lucky to be in this business is that we get to share happiness for a living.\r\n\r\n\r\nIt's, it's crazy, dude. I've, I freaking love that. I'll go on a quick side tangent about me. I had a home health and hospice company. And as weird as it sounds, hospice is death and dying, but I love hospice. I think it's a very intimate experience and we get a chance to help someone die with dignity. I had a son passed away on hospice.\r\n\r\n\r\nI've had grandparents, my sister passed away on hospice two years ago. So it's like, it's very personal to me. And Our company motto was joy through service.  Like we, we were providing joy to these patients by serving them. I, as a manager was providing joy to my employees by serving them. Right. It was like, that was what we were providing to people through our service to them and just hearing you talk about, Hey, we're bringing joy to people through Popsicles. \r\n\r\n\r\nIt may sound simple. It may sound stupid, but that's, it's awesome that it's so clear. To your team to be able to communicate to them. Hey guys, we bring joy to popsicles. Come on. That's what we do. It's like one of the things that is near and dear to the culture of us is giving back throughout our entire culture, family first, you know, happiness, everything else, but it's also giving back.\r\n\r\n\r\nAnd so when I became a franchisee, one of the first things I was implemented to our program was I got a freezer. I put it up at our local children and women's hospital. And I said, it doesn't matter what this costs me every year. Every kid that has surgery comes through here, whatever it is. If they want one, give them one.\r\n\r\n\r\nAnd then some of the pictures that I got back, like no kid deserves to be in that hospital. They did nothing to be sick or get injured. But some of the pictures of like the parents would send me. They'd be like, here we are. She just got out of surgery, brain cancer, whatever it may be, but she's smiling right now.\r\n\r\n\r\nAnd it's just because of a popsicle. That's how simple it is. And it's so pure.  I love that. That's beautiful. Cliff. All right. Let's, I hate to even segue. I hate to even segue. Cause I could talk about this stuff for hours. Yeah. But that's, this is the important side of the business. There's also other important things, but this is what the why is.\r\n\r\n\r\nI know people talk about it a lot more recently, but. It's something that everybody has to learn at some point that the business hat, there has to be a why behind what you're doing for the most part.  We're all competing in the same kind of space, especially in the space. You're selling pop at the end of the day, you're selling popsicles, right?\r\n\r\n\r\nWhat's your differentiator. Your differentiator is your team and your people and your brand and your ethos. And so if you don't have a good, why people aren't going to buy into that and people don't buy into that, you are not going to have a committed. Team to go above and beyond and provide a level of service that outcompetes people, other people in the market.\r\n\r\n\r\nSo like the, why, in my opinion, is always the first thing I do, whether it's in business, whether it's in like personal endeavors, it's like, okay, why are we doing this? What's the point of this? Because if we're going to expend our human capital, we'd better have a good reason for it. So tell me how, like at the local level, I'm a franchisee.\r\n\r\n\r\nHow do I get into the business? I'm assuming there's like a buy in and then there's some capital expenditures that I need to do. Like, how much does it cost me to kind of get started? Yeah. So on average, you're going to spend anywhere from like 70 to a hundred thousand dollars. You buy a territory, which is 37, 500. \r\n\r\n\r\nYou get that, what we call the sweet rod, the van. The sweet ride. I love that. So you can get carts and stuff. So it's. Then it's just that onboarding process because as much as people want to be a part of a franchise, the franchise or has to make sure you're going to fit our culture. And there are times where we say, look, you're not the right fit.\r\n\r\n\r\nYou're just, we can be successful on things. You're not going to be successful because you don't fit our culture. So they go through that onboarding process and then they meet all of us at one time. And so we're asking questions. So kind of like that final step. And then we either approve them or deny them.\r\n\r\n\r\nAnd if we approve them, They go through training, onboarding, and then they're off to the races and selling in their territory.  How do you decide how big a territory is? It's 150, 000 people. It's clearly defined. And then we just go, we have a mapping system that we go in. We've got them prebuilt. There is some wiggle room, but it's all just contiguous zip codes.\r\n\r\n\r\nWe draw it up with them. And they're happy. We're happy. And they're authorizing what's the ideal profile of a franchisee. Like what, what type of background do they have? Maybe demographics, you know, how old they are experience, obviously that extrovert where the sales business, you gotta be out, you gotta be involved in your community, have that sales person kind of nature in you.\r\n\r\n\r\nAnd you just want somebody that's getting involved in their community and has that flexibility of what this business, you know, really talks about deserves everyone. When they come into franchising, Nick, And I apologize. I don't know how much you know about or not, but it's pretend like I'm an idiot and you'll be just fine.\r\n\r\n\r\nHere's the thing. Everyone thinks because it's like, do you do it yourself or do it in franchising? Franchising gives you so much more opportunity because we've got the resources tried and true and training knowledge, everything you need. We say you go in business for yourself, but not by yourself in franchising because you have a team of people supporting you. \r\n\r\n\r\nThat gives all that false sense of hope that they should be successful. They want. And that's how people look. This might be the simplest business you've ever run. Like we joke, we're like, all you got to do to start your day is lift a serving window and you're set up and ready to go. That's it's an easy business, but it still requires hard work.\r\n\r\n\r\nPeople always have to have that understanding that that first year is going to be a grind. It might take two years to get your ROI, but once you lay those seeds in that groundwork, that's where the gold is. That's where your hard work pays off. So no matter what it is. What's your business is. It just allows you to have more resources and support in franchising. \r\n\r\n\r\nSo when you say sales, like, Hey, our best franchisees are salesmen at heart sales people at heart.  How does that work? Cause I'm thinking of the ice cream truck. That's just driving around.  I'm like, that's not really sales. You're just driving around, but  I'm also thinking to corporate events that I've been to that have like food trucks there or community events, those types of things.\r\n\r\n\r\nSo  like what percentage of your business is coming from the, you know, Uber of ice cream and what percentage is coming from corporate events, I guess 95 percent of this is from event based we're an event based business.  It very rarely are because you got to think about it. We want to be efficient as possible.\r\n\r\n\r\nThe ice cream person drives around aimlessly just in the music attracts them. That's it. They don't have a set schedule, set route, anything else. Now we've modernized that with some of our training and resources on how to make that better and be more efficient. And that's part of that training process.\r\n\r\n\r\nBut it's also when I first bought this business, it was brick and mortar. We had 20 locations across the country, give or take something like that. And it is really hard. For now, I bought three territories and so I had three brick and more locations. And so I was like, wow, it's a lot of work to get this,  which is impossible almost to get a thousand person employer to bring all their people for lunch, but they're always asking us to go to them.\r\n\r\n\r\nSo you got to mobilize. So my aha moment was during COVID. I was like, wow, we're paying high scores to sit and look at Tik TOK and Instagram. I was like. We wrote our entire FTD. We said, no, this is not us. We're an event based business. We've got to go to the people. So now we're able to franchisee takes a phone call and Hey, I got a thousand people for lunch here.\r\n\r\n\r\nCan you come service? We can knock that out in less than an hour. We can hand out popsicles as fast as you want to. Perfect. Boom. That's what they do. Or with our business, because we are prepackaged, a lot of our franchisees have wholesale accounts. So think of places like bars have pop tales, which are fun things for them or country clubs, resorts by the pool during the summertime.\r\n\r\n\r\nThere's a lot of different value out of what we bring to the table rather than just the modern day ice cream truck.  So I'm a franchisee. I think you said it was 37 5 for a territory, another 70 something to get started. So I'm 120. Well that's, that's, that's kinda like the erritory that's inclusive is but 70 to a hundred kinds.\r\n\r\n\r\nThat includes that 37 K. Okay, cool. So let's say I spend a hundred grand and do you have a territory minimum? Is it like two T, two or three territories or is it just one? I can buy one. Well, you can buy one or two. Most people use it right now. Buy two territories.  So let's say I buy one, I invest a hundred thousand dollars into it.\r\n\r\n\r\nI've got the truck I'm driving around. What in your experience with your franchisees, what does that translate to? Not first years are getting up and running, but let's just say they're at stasis. How much revenue does that generate? What's their bottom line look like? I guess what's the max capacity of that one van.\r\n\r\n\r\nSo what we do is, and there's a beautiful thing about, and this might, I hope that's not a long one to answer, but it's tough to answer that because the nature of our business is that. With us being what we consider low cost, very low cost, actually in the world of franchising, we're not building out big million dollar brick and mortars or anything like that.\r\n\r\n\r\nAnd so what people do is they're not happy with that daily grind, but they still need the resources of that paycheck coming in from their corporate gig, and so they start out as, this is like their side hustle, they're like, they're putting in that 20 to 30 hours. So it's not getting the real revenue they can get.\r\n\r\n\r\nThey're trying to build that baseline that forces them out of their full time job. Sure.  And so that first year, second year until they can really like prove this out. And they get so busy. They're like, all right, I love it. When we get that call or the text or some, our franchisee, we have one franchisee.\r\n\r\n\r\nHe's been a soccer coach at a high school for 15 years. He's like, I'm no longer a soccer coach. I'm all in with free us. So those are what you really want to do. So, you know, thinking we've had franchisees do well north of 200, 000 annually in one territory. And so it's all according to what you make it.\r\n\r\n\r\nAnd we've had some that do maybe 30, 000 a year. That's just it. If you have one territory and you, let's say you're doing 150, 000 a year in revenue, what like, what does the bottom line look like for a franchisee? So yeah, we sell our pops on average around to our franchisees around, let's say 1. 50. And then they retail them anywhere from four to 6.\r\n\r\n\r\nSo there's a really good margin into the product. And then from there, it might be down because a wholesale or what are they doing a lot of different avenues. And there's no. Right or wrong answer. Everyone always asked me the time, like, Hey, well, what is the, what's the split of wholesale versus event based like there I've got some that are all in on wholesale and that's the model they love, and I've got some that are all in on big corporate events and schools and everything else.\r\n\r\n\r\nSo it's really tough. Uh, we're a high cash business, so we do have a fixed royalty. And that was one of the first things I did. I took away the percent royalty that all franchises usually charge. And I said, what? We're not going to punish your success.  So another is the volatility in this business of, are you seasonal or not?\r\n\r\n\r\nWhat are you doing? So is it fixed royalty? You're going to know every month what we're pulling out of your account. And so we're not going to punish your success. So if you want to be wildly successful, that's more money in your pocket.  So if I did 150, 000 in top line,  what would an average percentage or like average bottom line be? \r\n\r\n\r\nYou can give me the range if you want to. What do you mean on the bottom line? Like, what are you taking home? Net income. Yeah. Yeah. So again, that's so tough for me to answer. And I wish I had a better answer. You know, if you don't want to answer it, that's fine too. I'm just, I was just curious, kind of like, it's just like, it's all, you know,  variable, it's very variable, you know, anywhere you'd hope anywhere. \r\n\r\n\r\nI don't know the answer. I don't want to give you an answer that I don't know the answer because there's lots of different, I'm going to say, I'm going to say a number. I'm going to say a number. And then you tell me whether you're surprised or not surprised by the number. I'm a franchisee. I do 150 top line and I bring home  like net income, 75, 000 surprise, not surprised.\r\n\r\n\r\nYeah. It wouldn't be that surprised.  Okay. So if I'm a franchisee, I'm growing, I get to that like a hundred thousand, 150, 000, 200, 000, whatever mark. And I'm like, Oh, there's more opportunity either in this territory or other territories.  What do I do? Like, do you have multiple vans in a territory? You can buy it.\r\n\r\n\r\nYou can have as many vans as you want. So the benefit of us, like one band is around a hundred thousand dollars, but you don't need another a hundred thousand dollar investment. You might get. Yeah. Multiple carts, push carts that we have there around 5, 000, you can be a multiple place. I mean, a given weekend, especially during the busy season, you might have to be in five events at one time.\r\n\r\n\r\nSo you don't need five vans, 500, 000. You might have one day here, cart there, whatever it may be. So you said a hundred and 150, 000 people was the territory. So 150, 000 people in, I don't know, Biloxi, Mississippi is different than 150, 000 people in Miami. Yeah. Right. Like I could get, I could get a couple of push carts and I don't even know if I need a van in Miami with 150, 000 people, cause I'm just down, you know, downtown selling popsicles.\r\n\r\n\r\nBut in  middle America that I needed the car in order to reach 150, 000 people. That's interesting. The band is more like the marketing you see it going down the road. It's there. It's vibrant. It's loud. People are like, Oh, I want to be a part of this. How do I, that's what it's all about is, you know, it's hard to do it apart.\r\n\r\n\r\nI'm new to the franchise game. I've only, you know, bought and sold businesses, but franchising is very interesting to me. And it's only in the last few months as I've had more conversations with people who run franchises.  You're one of them. Aaron Harper from rolling suds is one of them trying to think there's been a couple other people I've spoken to, but I am becoming more and more, you know,  Convinced that for first time entrepreneurs. \r\n\r\n\r\nIt's as good, if not better than any other alternative, because of, like you said, you've got the systems down, you've got the branding down, you've got,  you know, a proven track record in history. They're helping you pick a location. Potentially they're helping you suss out how to grow. There's other people that have done this thing.\r\n\r\n\r\nLike there's so many things that can, that are tailwinds for your success. That being said, I've also found out there's variation within the franchise world. Like people who have a Chick fil A franchise  don't actually own the franchise. The Chick fil A owns it. They're a highly compensated employee. They have a rev share and that's awesome for them, but they're not actually franchisees.\r\n\r\n\r\nHow does your franchise work? Like they own that territory and they're able to sell it if they wanted to, obviously they have to get your approval, but they own it. They, they own it out. It is their business. And that's what we say about franchise. That's why I love this business model is because yes, people call me all the time that have their own ice cream shop.\r\n\r\n\r\nThey're like, Oh, well, what about this? What about that? It's like, well, if you were a franchisee, we could set up all this marketing for it. We can give you all of the collateral you need. We can give you all the training that you need. But if you go in business, it doesn't matter if it's ice cream, if it's power washing, if it's mosquito, anything, you can do it by yourself.\r\n\r\n\r\nYou can go far by yourself, but you can go a long ways with a team of people, whatever that saying is. So why not have a team of people supporting you? And when you put that head on your pillow, you've got a team of people supporting you. You're not there by yourself.  It is your business. You got to make what you want out of it.\r\n\r\n\r\nBut if you've got issues, it's not, you got to figure it out and say, Hey, franchise or have you ever dealt with this? Yeah, we actually have training on this. We've dealt with this a million times.  Oh, dude. I bet you close really well.  I got out of the game. Allison does a great job. I miss it. I enjoy it. Oh, you don't meet, you don't meet any of the potential franchisees.\r\n\r\n\r\nI used to be. The, from the first call to the last call, but now this, I just can't, it's just so much time and I've got to do what's best for the company and the future growth and opportunities we have there. Here's a random question for you. You ever think about like national partnerships, live nation, let's say, or I'm trying to think like who owns multiple big events, businesses, concerts.\r\n\r\n\r\nYeah, we do that from time to time. Yep. We've partnered with the PGA before, and there's a great one that, I mean, You know, like when the TV crew always seems to ping on one child or something like that, it was like missed marketing because this girl was covered in one of our free us chocolate, but she was at the PGA tour event in Oklahoma or in Tulsa.\r\n\r\n\r\nAnd, but she didn't have the wrapper on there and her hand was like all covered, so you couldn't see it as a free us. I knew it was,  we did the deal with them and they kept going back to her. They like, here's a shot. Oh, this girl, like you're talking about how hot it was. And like this girl's just having the time of her life.\r\n\r\n\r\nI was like, Oh, dude, you should see, you should see if you could use that video from them  because you could just impose like Frios pop, like just something funny so that people know, Oh, she's eating a Frios pop. Anyways. I think that's, I think that'd be hilarious.  Okay. Customer acquisition costs. So if I'm a franchisee,  how am I acquiring?\r\n\r\n\r\nA customer, not like you said, not the 5 percent where they're driving around in the van, but the events, the corporate customers, how are they finding them and acquiring them? So one of the things we do with our mapping service is we're able to geolocate all these, if it's a church, if it's school, all the different places we want them call in, we can put that into a spreadsheet for them.\r\n\r\n\r\nAnd we start them off with years, a hundred plus leads for your territory, just start calling. And then they have all the training mechanisms on. How to talk to them. Who do you ask for? Like, what do you say? Here's an email template, all that. And then it's just, it's the groundwork of either called drop. I mean, pop drops are great.\r\n\r\n\r\nOnce you sell those by thing, I love it. And so I tell them how to get to the gatekeeper, get past the gatekeeper. And so often it's like, you know what? We're just gonna stop by. Bring you a couple of Frios pops. Let's try them. And then once you do that, it's the easiest thing. Exactly. I can't tell you how many summertime.\r\n\r\n\r\nYeah. Summertime go to a corporate place. You're like, Hey, I just want to bring some popsicles by drop it by like, those are going to get eaten. Do it. Do it. Even if they're bad popsicles, you can do it. I mean, I have to ask everybody all the time. You stop putting ice in your drink just because it's cold.\r\n\r\n\r\nNo, it was like, so I had one of our franchisees like, look, we just did a big event. It's snowing I forget. I think it was in Michigan. Maybe. It was like, yeah, and they're eating popsicles inside by a fire. Cause they, you don't stop eating ice cream. You don't stop eating cold things. It's just, you're not doing it last longer.\r\n\r\n\r\nJust go inside. Exactly. You just go inside. It lasts longer when it's cold. You go outside, you eat that popsicle. It's not melting. You're good. Yeah.  What about paid acquisition? Are you guys doing any SEO? I guess that's not paid, but SEO paid through Google, Facebook, LinkedIn, any of that stuff. Yeah. Yeah, we got an amazing marketing person with Jen.\r\n\r\n\r\nShe's overall that what she does is amazing and I don't fully understand how she pulls it all off, but I mean, every once in a while, she'll click that right ad and it just resonates. So you can just see like our lead Jen is like, Be being, being, being, being Newly.  It's like, she's always like tweaking it and saying this is the right picture, whatever it is.\r\n\r\n\r\nAnd there's also broker groups in the franchising space that we have tons of people that represent tons of brands, but, you know, for us, it resonates with a lot of people. And so then that, for, we pay them a commission too, as we sign on their candidates. If you were to assign a percentage of where your leads or your sales come from customers come from, I should say, into two buckets, one being the traditional pound the pavement, go and get customers in the community.\r\n\r\n\r\nAnd then this sort of digital space, the paid ads, the Google, the Facebook, et cetera,  what percentage 1 of those buckets?  On a franchisee level, I would say it's probably 80 percent getting out there as organic leads. It's always a vast majority. I was at this event. I had your popsicle. I worked for this company.\r\n\r\n\r\nAnd even with our franchisees, they're like, Oh my God. I had your popsicle when I was visiting a family member. I don't have anything like that here. I need to have this. So a lot of our lead gen comes organically. I've just finding out the brand, be pressed podcast like this.  And then I would say probably 20, but you know, the remainder 20 is paid organic.\r\n\r\n\r\nIt's out there. Like pain to find them. Do you do any direct to consumer? No,  not for us.  So Chris Kerner, my business partner. I always say we, but it was technically his company.  He has a company now called Texas snacks and they go, they buy Bucky's snacks and they ship those to people who are not near a Bucky's location.\r\n\r\n\r\nHe buys those at the retail. Yeah. But the reason he got into that space was because  3PL third party logistics. For shipping food is a nightmare.  And so the original company was called send eats and they would send food across the country. And then it's morphed now into Texas snacks, but originally that was their ideas were going to send food.\r\n\r\n\r\nAnd one of their popular customers was, I can't remember what it was. It was something cold, something frozen that they shipped.  Across the country, but he was like, it's a nightmare to have to ship cold stuff. Look, I'm a manufacturer. All the popsicles that my franchisees buy,  we ship a lot. It is not fun.\r\n\r\n\r\nIt is not a fun business.  Shipping.  Oh, that's a whole nother podcast on shipping frozen product. What's your goal with this business? It seems like you've grown a lot from 18 to what'd you say? 140, 111,  111. You've sold 20 already this year. I mean, that's more than a 20 percent clip.  Of year over year growth, just in your, the number of franchisees, are you planning on growing pretty aggressively?\r\n\r\n\r\nIs this all, yeah, let's start there. We're at that point now we're ready to grow real aggressively. We've got the systems and processes in place. And yeah, I just think we're that next big thing. Everyone knows Kona ice. They're out there. They got 1600 locations across the country. I just think we're the next Kona ice.\r\n\r\n\r\nWe're in the frozen space. We have the same clientele, same business model, same everything. I just think we could be as big as Kona ice.  Are you bootstrapping this or have you gone out, raise money? Are you thinking about I passed the hat with friends and family, but no property equity, anything like that, no, no,  nothing else.\r\n\r\n\r\nJust all passing the hat. And I'm really, really invested. That's good. That's good. You want to  control as much as possible for as long as possible. That's for darn sure. All right.  I got some rapid fire questions for you. You ready? Sure.  All right. What do you love about this business? Making it, seeing people be happy.\r\n\r\n\r\nThat's it. I mean, the fact that there's so much craziness going on this world and I know every day we're putting smiles on people's faces. It's just an amazing thing.  What do you hate about it?  Trying to make everyone feel like they're heard and happy. It's impossible when you got, you know, 70, 80 franchisees, everyone might have a singular issue, but it really hurts when you can't. \r\n\r\n\r\nDo something for one person because it's not for the greater good.  A lot of guys in the world, like I shouldn't say guys, business owners in general are jealous of real estate. Cause they're like, Oh man, it must be so easy. You own some real estate, you collect some cash. It appreciates a little bit faster than inflation.\r\n\r\n\r\nAnd then the real estate guys are looking at the business guys and they're like, man, it must be so nice on a business, grow it, get some cashflow. You can flex up and down with your spending.  We all suffer from like the grasses greener effect as you sit here. Right. In 2024, what businesses or industries are you jealous of? \r\n\r\n\r\nOh, goodness. So you're nailing it because I see my father in law's he's in real estate and I can see him sitting back. He's made his life. Now he's doing, I was like, what's your day at the office compared to mine? So probably not the best, but. I guess it's, I keep the blinders on. I'm where I need to be exactly where I am,  but it's just those bigger franchisees that have the bigger systems and processes that I want, but we're just not there yet to afford it and can do it.\r\n\r\n\r\nSo that's the people. Yeah. And I, I asked that question, not as like, what do you wish you were doing instead of this? It's more like. What are some of the aspects of those businesses that you're jealous of? Real estate obviously comes up a lot. Commercial real estate is the one I'm getting the most of recently.\r\n\r\n\r\nNo, mine is strictly just the bigger franchise order to have all these amazing systems and processes and 30 people on their team. We're just not there yet. What are you obsessed with right now?  Like if you had two hours in your day, you could sit down, kids are gone. You don't have to work on anything with work. \r\n\r\n\r\nYou, it could be outside activity. It could be inside activity. Like just what are you obsessed with at the moment?  You shouldn't ask this, but it's a sports cards. I'm really into sports cards. It's something that  I try to teach my son, like  my son is 10. My oldest son is 10. And it's like, how can I send him the value of the dollar that he found my old sports cards when I was a kid.\r\n\r\n\r\nAnd so now he's obsessed with them. So I gave him a little, he had some money from birthdays and everything. And I gave him a little money. I set up an account for him. And so now I'm teaching the value of a dollar. I was like, Hey, you want to buy more sports cards, but you got to go sell some. Like, if you look right over here, I got a stack of cards that I was trying to organize for him and help him a little bit.\r\n\r\n\r\nSo when I need to break away from the desk, I go through these sports cards and try to help them sell some and everything. But yeah, even when I went in with family members and got some pretty big,  just the major sports, basketball, football, baseball. Is there one that you love? I mean, we got our previous card is we got a Michael Jordan rookie card.\r\n\r\n\r\nThat's great at very high. So it's, it's up there.  That's incredible, man. And how long have you had it? We've been holding on to this car for about a year now. And actually my biggest one, it's actually, I just, I'm sending it off to golden auction right now. I don't know when this podcast goes out, but one of my passion projects was I went on an endeavor to collect every single one of tiger woods, 15 majors.\r\n\r\n\r\nFinal round.  Tickets from there, I got them upgraded and I just, I'm sending them off to Golden to go on their website and sell them off. So it's never been done before that I know of. So that's awesome. Collected the infinity stones.  So there you go. I could talk to that for hours. Like you said,  I freaking love, I love that.\r\n\r\n\r\nThe reason I like it is because it's something that satisfies my intellectual curiosity. I love sports, love sports, but I also love stats. And I love seeing like, okay, in this year, this person did this and the card is physical. It's tangible. I have some cards, old cards, but they're, you know, they're crappy cards.\r\n\r\n\r\nBut that's been a big, huge boon since COVID the memorabilia space just exploded. It's crazy. And so that's what it is. It's like, I still like the salesman's photo. Like, Ooh, if I get this card or whatever it is, like, Oh, do I sell it now? Do I like my son, he will, this is where he really got the twinge for it.\r\n\r\n\r\nIt was like, my parents took him. He got a hundred dollar box of cards or something. And he pulled a Palo Banquero. Out of 10 autograph and I ended up selling it for him for 5, 500 bucks. And so I was like, you got some extra money in your account now. And dude, and that's how they get you with the cards too.\r\n\r\n\r\nIt's like a gamble. It's like, what am I going to get out of this pack? Yeah, exactly. But you know what? It's like when we were young and everything, we were doing it. And so I was like, now these boxes are way more expensive. I was like, you just can't go buy whatever you want, bud. It's like, do you have money in your account?\r\n\r\n\r\nNo, you better go sell some cards. So that's what I love about it. It's fun. It's something I can do with my kids. And now my five year old son is into Pokemon cards. I have no idea what all that is, but I just love it. It's something that I can relate. I could be a kid again. I know the experience, but also do it as an adult.\r\n\r\n\r\nI freaking, I love that. I think that's my favorite thing. I've done 30 of these interviews now. That's been the best obsession that I've heard. Thank you. Most of the time people are like, I'm just obsessed with growing my business. It's like, okay, can we do that every day? I need something to break free of the craziness and like sports cards, just my mental break and enjoy it.\r\n\r\n\r\nI love it. All right. Last question. What advice would you give yourself 10 years ago?  It's always going to be tougher than you think it is. Whatever best laid plan you have out there, just know that people have done it before you and it is a grind. There's going to be sleepless nights, long days, everything else, but you just don't give up.\r\n\r\n\r\nLike I just don't give up. And so it's people's like are so close to greatness and they just quit.  Yeah. Just not my DNA. So I wish I had told myself it's going to be a lot harder than the groundwork I laid out, but  I am where I am.  All right. Cliff Kennedy, Frios Pop. Where's the best place for people to find you? \r\n\r\n\r\nLinkedIn.  And I'm getting back on. I took a little hiatus from X. I needed a break and I'm getting back on. I got on back on yesterday. So I'm on X too. Cliff, this has been rad, man. Thank you so much. I appreciate you having me, pal.  I see it. All right. That's it. Another one for the books. I'm fired up. I don't know what else to say.\r\n\r\n\r\nI hope you found something valuable in that conversation. I hope you learned something. I hope there's something that you can apply to your business today, tomorrow, in the future that. It makes you money. It makes you more successful. It gives you more time with your kids. If there was something I'd love to hear about it in the comments below, you know, give me some feedback.\r\n\r\n\r\nAnd if you like actionable advice and you want more of this, I write a weekly newsletter that gives insights, tips, and tricks into the world of entrepreneurship. Subscribe in my bio.  And if I can help you in any way in your entrepreneurial journey, don't hesitate to reach out to me. Nick at cofounders.\r\n\r\n\r\ncom. Sorry, Kelly, for more emails. And the last thing is. Remember,  curiosity is a superpower and you can use it to your advantage. As my mom used to say, there's no such thing as a dumb question.  Only dumb people.  We'll see you next time.",
  "metadata": {
    "duration": "",
    "date": "2024-07-19",
    "platform_source": "Google Drive"
  }
}