{
  "episode_number": "184",
  "episode_title": "How to Decide If Franchising is the Right Business Path for You with Connor Groce",
  "guest_name": "Connor Groce",
  "business_name": "Smash My Trash, Home Service Franchise",
  "transcript": "﻿Nikolas Hulewsky (00:01.102)\r\nAll right, you are the second Connor Gross that I've had on this podcast, but obviously spelled differently. I'm freaking stoked to have you because I've become really fascinated with the world that you are an expert in. I think there's three main ways to get into entrepreneurship. I think you can start a business. I think you can buy a business and I think you can get into franchising. And then we can quibble about, well, you can inherit a business or you could buy into a business or whatever. You could have like all these other things, but those are the three like main ways. And I've met you at a couple of different conferences and the thing that I'm just impressed with is your breadth of knowledge on franchising, which is what we're going to talk about today. Not just from a theoretical perspective, but from an actual practical perspective as well. So why don't you give us a quick high-level overview of who you are, what businesses you have and where you are today.\r\n\r\n\r\nConnor Groce (00:52.256)\r\nAbsolutely. So I got started in franchising. Initially, I was working, you know, just a job for a franchise ownership group in a boutique fitness franchise, and ended up having the opportunity to partner with those owners. wanted to a lot of people that get into franchising, you know, they, they like to be involved in multiple different businesses. And that was the case with these owners, they wanted to get into home services. Also know that home services, while it has a lot of upside, it can also be an operationally taxing business that they weren't able to fulfill that.\r\n\r\n\r\nNikolas Hulewsky (01:01.55)\r\nHmph.\r\n\r\n\r\nConnor Groce (01:21.624)\r\nresponsibility at that time. And so I was able to kind of join that deal and invest $4,900 of my own money alongside of them while they were bringing most of the capital of the table. was bringing most of the sweat. yeah, started that franchise in 2019, which was my first one. I ran it as an owner operator for about 18 months and then hired a manager. Still own it today. But then in 2022, I got into another franchise called Smash My Trash, which is a very niche mobile trash compaction business in\r\n\r\n\r\nthe waste management space. And so actually acquired an existing location in that brand, I've since grown through acquisition again, and those are up in Indiana. I lived up in Indiana for a period of time, moved back to North Carolina just over a year ago where I'm from and around the same time started as a franchise consultant because a lot of people started to ask me like I'm interested in getting into business ownership. I have heard a lot of things about franchising. I just don't know how to navigate the process. Will you help me? And so this is a way just that I can use\r\n\r\n\r\nthe muscles I built in franchising and all the different ways that I've stubbed my toe to help people navigate the process to, know, source the right opportunities, evaluate them and fund them. And that is the crux of what I do there.\r\n\r\n\r\nNikolas Hulewsky (02:31.276)\r\nSo those are the businesses you have right now. You have a couple of Smash My Trash locations and then tell me again, is it a fitness center?\r\n\r\n\r\nConnor Groce (02:37.681)\r\nIt's a home service franchise. Yeah, it does window cleaning, pressure washing, gutter cleaning, and holiday lighting.\r\n\r\n\r\nNikolas Hulewsky (02:43.424)\r\nokay. You're doing all kinds of stuff. Can you me an idea of the size, like how many employees, top line revenue of all those businesses?\r\n\r\n\r\nConnor Groce (02:52.534)\r\nYeah, so the first one's really small, like pretty small relatively speaking. Just under a half a million in revenue and a little over 100K of SDE. Yeah, lean team, one manager in between two to four employees throughout the year. And then with Smash My Trash, yep, that's correct, And then yeah, with Smash My Trash, have four territories. They operate out of two different locations, so have a manager in each location.\r\n\r\n\r\nNikolas Hulewsky (03:09.346)\r\nAnd what's that business? That's the home services business. Okay.\r\n\r\n\r\nConnor Groce (03:20.918)\r\nAnd then a total of four trucks and I believe a total of five or six drivers in total that run those routes. Yeah.\r\n\r\n\r\nNikolas Hulewsky (03:27.0)\r\nThat's awesome. I didn't look at Smash My Trash as becoming a franchisee, but I've done some research into them. That's a freaking cool franchise, man.\r\n\r\n\r\nConnor Groce (03:36.224)\r\nIt's a cool, it's an example of where franchising can really be valuable. Cause like you said, it's a business that I understood it from the start, but it's something that I would have never conceived of on my own. And I would have never gone about, engineering a truck in this way and manufacturing it. And it's just a great opportunity to walk into a business that was, it was new, but it was proven and be able to go execute and scale.\r\n\r\n\r\nNikolas Hulewsky (03:46.445)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (03:57.804)\r\nWhen you talk about like AI resistant businesses, we're not trash isn't going away. AI is not going to come and automate our trash. You know what mean? We're still looking at those stones off away. He's been taken to the dump. People need to come and actually pick up. Anyway, so I just think it's a cool business. No, let me ask you this, because I I think franchising is. For me, it's my second safest way to get into entrepreneurship. I think the safest way to get into entrepreneurship is if you have a skill set.\r\n\r\n\r\nConnor Groce (04:13.931)\r\nI completely agree.\r\n\r\n\r\nNikolas Hulewsky (04:28.044)\r\nAnd then you launch an agency from scratch. And the reason I think that's the safest way is because you're not putting any capital in necessarily. You're going into customers. If you fail, the downside is pretty limited, but it's not like going and signing an SBA loan on a business you've never run before with no support. And franchising to me feels like the middle ground between going and buying a business with no support and starting a business from scratch with no capital. Am I viewing that right? how do you view franchising kind of along the continuum of entrepreneurship?\r\n\r\n\r\nConnor Groce (04:58.072)\r\nwould agree. think that there are certain advantages you get from a franchise that I don't even know that I want to use the word easier, but it definitely makes the process simpler because a lot of the things, the fundamental things that make small business ownership really hard, hiring and firing and managing cashflow and all that, that's still there with the franchise. It's just simpler because you're operating within a framework that's predefined and with a network around you of other people.\r\n\r\n\r\nowning and operating the same business that just puts you in a better position overall to navigate that process the right way. But I would agree. I think that the trade off between starting a business, like you said, spinning up an agency, something where you have deep knowledge and you're willing to put your head down and innovate and tweak the minutia to get it exactly right. I think the trade off between doing something like that and getting into a franchise is just on day one, do you want to be executing or do you want to be innovating? And if it's something that you have a lot of...\r\n\r\n\r\nNikolas Hulewsky (05:53.058)\r\nYeah.\r\n\r\n\r\nConnor Groce (05:55.446)\r\nIf you have industry experience, a lot of times I would say like there's no reason to buy a franchise. If you have industry experience in something, go start your own business. There's nothing wrong with that at all if you're qualified and eager to innovate. But if you are pretty agnostic towards the type of business that you're doing, you just want to go execute. You want to go build teams and drive revenue and bolt your horse onto a wagon that already works. It might be the inverse. However, that analogy works, whatever.\r\n\r\n\r\nThat's what a franchise can, where it can make sense.\r\n\r\n\r\nNikolas Hulewsky (06:24.206)\r\nIt worked.\r\n\r\n\r\nI don't know why. I bought a lot of businesses. I've started a few from scratch. But until the last year, for whatever reason, I'd kind of looked at franchising as lesser than. I don't know how else to say it or look down on it. And I feel like that's a fairly common misconception that people have. Why do you think that is? Or was I just an idiot? Am I one of the few people who didn't quite understand it?\r\n\r\n\r\nConnor Groce (06:52.8)\r\nNo, there is a bit of a stigma around it as if it's like, you know, it's not real business ownership, if you will. Like there's a common term that people say sometimes to describe franchising that is franchises are businesses with training wheels. And I absolutely hate that analogy. doesn't, first of all, it's not even correct. doesn't make, you don't like training wheels or something you put on temporarily and then take off, which that's not what a franchise is. But it also implies that like,\r\n\r\n\r\nNikolas Hulewsky (06:58.08)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (07:15.981)\r\nRight.\r\n\r\n\r\nConnor Groce (07:19.862)\r\nthe only reason to buy a franchise is because you're incapable of running an independent business. Because you wouldn't, if you were capable of riding a bike, you wouldn't have training wheels on there for no reason. And so, you know, the thing is, is that there are scenarios where there are people that are just, they are in a better position to do it and be successful in a franchise, then they would be starting their own independent business. But then you look around at private equity firms that are investing in franchises. Are they doing that because they're incapable of\r\n\r\n\r\nNikolas Hulewsky (07:37.112)\r\nYou\r\n\r\n\r\nConnor Groce (07:49.748)\r\nbeing on the cap table of an independent business? Obviously not. Obviously, they see strategic value in that enough to do it. so, yes, there are people to this day that turn their nose up at franchising and they view it as less than. And there were a lot of people that 15 years ago turned their nose up at HVAC and said, that's too sweaty for me, too dirty, too boring, whatever. And the people that resisted...\r\n\r\n\r\nthe stigma are some of are laughing from their yachts right now because they went where others thought they were too good for.\r\n\r\n\r\nNikolas Hulewsky (08:22.712)\r\nWell, here, okay. Here's some of the things that kind of changed my mind on it. And then I want to get, I want to ask you the dumb questions of like, how does it actually work? I was doing some research of good friend of mine. Cole Simpson has a franchise. He's a, he's a mighty dog roofer, franchise franchisee. And, as I've gotten to know him, he's like, dude, there are guys who are making a hundred million dollars a year and more owning franchise territories. he sent me a podcast with the 1-800 got junk guys. He's like,\r\n\r\n\r\nThose guys were just territory 100-grit dunk and now they've got hundreds of millions of dollars, which that was kind of mind-blowing. And then I started looking at some of the statistics. There's a 90 % survival rate over five years of franchise businesses versus just independent businesses at like 50 % small businesses, which was kind of a nutty statistic. They're also two times more likely to be operating after 10 years compared to other businesses.\r\n\r\n\r\nNow the flip side is also like there's the downside of the upside of franchises, which they've got a model. There's not as much autonomy within the model to change specific things, right? So for somebody like me, unfortunately, I probably would struggle within a franchise. But for people who are listening, can you break down what is a franchise?\r\n\r\n\r\nConnor Groce (09:39.052)\r\nYeah, well, at its core, if we're looking at the different players, a franchisee is that is who you would be if you bought the franchise, right? That is the person who owns and operates the local market for the franchisor. The franchisor is the parent company. They're the ones who have presumably started and innovated the business. They own the intellectual property. They have a team that essentially exists to support franchisees and driving revenue and creating value in that regard.\r\n\r\n\r\nNikolas Hulewsky (10:04.494)\r\nThank\r\n\r\n\r\nConnor Groce (10:07.072)\r\nAnd the franchise brand is kind of the holistic term for the company itself. So ultimately, that's what the relationship is between franchisees is you the local owner franchise or is the parent company and the contractual relationship between us through a franchise agreement. Economically speaking, there's typically a franchise fee, which is a one time fee you pay to the franchise or to acquire the rights to develop that location within a predefined geographic territory.\r\n\r\n\r\nNikolas Hulewsky (10:15.139)\r\nMm-hmm.\r\n\r\n\r\nConnor Groce (10:35.392)\r\nAnd then there's a royalty, which is an ongoing, ongoing expense that you owe them. That's typically a percentage of gross sales that covers the services they render to you. And then a lot of times there's going to be a marketing fee, which this would be one to 4 % of revenue that you and every other franchisees pay into a pot. And that goes for national marketing, brand awareness initiatives, et cetera. But that's a, that's a bolts.\r\n\r\n\r\nNikolas Hulewsky (10:58.092)\r\nOkay, so a franchisor, let's say they get to a place where they're like, we have the secret sauce. We know how to, we're the best window cleaners in the country, whatever. And they decide they want to start franchising. So they first go through a process where they're developing something called the FDD, correct? What, what is that?\r\n\r\n\r\nConnor Groce (11:19.096)\r\nThat's right. Yep, the franchise disclosure document. That is 200 pages of pure legal gobbledygook that, you know, it's very, very hard to read, even if you're a franchise junkie like me. But they're all structured the same way. And so the good news is that there are items, is what they're called, 23 different items that are intended to break down in layman's terms what all of these mean and what all of these mean to you.\r\n\r\n\r\nNikolas Hulewsky (11:31.394)\r\nHahaha\r\n\r\n\r\nConnor Groce (11:43.626)\r\nAnd so what's nice is that again, they're standards. So any franchise in the U S has to file this document with the FTC in order to sell franchises. And when you pull the FDD of one organization and the FDD of another, it's going to have the same items that cover, you know, more or less the same things. And the idea is you're able to compare them with each other.\r\n\r\n\r\nNikolas Hulewsky (12:02.946)\r\nWell, it's crazy because I've gone and looked at FDDs now as I'm researching things. These FDDs, these franchise disclosure documents, will talk about average revenue per location. They'll talk about bottom line performance. They'll even get as granular as like, these are our processes. This is how we provide services. This is how we even intake a referral. It blows my mind because I feel like I'm reading that and I'm like, as a business owner, I felt like\r\n\r\n\r\nWhy are you giving away the secret sauce to your business? But why are they required by a of like give all of that information out? I don't, that's part I don't understand.\r\n\r\n\r\nConnor Groce (12:40.216)\r\nYeah, there's an abbreviated version of like all of that that's in the FDD. Obviously, anything that's proprietary is not going to be publicly disclosed. But yeah, that's the goal is that they're furnishing enough information off of which people can base their decision, but not completely giving away the secret sauce. Where you talked about like average ticket and stuff, all of that is in the item 19, which is where franchisors have the ability to disclose financial performance of franchisees that are in their system.\r\n\r\n\r\nNikolas Hulewsky (12:45.998)\r\nSure.\r\n\r\n\r\nThanks\r\n\r\n\r\nNikolas Hulewsky (12:56.494)\r\nMm-hmm.\r\n\r\n\r\nConnor Groce (13:08.064)\r\nAnd I just wanted to call that out because that's usually the juiciest item where people look towards how much money can I make? And I always say that is the starting line. It is not the finish line in answering that question, because there are all different ways that those numbers can be skewed in a rosier light than what the reality is on the ground. And so it's important to take that as a snapshot. But ultimately, you need to talk with franchisees to validate that.\r\n\r\n\r\nNikolas Hulewsky (13:10.72)\r\nYeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (13:30.828)\r\nWell, what's what's interesting about the FDD is like it's really similar to companies that are going public. Like in order for you to go public, it costs more than a million dollars to go public because you've got to go through a whole underwriting process. You've got to have people come and certify your financials. You've also got to go on a road show to raise money to make sure that at IPO you have people that are actually buying your stock. And then there's a whole set of regulatory requirements, finance in particular financial requirements.\r\n\r\n\r\nOn the disclosure side of things that you've got to come into compliance of and so in order to get into compliance, you've got to spend a lot of money to become compliant and then you can go public. And the FDD is kind of similar to that. Like it's not cheap. It's not like a $10,000 document that some of these franchisees or franchise words I've spoken to are like oh 200, 300, $400,000 to create just the FDD so that they can start getting franchisees. Is that a normal number?\r\n\r\n\r\nConnor Groce (14:26.168)\r\nOh yeah, yeah, it's very, very expensive from a legal infrastructure standpoint to be a franchise or because not only is it the FDD, but there are 13 states called registration states where franchises also have to file an FDD at the state level, know, typically go through multiple rounds of, you know, states kicking it back and forth offering feedback and all of those have to be approved. And then every single franchisee that's a separate document. So there's a lot of paper flying around.\r\n\r\n\r\nNikolas Hulewsky (14:42.51)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (14:54.52)\r\nYeah. Is the idea behind the FDD and franchises just in general that, we've created a certain set of best practices, or not even best practices. This is how the business should operate. If you're a Five Guys, this is the square footage. And I don't know if Five Guys is franchised. I'm just saying their name.\r\n\r\n\r\nConnor Groce (14:54.956)\r\nyou know, in that operation for sure.\r\n\r\n\r\nNikolas Hulewsky (15:16.29)\r\nThis is the square footage. This is where you order the ingredients from. These are the staffing ratios. This is the color of paint you use for the bathrooms. Like everything's pretty, it's prescriptive, right? Do they decide all of that in the FDD process? Or is that like an ongoing thing that changes over time?\r\n\r\n\r\nConnor Groce (15:36.78)\r\nYeah, well, people aren't, they're not making those decisions likely, you know, for the purposes of going into the FDD. They're probably making those operational determinations independently of that. And the FDD is just the document through which, you know, some of that is disclosed.\r\n\r\n\r\nNikolas Hulewsky (15:52.086)\r\nOkay. but the, the pluses of it is because they've gone through this process, because it's so standardized, somebody who's now jumping into a franchise has more confidence of like, cool. I'm, jumping into a known business. Like there's a playbook for how it should be running and operating. There's a playbook for marketing. There's a playbook for staffing. There's a playbook for, like I said, this is the square footage. This is how the color should be.\r\n\r\n\r\nThey've got to obviously bring the capital to the table to buy into the franchise and then potentially build out a location. But it feels to me that's the biggest draw for many people to franchises.\r\n\r\n\r\nConnor Groce (16:31.372)\r\nYes, it's just that somebody else has, they've been the trailblazer. They have been ahead of you. They have innovated this business model. They have systems and processes that are gonna be valuable. They offer support. There's a training process that sets you up for success as the operator. They have relationships. Yeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (16:32.728)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (16:49.968)\r\nokay, so they do have a training process. So it's not just like, here's all the materials, good luck. Like they're working with you to get you trained up.\r\n\r\n\r\nConnor Groce (16:57.43)\r\nYeah, I mean, usually that involves, you know, time on the ground at their headquarters. And then a lot of times they fly somebody out, you know, with you, you know, to meet with you and launch the business. They have relationships with vendors. That's another big thing is, you know, not having to evaluate, you know, spend a bunch of money, waste a bunch of money working with a bunch of different vendors till you find the right one and a good franchise system. They should have vendors that are already familiar with that business. And again, in a strong franchise system of which, you know, many are not.\r\n\r\n\r\nNikolas Hulewsky (17:04.237)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (17:18.67)\r\nMm.\r\n\r\n\r\nConnor Groce (17:26.37)\r\nBut in a good one, you should be set up to on day one, scale and execute and scale and not have to innovate and become an expert in whatever business that is, just to build a foundation, get above water so that then you can take it in scale. That's the value prop here.\r\n\r\n\r\nNikolas Hulewsky (17:44.142)\r\nWhat do is it one size fits all? Our franchise or is doing kind of the same thing on the back end or is it different? It feels like all of them are doing some type of a marketing function just because there's a national component to it. But operationally, are they doing the same things to support franchisees?\r\n\r\n\r\nConnor Groce (18:03.318)\r\nNo, there's a very, very wide array of how that looks like, both with regard to how much support is offered overall and what kind of support is offered. And this is part of what I help people take a look at and break through is just to justify on an ongoing basis, where is the value, the incremental value that this franchisor is offering?\r\n\r\n\r\nNikolas Hulewsky (18:08.115)\r\nYou\r\n\r\n\r\nNikolas Hulewsky (18:13.549)\r\nMm.\r\n\r\n\r\nConnor Groce (18:26.744)\r\nthat pays for themselves and produces, I I view paying a royalty as any kind of an investment. It's like, that's a dollar that I'm investing into a business and we have to determine whether or not it's going to produce an ROI that justifies that investment. And again, for 90 plus percent of franchises out there, there is not going to be a solid ROI on that. It's simply just, you're better off not going with that franchise in most situations. Precisely, yeah, it's a, yeah.\r\n\r\n\r\nNikolas Hulewsky (18:51.352)\r\nIt's a money grab from the franchisor sometimes.\r\n\r\n\r\nConnor Groce (18:55.926)\r\nindentured servitude is what I call it.\r\n\r\n\r\nNikolas Hulewsky (18:58.636)\r\nWhy indentured servitude? Just because it's so hard to get out of the contract?\r\n\r\n\r\nConnor Groce (19:02.43)\r\nYeah, I if you're if you are in a situation where, yeah, the business isn't going well, and you're not able to sell it to somebody else, and they're not adding any ongoing value, you have responsibility for which, you know, that you have obligations, you know, and the responsibilities of operating that business for which you're not getting paid. That's, yeah, that's a very challenging position to be in. And again, that's what anybody that's going to get into franchising has to embrace the fact that 90 plus percent of the 4000 franchises in America are\r\n\r\n\r\nNikolas Hulewsky (19:21.219)\r\nHmm.\r\n\r\n\r\nConnor Groce (19:32.148)\r\nabsolute total hot garbage. But I would also say, mean, Nicholas, what percentage of the small businesses in America today fall into that category too, that you would never want to own? So it's not to say that you let that discourage you and say, well, I would never own a small business if 90 plus percent aren't good. You just have to utilize that mindset to be very prudent in choosing the right one. And that's how I think about the franchise marketplace as well.\r\n\r\n\r\nNikolas Hulewsky (19:34.6)\r\nHahaha!\r\n\r\n\r\nNikolas Hulewsky (19:44.248)\r\nThat's true. Yeah, that's true.\r\n\r\n\r\nNikolas Hulewsky (19:57.326)\r\nYeah, so just because they're a franchise doesn't mean that you don't still do your due diligence. This doesn't mean that you don't provide a level of scrutiny to, know, what kind of support do they provide? How long have they been around? Like all of those things. So let me ask you this because again, I think for W2 employees, for people who like the structure, they like having a, oh, this is the track I should take. This is how things function. I think franchising is.\r\n\r\n\r\nConnor Groce (20:11.285)\r\nExactly.\r\n\r\n\r\nNikolas Hulewsky (20:27.296)\r\nan amazing opportunity. How do you think about, say somebody comes to you and is like, Connor, I'm thinking about getting to franchising, which one should I pick? How do you think about going through that process of finding the right fit for yourself?\r\n\r\n\r\nConnor Groce (20:40.536)\r\nYeah, well, that's the question that a lot of people start with, right? Which franchise should I choose? And I always say like that, that is question number three, you know, and the two questions that proceed that no, no, the two questions that proceed that, you know, it's number one, should I own a business? Right. And you and I could sit and banter on that for forever. I'm sure about like the pros and cons of business ownership versus working a job. But as basic as it is, that is the first question in my opinion. Should I own a business? If so, should I own a franchise?\r\n\r\n\r\nNikolas Hulewsky (20:46.189)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (20:49.974)\r\nNot even number two.\r\n\r\n\r\nNikolas Hulewsky (20:58.402)\r\nMm-hmm.\r\n\r\n\r\nConnor Groce (21:09.984)\r\nright? Thinking about the different paths to business ownership between starting one, buying one, buying a franchise, you know, we could talk through the pros and cons of all of those, but that's question number two. And if the answer is yes, I should own a franchise, that is when you you'd be forwarded to which one.\r\n\r\n\r\nNikolas Hulewsky (21:10.456)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (21:24.344)\r\nSo click on, let's click on number two. Let's say like, yes, I know I wanna own a business. Cool, great. How do you walk them through deciding whether or not they should buy franchise, start a business? What are some of the questions maybe they ask themselves in that process?\r\n\r\n\r\nConnor Groce (21:39.264)\r\nYeah, well, I think that first you have to look at your life circumstances, right? And if you are in a position where you have no personal overhead, you have a very high risk tolerance, that is the person where if they have an idea or they have some lane of expertise and want to go out and start a business and they can afford to make no money for a period of time while they innovate and figure it out, those are life circumstances where a startup can make some sense.\r\n\r\n\r\nNikolas Hulewsky (21:45.678)\r\nThank\r\n\r\n\r\nNikolas Hulewsky (21:53.304)\r\nMm-hmm.\r\n\r\n\r\nConnor Groce (22:04.632)\r\nI think if you're somebody that's coming in with a lot of capital and a lot of experience, maybe that's a situation where buying a business can make sense. So those are the variables here as you're looking at the individual circumstances, their capital and just their long-term goals. So somebody that wants to get into a franchise, maybe it's somebody that doesn't have the level of capital that might be necessary to buy a business, but they wanna use a franchise to do what I call planting your flag, which is to, you\r\n\r\n\r\nNikolas Hulewsky (22:13.358)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (22:21.069)\r\nOkay.\r\n\r\n\r\nConnor Groce (22:31.938)\r\nplant your flag, get started with a franchise and then utilize acquisitions as a growth strategy once you're on the inside of that business. Or, you know, if they're comparing franchising versus starting a business themselves, they're just looking at something that says, I want to be able to talk with somebody else who has owned and operated this same business, achieved a certain income level within a certain period of time. And I just have more, more comfort going into that situation since I have bills to pay. Maybe I'm providing for a family.\r\n\r\n\r\nI'm more comfortable starting a business like that when I have other people I can talk to and when it's a part of a franchise that's proven.\r\n\r\n\r\nNikolas Hulewsky (23:00.366)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (23:09.134)\r\nI know it's probably variable, typically speaking, how long does it take normal franchisees to start paying themselves not necessarily what they were making before, but a living wage?\r\n\r\n\r\nConnor Groce (23:20.056)\r\nYeah, yeah, that's definitely going to be all over all across the board. In fact, I actually recommend people like pay themselves from the start. Like I think if you're going to own a business, you should pay yourself. It's something that my uncle is one of my mentors taught me. He's like, you write a check to yourself for one hundred dollars, if that if that if that's all you can afford, it changes your psychology about the business when all of a sudden you're contributing all of this and you're getting something in return. So, you know, if you're in a position where you need to make somewhat of an income.\r\n\r\n\r\nNikolas Hulewsky (23:37.09)\r\nHmm.\r\n\r\n\r\nConnor Groce (23:48.822)\r\nthen I would pencil that into your forecast and say, I'm going to pay myself maybe $60,000 a year, maybe whatever you would pay a manager, but you're gonna pay yourself something from the start and just work that in to your forecast. in terms of when it's actually kicking off cash, the numerator and the denominator there obviously is how quickly you scale, how quickly you're investing into revenue and growing that. And then also,\r\n\r\n\r\nhow involved are you as the owner? Because people that are not gonna be as involved as owners, a lot of times they're having to heavily invest into personnel and into marketing on the front end. So those are the variables there, but it really is all over the place.\r\n\r\n\r\nNikolas Hulewsky (24:27.726)\r\nOkay, so questions one and two are answered. Yes, I wanna own a business. Yes, it's franchising. What's question three? Which one do I pick? Is there ever a question in there though that's like, do I buy a franchise or start one from scratch? Or is that like in question four or five?\r\n\r\n\r\nConnor Groce (24:34.764)\r\nYeah, which franchise? Yeah, yeah. So.\r\n\r\n\r\nConnor Groce (24:44.384)\r\nYeah, it's a great question because I work with, I'd say like 60 to 70 % of the people that I work with as a consultant are either like searchers or like search adjacent. So definitely a very acquisition, entrepreneurship oriented crowd that I work with because I've also like run a search and bought a business myself. So, you know, what you have to avoid and the trap that I see some searchers falling into right now is frankly ending up in really crappy franchises because by default,\r\n\r\n\r\nthat's where they happen to find one for sale. Meaning one of the advantages of acquisition entrepreneurship within franchise systems is that once you're on the inside, everything is simpler. When you're sourcing deals on the inside, that's a lot simpler because you're a part of that existing network. It's a lot easier to underwrite, conduct diligence on acquisitions when you're in that system. It's a lot easier to integrate acquisitions post-close.\r\n\r\n\r\nNikolas Hulewsky (25:16.44)\r\nfor sale.\r\n\r\n\r\nConnor Groce (25:40.812)\r\nwhen you're already in that system due to a number of reasons. And so the problem with trying to buy an existing franchise when you're not already a franchisee is that you're picking over the leftovers of the people who have within the system who have already taken a look at it and passed on it, who know the business better than you do and are in a better position to create value than you are. So yeah.\r\n\r\n\r\nNikolas Hulewsky (25:59.086)\r\nHmm.\r\n\r\n\r\nThat's an interesting point because if it was really valuable, somebody within the system would have probably picked it up before it went to market.\r\n\r\n\r\nConnor Groce (26:10.91)\r\nLikely, you know, that's not and that's that's not it's not something to say that any franchise resale that you find is a deal breaker That's just a dynamic you want to be aware of and gain clarity on why has this not been picked up by somebody in the system so Taking the other side of this a lot of the people that are acquisition oriented that I work with Do again what I call the plant your flag strategy, which is that when they're they're buying into a franchise system They're buying new territories but to plant their flag and then utilize acquisitions as a growth strategy once they're on the inside and the\r\n\r\n\r\nNikolas Hulewsky (26:19.831)\r\nInteresting.\r\n\r\n\r\nInteresting. Okay.\r\n\r\n\r\nConnor Groce (26:40.694)\r\nthe wind as at their back instead of at their front.\r\n\r\n\r\nNikolas Hulewsky (26:44.302)\r\nDude, that's okay. So, all right, sorry. Back to question three, which one do I pick? How do you, like, how do you even decide? I don't even know where to go and look. I'm sure that there are like websites and stuff. I have a friend of mine who's like, I always go to Wisconsin because Wisconsin has, for whatever reason, because it was constant. Wisconsin has all the FDDs and I can go and peruse those there. How do you even start to decide what business you should get into?\r\n\r\n\r\nConnor Groce (26:53.399)\r\nYeah.\r\n\r\n\r\nConnor Groce (27:06.072)\r\nYeah, well, first of all, it's really hard overall because there is so much marketing in the franchise ecosystem. Like in any top 100 list or top 500 list, it's all marketing. It's all pay to play. So you do have to be very careful. And it's somewhat of a self-serving answer here, but that's why working with a consultant or a broker who knows what they're talking about and who is aligned with your perspective is very valuable.\r\n\r\n\r\nNikolas Hulewsky (27:13.859)\r\nYeah.\r\n\r\n\r\nConnor Groce (27:31.64)\r\nbecause they're immersed in this world. And I always say, my goal is to take the perspective of somebody and build the bridge between where they are and what the franchise marketplace looks like. So that is really the thing to do is to go work with somebody who knows what they're talking about. In terms of how I break down and start to distill the 4,000 franchises in America today, first thing we can cross off, can differentiate between as food versus non-food. I'm not a food franchise guy.\r\n\r\n\r\nI think that the advantage of the food business, the main advantage is the scalability of it. Running a McDonald's and Boise and running one here in Durham is going to be basically the same. And that's why food franchises have been able to scale pretty much unlike any other brick and mortar business has been able to. There are also lot of downsides with the food business. It's low margin, high turnover, flaky workforce, low ticket, no recurring revenue, high upfront investment, all of that.\r\n\r\n\r\nSo in my opinion, until you really have tens of millions of dollars of capital to reach a level of scale, like the pros don't outweigh the cons in the food business. So then we look towards the non-food side of things. Yeah.\r\n\r\n\r\nNikolas Hulewsky (28:41.932)\r\nOkay, hold on. So let me just go back to food real quick. Like my brother loves food and he's like obsessed with the idea of having a kitchen at some point or a restaurant at some point. And so he's always looking at these really fast growing food centered franchises. A really perfect example of one would be Crumble. They grew like freaking nuts, right? Are you kind of describing like, okay, yeah, generally speaking,\r\n\r\n\r\nThis is how I think about things because it seems like there can be some opportunities where, I identified a really fast moving trend. John the juice before they had a hundred locations and you could probably make a ton of money doing a strategy like that within franchising. Right.\r\n\r\n\r\nConnor Groce (29:22.636)\r\nYeah, well, two things there. First of all, like I have friends in the food business make a whole lot more money than I do. So I'm not, I'm not saying that there's not not opportunity there. There absolutely is. But yeah, this is just, that's just in very broad strokes, how I view. That's right. The other thing is like, when I think of food, like honestly, crumble doesn't even fall into that category. Crumble is more like food, food adjacent. Cause you know, there's a, yeah, well, when I think of food, I think of like QSR, like quick service restaurants. So you're thinking about mainly fast food, fast casual.\r\n\r\n\r\nNikolas Hulewsky (29:27.895)\r\nYeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (29:33.41)\r\nYou're just saying for like the first swing. Okay, okay.\r\n\r\n\r\nNikolas Hulewsky (29:42.024)\r\nreally?\r\n\r\n\r\nNikolas Hulewsky (29:50.124)\r\nOkay.\r\n\r\n\r\nConnor Groce (29:52.632)\r\nThat kind of thing. The margin profile for a crumble looks completely different than your standard QSR business because their food costs, my understanding is a lot lower as is their payroll. It's just not, the economics don't look the same. Then it becomes a conversation like, you comfortable with the fact that this is a trend? I know that's a buzzword, but it is trendy and as trends up, they can come back down. And are you comfortable with having a business that is so anchored?\r\n\r\n\r\nNikolas Hulewsky (30:16.045)\r\nfor sure.\r\n\r\n\r\nConnor Groce (30:20.898)\r\nto consumer preferences, yeah, are you comfortable with that profile?\r\n\r\n\r\nNikolas Hulewsky (30:24.534)\r\nOkay, all right, that's interesting. Food adjacent, because it's trendy. Okay.\r\n\r\n\r\nConnor Groce (30:28.214)\r\nYeah. Yeah. They're, they're selling an experience and the underlying like tangible thing they give you happens to be a, an 8,000 calorie cookie. Yes. So, but yeah, non-food. Here's what I do with people is we break down a, I'd rather like a four square matrix on a, a piece of paper at the top, we write B to B and B to C on the side, we write non-brick and mortar and brick and mortar. And so within that we have four different quadrants.\r\n\r\n\r\nNikolas Hulewsky (30:34.647)\r\na cookie.\r\n\r\n\r\nAll right, so food and then non-food.\r\n\r\n\r\nNikolas Hulewsky (30:55.874)\r\nHmph.\r\n\r\n\r\nConnor Groce (30:57.474)\r\nfor how we break down the non-food franchise marketplace. And the one quadrant that we can go ahead and cross off is B2B, brick and mortar. There just aren't any opportunities in that category that are exciting to me right now. And so then I usually work in franchising. And I usually work through that with people and try to determine what are the one or two quadrants that they might be a good fit for. So, overall like non-brick and mortar.\r\n\r\n\r\nNikolas Hulewsky (31:10.337)\r\nin franchising.\r\n\r\n\r\nConnor Groce (31:23.542)\r\nThe differentiator there is that a non-brick and mortar business that you go to the customer and in a brick and mortar business, the customer comes to you. So non-brick and mortar B2C, that's when you're looking at things like home service. And sometimes youth enrichment are non-brick and mortar B2C. Yeah, youth activities. So, you know, things like swim lessons. Yeah, yeah, swim lessons, soccer coaching, dance lessons, things like that. So, and if they...\r\n\r\n\r\nNikolas Hulewsky (31:39.147)\r\nYouth enrichment? What's that?\r\n\r\n\r\nthat's like a whole category.\r\n\r\n\r\nNikolas Hulewsky (31:50.086)\r\nConnor Groce (31:53.09)\r\nThere are some franchises out there that are, yeah, they partner with existing facilities to offer those services so you don't have to open your own retail location, which lowers the investment a lot.\r\n\r\n\r\nNikolas Hulewsky (32:03.854)\r\nAnd so are you talking this through with people and you're like, hey, which of these sound exciting or are they, I don't know, giving you their information and they're taking a quiz and at the end of the quiz, you're like, well, based on your experience and you actually enjoy being outside, so I wouldn't recommend you have a retail location. should probably be like, how do you go about making the recommendation?\r\n\r\n\r\nConnor Groce (32:20.172)\r\nYeah, well, I mean, my initial consultation is 90 minutes. So we block out quite a bit of time to talk through everything from strengths and weaknesses as an operator. We talk to the geography of where they're looking, the market dynamics there. We talk to their capital situation. What are they working with? How are they going to fund it? Long-term goals, like all of that we talk through. And that's how we start to refine that search a little bit.\r\n\r\n\r\nNikolas Hulewsky (32:25.896)\r\njeez. Yeah.\r\n\r\n\r\nNikolas Hulewsky (32:46.838)\r\nAre there like some broad parameters that are the biggest pillars? In my mind, from what you just said, capital that you have to put in the business is probably not a limiter, like it's going to point you in one direction or the other. You know, if you don't have any capital versus if you have a million dollars in cash, you're going to qualify for some franchises over others. Geography is probably another pillar that you want to look at. Like you were saying B2B, B2C.\r\n\r\n\r\nretail versus not or brick and mortar versus non brick and mortar probably another pillar. Are there any other pillars like those?\r\n\r\n\r\nConnor Groce (33:21.398)\r\nWell, I describe it as like the three-legged stool of success in franchising is the franchisee, the owner, the franchisor or the franchise brand and the market in which they're doing business. And so we have to think about all of those in tandem to each other because if one of them is wobbly, the stool can get wobbly. If two of them are wobbly, the stool is going to fall over. So we're thinking about all of those. going back to what you were saying about B2B versus B2C,\r\n\r\n\r\nNikolas Hulewsky (33:41.581)\r\nYeah.\r\n\r\n\r\nConnor Groce (33:46.966)\r\nThat is something where I have no concerns about not being good at doing the thing that the business does, right? Like I own a window cleaning franchise, I'm awful at cleaning windows and I hate it. What I do think is important though is that there's alignment between the owner and whatever lever needs to be pulled to drive revenue in that business. So if it's a B2B business, it needs to be an owner who is comfortable with the top of that sales funnel being very network and outreach oriented.\r\n\r\n\r\nNikolas Hulewsky (33:54.382)\r\nHmm.\r\n\r\n\r\nConnor Groce (34:13.72)\r\nIf it's a B2C business, that's somebody who might be more marketing oriented, who's better fit to manage marketing campaigns, allocate your budget and things like that. But that is a whole lot more important to me than what are you good at doing with your hands? Because hopefully you're not the one that's actually doing it. Does that make sense? Yeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (34:23.011)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (34:31.028)\r\nYeah, no, yeah, it makes, it makes total sense. And I'm, the same way when I'm, I've coached a few people on like buying a business, right. And we have this whole set of questions. like, it's literally a personality test of like, Hey, do you like people? Do you not like people? Do you like processes? Do you not like processes? Do you like sitting in your office all day? Do you not like sitting in your office all day? How much money do you have? Like, so by the end of it, you kind of have this idea of, okay, based on your experience, you don't like people. So you're probably going to have a\r\n\r\n\r\nbusiness that is less people focused or you have to have a really good team in order to run that business. Anyways, so I kind of do the same thing. It's just interesting to see it applied the way that you're doing it through franchising. It's cool.\r\n\r\n\r\nConnor Groce (35:14.092)\r\nYeah, absolutely. people, that's another big variable. know, like how I usually frame the question when I'm working with people is like, is the people management piece of owning a business, is that something that you actively look forward to or is that something that you're willing to tolerate? Because you know, you don't have a choice. And that's another variable that some businesses are more or less conducive to how, you know, that individual thinks about people.\r\n\r\n\r\nNikolas Hulewsky (35:17.486)\r\nCough cough\r\n\r\n\r\nNikolas Hulewsky (35:28.812)\r\nYeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (35:37.548)\r\nYeah, if your response is like, I'm willing to tolerate people, you probably shouldn't be running a Chick-fil-A, which I know is not a franchise, but my pleasure is gonna have to be coming off of those lips 2,700 times a day. So it's probably not the place for you.\r\n\r\n\r\nConnor Groce (35:42.594)\r\nright.\r\n\r\n\r\nConnor Groce (35:50.838)\r\nYou're exactly right. And somebody that doesn't like to manage people, I mean, that's where a business where the labor, if it's a service business, maybe you look towards models where the labor is more subcontractor driven, where you have to manage one project manager, but who's insulating you from a lot of the people. those are kinds of the, some of the variables that I try to break down.\r\n\r\n\r\nNikolas Hulewsky (35:56.737)\r\nyeah.\r\n\r\n\r\nNikolas Hulewsky (36:08.398)\r\nWhat's, I'm curious on the spectrum of the amount of capital you need because some franchise franchisors that I've seen require, let's say a $50,000 buy-in and that gets you a territory. And then the startup costs are, are low, but then I've seen some that are like, Oh, you've to have a liquid net worth of $2 million and it's $500,000 worth of an investment. How does the spectrum look, I guess from your perspective.\r\n\r\n\r\nConnor Groce (36:32.034)\r\nSure. Well, so there are lots of franchises out there that you can get into for less than $100,000 total. My opinion on a lot of those franchises is that if it's that low of an investment and it's that low of like, yeah, just to start a business, the chances of that being a business where the franchisor is delivering a lot of ongoing value over and above you just going out and starting that business.\r\n\r\n\r\nNikolas Hulewsky (36:36.406)\r\nHmm\r\n\r\n\r\nConnor Groce (36:58.476)\r\nI don't think it's very high. Vending is an example of that. There are vending franchises out there that I don't love for that reason. I'm like, if you're gonna go start a vending machine business, go start a vending machine business. I don't really think that there's a lot that a franchise is going to do for you in that regard. So within what we'll call the overton window of franchise opportunities that I think are more viable, yeah, you're looking at anywhere from 100,000.\r\n\r\n\r\nNikolas Hulewsky (37:12.302)\r\nThat's fine.\r\n\r\n\r\nConnor Groce (37:23.104)\r\nup to like $2 million per unit, most of which are going to be between 100,000 and 800,000 per unit. And the variables there are how much does the franchise cost to start? How many territories are you going to purchase or how many units are you going to develop? And then the third is how involved are you going to be as an owner? Because anytime you're going to be less involved, you have to invest more.\r\n\r\n\r\nNikolas Hulewsky (37:25.826)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (37:43.254)\r\nIs there?\r\n\r\n\r\nIs there franchise that's like the gold standard where like everybody basically, if you get granted franchise rights to whatever business, you know you're going to be making money just because their systems are so good. They've got high demand. They've got a lot of market presence, if you will, from your perspective. Is there anybody like that? Or it's like, yeah, if you get in with Midas, you're freaking golden.\r\n\r\n\r\nConnor Groce (38:11.19)\r\nYeah, the challenge is that it kind of goes in cycles to some degree where it's like there are some that start out like that, you know, what we would call uniforms. I think that a lot of people would put crumble in that category where they get in and everything's just up into the right. You know, as the brand matures, sometimes you start dealing with oversaturation where not only is there more competition in that industry, but you know, if crumble's busting at the seams and all of their stores, they might then start to look at the marketplace and say, Hey, there are three crumbles in Boise right now.\r\n\r\n\r\nNikolas Hulewsky (38:29.07)\r\nHmm.\r\n\r\n\r\nConnor Groce (38:40.258)\r\nwhy don't we get that up to six, and let's open three more. And then all of a sudden they're just, I've looked at P &L's franchise portfolios that cover like an entire Metro operation before. And you'll look at the difference over like a four year period. And I've seen situations where they've opened up, they've increased the amount of locations there are by like 25 to 50%. And the revenue has basically just stayed flat. Meaning like you've just increased.\r\n\r\n\r\nNikolas Hulewsky (38:42.189)\r\nYeah, yeah, yeah.\r\n\r\n\r\nand the dynamic changes.\r\n\r\n\r\nNikolas Hulewsky (39:05.987)\r\nYeah.\r\n\r\n\r\nConnor Groce (39:06.018)\r\nyour overhead tremendously, but you're driving no incremental value or no incremental revenue rather. That's exactly right. So that's where it's hard.\r\n\r\n\r\nNikolas Hulewsky (39:10.51)\r\nbecause you didn't grow the market.\r\n\r\n\r\nAnd whereas an whereas another business, if it wasn't franchised, you'd have the mechanism there to like, oh, I'm the owner. I open this location. I'm going to shut that location down. But in the franchise space, if you've got a franchisee who's bought in, they're paying a royalty like what do you know, what are you doing? That's anyway, it becomes a lot tougher. All right. So what's question four?\r\n\r\n\r\nConnor Groce (39:32.428)\r\nYeah. Yeah.\r\n\r\n\r\nQuestion four. Well, you know, after when you're at the point that you're asking question three about, know, which franchise should I choose? Again, that's that's really after you have whether you're working with somebody or you're doing it on your own and you've sourced, you know, the right opportunities. That's when you would connect with the franchise or every franchise system is going to have their own discovery process that you go through, typically starting with an intro call and then going through a series of calls on different topics like marketing and operations and.\r\n\r\n\r\nFDD review, mapping the territories, et cetera. And so that would be the, those are the next steps is to go through that process. And a lot of questions come out of that. I guess one thing that I would leave the audience with in that regard is just like, I think that the most important part, parts of evaluating any franchise is the number one, the interfacing that you do with the executive team of the franchise organization, and also the validation, which is the process of talking with existing franchisees.\r\n\r\n\r\nNikolas Hulewsky (40:32.799)\r\nConnor Groce (40:33.186)\r\nthose are the most determinative factors in that process. Because up until that point, you might be getting information, ultimately it's all a sales process. The executive team, yeah.\r\n\r\n\r\nNikolas Hulewsky (40:42.894)\r\nWell, and it's kind of it's easier to to get validation from other franchisees because you know what the franchise is. You don't necessarily need their permission. They don't need to put you in touch with another. You could cold outreach to five or six and and get real feedback.\r\n\r\n\r\nConnor Groce (40:55.928)\r\nThat's exactly right. Yeah. And the franchisor, we talked about the item 19, which is where the financial performance is disclosed. The franchisor can't make any earnings claims to you or share any other financial information other than what's in the item 19. So they're somewhat limited in that regard, but franchisees that you talk to are not limited to that. And they also, they're on, yeah, they have no incentive to give you anything other than very candid feedback because, you know, a franchise salesperson, I mean,\r\n\r\n\r\nnot saying they're bad people, but ultimately their job is to sell franchises. So you always have to take that with a grain of salt as you're talking with them.\r\n\r\n\r\nNikolas Hulewsky (41:28.363)\r\nYeah\r\n\r\n\r\nNikolas Hulewsky (41:31.83)\r\nYeah. Is that step five validation?\r\n\r\n\r\nConnor Groce (41:35.32)\r\nI don't know what number we're on at this point, but yeah, that goes, yeah.\r\n\r\n\r\nNikolas Hulewsky (41:38.286)\r\nWhat? If I could, if if I could repeat this, the questions, it's like whether or not I want to be a business owner, whether or not franchising is for me, which franchise and then you're going to get step four or question four is talking to the to the actual franchise or is and from what I gathered step five is validation by going and talking to other franchisees of that franchise or. Fair.\r\n\r\n\r\nConnor Groce (42:00.194)\r\nThat's right. yeah, the step, yeah, and steps after that, that's when you're talking to with the franchisor about flying out to go to a discovery day, meet with them in person. And then that's where you progress towards signing a franchise agreement. And that's the process.\r\n\r\n\r\nNikolas Hulewsky (42:13.902)\r\nOkay, you said something earlier that I want to not debate with you, but just get into a little bit. You were like, basically, hey, if you're really interested in this, you should get somebody like you who's educated to like a Sherpa, a franchise Sherpa, if you will. I always hear that and I'm always like, danger. What are you trying to sell me? Trying to like get me, get me to do something here? Why is it so hard to just do it by yourself?\r\n\r\n\r\nConnor Groce (42:28.716)\r\nYeah. Right. Yeah.\r\n\r\n\r\nConnor Groce (42:41.784)\r\nWell, I mean, you can do it by yourself and a lot of people do. Well, I mean, I'll tell you, in addition to having been in the space across a couple of different brands, I go to like five or six franchise conferences a year, a couple of which I hear like Shark Tank style pitches from hundreds of different franchisors, like wall to wall over the course of a week. I'm probably talk with like two to five franchisors a week. I've helped in the last\r\n\r\n\r\nNikolas Hulewsky (42:44.962)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (42:57.454)\r\nMm.\r\n\r\n\r\nConnor Groce (43:08.984)\r\n12 months, like 70 something people through this process. And so it's like, it's very hard to get to that level of immersion in the franchise world without spending that amount of time. And so you can do it if you have the time to do it. A lot of people are just like, don't want to go to those links to develop the same level of awareness you have.\r\n\r\n\r\nNikolas Hulewsky (43:17.708)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (43:27.724)\r\nYeah, you're saying like, you're saying like, okay, the best, safest way to pick the right franchise is to work with somebody who understands what franchises are out there and can help map your personality, your skillset, your experience, your capital to an opportunity. Yeah.\r\n\r\n\r\nConnor Groce (43:44.052)\r\nYes, but I would also say that like your gut of being skeptical, I think is the right one because there are a lot of people that call themselves consultants or call themselves brokers who are really just salespeople and those are people that you want to avoid. Like I always tell people, don't take my word for it. Like you need to go and do your own research and listen to what I have to say and see if I align with how you think about that. If that does, then work with me, great. And if it doesn't,\r\n\r\n\r\nNikolas Hulewsky (44:00.589)\r\nWhat?\r\n\r\n\r\nConnor Groce (44:12.756)\r\nNo problem at all, but it's very important.\r\n\r\n\r\nNikolas Hulewsky (44:14.446)\r\nWell, it's interesting because when I bought my first couple of businesses, there's a couple of things that you're supposed to do when you're buying a business. One of them is a quality of earnings. Now the bank, if they're underwriting it, they'll do kind of their own quality of earnings, but you really should as a buyer, you...\r\n\r\n\r\npay to have somebody do a quality of earnings for you. And they can be anything from like a quick look at the P &L to, it's a healthcare company. I want to look at exactly what their payer contracts look like and what their AR is and their rates and all this stuff. And on the first deal, it was a small deal. I didn't pay a QOV and I ended up seeing just massive repercussions from it. Things that I missed that I would have gotten in a QOE. And now any time that I do a deal, it doesn't matter. I mean, that's like 20, $30,000. I'm doing a QOE.\r\n\r\n\r\nbecause I learned from that first experience, like you either pay for it upfront or you pay for it on the backend. you don't, nobody gets out of this unscathed. So in my mind, it's kind of similar to that where it's like, okay, you can pay, or not even pay is the wrong word. You can have an expert come and fast track you, or you can beat your head against the wall and try to figure it out yourself. And hopefully you make the right decision, but it's not as easy as just, I'll look online at their Yelp reviews and then pick one of these franchises.\r\n\r\n\r\nConnor Groce (45:30.998)\r\nYeah, it's a lot better just if you're working with a consultant, just work with somebody who you either know of someone who knows them or if you're referred, just because again, there are a lot of players in the space that I just don't think are perfectly aligned with, number one, don't have experience, and number two, I just don't think are aligned incentive-wise with helping people get in and have enduring success. So just be very careful.\r\n\r\n\r\nNikolas Hulewsky (45:56.782)\r\nI love it, man. This was great. Where's the best place for people to come find you?\r\n\r\n\r\nConnor Groce (45:59.884)\r\nYeah, they can look me up on my website is conorgris.com. They can join my newsletter. And then certainly if they're interested in looking at franchises, there's a way that you can submit your information to work with me directly to do that. yeah, happy to help.\r\n\r\n\r\nNikolas Hulewsky (46:12.59)\r\nCool. All right, man, we'll talk soon.",
  "metadata": {
    "duration": "",
    "date": "2025-06-09",
    "platform_source": "Google Drive"
  }
}