{
  "episode_number": "31",
  "episode_title": "How a Few Viral Tweets About Excel Built a $3M Business with Kurtis Hanni",
  "guest_name": "Kurtis Hanni",
  "business_name": "Fractional CFO Services",
  "transcript": "﻿Have you ever heard of a social media influencer who built a multimillion dollar business around their brand?  Probably. But what about the one who built their brand? Around spreadsheets.  Well, today I sat down with a CPA about the least sexy brand you can have who did just that. So if you're curious about using a personal brand to grow your business in unconventional ways, then this episode is for you.\r\n\r\n\r\nI'm just trying to answer one question. How the freak did Curtis honey build a multimillion dollar business off of some viral tweets about Excel?  Let's hop in.  All right, Curtis, Curtis, honey, welcome to economics. Stoked to have you here. Good to be here, man. Your podcast office, honestly. Looks incredible.\r\n\r\n\r\nThe shiplap, the pictures.  I'm very jealous. I'm not going to lie to you.  I look like I'm in a Russian prison camp. You look like you're, you know, got your life figured out. So thank you for, thank you for joining me and making me feel bad about myself. Glad it at least looks that way at some point. Right. \r\n\r\n\r\nAll right. Well, I'm excited to have you on. You have both a boring business and a very new age business. So I want you to get into it. Briefly explain what is your business? And how do you make money?  So about probably 2 years ago, I started a fractional CFO business. And so for fractional CFO work, it's much like  you say, new age, because we don't have to have clients in our physical location.\r\n\r\n\r\nEverything is done online. And I think covid really moves the industry forward. Substantially. My clients are all on monthly retainers, meaning we charge a flat monthly fee. And with that flat monthly fee, they get a set number of deliverables as well as the ability to contact us at any time about different issues and things that pop up our fees.\r\n\r\n\r\n10 to be between three K and 10 K a month. We're really focusing on that SMB space, meaning anywhere from say, three to 5 million in revenue all the way up to have clients that are north of 30 to 50 million in revenue. And so kind of a wide array we're. My firm right now, which is probably changing on the line, but my firm right now is primarily focused specifically on the deliverable as it relates to fractional CFO.\r\n\r\n\r\nSo let me just kind of break down fractional CFO. So CFO  is a chief financial officer and Recently some of these companies have been coming about where they  I'm a small business. I can't afford a CFO full time.  But what I can't afford is a certain amount of money per month towards a CFO. And so these agencies, these companies have started up where they fractionalize it.\r\n\r\n\r\nI've seen now fractional CEOs. I've seen fractional CEOs.  So this fractional thing is not a CFO. It is becoming new, but it's not necessarily unique. It's growing in the space. Can you talk a little bit about like, what does a CFO do?  Like not even, not even your agency, the fractional piece of it, just like broadly, what is a CFO? \r\n\r\n\r\nYeah, I break kind of, it all fits into the world of like accounting and finance. Right. And so I break that into really three different verticals. First, you have. Transactional work, and that's the debits and credits. That's coding transactions where they're supposed to go. That's all the accounting controls, all that sort of stuff. \r\n\r\n\r\nNext, you have the tax piece, right? And business owners are extremely worried about that tax piece because obviously. Their taxes directly determine how much goes into their pocket at the end of the day. Then the third leg of that stool is the strategic piece. And so that's being a strategic partner for the business owner.\r\n\r\n\r\nSo  those are three unique roles with three distinct purposes in a good CFO in a SMB space is going to be focused on that strategic piece, meaning they're not doing day to day accounting work. They're focused on. Forecasting forward looking things for the business.  And what that ends up being is you deal with banking relationships.\r\n\r\n\r\nYou deal with outside, you deal with outside parties. Uh, if that's investors, if that's bankers, if that CPAs, whatever those outside parties are, and you really become a  kind of strategic launching point for that business. What I viewed my job as a business owner.  It's a lonely proposition, right? You're the only one who knows everything.\r\n\r\n\r\nYou're taking all of this on your shoulders. So I tried in my previous CFO roles to be the one person that they could talk to that would have that full picture. So I viewed myself as a partner in that struggle with them.  And I think a good CFO is able to do that.  The actual job duties are going to be way different from business to business, depending on your competencies.\r\n\r\n\r\nSome will get into sales. Some will get into marketing. Some will be really heavy in the accounting world. It's a job that flexes with the business and with the person in that role. And so it is one of those things that there's not like a clear, like this is the exact thing you're doing day in, day out.\r\n\r\n\r\nAdmittedly, I'm an idiot.  That's probably, I think that's the best explanation I've ever heard of a CFO is you've got on the finance side, essentially three buckets transactions, tax strategic,  and for small businesses, especially when you're sub a million, even the sub 5 million,  the transactions piece makes sense.\r\n\r\n\r\nRight. I hire an accountant, maybe I get big enough and I get a controller and they're just making sure that my credit card transactions are coded appropriately, that my reimbursements, that my mileage, like whatever else is put in the right places so that I can get a monthly snapshot of where my business is because I need to know how I'm operating in order to make decisions for the future.\r\n\r\n\r\nSo that makes sense to me. The tax piece has always made sense to me too. Right. Where it's like, okay, I have a CPA. They also need the bank transactions. They need my financial statements in order for them to file my taxes.  The third one though, like the strategic piece has always been a black box for me. \r\n\r\n\r\nCause I'm like, well, like what does that mean? Strategic relationships? What does that mean? Planning and forecasting. If you were to kind of. Dig into that third leg of the stool, which I think, especially as you're growing is an incredibly important piece of the stool. How would you break that down further?\r\n\r\n\r\nLike, I love the way how you're like CFO, there's three buckets. Would you say there's a couple of buckets in that strategic bucket as well? Yeah, that's a great question. And if you think about it from the nuts and bolts  is actually all back up and say, like how we go about onboarding a new client is we try and hit on those buckets.\r\n\r\n\r\nRight. You have revenue, you have cost of goods, you have expenses.  That's just on the profit and loss side. Then you have on your balance sheet, you've got all your liabilities, you've got how you manage your cash. So when I come into an engagement. The first thing we do is figure out how we can improve your cash conversion cycle.\r\n\r\n\r\nHow can we collect money quicker from the vendors? How can we deal with payments deal with cost of goods sold deal with terms on that other side? How can we approve inventory management?  Then kind of the second piece is what are ways that we can improve revenue? Is that increasing pricing and I say revenue, but it could be margins as well.\r\n\r\n\r\nIs it increasing pricing? Is it changing structures within the business? Is it seeking out new lines? Is it? And so when you think about strategic, it's like asking you, well, How are you going to, how are you going to increase revenue? Well, there's a million different answers to that question. And so that's a deal where I may not have an expertise in every way that they can increase revenue, but I have enough experience that I can ask the right questions to get them thinking about things that they've potentially not thought about before, or really go through the thought exercise of how would we, if we wanted to get to this goal down the road, how would we do that?\r\n\r\n\r\nYou're so good at this. Maybe it's just like me, but like, I don't know the way you're. You're speaking very clearly and dumbing it down enough for me to understand like, Oh, that makes sense. Right. Cause you  on the accounting side of things, which was that first bucket.  From that, I get the PNL  and the PNL helps me understand, okay, how are we operating, but that's not a snapshot of the cash going into my bank account.\r\n\r\n\r\nSo when you bring up the balance sheet, which has your liabilities and it has your assets and you start thinking, you start talking about the cash conversion cycle, like that clicks for me  in why it's important to have a strategic relationship with a CFO, because  it's much harder. As a business owner to take the PNL, which makes sense.\r\n\r\n\r\nI, okay. This is where we accounted for everything. This is the cash in and cash out.  And then to translate it to the balance sheet where it's like, well, how did that cash get there? Oh, okay. It was revenue, but actually  it wasn't cash in. It's an account receivable. We provided the service, but that takes 30 days to collect.\r\n\r\n\r\nSo this is actually our true cash picture. Like having someone to help you walk through that and understand your cash conversion cycle is incredibly valuable. Okay. Anyways, I think I interrupted you mid sentence, but that's like clicking for me on the strategic side. Yeah. And I think like an example of this is I just spoke to someone in the last couple of months that they were making money from the profit and loss.\r\n\r\n\r\nAnd I'm just going to use round numbers here. Cause I'm not obviously like trying to disclose client information, but no, no, no. Let's say they're making 50, 000 a month and by making you mean profit in profit. Yeah. I had 50, 000 a month in profit. And they're like, but my bank account is flat every single month. \r\n\r\n\r\nWell, when we, when we look at it, I'm like, well, here's why it's flat. It's because you have this debt and you can draw a picture of, you have 50, 000 that's supposedly coming in that you're supposedly making, but 45 of that. Is going to distributions and debt. And of course your balance isn't going, but when you bring in the projection piece and saying, well, actually this debt is rolling off in three months.\r\n\r\n\r\nThe next one is rolling off in six months. If we look six to 12 months down the road, we can see that your cash balance is going to start to build. So while it feels like you're. It feels like you're underwater right now and you're not getting the returns. You expect  wait six months.  And you're going to be at this cash position within this range.\r\n\r\n\r\nAnd in a sense, as the strategic CFO, my goal is to say, this is a prediction of where we're going to be down this road. And then we've tried and validate that prediction. Part of what's great about those predictions. Is you can use those predictions, and after you've gained a level of certainty and trust with that relationship to make strategic decisions today that don't pay off for 6 to 12 to 24 months, because you have a deeper understanding of what's coming.\r\n\r\n\r\nAnd so you can. Make those decisions with way more certainty than you ever could have in the past, because you can have confidence in it and almost as important. It prevents you from making poor decisions. Like if I'm a business owner and I'm like, I don't get it. I'm making 50, 000 a month, but my bank account isn't moving.\r\n\r\n\r\nI got to change something up. And then you come in and say, No, no, you're good. You're paying off these debts in the next three months. You'll get here and you'll start adding a lot more cash. I may have made a decision that was drastic, but I didn't need to. And with your added perspective, it helps me make better decisions.\r\n\r\n\r\nIt reminds me my very first job at a college. This was 12 years ago. Now I got, I just got kind of got thrown into this opportunity. I worked for this company that was very entrepreneur, entrepreneurial. And they just said, basically you handled the P& L and we bought this company and the company the previous year.\r\n\r\n\r\nHad lost 400, 000.  It was a healthcare company. And so I came in and I made some simple changes,  but we ended up making 600, 000 the next year. So we went from a 400, 000 loss to a 600, 000 game. And like, these are about numbers that could be off a little bit one way or the other, but it was about a million dollars swing.\r\n\r\n\r\nAnd people looked at me like I was a genius. They're like, Oh my gosh, the whiz kid. He's here.  There's only one thing that we did.  And  it sounds so simple, but  we just improved collections because they were writing off like 12 percent of their revenue.  They just weren't, they just weren't collecting it. And in healthcare, we're not McDonald's, right?\r\n\r\n\r\nI go to McDonald's. I order hamburger. I pay you for that hamburger today. And you give me that hamburger today in healthcare. We go and provide services at somebody's home, and then 60 days later, on average, we're getting a reimbursement from Medicare or from the insurance provider or even from the patient themselves.\r\n\r\n\r\nSo there's this like 60 day gap in between the time where we provide service and when we actually get paid and. If you're not managing that appropriately, then it feels like you're not making as much money and you make, you may make really poor decisions because your AR balance is growing like crazy, but your cash isn't growing.\r\n\r\n\r\nAnd it's because, well, all of your cash is sitting in accounts receivable. So. For me, I looked like a genius, but really all it was, it was like tweaking some of our collections and making sure that we weren't losing as much out the door, but the operations were pretty much the same. Like the people were the same.\r\n\r\n\r\nThe referrals were the same. It's incredible how like one tweak or one focus on something that doesn't feel related to the business can make all the difference. And that's where, like hearing you talk about your role as a CFO,  it can be incredibly valuable in making those decisions. Did it take you a while to feel  that value or have you kind of always known from day one, like.\r\n\r\n\r\nHey, if you don't know your accounting, if you don't know your, your cash situation, you're up a creek without a paddle.  Yeah. You know, so this is kind of just a reflection on my career as a whole is I got an accounting degree, but I knew I did not want to go into the traditional like public accounting path. \r\n\r\n\r\nSo I always, I started out. In private businesses.  And really quickly after that, I then found, I realized I wanted to go to these smaller businesses and frankly, is cause I looked at accounting as a way to translate business, but I was not obsessed with accounting. Right. So even from very early on, yeah.\r\n\r\n\r\nWho is, well, there's the crazy thing is there's a lot of people that are, which is absurd, which is crazy to me. Cause like they are, and that's like the very prototypical CPA. Like they're really. They're really locked into all those debits and credits and the way you code things. And they get really into the weeds on all this stuff.\r\n\r\n\r\nAnd I've always said, man, all I want to do is help a business scene. I want to help a business get to the next level is probably naive of me, but I thought, well, I'd rather just be in these small businesses because I can do more than just Then just the accounting work, I get a chance to be a part of these conversations.\r\n\r\n\r\nSo from really early in my career, I went into a place where,  you know, week one, I had no one that I was supervising, but by the end of year one, we had three people because we tripled in size and really quickly had to figure out how to do all these things that I've never done before. And so I got lucky in that sense, but it was what I wanted because. \r\n\r\n\r\nI've always been a tinker.  And so that worked really well in these situations where we were just learning on the fly. And so it's through just getting myself in the deep end and trying to dig out of that hole that I've gained a lot of my experience and what I've been told from the business owners is like, because I'm always kind of the outsider looking in.\r\n\r\n\r\nI'm never the one that's the expert in these. I have a unique way that I can look at things because I don't have a All of the junk, the previous experience to say, this is the way we've got to do it. And so, um, that's when, that's what got me excited about the fractional CFO work is cause that it's an opportunity to do that.\r\n\r\n\r\nSo walk me through, how did you get into it? What were you doing before? And what was the light bulb moment where you're like, Oh, I could start a fractional CFO company. Yeah. So. I was in a, I was in a business. We did physical security services and he had six or eight other businesses that I was physical security services.\r\n\r\n\r\nWhat is that? Yeah. Physical security guards. So security guards standing in buildings, securing. Oh, okay. Yeah. And he was talking about starting a family office and I really wanted to do that because I didn't, you know, I thought that was a cool. Cool. That's how much money he had.  Yeah. On the low end, he knew a lot of family offices.\r\n\r\n\r\nAnd so he was looking to make other investments. And so we were going to go down that route. This is my understanding. Family offices are like a hundred million dollars as the minimum threshold, because  let me just explain family offices really quickly.  A family office, essentially. Is when somebody is wealthy enough to pay and have a team that manages their investments for them. \r\n\r\n\r\nAnd in order to pay for a competent enough team that manages your own investments, you need to be generating enough money from those investments in order to be able to afford them. And so family offices typically have a chief investment officer, a chief financial officer, and then some analysts maybe that are looking at deals and helping you close deals.\r\n\r\n\r\nAnd then they've got to pay for those transactions, et cetera. So usually the threshold for that is like a hundred million because if you just Parked it in treasuries and you're generating 5 million a year off of that a hundred million dollars. Theoretically that could pay the salary and the transaction costs for that team.\r\n\r\n\r\nSo that's kind of where the a hundred million dollar minimum threshold come from. So when you're saying like, you're working for a guy who owns a physical security company and he's like,  Family office. I'm like,  come on, say what that business was not that big. And when I say family office, I know a couple of people that are in family offices, they're billionaires, but they only have two people in their family office.\r\n\r\n\r\nYou got to remember we're down home, Oklahoma people. Like we're not, we're not going this Northeast, you know, this Northeast deal. We're, we're not yet those Yankees, right? Exactly. So. So this family office would have been, you know, me running it with maybe one other person. That's kind of an analyst sort of deal.\r\n\r\n\r\nSo, so it was basically, he's looking for ways to spend his money. He wants to invest in other businesses and I wanted to have the opportunity to do that with him. Um, through various means that didn't happen or was not happening in the speed that I wanted it to happen. So I thought, let's go seek out another opportunity.\r\n\r\n\r\nSo I moved to another business where I was going to become one of five owners in that business. That was the plan. It was not written in a contract, but that was the plan. And frankly, the business was smaller than what I was used to. So I got in the business and I was a little bit bored, meaning there wasn't enough to do.\r\n\r\n\r\nThey were overpaying me for the job it was. But again, the goal was to become part of that ownership group.  And so I started posting on Twitter. So all the stuff that goes on that world and it kind of blew my mind, what the opportunities were. And through that, I basically had two birds in hand. As I said, I've always wanted to do something a little entrepreneurial and I can do that, or I can continue down this path of being one of these five owners.\r\n\r\n\r\nAnd when I looked at both of those, I said, I'm going to regret if I don't take a shot on myself to do this. So I was going to be offered ownership before we got to the document parts. I just said, listen, I have to bow out here. This is what I'm going to do. And it was a good situation, but so that kind of started my journey.\r\n\r\n\r\nYou started going on Twitter and. You know, you were in the days of social media where you were one of the first to post those threads. It was like,  what's a P and L let me break it down for you. And it wasn't like I said that kind of jokingly. They were very good breakdowns, right? And it's much the same way you're explaining this  at a fourth grade level for me to understand accounting that, I mean, that's what your threads looked like as well, and that's why they were popular.\r\n\r\n\r\nAnd you grew to, I don't know, quarter of a million followers or somewhere in that, maybe more than that, in that ballpark, were you starting to get business from those people? Like, were they starting to reach out to you and say, Hey, could you do my accounting or like, how did it turn from getting followers to a business? \r\n\r\n\r\nYeah, so I started and I have like, I don't know, 180, 000, but we've talked about this. It's kind of, I've not nurtured that asset. You bought your followers, right? I bought them. That's exactly right. Yeah. We're going to leave it all out here. Leave it all. Uh, yeah, no, unfortunately I was a little bit. I was a little bit lucky that I was in the day when followers were a little bit easier than what they are now. \r\n\r\n\r\nAnd so I had a lot of growth. And honestly, some of that growth too, was outside of the SMB space, because when I got on, honestly, it was a game, you know, I treated it as a game.  Anyways, that's a little sidebar, but the.  Where this turned into a kind of a job, you could say, is after I posted that first thread where I went really viral, I gained like 20 to 25, 000 followers within a matter of 48 hours, which was one of the most insane two days of my life.\r\n\r\n\r\nIt was absolutely insane. I almost gained more followers than likes on the post, which is wild. Like it's like a. You know, just a wild thing. It kind of had a moment where, wait a second, what is this? And it made me sit back and think, and I was actually talking to someone about a new potential opportunity.\r\n\r\n\r\nAnd I started looking at this and I said, well, if you look at the economics of just a info business, as it relates to. These online followers. This is what this could potentially be. So I started a cohort, started a newsletter, did some things, but my thinking was that was all going to be on the side of taking this ownership in this business. \r\n\r\n\r\nBut then because of the followers, because the newsletter, because of all this, I started getting random consulting inquiries. And so I'm had a few consulting opportunities.  And in doing that, I realized that while I don't like, Being on calls all day, right? That's the bad part of it. I like the troubleshooting that you do in this fractional CFO world.\r\n\r\n\r\nAnd I was only getting to do it a portion of the day over here. And I was dealing with all this other junk and I realized, well, that can actually be the job. You know, and so that's how I initially looked at it was that it would be a new job and that I would be doing a lot of consulting. And then over time that's evolved, you know, to kind of a much, much larger, different vision, but that was kind of the initial, I can make more doing consulting on my own than I could doing this.\r\n\r\n\r\nAnd between the consulting and kind of the info products, be able to make something that was much bigger than the opportunity I had otherwise. There's a saying in venture investing, which is first time founders focus on product. Second time founders focus on distribution. So distribution is incredibly important.\r\n\r\n\r\nThere's a reason why people spend tens of thousands of dollars just to reach, you know, 20, 000 people in a demographic.  But basically, it sounds like what you realized was,  Hey, I just, I have all these eyeballs on me.  Uh, I could turn this into something because I have these people who are now following my stuff.\r\n\r\n\r\nSo let me capitalize on this distribution channel that I've kind of fell into. However, you want to call it lucked into create. I'm not saying you lucked into it. I'm saying you're thinking at the time was like, Hey, I got all these followers. So let me turn this distribution channel into something. And the something is I can offer fractional CFO services. \r\n\r\n\r\nYeah. A hundred percent. A hundred percent.  So what does that business look like? Like just speak broadly for the industry. What are the margins? Like how much revenue are you generating per customer per month?  How many customers can you handle? And anyways, let me stop asking questions. What did the economics look like?\r\n\r\n\r\nThere's kind of two sorts of these businesses is one is the traditional old fractional CFM model, which was, you could handle three to five clients where you're literally generally going into that client's office. Sitting there for one to two days a week and collecting a paycheck from them. Like this is the old school, the old school fractional CFO model.\r\n\r\n\r\nOkay. What really changed with COVID is people became comfortable with, Oh, we can do zoom meetings. So we don't have to physically be there. It can change the way the engagement is. So in the new fractional CFO world, what that also does is that brings. The engagement fees significantly down because before, if you have a CFO level talent, it's these guys that are at the end of their career that don't want to take a full time gig.\r\n\r\n\r\nThey just want to work three days a week. They'd go sit in an office for three days a week, and then they'd go play golf the other, you know, three or whatever it was. And  this, that's only six days, Curtis. It's only six days,  day arrest, day arrest. That's right.  So  the new model. Has become again, I've, I mentioned the fee range of three to five K or three to 10 K per month per client.\r\n\r\n\r\nAnd that's dependent on revenue on revenue side, a typical fractional CFO can generate or not generate, can probably have up to 15 clients at that range. It just kind of depends on the level of engagement that it is. If you're doing 15 clients, you're going to have  Not much time to do anything else because you're going to be really heavy in client work.\r\n\r\n\r\nBut the new model also brings in kind of overseas support. So outsourced professionals that kind of help with fulfillment, whereas the old model was just this old stodgy guy that would just go, like I said, go in and sit, and that would be the deal. So this new model is opening it up to businesses that are at a more entry level scale, like moving it down the scale of when you can hire a fractional CFO.\r\n\r\n\r\nIn margins, I'm not a great example on margins, but for most of these fractional CFOs are a business unto themselves with maybe a handful of contractors. So margins are going to be super high. So if you're collecting, if you're collecting a 5, 000 fee. Four of that five is going into that owner's pocket.\r\n\r\n\r\nWow. Actual CFO firm, because at that, at that level, it's treated like it is your job. You're not building when you get into the bigger scale, fractional CFO. I don't have a good sense of what margins are. And I think margins are rapidly evolving because again, before.  It had been all us based and now they're seeing a lot more outsourcing.\r\n\r\n\r\nSo there's a changing margin structure in the business at large. Like when I said in the very beginning that you've got a kind of an old school business, but a new model, I wasn't even talking about the overseas stuff. The stuff I was talking about was this distribution channel that you've cultivated.\r\n\r\n\r\nCan you talk a little bit about that? Cause like one of the questions I had for you was, Hey, what's your CAC?  It looks like you have. No customer acquisition costs. You're not, you're not out marketing. How do you get customers and how do you think about leveraging your distribution channel in order to get customers for your fractional CFO company?\r\n\r\n\r\nYeah. For me at this moment, I'm lucky that I have. I have my email newsletter and my followers on social and that the only way that you can see that I have, I've probably mentioned my fractional CFO business a handful of times in each location I do have at the end of each email I have, Hey, if you want to connect further, here's a fractional CFO business that I have, but I'm not even overtly mentioned it on social or in my newsletter other than a few passing mentions. \r\n\r\n\r\nSo to get to it, you have to go to my personal website and you have to click through a few different links to even see that business. I'm not on your newsletter. I know your social is right, but what is your newsletter about? Yeah, my newsletter is called frameworks and finance. So my goal is to talk to  small to medium business owners and just do.\r\n\r\n\r\nFinancial education, you know, so they know, they know that you're, you've got CFO level skillset. They like the information that you're giving to them about how to manage their business.  So it's not necessarily a jump. Like, you're not like, Hey, I'm a golfer. Let's talk about golf. By the way, I have a CFO company.\r\n\r\n\r\nLike it's correct. It's tailored. It's targeted at these individuals. Exactly. And so for now, I've just taken what's come my way and I jump on calls and figure that out in the future. That's going to change. Because for me, I've been trying. I've only been full time for just under a year now. So I've been trying to really refine delivery and refine my systems with my team so that.\r\n\r\n\r\nI can onboard people much more efficiently. And so we're kind of getting to that point now and going forward, the way I see my initial marketing channels are my initial marketing channels are going to be to talk much more openly about my business, meaning I'm going to talk about it on social, I'm going to talk about it. \r\n\r\n\r\nAnd then once I've kind of seen how that lead flow falls out, my next step is to do some outreach, but that outreach is going to be outreach to people that are already connected to me through either a social or a newsletter. So we'll figure that out as we get there. But yeah, tell me about your newsletter.\r\n\r\n\r\nSo like, I 180, 000 followers on Twitter.  Um, are you on other social platforms or is it just Twitter?  I'm on LinkedIn as well. I don't, I honestly don't know how many followers I have there, but that's fine. Your newsletter. How big is your newsletter? Yeah, I have 40, just under 40, 000 people on my newsletter right now. \r\n\r\n\r\nYeah. So,  yeah. So my holy crap.  That's a lot of freaking people on a newsletter, Curtis. It is. It is a lot. It is a lot. And it's a thousand.  I'm sorry. I, this, I didn't, Oh my gosh. I wish I could say this was like a softball and I was just setting you up for it for context. I mean.  So he'll blooms trying to get to a million.\r\n\r\n\r\nI think he's at a couple of hundred thousand. Yeah. But there's, I don't know, there's 40, 000 is a ton of people on a newsletter. How the freak did you grow that newsletter?  Yeah. So I grew that newsletter through viral Twitter threads. So viral treads there. But then I also did for the last, Oh, year ish I did paid acquisition.\r\n\r\n\r\nWhere I used either ads or I use spark loop or some kind of some of these other tools a little bit. I've backed off of any paid acquisition at this point because the quality on some of the spark loop was not great. So I backed off of that. So for those who don't know, spark loop is, uh, I don't even know what I'd call it.\r\n\r\n\r\nAn ad platform that essentially recommends your newsletter to other people and you pay a certain amount of money. But only if they opt in and only if they remain an email subscriber for a certain period of time, to your point,  it's definitely not as high intent as if somebody saw your viral post of yours and was like, Oh, I'm interested in Curtis.\r\n\r\n\r\nSo I'm going to go ahead and go and follow up. That's one way you can sort of grow a newsletter if you don't want to answer that's totally fine. What's like your open rate on 40, 000?  Yeah. Open rates a little bit hard right now. Cause it's like  they've made changes, but my open rate before was between, it was about 45 percent now it's been trending between 35 and 45.\r\n\r\n\r\nIt's like Google made a bunch of changes. And so that impacted it. And so it's like trying to figure that out. But the model with a newsletter is I run. Advertisers. And so I have a sponsor of each newsletter. I may get to the point where I've developed enough resources on my own that I don't run sponsorships.\r\n\r\n\r\nBut right now the sponsorships have been lucrative.  You almost have like a negative customer acquisition costs, right? Cause you're getting paid to put out the newsletter and any referrals that come from the newsletter  turn into business. You didn't pay anything. You actually got paid. So you've got, if you were to calculate it that way, it's a negative.\r\n\r\n\r\nYou can. Yeah. And that's where I was trying to figure out ROI on paid acquisition. But my problem is my volume's not high enough at this point. So until my volume gets higher, it's really hard to really nail that in. But if I was paying for acquisition of a subscriber, my hope was that I could be negative or net zero.\r\n\r\n\r\nWith my sponsorship revenue so that then anyone I acquire out of that would have a negative, like would have negative or basically net zero acquisition costs. Are you comfortable talking about like what do the economics of a newsletter look like? Well, yeah, so my newsletter is a little bit different. If you look at all the benchmarks, being in the financial space is really advantageous for this. \r\n\r\n\r\nI can give a wide range cause I don't know, I have some not NDAs with the people that I have sponsorships with. So I'll just give a range and then we can kind of talk about that. But each week I send a newsletter, I collect. between 3, 000 to 6, 000 to 8, 000 a week per send on the newsletter. So that's why I'm saying it's turned into a business of its own.\r\n\r\n\r\nAnd my goal with that is I'm going to be making some changes to the newsletter. That's going to provide some additional opportunities. And so my goal is to eventually get to where I have multiple writers and we even have paid writers and can really become a go to source for like SMB owners or SMB finance leaders and really kind of the go to for, for people in that niche. \r\n\r\n\r\nAll right. So there's a couple of different ways that I understand it on the newsletter business that you can monetize. You can monetize through selling ads, but you can also monetize from affiliate agreements to art. Like, do you have affiliate relationships at the moment? I have one affiliate relationship, but everything else is just a paid ad.\r\n\r\n\r\nThe affiliate relationship is with a, with actually meow that bank. And I got to meet why just blinked on his name, their main owner, the main guy.  For meow. Yeah. Brandon, yeah, Brandon. Wow. I just linked on Brandon, but I met Brandon. We had a great, you know, great rapport. And so that was one that I supported, but everyone else, yeah, I don't like to do affiliate generally, but I've made that exception with them.\r\n\r\n\r\nAll right. Let me try to do some numbers here.  Cause you're blowing my freaking mind right now. From what I remember on the newsletter business, I've gotten into podcasts. I'm like mixing up the two.  I thought like a good newsletter is like 10 to 30 or 20 to 30  per thousand subscribers. I think it was like 50 to a hundred per thousand opens is what I was remembering.\r\n\r\n\r\nOh, okay. So if I have 40, 000  subs, that's like 16, 000 opens.  And so it's like, it's 50, if you're going with a 50 per open cost, it's 50 per 1000, not 50 per one. Even if we just had cost per subscriber, right? And you're just, let's just say you're generating 5, 000 a month in revenue.  That would mean, let's see.\r\n\r\n\r\nI'm going to round up here. 50, 000. So that's 50. So 5, 000 divided by 50 is what? A hundred dollars.  Yeah. So you're like, if the normal range for like cost per subscriber is 10 to 30 year and you're at a hundred dollars, it's because you're targeting  business owners, right? Like that it's a, it's a much more valuable audience than, you know, Twitch streamers who want to get the latest game information that is freaking.\r\n\r\n\r\nOh, my gosh. That's fascinating, Curtis. That it is.  Wow.  I would say initially that started out as I valued my time high. Cause I'm like, I'm not going to take on, I'm not going to take on an advertiser for 500. Cause that's just a pain in the butt for me, you know? And so. At first it was just, I shot high because I'm thinking it's not going to be worth it for me.\r\n\r\n\r\nAnd then eventually that turned into, as I grew, I just kept pushing the upper limit on purpose. And you realize with a lot of these finance advertisers, they're in the space. That the acquisition of the customer is huge and there's a lot of big contract values. And so even at those rates, you're still cheap for them in relation to acquisition for that customer.\r\n\r\n\r\nSo how do you think about the money that you're generating from the newsletter? Cause like, I just heard this podcast where so he'll bloom. He's, you know, he's trying to get to a million email subscribers. And basically what he's doing is he's taking all the money that he's generating from his newsletter and just reinvesting it into customer acquisitions.\r\n\r\n\r\nSo he's, I think convert kit has like a. Creator platform that they were, you know, refer to each other, but there's other ways to get subscribers as well. Are you doing the same thing? Are you like, cool, I'm getting five grand a month. I'm just reinvesting that into getting more subscribers to my newsletter.\r\n\r\n\r\nOr are you taking that 5, 000 as a distribution or, and then how do you think about it moving forward?  That initially was my thesis as well. Back when Sahil first started doing that, he was under 100, 000 subs and he went really aggressive on paid acquisition and you really saw the flywheel working. He worked with a few different companies on that.\r\n\r\n\r\nAnd I spoke with one of the guys there. And I was like, Hey, if they're doing it, I can do it on my own. And so I, that's when I started kind of the paid ads. What I realized over a period of time is that works really well for them because they're going for a general audience. But for me, that wasn't ultimately getting me in front of the right person.\r\n\r\n\r\nAnd so.  I pulled back from that in my going forward strategy is going to offer free and cheap paid resources to then feed and funnel people into the newsletter. So I have, I guess, three now free. Seven day email courses that are going to be my promotion channels. And then through that, I'm probably going to test some like ads on different platforms and see how they do, but I'm not going to go with that referral model because.\r\n\r\n\r\nI will do free exchanges of referrals, but not the paid ones because you get a wide range of people in that. Dude, I love the creativity that you're bringing to a pretty boring business. I think that because you're bringing creativity to it, it's going to add a lot more value and opportunity for you.\r\n\r\n\r\nThat's really cool. And I remember we went longer than I usually go because just cause I find it so fascinating with this stuff. All right.  I'm going to ask you some rapid fire questions and then we'll wrap up. Is that cool? Sounds good. Sounds good.  First one. What do you love about this business?  I love that I get to have these kind of strategic high level conversation with different types of business owners, because I've always been a kind of learner in that sense.\r\n\r\n\r\nAnd so I get to learn about different types of business models and extract that data. So that's my favorite part of it.  That would be awesome. You know, satisfying that intellectual curiosity, I think is that that'd be really cool. What do you hate?  I hate that. I have to jump on meetings all the time.  I would prefer not to have scheduled zoom meetings every day, but that's, that's the part of the job that is necessary.\r\n\r\n\r\nSo.  All right. So real estate guys are always jealous of SMB guys. Cause they're,  we think the grass is always greener and vice versa. The SMB guys are jealous of the real estate guys. Cause they're like, Oh, it must be nice to have a piece of real estate that just appreciates every year and generates cashflow.\r\n\r\n\r\nAs you sit here in 2024, what businesses or industries are you jealous of?  And I've tried to figure out ways to really crack this nut in the  fractional CFO world, but  I think is, is probably going to be a common answer that you've gotten is the SAS, the SAS world, right? Because  you're able to collect money without continued effort.\r\n\r\n\r\nAnd I guess you could say the same on some of the real estate. Real estate has never appealed to me from the sense of you're taking on debt. It's always a risk measurement. And to me, I'm a little bit more risk averse. And so the SAS really kind of fits that profile a little bit.  What are you obsessed with right now?\r\n\r\n\r\nLike if you have two hours in your day and kids aren't home and you don't have to worry about work and what are you doing, what are you sitting down?  Or not even sitting down, going out, like, what, what are you doing? So right now that's become, that's become golf for me. I've been a big golfer, but even to go deeper than that, I'm obsessed with obsession, meaning  the TV show years.\r\n\r\n\r\nI'm just, well, no, I'm just kidding. I don't even know if there's all the eyeballs. No, but I mean, what I mean with that is  for years. I realized this about myself a few months back. I was so worried about being weird or being outside the normal that a lot of times, like I had interest in things and I just suppress those things because I'd like go down these rabbit holes with business or go down these rabbit holes with different hobbies and then.\r\n\r\n\r\nI'd be worried about, I'd be  seen abnormal to these other people. And so I was always worried about kind of external appearance. So what I've really tried to dig into over the last, say three to six months is if I get obsessed or I get really locked in on something to really be willing to, like, in a sense, let your freak flag fly, like, right.\r\n\r\n\r\nBe willing to share these things. And that's not my nature. And so I'm trying to really do that. So that's been something that I've tried to been ingrained in myself is like, for example, a weird thing I did.  Wouldn't tell people for years, but when I got married, my wife sends me a list of my buddies that she wants me to ask for their address so she can send wedding invitations  to me.\r\n\r\n\r\nIt didn't make sense to have all these back and forth texts going on, right? It's a waste of time, waste of both of our effort. I knew most of these guys owned houses. So I went on to the county assessor's website and looked up all their addresses. So I didn't have to text them. Didn't have to deal with all that.\r\n\r\n\r\nAnd it's like, it's that sort of stuff that you're just like, man, this is what makes you unique. And this is what I love to hear and learn about other people. So why am I worried about the one person? That's like, that's weird. Like that's creepy. That's this. No, I don't like, I shouldn't like you anyway. So I want to find the people that, that kind of do the weird stuff like that with me.\r\n\r\n\r\nThat's awesome.  All right. Last question. What advice would you give yourself 10 years ago?  That's a good one. I've spent a lot of time thinking about this because for at least the last eight years I'd had in the back of my mind that I wanted to start a business  and I didn't have really the courage to do it.\r\n\r\n\r\nAnd I would tell myself to just keep exploring those  curiosities and be willing to take measured risks because I think so often we look. And we think if we make one mistake here or there, it's the end of the world. But what I've seen from all of these entrepreneurs, what I'm learning is  everyone's failing over and over again.\r\n\r\n\r\nEveryone's failing, but it's the people that continue to get, uh, shots on goal that continue to keep trying and doing things that you have these breakout successes. So I think for me back then, I was so worried about failure and it would be just go iterate, go try things, go do things. I love it. Curtis.\r\n\r\n\r\nThis was awesome. Thank you so much for joining me. Where can people find you?  Yeah. Go to just look up Curtis. It's Curtis with a K Hanny on social media  or my newsletter frameworks for finance. So I appreciate you have finance frameworks  and finance. I said, and I said for frameworks and finance, we'll put that in the show notes.\r\n\r\n\r\nThis was a, this was awesome.  Let's talk again soon. A lot of fun. Thanks for inviting me. Yeah.  All right. That's it. Another one for the books. I'm fired up. I don't know what else to say. I hope you found something valuable in that conversation. I hope you learned something. I hope there's something that you can apply to your business today, tomorrow, in the future that.\r\n\r\n\r\nIt makes you money. It makes you more successful. It gives you more time with your kids. If there was something I'd love to hear about it in the comments below, give me some feedback. And if you like actionable advice and you want more of this, I write a weekly newsletter that gives insights, tips, and tricks into the world of entrepreneurship.\r\n\r\n\r\nSubscribe in my bio.  And if I can help you in any way in your entrepreneurial journey, don't hesitate to reach out to me. Nick at co founders. com. Sorry, Kelly, for, uh, for more emails. And the last thing is remember  curiosity is a superpower and you can use it to your advantage. As my mom used to say, there's no such thing as a dumb question. \r\n\r\n\r\nOnly dumb people.  We'll see you next time.",
  "metadata": {
    "duration": "",
    "date": "2024-07-15",
    "platform_source": "Google Drive"
  }
}