{
  "episode_number": "228",
  "episode_title": "How 2 Guys Turned Baby Wipes Into a Million-Dollar Empire with Samuel Marcus Ne‚Äôbel",
  "guest_name": "Samuel Marcus Ne‚Äôbel",
  "business_name": "Good Wipes",
  "transcript": "﻿Nikolas Hulewsky (00:01.53)\r\nAll right, I am here with the founder of Good Wipes, Sam Nebel. The thing that is blowing my mind right now is their product, Good Wipes. They've sold a crap ton of them. I'm really excited because we're gonna be having a lot of puns today. They are a personal hygiene product. I think you can guess what it is. I'm gonna let Sam explain what it is, but they're currently in 2.2 million households. They were founded in 2013 and last year in the last 12 months alone, they've added 430,000 households just from their Walmart.\r\n\r\n\r\nchannel. That's Omaha, Nebraska coming on board to the flushable wipes revolution. And it's mind blowing, Sam, did you ever think that you would be helping as many people clean down there as you have?\r\n\r\n\r\nSam Nebel (00:44.911)\r\nNick, I actually have thought that we would be helping this many people clean down there. I don't think I ever thought of the order of magnitude of thinking that within 52 weeks, we'd have 430,000 households the size of Omaha, Nebraska coming on to join our brand. But I vote, we've always had this desire to make like the world better.\r\n\r\n\r\nNikolas Hulewsky (01:06.83)\r\nDid you say wipe the world better? That's the phrase.\r\n\r\n\r\nSam Nebel (01:09.101)\r\nI, that's the phrase. I literally just came up with it.\r\n\r\n\r\nNikolas Hulewsky (01:11.886)\r\nOh my gosh, dude, that is, we're gonna wipe the world better. freaking love this. You started in 2013, your founding story is pretty freaking amazing. Like you've grown like crazy, obviously you've raised some money. You're the fastest growing brand in the flushable wipes category, which is growing like crazy. Right now it's like a $5 billion a year industry. Within 10 years, it's gonna be an $8 billion a year industry. But take me back to the founding. How did this even come about?\r\n\r\n\r\nSam Nebel (01:16.571)\r\nWe're gonna wipe the world better. Yeah.\r\n\r\n\r\nNikolas Hulewsky (01:41.474)\r\nWhat was the impetus behind it?\r\n\r\n\r\nSam Nebel (01:43.289)\r\nYeah, so the before we had all the numbers and the data and the sexy glam behind it, it was a very unsexy category. I met my co-founder, Charlie, in the upstairs bathroom of a fraternity house at Florida State University. We were freshmen in college. We wanted, we met and we said, we both use use baby wipes. All these guys are using the savage, you know, thin sandpaper see-through toilet paper.\r\n\r\n\r\nAnd we said, let's embark on this journey to start bringing new people into using this amazing hygiene routine. And people initially thought that we were crazy.\r\n\r\n\r\nNikolas Hulewsky (02:17.9)\r\nWas it?\r\n\r\n\r\nWas it like the scene in Step Brothers where you're like, wait, wait, you have, you have baby wipes? Did we just become best friends?\r\n\r\n\r\nSam Nebel (02:24.827)\r\nExactly, exactly. Yes, yes, it was exactly like that. And we were, it was like, like the Spider-Man meme and we're in the bathroom. We're like, wait a second, we got to tell everyone. So we started telling everyone, everyone's, everyone thinks we're crazy. Within 30 days, guys, girls, word spread. People would start coming up to us because we would have baby wipes in Ziploc bags and we would carry them around with us in our backpacks. And we were the baby wipe guys among, you know, being\r\n\r\n\r\nbeing other entrepreneurial endeavors and journeys. Yeah. So it was pretty wild and.\r\n\r\n\r\nNikolas Hulewsky (02:58.446)\r\nDid you become a baby wipe pusher? Were you like selling packages of 100 baby wipes? You like go to Costco, you get the big old packages, you piecemeal them down.\r\n\r\n\r\nSam Nebel (03:06.542)\r\nEverything for free. Everything for free. Everything for free, man. Just, hey, we're here. It's a philanthropy. We knew we'd make our money in the back end when we started a brand around it.\r\n\r\n\r\nNikolas Hulewsky (03:17.198)\r\nHey, oh, you made your money on the backend. Did you know it was a joke? Like, not know it was a joke. Did you start it as a joke where you're like, hey, this is fun. Let's do this crazy thing. And like, at what point did you have the idea of maybe this could be a business?\r\n\r\n\r\nSam Nebel (03:32.763)\r\nYeah, it was a couple of years after college. So Charlie and I, my co-founder, we were, yeah, we started with a, with a franchising brand called Complete Nutrition, ironically based out of Omaha, Nebraska. So we had spent a period of time there and we were traveling around working for them as consultants while waiting to open up our franchise. this idea kept gnawing at us in the back of our head in 2012 and 2013 that we could come to market and address these issues that we saw.\r\n\r\n\r\nNikolas Hulewsky (03:36.211)\r\nreally?\r\n\r\n\r\nSam Nebel (04:00.803)\r\nwith ingredients with lack of flush ability from baby wipes being made out of plastic or long fibers, address the concerns that I had as someone with IBS, knowing that a lot of other, peers and Americans had it. Charlie with sensitive skin and really come up with something that we felt would, know, the masses and bring this cool factor and this modernization factor of saying, hey, it's permissible to use wipes and we can talk about it. And so.\r\n\r\n\r\nAfter we left, we left Complete Nutrition and said, we want to start this company. We had no idea what we were doing in 2013. We started it out of my parents' house in Orlando, Florida. And shortly thereafter, put one foot in front of the other, hustled, grinded to figure out how to bring this brand to where we are now, which is in over 14,000 stores like you and I were talking.\r\n\r\n\r\nNikolas Hulewsky (04:52.526)\r\nYou worked your butt off. You hustled and grinded. I don't know how many of them I'm going to get in, but I'm going to get in as many as I can. right. So, uh, yeah, yeah, yeah. That's going to be the title of this episode is like, Hey, this is a drinking game. Anytime you hear a play on words or a dad joke, a pun about butts, like just take a shot. Um, what did you, what did you do in that first year? So when you made the decision, you're like, all right, let's go mom and dad's house. We're going to launch out of Orlando. Let's not do.\r\n\r\n\r\nSam Nebel (05:00.763)\r\nI think we're at like six right now. We're in a good, we're in a good, a good pace.\r\n\r\n\r\nSam Nebel (05:13.797)\r\nThat's right.\r\n\r\n\r\nNikolas Hulewsky (05:21.656)\r\nthe new, I can't remember the nutrition, nutrition franchise anymore. what were sales year one?\r\n\r\n\r\nSam Nebel (05:25.722)\r\nYeah.\r\n\r\n\r\nmy God, sales year one, think they were the first six months were like $42,000 total. That's the thing that, you know, want entrepreneurs to understand. there, by the way, there are so many people that I know that started with more resources or were way smarter about how they approached market and had a more relevant go to market and product market fit strategy than we did. but our first year in business, I think we did a hundred, a hundred.\r\n\r\n\r\n50,000 in sales year two is like 172,000 followed by 270 followed by 870 then into 1 million and beyond. But it is, it can be a long grind and you really got to love what you're doing. And by the way, it doesn't have to be as slow and laborious and tedious as it was for us. But if you really care about something and you believe in something and you're not just doing it for, I see this opportunity that I'm going to exit in three years.\r\n\r\n\r\nNikolas Hulewsky (06:03.63)\r\nSam Nebel (06:23.811)\r\nknowing that it took us maybe five or six years to get to our first million was, or four or five years, is something that I just, think people should really keep in mind that you've got to be dedicated to the passion and the craft in order to be able to grow something.\r\n\r\n\r\nNikolas Hulewsky (06:38.71)\r\nWhat's interesting is like you were, there were a couple of things at play here. There were a couple of kind of big macro trends. Number one, you were riding the wave for this personal hygiene. I don't even know what to call it. People using baby wipes to wipe instead of toilet paper, which I won't divulge them, but somebody very close to me who lives with me 24 seven, it has been an avid user for years. Anyways.\r\n\r\n\r\nSam Nebel (06:49.627)\r\nThat's right.\r\n\r\n\r\nSam Nebel (06:53.433)\r\nYeah, that's right.\r\n\r\n\r\nNikolas Hulewsky (07:05.516)\r\nSo that's happening, right? That's good macro trend. You have this other macro trend where people are being shipped subscription boxes. You probably remember this because you're going to college around the same time. Do you remember when Dollar Shave Club launched? they did like an amazing launch, irreverent humor. If anybody can go check out like their original launch. that's what like, I don't even know what to call it, but like the subscription of, I can sign up and every month I get.\r\n\r\n\r\nSam Nebel (07:18.755)\r\nI do remember when Dollar Shave Club launched.\r\n\r\n\r\nNikolas Hulewsky (07:33.39)\r\nmy Dollar Shave Club kit and like, oh, now I have him's which is for men because I can whatever, fix my male pattern, baldness, etc. So you had like these two things, but they weren't they weren't major trends in 2012 2013. They were kind of like in the beginning phases of it. So you've like taken advantage of that over time. I promise I'm getting some more with this long winded question. How did you know that that was going to be a thing? Like, how did you know that those trends were going to come to fruition? Or did you not know and you just thought you know what?\r\n\r\n\r\nSam Nebel (07:56.25)\r\nI like it.\r\n\r\n\r\nNikolas Hulewsky (08:03.628)\r\nI like this business. I'm just gonna go all in on this business.\r\n\r\n\r\nSam Nebel (08:08.219)\r\nIt was, it was less about the model and more about knowing that, no, seeing the authentic residents of our peer, peer group, right in college, knowing that if we gave them a baby wipe, that they would take it and use it. And that there was that, you know, near immediate, that second trial set coming back to us and saying, Hey, I got to get more, but I don't want to go to the store and get it. Let me, let me get yours. was that repeat.\r\n\r\n\r\nsituation over and over again, that's what gave us the confidence. And so it was that intuition, that gut that we had that then as we materialize and professionalize the company, five years later, we started getting access to the data that gave us that rigor and that institutional knowledge that backed up our intuition to get to where we are today, right? Understanding the size of the category.\r\n\r\n\r\nNikolas Hulewsky (08:39.201)\r\nInteresting.\r\n\r\n\r\nNikolas Hulewsky (08:56.014)\r\nBut you launched the business on intuition though. You didn't see the numbers until a few years in.\r\n\r\n\r\nSam Nebel (09:00.857)\r\nYes, correct. Correct. yeah. Crazy. It's almost disturbing. Yeah. feel like we, Charlie and I do feel like we've always been at the forefront of trends. At least that's something that we used to say early when we started the brand to say, hey, we believe in our gut.\r\n\r\n\r\nNikolas Hulewsky (09:05.774)\r\nThat is so crazy to me.\r\n\r\n\r\nSam Nebel (09:20.891)\r\nYou know, of all the ups and downs and sideways and personals and this and that, one thing I was thinking about this recently that has always felt true to myself and I could speak for Charlie as well, is we've had unwavering confidence that this brand would work and develop into the vision that we have for it. We've always known that since day one. We didn't know the roadmap.\r\n\r\n\r\nNikolas Hulewsky (09:37.784)\r\nHmm.\r\n\r\n\r\nSam Nebel (09:40.954)\r\nWe didn't have the path there, but we were so convicted in every bone in our body. We never had to convince ourselves that this would work. It was all the details within that we didn't have the visibility to that we had to figure out along the way. And we're still figuring out things, but it was, we always just knew. And so I think we're fortunate to have had that conviction in the market and in what we're building.\r\n\r\n\r\nNikolas Hulewsky (10:01.312)\r\nYeah.\r\n\r\n\r\nWell, think people talk down on passion. They're like, passion doesn't matter. Pick the right business. Passion does matter, especially when you're launching something in a new category that is relatively, there's not a lot of adoption to it. And you've got to stick, you know, stick through things in the face of a lot of adversity. And you guys really, you'd been using the product for years. You liked the product and there's a, there's a big need for that. At least at the time there was a big need for change because you can't just flush baby wipes down the toilet.\r\n\r\n\r\nI will you can you're not supposed to just flush baby wipes down the toilet. I think that was one of the funny things in my research just finding is like, is there like a responsible flushing Federation was that is that the name of like\r\n\r\n\r\nSam Nebel (10:41.631)\r\nI was just going to say, actually as someone who's on the board of the Responsible Flushing Alliance, I can't even say that you can't, you cannot flush baby wipes. And we have so much data that backs us up knowing that when we do wastewater surveys, if you go into the sewage systems of any municipality across the country, Northern California, Southern California, Jacksonville, Maine, Bronx, anywhere, London.\r\n\r\n\r\nNikolas Hulewsky (10:46.294)\r\nYes!\r\n\r\n\r\nSam Nebel (11:05.519)\r\nthat when you go into those systems and you start parsing out the particles, those sewer systems, what you will find is that over 99 % each and every time are either paper towels, feminine hygiene products like pads and tampons, baby wipes and paper towels. And I never believe, I gotta say this, I never believed that people actually flush paper towels until I was at the doctor's office yesterday doing a little, you know, pee-pee sample.\r\n\r\n\r\nand I look in the toilet and lo and there's a paper towel and I took a picture of it. I'm like, I cannot believe people are doing this. Do not do this. Do not do it. You can't do it.\r\n\r\n\r\nNikolas Hulewsky (11:43.928)\r\nDid you post it to the Responsible Flushing Federation's Instagram where you're hey guys, we can't be doing this. Let's spread awareness. It's Paper Towel Awareness Month.\r\n\r\n\r\nSam Nebel (11:48.507)\r\nI haven't yet. need to figure out. I'm probably gonna just post on LinkedIn with no contacts. I think that's what I'm gonna do.\r\n\r\n\r\nNikolas Hulewsky (11:57.912)\r\nWho do you contact about getting like the national day of or the month of, you know what I mean? There's like cancer awareness month or there's like, you know, mother's day. Like, can we have like a flush, like responsible flushing awareness month? You know what I mean?\r\n\r\n\r\nSam Nebel (12:12.826)\r\nI'm so glad you asked. actually have flush smart month that started in July and what we've decided to do is expand it from July, August and September. So it encompasses back to school. Kids are going to school, people are pooping in toilets more in schools and we want to have that continued education.\r\n\r\n\r\nNikolas Hulewsky (12:25.568)\r\nIt is.\r\n\r\n\r\nNikolas Hulewsky (12:33.048)\r\nDude, is, did you found that organization, the Alliance?\r\n\r\n\r\nSam Nebel (12:37.528)\r\nI didn't, I didn't know it was, was founded. don't recall exactly founded. It's an offshoot. It's an unaffiliated nonprofit organization, 503 C. the CEO is Laura Weiss. She's the president. She used to work at Starbucks. She's based in Seattle. She's done an amazing job running it. and we, we, you know, we spend a lot of money on education every year and she's done a phenomenal job.\r\n\r\n\r\nNikolas Hulewsky (12:39.693)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (13:01.504)\r\nOne of the things I love about your business is I've always wanted to have a company or start a company that I could do irreverent marketing with. So I'll give two examples. One was Dollar Shave Club. You know, he's got the video where he's marketing it he's like, your grandfather only used one blade and he was handsome as hell. you know, throws it. One of my favorite ads of all time. I don't know if you've ever seen the Kmart ad where they were advertising free shipping. Bro, you gotta go look this up. yeah.\r\n\r\n\r\nSam Nebel (13:25.884)\r\nNo, haven't seen that. Wow.\r\n\r\n\r\nNikolas Hulewsky (13:30.85)\r\nthese people in the store and they're talking to each other, it's free shipping. And they go like this, I can ship my pants. Yeah, you can ship your pants. I can ship my pants right here. Really? Hey, Mark, it's free shipping. I just shipped my drawers. I just shipped my bed. And so you're like, you're like, wait a second, did he just say what I think, what do you, I don't even, it's one of my favorite ads of all time because it's funny. a, like, you know, it plays on it. I think your brand is ripe for that. Did you know upfront?\r\n\r\n\r\nOr did you just make a decision at some point you're like, I gotta lean into this.\r\n\r\n\r\nSam Nebel (14:04.64)\r\nI think again, that was that intuition. we were really, by the way, that Kmart commercial I haven't seen, I need to see it. That sounds amazing. Way to go Kmart. Wish you guys were still around in the U S because that, should be heralded for generations to come. We were very lucky. know, Charlie and I, like sales, we like marketing, we like being in front of people, but we knew we needed help. And so I think it was a year and a half or two years into the business, we were able to bring on our creative director, Maria Gilbo, Maria G the hustle B she's been with us for.\r\n\r\n\r\nNikolas Hulewsky (14:10.829)\r\nyou gotta see it, man. So good.\r\n\r\n\r\nHahaha\r\n\r\n\r\nSam Nebel (14:33.147)\r\nnine years now, almost 10, actually I think 10, yeah, nine and a half years. She's been amazing. so Maria G, the hustle B, so like buzzing around. She did so much for us. She does all of our packaging. She now has a design team at the company that really sets our brand apart. And we lean into that high aesthetic, high design, married with the irreverent, elegant copy.\r\n\r\n\r\nNikolas Hulewsky (14:37.166)\r\nMaria be the hustle G\r\n\r\n\r\nNikolas Hulewsky (14:44.706)\r\nlove it, dude, I love it.\r\n\r\n\r\nSam Nebel (14:58.852)\r\nand creates a really unique formula that no one in the category is doing is actually, think, really unique to consumer branding in general.\r\n\r\n\r\nNikolas Hulewsky (15:05.838)\r\nWell, mean, workout for Dollar Shave Club, they got acquired by Unilever, I think for like a billion dollars, I think like 10 years ago at this point, or something ridiculous. So are you going after that Unilever money or what, dude? that the goal? Blink twice if it's yes.\r\n\r\n\r\nSam Nebel (15:10.586)\r\nThat's right! Yeah!\r\n\r\n\r\nThat's right.\r\n\r\n\r\nSam Nebel (15:18.99)\r\nYou know, we're focused on building, we're focused on building the biggest and best brand that we can for consumers. That's what we care about. And we work with retailers to make sure that we achieve that. That's all that matters to us.\r\n\r\n\r\nNikolas Hulewsky (15:23.786)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (15:33.218)\r\nIn the beginning, what was your North Star metric? Because it would seem to me, you know, if you have a brand like that, you kind of would just just focus on marketing. Like, we could blow this up if we go to Facebook ads, or if we go to when a Google whatever pay per click, we'll just blow this thing up and the business will work. Was that your North Star when you started out? Or what? What was kind of the okay.\r\n\r\n\r\nSam Nebel (15:45.681)\r\nYep.\r\n\r\n\r\nSam Nebel (15:52.677)\r\nNo, no, no, no. Art, so, and this is something I want. think I'm hoping that the audience takes away something that's important is while in hindsight, I wish we had this professional KPI that we have now, which is households, penetration. For us.\r\n\r\n\r\nthen it started out, it started a survival. would say phase one, phase two, phase three of the companies, we need to survive. Yes, we have revenue goals. Yes, we want to grow by 50 to hundred percent year over year, every single year from a revenue basis, but it's about survival and building a story that just gets us to that next level to get us to win. so eventually we became focused on philosophy. So dollars per ACV per door or units per store per week to start in the retailers that we were in.\r\n\r\n\r\nNikolas Hulewsky (16:36.174)\r\nWhat's ACV? Sorry.\r\n\r\n\r\nSam Nebel (16:38.044)\r\nACV is all commodity volume. So it's a weighted measurement across, let's say you say Walmart, what's your Walmart ACV? Well, if you're in 2000 stores, not every store is the same. Maybe a store in Miami, Florida might do a hundred times the volume of Spokane, Washington, just because of the laws of power dynamics of the population, right? So that's what ACV does, is it equivalizes everything for you.\r\n\r\n\r\nAnd so it wants to look at how much product are you actually moving out of the store, which is what retailers care about for a brand. that was our, would say you have survival, then you have what's your velocity focus. And now we're focused on, let's go get households. We know we're a great brand. Let's go get more households and get deeper within those households.\r\n\r\n\r\nNikolas Hulewsky (17:26.264)\r\nWas that, so that was the strategy first is like, hey, let's go sell into these retailers and then we can go direct to consumer.\r\n\r\n\r\nSam Nebel (17:33.072)\r\nYeah, that's so a lot of people ask us, especially bringing up the Dollar Shave Club analogy. Why don't you guys go subscription? The truth is I'd love to be a soothsayer and say, Hey, you know what? We knew that subscription businesses would have trouble sticking around or that Amazon would come and eat that share. Yeah. We, I think we kind of felt like that. We, just, recognize that, you know, if you look at a company like Dollar Shave Club, they still raised a hundred something, $72 million.\r\n\r\n\r\nto achieve their goals, right? It's not like you just, it's not just like a profitable faucet that spits cash flow. I'm aware that they, you know, had immediate payback on their first order. I remember hearing that stat, but still they raised a lot of money to do what they did. So we said, hey, what's a way that we can grow Bootstrap as efficient as possible with a little bit of angel money? And we felt like retailers was the best avenue. And we would do a couple retailers.\r\n\r\n\r\nProve out, couple more, prove out, couple more, prove out. It was very methodical. We were comfortable being a little bit slower back in that day, building a foundation. And also quite frankly, Charlie and I's skill set was we understood and we learned how to develop relationships with retailers and how to work that system and ecosystem and kind of start learning how that works and knowing that that would be where the bulk of the business was anyway. So spending more of our time there while figuring out Amazon and then saying, hey, DTC is not going to be as important for our business.\r\n\r\n\r\nAnd so that's something that we're having conversations about now. You always want it to be there. But we're reviewing it. We're actually, have a really unique experience that we're going to be launching sometime in the next six months that you guys will see in the DTC ecosystem. That's going to be different than anything else that is out there right now.\r\n\r\n\r\nNikolas Hulewsky (19:12.206)\r\nSo in the first couple of years, if I remember correctly, you were like year one, 150, year two, 170, year three, 270, year four, 770, somewhere in those numbers. And then you hit above a million dollars. What was your main customer acquisition channel in those first few years? Because it sounds like you weren't doing the, hey, what was our ROAS? How much money did we spend on ads? It sounds like you're going the distribution model.\r\n\r\n\r\nSam Nebel (19:14.556)\r\nYeah.\r\n\r\n\r\nSam Nebel (19:23.258)\r\nYep, yep.\r\n\r\n\r\nSam Nebel (19:33.318)\r\nFor sure, for sure. So what we began with was this idea that we were gonna start going to these trades, like America's gift mart in Atlanta and just say, we need to sell in retail now. And because we didn't have a lot of money, I think we exceeded it with like $12,000 and we were like, let's just buy product and sell it. Buy product, sell it.\r\n\r\n\r\nSo we'd buy products, sell it at these trade shows. You know, then after 18 months and going to 20 or so of these trade shows across the country, we realized this product should be moving a little bit faster. you know, retail at pharmacy in so-and-so Colorado says that it's doing well, but they've only ordered $500 from us and ordered three times this year. We need to get more product moving. And so we partnered with this, with a startup accelerator in 2016 called the Brandery out of Cincinnati.\r\n\r\n\r\nAnd that's where we really learned this institutional knowledge. We got set up with Kroger to have meetings with them, to learn with brokers how to work within the systems of presenting what a retailer wants to hear and actually providing us with strategy that we would take with us for the next few years to build out businesses that win with retail. We had mentors that worked at Procter & Gamble, worked on the world's biggest brands, global brand manager of Pampers.\r\n\r\n\r\na number of other folks in that Cincinnati ecosystem, which is truly still the best CPG city probably in the world, you know, maybe tied with Bentonville, just based on the dual factor P and G plus, plus Kroger and a number of other ones, that have presence there and, and, and yeah, go ahead.\r\n\r\n\r\nNikolas Hulewsky (21:12.174)\r\nWas it just different back then? Because if I talk to anybody today, they're like, dude, your customer acquisition costs can be so low if you go to Meta. They do such a good job of targeting. And your ROAS can be four times, blah, blah. Back then, was it different? Is that why you decided, hey, instead of the D2C, let's go and try to sell under retail? Or?\r\n\r\n\r\nSam Nebel (21:30.746)\r\nYeah, don't exactly. think, I think we were right at the early cusp when people weren't even talking about ROAS. People weren't on meta. There was not a big e-commerce world. was, it was the first few were starting out, the Birch boxes, the few of those ipsy, the sample boxes and Dollar Shave Club. And that was about it. think Harry's started a few years later, maybe 2016 or 17.\r\n\r\n\r\nwhich is like three or four years after Dollar Shave Club. There really wasn't like a big ecosystem. They all, and again, no one should forget all those brands raised millions and millions and millions of dollars to the tune of not five, not 10. You're talking 50 to a hundred million dollars for some of those brands that, that launch their, their customer acquisition. So whenever someone says, you know, it easy, it was easy yet like, yes.\r\n\r\n\r\nNikolas Hulewsky (22:10.702)\r\nCheers.\r\n\r\n\r\nSam Nebel (22:17.828)\r\nMaybe the ROAS were higher, there was less competition, but people were still utilizing additional incremental resources to achieve their goals, right? And I'm not demonizing that at all. just want people to think about that, yeah.\r\n\r\n\r\nNikolas Hulewsky (22:26.964)\r\nWell\r\n\r\n\r\nSam Nebel (22:42.044)\r\nCrazy.\r\n\r\n\r\nSam Nebel (22:56.368)\r\nFor sure. For sure.\r\n\r\n\r\nSam Nebel (23:28.76)\r\nYeah, we did. did. had really good. Yeah. So we were, we were doing some stuff overseas at that time. We have global supply chain network. We were really, what we were doing was we would get these retail deals and then we would go sell them another. So we had some up and down. gained some distribution, lost some distribution. It was actually in the feminine hygiene category. We ended up getting in there first because you know, the honestly flushable wipes were not growing.\r\n\r\n\r\nas much at that time, where retailers were letting it in. say, okay. And then our first real big break was 2019 when we got into HEB. And or maybe it's 2018, we got into HEB, and then more retailers. So then we got into Rayleigh's in 2020 and Market Basket in 2021 and Hannaford in end of 2021. And we would add a retailer, couple regional retailers every year. Absolutely kill it.\r\n\r\n\r\nand start have a better story to tell. And then all of a sudden we were in target with chain-wide distribution. I think that was two years ago, but 2021 was our first year that we launched in target in the flush white space Walmart. launched three years ago.\r\n\r\n\r\nSam Nebel (24:58.172)\r\nI think, I think there are, so, you if you think of marketing, it's the four P's it's price, product placement and promotions. And we mastered those. We absolutely mastered those and said, Hey, we're a boot shop company. We have, we have finite resources. We need to win on the four P's or we're screwed. And I think those fundamentals are really important. So we did a really, really sound job of managing those four P's placement. It's picking the right category and coming with the right packaging approach.\r\n\r\n\r\nto ensure that whether we were on the top, middle or bottom shelf that we would stand out on the shelf. And we've achieved that. Like I showed you, no one else has a pink rosewater package, right? And that stands out to consumers. And we've even seen studies of some friends of ours on LinkedIn that show that in Target, our products are actually the most eye catching. So we've leaned into that heavily. That was a huge amount of the tailwind. I think I was sharing with you earlier, Stat, that in Walmart alone, we brought\r\n\r\n\r\n40 % of our customers that we brought to the category have never shopped the category before. So yeah, there's tailwinds, but we're actually bringing more new customers and households to the category than any other brand. So we are clearly doing something different and better than others. And I think part of that is due to, again, the Bootstrap influencer PR box strategy that we're doing. And again, the four P's and how we present ourselves on shelf.\r\n\r\n\r\nSam Nebel (26:27.58)\r\nYeah, I need to. Yeah. Yeah. Yeah. So so our PR strategy, every let's call it every one to two months when there's a big holiday or seasonality, we'll do a PR box really well designed. I don't happen to have one on me right now. And so let's say for example, this summer, we did a summer PR box. And it's the the good wipes juicy booty beach club. So there's a hat there. Yeah, there's a towel.\r\n\r\n\r\nUh, there's, there's product in there and we sent it to 300 to 500 influencers. So let's call it, we do six, maybe a year and, and they repost it and you get millions of organic impressions from that. And that is honestly has been our biggest lever. And then on top of that we do, we're now doing skits with influencers. We'll get samples into running clubs. We'll infiltrate the fitness space. Uh, we work with OnBrand for sampling. So sample all of those kind of fundamentals of, you know, get wiped to butt.\r\n\r\n\r\nit has rung true for us in terms of efficacy.\r\n\r\n\r\nSam Nebel (27:43.994)\r\nYeah, no, we, we wanted to go on shark tank. However, we, we actually didn't, didn't get selected. And it was funny. The story actually is they called me and I, I was picking up my dad at the airport and I was afraid I was going to have service because sometimes it's, it's going to get sketchy in that area. And the airport was a, was a mess. And I'm like, let me do it after this call. they're like, well, we don't have time. And then the next week they just left the voicemail like, Hey, you guys are out. So.\r\n\r\n\r\nUnfortunately, we never made it. Yeah. Yeah. We never made it to be able to get on there. So.\r\n\r\n\r\nSam Nebel (28:22.396)\r\nAt that time I was pissed. Are you kidding? We could have been on Shark Tank and that would have been 2015 actually. 2014, 2015. So very early on. We wouldn't have been able to handle it to be honest with you. There's no way.\r\n\r\n\r\nwe wouldn't be able to handle that.\r\n\r\n\r\nSam Nebel (28:45.628)\r\nYeah, I think it would have sent us into chaos and I don't think our brand was as good as it is now. And it's really good right now.\r\n\r\n\r\nSam Nebel (28:56.984)\r\nOur team, my God, must have been, it was just Charlie, Marie and myself. think we, yeah, it was just three, three people, which is insane.\r\n\r\n\r\nSam Nebel (29:30.236)\r\nI can't say, but yeah, we have ambitions. I can tell you our ambition is to become a billion dollar brand and a category leader. We have full conviction that our brand will be able to do that.\r\n\r\n\r\nSam Nebel (30:04.902)\r\nthink it was continuing to see the traction in the marketplace and whenever we'd enter a new retailer and quickly getting sales and continuing to grow, for example, a few in the Northeast where we are the number one retailer, or actually the number one brand with the number one item and have more market share than the rest of our competitors, including legacy, including private label. And so when we see those wins start to stack up, it gives you that confidence to say, wait a second, we are coming in unannounced.\r\n\r\n\r\nNot a big marketing budget. mean, no marketing budget compared to these other guys. we're just bringing, not even, I don't want to say taking share, we're taking share from toy paper. We're bringing new users to this category merely by existing and doing very small retail, partnering with the retailers. I think that has differentiated us instead of, you lot of people think Target Walmart or Costco or Amazon, they only think in terms of one to four retailers for a brand.\r\n\r\n\r\nFor us, it's simply not true. We think of the entire retail ecosystem. We serve underserved retailers that have maybe 100 to 300 doors. A lot of people kind of write those off. We build really big outside businesses there. And we're not afraid to do so. We're not afraid to lean in. We're not afraid to dedicate resources. And that's been a strategy that most people don't deploy.\r\n\r\n\r\nSam Nebel (31:25.796)\r\nYeah, I mean, it means, it means, you know, if, the rest of the category, let's say our competitors are exclusively focused on target at Walmart, we go to other retailers and we, say, Hey, we give them data that other people aren't giving them. We're giving them access and insights and saying, we're going to, we're going to give you more promotional dollars. We're going to, we're going to dedicate more energy and time. Here's shippers, here's off shelves. We're dedicating resources and energy to building your business. Cause we know the category is going to win here.\r\n\r\n\r\nAnd when we do that, we win. then they, it creates this flywheel of success where then they say, good wipes. Thank you so much. You're going above and beyond everyone else. want more from you.\r\n\r\n\r\nSam Nebel (32:12.974)\r\nYes, that's the holy grail for retailer. Exactly. Like will this brand care about my store? Are they just using me for shelf space? We don't do that. We don't use people for shelf space. We come in and create additional value unlocks.\r\n\r\n\r\nSam Nebel (32:37.456)\r\nYeah, private label, yep, yep.\r\n\r\n\r\nSam Nebel (32:47.238)\r\nDid, yeah, I honestly don't remember. I think it started out around then. Yes. probably in Walmart, who is, obviously they're, they're good at everything they do, especially supply chain logistics. They have that, that buying power. They did, but it was also very small. Again, the category has doubled in the past 10 years.\r\n\r\n\r\nSam Nebel (33:13.884)\r\nNo, a lot of the private label has already been there by the time that we got into the category and some of these retailers, it's never bothered us. In fact, private label continues to lose share and we're one of two brands gaining significant share. So people are trading up, people are leaving, they want the best. If they're investing in this, they want a full holistic wellness experience, not just baseline bottom of the barrel sanitization, which is what private label typically.\r\n\r\n\r\ntypically provides.\r\n\r\n\r\nSam Nebel (34:02.266)\r\nYeah.\r\n\r\n\r\nSam Nebel (34:05.744)\r\nYep. Yeah, yeah, we use, we use, use, use, yeah, we use independent studies to validate our claims. I mean, it's, it's simple, right? You use third party testing labs to validate claims that you may want to make. We're stronger than toilet paper. We're, softer than others in the category. We, we, we just have.\r\n\r\n\r\nWe've tested everything that we want to say and we can back it up with substantiation. Not to mention we get clues and insights from our consumers, right? Because at the end of the day, you could say whatever you want as long as it's true. But if consumers don't buy into it, you can't really, you know, what are you going to do about it?\r\n\r\n\r\nSam Nebel (34:48.472)\r\nNo, no, no, no, no. We created it. We created it. We said we need these. Yeah. How do we create it? So we, what we did was we would look at every single wipe on the market, try it out, say what we did and didn't like. And when we would try it, we would tell our manufacturer that we were working with what was wrong with it. And we would come back and...\r\n\r\n\r\ntell them the ingredients that we wanted because of the ingredient profile. And we came up with something that we finally felt good about.\r\n\r\n\r\nSam Nebel (35:24.348)\r\nWe just did virtual visits. Yeah, virtual stuff.\r\n\r\n\r\nSam Nebel (35:39.388)\r\nyeah, mean, yeah, there's a whole ecosystem that we're, and again, we're talking about what was 12 years ago versus what is now, you we're very involved at the manufacturing supply chain level. We're very hands-on. We're co-creating, we're leading creation. We get exactly what we need out of the product for consumers usage.\r\n\r\n\r\nSam Nebel (36:38.748)\r\nYeah, for us, success looks like continuing to win with velocities in stores, number one. And two, it's really byproduct of household penetration, right? So if we're at two and a half, some change, million households, and there's a hundred million households in the United States, we need to get to three million. We need to get to four million. We need to get to five million, six million and hold that repeat, right? So repeat's important to us too. We have the highest repeat percentage rate in the category.\r\n\r\n\r\nhousehold acquisition and bringing those new customers is super, that's our North Star.\r\n\r\n\r\nSam Nebel (37:33.434)\r\nYeah, I think you need to mix your\r\n\r\n\r\nyour passion with levelheadedness, right? You need to find out when you, you dial that optimism versus bringing in some reality into the mix. And it's all about knob turning, right? You have to figure out knob turning of when you're going to go in founder mode and when you're going to go into, Hey, it's really important to have other people that are better than me on a team doing this. that's super important. And then the last one is focus. You cannot be chasing all these things. Whether you're zero, whether you're a hundred million, you have got to be focused.\r\n\r\n\r\nin business in order to win. Otherwise, they're going to be spread way too far.\r\n\r\n\r\nSam Nebel (38:12.796)\r\nOoh, yeah, yeah, yeah, yeah. No, there's been a lot of things. There was a number of years where we said, even though we were having really good success in all of these retailers I told you about, where we told retailers, hey, we're not going to pursue you. Hey, we're not going to take this deal. We said no to a lot of retailers and said, let's, yeah, let's talk next year. Yep. Without, Yeah.\r\n\r\n\r\nYeah.\r\n\r\n\r\nYou just say, Hey, look, we think we could serve your, you better once we continue growing the brand and then free up supply chain and dedicate resources to you. It's all about, it's all about building a focused growth story. Yep. What's that?\r\n\r\n\r\nSam Nebel (39:00.736)\r\nI mean, it could definitely work that way, but yeah, it was, that wasn't, that wasn't the fundamental drivers. Hey, like, let's make sure if we're going to go somewhere, we want to win. We're not going anywhere to lose. So we're not showing up at second pass. We're not half assing it. Yeah. yeah. Very, very serious about that. I think that's important for people to think about with expansion.\r\n\r\n\r\nSam Nebel (39:36.826)\r\nYep. Yeah, it happens.\r\n\r\n\r\nSam Nebel (39:55.268)\r\nwe didn't do it with Rayleigh's, but there were customers like Rayleigh's, we really needed and shout out to Jeff. gave us, he gave us an opportunity and I think we're the number one brand there. now we, there were a few, I don't remember all the names, but it was like a period of a year where we said, Hey, we're not going to go. It also depends on when their timeline is. Right. So if they're like, Hey, we're, we need you in two months. We'd say like, we're not going to do that. Right. Like we're to screw everything up. It's going to waste resources, cause distraction. We're not going to do that. Let's talk and plan together for next year.\r\n\r\n\r\nIt doesn't matter how big it is, to turn it around and rededicate resources just wouldn't make sense.\r\n\r\n\r\nYeah.\r\n\r\n\r\nSam Nebel (40:37.924)\r\nYou got, you have to have the confidence to turn it down and you have to have the confidence to turn something down and, and also make the call. Like if you should take it and take it, right. It's time. So if you know that you can go and get something later and say, Hey, let's keep in touch. Let us continue to add value even if we're not there. Give you share insights with you and then come back and say, let's let's build. And it works.\r\n\r\n\r\nSam Nebel (41:08.464)\r\nI think it.\r\n\r\n\r\nSam Nebel (41:12.217)\r\nlet's, can we not, let's, can we not do the, yeah, yeah, yeah. Sorry, I forgot. Yep.\r\n\r\n\r\nAwesome, thank you.\r\n\r\n\r\nSam Nebel (41:31.878)\r\nMm-hmm. Yep.\r\n\r\n\r\nSam Nebel (41:41.169)\r\nYeah.\r\n\r\n\r\nSam Nebel (41:57.468)\r\nExactly. And that's part of what we, what I was saying earlier is, is you got to pace your growth, right? You cannot just say yes to everything. Right? So it's a pacing it's, I want to grow by 50 to a hundred percent or what if we hit 50 % year over year, we're fine. We're leaving more growth for the next year, a hundred plus percent. don't need to do 300%, 200 % then\r\n\r\n\r\nwaffle down and you know, there's so much risk in growing too fast. So we looked at a few different levers. One is working with, you know, financing with payables, working with your vendors to get better terms, 50 to 45 to 65, 75 days. Um, there are a lot of debt instruments that you could utilize as well. I mean, we started the company with probably a hundred thousand, $200,000 worth of credit card debt that we were personally liable for at the job.\r\n\r\n\r\nyeah, yeah, yeah. mean, like, look, if you believe you gotta go for it. So that's what we did.\r\n\r\n\r\nSam Nebel (42:56.892)\r\nYeah.\r\n\r\n\r\nSam Nebel (43:05.594)\r\nYes, it's not easy by the way. It's not as easy as I'm making it sound, but you have to be selective of what, it's all timing. When is your yes, when is your.\r\n\r\n\r\nSam Nebel (43:27.194)\r\nThat's the name of the game. It's just awareness. It's coming up with amazing creative marketing that attracts people. We're not pushing, we're attracting people to the category. Boots in the ground sampling at events. We have our Golden Porta Palace, which is our pop-up Porta Potty. Golden, we have two of them that we bring to festivals. Yes, I know, it's awesome. It's so awesome. And we'll have to do a follow-up episode on that. Yeah, I'm gonna tease and we'll...\r\n\r\n\r\nI'm booking myself into a fall off episode for the team. Yeah, we have a port of palace. It's three bathrooms. It's gold inside gold outside, all fully branded. It's air conditioned and it has music playing. It's an Oasis experience. It's unbelievable. Obviously good wipes are in there. We spray it down and clean it after every use and it's in VIPs and the best and the coolest festivals around the country. It's awesome. We've gotten probably. Yeah, we should. Yeah.\r\n\r\n\r\nMaybe, maybe I don't know. We like to be, we cater to all butts. So, he's a little polarizing perhaps, but yeah.\r\n\r\n\r\nSam Nebel (44:36.763)\r\nEpic.\r\n\r\n\r\nSam Nebel (44:43.46)\r\nYeah, if you want to find me, you can find me connect with me at LinkedIn. man, I always change my name Sam Marcus and evil. You'll find me there if you type in good wipes. And if you want to find good wipes more importantly, because the brand is way cooler than I am. If you want to find these luscious rosewater, shay cocoa, lavender, botanical bliss or cedar wipes, you can easily go to Amazon and just type in good wipes G O O D W I P E S or Kroger or Walmart or Target or grocery store near you.\r\n\r\n\r\nThank you so much, Nick. Appreciate it, man.\r\n\r\n\r\nSam Nebel (45:17.572)\r\nThat's right, economics. Let's go.",
  "metadata": {
    "duration": "",
    "date": "2025-09-08",
    "platform_source": "Google Drive"
  }
}