{
  "episode_number": "39",
  "episode_title": "How Productized Services Built an 8 Figure VC Studio with Michael Greenberg",
  "guest_name": "Michael Greenberg",
  "business_name": "Third Brain",
  "transcript": "﻿I'd say, you know, 80 percent of our clients are in the two to 20 million range. And then the other 20 percent are in that 50 to a hundred. \r\n\r\n\r\nThere's a new buzzword being thrown around lately, productized services. But what is that? Well, you've heard of products. Those are clearly defined physical or digital things. A business either produces or sources to sell for a specific price. Think of an iPhone, a Tesla, a book. You've also heard of services.\r\n\r\n\r\nThose are broadly defined offerings that are uniquely tailored to an individual's needs with variable pricing. Think of a personal trainer, legal services, or a consultant.  So is a productized service just an oxymoron?  No. And I recently got the best definition I've ever gotten. And it has me rethinking every services business I've ever seen. \r\n\r\n\r\nWelcome to another episode of economics. This is the show for entrepreneurs and watchpreneurs who are curious to learn how other businesses work. My name is Nicholas Lusky and I've owned and operated more than a dozen businesses generating more than 30 million a year and employing more than 300 people.\r\n\r\n\r\nI recently sat down with Michael Greenberg, who's the founder of a venture studio, creating new use cases for product services. And on this episode, you'll learn a clear three part test to qualify what a productized service is,  as well as how you can jump on the bandwagon and productize almost any service. \r\n\r\n\r\nBut mainly I'm obsessed with just one question.  What framework did Michael create to identify opportunities to productize services in places nobody else thought was possible  that has somehow created a bootstrapped eight figure venture studio? Let's find out together. Okay guys, we're going to get back to the show in just one second, but first a message from a sponsor who is a me.\r\n\r\n\r\nOh, it's me. Cause I'm doing the show for free. Listen, I want to give you a hundred dollars. All you have to do is this go to Apple or Spotify. Okay. Give me five stars, write a review, screenshot that review, send it to me, Nick at cofounders. com and you will be entered to win a hundred dollar Amazon gift card.\r\n\r\n\r\nEvery four episodes, I'm going to choose a winner at random and I'm going to do this five times, 500 for five stars. I just made that up. And so what I'm calling it, please go to Apple or Spotify, leave a review, screenshot it, send it to me, Nick at co founders. com and you'll be entered to win a hundred dollar Amazon gift card.\r\n\r\n\r\nAll right, let's get back to the show.  All right. Welcome to Nickonomics. Michael, super excited to have you. Let's hop into the meat and potatoes. Tell me what your business is and how you make money. Yeah. So  I'm one of those dumb guys who said, you know, I should have more than one business.  And obviously I am nowhere near ready to be doing that. \r\n\r\n\r\nSo about two and a half years ago, I started what I call a venture studio. And we really only make productized services  and we really only make a niche of productized services that is focused around variations on managed staffing. You said a couple of things in there. Yeah.  I want to break it down and define them.\r\n\r\n\r\nThese are all weird concepts.  You wrote a post recently that I thought was a beautiful breakdown of what a productized services. And I didn't know, honestly, I didn't know what it was. I'd heard it thrown around. I'd heard people talk about productized services, et cetera, many, many times. And I'd nod and I'd say, Oh yeah, of course.\r\n\r\n\r\nOh, yep. Productized service. Got to have a productized service.  Can you just like briefly explain  What is a productized  service? Cause those two sound like oxymorons, but they're not.  Yeah. So it's really a packaging thing.  And I think that's really where we all get lost with productized services is it's just packaging and pricing is what this is.\r\n\r\n\r\nIt's a specific strategy and it's where you package a service offering.  In such a way that it can be bought off the shelf as a product, sort of the hallmark of it is that you have a website where you can list a price and actually stand to that price because most services, most agencies, most contractors are done on some sort of hourly or variable rate.\r\n\r\n\r\nThere's really three core types of product ties services, and they have three different pricing models. You can have a staffing business, an outsource process, or some sort of knowledge, like a coaching advising business.  Those are the three types of productized services.  And then you can have a usage based service, so like in podcasting.\r\n\r\n\r\nPer episode would be usage based a subscription so you could pay monthly for getting everything handled on one show or value based where then you're either taking a percentage of the upside or you're charging some larger flat fee package based on perceived value. You said you were dumb. Let's be honest.\r\n\r\n\r\nI'm the real dumb guy in the room. Let me try and like reframe it in a way that has helped me understand it.  When you're selling things, you have two things, two large categories of things that you sell either a product.  Or a service, and you can have a product, which could be a commodity. It could be a widget.\r\n\r\n\r\nIt could be a car, like it could be anything that is potentially tangible. But then many times the non tangible things, the intangibles, we would call services where I come and I. Decorate your room, or I give you an analysis on engineering specs. I come do a survey on your land, et cetera.  Those are harder to do because they're intangible.\r\n\r\n\r\nThey change every single time I come out, I do an analysis, I do an assessment and I say, well, based on your room, based on the square footage, this is what I would charge in order to,  you know, analyze it, the services piece can feel subjective because you're coming in, you're making an analysis and assessment and making a recommendation of what you're going to provide, whereas the product.\r\n\r\n\r\nIt's like, Hey, this is the same every single time. This is what a Ford focus looks like. This is what oil is. This is, you know, how many M& Ms are in an M& M package, right? Like those are products that are standardized. They don't change much. Whereas the services do. So when you talk about a productized service.\r\n\r\n\r\nEssentially what you're doing is you're creating  a reasonable expectation of  outcome. And as a result, you're able to standardize the pricing for as well. Yeah. And I'd say I specifically specialize in versions of these things that are really  fractional managed staffing of different sorts. So you are either buying  piece of a person from us. \r\n\r\n\r\nWho is specifically skilled in what you need done,  or you are buying  a piece of a team from us with a specific skillset. And in both cases, I try to focus on a subscription.  So that way it's, Oh, we don't need a whole podcast editor. We need half or a quarter of one. We can buy it from this company and we will always have a top notch podcast editor that we can work with.\r\n\r\n\r\nSo give me an example of a specific product that you have. That you've turned into a productized service. I, in fact, just did. I have the first company I started was very similar to the last company I sold. The last company I sold was a white label podcast post production business.  And then the first of these new managed staffing product high services I started was a company called podcast three 60. \r\n\r\n\r\nThat is in fact podcast post production.  And so the way it is priced and the way it's set up,  you get  a portion of a podcast post production team. Okay. So typically I'd record a podcast and I would send it out to my team. I have an editor.  Who actually chops it up. Maybe it's a video editor doing one thing.\r\n\r\n\r\nMaybe it's an audio editor. Maybe it's both. And they may charge me different rates based on the amount of time that they spend on an episode. You would standardize it. You would just say like, Hey, for  X number of dollars per month or per episode,  this is what we'll charge. Okay. So it's per month. We say for five 40 a month, we're going to turn around an episode in two days.\r\n\r\n\r\nIf it's up to an hour in length and in 24 hours, we can give you a transcript cleaned and human written. We can give you an AI one immediately. And if you want special social clips, we're going to do a package of three of those, and 24 more hours. And so you can just slot things in a queue and we're going to work through that queue.\r\n\r\n\r\nAnd if you want to go half speed, you pay three 60 instead of five 40. We've got a cute name for it, Product High Services, but to me it just sounds like being clear with what your offering is. Like I said, it's really just packaging and pricing.  Why do you think it's become more popular? Or is this just a rebrand of something that's existed for a long time?\r\n\r\n\r\nAm I allowed to talk negative? Spicy take? Oh yeah, I got, I got a lot of spice. Only negative. That's how we grow. That's how we grow. You go negative. I'm just right. Thank you.  That's look, I don't go negative because I'm wrong. I go negative because I'm right. And nobody's able to say it because we all get talked down on for being negative about things, but people say dumb things all the time.\r\n\r\n\r\nAnd I'm going to start with one. So Brett from design joy.  Okay. Brett from DJ. I almost bought his business several years ago. I know many other guys in the product high service space. Every product high service OG has a story about looking at design joy to buy it from Brett. And every one of us has the same story about him being miserable, talking about it. \r\n\r\n\r\nI have never seen him happy. I know he makes a lot of money as a personal income. He's doing like a million a year as a freelancer or whatever.  But that's like. The man does not seem happy and I've never seen him happy  in the time that like, why I,  because he is a solo consultant who is paid to be essentially on call as a designer for nine to five for like 10 different companies at a time.\r\n\r\n\r\nOkay.  And he's not a business. He's not a service. He's just selling himself  now. Granted, he's now launched a business. With a productized services venture studio to sort of help spin some of this out. And you launched a course to talk about how to productize yourself.  You know, who's probably a better fit for telling you how to productize yourself.\r\n\r\n\r\nSomebody who actually grew a business. \r\n\r\n\r\nProductization is the best way to get yourself trapped at 150 to 200, 000 a year.  I know because I specialize in half my business model. Is, and I've got three of these businesses active right now. Two of them are on the model where I take a freelancer with a niche skill set. I give him the playbook.  He's going to get trapped at a hundred to 200, 000 a year in net profit.\r\n\r\n\r\nBut for him, that's a five X. If it's an offshore freelancer, that's a five, 10 X on their earnings. They're happy. I get to pull 30 to 50 percent off that. And I probably put 20 or 30 down to start the business. So it's a good deal for me.  Michael Greenberg, spitting fire  again. Dumb guy here. Oh yeah. I've tried it.\r\n\r\n\r\nLet me try to ask. So pretty caffeinated this morning.  Let's do this thing. You're caffeinated. I'm riddling up. Let's do this thing. So  is the reason. That he's hitting the ceiling  because he didn't figure out a way to scale himself. He didn't actually learn how to create productized services. Cause it seems to me that if you can create productized services,  you are creating clarity around what you're providing.\r\n\r\n\r\nAnd if you're creating clarity around what you're providing, you should be able to create clarity around. How you provide that on the backend. Right. And so then you have SOPs that you can roll out, you can bring a team on, you can say, all right,  for this specific task or function of my deliverable, I need to hire these types of people.\r\n\r\n\r\nAnd then you scale up that way. Are you saying that Brett would design joy? I don't know him  particularly well, but  are you saying he's couldn't figure it out? He couldn't figure out how to scale himself. Is that why he's miserable? Oh, no, I think. He's obviously a smart guy. Like he could have figured it out, but the, he chose to build the most profit as an individual consultant with no employees that he could reach. \r\n\r\n\r\nAnd so he has continued to raise his pricing and that works out well. And he had a controversy a little while back when he stretched himself too thin and things got bad for his clients, which happens with a lot of productized services too, especially that sort of solo expert Q based rental.  When I think of my buddies who have consulting businesses, who I would consider like they have a business versus they are freelance,  Okay.\r\n\r\n\r\nThey've got a pod of experts who work with them and what his clients are buying is him the expert designer, which is great. That's a okay.  I don't see an individual asset that you cannot sell because I don't think they're hiring design joy for design joy. They're hiring design joy for Brett from design joy going away from Brett  is productized services.\r\n\r\n\r\nThis is what happens when an agency business.  Decides they want to scale in digital agencies.  Yeah. Nine out of 10 times. Here's what I mean by that. We don't have to use the digital agency example. I'm a CPA and I want to start a CPA practice. Well, at first it's just me, I'm doing all the work. I'm doing all the fulfillment.\r\n\r\n\r\nI'm handling the customers, the clients, et cetera. And then eventually  I have to figure out a way to scale myself. So in order to do that, I've got a standardized Kind of what I'm providing. And this could be the same for fractional CFOs. This could be the same for digital agencies. Just  anybody who starts out as selling their skillset to other people, if they want to scale that, they've got to put systems in place.\r\n\r\n\r\nAnd those systems being put in place is effectively a productized service.  I would say  almost, I feel like I'm like getting it. I'm like, okay, cool. I got it. And every time I say it to you, you're like, yeah, yeah, yeah, yeah. Kind of,  dang it. I'm so  the key to the productized service is that at least in my mind,  it is when you say it, you'll get like the delivery side, right.\r\n\r\n\r\nOr you'll get the pricing side, right. But it's gotta be the combo.  So that most CPAs I know. They're charging hourly packages. They're still doing retainers. And it's when they switch to the packaged pricing model,  in addition to the systemized standardized delivery, God, that it becomes productized. Got it.\r\n\r\n\r\nCause you can scale an agency  that is still doing per job estimates, right? Like they're still tailoring it per job, but what you're saying is you have to the  pricing standardization. With the delivery standardization in order for it to be truly called a product I service. Because you need the margin standardization that you gain. \r\n\r\n\r\nYou can't market it like a product when you have variable margin. Professor Greenberg. Thank you for sticking with me here and walk me through as an idiot for first 15 minutes. This is going to be a great post.  I don't think I've ever explained it in this much depth. No, I love it. Okay. So now that I'm like caught up and you have a digital agency providing productized services, what is the product I service that you are currently offering that now we can like go back.\r\n\r\n\r\nI know you already said it, but now we can go back and I can understand what you're saying.  So I actually own three right now. Okay. I operate one,  and so the other two that I don't operate are both in podcasting, one's in podcast post-production, one's in podcast guest placement, so putting people on shows as a guest. \r\n\r\n\r\nThe one I operate is a digital operations. Consulting service. And so that means AI automation and like process design workflow optimization for really  mostly companies between two and a hundred million, like that 10 to a hundred employees, 10 to 200 employees range, small range. Sure. Yeah, but, uh, oh yeah, small range, it's two to 150 billion, but you know, it's just, I'm just kidding.\r\n\r\n\r\nI'd say 80 percent of our clients are in the two to 20 million range. And then the other 20 percent are in that 50 to a hundred. What kind of businesses are they similar businesses? Are they just any types of businesses in that range? Oh, I mean, we work with digital communities like Hampton, buy then build,  Acquisition Lab.\r\n\r\n\r\nWe work with traditional businesses like rolling shutter manufacturers and laboratory supply. Honestly, we're 40 percent construction and commercial services now. You know, Oh, we're building ground up. We're doing, you know, barn dominiums and metal sheds, or we're doing concrete finish. I was not expecting the variety that we have, but all businesses have the same problems.\r\n\r\n\r\nLet's say I'm a healthcare company. Cause I know healthcare. So I can speak intelligently to that and I provide services. I come to you and I say, Michael,  by the way, is it Mike or Michael? What do you prefer? There were three of us in kindergarten, so long as it's not Mikey, we're A OK. Perfect. I'm gonna stick with Michael.\r\n\r\n\r\nI come to you and I'm like, Hey Michael, my back office is a mess. From intake, to scheduling, to billing, to all these things.  Can you help me?  And you would say, Yeah, I can help you. And then you work with my company to what? Integrate some Zapier automations. You're a healthcare company. You can't use Zapier. \r\n\r\n\r\nI can't Zapier. Why not? It's not HIPAA compliant.  Oh, really? I didn't know that. I mean, I've never used Zapier in my company, so I'm, oh yeah. Do you say healthcare or finance? The first thing we're doing is we're doing a tool audit because there's regulatory compliance. Take healthcare and finance out of it.\r\n\r\n\r\nLet's say I'm just a regular company and window washing company. And I'm just trying to get like from referral to scheduling, to billing, to collections, all that stuff, you know, what are you doing? Oh yeah. So we're still starting with a tool audit. First, we're going to find out what do you actually use? \r\n\r\n\r\nHow's your company set up right now?  That's going to be. A week or two generally of sort of talking with people. And we know, Oh, if you're a window washing company, we know you've got field crews, we know you've got a back office. We know that you're bidding a job and you might send two bids to somebody, but you're probably not sending 10 bids.\r\n\r\n\r\nIf you're doing window washing,  we know that you're not on insurance. So we know there's different pieces of your business that may or may not be there.  And we've got a pretty good idea how you should be operating. We know everyone needs to check in every day. We know you're going to want photos of before and after when something's getting cleaned.\r\n\r\n\r\nThere's some basics there.  And we're going to make sure that all of that exists in some form. Inside the business  and it's not going to,  you're not going to have software in place. Right. That's part of the tool audit. What you're saying right here is like, you have a checklist. This is all  okay. And you're like, you got to make sure you're matching what, you know, needs to be there with what they currently have.\r\n\r\n\r\nYep. They're not providing you with the, Hey, this Michael, we know this needs to be here. Oh, they'll say that, but they don't, you know, how many of my clients come in and they say, Oh, we really need to improve our sales process, or we need to improve our project management. And they don't even get contracts signed from their clients.\r\n\r\n\r\nHalf the time.  That's such a good point. Cause like lots of times we focus on, Oh, I need to increase sales. And then you dig into it and you're like, Oh, actually your sales are fantastic. It's your lead conversion.  Like you should be converting at a 75 percent clip and you're converting at a 30 percent clip.\r\n\r\n\r\nSo it's like, you're getting all the leads that you should be. You're just not converting. So let's focus here when they think like, Oh, I just need more leads. Right? Like as you dig into it and you look at the process as you find out it's something else. So that's a really, really good point is people don't know what's broken, but they do know what that the outcome is not where they want it to be. \r\n\r\n\r\nAnd they overestimate the level of documentation and internal knowledge the company actually has.  I can't count the number of times we've put some, a flowchart in some front of somebody and been like, this is how your company operates right now. Did you know that?  Nope. I had no idea we did this before that. \r\n\r\n\r\nThat is one of my favorite exercises going into any new business that I've bought  or integrated is like, okay, cool. From referral to collection. That's how I usually think of it. Those are healthcare words. And so it's different and different energy. It could be from lead to collection, whatever you want to call it.\r\n\r\n\r\nCustomer journey. Yeah, let's map it out and it's fun. And then you start like writing things up, it becomes like circular and people start having these aha moments where they're like, why did we do that? They've never mapped it before. They've never actually sat down and taken a look at whether or not it makes sense.\r\n\r\n\r\nAnd you're doing that, you're doing that upon audit and then giving them this feedback, right? I mean, that's kind of the way that you're approaching it with your company. Look, every customer we work with, we know they all want an AI that does half the jobs for them.  In order to get to that, you need all your data unified  and you need all of it nicely formatted.\r\n\r\n\r\nAnd in order to get to that, you need to actually know what people do and you need to know what you need to measure and you need to know what data you need to collect and you need to know where it lives right now.  And in order to do that, we got to talk with a lot of people and draw some diagrams.  I love your business, man.\r\n\r\n\r\nThank you. This is the stuff that I love doing in businesses. Like I love going in and articulating the problem and then solving the problem, but I've never heard it described the way that you're describing it. And Hits me. It just hits me  like you've productized  the service. It's so cool to hear you talk about it. \r\n\r\n\r\nSee the way we've done it, I think is that this is the model of productized services that gets you to 10 million. We can dig in on this a little real quick. This is not something that anyone talking about productized services is really going to tell you unless their name's Hunter Hammonds, because Hunter put out a lot of BS at first, but he's putting out some pretty good content now you need a high Ticket product tie service in order to scale to 10 million plus.\r\n\r\n\r\nHonestly, if you even want to get like north of 5 million with a productized service, you need an average ticket for like annual customer spend to be in the 60, 000 plus range. You really need a five grand retainer as sort of your minimum. And you really want to be hitting like eight to 10 grand  as a baseline.\r\n\r\n\r\nCause you want a customer to spend a hundred thousand a year with you or more. Forget about calling it a productized service. If you want your business to scale past 10 million, you have to have. Standardized systems and processes. There's a reason why franchises do really well. Because you can come in, you can plug it in and they have everything laid out.\r\n\r\n\r\nThis is how we make the food. This is how we sell the product. This is how we market. This is how we do, you know, X, Y, and Z. They've gone and they standardized it. And so every, you know, you go to an In N Out burger or you go to a Chick fil A or you go to a McDonald's, they all feel the same because they've got their standardized process in place.\r\n\r\n\r\nRight. And so it's interesting. It's very meta, but like your business  is a standardized product business that helps people standardize.  Their products through digital automation. Standardization is the goal with the company, right? Cause the way we talk about it internally is there's the five C's of digital operations. \r\n\r\n\r\nThose really turn into 99 percent of the time you're looking for consistency, clarity, capacity, confidence, and cashflow.  Okay. Hold on. Same again, a little slower for the slow people.  So first we're going to document everything and that's going to allow us clarity.  That's consistency. Oh, consistency. Okay.\r\n\r\n\r\nWhat they need to do.  And then that consistency is going to allow us to bring clarity because now that everyone knows what they need to do, they know what they should be doing every day and most importantly, their managers and bosses know what they are doing because we can put dashboards in place.  So clarity generally comes from dashboards that then allows us now that we have everyone's work tracked and we have it measured, we're then able to build it.\r\n\r\n\r\nIn new capacity, because we can start automating things and solving for bottlenecks. So we've got consistency,  clarity,  capacity. Yep.  And then now that we're able to increase the individual capacity of a team member,  there is confidence in the team. Because they are all doing what they're supposed to be doing and they're seeing things run more smoothly and in the management that they're going to be able to grow and hit their numbers because things are now aligned more effectively. \r\n\r\n\r\nAnd the end result of that is more cashflow.  I didn't know I was going to be taking a course today,  but I'm freaking here for it, Michael. Oh, I'm working on a book about this right now. So I'm, you know, I'm getting all my, uh, okay.  Consistency clarity. I love the clarity piece. Cause like  Clarity is kindness, in my opinion, people need to know what they're not just what they're supposed to be doing, what the expectations are of their performance, where they stand currently relative to that expectation,  capacity, confidence, cash flows.\r\n\r\n\r\nSo really, the last C cash flows is the result of all of those things.  Yeah. I'd say, I mean, I think of them all as results, right? In order to gain consistency, we have to do these other things in order to gain clarity. We have to do these other things.  And so we work our way up the chain. I'm thinking it's a pyramid, right?\r\n\r\n\r\nLike base of the pyramid is consistency. So what you're saying is like, all right, we got to get consistency. Let's document these SOPs. Let's make sure that everybody's on the same page with.  You know, who does what, then there's clarity.  How do we measure it? What is success? Everybody's on the same page.\r\n\r\n\r\nThen there's that clarity and consistency create capacity, which allows you to do more with the same  and having that capacity gives you the confidence to go and grow the business. And that confidence then leads to more cashflow. So,  yeah, to me, it seems like a pyramid that starts with that base of consistency.\r\n\r\n\r\nI love it. I'm going to use a pyramid when I put it in a presentation for a keynote sometime. Just like, cite me, just, just cite me. Oh, yeah. I'm just kidding. At Nick.  Okay, guys, we're going to get back to the show in just one second, but first a message from a sponsor. Who is, uh, me? Oh, it's me. Cause I'm doing the show for free.\r\n\r\n\r\nListen, I want to give you a hundred dollars. All you have to do is this go to Apple or Spotify.  Give me five stars, write a review, screenshot that review, send it to me, Nick at cofounders. com and you will be entered to win a hundred dollar Amazon gift card. Every four episodes I'm going to choose a winner at random and I'm going to do this five times, 500 for five stars.\r\n\r\n\r\nI just made that up. That's what I'm calling it. Please go to Apple or Spotify, leave a review, screenshot it, send it to me, Nick at cofounders. com and you'll be entered to win a hundred dollar Amazon gift card. All right, let's get back to the show. All right. So you've come in  this beautiful, by the way,  not many people in their businesses are as clear about what they do as you are. \r\n\r\n\r\nAnd it's a beautiful thing to talk to somebody like you, because  as I'm digging into these questions, you're not just giving me platitudes or high level, like, Oh yeah, this is what, this is my philosophy on it. You're very tactical with like, Oh, that's a good question. Here's how we do it exactly in five steps.\r\n\r\n\r\nHere's exactly the way that we think about it in this process flow, which makes sense then that you have a productized service helping people create.  Consistency and organization within the organization. So it, anyways, it's beautiful. So you come in, you do this audit,  the results of the audit, then inform  how you're going to help them automate.\r\n\r\n\r\nDo you have like preferred tools that you use? Are you like picking and choosing based on the type of company? So I think this is one of the things that probably sets us apart from like, you know, we are a digital operations partner and I like to use that as our way to say we are not an automation company. \r\n\r\n\r\nAn automator is a team member at our company.  We do automation better than your automation company, because we understand the rest of the infrastructure and the architecture.  But automation is normally step three or four for us. It's not step one. I like to clarify that up front, because we work as a team with our clients. \r\n\r\n\r\nAnd they are going to get 1 lead team member that we call a draftsman  and that person is really going to embed with their team and they're going to own those workflow diagrams and lead the project management. And eventually they end up just being the equivalent of the guy, but for this sort of digital operations work inside of a company. \r\n\r\n\r\nBut they're supported. You're not an automation company, but automation is a function  that you can provide.  Yes. And in fact, we provide it for most of our customers, but I like to clarify that automation is a result of the work we do.  It is. A high, like I know as soon as we install automation, we're two to 300 percent ROI within nine months  back to the beginning.\r\n\r\n\r\nWhat does your business do? Cause I would have been like, Oh, it's a digital automation company, but.  It's not a digital automation company. We are a  digital operations partner. So just like how your company is going to have an outsourced it partner, or they might have a fractional CMO sort of package where everything in the marketing department runs through one agency. \r\n\r\n\r\nWe are staffing you with that primary point of contact. They're probably in your company halftime,  that draftsman, and then they have a whole pool and team of specialists that they're calling on to do specific integrations or automations.  And they have an architect who is a fractional C level like me or one of my partners, who then is going to be leading the strategy with the company.\r\n\r\n\r\nIt seems like once you built that infrastructure, once you're like, okay, this is the flow and this is what we do, it's kind of a set it and forget it. Is there a lot of tinkering that you're doing? There is. Okay. Why? So like, I'd say you're right in a larger company, it's going to be set it and forget it.\r\n\r\n\r\nIf a company is growing fast, though, that process is going to change every year or two. Once you're at 10 million a year, this is a cycle of a process where it's like, okay, in one year, we're going to do one turn on all of our departments, but next year there's new tools. There's new AI. There's new automations.\r\n\r\n\r\nAnd now our ERP did an upgrade to their API and all of the automations that we had synced with it broke. So we need to rebuild those. And so do me a favor. Explain what an ERP is,  an API,  because you, you like glossed over those really quickly. What is an ERP and what is an API? ERP is an enterprise resource planning system. \r\n\r\n\r\nIt is that big, ugly piece of software that your company buys when they hit like 10 million a year or 5 million a year. That is. Customized to solve for some niche of industry and like inventory, financial planning issues that no other software can solve.  And so you couple that with an API change, which is.\r\n\r\n\r\nThat's an application programming interface. And so APIs are the doorways between software on the internet.  So if your ERP system.  It's pulling data because an ERP system is just a system, right? Like all the other data lives in or can live in other, I shouldn't say all. It's pulling a lot of data from a lot of different places.\r\n\r\n\r\nIf you're doing,  you know, your accounting, your GL accounting in QuickBooks or Great Plains, if your payments are processed through  Stripe or bank of America, if you're ordering is through another software, right? Like it pulls it all to a central place.  And then from that central place, it gives you real time insights into your resources.\r\n\r\n\r\nCause I mean, that's why they call it enterprise resource planning is because it allows you to, to resource plan based on the information that you're That is put in there. And what you're saying is if, if the API changes, right, it's no longer able to pull in a certain way from one of those places, then the ability to gain insights from that data also changes. \r\n\r\n\r\nSo it causes potentially a process flow that you and your team need to come in, assess.  And,  you know, I don't know, rejigger on the fly. Is that right? Okay. Yeah. Just update. Thanks. Duck. So  all that stuff sounds highly specialized where you've got to come in and make assessments. How do you productize it?\r\n\r\n\r\nBecause it sounds like you've.  You're standardizing the pricing and you're standardizing the product offering. But all of those things don't feel standardized to me. How does it work? So it really comes down to, if you remember at the very beginning of the conversation, I said, most of what I do, you're either buying a part of a team or you're buying part of a person.\r\n\r\n\r\nAnd so with this business, you're getting a little bit of both.  We're putting one draftsman in. And that Draftsman is going to understand your business. They probably have a background working with similar businesses. They definitely have three to five years of operations consulting experience. Most of them have master's degrees  and they know your software already.\r\n\r\n\r\nSo you're placing a Draftsman.  I mean, the only analogous word I can use for it is like an account manager, but they're not really an account manager. It's more like you're hiring somebody internally. Yeah. They're a member of your team. They're the Draftsman. They're essentially responsible for. These internal processes and flows, is that right? \r\n\r\n\r\nAnd so essentially that draftsman is coming in and they are a fraction or on our larger clients, they are fully embedded  and  they are going to be an operations team member.  So then how do you charge?  Are you charging a markup on the draftsman's? We charge a flat fee. Okay. So we offer two primary flat free packages.\r\n\r\n\r\nAnd then when somebody gets into hiring two, three, four people from us, we transition to one membership fee. And then we're just charging a 10 percent to cover our costs kind of thing.  Okay. So if I hire, if I'm a company, I hired Draftsmen, I pay the Draftsmen a hundred thousand dollars a year. I pay you a percentage of that.\r\n\r\n\r\nOh, no, you pay us a hundred thousand a year.  And then we're going to pay that draftsman, let's call it, if you're paying us a hundred thousand a year, and that is our second most common package,  you're getting a full time equivalent team member. Got it. And so your draftsman is going to be across between two and three accounts,  and they are going to have another person, a specialist, who is. \r\n\r\n\r\nSkilled in your automation and integration stack.  So they're going to have a technical specialist that they work with. And you're probably never going to speak with that specialist.  You're only going to talk to.  Well, the draftsman will. Yeah. The draftsman.  Yeah. I know there's, there's three people. That's the benefit is you're going to meet with your architect every quarter or every month.\r\n\r\n\r\nAnd you and I are going to sit down and we're going to say, Oh, you know, CEO to CEO or architect to CEO. Where are the problems in your business? Where's the strategic focus for this next quarter for this next year? Okay. Let's plan out our projects.  Got it. And then the draftsman is the one that's executing locally, syncing with your team and really running it on the day to day.\r\n\r\n\r\nOkay. So you've got the architect, the draftsman, and then what was that third one? The specialist, the specialist, the automation specialist. This is all super technical stuff.  I can't hire a million draftsmen who also know how to code.  But I can hire specialists.  The Jasmine piece. I understand now it's, I'm paying a markup on the Jasmine.\r\n\r\n\r\nHow do I pay for the architect and the specialist? Those are included in the, it's an all in one. They're included.  So  again, I'm an idiot  now that I've asked all these questions. It sounds to me like. This is similar to a staffing agency. This is managed staffing, plain and simple. It is managed staffing with just clarity around what you're providing, right?\r\n\r\n\r\nIt's just, we're going to provide these people to you and you're going to get,  you know, if I was just a managed staffing agency, I could not give you a fraction of a C level and I couldn't split out in these ways where by packaging as the entire service, I know. That most companies are not going to have, I have one client  that has digital operations in house and hires us for just team augmentation.\r\n\r\n\r\nEvery other client, their teams, their operations team is focused on client delivery or some other piece of the business. And they just don't have these skills. They don't have the capacity to take on this work. So if I were to dumb it down for me, Is a fair way to think about this analogous to a fractional CFO, a fractional CEO, fractional COO. \r\n\r\n\r\nThis is a fractional  digital automation company.  I would say it is closer to like an outsourced it provider  in that we are taking on an entire department's worth of positions and we will scale with you ad infinitum.  Yeah. There's not a good word for it, right? Cause it's not just automation. It's the architecture.\r\n\r\n\r\nSure. It's the creation of the processes that is really  like in my mind, that's the biggest differentiator digital  operations is what we call it. And we say it's AI plus automation plus this operations work. Walk me through the model, broadly speaking, what do you charge? What are your margins? How does that look? \r\n\r\n\r\nSo our two most popular packages are 5k a month and eight and a half K a month. Okay. So they're priced to a 60, 000 a year. And a hundred thousand dollars a year. But how do you decide who gets those levels? Does the client decide? Most clients, we just say start with the 60. Okay. So it's not like, oh, you're a $50 million agency.\r\n\r\n\r\nYou need the a hundred thousand a year. If you're a $50 million a year agency and you've got 200 people  and you are trying to start in  multiple departments at once or something, then we'll recommend a bigger package.  But for most it's, Hey, let's get somebody in the door. Let's get a culture fit with your team and your draftsmen.\r\n\r\n\r\nLet's get some quick wins  and then we can land and expand.  So I like that. So the 60, 000 a year, they grow with you. What do you, margins? Can you talk margins? Kind of what that net is for you? We, on that 60, 000, we're going to end up netting between 12 and 20. And that really just comes down to the mix of the team.\r\n\r\n\r\nAnd if the client needs a lot more specialist work, that takes up a little more of our margin. So 20 to 33%.  So it's not like for me, I look at that and help from healthcare and I'm like, Oh, that's a high margin business, but these aren't 80, 90 percent SAS level margins. This is, this is, you know, I'm not a offshore staffing company.\r\n\r\n\r\nSo even though we have team off store, we're not hitting a 70 percent margin. We need enough margin that like, Oh, we need to recruit and hire people and pay taxes and other things like that.  But this is a very sticky business. And the goal is to be competitive against them trying to go out and recruit and train and retain this very difficult to hire talent right now. \r\n\r\n\r\nAnd so that's, you know, I'm pricing to be a little cheaper than that. Yeah. But we're not trying to make billions. How do you acquire customers? What's your current  sales channel? Like it's a mix of referrals and partnerships. Okay. So  I'm partnered with a number of different like communities online where I come in and I speak as their AI guy or their automation guy or their digital operations guy, they, as a result, send us some leads.\r\n\r\n\r\nAnd then we're also a ClickUp implementation partner.  So they send us a few leads  and then we do great work and our clients send it. I don't really market this. I've been super quiet on Twitter lately because we've been so darn busy.  We just brought on a new senior partner that I'm super excited about.\r\n\r\n\r\nAnd.  Yeah, the business really came together as a result of us going slow and figuring out how to serve. Do you have any idea like what your CAC or LTV is for your customers or is it, has it not been long enough to know? My CAC is. Too low to count like, you know, it's nearly all organic. So we're talking probably under 20 a lead.\r\n\r\n\r\nAnd what is your churn like with these clients?  I think in the past year, we've been at like  10 or 15 percent churn.  Okay. That's great.  I'm looking at that and I'm like, man,  If I'm losing that many, I'm not happy. It's okay. It's okay to be unhappy. I'm just saying that, you know, many companies are like two to 3 percent a month in their turn compared to an agency, like compared to a standard service business, we are crushing it in turn,  but when I look at where I want us to be, I want us to be at 125 percent retention rate.\r\n\r\n\r\nHow big is your company? Can you give me like high level? Like what's it currently doing? Top line. How many customers do you have? So.  This year, I think we'll do right in the like 800 to 1. 2 million range total. Last year we did right around half that, maybe a little less actually. We're probably, I'd say 50 to 60 K a month right now, somewhere in there. \r\n\r\n\r\nBut you're growing. I mean you're growing 50, you know, a hundred percent a year. Yeah, we grow about 10% a month. We add one to clients every month right now.  That's awesome man. And so with that, if I'm adding two clients, I'm hiring a new person. Alright, well first of all,  it's been amazing conversation 'cause I've learned a ton.\r\n\r\n\r\nIt's like I went back to school today. I have some rapid fire questions to wrap this up here. Let's do it. Ready? Okay, cool. What do you love about this business?  This is the first business that I have started where I am both the expert in the work.  And I think it is actually a unique business on an upward industry trend.\r\n\r\n\r\nYou love it because you feel like it's. Maximizing your skillset and you're riding a wave. I think it's the right business with the right person at the right time. Awesome.  That's a good reason to love it.  What do you hate about this business?  Ooh, I mean, I hate any sort of client focused business, but I've  put my entire entrepreneurial thesis together on serving clients.\r\n\r\n\r\nSo like I can hate it as much as I want. People are people, you're going to work with them. If you want a business. Thank you for being honest. I get to this question a lot of times and people are like,  Oh, I don't think there's anything I hate about this business. Hate is a strong word. I'm like, okay, just. \r\n\r\n\r\nJust like humor me here. Every there's always aspects of things anyways, that people don't like if you're an entrepreneur and you've never gotten angry enough to fire somebody on the spot, you have not been in business for more than a year.  All right. What industry are you the most jealous of right now?\r\n\r\n\r\nCan I flip that? Can I say who I'm not jealous of at all? Let's do it. Yeah. Oh, if you're running like a niche vertical SAS company right now, especially if you're running an industry specific CRM. I am scared for you.  30 percent of my clients are building custom CRMs. The cost for a complex custom CRM is under 20, 000.\r\n\r\n\r\nNow you're looking at under five or 10, 000 a year for maintenance.  It's becoming cheaper to roll your own than it is to buy off the shelf.  That's interesting.  You know, who Chumath Paliapati is?  Yeah. He has a, a company that he just started. I think it's called 9010 might be called 8020. I can't remember.\r\n\r\n\r\nIt's one of those things, but it's essentially. A company like his whole thesis is now with artificial intelligence, the cost to create these enterprise level softwares,  you can get 90 percent of the functionality for 10 percent of the cost,  or it's like 80 percent of the functionality with 20 percent of the cost.\r\n\r\n\r\nI can't remember what the numbers are, but it's something to that level. So what you're describing is that in effect. That's, I am seeing it in the field. Wow. Okay. It's not filtered, you know, you can't replace your ERP yet. Do  we have customers that are replacing the customization they built on their ERP? \r\n\r\n\r\nYes.  And is it going to cost them a 10th of the cost to maintain? Yes. For people who don't know, CRM is a  customer relationship or contact relationship management software. I've heard customer contact and client. It's probably all of them depending on the industry. The five C's I'm just kidding. It's essentially the system and database that you use to track your leads and your customers and make sure you're following up with them in a timely manner.\r\n\r\n\r\nAnd that even the ones that you have, you're providing good customer service. It's integral for any business that has customers. Yeah. And Salesforce and HubSpot are the two you hear about a lot that are.  Pretty expensive to run on. Okay. What are you obsessed with right now? So to clarify that if you had two hours in your day, you have no work stuff, you have no family stuff, you can do whatever you want. \r\n\r\n\r\nWhat are you spending your time on?  So I am  working on a financial model right now  to build like a little  Airbnb eco resort.  About an hour and a half, two hours south of me. What's an eco resort?  It's,  I'm going to buy like a hundred, 110 acres, something like that. And then I'm going to put some Airbnbs on it.\r\n\r\n\r\nAnd we're going to do permaculture for like fruit and other things. So that way you can stay at an Airbnb or like you can stay at like a fancy tent, a glamping tent. And then in the beautiful Missouri mountains,  which Missouri does have beautiful mountains if you've ever been,  and then you can forge your own food on the property is the idea.\r\n\r\n\r\nThat's awesome. And so I'm right now, I'm going to drive out this weekend and we're going to go check out a mountain and then we're going to buy it. If it looks good. So I was just in Columbia a couple of weeks ago.  Oh yeah. And that is not an easy place to get to from Boise, at least,  but yeah, it's beautiful, beautiful hour, hour and a half.\r\n\r\n\r\nSouth of Columbia,  it's going to be, you know, you hit the Ozark Plateau and the St. Francis mountains.  Where are you? I'm in St. Louis.  Okay. So  you may or may not have flown into St. Louis and I did. I did. I flew into St. Louis.  I'm going out to main street in September. Are you going? Oh, it's the only, in fact, for the audience, the only place you can meet me in person without flying to St.\r\n\r\n\r\nLouis is Main Street Summit,  because that is the only thing I'm going to go to.  Perfect. Well, until I get invited to Capitol camp, then I'll be at both.  I love that obsession. That's a fantastic obsession.  Last question. What advice would you give yourself 10 years ago?  You are probably more right than you realize. \r\n\r\n\r\nAnd also  most people are dumber than you think \r\n\r\n\r\nit's good. Oh, and get a concierge doctor.  That last one is really important. That's okay. All right. Impossible to get in for a good JP.  Michael,  this has been freaking fantastic. I like, I need to have you back on. Cause there's other businesses that you have and I want to dive into those. Anytime. Where is the best place for people to find you?\r\n\r\n\r\nYou can find me on Twitter and that's going to have a link to my website too. But, uh, it's called X now. I think  it's at gent of tech G E N T O F T E C H.  I'm that everywhere on the internet. And what's your business called?  Third brain, third brain, three R D brain. co. Okay. This  is perfect. This was awesome.\r\n\r\n\r\nThank you. We need to do this again sometime. Much appreciate you, man. I'm looking forward to having you on my show. Let's do it. All right. That's it. Another one for the books. I'm fired up. I don't know what else to say. I hope you found something valuable in that conversation. I hope you learned something.\r\n\r\n\r\nI hope there's something that you can apply to your business today, tomorrow, in the future that. It makes you money. It makes you more successful. It gives you more time with your kids. If there was something I'd love to hear about it in the comments below, you know, give me some feedback. And if you like actionable advice and you want more of this, I write a weekly newsletter that gives insights, tips, and tricks into the world of entrepreneurship.\r\n\r\n\r\nSubscribe in my bio.  And if I can help you in any way in your entrepreneurial journey, don't hesitate to reach out to me. Nick at cofounders. com. Sorry, Kelly, for more emails. And the last thing is, remember,  curiosity is a superpower and you can use it to your advantage. As my mom used to say, there's no such thing as a dumb question. \r\n\r\n\r\nOnly dumb people.  We'll see you next time.",
  "metadata": {
    "duration": "",
    "date": "2024-08-02",
    "platform_source": "Google Drive"
  }
}