{
  "episode_number": "169",
  "episode_title": "AI SERIES: 13 - No Code, No Problem: Building a Startup with Lovable AI with Corey Pierson",
  "guest_name": "Corey Pierson",
  "business_name": "Pet Document",
  "transcript": "﻿Nikolas Hulewsky (00:00.638)\r\nAll right, Corey, I am stoked to talk to you today because I'm going to learn about AI. I want you to just briefly give me what's your business and what are you or just what are you using AI for right now?\r\n\r\n\r\nCorey (00:12.867)\r\nYep, so I am using AI to help build a SaaS application. So I am not a developer at all. I don't know how to code at all. But with the new AI tools out there, as long as you can prompt and connect dots and you're a little bit tech savvy, you can get pretty far.\r\n\r\n\r\nNikolas Hulewsky (00:39.474)\r\nSo what is your background?\r\n\r\n\r\nCorey (00:41.167)\r\nI'm in big tech. So I've done this a while already. So I'm a project manager, a product owner, right? I manage all of the smart developers, architects and engineers. And then I put the fairy tale business ideas together.\r\n\r\n\r\nNikolas Hulewsky (00:59.304)\r\nthe fairy tale business ideas.\r\n\r\n\r\nCorey (01:01.303)\r\nYeah, so they come up with real crazy things and then we work with the developers and we say, hey, can we do this? How long is it going to take? And I'm that project manager that understands both sides of the technology and the business. But I'm not a developer, right? I don't code. don't do databases. I don't do any of that. do. No. No.\r\n\r\n\r\nNikolas Hulewsky (01:22.162)\r\nDid you have any coding experience?\r\n\r\n\r\nNo, okay. And so this that we're looking at that you built, where did this idea come from? What was the genesis behind it?\r\n\r\n\r\nCorey (01:30.691)\r\nYep.\r\n\r\n\r\nYeah, so the whole premise of trying to launch a startup is to solve a real world problem and then to figure out how to scale, monetize, onboard, all that. So I found an extremely interesting niche.\r\n\r\n\r\nthat was a real world problem for us. And with my background, I knew I could potentially turn it into something larger. And it has started to scale pretty well.\r\n\r\n\r\nNikolas Hulewsky (02:10.92)\r\nHow long ago? Okay, so let's describe the idea really quickly. What are we looking at on the screen?\r\n\r\n\r\nCorey (02:15.693)\r\nYeah, so for pet owners, one of the biggest issues is documentation and where they keep all of the records for their pets, whether that be their vaccination records, whether that be when they went to the last vet visit, and then being able to share those. So if they go to the groomers or the trainers, they always ask for their vet records, right? Or are they vaccinated? Can you prove that they are?\r\n\r\n\r\nIf you move vet locations, getting your old records and actually keeping them that's not an archaic folder, piece of paper somewhere, right? And you transfer vets, none of that historical data comes over, right? Vets are very independent and there is no central network for them like that. A lot of vets aren't connected, right?\r\n\r\n\r\nSo the thought is for pet owners, they now have a centralized platform that they're able to not only keep their documents, they can share them. They can create a shareable link. They can email them. They can set reminders. They can put all the information about their visit that went in.\r\n\r\n\r\nRight? What was their medication last time? What was the, what this doctor say? Right? Any of your travel documents, you can have it right there on the go and not worry about paper and where's it at? Right?\r\n\r\n\r\nNikolas Hulewsky (03:34.387)\r\nYeah, and it's.\r\n\r\n\r\nNikolas Hulewsky (03:44.478)\r\nYeah, I mean, it's the same problem with patient information for humans, right? It's like, hey, how do I get all of my records to my current provider? And then not only how do I get them to my current provider, how do I get them in a format that they're going to be actually able to access it and read it and digest it and all of those things. except this is the use case for pets. Amazing use case.\r\n\r\n\r\nCorey (03:49.327)\r\n100%, right?\r\n\r\n\r\nCorey (04:00.943)\r\nfor that. Yep.\r\n\r\n\r\nCorey (04:06.285)\r\nYep. Yep.\r\n\r\n\r\nNikolas Hulewsky (04:10.01)\r\nand we're looking at the homepage right now, manage pet records, care reminders, digital document storage, et cetera. How did you build this?\r\n\r\n\r\nCorey (04:16.131)\r\nYep. I built all of this in loveable AI. Yep.\r\n\r\n\r\nNikolas Hulewsky (04:20.38)\r\nLovable. Okay. Why lovable? So there's a couple different softwares you could use. Cursor, Replet, Lovable. I'm trying to think if there's any that I'm missing. There's probably more that I'm missing, but.\r\n\r\n\r\nCorey (04:27.747)\r\nYep. Yep.\r\n\r\n\r\nThere's bold.new, there's windsurfer, right? There's a handful and I've used them all, right? So the few caveats with that is with cursor and with windsurf, you still have a coder interface. You still have to go in and work with the code, right? Like massage code.\r\n\r\n\r\nNikolas Hulewsky (04:56.222)\r\nSo it's not natural language like lovable is.\r\n\r\n\r\nCorey (04:59.567)\r\nIt is, but lovable is more of a prompt to go. And cursor is a more granular level of lovable. Right? Lovable is made for someone like myself. Cursor is made for a rookie developer who can open up the ID and actually get in there and do some work. Right? That's not me. This is literally all prompting. I did all of this from prompts.\r\n\r\n\r\nNikolas Hulewsky (05:28.904)\r\nAll of it. there's no... Jeez Louise.\r\n\r\n\r\nCorey (05:29.9)\r\nAll\r\n\r\n\r\nCorey (05:33.923)\r\nYeah, so with that, mean, and here's the home page, right? And then you can click on this, and it literally will show you another view of the dashboard. And then I have actual screen captures of what my data. And this is fully operational, so I'll take you through the dashboard as well, right?\r\n\r\n\r\nNikolas Hulewsky (05:59.211)\r\nso I'm looking at a live version of this. This isn't like a mock-up.\r\n\r\n\r\nCorey (06:02.401)\r\nNo, this is live. My website actually just went live this morning. Yeah, so I own petdocument.com is my domain. Yeah, so mean, you can secure your document.\r\n\r\n\r\nNikolas Hulewsky (06:07.806)\r\nCongrats, that's awesome.\r\n\r\n\r\nNikolas Hulewsky (06:15.794)\r\nAwesome, yeah, great domain. Geez. So like we're looking at all of these options. Is there a sign in? Is there like a portal?\r\n\r\n\r\nCorey (06:27.416)\r\nThere is, right? So I can go here and log in. I'm to log in under the test account.\r\n\r\n\r\nNikolas Hulewsky (06:34.386)\r\nAnd you created the portal within Lovable. Lovable created the portal for you.\r\n\r\n\r\nCorey (06:37.379)\r\nYeah, so here's your dashboard once when you sign up for my service. So you can, and this is my test environment, right? But like, so here's my dashboard. You can click on your pet. You can get their health information. You can get their documents.\r\n\r\n\r\nAnd this was just the overview dashboard, right? And then you go over here, you can see your documents here. You can go in your health check. You can select what animal it's for. You can add vaccinations. You can add your medical tracking. Here's your... All the way down to like, I have a referral program built in. So when you go to sign in, you can give them a referral code.\r\n\r\n\r\nNikolas Hulewsky (07:13.598)\r\nThis is a very robust site.\r\n\r\n\r\nNikolas Hulewsky (07:24.958)\r\nHow long did it take you to build this?\r\n\r\n\r\nCorey (07:25.719)\r\nright?\r\n\r\n\r\nCorey (07:31.833)\r\nThe building is relative, right? So the idea started back in November, December of last year, a list of about 12 to 14 different ideas that I had. And then I started to kind of narrow those down to what I could actually do within myself, right? Like what's in my scope? What am I actually capable of doing?\r\n\r\n\r\nAnd then January of this year, this idea really started to get some traction in my head, like just by talking to a few people and this and that. And they're like, OK, OK. So I spent January basically thinking about it, planning it. I spent February doing market research and design.\r\n\r\n\r\nLike, how did I want this to look? The premise of this is you should be able to click on a pet and then have all of your information right there about your pet. And using some of my corporate stuff that I know, I do product. So I know how things should look, how they should feel, what's the flow.\r\n\r\n\r\nand then I spent the whole month of January, or I'm sorry, the whole month of March building. I'm roughly.\r\n\r\n\r\nNikolas Hulewsky (09:01.918)\r\nJeez Louise. Just you. you didn't have anybody come in that was like, hey, I need you to just take a look at the code and fix some stuff up.\r\n\r\n\r\nCorey (09:10.191)\r\nSo that was actually what I did the last week, right? So I know this is all vibe code, right? Is what the term is. But knowing that I'm making a real product with a real paywall, right? Is a little bit scary for me because I've never done it.\r\n\r\n\r\nNikolas Hulewsky (09:18.215)\r\nYeah.\r\n\r\n\r\nCorey (09:30.095)\r\nSo I did pay a dev to come in and actually make sure Stripe was hooked up appropriately. My backend authentication was correct. There was no crazy API keys exposed anywhere that shouldn't be or secret keys. And he was pretty impressed with what...\r\n\r\n\r\nhow far I, mean, like I said, I did 99 % of those. Though the last was connecting stripe.\r\n\r\n\r\nNikolas Hulewsky (10:01.534)\r\nDude, okay, this is incredible. I mean, this is like a real robust website that has functionality that you vibe coded in essentially a month.\r\n\r\n\r\nCorey (10:09.121)\r\nNo, it's yes. Zero.\r\n\r\n\r\nNikolas Hulewsky (10:13.82)\r\nwith no technical background. Okay, here's my, so for people who don't know lovable, what you can do within lovable is basically prompt it and say, hey, this is what I'm looking for. And you're using natural language to write the code for your websites. Yeah. So at the same time, there's still a lot that it spits out that you don't really understand that you need, that you need to be able to have some technical background. And so for example, Hey, I've got to hook up the payment processor.\r\n\r\n\r\nCorey (10:43.715)\r\nYep.\r\n\r\n\r\nNikolas Hulewsky (10:43.762)\r\nHey, I've got to make sure that the emails go somewhere. I've got to have some API integrations, yada, yada, yada. For me, I'll use lovable, but then I'll use another LLM to kind of walk me through how to write the prompt for lovable or fix the problem. Did you do the same thing or did you do everything in lovable?\r\n\r\n\r\nCorey (11:01.807)\r\nSo I did do a little of both, right? So there is some planning that kind of goes into the prompts, right? And kind of how you want them built in phases. So I do use Gemini and ChatGPT to kind of walk through, here's the premise of what I'm trying to do, right? Here's the feature that I want.\r\n\r\n\r\nI also found in lovable it's extremely helpful to use the chat only feature because then it understands your whole project and You can have a conversation without it making any edits Yep\r\n\r\n\r\nNikolas Hulewsky (11:42.13)\r\nReally? Can you show me what that looks like?\r\n\r\n\r\nCorey (11:45.677)\r\nI sure can. So let me go ahead and just share this.\r\n\r\n\r\nNikolas Hulewsky (11:49.406)\r\nCause I'm, like I said, I've built a couple things in lovable, but I'm still just learning it and trying to understand how to actually use it, utilize it to its full potential.\r\n\r\n\r\nCorey (11:56.877)\r\nYep, here actually, actually that was one of my last prompts on this was just kind of talking to it.\r\n\r\n\r\nNikolas Hulewsky (12:08.712)\r\nkids if you're if you're just listening lovable has the prompt text interface and then up to the right on the screen it will show you a preview of what the page looks like and so he's he's showing that right now\r\n\r\n\r\nCorey (12:18.127)\r\nYep.\r\n\r\n\r\nCorey (12:24.035)\r\nSo here is a good question, right? I asked, what is the main tech stack this is built with? And it literally walks through all of it, right? And then my last question was, is my site map accurate? So I'm starting to ask.\r\n\r\n\r\nNikolas Hulewsky (12:25.288)\r\nCan... Yeah.\r\n\r\n\r\nNikolas Hulewsky (12:41.544)\r\nNow what is that asking? What does that mean? Is your site map accurate?\r\n\r\n\r\nCorey (12:44.919)\r\nYep, so what it includes, right? So your site map is for a lot of your SEO type stuff, right, to make sure that your site is either indexed properly, the pages are showing correctly, right? So you can see right here what's correctly included, it responded with, and then it suggested a few things on what might be missing, right?\r\n\r\n\r\nAnd all of you have nothing yet actually that was literally just my last my laugh I'm showing you right like this is live this is alive But I mean it's it's not hard to literally all you do is go from this mode and just click this chat only\r\n\r\n\r\nNikolas Hulewsky (13:16.7)\r\nAnd so with the things that were missing, what did you do with that? Were you like, yeah, go ahead and fix these.\r\n\r\n\r\nNikolas Hulewsky (13:24.24)\r\nOkay. Yeah, yeah, yeah. No, it's amazing. It's amazing.\r\n\r\n\r\nCorey (13:38.081)\r\nAnd now you can just ask it questions like, give me five more ideas. And it's literally gonna produce five more ideas for this website. And then it's gonna have like a implement plan button and it'll just go through and start doing stuff.\r\n\r\n\r\nNikolas Hulewsky (13:59.923)\r\nWhat is Lovable built on top of? Is it OpenAI's interface or do you know?\r\n\r\n\r\nCorey (14:05.999)\r\nI don't. think it's Claude or Anthropos, it's like backend or something, but I'm not sure. But I mean, you see right here, right? Let me think about some additional premium features and it'll literally walk through and suggest them. And not only suggest them, but then walk through and actually bullet point out what they're gonna do.\r\n\r\n\r\nCorey (14:35.703)\r\nand then at the very bottom of this, you just have an implement plan button.\r\n\r\n\r\nSo it'll walk through and it'll, know, marketing brand tools, advanced business analytics. It just, helps brainstorm ideas right within it. And then you can tell me more about number three, right? Or you could sometimes just get hairy and say, do it all. You know what I mean? Like.\r\n\r\n\r\nNikolas Hulewsky (14:43.71)\r\nCheers.\r\n\r\n\r\nNikolas Hulewsky (14:59.486)\r\nSo I.\r\n\r\n\r\nNikolas Hulewsky (15:03.486)\r\nI talked to somebody before who is a coder and they said something, dang it, I can't remember exactly what the term is, but it's like, in order to get another coder kind of caught up to speed on the way the website's built, there's this thing, it's like notes or like, I don't remember what the term is, but you can produce it to give to somebody so that they can take a look at the website and like quickly sort of just understand how it's constructed.\r\n\r\n\r\nCorey (15:29.423)\r\nCorrect, yep, so those are like the readme files and the GitHub documents. yep, so if you go to the GitHub repository on this, right, like it'll have a whole readme section that lovable is clearly laid out that another developer can come in behind and know exactly what's happening, right?\r\n\r\n\r\nNikolas Hulewsky (15:32.624)\r\nRead me. That's right. That's what it was. Yeah. Read me stuff. So.\r\n\r\n\r\nNikolas Hulewsky (15:50.076)\r\nSo you create all of this in lovable, upload it to GitHub, then what? How does that work?\r\n\r\n\r\nCorey (15:55.567)\r\nCorrect, then, so up here there's a button. And I just hit publish, and it pushes it straight to my GitHub repository. And then from GitHub, it goes to Vercell for the interface to host it.\r\n\r\n\r\nNikolas Hulewsky (16:23.878)\r\nAnd you don't do anything with it on GitHub. That's just where it's stored.\r\n\r\n\r\nCorey (16:27.993)\r\nCorrect, GitHub's the middle person for the storage of all the code. So that way I can roll back different branches, can do different things within GitHub. So I can make, like right here, as you just saw before I asked this question, right? I literally switched branches to start testing new features so it doesn't impact my main site, right?\r\n\r\n\r\nNikolas Hulewsky (16:33.288)\r\nBecause then, so.\r\n\r\n\r\nCorey (16:54.615)\r\nSo think of that like a parent-child hierarchy within the folder structure. It's saying my main site's good, I just made a clone off of it, and now I'm gonna start trying new things. If it works, I'm just gonna push it up to the main, which will then push it out to my website.\r\n\r\n\r\nNikolas Hulewsky (17:11.516)\r\nIs this the first thing you vibe coded?\r\n\r\n\r\nCorey (17:14.351)\r\nStart to finish, yes. Yeah, I've done handfuls of, I mean, I've been a lovable user since like day one, right? So I'm familiar with it. I've built, we'll call it a dozen other little side things and little stuff, but nothing to this full.\r\n\r\n\r\nNikolas Hulewsky (17:16.302)\r\nOr start to finish yes, okay.\r\n\r\n\r\nCorey (17:36.429)\r\nI mean, this is a full platform. You can upload documents. You can take pictures. You can share them. There's a support channel built into it. This is a full functional service.\r\n\r\n\r\nNikolas Hulewsky (17:49.958)\r\nis incredible. Will you tell, of the LLMs, which one is your preferred LLM?\r\n\r\n\r\nCorey (17:56.631)\r\nDepends what you're trying to do. So for example, if I need something down, dirty, and quick, I'll go to Gronk. He's pretty straightforward. He doesn't give you all the fluff with it. Chat GPT is really, really good now for being able to multitask. So you can give it numbers, pictures.\r\n\r\n\r\nNikolas Hulewsky (17:58.526)\r\nOkay, walk me through.\r\n\r\n\r\nCorey (18:25.143)\r\nview a canvas and then go right back to a conversation, right? There is no bouncing back around. I really like the new updates they've done.\r\n\r\n\r\nIt's, yep, yep. So I do use Gemini every now and then for some like deep research stuff, but I'm not a heavy, heavy user of Gemini.\r\n\r\n\r\nNikolas Hulewsky (18:38.11)\r\nAre those the main two? Grok and ChatTPT then? Those are the two LLMs that you're working through?\r\n\r\n\r\nCorey (18:54.349)\r\nand I don't use perplexity at all anymore.\r\n\r\n\r\nNikolas Hulewsky (18:58.994)\r\nWhen you got stuck on things here, what LLM did you use to actually fix it?\r\n\r\n\r\nCorey (19:04.515)\r\na chat GPT. I told it the issues I was having, a copy of the error message, and then what type of prompt to redirect it to fix it. Because the issue is, right, like it's all about prompt engineering. And not being a coder, I don't necessarily understand or know why it's getting hung up or what it's hallucinating on.\r\n\r\n\r\nNikolas Hulewsky (19:06.248)\r\nChachipiti.\r\n\r\n\r\nNikolas Hulewsky (19:33.532)\r\nRight. So you need someone to like tell you what's out.\r\n\r\n\r\nCorey (19:34.551)\r\nSo they're exactly, but if I could prompt it accordingly or point it in the right direction, that's huge, right? So it's truly about how you direct these chats.\r\n\r\n\r\nNikolas Hulewsky (19:53.574)\r\nCorey, this is friggin mind blowing, man. This is, this is awesome. So pet document.com and, man, it's live. can't wait to see the next thing that you build. thank you so much for, for sharing this.\r\n\r\n\r\nCorey (19:58.862)\r\nYep.\r\n\r\n\r\nCorey (20:05.677)\r\nYeah.\r\n\r\n\r\nAppreciate it man, appreciate the time.\r\n\r\n\r\nNikolas Hulewsky (20:10.968)\r\nAlright, stay on.",
  "metadata": {
    "duration": "",
    "date": "2025-05-13",
    "platform_source": "Google Drive"
  }
}