{
  "episode_number": "196",
  "episode_title": "His Cold DMs Got Him GaryVee, Rick Ross & Larry King with Casey Adams",
  "guest_name": "Casey Adams",
  "business_name": "Listener.com",
  "transcript": "﻿Nikolas Hulewsky (00:00.106)\r\nSo I'm not hyper concerned about the language coming in. But in doing my prep for this podcast, I got the most psyched because I found out you're not only a serial podcaster, you started podcasting at 17 years old, which is nuts to me. You're now 24 years old. You've probably done over a thousand podcast episodes, but check out some of the guests that you've had. Larry King, Rick Ross, that was a mind blower. May Musk, Elon Musk's mom, David Sacks who...\r\n\r\n\r\nnow is hyper famous. don't know if he was, you know, super well known at the time that you interviewed him. Dane Cook, I thought was super interesting. And then it looks like an owner, owner of the Houston Rockets. can't even say his name. yeah, dude, some amazing things. And then you've gone on from those conversations and you started multiple companies. You have it. had a company that you co-founded called media kits and you've now\r\n\r\n\r\nCasey Adams (00:41.376)\r\nYeah, yep.\r\n\r\n\r\nNikolas Hulewsky (00:52.262)\r\nYou've been an investor in multiple companies, either as an angel or advisor, and you've just launched a company called Listener.com, which amazing domain. It's really hard to get domains that small. Listener.com, I'm sure, was a premium domain. So my first question is, why did you respond to my DM and decide to come on this podcast? Because I'm way beneath you.\r\n\r\n\r\nCasey Adams (01:12.566)\r\nBy no means are you gonna need me, Nicholas. And first off, thank you so much for having me on the show today and even just having that, understanding the guests that I've had on and referencing them. I gotta say, even when people read them back to me sometimes, it even still shocks me to this day that I land some of these awesome guests on my show and dive into history. But I think why I responded to you,\r\n\r\n\r\nNikolas Hulewsky (01:16.118)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (01:31.534)\r\nI\r\n\r\n\r\nCasey Adams (01:38.812)\r\nYou have an incredible presence on X on social. You put out so much great content. And I think I'm always personally, as you are, you know, checking DMs, wanting to communicate with people, looking to build relationships online. And I think it's one of those things where I look at it as just, you know, it's like, don't fear the man who practices a thousand kicks a day. Fear the man who practices one kick a day for a thousand days. And for me, when I view networking, I think just building the relationships and being active on social, getting back to people and like,\r\n\r\n\r\nknow, saying yes opportunities that make sense at a certain time of your business. I've lived by that since I was 16, 17 years old. So I just try to that habitual nature of my life.\r\n\r\n\r\nNikolas Hulewsky (02:15.662)\r\ndude.\r\n\r\n\r\nAnd for any listeners who are like right now, like, this guy's a podcaster. don't want to listen to the rest of the episode. Stop, stop. You need to listen to the rest of this episode for a couple of reasons. Number one, you just said it in there networking. You think a 17 year old Yahoo. don't, I don't remember where you're from Virginia. Is that right? How does a 17 year old Yahoo from freaking Virginia get Larry King, Rick Ross, David Sacks onto his podcast. If you don't think that his frameworks for getting cool people on his podcasts are applicable to your small business and your ability to network with.\r\n\r\n\r\nCasey Adams (02:34.582)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (02:48.224)\r\ninteresting people, influential people, famous people, helpful people, whatever it is, then you're wrong. Listen to the rest of this episode. If you don't think that the way he's going to describe his learnings from media and how it applies to small business, like how you can take that and actually build a small business that's profitable, that has a good sales funnel, then again, you are wrong. And then my favorite thing that we're going to get into, which is hyper specific, but it's like I'm interested in, I think the media landscape is totally changing. think that\r\n\r\n\r\nCasey Adams (02:55.35)\r\nYou\r\n\r\n\r\nNikolas Hulewsky (03:18.496)\r\nthe old funnels or channels that you used to market through, even Facebook, are not necessarily going to be around in the same former fashion that they are right now. I think that founder led podcasts are the new form of SEO for companies. And so if you want to be relevant and if you want to continue to have a company that's growing, you are going to have to put out content. I'm sorry, I don't make the rules. Those are just the rules. And if you want to figure out how to be ready for this next iteration of companies with AI,\r\n\r\n\r\nYou wanna listen to the rest of the podcast. So now that I've teed you up at 17, you just started podcasting? Like why? What advice could a 17 year old have possibly had to give to the world from Virginia?\r\n\r\n\r\nCasey Adams (04:02.986)\r\nOh man, I'm first of all, I'm so glad you even say Virginia because the answer, you know, back then was I don't know, right? And that was the question I was asking myself and battling with, but I didn't let me, it didn't let me, you know, hold me back in a sense. you know, to give the context, you know, I started the show when I was 17, as you mentioned, December, 2017, very different era of, you know, podcasting and what it has matured to.\r\n\r\n\r\nBut really like my entrepreneurial journey started kind of like a year before that, mid 2016. I was a sophomore in high school and, you know, as we were chatting beforehand, but grew up an athlete, played hockey for 10 years, lacrosse, then was playing football sophomore year, going into sophomore year of high school. And what I thought was just sort of a minor injury that was, you know, hold me back two weeks and I get back on the field. It was the first day of hitting practice. I kind of injured my neck, didn't think too much.\r\n\r\n\r\nof it besides, ow, that hurt and I gotta go get it checked out. But I go to the doctor the next day and inevitably I can no longer play football ever again. I'm in a neck brace for nearly six months and I was diagnosed with what's called inner spinae is ligament damage. this really like the pivoting point of my life came from this, you know, just identity shift where I couldn't play sports anymore.\r\n\r\n\r\nNikolas Hulewsky (05:18.456)\r\nmy gosh,\r\n\r\n\r\nNikolas Hulewsky (05:25.954)\r\nMm-hmm.\r\n\r\n\r\nCasey Adams (05:28.778)\r\nAnd that was like my identity growing up and kind of thinking, yeah, like I'll be good, know, sophomore high school, I'm going to go hit the field. This is just a minor tweak leads to, you know, that being the last time I was on the field and having six months of initial depression, anger, not sure what I want to do with my time and just kind of down this void, which inevitably led to social media, right?\r\n\r\n\r\nadding on my phone, on YouTube, kind of scrolling endlessly on social as a young kid, but then inevitably starting to follow people like Tony Robbins and Gary Vaynerchuk and kind of started going down these rabbit holes of business founders. And that's when I was like, you know, my parents are telling me I gotta get a job soon and I wanna get a job soon, but this marketing thing and like making money online, like that sounds interesting and I'd much rather learn that.\r\n\r\n\r\nSo, ended up starting my first kind of Facebook ad agency when I was 16. My goal was to do Facebook advertising for my dentist, my chiropractor, my local sports shop, and ended up sort of to get some clients on retainer when I was 16, 17 years old. And then when I was starting to make some money, I was like, okay, how do I meet cool people and learn from them? I do not come from an entrepreneurial background or family. And that's when podcast.\r\n\r\n\r\nNikolas Hulewsky (06:46.385)\r\nWhat is your family's background, by the way?\r\n\r\n\r\nCasey Adams (06:48.726)\r\nYeah, my mom's been a special ed teacher for nearly 15 years. And she has so much purpose for what she does in her life. you know, prior to that, she was a babysitter. Like she was the babysitter. Like growing up, all my friends after school, like elementary school would come back to my house and she was the babysitter for kind of the neighborhood, which was super cool. And then my dad, he's worked at Philip Morse, you know, tobacco company for nearly 30 years.\r\n\r\n\r\nNikolas Hulewsky (06:53.77)\r\nwow.\r\n\r\n\r\nNikolas Hulewsky (07:17.766)\r\nmy gosh.\r\n\r\n\r\nCasey Adams (07:18.87)\r\nSo, know, very non entrepreneurial background. And I'll say that with a caveat, that's something I always loved looking back where if I was a little bit older when my dad was doing this, I think there would have been some like complimentary, like, how can I help? He had his own like asphalt company where he was like paving the driveways and all the, you know, all the neighbors and had his own asphalt truck and was doing this as like a side hustle. And it was like Adam's Asphalt, right? That was the name of the business.\r\n\r\n\r\nNikolas Hulewsky (07:48.11)\r\nGreat name.\r\n\r\n\r\nCasey Adams (07:48.966)\r\nBut my oldest brother, Cody, he would work with him on this. You know, I was like four or five, six at the time. So that was kind of useless. But there's always been like side hustles in the family for sure. But nothing has like a traditional like full time founder entrepreneurial perspective.\r\n\r\n\r\nNikolas Hulewsky (08:04.366)\r\nWell, first of all, I think it's hilarious you're like, I was four or five, six years old and useless. There's a chart. I wish I could pull it up right now. I currently have four boys under 11, right?\r\n\r\n\r\nCasey Adams (08:15.51)\r\nOkay, love it. They are not useless, by the way.\r\n\r\n\r\nNikolas Hulewsky (08:17.518)\r\nWell, dude, I freaking love it. They're fun ages. But there's there's like this graph where it's like usefulness of a child or like ability of a child. And on the y axis, or y axis, and then on the x axis is age. And it's like, wait, no, no, no, I'm like butchering this story. Let me take a step back, Mohammed, you're gonna have to that part out. So on the y axis, there is willingness to help.\r\n\r\n\r\nAnd on the X axis is age. And it's like, as they get older, there's much less willingness to help. But when they're really young, they're like really willing to help. They just they're not useless, but they're like more of a liability out there. So every day, like after five o'clock, I'm in the yard, I'm pulling weeds and my three year old, he's with me. Dad, can we pull some weeds? Dad, should we pull this weed? Dad, can I help? And it's awesome because I get to spend a lot of time with him. So on the one hand, yes, you were probably useless. But on the other hand, it's an amazing time as a father to just be.\r\n\r\n\r\nspending time with their kids. I want to ask though, you said something funny, you said inevitable like three times. And in the way that you said it, it was like, I wouldn't have drawn an inevitable conclusion from that. You're like, well, I was depressed. So inevitably, I went to social media. And then, you know, inevitably, I decided I should start a social media business. It's like, I wouldn't have I wouldn't have assigned inevitable to those things. When did you realize at what point did you realize?\r\n\r\n\r\nCasey Adams (09:16.924)\r\nIt's I love\r\n\r\n\r\nNikolas Hulewsky (09:45.326)\r\nI can take sort of that energy and identity that I had as an athlete and apply it to these areas. Was it before? I guess you actually started the podcast or was it after you started the podcast looking back, you're like, oh yeah, that's a good thing. I actually started focusing on this stuff.\r\n\r\n\r\nCasey Adams (10:04.534)\r\nIt's a great question and I'm so happy you mentioned that because I, that word inevitable, I feel that I do not only say it a lot, but I'm so happy you brought that up because yeah, I think it's my mindset on like, how my life inevitably came about was by no means inevitable. was the like, I didn't know what I was getting in for when I was 16 looking to start a business. I think when I say inevitable,\r\n\r\n\r\nNikolas Hulewsky (10:21.218)\r\nHahaha\r\n\r\n\r\nCasey Adams (10:34.877)\r\nUm, know, I think for me growing up when someone asks me, Oh, what did you want to do when you grow up? This is why I say never look back. You know, there'd be this chart. can kind of circle. Oh, what do want to be a firefighter police officer? And then there's this other category. And I would always just circle other and right business as just this open ended topic of, huh, seeing that you're saying. And, know, I like\r\n\r\n\r\nNikolas Hulewsky (10:56.108)\r\nreally?\r\n\r\n\r\nCasey Adams (11:01.898)\r\nbrands and I've always thought brands are cool from the hockey days and having the coolest skates and understanding like, like these different brands are businesses. Like I've always had that nature of just being curious about business. Yeah, to the question of inevitable, you know, for me, there was a moment where when I started going down this path of learning from entrepreneurs and then starting a company,\r\n\r\n\r\nI knew that I wanted just to do things that my, I don't want to say my oldest brothers weren't doing, but I know I wanted to do just something dramatically different than what I've seen my two oldest brother and their friends do in terms of, you know, into high school and after. And, you know, the college was always up in the air for me where I was playing lacrosse in high school. My dream in freshman year was play lacrosse at UVA. That was my sort of North Star.\r\n\r\n\r\nNikolas Hulewsky (11:58.114)\r\nYeah.\r\n\r\n\r\nCasey Adams (11:59.252)\r\nBut I didn't really have much of an idea of what would be after that. I think when the opportunity came, and I feel that for a lot of founders that I've also interviewed, where I was actually talking with Sriram Krishnan about this, who was a former GP of A16Z. Now he's the senior AI policy or crypto advisor at the White House with Sachs, actually. And we talk about this in our interview, his white space in life, where\r\n\r\n\r\nNikolas Hulewsky (12:20.717)\r\nNo way.\r\n\r\n\r\nCasey Adams (12:26.538)\r\nyou're moving to a new city or you get fired from your job or you get injured and you're in a neck brace for six months like I was, or this white space of like a path needs to materialize of what is next? What is my next step? I think for me, when I say inevitable, was whether it was leaning into becoming, you know, a lacrosse coach because I wanted to be in sports media or kind of venturing down marketing that just kept coming up in my life.\r\n\r\n\r\nWhat was inevitable was like finding that next path and leaning into it wholeheartedly at that time. And I think that just led to wanting to meet as many great people as possible and learn from them. And that's sort of my three checklist for the podcast when I was 17 was meet great people, learn from them and create business opportunities. And that felt like a right thing to do and a right use of my time.\r\n\r\n\r\nNikolas Hulewsky (13:19.63)\r\nIsn't, isn't that funny how humans just think we think in threes. Like when I started this podcast, here were my, here were my three things. I had just sold a couple of businesses and I was like, I don't even know what's out there. I want to learn. So I was like, I want to meet interesting people. I want to create a journal for my kids and I want to learn. Right. Like the, so like networking, journaling, learning, and you just, obviously you had three reasons when you started at 17, but\r\n\r\n\r\nCasey Adams (13:25.302)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (13:46.498)\r\nThat's so funny. like, well, my three reasons were, don't know if we're just genetically programmed to think that way, or if it's just been socialized in this. When you started, so at 17, you were a junior, right? And then you went into your senior year. Okay. So you thought you going to UVA. I'm sure your parents thought you were going to UVA. What changed in between starting your podcast and the end of your senior year? Because you, spoiler alert, didn't go to college. What happened?\r\n\r\n\r\nCasey Adams (13:48.374)\r\nBye.\r\n\r\n\r\nCasey Adams (13:53.557)\r\nLove.\r\n\r\n\r\nCasey Adams (14:00.052)\r\nYeah, going to Junior Year is a part of the show.\r\n\r\n\r\nCasey Adams (14:12.736)\r\nthat I\r\n\r\n\r\nYeah, you know, I remember there was, it was probably this three month period of going into junior year where before I'm going on winter break, where I kind of just was like colleges out of the picture for me and I want to really go make this business thing work. And I think it was when, when I started making enough money to be able to like,\r\n\r\n\r\nforward to travel. Growing up, and just to give context, when you say Virginia, I didn't travel on an airplane until I was 16 years old, until I bought the plane ticket myself. when I remember that first taste of just being able to, again, reinvest all the money I was making to go to this event to meet this person or to have them on the podcast, I kind of just felt that there was this newfound freedom of opportunity in this digital landscape of social media that\r\n\r\n\r\nNikolas Hulewsky (14:45.486)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (15:01.966)\r\nyou\r\n\r\n\r\nCasey Adams (15:12.278)\r\nI felt again, I want to pursue, I think the real answer was when I started making some money and add some inner clients and I was making more than,\r\n\r\n\r\nNikolas Hulewsky (15:18.029)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (15:21.624)\r\nHow much were you making? Senior year, how much were you making? A month.\r\n\r\n\r\nCasey Adams (15:25.302)\r\nI mean, I remember I signed a client for like 15 grand a month senior year, which was this like large scale client and ended up becoming partners of mine. They were living in Arizona and that's what actually brought me to Scottsdale, Arizona is I had these higher paying clients based in Scottsdale and we inevitably ended up acquiring this like entrepreneurial Instagram brand. But yeah, there was like I was making great money and.\r\n\r\n\r\nNikolas Hulewsky (15:51.618)\r\nWait, okay, so as a senior in high school, you're making 15 grand a month, are we making more than that?\r\n\r\n\r\nCasey Adams (15:56.182)\r\nI would say that was a average, sometimes more, sometimes less. I had a six month contract with this one client and he was referring me people. That was actually at the time, viral Facebook marketing campaigns for personal brands. But I do want to caveat just for the listener as well to kind of just, and we can kind of keep giving in this, but to circle full back on podcasting is when I started the show, meet great people, learn from them, create business opportunities. I just wanted to kind\r\n\r\n\r\nNikolas Hulewsky (16:00.174)\r\nHoly crap.\r\n\r\n\r\nCasey Adams (16:24.918)\r\nstep a couple steps forward so that we can dissect a little more is for me, the podcast and this whole idea of media and personal brand really came full circle in 2020 where my, again, I moved to Scottsdale, then I moved to LA to start this new tech company, MediaKits, as you mentioned. We ended up raising around a funding in 2021, $1.5 million. And I was 20 at the time. We had 37 angel investors and pretty much 90 % of those investors were past guests from my podcast.\r\n\r\n\r\nSo for me, it comes to, yeah, like when it comes to the flywheel effect of podcasting and we'll talk about it, I'm sure like, how do you monetize a show? How have you had the longevity to eight years? Like for me, it's always come back to that simple three checklist. Like the show has never been like, it has to make money. Um, it's, Hey, if I'm meeting great people, if I'm learning something and it's creating business opportunity, like I'm going to do this forever. Just because it's, I always say as a foundational to my career. And I just love it.\r\n\r\n\r\nNikolas Hulewsky (16:54.445)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (17:07.425)\r\nMm-hmm.\r\n\r\n\r\nCasey Adams (17:21.98)\r\nAnd obviously through all the awesome guests I've had on, it's just built this deeper appreciation for where this path can lead. But through that, you know, back to the point of making money in high school and starting to have this new kind of found freedom to travel and meet people. I just kind of ripped the bandaid off and I had no plan B and I just leaned into it. Senior year, I was taking three classes and I was someone that freshman year was like 4.0 GPA taking AP classes and was the youngest brother. I was like,\r\n\r\n\r\nhe's gonna be the one to go to college. My two oldest brothers did it. And then I just, you know, steered in a different direction. it was a very challenging, you know, conversation with parents and grandparents in the early days. But I always tell young people, it's the actions and like results that are the showcasing of such, I believe can help that conversation be a little bit easier, whether that's opportunities or whatever it may be.\r\n\r\n\r\nNikolas Hulewsky (17:52.502)\r\nHahaha!\r\n\r\n\r\nNikolas Hulewsky (18:14.72)\r\nI don't...\r\n\r\n\r\nI it. I always tell young people, dude's 24. I always tell young people. It's amazing.\r\n\r\n\r\nCasey Adams (18:22.038)\r\nWell, I feel like even, because I'm very young, even last week in Vancouver, there was this cool freshman group that attended this event called Wedge Summit. I was able to, you know, they were so curious because they could relate to me and I was 24 and they're 16. And it's cool to kind of have lived this eight years of experience to then kind of have that. I feel like I'm that.\r\n\r\n\r\nNikolas Hulewsky (18:43.734)\r\nWell, well, dude, I mean, you've you've crammed a ton into eight years, right? Like, I think everybody has a pivotal moment in their life that sort of forces them to rethink whatever path they were on. You just happen to have it as a sophomore, not, you know, in your mid 20s or mid 30s. So that's already something that's different. And then you've lived a bunch of places, you've started different companies, you've met a bunch of really cool people. So your breadth of experience is probably the equivalent of somebody in there. I don't know.\r\n\r\n\r\n30s or 40s. know, Brian Johnson's always like, Oh, my biological age is 15 years old. Your like experiential age is like 45. You know, that's what you should start. You start putting that on your bio.\r\n\r\n\r\nCasey Adams (19:21.11)\r\nyeah. I think that's what my wife and I's relationship work of like we kind of averaged out.\r\n\r\n\r\nNikolas Hulewsky (19:28.968)\r\nThat's awesome. That's amazing, dude. Who was the first big guest you had? Do you remember?\r\n\r\n\r\nCasey Adams (19:37.482)\r\nYes. And it was a very personal one. I'm curious if you'd know who he is. He goes by the name of Drama. Are you familiar? Okay. So are you familiar with Rob Dyrdek? So Rob Dyrdek, know, very successful entrepreneur, performer, pro skater, like media mogul, ridiculousness, Robin Biggs.\r\n\r\n\r\nNikolas Hulewsky (19:47.148)\r\nI don't know. No.\r\n\r\n\r\nNikolas Hulewsky (19:59.598)\r\nI'm older than you, so I remember Robin Bigg. That was my introduction to Rob.\r\n\r\n\r\nCasey Adams (20:03.126)\r\nYeah. So when you might know this guy, drama I'm talking about. So drama is Rob Dyrdek's cousin. He was the cousin in Robin Big that they would like lock him in the dog cage and like, yeah, Yeah. So drama though. So he's someone that, you know, after the show, obviously he built this big business called Young and Reckless, which was a clothing brand at, for people my age at the time, when I was like 13 to 16, biggest.\r\n\r\n\r\nNikolas Hulewsky (20:15.294)\r\nyeah, yeah, yeah, yeah, yeah, yeah, they just were always, you know, kicking them around.\r\n\r\n\r\nNikolas Hulewsky (20:30.956)\r\ninevitably, inevitably, he goes from being locked in an animal cage to starting a large clothing brand as one does.\r\n\r\n\r\nCasey Adams (20:34.216)\r\nEven show. Yeah. Exactly. But I think it brings a bigger point of modern media. Like Rob was a pioneer of like they had this platform of ridiculousness and MTV and they were the Mr. Beast sort of to compare like creative brands of Rob Dyrdek and DC Shoes. Drama. Yeah, for sure. And drama and then Young and Reckless. drama was the first\r\n\r\n\r\nNikolas Hulewsky (20:50.882)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (20:54.766)\r\nThat's a really good point.\r\n\r\n\r\nCasey Adams (21:01.546)\r\nguest where he had a million followers on Instagram. He's this big celebrity that I, not only myself, my whole family grew up watching Robin Big and Ridiculousness and these characters were huge parts of my childhood. And I remember the specific DM, I reached out to Chris Drama, that's his name, and he posted a book he was reading and I'm like, hey Drama, love that book. By the way, I just started my podcast, did 20 blank interviews. Would be such an honor to have you on.\r\n\r\n\r\nto show us some time if you're up into it. Something along that line, right? I remember he gets back to me like 10 minutes. I've never DM'd him before and he's like, sure, let's do it. And this was an era when he was really, he's just started his own podcast. He was going on a content spree. So it felt right as well. And then we did the interview virtually online. And for me, it was one of those times. And I think many of us that have shows or maybe building personal brands.\r\n\r\n\r\nmay have this moment as well where it kind of broke the barrier of like, wow, I was able to reach out. Even if it was a no, like he responded. I never thought he'd give back to me. That's incredible. And I think that's he did.\r\n\r\n\r\nNikolas Hulewsky (22:09.006)\r\nSo tell me when did you start the podcast and when did you have drama on?\r\n\r\n\r\nCasey Adams (22:14.806)\r\nYeah, so December 22nd, 2017 is when I started it. And that was probably January, February, like very quickly.\r\n\r\n\r\nNikolas Hulewsky (22:22.286)\r\nyes, you were grinding for weeks.\r\n\r\n\r\nCasey Adams (22:25.622)\r\nYeah, you know, the seven day overnight success.\r\n\r\n\r\nNikolas Hulewsky (22:27.054)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (22:30.732)\r\nYeah, I mean, but what's what's interesting to me is that you are already reaching out to people proactively that you shouldn't have been reaching out to. Or I should say that again, shouldn't have been reaching out to I did air quotes that time. Lots of people were like, well, I haven't got any episodes under my belt or I don't have experience or whatever. I'm gonna wait until it makes sense for me to reach out. Why like why were you reaching out so soon? Was it because you were just young and dumb? Or is that just always been\r\n\r\n\r\nyour personality like, I'm just going to reach out to whoever might respond.\r\n\r\n\r\nCasey Adams (23:05.013)\r\nThat's a great question. think it kind of goes even what we were talking about before sports where growing up and I think this is baked into my business mentality. I am the youngest of three. So I have two older brothers, you know, and whenever I was six, I was playing with the 12 year olds and getting beat up and like, you know, the little guy on the field and just trying to, you know, like punch up against my weight class. And again, I think how it has translated\r\n\r\n\r\nNikolas Hulewsky (23:24.238)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (23:30.637)\r\nYeah.\r\n\r\n\r\nCasey Adams (23:33.14)\r\nI think the fear of rejection or the fear of getting knocked down or getting a no hasn't always been there for me. And I'm willing to take risks on the field. And I think inevitably in the early, that word keeps coming up. I was just not afraid to send a DM. And I think Gary V's book, it was called Crushing It, that kind of started this idea of a podcast. The last chapter is about podcasting. And it was just about reaching out to people, cold email, cold DM.\r\n\r\n\r\nHe talked a lot about cold DM. And at the time that's where my main content was on social. And just to even take a step back on social, what was I doing at the time? Even prior to starting the podcast, I was really doing book reviews. Like I was like, I have nothing to talk about or to teach someone. I'm not going to try to be someone I'm not, but I'm reading dozens of business biographies. How can I just project when I'm learning?\r\n\r\n\r\nNikolas Hulewsky (24:21.368)\r\nDude.\r\n\r\n\r\nIt's so funny. That's so funny you say that because I was going to say later, you remind me of David Sentra. Do know who he is? The Founders podcast.\r\n\r\n\r\nCasey Adams (24:31.638)\r\nI love that. That's very great compliment. Thank you so much.\r\n\r\n\r\nNikolas Hulewsky (24:35.276)\r\nYeah. Well, I mean, you're both really smart. And he kind of says the same thing where he's like, I didn't really know anything, but I know these books and I can, I can summarize them for people and people love his podcast for that. but that's one of the really cool things is like, okay, if you aren't an expert, it's cool to just bring people along the learning journey with you. And that's essentially what you were doing with, I guess, the book reviews. I didn't know you were doing book reviews.\r\n\r\n\r\nCasey Adams (24:59.006)\r\nYeah, was maybe Instagram stories, even Snapchat stories. That was sort of like the earliest era of content for me.\r\n\r\n\r\nNikolas Hulewsky (25:06.4)\r\nSo tell me some of your secrets for reaching out to people that are way out of your league and getting them on your podcast because there are two people who are on my dream wish list. Number one is Scott Galloway and because I just think he's hilarious. He has a 12 year old boy sense of humor, which I do as well. I have all boys. I love the way that he talks about.\r\n\r\n\r\nyou modern masculinity and boys growing up in the space. just, I just would love to talk to them. And then the second one is, Gary V. I would love to talk to Gary V. I think he'd be great. So help me craft the best message. how would, how would I even go about getting them onto my podcast?\r\n\r\n\r\nCasey Adams (25:51.094)\r\ngreat question and I think I've had this dream list myself for years and I think there's two avenues and I'll answer this. One is some core examples. So in the earliest days, I know you talked to me before we started the show about how you did a hundred episodes in like 90 days, which is just incredible. And I relate to that and why I even had the...\r\n\r\n\r\nNikolas Hulewsky (26:10.382)\r\n90 days, yep.\r\n\r\n\r\nCasey Adams (26:16.864)\r\nhigh level velocity in the earliest days was a core story which you'd appreciate. know, Gary is who got me into podcasting. I read his book. I was like, great, that sounds like good idea. And at the time, Gary was coming out with a like the first era of his K-Swiss sneaker deal. I don't know if anyone remembers, but Gary did like six case with sneakers. So the very first one, was called the something 001s. And I remember I\r\n\r\n\r\nNikolas Hulewsky (26:37.719)\r\nYeah, yeah.\r\n\r\n\r\nCasey Adams (26:44.726)\r\nwas just I met the CEO of K-Swiss. I interviewed him or I was talking to him on social. So they sent me out this sort of like entrepreneur shoe. And back home in Virginia, I had a photographer friend and we did this photo shoot with the shoe. And long story short, I remember messaging Gary, I'm shooting my shot to people. I'm messaging Gary, I'm sending him the photos. Hey, thanks so much to your team. We're sending out a pair of shoes.\r\n\r\n\r\nNikolas Hulewsky (27:05.293)\r\nHahaha\r\n\r\n\r\nWas it you? Was it you in the shoe, like on a rock or something? Or was it?\r\n\r\n\r\nCasey Adams (27:11.19)\r\nThe shoe itself or like some yeah me wearing the shoe something.\r\n\r\n\r\nNikolas Hulewsky (27:14.542)\r\nCould you imagine now getting that DM from somebody? You're like, what? This guy's sending me his own photo shoot of this shoe? That's freaking hilarious.\r\n\r\n\r\nCasey Adams (27:22.486)\r\nYeah, no, it was wonderful. So I send this to DM to Gary and I'm like, hey, by the way, like just I my podcast recently. Just wanted to say thank you so much for the content you put out. And you see this like, you know, we'd love to have you in the show sometime. Long story short, he sees this and they're doing a big push in the shoe. And he's like, let me loop in Tyler, see what we can do. And long story short, I end up getting this 15 minute meeting slash.\r\n\r\n\r\nIt wasn't a formal interview, but just a meeting that we recorded 90 days out. I was in high school and he's like, come in March. And it was December or like, I think it was January and he's like, come in April or May, something along those lines. And I'm like, okay, well, I just started the show. I have nothing to talk about and I'm gonna figure out a way to get to New York and be there for this 15 minute time block. Let me just go do as many interviews as I can so that when I meet with Gary, I can tell him like, this is what I'm doing. This is what I think I should do.\r\n\r\n\r\nwhat do you think I should do and what do you think about what I've done, right?\r\n\r\n\r\nNikolas Hulewsky (28:23.276)\r\nWell, what was your pitch? So what was your pitch to Gary other than I like K Swiss? Was it actually like, can I meet with you for specific reason? Or was it just like, I'd love to meet you.\r\n\r\n\r\nCasey Adams (28:27.701)\r\nYeah.\r\n\r\n\r\nCasey Adams (28:32.481)\r\nIt was kind of just like, hey, know, love the shoe, love everything you've done. We'd love to have you on my podcast for 15 minutes to talk about the shoe campaign if you have interest. Something along those lines of like specific times, specific ask. And he's like, yeah, we figured out. And then long story short, I want to answer the question directly, like how people can go about booking guests effectively and something to take away.\r\n\r\n\r\nNikolas Hulewsky (28:41.592)\r\nGot it, okay.\r\n\r\n\r\nNikolas Hulewsky (28:51.48)\r\nNo, I love the story. No, no, no, stay with the story. I was just trying to understand kind of what the ask was.\r\n\r\n\r\nCasey Adams (28:54.166)\r\nYeah, Yeah, I love that. So we end up, I end up going there, meeting with him for 15 minutes. And again, one of those other barrier breaking moments where I feel like as a 17 year old kid, I saw myself a kid, I really, I was, still am, but I was able to just, in a very quick way through messaging, maybe a sprinkle of luck, just like pull the world I wanted very close to me, right? Like I wanted to be traveling to different places to meet.\r\n\r\n\r\nvery successful entrepreneurs to learn from them and to have someone like drum on the show and then to be able to get a 15 minute meeting in New York with Gary. I feel like I was able to just, I don't want to say expedite, but just have all these early opportunities that kind of made me buy in more to what I was doing because of the opportunities that were coming in front of me. So that's a story in terms of the ask again to Gary is it's a funny one that kind of made me want to go through that process.\r\n\r\n\r\nNikolas Hulewsky (29:50.67)\r\nThat's a great story.\r\n\r\n\r\nCasey Adams (29:53.482)\r\nBut another one, which I think is way more tactical for people, it ties into Rick Ross. I, this actually is a grateful for Stoke-a-Moment story that you'd appreciate and it kind of goes back to the questions you asked me prior to the show, like cool stories. So my interview with drama that I did, sort of inevitably, excuse me, I don't want to say inevitably again, I keep saying that word. It led to my, it led to my.\r\n\r\n\r\nNikolas Hulewsky (30:18.638)\r\nDude, I didn't mean to make you self-conscious. I just thought it was funny the way you used it.\r\n\r\n\r\nCasey Adams (30:22.518)\r\nYeah, I know. That interview with Drama led to my interview with Rick Ross. But this was like a two year gap and I'll tell you how and why and I think that's what people can take away from it. I interviewed, yeah, so I interview Drama, this was 2018 on Zoom and then a following,\r\n\r\n\r\nNikolas Hulewsky (30:35.96)\r\nTalk about a hook.\r\n\r\n\r\nCasey Adams (30:47.414)\r\nI go out to LA one time and I'm messaging Drama like, hey, we'd love to do another podcast in person. It was like a catch up. He's like, yeah, come by the office. We'll just, we'll catch up for 30 minutes and you know, we can chat and call it a podcast and it'd be cool. And ended up doing that. And then when I was living in Scottsdale, after I moved out to Scottsdale after high school, I was doing this more of an entrepreneurial events company doing a lot of live events. And that would then lead me to inviting people like Chris, Drama saying, hey,\r\n\r\n\r\nWe're doing this event in Scottsdale, 150, 200 entrepreneurs would love to have you come out and speak. No budget. you know, we're not paying speakers. And it, for me was a, my first extension of the podcast where I was young, was pretty and hungry and, know, I was convincing drama and his business partner, Dean Murphy, all these people to come out to our live events to speak.\r\n\r\n\r\nNikolas Hulewsky (31:39.182)\r\nOkay, so how long was it, but when you launched the podcast to doing this live event.\r\n\r\n\r\nCasey Adams (31:44.79)\r\nThat was 2018, October, think, yeah. 2017.\r\n\r\n\r\nNikolas Hulewsky (31:48.078)\r\ntwo years, it's cause cause December 22nd, 2016 you start and then 27. okay. I'm sorry. Okay. All right. So almost a year. Okay.\r\n\r\n\r\nCasey Adams (31:56.502)\r\nYeah, about a year, I'd say. that's years when I did like a hundred interviews, graduate high school, moved to Scottsdale. And then I'm really trying to say like, how do I pull these people closer to my life or a business I'm working on to create business opportunity? And this was my first version of doing that prior to like, you know, raising capital or like doing deals or in that co-investing with past guests and people of that nature that I've met through the show. But\r\n\r\n\r\nNikolas Hulewsky (32:00.622)\r\nCool, cool,\r\n\r\n\r\nNikolas Hulewsky (32:10.222)\r\nMmm.\r\n\r\n\r\nCasey Adams (32:21.302)\r\nBack to the story of Rick Ross and booking interviews, I think so much of all the people you've mentioned at the beginning, there's no one size fits all. It's the stories and kind of understanding how people can kind of look at their own life of how things might connect or what things can lead to. I think that's super important. So drama ends up coming to, you know, the small, no real budget type of event speaks for 20 minutes, goes back to LA same day. And this is the cool part where he gets to LA again, like\r\n\r\n\r\nchildhood hero, then becomes guest, then becomes sort of friend. He's like, hey man, that was really cool. What do you think about doing an event together in LA? I really liked this concept and I think it could be an extension of our like young and reckless brand to bring like an entrepreneurial thing to the thing. So, you know, I'm freaking out. I'm like trying to play it cool. Oh yeah, let's talk about it. know, it's not worth it.\r\n\r\n\r\nNikolas Hulewsky (33:06.698)\r\nNikolas Hulewsky (33:14.71)\r\nnot sure, yeah, I'll have my people call your people.\r\n\r\n\r\nCasey Adams (33:17.686)\r\nYeah, so overall very excited and we end up doing two Big live events in Los Angeles together in 2019 early night 2019 and late 2019 and that's where he You know kind of pulled into his network. We had Rob Dyrdek via keynote We had Robert Green the author who will be a key factor here into this Boss interview Robert Green You know 48 laws of power mastery\r\n\r\n\r\nNikolas Hulewsky (33:39.246)\r\nYep. With the 48 power laws, that?\r\n\r\n\r\nYeah,\r\n\r\n\r\nCasey Adams (33:46.934)\r\nProlific author and the founders of revolve, which is this publicly traded clothing brand and Trevor Moad who? Unfortunately rest in peace. He was a dear friend podcast guest. He was the brain trainer of Russell Wilson NFL like Hall of Fame brain So all I say all the context there because this sort of event that I was doing that was a kind of an extension of the podcast became this cool partnership with Young and reckless build your empire, which is the media brand I was running and I met Robert Greene there\r\n\r\n\r\nNikolas Hulewsky (34:01.379)\r\nYeah.\r\n\r\n\r\nCasey Adams (34:16.675)\r\nAnd again, just to be more tactical now and not so story driven, Rick Ross.\r\n\r\n\r\nNikolas Hulewsky (34:20.664)\r\nNo, hey, hey, there's no such thing as too long, just too boring, okay? And as far as I'm concerned, you're not too boring right now, so keep going.\r\n\r\n\r\nCasey Adams (34:24.342)\r\nYeah. I love it. Thank you so much for that. I meet Robert Green, who, you know, I'm a huge fan of his work, mastery, 40 laws of power, human nature, everything he talks about. Meet Robert there and we form a relationship. I end up interviewing Robert Green on my show. And when I end up inevitably reaching out, I'm gonna keep saying that, to Rick Ross, big, you know, big rapper, always been a fan of his work.\r\n\r\n\r\nhe is the biggest Robert Green fan. I end up finding out because Robert Green and Rick Ross are posting all of these pictures together and Rick Ross is about to come out with his new book and he's like, out to my god, Robert Green for like inspiring me, all that stuff. So when I specifically reached out to Rick Ross, which there was a lot of DMs didn't see, but the one he did see was very short and that everyone can learn from. And it comes down to\r\n\r\n\r\nknowing what people care about and breaking the barrier quickly. And so my sort of framework, and again, there's no one size fits all, but when I reach out to Rick Ross, it's, you hey Rick Ross, I recently had your friend Robert Greene on my podcast. It would be such an honor to have you on my show for 15 minutes to talk about your new book. Simple. And when I say that, again, there's\r\n\r\n\r\nI'll butcher it and it can be said different ways, but whenever I reach out to someone or if I finally break through to someone's inbox, figuring out what they care about, you know, he loves Robert Greene, he's a friend of his, and you kind of, the barrier kind of goes down and they draw that connection point. You give them some sense of time or you you respect their time, 15 minutes, 20 minutes, 30 minutes, whatever it may be, or however long the show is. For me, it was like, if it could be short and sweet, that's all I need. It ended up being 30 minutes. And then of course,\r\n\r\n\r\nto promote his new book, to shed light on something he's working on. And I know as well, he was going on this book tour and doing a lot of press and the timing was right. So understanding all those elements, I think has led to a much higher success rate of pitching people than, hey, ex-person, come on my show. This is why it's great. This is why you should do it. Versus just understanding what's important to them, kind of drawing the connection points to people they know and like and care about.\r\n\r\n\r\nCasey Adams (36:47.126)\r\nand not being afraid to ask and\r\n\r\n\r\nNikolas Hulewsky (36:49.644)\r\nSo this is why I still reach out to people. I don't, I shouldn't say that. My assistant does reach out to people cause she knows there are people that I like and she will do it on my behalf, which I'm grateful for. But I don't, that's not her task. Cause I'm not like, you need to reach out to all these people and this is the message that you're sending to them. She just does it proactively cause she knows I'd like to talk to so and so. But I think the more personal the message, the better. Here's what I just got from your stories. Can I, can I like repeat back to you what you said?\r\n\r\n\r\nCasey Adams (37:17.942)\r\nPlease.\r\n\r\n\r\nNikolas Hulewsky (37:19.854)\r\nit sounds like these were short messages. These weren't, you know, pages long. Fair. Okay. Okay. Cool. show them respect. So with Rick Ross in particular, like you, you respected his time and you're like, this would be just 15 minutes, right? Like, so there's a, there's a, somehow there's a show of respect in there. social proof. I thought that was a really interesting one. So for Rick Ross in particular, you went to, Hey, I had Robert green on my podcast.\r\n\r\n\r\nCasey Adams (37:26.868)\r\nThat's correct. That is very correct.\r\n\r\n\r\nNikolas Hulewsky (37:49.55)\r\nbecause you know that Rick Ross can be like, Oh, well, I know Robert. Well, if Robert went on your podcast, that's social proof that Casey is somebody worth speaking to. Right? Like, so you pulled social proof in there. I thought that was important. Specific ask. Um, knowing what they care about. That was, that was really interesting is you're not just like sending a hundred cold DMS. You're like really personalizing it to people. And here's my favorite. I don't, I couldn't figure out a best way to say it, but\r\n\r\n\r\nI think you'll know what I'm trying to say. The more unreasonable they ask, the more unreasonable the thought behind it needs to be. I'm trying to figure out how to say it, but it's like, you had no business asking Gary Vee to come on your podcast. None. But your freaking photo shoot was so unreasonable. It was like, what is this? This kid did a photo shoot with K-Swiss. Like, what? This is so weird that immediately it was like, wow, he put a lot of time and energy and thought into this. I'm willing to respond to this kid.\r\n\r\n\r\nCasey Adams (38:32.33)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (38:48.826)\r\nand for me, I think that's it to me. That's a parallel, right? It's like, if you're going after somebody who you have no business speaking to, then you have, you better have a pretty compelling reason to be reaching out to them. anyways, those were like the thoughts I was jotting down as, as you were talking, what do you, what do you think of those kind of tenants?\r\n\r\n\r\nCasey Adams (39:09.94)\r\nvery well said. think I mean, every big ask to big guess or even, you know, even to correlate it to fundraising for a startup, you know, there's so much about all that is so unreasonable of like why your companies be successful in this paper napkin idea with a non for me, for the non technical co-founder that wants to build a creator economy tech product with no technical background. And we raise, you know, one and a half million dollars, like so unreasonable.\r\n\r\n\r\nNikolas Hulewsky (39:27.768)\r\nYeah.\r\n\r\n\r\nCasey Adams (39:38.702)\r\nAnd that's why you get a lot of nos and you have to work on it. And then I think there's adjacently very much so of podcast guests. And I think the biggest thing is the momentum that you're building and never being afraid to ask. Because at the end of the day, I've probably had more nos or messages that didn't respond than I've ever had received or the big guests that you've.\r\n\r\n\r\nheard of, were hundreds that never got back to me because they never see it or they say no or not the right time. Right. So I think it's very well in terms of how you've articulated the lessons within that. And I even think to kind of tie it even full circle to listener.com that word, forget the company, being a listener and listening again to what people care about, to what's important to them now. Like you'll see a lot of these bigger creators or celebrities\r\n\r\n\r\nNikolas Hulewsky (40:05.208)\r\nYeah, that said no.\r\n\r\n\r\nNikolas Hulewsky (40:16.728)\r\noff.\r\n\r\n\r\nCasey Adams (40:33.706)\r\ngo on these podcast tours because they're talking about something specific that they care about at that time, a new movie, a new book, a charity. I think having your ear to the ground of what people care about and why now is so important because if you're interviewing ex-founder that sold their company a while back, they probably care about so many other things now. Their investments, their philanthropic efforts, and\r\n\r\n\r\nunderstanding that is super important. Just being a listener, feel is very key when it comes to looking, but also anything else in life.\r\n\r\n\r\nNikolas Hulewsky (41:10.328)\r\nSo I'll add a few points to this as well. I think curiosity is a superpower. And I think if you're willing to be curious and listen to somebody, not just because you're trying to get something, like, well, I'm supposed to be curious because that way I'm going to get what I want. No, to be genuinely curious on Casey's a person. I want to hear about what it's like to live in Marina Del Rey in your early 20s and go to Laker game. I'm curious about Casey, not necessarily what Casey can do for me, but\r\n\r\n\r\nabout Casey, I think people sense that. And Sean Pury, who's on My First Million, he has a business partner named Ben Levy. And he's like, Ben's superpower is getting people to talk and just connecting with them. And if you get to the end of a conversation and you're talking to somebody and they've done 90 % of the talking and you've done 10 % of the talking, they're going to walk away from that like, man, I like that guy. Right? Because\r\n\r\n\r\nCasey Adams (42:05.462)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (42:06.974)\r\nNot just because we like to talk about ourselves, but they feel heard. They feel like, they actually came and were listening to me. They valued me as a person. They weren't just trying to get their own word in there. so the same goes to this cold outreach method. If you're just like, hey, so and so I'd love to pick your brain about X, Y, Z. That's the laziest form of outreach. Like I ignore all of those messages. But if it's personalized and it shows that you're curious and that you're like actually care about what they're doing.\r\n\r\n\r\nCasey Adams (42:30.677)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (42:35.564)\r\nyou up the chances of a response significantly.\r\n\r\n\r\nCasey Adams (42:40.086)\r\ncouldn't have said it better myself. Very well said.\r\n\r\n\r\nNikolas Hulewsky (42:40.302)\r\nStop. Alright, so here's what I want to ask now. I want to know about. Listener.com. You're young, right? That's not a bad thing. You're 24 again. Your experiential age is mid 40s, but you. The week. So you've gone, you built all of these relationships. You did media kits first.\r\n\r\n\r\nCasey Adams (42:58.006)\r\nThe Wook doesn't tell me that, but we need to work on it.\r\n\r\n\r\nNikolas Hulewsky (43:09.432)\r\nBut this, like listener.com feels like a big swing to me. The first question I have is, if you can tell me, how much did the domain of listener.com cost you?\r\n\r\n\r\nCasey Adams (43:19.19)\r\nI'll give you the rough. So they started at over like 250, 250 thousand dollars and I got down to very like mid five, excuse me, low five.\r\n\r\n\r\nNikolas Hulewsky (43:26.21)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (43:32.448)\r\nOkay, no, no, no, don't say anything. Don't say anything. I'm gonna, I'm gonna ask you. I bought cofounders.com. I bought that for $65,000. Do you feel better or worse about your investment in listener.com now? Y'all F me. Gosh dang it.\r\n\r\n\r\nCasey Adams (43:47.232)\r\nbetter.\r\n\r\n\r\nIt was longer than $65,000. But it took 10 months of being stuck at like 150, 100. And I thought I was never going get it. But no, I mean, I think that is for cofunders.com. Again, we can talk for 30 minutes about that. I'm, when the invite came through and I saw it, was like, my gosh. The first impression is so real.\r\n\r\n\r\nNikolas Hulewsky (43:59.651)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (44:04.142)\r\nI love it.\r\n\r\n\r\nNikolas Hulewsky (44:10.67)\r\nYes. Well, dude, so I had his name is Jesse Tinsley. I don't know if you've seen him on Twitter. OK, you have. OK, so he owns employer.com recruiter.com. There might be one other in there, but he's a big believer in premium domain names. I honestly wasn't. I'm still not sure that I'm like totally sold on it, but I'm definitely becoming more and more.\r\n\r\n\r\nCasey Adams (44:16.404)\r\nYeah, I've had him on this one. He's awesome. Yeah.\r\n\r\n\r\nNikolas Hulewsky (44:36.524)\r\nsold on it, there is something about getting an email from listener.com or co-founders.com and not a co or a net or an dot IO or anything like that. Like the dot com does carry some weight with it. Did you wait until you have the rights to listener.com to launch your product or did it just happen to coincide with? Well, we weren't ready yet anyways.\r\n\r\n\r\nCasey Adams (44:58.262)\r\nYeah, no, great question. I, you know, my mindset and domains is very like, there's no one size fits all. Like some of the biggest companies in world, like don't have a.com or they don't care about it. Or, then you have some people that spend, you know, tens of millions of dollars for their domain. Um, for me, we actually, before we launched what is now listener.com, the last two, I should say a year and a half has really been a slow buildup of a testing ground.\r\n\r\n\r\nnow getting to what has now evolved into Listener.com. We actually had a AI podcast product called Listener.fm, which now just redirects to Listener.com. no, we weren't waiting. We had this product, Listener.fm, and that's when I was like, this product's cool, and I like building this podcast tech-focused company and industry. So that's when I started searching and seeing who had it, could we get it, and just went on the hunt. But no, I don't think...\r\n\r\n\r\nThe lack of a dot com should always hold you back from launching. But I like in. go ahead.\r\n\r\n\r\nNikolas Hulewsky (45:55.51)\r\nOkay, that's good. So I'm gonna...\r\n\r\n\r\nNo, no, no, you go ahead finish that.\r\n\r\n\r\nCasey Adams (46:03.446)\r\nI think it's a good pathway to this. Listener.com as a brand and a company. It is so much more than just this company itself, especially the name where there was a quote and I know we didn't get into the story, but my interview with Larry King, 2019, it ended up being his last interview that he ever did before he passed away, unfortunately. He has a... Yeah. And I know that because when he passed, BBC News DMed me on Twitter and they said, hey, we saw your interview with Larry.\r\n\r\n\r\nNikolas Hulewsky (46:23.522)\r\nNo way, really?\r\n\r\n\r\nCasey Adams (46:33.0)\r\nIt ended up, you it's kind of last record we found of him in this long format. Can you come on air and talk about his legacy and his impact in your life? So very prevalent to what you're about to show in terms of the product. But there was this quote that I said on air of BBC. said in hundreds of interviews after my interview with Larry, he says, I've never learned anything while I was talking. Therefore be a great listener. And the simple phrase has not only impacted how I.\r\n\r\n\r\nNikolas Hulewsky (46:40.456)\r\nmy gosh.\r\n\r\n\r\nCasey Adams (47:01.236)\r\ndo my show of not having specific questions and leaning into curiosity, but how I live my life of being a great listener to friends, to family, or, you know, I tried to the best of my ability. And when it inevitably came to my next company and podcast tech specifically, I just knew there was no other word and phrase and brand that I wanted to build around than listener. Initially .fm, but when I got the .com, it really felt like this full circle moment from 2019 when that quote really impacted me as a\r\n\r\n\r\nas an entrepreneur and as a founder.\r\n\r\n\r\nNikolas Hulewsky (47:32.206)\r\nSo walk me through the thesis behind listener.com. what, why start a SaaS company? You're probably making really good money, meeting really cool people, just having a podcast. Now you gotta like raise money and build a real business. You know what I mean? Like there's a headaches that come along with that. like, what was the thesis behind listener.com?\r\n\r\n\r\nCasey Adams (47:50.324)\r\nYeah, so right now, the sort of one-liner that we're really focused on is AI Listener Analytics for modern podcasts and podcast networks. And what do I mean by that? And again, why start a tech company? So my last company, MediaKits, very much so in the similar vein of creator economy. This is much different, but very focused on obviously podcasts, networks, and that industry as a medium. But for me, as someone that's sort of built their whole life and career thus far on the back of\r\n\r\n\r\nmy podcast and then now building in this space. I've seen how real podcasting has become as a business from 2017 to now, from the money poured into the space, from the big deals that have happened, and really the change of what even a podcast means from just being an audio show to shows adding video to short form content and paid communities being a big part of the podcast business.\r\n\r\n\r\nFor us, our initial go-to-market is really helping podcasters and their networks get a closer grip of where their listeners are and having a unified way to aggregate them and pitch their show with confidence to advertisers and understanding again, like what the modern listener is and where it is currently. So again, you have your listening platforms, the Apple, the Spotify's, but also all the social analytics that come with that and the newsletter that might be tied to your show. Our whole vision is to really be that one stop.\r\n\r\n\r\nAI powered listener analytics platform to better empower shows and networks to pitch and represent their show in this next era of podcasting.\r\n\r\n\r\nNikolas Hulewsky (49:26.37)\r\nYeah, so let me also add some color to that really quick here. So I'm going to share this tab. So the reason I reached out to you, I didn't really know much about you, but I think maybe you followed me recently. Sometimes I'll see somebody who's followed me and I'll just click into their profile to take a look because I'm curious. And I was like, he's doing this cool thing at listener.com. And then you sent me a link probably because I was just part of the funnel. I'm not quite sure. But I went and signed up.\r\n\r\n\r\nAnd so if you look here, like this is my little dashboard of here's my like total audience, total views, total content. And then I can actually come over here and I'll show this is like the public facing page. So if you want to know about Nick and Omix, I've got apparently 5,000 subs on YouTube, almost 4,000 on LinkedIn. There's Twitter, Facebook, blah, blah, blah. And then you can kind of see how many fans I've had. apparently my podcast rating And even click into some of my, guess, best performing podcasts.\r\n\r\n\r\nSo what I will say briefly is that as someone who does podcasts and does a lot of them, you want to know how you're doing. Like, am I reaching more people? Is it working? Am I getting deal flow? If they, if they do listen, how long are they listening for? Because there's not necessarily quality metrics and apple and Spotify don't provide a ton of real insight into that business. plus there's no real aggregator of every single one of the platforms. So.\r\n\r\n\r\nthink what you're saying is for people who are creating content around shows that they're doing, podcasts, this is meant to be the hub for them to understand how is their show doing? How is it performing? Is their content getting more reach? What is getting the most amount of reach? Can they do some analytics to see what types of episodes do better than other types of episodes, et cetera? So it's like for somebody like me who's been investing in podcasting and has an end goal to see it monetized, isn't necessarily just doing it for fun.\r\n\r\n\r\nHow do they get the best data and analytics? Well, listener.com is the hope for that to be the case. close, accurate, totally off.\r\n\r\n\r\nCasey Adams (51:34.738)\r\nVery well said. Yeah, I'd say very well said in terms of our initial, you know, go to marketing, what people are seeing if they're watching this, what they're looking at on your page. know, there's obviously, you can go to someone's YouTube, you can go to someone's Instagram and like follow their show in different places, but to put again, the power back into your hands, Nicholas, as the host, to get a overview of how your show is performing cross-platform and more importantly, you know, there's\r\n\r\n\r\nThere are some analytics platforms where, you know, I could go on there, pay their subscription and look up my show or look up your show and sort of get like a generalized understanding of the show and the demographic. for us. And something like if you go to listener.com slash Casey on my show, you, you won't be able to, and this is important to us. you won't be able to just see my data. It's sort of like, say like a doc send of listener analytics where you have to type in your, know, your full name, your email address or company. And then I have to manually approve.\r\n\r\n\r\nyou to see my data. I think for many disaster, it's important to have that power of controlling who's seeing your data and when similar to, again, like when I think about docs and in terms of document sharing, when people opened it, if they're sharing it, what they're clicking on. And for us, it's important to get the feedback that we've gotten from shows, but also networks when it comes to data representation for their shows, like they really want to put the control back.\r\n\r\n\r\nNikolas Hulewsky (52:34.303)\r\nnevermind.\r\n\r\n\r\nNikolas Hulewsky (52:58.332)\r\nMmm.\r\n\r\n\r\nCasey Adams (52:59.01)\r\nAnd even to give a quick example, like if you take two shows that have 100,000 downloads a month, being able to tell a story with your data, with the show to really create that, again, like the concept of the brand around the show, the social impact, where your listeners are and the differentiated factor, that's what we want this initial listener profile to become, is just helping tell a better story with your show, with the data that we can build on, and giving that power back to you in terms of...\r\n\r\n\r\ncontrolling who sees it and also being able to collect data from all the sponsors or whomever you may be sharing it with.\r\n\r\n\r\nNikolas Hulewsky (53:33.422)\r\nYeah, I mean, that's a good point that I didn't even bring up is it allows people who potentially want to sponsor a show the ability to see like, oh, this is their reach without buying one of those other third party tools or just relying on your word for how many people you're actually you're actually reaching. That's a good point as well.\r\n\r\n\r\nCasey Adams (53:50.006)\r\nOur use case right now is like, yes, podcasters and maybe their teams want to see this themselves, but we really want to empower them to share this across, you if the brand reaches out or even to, I guess, someone that, again, we haven't really built for this use case yet, but as a guest on shows, I can't tell you how many times these big public figures that I've had on their teams, like, can you send me, how many listeners, show impact, cross-platform social, like, they want to see the data as well, because just to get a sense of what they're signing up for in this,\r\n\r\n\r\nnew era of what comes with being a guest on a show. So there are many different use cases, but for now our main sort of focal point is build this so that you can share it with sponsors, especially for the shows that are treating it more in a professional setting of going to pitch sponsors and land brand deals.\r\n\r\n\r\nNikolas Hulewsky (54:38.126)\r\nSo I want to kind of dive into this specific part of it. Someone might be listening to me like, I don't care. Listener.com, cool. I'm never going to be a podcaster. I am never going to track this stuff. Like this is dumb, Nick. Can we move on? Which I think is the wrong take on it because of something that I've learned maybe a year ago, maybe two years ago, I came up in healthcare. So that was my, that was my world. And when I sold those companies, all of a sudden I was exposed to different things.\r\n\r\n\r\nCasey Adams (54:52.211)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (55:07.598)\r\nLike I learned about CAC for the first time, customer acquisition costs. like, CAC, is that? LTV, how does that work? We just don't track those things in the same way that most other companies do. But the one thing that I learned, which was really interesting is that when a venture capital company invests in one of these startups, Uber, Facebook, whatever, almost half of those dollars aren't necessarily going to the engineering team, to the product, to R &D or admin.\r\n\r\n\r\nAlmost half of those dollars are going to Facebook and Metta for customer acquisition because they are trying to capture the market as quickly as possible. Why do I bring that up? I know that like, that's probably weird. It's weird because sorry, it's not weird because it shows you the value that the smartest people in the world, the smartest capital allocators in the world place on acquiring customers. And the way that we traditionally acquire customers is changing. SEO has changed with Google putting in a new AI.\r\n\r\n\r\ngenerated answers. Pay-per-click isn't the same. Apple decided to stop tracking your cookies across platforms, and it wrecked a ton of businesses that were on Facebook for a little while. Google has finally just come out and said, we figured out how to monetize the AI answers. So we're actually going to put AI more in search at this point. things are changing, and what we're seeing more and more is that ad dollars are flowing from the traditional sources, the traditional funnels, into these newer funnels.\r\n\r\n\r\nCasey Adams (56:14.367)\r\nYep.\r\n\r\n\r\nNikolas Hulewsky (56:33.42)\r\nLike social media, like podcasting, podcasting in particular with the way that it changed the 2024 election of Donald Trump going on, Joe Rogan was a game changer. Money is going and has already started to flow into podcasts. And so my thesis, that's the whole setup for it is this is actually becoming more important than it ever has. This isn't a vanity project. How did I do with that description?\r\n\r\n\r\nCasey Adams (56:59.51)\r\nI loved how you positioned that. I'm going to clip that right there. You did it all for me. Come on. You just took something that can be seen so niche and just made people outside of the circle maybe care and have an understanding. that was well said.\r\n\r\n\r\nNikolas Hulewsky (57:02.965)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (57:13.196)\r\nI hope, well, I'm serious. I really hope that they do care because Cody Sanchez, Alex Hormozi, Gary Vaynerchuk, Rob Dierdrich, they monetized their platforms into a new form of distribution. And it's just becoming more and more niche. obviously the better you are communicating who you are and what your company values are, the more valuable that's going to become. So I think that people looking at this as like, not something I'm ever going to do.\r\n\r\n\r\nPersonally, think that founder-led content is potentially one of the biggest differentiators for companies that are growing. And that doesn't mean tech founder content. It just means business owner-led content, in my opinion, because you open up a brand new and underutilized channel of distribution.\r\n\r\n\r\nCasey Adams (58:02.87)\r\nAbsolutely. Very well said. I think this idea of founder led brand where not only the future, but we're living in it and you're seeing the real impact. The Mr. Beast and Feastable, the Logan Pauls and Prime. And then you see people like the Alex Ramosis and how his personal brand has been such a lead gen aspect of companies that he's acquiring and becoming majority stake owner in. So yeah, we could talk about that forever.\r\n\r\n\r\nNikolas Hulewsky (58:30.328)\r\nSo, so did listener.com for you, is that what you raised 1.5 million for or was that something else?\r\n\r\n\r\nCasey Adams (58:36.734)\r\nNo, that was for media gets the last day.\r\n\r\n\r\nNikolas Hulewsky (58:38.766)\r\nOkay, so have you raised money for listener.com or is this all self-funded?\r\n\r\n\r\nCasey Adams (58:43.35)\r\nSo we haven't done a formal round, but my last co-founder and my former board member, we have a handful of strategic investors, big podcasters on board, but by no means have we done a like a formal round. So yeah, it's not just me funding it. We've brought on some awesome investors and like friends to give you context.\r\n\r\n\r\nNikolas Hulewsky (59:05.166)\r\nof all the things that you're working on. Is this like the thing that you're most excited about? Like, this what you think is gonna be your big swing?\r\n\r\n\r\nCasey Adams (59:12.598)\r\nAbsolutely. mean, this is something that I over the last six months of, you we acquired this smaller podcast tech tool, integrated it into what we were doing and kind of more of like an aqua hire. And it has slowly but surely become just full time next big swing kind of, you know, in between my last company, Media Kits, we sold it in 2022 to a company up in Toronto. And after that, I was doing a lot more just\r\n\r\n\r\nNikolas Hulewsky (59:25.4)\r\nMm-hmm.\r\n\r\n\r\nCasey Adams (59:39.478)\r\nmedia, big brand partnerships, maybe it was like some consulting with big companies on podcast strategy. But I was itching to go do something in tech again. again, I looked at 2024 really as this testing year of we were doing, we were testing with having a podcast network. We were testing with podcast-related services and we had this product listener FM, as I mentioned, which was this podcast tech product, but we were just having, it was like a fun thing we were doing. It wasn't like something we were going all in on.\r\n\r\n\r\nAnd then towards Q3 last year, going into Q4, we slowly just started shifting focus and that blossomed into what is now listener.com and our future plans.\r\n\r\n\r\nNikolas Hulewsky (01:00:18.318)\r\nWould you be willing to like break down of a pie of income? Let's say that I'm looking at a pie of income. How much comes from, let's call it your podcast, and then what are the different businesses that you are currently like driving most of your income from?\r\n\r\n\r\nCasey Adams (01:00:33.364)\r\nYeah. You know, for me over, over the years, it's been, I don't want to say a lot of different things, but right now, like a core thing that we were doing at listener on the service front is like one of two things. One is helping, executives, C-suite level, you know, COO CEOs get booked on top business podcast. Again, we're kind of like not doing that as much anymore, but listeners, like a podcasting ecosystem. We were doing a lot of, like founder guest booking.\r\n\r\n\r\nNikolas Hulewsky (01:00:58.99)\r\nSure.\r\n\r\n\r\nCasey Adams (01:01:03.358)\r\nas well as podcast strategy implementation for brands to launch their own shows.\r\n\r\n\r\nNikolas Hulewsky (01:01:10.062)\r\nSo you were basically taking your network and your experience and you're like, I can leverage this cool. If CEO wants to pay me to put them in touch with the right person, we'll get them placed somewhere. Yeah.\r\n\r\n\r\nCasey Adams (01:01:18.326)\r\nYeah, it was like a concierge booking agency in a sense. Yep. Uh, and then brand partnerships, like every year for the show, I'll work with brands, but I'll kind of have like a couple anchor brands that I work with. Um, like in 2022, 2023, I did this big deal with Slack, um, podcast campaign right now. Um, I don't want to say it live just yet, but just a couple companies that are just awesome brand partners for the show, but also for my social content.\r\n\r\n\r\nlike brand partnership aspects. And yeah, let's stay focusing on that.\r\n\r\n\r\nNikolas Hulewsky (01:01:51.534)\r\nAre you willing to tell me how much you made last year?\r\n\r\n\r\nCasey Adams (01:01:55.261)\r\nI wouldn't do that here on the show.\r\n\r\n\r\nNikolas Hulewsky (01:01:57.038)\r\n$5,000, $100,000, $100 million. Stop me, Casey, $1 billion? All right. Okay. Well, this...\r\n\r\n\r\nCasey Adams (01:02:05.47)\r\nMaybe in a couple years I will answer that with the name of me.\r\n\r\n\r\nNikolas Hulewsky (01:02:09.336)\r\nFair, Dude, this was amazing. Thank you for taking time and sharing this. Where's the best place people come and find you? Where do you hang out the most?\r\n\r\n\r\nCasey Adams (01:02:20.086)\r\nYeah, for me, it's Instagram and X primarily. You on Instagram, we talked about this a little bit. I'm just at Casey on Instagram. Keep it very short and sweet. And then an X just at Casey Adams. And yeah, outside of that, you know, I always like saying if people want to email me, just Casey at listener.com. Podcast related question. If you want to pitch yourself to be a guest on the show and you're a cool founder, like I'm always all ears to just A, how I can help people and B, if there's obviously anything I can be helpful with. So.\r\n\r\n\r\nNikolas Hulewsky (01:02:23.789)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (01:02:48.854)\r\nAwesome, Awesome. Well, I hope we can talk again soon.\r\n\r\n\r\nCasey Adams (01:02:51.98)\r\nNicholas, thank you so much.",
  "metadata": {
    "duration": "",
    "date": "2025-06-30",
    "platform_source": "Google Drive"
  }
}