{
  "episode_number": "08",
  "episode_title": "The 1 Word Secret to Building a $100M HoldCo with Rafael Quinn",
  "guest_name": "Rafael Quinn",
  "business_name": "Alternative Holdings",
  "transcript": "﻿Welcome guys to another episode of Nikonomics. I have Rafael Quinn who goes by Rafa here. He has a ton of podcasts where he's talking about his background and experience. I'll link those in the show notes of quick and dirty background on Rafa is in 2011. He founded a hold co, which is like the sexy buzzword in.\r\n\r\n\r\nIn SMB, Twitter right now with a business partner and over the last 13 years, they have grown it to hold nine companies. They're doing about a hundred million dollars over a hundred million dollars a year in combined revenues and 10 million in EBITDA,  which is to say Rafa is legit. So he's too legit to quit.\r\n\r\n\r\nDid I miss anything? What was I right? I remember that song.  Yeah, we look at it as verticals. So we operate, let's say, as major acquisitions, but yeah, we've done six major acquisitions and three bolt ons.  Dude, that's, and he does not live in the United States, even though he grew up here.\r\n\r\n\r\nYou live in Panama. That's why he looks, I grew up in Santa Cruz, California, but I've lived down here for almost two decades. That's why you look so tanned and healthy all the times because you're living in one of the best, most beautiful places in the world. I love it. How old are you? Well, I'm 44.\r\n\r\n\r\nI'll be 45 this year. Oh my gosh,  you look fantastic.  Jeez, man, the tropics, man it's a way of life. I'm telling you, I'm like 38 going on 62 and you're 44 going on 35. Jeez.  Believe me, how I come across is not how I feel inside. The machine is much more broken down than maybe the machine. The machine has got some some sand in the gears.\r\n\r\n\r\nAll right. So you have a hold co. It is so sexy to talk about whole codes right now. I have a baby hold co describe for me what is a hold co.  First of all, it's really funny to hear you say how sexy it is because for the last 10 years, before we realized this was actually like a popular thing.\r\n\r\n\r\nNow, everyone was always giving us crap and saying how, what we were doing literally the term was not sexy because we would buy these companies that was like, industrial, sales and business process outsourcing. The coolest thing we had was a restaurant business, but it isn't even like this hip restaurant you go to, you know what I mean?\r\n\r\n\r\nIt's just like a pizza parlor. So it's like pizzas and salads. So  we've spent over a decade of people telling us that what we do is not sexy, that we just buy boring businesses. And now we get to say we have a holding company and now it's the cool thing. Right. My partner and I got started in two, two years ago. \r\n\r\n\r\nThere you go. It's just marketing. We're just remarketing it. 2011, we get started in Panama and our, this concept is not going to sound very innovative. We look to buy businesses that we understand. We look to leave management in place, operating them, and we look to buy them for a fair valuation.\r\n\r\n\r\nIf you go back and read Warren Buffett's. Letters  pretty much says something right along those lines. I don't want to say we copied them verbatim. We didn't plagiarize it but it's pretty close, and that's what we've done over the last 13 years. We've just buy a business, leave management in place, use the cash, buy another one and roll it up.\r\n\r\n\r\nSo did you buy, you bought a first business? Was your thesis, I'm going to build a hold co or was it like, Oh, we've bought this business and now it's doing well, let's buy another business. My partner would probably say he, he had the hold co in his head first. He was the one who brought that opportunity to me.\r\n\r\n\r\nI was more of an investor at that point. I'd worked in financial services. Up until that point I'd left the bank. I worked at the last job, like formal job. I had the bank got bought by HSBC. So I had a minor liquidity event right there. And I spent a couple of years just investing. So Panama was booming at that moment.\r\n\r\n\r\nThere was a lot of property development, land deals, commercial real estate development. Flips, things like that. That's what I was spending my time looking at. That's how I met my business partner. And he found this opportunity to acquire an industrial sales company, making. 350, 000 a year selling at three and a half X, the typical S D E acquisition that you still can find today.\r\n\r\n\r\nAnd I entered that transaction  because I believed it was an investment that made sense buying something at three and a half X company had over 10 years was selling a product  people are going to continue to use lubricants and filters for their engines had over 2000 active clients. It made sense to me.\r\n\r\n\r\nIt was about six to nine months later when we formally sat down and said, We really enjoy this. Let's not treat this as just another one off investment. Let's actually.  Use this to acquire another business and form a formal holding company. And at that part is where we actually start alternative holdings.\r\n\r\n\r\nA H we owned our shares individually at that moment. And I always say we like business wise got married in the sense that we put our shares together in a hold, go had 50, 50 voting rights. And it was much more of a formal partnership that you can't walk away from, just like in a marriage. You're.\r\n\r\n\r\nYou're joined together now legally. Is that first company still around about it is it still that same size? It's still an industrial sales. No, it does. It does lubricants. It does filters. It does hoses. It does timing belts. Steel cables for the ports and tuna fishing. So we've, in essence, moved into other product lines.\r\n\r\n\r\nWe have not grown geographically. We continue to attend all of Panama, but we've moved into other product lines that, that our customer base continues to use. We now sell to about 5, 000 clients a month. I hear a lot of people talk on SMB Twitter, theoretically. Right. And that they're looking at well, Jeff Bezos only focused on one thing or anybody who's really made money is focused on one thing.\r\n\r\n\r\nAnd I think there's two schools of investment philosophy. There's the go all in on one thing. And then there's the capital allocators. And frankly, I feel like the capital allocators are going all in on one thing. It's that their skill is. Allocating capital. But I think people don't necessarily view it like that.\r\n\r\n\r\nHow did you know that was your thing? Like, how did, why didn't you just  double down on the business that you had bought and continue to grow it and expand it? Why, like, how did I need to do other things. I don't want to spend my risk out. I want to invest other places.  Yeah, and  it's funny.\r\n\r\n\r\nWe actually have a document that like literally details that decision because we came to that crossroads. We'd bought our second business at that point, which was a business process outsourcing. So call center nowadays we do some logistics. We have manpower contracts, so we own these two companies.\r\n\r\n\r\nIt's 2012 and and then it's 2013 and then it's 2014 and then it's 2015 and we still have not found something else to buy. So we are paying down debt. We're accumulating cash, but we have not found another acquisition. We're taking meetings all the time and it gets, that gets,  it tries your patience because you're like, am I ever going to find something else?\r\n\r\n\r\nAre we just going to have these two companies? And we sat down and we had a discussion of what are we going to do? Are we just going to each be CEO of one of these and let's just grow each of these businesses as big as they can be. That's one model.  Are we going to continue waiting and trying to use our cash flows to buy a hundred percent of another company, call it maybe the Berkshire model, like the actual typical traditional hold co, or we also looked at, would we maybe go, I'm not sure if you're familiar with three G capital, the Brazilian firm, are we going to go with more of a kind of special situation and let's look for something maybe even bigger, but take a smaller stake with other investors, stuff like that, because we were in the niche we were looking at.\r\n\r\n\r\nWe weren't finding opportunities. So we're trying to see, well, what are we going to do? And we doubled down and just decided to be patient. And within a year we found our third acquisition and we just continued on. I agree with you that the focus for us, when people say, well, what about that? That focus, the focus for us is on capital allocation.\r\n\r\n\r\nAnd the reason that we made that decision is because that's our background.  That's  if I came to you and pitch you saying that I'm going to go in and take over the lubricant business and be an operator. You should run for the hills with your money. You shouldn't invest with me because I don't know anything about that.\r\n\r\n\r\nWhat is there in my history or tracker here to show you that I know how to operate that business better than somebody else and outcompete  the other companies in that space. But if I come to you and say,  Our plan is to continue buying SMBs  as they present themselves, following these characteristics and paying this multiple.\r\n\r\n\r\nI think that's an attractive investment thesis. Why? Because I have a background of 13 years with my partner of identifying those companies. We play in a space where multiples what's up. I was just gonna say the flip side would be, well, why not take those same cash flows and reinvest in the industry that you already know?\r\n\r\n\r\nRight. The lubricant space. Why not? Expand into other markets or buy other companies, roll up tuck ins, those types of things. How do you think about that? Like why not double down in those spaces?  Because I'm looking for at the moment, my best.  Risk adjusted return. So let's unpack that and let's say option one, my CEO comes and says, let's invest in this new line.\r\n\r\n\r\nLet's bring timing belts, for example, and grow the business. Well, due to the fact that we focus a lot from the beginning, pre acquisition for businesses that are heavy cashflow producers, that mean they don't have heavy CapEx. They're not super capital intensive companies. So also the growth of those companies isn't going to require a ton of reinvestment of the cash flows in order for them to grow.\r\n\r\n\r\nThe only industry we're in that does is the restaurant business. If you're actually doing new build outs, that does require capital. But even that's going down another way, but even the type of restaurant we looked at to buy was not one that was heavy capex. The types of build outs were pretty inexpensive.\r\n\r\n\r\nSo even if the CEO comes and wants to grow, which they do, and they are bringing, organic growth ideas, we can do those without committing. Large amounts of our cashflow. So now let's go into more. Why not do focus on a bolt on focus on an industry focus versus buying something new? My answer to that would be, of course we would buy a bolt on.\r\n\r\n\r\nWe have done it in the past. We would buy things in the same industry. If they become available and if the price is right, and if the management team is there, the issue is if I sit here and say, I'm only going to invest in industrial sales and restaurants going forward. That's it in Panama. Imagine I'd probably still be sitting here.\r\n\r\n\r\nThere wouldn't have been anything to buy or I would have been forced to pay a multiple that was way above what I was feel comfortable paying. Take this into the U. S. Imagine that you decided three years ago, you wanted to roll up HVAC service companies or four years ago and you enter in. We all know what's happening in that space and you're seeing where those multiples are going.\r\n\r\n\r\nIf you are just sticking to that principle. Line, then you're going to have to start paying up. Whereas we have the freedom to say, no, I'll look where I'm finding the opportunity. Cause it's, again, it's where can I find a company? I understand run by people I want to work with and pay a fair multiple. As long as I can find that I'm willing to put capital at work.\r\n\r\n\r\nLet's start with the first part of that statement. Where, so where do you find companies? Are you, where do we find companies? So I would say, and this is, and yeah. I say 90 percent of what we do is on market brokers.  What kind of we are now because of our size by cell. Oh, sorry. Go ahead. \r\n\r\n\r\nI'm not bids by cell. I'm not bids by cell simply because of our earnings rate. Like what we're looking for as far as like a minimum earnings for the company at today is at 2. 5 million and up. And I just haven't found that website to be excellent for those types of companies. Maybe I should be looking at it.\r\n\r\n\r\nWe use Axial. Okay.  Axial is a really good broker network where they are actually consolidating brokers and they're just sending them to us these opportunities. We've used generational equity in the past. We also have individual brokers that we've worked with either closing a transaction or simply working through maybe.\r\n\r\n\r\nUp to an LOI with them and they'll send us stuff that they have now because they know what we're looking for. Is that where you're at right now? And stuff coming to you as a, is that where you are now? Things coming to you as opposed to you going out and actively saying, Hey broker, I saw this online, I'd like to learn more about it. \r\n\r\n\r\nWe have a lot of stuff coming at us.  But it's not that it's proprietary. So I've found companies that set, send me in flow, but it's not like I'm the only guy they're sending it to. They're sending it to a ton of us out there. You know what I mean?  What is your box? That's what we continue to work at. \r\n\r\n\r\nWhat kind of business? When you say buy a box, what am I looking for specifically? Yeah. Like you said, minimum 2. 5 million EBITDA, right? That's a good place. Let's just take like the wide scope if you were going to click a filter. Right. So I would put. Minimum earnings, $2 million to start.\r\n\r\n\r\nBut the reality is we're looking closer to 2.5 to three, but I don't want something to like just miss, and it was actually a good company. So 2 million it would be in the us.  So continental us,  this usually is not gonna be on a filter, but it's something that if I see it, it's gonna be one of the things that I am immediately discard is if I see a company that's gonna be. \r\n\r\n\r\nI can just know by the industry is super heavy cash intensive. A lot of machinery type stuff, a lot of manufacturing type stuff. We're going to probably move away from,  and here's the issue on those for us is  generally people want a multiple based on EBITDA. So they're going to ask for a hundred percent ad back on their depreciation.\r\n\r\n\r\nIf depreciation is coming up on 30 percent or higher of net income. Let's imagine that you're adding back there, but I actually believe a decent part of that depreciation needs to be reinvested simply to maintain your current income levels. We're going to where the deal is going to fall apart is on valuation. \r\n\r\n\r\nIt's not that I don't understand the company or that I don't like the industry. It's that I'm going to feel I'm going to end up paying you a seven or an eight X. And I don't want to pay that for that business. That's where we have that divergence on those. So just from doing them enough, I used to chase those.\r\n\r\n\r\nI've at this point just decided generally it's not worth my time. Unless I see something very nichey about it. Sellers in that space don't understand that. They're not like, yeah, you're right. We, there's high CapEx depreciation expenses really high because of most sellers will simply tell you, Most sellers will simply tell you, Oh no.\r\n\r\n\r\nI bought all the machines. It's good to go. Yeah.  I know they'll tell you that, but I'm just saying like at some point they're not self reflective enough to say they agree or  I guess maybe they are. But I also, again, this is a numbers game. I got to get through  if I close one deal a year.\r\n\r\n\r\nIt was a really successful year. So I got to go, we're probably closing like maybe a third of a percent of the things we see maybe. So do I want to actually, I got asked that question one time. Do you keep a file on all the deals you said no to follow up, to see maybe if they come around?\r\n\r\n\r\nIt's no, because again, it's just a time issue. It's just a bandwidth issue. Like  I'd rather just continue looking at the new stuff coming in because I know I'll find it. I know it's going to come. We've got stuff on our plate right now. We're looking at to try to get under LOI. There's always in the U S there are so many opportunities for good companies to buy, but you've got to be out there looking.\r\n\r\n\r\nThat's why I don't understand the people who say I only do off market. Cause it's like, how are you seeing enough deals? Unless you're like, I'm talking like there are some of these private equity funds that are just massive that are just like, they're doing. Weekend trips for business owners every weekend, just to build pipeline for the day that guy decides he wants to sell.\r\n\r\n\r\nWe're not at that size to be able to handle that. So see, I've only ever bought businesses off market, but it's been because I was by cold outreach. It was because I was really targeted, right? You're saying geography is all of USA. I don't know how you get, I don't know how you drill down on that.\r\n\r\n\r\nWhen I would buy businesses, it was like, all right, I'm going to Boise, Idaho. I want to buy a home health company. There are only. 30 of them in that market. I'm going to reach out to each one of the sellers. I know what the sizes are. So it's like very targeted, which makes it much easier because I can have a tailored message to them.\r\n\r\n\r\nWhereas if you're just like, Hey, I'm looking for these size of businesses anywhere in the United States, in these markets, that's way harder to do off market. It's just way harder because it's not as personalized. What about sellers? Do you have a specific seller profile that you like to look for? \r\n\r\n\r\nI want them to stay on after the transaction. You do. Okay. So you, it's not like you're buying a retiring seller business. You want them to stay on. Why would I want them to stay? Why would a seller want to stay on? If they're going to market and they want to sell their business, how do you find a seller who's  wanting to stay? \r\n\r\n\r\nIt, I'll put it to you this way. Besides like the stuff that I just get discard and don't even look at the things I actually follow up on. It is the.  The main  filter that takes deals off the table for us. So it's the hardest thing to find is that management team willing to stay on. I'll give you a couple of examples from real life that have happened for us.\r\n\r\n\r\nOne retiree, he wants to retire, but he doesn't want to retire today. He's 57, 58,  he went through COVID. He knows how fragile the world can be.  He's made good money. He's got his assets, but he's talking with an estate planner and the estate planner saying, Hey, you have equity here in your business. It's worth something.\r\n\r\n\r\nAnd he literally, when he approached his broker said, I want to sell this company, but I will only sell it if they give me a five year guaranteed contract, because I do not want to retire before I'm at least 62. Well, that guy's been with us now going on, almost four years.  And my bet is he's going to stay an extra five after the first five expire.\r\n\r\n\r\nHe has, people have this image of retirement and then this process also allows them to work through it in the sense of, okay, let's build out a management team. Let's take some things off your plate. That's fine. But we've still got the guy who founded and ran that business.\r\n\r\n\r\nHe's still there overseeing that company for us. Do you second scenario? Yeah no. Keep going. I would say the second scenario is. Partnerships, this would happen twice. We've found  partners generally speaking. They're not founders. They are employees who bought out the original founder and they've been running the business maybe 10, 15, 20 years. \r\n\r\n\r\nAnd one of them says, I want to retire. This just happened for us guys, late sixties, mid to late sixties. I'm ready to retire partners, early fifties. I'm not shareholder agreement says, okay, either you buy me out  or we both sell. Well,  there's a lot to unpack there from the emotional of, I'm going to be responsible for all this on my own to the financial of, We've probably been living not only off salaries, but also distributions for the last few years.\r\n\r\n\r\nAnd if I go to buy him out, it's going to, in essence, be a seller finance deal, which is going to take all the dividends for the next five years. So my quality of life is going to change dramatically. Yes. When it's all said and done, I'm going to own the whole thing.  That's stuff that people have to deal with.\r\n\r\n\r\nSo we've had a couple of those where partnerships, they say, eh, you know what, let's just sell the whole thing. But the guys who are younger say, we still want to work. We still need to work. We're not making enough from this sale to retire. Therefore they continue. Like in having the whole, cause there are two options.\r\n\r\n\r\nBasically you can have the seller stay on and work with the seller. And Warren Buffett does this a lot where the companies that he bought, I guess at this point they're so big, it doesn't matter, but  the company that he buys, the seller stays on,  or you buy a company seller retires, and then you place somebody in management.\r\n\r\n\r\nWhy not find and place somebody? Why not? Work to develop that talent, get some MBAs who have a couple of years work experience and replace founders.  Because we're buying a company based on what it's done and I'm paying a valuation where all I need is for it to continue doing that for five more years for me to pretty much recoup most if not all of my investment. \r\n\r\n\r\nTherefore, and then you're, I,  and then I'm, then you're at a point where you could replace it more on the deal. Yeah. Yeah, I could, I could in year two also, or in year one, depending, but I just see going in to make that change is introducing a pretty large variable into my deal that  I'd rather not have to introduce, I'd rather be comfortable with who's running it.\r\n\r\n\r\nI'd rather just say no to that. Then  have to do that whole  take on that entire risk because there are companies out there  that we're finding. We're looking at one right now. We're going to one right now. Here's another scenario. This is a company owned by a much larger parent company. They are going to divest this asset.\r\n\r\n\r\nThe entire management team is going to go along with that divestment.  That's the deal we're working on right now. So that's another scenario where it occurs, and I'm just,  and all of our meetings so far with the management team, it's not even with the people selling it. I've hired Raymond James to go in and say,  this is what we're selling, this is how much we want.\r\n\r\n\r\nEither pay us or not do your due diligence, do your stuff, talk to our management team, they all know what's happening and we're simply divesting this asset. And for us, it's great. It's a company, the parent company probably makes whatever, 50, 60 million a year. They're selling a chunk of it that makes a four and that's what we're looking to buy, so they are out there, they do exist. I,  but you have to build for that system. That there's a whole other part of that whole delegated management that isn't as. Rosie, as it seems, it's you have to be willing to give up management decision making to somebody else and they will not do it the way you think they should all the time.\r\n\r\n\r\nAnd you have to be okay with that. And just get over it because that's a delegated management. I like that. Right. I like that framework though, that you have, which is well, if it's been successful the last five years, why would I want  to have somebody else run it?  Why wouldn't I want this, the person who's made it successful for the past five years, continue to run it. \r\n\r\n\r\nRight. And not five and not even just five years, we're talking like 30 years or 20 years or these are the 10 years of the people we have running these businesses. This is the people who have been there and done it. They've gone through economic cycles. They've gone through growth. They've lost brands.\r\n\r\n\r\nThey've lost key people. They've dealt with it. Operating a business is really hard. And I'm humble enough to know I couldn't do it better than they could. And I'm also smart enough to know that I don't think I can get some guy just got an MBA and put them in there and he's going to do it better than they could either.\r\n\r\n\r\nI respect the OG  operator of these businesses a ton to the point that I'm like, just don't leave. You just stay doing what you're doing. They will give you total freedom and decision making. Do they retain some equity for a second bite at the apple? No. Okay. They have not up till now. And I'll go through number one is they do get a profit sharing plan.\r\n\r\n\r\nSo part of their incentive is a, it's,  I call it a profit stream plan. Cause it's a typical terminology. It's more a distribution sharing plan. So they get a percentage of cash distribution sent to the hold co. Okay. Along with a very reasonable and attractive base compensation. So they are aligned in motivation with what we're looking for from the company.\r\n\r\n\r\nThat's number one. Number two is.  Equity, especially on a part for example, this new one we're looking at, they don't have any equity right now. So that one, no on partnerships, it's super hard,  even if when a partner is saying, I want to sell a hundred percent, if the other guy's going to roll, it's so hard to have the partner who's wanted to sell, not roll.\r\n\r\n\r\nIt's just, there's a weird dynamic there. You have a partner, you know how it is. It's just, it's it's just. This is weird dynamics. So it's been easier for us to simply buy a hundred percent  with this scenarios we've faced so far. That's not, I would be totally comfortable with somebody rolling equity.\r\n\r\n\r\nIt just hasn't in the moment, it wasn't the right thing to do. That being said, we are currently, my partner and I analyzing a stock  plan for them to be able to buy equity in the company going forward for specific. Cause we've had many people come and now mention that to us. One thing that we're dealing with right now is.\r\n\r\n\r\nDo we allow them to buy it in their opco  or do we allow them to buy it in the holdco? The holdco. And that's something which is super fun to think about because you would lean opco because well, the opco, because that's where they're driving results. Yeah. But I want them to be sharing our vision and our visions, the hold co it's not always their opco and also where the liquidity eventually will be is at the hold co level.\r\n\r\n\r\nAnd it's a lot simpler up there than it is down in the opco sometimes. So that's something we're working through right now. That's such a cool thing to debate. So like Chris and I  were, many years behind where you are. But the idea that we have is that at some point our individual operators can roll their equity into.\r\n\r\n\r\nThe whole co right. When, and if we feel like it's appropriate, et cetera. But I have a really good friend of mine who has a large company. They're like a 500 million holdco  and he's you don't ever give equity in the mothership.  He's he's just like the total other end of the spectrum.\r\n\r\n\r\nAnd I do respect it. Right. But it's a very personal question. Like how do you handle the equity compensation? It's anyways it's interesting. We have  our end goal is to go public for the whole co. So having minority shareholders at the whole co level is something we've already.  Surpassed mentally, that's right. So that wouldn't be an issue for us, but I totally understand your friend because I used to think that same way. And our Panama hold co for example, is still 50, 50. There's no one else in there. That one we're keeping almost just, it's a private. Business of ours that we built it's the U S hold co is the one that we'll have minority shareholders and we'll grow, et cetera.\r\n\r\n\r\nHowever, he and I have the majority of those shares, so we still control the business in that sense. But we're okay having minority shareholders. So I have some rapid fire questions for you. And then I want to go through maybe one deals. We have some time. What do you love about.  What would I do the whole co I  love investing, ma'am, that I love the intellectual game that is investing.\r\n\r\n\r\nI've always loved it. I shared this story recently of, I loved baseball cards, but what I love most about baseball cards was the Beckett price guide. I loved tracking the movements of my cards in this price guide. So I've always loved this. I love the stock market. I love investing. It's it's a passion, it's a competition, it's a competition.\r\n\r\n\r\nYeah, it's a competition and it's just also very intellectually stimulating to think about these things and try and see them from angles that maybe other people aren't seeing them or try and gain some insight when you finally get, get it when you have those kind of wow moments where the light bulb goes off, wow, they just feel really good.\r\n\r\n\r\nSo in that sense, I get to do what I want to do. Every day. Like I actually enjoy the process of analyzing businesses, looking at companies I'm also.  I like looking at different things. I don't think I wasn't built to do like maybe a rollup of one industry because I do enjoy seeing different industries a lot.\r\n\r\n\r\nThis morning I was with my CEO of my restaurant businesses and tomorrow I'll be meeting all day with the CEO of industrial sales. And then in the afternoon I have a call with the CFO of the USA going over tax issues. So I get to look at different stuff, all related to this company that we're building, but.\r\n\r\n\r\nAgain, intellectually, it keeps me tuned in and really engaged. Right. Yeah. I was expecting you to say that earlier when I asked you about why you decided to do the whole co versus just focus on one thing. And sometimes, I don't know, I've always felt like I used to feel like that was a bad answer.\r\n\r\n\r\nIt was like, well, I just like doing different things, but I lean into that. Now I'm like, no it gives me energy. It makes me excited. I'm a better  business person because I'm, I've got some variety and intellectual curiosity. So I love that answer.  Yeah. I think also it's important to not,  cause there still is a level of focus here.\r\n\r\n\r\nYou know what I mean? The focus is on, as we said before, the capital allocation, like not just, I'm going to do other things just to do other things. Like I say no to a ton of stuff. All the time people come and offer us want to invest in this real estate project. Nope. Do you want to take a minority stake in this?\r\n\r\n\r\nNope. You want to invest in the startup? Nope. You want to do a side hustle?  You want to go and be a big influencer? Nope. I don't do a lot of those things because. That isn't my focus. My focus is building a age. It's building our holding company. And within that holding company, I have enough diversity to keep me interested and keep me engaged.\r\n\r\n\r\nBut it's still it all is focused on that. Honestly, 98 percent of my net worth is invested in this company. It's all there.  It's awesome. I can't be more focused, so I have another question for you.  Lots of times real estate guys are jealous of services businesses. Cause they're like, Oh man, it'd be nice to own a business.\r\n\r\n\r\nAnd business guys are jealous of real estate guys. Cause they're like, man, I wish I had that real estate. It's just steady Yeti. I could depreciate whatever. What industries are you jealous of? Like when you say this back and you're like, man, it must be nice to be.  I am jealous of Dura software, Girdley's software Holdco.\r\n\r\n\r\nOh, really? That's what I'm jealous of. Yeah. Yeah. Because when I first heard him  tell that  company, explain that business at Holdco conference, I just went. Wow. I really wish I would have thought of that or had that circle of competence to put that together. Maybe because it's,  he brought together what I believe is one of our strongest things, which is the boring tried and true business with the history of producing cash flows  tied in with a software, especially, software as a service businesses, which I know are some of the best cashflow producers there are, because the most complex.\r\n\r\n\r\nPart of what we do is when the operations say I made a million last year, but they only have 300, 000 in cashflow. That's where it's like, red lights are going off. Sirens are going off. Something is wrong in this company. Cause they're not producing the cash flows. They should, and we've got to dig into there and figure it out.\r\n\r\n\r\nIt's either in their purchasing has gone off or their receivables have gone off. And we've got to figure that out.  And again, you always see the grass greener from the other side. I'm sure the software business has a ton of those issues. Also in a ton of other things I'm not aware of. But from my seat looking at it, I go, Ooh, that'd be such like a constellation software, that type of business.\r\n\r\n\r\nWow. I'd love to own one of those hold co's software focus. It just seems so sexy. Just seems awesome. I'm definitely not jealous of the real estate guys. I've done that business and that business is just not for me at all. Like hats off to them. We need it. We need people to keep developing and buying and doing this stuff. \r\n\r\n\r\nI hate debt. And those are just, there's every time I look at one of those presentations wait, but when do you pay off the debt? No, we're just going to refinance. Don't worry about it. It's Oh my God. I just I can't handle that. I couldn't sleep at night like that. So yeah.\r\n\r\n\r\nYeah. There's always money in the banana stand. But right last one, before we look at some deals, what are you obsessed with right now in general or in business? In general is there anything dude, it could be tennis. It could be your dude, I'm getting back into tennis. I'm just curious.\r\n\r\n\r\nLike what, if you have a free, like hour, what are you doing? What are you like? Okay. Okay. Honestly, right now that you put it that way, honestly, right now it's chess. Really? I.  Wanted to get good at playing chess, but it always seemed very  memorization. And of course it is to get to be a grand master or something.\r\n\r\n\r\nYou just have to just cause you're playing against this level of player. You got to memorize. I was like, I just don't have the dedication to really take that much time. But I got into backgammon at one point. And I actually had this app and what I learned about it is, Oh, you went for Wolf for Warren Buffett, huh? \r\n\r\n\r\nYeah. Like bridge. Right. So I started with backgammon though. And backgammon is if you just play it enough and an app allows you to do that online, cause you can just pick it up when you're ordering, just play it. And you play over and over and over. You begin to just see so many scenarios that you're thinking.\r\n\r\n\r\nGets better, which is the same as analyzing deals. You'd analyze thousands and thousands of deals and you can do it a lot quicker than somebody who doesn't. Well, what I'm finding is chess is very similar because there's only so many scenarios of these openings. So maybe I don't know the name of whatever the Casablanca ending or whatever they're called, right?\r\n\r\n\r\nBut you start to see the repetitiveness in the game over and over and over and over, and your brain just starts to pick up on it. So I've got this app. It's, I don't know, it's some like teacher chess teacher type thing. So he actually critiques your games. You can go through your games and see where you made mistakes and just keep improving on it.\r\n\r\n\r\nSo now, yeah, instead of, flipping through social media, if I'm on my phone and I'm not paying attention to somebody, I'm playing chess. That's what I'm doing. I love it. What's your rating?  I don't even know. It doesn't even have it on here. It's just, I'm just, no, you, anyone would crush me. I'm just, it's, I'm only playing against the computer for now.\r\n\r\n\r\nI'm not even playing live people. It's just this computer thing that continues progressing you through in the lessons of what you're learning and the different strategies of like end games and how to, control the center should reach out to John Matzner. Matt Matzner is obsessed with chess,  but he's good.\r\n\r\n\r\nYeah. He's I don't know about chess. Well, yeah, I'm terrified. He's yeah. You only get better by playing with people who are better than you.  All right. Let's let's look at a few deals. Then you just lose every wanting to play. Yeah. It's well, there's a reason second graders aren't playing against LeBron James. \r\n\r\n\r\nYeah. I was going to say, yeah, you don't get better basketball playing as LeBron, better than reason. All right. So I'm going to share.  I'm going to share my screen and I just thought this would be fun to go through some deals. So I got this by sell up. The first thing I want to do is I want to go through some filters with you.\r\n\r\n\r\nSo  I originally set a million to 3 million in cash flows because otherwise you'll get businesses that are doing like 50 million a year. But is this, I'm going to actually,  I'm going to say two, two to 3 million. Well, and then any of these, do you want to see any,  let's just see in the last 30 days and we'll hit apply.\r\n\r\n\r\nAnd let's just scroll and see if any of these catch your eye.  So we've got this one large and growing international trucking company. Cashflow of 3 million asking why isn't it? No. Yeah. That's an immediate no for me because trucking is going to be massive capex.  Really? Massive capex on a, yeah. Okay. Cause you've got to get the trucks, I guess themselves over and fix them and this and that.\r\n\r\n\r\nSo again, the EBITDA on that, I would imagine that 3 million,  he could have it in cashflow. But not free cashflow. I bet he probably has it in operating cashflow. That's just, again, this is my gut telling me. That's your guess. Also the trucking industry in general, I just feel is  it's just highly competitive.\r\n\r\n\r\nIt's really hard to differentiate yourself, to get a moat on that, to actually go in there and say they're doing it better, that they're going to have these benefits. Much better business economics. There is a specific niche in trucking. That's much more like trucking brokerage where you don't actually own the assets.\r\n\r\n\r\nYou're more of the middleman putting them together, that type of company for that industry, I think I would look at this size, but these guys, from what I'm seeing, it's more that they're actually. Owning the trucks. Yeah, they've also got their 7 million of real estate available. Then you got to see if they're even charging market rate rents on that.\r\n\r\n\r\nSo probably it's a quick no for me. Okay. All right. All right. That's a quick, that's a quick no. It's obviously you've looked at trucking before, so that's yeah. We're going to skip this restaurant. I don't know why you would ask for 500, 000 if it's cash flowing 3 million. So it's there's,  it's the deal of a lifetime, man.\r\n\r\n\r\nYeah.  Okay. What about this one? A leader in high rise restoration in South Florida, 7 million asking two point I am pretty against, and I'm going to be like the worst person to interview for this, but this is awesome. I do this just so we know, like I say no to almost everything.  So very successful people.\r\n\r\n\r\nIt's okay. But again, I've been doing this for a very long time and I know it doesn't work for me. I'm not a big erect construction guy. Okay. Okay. Okay. I'm not a big direct construction guy. I,  those businesses from when I've looked at them, if you actually look at like the financials on a construction firm, they can be,  and when I say the term misleading, I'm not saying misleading, like the owner is trying to mislead you.\r\n\r\n\r\nI'm saying they're actually being misled themselves. Simply the way that construction works and that it's project based and you don't really know where your profits are going to be until after, and you can have retained earnings from previous projects and you can have holes that you have to fill. It's just tough to look at financials and actually find A real consistency.\r\n\r\n\r\nI'm sure. Okay. So what about this? Very successful in construction. Yeah. What about this? It says they're seeking a strategic partner or equity group with sufficient resources to fully exploit its organic growth and profit potential. Is that just like screaming red flag for you? Cause you're like, yeah, of course they want a bunch of cash. \r\n\r\n\r\nTo sink into these? Well, no, actually, I love the term partner and equity group, like the partner part of it for growth. I actually, that will make me interested in a deal because that implies that management's going to probably be staying on, which is one of my key filters. So knowing that actually would lead me more into it.\r\n\r\n\r\nBut I would definitely want to ask them.  Is that a cash out or a capital injection? You'd be amazed how many times that exact sentence, when you ask them, it's all going for a cash out.  And it's wow, so you needed it for growth, but we're not investing any money into it. It's also surprising to me, interesting that type of company would need so much capital to grow because it's a very service oriented business and a lot of payroll growth to take on more projects.\r\n\r\n\r\nI would have to see, especially 'cause they're not, yeah, that's a good, it doesn't seem like they're really.  Like government type contracts, you're going to get paid late. And maybe you're going to need that money to carry you over in the contract in the beginning. I'm not seeing that.\r\n\r\n\r\nSo just the narrative there isn't really matching. Those would be maybe my questions that I would ask if I was going to look at it.  But they said, and maybe that's a better way to do this. Instead of just saying no to everything you show me, I can tell you, these would be the things I would be asking the broker, the seller to get my head around this deal.\r\n\r\n\r\nThat's it. I think that's a really good one too, but they do say they can reach 100 million within three years though. So  yeah, they said it. So they, yeah. They're going to do it. That must be true. I bet they have an Excel to back it up also, but Oh, dude, here's one. This is a, yeah, they have an Excel.\r\n\r\n\r\nThey got the, they got an Excel model. It looks really good. I always Chris and I joke about that. We're like, Oh, dude, you found my deal. What is your. When does your non compete end so we can buy this now? Two more years. Let's see here. Okay. Medical records billing Southeast. So it'd actually be fairly, well, not fairly close to you, but 2 million in EBITDA.\r\n\r\n\r\nI absolutely love. Okay. Give me a second here. Give me one second. I love this. Okay. Okay. You're going to look at that and I'm going to say why he loves this deal. He actually owns a business that does  back. And I'm going to, well, that's, and that's going to be my only caveat to this. I love this deal because I own this industry in Panama and in Panama, it is a really solid business.\r\n\r\n\r\nThis type of company, if it's like the one I have in Panama, and I imagine it is as far as the service side of it is,  it's a massive cash flower. So if that thing is making, what are they saying? The EBITDA is 2. 8 million. Like your cash 3. 8, 2. 8 million, 3. 8 gross. 2. 8. Maybe that, oh my gosh,  it must be offshoring a bunch of this. \r\n\r\n\r\nYeah, that to me. And again, hi. So I usually on net margins I've tweeted about this. Like I, I look for five to 15 percent because in general, an SMB in real life, that's what you're going to end up at when you take account depreciation and everything in there. Not like some adjusted EBITDA number.\r\n\r\n\r\nThis industry. I would believe it would have a much higher net margin. I wouldn't be surprised. It's sitting like closer to 50%, let's say 45%. That's where we run it in Panama. Yeah, this is this is even higher than that. This is 65%. So that is a little wonky to me, but I wouldn't mind getting into the details of this to understand it.\r\n\r\n\r\nObviously there's the big fear right now that. This whole business is going to go the way of AI, or it's just all going to get digitalized out. But again, if I'm only saying three to four X, I think I can minimize my risk. Here's some things that stick out to me. Company has run absentee out of state.\r\n\r\n\r\nCurrently that's always just a red flag to me. Whenever, like someone's using the word absentee, I'm like, all right.  I just, I usually don't believe it. There probably are much more involved. I think my big issue there when I hear that is that means I don't want to be involved after the transaction. \r\n\r\n\r\nGood point. So if they're running at absentee, they don't want to continue being involved. That, that basically just means I'm retiring, buy it off me. Therefore, I would need to go in and understand who's managing it for you then day to day. Cause if they say absentee and I've got a CEO full time and this is a highly qualified person that does work for me. \r\n\r\n\r\nWhat I was going to ask you is let's say that the CEO was the owner and they sold, but you've already got a business in the space, would you still consider taking it on? Because you could roll up into the business that's currently run or no, I,  I would not only because of the size of this business is larger than my business in Panama.\r\n\r\n\r\nObviously the market in Panama for this is much smaller, so I wouldn't,  I don't know if I would feel confident. Allocating that much capital to the management team I have down here, running it. Does that make sense?  Totally. Here's one of the things I like the much bigger fish, but I'm when you're, but when you're non compete expires, I'll hire you to  partner on this one, man.\r\n\r\n\r\nI love the fact that they have proprietary software. Now the problem is what does that mean? Is it an Excel spreadsheet or is it actual software that you've created and developed? I'd also want to know their contracts Those are so important, whether or not their big customers can get in and out of the contracts.\r\n\r\n\r\nDo they have a term on those? Are they months a month? What, what do they look like? Right. And I think also it's just, look, this is the first filter, right? This is just, am I interested enough to click, send me information basically. And then this one would, I would say yes, obviously then you're moving into all those secondary filters.\r\n\r\n\r\nLike how many clients do you have? What's that diversification look like if this gets sent to you and it's 70 percent is one  Of their business, then that's going to be a no because you have customer concentration risk and you're going to have to pass on it. There's a lot of things that can still take it out of the running after, but there's enough there for me that I would look at that. \r\n\r\n\r\nAwesome. I love it. Well, dude, this has been this has been a ton of fun. Where can people. Find you follow you, obviously you're on Twitter. Is that the best place? Yeah. At Rafael Quinn for Twitter, you can go to RafaelQuinn.Com is a kind of website blog that I put together, which is basically all my mid to long form posts are searchable, their index there.\r\n\r\n\r\nSo I don't know. I write about building a hold co and investing and if you like real content, if you like real content that is valuable, that will help you actually build a hold co Rafa is probably the best follow on Twitter. Thanks, man. I know. I know you don't want to be an influencer, but it's going to happen. \r\n\r\n\r\nI enjoy the writing process a lot. I enjoy it. I like talking about it. So it's fun. It's obvious you're passionate about it. Well, this was rad, man. You have a good one and we'll talk later.  Thanks, Nik. Take care. Okay. See ya.",
  "metadata": {
    "duration": "",
    "date": "2024-05-10",
    "platform_source": "Google Drive"
  }
}