{
  "episode_number": "22",
  "episode_title": "Why This Franchisor Turned Down $1M/yr and Bet On Himself with Aaron Harper",
  "guest_name": "Aaron Harper",
  "business_name": "Rolling Suds",
  "transcript": "﻿Hey, what's up guys. Welcome back to another episode of Nikonomics. I of course am your host, Nicholas Helusky. And in today's episode, we are getting wet. And we are getting wild because we have Aaron Harper, the owner and CEO of rolling suds with us today on the podcast and rolling suds is the first national franchise of power washing companies that has grown from one location to about 187 locations in 26 different States in less than two years.\r\n\r\n\r\nNow, the crazy part is this isn't even the first time Aaron's done something like this. Aaron was responsible for the growth of chemdry and the growth of patch boys into the largest brands in their space in the world. From there, he also went to the second largest conglomerate of home services brands in the world and grew them to 12 brands, 47 locations in 55 countries.\r\n\r\n\r\nAnd I'm tired just saying his resume. Well, in this episode, Aaron not only tells us the things you'd expect from a franchise or like the size of territories, how much they cost, what types of revenues you can expect in the first few years, but he also shares some insights that honestly I didn't expect.\r\n\r\n\r\nLike his ambitions to be the one 800 got junk of his space and the perfect personalities for franchising He also shares the personalities that should not get into franchising spoiler alert He tells me I should never get into franchising says he tells it to my face And you need to listen to the end in order to hear his reasons for who should get in and who should not get inTo franchising if you're at all interested in franchising if you've ever thought about it or contemplated it Don't skip this episode.\r\n\r\n\r\nThis episode is for you. And if you liked this episode, like subscribe, share, you know what to do. But with that, let's just hop into the show.  All right, Aaron, super stoked to have you here today. Mainly. I'm just jealous. Cause you were on Chris's podcast and I saw how much freaking fun you guys had. I'm hoping to fly out to Tennessee next week too.\r\n\r\n\r\nOkay. Yeah. Yeah.  It's part of the deal. It's part of the deal. You have me on your podcast and then you come to Tennessee. It's just part of it. If anybody doesn't know,  Chris had Aaron on his podcast. Aaron said we power wash a house, a 3000 square foot house in 25 minutes. He got lots of comments saying that's not possible.\r\n\r\n\r\nAnd so Chris actually flew out to Tennessee. And filmed live stream them cleaning a 4, 200 square foot house. I think it was in 22 minutes. Was that right? Yeah. 4, 825 square feet. We did it in 22 minutes with two guys, 22 minutes, 48 on your freaking square feet. Anyway, I loved that Chris flew out there.\r\n\r\n\r\nI think that was so awesome that you invited him out and taped it. I watched the video. The men, your guys were hustling. It was so good.  Oh, and they, I mean, if it was a 3000 square foot house, it would have been done in 15 minutes. Oh, absolutely. Yes. I mean, 4, 800 square feet in 22 minutes was like, okay, even though they were hustling, like you, yeah, that's totally doable.\r\n\r\n\r\nAll right. So  for those listening, Aaron, what is your business and what do you do?  I run a franchise system of a brand called rolling suds, and it's a residential and commercial power washing company. And we have 187 locations in 26 States.  And power washing, you're talking about cleaning commercial buildings, homes, the whole gamut of residential and commercial buildings, basically, if it is a structure and it is outside, we can clean it. \r\n\r\n\r\nOkay.  How did you get into that? Nobody dreams as a little boy, like, I want to get into a power washing franchise.  How, like, what's your background? Tell me your story, kind of how you ended up here.  So my background is in franchising. So I've been involved with helping two brands become the largest brand in the world in that industry while I was there.\r\n\r\n\r\nSo carpet cleaning, then drywall repair. What was the carpet cleaning company? Chemdry.  Oh yeah. I know the, I'm pretty sure I know the franchise you hear. I'll share his name with you after, maybe, you know him.  Yeah. Yeah. Chemdry is one of the largest brands in the world. Very established carpet cleaning concept.\r\n\r\n\r\nAnd then the Patch Boys was the drywall repair brand. That one was effectively a turnaround because the company I worked for acquired it, and there was no management team in place with a hundred locations.  And, and they were like, Aaron, here you go. And, uh, yeah, so we had to do a lot of work,  to turn that brand around.\r\n\r\n\r\nAnd then in two years launched 223 locations in two years, and they all opened and were, uh, profitable within the first three to six months.  Some within the first two weeks, depending on the operator. So that's when I started getting involved on a thought leadership level in the franchise space. Because that very rarely happens.\r\n\r\n\r\nAnd then I was helping build the second largest conglomerate of home service brands in the world.  And we built a company to 12 brands, 4, 700 locations, 55 countries, and had the job offer of a lifetime. At that company, they wanted to pay me about a million dollars a year to franchise a business for them. \r\n\r\n\r\nAnd I was like, no, thank you. I'll go do it on my own. I'm sufficiently intimidated and insecure. So congratulations. What drew you to franchising? Like why work in the franchise space? You could have worked in any corporate setting. What is it about franchising? You liked it, I love the idea of helping people become business owners, as you know.\r\n\r\n\r\nAnd as I know, now that we're on the other side of that, like, Business ownership is hard, it's scary, it's lonely. It's not for the faint of heart, but when you have a franchise, you have less risk, assuming you find the right brand.  Why do you have less risk?  Because you have a community of people, right?\r\n\r\n\r\nSo you have a bunch of people who are doing the same thing in different markets. You have proven systems, proven models. You have help with marketing, call center, insurance, recruiting, help equipment, trucks, like. All the stuff that would take potentially years to figure out, we've condensed down into a training program and a good franchise, basically, you've heard people probably say this, like a good franchise turns years into months and months into days and days into hours.\r\n\r\n\r\nSo you're paying for something. And you have an ongoing royalty for that service, but you're skipping years of trial and error and you're getting effectively to scale faster. And so you're using one form of leverage, which is capital to get another form of leverage, which is time.  So essentially the franchise model is  they create the playbook,  they have the branding, they tell you everything exactly step by step how you launch, how you manage what the systems and processes look like, maybe what your tech stack is, they just need.\r\n\r\n\r\nA trustworthy, hardworking entrepreneur who's going to execute on the vision of the brand. And then they share in the upside with equity with that entrepreneur. Was that right?  They own a hundred percent of their business. Kind of. They own a hundred, a franchisee owns a hundred percent of their business.\r\n\r\n\r\nThey just pay a royalty to license a trademark and business and get the support that they get  for the industry. And you can talk about rolling studs specifically if you want, what is that royalty? What does that look like? What's the percentage that they pay?  It can range anywhere from five to 12 percent of revenue. \r\n\r\n\r\nI think McDonald's has their franchisees, they have to purchase food through their distributor.  Yep. Does Rolling Studs have a similar setup where it's like, hey, you have to purchase your products through X, Y, Z? Equipment. Yeah. So you purchase your equipment through an approved supplier. Who is owned by my partner,  but the equipment that you buy, like our trucks, are proprietary, we're power washing, as you saw in our 4, 825 square foot house, 22 minutes, we're doing five stories from the ground.\r\n\r\n\r\nWe've done 135 foot water towers. We keep a thousand feet of hose on every truck. So these are heavy duty. It's not your average power washer,  but you can't buy that equipment anywhere else other than rolling suds. We build the trucks ourselves, so you literally can't get that build. And it's taken our founders 34 years to figure out that it's that process.\r\n\r\n\r\nIt's that truck, it's that equipment, and we have a lock on the manufacturer. So it's literally completely proprietary. So yes, there are different ways that a franchise or makes money. There's distribution models, there's royalty models, there's equipment leasing, there's all these different things, but the point is to create a model where the franchisee can be profitable, because without profitable franchisees, without franchisees who have a model to execute on that can get them to an ROI in a reasonable amount of time, Then the franchise or model doesn't work because we make money when franchisees bring in revenue and want to continue to reinvest and grow their businesses because it's working.\r\n\r\n\r\nOne of the things I recently learned about was Chick fil A's franchisee model. Yeah. And I realized like the franchisees, they don't own the franchise, right? They're compensated. Well, they have a revenue sharing plan, but if they ever wanted to leave, they don't have a franchise to sell. They don't have a business to sell.\r\n\r\n\r\nAnd Chick fil A has rights to kick them out at their own discretion. What does it look like for rolling suds? Like, so I know that rolling suds, you guys own as a franchisee, I own the business. I'm assuming though, there are some checks  and balances in place where, Hey, if you've got an operator. Who's not. \r\n\r\n\r\nRepresenting the company. Well, they're not doing what they're supposed to. You can kick them out or what does that look like? Yeah. If a franchisee is doing something egregious, they stop paying their bills. They start offering services that are not approved. They use the wrong equipment. They use the wrong logos.\r\n\r\n\r\nThey do anything else that can otherwise harm the brand and therefore other franchisees in the brand who are doing things the right way. There are measures written into our franchise disclosure document that allows them to.  They're effectively defaulted on their  ownership of that business. So like, I always tell people buying a franchise is not for everyone.\r\n\r\n\r\nBeing a franchisee is someone who likes systems and processes, doesn't want to create them, um, themselves. Like I would be a terrible franchisee. I can tell you would also be a terrible franchisee. Chris would be a terrible franchisee. Like it's like, and I hope you don't take that offensively because it's not offensive, no, if my wife was here, she'd agree with you.\r\n\r\n\r\nIt's very much like, give me the playbook and I'll execute it versus like, I'm going to go create my own and I'm going to be creative and I'm going to try new things. I'm going to switch the logos around or I'm going to try different marketing strategies. Like it's like, no, you use these approved vendors and it works and you're going to have a predictable result.\r\n\r\n\r\nBut that's because we're doing this and we have, we're in 26 states, you know what I mean?  So if I'm a franchisee, I buy in, are you able to share what it costs to buy in to a franchise?  Yeah. Absolutely. Yeah. So our franchise fees, 54, nine, and that's for about a quarter million people that are protected. So 54, 900 on top of that, you're gonna have to pay capital expenses to get the vans and the trucks. \r\n\r\n\r\nRight? So we bring in multi unit owners only. So what I told you is just the franchise fee basically that you pay to us.  So we do a minimum of two territories and then the franchisee needs to have the capital for the second truck in the bank and then they need to buy the first truck. So it costs roughly  150 or so to open the first territory and then another about 150 or so to open the second territory because you're going to buy the truck, you're going to have working capital, you're going to have marketing costs, you're going to have upfront costs.\r\n\r\n\r\nSo for two territories, a franchisee is going to need about 300 grand plus. 54, 000.  That includes it all.  That includes it all. And based upon our franchise disclosure document, that's current right now in 2024, you're operating on a 30 to 40 percent EBITDA margin once you get up to multiple trucks based upon our affiliate location.\r\n\r\n\r\nThat's been doing this for a long time. So what I did is I said, all right, wow, tell me what one truck does,  because it's easy to replicate one truck. It's hard to replicate a 34 year old business and all the nuances that go into it. But one truck is just efficiencies, it's labor, it's leads, it's conversion rate on the leads.\r\n\r\n\r\nIt's like, it's rinse, repeat. I can do that thousands of times across the country. So a truck does, if it's operating at full capacity in a Northeastern market, based upon our franchise disclosure document now in 2024, 422, 000 a year in top line revenue.  With one truck, that's the max a truck can do. Or is that like in the Northeast that's in the Northeast,  that's crazy.\r\n\r\n\r\nThat's 205 days out of the year.  That's not Florida or Texas or North Carolina or  Alabama or New Orleans. Like it's, yeah, it's, uh, you know, so  it's a great model.  So if I put in 150, 000, let's just, I know you have to sell multiple franchises, but let's just say one location, 150, 000,  what's the typical timeline until I get break even?\r\n\r\n\r\nAnd what's the typical timeline until I get to those 30 percent EBITDA margins of 20, a year?  Yeah. So our development schedule.  Meaning when you're going to open the other territories that you purchase. So I know you're talking about one territory, but we don't sell one territory because the EBITDA margins  aren't the same on one track in one territory.\r\n\r\n\r\nCause you have a ton of fixed expenses, like a flex warehouse space and insurance and stuff that. As you got all those costs stay the same, right? So  if you buy three territories, which is what most of our franchisees do, you need about three 50. You are going to get up to three trucks. Like the development schedules within 18 months, we're opening three trucks, like  come hell or high water.\r\n\r\n\r\nWe're opening three trucks and we're blasting marketing and development with those three trucks.  So three trucks  times 422, 000 a year.  Is 1. 2 million. 1.  2. Once you have three trucks, those costs, those fixed expenses like the rent and those other things have stayed the same. And so you're going to be closer in the range of those 30 to 42 percent EBITDA margins. \r\n\r\n\r\nSo you're operating at  a 300 to 400. Thousand dollar cashflow  under those assumptions based upon our original affiliate location that, that, which is the data that we put out. Now, I want to be super clear to anyone listening to this. We are a new brand. I raised capital and acquired the franchise rights to this business in January of last year.\r\n\r\n\r\nWe started franchising end of February.  So just to be a hundred percent crystal clear with those who are listening, this is based upon our founding location. We do not have a franchisee that's been operating a year.  July will be when our first two franchisees hit a year. But what I can say is that the franchisees are on track for the development schedule that we've built in, which is exciting because they're adding second trucks, they're buying all that kind of stuff.\r\n\r\n\r\nSo, yeah. How do you go about finding customers? Is that locally? If I'm a franchisee, am I going out pounding the pavement or is rolling suds running national marketing campaigns? What does that look like?  Yes, we have six different marketing agencies that generate leads for franchisees. Two of them are outbound commercial marketing companies.\r\n\r\n\r\nWow. And then four of them are inbound residential marketing companies. And we turn those marketing companies on before the franchisees go to training.  Then we teach the franchisees how to estimate, give proposals.  And for an entire month prior to them going to their in person training, they are required from 9 a.\r\n\r\n\r\nm. in the morning till 5 p. m. at night for 40 hours a week to do business development, to sell as much as they can of the calendar before they even go to training.  How do they pay for the marketing expenses  out of their capital that they paid us up front in addition to the working capital that they have within that 300 as well, but is that part of the franchise royalty fee?\r\n\r\n\r\nOr are they paying an additional marketing?  So, and I think this is a misconception with some who think about a franchise and what a franchise does. A franchise is essentially an aggregator of suppliers that provide support to franchisees  and very rarely is a marketing company themselves. Okay. And in fact, it's not great if you do have a franchise or that is a marketing company.\r\n\r\n\r\nBecause I hold marketing vendors accountable, and I have leverage to get franchisees discounts, and if they don't perform, I can fire them. Whereas if the franchisor has in house marketing, truly in house marketing, the only way they'd be able to fire the marketing company is if they closed the division.\r\n\r\n\r\nUh, yeah. And it's a lot easier for us to get rid of a supplier than it is to close a division of a company. So all of these vendors I have worked with before, or our founding location has worked with before, and have proven to be  that they work. So the franchisees pay them directly basically.  For people who are looking at rolling seds. \r\n\r\n\r\nIn particular, what's a typical profile of that individual? Are they  long history in corporate? Are they entre serial entrepreneurs?  Who's your like typical franchise? I know that's like a broad question, but if you could rattle off, I don't know, a couple of characteristics. No, no, no, no. I've done a lot of thought about this.\r\n\r\n\r\nSo I definitely, it's a great question. So I'll start with, we are only looking for people that want to go all in and build a massive business. So like you're, I want to do a side hustle and try pressure washing business and see how it goes and keep my job full time. Not our, not our buyer.  And that's okay. \r\n\r\n\r\nIt's just not our franchisee. Our franchisee is usually coming from a relatively sophisticated background relative to. Powerwashing, right? Like they, we have franchisees who have led 50 million raises as the COO for a startup. We've, we've got franchisees who have had nine figure exits who raised 20 million.\r\n\r\n\r\nWe just signed up our largest fast signs franchise about two months ago. Fast signs is a massive sign franchise brand and his business does 42 million a year. We signed up one of the best poker players in the world. So we're bringing in like very highly esteemed individuals who are really well capitalized.\r\n\r\n\r\nThey don't need money out of the business for a while. They're, they typically have much more than the minimum of 300 and higher net worth, but they're in this to, to build a billion dollar company. And we have an opportunity. To really, truly revolutionize and an industry that is highly fragmented. And, and I know that sounds like very high and pie in the sky, but there's no.\r\n\r\n\r\nIt does. There's no national competitors  to us. Like  we're the first sophisticated national player in the space. Does that worry you at all? Let's say you start getting some traction.  No, no,  no. It was actually part of the reason why I chose this business. Cause I many, like a lot of people listening, I'm sure have looked into entrepreneurship through acquisition, or they're looking for business to buy.\r\n\r\n\r\nLike I did the same thing. I looked at two dozen different businesses.  And one of the things I was looking for is I wanted something where there wasn't a national player in the space yet. No national franchise leader. I'll just use an example to drive the point home. 1 800 GOT JUNK in the early 2000s did not have any national competitors.\r\n\r\n\r\nThey paved the way for college hunks hauling junk, junking, junk luggers, like J Dog Junk, like all those brands that you've heard of. 1 800 GOT JUNK was the first and they did the pathway for that. You combine college hunks and all those other brands I just mentioned, and  1-800-GOT-JUNK is larger than all of them.\r\n\r\n\r\nLiterally all of them like combined. Really? Really? Yeah. They do a billion dollars in system-wide sales annually. 1 billion.  They have a franchisee that does a hundred million dollars.  Just one franchisee. Just one. One. Just one.  Holy. He's got a thousand employees. He has 10 markets. Him and his business partners do a hundred million dollars a year,  but they wouldn't be where they're at if they weren't first. \r\n\r\n\r\nThey just want it. Uh, so you're betting on like a first mover's advantage by going into the 100 percent hour washing. There will be people that will try to follow.  Yeah, there will be people that try to follow, but we'll already have 350 units on the road and we already have, and the equipment that we have is more sophisticated anyways, and they can't go buy that equipment. \r\n\r\n\r\nIt's, and then the process that we use is proprietary. So there's a moat to cross in addition to like. Just the sophistication of a franchise brand.  So I agree with you that franchises are the safest way, safest route into entrepreneurship. If you're going to buy, if you're going to buy something, I think starting an agency business is probably the safest way built around a skill set that you have, but that's no capital necessarily required.\r\n\r\n\r\nBut if you're going to buy something, a franchise is the best way to go. What do you think are  Like the biggest pitfalls in a franchise, like if you are looking at franchises, like you said, Nick, you wouldn't be a good franchisee. Chris wouldn't be a good franchisee. What do people maybe not think about when they're looking at franchises that they need to be aware of as potential downsides,  a potential downside would be that they have to follow the system.\r\n\r\n\r\nAnd they have to be comfortable with that. And that is an upside for the right person, and it is a dramatic downside for the wrong person. So if someone is super, like, innovative and creative and wants to, like, tinker and try and train and build and, like, all the stuff that I personally love doing, I know you love doing, like, that, that, that person shouldn't.\r\n\r\n\r\nBuy a franchise, but the person who's like, I have executed the playbook at every company that I've worked at. And I've rose up the ranks and I've hit a ceiling at every single place that I've worked at and where I've started a business before. And I didn't like the creating part. I just liked the managing and the executing part.\r\n\r\n\r\nLike, I Those people would be phenomenal franchisees. Another potential downside  is you're, you have to find the right brand. And I'll be the first, I've been in the franchise industry for years. There's more bad brands than there are good brands. And that's something with the advocacy that I'm doing around responsible franchising.\r\n\r\n\r\nI'm trying to change. But like being a franchise or as hard, like it's not an easy, intuitive thing. And coming from the background of franchising, coming into power washing, that's going to be a very different opportunity for a perspective franchisee than if I was a power washer and I decided to try to franchise my business, it'd be completely different.\r\n\r\n\r\nAnd it'd be a much higher risk to be honest with you. Chris and I looked at a franchise or just cause we've been thinking about some businesses to buy that we might be able to leverage. Our audiences and I had a conversation with you about it. And that was the one thing that you really brought up was like, look, when a franchisees sign up, they're expecting and should expect a level of support.\r\n\r\n\r\nAnd so if you can buy a franchise order, but if they don't have that support, you're going to have to sink as much money into that as you would have just starting one up from scratch. So you just have no idea what that brand looks like, what the reputation is like, what the support looks like from the outside and how important it is for, you The franchisee success.\r\n\r\n\r\nI think that's a really, that's a really good perspective.  I got some rapid fire questions for you. You ready?  Yep. I'm ready. What do you love about this business?  I love that. It's like simple and dirty and easy. \r\n\r\n\r\nLike we're spraying water and soap on the side of a building and then we're rinsing it off.  That's it.  That's so true. It's funny. I do a lot of, you know, do yard work and there's some yard work that I hate doing.  But man, my 10 year old, I'm trying to get him to do more and more yard work. He sees me pressure washing.\r\n\r\n\r\nHe's like, Oh, Hey dad, can I help? And I'm like, uh, no, I want to do this. You know, there's something like, there's just something gratifying about watching it. You know what I mean? You're, you're anyways, I agree with you.  What do you hate about it?  What do I hate about it?  I'm going to speak from the perspective of the franchise war side versus running a power washing business because I, that's what I can speak to.\r\n\r\n\r\nI hate watching franchisees struggle.  That would be hard, right? Because you're not necessarily part of the deal on the company.  What keeps you up at night? What are you stressed out about right now?  I am in the process of delegating pretty much everything within the company. And that is the scariest thing I think that I've had to do as an entrepreneur.\r\n\r\n\r\nSo I hired a brand president.  I hired a chief development officer. I have an executive assistant. She's in my email all day long. I'm training the brand president to run the company. I've let go of sales. So I went from  fully involved, like 180 hour weeks, essentially doing all the sales myself and mentally just bogged down  to a level of clarity that is  calming, but like nerve wracking. \r\n\r\n\r\nWhat's scary about it?  Well, have you read Traction by Gina Wickman or do you know EOS? Yeah, yeah. Okay.  Letting go of the vine.  Letting go of the vine is like, I can sell and recruit franchisees better than anyone in anyone. It's my company. Like they're buying into my vision. And now there's going to be four people  that replace me.\r\n\r\n\r\nI signed up every hundred, all 187 of those locations. I personally walked through intro call to. Signing the franchise agreement.  And now I just have to step back,  watch someone else do it, provide support. Be a cheerleader. It is, it's a different, it's a different skillset for sure. I've never scaled a company as big as yours.\r\n\r\n\r\nI've run 30 million companies that I had. And when you scale,  you have to hire people that can do certain functions that you can no longer do. And some of them you love, and some of you, some of them you don't love.  It's hard to find people that are as good as you are at recruiting and retaining, but I have no doubt you're going to be able to recruit and retain really talented, high level executives, just because you have that charisma.\r\n\r\n\r\nPeople want to buy into your vision in the same way the franchisees did now your executives. Well, so anyways, I get the stress, but I'm also very optimistic for you.  Thank you. Yeah, I have, I'm fortunate in the sense that I do have a brilliant, incredible leadership team. I have a really good VP of marketing.\r\n\r\n\r\nI have a chief development officer. The brand president is incredible. The executive assistant's awesome. So feel very good about where we're at, but it's still scary.  All right. So. I love this question.  Real estate guys are jealous of business guys because they're like, Oh, cool. You have cash flows and you can grow that thing.\r\n\r\n\r\nIt must be nice to have a business and business guys are jealous of real estate guys because  it'd be nice to just have a piece of real estate that spit off cash. I don't have to worry about it's all, you know, going to appreciate and value every single year. All of us have a grass is greener mentality in some form or fashion.\r\n\r\n\r\nWhat industry or business type are you most jealous of right now?  Ooh, that's a good question.  I'll tell you mine first. Yeah. Go for it.  Commercial real estate.  I look at those guys and I'm like,  Commercial real estate is just something I'm so jealous of because there's so much demand right now for industrial space in particular,  that it would be just so nice.\r\n\r\n\r\nLike you just buy a frame, you let them do the build out, they rent it from you. It's almost like a ground lease to a certain extent. Anyways, that's a business I'm really jealous of. I've actually thought about that. And I have a buddy of mine who's like, he's been in the home services like space for a long time. \r\n\r\n\r\nAnd he's like, Aaron, wanna help me raise like 200 million and we'll go buy and build like contractor garages all across the country. Like he just casually asked me that three months ago. Yeah. And I'm like,  I've got a lot going on. That's a pretty big ask, but maybe let's revisit in a few years. He goes, I know you could get the money though.\r\n\r\n\r\nI know.  I'm like, yeah, I know. I could get the money too. But like.  Do I want to go become like this real estate contractor garage tycoon like I don't know like I know the money's there but like what do I love doing and what do I derive energy from and yeah,  I will throw a curveball answer at you.\r\n\r\n\r\nActually,  I'm ready for it. I am jealous of the influencers who have 5 to 10 million followers. And they've built a following in an audience that  basically allows them to do anything that they want to do forever,  forever. That's a good one. That's a good one to be jealous.  Yeah.  Yeah. Launch a business, sell ad space. \r\n\r\n\r\nJust post pick, like whatever they want to do, they can work as hard or as little as possible. It doesn't even matter because they've got so much goodwill built up and so much content out there that it's just a compounding asset.  What are you obsessed with right now? Besides growing rolling suds, if you had two hours or an hour to just do something that you're super interested in, what is it? \r\n\r\n\r\nSo I'm obsessed right now with the responsible franchising discussion. Like it's, I think about it like a ridiculous amount. The franchise industry has gotten a bad rap as a result of people who have behaved irresponsibly unethically.  And, and I believe that there is not a quicker path to wealth generation than finding the right brand and executing on the model.\r\n\r\n\r\nI just don't think, you might get lucky in real estate. You might, if you have a good idea and you can come up with a new app, barring all of like. Those success stories for your average, normal American middle class, middle, upper class, like person who just wants to own a business, like there's not a quicker path to wealth generation than finding the right brand. \r\n\r\n\r\nHowever, people don't know about it because it has not been promoted or done in the right way at scale yet. And so when I think about the industry that I love so much, which is franchising. 20 to 30 years from now, I'm zooming out and I'm saying, what do I need to do now? What kind of conversations need to happen internally in the industry now?\r\n\r\n\r\nAnd the conversation of responsible franchising that I have more or less started about a year and a half ago is now the key talking point in the franchise industry. And I'm working in lockstep with the International Franchise Association.  To come up with legislation and proposed regulation to avoid these people come into the industry who are not the right people and shouldn't be in it.\r\n\r\n\r\nAnd so I'm like obsessed with finding a way to have the business and the industry of franchising be more reputable  and accessible. That's awesome.  Well, this has been an awesome conversation. Aaron, where's the best place for people to come find you? Is it?  Rolling studs. com. Where do you hang out? It's yeah.\r\n\r\n\r\nIf you want to learn more about the brand, it's rolling such franchise. com, but honestly, like  rolling sets, it's going to be for everyone. We have a very specific niche of a candidate that will work. And I'd rather have. You follow me along, follow along on the, the, the content that I put out because I try to make my content more geared towards just anyone who's interested in franchising or entrepreneurship.\r\n\r\n\r\nSo you can follow me on Twitter at Aaron Harper, CEO, Twitter, Twitter. I still call it Twitter. But Aaron Harper CEO is my handle. And then my, uh, Instagram, I put out at least one or two videos per day on Instagram and it's the Aaron Harper. And, uh, cool. Yeah. Those are some places to go.  Well, you're a good guy to follow.\r\n\r\n\r\nI have no inside information, but I know you're not stopping at rolling suds as a brand. So I think if people follow you, they'll have many opportunities down the road to franchise in the future. So anyways, Aaron, this was a, this was fantastic, man. Thanks so much for having me. This has been great.  I told you, I told you what I tell you, I told you it was going to be a good episode, Aaron, man, that guy's just impressive. \r\n\r\n\r\nAnd I want to thank him for taking time and joining us on the episode that I want to wrap up today with a couple of thoughts around franchising and entrepreneurship. Aaron mentioned it in there that he thinks it's the best way to create wealth for somebody who's coming up in the world. And in my experience, I think that the safest way to enter entrepreneurship is to build an agency around a specific skillset that you have.\r\n\r\n\r\nBut if you don't have that skillset and you want to purchase something, I think the second safest way is to purchase into a franchise. And the reason I think that is because entrepreneurship is just inherently built with risk. Your venture could fail. Your idea could fail. Maybe people don't like your product.\r\n\r\n\r\nMaybe you're a terrible manager. Maybe there's not enough. Capital to get you to the end of the row. There's a million reasons where, why you can fail.  And the constant with an entrepreneurship is the requirement for you to figure stuff out. So there's so much energy spent figuring things out that it's really hard to then put that towards growing and selling.\r\n\r\n\r\nWell, franchises have a very clear template for you. It's very cookie cutter. This is how we operate. This is how we systematize things. This is what you wear. This is your branding. This is how you market. This is what the store looks like. A lot of things are taken care of for you. You just need to go out and execute and sell. \r\n\r\n\r\nAnd in my mind,  if you've gone through the exercise of identifying your strengths and weaknesses and you're worried about entrepreneurship because there's a lot of risk involved and if you're putting capital into something, what if it fails?  I would strongly encourage you to take a look at franchises.\r\n\r\n\r\nBecause they give you the kind of the best of both worlds. There's this Very directive approach that the franchises have that tell you exactly how you need to be. And yet there's a lot of autonomy from your end to figure out how you're going to grow that business. So if it's your first step into entrepreneurship,  it can be a really great experience.\r\n\r\n\r\nAnd there's a host of individuals who've started in the franchising space and then branched out to other businesses that were not a part of a franchise. If you're interested in the franchise space, send me an email, Nick at cofounders. com. I have a couple of friends I can put you in touch with that are franchise brokers, or just give you some information on the subject.\r\n\r\n\r\nThank you so much for joining me. Please remember,  stay curious. Curiosity really is a superpower. And the more questions you ask, the more you learn. And the more you learn, the more you can earn. Remember what my mom used to tell me, Nick, there's no such thing as dumb questions, only dumb people who are afraid to ask the dumb questions.\r\n\r\n\r\nI'll see you next time.",
  "metadata": {
    "duration": "",
    "date": "2024-06-24",
    "platform_source": "Google Drive"
  }
}