{
  "episode_number": "88",
  "episode_title": "From 0 to $30M: Lessons from a Foundry Roll-Up Strategy with Reg Zeller",
  "guest_name": "Reg Zeller",
  "business_name": "Aluminum Foundries",
  "transcript": "﻿Nik (00:01.013)\r\nReg, welcome to Niconomics, my friend. Stoked to have you here. Let's just hop into it. Tell me, what is your business? How do you make money?\r\n\r\n\r\nReg (00:05.634)\r\nGood talk to you, Nick. I love it. Let's do it.\r\n\r\n\r\nSo I own a bunch of aluminum foundries. How I make money is I'm married to the CEO of a private equity firm. But I mean, those are probably two different things. everything that I make per se, mean, granted, we pay some taxes to the IRS every year, but everything we make literally goes back into the business. I specifically own mainly aluminum foundries. Every time I say non -ferrous, then people's eyes gloss over. So let's just call it aluminum foundries for lack of a better term.\r\n\r\n\r\nSo we started this seven and a half years ago, mounted two, I'd spent 17 years in corporate, just got sick of that life, really wanted to try my own thing, really fundamentally believed in local US based manufacturing. I thought the pendulum had swung too far. And so we bought seven of them now in the last seven and a half years. Everybody looks at it and thinks, you guys are Uber successful and things are great. And I feel like we're maybe.\r\n\r\n\r\nIn the middle innings of this thing, probably still the early innings to use a baseball metaphor. So that is going to continue to buy up these boundaries and grow and diversify and make, make us based manufacturing work overall beyond just boundaries. Once we're done with this.\r\n\r\n\r\nNik (01:20.854)\r\nI don't remember who said it. Somebody smarter than me said it where they're like, every business is a mess. No matter what company you think is the great company, you get in there and you're like, what? These yahoos are pulling the strings? Every business is messy. What is a foundry? Dude, I know nothing about this space. What does that mean?\r\n\r\n\r\nReg (01:26.997)\r\nYeah\r\n\r\n\r\nReg (01:32.655)\r\nYeah, exactly.\r\n\r\n\r\nYeah, no worries. The simplest explanation is we have a negative impression of some part you want to make. It doesn't matter whether it is a something that holds up a street light, it's a deer stand, it's a golf ball washer, you name it. It can be just about anything. Kind of the story is you're, especially in an urban environment, you're never more than a thousand feet away from a casting of some variety. It's in all your vehicles.\r\n\r\n\r\nbuildings, infrastructure to make things work, et cetera. So all we take is that negative impression of a product. Sometimes it's in sand, sometimes it's in steel. We heat up aluminum in this case to, you know, call it 1300 degrees to make it molten. We pour that into that negative impression form. It cools and when it's cooled, when the part hardens, then you have your part. That's it. And so we do it, like I said, there's different techniques, different ways of doing it, but\r\n\r\n\r\nreally in a nutshell, nothing's changed for 6 ,000 years doing just that.\r\n\r\n\r\nNik (02:41.36)\r\nYeah. So you've got, and you've got seven of those boundaries across the country.\r\n\r\n\r\nReg (02:45.582)\r\nYeah, I mean, so we bought seven. We've merged a couple. We sold the real estate under one. So we have four geographic locations currently, and then we're always in talks with another. I mean, actively probably 10, but there's like 30 that have kind of gone through my list that I think are worthwhile for us to purchase. And every time we purchase these, you know, being a roll up, you know, we learn a lot more every single time and and grow that. So, you know, we'll buy probably another\r\n\r\n\r\n10 -ish, maybe 15, just to build out the network as we go.\r\n\r\n\r\nNik (03:20.348)\r\nTell me, like, again, I don't know anything about this space, but as I'm thinking about it, you've got aluminum in the ground. Somebody's got to go in and bring it out of the ground. And then on the other end, there's me opening up my soda can and having a drink of a Coke. What does that, what does that chain look like? And where does the foundry fall kind of in that?\r\n\r\n\r\nReg (03:34.476)\r\nYeah, Pretty much.\r\n\r\n\r\nReg (03:42.86)\r\nYeah, so there's, it can happen just about anywhere. So mine it, you know, it looks just like you mentioned, and this works for any foundry, but you mine metal of any variety. You typically would, what they would call smelting and then alloy it more or less, you you're not, we don't make pure aluminum. You need to mix other different, irons, minerals, sorry, metals, minerals, et cetera, into get.\r\n\r\n\r\nwhat you need in a proper to make a good part. And then we buy ingot. You know, it just looks like people think of those little gold bars as the same thing. They're just substantially larger. And so we buy that ingot. We melt it in a giant furnace. Think of like boiling a kettle on a stove, except, you know, it's 3 million BTUs and it's thousand pounds worth. And then we pour it into a form and that's it. So yeah, the supply chain and a lot of it.\r\n\r\n\r\nNik (04:35.228)\r\nCheers.\r\n\r\n\r\nReg (04:40.174)\r\nfor what we would do, our types of products, the vast majority of what we buy is what they call secondary, meaning it's all recycled. So aluminum foundries, not just aluminum, but all foundries, generally speaking, recycle more than 99%. The oft quoted thing is this industry is the highest recycled content in any industry in the world because you're able to reuse all of that.\r\n\r\n\r\nYou have to change some few things here and there, but you don't really burn a lot off. There's no reason to not recycle at all. So anything that would be scrap or waste inside of one of our facilities, we go back and remelt and we're able to again, alloy that back into what we need and you mix it. There are other places where you would specifically buy it directly from what they call a virgin source or primary source. But a lot of times that's very specific stuff.\r\n\r\n\r\nNormally you're not going to need that. You don't need to buy. Normally that stuff comes from Middle East, Russia, in that area. We don't have a few types of minerals and metals here in the U .S. that we have to buy, but in excess of 90 % of the metal we buy is secondary aluminum that's recycled here in the U .S.\r\n\r\n\r\nNik (05:52.506)\r\nInteresting. Alright, so you got somebody who goes and mines it out of the ground. Somebody else who, for lack of a better word, smelt it and kind of puts it into the commodity form. And then your foundry takes it, puts it into whatever your customer is requesting.\r\n\r\n\r\nReg (06:08.258)\r\nYeah, whatever the customer wants. Yeah, and then just to clarify on that, you'll, you know, let's say primary aluminum might be made into aluminum rims for a vehicle, right? After the useful life of that vehicle or it's smashed, whatever it might be, they'll recycle that aluminum, realloy it after taking all the pieces out and we'll buy that recycled aluminum.\r\n\r\n\r\nNik (06:28.528)\r\nI love getting lost in like YouTube rabbit holes and one of the YouTube rabbit holes I went down recently was have you ever seen them dismantle a car at like a junkyard? Do like.\r\n\r\n\r\nReg (06:37.58)\r\nYeah, absolutely. Yeah, I know some people that own junkyards. Wildly profitable if you do it right. Yeah, it's great.\r\n\r\n\r\nNik (06:43.384)\r\nYeah, like, obviously, there's the pick and pick and pull businesses, right, where they just take car parts and they sell them later. But there's also like these big machines that are like, here's a Mercedes. Cool. We'll take the seats out. We'll take you know, these engine components. Here's where the tires go. And they've got like all these different piles. And by the end of it, you've essentially just got the frame of the car, which I thought was nuts. I mean, it makes sense to me, but still still friggin nuts. Who who are your customers? Like who do you sell to?\r\n\r\n\r\nReg (06:47.693)\r\nYeah.\r\n\r\n\r\nReg (06:54.978)\r\nYeah.\r\n\r\n\r\nReg (07:02.914)\r\nYeah.\r\n\r\n\r\nReg (07:10.964)\r\nAny, really we don't do a lot of aerospace or defense, minimal amounts of that just because of the government contracting requirements for that. We're starting to get in more and more of that. We've had a few requests from some of the government organizations to help us get into that. That's neither here nor there, but it can literally be by geographic region is really what it amounts to. So, Minneapolis, where I am, lot of.\r\n\r\n\r\nrecreation, simple, you know, playgrounds, other types of infrastructure type products. You're down in our Kansas City facility, a lot more, you know, mining metrology. You're out in South Carolina. You're talking about big infrastructure, our Cincinnati facility that we have, we move that stuff. It's a lot of industrial fans, pumps, et cetera. And then in New Hampshire, it's a lot of Marine, Navy.\r\n\r\n\r\nSo was really very geographically dispersed, but it's anybody that might sell to the end user. And so a lot of people would say, you hey, you're not diversified because you're in foundries. Well, foundries have been around for 6 ,000 years, you know, or they've made parts that way, dealt they're going anywhere. so, you know, that's just our diversification comes through our end users more or less. So we try and balance it, you know, as it goes up and down between commercial and industrial, the last 18 months, you know, other.\r\n\r\n\r\nNik (08:08.604)\r\ninteresting.\r\n\r\n\r\nReg (08:32.91)\r\nThe consumer markets, they've seen inflation, but they haven't seen lot of downturns. The industrial markets have been absolutely hammered.\r\n\r\n\r\nNik (08:42.854)\r\nSo I want ask about that actually in a second. But as I'm, it makes sense to me that they would be regionalized because you don't want to pay a bunch of shipping costs for heavy, heavy metals being shipped. But like if I'm looking on the spectrum, one end, like I said, the soda can, that seems like a mass produced end user product. The other end of the spectrum is like, we do all of the, I don't know, foundry for SpaceX. Like we help them, you know, it's very custom.\r\n\r\n\r\nReg (08:45.645)\r\nYeah.\r\n\r\n\r\nReg (08:51.342)\r\nSure. Nope. Yeah.\r\n\r\n\r\nReg (09:10.104)\r\nYeah, yeah. Worn out tape stuff.\r\n\r\n\r\nNik (09:12.924)\r\nIs is the stuff you do very sort of made to order? Are they limited runs? Are they like like what's the quantity typically of of an order if you're doing the negative impression of that order? Like how does that part look?\r\n\r\n\r\nReg (09:24.142)\r\nYeah. I mean, it really, it's completely dependent on the size, the customer, et cetera. So we might have some parts that we'll do five or 10 of a year. There's other parts that we'll do 30 ,000 of a year and everything in between. yeah, really, you know, our technical term would be a job shop, meaning that as jobs come in, we make them, but you know, the vast majority, and I'm talking historically.\r\n\r\n\r\nNik (09:38.822)\r\nCheers.\r\n\r\n\r\nReg (09:51.662)\r\nwhich is, this is really bad. Historically, it's been in excess of 90 % have been with existing customers, complete reorder business. that's obviously that's not healthy for the longterm and you get tied into that. we've built, when we purchased all of our foundries, not one of them have had sales or marketing capabilities beyond the simple stuff the owners were doing. So we've created full organizational structures around every single thing at our business. And when I say everything, I mean,\r\n\r\n\r\nWe've had to build finance functions. We've had to build marketing and sales. We've had to build data analytics, customer service, you name it. We've had to literally build all of these things. so unfortunately, we're building all these is kind of the old adage of changing the wheels on the bus as you're driving down the road because you can't slow it down. And so like Joshua ran and then he'd like, so we have to implement a new ERP. I was like, this sounds like an absolutely terrible idea.\r\n\r\n\r\nNik (10:37.829)\r\nYou\r\n\r\n\r\nReg (10:47.896)\r\nHe's like, well, we're gonna have rip the bandaid off someday. I'm like, okay. You're called, mother.\r\n\r\n\r\nNik (10:51.324)\r\nDude, it's so funny. Have you ever, I'm sure you've seen the meme where it's like private equity, know, buy the business, change out the fax machine, make money, down, right? And there's a lot of truth to that because these businesses are old. And so they're using archaic systems and processes. But I think what people don't recognize is changing out those systems is freaking hard. It's not easy. Like, yes, they have a fax machine, but also,\r\n\r\n\r\nReg (11:03.537)\r\nYeah. Yeah. Yeah.\r\n\r\n\r\nReg (11:09.079)\r\nYeah.\r\n\r\n\r\nReg (11:17.449)\r\nUgh, it's miserable.\r\n\r\n\r\nNik (11:21.146)\r\nThat's how they get all their orders and the people who are sending them the orders, that's how they like to send them. So it's like, it's not just you're changing your internal processes. You've got to change the habits of people out in the market too.\r\n\r\n\r\nReg (11:30.988)\r\nYeah, we had a time, this is my first one I bought, and everybody jokes about this, like, I'll rip out the fax machine and do whatever. We didn't even mean to rip out the fax machine. We just changed over from landlines to voiceover IP, because we had to replace all the phones, and the price was literally more expensive by the month and to buy the new phones than it was to just go to a voiceover IP system, and then obviously we got access to everything. I could see calls going into the office from anywhere in the world. mean, obviously tons of benefits. the voiceover IP didn't work with a\r\n\r\n\r\nFacts machine so this guy shows up like you know whatever six eight ten weeks, and he's like hey I'm so and so I'm here to get my parts I was like so and so I don't know who you are and I have no idea like I don't have any of this like I see you're an old customer now that I looked it up, but he's like yeah I faxed in I was like you what like we don't have a fax I look over my office manager like hey Becky do we have a fax he's like maybe like so yeah but again like I'm like\r\n\r\n\r\nNik (12:21.35)\r\nDude. my gosh.\r\n\r\n\r\nReg (12:25.006)\r\nIf we don't give you like an acknowledgement back or something like you got it like, but yeah, they didn't even think about it. Like, I don't know. We faxed this in for 30 years. It's totally fine.\r\n\r\n\r\nNik (12:31.27)\r\nDude, we, I did that. I did that as well. We, we implemented a new VoIP system and I was in healthcare and I'm like, yeah, this will be, this will be great. And then I realized what you're doing. I'm like, how am I customers going to send us faxes from now on? So then you have to go into manually call all those customers and tell them the new facts. We had to get whatever you facts, right? Facts, whatever, like whatever the company is bring central. can't remember anyways. So it's like, so it's like,\r\n\r\n\r\nReg (12:45.068)\r\nYeah\r\n\r\n\r\nReg (12:50.218)\r\nRight.\r\n\r\n\r\nSame. Yeah, whatever. Yeah, same.\r\n\r\n\r\nNik (12:56.888)\r\nYeah, OK, yeah, you change. But then there's also the like secondary and tertiary effects of like figuring out how that's going to impact your customers like anyway. So I love it.\r\n\r\n\r\nReg (13:02.061)\r\nYeah.\r\n\r\n\r\nYeah, I mean, but it's awesome because it's everything, to your point, everything, even how you communicate with them. They're like, I'm used to calling in every single day. Like I don't have the bandwidth of people to call in every day. Like we've 10x'd in seven and a half years. And also like that's part of the problem is you're burning cash in the meantime and they think, yeah, well you're a lot bigger. You have all these things. I was like, right, but I'm pouring every dollar I have back into these things. Yeah, if we completely stop expansion, if we stop doing everything, it would finally catch up and we'd create some cash.\r\n\r\n\r\nThey're like, no, you should have like, I just called, you know, Mrs. Whatever for the last 30 years and she just took an hour and a half to find out, you know, a question that should have been a 30 second. I'm like, I don't have that luxury anymore. I can't find a worker. What does that have to do work?\r\n\r\n\r\nNik (13:43.92)\r\nYeah. Okay, what's your what's your cash conversion cycle?\r\n\r\n\r\nReg (13:50.67)\r\nSo we typically buy metal within the week that we're going to use it. We pay in 30 days. Obviously we pay in all of our people as well. And then we'll get paid depending on the customer, but you know, it's probably somewhere just over 30 days. But I mean, you have a lot of the bigger customers that's trying to push you to 60 to 90. There's other smaller customers that'll pay in 10 to 15. There's some people that take the, you know, two net 10 type discounts. It really is all over the map.\r\n\r\n\r\nYou know, as we were, when we were flat, we had, you know, I'd say excess line of credits. I didn't mind floating some of that for additional money, but when you get in growth mode and you're burning working capital and everything, I'm like, I, you're investing in constant, you're growing. And I'm like, I can't have a negative 60 day or negative 45 day cash conversion and also be providing, being the bank for somebody else and also be trying to grow. It's impossible.\r\n\r\n\r\nNik (14:45.276)\r\nThat's what I think people don't understand who haven't done it before is, yeah, you get excited because you get a bunch of new customers. I was in healthcare, our cash collections was like 45 days. And so we'd get a bunch of patients. And it's like, Rad, we just doubled our census. Cool. That's great. I'm not going to get paid on those patients for at least 45 days. But in order to care for those patients over the next 45 days, I've got to hire more nurses.\r\n\r\n\r\nReg (14:57.004)\r\nYep.\r\n\r\n\r\nReg (15:02.912)\r\nYeah.\r\n\r\n\r\nNik (15:12.156)\r\nI've got to get more supplies. I've got to get more admin staff. Like it costs a lot of money. And like the PNL looks great. Like, cool, that cash. We're making money this month, but from like cash standpoint, it's so freaking hard to grow fast in those types of businesses and your business is even more capital intensive than than healthcare.\r\n\r\n\r\nReg (15:17.72)\r\nYeah. Yeah.\r\n\r\n\r\nReg (15:24.343)\r\nYeah\r\n\r\n\r\nReg (15:30.638)\r\nYeah, right. And when you go, you you lump on top of that the last 18 months of softness plus, you know, we always see J curves in our business just because when we take them over, we're going to have to put in the new ERP. We're going to have to bring different types of people. We'll have overlaps of folks, but we're also going to have to likely go invest in capital equipment at a minimum of bunch of OPEX and deferred maintenance that they haven't done. We know that going in, fixing up equipment, putting in more inventory.\r\n\r\n\r\nsolving all these problems. I mean, we legitimately, the smaller ones, we might get away with like six, nine, 12 month J curve, but like the larger one, the one we just got, it was a year ago, April. So we're getting close to 18 months. We're finally getting that thing stabilized after, you know, like I mentioned, like we were burning a couple hundred thousand dollars a month because of how bad the old owner was running it and what they were doing. And when he walked out, it was just a mess. And we knew it was coming.\r\n\r\n\r\nBut you put on like, you have a cost overrun of the things you're gonna do, you underestimate this, that breaks, these things are underpriced, you get some shenanigans here and there, and you're growing the rest of it. This is like, my God, every time I talk to people, they're like, well, what business books do you recommend? They're looking for some business for dummies or whatever. was like, honestly, biographies. You wanna really read what it's like, go read Shoe Dog.\r\n\r\n\r\nand watch that guy bet the company 17 times over the first 10 years. Like that's my life. Like no sleep sitting up middle of, you know, three, was literally texting one of our guys in South Carolina at 3 .25 AM. Cause he randomly was there at 3 AM his time and he sent me a text and I happened to wake up and damn me. should have never looked at my phone, but here we are. Hounding away a few texts about what I thought he needed to do today. As a relatively new plant manager and operator down there, but no.\r\n\r\n\r\nNik (17:25.658)\r\nAll right, give me you brought up some really cool people. She dog. That's a great book. Even musk's biography was freaking nuts to read. Give me give me some idea how long have you been in the foundry business and like what's what size are you now?\r\n\r\n\r\nReg (17:25.784)\r\nThis is what we started.\r\n\r\n\r\nReg (17:35.308)\r\nYep. Yeah.\r\n\r\n\r\nReg (17:45.422)\r\nSo we should be doing, I mean we won't quite get there, but we should be doing, call it 30 million this year. I don't love to talk about profits just because we run a very different organization than everybody else in our industry, so I'll keep part of that to myself. You can kind of suck through that in Twitter and figure out probably what we're doing. But we started, were 2 .5, 2 .7 million roughly the first year I bought it, seven and a half years ago.\r\n\r\n\r\nAnd that was January 31st, 2017. And September, 2016 was the first time I'd ever stepped foot in a foundry. So I'd been in the foundry industry seven and half years, the day I bought it. It's the first time I was ever really part it. Yeah, I toured it. I walked in. was like, this is Dante's fourth circle of hell. It's hot. It's dirty. It's dark. A year later. Yeah. Like, yeah, yeah.\r\n\r\n\r\nNik (18:37.596)\r\nThat's a ton of growth, Seven years.\r\n\r\n\r\nReg (18:43.032)\r\nYeah, it's wild. great. mean, part of that's through acquisition, part of that's through just individual growth in the businesses, but...\r\n\r\n\r\nNik (18:48.806)\r\nWell, that's that's what I going to ask. How are you growing? You mentioned a roll up strategy. So are you back or are you doing this all through SBA and. OK.\r\n\r\n\r\nReg (18:55.886)\r\n100 % me, just me and Security Bank, my boy Andy and Kevin out there, local banks, those guys are hooking us up to keep us just, keep pumping us full of cash as we go and trusting and you know, they believe in this, they understand the jakers, know, they're entrepreneurs type folks, so they really get it. And every time we just grow with them, they're like, hey, we'll figure it out. They've seen us.\r\n\r\n\r\nobviously eat through a bunch of cash in our line of credit. They're like, hey, we get it. You guys said you were going to do this. We trust in what you're doing. You guys have pulled this off multiple other times. You'll do it again this time. And we will. mean, we'll, Josh and I will, if it literally comes to that, Josh and I will go live in South Carolina or New Hampshire or wherever we need to and go run things. I mean, we've done it before. We'll do it again. And you know, if that's what it takes, you know, you don't take salaries and you jump in and you do whatever, you know, it,\r\n\r\n\r\nNik (19:49.638)\r\nSo I got.\r\n\r\n\r\nReg (19:49.934)\r\nI talked to my wife like, worry about that bankruptcy, we'll be fine, we'll figure it out.\r\n\r\n\r\nNik (19:54.0)\r\nWill you, for the audience, you explain what the J curve is? You mentioned it a few times.\r\n\r\n\r\nReg (19:58.742)\r\nyeah, sorry. Yeah, so I'll make it easy. Let's say you buy a place, it's doing a million dollars a year with, I don't care, use S -T -E -E, whatever you call it. I'll just use your profit for a generic term right now. When you're gonna take over, you're gonna screw a bunch of stuff up. People ask me all the time, like, what did you screw up the first year or two years you owned your first one? And I'm like, it's a lot easier to talk about what I did right, because I did almost everything wrong. I it cost us hundreds of thousands of dollars at almost every turn. It was wildly terrible.\r\n\r\n\r\nBut anyway, so the J curve is just nothing more than saying before you're going to go back up and it'd be above that million dollars, you're likely going to drop down 20, 30, 40 % a lot of times, especially if you're doing what we are where we're investing and growing. You're not just going to manage it as is. And that's simply because the old owners is, you know, there's a lot of shit talking that happens. I'm sorry. I don't know if I can swear in your podcast, but by bed. So there's a lot of people on Twitter that,\r\n\r\n\r\nNik (20:51.842)\r\nYou're Yeah, you're fine.\r\n\r\n\r\nReg (20:56.59)\r\nthat seem to think, yeah, we're just gonna replace the fax machine and implement this and that and everything's gonna be fine. Yeah, well, these guys know where all the bodies are buried. knew, like I've literally had this happen to me, where I've been talking to one of the old owners in a place we bought in Kansas City. And he's like, hey, hold on a second. And I was like, what is going on? And David comes back 30 minutes later. He's like, I heard a noise that was kind of funny and I knew exactly what was gonna be wrong.\r\n\r\n\r\nNow had I let that, like I would have never known that and we had to burn down like a furnace and probably like whatever, it probably cost me 50 grand. And he was just sitting there talking to me, having a full on conversation and he heard it and he instantly went out there and figured it out. So, but these are the things, you're not gonna know that because the old owners a lot of times, you if you don't buy a large business, you're gonna have to go put in new people, you're gonna have to learn it, other people are gonna have to learn it. You're gonna have to go invest and do things depending on what it is, almost exclusively. I've never seen a business that.\r\n\r\n\r\nNik (21:30.746)\r\nSee you again.\r\n\r\n\r\nReg (21:49.902)\r\nespecially in the manufacturing space, that hasn't had deferred maintenance or hasn't had this cut corner cut or that. And it's not that they're doing it on purpose even. It's not nefarious. It's just you get used to it. Like it happens even in my businesses. You're just like, we know how to tap on just the side of that thing. It'll keep working fine. And then you don't know how to tap on it. And all of sudden you're replacing a $27 ,000 or doing a 27 ,000 repair within six months. And that's how I ended up in the fetal position the first time.\r\n\r\n\r\nNik (22:01.722)\r\nYeah. Yeah.\r\n\r\n\r\nReg (22:18.092)\r\nYet at J -Curve, is this nothing more than saying, you're going to make less money before you make more money, more than likely. And if you don't plan for that, good luck.\r\n\r\n\r\nNik (22:27.62)\r\nYeah, I always talk about it like one of two things. There's the the people and the business transition and then there's learning the business. So like it is AJ. So you're like going going along. It's all steady. And then you buy the business and you think just think about the people. They've got to come in and meet you. They've got to get on the new potentially the new payroll system. You've got to switch over your accounting and your books. You've got to meet everybody like that takes time away from the business. So you naturally see a dip.\r\n\r\n\r\nAnd then when you have businesses like you have, which are capital intensive or require a lot of inventory, you've got to either take care of the deferred maintenance or restock your inventory, depending on whether or you're you got a networking capital adjustment with the previous owner, etc. So yeah, you dip and then you come back up. And so, you know, it looks like it looks like a J, but everybody thinks like, no, day one, I take over and then I'm going to double sales within six months.\r\n\r\n\r\nWith what money are you going to double sales in six months? Because I guarantee you didn't build in the cash it's going to take to generate that revenue. Tell me about the last 18 months. You've mentioned that a couple of times. Why has your industry been hit so hard?\r\n\r\n\r\nReg (23:30.462)\r\nExactly.\r\n\r\n\r\nReg (23:35.672)\r\nYes. So typically there's two things and now it's being compounded by a second. very typically when we see a drop foundries because we're so early in the curve and you have typical, you know, much more sophisticated buyers in the industrial commercial B2B space than you do B2C. Consumers tend to be much later in the curve, right? Cause they tap.\r\n\r\n\r\nhome equity lines of credit, they put stuff on credit cards, know, they're seeing all the things we're seeing now. So, and especially foundries because before you typically go to machining, painting, some other secondary finishing, et cetera, like other than smelting, we are as far up the value chain essentially as you can get, at least in the U S so we'll tend to see those dips earlier. And so you had a kind of a perfect storm of events where we were coming off of the COVID blip where\r\n\r\n\r\nYou know, even if we had increased demand during that, was some was unnatural simply because the supply chains were so broken. So we saw customers start to order extra. So even if they, you they were ordering 20 % extra every single time. And then you had that going through 2021, all of a sudden, interest rates started to come up in 2022. know, CFOs and the like started to realize, my God, our\r\n\r\n\r\ncarrying costs or borrowing costs are much higher and we have a bunch of excess inventory. Now we're not seeing the end user demand. So now we had like the triple whammy of less demand, you know, at the end user, less demand of what their systems were telling them because they were trying to back down inventory because the supply chains were being fixed rather than being, you know, six or nine or 18 months of delay. Now you're talking about three or four months, so they could obviously lower it and then their carrying costs.\r\n\r\n\r\nSo they lowered even below. we just got absolutely slaughtered in the industrial markets, the manufacturing markets, et cetera, because all three, like let's say each one of those might've been 10 % each or some number like that. And all of a sudden you stack those three together and now you're at 30%. And adjusting the organization where you're going to go do the largest acquisition you've ever done by a factor of two, pretty much. And you're going to go.\r\n\r\n\r\nReg (25:52.526)\r\ndouble that investment with capital equipment that you need to consolidate a bunch of stuff. And so, yeah, we added like 80 % of our total debt in the last, well, in one fell swoop, but in the last 18 months, like 80 % of our debt has come from just those two things. Now, two, three, four years, I mean, we're building through this, we'll figure it out. Once this thing turns around, we're going to be a rocket ship. But in also the meantime, we talked about ERP already, but we've built all of our systems. So we've taken it, you know, call it\r\n\r\n\r\n25, 30 million somewhere in there, but we're building and Josh is doing everything right now to build the organization, the systems, the processes, the playbooks, et cetera, that we'll be able to grow to a hundred. So, you know, we kind of broke it when we doubled to get into 5 million, we broke it again somewhere around that like eight, nine, 10 million broke it kind of at that 15 to 20 million. But now, you know, we're putting it all back together, plus all the acquisitions.\r\n\r\n\r\nBut now we're going, we're spending all the money to create a fundamentally great organization that allow us to three, four, five X from where we are right now. And just absolutely, you know, this is going to be a rocket ship between acquisitions and both, both, both internal and external growth.\r\n\r\n\r\nNik (27:05.756)\r\nWhat's the plan? Most roll -ups are like roll up and sell, but you're not externally funded. Is your plan to sell, is it just to hold for forever? What do you think?\r\n\r\n\r\nReg (27:11.459)\r\nYeah.\r\n\r\n\r\nReg (27:16.43)\r\nI don't believe I can handle it. want to hold forever. Sometimes the sleep is nice, you know, but no. So as of right now, it's just my wife and I, we're not going to have kids. I'll catch hell on the internet for that too. do every time I say it, but either way. we, all this stuff is going into a trust. Some of the senior executives will get some money ahead of time, but ultimately their next generation will be able to get access to what their\r\n\r\n\r\nNik (27:20.858)\r\nDepends on the day.\r\n\r\n\r\nReg (27:46.264)\r\ncall it equity will be without getting into the hundred thousand dollars in tax lawyer bills. I had to figure this all out. But yeah, so it all will eventually go into an enduring trust focused on small US based manufacturing. And so eventually, you know, I won't be here, but one, two, three generations, whatever from now, you there'll be a professional board. kind of built it out of the Cargill model, did a bunch of studying and kind of how that family did that. Now,\r\n\r\n\r\nI don't expect to have a multi -billion dollar business, certainly not in my lifetime at least, but yeah, the goal will be that it just stays there and everything goes into the trust and it continues to work and we continue to grow it, not through nepotism, but through, they'll get those pieces. I went to Vanderbilt and so I got super curious about watching that family just tear down their fortune. So really didn't want that to happen. Insured kind of what that was going to go through.\r\n\r\n\r\nNik (28:39.3)\r\nAll right, I got I got one kind of hard question and then some fun questions. But Chris, my business partner, and I talk about this a lot. And we've, we've started some businesses that were really hard, like, low margin, high volume, operationally intensive, you know, high execution risk. And many times we like are sitting there looking at each other like, why the frick did we start this business? Why didn't we just start some, you know, easy SAF company or whatever? Do you ever feel that way?\r\n\r\n\r\nReg (28:44.707)\r\nOkay.\r\n\r\n\r\nReg (28:56.269)\r\nYeah.\r\n\r\n\r\nReg (29:07.544)\r\nYeah. Yes. the time. mean, again, like if I wasn't a glutton for pun. So let me back up one step. I grew up in a small town in the US. My buddies are quite literally, they own restaurants, they own local newspapers, they drive beer trucks, there's plumbers, the HVAC guys. Like there is, I mean, they all went to some level of college of some variety. But yeah, that's all the guys I grew up with.\r\n\r\n\r\nNik (29:08.88)\r\nAre you ever like, why the we start this business?\r\n\r\n\r\nReg (29:35.126)\r\nAnd so that's who I was. My dad was a teacher, my mom was a hairdresser. I was the first of my cousins to go to college. It's all that crazy shit right there. But I just believe, and I fundamentally believe, we have to do manufacturing in the US. And if I wasn't so hell bent on that, I would definitely be making a lot more money doing something a lot easier. But at the same time, I'm not worried about making the money. We've burned through a lot of money now.\r\n\r\n\r\nabsolutely sucks knowing that your $4 million pour on the balance sheet. We were 15 years ago as a really miserable situation, I promise. But there's just a fun, there's a goal here. It's a bigger picture than that. I mean, we're employing, you know, in excess of a hundred people will eventually employ, you a thousand people even right today because we have so many people that fund, you know, their immigrants or local to that.\r\n\r\n\r\npeople that have been incarcerated, God knows what, people getting a second chance. But we're feeding thousands, if not tens of thousands of mouths already. And I can take a little pain and a little bit of sleepless nights here and there. I think it's just a much bigger purpose to do it. But no, I think about it all the time. Like, Jesus, why did I get into this? Like there's so many other things that I could have been doing that I'd have been off on a boat. Yeah, this is so great, no problem. But you know what I say that I talked to all my buddies, have\r\n\r\n\r\nThey have all these other companies. Well, either way, they're the same way. They're like, dude, is 95 % of this is the same. Okay. Maybe foundries are kind of extra hard mode here and there, but I don't know. Someone has to do it.\r\n\r\n\r\nNik (31:01.242)\r\nYou and Jeff.\r\n\r\n\r\nNik (31:11.96)\r\nI have every almost almost every entrepreneur I talked to was like, dude, my industry so hard. I have a buddy Parker Cox. has a property management business. He's like, dude, property management is the hardest business to run. Well, I'm like, I, I'm like,\r\n\r\n\r\nReg (31:17.516)\r\nYeah.\r\n\r\n\r\nReg (31:25.986)\r\nYeah, welcome. Come step into a foundry and let's talk Parker. He can come visit anytime.\r\n\r\n\r\nNik (31:30.268)\r\nWell, yeah, okay. So then you're like, come step into a foundry. I'm sitting here like, let me ask you a question. You ever been woken up at 2 a because a patient died and your caregiver showed up drunk to their home and was fighting with the family. They were calling the police. So they missed their dad die because my caregiver showed up drunk and they were fighting with them. That ever happened to you? You know what I mean? Like we all.\r\n\r\n\r\nReg (31:52.206)\r\nYeah, you're like, see? Every industry has something, right? Like that's like, we always joke about it. Like it doesn't matter. yeah, I'm sure there are easier places to run. know, people tell me, most of the people tell me like, my industry is easy. I just assume they're lying. That's all. I don't believe you. It's fine. I know a lot of people doing businesses. None of them are easy. And you know, through ups and downs, it's side. I can just tell you, we've got a group of 12.\r\n\r\n\r\nNik (31:58.972)\r\nYeah.\r\n\r\n\r\nNik (32:17.37)\r\nNo, sorry.\r\n\r\n\r\nReg (32:20.91)\r\nin the CEO group that we call EBIT Daddy's. the group that spun out HoldCo and a bunch of other things. anyway, like we've gotten that group in the last year, three of the 12 of us have gone through absolutely miserable times. A couple others have had other, I mean, not completely like meltdown type things. We're all still running obviously, but every one of us have been at it five plus years and we all own multiple businesses. Like we know what we're doing comparably speaking. Now, granted, ask me in 20 years, I'll tell you I had no idea what I was doing today, but at least right now I feel like I know what I'm doing.\r\n\r\n\r\nBut it's not like we just bought a first one. There's a lot of experience in there and we're still like ups and downs and struggles and all kinds of stuff, you know, so.\r\n\r\n\r\nNik (32:58.18)\r\ndude, you're hitting on something that we said before we hopped on here, which is like.\r\n\r\n\r\nEverybody on Twitter, not everybody, but a of people on Twitter are like, business is easy. Or what business book should I buy to learn the business? It's like, it is it's going to be way harder and take way longer than you think.\r\n\r\n\r\nReg (33:06.05)\r\nNo.\r\n\r\n\r\nYeah. Yeah.\r\n\r\n\r\nReg (33:17.198)\r\nYeah, yeah, I mean, that's the I, I quite if someone started talking about this before I did on the whole Twitter SMB group, I don't know who it was. But I literally talked about this because I talked to all my buddies and all my locals. So have a local group and then we've got a nationwide group as well. Kind of the CEO owner group. But I talked to my local buddies and we all went through the same thing where the first 18 months, especially you know, have that few like beginning honeymoon period and then\r\n\r\n\r\nafter the first one, two, three months, there's going to be some weird stuff that happens over the next 15 months. And I ended up six, eight months in, whatever it was, like literally found myself, like I had completely catastrophized the situation. This piece of machinery broke down for like $26 ,000 was going to be the worst case scenario we thought.\r\n\r\n\r\nAnd I talked to them, there's all this deferred maintenance. They said they'd done this maintenance, but they really hadn't. I didn't know. I'm thinking everything's getting, I'm like, I don't have the money. If every one of these machines goes down, then I'm going to go out of business. Well, catastrophize that enough and think, my God, I'm going to cost all my wife my money, like everything we've built. And then next thing you know, here I am, 3 a on the bathroom floor on like a Wednesday or Tuesday or whatever it was. I mean, now 26 ,000, I mean,\r\n\r\n\r\n$26 ,000 is a lot of money, but that's just like a random Tuesday. Like, yeah, all right, well, so you're talking about $4 million. But again, like, this is just the thing where if you don't, and what happened was is I just sat there and my thought was, well, you know, if I go bankrupt and so be it, that's the worst that happens. And I go get a W -2 job and I was like, hell no, that's not happening. So, scraped myself off the floor and I just literally went to work and like.\r\n\r\n\r\n345 and I was walking in when the other there's a couple of people that started at 330 or 4 o 'clock to get everything started so when all the rest of the workers got there at 530 and 6 was already going they're like boss what are you doing here like I'm not gonna talk about it but just went and worked on it fix the equipment we got our own here we are\r\n\r\n\r\nNik (35:19.324)\r\nAnd it takes, I think, well, I think anybody who's been in the game long enough has had that situation, but it takes years to realize, like, it's gonna, not that it's gonna be okay, but you're gonna figure it out, right? Like, I look at things now that I would have crapped my pants about, you know, five or 10 years ago, but, and now I've just realized, like, okay, there are days still where I'm like, dude, I'm a fricking genius. I am so smart.\r\n\r\n\r\nReg (35:38.234)\r\nyeah.\r\n\r\n\r\nReg (35:45.666)\r\nYeah\r\n\r\n\r\nNik (35:46.532)\r\nI could do anything, right? And then like literally the next day I'll be like, I'm a moron. What am I doing? Like I just cost my family their future.\r\n\r\n\r\nReg (35:48.823)\r\nYeah.\r\n\r\n\r\nhave no idea what I'm going on. Yup. It's, yeah, I get, if I'd have gone, I mean, right now, and I don't know what it is, we think we get better at it, the risk, we get more, you know, risk, I still haven't figured out the right answer, probably a combination of all of it. If I'd gone through the last 16 months, early on in my career, I'd have been a basket case. Like, I don't think I'd have been able to function. And.\r\n\r\n\r\nI've had some sleepless nights here and there thinking about it, having to talk to people, figure out what we're doing, getting way more involved than I'd like to in the organization in Q2 and Q3, just because as soon as I get into the middle of operations, I'm not doing my job for the company, which is to ensure that I'm growing the outside strategic side of it through acquisitions, through finding resources, through connecting the dots and talking with the latest and greatest. But, you know, sometimes you got to jump back in and do it. I mean, obviously I have a great.\r\n\r\n\r\npartner and operator and Josh figuring it out. And at the same time, it doesn't matter. They still need help once in a while. so I got to, hardest thing.\r\n\r\n\r\nNik (36:50.076)\r\nYeah, you have to build. You have to build that muscle and in my it's about trade offs, right? If you want to grow really fast. You're going to be stressed out in your mind. You just are. It's like it's going to. It's going to feel like you're betting the company over and over and over again. If you don't want to grow up really fast and you just want to buy something and be stable and grow at, you know, a 10 to 15 % clip a year. That you're you're not going to be as stressed out of your mind. You're definitely going to have a better quality of life.\r\n\r\n\r\nReg (37:02.94)\r\nYeah\r\n\r\n\r\nNik (37:18.928)\r\nbut your upside just going to be less, right? It's just a trade off kind of where you want to be. So I don't think one's right or one's wrong. just, people don't recognize when they're getting into entrepreneurship. Like I hear people who are like, I want to have a hold co. I'll just buy a business and hire an operator. And I'm like, you are so stupid. have no idea what this is like.\r\n\r\n\r\nReg (37:21.368)\r\nYeah, right. Yeah.\r\n\r\n\r\nReg (37:31.778)\r\nYeah\r\n\r\n\r\nGood luck. Hey, give me a call. It'll be great. I mean, but that's the same thing. We didn't even choose fast versus slow growth. I that wasn't as much as we were trying. You we had a bigger picture in mind. Like I want to fundamentally change small US manufacturing. Well, the only way to do that is you grow and you hire guys like Josh and my CTO and my head of sales and all, you know, the new ops man, like all these people, like you have to build the team. And I'm in my mid forties already.\r\n\r\n\r\nIt's hard to believe, but I have to go build the next generation of senior executives in my company and they've got to go build the people underneath them to be able to take their role. so it was wild to think like succession planning and what it takes to actually grow because the vast majority of what I see are not the small, especially in manufacturing, those small companies need an individual operator, typically an owner.\r\n\r\n\r\nthat is beating your head against the wall every day. And in order to get from where they are, it doesn't matter, three, four, five million in sales, know, whatever, a million in EBITDA, to a company that's a hundred million or 150 million, you know, whatever it might be in sales, like doing 15, 20, 25, I mean, that, it is so hard. And it costs so much money and so stressful to get there because your only option, if you're going to do it in one lifetime, your only option is to take huge bets.\r\n\r\n\r\nNik (38:53.276)\r\nSo are you.\r\n\r\n\r\nReg (39:02.542)\r\nAnd you have to take calculated, educated bets and hopefully at the same time you don't get the whammy of all this market hell we've gone through in the last 18 months. again, to your point, we'll just figure it out.\r\n\r\n\r\nNik (39:14.566)\r\nAnd maybe maybe maybe growing fast versus not growing fast is the wrong lens. Maybe it's like if you want to have a lifestyle business, and I don't mean that in a derogatory sense at all versus, you know, building something big, like if you're building something big, you have to go through the crap.\r\n\r\n\r\nReg (39:23.256)\r\nBye.\r\n\r\n\r\nReg (39:29.134)\r\n100%. Yeah, and I don't, people that talk about lifestyle businesses as bad, I was like, I don't know, I would, there's many and many, many indicts and days. I'm like, I would love to be like how the first company I bought from, those owners showed up like two hours, three hours, four hours a day. The vast majority of the time was playing solitaire, but they had a fantastic, you know, they had, after 30, 40 years, they had houses and boats and, it's fine.\r\n\r\n\r\nNik (39:34.918)\r\nsame.\r\n\r\n\r\nReg (39:58.318)\r\nGreat, like that's a hell of a lifestyle to make a half a million dollars a year for 30 years and barely work. mean, yeah.\r\n\r\n\r\nNik (40:05.18)\r\nFive, five, 10 years ago when I was in business school, as we're graduating, a lot of people were like, I don't want to have a lifestyle business. It was like talked down on as like it was a bad thing. And now sitting here like, dude, those guys have it figured out. Some days I'm like, I'll trade it all for a lifestyle business, man.\r\n\r\n\r\nReg (40:18.664)\r\nYeah, exactly. I'm like, it's a it's I have a buddy who says this. He's like, man, owning small businesses is the greatest thing in the world. As long as you don't have employees or customers. I'm like, well.\r\n\r\n\r\nNik (40:35.927)\r\nyou\r\n\r\n\r\nMy, my favorite, my favorite meme, my favorite meme is the one of he's like, it's like a picture of an old guy, you know, in his 90s, white hair, balding wrinkled. And the quote is, I love small businesses. I don't have any stress. And then and then it says Brian age 29. And that's, that's it. That's friggin small business.\r\n\r\n\r\nReg (40:39.118)\r\nAlright dude, I think, alright.\r\n\r\n\r\nReg (41:01.614)\r\nYeah.\r\n\r\n\r\nReg (41:07.391)\r\nAbsolutely.\r\n\r\n\r\nNik (41:08.518)\r\nI'm gonna end on some rapid fire questions for you. What do you love about this business?\r\n\r\n\r\nReg (41:12.205)\r\nAll right.\r\n\r\n\r\nReg (41:15.992)\r\nSo fundamentally we have moats that we've built. I mean, it's cost us a lot of money and time to do it. But once we're done with this, and again, don't even know how to define that word, but I feel like right now we're finally at the precipice of having a real business, which is wild to think seven and half years in and all the money that we used to make. As we're growing up, you're like, this is great and easy. And then again, I keep coming back to this, but.\r\n\r\n\r\nOnce we have this, the most that are there between our business systems and I we, I fundamentally believe we are 15 or 20 % more efficient on our backend than any other person in our space, small or large. the same thing. Once we started installing some of this equipment again, if you're small, so where we have this really weird niche is if you're small, you can't afford to buy the equipment that we're doing. If you're large, you don't want to deal with the small customers that we deal with.\r\n\r\n\r\nSo we have this really narrow niche and I don't quite honestly know a single other foundry that is our size specifically that does what we do. And so we've got this great little niche and that is going to be a moat that there's no private equity firm that will ever invest to go catch us and do what we're doing because again, they actually like to make money and this is just a terrible investment for them monetarily.\r\n\r\n\r\nThe small guys would never, you know, an individual SBA or, you know, micro PE or something. Again, same thing. They aren't going to touch it. There's a lot of other places you go. And the large side, you they don't, they can't handle, they don't want to deal with the mom and pops of the world or the really low runs or whatever else. So it's got a little niche that we've built some pieces on. And at the same time, you know, the other part I love about it is this is, this isn't the hardest manufacturing. I'm sure, I'm sure there's other harder manufacturing, but this is.\r\n\r\n\r\nreally close to the artist and we've built business models and playbooks and processes around this and we've really taught ourselves how to operate small manufacturing. And so I do think that this is going to be that jump off point for us to be able to do a lot of things in the small manufacturing world because I think we can take this and extrapolate this to 90 plus percent of what we're doing right now. We can extrapolate to any other manufacturing industry.\r\n\r\n\r\nReg (43:26.956)\r\nwhich was ultimately my goal. So, you know, this is kind of the first, whatever you want to call it, platform roll up, whatever. We'll go do this three, four, five other times, you whether it's with our specific money or whether it's, you know, helping others get there or it's outside. I don't have any idea on that part yet, but, you know, it allows us to achieve the mission at the same time that I think it's a really great industry to be in.\r\n\r\n\r\nNik (43:50.876)\r\nOkay, what do you hate about it?\r\n\r\n\r\nReg (43:54.996)\r\neverything else.\r\n\r\n\r\nReg (44:00.27)\r\nCapEx, Opex, there's nobody in the country that really knows how to do this stuff anymore because we outsource it all to overseas. The cash conversion cycle, mean everything, this is quite literally small business on hard mode if you just look at the unit economics of how it works, right? It's not SaaS, it's not low CapEx, it's not exactly recurring, reoccurring revenue, I mean even though it really\r\n\r\n\r\nends up being that way. So yeah, you're constantly training. We've had to create a training academy and figure out how we actually get people up to speed. We've had to hire people from outside the industry and bring them in and train them and they have no idea. And that is absolutely painful. But that's where we have to find our people. They don't exist. mean, the people, when I bought it seven years ago, my first one, there was a lot more of them. Well, you think about you start moving that in the eighties and now you're 40 years later.\r\n\r\n\r\nNik (44:44.028)\r\nCheers, boys.\r\n\r\n\r\nReg (44:55.31)\r\nWell, we haven't had new people coming in in the last 40 years. Well, if you think they started 20, that means they're in their 60s now. And all those people have aged out of the place. Or in the meantime, they got cut and they went into other industries. So even the people that would have been there. So yeah, it is miserable from a people perspective.\r\n\r\n\r\nNik (45:13.006)\r\nAll right, all of us are jealous creatures. So my question here is, what industries or businesses are you the most jealous of right now?\r\n\r\n\r\nReg (45:17.582)\r\nyou\r\n\r\n\r\nReg (45:24.394)\r\nI honestly couldn't spend a minute of my time thinking about that. just, I was not, don't get me wrong, I wish it was easier, whatever else, but at the same time, we talked about it before, everybody's got a hard industry, there's reasons it's hard. I don't know, I mean, this is what I know forever, I've known manufacturing. I grew up, I was an engineer, I grew up in small town, engineering undergrad.\r\n\r\n\r\nNik (45:28.988)\r\nDone. All right.\r\n\r\n\r\nReg (45:49.006)\r\nEvery single one of the Fortune 500 companies that I worked at, all four of them were engineering and manufacturing based. I'd just get schooled probably if I went into software or healthcare or tech or any of that. So I probably have made my bed.\r\n\r\n\r\nNik (46:02.268)\r\nAll right, screw your emotionally intelligent answer to that question. All right, second to last.\r\n\r\n\r\nReg (46:06.59)\r\nI want to be in healthcare like you said. want nurses in healthcare. about that? Is that better?\r\n\r\n\r\nNik (46:11.612)\r\nThat's perfect. Perfect. Second to last question. If you have two hours in your day, you don't have any work stuff, you don't have any family responsibilities, personal responsibilities, what are you spending your time on? What are you obsessed with right now?\r\n\r\n\r\nReg (46:27.202)\r\nGoing for a run, steam, a cold shower, just mentally relaxed. I spent so much time in the last seven years trying to figure out how to manage stress and sleep well. I clearly haven't done a great job at that, but it's a lot better than it was. yeah, mental health, spending time with family, friends, keeping perspective that this isn't life or death. That's the main part. Whatever it takes.\r\n\r\n\r\nNik (46:31.76)\r\nLove it. OK.\r\n\r\n\r\nNik (46:53.148)\r\nYeah, love it. right. Last question. What advice would you give to your pre -entrepreneurial self?\r\n\r\n\r\nReg (47:01.07)\r\nSeriously think about the W -2 and that seven -figure job you would have had anyway, so\r\n\r\n\r\nNik (47:06.812)\r\nThat's the best advice. That is the best advice anyone's the realest and best advice anybody has given yet. That's that's amazing.\r\n\r\n\r\nReg (47:08.916)\r\nHa! Luck! Man!\r\n\r\n\r\nReg (47:17.006)\r\nHey, yeah, my buddies have some buddies. I mean, they're like they're getting close to C suites and fortune 500 is there Yeah, I get it. I get it my wife CEO of a private equity based firm and my couple of my buddies in that CEO group I talked about we're like, wait a second They just gave her like 5 % of the company with zero money into this. Like what what do we do? Why are we doing this? Like To make all the decisions so be careful with that trade\r\n\r\n\r\nNik (47:44.587)\r\nmy god. It's true. It's a trade off.\r\n\r\n\r\nReg (47:47.626)\r\nhey, I haven't done a single telephone in seven and half years, so I'll call it even right now. It's fine. Yeah, exactly.\r\n\r\n\r\nNik (47:51.334)\r\nWe'll call it even. Dude, has been rad, man. Thank you for coming on and sharing this with us. What is the best place for people to come find you?\r\n\r\n\r\nReg (47:55.959)\r\nAgain.\r\n\r\n\r\nso right now still at red Zeller on Twitter or X or whatever we're calling it. I've been admittedly between trying to enjoy a little time and dealing with all the business heartaches right now. We've been, I've not been on there very much, so I'll get back on there. Once we get this thing, the ship's, straight and I'll, talk all about it. Josh and I'll probably talk more about it, about all the stuff we went through and what it took to get there and how we came out the other side. But yeah, right now it's just don't have the time.\r\n\r\n\r\nBut we'll be yeah, there's still there's plenty of plenty of content if you want to go stroll back through there It's just a random like whatever comes into my head goes on to Twitter like I remember going through this or all that or I'll talk to somebody I was like, everybody should know about this which hopefully it helps some people if not, it's just the incessant\r\n\r\n\r\nNik (48:28.422)\r\nI don't blame you. I don't blame you.\r\n\r\n\r\nNik (48:43.716)\r\nIt does. It does. It does. All right. Well, I appreciate you for coming on, spending time. We'll talk soon.\r\n\r\n\r\nReg (48:49.134)\r\nThanks, Nick. Appreciate it,",
  "metadata": {
    "duration": "",
    "date": "2024-11-25",
    "platform_source": "Google Drive"
  }
}