{
  "episode_number": "137",
  "episode_title": "How to Avoid Losing Money on Commissions When Selling Your Property with Amanda Orson",
  "guest_name": "Amanda Orson",
  "business_name": "Galleon",
  "transcript": "﻿Nikolas Hulewsky (00:00.055)\r\nand edit it later. All right, Amanda, I'm super stoked to have you. I'm gonna start out with one question. Real estate is one of the most outdated industries in the world, right? And like lots of people have been talking about and trying to disrupt it for decades. Why do you think Galleon is different? And well, I guess first, what is Galleon? And why do you think it's different than what everybody else has always done?\r\n\r\n\r\nAmanda Orson (00:23.0)\r\nSo Galleon is trying to build a future for consumer-driven real estate transactions. Basically, if you can think in analogies, what Robinhood did for securities, what Expedia did for travel, we think that there's gonna be a future where there are still real estate agents, just as there are still stockbrokers or there are still travel agents, but it won't be the only way you do things, right? Like, if you think about the problem from first principles and you're trying to build what you would do.\r\n\r\n\r\nNikolas Hulewsky (00:42.603)\r\nMm-hmm.\r\n\r\n\r\nAmanda Orson (00:48.216)\r\nto transact real estate, you would not invent what we currently have and have enjoyed for the last 112 years.\r\n\r\n\r\nNikolas Hulewsky (00:54.411)\r\nWhat's the thing people hate the most about real estate?\r\n\r\n\r\nAmanda Orson (00:57.324)\r\nI think that that is a highly individual response based on your experience. But generally speaking, it's manual. Like it's super manual. It's very old school. I joked last week that it still relies on things like faxes and in-person signing or wet ink signature. Like it's just very outdated compared to every other transaction in your life.\r\n\r\n\r\nNikolas Hulewsky (01:12.151)\r\nhuh.\r\n\r\n\r\nNikolas Hulewsky (01:20.161)\r\nYeah, it's really interesting to the dual party transaction fee where it's like the buyer and the seller have representative agents that are getting a percentage of it. And I mean, I've had a seller agent in the past. I'm like, what does this person even do for me? I'm not saying there's no value. I'm just saying 3 % of my property value is going to them upon close. It seems crazy.\r\n\r\n\r\nAmanda Orson (01:42.59)\r\nAnd the relative difference in the amount of work between selling a $100,000 house and a $1.5 million house is marginal, but the difference in compensation is very meaningful.\r\n\r\n\r\nNikolas Hulewsky (01:52.503)\r\nedit.\r\n\r\n\r\nMy brother is a real estate lawyer and he does a lot of, he lives in Southern California and does a lot of high end real estate transactions. So in those transactions, I do understand there's a lot more complexity to it, but in these like run of the mill, like you said, we are $1.5 million and less. It just seems it's like, it's so cookie cutter.\r\n\r\n\r\nAmanda Orson (02:14.734)\r\nAnd that's why we think that it's kind of crazy that we're still doing it the same way that it was invented in 1913 with the commission rates set in 1940.\r\n\r\n\r\nNikolas Hulewsky (02:22.849)\r\nOkay, walk me through that. Like how does it currently work? Why did they set the commission rates the way that they currently are?\r\n\r\n\r\nAmanda Orson (02:28.312)\r\nSo a long, long time ago in 1913, I believe that was either just past the inception of the National Association of Realtors or in its infancy. I don't know. I'm not a real estate agent. can't tell you. But very, very early on, they decided to basically gather all of the brokers and real estate agents and former cooperatives so that they could share details, information. They knew where the individual listings were. This was pre, not just like\r\n\r\n\r\nNikolas Hulewsky (02:50.369)\r\nMm-hmm.\r\n\r\n\r\nAmanda Orson (02:55.406)\r\npre not having the internet. This was pre phone books. Like there was nothing. All you had was an agent who really understood kind of what was for sale. At that point, the industry started to sort of formalize and the trade association was incredibly important for setting standards because a lot of the rules that we take for granted now, like fair housing, that wasn't a thing. We needed an ethical trade association to come in and sort of make this industry grow up, which isn't to say that it doesn't still have a place, but\r\n\r\n\r\nUnfortunately, over time, it has become, I'm trying to find a politically correct way of saying this. Yeah, it's, it's kind of a cabal. They\r\n\r\n\r\nNikolas Hulewsky (03:31.575)\r\nJust say it. Just say it.\r\n\r\n\r\nNikolas Hulewsky (03:37.259)\r\nI was going to say you were like, they form this cooperative. I'm like, a monopoly. mean like it.\r\n\r\n\r\nAmanda Orson (03:42.026)\r\nYeah, it's a monopoly. It's a monopoly. actually, by way of background, I worked in FinTech prior to this company. And one of the experiences of working in that industry is if you look overseas and things are very different than they are in the United States, almost always there's one of two reasons for that. There's either a monopoly or there's regulatory burden or regulatory capture or play. So in the case of real estate, we have a monopoly.\r\n\r\n\r\nthat has been basically centrally gatekeeping your access to the multiple listing service. So one of the first things we did with Galleon was ship a free and open and direct marketplace. Like you can impulsively almost list your house. It takes two minutes. We gather all of the details and background about it. You don't have to run around your house with a measuring tape, figuring out the script footage. We have all of that. We'll populate it for you. We'll write the property description with AI very, very quick and seamless and easy because the multiple listing service is completely gatecapped by\r\n\r\n\r\nthe real estate association. You have to be real turtle list.\r\n\r\n\r\nNikolas Hulewsky (04:42.871)\r\nOkay, so I'm an idiot. I'm gonna try to summarize what my understanding of the way things currently are, and then you can tell me where I missed. The multiple listing service is also known as the MLS, but usually what happens is if you wanna sell your home, it's very difficult to do for sale by owner. The way that homes are found usually is they're listed on this system called the MLS through a representative broker, and then buying agents, buying brokers,\r\n\r\n\r\nwho are representing buyers will go search the MLS and find based on the criteria of those buyers listings that may fit their criteria. Now Zillow has obviously Redfin has obviously helped like speed that process up where you're not just solely relying on an agent, but that's sort of what we're talking about here is like the MLS has served as the it's not CRM. What's the word ERP not ERP. The source of truth. I can't remember the name that it's actually given, but\r\n\r\n\r\nThat's where all of the listings are. And so what you're saying is, unless you were an agent, a registered agent in that state, you didn't have access to the MLS, correct?\r\n\r\n\r\nAmanda Orson (05:48.174)\r\nCorrect, to upload. The only thing I would add is that there isn't one MLS. There are actually like 500 of them. yeah, they're broken up. Some of them are, you know, one MLS represents more than one state. Some of them are multiple MLSs within one state, but there's like 500 or so of them in the United States. yes, they have their own form of cooperation and they cooperate with the major portals. So the one thing that's different about what you said,\r\n\r\n\r\nNikolas Hulewsky (05:54.518)\r\nWhat?\r\n\r\n\r\nNikolas Hulewsky (06:06.625)\r\nDo they all talk?\r\n\r\n\r\nAmanda Orson (06:16.942)\r\nversus reality is that in early 2000, yeah, your buyer agent did actually go and populate a list of relevant properties based on their search of the MLS. But right now, think 94 or 97 % of all homes are actually found by the owner on these portals that are just syndicating multiple listing service feeds.\r\n\r\n\r\nNikolas Hulewsky (06:40.435)\r\nSo is that what Zillow and Redfin are doing? Are they just syndicating the feeds? They just created a nice UI so that people can actually easily search that stuff.\r\n\r\n\r\nAmanda Orson (06:43.246)\r\nCorrect. Yep.\r\n\r\n\r\nAmanda Orson (06:48.376)\r\nThat is correct. And in fact, Redfin is a brokerage themselves and Zillow, although they have brokerage licenses, is not operating as a brokerage in that respect. They do have a relationship though with the National Association of Realtors. They joined themselves, I think in 2018.\r\n\r\n\r\nNikolas Hulewsky (07:06.773)\r\nInteresting, OK, so when was the rate like the percentage that the buyer and seller agent get upon sale of almost asset that you said 1940?\r\n\r\n\r\nAmanda Orson (07:15.566)\r\n1940, yeah. And it's not, so I say this with an asterisk because I will definitely get some, some hater aid from real estate agents who go, this has always been negotiable. Maybe, fine. It's always been something that somebody could talk about, but I've heard story after story and experienced firsthand, you know, no, this is not negotiable rate. It's somewhere between two and 3 % on each side of that transaction.\r\n\r\n\r\nNikolas Hulewsky (07:29.387)\r\nHahaha\r\n\r\n\r\nAmanda Orson (07:45.024)\r\nAnd it is correct. And I would say that the national average is probably around five.\r\n\r\n\r\nNikolas Hulewsky (07:45.121)\r\nSo anywhere between four and 6 % of the total transaction.\r\n\r\n\r\nNikolas Hulewsky (07:51.442)\r\nAnd that's what was it in 1940.\r\n\r\n\r\nAmanda Orson (07:53.934)\r\n5 6 percent.\r\n\r\n\r\nNikolas Hulewsky (07:55.675)\r\ninteresting. Okay, so the percentage hasn't really changed. Even though, like you said, since 2000, or since we've had the advent of systems like Zillow and Redfin, it's now the buyer who's bringing this to their agents, like they're doing a lot of the footwork on the front end, the work of the agent has actually come down relative to where it was maybe in 1940.\r\n\r\n\r\nAmanda Orson (08:14.222)\r\nCorrect. Correct. Correct. And we're, mean, just think about the difference from property values in 2000 to now, or 2010 to now, and 2020 to now. Yeah. And exactly. So if you actually plot this out, like the average price of the home from 1940 through right now, I think it's like,\r\n\r\n\r\nNikolas Hulewsky (08:27.637)\r\nYeah, or 2020.\r\n\r\n\r\nAmanda Orson (08:39.47)\r\nThe average home sale is $440,000 or something like that across the United States, and the median is like 500. If you plot that out, it is a perfect power law in revenue. commission revenue.\r\n\r\n\r\nNikolas Hulewsky (08:50.677)\r\nReally? I wonder if you plotted also at the same time the number of real estate agents, right? Like does it follow? I would assume.\r\n\r\n\r\nAmanda Orson (08:59.726)\r\nI have not, I have not tried to do that. I do know that I think we were at peak real estate agent in fiscal year 22. And in fiscal year 22, the largest single spender of lobbying dollars was the National Association of Realtors. It was not Moderna or Pfizer or Facebook or Halliburton or anything else. It was the National Association of Realtors. Their ground game on lobbying is unbelievable. Great playbook. They've done an amazing job at preserving their incumbent advantage.\r\n\r\n\r\nNikolas Hulewsky (09:15.774)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (09:28.501)\r\nWell, OK, let's do some back of the envelope math. You might know this off the top of your head. Do you know how many home sales there were in the year 2022?\r\n\r\n\r\nAmanda Orson (09:35.566)\r\nI think it was 5.1 or 5.2 mil.\r\n\r\n\r\nNikolas Hulewsky (09:37.877)\r\nOK, so five point, let's just say five million for easy numbers and then you said the app, the median home sale price is $400,000.\r\n\r\n\r\nAmanda Orson (09:44.142)\r\nThis year, is for, or I should say fiscal year 24, it was $430,000. Yeah. So I can tell you that last year, Americans spent $100 billion in commission.\r\n\r\n\r\nNikolas Hulewsky (09:54.251)\r\nthat well that was the number I was going to try to get to. they spent $100 billion in commission. So yeah, if you cut their commission even in half, it's $50 billion less.\r\n\r\n\r\nAmanda Orson (09:57.89)\r\nYeah. Yep.\r\n\r\n\r\nAmanda Orson (10:04.366)\r\nExactly. We've moved $20 million of real estate in our marketplace just in the last three to four months, which is usually the seasonal low. Like people do not normally sell in October, November, December. We moved 20 million through Galleon and they saved, I think, a million, 250, something like that in commissions. That was a million, 250 that went back into the pockets of 40 homeowners. Yeah.\r\n\r\n\r\nNikolas Hulewsky (10:29.409)\r\nSo that's amazing. That's amazing. I want to set the stage for people who are listening. So you're a multiple founder. You've had multiple companies. You've had experience in tech. What's interesting about this business, however, is that you haven't gone out and raised a bunch of money. You're bootstrapping it. That's why I thought it was so fascinating to talk to you because many times you will listen to that and like, well, sure, if I could go raise VC money, I could do a business like this. But what I wanted to ask you first is the hundred billion dollars in commissions. Would you say that's the TAM?\r\n\r\n\r\nlike the total adjustable market.\r\n\r\n\r\nAmanda Orson (11:01.624)\r\nthink the actual addressable market is the N of people that would try a different way. So what we wanted to understand really early on before actually, we are actually venture backed. So I will say, but we've only raised one five and we don't need to raise again. So I would say the TAM is probably the number of people that would do this if they had the tools to do so. And right now the internet is set up for you to fail at doing this for yourself.\r\n\r\n\r\nNikolas Hulewsky (11:13.017)\r\nokay.\r\n\r\n\r\nNikolas Hulewsky (11:25.463)\r\nReally.\r\n\r\n\r\nAmanda Orson (11:31.072)\r\nin a way that fails back into this old tried and true way of doing things for the last 112 years.\r\n\r\n\r\nNikolas Hulewsky (11:37.759)\r\nWell, that was going to be my question. Like text, not stupid. And this is if this is $100 billion that's currently being spent on these commissions, why haven't they been able to disrupt it before?\r\n\r\n\r\nAmanda Orson (11:46.68)\r\nThere's too much money. The incumbents, it's classic innovator's dilemma. So anybody that's actually read Clayton Christensen or is familiar with the innovator's dilemma, it's classic innovator's dilemma. Basically, there are two kinds of incumbents. Ignoring for the moment, real estate, like ignoring for a moment the trade association. You're either a portal who sells ads and leads into real estate agents, or you are a low cost brokerage who makes your money on commission.\r\n\r\n\r\nSo Redfin is an example of a low cost brokerage. Confess is an example of a normal brokerage. On the ad side, you have homes.com, which is owned by CoStar, and you have Zillow. And Zillow in fiscal year 22, I think, earned 1.2 of its $1.9 billion of revenue selling these to real estate agents. You're just...\r\n\r\n\r\nNikolas Hulewsky (12:33.527)\r\nso their business model is predicated on the commission.\r\n\r\n\r\nAmanda Orson (12:38.594)\r\nYeah. Yep. In fact, if you were to list by owner on Zillow right now, you've got a few, you have a few different problems. Number one, that is buried in the navigation. The likelihood that anyone is ever going to see your listing is very low. You have to go into the nav, you have to do a dropdown, you have to select buy other non MLS properties. And the number is always so much smaller than whatever the multiple listing service listings are. Almost nobody goes there.\r\n\r\n\r\nNikolas Hulewsky (13:06.122)\r\nInteresting.\r\n\r\n\r\nAmanda Orson (13:06.326)\r\nSay that an intro, like say that a buyer does, then they hit the buy owner listing and the call to action is connect with a buyer's agent. So every inbound lead doesn't go to the homeowner. The inbound lead goes to the, has won the auction for the leads in that particular zip code times three, that lead is resold three times. And then because you fail to sell your own house, you are also a harvestable lead.\r\n\r\n\r\ninto selling and listing agents. And this is just one example. So.\r\n\r\n\r\nNikolas Hulewsky (13:39.799)\r\nDo you know, you probably know this. Do you know the Zillow origin story? Cause I don't know the origin story.\r\n\r\n\r\nAmanda Orson (13:46.104)\r\nSo I believe the origin story is that these guys were the founders of Expedia. And I think very early on, they had the same essential insight that we had. In fact, one of the things that I get asked frequently is, you know, why aren't you working with real estate agents? And I think that real estate agents do do a good job some of the time, not all of them. And they do provide a valuable service, but every other company that has attempted this.\r\n\r\n\r\nNikolas Hulewsky (13:51.327)\r\nokay.\r\n\r\n\r\nNikolas Hulewsky (13:56.128)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (14:07.777)\r\nMm-hmm.\r\n\r\n\r\nAmanda Orson (14:13.398)\r\nincluding Zillow, including Redfin, I'm sure has discovered the same thing that I have discovered, which is that if we just started selling these to real estate agents, we would hit a power law revenue opportunity pretty quickly. If you support the status quo, it goes fast, but that's not the future.\r\n\r\n\r\nNikolas Hulewsky (14:29.163)\r\nYeah, that's what I was going to ask is like, did Zillow get into this game thinking, we're going to disrupt the market and then realize, actually, we could generate really good revenue just by keeping the real estate agents in place and sending them business. And so they just leaned into that.\r\n\r\n\r\nAmanda Orson (14:42.316)\r\nYeah, I think that's the way everybody has done it so far. I think, I believe that Zillow was first and then was Trulia and Redfin came shortly after.\r\n\r\n\r\nNikolas Hulewsky (14:50.433)\r\nSo if what I'm hearing is right, the biggest problem for many comp, well, not biggest problem. Many founders that I see who are like, I have this app idea or, I have this idea. It's a, one of the big problems is they're like trying to create a marketplace. And with marketplaces, you have to have the buyers and the sellers who are willing to go to it. What you're saying is like Zillow realized pretty quickly, okay, we're going to have to build a marketplace. It'd be much easier if we just kept the current marketplace in place and just sent them leads.\r\n\r\n\r\nas opposed to changing the business model. Is that a fair characterization? Okay.\r\n\r\n\r\nAmanda Orson (15:23.918)\r\nI would say yes. And it was also super early. Like at the time, nobody was aggregating all of the multiple listing services. There were even more MLSs than there are today. So at the time, their first innovation, which, and I take nothing away from Spencer Raskoff, cetera. Like those guys were great. We're amazing. We wouldn't be where we are today without them. But in 25 years, a lot has shifted. And this particular business model, the old school way that we continue to transact.\r\n\r\n\r\nNikolas Hulewsky (15:32.773)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (15:38.502)\r\nyeah.\r\n\r\n\r\nAmanda Orson (15:52.638)\r\nis clearly antiquated. Like every other transaction in your life has gotten simpler, cheaper, and faster. But this one.\r\n\r\n\r\nNikolas Hulewsky (15:53.973)\r\nYeah, and I\r\n\r\n\r\nNikolas Hulewsky (15:58.111)\r\nnot, I'm not passing judgment. You know what mean? I'm just like, what is it like, that's what I'm interested in. And like, okay, cool. That's just the way that it's currently set up. What? yeah. Yeah, totally. What's changed though, like, so what's allowed you to actually create the marketplace, because that's what galleon is, right? Like, it's, it's a it's a marketplace for buyers and sellers to go without intermediation, like without having, you know, an agent actually represent them on either side. So what what changed that\r\n\r\n\r\nAmanda Orson (16:04.822)\r\nYeah, I think that they just made a lot of money. Why change who's making money?\r\n\r\n\r\nNikolas Hulewsky (16:28.617)\r\nactually will allow Galleon to be successful.\r\n\r\n\r\nAmanda Orson (16:32.206)\r\nthink a few things. One, everything is so much more expensive. The opportunity to not have to come out of pocket 6 % is very meaningful on the supply side. So being able to get people that want to list their house in a way that will actually be seen in a well-merchandised listing that doesn't resell all of the inbound leads to real estate agents who will implicitly cost them at least 3 % is a very meaningful value problem. Like we have no problem getting supply in right now, galleon.\r\n\r\n\r\nNikolas Hulewsky (16:44.311)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (17:01.526)\r\nYeah.\r\n\r\n\r\nAmanda Orson (17:01.93)\r\nis actually the largest single place on the web where you can find off-market real estate in the United States.\r\n\r\n\r\nNikolas Hulewsky (17:07.793)\r\nconsumer preference has changed. That's the biggest thing is that they're willing to actually look other places to not have to spend 6%.\r\n\r\n\r\nAmanda Orson (17:10.818)\r\nYeah.\r\n\r\n\r\nAmanda Orson (17:15.022)\r\nYes. And we had a rule change. So the national association had a big lawsuit that was found against it in the end of, I think, 2023. And the rule changes went into effect back in August. So what now happens is the buyer doesn't necessarily, excuse me, the seller doesn't have to indicate whether or not they're going to compensate the buyer agent. Now, most people are still compensating the buyer agent, but\r\n\r\n\r\nNikolas Hulewsky (17:21.815)\r\nThat's right.\r\n\r\n\r\nNikolas Hulewsky (17:39.017)\r\nYeah.\r\n\r\n\r\nAmanda Orson (17:40.672)\r\nIt's no longer a given, like it had been for the prior 111 years.\r\n\r\n\r\nNikolas Hulewsky (17:45.525)\r\nIt was negotiable, Amanda. I don't know if you knew that or not. Sorry.\r\n\r\n\r\nAmanda Orson (17:50.139)\r\nYeah, it was negotiable where they just were like, you know, see ya try someone else. Yeah. Well, I mean It's just a bunch of talk. It wasn't actually negotiable\r\n\r\n\r\nNikolas Hulewsky (17:58.443)\r\nYeah, when you're when you're in a position of power like that, and you hold all the cards and you sure you could say it's negotiable. But what incentive do you have to negotiate you have zero incentive to negotiate it anyways. So when you say it was a given in the past that they would compensate the buyer's agent, it's no longer a given.\r\n\r\n\r\nAmanda Orson (18:14.872)\r\nCorrect. So the Lister, the seller offered five or 6 % and the seller through the sale, the proceeds of the sale of their home was going to compensate both agents on the deal. Right now that is still happening, but it's only still happening through a part of the transaction that's not fit for that purpose through what we call seller concessions. Seller concessions are meant to be like, I have a hole in my roof. So here's 20 K off. It's not.\r\n\r\n\r\nNikolas Hulewsky (18:34.711)\r\nMm.\r\n\r\n\r\nAmanda Orson (18:42.19)\r\nHey, you brought an agent and let me compensate them through this. That was not what it was intended for, but that's currently how they're actually compensating buyer agents. They're just not advertising it or able to advertise it on the multiple listing service anymore.\r\n\r\n\r\nNikolas Hulewsky (18:53.963)\r\nYeah, it's interesting. It always felt and again, I like real estate agents that I know, and they're they're just playing the game on the field. You know what mean? Like any real estate agent that you know, they don't make the rules. They're just playing by the rules. So like this is no judgment on them. But I always felt like it was mafioso in the sense where it's like, hey, listen, I have to sell my house, but I'm paying the buyer's agent for this. I listen, it's negotiable, but you, you won't get listed with me if you don't do that. So you you know, you got to\r\n\r\n\r\nAmanda Orson (19:01.388)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (19:24.001)\r\nPlay to pay to play the play to play the game, so to speak. It was always weird to me because have you ever bought a small business with like an SBA loan or any loan? OK, so when you buy a business with that loan, the deal costs get rolled into the loan. So if I'm using an attorney or if I'm using the bank or to do the underwriting, those costs get rolled into it. And so effectively I'm paying for a lot of those deal costs. Out of the loan and it's amortized over time, so.\r\n\r\n\r\nAmanda Orson (19:33.315)\r\nnot.\r\n\r\n\r\nNikolas Hulewsky (19:53.527)\r\nWhen I was buying my house, I'm like, I don't understand. Like now, right? Not my first time. I wasn't a business owner when I bought my first house, but now I'm like, I don't understand. Why don't you just roll the fee into your loan? You're the buyer, pay your seller, or excuse me, pay your agent out of the loan that you're getting to buy at this house, right? And have it amortized. But obviously it doesn't work that way. It just was interesting to me the way that it's currently set up.\r\n\r\n\r\nAmanda Orson (20:14.87)\r\nYeah, I think that there will definitely be like, so right now, because of macroeconomic conditions, anybody who's listed right now on the MLS needs to sell. There's like a death, there's a baby, there's a new job, there's a reason, like they are selling because they need to, because the interest rates are so high. Nobody here is opportunistically selling through the traditional way. And for that reason, I think we're still stuck where the seller is still comping the buyer agent. That's not going to last.\r\n\r\n\r\n100 % that's not going to last. And a lot of people who like to tell me that. I just keep thinking about how many people you've never met before that you're doing a deal with that you feel so good about, you're going to like give them a free $15,000.\r\n\r\n\r\nNikolas Hulewsky (20:58.539)\r\nYeah. 15,000 dollars.\r\n\r\n\r\nAmanda Orson (20:59.246)\r\nIt's not going happen. And that's a very small commission, Like coastal cities, you're looking at an average house price of 800, a mil two, something like that. Do 6 % of that. You're talking about $45,000. You're not going to give that away. It's not going to happen. So as soon as this market flips and buyers have to start paying their buyer agents, and that will happen, now you're going to have a problem of how are you financing that?\r\n\r\n\r\nNikolas Hulewsky (21:16.693)\r\nNo.\r\n\r\n\r\nNikolas Hulewsky (21:24.533)\r\nOkay, so let's thank first of all, thank you for the history lesson. That was awesome. Let's talk about galleon. How does it work? If I did a post recently, right, we're in a very fortunate situation where we don't need to sell our house, we're moving into another house. And I just wanted to know, like, what should I do with this? Should I rent it out? Should I sell it? How would it work? And you sent me, I said this to you before we started the nicest message I think I've ever gotten on Twitter. And it wasn't you weren't complimenting me. But it was like,\r\n\r\n\r\npages worth of, hey, I just did this. And this was the process. Here are some recommendations. And it was awesome. Like, I just couldn't believe you gave me kind of that much free value. But I'm like in this process of like trying to figure out what am I doing with this house? And so you reached out and you're like, by the way, I also have this startup, like I'm not pitching you on this. But if you do end up selling it, check this out. So that started this conversation. So that preamble, tell me about how galleon actually works.\r\n\r\n\r\nAmanda Orson (22:23.416)\r\nSo in the front, it's a marketplace. It's free, open, and direct. Think about what Craigslist was only in the narrow lane of real estate. That's really sort of the idea is that it's free, open, and direct with one really important and meaningful difference. We're doing identity verification on either side of the deal. So if you list a house on Galleon, we're doing KYC and background to make sure that that identity is associated with the deed.\r\n\r\n\r\nNikolas Hulewsky (22:44.183)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (22:51.895)\r\nCan you define KYC?\r\n\r\n\r\nAmanda Orson (22:53.59)\r\nknow your customer, it's an identity check.\r\n\r\n\r\nNikolas Hulewsky (22:55.327)\r\nIf you're if you're in crypto, you know, KYC, but you know those of you aren't in crypto.\r\n\r\n\r\nAmanda Orson (22:57.591)\r\nYes.\r\n\r\n\r\nAnd then when you get a buyer inquiry, we're validating that that is a real natural human. It's not just like, you know, Joe Bob at joebob.com. want to buy your house. And then only post identity verification. Do we pass that on to the actual person who's listed their property? So it's a free and open marketplace with one really compelling value prop. If you're actually several, if you're a seller, you're getting all of your leads. not passing an intermediary who's collecting a lead.\r\n\r\n\r\nIt's not going to be something that we ship to, you know, someone else to harvest you for an upsell. It's going right to you. We've identified you for the buyer. We've identified the buyer for you. High trust. And you don't have to expose any of your personal details. Like, so unlike Craigslist, you're not exposing your email address or your phone number or anything like that. So the marketplace is completely free and open. We have just shipped our Navigator product. Navigator is basically a transaction software.\r\n\r\n\r\nNikolas Hulewsky (23:47.991)\r\nHow do you get paid?\r\n\r\n\r\nI know that.\r\n\r\n\r\nAmanda Orson (23:56.524)\r\nSo if you wanted to actually go through the process of selling your home, you can purchase Navigator from us or at a lower price point, we'll coordinate professional photography for your place. Right now that's $2.99. But you can actually purchase our Navigator software. We'll take care of the professional photography. We'll send you a sign with a personalized QR code that goes right to your property so people can see and interact with it right there in the high trust authority way without putting like your personal phone number out on the street. And you know,\r\n\r\n\r\nAll of the actual process of selling your home is using software like you would do anything else.\r\n\r\n\r\nNikolas Hulewsky (24:29.995)\r\nYeah, I think what's interesting is there's always going to be a segment of the market that is DIY and the segment of the market who's done for you, right? And so like, even if and when people start going away from there's going to be people who are like, I just want it done. I don't even want to have to like deal with it. I don't have to want to negotiate with anybody. So I think that's kind what you were saying in the beginning with, okay, $100 billion in transaction fees, but the total addressable market is really only those people who will actually go and do\r\n\r\n\r\nAmanda Orson (24:37.016)\r\nYeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (24:59.585)\r\nthe negotiation, the listing by themselves, vetting all that stuff. Is that fair?\r\n\r\n\r\nAmanda Orson (25:04.046)\r\nYeah, I would say that's fair. And I think that we tend to underestimate how big that population is. So if you're somebody that's totally hands off, yeah, you should pay the premium for a bespoke service, 100%. Like, you're, negotiate your 6%, but you should probably be paying a commission. If on the other hand, you feel comfortable doing things like, know, calendaring and you have done other kinds of negotiations of any kind in your life, which is almost everybody.\r\n\r\n\r\nwhy not give it a shot? It's free. It's free.\r\n\r\n\r\nNikolas Hulewsky (25:34.881)\r\nWhy not give it a shot? last year, or I guess, how long have you had the marketplace open?\r\n\r\n\r\nAmanda Orson (25:41.272)\r\nsince the 10th of January last year.\r\n\r\n\r\nNikolas Hulewsky (25:43.024)\r\nJanuary. Okay, so last year, what was total sales transaction volume?\r\n\r\n\r\nAmanda Orson (25:47.19)\r\nIn the last four months of last year, we did 20 million.\r\n\r\n\r\nNikolas Hulewsky (25:50.069)\r\nWow, and then what was the estimated like savings to the buyer and seller?\r\n\r\n\r\nAmanda Orson (25:54.926)\r\n1 million, 250. So yeah, it's about 40. I'm probably doing the math slightly wrong, but it's about 40 families that ended up pocketing a million, 250 in commissions that they didn't need to spend. That's a meaningful amount of money. Most Americans can't handle a $400 oops. Imagine getting a $30,000 windfall.\r\n\r\n\r\nNikolas Hulewsky (25:56.767)\r\nsame.\r\n\r\n\r\nNikolas Hulewsky (26:10.539)\r\nvery meaningful.\r\n\r\n\r\nAnd you're. And you're not getting a percentage of the sales transactions. OK, so how are you making money? Because my mind just goes like are you going to fall into the Zillow trap of will just sell leads to real estate agents? Obviously you have the Navigator, but you just launched that. How do you currently generate revenue?\r\n\r\n\r\nAmanda Orson (26:17.036)\r\nNo. Nope.\r\n\r\n\r\nAmanda Orson (26:31.796)\r\nSo we just launched Navigator. That's the most important thing. Pulling as much of the transactions into software is really important. I think what ends up happening, and I'm going to be very transparent. I think what ends up happening is that Galleon becomes a B2C to B model, where we actually offer Navigator for free to individuals that want to sell themselves. And then we end up monetizing the referrals in that transaction relationship. Because every time you sell a house, you have to engage with\r\n\r\n\r\na host of different vendors that you would have to engage with whether or not you're using an agent.\r\n\r\n\r\nNikolas Hulewsky (27:06.903)\r\nLike I'm an idiot. So walk me through practically what that means. I think I'm like, you're very smart. So obviously you explained it very well, but just in a practical sense, what does that mean?\r\n\r\n\r\nAmanda Orson (27:10.35)\r\nSure.\r\n\r\n\r\nAmanda Orson (27:17.784)\r\nSo if you're a buyer, for example, you have to think about financing. How are you determining who you're going to use for the mortgage? You're going to have to think about property insurance. Where are you sourcing property insurance? Every one of those points of the transaction are all things where you're going to engage in a net new business relationship on both the buy and the sell side. Like on the sell side, you have to think about things like maybe a preemptive property inspection, moving.\r\n\r\n\r\nNikolas Hulewsky (27:27.063)\r\nHmm.\r\n\r\n\r\nAmanda Orson (27:46.19)\r\ncleaning, contracting, but both of these sides of the individual sale have a lot of vendors that you're going to interact with, regardless of whether or not there's a real estate agent involved.\r\n\r\n\r\nNikolas Hulewsky (27:56.873)\r\nYes, we'll have like potentially someone who's drawing up the contract, the sale contract. You're going to have obviously the inspection on both sides. You're going to have listing fees. OK, that makes sense. So then eventually it would be a freemium model essentially for me, the seller. But for those vendors, they're going to be paying for access basically.\r\n\r\n\r\nAmanda Orson (28:17.262)\r\nYeah, it's a super highly qualified lead is the way that I would describe it. You have somebody that's actually going through this transaction. And if you think about it, most of what we rely on real estate agents doing is understanding who the local title person is, who the local property inspectors are, and making those introductions for you. It's just taking that database, if you will, moving it to the cloud, and then finding ways to broker those introductions in a highly contextually relevant and personalized way.\r\n\r\n\r\nNikolas Hulewsky (28:20.416)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (28:32.609)\r\nMm-hmm.\r\n\r\n\r\nAmanda Orson (28:46.798)\r\nIt's really important that I say that we're not going to steer anybody to any one vendor, but give them an option of a couple. And then through that introduction, monetize.\r\n\r\n\r\nNikolas Hulewsky (28:55.147)\r\nWell, I'm assuming, I don't know, but I would assume you probably want to have some type of vetting process even for the vendors who are going to come onto your platform. So that would be the like, okay, I'm not steering you and saying you should use this person, but we've done our due diligence. We've vetted this person. They're a, they're a galleon vetted vendor, whatever, you know, whatever you want to call them.\r\n\r\n\r\nAmanda Orson (29:00.846)\r\nCorrect. Yeah.\r\n\r\n\r\nAmanda Orson (29:13.912)\r\nDo know, do you have an Airbnb or have you ever stayed in Airbnb?\r\n\r\n\r\nNikolas Hulewsky (29:18.233)\r\nI mean, I've stayed in there every year, but I don't have one.\r\n\r\n\r\nAmanda Orson (29:19.5)\r\nOkay, so if you are a host, if you look like inside the host portal, what's not visible to the people that are guests is that under the hood, Airbnb is basically a marketplace of marketplaces. They provide all of these service relationships around a world at this point. Very similar concept. The density of our own network isn't just having the largest inventory of off-market real estate.\r\n\r\n\r\nIt's also having the largest database of all of these individual vendors across the United States and verifying them so that we can make the best in class recommendation to the people that list with us.\r\n\r\n\r\nNikolas Hulewsky (29:56.887)\r\nMy question to you is, you said you raised venture 1.5. Do think you'll have to raise again? Okay, that is interesting to me because it's very different than what it's been in the past. Like usually these tech companies will raise a lot of venture and then they'll raise another round and then another round and another round. And this is a crazy stat, but like 50 % of those dollars end up on either Google. that's my son. He's yelling.\r\n\r\n\r\nAmanda Orson (30:01.132)\r\nMm-hmm. I don't.\r\n\r\n\r\nAmanda Orson (30:23.086)\r\nI hear.\r\n\r\n\r\nNikolas Hulewsky (30:25.207)\r\n50 % of those dollars end up on either Google or Meta because they need to acquire customers, right? Like it's just all on marketing. What has changed for you? Like, why do you only need to raise 1.5 million? Don't you still have to go and acquire all those customers or like, why don't you have to raise again?\r\n\r\n\r\nAmanda Orson (30:44.28)\r\nSo I should say, if we have the right strategic, I would take outside capital, but only to accelerate what's already on fire. I would use it as acceleration capital, not where we're getting the PMF in one or more categories. For that, think seed strapping is probably, I think we're early, but I think that's probably what you're going to see more and more companies do. Yeah.\r\n\r\n\r\nNikolas Hulewsky (30:52.373)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (31:04.331)\r\nSeed strapping. Go on. I don't know that I've ever heard that.\r\n\r\n\r\nAmanda Orson (31:08.342)\r\nSo seed strapping is basically taking outside capital once. In our case, it's because we came with a team. That's why we took capital at all. We came with an embedded team that had all worked together at a different company for about three years beforehand. So that was a heavy payroll load for lack of better way to describe it. We needed to have outside capital to give us runway. Seed strapping is basically take outside capital to get your initial product off the ground and to get to revenue and then use rapid revenue reinvestment.\r\n\r\n\r\nNikolas Hulewsky (31:14.785)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (31:23.873)\r\nYeah.\r\n\r\n\r\nAmanda Orson (31:36.866)\r\nto accelerate your growth and preserve optionality and for the founders to preserve as much of the valuation as you possibly can.\r\n\r\n\r\nNikolas Hulewsky (31:42.263)\r\nequity. Okay, so that was the point of launching Navigator. now you can start generating revenue.\r\n\r\n\r\nAmanda Orson (31:50.446)\r\nYeah. I mean, between Navigator and the B2B directory, we should be very fine. I think this is probably something that if we had been a year later, we probably would not have had to raise capital at all because the difference between 2023 and today, 2023, we were still coding almost everything manually with complement. And now I would say something like 50 to 60 % of our code, maybe more than that, is completely AI generated. Yeah.\r\n\r\n\r\nNikolas Hulewsky (32:17.803)\r\nYeah, that's what I was going to ask is like, AI allowed you to run more lean?\r\n\r\n\r\nAmanda Orson (32:20.782)\r\nCorrect. Yeah, I don't anticipate ever needing to have more than, I don't know, Wildest Dreams 50 employees, but probably closer to 20.\r\n\r\n\r\nNikolas Hulewsky (32:33.247)\r\nWow, that's pretty awesome. Because a lot of these companies in the past, they needed the capital not not just to go acquire customers, right, but they had to pay for the infrastructure. And they were like, Okay, well, once we get to 100 million users, that's our break even. It's like, well, geez, Louise, you're burning cash operating and you're burning cash, acquiring customers, and then at 100 million, you're like figuring out the economics, but you're saying you could be cash flow positive. Now, are you cash flow positive now? Are you like, on your\r\n\r\n\r\nAmanda Orson (33:00.258)\r\nWe're right on the bubble. I would say right now there is a company being born or already exists, so it be the first single person unicorn, like billion dollar evaluation company. That's already happening. I'm confident of it. The amount of work that I can get done with operator, just ChatGPT's operator, which I know that you created great content for, is probably replacing two or three human beings. like, no, no, go ahead.\r\n\r\n\r\nNikolas Hulewsky (33:26.679)\r\nDo you, sorry. No, no, no, no, you go,\r\n\r\n\r\nAmanda Orson (33:30.294)\r\nI was going to say, play that out. That's today. Imagine how much more efficient and how much better and more robust that tool becomes in six months or a year. The rate of acceleration is crazy.\r\n\r\n\r\nNikolas Hulewsky (33:40.011)\r\nTell me what's your current revenue? MRR, is that how you're measuring it? Okay, 60K, that's fantastic. When did you launch Navigator?\r\n\r\n\r\nAmanda Orson (33:44.31)\r\nSo our 60, yeah, 60K.\r\n\r\n\r\nfour weeks ago.\r\n\r\n\r\nNikolas Hulewsky (33:52.855)\r\nWow, 60,000 in MRR in four weeks?\r\n\r\n\r\nAmanda Orson (33:56.29)\r\nYeah, B2B too. Like we have B2B on the other side of it.\r\n\r\n\r\nNikolas Hulewsky (33:59.712)\r\nWas it because of the relationships you already had? I mean, maybe I'm stupid. just feel like 60 grand MRR is a lot in four weeks.\r\n\r\n\r\nAmanda Orson (34:01.752)\r\nYeah. Yeah, I'm.\r\n\r\n\r\nAmanda Orson (34:07.47)\r\nSo we already had some business relationships, but also I'm not coming into this completely cold. Like I have to be honest that I'm at this point, I have a network, I kind of know who I'm going to call. I'm not figuring all of this out for the first time. So it's a bit of an unfair advantage, but if you have that, you can go really fast.\r\n\r\n\r\nNikolas Hulewsky (34:19.724)\r\nYou it.\r\n\r\n\r\nNikolas Hulewsky (34:24.699)\r\nYeah, I mean, that's, that's the whole game is find your unfair advantage and just hammer it home every single time. You know what mean?",
  "metadata": {
    "duration": "",
    "date": "2025-03-24",
    "platform_source": "Google Drive"
  }
}