{
  "episode_number": "44",
  "episode_title": "How a College Dropout Built an $80M Business with Steven Montgomery",
  "guest_name": "Steven Montgomery",
  "business_name": "Rezzy Brands",
  "transcript": "﻿Nik (00:01.302)\r\nAll right, Stephen, thank you for joining me. Welcome to Nikonomics. I am stoked to have you. You we're gonna get into like the crazy cool stuff that's happened recently with your partnership with Cody Sanchez, know, pinks and that one painter blowing up. But before we get into like that stuff, give everybody an idea of what your business is and what you guys do to make\r\n\r\n\r\nSteven Montgomery (00:05.381)\r\nAnd\r\n\r\n\r\nSteven Montgomery (00:24.781)\r\nAbsolutely. So Rezzy Brands is a, what I call a platform brand. So we are in the home service franchising space with multiple brands. And now we have locations of franchisees all over the country. But why I call it a platform brand is because Rezzy exists to support all of our franchisees. We've got a connection center, kind of like an appointment call center. have a marketing agency and we have a lot of support through vendors, national accounts, all of that as well.\r\n\r\n\r\nBasically, if you've ever heard of neighborly, Rezzy is the next neighborly. Like we are, we're growing, we're adding two more brands this year. You'll see announcements soon. But we've got three brands right now and we're going to take over the home service space.\r\n\r\n\r\nNik (01:06.496)\r\nI love it. I'm gonna edit this part out, just so you know, if you see me looking down or typing, I'm not tweeting, I'm not like texting a friend, I'm taking notes. Yeah, when I have interviews and I like see somebody like drifting away, I'm like, okay, F this. I, don't want you to anyways. So the three brands that you currently have, name those one more\r\n\r\n\r\nSteven Montgomery (01:12.819)\r\nDon't worry, you're good.\r\n\r\n\r\nSteven Montgomery (01:27.429)\r\nYeah, so that one painter, Garage Up and Pink's Window Service.\r\n\r\n\r\nNik (01:31.67)\r\nAnd what do each one of those\r\n\r\n\r\nSteven Montgomery (01:33.841)\r\nThat one painter is, it's painting, paint and drywall. Yep. And the garage up is the first franchise grant to combine epoxy floors, storage and whatnot, as well as garage doors. So we call it the first ever total garage renovation franchise.\r\n\r\n\r\nNik (01:51.982)\r\nCool. And then Pink's obviously is window washing.\r\n\r\n\r\nSteven Montgomery (01:55.139)\r\nIt's window cleaning, it's pressure washing, gutter cleaning, solar panel cleaning. But the bread and butter is window\r\n\r\n\r\nNik (02:03.214)\r\nHow did you get into this space?\r\n\r\n\r\nSteven Montgomery (02:05.959)\r\nI dropped out of college 13 years ago. I was 21 and started painting a little bit here and there as side work. And then pretty quickly decided I wanted to do it on my own and build a company doing it. And so I started painting houses. It was just me. That was it. And I was an average painter. Wasn't even like a great painter.\r\n\r\n\r\nBut I knew that I could figure it out and so if I didn't know how to do something because we're like, Can you can you also do this little bit of carpentry on the siding and I'd be like, yeah sure and I've just YouTube it\r\n\r\n\r\nNik (02:43.362)\r\nDude, I admire guys like you, because I don't have that in me. Like my older brother, Caleb, who I freaking love to death, can figure anything out. He rebuilt this 1991 Jaguar that had an electrical fire, and he rewired the whole thing and bought it for a thousand, sold it for 10 ,000. He used to paint though. That's how he like paid, through college, and he made great money. But he'd take me on jobs, because they'd be jobs that were like too big for him to do by himself. And every time I can just hear him yelling at me. like, you hurry\r\n\r\n\r\nSteven Montgomery (02:59.686)\r\nyeah? Yeah.\r\n\r\n\r\nNik (03:11.63)\r\nCan you, no, not like that, Nick. my gosh. So I have like PTSD when I think of, when I think of painting, but I wish I could\r\n\r\n\r\nSteven Montgomery (03:14.253)\r\nYeah, That's funny. My younger brother, he was one of my first hires and I used to have him paint with me and he ended up becoming a firefighter and but for a couple years he painted with me and same thing. No, no, no, don't do it like that. And then I would walk by as he'd be like, you know, yelling at two story ladder and I just shake the ladder to scare him.\r\n\r\n\r\nNik (03:28.642)\r\nYeah.\r\n\r\n\r\nNik (03:37.902)\r\nIt's a dude having a having a brother is just so freaking cool. I have anyways, I could go off on a million tangents. So you got you dropped out of college 13 years ago. From a college dropout to doing a side hustle with painting to where you are now. How big is resi brands?\r\n\r\n\r\nSteven Montgomery (03:41.236)\r\nNo.\r\n\r\n\r\nSteven Montgomery (03:50.127)\r\nYeah.\r\n\r\n\r\nSteven Montgomery (03:54.951)\r\nRezzy Brands has a total of almost 450 franchise units.\r\n\r\n\r\nNik (04:00.526)\r\nAnd then, besides units, do you measure like on terms of revenue or bottom line, like yearly performance at\r\n\r\n\r\nSteven Montgomery (04:06.567)\r\nYeah, Rezzy Brands will do collectively at least 80 -ish million this year. And then we have so many units that are launching this summer or this fall. So next year, I don't know. mean, I have no idea, but it will be hundreds of millions next year. mean.\r\n\r\n\r\nNik (04:21.262)\r\nOkay, so when you started, right? When you did your side hustle, dropped out of college, is this what you had in\r\n\r\n\r\nSteven Montgomery (04:27.139)\r\nNo, I just didn't want to work for anybody else.\r\n\r\n\r\nwas like, called it that one painter because my first business card that I made when I was kind of just doing like as a side hustle, it was just called Steven paints, like a a caveman me paint like so and then I was watching I was like, I need a better name. I don't want it to be my name. And then I was watching that 70 show and that one painter and then and then it just was like literally was me. It was like that\r\n\r\n\r\nNik (04:53.452)\r\nOkay, okay.\r\n\r\n\r\nSteven Montgomery (05:00.187)\r\npainter because it was just me painting houses. Like that is exactly how big my vision was.\r\n\r\n\r\nNik (05:05.772)\r\nYou just wanted to be able to control you, right?\r\n\r\n\r\nSteven Montgomery (05:09.851)\r\nI just wanted freedom. I didn't really care about anything other than freedom at that time. I didn't have any financial goals. I didn't have any goals of bringing on employees. I dreamt about it. Like it's not like I hadn't thought of it at all. And like for example, so my dad briefly painted while I was in high school. So for like my freshman year of high school, my dad had a painting company. And so my freshman year of high school, like I remember the summers and then on weekends, I would paint for him a little bit and he quit doing\r\n\r\n\r\nAnd so that's, I had a little bit of like this taste of painting. Um, and I remember when I was like 14 years old, my dad had me working on a project on a Saturday in the winter. I'm like, it's like snowy outside and we're like doing an exterior job in Oregon. And so I remember I'm on a ladder dude and I was scraping siding, scraping siding off of, uh, scraping paint off of siding.\r\n\r\n\r\nNik (05:50.39)\r\nWhere are you? Oregon, stay.\r\n\r\n\r\nSteven Montgomery (06:01.863)\r\nAnd I remember thinking my dad's paying me eight bucks an hour. I know he charged $30 an hour. That's $22 an hour he's making off of my efforts. And I remember thinking if I hired like 10 of my friends and paid them eight bucks an hour, I can make $22 off of their labor. I was like, that's $220 an hour. like, it's like, I had a little bit of that entrepreneurial like mindset where I could dream and scale. But like when I decided to just go for it,\r\n\r\n\r\nI didn't have much aspirations to be honest. Like I just didn't want to work for other people. And I knew that I could make, you know, a few hundred dollars a day painting for myself. And so it was freedom.\r\n\r\n\r\nNik (06:44.014)\r\nIt's funny, I had a similar experience when I was a teenager. My brother painted our house. I must've been right around 14, because he was 20. Yeah, so I was around 14. For me, was scraping the eaves, right? Because you got to scrape the paint off there. And I was weak, and my arms were tired, except I didn't think I could get 20 of my friends. I was just like, I never want to do physical labor ever. I'm so terrible at this. And then my brother starts yelling at me. But yeah, it's funny.\r\n\r\n\r\nSteven Montgomery (07:12.839)\r\nI, I, I genuinely liked the physical labor. Like it, it, took a long time for me even to stop painting. Like I had to like, I like, I would, got to where I have a number of painters working for me and I would do the sales and management and I would still all the time go back to just picking up the brush and helping them figure out how to finish the project on time. And there, and I like to joke that like all the brushes behind me are all of the jobs I've had to fire myself from.\r\n\r\n\r\nbecause like that's what you have to do as an entrepreneur. And I remember very specifically there was a day and it was this job had four painters on it and they were supposed to finish by six o 'clock. They weren't done. I got there at like five forty five. They like two three hours of work left. We had another job in the morning and I remember I was like I went to go pick up the brush to help them finish it. I remember thinking if I keep doing this I'll never be able to keep growing my company.\r\n\r\n\r\nAnd so I'd like set the brush down and I told them I was like, y 'all finish it up. I'll see you at the other job in the morning, but I'm trusting you guys to get it done. And I just went home. And I think that's the moment I went from being self -employed to being an entrepreneur is like, I trust my team. I fired myself from painting fully. I took promise myself. I want to pick up the brush anymore. And then I just did that over and over and over again, right? Where it's like, I'm not going to do estimates anymore. I won't do project management anymore. I won't like now I won't talk to customers because\r\n\r\n\r\nI talk to my franchisees and I coach them. And it's like, you have to just keep growing with, you know, if you're going to scale, you have to bring on team members who hopefully are actually even better at those things than you are. Like I have painters that are better painters than me, you know, and, and, they should be. I have better sales guys than me.\r\n\r\n\r\nNik (08:40.93)\r\nYep.\r\n\r\n\r\nNik (08:47.801)\r\nYeah. Yeah, I haven't built, you know, an $80 million company, the largest that we ever got to is $30 million in a year in revenue. But like, I tell people all the time, like, there just different phases of being an entrepreneur. I freaking love the way that you described going from self employed to being an entrepreneur, because that is so true. In the beginning, you're doing everything yourself. And then there comes a time where you get big enough where you need to hire other people, but you're like managing the workers. And then past that, you start to\r\n\r\n\r\nSteven Montgomery (09:12.476)\r\nYeah.\r\n\r\n\r\nNik (09:16.558)\r\nproject managers. So you have like, you're managing the managers, but you're still CEO. There's still times you're like jumping into the business to get things done. And then around the $5 million a year in revenue mark is when you can get like a professional management team and almost take this, you have this decision point to make is like, okay, do I want to scale this thing? Or do I want to have just like a $5 million lifestyle business and, you know, work 20 hours a week? And that's, to me, that's kind of the inflection point. That's like five to $10 million mark.\r\n\r\n\r\nBut yeah, you're right. Every point along the way, you gotta make a decision on what am I gonna outsource to somebody else to handle? And it's scary, because you've never given it\r\n\r\n\r\nSteven Montgomery (09:50.285)\r\nevery single time is scary. Yeah, but it's the only way to scale. Cause if you can't delegate to your team and let them do it, like you get stagnant because like recently I had a meeting with my executive team. I just told them like, we're phasing me out of some of the operations completely. And I told them my kind of verbiage was I want to be focused on things that everyone sees and focused on things that no one sees. And I don't want to be in the middle. And for me, it was like everyone sees. So I'm like really focused on\r\n\r\n\r\nNik (10:15.394)\r\nHmm. Hmm.\r\n\r\n\r\nSteven Montgomery (10:19.119)\r\nContent that kind of stuff and then the things that nobody sees the deals that are being done the back the behind -the -scenes strategy all that but all the operations in the middle I've got like I've got four guys on my team that I've got that all the departments kind of roll up to those four guys and I've just trusted them completely on all the middle ops and so Yeah\r\n\r\n\r\nNik (10:40.398)\r\nSo for you, so you started this in 2011. How long was that self -employed period before you turned entrepreneur?\r\n\r\n\r\nSteven Montgomery (10:49.959)\r\nSo it's kind of like, I would kind of put it in like the last three years, we're in like three phases. Sorry, the last 13 years, we're in like three phases. The first phase was that me actually like painting with my painters. That went all the way up to like probably 20, probably 2014, somewhere in there is when I finally stopped painting 2015. Three, four years, yeah, I was really working in the business, like actually painting homes with a crew.\r\n\r\n\r\nNik (11:11.342)\r\nThree years. Three, four years.\r\n\r\n\r\nSteven Montgomery (11:18.631)\r\nAnd then I switched to like sales and management. I put down the brush and I had, I would run anywhere from two to four crews and that I did that all the way up until about 2018. So another, another three, four years there. And, and I realized I was like very, I was going to, I wasn't growing anymore. Like I was stuck cause I could only sell so much. could only manage. Yeah. Yeah. And so going into 2019, I hired a project manager. I hired an admin.\r\n\r\n\r\nNik (11:39.534)\r\nAnd this was in Austin.\r\n\r\n\r\nSteven Montgomery (11:47.367)\r\nAnd that's when we really rapidly grew. We doubled our revenue in 2019, doubled again in 2020, doubled again in 2021. And in 2021 is where we started franchising. And that's when things just\r\n\r\n\r\nNik (12:01.356)\r\nlarge were you when you hired that project manager and admin? What was your revenue?\r\n\r\n\r\nSteven Montgomery (12:07.191)\r\nI was on track for about a\r\n\r\n\r\nNik (12:09.326)\r\nOkay. Yeah. Man. Sorry. I'm like, I got a million, million questions rattling through my brain. How did you decide it was time to expand? Cause like you could have probably just, you're doing a million dollars a year running three or four crews. You're probably making, I'm going to guess two to $300 ,000 a year personally. I don't know. Maybe that's high, but comfortable lifestyle. Why? Why grow?\r\n\r\n\r\nSteven Montgomery (12:17.359)\r\nHa ha ha.\r\n\r\n\r\nSteven Montgomery (12:35.975)\r\nI was comfortable, super comfortable. I was really comfortable like 2016, 2017, 2018, those years running three, four crews. Like honestly, I didn't even work full time. was like, I would go home a lot at like three o 'clock, hang out with my, I had two very young children at that time, like so my first two kids and like it was pretty cushy, but like.\r\n\r\n\r\nAnd I was really involved with some nonprofit work in my church. And so I had like a really balanced, like comfortable lifestyle, obviously. And then I like really felt like I wanted to grow as a real entrepreneur. And I started reading books like the E -Myth. I started reading books like 21 Irrefeatable Laws of Leadership by John Maxwell. I really like, really something clicked in my head and I got way more organized. started, you know, up until that point, I was running everything off\r\n\r\n\r\nGoogle Docs and QuickBooks. And so in 2018, I switched to an actual CRM and I started writing SOPs and I built a training program and I did all this stuff that then as I started bringing on team members, we were able to scale really quickly. But so I don't know, it was just like a brain shift, like a mindset change where I went from honestly being kind of comfortable and balanced to no, I really want to see how far I can grow this. I remember I was sitting\r\n\r\n\r\nat a restaurant with my Sherwin Williams rep and he asked how much Like he said, what are your business goals? And I said I'm gonna and I didn't have business goals at that time I knew this was around the time where I was starting to think differently But I hadn't set any goals yet And so he asked me what my goals were and I just kind of pulled it out of thin air I was like, I'll be the I'll be the biggest painting company in Austin, Texas And he kind of laughed and said that's ridiculous\r\n\r\n\r\nAnd Eddie, Eddie said that and like he knew he saw my account. He knew exactly how much paint I bought versus the biggest one in Austin. Right. And so he's like, that's ridiculous. Like, what are you talking about? And and like, well, like now we're like the by far the largest painting company in all of Texas, like, you know what I mean? And we're on our way to being the largest in the US. And so\r\n\r\n\r\nNik (14:38.402)\r\nYeah.\r\n\r\n\r\nSteven Montgomery (14:56.399)\r\nI remember, so because he said ridiculous, that stuck with me. So now every quarter, and it's been this way for years, every quarter I set goals for the company and the theme is ridiculous something. So one quarter will be ridiculous health and the whole quarter's focus is we're gonna deep dive on health. And then the next quarter is ridiculous scale. So this quarter we're gonna deep dive on next level scaling. Every single quarter I have a different theme, but it's ridiculous something.\r\n\r\n\r\nAnd all because somebody doubted me.\r\n\r\n\r\nNik (15:30.22)\r\nAre you ADHD? You probably\r\n\r\n\r\nSteven Montgomery (15:33.052)\r\nyeah, I mean, I don't know. People say that I am sometimes, but yeah.\r\n\r\n\r\nNik (15:37.646)\r\nAll right, so one of the key characteristics or key traits of somebody with ADHD is the ability to hyper -focus. Which sounds weird, right? Because it's like, well, isn't it, you have a problem focusing? It's like, no, when you're really interested in something, you hyper -focus. I'm not gonna say similar to you, but I barely graduated high school. I had like a 1 .9 GPA. I went to community college for a little bit and like flunked out all my classes. And then I got married and something switched. And I went to community college and I ended up going to USC undergrad, UCLA MBA.\r\n\r\n\r\nSteven Montgomery (15:44.187)\r\nYeah.\r\n\r\n\r\nSteven Montgomery (15:55.195)\r\nYeah.\r\n\r\n\r\nNik (16:06.35)\r\nSo it was like, oh, I'm not an idiot. I kind of thought I was stupid for a long time. But it was because of like, you sometimes something just flips in your mind and you're able to hyper -focus on it. You have done some really interesting things. John Maxwell, who you just mentioned, the 21 year refutable laws of management or leadership is a mentor of yours. And you just partnered with Cody Sanchez, which again, we'll talk about in a\r\n\r\n\r\nSteven Montgomery (16:27.643)\r\nYour leadership, yeah.\r\n\r\n\r\nYes.\r\n\r\n\r\nNik (16:36.152)\r\nHow do you make the leap from I'm dropping out of college, self -employed, to I'm reading all these business books and you're building relationships with people like that? What did that transformation look like for\r\n\r\n\r\nSteven Montgomery (16:49.297)\r\nSo I wish like I could say like there was like this exact way that those things happened. Like I didn't plan on those things happening either. And like like I didn't reach out to like John Maxwell to have him mentor or like be involved with our brand at that capacity. We just like my assistant at the time reached out to see if he could speak. It was like way too much money.\r\n\r\n\r\nSo we have like an annual convention where our franchisees come together. So she reached out for a first Yeah, Rezikon so she reached out for a first one at that time was like we had like 27 territories like and like like 15 or 16 franchisees at that point. It wasn't a lot maybe it was 20 but And so like there was like no way that like all that was gonna work out So anyway, she ended up reaching out like it didn't go anywhere the next year she reached out again and\r\n\r\n\r\nNik (17:17.272)\r\nYeah,\r\n\r\n\r\nSteven Montgomery (17:41.773)\r\nShe, this time she reached out and she said something along the lines of like, don't think you guys understand how important John Maxwell is to our brand. And she goes, we literally get his books to every franchisee and at every staff meeting, Steven goes over one of the laws. I didn't tell her to say that she just was like her own initiative. Yeah. And so her chief of staff was like, get me on a call with Steven and sorry, the chief of staff from John Maxwell. So that was his response. So he said to her, give me on a call\r\n\r\n\r\nNik (17:59.726)\r\nThat's awesome.\r\n\r\n\r\nNik (18:07.598)\r\nRight, right,\r\n\r\n\r\nSteven Montgomery (18:11.271)\r\nSteven. So I got on a call, kind of share my story and he goes, Steve, once you just fly out here and we'll do a video and you and John Maxwell can like, he's like, we won't charge you hardly anything for it. Just come out here. John will do a video and you can play that at your convention or whatever. I was like, okay, cool. So I flew out there and so I'm on the plane out to where he's at in Florida. And I remember thinking, I'm going to see if I can just make this guy like my best friend.\r\n\r\n\r\nWhich we're not, I wouldn't say we're best friend level yet, but we are friends.\r\n\r\n\r\nNik (18:39.532)\r\nand you guys are really close in age and have a ton in common,\r\n\r\n\r\nSteven Montgomery (18:44.415)\r\nYeah, we're not like golfing every weekend together. But you know, and so I walked in we filmed the video afterwards. He's like, tell me a little more of your story. I'm telling him the story. I'm telling him our goals and he goes, hey, give me your phone number. And so I gave him my phone number. He's like, I have this idea. I want to mentor your brand. I'll call you tomorrow and tell you more about it. So he calls me the next day. I had a missed call, which is funny. I have that voicemail saved.\r\n\r\n\r\nNik (19:08.172)\r\nAlpha power move. You're like, I'm not answering\r\n\r\n\r\nSteven Montgomery (19:11.951)\r\nAnd I missed it intentionally because I had like my two year old with me and she was like everyone's like how did you not pick up that call? And I'm like I'm gonna pick up the call and have my two year old screaming in the background. was like there's no way. So I was like no like they pick it up. So I called him back like an hour later and and he kind of was like hey I only do this for you know a couple brands at a time.\r\n\r\n\r\nNik (19:20.856)\r\nDude. Dude, I've been\r\n\r\n\r\nSteven Montgomery (19:36.108)\r\nAnd I really think you guys would benefit from it. So you offered to like mentor us So he'll be at Rez -e -con. He does a monthly session with all of our franchisees. And so Again, like I didn't I didn't ask him to do that like at the time I wasn't even my idea to like pitch him in that way. It was an assistance idea\r\n\r\n\r\nNik (19:52.408)\r\nDude, you know what's cool about that that I admire about you is it's a special trait in leaders to get people to be unreasonably loyal to them. And like I have an executive assistant, her name's Kelly. She'll watch this video. Hi Kelly, I love you. Dude, she like goes to bat for me all the time with people and like responding to things or reaching out or asking for stuff.\r\n\r\n\r\nSteven Montgomery (20:02.105)\r\nRight.\r\n\r\n\r\nNik (20:18.092)\r\nbecause it's like they want you to succeed so bad and they're almost like offended that somebody else doesn't see what they see in you. So like just hearing her reach out to them and say that lets me know that like she's unreasonably loyal, right? Like she's like, I don't think you understand how important this is to him. And if it's important to him, it's important to me. So like that's rad. I love\r\n\r\n\r\nSteven Montgomery (20:37.151)\r\nYeah. Yeah. And I think that like that, what you're saying is, is, is true is like, there's a misconception that like to be successful, you have to just, you have to, you have to think of everything. You have to do everything. You have to have the hard work ethic. Yeah. But like you're, it's a lot better when you have a team that just wants to help you build something and, and they're going to have ideas that are better than your ideas sometimes. And they're going to have, sometimes they're going to think of things that you wouldn't even thought of, you know? And, and, and so I like,\r\n\r\n\r\nJohn Maxwell says there's no such thing as a self -made man. We're all the result of people that have invested into us. and I mean, for me, that's completely true. Like it's been employees, it's been mentors, it's been business coaches and consultants and all these different people that have like invested in me and believed in me, that have allowed me to be as successful as I have been up to this point. It's not just my efforts.\r\n\r\n\r\nNik (21:27.821)\r\nI\r\n\r\n\r\nYeah, I have this cute little saying on my Twitter bio, is like 100 % bootstrap, 10 % self -made. Because nobody is 100 % self -made. Everybody has breaks, everybody has mentors, and 10 % might be too generous to myself, actually. So tell me, how did you go from that one painter to the other two brands that you have? When did your thinking shift from, I'm going to be the biggest painter,\r\n\r\n\r\nSteven Montgomery (21:38.62)\r\nI love that. love that. Yeah. Yes.\r\n\r\n\r\nNik (22:00.386)\r\nin Texas to what you have now, which is like, we're changing the game and home services. Walk me through\r\n\r\n\r\nSteven Montgomery (22:06.651)\r\nYeah, yeah, yeah, I think just kind of everything else is just kind of happened in as we progressed, right? So originally, like again, it's not like I had the biggest vision in the world when we started franchising when we started franchising, the people that I had talked to in the franchise world to be like, look, dude, most people don't sell any in their first two years. So so originally, they're like, you should expect four in your first year of franchising or franchisees. I was like, OK, all\r\n\r\n\r\nSo I made a goal. was like, all right, then our goal is to get to just 20 franchisees. I didn't even set a time. I was just like, get to 20. It seems like that's around where like you start to have a healthy franchise system. So like not a huge goal. And then about a few, just honestly, a few months in a couple of months in, we already had seven. Uh, and so we started to set the goal a little bit higher. And so it started just picking up pace.\r\n\r\n\r\nAnd as it did a lot of the, and I have a business partner now. We, partnered in and he's actually my cousin and he was my first hire as a pro. He was my first project manager and he became a business partner along the way. And him and I were talking through things and we just realized that a lot of what we did was stuff that would make any home service successful, not just painting. And so we started garage up, is like garage renovations and stuff. Originally was just going to be a poxy floor brand.\r\n\r\n\r\nNik (23:08.93)\r\nThat's awesome,\r\n\r\n\r\nNik (23:20.398)\r\nMm -hmm.\r\n\r\n\r\nSteven Montgomery (23:27.923)\r\nAnd so we're like, let's let's and then it became more and we added garage doors and all that later on. And that one was a lot of learning curve. We did a lot of things wrong on the second brand because we didn't, and truthfully we we weren't focused enough on it. We were, was honestly too early to launch it, but anyways, it's now doing really, really well. We've brought in some. Yeah. Yeah. Something like that. Yeah.\r\n\r\n\r\nNik (23:49.582)\r\nYou were like 30, right? You're like 30, you're self -taught. Like, it's not like you had a ton of experience to draw on. I don't know that you did anything wrong. I just, you had to go through a learning curve. Yeah.\r\n\r\n\r\nSteven Montgomery (23:58.533)\r\nYeah, it was probably just a little early, but garage up is now doing really, really well. But it was, it took a while for that brand to get off the ground. And then since we had two brands were like, well, I had started a marketing agency with a buddy of mine who ran ads and I brought him in the company. And so we started marketing for all of our franchisees. Then we then I hired a couple of people on my team that had experience building call centers.\r\n\r\n\r\nWe built a call center. And so it was like, what do we do with all this? It's not just that one painter. It's now going to be two brands. And so we came up with Rezzi brands because Rezzi is short for residential. And we always, we always said that we are a Rezzi repaint company, which is so our primary service is residential repainting. We don't do a lot of new construction and we do a lot of, we are doing a lot of commercial now, but it's not our primary focus. So yeah. And\r\n\r\n\r\nNik (24:42.456)\r\nYou're not doing commercial jobs.\r\n\r\n\r\nNik (24:47.373)\r\nSteven Montgomery (24:50.043)\r\nWe're like, let's go with Rezzy. Cause we always said Rezzy repaint. so, yeah, yeah. And, and so we called it Rezzy brands, kind of put garage up that one painter and the like services we offered our franchisees kind of on all under that umbrella of Rezzy. then, a friend of mine introduced me to the pinks founders and, it was like, they were just super, super cool dudes. They thought of home services and.\r\n\r\n\r\nNik (24:52.93)\r\nFreaking great name. It\r\n\r\n\r\nSteven Montgomery (25:18.597)\r\nblue collar trades exactly the way we did. It was just like, it was just like a natural connection. I remember the second time we met with them. I had set my phone down like face down on the on the table and everybody had and we were at a restaurant and we talked for six hours and not a single not a single one of us looked at our phones. And when we did we were all all of us were like, holy cow, what time is it? Like all of us were like\r\n\r\n\r\nNik (25:20.716)\r\nMmm.\r\n\r\n\r\nNik (25:35.768)\r\nJeez!\r\n\r\n\r\nSteven Montgomery (25:46.887)\r\nLike, I think three of us were married at the time. Brandon's now getting married, so all four of us will be it now. But I think three of us all had like our wives were like, where the hell are you? Yeah, like really good conversations about home services.\r\n\r\n\r\nNik (25:56.846)\r\nWhat are you doing?\r\n\r\n\r\nNik (26:04.598)\r\nSo I didn't know, did you acquire pinks or did you merge with them or\r\n\r\n\r\nSteven Montgomery (26:08.943)\r\nYeah. So we acquired the franchise rights and Brandon Carter are our partners on, on Pinks. so Rezzi's, know, Rezzi acquired it, but they stayed on as partners.\r\n\r\n\r\nNik (26:19.618)\r\nAnd so you're, you're the franchise or essentially, is that how that works? You know, I had never, I'd never heard of pinks until a few years ago. And you guys did something that's I think is really, I don't know if it was you or them, but your merch is how I heard of you. Like people were, what?\r\n\r\n\r\nSteven Montgomery (26:22.213)\r\nYes. Yes.\r\n\r\n\r\nSteven Montgomery (26:37.051)\r\nYeah, that was all them. They're branding geniuses, dude. They're so good.\r\n\r\n\r\nNik (26:43.034)\r\nIt was great branding and I'm like seeing these guys walk around with pinks. I'm what's that? And they're like, that's actually a painting company you can get. like, or not painting, a window washing company. I'm like, what? Why would they be wearing that hat?\r\n\r\n\r\nSteven Montgomery (26:53.078)\r\nyeah that was all them dude they're they're freaking phenomenal at that stuff like they're just and Carter yeah\r\n\r\n\r\nNik (26:58.264)\r\nDid that segment of the business, like the merch sales, ever get close to like, I don't know, being profitable or like even being as large with your locations?\r\n\r\n\r\nSteven Montgomery (27:06.861)\r\nyeah. No, it's not like as large as it's not even close as large as their actual business, but it is it is like a legit like profitable part of what they have.\r\n\r\n\r\nNik (27:15.726)\r\nOkay. Dude, that is so fascinating. All right. So in what year did you acquire the franchise rights to Pinks?\r\n\r\n\r\nSteven Montgomery (27:24.519)\r\nUm, would have been like 12 months ago. Um, yeah, about, yeah, it was July. So we started talking. It was like five, five months of us going back and forth and talking and getting the deal done. And then I, we acquired them officially July of last\r\n\r\n\r\nNik (27:43.586)\r\nWhat made you decide to acquire as opposed to do something de novo? Like you had done the garage part of the business de novo. Why were you like, yeah, let's go ahead and acquire this brand.\r\n\r\n\r\nSteven Montgomery (27:53.591)\r\nSo, well, honestly, I wanted to do it all from scratch. That was kind of what I wasn't planning on doing, meeting with that introduction and meeting them, it was like, it was like a no brainer. Like it just, and the deal, the way it's set up, it's obviously very good for Rezzy. It's also very good for them. it's, it's a, it's definitely a deal where both parties are super happy with, with way it's structured. And so, it just, was a deal that was like, I mean, it just, it was just a great deal.\r\n\r\n\r\nNik (28:21.964)\r\nWell, and when you did that deal, because like I said, you didn't have experience in the space and if you can't share specifics, I get that too. Did you go out and you're like, all right, I'm going to go get financing. I'm going to go raise money from private equity or was it like, hey guys, let's just partner. Here's the potential upside. We want you to participate. Let's just figure something out. Like was it more the latter? Okay. Yeah, yeah, yeah. I get\r\n\r\n\r\nSteven Montgomery (28:41.989)\r\nYeah, it was the latter. I can't go into the specifics of the deal. But it was the latter. We didn't need to raise capital or anything like that to do it. It's, yeah.\r\n\r\n\r\nNik (28:55.021)\r\nBut that's amazing, right? Cause now you've like brought on people who are passionate about the business, their incentives are aligned with yours. You like them. You guys are just the way you're talking about them. can tell you enjoy working with them. And now you've got other people on your team who are, you know, pushing forward with you. That's I think is rad. How did the relationship with Cody kind of surface? Because I, for those who don't know Cody bought in and I don't, I don't know what her percentage equity is or anything like that,\r\n\r\n\r\nSteven Montgomery (29:05.639)\r\nYeah, they're great.\r\n\r\n\r\nNik (29:21.782)\r\nShe has actually purchased into Rezzi brands. And I think it's a really smart move for her for a number of reasons. Number one, she's known by that community, like her followers for side hustles, getting into their first business. And the franchise space is just a really good way for people to start their first business. And then second, I think she will be a very good accelerant. This is a media accelerated type of business because you can get an inflow.\r\n\r\n\r\nof potential franchisees. So I get it from her perspective and the investment thesis, but how did you like get in touch with her? Because I'm sure there's a million different brands she could have partnered with, a million different people she could have spoken to. How did it come about with\r\n\r\n\r\nSteven Montgomery (30:04.081)\r\nshe had seen my first million did a little short little segment on pink Rezzy and myself and she had seen that and and so one morning I just I woke up in the morning there was a message from Cody Sanchez and yeah when I saw it yeah just she dm me on LinkedIn and when I saw it like I was like because I'm I was a huge fan I was\r\n\r\n\r\nNik (30:13.174)\r\nreally?\r\n\r\n\r\nNik (30:21.452)\r\nReally? Like a text message or like a DM?\r\n\r\n\r\nNik (30:30.798)\r\nOkay.\r\n\r\n\r\nSteven Montgomery (30:32.273)\r\nI was like, this is a fake account or something. I didn't even believe it. And so she just said, Hey, I'd to do an email and a video on, on Rezzy and, and, and paint. And so they did one of her newsletters on kind of my story and Rezzy. And, and then they did a video where they came out, filmed some stuff with Rezzy that hasn't been released yet. And\r\n\r\n\r\nfilm the pinks video, which has been released and, and then we've also filmed one for that one painter that hasn't been released. So there'll be more coming out.\r\n\r\n\r\nNik (31:07.416)\r\nDid you do the same thing you do with John Maxwell where you're like, I'm gonna make Cody my freaking best friend. Or like, how did it turn from, I'm gonna feature you, because she features a lot of people, right? Like, how did it turn from, I'm gonna feature you to, let's start having a conversation about an investment.\r\n\r\n\r\nSteven Montgomery (31:14.979)\r\nHa ha.\r\n\r\n\r\nSteven Montgomery (31:24.459)\r\nI didn't quite have those same thoughts. Like I, I didn't know what to, to, to think of other than it was going to be really good publicity for us. Like, like, like the boring business person, like there's not another person who's as famous when you're talking about the word boring business. Right. And so like, like I knew it was like a perfect opportunity for us to get some like good, you know, views and eyeballs on what we were building. And\r\n\r\n\r\nNik (31:32.834)\r\nRight, of course.\r\n\r\n\r\nSteven Montgomery (31:51.195)\r\nI'll be honest, like she's super intimidating the first time you meet her. Like she's like a no BS person. Like we walked in and it was just like, she was like on like interview questions. There was very little, there was like literally nothing but a handshake and then it was go. And so, yes. He's just a very, like she is a very straightforward, very confident person. It\r\n\r\n\r\nNik (32:08.11)\r\nThere's no foreplay. She's just like straight into it.\r\n\r\n\r\nSteven Montgomery (32:18.723)\r\nIt was it was fun. We had a lot of fun. We were joking around and she had a lot of pink skies. I was like super nervous, dude. I like. Yeah. And so but as she was asking questions about Rezzi and franchising and you know, she had historically been really hard on franchises. But some things that I just told her that I think kind of sparked her interest and I didn't I was not I didn't have it in my mind of like, I want Cody as an investor. Like I didn't. That was.\r\n\r\n\r\nNik (32:27.214)\r\nOf\r\n\r\n\r\nNik (32:46.978)\r\nYeah, you weren't trying to pull an inception of like placing the idea in her mind. You were\r\n\r\n\r\nSteven Montgomery (32:48.935)\r\nNo, I was just talking and I was just because she asked me, well, why are like, why are you guys growing so fast? Why does so many people want to get into your franchise brand and stuff like that? And was like, I was like, well, Cody, like a lot of people who follow you and are looking to acquire businesses give up because it's so hard. They and so they come by a franchise instead. And and and I said, because I have franchisees who, know, they were 10 months into\r\n\r\n\r\na deal on an acquisition of kind of some plumbing company or roofing company or whatever. And they get the QV report back. It ruins the whole deal. So like there's all these deals that fall apart and it's really frustrating. It takes forever to find one takes forever to negotiate. Then you got to get you know you got to get accounting in there and you're trying to get the SBA approval. All this stuff is just a lot of work. And I was like so one there's a lot of people that are like trying to buy these older businesses and\r\n\r\n\r\nNik (33:42.14)\r\nMm\r\n\r\n\r\nSteven Montgomery (33:47.377)\r\ncan be hard to get that deal done. And two, there's a lot of people that they want to be an entrepreneur, but going from zero to one is really hard. so franchising is easier on both fronts. And I could see that she kind of like, I could see her wheels turning at that moment when I was saying some of that stuff. so she, she, so we finished filming some of the Rezzi stuff. She went out in the van, filmed the stuff with the pink guys and then wrapped up with them at the end of the day. And then she texted me at the end of the day and\r\n\r\n\r\nbasically was like, Hey, like I want to talk partnership. And, and that was March. Yeah. Yeah. Yeah. That deal three, three months or something like that. Three, four months of us negotiating. and so she texted me and said, Hey, I want to talk partnership. And I was like, heck yeah.\r\n\r\n\r\nNik (34:19.406)\r\nDang, when was this?\r\n\r\n\r\nMarch, okay. Very recent.\r\n\r\n\r\nNik (34:37.4)\r\nWhat was that process like to talk to her about the partnership, right? Was it long, drawn out? Was it just you and her directly one -on -one? Was it lots of legal teams and legal teams? how did it shake out for\r\n\r\n\r\nSteven Montgomery (34:48.923)\r\nYeah, I think it started with, he started with me and, her and her husband, Chris, chatting. and, and then I, once I kind of, we kind of were all aligned of like, Hey, there is something here. I told them upfront, some of the things that would be like good for me and things I want to be interested in. they kind of same thing. And then, I gave them a ton of stuff for due diligence. they went very quick through that and then\r\n\r\n\r\nAnd then it was a lot of conversations between legal and financial teams a lot. Like it's it's we're not disclosing anything on the deal, but like it's a deal that I think is very good for both of us. Like I was saying, the best deals are when both people feel like this is a really good deal because the best deals are when they focus on each other's strengths. And so it's a really good deal for Rezi. Obviously, I know she's happy with the deal, too. And so.\r\n\r\n\r\nwe're gonna do some pretty cool stuff now and we're gonna, I mean, we wanna build something as big as neighborhood, so.\r\n\r\n\r\nNik (35:52.078)\r\nThat's awesome. So what is your vision for resi brands over the next five years, 10 years, because, okay, you went from dropout, I'm just gonna be self employed, no goals to, you know, where you are now you built me 450 units $80 million, I think, in top line revenue, you'll do even more next year. I know that's not the resi brands, corporate, that's all the franchisees combined. But what are your goals\r\n\r\n\r\nSteven Montgomery (36:21.645)\r\nour goals, Rezzi brands, I don't know the exact timeline, but Rezzi brands will be the largest home service trades franchise in the world.\r\n\r\n\r\nNik (36:30.018)\r\nWrite it down, put it in the book, bookmark this, come back to this. You're gonna watch this in five years, in the world.\r\n\r\n\r\nSteven Montgomery (36:35.814)\r\nYeah. Yeah. Why not? Right. Maybe would be neighborly for sure. Like 6 ,000 franchise units.\r\n\r\n\r\nNik (36:39.254)\r\nWho's the biggest in the world right\r\n\r\n\r\nAnd how big are they? I don't\r\n\r\n\r\nNik (36:46.67)\r\nSo 6 ,000 franchise units give me like a dollar amount of like conceptual.\r\n\r\n\r\nSteven Montgomery (36:50.777)\r\nI don't know their dollar now, but it's got to be a couple billion.\r\n\r\n\r\nNik (36:56.992)\r\nOkay, you want to be a billion dollar company.\r\n\r\n\r\nSteven Montgomery (37:01.029)\r\nWe will be.\r\n\r\n\r\nNik (37:02.124)\r\nYou. I love you, Steven. We will be. I freaking love it, man. Bootstrapped too. It's not like you have a bunch of outside investment. That's freaking incredible. What do you need to do to execute in order to get\r\n\r\n\r\nSteven Montgomery (37:04.475)\r\nHa\r\n\r\n\r\nSteven Montgomery (37:16.977)\r\nSo new brands are great. I've got two new brands where the announcements will be happening soon.\r\n\r\n\r\nNik (37:23.118)\r\nAnd I, sorry, I'm gonna cut you off for just one second. I just saw a video that you posted, the handyman brand, essentially, where you're like, I've built $200 million brands, I'm gonna build another one now. And like you're building in public this brand, it's amazing. I think it's like genius marketing. So I love the way that you're doing it in public, but all right, so keep\r\n\r\n\r\nSteven Montgomery (37:34.043)\r\nYeah.\r\n\r\n\r\nSteven Montgomery (37:38.341)\r\nYeah. Yes. Thank you. I've got one we're building from scratch and I have another one that's another acquisition slash partnership. And that one we're going to be announcing soon. We're waiting on a couple of final details, but the deal's already signed. It's just, we're waiting on some rebranding that we're doing. So both will be officially kind of announced here soon. But the truth is like franchising is all about like the long game\r\n\r\n\r\nmaking your franchisees as successful as you can be, right? So like, we want our franchise to be wildly successful because the long game is the royalties. Franchise fees, they come in. Yeah, for the franchise or for us, it's a royalty game and it's a long game. The franchise fee we get paid upfront is used to help our franchisees launch and be successful in their first period. Like we use all of that money on supporting our franchisees.\r\n\r\n\r\nNik (38:18.606)\r\nfor the franchise to work.\r\n\r\n\r\nSteven Montgomery (38:35.015)\r\nFor us, the long game here is the royalties and we are in it for the long term and Cody is in it for the long term. And so that's the play. we want to go wide. I want to be able to cover every home service that a homeowner has. But I need to go deep first. So we're to go as deep as we can on our primary brands and then start bringing out more brands as we keep going deeper. But we've gone very deep. We technically have more\r\n\r\n\r\nthat one painter territories than our biggest competitor and our biggest competitor. took them 25 years to get that big and we did it in three. Serta Pro.\r\n\r\n\r\nNik (39:09.836)\r\nWhat's their name? Suck it, Serta Pro. Tell me about the back office that you're building out, because it sounds like you've built, like you said, the most important thing is for your franchisees to be successful. And in order for them to be successful, you've got to have a world -class support team. So you've got the call center you've built out, the digital marketing agency. What else have you, are those the only two, is there anything else you've built\r\n\r\n\r\nSteven Montgomery (39:27.558)\r\nYes.\r\n\r\n\r\nYep.\r\n\r\n\r\nSteven Montgomery (39:36.692)\r\nThose are the main ones. also have national accounts programs who are we're selling national accounts and bringing accounts in and\r\n\r\n\r\nNik (39:43.402)\r\nOkay, back to the, you're going to be involved in things that people see that everybody sees and involved in things that nobody sees. And that's like one of those partnerships that people don't really see on the back end.\r\n\r\n\r\nSteven Montgomery (39:53.487)\r\nYeah. Yeah, we're bidding. We're bidding like Universal Studios right now. And we're bidding a whole bunch of Walmarts and targets all over country. so we're so that is like there's big paint jobs and a lot of those places have windows too. And they have epoxy floors. And so we're that one painter has the biggest reach right now. So that's the primary one. We're focused on national accounts. But as we bring these other brands in, we're also going to be doing a lot of commercial work with all these brands. So\r\n\r\n\r\nNik (39:59.81)\r\nfor\r\n\r\n\r\nSteven Montgomery (40:20.677)\r\nSo yeah, we're doing national account stuff. are doing, we have the marketing agency in house. have a call center slash appointment center. So we do messaging and everything as well. Those are the primary things we have a cold calling service as well. that's, know, some of, some of our franchisees are using, we also offer some HUD assistance there. yeah. So those are some of the services and then it's the coaching. also have like, we have like, sales training events that we do all over the country for our franchisees.\r\n\r\n\r\nNik (40:50.382)\r\nWell, think one of the things that you've hit on, and then I'm gonna wrap this up and then we'll do our rapid fire questions, but I love your focus on company culture and leadership. And I know like you haven't specifically said those things, but many of your comments have been about educating people or making sure that people are all on the same page. I mean, just the fact that your assistant or admin person was\r\n\r\n\r\nSteven Montgomery (40:51.719)\r\nin a number of other\r\n\r\n\r\nNik (41:19.66)\r\nHe goes over these every single day. They review these in their standups. Every location does it. Companies don't do that. That's not a normal thing. It's one thing to say like, these are the things we believe. And then it's another thing to actually do the things that you say you believe in. I think that's a huge differentiator, especially in people businesses like you have.\r\n\r\n\r\nSteven Montgomery (41:34.715)\r\nYeah. Yeah, absolutely. Yeah. And for us, like leadership is like one of the primary things we talk about. I do something called like leadership hour with my employees. We go over the leadership laws. We're going over. We're actually going over now the like John Maxwell's five levels of leadership with our team. We focus on that. And I tell all my employees, are a leader, even if you are only currently leading yourself, sometimes yourself is the hardest person to lead. And so\r\n\r\n\r\nAnd I tell every single one of them at Rezzy, there are no ceilings. And if there is a ceiling, you're putting it on yourself. We're not putting it on you. And, and, and so I have, I actually have an employee who was a phenomenal employee and he, he, he had to, to, to move back to where he was from. And so, the remote wasn't quite working. So he quit and I was very, I was very bummed about it. He started a business and I invested in that business. we just,\r\n\r\n\r\nNik (42:25.368)\r\nYeah.\r\n\r\n\r\nNik (42:31.31)\r\nThat's rad, man.\r\n\r\n\r\nSteven Montgomery (42:32.615)\r\nWe just signed an operating agreement the other day. And like that's what I've told all employees. I'm like, if you're like if you're your success eventually leads you out of Rezzi, we're going to celebrate that with you because ultimately, like if it's a win for me to see people developed and grow here and and there. Right. And the truth is like, is everyone going to work here for 20 years? No. So that means everybody, everyone eventually probably moves on to another group. There's very few people that are going\r\n\r\n\r\nstart this job and retire here, right? So but I want when they leave to look back at their time at Rezzi as a place of development where they got better and grew and could accomplish more. And so and then we kind of summarize that in at Rezzi is just excellence and kindness. And so most companies have like 510, 25 values, whatever, right? Like my first version of our values had 21. And and then I was looking at them one day and I'm like, not a single person remembers these.\r\n\r\n\r\nAnd I was like, and I just had this aha moment. I was like, value should be as simple as right and left, day and night, mom and dad. Like, like, there's something powerful just to like the simplicity of two. And so was like, what is what I and I just thought about it. I was like, what is what are our values? What are the two things? I'm gonna make it two. And so I picked excellence and kindness. And those things aren't opposed, but they're supposed to be complimentary, right? And so you have to have excellence.\r\n\r\n\r\nNik (43:56.184)\r\nDude.\r\n\r\n\r\nSteven Montgomery (43:57.921)\r\nBut if you only build something that is excellent and you're unkind, you won't be proud of what you built. If you are excellent and kind, you'll actually be proud of what you built.\r\n\r\n\r\nNik (44:07.662)\r\nDude, I feel like that scene in step brothers when they're like, did we just become best friend? Because so my home health and hospice company that I had, we grew from zero to 11 million. Ours was joy through service. Because like, I love having fun. I love seeing people develop like for me, their family, right? And I want them to serve one another. I can't go out and help a patient, but I can help these employees.\r\n\r\n\r\nSteven Montgomery (44:11.247)\r\nYeah.\r\n\r\n\r\nSteven Montgomery (44:21.904)\r\nI love that. That's great.\r\n\r\n\r\nSteven Montgomery (44:32.549)\r\nYeah, but do you like I can I bet in six months somebody could ask me hey, is what is it? It's like what was his values? I could tell you because it was simple, right? Like joy through service like it's as simple as left and right. Like our brains don't remember things that are more than two or three like points, you know, and so\r\n\r\n\r\nNik (44:43.192)\r\nYeah, I love\r\n\r\n\r\nNik (44:53.228)\r\nSo true.\r\n\r\n\r\nSteven Montgomery (44:55.239)\r\nAnd it's not like, look, I still have that 21, but nobody remembers those. Like it's still in, it's still in when they're onboarding as an employee. It's still all there, but everybody remembers excellence and\r\n\r\n\r\nNik (45:05.902)\r\nOkay, because you boiled it down to its simplest essence. I love that. I love that. All right, here's my rapid fire questions. You ready? What do you love about this business?\r\n\r\n\r\nSteven Montgomery (45:08.347)\r\nYes.\r\n\r\n\r\nSteven Montgomery (45:12.229)\r\nYeah.\r\n\r\n\r\nSteven Montgomery (45:15.883)\r\nI love being able to help people start businesses. that's why I chose Franchising. Yeah, it's fun to help people become entrepreneurs. It's enjoyable. It gives me a lot more purpose than just building a business that is where I'm the only owner.\r\n\r\n\r\nNik (45:20.482)\r\nThat's obvious.\r\n\r\n\r\nNik (45:31.276)\r\nYeah. What do you hate about\r\n\r\n\r\nSteven Montgomery (45:33.779)\r\nI hate the owners who don't want to be owners. I don't hate them. I hate that part of it. Yeah. It's, hard when you have, and, and it takes a lot of patience. There's, there's, there's going to be franchisees that just don't seem to understand what they signed up for. we have many, many, many, many amazing franchisees. And there's some that I like, I thought you wanted to be an entrepreneur. I'm confused right\r\n\r\n\r\nNik (45:41.816)\r\nDealing with that,\r\n\r\n\r\nSteven Montgomery (46:03.205)\r\nyou know, and so that's the worst part is, is, and sometimes they just like, they can't see the forest through the trees and they're just very, you know, and, that part can be very frustrating, but the overall, it's like super enjoyable to, to with our franchisees.\r\n\r\n\r\nNik (46:17.422)\r\nAll of us have jealousy in some capacity. For me, I'm the most jealous of commercial real estate. For you, what businesses or industries are you the most jealous\r\n\r\n\r\nSteven Montgomery (46:32.543)\r\nlike the people who have like super cool air Airbnbs all over the place. Like that's like my yeah, like my wife and I like she loves interior design and she has like a real eye for it. And so I think that's like our like one day when I'm a little less busy and our kids are a little older and she has more time as well. We will probably do some of those. No, I don't I don't know that.\r\n\r\n\r\nNik (46:55.15)\r\nDo you know who Isaac French is?\r\n\r\n\r\nOkay, he's built out these properties that are not just Airbnbs, but they're experiential as well, like on a lake. Anyways, I'm having\r\n\r\n\r\nSteven Montgomery (47:05.935)\r\nYes, there's okay. Yeah, there's a there's a guy that I follow. He I actually started following because he was a marketing guy. His name is Travis Chambers and he was doing some Airbnb's that were Yeah, he was doing some like experiential ones too. And I don't know how many he did. But yeah, there's guys like that. I'm like, that just looks like a lot of fun. I don't know how profitable is I honestly don't know anything about the business. I'm like, it looks fun.\r\n\r\n\r\nNik (47:13.676)\r\nYeah, yeah, I Travis Chambers.\r\n\r\n\r\nYeah, yeah,\r\n\r\n\r\nNik (47:26.328)\r\nYeah, but it just looks cool.\r\n\r\n\r\nAlright, if you have two hours in your day and you don't have to do anything related to the business, you have no family responsibilities, you have kids, right? How old are\r\n\r\n\r\nNik (47:42.606)\r\nDude, okay, we're almost 10, seven, four, and two are my kids. So all boys. Yeah, all boys.\r\n\r\n\r\nSteven Montgomery (47:46.555)\r\nYou have four kids? Wow, okay, yeah. It's rare to meet somebody with four.\r\n\r\n\r\nNik (47:52.11)\r\nYeah, it's definitely, definitely much rarer today than it was 20 years ago. you have two hours for yourself. What are you obsessed with right now? Like what are you spending your time on in those two hours?\r\n\r\n\r\nSteven Montgomery (48:05.672)\r\nAnd it's not business.\r\n\r\n\r\nNik (48:07.374)\r\nIt doesn't have to be business is the way I'm pitching it, right? Like you don't have any other, you don't have any other obligations. You can do whatever you\r\n\r\n\r\nSteven Montgomery (48:15.867)\r\nSo most of the time, even like on vacation and my wife's like, she's like, I'm gonna read some more on the beach. I'm like, I'm about to get sunburned. I need to go inside. I will still normally go inside and research home services I wanna get into. It's not that, and this is so specific, but I'll just be honest. I am like super into post -millennial Christian theology. So, yes.\r\n\r\n\r\nNik (48:40.778)\r\nReally? Okay.\r\n\r\n\r\nSteven Montgomery (48:42.919)\r\nAnd so it's a very specific theology about like, it is basically that like the role of Christianity isn't just a way and escape. It's that we're supposed to make the world as good as it possibly can be. And I'm obsessed with it. I read it. I follow a lot of guys on like that's like my YouTube is like 50 % people like Alex Hermosy and Cody Sanchez and Grant Cardone and the other 50 % are all post -millennial theologians.\r\n\r\n\r\nNik (49:08.589)\r\nDude, you're such a good guy. See, my my YouTube is like 50 % all the people who you said, right, like Alex Ramozi, Cody Sanchez. And then the other 50 % is broken up between the NBA and Russian dashcam fight videos. It's just like, I\r\n\r\n\r\nSteven Montgomery (49:15.097)\r\nYeah.\r\n\r\n\r\nSteven Montgomery (49:25.765)\r\nI used to be super into the NBA as well. But ever since the Spurs started sucking, I started watching.\r\n\r\n\r\nNik (49:34.317)\r\nmy mic shut off. Hold on a second. What the? One of the joys of this machine. We're almost done, worry, How's it bummer?\r\n\r\n\r\nSteven Montgomery (49:44.013)\r\nGoogle, you're good.\r\n\r\n\r\nNik (49:52.718)\r\nWe'll see where that piece ends.\r\n\r\n\r\nNik (50:19.837)\r\nto stop this",
  "metadata": {
    "duration": "",
    "date": "2024-08-14",
    "platform_source": "Google Drive"
  }
}