{
  "episode_number": "24",
  "episode_title": "How a Reddit Post Led to a $1.3M Cleaning Business with Neel Parekh",
  "guest_name": "Neel Parekh",
  "business_name": "Made This",
  "transcript": "﻿Welcome back to another episode of Nikonomics, a podcast about the economics of small businesses. And today's episode was pretty awesome. It was the first time I've ever spoken to someone who had summited Everest. Pretty rad. We had Neil Parekh who is the founder and CEO of made this.\r\n\r\n\r\nIt's a cleaning franchise company that is based out of Los Angeles, California, a hundred percent remote and has locations all All over the country. We had a very wide ranging conversation about everything, from what it took to prepare for Everest, all the way to the fact that he lives in Southern California.\r\n\r\n\r\nAnd we talked about traffic. So if you like this episode, please like, and subscribe. I think you're really, really, really going to like his insights into what it takes to grow a business from scratch. And so with that, let's just hop into the show.  All right. I have Neil Parekh here with me today and Neil, I'm actually pretty excited because for a long time, you've believed that me and Chris were the same person.\r\n\r\n\r\nAnd I just wanted you to know. That we're actually separate people. I still believe that. No, I still don't see Chris here. No evidence. \r\n\r\n\r\nAll right.  You, we're going to get to the business stuff in a minute here, but you just got done hiking Everest.  I have to know what was the highlight of that trip?  Man, taking a shower at the end of the trip was the highlight of the trip.  Okay.  How long is the trip? If I go to hike Everest, I go to base camp, like from base camp to peak to back to base camp.\r\n\r\n\r\nWhat, like how long is it? So to clarify, I hiked to base camp. I did not get to the summit. I just did that to two base camps, which is nine days of hiking to get there. If you actually want to go to the summit. It's insane. You have to stay at base camp for probably two months because the training costs 50 to a hundred grand.\r\n\r\n\r\nSo the people who actually do that are like all in on hiking,  it's all the log jams you see on TV. That's all people trying to summit at the same time. Because usually the weather window, there's maybe two windows where you could summit in three months of waiting. So everyone just tries to do it at once.\r\n\r\n\r\nSo anyways, I got to base camp and I got to see everyone prepping because the weather window was about to happen. So that was Very neat. But I quickly realized I'm cool stopping at base camp. Like I have no intention of going to the summit and that was a big enough adventure for me. It was hard to get in there.\r\n\r\n\r\nTwo months. So people are at base camp for two months training.  Minimum of a month and a half. But yeah, you have to do a crazy amount of acclimatization training there. So it's only two miles from base camp to the top, but  it's insane. So, okay. So how long did it take you to get to base camp? Where did you start from?\r\n\r\n\r\nAnd how long did it take you to get to base camp? Yeah. So I was in Kathmandu, went over to the starting point, which is called Lukla. Um, small little town. It's technically the most dangerous airstrip in the world. Because it's so tiny and everyone flies into it. I've seen that airstrip before on YouTube.\r\n\r\n\r\nYeah. Yeah. Yeah.  Tiny. And like you're on this tiny plane with 10 people and you land and stuff. So that's where we started and pretty much started immediately. So every day is like seven, eight hours of hiking. You're at altitude.  It's pretty tough. Like it's not too easy, but it's not, you're not like grappling on different things.\r\n\r\n\r\nIt's just really tough hiking. How did you train for that? You live in Southern California, which is like the best place in the world to live. Right? So it's not like you were training in inclement weather and you had to get to the summit of Everest. How, what did you do? Stair stepper every day on 15 at the LA fitness or what?\r\n\r\n\r\nYou're going to, you're going to laugh at me because I was trying to find hills and oddly Beverly Hills does have some hills in the mountains. So my wife and I, we just hike up the hills and people would ask us, how do you train? And we're like, we're hiking Beverly Hills. Cause it told us to hike some hills, \r\n\r\n\r\nbut that's what, that's what we did. And I do boxing. So I did that four times a week and just got ready for it. So. Dang. Do you feel like you were prepared for it?  On the physical side, I think I was pretty good. The thing with the altitude is there's nothing you could do. You could be a marathon runner and it's still going to hit you.\r\n\r\n\r\nWe saw people getting pulled down on the helicopter who were way more fit than I was. It just, every body is different. So that part, it's really tough to train for. Even if you live in Denver, which is at 5, 000 feet elevation, we're at 17, 000 there. It's a different level. Did you start at 17, 000 and then, or is that the We started out five and then we hiked up to about 80, 000 is where base camp was.\r\n\r\n\r\nHow many days did that take?  Nine to nine days. I am such a city boy. I'm like, honestly, I would have been the same. I'm like, yeah, I'm ready for that shower.  Yeah. I'm not looking to have another day out here, man. I'm show me where the warm water is. Yeah. Yeah. And like, honestly, there's a lot of people do base camp.\r\n\r\n\r\nIt's not like, in my opinion, just incredible accomplishment. However, for me, Live in LA. I hike on Beverly Hills. Like I'm not a hiker outdoors at all. For me, it was like, all right, I did a track. It was base camp. I'm going out on top. I'm retiring. No more tracks for me. So might as well go out on top. \r\n\r\n\r\nKilimanjaro is next. Right. You're going to go kill him in Jaro. I'll pass on that one. I could say I've done Everest. So,  well, I mean, it's not about like the accomplishment, right? You set the goal for yourself. And I think that's really all that matters. Who cares what other people think of it? Like you went there, you trained for it.\r\n\r\n\r\nYou did it for nine days.  Who cares what people think? Yeah. And it's, it's like what the cheesy way people say, it's like the journey, not the destination. But for something like this, like absolutely, because I walked all over LA to train for it. I was like way more fit than I've ever been in since high school, just cause you're worried about what's going to happen there.\r\n\r\n\r\nRight. So in that way, it's like, Oh, this is. I'm really, really happy I did this challenge. It's that type of thing. That's amazing. Alright. Enough about Everest. I could freaking bug you about that for forever, but that's rad.  Briefly  tell us about your business and what it does to make money.  Sure. So I run a couple businesses, the main one's called Made This, which is a fully remote cleaning company focused on residential cleaning and Airbnb cleanings.\r\n\r\n\r\nI have a couple locations in California, so Los Angeles, San Francisco. And very simple. It's a residential cleaning company. So the business model is pretty straightforward. We started franchising it a handful of years ago So we're at about 25 locations nationwide now mainly focused on corporate refugees.\r\n\r\n\r\nPeople want to leave the nine to five started cleaning business on the side and scale it up. They eventually quit their job and have full location freedom. That's the pitch of what we're offering with the franchise. So I love home services. I love home services, but you know, Chris and I have looked at cleaning before cleaning companies.\r\n\r\n\r\nIn fact, Chris launched a cleaning company a number of years ago  and we hate that business for a number, for a number of reasons. But, but one of, one of the reasons is like,  The switching costs or like the ability to lose a customer is very easy. One bad experience, one hair found in the sink, one bad review, one bad interaction.\r\n\r\n\r\nYou potentially lose a customer. They don't necessarily have from at least from our vantage point, high LTV or high margins.  What made you get into this business? I'm just curious. You're obviously smart. You're thoughtful. What drew you to this space?  I'll be honest. I think so. Your podcast people are listening to this to figure out what's good business models to get into.\r\n\r\n\r\nI was not that smart. I just  went with what I saw first. So I guess my quick background. Actually, I worked in private equity in Los Angeles. I was there for 4 years. Tech investing, spreadsheets, the whole  finance thing. And I wanted to start a side hustle because I want to quit my job and travel. Simple as that.\r\n\r\n\r\nSo what did I do? I was at work and I typed, how do I quit my job and travel the world? And it's like, start a micro blog, start an affiliate site, do e commerce. I did a lot of these traditionally remote businesses and every single one of them flopped, they absolutely flopped. And then finally I was on Reddit when I was supposed to be working and I came across the post of the guy who started the cleaning company.\r\n\r\n\r\nAnd I was like, okay, I'm trying this other stuff. It's failing. Let me just give this a shot. And I was so pissed at myself. So I actually like did the work and launched it quick and immediately got a sale. And I was like, oh my God, like, I was pissed. I remember I like, I ran outside of my work and I was dancing in front of the building because I was so happy to get in my first show ever.\r\n\r\n\r\nAnd I didn't realize it's a two way mirror. Like a windows ever could see me dancing, but I didn't know.  And from then I just like, Oh, this is making money. This will allow me to get my freedom. And at the time, I just wanted to help my parents pay for their mortgage and I want to have some extra money to travel.\r\n\r\n\r\nThat was kind of it. So I didn't think, Oh, I want to make millions and millions of dollars. It wasn't the best model. I just thought I want to make three grand a month and this is working and it's easy. And in hindsight, the reason it was easy was the competitors suck.  Even now, 10 years later, you try to call the top five competitors on Google in your location.\r\n\r\n\r\nFor cleaning. I guarantee you three of them will not even pick up. It's still that low level of sophistication. And eventually we started to get calls from Airbnb customers and started to grow that. And I realized that it's a great niche to get into, which has a lot more protections and barriers to entry.\r\n\r\n\r\nAnd then in 2015 is when I quit my job. When I was making enough money, decided to travel and spent a few years traveling while running this business on the side. Where was your business? It was based in Los Angeles, but. And the cleaning was in Los Angeles? The cleaning was in Los Angeles, the cleaners were in Los Angeles, nothing else was in Los Angeles.\r\n\r\n\r\nI set up to be run remotely just because I knew I wasn't going to be there. And I think Nick, in some ways that was helpful because we had to get systemized very early, rely on technology, automations, global talent before anyone was doing it. Meaning our margins were much better than the traditional cleaning company.\r\n\r\n\r\nThere's an old school way of doing it. Just like you get a vehicle, you get a wrap, you get an office space with supplies, cleaners come in the morning, they pick up stuff. That sounds awful to me. That sounds terrible. So. You know, I just, out of necessity, I created it in a way that was fully remote 10 years ago and to serve my needs.\r\n\r\n\r\nAnd they made the margins better as well. And I think that's what allowed us to scale pretty fast. You started first with some like digital services that you were trying to do remotely sound like you're doing like dropshipping. I mean, dropshipping, technically  it's like wholesaling anyways. And then you went to  an actual services company where you were providing the services.\r\n\r\n\r\nIn people's homes.  What did that look like? Like, how were you qualifying these cleaners in the LA area? Were you meeting every single one of them? Were you posting the Craigslist? Like how did you manage quality? Yeah. I mean, at the beginning, look, I didn't know what I was doing now. Luckily our franchisees know exactly how they do it, even remote.\r\n\r\n\r\nAt the beginning, I was meeting them at a coffee bean in Tili, which is close by, and the weekends and vetting them, signing the contracts and sending them out. So that's how I was doing the vetting myself.  Did you buy or did you start from scratch?  I started completely from scratch. And did you put any money into it or was it cashflow positive from day one?\r\n\r\n\r\nHow did that look?  So the good part about the cleaning space, it's pretty low overhead. After you get up and running, most of the money goes towards marketing. Now that's because we're running in kind of this unique remote local way where we're not having these vehicles and equipments and all this kind of overhead and risk because of that, all of the money is just spent on marketing.\r\n\r\n\r\nSo it was cashflow break even very quickly. And it's the same way for our franchisees is they can get there really quick. As long as they market well enough. That's the beauty of the model is there's not a crazy amount of risk involved in it. So you had, you were paid back on your investment pretty quickly. \r\n\r\n\r\nYeah. Oh, yeah. I think I'm most curious about your customer acquisition costs. Where are your customers coming from? Are they coming from online? Are they word of mouth?  I don't know. Yard signs. Like how do you get customers? Yeah, absolutely. I think there's a variety of ways. And Nick, also good ways of going about it would be talking about like  all y'all get into like why we chose the niches we're in and cleaning.\r\n\r\n\r\nCause I think that's actually very important because very, there's different types of cleaning companies you can't start in terms of how do we acquire customers is a variety of different ways. At the beginning, and look, it changes, the landscape changes. At the beginning, we did a lot of AdWords and Yelp.\r\n\r\n\r\nNow we don't do any AdWords or Yelp because it changed. A lot of the way I think about this is do stuff that does not scale until you build enough recurring revenue where your SEO is hitting really well.  It's the game plan, right? You're going to rely on quoting engines. You're going to rely on paid ads.\r\n\r\n\r\nYou're going to rely on scrappy marketing to get sales. And when they become recurring customers, that's great. You just keep compounding from there. At some point, if you're doing the right things foundationally with the website and stuff, organic leads will start coming in. And that's when you can let go of the paid ads and focus on reoccurring customers and recurrent customers.\r\n\r\n\r\nAnd just those customers from organic methods. What was your favorite strategy in those early days? Gorilla marketing. What was your favorite way to get customers? You can't do this anymore, but I would go on Airbnb, message every host in the LA area. I got that account banned, create another account, got that account banned, create another account, got it banned.\r\n\r\n\r\nThey found my Facebook. They banned my Facebook. So even now, the only account which works on Airbnb for me, which I don't do that anymore, is like my old like flyboy172  at yahoo. com. Like it's my old middle school email address is the only one that works in the Airbnb now. So good. Yeah. Well, honestly, what I like about.\r\n\r\n\r\nThe model, maybe a lot of home service models is you don't need to have a crazy amount of customer acquisitions. It does. You don't have to do stuff that scales. A lot of people think, Oh, I have to figure out, crack this code with Facebook ads, but you really don't want this model because it's heavily recurring.\r\n\r\n\r\nNow, like you said, churns higher than a normal industry. But the truth is, things get dirty all the time. Someone doesn't buy a cleaning and says, Oh great, I'm done with cleaning for my life. I'm done with cleaning for the next five years. That's just not a thing. So because of that, if you get a recurring client, That's great.\r\n\r\n\r\nAnd if you want to hit a certain freedom number, And a freedom number is what I call the point where Your base level expenses are covered and you feel like they were secure where you can quit your job. If you travel, you do whatever you want.  It doesn't take that many recurring customers to hit it. So a lot of things you can do, which don't scale, go into apartment complexes, yard signs, whatever.\r\n\r\n\r\nIt works fine because these are recurring customers you're buying, not one time sales.  You talk about the different niches in this space. I would probably segment it as commercial cleaning and residential, but it's probably a lot more than that. What are the different niches?  Yeah, we focus on residential and within residential, our biggest specialty is vacation rentals.\r\n\r\n\r\nWe're actually the first and only Airbnb cleaning franchise that exists.  So the way our software works is we could actually hook into, let's pretend you're an Airbnb host. I could hook into your reservation calendar with a link. Anytime you have a guest checkout, it's going to schedule clean with me.\r\n\r\n\r\nIt's going to automatically assign a primary cleaner and your backup cleaner. When the cleaner goes to fill out the checklists, you get emailed all the photos, a supply report, damage report,  everything done and automated for you as they are being used.  So it becomes very sticky. Yeah. I was going to say, so by focusing on that niche, you probably created a nice moat for yourself, easier to deal with customer problems, especially if you have One Airbnb host who has several locations.\r\n\r\n\r\nI'm assuming you have those types of hosts where you can go one to many  for your niche in particular, what is a typical for your business customer acquisition costs and how does that compare to like the lifetime value of those customers?  Yeah, I think it varies depending if you're looking at residential or Airbnb for both customer acquisition costs as well as lifetime value.\r\n\r\n\r\nI'll go start with lifetime value. So lifetime value for let's say a residential customer, we're probably keeping them for about 18 months. Many cleaning companies do it much better. For us, at least for LA locations, it's right around 18 months. We do have customers who've been with us for five, six years.\r\n\r\n\r\nSure.  So 18 months at, let's say, 180 per clip, average cleaning of maybe 1. 5 per month. You're probably looking at, yeah, 3, 600 to 4, 500 in LTV for one customer  on the residential side. And that's lifetime value, so how much that customer's worth. On the Airbnb side, you're probably looking at at least three times or four times that amount.\r\n\r\n\r\nOh wow. Yeah. Much to clear. 'cause the quantity is so much more. Our LTV is I think 14,400. Wow. For an Airbnb customer. And sometimes it's a lot more like our top customer in LA who's not even like a company just individualized to us four units. He spends, I think $48,000 with us every single year, has been with us for seven years.\r\n\r\n\r\nWow. So  it becomes very sticky if you find the right customer. The way I think about it, though, is not every customer is going to be the perfect customer. Right? Like some people inquire, maybe they'll churn out within the first three cleanings because they're not a fit. But once they get past a certain threshold, like the risk zone is what I call it, which is typically the first three cleanings, they become extremely sticky.\r\n\r\n\r\nSo the whole game is you get a customer. Cool. Now, how do you get them in the habit of working with you? How do you make it so sticky that they're not going to want to leave? And like you said, on the residential side, people are a little bit more finicky. Churn rates typically in this industry are about 5 percent monthly on residential.\r\n\r\n\r\nJeez. Airbnbs. Yeah, it's pretty high. It's usually two to 5 percent is kind of like the max, but it's like two to 5 percent is where you look at. Wow. I mean, that's like over 50 percent of your customer base a year. Yes, it is. However, at some point you have a staple of base customers. Right. So a lot of those, a lot of that churn is like you get a new monthly customer and they're leaving two cleanings.\r\n\r\n\r\nWhether you want to count that as a real monthly customer or not, you know, depends. But most customers like we, for example, like in LA, we probably have 70 to 80 grand booked every month from customers that have been with us for a year plus. Right. Then the ones on top of that, a lot of the churn might happen there.\r\n\r\n\r\nSo 5 percent on the residential side, how does that compare to the Airbnb side? I don't know the exact numbers on that because the Airbnb customers, there's not as many because not everyone's in buy now mode. On the residential side. One great part about the industry is things get dirty all the time.\r\n\r\n\r\nMove in, move out, post construction, residential home, Oh crap, I forgot to clean up. My mom's coming to town, post parties. There's an unlimited amount of things to clean. It's never going to go out of business. On the Airbnb side, many times they're going to contact you only if they're pissed off at their current cleaner.\r\n\r\n\r\nAnd of course, there's less Airbnbs in any given city, but when they do hit and they're going to hit at some point, it might have been, and you really just need a small percent of them, then it becomes very big money. So it's pretty sticky at that point. All right. So the LTV residential is around 3, 500 Airbnbs around 14, 000, I think.\r\n\r\n\r\nYeah. Someone that ballpark. Okay. So is the difference in cost to acquire a customer  that massive, or are they actually pretty similar with the customer acquisition costs?  So the actual cost, honestly, is not the biggest. Burying because if there was a completely scalable way of getting Airbnb customers out with a stupid amount of money at it, the truth is there's not, there's a limit, right?\r\n\r\n\r\nAnd I think that's the biggest issue is on the Airbnb side. You could do outbound, but most of our leads come from just really good SEO.  And so how do you quantify that? It's a little bit tough because you can't exactly run paid ads to Airbnb keywords in a very systematic way. So I think just because there's less addressable market,  It's tough to actually calculate acquisition costs, and maybe I'm just not good at it.\r\n\r\n\r\nI don't know. There's probably someone smarter than me to figure this out. But acquisition costs would probably be higher for Airbnbs. However, it's not three times higher. It's more of a matter of just time investment and things like that. Is it more predictable on the residential side? Do you kind of know where does it fall for your office in LA?\r\n\r\n\r\nHow much does it cost to acquire a customer? Yeah, absolutely. So every location is very different because we have 25 franchise locations. So we're going to acquire the customer in terms of whatever it'll change. Typically, we're paying between 35, let's say an average of 35 to 45 dollars per lead. Most times the close rate is 50 percent if you're doing pretty well. \r\n\r\n\r\nPhone, phone sales, phone sales, it's a 50 percent close rate. If you're training like a remote team member, maybe that drops down to 40 or something, but 40 to 50 percent is where you're at in terms of close rate. Meaning it's going to be probably a customer acquisition cost of about 100. Now, that doesn't mean every single one of them is recurring.\r\n\r\n\r\nA  lot of times it's a 100 customer acquisition cost and it's a one time sale. You have to sift through the one time sales until some recurring business starts falling through. Or you have a very impressive sales process on the top end to maybe get them recurring at the beginning. I kind of find a mix.\r\n\r\n\r\nMost times people call either their recurrent customer, they're not a recurrent customer. It's really hard to convince someone to go return. Can you talk a little bit about your LA location? The one that you own in particular, how big is it just in terms of volume and how long did it take you to get to there?\r\n\r\n\r\nIt sounds like you've been doing this 10 years. So I'm assuming it's 10 years.  Yeah, it's been 10 years. I think currently we're at like 1. 3 in revenue. SDE is probably about 22, 23 percent in terms of margin. So it's a pretty lean model because we utilize a lot of global talent, AI automation, it's like our margins are probably much better than a regular cleaning business.\r\n\r\n\r\nHow long did it take to get there? I think  I'll be honest. We I've been, we've been at this rough size between like 1. 3 off for the last four years or five years. But my time in the business has decreased drastically. I probably spend less than five hours per week on the business. This general manager place automated, it's been hands off for about four years now.\r\n\r\n\r\nWhen did you make the switch to franchise or because I'm assuming, yeah, you could be putting a lot more time and energy into that business, growing that business, but. I'm assuming you've shifted your focus more to being a franchisor and supporting the franchisees in different markets. So when did that start? \r\n\r\n\r\nYeah, March, 2020, right in time for the pandemic. Perfect time to launch a vacation rental business. Oh, perfect. I know. Right. So March, 2020 is technically when we launched, we awarded our first franchise end of that year. Our second franchise in 2021, and so it's a slow roll up, honestly, and then the following year added maybe  5 more and they started to wrap up a lot more from that.\r\n\r\n\r\nSo now we're at 23 individual franchisees about 2526  locations. Okay. And that makes sense. Right? You said. For the last four or five years, your company in LA has been in that 1. 3 to 2 million range. And four years ago is exactly when you started doing the franchise. So I would assume it'd be kind of comparable.\r\n\r\n\r\nWhere are the locations? Are they all geographically kind of  clustered on the West coast? Are they all over the country? What does it look like?  They're all over the country. So we only franchise in the U S I wouldn't say we hyper targeted a specific. Area, although there are some clusters, certain places like Florida, which is a heavy vacation rental market. \r\n\r\n\r\nI prioritize the based off of who is the franchisee. And do I think that's the best chance at success is the truth. That's the number one characteristic of whether we're going to award that location or not. Next would be expectations after that's going to be, are you a cultural fit to be actually like working with you?\r\n\r\n\r\nAnd so for me, it's less dependent on location, more dependent on who the franchisee is. And I say that because I think there's some models, especially in the franchise world.  Location matters a lot.  Location absolutely matters. That's the number one aspect of it. With the cleaning industry, it's been around forever, literally thousands of years.\r\n\r\n\r\nAnd any market that there's competition, existing competition to make money, that means the market's already proven out. And we already know from what we said, there's enough business for everyone. If I talk to local competitors, no one's worried about, are you still on my customer or not? You're worried about if they're sealing your cleaner or not, but like never your customer because there's enough business for everyone in almost every single market.\r\n\r\n\r\nSo yeah, I'm not too worried about the markets when it comes to like, what's the best location to launch it. It really depends on who's the franchisee and do they have the chops. Broadly speaking, just like in the industry is 1. 3 to 2 million. Is that like a typical size of where these companies max out or hit a ceiling or is that low high? \r\n\r\n\r\nYeah,  it's a good question. I would say  if I was going to bet not many cleaning companies hit a million and that's because most of them are running from pretty unsophisticated. People is the truth. Like if you look at competitors in LA that we have, which we're in a really big market, these are not heavily sophisticated players and that's how it is in most markets.\r\n\r\n\r\nSo they'll probably cap out a certain size. If you actually running operations, you maybe have a white collar background, maybe what you're doing in business. Are you able to learn it? I think hitting seven figures is completely doable. I personally know someone who's been running her cleaning company for 25 plus years.\r\n\r\n\r\nShe's at around like 3. 5 million. It's been coaching that way for, decade plus great margins. It's like the beauty of the model is  I don't think it's as based off of what's going on in the world. It doesn't impact it that much. I don't really care what's happening with it. I don't really care that the Google algorithm leaked and a lot of people are worried about the answer of the website.\r\n\r\n\r\nI don't care. It's irrelevant because this business has been around for so long. Plus what we're doing is so hyper local that it's kind of insulated from a lot of the external issues going on, meaning it could stand. And it could last 25, 30 years. Now, who knows what's going to happen 25, 30 years from now.\r\n\r\n\r\nBut if I was in the back, he's still going to be around, right? Cause things get dirty all the time. I'm sorry, Nick, back to your question. Is that normal or not in terms of size?  I think, um, a lot of people do cap out probably around like the 500, 600, a thousand mark. And getting to know it's probably a little bit more rare, but I do think it just depends on who the founder is.\r\n\r\n\r\nI'm speaking in general terms with the community history, but I think it depends on who the person is. All right. My last two operational questions. First one is how did, how do these businesses typically trade if I were to sell  a cleaning company?  So on the, this one varies drastically because on the lower end, if your business is not doing that much revenue or hasn't been around that long, multiple is extremely low,  almost not worth it in some points.\r\n\r\n\r\nLike meaning if you're one times, one times,  yeah. One time to just an asset sale, like not even. And if you're sub like 200, 000, there's not much value there in terms of what you're offering. Now as you start to scale up and up and up,  I'd probably say  above 600, 000, 650 or so, you're probably pushing the normal three times earnings. \r\n\r\n\r\nAnd when you get to larger sizes, like I mentioned, if you're at two and a half, 3 million, you're probably pushing four or five times. I haven't seen anything crazy astronomical besides that. I've heard of a couple outlier situations where a strategic is acquiring you for about 6 times, which is abnormal.\r\n\r\n\r\nThat company was around 6 million in revenue. That's pretty rare. So I'd probably say three. So last question, if I were starting one of these businesses up,  let's put the franchise model to the side for a second. Just generally speaking, what do typical startup costs look like and how long does it typically take to get to break even? \r\n\r\n\r\nYeah. So if you are. Not starting with the franchise at all. So there's no startup fees in terms of that. The main thing is you need website marketing,  LLC, and all that kind of good stuff. Sure. Sure. But website and marketing. So you spend a couple of grand for a good, pretty decent website and you spend money on marketing.\r\n\r\n\r\nYou probably could get this started in five to seven grand if you just want to get going, if you want to run lean to begin with. So it's a pretty lean model to start from scratch if you want. That is I think what a lot of people worry about is like, where's the barrier to entry? I think. Many times it's a knowledge barrier to entry more than anything, but in terms of just pure cost, you could start it pretty cheaply if you want to.\r\n\r\n\r\nWhat about the franchising side? Are you able to talk about that or no? Yeah, absolutely. So we, our initial franchise fee currently is 39, 000 initial fee. And all in cost we say is around 50 to 60 ish. And that includes initial franchise fee because most of the money afterwards is going to be going towards marketing and growth and scale and things like that. \r\n\r\n\r\nThat money gets you a big jump, right? You get. All the ops, you get the entire ops manual website set up for you, SEO going for you, remote team member placement, training program for eight weeks. It's like everything I wish I knew 10 years ago, but now I do know is impact is already inputted there for them.\r\n\r\n\r\nSo they often start with value creation already, because SRPs and everything are created versus a brand new entity. Doesn't have a lot of those operations set yet. What are you doing centrally for franchisees? Are you doing any marketing? Are you doing any HR? What kind of support do you guys offer?  Yeah, this is honestly a support program is like where I spend most of my time.\r\n\r\n\r\nAnd that's where we're spending most of our money. And like what I'm actually personally the most proud of. So when someone starts, they get dropped into what we call made this university. So 80 weeks, part time around the schedule to get them up and running and trained. After that, they get dropped into what we call the 10k program.\r\n\r\n\r\nHow fast can we get you to 10, 000 per month in revenue? It's a coaching program, weekly call with other franchisees, plus a dedicated business coach, plus one on one calls. We have a grandma's program. So when they launch, there's a really sweet software we have set up where they figure out what all their marketing levers are, customer acquisition, cost, LTV, all that kind of good stuff.\r\n\r\n\r\nGives them a marketing plan to execute every single week. There's access to the Slack community with all the franchisees. We have conferences a couple of times a year. They have the ops manual online. We have it on Notion. In terms of what we actually tactically do outside of just support, we handle all SEO, all email marketing, all social media posting.\r\n\r\n\r\nall website maintenance, AB testing on the website for pop ups and funnels, everything with the funnels, completely handled automated text, automated emails, seasonal campaigns, like they don't have to learn any of that kind of stuff. Obviously, a lot of AI stuff we're integrating right now to I love that.\r\n\r\n\r\nIt's something for them. All right. You don't have to answer this question, but what's your long term plan? Is this a business you hold forever in cashflow or are you like,  I got that private equity itch. I'm ready to scale and sell  in the next  five years. I know it's a hard question to ask, but just curious on your thoughts. \r\n\r\n\r\nThe truth is maybe goes back to the way I think about business. I plan to hold in cashflow. That's my goal is I enjoy what I do. I love taking care of the franchisees. It's really fun for me, for me, my ethos is business is meant to support the type of lifestyle you want. I'm not here to cash out and go rich and be like, cool.\r\n\r\n\r\nI'm going to go ball out on the yacht. I'd rather just  go hang out on the yacht right now. I'll run my business. That sounds really fun to me. And I, you know, if it's sacrifice a little bit of growth, that's okay. I'm okay with that. So  going back to that, like I'm trying to build assets.  My friends, my LA business is an asset.\r\n\r\n\r\nI've had it since 2013, been around Knock on wood so far. So the test of time, and I feel like there's a lot of runway left with it. A lot of potential same with the franchise business. And who knows, eventually I'll start at more and more things. I just got invested in a S and B automations and funnels company.\r\n\r\n\r\nI think a lot of ancillary stuff will eventually start launching and doing, but yeah, I don't, this isn't a, let me scale it fast and sell, which like, maybe that's actually the move in this industry. I don't really know. That's just not really what I want to do. No, that's rad. All right. I have some rapid fire questions for you.\r\n\r\n\r\nYou ready? Yeah, me dude. I don't think you're ready for this jelly. What do you love about this business?  I love  the recurring aspect of it.  This is the business where you could create it and eventually automate it and it creates a hating passive income because it's not a real thing, but you could manage it with less time and have it be stable and growing and making recurring revenue for you.\r\n\r\n\r\nThat's beautiful. And there's not a crazy amount of overhead, not a crazy amount of risk. I don't wake up sweating. Like, how am I going to make payroll? This is not a thing in this industry. You have different sets of problems, but it's kind of a stable, stable companies, what I would think about it.  What do you hate? \r\n\r\n\r\nPeople management.  Okay. Okay. Let's clarify the franchisees or the frontline employees who are actually doing the cleaning services.  Not the franchisees at all. Yeah. And.  The hard part is I don't think it's unique just to our model, but when you're in home services, oftentimes you're dealing with blue collar labor, right?\r\n\r\n\r\nAnd if it's not your background, you don't quite understand the problems that many blue collar laborers deal with on a day to day basis. And there's maybe more call outs, there's more tardiness, more flakiness. There's a different set of problems that come with dealing with Blue collar labor that you just have to deal with in home services.\r\n\r\n\r\nAnd it's tough. It gets easier over time, but it's never fully solvable because you're still dealing with people. And I think that's the hardest part.  What keeps you up at night? What are you most stressed out about specific with your company and your industry?  Yeah, I guess I answer both ways. Cause like the easy answer on the franchise side is how to make the franchise the most successful, like I'm up all night thinking about how do I make that actually happen for my industry?\r\n\r\n\r\nI would probably say laws, you know, there's changes that could be changes in labor laws and workers comp. There's a lot of changes that could happen, which would directly impact this type of model.  Not everywhere. I feel like there's ways around it, but that's always the most worrisome part of the model in my opinion.\r\n\r\n\r\nAll right. These are my three favorite questions. Real estate guys are always jealous of SMB guys because they're like, Oh, it'd be so nice to have a cash flowing asset that I could grow and scale. And then SMB guys are always jealous of the real estate guys because they're like, man, it'd be so nice just to have a business that has cash flows, but then appreciates slowly and a steady Eddie.\r\n\r\n\r\nI don't have to worry about it. What business or industry are you the most jealous of right now?  Oh,  what a good question. Let me think about this. Cause we all have it right. Everybody has this sort of grass is greener and then we get to it and we're like, oh yeah, it's actually not that much better, but we still think about it.\r\n\r\n\r\nYeah. I think it's the information business, meaning like course creators, sellers, things like that, who do that. And. Look, I'm not like, I don't hate on course creators at all because I feel like I bought enough courses. I see the value of them. I even have a course that I don't really promote, but like, I see some numbers, some of these guys are making in terms of just like profit margins and scalability.\r\n\r\n\r\nI'm like, that sounds so much easier. Like you're not delivering anything besides a PDF and like content and like,  that's like there's zero equity, of course, but it just sounds so much easier. So I'm jealous of. Okay. Course raters is what I would say. That's a great answer. What are you obsessed with right now?\r\n\r\n\r\nAnd  to give you some context, if you had two free hours today,  what would you sit down and do? Are you whipping your laptop out and reading? What are you obsessed with?  So I'm currently doing this.  The buy back your time workbook. Oh, okay. I've never heard of this book. No buying back your time through the use of executive assistance, things like that.\r\n\r\n\r\nIt's a pretty famous book by Dan Martell. And what I realized is like, I read a lot of books, but implementing it something I want to get much better at. So currently I'm obsessed with  how do I automate stuff? I hired a full time EA.  How do I get really, really good at delegation? That's what I'm obsessed with right now.\r\n\r\n\r\nSo I'm just studying as much as I can about how to be a better manager, how to automate things as a more about funnels, like how to actually set things up. So it's out of my brain, like TTV, all that kind of good stuff. So I just hired an executive assistant two months ago, three months ago, and I'm going through the same thing.\r\n\r\n\r\nI'm like, okay, how do I utilize them? I've never had one before. So what do I do with them? I need to read that book. I'm going to, I just wrote that down. I'm checking it out. All right.  Last question.  What advice would you give yourself 10 years ago?  10 years ago, I'd say go bigger, sooner, take a bigger swings.\r\n\r\n\r\nI think I played a little bit too safe, stayed in my job a little bit longer than I was hoping. I had too much money in my bank and I was like, I'm going to save more because I'm scared. And I didn't really bet on myself, but on the business. I wish I took a swing earlier. Yeah. I mean like money's very renewable, especially when you see opportunities everywhere.\r\n\r\n\r\nTime is not. So just going bigger earlier, I think is what I would do. I love that answer. All right, man, this has been a, an awesome conversation. I, uh, loved getting to know you better. I think we're going to start our own mastermind where we talk about how to get our EAs up to speed and whether or not we're utilizing them to their full potential.\r\n\r\n\r\nIf people want to come find you, where's the best place?  Yeah. So I actually had my own podcast. It's called the freedom formula. So feel free to type in the freedom formula with Neil Parekh. You'll be able to find me there. Most active on Twitter. And if you happen to be interested, if you go to made this franchise, that's M A I D T H I S franchise.\r\n\r\n\r\ncom, you can inquire about franchise opportunities as well. That's right, man. Hey, let's do this again sometime.  Awesome. Thanks for having me, Nick. Yeah. Thank you.  All right. That's it. Another one for the books. I'm fired up. I don't know what else to say. I hope you found something valuable in that conversation.\r\n\r\n\r\nI hope you learned something. I hope there's something that you can apply to your business today, tomorrow, in the future that makes you money, makes you more successful, gives you more time with your kids. If there was something I'd love to hear about it. In the comments below, give me some feedback. And if you like actionable advice and you want more of this, I write a weekly newsletter that gives insights, tips, and tricks into the world of entrepreneurship.\r\n\r\n\r\nSubscribe in my bio.  And if I can help you in any way in your entrepreneurial journey, don't hesitate to reach out to me. Nick at cofounders. com. Sorry, Kelly, for more emails. And the last thing is. Remember,  curiosity is a superpower and you can use it to your advantage. As my mom used to say, there's no such thing as a dumb question. \r\n\r\n\r\nOnly dumb people.  We'll see you next time.",
  "metadata": {
    "duration": "",
    "date": "2024-06-28",
    "platform_source": "Google Drive"
  }
}