{
  "episode_number": "87",
  "episode_title": "This Handyman Makes $1.2M/Yr: Here‚Äôs How You Can Copy His Model Anywhere with Chris Koerner",
  "guest_name": "Chris Koerner",
  "business_name": "Handyman Business",
  "transcript": "﻿So I talked to a guy last week that is making about $1.2 million a year. He's a handyman. Okay, he's making $1.2 million a year and he's doing something very interesting. His pricing model is very interesting and it could be replicated in many other industries. Chris, what's the biggest expense that employers have or business owners have that they feel like they have zero control over? How much would they pay for something like that? Give it for free for 30 days. I'm gonna install it all for free. They don't know it takes you like 10 minutes. For me, \r\n\r\n\r\nMarry the- okay, okay. Marry date or kill. Marry... I'm gonna marry the... \r\n\r\n\r\n\r\n\r\nI found a website that's really, really interesting and I want to monetize it somehow, but I'm coming up short. Is it called Wikipedia? No, it's called distill.io and what distill does, I'm going to pull it up. It notifies you if something on a website changes. Okay. So as a family, we are going to the Alabama Auburn game at the end of the month, the iron bowl, but with sports tickets, it can \r\n\r\n\r\n\r\n\r\nrange. If Alabama loses the next two weeks, they're going to be cheaper, right? You just, you can't really know. You don't know when the best time is to buy them. And so you can use distill the IO to be notified when a ticket price drops. But I think there's a world where you could build a SaaS on top of this, or you could just build like a ticket notification system that's built on top of distill the IO and it's stupid, simple, easy to use. It's $10 a year or something cheap. If you heard of Scott's cheap flights. \r\n\r\n\r\n\r\n\r\nIt's kind of like that. It's like 70 bucks a year and it's kind of an insurance policy. You're like, I don't know how many times I'm going to travel this year, but if I get an email and it says the flights to Hawaii are 300 bucks right now, we're going to go to Hawaii and I'm going to pay 70 bucks a year just for the opportunity to save, you know, a thousand dollars on tickets. How could you use this to make money? Who's using distilled to IO right now? The messaging on their website is like towards the ticketing websites. Take ticketing out of it. Why would I care if a website updated? \r\n\r\n\r\n\r\n\r\nHere's the problem. If I cared enough for a website, like an update on a website changing, I'm probably going to be on their emails list. So it has to be something where you're interested enough to want to know about it, but not so interested like the, there's not a mechanism to update people via a newsletter. I'll give you some ideas. So let's say it's a Shopify site that sells a product that people obsess over. Texas snacks. We have some, some \r\n\r\n\r\n\r\n\r\npretty advanced apps that will notify people when something is back in stock if they choose to be notified. But I would bet that most Shopify stores don't have this. You go look, they're out of stock at some point or another. They go back in stock and that just happens when some random employee, maybe a VA just changes a number in the settings and hit save. Then goes back in stock. Most Shopify stores do not have a feature that will automatically notify people. Now it might go in their next newsletter like days later, but it might be sold out again by them. \r\n\r\n\r\n\r\n\r\nSo it could work for niche products like this or websites. Like let's say you're a major fan of some merch store or a food store that doesn't have a feature like this. It could work for that. It has to be a business that is capitalizing on being early. So like one of the things that come to mind for me are a trading company. Let's somebody say somebody who wants to invest in certain businesses, publicly traded companies have to disclose every quarter and every year their financials and those are 10 K's and 10 Q's. And so when the 10 K is published, \r\n\r\n\r\n\r\n\r\nto their website because it'll be published to their website. How do you know that it's being published? mean, this can be one of those things where she's like, you automatically get a notification, you go and read through the 10k or the 10q. And if you're first to go through it, actually pull out anything that's that's important. You can have a trading advantage. So that's one way I'd have to believe that there are already things that you can do like that. You know, it'll be interesting. Sorry, this is like, if you're a searcher, \r\n\r\n\r\n\r\n\r\nAnd you're trying to buy a business. You could set up a bunch of like, let's say you find like different target businesses, just different parameters. Anytime that there's a change on their website relative to address pricing leadership teams. I mean, that could be a signal to you that something's going on with the company. I'm with you, man. There has to be something there. I'm going to read you some ideas that they, that they provide on their website. legislative tracking. \r\n\r\n\r\n\r\n\r\ntrack budget, find grants, build tracking, get legislative calendar alerts. Obviously those websites are super outdated enterprise solutions, medicine and health jobs, monitoring new jobs being posted, legal tracker patents, real estate track, zoning laws, stuff like that. So basically any of these ideas you could build a business on top of, right? Like you could build a small SaaS tool that just tracks zoning law changes in Los Angeles County. \r\n\r\n\r\n\r\n\r\nThere's a lot of people that would really need and want to know that as soon as possible, or it could cost them a lot of money, right? That's true. Investigative content strategy, spying on your competitors, ticketing, cybersecurity. And I was just thinking more broadly speaking as a framework, I love reaching out to companies like this and asking whoever is reading my email, how are people using this? In what creative ways are people using this? So \r\n\r\n\r\n\r\n\r\nDo remember when I used to have an RV that I rented out? So I rented it on RV share and I was getting my MBA at TCU at the time, which meant I had a lot of free time on my hands to surf the internet while I was supposed to be learning. And I distinctly remember sitting in class, making a spreadsheet, running all these searches on RV share, trying to reverse engineer what the most in demand type of RV was. You've got a class A, which looks like a tour bus class B, which is like a converted van. \r\n\r\n\r\n\r\n\r\nand class C, which is like a motor home, like an RV with the engine attached, right? And I distinctly remember saying, all right, Dallas County for this weekend, how many class ABCs are available for rent this weekend? No notice. All right. There's 86 class A's, there's 82 class B's and there's nine class C's. Huh? Interesting. Well, maybe there just aren't that many class C's listed. Let's look six months out where few people have booked same search. there's 92 class A's. \r\n\r\n\r\n\r\n\r\nThere's 90 class Bs and there's 60 class Cs. Interesting. So there's just about as many listed in each category, but class C is being rented by far the most. So if I want to go out and buy an RV, let's say I haven't yet, I'm going to buy a class C and you can do this with Airbnb. What types of Airbnb's we've talked about this in the past. You can reverse engineer just on Airbnb's homepage. What is the most in demand just by searching for this weekend and for a year out, right? \r\n\r\n\r\n\r\n\r\nI think I have an idea for this. If I hold it. Yeah, sorry. No. All right. So I made this big spreadsheet and I was able to get really close on like what is the best type of RV to buy? Cause then you look at the price and you're like, huh, the price for all three of these RVs are about the same, but a class C is rented four times as often. Why would I buy something else if I'm doing this as a business? Now, if I want to buy an RV from my family, it's another story. And so I reached out to RV share at the time and they were pretty small. \r\nat the time and I said, hey, I'd love to talk to someone. I know I sound crazy. You know, look at my spreadsheet. Am I in the ballpark here? Like, because I haven't bought the RV yet. I want to buy something that's good for my family and also I can rent out. Turns out we wanted to buy a class C anyway. And then I sent it to this guy and he's like, hey, can you have time for a call? I'm like, yeah, I guess. So I hop on the phone. He's like, where did you get this data? I'm like, from your homepage. He's like, this is exactly right. \r\n\r\n\r\n\r\n\r\nLike I wish I could shout it from the rooftops like class C class C. Like if you want to do RV show as a business class C RVs and I'm like, cool. It worked. And he was like super impressed. But I'm like, literally I just ran searches on your website. So that is the framework here of just like when you see something that's interesting, reach out to the business and be like, how can I make money with this? How are people making money with this? How are people using this in surprising ways? And you can come up with all kinds of ideas. Hearing you talk. I think this would be an interesting thing to do. Let's say that I \r\n\r\n\r\n\r\n\r\nI'm a company that sells RVs, right? And I'm trying to figure out a better way to convert on my, on my landing page or on my sales page. Okay. I think what I would do is I would go and find 10 or 20 competitors and then just on their, on their purchase pages, let's say, set up an automation for any time that there's a change and see if I can pull any patterns. Cause it's like, if they're all, maybe they've all changed the color of the buy now button, or maybe they've all \r\n\r\n\r\n\r\n\r\nchange their script and they made it shorter, right? Or maybe they're all changing it to mention financing as opposed to just paying cash. Like who knows what the changes are? It'll take some sort of analysis on your end. But if you went and pulled maybe 20 competitors and then you're just seeing the updates as they come in, it would allow you to make your conversion even better because you're seeing what's working for other people. Cause they're not changing those things on those high leverage pages unless it's working. Yes. But your idea just gave me another idea. \r\n\r\n\r\nAnd okay, I'm dude. All right. Now's the part of the show where I feel the most uncomfortable, but my therapist says I need to face my fears. So here we are. I've started a newsletter and I want you to subscribe and what you're going to get every single week are the aggregated conversations from that week that I have on this podcast with an overview of what their business actually looks like. I'm also going to throw in a review of one or two businesses that are listed for sale. I'll give you my opinion on whether or not the EBITDA multiple is good or there's customer concentration or there's red flags or green flags. And then lastly, \r\n\r\n\r\n\r\n\r\nI'm going to give you one piece of actionable advice every single week on how to buy your first business. click the link below, subscribe to my newsletter and let's get back into the show. So a local business that makes tens of millions of dollars a year that most people overlook that has a huge marketing budget that is just so willing to spend thousands of dollars a month on X, Y, or Z SAS tool to give them a little edge. What is it? Car dealerships. \r\n\r\n\r\n\r\n\r\ncar dealerships spend a stupid amount of money on marketing, direct mail SEO, you name it, if it might work, they will buy it. Okay. And I know this because I have a friend now in the space who sells software to these guys and they spend like crazy. So dude, if I live, I used to work at a car dealership in Tuscaloosa, Alabama, right? If I'm a dealership owner into if if I own Nick Saban Nissan in Tuscaloosa, Alabama, I'm gonna want to know \r\n\r\n\r\n\r\n\r\nhow many Nissan's my local competitors are selling. You could go into them and this distilled IO costs like 10 bucks a month, right? You could go into them and say, Hey, I'm going to send you a daily report of are the all the cars that all of your competitors within a 30 mile radius sold the day before. that be helpful to know? my gosh. Yeah. Now we can, like if all the Altima's are gone, then we can mark up our Altima. If there's a zillion Altima's on the market, then we need to cut our Altima prices. dude, \r\n\r\n\r\n\r\n\r\nHow much would they pay for something like that? Give it for free for 30 days. I'm going to install it all for free. They don't know it takes you like 10 minutes. I'm going to start sending you the reports and then we'll talk price in 30 days, but promise me you'll read the reports because it's to be very valuable. Yeah, and that or real estate, right? Like how many homes did you sell? State would be a really good one, but like real estate, a little trickier because it's in my experience, it's harder to sell into that. Whereas car dealerships have this marketing budget on their line. \r\n\r\n\r\n\r\n\r\nline item marketing budget that's massive. It's just like, yep, let's allocate three grand to this every month and see how it goes. Whereas real estate, it's a little more stodgy. think the framework is literally where is there an arbitrage if you're quicker? If you're able to get information faster, where is there an arbitrage? And then you can reverse engineer into any business that has that function or component to it and use distil.io. Yeah, I love it. All right. CPA. \r\n\r\n\r\n\r\n\r\nor silver tsunami? Well, you know, the acronym CPA like gives me anxiety and makes me sleepy. So let's go silver tsunami. All right. Let's go CPA. So, so we're, so now he's the one I'm the most excited about, but I don't think we have enough time for it. All right. So, Chris, what's the biggest expense that the employers have or business owners have that they feel like they have zero control over taxes. \r\n\r\n\r\n\r\n\r\nTaxes. Yeah, taxes, right? What I'm about to say, I don't think is a new idea or necessarily a novel idea, but I think it is novel in its application. But traditionally, you have a CPA and CPAs are telling you when to file. They're helping you with bookkeeping. They might even be helping you kind of go through some tax strategy, but usually tax strategies like way down the list, right? I think there's space for a tax trippa. \r\n\r\n\r\n\r\n\r\nspecifically for entrepreneurs. And when you're talking to a CPA, how often do you talk to Ross? As infrequently as I'm able to. Yeah, maybe once or twice a year. And it's usually around filing deadlines, right? Just enough to not get audited. And even so, I've been audited. Yeah, but it's very rushed. You're constantly feeling like you're under the gun, where I think there's space is, again, not in bookkeeping and accounting, not in tax filing. \r\n\r\n\r\n\r\n\r\nand not in fractional CFO work. It's in helping entrepreneurs maximize their tax strategies. So here are some examples. What should I pay myself as an entrepreneur? There's rules around that. So you have to pay yourself something. Otherwise you get audited because you're avoiding certain taxes, but you can't pay yourself too much. Otherwise you're not complying with the IRS rules. Okay. How should I handle retirement? Think of it like this. When you are a business owner, you could contribute to a 401k. \r\n\r\n\r\n\r\n\r\nWhy is it important to contribute to a 401k? I have literally a 401k. Is that an ultra marathon? I don't know. So that's the most responsible thing that I know nothing about. A 401k allows you to put pre-tax dollars into a savings account that you don't have to pay. Listen to me that you don't have to pay taxes on. So the idea is you're to have a lower tax bracket when you retire than you do right now. So if I have $50,000 and I'm a business owner, \r\n\r\n\r\n\r\n\r\nI'm probably going to pay somewhere in the ballpark of like 30%, $15,000 in taxes. If I put that money into a 401k after I retire my tax and then my tax liability gets down to maybe 15%. Well, I just cut my taxes in half, right? Here's the crazy thing. You can contribute up to $23,000 a year to a 401k. But the company can also match 100%. So for you is the company that you own your company that you own. So you \r\n\r\n\r\n\r\n\r\nNow, you have to make sure you can you match everybody's you can't just match like the owners like that. And there's certain rules. But theoretically, you could put $46,000 away pre tax into a savings account that just sits there. Then you're like, Well, that's not that much money. Like, okay, well, does your wife do anything in the business? Yeah, she does something in the business. Great. Pay her a salary and have it all go to the 401k and then match that 100%. All of sudden, you've got $92,000. That's gone away into a savings account that you \r\n\r\n\r\njust saved taxes on you're not paying taxes on right. And there are IRAs that you can contribute to what I need to make I need to make a call. But then you can also pay your kids through the business they can contribute to a 401k. You could also contribute to an IRA, which is different than a 401k and 401k has to be tied to a business and IRA can be independent and you can contribute to that. But the IRA limit of contributions is $7500 a year. Okay, is that the rifle association? It is the \r\n\r\n\r\n\r\n\r\nOkay. Well, this is the IRA. this is the International, International Revolutionary Association. cool. Okay. So that's savings. Then there's how do I pay my spouse and kids? You can pay your kids and spouse through the business for doing actual work. Like, and it's not child labor laws, right? Or just knowing what are potential big write offs? Okay, maybe I could write off a vehicle, but what else? You can write off a certain percentage of your mortgage, but there are very specific rules. \r\n\r\n\r\n\r\n\r\nphone, internet meals, vacations, then there's like real estate, how do I depreciate, all that stuff. So like in my mind, that's very different than, how do I file my taxes? And it's the tax Sherpa on your team. They would be separate from the person filing your taxes. Now, if you, if you did this, you like stay in your lane, do not start doing bookkeeping, do not do certain. There's plenty of money to be made in this line. Stay in this lane. And you are essentially the advocate for the business owner. \r\n\r\n\r\n\r\n\r\nso that when the end of the year comes and the business owners having those conversations with his accountant, which we've all had, right? Well, you're talking to your CPA and you're like, well, could I write this off? And they're like, maybe they're like hemming and hawing or you're like, a friend of mine told me about this deduction. And they're like, yeah, yeah, that could work for you. And then the back of mind, you're like, why didn't you know that deduction? You know what I mean? They're just not thinking about it. They have so many returns. So like this person's in your corner, they're looking for tax deductions, but you still got the check of your regular CPA who's like, \r\n\r\n\r\n\r\n\r\nthat's good or bad, right? And then they can argue about it. And like you don't have to argue about whether or not it's a reasonable tax deduction. So what I would do in terms of fulfillment, I don't think you need to be a CPA. I think you can use chat GPT and just the stuff that's already out there, but just focus on helping entrepreneurs save. From a pricing standpoint, I'd be like, either pay me $10,000 or 25 % of whatever I save you. I like the latter. \r\n\r\n\r\n\r\n\r\nvery easily measurable. get last year's tax returns, you just go through it. And then for distribution, I would just piggyback. I would go to the tax and bookkeeping firms and just say like, Hey, let me, let me talk to your clients. Or I would also start, you know, be the Twitter, Instagram, YouTube tax guy, where you're just putting out tax information. Like some of these accounts already exist, but I think just leaning into it and just being that, just being that niche where you're providing value to entrepreneurs who aren't yet rich enough. \r\n\r\n\r\n\r\n\r\nto have like their on staff CPA. Cause like you get very rich. Yeah. There's lots of options, but you gotta have a lot of money for that. There's a lot more in the messy middle than there is at the top. Yeah. And then with things like chat CPT, you can actually get to the answers of these things fairly quickly or at least point you in the right direction. So yeah, you're not a JP Morgan chase private banker who's like giving tax advice, but you're still saving people tens in some cases, hundreds of thousands of dollars a year on taxes. Yeah. \r\n\r\n\r\n\r\n\r\nI love this idea, honestly, and I love the piggyback idea, but I think you have to change the incentive structure to get the CPA in your corner and say, my pricing structure is 30 % of any money saved and I'm going to give you 30 % of that. So you're effectively going to get 10 % of everything that I saved this guy for just referring him. You don't have to do any work. I'll do all the work. And then he can be your advocate. Like, dude, I this tax sherpa. He's legit. Like \r\n\r\n\r\n\r\n\r\nI'm like in the weeds in your returns. Like I know a lot of this stuff. Like I know a lot of this stuff, right? Like, but like this guy, it's all he does and he doesn't charge you anything upfront. He only charges if he saves you money. And then I like the idea of that, but, but CPAs are to be like, well, as a fiduciary, I have to disclose that I'm going to be getting a kickback and I don't feel comfortable. So like you'd have to figure out some other way for them to be incentivized to do it. Otherwise I just, I think it would get messier if, you start paying them. \r\n\r\n\r\n\r\n\r\nNot because I don't think you should like you should pay them. It would be way more valuable. You probably get way more customers, but I could just see a lot of CPAs kind of. this feels dirty. I need to tell my I could say it, but if they like let's say you get ahead of that and say we do advise you tell your client. So you can do that. You can. Yeah, you can definitely do that. And then do you think honestly do you think clients would mind? I'm not. This isn't a leading question. I don't know like if my CPA came to me and said this and he's like hey, he charges 30%. \r\n\r\n\r\n\r\n\r\nHe is going to give me a cut out of that, but you don't have to pay me. You just pay him. I don't think I would mind. If I was the CPA, I would probably just say, Hey, this is a service we provide and like not even tell them about the pricing structure. The biggest problem is going to be the CPA signing their name on recommendations. And if, if you make the CPA feel like, Hey, look, we're just an advisory service. You don't have time to go and find all of these deductions. Let us do this. Like we'll do all of the work and the, you know, the payment runs through you and then you'll cut us our chat, our, our portion of it. \r\n\r\n\r\n\r\n\r\nbut you have final say over what deductions actually get approved. think that, I think that actually probably the best way to do it. Cause they're going to feel comfortable with it. The customer is going to feel like it's run through that agency and, there's not going to be any real issues. Okay. I like it. It's a good one. I talked to a guy last week that is making about $1.2 million a year. He's a handyman. Okay. He's making $1.2 million a year and he's doing something very interesting. His pricing model. \r\n\r\n\r\n\r\n\r\nis very interesting and it could be replicated in many other industries. So he charges $750 a month as a retainer to be a handyman for homes that are like somewhat rural, call it one to $3 million homes, nice homes, but not like mega mansions that like constantly need stuff done. And a lot of it is time sensitive. Maybe it's septic issue or something, but $1.2 million a year. Most of that \r\n\r\n\r\n\r\n\r\ncoming from a $750 a month retainer, but then he still charges 120 bucks an hour for the actual work that he does. Wow. What do you think? Just, just so that you have access to him or he's like, Hey, you're not going to be booked out three months. Yeah. Yeah. Because like the, best handyman are always booked out. So he kind of accidentally landed on this model. He's not like a super smart business guru. He's just like, listen, he just kind of said it once to a customer and they were like, \r\n\r\n\r\n\r\n\r\nNo, no, a customer said it to him. There's like, is there just something I can pay you every month no matter what? To be sure that you answer my call and that you'll be here like within a week instead of within two months? Because I just can't wait two, three months for some to be handled. But I call the other handyman and they don't even pick up the phone, much less get over here that week. And he just started throwing out a hundred bucks a month and then no pushback 200, 500. And he landed at 750 where he first started seeing pushback. Now he's making like insane recurring revenue. \r\n\r\n\r\n\r\n\r\nWhat's he making? Net? 30%. Just recurring revenue. What do think he's? I would think of his net. It's his recurring revenue is like 7080%. But like how many customers are paying like 10 customers? 100 customers? What do you think is? He didn't. I mean, I could pull out the calculator. He didn't give me exact numbers, but I would think it's hundreds of customers. I mean 750. That's. 7500 75 grand. If it's 100 customers put you about a million a year, so I would call it like. \r\n\r\n\r\n\r\n\r\n70 to 100 customers paying him 750 a month. That's really smart. Why would you not do that? I guess you would have your customers. You get recurring revenue. So like there's more stability. You know who you're getting. They know who you're getting. Like that seems like a no brainer for people. How could this be monetized outside of handyman work? Or could you partner with a handyman to like help him implement this pricing like a really good handyman or do it in a different type of home service business? \r\n\r\n\r\n\r\n\r\nThe hard part is that you don't necessarily know the quality of the handyman, but I guess if you had somebody who you knew was really, really good and you were just like, let me help you do this, I think you'd have to do it neighborhood by neighborhood, or you could post to Facebook Marketplace, Reddit. I don't know. Where would you market this? mean, 750 is a lot. I think you could work up to that, but you could... \r\n\r\n\r\n\r\n\r\nI wonder if you could build like a SaaS tool that enabled business owners to charge this way, any price they want. And that, that could be the route. Cause I think there are a couple of VC funded startups doing this. Like there's basically a whole class of idiot millennials like us that really don't know how to use a wrench. And there's a handful of VC funded startups serving us like home service startups where you pay like 50 bucks a month and then you have someone on call. So I wonder if there's a way to make that, to enable that for anyone, for any business owner. \r\n\r\n\r\n\r\n\r\nHmm. I'm sure. Yeah, I don't know. I'm sure that there is. I should have thought this one through more. All right, Nick. It's time for a date or kill. We've got the Reddit growth growth hack business in a box idea distill the IO and the CPA idea. Okay. Who's going for you for me? Marry the CPA idea date. \r\n\r\n\r\n\r\n\r\nMan, this is very selfish. Date, distill, no, date, business in a box, kill, Reddit. Okay. And then distill is just in no man's land. Distilled.io, the tracking software. Okay. What is your reasoning? No, no, no. You got to say yours first and then we say our reasoning. Okay. Maridator kill. Marry, I'm going to marry the distilled.io plan for car dealerships specifically. I really, really. \r\n\r\n\r\n\r\n\r\nReally love that idea. I'm going to date the Reddit growth hack idea and I'm going to kill the business in a box idea. So weird that we both married and dated our own ideas. No, it's just a coincidence. Distilled.io I just felt like I not yet can not wrap my mind around like where would I use this and how would I use this? Right? Same with the Reddit growth strategy. It's just like how would exactly would I \r\n\r\n\r\n\r\n\r\nWould I do this? I think they're both really good marketing strategies. I just don't know about how to build a business around those. That's fair. I didn't like to still until we got to the very end of it and talked about the car dealership idea. I love that idea because you could start generating those reports for the car dealerships without them ever opting in and just start emailing them to them. That's your distribution strategy. Give it them for free. Yeah, and then you send an invoice. That's why I love that business in a box. I killed that because it's just hard. \r\nI think it's just hard to wrap my mind around. I, I date the Reddit growth hack idea because I think it's underutilized and more business people, more capitalists should own their own subreddit so they could monetize it. \r\n\r\n\r\n\r\n\r\nDone. I love it. right. That's a wrap. That's a wrap, Jack.",
  "metadata": {
    "duration": "",
    "date": "2024-11-22",
    "platform_source": "Google Drive"
  }
}