{
  "episode_number": "227",
  "episode_title": "He Built a $200K Newsletter. Then launched a $100K Christmas Lights Biz with Jas Singh",
  "guest_name": "Jas Singh",
  "business_name": "Winnipeg Digest, Christmas Lighting Business",
  "transcript": "﻿Nikolas Hulewsky (00:00.91)\r\nJazz, you were my first second time guest. You are now my first third time guest and I'm stoked to have you. So Jazz built or Jazz called me. We had a conversation over a year ago. You're one of my first conversations when I started podcasting. Then you launched a local newsletter. That local newsletter now has 106,000 subscribers. You're doing between 10 and $15,000 a month in revenue just on that newsletter. So you built a great business. Episode 105, it's one of my most listened to episodes with you.\r\n\r\n\r\nIn fact, it's the episode that plays on my YouTube page. So go listen to it. It's a freaking great episode where jazz goes through the economics of newsletters, how he grew it, how, how he acquires customers, how he's monetizing all that stuff. Well, you caught my eye because you always tag me and I'm thankful that you tagged me in posts because you're starting to kind of change your philosophy from just being a newsletter to, to can I launch businesses off of the audience that I've created off of this local newsletter in Winnipeg? Is that right?\r\n\r\n\r\nJas (Winnipeg Digest) (00:43.682)\r\nYeah.\r\n\r\n\r\nJas (Winnipeg Digest) (00:59.278)\r\nYeah, yeah, that's about the gist of it. would say just as a little difference as we have, so it's 106,000 people audience. About 72 is social media and then about 35 is our news.\r\n\r\n\r\nNikolas Hulewsky (01:14.478)\r\nOkay, was that always the plan with the newsletters? Like, hey, let's launch a local newsletter and then build a business on top of the distribution.\r\n\r\n\r\nJas (Winnipeg Digest) (01:22.176)\r\nYeah, I mean, we've always wanted a portfolio of companies, like that's kind of what I want in the ideal world, obviously much easier said than done. But then this is kind of the first of it. So I want to prove the idea with the first company and now that I'm building and then hopefully be able to build multiple more on top of it, use it as a basically like a backend marketing for other businesses.\r\n\r\n\r\nNikolas Hulewsky (01:43.919)\r\nOkay, so let's say you have the newsletter, 35,000 subscribers, but then you have 70-ish thousand on Instagram. That's really valuable because they're local, they're concentrated, they're high intent, and so you have this distribution channel that you can access at any time. It sounds like you've already started testing this idea. Tell me about the events this summer.\r\n\r\n\r\nJas (Winnipeg Digest) (02:08.788)\r\nYeah, so yeah, for sure. we started doing what we started doing was before we used to just do plain out ads, they would pay us money, we would do advertising for them. And then we started seeing okay, converts really well. So this summer was the first summer where we partnered with a local market who used to do one market a summer, maybe two if they had the time, where now we've taken all the marketing off their hands. So that's Facebook ads and\r\n\r\n\r\ncreating content, so on and so forth. So we do all of that. In return, they're going to do five markets this summer. They already did four. Our fifth one is this weekend. And in return, they're going to do five markets where a 30-70 profit split with them, right? So we make money when they make money. And, you know, they handle all the logistics, talking to vendors, collecting payments, talking to the mall, the location, the permits, insurance, A to Z.\r\n\r\n\r\nNikolas Hulewsky (02:39.598)\r\nyou\r\n\r\n\r\nJas (Winnipeg Digest) (03:04.29)\r\nand all we're doing is we're the marketing partner for them, but we come in with the audience. Yeah, so basically that's what we've done and that's ideally what we would like to do with future businesses, whether it's acquiring equity or getting equity in return of our audience and yeah.\r\n\r\n\r\nNikolas Hulewsky (03:06.488)\r\nDo the marketing arm.\r\n\r\n\r\nNikolas Hulewsky (03:19.182)\r\nSo you don't have equity in this, sorry, what is the event? that. What exactly is the event?\r\n\r\n\r\nJas (Winnipeg Digest) (03:23.298)\r\nYeah, it's like the summer market, right? So we've got vendors, right? It's free to attend. We make money B2B. We have about six, seven thousand people come in a weekend basically, shop these local vendors. So yeah, that's kind of what\r\n\r\n\r\nNikolas Hulewsky (03:26.648)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (03:35.246)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (03:39.534)\r\nCan you tell me, so the 30-70 split, what does that mean to you? Like what is 30 % of 10,000?\r\n\r\n\r\nJas (Winnipeg Digest) (03:43.725)\r\nYeah.\r\n\r\n\r\nYeah, so that's probably.\r\n\r\n\r\nYeah, no, so that's about, I mean, they probably make 10 to $12,000 profit per market. Right. So, you know, that they'll probably end up being somewhere in the ballpark of like 20 or $1,000 or something for me this summer.\r\n\r\n\r\nNikolas Hulewsky (03:59.118)\r\nMm. Okay.\r\n\r\n\r\nNikolas Hulewsky (04:07.778)\r\nthis summer, is that worth it? So from like a cost fulfillment perspective, the amount of time that you're putting into it, does you have a team working on this? Is it just you? What does that look like?\r\n\r\n\r\nJas (Winnipeg Digest) (04:18.068)\r\nYeah, it's me and like two other VAs that are currently working on it, right? And then in terms of like from a time perspective, it's not terrible, right? Like all it takes us is we'll go, we'll shoot a video or something. Most of our content now from on Instagram has actually switched from reels to carousels. So all of my content is very much just I can sit at home and make it as long as I have a picture. Yeah.\r\n\r\n\r\nNikolas Hulewsky (04:40.206)\r\nInteresting. Is Instagram your main acquisition channel?\r\n\r\n\r\nJas (Winnipeg Digest) (04:44.376)\r\nFor news that are subscribers, no, it's a paid ad still for Facebook ads.\r\n\r\n\r\nNikolas Hulewsky (04:49.601)\r\nokay. So why do you spend so much time on the organic content of Instagram?\r\n\r\n\r\nJas (Winnipeg Digest) (04:54.624)\r\nYeah, it's because we have so much social capital at that point that we can reach out to any business in the city and they kind of have to reply. You know, they almost feel obligated to reply because we have maybe like a top three biggest, the biggest audience in the city. So they almost have to reply whenever we're, you know, reaching out to them regarding a sponsorship or something like that. Yeah.\r\n\r\n\r\nNikolas Hulewsky (05:04.782)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (05:16.91)\r\nOkay, okay, you're just freaking big dogging everybody. Like, what's up, Winnipeg?\r\n\r\n\r\nJas (Winnipeg Digest) (05:20.334)\r\nSo that is how I did it.\r\n\r\n\r\nNikolas Hulewsky (05:25.198)\r\nSo let's just say 100 to $150,000 run rate a year in the newsletter. This looks like you're gonna make an extra 20 grand. And I know there's costs associated with it. I'm just saying high level $20,000 from these markets. Are the markets just summer markets? Are you gonna continue them?\r\n\r\n\r\nJas (Winnipeg Digest) (05:31.374)\r\nYeah.\r\n\r\n\r\nJas (Winnipeg Digest) (05:41.774)\r\nMm-hmm.\r\n\r\n\r\nJas (Winnipeg Digest) (05:47.15)\r\nYeah, I mean, see, if I didn't start this new venture that we're going into, I would have definitely wanted to explore the whole Bryant Park, New York market, but in Winnipeg somehow, some way. At some point, we were exploring the idea of throwing the biggest snowball fight in the world or something. You know, like there's a few ideas that have been, there's a few ideas that have been like tossed around. But with the business, now new business kind of starting up, I don't think I'll have the time to be able to do.\r\n\r\n\r\nNikolas Hulewsky (06:03.48)\r\nYeah, that'd be cool.\r\n\r\n\r\nJas (Winnipeg Digest) (06:13.582)\r\ndedicate to those and I think this is a higher leverage opportunity as well when you compare it to the market or to events.\r\n\r\n\r\nNikolas Hulewsky (06:21.048)\r\nSo of all the businesses that you could have chosen after you prove the model of, okay, cool, we've got an audience, we've got distribution. I did this market thing where somebody else did 100 % of the fulfillment. I just did the marketing. Of all the businesses you could have chosen after that experience, what business did you choose, Jaz?\r\n\r\n\r\nJas (Winnipeg Digest) (06:39.18)\r\nI ended up choosing it's a holiday Christmas lighting.\r\n\r\n\r\nNikolas Hulewsky (06:42.014)\r\nWhy the freak would you choose holiday Christmas lighting after that experience? Tell me about it.\r\n\r\n\r\nJas (Winnipeg Digest) (06:47.264)\r\nYeah, I mean, especially in a place where it's like minus 40 in the winters, you know, not the best place to be outside in the winter than for sure. But my thought process behind it was pretty simple. was I wanted a seasonal business, Hile TV, because if it didn't work out, I wanted to shut it down. Second thing was, the Hile TV part.\r\n\r\n\r\nNikolas Hulewsky (06:51.764)\r\nYeah.\r\n\r\n\r\nJas (Winnipeg Digest) (07:13.998)\r\nThird was I needed something that I can piggyback off of my audience. So 70 % of our audience is females, women, right? So what I wanted to be able to do was if I went to, especially let's say HVAC plumbing or something, first I didn't have the certifications for it, right? And for those, like I feel like generally the guy is the one making that decision. woman doesn't really care about what type of spurnace you're getting. So I wanted to type a business that the female was the main\r\n\r\n\r\nkind of decision maker in it. And so lighting was the one that we kind of ended up, that's why I go with. That was kind of the thought process of it.\r\n\r\n\r\nNikolas Hulewsky (07:52.238)\r\nWell, I I'll give the pros as well. The pro side of lighting is a lot of cash collected in a very short period of time. You have a set up cost. It's hot and heavy for a short window, but then really nothing for the rest of the year. If you do it right and you're targeting high income neighborhoods, you can make, I mean, do you know who Anne McGinty is? I just had her, Anne McGinty?\r\n\r\n\r\nJas (Winnipeg Digest) (08:13.998)\r\nI'm sorry, who?\r\n\r\n\r\nNikolas Hulewsky (08:17.998)\r\nI just had her on for the second time my podcast, but she started a seasonal Christmas lighting business 10 years ago. In her first year, she did 150 grand and it was an eight figure business by the time she sold it. She loves that business. think that's a great business. There's a bunch of pros to it, but why decide to actually do the business itself? Why not just be the marketing arm for a seasonal Christmas lighting business?\r\n\r\n\r\nJas (Winnipeg Digest) (08:25.709)\r\nYes.\r\n\r\n\r\nJas (Winnipeg Digest) (08:31.373)\r\nYeah.\r\n\r\n\r\nJas (Winnipeg Digest) (08:43.444)\r\nYeah, so I mean, we were very, well, okay, first thing first in Winnipeg, there is no one actual brand behind Christmas Lighting. So I was like, okay, that's a big kind of gap in the market. I mean, you can also, there might be a con that there's just not enough business here, which I don't think is the case for a million people city. You know, but there was not a specific company that just had a brand around Christmas Lighting. It was like lawn maintenance companies doing Christmas Lightings in their off season just to like,\r\n\r\n\r\nNikolas Hulewsky (08:59.362)\r\nMm-hmm.\r\n\r\n\r\nJas (Winnipeg Digest) (09:11.244)\r\nI guess, keep their workers hired with the winter and stuff like that. So that's why we started to, I was like, okay, there's a gap in the market, right? And then the second thing was we can easily keep getting sponsors, right? For the news that are like, we'll probably charge 10, $15,000 for the full year to an annual sponsor of ours. The downside to that, unfortunately, was that we kind of just go and acquire equity in these companies, right? Like we need to almost...\r\n\r\n\r\nNikolas Hulewsky (09:16.92)\r\ninteresting.\r\n\r\n\r\nJas (Winnipeg Digest) (09:39.79)\r\nprove out the fact that, hey, we can deliver value if we come on as an advertising partner. Right? So I was like, you know what? I'm going to start this business. It will also act as a case study for future partners. Right? So let's say come second business, let's say the portfolio, whether that's landscaping or any other company, right? Then they know that I've done this for my previous company already. So it's a lot easier.\r\n\r\n\r\nNikolas Hulewsky (10:04.664)\r\nJess, this is so good. This is so freaking smart, man. You know what I love about this? Again, we talked for the first time, it had to have been last March, right? February or March.\r\n\r\n\r\nJas (Winnipeg Digest) (10:17.206)\r\nYeah, we started the company last April.\r\n\r\n\r\nNikolas Hulewsky (10:20.922)\r\nOkay, April, like Jazz was, I can't even remember your questions, but like you talked to me and Chris, you decided to get into this, then I talked to you again around December and you would launch this business. But the whole time you've been building in public, you've been like, this is what I'm doing, this is how many subscribers I have, what do you guys think? Like you're bringing people along the journey with you and this now is a perfect use case to build in public because you're go and sell other people and they're gonna be like, well, I don't know, can you actually sell? You're like, that's a great question.\r\n\r\n\r\nJas (Winnipeg Digest) (10:32.077)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (10:50.04)\r\ncheck out this link and it's just all your posts and it's showing very transparently what you did, how much revenue you generated, how many customers you got, what the LTV was, how much it costs to acquire them, et cetera. And it's no extra lift on your part because now you've already done all the work. just do that as that was very smart, my friend. That's awesome. Same put.\r\n\r\n\r\nJas (Winnipeg Digest) (11:03.884)\r\nYeah.\r\n\r\n\r\nNo, thank you. Thank you. Thank you. No, I think, and then also I think when we are looking at it from a larger scale perspective, it's just that we want to compete on different dollar amounts. So for example, let's say if we go and expand to Calgary, I've had thousands of people probably say, okay, Calgary, Toronto, Vancouver, right? Like whether it's, can we use the Digest brand? Can we use your branding? So on and so forth, right? Or do you want to come in as an equity partner?\r\n\r\n\r\nBut don't want to play the game of sponsorships. I don't like the game of just only selling local businesses, especially that have capped out like advertising dollars. So I would rather be in a market where I can go in and I know that, okay, by having this many subscribers, I'm going to make this much money on Christmas lights the following season. Right. So I'm playing a whole different game than someone that's trying to make money on advertising dollars. Right. So when\r\n\r\n\r\nThey're not even competition to me at that point because if they can acquire, they have to acquire a subscriber for a dollar, maybe $1.50 or something for the math to make sense for them. For me on the other hand, I can acquire subscribers for three, four dollars, right, eventually and still make money on them with Christmas lights and other services that I'll just sell, right? So that's why it's just a different model.\r\n\r\n\r\nNikolas Hulewsky (12:14.679)\r\nInteresting.\r\n\r\n\r\nNikolas Hulewsky (12:27.128)\r\nOkay, so tell me, when did you launch the Christmas slice business?\r\n\r\n\r\nJas (Winnipeg Digest) (12:30.547)\r\nWe just launched it like a week ago. No website, no nothing. Just like an ad and the digest.\r\n\r\n\r\nNikolas Hulewsky (12:33.142)\r\nOkay. What did you? Yeah, tell me what you did. How did it launch?\r\n\r\n\r\nJas (Winnipeg Digest) (12:39.726)\r\nYeah, so first thing we did is I had heard LickrMozi say to think Sean about doing like a giveaway of some sorts, right? And doing a giveaway and using the leads that you get from them and just saying, hey, you didn't win the giveaway, but here's $100. You still want to get Christmas lights? So that's what we did. Reached out, got two, I think, got like, I think seven or eight leads from that. Converted.\r\n\r\n\r\nNikolas Hulewsky (13:03.352)\r\nSo wait, wait, wait, wait. First of all, first of all, think so. Sean and Hermosy said, I love that you're on a first name basis. He's talking about Sean Pury and Alex Hermosy. They just did an episode on My First Million where Sean interviewed him. Friggin' Jazz is on a first name basis. Apparently he and Alex Hermosy are thick as thieves. But yes, so he says, this is one of the marketing tactics. Offer a giveaway, even if they don't get the giveaway, you then follow up and say, well, actually, would you be interested? But where did you place that?\r\n\r\n\r\nJas (Winnipeg Digest) (13:14.574)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (13:32.424)\r\nWas it on social media or did you go through your own newsletter?\r\n\r\n\r\nJas (Winnipeg Digest) (13:36.11)\r\nNo, that was just on the newsletter. I said, hey, I'm thinking of starting a Christmas lights company so we can keep this newsletter free for you guys forever. What do you guys think about it? Had about 150 people say, yeah, we would love to do it. And then based on that, the following day I just did like a giveaway. was like, hey, you know what? As a first day, I'm just going to do a giveaway.\r\n\r\n\r\nNikolas Hulewsky (13:38.254)\r\nNikolas Hulewsky (13:45.678)\r\nThat's awesome.\r\n\r\n\r\nNikolas Hulewsky (13:56.654)\r\nWhat a cool use of your social capital, man. That's awesome. Because it wasn't just an ad of like, hey, I do Christmas lights or this company does Christmas lights. It was a personal like, I'm thinking of doing this so that you can still enjoy free content. Man, that is really cool. Wow, that is very freaking smart. All right, so you got 150 people respond and say I'm interested of that. What did that whittle down to?\r\n\r\n\r\nJas (Winnipeg Digest) (13:59.864)\r\nThank you.\r\n\r\n\r\nJas (Winnipeg Digest) (14:22.51)\r\nYeah, so I mean, we actually messed up on that giveaway a little bit where we took too long to then call everybody up, right? So I only was able to hop on calls with like, I don't know, 35 people or something out of which we ended up booking, I think something like 10 consults or something, three counseled, whatever, just figuring things out. And then two ended up booking for about like a job of 12, $1,300 each.\r\n\r\n\r\nNikolas Hulewsky (14:41.358)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (14:51.095)\r\nWow.\r\n\r\n\r\nJas (Winnipeg Digest) (14:52.526)\r\nterrible, right? And then following that, we ended up doing two more ads in the newsletter, where we just said, hey, if you get Christmas lights done before October 7th, with the whole goal of just extending our season a little bit, and getting the extra practice reps then, we'll give you $150 off. So we're just straight to a Calendly link, nothing like that. then so since then, to today, so in about a week, we've sold about $5,000 worth of jobs.\r\n\r\n\r\nNikolas Hulewsky (15:13.006)\r\nHmm.\r\n\r\n\r\nJas (Winnipeg Digest) (15:21.846)\r\nSo three jobs.\r\n\r\n\r\nNikolas Hulewsky (15:23.534)\r\nDang, I forget the newsletter's daily or is it five days a week? Three times a week. So you learned from that first experience, speed to lead, I was like, oh, we should have hopped on these calls a lot sooner. What's the price point? So $150 off of what? A thousand, 5,000, 10,000?\r\n\r\n\r\nJas (Winnipeg Digest) (15:26.766)\r\nIt's three times a week.\r\n\r\n\r\nJas (Winnipeg Digest) (15:32.724)\r\nYeah. Yeah. Yeah.\r\n\r\n\r\nJas (Winnipeg Digest) (15:39.966)\r\nYeah, generally, I mean, I bought a course about Christmas lights before I ever thought of this. was generally for Christmas lights. We're charging anywhere from our minimum is about $800 for going out there, you know, and then it can range usually depending on how if they want trees, don't want trees, anywhere from like a thousand to like 1600 per season. That's a leasing model. It's not we're not selling the lights to them.\r\n\r\n\r\nNikolas Hulewsky (16:04.75)\r\nMm-hmm.\r\n\r\n\r\nJas (Winnipeg Digest) (16:08.142)\r\nreleasing the lights to them. So then the following season they get like a 10-15 % discount, but then if they want the lights then again they're going to come back to us.\r\n\r\n\r\nNikolas Hulewsky (16:14.552)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (16:18.638)\r\nSo you wanna do $100,000 in your first season, I'm assuming.\r\n\r\n\r\nJas (Winnipeg Digest) (16:22.571)\r\nYes, about 80 homes.\r\n\r\n\r\nNikolas Hulewsky (16:24.718)\r\n80 homes and you're at five.\r\n\r\n\r\nJas (Winnipeg Digest) (16:28.78)\r\nYep, which will be done before the season even starts.\r\n\r\n\r\nNikolas Hulewsky (16:33.25)\r\nHow many do you think you'll get natively from your newsletter and how many do you think are gonna have to go through paid ads?\r\n\r\n\r\nJas (Winnipeg Digest) (16:39.342)\r\nFirst, I was focused on building a website and stuff like that, but I don't even think I'm gonna go down that route. I'm probably just gonna do first season without a website, anything like that. Simply based on yard signs, referrals, and the jobs we do. I think we'll get to about 25 to 30 jobs just through the newsletter, and then the rest will be referrals and yard signs.\r\n\r\n\r\nNikolas Hulewsky (16:42.423)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (17:02.262)\r\nInteresting. So in your first week, you've three jobs, three jobs are closed $5,000 in revenue. And you think you'll get to 20 or 25 jobs? Is it just like as it gets closer and there's more reminders, people will pull the trigger?\r\n\r\n\r\nJas (Winnipeg Digest) (17:17.684)\r\nYeah, like right now it's very hot here, know, we're nowhere near Christmas season. Most people start talking about light when it's like October, November, right? So that's another reason why I'm pretty sure that we will get an increase in the amount of people that are wanting leads. I mean wanting the like...\r\n\r\n\r\nNikolas Hulewsky (17:24.131)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (17:38.382)\r\nthat launch. you did the launch your week past the launch. What were you hoping it would be and compared to the three that you sold? Was that like\r\n\r\n\r\nJas (Winnipeg Digest) (17:47.598)\r\nYes and no. I think it was, we understood the fact that this is like very early in the season. Most Christmas lights companies don't even start advertising until mid September or later. Right. So we're way before that first thing first. And so the colder it starts to get outside, the less people want to climb ladders and the more leads we're going to get. So I'm like fairly, so I'm not, there's not a doubt in my mind that we'll get to the a hundred thousand. Right.\r\n\r\n\r\nNikolas Hulewsky (17:59.021)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (18:07.948)\r\nYeah.\r\n\r\n\r\nJas (Winnipeg Digest) (18:17.87)\r\nAnd by no means did I expect that all of that will come from the newsletter. Like I understand that we'll have to probably do other forms of advertising and stuff as well. But I'm pretty sure we'll get to 2530 just from the newsletter.\r\n\r\n\r\nNikolas Hulewsky (18:23.512)\r\nSure.\r\n\r\n\r\nNikolas Hulewsky (18:29.294)\r\nAre you planning on doing any paid through like Metta Facebook?\r\n\r\n\r\nJas (Winnipeg Digest) (18:33.568)\r\nYeah, just depending on how many leads we have. Like I'm just planning on doing everything myself and like with one other person this season, right? Just so then I get hands-on experience following years that I hire it out and so on. So for the first scene, I don't think I'll need to do meta-ads if I do probably like a few thousand.\r\n\r\n\r\nNikolas Hulewsky (18:43.245)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (18:50.562)\r\nDid you, do you take all the calls right now?\r\n\r\n\r\nJas (Winnipeg Digest) (18:54.538)\r\nI do everything.\r\n\r\n\r\nNikolas Hulewsky (18:55.884)\r\nYou do everything. And so you're doing the fulfillment as well. You're getting up on the roof. You're putting the lights up.\r\n\r\n\r\nJas (Winnipeg Digest) (19:00.502)\r\nYep, everything.\r\n\r\n\r\nNikolas Hulewsky (19:02.866)\r\nEverything soup to nuts. How much? I'm curious how much did it cost to get into this? You you did the course you probably bought some materials. I think I saw some of your posts had some Amazon packages delivered to your house.\r\n\r\n\r\nJas (Winnipeg Digest) (19:13.814)\r\nYeah. Yeah, so about give or take, our first order was for 35 ish hundred dollars. Tariffs kind of messed us up on that a little bit, but like $3,500. And then the course I spent another four grand. But I would say well worth it though, just because like the three that even we closed, I think it would have took a lot longer for us to, you know, go through all the mistakes and that sort of thing.\r\n\r\n\r\nNikolas Hulewsky (19:43.16)\r\nSo if you do 80 homes, how many of them are you gonna do yourself?\r\n\r\n\r\nJas (Winnipeg Digest) (19:47.137)\r\nAll of them.\r\n\r\n\r\nNikolas Hulewsky (19:48.354)\r\nYou're doing all of them. No crew like a little crew. Do you don't have like a little assistant?\r\n\r\n\r\nJas (Winnipeg Digest) (19:52.692)\r\nOne person with me, that's it, right? A truck, a ladder, and that's it, you know?\r\n\r\n\r\nNikolas Hulewsky (19:58.606)\r\ndude, I am rooting for you so hard. This is so cool. my gosh, this is so cool.\r\n\r\n\r\nJas (Winnipeg Digest) (20:05.402)\r\nIt'll be interesting. It'll be interesting. I mean, I might be underestimating it, but I don't think so. I think one home a day is not too hard. And then the local news that I have it kind of on autopilot, you know, so I don't need to do too, too much work there.\r\n\r\n\r\nNikolas Hulewsky (20:20.694)\r\nI've always make a joke. The famous last words of any entrepreneur, how hard could it be? How hard could it be? get a ladder, I go on a roof, put up some lights. How hard could it be? I'm excited to talk to you after the season is over. You haven't put up any lights yet though, you've just sold the jobs.\r\n\r\n\r\nJas (Winnipeg Digest) (20:30.744)\r\nYeah.\r\n\r\n\r\nJas (Winnipeg Digest) (20:42.018)\r\nno, no, basically sold the job on Saturday and then we told them that we'll do it first week of September. They're like, I have 40 guests coming tomorrow. It'll be great advertising for you. Can you just put them up tomorrow? Which was yesterday. So we went and did the first job. Yeah.\r\n\r\n\r\nNikolas Hulewsky (20:54.894)\r\nSheesh. Good for you, man. So 3, 5,000, so your average ticket cost is about 1,650. Okay, 1,600. Is that where you think your price point will end up? Higher, lower?\r\n\r\n\r\nJas (Winnipeg Digest) (20:59.042)\r\nYeah, so...\r\n\r\n\r\nJas (Winnipeg Digest) (21:05.016)\r\nSix hundred.\r\n\r\n\r\nJas (Winnipeg Digest) (21:12.812)\r\nI think trees add a lot to it. So if we just do roof lines, which are like the quickest thing to do, if we just do roof lines, then the average order value will be actually lower. So probably like a thousand, 1200 or something. But the tree, any house that gets the trees done, it's going to double our average order value just because those take just as much effort.\r\n\r\n\r\nNikolas Hulewsky (21:29.517)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (21:33.144)\r\nSo Anne McGinty, who I had on the podcast, here's some, you can go listen to her episode, but here's some advice that I'm giving from her now to you. She was like target high net worth rich neighborhoods. Her average jobs were like 10 grand. So she's like much more margin, much more room for us to work. Her marketing was like no digital. She did.\r\n\r\n\r\nJas (Winnipeg Digest) (21:45.526)\r\nYeah. Yeah.\r\n\r\n\r\nJas (Winnipeg Digest) (21:51.127)\r\nwow. Yeah.\r\n\r\n\r\nNikolas Hulewsky (21:59.448)\r\nflyers, she knocked doors, she had like a car parked on the street that had her advertising on it. So I think that that obviously really worked for her word of mouth really worked. So offering, offering people an incentive, this might have been Steve Hunsaker, but it's the same thing. Offering an incentive to anybody who got their house done by you, if they refer anybody, then they get, you know, a percentage off or a gift card. can't remember exactly how they did it. Are you doing any of those things?\r\n\r\n\r\nJas (Winnipeg Digest) (22:25.46)\r\nYeah. Yep. So we're actually going to be doing all of that as well. So now that you mentioned it, I did listen to that podcast. Yeah. So I do remember actually after I listened to yours, I went and went down a rabbit hole and listened to hers as well. Like her own podcast, I think. then, yeah. So I, yeah. So we'll be doing all that. think what Steve says is to go and offer like a hundred dollar\r\n\r\n\r\nNikolas Hulewsky (22:28.13)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (22:33.165)\r\nOkay.\r\n\r\n\r\nJas (Winnipeg Digest) (22:52.814)\r\ngift card to like any steakhouse or something like that here, right? So that's what he does. I think it's a good idea. We're definitely going to be doing that. Yard signs are going to be pretty big. And then once we're done a job, just door knocking like all the whole street beside it. Oh, do you guys know blank, right? So on and so forth. So that's what we'll be doing as well as the season continues.\r\n\r\n\r\nNikolas Hulewsky (23:12.63)\r\nIs the plan, you're gonna do this the first season, get some experience and then hopefully do it again? Because it's seasonal, right? Like it seems like you kind of built in optionality for yourself.\r\n\r\n\r\nJas (Winnipeg Digest) (23:22.582)\r\nYeah, so the idea is that we do this the first season. I do everything the first season. I have like a cousin of mine with me who's just going to be with me on all jobs. Ideally, I can just like get him to, you know, do the more operations part come season two, which I think I should be able to, you know, and then offer him whatever some sort of vested equity or something. And then\r\n\r\n\r\nwith the idea that then I can just handle the marketing and sales and everything come season two.\r\n\r\n\r\nNikolas Hulewsky (23:53.806)\r\nBut if it goes poorly, if it goes poorly, you could also be like, I'm pulling the rip cord. Like we don't need to do this next year.\r\n\r\n\r\nJas (Winnipeg Digest) (23:57.974)\r\nYeah, yeah. Exactly. Yeah, exactly. So if it goes poorly, we don't ever touch it again. What we are doing right now is I'm pretty sure it will go well, right? And then I think we should be able to do permanent light to the summer. So sometimes a lot of the customers or leads are saying, hey, well, we want permanent lights instead. So now we're actually kind of starting to upsell them in permanent lights already. So I'm kind of forcing myself to go start that business.\r\n\r\n\r\nso yeah.\r\n\r\n\r\nNikolas Hulewsky (24:31.834)\r\nWhat are you the most nervous about? Like, what are you looking out for? Obviously, this is a test to see if you can do one of these businesses, right? But you want to do this again with other businesses. So how are you kind of looking at this, finding the signal through the noise?\r\n\r\n\r\nJas (Winnipeg Digest) (24:45.55)\r\nI think marketing is failed. I should be able to crush that. That's not the issue, I think, for us or the constraint by any means. I think the more issue is going to be like executing on the jobs, creating those SOPs as we bring on more people, you know, and just making sure that we're delivering a good product. And honestly, like yesterday was,\r\n\r\n\r\nNikolas Hulewsky (24:50.805)\r\nOkay.\r\n\r\n\r\nJas (Winnipeg Digest) (25:14.27)\r\nYesterday was a great test for that. And it allowed us to see, so this is where we need to work on. But then at the end of the day, the homeowners were really happy. They loved the end product. And that's, you know, that's a that's a big plus point for us as well.\r\n\r\n\r\nNikolas Hulewsky (25:29.006)\r\nYeah, did they pay right then?\r\n\r\n\r\nJas (Winnipeg Digest) (25:31.31)\r\nYeah, so we got, we get, I know most people say 50 % first and then 50 % after the job is done. We got about, we got about 30 % before the job and then we got about 70 % after the job was done.\r\n\r\n\r\nNikolas Hulewsky (25:47.885)\r\nthey pay.\r\n\r\n\r\nJas (Winnipeg Digest) (25:49.964)\r\nYeah, I mean, we have an iPad, jobber, and then some people pay through check, they pay through e-transfer, others pay through credit card. So it's like we take everything.\r\n\r\n\r\nNikolas Hulewsky (26:02.542)\r\nAnd you said this is a leasing model, so basically you're buying the lights, you're putting them on the house, but then do you take them down and store them?\r\n\r\n\r\nJas (Winnipeg Digest) (26:09.678)\r\nYep, so we take them down in January, store them and the following year they're kind of incentivized to obviously go with us again. On average, I think a business like this has about 85 % like year over year repeat rate with their customers. So that's the model that we're also taking. And then if they don't end up, say going with us, we're just going to unscrew all the bulbs that we applied for them and just use it for another job.\r\n\r\n\r\nNikolas Hulewsky (26:33.602)\r\nSo this will be a lot more profitable next year.\r\n\r\n\r\nJas (Winnipeg Digest) (26:36.95)\r\nYep. Yep. Yep.\r\n\r\n\r\nNikolas Hulewsky (26:38.434)\r\nAlthough, although it won't be owner operator. If you have somebody else who's doing the majority of the fulfillment, you'll be paying a team and a crew. So yeah, probably whatever margin you would just gained there is kind of eaten up. That makes sense to me. dude, that's really interesting. What other businesses are on your radar to launch on top of the newsletter?\r\n\r\n\r\nJas (Winnipeg Digest) (26:45.261)\r\nYeah.\r\n\r\n\r\nJas (Winnipeg Digest) (27:00.92)\r\npermanent lights. We have, I am a thousand percent sure we could crush it with that. It's not even a doubt in my mind because anyone that I've talked to Christmas lights about is interested in permanent lights. So basically what we're doing is we're telling everybody, it's the led lights that go under your, like the trim of the house, right? That you can change with like a remote control and things of that nature. Like they're, yeah, they're just year round.\r\n\r\n\r\nNikolas Hulewsky (27:09.166)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (27:15.308)\r\nWhat are permanent lights? I don't know what that is.\r\n\r\n\r\nNikolas Hulewsky (27:27.342)\r\njust like year round.\r\n\r\n\r\nJas (Winnipeg Digest) (27:30.766)\r\nIt's like a strip of lighting, light basically. then, but the average, it's a one-time job, but the average order value is like four to five to X higher than Christmas lights, right? So Christmas lights is over a year, whereas that's just a one-time job. if I might charge a thousand for Christmas lights, I'm going to charge four or five for that.\r\n\r\n\r\nNikolas Hulewsky (27:33.783)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (27:43.022)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (27:51.534)\r\nbecause it's not recurring.\r\n\r\n\r\nJas (Winnipeg Digest) (27:53.578)\r\nIt's not recurring. Yeah. And then I think I'm not sure exactly on how much it costs and stuff. That's something I'll get into come next spring.\r\n\r\n\r\nNikolas Hulewsky (28:00.748)\r\nYeah. How did you decide on lights? Did you survey your newsletter and they said, this is what we would buy from you or like, how did you decide? Yep. This is the best thing to leverage my distribution.\r\n\r\n\r\nJas (Winnipeg Digest) (28:11.938)\r\nFor me, seasonality was the biggest thing. I wanted something seasonal, especially because it snows so heavy here. I wanted something seasonal that if it doesn't work out, I can just get rid of it. And that was one of the biggest factors for me. And for me, was like, OK, if it works, great. If it doesn't, that's OK as well.\r\n\r\n\r\nNikolas Hulewsky (28:22.67)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (28:32.501)\r\nSo seasonality was the biggest factor moving forward. Is it always going to be seasonality or like what's your other buy box criteria or whatever launch box criteria?\r\n\r\n\r\nJas (Winnipeg Digest) (28:43.758)\r\nYeah, I mean, at the end of the day for us, like we know home services will work because 75 % of our readers are homeowners, right? So at the end of the day, we're just using the audience as a marketing platform, right? And technically, like it should work and it's worked for other home services that are current advertisers as well. So a lot of the times because we see into that data, we can exactly see, we're getting this many leads for this client and so on and so forth, right? After this Crystal Light stuff, I can just go to them and say, hey,\r\n\r\n\r\nNikolas Hulewsky (28:51.618)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (29:08.824)\r\nMm. Mm.\r\n\r\n\r\nJas (Winnipeg Digest) (29:14.07)\r\nEither you're going to let us buy into your company or something along those lines, or we will just go with another company and they will be the exclusive advertiser for us. Right? That's kind of the ultimatum that a lot of great advertisers will see eventually.\r\n\r\n\r\nNikolas Hulewsky (29:23.437)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (29:30.254)\r\nDude, I'm really excited to follow along because like I said, you spoke the newsletter into an exit into existence, which is amazing to see you crush it. I think you're gonna do the same thing with the Christmas lights business. I don't know if you'll do it again next year. Maybe you'll hate actually doing all of the fulfillment, but I'm just excited.\r\n\r\n\r\nJas (Winnipeg Digest) (29:46.902)\r\nMaybe I think it's an exciting, I think it's definitely exciting, right? Like if it ends up working out, then I'm going to try and replicate it in other industries like landscaping and whatever and so on and forth. But if it doesn't, that's totally fine too. We never talk about it again and we just go and start it. Yeah.\r\n\r\n\r\nNikolas Hulewsky (29:58.83)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (30:08.43)\r\nThat's true. That's true. That's true. We never talk about it again. Where's the best place for people to come find you?\r\n\r\n\r\nJas (Winnipeg Digest) (30:14.326)\r\nYeah, so people can reach me at Twitter, creatingJaws is kind of the username there, so they can find me there.\r\n\r\n\r\nNikolas Hulewsky (30:20.622)\r\nOkay, that's awesome. I'm gonna check back in with you at the end of the season. You're gonna tell me how it went or we'll never talk about this again. It's one of two options. All right, man. Good luck.\r\n\r\n\r\nJas (Winnipeg Digest) (30:21.934)\r\nAll right.\r\n\r\n\r\nJas (Winnipeg Digest) (30:28.118)\r\nAmazing. Yeah, perfect. Thank you, brother.",
  "metadata": {
    "duration": "",
    "date": "2025-09-05",
    "platform_source": "Google Drive"
  }
}