{
  "episode_number": "115",
  "episode_title": "TOP PICK! The Easiest Way to Make Money with AI (No Code) with Chris Koerner",
  "guest_name": "Chris Koerner",
  "business_name": "",
  "transcript": "﻿Nikolas Hulewsky (41:47.262)\r\nYeah. So my first favorite business is, are you ready?\r\n\r\n\r\nChris Koerner (41:54.232)\r\nReal quick, we're at 42 minutes, so should we try to plan strategically around this?\r\n\r\n\r\nNikolas Hulewsky (42:02.728)\r\nWhat do you wanna do?\r\n\r\n\r\nChris Koerner (42:05.122)\r\nI don't know, we could not have an AI idea in that first episode and then just talk about them in the second episode.\r\n\r\n\r\nNikolas Hulewsky (42:12.286)\r\nWell, we could have that. So the beginning part and then like the pre like my part about AI sort of be a pretext for episodes coming up. I don't like how we both talked a lot.\r\n\r\n\r\nChris Koerner (42:25.784)\r\nWhat do mean?\r\n\r\n\r\nNikolas Hulewsky (42:26.996)\r\nI just feel like we didn't have a lot of, like you spent a lot of time talking about Frank and setting that up, right? And then I spent a lot of time talking about AI and setting that up. So there was a lot of monologuing for both of us. So I wonder if we could do something in the second half and then tell Mohammed to like edit segments in, I don't know.\r\n\r\n\r\nChris Koerner (42:33.166)\r\nhuh.\r\n\r\n\r\nChris Koerner (42:38.851)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (42:48.364)\r\nI don't know, we could just keep talking and figure it out after.\r\n\r\n\r\nChris Koerner (42:57.006)\r\nI mean, we could make the marketing one like a 30 minute episode and just do marketing and then lead into this. But yeah, but that was just mostly me speaking.\r\n\r\n\r\nNikolas Hulewsky (43:09.182)\r\nSo I have an idea today that would be a perfect idea to add on to the marketing that I could just, we could pretend like that's part of it and add it to that.\r\n\r\n\r\nChris Koerner (43:17.964)\r\nWell, another thing we could do and I, I tried this with James camp where it wasn't, there was no strategy to be a two part, but we just kept going and it was really good. So I just cut it off. Freakings, Hey, art too, in two days. And both of those have done really well. So we could just cut it off whenever the freak we want mid sentence for all we care and just say part two next week. You know, it's just, it's just a hook, you know, it's like a TV series where you want to know if that guy dies or not.\r\n\r\n\r\nNikolas Hulewsky (43:27.604)\r\nYeah. Okay.\r\n\r\n\r\nNikolas Hulewsky (43:42.857)\r\nHow do you?\r\n\r\n\r\nI've loved this conversation. I think it's been freaking fun, but how do you feel about it?\r\n\r\n\r\nChris Koerner (43:48.28)\r\nYeah.\r\n\r\n\r\nIt's like you're in bed with your wife. Was this good for you? Was it good for you? Yeah, all 13 seconds of it was great. Let's just let's just keep talking.\r\n\r\n\r\nNikolas Hulewsky (43:56.5)\r\nBanana.\r\n\r\n\r\nHa\r\n\r\n\r\nNikolas Hulewsky (44:03.484)\r\nOkay. So, all right. So that was all the pretext. I know that was a long preamble, but we're going to be talking about AI businesses more and more. And I just wanted to kind of set the context for why we find it interesting and why we're going to continue to talk about it.\r\n\r\n\r\nChris Koerner (44:06.273)\r\nYou were about to tell me your idea.\r\n\r\n\r\nChris Koerner (44:18.658)\r\nWell, and I pulled my newsletter. I asked them, I gave them five industries, home services, local business, had AI software. Everyone wants to hear about AI anyway. So just zooming out real quick, you've seen the memes on Twitter, like Charlie lights, like he'll like screenshot someone's biography on LinkedIn. And it's like, he was a SaaS bro. Then he was a crypto bro. Then he was an expert in NFTs. Then he was an expert in ICLs. Now he's an expert in AI. And it's like, we just hop from trend to trend.\r\n\r\n\r\nNikolas Hulewsky (44:43.484)\r\nYeah.\r\n\r\n\r\nChris Koerner (44:48.622)\r\nBut I don't know. I just feel like this time it's different. is different. Like it's just, it is changing the world like I've never seen. And how do you, how do you, how do you close your eyes? like, no, I don't want to talk about it cause it's the new trend and I want to buck the new trend, talk about home services. Like, no, it's incredible. And we're going to talk.\r\n\r\n\r\nNikolas Hulewsky (44:57.406)\r\nYeah, I don't think, I mean, yes, I do.\r\n\r\n\r\nNikolas Hulewsky (45:03.081)\r\nMEOW\r\n\r\n\r\nNikolas Hulewsky (45:08.244)\r\nOkay, so this idea is a long-term, this isn't a cigarette butt idea, this is a long-term idea. And I'm stealing it from your episode with James Camp, because I freaking loved it. Detox centers. And I'm using detox very broadly. I'm not just talking about drugs, alcohol, but dude, and the thing you guys didn't talk about, pornography. That's a, were you?\r\n\r\n\r\nChris Koerner (45:25.601)\r\nEmily.\r\n\r\n\r\nChris Koerner (45:31.5)\r\nI was gonna bring that up today too! That's crazy! Yeah, I got stuff for this.\r\n\r\n\r\nNikolas Hulewsky (45:35.732)\r\nOkay, like, yes, there's gambling. Yes, people are addicted to their phones and dopamine, but like with young men in particular, pornography is a really big deal. And I think in the same way that when we grew up in the nineties and everything was microwaved and we had fruit roll-ups and there's, know, yellow five and red dice 16 in our foods. Now we're like, hey, we got to go organic. I can't believe my parents fed me this, all this stuff. I think our kids are going to be like very strict with what.\r\n\r\n\r\ndevices they allow in the house, what you're able to watch, how it's streamed, protections that are involved, et cetera. And addictions are very difficult. Pornography addiction is a very real addiction. Having these retreats or centers or things focused around not the drugs, not the alcohol, but addiction centers for digital addictions. I know that sounds so stupid. And anybody listening might think, digital addictions aren't a real thing. They're a real thing.\r\n\r\n\r\nI scrolling on Instagram, scrolling on TikTok, they're real things. And so I think that idea is a very interesting one.\r\n\r\n\r\nChris Koerner (46:35.918)\r\nI completely agree. And I will say like the difference between how the public perceives pornography today versus five years ago. I would say like any millennial anyone today age, call it 25 to 45. They grew up with pornography accessible in the house. If nothing else from like the family computer, okay. So I would I would reckon that over 90 % of millennials in some form or fashion have had\r\n\r\n\r\nyou know, a lot of crossover with pornography in their life. But the difference today is it's becoming more generally acceptable that pornography is bad. Like for physical reasons, mental reasons, spiritual relationship, you name it. Five years ago, it's nothing wrong with this. Like everyone looks at it. Everyone, they're not even struggling with it because there's nothing wrong with it. Right. But today there's more data, there's more studies and it's like, okay, yeah, maybe this isn't, maybe there is a\r\n\r\n\r\nNikolas Hulewsky (47:17.022)\r\nrelationship reasons.\r\n\r\n\r\nChris Koerner (47:32.876)\r\nMaybe there is a trade off to this. Maybe there is something bad about this because if we launched this business five years ago, it's probably too early, right?\r\n\r\n\r\nNikolas Hulewsky (47:40.276)\r\nWell, have you seen the studies? mean, testosterone in men today versus men in the 1950s. Like 60 year old men in the 1950s had a higher testosterone level than 20 year old men today. That's craziness. You look at studies with loneliness in particular in young men and when it's just easier for them to open a computer and scroll and be distracted than to go on a date with a woman or to meet people out in public.\r\n\r\n\r\nChris Koerner (47:51.202)\r\nYeah, yeah, that's a fact.\r\n\r\n\r\nNikolas Hulewsky (48:07.06)\r\nIt's a massive problem, epidemic of loneliness, depression, suicide, all of those things. And I think that they're linked to digital media. anyways, as I was like listening to your James Camp episode, I couldn't believe you guys didn't bring it up. was like waiting for you to mention it, but yeah, gambling, sure. But the phone, putting your phone away and like having these retreats where it's just off and you are able to engage with people and you have these meaningful interactions.\r\n\r\n\r\nChris Koerner (48:29.55)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (48:35.752)\r\nfacilitating those, having a business that facilitates those would be amazing.\r\n\r\n\r\nChris Koerner (48:40.28)\r\nYou know what's interesting is last summer, both my two oldest, boy and girl, went to summer camps for church. And I chaperoned both of them. And both of them had the same rule. And I wasn't in charge, I was just chaperoning. No phones. Like literally, they put their phones in like a Yeti cooler and they lock it in the leader's tent for the entire time. Okay, so I got to witness this on the girls and on the boys side. And we're out in nature the whole time. Zero, zero complaints.\r\n\r\n\r\nfrom both weeks from one person, not even one person complained that they didn't have their phone. No one was bored. They had an amazing time. Not one person was like, I missed my, I got to play Candy Crush. my, what are my friends doing? They just, they were fine. They're good. Right? Like we crave that. it's, is, you know, I leave my home, my phone at home sometimes on accident and my first gut reactions, like dang it, my phone. And then it's like, this is nice.\r\n\r\n\r\nNikolas Hulewsky (49:27.924)\r\nTotally. Yeah.\r\n\r\n\r\nNikolas Hulewsky (49:40.308)\r\nYeah, I mean, in many ways, it's been helpful because people have Apple watches and they get notifications or they've got their computers like they're constantly, ding, ding, ding, notifications happening. I think, have you heard of these things called, what are they called, Faraday cages? Where essentially the Faraday cage will block, I think the term is electromagnetic waves. And that's how phone signals are transmitted is through electromagnetic waves.\r\n\r\n\r\nChris Koerner (49:56.974)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (50:10.042)\r\nAnd so you like you literally can't even get a message even if you wanted it. So some people put them put their phones in bags when they go to sleep. Some people put you have a basket at the front of their house. But I think selling those types of things where it's like limiting your access. James has a brick on his phone where like literally he can't even get messages. You have a setup on your phone. I remember where were we? were in we were in Texas and we were like getting in and out. And I was like, dude, I want to see your tweet really quick. And you're like.\r\n\r\n\r\nChris Koerner (50:32.098)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (50:39.246)\r\nYeah, I can't. like, what do mean you can't? I have Opal set up where between like four and six, I don't remember what the time is, four and six, I don't have access to Twitter. And I'm like, I know, but it's really important. Couldn't you just go and like change the settings really quick? And you're like, no, I can't even change the settings until after that window is closed anyways. So like, we're not seeing it for the next two hours. So anyways, I think those types of demand are growing and\r\n\r\n\r\nChris Koerner (50:42.094)\r\nLike this is awkward. I'm sorry.\r\n\r\n\r\nNikolas Hulewsky (51:07.186)\r\nstarting a business around facilitating real experiences would be incredible.\r\n\r\n\r\nChris Koerner (51:10.444)\r\nYeah. Did you know what's crazy to me is so my oldest 14 and a half. He has a phone. He got a phone for his 14th birthday. First time he has all kinds of screen time restrictions set up. I can manage that from my phone. Brawl Stars is his favorite game. He can play there for half an hour a day. He has a ton of access to ESPN because he loves sports. I asked him just yesterday, just yesterday and we live in a nice affluent area, caring parents. They're all involved in their kids lives. I said, how many of your friends?\r\n\r\n\r\nhave screen time restrictions on their phones. Like they all have phones sure. Any sort of restriction? Zero. None of them. None of them. Yeah, like at church, it's pretty common at our church. But like most of his friends are not in our church. Zero restrictions, which is just crazy to me. Crazy.\r\n\r\n\r\nNikolas Hulewsky (51:46.878)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (51:59.038)\r\nThat is really crazy to me.\r\n\r\n\r\nChris Koerner (52:01.196)\r\nLike it. Yeah. Like Apple, Apple made that a feature for a reason, right? And I'm shocked that more, mean, tiny little sample size here. I'm just shocked that more people don't use it for their kids.\r\n\r\n\r\nNikolas Hulewsky (52:12.53)\r\nWell, one of the things that's interesting is, and maybe there could be a business developed around this. Have you ever got, I am terrible about missing meetings. That's just like a natural Nickism and it's gotten way worse ever since I started putting my phone on, do not disturb. And I started putting my phone on, do not disturb because I just kept getting notification after notification, after notification, after text, after call, after it was just like, all I have to be able to focus and this phone is distracting me. So I put it in, do not disturb.\r\n\r\n\r\nAnd then you and I have had conversations and you're like, you're not available. Finally got to the point this last week where I decided I got to figure out how to at least let some notifications through, et So you can set it where it's like, all right, from this app, I can get these notifications from this person. I think you could do that in these retreats. And maybe that's your software where it's like, before you go, here are the three people that my phone is allowed to be notified of. And,\r\n\r\n\r\nand the phones are kept somewhere with an employee who's monitoring them. And then when they get to the camp, they're doing their thing. And if, bling, one of the three people on their emergency contact list pops up, then they immediately get notified in the camp, right? Because there is that fear of like, what happens if my son is sick or my wife gets injured or whatever, there's an emergency. I don't know that there are one-offs that you can do in Apple. Maybe there are, but I think that would be a really cool way upfront to just like have a questionnaire. They fill it out.\r\n\r\n\r\nthen the software does it for you and it creates it because that would make it really easy and accessible.\r\n\r\n\r\nChris Koerner (53:41.454)\r\nMm.\r\n\r\n\r\nChris Koerner (53:48.044)\r\nYeah, like, I think it should be a retreat where it's like no phones, right? That's the whole point. But then at the end of it, it's like, okay, you're clearly going to go back to having phones. Let's talk about some healthy principles. Like, here's how to use your iPhone settings. You know I'm saying? Because it's like, it's unrealistic to say you're not going to go back to a phone. Here's how to manage it better. Because most people don't know and we're not incentivized to learn how to turn off notifications because we want the dopamine.\r\n\r\n\r\nNikolas Hulewsky (53:59.604)\r\nMmm!\r\n\r\n\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (54:12.34)\r\nWell, we went to the moon in 1967, whatever the year was. 1969, it was the summer of 69, as some would say. I got my mouse real six. Anyways, we have more compute power in our pockets than was on the craft that guided them to the moon. Right. And we use it 99 % of the time for scrolling entertainment apps.\r\n\r\n\r\nChris Koerner (54:16.366)\r\n69.\r\n\r\n\r\nChris Koerner (54:21.848)\r\nJFK got shot.\r\n\r\n\r\nChris Koerner (54:35.309)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (54:42.072)\r\nSo I love your idea. like, you could totally tailor this thing so that it works well for you. That could be a business in and of itself. That might be a really cool AI info product, right? It's like, hey, Chris, wow, we iterated to this. I'm actually really excited about this because this wasn't even on my radar. The info product that you sell is teaching people how to limit their screen usage by giving them knowledge on where to go in their existing settings.\r\n\r\n\r\nand change them. Does that make sense? Where it's like the course you sell is this digital product teaching them how to limit their access on screen time.\r\n\r\n\r\nChris Koerner (55:11.502)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (55:16.716)\r\nYeah, or the AI chat bot buddy that you sell, right? The prompt that you sell, right? And then all the haters in the common, you can't build a business around a prompt. There are already thousands and they're doing great. You absolutely.\r\n\r\n\r\nNikolas Hulewsky (55:20.51)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (55:30.078)\r\nThey're doing amazing. Well, dude, I remember we were talking about this and you were like, just you could do set up chat GPT to be a phone number in your phone and you can text with them. Chat GPT just released these things called tasks. Where you can set it up to remind you to go do things, whatever you could literally have, you could sell a course showing people how to set up on their phones anytime that they accessed an app to get a text from chat GPT. Hey, just want to remind you.\r\n\r\n\r\nChris Koerner (55:40.814)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (55:59.368)\r\nyou're trying to limit screen time today. No judgment. Just wanted to make sure you knew that this was the third time that you've done this in the last hour. You know what I mean? Like it can go anywhere from my wife, which is like, what the freak are you doing? This is the third time you've used this in an hour to like, you know, Mahatma Gandhi. Hey, no judgment. I get it. You can do this if you want, but it's been three times. You know what I mean? Like you can totally tailor the spectrum of, of how hard it's going to be. That would be a freaking cool info product.\r\n\r\n\r\nChris Koerner (56:03.992)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (56:07.501)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (56:27.662)\r\nYeah. Do you mean an actual info product or like a, a, a rapper, like an AI rapper.\r\n\r\n\r\nNikolas Hulewsky (56:34.388)\r\nYou could do the wrapper. could totally do the wrapper. I'm just saying start with an info product. Hey, do you want to know how to do this? This will, if you want to know how to do this, dude, oh my gosh, sorry, my mind is going right now. All you're doing, you're selling a prompt. Hey, do you want to do this? Yeah, I want to do this. Show me how to customize my iPhone so that I don't do X, Y, and Z. Cool. Pay me 20 bucks. Here's 20 bucks. Cool. Here's the prompt. Put that into chat GPT. It'll walk you through step by step.\r\n\r\n\r\nChris Koerner (57:04.354)\r\nYeah, dude, so I did research for this for selling prompts. There's a website called prompt base.com where you can buy and sell prompts. yeah, it's, and you're literally just buying the text, the prompt.\r\n\r\n\r\nNikolas Hulewsky (57:05.086)\r\nThat's it.\r\n\r\n\r\nNikolas Hulewsky (57:14.451)\r\nNo way.\r\n\r\n\r\nChris Koerner (57:20.906)\r\nAnd this is a pretty big business.\r\n\r\n\r\nNikolas Hulewsky (57:23.006)\r\nHoly balls!\r\n\r\n\r\nChris Koerner (57:27.074)\r\nLike look at these mid journey prompts on the homepage. Four to eight dollars each.\r\n\r\n\r\nNikolas Hulewsky (57:27.121)\r\nDude!\r\n\r\n\r\nYeah, tons of of art, tons of art, abstract paintings. That's freaking incredible.\r\n\r\n\r\nChris Koerner (57:36.846)\r\nThere's so many levels to this like, okay, I could go buy this intricate nights celestial prompt on mid journey for $3.99. I pay $4 for that once and then I take it over to Etsy and I could sell prints using that exact prompt like downloadable prints, prints using that exact prompt for $4 each $4 once sell them for $4 each like\r\n\r\n\r\nNikolas Hulewsky (57:59.408)\r\nmy gosh. Dude, just clicked on productivity. Personal financial advisor for my budget. there's a student, it's a very long, thorough prompt. It gives examples. It tells you exactly what information it needs you to enter in, in order for the prompts to return the right type of advice. It's four bucks. They're selling it for four bucks.\r\n\r\n\r\nChris Koerner (58:07.65)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (58:14.146)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (58:21.166)\r\nSo let me, let me take it a step further, Nick. Take that $4 prompt, buy it, and then go to Replet and then use that prompt to make a chat bot and then go to cursor.ai and then use that, turn that chat bot into an iPhone app and then go to the Apple app store and sell it for 4.99 or 2.99 a month. Like you literally, you buy a $4 prompt.\r\n\r\n\r\nYou use free tools or tools that cost $20 a month like Replet to turn it into an app, turn it into an iPhone app. Now you have a SaaS company. Like what are we doing? What are we talking about here?\r\n\r\n\r\nNikolas Hulewsky (58:57.652)\r\nThis is insane. I've never been on the site. Okay, there's a section for marketing and real estate. Here's a prompt for five bucks. Real estate listing description generator. And so it prompts you, it tells you all the things that you need to enter into it. There's a script written and then it will spit out a really high value description.\r\n\r\n\r\nChris Koerner (59:23.257)\r\nMm-hmm. You could turn that into an app or a software product.\r\n\r\n\r\nNikolas Hulewsky (59:24.34)\r\nThere's there's a higher a prompt engineer prompt.\r\n\r\n\r\nChris Koerner (59:31.598)\r\nYeah. How many 63 year old real estate agents named Carol in Omaha, Nebraska know anything about Chad GPT? But how many of them would pay $5 for an iPhone app that uses that $5 prompt?\r\n\r\n\r\nNikolas Hulewsky (59:43.56)\r\nReal estate property evaluator prompt. Real estate agent Bob prompt. Real estate, my gosh, how to make money in real estate prompt. This is insane.\r\n\r\n\r\nChris Koerner (59:58.574)\r\nI don't know, how can we not talk about this stuff?\r\n\r\n\r\nNikolas Hulewsky (01:00:01.81)\r\nWell, dude, we've talked about this. It's the prompt. The prompt is the thing that most people get hung up on because they're like, how do I make money? They don't know the right question to ask. You would now have a database of questions that people ask that you can then start interfacing with with ChachiBT to do.\r\n\r\n\r\nChris Koerner (01:00:11.832)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:00:19.404)\r\nYou know what it reminds me of? It reminds me of like Google 20 years ago. You work for Google, you learn like from the inside out how SEO works, and then you go, then you go launch a company. You get accepted to Y Combinator, you know, built on SEO because you learn those principles from the inside of Google, right? Imagine people working for open AI, really learning how prompts work and using that to leverage in their own businesses. Cause like Google was all about, okay, SEO is a black box.\r\n\r\n\r\nThere are backlinks, there are on-page SEO, off-page SEO. how do you figure this out? And you build entire industries, not businesses, but industries around SEO. Maybe a website built on SEO, maybe an SEO agency where you do it for other people. It's the same thing, but prompts are the, at OpenAI are what SEO is for Google.\r\n\r\n\r\nNikolas Hulewsky (01:01:09.844)\r\nThat's a very interesting analogy.\r\n\r\n\r\nChris Koerner (01:01:13.446)\r\nSEO is like how a website talks to the internet. Prompts are like how you talk to AI.\r\n\r\n\r\nNikolas Hulewsky (01:01:20.882)\r\nWell, again, we both talked to James Camp. He's about our age. He's a little bit younger and he started doing SEO as a teenager. He just got interested. He was curious. And then he talked about the series of events that happened that led him kind of to where he is. And all of that started just because he was curious. And he kept following that curiosity and he kept getting better and better. And he picked an industry.\r\n\r\n\r\nthat was growing like crazy. You said this several times, the tide lifts all boats. He was riding the right wave. And I think the reason I wanted to keep talking about AI in these episodes is because it forces us to continue to look at it and get more ideas and understand what is coming. Because if you can start messing around with this now, I promise you we are still super early. You're gonna see many, many opportunities. That's why many of the founding members of OpenAI are gone.\r\n\r\n\r\nChris Koerner (01:01:54.104)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:02:16.628)\r\nbecause they went to start their own companies. They saw other opportunities that they could go and do. It isn't necessarily because Sam Altman is the devil, although they may have disagreements with them. It's because, man, my financial opportunity is way better because I'm seeing these opportunities having worked inside the machine.\r\n\r\n\r\nChris Koerner (01:02:31.246)\r\nMm I feel like I just I need to give like 60 seconds to my brain to just continue processing all this. There's a lot going on.\r\n\r\n\r\nNikolas Hulewsky (01:02:42.9)\r\nThis is an amazing sight.\r\n\r\n\r\nChris Koerner (01:02:43.106)\r\nSo I haven't, I want a site like this is my AI, like this is my long-term AI idea for today. Okay. And then I'll give you a dumb little kitschy one after that. Where's the prompt base for turning prompts into SaaS products. I don't know of a website doing that. And I did my research. like Replet can help you code. Cursor can help you code apps, but like I want\r\n\r\n\r\nto build my own app that's like built on a prompt, but it's a chat bot, it's an LLM, but I only wanna do it in a few clicks, because I'm just a dumb internet marketer, I'm not a coder. How can I actually take a prompt that I buy for $4 from prompt base and turn it into a $4 a month SaaS product with a few clicks? I don't know if that exists yet, it's going to.\r\n\r\n\r\nNikolas Hulewsky (01:03:36.86)\r\nIt exists, but not with a few clicks because what's happening right.\r\n\r\n\r\nChris Koerner (01:03:41.036)\r\nYeah, you could do it with replet cursor with all those.\r\n\r\n\r\nNikolas Hulewsky (01:03:44.402)\r\nYou can even do it with ChatTPT where you're like, hey, how would I create?\r\n\r\n\r\nOkay, I'll just say one. How do I create my own calendar system? I don't wanna use TidyCal and I don't wanna use Calendly. How can I create my own app that I can send to people, they can look at my calendar and they can schedule? And you can start that process with OpenAI, or ChatGPT and it'll tell you, okay, well, you'll need to do this and you'll need to get this API key and you'll need to then code this. Okay, how do I code that? I've never coded that before. Give me a step-by-step process, right? It's very iterative.\r\n\r\n\r\nChris Koerner (01:03:58.894)\r\nchannel.\r\n\r\n\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nChris Koerner (01:04:11.896)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:04:19.368)\r\nbecause it's waiting on the question from you so that it can answer the question that you give it. But I think what you're saying is, how do I give it a general idea and overview of, I want to build my own Calendly and then just have it execute on that? Is that what you're saying?\r\n\r\n\r\nChris Koerner (01:04:22.766)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:04:32.931)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:04:36.462)\r\nMm hmm. Yeah. Like in a, in a box, like a LLM SaaS product in a box. And the lot, the last step of the, of the process is like submit to the app store for approval even, you know, like tip to tail.\r\n\r\n\r\nNikolas Hulewsky (01:04:50.748)\r\nSo, it would be like, hey, I don't like Calendly or Tidy Cal. I want to create my own. Help me do that. And then it asks you a question. Okay, what future would you like? Would you like this? This is how these work. Okay.\r\n\r\n\r\nChris Koerner (01:05:01.078)\r\nAll right. Give me your Zapier API credentials. Give me this. Give me that.\r\n\r\n\r\nNikolas Hulewsky (01:05:04.82)\r\nMm hmm. After and then after 30 minutes of it asking you the questions, it goes, cool, I know what you want. Here you go. And then you test it and then you would say, all right, submit this to the app store for approval.\r\n\r\n\r\nChris Koerner (01:05:17.442)\r\nYeah. And maybe this is just what replant will look like in six months. Right? Maybe that's just where we're going, but I feel like it could be simplified even more. That's just a good framework. Like everything can be simplified even more. There's always a business to make something a little bit easier. I saw this Instagram reel of a, you got the motor motocross bikes. How do you get it the back of the truck? You put like a two by six as a ramp leaned up against the trucks. You get it up there. Then you get straps.\r\n\r\n\r\nYou strap down the handlebars, you strap it, you got it like, cause it can't be tilted. You gotta, yeah. So there's this new product that's just like this metal bar that sits in your truck and you put your motocross bike in there and you just attach it to the handlebars and they're selling millions of these things. And this isn't anything new. can, we can use straps, but it's just, it's like 10 % easier than straps. $10 million product, right? Like there's just as a framework, making something a little bit simpler or easier or less friction.\r\n\r\n\r\nwill always be a good business opportunity.\r\n\r\n\r\nNikolas Hulewsky (01:06:17.908)\r\nChris, are you ready for this? I didn't talk to you about this. You don't know, you have no idea what's about to hit you, my friend. I have an announcement to make. I declare bankruptcy. No, I'm just kidding. Dude, we have probably 5,000 downloads in our first week, three to five. I can't remember exactly where we are. If you include YouTube, it's more than that. I want to see every week and we could pick.\r\n\r\n\r\nChris Koerner (01:06:20.334)\r\nLet's do it.\r\n\r\n\r\nChris Koerner (01:06:27.617)\r\nshoot.\r\n\r\n\r\nNikolas Hulewsky (01:06:46.448)\r\nAI Rapper of the Week. If there's somebody who creates something really cool, send it to us. I would love to see what people are creating.\r\n\r\n\r\nChris Koerner (01:06:53.878)\r\nSomeone asked me the other day, what is a rapper? So explain to everyone what a rapper is. You couldn't.\r\n\r\n\r\nNikolas Hulewsky (01:06:57.31)\r\nHey, let me set you up.\r\n\r\n\r\nNikolas Hulewsky (01:07:03.838)\r\ncouldn't do it. I feel like I've been talking a lot. want you to explain the rapper.\r\n\r\n\r\nChris Koerner (01:07:08.428)\r\nOkay. It wrapper slash white label is basically the same thing. You're taking something that's complex and expensive and harder to build. Maybe VC funded like open AI and you're just putting something on top. You're just a middleman. It's like a technical middleman for something. So for instance, here's a wrapper idea. I want, I want to sell an app in the app store that helps sourdough bread bakers bake better bread. Okay. That is just going to be a chat GPT wrapper. It's going to be a prompt.\r\n\r\n\r\nbut it's going to be like, we're like Christmas wrapper, right? We're wrapping it in better branding and more positioning and marketing, yada, yada, yada.\r\n\r\n\r\nNikolas Hulewsky (01:07:46.298)\r\nThe only thing I would say to add onto that is I think we're using wrapper very broadly because I would also apply wrapper to… OpenAI just released ChatGPT tasks. So what you can do is you can schedule tasks. And here's a very simple example of a task. Hey, I create my food calendar every month where I plan out what my food's going to be. I want to make sure that I have six meals with fish.\r\n\r\n\r\nsix meals with chicken and six meals with steak. And then you give it like all the parameters. On the 25th of every month, I want you to send me suggestions with ingredients, lists, and what I need to buy at the store because that's when I go to Costco. And so you set that up once and it just reminds you on the 25th of every month moving forward. And you don't ever have to think about it again. You don't have to sit down and be like, okay, what am going to cook next month? What ingredients do I need? It's just like giving it to you and it saves maybe 30 minutes or an hour of your time, right?\r\n\r\n\r\nChris Koerner (01:08:31.587)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:08:45.672)\r\nThat's an example of a task. If there's somebody out there who's like, dude, I'm a trader and I've set a task so that every morning at 6 a.m. when the market opens, I know what the opening price is of Apple and it's saved me X period of time and I've made money by day trading doing this. I would consider that still a wrapper, right? You're using AI as a tool.\r\n\r\n\r\nChris Koerner (01:08:45.699)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:09:07.03)\r\nYeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (01:09:09.896)\r\nIf there's anybody out there who's listening has been playing around with this stuff and they're like, dude, I've been using it for business applications and I've made money in this way. That's what I want to know about. How have you been using AI to make money? Not necessarily just like a cool chat interface, but how have you created something systematized it within your business that you're currently making money with and then featuring those or within your life? Yeah, I just think featuring those would be so interesting because it's going to give us ideas. We're going be like, wow, I didn't even think you could do something like that.\r\n\r\n\r\nChris Koerner (01:09:21.709)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:09:28.076)\r\nor within your life, literally even as a side hustle.\r\n\r\n\r\nNikolas Hulewsky (01:09:37.97)\r\nAnd going to give people who are listening ideas like we're just sharing the best ideas that people are using to create these rappers. And yeah, that's that's my ask this week. Like just start sending us some of your ideas. Send them to. AI at cofounders.com, because I don't want all those emails.\r\n\r\n\r\nChris Koerner (01:09:56.716)\r\nYeah. And it's like, on one hand, it's like, these rappers are cheap. There's no value. There's no inherent value. But dude, like I did a podcast that's last week about this guy on Etsy that sells $8 personal finance spreadsheets. He sells like a hundred a day for $8 or something like that. He makes a lot of money selling an $8 spreadsheet over and over and over fully automated, literally passive, right? It's like you and I could make a personal finance spreadsheet. We know how to do that.\r\n\r\n\r\nBut we might just would rather pay $8 for someone else's because it might have different features, right? So like a sourdough app. I talked in a previous episode how I use Chad GPT to make better sourdough bread. So surface level is like, I'm not a customer for an app like that because I know all about Chad GPT. I know how to use it. But then it's like, you know what? I don't want to fiddle with the prompt and I don't want to, I just want it to work. So if I can pay $5 for it to just work. Yeah. I don't need to sell this to 63 year old Carol in Omaha. I can sell this to 38 year old Chris who loves Chad GPT and just wants to save a little time.\r\n\r\n\r\nRight. These wrappers are not going anywhere.\r\n\r\n\r\nNikolas Hulewsky (01:10:52.702)\r\nYeah, a very stupid, a very stupid, simple example of this would be you and I do our editing for our podcast and we've created very specific prompts now that we use. Hey, go through this episode and pull me five quotes that blah, blah, know, and we sort of listed out. You could sell that if we wanted to. It is a business, you know what I mean? But there are these things that we have used with AI that do help us make money. I would love to hear how other people are using it to help them make money. Like it doesn't even have to be agents.\r\n\r\n\r\nChris Koerner (01:11:06.754)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:11:10.638)\r\nThat's a business, yeah.\r\n\r\n\r\nNikolas Hulewsky (01:11:22.712)\r\nwell, I've got this agent going out and scraping and they're going to bring it back and clean it. Okay, that might be just too high level, but what are you doing just simply on a day-to-day basis that's making money with your business?\r\n\r\n\r\nChris Koerner (01:11:30.348)\r\nYeah. Yeah. How like, like the GPT for sheets we talked about, how are you using GPT for sheets and whatever data you're looking at to help your life be better. You want to hear about it.\r\n\r\n\r\nNikolas Hulewsky (01:11:35.337)\r\nDude!\r\n\r\n\r\nRight.\r\n\r\n\r\nTotally. I really want to hear about that. We need to stand up this email. What should we call it? What should the email be? Because I don't want to get all these to our personal emails.\r\n\r\n\r\nAI.\r\n\r\n\r\nChris Koerner (01:11:54.402)\r\nEvery time I give out my personal email on podcasts, not a lot of people email me, so I don't really care.\r\n\r\n\r\nNikolas Hulewsky (01:12:01.524)\r\nOkay. All right, nevermind. Chris or Nick at cofounders.com, either one of those. How's that for vulnerable? Or both of us. We could just have Kelly go in and categorize them, easily add them to a folder.\r\n\r\n\r\nChris Koerner (01:12:04.846)\r\nHow's that for vulnerable?\r\n\r\n\r\nChris Koerner (01:12:11.15)\r\nOr both of us.\r\n\r\n\r\nChris Koerner (01:12:16.61)\r\nAnd it's free publicity to you. It's good content for us.\r\n\r\n\r\nNikolas Hulewsky (01:12:20.904)\r\nYeah, that's amazing. We're an hour and half in.\r\n\r\n\r\nChris Koerner (01:12:24.046)\r\nthe middle of the night.\r\n\r\n\r\nReally? I thought it was an hour 12, hour 12.\r\n\r\n\r\nNikolas Hulewsky (01:12:29.975)\r\nsorry, I just saw 1130 and.\r\n\r\n\r\nChris Koerner (01:12:33.26)\r\nLet me look at my notes real quick.\r\n\r\n\r\nOkay, yeah, got a couple more things that are right along the same lines.\r\n\r\n\r\nChris Koerner (01:12:44.046)\r\nOkay, so we were talking about quitting porn. Two days ago, I talked to a guy that has a good friend with the school community for guys that want to quit porn and he's doing six figures a year. That it's high ticket. I don't know what he's charging, but handful of people in a digital school community trying to quit porn. So there's an idea for you. Okay. Another thing quit porn.ai is a rapper. And it's, don't know how, how well they're doing, but it's, it's just, it's just a\r\n\r\n\r\nNikolas Hulewsky (01:12:52.788)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:13:13.195)\r\nsomeone to talk to. It's an AI to talk to that is built on how to quit porn. So there's one thing.\r\n\r\n\r\nNikolas Hulewsky (01:13:20.756)\r\nBut dude, I've got an AI wrapper for you. Are you ready? I think we both could do this, but you in particular. You should build an AI wrapper that talks about how you evaluate opportunities. So like, we're just talking about this and we're saying, hey, it seems like porn is a big problem. What would be the first place you would go to validate whether or not porn as an addiction is a problem?\r\n\r\n\r\nChris Koerner (01:13:23.252)\r\nokay. Yeah.\r\n\r\n\r\nChris Koerner (01:13:35.278)\r\nMmm.\r\n\r\n\r\nChris Koerner (01:13:41.827)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:13:48.174)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (01:13:50.324)\r\nGoogle Trends, you'd probably go to Google Trends and just see, hey, porn addiction over time, has that increased? Google Q, yeah.\r\n\r\n\r\nChris Koerner (01:13:55.598)\r\nYep. Google keyword tool. I go to perplexity. I go to the web archive. I go to Reddit. I go to a third party tool that shows how fast subreddits are growing. Like I go to gummy search. I, yeah.\r\n\r\n\r\nNikolas Hulewsky (01:14:09.138)\r\nYeah, so if you did all of that stuff and then you started selling it as a rapper where somebody goes in and they're like, hey, I think that this is exploding in popularity and I'm wanting to build a business around this. Like, what do you think of the opportunity? And then it goes out and does all the things that you know, you just mentioned or that we might use to validate something and returns back an answer. Like you've essentially just created a Chris rapper.\r\n\r\n\r\nChris Koerner (01:14:24.94)\r\nYeah.\r\n\r\n\r\nChris Koerner (01:14:30.092)\r\nYeah, it could, it could be that and, or it could be, how do I think of good business ideas? Right? Cause I could easily use AI to extract every business idea I've ever talked about and put it in an LLM or wrapper or spreadsheet or whatever. But how do I find my own ideas? want, cause we, you and I both know from our experience and co-founders, like you've got to be philosophically bought into an idea for it to really work for you. And the people that have emailed me and said, Hey, I started a stump grinding business based on your podcast. This guy, Tyler Mumford.\r\n\r\n\r\nHe heard our podcast from July started to stump grinding business. Why? Because he really loved it. No, it was because he worked on a tree trimming crew in high school. So like he had that experience and two, he did B2B enterprise sales. And our idea was about B2B stump grinding sales. So he took those two data points from his life and that enabled him to philosophically buy in and start it. Whereas 99 % of people, myself included, when I hear a genius idea, it's like, my gosh, that's a genius idea, but I'm not going to do anything about it.\r\n\r\n\r\nbecause I never worked on a true Truman crew. I've never done B2B sales. It's not my idea. a chat bot or a rapper or something that's like, okay, help me find ideas that are mine, that I am philosophically, maybe literally bought into.\r\n\r\n\r\nNikolas Hulewsky (01:15:30.846)\r\nDude, it's so true.\r\n\r\n\r\nNikolas Hulewsky (01:15:43.036)\r\nYeah, yeah, like help you get to the next question or like ask the next question that helps you get to the answer.\r\n\r\n\r\nChris Koerner (01:15:49.398)\r\nYeah, because Chris's ideas are cool, but those aren't mine, you know.\r\n\r\n\r\nNikolas Hulewsky (01:15:53.118)\r\nWell, dude, I had somebody listen. So I had Hector Resendez on the podcast and he talked about his online trade school, which is freaking 80, 85 % margins. He's doing $3 million top line revenue and it's revenue paid by the government. He gets free leads. It's just like, what the freak? That's a money printing business. A listener I talked to, they were like, hey, I listened to that. Turns out my dad was the education commissioner for the state of XYZ. And I realized I have a lot of connections in space. He and his brother are starting one.\r\n\r\n\r\nChris Koerner (01:16:01.506)\r\nThanks.\r\n\r\n\r\nChris Koerner (01:16:06.776)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:16:23.816)\r\nLike they're in the process of starting one in two separate states. He called me and he's like, your episode kind of planted that in my mind. So I think what you're onto is everybody has their own set of experiences that they can pull on. Having a rapper that helps them uncover where the opportunity is and where they can leverage those experiences is very interesting. Where it's like, okay, cool. Yep, I've helped you validate the idea works. Great. Why would this work for you? Tell me about your experiences.\r\n\r\n\r\nChris Koerner (01:16:53.198)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (01:16:53.318)\r\nor this set of experiences might be good for executing on this business. Do you have any of them?\r\n\r\n\r\nChris Koerner (01:17:00.014)\r\nDude, yeah, imagine if that rapper could tie into their inbox and tell them why this idea is good for them because people forget. Like they forget like let's say I put out I put out that tweet this morning about the the cement plant, right? Selling these retaining wall blocks and you see that and you're like, that's, that's really cool. And then but you plug that into the app. And the app is like, dude, you, you helped your dad make that walkway. And you loved it. You emailed him all about it seven years ago.\r\n\r\n\r\nAnd it's like, yeah. now I really love this idea. I forgot it. Like, it reminds them why they should be philosophically bought into it because they might have forgotten.\r\n\r\n\r\nNikolas Hulewsky (01:17:38.74)\r\nDude, what's the guy on Twitter who has the crush, the memory.\r\n\r\n\r\nChris Koerner (01:17:44.78)\r\nYeah, Eric Kaiser? Eric?\r\n\r\n\r\nNikolas Hulewsky (01:17:46.898)\r\nYeah, great idea. think it's an amazing idea because how many times do you have an idea you're walking around and you're like, take out your phone and put it in notes or you take out your phone and text somebody or whatever. But yeah, there's there's cool software now where you can just dictate automatically go somewhere. It organizes it, etc. That coupled with remember we talked about a couple of weeks ago, like a accountability group. Like, dude, you could create an accountability rapper.\r\n\r\n\r\nChris Koerner (01:17:54.382)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:18:07.01)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nChris Koerner (01:18:12.046)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (01:18:13.374)\r\nHey, I want you to remind me every Friday, because that's my business time to follow up on these ideas. Right. And it just there's always the reminder that's coming through that's pushing through your notifications that you've got set up. Like I actually might do this today. Go to tasks and be like, all right, every single day at these times, I need you to remind me.\r\n\r\n\r\nChris Koerner (01:18:22.135)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (01:18:40.756)\r\nto be on this meeting or to do X, Y, and Z because I may be up working and my messages might be behind another window, but chat GPT is like always open kind of where I am.\r\n\r\n\r\nChris Koerner (01:18:42.146)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:18:50.198)\r\nYeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (01:18:53.224)\r\nThat's a really interesting thing. You see it as an accountability partner. We're so smart.\r\n\r\n\r\nChris Koerner (01:18:54.74)\r\nhmm we're really smart and good-looking someone tell our wives please they need to know\r\n\r\n\r\nNikolas Hulewsky (01:19:02.99)\r\nmy wife she does not want to know her life is on the internet.\r\n\r\n\r\nChris Koerner (01:19:06.414)\r\nBut she listens to all these though, right?\r\n\r\n\r\nNick, are you there? Nick, you good?\r\n\r\n\r\nNikolas Hulewsky (01:19:14.772)\r\nHello, darkness eye of friend!\r\n\r\n\r\nChris Koerner (01:19:18.318)\r\nThat's like the litmus test to know if your wife listens to your podcast is if you talk about her because if you do then she doesn't.\r\n\r\n\r\nNikolas Hulewsky (01:19:31.368)\r\nThat's amazing.\r\n\r\n\r\nChris Koerner (01:19:31.534)\r\nwe're off the rails.\r\n\r\n\r\nNikolas Hulewsky (01:19:34.292)\r\nWe are off the rails. This is good though. All right. Thank\r\n\r\n\r\nChris Koerner (01:19:36.888)\r\nis good.",
  "metadata": {
    "duration": "",
    "date": "2025-01-31",
    "platform_source": "Google Drive"
  }
}