{
  "episode_number": "48",
  "episode_title": "How to Build Trust at Scale in a High-Touch Service¬†Industry with Marilyn Moedinger",
  "guest_name": "Marilyn Moedinger",
  "business_name": "Runcible Studios",
  "transcript": "﻿Nik (00:01.047)\r\nAll right, Marilyn, welcome to Nikonomics. Stoked to have you. Let's just jump into it. Tell me what you do and how you make money.\r\n\r\n\r\nMarilyn Moedinger (00:04.748)\r\nGreat to be here, Nick.\r\n\r\n\r\nMarilyn Moedinger (00:10.284)\r\nSo I'm an architect, which means that I provide architectural services. I also consult and I own and operate real estate and I have a newsletter.\r\n\r\n\r\nNik (00:20.505)\r\nOkay, so I want to spend a little bit of time talking about first year background. How did you get into this space? Because as I've followed you and looked at things that you've done, I think I read recently that you majored in something totally different in college. You've worked as a general contractor. You've been an architect. You now do consulting and newsletters. How did you get into this space in the first place?\r\n\r\n\r\nMarilyn Moedinger (00:47.798)\r\nWell, I did major in architecture. I just double majored in architecture and military history. fact. No. Yeah. Yeah. So I actually got into architecture and all of these things when I was like six years old. I used to draw houses. I used to buy. Well, my mom would buy a plan books for me, the grocery store, and then I would white out all the walls and redraw them where I wanted them. And\r\n\r\n\r\nNik (00:53.433)\r\nAre you kidding me? That is a really cool, fun fact. All\r\n\r\n\r\nMarilyn Moedinger (01:16.532)\r\nAt some point, someone was like, so that's a job. There's a school you can go to. And so I went to architecture school. When I graduated from architecture school with my undergrad degree, I went directly into construction. So I started in the field as a laborer and worked my way up to at a general contracting company as an estimator and a project manager. So I didn't stay a laborer for long. I think they realized\r\n\r\n\r\nMy highest and best use is probably not that. But it was great experience and really helped me be a better estimator and project manager. That was Charlottesville, Virginia.\r\n\r\n\r\nNik (01:55.257)\r\nAnd where was\r\n\r\n\r\nCharlotte's bill of Virginia. Okay, so, but if you graduated with a degree in architecture, why did you decide I'm gonna go start being a\r\n\r\n\r\nMarilyn Moedinger (02:06.838)\r\nWell, I really wanted to know how buildings go together. And I wanted to know that on the ground. And there's only one way to do that. Can't read a book. Can't watch, well, YouTube. Was it a thing then? I don't know. You can't, you can't, you gotta go do it. And the things I learned, they would give me a broom and I'd sweep the job site. And I would just sweep really close to like where the plumber was talking with his assistant. And then I would learn like the issues they were trying to solve as plumbers.\r\n\r\n\r\nAnd I'd hear the plumber arguing with the HVAC guy, and I'd be like, mental note, don't do that. Or whatever in the design. Or I'd hear what they were complaining about with architects or whatever their issues were. I just kept my ears open and listened to\r\n\r\n\r\nNik (02:39.843)\r\nBe\r\n\r\n\r\nNik (02:47.545)\r\nHow long did it take before you went back to\r\n\r\n\r\nMarilyn Moedinger (02:52.003)\r\nSo I went back, it was about four years.\r\n\r\n\r\nNik (02:54.745)\r\nAnd this is a really dumb question. please, please judge me as much as you want. I know, so CPAs have to take an exam. Lawyers obviously go to law school. They have to sit for the bar. Architecture is a professional service, but I don't quite understand like what are the qualifications to be an\r\n\r\n\r\nMarilyn Moedinger (03:14.248)\r\nso glad you asked. So you have to have a professional degree. So there's several different versions. There's a five -year undergrad you can get, which is kind of rare, or you can go, you have to get your master's. If you have an undergrad degree in architecture and you go for your master's, it's two to three years. So the minimum amount of school is five, but most people seven or six or seven, maybe even eight years of school. At that point, you, at least when I did it, it's a little bit different now.\r\n\r\n\r\nSo some of these phases can overlap, but there's an internship experience, which they call something different now, and I don't know. But basically you have to work, it was like 5 ,500 hours that I had to work in a supervised environment under 18 different categories. So I had to work 1 ,000 hours learning about this. And this is apprenticing. So this is working at an architecture firm and having a licensed architect sign off that I had done that 1 ,000 hours in that\r\n\r\n\r\nSo there's everything from structural to construction stuff to business things to design to all of that. Once you're done with that, you have seven, at least when I did it, now I think it's six, seven exams.\r\n\r\n\r\nNik (04:25.507)\r\nWell, hold on before the exams, said a thousand hours in how many categories?\r\n\r\n\r\nMarilyn Moedinger (04:30.402)\r\nIt's 5 ,500 hours total when I did it.\r\n\r\n\r\nNik (04:33.079)\r\nOkay. So that I mean, that's like two, two and a half years, three years of like full time work. Okay. So then you pass that and then you sit for some exams.\r\n\r\n\r\nMarilyn Moedinger (04:36.812)\r\nThree, yeah, two and half, three years. Yep. Yep.\r\n\r\n\r\nMarilyn Moedinger (04:44.682)\r\nYes, now I think you can be doing and taking the exams at the same time. So people do that differently. But yeah, so there's six or seven exams and those exams are in different areas of expertise. again, structures, mechanical, electrical plumbing, site planning, ethics and business stuff, design, of course. And then on any exam at any time, they can ask you architecture history questions at any\r\n\r\n\r\nNik (05:13.463)\r\nReally? architecture history? Like what like, hey, the the Parthenon in Rome was built with this material.\r\n\r\n\r\nMarilyn Moedinger (05:14.25)\r\nYes. Yeah, so you have to.\r\n\r\n\r\nMarilyn Moedinger (05:23.254)\r\nWell, the Parthenon's actually in Greece. The Pantheon is in Rome, so there you go.\r\n\r\n\r\nNik (05:27.385)\r\nGood I was testing you I said I said I'm such an idiot. Gosh dang\r\n\r\n\r\nMarilyn Moedinger (05:34.178)\r\nI mean, I couldn't let it slide. I mean, you know.\r\n\r\n\r\nNik (05:36.897)\r\nlook, my job is to make you look good. And I softballed right there and you call it was perfect. You hit it out of the park. I watched something recently on the way that they designed that and how Roman concrete is supposedly very, very, very strong. And one of the things that they found was that I'm going to like totally butcher this and you're going to correct me because you know how it works. One of the things that they found is that over time as water came in and it broke down the calcium in the concrete, but\r\n\r\n\r\nMarilyn Moedinger (05:43.18)\r\nlove it. Thank you.\r\n\r\n\r\nNik (06:06.529)\r\nit reconfigured or recalcified in a way that actually made it stronger. And it was something that we didn't even know, which is why that that building has been able to stand for thousands of years. And I was like, that is like, did they figure that out? Or did they just look into\r\n\r\n\r\nMarilyn Moedinger (06:19.254)\r\nYeah, it's pretty amazing. mean, I, the Romans are pretty smart engineers. So I feel like they probably knew a lot of that stuff, but it's unreinforced, which is really key. So we, when we build concrete now, we put rebar in it, which is steel, which takes on the tensile forces, concrete works in compression. So it's really pretty amazing that that size of dome, and it's not very thick either. And it's got an oculus at the center. It's like, it's amazing. I have, yes, several times.\r\n\r\n\r\nNik (06:39.287)\r\nNo. I know. Have you ever been? My wife and I went and that was probably my favorite building in... I mean, I knew what it was, but it's something to see a picture of it and then another thing to actually be there standing in the sunlight, kind of shining it. I want to tell you a funny story. My father is an immigrant. He grew up in Brazil. He's technically Ukrainian.\r\n\r\n\r\nGrowing up, he just, he wanted to always work with his hands. And I love you dad, he'll never listen to this. He's just not very good with his hands. he, our house was like always in a state of construction. And I can just hear him yelling at me like, Nikolai, please hear me hammer. Hold the lather for me. You know, and he's like doing something crazy up top. But he was a draftsman. And I just remember my parents getting into a fight because\r\n\r\n\r\nApparently he had put like architect on his business card and the state of California sent him a letter that was like, can't, you can't, and it's all you can't say you're an architect. And my mom was like, what are you doing? Why would you say you're an architect? So yeah, that's my, that's my brief story of funny immigrants. So you, you went through the process, you became an architect. How long did you work strictly as an architect? Because you own real estate, you've worked as a general contractor,\r\n\r\n\r\nHow did those pieces fit into your story?\r\n\r\n\r\nMarilyn Moedinger (08:10.914)\r\nSo when I graduated from grad school, it was during the recession. So I graduated in 2010, basically. There was nothing happening. I got a job offer in Boston. I had never been to Boston. So I was like, sure, let's go. And I took a job with an architecture firm there. that's where I got all my multifamily experience and worked with a of developers. it was really, really good. That firm was really good at understanding the needs of developers and making really great multifamily projects. So that's where I got.\r\n\r\n\r\nThat was like bootcamp. And I was not licensed at that point. I was still what they used to call an intern architect. I think it's different what they call it now, architect and training or something. So I was not licensed yet, but I was able to work on these projects. And so I did that for a couple of years. And then I actually went into higher ed. I was administrator at a design school in Boston. Yep. And ran all of the design, build and community engagement projects.\r\n\r\n\r\nNik (09:02.424)\r\nCool\r\n\r\n\r\nMarilyn Moedinger (09:07.554)\r\nThat's where I learned a lot about writing contracts. Besides the contractor part, this was also the other part of that. How do you get a bunch of people to decide what a project is and agree to it? I worked with 80 different nonprofits to set groups of students up with them to do these projects. That was an organizational thing. Then I started my own company in 2013.\r\n\r\n\r\nNik (09:31.353)\r\nOkay, so this is the part obviously I'm probably most curious about. What was the trigger? What was the moment where you were like, I'm done with higher ed because all these students just kill me. And that you said, I'm gonna start my own company.\r\n\r\n\r\nMarilyn Moedinger (09:49.73)\r\nSo it was completely by accident. So it was not a grand plan. So what happened was I was tired of higher ed, but I wasn't tired of the students. I love the students and I love teaching. And I ended up teaching for about 10 years after that as an adjunct. I love that part. But what I couldn't, what I wasn't so excited about was the massive meetings and the talking all the time. And I was like, I just want to do stuff. I'm just not cut out for all these meetings. I want to do\r\n\r\n\r\nNik (10:10.851)\r\nPeace.\r\n\r\n\r\nMarilyn Moedinger (10:18.91)\r\nSo I left that and I said, I have three more exams to take before I'm licensed. And I don't have a plan for what to do, but I know I've got about six weeks of pay and vacation and savings and whatever. I'm going to make it through Christmas. I'm going to take the rest of these exams. And then I'm going to figure out what I'm going to do. I'll just go get a job in another architecture office. Well, I passed my exams. And then funny things started happening. People were like, we heard your\r\n\r\n\r\nyou know, you're available, you wanna kind of pinch head on this project. So I started to help out on other stuff, people at other firms that I knew. architecture, so, yeah. So, you know, someone says, hey, we just got a big project in the door. This happens a lot in architecture. You know, a firm might get a big job in the door. They don't wanna hire someone permanent. They just need a couple of people to fill in the ranks, so.\r\n\r\n\r\nNik (10:56.249)\r\nDoing what specifically? Architecture.\r\n\r\n\r\nNik (11:11.255)\r\nAnd forgive my ignorance, even though you hadn't taken those three tests, because you are working under the supervision of a licensed architect, your work was fine because essentially you're being reviewed by them. Okay.\r\n\r\n\r\nMarilyn Moedinger (11:22.466)\r\nThat's right. Yep. Yep. And then I was licensed after about, I think it was February of 2014 is when I think that's when all the paperwork came through. So then I realized that I was, and then people said, well, why don't you just take on this project yourself? We don't have time at our firm or we don't want to, or, and then I was talking to people at networking and realizing that I was saying, I'm an architect. I can do this. And people were like, well, we'll just hire you to be our\r\n\r\n\r\nAnd I said, OK, I should probably have insurance or something. So I'm like maybe an LLC, I guess. So I filed my LLC paperwork on April 15, 2014. And I don't know, everyone in the government was busy and looking the other way because the paperwork went straight through. that was it. So I was in business. And I got myself a business card. And I was an architect with my own practice.\r\n\r\n\r\nNik (12:17.657)\r\nOkay, will you help me understand like tactically for architecture? So I mentioned before, my dad was a draftsman. I just know that's a word. I don't really know what that means. Like what does the architect do? And what are like non -architecture requirements? I don't even know what question I'm asking. I hope it makes sense what I'm trying to\r\n\r\n\r\nMarilyn Moedinger (12:39.35)\r\nWell, I'll give an answer and you can tell me if my answer makes sense as to what you're talking about. So at an architecture firm, there's a variety of different people who work there to execute a project. So at the top is the architect. That's the person we actually have a physical stamp or rubber stamp that is that has our name and it has our, you know, state it's by state and it has our number and we stamp the drawings like physically, not so much digital.\r\n\r\n\r\nNik (13:06.071)\r\nMarilyn Moedinger (13:07.926)\r\nBut what that stamp means is I'm an architect. I am endowed by the Commonwealth of Massachusetts or Pennsylvania or Maine, that's where I am, licensed professional, to take on the liability on behalf of my clients. And I attest that these are, to the best of my professional ability, properly done. Now, that doesn't mean that I physically have drawn everything that's in that drawing set. In the early days, did. I drew everything. I was the intern. I was the...\r\n\r\n\r\nDraftsman, I was the designer, I was everything. When you start to build out your team, you start to fill in those roles with different people. So a draftsman would be someone who might have a two -year degree or no degree. They just have experience and they would be drafting. So they would be, and in the old days, at drafting tables, literally making all the drawings. Now it's all digital. So you can either be working in 2D or 3D and there's all these different programs that you would work\r\n\r\n\r\nAnd the whole team is working on the drawing set altogether. So there's a hierarchy and depending on how large the firm is, you have all sorts of, there's architect, there's project architect, there's design architect, there's all these different sort of levels. But most architecture firms in the United States, like 70 % of them, are between one and five people. They're tiny. Yep. So those types of firms, if it's a five person firm,\r\n\r\n\r\nNik (14:28.375)\r\nInteresting. Tiny.\r\n\r\n\r\nMarilyn Moedinger (14:34.294)\r\nmight have one stamping architect at the top, and then a couple of maybe non -licensed people who are really advanced. Like, that's what I have, is non -licensed people who are exceptionally advanced and really, really good. And they work directly under me and might sort of be manning a project and running the project, but I have to be keeping an eye on everything as a stamping professional.\r\n\r\n\r\nNik (14:57.335)\r\nIt's really, really interesting to hear you describe it because my background is healthcare. So home health, hospice, home care in particular. It sounds a lot like a physician practice. Where you have like the supervising. Yeah, exactly. You have the supervising physician. They may have a nurse practitioner or a physician assistant that do, they may write prescriptions or they may actually see a lot of the patients. They may even have nurses who come in and take blood pressure to do blood work. But ultimately the physician signs off on all the\r\n\r\n\r\nMarilyn Moedinger (15:09.996)\r\nYep. Yeah.\r\n\r\n\r\nNik (15:27.639)\r\nthey're doing. What? So describe to me what a project is. And I'll give you an example. I own an RV park in Waco, Texas that I bought. And we got a letter from the city recently that was like, Hey, surprise, we know you just bought this park. But here are all the things that were out of compliance. You have to build a what was it called a bathroom, you have to build, you have to anyways, come to code with all these different things.\r\n\r\n\r\nAnd the first question I had is like, okay, who do we take this to? So that's gonna be my first question to you. So you would take it to just an architect.\r\n\r\n\r\nMarilyn Moedinger (16:06.602)\r\nYeah. Yeah.\r\n\r\n\r\nNik (16:08.215)\r\nAnd OK, go ahead.\r\n\r\n\r\nMarilyn Moedinger (16:10.988)\r\nSo an architect, so basically what it sounds like is a letter. And by the way, I get these kinds of calls all the time. Someone's saying, I don't know who to go to, what do I do? They're talking about buildings and code and I don't know what to do. So an architect is also in the world, in the building industry is also very much like a general contractor in that we are sort of conductors of the orchestra, right? So I'm conducting the design team orchestra. So that means that I can play a civil engineering.\r\n\r\n\r\nrole, but I'm not a civil engineer, right? Like I am not the first violin. I can kind of scratch my way through on the violin, but I'm not the expert. So there's engineers. So in your case, I would read your letter and I would say, what of these things are things that I can take care of as an architect? So bathroom, know, this, that, this building related things, zoning related things. And then I might say, you know, they're, they've got a couple of things on here about your utilities. So we need to bring in a civil engineer.\r\n\r\n\r\nNik (16:56.387)\r\nCool.\r\n\r\n\r\nMarilyn Moedinger (17:08.982)\r\nI would bring that in under me potentially, and I would marshal them. And so I'd say, we need a civil engineer. And they're also talking about this drainage thing. So we might need a civil engineer who specializes in exterior drainage. And then I would go into my network and say, all right, I'm thinking of this engineer. Let me put this person, let me pull this person. And this is your team who can get this done.\r\n\r\n\r\nNik (17:33.313)\r\nSo you're quarterbacking the whole process. I always thought it was like the general contractor. Okay, I'll reach out to a general contractor and their quarterback. Am I just an idiot or is that a common misconception?\r\n\r\n\r\nMarilyn Moedinger (17:44.94)\r\nThat's a very common misconception. So the contractor, the general contractor is a quarterback also. So there's two quarterbacks on your team who have two teams working under them. And when you take the field, you actually, you as owner take the field, you have two quarterbacks and two teams, but they're both on the same team. Like it's kind of weird.\r\n\r\n\r\nNik (18:07.553)\r\nOkay, so would you be the one who's like, hey, Nick, this is the general contractor I would recommend, or would it be like, I don't do the general contracting stuff. You're have to figure out who you're gonna find to actually execute the work.\r\n\r\n\r\nMarilyn Moedinger (18:21.388)\r\nSo the way that it works is I would, if you've come to me first and you haven't talked to any GCs, I would say in my network, these are the GCs that I think would be a good fit for you. Also happy to work with whoever you're bringing to the table.\r\n\r\n\r\nNik (18:37.059)\r\nAnd it probably works the other way too, right? Like if I went to the GC first, they're like, here are the architects that I work with. okay.\r\n\r\n\r\nMarilyn Moedinger (18:42.796)\r\nYep. So when you sign agreements, the contractual relationships are you are at the top and you sign one contract with the architect and one contract with the general contractor. And then below that are all the sub contracts, right? So the general contractor has the plumber, the HVAC guy, the framer. I have the engineer, the interior designer, the whatever. I have all those people, the zoning expert, whatever.\r\n\r\n\r\nThe general contractor and the architect do not have a contract together, but they have a contractual relationship based on sort case law and based on the contracts that are signed.\r\n\r\n\r\nNik (19:20.045)\r\nYeah, that's what I was going to ask. like, yes, that's the RV park, but you could also do if you're remodeling your house or whatever. Let's say you go through the process and you act you do the plans. I'm assuming you also work with the city or at least liaison with the city to get them approved and incorporate feedback, etc. Once those are approved, they're just handed to the general contractor and the general contractor is like, cool. Thanks for passing the baton and like that's the end of your relationship with the general contractor as architect.\r\n\r\n\r\nMarilyn Moedinger (19:50.304)\r\nNope. So generally there's, there's a feathering in of the contractor much earlier than that. So I prefer to have the contractor on board early if, early bids. when I run my processes, I would say to you, Hey, you know what, let's knock out a schematic line here, like a big sort of setup, and then let's go to three contractors and let's get a ballpark estimate about what, what we've got here before I go all the way down the road with figuring everything\r\n\r\n\r\nNik (20:07.865)\r\nGood\r\n\r\n\r\nMarilyn Moedinger (20:18.976)\r\nLet's make sure, let's get some ballparks. That ballpark, so we have a whole process for that. And because I used to be a contractor and an estimator and whatever, I'm able to give them the information that they need. So I'm holding the owner back a lot. And like, they don't care about the color of the tile in bathroom at all. They just need to know like the basic of what's going on. So I'm holding them back. We put together a big bid package and we get three bids. Those are ballpark bids, right? Like where are we in the\r\n\r\n\r\nThen we say, now that we know, and it's a chance for us to meet the contractors. And for you to say, you know what, I really like contractor A and had a good price, let's work with him. So we would get under contract with him or her under what's called pre -construction services. So you might pay them a couple of grand to help advise the team so that I'm not drawing something. I can call the contractor and say, hey, dude, you're on the team. I'm getting ready to draw this, you know, thing is\r\n\r\n\r\nyou know, what do you think about the way to do this? And vice versa, right? So then the team will go early. Once the drawings are completed and ready to go to the city for application for permit, the contractor does take the drawings at that point and they apply for the permit. Once they have a permit, then the contractor does take on a much bigger role because now it's time to build. But the architect goes into a new role, which is called contract administration, which is where we are watching the project through the end of the\r\n\r\n\r\nSo let's say it's a renovation of your home and the contractor has the drawings great and they take out a wall and they're like, my god, this is full of plumbing. We can't remove this wall. There if there's no architect, they're going to ask you, homeowner, what should we do? And you're going to be like, how do I know? So the architect said that the contractor calls the architect and says, I just found a wall for plumbing. What are we going to do? Me and the contractor.\r\n\r\n\r\nNik (22:08.364)\r\nYeah.\r\n\r\n\r\nMarilyn Moedinger (22:16.288)\r\nget together, come up with three solutions, and present them to the owner and say, hey, owner, we found a problem. Here are the three ways we can fix it and the cost implications and the timeline implications. Which one of these do want to do? So that is a big part. And then also, the contractor sends the invoices to the architect, not the owner.\r\n\r\n\r\nNik (22:38.905)\r\nI don't get\r\n\r\n\r\nMarilyn Moedinger (22:40.482)\r\nI then look at the invoice and I approve it. And I say, yes, this owner can pay $50 ,000.\r\n\r\n\r\nNik (22:48.547)\r\nIs that normal or is that just the way your practice works?\r\n\r\n\r\nMarilyn Moedinger (22:52.322)\r\nYep, that's normal. what that is is the because it's the owner may not know about. So the invoice comes in and says, we're 50 % complete with framing. We're billing you for 50 % of the framing being done. That means you have to understand what 50 % of the framing being done. The contractor will always be trying to get out in front of you billing wise. The architect is always like, no.\r\n\r\n\r\nNik (23:09.952)\r\nI'm gonna go to\r\n\r\n\r\nNik (23:16.291)\r\nmake\r\n\r\n\r\nMarilyn Moedinger (23:19.074)\r\nWe don't want them to get out ahead of you. So they are your advocate on site. So we're not QA, QC. We're not going around and measuring everything and saying, this is an inch off. But we are conducting weekly meetings, owner, architect, contractor meetings. We're keeping track of a lot of stuff. We do field reports. We're corralling all of the various inspections that have to happen on the engineering side. We're solving problems as they come up. There's a ton of work to be done. And obviously, that is calibrated to the size and complexity of the\r\n\r\n\r\nSo you live in the backyard, maybe not, but a big, huge project is a ton of\r\n\r\n\r\nNik (23:54.615)\r\nMarilyn, I can tell how smart somebody is by how dumb I feel once they've explained something. Not because not. And here's why. Because you explain it in such a way that makes me feel like, that makes total sense. How did I not know that? Right? Not because you're using like all this fancy jargon that I'm like, I'll never be able to to pick up on all of those things. But you like explain it in such a simple\r\n\r\n\r\nthat at the end of it, I'm like, yeah, that makes total sense. And gosh, I'm a moron for not ever having put that together. So thank you. Because that like that was an amazing explanation of the way that the architecture architect and the general contractor work together. And it it actually sounds I'm bringing it back to medicine, but it's like, you're the patient. You might have a primary care physician, but then you go see a specialist, or you might see a surgeon and like they work together, but they're not necessarily\r\n\r\n\r\nproject managing, you being the project in this case. I think that's a really cool way that you explained it. Is there a rule of thumb to say, okay, if you're gonna do a kitchen remodel or if you're gonna do a commercial building from scratch, the project costs $100 ,000. Generally speaking, the architect will get X percentage of the project, the general contractor will get X percentage and the raw materials will\r\n\r\n\r\npercentage? Is there a rule of thumb or is it different on every\r\n\r\n\r\nMarilyn Moedinger (25:24.13)\r\nThere are rules of thumb, but they are based on project type. So $100 ,000 actually doesn't matter as much as what the project type is. So if it's a kitchen remodel, all those percentages are different. If it's a shed in the backyard, all those percentages are different. If it's an industrial building, all those percentages are different. So basically, the rule of thumb of the rule of thumbs is the percentages are lower. So you pay less fees when the buildings are less\r\n\r\n\r\nNik (25:31.065)\r\nSo.\r\n\r\n\r\nMarilyn Moedinger (25:53.034)\r\nSo the least complex kind of buildings are industrial buildings and warehouses and stuff like that. The most complex things are residential renovations.\r\n\r\n\r\nNik (26:03.491)\r\nAre they complex because the owners are a pain in the ass or are they complex because just like there's lot going through the house in the elect?\r\n\r\n\r\nMarilyn Moedinger (26:11.65)\r\nBoth. And then there's just so much that you can't plan ahead. In an industrial building, so an architect's fees for an industrial building might be 1 to 3 % of the cost of construction. Whereas on a custom high -end residential, it's 15 to 25 % of the cost of construction. And I'm telling you, you have to work your fanny off to be profitable even when pulling in those fees, because it is so much work.\r\n\r\n\r\nNik (26:39.865)\r\nYou said 15 to 20\r\n\r\n\r\nMarilyn Moedinger (26:42.306)\r\n25 is what the big guys, know, really famous ones would do.\r\n\r\n\r\nNik (26:45.721)\r\nOkay. What sandbox do you prefer to plan?\r\n\r\n\r\nMarilyn Moedinger (26:51.714)\r\nSo I work, so we do a variety of different kinds of work. we do custom residential stuff. I just know it really well. I know how to handle those types of clients and projects. For those, know, we're 16 to 18 % is our sweet spot, but we do full interior design for that. we, our clients are getting a huge bang for their buck. yep.\r\n\r\n\r\nNik (27:12.505)\r\nOkay, let's put that to the side for second, because I'm really interested to learn about that. Before we get into those pieces, can you talk about, because you've mentioned this a couple of times and the questions come up in my mind and I don't want to forget it. What does liability look like? Because you're drawing these plans that are being implemented by a general contractor. Yes, the city approves them, but I'm assuming there's fairly high liability for an architect.\r\n\r\n\r\nMarilyn Moedinger (27:40.8)\r\nYes, also project dependent. So the most litigious building type is condos. that like by far, that if you work, if you're an architect who works on condos, your fees will be higher. So when I'm working with multifamily developers and they say, this might be a rental, might be condos. I tell them on day one, my fee will be X percent higher if this is condos. Same thing.\r\n\r\n\r\nNik (28:06.271)\r\ninteresting.\r\n\r\n\r\nMarilyn Moedinger (28:07.83)\r\nbecause the liability, your exposure is so much greater. And that's pretty industry standard. I didn't make that up. So depending on the state, basically in Massachusetts, for example, they have seven years after the product is completed to if there's a defect to go back to the original team who did it. And I'm explaining things very broad brush. not a lawyer, whatever. So asterisks.\r\n\r\n\r\nNik (28:12.632)\r\nWhy condos?\r\n\r\n\r\nNik (28:30.915)\r\nYeah, yeah, yeah.\r\n\r\n\r\nMarilyn Moedinger (28:36.514)\r\nLet's say the condo association decides at six and a half years that somebody has a leak. All of those condo owners can get together and sue the architect, the contractor. So it's just a huge mess. So there's like the ambulance taster of the condo world. So what lawyer of the condo world who goes around and figures out which condo buildings are coming up on that, that statute of limitation moment, and they will find something to sue.\r\n\r\n\r\nNik (28:46.431)\r\nokay.\r\n\r\n\r\nMarilyn Moedinger (29:06.754)\r\n13 for. So most\r\n\r\n\r\nNik (29:08.441)\r\nDoes it work the same with like, so in Idaho, this is something I'd never, I grew up in California and then we moved to Idaho five years ago and I never ran into this. HOAs here are like the standard, homeowner associations. Is it the same when you design a\r\n\r\n\r\nMarilyn Moedinger (29:28.866)\r\nNo, because those are, it's not quite, no, not quite. And usually most architects are not really involved heavily in that kind of work anyway.\r\n\r\n\r\nNik (29:32.735)\r\nNo, okay, that's\r\n\r\n\r\nNik (29:37.433)\r\nOkay, so thank you very much for explaining like what an architect is, how they interplay with general contractors. Tell me specifically now, 30 minutes in, because I'm a moron, what does your business do in particular? Because it sounds like you do a number of things. Yes, you do the architecture, but you do also do interior design, you do consulting. I'll leave it\r\n\r\n\r\nMarilyn Moedinger (30:02.018)\r\nYeah, so I mean, basically, what I'm trying to do myself and with my business is bring the full force of my experience, my unique experience, 20 years in different assets of this industry to bear my class. Yeah. Very good. So yeah, mean, so if I graduated when I was 21, I'm now 41. So there you go.\r\n\r\n\r\nNik (30:16.249)\r\n20 years? Did you start when you were 12?\r\n\r\n\r\nNik (30:30.265)\r\nJeez Louise,\r\n\r\n\r\nMarilyn Moedinger (30:31.682)\r\nmean, I'm counting my years in grad school. So, subscribe to us. have 15 years.\r\n\r\n\r\nNik (30:33.625)\r\nWell, no, no, no, no. It's just a weird thing because I'm going to be 39 next month and I still feel 12. When I talk to people, I'm like, what? There's no way I have, I do have 20 years experience. So anyways, you're\r\n\r\n\r\nMarilyn Moedinger (30:45.238)\r\nYeah, I do.\r\n\r\n\r\nMarilyn Moedinger (30:50.966)\r\nYep. That's a cool moment. basically like, however I can pull all of that experience together and bring value to clients. So for instance, I hear all the time that people don't know what to do with their home. They're like, I'm in my home. I love it. It's a great location. I want to add on, but can I, can I afford it? Will zoning let me? I don't know. What, you know, my husband and I don't agree about what we want to do. Like whatever, what should we do? So I have a consulting product where I actually just meet with people\r\n\r\n\r\nStrategize and say like alright. Well, let's talk about it. I mean I can talk about the building I can tell you about zoning code I can talk about all this stuff and like how it all comes together and how process would work and then nine times out of ten those Consultations don't lead to us being the architect which is fine. I don't care. I just want to help people Learn how the process work is so opaque, you\r\n\r\n\r\nNik (31:41.613)\r\nWell, I love I I mean, you talked about this way earlier, but the fact that you you have a lot of experience as an estimator. Right, like you've actually done this work you were trained in, in the estimation processes isn't like the theoretical for you. Are you able to do that for only the states that you're licensed in pencil? think you said Pennsylvania, Massachusetts and Maine? Or is that something you're able to do across the\r\n\r\n\r\nMarilyn Moedinger (32:06.722)\r\nSo I can do consulting anywhere across the country. I've actually done it internationally as well. Super fun. But yeah.\r\n\r\n\r\nNik (32:12.745)\r\nWhat she's pitbull. Mrs worldwide in this case. So I could I could have called you and been like, Hey, Marilyn, I got this park in Waco. It's a freaking pain in the butt. I got to work with the city and you would help me navigate that process, right? You couldn't necessarily do the planning. But you would help me you'd be the my liaison essentially.\r\n\r\n\r\nMarilyn Moedinger (32:32.768)\r\nYeah, or I could just say, hey, let's get on the phone for an hour and a half, bring me all your stuff and let's talk about it. Let's talk about the things that I would do next if it were me, given all my experience or here are the people that you should probably call. You you need this person and this person's person. I can't do everything to the degree of specificity that I can in the jurisdictions that I work in and know really well. If you've got a project in the greater Boston area, I can tell you what it will\r\n\r\n\r\nNik (32:57.187)\r\nMm -hmm.\r\n\r\n\r\nMarilyn Moedinger (33:02.016)\r\nyou know, like roughly, because I do that work all the time. But in Waco, Texas, with your park, I wouldn't necessarily be able to say like, these are the kind of costs you could be expecting. But what I can do is, let's say, look at the estimates with you, because I know how to read an estimate. And I can say like, why is this guy specifically leaving this out? Like what, like what is with that, you know, and I can, I can ask the question.\r\n\r\n\r\nNik (33:27.929)\r\nYou're the construction Sherpa. You're freaking, is this a common business model? I really like this because it's a high trust relationship. Like you have to trust somebody is telling you the right information. And especially the way you're positioning it, obviously in Pennsylvania, and Maine, can do the design work, but in these other States, it's like there's no financial incentive.\r\n\r\n\r\nMarilyn Moedinger (33:31.146)\r\nYeah, there you go.\r\n\r\n\r\nMarilyn Moedinger (33:35.35)\r\nNo.\r\n\r\n\r\nNik (33:57.625)\r\nif I'm the homeowner for you to say like, no, you should do X, Y, and Z. Cause you're not necessarily charging. Well, you might, but you're not necessarily charging, you know, project based as a percentage. Maybe I should ask that. How do you charge when you're just doing the consulting? Is it a percentage of the project?\r\n\r\n\r\nMarilyn Moedinger (34:12.834)\r\nYeah, you like there's a link on my website you book a time in Calendly you put your friend card in and that's it so you're exactly right like I'm not I'm not like I I'm not trying to win the job, you know, I mean I Could tell yeah, I'm like there and then at 34 we got there\r\n\r\n\r\nNik (34:35.043)\r\nDude. I've been Yes. Yeah. I've been counting down the time this whole time. But once you said you were international, I was like, I was in just kidding. No, I love this because you have an audience. Are you just on\r\n\r\n\r\nMarilyn Moedinger (34:42.69)\r\nThat's it.\r\n\r\n\r\nMarilyn Moedinger (34:51.586)\r\nmean, I'm on Instagram, but it's really hard to build. I need to be better at video. Like, let's be honest. I do.\r\n\r\n\r\nNik (34:56.631)\r\nYou do. You do. I have a good friend whose name is Mike Higgins. He's on he's on Twitter as well. And I'm and he's a flipper. And I'm like, dude, get off of Twitter and go to Instagram because people love to see that crap. Pressure watching, you know, the before and after whatever. But but because you have an audience, you could easily build a network where it's like, I went over, you know, Omaha, Nebraska. Yeah, I\r\n\r\n\r\nMarilyn Moedinger (35:09.174)\r\nThey do.\r\n\r\n\r\nI, yes.\r\n\r\n\r\nNik (35:22.839)\r\nI don't know that space, but I'll continue to advise you. And here's my network of architects and contractors that work in that space because you're able to pull from Twitter or you could post and be like, hey, I have a, I have a client in Denver, Colorado. Who do I know? And you probably already do this. So apologies, but I just think that's a fascinating use case to leverage your distribution of your social media.\r\n\r\n\r\nMarilyn Moedinger (35:44.224)\r\nYeah, well, that's what I'm trying to do. So that's why the newsletter is there. That's what I'm trying to do. So, and the other part is not just homeowners, the other part is for developers. So developers coming to me and saying, you know, I can't get this out of my architect. How do I talk to an architect to get what I need out of it? Let's look at these plans together. I know these plans aren't quite right. And I'm like, I can find you three more units in here. Let's sketch it out. So like, cause you know, I was put on this earth to do a couple of things and one of them\r\n\r\n\r\nNik (35:46.947)\r\nin\r\n\r\n\r\nMarilyn Moedinger (36:13.974)\r\nto draw plans really, really\r\n\r\n\r\nNik (36:16.217)\r\nOkay, you need to do more video because within 30 seconds of talking to you, it's like, I trust Marilyn. You're smart, you're charismatic, you obviously know what you're talking about, you know what I mean? And there's a genuineness where you're just trying to educate and that's like almost the anti -sale is the best type of sale, right? You're not like pitching something, you're like, hey, here's how it is, you can make your choice. So do more video because that's gonna earn trust.\r\n\r\n\r\neven quicker than writing on Twitter. Tell me, do you charge for those types of services? How does that\r\n\r\n\r\nMarilyn Moedinger (36:51.106)\r\nSo you can go on, just so that this is evergreen, you can go on my website, mwmodinger .com, which is my consulting website, and it's all right there. So you can see. The only thing that's not published is in person. So in my markets, I'll do in person. So I will come to your house or your building, and I'll do an in person. I'll do it up to two or three hours if someone wants. And we do these work, I send them worksheets, I've got these packets, like we've got all this stuff.\r\n\r\n\r\nNik (37:19.585)\r\nLet's talk about architecture in particular, but I mean, you can also liken it to the consulting piece. What does your cash conversion cycle look like? Are you collecting upfront? it project -based or milestone -based where you hit certain things and then you get payments? How does it\r\n\r\n\r\nMarilyn Moedinger (37:33.186)\r\nIt's milestone based. cashflow in architecture is notoriously crappy. So we a small deposit, but it doesn't. It's just mostly to say, yes, you're serious about the project to some degree. But we are billing. I bill monthly, and I based on the work that we did in the previous month. So I'm not getting paid for work that I did on July 1 until if my client is super speedy, August 2.\r\n\r\n\r\nNik (38:01.283)\r\nDude, I'm telling you, this is so similar to healthcare. Like, we're the same. I always tell people I'm like, we're not McDonald's. You don't just pull up and get a hamburger and pay right then like we have to bill and wait and collect and so that's like the cash conversion cycle sucks. And so yeah, I may get an influx of like, my gosh, we got all of these projects, but you're not gonna get paid on them for three months.\r\n\r\n\r\nMarilyn Moedinger (38:07.532)\r\nYeah.\r\n\r\n\r\nNik (38:27.597)\r\nWhat do do? How do you hire upfront? How do you make sure you're meeting payroll? How do you meet those costs? Anyways, it's it's hard in these services businesses to grow and scale really quickly.\r\n\r\n\r\nMarilyn Moedinger (38:27.99)\r\neasily.\r\n\r\n\r\nMarilyn Moedinger (38:37.748)\r\nit is and then what you're growing and scaling is completely dependent upon other forces. So if the city decides to take their time reviewing things, could have it in a month or I could have, could go through a zoning process in a month or two, or it could be three years. I don't, I have zero control. And during that three years, I'm not billing because I'm not really doing, I'm going to a few meetings and I'm like doing some work here and there, but I'm not, we make money when we make drawings.\r\n\r\n\r\nwhen we and if I'm going through some long process or the owners like I don't know maybe we won't do the project I need to think about it it'll be three months of them thinking and then they're like we want to go and I'm like well three other things just kicked off so now I have to like staffing and architecture and cash flow and architecture wicked hard yes\r\n\r\n\r\nNik (39:26.765)\r\nReally? she moves to Boston and now she's like, it's wicked hard. I packed my car and I'm of\r\n\r\n\r\nMarilyn Moedinger (39:32.299)\r\nI had to drop in. say Wiccan and y 'all. That's my Virginia and Boston coming up.\r\n\r\n\r\nNik (39:37.401)\r\nAre the majority of your employees outsourced or are local?\r\n\r\n\r\nMarilyn Moedinger (39:42.604)\r\nSo they are, so I have one full time and then we team up as needed to kind of expand and contract for different projects.\r\n\r\n\r\nNik (39:51.257)\r\nCould you use international talent for this? No.\r\n\r\n\r\nMarilyn Moedinger (39:54.548)\r\nNo. So that is a big thing in the industry. People talk about doing that in various ways. I, for the work that I do, it's high touch and it's very specific to the buildings that we're working in. They're residential renovations. So I need people who are in them. So I can't, if by the time I'm done explaining all of the things that would need to be explained about a building to someone else, I could have done the work three times myself. So drafting.\r\n\r\n\r\nNik (40:17.145)\r\nMm -hmm. Mm -hmm.\r\n\r\n\r\nMarilyn Moedinger (40:24.45)\r\nis in the residential renovation world, it doesn't work like that. Now, for the sort of multifamily stuff, I could see where potentially that could be possible. Most people I know who've done it have not had great experiences. It's just, they have to understand American construction and not just American construction, but regional quirks in construction. So if you're drawing stuff that doesn't make sense to a Boston doozy or a Boston framer, it's\r\n\r\n\r\nClass two, so.\r\n\r\n\r\nNik (40:54.829)\r\nWhat's your ideal customer?\r\n\r\n\r\nMarilyn Moedinger (40:58.182)\r\nso my ideal customer is someone who values design highly. Someone who understands that things to do things right, takes expertise. So I mean,\r\n\r\n\r\nNik (41:12.963)\r\nSo you're probably, that gonna be more residential than, no.\r\n\r\n\r\nMarilyn Moedinger (41:17.474)\r\nNo, so my, so what ties the types of projects I work on together? So I do the multifamily stuff. I do quirky commercial industrial stuff. What ties it together is. Yeah.\r\n\r\n\r\nNik (41:26.711)\r\nyou think quirky. That's a real that's a real design class. Like, I don't I don't do postmodern I do do quirky industrial though.\r\n\r\n\r\nMarilyn Moedinger (41:31.116)\r\nI felt\r\n\r\n\r\nMarilyn Moedinger (41:35.69)\r\nYeah. So like, but what ties it together is that they're owners of it. So they're small business owners. So I do anything that's like an owner who's deeply passionate about the thing. So that's a homeowner that is a owner. So we work with like a brewery or a, or a retail establishment, or we just work with a circus school. teach circus performers. like you, you have to, have to get in there and understand what their needs\r\n\r\n\r\nYou have to understand them and you have to understand like they have really tight budgets. You have to, you have to, so that kind of person in a highly regulated environment who values it and who cares about what they're up to. That's not everybody.\r\n\r\n\r\nNik (42:20.609)\r\nOkay, so you have a decent sort of customer profile or ICP. How do you acquire those customers right now? How are you getting them? How are you finding\r\n\r\n\r\nMarilyn Moedinger (42:30.146)\r\nThe vast majority of word of mouth. So at this point, after 10 years of business in Boston, we just, have a really good network of people who are like, I heard of you from so and\r\n\r\n\r\nNik (42:40.835)\r\nWell, so you're not doing Facebook, Twitter, Instagram, Google ads.\r\n\r\n\r\nMarilyn Moedinger (42:46.004)\r\nNo ads. Architects don't really advertise.\r\n\r\n\r\nNik (42:49.677)\r\nWhy is that? Is there not an opportunity to advertise or this just kind of been the industry?\r\n\r\n\r\nMarilyn Moedinger (42:55.008)\r\nIt was disallowed for a long time according to our code of ethics. Yep. So we weren't allowed to advertise. it's a whole story. You know, actually, I'm not really sure. But culturally, it's still very ingrained. So architects, like you might take out a page ad in Dwell Magazine. But then that's a national magazine. you're like, are you not going to get? So you might take an ad out in like Boston Home Magazine or something.\r\n\r\n\r\nNik (43:04.467)\r\nup until when we said a long time like up until\r\n\r\n\r\nNik (43:23.929)\r\nDude, makes, Marilyn, that makes so much sense because I feel like 99 % of the people that I talk to when they're like, wanna build a custom house or I wanna kitchen remodel or whatever. Nobody knows the process. like, well, what do you have to do to do that? I don't really know. I think I'm gonna talk to my general contractor. And so if architects have had this code of ethics where they don't advertise, of course people are gonna be ignorant to how the process works, because you're not even advertising how it\r\n\r\n\r\nMarilyn Moedinger (43:24.886)\r\nGenerally, not\r\n\r\n\r\nMarilyn Moedinger (43:54.732)\r\nSo then people like me take to social media and try to explain. So that's why on social media, I don't want to just hang out with architects. In fact, I don't usually. In social media circles, I'm hanging out with developers and owners and contractors, because those are the people who need to know about what we do, not other\r\n\r\n\r\nNik (44:12.913)\r\nAre you doing SEO? Are you doing any of that stuff? You know what would be really good for you? Have you ever heard of Google My Business, where it's now Google Business\r\n\r\n\r\nMarilyn Moedinger (44:23.018)\r\nNo, sounds useful.\r\n\r\n\r\nNik (44:24.569)\r\nOkay, go listen to the episode that I did with Buddy Rothmahl. I don't remember what episode it was, but it was, I don't know, 31. And that's his whole business. So I wrote, I wanna go find it really quickly. I'll edit this part out. In fact, I'm gonna... Are you good to go another 10 minutes? Okay. So Buddy's whole business is this thing called Google Business Profile. Anytime you Google something,\r\n\r\n\r\nMarilyn Moedinger (44:42.742)\r\nYeah, absolutely.\r\n\r\n\r\nNik (44:54.945)\r\nThere's the business profile that pops up on the right hand side. You've seen it where it's like hours of operation, where it is, what they sell, those types of things. Here it is.\r\n\r\n\r\nMarilyn Moedinger (45:03.297)\r\nYeah.\r\n\r\n\r\nNik (45:10.307)\r\nSo this is the freaking crazy part to me. I didn't know this. It allows you to access Google Maps, right? So because we Google search for things that pops up, but it's becoming more and more popular where it's the first link that pops up. People are looking at the Google business profile. They're looking at reviews. They're looking at hours of operation and you can actually post.\r\n\r\n\r\ninformation on that that's not typical information. It looks like a post, but 50 % of purchase decisions are being made, or at least informed by what people see as the reviews and the credibility of your business, right? So go listen to that episode. But I think I think you'd benefit a lot from that. And it's not the traditional of, I'm going to pay for ads, or I'm going to do a bunch of social media marketing. It's literally just optimizing your profile.\r\n\r\n\r\npictures, information, et cetera. So I think you would crush it at that. also, I am just obsessed with this idea of you like quickly building trust and a network of, I don't know, franchisees around the country who are like, and franchisees is even the wrong word, but just able to execute on the ground.\r\n\r\n\r\nyour vision is the wrong word, but how are you thinking about building out a network as your business grows and scales?\r\n\r\n\r\nMarilyn Moedinger (46:37.44)\r\nWell, so there's the reality of architecture practice law, which is where the conversation goes womp womp, is that a lot of the really creative ideas that you might be talking about or thinking about run up against architecture practice law pretty quickly. things like I can't, it's hard for me to recommend architects. you're not supposed to do that kind of stuff because then you're, if something goes wrong, then you know, but she recommended that. So it gets a little dicey.\r\n\r\n\r\nIt's more like if it's a private conversation and I'm like, yeah, they're really great or whatever. But it can be difficult on that front. You also, in certain states, can't even say that you offer architectural services until you're licensed in that state. So I can't even say I'm an architect. I have to say I'm an architect licensed in the states of Pennsylvania, Massachusetts, and Maine. And if I were to do a project in North Carolina, I would\r\n\r\n\r\nof course get licensed first, but I am not soliciting work here until, know, so blah, blah, blah, blah, blah. So there's a lot of that. But, you know, to get back to the fun part of your question, the, you know, I do have some national network at this point, and I've talked with some of my good friends who are actually pretty well positioned around the country about how we would do that, how we would set up kind of our own referral club, basically, that would be an\r\n\r\n\r\nthat isn't just a random person. So I would feel comfortable recommending them. We would set it up in a sort of, in a much more formal way. The thing is that like someone calling me, unless I have a really big national reach, then what am I, I'm going to refer them to my friend in Birmingham, Alabama. Like it's, it's, it's like kind of funny. So what\r\n\r\n\r\nNik (48:19.149)\r\nNo, I know.\r\n\r\n\r\nIt had to be that the market specific, but sorry, finish that.\r\n\r\n\r\nMarilyn Moedinger (48:26.166)\r\nWell, just what I've resorted to is to say, what I'm going to do is build expertise and trust online. And that will lead to good things, right? Like that's as far as I've gotten. And that has, well, that is, and then as that leads to the consulting stuff, cause you know, kind of unpacking, like I'm going to set up a referral network. I'm going to set up this franchisee thing or I'm going to, it's just not how the business works. It's not, and what I'd like to unpack is, it not how the business works today? Because we just haven't cracked the nut.\r\n\r\n\r\nOr is it not how it works today? Because there are legit headwinds that you really can't do it. And I would love to figure\r\n\r\n\r\nNik (49:02.243)\r\nHere's what I think would be cool. And you can tell me this is a terrible idea. It would be a train the trainer model. So people start following you, Marilyn, to understand how you do what you do with the quarterbacking everything. And then you're training them, right? They're a part of your network, they're part of your community, whatever it is. You have yearly conferences or quarterly conferences where people come together and you guys all talk about best practices in your local markets.\r\n\r\n\r\nhow you help either homeowners or business owners who are building their industrial projects navigate the world of architecture and general contracting. And you sort of build out this new ethos and network of individuals who are really just there to be the advocate for the homeowner. And then you don't have to worry about being licensed in all those states. You're working through people who are similar to you that can actually be the quarterback that understand everything\r\n\r\n\r\nthe general contracting to the estimating to the architecture to the fulfillment of it. I think that would be a really interesting take on it.\r\n\r\n\r\nMarilyn Moedinger (50:08.674)\r\nThere are things that exist like that. So Entrez Architect actually was founded probably about 10 years ago, entrepreneur architect. And that's Marc LePage. And he's like super passionate about that idea. He does have a yearly conference. He does have these mastermind groups. He does have all that stuff. So there are people who are doing that kind of thing. But it's not monetized in the same way you're talking about. So I think there's an interesting kind of way.\r\n\r\n\r\nNik (50:23.779)\r\nYou're better.\r\n\r\n\r\nNik (50:35.097)\r\nAll right, well, do you mind if we end this conversation with some rapid fire questions? All right, what do you love about this business?\r\n\r\n\r\nMarilyn Moedinger (50:40.034)\r\nLet's do\r\n\r\n\r\nMarilyn Moedinger (50:43.614)\r\nI love getting to be a problem solver in physical space. I love it. You know, working on physical things. And then I love making beautiful spaces that people walk in and they feel the space. Like I thought of that in my head. I marshaled it. I worked with a team of amazing people. And now like people have the Christmas morning in there. it's so good. I love\r\n\r\n\r\nNik (50:47.341)\r\nHmm. That's awesome.\r\n\r\n\r\nNik (51:07.531)\r\nThat's cool. Yeah, that is a very interesting\r\n\r\n\r\nOkay, what do you hate about\r\n\r\n\r\nMarilyn Moedinger (51:15.05)\r\nwell, a lot of what we've talked about today kind of leads into that is sort of the having to constantly explain what we do. So by the time I'm done explaining what I do and why it's important, then I have to start with my sales pitch all over again and say, and here's why runs the most good or here's why. Like it's just a lot to get to the point of like, there's just a lot of explaining. So, so that's not super fun. And then personnel stuff, we're, facing a pretty serious shortage of,\r\n\r\n\r\npeople in construction and architecture, and it just makes it really challenging.\r\n\r\n\r\nNik (51:47.609)\r\nThat's why I think you'd crush it on video. There's such a dearth of education that if you start putting out that type of content, people will eat it up. And hopefully over time it makes your job easier because people are going to be coming to you. They're like, I watched your videos. I totally understand that part of the process. I just want to use you for X. And it's like, cool. I can cut out all the education piece and we can just get down to the business part. What industries are you the most jealous of right\r\n\r\n\r\nMarilyn Moedinger (52:12.258)\r\nI mean, I think this is a fairly common answer, but folks, it can be a little bit more remote. I mean, I run a business where I work in two cities that are not connected to each other. So Lancaster, Pennsylvania, Boston, Massachusetts, I work in both places. So I am somewhat remote, but when it comes down to it, I can't not be on the job site. Like that's my work. can't, I meet with my clients remotely a lot, even when we're all in Boston, because getting across town is really difficult.\r\n\r\n\r\nNik (52:16.887)\r\nNo. No.\r\n\r\n\r\nMarilyn Moedinger (52:40.904)\r\nIt's still like, still have to, and it's very jurisdiction dependent. Like I have to go to the meetings in the town. Like I have to fly in and go to the zoning meeting. you know, let's go.\r\n\r\n\r\nNik (52:51.897)\r\nThat's a pain. Okay, last two questions. First one is, if you have two hours in your day and you don't have any personal or family responsibilities, you don't have any work responsibilities, you can do whatever you want. What are you obsessed with right now? What are you spending your time\r\n\r\n\r\nMarilyn Moedinger (53:09.858)\r\nBoy, I mean just learning things so I love learning about space so there's my rock in the background. We're on video Yeah, it's true We can boldly go or no one has gone for it so So I love learning about the space race but Partially because of all the space stuff and it's super cool, but also like the organizational stuff like how do\r\n\r\n\r\nNik (53:18.401)\r\nIt's the final tense here.\r\n\r\n\r\nMarilyn Moedinger (53:36.428)\r\ndo that? Like, how do they coordinate all these people working on a highly specified thing? So it's like, applicable. I love reading about history. I spend a lot of time. I live on a farm. I spend a lot of time outside doing farm stuff. So, yeah.\r\n\r\n\r\nNik (53:50.423)\r\nAmazing. Is there anything in this interview that you wish I would have asked or that you wanted to say that I\r\n\r\n\r\nMarilyn Moedinger (54:00.728)\r\nboy. Well, I don't know anything specific other than to say that architecture is a very tough way to make money. And I just, I could see ways to make that better. And I think a lot of it has to do with helping architects be better business people. Like people who are creative often say that they're\r\n\r\n\r\ngood business people or they're not good at numbers. And that's just not true. Like creativity spans all kinds of things. And like, I just wish more architects would understand like how fun business is, like how it's such a fun creative endeavor. Like you're testing things, you're trying things, you're iterating, like, well, that didn't work. Let's try this other thing. Like, and to be a little bit more loose and fun with it. And I, and also deadly serious, right? Like I'm running a business. have payroll. Like I have obligations. Like I'm not goofing around. I'm not independently wealthy.\r\n\r\n\r\nBut I think that that sense of creativity around business is something that I wish more architects would have. And then vice versa, more business people would understand the value of a creative mind, of a builder mind, and not just make it all about\r\n\r\n\r\nNik (55:16.601)\r\nI love that. What advice would you give to yourself in 2013 before you took the leap to start your own business?\r\n\r\n\r\nMarilyn Moedinger (55:24.162)\r\nto, to not be afraid to spend more money on the business. I was really like, I remember when I moved into a coworking space, $300 a month. And I was like, this is the craziest thing I've ever done. And when I did it, it just like ramped me up in terms of productivity. And I met a bunch of people and it was great to like leave my house and get dressed and go to the things like that.\r\n\r\n\r\ncan have outsize impact on the business. And I think it's a lesson I still need to learn, to not be afraid to spend a little bit of money on the business in those ways.\r\n\r\n\r\nNik (56:08.707)\r\nYeah. I love that. I love that. Where can people find you? Where's the best place to learn more about\r\n\r\n\r\nMarilyn Moedinger (56:16.914)\r\nSo Twitter is where I'm most active. So at MW Modinger. My website is pretty extensive. So that's RuncibleStudios .com and RuncibleStudios .com.\r\n\r\n\r\nNik (56:26.169)\r\nSay it one more\r\n\r\n\r\nRuncible Studios,\r\n\r\n\r\nMarilyn Moedinger (56:32.002)\r\nAnd so I have a lot of resources on there. You can learn about my newsletter, you can learn about my consulting. You can see all of our work. And that's sort of like the clearinghouse for all of our other social media and everything\r\n\r\n\r\nNik (56:44.313)\r\nOkay, awesome, Marilyn, this is fantastic. I can't wait to have you back on after you've built a network of people around the country. It's gonna be awesome. All right, everyone.\r\n\r\n\r\nMarilyn Moedinger (56:52.406)\r\nGood. Thanks.",
  "metadata": {
    "duration": "",
    "date": "2024-08-23",
    "platform_source": "Google Drive"
  }
}