{
  "episode_number": "68",
  "episode_title": "How to Go From $260K in Debt to a Millionaire, in 5 years with Cori Arnold",
  "guest_name": "Cori Arnold",
  "business_name": "Personal Brand",
  "transcript": "﻿Nik (00:00)\r\nCorey, welcome to Nekonomics. It's pleasure to have you.\r\n\r\n\r\nCori Arnold (00:03)\r\nHey Nick, thank you so much for having me.\r\n\r\n\r\nNik (00:05)\r\nAll right, let's just hop into it. Tell me a little bit about your business and how you currently make money.\r\n\r\n\r\nCori Arnold (00:11)\r\nYeah, so my business, I have a personal brand on Twitter or X, as well as I'm starting to build it on threads. It started in 2021. I currently promote products and I don't just promote anything. So I have relationships with a lot of the founders. I actually use most of the products that I promote, but that is my number one revenue source.\r\n\r\n\r\nNik (00:31)\r\nTell me a little bit, me some like an idea of context of the size of your, I guess, not business, but platform. You said you're on Twitter, you're starting to grow on threads. Like, what does that mean? How many followers, how much reach?\r\n\r\n\r\nCori Arnold (00:45)\r\nYeah, yeah. So on Twitter I have 207 ,000 followers. I started in 2021, so it's been about three years. And then on threads, it's very early. So I think I'm under 4 ,000 followers at this point.\r\n\r\n\r\nNik (00:57)\r\nOkay. All right. Well, I'm gonna ask a million questions about that stuff because I love talking about that. But before I do, tell me about you. Where are you from?\r\n\r\n\r\nCori Arnold (01:07)\r\nSure, I'm actually from the Midwest in the US. I grew up with not a lot of resources, so that's kind of part of my whole story. And I love it. So I lived in Los Angeles actually for four years in my 20s, decided to move home. Just really happy about kind of my life today, yeah. I was actually on the West side. Yeah, it's so funny. Now I'm near UCLA, the little city. What's the little city there?\r\n\r\n\r\nNik (01:23)\r\nYeah. Where were you in LA?\r\n\r\n\r\nJust wait!\r\n\r\n\r\nit. Yeah, Brentwood Westwood. Westwood. Yeah. That's awesome. So I went to USC undergrad and I got my MBA from UCLA. So I did you. When were you there?\r\n\r\n\r\nCori Arnold (01:37)\r\nBut Westwood, that's it, Westwood. Yep. So I lived there for about four years.\r\n\r\n\r\nme too actually. I got my MBA. Yeah, I graduated in two. Yeah, -huh. That's so funny. 2008 to 10. graduated technically in the class of 2011.\r\n\r\n\r\nNik (01:56)\r\nTell me.\r\n\r\n\r\nTell me you love that you missed Diddy Reese. Please tell me you missed Diddy Reese. Do you know Diddy Reese? no, thank you. Diddy Reese, Diddy Reese is this place right in Westwood, just south of campus. And like right next to there is like the Fox Theater where they have movie premieres. Anyways, Diddy Reese is this ice cream place where they sell cookie ice cream sandwiches. They bake the cookies there, they sell the ice cream. And they used to be like a buck 50 a sandwich. And now they're like,\r\n\r\n\r\nCori Arnold (02:04)\r\nDid he Reese? No.\r\n\r\n\r\nOkay. yep.\r\n\r\n\r\nMmm.\r\n\r\n\r\nthat, that's so funny. Interesting. I missed it. I missed something and I was right there too. That's hilarious.\r\n\r\n\r\nNik (02:28)\r\n250 a sandwich and you know, everybody's up in arms, but it's cash only there's always a line out the door. man. Yeah, but\r\n\r\n\r\nOkay, next time, next time you go back, you got to like look out for Diddy Reese. It's fantastic. Yeah, yeah. So for you, you grew up in the Midwest. You talk a lot about obviously about money, managing your money, managing your finances. Has that always been a thing for you?\r\n\r\n\r\nCori Arnold (02:43)\r\nthat's awesome. That's good to know. Yeah, thank you.\r\n\r\n\r\nYeah, it's interesting. So in high school, was actually the, I was kind of the math nerd. I've always been good with numbers. It just, they come naturally to me. So I was supposed to be the one that was good with money out of my little friend group in high school. And, you know, I have a friend who's a nurse. I have one who's in healthcare and I guess they're both in healthcare. But, and I was kind of the one who always wanted some type of finance accounting path, which I did do from a corporate standpoint. And then,\r\n\r\n\r\nI thought I was supposed to be good with money, but I wasn't. I was not that good. I liked debt. I liked instant gratification. If I wanted something, I thought, wait and save up for it? You can just go sign some papers and you get what you want immediately. Obviously, that caused a lot of problems in my 20s. I took out quite a bit of debt from my undergrad. I bought some cars that I couldn't afford. I got a lot of debt from UCLA as well. So yeah.\r\n\r\n\r\nNik (03:44)\r\nMm\r\n\r\n\r\nCori Arnold (03:53)\r\nSo money has always kind of been there and then finally early 30s I got serious and I really turned it around.\r\n\r\n\r\nNik (03:59)\r\nSo I, for whatever reason, have a sickness. I love tracking things, love tracking things. And since January of 2017, I have religiously tracked my net worth, my spending, my balances and all of my accounts. But I was never somebody who was financially smart, I guess you could say, until I got into my 30s as well. But I've always loved to track things. I've always just loved to see, am I making progress? Am I getting any better? How am I doing compared to other things?\r\n\r\n\r\nCori Arnold (04:14)\r\nThat's awesome.\r\n\r\n\r\nNik (04:29)\r\nwhat changed for you? Like how did you make the switch from, I love the instant gratification, I'm gonna buy that, to wait a second, the math's not mathing, I need to change.\r\n\r\n\r\nCori Arnold (04:40)\r\nExactly. Yeah, actually I was at Anderson when this happened at UCLA. And by the way, I did the night program. So I was working full time. So I was still making money. Awesome. I was still making money, but I was going into a hole like every semester, every quarter. And I had actually looked at my net worth. So I knew it was negative. I knew it was getting worse as I continued to take out student loans. But like a year, yeah, go ahead. Yeah, the worst.\r\n\r\n\r\nNik (04:48)\r\nSame.\r\n\r\n\r\nCan you tell me what your net worth was at the time?\r\n\r\n\r\nCori Arnold (05:08)\r\nThe worst point was like negative $99 ,000. So I almost hit a six figure negative network. But luckily that was kind of the turning point. That was the bottom. And what actually turned my brain around and made me act differently was I just took that net worth. I took the debt. I multiplied it times the interest rates of each account. And I realized I was paying almost like 16 grand in interest every year. And that was actually my wake up call because that was a very big\r\n\r\n\r\nNik (05:11)\r\nTrue!\r\n\r\n\r\nmy gosh, okay.\r\n\r\n\r\nmy gosh.\r\n\r\n\r\nCori Arnold (05:38)\r\nportion of my salary at the time, my take -home pay. It was almost a third of my take -home pay at the time actually. So I realized like how much money I was giving to my lenders and it just actually made me physically sick. that luckily I had that moment because that was the moment where I just decided to kind of turn everything around.\r\n\r\n\r\nNik (05:57)\r\n$16 ,000 a year in interest? Okay, so what was the debt? Like the debt you had, was it all credit card? Like that's a lot of interest.\r\n\r\n\r\nCori Arnold (06:00)\r\nYes, yes, I realize.\r\n\r\n\r\nMm -hmm. Yeah, so 140 ,000 was student loans, 22 ,000 credit cards. And then this is kind of, this is gonna sound crazy, especially to your viewers who live in larger cities, but I actually had two properties that totaled the 98 ,000 for debt. So you would think, why didn't I just sell one of those properties and be done? I live, like where I grew up in the Midwest, it's very, very rural. So I had purchased a duplex for 68 ,000. I ended up\r\n\r\n\r\nand I owed like 50 on it. I ended up, I had to sell it for a loss, 60 ,000. You would have thought like an MBA can deal with real estate and make money with real estate. And I thought everyone made money with real estate, but I paid too much for it. It was in a rural area. You don't get very good tenants in a rural area. It was a duplex as well. And so what I learned was I need to take a hit because that was kind of an ego hit.\r\n\r\n\r\nI lost eight grand, but the good thing is I got rid of the debt, plus I had a little extra to put on the other debt. So that was a huge help.\r\n\r\n\r\nNik (07:09)\r\nSo my little sister just got divorced. Unfortunately, she just got divorced. She's mid -30s and she came up for the weekend with her girls. It was like awesome trip. And we started talking about finances and she was telling me, she's like, yeah, I'm looking or I'm reading a lot more. I'm learning a lot more. But she just had no financial literacy, like no financial basis. She started listening to this woman who has a podcast called, I think the Financial Feminist. I don't know if you've heard of, anyways.\r\n\r\n\r\nCori Arnold (07:13)\r\nYeah.\r\n\r\n\r\nMm -hmm.\r\n\r\n\r\nOkay, I've seen her on,\r\n\r\n\r\nNik (07:39)\r\nBut, you know, very similar strategies to what Dave Ramsey teaches, right? Like get out of debt, have some emergency savings, start putting money away, yada, yada, yada. But what I have found interesting is that at least when I was growing up, was boys focused a lot on the finances. Girls weren't really geared that way. But there also weren't a lot of resources even 10 years ago.\r\n\r\n\r\nCori Arnold (07:42)\r\nMm\r\n\r\n\r\nNik (08:06)\r\nfor people to go and access like podcasting, YouTube, the internet has really opened the door for people to go out and like understand how finance works. What was your process? Like how did you get to where you are now in terms of knowledge? How did you get up to speed?\r\n\r\n\r\nCori Arnold (08:09)\r\nyou\r\n\r\n\r\nYeah, well, I will admit I actually took Dave Ramsey's financial piece university in my early 20s because I had a cousin. I liked it. I didn't really believe him at the time because I think I was 22 years old. I was making like 20 grand a year. And, you know, he said you can save up for a car. And I just couldn't believe that that was true. I know that's different today. I know that is true today. But, you know, I just couldn't like, it's funny how you have these beliefs. And when you don't open your mind a little bit, you don't\r\n\r\n\r\nNik (08:27)\r\nThat's all. Did you like it?\r\n\r\n\r\nCori Arnold (08:52)\r\nlet new knowledge in. I kind of had it in the back of my mind. The other thing, it's funny that you say you're a tracker because I am a very big nerd when it comes to tracking things. So that was really good for me. So was able to list the debt. I started listing my expenses, my income. I kind of created a plan. And I do like Dave Ramsey, but I actually did what they call is the debt avalanche instead. I really saw how big of an influence the interest was for me. And for some people, it's not a\r\n\r\n\r\nas big of a deal, but for me it was like 16 grand a year, so I had to figure out how to bring that down.\r\n\r\n\r\nNik (09:24)\r\nWill you? Yeah, will you explain that? Because there is a difference. There's like the death snowball and then there's the avalanche. What is the difference between those two?\r\n\r\n\r\nCori Arnold (09:32)\r\nSure. Yeah, the avalanche is when you focus on it. So you list your debt's highest interest rate to lowest interest rate, and you're really focused on getting the interest mitigated. The debt snowball is when you actually list your debts from smallest balance to largest balance. And then what you do is you win faster because you can pay off those smaller loans faster. Overall, the debt avalanche is a faster way to get rid of your debt because you're paying less interest overall. But I\r\n\r\n\r\nBoth ways work. I've seen both ways work. Yeah.\r\n\r\n\r\nNik (10:01)\r\nYeah, Dave Ramsey's thing with the debt snowball is like, there's the psychological component to it where you're you're getting wins under your belt, like, cool, I paid off this debt, I paid off that debt. Great. But I do think for, like, for me, I would have gone with us with the avalanche as well. Because in my mind, it's like, well, no, that that's just the biggest bang for my buck. If I'm to go ahead and do this. So I get I get why both of them happen. Do you still like Dave Ramsey?\r\n\r\n\r\nCori Arnold (10:06)\r\nMm -hmm.\r\n\r\n\r\nI do, it's funny, I still listen to this podcast and my friends are like, why do you still listen? But it's funny, it's like daily inspiration. I don't listen every day, but you know, when I do, it's inspirational, so I'm good. Yeah.\r\n\r\n\r\nNik (10:30)\r\nReally?\r\n\r\n\r\nI love Dave Ramsey. I think he was the first person that I ever listened to about personal finance. And it was like mind blowing. I grew up incredibly poor. I knew nothing. And so I'm like hearing this guy talk about finance. I have stopped listening to him since just because I feel like every episode is some version of, Dave, I got a question for you. I got a house with a mortgage of 400 ,000, four boats and three cars. I'm $785 ,000 in debt and I make $20 ,000 a year. What should I do?\r\n\r\n\r\nCori Arnold (10:42)\r\nMm -hmm. Yeah.\r\n\r\n\r\nNik (11:06)\r\nAnd it's like, and Dave just goes, you're gonna be in a lot of beans and rice. So, yeah, I think and you know, he advocates like no debt ever, which I think can be a good philosophy. But I, you know, I'm not of that ilk. But anyway, so yeah, I think Dave has a great he's like, the financial peace university in particular has played a great role in many people's lives and improving their lives by organizing their finances. Okay, so 2010.\r\n\r\n\r\nCori Arnold (11:07)\r\nThat's very true.\r\n\r\n\r\nYeah, yeah, yeah.\r\n\r\n\r\nNik (11:35)\r\nyou are $100 ,000 in debt and you start tracking.\r\n\r\n\r\nCori Arnold (11:38)\r\nMm -hmm. It started like 2011, maybe beginning of 2012. I moved back to Ohio in 2011, and I officially graduated Anderson like December of 10. So yeah, mostly 11. Mm -hmm.\r\n\r\n\r\nNik (11:52)\r\nOkay, so 2012 you're like, well, 10 years ago, I took this course with Dave Ramsey. What did he say? How did it like, is that what you started doing? Or were you? Did you all of sudden start reading like\r\n\r\n\r\nCori Arnold (12:03)\r\nNo, it was more like, I'm never gonna get wealthy and I'm never gonna retire early if I don't do something. That was more my thought. Like I gotta change something because how I've been living last 10 years is not working. Like obviously I'm in a hole. So that was really the thought like I've messed up.\r\n\r\n\r\nNik (12:24)\r\nHow much were you making?\r\n\r\n\r\nCori Arnold (12:30)\r\nYeah, my gross at that time was about 78, I think 75, something like that. Yep.\r\n\r\n\r\nNik (12:34)\r\nOkay. And did you have, you know, kids, spouse at the time? Okay.\r\n\r\n\r\nCori Arnold (12:39)\r\nNo, no, I was single, totally single. So that was that was actually a benefit because I really had a lot of control over my spending, obviously, and I worked part time actually got a part time job at Lowe's on the weekends. So I did some things like I wouldn't want to do them today, but it was worth the sacrifice, you know, in the short term.\r\n\r\n\r\nNik (12:56)\r\nand you were only $100 ,000 in debt. I'm just thinking like you go to UCLA and is.\r\n\r\n\r\nCori Arnold (12:59)\r\nWell, 140 student loans, 22 credit cards. So was 260 in total with the real estate. Yeah. Yeah, sorry. My net worth was negative.\r\n\r\n\r\nNik (13:08)\r\ngeez, Louise. All right. So your first step, your first step with the debt. Yeah, yeah, right. Got it. Got it. Got it. Okay. Sorry. I'm a little stupid. So I finally caught up with you. Your net worth was negative 99 ,000. Your debt was 240 ,000. What was the first thing that you did to start chipping away at that debt?\r\n\r\n\r\nCori Arnold (13:22)\r\nExactly. Exactly.\r\n\r\n\r\nYeah, I okay. So the first thing I did was I got that duplex listed and I made the wrong I made the wrong decision though on the realtor. So it didn't actually sell for like over a year. And that's why I ended up selling it for a loss. Yeah, I just sat there. So you know, you look you live and you learn and that was fine. That was number one. Number two, I started working part time. And then number three was I started refinancing everything. So there are some pretty cool things.\r\n\r\n\r\nNik (13:41)\r\nno.\r\n\r\n\r\nCori Arnold (13:58)\r\nthat you can do. And I know in this environment with rates a little bit higher, there's probably some of these things you can't do. But there's one thing that you can do, and I know it because I still get these offers. There are 0 % credit cards. And you have to be very careful. And it's good that I'm a nerd and I track things. So anyone that's listening and does this, make sure you understand what you're signing up for before you do it. But over the five -year journey that it took to pay off the debt,\r\n\r\n\r\nI paid about $10 ,000 off it or saved about $10 ,000 in interest. So that was very, very big.\r\n\r\n\r\nNik (14:32)\r\nby doing this year, By utilizing these like, basically what they are is their promos, right? Their introductory rates for six months or a year, but you have to be careful about closing them. also can affect your credit because any new credit lines opened or closed within a period of time, but you weren't necessarily worried about the credit knock. You just wanted to get out of debt.\r\n\r\n\r\nCori Arnold (14:45)\r\nMm -hmm.\r\n\r\n\r\nExactly.\r\n\r\n\r\nExactly. wasn't so it does affect your credit score, but not majorly. And it's not long term, assuming that you pay everything on time. So yeah, so was great. So at one point, I think I had four five of those open. So I was literally like tracking every paycheck, every credit card. And it was good. So I saved a ton of money that way. also, one thing that people don't think about, and this might be doable today, I had a credit card at like, it was either 13 or 15%, something like that.\r\n\r\n\r\nNik (15:17)\r\nMm\r\n\r\n\r\nCori Arnold (15:17)\r\nI refinanced my car, which was not worth much. I think it was worth 11 ,000 at the time. So I took like a $10 ,000 loan on it because I didn't know anything on it and paid off a credit card. So I went from like a 13 % rate to a, I think it was six or 7 % rate. And then I also refinanced my house, which is not relevant today, obviously, but I just did things like that just to really mitigate that interest, just to help me like feel better about how much money.\r\n\r\n\r\nNik (15:28)\r\nNo.\r\n\r\n\r\nYeah, no, you were. I mean, were playing. There's a big deal has been made of this recently. But you've heard of the carry trade between the Japanese yen and the dollar. okay. I'll briefly briefly explain it. Basically, Japan has had zero percent interest rates, sometimes even negative for borrowing for a number of years. So what people would do is they would take they would\r\n\r\n\r\nCori Arnold (15:55)\r\nI have not heard of that.\r\n\r\n\r\nOkay.\r\n\r\n\r\nNik (16:10)\r\nput some assets into yen, they would take a loan out, no interest, and then they'd go and put it into US treasuries, right? And so the US treasuries are generating 5 % a year. They've got a 0 % interest rate with the Bank of Japan. And so they're netting that 5 % delta. Sometimes they put it in real estate. Yeah, sometimes they put it other places. The problem is when it starts to unwind, that there can be potential issues. Anyways, but the point I was making with that is you did a similar thing where you were just seeking\r\n\r\n\r\nCori Arnold (16:18)\r\nInteresting.\r\n\r\n\r\nYeah.\r\n\r\n\r\nNik (16:40)\r\nwhere's the lowest place that I can get a loan from. And I'm to go ahead and just refinance creatively into these other spaces, which I think is really, really cool.\r\n\r\n\r\nCori Arnold (16:47)\r\nYeah, yeah. And what made the difference? mean, obviously that helped a lot. That was kind of like a bonus. But what made the difference was I really, I kind of leaned in at work. I started to contribute more, volunteered for different assignments. My salary started increasing. And then I also, I really mitigated my expenses. And, you know, I don't recommend like, you can't get rich from.\r\n\r\n\r\nNik (17:03)\r\nExcuse me.\r\n\r\n\r\nCori Arnold (17:11)\r\ngetting or lowering your expenses, but you can really make a difference in the short term if you need to get out of a hole or something. So for five years, I did sacrifice pretty significantly from like, I threw away a Keurig machine that someone had given me because I realized I was spending like 10 to $12 a week on Keurig cups. So that's like 500 bucks a year. I know it sounds crazy today. But you know, it's short term. I don't recommend that. Like I don't recommend anyone live that way for the rest of your life.\r\n\r\n\r\nNik (17:30)\r\nmy god.\r\n\r\n\r\nSo good.\r\n\r\n\r\nCori Arnold (17:40)\r\nBut if you can do it for, I did it for five years, which was pretty crazy, but even like two years just to clean up your mess, it's definitely worth it. Yeah.\r\n\r\n\r\nNik (17:46)\r\nYeah, Dave, Dave has that saying where it's like, do what others are unwilling to do today so you can live like others can't tomorrow. You know, what's interesting is I didn't I didn't hear you say you stopped drinking coffee at Starbucks. I heard that I heard that if you start if you make coffee at home, you just automatically become independently wealthy. But maybe I missed that part. I'm just kidding. That's amazing. So\r\n\r\n\r\nCori Arnold (17:52)\r\nMm -hmm. Exactly.\r\n\r\n\r\nYeah, yeah, pretty lit.\r\n\r\n\r\nNik (18:13)\r\nDuring this time, how long did it take you to go from, you know, stressed out to, I don't know, did you did you get to debt free? Was that your goal or were you just trying to get.\r\n\r\n\r\nCori Arnold (18:22)\r\nYeah, I did actually pay off everything. It took five years to be debt -free completely, so that includes the house. I did sell the duplex and then I ended up paying off that one house in 2016. then, mm -hmm, yeah. Yeah, yeah, it was pretty exciting. And then the co... No, no.\r\n\r\n\r\nNik (18:28)\r\nThat's amazing.\r\n\r\n\r\nStill $140 ,000 worth of other debt or 160 with a credit card debt over five years. That's insane.\r\n\r\n\r\nDid you do the debt free screen? No, okay.\r\n\r\n\r\nCori Arnold (18:49)\r\nNo, I'm good. It's so funny though, because of that, I think the trauma around that whole experience. Like I bought a new house last May and there was a question like, do I borrow for it? And I actually contacted my bank and I was getting ready to do the loan and I started like looking or start, was thinking about applying for the loan. I started doing the numbers and I'm like, my gosh, I cannot pay this much interest. So I zeroed out my brokerage account and\r\n\r\n\r\nNik (19:12)\r\nNO WAY!\r\n\r\n\r\nCori Arnold (19:16)\r\npaid cash for the house. It's crazy. It's so funny how like traumatic events can lead to different choices in the future.\r\n\r\n\r\nNik (19:23)\r\nOkay, well, I'm a nerd too, so I'm gonna freaking push back on that. Like, all right, what would the rate have been that you would have paid on interest?\r\n\r\n\r\nCori Arnold (19:27)\r\nYeah.\r\n\r\n\r\nIt would have been like 6 .5. I know and if you look at what the index funds have done or the market over the last I know\r\n\r\n\r\nNik (19:39)\r\nlike, all right, all right, as long as you know, that's fine. I had a financial advisor once tell me, and he's still our financial advisor, he's like, I was wondering, I had a liquidity event, and I'm like, Okay, how much should I have in cash? How much should I put into the market? Like, what do I do? And he just said, you should have however much in cash helps you sleep at night. So that has been a big philosophy in my life is like, all right, make financial decisions that help me sleep at night. And if that helps you sleep at night, like\r\n\r\n\r\nCori Arnold (19:47)\r\nMm -hmm.\r\n\r\n\r\nThat's true.\r\n\r\n\r\nMm -hmm. Yeah. Yep. Yeah, it feels good. But it doesn't feel good to have a very low Brokery to Kill balance, but I'm getting over that. Yeah. True.\r\n\r\n\r\nNik (20:08)\r\nmore power to you, right?\r\n\r\n\r\nYeah, I mean, it's, it's in that it's in the house and you can you could if you really needed to pull out a home equity line of credit, all that stuff. But alright, so you're working in finance, you've gotten out of debt. At what point did you start messing around with social media?\r\n\r\n\r\nCori Arnold (20:33)\r\nSo 2021, I decided, so this whole time, you know, retire early. How do I retire early? And the definition of retire is not, don't work anymore. It's just resign from my corporate, my corporate job, you know, do something more flexible on my terms, a little more, a few more options. So in 21, I decided, you know what, and I've always had this desire to be an author.\r\n\r\n\r\nNik (20:47)\r\nYeah, yeah.\r\n\r\n\r\nCori Arnold (21:00)\r\nSo I started reading books about like, how do you build a platform? You know, all these generic books. And one of them said, hey, get on Twitter. It's really good to meet people. So I decided to get on Twitter. Four months later, I had 11 followers. I didn't know how to connect with people. I didn't know what kind of content to write. So actually hired a ghostwriter who helped me out a lot. He not only wrote for me, but I got, you know, he was kind of a guide basically.\r\n\r\n\r\nSo he helped me a ton. So then I found, then I started networking. I got a mentor and then I really kind of understood like how to connect with people. And the cool thing is, so about a year ago, I think maybe two years ago, I started getting approached from certain companies. So, so I work with like a financial tracking company, a dividend tracking company, an investing app. So there's all kinds of, there's just so many people you can meet on social network or social media.\r\n\r\n\r\nAnd that's been like the biggest asset for me, these relationships that I've built.\r\n\r\n\r\nNik (22:01)\r\nDude, how much time were you spending on Twitter? Like, was it multiple hours a day or was it once in a while?\r\n\r\n\r\nCori Arnold (22:11)\r\nAt beginning, it was more than now. Well, it's probably about equal. But at the beginning, it was hard because I was also trying to write a book. so every morning, I started getting up at five. So I have about two hours every morning to work on my side hustle, I guess you could call it. And then every weekend, I was spending like four hours every Saturday and a couple hours Sunday. Now, I don't necessarily spend too much time on the weekends. Yeah, go ahead.\r\n\r\n\r\nNik (22:37)\r\nAre you doing this full time now? Like are you full time content creator? No.\r\n\r\n\r\nCori Arnold (22:40)\r\nNo, not quite, not quite. I'm almost there. yeah, between one and four years left in my corporate job. Yeah.\r\n\r\n\r\nNik (22:50)\r\nAll right. Let me ask you, I'm always curious. When you said, you know, I want to retire, have you ever heard of like FAT FIRE or FIRE, right? Financially Independent Retire Early, I think is the name of it. If you were to give me a number, what's your number?\r\n\r\n\r\nCori Arnold (22:58)\r\nMm -hmm. Yeah. Mm -hmm. Yeah. Yep.\r\n\r\n\r\nMm\r\n\r\n\r\nYeah,\r\n\r\n\r\nI was just doing this math actually, because not to evade your question, but there's this thing called substantially equal periodic payments. Have you heard of it? No? Okay. So you can actually take, my biggest asset is my 401k, and you can actually take money out of it early without penalty if you agree, there's some conditions, to take basically the same payment every year from it. So the cool thing is, mine's up\r\n\r\n\r\nMine, I can just tell you, it's around $750, $800 right now. And if that were to hit a million, I think I'm ready. I think I've done the math where I could take enough money each month, cover my expenses. Plus, I mean, I have side hustle income, so I would technically be a little dependent on the side hustle income, which is what scares me. It's so funny because I'm kind of more risky when I look at the stock investments that I make. But when it comes to actually thinking about, you know...\r\n\r\n\r\nquitting this corporate job, I get a little more scared. I'm a little more risk adverse.\r\n\r\n\r\nNik (24:15)\r\nSo I remember, I remember one time I had this conversation with somebody. And most of the time you play this game, like everybody's like, 25 million, like they just throw out some stupid number. And I was in the car with this guy who's, you know, he's, he's on his way to being very successful. And he's like, what's your, I asked him, I'm like, what's your number? And he said 25. I was like, okay. He said, what's your number? And I was like, 2 .25. He's like, what?\r\n\r\n\r\nCori Arnold (24:24)\r\nTotally.\r\n\r\n\r\nMm -hmm. Wow.\r\n\r\n\r\nNik (24:43)\r\nAnd was like, yeah, two, he's like, well, that's very specific. And it's very low. I'm like, well, the way I look at it and like, you know, I walked him through it. I'm like, I could put some money here. I put some money here. And then I, you know, it grows at 8 % a year. And by the time I retire, like it was a very logical number. It wasn't the illogical number. And that's the number you just gave me, right? You're like, okay, logically speaking, this is where I think I can get to. It is funny though, how that number changes. Like that number went from 2 .25.\r\n\r\n\r\nCori Arnold (24:48)\r\nMm -hmm, yep.\r\n\r\n\r\nYeah, exactly.\r\n\r\n\r\nMm -hmm. It is true.\r\n\r\n\r\nNik (25:11)\r\nA few years ago that number was five. And now that number is not five anymore. It is much higher than five. But you you start hitting those thresholds and you're like, it's actually not as much as I thought it was going to be. Doesn't feel that way. Do you do you in your content? Your book, what is it about? What are you writing about? What kind of content you putting out?\r\n\r\n\r\nCori Arnold (25:16)\r\nYeah.\r\n\r\n\r\nMm -hmm. Yeah, yeah. Mm -mm. Agreed.\r\n\r\n\r\nYeah, yeah. It's, it's really all about how to win with money. That's kind of my slogan, win with your money. And it really started with my, that story about going from 260k debt to a millionaire. I officially like hit the millionaire mark in 2021. So yeah, so it's kind of just that journey and like all the lessons that I learned, how sometimes it's harder, you know, you got to put some work in. Also how beliefs affect, affect you. So I kind of\r\n\r\n\r\nlittle all over the place, but really the core message is how to win with your money.\r\n\r\n\r\nNik (26:09)\r\nI referenced my sister earlier and she's very strong. She has two kids. And unfortunately, she has this feeling in her head. She didn't finish college where she's like, I'm so far behind. I don't have a degree. I don't have the corporate job that my friends have. I don't have the house, the car, whatever. And I was talking to her and I'll have to ask her this after this airs just in case she doesn't want this aired. But I'm like, okay, well, what's your debt?\r\n\r\n\r\nHow much debt do you have? She's like, I don't have any debt. And I was like, you don't have any debt? She's like, no, I don't have any debt. I'm like, well, how much is your job? And she told me a number and I was like, I'm like, Faith, you have no idea. You're like ahead of 80 % of your peers just because you have no debt. You can start putting money away. It can start working for you. You're not paying interest on different things. And it was a total mind shift for her, I think to like, I guess I'm not in as bad of a place as I thought.\r\n\r\n\r\nWhat's the biggest thing you see holding people back to financial independence and financial freedom?\r\n\r\n\r\nCori Arnold (27:15)\r\nYeah, actually, that's a perfect example. It's the beliefs and the mindsets in comparison. We see people on social media, they have pictures of their best life or their best events or whatever, but it's not necessarily real. And the same thing goes for if you're working in an office or working somewhere where you show up to work each day. You can drive a fancy car, you can wear the best clothes. It doesn't mean that you are wealthy though, right? How much debt do you have against all that stuff?\r\n\r\n\r\nSo yeah, I think, and the other thing is beliefs. I was just talking about this the other day. Like we get these crazy beliefs in our head and they stick around with us for decades and they kind of become like concrete. just, they're stuck. And what I'm talking about is like, you know, I can't retire till I'm 65 or 67. Debt is normal, which, you know, there's a lot of people that have debt, but it doesn't mean it's a good thing.\r\n\r\n\r\nNik (28:08)\r\nIt doesn't mean it's normal.\r\n\r\n\r\nCori Arnold (28:09)\r\nYeah, exactly. So there's just so many beliefs. know, millionaires inherited their money. That's a common one. Where actually, no, you can become a millionaire. Like, I really sincerely feel that everyone's got the power to do it. As long as they put in the work, they're consistent and they're patient. So\r\n\r\n\r\nNik (28:28)\r\nYeah, I got a calculator out for her and I was like, hey, if you put $20 ,000 a year away, 8 % a year, like this is where you'll be by the time you're 65 or she was like, her mind was blown. All right, here's my last question on it. Cause I want to get your opinion. I think that there are people like you and I who get, who nerd out on, okay, where are, where are the hacks? I don't know if that makes sense or not, but like, where are the opportunities for me to save or to invest or\r\n\r\n\r\nCori Arnold (28:30)\r\nMm -hmm. Mm -hmm. Yep.\r\n\r\n\r\nNik (28:58)\r\nYeah, maybe I can save a little bit of interest here, etc. But then there's then there's the other side of people who are like, I'm in a financial bind. I'm just going to go earn it. I'm gonna I'm gonna start a company or I'm gonna sell or like whatever it is. And I'm always jealous of those types of people a little bit, but\r\n\r\n\r\nCori Arnold (29:04)\r\nYeah.\r\n\r\n\r\nNik (29:23)\r\nDo you see it the same way as me? Like, do you think that there are kind of some different types of people where like, this may work for us, but then there are other, maybe more risk seeking people where they just figure out how do I earn more as opposed to controlling my spending? Or am I just an idiot?\r\n\r\n\r\nCori Arnold (29:25)\r\nMm -hmm.\r\n\r\n\r\nMm hmm. Yeah, yeah. No, definitely. I definitely see that. You know, there's this coupon couponing show on to or I don't know if it's still on or maybe it's called cheapskates or something, some show that used to be on TV. And they would talk about like how all the strategies that these guys would do and they would spend so much energy like saving $5. And I always think just go get a job like I mean, you can earn you can earn five times that amount an hour versus like spending a whole day strategizing how to\r\n\r\n\r\nNik (29:56)\r\nI'm\r\n\r\n\r\nCori Arnold (30:02)\r\nyou know, save $5. So yeah, I definitely see it in people. And, and I, I like to think that I'm the one that just, you know, put your head down and get to work. It's not fun always, but, you know, do it. And I also like, like, of course, there's nice to, it's nice to have hacks. But you have to know that you can't just depend on the hacks all the time. They aren't, they probably aren't the road to, you know, really long -term success. It does take work.\r\n\r\n\r\nNik (30:02)\r\nTotally.\r\n\r\n\r\nMm\r\n\r\n\r\nCori Arnold (30:30)\r\nAngela Duckworth, think, you know, in her book, Grit, she talks about like, effort is worth double than talent. So you don't really need that much talent, you really have to be able to put in the work. And I think that's where a lot of people, everyone wants it easy these days. And that easy doesn't really get you anywhere.\r\n\r\n\r\nNik (30:46)\r\nsomebody listening to this who maybe they're in debt or maybe they're trying to figure out how do I secure my financial future beyond get out of debt. What is like the one or two tools in your tool belt that you think anyone and everyone should use that are just fantastic for building financial independence.\r\n\r\n\r\nCori Arnold (31:08)\r\nYeah, I think the first one actually is to think about your end goal. Maybe this sounds a little weird when you think about financial independence, but you know, what do you actually want? Like if you were 80, what would be your ideal life? Like what would you have done through your life? And then kind of work backwards. And that's what I tell anyone that I talk to, because sometimes they'll ask me about situations, what should they do? Well, I'm like, you know, what are your goals? You have to kind of understand where you're going, and then work backwards and do what you need to do today.\r\n\r\n\r\nNik (31:22)\r\nYeah.\r\n\r\n\r\nRight. Right.\r\n\r\n\r\nCori Arnold (31:38)\r\nThe other thing is, this kind of goes with that, but like how bad do you want it? Because for a while, like years and years, I knew I had a negative net worth. I knew I had a debt problem, but I didn't really want to fix it that bad. So you really have to want it and you really have to commit to whatever you're doing.\r\n\r\n\r\nNik (31:56)\r\nWhat's that first step? Like what's the first step in the process, do you think, to getting down the road of financial independence?\r\n\r\n\r\nCori Arnold (32:04)\r\nthink it's admitting that admitting where you are. So many people, including myself, I wanted to avoid it. I didn't really want to check anything. I didn't really want to do the work. But you have to admit where you are today. that's pretty simple, but it can be hard emotionally. It's literally just writing out your assets, your debts, calculating how much interest you're roughly paying a year. So it's just getting organized and really admitting to yourself where you are, where you want to go.\r\n\r\n\r\nNik (32:33)\r\nthink if people did that 99 % of people would be blown away. Just right out. What are all the debts that I have? What are all the assets that I have? What's the interest that I pay? What's my monthly take home? And you will be shocked. I get like that exercise alone will motivate you to make changes. I couldn't agree with that part more. All right. Here's some rapid fire questions. You ready? All right. If you woke up tomorrow with an extra $100 ,000\r\n\r\n\r\nCori Arnold (32:37)\r\nMm -hmm.\r\n\r\n\r\nMm -hmm. Yep.\r\n\r\n\r\nNik (33:03)\r\nWhat would you do with it?\r\n\r\n\r\nCori Arnold (33:05)\r\nFor me, I would put it in my brokerage account. I would probably divvy it up between some growth stocks and some index funds.\r\n\r\n\r\nNik (33:12)\r\nOkay, tell me exactly. No, you gotta be specific. Tell me where you would put it. Yeah.\r\n\r\n\r\nCori Arnold (33:15)\r\nexactly. Okay. Let's see. I would probably do, let's say 50 grand in index funds and then I would probably put 10 grand in Nvidia, Meta. These are very similar. I mean, you hear about some of these stocks all day. Maybe Amazon, Palantir. That's four. One more. I know I'm a big fan. You know what's had a rocky roller coaster lately was that it's a super microchip.\r\n\r\n\r\nNik (33:27)\r\nWow.\r\n\r\n\r\nokay.\r\n\r\n\r\nCori Arnold (33:45)\r\nI think it's SMCI. Yeah, I'd probably do the other 10 there. It's a little risk, a little not so risky.\r\n\r\n\r\nNik (33:51)\r\nAll right. Yeah, I love it. I love it. All right. What if you could pick any industry to own a business in? What industry are you the most jealous of or what? Like, what do you fantasize at night about owning a business in?\r\n\r\n\r\nCori Arnold (34:11)\r\nInteresting. I love real estate. So it might be real estate, but I have never had luck with tenants. So I'd have to figure out how I went about that. I had some good fortune in flipping properties, so maybe that would be the ultimate goal.\r\n\r\n\r\nNik (34:25)\r\nOkay. What are you obsessed with right now? I know that's kind of a weird question, but if have two hours in a day, have no family, no work responsibilities, what are you spending your time on?\r\n\r\n\r\nCori Arnold (34:35)\r\nWhat am I doing? Actually in July, the first week of July, I had the week off and my other half was traveling for work. So I decided that I was going to work on this book that I've been working on for like three years. So my goal was to kind of finish that.\r\n\r\n\r\nNik (34:51)\r\nPerfect. All right. Last question. What advice would you give yourself 10 years ago?\r\n\r\n\r\nCori Arnold (34:57)\r\nspend less than I make, you know, make better choices, research my investments better, don't let my ego make decisions for me. There's so many. And the other thing is like, I think we tell ourselves a lot, like, I wish I would have started this a year ago. And I really wish I would have started investing earlier. I wish I would have started my personal brand online earlier. Yep.\r\n\r\n\r\nNik (35:21)\r\nSure. Well, you know what they say, the best time to plant a tree was 10 years ago. The second best time is today. this has been awesome. Where's the best place for people to come find you?\r\n\r\n\r\nCori Arnold (35:33)\r\nHey, I would love it if you found me on Twitter. So my handle is I am Corey Arnold.\r\n\r\n\r\nNik (35:39)\r\nOkay, awesome. Cory, thank you for joining me and can't wait to talk to you after you've left the corporate world.\r\n\r\n\r\nCori Arnold (35:45)\r\nYeah. Thank you, Nick. Thanks for having me.\r\n\r\n\r\nNik (35:47)\r\nOf course.",
  "metadata": {
    "duration": "",
    "date": "2024-10-09",
    "platform_source": "Google Drive"
  }
}