{
  "episode_number": "150",
  "episode_title": "Silicon Valley to Silicone Manufacturing: An AI-Powered Evolution with Dan Thompson",
  "guest_name": "Dan Thompson",
  "business_name": "JMAC (family-owned silicone company)",
  "transcript": "﻿Dant (00:00.078)\r\nSo if I wanted to, when I go to share my desktop, I'm just looking at how to do it in this.\r\n\r\n\r\nNikolas Hulewsky (00:00.172)\r\n up.\r\n\r\n\r\nNikolas Hulewsky (00:05.249)\r\nSo there's the share button.\r\n\r\n\r\nDant (00:07.512)\r\nGot it. Perfect. Got it.\r\n\r\n\r\nNikolas Hulewsky (00:08.843)\r\nand then that will allow you to share. So Dan, I'm really excited. I was at the gym this morning with my kids and I just sent out this tweet which was, hey, is anybody actually utilizing AI? And if you are, I just want to know about it. And you were one of the people that responded to it. And you're like, hey, I'm grinding. It's Saturday. I'm at the office. I'm willing to show you. So I'm just excited to be having the conversation with you. Where are you?\r\n\r\n\r\nDant (00:33.646)\r\nSo Nick, I'm in Weatherford, Texas, which is right next to Fort Worth. And we are family-owned silicone company where we compound materials and then we manufacture products for our customers who could be in appliance, auto, many different industries. So you never see our brand publicly, but if the product requires silicone for the durability and reliability of that environment, that's what we make.\r\n\r\n\r\nNikolas Hulewsky (01:00.919)\r\nOkay, so you're not the silicone casting, you're not the mold, essentially, that they're using to make the products. You're the silicone that's actually in the product.\r\n\r\n\r\nDant (01:08.546)\r\nYeah, we compound the silicone and then we have extrusion and molding where we actually make the products. We've been doing it for 50 years. Traditionally, we were autos where we got our start and now we are in many different industries. So it's a very exciting time for us.\r\n\r\n\r\nNikolas Hulewsky (01:17.943)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (01:27.731)\r\nmy god, did you start the business?\r\n\r\n\r\nDant (01:30.188)\r\nNo, a friend of mine, his name is Alan McAleff, started the business. He would be like our father's age and as he was looking for how the business would operate for the next generation, I...\r\n\r\n\r\nhad been at Microsoft for 20 years and retired and I said, hey, I want to run it for you. And I've subsequently brought his daughter into the business and his son runs some couple other businesses they have and we're having a blast. I was happy to step out of high tech Fortune five company and move into family owned business world.\r\n\r\n\r\nNikolas Hulewsky (02:05.559)\r\nThat's a really, I think that's a really cool contrast, especially given now with AI, think. It's becoming starker even.\r\n\r\n\r\nDant (02:11.202)\r\nYeah, it's really...\r\n\r\n\r\nIt's really funny, there's a lot of manufacturing people like us who are just these incredible family-owned businesses and they get the worst technology. They're not big enough to get Fortune 500 kind of technology. And so you have to be scrappy and I've seen AI as an equalizer. Of course, I come from a strong technology background, but I was a very poor developer and I thought, how are we going to leverage AI in our business to give us\r\n\r\n\r\nthe benefits that many of the larger companies have. And we're doing that in a couple areas. So five years ago.\r\n\r\n\r\nNikolas Hulewsky (02:50.261)\r\nWhen did you buy or when did you step into the business? Five years ago, okay. And for you, can you give me an idea like number of employees or top line revenue?\r\n\r\n\r\nDant (03:00.078)\r\nYeah, we've got about 225 employees. We shipped almost 70 million units of stuff.\r\n\r\n\r\nand units could be pounds or packages or whatnot. And some of those units are about the size of a tic tac. So don't let the big number blow you away. But we're a pretty serious manufacturing company in our county here west of Fort Worth. We're the second largest private employer in the county, number two user of electricity. So there's a lot of responsibilities that go into how we work with the county.\r\n\r\n\r\nNikolas Hulewsky (03:15.191)\r\nSure.\r\n\r\n\r\nNikolas Hulewsky (03:36.129)\r\nThis is why I love social media. You and I would have never met. You would have never met. I sent some random tweet, and here we are in the middle of a Saturday. I'm stupid, so help me understand. You're manufacturing the silicone? Do you take the raw material and then put it in? OK.\r\n\r\n\r\nDant (03:38.092)\r\nI know, it's so cool.\r\n\r\n\r\nDant (03:52.142)\r\nCorrect. So most of the world, and you think of this as a plastic water bottle. Plastics are hydrocarbon based and they serve most of our consumable needs for materials like plastics. From like high end that may come in the form of a speaker or something like that to just cheap plastic stuff.\r\n\r\n\r\nSilicone uses instead of carbon, a silicone backbone. And if you look on a periodic chart, you've got carbon right under it is silicone. So in many ways they're very similar, carbon being the backbone of life, silicone being what's often the science fiction backbone of life.\r\n\r\n\r\nSilicone has different properties than carbon and allows us to build materials that work at much lower and much higher temperatures. Silicone also allows us to make it a material which insulates, like in the case of a spark plug boot, where the spark plug goes down into the boot. You can't have an electrical surface related to that. And we can also reverse the conductivity of silicone by the way that we treat it. So it's a very versatile material.\r\n\r\n\r\nvery sustainable because it's not using hydrocarbons and if we mold something and came back 5,000 years from now it will still be exactly like it was. It doesn't have the problems with UV light. So when you build things in it's always a more expensive option but if it's something that has the material characteristics that need to perform at those levels it's the pathway to go.\r\n\r\n\r\nNikolas Hulewsky (05:21.601)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (05:35.159)\r\nOkay, so I'm again, I'm a Neanderthal. I'm gonna try my best to restate to you. I'm gonna be using words. just have no idea if I'm using them right. So if you have a product, whatever it is, and there's something that you would need plastic typically for.\r\n\r\n\r\nDant (05:38.936)\r\nNot at all. Not at all. Yeah.\r\n\r\n\r\nJack, you're doing great.\r\n\r\n\r\nNikolas Hulewsky (05:54.973)\r\nSilicon is the much better application if there are very high or very low temperatures and or if there are applications that require connectivity or conductivity. So it can also function as a conductor. I don't know if I even said those words right, but like plastic is kind of the cheaper version in more applications. Silicon is the higher version.\r\n\r\n\r\nDant (06:00.696)\r\nYes.\r\n\r\n\r\nDant (06:07.084)\r\nYep.\r\n\r\n\r\nDant (06:17.292)\r\nYeah, silicone is a little more expensive version, and it's really built for things that need durability or have certain temperature constraints. I'll give you a couple examples that just fly through some. So we talked about spark plug boots. If you drove a car from the 70s, 80s, 90s, 2000s in the United States that was manufactured here, your spark plug boots came from this factory. So that's like an example of our scale.\r\n\r\n\r\nNikolas Hulewsky (06:31.489)\r\nSpark plugs.\r\n\r\n\r\nNikolas Hulewsky (06:42.485)\r\nReally?\r\n\r\n\r\nDant (06:47.134)\r\nIf you looked at an F-14, 15, F-35, F-22 fighter jet, when the canopy seal closes, there is a silicon seal that we build that supports the pilot's life by properly pressurizing and maintaining its characteristics in those environments. If you look at construction, you have to have fire seals around certain doors in construction.\r\n\r\n\r\nrebuild the fire seals that go with those. Low temperatures, Thermo Fisher is the number one low temperature freezer for medical industry. was very big in pandemic. Yeah, Thermo Fisher, they were the, where vaccines were held at a certain low temperature, the gaskets that went on those doors came out of this factory.\r\n\r\n\r\nNikolas Hulewsky (07:27.351)\r\nPrimo Fisher, that's a company,\r\n\r\n\r\nDant (07:42.23)\r\nSo we build a lot of different really cool things. None of it that you ever see our name or brand on. Heavy machinery, think about like very large yellow machinery maker. We build certain things that go in there that are used in mining and blueprint applications. the really great example to just crystallize it, a lot of us remember when the space shuttle blew up when we were kids.\r\n\r\n\r\nAnd that was a failure of an O-ring on that rocket. And all the engineers told NASA before it launched that it was going to be an issue because it wasn't made out of silicone. And that was the material failure that caused it to explode that day. So that's what we mean by when situation really counts, we're the critical material that should be used.\r\n\r\n\r\nNikolas Hulewsky (08:32.129)\r\nI love that, I don't know if you just thought of that on the fly, but that tagline, when the situation really counts, where the material you use, that's fantastic.\r\n\r\n\r\nDant (08:35.648)\r\nI think it's for a living.\r\n\r\n\r\nDant (08:41.76)\r\nAnd the way I position our company is we provide peace of mind. I'm never your cheapest option. But if you have these critical applications, what you pay us for is peace of mind.\r\n\r\n\r\nNikolas Hulewsky (08:56.565)\r\nI love this. think you're the perfect comp- I'm so excited that I'm talking to you. This might be the best conversation I ever have around this because you fit the perfect profile. You're, you're an old school company in the sense that you're doing manufacturing, right? But you know, are there AI use cases that can make you more efficient? Before I get to the AI, what I do want to ask though is, silicon's not heavy, is it?\r\n\r\n\r\nDant (09:01.358)\r\nYeah.\r\n\r\n\r\nDant (09:05.858)\r\nThat's right.\r\n\r\n\r\nDant (09:12.387)\r\nsure.\r\n\r\n\r\nDant (09:17.646)\r\nIt's like plastics. can be both soft or it can be hard.\r\n\r\n\r\nNikolas Hulewsky (09:22.999)\r\nSo my question with that would be, why do we manufacture it domestically? Why not have it manufactured in China or Indonesia or Vietnam and then have it shipped over? Does that make sense?\r\n\r\n\r\nDant (09:33.742)\r\nSo, yeah, no, so actually in our company, you know, I've talked about primarily the manufacturing facility we have here. We also have co-owned or now have partnerships in Vietnam and China with manufacturers over there. The reason that it's important, part of the reason that we've survived 50 years is that we've been able to serve our customers whether they needed an offshore part or a domestic part.\r\n\r\n\r\nNikolas Hulewsky (09:48.33)\r\nOkay.\r\n\r\n\r\nDant (10:01.262)\r\nAnd the real future of our company is the domestic growth, but there's times where customers want to hedge their bet and use that lower cost source part. And so we provide the flexibility to do both of those. But really, it's an absolute nightmare.\r\n\r\n\r\nNikolas Hulewsky (10:13.921)\r\nHow do you view the tariffs? Do tariffs affect you at all? Is it?\r\n\r\n\r\nDant (10:20.95)\r\nOne of the things when people talk about tariffs, they don't understand how complex the transaction is, once it's received to us. CH Robinson is the shipping and forwarder, and they're an absolute state-of-the-art company that processes them, because you don't know the tariff until you actually clear import. So as the tariffs are discussed, and there's volatility and policy, you don't know what tariff will be assessed when it comes through.\r\n\r\n\r\nWe're certainly in favor of the tariffs and the chaos because it creates opportunity for us. It's bringing things domestically.\r\n\r\n\r\nNikolas Hulewsky (10:57.109)\r\nYeah.\r\n\r\n\r\nDant (10:59.128)\r\nBut the internal management of it is an absolute nightmare. We are looking at a piece of AI there to pull out based on the, you get a PDF document that has your shipping manifest and it has the tariff charges. And so when we went through this four years ago, it was difficult. This time we will probably have it scanned and run through a piece of AI to produce a structured output showing us what those tariffs are so that we can run it into our systems.\r\n\r\n\r\nNikolas Hulewsky (11:28.375)\r\nThat's one of the crazy things. I did not know this and you will probably correct me because you know this better than I do. But I didn't know there's two types of PDFs. There's a HTML PDF, which is effectively mapped. Every character that you see on that PDF is mapped. So it's very easy for software to be built around that type of PDF. But then there's like 25 % of PDFs that are just pictures. It could be a picture with your phone. It could be a scan.\r\n\r\n\r\nwhatever you want to call it, or there's handwriting on it. And that is hard to build software around. But from what I understand, where AI comes in. So correct me.\r\n\r\n\r\nDant (11:59.63)\r\nYou're probably right. I talked about PDFs a little differently just as being simple and messy.\r\n\r\n\r\nNikolas Hulewsky (12:11.04)\r\nYeah.\r\n\r\n\r\nDant (12:11.938)\r\nYou know, in a simple one, you can decompose the text that's in it really easy. And in a messy one, it's just a lot more complicated. But with AI, that's, neither of those points are relevant because what it's going to do is it's going to look at the image and it's going to understand the image. And then you're going to train it to say, hey, if you're...\r\n\r\n\r\nwanting tariff information, these are the numbers that we want off that page. And you don't have to code like you used to with all these details. You're literally, it reads it, it understands it, and you're telling it what fields you want pulled out of it. So a lot of those arguments that used to be problems are no longer problems.\r\n\r\n\r\nNikolas Hulewsky (12:49.867)\r\nWell, like I said, you are at this very interesting intersection, 20 years at Microsoft. What did you do at Microsoft?\r\n\r\n\r\nDant (12:56.238)\r\nSo I was an executive there and my real passion and love, I worked in our engineering teams and then I really preferred working around the globe with customers that are doing the kind of most complex deployment of brand new technology that they could and bringing it into existence for them. So I really understand the business customer. I don't have any experience on the Xbox side or some of those on their sides. It's kind of always behind the scenes, but we,\r\n\r\n\r\nNikolas Hulewsky (13:23.146)\r\nThat's perfect for what you're doing.\r\n\r\n\r\nDant (13:26.412)\r\nWe did projects like when Apple wanted to build the iCloud. It's branded for Apple, but at that time it was shared across Amazon and Microsoft, and so we helped them build it. Things like that.\r\n\r\n\r\nNikolas Hulewsky (13:39.415)\r\nThat's awesome. All right, and then obviously you have the manufacturing experience. How are you using AI in your business right now?\r\n\r\n\r\nDant (13:47.02)\r\nYeah, you know, maybe we could tip dip our toe into a couple things and.\r\n\r\n\r\nNikolas Hulewsky (13:52.609)\r\nOkay.\r\n\r\n\r\nDant (13:55.278)\r\nI'm actually going to use a different example than what I originally thought we'd get to, and then we'll go to some more specifics. one of the things I don't think most people understand is that whether you're using chat, GPT, Claude, or Plexity, you can control the system prompt or the instructions that go with that project. And by setting those instructions, you can get very different outcomes because you send your questions to a large language model. It has context about how you want it thought about.\r\n\r\n\r\nNikolas Hulewsky (14:01.911)\r\nSure.\r\n\r\n\r\nDant (14:24.75)\r\nand then it returns it.\r\n\r\n\r\nAnd reason I share that, it can be done with any of the first party applications. But one of the things that I've done that talks, that helps with the conversation we just had around silicone, is I have three chat apps that we use internally. One is to teach people about silicone so that they can just go on and ask questions and they can learn about it. The second one is about brand positioning. So when customers come to us and they think, you know, hey, I'm doing this, could you do that?\r\n\r\n\r\nYou know, it takes a lot of time for our sales team to be able to respond to those questions and really understand our on-point brand story.\r\n\r\n\r\nNikolas Hulewsky (15:03.786)\r\nOkay.\r\n\r\n\r\nDant (15:06.038)\r\nThe third thing is I have a PhD chemist that works for me, but no person really can understand everything about a subject. In a world, you'd have five that would be super sub-specialists. So I've also built our silicone chemist. And it may not solve everything, but it begins to ask the right questions that help us get down the routes faster. So if you'd like, let's look at that real quick, and then let's talk some other things that we're doing.\r\n\r\n\r\nNikolas Hulewsky (15:33.845)\r\nYeah, we're going look at that. why don't you can kind of get your screen ready. I have an analogy that I really like that I've started using all the time. think people have a hard time understanding or differentiating what is AI, how's it different than just Google? And this is the way I like to think about it. Google is the librarian. You go to the librarian and you say, hey, I want to learn about the fall of Rome.\r\n\r\n\r\nDant (15:35.952)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (15:59.519)\r\nOkay, go to this section, pull these books by these authors, and then you go there and it's self-service. You're consuming that information and you're the one who's then synthesizing it and making decisions. Whereas AI is exactly what you just talked about. It's a PhD level specialist that can give you specific answers, but you have to ask the right questions and it has to be prompted the right way in order to return the type of information that you're looking for. So I like to draw that distinction.\r\n\r\n\r\nOkay, says I need to give you permission.\r\n\r\n\r\nDant (16:29.718)\r\nHey, Nick, we're going need to hit some permission problems. I had to throw this in Chrome to connect. Normally, I was Safari. what is it? Riverside didn't support the Safari browser. So we may end up having to reconnect and let me set some permissions to be able to see things.\r\n\r\n\r\nNikolas Hulewsky (16:44.758)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (16:52.267)\r\nLet's do that here. I'll stop for a second.\r\n\r\n\r\nNikolas Hulewsky (00:03.7)\r\nAll right. Yep, I can see you now.\r\n\r\n\r\nDant (00:06.403)\r\nOkay, so would you like for me to pick up on, here's what I'm going to\r\n\r\n\r\nNikolas Hulewsky (00:14.634)\r\nYeah, let's go. Let's go to one of those chat bots that you've\r\n\r\n\r\nDant (00:22.203)\r\nOkey dokey.\r\n\r\n\r\nNikolas Hulewsky (00:23.594)\r\nAnd what you were saying essentially was there were a couple of them that you made. One of them is for your brand team to have access to, ask questions and run through the branding and the story. The first one was just to get people within the company an opportunity to, yep, I can see it. Silicon insights.\r\n\r\n\r\nDant (00:28.924)\r\nYep.\r\n\r\n\r\nDant (00:37.371)\r\nCan you see the screen?\r\n\r\n\r\nDant (00:42.959)\r\nOkay, whenever you're ready to start recording. Okay. So Nick, as we were just talking about...\r\n\r\n\r\nNikolas Hulewsky (00:45.334)\r\nYep, we're good. I've already started.\r\n\r\n\r\nDant (00:52.721)\r\nwe created three different chatbots and we brought them into this environment so that people could have a chatbot to talk to about silicone, what is silicone, why silicone, one to talk about how to do brand positioning around it, and then one that's much deeper in terms of the chemistry. So we'll just start out, and again, this could be done in chat GPT or. Yep.\r\n\r\n\r\nNikolas Hulewsky (01:17.418)\r\nYeah, that's that's what was going to ask you. Where did you build this on top of? What are we in right now?\r\n\r\n\r\nDant (01:22.501)\r\nSo you're in just a custom app that I built. And in just a minute, we'll go through these three. And then I'll show you where the logic is for and how I built that using a drag and drop canvas instead of writing code for these particular ones, because there were some features that I was trying to understand. But it's really something that other people could implement. So you know.\r\n\r\n\r\nNikolas Hulewsky (01:32.63)\r\nPerfect, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (01:43.862)\r\nAwesome. Okay.\r\n\r\n\r\nDant (01:50.341)\r\nWhat makes silicone special? You know, just as a simple one. And what's happening is that there's an instruction prompt in the back. And so, you know, this is fairly consistent with what you would get in any of the...\r\n\r\n\r\nchat solutions that you buy off the shelf. However, I want people to have creativity and understand. So for me, it was very important for it to bring in the try these prompts. And again, it understands that we're trying to talk about silicones. And so now people are able to, you know, use those suggested prompts very easily to continue just kind of learning what's going on with silicone, right?\r\n\r\n\r\nNikolas Hulewsky (02:31.478)\r\nso it's like effectively I ask a question. Sometimes I don't even know what the next best question is, right? It's prompting you. Where did you pull them from?\r\n\r\n\r\nDant (02:37.127)\r\nYeah, exactly. And you see it's pretty prompts. So the way it actually works is it's pulling the prompts from the conversation that you're having with it. And it says, it looks at the message history and it says, generate three questions.\r\n\r\n\r\nbased primarily on the last question that would be interesting to explore. And then the system instructions that are provided kind of just keep it in the boundaries. mean, people could ask anything, but that's the idea of this introduction to silicone. Yeah?\r\n\r\n\r\nNikolas Hulewsky (03:06.676)\r\nAnd these, this is for any employee to use or is this like during orientation and onboarding?\r\n\r\n\r\nDant (03:12.871)\r\nI'm rolling it out. you know, inside of a manufacturing facility, you have a lot of people that work on the floor. It's a little bit more of a mechanical. They're more operators, but we're using it across the other parts of the team where people may be thinking about branding or positioning or processes. And it just gives it gives people a quick way to come up to speed, particularly valuable to our salespeople and our external sales reps.\r\n\r\n\r\nNikolas Hulewsky (03:40.694)\r\nOkay, so if I was a, if I'm one of your sales people, how would I use the sales bot that you've created?\r\n\r\n\r\nDant (03:45.423)\r\nSo, pardon me?\r\n\r\n\r\nNikolas Hulewsky (03:47.796)\r\nIf I was one of your sales people, how would I, how might I use that one? Yeah.\r\n\r\n\r\nDant (03:50.247)\r\nSo let's go look at this one. Yeah, that's what I was going to say. you know, the, um,\r\n\r\n\r\nYou know, and I give them a couple of prompts, right? And so is silicone more expensive, right? Just as a starting place.\r\n\r\n\r\nNikolas Hulewsky (04:02.102)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (04:07.828)\r\nIt's a very clean UI as well. It's not cluttered. It's not messy.\r\n\r\n\r\nDant (04:12.599)\r\nI'm a very limited developer, but I wanted things that are simple for people and they can feel good about, right? And it's a little easier, I found, in terms of a change management perspective, meaning that I'm making changes in my organization and the processes that we use, providing some focused chat bots is superior to saying, here's Claude or here's ChatGPT.\r\n\r\n\r\nNikolas Hulewsky (04:17.386)\r\nTotally.\r\n\r\n\r\nNikolas Hulewsky (04:36.715)\r\nMm-hmm.\r\n\r\n\r\nDant (04:37.543)\r\nbecause it has purpose associated with them and people are able to understand that better.\r\n\r\n\r\nAnd you can see like how the silicone's durability work. And what you're really getting here is the discussion that we had earlier about why it's a superior material in certain cases and why you'd want to pay the premium to do that. You know, and one of the examples that my, one of my sales leaders showed me is he uses it often. He just drags or copies whatever email comes in from a customer wanting to learn more about us and drops it into this.\r\n\r\n\r\nAnd you know, quick email based on silicon temp ranges to a customer.\r\n\r\n\r\nNikolas Hulewsky (05:15.284)\r\nAnd it spits out a kind of a response or point for point.\r\n\r\n\r\nDant (05:33.499)\r\nYou know, and this won't have the context of the customer's email, but you can see it just spit back exactly what somebody's doing. Right.\r\n\r\n\r\nNikolas Hulewsky (05:33.568)\r\nSo.\r\n\r\n\r\nNikolas Hulewsky (05:41.002)\r\nYeah, in a digestible format that somebody would actually look at. Is it specific to just silicone, or would this say like?\r\n\r\n\r\nDant (05:48.775)\r\nIt could work across any industry.\r\n\r\n\r\nNikolas Hulewsky (05:50.794)\r\nBut what I'm saying is, it have specific information about your company or is this just, does, okay. So if a customer said, well, what makes your silicone better than somebody else's? Is that something you might use this for?\r\n\r\n\r\nDant (05:53.841)\r\nYeah, it does, in the system prompt that I created.\r\n\r\n\r\nDant (06:02.752)\r\nYeah, I mean...\r\n\r\n\r\nSo, you know, we're kind of on like a compared to other temperature resistance threat here. We would discuss why a customer says why us at JMAC. It's really a focus on our ability to do, you know, compounding specific formulas, designing the molds or the extrusion. You know, there's a lot of manufacturing that goes with that conversation with the customer who's looking at selecting us. And then the third one.\r\n\r\n\r\nyou know, and it just kind of cranks up the intelligence of the system is...\r\n\r\n\r\nthis one and you're going to see that if we do Y-silicone for example, I don't know if I showed that to you in the earlier ones, it was more of a medium range kind of answer. And here you can see that it's really going into the chemistry of Y-silicone.\r\n\r\n\r\nNikolas Hulewsky (07:05.27)\r\nYeah.\r\n\r\n\r\nDant (07:07.27)\r\nLike I said, really, it's taken my people who work in our lab and given them tools to really drive and question how they work with the customer's products that we're doing. I'll show you another great example. So one of the things that when you use silicone and you're molding it or extruding it, you use a catalyst, which makes the reaction go just like in your human body, there's catalyst that.\r\n\r\n\r\nhelp you like vitamin D is one, you know, it's a hormone. Here, being able to explain silicone catalyst and then we can drill down into different systems where there's platinum catalyst and peroxide catalyst. And so if we're having some side effects of the reactions that we didn't expect or something like that, this really gives them a place to go drill and get answers. Because in the past, if we couldn't answer it in-house, we immediately had to go to some of the research groups that we keep on retainer.\r\n\r\n\r\nThat's a very expensive and slow process.\r\n\r\n\r\nNikolas Hulewsky (08:04.598)\r\nYeah, that was going to be my question. If you're having trouble figuring out the chemistry of it, where do you go? It's not a lab assistant. It's to a specialist.\r\n\r\n\r\nDant (08:13.095)\r\nYeah, the lab assistant would understand what we do regularly, but when we're developing new compounds for a customer, we use...\r\n\r\n\r\nYou know, I've got a PhD chemist and we have several groups on retainer that we use to work with this. So this was a simple example of just kind of harnessing chatbots. I did use a tool called Flowwise in the background to make these chatbots. I opted for that this time so that I could have a drag and drop environment because I was prototyping here primarily. I like to prototype before I actually finish something. And there's some great\r\n\r\n\r\nNikolas Hulewsky (08:32.054)\r\nAmazing.\r\n\r\n\r\nDant (08:50.985)\r\ntutorials on YouTube where they explain how to use Flow-wise and what happens is, you know, we could take like the silicone marketing as an example and you know, an hour or two of YouTube and you begin to understand how to use these drag-and-drop blocks, you know, where you provide to OpenAI your key, what model that you're running on and you know, when I was talking about the\r\n\r\n\r\nNikolas Hulewsky (09:15.221)\r\nOkay.\r\n\r\n\r\nDant (09:22.407)\r\nprompts, this is that system prompt that's describing your knowledgeable material science, business decision maker, and this is what tilts the entire AI experience into the type of, know, here's the tone and approach, the material science foundation, the differentiations, and so it radically alters the way the response comes back from the large language model.\r\n\r\n\r\nNikolas Hulewsky (09:29.91)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (09:49.408)\r\nSo if somebody's looking at this at home, basically what you're doing is you're using Flowwise to set up the workflow, the automation, but you're using your OpenAI API because OpenAI allows for you that what an API is is it allows someone else to access their system if you're using a custom layer of software. So it's saying, okay, go query OpenAI.\r\n\r\n\r\nDant (10:02.876)\r\nThat's right.\r\n\r\n\r\nNikolas Hulewsky (10:17.408)\r\nget this answer and then bring it back. But flow-wise is effectively.\r\n\r\n\r\nDant (10:21.659)\r\nFlow-wise is managing that relationship in this case. And one subtle difference, a large language model could be thought of as like a deck of 52 cards. And when you ask it a question, it brings back the responses based on the question you ask. It's kind of reflecting your question because it predicts the tokens is how it actually works.\r\n\r\n\r\nNikolas Hulewsky (10:24.491)\r\nYeah.\r\n\r\n\r\nDant (10:45.647)\r\nYou can have it where when I ask a question, it injects the system prompt at the same time. And what that does is it's like stacking the deck so that the cards that get dealt back are more in favor of what you were trying to achieve.\r\n\r\n\r\nNikolas Hulewsky (10:59.08)\r\nRight. Can I ask a question to this? There's three blocks. One of them looks like it's the API call to open AI. One of the one on the far right looks like it's the prompt. What's yeah, what's that guy?\r\n\r\n\r\nDant (11:01.671)\r\nSure. Mm-hmm.\r\n\r\n\r\nDant (11:11.985)\r\nSo for somebody who's never seen this before, you're reading it quite intuitively. Slightly different. All the conversation is happening in this block. It's managing the different resources. But what it's saying is, this is the chat model that I've hooked it up to. If I want to use Anthropic, which is what Claude's based on, or if I wanted to use Jim Nye Google, you would use a different block over here.\r\n\r\n\r\nNikolas Hulewsky (11:24.374)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (11:38.884)\r\nOK, so that's, hey, I'm using open AI and I'm using, you know, I are for or. Many. Got it. OK, so that's setting the model, it's telling it where to go to access this data.\r\n\r\n\r\nDant (11:45.543)\r\nYeah, I'm using 4.0, or we could open it up and see some of the other models that are available.\r\n\r\n\r\nDant (11:55.419)\r\nCorrect. And what the buffer window memory is, it's a technical necessity so that when a chat bot is processing, it keeps the thread of messages in context. And if you were programming it, you would use one approach. But for the conversation chain to have memory so that it remembers one question to the next, this is a way to do that.\r\n\r\n\r\nNikolas Hulewsky (12:08.64)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (12:19.938)\r\nOkay, because if that piece isn't in there otherwise, every question is just going to be independent of the previous answer. doesn't build on itself. Can I ask the prompt? In my understanding of things, there's a pretty, it's not small, but there's a limited prompt window. I think it's 100,000 characters or tokens. I'm not sure if that's correct. But how big is your prompt? Is this pages worth of information or is this\r\n\r\n\r\nDant (12:23.408)\r\nIt's very stupid from prompt to prompt.\r\n\r\n\r\nDant (12:38.79)\r\nYes.\r\n\r\n\r\nDant (12:49.133)\r\nNo, this is like a thousand characters.\r\n\r\n\r\nNikolas Hulewsky (12:53.918)\r\nOkay, and is it more context, like, this is how I want you to act, or are you giving it proprietary information on your company?\r\n\r\n\r\nDant (12:56.625)\r\nThis is.\r\n\r\n\r\nDant (13:00.487)\r\nIn this particular case, it's only context. You ask a great question, there's some things that we're doing where we're actually having proprietary information about like the formulas that we use in the chemistry, but that would not be used in a system prompt. You'd use a different approach to do that.\r\n\r\n\r\nNikolas Hulewsky (13:18.131)\r\nLike the branding one, I'm assuming there are some business specific information that you uploaded or is it not?\r\n\r\n\r\nDant (13:22.885)\r\nYeah, of course. But I mean, it's not magical. mean, anybody who had a, you know, if you own a family-owned business and you're actually out there selling and hustling, you know a lot of these things.\r\n\r\n\r\nNikolas Hulewsky (13:34.07)\r\nI like the way you're using it for education. Anybody could use this for onboarding. Everybody knows how difficult onboarding can be.\r\n\r\n\r\nDant (13:38.918)\r\nYeah.\r\n\r\n\r\nDant (13:42.853)\r\nWell, the key is you want to be able to put the company's knowledge in the pocket of the people that are working on you. Because they don't want to always come and ask, right?\r\n\r\n\r\nBut you want to be able that if somebody's out in the field or working on different things that at their fingertips, they really have a good basis. And yes, maybe something comes back in the AI that wouldn't be exactly the way I would frame it. But you know, when you're 95, 98 % accurate on every question that's ever answered, that's good enough. I built it. I didn't build Flow-wise. I just adopted it here to be able to do it.\r\n\r\n\r\nNikolas Hulewsky (14:13.216)\r\nDid you build this yourself or did you have somebody come in? OK. What?\r\n\r\n\r\nNikolas Hulewsky (14:23.168)\r\nBut in order to do these API calls, you needed Flowwise. What about Make or Zapier? Are those similar to Flowwise?\r\n\r\n\r\nDant (14:26.267)\r\nMm-hmm.\r\n\r\n\r\nDant (14:32.551)\r\nZapier is the largest universe of connectors and they have some version of it that's similar. The reason I use Flowwise has a more strategic answer in that there's a technology called Lang chain and Lang graph, which is really the way that AI agents are built. This kind of gives you a UI to work with and mock up.\r\n\r\n\r\nNikolas Hulewsky (14:48.854)\r\nMm-hmm.\r\n\r\n\r\nDant (14:58.479)\r\nso you don't have to write code to do it when you're trying to understand how the systems interoperate. And so I was able to quickly bring it into a UI that works for us. I have other projects. I just grabbed some before we got on the phone where right now I'm looking at this is called AI assistant. This does not have a system prompt in this particular one.\r\n\r\n\r\nWhat?\r\n\r\n\r\nWhat are the pro and\r\n\r\n\r\nDant (15:39.27)\r\nStick.\r\n\r\n\r\nNow before I hit enter, what this is is this is an interface that goes to Anthropic. So this is like if you were working with Claude. However, two weeks ago, they released a new model, Sonnet 3.7, that shows the thinking that the model's doing before it answers a question. And I think that there's a lot of work that I'm going to want to do with that. And you're going to see here, now you're seeing what the model's thinking about on how to answer the question before it actually\r\n\r\n\r\nrenders an answer for that question. And so what I'm doing is I'm building up a set of tools because sometimes we would like to really examine what the thing thought about before it answered it, especially when we get into chemistry work and some very nuanced stuff. I think it's going to be very critical to see how the assistant thought about it before it gave you back an answer.\r\n\r\n\r\nNikolas Hulewsky (16:38.834)\r\nIs this also a way that companies are able to utilize artificial or AI large language models without having to rely on their employees, like using their own personal accounts? If that makes sense. Yeah.\r\n\r\n\r\nDant (16:51.653)\r\nYes, that's exactly what I'm doing. Instead of rolling it out for everybody, I have a couple API keys and I can see just what it cost us. And I focused them on so that it's not on every topic in the world, it's really related to work. And of course you can kind of work around that, but that's not the... The key is to try to give people tools in their pocket that are valuable for them to do their job.\r\n\r\n\r\nNikolas Hulewsky (17:05.077)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (17:17.102)\r\nSo talk to me a little bit about the pricing model because it changes once you give access to that API key. you're paying on a, I don't know exactly how it's calculated.\r\n\r\n\r\nDant (17:26.043)\r\nYou pay on a particular basis. We're gonna look in just a minute at some analysis reports on my sales process and new part processes. I get unbelievable analysis done for about a buck a day. These chat bots, I mean, I don't know what it means when it scales to more than 15 or 20 people, which is what we're maybe using it. I bet I've never seen a $20 bill. So, and as I keep adding,\r\n\r\n\r\nNikolas Hulewsky (17:40.16)\r\nWow.\r\n\r\n\r\nDant (17:55.909)\r\nreal depth and analysis, of course my bill will go up. But I'm also having conversations instead of having to have my chemist who are on retainer, we're having those conversations in-house with very good set of knowledge and it's okay. I mean, it's incredibly inexpensive.\r\n\r\n\r\nNikolas Hulewsky (18:10.134)\r\nIs it paid? So are you paying on a per token basis?\r\n\r\n\r\nDant (18:14.951)\r\nYeah, anytime you call the APIs, standard rate of an API might be $5 for a million tokens going in, $15 for a million tokens going out. That's on a state of the art model at Anthropic. And there's everything from free-based models to more expensive models. So you just find what works for you.\r\n\r\n\r\nNikolas Hulewsky (18:37.556)\r\nInteresting. obviously the more, you said, the more you use it, the more you automate, the more you're obviously spending. If you were, you have a lot of technical experience, you have Microsoft experience and not necessarily that you just because you were an engineer, but someone might look at you and say, well he worked at Microsoft. What would your recommendation be to somebody who is a small business owner and is just starting to think through how they would put these things together?\r\n\r\n\r\nDant (18:43.195)\r\nYeah.\r\n\r\n\r\nDant (18:59.141)\r\nYep.\r\n\r\n\r\nDant (19:04.219)\r\nYeah, I think maybe we should... So the very first thing is buy a subscription to Perplexity, Claude, and OpenAI and learn how to use AI yourself as a consumer. Once you understand that, then through curiosity, you can begin to open up scenarios and say, what if we had a ring-finned solution that did this or did that?\r\n\r\n\r\nThen you can look at no code solutions and as you begin getting into it in the software development world, you know, it's being democratized like it's never been before with tools like cursor, which are.\r\n\r\n\r\nAI software development tools. Replit is where I would recommend people to begin, where people are literally writing applications who have never written code. And so you have to have the curiosity for the AI and then you have to have just the confidence you're never going to hurt yourself trying and you've just got to get in there and start trying. And that's why I want to be able to talk to people and communicate that all of this is possible and that especially as we think about building a more golden age in America,\r\n\r\n\r\nA lot of things will happen at the Fortune 500 level, but all of us entrepreneurs, whether we're manufacturers or restaurants or whatnot, we need to be sharing what we're doing because nothing's going to drop from the sky and just solve it for us.\r\n\r\n\r\nNikolas Hulewsky (20:32.352)\r\nYeah, one of the prompts that I like to use is very, simple. But let's say I wanted to figure out how to do what you're doing. Hey, I want to create my own custom chat bot. And I will say, teach it to me like I'm five. Now, the first couple of times I did that, it was like, there's a rainy day. it didn't work well. So I had to change it. Now I'm like, teach it to me like I have a fifth grade reading level instead of like I'm five. But just start there.\r\n\r\n\r\nLike it teaches you really well.\r\n\r\n\r\nDant (21:03.747)\r\nI agree 100%. I use that method every day, every day on many different topics. And I think that the two places to look at that are using perplexity and using Grok. And I use the prompt, help me understand. And boom, boom, it comes through. But it's the same idea that you have. The reason that Grok and perplexity are special is that they actually serve.\r\n\r\n\r\nsearch the internet live time. So if you're trying to find current information on something that's a little more difficult in chat GPT and Claude.\r\n\r\n\r\nNikolas Hulewsky (21:41.088)\r\nYeah, I really like the deep research functions for all of these. Like it's pretty incredible what it returns to. It's like an analyst.\r\n\r\n\r\nDant (21:46.427)\r\nlove it.\r\n\r\n\r\nDant (21:50.983)\r\nIt is an analyst and you know part of what we're thinking about doing in our business is I mock up through perplexity and grok that type of analysis and then We've turned it into to what I think I want to share with you next You know our business we run on HubSpot. We love HubSpot I don't love HubSpot's reporting\r\n\r\n\r\nIt's very good for a lot of things, but the gold standard for me is to be able to come into the office on a Monday morning and have my sales pipeline, my new parts process, my qualifying process, all those pipelines.\r\n\r\n\r\nwhat happened last week, what happened this week, and have them analyzed as though I analyzed it myself. So, you know, that's eight hours worth of work to do for those three pipelines. And I'm very, very efficient and proficient. It's still eight hours.\r\n\r\n\r\nNikolas Hulewsky (22:50.71)\r\nSo it's not, so what you're describing is not just a dashboard. It's not like, here are the numbers. It's actually giving you an analysis. I gotta, I gotta see this.\r\n\r\n\r\nDant (22:56.837)\r\nYeah, exactly. OK, so let's take a look at this. Let's start in a mailbox. How's that sound?\r\n\r\n\r\nNikolas Hulewsky (23:09.856)\r\nPerfect.\r\n\r\n\r\nNikolas Hulewsky (23:18.546)\r\nIs there anybody else on your team who's doing this stuff or is it just you who's sort of playing with an architecting?\r\n\r\n\r\nDant (23:25.851)\r\nMost of my people have full-time jobs that I keep them very focused on.\r\n\r\n\r\nNikolas Hulewsky (23:28.938)\r\nHahaha\r\n\r\n\r\nDant (23:32.497)\r\nBut what I found is it's very hard to get people to adopt out of their traditional workflow. And so what we typically do is we have a project about what we're gonna work on. And I may be three or six months ahead of what I start showing them, but then we show them a collaborative way of what if your workflow changed like this or that?\r\n\r\n\r\nthen it becomes very interesting for them. And so they dog food and test and provide the feedback. So if I start in a mailbox.\r\n\r\n\r\nNikolas Hulewsky (24:07.574)\r\nThat makes sense.\r\n\r\n\r\nDant (24:12.677)\r\nlooking at a pop-up message and then picture and picture automatically so that you can...\r\n\r\n\r\nI don't know what it's doing. The river south.\r\n\r\n\r\nNikolas Hulewsky (24:24.188)\r\nit's just showing the picture. It must be just showing the picture in picture. That's fine.\r\n\r\n\r\nDant (24:27.527)\r\ngot it, so I'm going to turn that off. So let's look at\r\n\r\n\r\nDant (24:38.471)\r\nQuote, process analysis.\r\n\r\n\r\nThe quoting process is how when a customer asks us to build something, in 14 days we get a response back to them on what we estimate that thing would cost. Then it goes into a lot of other stages where you proof it and build it and things. But the initial quote we'll do in less than 14 days.\r\n\r\n\r\nAnd as you can imagine, a lot of companies might think that's slow, but we have to measure, understand materials, think about how we would manufacture it. So 14 days is actually pretty fast. So if I go to process analysis, this is what I get in my inbox. I get an email that the first thing it does is it says, how many tickets are in that process right now?\r\n\r\n\r\nhow many tasks are open, how many overdue tasks are there, and what's considered high priority. So instead of me going through and reading everything, I'm immediately getting a feel for what's open, what's overdue, what's high priority.\r\n\r\n\r\nNikolas Hulewsky (25:47.104)\r\nSo that's pulling from what system are you using for project management?\r\n\r\n\r\nDant (25:51.623)\r\nSo we use HubSpot and we use their ticket pipelines. And what I do is I pull a report and I'll show all this to you on the back end in just a minute. That's a snapshot of everything that's inside of HubSpot. And then I take the one from last week and one from the current day and I send those to AI and I tell it, I want you to analyze what changed. What should I be looking at?\r\n\r\n\r\nNikolas Hulewsky (25:53.813)\r\nokay.\r\n\r\n\r\nDant (26:21.479)\r\nAnd this is the output of that. You can see that there's stage distributions, like you start and start, and then you go to materials, and then you go to engineering. And so it's showing me what tickets changed. And I really haven't emphasized the final user.\r\n\r\n\r\ninterface with this. What's more important is that it's working right now. We've had it running for two months full time and then we'll go in at the end of the third month and we'll take all of our feedback and we'll actually optimize the way it looks.\r\n\r\n\r\nNikolas Hulewsky (26:55.338)\r\nAnd so you get this every Monday.\r\n\r\n\r\nDant (26:58.119)\r\nI get it every day, my team gets it every Monday. Monday's the one I use. I just like watching it run during the week to make sure that it's analyzing the way I think it should be. So what it's telling us now is it's saying, hey, these deals or tickets for a customer went from start to materials to engineering. This other one went from materials to engineering to manufacturing.\r\n\r\n\r\nAnd this next one went from manufacturing all the way through price. So that's what happened that week on those three deals. Right?\r\n\r\n\r\nNikolas Hulewsky (27:32.054)\r\nWow, that's cool. Okay, so it's telling, it's not only telling you what deals are there in the pipeline, it's telling you the movement that happened on each one of them.\r\n\r\n\r\nDant (27:39.86)\r\nExactly. Which as a leader, that's what I want to know is how our deal is moving. What's going on?\r\n\r\n\r\nNikolas Hulewsky (27:44.34)\r\nYeah, yeah, yeah. Now are those all the deals in your pipeline or are those the only deals that had movement last week?\r\n\r\n\r\nDoes that make sense what I'm saying?\r\n\r\n\r\nDant (27:52.647)\r\nYeah, so these are ones that had movement in this piece of our quoting process. This is not actually looking at my wholesale pipeline. This is when it shells out to a sub-process to run a quote for somebody. These three all had movement. It doesn't mean that things weren't worked on, but these are the ones that moved different stages.\r\n\r\n\r\nNikolas Hulewsky (28:14.858)\r\nGot it. Okay.\r\n\r\n\r\nDant (28:17.275)\r\nThen I'm looking for overdue task. Every person can set a date that their task is going to be due. This is showing me overdue task because if something's 222 days overdue, I'd like to understand what happened.\r\n\r\n\r\nAnd by the way, I've dropped in this particular case, we have some dirty data in here on purpose so that we can force it to show us these things in addition to what's actually running in the business right now. So these two, I just happen to know that's part of the dirty data that I dropped in so that I could. Yeah, because you want it to force some things to make sure it works the way you think it does. And then I get.\r\n\r\n\r\nNikolas Hulewsky (28:46.197)\r\nvery cool.\r\n\r\n\r\nNikolas Hulewsky (28:51.05)\r\nDirty data. That's amazing.\r\n\r\n\r\nNikolas Hulewsky (28:59.242)\r\nDo listen to ACDC when you put these together? Dirty data and they're done, they're cheap.\r\n\r\n\r\nDant (29:02.757)\r\nI wish it was, that would be great idea. And so then it's talking about specific people on the team, the tickets that are going on with their stuff. Then it's calling out some critical action items that may be suggested actions to take. And then it actually comes back with some process improvement recommendations. Yeah.\r\n\r\n\r\nNikolas Hulewsky (29:22.518)\r\nOh, it's actually giving you recommendations at the very end. All right. So let me just summarize. Every business is broken up into different parts and especially within businesses where projects move from one department to another department, it's like a conveyor belt. This happens and this happens and this happens and it passes to this person. That was specifically for the quoting process. Hey, we've got a customer, they've sent us the information, we now need to give them a quote.\r\n\r\n\r\nHere are all the steps in that quoting process. AI is going out and within HubSpot, where it is in the quoting process and just giving you a summary of any updates. Hey, this is where these deals are in the pipeline, et cetera.\r\n\r\n\r\nDant (30:04.133)\r\nYeah, exactly. Let's mark your video of what time it is. And then what I'm going to do is I'm going to duplicate this slide. I'm going to take the customer names off of it.\r\n\r\n\r\nI'm gonna answer your question for you.\r\n\r\n\r\nNikolas Hulewsky (30:25.056)\r\nPerfect.\r\n\r\n\r\nDant (30:27.377)\r\nAll right.\r\n\r\n\r\nSo Nick, you ask a great question. Last year at the end of the year, because of the political environment, business was moving very slow for us all. And so we used that time to focus on processes so that as whatever administration went into office, we were ready to go get new business.\r\n\r\n\r\nAnd so one of the things we were looking at is our sales pipeline and we made some consolidations that were in it. And then this is what's actually in HubSpot. This is our sales pipeline. And you could see that like Qualify will shell out to a sub-process. And just a moment ago, we were looking at the quote process that it shells out to. This is how they progress through our sales. That means that there's a ticket system.\r\n\r\n\r\nNikolas Hulewsky (31:15.668)\r\nAnd what do mean by shell out?\r\n\r\n\r\nDant (31:20.711)\r\nYou know, so the quote process may have, I don't know, six steps to it. And so there will be a deal that's here for quoting, and then the specifics of that deal go to the quote process, which are six steps that go across different departments. And then when a quote is actually generated, then it goes to quote approval for the customer. And we do all that in HubSpot today.\r\n\r\n\r\nNikolas Hulewsky (31:47.642)\r\nso this is effectively articulating what the HubSpot flow is. Can I ask, this is, I've worked with, we didn't use HubSpot in healthcare, we have electronic health records and you know, data compliance is something that's really important. You have to make sure your clinicians are documenting, saving, uploading. How do you manage that? Because,\r\n\r\n\r\nDant (31:52.721)\r\nThat's correct.\r\n\r\n\r\nDant (31:56.529)\r\nSure.\r\n\r\n\r\nDant (32:03.483)\r\nYep.\r\n\r\n\r\nNikolas Hulewsky (32:16.594)\r\nObviously the AI won't know whether or not there's been a change unless somebody has actually gone into the system and recorded a change. Is HubSpot good about, you know, prompting you to say, make sure this has changed or like how are these tickets actually generated? How are they actually closed?\r\n\r\n\r\nDant (32:23.291)\r\nCut.\r\n\r\n\r\nDant (32:31.771)\r\nSo when it becomes the basic basis of an employee's workflow, for us to quote something means that in HubSpot, they have a work item that's assigned to them. And that's what all this reporting is showing. What is stale? What is not moving? What got blocked? If they had tasks that were set, what are the notes that go with it?\r\n\r\n\r\nNikolas Hulewsky (32:57.877)\r\nOkay.\r\n\r\n\r\nDant (32:57.933)\r\nAnd so the AI, I scrape all the data out of HubSpot. I store it somewhere. And then I take the current version and the previous version, and I put them together, and I haven't analyzed that.\r\n\r\n\r\nNikolas Hulewsky (33:12.054)\r\nBecause effectively, when you get the email and it's like, oh, you've got six outs, I'm going to make up a name. You've got six outstanding items in quote research where you're like, oh, Lauren is responsible for quote research. What's going on with Lauren? Like you, you, you can kind of take that next step to understand why and where it's held.\r\n\r\n\r\nDant (33:18.202)\r\nYeah.\r\n\r\n\r\nDant (33:32.325)\r\nYeah, exactly. this is the back end of my custom system that I wrote.\r\n\r\n\r\nNikolas Hulewsky (33:40.544)\r\nSorry, this is the AI reporting or this is HubSpot? cool, okay.\r\n\r\n\r\nDant (33:43.431)\r\nYeah, this is my AI reporting. And quote process, that's the one that we were talking about. So if I grab the report, this is an example that snapshot that arrives in the morning, but it's not analyzed. Okay. And see, these are the stages that we have to go through to get a quote put together. That makes sense. Start material, engineering, manufacturing, quality, cost, price.\r\n\r\n\r\nNikolas Hulewsky (34:08.022)\r\nOkay. Yeah.\r\n\r\n\r\nDant (34:14.107)\r\nWhat it's showing me is the name of the customer, the deal that it's associated with, and how old it is and how long it's been idle. Just that limited set of information really lets me understand what's going on in our business. This is an example of one of those deals where I've left something that's old to make sure that it's kicking out certain things in the emphasis.\r\n\r\n\r\nNikolas Hulewsky (34:38.294)\r\nSure. And did you set the parameters as you were like, hey, if it's over six days, it's red? Or is that a HubSpot thing? OK.\r\n\r\n\r\nDant (34:43.601)\r\nYep, exactly right. No, this is all custom. So at Microsoft, 20 years, I ran all kinds of escalations. And the two things that I've learned is I want to know the age of something, and I want to know how many days it's been since somebody touched it. Just knowing those two variables as a leader, I can have great impact in my organization. this is just a custom piece of software that we wrote.\r\n\r\n\r\nNikolas Hulewsky (35:01.494)\r\nAnd is this flow wise?\r\n\r\n\r\nNikolas Hulewsky (35:08.223)\r\njust a custom piece of stuff. How did you write it?\r\n\r\n\r\nDant (35:11.067)\r\nSo you've got so many great questions. So it was written in Replet. I found Replet to be the best place for me to start code development. And it's all Python. And...\r\n\r\n\r\nNikolas Hulewsky (35:14.503)\r\nSorry. Okay.\r\n\r\n\r\nNikolas Hulewsky (35:27.978)\r\nThis is so cool. You used AI to help you write the software to generate the AI. It's so cool.\r\n\r\n\r\nDant (35:31.591)\r\nOf course.\r\n\r\n\r\nDant (35:35.439)\r\nAnd here's the little tip and trick I would start for anybody. Like I can go into my whip here. Every time I try to start something new that I have no idea what I'm doing, which can be often.\r\n\r\n\r\nNikolas Hulewsky (35:53.406)\r\nHahaha\r\n\r\n\r\nDant (35:54.919)\r\nI just have AI write me a simple Python script that begins to mock up what I'm trying to do. know, here, apps, yeah, they will. Or Claude or whatever. And so, you know, it doesn't matter what it looks like. You know, none of that stuff matters, but it was a way for me to begin to understand what the code kind of needed to come together and do.\r\n\r\n\r\nNikolas Hulewsky (36:06.624)\r\nChatDBT will give those prompts, or outputs, very simply.\r\n\r\n\r\nDant (36:24.739)\r\nAnd I was just putting them in text files, right? When I started six months ago, all I did was run some Python scripts and it created some text files. Well, those were far better than anything I'd ever had. And so the next question was, how do you actually pull it together into an app? And Replet was a very good tool at helping us achieve that.\r\n\r\n\r\nNikolas Hulewsky (36:43.958)\r\nThat is so, okay, so you wrote some software first that pulled data from HubSpot into just text files. And then you thought, well, I don't want text files. How can I get it into like an actual software that I can use? So then you go again and use AI and ask it, like, how do I build this? And it says, go to Replet and these are the steps you take, whatever. And then you actually built the software.\r\n\r\n\r\nDant (36:49.863)\r\nYep.\r\n\r\n\r\nDant (36:58.299)\r\nYep.\r\n\r\n\r\nThat's your act.\r\n\r\n\r\nDant (37:08.171)\r\nExactly. So, you know, those scripts turned into this HubSpot client, which actually handles all my talking to HubSpot. You know, that turned into how do we do the data processing?\r\n\r\n\r\nAnd there it all is. And then that turned into reporting. Now, I had the advantage that I've worked in software for a long time, so I understand some design about how to architect the software itself. But I was terribly bad developer. And so this is how I got it all done.\r\n\r\n\r\nNikolas Hulewsky (37:38.41)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (37:47.646)\r\nNo, I love you talking about this because I'm trying to train myself to be better. I'm still not great at it. But what I try to do when I'm starting something like this, will you go back to the software that you built the like six days? Okay, cool. This is perfect. So I'm looking at this and I'm like, I wouldn't have even thought of six days, right? But because you had project management experience, you're like, hey, this is just standard. And this is how I'm gonna format things.\r\n\r\n\r\nDant (38:00.327)\r\nYeah, absolutely.\r\n\r\n\r\nNikolas Hulewsky (38:16.948)\r\nSo for somebody who doesn't have your experience, for somebody who's not a coder, what I do is I will ask a very open ended question. And I've had to like really work on this myself. And I just say, chat GPT, I am trying to generate a weekly report for myself so that I know where things are outstanding in HubSpot. I've never done this before. I'm not a project management specialist. Can you help me outline the steps that I need to take from today, which is\r\n\r\n\r\nno report to, you know, whenever in the future where I have a report telling me every outstanding item in HubSpot. And then it'll generate for me some outline, but I at least have something to go off of. And maybe I don't like exactly it, or maybe, maybe the next question I ask is, is anything missing or what am I not thinking about that I should be if I was a project manager and ask it to do those things as if it were the expert and it will start prompting you.\r\n\r\n\r\nto ask the right questions. It will start giving you the right information so that you can get to a place where it still might not be as good as yours, Dan, just because you have 20 plus years of experience, but it'll be functional and it'll be good enough for you to start implementing into your company.\r\n\r\n\r\nDant (39:26.631)\r\nyou're 100 % on target when, you know, I'm the president of the company. I don't have unlimited time to write software. But what I did was I identified, hey, I think it's hard in HubSpot to figure out what are all the open tasks that people have. Because I had to go across a lot of screens. And so I began and I said, can you write me a Python script that will...\r\n\r\n\r\nNikolas Hulewsky (39:47.008)\r\nYeah.\r\n\r\n\r\nDant (39:53.669)\r\ncall the API and just find me the open task and just dump it in a text file. Then I would take that text file and I would dump it back in AI and say, format it, analyze it, understand it. And as momentum built, it just came together in the more structured view that you're seeing today. But it's completely inerriff and anybody can do it if you have curiosity and maybe a modicum of pain threshold that you're willing to invest.\r\n\r\n\r\nNikolas Hulewsky (40:12.32)\r\nThat is so cool. That is so cool.\r\n\r\n\r\nNikolas Hulewsky (40:22.07)\r\nThat's amazing. was, Dan, this was amazing. Thank you for.\r\n\r\n\r\nDant (40:29.659)\r\nSo I'm just gonna wrap up with one or two things for you. So when I pulled this information, you saw stage histories in that analysis report. so this is the actual, you can see that the notes, the stage history and the task, that data was stored and that's how the analysis is able to take two or three of these reports. So effectively I would have to have taken the Monday version.\r\n\r\n\r\nNikolas Hulewsky (40:32.074)\r\nYeah.\r\n\r\n\r\nDant (40:57.639)\r\nAnd then the new Monday version and laid them side by side and said, what changed? And that's what the AI analysis is doing for me automatically now every day.\r\n\r\n\r\nNikolas Hulewsky (41:07.008)\r\nSo are you having to push anything or is it automatically at a certain time?\r\n\r\n\r\nDant (41:11.207)\r\nThis beast runs, quote, process analysis, my version of it coming to me personally, runs Monday through Friday at 8 10 a.m. All the data collection's taken at, you know, like 5 a.m.\r\n\r\n\r\nNikolas Hulewsky (41:22.006)\r\nHow do you-\r\n\r\n\r\nNikolas Hulewsky (41:26.806)\r\nHow do you generate it? Because I think ChachiBT OpenAid just came out with the schedule function where you can actually schedule it to run something.\r\n\r\n\r\nDant (41:35.527)\r\nSo it's a great question that you're asking. Because this is a custom piece of software, I have a scheduler in it that kicks off these jobs at these times.\r\n\r\n\r\nNikolas Hulewsky (41:46.864)\r\nOK, and because you have the API key, that's what's pushing the call. OK, that makes total sense.\r\n\r\n\r\nDant (41:50.011)\r\nThat's correct. I called the APS at this time. That's what's calling it. That's correct. See, if we wanted to say right now, quote, process analysis, we can hit generate. It's going to spin for a minute. And what it's doing is it's going and pulling the two reports, today's version and the seven day old version. And then it's going to send it, in this case, to Anthropic, do the analysis. I chose Anthropic because I had a large context window. And then it's going to send it back.\r\n\r\n\r\nAnd what it normally does is it just sends it to my email. But I can come over here at any point and run these reports on demand if I want. And so it just analyzed these two from the 15th and the 8th, and there's your report.\r\n\r\n\r\nNikolas Hulewsky (42:36.65)\r\nDan, you never wrote code before?\r\n\r\n\r\nDant (42:39.665)\r\nvery poorly. Very poorly. But I watched a lot of pardon me? No. Well, that's not fair to say. There's a lot of YouTube videos that I watched. Replet has a course that's 100 days to Python. And I literally watched that series of 20 minute YouTube videos. Unbelievable teaching.\r\n\r\n\r\nNikolas Hulewsky (42:40.926)\r\nOkay, but let's just say you very poorly wrote code. Did anyone help you build this? Did anyone help you build this? You built.\r\n\r\n\r\nNikolas Hulewsky (42:53.824)\r\nSure, sure, sure, sure.\r\n\r\n\r\nNikolas Hulewsky (43:03.348)\r\nI guess what I mean is did a developer come in after you started messing around with this and like touch up?\r\n\r\n\r\nDant (43:07.671)\r\nThis is all my, I don't mean to say my, that sounds pretentious. This is something that me and the AI tools have built together from a blank screen to what you see today.\r\n\r\n\r\nNikolas Hulewsky (43:21.162)\r\nThis is so cool. my gosh, Dan, this is amazing. This is awesome.\r\n\r\n\r\nDant (43:25.893)\r\nSo you kicked off on X today and you said, you don't want to hear AI theory, you want to see AI results. And I hope I've delivered that for you. And it's certainly something I want to be able to share, not only how to do it, but under the right circumstances. It may be appropriate to share with other manufacturing companies or other people because...\r\n\r\n\r\nNikolas Hulewsky (43:32.522)\r\nYeah. Yeah.\r\n\r\n\r\nDant (43:50.907)\r\nYou know, us small family-owned companies, we have incredibly important role that we play in our communities in terms of who we hire and the income that we drive into the communities. But we never have access to the best technologies. That's just not acceptable for me. And we have this strange mishmash of ancient technologies, but we have AI available to us now. And it is a real democratizer of what being on the leading edge can look like.\r\n\r\n\r\nNikolas Hulewsky (44:17.514)\r\nYeah.\r\n\r\n\r\nDant (44:18.683)\r\njust have to talk to each other and see what we can share and help each other with.\r\n\r\n\r\nNikolas Hulewsky (44:21.93)\r\nI mean, you've built a custom system to not only, it's not HubSpot in the sense that it's like tracking everything, but it's like your executive assistant every day telling you, hey, where are we in the quote process? And for every one of these processes, you can have it built out. It's saving you hours.\r\n\r\n\r\nDant (44:35.353)\r\nAre you?\r\n\r\n\r\nThat's exactly what we've done. In a larger, frankly chubbier organization, we'd have had analysts that did this work. And I can't afford that in a family-owned business.\r\n\r\n\r\nNikolas Hulewsky (44:47.956)\r\nRight.\r\n\r\n\r\nDant (44:50.917)\r\nYou know, two things happen. I either want more people building products or I want to be able to take that money and help use that as part of the wages that we do. You know, if I overconsume money in overhead, it doesn't mean I can pay people as well. So leveraging AI.\r\n\r\n\r\nis really one of the best hopes that I have to be able to pull costs out of the overhead functions, which are necessary, to be able to increase, to be more efficient, more productive, and increase the pay that goes to our workforce. And it's tough challenge when you're competing against China.\r\n\r\n\r\nNikolas Hulewsky (45:27.654)\r\nagree this Dan this has been fantastic you blew my mind I'm gonna",
  "metadata": {
    "duration": "",
    "date": "2025-04-14",
    "platform_source": "Google Drive"
  }
}