{
  "episode_number": "124",
  "episode_title": "How to Piggyback Your Way to Success: AI, Med Spas, Golf Courses and More with Chris Koerner",
  "guest_name": "Chris Koerner",
  "business_name": "",
  "transcript": "﻿Chris Koerner (02:15.662)\r\nWell, let's start. Let's start with a non-business story then that goes along the same lines. So we go to raisin canes as a family. Okay. Shout out Todd graves, raisin canes founder billionaire. Okay. And I'm wearing my shirt that says 55 burgers, 55 fries, 55, right from, think you should leave the drive through skit. And I was just, I just happened to be wearing it that day. We weren't planning on going inside raisin canes, but I had my mom there. We had a bunch of people there and I'm looking at the menu and I'm like, man, this place is expensive.\r\n\r\n\r\nNikolas Hulewsky (02:18.706)\r\nOkay? Okay?\r\n\r\n\r\nNikolas Hulewsky (02:33.374)\r\nYes, yes.\r\n\r\n\r\nChris Koerner (02:45.71)\r\ngonna be like 100 bucks. So I just ordered a catering order. I ordered a big tray of fries and a big tray of chicken and it was cheaper and it was more food for feeding everyone. But then I didn't even realize I was wearing the shirt, which is like ordering way too much fast food. And everyone in the kitchen was like, I love your shirt. I love your shirt. When I say everyone in the kitchen, I mean one guy, but still it made me feel good. I just what are the chances I would order all this fast food. So but I got a shout out.\r\n\r\n\r\nNikolas Hulewsky (03:10.442)\r\nWhat are the chances? If somebody out there doesn't have any, if they don't know what we're talking about, go just search on Google 55 burgers, 55 fries. It's a sketch from, think you should leave. That's so good.\r\n\r\n\r\nChris Koerner (03:18.786)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (03:23.246)\r\nI got another compliment from a stewardess on an airplane for that shirt. She was like 60 something years old and she liked my shirt. I assume otherwise she just liked a really random looking shirt.\r\n\r\n\r\nNikolas Hulewsky (03:27.454)\r\nGo on.\r\n\r\n\r\nAnd she, got the reference.\r\n\r\n\r\nNikolas Hulewsky (03:36.906)\r\nI really like your shirt. That's what I get every time. 55 burgers, 55 fries. For those who don't know, the sketch is this. Tim Robinson goes through a drive-through and he orders, excuse me. Yeah, he orders. goes to the window and he goes, hey, I want to pay for the guy behind me. I don't know, paying it forward. Maybe it'll catch on. Maybe it'll catch on to a pay.\r\n\r\n\r\nChris Koerner (03:40.334)\r\nyou\r\n\r\n\r\nChris Koerner (03:59.958)\r\nI thought I'd do something nice. I don't know.\r\n\r\n\r\nNikolas Hulewsky (04:04.458)\r\nAnd so, as the lady takes his payment, she's like, oh, that's sweet. And as soon as he does it, because he knows he's starting a pay it forward chain, right? Like the idea behind that is the next person is like, oh, they paid for me, cool, I'll pay for the person behind me. Tim screeches out, pulls around, goes back to the order, and he goes, I want to order 55 burgers, 55 fries, 55 cokes. He's just like ordering a bunch of food because he knows the person in front of him is going to be paying for his order now. Let's just say hilarity ensues.\r\n\r\n\r\nChris Koerner (04:26.028)\r\nyou\r\n\r\n\r\nChris Koerner (04:30.862)\r\nYeah.\r\n\r\n\r\nhilarious. Yes. And then he then the guy gets mad at him. And then he finally starts to apologize after Tim says, I just wanted to do something nice before alcohol class. And then the guy feels bad and he starts apologizing. And then right when Tim has him, he goes, I can just run. And he gets out of\r\n\r\n\r\nNikolas Hulewsky (04:36.51)\r\nmy god.\r\n\r\n\r\nNikolas Hulewsky (04:52.778)\r\nIt's so good. no!\r\n\r\n\r\nNikolas Hulewsky (00:02.775)\r\nkeep keep rolling, rolling, rolling, rolling. All right, dude, it's been a couple of weeks since we talked. I'm freaking stoked. have two main ideas I want to talk to you about. Which one do you want to talk about first? Med spas and golf courses or the good and bad of AI agents?\r\n\r\n\r\nChris Koerner (00:25.164)\r\nHmm, let's talk about med spas because I got a joke to go along with that.\r\n\r\n\r\nNikolas Hulewsky (00:29.673)\r\nAll right, so we're getting older. We're millennials. Millennials are vain, but they're also worried about their health. And so we're seeing massive explosion in med spas. For those who don't know what med spas are, they are essentially cosmetic places for people to go and relax, but they give things like Botox, injectables. Some of them do more health related things. So they'll do like the semi-glutide treatments, right? Everyone's heard of Ozempic. That's what those are.\r\n\r\n\r\nhormone replacement therapies, some do testosterone replacement, but essentially it's aesthetics. It's coming in, you're aging, you want to get some fillers, you want to get some Botox, whatever. They're taking off like crazy because our generation in particular, we're not only obsessed with health, but we're obsessed with aging. And so here's some stats. The current meds by market in the United States is about $4 billion, but it's growing at over 10 % a year annually. So just for context, like the U.S.\r\n\r\n\r\nTotal economy is probably growing at 2 to 3 % a year. So, MedSpas are growing at five times the average rate of growth in the United States economy. So, they're growing like crazy. They have great margins, like 15 to 20%. Some of them can even go higher than that. And you're doing something that's like one of my favorite frameworks, which is taking advantage of a current trend. Like you have the tailwinds pushing behind you. There's a quote that I like. A quote that I like that's like, my favorite boat is a boat that has a tailwind. So, it's like, cool.\r\n\r\n\r\nChris Koerner (01:49.806)\r\nTidal wave.\r\n\r\n\r\nNikolas Hulewsky (01:57.591)\r\nYou know how to do a rowboat really good. That's great. I'm just gonna go to the place where I the wind's gonna be pushing at my back. to me, it's taking advantage of like a couple of these things that are coming into place. And so I love MedSpas. A friend of mine, it has a membership at a golf course and some golf club and a new buyer out of California bought the golf club. They're shutting it down, they're renovating it and they're gonna be building some new condos on like they're making it a lot nicer. They're putting some amenities in and\r\n\r\n\r\nhe approached the owner and was like, Hey, what if we added a golf or a med spa and we give a discount to the members and the new owners like, that's really interesting because it allows to give another benefit to its members. It's sticky. It's high margin. The people who are able to afford the med spa or excuse me, the golf membership are probably also going to be able to afford the med spa. hopefully we don't get a lot of hate mail, but probably 90 % of golf memberships are men golfing.\r\n\r\n\r\nSo this gives an opportunity for like men to bring their spouses to the club and give them an added benefit. like it reduces some tension there. And so they're like, they're in talks right now of developing a med spot that would like go on the campus of the golf course with this new bill that's happening. So as I saw that, I was like, dude, that's super interesting. He's piggybacking. Like it's what we talk about all the time. And it just happens to be on the local level. I think it would be really interesting if you were, if you were interested in doing the med spa.\r\n\r\n\r\nChris Koerner (03:12.738)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (03:26.335)\r\nin looking at country club memberships, golf membership, tennis club member, wherever, and scoping out spaces near those establishments for space at a med spa. And you could test this idea a million different ways, but that's sort of the general premise that I've set up. What do think?\r\n\r\n\r\nChris Koerner (03:40.035)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (03:46.071)\r\nDo you know what the structure is? Like, is he just gonna pay rent? Is it gonna be a revenue share agreement?\r\n\r\n\r\nNikolas Hulewsky (03:52.535)\r\nSo they haven't worked it out yet. According to my friend, the owner of the golf club is like not interested in having equity. This is according to him. I can't imagine a scenario where I would do that. I would think there'd be some type of a rev share or affiliate agreement or something. But according to him, he's like, no, he just likes the idea of there being an added benefit for his members. And so I would just come up with the money.\r\n\r\n\r\nI would do the remodeling. would provide the physicians and the clinical oversight. I would do all the business and give a discounted rate to the club. He would have no equity ownership in it. So according to him, that's the current model. I don't think that's normal though. I think that these golf clubs would want a share. And frankly, that's how I would pitch it. It's like, you would get a piece of this because I'd really want them bought in to the med spa.\r\n\r\n\r\nChris Koerner (04:29.678)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (04:44.728)\r\nYeah, I look at it as kind of like the like a Walmart model or an indoor shopping mall model where the parent leaseholder like Walmart or a shopping mall takes not a percentage of equity, but a percentage of revenue percentage of your sales. Like when I had an iPhone repair store inside a mall, we had to pay 2200 bucks a month plus like 10 % of all of our revenue. And that was standard. That's normal. So to me, that would make sense because if it's like a, if it's a big MedSpot company,\r\n\r\n\r\nThey probably don't have a vehicle for giving away equity in a location to some random golf course owner, but they probably do have a vehicle to giving away a percentage of revenue, right?\r\n\r\n\r\nNikolas Hulewsky (05:24.161)\r\nYeah, that might work. The other example of this are like optometry centers, eye clinics. I don't know what the word to call them is, but like every Walmart has an eye center, Right. Costco has these as well. So it's like, it's not unprecedented. my members are this demographic. They also like these things. Let's put that offering in there. So the,\r\n\r\n\r\nChris Koerner (05:33.174)\r\nYeah, we're like a great clip subway inside of Walmart and all that.\r\n\r\n\r\nNikolas Hulewsky (05:49.195)\r\nThe golf course med spa is a good pairing, but I'm sure there's tons of these types of pairings anywhere that you have memberships. So that's why I mentioned like the tennis club, country club. I'm trying to think of some other, whatever membership types of companies. If you look at that, there is some other adjacent offering that that current membership isn't giving that you can take advantage of. think working your way backwards again from the distribution are some cool ways to identify opportunities.\r\n\r\n\r\nChris Koerner (05:52.131)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (05:56.738)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (06:12.386)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (06:18.114)\r\nFun fact, did you know that there's a regulation that requires optometrists to have an exterior door? And so if you find a Walmart that has an optometrist inside, you will see a random door on the front of the Walmart leading only into that optometrist. Did you know that? My friend Dan owns an optometry clinic inside a Walmart in Washington.\r\n\r\n\r\nNikolas Hulewsky (06:35.552)\r\nNo, I did not know that.\r\n\r\n\r\nNikolas Hulewsky (00:01.906)\r\nYeah, I mean, that doesn't surprise me. Like home, health and hospice, had to have separate entrance and exit doors. So I'd like from a healthcare standpoint, I guess I could see that being the case, but no, did not. I did not know that. So every Walmart eye center has a separate entrance.\r\n\r\n\r\nChris Koerner (00:09.134)\r\nMmm.\r\n\r\n\r\nChris Koerner (00:15.31)\r\nMm hmm. Looks really random too when you look for it. I got a couple thoughts. I got a couple thoughts. So I like the idea of piggybacking on golf courses in general. I wonder what else you could do there. On one hand, this med spa idea is like, this is really interesting because now husbands can bring their wives to the golf course and the wives can just go to the med spa and the husband's going golf. Now on the other hand, that's not a behavior. You know what I'm saying? That's not a current behavior.\r\n\r\n\r\nNikolas Hulewsky (00:17.256)\r\nOkay.\r\n\r\n\r\nHow do we make money off of that? I'm just kidding.\r\n\r\n\r\nNikolas Hulewsky (00:43.208)\r\nHmm.\r\n\r\n\r\nChris Koerner (00:44.238)\r\nSo that makes me nervous. So I don't know, like, you know what I'm saying? If it's 90 % men that go to a golf course and 90 % women that go to a med spa, is that doomed for failure or? You know what I'm saying?\r\n\r\n\r\nNikolas Hulewsky (00:46.974)\r\nI see what you're saying.\r\n\r\n\r\nNikolas Hulewsky (00:57.32)\r\nWell, yeah, the flip side I would say to that is men are using Botox more and more as a percentage of the population. This particular golf course has other amenities for families. So there are a lot of families that come. Yes, yeah, that's the best way to say it. It's not just a golf club, it's a country club. So I don't disagree with you, right, because you're making some assumptions on behavior, but that's probably why the golf course is like.\r\n\r\n\r\nChris Koerner (01:09.568)\r\nHmm. It's like a country club. Okay.\r\n\r\n\r\nChris Koerner (01:18.817)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (01:25.874)\r\nYeah, cool if you want to open it will be good. Good for our members, but you know they're not necessarily taking skin in the game, but that's yeah, it's a good.\r\n\r\n\r\nChris Koerner (01:31.948)\r\nYeah. Another idea. I had a guest on my podcast a few months ago that opened a sauna slash cold plunge business inside a gym and it's going great. And the build out is not that much. He bought two cold plunges for like five grand each and then two saunas for like 10 grand each and just plopped them inside this empty square footage that the gym had right when you walk in. So like you walk in, there's the desk, you go to the right.\r\n\r\n\r\nNikolas Hulewsky (01:56.755)\r\nHmm.\r\n\r\n\r\nChris Koerner (01:59.192)\r\nto go use the gym and then like straight in front of you there was this empty room that they weren't using and he just runs it from the gym and that was his first location. Why not at a golf course? Yeah. Or at a country club.\r\n\r\n\r\nNikolas Hulewsky (02:05.022)\r\nOoh, me likey likey. That'd be perfect for golf course. Yeah, golf course is country clubs. Again, that's the perfect population. They're gonna be the guys who are like.\r\n\r\n\r\nChris Koerner (02:15.234)\r\nLike this, eh?\r\n\r\n\r\nNikolas Hulewsky (02:18.29)\r\nGood. I was gonna say, those are gonna be the guys who are like, yeah, I got my country club membership and we have now a cold plunge in a sauna.\r\n\r\n\r\nChris Koerner (02:19.352)\r\nThere you go.\r\n\r\n\r\nChris Koerner (02:26.862)\r\nWell, just as like a framework, could be find a facility that already has a locker room showers in a bathroom, and then go piggyback your cold plunge and sauna on top of that. Maybe it's a gym, maybe it's a country club. Maybe it's a pool, like a public pool, right? What do we think?\r\n\r\n\r\nNikolas Hulewsky (02:44.68)\r\nYeah. Dude, okay. I'm gonna take your framework, bring another framework, seemingly unrelated, but I think it is related. I think all of it, well, at least you and I have definitely had these experiences like where we're like, I wanna buy some Amazon stock. Nah, it's overvalued. It's probably the highest ever gonna be. I've been saying that for 20 years, right? Tesla stock, you could have said the same thing. Apple stock, like whatever the stock is, you're like, I think it's kind of hit its peak and it's only ever continued.\r\n\r\n\r\nChris Koerner (03:03.374)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (03:09.923)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (03:15.027)\r\nto grow.\r\n\r\n\r\nChris Koerner (03:16.034)\r\nBut at some point, you are right. You could be right. So there's two sides of that.\r\n\r\n\r\nNikolas Hulewsky (03:19.368)\r\nSure, sure, yeah, yeah. I do think that there is a point where you reach market saturation and you're of like capped from that standpoint. But 20 years ago when we were looking at this, if we had been smart and been like, hmm, these are the user adoption trends. Wow, 50 % of the market's still not on the internet. my gosh, what percentage of people actually order things from Amazon? how many people have an iPhone? Like if we would have done more critical analysis, we probably would have said, yeah, this is the way that things are going and now I'm better at doing that.\r\n\r\n\r\nChris Koerner (03:48.226)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (03:49.95)\r\nThat's the same way I feel about some of these trends. So you might say, cold plunge in saunas, it's over saturated at this point. But the truth and the reality is we're not. If you want to go and open a cold juice smoothie place, yeah, we're probably over saturated. Jamba Juice did that 20 years ago. But cold plunges in saunas, no. So like just finding those things that are trends that you see becoming more and more popular and then\r\n\r\n\r\nChris Koerner (03:58.466)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (04:09.304)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (04:18.91)\r\nputting them into places to give people access is an interesting framework because most of the time I would think like, ah, cold plunges and saunas, those are oversaturated, but they're not, like they're just not yet. Like if you look, what's that graph that's like the distribution of early adopters? Yeah, but it's like early adopters, adopters, and then like by the time it goes mainstream, it's still not even done growing, right? So it's like, I don't even think\r\n\r\n\r\nChris Koerner (04:35.042)\r\nbell curve or yeah yeah\r\n\r\n\r\nNikolas Hulewsky (04:48.742)\r\nand sonnets have gotten mainstream. So there's an opportunity to place it.\r\n\r\n\r\nChris Koerner (04:51.382)\r\nNo, on Twitter they have, right, which is not representative, but I'm thinking of the mid whip meme bell curve, right? On one end, it's like, and this is more related to like market size in general. On one end, it's like anecdotal data. Like my friend doesn't have a cold plunge, so we're early, right? And then you go to the middle and it's like, yeah, but that's not an accurate sample size. And then on the other end, I think that's still true. Like,\r\n\r\n\r\nNikolas Hulewsky (04:58.12)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (05:10.803)\r\nYou\r\n\r\n\r\nChris Koerner (05:18.806)\r\nYou have to be experiencing something that's happening in that industry for it to be relevant or not. For instance, I go to church with a bunch of people, my similar age, literally, and this is not an exaggeration of like 50, 60 families. go to church with 80 % of them have pools. Right. And maybe of those 80 % more than half were since COVID and those pools cost 130 grand, but of those families that have pools, how many of them have cold plunges or saunas?\r\n\r\n\r\nI don't think any of them, right? So if you can afford a pool, you have family and you're of the demographic that values the benefits that cold plunges and saunas offer, then statistically speaking, all those people I go to church with are probably going to own a cold plunger asana at some point, but they don't yet.\r\n\r\n\r\nNikolas Hulewsky (06:03.486)\r\nAnd adding onto that, I know I just crapped on Jamba Juice a second ago, but Jamba Juice has proved that there's demand for smoothies. There is probably somewhere in this world, many places in this world in the United States, where you could plop a Jamba Juice down and it would do really well because there's some percentage of demand, right? So there's always going to be demand for these things that seem like a trend. Crumble cookies is an example, right? Crumble May plateau at some point.\r\n\r\n\r\nChris Koerner (06:22.538)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nChris Koerner (06:30.594)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (06:32.808)\r\nbut there's always going to be a place that would support a crumble cookies franchise. So just going back to it, it's about thinking through the distribution. I love the gym idea. Freaking love that idea of like placing these saunas. I love the idea of placing these saunas at tennis clubs, at fitness clubs, at country clubs, like golf courses, wherever. You just need to think through, okay, where are the people who would use this going? And how can I get them access? Like how can I get them distribution to this product? It's just a really cool way to think about it.\r\n\r\n\r\nChris Koerner (06:43.534)\r\nyou\r\n\r\n\r\nChris Koerner (06:56.269)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (07:00.366)\r\nMm hmm. I agree. I had some other thoughts on that. Left me. Hold on. Look my notes.\r\n\r\n\r\nNikolas Hulewsky (07:04.67)\r\nWe're so smart.\r\n\r\n\r\nChris Koerner (07:19.052)\r\nOkay, yeah, that's it. So when you were talking about med spas and golf courses, I started thinking about other piggybacking opportunities, right? And how like, this med spa is gonna go one of two ways. It hasn't opened yet, right?\r\n\r\n\r\nNikolas Hulewsky (07:28.414)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (07:33.416)\r\nYeah, no, no, no, no.\r\n\r\n\r\nChris Koerner (07:36.396)\r\nIn my opinion, it's going to crush or it's going to completely tank. Right. That's you. That's nothing in between. That's usually how new things go. Like a MedSpot, a golf course is a new thing. He's either going to find perfect product audience fit, or it's just not going to go well because golfers don't go to MedSpots. Okay. How far away are we from remember the game, the Sims, right? How far away? And this is way too niche. Like not niche for the people listening, but it's niche for the general public where we can have an AI enabled Sims game.\r\n\r\n\r\nNikolas Hulewsky (07:40.018)\r\nYeah\r\n\r\n\r\nChris Koerner (08:06.702)\r\nwhere we can like play out scenarios like that, on a, on a computer, on a simulation, for instance, with the perfume vending machines, what I, one thing I said in that first video, they went viral was I wish I could take a hundred of these things and place them in a hundred different types of venues, gas stations, meds, but all different types. And then just look at the data and say, wow, for whatever reason, the perfume vending machines right next to the ice cream store, just crush.\r\n\r\n\r\nJust crush every single one of them without exception. We need to go find all the ice cream stores, piggyback and put a perfect, like you can't do that affordably. You can't do it. You got to spend millions of dollars and you got to call. You got to play some, but like, what about an AI enabled something where I'm thinking like a deep research, right? Or a chat GPT pro version where you can just type in a prompt and it's going to run simulations based on everything it knows about traffic counts about\r\n\r\n\r\nNikolas Hulewsky (08:41.544)\r\nHmm\r\n\r\n\r\nChris Koerner (09:01.912)\r\nhuman psychology, human behavior, without spending a dime outside of your $200 a month subscription fee, you can get that question answered for you. What do we think?\r\n\r\n\r\nNikolas Hulewsky (09:12.446)\r\nHow would you do that? I would like, I love the idea. There's two, because there's, there's two things that you're talking about. The first thing is you need to, like figuring out what the demographic is of your ideal customer. And by demographics, I don't just mean like white, black, male, female, rich, poor, but like, no.\r\n\r\n\r\nChris Koerner (09:30.476)\r\nhuh.\r\n\r\n\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (09:37.342)\r\n35 year old living in this type of city, they drive this type of car, they go to this kind of a store, like just very granular stuff. So figuring out your ICP, that's one of them. And then the other one is like testing whether or not this would actually work. Because you can have your ICP and you can think, in this area, it's going to work. But then you go to test it and it's like, this didn't work. This isn't where you were going with it. But one thing I thought would be really interesting is\r\n\r\n\r\nChris Koerner (09:42.262)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (09:53.73)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (10:05.73)\r\nthis would be for someone who actually had some money. Let's say, how much did these coal plunges cost?\r\n\r\n\r\nChris Koerner (10:11.127)\r\nI five grand or so.\r\n\r\n\r\nNikolas Hulewsky (10:12.498)\r\nOkay, so let's say you and I are like, let's drop 20 grand and buy four of these. like one or two coal plunges to Saanis. Cool. And then we just go to different places and for a month, test them at each place. It's like, hey, Jim, can we just rent this from you for a month? Cool. And then see what demand is like. And then we go to the mall. Hey, mall, you have this open spot. Can we rent this for you from you for a month? So there would definitely be some upfront costs. You'd have to buy the Saanis. You'd have to pay some rent.\r\n\r\n\r\nChris Koerner (10:24.194)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (10:42.622)\r\nbut you would like really quickly get to be able to test demand. Like that's one way to do it. Or you could just do the growth hack things that you've done in the past, which is like go to the gym and say, Hey Jim, can I just put a sign up here that says in two months we're going to have a sauna and cold plunge sign up here if you're interested just to test demand, right? that. Yeah. Yeah. So like there's a bunch of different ways I think you could go about testing demand. The question is,\r\n\r\n\r\nChris Koerner (11:00.251)\r\nMm hmm. For get your first month free by giving us your email with a QR code.\r\n\r\n\r\nNikolas Hulewsky (11:11.774)\r\nBecause I'm with you on this. How do you then leverage AI to make sure that you're you have a higher probability of success? That's that's the piece I'm like. How would you? How would you use AI for that?\r\n\r\n\r\nChris Koerner (11:22.422)\r\nOkay. I got an idea. You ready? Let's use the cold plunge example. So let's just speak hypothetically. We want to know what type of location could we piggyback? Let's just say cold plunge, no sauna, just cold plunge. Okay. All right. So what data is out there? You've got IBIS world reports. Okay. On industries. So we can have operator go pull. And now I know that costs money, right? Hear me out. It goes and pulled.\r\n\r\n\r\npulls an IBIS World report on the cold plunge industry and it can tell us in what states they're trending the most. Okay. Okay. So we can whittle it down there. Then we can take it a step further. You can go to Google trends and you can find out which states proportionally speaking to this population are searching for cold plunges the most. So that's a second data point for the same type of research. And then you can say, go to the Wisconsin franchise search because Wisconsin is one of the only states that forces\r\n\r\n\r\nfranchisors to publish their FDD, their franchise disclosure document freely for the world. So then you could say, you probably won't even need to tell it would just do this. In this scenario, it would go to the Wisconsin franchise search webpage, it would search for any franchise that offers any type of cold plunge services, it would read the entire franchise disclosure document, it would find the locations that are performing the best. Let's say Colorado is a state where everyone's searching for it.\r\n\r\n\r\nNikolas Hulewsky (12:30.11)\r\nEhem.\r\n\r\n\r\nChris Koerner (12:49.77)\r\nIt finds all the franchise locations in Colorado and it finds the four best performing stores and it learns that all four of them are next to an LA fitness. Okay. And like it could stop there and automatically, know, okay, LA fitness, they might have a contract with this franchise. So I can't go there, but I can go to a planet fitness or I could go to a mom and pop gym in Colorado. And I know that my chance of success will be significantly higher. And it only looked at like two or three different things.\r\n\r\n\r\nNikolas Hulewsky (13:05.393)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (13:19.052)\r\nAnd it's it's already capable of doing all that today. What are you thinking?\r\n\r\n\r\nNikolas Hulewsky (13:22.75)\r\nI freaking love that. The minute you started talking, I had the idea. Do you remember a few months ago or weeks, I don't know when it was, where we were like, you need to be thinking now how you're gonna use AI? This is one of those perfect examples of in the past, saunas are really taken off. Where could I place them? Hmm, I don't know. Google, where do I typically place saunas, right? You're using Google as like this question and answer. Now your frame of reference, you can go to, I'm gonna use AI.\r\n\r\n\r\nThey're my employee. They're going to help me find this. Even before you go to the steps that you said, you're just like this prompt. You have PhD level experience in the sauna industry. I would like to not only learn about the industry, but find the best locations for this. Help me walk through how I would go about gathering this information. And then all of sudden you have a, how should I think about this? And then all of a sudden you have a two way sort of communication with AI and it's like helping you think through it.\r\n\r\n\r\nChris Koerner (14:11.682)\r\nHow should I think about this?\r\n\r\n\r\nNikolas Hulewsky (14:19.102)\r\nAnd then eventually you'll get to like, okay, cool, cool, cool. Yeah, that's a good idea. I should look at whatever X, Y, and Z criteria. Great. Now take that criteria and you can do that with ChatGPT with 20 bucks a month. Then you go to deep research and operator and you can say, hey, look, this is what I want you to do. I want you to go to these websites. Then I want you to pull this data. Then I want you to aggregate it here and put it in one place. Then you can look at the data and then you ask deep research to say, okay, this is the data.\r\n\r\n\r\nTake the data I've collected, take all the data on the internet, merge them together, tell me the top five opportunities, give me the justifications and how much it would cost me to operate in those markets. Like that right there you could do probably in a day or two that would have normally taken us, I don't know, two weeks, right? Like it's like you find like one subreddit and then all of sudden you talk to a guy and you have a conversation and it takes us a long time to kind of like aggregate all this information, but all of a sudden you've got two employees working for you.\r\n\r\n\r\nwith AI and you can very quickly get to the point where you're like, cool, now I know this is my target demographic. These are the places I need to look in my city. This is where I want to place them. And all of a sudden you've increased the probability of your success by 50 % just by having the right research. Like I love freaking, I love that framework.\r\n\r\n\r\nChris Koerner (15:18.606)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (15:30.701)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (15:40.408)\r\nWell, dude, and not just that, but how many times have you heard a random podcast or watched a random YouTube video that had like something insanely insightful that you've never heard anywhere else? Right. I interviewed this guy that has this business inside a gym, sauna and cold plunge, and he got super tactical in my interview and he, this guy doesn't go on podcasts. I think mine was the only one he's ever been on. And he was very like, this is what we charge. This is what our churn is. This is how many sales we did the first year. This is the address of the gym. The gym has two locations.\r\n\r\n\r\nNikolas Hulewsky (15:48.616)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (16:09.238)\r\nOur second location is not going to be in a gym. Like no one's going to find that. You're just not, but AI could find.\r\n\r\n\r\nNikolas Hulewsky (16:14.142)\r\nI have a tip for people that I think will make somebody listening to this, if they implement it, a ton of money, a ton of money. I'm not, like this is not hyperbole. Go to YouTube. Yeah.\r\n\r\n\r\nChris Koerner (16:26.648)\r\nThat's the hook, Mohammed make that the hook. Is this called the, is this called the just the tip segment?\r\n\r\n\r\nNikolas Hulewsky (16:32.488)\r\nThis is just the tip, my friend. Let's say that you find that interview, right? And it's like, go to Chris's interview, copy the URL, then go sign up for this software called Descript. I think the free version offers this. Even if the free version doesn't, it's like maybe five bucks. I don't know. Copy the URL, paste it into Descript. Guess what's going to happen? Descript is going to transcribe that whole entire conversation for you.\r\n\r\n\r\nIf you've ever tried to transcribe anything from YouTube, it's a pain. It doesn't give attribution to who's talking. The breaks in the lines are like really difficult. The time markers make it weird, but you copy and paste into Descript, you will have the entire transcript. And now you can take that and put it into ChatGPT and say, this person talked about saunas on Chris's podcast. I would like you to summarize their business model. Help me understand distribution, startup costs, margins, who I need to hire, like any questions that you want.\r\n\r\n\r\nChris Koerner (17:09.645)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (17:30.994)\r\nand it will spit it out for you because someone gave a super insightful interview. And now you have the transcript that you can then put into chat GPT or Gemini or like whatever else you use, right? But I've used this so many times, like just prepping for podcasts that there's a ton of value doing this. I promise you, if you're listening to this, do it. Like you like, and thank me later. It will make you a lot of money.\r\n\r\n\r\nChris Koerner (17:40.952)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (17:54.606)\r\nThat's a great tip.\r\n\r\n\r\nNikolas Hulewsky (17:56.476)\r\nJust a tip.\r\n\r\n\r\nChris Koerner (17:58.254)\r\nBut you know what I mean? Like it could do all this research on these public of publicly available databases, IBIS world, Wisconsin franchise search. It could look at S one documents for publicly traded companies. It could go find interviews with the founder of the cold plunge.com or whatever they're selling tens of millions of dollars of these things.\r\n\r\n\r\nNikolas Hulewsky (18:15.464)\r\nYeah, but I would say everything that you just named, the S1, the FDDs, all the publicly disclosed documents, everybody else is doing that. It's that next step that you just said, the very last thing, find an interview with the founder. If you do that next step, people aren't doing that yet. Maybe if they're getting paid full-time and they work at a private equity fund or a venture fund or something like that, a family office, they're doing that. But most people are not doing that. Go find the interviews. Go find the conversations that they've had because they're going to say way more in those conversations.\r\n\r\n\r\nChris Koerner (18:21.186)\r\nYeah, yeah.\r\n\r\n\r\nChris Koerner (18:25.506)\r\nMm-hmm.\r\n\r\n\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (18:32.205)\r\nRight.\r\n\r\n\r\nChris Koerner (18:44.13)\r\nYeah. Well, and then it could say, you could take it a step further and say, okay, the three LA fitness is in Colorado where this does the best. want you to tell me the crime data for those three zip codes, the unemployment rate for those three zip codes, the economic growth rate, the percentage of retail score footage. Like people would not think to do that, but it's all just cross-referencing and it could do that.\r\n\r\n\r\nNikolas Hulewsky (19:07.248)\r\nSo deep re you haven't messed much with deep research. Deep research does this. And I've done so I've done this a couple of times with deep research where I've said two things. The first thing is before I even get to that. If you were looking at this data. What are some non obvious correlated data points that I should be extracting and then it will like tell me, you should look at its crime statistics. You should look at income. You should look at.\r\n\r\n\r\nChris Koerner (19:10.998)\r\nI just started messing with.\r\n\r\n\r\nNikolas Hulewsky (19:34.648)\r\nWhat disposable income spent at Whole Foods, you know what I mean? Like things that I didn't even think of cool. And then you take those and you say, great, do me an analysis. I want you to see how correlated these two data points are and whether or not the correlation equals causation. Cause it will run a regression analysis, which is freaking nuts. And it will spit out as like, this is the R squared. This is like, this is how not only correlated they are, but how much causal effect this variable has on this variable. So it's pretty.\r\n\r\n\r\nChris Koerner (19:38.552)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (19:54.882)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (20:04.762)\r\nInsane because like there's a website. I can't remember what it is, but like it will show you. Iowa security guards named Jim and the price of cacao in Africa and they're like they're like perfectly graphed overtime, right? It's like OK, just because they're correlated doesn't mean there's causation there, but you can get that information by using deep research.\r\n\r\n\r\nChris Koerner (20:15.104)\r\nYeah. I've seen that. Yeah.\r\n\r\n\r\nChris Koerner (20:25.43)\r\nI've used it but not for like graphing stuff. That's pretty nuts.\r\n\r\n\r\nNikolas Hulewsky (20:29.8)\r\nYeah, yeah, it was nuts when I asked it to do it. was like, holy crap, math just hasn't been as good for these models.\r\n\r\n\r\nChris Koerner (20:34.094)\r\nYeah, yeah. So I was gonna do a segment on Chris Crone, our favorite ridiculous guru. And can I'm not gonna do it because it's just not good content. But can I tell you what the prompt was? And what I love about deep research. So my prompt was do a deep dive on Chris Crone his controversies, upbringing, personalized family, crazy stories, quotes or sayings, impressive feats. And what I love about deep research is\r\n\r\n\r\nNikolas Hulewsky (20:46.714)\r\nyeah.\r\n\r\n\r\nNikolas Hulewsky (20:52.51)\r\nPlease,\r\n\r\n\r\nChris Koerner (21:03.724)\r\nBefore it gets going, it asks you follow up questions, which is so nice, right? Cause it's taking like we've been saying for months now, like ask chat GPT, what to ask chat GPT, ask it how to use it. But now like deep research, takes it a step further and it just, asks you, right? It skips that. So then it said, would you like a balanced overview, including both as achievements and controversies? Are you looking for a more specific angle? Do you want information, public records, interviews or social media insights? And I said balanced and yes to the\r\n\r\n\r\nNikolas Hulewsky (21:08.35)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (21:33.23)\r\nto the second question. So it took five minutes exactly. It cited 29 different sources and it gave me 3,700 words worth of like really in-depth content.\r\n\r\n\r\nNikolas Hulewsky (21:43.614)\r\nreally in depth. Well, like what you're saying on the deep research side is what I'm excited about because typically you ask chatty-pityy a question, it gives you an answer and you have to like almost think of a way to ask it to then prompt you to ask the right questions. I don't know if that makes sense, but like I did this with these research as well. I'll read it to you. Hey, want you to make me this list of these providers in this area. And it was like, okay, cool. To provide you a comprehensive list, I want to clarify the following.\r\n\r\n\r\nChris Koerner (21:59.116)\r\nYeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (22:12.498)\r\nAre you looking for all providers, including small independent agencies or just major providers? Do you prefer a specific revenue range? Should I prioritize data from official sources like Medicare, state health departments or business directories? How would you like the data formatted in a table? It's like, yeah, I didn't even think of those things. That's a good question. How do I want the data prioritized? Do I want you to like go to Reddit or do I want you to go to the Bureau of Labor Statistics? Like that's what's great about the deep research is it's all of a sudden a PhD level.\r\n\r\n\r\nChris Koerner (22:31.79)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (22:36.494)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (22:41.522)\r\nassistant to you to then follow up with you, ask you the right questions because it knows you're going to ask them later anyways.\r\n\r\n\r\nChris Koerner (22:48.142)\r\nYeah, because like, if I have a really intelligent assistant or employee in real life, and I asked them to do something like the best of the best, ask me six follow up questions, because I'm super high level, super broad, I don't give nearly enough detail ever. So they're okay, do you want this, this, this, like, I know that they're on it. And they have that attention to detail that I don't have. And that's, that's what deep research is. Another cool framework, if you're not spending $200 a month. It's just to think like from open AI perspective,\r\n\r\n\r\nNikolas Hulewsky (23:07.388)\r\nYeah. Yeah.\r\n\r\n\r\nChris Koerner (23:17.89)\r\nthey don't want to give super long in-depth answers because that costs them more money, but you can still get that from it. And so if I'm using the $20 a month plan or the free plan and I want like 10,000 words worth of content, I will first ask it for an outline, like a table of contents or bullet points. And then I'll say, all right, number one, like I want to, I want you to be as detailed as possible on number one. Okay, number two, be as detailed, like it's a little tedious, but you will get tens of thousands of words out of it that\r\n\r\n\r\nNikolas Hulewsky (23:36.232)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (23:47.24)\r\nIt's so funny. We've never talked about, do the same thing, which it's nice now on deep research. I don't have to do that. But when you didn't have, you 200 bucks a month before you couldn't do that. So it's like, all right, first, how should I do the outline? Spits out the outline. Great. Let's just do one section at a time. And if you want, can even get more granular with like each bullet point. do, dude, I do the same thing because the devil is in the details. Like you're not going to make a million bucks with some high level overview or\r\n\r\n\r\nChris Koerner (24:02.958)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (24:16.638)\r\nor scaffolding of an idea, you're to make a million bucks by being detailed and understanding every part of it. dude, I love that idea. Why don't we talk about deep research? You and I have using the two. Should we do a review? The pros and cons, what we like, what we don't like? Okay. Do you want to see it up?\r\n\r\n\r\nChris Koerner (24:18.339)\r\nMm-hmm.\r\n\r\n\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (24:36.812)\r\nYes. Yes.\r\n\r\n\r\nYou go ahead.\r\n\r\n\r\nNikolas Hulewsky (24:42.588)\r\nOr I can. OK, so in the last two weeks, OpenAI has come out with two what we feel like are game changing additions to their product. One of them is called GPT operator. What this is is like the first iteration of an AI agent that will go out and execute a command on your behalf. In the past, I'd ask chat GPT a question like how would I do something? Boom, it returns an answer. Now I can say operator, I want you to pull this data from this website and put it into this\r\n\r\n\r\ntable and it will go out and do it. Okay, so that's operator and then there's chat GPT deep research, which they came out with about a week after chat GPT operator. Deep research will go. You ask it to go do a bunch of things. Hey, research all of these topics. It then takes that information, spits it into a report essentially that answers your question. Many companies do this. So I, you mentioned IBIS world. I worked at IBIS world for awhile.\r\n\r\n\r\nIt's like an industry report company where you can go and purchase industry reports from them. there's an analyst who on the back end did all the research and put it together. There are investment banks, large banks, they'll put together research reports for publicly traded companies. Consulting companies do this as well. So like there's a broad market for these types of consulting research reports. Essentially what this is doing is that, are those research reports. This isn't the first time this has been done. Google did this as well. They have a deep research project.\r\n\r\n\r\nChris Koerner (26:07.074)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (26:10.942)\r\nproduct as well. That's really good. anyways, chat, TPT, introduce both of these. And if you pay $200 a month, you can have access to both. And Chris and I have been diving in to both of them. So Chris, I'm gonna start with you. Operator, pros and cons. Tell me about it.\r\n\r\n\r\nChris Koerner (26:25.844)\r\ncons it's very, I, I gotta get this thought out of my head first. Are we worried about IBIS world? Like they got it. They're going to have to drop their prices, right? Like, cause if I'm IBIS world, I'm just going to use this to generate my reports, right? I'm not going to like, just go sit in a corner and cry and shut down shop, but these reports are significantly less valuable now. they not?\r\n\r\n\r\nLike it's gonna take a while. It's not gonna happen overnight. But how do you charge three grand for a PDF?\r\n\r\n\r\nNikolas Hulewsky (26:49.704)\r\nHere's my perspective.\r\n\r\n\r\nNikolas Hulewsky (26:56.392)\r\nI worked at these companies. So I know this for people who listening. IBISworld does this. Hey, I want to know about aftermarket parts manufacturers in the car space. Cool. I want to learn about the industry. so companies like IBISworld will produce a report. They'll say, this is how big the total addressable market is. This is what the typical profitability of an operator is. This is the growth trend. These are the major problems we see. These are the major\r\n\r\n\r\ntailwinds that we see, this is what the next five, 10, 15 years look like, et cetera. It gives you a holistic overview for somebody who's interested in investing into the space. So what Chris is saying is, isn't that going to put them out of business? I actually don't think so. I think what it's going to, I don't know, I know, hear me out.\r\n\r\n\r\nChris Koerner (27:39.65)\r\nNo, I'm sorry. don't think it's going to put us out of business. think good. It's not what I said. It's not what I said.\r\n\r\n\r\nNikolas Hulewsky (27:44.946)\r\nNo, no, hear me, hear me, I don't.\r\n\r\n\r\nNikolas Hulewsky (27:50.418)\r\nMohammed, edit that out. don't think they'll have to, they could, they could lower their prices. But I think what it's going to do is their reports are going to become more granular. And again, this is my personal opinion. I think that the reports are actually going to become longer because the people that are asking for the reports are going to have their own AI infrastructure to say like, cool, the support was generated, please digest it. And now I'm going to have a conversation with you.\r\n\r\n\r\nto ask the things that I normally would have asked or for you to educate me on these things. So the short answer is like, don't know, but I don't think that the pricing will come down. I think it will probably stay the same.\r\n\r\n\r\nChris Koerner (28:34.7)\r\njust think AI is going to cause the price of almost everything to go down.\r\n\r\n\r\nWhy would they be exempt?\r\n\r\n\r\nNikolas Hulewsky (28:47.006)\r\nI think we're in agreement. What I'm saying is they will probably charge the same price, but they will give much more in their product. One of those two things is going to have to give. Either they're going to offer the same product and their price comes down, or price is going to stay the same and they're going to offer way more. It could also be price comes down and they offer way more.\r\n\r\n\r\nChris Koerner (29:10.146)\r\nThat's what I would think the last scenario just because I just think there's going to be less demand for their product. They could sell it all they want. Like it's three times longer now. It's like, yeah, I just don't need it anymore. So if demand comes down, price has to come down. But anyway.\r\n\r\n\r\nNikolas Hulewsky (29:25.895)\r\nYeah, okay.\r\n\r\n\r\nChris Koerner (29:29.07)\r\nWhat were we talking about?\r\n\r\n\r\nNikolas Hulewsky (29:30.376)\r\nCons.\r\n\r\n\r\nChris Koerner (29:32.212)\r\nso it's very hit and miss. Like I posted my video about my piano experiment on about Facebook marketplace and tons of people were like, it doesn't work on Facebook for me. How did you get it to work? Yeah, well, I have like three podcasts talking all about it.\r\n\r\n\r\nNikolas Hulewsky (29:43.304)\r\nCan you explain your video first?\r\n\r\n\r\nNikolas Hulewsky (29:48.741)\r\nokay, sorry, nevermind.\r\n\r\n\r\nChris Koerner (29:50.316)\r\nYeah, I just I went to Facebook marketplace and started messaging people it did for me. And I had to log into my Facebook account within the operator browser and all this. But a lot of people it just will not work for them. And I can't explain it. I didn't do a growth hack or a trick. It just worked. Right. So it's just buggy. That's one downside. It's glitchy.\r\n\r\n\r\nNikolas Hulewsky (30:08.666)\r\nIt agreed it's clunky. Like it it it times out. It doesn't exactly follow your instructions like there are this quality control pieces that you have to implement like it makes it does make mistakes. It's slow like you said it's literally going at the pace if not slower than a human. Yeah.\r\n\r\n\r\nChris Koerner (30:12.044)\r\nYeah, slow.\r\n\r\n\r\nChris Koerner (30:27.566)\r\nslower. It reminds me of the Louis CK skit where he talks about being on a flight the first time that like internet on airplanes was invented and they announced they're like here on JetBlue we now have internet on airplanes and people logged in and they were like, Oh, this is amazing. And then it broke like 10 minutes later and the guy next to him on the flight was like, this is bull crap. This is bull crap. And he's like, what are we talking? He's like, you're sitting in a seat at 35,000 feet.\r\n\r\n\r\nyou're sitting in a chair in the sky. And like, there were like, a half a dozen comments on that tweet that was like, it's freaking sucks, dude. It's not worth it. It's so slow. It sucks. I'm like, what? It has to go to space. Like, this is artificial intelligence. Like week two, like, what are we talking about? Can you be grateful?\r\n\r\n\r\nNikolas Hulewsky (30:57.032)\r\nYeah. Yeah. So good.\r\n\r\n\r\nNikolas Hulewsky (31:07.912)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (31:12.328)\r\nHa ha ha!\r\n\r\n\r\nNikolas Hulewsky (31:16.606)\r\nWell, I think the other problem is there's just a bunch of guardrails that they had to put on it, right? Like they could probably release it, it'd be way faster, but it'd probably be doing some weird stuff at some point. You know what I mean? So yeah, I agree with you. This is version one. This is version one. Do you have an?\r\n\r\n\r\nChris Koerner (31:29.379)\r\nYeah.\r\n\r\n\r\nYeah. But that's when like, if you're listening to this, that's when you should be playing with stuff like this, you can have an edge. Like that's the whole point.\r\n\r\n\r\nNikolas Hulewsky (31:39.806)\r\nDo you have any other cons?\r\n\r\n\r\nChris Koerner (31:42.97)\r\ncertain websites like Facebook, like the trillion dollar companies out there, you have to like babysit it. You can't even navigate away from the tab. There are third party tools you can use that will like move your mouse for you to circumvent that. most websites, it will run in the background. You can, you can run six at a time. I found out, but with some of the more valuable websites, it either doesn't work at all. Like YouTube, I couldn't get it to work on YouTube or it makes you babysit it.\r\n\r\n\r\nNikolas Hulewsky (32:11.166)\r\nSo this is the best analogy that I can make for operator. And I've told several people this. Anybody who has a Tesla on the freeway, they can do self-driving. It's amazing. it's so great. But you can't, you got to keep your hand on the wheel. Like you still need to have somebody behind the wheel. You're there. If your hands off the wheel, the wheel will shake. it will, will alert, alert danger. Well Robinson, Chris freaking bought this like weight thing from Amazon.\r\n\r\n\r\nChris Koerner (32:23.822)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (32:41.248)\r\nAnkle weight.\r\n\r\n\r\nNikolas Hulewsky (32:41.298)\r\nto put on his steer, was it an ankle weight, to put on his steering wheel so that it was like, it'll trick the system into thinking that my hand's still there. So it's like, it's not, that's what operator reminds me of a lot, right? It's like, you still gotta sit behind it. You still gotta make sure that it's doing its thing. It's gonna ask you, it's gonna make sure that you're paying attention, blah, blah, blah. However, so I'm switching from the cons to the pros. However, anybody who's had self-driving on in their Tesla, you've seen the future.\r\n\r\n\r\nChris Koerner (32:49.4)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (32:58.082)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (33:10.428)\r\nyou know what's coming. It's like, this is going to happen. Like, yeah, this is annoying right now. Yeah, I got to my hand in the steering wheel. But full self-driving is going to happen.\r\n\r\n\r\nChris Koerner (33:10.819)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (33:20.844)\r\nYeah, I mean, when I got my Tesla two and a half years ago, I had to do all those things. I bought it for full self driving and it didn't work well at all. Like I used it 2 % of the time and my app tells me that so it's not an exaggeration. I bought an ankle weight. My friend Keith had like this fancy little weight that he put on it and I went to buy it and it was 150 bucks. Like I'm not doing that. Ankle weights were 10 bucks, but it's still so that got around like the having to put my hand on it, but it still didn't work. It was unreliable, but today.\r\n\r\n\r\nNikolas Hulewsky (33:48.766)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (33:50.146)\r\nToday, you don't need your hand on it at all, ever. You just need to be looking at the road every now and then. Yeah, that's gone. And it works amazingly. Like it works. My car drives itself now. The one thing I hate about it is I can't look at my phone. I just, it won't let you, because the camera's watching you. That sounds silly, but like, I want to look at my phone when my car's driving me around and it won't let me. So whatever.\r\n\r\n\r\nNikolas Hulewsky (33:55.252)\r\nis that right? Okay.\r\n\r\n\r\nNikolas Hulewsky (34:04.402)\r\nAre you able?\r\n\r\n\r\nNikolas Hulewsky (34:17.924)\r\nSo do you do self-driving not on the freeway? Because there was a time where it was only self-driving on the freeway. You can do self-driving off of the freeway now too.\r\n\r\n\r\nChris Koerner (34:21.902)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (34:26.604)\r\nYeah, I've been able to do it anywhere since I've had the car for it was just glitchy both on and off the freeway. But now it's not glitchy anywhere. Yeah, it's legit.\r\n\r\n\r\nNikolas Hulewsky (34:33.16)\r\nRight. Really? How can Waymo, how does Waymo get around it? Cause like, who posted about the James camp maybe he took a Waymo ride the other day and there's like, there's no driver. It's all autonomous. Why, like why is it Waymo able to get around that? But you're not, is it Texas? Is it like local?\r\n\r\n\r\nChris Koerner (34:42.22)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nChris Koerner (34:50.828)\r\nSo it comes down to LIDAR. comes down to LIDAR. Waymo has LIDAR and that's like a one to $200,000 investment per car. In addition to the cost of the car, Elon has said from day one, LIDAR is unnecessary. It's too much, it's overkill, it's redundant. When really he's biased, like he can't sell $200,000 cars. So LIDAR has to be irrelevant, right? But.\r\n\r\n\r\nNikolas Hulewsky (35:14.558)\r\nYeah, I was going to ask is the pride thing is he like, dude, it's not even freaking we don't need it, bro.\r\n\r\n\r\nChris Koerner (35:17.984)\r\nIt's just a, it's just a bias thing, but they have like these benchmark tests now, like now that full self-driving is a thing and Waymo is by far the most accurate, like the least amount of collisions per million miles traveled. Tesla is not great compared to it. like LIDAR gets you the safest self-driving car or ride possible, but\r\n\r\n\r\nNikolas Hulewsky (35:39.102)\r\nWaymo is owned by Google, right? Okay, I was gonna say Elon should just buy Waymo, integrate it into his company. But Google's not gonna sell that crap. Okay.\r\n\r\n\r\nChris Koerner (35:42.669)\r\nYeah.\r\n\r\n\r\nChris Koerner (35:47.917)\r\nYeah.\r\n\r\n\r\nDude Waymos, have you seen Waymos out in the wild?\r\n\r\n\r\nNikolas Hulewsky (35:54.684)\r\nYeah, no personally no I live in Idaho dude.\r\n\r\n\r\nChris Koerner (35:57.774)\r\nI like, I don't think they're in Dallas, but,\r\n\r\n\r\nNikolas Hulewsky (35:59.4)\r\nThey get shot. get, like people in Idaho see a way mother, what the heck is that? That thing's driving itself. return to the aliens. Karen, get your gun.\r\n\r\n\r\nChris Koerner (36:06.764)\r\nWhen we...\r\n\r\n\r\nWhen we went to California, they're everywhere. And I saw a stat, I need to look this up. How many, this up.\r\n\r\n\r\nNikolas Hulewsky (36:17.928)\r\nI knew that San Francisco allowed it and I thought that San Francisco's municipality had granted it access. So I still think that there are local ordinances that are going to allow or disallow these self-driving vehicles to operate. So like it'll still be a patchwork approach for a period of time because there's gonna be cities that are like San Francisco that are like, cool, yeah, you can be self-driving. And then cities like Dallas that may be like, no, screw this, you can't have this in our city. But.\r\n\r\n\r\nChris Koerner (36:44.234)\r\nRight. I mean, I want to say there's like 15 or 20,000 way Mo's on the road today. It's, it's a lot more than you think. It's a, it's a ton. It's a ton.\r\n\r\n\r\nNikolas Hulewsky (36:51.238)\r\nNo way!\r\n\r\n\r\nThat's not, all right. like that was my analogy with operator. The Tesla thing is I've seen the future. Like I can't unsee what I've seen. As clunky as it is, it can click into things. It can pull data. It will go to different websites and you can like you can see that, okay, this is going to happen. Like this is, it's not just pie in the sky and it's going to happen faster than.\r\n\r\n\r\nChris Koerner (37:08.269)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (37:18.734)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (37:23.696)\r\nYou think unfortunately we're all biased because Elon's been saying FSD was coming for 15 years and it's like still not here bro. What are we doing? yeah, AI is probably going to be the same way. It's not going to be the same way. It's iterating at a much faster rate than we have ever been used to. So like this 15 year time horizon like shrink that down to 18 months until this is probably fully operational. So that's how I feel about operator.\r\n\r\n\r\nChris Koerner (37:30.082)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (37:54.606)\r\nUm, are we still on operator? Cause I, as, as we've been talking, I thought of a, another segment that could be, I want to talk about, um, my experience with the, with Don, but anonymize it, Don Wasik of Buc-E's, but he, he specifically he's an, Muhammad edit all this out. He specifically doesn't want me to talk talking about like specifics. So I'm going to change some details, but\r\n\r\n\r\nNikolas Hulewsky (37:56.636)\r\nMm-hmm. We can move on without.\r\n\r\n\r\nit\r\n\r\n\r\nNikolas Hulewsky (38:12.849)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (38:17.608)\r\nBANANA\r\n\r\n\r\nChris Koerner (38:22.934)\r\nI want it to be a sec, a segment about like everything I learned from working alongside a billionaire for seven hours. And it's, think you're personally going to find it super interesting. That could be the second episode. Yeah. Yeah. That's what I'm saying. I didn't know how much more you had about operator.\r\n\r\n\r\nNikolas Hulewsky (38:32.222)\r\nLet's finish this. That's exactly what I was going to say. Like I know we thought like, we'll just do one episode today. Nope, nope. I'm done with operator. Let's do a quickly deep research. That'll be done with the episode and then we can move on because I have another thing I wanted to talk about with with AI as well in particular like this in particular.\r\n\r\n\r\nLet me just write myself a note actually so I don't forget this because I was going to make it part of this episode, but now...\r\n\r\n\r\nNikolas Hulewsky (39:02.686)\r\nBanana, banana. Okay, Mohammed, cut back in. All right, so that's operator, deep research. I play with deep research more than you've played with deep research. You play with operator more than I play with operator. I like it. Here are the cons. On some things it takes forever. A week ago. Well, let me just explain what it is. You can tell it, hey, I want you to do research in these areas and bring back some market analysis for me. And you can be as specific as you want. So I gave it some parameters.\r\n\r\n\r\nChris Koerner (39:02.712)\r\nSo deep research.\r\n\r\n\r\nNikolas Hulewsky (39:32.498)\r\nI'm looking for these types of health facilities in this state. This is the revenue size. Go to this website to validate it. Go to this website to pull this information, put it into a table, identify who's on public, who's private. This was over a week ago. I still haven't gotten the report. So like I could have put that together in probably a day or two. I still haven't gotten the report. So I'm like, what the, like, how is that not put together? And I've every day been going and like, Hey, any update on this? It's like,\r\n\r\n\r\nThis information is important and we want to make sure that it is put in the right format that you remember. Anyways, that's a con. It can take a long time because it's still pulling a lot of information. The other con is less about the technology and more about just the user. Unless you've gone through, in my opinion, unless you've gone through like a PhD program and you understand how to conduct research and how to put together these reports and so you're pulling.\r\n\r\n\r\ncorrelated and uncorrelated data and you're looking at causation, etc. It's kind of hard to tell deep research to do something in a way that's going to give you the most value out of it. So I would like to see some type of an air face on deep research. It's doing this, but not enough where it's like, what do you want to learn? Okay, I want to learn about opening up saunas near gyms. Cool. And then it just asks you a million questions, not a few, but like a lot of questions to get really\r\n\r\n\r\nChris Koerner (40:38.446)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (40:53.048)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (40:56.136)\r\ngranular on what you're looking for. So I would say that's the con from using it. Do you have any cons from using it?\r\n\r\n\r\nChris Koerner (41:03.318)\r\nNo, I just haven't used it enough. I did meant to say some pros about operator, because I don't think we got to that. So we can plug that back over there. Keep going. No, we'll finish the deep research. But one thing I wonder about deep research is the length of time it's taking to find your report going to be correlated to the quality of what's in there. Do you know that yet?\r\n\r\n\r\nNikolas Hulewsky (41:12.456)\r\nOkay, go, do it.\r\n\r\n\r\nNikolas Hulewsky (41:18.398)\r\nyes.\r\n\r\n\r\nNikolas Hulewsky (41:30.654)\r\ndon't know because I haven't seen it. And I specifically asked it to do a report that I've done in the past because that I know takes a lot of disparate data sources and sort of puts them together to build what I'm trying to build. Like I'm trying to build basically all of the providers in a specific state of health. So health care providers in a specific state with their revenue from different revenue sources. And I've done that before pulling from different websites because\r\n\r\n\r\nChris Koerner (41:44.76)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (41:57.582)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (42:00.156)\r\nAnd I want to know if they're public or private, because if they're private, they're more likely to sell than if they're public. So I've done this before. So I asked Chachi to be to operate or deep research to do it because I just want to know how good it is. And once it gives it to me, then I'll be able to like, look, this is what I did. This is what it did. Let's compare the two. And if it's if it's good or like 90 percent of the way there, my mind will be freaking blown. Right. But I just haven't gotten that yet to be able to validate it.\r\n\r\n\r\nChris Koerner (42:05.058)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (42:16.312)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (42:25.58)\r\nYeah, yeah. I'm curious to see how it is, because I mean, either it's going to be amazing or you're to be disappointed for the time it spent. And it might have just like hit a glitch and just stayed there for a week, you know, and then finally gives up on it.\r\n\r\n\r\nNikolas Hulewsky (42:37.318)\r\nYeah. It's kind of what I think so. Right. I think I actually might just redo the prompt because I'm like, this seems way too long for it to be sitting there. But anyways, the pros on it are. You have an analyst like most of time you'd hire an analyst 50 to $60,000 a year out of college and they're just going to do a bunch of research for you. You now have an analyst that can go and do the research as well.\r\n\r\n\r\nas a fresh out of college analyst. So and it puts it in a format that is digestible that you can read. You can ask it follow up questions and it'll answer it really quickly. So it's it's a really cool product. If you're just trying to get a quick approximation or quick up to speed on how something works. So for that reason, I really like it. Like I could see you using it for a ton of your content, right? Like.\r\n\r\n\r\nChris Koerner (43:28.11)\r\nHave you tri-\r\n\r\n\r\nNikolas Hulewsky (43:32.552)\r\nHey, I'm researching above ground pools in Wichita, Kansas. Help me understand the market. Like could see you using that and then going and making a video of it. You know what I mean? Because you know the questions to ask it and it's going to give you a lot more analysis than typical JCPT would.\r\n\r\n\r\nChris Koerner (43:50.03)\r\nIt's so funny you say that because as you were saying that I might like it for that, I was typing in a prompt to do exactly that while I was pretending to listen. Guilty. I just, I couldn't forget. couldn't forget. Edit this out, Muhammad. I asked it to find the list of the top 10 episodes from Greg Eisenberg's podcast and my first million by views and who their guests were so I can go snag them as guests as well.\r\n\r\n\r\nNikolas Hulewsky (43:56.411)\r\nHahaha\r\n\r\n\r\nWe know each other. We know each other so well.\r\n\r\n\r\nChris Koerner (44:19.394)\r\nLike that's something I asked Kamal to do yesterday. I don't want to see if it can do it for me. But it has problems with YouTube, you know, so I don't know.\r\n\r\n\r\nNikolas Hulewsky (44:24.584)\r\nDude, that's...\r\n\r\n\r\nRight, right, right, That's right. right. Why don't you give your pros on Chat TV operator real quick.\r\n\r\n\r\nChris Koerner (44:30.156)\r\nChris Koerner (44:35.694)\r\nSo, so it's super good for doing like very low skill base level research. For instance, I had to go, I had to travel last week. And so I said, find me a hotel in city name within five miles of this exact address with four stars or more under $150 a night. And it did. And I watched it. I watched it on Priceline and it felt it set filters. thought of a couple of things that I didn't even prompt it to think of.\r\n\r\n\r\nAnd boom, like that's something that an executive assistant would do. And then I just went in and booked it and it could have done that for me. So that plus like find me a Toyota Tundra 2015 within a hundred miles of my zip code under a hundred thousand miles under $30,000. Right. And so it will save you like 10 minutes there. And then you can like, and it will go a step further and start messaging people. But the more you ask it to do, the more it kind of glitches out, but\r\n\r\n\r\nit's really, really good for doing stuff like that. And then for notating stuff like that in a Google Sheet, it's great.\r\n\r\n\r\nNikolas Hulewsky (45:38.216)\r\nBottom line is we're early. I think if you can afford it, start playing around with it. Agents are gonna be a thing because by the time agents become usable, if you're trying to get up to speed, then people like Chris and I are gonna be way ahead of you. So just get educated now.\r\n\r\n\r\nChris Koerner (45:47.299)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (45:52.866)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (45:56.334)\r\nOh, and don't take its answers at face value, like push back on it as much as you can. Like it solved the capture for me, but then it wouldn't submit it. And I, it still wouldn't, but I kept asking like, no, submit it, submit it to try to break it. It's solved the capture. Like the ones that have the weird words and the funky shapes. Yeah. And I, yeah, I thought that was kind of basic. Like I'm like, at first I was amazed. I'm like, Oh my gosh, it solved the capture. And then I went and asked it. And I was like, is capture solving a thing like\r\n\r\n\r\nNikolas Hulewsky (46:04.808)\r\nSo we're gonna talk.\r\n\r\n\r\nNikolas Hulewsky (46:08.798)\r\nIt's to capture. What do you mean?\r\n\r\n\r\nOh, a capture. I'm sorry. Yeah, yeah, yeah. Yeah, sorry.\r\n\r\n\r\nChris Koerner (46:25.752)\r\nCause you can do it manually. They're like capture farms in Indonesia. Most people don't know this. And if you're running a bot, the bots can't get around captures. So it will literally pay people in Indonesia, like three cents of capture to manually solve them remotely. Okay. That's the thing. But I asked chat GPT for, if like solving captures has been around for a while, like via automation and bots. it's like, no, this is brand new. So it's solved the capture for me. And then I'm like, okay, now enter it. And it wouldn't, you know, it didn't, it had a guardrail.\r\n\r\n\r\nNikolas Hulewsky (46:28.776)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (46:38.706)\r\nmy gosh, jeez.\r\n\r\n\r\nNikolas Hulewsky (46:52.446)\r\nOkay, so one thing on operator I wanted to ask you. You had a video, I haven't watched the video, but it was like operators pushing operators. So I had asked you about this at first and I was like, can you have an operator operating an operator? And at first you're like, no, we can't do that. But then I saw you had a video that was like, no, you can do that. So can you do it? my friend, you are so dirty.\r\n\r\n\r\nChris Koerner (47:02.476)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (47:15.179)\r\nMm So I\r\n\r\n\r\nI haven't asked operator to operate operator, but I have asked operator to log into my chat GPT account and use chat GPT. It worked. Okay. But this. Go ahead.\r\n\r\n\r\nNikolas Hulewsky (47:30.448)\r\nHmm, dude. I'm going to give you my I'm going to give you my login. To chat GPT. And I want you to see if you can use operator to use my operator. that's going to be so cool.",
  "metadata": {
    "duration": "",
    "date": "2025-02-21",
    "platform_source": "Google Drive"
  }
}