{
  "episode_number": "239",
  "episode_title": "How to Build Your Own Short Term Rental Empire with Taylor Jones",
  "guest_name": "Taylor Jones",
  "business_name": "strsearch.com",
  "transcript": "﻿Nikolas Hulewsky (00:01.292)\r\nAll right, I'm gonna get my notes up.\r\n\r\n\r\nNikolas Hulewsky (00:09.112)\r\nOkay, Taylor Jones, personally, I'm really excited for this because I want to learn about this topic, which is short-term rentals, Airbnb, vacation rentals, VRBO, whatever you want to call it. And I have the man, the myth, the legend, Taylor Jones, who is the founder of strsearch.com. He's also raised a couple of funds. Taylor has overseen over 200 STR investments, over $120 million of deployed capital. So the dude knows what he's talking about. I want to ask you this first question.\r\n\r\n\r\nWhy are STRs so sexy when they seem so unsexy from the outside?\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (00:41.291)\r\nYeah, it's kind of interesting. People look at this as a real estate business and it's not, it's an operations business wrapped around a piece of real estate. So, you know, what you're getting into is where art and data come together. If this was just purely a data investment, you're really looking at long-term rentals, multifamily, all the other boring stuff that's very straightforward. Where you can kind of get those outsized returns and that little extra that attracts people to this asset class is the art form.\r\n\r\n\r\nunderstanding how much extra revenue does a swimming pool add in this market versus not having one? What about a pickleball court? What about a lazy river? What about the size of your deck on the back when you go outside the patio? These are the little nuances that really coincide with how much you could charge on a nightly rate, how much excess revenue you can achieve amongst your competition, and ultimately how much more money you can make than a standard investment.\r\n\r\n\r\nNikolas Hulewsky (01:23.043)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (01:35.534)\r\nThat part is really interesting because I think a lot of people look at it as a passive income stream, right? And people probably got into it as a passive income stream. just hearing what you just said, it's like, if you get into it thinking it's a passive income stream and you're competing against guys like Taylor Jones, you're going to get your lunch eaten. you're looking at, hold on, how many square feet of pool do I need to add in order to raise rent by 32 %? Oh, okay. Like you said, it's an operations business wrapped in real estate. It's not a real estate passive income.\r\n\r\n\r\nAnd maybe that's just my own observation, but would you say that's a fair observation of people who get into this space?\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (02:10.071)\r\nIt's very fair and you don't know what you don't know if you're just kind of really taking this as a passive approach. So for example, if I'm to go into the Phoenix Scottsdale market, I will not buy a piece of real estate that doesn't have room to install a pickleball court if there's one already there. So then your next question is, well, how big of a yard do you need? I tell you, well, the playing dimensions are 22 by 44. Plus you need a minimum three feet of excess. So I'm going to go use Google satellite and measure, can I get a 28 by 48 minimum?\r\n\r\n\r\nObviously you can make the serving lanes bigger and add more concrete if you have the space. But these are the kind of things I'm going to instantly look for. So I'm not even going to look at the inside. The very first thing if I'm going to potentially buy in the Phoenix Scottsdale market, for example, I'm going to go straight to the backyard, go straight to Google satellite and measure. Can I get 28 by 48 in the backyard? answer is no. I don't care if the inside of house has Carrera freaking marble. I'm not buying it. It's not worth it because the ROI.\r\n\r\n\r\non a pickleball court versus not in that market is over $40,000 in revenue difference. So it just doesn't make sense to run an Airbnb without one when you get such an insane premium to have one in that market.\r\n\r\n\r\nNikolas Hulewsky (03:08.888)\r\nHoly crap.\r\n\r\n\r\nNikolas Hulewsky (03:14.562)\r\nYeah. How did you start out in this? Cause I've had businesses and I've just always loved the idea of having real estate and having rental properties. Cause I guess that's just what you do to build long-term wealth. How did you get into it? What was your first property?\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (03:27.541)\r\nYeah, so lifelong sales guy, I was always chasing commission, 70 different sales jobs over about a decade. COVID hit at a client facing sales job and, you it wasn't fired, but I wasn't allowed to go sign new contracts. And so you're kind of in that tough spot. And the one blessing I had in March and April was I had all the time in the world. So I naturally, like lot of people had a niche for real estate and I was like, cool, I'm going to go consume a bunch of YouTube videos, podcasts, bigger pockets. I'm going to read everything I can. And so I spent all my waking moments instead of working.\r\n\r\n\r\nyou know, diving in learning real estate. I looked at everything. Should I go into wholesaling, broker, flipping, section eight, long-term rentals? I looked at everything and then naturally came across short-term rentals. And you know, me and my wife, we've stayed in 27 different Airbnb's since 2015. So like I've been a consumer of the product, but I never looked at the unit economics from the host side. Wish I did back in 2015, that'd be a different discussion. But I started looking at it I was like, my gosh, there's a lot of opportunity here.\r\n\r\n\r\nNikolas Hulewsky (04:03.053)\r\nYeah, yeah, yeah, yeah.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (04:25.715)\r\nand started diving in, really niched down on that topic, spent about two, three months. And I'm kind of one of the guys that I don't want to get analysis paralysis. Too many people get that in both in business investing and real estate. You can study, but I always say at some point you got to jump in the pool. You don't have to be Michael Phelps on the first day. You just got to know enough not to drown. And so after about three months and writing five different offers, me and the wife, we got our first cabin in the North Georgia mountains under contract.\r\n\r\n\r\nflew up to Atlanta, went up there for the inspection. The inspector was like, hey man, like a couple of small things, it's real estate, there's always small issues in the inspection, but it's like overall, man, it's a pretty solid cabin. I was like, sweet, flew home, back here to Florida, went back up there for the closing, and then we did a bunch of sweat equity, new game room, install a fire pit, air hockey table, painted, new furniture, and then turn around and listed it on Airbnb and I.\r\n\r\n\r\nEventually the job came back, so Florida was one of the earlier states to open up. So I'm starting back working.\r\n\r\n\r\nNikolas Hulewsky (05:26.102)\r\nWell, hold on before you before you move on from that. Had you bought real estate before?\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (05:32.415)\r\nNow, first piece of real estate.\r\n\r\n\r\nNikolas Hulewsky (05:34.19)\r\nThis is first piece of real estate and you go up there and the inspector is like, there's a little minor things, but you should be good to go. So you buy it, you do a bunch of, guess, renovations. How much money did you put into it?\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (05:45.783)\r\nSo we put about 40 grand into it. Yeah, about 40, 42 grand into it to kind of get it. So we did a 10 % down vacation home loan. So the property was 460 grand. So about 46 grand plus closing costs. So was a little over 100 Gs with the furniture. The sweat equity would help. Obviously, if I'd outsourced that, that tab would run up a little bit more. But the sweat equity helps for sure.\r\n\r\n\r\nNikolas Hulewsky (05:49.846)\r\nOkay, and how much did you put down to buy it?\r\n\r\n\r\nNikolas Hulewsky (06:02.721)\r\nAll in.\r\n\r\n\r\nNikolas Hulewsky (06:09.87)\r\nOkay, all right, so you put in 100 grand and what was the monthly nut on that? Like what were you paying in mortgage? Do remember?\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (06:15.799)\r\nOh man, it was probably around 16, 1800 interest rates were lower. So was five years ago. So that was always very net beneficial. And the appreciation run up hadn't happened of COVID yet. So yeah, that was about 16, 1800 a month there on that one.\r\n\r\n\r\nNikolas Hulewsky (06:22.304)\r\nYeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (06:31.63)\r\nOkay, okay, so you've got this little cabin, North Georgia, put $100,000 into it, $1,600 a month of a mortgage on top of it. Things are starting to open back up. All right, I cut you off. Keep going.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (06:42.987)\r\nYeah, yeah, But so I remember we get this thing launched. It was a Tuesday night and I was like, okay, like here it is. Like you got your listing and I've seen, you know, we've booked Airbnbs and I was like, okay, like I think I know what it looks like. There's obviously not as much resources there is today. I remember I woke up and we had six bookings for, you know, over seven grand and I was addicted. I was like, my gosh, this is great. that was, yeah, yeah, yeah. So you launched it, you know, again, and you just kind of sit.\r\n\r\n\r\nNikolas Hulewsky (06:54.796)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (07:02.986)\r\nNo way! Overnight?\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (07:11.243)\r\nAnd the good thing about Airbnb is they do want to help new hosts. And so for your first 30 days, you get kind of a lot of free promotion. They shove you up on the first page and it's in their best interest because if you don't succeed, you're going to quit the platform. And now they have an inventory problem. So naturally they're going to give you artificial boosts the first 30 days. And they're going to see like, Hey, do people find your listing attractive? Because if they do, then they know, Hey, we need to keep this near the top. If you get 30 days of free promotion and no one's booking your place, that's a signal to the algorithms on Airbnb and Verbo is like,\r\n\r\n\r\nNikolas Hulewsky (07:20.088)\r\nYeah.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (07:41.057)\r\nHey, this listing sucks. No one wants it. And so it's going to move it down to page five, six, seven, eight, et cetera, and you'll get buried. So if you come out of the gate with good photos, good amenities, good design, and your place looks good, and you get bookings, that's telling the algorithm, hey, this is good, because let's not be naive. Airbnb makes money when you make money. On every booking, it doesn't cost anything to list on the platform. So if you don't get bookings, they don't make money. So they want to incentivize, well, which properties are getting a lot of bookings? Let's push those near the top, because we make money too.\r\n\r\n\r\nNikolas Hulewsky (07:43.331)\r\nYeah.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (08:10.849)\r\nSo yeah, man, six new bookings came in. Obviously they were spread out for some allotment into the future. But seeing that money there, that seven grand, I was addicted.\r\n\r\n\r\nNikolas Hulewsky (08:15.788)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (08:19.756)\r\nYou're like, you're like, dude, that's six months, like six months of your rents covered. not even rent. Sorry, six months of your mortgage is covered overnight. You were addicted to it. That is now obviously it's probably different today than it was back then. But I'm curious from your perspective. What did you do right with that first flip? Not first flip, but first property. And what did you do wrong?\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (08:45.911)\r\nSo what I did right was buying a high demand market. So North Georgia, you're an hour and half from Atlanta. I didn't have the data again. I got lucky, but I didn't get lucky in that I picked somewhere that I like to go. So as a Floridian, if we want to escape the heat and we get in our car and drive north, the first mountain range you hit is the North Georgia mountains. So I knew, hey, a lot of Floridians go here, and Atlanta's an hour and a half away. So didn't have data.\r\n\r\n\r\nNikolas Hulewsky (08:51.672)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (08:56.664)\r\nWell, that's what I was going to ask.\r\n\r\n\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (09:09.752)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (09:13.4)\r\nSo it was anecdotal. It was anecdotal market research, but it wasn't data-driven market research. OK.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (09:15.423)\r\nExactly.\r\n\r\n\r\nExactly. Obviously where things are today versus five years ago, completely different animal, but you know, it was kind of that directional. So kind what I got right was it was in a high demand market. It's desirable. And you know, nailed that part. What I got wrong was I ultimately didn't buy the right product to succeed long-term. I bought a three bed that stared at the trees.\r\n\r\n\r\nNikolas Hulewsky (09:37.71)\r\nTaylor Jones - @MrJonesSTRs (09:41.621)\r\nAnd that ended up being the most common supply in that market. And so when you have a ton of excess three beds that stare at the trees, it becomes a race to the bottom on price for what you could charge.\r\n\r\n\r\nNikolas Hulewsky (09:50.888)\r\ninteresting. Okay, so what did you, in that first year, how much revenue did you generate from that one property?\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (09:56.343)\r\nYeah, so we made 80 grand and after mortgages, expenses, utilities, cleaning, hot tub supplies, all that good stuff, we took home about 22 or 24 grand that first year in free cash flow. So it was like great, like got your feet wet and this was a really good, you\r\n\r\n\r\nNikolas Hulewsky (10:12.686)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (10:16.206)\r\nWas that better? Better than you expected? Worse than you expected?\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (10:19.799)\r\nI don't know that I really had a ton of expectations of like what it is. I think it was so cool back then and it was like this newer thing. There wasn't these huge million follower influencers that promoted the space. It wasn't really there. And so I didn't really quite know to expect. And so to me, I think just making money was the objective. And then someone tells you about tax benefits and other things you can unlock from real estate besides cashflow.\r\n\r\n\r\nNikolas Hulewsky (10:23.404)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (10:30.839)\r\nRight.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (10:45.653)\r\nIt became this really good learning experience that really got me started in the real estate game.\r\n\r\n\r\nNikolas Hulewsky (10:50.026)\r\nMm. What did you, when did you realize like, this could be something I could go all in on? This isn't just like a cool side hustle.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (10:59.031)\r\nWell, four months later, I bought another cabin in North Georgia. So as soon as I got addicted, I said, OK, let's go let's go stack and get more. And that's\r\n\r\n\r\nNikolas Hulewsky (11:02.808)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (11:06.68)\r\nHow are you buying those? Because you said your sales job is like you weren't allowed to sign new clients. Like how did you have the cash to go buy another cabin?\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (11:14.219)\r\nYeah, so had a little bit stacked on the second one, ended up going 50-50 with another one of the sales guys. So was like, hey dude, and he'd had a piece of real estate and we were like, okay, cool, let's go in together. So yeah, didn't have enough cash to do that one myself, but ultimately said, hey, let's go 50-50. So we split, put up half the money and rolled into that second one.\r\n\r\n\r\nAnd again, you took your wins and your compounds and you just rolled them into that second one. bought a better product. This one had a mountain view. So it was on top of the mountain instead of the wooded lot. It was still also only a three bed, which is kind of the most common supply in a lot of markets just because it's the easiest thing to build. Most builders aren't going to go build small couples getaway ones and twos that are 600 square feet. And most builders aren't going to build five, six, seven mansion.\r\n\r\n\r\nyou get a ton of those two, three, four bed, you know, it's just the most common product. And what you've seen over the last five years is that middle of the market has really been frothy because there's just so much supply of it. And so really investing at the polls has where your opportunity has come.\r\n\r\n\r\nNikolas Hulewsky (12:20.194)\r\nSo what's interesting is, let's say for these two properties, you're what, in $120,000, $150,000?\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (12:27.233)\r\nYeah, so second one was slightly bigger. So my half on that second one was another about 80 grand. So we bought a slightly bigger place, slightly bigger amenities, you know, so that one would have been about 160. Some more sweat equity. We both went up there with both of our spouses. So four people doing hands-on labor to cut costs. But yeah, it was just continuing to compound.\r\n\r\n\r\nNikolas Hulewsky (12:48.366)\r\nAnd then, and then that one, how much free cash flow did that one generate?\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (12:53.527)\r\nThat one spit out 48 grand of which my half was about two G's a month on that one as well.\r\n\r\n\r\nNikolas Hulewsky (12:55.757)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (12:59.758)\r\nOkay, so for the first year, what I'm trying to get at is like $180,000 in and in free cash flows, like cash to you, let's call it $45,000. So, I mean, that's a pretty good cash on cash return, but you get kind of capped really quickly, right? Like you were tapped out at that point, you were done. Like you didn't have any more cash to redeploy. Were you thinking...\r\n\r\n\r\nCool, this will be long-term, I'll build some more equity and then I'll cash out refi and then we can buy another property or were you just so hooked that you thought, hey, when can I get my next hit? I need my fix. Like, when do I get my next property?\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (13:37.511)\r\nIt's kind of crazy. You start talking about it and other people kind of lead you into like, didn't even know you could raise money. And then I had uncles who worked for Oracle and, you know, and other jobs and like, Hey man, I went in on the next one. Cause they hear about how great it is. And they're like, Hey, I'm in for a hundred grand on the next one. Hey, I'll give you 75 grand. so like, realize like I'm personally tapped out at this point. I got to recycle cash. I got to work more safe from my W2, my sales job, you know, kind of stock cash on commissions, stock the cashflow.\r\n\r\n\r\nNikolas Hulewsky (13:55.427)\r\nMmm.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (14:06.967)\r\nBut that's going to take another year, two years to kind of restock the farm to be able to go buy a third. But like, hey, these people are offering me $7,500, $120,000. And they're like, they want in on the next one. And then you just go down this rabbit hole of like, oh my gosh, like you can raise money. And that just kind of opens and unlocks an entirely different skew. it's really fascinating how quickly one becomes two and two becomes five in this very quick.\r\n\r\n\r\nNikolas Hulewsky (14:23.864)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (14:28.62)\r\nCheers.\r\n\r\n\r\nNikolas Hulewsky (14:35.96)\r\nEspecially, yeah, especially once you go and raise money. So I'm to put the raising money to the side for a second because I'm most I'm most interested in kind of how as an entrepreneur, you can actually go and get into this space. Twenty twenty was an incredible time. It was a beautiful time. Lots of money. Rates were low. Property values hadn't gone nuts. And so when you buy those those first few short term rentals that you have, probably get in a good basis because the rates are low.\r\n\r\n\r\nmortgage payment is low and there wasn't as much competition. So your rent your rates that you could charge other people was good. Let's fast forward like two or three years. Where are they now? Like are they still great? Or is it still would you say it's like, it's okay, I'm breaking even like, how is the short term rental market looking now?\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (15:23.479)\r\nYeah, so personally with those two, I've sold those in 1031 into more ideal products because after you sit there, you realize, hey, this isn't an ideal product to own. Good news, how to equity, so cash that out.\r\n\r\n\r\nNikolas Hulewsky (15:28.001)\r\nOK, all right.\r\n\r\n\r\nNikolas Hulewsky (15:37.038)\r\nokay, okay, okay. Then forget my question. I wanna drill in on that. What did you learn that you did right and what did you learn that you did wrong with those first two properties?\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (15:47.585)\r\nYeah, you know, being able to have some sort of a moat. So that second one had the Mountain View. It was on top and it was, okay, it's so much easier and I'm able to command such a premium. They were both three bedroom cabins in the same exact market, but one of them was making significantly more, you know, we're talking to the tune of about 40, 50 grand more in top line revenue on an annual basis than the other. And so when you have something that is hard to differentiate again, a three, two that stares at the trees in the woods,\r\n\r\n\r\nNikolas Hulewsky (15:54.978)\r\nOkay.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (16:17.919)\r\nThat's the entire mountains and how are you going to differentiate it becomes a race to the bottom. So what I learned from that is if you're going to go into this, what is a differentiator for that market? And that could mean a lot of different things. It could be close to the beach. could be riverfront. could be straight location, straight location. Could be the features. Is it modern? Is it a tree house? Is it a yard? it like, how can you be different?\r\n\r\n\r\nNikolas Hulewsky (16:19.917)\r\nYeah.\r\n\r\n\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (16:34.2)\r\nPickleball.\r\n\r\n\r\nNikolas Hulewsky (16:40.91)\r\nMm.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (16:43.905)\r\nthan your competition because it's going to give you some sort of an advantage that you don't have to worry about. my gosh, I can't differentiate my property amongst guests on the platform.\r\n\r\n\r\nNikolas Hulewsky (16:54.198)\r\nInteresting because otherwise it becomes commoditized and then you're just competing on price then it's just a race to the bottom You have to have something that differentiates enough to get people to pay more for your location Okay Okay, what what else did you learn?\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (17:04.311)\r\n100%. And I think that applies to all business across the stack.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (17:11.413)\r\nI learned that it's not as difficult for putting in systems as it may seem on the outside. think that's the toughest thing people think is, and what automations and systems and tech that there was five years ago versus three years ago versus today is absolutely wild. think like any industry, it's continued to grow. Obviously, all the buzzwords AI getting mixed in here to the asset class. Obviously, it hasn't been as adaptive as I would say other industries because there is some limitations to hospitality.\r\n\r\n\r\nyou're starting to see it become more systematized, more automated on the back end so that you can run these and not have to be local. You know, again, like I don't live in North Georgia. In fact, I live not even the state of Georgia. So you can put in systems, have local boots on the ground, a la contractors, a la cleaners who can go in and execute. And you really kind of systematize this as a business. if I think of you treat this as its own little business.\r\n\r\n\r\nand not just as this passive endeavors as we talked about on the onset here. That's where you can get strategic advantages because like anything, if you treat this as a dip in the toe with any business you do, any endeavor, you're gonna kind of get the results of dipping your toe in. And I think if you treat this professionally, you can get professional results.\r\n\r\n\r\nNikolas Hulewsky (18:26.21)\r\nSo you found cleaners, you found, let's call it handymen, repairmen, plumbers, people pretty easily for that area in North Georgia?\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (18:35.137)\r\nYeah, a lot of Facebook groups, lot of asking around, and now it's gotten even crazier. There's entire marketplaces of Airbnb cleaners where you can put in any city in the country and you'll get a whole list of them and you can start cold calling. So it's just, that's the evolution of this asset class, which is incredible.\r\n\r\n\r\nNikolas Hulewsky (18:36.983)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (18:47.96)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (18:52.435)\r\nOkay, so what did you do wrong? Like looking back, you're like, man, I'm so freaking lucky because I did this and this wrong.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (18:59.863)\r\nI thought the gravy train would continue to go forever and had a chance to sell for about hundred grand more than we did. that second cabin bought it for 640 and in the peak of the market, mean, we were talking to zero percent interest rates. Everything was super frothy. And I think like a lot of people I got caught up and was like, man, the gravy train is going to keep rolling.\r\n\r\n\r\nNikolas Hulewsky (19:10.894)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (19:23.628)\r\nYeah,\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (19:25.089)\r\nWe had a chance to sell for 1.025 in 22 months of ownership and was like, nah, let's just keep it going. Let's keep it going. And then reality kicked in and you're like, yeah, this was like la la land we were living in and ultimately still had, you know, appreciation and we sold it for, for nine 20. So don't get me wrong. They still a very good return on the onset. But when you look back, I think the biggest mistake was.\r\n\r\n\r\nNikolas Hulewsky (19:49.102)\r\nStill great. Yeah. Yeah.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (19:54.977)\r\nI need to take a step back. when sometimes when things are almost too good to be true, when business is cooking the general economy, the market, that there is such a thing as a downturn. think to me, like I never been through that personally. And so to me, I'm like, great. Like everything goes up and to the right. This is amazing. And it don't work like that. It don't work like that.\r\n\r\n\r\nNikolas Hulewsky (20:11.276)\r\nWell, and it doesn't work like that. And to quote the great Kenny Rogers, you gotta know when to hold them, know when to fold them. Like it is hard to build that like muscle memory of like, okay, do I double down on this? Or do I take the win for what it is? He still came out great. But that's a really, really interesting observation. I think the thing that's most interesting to me is that both of these properties did well.\r\n\r\n\r\nAnd you learned some stuff that for whatever reason made you think I can take the same money, put it into another market with the things that I've learned and get a much better cash on cash return than 22%. What were those things? So when you sold it, I'm assuming you, you took that, those, those gains, you 10 31 to into something that you thought would return a much better return.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (21:01.835)\r\nYeah, I think a better long-term asset to, maybe short-term cashflow would have been same or slightly different, but long-term protections, let's just say, hey, buying a three-bed cabin in a very heavy three-bed market where over a third of the supply is three beds. So if you just go to the Airbnb platform for that market, over 35 % of the supply is a three-bed cabin. And you're like, crap, this isn't good. So I think the first thing I looked at from a differentiation was,\r\n\r\n\r\nNikolas Hulewsky (21:19.373)\r\nRight.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (21:29.653)\r\nWhat are the supply demand imbalances just on bedroom count for this next market? And that's where I started.\r\n\r\n\r\nNikolas Hulewsky (21:34.318)\r\nOkay, okay. So like this would be somebody like me. I wanna skip over the learnings that you did for those first two cabins. I wanna get to like wherever you rolled this money into. The first thing that you look at in a market is the supply demand and balance in a market. How do you measure that?\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (21:48.535)\r\nThat's correct. there's a common term thrown around, the S word, saturation. And I say, that's weak if you think, this market is saturated. And the reason being is bedroom counts can be saturated. Product styles can be saturated. But technically, there is a path to succeed in every market. It might be difficult. Take Disney Kissimmee there in Orlando, Florida. Probably one of the most cutthroat markets, and your path to succeed as slim as could be.\r\n\r\n\r\nNikolas Hulewsky (21:53.964)\r\nYeah.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (22:17.643)\r\nBut the data will tell you if you go 10 plus bedrooms with certain features and certain locations, you have a chance to win. Obviously, that's not a great recipe for success that you already bought. Buying a 5, 6, 7, 8, good freaking luck. So that's where we're going to start first is what's the current supply in this market versus the demand total nights booked for those properties. And that's\r\n\r\n\r\nNikolas Hulewsky (22:40.364)\r\nAnd where do you go and look for that?\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (22:42.327)\r\nThere's several different data sources. So we have a couple of really big strategic ones, AirDNA and Rabu that we'll pull from, you know, really good data providers in this space. And when you can kind of digest those, you're like, oh my gosh, you know, let's take another big red hot market, Broken Bow, Oklahoma. One, two and three bedroom cabins make up 72 % of the supply in that market. So you're sitting there going, Nick, like, would you buy a one, two or three bed in Broken Bow, Oklahoma? And it's like, absolutely not.\r\n\r\n\r\nNikolas Hulewsky (22:58.757)\r\nyeah.\r\n\r\n\r\nNikolas Hulewsky (23:08.886)\r\nNo, no. Tell me about that four bed. Tell me about that five bed though.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (23:13.131)\r\nThat that's exactly where we want to be. So you start looking at there's not great opportunities to service the large families, multiple families or groups of friends segment of the market. And it's underserved with supply. And those that have the supply can charge a premium because there ain't a whole lot of competition. And most builders naturally don't go build five, six, seven bed spec mansions. That's not a great like that. There's a lot of risk from a builder if you're speccing that.\r\n\r\n\r\nOne, twos and threes have multiple uses, multiple exits. They're safer, air quotes. They're cheaper basis, they're lower costs to build and they're a lower sale price naturally. So you have more buyers who can buy that. So from a builder, are you going to go build a six bed, 4,000 square foot mansion cabin where you put up your own money carrying costs and you pray you could unload it for a million and change? Or are you going to go build a three, two, you could probably sell for six, seven, 800 grand. There's a lot of buyers for that product.\r\n\r\n\r\nNikolas Hulewsky (23:45.806)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (24:03.054)\r\nThank\r\n\r\n\r\nNikolas Hulewsky (24:06.797)\r\nYeah.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (24:10.551)\r\nGreat, now there's a ton of those in the marketplace.\r\n\r\n\r\nNikolas Hulewsky (24:12.814)\r\nThis is probably going to sound stupid, I let me restate what you're saying. I think a lot of people look at it like me where they're like on Zillow and they're like, Oh, I could get this two bedroom and it's 150 grand. And I think I can make that work. could put some money into it. And they like, just look at the cost side of getting into that real estate. But what you're talking about is the cost is just one equation. You've got to understand what the demand is going to be for that so that you can model what the revenue piece is going to be. Otherwise you don't have a return.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (24:42.609)\r\nThat's exactly right. is simplified as two numbers. What do you buy it for and how much can you generate per night? There's a lot of deep analysis. There's a lot of deep analysis that goes into this, but in really everything boils down to what do you buy it for and how much revenue can you generate? And at the end of the day, you need to spread between those two numbers. If there's no spread, there's no cashflow. It's very simple.\r\n\r\n\r\nNikolas Hulewsky (24:49.302)\r\nIt sounds so simple when you say it. I feel like an idiot.\r\n\r\n\r\nNikolas Hulewsky (25:02.222)\r\nOkay, so is there a supply demand imbalance? How do you find the market in the first place? Like you said, Broken Bow, Oklahoma. Are there just markets that are known to be hot markets or would I just kind of look in my own geography? Where would I start?\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (25:17.867)\r\nYeah, so without obviously the level of data access that we have, I think where I would start is, you know, look at where do you personally go? Like, I think, you know, unless you're just a complete outlier and you're like, Hey, I'm a weirdo vacation guy, which like that could be true. Where do you travel? And you got to assume there's other people that do that. Number one, number two, there's a lot of just general theses. So let's just take things that have very sound investment thesis behind them. Hey, we want to invest near the national parks.\r\n\r\n\r\nNikolas Hulewsky (25:27.262)\r\ninteresting.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (25:47.255)\r\nWell, that's a pretty good thesis because last I checked, they're not closing Yosemite or the Grand Canyon anytime soon. Now, maybe they will, maybe they won't, but that's a pretty good bet I could make. So it's like, cool, millions of people are visiting these national parks on an annual basis. There's going to be constant demand. So that's an entire investment thesis that happens. And a lot of people will buy around the country near national parks. Take another one is invest within a two hour drive of a major Metro. So think Atlanta.\r\n\r\n\r\nNikolas Hulewsky (25:47.554)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (26:13.742)\r\nMmm.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (26:14.753)\r\nDC, Manhattan, Chicago, Austin, and go, okay, what are vacation towns within a two hour drive of these huge population hubs? Because nobody's ever going to get tired of being stuck in their 400 square foot shoebox apartment in Manhattan and want to get away for the weekend. So why is it that the Poconos and the Catskills, which are both hour and a half, two hours away, why are those popular vacation destinations? Because you got a trillion people in Manhattan who want to get away for the weekend. That's why.\r\n\r\n\r\nNikolas Hulewsky (26:41.154)\r\nYeah. Yeah.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (26:43.347)\r\nIt's just like, you're like, yeah, duh, that makes a lot of sense. So sometimes you don't have to overcomplicate your investment thesis. And so those are like just two examples that people will kind of start with. Now, should you invest within two hours of Manhattan, two hours of Chicago, two hours of Atlanta, two hours from Austin, two hours from San Fran, LA, et cetera? Well, that depends. You know, how familiar are you with it? Naturally, I'm a Florida boy. Like I know the Southeast. I've traveled to the Southeast. I kind of stayed there because it was familiar. You know, if you live in Cali,\r\n\r\n\r\nNikolas Hulewsky (27:10.349)\r\nMm-hmm.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (27:11.947)\r\nYou're probably like, dude, North George, I couldn't put that on the map if I tried with some of these mountain towns. So I think, you you go to where your kind of creature comforts are, and then you ultimately got to start running math. So to your point, like, sure, you can have demand, but if prices are too high, it doesn't matter. There's no profit. So once you kind of narrow down your list of markets, you have to just start running numbers. What can I buy real estate for? What can I generate in projected revenue? And is there a spread between the two numbers?\r\n\r\n\r\nNikolas Hulewsky (27:15.201)\r\nRight, right.\r\n\r\n\r\nNikolas Hulewsky (27:37.502)\r\nWhat are the metrics that you use to evaluate whether or not the spread is good?\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (27:42.123)\r\nYeah, so that's gonna be tied to a couple different factors. A, your debt and B, your operational infrastructure. So when interest rates were lower, you could get away with tighter spreads naturally when interest rates are higher as they are today, you know, in the sixes and sevens that spreads there. So we call it the price to rent ratio, which is just simply gross revenue divided by purchase price. So the spread today with rates in the sixes or sevens, you're gonna need at least\r\n\r\n\r\nNikolas Hulewsky (27:52.942)\r\nMm-hmm.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (28:10.167)\r\nabout a 15 % spread. an example of that in big round numbers here is on a million dollar purchase price, you need at least 150 grand in revenue to have some spread to have some cashflow left over. Just gross revenue. So 150 grand will be top line. And then after all expenses, you will have enough left over to generate some cashflow. If you buy a million dollar Airbnb and you're only generating a hundred grand, so a 10 % ratio, a hundred grand divided by a million,\r\n\r\n\r\nNikolas Hulewsky (28:21.888)\r\nIn gross margin you mean? just gross revenue. Got it.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (28:37.587)\r\nI could tell you that if you back out all your expenses, mortgage, utilities, toilet paper, pool cleaning, landscaping, you will have zero dollars left over. In fact, you will owe money every month with that spread. It's too tight. Now there's always outliers. That's the envelope math and it's envelope for a reason. So take a place like Texas, super high property taxes. Take a place like Florida, higher insurance. Take a place like North Carolina, cheap taxes, cheap insurance.\r\n\r\n\r\nNikolas Hulewsky (28:43.384)\r\nYeah.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (29:04.799)\r\nSo your spreads can be tighter when you have lower operating expenses and they have to be a little larger in places like Florida, Texas, California, high labor, et cetera. Just because again, those are fixed expenses that are gonna hit you every month. Your tax bill, your insurance bill, the pool cleaning guy. You can't not pay those.\r\n\r\n\r\nNikolas Hulewsky (29:14.775)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (29:21.006)\r\nHow do I estimate revenue? I just look at what's the average revenue around and then say, okay, 365 days, I'm gonna estimate 50 % occupancy. Like, which numbers do I use to plug in? Does that make sense?\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (29:34.615)\r\nYeah, yeah, absolutely. So that's where those great resources, AirDNA and Rab, are going to come in handy. So what you can do is dive in there on market specific. So say you do want to dial into North Georgia. Say you want to dial into, you know, the Catskills in upstate New York. And then what you can start doing is isolating bedroom counts. You're like, Hey, you know what? think I'm to buy a three bed or I think I'm going buy a four or Hey, I can only afford to buy a three or four. So that's the other thing. The data might say, dude, you should buy a five or a six. Well, if you don't have enough cash to buy a five or six, what's your next best alternative?\r\n\r\n\r\nNikolas Hulewsky (30:02.531)\r\nMm.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (30:03.093)\r\nAnd so once you understand what you can afford and what you're going to hone in on, then you got to look at, well, what are all the other three beds around me generating? What amenities do they all have? What's their design style? What part of town are they located? Are they only on the north side? Are they spread out northeast, southwest and location doesn't really matter? So all of that's just diving into the data once you've kind of narrowed in that. And so that'll give you kind of that directionally.\r\n\r\n\r\nNikolas Hulewsky (30:30.168)\r\nOkay.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (30:31.031)\r\ndata that you're looking for is, okay, all these three beds in this part of town are generating between 70 and 95 grand in revenue. Well, you can't underwrite and say, you know what? I'm going to do 120. I'm the new best guy. Like it's just unrealistic to assume. So you need to go and say, well, if I'm only generating 70 to 95 grand on this house, will I make money? And if the answer is no, then you probably can't buy a three bed in that market or a four bed or whatever that metric is because you won't make enough profit.\r\n\r\n\r\nNikolas Hulewsky (30:43.49)\r\nYeah, yeah, yeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (30:59.714)\r\nSo do you just estimate occupancy based, like AirDNA will give you all that stuff? Like AirDNA is gonna kind of give you an estimate of what the revenue is going to be fairly easily.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (31:07.531)\r\nYeah, you're gonna see market level occupancies and you what I always say is our occupancy is only half the equation. So it is interesting because occupancy gets measured a lot in long-term rentals, in self storage and everything else. But here I could get 100 % occupancy in my Airbnb. I'll go charge $10 a night and guess what? I'll be booked every night of the year. Now I won't make money and that's a problem.\r\n\r\n\r\nNikolas Hulewsky (31:10.124)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (31:31.214)\r\nBut you'll be booked.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (31:32.533)\r\nAnd then the flip side is I could be very egotistical and say, you know what? I'm never letting anybody rip my place for under 300 a night. I'll probably only be 40 % occupied, but I've held high on my average daily rate. So average daily rate and occupancy is what makes up revenue. And so what you have to find is what's the best blend of the two of those together. Now a market like Michigan or Wisconsin, you're not going to roll 70, 80 % occupancy, even if you tried, because there's no, it's too seasonal.\r\n\r\n\r\nNikolas Hulewsky (31:49.326)\r\nMm-hmm.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (32:02.571)\r\nNow in Florida, you could run 100 % occupancy, but you would be leaving money on the table, meaning you're filling your calendar for lower nightly rates than you should. That sweet spot on like, again, very envelope math basis is somewhere between 68 and 78 % occupancy. So if you can kind of float between that where you don't get too much lower and you don't get too much higher, you're achieving maximum revenue. So that's what saying. Like you want to try to aim for the peak there where, you again, you're occupied,\r\n\r\n\r\nNikolas Hulewsky (32:03.682)\r\nthat makes sense.\r\n\r\n\r\nNikolas Hulewsky (32:28.014)\r\nMm-hmm.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (32:31.915)\r\nbut you're also charging enough that you're like, hey, this was worth it because you have to make the two work together.\r\n\r\n\r\nNikolas Hulewsky (32:36.718)\r\nAnd if I go and if I go and do the math and I'm like, oh, I could generate about $150,000 using that back of the envelope, I could also say like, all right, then that means my max property price that I could pay is about a million dollars. you're kind of like backing into where you think you could invest. I does that make sense?\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (32:56.983)\r\nExactly. And then what you'll draw is you'll draw your little filter there. So again, let's go back to that Catskills Upstate New York and you're like, okay, well, what's for sale for under a million in this region? And it might come back with zero results or it might come back with 500. You're like, sweet, I have options here. And that's how you start to learn, is this market investable or not? And, you know, again, if you do that same example and you're like, okay, I did the math. think realistically I can make 150 grand. So I need to buy something at or below a million and zero query results come back on Zillow or Redfin.\r\n\r\n\r\nNikolas Hulewsky (33:00.481)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (33:05.336)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (33:25.446)\r\nNot your market.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (33:26.455)\r\nYou're like, hey, I need to go to a different market. And so this becomes process of elimination and just ripping, you know, can it work? Yes, no, cool. Go to the next one. And it's trial and error, trial and error until you find markets that work markets that have consistent inventory and consistent revenue that you can make profit.\r\n\r\n\r\nNikolas Hulewsky (33:33.23)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (33:40.29)\r\nYeah. I think one of the interesting things that I've seen is that like the short-term rentals got really big everywhere. wasn't just coastal cities in California and Florida. It was like Michigan. All of a people were buying. like, I'm just going to short-term rental this thing out. And to your point, it's like, those have very different seasonal effects. And then, and then when more and more people start doing that, eat the limited inventory that was there all of sudden expands and you have a lot less occupancy.\r\n\r\n\r\nthat builds on top of it. So I've seen people kind of get in trouble here locally, trying to do the the STI model. I just think that's a really interesting perspective. how does taxes play into this? Because we talked about the revenue and the costs and all that other stuff. But then like two taxes are amazing. I know that that's why I'm interested in it. How does it work?\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (34:22.529)\r\nYeah, so.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (34:30.647)\r\nYeah, so easiest way I'll describe this and again, not a CPA, but we'll pretend to be one on TV here for a little bit today is when you have taxes and depreciation, you have active income and you have passive income. so active income is obvious. That's your W-2, your 1099, you're working for it. If you passively invest in something, whether that be a business or another piece of real estate, you receive passive income, you know, that's obviously classified that way. So if you're trying to offset that income,\r\n\r\n\r\nyou can only offset passive income with passive depreciation and you can only offset active income with what is considered active depreciation. So you're like, okay, cool. Well, where do I find this active depreciation? You know, is it in the room with me right now?\r\n\r\n\r\nNikolas Hulewsky (35:12.398)\r\nDude, is he here? I did this. I sold my businesses and I was like, oh, I'm going to save on taxes. I invested in some opportunity zones and some real estate. And then the end of the year comes and they're like, okay, you owe, you know, whatever $500,000 in taxes. And I was like, oh, cool. Well, I have $500,000 in passive losses. So just deducted from those passive losses. They're like, yeah, it doesn't work like that. And I was an idiot. I should have done some more research. So to your point, where are all these active losses happening?\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (35:39.905)\r\nYep, so in the IRS, you have three really basic buckets. So you have oil and gas, which I am not a Texas or Oklahoma in and can't help you there. So find someone who lives locally and could get you there. So there is oil and gas investments, which can give you that. There is equipment. So if you buy equipment, which falls under section 179 of the IRS code, that will also give you active losses. The fun one is the G-Wagon. So I'm sure during COVID and on Instagram, people said, you buy a G-Wagon?\r\n\r\n\r\nNikolas Hulewsky (36:07.426)\r\nMm-hmm.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (36:09.815)\r\nbecause the equipment from a vehicle perspective has to weigh over 6,000 pounds, a G-Wagon, a Chevy Tahoe, a Cybertruck, a lot of strategic vehicles you saw that got purchased all qualify as that. So yeah, really, really interesting. And then the third bucket is short-term rentals. So I know you joked and said, a lot of people say this is a passive investment. Well, the IRS will tell you, no, no, no, this is an active investment and we will give you tax advantages to prove it.\r\n\r\n\r\nNikolas Hulewsky (36:21.771)\r\nSo weird.\r\n\r\n\r\nNikolas Hulewsky (36:32.706)\r\nThis is an active investment. That's interesting.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (36:37.643)\r\nbecause we will classify your tax losses as active losses.\r\n\r\n\r\nNikolas Hulewsky (36:42.468)\r\nIs it because you're managing? Is that why it's active?\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (36:45.463)\r\nSo the key term is because, and again, the only way to unlock these, can't just buy an Airbnb and you automatically get them. You have to earn them through what is called material participation, which is in short saying, hey, I am materially participating in the business activities of the short-term rental. There's seven different ways to qualify for material participation. So I don't know which one's the best path for you. should consult your CPA, but...\r\n\r\n\r\nit involves how much your output is in the business. You you can't hire a property manager and do nothing and say, oh, I materially participated. That would kind of go against what the basic definition is. So if you achieve some of these, you know, achievable benchmarks, again, not super impossible, and you hit material participation, you could take those active losses to offset your active income. Now let's put some real numbers behind it, because that's where it gets fun. Okay. Again, I'm going give you the envelope example here. Typically,\r\n\r\n\r\nNikolas Hulewsky (37:38.006)\r\nAmen.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (37:39.647)\r\nyour depreciation, now that we have the big, beautiful bill and 100 % bonus depreciation, so you get to unlock all of it in year one, you're getting roughly 25 to 30 % of the purchase price in depreciation. So again, big round numbers, you buy a million dollar short-term rental Airbnb, you materially participate. You're gonna order what's called a cost segregation study, which is where a fancy engineer is gonna come in, they're gonna assign values to every structure on the house, you don't have to do anything, and they're gonna say, cool,\r\n\r\n\r\nNick, here's how much depreciation you unlocked on this house. You give that to your CPA.\r\n\r\n\r\nNikolas Hulewsky (38:12.43)\r\nBecause you can't depreciate the land, right? Like the land is undepreciatable.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (38:16.321)\r\nBingo. when you buy that property for a million dollars, it's made up of two things, the land and the structure that sits on the land. So you can't deduct the land value. So if you invest in a high land value market, think South Beach, Miami or Big Sur, California, those are going to get less depreciation dollar for dollar versus you buy an Airbnb in rural Vermont where the land is worth three nickels. You're going to get a lot of depreciation dollar for dollar. Okay. So\r\n\r\n\r\nI mean, so it's like, so what I tell people is what are you investing for? If you're investing for long-term appreciation, yeah, Miami Beach is probably better than rural Vermont. If you're maximizing for tax benefit, rural Vermont is way better than Miami because you're going to spend the same dollars to buy the house, down payment, furniture, et cetera. But how much depreciation? Again, you don't get zero, you just get significantly less because you can't take the land and depreciate the land. You can only depreciate the structure. So.\r\n\r\n\r\nNikolas Hulewsky (38:53.038)\r\nProbably better pet. Right.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (39:11.191)\r\nThat's where that envelope math again, could be a little bit more, could be a little bit less. But if I hang out in that 80, 20 portion, 25 to 30 % of the purchase price is what you're going to unlock. So your million dollar Airbnb gives you 250 to 300 grand of depreciation. You, let's say you and your spouse together, you guys both make 400 grand of combined household income. All right. You take your 300 grand of losses, you slap that against your 400 grand.\r\n\r\n\r\nyou're assuming no other write-offs that you and your spouse have, your new taxable income is 100K.\r\n\r\n\r\nNikolas Hulewsky (39:45.55)\r\nit automatically.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (39:46.679)\r\nSo you put 400 grand in your pocket, that went into the bank account, you earned that from working. Doctor, dentist, lawyer, W-2, business owner, 1099, whatever you do. But your taxable income is now 100K in that example.\r\n\r\n\r\nNikolas Hulewsky (40:00.0)\r\nNow there's a cap on the depreciation amount, Isn't it two and a half million dollars?\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (40:04.787)\r\nI with the Big Beautiful bill, went up to about 1.25. That might be single, not married, but yeah, it's very high north.\r\n\r\n\r\nNikolas Hulewsky (40:08.866)\r\nOkay.\r\n\r\n\r\nBut there's a cap of how much you can depreciate is the point. And it's not like the SBA, if I go get an SBA loan, $5 million is the limit. It doesn't matter how many businesses I buy, it's $5 million. But with this, that's on a per property basis. I could buy 10 properties and depreciate all 10 properties in a single year, theoretically.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (40:34.743)\r\nAssuming you the capital, absolutely. If you can afford to buy it, absolutely. You can order a cost segregation. You can materially participate. And then when you own multiple properties, again, not a CPA, but we'll talk like one on TV, there's a term called a group election where you can put them in a group election. And in essence, instead of having to put individual hours into each of them, you're putting in hours into quote unquote, your business. So if you own two, three, five Airbnbs,\r\n\r\n\r\nNikolas Hulewsky (40:36.086)\r\nRight, right.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (41:00.457)\r\nNow your material participation is an, well, you need to hit a certain amount of activity on every individual, but more or less, how much activity did you put in the total business? So it allows you to kind of, in essence, put in less hours versus if you had these as all individual entities.\r\n\r\n\r\nNikolas Hulewsky (41:17.28)\r\nif you knew this, I just talked to Chris Berg, who was on my podcast, and he does car washes. Car washes are also an investment that count as active investment. I didn't realize that. But as he was talking about it, he was like, dude, it's a flywheel. have the services business that kicks off a bunch of cash flow. And then I just funnel that into the real estate by real estate. So I'm building equity in the real estate. And then I use the accelerated depreciation to offset my taxes. And that money that I saved on taxes, I just put back into the business to grow the business.\r\n\r\n\r\ngenerates more cash flow that I put into real estate just like just keeps kind of spinning like that. Have you found that as well?\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (41:52.983)\r\nYeah, so when you could take some of these awesome opportunities and we'll nerd out even more here, the best case scenario that you wanna try to aim for is a one-to-one ratio. So let's just say I invest 200 grand into a short-term rental, down payment, closing costs, furniture, amenities, okay? If I can get 200 grand in depreciation, that would be considered a good investment. 60 to 70%, so you invest 200 grand, you get a bucks 60 in depreciation.\r\n\r\n\r\nThat's good. It's not an amazing deal. Anything north of one, you go get 1.25, one and a half or two to one on your money. It's absolutely insane. You need a lot to go for you. Like I said, cheap land value. Maybe there was already furniture in there, so you didn't have to spend that money. So your out of pocket is lower. These are all things that could be cheat codes. But if you go spend 200 grand to get your short term rental and you get 200 grand of depreciation, so you maybe bought a six, six 50 purchase price. Let's just say you're in the blended 32 or 37 percent.\r\n\r\n\r\nNikolas Hulewsky (42:32.75)\r\nMm-hmm.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (42:50.689)\r\nbracket, you know, between state and federal, you're talking about saving $70,000 plus dollars in real money. So forget your cashflow on the short-term rental. We talked about the cashflow I got on that very first North Georgia cabin. That was cash in, cash out, but we didn't even talk about the tax savings. So right there out of the get-go, I invest 200 grand into a short-term rental and I saved 70 grand that I would have given to the US government. It's not optional, by the way, last I checked. It is forced.\r\n\r\n\r\nNikolas Hulewsky (43:09.23)\r\nMmm.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (43:19.863)\r\nSo now I'm paying myself instead of paying the US government. I got a 30 % plus return on day one, even if the Airbnb breaks even. Now, obviously the goal is to actually make money. Go make one, two, three Gs a month in free cashflow. But even if you didn't, I can tell you last I checked, paying the US government taxes, you get a guaranteed 0.0 % return. You will never see that money again. But if you buy an asset, you pay down principal, you hold it, it grows in value.\r\n\r\n\r\nNikolas Hulewsky (43:31.31)\r\nRight, right.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (43:49.852)\r\nyou can eke out any level of cash flow, you will get a return on that money to some level.\r\n\r\n\r\nNikolas Hulewsky (43:55.022)\r\nAnd if you buy these assets, right, if you buy real estate and you get these passive or active losses, whatever you want to call it, what if I accumulate $300,000 of active losses, but I only make $150,000 a year? What happens to the $150,000 delta? Does it go away?\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (44:13.367)\r\nThat's the best part. You could save it for a rainy day. You could roll it into future years. So that is the best part. So, you you see why 90 % plus of millionaires on real estate is they're in the depreciation accumulation business. So, you know, they have a very nice cash flowing service business, tech, hedge fund equities that spits off a lot of cash and that creates tax liability. So how do you offset that? You offset that with buying real estate.\r\n\r\n\r\nNikolas Hulewsky (44:28.782)\r\nMmm.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (44:41.527)\r\nIt's not necessarily, you people don't really start buying real estate to get rich. You know, that's not typically the route. You can do it way quicker, way more efficient in service business, the SMB world, et cetera. But how do you keep more of what you make in those businesses is by buying real estate. And you can accelerate that tax savings by having active income. And that's where buying a short-term rental just becomes super lucrative to people.\r\n\r\n\r\nNikolas Hulewsky (44:47.618)\r\nNo.\r\n\r\n\r\nNikolas Hulewsky (45:05.614)\r\nAll right, here's a question. We're not CPAs, right? We're just playing one on TV. So I'm just gonna brainstorm with you here. So if anybody's listening, that's our disclosure. Like don't take what we say as financial advice. I have a house that we moved from that I didn't sell and we're renting it right now. And we just started renting it this year and we're managing it. That's gonna be an active, I guess, whatever piece of real estate that we're managing. Could I depreciate that? Like could I?\r\n\r\n\r\nOr would I have to go like, does that count or no?\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (45:36.759)\r\nSo one of the caveats to material participation is you have to prove it is a short-term rental. And the definition, according to the government, is your average rental stay is seven nights or less. So if you are actively managing this and someone's in there for a six-month or a 12-month term, the average on that will be significantly more than seven. So that would just be regular depreciation, which, again, you can accumulate a lot of passive losses and save those for rainy days whenever you get more passive income.\r\n\r\n\r\nNikolas Hulewsky (45:39.266)\r\nDuh! Caveat!\r\n\r\n\r\nNikolas Hulewsky (45:49.406)\r\nOkay, I got it.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (46:05.737)\r\nIt has to be a short-term rental. so obviously proving that the proven, the caveat to, how do I prove this was a short-term rental? Well, was the average length of stay seven nights or less? Now it doesn't mean every state doesn't mean every stay just means the average of all stays. you could have a 90 day stay, a 90 day booking, and they get a bunch of one night, two night, one night, two night, one night, two night checks in Friday, check out Sunday. If the average is seven nights or less, it is classified as a short-term rental.\r\n\r\n\r\nNikolas Hulewsky (46:16.302)\r\nOkay, so short term rentals.\r\n\r\n\r\nNikolas Hulewsky (46:25.975)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (46:30.774)\r\nRight. Geez. Okay. Let me ask you this. We'll end on this piece. What are your favorite markets right now or favorite trends that you're seeing that you're like, hey, we got maybe a year for somebody to exploit this and take advantage of it.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (46:46.721)\r\nYep. Like I said, investing at the polls right now is super hot. One-one couples getaways or cottages, you know, is a very unique trend. You can provide things that a hotel just can't, whether that's hot tubs, saunas, romantic hammocks, you're by yourself versus, it's 400 square foot and I share a wall with someone else a la hotel. So that is a strategic investment on one side of the pole. The other is,\r\n\r\n\r\nfour, five, six bedrooms that accommodate big groups that again, they're not gonna go rent seven hotel rooms. And so you kind of get out of that two, three, four zone and you go to the polls. And right now what you're seeing is the outsized returns are living at the polls. The average group size on Airbnb, so the good news about them being a public company is they released their numbers. You start looking at the quarterly report. It's grown now for 10 straight quarters. How many people are in a booking? So they have all this data, obviously firsthand of,\r\n\r\n\r\nhey, six people checked in here or nine people or 27 people, the average booking, average total number per booking has gone up for 10 straight quarters. So what does that tell you? The puck is growing to more and more people. They're saving money. You can split the costs amongst more heads in a large group travel and it's cheaper than a hotel. They get that together experience. So the bigger upstream you swim, you're getting paid off for it because the puck is going that direction. So what we're\r\n\r\n\r\nNikolas Hulewsky (47:54.808)\r\nJeez.\r\n\r\n\r\nNikolas Hulewsky (48:01.198)\r\nMm-hmm.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (48:14.493)\r\nheavily doubling down on right now is bigger properties or again go the complete opposite. Very customized romantic experiences for you know one bed couples because again no builders building a 600 square foot you know little tree house your you know cottage thing they're not building those so if you can get your hands on one or build one yourself you've got a great opportunity to add nice little fire pit nice little hammock maybe the outdoor shower all the little romantic things that you do people are like\r\n\r\n\r\nWell, what's my alternative? My alternative is to pay $200 to go stay at a hotel with, you know, powdered egg, continental breakfast and you know, carpet and share a wall. Or could pay a little extra. could pay 300 a night and we got one acre by ourselves in the woods. It's an easy decision a hundred out of a hundred times. And that's the direction that honestly like we're doubling down on right now is go super big or go super romantic and super small.\r\n\r\n\r\nNikolas Hulewsky (48:59.308)\r\nYeah, yeah, it's a no-brainer.\r\n\r\n\r\nNikolas Hulewsky (49:10.158)\r\nOkay, last thing for somebody who's just starting this journey, what's like the one piece of advice you would have known upfront? It could be something we've already talked about, but like what do you think is the most important thing when trying to make money with short-term rentals that you would tell someone just starting out?\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (49:26.987)\r\nYeah, invest where it makes the most sense for where you are today, not necessarily for where you're at. If you have a large tax problem today, you're not necessarily trying to chase, can this Airbnb make two, three grand a month? You're like, hey, how do I not pay 80,000 in taxes? On the flip side, maybe you are miserable at your W-2. Maybe you want to retire your spouse. And you're like, hey, I don't really, like, sure, I'm to get depreciation, but maybe I'm not as hyper efficient.\r\n\r\n\r\nBut how do I buy a glorified ATM machine that can spit out two, three, four G's a month that I can stack one or two of those to retire my spouse or have her cut back? And so whatever your strategy is, you're going to definitely pick a different market based on whatever that thesis is. And I think people get too caught up in they're like, well, yeah, like I like my job. I just pay a lot of taxes. Well, you don't need to go chase the high cashflow less tax efficient markets.\r\n\r\n\r\nor on the flip side, you know, it's the opposite. So to me, I say, solve what's in front of you today. Now, if sure you don't want to pay taxes today and that's the first short terminal, that doesn't mean the second one's not allowed to be an ATM machine where you chase yield. But I think people get too caught up in, well, if I'm to buy two, three, four of these, they all have to be cashflow forward. They all have to be tax efficient. And I say, solve the problem that's in front of you today because...\r\n\r\n\r\nNikolas Hulewsky (50:43.724)\r\nYeah.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (50:49.513)\r\nYou and me and everybody else, have a finite amount of liquid capital. So again, if I can only buy one for right now, now if you're fortunate, you can buy two, that's great. But if you can only buy one, solve the problem that's in front of you today. And then a year or two years, wherever you're onto your next one, maybe you don't have a tax problem because you had another investment that helped that. Or maybe you do want the wife to cut back at work because you're tired of her slaving.\r\n\r\n\r\nNikolas Hulewsky (51:08.386)\r\nYeah, that's great.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (51:13.277)\r\nSolve that problem then and you're allowed to buy two different properties in two different markets with two different strategies. That's okay. So it's a mistake I see people make is when they try to overthink this investment. said, dude, like Nick, solve the problem that's in front of you today. If you have a tax problem, let's solve that efficiently. If you're miserable at work and you want to quit or the spouse or whatever, like let's go try to find an ATM machine that can spit out cash for you.\r\n\r\n\r\nNikolas Hulewsky (51:35.022)\r\nIs that why you started your second business, right? Because you raised money, you own these Airbnbs, and then you started STR Search. Is it because there are people like me who are excited at the prospect of real estate and short-term rentals, but then get quickly overwhelmed with like, my gosh, that's too much data and research that I have to go do? So just take my money, Taylor, just tell me where to go invest. Is that kind of the thesis behind your new business?\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (52:00.097)\r\nYeah, that's really what we started SDR search for was, man, we have four full-time data analysts. We've studied 359 markets. We look at two, 300 Airbnbs a day, every day, all day. Like you don't have to guess where is a good market. You don't have to guess where the most appreciation is. You don't have to guess. We could just present data. And so we'll come in and we'll be the data guys in the background, but you know, ultimately it's your car, you're driving. You know, it's your house, your money. You get all the upside.\r\n\r\n\r\nNikolas Hulewsky (52:16.302)\r\nHmm.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (52:29.247)\r\nI'm just going to make sure you don't crash the car or hit the curb by trying to do this yourself because unlike equities, it's not, I bought Apple stock. It went down. I sold it. I lost 50 bucks. Like you buy and sell real estate. You could lose 25, 50, a hundred grand by making a bad decision. That's what we want to avoid with clients is, Hey, why don't we make a high ROI decision? Because this is, this is where the real tax problem gets people in trouble. It's like, cool. I bought an Airbnb and I saved 50 grand in taxes.\r\n\r\n\r\nNikolas Hulewsky (52:32.771)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (52:45.336)\r\nBankrupt.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (52:59.179)\r\nBut if the house loses 25 grand a year in free cash flow, that net savings, you're upside down in three years now. So now your tax benefit's gone because the house itself can't sustain it. And that's where we say is, hey, yeah, let's get the tax benefit, but let's also make sure there's enough cash flow on the back end that this is a good long-term hold for you and your family.\r\n\r\n\r\nNikolas Hulewsky (53:17.794)\r\nYeah, I see a lot of people who trying to over optimize tax so hard that they end up screwing themselves on like a real business or short term decision. It's optimizing for taxes is important, but that shouldn't be your sole focus. I totally agree with that. Well, cool man. Where's the best place for people to come find you? that strsearch.com?\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (53:39.211)\r\nYeah, head out to CRSearch, Calendly's right there, grab time, happy to talk about your individual situation and we'll show you what we can do and if there's help needed, great. If not, man, like we're just a bunch of data nerds we can dump a bunch of short-term mental Airbnb data on you and we love this shit because it's all day every day,\r\n\r\n\r\nNikolas Hulewsky (53:50.893)\r\nYeah\r\n\r\n\r\nNikolas Hulewsky (53:56.078)\r\nI love it. love it. All right, man. We'll talk soon.\r\n\r\n\r\nTaylor Jones - @MrJonesSTRs (53:58.295)\r\nSounds great, thanks.",
  "metadata": {
    "duration": "",
    "date": "2025-10-03",
    "platform_source": "Google Drive"
  }
}