{
  "episode_number": "145",
  "episode_title": "AI Is Your New Employee: A Framework for Business Owners with Austin Gray",
  "guest_name": "Austin Gray",
  "business_name": "Manufacturing company ($30M revenue, 75M units/year)",
  "transcript": "﻿Austin (00:00.232)\r\nSo are we using this for my podcast or your podcast?\r\n\r\n\r\nNikolas Hulewsky (00:00.32)\r\nAhem.\r\n\r\n\r\nYeah, if it's really, if it's really, really good, it'll be mine. If it's your, if it's, if it's terrible, then we'll use it for your podcast. okay. So this weekend I tweeted out something. I think a lot of people have tweeted this out in the past where it's like, Hey, I'm tired of the theory of AI. I want to know if anybody's actually using AI in their business today to make money. and I got a ton of amazing responses, right? So\r\n\r\n\r\nAustin (00:07.124)\r\nHa ha ha ha\r\n\r\n\r\nAlright, perfect.\r\n\r\n\r\nNikolas Hulewsky (00:30.562)\r\nActually, let me read the tweet, because it was little more come at me, bro, than the nice way that I've just introduced it, which is something in and of itself. I really hate that I've had to write in this style, but it's just the way that Twitter works at this point, right? Like, you have to get eyeballs on you, and there's a certain way to write in order to get those eyeballs on you. So.\r\n\r\n\r\nAustin (00:51.912)\r\nSo question for you, did you tell chat GP teacher, write this and come at me bro style.\r\n\r\n\r\nNikolas Hulewsky (00:56.974)\r\nNo, I actually didn't actually I probably should have that's actually a really good idea. No, I didn't I just have a theory that I can't put my finger on why I think that people know when something's AI generated and when it's not and So I don't like to I don't like to totally use it for my hooks. Anyways, so here's what I I'm tired of the theory who can show me how they actually are using AI and are you confident enough to hop on a call and show me\r\n\r\n\r\nI left it broad because I didn't want somebody who's not using it for their business to think, you just asked business. Cause think there's a lot of individual use cases that are interesting. and this got, jeez, 55,000 views. So it's like, got a ton of views. And I put this link, I ended up putting a link on here. It's like, Hey, if you're confident schedule here and show me the way you're using AI. got 20 people to sign up. And within an hour of posting this, I was on a call with a\r\n\r\n\r\na guy who owns a $30 million manufacturing company that produces 75 million units a year. And he was showing me his AI automations and it was like, it's freaking mind blowing. It was amazing. So it's cool. I've got another 19 or so lined up for this week. And my plan is to create a video series for entrepreneurs, just showing them like, hey, this is how this entrepreneur did this and give them ideas, right? anyways, I'm really excited about it.\r\n\r\n\r\nAustin (01:59.824)\r\nWow. Wow.\r\n\r\n\r\nAustin (02:23.405)\r\nincredible. So what were some of those ways?\r\n\r\n\r\nNikolas Hulewsky (02:26.99)\r\nDude, some of the ways are, it ranges from, and the reason I left it so broad is because I wanted these options. It ranges from, I use it to help me refine my email, right? Like maybe they're writing a really important email and they wanna make sure that it's coming across professionally. And so they'll put it in Chat GPT and then Chat GPT will spit out, hey, here's a recommendation to make this email sound better.\r\n\r\n\r\nall the way up to I've created autonomous agents that can go and operate on my behalf and execute this command and push this function through yada, yada, yada. So it was a whole wide range of things. But the guy with the $30 million manufacturing company, used it for, he showed me only two specific use cases, but he's got many more and he wants to show me more. So the first use case are for chat bots. And two of the chat bots are for like onboarding and orientation, which is really cool.\r\n\r\n\r\nSo he put all the information about his company in there. And now when people have a question, he manufactures silicon in the United States. So when people have a question about silicon or his company, they can go to the chat bot and just ask it, which I thought was a really, really interesting. And then the second use case for the chat bot was a P like a PhD level chemist for his team. I didn't know this, but when you're manufacturing something and you're dealing with chemists who are creating new compounds,\r\n\r\n\r\nthere comes a point in time where they make mistakes and they don't know how to fix it. So what do you do when you don't know how to fix it? You go out and you hire a really expensive consultant who's a specialist in that particular area. And they come in, they look at, I don't know, the problem set, and then they identify it. But it's really costly for them to come in and fix it. So this PhD level chemist chat bot is effectively saving them a bunch of money from going out and hiring these consultants. So they really only go and hire the consultants when it's very necessary, because now they have this like,\r\n\r\n\r\nyou know, mega PhD level chemist on their staff. So that was really cool. and then the other use case that he's using it for is to automate his HubSpot update. So he uses HubSpot for all of his sales pipeline and I don't use HubSpot. So I don't know necessarily how it works in the backend, but he gets an email every single day updating him on his deal pipeline and any changes to it. And the way that he's written the code,\r\n\r\n\r\nNikolas Hulewsky (04:52.736)\r\nis that it will flag anything that has moved out of a specific parameters. Let's say a deal is now seven days old. Once it's passed six days, it's flagged. It's like, hey, what's going on? Why is this deal just sitting in the pipeline? There's a flag for when the dollar amount has changed. There's a flag for like when it's been sitting in somebody's inbox. So it pushes to him this notification of these like parameters that he set. So he knows every single day who he needs to go and talk to to get the deals moved.\r\n\r\n\r\nin the pipeline. thought that was fascinating. And we can talk about how we did it. But those were essentially the two use cases, a chat bot and then working his deal pipeline.\r\n\r\n\r\nAustin (05:31.27)\r\nI love it. I love it. And I think it comes back to, like the chat bot comes back to creating a knowledge base for your company and creating a space for people to ask questions instead of bothering somebody else internally in the company. And I'll tell you a story. So I had dinner with one of my neighbors. He led AI at zoom for many years before leaving and he's working on a startup now.\r\n\r\n\r\nAnd he said, they have like four people in this startup. And he said, our main premise for this was we were going to build the company by documenting everything in notion and then leveraging AI as an assistant so that we could go ask that assistant. The questions that we have. rather than Jim asking Tom, Hey, what does the code look like for this? Or what do our, what does our typical process look like for sending?\r\n\r\n\r\nyou know, or legal review or something like that. Jim just goes and asks the AI in the knowledge base that question and the AI answers that question. So what does this do? It allows people to stay in productive work mode. I'm a huge fan of the book, Deep Work. It's like, if you can get into this product, Cal Newport, he talks about like the most...\r\n\r\n\r\nNikolas Hulewsky (06:52.494)\r\nit by? I've never heard of it.\r\n\r\n\r\nAustin (06:59.668)\r\nproductive work that you can do is just like undistracted, focused work. Yeah. And so it's like, that is going to allow like four people to stay into this deep work mindset. Whereas this AI agent can just answer all the menial little questions. Because what often happens like internally, and you've ran like multi tens of millions of dollars of companies, like internally, corporate structure is literally just people just like bugging each other all day long. And it's like, well, how do you actually like move the needle forward?\r\n\r\n\r\nAnd I think that this is a big way that especially, and what I'm most interested in is like service business founders. How can you leverage AI to one save money in the beginning bootstrap use that as an assistant and get answers to questions for new on boards or new hires, rather than like take you out of deep work mode as a founder.\r\n\r\n\r\nNikolas Hulewsky (07:54.52)\r\nSo I'm going to walk you through one of my one of my frameworks for thinking about AI. And I want to see if this resonates with you. I think a lot of people look at AI and they're like, it's a better form of Google. But also, it's just going to know what to do. Cool. Now I've got AI. Go and run my sales process. But the way that I look at AI is it's like a new employee. And what do you do with new employees?\r\n\r\n\r\nYou have a very clear job description. You have very clear onboarding expectations. You train them. You give them the resources they need in order to be successful. You have a quality program where you check in with them at 30, 60, 90 days, and you have oversight of them, right? And I think if you can shift your mind from thinking, I'm going to implement AI and it's just going to figure everything out to, no, AI is effectively another employee that I've got to train. It will make your life a whole heck of a lot easier. And so to your point.\r\n\r\n\r\nAustin (08:20.777)\r\ntrain.\r\n\r\n\r\nNikolas Hulewsky (08:50.858)\r\nI think if you're a service-based business, especially a sub-million dollar service-based business, just start documenting your processes. Just like sit down one day and say, I'm going to map out my sales process. Now that's a big process, but just start and use ChatTPT to iterate that way. Because once you have the SOP set up, then you can start either training the AI or figuring out ways to utilize the AI. What do you think of that framework?\r\n\r\n\r\nAustin (09:17.492)\r\nAgreed a hundred percent. And I would jump in and add. like people ask me all the time, like, where do you spend your time? Our content manager was asking me this morning, can you break down? Uh, you can be a, can you give me a weekly breakdown of your time? And I was like, well, recently over the, like the last three to four weeks, the most important use of my time is training AI. Like every day I have just been spending time with chat GPT. And it's like, if, if I don't have a process created, I literally just ask.\r\n\r\n\r\nNikolas Hulewsky (09:34.446)\r\nThank\r\n\r\n\r\nAustin (09:44.692)\r\nto create the process. And then I start refining based on like, okay, it gave me the outline. Then I start plugging in what I know about our process. And that is training it, right?\r\n\r\n\r\nNikolas Hulewsky (09:54.104)\r\nDude. Okay, I have an idea. I have an idea based off that. Have you ever heard of air.ai? Okay, it was this software, I think it's still used as a software for Macs in particular, where it would track everything, every keystroke. And if you're a Mac user, it'll track your, know, it's your texts, your emails, your calls, everything. Well, they came out with this, like this, this is my mic, but it's a wearable pendant called Limitless.\r\n\r\n\r\nAustin (10:02.387)\r\nNo.\r\n\r\n\r\nAustin (10:15.528)\r\nNo way.\r\n\r\n\r\nNikolas Hulewsky (10:22.838)\r\nAnd what the pendant does is it records everything, everything that you do, every conversation that you have. Now it doesn't record your keystrokes, but it does record all of your conversations. And a battery life of like up to three days. So it's great. Chris has started using this. And so when he has conversations with people, he's like, doesn't worry about taking notes anymore. He just will go back and query the limitless pendant because it'll tell him like,\r\n\r\n\r\nYep. You talked to Austin. Austin said this was his business. This is like his top line revenue. This is how his business operate. Like he loves it. He's using it for that. Do you think there's a way that small business founders of small services companies maybe could use a limitless like template, but pendant or even the air.ai technology to track what they're doing for a week and then start going to the AI and be like, all right, help me understand where my gaps are. Where am I wasting my time? Where's my time best spent? Like,\r\n\r\n\r\nWhat do I, your assistant was like, what do you spend your time on? And then you gotta think through it, right? And be like, well, unless you're actively tracking your time, but could you use that to actively track your time?\r\n\r\n\r\nAustin (11:28.5)\r\nSo yes, and do you mind if I share an example here of how I think this could be used? So today, this is exactly what I'm going to be doing. So I just hired a new field crew member for our business, Bearclaw. In the winter time, his responsibility is going to be jumping into the snowplow route that we created internally that we had to.\r\n\r\n\r\nNikolas Hulewsky (11:32.386)\r\nFor sure, yes. That's the whole point of this.\r\n\r\n\r\nAustin (11:52.702)\r\nfired the guy who was doing it mid season. I jumped back in, I took over the route for the last several months. Now we're rehiring for it. Well, how, what I've been trying to think about is like, how can we document this process so that we only have to do this once? So that if we keep this route of 30 Snowplow accounts from here on out for the life of the business, no matter who is doing it, can we document the process so that the instructions, the SOP, how I've been.\r\n\r\n\r\ndelivering five-star service on every single account is documented in a way that can be referenced from here on out. And the answer, my answer is yes. And here's how we're going to do it. I have a GoPro set up on my truck. I'm going to click GoPro. Now what I'm going to do is go research limitless. I'm gonna buy this pendant and probably redo this whole process again. But in the meantime, here's what I'm going to do. As I record, I'm gonna drive up to each driveway. I'm going to record.\r\n\r\n\r\nmyself talking through the steps of how the driveway should be plowed. I'm going to stop record on the GoPro for each of the 30 accounts. We'll go upload that video into Google drive. I will use a transcription software to transcribe my text. I'll take the transcription and then I'll pump it into chat GPT and I'll say, please create Descript. Exactly. And Descript is a tool that's plugged into, it's just a audio transcriber.\r\n\r\n\r\nNikolas Hulewsky (13:02.53)\r\nThat's true.\r\n\r\n\r\nD script, right? Like you're probably just gonna use D script. Yep.\r\n\r\n\r\nNikolas Hulewsky (13:15.438)\r\nDo you know, I don't know the answer to this, how much, let's just say the lowest tier of dscript costs a month.\r\n\r\n\r\nAustin (13:21.62)\r\nI don't know, but I think I have several members on and it's like, but they're all part of the podcast. it's 70 bucks. anywhere from like 20 to 30 per user, I believe.\r\n\r\n\r\nNikolas Hulewsky (13:26.764)\r\nMm-hmm. Okay.\r\n\r\n\r\nLet's say it's $20 a month. I just want to hit on this because I love Descript. Whatever. Let's just say it's 20 bucks a month. I freaking love Descript for this reason because you can record something and then it will transcribe it. And not only that, I can copy and paste YouTube videos, links into Descript and it will generate the video and the transcript. And so now if I'm trying to learn something and there's a video, if you've ever tried to get transcripts from YouTube, it's freaking pain in the butt. Now,\r\n\r\n\r\nAustin (13:33.202)\r\nYeah, that math didn't work out.\r\n\r\n\r\nAustin (13:48.638)\r\nYes.\r\n\r\n\r\nAustin (13:57.204)\r\nIt's a pain.\r\n\r\n\r\nNikolas Hulewsky (13:58.316)\r\nI can get the transcript generated from YouTube and then I can use that transcript to then put into chat GPT. So I think if you're a small business owner, finding something that generates transcripts like this, for me it's Descript, is really important. Because what you're describing, in order to use the LLM, you have to have the text. And you can't have the text unless you have something that can generate the transcript.\r\n\r\n\r\nAustin (14:13.97)\r\nYou have to.\r\n\r\n\r\nAnd it's very good at it. And it's like literally upload it to Descript, click into the text, command A if you're on Mac, command C to copy it, and then command V to paste that into chat GPT. So go take that. What we're going to do is take the transcript, paste it in the chat GPT. I'm going to coach chat GPT on what it is an expert in. And I'm going to tell him or her or whatever it that it is an expert in creating\r\n\r\n\r\nSOPs for a snow plowing business doing $1 million revenue per year. Your job is to create a very detailed description from my audio transcript that I will paste below and create a step-by-step process that anyone with a high school level education can read or use third grade level or whatever you want to read.\r\n\r\n\r\nChat GPT is gonna take that transcript that you post and it's going to create a step-by-step instruction for each account. So then what I'm going to do is I have a Google Sheet for all of our Snowplow accounts and I'm gonna just create a link back to that Google video, Google Drive video and paste the description in there so that somebody can pull up Google Sheets on their phone and they can access the video. They can also access the SOP at any point that they are plowing, no matter who is sitting in that truck seat.\r\n\r\n\r\nAnd this is how I believe that you just one way that you can use AI as a small local service business owner to document processes and scale in the future.\r\n\r\n\r\nNikolas Hulewsky (15:51.95)\r\nDude, how much cash on my screen?\r\n\r\n\r\nAustin (15:56.488)\r\nYes, please.\r\n\r\n\r\nNikolas Hulewsky (15:57.292)\r\nOkay. Cause I think this one thing that I loved about our podcast last week was how you were like, can you show me? Fantastic. All right. So I'm gonna share my screen. Let's go find this. I think this is the one.\r\n\r\n\r\nAustin (16:04.648)\r\ndo it.\r\n\r\n\r\nNikolas Hulewsky (16:18.506)\r\nSo as you were talking, I was not tweeting or texting. I was writing this prompt. Okay. So as you're talking, I was thinking through the process of like, if you own a small business, many people don't even know what an SOP is. like, I don't know what that is. Standard operating procedure. So this is a standard procedure that you can document so that as you scale,\r\n\r\n\r\nYou can just hand this to the new person who's hired and help them understand what their job functions are. Okay, so I wrote this prompt. I'm a small business owner who's growing. I would like to be able to scale my business quickly, but in order to do that, I need to have SOPs for every function that I currently do myself. Can you give me an SOP template that I can use for every job function that includes software needed, communication expectations with the team, who I hand the process off to, where I get the job from? That's all I have so far. Is there anything that you would add to this?\r\n\r\n\r\nAustin (17:19.028)\r\nSOPs for every function. Sorry, I'm just thinking on the fly here. Did I currently?\r\n\r\n\r\nNikolas Hulewsky (17:20.046)\r\nIt's okay if you don't.\r\n\r\n\r\nNikolas Hulewsky (17:23.918)\r\nSo what I'm trying to do is just create a template so that when Austin is ready to hand off the snow plowing scheduling, whatever it is, you can go to chat to me and be like, hey, here's the template that I have. This is the job function. Help me write it. You know what I mean? It's like you have a starting base. You're not just going from square one.\r\n\r\n\r\nAustin (17:29.052)\r\nYes.\r\n\r\n\r\nAustin (17:35.314)\r\nYeah.\r\n\r\n\r\nAustin (17:43.088)\r\nAgreed. Agreed.\r\n\r\n\r\nsoftware needed to use communications, who I hand the process, where I get the process from, who... Yeah, let's just kick it in there and see what it kicks out and then we'll make edits on the fly.\r\n\r\n\r\nNikolas Hulewsky (17:56.556)\r\nOkay. Okay. And is there anything else that I need to add that I am not considering or thinking of that will make this SOP as comprehensive as possible?\r\n\r\n\r\nAustin (18:21.012)\r\nSo I love what you're doing here. And I want listeners, especially if listeners of my podcast are listening in that like zero to one million phase, like don't overthink this process. Just jump in and like click it and tell chat GPT to give you what you like to see what Nick did there. It's like anything else that I need to add that I'm not considering or thinking to make the SOP as comprehensive as possible. That's gold right there.\r\n\r\n\r\nNikolas Hulewsky (18:28.716)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (18:41.452)\r\nYeah.\r\n\r\n\r\nOh, yeah, because you think like, Oh, well, I have to know everything like, no, you don't have to know everything. That's the point of having this assistant. And you just ask it, is there anything I'm missing? Like, what do you what do you think? Is there something that I'm not seeing? The one of my favorite roles to be before this is before AI came out was to be the first bad idea. And I used to say this all the time. When I was in a group, and we're trying to figure something out, I'd be like, Hey, first bad idea. What if we, I don't know, bioengineered chickens?\r\n\r\n\r\nto have cameras on their head, right? And, and everybody like, that's the dumbest idea. No, that here's why it's a dumb idea. And then all of a sudden, the ball would get rolling. It like does two things. One, it just gives people an opportunity to get the juices flowing. But then to like, it's somewhere for them to start from, they can actually contrast it with, yeah, I don't like that. Because of this, actually, what it means is this. So that's how I think of right now, utilizing AI art. So here's here it is.\r\n\r\n\r\nwhat it's spitting out for me. The SOP template. Title of the template, makes sense. Prepared by, makes sense. State created, purpose, great. Job overview, okay, yeah. Briefly describe the task. Software and tools needed, right, makes sense. List all the software is needed. Procedure steps, clearly define each step of the process, great. Source of job process, so like where does it come from? Who do I communicate with? Process hand up. Troubleshooting FAQ. And then performance, this is good. I didn't even put this. Performance management.\r\n\r\n\r\nWhat are the key metrics or KPIs to measure the success of the task? Like you wanna know whether or not somebody's doing good in that role. for your snowplow guy, what's the key, what's the KPI? What's the key performance indicator for them on whether not they're gonna be successful?\r\n\r\n\r\nAustin (20:25.16)\r\nFive star, did we get a five star review?\r\n\r\n\r\nNikolas Hulewsky (20:28.45)\r\nPerfect, so now your employee knows, like, here's all the things that I'm supposed to be doing and here's whether or not I'm being successful, because now I have the five-star reviews.\r\n\r\n\r\nAustin (20:36.136)\r\nand by the way, now that chat GPT gave me that performance measurement, I know that I want to compensate and add a bonus structure for every five star review that we get to pay that person $250 every time that we get a five star review. So I'm going to go back to chat GPT. I'm going to highlight that and I'm going to be like, please add, please add a bonus $200 per five star review bonus structure to the performance review. And then it's like, to your point, like chat GPT, especially as a creative entrepreneur, right? Like.\r\n\r\n\r\nNikolas Hulewsky (20:48.526)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (21:05.687)\r\nMm-hmm.\r\n\r\n\r\nAustin (21:06.324)\r\nIf you struggle with ADD like I do, like this is a gold mine. Like this is the solution to my past problems, right? I couldn't ever focus long enough to create this, but ChatGBT is doing it. Now all I have to do is just like work with it.\r\n\r\n\r\nNikolas Hulewsky (21:20.248)\r\nSo now what I can do, this is what I like. Let's see if I can figure out from this link. No. All right, so now what I can do is I can go to this chat and I can say, I actually wanna save this chat.\r\n\r\n\r\nNikolas Hulewsky (21:40.92)\r\nHere it is.\r\n\r\n\r\nI wanna add it to a project. So I can go anywhere in here and I can say AI series, right? So if I add it to this project, now this chat will save and I'll have that template anytime that I wanna go and create a template for my business. And it's not great, like it's not the perfect template, but it's a starting place for you as a business owner to now like start writing these SOPs for every one of these job functions.\r\n\r\n\r\nAustin (22:10.374)\r\nand guess what? Now you also have something to ask other people within your business to follow as well. It's like, okay, we're going to start crafting S OPs and documenting everything as a company. but awesome. Like where do I start? It's like, well, here you go. Just use this as a framework. I got a question for you though. It's sorry. I don't want to, I don't want to interrupt that. So save that thought. My chat GPT looks like a scattered mess.\r\n\r\n\r\nNikolas Hulewsky (22:27.566)\r\nOkay. Yeah, yeah, yeah.\r\n\r\n\r\nNo, no, no.\r\n\r\n\r\nAustin (22:36.614)\r\nI want to ask you how you've set up the organization of yours in projects.\r\n\r\n\r\nNikolas Hulewsky (22:40.334)\r\nOh man. Yeah, I'll go back to it. Hold on. It's still a mess, but...\r\n\r\n\r\nAustin (22:49.062)\r\nIt looks clean on the inside to me.\r\n\r\n\r\nNikolas Hulewsky (22:50.87)\r\nI'm lucky because I have a full-time assistant, right? She's my executive assistant, Kelly, and she keeps me organized. But I'll walk through this. So you can do these things called projects within ChatTPT. ChatTPT didn't used to have this, but now you can actually create folders to go and save things. So the newest project that I created is this product. It's the AI series.\r\n\r\n\r\nAnd you can actually come in here, you can add files to give it context so that any new, let me take a step back actually, sorry. I'm gonna go to this. So this is content creation. This is my content creation project. And in content creation, every episode that I have, I go and upload the transcript to this content creation folder. So this episode came out last week. I did it with Jack Carr. He's the co-host of...\r\n\r\n\r\nowned and operated. I think it's the end of the podcast with John Wilson. And so you can see here at the very top, I copied and pasted this is the actual transcript. And then I gave it a little prompt. And then from there, it spits out this. Here are the key takeaways. Here are the business model insights from our conversation. Here's the tactical guides and frameworks, because those are what I like to post about. This is\r\n\r\n\r\nabout his entrepreneurial journey, and this is how he overcame barriers, industry-specific deep dives, et cetera, suggested content piece. So it spits out all of this stuff based on a prompt that I created for it to spit out. But now it's saved in this content creation folder, and I can go back to it any time to look at. So.\r\n\r\n\r\nYou can also tailor the content creation folder. So you can add specific files so that it has context, so it understands what you're asking it. And you can give it specific instructions so that it understands again, what you're asking of it. And so I have, when my assistant, when I finish a podcast episode, my assistant goes up here, I've created these custom GPTs and she goes into this content strategist and it's a...\r\n\r\n\r\nNikolas Hulewsky (25:09.088)\r\nIt's very specific. created the GPT myself. It has a lot of context. She just enters in the transcript and then it spits out what I've asked it to spit out. She then copies and pastes that and puts it into the content creation folder. So that spit out what you saw really came from this custom GPT that I created. It's probably a better way to do it, but that's just the way that I do it. Then I have a folder for, how do I close this? Then I have a folder for podcast intros. Again, I'm just looking for good quotes.\r\n\r\n\r\nAnd it has it anytime that I come in here. Right here, I can enter a new chat. It will create a new chat. I'll you know, you don't have to do anything crazy each and every time. This is what I use for preparing for podcasts. So if I'm doing prep work or trying to do some research on things and then I have other folders in here for my family. I have a church folder. I teach a youth class. And so when I'm preparing for that, it gives me ideas on how to teach them.\r\n\r\n\r\nposts, business plans, a scaling workshop that we're working on, videos from economics. So if I'm ever working on something over here that's really good that I wanna add to one of these folders, I'll just click into the three dots and add it to a project.\r\n\r\n\r\nAustin (26:24.85)\r\nOkay, so I have two ways, two ways that I could ask questions from here. And I'll start with one and I'll ask you, do you want to keep it higher level or do you want to dive deeper like we did on the last one and be very tactical?\r\n\r\n\r\nNikolas Hulewsky (26:38.07)\r\nI want to dive deeper, I don't necessarily want to dive deep on my, like, content stuff. I don't... Does that make sense? I don't know.\r\n\r\n\r\nAustin (26:44.85)\r\nYes. I think what's really interesting to me that we just skimmed over here and what a lot of listeners I think are going to ask is like, how did you train that custom GPT? Like what were some of the prompts and what was some of the information you fed it to kick these out so that you could create this to where you can just publish the transcript or copy and paste the transcript into these to kick these things out.\r\n\r\n\r\nNikolas Hulewsky (26:56.056)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (27:02.477)\r\nthat's great. Let's do that. Yeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (27:10.508)\r\nOkay, so let's go ahead and do, yeah.\r\n\r\n\r\nBusiness plans prompt. Okay. So this is something that I was working on and\r\n\r\n\r\nThis is a little meta. I used ChatTPT to create the prompt for business plan. So, business.\r\n\r\n\r\nAustin (27:37.842)\r\nwhich that strategy kind of falls into where the other question I was going to ask too. So we can come back to that after this.\r\n\r\n\r\nNikolas Hulewsky (27:43.596)\r\nOkay, let's see if I can find it. So I used...\r\n\r\n\r\nNikolas Hulewsky (27:57.102)\r\nAll right, so this is the chain that I used. I'll walk you through it. Before I even get to creating my own custom GPT, think of the custom GPT as helping you ask the perfect question every single time. And one of the things that has come out of ChatGPT in these large language models, and you saw it when we were doing the\r\n\r\n\r\nprompt for the SOPs is you have to get good at asking questions. There's a whole job now called prompt engineers. Their whole job is to figure out the best way to write prompts for these large language models. And I know that I'm not a prompt engineer, but I need help writing the right prompts. So I go to ChatGPT and I said, I need your help writing this prompt because I want to take my episodes that I've had and create business plans out of them that are actionable and tactical for people.\r\n\r\n\r\nSo I went to it and I was like, let's pretend I'm a Wanchepreneur or entrepreneur, wanting to into a specific business. What research would I want to do in order to make a decision whether or not to get into that business? So that's my target demo. My target demo are entrepreneurs or Wanchepreneurs who are trying to make their first million dollars and they want to understand how other businesses work. So then it spits out this sort of outline.\r\n\r\n\r\nmarket research, business model evaluation, competitive landscape, legal and regulatory, blah, blah, blah, blah, I liked it. It was great. And so then I said, all right, I interview entrepreneurs for a living and I put content out for people to learn. How would you templatize this structure? Templatize meaning I can use it over and over and over again with different conversations so that I can release this in conjunction with a specific interview. Great. So then it releases, then it gives me the template. Cool. Here's the template.\r\n\r\n\r\nGreat. And then there were some things that I didn't like. So I was like, I like bullet point three, but I think I want to change it to this. I'm like going back and forth now and I'm ideating with it. We're creating this new business plan template together. And I know I'm scrolling through this, but I hope you can understand what I'm And I'm still giving it some edits. Great. Wonderful. Here are some more things that I want in it, yada, yada, yada. It's spitting things back out to me. And then I get to...\r\n\r\n\r\nNikolas Hulewsky (30:20.59)\r\nI'm getting to the section where I say, want this to be written. Here we go. So I've gotten to the place now where I'm like, cool, I like the template that it's created for me. This is great, but I don't want to do this every single time. I want you to create a custom GPT and use this template as a prompt. But I want to tell the GPT what info it should pull from the conversation and what info it should pull from the open web. How would I do that? So there are going to be some things in the conversation which obviously the entrepreneur is going to know about their business.\r\n\r\n\r\nLike if I'm talking to you about land clearing, you're going to know all the mechanics, all the operations, et cetera. But you may not know how fast is it growing in the United States? What does the economic outlook look like for it? What are the key economic indicators that I should look for that correlate with land clearing? Maybe it's actually countercyclical. in recessions, land clearing is great. But in booming times, land clearing is not. You're not going to necessarily know that. I'm going to have it go scrape the open web and find those things and pull it into this business plan.\r\n\r\n\r\nSo now it's creating the prompt for me. We work it, we iterate it, and we get all the way to the end where this was the final prompt that it gave me. And so now I have this prompt that I can copy and paste into a custom GPT. Now, I've never used, I don't think I created this. Let me just make sure. you can't see my prompt. Anyways, I don't think that I created the custom GPT with this prompt.\r\n\r\n\r\nLet me look over here. No, I didn't. So I'll show you how to create a custom prompt right now. In fact, let me just make sure that this all looks good. Might have to do some editing. All right. So if you have Chat GPT, you go here, explore GPTs. And if you've ever messed with this, you can see there's a lot that you can go and choose from.\r\n\r\n\r\nDolly, which does pictures for you, there's a data analyst, there's writing help, all of this stuff. We're not gonna do any of that, we're gonna go up here to create, and now we are going to create our own GPT. So I'm gonna take that prompt.\r\n\r\n\r\nNikolas Hulewsky (32:35.63)\r\nCopy it.\r\n\r\n\r\nHere's a prompt I would like to use to create.\r\n\r\n\r\ncustom GPT and then I paste in.\r\n\r\n\r\nNikolas Hulewsky (32:58.328)\r\nSo now you can see I've pasted in this full prompt. Has everything that we were just talking about.\r\n\r\n\r\nNikolas Hulewsky (33:10.252)\r\nAnd now it's working. I don't know what is working, but it's working where it's creating this custom GPT. But I don't want to just have the prompt. I want it to sound like me. And so now what I'll do is I'll go and find some writing. That was my writing that I want it to spit out so that it actually looks and or sounds like.\r\n\r\n\r\nwhat I want it selling. I will go, let me go find.\r\n\r\n\r\nSomething.\r\n\r\n\r\nNikolas Hulewsky (33:43.566)\r\nHold please.\r\n\r\n\r\nNikolas Hulewsky (33:57.084)\r\nI did this big breakdown one time of valuing your first business.\r\n\r\n\r\nAnd so I went just now and I copied and pasted that whole thing and I would say, I would like for this GPT to sound like me and to help you understand what that means. Here is a sample of a long form post I wrote about.\r\n\r\n\r\nvaluing any business. So now I just copied and pasted this long post that I had about valuing a business.\r\n\r\n\r\nNikolas Hulewsky (34:47.406)\r\nNow this isn't, I would do more, honestly. I would put a little bit more, I would put some more writing, I'd put some more context, I probably would do some more with the prompt. But for purposes of this, I just wanna get through it so I can show you how it works. But this will be good enough. And so now what we'll do is we will say,\r\n\r\n\r\nAfter it's updating, we're just going hit create and I am going to go get a transcript now so that we can copy and paste a transcript into.\r\n\r\n\r\ninto chat GPT and show you what it actually looks like.\r\n\r\n\r\nNikolas Hulewsky (35:29.772)\r\nOkay, cool. So I'm gonna hit create.\r\n\r\n\r\nWe'll do anyone with a link, I don't care. We're going to save it. And now it's going to be called Business Research Assistant.\r\n\r\n\r\nand I'm gonna go pull the same Jack Carr episode transcript.\r\n\r\n\r\nNikolas Hulewsky (35:56.718)\r\nI'm gonna read GPT.\r\n\r\n\r\nAnd I'm gonna say, please write me a business plan based on this conversation with Jack Carlin.\r\n\r\n\r\nNikolas Hulewsky (36:13.23)\r\nSo can see it's a 40 minute conversation and we'll see what it spits out. With Jack, I didn't like get into the full nitty gritty of HVAC, which is his business, but we did talk a lot about it. We talked more about like, how did he buy his first business and how did he scale and all of those things, but we'll see what the GPT spits out. And you can see it's already spitting out some good stuff. So.\r\n\r\n\r\nCompany overview, Jack has an HVAC and plumbing company based in middle Tennessee, grew up from sub 1 million to five to 6 million in 2024, 17 employees. He wants to achieve 20 million by 2030. Their growth strategy, target small mom and pop HVAC companies. Yeah, it's perfect actually. Focus on undervalued acquisitions, operational excellence. This is what he did to be operationally excellent. The financial strategy, let's see if they went and actually.\r\n\r\n\r\nNikolas Hulewsky (37:11.65)\r\nYeah, so this is what it spit out for me. And so from here, I can go and actually mess with the GPT and be like, I didn't pull anything from the internet. So I wanna go change that up. So I can actually, I'll come back out here. Business research assistant.\r\n\r\n\r\nNikolas Hulewsky (37:36.27)\r\nI can go and edit this GPT. So...\r\n\r\n\r\nAustin (37:39.976)\r\nThis is awesome.\r\n\r\n\r\nNikolas Hulewsky (37:42.68)\r\nYeah, so it already has everything that I said and I could say like, hey,\r\n\r\n\r\nI would like\r\n\r\n\r\nfor this GPT to pull industry specific information from the open web. Yeah.\r\n\r\n\r\nAustin (38:04.87)\r\nAnd before you click enter, for those of you who are just listening to this on audio, ChatGPT gives you two options on this screen right here, create and configure. You're within a custom GPT right now. Would you be creating or would you be configuring when you're updating?\r\n\r\n\r\nNikolas Hulewsky (38:23.136)\r\na question. Yeah, so configuring means, let's see what it is.\r\n\r\n\r\nNikolas Hulewsky (38:30.046)\r\nlike. I don't know the answer to that question honestly. yeah. I'd like to see you specific information from the open web. Each time there is a new chat about a new business I overview. I mean yeah my language isn't great here. So.\r\n\r\n\r\nAustin (38:31.956)\r\nOkay, well let's try with the create and see what it does first.\r\n\r\n\r\nNikolas Hulewsky (39:03.224)\r\nSo hopefully now what it will do is actually pull information from the open, what it talks about, industry size, growth rate, key players, whether or not it's consolidated, whether or not it's fragmented, et cetera.\r\n\r\n\r\nAustin (39:19.91)\r\nAnd so I know you're moving quick through this, but what he just said verbally is something else you could put in the GPT as well, if you're listening to this. Like if you want, if you want it to be that specific and coach it and give it a framework.\r\n\r\n\r\nNikolas Hulewsky (39:29.826)\r\nThat's true. Yeah.\r\n\r\n\r\nNikolas Hulewsky (39:34.606)\r\nindustry growth rate.\r\n\r\n\r\nprojected growth rate, industry headwinds and tailwinds. If you don't know what headwinds and tailwinds are, those are like forces pushing you forward or forces pushing against you.\r\n\r\n\r\nNikolas Hulewsky (40:06.062)\r\nSo let's update this. We'll let it spin for a second. And then I'll go back to that same prompt with Jack. And I'm just going to re-enter the transcript. Cool. So we hit Update.\r\n\r\n\r\nNikolas Hulewsky (40:28.99)\r\nVGPT.\r\n\r\n\r\nNikolas Hulewsky (40:36.494)\r\ncan't remember what the original prompt was that I said, but...\r\n\r\n\r\nNikolas Hulewsky (40:42.094)\r\nplease.\r\n\r\n\r\nNikolas Hulewsky (40:47.02)\r\nthis transcript.\r\n\r\n\r\nWe'll see if it updated at this time.\r\n\r\n\r\nAustin (40:55.464)\r\nAnd so theoretically, whenever you have a custom GPT created, each time you go in, you're not having to specifically tell it what you want to do because you've already done it once to create the template. So hopefully it kicks out what you need it to kick out by just saying, please analyze this transcript. it's.\r\n\r\n\r\nNikolas Hulewsky (41:11.906)\r\nYeah, yeah, we will see. right, so background, great. That's business specific. So this is Jack specific. It's a little bit different than the first one that we looked at, but it still has all the pertinent information. What he bought the business for, how big it was, W2 experience beforehand, what the key takeaways were, the growth of his specific business.\r\n\r\n\r\nhis own operational challenges, key learnings from the business.\r\n\r\n\r\nNikolas Hulewsky (41:49.454)\r\nAll right, so it didn't include an industry overview this time. So I'd have to go back and like start refining it, but this is like the process that you'd want to kind of iterate through when you're creating your own custom GBTs.\r\n\r\n\r\nAustin (41:58.886)\r\nYes. And this is sort of where I was mentioning earlier, like over the last three weeks, I've defined a very important use of my time is spending time with the GPT, just coaching it back and forth. And so going back to something you said, if you just, if you hired a new employee, you can't expect them just to know everything right out the gate. And the same is true for AI. You have to spend time with that, coach it, train it. And so.\r\n\r\n\r\nThanks for sharing this process. appreciate it.\r\n\r\n\r\nNikolas Hulewsky (42:30.572)\r\nYeah. Again, wasn't planning on doing that, but here we are. I really think that, like we were talking about, anybody who's messed around with data knows that your data set has to be clean in order for you to get good insights from that data. And I think the same is true for, it's analogous for these LLMs.\r\n\r\n\r\nAustin (42:38.014)\r\nHere we are.\r\n\r\n\r\nNikolas Hulewsky (42:58.816)\r\nIn order for them to operate well, they've got to have good questions and they've got to have good context to operate from. And so it's your job as a business owner now to start thinking about how do I create this context? And it's going to make your business better. Just very frankly speaking, even if you never used AI, but you just went through the process of creating SOPs, your business will be better for it. Period. End of story. Even if you never automate a thing, just having SOPs so that you can train and onboard people.\r\n\r\n\r\nYour retention will be better. Your employee satisfaction will be better. Your service will be better. Your product will, like everything will be better just because you took the time to actually document the stuff. that's something I think that when you're sub one million, you don't think you have time to do, but then you're only ever going to be sub one million if you don't take the time to figure this stuff out.\r\n\r\n\r\nAustin (43:46.344)\r\nThat's correct. And just a real world example, especially when you're sub 1 million, it's like you have all this stuff going on in your head and you are so tied into the business. Like you have this pulse on it and it's easy to fall into the trap of thinking that everyone else you hire onboard your team just understands the vision and the mission and exactly like what you got, what you're trying to accomplish. But the reality is like one, you likely\r\n\r\n\r\nAt least for me, I likely had not even communicated that to people who I hired in the beginning to even if I had communicated it to him once. It's like, that is the. Our role as the owners or the founders is to like continually drive the mission. And it's like, that has to be revisited consistently. And so one area that AI has helped me is like, if I feel like I didn't have the time to document those processes, or even just as simple as like, here's what the mission is for 2025 and here's what our.\r\n\r\n\r\ngoals are, AI can help you quickly get there in a way that you can get it on paper and then send it or show it to people who are on your team so that they at least have it in writing to visit and you have documentation that you communicated that to them.\r\n\r\n\r\nNikolas Hulewsky (44:59.054)\r\nAnd here's what just doing this process that I just did, SOPs are creating your first custom GPT. Here's what it's going to do. After you do that the first time, you've gone through two hours and it's been like a pain in the butt and finally figured it out. All of a sudden you're going to be like, you know what else I could use this for? Oh, I can use it for this. All of a sudden, the world is going to be open to you in how you can actually utilize this to make your business better.\r\n\r\n\r\nI know it's a painful and like awkward first step and you feel stupid and like, Oh, I don't know what I'm doing about a techie minute. Get over it. Try to just create a custom GPT like I just did. Try to create an SOP like I just did. It's not difficult. You just have to build the muscle. And once you build the muscle, it becomes a lot easier for you to get to the next step and the next step and the next step.\r\n\r\n\r\nAustin (45:47.26)\r\nOf course. And I don't know what you think about this, but I'm of the mindset that the fastest growing businesses and the best businesses in each market are going to be the ones leveraging AI in the future. so there really is no option because there's going to be somebody in your market who figure that figures this out and they're just going to be able to move faster than you. So I'm of the mindset. It's like adopt this early, figure it out, get the kinks out of the way right now and just\r\n\r\n\r\nNikolas Hulewsky (46:10.837)\r\nYeah.\r\n\r\n\r\nAustin (46:16.498)\r\nstart building processes for using it.\r\n\r\n\r\nNikolas Hulewsky (46:16.834)\r\nYeah, this is another theory that I have. You've probably gone into AI or chat, whatever. You're like, agents are here. And you mess with it. And you're like, it's not there yet. It's not perfect. It doesn't give me the answer that I want. Alture. Alture. I promise you there will be an inflection point where this technology works. And if you are waiting until the inflection point where the technology really works.\r\n\r\n\r\nyou're going to be behind the curve because you're not going to understand how to use it. The people that are going to leave you in the dust are the ones who are right now figuring out how it works and how to use it so that when the inflection point comes, they already understand how to best leverage this technology. They're not getting up to speed. They're up to speed. Now they're just implementing. And so there'll be this 12, 18, two-year, 18-month, two-year period of time where there'll be an outsized return to those who've actually taken the time to understand how this works.\r\n\r\n\r\nAnd then everybody else will catch up, but how much more ahead will those people in two years be than everybody else who catches up with them? I think it's going to be a massive separator for people.\r\n\r\n\r\nAustin (47:17.734)\r\nAgreed. Agreed. So one thing you mentioned earlier was, Hey, I have my executive assistant helping me on this. And I know what some of the listeners were thinking at that point. Man, it would be sweet to have an executive assistant. I wish I had that. And it's like, well, guess what? You can right now. And Nick, I'm to put them on the spot. And it's like, if you've never hired an executive assistant before, how would you use chat GPT to go quickly, like outline a process for crafting a job description?\r\n\r\n\r\nNikolas Hulewsky (47:44.949)\r\nokay. You want me to do it or do you want to do it?\r\n\r\n\r\nAustin (47:50.118)\r\nI can do it, like, let's just even talk about it. It's like, where does your brain go for, okay, I've never done this before. How would I use chat GPT to like quickly help me hire an executive assistant?\r\n\r\n\r\nNikolas Hulewsky (48:00.928)\r\nAll right, I'll share my screen again. Because I think just showing people.\r\n\r\n\r\nAustin (48:05.746)\r\nIt would be cheating if I did it because I've done this four times in the last two weeks. Yeah, it's crazy how fast you can move with AI.\r\n\r\n\r\nNikolas Hulewsky (48:08.994)\r\nHave you really?\r\n\r\n\r\nNikolas Hulewsky (48:15.33)\r\nOkay, so let me I'm getting my screen back set up because it's kind of a pain to go there. Okay, so let's start a new chat and If I'm somebody and I've never used chat tbg before it's like, okay, what do I do? First tell it who you are and then ask the question. I own a land clearing Company and I'm growing\r\n\r\n\r\nI an executive assistant who can, this is good, I've never thought of it this way, but I'm like, okay, who, what? So let's go through like the W question. So who am I? I'm a land clearing company growing. What do I want? I need an assistant, an executive assistant who can keep me organized.\r\n\r\n\r\nWhy am I asking ChatGPT? I have never hired for this role before. Please help me outline a job description.\r\n\r\n\r\nand given\r\n\r\n\r\ngive me a recommended step by, oops.\r\n\r\n\r\nNikolas Hulewsky (49:45.282)\r\nWe'll edit this piece. Step by step. Hiring process to follow.\r\n\r\n\r\nNikolas Hulewsky (50:00.27)\r\nAll right, let's see what that does.\r\n\r\n\r\nNikolas Hulewsky (50:07.308)\r\nSo again, first bad idea. Let's see what the first bad idea is. At least it'll tell you what you do or don't like about it. All right, my.\r\n\r\n\r\nAustin (50:13.49)\r\nAnd at a very minimum, it's going to give you a structure to work off of as a job description.\r\n\r\n\r\nNikolas Hulewsky (50:17.624)\r\nExactly. All right, positions, executive assistant, my company, location, type, full-time. Well, I want full-time. I want an hourly, right? Like right there is something that you're automatically gonna start thinking about. About us, I don't like the way it described us. What the role is, and now you can read about the role. Okay, yeah, trusted right-hand, I like the way it said right-hand person. Responsibilities, you'll come through this. So automatically it's giving you.\r\n\r\n\r\nLike that's a really good job description. Requirements, like it'll tell you, okay, what's expected of somebody who's been in this role. Bonus qualifications, great. And now it's gonna spit out, what do I do? Like how do I hire this? Step one, you prepare it, create clarity. Step two, you post it. It even tells you where to post it, that's cool. Step three, you add initial screening, phone screening, formal interview with some sample questions, and then even more. So.\r\n\r\n\r\nIt wasn't a crazy prompt. You know what I mean? It's like pretty simple, but now I have a job description and it's telling me exactly how to go higher for this role. I think that's really cool.\r\n\r\n\r\nAustin (51:30.92)\r\nI think it's really cool because it answers a lot of questions that a lot of people who have never hired before have. It's like, okay, well, how do I even create a job description or what do I include in a job description? Or like, what do I include in an interview? And it's like, if you have those questions, I would encourage you just to continue, keep asking. Right. And then another encouragement I would add here is what do you do on a recurring weekly basis that you don't like doing or that takes up a lot of your time?\r\n\r\n\r\nNikolas Hulewsky (51:43.982)\r\nyou\r\n\r\n\r\nAustin (52:00.526)\r\nOr third, what area are you, what are you procrastinating in your business right now? And so it's like, if you want to be more specific about the hiring description, start brainstorming, like three of those things, and then just ask the GPT to update the job description with those specific tasks.\r\n\r\n\r\nNikolas Hulewsky (52:15.822)\r\nYeah, I totally have. Have ever hired a virtual assistant overseas? I have. And the first like 10 that I hired suck. They sucked. They were the worst. It didn't they didn't work. They didn't understand things. They couldn't speak English. And then what I realized is they don't suck. I suck. It's not their fault. I didn't give them any direction. I didn't tell them what I was expecting. I didn't tell them what the KPIs were, what I you know, whether or not they're\r\n\r\n\r\nAustin (52:18.952)\r\nYes.\r\n\r\n\r\nAustin (52:36.348)\r\nMm. Mm.\r\n\r\n\r\nNikolas Hulewsky (52:45.72)\r\nhow they would know whether or not they're doing a good job. And so ever since I've had that sort of mental shift, it's gone a lot better. I still have the VA's who didn't work out, but this process, you've ever tried to hire overseas before and it didn't work, it's probably because of you, not because of the talent. And again, it's not you're a bad person or anything like that. It's hard to manage virtual people. It's much easier when somebody is sitting next to you and...\r\n\r\n\r\nyou go through this process with them. like, oh, let me just show you. Oh yeah, there's this. And all of a sudden they're picking up things that you didn't necessarily communicate to them in the job description. So ChatTPT can kind of be that person who's there with you, getting those insights out of you so that you can hand it off to somebody and they'll be successful.\r\n\r\n\r\nAustin (53:32.922)\r\nLove it. This is awesome. Hey, what time is your hard stop here?\r\n\r\n\r\nNikolas Hulewsky (53:33.934)\r\nAlright.\r\n\r\n\r\nNikolas Hulewsky (53:44.119)\r\nI'm good until 10.\r\n\r\n\r\nAustin (53:46.644)\r\nOkay, I gotta pee, can I take a quick pee break?\r\n\r\n\r\nNikolas Hulewsky (53:48.598)\r\nYeah, yeah, yeah. I think we can end the episode.",
  "metadata": {
    "duration": "",
    "date": "2025-04-07",
    "platform_source": "Google Drive"
  }
}