{
  "episode_number": "173",
  "episode_title": "$1M ‚â† Freedom; It‚Äôs a Mirage with Jacob Turner",
  "guest_name": "Jacob Turner",
  "business_name": "Moment Private Wealth",
  "transcript": "﻿Nikolas Hulewsky (00:01.472)\r\nSo your background, incredibly interesting. I'm really glad that you agreed to do this because I've always wanted to hear from an athlete of what it was like, not just being an athlete, but the transition. You're 34 years old and a retired baseball player, which is just freaking hilarious. Cause 34 years old, you're in the prime of life, my friend. So for those of you, for those who don't know you, can you give us the 32nd quick history on you? Jacob Turner, the baseball player and now entrepreneur.\r\n\r\n\r\nJacob Turner (00:31.612)\r\nYeah. The quick history is I was the ninth overall pick in the 2009 draft. I got to the big leagues at 20. I was convinced that at 20, I was going to be playing for the next 15 years. We would not be having this conversation right now because I'd be currently in the big leagues. By 25, I'd been extremely humbled, was back in AAA, was essentially hanging on by my career by thread. Realized by 27, 28, this thing's not going to last until I'm 34, 35 years old. So I better start thinking about what's next.\r\n\r\n\r\nI've always loved business. I've always loved understanding the way the world works. I stopped playing at the age of 29, started this business at the age of 30. I've been building it ever since and we help athletes, entrepreneurs build and protect wealth. So essentially helping athletes and entrepreneurs navigate a lot of the same complexities that I navigated.\r\n\r\n\r\nNikolas Hulewsky (01:16.654)\r\nCool, so you're catering specifically to athletes.\r\n\r\n\r\nJacob Turner (01:19.782)\r\nCorrect.\r\n\r\n\r\nNikolas Hulewsky (01:20.782)\r\nCan you me a size how big the firm is? Or give me an idea of like the size of the firm.\r\n\r\n\r\nJacob Turner (01:24.506)\r\nYeah, so we have three total team members at work with Moment and then a bunch of outsource people. operate essentially as a multifamily office, so we coordinate and manage everybody's entire financial picture. We manage personally a little over $200 million in assets, and then I'd say we advise on another $600 million. I say that because a lot of the clients we work with, as you can imagine, most entrepreneurs, 99 % of their net worth is in their business.\r\n\r\n\r\nNikolas Hulewsky (01:42.488)\r\nI will.\r\n\r\n\r\nNikolas Hulewsky (01:50.382)\r\nSo I'm going to get to like how your business works, but I have some, it's not very often I get to have a professional athlete that I get to talk to. My father was actually a professional athlete. He was a professional soccer player in the seventies and he had the opportunity to either go be a kicker for the Bengals or go play professional soccer. And he chose professional soccer. And I'm still kind of irritated about that. So my question though is, did you see the draft, the NFL draft recently?\r\n\r\n\r\nJacob Turner (02:18.736)\r\nI did.\r\n\r\n\r\nNikolas Hulewsky (02:19.63)\r\ncan't remember his name, but Deion Sanders is his son. Shador. Okay, so he doesn't get drafted. I don't even remember what round. He eventually gets drafted in and there's like a lot of controversy around him and teams didn't think he was mature enough, blah, blah. But you said something when you got drafted. You were like, I thought I was going to be playing for 15 years and I thought I was going to be X, Y, and Z until you got humbled. Do you think somebody like him, like is he in the eating humble pie?\r\n\r\n\r\nJacob Turner (02:22.436)\r\ndoor.\r\n\r\n\r\nNikolas Hulewsky (02:48.258)\r\nthe moment? Like, what do think his mindset is right now?\r\n\r\n\r\nJacob Turner (02:51.42)\r\nI think it's probably still a balance of like being naive. I mean, I don't know how old he is, 20, 21 years old. you don't have a ton of scars at that point. Obviously the draft didn't go assume how he wanted it to go. I think the one thing he's definitely realizing is that this is a business now. And although college football is somewhat of a business with NIL, I mean, you want to talk about business at the highest level, professional sports, especially the NFL. mean, arguably business at the highest level, you know, if you don't perform, there's no performance improvement plan. Like you're out.\r\n\r\n\r\nNikolas Hulewsky (03:06.094)\r\nMm.\r\n\r\n\r\nJacob Turner (03:20.548)\r\nAnd he's getting, think, the first taste of that with the NFL draft.\r\n\r\n\r\nNikolas Hulewsky (03:23.886)\r\nWell, I've always thought sports in particular are very analogous to entrepreneurship. remember I wasn't an entrepreneur, but it was my first job out of college and it was a very entrepreneurial company. they gave you PNL responsibility over a location, they called it. And I did really well. The first location that I went to, I fricking knocked it out of the park. It had been losing $400,000 a year. And in the first year that I was there, I turned it around. It made $600,000. So it's like a million dollar swing. And I was the wonder kid.\r\n\r\n\r\nWhen in actuality I lucked out, there's a set of circumstances that worked to my advantage, but I got confident, man. I was like, I could do this. I went to one place and then another place. And then finally I took an opportunity that just like wasn't my skillset, but I just thought, I'll figure it out. I'll make it happen. And I got fired. And it was like, it was the most humbling experience because all of a sudden I had to look inward and be like, okay, where are my weaknesses? Obviously it was very good for me long-term, but in the moment it was just...\r\n\r\n\r\nso difficult to realize you had screwed something up. Did you feel like that when you went down to the miners? Or was it a different situation? You felt like that all the time.\r\n\r\n\r\nJacob Turner (04:29.948)\r\nOh, I felt like that all the time. I tell people all the time. I tell people all the time. like, I've been fired more times than I can count. Um, I mean, heck, every time you come out of spring training and you don't make the team, you got fired. Now you go to the manager's office and like it's a day before spring training. And so, you know, you're not making the team. He's telling you, you're getting fired. Like, Hey, we really love you. We love you so much. We're going to send you a AAA because you're not good enough to be here. I mean, the reality is like, I think that.\r\n\r\n\r\nNikolas Hulewsky (04:36.91)\r\nAnd publicly.\r\n\r\n\r\nNikolas Hulewsky (04:43.582)\r\nUgh.\r\n\r\n\r\nNikolas Hulewsky (04:57.229)\r\nMmm.\r\n\r\n\r\nJacob Turner (05:00.356)\r\nIn a sense, it's, it's helped build who I am as a human being. In another sense, I think if you ask my wife, what has done to me, it's like somewhat hardened me. because like it's, there's no empathy in professional sports. so if you don't do good, like it's not that they're a bad person, they're a great person, but they're doing a job too. And if you don't win, the GM is going to get fired. If the GM doesn't win, the coach is going to get fired. So the coach is like, well, I got to put the best guys on the field. No matter how much I like you. it's about the best players performing.\r\n\r\n\r\nNikolas Hulewsky (05:30.05)\r\nDid you have a signing bonus? What was it?\r\n\r\n\r\nJacob Turner (05:31.642)\r\nI did.\r\n\r\n\r\nI signed for a contract that ended up paying me about $7 million.\r\n\r\n\r\nNikolas Hulewsky (05:38.892)\r\nSo when they say signing bonus, did you get a check like the day after you got drafted or how did that work?\r\n\r\n\r\nJacob Turner (05:44.188)\r\nWith Major League Baseball, the way it works is you get the first payment 30 days after you sign. So not to get into the weeds, but my contract was structured as what's called an MLB contract. So I got it over a four year period, but 30 days after I signed, I got a check for 1.2 million.\r\n\r\n\r\nNikolas Hulewsky (06:02.478)\r\nSo how long was it between you getting that check and the first time that you were like, I'm getting fired?\r\n\r\n\r\nJacob Turner (06:10.236)\r\nSo I got that check at 18, got to the big leagues at 20, got sent down the next day. So I was only in the big leagues for one day. they did kind of tell me that, but by the time I was 21, I'd gotten to the big leagues and, really gotten sent back down. Like they thought I was going to make the team be up there. And then I didn't. And then you start hearing like all these whispers like, he's not performing the way we thought. Or like he didn't come to camp and you know, throw 98, like we thought he was going to. And you start to one realize the business side of it. And two, you just understand the like.\r\n\r\n\r\nNikolas Hulewsky (06:24.813)\r\nMm-hmm.\r\n\r\n\r\nJacob Turner (06:39.45)\r\nMan, like if I don't perform, all these people that are here clamoring for me that like want my attention are not going to be here clamoring for me in the future.\r\n\r\n\r\nNikolas Hulewsky (06:47.714)\r\nWhat do you think you did different than many guys who get to that same spot and then never make it back to the league? Like, how did you work your way back? Was it a mentality or was it just time your body needed to develop? Like, how did you actually approach overcoming that?\r\n\r\n\r\nJacob Turner (07:00.896)\r\nYou know, everybody talks about mindset, right? And I think mindset for an athlete, honestly, is really similar to an entrepreneur. Like the only difference between an athlete and entrepreneur, in my opinion, is what your God given talent is. Cause to be at a professional athlete, you have to have like some outlier God given ability. Like you can work as hard as you want, but if I'm not six, five and up and I can't jump really high, I'm probably not going to play in the NBA. And for a pitcher like, yeah, there's things I can train, but like, if I can't throw 95 plus, I'm not going to be able to do it. But.\r\n\r\n\r\nWhere the similarities come in is from a athlete side and from an entrepreneur side, it's really the same thing. Like all it takes is just being able to get kicked in the teeth and stand up again and just keep moving forward and be like, that's normal. That's okay. And it's not like I didn't grow up. My dad owned a small business growing up, but like I would call him more of like a business owner than an entrepreneur. And I think they taught us that like, Hey, life isn't always fair.\r\n\r\n\r\nAnd sometimes like you're going to get kicked in the teeth and you need to show up. But I think it takes you going through that a couple of times. Cause when I first did it, was like, man, I just want to like curl up in a corner. I'm like, I don't, I don't want to come back out and like do this again. Um, and now as a, like you said, a seasoned 34 year old, um, I've been kicked in the teeth a few times and I just realized like, I'll just get back up and do it again.\r\n\r\n\r\nNikolas Hulewsky (08:17.868)\r\nI mean, I've always thought about that. The NBA is my favorite sport to track. And I've always thought like the guys who are the ninth, 10th man in the rotation, the sitting on the bench, they were all Americans. They were the best player on their high school team, probably the best player on their college team, probably like all conference when they were in college and now they're sitting on the bench and they just the mental shift of all of a sudden, Hey, I'm the guy to I'm a guy.\r\n\r\n\r\nand the rotation, and then in some instances where they just become the role player, it feels to me like there would have to be a mentality of someone who's humble enough to accept a change in role. Maybe they've got like a flexible enough mentality, but still confident enough to go out and execute. Is that a special type of personality to go and like make that transition when you get to the majors to understand, okay, I'm not the guy, but I can still be a guy on the team?\r\n\r\n\r\nJacob Turner (09:14.596)\r\nYeah, I'll share a story from my career. So I got traded to the Marlins when I was 22, I believe. And about a year and a half in, I was pitching really poorly. I was still in the big leagues. They kind of had to keep me there, not to get into the technicalities of it, but they really needed to make it work. So they moved me to the bullpen. So for people that aren't athletes or don't follow baseball, all that means is I was in the starting rotation. I went to the bullpen. I was basically getting demoted, but I was still staying in the big leagues. I remember my first reaction, like the bullpen, like I don't pitch out of the bullpen. I'm a starting pitcher.\r\n\r\n\r\nNikolas Hulewsky (09:28.332)\r\nMm-hmm.\r\n\r\n\r\nJacob Turner (09:44.794)\r\nAnd was like this ego trip of like, and looking back on it, I'm like, man, what an incredible opportunity they were giving me. Like they were still keeping me there and they were going to give me this other opportunity. So I think Nick, to your point, yeah, I think there's this shift that has to happen, but for me, it wasn't a natural shift. was like a forced shift. And I can speak to like at the end of my career, I was in triple A my last year playing here in the States and I was having a ton of fun, but I had no ego anymore. It was like, I've gone through everything and it was.\r\n\r\n\r\nNikolas Hulewsky (10:02.424)\r\nYeah.\r\n\r\n\r\nJacob Turner (10:13.402)\r\nIt was interesting to watch from like almost that vantage point because I saw these prospects come in that just got in draft and they were talking about how they were going to be in the big leagues next year. They were talking to their agent and I just get to sit there and listen and I'm like, you know, I know the reality. Like most of them probably are going to be in the big leagues next year. Most of them, in fact, will never play one day in the big leagues. And I'm like, over here, I'm like, got, I got no ego. And most of those guys, I call them even kids at that time. I'm like 30, they're coming into.\r\n\r\n\r\nNikolas Hulewsky (10:30.433)\r\nYeah.\r\n\r\n\r\nJacob Turner (10:41.584)\r\nprofessional sports, they have no idea that like I was a first round pick and I was supposed to be the guy now like I'm in AAA and I'm listening to them. So it's an interesting dynamic for sure.\r\n\r\n\r\nNikolas Hulewsky (10:52.046)\r\nWell, it's so cool. I think it's a superpower when you just know yourself and you're comfortable in your own skin. And it's like, yeah, the world can change. They can change their opinion or their perception, but I'm still Jacob Turner or I'm still Nicholas Haluski. And like you said, it kind of got forced on you. I don't talk about this a ton, but we had a son who passed away 10 years ago. And like that moment for our family was the most grounding moment I've ever had in my life where it's like, okay, from now on.\r\n\r\n\r\nI don't really care to be famous. I don't care to be liked. And that's, that sounds harsher than it is, but I know it's important to me. It's like, okay, I got my family. I have my faith. I know what I want to do and what I enjoy. And I'm going to be so happy for other people who go out and crush it, who are the all-stars or the starters, you know, to relay it back to sports. But that has just freed me up to enjoy what I'm doing and to find other opportunities and not be.\r\n\r\n\r\nconcerned and competing with all these other people and to make better decisions as an entrepreneur than I would have when I still had that ego. And so I just think for every entrepreneur going through that process of getting your ego kicked out of you sucks, but it's like so necessary in my opinion, it's really necessary.\r\n\r\n\r\nJacob Turner (12:07.664)\r\nYeah. Well, first of all, as a dad of four kids, I'm sorry to hear that. I can't imagine what that felt like going through secondarily. I would add, and this is, sounds a little bit cliche, but I think perspective is everything. And my dad passed away in 2016. He was my hero, right? Like baseball. was like what I did with my dad. Like when I got drafted, I gave him a big hug and said, we did it. It was like our thing. And then he passed away. It was spring training. I'm trying to make the team. And I remember I pitched.\r\n\r\n\r\nNikolas Hulewsky (12:14.734)\r\nThanks man.\r\n\r\n\r\nNikolas Hulewsky (12:22.414)\r\nHmm.\r\n\r\n\r\nJacob Turner (12:37.372)\r\nIt was like five days after his funeral and it was kind of like this make or break start. And I'll never forget. It was like, I was with the white socks. was pitching against Oakland and I felt like so lost on the mound and I'm out there and I'm like, I'm trying to make the team. And, uh, I remember the pitching coach asking me after the game was like, is there, is everything okay? And I hadn't really shared like what was going on with my personal life. And I didn't even share that I was going to go home for the funeral. And I'm like, yeah, this is like, what's going on. He's like, man, like.\r\n\r\n\r\nYou didn't have to go out there today. And I just think that situation, much like you, like gave me a different perspective on life. And it's something that I try to always go back to. much like you, sounds like Mike, my faith is really important to me. I love being an entrepreneur. love building a business. I love sports. love competing, but all that stuff is like relatively meaningless in the grand scheme of things. And I think if you can have a perspective like that to your point, like it just, it makes life a lot more fun.\r\n\r\n\r\nNikolas Hulewsky (13:34.702)\r\nI used to hear people talk about this, like exactly what we're talking about and think like, ah, okay, can we get past this part? Cool. I want to, like, how much money do you make? Okay, cool, cool, cool. Yeah. Yeah. How many people do you manage? How many businesses do you buy? And I've come to realize as I've gotten older, which look, you're 34, I'm 39. So it's not like we're on our death beds, but as I've gotten older, it's like the softer things are really the things that allow you to do the harder things. If you're comfortable, if you're emotionally vulnerable, like if you're good with yourself,\r\n\r\n\r\nAll the other stuff follows. But when you want to skip those steps, oh, I just want to buy that business. I want to start that business. I want to make a million dollars. I want have a helicopter. I want to have whatever. You're not only cheating yourself, but you're going to be less likely to be successful, and you're not going to enjoy it nearly as much. So I preach that a lot. It's like, hey, you got to realize who you are, know yourself, and then you can go out and do whatever you want. But you do need some level of self-awareness. And I'll liken this back to entrepreneurship.\r\n\r\n\r\nThere are a lot of entrepreneurs who grow their business, but they hit a ceiling and they can just never get past it because they don't have the humility to say like, man, I suck at this. I'm going to outsource it. And sometimes it's that solopreneur when they get to the first spot where they need to make a hire and they just can't let go. And they get stuck at like $250,000 in revenue or it's the next level where they got to hire a manager and they just don't like not managing everybody. And so they get stuck at like a million dollars or they get stuck at 5 million because they don't know how to take a step away.\r\n\r\n\r\nand let another leader become the leader. But there's like all these ceilings that we hit. And if you can't be humble enough to recognize, okay, here's where my weaknesses are and now I can supplement them, you're not going to break through that ceiling and get past it. So for me, I always love to look at it like, okay, am I at the ceiling? What's going on right now? How can I self-evaluate where I can get better? And I feel like somebody like you as an athlete, is that just innate?\r\n\r\n\r\nAre you just always like, okay, how can I get better? I pitched 94 today. All right, I want to get 95. How do I get faster? I pitched three and a quarter innings. Gosh, how can I get to three and two thirds next outing? Is that something you've been innately good at or has that developed over time?\r\n\r\n\r\nJacob Turner (15:40.624)\r\nMm-hmm.\r\n\r\n\r\nJacob Turner (15:45.404)\r\nTerrible at it. Terrible. Like like the worst. Like that coach tells me something. I'm like, no, no, coach. Not for me. That's for that's for the guy down the hall. Not for me coach. No, in all seriousness.\r\n\r\n\r\nNikolas Hulewsky (15:54.286)\r\nJacob Turner (16:01.712)\r\nThe biggest change for me from sports to business has been accepting and now craving feedback versus in sports. Feedback is given, but feedback, it's an interesting dynamic in the clubhouse because at the top level of the game, the players are viewed here. And if you're not watching this, they're viewed higher than the coaches, which is a little bit weird because if you're in the minor leagues of professional sports, it's flipped. The coaches are up here and the players are up here.\r\n\r\n\r\ndown here. And I say that because sometimes the feedback you get from coaches, it's easy to just kind of brush it off. Like, no, no, like I got this, like I'm good. I'm confident I can go out and do it. And I think the biggest difference for me now is, the business that we have, I, we built it with my brother, who I trust innately with everything. And I'm always asking him for feedback. And I would say the one thing that I've improved upon the most in the last four years.\r\n\r\n\r\nhas become incredibly self-aware of who I am as a person, what I'm good at, what I am terrible at, what I need to get better at. So to answer your question, I sucked at it. I crave it now. In fact, like I just ask everybody, I'm like, hey, any feedback for me on that? people are almost caught off guard. I'm like, no, you can say like the thing that I can tell you you're thinking the thing, just go ahead and say it. Like that's what I'm asking for.\r\n\r\n\r\nNikolas Hulewsky (17:19.918)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (17:27.864)\r\nHow did you change that? that's gotta be a weird balance. I know it's been a weird balance for me, but as an athlete, it's like, I gotta be confident enough where I'm not in my head with the yips, right? But also you've gotta be flexible enough to take feedback. What have you done differently post baseball?\r\n\r\n\r\nJacob Turner (17:44.592)\r\nI think as an athlete, you want to portray a certain image that you have it all figured out and you want to do that in the clubhouse. You want to do that with the coaches. So asking for feedback to me was like, like a little bit of like a sign of weakness. Like, this guy not confident in his own abilities versus now? I mean, I would tell anybody I'd tell our biggest client like, no, I don't have this thing all figured out. I'm working really hard to make it as good as possible. And my goal is like, hopefully Lord willing, I can do that for the next couple of decades and imagine how good I'm going to be then. But no, I don't have it all figured out.\r\n\r\n\r\nNikolas Hulewsky (17:57.134)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (18:13.038)\r\nHow did you realize it was important? Did your brother say to you one day, like, dude, Jacob, you don't have to act like you know everything? Or did you just realize, go ahead.\r\n\r\n\r\nJacob Turner (18:19.196)\r\nWell, when we started the business, I didn't know what I was doing. you know, it's like we, you know, in a roundabout way kind of got pushed into like, I guess we're going to, a company that I was going to work for wouldn't hire me. So I'm like, well, if they're not going to hire me, I'm not going to say where I'm currently at. I definitely, definitely can't say that on the podcast. Yeah.\r\n\r\n\r\nNikolas Hulewsky (18:39.49)\r\nWho was it? Who was it?\r\n\r\n\r\nYeah, screw you, Hertz. I don't know who they are. But yeah, OK.\r\n\r\n\r\nJacob Turner (18:46.148)\r\nYeah, enterprise, right? I was going to work enterprise sales. Seriously though, enterprise sales people, kudos to them. They always gave me to fill out the extra tank of gas and the whole deal. Look, I didn't have it all figured out and I wanted the feedback and I've just realized that the quicker and the faster that I can ask for feedback, the better off I'm going to be.\r\n\r\n\r\nNikolas Hulewsky (18:54.689)\r\nI know, they get it.\r\n\r\n\r\nNikolas Hulewsky (19:06.19)\r\nUm, so when you were, you're 30, 29, you said you retired. Um, and so you, made some money, you had your $7 million signing bonus. I'm going to guess probably made close to double or close to that in the majors as well. So you're in the $15 million range. Um, many athletes when they come out. We'll buy businesses or they'll buy franchises or they'll buy real estate. Um, the ones I'm looking at shack, right? Like shack has.\r\n\r\n\r\ntons of different businesses that he's invested in. But those guys have, you know, upper eight figures, they're hundreds of millions of dollars. And so there's, I'm not going to say it's disposable, but it's, it's a little bit less personal. I'm not saying $15 million career earnings isn't a lot of money because it is a lot of money, but it, it's also not a lot of money in the grand scheme of things. It's not like you can place like 17 different bets and, oh yeah, I'll just invest in some franchises and hope it works out. How did you decide on this route?\r\n\r\n\r\nWas this something you iterated to or were you jumping into it right away?\r\n\r\n\r\nJacob Turner (20:08.348)\r\nWell, I think it won, it was something that I've always had an interest in. Like I've loved understanding money. My mom has an accounting background. So I would say I somewhat understood that. And I mentioned my dad passing away in 2016. He was a dentist, owned a dental practice. I watched him sell that dental practice and the outcome was not great. They didn't have like financial people really helping them. My mom and dad just kind of did it on their own. So I've always had an interest in it. And then\r\n\r\n\r\nAs an 18 year old, when I signed for all this money, I obviously hired some financial people. I was probably like the worst client because I was always the guy coming in, asking all these questions. But the way I looked at it, was like, Hey, the fee that I'm paying you, like part of that's just like an investment in my education. I want to understand what's going on. So I think it was a natural inclination toward to head towards this. I didn't love financial advisor. So was like, I don't want to do the whole financial advisor thing. The other thing that I was thinking about, mentioned the money side of it was.\r\n\r\n\r\nWhat can I do that is somewhat of a low risk, low leverage option that if it doesn't work, yeah, I put my time and energy and effort into it and hopefully I learned a bunch of skills, but it didn't take away from the snowball that I had built from a financial standpoint with baseball. And I think if anybody out there's listening and they're like, I want to do this entrepreneurship thing, but it just sounds so scary because all these guys are like, I'm betting on myself. I'm going all in. You don't have to go truly all in. Like, yeah, you.\r\n\r\n\r\nI don't think you can build a business and be working another job, but I do think you can build a, there's low leverage opportunities out there, both from a financial standpoint that you can do to dip your toe in the water. And if it doesn't work, yes, you spent your time doing something you made no money on, but I guarantee you probably learned a lot more skills. And if that person came back to me then and was like, Hey, Jacob, this is what I was doing. I try to start the business that you guys have today. It didn't work out, but like, I really want to work in your business.\r\n\r\n\r\nNikolas Hulewsky (21:48.496)\r\nI totally agree.\r\n\r\n\r\nJacob Turner (22:01.05)\r\nI'm gonna hire that person all day over the person that didn't do that.\r\n\r\n\r\nNikolas Hulewsky (22:03.286)\r\nYeah. Well, I talk to people all the time and they're like, I want to buy a business. I'm like, cool. What's your experience? Well, I was a manager at whatever name your firm. So I've managed people and I've had some P and L responsibilities and I always tell them to go get more experience. And they're like, well, so-and-so did it. So-and-so bought it they were successful. I'm like, yeah, okay. If I go to Vegas and I play a game and there's a 5 % chance of me winning and I win.\r\n\r\n\r\nDoes that mean everybody's going to have the same chance of winning as I did? No. I happen to get lucky. Luck is not a strategy. Go and play blackjack where at least your odds are closer to 50%. Don't go and play roulette. Put it all in black. So for me, it's a risk management equation as well. like, what do I know? Where can I put my money down? I'm not going to put all my capital into this. There have been a few times where I'm like, I need to take a big swing. And in those moments, you better have high conviction to take a big swing. But I totally freaking agree with you.\r\n\r\n\r\nThere's a ton of opportunity to take low risk asymmetric bets that have really high upside and that people just don't, I don't know, maybe they just don't think they're as sexy as they could be.\r\n\r\n\r\nJacob Turner (23:13.436)\r\nI don't know. think it's an ego thing. you everybody on, you ask anybody about their business and everybody's like, I want the business. That's at the other end of the line. Right. You're talking to another business owner and you're like, man, that business model sounds incredible. Like look at how they build and look at what they do. And like, they have no customer concentration and like, there's less people to manage. So like, we should do that. And I think every business sounds great, but the question I'd ask you, we were talking about this a little bit before we started recording was I think the situation that\r\n\r\n\r\nNikolas Hulewsky (23:15.214)\r\nYou think so?\r\n\r\n\r\nNikolas Hulewsky (23:26.712)\r\nYeah.\r\n\r\n\r\nJacob Turner (23:42.68)\r\nI was in from a financial standpoint, it's a situation that a lot of entrepreneurs are in at some stage, right? They've had success, they've exited a business, they've sold a business, whatever it may be. And they're trying to figure out what the next thing is. Cause one thing I've learned about both athletes and entrepreneurs is like, sit on the couch money is only in theory, but like actually sitting on the couch and doing nothing sounds not like my cup of tea. So how have you thought about it? You've had some success in business.\r\n\r\n\r\nNikolas Hulewsky (24:03.992)\r\nTerrible.\r\n\r\n\r\nJacob Turner (24:10.31)\r\nThought about doing something next. Like how have you thought about, do I take a big swing from a financial perspective or do I do it a different way because I have the experience? So maybe I could raise the capital and not have personal guarantee.\r\n\r\n\r\nNikolas Hulewsky (24:20.686)\r\nDude, that's a great question. I'm thinking it's been similar to what you did. I don't know for a fact, but after I sold those companies, I kind of just took a year break. I like, I just don't want to do anything hard because you spend so much time and energy growing the thing that you're focusing on. And then by the time you sell, it's like, yeah, I don't want to do anything ever again.\r\n\r\n\r\nYou've shut everything else out. You're not focused on anything. I'm not trying to grow on Twitter. I'm not trying to network. I'm not trying to do anything else. I'm just trying to grow this freaking business to where I know it can be. And then at some point it gives me optionality. I can sell it or can cash flow, whatever. So I'm assuming as a professional athlete it was kind of similar. It's just like every day you're in the zone. So I knew I wanted to at least take a break. I didn't, maybe similar to you, well, you might've had more money. I didn't make enough money to like go live on an island for the rest of my life.\r\n\r\n\r\nin the lifestyle that I would have wanted to live on an island for the rest of my life. And so I knew at some point I'd take another swing, but I thought I can take my time and just be measured with this. So I did what I like to do, which is just learn. And I got on to social media and I was like, this is fun. I can just ask anybody a question. And then all of sudden I was like, I could like start a podcast and people will come on just cause they want to talk about themselves. Like, wonderful. And I can just ask them every question that I want to ask. So I've been in honestly just learning mode.\r\n\r\n\r\nJacob Turner (25:41.211)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (25:45.976)\r\nfor the last two years. And it's only been recently that I've like noticed the itch. It's only fun to like be in theory for so long as somebody who's wired like that. At some point, you just, you gotta make a decision and go. And so for me, kid in a candy shop, I've tried every candy that I could possibly think of. And now, now I've sort of funneled it down to, I'm gonna take an ex-big swing. I think it's gonna be healthcare focused, cause that's my background.\r\n\r\n\r\nAt first I thought I was gonna go away from healthcare, but now I'm like, I know healthcare so well, why would I go try to play a different game? It'd be like you being a professional baseball player, you're 26, you're an all-star, and then you're like, okay, I've done this baseball thing, I'm gonna go try basketball now. It's like, No, do the thing that you know that you're better than anybody else at. So staying in healthcare, and I think it's going some type of AI component to it because I just think.\r\n\r\n\r\nIt's ripe for disruption on the healthcare side. So I don't know yet what it's going to be, but I know it's going to be those things. And I wouldn't kind of come to that conclusion unless I had had actual time to dig around on YouTube and like learn what AI is and much to my wife's chagrin.\r\n\r\n\r\nJacob Turner (26:53.466)\r\nYeah. All right. here's a follow up question. And obviously this is hypothetical for anybody listening. If you had a million dollars of total net worth, you worked really hard in your businesses, you sold your businesses after several years, you got a million dollars in your bank account. How much of the million dollars are you going to allocate towards a new venture?\r\n\r\n\r\nNikolas Hulewsky (27:15.374)\r\nman, that's such a good question. I've been thinking about this. It depends on my level of conviction in the new venture. For example, if I were to go back into home health and hospice, which I know exceptionally well, I would be a lot more willing to risk more of that capital than I would be if I wasn't going into home health and hospice, if that makes sense. But from an actual math perspective,\r\n\r\n\r\nWhat I would do is I would say, I've got a million dollars. I want to retire inflation adjusted, whatever you want to call it with $3.5 million. So find your number. And there's like tons of calculators online. My number is 5 million. And I would put an amount into some type of a managed account that would return, let's call it 7%, 8 % the market.\r\n\r\n\r\nand turn that amount of money into whatever my ending amount would be. And the reason I would have it managed, I didn't want to have it managed for a long time, or I didn't think I wanted it. And then after I sold it, was like, I actually like having it managed because it, it forces me to go to somebody and that can't make just like a knee jerk reaction of like, yeah, I'm to buy that card wash. I'm going to buy this business. I actually like have to move money around and my wife has to sign off on it. And so it was like these checks and balances in place. So to answer your question.\r\n\r\n\r\nat a million dollars net worth, would probably put, guesstimate here, $750,000 just away. And I would say, I've got $250,000 to figure out what I'm gonna do next. And that $250,000 could be money I live off of and then invest in the next thing, or I go get a job and then I use the 250,000 as a down payment for the next thing. But that's how I would think about it. I don't know if that makes sense.\r\n\r\n\r\nJacob Turner (29:06.032)\r\nNow that makes sense. You're starting with the end in mind, which is what I always tell everybody. I think a lot of people start with the beginning in mind at the, when they first think about entrepreneurship, my take is like from when we met on Twitter or X when I see people on X, everybody wants to buy a business, which is great. Like if somebody asked me, Jacob, if I have no money, what's the two best ways to build wealth in America? It's either buy real estate with leverage or buy business with leverage. But I think that equation should change if you have money or you have responsibilities.\r\n\r\n\r\nNikolas Hulewsky (29:08.93)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (29:28.716)\r\nMm. Right.\r\n\r\n\r\nJacob Turner (29:36.448)\r\nyou have a family, whatever it may be. And I think you should start with the end in mind, not the beginning in mind, because a lot of people start at the beginning and they're like, I just want this cool company. I want to be able to tell people on Twitter that like I'm doing it and I built this really cool company and I'm an entrepreneur. instead of just saying like, what do I want my life to look like and backtracking and saying, okay, my wife, if I want my wife, my life to look like that, how much money do I need over here? And then how much money could I risk? I think you make an interesting point too, that risking the money doesn't have to be like.\r\n\r\n\r\nputting it into the company, it could be like, Hey, that 250 that I set aside, like that's the money I'm going to live on for the next three years while I build this thing. And if I can't make it happen in three years, I'm going go figure out something else. But again, starting with the end in mind.\r\n\r\n\r\nNikolas Hulewsky (30:17.474)\r\nYeah. What would you do? Okay, a million dollars. would you do?\r\n\r\n\r\nJacob Turner (30:22.652)\r\nMillion dollars, I'd probably do 20 % because I'm anchored to that in my mind. 20 % of the million, so 200 grand. So I would invest 800 grand in boring index like investments probably. And then I'd take the other 20 % and put it towards that. And the reason why I'm somewhat anchored to that is that's kind of how I invest my money today. Like 80 % just in boring stuff that I know is going to be there. And 20 % is in...\r\n\r\n\r\nNikolas Hulewsky (30:27.374)\r\n20 % that you would risk or 20 % you would put away?\r\n\r\n\r\nJacob Turner (30:51.868)\r\nstuff that I think could have a bigger economic outcome. But I know that if I lose the stuff that's in the 20%, it's like, I'm still good with what's in the 80%. So that's the way I've thought about it.\r\n\r\n\r\nNikolas Hulewsky (31:02.286)\r\nThe crazy thing is, and some people might listen to this and write me hate mail, and I'm sorry, a million dollars is not that much money. I know that sounds like a douche to say, but that's one bad investment away from losing that money.\r\n\r\n\r\nJacob Turner (31:19.292)\r\nWell, and even outside of the investments, not to pump my own YouTube here, I don't have that many subscribers. So if you want to go to YouTube, you can check out my YouTube. I'm actually doing the Jacob Turner. So I'm going to do a YouTube video on this exact concept that, especially for business owners, because it's like the sticker shock of you sell a business for $5 million after taxes, you get $3 million to call it. You probably get a little more than that. We'll call it three and a half million.\r\n\r\n\r\nNikolas Hulewsky (31:26.241)\r\nYou\r\n\r\n\r\nWhat's it called? Jacob, Jacob Turner, the Jacob Turner. Okay.\r\n\r\n\r\nNikolas Hulewsky (31:40.984)\r\nMm-hmm.\r\n\r\n\r\nJacob Turner (31:49.18)\r\nYou're 30 something years old, you're 40 something years old, and you're like, Jacob, I made it. How much can I spend? And the reality is like, what do you can spend off that portfolio is a lot less than what you think. Um, cause I see a lot with these athletes we work with, they'll come into a lot of money. They'll sign a big contract and in their mind or in their parents' minds, sometimes they're like, well, if the market returns 8 % and I have a million dollars, that means I could spend $80,000 a year. It's like, no, doesn't, the math doesn't work like that. There's like this thing called inflation. There's, you know,\r\n\r\n\r\nNikolas Hulewsky (32:15.158)\r\nAy, ay,\r\n\r\n\r\nJacob Turner (32:18.076)\r\nAll sorts of other factors that go into that. But I think that's like the sticker shock to your point. A million dollars is a lot of money in a silo. But if that's like all the money you have and that's what you're living on, most people are completely shocked that like, you mean I could only spend 30, 35, 40 grand off that?\r\n\r\n\r\nNikolas Hulewsky (32:37.486)\r\nI saying to my wife, I was like, the way I'm thinking about this is our retirement's taken care of. Right? It's like, I know that when we retire, we're going to have a nice life, but there's going to be something else that I want to do in the in-between time. And so like that almost anchored it as we're not pulling on this. Like we're not having lifestyle creep just because we have this money. And frankly, she's better at this than I am, but I do have friends of mine.\r\n\r\n\r\nJacob Turner (32:59.845)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (33:06.264)\r\nwho, you know, they knew I sold the company and you know how friends are. They're always like, how much money did you make? Come on, you gotta tell me, bro. And then, and they'll be like, I don't get you. If I had sold my company, I'd be freaking driving this car and I'd be having like this watch and I'd be traveling to these places. And I'm like, that freaks me out, man. Cause I don't want to blow that. the lifestyle creep is real. You would be done with your money in like three years.\r\n\r\n\r\nJacob Turner (33:32.028)\r\nYeah. No, I mean, when I first signed, I just didn't want to be on 30 for 30 broke. I was more worried about losing it than making anything. I'll share this story. When I first started investing money, so I get this check. We talked about $1.2 million 30 days after I signed. I got drafted in 2009. So I'm the world's best market timer. So I put, I don't know, we'll call it $600,000, a million dollars in the market, something like that.\r\n\r\n\r\nNikolas Hulewsky (33:39.214)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (33:58.374)\r\nInto what?\r\n\r\n\r\nJacob Turner (33:59.74)\r\nJust broad-based mutual funds.\r\n\r\n\r\nNikolas Hulewsky (34:01.834)\r\nOkay, so you weren't picking individual stocks. Okay. Still, timing fantastic.\r\n\r\n\r\nJacob Turner (34:03.852)\r\nNo, no, this was like, yeah, I had somebody, yeah, advisor helping me do it. like broad-based mutual funds. And I remember the first week or two, the market was down like 5%, but on like a million bucks was like $50,000. And I opened my account, I'm like, I'm down $50,000. I'll never forget calling the advisor and being like, so what should we do? Like we obviously, we need to do something because I'm down $50,000. And he kind of laughed and he's like, no, no, this is like all part of it. But it's all learning experience, man.\r\n\r\n\r\nNikolas Hulewsky (34:23.382)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (34:32.312)\r\nDid he give you the age old advice? Time in the market is better than timing the market.\r\n\r\n\r\nJacob Turner (34:37.53)\r\nYeah, I'm sure you said some cliche like that.\r\n\r\n\r\nNikolas Hulewsky (34:40.59)\r\nBut you're 22, you're like, I don't care. It's 50 grand, bro. That's my advisory fee to you.\r\n\r\n\r\nJacob Turner (34:44.644)\r\nYeah, yeah. No, I was 18. I'm 18. I'm like, I don't care what like your board says or like that chart behind your wall that shows the market going up into the right. like, my money's not going up into the right.\r\n\r\n\r\nNikolas Hulewsky (34:56.734)\r\ndude, can I ask for your clients, how much of what you do for them is psychological and how much of what you do for them is like actual wealth advisement?\r\n\r\n\r\nJacob Turner (35:09.626)\r\nWe are in the business of helping people live a better life. And when I say that, a lot of times living a better life has nothing to do with the next tax planning strategy, but it has to do with peace of mind. So how can we do things to give people peace of mind around their money is what my guiding light is with everything that we do. So to answer your question, there's a lot of psychological part of everything that we do. But again,\r\n\r\n\r\nMy goal with like what we do is like to be a champion alongside people that are doing incredible things and like help them maximize all the work that they put in, all the resources they put in. And that usually doesn't entail them living that much better a life, whether they did QSBS at the beginning of their business or not. Now it's really cool. If we can do it, I'm going to tell them to do it. But it's probably more fun to talk about on Twitter than it is to actually live that in real life.\r\n\r\n\r\nNikolas Hulewsky (35:56.226)\r\nYeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (36:03.24)\r\nCan you really quickly just describe how do you view the difference between a wealth manager and a financial advisor?\r\n\r\n\r\nJacob Turner (36:15.964)\r\nI think my business, financial services, is a very marketing driven business. So a wealth manager, a financial advisor, a financial planner, a family office, a multifamily office, an insurance agent. I think people in my business can kind of call themselves whatever they want. And they all do something different, which is the challenge. It's kind of like if you're an entrepreneur who's out there listening and you went to an agency and you said, I'm going to hire this agency.\r\n\r\n\r\nNikolas Hulewsky (36:36.75)\r\nMm.\r\n\r\n\r\nJacob Turner (36:44.7)\r\nAnd I asked, oh, cool. What does that agency do? They're like, oh, well, they do a little bit of everything. Like they could do, uh, they could do my Google ads and then they're also going to redo my website and they're going to help me do some social media posts. And I think they have a video editing guy too. So I'm excited about that. Or you go to another agency. It's like, Hey, the only thing that I do is Google ads. So I say all that because my industry is notorious for like financial advisor, financial planner, wealth manager. It's like the broadest term in the world.\r\n\r\n\r\nSo always asking them like, what are you actually doing for clients? And to me, think that's, we could talk for the next hour about that, which we don't need to.\r\n\r\n\r\nNikolas Hulewsky (37:20.142)\r\nOkay. Well, I will say after I sold the businesses, I wasn't sure I was going to get a wealth manager. I think of like wealth management is different than financial advisor. I always felt like financial advisors were like, well, this is the insurance plan you got to get. like, it felt like they're always trying to sell me something. Whereas at least the way I think of it, the wealth advisor is more of an advisor. They're both getting paid by you. You know, don't, don't mistake it. But for me, that's how I felt better about it. But the guy I'm with now, Jeff Bullock, shout out Jeff.\r\n\r\n\r\nis fantastic. And I remember asking him, I'm like, dude, how much should I have in cash? Cause I don't know. Is it like a percentage? Is there a ratio? You know, I'm getting all worked up and he's like, whatever helps you sleep at night. And he's just totally stuck with me because it's like, yeah, yeah, that's true. Like whatever helps me feel comfortable. Like this is my money. It's not like there's some rule I have to follow of exactly this is how the allocation can be. And that was the first time it sort of shifted my mind. Or it was like, yeah, his role is really psychological. It's like just helping you work through\r\n\r\n\r\nWell, don't sell. know, I know. It seems scary right now. Don't sell. You lost $50,000. I get it, but that's just part of the plan. how much did you have in cash? I don't know. Whatever helps you sleep at night. And it's been helpful for me to kind of reframe how I view my relationship with him.\r\n\r\n\r\nJacob Turner (38:36.24)\r\nYeah. The thing I, here's my cliche that I always tell clients is there's no perfect portfolio for anybody. The only perfect portfolio is the one that you're able to stick with. And if the only portfolio that you could stick with would be a hundred percent of your money in some sort of money market position, and that's the only thing you can stick with through the ups and downs, then that's a perfect portfolio for you. And now, you know, our role is to help you obviously take a little bit more advantage of the opportunities than just putting money in a money market position. But to your point, like,\r\n\r\n\r\nIt really depends. And that's why I'm fascinated by AI. Actually, I think that's how we somewhat got connected. I saw a post you made out AI, which I thought was fascinating. And I spent probably way too much time trying to just understand AI and like where the ball's moving. And I've thought about it a lot, even in our business. And I'm like, I think you'd be silly to put your head in the sand and say, it's not going to change things dramatically. But then on the flip side, I think for the longest time,\r\n\r\n\r\nThe answers are somewhat easy to find when it comes to financial planning. Like you can go to Chad's GBT and type in whatever you want and you can get the answer. Now executing on that answer and how you connect it back to your personal life, probably a little bit different equation, but to your point, I think that's more of a psychological thing than a tactical shift.\r\n\r\n\r\nNikolas Hulewsky (39:47.438)\r\nI'm gonna ask you for specific advice for entrepreneurs because you know entrepreneur money is different than W2 money But before I do that, where is the best place for people to come find you? What's your your company website?\r\n\r\n\r\nJacob Turner (39:59.256)\r\nmomentprivatewealth.com or you can find me on Twitter, Instagram, YouTube.\r\n\r\n\r\nNikolas Hulewsky (40:01.067)\r\nMoment. Okay, momentprivatewealth.com. So entrepreneurs, it's different. Like W2 money is steady, but it's capped. Whereas entrepreneur money is a freaking roller coaster, but it's uncapped. And so some years you might make a million dollars and some years you might make $0 and actually have to pay in taxes, even though you didn't actually take any money home. And that's a whole thing in and of itself. What advice do you have for entrepreneurs?\r\n\r\n\r\nwho are like, they finally got into the place where their business is not only cash flowing enough to support their lifestyle of say, $100, $150,000 a year, but now they've got like excess cash. How do you think about that when you're as an entrepreneur encountering it out for the first time?\r\n\r\n\r\nJacob Turner (40:43.014)\r\nSo three things I would say. One, if you're ever going to hire somebody to give you professional help with your money and you're an entrepreneur, you should find somebody that thinks like an entrepreneur. And the reason why I say that is a lot of financial advisors, one of the biggest struggles is like they think like what the textbook told them. But when it comes to an entrepreneur, a lot of times you can't use the textbook. Secondarily, keeping a lot of cash is a really good thing. I have a couple of clients that this year, our goal is just to continue to build cash. Now, could we invest that money in the market?\r\n\r\n\r\nCould I get paid more if we invested in the market? Probably. But like, we should just keep the cash because like, I don't know where your business is going to go. And we go back to the fact of like, I want you to sleep really well at night. And that's the right play. And I think the lastly, the thing that I would consider and the thing that I always think about, it kind of goes back to the conversation we had earlier about the hypothetical million dollars. If you had two options, option one was you grew your business from a million dollar enterprise business to $50 million.\r\n\r\n\r\nOr you grew your business from a million dollar enterprise business to $30 million. But on that side, you also had another $10 million that you've saved over here. So you had $10 million of liquid assets you saved, you had a $30 million enterprise business, or you're all in with a $50 million enterprise business. So net worth difference, you actually are $10 million higher over here. But which one of those scenarios is better? And there's not a right or wrong answer. Like somebody could say, I want the 50 million. Some guy could say, I want the 30 million.\r\n\r\n\r\nWhat I would tell you is having the flexibility to have money outside of your business is an incredible unlock for your business. Because it allows you to do whatever you want. If you're burnout and you want to sell, sell. You don't have to wait for the perfect time. If you want to invest back in your business with all the profit for the entire year, great. Do it like you got money set aside over here. If you want to just scale back and you're like, you know, I just want to take the business down a little bit. Like I don't, I'm okay making a little bit less money. You can do that because you have money set aside over here. And I think that's one of the biggest traps. think.\r\n\r\n\r\nNikolas Hulewsky (42:15.79)\r\nMm-hmm.\r\n\r\n\r\nJacob Turner (42:37.702)\r\nThere's an ego play sometimes that entrepreneurs fall into. It's this trap of like, I'm around other people that are building businesses in my quote unquote soft. If I'm like taking chips off the table, I'm not investing it all back into my business. So that's what I got for you.\r\n\r\n\r\nNikolas Hulewsky (42:53.166)\r\nWhen you say cash, do you mean cash or treasuries?\r\n\r\n\r\nJacob Turner (42:57.67)\r\nI mean, cash like equivalents, never truly cash. I like to earn some interest, Yeah. I want something that is within three months, I have no concern that it's going to drop more than at most a hundred basis points or 1%, right? Like very flexible. I could access it anytime.\r\n\r\n\r\nNikolas Hulewsky (43:03.416)\r\nOkay, no, no, no, that, people always say cash.\r\n\r\n\r\nNikolas Hulewsky (43:19.446)\r\nI love treasuries. I that was the biggest thing when I got Jeff on board. was just like, I don't know how to do treasuries. I can go and buy and sell stock on my Merrill Lynch brokerage account. But the treasury piece I haven't figured out, he's like, oh, I could totally handle that. Yeah, we'll roll treasuries. dude, peace of mind. Because before that, I just had money sitting in cash. In fact, this is a funny story. We sold a business. We had $750,000 in an escrow account for a couple of years because\r\n\r\n\r\nof a number of things, whatever. But the escrow account was just sitting there. It was an interest bearing. And it killed me. after I knew about this stuff, I'm looking back, and I'm like, oh my gosh, dude, we could have at least have been earning 3 to 4 % on that money, and now just sitting there in an escrow account. When do you think, as an entrepreneur, you should get somebody in your corner? Is it once you've got some cash flow, or is it before you're getting cash flow? Because there are a lot of people right now who are like, oh, I'm just barely\r\n\r\n\r\npaying myself for my lifestyle. But, and to you who feel that way, I promise someday it will happen. If you keep grinding, someday it will happen. You will have better cashflow. How do you think about getting involved with somebody just to even give you outside perspective and when that happens?\r\n\r\n\r\nJacob Turner (44:36.794)\r\nI think everybody should have somebody that's giving them an outside perspective, whether that's like truly quote unquote professional help, or that somebody that's in your corner. know, Nick, if you were my mentor and you had built a business, I should just at bare minimum be going to you and saying, Hey, here's what I'm thinking. Like what I'm doing, my personal stuff. Is that crazy? And you might not know everything, but you could at least tell them like, Hey, that is crazy. Do not do that. but I think one thing that every entrepreneur needs to consider is how much of it do they want to delegate?\r\n\r\n\r\nBecause what I would tell you is like, some people, like they want to delegate some of their financial life. They want to delegate all their financial life. Some people don't want to delegate any of it. And you have to determine if that's you, which end of the spectrum you fall on. because again, the goal of money is to live the best life that you can possibly live. And if you don't want to delegate any of it and you hire somebody with professional help, that's not going to help you live a better life. You're just going to be frustrated because you want full control of every single thing, every single aspect that you're doing. The other.\r\n\r\n\r\npoint that you make Nick is like, when does somebody, when should somebody do this on the spectrum? And I think one of the cool things I think that's happening in like the financial planning space in general is entrepreneurs are getting served better earlier on. It used to be like, unless you have an exit, we don't serve you. And when I think about our clients, 80 % of the clients that we serve are in the business building stage, right? Like there's not $10 million sitting over here that they're investing.\r\n\r\n\r\nThey're in the business building stage, but they're doing it in a way where they're saying, okay, I'm starting to make some serious cashflow. Like how do I make sure that I can take advantage of this now? So I don't have to have the optimal exit at the optimal time for the perfect price.\r\n\r\n\r\nNikolas Hulewsky (46:17.838)\r\nDude, I used to be, I'm still this way sometimes, but okay, how can I max out my 401k? Okay, it's 18,500. Oh, but there's actually this loophole because if I can get the company to match in contributions, I can get up to this. Oh, and if I employ my wife, actually, that would allow us to get to like $70,000 a year. Oh, I'm not even thinking about the Roth. Of course, we got to get the Roth in, but I got to keep my wages down enough. like that was me, right? Like just thinking of all the ways to maximize it.\r\n\r\n\r\nJacob Turner (46:44.188)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (46:45.538)\r\nAnd I've just found emotionally over the last few years as I'm not doing that, as I have somebody who I'm going to for advice, dude, I just have way less stress. And maybe I'm not making as much money as I could by taking advantage of all those little loopholes, but there is something to be said of like, like you're saying, there's a point where you're just doing it all and that's okay. But there also comes a point where your skillset, your business has now outpaced your skillset and you don't know how to handle.\r\n\r\n\r\nJacob Turner (47:04.39)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (47:12.854)\r\nall this excess cash. So go talk to somebody, bring somebody in that can be a good advisor. I love that advice.\r\n\r\n\r\nJacob Turner (47:18.236)\r\nWell, I think too, like to your point about the cash, I was talking to a business owner of ours a couple of weeks ago and the biggest takeaway from the call was, hey, you have so much money in your operating account as a business that we should really separate out what is truly operating cash and what is cash that we can start earning some sort of yield on. Cause you you started building up cash in your business and you're like, I think I might want it for something in the future. So I'm just going to keep it in there. Totally fine. But if you could earn 4 % on every million dollars and you're not doing that.\r\n\r\n\r\nNikolas Hulewsky (47:37.272)\r\nHmm.\r\n\r\n\r\nJacob Turner (47:48.304)\r\nI mean, you're leaving huge money on the table. So, and I think this is stuff where it's like, as you're building the business, typically like you're just not thinking about it. You're like, that's not important to me. I'm worried about like where we're to get the next sale. Who's next hire going to be, how that person's going to integrate with the company. So again, whether you, whether it's professional help or not, like just have somebody in your corner that you can be like, am I being an idiot with this or am I relatively tracking in the right direction? Doesn't have to be perfect.\r\n\r\n\r\nNikolas Hulewsky (47:48.334)\r\nAll right. Yeah.\r\n\r\n\r\nNikolas Hulewsky (48:12.748)\r\nYeah, man, I would. I wish I would have had that. I were years where we had a million dollars, over a million dollars in cash just sitting in our accounts. They weren't making any money. It made me feel better to have that cash, right? Because I was like, OK, cool. Even if this happens, we'll be OK. And it wasn't a capital intensive business. I didn't need that much working capital. And I look back on it now and I'm like, dude, you could have so easily just parked that money into any of these interest bearing accounts and it would still be fairly liquid. It's not like it's going to be\r\n\r\n\r\nYou know six months before you can but while you're locked up to get it itself anyways Dude, this was awesome. Thank you. I I didn't even get to the stuff that I wanted to talk to you about but we'll have to do that another time\r\n\r\n\r\nJacob Turner (48:53.24)\r\nI appreciate having me on, Nick.\r\n\r\n\r\nNikolas Hulewsky (48:54.954)\r\nOK, we'll talk soon.",
  "metadata": {
    "duration": "",
    "date": "2025-05-19",
    "platform_source": "Google Drive"
  }
}