{
  "episode_number": "20",
  "episode_title": "A Boring Business with 82% Gross Margins: Green Box Storage with Collin Rutherford",
  "guest_name": "Collin Rutherford",
  "business_name": "Green Box Storage",
  "transcript": "﻿Hello there. Welcome back to Nikonomics, the podcast where we dive into the economics of small businesses. And on today's podcast, I'm going to describe who we had on. Let's see if you can guess who they are. Former D1 athlete. Okay. Went to an Ivy league school.  Started a moving company in college.\r\n\r\n\r\nStarting to get an idea of who this might be. Posts very spicy takes on Twitter.  It is not Nick Huber. It is Colin Rutherford. You may have seen him With his bottle night post, you may have seen him with his prenup post with his girlfriend. He's definitely got some polarizing takes, but he is the founder and CEO of green box storage, which is a college storage company.\r\n\r\n\r\nAnd we had an awesome conversation. Colin was not what I expected, but he's very thoughtful. He's very measured. He has a good head on his shoulders and he goes through the economics of what his business looks like, how they acquire a customer, what their CAC is, what their LTV is, what their margins are, how they plan to grow, how many locations they have.\r\n\r\n\r\nAnd at the end, he gives some advice that was honestly surprising to me that I think you're going to want to stick around for. If you're an entrepreneur who's just trying to figure out how to get started. If you like the show, please like and subscribe. But with that, let's just hop into the show. All right.\r\n\r\n\r\nWelcome Colin Rutherford. To Nickonomics. I have to start with a very simple and basic question. What is bottle night?  I should have known that this would be your first question.  Yeah. Yeah. Bottle night. That was a crazy ride. That was a viral tweets, 62 million impressions on Twitter, which is crazy, but yeah.\r\n\r\n\r\nWhat is bottle night? I can go into it if you want. I have to ask, tell us what you posted.  Yeah. So I just posted about something my girlfriend and I like to do. We just like to put our phones away and just each drink a bottle of wine right out of the bottle and just talk to each other because that, um,  good time spent together is just like, you get distracted with your phones a lot.\r\n\r\n\r\nSo we just put our phones away and just give each other 100 percent attention. All right. So you posted this and then it got 70 million impressions. Transcribed Just on Twitter. It was on Instagram and Reddit and every other site that you can imagine. Did you know it was going to do that? Like where you strike me as someone who's trying to copy Huber a little bit, right?\r\n\r\n\r\nLike you post some stuff that is just, it's going to get engagement, right? Just because it's controversial. Did you post that knowing it would be controversial or was it a surprise to you?  It was a surprise. It was a surprise. I definitely had a intentionally at a hard hitting hook. Have you heard about this?\r\n\r\n\r\nProbably not because I invented it. That was intentional. But what's funny is that this is the actually the second time that I posted about bottle night. The first time I posted it, it got about 1200 impressions. The second time I posted it over 60 million impressions. So it's crazy. I just changed the wording a little bit and it went.\r\n\r\n\r\nUltra viral. Okay. My wife does not like social media. She's not on Twitter. She's on Instagram though, like any millennial woman in her thirties. And one night we're laying in bed. She knew I did this thing called the growth group that Colin was a part of where for the month of March, we competed like March madness style, except we competed to see who could grow the most.\r\n\r\n\r\nAnd Colin was, I mean, you're like top 10 and out of 150 people who competed  anyways, she knew I was doing that. And I was just like, I wonder if she's ever heard a bottled night. So I was like, Hey, sweetie,  you ever heard a bottle night?  And she's like, what do you talk? Uh, yeah, yeah. Actually, is that like young couple who thought they invented drinking wine and talking to each other? \r\n\r\n\r\nAnd I was like, I was like, he was in my growth group. He was in my growth group. Jess, I know him. It's like, you know, Will Ferrell and Elf when you see Santa, I know him  so funny.  Everyone thinks I invented hanging out, but no, it was, it was the name that I thought was cool. And I came up with a name. I love it.\r\n\r\n\r\nAnyways, that's not the reason you're here in a nutshell. Like tell me in its simplest terms.  You're a business owner. What does your business do? And how do you make money?  My company is called green box storage. We offer summer storage for college students. It's pretty simple  on top of just storage. We also offer a pickup and delivery service.\r\n\r\n\r\nSo we pick up your items from your dorm at the end of the spring semester. We store your items over the summer. When you come back to the campus next fall, we drop off your belongings wherever you are. Are you just leasing like a big warehouse and then storing their stuff in your leased space or do you own them?\r\n\r\n\r\nWarehouse where things are stored. We don't own any real estate. We lease space for storage over the summer, which is great because we don't really need it year round. So what's your background? Like, how did you even get into that? You're young. So I'm assuming this is kind of a college idea.  Yeah, I'm 26. I came up with the company five years ago in 2019.\r\n\r\n\r\nSo I was a junior at Dartmouth college at the time. And I knew that I had some friends who just. Didn't know what to do with their stuff over the summer. One friend was from Minnesota. He had to drive 45 minutes, the nearest storage unit. And just like there, I knew there was a better way. So yeah, that was green box storage.\r\n\r\n\r\nAnd that's where the idea was born. Tell me where are you from? What's your background?  I am from Buffalo, New York. I'm an ex division one hockey player. So I played division one hockey at Dartmouth college and my senior year was COVID so I was able to get another year of. Eligibility. And I did a grad year at Bentley university.\r\n\r\n\r\nSo I have a master's in finance and a bachelor's in economics. You realize how similar your story is to Nick Huber's.  I understand it's almost a carbon cop. He was a D one athlete. He went to Cornell. He didn't go to Dartmouth, but both Ivy League schools started a moving company in college and you've both embraced the, the troll, uh, role on Twitter to grow.\r\n\r\n\r\nSo it's, it's just, it's kind of cra Was that intentional or was it like you woke up one day and you're like, oh my gosh, I'm similar to this guy. He, uh, I had no idea who, who Nick was when I started Green Box up until maybe just over a year ago. I had no idea who Nick Huber was, and then I discovered him.\r\n\r\n\r\nReached out to him a little bit. We've done a little bit of back and forth. And then I think I started a newsletter and that's something he's big into as well. So yeah, I've used him as inspiration for a lot of things. I don't know how you feel about this, but there's a couple of categories of people that I just love.\r\n\r\n\r\nTo work with as entrepreneurs, like partner with D one athletes, not even D one athletes, just collegiate athletes in general. They don't have to be pros, but  to go to school and graduate and, and be disciplined enough to train, eat right. Not party all the time, be competitive. I think teaches you a lot when you're young in order to be successful.\r\n\r\n\r\nBut I also love Mormon missionaries because they go out, they knock doors for two years. I love people who have served In the armed forces in some capacity, because again, breeding discipline. And I also love people who have gone overseas, even if it's like volunteering for, you know, teach America or some of those organizations because they're teaching America's domestic, but you know, internationally teaching English because they get exposure to what the rest of the world is like and how amazing America is. \r\n\r\n\r\nDo you feel like that's been a competitive advantage for you? Like, is that one of your superpowers? The fact that you have this reservoir of experience to pull on? Yeah,  I think being an athlete is a huge advantage and I post this all the time on social media. I love hiring athletes. I've had a lot of success hiring football guys, hockey guys, ex athletes in general, just because of their willingness to work together on a team and their teamwork, just their diligence as well.\r\n\r\n\r\nI love hiring athletes. I haven't had the opportunity to hire a lot of the other groups that you just described, but I have had the opportunity to hire one. Ex military person, and he was fantastic too. So I totally agree. So tell me about your business right now. It did it start at Dartmouth and then you expanded or have you always been in multiple locations?\r\n\r\n\r\nNo. Yeah. We started at Dartmouth in 2019. So 2020 was our first real year. It was COVID year, which was kind of crazy, but COVID was actually a great thing for my company because so many students were sent home, right? They went, they needed storage, right? So. It was really a very opportunistic time to get into the swing of things and it helped.\r\n\r\n\r\nSo yeah, we started at Dartmouth college and then we slowly grew. So if we fast forward to today, we're at about, I think, 23 schools across the United States. That's amazing, man.  And what does the model look like? Is it similar to a franchise model? Do you own every location? Do people who are say, I went to USC, so I'm like, Hey Colin, I want to start this at USC.\r\n\r\n\r\nDo you partner with me or do you hire me? How do you expand to those other markets so quickly? So it's, we own everything where there's no franchise. So we own everything and we hire college students as interns to launch branches of green box storage at their school.  So we pay them a great wage. We also pay them a commission based on how many items they store.\r\n\r\n\r\nSo that incentivizes them to not only work hard, but also get as many customers as possible. And they make a very good wage and we hire and expand that way. And so this job is designed around a student who's going to school full time. Like they can manage this while they're going to school. It's a spring internship.\r\n\r\n\r\nSo it's not, there's nothing really to do over the summer. Right? So it's spring internship. That's it's a marketing internship basically over the spring. And then they move the items from campus to storage at the end of the spring semester. There's nothing really to do over the summer because items are just sitting in storage.\r\n\r\n\r\nAnd then in the fall, they drop off the items back to the customer. And that's it. Is it a logistics nightmare for you to find, hire, orient, train, coordinate all that crap, or are they doing a lot of that stuff locally? It's pretty much all controlled logistics. Y's by HQ. So it is a lot of logistics. I, like I sent this to you before, we've stored over 12, 000 items for students in the last two years.\r\n\r\n\r\nAnd it's all going on at one time. It's all going on over a one month period in the spring at all different schools based on their move out time. So there are a lot of logistics and planning that goes into it. Tell me about, I'm just super curious now, tell me about COVID cause  I'm assuming you went from like, Oh, I've got this business and my buddy had a problem and I've launched to all of a sudden.\r\n\r\n\r\nEverybody's going home. Classes are canceled. They got to figure out where they're going to store their stuff. You probably didn't even have a big enough leased space to handle the demand that you came in. What was COVID like for you?  Yeah, COVID was crazy. I w it could have been crazier. I actually have heard Nick Huber's story on this.\r\n\r\n\r\nHe was at a bunch of different schools at the time they were calling the schools and they wanted, they got deals with the schools. We were early. It was so early. We were only at Dartmouth and I actually had an early partner and I was like, Hey, like COVID's hitting right now. We need to launch a branch at your school, like tomorrow because we're going to miss it.\r\n\r\n\r\nSo we were great at Dartmouth. And then my buddy who is a currently business partner, he owns a 20 percent of the company. He invested a couple of years ago. He launched a branch at Liberty university and that was our first expansion school. And we just had a lot of orders right away. What did the expansion look like after that, right?\r\n\r\n\r\n2020 you're at Dartmouth and Liberty. What is 2021, 22, 23, what does the progression look like?  If I remember correctly, I think 2021, we were at.  Actually, I'll work backwards. So 2023, we're at 23 schools last year, sorry, 2024, which is this year at 23 schools, 2023 last year, we're at 18, 2022.  We are at six. So we went from six to 18.\r\n\r\n\r\nThat's when I graduated from Bentley and I started doing this full time. We tripled in geographic presence.  So that was 18 down to six, 2022. The year before that we were at just like, I think it was like three. So it was like two, three, six.  1823. So you've only expanded by five schools this year. Only, only 33%. \r\n\r\n\r\nRight, right. But we actually had a greater focus on picking the right schools. We went from six to 18. We're just taking any school. But we learned that not every school is a great opportunity for green box storage. Like a lot of state schools, like Towson university, tons of students, but everyone's local.\r\n\r\n\r\nSo they don't really need storage. So that, that we learned that the hard way. Well, you just articulated is what every entrepreneur has gone through. They launch a business, every entrepreneur, who's started a business, they launch a business. They take every customer that they can get, right. Cause they're just trying to get a business going and they're getting experience.\r\n\r\n\r\nAnd then they start getting picky. Then they're like, I don't want to take this guy. He's a pain in the butt or, Oh man, I really should have made sure I understood what my target demographic was because now I'm locked in for 12 months. Right. So it sounds like you went through a similar process where you grew really fast and cool.\r\n\r\n\r\nYou built a brand, but then you're now you're able to take a step back and think, all right, how can we be strategic with this? Definitely.  100%. What does your team look like now? Like HQ.  So HQ, it actually depends on the season. So we ramp up, we're super busy in the late winter through the spring. And then we actually cut down a little bit.\r\n\r\n\r\nThere's not a lot to do in the summer. Items are just sitting in storage. We're just collecting checks. That's really all that's going on right now. It's the best time of the year. The summer is the best time of the year.  That's awesome. And then fall, we have to do drop offs and then we just get ready for the next year.\r\n\r\n\r\nBasically. So in the busy season last year, so this year we had 12 full time employees and we had 40 college student interns in the slow season. We're down to six full time employees now just maintaining and then getting ready for next year. How many of those full time employees are overseas? How many of those are local? \r\n\r\n\r\nYou know, do you go to an office?  Every single one is overseas. I work fully remotely. Awesome. And you're in Florida. Is that right? I'm actually a snowbird. So I'm currently in my hometown of Buffalo, New York for the summer. And then I'm heading back down to Florida for the cold season. Very cool. Very cool.\r\n\r\n\r\nGive me some idea if you're willing to, what's the size of your business. So walk me through 2020 revenues, 20 to one, and then like through today represent right now.  Sure. Yeah. So I think we did  46, 000 my first year,  and then we did 130, 000. I think there might've been a year in between there. Actually, I get this confused, but so then it was 130, 000 and then 270, 000 last year, we did 518, 000.\r\n\r\n\r\nAnd this year we're on track for. Probably between 800 to a million. It's too early to tell the exact number, but probably. I'll be happy if we hit a million. What do margins look like on a business like this? That's a great question. So gross margins we had last year were 82%. So our gross margins are ridiculously high. \r\n\r\n\r\nOur net margins were 20 percent last year, and that's been going down as we've been growing. So that's a huge point of emphasis for us this year. We'd like to get those back up to hopefully 30 percent this year, but it's too early to tell right now. How do you think of the like unit economics by school?\r\n\r\n\r\nAre you trying to target, all right, we want to have this much revenue per school before we go to a new one or does it not really matter to you? Yeah, we don't really look at, we need to hit this before we go to a new school. We just take as many schools as we can get that have good employees there. And that fits our target for out of state students.\r\n\r\n\r\nThat's a good proxy for demand. Also international students. So we look at some metrics, some demographics like that to make sure that it's a good school for us. And we don't, we want to get as many as possible really. And then we build out the team around what we can recruit. Are you at USC yet?  We're not yet most international students in the country, man.\r\n\r\n\r\nReally? That's, that's gotta be crazy. They have a massive student body. I want to say 40, 000.  I don't know. I'm like, I'm going to quote terrible numbers, but they're one of the largest universities in the country and they have the most international students  in the country. That's definitely going to be a big point of emphasis next year.\r\n\r\n\r\nThat's right. For sure. How do you currently acquire customers? Like how do you get students to know about you? How do you get them to actually book with you? So our, a lot of our marketing has been boots on the ground, sales and marketing. That's what we like to call it. So we hire these college students as interns and we get out.\r\n\r\n\r\nOn the ground and we do guerrilla marketing. So that's setting up a table on campus and do tabling sessions, talking to students that walk by. Are these paid or unpaid internships? Paid. They're paid.  We're going to get back to the show in one minute, but I just wanted to tell you about today's sponsor, which is, uh, me.\r\n\r\n\r\nOh, it's me. I'm sponsoring the show. Yeah. Cause I'm doing this for free. Do me a favor, like, and subscribe right there, right at the bottom. Move your yep. It's right there. Yep. Awesome. Thank you. Are these paid or unpaid internships? Paid. They're paid. So they actually make 15 an hour plus bonuses plus a bonus per item stored.\r\n\r\n\r\nSo they actually, they make thousands of dollars over the spring. That's awesome. So they make good money. Who trains them? Are you the one deploying this training program to help them understand how they sell, how they communicate, how they answer questions? Yeah. I, a couple of years ago, I built a training like.\r\n\r\n\r\nSeries. So it's videos, it's quizzes to train all the employees up on it. Obvi obviously can't do it to every single employee, so we created a system and we're gonna be growing or expanding on that in, in future years. You're for sure gonna sell a course at some point, right? I mean, there's no way that somebody has organized and systematizes you is not gonna freaking Yeah.\r\n\r\n\r\nSlap a course. Definitely do actually have one. It's called a startup toolkit. I do have one. I don't advertise it that much, but, okay. Do you know how much kind of it costs you to acquire a customer?  Yeah. So last year it was 36 to acquire one customer. Okay. What does that represent in an LTV for that  college student?\r\n\r\n\r\nThat one is unknown because we've been switching systems. We had a previous system and then we now have like fully custom technology. We've been really diving heavy into building custom tech. So I don't exactly know what our customer retention rate is because we've switched systems. But our average revenue per customer for one year is 611. \r\n\r\n\r\nAnd a lot of those customers come back to the next year. So I don't have how many come back, but six 11 per year per customer is the, your, you know, LTV to CAC is almost 20 times.  So that's a very good ratio. And I guess it makes sense too. Right. Cause once you lock them in and they have one place to store, especially if you catch them in their freshman year,  they're not going to switch storage companies.\r\n\r\n\r\nWhat's the point in like, okay, cool. Now I know where to go. I'm going to go to Colin's company. It's easy. I know what they cost. I know the guy anyways, I think that's, they're probably pretty sticky. They're sticky. But the thing is that if they move off campus, their sophomore year or their junior year, they usually have a year round lease and they don't need storage anymore.\r\n\r\n\r\nSo that's the big thing. So we target freshmen heavy cause they're all on campus at pretty much every school. Yeah. So then you're at least hoping to get 12 months, if not longer out of students. That makes sense. Do you do anything other than the guerrilla marketing? I think the guerrilla marketing is great, right?\r\n\r\n\r\nCause you're out and you're actually talking to people and driving business that way. But are you doing, Any paid ads? Are you doing any Facebook, Instagram funnels, anything like that? Yeah. So I'll backtrack again to the guerrilla marketing studio tabling, flyering. We also post posters around campus. We get creative on that side of things.\r\n\r\n\r\nSo that's the major marketing spend. It's also not that expensive, which is great. That's why our customer acquisition cost is fairly low. We also do paid ads. So Facebook was a big, I guess I should say meta. Meta was a big. Success for us this year. We got a couple, a few hundred customers, I think from meta ads. \r\n\r\n\r\nAnd I think we spent over seven grand on that this year. And that was our first year ever using meta ads. And that was a huge success. So really happy with how those performed. I don't have the exact numbers. So don't quote me on that. I'm curious about your content. Does your content drive any sales? \r\n\r\n\r\nUnfortunately, not really because I'm, I focus on X Twitter because it's just most fun for me. I don't really like LinkedIn as much. I don't really like making videos that much. And college students aren't really mainly on  X  they're more on Tik TOK and Instagram, which I don't really focus on as much.  So I'm just going to try to back into it.\r\n\r\n\r\nIf you're doing 636 per year per customer, that's roughly a thousand. You have about a thousand 1200 students who are currently storing stuff with you.  Yeah. Was that ballpark? Cool. That was six 11 last year per customer. So yeah, it'll be, it's rough. It's right on that. We actually are still doing pickups right now at Dartmouth college because there are late They're a quarter of school.\r\n\r\n\r\nSo we're still getting some more orders in, but yeah, we'll be done on June 7th. That's right, man. It's my brother's birthday.  Nice.  How did you start this business? Did you buy it? I mean, I'm going to answer my own question. I know you didn't buy, you started from scratch. Did it take a lot of capital to get started or like what bootstrapping startup process look like?\r\n\r\n\r\nThis is the great thing about service businesses. It barely costed me any money to get started. Literally like a few hundred bucks. I whipped together a Squarespace website. I took a reservation deposit, 15 to reserve spots,  storage spot. And then I like found a storage unit nearby Dartmouth college. And I just rented a U Haul and did some marketing and found like, I don't know, however, like 12, 20 customers that first period, right before COVID hit.\r\n\r\n\r\nAnd then, yeah, that was it. I really didn't have to spend any money at all. I feel like in a product business, you have to spend maybe 10, 20, 000, whatever on a. Um, prototype. That's what's great about service businesses though. You can start it for almost nothing.  So what is your cash conversion cycle look like?\r\n\r\n\r\nIs this a typical kind of rent or lease model where it's like first and last month's rent paid up front and then paid monthly? Or do you collect everything up front? What does that look like?  So actually all of our competitors, there are other businesses in this space. It's very niche, but there are competitors.\r\n\r\n\r\nThey all charge up front for the whole summer, but we're different because we charge per month. So basically we take inventory. We charge you in May for your May storage. We charge you a monthly subscription. So in June for your June storage, July for July. So we charge a monthly subscription. Everyone else charges right up front, which  is okay.\r\n\r\n\r\nLike we're not really strapped for cash really at any time over the summer, but it would be nice to get that all up front, but that's a little less reasonable from the customer side of things. What's your plan to scale this thing? Cause obviously you're trying to scale it, right? Like you're at 23 and I'm a, you're an enterprising young person.\r\n\r\n\r\nOh, you young whippersnapper.  Uh, what, like, how do you see this being scaled? I think there is huge opportunity in the space. I really do. So we're at 23 schools. I would say there's probably about a hundred to 120 that are perfect fits, perfect schools that are perfect fit for this business model. So there's plenty of room to grow geographically, but there's also more room to grow depth wise within the schools that we have.\r\n\r\n\r\nSo we are just in year one at some schools like Tufts.  Tuftson outside Boston, that's a great school. We have 50 years or I think 50 or 60 customers there. We could easily turn that into a 200 customer school. So we can grow, go deeper at the schools that we're at. Why not just start a course and not worry about the operational headache, like almost franchise these out, have them pay you upfront for the course.\r\n\r\n\r\nI don't know, 2000 bucks. And then they pay you 5 percent of revenues and then you can explode really quickly. But if you go obviously school by school and you own it a hundred percent, Just the operational,  I don't know, wear and tear is going to be hard to roll that out. Have you thought about doing it that way?\r\n\r\n\r\nOr are you like, nah, I'm owning this thing a hundred percent. We're going to scale. I've briefly thought about that. I don't really know how to do it. That's one thing. I'm sure I could figure it out. I figured out how to get this far. I'm sure I could figure it out. But  also I think the state of our technology is something that would be big for a franchise model.\r\n\r\n\r\nSo we are still building technology. There's a lot that we're  need to figure out and need to make. Semi perfect before we could launch it to a franchisee and have them rely on that technology. So we're still building a lot of custom tech, which I'm really excited about. We have three full time software developers on payroll.\r\n\r\n\r\nThey're amazing and it's transforming the business, but we need to finish that. You could just sell a course and tell them, but you have to use our software  and that they pay you a licensing fee for the software. And then you're able to roll it out. Much quicker, much, much faster. These universities.\r\n\r\n\r\nAnyways, I would think about that if I were you. Yeah. It's not a bad idea. I'm not opposed to it. I'm really not. Fascinating, man. I'm going to ask you some rapid fire questions. If that's cool with you.  What do you love about this business? I thought about this one. I love and hate. The seasonality of it. So the seasonality is great because we get a lot of revenue at one time, but it's also, I hate it because we only get a lot of revenue at one time, but it's the seasonality is also good because like now it's slow in the fall.\r\n\r\n\r\nIt's slow. We can really analyze. What happened, what worked, what didn't, and we can make changes in the off season and implement that for the next year. I feel like when you're in a non seasonal business, it's tough to take a pause, take a break and figure out what needs to be worked on. It's not difficult to do that in a seasonal business.\r\n\r\n\r\nIf you woke up tomorrow with an extra 100, 000 in your bank account,  what would you do? Not personal. It's in the business. You have to use it on the business. What would you do with a hundred grand?  I think I would hire  some unbelievable talent and whether that's  on the U S and that's one employee for a hundred K or whether that's overseas and we're hiring five people.\r\n\r\n\r\nI think the biggest thing in this business and probably every business is the quality of the employees you have on your team. And that's what I value a lot. And that's my job as CEO to put the right people in the right places. So I would go out and find some killer employees. I agree with you get specific.\r\n\r\n\r\nWhat kind of employees, like what kind of talent? Like job role or you have a hundred thousand dollars. What does that mean? You're going to spend on talent. You're just going to  what hire a bunch of people to have a bunch of people. Or what do you feel like would drive your business?  What position would be next?\r\n\r\n\r\nSo one thing I'm trying to do as founder is remove myself from the daily operations of the business. So it is, doesn't rely on me. So hiring eventually a CEO that can take my role. \r\n\r\n\r\nSo I guess I could take maybe that a hundred K and hire a great CEO, maybe a compensation package that is tied to profit or whatever that might look like, take that a hundred K, hire a CEO, train that CEO, and start to take a more passive approach to my company.  Yeah. CEO or COO, right. To someone to take the operational lift off of your back.\r\n\r\n\r\nThat makes sense. I like this question.  A lot of guys on Twitter who are in real estate are jealous of the S and B guys because, Oh, they have a cash flowing business and it must be nice. They can scale it.  And the S and B guys are jealous of the real estate guys. Cause they're like, Oh, it must be nice just to have a fixed, steady asset that appreciates inflation every single year and produces some cash flows.\r\n\r\n\r\nWe all suffer from like the grass is greener.  What industries are you jealous of? Like most jealous of right now?  You nailed it. You nailed it. Commercial real estate.  It's real estate more specifically commercial real estate. Really? Yeah. That's a guy.  Not only would it be great for green box, if I was able to invest some industrial assets because we could use that maybe for some summer storage for some branches, but I want to get into commercial real estate really bad and hoping to make that jump this fall with some earnings from green box.\r\n\r\n\r\nAwesome, man. That's actually become the most answered question or the most common answer. Commercial real estate.  Interesting.  What are you obsessed with right now? If you have two hours during your day and you're not working, you're not doing anything else. Like what's the thing you go to that you think about or that you're messing with at the moment?\r\n\r\n\r\nMy personal brand.  I am obsessed with growing and monetizing my personal brand right now. That's been a huge focus for me. I'm using Twitter as a, as one way to do it. I'm building a newsletter. I've got a course that I don't really sell a lot, but I'm thinking about really putting some more effort into marketing that and some other things up my sleeve that might come up down the road too.\r\n\r\n\r\nOkay, let me ask you this.  You're obviously smart and thoughtful. Like you're not just somebody who's flying off the handle saying a bunch of stupid stuff,  but you post some engagement bait.  Why? I don't like you don't need to post that stuff. I think it makes you very polarizing potentially. Why? Why lean into that? \r\n\r\n\r\nI feel like you need eyeballs. You absolutely just need eyeballs in order to grow. And that's the take I have on it. So I need impressions or else I'm not going to be able to grow. And like that ridiculous bottleneck tweet that had over 60 million views, that translated to over a thousand followers and also hundreds of newsletter subscribers.\r\n\r\n\r\nSo I see something like that and I'm like, okay, it went viral. It worked. It had nothing to do at all with my business or my personal newsletter or anything like that, but it converted. So I see that I'm like, okay, it's working. I also see people like Nick Huber, and it's obviously working for people like that.\r\n\r\n\r\nHe's got a bunch of portfolio companies, 350  plus thousand Twitter followers. If it works for him, why is it not going to work for me? The counter, I would say to that is. I had a tweet last week that got like a million impressions and I picked up 1200 followers.  So for 60 million and you got a thousand followers or one million and I got 1200,  like on a per impression basis, it's more efficient. \r\n\r\n\r\nI'm not saying one's better than the other because I really admire the way that Nick Huber has grown his audience and then is now focusing on monetizing. That audience and his distribution channel. So again, to each their own. It's just like your personality is very different than I would have expected given some of the posts that I've seen that I've seen, right? \r\n\r\n\r\nAnd that's not again, that's not a bad thing. I don't knock you for it. Whatever. That's perfectly fine. You're not out there like saying racist crap or being a sexist or anything. I get what you're doing anyways. I was just curious how you think about that. That's not the first time I've got that. Actually.\r\n\r\n\r\nI've met a bunch of people through Twitter. I love meeting people online and they say pretty much the same thing every time. I just, yeah. I would say I'm a little different in person than I portray on social media. It's awesome. All right. Here's my very last question.  There's a lot of people listening to this who aren't entrepreneurs who haven't taken the leap or they're trying to figure it out.\r\n\r\n\r\nWhat's the right business? Do I buy? Do I build? If you were giving advice to yourself, not to them, to yourself, usually I say 10 years ago, but you would have been 16, 10 years ago. So  you're giving advice to yourself five years ago. What advice would you give to yourself? You got to grind.  You really have to grind in a sense of urgency.\r\n\r\n\r\nI actually posted about this today. Like you have to have a sense of urgency. And if you're just constantly putting things off, you're preparing to get started in entrepreneurship. And you're making this business plan that is like, this is what's going to happen five years down the road. But I haven't even actually done anything yet.\r\n\r\n\r\nThat business plan is going to be useless one week later when you actually start. So stop putting things off, get started right now and learn as you go. I'd also say that  entrepreneurship is a game of incomplete information. You are never going to have all the information needed to make the perfect decision.\r\n\r\n\r\nYou have to make quick decisions with partial information and kind of build that muscle because that's crucial to be successful, being successful as an entrepreneur. Totally agree. This was a rad conversation. Is there anything I didn't ask that you wish I would have? No, I like that question though. I'm glad you asked me that.\r\n\r\n\r\nI appreciate that. But no, I think you hit on everything. Cool, man. Where should people come find you if they want to, what's your company website? What's your personal website? Yeah, my personal website, it's my name. I have two L's in my first name. That's ColinRutherford. com and greenboxstorage. org is my startup's website.\r\n\r\n\r\nI'm most active on Twitter. Come find me on Twitter. Slash X Colin underscore R U T H eight nine is my handle. I'm also on LinkedIn, but not as, not as active and not as spicy.  Spicy. I'm a little less spicy on LinkedIn than I am on Twitter. So come see the spice on Twitter. Well, this was a rad conversation.\r\n\r\n\r\nI like very pleasantly surprised and I'm rooting for you. I can't wait to follow along and see how your company does. I think you're going to crush it. You got a bright future, man.  I appreciate that neck. And thanks for your dinner with this podcast series. Really cool stuff. Awesome. All right. You have a good one. \r\n\r\n\r\nAll right. You too. Thanks.",
  "metadata": {
    "duration": "",
    "date": "2024-06-19",
    "platform_source": "Google Drive"
  }
}