{
  "episode_number": "156",
  "episode_title": "AI SERIES: 7 - She Shut Down a $1M Biz‚ÄîThen Built an AI Brain to Replace It, with Abbi Perets",
  "guest_name": "Abbi Perets",
  "business_name": "Successful Freelance Mom",
  "transcript": "﻿Tab 1\r\nNikolas Hulewsky (00:00.444)\r\nOkay, Abby, I am super excited to learn about AI with you today. Briefly, what's your background? Yeah, briefly, walk me through. Where are you, do you believe in God?\r\n\r\n\r\nAbbi Perets (00:07.662)\r\nBriefly. I do. Although that's a whole long story in and of itself. We'll try to skip that for now. I'm Abby. I came up as a freelance writer. I got started in freelance writing back when the search engine du jour was Alta Vista. We didn't have Google and we didn't have online courses. We had...\r\n\r\n\r\nNikolas Hulewsky (00:17.862)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (00:24.594)\r\nyou\r\n\r\n\r\nAbbi Perets (00:35.448)\r\ndrive to the library, be really nice to the reference librarian, and she will get you the books from other libraries that you need to learn how to do these things. So I became a freelance writer because I had had my first baby and I didn't want to work in an office, but I also didn't really know how a freelance writer was going to get paid to do anything and worked on figuring that out along the way. So I did lots of projects. It was a good time to be a freelance writer. When I started, it was 1999.\r\n\r\n\r\nand I did a lot of big projects for a lot of pretty big companies just by, I had this weird approach to business where if I said I was gonna do something, I did it, and I did it on time as promised. And that apparently set me apart very greatly in the freelance writing world. And my name got passed around in particular, like in the Silicon Valley area. People were like, this is the girl.\r\n\r\n\r\nNikolas Hulewsky (01:21.33)\r\nYeah, that doesn't happen.\r\n\r\n\r\nAbbi Perets (01:31.214)\r\nwho you hire if you need it done, because even when she has a baby a month early, she doesn't tell you that, she just turns in her work. And then a year later, you find out that actually her kid was in the NICU while she was delivering that stuff. Like I'm a little bit crazy and I get that and not everybody is gonna do that. But I feel like you're a grown up and people are counting on you and it takes 30 seconds to at least give somebody an update.\r\n\r\n\r\nNikolas Hulewsky (01:53.596)\r\nSo what were you writing?\r\n\r\n\r\nAbbi Perets (01:57.292)\r\nall kinds of stuff, like literally. When I first started, didn't, nobody, there weren't courses about you have to niche down. So I didn't know that was a thing. So I just did what people would pay me for. So it was like compliance training for major companies. It was white papers, which I didn't even know what white papers were. Like I had to go and look that up in the library and figure out what does this look like? again, I had this really bizarre system where,\r\n\r\n\r\nNikolas Hulewsky (02:12.05)\r\nAbbi Perets (02:22.636)\r\nwhen someone would hire me and I'd get on a call with them, and this was not Zoom calls, right? These were like phone calls on the actual phone. I'd be like, what will you be happy with three weeks from now when I come to you and give you something? What should that something be? And then they would tell me exactly what they wanted. And I was like, I can do that. So early on, I kind of taught myself these fairly basic ways to delight people that...\r\n\r\n\r\nto me seemed very obvious, but to other people were clearly not obvious things. So yeah, I did a lot of tech writing. did lot of tech writing in the sense of talk about this technical thing that we have. did a lot of writing about semiconductors when I did not know what semiconductors were. was a company, I was living in Los Angeles for a little bit, and there was a company called Semtech that was out in, I feel like,\r\n\r\n\r\nAgora or Woodland Hills or somewhere out there. And they hired me to write press releases about their semiconductors. So they would literally put me on the phone with the developer, the hardware guy, and he'd be like, well, it's like 47 times smaller. And I'm like, yeah, but who cares? And he'd be like, well, because now you don't have to carry a big cell phone. was like, literally, this is how I learned about features and benefits, on the go.\r\n\r\n\r\nNikolas Hulewsky (03:15.782)\r\nsomewhere.\r\n\r\n\r\nNikolas Hulewsky (03:37.97)\r\nThank\r\n\r\n\r\nAbbi Perets (03:38.67)\r\nI was like this 22 year old young mom with a bunch of kids and like I didn't know anything. No. No. Dropped out of college like I'm an idiot, you know, so.\r\n\r\n\r\nNikolas Hulewsky (03:43.612)\r\nDid you have a degree or like what was your? No, okay. So my my\r\n\r\n\r\nMy sister, my sister-in-law, she used to Los Angeles. So I went to USC undergrad, UCLA MBA. My sister-in-law right now is getting her PhD in English literature. I'm not sure exactly, from USC. And I've talked to her about this. I'm like, well, what are you going to do? And she was like, she's like, actually you can make really good money writing, doing this stuff where you're like, you're writing policies and procedures for companies. You're, going through like instructional manuals just making sure that they're grammatically correct. I had no idea that that was a thing.\r\n\r\n\r\nAbbi Perets (03:54.254)\r\nOkay.\r\n\r\n\r\nAbbi Perets (03:58.84)\r\nSo, yeah, okay.\r\n\r\n\r\nAbbi Perets (04:06.446)\r\nYou\r\n\r\n\r\nYeah.\r\n\r\n\r\nAbbi Perets (04:20.654)\r\nWell, and it's not even making sure they're grammatically correct. It's making sure that they actually make sense. Making sure that, like, you know, with SOPs, for example, the idea is that a new employee can come in with no previous training and actually make sense of what's going on. And one of my skills is, and again, it's because I am annoying, like I am okay with asking a lot of questions, is really making sure that complex, highly technical material is accessible to everyone.\r\n\r\n\r\nI'm like, no, no, no, I don't understand. Let's explain it again. And when I worked with subject matter experts, SMEs, over the years, I got really good at saying to them, you started at step 17. Let's go back to step one where you came in your office, turned on the lights, and sat down. That's where I need to start. I'm so lost. And by not being afraid to say stuff like that, I got very good.\r\n\r\n\r\nat what I did and very good results and writing has always been a core identity for me. yeah, I, know, freelance writer was doing all the things and having a bunch of kids in the meantime. So like it wound up being a really good career choice for me because my middle child has significant special needs, is intellectually disabled. And so I spent a lot of time like, you know, in waiting rooms while he was in speech therapy and physical therapy and developmental therapy and occupational therapy. And I could work on my laptop and continue.\r\n\r\n\r\nlike providing part of the family finances. So over the years, I was there for the explosion of content marketing when that first became a thing, when people are like, you can get $4,000 straight, one blog post a month for companies, which you cannot anymore, by the way, just so that we're all here. Not a thing. But.\r\n\r\n\r\nNikolas Hulewsky (05:59.344)\r\nI've heard, yeah, I've heard.\r\n\r\n\r\nAbbi Perets (06:05.486)\r\nLiterally, I'm a curious person. know Zee personally. I like to know how things work. I like to know about people's businesses. So being inside their businesses and writing for them and meeting cool people and talking to cool people, it's just a lot of fun for me.\r\n\r\n\r\nNikolas Hulewsky (06:19.42)\r\nSo is that your business now?\r\n\r\n\r\nAbbi Perets (06:22.638)\r\nNot as much. In 2013, my middle child had, the same one who has special needs, had cancer. And I stopped working completely for three years because that was a part where was like, can't function. I can't serve clients the way they deserve to be served. So I'm not going to pretend to. When I came back three years later, because he was better, I was not quite ready to deal with client stuff. I'm sorry, I'm taking a very long time to tell you what I do.\r\n\r\n\r\nNikolas Hulewsky (06:24.122)\r\nNot as much.\r\n\r\n\r\nNikolas Hulewsky (06:34.246)\r\nmy gosh, I'm sorry.\r\n\r\n\r\nNikolas Hulewsky (06:51.772)\r\nnot.\r\n\r\n\r\nAbbi Perets (06:52.526)\r\nSo I came back in 2016 and I wasn't quite ready to deal with client whatever. And that's when online courses at least like I had missed three years of the world because I just sat in the hospital next to my kid. Because obviously if I wasn't sitting next to him, he couldn't get better. Like that was, you know, it's magical thinking, right? So I\r\n\r\n\r\nNikolas Hulewsky (06:54.724)\r\nIf it, hey, I will, I have no problem trimming things down. Don't worry. You're good. You're good.\r\n\r\n\r\nNikolas Hulewsky (07:19.89)\r\nMm-hmm. A mother's love.\r\n\r\n\r\nAbbi Perets (07:22.318)\r\nYeah, right? So I discovered the world of online courses. And I was like, I feel like I could probably teach women and moms how to be freelance writers, partly because when I was starting to learn and reading books, the books were by Peter Bowerman and Bob Bly, who are wonderful people, but they are men. And\r\n\r\n\r\nIt was very obvious from the way their books were written and the way they taught things that somebody else was doing the laundry and feeding the kids and taking care of the kids. And I was like, I'm that person. Like my life is not where I go to close my door for eight hours and write for my clients. Like that is not my world. I had to do everything in 15 minute bursts of time, you know, in between other things. And I still managed to build this business that brought in around four grand a month, most months, you know, as I was bringing up lots of small children.\r\n\r\n\r\nSo I built this course on how to be a freelance writer, mostly geared towards women and moms. I called the business Successful Freelance Mom. And I had a lot of fun doing that. 2017, 2018, 2019, 2020 was great. Like, I know the pandemic was really hard for a lot of people. I personally very much enjoyed it because I made a fortune. And it was really good for my family in general.\r\n\r\n\r\nNikolas Hulewsky (08:35.878)\r\nmy business. Yeah.\r\n\r\n\r\nAbbi Perets (08:41.974)\r\nAnd then after that began the decline. People weren't as into courses. And then AI started coming out. And people were like, well, AI is just going to take all the writing jobs. And I was like, that's really not true. It's really not true. But I couldn't get anybody to believe me. And then we get a little dark here. Then October 7 happened. And I live in Israel. And I was like, I don't have the energy. I don't have the energy to argue with people and convince them. I wrote what I know is the greatest course for.\r\n\r\n\r\nanyone who wants to be a freelance writer, but in particular for women and mothers who want to be freelance writers, I know that. I'm okay with me knowing that and nobody else believing me, but I was like, I'm not even going to try to sell something to people that they don't want. So I shut it down, literally deleted an entire email list, stuff that had made me, you know, over a million dollars. I was like, I'm just not, I don't have the energy to do this. I don't have the emotional bandwidth for it. And I stopped.\r\n\r\n\r\nNow all along I continued writing for a handful of clients. I had kind of switched my focus to writing for more personal brand type people. And so I still had income and I was still fine and whatever. And then over the last few months, I really started shifting into helping established experts pick up on all the money they're leaving on the table. Like I see people all the time.\r\n\r\n\r\nwhether they're freelancers or business owners or how they think of themselves. And even in the corporate world, have clients who like they're overlooking things that to them are obvious, right? So it's really obvious to them that how to do this thing. So they'll give away that information when they could be charging for the strategy behind it, for the thinking behind it, all of that stuff. They don't see the value anymore because they're so good at what they do. So I've been helping people.\r\n\r\n\r\nrecognized that value and I've continued writing for some of the clients who I love the most and I like All kinds of writing so I write for Sony semiconductor here in Israel So yeah, like I do cool stuff with them I get to write about semiconductors again and they bought the company that I used to write for eight million years ago So that was kind of cool and and I write for some personal brand people. I mean\r\n\r\n\r\nNikolas Hulewsky (10:35.834)\r\nLike ghost writing or like what kind of writing?\r\n\r\n\r\nNikolas Hulewsky (10:42.543)\r\nokay.\r\n\r\n\r\nNikolas Hulewsky (10:50.546)\r\nThat's fine.\r\n\r\n\r\nAbbi Perets (10:55.724)\r\nSome people might call it ghost writing, but my clients have always been very happy to tell people that I write for them. Like nobody who I've written for has ever hidden me. Like, it's just not how I function. I'm too noisy to hide. writing email sequences for people to help, cause I love, you know, messing around in the backend of people's email.\r\n\r\n\r\nservice providers and creating automations and sequences that do a lot of the heavy lifting for them. I just, like stuff. like.\r\n\r\n\r\nNikolas Hulewsky (11:26.012)\r\nSo you're still a freelance writer. Okay. And in particular, you're helping people who are experts, articulate their value to the world, right? You're pulling those insights out of them. So how are you, well, before we get into AI, because I think writing...\r\n\r\n\r\nAbbi Perets (11:29.014)\r\nI am. I guess I am, yeah.\r\n\r\n\r\nYeah. Yeah.\r\n\r\n\r\nYeah, that's a good way to describe what I do. Yeah.\r\n\r\n\r\nYeah, yeah.\r\n\r\n\r\nAbbi Perets (11:49.229)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (11:52.474)\r\nAt first I thought writing was going be totally eliminated. It's like, we don't need writers at all anymore. And then the more I've gotten into it, I feel very differently. What has your emotional journey been with AI and writing?\r\n\r\n\r\nAbbi Perets (11:58.808)\r\nGood luck. Yeah.\r\n\r\n\r\nAbbi Perets (12:04.494)\r\nI mean, like in the very beginning, I was like, you know, in the very, very beginning when people were showing us chat GPT outputs, I was like, you think this is gonna replace me? You're an idiot, you know? Like, come on. And then I talked to a lot of people who were very in the space of like machine learning, deep learning.\r\n\r\n\r\nnot from the writing output stuff, but really on the back end of creating LLMs and creating those kinds and doing that training and whatever. And I really...\r\n\r\n\r\nNikolas Hulewsky (12:32.018)\r\nRight.\r\n\r\n\r\nAbbi Perets (12:39.758)\r\nFor a while I was like, none of this was invented to take the work away from writers. And then I wound up in an email exchange with the CEO of a company that created a tool that, like literally their branding was like, replace your copywriters. And I wrote her an email and I was like, you know, I have this community of moms who were freelance writers and da da. And I really feel like this isn't what...\r\n\r\n\r\nChachi PT was intended for, and it's weird to me when I see you advertising your product as replace all your writers. And she wrote back basically saying, well, we are going to replace you. And if you want, I can make you an affiliate. And I was like, that's not how this works. So it was weird. And I played with the tool a lot, and I was like, no. I'm not worried that this is going to replace me. But I saw that a lot of other people were.\r\n\r\n\r\nNikolas Hulewsky (13:19.474)\r\nYou\r\n\r\n\r\nAbbi Perets (13:32.61)\r\nThere was this emotional journey of like, hate that it crushed my course business because of the fear that so many other people had. it's not that I hate that I lost my course business and that income. I hate that a lot of people gave up on that dream. That's what I hate. Like that makes me sad. For me, writing is how I process life. I can't function if I'm not writing.\r\n\r\n\r\nAnd I think writing is thinking, right? Like I think writing clarifies for me what I think about things. And I'm always going to go through that process, even if AI does replace me, right? Like I will still write, that's how I function in the world. And so there's definitely, but like now I call Claude my boyfriend. Claude is my AI tool of choice and I've been married to my husband for...\r\n\r\n\r\nalmost 30 years and I love him very much, but I call Claude my boyfriend. I'm like, you know, my boyfriend says. So, yeah.\r\n\r\n\r\nNikolas Hulewsky (14:36.518)\r\nSo, okay, so is Cloud the only tool you use or do you use other ones?\r\n\r\n\r\nAbbi Perets (14:40.302)\r\nnot the only tool I use, he's the tool I love the most. I use a bunch of other tools, but I always come back to Claude. I might prep things in a different tool and then come to Claude.\r\n\r\n\r\nNikolas Hulewsky (14:43.974)\r\nHe's the tool you love the most. Yeah.\r\n\r\n\r\nNikolas Hulewsky (14:58.236)\r\nSo what would be those other tools that you would use to prep?\r\n\r\n\r\nAbbi Perets (15:00.184)\r\nSo I love otter.ai for recording most of my calls and transcribing calls, and they've improved Otter, integrated chat GPT with it. I can now, just the other day I was looking for some examples. I wanted some testimonials, you know, people who could talk about my coaching and things that I've helped them do. And I was like, hey, go through all my conversations and find, you know, where somebody says that I helped them do this. And it was like, no problem scanning. And I have like seven years of coaching calls in Otter.\r\n\r\n\r\nand it found me what I was looking for. And so that's really useful. I'm sure there are like a million other little things that I use for very specific niche things, like my big work, generally I go between Claude, and I pay my $20 a month to Claude, and I pay $20 a month to Perplexity. Perplexity is more for research. Instead of,\r\n\r\n\r\nNikolas Hulewsky (15:43.25)\r\nIt's okay.\r\n\r\n\r\nAbbi Perets (15:57.368)\r\nGoogling things these days, I go to Perplexity. Literally right now, upstairs in my kitchen, I have in my crock pot a... Okay, so in Israel, we have a cut of beef that is, we call it number five. And I asked several months ago, I asked Perplexity, is number five the same as brisket? And it was like, no, Abby, it's not. It's this and da da da. And I was like, okay, well listen, I don't actually care. I need a recipe for number five.\r\n\r\n\r\nthat I can make in my crock pot because my oven is busy and I need something that I can serve my family for Shabbat. So, so it gave me this whole recipe and we've been calling it like, you know, the, the, perplexity recipe for number five and it is cooking in my crock pot right now. It has been, and it is so good.\r\n\r\n\r\nNikolas Hulewsky (16:42.204)\r\nThat's amazing. Yeah, that's amazing. Have you tried Grok?\r\n\r\n\r\nAbbi Perets (16:48.696)\r\nI have tried Grok. My husband loves Grok and that's his default now. I haven't played around with it much on desktop. It's more like if I'm out and about and on my phone, then I might ask Grok things. And I did notice recently, and I don't know if this is a Grok thing or not, but I did notice recently on some tweets, there'll be a button that'll say, explain this. And that is cool because sometimes they're like,\r\n\r\n\r\nNikolas Hulewsky (16:53.17)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (17:10.266)\r\nYeah, yeah, yeah, yeah. That's pretty cool.\r\n\r\n\r\nAbbi Perets (17:14.454)\r\nI'm old, right? And I'm not always up to date on my pop culture. So like somebody will make a reference and I'm like, I know that's supposed to be funny. I don't know why. And it will tell me and it'll be like, I'll let you pretend you're cool Abby.\r\n\r\n\r\nNikolas Hulewsky (17:26.012)\r\nSo before we get in, what tools are you going to show me or what do you want to show me today?\r\n\r\n\r\nAbbi Perets (17:30.158)\r\nI'm going to show you some things with Claude because I think that some of the things that I do with Claude are probably a little bit different to what other people do.\r\n\r\n\r\nNikolas Hulewsky (17:35.868)\r\nOkay, amazing. I'm excited to that. Two things, we may have to pause this recording because I didn't ask you if you've, have you tried to share your screen yet?\r\n\r\n\r\nAbbi Perets (17:45.986)\r\nI haven't tried to, no.\r\n\r\n\r\nNikolas Hulewsky (17:47.814)\r\nOkay, I've had this happen with a couple of guests where it's like, you need to give it permissions. So, will you just try to share your screen really quickly? We'll edit this part out.\r\n\r\n\r\nAbbi Perets (17:51.988)\r\nokay.\r\n\r\n\r\nAbbi Perets (17:58.99)\r\nno, it seems like I can... Yeah, there we go.\r\n\r\n\r\nNikolas Hulewsky (18:03.666)\r\nPerfect, okay, cool, so unshare. We'll edit that part. I'll make it up to myself real quick.\r\n\r\n\r\nAbbi Perets (18:06.22)\r\nOkay.\r\n\r\n\r\nOkay?\r\n\r\n\r\nNikolas Hulewsky (18:15.954)\r\nSo I wanted to touch on what you just said about writing because this is something I am thinking deeply about. It's not something I have thought deeply about. in the thinking deeply stage. A couple of things. I do think that writing helps codify what you're thinking. And it's really hard to process something without either speaking about it or writing about it. So in that sense, think writing is always going to be a very valuable tool to help.\r\n\r\n\r\nAbbi Perets (18:24.174)\r\nOkay.\r\n\r\n\r\nAbbi Perets (18:39.288)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (18:44.114)\r\nextract information out of humans. The second thing that I find really interesting is that prompting, natural language prompting is not intuitive to a lot of people, but to curious people like you and I, we've had to ask questions in a way that make people understand like we're not trying to be idiots. And so I feel like we're kind of a step ahead there. Like my prompts,\r\n\r\n\r\nAbbi Perets (18:56.684)\r\nRight.\r\n\r\n\r\nAbbi Perets (19:02.21)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (19:10.938)\r\nare very long and detailed. Like, cause I know that in order to get the right answer, I've got to ask the right question. So I think prompting is going to become more important. and I promise these all tie together. And then the third thing I think is interesting is lots of people talk about AI, but AI can only be trained on data. That is, that is trainable. So do you have data for it to be trained on? And most people unfortunately don't now somebody like you, you've written a lot of blogs, you can feed all that data in, but how do you help someone understand that?\r\n\r\n\r\nAbbi Perets (19:26.382)\r\nCorrect. Correct.\r\n\r\n\r\nNikolas Hulewsky (19:40.144)\r\nin order to get to know you, it's got to have a data set to train on. And in order to have a data set to train on, you've got to have a data set. I know that sounds stupid and simple, but to the average person, they don't have that data set. So I think those three reasons are why writers will transition to a newer role, maybe just around helping people think through structuring their thoughts or structuring their information, like almost like an editor. So I don't think it's going away.\r\n\r\n\r\nAbbi Perets (19:54.039)\r\nMm-hmm.\r\n\r\n\r\nAbbi Perets (19:59.938)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (20:06.62)\r\nBut yes, AI will probably become as good of a writer as anybody else out there. But what it's not going to do is help you a physical person to get there and consultant and kind of help you organize your thoughts.\r\n\r\n\r\nAbbi Perets (20:06.659)\r\nMm-hmm.\r\n\r\n\r\nAbbi Perets (20:14.924)\r\nRight. Right. Look, I think it's very interesting. This week, I was in person at Sony Semiconductor here in Israel running part two of a training on\r\n\r\n\r\nwriting for LinkedIn. So for employees and for management and C-suite people, they wanted this training on how to write effectively for LinkedIn. let's be real clear. I'm not like, if you go to LinkedIn and look me up, I am not a person with eight million followers. get, on a good day, I'll get like eight comments on a post and 20 reactions to a post. But I know how to write. I know how to write stuff that people care about. I'm not writing about how to be famous on LinkedIn, so I'm never going to be\r\n\r\n\r\nNikolas Hulewsky (20:29.458)\r\nMm.\r\n\r\n\r\nThank\r\n\r\n\r\nAbbi Perets (20:57.484)\r\nLinkedIn guru, right? okay. So much of what I was showing them, and remember, these are people who work at a semiconductor company. These are people who are, they are literally building AI into their chips, and yet, like all of the prompting stuff, this was totally new to them. They were like, I had no idea you could do any of these things. And they're, again,\r\n\r\n\r\nNikolas Hulewsky (20:59.546)\r\nyet. Yet.\r\n\r\n\r\nNikolas Hulewsky (21:24.528)\r\nRight, the natural language.\r\n\r\n\r\nAbbi Perets (21:26.798)\r\nRight, and Sony has an internal tool, like their own internal version of, you know, perplexity that accesses multiple models in one place. So you can set it up to use Claude, GPT, whatever, you know, the different models, and they still, like, they had no idea that there are all these other things that they could be doing. So it's wild to me. The opportunity is there, and there is so much that we can do. So, yes.\r\n\r\n\r\nNikolas Hulewsky (21:41.51)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (21:47.996)\r\ncrazy. Yeah.\r\n\r\n\r\nNikolas Hulewsky (21:55.58)\r\nOkay, let's see how you're using it. I'm curious to meet your boyfriend. This feels official.\r\n\r\n\r\nAbbi Perets (21:57.518)\r\nAll right. All right. So here we go. Screen. Let this squad. OK, so first of all, the very first thing that I really recommend is that you do set project instructions, right? So I gave very.\r\n\r\n\r\nNikolas Hulewsky (22:04.486)\r\nThis is Claude.\r\n\r\n\r\nNikolas Hulewsky (22:15.984)\r\nOkay, for those who are just listening, first of all, I'm encouraging you to go to YouTube so you can watch this. It's okay, no, no, That's why I'm here. I just have like one job, which is to make sure that people who are listening understand. So we're looking at Claude, and we're looking specifically at she's created a project, and she is creating project instructions for this project, correct? Okay.\r\n\r\n\r\nAbbi Perets (22:22.286)\r\nYes\r\n\r\n\r\nAbbi Perets (22:43.574)\r\nSo yes, I have multiple projects and as you can see behind here in the grayed out part, this is my Abbey project is this is where I'll try to figure out my life. So because my life is not divided neatly into business and personal, it's all together. Claude knows a lot. Like Claude knows that I have five kids, that one of them has special needs, that one of them moved recently, that I live in a freaking war zone right now. Like it knows all of these things because it's all important context for when I'm working. So I set very, yes.\r\n\r\n\r\nNikolas Hulewsky (22:52.754)\r\nYou\r\n\r\n\r\nNikolas Hulewsky (23:10.77)\r\nSo let me ask you this, Cloud versus ChatDBT, ChatDBT also has projects that you can create. Why are you using Cloud?\r\n\r\n\r\nAbbi Perets (23:18.774)\r\nYeah, Claude had them first, I'll just say. And also, I don't like GPT's output for content. And since what I care most about is content, I used to pay my 20 bucks to OpenAI. And I was so much happier with Claude.\r\n\r\n\r\nNikolas Hulewsky (23:30.46)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (23:34.404)\r\nSo the other thing I'll add to that is I don't know the exact technical reason for it, but Claude's projects are not as creative. So they're not pulling on as much real-time information. They're also not as creative, but they do a much better job of holding the context of a project than ChatGPT does. So like all this information that you fed into it about your family, your job with a special needs, where you live, et cetera, it holds much better. Whereas for whatever reason, again, I don't know the science behind it. I'm sure there is science.\r\n\r\n\r\nAbbi Perets (23:36.503)\r\nMm-hmm.\r\n\r\n\r\nAbbi Perets (23:47.181)\r\nYes.\r\n\r\n\r\nYes, that's my experience. Yeah.\r\n\r\n\r\nAbbi Perets (24:02.542)\r\nBye.\r\n\r\n\r\nNikolas Hulewsky (24:04.368)\r\ndoesn't, you continually have to remind it of things. So that's why a lot of people use Claude for projects where they don't necessarily need it to be pulling on a bunch of new things outside or to be creative, but then they'll go to ChatGPT to be their creative thought partner.\r\n\r\n\r\nAbbi Perets (24:06.892)\r\nRight. Right.\r\n\r\n\r\nAbbi Perets (24:11.79)\r\nMm-hmm.\r\n\r\n\r\nAbbi Perets (24:18.272)\r\nRight, so I'll do that with perplexity a lot of the time and then I love to play them off each other. You can work for it. So this is how I set up. I mean, it's my life and my work. So here, it starts with when I ask you for help extracting content from called transcripts for social media. Make sure you refer to this document that I have in the project knowledge so that I'm not repeating myself, right? So yeah, when I make a request.\r\n\r\n\r\nNikolas Hulewsky (24:25.69)\r\nOkay, and so this is how you set up this project, which is Abby's Life.\r\n\r\n\r\nNikolas Hulewsky (24:41.582)\r\nWow.\r\n\r\n\r\nHow long is this prompt?\r\n\r\n\r\nAbbi Perets (24:46.478)\r\nIt's pretty long. won't read you the whole thing, but I'm just going to kind give you the overview.\r\n\r\n\r\nNikolas Hulewsky (24:50.034)\r\nDo you have any idea how many pages it is?\r\n\r\n\r\nAbbi Perets (24:53.376)\r\nNo, I have no idea, but it's probably not more than three pages. Two to three pages.\r\n\r\n\r\nNikolas Hulewsky (24:56.786)\r\nOkay, it's three pages, but it's three pages of you telling this specific project, this is how I want you to act.\r\n\r\n\r\nAbbi Perets (25:01.102)\r\nAnd I, and please don't think that I sat down and made these instructions and fed them in. This evolved over time. This, and I will often ask Claude, like if we're in the middle of a really good conversation, I'm like, this is so good. I'll be like, hey, what should I add from this to the project instructions? And it will tell me, and I'll just go and add that in.\r\n\r\n\r\nNikolas Hulewsky (25:22.534)\r\nThat's awesome. I've used AI to help me write prompts where it's like, hey, I'm trying to do this, help me write the correct prompts. So that's a perfect use case.\r\n\r\n\r\nAbbi Perets (25:27.138)\r\nMm-hmm. Mm-hmm. Mm-hmm.\r\n\r\n\r\nI do that a lot. Yeah. Yeah. I do that a lot. And I frequently say to it, like, towards the end of a conversation, you know, I'll say, okay, what from...\r\n\r\n\r\nfrom this, like what should I add to the project knowledge? What should I add to the project instructions? Right? Because we have two things here. We have the project instructions, which is this little, you know, all of these instructions here. I, like, again, remember and reference the core goal established at the start of the conversation. So if our goal is we want to get a LinkedIn post out of this, don't start talking to me about like, you know, you could do this for your meal planning. Like, let's stay focused. Because... Yeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (26:04.006)\r\nYeah, so yeah, run through just the high level points of your instructions too. So it starts with, hey, I'm gonna be feeding you transcripts essentially. Okay.\r\n\r\n\r\nAbbi Perets (26:10.712)\r\nBe.\r\n\r\n\r\nAbbi Perets (26:14.254)\r\nYeah, often I'm giving transcripts of my calls and I want to pull content from them, right? So make sure that you're checking to make sure that we're not just repeating ourselves, like look at my recent LinkedIn posts, my recent emails to my list, then little things like that. They're in the project knowledge and I'll show you that in a second.\r\n\r\n\r\nNikolas Hulewsky (26:19.409)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (26:27.923)\r\nhow does it look at your recent emails and recent LinkedIn?\r\n\r\n\r\nthis is amazing. Okay, keep going.\r\n\r\n\r\nAbbi Perets (26:35.054)\r\nAnd then I gave it dumb things like when outputting content for me, don't output the content as code and don't put it in quotation marks. It's just an extra step for me to delete it.\r\n\r\n\r\nNikolas Hulewsky (26:44.05)\r\nI've had to start telling chat GBT, don't give me emojis. Chat GBT is like emoji obsessed, like stop it.\r\n\r\n\r\nAbbi Perets (26:49.334)\r\nYeah, stop. Yes. So I tell it all the time. So then I tell it, make sure that in your writing, you don't confuse the dash and the hyphen. Because I was like, I do not need to go manually correcting all of your hyphens into dashes. Like, I'm a writer. I care about these things. Yeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (27:01.798)\r\nSo like, know what an dash is. I mean, I know, but for people who don't know, what is an, I don't know what an dash is. What is that?\r\n\r\n\r\nAbbi Perets (27:10.51)\r\nSo an M dash is that long dash. Okay, so like a hyphen is like if you said self-sufficient, right? There's a little hyphen between those two words. Some people use a hyphen. Some, not any of our friends, like nobody we know would do that, obviously. But some uneducated people might use a hyphen in place of an M dash. The M dash is that longer dash between, like it shows that pause in the sentence. Like, I'm not gonna be able to do that.\r\n\r\n\r\nNikolas Hulewsky (27:14.578)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (27:25.937)\r\nBye. Bye bye bye.\r\n\r\n\r\nNikolas Hulewsky (27:37.222)\r\nNo, I know exactly what it is. Anybody who's seen AI output sees the dash. And like, I won't post anything with an dash because it's so obvious like, this was AI generated. I don't know why AI loves it so much, but it does.\r\n\r\n\r\nAbbi Perets (27:40.322)\r\nYes. Yes.\r\n\r\n\r\nAbbi Perets (27:48.974)\r\nNo, no, no, no, no, no. See, like, I'm gonna correct you there. Those of us who are professional writers were using the dash long before ChatGPT came around.\r\n\r\n\r\nNikolas Hulewsky (27:59.086)\r\nI know, but I'm not a professional writer. so if you see me posting crap with dashes or somebody like me, who's like, I'm an entrepreneur turned content creator. Yeah. dashes from an AI generated, whatever you're a writer, dude. Like, of course you're using the dashes.\r\n\r\n\r\nAbbi Perets (28:11.834)\r\nBut we are like, will cling, you will pry our emdashens from our cold dead fingers. We love them and we do not want them. So yeah, I love, I love them.\r\n\r\n\r\nNikolas Hulewsky (28:18.994)\r\nThe problem is they're great. I do love the dash, but I can't use it anymore because of\r\n\r\n\r\nAbbi Perets (28:27.246)\r\nI'm so, well, okay, so I, like literally long before AI was a thing, I was a person who, and I, this is, I have records of this from before the AI years. The M dash is my favorite punctuation mark. Like if I were, you know, when I write my first book, it will be dedicated to the M dash. So, just saying. Okay.\r\n\r\n\r\nNikolas Hulewsky (28:43.89)\r\nIt's because you and I are very similar, by the way. It's because you speak with M dashes, just like I do. So it's like, okay, it's not the end of the thought. There is just a pause here between this beginning piece and the last piece. So anyways, I get it. It's my favorite piece too. That's why it hurts me so much that I can't use it anymore. Anyways, all right, so don't...\r\n\r\n\r\nAbbi Perets (28:49.954)\r\nYes. Yes.\r\n\r\n\r\nCorrect. Correct.\r\n\r\n\r\nYes. There you go. There you go. OK.\r\n\r\n\r\nneed a guideline for decision making support because I noticed that my Claude was like at the end of everything it was saying, was like, would you like to one, two or three? And I was like, I'm overwhelmed when you tell me that. don't give, instead of giving me multiple options, just tell me what we should do next. I just want you to boss me around sometimes. So yeah, and then some writing guidelines. Like I think I called this writing like a human or no, this was revision feedback. don't, don't tell, because it tells me all the time like Abby, this is amazing. I'm like, thank you.\r\n\r\n\r\nNikolas Hulewsky (29:23.184)\r\nYeah. Yeah.\r\n\r\n\r\nAbbi Perets (29:37.172)\r\nI've actually been writing professionally for 25 years. So like I have a mom who will tell me everything I write is great. Like I need more like constructive criticism from you, right?\r\n\r\n\r\nNikolas Hulewsky (29:46.086)\r\nThat is so, I love what you just said there, because I've had to start doing that with chat GPT in particular as well. It's like, thank you for the compliment, but I need you to be as impartial as you can and give me critical feedback. Part of that is the, is like just insecurity, because you're like, you're just saying that to be nice, right? And you don't really think that you're that good. But part of it is also like, give me the freaking critical feedback. So I like that you've included that.\r\n\r\n\r\nAbbi Perets (29:59.01)\r\nYes.\r\n\r\n\r\nAbbi Perets (30:04.29)\r\nYes. Right. Right. Right. Yeah, 100%.\r\n\r\n\r\nSo yeah, avoid effusive praise, constructive criticism format, how to do that. And then yeah, and I gave it like guidelines on the way that I write. there's an actual here, there's a document in my, so then we have the project knowledge. So these are all the things that I've added in for Claude to reference as like my reference base. And you can see I've used up just about half of its knowledge capacity with these documents and I'm constantly refining these.\r\n\r\n\r\nNikolas Hulewsky (30:34.45)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (30:40.914)\r\nWow.\r\n\r\n\r\nAbbi Perets (30:43.348)\r\nSo like every every two or three weeks I'll sit down and I'll be like let's review the documents in the project knowledge and I'll have Claude help me like let's go through and see what looks outdated what looks like we could update it and what can we get rid of?\r\n\r\n\r\nNikolas Hulewsky (30:51.932)\r\nMmm.\r\n\r\n\r\nAnd the documents and the project knowledge are going to be like you. It's like, this is how I write. These are things that I've referenced. It's specific to you.\r\n\r\n\r\nAbbi Perets (31:05.725)\r\ndifferent things.\r\n\r\n\r\nThis is like, are my recent emails to my email list. So they are like my most recent emails so that it can draw on them. My most recent LinkedIn content. This is my lead magnet, the hidden money map. Some reality check session insights. So like the consulting call that I offer clients is a one hour call called a reality check session. So this went through a whole bunch of reality check sessions that I've done with multiple clients and identified the strategic patterns.\r\n\r\n\r\nNikolas Hulewsky (31:19.815)\r\nMm.\r\n\r\n\r\nAbbi Perets (31:37.4)\r\nthings that you always do in reality check sessions, know? Strategic story extraction framework. I have, there's one in here that's called, here.\r\n\r\n\r\nNikolas Hulewsky (31:46.578)\r\nSo you like wrote a framework of this is how you pull stories out?\r\n\r\n\r\nAbbi Perets (31:51.362)\r\nWell, it analyzed how I did it and then it said, let me, like, you know, I said, if I want you to, if I want to offload some of my work to you, like when I'm really busy, this, here's what I started with and here's what I got to, can you magic that? So I gave it voice and style guide writing like a human. This one's probably pretty funny. So again, this is how Abby Parrots writes, you know, so I say things like, gah, listen, okay, but seriously.\r\n\r\n\r\nNikolas Hulewsky (32:06.002)\r\nYeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (32:19.856)\r\nHahaha!\r\n\r\n\r\nAbbi Perets (32:21.46)\r\nSo avoid overused phrases like, here's the thing, or the truth is. I like using all caps. Deploy dashes freely.\r\n\r\n\r\nNikolas Hulewsky (32:24.146)\r\nThank\r\n\r\n\r\nNikolas Hulewsky (32:31.259)\r\nI'm assuming that you uploaded a bunch of your content and then asked Claude to do an analysis and create this.\r\n\r\n\r\nAbbi Perets (32:35.756)\r\nI did it. I did, and then I went through it and I changed things. So like make pop culture references, then immediately comment on them. Show your age and experience. Like I say things like I'm very old, know? Question your own word choices in real time. Like this is how I do things, right? And I wanted it to, so I can literally, an instruction that I can give Claude at this point is make it more Abby. And it does. It's so good. It's so good.\r\n\r\n\r\nNikolas Hulewsky (32:39.804)\r\nSure. Wow.\r\n\r\n\r\nNikolas Hulewsky (32:55.73)\r\nMm-hmm.\r\n\r\n\r\nAbbi Perets (33:06.218)\r\nSo yeah, here, what to ruthlessly avoid, business jargon, thought leadership templates, what was it, overuse, yeah.\r\n\r\n\r\nNikolas Hulewsky (33:06.429)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (33:15.42)\r\nSo can this function as a chat bot? Like, could you chat with Abby? He's like, hey, I'm trying to figure out how to launch my freelance business.\r\n\r\n\r\nAbbi Perets (33:20.182)\r\nYou know, there probably is a way to similar to like GPTs. There's probably a way to do that. I know that Claude has a console that I could mess around with. I just haven't gotten there yet. I probably like, it's something that I'll do eventually, but for now, like I'm still alive, so you can talk to me.\r\n\r\n\r\nNikolas Hulewsky (33:27.58)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (33:34.002)\r\nInteresting. That's not, no.\r\n\r\n\r\nNikolas Hulewsky (33:42.14)\r\nSo the thing I love about this, I'm going to tell you an analogy. Well, now I'm talking to a writer. So you're like, you're using that word wrong. that I think that you will like, and I think that you will use, and this is like the perfect illustration for it. I think people don't know how to think about AI. I think they think AI is just a better form of Google. And the way that I like to contrast the two is Google is a librarian. You go to Google, you go to the librarian and you're like,\r\n\r\n\r\nAbbi Perets (33:46.124)\r\nYes. No.\r\n\r\n\r\nAbbi Perets (33:54.294)\r\nOkay. All right.\r\n\r\n\r\nAbbi Perets (34:09.272)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (34:11.972)\r\nI want to learn about the fall of Rome. How do I do that? And the librarian says, go to this section, pull these books, these are the authors. And then you go and you sort of self study and you learn that stuff. AI is a PhD level employee that you have trained that can execute a task. And when you ask it, tell me about the fall of Rome, it doesn't tell you where to go. It tells you literally about the fall of Rome. And then you can have this interactive experience. That's what this is. Like this is, this is an employee.\r\n\r\n\r\nAbbi Perets (34:14.072)\r\nMm-hmm.\r\n\r\n\r\nAbbi Perets (34:21.752)\r\nMm-hmm.\r\n\r\n\r\nAbbi Perets (34:26.474)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nAbbi Perets (34:33.804)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (34:42.404)\r\nAnd the project summary is essentially the job description. Hey, this is how I want you to act. These are the things that I expect of you. This is the output that I want. And then all of the context here is like what you would have trained an employee on. like, this is how I write. Learn me. this is incredible. This is a really, really, I love how you've walked me through setting this up.\r\n\r\n\r\nAbbi Perets (34:45.248)\r\nMm-hmm. Right.\r\n\r\n\r\nAbbi Perets (34:50.39)\r\nRight. Right.\r\n\r\n\r\nAbbi Perets (34:58.965)\r\nYes.\r\n\r\n\r\nAbbi Perets (35:04.61)\r\nThank you. I really, you know, I think of Claude, and I have often told people this, again, like you said, people think of it incorrectly. I think of Claude as...\r\n\r\n\r\nI spend a lot of my time here. My books are my friends, right? I'm in this space and I don't have other people to talk to. I don't have other people to bounce ideas off of. Claude sometimes is that person for me. I can bounce ideas. can say, think I should do it? Because I've given it enough context, I can say, okay, I'm thinking of posting this on LinkedIn. What do you think? Claude will be like, okay, so that has nothing to do with what you say you want to achieve.\r\n\r\n\r\nachieve. If you want to feed your ego by posting it, sure. That's allowed. You're allowed to do that. But do it knowing that that's what you're doing. You're not furthering your business goals with that post. Or I'll say, I'm thinking of commenting on so and so's post. And they'll be like, really? Really? That's what you think is a good use of your time right now? It keeps me in check. So yeah.\r\n\r\n\r\nNikolas Hulewsky (36:05.318)\r\nWell, yeah, if this gives you one, like people who are listening to this thinking, I'm not posting to LinkedIn. Why would I use this? You know, I think of it as you could, I'm sure there's a better way to do it, but you literally could just create a project. That is your, I'm from the medical space, your intake coordinator and the project prompt. can't remember the name of it instructions.\r\n\r\n\r\nAbbi Perets (36:11.822)\r\nyou\r\n\r\n\r\nAbbi Perets (36:25.344)\r\npercent.\r\n\r\n\r\nAbbi Perets (36:30.104)\r\ninstructions.\r\n\r\n\r\nNikolas Hulewsky (36:30.194)\r\nYou know, talk about this is the role of the coordinator. And then all the documents you upload are like how to use the electronic medical record system. What the fax machine number is like codes, like all of those things. And so then you get a new patient, you can enter it in and it quickly gets you 80 % of the way there and then you can take it the other 20%, but there's a million things you can use this for.\r\n\r\n\r\nAbbi Perets (36:37.068)\r\nYes. Yes.\r\n\r\n\r\nAbbi Perets (36:49.974)\r\nAnd it even can be, like again, for me when I said this is where I'm gonna figure out my life, like I will literally, sometimes in the beginning of the week, I'll be like, listen, there's craziness happening. Here's all the things that are on my mind. And that's when I will pull in the mobile version because you can just talk to it, you know? So I'll just, I'll be like, I'm just gonna throw some stuff at you and you help me figure it out. So I'll be like, okay, here's what's going on this week. I gotta do these 47 things for work plus these 53 things for my children plus I have to be\r\n\r\n\r\nNikolas Hulewsky (37:05.286)\r\nHmm. Yeah.\r\n\r\n\r\nAbbi Perets (37:19.248)\r\nat this appointment at this time, help me make sense of this because I'm feeling overwhelmed. And it will just take all of that and be like, okay, let's figure it out.\r\n\r\n\r\nNikolas Hulewsky (37:28.274)\r\nTell me, is the context, I don't know, the project, I don't know what words to use, okay, Abby, the files that you've uploaded, how much can you upload? Like, is it measured by tokens? Is it measured by...\r\n\r\n\r\nAbbi Perets (37:39.213)\r\nYes.\r\n\r\n\r\nAbbi Perets (37:45.576)\r\nIt's an excellent question. see, project knowledge is currently limited to Claude's maximum context window size, which does not really tell us very much.\r\n\r\n\r\nNikolas Hulewsky (37:53.65)\r\nOh, so Claude's maximum context window size is 200,000 tokens.\r\n\r\n\r\nAbbi Perets (37:59.51)\r\nOkay, I don't actually know what that means in real life, but. okay, okay. So, like, you know, it tells me I've used 40 % of my knowledge capacity. I'm good, like, and again, I try to keep it around that, like, having used half of it. So, I'll go through things fairly regularly and call out, so, what I don't need.\r\n\r\n\r\nNikolas Hulewsky (38:02.777)\r\nA token is like a character.\r\n\r\n\r\nNikolas Hulewsky (38:22.482)\r\nOkay, this was awesome, Abby. Where can people find you?\r\n\r\n\r\nAbbi Perets (38:27.17)\r\nYou can find me online at successfulfreelancemom.com and I'm probably the only avi parrots on the internet, so if you Google me, you're gonna find me. And I answer my own email in a fairly almost timely manner most of the time, let's say.\r\n\r\n\r\nNikolas Hulewsky (38:43.154)\r\nI'm telling that most of the time. I love it. Okay.",
  "metadata": {
    "duration": "",
    "date": "2025-04-22",
    "platform_source": "Google Drive"
  }
}