{
  "episode_number": "83",
  "episode_title": "Why This Entrepreneur Paid $9.2M for a Domain with Jesse Tinsley",
  "guest_name": "Jesse Tinsley",
  "business_name": "Recruiter.com, Before You Apply, Employer.com, Bounding Jobs, EOR",
  "transcript": "﻿Nik (00:01)\r\nAll right, Jesse, welcome. Welcome, my friend in economics. Why don't you start by giving us an idea? You run five companies right now, personally. What's wrong with you?\r\n\r\n\r\nJesse (00:10)\r\nYeah. Yeah. Something like that. We have a litany of different companies from, so we own, we own and operate a few different companies. We've done a bunch of acquisitions and grown organically off, offhand, recruiter.com, before you apply.com, employer.com. And there's a bunch of products underneath those that, that basically serve as much different things from EOR, payroll, background checks.\r\n\r\n\r\nNik (00:17)\r\nWhat are they?\r\n\r\n\r\nJesse (00:40)\r\non-demand recruiting, that's the high level overview, but it's basically like a full suite of solutions for like enterprise and SMB customers that grow. Anything they need for their global workforce solutions, including actually vendor management systems as well, which is also a pretty big vertical for us as well, but less sexy and probably less known than most other products we do.\r\n\r\n\r\nNik (01:06)\r\nquick, I'm gonna, I'll edit this part out. If you have anything open like YouTube, Twitter, Instagram, you're going to still record locally just fine, but it may look like there's a delay. So I would just say close anything that is potentially drawing a bunch of data. so, can I offend you?\r\n\r\n\r\nJesse (01:33)\r\nNo, you're good. You're going to edit it. So I was just closing some.\r\n\r\n\r\nNik (01:36)\r\nYeah, okay. I was like, like, shoot, I didn't think that was that bad.\r\n\r\n\r\nJesse (01:40)\r\nokay.\r\n\r\n\r\nNik (01:44)\r\nOkay, so the five that are under that umbrella, it's outsourced or out, yeah, outsourced HR solutions, essentially, recruiting.\r\n\r\n\r\nJesse (01:56)\r\nYeah. So, just to take a step back, we started in service business entirely. And then we saw over the last few years, customer demand for a lot of things that we were already doing, which was vendor management. We were in lot of relationships with other services companies that did other things and issues. And so we ended up buying a vendor management solution called Bounding Jobs. They had raised a lot of money from Braylock and Excel.\r\n\r\n\r\nSo they're now part of our company, which is really exciting. It's a new announcement. So that'll basically become our employer.com VMS. We also spent $9.2 million to buy employer.com. And that is a pretty big domain for us. And by the way, Nick, you can cut this part, so I'm not sure what you would do. But the part there is a bit of a social hack. We're basically saying we paid $9.2 million for employer.com. We did not.\r\n\r\n\r\nThat'd be a ridiculous price to pay for that domain. But that's what's going to get live with a bunch of my friends on social. They're going to flame me for it to get good, like engagement. So if you want to flame me when it comes out, I had Jesse on and he talked about like how he's dumb enough to pay 9.2 million for a domain. Like if so, if you want to post that next week with the press, I'll give you a heads up on the press release. I just have him on and he talked about how dumb it was, but here's why he did it. we really paid like 450 on them, but for context, but it's an inside joke. Baki and a bunch of.\r\n\r\n\r\nNik (03:08)\r\nbeautiful.\r\n\r\n\r\nyou\r\n\r\n\r\nJesse (03:25)\r\nChris Bocchi, I'm sure you've seen on social Twitter and a bunch of folks are gonna flame me for it. It's already teed up, so it's gonna go viral. That's why I saying if you wanna release this around that timeframe, it should get some good traction, because people are like, what the fuck is he thinking? the backstory there, yeah, some pretty social flouts, troll myself basically. So anyways, I'll continue, but I just wanna give that context, because I didn't, you're probably thinking in your head,\r\n\r\n\r\nNik (03:39)\r\nDone, done, that's amazing. That's amazing.\r\n\r\n\r\nI'm\r\n\r\n\r\nYeah,\r\n\r\n\r\nJesse (03:58)\r\nYeah, so how do you want to segue from there?\r\n\r\n\r\nNik (04:03)\r\nSo I'm going to start by asking you question is what I'm going to do. But I have some random hold on a second. This is irritating. What is going on?\r\n\r\n\r\nDo you have any VA's?\r\n\r\n\r\nJesse (04:23)\r\nI, do not.\r\n\r\n\r\nNik (04:27)\r\nSomeone's trying to log into my...\r\n\r\n\r\nAnyways.\r\n\r\n\r\nSo you're doing it. All right, I'm back. I'll get us kicked. All right, so I'm an idiot and I'm just trying to follow along. So you have recruiter.com. You've now just purchased employer.com. You have a vendor management solution that you have as well. That's three. What are the other businesses that you have under the umbrella?\r\n\r\n\r\nJesse (05:01)\r\nYeah, good question. So we have beforeuapply.com, which gives you like insights to companies before you apply to them, just how it sounds. And it's a little bit better than like looking at Glassdoor or other sites where you basically can look at like the people that are just really upset on the extreme ends of both spectrums, either really love working there or whatnot. Before you apply basically allows you to look at like actual like managers and how they run those different teams before you actually engage with them in a recruiting process.\r\n\r\n\r\nsaves a lot of time and energy. So that's one of have the vendor management system, as I alluded to with Downing Jobs. We have EOR, which is employing global workers anywhere in the world, as well as global contractors. There's a few other products underneath there, but that's the quick short version.\r\n\r\n\r\nNik (05:53)\r\nOkay, I'm going to ask you questions later about recruiter.com and employer.com because those are just freaking amazing domain names to have. first, want to start, you were in recruiting for, let me look here at my notes, Coinbase, 23andMe, Protocol Labs. So you had experience in the space. And one of the things that many entrepreneurs face is like, they want to become an entrepreneur for a long time and then there's a trigger moment. There's something where they finally make the jump. You were working at these tech companies, you probably paid well.\r\n\r\n\r\nmaybe had some stock, maybe had some equity. When did you leave and why?\r\n\r\n\r\nJesse (06:27)\r\nYeah, so to take it back a bit before that, I've always been pretty entrepreneurial. Both my parents are entrepreneurs. Usually with SMB, like in small businesses, my dad runs a construction company and my mother ran a small recruiting agency. So grew up in Silicon Valley and I was surrounded by folks that were really successful entrepreneurs like Steve Wozniak, for example. I went to school with his kid, his son.\r\n\r\n\r\nBut there's lots of folks like that growing up in the Bay Area. was just normal being around those folks. And so I started my first business when I was, my first company when I was 18, a social like geolocation app in college, and then ended up dropping out starting Job Moms. So when I was working at these companies, I was actually already starting my, I had already started my company as a consultancy. Job Moms became Recruiter.com and all these things you see today, we completely booted up it.\r\n\r\n\r\njust took it to a different level. the great thing I think about like working with those companies, I saw a bunch of unicorns get developed by 23andMe, Coinbase, Stellar Development Foundation, Protocol Labs, all in there really small and same with like Scale AI, I think it's on there, but it was early there, the largest, know, of the fastest growing AI companies in the world right now. And so you get to see how those companies operate, like talent density and everything else in the network. And so now we've...\r\n\r\n\r\nbrought along those folks that are just amazing operators and even founders into our businesses and scaled those up even further. And we're 100 % bootstrap, so that's a pretty big outcome for us, I think, compared to having...\r\n\r\n\r\nNik (08:09)\r\nyou go from hey, I'm a recruiter at these companies, you've got your side hustle. I'm gonna call it a side hustle. get like it was your business, right? But you're recruiting these companies, you're running. What was name of it? Job mobs?\r\n\r\n\r\nJesse (08:23)\r\nYeah. Job mobs. M-O-B-Z.\r\n\r\n\r\nNik (08:25)\r\nWas that the name?\r\n\r\n\r\nI'll tell you.\r\n\r\n\r\nJesse (08:33)\r\nWe're, yeah, cut out, cut out for a second.\r\n\r\n\r\nNik (08:34)\r\nBueller area. you're sorry, sorry. Okay, so you're, you're at these tech companies. And you've got I'm gonna call it a side hustle, but it's your business. Why not just go all in on the business from the start? Like, why did you get into tech and keep the business on the side?\r\n\r\n\r\nJesse (08:55)\r\nI think it's a, why did I keep it on the side per se? Well, business was like mainly a consultancy. So we had lots of consultants out already, like myself included obviously. But we basically did like SWAT team type deployments where we'd help companies scale. So we'd go into a Coinbase and help them scale from like 200 to a thousand. We did the same thing, ConsenSys and Box.com and a bunch of others.\r\n\r\n\r\nAnd I would lead those teams. And it actually worked out really well, one, like from a learning perspective, but also I also got equity and other payments from these companies that way it was basically a way to boost around when you don't have anything and you don't have a technical background at the time, raising money would be very difficult to go build certain things. So it was just a hack to get to some next level. And I think at the time too, if I'd started other software companies that hadn't like hand out as well, so it was.\r\n\r\n\r\nI've always been pretty entrepreneurial. had plenty of failures. It looks like it was one big success, but that's not always the case as you know, Nick. Like it's never that linear. There's always something, no matter who you are. So, yeah.\r\n\r\n\r\nNik (10:03)\r\nWhat? So you founded the original company in 2012. And then you were just working with these other companies to sort of do your SWOT approach where you come in, you help them scale to a certain size, and then you kind of move on to the next one, you're just gathering experience at what it is that correct?\r\n\r\n\r\nJesse (10:24)\r\nTotally. Yeah. mean, but also I wasn't sad. I worked, I bootstrapped that bit working as a firefighter on the weekends. I worked like two or three days on four days off and I bootstrapped my company that way. So I didn't need a steady paycheck. So I was working like a madman for a couple of years, like seven days a week, know, pretty insane hours, but it worked out obviously in hindsight.\r\n\r\n\r\na lot of the cashflow and everything else in customer relationships and friends, people I call friends now over the years, are all our customers from the same software. So we bought and built these solutions around customer needs that didn't exist in the market. And so we've been able to grab a really large market share there with some amazing customers like world-class brands that folks would definitely know quite well, like HubSpot, Chipotle, customers like that.\r\n\r\n\r\nNik (11:16)\r\nUh-huh.\r\n\r\n\r\nJesse (11:17)\r\nor large customers as far. So that's pretty exciting. Like I couldn't have done that when I was 22 or three or four, but 10 years into my career, 35, much easier with those rules.\r\n\r\n\r\nNik (11:32)\r\nSo at what point did you start to expand into this mini hold co, if you will, right? So you've got the original job mobs. At what point are you like, all right, first acquisition.\r\n\r\n\r\nJesse (11:43)\r\nYeah, totally. So it's funny you mentioned it. Like I didn't even know what hold code was like two and a half years ago. No idea. Like a completely oblivious, like didn't care about it and didn't even think. And then I'm like, we're buying companies and I saw like people like, are you doing like a whole, they're asking me questions about hold codes. And I was like, exactly, exactly what it is. I I didn't even know like what.\r\n\r\n\r\neven know who Andrew Wilkinson was. I knew he was a designer for any service, which is, I looked at it until like six months ago and I was like, wow, don't know who anybody in the Holocaust base is, right? So it wasn't through design. was kind of just by accident. But to answer your question, we started doing acquisitions. I started exploring paper, LBO, situations at the end of 2022. So I knew there was a market inflection point, like change in early mid 2022. And in fact, I called it out. It's pretty unpopular on Twitter.\r\n\r\n\r\nNik (12:09)\r\nYeah\r\n\r\n\r\nJesse (12:35)\r\nwith my own internal team, thought it was crazy. So, but we sat on a bunch of cash, didn't raise pay. Like we basically knew there was some storm coming based on like, we have a ton of data right around jobs and also hiring. So when hiring goes down and job postings go down, can see a linear trend of what's going to happen before anyone else. So that combined with previous like a downturn experience, think basically.\r\n\r\n\r\nhold the plug on spend and we sat on cash. So basically by the end of 2022, I knew I was going to do something with, I thought the market opportunity from like COVID, for example, I had missed. I thought there was lots of opportunity to make a lot of money as an entrepreneur that I didn't capitalize on that you could have during that timeframe. And I didn't want to make sure that this downturn was different for me, that I would go capitalize. So when everyone's playing defense and licking their wounds, we went out and played offense and we've done.\r\n\r\n\r\neight acquisitions in two years and we've got another, we've got 500 million in pending acquisitions right now.\r\n\r\n\r\nNik (13:34)\r\nCheers,\r\n\r\n\r\n500 million in pending acquisitions?\r\n\r\n\r\nJesse (13:44)\r\npending acquisitions moving toward, they're in LOI, they're going towards definitive agreements. Can't guarantee that, but that's what's happening. Yeah.\r\n\r\n\r\nNik (13:49)\r\nThat's incredible.\r\n\r\n\r\nAre you still a firefighter too?\r\n\r\n\r\nJesse (13:54)\r\nI'm actually not a firefighter at home. I'm the CEO firefighter at work virtually and at home rounding up kids, but not, not anymore. Unfortunately, it's a lot of fun. Kudos. All those folks.\r\n\r\n\r\nNik (14:05)\r\nOkay, you've got job mobs, 2020. Give me an idea before you started sitting on cash. What was the size of the company? How many employees did you have? Can you give me like top line revenue?\r\n\r\n\r\nJesse (14:19)\r\nYeah. Within, my best without pulling up like the actual data, I think it's like 2022 we're doing, we probably would have finished the year around.\r\n\r\n\r\n7 million, 8 million, somewhere in that range, I guess, is my guess.\r\n\r\n\r\nNik (14:37)\r\nYeah. All right. So you're, you're good size. I mean, for, for a services business, that's, that's really, really good size, but that's freaking actually hard when you're in that, like five to 10 million space.\r\n\r\n\r\nJesse (14:43)\r\nTotally.\r\n\r\n\r\nTotally. It's not easy. There's only like 40 people, 50 people, like 50 people is my guess.\r\n\r\n\r\nNik (14:51)\r\nYeah. So you make the decision, all right, I'm gonna start sitting on some cash, which was very smart. Job mobs ends up becoming recruiter.com. Was recruiter.com the first acquisition that you made?\r\n\r\n\r\nJesse (15:06)\r\nYeah, it was pretty crazy to the story there. They're a public company. So this isn't like some trivial acquisition for your first one that you'd have to be insane. I wouldn't recommend it to anyone to do a attempt to buy a publicly traded company or entities or anything. I learned a ton, by the way, like talk about jumping into the deep end to your first acquisition. So we did the first acquisition. That was mainly just carving out their services business. That was the first one that's at least public. We did some other smaller.\r\n\r\n\r\nacquisitions, they're like just aqua higher point things. But so we did that in March of 23. And then we closed a bigger deal with them in August 2023, which basically take a lot of the brand assets around recruiter.com private. And that was, you know, that took us a year and half to close, I think I just closed this last August.\r\n\r\n\r\nNik (15:56)\r\nWhat happened? Why were they in trouble? What changed for them?\r\n\r\n\r\nJesse (16:01)\r\nI don't know their internal circumstances. I don't want to speak to those particularly, but I do know that a lot of businesses, talking generally here across the entire HR tech, have been caught off guard with the macro trend going from an insane uptrend of hiring in 2021, 2022, the best it's ever been to the worst it's ever been. had a CEO mention this week.\r\n\r\n\r\nThey mentioned that like this is worth 07, 08, 09. You know, they're around then, and like this is a worse downturn for tech hiring at least than it was then. So I'm going to give you an idea of the landscape, how quickly things shifted. And so I think a lot of companies, even, you know, we've acquired companies, we have a few others, obviously pending as I mentioned, but we've made a bunch of other offers. I've talked to hundreds of companies in the last two years and every one of them, except for us, is basically declining revenue. Like the revenue is going down.\r\n\r\n\r\ncustomers are turning and it's just kind of a bleeding, you know, death by a thousand cuts. And so it's not like any, it's not that, it's not that founders are doing anything wrong or, you know, if the companies are doing anything wrong, it's just simply a macro economic trend that you don't.\r\n\r\n\r\nNik (17:14)\r\nSo, recruiter.com, were they doing what you're doing? Were they a competitor to you or were they doing something totally different and you've just repurposed the brand into what you do now?\r\n\r\n\r\nJesse (17:24)\r\nAt the time, yeah, they're definitely doing something similar. That's why we acquired some of their services businesses that were doing recruiting as a service. they're really good, really beautiful brand, millions of followers on social media, the largest LinkedIn group in the world. It's a beautiful, beautiful company and one of first groups I joined on LinkedIn. So really good legacy brand and everything else.\r\n\r\n\r\nAnd that kind of unlocked everything. So if I'm a small business owner, let's say like talking like your audience, like folks that are building companies, I think the biggest thing that that unlocked for us and allowed us to go do all of these other acquisitions because the brand and image of that made us look a lot bigger, right? We're only doing 7 million. We're doing a lot more revenue now. But the point being is that at the time we were relatively small. Yeah, we had cash. We're sitting on cash. We good margins, but it allowed it and locked all these other things that we've done to date.\r\n\r\n\r\nthat, made a huge impact. And so now when you look at our, our current revenue, it's mostly ARR and we're able to go punch way above our weight. and I think that's just a big thing. So if I was to spend money as an entrepreneur, like I would go buy an employer.com or recruiter.com as early as possible and get that brand and that like image. when you, employer.com for example, before we bought it didn't exist. But if you went and told your mom or dad, Hey, I own employer.com I bet.\r\n\r\n\r\nThey would say, I know that I know of them, even though it didn't exist a month ago. And that's the point. You spend the money because you get the image, right? get the brand and that's worth, you know, that's an enterprise customer. might spend a half a million, million, two million bucks on it. Obviously it's hard to get that cash, but let's say you have it. That return, the ROI on that is huge. You might get an enterprise customer and pay you half a dollars a year. And for me, that's worth every single dollar.\r\n\r\n\r\nNik (18:51)\r\nYeah.\r\n\r\n\r\nSo, years 2022, you're on cash, your $7 million company, and you end up acquiring recruiter.com. They're publicly traded. How did you even get in the room with them? How did you even know that they were for sale? How did you even finance it or afford to purchase them? There are just so many questions that come up for me, because I'm a small business owner. I would never be able to go to, I don't know, fashion.com and be like, hey, can I purchase you? How did that whole story happen?\r\n\r\n\r\nJesse (19:43)\r\nYeah. So there's many facets, like parts to it. My best like reconstruction of it has been one like an award for like top RPO company with the HRO today at the end of 2022, which is like big in our niche vertical space. Yeah, I'm using jargon. ask me if you don't know, it's not a common knowledge recruitment process outsourcing. It's basically what we focus like that SWAT team building out of companies long-term or short-term.\r\n\r\n\r\nNik (19:58)\r\nWhat's RPO? I don't know what that means. Sorry.\r\n\r\n\r\nJesse (20:14)\r\nAnd so that kind of got us on the map. I'd already met with those folks previously. And I think they had had some other like paths forward they were looking at and that kind of talked about maybe some, you know, I met them and we'd had conversations to try to get something done, like a partnership or something similar previously.\r\n\r\n\r\nMarch, 2023, and they'd had some other things they were exploring. And so we just got the right place, right time, right? The whole market came down and all basically like, think our internal like framework for the last two years is we pretty much are the market. like, like every founder you talk to when you're doing &A, I'll say they have another offer. Right now that is maybe, maybe true, but not in the sense that you think it's all really like, there is no one else making like fair offers to founders.\r\n\r\n\r\nNik (21:07)\r\nWell, I mean, so as an outsider, I'm like, all right, you're a $7 million company. They're publicly traded. Now there are lots of publicly traded companies whose market cap is not $7 million, right? They're micro caps and they're, you know, they're very small. But I, it just has the air of, they're, they're much bigger. Recruiter recruiting.com is much bigger than, than Gussie's company, right? They, they, why not go to indeed,\r\n\r\n\r\nor Glassdoor or Monster or any other job servicing company and sell to like a larger brand like that. Like how did you even get to the space where they weren't even entertaining other offers? All of a sudden you're talking to them. Were they a lot bigger than you or were they just not as big as everyone thought and they went public to have a liquidity event for the people who founded it?\r\n\r\n\r\nJesse (21:58)\r\nI have no idea about the reasons for going public. But I can tell you why we win lot of acquisition deals empirically, compared to Indeed or Glassdoor, which are both lots of friends at both companies. Good companies, just to clarify. I think this is true of all large strategics. They move really slow. think so. When you have a big financial turn, and a lot of companies were over 21, 22, and this is not specific to Recruiter.com, just general statements.\r\n\r\n\r\nThey were basically like earning a dollar to earn 50 cents across companies, right? Because growth at all costs was the market was rewarding across both the private and public sector for these companies of all types. And so I think that when that turned in, let's say early 2023, early 2022, lot of folks were caught off guard. And so\r\n\r\n\r\nWhat's happened is now you have a secular decline. like the in deeds in the last doors, the world aren't buying companies. They're going to move really slow, especially when they're, they have decreasing cash flows on their in cash sheet, right? An increasing burn, decreasing revenue. talk about class door and indeed, right? Like, or revenue growth flat, right? So it's basically, creates a thing, a situation where like those companies aren't acquiring. If they are, it's going to take six months. And so, well, we've done a really good job of it. It's like.\r\n\r\n\r\nWe'll pay, like we tell founders and why we've closed a lot of deals, we'll close in 30 days. We're going to make certain things like stringent on terms so that we don't get screwed since we're moving so quickly. like that's the difference is like one, we've never done a deal where we've told somebody, we're going to do X, Y, Z or give you this price and backed out. So it's a reputational thing. then two, there's no, like that's the big thing with like P right. You're to get retraded on. It's almost 90 % guaranteed.\r\n\r\n\r\nthe end of whatever process they put you through. And after you spent a quarter million dollars on lawyers, finance folks, they're gonna say, Hey, by the way, Nick, this is your real offer. Take it or leave it. That's after you've told all your friends, family. So that's just, it's not a good experience you've thought about from sales process. So what I do is I try to educate founders and say, Hey, this is what it is. This is what we're giving you. This is what your private equity offer is gonna look like. This is why they're doing it. And this is what they're going to give you. And most of the time I'm right. And even the founders that do go with the private equity offer usually come back to us and say, you know what?\r\n\r\n\r\nIf you're still interested, we'll buy. And that's kind of the secret sauce of how we do deals and why we win deals. Not specific to just recruiter.com, but all deals that we do within a certain degree of plus or minus on some different terms.\r\n\r\n\r\nNik (24:35)\r\nCan you give me an idea how big was the recruiter.com deal?\r\n\r\n\r\nJesse (24:41)\r\nhow big? mean, well, I think the bigger piece, they're, they have a 10 % they have 10 % of our cap table preferred shares. so it's a pretty, like basically for being bootstrapped, it's pretty, significant thing. think, they still publicly trade, I think on the secondary market. So, I don't want to share anything, but I think that that, is, a pretty\r\n\r\n\r\nvaluable outcome for them, honestly. like you compared it to our evaluation today, I think it's a, you know, all of the figures, deal in my opinion.\r\n\r\n\r\nNik (25:18)\r\nDude, that's a sophisticated transaction,\r\n\r\n\r\nJesse (25:22)\r\nDefinitely. We paid cash. I think the big thing too, like we paid $1.8 million like clothes and we paid some other some stuff along the way as well. it wasn't, it's multifaceted, very sophisticated and complex, I'd say because of the other, the time it takes, right? Just to get like, and it's nothing to do with us because we're private, but like buying anything.\r\n\r\n\r\nthat large or taking that much of an asset from a PubCo, you have all the regulators and everything else that need to approve all of that. And so it just takes a very long time. So that would be my first choice if was doing acquisition again, in terms of like the speed of which I move. If you move, it's much slower, but a good outcome, I think for everyone, all things considered at the end of the day on all sides.\r\n\r\n\r\nNik (26:12)\r\nOkay, so where you were $7 million sitting in 2022, can you give me an idea of size and scale of your companies now?\r\n\r\n\r\nJesse (26:21)\r\nyeah. didn't even like, tell you exactly. just did this last night. Actually. We're, we're basically pushing like.\r\n\r\n\r\nquarter billion valuation give or take with revenues exceeding\r\n\r\n\r\npretty large number. I don't want to say the exact revenue number yet, because it's depending on when this is even released, honestly. But I think I'm happy to share it on some of the retweets or whatever of this. I can put the updated one, but it's be a lot. be pushing well north of 100 million revenue this year. And that's mostly 99 % SaaS revenue. 100 % bootstrap, yeah.\r\n\r\n\r\nNik (27:10)\r\nAnd that's all bootstrapped.\r\n\r\n\r\nhit that, I don't think people will fully appreciate how hard that is to do.\r\n\r\n\r\nJesse (27:19)\r\nSo that's pretty, yeah, pretty insane, especially going from services pivoting like 100 % into ZAS. It's like nearly impossibility. I don't think I replicated myself. I tell, I joke with my team all the time. I'm like, if I just, if I just quit tomorrow, not that I am, but like, and just tried to replicate what we've done, couldn't do it. It would take me a long, it would take me a while, even with money, right? Even with like resourcing and networking, it would be very uphill battle to get everything.\r\n\r\n\r\nNik (27:43)\r\nDo you feel like that strategy that you had, which was for the thesis that you've had, which is like, all right, premium domain names, recruiter.com, employer.com. So I'll give you an example. Chris, my business partner and I own co-founders.com. It's not recruiter.com, right? But it's co-founders.com. And we, at the time I paid for it $65,000. And I was like, I don't know, should I pull the trigger? And looking back.\r\n\r\n\r\nJesse (28:08)\r\nI'll pay you. So I'll pay at least a hundred right now. if you want, we can write up a worksheet right now. can be a hundred grand for it. 120, can do 130. can double your money. I'll even give you some equity in my main call. Can you just leave this right now live on the podcast? Nick, it's just totally on script. That's great.\r\n\r\n\r\nNik (28:11)\r\nyou\r\n\r\n\r\nBut it was...\r\n\r\n\r\nokay. All right.\r\n\r\n\r\nDude, this podcast is just turning into Shark Tank. Jesse Sharks, today I am seeking a, you would think, yes, that strategy, premium domain names has absolutely paid off for you.\r\n\r\n\r\nJesse (28:39)\r\nYeah, definitely. would, yeah, definitely, definitely do it again. I think with any business I would buy or start or do. In fact, there's some, yeah, there's some cool folks I've met that do brokering of it. And so I'm always looking at domains depending on like what we're, you know, what we're doing. We're looking at some others right now for different verticals we're going after. So we'll definitely be announced in the next probably six to 12 months for another premium. Maybe, maybe for founders.\r\n\r\n\r\nNik (29:05)\r\nOkay. So you've got, you've got.\r\n\r\n\r\nJesse (29:09)\r\nMaybe founders.com founders.com like pay a lot of money for a lot, maybe a million. Yeah. Yeah. Not saying co-founders is like, it's good. It's very good. like, yeah.\r\n\r\n\r\nNik (29:13)\r\nDude, founders.com would be.\r\n\r\n\r\nHey, I'm stoked that we got co-founders for 65 grand. think it's a great man. But yeah.\r\n\r\n\r\nJesse (29:26)\r\nThat's a great price. You paid way better ROI than I have, for sure.\r\n\r\n\r\nNik (29:31)\r\nIf I can get founders.com for 65 grand, frickin sign me up. Okay, so recruiter.com is at least an eight figure domain name. Then you've got employer.com, freaking $9.2 million that you bought for it. Do you have a domain sickness like my business partner, Chris Kerner does? Because legitimately we pay.\r\n\r\n\r\nJesse (29:35)\r\nYes.\r\n\r\n\r\nI think most others do. Most others do.\r\n\r\n\r\nNik (29:59)\r\nWell, we spent like five grand a year just on registering the domains that he has that we don't even use.\r\n\r\n\r\nJesse (30:06)\r\nI have, I have probably like a hundred domains across like different like, so it's definitely not like five grand worth of the year. think it's like, what was that? A hundred times 12 bucks or something like 1200 bucks. So something like that. He's, he's got me beat by a couple hundred domains. sounds like, but yeah, a lot of it's a mix, a mix of things. They're like, I own recruiting and HR.com as well. Like just things that would make sense. Right. So like basically, you know, you know,\r\n\r\n\r\nthings that tie into our industry. and all the other like ancillary ones, you you know, dot nets, dot co's, all of those main domains were, were focused on.\r\n\r\n\r\nNik (30:46)\r\nOkay, do you recoil as badly as I do or Chris does at a .net versus a .com?\r\n\r\n\r\nJesse (30:54)\r\nYeah, it's just not the same good app. I wouldn't pay a ton of money for that. you know, like basically like also like think about your ideal customer profile too, like what you're doing, like how, I would suggest like it is somewhat subjective. If my customers, most of my customers are, you know, 40 to 60 years old and you know,\r\n\r\n\r\nNik (30:57)\r\nNot the same,\r\n\r\n\r\nJesse (31:21)\r\nchainlayer.com is going to like domain names, going to be really relevant to those folks. so like, but if I was selling to like chain Z, it'd be very different, right? That probably goes social media, like party to strut and more presence there as opposed to like traditional like web sales for like enterprise. So I think like, it really depends on your, your ideal customer profile. So I wouldn't say cart overarching statements of, of that, I think gives you brand authority to, even if you're selling like your course or something, who's the guy that,\r\n\r\n\r\nselling like, you know, was it courses.com for his name? Anyways, doesn't matter. I don't need to him a blog. But he had the, was it consulting.com? The consulting.com guy. have to look it up. He had that he spent much money on consulting.com, but I think it works for a litany of reasons. So\r\n\r\n\r\nNik (31:55)\r\nUh-uh.\r\n\r\n\r\nYeah, that's ringing like an egg bell. But yeah, yeah, yeah.\r\n\r\n\r\nHave you been able to measure the return on these premium domains? Obviously, there's a brand component to it of, hey, I own recruiter.com. wow, Jesse must be legit, right? But for you, I don't know. Is there a way you can measure, this is how many searches employer.com was getting per month and now I'm able to convert all of that traffic because it didn't exist before and it exists now? Do you look at it like that or is it\r\n\r\n\r\nmore of a know it establishes me it gives me credibility and now off of that credibility I'm able to build.\r\n\r\n\r\nJesse (32:50)\r\nSo the answer is definitely, I think that, so we've done a bunch of stuff. I haven't even talked about like raising a fund. We've started a fund, right? So Toonslake Growth Partners, it's not announced yet either, but something we're doing as well for like larger deals. So it has done quite a lot. I think the simple way to put it, and this has probably like never been done is we have an infinite IRR.\r\n\r\n\r\nAnd so like, you'd be like, wow, that doesn't make sense. So the reason is we bought all of these deals in a structure in which we put none of our own capital at risk for many of these deals, in my opinion, where IRR is literally infinite. So that's how good deals we've done, are in my opinion. So that makes it pretty much a no-lose situation from our perspective. so.\r\n\r\n\r\nThat's why we're going to be continuing to buy companies and raising a fund and doing that because we think that we can return a very large shareholder value to not only the top decimal, the style like of the market, but would make Berkshire jealous in their original heyday.\r\n\r\n\r\nNik (34:02)\r\nSo, okay, this is my this is my last question that we can riff on. Many people will look at these premium domain names and might have the strategy of like, yeah, I need recruiter.com. Whatever the price is, I'll pay it and I'll go raise a fund and I'll pay for it. But in hearing you describe the way that you've purchased these, there's creative deal structuring like with them. So like how\r\n\r\n\r\nHow do you think about that? Obviously, you want the domain, but also you're still being creative with it. What recommendations do you give to people who are trying not just replicate your exact strategy, but replicate the strategy of go big, buy the big assets, but don't necessarily come out of pocket a ton of cash?\r\n\r\n\r\nJesse (34:45)\r\ntotally. So, so bright. That's using like, generally, obviously there's nuance to all of that, but I think, in our, what applies for us might not apply to others, but I think the general overarching thing is we need to be pretty creative with deal structuring. So, let's just say that like I'm buying your business, let's say it does a million to be done. Right. Simple, simple services, let's say. and, you know,\r\n\r\n\r\nLet's say we be a settle on like Forex, right? Forex, for whatever the business is, let's Well, you can do like, let's say you have operating like working capital needs, right? A million dollars, let's say, that's flowing through the business. So now I can go, I can create debt attached to the business in a lot of cases, assuming at some scale, right? Obviously I do not, I've been pretty vocal about not liking SBA loans for the personal liability of it.\r\n\r\n\r\nbeen very, very vocal against it online because I think it is not great. But nonetheless, so yeah, So just remember, my carte blanche statement for that is infinite IR. That's all I would say. So not the case with SBA1.\r\n\r\n\r\nNik (35:51)\r\nI'm pissed I just found that out 30 minutes into our conversations because I would freaking love to debate you on that one, but keep going.\r\n\r\n\r\nJesse (36:12)\r\nSo you basically can, you can do a paper LDO, right? Like, so you basically do, you do a founder or like sell a note on that, right? So like a simple structure is, we're going to roll a million equity, a million, million seller note, and we're going to give you like an or now of $2 million. Like that'd be a simple structure, like a very basic one. Obviously you're like, okay, well there's no cash flows. Well in theory, but you should be having working capital flowing through the business, making like a lot of cash. So I think deals like that in this SMB space exists everywhere.\r\n\r\n\r\nboomers wanting to retire. To give you some statistics here, there's like really interesting data. I nerd out about this stuff. I read 10Ks. I look at data reports for this stuff all the time. The big thing is like what it's like 90 % of businesses fail in the first 10 years of those businesses. Only like only 20 % of them end up selling. So like even if you survive 10 years as a business, only a small subset of them actually sell. means that like out of the companies that make it 10 years, the very small select few only want, you know,\r\n\r\n\r\none in five are actually selling, which means the other four out of those funds are just shutting down. And so if I wanted to go, like I've told a lot of my friends and family, I'm like, look, I would just go buy a bunch of like local businesses, roll up two or three of them, do all seller financing. There's a bunch of older generation like boomers that want to wind down their business and they're just going to shut it down. And all that knowledge, all those customers are gone. Like you can basically go get seller financing and earn out and maybe some rolled equity. And you can just buy these businesses literally for zero down.\r\n\r\n\r\nThat's it. You could do that all over the country, everywhere. I could do that in my blindfolded, it's there for everyone that's listening to this, if you structure it correctly and you keep your deal costs down for lawyers and accountants.\r\n\r\n\r\nNik (37:55)\r\nSo two comments on that. First one is any business that I've bought that was over $100,000 transaction price, I have never paid all cash down or financed everything. There has always been a seller note, something forgivable, something rolled, some creative portion of equity in the deal structure.\r\n\r\n\r\nJesse (38:04)\r\nYep.\r\n\r\n\r\nNik (38:20)\r\nDid it What does it say?\r\n\r\n\r\nstill recording on my end. Let's I've any deal over $100,000 has always for me had a component of a seller note or something creative involved. Smaller deals in that just to get it done quickly and like not have the headache. I've paid cash but most of the time, not most of time every time over $100,000. There's something creative. But the second piece is Chris and I just\r\n\r\n\r\nwe recorded a podcast this morning and we were talking about this. Have you ever heard of pros closet? They were the Chris likened it to like car max except for road bikes. not not like how do I, how do I put this? You know, the guys who are in the spandex and riding the bikes on the road. Yeah, those, those type of bikes. So it's like a resale market and they went on a business. They raised a bunch of money and they went out of business. And he reached out to the CEO and was like, Hey, I saw you guys shut down.\r\n\r\n\r\nJesse (39:11)\r\nThank\r\n\r\n\r\nNik (39:23)\r\nI'd like to buy your email list.\" And he was like, we just agreed to terms and we just sold that to somebody else. But it's something like people don't even think about. Hey, what's happening to that customer list? What's happening to the IP? What's happening to whatever other assets you have? They're not thinking creatively. They're thinking, I got to pay all cash or I just got to come in top dollar. And I love that structure that you just laid out.\r\n\r\n\r\nJesse (39:45)\r\nThat's a great way to start if you don't have money, right? Other than that's why I'm like against SBA loans, right? So if you want to debate this, like I would start there. And then if you move up and you have a track record and you feel confident making bets, like it should be asymmetrical upside and you should feel very confident about like taking, cause you know, money against your own personal, personal, personal liability to then grow that business or businesses that you're buying. So it's a much safer way to start, I think.\r\n\r\n\r\nAnd I think with, with your point, because we've done this, there's a lot of companies that are just winding down and there's tons of IP and assets there that you could go buy for very like friendly deals. right now, especially that, you know, companies that just shut down to your point. we've done this a few times that are like a deal is we don't even announce, we'll just buy up a, you know, a code base customer list, whatever it is. and you can get stuff and also like there's,\r\n\r\n\r\nThere's actually auction houses for this too. like the other piece that people know, most people aren't aware of is that like VCs and private equity firms will have, they'll have auctions of companies that are winding down and you can buy up ARR. Like there's companies doing like 150K ARR. We could have bought it for 200K, like 200K, 200K is just, it's literally a hundred percent cash on cash return. I'd probably run it with no people. We have the bandwidth.\r\n\r\n\r\nNik (40:59)\r\nAnd you're talking about.\r\n\r\n\r\nJesse (41:03)\r\nIt was, I didn't have the bandwidth to do it because we're doing larger deals. So it's not worth like the one like trade-off is that it takes just as long to do a small deal as a large deal. Literally the same process. doesn't change anything. So it's sometimes actually harder on the smaller deals for a variety of reasons, educating the founders on the terms. But those deals are literally everywhere right now. so like across every single vertical. Yeah. definitely.\r\n\r\n\r\nNik (41:30)\r\nWhen you're you just described tech deals and I know you said this earlier, but those types of deals are all over the country. Like they don't have to be tech deals. They could be the local electrician that just shut down. They could be the local pizza company. They could like whoever it is that just shut down. They've got a customer list. They've got a history of people who have come in and out of their business over a period of time. You can go and approach them and say, what are you doing with that list? I'd love to have it. There is value there to be captured if you're being proactive on it. So like I wouldn't listen to this.\r\n\r\n\r\nand think like, that's unattainable. Jesse's talking to P and venture capitalists and he has access. No.\r\n\r\n\r\nJesse (42:03)\r\nI'll give you another nugget. Like one of the things that one of the roles I'm going be working on the next year or two is all like construction role ups for commercial construction and build outs, like electrical grid stuff, mainly to do government contracting work. But basically there's a bunch of like, there's a lack of general labor like happening in the construction industry, right? There's a huge like surplus demand, right? Building on old infrastructure. So it's not just tech that this applies to, this applies to every single.\r\n\r\n\r\nindustry in America, right? To your point, your local pool companies to pool cleaning companies to bug spraying companies, whoever, all of it is relevant. So.\r\n\r\n\r\nNik (42:40)\r\nWell, I love the approach that even though you have money, you're not being lazy with it. And you're not like, cool, good deal. Okay, here's cash. cool. Yeah, we'll pay. You know what? you want 1 million? We'll pay you 1.2 and we'll close quickly. Like you're still being stringent with how you purchase these things and creative and having them roll some seller equity like that. I just admire that so much because it is so easy once you have a winner, once you have some cash to kind of, okay, we can be a little flexible here.\r\n\r\n\r\nJesse (43:08)\r\nfrom Antelope.\r\n\r\n\r\nNik (43:10)\r\nand get out and get over your skis. So kudos to you for that. Here's the last question. Well, before I ask the last question, where's the best place for people to come find you, Jesse?\r\n\r\n\r\nJesse (43:21)\r\nYeah, my first last name, Jesse Tinsley on Twitter or LinkedIn. there the most and generally pretty active. So love to connect with\r\n\r\n\r\nNik (43:30)\r\nOkay, so here's my last question. Let's say outside of recruiting, if you were starting over and maybe even you're not even in Silicon Valley, what space are you like the most excited about or where would you go to start your wealth building life 10 years ago?\r\n\r\n\r\nJesse (43:50)\r\ntoday, today I would, I would, it's actually what I'm partially be working on with some of these, these roll-ups, it's all things rebuilding like, like us infrastructure, in electrical systems. cause that's something that's completely redone in the next 10, 20 years, not only for like AGI and AI, but because of new power systems. I think anything that touches that is going to be a massive opportunity, whether it be the tech, the construction.\r\n\r\n\r\nthe supplies, the materials, anything that touches that supply chain is going to be massive multi-trillion dollar opportunity like TAM over the next 20 years. So I think that is a absolute gold mine. I was just to even be like the concrete supply company, like that would be a big opportunity. That's where I would start, honestly.\r\n\r\n\r\nNik (44:35)\r\nI love it, man. It's fantastic. Cool. Well, I'm gonna end it there. We'll talk.\r\n\r\n\r\nJesse (44:39)\r\nYeah, really great. Thanks for having me on. Appreciate it. It's a lot of fun.\r\n\r\n\r\nNik (44:43)\r\nYeah.",
  "metadata": {
    "duration": "",
    "date": "2024-11-13",
    "platform_source": "Google Drive"
  }
}