{
  "episode_number": "203",
  "episode_title": "The Four Entrepreneurship Types: Which Game Are You Playing? with Trenton Hughes",
  "guest_name": "Trenton Hughes",
  "business_name": "Tribe",
  "transcript": "﻿Nikolas Hulewsky (00:00.97)\r\nAll right, Trenton, I'm always loved talking to you because you're one of the most thoughtful people that I know, successful, multiple exits, started a company called Tribe, which is a peer group that has many entrepreneurs from many walks of life joining it. And we were just talking about before this call that not only are more and more people getting into entrepreneurship, but they sometimes don't even know what game they're playing and that can sort of be to their detriment. And you had this post, interesting post.\r\n\r\n\r\na little while ago about sort of the four types of entrepreneurship that you're seeing and why you think it might be important for people to understand what type of entrepreneur they are. Do want to frame it up?\r\n\r\n\r\nTrenton (00:38.862)\r\nYeah. Appreciate you having me. Yeah, it is interesting. you know, been entrepreneur for a while and now that we have TRI, we have this ability to see all these different entrepreneurs and what they're doing. And I'm really starting to see that. I think there's a lot of different reasons people in entrepreneurship, but there really seems to be this breakdown of four different types of entrepreneurs that I'm personally seeing today. And so the four different types, I've kind of phrased them by, Geos. And so we've got sort of Main Street. We've got the Silicon Valley type. We've got the Austin type.\r\n\r\n\r\nAnd we got the Tomorrowland type and go ahead, sorry.\r\n\r\n\r\nNikolas Hulewsky (01:12.984)\r\nI want to pretend like I'm smart. What do you mean by Geo's though? I don't know what that means.\r\n\r\n\r\nTrenton (01:17.034)\r\nGeography, so they kind of fit into almost different geographies as well, or at least their mindset sort of does in how they think about things. Like Austin type, it's literally Austin, Texas, Silicon Valley, Silicon Valley, Tomorrowland, I don't know where that is. Maybe someone's basement, some festival. And then Main Street is like, it's somewhere tomorrow, exactly. They're in the future, they're trying to be at least.\r\n\r\n\r\nNikolas Hulewsky (01:26.2)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (01:34.222)\r\nIt's somewhere, it's somewhere tomorrow.\r\n\r\n\r\nTrenton (01:42.01)\r\nAnd then you got the Main Street folks who are just sort of in like small town USA.\r\n\r\n\r\nNikolas Hulewsky (01:48.11)\r\nOkay, so we'll get into what each one of these means. Why do you think it's important for people to understand what game they're playing?\r\n\r\n\r\nTrenton (01:54.478)\r\nYeah, I think people get entrepreneurship and like truthfully everyone's reason is different. Maybe they assume that they're all kind of the same and they kind of have these North stars that they seem to need to go up these ladders and figure out how to get to those ladders in order to win the game of entrepreneurship. But everyone's goals are kind of different and the way that they're thinking about building businesses are different as well. And that's what I'm seeing is like there's really like four main types. Maybe a fifth one would be like a entrepreneur and we can kind of throw that one out for this conversation.\r\n\r\n\r\nNikolas Hulewsky (02:21.997)\r\nMm-hmm.\r\n\r\n\r\nTrenton (02:23.342)\r\nBut four main types and each of those types kind of have different ways that they're thinking about building. And they have different ways that success means different things to them. And so like, you're truthfully probably fit into one of these types, but you're chasing a different lane, you're going to feel maybe like you're not making the progress you want to make. But some of the people that kind of understand the type of entrepreneur they are and play in their lane and do it the way that they want and understand their end goals, they're going to obviously have more success.\r\n\r\n\r\nNikolas Hulewsky (02:41.954)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (02:50.412)\r\nI kind of think of it in terms of, you know, it's the early or mid 1800s and the West is just totally unexplored. And so people don't really know how to get out West. The other day we were driving through Eastern Idaho on our way to this place called Lava Hot Springs, freaking middle of nowhere, but it was amazing. was literally hot springs that are hot by lava. That's geothermal heat, right? Like heating these hot springs. And as we were driving, we passed this road.\r\n\r\n\r\nThat was the old Lewis and Clark trail, I think was the name of it. And I was like, what the freak? So I go and Google it and sure enough, that was part of the Lewis and Clark trail. So Lewis and Clark, two famous explorers that explored the West. But if you were starting, let's say in Chicago or somewhere that was the quote unquote frontier land in the mid 1800s, going to Seattle and going to San Diego were two very different trips.\r\n\r\n\r\nTrenton (03:21.196)\r\nThat's crazy.\r\n\r\n\r\nTrenton (03:44.249)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (03:46.326)\r\nAnd if you were setting out and you're just like, I'm going to go west. You don't necessarily know which one of those is best. Are you supposed to go, you know, into the Rockies, north of the Rockies? Do you go under through New Mexico in the middle of the desert and try to figure your way out through the Rio Grande? But starting with the end in mind, understanding, okay, what's my goal? Okay. I want to get to San Francisco or I want to get to Idaho or I want to get to San Diego or whatever the place is, is really important because it sort of dictates the path that you're going to take. And you may be somebody who's\r\n\r\n\r\nnot well suited for one of those paths or the other. that's why I like these sort of types is it's like, okay, which one of these am I, where am I going? And it sort of allows you then to plan out your path as an entrepreneur.\r\n\r\n\r\nTrenton (04:26.744)\r\nYeah. Yeah. And I think, yeah, if you start just heading West, you very likely will get lost. If you kind of don't understand where you're going, you might turn back. you maybe we'll get lucky and figure out that way, but why not use a map and actually like get there and follow it the way that you want to follow it.\r\n\r\n\r\nNikolas Hulewsky (04:41.326)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (04:45.166)\r\nWell, and luckily there's been enough entrepreneurs ahead of us now where we have highways. It's pretty clear. It's pretty easy for us to understand, okay, which lane am I in? All right, that's the path I can follow. You don't have to reinvent the wheel every time. There is something fun about reinventing the wheel, but it's also, what do they say? Pioneers get killed or something like, there's like some tech phrase where explorers get killed or whatever. I don't even know, okay, Trenton? I don't know why you asked me. I sound like an idiot.\r\n\r\n\r\nSo let's go through the four types. Which one do want to start with?\r\n\r\n\r\nTrenton (05:18.606)\r\nYeah, I mean, and it's interesting because all four do have kind of different reasons that they're playing in different goals, but we can talk about the one that I'm seeing a lot lately. So again, four types, we got Main Street, we've got Tomorrowland, we've got Austin, and then we got Silicon Valley. And I'm seeing a lot of people in what I'm calling Austin. So let me define each of these four first, then we can kind of talk about them individually.\r\n\r\n\r\nBut the Austin type, to me, this is a person that's definitely wanting to build a business, have fun doing it, and chase freedom. And so they're trying to chase this, like, let's make money and have some freedom and fun along the way. And like, let's live the lifestyle we want to live. So a very freeing and freedom chasing type of person. Main Street, go ahead.\r\n\r\n\r\nNikolas Hulewsky (06:01.582)\r\nThis would, well, let's, I say let's talk about each one as we define them. So we can just like deep dive. So like Austin, in my opinion, is what we used to call the lifestyle entrepreneur. You remember when people would, it was almost a pejorative. It was like, oh, well, you're just a lifestyle entrepreneur. And they would sort of knock it, which essentially meant, well, you don't have any larger ambitions. You just want to have a nice lifestyle. And I'm excited to see now people are sort of recapturing that and like, yeah.\r\n\r\n\r\nTrenton (06:06.594)\r\nOkay, sure.\r\n\r\n\r\nNikolas Hulewsky (06:29.582)\r\nYeah, I don't need $100 million exit. I just want to have a nice life.\r\n\r\n\r\nTrenton (06:32.826)\r\nAnd yeah, I mean, I it's big for people to realize that now, like, hey, I am chasing freedom, so let me optimize for freedom along the way. I do think that it's not necessarily just like lifestyle kind of got a bad rap where it was like, I'm hoping to work one hour a day and the rest of my day is gonna be on my life. I do think a lot of these Austin types enjoy their business now, and it's because they probably optimized their lifestyle to attach to that business.\r\n\r\n\r\nBut I'm not seeing them be like lazy types of people that are chasing like this. I only want to work one or two or three hours a day. Like these are still people working probably five to eight hours a day, but they're fulfilled doing it. And then the rest of their lifestyle is really optimized too. They're not just coming home and like sitting on the couch. They're really like doing the stuff they want to do. They're traveling.\r\n\r\n\r\nNikolas Hulewsky (07:18.712)\r\nDude, I totally agree. I think I'm an Austin type. I have kids that are really young. I don't want to travel. I'm not going to a bunch of different conferences. I'm not going to bunch of different places. I kind of know where my boundaries are. And it's not even that I work four or five hours a day. I still work hard. You can still reach me at most hours of the day. But I have optimized for my life. I know what it would take to go and build a $100 million company. And I don't want to do that. That's not something for me. And so I've kind of optimized it.\r\n\r\n\r\nTrenton (07:40.536)\r\nYep.\r\n\r\n\r\nNikolas Hulewsky (07:47.97)\r\nWhere are you? Do you think you're an Austin type?\r\n\r\n\r\nTrenton (07:49.882)\r\nI am, but I wasn't always that way. And I've really like switched over the years and I do think people can evolve. They, like, I actually think that they probably, maybe not, maybe they do, but most of time, I don't think they start off there as an Austin type. feel like they learn the hard way that maybe the Silicon Valley or the Tomorrowland isn't the path. And then they, they move over to this Austin type. Could be wrong on that. But, um, and I do think like a of the people that I'm seeing within tribe are attracted to it because\r\n\r\n\r\nthey're kind of in a similar boat. Not everyone, there's different types in there, but there's a lot of the folks are in there. I would say like that's probably the majority of the folks in tribe as well. And a lot of them aren't necessarily first time founders. Some of them are, but a lot of them aren't.\r\n\r\n\r\nNikolas Hulewsky (08:31.502)\r\nFor a quick flavor, full disclosure, I'm an investor in Tribe. Trenton, how many members do we have?\r\n\r\n\r\nTrenton (08:36.794)\r\nWe're over 150 at this point.\r\n\r\n\r\nNikolas Hulewsky (08:39.616)\r\nOkay, so, and they're all over the country, right? And we're talking East coast, West coast, North, South, everywhere. It's pretty cool. Like I get to facilitate two of these groups. And so you just get to see what different people in different industries and different geographies work like. And we both had prior experience outside of this as well, but I agree with you. I do think that the, from my experience now seeing many of these individuals, the Austin type are prioritizing cashflow.\r\n\r\n\r\nTrenton (08:41.966)\r\nYeah. Exactly. Yep.\r\n\r\n\r\nNikolas Hulewsky (09:09.414)\r\nownership and autonomy are incredibly important to them. They want to control their schedule, do what they want to do, when they want to do with who they want to do it with. They're still ambitious. They're bootstrapper. They're not raising money like that. That brand of entrepreneurship, in my opinion, is becoming more and more and more prevalent. and we're even seeing kind of a shift in my opinion, outside of that from SMB to this Austin type. love this. I love that you've named this the Austin type of entrepreneur. It's awesome.\r\n\r\n\r\nTrenton (09:39.754)\r\nAnd if you've ever been to Austin, can kind of feel it. Like the vibes out there are a lot of the people that live there and just the way of life out there. But yeah, no, I agree. I'm seeing the same.\r\n\r\n\r\nNikolas Hulewsky (09:40.141)\r\nNikolas Hulewsky (09:49.23)\r\nSo I created a little self quiz. I'm going to ask, pose these questions. If you're listening and you're like, hmm, I which type of entrepreneur I am. At the end of each one of these, I'm going to ask questions. So ask this to yourself. Would you rather own 100 % of a $5 million business than 5 % of a $100 million business? So that's one question. Do you want to build something that supports your life?\r\n\r\n\r\nTrenton (09:52.836)\r\nMm.\r\n\r\n\r\nTrenton (09:58.788)\r\nNice.\r\n\r\n\r\nNikolas Hulewsky (10:18.968)\r\nthat and not take it over. Do you love experimenting, shipping and learning in public? Maybe are you not anti VC? You're just not sure you need it. Those are some questions you can kind of ask yourself. I think that any any question you would add.\r\n\r\n\r\nTrenton (10:34.362)\r\nThose are pretty good. I do think like income level and just like, are you willing to go all in to get your end goal of like a certain company? Cause that would be an indicator of you're not an Austin type. mean, there's, indicators that you are and then there's indicators that you're not. Um, but like even income level too, like with the Austin type, these, these people aren't chasing, like you said, the a hundred million dollar thing, like they, to them wealth and, and, and rich is a little bit of a different number, probably like a $5 million business would be amazing. And I think a lot of them are, are.\r\n\r\n\r\nlooking to chase that type of business. But on average, what I'm seeing most of these people make like take home to, I don't know, 200 to $500,000 a year, maybe a little bit more, maybe a little less if they're on the earlier side, but somewhere in that range, probably. And then their businesses are probably worth, I don't know, on the low end, a million to on the higher end, 10, 15 million. Like these aren't, and they're not trying to go too much beyond that. Like they're just not at this stage of their life. Those are really good numbers for them.\r\n\r\n\r\nNikolas Hulewsky (11:32.492)\r\nYeah, think, and to your point, I think there's two types of Austin entrepreneurs. I think there's the mature entrepreneurs, like you and I, who chase something and then realize, I don't need that, actually. I want to do this. And then there's the type who just always since day one, we're like, I don't need something big. I want to exactly have my lifestyle, and I'm going to go and shoot for that.\r\n\r\n\r\nTrenton (11:42.326)\r\nYep.\r\n\r\n\r\nTrenton (11:52.664)\r\nYeah. And they exist. definitely exist. They're more grounded than, than I was. So.\r\n\r\n\r\nNikolas Hulewsky (11:58.598)\r\nAll right, let's go to the opposite end of that spectrum, the Silicon Valley type. Tell me about them.\r\n\r\n\r\nTrenton (12:05.762)\r\nYeah, Silicon Valley type. And I come from California. You do too, actually. And so I've, I've, this is where I started. I definitely thought like the end goal was to get VC money and like, would be like, wow, if we could get VC funded and then create this a million dollar business or maybe eventually a unicorn, like that would be the coolest thing ever. But yeah, basically the Silicon Valley type, you know, tech, SAS, I guess AI at this point too. And, and they're focused on like big, big.\r\n\r\n\r\ncompanies and exits, apps, SaaS companies. And really, most of them do have that North Star goal of VC backed, going through series A, series B, series C, maybe eventually exiting or IPOing. That's kind of where they're trying to go. there's obviously a clear path there for them to follow. It's changed a bit over the last few years, but.\r\n\r\n\r\nThis one is to me where most of the young kids I feel like fall. Like I don't know too many like people that are 30s, 40s, 50s, 60s trying to chase this path. Like these are like fresh out of college or dropped out of college. That's even cooler if you drop out of college to do this and they're chasing this. But what's funny is like they're gonna have two opposite ends. They're either gonna be super successful or super poor. There's like no in between with this group, it feels like.\r\n\r\n\r\nNikolas Hulewsky (13:05.972)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (13:29.814)\r\nYeah, they're home run hitters, right? They're gonna strike out a number of times, but to your point, they're either gonna be super successful or they're going to be super poor. I had to laugh because that was freaking funny when you said, these are the young whippersnappers, all these young kids chasing after their dreams.\r\n\r\n\r\nTrenton (13:32.474)\r\nYeah.\r\n\r\n\r\nTrenton (13:45.818)\r\nYeah.\r\n\r\n\r\nThat's totally me. It just like shaking my head and I'm like, you guys go do that. I'm no longer in that game, but I was, I definitely was. And it was super appealing. But yeah, like you have to ask yourself why, why are you doing that? But I mean, there are some people that obviously end up, like these are probably the richest people we know end up from this world. Like they hit it, but I guess that's only a couple percent of founders actually.\r\n\r\n\r\nNikolas Hulewsky (14:12.983)\r\nfor sure.\r\n\r\n\r\nTrenton (14:17.838)\r\nmake it that far and do well. Most fail somewhere along that path, it seems, which is, know, VCs in general are known for taking, you know, 10 bets on different companies and seven of those failing within the first couple of years. So definitely odds are stacked against you.\r\n\r\n\r\nNikolas Hulewsky (14:24.961)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (14:35.83)\r\nI totally agree. So I agree with you. These are more of the high risk, high reward individuals where they're dreamers. They have a really big idea. They think they can bring it to fruition. But in order to do that, they've got to go raise money. They've got to go play in a much bigger space and a much bigger game than most of us have experience with. So it is a very different game. It's interesting because it's\r\n\r\n\r\nyou feel like you are a part of the future. And I know we have the techno optimist, which is one of your archetypes, but you feel like you are, you're changing humanity, right? Like every single one these people that I speak with always quote Steve Jobs. When Steve Jobs was like, I just wanted to make a dent in the universe. You know what mean? And, that's, and that's where I think they are. And I think it's very cool and you can be very ambitious, but in order to play this game, typically you've got to raise.\r\n\r\n\r\nTrenton (15:09.336)\r\nYeah.\r\n\r\n\r\nTrenton (15:21.176)\r\nTotally. Yeah. Yep.\r\n\r\n\r\nNikolas Hulewsky (15:33.868)\r\nat least a couple million dollars. You've got to live in probably specific geographies. Like we're talking about large urban centers. In the past, it was the Bay Area, but now it's probably like Miami, New York, Austin, San Francisco, maybe LA as well. And these are, in many cases, 10 year bets. They're not optimizing cash flows. This is either going to be a hundred million dollar plus exit, or it's going to be nothing. And they're going to move on to the next venture.\r\n\r\n\r\nTrenton (15:35.374)\r\nYep, at least.\r\n\r\n\r\nTrenton (15:49.294)\r\nYeah, at all.\r\n\r\n\r\nTrenton (16:01.986)\r\nYeah. Yep. Yeah, I'd agree with that. I think that back to like, it's important for you to know what game you're playing. Like to your point, 10 years is probably a good like, or more, right? Like the people that are obviously the most successful, know, Zuckerberg still in his company. A lot of them just continue to be in those companies and they have to evolve throughout that. yeah, this is a longer term play. And it's funny because I think a lot of these people are taking big\r\n\r\n\r\nand they're hoping that it pays off in short term, but it definitely is a longer term play. And frankly, like the ones that win are obviously gonna be a lot richer than even you or I who've, you we've done well, but to them it's worth it. They wanna change the world. Some of them are really motivated. And I think that the ones that really are, that have this fine balance of like, I wanna change the world and I wanna be rich, those ones probably are gonna really succeed. If you have just one or the other, you probably fail on this one where you just wanna change the world.\r\n\r\n\r\nThose people often don't know how to price right, don't know how to go out and sell and market as much. And then the ones that just want to be rich don't have as much of a meaningful company that people can actually grasp onto. And so I think you need both of those for you to succeed in this world, that mission that really drives you and this like wanting to dominate and make a ton of money. Yeah.\r\n\r\n\r\nNikolas Hulewsky (17:20.386)\r\nI also will see a lot of entrepreneurs, I you were like this, who go from this to the Austin entrepreneur, right? They're like, okay, I tried my hand at this. I played that game for a little while. And they may even get a small or meaningful exit of like a couple hundred thousand dollars or maybe even in the low millions. And they're like, all right, I'm going to go like buy a business now, or I'm going to go create my ideal business setup. So it's not abnormal to kind of graduate from one to the other. All right, here's my self-test. Are you ready?\r\n\r\n\r\nTrenton (17:25.774)\r\nYeah, for sure.\r\n\r\n\r\nTrenton (17:33.455)\r\nYeah.\r\n\r\n\r\nTrenton (17:47.342)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (17:51.758)\r\nIf you say any of these things, you might be a Silicon Valley type. I'd rather raise 10 million than make $1 million in profit. I dream of building something the world's never seen. I'm okay giving up equity if it means I get there faster. Failure does not scare me. Irrelevance does. I'd rather have 5 % of a $20 billion pie than 100 % of a $10 million pie.\r\n\r\n\r\nSo like those, anyways, those are some things to think about.\r\n\r\n\r\nTrenton (18:25.304)\r\ngonna lie, like some of those still speak to me. It's in there still, like there's still some of me that, and we, you know, we built an eight figure company in this space. So like we did all right, but we still didn't go to where a lot of these people have gone. And so, you know, it's, it's a very alluring type. And especially if you come from that world, like I went to school in the Silicon Valley University there, it's just, when you're surrounded by it, it's very infectious.\r\n\r\n\r\nBut it definitely is a lot different than Austin type, because Austin type is like, let me just focus on me and my family. This other one is sort of, there is some ego driven part to it, I think, for better or worse.\r\n\r\n\r\nNikolas Hulewsky (19:00.228)\r\nyeah. yeah. I totally agree. All right. Tomorrowland or Main Street? Which one do you want?\r\n\r\n\r\nTrenton (19:06.67)\r\nWell, Tomorrowland is similar to, let's talk about Tomorrowland. Tomorrowland is a little bit similar to Silicon Valley type, but in like a much different way. In the same way, it's that they're either going to be rich or poor. Like they're either going to like do very well, or they're going to not make any money at all. And, but I think that instead of trying to go with this conventional path of VC and needing to like give up a bunch of their company and equity, these people are really like the pioneers to your point. Like they want to do it their own way.\r\n\r\n\r\nand they don't want to play by conventional rules. anytime any sort of trend comes up, they're on it. Like crypto, they were probably on it early. But I know a lot of people that started crypto early and sold early or lost a lot of money, even though they were early on it. And so it doesn't mean that they're going to be successful for sure. But even with AI, like I think a lot of them are using it a ton, but don't know how to like capitalize or monetize or build an actual business with it.\r\n\r\n\r\nAnd so the ones that have business savvy attached to this and the right like smarts, and they're not just, cause it's, this is a super high risk group. they're, really high risk. And honestly, I know a lot of them that are massive credit card debt, where they're just like, they do not know how to spend or controller spending because they're so risky and they just take too many risks and they just don't have enough structure to actually like go through with this and make it work. However, there's some that are really good at networking and some that really good at like building.\r\n\r\n\r\npeople around them and like learning from people and going in on bets together and trying things together. And those are the ones that have done well, whether or not we want to call that legitimate. I don't know. Like some of these, you know, maybe helped pump together some meme coins. But there's all kinds of different flavors of this too.\r\n\r\n\r\nNikolas Hulewsky (20:48.844)\r\nWell, I kind of view.\r\n\r\n\r\nWhat do you think of this group? Do you think they are more scared than the Silicon Valley group?\r\n\r\n\r\nTrenton (20:59.642)\r\nscared.\r\n\r\n\r\nMaybe. What do mean by it? Yeah, let me hear.\r\n\r\n\r\nNikolas Hulewsky (21:02.712)\r\nBut so here's what I mean by that.\r\n\r\n\r\nYeah. I mean, they're doing the same things that the Silicon Valley group is, but they're just optimizing, staying in the game long enough cashflow, making money. They don't raise my, and I've seen people like this. My question has always been like, why don't they raise money? And to me, that's the differentiator between these people and the Silicon Valley people is these people don't raise money. And I don't know if it's because they're scared. if I go raise money and I let people down or\r\n\r\n\r\nTrenton (21:19.449)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (21:35.564)\r\nif they don't believe in their idea enough or if they're just too nervous to make those investments. I feel like I kind of fall into the Tomorrowland camp sometimes because I'm like, I have the idea, I like the future, but I'm just nervous about getting the money to then make the investment necessary to really turn these ideas into viable long-term businesses.\r\n\r\n\r\nTrenton (21:56.728)\r\nYeah. To me, it's funny. I see this, like we talk about Silicon Valley being people that are trying to hit home runs. To me, this group is actually like Tomorrowland are the people that are going to the casino. And some of these people know how to count cards and some of them like are very good at gambling and they can win. But most are just going to keep pushing those buttons and just losing money. And they're like, they're at the right place where they could potentially make a lot of money and they might even know how to do it. But, you know, very few of them\r\n\r\n\r\nNikolas Hulewsky (22:18.126)\r\nHmm.\r\n\r\n\r\nTrenton (22:26.264)\r\nare structured enough and have the know-how to actually win at gambling, we'll call it. But it's definitely appealing because you're like, my gosh, the money's so fat. To me, these are the people that are chasing quick money and being a part of something big early. And so some of them do succeed, but I would guess it's gonna be even fewer than the Silicon Valley. I don't know, yeah, hard to know.\r\n\r\n\r\nNikolas Hulewsky (22:40.238)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (22:50.286)\r\nOkay. Okay, that's fair. All right, here's some self tests. Are you ready? I prefer building for for three years from now, not today. I believe I believe decentralization and automation will reshape businesses. I'm fine with massive uncertainty if the upside is there. I often quote people like Balaji, Naval or Vitalik.\r\n\r\n\r\nTrenton (23:17.434)\r\nPerfect. It checks out.\r\n\r\n\r\nNikolas Hulewsky (23:22.072)\r\nThat's pretty good. All right.\r\n\r\n\r\nTrenton (23:23.352)\r\nAnd I think that there's still people that can make money in this area, you know, but yeah, it's just an interesting, it's an interesting one. Honestly, for Tribe and what we see, this is probably where we have the least amount of people. Like there's probably not, maybe no one or very few of these types in there, but they're the ones that are, yeah, tech businesses.\r\n\r\n\r\nNikolas Hulewsky (23:40.13)\r\nYeah, we have people who have tech businesses, but they're not, I wouldn't say they're tech optimists. They're not this category.\r\n\r\n\r\nTrenton (23:47.662)\r\nThese people also, I will say one last thing, these guys are on social media a lot. Like this Tomorrowland type, they're definitely on X, they're on these social medias, they're connecting with people. Sometimes they have decent followings, but they like live on their computer. That's how I see them, that they're on it. They're live streamers, they're hustlers. They're, yeah, they're interesting.\r\n\r\n\r\nNikolas Hulewsky (24:03.576)\r\nThey're hustlers. They're hustlers.\r\n\r\n\r\nNikolas Hulewsky (24:09.642)\r\nAlright, here we go. The Main Street type. Tell us about the fourth category.\r\n\r\n\r\nTrenton (24:12.856)\r\nMain street. Main street. And I don't know if this one is one that people like burn out on another one and then go to this one. I feel like this one, they're almost like they get raised up and they're like, this is what the path they want to go. A lot of them truthfully are in middle America or like main street type of America. But basically they're doing small to medium sized businesses, typically local. And they just want to have a good life and be involved in their community. Like they want to give back to their community. They care about their family. They want to help people.\r\n\r\n\r\nThey don't care about being millionaires, most of them. Some of them will become that. But a lot of them just want to make a decent living and not have to work for someone. so this is HVAC, this is lawn care, this is laundry mats, this is even local marketing businesses potentially, but they're really involved in their local community. Most of these people are probably making...\r\n\r\n\r\n100 to 300,000 a year, maybe a little more if they've been in the game a long time. But this is also the point of it. They want to be in the game a long time. They're not trying to retire quick. These are people that are probably gonna work until their 60s, maybe their 70s, and hopefully create these generational local businesses that their family can continue. Now.\r\n\r\n\r\nNikolas Hulewsky (25:21.676)\r\nWhat do you think of the biggest difference? sorry, you finished that thought.\r\n\r\n\r\nTrenton (25:24.846)\r\nThe only other thing I was going to say is like, these are also becoming appealing for people, not necessarily that we're born entrepreneurs, but like that we're in corporate and now want to leave corporate and want to buy a business. A lot of them are buying their way into these SMBs that are going to be basically their job for the next 20 years. And so we're seeing that also, like this is very popular. If someone's buying a business, this is a very popular area to go buy a business. It's just attractive because you don't have to go work for the man anymore and you can do it on your own.\r\n\r\n\r\nNikolas Hulewsky (25:50.926)\r\nYeah, if I'm listening to this, I'm kind of thinking, well, what's the difference between Austin and Main Street? They sound the same. I'm creating the lifestyle that I want, it's a small business, et cetera. How do you see the differences?\r\n\r\n\r\nTrenton (25:58.489)\r\nYeah.\r\n\r\n\r\nTrenton (26:03.992)\r\nI see quite a bit of difference. Like the Austin type is still chasing their own form of freedom and they are a little more ambitious where they're trying to make a little bit more money probably than this Main Street type. The Main Street type is really focused on their local community and their local family and just like local. They're not trying to go massive and go big. Like the Austin types are still trying to mostly become millionaires. This Main Street type, a millionaire isn't their goal or like one million might be, but it just sort of like...\r\n\r\n\r\nIt's a good income, it's a steady living, and you're helping a lot of people in your local community. Austin is like, we're gonna go have fun, and we're gonna go do the things that are important to us. Maybe community is part of that, but a lot of these people are like, these guys like to travel and like to go do things that they like to do. They like to explore, they like to have fun. So, a little bit different.\r\n\r\n\r\nNikolas Hulewsky (26:47.29)\r\nThese are kind of some generalizations, but here's how I thought of it. And I used my chat GPT to help me think through this. Are you ready? The office vibe, I thought this was a funny way to put it, but I agree with it. Main street, it's the warehouse, shop floor, contractor calls. The Austin type, coworking space, coffee shop, async remote team. Fair? I totally, when I read that I was like, that's yeah, that's absolutely it.\r\n\r\n\r\nTrenton (27:10.35)\r\nYeah. Yeah. Yeah.\r\n\r\n\r\nTotally. Yeah, very much.\r\n\r\n\r\nNikolas Hulewsky (27:17.578)\r\nIndustries, Main Street, Blue Collar, Services, Local Trades, Retail, Facilities, Austin type, Online, Tech-enabled, Agencies, SaaS, Media. Now, I will say I have seen many in Austin type or quote unquote, these types of businesses, online businesses that are kind of Main Street type businesses and vice versa. I do think generally speaking, those are sort of the way that industries break down.\r\n\r\n\r\nTrenton (27:27.278)\r\nYeah. Yep.\r\n\r\n\r\nNikolas Hulewsky (27:48.426)\r\nthis was, here's one of my favorites, right? Toolset. Main street's going to be playbooks, SOPs, Craigslist, Facebook marketplace, the Austin type, Notion, Zapier, content funnels, email marketing lists. so different ways of customer acquisition, different ways of funnels, different ways of content creation. but.\r\n\r\n\r\nyou can kind of see those tool sets are very different.\r\n\r\n\r\nTrenton (28:21.644)\r\nYeah. Yeah. I, yeah, I'd agree. And I think that that that's like back to this whole point of like, why are we talking about this? Like I think of course there could be more and people could be hybrids or whatever, but just knowing the game you're playing allows you to win a lot better. Cause you have this like, you kind of know what are your end goals. You don't need to compare yourself against the Silicon Valley type if you're in this other type, cause you're not on the same playing field. You're trying different things. You have different tools, you have different SOPs. have to, yeah, all the, all of this is different. and so it's just interesting to see.\r\n\r\n\r\nall these different types and like why they're doing it, how they're doing it, what they want, what they need. It's all different, but a lot of similarities too.\r\n\r\n\r\nNikolas Hulewsky (28:57.964)\r\nYeah. Here's one other framework that I like to kind of view them through. Community for the Main Street type and the Austin type. For Main Street, their community is like their local geographic community. The local PTA, schools, churches, whatever, governor or organizations. For the Austin type, their community are like-minded individuals. So people they met on Twitter, Facebook, Instagram, like, you know, the digital.\r\n\r\n\r\nTrenton (29:13.304)\r\nMm-hmm. Yep.\r\n\r\n\r\nNikolas Hulewsky (29:26.638)\r\nSo that is also a very big differentiator in my mind, where it's like, where do you gravitate towards community that serves as a differentiator for your business? Is it going to be Main Street or is it going to be the Austin type? Okay, here are some self-test items for Main Street. If you say yes to any of these, you might be a Main Street business owner. I'd rather own a great plumbing business than a risky tech startup.\r\n\r\n\r\nI like businesses where I can talk to the customer. I've looked at business listings on BizBuySell. That's a good one. I care about owner earnings, not vanity metrics. I'd rather have $400,000 in seller discretionary earnings than chase a billion dollar exit. So if any of those resonate with you, I think you might be a Main Street, a Main Street type.\r\n\r\n\r\nTrenton (30:01.754)\r\nTotally.\r\n\r\n\r\nTrenton (30:16.792)\r\nYeah. Which one? So Austin resonated with you the most out of all these still.\r\n\r\n\r\nNikolas Hulewsky (30:22.892)\r\nYou know, I'm kind of a mix, man, I'm a mix of many of these because like the Main Street resonates with me because I love local community. I think it's really cool to just be integrated with what's going on locally in your city. So I love that piece of it. Austin resonates with me because it's like I focus on cashflow now, not enterprise value long-term. Although you're still.\r\n\r\n\r\ninterested in enterprise value long term. It's not about just building, building, But the Tomorrowland also resonates with me in the sense that I like to be looking for what's happening next because I feel like it helps me prepare and gives me an advantage. So I do like aspects of all of them. But yeah, if you were to ask me which one of these I think I resonate with the most, definitely at this point, Austin.\r\n\r\n\r\nTrenton (31:17.88)\r\nYeah, Austin, I could see that with you too. Yeah, Austin too, but there, I mean, there's definitely a pull in me on that Silicon Valley type. Like it's, it's conditioned in there where it pulls at me sometimes too. And so I can teeter totter, but at this stage of my life, definitely in that Austin type where I'm, you know, I'm optimizing for freedom.\r\n\r\n\r\nNikolas Hulewsky (31:19.662)\r\nWhat about you?\r\n\r\n\r\nNikolas Hulewsky (31:37.006)\r\nIt's really interesting. always, one thing we didn't mention, but I think is, should be in here is I think the Silicon Valley type is much more competitive. It's like they want to win and they want to win, not necessarily other people's expense, but they want to do better than other people. I wish that I had that mentality sometimes, but I don't. So like, I've never really identified with the Silicon Valley piece. I don't think that's good or bad. I just think that that's a motivator for you. Then you should know that.\r\n\r\n\r\nTrenton (31:59.94)\r\nSo.\r\n\r\n\r\nTrenton (32:04.856)\r\nWhat about, you've built seven figure businesses, you've had exits. While you were building those, did you feel like you've been the same kind of the whole way through, or you've always been sort of optimizing for freedom in different ways?\r\n\r\n\r\nNikolas Hulewsky (32:18.294)\r\nNo, that's a really good question. I don't think that I knew what entrepreneurship was or what I wanted to do early on. I think when I got into entrepreneurship, I thought, I've got to buy a business, and then I've got to run it and turn it into this scale in order for it to be successful. Because that's all I had seen in health care. It's got to be a seven figure business, eight figure business, in order for you as the owner to be making really good money.\r\n\r\n\r\nTrenton (32:24.505)\r\nYeah.\r\n\r\n\r\nHmm.\r\n\r\n\r\nTrenton (32:41.529)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (32:47.79)\r\nSince I've left those businesses though, in the healthcare space in particular, I've realized, man, there are some agency businesses where you can make $800,000 a year in top line and $600,000 a year in bottom line. So top line to me isn't nearly as important as it used to be. And so that's definitely changed for me. But I've always been the type where I just wanted to prioritize my curiosity. It's like, well, what was interesting? What keeps me satisfied intellectually? That's where I want to go.\r\n\r\n\r\nAnd I've kind of always been the same. What about you?\r\n\r\n\r\nTrenton (33:20.888)\r\nYeah, that's interesting. think I, there's probably like some emotional childhood issues, but I always wanted to prove that I could do something cool or like build some sort of movement at the beginning. And then after doing that burned out really hard. but like a lot of my, my drive was to kind of just prove myself or prove that I could do it or prove that this company had legs. And, so that was a pretty.\r\n\r\n\r\nNikolas Hulewsky (33:46.328)\r\nWho did you want to prove it to?\r\n\r\n\r\nTrenton (33:49.326)\r\nyou're getting into family therapy here, but I'd say like there's probably for my dad, I think that there was just not a lot of approval in general of what I was doing throughout the years. And it's funny, even as an entrepreneur, it wasn't until like our company was doing multi-millions. And I think we got featured on the Inc 5000 that he was like, I told you, you could do it the whole time. you know, it wasn't until like,\r\n\r\n\r\npretty good success that he started to come around a little bit. And we have a much better relationship now, but probably some of that and like other family members and you know, I was shy in school. I moved around a lot and probably wanting to fit in and or like, you know, do something there. So that drove me for a while and it worked. like, but it was very shallow and it burned out to doing it truthfully. And then realigned with my values, which is where it shifted quite a bit over the years.\r\n\r\n\r\nNikolas Hulewsky (34:36.919)\r\nInteresting.\r\n\r\n\r\nNikolas Hulewsky (34:42.798)\r\nI've always prioritized collaboration. just enjoy, I enjoy going at it with people together as opposed to by myself. And the wins are not nearly as sweet and the losses are not nearly as bitter when you're with a team as opposed to by yourself. So I just never had that drive of like, I'm going to, I'm going to prove everybody wrong. Like I said, I wish that I had it sometimes because I envy those people who are just such hard chargers, but\r\n\r\n\r\nFor me, was always, what could we build together? What could we build that would optimize our relationship or our outcomes? And again, I don't think that's good or bad. just think in the same way identifying these four types, as an entrepreneur, you should recognize what motivates you, what's important to you. Do you like to win together? Do you like to win by yourself? Do you like to build teams? Are you an introvert? Are you an extrovert? Just getting to know yourself is so valuable before you actually jump into it.\r\n\r\n\r\nTrenton (35:23.406)\r\nThat makes sense.\r\n\r\n\r\nTrenton (35:42.554)\r\n100%. And I would say like, I also prioritize teams like Helpware has a couple thousand employee company. like, to me, I would rather have the team doing well together than me myself. It became about this like, still willing to prove that we as a company could compete against these Goliaths. That was what it started to become. But yeah, it's so much sweeter with the team. I've always done that. And honestly, to my judgment, probably where I give up too much equity or\r\n\r\n\r\ndon't take much take home pay because I want to make sure that we're building that team. But again, yeah, which game are you playing and understand that will help you to optimize this a lot better. Definitely a lot of learnings over there. Yeah.\r\n\r\n\r\nNikolas Hulewsky (36:17.528)\r\nYeah. Yeah.\r\n\r\n\r\nI totally agree. What do you think is like the overall sentiment right now amongst entrepreneurs? There's a lot of uncertainty. Obviously we're coming out of COVID, which changed everything. And now we've got a lot of uncertainty internationally with trade, with AI coming into the picture. Is there a lot of scared entrepreneurs out there? Are there a lot of excited entrepreneurs? Like what are you seeing within Tribe?\r\n\r\n\r\nTrenton (36:47.618)\r\nYeah, I would say, yeah, it's interesting generalization, but like, I'm seeing a lot of definitely scared and pessimism at this point amongst the entrepreneurship community, just because of all the uncertainty in the world with everything that's happening. And I think that the bigger one that's overarching on this is the AI factor and just like the unknown of how fast it's going to advance and\r\n\r\n\r\nI think that the smart entrepreneurs right now are definitely using as a tool and we're definitely seeing, like we're seeing job loss happening, especially in entrepreneurship. They're cutting jobs and looking at ways to optimize and automate everything. And so don't want to sugarcoat that. That's definitely happening. But I think there's the rapid pace of change beyond like, well, with tariffs and world situation as well as with AI is leaving a lot of people uneasy. Like I'm going to keep hustling while I can right now. I'm going to control what I can control, but\r\n\r\n\r\nI need to kind of roll with the punches and yeah, some are really taking it in stride and doing well, but I would say there's a lot of fear. I don't know, are you seeing the same? Are you seeing different?\r\n\r\n\r\nNikolas Hulewsky (37:53.772)\r\nAre you saying a lot of fear generally or you feel like the tribe members in particular are fearful?\r\n\r\n\r\nTrenton (37:58.85)\r\nGenerally, I'd say, because I'm obviously with Tri, we have 150 great entrepreneurs doing really cool things. And I'm only involved with a few of these groups. I hear what's happening, but I'm involved in the larger entrepreneurship community with X and LinkedIn and talked to lot of entrepreneurs and investors. And this is kind of the broader sentiment that I'm picking up at this point.\r\n\r\n\r\nNikolas Hulewsky (38:20.748)\r\nYeah, I wouldn't use the word fear. I would use the word uncertainty amongst entrepreneurs. the ones that actually, yeah, AI I think is the one that they're the most unsure about. But the ones that start digging into it and educating themselves, those are the ones I see the most excited about the future. They're still unsure. They're still like, I'm not sure exactly what this is going to look like. But man, this is so cool because now I can do X, Y, and Z.\r\n\r\n\r\nTrenton (38:25.273)\r\nYeah.\r\n\r\n\r\nTrenton (38:35.449)\r\nYep.\r\n\r\n\r\nNikolas Hulewsky (38:50.542)\r\nTo those individuals in particular, I think, and there are many of those in tribe, if you're curious and you're just trying to figure stuff out, you're not nearly as scared or fearful as others. You're still like uncertain. You're not sure like what's going to happen, but you're not scared, I would say.\r\n\r\n\r\nTrenton (39:08.186)\r\nI do think that, especially in like that Silicon Valley type where they are building like tech companies or like how much easier it is now to build a tech company because of AI and a SaaS product and like using it to their advantage. Like this is insane that we can do that this today. Like I do see that level of excitement. And then I do think you're right. Some of these people that are optimizing and understanding like, wow, I can pump out content so much easier and faster. And I can do my outreach so much smarter and better than I could five, 10 years ago.\r\n\r\n\r\nNikolas Hulewsky (39:19.182)\r\nMm-hmm.\r\n\r\n\r\nTrenton (39:36.388)\r\nThere's a lot of excitement there. And I think that some of them feel like they're in this gold rush era where it's like, man, I'm going to take advantage while I can. And so there is that too. I do see that element. And a lot of them are like, this is insane that this, and it is like the technology, like clay, for instance, on outreach is insane. You know, the amount of stuff that we can do now with automations in our businesses is insane. But then the fact that you can have AI develop your app for you and you don't need to have tenant developers doing it. I built an app almost what 16 years ago.\r\n\r\n\r\nAnd in college, and it took me a lot longer than, you know, the five minutes that people are using on theirs today. And theirs are probably better than mine too. So I think people are like, this is just crazy that this exists. So I do see that too. The people that, but I think to your point, they have to dive in and they have to get familiar with it. And as soon as they do, and they're like, this is great. This is great.\r\n\r\n\r\nNikolas Hulewsky (40:19.16)\r\nDude, that's...\r\n\r\n\r\nNikolas Hulewsky (40:25.944)\r\nThat's what I've always loved about Twitter or Instagram or whatever social platform you're on. And that's what I love about organizations like Tribe, whether you're in, you know, YPO or Hampton or any of these other organizations is there's a group of people that you can talk to about what you're seeing. I had never been a part of a group like that before I sold my businesses. I was not on Twitter. I wasn't in any peer groups. And so when I saw stuff, I would maybe talk to my partners, but they didn't know any more than I did necessarily.\r\n\r\n\r\nTrenton (40:55.918)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (40:56.034)\r\nBut when you get on Twitter or when you're in a group like Tribe and you're talking to other group members and you're like, hey, I did this in my business. Has anyone ever done this before? And they're like, yeah, I did. I tried that with paid ads once. It didn't really work out for these reasons. like, yeah, I automated that before. Here's the exact workflow that I used. All of a sudden you got this idea sharing that I think is insanely valuable. And that's been my biggest takeaway, specifically from Twitter. It's like I could talk to almost anybody who's an expert.\r\n\r\n\r\nTrenton (41:15.532)\r\nIt is insane.\r\n\r\n\r\nNikolas Hulewsky (41:24.334)\r\nAnd within an hour or two, I've taken a course that somebody would have paid $10,000 to take.\r\n\r\n\r\nTrenton (41:29.23)\r\nYeah, it is kind of an ultimate hack, not trying to plug tribe too much, but obviously we built it selfishly, like for our own needs, based on what we saw as entrepreneurs and founders, like this is what I wanted during that time. And I wanted to, you know, have a group of friends, but also like this, this brain trust that we can just get together and like, do you think this works? What have you guys seen? And when you, when you're smart like that and you're willing to put yourself out there and like help and talk to people, then yeah, there's some crazy stuff happening on that end where it's just like, it's a collective.\r\n\r\n\r\nbuilding you up and these businesses are really winning together and there's just so much learning and you just can't be afraid of learning and curiosity, helping people and just like putting yourself out there though. I think a lot of us are a little more introverted than we probably should be on the entrepreneurship side. The more that you can network, crazy.\r\n\r\n\r\nNikolas Hulewsky (42:16.334)\r\nI told him, well, and like, let's put tribe to the side, which we love tribe, whatever. I think any entrepreneur needs to find their peer group. Like they need to find their own little mastermind. They could be friends. They could be people you met on Twitter. That was my like first group was like people I met on Twitter, Cole, Mike and Parker. We had this little tweet group and we still communicate and text with each other. But there's just something so powerful in finding other people.\r\n\r\n\r\ngone through similar experiences that you can commiserate with it. You can ask questions of that. I don't think enough entrepreneurs take advantage of. And it really is like a cheat code. It's a cheat code to making more money in your business. It's a cheat code to growing your business, a cheat code to being happier. It's just incredible. I don't know why more people don't do it. And we have all these tools, Twitter, threads, Facebook, Instagram. mean, what's Reddit? Although that can be assessable sometimes. You can meet really cool people on Reddit. Obviously,\r\n\r\n\r\nTrenton (43:09.902)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (43:13.688)\r\ncommunities like we're talking about that we started, it's all out there. Just go get it.\r\n\r\n\r\nTrenton (43:19.27)\r\nYeah. Yeah. 100%. Yeah. For me, you know, it's obviously, like I said, it's a selfish need. It's such a cool thing to be able to do. But I think part of why I need it and a lot of us do, like we burn out the other way. Like my wife doesn't want to talk entrepreneurship all day with me. My family doesn't, they're not entrepreneurs. You know, my friends weren't either. So I felt like I had no one to talk to. And some of this stuff, like you just need people to talk to. And then some of it is, yeah, being able to just brainstorm. It's massive. Yeah.\r\n\r\n\r\nNikolas Hulewsky (43:34.552)\r\nNo.\r\n\r\n\r\nNikolas Hulewsky (43:46.254)\r\nAlright Trenton, this was great my friend. Where can people come find you?\r\n\r\n\r\nTrenton (43:52.41)\r\nI'm mostly on X, Trent J Hughes at this point, also on LinkedIn, Trenton Hughes. But yeah, appreciate you having me again.\r\n\r\n\r\nNikolas Hulewsky (44:01.154)\r\nYeah, of course man, we'll talk soon. That's it. All right, stay on.\r\n\r\n\r\nTrenton (44:02.947)\r\nThank you.",
  "metadata": {
    "duration": "",
    "date": "2025-07-11",
    "platform_source": "Google Drive"
  }
}