{
  "episode_number": "175",
  "episode_title": "How Big Tech Layoffs Signal the Future of AI Integration with Elizabeth Knopf",
  "guest_name": "Elizabeth Knopf",
  "business_name": "",
  "transcript": "﻿Nikolas Hulewsky (00:00.878)\r\nAll right, Liz, another massive week for AI and the implications for boring businesses, which is what we talk about. The thing I'm most excited about is we finally built some real world applications for AI, correct?\r\n\r\n\r\nLiz (00:13.919)\r\nYep, indeed.\r\n\r\n\r\nNikolas Hulewsky (00:16.152)\r\nOkay, so why don't we show the people what we created? I think they're gonna be really excited.\r\n\r\n\r\nLiz (00:20.139)\r\nYes, it is mind blowing and get ready.\r\n\r\n\r\nNikolas Hulewsky (00:25.528)\r\nYeah, this is hundreds of hours of work. Honestly, it's probably something worth, I don't know, 10 figures? 11 figures? Something like that, okay. Let's.\r\n\r\n\r\nLiz (00:33.047)\r\nsomething like that.\r\n\r\n\r\nLiz (00:38.293)\r\nAI hallucination rates worsened. OpenAI's latest models, 03 and 04 mini, showed higher hallucination rates, 33 % and 48%, than the 01 model, raising concerns about reliability and raising upgrades. Saudi Arabia's AI push boosts chip stocks. Announcements tied to Saudi Arabia's AI initiatives drove a rally in chip stocks like NVIDIA, AMD, and Qualcomm. Analysts are debating whether these are firm contracts with speculative letters of intent, highlighting the region's growing AI ambitions.\r\n\r\n\r\nNikolas Hulewsky (00:50.328)\r\nI look great.\r\n\r\n\r\nNikolas Hulewsky (00:59.31)\r\nI first of all, I love babies. And second, to see us talking about AI as babies is amazing. I think everybody's seen the AI babies like famous people Joe Rogan, people reading the news as babies. That was Liz and I as babies we start. know what's cool about that is, first of all, I got my painting right, which was awesome. And I am going to change the color of my wall behind me to that color blue. It isn't that crazy. That's so funny.\r\n\r\n\r\nLiz (01:07.116)\r\nIt is.\r\n\r\n\r\nLiz (01:12.651)\r\nYep, yep, had some fun, had some fun.\r\n\r\n\r\nLiz (01:24.336)\r\nthat's great. Great call out.\r\n\r\n\r\nNikolas Hulewsky (01:28.832)\r\nAI knows. I don't know how it knows, but it knows. No, things are changing so fast. Even stuff like that, where you're able to create, obviously, baby versions of us talking about AI. It's just nuts. It's just so crazy to me how quickly things are changing.\r\n\r\n\r\nLiz (01:29.975)\r\nredecorate everything.\r\n\r\n\r\nLiz (01:46.519)\r\nWell, and I think that's, you know, one of the best elements of it is the entertainment factor. I mean, anything you create, anything you put out in social media now, it's like the bar is now super high because you can do things like this. you know, text is almost dead. I mean, it's not, but it feels that way because all of these, yeah, these augmented experiences are pretty exciting.\r\n\r\n\r\nNikolas Hulewsky (02:00.995)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (02:06.008)\r\nFeels that way.\r\n\r\n\r\nNikolas Hulewsky (02:11.106)\r\nAll right, so let's talk about some of the amazing things that happened this week.\r\n\r\n\r\nLiz (02:14.655)\r\nYeah, so big news. A lot of companies are doing layoffs. And so this has been hitting the news. There's been mixed feelings around this. And really sort of seeing the writing on the wall is from these big tech guys. So I'm going to pull up a couple charts just to illustrate what is going on, because I think that'll be helpful, and to give some more context as well as...\r\n\r\n\r\nNikolas Hulewsky (02:41.304)\r\nSo while you're pulling those up, we talked a little bit about this last week, but Meta, Google, Microsoft came out with their earnings last week. And some of the things that they mentioned, specifically Meta and Microsoft, were that their engineers are now producing like 30 % of the code base using AI, which is nuts. And I tried to find it, but I did some analysis that shows the revenue per employee at these tech companies has exploded over the last two quarters in particular.\r\n\r\n\r\nbecause they've been laying off, but they're as efficient, if not more efficient than they were in the past. So, top line revenue is growing, employee head counts dropping down, and they're able to stay more profitable, and the revenue per employees is rising like crazy. So, it's just, it's showing us that, this is possible. Obviously, they're the first ones to do it because they're making the models and they're eating their own dog food, but this is coming down to the rest of businesses, even us, you know, even the boring businesses that we opt-\r\n\r\n\r\nLiz (03:36.695)\r\nAbsolutely, like this morning I saw a well-known entrepreneur with a hold co who said he just, you know, acts about 25 K of his SAS budget, his annual SAS budget with internal custom tools. So it is happening and it's coming down and but again, I don't necessarily think it's going to be full, you know, layoffs and job cuts and we'll, we'll get into why I think that. So the big news was with Microsoft, they basically said that they cut 6,000 jobs.\r\n\r\n\r\nNikolas Hulewsky (03:50.719)\r\nNuts.\r\n\r\n\r\nNikolas Hulewsky (04:00.227)\r\nYeah.\r\n\r\n\r\nLiz (04:05.367)\r\n3 % of their workforce. And they're said that that money they're reallocating to investments in data infrastructure and AI infrastructure. And we saw this, you know, alongside obviously the big Middle East deals happened this week as as you know, baby Nick just shared with us. But I mean, I think right now the, the money is going into the infrastructure. And so if you can think through what's going to happen once that build out is complete,\r\n\r\n\r\nNikolas Hulewsky (04:12.781)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (04:22.477)\r\nYou\r\n\r\n\r\nLiz (04:34.871)\r\nYou can probably have some potential investments around that. ahead.\r\n\r\n\r\nNikolas Hulewsky (04:38.798)\r\nDoes it say where the 6,000 jobs came from? Like, where are they cutting?\r\n\r\n\r\nLiz (04:43.307)\r\nSo I tried digging into it because I was like, it going to be customer support? Is it their software engineers? Cause that would be telling I couldn't uncover exactly where and they, but, but the freak out about it is I think a little bit overdone because then if you look at, okay, where is the Microsoft? Okay. The Microsoft headcount. So if you look at it per quarter over the last, you know, since 21 and remember there was big layoffs in 22, which didn't really hit Microsoft, but.\r\n\r\n\r\nNikolas Hulewsky (04:51.48)\r\nThey didn't say.\r\n\r\n\r\nLiz (05:13.013)\r\nThis is not that much compared to like their head count overall. So I don't think this was as big a news as people made it out to be. Because again, you just see this sort of little dip here. I mean, they have, you know, like almost, yeah, they have a ton of, I mean, 230, 2000, 232,000 employees.\r\n\r\n\r\nNikolas Hulewsky (05:25.262)\r\nCrazy, yeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (05:32.462)\r\nThat's interesting. like you see the peak there in Q2 2023, think it's small on my screen, but, um, and then it drops not even that much. It doesn't even drop to where it was in 2022 Q2 of 2022. Um, and then they hire right back. Like they hit the peak and within like three quarters.\r\n\r\n\r\nLiz (05:36.981)\r\nMm-hmm. Yep.\r\n\r\n\r\nLiz (05:45.045)\r\nRight, right, and yeah.\r\n\r\n\r\nYeah. Yeah. So, I mean, I think this is sort of just normal business. Like, I don't think that the Microsoft news was huge. mean, again, everyone wants to frame the fears.\r\n\r\n\r\nNikolas Hulewsky (05:55.47)\r\nHmph.\r\n\r\n\r\nNikolas Hulewsky (05:59.086)\r\nWell, the employees on blind, I'm looking at this on Twitter right now, are saying that layoffs are targeting principal managers and PMs. I'm assuming that means product managers with $600,000 a year plus comp packages.\r\n\r\n\r\nLiz (06:04.822)\r\nOkay.\r\n\r\n\r\nLiz (06:17.367)\r\nSo that makes sense. They're getting rid of the management layer and bloated salaries. I mean, that makes sense.\r\n\r\n\r\nNikolas Hulewsky (06:22.732)\r\nWell, I just I just heard some comments from Sundar of Google. Not soon. I'm sorry. I think it was Larry, Larry Page of Google that he's like. Managers are done for like he feels managers are done for like they don't need this this middle management layer within these companies, so this could be sort of that in effect where Microsoft's like we don't really need this middle layer anymore and they cost a lot of money. Let's go ahead and ask them.\r\n\r\n\r\nLiz (06:42.465)\r\nabsolutely.\r\n\r\n\r\nLiz (06:47.927)\r\nBut if you are a manager, don't get scared, because I actually think there's opportunity as a manager. So people love to say managers are useless. They just basically are moving puzzle pieces around and communicating up and down and whatever. But I actually think the skills in being a manager apply directly to AI. You have to give instructions, be a good communicator, know how to orchestrate things, put things together, prioritize and manage. And that's all highly applicable.\r\n\r\n\r\nNikolas Hulewsky (07:01.934)\r\nSure.\r\n\r\n\r\nNikolas Hulewsky (07:16.024)\r\nTotally.\r\n\r\n\r\nLiz (07:17.419)\r\nto AI. So it's just sort reinventing yourself with the skill set you've already developed.\r\n\r\n\r\nNikolas Hulewsky (07:20.846)\r\nWell, it's the same with every other position. It's just making each position more efficient. They're able to leverage their time even better. So I get it. They don't need as many managers because they have people with those skill sets and they're not going to leverage AI to manage more. That's kind of the way that I read it. What's this Duolingo post you have up? okay.\r\n\r\n\r\nLiz (07:27.157)\r\nExactly. Totally. Right.\r\n\r\n\r\nLiz (07:38.173)\r\nI'll just answer second. One other thing on that too is, you know, it's like there used to be people who would literally be hired to be in the meeting taking notes and like project management. I think that's like the example of those duties of responsibility are, you know, obsolete at this point, which is unfortunate because like there's been some successful people who had power plays in that role. there's Chris Sokka has a famous story that he basically leveled up in Google.\r\n\r\n\r\nNikolas Hulewsky (07:48.427)\r\nyeah.\r\n\r\n\r\nNikolas Hulewsky (08:03.022)\r\nMm-hmm.\r\n\r\n\r\nLiz (08:06.037)\r\nbecause he just sort of entered the meetings and was the note taker. So anyhow, anyhow, okay, so yeah.\r\n\r\n\r\nNikolas Hulewsky (08:10.254)\r\nIt'll shift. It'll shift to be like, I entered the meetings now. I'm just the AI manager, you know, like the kid who shows them how to set up AI. But anyways.\r\n\r\n\r\nLiz (08:18.487)\r\nExactly. There you go. There you go. The new power play. Okay. So there's a bunch of other companies that are now in the tech world that again, just sort of like seeing what's in the future here of who are being AI first and this mindset. So I just wanted to illustrate a couple others and then a little bit of backlash. So Duolingo recently came out basically saying like, everybody needs to know AI. If you don't know AI,\r\n\r\n\r\nNikolas Hulewsky (08:34.584)\r\nMm-hmm.\r\n\r\n\r\nLiz (08:48.011)\r\nyou're basically gonna be done for at the company. It's part of the culture now. And just an outcome that they've already achieved is they basically doubled their catalog in a year, which used to take years per course that they would build. so, yeah, and so for those who don't know Duolingo, it's just basically learning other languages. And the story behind Duolingo for another day is really, really interesting in general. Really cool founder and... Okay, go for\r\n\r\n\r\nNikolas Hulewsky (09:02.314)\r\nOkay, so the course of catalogs.\r\n\r\n\r\nNikolas Hulewsky (09:14.242)\r\nI gotta show one thing with Duolingo real quick. This was the funny, I think this might be the funniest tweet I've ever seen. It's this guy, if people can't see it, he is at the NBA draft combine and they're testing his standing vertical and it's not great. And then Duolingo just retweets his video and says, learn Chinese and try Super Duolingo today.\r\n\r\n\r\nLiz (09:17.739)\r\nme.\r\n\r\n\r\nLiz (09:22.999)\r\nThanks\r\n\r\n\r\nNikolas Hulewsky (09:41.102)\r\nAnd the reason it's funny is because if you don't make it to the NBA, you're probably going to go play in China or Europe. And obviously Duolingo is calling them out. They're like, hey, you're not good. You're not getting drafted. You better learn how to speak another language. 14 million views from people is my whoever is the intern is that's running the Duolingo account needs a raise because that was freaking hilarious.\r\n\r\n\r\nLiz (09:51.878)\r\ngosh.\r\n\r\n\r\nLiz (10:01.185)\r\nYes, they have a very good brand and culture. Yeah, I'm a big fan. All right, next chart sort of with some more data on this topic.\r\n\r\n\r\nLiz (10:20.181)\r\nOkay, so again,\r\n\r\n\r\nNikolas Hulewsky (10:25.23)\r\nSo these are tech employees impacted by layoffs this year.\r\n\r\n\r\nLiz (10:27.849)\r\nYeah, so I just sort of wanted this year. So there are more layoffs happening and these are the big guys. So just to give it again, more context of what's going on, that there is a cut. Now I don't know again if this is software engineers or whatnot, but it's, know, things are happening. And again, this is just writing on the wall of, you know, AI is eating coding first, but it might just be the product managers because now the people who know what they're doing.\r\n\r\n\r\ndon't need a manager type of thing. So, unclear and unravel this data a bit, this is, yeah, I don't know what went on there. I have to dig a bit deeper, but yeah. So, Shopify is another one who is also going AI first and they've had slower head count growth. They've basically seen some amazing results though that they've been using it and seen like 8 % sales\r\n\r\n\r\nNikolas Hulewsky (10:57.409)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (11:03.438)\r\nPanasonic?\r\n\r\n\r\nJeez, that's a ton of tech liars.\r\n\r\n\r\nLiz (11:27.083)\r\nboost. I think that's in their conversion rates or percent for just their e-commerce businesses. Basically, AI is getting results for people is the bottom line. Workday also was another one with layoffs, 8.5 % of layoffs due to AI automation. Intuit said it had 10 % of layoffs due to help for support tasks.\r\n\r\n\r\nNikolas Hulewsky (11:36.397)\r\nOkay.\r\n\r\n\r\nLiz (11:51.411)\r\nCrowd strike which I don't know they may have had for other reasons that that was the one that was responsible for that big security Breach and their cyber security company So, I mean we're seeing this sort of across the tech sector But there's a bit of a silver lining.\r\n\r\n\r\nNikolas Hulewsky (11:55.704)\r\nMm-hmm.\r\n\r\n\r\nBreach. Yeah.\r\n\r\n\r\nLiz (12:14.401)\r\nKlarna was really the first on board with this. So Klarna is a payments company based out of Europe. They basically automated all of their customer support back about, I think it was only like a year ago even, and they just started rehiring. So that is good news for folks to know that humans still do matter and they need to have humans in the loop.\r\n\r\n\r\nAnd that ties into some other news. So anything else from you on that? Otherwise I'll dive into why humans.\r\n\r\n\r\nNikolas Hulewsky (12:44.78)\r\nNo, well, so I think what's interesting is like, this is all tech, right? It's like, the tech industry, these are the layoffs. This is what happened to these people. And if you're invested in the SMP or if you've got a retirement account, these companies matter to you because for whatever reason, you have brought exposure to them. But for most businesses that we know, like the sweaty, the boring SMBs, they might be looking at this and say like, okay, who cares?\r\n\r\n\r\nThe tech guys were fat and happy. They're making a ton of money now. They get to join the rest of us with layoffs. You said this, I don't know, a couple of weeks ago where you were like, politics is downstream of culture and tech, tech is upstream of culture. I look at this and I think, okay, if they're doing this now, this will happen to us down the road. And I don't mean that as a scary thing. And I actually get excited about this because\r\n\r\n\r\nLiz (13:26.849)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (13:41.612)\r\nWhat I would say to anybody who's been playing with AI, Liz, you've been playing with AI, and let's say you've eliminated some tasks or some work. Has the amount of time that you've been working reduced?\r\n\r\n\r\nLiz (13:53.665)\r\nthousand percent absolutely like orders of magnitude okay okay no I'm still spending time doing things I'm just doing a whole\r\n\r\n\r\nNikolas Hulewsky (13:56.514)\r\nWhat? No, no, no, let me ask it a different way. The amount of time spent on this stuff.\r\n\r\n\r\nNikolas Hulewsky (14:04.974)\r\nIt's probably increased. For me, it has. I'm doing more now from a time perspective than I ever have. I'm getting way more done. But I think that that is what the unlock is going to be, is that we are going to be spending probably the same amount of time, if not more time, but now we're to be able to do more with that. And so you, as a small business owner, you're probably going to be able to eliminate or lay off certain positions that are no longer needed from the administrative side. But to Liz's point,\r\n\r\n\r\nLiz (14:08.533)\r\nYeah. Yeah.\r\n\r\n\r\nYes. Yes.\r\n\r\n\r\nLiz (14:22.295)\r\nThank\r\n\r\n\r\nNikolas Hulewsky (14:34.498)\r\nThere's this counterbalance that's happening now where it's like, people want people. Like you were saying the other week, deals used to get done on the golf course, then they got done over Zoom. They're gonna start being done on the golf courses again, right? Like human to human interaction I think is gonna become even more important. So I don't get scared at these layoffs anymore. I actually am like excited to see what's the human element that comes out of the stronger in the future.\r\n\r\n\r\nLiz (14:47.265)\r\nYup. Yup.\r\n\r\n\r\nLiz (15:00.151)\r\nAbsolutely. I think, know, SMBs have a huge opportunity right now. I think their best position to like go gangbusters because large companies have change management issues. You still have a ton of people. They still have, you know, almost, you know, half a quarter of a million employees at Microsoft. Like to change that ship is hard. So if you as a small business can start taking advantage of these tools, you're much more nimble. You don't have to deal with as much change management.\r\n\r\n\r\nNikolas Hulewsky (15:26.179)\r\nYeah.\r\n\r\n\r\nLiz (15:27.787)\r\nNot to say it's still hard to deal with employees and that friction associated with it, but again, you can, as you were saying, Nick, do so much more with less and scale. All the things that were friction points and bottlenecks, you don't have to make that. good. Also with the layoffs is like, there's a lot of smart people now that are up for grabs. And if you need to build any of these tools, there's supply.\r\n\r\n\r\nNikolas Hulewsky (15:38.072)\r\nYeah.\r\n\r\n\r\nLiz (15:55.735)\r\nAnd so, not going to be as expensive as, you don't have to pay a massive salary necessarily, but those people still need to work and do things. having actually a lot of people out of work at these large tech companies is a good thing for the rest of us.\r\n\r\n\r\nNikolas Hulewsky (15:56.653)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (16:11.65)\r\nYeah, I totally agree. And if you're a smart business person and you're like, cool, I can eliminate the administrative tasks. know, 30 years ago, we were still faxing everything. Literally every company had a fax machine. We don't have fax machines anymore. We also don't have people who write the carbon copy for orders. It's all done online. All of those types of jobs that were done, that were manual, they're gone now. But they didn't disappear.\r\n\r\n\r\nLiz (16:21.781)\r\nExactly.\r\n\r\n\r\nNikolas Hulewsky (16:36.286)\r\nlike those people just didn't go out of the workforce, they transitioned into new things. And I think that we're going to see people transition into the things that matter, the product and the customer. Like those are the two fundamental things in a business anyways. Those other things are all supportive functions. And so if you eliminate the need for people in the supportive roles, they can get to focusing on the product and the customer. And that's where you're going to see differentiation from companies that are doing this early.\r\n\r\n\r\nLiz (16:43.657)\r\nExactly. Yep. Right.\r\n\r\n\r\nLiz (17:00.983)\r\nAbsolutely, absolutely. mean, we did a, actually, I don't know if I did the demo here, but built out a little tool just to enhance customer experience where like you could do remote lawn assessments or do a quote virtually in remote versus having to physically go on site. I mean, that is a huge accelerating factor in being able to close deals and being able to quote. Like that alone, I think is huge leverage for small businesses and you enhance the customer experience. Everybody's happy and everybody makes more money.\r\n\r\n\r\nNikolas Hulewsky (17:12.654)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (17:29.25)\r\nYeah. I love it. All right. So what did you have next? said that this was leading into the next thing you're excited about.\r\n\r\n\r\nLiz (17:35.475)\r\nOkay, quick news story and then we'll actually get to some tangible demos. Hallucinations are a thing. yeah.\r\n\r\n\r\nNikolas Hulewsky (17:43.07)\r\nNo. What? Wait a second. What is a hallucination, Liz?\r\n\r\n\r\nLiz (17:48.193)\r\nSo basically AI does lie. It makes stuff up. So you probably have experienced it if you've spent any time with AI. The thing to understand is AI is not like one plus one equals two. It is, okay, I see one, I see another one, the probability, and I see a plus sign, the probability that the answer is maybe two is high because I've looked at a bunch of other information saying that these patterns show up together. So it's something called\r\n\r\n\r\nNikolas Hulewsky (17:51.214)\r\nyou\r\n\r\n\r\nLiz (18:17.857)\r\nprobabilistic, I can never say that word, dealing with probabilities versus being deterministic. And so when you're dealing with that, probabilities are probabilities. You don't always get the outcome you're looking for. So that basically is what is behind the scenes when people talk about hallucinations and why those are showing up. And so we've been, like I saw this all over Grok this week of like crazy hallucinations, which sometimes can come from people actually program.\r\n\r\n\r\nNikolas Hulewsky (18:21.326)\r\nYou did great.\r\n\r\n\r\nLiz (18:46.561)\r\nprogramming in bias or it's just naturally doing it with these patterns.\r\n\r\n\r\nNikolas Hulewsky (18:50.542)\r\nSo all they did was acknowledge it. All they were like, yes, hallucinations are real.\r\n\r\n\r\nLiz (18:55.453)\r\nYeah, so actually there was news. So one, OpenAI came out with some new models. They had to roll one back because it was too, they added personality that made it too like sycophantic. So basically it was just like overly nice to you, which yeah, okay, nice. But so they had to roll that back and I guess it was just lying about a bunch of stuff because of that.\r\n\r\n\r\nAnd then they actually came out with numbers saying that between 33 % to 48 % were on some of the new models, were hallucinations, which is exactly. They were saying this on DeepSeq as well. it's not only, know, chat GPT, it's some of these other ones. So as they're like improving the models, it's not all perfectly, you\r\n\r\n\r\nNikolas Hulewsky (19:34.795)\r\nholy crap, that's super high.\r\n\r\n\r\nLiz (19:49.111)\r\nperfect improvements. It's actually like trade-offs and other things are happening. So, you you still have to have, again, the human in the loop. And I would be, you know, concerned always of just relying 100 % on AI. So I think that's, that's a key takeaway.\r\n\r\n\r\nNikolas Hulewsky (20:01.164)\r\nYeah. Cool.\r\n\r\n\r\nLiz (20:04.503)\r\nAnd with that, I wanted to demo here some custom GPTs.\r\n\r\n\r\nNikolas Hulewsky (20:13.966)\r\nOkay, let's do it.\r\n\r\n\r\nLiz (20:14.759)\r\nAnd we'll give you a real world example as to some of the hallucinations and why custom GPTs are not a bigger thing. But I think it's an important thing to still be aware of and to build.\r\n\r\n\r\nNikolas Hulewsky (20:26.178)\r\nYeah, while you're pulling that up, think I've said this a few times. A custom GPT is essentially just a prompt. So if you hear the words custom GPT and you get kind of freaked out, don't get freaked out. The idea is that there are repetitive tasks that you do all of the time that you need help with. And so in order to get the model to help you with that repetitive task, you've got to give it the context and set it up so that it spits out the right answer. The custom GPTs are a way for you to create it. So the prompts already there, it's already baked.\r\n\r\n\r\nand then you can give it the problem set to get the answer much quicker. So that's effectively what we're talking about with custom GPTs.\r\n\r\n\r\nLiz (21:03.351)\r\nOkay, so if you go into your just normal window when you're logged in, go to My GPTs, then you'll see a little place called Create GPT and then you'll pop up here. Let me move this, okay. So basically you have Create and Configure. So Create is you essentially will put in context and information here, but Configure is really where you wanna be. You give it a title, description, and then instructions.\r\n\r\n\r\nConversation starters, which are just when someone comes onto the screen just to know what is this, what do you start with, what do you mean? So let me just pull up an example.\r\n\r\n\r\nSo it's like I've created conversation starters for I'm looking for an episode where a founder bought something or whatever. The thing that people are sleeping on though. Okay, so actually before I get into the thing people are sleeping on. So then you would add in like knowledge. So this is again, if you have files or again, context documents, things you'd want to include to create some kind of relevancy to the prompts you're going on.\r\n\r\n\r\nthen you give it capabilities. So web search, Canvas, which Canvas is coding, image generation, code interpreter, and data analysis. But the thing people have been sleeping on is actions. So what actions do are similar to a concept that we will eventually talk about that I am constantly excited about with model context protocol. So this allows you to call tools, which are essentially like other AI automations with Zapier or actual APIs.\r\n\r\n\r\nyou can pull in into this area and then within the prompting, you can basically say, I want, let's say like they have an example around the weather. Like you can say, you know, what's the weather.\r\n\r\n\r\nLiz (22:57.291)\r\ntoday in, we'll do San Francisco. And it's gonna go and pull, hopefully this works because I didn't test this, but it's gonna go pull the weather. There you go. So this is just literally, it can connect into this API that has weather and it pulls it up. And so this allows you again to pull data from either your internal software tools, web apps that have an API, so on and so forth.\r\n\r\n\r\nNikolas Hulewsky (23:03.342)\r\nHmm.\r\n\r\n\r\nLiz (23:25.687)\r\nAnd so this is a very similar, but more straightforward concept than the model context protocol. The challenge has been, and I have found this with custom GPTs is the hallucinations. So as we were talking about, I have slept on this custom GPTs and building out more of them because they just have not worked as effectively at versus I think the in-clawed and model context protocol has fewer hallucinations. So, go ahead.\r\n\r\n\r\nNikolas Hulewsky (23:54.52)\r\nSo let's, I love this. I love how into the weeds you are. I wanna take it way back to the beginning for stupid people like me. Let's just go through what the custom GPT is first. And then I think that people will better understand how you utilize, what was it called? Tools, not tools, the actions. Okay, so let, can we just go, can we make a custom GPT really quick?\r\n\r\n\r\nLiz (24:12.468)\r\nYeah, the actions within custom. OK, well.\r\n\r\n\r\nLiz (24:19.329)\r\nSure, can make one or I have a demo we can do real quick as well. Okay. Let's do a demo, because I already have this configured. this is basically connecting to my calendar and email, because I know last week you asked, can we actually send an email from Claude? And so I thought, let's see if we can do it with... Okay, so I'm going to say, let's first check an email. So, okay, what was the last email? And hopefully, again, I don't know what emails I'm getting, so we'll see this is...\r\n\r\n\r\nNikolas Hulewsky (24:23.264)\r\nSure, let's do a demo.\r\n\r\n\r\nNikolas Hulewsky (24:29.577)\r\nThanks.\r\n\r\n\r\nNikolas Hulewsky (24:33.966)\r\nMm-hmm.\r\n\r\n\r\nLet's see if we can do it, yeah.\r\n\r\n\r\nNikolas Hulewsky (24:48.098)\r\nHa ha!\r\n\r\n\r\nLiz (24:48.727)\r\nWhat was the last email I received? Only share one results.\r\n\r\n\r\nLiz (24:59.511)\r\nOkay, so this is the other thing is to.\r\n\r\n\r\nNikolas Hulewsky (25:00.11)\r\nAnd we're doing this through ChatGPT, correct? Okay.\r\n\r\n\r\nLiz (25:04.919)\r\nCorrect, this is chat GPT. So it'll always prompt you to connect to these third party things. So I connected it with Zapier and that's why it prompted me to do that, which I have already configured and connected. All right, so now it's gonna again, permissioning and confirming things.\r\n\r\n\r\nNikolas Hulewsky (25:20.322)\r\nAnd does it have to do that every time? it every single time you have to sign in and say, yes, I approve?\r\n\r\n\r\nLiz (25:23.415)\r\nThere are certain ways to do it where you don't have to do it as much, but at some point there's always going to be some element of confirmation, not as frequently as we just saw, but other possibilities. And so we can just see, okay, it's saying find email received. There we go. Okay. All right. So this is just an email newsletter I got. Okay. So it basically provided gatekeeper, gatecrasher, something, something, blah, blah, blah. Okay. So now we're going to say,\r\n\r\n\r\nNikolas Hulewsky (25:32.332)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (25:51.374)\r\nMmm.\r\n\r\n\r\nLiz (25:52.469)\r\nLet me actually just pull up my email over here and we'll bring it over to the window just to make sure there's nothing weird I can share.\r\n\r\n\r\nbut to validate that that was correct.\r\n\r\n\r\nNikolas Hulewsky (26:09.592)\r\nSo while Claude has a native integration with Google, you achieved the same thing effectively using Zapier.\r\n\r\n\r\nLiz (26:16.695)\r\nUsing Zapier, and this one I wanted to do before we did Claude stuff, because this is actually much simpler. Okay, so yeah, so basically this was correct. This was the most recent email I received here. So create a newsletter, whatever. Okay, so now what we're gonna do is we're gonna look in my drafts. Okay, so you see I've got drafts here.\r\n\r\n\r\nNikolas Hulewsky (26:33.452)\r\nWow.\r\n\r\n\r\nLiz (26:38.775)\r\nSo now we're gonna pop back over to here and we're gonna say, I'm just gonna do a draft. Actually we can even, why don't I, well, we'll do a draft and then I can even shoot you over an email and tell me if you received it, okay. Create.\r\n\r\n\r\na draft responding to this email saying, yo, what's up? All right. I don't know. Simple, whatever. Obviously use business speak and be nicer. Okay. So confirm.\r\n\r\n\r\nBut as you can see, is nothing there. It's, whoops. It's working. Okay, review and confirm it here. So I guess it helps me pop over. Okay. So this is the other annoying thing is that I have to like go and confirm this here, which at some point I think they'll remove as a step. Okay. And now let's refresh.\r\n\r\n\r\nNikolas Hulewsky (27:11.086)\r\nI see you do have to confirm.\r\n\r\n\r\nNikolas Hulewsky (27:37.934)\r\nOkay, so while you're doing this, you can actually push it to do functions. Can you ask it to do qualitative work? Can you say, hey, take a look at my emails and tell me which is the most important to respond to today? Or how many emails do I have unread? Or what was my last communication with Brian about this project? Like, can it do those things?\r\n\r\n\r\nLiz (27:55.785)\r\nYes, it can. I haven't put the instructions in here for it to do that. So let's see just from my prompting. Basically, this is the limitation. It some GPTs. You want to give it a narrow function. And it sometimes doesn't go outside of the scope of the rules. But let's see. I don't know. OK, which is most important. Respond to today.\r\n\r\n\r\nNikolas Hulewsky (28:02.263)\r\nOkay.\r\n\r\n\r\nLiz (28:19.479)\r\nLet's see if my, okay, so the draft didn't show up.\r\n\r\n\r\nI'm gonna be sure it might be on a different email. I don't know, that was the right email.\r\n\r\n\r\nLiz (28:40.607)\r\nSo this might have been a demo fail. We'll see.\r\n\r\n\r\nNikolas Hulewsky (28:42.936)\r\nfine. Go, well I want you to go to the GPT itself and show us how you set it up and then also show us Zapier.\r\n\r\n\r\nLiz (28:47.723)\r\nYes. Okay, so this one, this is where again, like I think it's very good for very simple things, but this is where like limitations are from GPT.\r\n\r\n\r\nNikolas Hulewsky (28:57.292)\r\nYeah. Well, and you didn't, like you said, you didn't write the prompt to let it know what most important means.\r\n\r\n\r\nLiz (29:03.281)\r\nExactly. Okay, so let's go back. Okay, we'll go, we'll just start a new one. Okay.\r\n\r\n\r\nLiz (29:13.845)\r\nOkay, here, okay, we'll do, what do we wanna do with this GPT? We want to.\r\n\r\n\r\nNikolas Hulewsky (29:20.632)\r\nLet's just show, yeah, email checker. Super simple.\r\n\r\n\r\nLiz (29:23.383)\r\nOkay, email checker. Okay.\r\n\r\n\r\nLiz (29:34.997)\r\nSo we're going to find the most important. So I'm going to go, I'm going to have Chad GPT write instructions for me for speed right now. Right. Instructions and a prompt for a custom GPT to find the most important emails. Have it exclude newsletters and other types of\r\n\r\n\r\nspam and only\r\n\r\n\r\nLiz (30:11.639)\r\nimportant ones. Let's see if it gives me instructions.\r\n\r\n\r\nLiz (30:20.565)\r\nOkay, so it gives.\r\n\r\n\r\nNikolas Hulewsky (30:21.166)\r\nOkay, so you're creating the prompt to be able to upload it to the custom GPT.\r\n\r\n\r\nLiz (30:25.717)\r\nYes, so give it a second here to go.\r\n\r\n\r\nLiz (30:44.225)\r\nOkay, so I'd probably have to read through these and check these to make sure, but basically it's going through and hopefully we'll find ones. Conversation starters, this is again when you get to that first screen just to see like, what do I do when I get here? So find important emails, okay. The knowledge, we could upload some files.\r\n\r\n\r\nand I think of what would be a good example here and we go back to my.\r\n\r\n\r\nNikolas Hulewsky (31:13.698)\r\nYeah, mean the knowledge, knowledge makes sense. How did you do the Zap? Like show me how you did that.\r\n\r\n\r\nLiz (31:17.493)\r\nthe Zap. OK, so this is actually pretty simple when it comes to Zapier. All the other ones, it gets more complicated. So first, they have this area called authentication. When you're using Zapier, you don't need to worry about any of this. When you get more complicated, you'll have to put in OAuth API keys. That's a long demo. We won't go into that for today. Then they have this area called schemas, which is where you're going to basically copy and paste code. So I say copy and paste, so don't get scared when you see code here.\r\n\r\n\r\nBut the simplest thing is you're going to import a URL and you're going to get that from Zapier, which they've made it super simple. That's why Zapier is a good tool for this sort of thing. For simplicity, now let me find where the...\r\n\r\n\r\nwe find the link wrote.\r\n\r\n\r\nLiz (32:34.236)\r\nfor the link of course.\r\n\r\n\r\nNikolas Hulewsky (32:36.558)\r\nYou can't just show the one that you already set up?\r\n\r\n\r\nLiz (32:38.839)\r\nI don't know if it still has the link, let me see. Yeah.\r\n\r\n\r\nNikolas Hulewsky (32:41.273)\r\nokay.\r\n\r\n\r\nLiz (32:49.525)\r\nYeah, it removes the link. Actually, let's see if, this is it.\r\n\r\n\r\nLiz (33:01.129)\r\nNo, okay. Sorry, did not have this thing prepared.\r\n\r\n\r\nNikolas Hulewsky (33:05.198)\r\nIt's okay. Let's actually just go back for a second. So we have, I'll ask you a question that's easier to, that you don't have to do as much like prep work for. So you have the custom GPTs that are fairly simple to set up and create. You can put the instructions in, you can upload context documents. How do you, will you show me where you go in the custom GPT to link Zapier to do the action?\r\n\r\n\r\nLiz (33:34.219)\r\nYes. Okay. So I did find, okay, so I will, we'll put the link in the description, but I did find it. So all we're going to do is drop this link that is actions.zapier.com slash GPT slash start. Hopefully this is it. okay. I need to find the link. Okay. Sorry about that. Okay. I'll have to read the instructions again. Okay.\r\n\r\n\r\nNikolas Hulewsky (33:34.67)\r\nHow do you?\r\n\r\n\r\nNikolas Hulewsky (33:40.173)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (33:49.485)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (33:53.806)\r\nNo, you're\r\n\r\n\r\nLiz (33:58.219)\r\nSo there's this area called actions.zapier.com slash providers. This is where you can also set up these things called model context protocol, which is for Claude. And then you have the open AI GPT area. And so you're gonna edit actions. And then it brings you to this little pop-up. You're seeing the pop-up? No, okay, sorry, it's how I sharing the.\r\n\r\n\r\nNikolas Hulewsky (34:18.126)\r\nNo.\r\n\r\n\r\nLiz (34:28.843)\r\nOkay, now you should see it. So again, actions.zapier.com slash GPT slash actions. This is where you configure all of your little tools that you have or apps you have within Zapier. So these are all the ones I've enabled so far. So what you do is you go to equip your own GPT with AI actions.\r\n\r\n\r\nLiz (34:57.377)\r\nThat's not the button. Okay. Go ahead and add action.\r\n\r\n\r\nNikolas Hulewsky (34:58.808)\r\nOkay, here I have, no, no, no, no, no, I have an idea. Let's keep the first half of this and then let's plan out this, this GPT example. We can record this on Monday or Tuesday. So I'll tell Kelly to keep half of this and then the second half we'll do. So here's what I'm thinking would be really, really good for this. do step one, like start to finish and we can do the exact example that you've set. Here's a very narrow use case.\r\n\r\n\r\nLiz (35:13.739)\r\nOkay, okay.\r\n\r\n\r\nLiz (35:17.687)\r\nOkay. Okay.\r\n\r\n\r\nNikolas Hulewsky (35:29.16)\r\nof checking your email. But in that use case, we're going to show you how to set up a custom GPT. And then after we set up the custom GPT, we're going to show you how to integrate it using Zapier to your email. And so the custom GPT would go ahead, ask your question.\r\n\r\n\r\nLiz (35:41.995)\r\nOkay, so me.\r\n\r\n\r\nI was thinking for the rest of this episode maybe then we can just contrast a demo with Claude and then maybe do a separate episode on the how-to. I don't know, just for a, unless you just think that was good enough just to show that or just to end it out, unless you feel like that.\r\n\r\n\r\nNikolas Hulewsky (36:00.524)\r\nWell, what I'm saying is like, we keep the first half of this episode and then we record something else on Monday or Tuesday and add it. Yeah, yeah, yeah, yeah.\r\n\r\n\r\nLiz (36:04.854)\r\nOkay.\r\n\r\n\r\nGot it Okay, okay, totally fine totally fine. Yeah, sorry I yeah, you know this year well enough\r\n\r\n\r\nNikolas Hulewsky (36:13.72)\r\nCause cause that would, don't have to apologize. It's fine. but I, I think like creating the custom GPT would be, all right, we've got the context document. We've got the prompt. It's like, it's like already done. We don't necessarily have to go and grab it. And then we create the GPT cool. And then we show on the GPT. All right. Like, I don't even know where, where am I supposed to click to do this integration? Right. Like, was it the code interpreter? That's not code interpreter.\r\n\r\n\r\nLiz (36:27.659)\r\nYeah. Yeah.\r\n\r\n\r\nLiz (36:42.601)\r\nYeah, no, it was the.\r\n\r\n\r\nSorry, to do a custom GPT or sorry, to do which integration you're asking. okay, so create, I lost it already. Create new action. Yeah, and so.\r\n\r\n\r\nNikolas Hulewsky (36:50.796)\r\nactions.\r\n\r\n\r\nNikolas Hulewsky (36:57.204)\r\nThere, okay. Yeah, and so then the second piece of it would be, right, let's do the create new action. Great, we click on that, and then we already have the zappier stuff already set, like we just already know where it is and show it really quickly so that you're not feeling like, crap, where is this stuff? And.\r\n\r\n\r\nLiz (37:11.861)\r\nYeah. Yeah.\r\n\r\n\r\nLiz (37:17.333)\r\nYeah, and sorry, I thought I had it teed up and I definitely did not. I apologize, totally apologize on that. Okay. No, I don't like not being, you know, having it buttoned up and things. So today could have been better, that's okay.\r\n\r\n\r\nNikolas Hulewsky (37:20.45)\r\nDo it good. Don't apologize. It a good dry run.\r\n\r\n\r\nNikolas Hulewsky (37:30.486)\r\nIt'll look, it'll be, it'll be great. I just think we need to have it a little more step structured. Yeah. because then we can, to me, this is, this would double as a training of like, okay, this is an episode and then we can take this and just also have this as a training because custom GPTs are really important. And then like you were saying, it's like, these are the training wheels for MCPs.\r\n\r\n\r\nLiz (37:35.477)\r\nYep. Okay.\r\n\r\n\r\nLiz (37:41.919)\r\nYeah, absolutely.\r\n\r\n\r\nLiz (37:46.775)\r\nTotally.\r\n\r\n\r\nLiz (37:51.455)\r\nExactly. Okay, cool. So we'll do it Monday then or whenever you're available. I'll get it step by step. Very granular. Yeah. And then let me talk to you then related. So I did create your Nick one, but I'm like, this is shit. Like, well, I know it's, it's shit. I sent you a quick note on it and it's just, so I uploaded. was like, cause this is, it be the simplest way? And I just hadn't really used these because I just don't like GPT.\r\n\r\n\r\nNikolas Hulewsky (37:53.474)\r\nWhat's up?\r\n\r\n\r\nLiz (38:21.399)\r\nAnd I don't like it because I just find that the response, like I love Claude. I love the responses I get from Claude. Like they're me, they're structured. It knows what I need. does that, goes extra mile. With Chashu PC, it's always like short and pithy. I don't know. And I just haven't spent, I mean, I have just a time. Yeah, exactly. It just seems to be hallucinating a lot as well. And that's what I found with this. Like I was like, great, super simple.\r\n\r\n\r\nNikolas Hulewsky (38:21.592)\r\nWhat do mean?\r\n\r\n\r\nNikolas Hulewsky (38:28.77)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (38:39.106)\r\nThe output, you're not a fan of the output. Okay, yeah, yeah, yeah, that makes sense.\r\n\r\n\r\nLiz (38:49.153)\r\nSo was like, let me just do the chatbot this way. I could do it other ways, but I was like, okay. So I put instructions to get an output basically of some of the data from your spreadsheet, conversation starters, updated your knowledge base you shared, removed everything else, but then watch. let's ask, ask me a question about one of your episodes.\r\n\r\n\r\nNikolas Hulewsky (38:59.342)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (39:10.862)\r\nwho did I talk to that owns a laundromat?\r\n\r\n\r\nLiz (39:15.104)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (39:24.003)\r\nYeah.\r\n\r\n\r\nLiz (39:26.039)\r\nAll right. All right. Was that correct? I don't know if that's...\r\n\r\n\r\nNikolas Hulewsky (39:30.89)\r\nNo.\r\n\r\n\r\nLiz (39:31.543)\r\nYeah, exactly. So I was like trying to figure out how, why it's exactly. And I took off web search and it's hallucinating like crazy. And I was like trying to even figure out, I change the model? And there's just so many weird things with this, but yeah. So it's shit. It's sorry. Cause it might excuse my language, like, I was like, okay, so ease of use anyways. Cause I went down this rabbit hole after you told me about the guy who was using custom GPTs. And I'm like, really? He's using all these, but anyhow.\r\n\r\n\r\nNikolas Hulewsky (39:34.03)\r\nShreefali, I've never had anybody named Shreefali.\r\n\r\n\r\nNikolas Hulewsky (39:48.654)\r\nHmm.\r\n\r\n\r\nLiz (40:01.463)\r\nIt's proved to me why I don't like it. So I have to figure out if it's like my instructions or something, but it's just, I think this is the why these, this is not more popular. So.\r\n\r\n\r\nNikolas Hulewsky (40:12.056)\r\nWell, I, I'll show you something.\r\n\r\n\r\nLiz (40:15.254)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (40:17.804)\r\nI had Kelly go through and...\r\n\r\n\r\nstructure some data for me. So like all of my episodes, is notebook LM. Have you ever messed with notebook LM? Okay. I.\r\n\r\n\r\nLiz (40:31.479)\r\nOh yeah, I love it. It's great. It's the, it's the least hallucinant who salutes. Yeah. Yeah. Thank you.\r\n\r\n\r\nNikolas Hulewsky (40:36.12)\r\nhallucinogenic, I love it. I think it's the best. So I had her structure it in increments of 40 episodes, 40 transcripts. And so now what I can do is I can come into any of these and I can start asking it obviously questions about these episodes. And I'm looking at it for more of like, find all of the times we spoke about.\r\n\r\n\r\nLiz (40:54.667)\r\nYep.\r\n\r\n\r\nNikolas Hulewsky (41:06.638)\r\nframeworks. And so because it doesn't hallucinate, it'll tell me the actual times that it found all those frameworks. The problem is what I don't know is how to like build an interface to be able to query all of them at the same time.\r\n\r\n\r\nLiz (41:21.537)\r\nSo you can't, Notebook LM doesn't have any API yet and I don't know if they will because they want to keep you here. Number two, they, yeah, it limits the amount of data you can put in, which I don't know if they've increased, but it sounds like not given you guys probably maxed it. So.\r\n\r\n\r\nNikolas Hulewsky (41:27.054)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (41:38.444)\r\nI didn't max it. probably could have put close to 100, but maybe I'm wrong about this. Someone told me that essentially the context window isn't just about how much you put in, it's also what it's able to put out. So I don't like to max out the context window. So anyways, I like this because it tells me and gives me the timestamps for all of these things. I think that's fantastic. But yeah, I'm still trying to find that solution.\r\n\r\n\r\nLiz (41:50.081)\r\nway.\r\n\r\n\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (42:06.316)\r\nAnd it may be that we just need to come through and use Notebook LM to structure specific. I don't know.\r\n\r\n\r\nLiz (42:17.505)\r\nWell, when you say solution, what is the problem? You just be able to query everything.\r\n\r\n\r\nNikolas Hulewsky (42:24.034)\r\nthere's two things that I was trying to solve. The first thing that I was trying to solve was. I have a lot of things in my episodes that I know that I've spoken about and I want to extract them and make tools out of essentially, but I don't know how to go and find all of those things. And even with a spreadsheet, it's not going to have like specific examples that I've given. So the, the best.\r\n\r\n\r\nthat I've thought of is, I'm going to group them into five groups and I can go and query the same thing in each group. So for example, what are some stories that I've shared about buying businesses? And I can go in each group and I'll find those stories and I can extract them and do what I want with them. Frameworks is one of them. It's like, what are some frameworks that I think about? Cause I want to be able to like codify those frameworks. The other would be, let's put all the AI episodes in and then we can say like, okay, what are all of the softwares we use? What are all of the...\r\n\r\n\r\nterminology we use, like just easily create the terminology. And you may already be doing this because I know you've created your terminology sheet, but I'm just trying to figure out the easiest way for us to extract value so that we can then put it into a format that people will appreciate. that.\r\n\r\n\r\nLiz (43:34.645)\r\nYeah, okay, so I've started down this path for you as well. The last, the biggest piece though is getting the models to work perfectly. So there's a couple of things I'm gonna investigate. Obviously I would say from the like the most accurate notebook LM has, I agree so far been the best. The APIs are a little bit wonky. So like even\r\n\r\n\r\nI have to do a bunch of stuff to the API to get the kind of output that you would get from like a cloud's interface. So like, for instance, I've populated a bunch for the newsletters, like I've populated a bunch of the transcripts into a project, getting beautiful outputs. But when you run that through the API, there's stuff I have to do to get that same quality level, which is not a big deal, but I just have to like do it. So that's like one step I have to do. The second is then validating the\r\n\r\n\r\naccuracy and I don't know yet the answer to that. But once that's good.\r\n\r\n\r\nNikolas Hulewsky (44:38.798)\r\nWell, I guess I'm less concerned about it being a chat bot for a person to come in and interface with. I just want it to be something I can use or have a team that can query it and make tools, carousels, whatever.\r\n\r\n\r\nLiz (44:46.729)\r\nYe- yeah.\r\n\r\n\r\nLiz (44:51.573)\r\nYep. So all of that works ends up being the same. So yeah, because you need basically something to be able to query that that's called, that's RAG, that's Retrieval Augmented Generation. And so you can build out that database. There's some iteration that needs to happen to make that like good because you do have a lot of data and it's like how you basically sort of chunk that information together so that it's pulling the right stuff and being comprehensive.\r\n\r\n\r\nNikolas Hulewsky (45:04.43)\r\nHmm.\r\n\r\n\r\nLiz (45:20.983)\r\nI would say so far, project, Claude projects and notebook LM have been the best. But again, it's from the front end, from the backend and being able to do it at scale with large data set. Like there's still some work. So I will get there and I want to solve for this because if I can solve for this, then it's like so replicable in terms of the strategies to use for being, I mean, people just need this. And I know people have.\r\n\r\n\r\nNikolas Hulewsky (45:35.255)\r\nOkay.\r\n\r\n\r\nLiz (45:46.881)\r\ndone like a bunch of work here, I just have to do a little bit of research to see from like setting up our own so that it can be interfaced with the interface is like whatever it can be through email, Slack, chat bot, doesn't matter. It's that backend processing that's the key and then figuring out which models are going to be the right one, which again, that's like both of those things are solvable. I just have to do the work to build it out. So.\r\n\r\n\r\nNikolas Hulewsky (46:12.184)\r\nthink it has to be Notebook LM just because it is able to take.\r\n\r\n\r\nLiz (46:14.751)\r\nRight now, that's the winner. I mean, because it's accurate.\r\n\r\n\r\nNikolas Hulewsky (46:20.334)\r\nIt's accurate and it can take so much data.\r\n\r\n\r\nLiz (46:23.713)\r\nYeah. Yeah. Yeah. I agree. Like I haven't found anything that's better so far. but again, like, you know, it's Google. So if they start, you know, allowing that same capability with their model and a lot of people are raving about the new Gemini model. So I don't know. Yeah. Yeah. All the people that are coding are now using Gemini, which is interesting. So, yeah.\r\n\r\n\r\nNikolas Hulewsky (46:25.41)\r\nwhich is a very, like, yeah, I didn't realize how big of a difference it is.\r\n\r\n\r\nNikolas Hulewsky (46:42.881)\r\nBye,\r\n\r\n\r\nNikolas Hulewsky (46:49.314)\r\nis interesting.\r\n\r\n\r\nLiz (46:53.815)\r\nAll right, so I'll do some work on this as well. I have a couple other things I have to do before then. Obviously, finish up newsletter, school, I think, ready to go, needed to just tweak a couple things today. I'll have the thing ready.\r\n\r\n\r\nNikolas Hulewsky (47:09.528)\r\nLet me ask you this question. I have all these podcasts. I want to put all the AI series into a folder so I can upload it to Notebook LM because otherwise it's just really difficult to like one at a time add a file to Notebook transcript to Notebook LM.\r\n\r\n\r\nLiz (47:14.731)\r\nMm-hmm.\r\n\r\n\r\nLiz (47:24.341)\r\nYeah, think I did that already. Hold on. think I put I think I did hold on. Let me double check because I know I was going down that path and I just don't know if I finished or was comprehensive.\r\n\r\n\r\nNikolas Hulewsky (47:27.987)\r\nyou did?\r\n\r\n\r\nLiz (47:37.343)\r\nAlso, all of your episodes are in the school community that are related to AI that I saw. And there was the 18 on the spreadsheet that I believe I did.\r\n\r\n\r\nNikolas Hulewsky (47:48.214)\r\nYeah, we've done more than that. And they say AI in them if they're an AI.\r\n\r\n\r\nLiz (47:52.147)\r\nOkay, all right, so then I found at least, hold on, let me see.\r\n\r\n\r\nLiz (48:04.375)\r\nYeah, because I think I even now turn on an automation that's copying any of those ones in your video folder and putting them over into another place and validating if they're AI related or not. So going forward, it's working. Let me just see where I set this up.\r\n\r\n\r\nNikolas Hulewsky (48:54.644)\r\nAnd there's someone here that you wouldn't know.\r\n\r\n\r\nNikolas Hulewsky (49:42.062)\r\nI gotta hop to a call that's starting really soon, but we will touch base later.\r\n\r\n\r\nLiz (49:43.319)\r\nOkay. All right. We also do some notes on this once I get it all. Okay. All right. Thanks. Bye.\r\n\r\n\r\nNikolas Hulewsky (49:49.89)\r\nOkay, thanks Liz, see ya. Bye.",
  "metadata": {
    "duration": "",
    "date": "2025-05-21",
    "platform_source": "Google Drive"
  }
}