{
  "episode_number": "186",
  "episode_title": "How to Build a Business That Can Run Without You with John Seiffer",
  "guest_name": "John Seiffer",
  "business_name": "CEO Bootcamp",
  "transcript": "﻿Nikolas Hulewsky (00:01.383)\r\nJohn, I'm excited because whoever's listening to this, if you're an entrepreneur who's trying to figure out how to scale, how to systematize, how to get to the next level, this episode is for you. I'm talking to the one and only John Seifer. He has a book called Output Thinking that many of you may have seen or read. And I just love the way that you think about systematizing so that you can then scale for the next segment of growth. So I'm really excited to talk to you today and get some like practical hands-on.\r\n\r\n\r\nyou know, takeaways for people who trying to figure out how to get to the next level of their business. But before we do that, you're not just a pretty face. You actually have some experience. You've owned what? Owned and operated multiple businesses. I think you say you've always been unemployable. You've never had a job. You've had businesses that you ran. I think your most profitable business was a business that you actually had no day-to-day operations in. What do you love the most about entrepreneurship?\r\n\r\n\r\nJohn Seiffer (00:57.358)\r\nI love, and it took me a while to figure this out about my own businesses. I love learning how the parts fit together, how the business model works, how it can scale. I hate doing the same thing day after day after day after day. So what I say to people is, I'm so lazy, I'll work my ass off to figure out how not to do something.\r\n\r\n\r\nNikolas Hulewsky (01:10.867)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (01:18.867)\r\nSo you're like my friend Chris, Chris has never had a job. I've had a job and my wife, it's always bugged her. She's like, why can't you just be happy collecting a really good paycheck and doing something easy? I'm like, I wish that I could be, sweetie. I wish that I could be, but I can't. I just like, I'm always thinking and tinkering.\r\n\r\n\r\nJohn Seiffer (01:31.149)\r\nHahaha\r\n\r\n\r\nYeah, it's a disease, but you know.\r\n\r\n\r\nNikolas Hulewsky (01:35.995)\r\nIt is a disease. So the reason I love, I wanted to talk to you today is because I've been talking to more and more entrepreneurs and what I'm seeing more and more are these phases of the business. And I kind of want, I want to tell you my thoughts and then I want to get your opinion on it. I think that there are kind of five phases to an SMB. There's the solopreneur phase where I'm going to give some revenue numbers. Obviously these can change, but I'm just giving them.\r\n\r\n\r\n$250,000 a year in revenue or less, it's you. You're doing everything. You're the consultant, you're IT, you do payables, you do every facet of the business. And then there comes the next level, which is like 250 to 500, let's call it, where you have a little agency and maybe you've got a VA or two, but you've got no full-time employees, but you've got a little bit of a team. And then the next phase is like 500,000 to a million, where you're hiring your first full-time employees. You've got...\r\n\r\n\r\nYou've got a business that's running, but you're still doing the majority of the functions. And then at a million to 2 million, you've got a real business that can run and grow outside of just you putting in all the inputs, but you're still the CEO. You're still running everything. Like you are the business. And then like past 2 million, there's probably a couple other phases, but past 2 million, you can get to a place where you could hire the operator, that unicorn phase. Many businesses are like, just want to hire an operator.\r\n\r\n\r\nBut you're large enough now where you have some scale and it's a business. It's not a job. It's a business that has repeatable processes. It's got frameworks. It's got a real clear value prop, et cetera. Before I get to my thesis, is that a pretty fair generalization of just the different phases people go through in the SMB space?\r\n\r\n\r\nJohn Seiffer (03:18.39)\r\nThe phases are, I'll tell you why later, why revenue is such a terrible way to look at that. But, you know, just look at it like this. A $2 million software company can be very profitable if there's no investors. A $2 million restaurant is probably squeaking by, and a $2 million construction company, unless it's just a one-person remodeler, is not doing well at all. So.\r\n\r\n\r\nNikolas Hulewsky (03:25.747)\r\nHorrible way. I agree. I agree.\r\n\r\n\r\nNikolas Hulewsky (03:46.203)\r\nYeah, that's a freaking great point. Probably employees is the better metric.\r\n\r\n\r\nJohn Seiffer (03:50.434)\r\nYeah, employees are better. I go back to, Peter Drucker had a great quote and he said, we have to figure out what's the purpose of a business. And I start a lot of my talks this way. say, the purpose of a business is to create blank, fill in the blank. The blank is, if people say wealth and solutions and problem solving and all that, no, it's to create a customer. And if you have a customer, you have a business.\r\n\r\n\r\nAnd then you can get wealth and you can do all that other stuff, but you don't have a business without a customer. It's a hobby. It's a charity. It's could be wonderful things, but not a business. So what is a customer? A customer, somebody pays you and they pay you for something they want more than they want their money. So the two key components of a business are finding those customers and selling to them and then delivering what they bought. Now, as the organizational scales, you have to start doing a whole lot of support stuff.\r\n\r\n\r\nYou have to track the money. You have to hire people. You have to do all that stuff. And the organization gets bigger and bigger. Eventually you set goals and you have scaling and all this good stuff. If you look at it, and that's where the idea of output thinking came from. If you look at it from, am I hiring people? I'm hiring them to produce certain things. And as you did hit it, that when things start out, you're doing it all yourself. If you bootstrap the company or if you started it.\r\n\r\n\r\nyou are doing the selling, you are doing the fulfillment. And when you get around to it, you keep the books and empty the garbage and do all that other stuff. Yeah, you know, the key is that there's actually a stage of a company and it generally goes up to about 250 in revenue where even when you hire people, they're helping you sell and fulfill.\r\n\r\n\r\nNikolas Hulewsky (05:29.885)\r\nHopefully, yeah, hopefully.\r\n\r\n\r\nJohn Seiffer (05:48.962)\r\nyou're doing the customer facing stuff. The next phase, now, if you're a neurosurgeon or if you're a rock star or if you're an athlete, it's still all you. Now you're just making millions instead of the 250, but a typical contractor or remodeler or long care person or whatever. The next phase of a company is you now have people who are responsible to sell and to do the fulfillment.\r\n\r\n\r\nNikolas Hulewsky (06:00.851)\r\nSure.\r\n\r\n\r\nJohn Seiffer (06:16.288)\r\nAnd you as the owner are now focused internally on building systems, on helping people do, on workflow design, on hiring people. That's a huge mental shift for a lot of people.\r\n\r\n\r\nNikolas Hulewsky (06:28.229)\r\nmassive ventures. Well, and that's the reason I kind of break it up into this framework. Here's the rest of my framework is like you kind of have these different phases, but at each phase, a new skill set is required of you as the entrepreneur. You've got to start thinking like, you know, when you make that first VA hire, it's that's a very different hire than hiring a CEO. You're looking for dairy, different things like you don't even know what a job description is probably when you hire that first VA. And what I say to a lot of entrepreneurs is that\r\n\r\n\r\nJohn Seiffer (06:41.123)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (06:57.711)\r\nOver time, when you first build the business, you are the differentiator. Whatever you're doing, right? It could be the way you sell, it could be the way you deliver, could be your thinking, whatever it is, you're the differentiator. And over time as you build, your goal is to offload the things that are not your unique differentiator to people. And eventually,\r\n\r\n\r\nthat leads to systematizing things. At first, it's just, well, I gotta get somebody to pay the bills or I gotta get somebody to send follow-up emails or I gotta get somebody to track my books, whatever. Those are things that are kind of, they all taste like chicken. You know, they're inconsequential to the business, but eventually then you're hiring salespeople, then you're hiring fulfillment, then you're hiring people to actually do the things that was your differentiator. And in order for you to hire them, you've got to have systems in place so that they still deliver what you had set out to deliver. And that's what allows you to then scale.\r\n\r\n\r\nIt's very similar to what you're articulating is like over time, you're building out these systems that allow you to scale yourself and many entrepreneurs kind of stops at whatever level it is that they can no longer let go of keeping everything in.\r\n\r\n\r\nJohn Seiffer (07:51.564)\r\nYeah, exactly.\r\n\r\n\r\nJohn Seiffer (08:03.17)\r\nRight. And I think many entrepreneurs get a bad rap because they're thought of as control freaks. And I don't think that's the, there are certainly control freaks in the business, but I don't think that's ultimately the problem. Many, many times the problem is entrepreneurs are intuitive and they're quick and they just get it, but they aren't procedural and process oriented. So I call it grandma in the kitchen with no recipe.\r\n\r\n\r\nNikolas Hulewsky (08:15.805)\r\nYeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (08:29.107)\r\nMm-hmm.\r\n\r\n\r\nJohn Seiffer (08:32.343)\r\nFood is great. Thanksgiving dinner's wonderful. Birthday dinners are terrific. And I used to say, you can't scale a restaurant with just grandmas. It turns out there is one in New York City, I can't remember the name of it now, but they hire grandmas from other countries to come in and cook the recipes that they grew up with in these other countries. But they're not going to be a nationwide chain, you know?\r\n\r\n\r\nNikolas Hulewsky (08:54.844)\r\nNo way.\r\n\r\n\r\nJohn Seiffer (09:02.292)\r\nAnd so they have to do what you said about offloading this stuff. But then the next level is they have to replicate the things that they do especially well so that other people can do it just as well as they did. That extra little oomph to the sales. Get that out of your head. Why is it that you are so good at this or that extra little thing? know, Steve Jobs is famous for, among other things,\r\n\r\n\r\nNikolas Hulewsky (09:18.579)\r\nMm-hmm.\r\n\r\n\r\nJohn Seiffer (09:31.028)\r\nmaking the insides of his computers pretty, even though nobody will ever look there. That was just his dynamic. Well, he drilled that into all his people so that they thought that way and they did things that way. it's, yeah, it's defining outputs at that level of detail that this is what we're doing and why.\r\n\r\n\r\nNikolas Hulewsky (09:45.359)\r\nSo is that is that what output thinking is? Is that how you would describe it?\r\n\r\n\r\nNikolas Hulewsky (09:55.483)\r\nI'm assuming you didn't start out this way. So what was the moment that you said, never again will I have a business that I do not document or I don't have SOPs or I don't even know what the verbiage was at the time.\r\n\r\n\r\nJohn Seiffer (10:05.848)\r\nSo.\r\n\r\n\r\nYeah, so it wasn't about that. That didn't click in that way till I looked back on it. But one of the first businesses that I ever had that was profitable was a window cleaning company. And the thing about window cleaning is it's a low bar of entry. So anybody who's any good is working for themselves. They don't need you. Anybody that was working for me was like, couldn't get another job.\r\n\r\n\r\nNikolas Hulewsky (10:32.179)\r\nRight.\r\n\r\n\r\nJohn Seiffer (10:37.678)\r\nAnd I thought, man, I'm going to have like 10 trucks on the road and half of these people are to show up drunk. And I thought, I don't really want to build a business like that. And so it turned out, I was living in Dallas at the time. Dallas was a center of technical communication. And so somebody had given me a computer. This was an Apple II. I loved playing with it. The documentation was terrible.\r\n\r\n\r\nNikolas Hulewsky (10:44.237)\r\nHahaha.\r\n\r\n\r\nJohn Seiffer (11:04.93)\r\nbumped into some people and learned there was a thing called technical writing. And so I got a contracting gig doing technical writing while running my window cleaning business on the side. So my business turned into a side gig. And I didn't want to scale that business, but I didn't know what else to do, but I didn't want to get rid of it. So that's kind of when I got out of that day-to-day stuff. And then I started, a buddy of mine actually started this\r\n\r\n\r\nNikolas Hulewsky (11:08.979)\r\nHmm.\r\n\r\n\r\nJohn Seiffer (11:34.9)\r\nother business that I mentioned in the book about, we sold movie libraries to apartments and they used it as a marketing tool. If you rent the apartment here, you can borrow the movies for free overnight and then we supplied them with like 50 movies and we changed them out every month. So I had this little Netflix thing going before it was Netflix. yeah, so the long story short of that is that business\r\n\r\n\r\nNikolas Hulewsky (11:55.73)\r\nReally?\r\n\r\n\r\nJohn Seiffer (12:03.866)\r\nlasted, outlasted Netflix's DVDs in the mail. It outlasted Blockbuster and it outlasted Redbox at a very, at a very small scale. I mean, we were huge at one point all across the country. And obviously I saw the internet coming, you know, that's the business that I moved 1500 miles away from because I didn't like living in Texas. No offense to the Texans that are my friends, but it was just too hot. I grew up in the Northeast and wanted to be there.\r\n\r\n\r\nNikolas Hulewsky (12:12.507)\r\nNo way.\r\n\r\n\r\nNikolas Hulewsky (12:30.44)\r\nYeah.\r\n\r\n\r\nJohn Seiffer (12:33.538)\r\nbut I couldn't move the company because our customer base was centered around the Southwest. And it didn't make sense to move the company. So I moved myself and literally they would overnight me data tapes so I could see what was going on. It was before the internet made that easy. And it got to the point where once we figured out the marketing, which was the trickiest part, I didn't have a lot of work to do. And...\r\n\r\n\r\nAt one point I said to somebody, could I sell this thing? He goes, yeah, you could probably get three times EBITDA for it. And I said, why would I do that? In three years, I'll have the EBITDA and the business and I'm not working that hard. We got into the seven figures and I was taking home like 40 % net profit. And yeah, I was like, this is killer. We had like 700 at one point.\r\n\r\n\r\nNikolas Hulewsky (13:11.781)\r\nSo how big was the business at that time?\r\n\r\n\r\nNikolas Hulewsky (13:19.854)\r\nWow.\r\n\r\n\r\nHow many customers did you have?\r\n\r\n\r\nOkay, so it was, from a volume standpoint, was big.\r\n\r\n\r\nJohn Seiffer (13:27.35)\r\nIt was huge. had, you know, 10 employees. It wasn't a huge thing. If I had been a little more savvy about wheeling and dealing and I had gotten a little bigger, I might have gone to Blockbuster before they folded and said, we have a revenue stream for the movies you don't need. Why you buy us? I never got there. anyway, so I had this thing going and somebody and I was, like I said, phasing out of it.\r\n\r\n\r\nNikolas Hulewsky (13:45.747)\r\nMmm.\r\n\r\n\r\nJohn Seiffer (13:57.492)\r\nI eventually turned it over to my wife as things were moving from VHS tapes to DVDs. She took it over and kept it going for a long, long time. But before that, even I had scaled back and somebody said, you're looking at this thing called coaching. You'd be great at it. I said, what's that? I'd never heard of it outside of sports. And turns out there was people training business coaches and I got involved in that and love doing it. Was part of a group that founded the International Coach Federation.\r\n\r\n\r\nI was their fourth president. They're up to like 50,000 members worldwide now. But it got me to see that I could actually learn more about other businesses and teach what I knew and help other people systemize. And I didn't think of it as systemizing the way I do now. Looking back, I'm like, that's exactly what I did. I had people producing different outputs and I tracked them.\r\n\r\n\r\nNikolas Hulewsky (14:38.705)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (14:53.491)\r\nWell, I talked to my wife about this recently, sometimes I write a lot, especially on social media. do a lot of posts and the way I do my posts is like, they're an opportunity for me to process what I've just done. Like either the conversation I've had or experience that I've had. And so in the moment that I'm processing, I'm actually also documenting my frameworks, like how I think about things and it's reinforcing in my mind. So.\r\n\r\n\r\nJohn Seiffer (15:09.079)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (15:22.311)\r\nPosting social media just isn't about the dopamine, although that doesn't help. But it's about refining who you are, how you think, what your systems are. And so I could imagine coaching would be very similar. You're helping other people fix their problems, and you're kind of systematizing your own thinking as you're doing that.\r\n\r\n\r\nJohn Seiffer (15:39.086)\r\nAnd because I'm a step, a divorce from it, I'm not as attached to it. And so it can take a long time and I'm not, that doesn't frustrate me. And so what I realized, this is about a month ago, no, more than that, maybe six months ago. You know that grid with things are important or not important and urgent and not urgent.\r\n\r\n\r\nNikolas Hulewsky (15:47.901)\r\nHmm, yeah.\r\n\r\n\r\nNikolas Hulewsky (15:52.935)\r\nYeah, makes sense.\r\n\r\n\r\nNikolas Hulewsky (16:05.411)\r\nMm-hmm. The Eisenhower matrix,\r\n\r\n\r\nJohn Seiffer (16:08.178)\r\nThe Eisenhower thing, yeah. And I looked at patterns with my clients and the quadrant three, which is theoretically not important but urgent, those things are actually important usually to the business but not to the person doing it. So the owner feels like they have to get it done but it's not really their superpower.\r\n\r\n\r\nThere's a pattern with a lot of my clients where that's where we start without knowing it. They just say, okay, I'm frustrated by this or I'm, you know, this keeps me from moving forward. And it's those things, the short answer is that's the quadrant you're supposed to delegate. But go ahead.\r\n\r\n\r\nNikolas Hulewsky (16:55.357)\r\nSo let's do this, because you're about to get into a space where I'm going to start asking a billion questions. And what I want to do is make sure people who are listening have some context. Before we get into, because this is the question I'm going to ask, is how do you even identify the first thing that you should delegate? But before we do that, you talk about this thing like, I think it's the eight buckets of a business. I think that would help add a lot of context for people who are listening, just so they can start thinking about.\r\n\r\n\r\nJohn Seiffer (17:17.282)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (17:23.417)\r\nokay. This is marketing or this is product fulfillment or whatever it is. Can you kind of go through what the eight buckets of a business are?\r\n\r\n\r\nJohn Seiffer (17:30.316)\r\nYeah, so there's actually seven of the buckets and one for the owner. And the reason I call them buckets is because I'm thinking in terms of you hire people to produce outputs, but I don't want to tie it to job descriptions or departments or teams because that's so limiting. Most people in most companies produce outputs that are unrelated, not everything, but some of them are unrelated to their actual job title.\r\n\r\n\r\nbecause they're really good at it, particularly in a small company. You may have a technician who actually is really good at also proofreading. So they read all your stuff before it goes out. Well, that's an output that is vital. It's just not related to their job description, but you can't ignore that. So I group the outputs into what I call these buckets. So the first bucket, first two we've talked about, you have to find customers and sell to them.\r\n\r\n\r\nThat's the marketing, sales, all that kind of stuff.\r\n\r\n\r\nNikolas Hulewsky (18:31.443)\r\nOkay, so the first bucket is marketing. Marketing and sales, okay?\r\n\r\n\r\nJohn Seiffer (18:33.826)\r\nYeah, marketing and sales. And the output of that is paying customers. The second bucket that's parallel to that is fulfillment. You have to make what people bought. So it could be a service, it could be a product, it could be a combination of those kinds of things, but it's providing the value that they paid for. Then there's what I call supporting buckets, which are designed to help the marketing and sales and fulfillment happen.\r\n\r\n\r\nSo that's people, hiring the right people, developing workflows, onboarding them, managing them, that kind of stuff. Then there's money. Yeah, people's one bucket. There's a lot of subsystems within this. And as the company scales, those subsystems can get done by different people. Just like, let's go back to sales and marketing, for example. When you start out, you're doing everything. You're doing the cold calling, you're doing the...\r\n\r\n\r\nNikolas Hulewsky (19:10.491)\r\nIs that all? Is people one bucket or are there like multiple buckets? Okay, people's one bucket.\r\n\r\n\r\nYeah, yeah,\r\n\r\n\r\nJohn Seiffer (19:30.124)\r\npromotions, you're doing the proposals, the pricing, you're closing the deals. At some point you say, wait a minute, I'm not good at all of that. I'll get somebody who's better at the marketing piece and I'll do the other piece, et cetera. So they break down into these sub outputs, if you will. So people is an output, is a bucket, which is hiring and managing and overseeing and supporting them. Money is a bucket. So you have to get the money in, you have to track it, you have to pay the bills. There's a whole lot of\r\n\r\n\r\ninsight in your financial systems if you know how to look for it. So that's where you get a CFO to help you figure that out, that kind of stuff. That's the money piece. Then there's one called information. All the information that's locked up in people's heads, if you don't want it to be grandma in the kitchen with no recipe, you got to put it into recipes and that's the SOPs, the training, that kind of stuff. There's a...\r\n\r\n\r\nbucket I call CAFE, which stands for Compliance Administrative Support Facilities and et cetera. It's a bunch of things that if you don't pay attention to them, they can bite you in the butt. know, legal support, IT support. If you just wait till your printers go down or your network goes down to hire somebody to find somebody who can help, you're in trouble. know, pay attention to that a little bit ahead of time, you know, that kind of thing. So that's the whole CAFE bucket.\r\n\r\n\r\nNikolas Hulewsky (20:48.945)\r\nYeah.\r\n\r\n\r\nJohn Seiffer (20:57.708)\r\nIt's a protection and I can't figure out a better word for it. that's the, those four, people, money, information and cafe are the supporting buckets. And then those six buckets will make your company survive. But most people want their company to grow. And so the whole growth thing is a whole nother bucket of what's our strategy.\r\n\r\n\r\nNikolas Hulewsky (21:02.599)\r\nI like it.\r\n\r\n\r\nJohn Seiffer (21:22.424)\r\nHow do we change, take that strategy and make goals and plans and make sure those things happen? So that's a whole nother set of outputs that go into that growth bucket. And so those are the seven buckets of a company. If.\r\n\r\n\r\nNikolas Hulewsky (21:28.271)\r\ninteresting.\r\n\r\n\r\nNikolas Hulewsky (21:37.723)\r\nAnd do you call that strategy or do call that growth?\r\n\r\n\r\nJohn Seiffer (21:40.512)\r\nIt's both. Strategy is an output. I call it growth. I call it growth or scaling. I think in the book I called it scaling. And strategy is a part of it, but goals are also a part of it. Planning is a part of it. Making sure that when you do a plan, it's actually useful so you don't just take your leaders away for three or four days and go, hey, this was great, you know, and then everybody comes back and does the same thing they used to do. It's like, it needs to be different.\r\n\r\n\r\nNikolas Hulewsky (21:43.005)\r\nBut what do you call it? You call it the growth bucket?\r\n\r\n\r\nNikolas Hulewsky (22:01.064)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (22:05.157)\r\nMm-hmm.\r\n\r\n\r\nJohn Seiffer (22:08.6)\r\nIt needs to change what you do on a day-to-day basis if it's gonna be useful. So those seven buckets are about the company. If the company is successful, the owners get to take some of that profit out from the company and they get something from it, which is why they're in business in the first place. Now, usually what I found is for owners who are in the business working,\r\n\r\n\r\nSo let me give you an example. I own Google. A very small part of it, but I own Google. The only thing I can possibly get from Google is more money. But when you own your own company and you're in it, you can get a whole lot more than just money. The three universals that I found business owners want from their company, I say if your business was a genie, what would you ask it for?\r\n\r\n\r\nNikolas Hulewsky (22:42.671)\r\nYeah.\r\n\r\n\r\nJohn Seiffer (23:06.2)\r\nWell, obviously they do want money and they usually want more. They want time. Usually they want time off. I haven't had a vacation in a year. I haven't had a day off in six months. They want a schedule that works for them. The third thing is they want work that they love. They want stuff that they end up having to do all these things because the business needs it, but it's not their superpower.\r\n\r\n\r\nThat generally means the business is the wrong size and they should either scale up or scale back. so those are the three universals, but I've run into people, I keep a list, I've got about 20 other things people want. Some people want to be famous, some people want a community, some people want a mission, a legacy, yeah, all kinds of stuff. So anyway, that's the eighth bucket.\r\n\r\n\r\nNikolas Hulewsky (23:51.51)\r\nSo, yeah, that's a good one. They want to be respected. Okay, so seven buckets. Sales and marketing, number one. Fulfillment, number two. People, then money and information. Cafe are the support buckets. Bucket number seven is scaling, growth and strategy. And then number eight is the owner bucket. what are they trying to get out of the business? It could be money, it could be time, it could be passion.\r\n\r\n\r\na whole host of things. I really like the way that you break these down. I typically break the business down into five pieces. Finance, operations, people, sales and marketing, and then product. And I think I can fit everything into those five buckets, the difference with what you're doing here is, going back to output, I mean, these are outputs that you're like,\r\n\r\n\r\nJohn Seiffer (24:40.056)\r\nYeah, you can.\r\n\r\n\r\nNikolas Hulewsky (24:49.725)\r\nclearly articulating and identifying within a business. So if a business owner, doesn't really matter. It's like, I use the five buckets Nick uses, or I use the eight buckets that John uses. It doesn't matter. This is just a roadmap for you to sit down if you're doing this for the first time and you're like, okay, what goes in each one of these buckets? Like, how can I start getting myself organized so that I can then make good decisions?\r\n\r\n\r\nJohn Seiffer (24:57.666)\r\ndoes not matter.\r\n\r\n\r\nJohn Seiffer (25:08.706)\r\nRight. And the reason it doesn't matter is because there's only so many ways to run a business. You know, I got a kick out of it when EOS came on board and there's a retraction and you have to have a visionary and a whatever they call it. And I'm like, you mean a CEO and a COO? Those turn this...\r\n\r\n\r\nNikolas Hulewsky (25:22.675)\r\nmy gosh.\r\n\r\n\r\nNikolas Hulewsky (25:27.098)\r\nYeah!\r\n\r\n\r\nJohn Seiffer (25:30.754)\r\nThose terms have been around forever. If you like calling them something different, go for it.\r\n\r\n\r\nNikolas Hulewsky (25:35.847)\r\nFirst of all, the amount of people who talk about, I'm a visionary. I need an integrator, I'm a visionary. I'm like, dude, everybody exists on a spectrum. And every visionary I've ever met has played integrator at some point. But it gives people that language to start identifying in their business. Yeah.\r\n\r\n\r\nJohn Seiffer (25:44.669)\r\nExactly.\r\n\r\n\r\nJohn Seiffer (25:49.08)\r\nYeah.\r\n\r\n\r\nYeah, that's fine. And that's wonderful. Call them whatever you like. The thing is, for most, particularly SMB companies, the outputs, the functions that come out of a CEO or a visionary are not necessary 40 hours a week.\r\n\r\n\r\nNikolas Hulewsky (26:11.027)\r\nHmm.\r\n\r\n\r\nJohn Seiffer (26:12.052)\r\nAnd so you have, well, the things that are typically done at that visionary or CEO level are strategy. They can be raising money, mergers and acquisitions, planning, organizational structure. In a five or $10 million plumbing company, those things don't change very often. So you have this person who's usually the owner,\r\n\r\n\r\nNikolas Hulewsky (26:13.427)\r\nTo say more about that, what do mean?\r\n\r\n\r\nNikolas Hulewsky (26:26.632)\r\nRight.\r\n\r\n\r\nJohn Seiffer (26:41.816)\r\nTheir title is CEO, but they're also the salesperson, or they also fix the widget machine when it breaks, or they're the one going out and buying new trucks and negotiating the deal, that kind of thing. That's not what the CEO of General Motors does, because a company of that size needs that function on an ongoing basis.\r\n\r\n\r\nNikolas Hulewsky (26:53.587)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (27:03.527)\r\nWell, I think it's funny. was just talking to, you know, Chris Munn and I was talking to Chris Munn two weeks ago and we were talking about how do we position this like this framework that we're thinking of. And basically what I said was, you know, let's, let's position it this way, whatever. doesn't matter what the, what the thing was. And Chris was like saying something about the way that businesses are operated.\r\n\r\n\r\nJohn Seiffer (27:07.234)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (27:32.881)\r\nyou know, every 10 years that someone's got a new strategy. And my comment was like, I don't believe that's true. There are no new strategies. There's only new positioning. you can like EOS, for example, like you, that is this, you know, scaling growth and strategy. All that is, is like, who's your ICP? What's your mission and vision? Like these are all things that we've already done. Peter Drucker was talking about what does your business do?\r\n\r\n\r\nJohn Seiffer (27:43.682)\r\nYes, I agree with you.\r\n\r\n\r\nNikolas Hulewsky (28:00.871)\r\nWhat customer do you serve? Like those are all the same things. They're just repackaged in a nice acronym or now it's EOS, right? And it's all about helping and I'm not trying to minimize it, but it helps the entrepreneur have these. cool. That's a framework that I can refer back to to operate in my business, but it's all the same stuff. It's just repackaged in a different way.\r\n\r\n\r\nJohn Seiffer (28:20.96)\r\nExactly, because there's only so many ways to make a customer happy.\r\n\r\n\r\nNikolas Hulewsky (28:23.539)\r\nThere's only so much yet. Yeah, 100%. So now that we have that framework, how do you go about if you're an entrepreneur and you're like underwater, you're overwhelmed, how do you go about finding the first thing to systematize? Like what are the red flags you should be looking for? They're like, warning, warning, get this thing off of your plate.\r\n\r\n\r\nJohn Seiffer (28:45.9)\r\nWell, you want to look at what are the outputs that are required to sell and what are the outputs that are required to fulfill and to serve a customer and who's doing those. And at a granular level, every output has a frequency associated with it. How often it needs to be done. So your monthly reports, financial reports happen monthly. Your taxes happen annually.\r\n\r\n\r\nSome of your stuff has to happen daily. so you look at all the outputs that you personally are responsible for and the frequency with which that you're demanded. And then you say, wait a minute, I want to get rid of these daily ones. So how can I train somebody else to do these particular ones based on the frequency that could do it as well as I can do it or better?\r\n\r\n\r\nNikolas Hulewsky (29:44.899)\r\nSo do you actually do you go through step by step and like, hey, entrepreneur, sit down for an hour and just list out everything you're doing.\r\n\r\n\r\nJohn Seiffer (29:50.604)\r\nYeah, that's one technique. Usually when I work with a client, they're already complaining about something and we can start there. something is bothering them and we can start there. The other thing, and as I said in the book, I talk about different ways of documenting the SOPs, how these outputs are produced. So you want to start with the ones that are critical, meaning\r\n\r\n\r\nNikolas Hulewsky (29:59.859)\r\nSo they already have it in their mind.\r\n\r\n\r\nNikolas Hulewsky (30:05.959)\r\nMmm.\r\n\r\n\r\nJohn Seiffer (30:20.034)\r\nthat you need to get off your plate. Probably not the ones that you're really expert at because it's longer and harder to train somebody to be as good as you.\r\n\r\n\r\nNikolas Hulewsky (30:30.161)\r\nWell, like you said, it's the Eisenhower matrix of urgent but not important to you. Is that what you're saying?\r\n\r\n\r\nJohn Seiffer (30:35.852)\r\nYeah, yeah. And so you want to delegate those. But that requires, first of all, that you understand what those outputs should look like. What does a successful job mean? Secondly, that you have the team in place that can do them. And that's often where a lot of the changes need to happen. They're used to depending on you to do them. And you go, wait a minute, no, no, you got to do that. Well, I can't do that.\r\n\r\n\r\nNikolas Hulewsky (31:03.431)\r\nHave you ever hired a VA?\r\n\r\n\r\nJohn Seiffer (31:06.217)\r\nI have not because back in the day when I had an actual company with people, there was no such thing as virtual anything.\r\n\r\n\r\nNikolas Hulewsky (31:07.538)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (31:15.121)\r\nSo I've hired a few VAs. Only one of them has stuck. And the reason only one of them stuck was because she's from Britain. And so she's Western. before anyone calls me racist, just hear me out. When I would work with the Pakistani or the Filipino VAs, I had two problems. I was overcoming cultural differences, and I was having to figure out\r\n\r\n\r\nthe SOPs, I hadn't mapped them. So it was like, you can be very direct in certain cultures, but I was being too nice. Like I wasn't being directive enough and they didn't know how to like get it out of me in order to get the right information because they were very deferential. And it just didn't work the two times. But then I hired my current executive assistant and she's from the same Western culture. And so we were able to have a better communication. I realized it's not that those VAs didn't...\r\n\r\n\r\ndo a good job, I sucked at communicating to them what I wanted from them. And they didn't know how to pull it out of me. Whereas my current executive assistant, she understood how to get it out. So I think it's what you're talking about here is like, if you are trying to document and hire at the same time, those are two different things. And it can be very difficult because not only do you need to document it, but you've to have the team to fulfill it.\r\n\r\n\r\nJohn Seiffer (32:35.598)\r\nThey are.\r\n\r\n\r\nYeah, they're very different skill sets and some people should not be documenting what they do. You get other people who are good at that, you know. But one of the things that holds people back, doubt it doesn't sound like this happened to you, is that to describe the outputs at the level of detail that's required, people think, that would be, I'd be a micromanager and I don't want to be that guy. And the truth is if it's important enough,\r\n\r\n\r\nNikolas Hulewsky (32:44.595)\r\nYeah.\r\n\r\n\r\nJohn Seiffer (33:08.642)\r\nto be done that way? Yes, you have to say it. Because, you know, just take this example where you're delegating a one-off, not a full-time job, but a one-off task. Could you handle the, you know, the Johnson situation? And somebody says, sure. You, in the back of your mind, know exactly what you mean by handling the Johnson situation, and you know when you want it done.\r\n\r\n\r\nBut you never said that. And so then two or three days go by, you haven't heard anything and you feel like, jeez, I need this by Friday and I don't see anything forthcoming. And they didn't know you needed it by Friday. Or they dropped everything to do it because you said it and it didn't need to be done tomorrow and all this other shit went down the tubes.\r\n\r\n\r\nNikolas Hulewsky (34:04.403)\r\nYeah, no, no, no. Or they drop everything, they get it done for you by Friday and it's a mess. And you're like, this isn't what I wanted. And they've spent 20 hours during the week working on this proposal for you that they thought they wanted, that you wanted. And you were like, I don't care that you worked that hard on it. This sucks. So you got now an employee who's getting negative feedback, feeling like they did a bunch of work and you still don't have what you need. I totally...\r\n\r\n\r\nI mean, of course it happens. I think it happens to everybody who manages people's you just realize like I've got to be prescriptive.\r\n\r\n\r\nJohn Seiffer (34:33.643)\r\nSo flip that around. Suppose you had hired a contractor to do that job. You would specify in the contract the scope of work, what a successful job looks like. You should have that level of agreement with your employees. The difference, as I mentioned a while ago, is that many of the outputs that you want from your employees have nothing to do with their job description.\r\n\r\n\r\nNikolas Hulewsky (35:02.867)\r\nHmm.\r\n\r\n\r\nJohn Seiffer (35:03.116)\r\nSo great, put those on the list.\r\n\r\n\r\nNikolas Hulewsky (35:07.859)\r\nDo you have like a, I think you do, this is where it's coming from, a minimum viable SOP template? is there, hey, you at least need to have these things on your SOP template in order for it to be successful.\r\n\r\n\r\nJohn Seiffer (35:23.158)\r\nYeah, the two parts to that. One is the ideal SOP should be usable for training a new person to do the job. Hand them the video, hand them the document, whatever it is, and say, you should be able to learn this and do the job. Maybe not as quickly as the person who was doing it, but as good. Or at least you should know when it's not as good and we can hone your skill set.\r\n\r\n\r\nSo that's the ultimate design of an SOP. There's actually three kinds of SOPs. One is what I call the recipe, just like grandma in the kitchen. Well, grandma, how much salt do you put in? Well, just enough. How long do you stir it? Till it looks good. No. And it turns out when you make French baguettes, which are just salt, water, flour, and yeast, I guess is all it is, but...\r\n\r\n\r\nIf the temperature and the humidity is not exactly right, you have to adjust the oven temperature and the timing and all that good stuff that grandmas know intuitively. But if you're gonna scale up a factory making baguettes, which some people have, and I've seen a documentary about it, they actually look at what's the humidity today and what's the temperature and we're gonna adjust how long we beat the flour and what all that stuff is.\r\n\r\n\r\nGet that, it's not intuitive anymore. It's now a process. And so a recipe SOP is an algorithm. Do this, do this, do this. And you should probably document it with video. Anything that has to be done on the computer, have somebody do a screen share, talk through what they do. I open this tab, I'm clicking over here and blah, blah, blah. It's also good for mechanics, for tools and machinery. Here's the screw that you turn and you're, and those are.\r\n\r\n\r\ndocumented step by step by step. And many of the, I don't want to say inconsequential, because the outputs are important, but the repetitive stuff is documented that way. The next kind of SOP is what I call a dance. And it's usually when there's people involved. So customer service, sales. You can't really tell somebody, here's how you make a sale. Step one is you say, hi George, how'd you do? When'd you go to, I went to,\r\n\r\n\r\nNikolas Hulewsky (37:49.531)\r\nYeah.\r\n\r\n\r\nJohn Seiffer (37:50.784)\r\nI went to high school there too, ha ha ha. You know, that's awful. But what you can say is, look, these are the outputs that you want from this conversation so that you know when it's complete and you can move on to the next stage. So I want to know what's your budget. I want to know what's your, how do you describe the pain that you're feeling? I want to know who's making the decision with you. Those are outputs that you can document.\r\n\r\n\r\nNow how you get there, you gotta dance and you gotta be good and that kind of thing, but that's documenting that SOP.\r\n\r\n\r\nNikolas Hulewsky (38:18.643)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (38:25.533)\r\nSo tell me the three again. So there's the recipe SOP, the dance SOP, then.\r\n\r\n\r\nJohn Seiffer (38:27.598)\r\nThe recipe, the dance SOP, and the third one is a creator or a creation. So if you're hiring a graphic artist, you don't know what the output should look like. Otherwise you do it yourself or you'd have AI do it. This goes back to that conversation about AI. You could tell AI what to do. But what you do have for a creation is the constraints. So.\r\n\r\n\r\nSometimes the constraints are, this has to work within the laws of physics. Otherwise, it's not going to happen. Sometimes it's the legal constraints. Sometimes it's like with a graphic artist, you can say, these are our company colors. This is the mood that we're trying to promote. These are the fonts that we use. And the files need to be in this format when you're done. And within that, go to town. So let me give you an example of two different kinds of SOPs.\r\n\r\n\r\nNikolas Hulewsky (39:02.12)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (39:21.075)\r\nInteresting.\r\n\r\n\r\nJohn Seiffer (39:24.702)\r\nin the same, perhaps the same business. So you hire somebody to do your taxes. If your taxes are at all complex, the crafting of the strategy is a creation SOP. They're like, they'll look at all your different businesses and all these different things and say, okay, why don't we take this approach? Here's two contradictory parts of the tax code. I think if we go here, we'll split them right down the middle and we'll save you money. That's a creation.\r\n\r\n\r\nWithin the constraints are the laws of tax, whatever. Then they hand that usually over to somebody else in their firm and say, fill out the forms this way. That's the recipe. And then they hire, they say part of that is send it over to somebody else who's gonna double check that you didn't transpose numbers and whatever.\r\n\r\n\r\nNikolas Hulewsky (39:59.377)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (40:09.383)\r\nYeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (40:17.395)\r\nAnd the dance SOP would be probably from the accounting firm's perspective of this is how you extract the knowledge out of these people's heads, right, in order to get what you need. I think something that I really loved doing is...\r\n\r\n\r\nJohn Seiffer (40:26.08)\r\nYes, yeah, that's a great yeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (40:34.481)\r\nEarly in my career, I got overwhelmed because I knew I had to create something to document, but I didn't know how to like write SOPs and I didn't know how much was too much or how little was too little. And so for me, because it was so overwhelming, I just didn't do it. And that was a problem. But the biggest unlock for me recently, and I'm curious to get your opinion on this, has been AI. I have this little pendant that I wear around all the time that records all of my conversations and I can just talk.\r\n\r\n\r\nI have an intern who started with me two weeks ago. We spent three hours talking about what does the internship look like? What are the deliverables? What is he doing the first week, the second week, the third week, all of that stuff. And then I just took the recording, uploaded it to chat GPT and said, please make me an SOP for X, Y, and Z, or please make me an onboarding template for him, or please make me his internship, calendar.\r\n\r\n\r\nAnd it just does it. You still have to iterate to it, but it takes like the 80 % of the work out of it. And that has been a huge unlock for me. Just recording the conversations, taking the transcripts, and then uploading it and having the AI to do kind of the rest of the work. Have you started seeing entrepreneurs do the same thing?\r\n\r\n\r\nJohn Seiffer (41:49.274)\r\nThe AI is getting better. And what it's doing in my phraseology is it's extracting the definition of the outputs from your conversation. have somebody once fed my book to, this was maybe a year ago, so it's not the current version of AI. They fed the book into it and gave me an AI summary of it. And it was awful.\r\n\r\n\r\nNikolas Hulewsky (41:51.527)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (42:01.575)\r\nMm.\r\n\r\n\r\nJohn Seiffer (42:18.24)\r\nIt said things I didn't say. There was a whole lot of hallucination in there. if you have gone, you said you had to go back and tweak it, which was great because you knew where it was on and where it was off.\r\n\r\n\r\nNikolas Hulewsky (42:18.66)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (42:27.347)\r\nThank\r\n\r\n\r\nNikolas Hulewsky (42:31.407)\r\nHere's my opinion of AI, just really briefly. I think that people treat AI as if it's a sentient being and just all-knowing. I think AI is an employee. And in the same way that you need to educate the AI and do QA of their work and all the other stuff, excuse me, of an employee, you've got to do that for AI as well. And so when I get an output, many times I'm working on it.\r\n\r\n\r\nJohn Seiffer (42:54.04)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (42:58.981)\r\neven after the output. there's this like 10 80 10 rule that I follow. I kind of do the first 10 % tell it what I'm looking for. It does 80 % of the work and then I finish up the last 10 % of it. So it's like it's never just the the finished product, but it also does what I say. It spits out the first bad idea. Like sometimes I just need something to look at to say like, no, that's not what I want. And then it at least gets the juices flowing somewhere else. So I agree with you though. It's not a silver bullet. It's a tool in the tool belt.\r\n\r\n\r\nJohn Seiffer (43:09.868)\r\nYeah, that's a great...\r\n\r\n\r\nJohn Seiffer (43:20.366)\r\nYeah. Yeah.\r\n\r\n\r\nJohn Seiffer (43:26.018)\r\nYeah. The other thing that I've had to do is there's a function. I use Zoom for a lot of my coaching calls and Zoom has this thing that'll summarize your calls and it'll say, so-and-so talked about XYZ. I don't care that we talked about it. I want to know what we said about it. And so there's a level, I'm sure if I cared enough, I could go in and tell it to do that at a different level.\r\n\r\n\r\nNikolas Hulewsky (43:46.853)\r\nHmm. Yeah.\r\n\r\n\r\nNikolas Hulewsky (43:55.603)\r\nI could show you some cool stuff. I was working with somebody who was looking to buy a business and we had had like seven hours of Zooms recorded and I took the transcripts and I created a buyer profile for him. It was like, it was like, you know, I don't know, 20 pages skills, skillset, experience, likes, dislikes, geography, capital, all of that stuff. And now he has it and he's able to feed deals into it and just say like, Hey, does this fit me? it like what questions should I ask?\r\n\r\n\r\nJohn Seiffer (43:55.948)\r\nNikolas Hulewsky (44:24.723)\r\nIt's almost like it's just getting it the ball rolling. anyways, I view it more as a tool to like capture these things and do the first, again, the 10 80 10 rule. You do the first 10%. You tell it what you're looking for. You give it the transcript. It then kind of spits out a first draft and then you got to do the last 10 % of it, but it's cut down the amount of time. And I just don't get as overwhelmed about documenting things anymore, which has been a huge unlock.\r\n\r\n\r\nJohn Seiffer (44:50.648)\r\nYeah, and you're more of a solo practitioner than a lot of people. But somebody who's got a company of 25 people, could have a lot of the people that do that work just document their own stuff by doing a video and talking through, here's why I'm clicking here, here's why I'm clicking there. And then if they want the AI to polish it up and make it into steps and all that stuff, that's a good thing too.\r\n\r\n\r\nNikolas Hulewsky (44:55.496)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (45:03.559)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (45:15.731)\r\nHere's a question for you. Many people who have businesses have people that work for them that have really important knowledge. So how do you get that tribal knowledge out of their head without making them feel uncomfortable or that like, they're asking me to do this so they can replace my job? Do know what I mean?\r\n\r\n\r\nJohn Seiffer (45:37.142)\r\nYeah, the flip side of that is if I can't replace your job, I can't promote you. Because that whatever you're doing now, the company needs it. Otherwise, we wouldn't be paying you. So if you want to move up to a different position, these are the outputs you're to have to be good at in this new position. But we're going to have to backfill what you're doing now because you're not doing it. Yeah.\r\n\r\n\r\nNikolas Hulewsky (45:44.903)\r\nGreat answer.\r\n\r\n\r\nNikolas Hulewsky (45:50.45)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (46:00.305)\r\nI love that.\r\n\r\n\r\nI love that framing. I love that framing. Hey, do want to move up? I do. Okay. Let's document what you're doing so that we can eventually offload it from you and so you can do higher levels of work. That's fantastic. Sure. Sure.\r\n\r\n\r\nJohn Seiffer (46:13.27)\r\nAnd not everybody does want to move up, actually. But, you know, that's a different issue.\r\n\r\n\r\nNikolas Hulewsky (46:20.499)\r\nFor, let's land this plane. For the entrepreneurs that are overwhelmed, we've talked about the eight buckets of a business, sort of an MVP, SOP, if you will. What's the best way for them to just get started in thinking through systematizing their business?\r\n\r\n\r\nJohn Seiffer (46:43.564)\r\nblock out what I call CEO time, at least an hour, two hours a week, where you're in a different location, where nobody is bothering you, and where you're working on stuff that is not urgent. And get a CEO notebook and start writing your thoughts about how to do all this. And do it through the framework of what are the outputs that I need to produce personally, and the ones that I hate.\r\n\r\n\r\nand the ones that I, you what's the frequency of these? And then you can start to prioritize, this is one I'm never gonna give away, I love doing this. This is one I wanna give away tomorrow, so now how do I do that? Which, what are the things somebody needs to know in order to do it the way I do it?\r\n\r\n\r\nNikolas Hulewsky (47:30.643)\r\nI think that that's a really, really good recommendation, but I think that 90 % of entrepreneurs will hear that and think that's a great idea. I should do that sometime. But they never schedule it out. What I have found to be really powerful, and I am teeing you up here, but what I have found to be very powerful is some type of an accountability system. It could be a peer group. It could be a partner. could be whatever, but just the kickstart of like,\r\n\r\n\r\nJohn Seiffer (47:41.89)\r\nYeah, we gotta do it tomorrow.\r\n\r\n\r\nNikolas Hulewsky (48:00.765)\r\nCan someone just help me walk through this? Do you, is this like something you'll do on a one-off call? Do you have like anything that you kind of offer to people?\r\n\r\n\r\nJohn Seiffer (48:08.458)\r\nyeah, I mean, that's one of the things that a coach is great for because as business owners in an SMB world, we typically don't have a board of directors. So we don't have anybody holding us accountable to, you know those goals you set two months ago? What's happening with that? Yeah, exactly. Exactly. And so the thing about being a coach is I only hold you accountable to yourself. I don't have any other\r\n\r\n\r\nNikolas Hulewsky (48:23.891)\r\nThat's the best. It's the best thing about entrepreneurship and it's the worst thing about entrepreneurship. Yeah, totally agree.\r\n\r\n\r\nJohn Seiffer (48:38.222)\r\ninfluences, I'm not like, I need to make a certain amount of money off of you because I'm invested in you or none of that. It's just like, what do you say you want to do? And if you want to scale a company back and you know, whatever, that's fine too. But it's I'm holding you accountable to your best self is a way to say it. And that's what the coaching is. The other thing I want to mention is a new program that I just started. I don't know if it'll be new by the time this gets released, but\r\n\r\n\r\nNikolas Hulewsky (49:06.803)\r\nWe'll find out.\r\n\r\n\r\nJohn Seiffer (49:06.893)\r\nChase Murdock and I are doing a thing called the Operator Accelerator. And it's a combination of education content and training and coaching for entrepreneurs to learn all the different aspects of their company, all those different buckets. What do you need to know about sales and marketing? What do you need to know about finance? What do you need to know about people and all that? And then how do you, not just in a theoretical sense or an academic sense, but how do you adapt that to work in your company?\r\n\r\n\r\nAnd so that's theoperatoraccelerator.com. People can look at that.\r\n\r\n\r\nNikolas Hulewsky (49:40.465)\r\nWell, and like, first of all, John's not paying me anything. There's no affiliate relationship here. I'm just a huge believer in coaching. didn't used to be, but I've become more and more of a believer in coaching because to me it's similar to like, I want to lose weight. And okay, well you could do a HIIT type of a workout or you could lift weights or you could do the Atkins diet or keto or you could do the caveman or whatever.\r\n\r\n\r\nRight. There's a million things, but at the end of the day, there's like just two things. Move your body more and kind of, you know, eat better. Right. Those are the two things. Everything else is sort of an accountability mechanism to help you stay on the straight and narrow. And so whether or not you reach out to somebody like John, who I think is you're amazing, you have fantastic experience or somebody else, just the accountability piece of it is incredibly important. Obviously you got to make sure they know what they're talking about. Okay. You go to a.\r\n\r\n\r\nJohn Seiffer (50:16.364)\r\nRight.\r\n\r\n\r\nJohn Seiffer (50:37.378)\r\nWell, that's so I do a combination of coaching and consulting and my working definition is a consultant brings in expertise from the outside. So they would say the kind of body that you have, the age you're at, this is the kind of this might be the plan for you. That's knowledge that you didn't have. Then the coaching is helping you maximize the expertise that you do have.\r\n\r\n\r\nYou know, let's talk about when you're energized. Let's talk about when you get lazy and start to eat too much. Let's talk about what works in your daily life with your kids and your schedule and all that. That's the coaching piece. And because of my experience in running so many companies and working with other people who have, I can do a little bit of both, I hope. So.\r\n\r\n\r\nNikolas Hulewsky (51:09.713)\r\ninteresting, yeah.\r\n\r\n\r\nNikolas Hulewsky (51:22.699)\r\nNo, I think it's incredibly valuable. if, again, John's not paying me for any of this, I have his book. I don't know that I've unpacked it and put it on my shelf yet, but Output Thinking, there it is, Output Thinking. It's phenomenal. If you're just overwhelmed, start reading that book. It'll start giving you some ideas to get your stuff tightened up. But John, this was fantastic. Thank you so much.\r\n\r\n\r\nJohn Seiffer (51:33.678)\r\nThere you go. How about thinking?\r\n\r\n\r\nJohn Seiffer (51:46.008)\r\nThank you. And I would love to have your listeners contact me, email me, john at ceobootcamp.com. Go to my website, ceobootcamp. You can learn about the book. There's a link for a free coaching session, which I promise is not just a sales pitch and the operator accelerator is there as well. So all the stuff I do is.\r\n\r\n\r\nNikolas Hulewsky (52:04.593)\r\nYeah. John gave me a free coaching session like over a year ago. So it's not, it's not just a All right. Appreciate you, John. All right.\r\n\r\n\r\nJohn Seiffer (52:10.521)\r\nSo yeah, it was my pleasure. Thanks for having me on, Nick.",
  "metadata": {
    "duration": "",
    "date": "2025-06-11",
    "platform_source": "Google Drive"
  }
}