{
  "episode_number": "226",
  "episode_title": "50,000 Subscribers, $10M in Revenue, 1 Insanely Creative Business Idea with Michael Clark",
  "guest_name": "Michael Clark",
  "business_name": "The Flower Letters",
  "transcript": "﻿Nikolas Hulewsky (00:00.205)\r\nOkay, well, what do you go by? You can tell me.\r\n\r\n\r\nMichael Clark (00:03.256)\r\nSo, growing up, my nickname was Ralph. Crazy. Cause I have red hair and this guy just said, Hey, you look like Ralph Malfrom Happy Days. And I'm like, okay. And everyone just started calling me Ralph. So like even to like some of my childhood friends, but even my brothers, they still call me Ralph sometimes anyway, but I always went by Mike. I went by, don't call it. Yeah. If you did, I don't, I don't care. I have really no preference, but people called me Mike. But then when I got into business, people started calling me Michael.\r\n\r\n\r\nNikolas Hulewsky (00:16.493)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (00:23.725)\r\nI'm not gonna call you Ralph.\r\n\r\n\r\nMichael Clark (00:33.998)\r\nCause I don't have a preference. just said, there's Mike on my, okay. But you can't call me Mikey. The only people that can call me, the only people that can call me Mikey are my wife and strangely my dad.\r\n\r\n\r\nNikolas Hulewsky (00:36.863)\r\nYeah, yeah,\r\n\r\n\r\nNikolas Hulewsky (00:40.557)\r\nI won't call you Mikey.\r\n\r\n\r\nNikolas Hulewsky (00:48.461)\r\nDude, my dad calls me Nikki. Yeah, yeah, yeah. I mean, he calls me lots of different names. Nikolai, Nikolai, Niky. Anyways, Niky is one of them, but he's, my dad's a Ukrainian immigrant. Okay, dude, Michael, I am super excited. Michael Clark, theflowerletters.com. For those of you, go look at the episode that Chris and I did. We did a whole co-bros episode. link to the show notes, but we talked about this business that was sending letters in the mail.\r\n\r\n\r\nMichael Clark (00:51.403)\r\nYeah. Yeah. Yeah.\r\n\r\n\r\nMichael Clark (01:02.684)\r\nNikolas Hulewsky (01:18.359)\r\nto the subscribers charging $10 a month. And they had about 31,000 subscribers. And we did the back of the envelope math. And we were like, dude, this business is doing like $5 million a year. It's probably netting like two to $3 million. This is insane. And all they do is they write letters to people. And it's based on like World War II love letters. And they've like broken it out now. What a cool business model. And then you commented on YouTube and you're like, this is that's me. This is my business.\r\n\r\n\r\nMichael Clark (01:42.241)\r\nNikolas Hulewsky (01:47.169)\r\nYou got some things right in here. You got some things.\r\n\r\n\r\nMichael Clark (01:47.418)\r\nYeah, I was actually I was excited that someone like found our business randomly and started talking about it. I was I was like, Hey, this is cool. But like you when you're doing the analysis, I was like, this is pretty good analysis. Like pretty good. Oh, yeah, that numbers almost right. A little off a little off.\r\n\r\n\r\nNikolas Hulewsky (01:54.135)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (02:03.213)\r\nWell, and that's what we do. That's what we do. Like we find interesting things and we're like, okay, what are the data points and what could we estimate this business actually does? So to do a better job of breaking it down, theflowerletters.com and your guys' business model is you mail out to a month to subscribers these, what started as World War II love letters and you charge a subscription fee. Again, I'm going to say the things that I did. I've done research now. I know that it's wrong. $10, $10 a month.\r\n\r\n\r\nMichael Clark (02:09.314)\r\nYeah. Yeah.\r\n\r\n\r\nMichael Clark (02:28.748)\r\nYeah, you're right. You're right on.\r\n\r\n\r\nNikolas Hulewsky (02:32.727)\r\nto your 30 plus thousand subscribers and you do all the fulfillment in-house, you do all the handwriting. so as I was like doing the back of the envelope, that's where we got that number from. What do we get right and what do we get wrong?\r\n\r\n\r\nMichael Clark (02:32.792)\r\nThereabouts, yeah.\r\n\r\n\r\nMichael Clark (02:45.582)\r\nCool. Yeah. mean, lot of was right. Most of the numbers were under. Um, and, uh, and so except for your net, the net one was, uh, is a little bit interesting. The cost structure on this business is bonkers. Uh, and that's probably one of the biggest challenges that we face, but you're exactly right. We tell stories through letters sent through the mail. You get two letters a month for a year. Um, and it's a story.\r\n\r\n\r\nNikolas Hulewsky (02:51.565)\r\nReally?\r\n\r\n\r\nMichael Clark (03:12.544)\r\nSo like when people say, Hey, what do you do? Cause I was like in FinTech and technology before, like, this is totally crazy. You know what we're doing. And, I usually say it's something you've never heard of, but your mother is going to love. And, so people are like, are you insulting me? Like, no, no, no, no, I'm not insulting you. What you say? Yeah. No, just said, no, no, no. But that's our, that's our target audience are, you know, women age 35 plus.\r\n\r\n\r\nNikolas Hulewsky (03:33.687)\r\nWhat'd you say about my mom? What'd you s-\r\n\r\n\r\nMichael Clark (03:42.361)\r\nBut to kind of back up just a little bit, our origin, were, my wife is an artist. She's a, she is a super talented, just the most talented person I've ever known. Sings, does everything. She's an artist, she's a writer. And April, 2020, we're on a walk and she's trying to figure out how to, you know, boost her email list. We had done.\r\n\r\n\r\nNikolas Hulewsky (04:07.777)\r\nWhat was she doing at the time? Sorry, what was she doing?\r\n\r\n\r\nMichael Clark (04:09.27)\r\nshe was she was doing this art is like this 3d art and like to give you an idea of like how talented she is like she'd do a painting she put it up and it would sell within like 30 minutes and so like you know we I remember we went on a date one time and she she put up right before we left she put one of her paintings up she had worked on and they're super cool and it was like two hours into the date she's like you know\r\n\r\n\r\nNikolas Hulewsky (04:22.957)\r\nWow.\r\n\r\n\r\nMichael Clark (04:40.078)\r\npainting hasn't sold yet. Do you think you think it's any good? People don't like it on my hand. I got to give you some perspective here. Most people don't sell paintings for years. You sell them in like 30 minutes. It was sold within like the next 30 minutes. So she's super talented. And what I at that time I was working in I was doing some consulting in healthcare financial services in the HSA space. And I was also working on a fintech startup.\r\n\r\n\r\nNikolas Hulewsky (04:56.642)\r\nI guess.\r\n\r\n\r\nMichael Clark (05:10.466)\r\ncentered around real time payments. So my world is like tech, know, building apps, financial services. And, but I love stories I love, and I'm passionate about business and entrepreneurship. We were thinking about how to build her email list. We're on a walk and she's, she's like, what if I like, you know, someone signs up for my email list and I mailed them a letter and I said, and it, the idea came like all at once.\r\n\r\n\r\nhonestly. And I said, What if you told them wrote a story and sent them a story? And that's where the idea was born. And immediately I saw World War Two. I saw people going to the mailbox. Yeah, this is me. I Yeah.\r\n\r\n\r\nNikolas Hulewsky (05:52.857)\r\nThis was you? World War II, okay. I mean, it makes sense. Like mid-30s male, you're either the Roman Empire or World War II.\r\n\r\n\r\nMichael Clark (06:00.563)\r\nYeah, mean, World War II, and I immediately saw the emotion of what was going on. Because in the world, know, April 2020, people are lonely. They're isolated. And I'm like, what if someone could have something to look forward to, you know, a couple times a month, you know, and it's a story they can enjoy something light, something fun. And, you know, I knew the first story needed to be World War II. So we started writing. And she's like, Okay, this is this is this\r\n\r\n\r\nfirst, she says she thought it was a terrible idea because she's a writer. She's like, how am going to write a story that is compacted and contained in 24 letters? Anyway, so we started writing. We, kicked off, you know, we built the business model, you know, decided it's subscription based, you know, month to month. And we launched in August with\r\n\r\n\r\n33 people signed up. And one thing I always tell people starting a business is don't tell your mom because she'll buy 100 of them. She'll buy 100 of them. I tell you like, yeah, it's like, you know, people starting these businesses like, I'm gonna have a launch, we're have my family come. like, nothing like a false positive to kick off your business.\r\n\r\n\r\nNikolas Hulewsky (07:08.173)\r\nAnd then you won't actually know what demand is.\r\n\r\n\r\nNikolas Hulewsky (07:23.277)\r\nDude, that's so funny. When I started podcasting, I was like doing a bunch of research and I was telling somebody I was like, yeah, I get like one to 200 downloads an episode. And they were like, that's friends and family, man. I'm like, shoot, you're freak. You're right. I thought that was good.\r\n\r\n\r\nMichael Clark (07:35.983)\r\nYeah, yeah. Yeah, so anyway, we decided we're not gonna tell anybody we just kind of put it out there social media, do some crazy things and look at our Instagram or like leave rocks around. And 33 people sign up. I'm like, who are these? I don't know them. You know, I don't know who these people are. like, maybe there's something here. And so we started doing a little advertising, which is something that I think in your analysis was missed. We advertise heavily.\r\n\r\n\r\nLike that's the, that's been the key. And we can talk a little bit about that. Um, we did a little ads, tried to like just dabble in ads. And by the end of the year, we had a few thousand people signed up. And, um, you know, over Christmas and, you know, fast forward, we're now in August, 2025, we're sending about 130,000 letters a month and, we're, uh, we're growing. So we've got, we've got five stories.\r\n\r\n\r\nNikolas Hulewsky (08:27.021)\r\nJeez.\r\n\r\n\r\nThat's incredible.\r\n\r\n\r\nMichael Clark (08:34.68)\r\nWe're launching a new story. We think it'll be released early October, for pre-sort, pre-order, crazy ride. it's, it's hard to like, you know, when you sent me your, your, was kind of doing like a reminiscent and looking back and, know, how do we get here? And there's a lot of, a lot of ups and downs, tell you what.\r\n\r\n\r\nNikolas Hulewsky (09:00.469)\r\nWell, that's one of the things I often, I often talk about is like people think that growth is linear. It's like up into the right. But if you look at the stock market, for example, maybe over 15 years, it looks up into the right a little bit, but honestly it's this it's up and down and up and down and you hit an all time high and then you, come back down and you don't hit that all time high for another couple of years, but that's entrepreneurship. It's not a linear just expectation. There's, there's bumps all along the way.\r\n\r\n\r\nMichael Clark (09:07.765)\r\nMm-hmm. Yep.\r\n\r\n\r\nMichael Clark (09:15.663)\r\nYep. Yeah.\r\n\r\n\r\nRight.\r\n\r\n\r\nman, Yeah, zoom out and you're like, wow, look at this. Zoom in, you're like, they almost died. You know, you know what I'm talking about. You know what I'm talking about. And you're like, they almost died there. wait, they almost died there too.\r\n\r\n\r\nNikolas Hulewsky (09:34.541)\r\nTotally man.\r\n\r\n\r\nNikolas Hulewsky (09:44.141)\r\nYeah, there's so many. There is so many different fail points along the way where stuff could have gone terrible. I think the first time I bought a business, I look back on that now and I was like, I'm like, I personally guaranteed my house. Oh my gosh. What am I doing? Could have like bankrupt my whole family. Okay, so you're you're doing 110,000 letters a month.\r\n\r\n\r\nMichael Clark (10:01.955)\r\nYeah. Yeah.\r\n\r\n\r\nSo we send two letters a month, we're about, you know, 60 between 50 and 60,000, I think, current subscribers. So.\r\n\r\n\r\nNikolas Hulewsky (10:15.495)\r\nSo, well, that was going to be my question is like the research that I did said 31,000 subscribers, but you have some subscribers who have multiple subscriptions because you have multiple stories. is it about 50,000 subscribers then, or is it.\r\n\r\n\r\nMichael Clark (10:20.386)\r\nMm-hmm, yeah.\r\n\r\n\r\nMichael Clark (10:24.481)\r\nMm-hmm. Yep.\r\n\r\n\r\nMichael Clark (10:31.021)\r\nYeah, I have to look now it's between 50 and 60 right now. And so my operations guy could be watching this like you're way off, man. But no, yeah, it's remarkable. It's an incredible response. there's there's there was a key when we first started this of like why we're doing this crazy business and\r\n\r\n\r\nNikolas Hulewsky (10:36.311)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (10:41.575)\r\nSamsonite, that was way off. Yeah.\r\n\r\n\r\nMichael Clark (11:01.367)\r\nI'd never really anticipated the impact that it would have on people. think my wife saw it. I think she saw the impact it would have, but just a couple months in, we started getting handwritten letters, emails, direct messages of people saying, thank you for doing this. I mean, someone who was, you know, was, you know, people who are terminally ill.\r\n\r\n\r\ncontacting us saying thank you. This gave me something to look forward to, gave me hope. You know, someone who had a chronic, chronic illness, she was like, I put it on my nightstand and every day I look up to it say, there's another letter coming.\r\n\r\n\r\nI see these things and I'm like, what did we create? Like, what is this? And like, at that point, you know, it was about January. And I said, we got to go all in on this. And one of the growth was tremendous, but there was more of a purpose behind it. And, you know, we decided to configure a certain way, which was for a long game.\r\n\r\n\r\nCause we could have configured it as a lifestyle business. And I think, you know, your listeners and you know, the difference between a lifestyle business and like, this is what I'm doing. This is like all I do. You know, there's the passive stuff or there's really no such thing as passive, but like things that don't take all your time, you know, and you can set it up and it runs and the income comes, or am I going to put my heart, soul, mind?\r\n\r\n\r\neverything I have into this business and this is what I do. That's what we decided. We decided to do that.\r\n\r\n\r\nNikolas Hulewsky (12:45.645)\r\nSo August, the numbers I had was 38, but let's call it mid-30s subscribers. By the end of the year from the research I have, it's like 5,000. Yeah. So at that point, 5,000, and let's just say at $10 a month, $120. So 5,000 people, $120 yearly revenue. You've got a business doing approximately $600,000. Let's just call it.\r\n\r\n\r\nMichael Clark (12:55.737)\r\nBye-bye. Yeah, yeah.\r\n\r\n\r\nMichael Clark (13:05.377)\r\nMm-hmm.\r\n\r\n\r\nMichael Clark (13:13.124)\r\nSure. Yep.\r\n\r\n\r\nNikolas Hulewsky (13:15.029)\r\nIt's not a massive business, but to go from August to by the end of the year, you've got a business that's got recurring revenue. And you know this, you're in tech, man. recurring revenue, $600,000 for the year. Must've been a moment where you were like, not only is this a thing, but I'm also passionate about it. Let's go. It was probably an easy decision. Am I wrong?\r\n\r\n\r\nMichael Clark (13:39.844)\r\nYou know, well, I was in the middle of a startup, another business. was. Yeah, I was, I had, we were getting things off the ground with a real time payments company and it was, it was going pretty good. I we had to pivot a lot during COVID. It's still going. But it was hard to say, okay, I'm going to transition now.\r\n\r\n\r\nNikolas Hulewsky (13:42.662)\r\nyou were.\r\n\r\n\r\nNikolas Hulewsky (14:01.587)\r\nwait, so what happened to the payments company? So you launched this payments company, did you raise? No, okay. So you launched it, you bootstrap it, you're in the middle of it. Did you have partners or was it just you?\r\n\r\n\r\nMichael Clark (14:04.655)\r\nIt's still going. No, no, no.\r\n\r\n\r\nI had one partner. We did raise, we raised a little seed fund, but no significant and I had thoughts on that, I tell you what.\r\n\r\n\r\nNikolas Hulewsky (14:19.809)\r\nWhat, what, well, what did your partner say when you were like, Hey man, I know we got this payment company, but I'm going all in on letters.\r\n\r\n\r\nMichael Clark (14:26.753)\r\nHe understood. understood. mean, you know, he's a really good guy. Good business partner. Just taught me a lot and he's still he's still going with it. I think it's still, you know, trying to get some traction there, but it's still moving as far as I know.\r\n\r\n\r\nNikolas Hulewsky (14:44.341)\r\nSo you're not active in that business much anymore. It's really interesting. just had, his name Sam par who he has like this, he has his podcast where he interviews really successful people, billionaires, entrepreneurs, et cetera. And I was asking him like, what was the one thing he learned from all of them? And like, it's like focus is his number one thing and he's very focused. He only focuses on one thing. But for me, it's really difficult when I feel like, no, well, this could be successful and this could be successful. I think I could split the baby.\r\n\r\n\r\nMichael Clark (14:46.286)\r\nNo, not at all.\r\n\r\n\r\nMichael Clark (14:57.934)\r\nMm-hmm.\r\n\r\n\r\nMichael Clark (15:09.337)\r\nRight.\r\n\r\n\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (15:14.285)\r\nDid it make the decision to go all in on letters easier when you got to the 600,000? Like, would it have been harder if it was, we've got a thousand people and it's $100,000 in annual recurring revenue. Does that question make sense?\r\n\r\n\r\nMichael Clark (15:30.231)\r\nYeah, yeah, no, the what was it was the trajectory. We didn't see it. We didn't see it slowing down. And with what we were doing from an advertising standpoint and customer acquisition, but also response, I'm like, there's there's more here and there's more stories to tell. And so there's a lot there's a lot more good we can do and growth that we can have and.\r\n\r\n\r\nNikolas Hulewsky (15:35.627)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (15:48.696)\r\nMichael Clark (15:56.721)\r\nSo it made it made it different. We had already like at that point, like to start this other business, you know, we had sold our house. We, you know, we kind of are, we're already going all in on things. You know what I mean? Right. You're yeah. Yeah. We're already going to kind of kind of transitioning going in all in to try to start something, kind of get things going. Cause we're crazy like that. You know what I mean? You know, we have a little bit of a, a little bit of a different thing going on in here.\r\n\r\n\r\nNikolas Hulewsky (16:09.931)\r\nGeez, the tech business. my gosh.\r\n\r\n\r\nNikolas Hulewsky (16:25.439)\r\nApparently, she's she's an artist and you're an artist. So it's like this. Okay.\r\n\r\n\r\nMichael Clark (16:30.072)\r\nYes. Yeah. Yeah. but no, we, did that and, just kind of kept going. And once we went all in, we haven't raised a dime. Everything was coded. built on revenue, but from our cost structure and revenue structure, one of the things that was key, I think it, from a strategic standpoint was making the prepay option very attractive. because that from a practical standpoint gives you.\r\n\r\n\r\nNikolas Hulewsky (16:54.017)\r\nHmm.\r\n\r\n\r\nMichael Clark (16:59.866)\r\ncash to operate in cash. So we have, we have a lot of, you know, prepaids and that's really, really helpful.\r\n\r\n\r\nNikolas Hulewsky (17:07.277)\r\nSo, okay, so in August, when you were like, let's try this, because it sounds like August is when you launched, how much of it was this is a test and how much of it was like, no, we're gonna go hard at this to see what does that make sense? Like, it a, yeah, let's kind of just test this idea on the side or was it more deliberate than that?\r\n\r\n\r\nMichael Clark (17:12.728)\r\nMm-hmm. Yeah.\r\n\r\n\r\nMichael Clark (17:23.834)\r\nYeah\r\n\r\n\r\nYeah, it was, Hey, this is a cool idea. This is something we really want to do. We have one story. We can get people to sign up. Maybe we'll have a few people, couple hundred people sign up and we'll send letters, you know, twice a month, be pretty simple. And, that's sort of where I was. And, you know, cause I was still working, I was consulting, I was also doing the startup and I had a lot of different things going on. so a bulk of the start.\r\n\r\n\r\nNikolas Hulewsky (17:38.637)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (17:45.301)\r\nInteresting.\r\n\r\n\r\nMichael Clark (17:54.704)\r\nwas, you know, on my wife for the writing, the creative process and the ordering of all the inventory and stuff like that. She did most of that. Um, I built the website. built, you know, everything, got everything ready from a technical standpoint payments and, uh, put it out there. And I wasn't like doubtful. I'm like, this would be cool. Even if we have like, you know, 80, a hundred people sign up. Cool. Yeah, that'd be, that'd be super fun. And, um, it just started taking off.\r\n\r\n\r\nNikolas Hulewsky (18:17.057)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (18:23.126)\r\nHow did it blow up? Did you guys run paid ads? Was it all organic? You did. Okay, where?\r\n\r\n\r\nMichael Clark (18:26.18)\r\nWe, yeah, paid ads. Yeah. yeah. Absolutely. Meta the time Facebook. And so, we, you know, we, started to dabble in like, let's, know, and, we, we kind of went in and started figuring that whole thing out.\r\n\r\n\r\nNikolas Hulewsky (18:32.93)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (18:43.489)\r\nDid you have experience with Facebook ads at the time? No.\r\n\r\n\r\nMichael Clark (18:45.516)\r\nNo, no, not at all. But I, but I worked with a guy or he was this guy's a kid, man. He's just one of the brightest kids I've ever met. lucky, lucky enough to have him, you know, talk about it. He's like, Hey, that's kind of interesting. I'm like, Hey, you want to like run some ads for us? Like, what do think?\r\n\r\n\r\nAnd so he, he came in and started doing it, started working about November. He's like, Hey, I found this course about ads. What do you think? Can we invest in that? was like, sure. You know, I looked at it. If we can kind of invest in something like that and kind of grow, you know, internally and figure that out. So we invested in a course with a, to learn how to do it. And by the end of the year, I mean, he was a top tier media buyer and just, you know, doing so well.\r\n\r\n\r\nAnd he was, he's been, you know, fantastic throughout and people are like, Hey, what's the secret? I'm like, you got to find yourself an Ethan. His name's Ethan.\r\n\r\n\r\nNikolas Hulewsky (19:47.637)\r\nReally? Yeah, how? That's interesting. How much of it do you think was the offering and how much of it do you think was Ethan?\r\n\r\n\r\nMichael Clark (19:53.701)\r\nit's a good mix. The offering, I think it's compelling. So when people see it, it's not like, yeah, just give it a try. You know, this looks kind of good. Well, we want to find other people that see it and they get it. They go from top of funnel to purchase, right? There's no like, I'm kind of in here, right? And then every business wants that. But that's the customer we find. We're finding so all most of our people coming top of funnel to purchase really fast because they see it.\r\n\r\n\r\nThe idea executes and if you can position that in your ads and do a good job with your copy and your creative, it'll work. It works.\r\n\r\n\r\nNikolas Hulewsky (20:29.709)\r\nSo end of the year, you get to 5,000. How much did it cost you to get to that 5,000?\r\n\r\n\r\nMichael Clark (20:33.157)\r\nYeah.\r\n\r\n\r\nman, that's a good question. should have looked at that. we were, our customer acquisition at that point was around 30.\r\n\r\n\r\nNikolas Hulewsky (20:45.133)\r\n$30?\r\n\r\n\r\nOkay, so you were looking at it, had you built out the pricing at that point? Or were you still kind of?\r\n\r\n\r\nMichael Clark (20:53.392)\r\nYeah, no, we built the pricing out. And so what we looked at, you know, in customer acquisition, you know, it's a daily, are we profitable? so early on identifying the key metrics, because if you look at it, first subscription, right. And our cost to customers $30 and they're paying us $10 a month. One, it's not three, four months until like, you're you've paid back your marketing expense. And on that, you're not even, you know, there's no cogs.\r\n\r\n\r\nNikolas Hulewsky (21:21.005)\r\nDo I sound like I'm breaking up too at all? Okay, give me one second. My earbuds were walking out. Let me just redo this.\r\n\r\n\r\nMichael Clark (21:24.814)\r\nNo. No.\r\n\r\n\r\nMichael Clark (21:34.128)\r\nreconnect.\r\n\r\n\r\nNikolas Hulewsky (21:36.351)\r\nNo, no, you were good. You were just like all of a sudden, like I was underwater talking to a robot. So will you say that again? Because I couldn't quite hear it. did you have the pricing set up?\r\n\r\n\r\nMichael Clark (21:47.249)\r\nYeah, so the, yeah, our pricing was, we started at $12 a month and you could prepay for 124 or something like that. And, uh, you know, when you look at the prepaid is really the key to the success, because if you're paying $30, I mean, in meta, if you've done any media buying, like acquiring a customer for under $20 is like really difficult at volume. Um, and so you have to be willing to spend.\r\n\r\n\r\nNikolas Hulewsky (22:12.077)\r\nMm-hmm.\r\n\r\n\r\nMichael Clark (22:15.502)\r\nYou have to be willing to invest and kind of put, put money back in to invest in marketing and the marketing engine. And, that's why, you know, if it's subscription based and it's just people are giving you 10, 10 bucks a month. And you're not making any money on that customer for a while, months and you know, you're underwater. Right. Absolutely. And so that, that was key for us and being able to kind of get that to that point.\r\n\r\n\r\nNikolas Hulewsky (22:37.185)\r\nespecially if you're not collecting that cash, right?\r\n\r\n\r\nMichael Clark (22:45.978)\r\nfigure out our pricing to make the prepaid attractive and people could purchase that.\r\n\r\n\r\nNikolas Hulewsky (22:48.397)\r\nWhat was your?\r\n\r\n\r\nWhat was your customer acquisition cost assumption going into it? Did you think it'd be 30? Did you think it'd be more, less? You had no idea. Okay. How long did it take you until you realized like, okay, $30 is the customer acquisition cost.\r\n\r\n\r\nMichael Clark (22:57.466)\r\nI had no idea. Till we tested, till we tried it. Till we just...\r\n\r\n\r\nMichael Clark (23:06.768)\r\nIt was probably November around Black Friday. We started to really figure out this is kind of where we're at $30. Unfortunately, it's started, it's been going up every year and it's a constant struggle to continually figure out that whole formula.\r\n\r\n\r\nNikolas Hulewsky (23:26.957)\r\nSo, so if in November you are like, it's $30 to acquire a customer. And we know that you get to the end of the year, you have 5,000 subscribers. So you, you spent $150,000 to get those 5,000 subscribers ballpark. Um, how, when did you have the confidence that it was like, just got to put this money in and why did you have the confidence that like, yeah, we\r\n\r\n\r\nMichael Clark (23:37.52)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (23:55.181)\r\n$150,000 makes sense because this is the economic return. Like how did you think about the economics of the business?\r\n\r\n\r\nMichael Clark (24:04.699)\r\nWe thought, think differently. So I think of the money I made today is going to be invested tomorrow. That makes sense. If I'm not profitable, if I'm not profitable today, I'm not profitable tomorrow because I have no money. And so what that mind frame is like, okay, we've got to really dial in this advertising and marketing so that we're profitable every day.\r\n\r\n\r\nNikolas Hulewsky (24:07.403)\r\nWell-\r\n\r\n\r\nNikolas Hulewsky (24:15.095)\r\nOkay, it doesn't make sense.\r\n\r\n\r\nNikolas Hulewsky (24:23.147)\r\nMm.\r\n\r\n\r\nMichael Clark (24:33.731)\r\nAnd so we're focused on profitability every day. Some marketing, you know, people don't look at it. They're like, Hey, let's throw money in a month and let's look at that. It's like, well, let's make sure we're profitable every day. So we've nailed that down and we're able to reinvest cash every day. And so it wasn't in my mind. In my mind, it wasn't, I'm putting 150 grand into this. In my mind, I'm saying I'm putting as much money as I possibly can within my KPIs to grow.\r\n\r\n\r\nNikolas Hulewsky (24:51.159)\r\nIf I'm\r\n\r\n\r\nNikolas Hulewsky (25:02.317)\r\nWhat's API? Oh, KPIs. Yeah, yeah, yeah. Well, I'm just looking at it from the perspective of, let's just say everybody pays upfront that $124 and it costs you $30 to get them. Approximately a four time return on ad spend. Is it?\r\n\r\n\r\nMichael Clark (25:03.611)\r\nKPIs, KPIs,\r\n\r\n\r\nMichael Clark (25:13.089)\r\nMm-hmm. Right.\r\n\r\n\r\nMichael Clark (25:21.509)\r\nYeah. But then you got, then the crazy thing we can, the cogs on operations. It's a, that's a, that's the biggest challenge in a business like this.\r\n\r\n\r\nNikolas Hulewsky (25:29.259)\r\nWait, before we even get to the cogs and operations, is that four to one ratio good? did you know that it is good? Okay. What's\r\n\r\n\r\nMichael Clark (25:35.792)\r\nYeah. Really good. Yeah. I mean, a four X row ass I hear you're doing pretty good. for us, you know, we, we, we target like a three from a KPI standpoint for a new customer. have a lot of people that are coming back. And so our true row as on a daily basis is, know, on the fours and fives, but our new customer acquisition, our new customer row as we target, want to be about three.\r\n\r\n\r\nNikolas Hulewsky (25:41.665)\r\nWhat's a typical ROAS?\r\n\r\n\r\nNikolas Hulewsky (25:51.627)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (26:01.613)\r\nMm-hmm.\r\n\r\n\r\nMichael Clark (26:03.781)\r\nThat gives us good profitability and from a new customer perspective to continue going.\r\n\r\n\r\nNikolas Hulewsky (26:09.557)\r\nIn the beginning, were you even looking at it like that? Were you even like, this is a 4X ROAS, we should keep doing it.\r\n\r\n\r\nMichael Clark (26:12.081)\r\nNo, I was like, what's what's I was like, what's Roas was me\r\n\r\n\r\nNikolas Hulewsky (26:17.517)\r\nWhat did, Ethan, what did you just say to me? What? Roaz, okay, we're turning.\r\n\r\n\r\nMichael Clark (26:20.975)\r\nROAS? I knew, like I've been to business school, but they don't talk about ROAS. They talk about customer acquisition costs, like, anyway.\r\n\r\n\r\nNikolas Hulewsky (26:26.209)\r\nYeah. Well...\r\n\r\n\r\nNikolas Hulewsky (26:31.169)\r\nWhat's interesting is you have a tech background and this business is a subscription business. It's a very tech like pricing model.\r\n\r\n\r\nMichael Clark (26:37.233)\r\nYep.\r\n\r\n\r\nNikolas Hulewsky (26:40.673)\r\nWas that on purpose or was it just because that's kind of the business that you knew?\r\n\r\n\r\nMichael Clark (26:44.549)\r\nIt made sense. mean, we're doing things over time. And so it made sense to do it on subscription. People pay monthly. We're operating on a monthly basis. And if they don't want to, if they want to cancel, then, you know, they can cancel and that's fine. Very, very low cancellation, by the way, which has, which has been really good.\r\n\r\n\r\nNikolas Hulewsky (26:45.965)\r\nIt does make sense.\r\n\r\n\r\nNikolas Hulewsky (26:57.485)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (27:02.975)\r\nSo, and this was probably the part that we got wrong. I'm looking at it, 110,000 letters a month is approximately, I'm saying approximately, $6 million a year. And there could be other things that you're selling in association with that, but it's approximately $6 million a year. And so Chris and I are looking at that and we're like, well, what's the fulfillment for this? It's gotta be super easy, right? You're just writing one story and you're sending it out. So this guy's gotta be, they gotta be making like three to $4 million a year.\r\n\r\n\r\nMichael Clark (27:10.491)\r\nMm-hmm.\r\n\r\n\r\nMichael Clark (27:24.209)\r\nHa ha ha.\r\n\r\n\r\nMichael Clark (27:30.397)\r\nI wish man. When you said that I was like, man, if I could get all the ad spend I've done in the last five years, I'd be doing good.\r\n\r\n\r\nNikolas Hulewsky (27:40.363)\r\nYeah, that is probably, that's probably the one piece we missed the biggest on was the ad, was the customer acquisition, right? The ad spend, because that's a lot of money.\r\n\r\n\r\nMichael Clark (27:45.637)\r\nYeah, yeah.\r\n\r\n\r\nYeah. And also the way that we set it up is interesting and you know, we, we wanted to make it a rich experience. And so we are so focused on the experience and making a great experience, because that's what it is. It's not a product. It's an experience. The product facilitates the experience. And so we're, we have to sell the experience and deliver on the experience. And so we made the product rich.\r\n\r\n\r\nAnd so there's a lot that goes into it.\r\n\r\n\r\nMichael Clark (28:23.446)\r\nJust give me an idea, sorry I'm ruining the shot.\r\n\r\n\r\nNikolas Hulewsky (28:27.945)\r\nediting my friend.\r\n\r\n\r\nMichael Clark (28:29.755)\r\nSo I'll just pick out a random letter, right? So this is from our Regency. And to kind of show you what comes in it, right? It's a Regency, this is called Adelaide Magnolia. So we sell a tin, right? So this is another product we sell. People can store their letters in there. But when you open each envelope, like here's the letter. If this is all we sent, you know, that's cool, okay. But.\r\n\r\n\r\nNikolas Hulewsky (28:36.439)\r\nWhat's it called? Reasons.\r\n\r\n\r\nNikolas Hulewsky (28:45.485)\r\nokay.\r\n\r\n\r\nMichael Clark (29:00.017)\r\nWe've got a note, you know, you know, then we've got these little kind of these old advertisements from the era. So let's go that this is public domain. This is stuff that we kind of figured out, but something like this, for example, all of this, and he did all that. So that's kind of like a post with all this side. This is like a coloring page, right?\r\n\r\n\r\nNikolas Hulewsky (29:11.351)\r\nWell, is the artwork custom?\r\n\r\n\r\nOkay. It was an actual advertisement.\r\n\r\n\r\nMichael Clark (29:29.329)\r\nSo there's like activities and yeah, it's a coloring page. Yeah, so like Anybody anybody I mean, it's just part of the experience they get it like cool. They can come in they can color They can put things up on the wall\r\n\r\n\r\nNikolas Hulewsky (29:29.997)\r\nIs it really a It's a coloring page? For adults or for kids?\r\n\r\n\r\nNikolas Hulewsky (29:41.419)\r\nNo, I've just learned how popular adult coloring books are right now. Dude, yeah, super popular.\r\n\r\n\r\nMichael Clark (29:45.442)\r\nyeah. Color by number of those things. Yeah. So when you think about it, step back and look at it and to kind of give you just running the numbers on the complexity and the way that I'll explain this, I've been in tech. I built apps, like I work with software developers, building out require crazy requirements for apps and software. This is by far the most complicated business I've ever done.\r\n\r\n\r\nNikolas Hulewsky (30:17.549)\r\nOkay, it doesn't seem complicated. It's like, all right, I write a couple stories. And again, this is from my own primitive, you know, caveman brain. Let's go chat GPT write me some stories. Okay, cool. Put some art slap some artwork on it. But in doing my research, you've got dude, you got 24 employees. It sounds like you're doing the majority of the film it yourself. It's not like you're outsourcing the fulfillment to other places. Walk me through from the creative process to sending the letter out. What does the workflow look like?\r\n\r\n\r\nMichael Clark (30:23.09)\r\nYeah.\r\n\r\n\r\nMichael Clark (30:34.681)\r\nMm-hmm, yeah.\r\n\r\n\r\nMichael Clark (30:38.652)\r\nYep. Yeah.\r\n\r\n\r\nMichael Clark (30:46.226)\r\nYes. So stepping back and it's also something that I will recommend to a lot of entrepreneurs is don't let existing technology keep you from executing your business model. Um, and by that, mean, you know, you have Shopify, you have all these apps, all these, you know, app people are trying to come in and kind of give you technology in terms of things to kind of, you know, make it work.\r\n\r\n\r\nThere's nothing like this in the world ever. It didn't exist. So we're inventing this model and trying to figure out how to make it work and make it rich and make it good. But if you think about it, like there's a lot of different pieces that go into each letter series across our six stories. There's more than 900 pieces that go into the story, into the, all of them.\r\n\r\n\r\nNikolas Hulewsky (31:41.549)\r\n900 pieces?\r\n\r\n\r\nMichael Clark (31:43.663)\r\nAcross the six stories. Yep. So that's all the letters, the telegrams, the, the cards, the, all of those pieces. And then if you go think about it, this, think about it this way. We let everybody sign up. We sign up people every day. Everybody starts on letter number one. We send 900 pieces of people signing up every day.\r\n\r\n\r\nNikolas Hulewsky (31:45.645)\r\nSo what?\r\n\r\n\r\nNikolas Hulewsky (31:52.736)\r\nWhoa, what?\r\n\r\n\r\nMichael Clark (32:09.746)\r\ntwice a month and you have to figure out how to batch them, how to keep it straight, how to organize it. And it's complicated across six stories.\r\n\r\n\r\nNikolas Hulewsky (32:20.813)\r\nWait, so, okay, one story has 900 pieces?\r\n\r\n\r\nMichael Clark (32:24.551)\r\nno, no, across the six stories, 900. So in our warehouse, we're managing over 900 pieces of inventory.\r\n\r\n\r\nNikolas Hulewsky (32:26.445)\r\nOkay, okay, okay.\r\n\r\n\r\nNikolas Hulewsky (32:30.957)\r\nI'm trying to do the math in my head. So 900 divided by six is gonna be what? 150 pieces per? 900 divided by six, yes, 150 pieces. There's 52 letters in, I'm such a stupid dummy. 24 letters. Oh, I could do math. 24 letters in each story. So each letter has on average,\r\n\r\n\r\nMichael Clark (32:38.556)\r\nsomething they're about, yeah.\r\n\r\n\r\nMm-hmm.\r\n\r\n\r\nMichael Clark (32:46.29)\r\n24 letters in each story.\r\n\r\n\r\nMichael Clark (32:55.762)\r\nYeah.\r\n\r\n\r\nMichael Clark (33:00.38)\r\nSix pieces.\r\n\r\n\r\nNikolas Hulewsky (33:01.158)\r\nSix pieces? What are the pieces? Okay, like I'm just thinking you have a letter.\r\n\r\n\r\nMichael Clark (33:05.542)\r\nSure. Yeah, here we go. I'll pull up another one. So just make this one a surprise. So this one, let's see, we've got the letter, right? Here's the letter. This is the letter. And this letter is one, two, three pages front and back.\r\n\r\n\r\nNikolas Hulewsky (33:17.933)\r\nHold it up so I can see it.\r\n\r\n\r\nMichael Clark (33:31.633)\r\nThen you've got this card. It's called Lucky Sixpence. This is just part of the story, just something that was part of the story. It's got a little kind of extra. The design is to have an immersive experience. So people kind of like get immersed back there. Then you have this. Right. And then you have this one. This is an embroidery pattern.\r\n\r\n\r\nNikolas Hulewsky (33:46.283)\r\nYeah, I was just going to say it makes it totally immersive. It enriches the story.\r\n\r\n\r\nMichael Clark (33:59.507)\r\nAnd so people get this and they're like, do embroidery. I'm going to make this. And we've had a lot of people make this and they share it on social media. It's pretty cool. So we have that. Uh, let's see, I don't know if there's quite six in this one, but then you have this guy. Oh yeah. So then there's this, this is a design to make what's called a reticule. So back in the day and reason, see here, you see this lady down here. She's got this little bag.\r\n\r\n\r\nNikolas Hulewsky (34:13.709)\r\nIt's okay.\r\n\r\n\r\nMichael Clark (34:28.73)\r\nSo we gave them a pattern of instructions on how to make one themselves.\r\n\r\n\r\nNikolas Hulewsky (34:35.501)\r\nWow.\r\n\r\n\r\nMichael Clark (34:36.593)\r\nSo.\r\n\r\n\r\nNikolas Hulewsky (34:37.901)\r\nSo you're just totally enriching the story experience. not like, dearest Martha, I went to the Red Sox game this weekend. Actually, that's not a Red Sox. What's a Red Sox? Yeah, I went to Boston Yard. Anyways, I went to the Red Sox game and it's like included as a ticket stub from the Red Sox or like an advertisement from, so it makes it feel real. It's enriched.\r\n\r\n\r\nMichael Clark (34:41.03)\r\nYeah.\r\n\r\n\r\nYeah, right.\r\n\r\n\r\nMichael Clark (34:50.544)\r\nMichael Clark (34:55.202)\r\nExactly. Yeah. Yeah. So like, you're there, like, so like, in our first story, you know, there's a train ticket, right? Super cool. We designed this whole train ticket. It's super fun. People get like, so cool. It's immersive and fun. Doing that just makes it that much more complicated and expensive. And so, you know, you that from a cost structure, but that's, that's us going all in, if that makes sense, right? And\r\n\r\n\r\nNikolas Hulewsky (35:22.957)\r\nNo, it does make sense, yeah.\r\n\r\n\r\nMichael Clark (35:24.324)\r\nAnd going in is like, know the story is rich. So now our challenge is going to be, how do we get efficient enough to make sure that we continue to be profitable, but also, you know, continue to provide a really rich experience for the people.\r\n\r\n\r\nNikolas Hulewsky (35:38.509)\r\nBecause all of those pieces, if you're just listening, he's held up a bunch of different papers. They're all different sizes. They're different colors. They're different, land, not landscape, but the way that it's laid out layouts, that's the word. There's different layouts on there. Like it's not like, hit the printer. And now I've got my six pieces. There's a lot that, that really goes into it. Do you print this all on site? Is any of this done like through third party fulfillment?\r\n\r\n\r\nMichael Clark (35:44.461)\r\nHmm yep\r\n\r\n\r\nMichael Clark (35:58.432)\r\nhuh. Right.\r\n\r\n\r\nMm-hmm.\r\n\r\n\r\nNo.\r\n\r\n\r\nWe know fulfillment. do all the fulfillment. we, we have always done the letter fulfillment. There's no machine that'll do this. there's machines that'll do part of it, but we have a team in house that we stuff all the letters and get them ready to go out. Yeah. Mostly customer service too. I mean, you think about the, you know, in order for this to work, the letters have to arrive in order.\r\n\r\n\r\nNikolas Hulewsky (36:24.683)\r\nIs that what the 24 people is for? Is all the fulfillment?\r\n\r\n\r\nMichael Clark (36:37.041)\r\nRight. And so you have to make sure you're sending the right letter at the right time, you know, and our team's incredible. The mail system's incredible. Like our error rates, like maybe 1 % sub 1 % error returns standpoint. And, you just have to dial in, you got to make it work. You got to be good at what you do.\r\n\r\n\r\nNikolas Hulewsky (36:56.461)\r\nPlease tell me your customer service is manned by a bunch of theater kids and they all just like take on a persona from that period. It's like they're calling for World War II and it's like, hello, dear, how can I help you? What can I put your call through? Oh, we messed that up, I'm sorry.\r\n\r\n\r\nMichael Clark (37:01.683)\r\nHahaha\r\n\r\n\r\nNot a bad idea. Not a bad idea. No, we, do, so far we haven't, we don't take calls yet. it's all through email. we do call people from time to time. but all through email, but yeah, we've got to, I mean, you have to get it right. lot of people. And you also think about our customers who are, think are just some of the best people on planet earth. When you interact with them, they're just like the kindest, you know, people and,\r\n\r\n\r\nSometimes I make a mistake ordering, they put in the wrong address, like, oops, I, know, and so we have a system for that. but you also have to be willing, you know, you're working with a postal service, you kind of put it out there. There's no real tracking that's there. And so when you look at, if you look at our reviews, the bulk of the negative reviews are two things. Very few people don't like the experience or the story. Like very, very few.\r\n\r\n\r\nThe issues come with delivery and then there's some people who can't see the writing and, and we have, we have solutions, you know, we're working on solutions for the writing, but like delivery is really, really important. And so we've resend letters a lot. if someone missed a letter, it's like, Hey, I just didn't get it. It's like, well, how do we, you know, we can't really prove that you didn't get it because it's not tracked as it's going through the mail system. And so we just, you know, people say I didn't get it. say, okay, no problem. We'll resend it.\r\n\r\n\r\nAnd so that's kind of factored into kind of what we do, but if you don't do that, it's like.\r\n\r\n\r\nMichael Clark (38:40.965)\r\nIt doesn't work. People have to get their letters in order and it has to work.\r\n\r\n\r\nNikolas Hulewsky (38:42.231)\r\nWell, I'm just-\r\n\r\n\r\nI'm just doing the math right here. If you have 110,000 letters a month going out and on average a little over six unique pieces per letter, that's over 8 million unique pieces a year that you guys have to batch together and send out. That's nuts. Yeah, yeah, yeah. That is, that, that.\r\n\r\n\r\nMichael Clark (39:04.935)\r\nYep.\r\n\r\n\r\nNikolas Hulewsky (39:07.765)\r\nOkay, I'll give it to you. At first, I read that quote when I was doing the research and I was like, well, of course, a tech guy is going to think any business is complicated next to I have software pay a recurring fee. But that's a lot of like different skews basically that you have to do fulfillment for.\r\n\r\n\r\nMichael Clark (39:09.213)\r\nW-w-w-w-w-\r\n\r\n\r\nMichael Clark (39:17.203)\r\nYou\r\n\r\n\r\nMichael Clark (39:21.381)\r\nYeah, it's a lot. It's a lot. Yeah, we've got a great printing partner is so good. It's really helped us grow and become more efficient. And really, that's where it comes down to is how efficient can you be in your cost of goods. And obviously, with grow, you can't do that unless you have volume. And at volume, you're able to grow because you get unit cost comes comes down significantly.\r\n\r\n\r\nNikolas Hulewsky (39:46.582)\r\nSo where does that put your net margins at then? Chris and I were like three to $4 million, but if you were on a percentage basis, where would...\r\n\r\n\r\nMichael Clark (39:50.348)\r\nman. No.\r\n\r\n\r\nSo the way that we run, we put almost everything back into the business. So we want to reinvest and invest. so, you know, there's been years where we've been decently profitable and then some years where we've lost. And because we want to reinvest, we're putting money back into growth. We're putting into equipment and more marketing. And so, you know, from a net standpoint, I won't tell you exactly exact numbers, but\r\n\r\n\r\nYou know, it's not in the millions, internet. Yeah.\r\n\r\n\r\nNikolas Hulewsky (40:27.457)\r\nInteresting. That is one of the interesting pieces of your business I wanted to ask you about is like, you have to expand the storyline because once somebody goes through those 12 months, story's over and you had a good 12 months, but if there's not something else for them to buy, then obviously that's a one-time customer. I mean, it's a one-time customer, but it's over the course of 12 months. When did you realize you needed to have other stories?\r\n\r\n\r\nMichael Clark (40:40.017)\r\nRight.\r\n\r\n\r\nMichael Clark (40:47.847)\r\nRight.\r\n\r\n\r\nRight.\r\n\r\n\r\nMichael Clark (40:55.027)\r\nOh, like, probably February of 2021. So we were like, yeah, we released another story the next year. We've done one story every year. So\r\n\r\n\r\nNikolas Hulewsky (41:01.599)\r\nOkay. January you go all in and you're like, February you're like, yeah, we probably need more stories.\r\n\r\n\r\nNikolas Hulewsky (41:12.087)\r\nInteresting. I'm assuming then that each, yes, there's the story, which is Brian and Martha are from this town and he lives here and she lives, But then there's also all the artifacts that go into enriching the story and bringing it to life as well. So you've got to not only storyboard it, but then also think about what are the little pieces that we're going to send to people to get them fully immersed, right?\r\n\r\n\r\nMichael Clark (41:35.213)\r\nYep. Yep. And that's where the genius Hanny comes to play. She is, it's incredible what she produces and what she can do. She's just immensely talented. She's figured out a way to tell a story in this way that is truly an art form. It's a unique art form. It's, it's early on, we had people like, Oh, this is kind of like a book. like, this is not a book.\r\n\r\n\r\nYou know, oh, it's kind of, it's a magazine. You're just sending things like, it is not a man. This is an experience. And so you're, you're not re you're writing a story, but you're writing an experience. And so when you're writing, you have to factor in the components that make that experience rich. And for her, she's like, this is a blast. I love it because I have creative. I can be creative. Like I can to tell the, to tell, uh, uh, a key plot point, I can send the telegram that's, know,\r\n\r\n\r\nNikolas Hulewsky (42:22.669)\r\ncreative.\r\n\r\n\r\nYeah.\r\n\r\n\r\nMichael Clark (42:32.436)\r\n15 words that moves the story along really well. And for the user, you think about it, they put, pick up, they're holding a telegram, it's in their hands, it's not being described, they're reading it, there's details like a date, a stamp, where it came from, they're reading it, and they're kind of putting themselves into the shoes of someone getting a telegram, stuff like that.\r\n\r\n\r\nNikolas Hulewsky (42:57.389)\r\nDo you have a team of writers? Is it just her?\r\n\r\n\r\nMichael Clark (42:59.142)\r\nNo, it's just her.\r\n\r\n\r\nNikolas Hulewsky (43:01.037)\r\nDo plan to get a team at some point? Or is it just like, no, she likes doing the stories. It's just one story a year. She can totally do the story.\r\n\r\n\r\nMichael Clark (43:03.868)\r\nI have a-\r\n\r\n\r\nSo my crazy mind, I modeled out a writing team and I like, there's a model where we could release a story a month. And, but at this point right now for us, this is, it's kind of like our baby. It's her baby. Really? These, stories are like babies for her and she loves it. And she's so good at creating these stories. Then I worry that if we were like, Hey, let's bring a team of writers in that somehow would just maybe lose some of that magic. And,\r\n\r\n\r\nNikolas Hulewsky (43:36.225)\r\nYeah. It's funny, I had a whole set of AI questions I was going to ask you, but you've already answered the questions. You know what I mean? It's like, why aren't you using AI for this? You've already answered why you're not using AI for this.\r\n\r\n\r\nMichael Clark (43:37.928)\r\nBut we'll see.\r\n\r\n\r\nMichael Clark (43:43.614)\r\nyou\r\n\r\n\r\nYeah.\r\n\r\n\r\nWell, so the, on that we, there will be, so there's, we just released a story, Orchid May where AI made up a small piece of some of the images. And so we, it's not like a, this whole thing is AI. It's like, no, that image in that component is AI, but no AI is in the writing or story. Just maybe some of the artistic components in that story. Every other one is there's no AI. So.\r\n\r\n\r\nNikolas Hulewsky (44:20.045)\r\nI mean, think somebody could launch a really cheap knockoff with high churn of this business using AI. But I also think I got into a, arguments is wrong word, debate with my brother-in-law who's an editor. He's a creative, genius, very creative. Yeah, amazing. And I come from the perspective of like, well, why wouldn't you use AI within the creative process? It doesn't mean that AI is writing, right?\r\n\r\n\r\nMichael Clark (44:27.102)\r\nSure, yeah. Yeah.\r\n\r\n\r\nMichael Clark (44:35.676)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (44:49.549)\r\nmaybe your wife's writing about the mid 18th century England and she wants to do some research and it's like, hey, tell me about, you know, what I don't know, Hyde Park looked like during the mid 1800s or what would what would a story be like within that period of time? So utilizing it in that in that capacity, I think makes a ton of sense for AI.\r\n\r\n\r\nMichael Clark (44:55.536)\r\nYeah.\r\n\r\n\r\nMichael Clark (45:11.624)\r\nYeah, like research, but at the same time, I think we're even where AI is now, think, maybe we're not ready to talk about this, but I think, I think sometimes people are being led astray. It's like almost to the point where like we trust AI to give us the perspective on a situation more than we do about the person in that situation. It's crazy. It's kind of getting, it's getting bonkers. With store, yeah.\r\n\r\n\r\nNikolas Hulewsky (45:34.305)\r\nTotally. Dude, it's dead.\r\n\r\n\r\nI'll do that sometimes, I'll ask AI a question and I'm like, well, what do you think, AI?\r\n\r\n\r\nMichael Clark (45:42.995)\r\nI think it's a good, it's, it can be a good resource, right? At this point. But I, in order for AI to actually work like in a business, you yourself, you have to hit a certain competency in that business for it to even play a role. Because it's like, all right, I'm going to code an app using grok. It's like, okay.\r\n\r\n\r\nDo you know about design? Do you know if it's good? Are you just going to rely on Grok to tell you that it's good? Right? Because Grok is like, maybe, maybe it knows. Maybe it doesn't. But if you're, if you don't have competency, like if you don't know how to code yourself or you're not learning along the way and you're not learning, it's, it doesn't work. So you have to have a certain competency level in order for AI to actually work. like reading comprehension, like you have to be able to read and understand.\r\n\r\n\r\nhow to dissect information. Like if you're doing research and you're pulling up something, it's like, okay. But what's even more important is you've got to be willing and know that's like, okay, that's one source. Let's start digging into more. Let's go deeper.\r\n\r\n\r\nNikolas Hulewsky (46:38.135)\r\nin order for AI to work.\r\n\r\n\r\nNikolas Hulewsky (46:51.937)\r\nWell, yeah, I actually think and talk about this a lot. I, is not yet capable of novel ideas. I'm sure it'll get there at some point, but it's not yet capable of like thinking of something totally new and inventing. And someone's probably going to be like, actually I can if you do it like that. But I'm just talking broadly speaking, the way that we use it, it doesn't do that. And sometimes people use it for that. What it's really good at is taking a lot of data, synthesizing it.\r\n\r\n\r\nMichael Clark (47:02.439)\r\nMm-hmm.\r\n\r\n\r\nMichael Clark (47:14.069)\r\nSure, yeah.\r\n\r\n\r\nMichael Clark (47:19.989)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (47:21.921)\r\ngive us giving us analysis or maybe even pulling out findings that we didn't see the first time. So if you're using it for creative tasks, then at some point, and this is my my brother in law's argument, at some point, everything just looks the same. Because it's all the same model. It's all trained on the same stuff. And so it's just regurgitating the same crap. So you have to know how to use it in the right way. And that's effectively what you're saying.\r\n\r\n\r\nMichael Clark (47:26.751)\r\nYep.\r\n\r\n\r\nMm-hmm.\r\n\r\n\r\nMichael Clark (47:40.691)\r\nYeah.\r\n\r\n\r\nYeah, absolutely. You know, even look at in storytelling, you know, for our market, right, we'll never use AI to tell a story like it. It's just not in us. Right. First, you have to disclose it like you can't say that you wrote it. I think that's dishonest. You should, but for.\r\n\r\n\r\nNikolas Hulewsky (48:03.873)\r\nWell, you don't have to disclose it, but yeah, it's pretty dishonest if you don't.\r\n\r\n\r\nMichael Clark (48:09.66)\r\nFor people that are thinking about just doing this through AI, it's like the people that are going to sign up for these letters will sniff out AI.\r\n\r\n\r\nthey'll know it's not like I see I see some people that have popped up and I'm like, that's AI. It's easy to see. Because I'm a creative, like I'm a storyteller, like my wife's the main storyteller, but we'll see something like that's AI. Or you're watching if you're if you watch a lot of movies, right? AI starting to kind of play the factors into the the the CGI and like, to the train to the trained I they're like, that's AI, right?\r\n\r\n\r\nNikolas Hulewsky (48:22.135)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (48:43.853)\r\nplot. yeah.\r\n\r\n\r\nMichael Clark (48:48.634)\r\nOr if you look at a lot of photos, you're like, that's AI. It's easy for people with trained eyes to pick out and to sniff out. And if you're creating something that is for a particular market and if they're not expecting something to be AI, they'll sniff it out a mile away and I think you'll lose.\r\n\r\n\r\nNikolas Hulewsky (49:12.301)\r\nWhat was your revenue last year?\r\n\r\n\r\nMichael Clark (49:14.74)\r\nOur revenue last year, good question, it was 4.5.\r\n\r\n\r\nNikolas Hulewsky (49:19.949)\r\nand the year before that.\r\n\r\n\r\nMichael Clark (49:21.716)\r\n3.2\r\n\r\n\r\nNikolas Hulewsky (49:24.621)\r\nOkay, you're growing really fast. You're growing really fast.\r\n\r\n\r\nMichael Clark (49:27.272)\r\nWe are. Yeah, this year we're, that's really difficult to do. It's this year, I'm hopeful will end between eight and 10.\r\n\r\n\r\nNikolas Hulewsky (49:36.301)\r\n8 and 10 million? Holy crap, What? What would I?\r\n\r\n\r\nMichael Clark (49:41.278)\r\nWe'll see. We'll see if what we can pull off, because Meta's, mean, anyway, there's a whole advertising thing that we're working through.\r\n\r\n\r\nNikolas Hulewsky (49:48.759)\r\nWell, what I think is really interesting about what you're doing is, like you said, you're reinvesting everything back into the business. and you didn't say it this way, but the way I see it is you're building a moat. You're building this like catalog, this library of stories. So it's like every year we release a story. Cool. But if you stopped today, let's just say you stopped writing stories today and you've got six stories, you could theoretically have a customer stay around for six years at that.\r\n\r\n\r\nMichael Clark (49:54.493)\r\nYeah.\r\n\r\n\r\nMichael Clark (50:02.431)\r\nYeah.\r\n\r\n\r\nMichael Clark (50:16.425)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (50:16.845)\r\n$140, whatever the number is per year. So you've got a pretty sustainable, consistent, at least for five years, you've got like a real asset. Just think about how that compounds every year that you release a new story. I would, I mean, I would bet this becomes very profitable. If you stopped right now, you'd be very profitable, but the compounding effect of it just gets even more profitable as time goes on. Do you think of it in those terms or is that just you do?\r\n\r\n\r\nMichael Clark (50:20.639)\r\nMm-hmm.\r\n\r\n\r\nMichael Clark (50:29.322)\r\nMm-hmm.\r\n\r\n\r\nMichael Clark (50:40.521)\r\nYeah, I do. Exactly. So if there's I mean, for entrepreneurs, it's like I can do the long game or I can do the short game and get rich and buy a Ferrari, right? And a lot of lot of there's a lot of pull for these young entrepreneurs. like, I want to build an app all by myself, I want to sell it, I want to do this business, I want to just have all this income and be rich, right? And I want to make a million dollars in like, it's like a million dollars, dude, that's not, that's not enough. It's a lot of money, but like,\r\n\r\n\r\nYou're like 25 and you're going to retire on a million. It doesn't make sense to just do the math. or you can build something that. Yeah. You're not going to make a lot of money along the way, right? It's we live a very modest lifestyle, you know, to, most people, to us as well, but you know, we, we do fine. We're doing okay. But our, our goal and intention.\r\n\r\n\r\nNikolas Hulewsky (51:12.332)\r\nHahaha\r\n\r\n\r\nMichael Clark (51:37.466)\r\nis our mission. And so we are so mission focused. That's the purpose behind it. But the long game is exactly what you're saying. It's building a catalog of incredible stories. That's an incredible experience that can expand. And so one story in and of itself can now expand into we haven't been explored audio books, TV shows.\r\n\r\n\r\nwebisodes. mean, there's so many different things we can take these stories that people love and have this is a large audience and people who experience these stories and say, well, we're going to turn Audrey Rose into a TV show, which we're actually talking about right now. And it's, it's those things. And so all of sudden we have this catalog and like, all of sudden it's like, wow, these are great stories. There's a big audience. There's opportunity that compounds across that.\r\n\r\n\r\nNikolas Hulewsky (52:11.799)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (52:32.727)\r\nBlink twice if it's Angel Studios. It's Angel Studios, I knew it. I knew you were talking to Angel Studios. No, I have no information, I'm just like.\r\n\r\n\r\nMichael Clark (52:43.249)\r\nNo, I'm not talking directly with angel studios. There's we have my brother's actually a producer has a production company and, um, in Utah here. Yeah. Yeah. He's, he's, he's working on the icon. I can't, don't think I can tell you the things he's working on, but he's anyway, we're, talking and, you know, figuring out the whole production thing, but I mean, we have so many. Oh, really?\r\n\r\n\r\nNikolas Hulewsky (52:50.208)\r\nwhere?\r\n\r\n\r\nUtah.\r\n\r\n\r\nNikolas Hulewsky (53:04.087)\r\nI have a brother who's a producer in Yeah, Ian Puente. was the COO of BYU TV and just launched his own production company. You know my brother? yeah, okay, yeah. Yeah, he's much smarter than me. So don't judge him based on this interaction. Dude, I hadn't even thought about the other types of content that you can go into.\r\n\r\n\r\nMichael Clark (53:12.245)\r\nI know who that is. I've heard of him, yeah. Yeah, absolutely. I'm sure my brother knows him too.\r\n\r\n\r\nyou\r\n\r\n\r\nMichael Clark (53:31.765)\r\nBut also on top of that product, so you look at, you know, the opportunities that, and this is how I think, right? And this is how the, our, and we're configured as a business is, and going all in. You think about other products, like we have a tin. Why don't we sell what? A letter opener. Duh. Why don't we sell like a magnifying glass, you know, or why don't we sell.\r\n\r\n\r\nNikolas Hulewsky (53:54.711)\r\nYeah.\r\n\r\n\r\nMichael Clark (53:56.875)\r\nadditional postcards. mean, so many different products are stationary and there's so many different products that we can also add that will kind of help grow the business. so, but it's like, it's so hard because the way we, I mean, we're, we're self-financed. We, we finance on revenue. haven't raised a ton of money or any money. I should say that. but you know, it's, it's difficult to, you just have to add when you can and kind of do different things when you can.\r\n\r\n\r\nNikolas Hulewsky (54:22.433)\r\nWell, I mean, the thing that's crazy about it is now you're to the point where you're generating enough cash where it just all goes back into investing. It's like the flywheel is probably going to take off. But yeah, in the beginning, you were just bootstrapped trying to figure out how to grow this thing. To me, that's the most interesting thing about this. I'm trying to pull up some, cause I did some research on this before. I think the thing, one of the things that people don't talk enough about is the opportunity.\r\n\r\n\r\nMichael Clark (54:36.327)\r\nyeah?\r\n\r\n\r\nNikolas Hulewsky (54:51.755)\r\nto leverage the US Postal Service. It's subsidized by our tax dollars. We know that it loses money.\r\n\r\n\r\nMichael Clark (54:55.719)\r\nMm, yeah.\r\n\r\n\r\nMichael Clark (55:00.478)\r\nIt's not.\r\n\r\n\r\nNikolas Hulewsky (55:02.367)\r\nIt's not at all subsidized by our tax dollars.\r\n\r\n\r\nMichael Clark (55:03.867)\r\nNo, it's all self-funded. So their operations are funded through customer revenue.\r\n\r\n\r\nNikolas Hulewsky (55:06.795)\r\nWell, it loses money every single year. So how does it make up the shortfall?\r\n\r\n\r\nMichael Clark (55:12.022)\r\nI don't know if you go look at just, they're, don't take it. There's no, far as I'm con I understand they're not, they don't use taxpayer money.\r\n\r\n\r\nNikolas Hulewsky (55:22.925)\r\nI'll have to get the exact numbers. Either way, let's just compare. Why don't you ship with FedEx or do you ship with FedEx?\r\n\r\n\r\nMichael Clark (55:27.712)\r\nSure. Yeah.\r\n\r\n\r\nMichael Clark (55:34.582)\r\nno, we use a USPS. They're the best price. Most, most Ecom, most Ecom. That's their number one. think, you know, they're, they're from a, package standpoint, USPS has been great. They do a good job. yeah. FedEx is just, it's just too expensive.\r\n\r\n\r\nNikolas Hulewsky (55:37.345)\r\nOkay, 100%.\r\n\r\n\r\nNikolas Hulewsky (55:57.685)\r\nAnd Chris and I have talked about this a lot in the delivery of packages. If someone, the open rate and the response rate, because we've tested this, of a package that has a little trinket in it versus just a letter is insanely higher with the little trinket. And you can buy these trinkets for a small amount. But effectively, that's what you're doing is you're sending them these packages. They know they have something in there. And so you're piggybacking off of the USPS in order to have.\r\n\r\n\r\nMichael Clark (56:15.669)\r\nYeah, yeah.\r\n\r\n\r\nMichael Clark (56:22.728)\r\nMm-hmm. Right.\r\n\r\n\r\nNikolas Hulewsky (56:27.713)\r\ndistribution to individuals. just think that that partnership has been probably pivotal for you guys' success,\r\n\r\n\r\nMichael Clark (56:35.062)\r\nYeah, they've been fantastic. And you'll notice that Doge didn't touch them.\r\n\r\n\r\nNikolas Hulewsky (56:41.04)\r\nthat is interesting, yeah.\r\n\r\n\r\nMichael Clark (56:42.462)\r\nYeah, so there was nothing. mean, you'll see hearings, it's because there's no taxpayer dollars going into it.\r\n\r\n\r\nNikolas Hulewsky (56:49.101)\r\nLet's see here, I'm looking right here. The USPS borrows funds from the US Treasury, but there's a statutory limit of up to $15 billion that they've used to cover shortfalls. So now I'm gonna have to go like, I spent too much time looking into the USPS. Insane, thought for sure it was taxpayer funded.\r\n\r\n\r\nMichael Clark (57:04.822)\r\nYeah, it's fascinating. mean, postal service, they've been they've been a great partner. mean, we love the postal service. We love the people. You have to I mean, when you look at it, sometimes I call it the miracle of mail. Because like right now, like a kid that's been raised on technology, they're like, yeah, an email just works, right. But then you tell them, hey, did you know you can put this piece of paper in this little envelope inside this box? And in a couple days, it's going to be in London.\r\n\r\n\r\nNikolas Hulewsky (57:24.471)\r\nRight, right.\r\n\r\n\r\nMichael Clark (57:34.454)\r\nThey're like, what? Really? How does that work? then they're all all sudden curious about, well, how does that work?\r\n\r\n\r\nNikolas Hulewsky (57:35.916)\r\nIt's insane.\r\n\r\n\r\nNikolas Hulewsky (57:43.703)\r\nWell, you know, like every millennial in their mid thirties, my every single day we've got multiple packages being delivered from Costco or Amazon or Target or wherever my wife's buying stuff. And my three and five year old are like every day, but there's a package. doesn't, it doesn't matter that it was like tile cleaning, you know, solution. just like, it's a package that we can open. there is something magical about holding it in your hands. If I can make a recommendation, if I might be so bold as to make a recommendation.\r\n\r\n\r\nMichael Clark (57:53.142)\r\nYep.\r\n\r\n\r\nMichael Clark (57:57.45)\r\nRight? Yeah.\r\n\r\n\r\nRight.\r\n\r\n\r\nMichael Clark (58:04.917)\r\nYeah.\r\n\r\n\r\nMichael Clark (58:10.561)\r\nYeah, I'm, listen, I'm open. One thing I've learned in, in, in entrepreneurship and business, nobody knows what they're doing. Nobody. Okay. Include, including me. And so like that's, that's, that's really helped me because I'm open to idea. I'm open to suggestions, you know, understanding how to things differently. So let me have it.\r\n\r\n\r\nNikolas Hulewsky (58:25.837)\r\nHelp.\r\n\r\n\r\nNikolas Hulewsky (58:31.885)\r\nOkay, here's one. I think this would be awesome. How many total customers have you had over the last five years?\r\n\r\n\r\nMichael Clark (58:40.855)\r\n138,000.\r\n\r\n\r\nNikolas Hulewsky (58:43.244)\r\n138,000 of those 138,000 how many of them would you say have small children?\r\n\r\n\r\nMichael Clark (58:49.521)\r\nmost of them.\r\n\r\n\r\nNikolas Hulewsky (58:50.805)\r\nUnder 15. Okay. Most of them. I don't know how you do it, but I think if you set up a pen pal service for kids, like a matchmaker service to, you're not writing the letters, right? You're just facilitating the kids connecting with one another. And I don't know. I don't know if you set up a website or if you just like go to your distribution lists, but I remember as a kid having a pen pal and it was so cool. We did it in elementary school and you like got to get these letters from them. And like my grandfather used to play chess and he\r\n\r\n\r\nMichael Clark (58:58.719)\r\nYeah, yeah\r\n\r\n\r\nMichael Clark (59:05.045)\r\nYeah. Yep.\r\n\r\n\r\nMichael Clark (59:13.707)\r\nYeah.\r\n\r\n\r\nMichael Clark (59:19.775)\r\nYeah, that's so cool.\r\n\r\n\r\nNikolas Hulewsky (59:19.937)\r\nThat's how he played chess. He'd send a letter to his friends and they'd open it. And so I think you already have this great pool of people who've purchased from you that would probably be ideal candidates to have their kids sign up for this pen pal program through flower letters. anyways.\r\n\r\n\r\nMichael Clark (59:30.231)\r\nMm-hmm.\r\n\r\n\r\nMichael Clark (59:36.886)\r\nThat's a idea. mean, I think there's, we have people in our community. have a kind of a Facebook group and people meet and they become pen pals. So we send out these little, we send out these, postcards. think I can probably find one randomly, but these postcards come there's 12 in each story. and yeah, right here. they, there's. You get these postcards.\r\n\r\n\r\nNikolas Hulewsky (59:47.276)\r\nreally?\r\n\r\n\r\nNikolas Hulewsky (01:00:01.29)\r\ncool.\r\n\r\n\r\nMichael Clark (01:00:01.452)\r\nAnd it's, blank and they can use them. And like some people meet in this group, like, Hey, I'm going to write to you. It's like, okay. We love that. I mean, I mean, our mission, our four-pronged mission is bring joy and reach the mind, administer relief and unite family and friends. And so, you know, people connecting through what we do, we love it. Like we just talked to a woman on our podcast. She's fantastic. She started a book group out of our Facebook group.\r\n\r\n\r\nNikolas Hulewsky (01:00:08.887)\r\namazing.\r\n\r\n\r\nMichael Clark (01:00:28.095)\r\nand she's off there off running, she's reading books together, I'm like, we love it. Connect, know, be together.\r\n\r\n\r\nNikolas Hulewsky (01:00:33.965)\r\nSo, okay, tell me your po- I didn't know you had a podcast. What's your podcast? Okay.\r\n\r\n\r\nMichael Clark (01:00:38.173)\r\nwe just started it. It's called stories told through you, the flower letters podcast. And so we we've been toying with the idea of a podcast and we get so many people that write to us just deep, intimate stories, like, we can't, can't just like, they've all shared them. But they're incredible stories, like amazing people going through hard things and triumph, like for whatever reason, they share these things with us through a letter.\r\n\r\n\r\nAnd, you know, we said, well, what if we could invite people that are willing to come on and share their stories, whether it's interesting, inspiring or and they're just kind of normal everyday people. You know, they don't necessarily have to be well, have to be well known. And so we're working on we've done a few episodes and we're kind of we're working on it. We're going to play kind of do different things here and there, but we're still finding the voice in the audience for it.\r\n\r\n\r\nNikolas Hulewsky (01:01:18.573)\r\nThat's an incredible idea.\r\n\r\n\r\nNikolas Hulewsky (01:01:31.703)\r\nfriend of mine listens to a podcast, I can't remember what it is, but it's that. It's like stories. What is it called? Anyways, he loves it, because he's like, anything that you can imagine, there's different stories. Like there are subreddits where people post their experiences, but it's anonymized, right? Anyways, I think that's really cool.\r\n\r\n\r\nMichael Clark (01:01:38.32)\r\nyeah.\r\n\r\n\r\nMichael Clark (01:01:52.344)\r\nAnd then they just read them, think. think they have an AI voice read them, which is kind of interesting. Yeah, there's some that are produced, like they will go out and they'll do interviews, then produce them. And ours, we decided to just be conversation, like you and I are having, just to talk to people and get to know them a little bit. And people can kind of listen to the conversation. And so far it's been, it's been pretty interesting.\r\n\r\n\r\nNikolas Hulewsky (01:01:55.693)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:02:10.402)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (01:02:16.671)\r\nOkay, stories told through you. You have a YouTube channel. Sweet. I'm assuming this picture is of you and your wife. going to show this. This is pretty cool.\r\n\r\n\r\nMichael Clark (01:02:25.579)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (01:02:30.349)\r\nHere we go. Stories. There he is. Bro, bro, change your clothes. Smell you through the screen. Just kidding.\r\n\r\n\r\nMichael Clark (01:02:31.359)\r\nLook at that. I'm wearing the same I'm in the same outfit. What are you doing there?\r\n\r\n\r\nMichael Clark (01:02:42.433)\r\nThat's so funny. got, cause I wear this hat a lot, right? You know, just anyway.\r\n\r\n\r\nNikolas Hulewsky (01:02:47.445)\r\nUh-huh. Dude, it's a good hat. And you grew up in Boston, so of course you're, you gotta rep the Red Sox. I'm gonna pause that so it doesn't just start blasting through. Oh, this is sweet. So you guys just started.\r\n\r\n\r\nMichael Clark (01:02:59.775)\r\nYeah, so social media is another thing we mean, we just barely started. Yeah, trying to find it out, figure it out. And these guys right here, you'll see the letters from afar. They're actually another letter service. Totally awesome. They're designed for you scroll down, there's there's one of our they're one of our first guests. Right there, Shawnee and Palmer. Fascinating couple. They have a they do a letter service that's\r\n\r\n\r\nNikolas Hulewsky (01:03:04.79)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (01:03:12.023)\r\nWhere's, am I looking?\r\n\r\n\r\nNikolas Hulewsky (01:03:23.341)\r\nMichael Clark (01:03:29.409)\r\nfor mostly for little kids, but adults love it too. We enjoy it. Where their character goes to a certain place in the world and writes back about it, tells about the people, the culture. It's totally cool. So.\r\n\r\n\r\nNikolas Hulewsky (01:03:40.749)\r\nThis is awesome. This is so cool. All right, well, I've taken up enough of your time. This was amazing. The Flower Stories, the Flower Letters, sorry, theflowerletters.com. This one is their YouTube channel, Flower Letters, but this new series is called Stories Told Through You, which is awesome. I'm excited to check out the podcast. It's probably the best place for people to come find you, I'm assuming.\r\n\r\n\r\nMichael Clark (01:03:51.031)\r\nFlower letters.\r\n\r\n\r\nMichael Clark (01:04:00.683)\r\nYep.\r\n\r\n\r\nMichael Clark (01:04:06.977)\r\nSure, yeah, check out the YouTube, go to theflowerletters.com and yeah, that's where we're at.\r\n\r\n\r\nNikolas Hulewsky (01:04:11.735)\r\nCool. This was awesome, man. Appreciate you coming on. Okay, stay on for a minute. I'm gonna hit.\r\n\r\n\r\nMichael Clark (01:04:15.481)\r\nThanks Nick, appreciate it.",
  "metadata": {
    "duration": "",
    "date": "2025-09-03",
    "platform_source": "Google Drive"
  }
}