{
  "episode_number": "195",
  "episode_title": "How to Overcome Money Trauma with Clifton Sellers",
  "guest_name": "Clifton Sellers",
  "business_name": "Legacy Builder",
  "transcript": "﻿Nikolas Hulewsky (00:01.002)\r\nAll right, Clifton, you're one of my favorite people on social media. You've got hundreds of thousands of followers. You've started multiple businesses. You have a business this year. It's going to do two to $3 million top line, healthy margins. You and I know each other really well. Here's my question for you, though. Why was it so easy for you?\r\n\r\n\r\nNikolas Hulewsky (00:24.777)\r\nHahaha.\r\n\r\n\r\nClifton Sellers (00:25.607)\r\nEasy, huh? That's a funny question. Yeah, absolutely.\r\n\r\n\r\nNikolas Hulewsky (00:27.848)\r\nNo, I say that tongue in cheek because you have a post that you post somewhat frequently that talks about your background. And dude, I just think your story is incredible.\r\n\r\n\r\nClifton Sellers (00:39.958)\r\nI easy is the most relative term in the world, right? It's really easy for people to sit on the couch, look at a guy like me and say, man, it was just so easy, you know, especially from somebody that I wasn't brought up. It's not like I have a background in content marketing or agency. I didn't come up in Silicon Valley or I'm in Birmingham, Alabama. I was raised in level plains, Alabama. My dad was 10th grade dropout. They worked a blue collar job.\r\n\r\n\r\nI think if you want to, if you want to go down that rabbit hole of easy, I think easy comes on the backend of obsession. I think all the grades, the people that win in business and life, insert anything you want to win. I think it's on the other side of obsession and obsession gets such a bad rap in our society. I've gotten told I've lost friends over the last three years, man.\r\n\r\n\r\nUh, the people that have stuck by me are my wife and children. Uh, they never wavered. Um, my, few close friends, my dad, my dad stuck by me. Um, but a lot of people thought I was nuts. I mean, what, what are you going to do? I went to college. got three degrees. I, um, work. No, I got, I have a doctorate for God's sakes. mean, that's in the garage right now. Things in the garage over there.\r\n\r\n\r\nNikolas Hulewsky (01:58.654)\r\nThree degrees, you couldn't stop at one.\r\n\r\n\r\nNikolas Hulewsky (02:04.49)\r\nIn what?\r\n\r\n\r\nNikolas Hulewsky (02:09.491)\r\nWhat was your doctor then?\r\n\r\n\r\nClifton Sellers (02:10.784)\r\nOrganizational leadership.\r\n\r\n\r\nNikolas Hulewsky (02:13.012)\r\nBecause you went to school, you got three degrees, a doctorate, organizational leadership, and now you're messing around on Twitter. Obviously, I say that tongue in cheek, but to the outside world, that's what they're thinking, right? They're like, whoa, whoa, whoa, wait a second. Your dad dropped out of high school, the 10th grade. You got a doctorate, and now you're posting on social media? What's going on here? Talk about that. How did you even get into it? What was that transition like?\r\n\r\n\r\nClifton Sellers (02:38.604)\r\nYeah, there's a, there's a couple of reasons I got into it. Number one, I was broke. number, yeah, I was so broke. I was so in debt and I was, I was doomed scrolling on my couch on Twitter one night. My, my wife's asleep in a rental. got two babies upstairs asleep. I'm just like staring at credit card statements. I was like, I don't want to look at this anymore. So I pull up Twitter. I'm scrolling.\r\n\r\n\r\nNikolas Hulewsky (03:03.402)\r\nBecause what were you doing? Like what was your job at the time?\r\n\r\n\r\nClifton Sellers (03:06.498)\r\nI was a VP of development. was making 95K a year. mean, it was on paper. was very successful human. mean, but I was just, I had gotten myself into a hole like most people do in middle-class. I had a couple of car loans. I made some purchases I shouldn't have made from a consumer standpoint. And I was just, and then a big thing was I wanted my wife to be a stay at home mom. And we made that decision when I mean,\r\n\r\n\r\nNikolas Hulewsky (03:10.854)\r\nOkay. Hmm.\r\n\r\n\r\nNikolas Hulewsky (03:32.042)\r\nMm.\r\n\r\n\r\nClifton Sellers (03:35.96)\r\ntwo kids and life on a 95K a year salary, no matter where you're at is hard. When we made that decision, I was only making 50K a year. And so I was just supplementing with credit cards at the time. And...\r\n\r\n\r\nNikolas Hulewsky (03:51.466)\r\nBut by all standards, objectively you're like, we made this decision, she's going to stay at home, I'm making 50 grand a year. Fast forward a few years later, you're now making 95 grand a year. And you're like, I'm almost making double the income, why am I still drowning?\r\n\r\n\r\nClifton Sellers (04:04.504)\r\nBro, bro. mean, just drowning, just feeling terrible. mean, feeling like I'm playing catch up. And what I tell people is like, I looked at the people that were at the top of the field 10, 20 years around me. And I was like, they're not making much more than me. I mean, they're making 120, 140 K. I mean, the, it's not that big of a gap. So I'm like,\r\n\r\n\r\nAnd my earning potential over the next 10, 20 years is low relative, right? So I'm like, and then their lifestyle is like, they're, taking one vacation a year. If they're lucky, they're not in the greatest health. they're I'm commuting two hours a day at this point. I mean, it's just insane. Right. And so I'm doom scrolling. I see this guy on Twitter. He's like, I make a thousand dollars a week online. And I'm like, well, what the\r\n\r\n\r\nWhat is this guy doing? I'm like, this is ridiculous. know, I 4,000 a month after taxes or something like not even that much more. Right. And I bought this $29 Gumroad course. Yeah. first thing I ever bought was a $29 Gumroad course. And it was a Word document. It was a Word document.\r\n\r\n\r\nNikolas Hulewsky (05:16.265)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (05:23.934)\r\nWell, it wasn't even a course, it was just a word document.\r\n\r\n\r\nClifton Sellers (05:26.838)\r\nIt was a Word document. It was like set up profile. Pick, pick, pick, profile picture, write bio.\r\n\r\n\r\nNikolas Hulewsky (05:36.426)\r\nWait, wait, wait, wait, wait, wait, wait. So he's like, I make $1,000 a week online and this is my course to do that? Or like, how did you get to the course?\r\n\r\n\r\nClifton Sellers (05:40.706)\r\nYeah. yeah, man. That's the underbelly of this is why people don't. This is like the, the dirty. This is why people don't want to be online because like, and we all go, it's like a phase thing here, right? You start and you're like, everybody's a scam. It's a multi-level marketing scheme. Clifton's at the top now and he's got all these like people selling his crap. This is what's kept me out of courses for so long.\r\n\r\n\r\nCause I don't want to be, I don't want to be associated with like money Twitter or like this or that. And I started in that world. Right. I started when I first started, people told me like, you can make a thousand dollars a week by selling my stuff. And I'm like, heck yeah. This is going to be awesome. Man. That stinks. I was ripping, ripping guides and selling them. was making a few hundred bucks.\r\n\r\n\r\nNikolas Hulewsky (06:35.882)\r\nWait, what were you selling? I have to know, what were you selling?\r\n\r\n\r\nClifton Sellers (06:38.584)\r\nCourses to sell stuff. I mean, I don't know like I was selling guides on gumroad, you know, and I still wasn't making money because like I was putting so much time in that the money I made didn't I was still losing money on my time, right and so I Tried affiliate marketing e-commerce it eBay drop shipping all these different ways that like when you get online This is why people burn out. This is why people burn out and I didn't have any money\r\n\r\n\r\nNikolas Hulewsky (06:45.64)\r\nor you just go on.\r\n\r\n\r\nNikolas Hulewsky (07:05.598)\r\nMm.\r\n\r\n\r\nClifton Sellers (07:08.524)\r\nI couldn't buy inventory for eBay dropshipping business. And so yeah, that's how I started, man. was.\r\n\r\n\r\nNikolas Hulewsky (07:15.338)\r\nSo let's do it. Well, let's do it. Cause like you're, you're describing the, it's a double edged sword, right? On the one hand, there are people out, like you're a hustler. So I'm, you're more like my, my, my friend, my best friend, Chris, Kerner, he's a natural born hustler. He's just like everyday scheming is like, okay, what can I do to make a buck? And I think that many entrepreneurs are like that, but then there's me, I'm sort of the other end of the spectrum, which is more like, Oh yeah, I'm not going to be a hustler. Like find something for $2 and sell it for three.\r\n\r\n\r\nI'm going take my time and I'm going to plan it out and I'm going to figure it out. And like there's pros and cons to both sides, but there's a lot of people who are like you that are just, they're trying to figure it out. I want to make more money. I want to have control of my time. How do I make this work? And like you said on social media, there's lots of people who are like, I can show you how to do that. You can make a hundred thousand dollars in a weekend if you just put $4 in, I promise you it's a guaranteed, you know, and then they paid 30 bucks that they don't have and get scammed. But many times that's the price of tuition in my opinion, for those people who are hustlers. It's like,\r\n\r\n\r\nThey have to pay that price in order to kind of make it to the next level. Did you look at it like that at the time or were you like, man, I got all these bills and I just freaking wasted money on this course.\r\n\r\n\r\nClifton Sellers (08:25.56)\r\nYeah, ignorance text.\r\n\r\n\r\nNikolas Hulewsky (08:28.125)\r\nYeah\r\n\r\n\r\nClifton Sellers (08:29.524)\r\nIgnorance tax, my friend. think people ask me why I kept going. Because I spent eight months down that rabbit hole. And my wife's looking at me and she's an angel descended from heaven. I mean, she's looking at me and she's watching me like, she's like, what are you doing? I was like, I don't know. I don't know. But I see people winning. Like there's people out there winning. And I say this.\r\n\r\n\r\nI say this at that time, I say this now to my team. mean, I'm managing almost 20 people now, right? And when people come to me with a problem, they're like, this is, this is a problem. Like we can't figure it out. I'm like, there are people that have figured out this problem.\r\n\r\n\r\nYou just don't have the answer. It's not an unsolvable problem. It's just that you don't have the knowledge, the resources. You, just haven't figured it out. So take that out of your mind. It's not an unsolvable problem. It's just, we need to find a, person to solve it or B the information in which we need to solve it. And that's where I was. I, I literally put, put everything on the table and I said, I will not stop. And I tell like,\r\n\r\n\r\nNikolas Hulewsky (09:38.676)\r\nYou're searching.\r\n\r\n\r\nClifton Sellers (09:44.866)\r\nThe reason I am sitting in front of you today running a multi-million dollar business is because I was obsessed not to make money, but to the person that makes money and to find the answers that people had. I'm dumb, man. I'm dumb. I claim to know nothing.\r\n\r\n\r\nNikolas Hulewsky (10:08.179)\r\nWell, your PhD in organizational leadership would say otherwise, but...\r\n\r\n\r\nClifton Sellers (10:13.516)\r\nI said test it. PhDs are, education is a test of endurance. That's all it is.\r\n\r\n\r\nNikolas Hulewsky (10:20.19)\r\nWell, which is interesting actually, because you showed you had endurance there and you showed you had endurance now, right? Like this hasn't been an easy road for you to make the transition. There's one thing though that I want to hit on where in social media, it's very obvious that there are these like schemes, right? And, they, they can prey on people who are just looking and, trying to better themselves, but it's not unique to social media, right? There's multi-level marketing schemes in the real world.\r\n\r\n\r\nThere's all kinds of schemes that you get sold on. You get locked into a car that you didn't want to get to because of the salesman at the car dealership, you know, sweet talk to you to a certain point. You get locked into a phone or a health plan or whatever. You get insurance on that device that you bought at Best Buy that you didn't really want, but they sold you on it. You know what I mean? So like there's always this ignorance tax. It's just so obvious on social media. But the flip side is that there are actual people who are looking for that, that will still better themselves from it. Like there still is.\r\n\r\n\r\na value that comes from taking the course or learning some education, which is you. And I think the differentiator is what you just said. It's the endurance game. how do you, can you, can you hold endurance? So how did you, I mean, eight months, my wife would have been like, uh-uh, we're done. Eight months. what are we doing here, Clifton? How did you navigate eight months of just like figuring it out?\r\n\r\n\r\nClifton Sellers (11:34.222)\r\ncut bait.\r\n\r\n\r\nClifton Sellers (11:41.666)\r\nThere was a stopping point at January of 22. I said, this isn't working. I looked at my wife. was like, I'm, I'm, I'm no, I have a lot of knowledge. I'm further ahead than when I started, but I still am not making money. This was almost eight months in because I started in August. So January, and I said, okay. I'm, and I do this. I still use this framework.\r\n\r\n\r\nNikolas Hulewsky (11:54.09)\r\nMm.\r\n\r\n\r\nHow far in was this?\r\n\r\n\r\nNikolas Hulewsky (12:02.301)\r\nOkay, cool.\r\n\r\n\r\nClifton Sellers (12:10.272)\r\nI started reaching out to people that were ahead of me and I said, Hey man, can I jump on a call with you? They're like, yeah. So I reached out to a couple of people that had larger audiences than me that had larger, that were making more money than me. And I said, tell me what you're doing. And they said, you should just, just focus on growing your account. Just focus on writing. I was like, okay. So I did that. And, I started writing a thread every day.\r\n\r\n\r\nAnd now this is when threads weren't popular. Like now everybody writes threads, right? So I was very early into, right? I had people tell me I was crazy. I had people tell me that I was going to burn out my audience because I wrote threads every day. I had people tell me that I was botting my account because my account was growing so fast. In March of 2022, I grew 40,000 followers in a month on Twitter. I had a 10,000 follower day and\r\n\r\n\r\nNikolas Hulewsky (13:03.892)\r\nShe's a whiz.\r\n\r\n\r\nNikolas Hulewsky (13:09.598)\r\nThat's insane.\r\n\r\n\r\nClifton Sellers (13:09.966)\r\nAt that point, Nick, I realized that I loved writing and positioning, branding, all this stuff. So then this is what I tell people. You can, if you don't learn a skill, you will sell for others for the rest of your\r\n\r\n\r\nit will work for others for the rest of your life or anything. Right. And I'm a salesman by trade. Like I love sales. It's my favorite thing in the entire world. I love sales. I, it gives me energy. When most people hate it. I want to be on sales calls. It's all I want to do every day. And I, so I had the skill. I'm like, okay, I can write. can grow Twitter accounts. Boom. I don't, nobody knows who I am. So I started reaching out to other ghost writing agencies.\r\n\r\n\r\nThis is when those started, kind of coming up, personal brand management, all this stuff. And I said, Hey, I want to work for you. Hire me, hire me, hire me. And I was like, I just got to make some money. And this guy took a chance on me, hired me. and I started writing hundreds of long horn pieces of content per month for this other agency. And I finally started making money. was making hundreds.\r\n\r\n\r\nNikolas Hulewsky (14:21.332)\r\nHundreds and this is why you're working your full-time job, right?\r\n\r\n\r\nClifton Sellers (14:25.364)\r\nyeah, I didn't quit my full-time job until April 23.\r\n\r\n\r\nNikolas Hulewsky (14:30.474)\r\nSo I'm gonna back up just a little bit. So in January, you're like, honey, I don't think this is working.\r\n\r\n\r\nAnd at that point you said, I'm going to actually reach out to some people who are ahead of me that can give me some advice. I think that's an amazing framework. Have you always been like that? Or was that some really?\r\n\r\n\r\nClifton Sellers (14:49.144)\r\ndone it every time. Every time I couldn't make money, reached people. When I started writing for that guy, he couldn't keep up with how much money I wanted to make. He told me to start my own agency. He was ahead of me. He taught me how to start my own agency. When I started my own agency, I struggled with sales. I paid a guy 10K to teach me sales. When I hit sales, I started signing a bunch of people and then I struggled with operations.\r\n\r\n\r\nreached out to a guy, got help with operations, eventually brought on my CEO, Brett, who's been heading up operations for us for over two years. and then.\r\n\r\n\r\nNikolas Hulewsky (15:18.174)\r\nMm-hmm.\r\n\r\n\r\nClifton Sellers (15:28.94)\r\nwas my graduation from money Twitter. And this is what I tell people. It's like, if you want to be a real business, you have to be a real business. If you go to my website right now, there's nothing about it that says I'm on money Twitter. It looks like a reputable fortune 500, like partnered agency, right? Legacy builder.co you go to that website right now. You're like, man, this is a legit content agency.\r\n\r\n\r\nNikolas Hulewsky (15:49.438)\r\nWhat's the website?\r\n\r\n\r\nClifton Sellers (15:57.954)\r\nLike this is somebody I want to work with. Right. And I, and I did that. And so I started reaching out to real business owners. Right. I started saying like, Hey, what does that look like? Well, like how, how are you differentiating? And it actually is a really boring thing, man. It's like, well, I mean, cause in money Twitter, or when you're first starting out in business, especially these young guys, you get taught to sell these. The greatest offer.\r\n\r\n\r\nIt's like, I'm gonna grow your business in 30 days or you get your money back or I'm gonna come to your house and clean it for the rest of my life. And it's just insane, right? And that's how you had to start, because nobody knows. So you need a risk reversal. You need something to get people in. But one day I woke up and I said, whoa, wait, wait a second. I'm really good at this. I have nothing to prove to anybody. I should start acting like that.\r\n\r\n\r\nAnd so I went through an exercise with Scott, Scott bear at lunar studios. He built this website that she had pulled up right here. And we went through like, what's our unique value prop? What makes us a business? Why would 5 million, 10 million, a hundred million dollar businesses want to work with us? And we map that out. Another situation where I didn't know how to position myself. So I reached out to somebody who knew how to do that. And the day I launched this website, Nick.\r\n\r\n\r\nNikolas Hulewsky (17:11.53)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (17:22.708)\r\nDude.\r\n\r\n\r\nClifton Sellers (17:26.742)\r\nWe went from making like 20 to 30 within within a quarter. We were making a hundred K plus a month. Just from repositioning ourselves into this.\r\n\r\n\r\nNikolas Hulewsky (17:38.154)\r\nI mean, look at this sexy beast here. This is a good looking website, 300 clients served, 100,000 posts published, 50 million impressions. Here's our value prop. It's perfect. Actual results.\r\n\r\n\r\nClifton Sellers (17:40.213)\r\nYeah, I love this one.\r\n\r\n\r\nClifton Sellers (17:49.528)\r\nYeah. Value prop. You got, there, there's the CEO of mighty networks. Ben Billups, he's, he just launched this fast. then you got kind of the, what are you going to get when you work with us here? You get a full content team when you work with us. simple process. Cause so that's framing for the sales call right there. it's also like more.\r\n\r\n\r\nNikolas Hulewsky (17:57.496)\r\ndang. She's legit. Ben Billups is legit.\r\n\r\n\r\nNikolas Hulewsky (18:05.968)\r\nMm-hmm. Content strategies, writers.\r\n\r\n\r\nNikolas Hulewsky (18:15.38)\r\nYeah.\r\n\r\n\r\nClifton Sellers (18:18.84)\r\ntestimonials from people. That's me and Brett, little letter from us.\r\n\r\n\r\nNikolas Hulewsky (18:26.036)\r\nLook at these, look at these freaking, is any of this AI?\r\n\r\n\r\nClifton Sellers (18:29.934)\r\nDo you think that picture means AI?\r\n\r\n\r\nNikolas Hulewsky (18:32.402)\r\nIt's not. But Brett, Brett, I'm like, okay, it is.\r\n\r\n\r\nClifton Sellers (18:34.603)\r\nIt is.\r\n\r\n\r\nClifton Sellers (18:38.158)\r\nI worked with this guy that I think is called Headshot Pro or something, another Twitter story. So one night it was like 1130 at night and I wanted this like super clean AI picture of me. So I downloaded and I messaged the founder. I'm like, your product is not working. Like I do, this does not look like me. And he said, I will work with you for hours until this looks like you.\r\n\r\n\r\nAnd he literally went through like seven iterations with me until this thing spit out the perfect AI picture of me.\r\n\r\n\r\nNikolas Hulewsky (19:13.31)\r\nBecause he was, I mean, obviously you have distribution and he's like, this is a whale. I want to get a win for Clifton. Dude, I would say yours looks good. Yours looks really good. I mean, they both look good.\r\n\r\n\r\nClifton Sellers (19:16.77)\r\nYeah, he's like, I want to win for this guy, you know?\r\n\r\n\r\nClifton Sellers (19:24.982)\r\nIt's our colors. The green color is like my, have so many things in that green color, man. and then even the logo. So the logo is really cool. I think it's up at the top. Is that the logo? cause my old logo stunk it like this guy, poor guy. He made me like a free logo and it was like an L and a B. It kind of looked like a Luigi hat and,\r\n\r\n\r\nNikolas Hulewsky (19:36.298)\r\nYeah, I see right here.\r\n\r\n\r\nClifton Sellers (19:50.146)\r\nThey went through this and like this logo has like this amazing story of like, it's like a Sequoia tree and it's like growing and growing your legacy, growing your content. The L's kind of fit fit in there, caddy cornered at the far left. And even that logo, man, like the enterprise value of our business went up just from the logo, right? And people say that stuff doesn't matter, but it really does matter. It really does. Yeah.\r\n\r\n\r\nNikolas Hulewsky (19:58.282)\r\nIt does look like a tree.\r\n\r\n\r\nNikolas Hulewsky (20:03.433)\r\nYeah.\r\n\r\n\r\nYeah, it's a great story.\r\n\r\n\r\nNikolas Hulewsky (20:16.49)\r\nOf course it matters. Yeah, it all matters. It all matters. I love this idea that you talk about those, like reaching out to people who are a couple steps ahead of you. I think sometimes people are insecure or nervous or like, well, I don't really know what to say. How do you do it? I think it's a superpower. I'm similar to you where I'm like, I'll reach out to anybody and ask them a question. But lots of people aren't that way. How do you think about when you reach out to people, positioning?\r\n\r\n\r\nClifton Sellers (20:28.333)\r\nYeah.\r\n\r\n\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (20:45.865)\r\nyour ask.\r\n\r\n\r\nClifton Sellers (20:47.33)\r\nthink it's twofold. First, you have to be a person that people want to help. I'm a I'm a kind person by nature. I'm a connector by nature, right? Like, if you call me and you're like, I'm having this problem, I probably have like three people to connect you with, you know, but when I reach out to people, I'm very vulnerable, man. I'm like, Hey, I'm mad right now or I'm I'm frustrated because I'm stuck at\r\n\r\n\r\na 1.5 million run rate and I know you're at a 10 million run rate and you were probably just as frustrated as me when you were at a 1.5 million run rate and I offered to pay him. I'm like, can I pay you for 30 minutes to an hour of your time? Just to just to tell you what I'm doing and see if I can get any get get any level of unstuck from where I'm at right now. And most of time they're like, bro, you don't have to pay me or like I got I'm\r\n\r\n\r\nNikolas Hulewsky (21:18.73)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (21:44.116)\r\nYeah, most the time people are cool.\r\n\r\n\r\nClifton Sellers (21:45.612)\r\nYeah. And then sometimes they say like, yeah, here's my meetup link or whatever. Right. and I pay people, I pay coaches. I have a professionalization budget. spend like 10 % of our income on, on people to help me scale faster.\r\n\r\n\r\nNikolas Hulewsky (22:01.886)\r\nThat's super interesting. When did you start doing that?\r\n\r\n\r\nClifton Sellers (22:04.696)\r\nDay one.\r\n\r\n\r\nNikolas Hulewsky (22:05.962)\r\nWhat does that mean, day one? Like, when you got married, day one?\r\n\r\n\r\nClifton Sellers (22:07.678)\r\nWhen I started making money, it was actually higher when I first started. I reinvested most of my first two years of income back into people to tell me how to make more.\r\n\r\n\r\nNikolas Hulewsky (22:17.842)\r\nDude, this is fascinating because I used to think that coaches, consultants, less consultants, but coaches in particular were like, scam. What do need a coach for? I don't feel that way anymore. I don't feel that way anymore, but it was hard for me to kind of get over. And honestly, it's still hard for my wife. She'd be like, wait, why did pay this guy 10 grand? I'm like, you have no idea. He helped me unlock it. And she's like, isn't that obvious? Anyways.\r\n\r\n\r\nClifton Sellers (22:29.326)\r\nYeah.\r\n\r\n\r\nThat's good.\r\n\r\n\r\nClifton Sellers (22:41.144)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (22:47.06)\r\nHow did you, have you always been that way where you're like, yeah, I'll spend money on paying someone to help me get to where I need to be? Or was that a shift in your mind that you had to make?\r\n\r\n\r\nClifton Sellers (22:55.446)\r\nIt was a shift because I was scared to spend money for most of my life. You know, when you grow up the way I did and like, I mean, we were like, everybody's a scam. Everybody's trying to rip you off. Watch your back, save your money. but there was an unlock. I had some, I had to go through some mental coaching, which is funny, right? Like I paid coaching to get over my money problem. I mean, I did. mean, like I was\r\n\r\n\r\nNikolas Hulewsky (23:00.746)\r\nThat's true.\r\n\r\n\r\nNikolas Hulewsky (23:20.292)\r\nHahaha\r\n\r\n\r\nClifton Sellers (23:23.136)\r\nI had past trauma around money and I noticed it.\r\n\r\n\r\nNikolas Hulewsky (23:25.758)\r\nThat was either the best salesman of all time or you were incredibly self-aware. That's hilarious,\r\n\r\n\r\nClifton Sellers (23:33.154)\r\nWell, we all have a rock bottom with every problem we have. just, it just takes some people. Some people are more stubborn than others. Right. And so it was that first time, I think it was the first time I handed somebody money and I was, and it was like two grand, which to me is like 200 grand now. Right. Like at that point, it's like, here's two grand. And a month later I was making 10 grand and I was like, okay, here's 10 grand. a month later I'm making 30 grand.\r\n\r\n\r\nNikolas Hulewsky (23:52.531)\r\nRight.\r\n\r\n\r\nClifton Sellers (24:03.079)\r\nOkay, and this is the problem with coaches and all this stuff right and the framing around it First of all, they're not gonna they're not gonna save you your best bet with coaches is You were gonna win anyway They're just gonna help you win faster Right. That's what I everybody I hand money. I tell them I'm like, I'm good. I was gonna do this anyway I'm handing you this money because I want to do it faster. That's it\r\n\r\n\r\nNikolas Hulewsky (24:22.686)\r\nYeah.\r\n\r\n\r\nClifton Sellers (24:31.338)\r\nAnd so that's why a lot of the coaching industry has such a bad rap because if you weren't going to win anyway, nine times out of 10, a coach probably isn't going to fix that. You have to have that innate ability in you.\r\n\r\n\r\nNikolas Hulewsky (24:42.9)\r\nDude, I really agree with you. I don't know what it is, but there comes a certain point where you realize that coaching, coaching is the unlock. And then you start seeing it everywhere. Tom Brady, the TB12 method. Like there's a dude he had that was his coach that figured out that method. Tiger Woods has always had a mental coach. Michael Jordan, LeBron James, any of these like Kobe Bryant, dude, any of these top tier athletes.\r\n\r\n\r\nClifton Sellers (24:53.25)\r\nYeah, it's everywhere.\r\n\r\n\r\nClifton Sellers (25:06.798)\r\nKobe. Yeah, I love Kobe.\r\n\r\n\r\nNikolas Hulewsky (25:12.328)\r\nhave had not just coaches on the X's and O's, like here's how to play basketball, like mental coaches, strength and conditioning coaches, specific coach. Like I can't remember who the athlete was. You might know this was a basketball story where this guy was having a hard time figuring out how to shoot. And so he went and got not somebody who knows how to shoot. He wouldn't got some, like a cycle therapist to help him get over whatever the hump was that he was working on. And he did. And you know, he exploded the next season. I can't remember who it was, but\r\n\r\n\r\nClifton Sellers (25:40.238)\r\nThat's just, that's it, man. It's, most of your problems, you know what to do. There's probably something inside of you keeping you from doing it. I mean, my past trauma around money was keeping me, under a million dollars in revenue because I was scared to hire people and I was scared to hire people because I was scared to waste money.\r\n\r\n\r\nNikolas Hulewsky (25:51.551)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (26:01.438)\r\nSay more about that. I'm curious. So you were stuck under a million dollars because what does that mean? You were scared to hire people.\r\n\r\n\r\nClifton Sellers (26:06.326)\r\nI was doing everything myself, right? So I was writing the tweets, I was publishing the content, I was doing all this stuff. I had never run a business before and everybody was like, well, you for my clients. All that stuff. Yeah. I've held, I've held every position in our company. I've held every position.\r\n\r\n\r\nNikolas Hulewsky (26:16.5)\r\nfor your clients, your ghost writing, you were doing all that stuff.\r\n\r\n\r\nNikolas Hulewsky (26:25.5)\r\nWhy? So you got to a point where you were doing it. Why were you holding onto it? What was it that you were scared?\r\n\r\n\r\nClifton Sellers (26:32.384)\r\nI think I was scared of, it going to work? Is this a flash in the pan business? In a couple of years, am I, am I going to get replaced? Like there was all these like unknown unknowns, right? And I paid coaches to basically, first of all, I just had PTSD around money and trauma and I had to get over that. Then I had to get over the fact that I can't control any of this.\r\n\r\n\r\nI can't control. mean, AI could kill us all tomorrow. mean, I don't know, you know, like I can't control that Sam Sam's over there. Sam Altman's over there, like planning world destruction and AGI is going to like take our homes by December, 2025. Like, I don't know. Like there's all these unknown unknowns, but eventually I woke up and I said, there's people out there. Everybody's running a business. There's people.\r\n\r\n\r\nNikolas Hulewsky (27:17.809)\r\nHahaha!\r\n\r\n\r\nClifton Sellers (27:30.126)\r\nMy background's in fundraising. I met with people every day that made millions of dollars running a business and exited or were still running a business. And it kind of went into that. Why not? If they can do it, I can do it. Why not me? What am I doing? Like you're competent, you're driven. And I kind of just had to get out of my own way and saying like, if you allow yourself to sit in the, these are all the ways that society can kill what I'm building. You are not going to build anything of significance.\r\n\r\n\r\nNikolas Hulewsky (28:00.49)\r\nLet me ask you a question. I've had the same exact issue. So I mean, I'm one of nine kids. I grew up exceptionally poor. And I've gotten over it in some businesses, but like even today, I have a hard time making the investment because it is an investment, right? Like, it's not a one-to-one ratio. If I put the $10 in, I'm going to get the $20 back because I'm always worried. Well, is the demand really there? Like, well, is the demand really there for, you know, whatever?\r\n\r\n\r\nClifton Sellers (28:26.232)\r\nBye.\r\n\r\n\r\nNikolas Hulewsky (28:29.866)\r\nyou're selling. How did you get over that? Did you know the demand was there or was it truly like, I was just afraid to spend money, period, and I had to get over it?\r\n\r\n\r\nClifton Sellers (28:40.758)\r\nI think it was both. The money thing is the money thing. I, early on in my career, I was told to niche down. I was told to like only be a content agency for SAS companies. And I thought intuitively, I thought that was the dumbest thing ever. I was like, why would you hamstring? I was like, if your process is good enough from a content standpoint, you should be able to write for anybody.\r\n\r\n\r\nNikolas Hulewsky (28:42.378)\r\nYeah.\r\n\r\n\r\nClifton Sellers (29:09.602)\r\nthat fits certain criteria from a money standpoint, from a time standpoint and from a can they get benefit from it? So I didn't niche down. Now it's funny. Now I'm like, we need to niche down a little bit. now we need, now we're at a point where we're safe. when you're first, when you're scaling, you, you need the biggest total addressable market as possible. And, and you just need revenue and you just need a runway.\r\n\r\n\r\nNikolas Hulewsky (29:34.324)\r\nYou just need revenue.\r\n\r\n\r\nClifton Sellers (29:39.21)\r\nAnd you don't need to act like you're a $10 million business when you got $5,000 in your business bank account and an Amex card and a prayer. So I just kept it wide. I knew there was demand. I knew that because I had benefited from it. And I still say that today. I get on a call. They're like, how do you know this works? And I raise my hand.\r\n\r\n\r\nI built a multi-million dollar business on the back of personal branding and organic content flowing into for lead generation. I mean, I know it works.\r\n\r\n\r\nNikolas Hulewsky (30:15.252)\r\nSo for you, was like, I know it works. You didn't necessarily have a pipeline of people that you couldn't get to. It was the unlock of, if I bring somebody on to do the execution, it'll free me up to do what I'm best at, which is sales. Go out, close.\r\n\r\n\r\nClifton Sellers (30:28.248)\r\nYep. You're on a genius.\r\n\r\n\r\nDon't a genius that Brett Eric looked at me a year ago. And he said, my goal in three months is for you to not be in clients accounts anymore. And I said, Oh man, I don't, that would stress me out. He was like, I don't think it will. He's like, well, let me try. And he did it. And our clients are better for it. They're better for it. They get a way better experience when our team is pouring over their content and their strategy.\r\n\r\n\r\nAnd then I come in for like higher level strategy or execution, or I can actually like work with the clients on some mental blockers that content's creating for them. And I can sell and I can do podcasts like this. And Brett is a way better operator than I am. Like he was put on this planet to be an operator. I was put on this planet to vision cast, sell all this stuff. like\r\n\r\n\r\nThe greatest reason that we've scaled to our point is we got people that were very competent and put them and incentivize them in a way to where they would have massive upside and they actually enjoyed coming to work here.\r\n\r\n\r\nNikolas Hulewsky (31:41.994)\r\nYou know, many things in life are a flywheel, both positive and negative. Like if I make a bad hire and it doesn't work out, that reinforces the, I shouldn't have made that hire. That was stupid. And if I make a good hire and I did all the things necessary for it to be successful, then success begets success and I hire more people and I'm more confident, right? Like both of those kind of compound on themselves. What did you do right in order to free yourself up from all of the delivery?\r\n\r\n\r\nand hire that person. Well, I'm just saying there's a lot of entrepreneurs who are listening right now. Like they're not running content agencies, but they're in that same spot, right? They're like, well, I'm doing all the fulfillment. I'm the pressure washing guy for my pressure washing company or I'm the digital agency guy for my digital agency, whatever. They want to, they need to know how do they make that first hire and make sure that it's successful, not, not unsuccessful. And then they're always stuck at the ceiling.\r\n\r\n\r\nClifton Sellers (32:11.47)\r\nWell, I've made some bad hires.\r\n\r\n\r\nClifton Sellers (32:36.888)\r\nYeah, I think for I'll walk through a process, a framework that I use. Sales was always the last thing I was ever going to delegate. I'm about a year out from that. I think people try to delegate what they're good at too soon. So you almost have to sit down and take inventory and you're say, okay, what, what are things that I'm doing just because they have to be done?\r\n\r\n\r\nAnd what are things that I do that I'm enjoying it and it's helping me grow my business. And I kind of went through that inventory and I realized like I'm, I'm, I'm not an operations guy. When I have, when I'm in spreadsheets or a notion or like tracking things, like I get really bored really easily. I\r\n\r\n\r\nNikolas Hulewsky (33:25.066)\r\nHow did you realize that? Were you coached to that? Was it like, hey Clifton, sit down and write all of your tasks and then I... You did, okay.\r\n\r\n\r\nClifton Sellers (33:30.638)\r\nI tracked it by hour. had an Excel spreadsheet up and it's like, do everything, like write down everything you do. Okay. And I wrote down everything. And then I'm like, then they're like, okay, what do you not want to do? Like, what did you hate doing? And I was like, I hated doing all of these things. And they're like, well, you should hire somebody.\r\n\r\n\r\nNikolas Hulewsky (33:50.1)\r\nDude, that was the best. When I hired a coach, I was the same as you. was like, here's $3,000. And I was like, I had enough money for it, but it still felt like $300,000 at the time. And that one exercise alone, write out everything you do. Do you enjoy it? Do you not? Is it your zone of genius? Is it not? Are you in flow? Are you not? And once you're looking at it on paper and you're like, it's like, I'm an idiot. How did I not realize this sooner? Almost, but you need that.\r\n\r\n\r\nClifton Sellers (33:53.206)\r\nIt's so simple. So sweet, baby.\r\n\r\n\r\nClifton Sellers (34:06.252)\r\nWe still do that.\r\n\r\n\r\nNikolas Hulewsky (34:19.636)\r\nperson externally to at least like guide you through the process of it. And that's why I like was trying to drill into specifics because I think that exercise is so important,\r\n\r\n\r\nClifton Sellers (34:28.834)\r\nThere's a step though, Nick, that a lot of people miss. It's like, it's not enough to hand off things you hate. You have to hand them off to people that love them. And so, and then you have to hand them off so they understand what winning looks like. Cause we hold so much knowledge in ourselves as solo operators of a business that when you hand things off without what does winning look like? What does success look like? What does done look like?\r\n\r\n\r\nNikolas Hulewsky (34:50.474)\r\nYeah, I agree.\r\n\r\n\r\nClifton Sellers (34:58.946)\r\nThat's when you make bad hires. I've slowed down in how I hire people. Two things. One is what I just kind of detailed is like, I need to understand how this is done. What does winning look like before I hire a person? Another thing that really lifted my business is over a year ago, we went through a core value exercise and I did this by myself. I bought a book. It's like a pink book. I don't even, I think I have it over there.\r\n\r\n\r\nbut it was like the core value equation or something. And so I'm reading it and it's like, and it's so simple, but it's like, so many people try to hire people based on competency and then fit them into their core values. Okay. Well, that's not right. You should hire people that match your core values and are competent. And then they're actually going to fit in. like our number one core value is unreasonable hospitality. Okay.\r\n\r\n\r\nNikolas Hulewsky (35:42.89)\r\n100 %\r\n\r\n\r\nNikolas Hulewsky (35:53.16)\r\nAhem.\r\n\r\n\r\nClifton Sellers (35:58.402)\r\nAnd I'll tell you a story real quick. I had this guy early on work with me and every time a client made a request that was you could do in a minute, like or 20 minutes. And it was reasonable. Maybe it didn't fit the scope of work. I was like, yeah, let's do it. Cause I want to, I want them to feel like we're serving.\r\n\r\n\r\nWell, it's not in our scope of work. It's not this like we're doing too much. Like there was always this tension between us. Then I met Brett and Brett and I without even having core values had the same core values, right? We didn't even have them written down at the time. We were just, we just matched really well as partners. And then when I start, when we were working on our core values together, it was like, Hey,\r\n\r\n\r\nUnreasonable hospitality doesn't mean getting ran over, but it means how do we create special moments in a client journey? Um, another one of our core values is say the thing. I hate working at companies that are where there's Pratt. I hate working at companies in general, but period full stop, but I also hate where there's passive aggressiveness, where you go into Jenny's office and accounting and she's talking about Sally over in, uh, sales and there's all this.\r\n\r\n\r\nNikolas Hulewsky (37:02.09)\r\nPeriod.\r\n\r\n\r\nClifton Sellers (37:17.61)\r\nAnd so we just say the thing and that's internally and externally. If we think a client is wrong, we're not mean or demonstrative, but we're like, Hey, we need to tell you this. Like we need to say this thing to you. When I'm mad at an employee's performance, I'd call them and I said, Hey, this is going to be a pretty frank conversation. I want you to win and you need to know how I feel. And I'm going to tell you how I feel. And it's just relentless execution.\r\n\r\n\r\nIf people don't like to work, they should not work at Legacy Builder. They shouldn't. They're going to be miserable. Because we work. We like to work.\r\n\r\n\r\nNikolas Hulewsky (37:55.668)\r\nWell, dude, one of the things I think that you said that resonates with me is you set up a filtering mechanism. And sometimes people will listen to this stuff and be like, it must be nice to sit around and faff about and decide, what's our core values? But the truth is, if you want to scale, you have to hire people. And if you want to hire people at scale, you have to have a filtering mechanism. And if you want to have a filtering mechanism, you have to have very clear core values.\r\n\r\n\r\nClifton Sellers (38:10.904)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (38:25.66)\r\nand shared values amongst the team. And I know that it's hard for many people, but it's one of my favorite exercises to do with the company. Because when you're getting to that point, it's like, this is exciting. There's something here. There's Mojo. Cool. Let's formalize this. I'll bring teams together. And again, this is my favorite exercise. I'll be like, all right, write down the names of three people that if you could choose. They don't have to be in the company. They could be anywhere. But in the company is preferable. That if you teamed up with them, you could take over any industry.\r\n\r\n\r\nOkay, cool. So they write down those names. All right now write down what attributes about them you like. that's interesting So they'll write down the attributes that they like cool now Let's write all those attributes up around the wall and so everybody's writing up their attributes around the wall and pretty quickly we start to see Where the commonality in the overlap is like, whoa Say what you mean? What like three different people have said that five times, you know what I mean?\r\n\r\n\r\nThere's something there. I don't know what it is yet, but there's something there. And then you start sort of massaging this with your team that you've been building along the way. I think formalizing, codifying your core values is an underrated exercise that most businesses don't put enough emphasis on.\r\n\r\n\r\nClifton Sellers (39:23.255)\r\nRight.\r\n\r\n\r\nClifton Sellers (39:40.142)\r\nYeah, it's just, it's, had a client that has scaled multiple companies, sold multiple companies. And he said every, and it goes to your audience of under a million.\r\n\r\n\r\nClifton Sellers (39:55.23)\r\nEvery company goes through a professionalization of services, like a professionalization period. And that's when you like all the stuff you've been putting off, like standard operating procedures, databases, CRM core values, hiring practices. Legal. We only talk about legal enough, you know, like when I was.\r\n\r\n\r\nNikolas Hulewsky (40:15.018)\r\nMm-hmm.\r\n\r\n\r\nHahaha!\r\n\r\n\r\nClifton Sellers (40:19.394)\r\nWhen I was gunslinging out there in 2022 and 2023, I didn't think I was going to get sued, you know, I haven't been sued, but now I'm like, man. Yeah. I need a knock on wood. it'd be okay. I figure it out, but like, how do we, what are, what are our blind spots? How do we protect ourselves? Do we have insurance? Do we like, do we have terms of service? Do we have agreements? Do like, there's all these things that like,\r\n\r\n\r\nNikolas Hulewsky (40:31.176)\r\nYeah, I'm knocking on glass.\r\n\r\n\r\nClifton Sellers (40:48.012)\r\nYou just don't know as a first time entrepreneur and you can either do it now or you can learn the lesson the hard way when you're in the middle of a firefight. So there's a lot, man. There's a lot that I've gone through.\r\n\r\n\r\nNikolas Hulewsky (40:51.721)\r\nYeah, because you-\r\n\r\n\r\nNikolas Hulewsky (41:00.446)\r\nBut when you're, when you're gunslinging, all that stuff doesn't really matter. Like when you're under a million dollars, you're just like trying to figure it out. Once there's like a real business, once it was like, there's some real value here, then it becomes incredibly important. Just because it didn't matter before, doesn't mean it's not going to ever matter. And that's where I see a lot of people make mistakes is like, they never professionalize. And so they always get capped at that level that they were. If you want to get to the next level, you've got to professionalize systematize what, whatever.\r\n\r\n\r\nClifton Sellers (41:04.398)\r\nNo.\r\n\r\n\r\nNikolas Hulewsky (41:28.746)\r\nhas gotten you to this point because otherwise you're not going to continue to grow. Dude, was amazing. right, legacybuilder.co. We didn't even get to talk about your cool SaaS product that you have for LinkedIn. But where's the best place for people to come reach you?\r\n\r\n\r\nClifton Sellers (41:32.812)\r\nNo you can't.\r\n\r\n\r\nClifton Sellers (41:47.586)\r\nYeah. So I'm clipped and sellers on Twitter and LinkedIn. I have a newsletter that we can attach to this, that people can follow me control alt create. just went through a rebrand there. yeah, I like those. My Instagram accounts gone right now. They don't like me for some reason. I don't know what happened there. it tells me to put in a code, but they won't text me the, I don't know, man. It's, it's\r\n\r\n\r\nNikolas Hulewsky (42:01.086)\r\nGreat name.\r\n\r\n\r\nNikolas Hulewsky (42:09.63)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (42:15.602)\r\nSomething's going on.\r\n\r\n\r\nClifton Sellers (42:16.646)\r\nbut you follow me on those socials, follow me on my newsletter. our SAS is engaged now.co it's a automated organic engagement tool that matches you with other founders and people building a business in the B2B space. you just exchange comments with each other on LinkedIn and it's, powerful tool for expanding your reach and expanding pipeline opportunity that came on the back of people needing more engagement. I mean, it's just, we're going to roll it out.\r\n\r\n\r\nX and some other platforms as well. but yeah, man, I mean, you find if you Google Clifton sellers right now, all those things I just mentioned are going to pop up.\r\n\r\n\r\nNikolas Hulewsky (42:51.39)\r\nDude, you're doing...\r\n\r\n\r\nNikolas Hulewsky (42:57.898)\r\nAll right, I'm gonna go right now. Thank you, thank you for your time, this was awesome. I hope people come reach out to you and we'll talk again soon.\r\n\r\n\r\nClifton Sellers (43:06.318)\r\nThat's awesome, Nick. Thank you so much, man. You're incredible.",
  "metadata": {
    "duration": "",
    "date": "2025-06-27",
    "platform_source": "Google Drive"
  }
}