{
  "episode_number": "127",
  "episode_title": "I Built a $250K Tool in 90 Minutes (NO CODING!) with Chris Koerner",
  "guest_name": "Chris Koerner",
  "business_name": "",
  "transcript": "﻿Chris Koerner (47:38.126)\r\nMmm. Mm-hmm. Mm-hmm.\r\n\r\n\r\nMm-hmm. That's a good idea.\r\n\r\n\r\nI'll try it on my own account first. Assuming I don't think it will work, dude, that's a perfect lead in. So one thing that I'm going to do here soon is there's a bunch of, you know, AI enabled app builders, cursor, replete, bolt.\r\n\r\n\r\nNikolas Hulewsky (47:49.894)\r\nYeah, yeah,\r\n\r\n\r\nNikolas Hulewsky (48:02.558)\r\nIs this, sorry, is this episode two right now? Okay, cool, go for it.\r\n\r\n\r\nChris Koerner (48:06.51)\r\nI think I think we could lead into it with this. Yeah. Cursor, replet, bolt. There's a bunch of them. I can't even remember them all. I want this is what I'm to do. I know I can have six operator tabs open at once. So I'm going to take six cursors and replets of the world and take one idea. Like I want you to make me a calorie counter app, a web app that counts calories where I can upload a picture of food and it will tell me how many calories. That's a thing.\r\n\r\n\r\nI know AI can do this. There's a bunch of apps that do that. Okay. And I'm going to give this, I'm going to tell it to give the same prompt to all six at the same time run concurrently. And I'm going to tell it to work through all the bugs and see which one can build this app for me without any intervention for me whatsoever.\r\n\r\n\r\nNikolas Hulewsky (48:37.085)\r\nYeah.\r\n\r\n\r\nChris Koerner (48:55.672)\r\nThat make sense?\r\n\r\n\r\nNikolas Hulewsky (48:55.688)\r\nDude, it does make sense. The only thing that I'm like thinking of is right now with operator, it's asynchronous. So like it's not, you can't do each function at the same time. It's like a human, right? Like they've got to go individually one by one. So are you saying it would go to Replet, tell Replet, do X, Z things. And then while Replets running in the background, it would go to the next tab and say, okay. So I'm.\r\n\r\n\r\nChris Koerner (49:21.344)\r\nNo, no, I'm saying I've, I've\r\n\r\n\r\nNikolas Hulewsky (49:25.138)\r\nI'm what they call an idiot. Can you explain it to me?\r\n\r\n\r\nChris Koerner (49:30.882)\r\nYes, I'm saying I've already tested this and you can have six operators running in six different tabs at the same time. So I'm going to take one prompt to operator and it's going to say, you know, go to cursor and here's the prompt, build this app. And then I'll just paste that same prompt and swap out cursor with bolt with replet with all the others and have it just go all six at once. Does that make sense? Yeah. And then see which one\r\n\r\n\r\nNikolas Hulewsky (49:38.78)\r\nNikolas Hulewsky (49:51.934)\r\nAnd then compare them. Yeah.\r\n\r\n\r\nChris Koerner (49:59.298)\r\ndoes the best, which one needs the least amount of intervention to build that app.\r\n\r\n\r\nNikolas Hulewsky (50:03.972)\r\ninteresting.\r\n\r\n\r\nChris Koerner (50:06.35)\r\nMm hmm. Because then I learned, then I learned multiple things, then I learned which of those six platforms I like the best. And I learned which of those six platforms works the nicest with operator. You know, because if you if you haven't used a replete, like you get like it is you're babysitting it the whole time, you don't just say build an app and you build it builds an app, it breaks and it breaks and then it fixes something and then it goes back and breaks it again. But like you'll get there, you will get there. But how well does operator\r\n\r\n\r\nNikolas Hulewsky (50:07.836)\r\nWhat happens?\r\n\r\n\r\nChris Koerner (50:35.98)\r\nMassage it.\r\n\r\n\r\nNikolas Hulewsky (50:37.342)\r\nDude, I know we're getting ahead of ourselves here. How cool would it be though? It's like you that, you build the six. They're all open to different tabs, it produces them. And then you have six more tabs, or same six tabs. Cool, now you have the app. It's the same prompt. I want you to execute these tasks on this app and tell me about your user experience. Or like give me how long it took to do X, Y, Z things. So then you're getting...\r\n\r\n\r\nChris Koerner (51:00.556)\r\nMmm, mm-hmm.\r\n\r\n\r\nChris Koerner (51:05.208)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (51:05.947)\r\nqualitative analysis as well from operator to tell you which one of these apps performs better with speed, with quality, responsiveness, UI, like whatever you want to test it on. And then you'll have a data set that you can look at and compare. That's not just you going and using it and saying like, which one do I like the best, but like operator giving you actual data to tell you which one's the best. That would be super interesting.\r\n\r\n\r\nChris Koerner (51:11.939)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (51:26.658)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (51:30.808)\r\nThat's pretty cool. That's pretty cool.\r\n\r\n\r\nNikolas Hulewsky (51:34.012)\r\nMeta bro. Am I on Iowaska right now? my gosh, It's freaking meta.\r\n\r\n\r\nChris Koerner (51:39.502)\r\nNikolas Hulewsky (51:41.966)\r\nso we're going to end this episode by you telling us an amazing story before we get to that story. No, this is episode two. This is episode two. Don't worry. I'm just, I'm just thinking we're going to spend the majority of the time talking about your story. before we get to that, I had an idea this week. I wrote it down to myself and I want to just, I want to just tell it to you to get your opinion on it. I've been thinking a lot about this stuff. both have.\r\n\r\n\r\nChris Koerner (51:48.174)\r\nI thought we had already. Wait, what?\r\n\r\n\r\nChris Koerner (51:54.444)\r\nOkay.\r\n\r\n\r\nChris Koerner (52:04.686)\r\nCough\r\n\r\n\r\nNikolas Hulewsky (52:11.79)\r\nAnd in particular, it's like, how do I use agents? How do I prepare for agents? Some people will prepare, some people won't prepare. And I wrote this post. I haven't posted it yet, but I wrote this down and I want to just read it to you. Hopefully it's not too boring and then get your opinion ready. So right now people are using AI to essentially make better decisions. They're using it as a teacher, general counsel, a sounding board, a mentor.\r\n\r\n\r\nit's effectively a better version of Google. But soon it's going to change. It's going to change from being a tool to an extension of you, an employee or representative, an agent making decisions on your behalf, right? We know that. So anyways, I've been thinking a lot about how you get ready for it. And I think implementing an agent is going to look a lot like onboarding an employee. You're going to need SOPs. And so an SOP, standard operating procedure, how does this work, right? What do you do? What is the function? What is the process, et cetera?\r\n\r\n\r\nChris Koerner (53:09.731)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (53:10.216)\r\nYou're going to need an orientation process. You're going to need onboarding and you're going to need continued continuing oversight. So like in my mind, the best way to prepare for these agents is to create the onboarding as if it was a human employee. Like don't think of it as, I got an agent now. Like just do your thing.\r\n\r\n\r\nChris Koerner (53:29.344)\r\nMm-hmm. Because that's how they're going to be trained. They're going to be trained on like SOPs from the last 10, 20 years, right? That's the language it speaks.\r\n\r\n\r\nNikolas Hulewsky (53:37.042)\r\nYeah, so if you exactly, and if you have employees now or you have processes now, document them because that's how you're gonna get the agent up to speed. think of it as a human employee that's going to be taking a function. It's not just gonna know like, yes, it's very smart, but you could take the smartest person in the world, plop them into a healthcare company in the billing department and be like, all right, bill for me now. They're not gonna know what to do.\r\n\r\n\r\nChris Koerner (53:53.571)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (54:03.544)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (54:04.36)\r\nThey don't know what system to go to, what the EMR is, how to log in, who the provider is, what they pay, what they bill, how to apply it. Like they don't know, they have to be trained on that stuff. I think this framework for me was a blightful moment. Treat these processes as SOPs, document them, and then you're going to treat an agent just the same way you would treat a new employee. You're going to have to train them. So have these things ready. What do you think?\r\n\r\n\r\nChris Koerner (54:31.15)\r\nAbsolutely, 100 % agree. Hard agree. Give me 14 of them right now.\r\n\r\n\r\nNikolas Hulewsky (54:32.35)\r\nThat makes sense, right?\r\n\r\n\r\nNikolas Hulewsky (54:36.253)\r\nYou\r\n\r\n\r\nWell, and what's fun is like you and I have been doing that, right? We've been creating our custom, our own custom GPTs. We have been creating our own SOPs. Like we're getting to the point now where it's like, we understand it's not a set it and forget it type of thing. We have to train the system, the LLM on what it's supposed to do. So like, I think it just makes natural sense to us now, but for most people it's not. And I think they need to reframe, this isn't just a computer that just figures it out. It's a new employee, train the employee.\r\n\r\n\r\nChris Koerner (54:40.398)\r\nAhem.\r\n\r\n\r\nChris Koerner (54:53.474)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (55:06.52)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (55:08.656)\r\nAnd like you said, when we're using operator right now, it's like, got to double check it. You got to try to break it. Did it actually do what you said it was going to do? Like you've got to do oversight. You've got to see how it's performing. It's not just, cool, it's going to sit there and be perfect forever. You're going to have to still oversee it in some capacity.\r\n\r\n\r\nChris Koerner (55:19.01)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (55:24.588)\r\nYeah, dude, I've got another use case that I meant to talk about for Replet, something that I did the other day. You ready? So we have a mutual friend. I'm not going to name him to protect his identity. Banana. Edit this out, Muhammad. His name is not, Stephen Hale. Okay. Banana. All right.\r\n\r\n\r\nNikolas Hulewsky (55:28.606)\r\nOkay. Okay, yeah.\r\n\r\n\r\nNikolas Hulewsky (55:36.158)\r\nBrian.\r\n\r\n\r\nNikolas Hulewsky (55:41.958)\r\nokay. Yeah. That's already. That's like, that's where my mind went anyways. Yeah.\r\n\r\n\r\nChris Koerner (55:46.56)\r\nOkay, yeah. So we went over there to watch the Super Bowl. So we're sitting and he says, Hey, I want you to show me something on replica, bring your MacBook. So I bring my MacBook, we're sitting down and watching the Super Bowl. Not really good game anyway, right? What?\r\n\r\n\r\nNikolas Hulewsky (55:59.044)\r\nIt's like the king inviting the court just to like, entertain me, show me something cool. So funny.\r\n\r\n\r\nChris Koerner (56:04.012)\r\nYes, that was it. That was it. So, so he has a professional services businesses and he has a professional service business and he helps companies that are acquiring other companies. Okay.\r\n\r\n\r\nHe had 4.4 gigabytes of financial data from one of his customers, mostly spreadsheets, 1.4 million rows of spreadsheet data, financial data, okay? And it was in Tableau, it's a lot. Part of it was in Tableau, it's in Excel, it's all over the place. And he wants to ask questions to this data. So we talked about GPT for Sheets on previous episodes where you can plug a formula into a sheet, drag it down, that's cool. But what do you do with 4.4 gigabytes of spreadsheets, all for one company, all financial data?\r\n\r\n\r\nNikolas Hulewsky (56:31.446)\r\nmy-\r\n\r\n\r\nChris Koerner (56:49.962)\r\na company with multiple subsidiaries, lots of stuff going on. How can you just say like, which of my subsidiaries had the highest profit margin in July 2022? How can you find that with one prompt? Right? So I said, he wanted me to build that. And he says, Chris, if you can build this, this company is about to go to market. I think they're going to sell for 14 times EBITDA. I think that if they are, if they have this tool, they are AI enabled and they'll be able to sell for 14 and a half times EBITDA.\r\n\r\n\r\nNikolas Hulewsky (56:52.627)\r\nYeah.\r\n\r\n\r\nChris Koerner (57:19.692)\r\nwhich represents seven figures of additional value created, which means I can charge them for this tool, 250 grand a year. Okay. So I'm like, hey, you shouldn't have told me this, cause that means I'm going to charge you about 200 grand a year for this, but.\r\n\r\n\r\nNikolas Hulewsky (57:22.312)\r\nYeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (57:35.216)\r\nHe like like the second he said, Chris, if you can build me this, you shut off and you just started building by the time he was done with that sentence because there's so many qualifiers. You're like, this thing just turned around the MacBook. this.\r\n\r\n\r\nChris Koerner (57:41.592)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (57:47.02)\r\nBasically, yes. So I go to replet and I type in the I'm like, this is what I want. I got four more gigabytes. So it gives me an interface. Okay, with like an upload button for spreadsheets. And I'm like, okay, but these spreadsheets are in box, which is like Dropbox, right? They're on the cloud. It was this fast. I said, Can you put like, I just want to put in a box link. Boom, it added another field for just uploading a box link. Interesting. Okay, so then I just start testing it doesn't work.\r\n\r\n\r\nIt keeps breaking, keeps breaking. It's not searching. I'll upload the data. It recognizes the data. It shows me load all the rows, but then it's only pulling from a sample size of the rows. So it's not answering my question. So then I take a random spreadsheet for my computer that has 14,000 rows. I upload that and I say, what's on row 1032. And it doesn't give it to me, but Replet tells me it's only looking at the first 14 rows. So then I have Replet fix it. So it searches all the rows. And then I ask it the same prompt.\r\n\r\n\r\nNikolas Hulewsky (58:28.796)\r\nRight.\r\n\r\n\r\nChris Koerner (58:46.094)\r\nAnd it works. It gives me the email address that's in that exact cell. So then I say, what percentage of the cells in column G are this value? And it breaks. It doesn't work. It doesn't work. And then it works. It tells me 0.13%. Yeah, I just kept getting there and I'm not doing any coding. I'm just, this is just English language, basic reasoning. Okay. And then I go to the spreadsheet and I crunch, I start a pivot table, 0.13%. It's exactly right.\r\n\r\n\r\nNikolas Hulewsky (59:00.126)\r\nBecause you iterated to it.\r\n\r\n\r\nChris Koerner (59:15.694)\r\nSo then by the time I left his house for the Superbowl, I was fiddling with it for like an hour and a half. It was uploading all 4.4 gigabytes of data and answering questions about this spreadsheet. Something that adds seven figures of value to his customer, something that he can charge 250 grand a year for a tool that I built with software that costs $20 a month. What are we doing? I don't, who won? Was it the Green Bay Packers?\r\n\r\n\r\nNikolas Hulewsky (59:37.724)\r\nYou don't even know who won the game because you know why Chris, you know why? Because you won the game alive bro. I'm sorry. I'm sorry. This is literally the Nick Huber tweet except for real. I'm sorry. You guys are watching the game. I just built a tool that made me seven figures in an hour and half. Bye. I'm out of here.\r\n\r\n\r\nChris Koerner (59:47.832)\r\nGo full Huber, full Huber.\r\n\r\n\r\nChris Koerner (59:54.602)\r\nI actually was.\r\n\r\n\r\nChris Koerner (01:00:01.464)\r\nbecause I actually was doing those things, but I was also watching the game. You could do both. You can have both. Isn't that crazy?\r\n\r\n\r\nNikolas Hulewsky (01:00:04.094)\r\nI know. dude, that's rad. I've never, so I haven't messed with Replet. Is it a, I'm retarded. Is it a plugin? Like, you doing it separate? Like where, where are you actually doing these things? my gosh. I knew that you were going to put the hands to the face. I'm like, even though I knew it was coming.\r\n\r\n\r\nChris Koerner (01:00:13.806)\r\ncool man.\r\n\r\n\r\nChris Koerner (01:00:22.798)\r\nMuhammad, do this brother a favor and edit this out so he can just go to replit.com and look and have his own question answered in 0.4 seconds. It's just like a, it's like a chat GPT interface. You do it all within replit.\r\n\r\n\r\nNikolas Hulewsky (01:00:37.534)\r\nStill you do it within, okay, cool. I'm up to speed. Muhammad, do this brother a favor.\r\n\r\n\r\nChris Koerner (01:00:40.502)\r\nYeah, but then if you\r\n\r\n\r\nDon't actually edit that out, Mohammed, because this is funny. This is good content. But if it needs to use OpenAI's API, it will ask you for your API credentials, and then it will remember them forever. So it's rad.\r\n\r\n\r\nNikolas Hulewsky (01:00:46.75)\r\nIt's good content.\r\n\r\n\r\nNikolas Hulewsky (01:00:54.546)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (01:00:59.486)\r\nFirst of all, that's freaking amazing. Is he paying you?\r\n\r\n\r\nChris Koerner (01:01:04.558)\r\nIt's funny because his wife was like, he was telling his wife and she's like, you're paying him, right? You're paying him. What are you paying him? It was good.\r\n\r\n\r\nNikolas Hulewsky (01:01:12.126)\r\nMm hmm. Very, very quick comment here. Isn't it crazy? Because I am this type of person. Isn't it crazy that the second I say, oh, yeah, and if it needs your API key, you can just give it your API key. That's going to turn 90 % of people who would have done this off like, oh, API. OK, that's too complicated for I'm not a coder. Right, like. And I've I've overcome that, but there's, you know, a million other things that kind of get in the way, but.\r\n\r\n\r\nChris Koerner (01:01:30.136)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:01:34.368)\r\nMm-hmm. We're not either.\r\n\r\n\r\nNikolas Hulewsky (01:01:41.808)\r\nstuff is easy and it's solvable but just that little thing weeds out 90 % of people that would have otherwise used this.\r\n\r\n\r\nChris Koerner (01:01:48.344)\r\nI I know.\r\n\r\n\r\nNikolas Hulewsky (01:01:50.083)\r\nAll right, so segueing from you using it.\r\n\r\n\r\nwith him to the really cool conversation that you had last week. I want to talk about this.\r\n\r\n\r\nChris Koerner (01:02:00.182)\r\nMm hmm. Before I say that, I want to quote a Sam par tweet. So edit this out, Muhammad. This is this is good.\r\n\r\n\r\nChris Koerner (01:02:41.774)\r\nHold on, I'm almost there.\r\n\r\n\r\nNikolas Hulewsky (01:02:43.24)\r\nDude, considering where we were like when we started this, think both of us were like, how's today going to go? This has been a great conversation.\r\n\r\n\r\nChris Koerner (01:02:52.206)\r\nIt's been it's been really good. All right, I found it. found it. Okay. All right. So I want to tell a story about a billionaire and I don't want to feel like that type of guy that talks about his billionaire friends. I just want to preface this with I don't know billionaires. I don't know them. I don't know. I don't have rich friends. Okay, I don't. I've talked to two billionaires in my entire life. And this one that I'm about to tell story about\r\n\r\n\r\nNikolas Hulewsky (01:03:09.37)\r\nMm-hmm. Apparently you do. Apparently you do.\r\n\r\n\r\nChris Koerner (01:03:19.982)\r\nI'm going to keep him anonymous because he wanted to be kept anonymous. I'm going to change some of the details to protect his identity. But it made me think of this legendary Sam Parr tweet from February 19th, 2021. Okay. I just pulled it up February in Texas, 2021. There was a apocalyptic snowstorm that knocked out the power and locked everyone inside. So he got reamed for this tweet, but he knew what he was doing. It says,\r\n\r\n\r\nNikolas Hulewsky (01:03:26.056)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:03:46.574)\r\nI was just trapped in a snowstorm in a two bedroom apartment 72 hours with one of the most powerful venture capitalists in the world. How's that for a hook? He said, this person Andrew Chen is a partner at Andreessen Horowitz. I asked him how to get rich through angel investing. Here's what he told me. So that became a meme, right? Like people, people would mean that and say, I was trapped in an apartment with and it was hilarious, right? So I'm just thinking of that tweet as I tell this story. So here's my hook. Are you ready for it?\r\n\r\n\r\nNikolas Hulewsky (01:04:05.33)\r\nYeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (01:04:10.846)\r\nSo good. Permission to make fun of you permission to not make fun of you.\r\n\r\n\r\nChris Koerner (01:04:18.746)\r\nI'm not enough to be funny, but not enough to hurt my feelings. You know where that balances, right? I'm easily offended, right? I'm not saying anything you don't already know.\r\n\r\n\r\nNikolas Hulewsky (01:04:29.64)\r\nAll right, go ahead, hook.\r\n\r\n\r\nChris Koerner (01:04:32.206)\r\nIf you offend me too much, I'll shut down emotionally and we'll edit this out and we'll never talk again. So this is here's the hook you ready? Everything I learned while being trapped in a stodgy office building with a West Texas oil billionaire. Okay.\r\n\r\n\r\nNikolas Hulewsky (01:04:34.685)\r\nmy gosh. I love this.\r\n\r\n\r\nNikolas Hulewsky (01:04:51.102)\r\nSay it, it, can you say it again? You started in the middle there. It's not gonna be good enough. We gotta say it again. Yeah, I know.\r\n\r\n\r\nChris Koerner (01:04:55.352)\r\nDang it. You're right. You're right. Here's everything I learned while trapped in a small office with a West Texas oil billionaire.\r\n\r\n\r\nNikolas Hulewsky (01:05:03.838)\r\nPerfect.\r\n\r\n\r\nChris Koerner (01:05:05.102)\r\nOn a January Wednesday afternoon for seven hours.\r\n\r\n\r\nNikolas Hulewsky (01:05:10.522)\r\nmy gosh, it's so good. All right. Yeah.\r\n\r\n\r\nChris Koerner (01:05:12.449)\r\nReady? Okay, so.\r\n\r\n\r\nThis guy saw me on Twitter and he wanted to talk to me about social media and AI. So I drove to his office. It was a long drive. I spent seven hours with him and two of his employees. And honestly, Nick, it blew my mind. It blew my mind a little bit. Yes, it did. Some of the things I witnessed were stereotypical and you probably heard about on other business podcasts. Some of it really surprised me. here, what was my nickname on our mission? What'd you call me?\r\n\r\n\r\nNikolas Hulewsky (01:05:29.884)\r\nIt blew your mind.\r\n\r\n\r\nNikolas Hulewsky (01:05:45.246)\r\nKearny the learner, Kearny the discerner.\r\n\r\n\r\nChris Koerner (01:05:48.28)\r\nKörner the Observer as well. That's right. That's right. So here's what I observed. So first of all, his monitor was like a 48 inch TV right in front of his face. Okay. Yeah, it was big. It was big.\r\n\r\n\r\nNikolas Hulewsky (01:05:49.598)\r\nTurner the Observer, yes, all of those.\r\n\r\n\r\nNikolas Hulewsky (01:06:03.617)\r\nOkay, so we know he's 74. Okay, keep going.\r\n\r\n\r\nChris Koerner (01:06:06.51)\r\nWe're going to whittle this down. He shared an office with one of his key employees who is a buyer. His title is but he doesn't have a title. Most of his employees don't have LinkedIn profiles. They they're not like out and about. They just work for this company. They're very loyal. They have great culture, but they don't like no one has a title at this company. Okay.\r\n\r\n\r\nNikolas Hulewsky (01:06:31.464)\r\nSo he shares a room, he shares an office with this person.\r\n\r\n\r\nChris Koerner (01:06:35.106)\r\nYeah, and his title is technically buyer, like a purchaser, but it's like his key right-hand man. Okay.\r\n\r\n\r\nNikolas Hulewsky (01:06:39.367)\r\nInteresting.\r\n\r\n\r\nOkay, so he did, but the billionaire doesn't have his own office. He doesn't have the corner office that's like massive with a putting green. Sure.\r\n\r\n\r\nChris Koerner (01:06:47.03)\r\nIt's a nice, it's a nice corner office. It's a modest, it's not huge. No putting green, very modest, no fancy furniture artwork. It's shared, it's shared. They're, they're back to back. They're literally back to back.\r\n\r\n\r\nNikolas Hulewsky (01:06:54.878)\r\nBut it's shared, the point is it's shared.\r\n\r\n\r\nThere's a, to quote Twitter, there's a lesson there.\r\n\r\n\r\nChris Koerner (01:07:04.342)\r\nYou\r\n\r\n\r\nquote Elon, let that sink in.\r\n\r\n\r\nNikolas Hulewsky (01:07:10.46)\r\nNo, but there has to, yeah, anyways, okay. Filed away, keep going.\r\n\r\n\r\nChris Koerner (01:07:13.058)\r\nSo his title is buyer, but he's way overqualified. That wasn't another pattern from the day. was like everyone was way overqualified for what they were doing with this company. They were just very smart for their title at least. Okay. His assistant is a lawyer, like a proper lawyer. She went to law school sharp as attack, very direct, professional, didn't just, wasn't just a yes woman. Her office was right next to his and they were just talking all day in person. Okay.\r\n\r\n\r\nNikolas Hulewsky (01:07:24.882)\r\nGot it, got it, okay.\r\n\r\n\r\nChris Koerner (01:07:42.798)\r\nSo that was interesting. She wasn't just like an administrative assistant.\r\n\r\n\r\nNikolas Hulewsky (01:07:43.646)\r\nSo she's in this, they're talking all day like she's in the same room or they're in separate rooms? Got it, okay. All right, cool.\r\n\r\n\r\nChris Koerner (01:07:48.202)\r\nNo, she's next door, but she's in and out of the office all day long. Okay. this gentleman solicited advice from everyone around him. Okay. Not only like the smart people or the C level people, his buyer, his assistant, me, anyone, he wanted truth or advice anywhere he could get it, but he was not afraid to tell them. That's a bad idea. I don't like that idea, or that's a brilliant idea.\r\n\r\n\r\nNikolas Hulewsky (01:08:09.64)\r\nHmm.\r\n\r\n\r\nChris Koerner (01:08:17.686)\r\nNot in a rude way, just in a very direct way. What are your thoughts on that?\r\n\r\n\r\nNikolas Hulewsky (01:08:18.994)\r\nYeah. Yeah.\r\n\r\n\r\nI love it. think it makes a ton of sense. I think it makes a ton of sense, especially for people who've gotten to that level. There's a, there's a interview I saw with a guy who was an executive at Facebook. said the same thing about Mark Zuckerberg. He's, he's like going into a meeting with Mark. He wants the feedback. He will take any feedback from anybody. He will tell you if he thinks your idea sucks, he'll push back on you, but he's open to having his mind changed. And I think that the most successful people, especially in that stratosphere.\r\n\r\n\r\nChris Koerner (01:08:39.149)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:08:53.68)\r\nEverybody's trying to dethrone them. They have to be open to feedback because otherwise They're gonna get taken out so it doesn't surprise me because I've heard about it But it also does surprise me because you don't think of like billionaire know-it-alls as like asking questions at the janitor So I think it's awesome\r\n\r\n\r\nChris Koerner (01:08:55.864)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:09:00.526)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:09:09.827)\r\nMm-hmm.\r\n\r\n\r\nLike when I first walked in, I got there five minutes early, 7.55. Every single person in the office was already there and working at 7.55, which that that alone was interesting to me. I walked in and this gentleman was standing right inside the door with another gentleman and they were looking at new packaging options. And I walk in the door and they're like, Chris, oh, thanks for coming. Nice to meet you. Hey, look at this packaging with us. What do you think? Do you like this one or this one? Does the lid fit right? How does it look?\r\n\r\n\r\nIf you were a customer, what would you think if you picked this up in your, like, this was like how I met them. I'd never met them in person ever. And they immediately, and I don't know about packaging. I've never had a consumer package good before. I'm not like a packaging expert, but he genuinely wanted my feedback. I'm like, Hmm. So set us off on the right foot.\r\n\r\n\r\nNikolas Hulewsky (01:09:42.824)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:09:48.562)\r\nYeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (01:09:57.416)\r\nHmm. So, so he was instantly engaging, instantly charismatic.\r\n\r\n\r\nChris Koerner (01:10:02.444)\r\ninstantly. Yeah, but there were no pleasantries. He was nice, shook my hand. Nice to meet you. I'm so and so here so and so what do think of this packaging? Like we just get right into it.\r\n\r\n\r\nNikolas Hulewsky (01:10:12.018)\r\nWas it like intimidating or was it like, this is my friend's dad from college and we're meeting for the first time.\r\n\r\n\r\nChris Koerner (01:10:14.454)\r\nMm-mm. It was...\r\n\r\n\r\nChris Koerner (01:10:18.7)\r\nIt was extremely welcoming. Like just, it just puts you at home immediately. Okay. So then, we're in this office and immediately we just start riffing on ideas. And it was very much like ADD laced. Just there was, there was a whiteboard. We were whiteboarding. He was whiteboarding, but he wanted advice from everyone and we were just all over the place. And I'd ask a question like, well, what do you pay for this? Look it up.\r\n\r\n\r\nNikolas Hulewsky (01:10:20.734)\r\nThat's awesome. Okay.\r\n\r\n\r\nHmm. Okay.\r\n\r\n\r\nChris Koerner (01:10:45.878)\r\nAnd he'd asked the other guy to look it up. They look it up. And then we'd spend an hour talking about that one question. And I'm like, I thought we were talking about this. Like, this is me. Are you me? Like, we're ADD all over the place. You know? But it was just, that was a big takeaway for me was like, he just wanted advice from everyone. But, and he would respectfully tell you, that doesn't work because X, Y, Z. I don't like that idea, but not in an offensive way. That was the culture of everyone there was just very direct, but professional.\r\n\r\n\r\nNikolas Hulewsky (01:10:47.134)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (01:10:53.96)\r\nYeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (01:11:15.206)\r\nI here's a quick piece. I think I'm very good at the former and not great at the latter. I love getting advice. I love questioning. I love finding the right answer. But when it comes time to you make the decision or you give direct feedback, I don't know if I'm as good. I mean, I'm trying to be better, but I wonder. Those two things are, I think, rare skills to have at the same time.\r\n\r\n\r\nChris Koerner (01:11:27.202)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:11:33.613)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:11:44.352)\r\nMm hmm. Yeah. Yeah, I agree. Another thing is, they would come up with an idea, an action item. Let's do this. He would do it immediately. He would stand up from his desk, have his assistant sit down and type the email for him. And he would just watch her type and like, and he wasn't really reading. She was just like, type it out. And then she'd like, edit it. And then she's like, Yeah, you're good. Good. She'd send. They'd swap places. He'd sit back down.\r\n\r\n\r\nNikolas Hulewsky (01:12:12.946)\r\nNo way, really? Have you ever seen Trump with his assistants? They'll tweet for him. It's pretty funny. she'll be sitting here like this, like, typing out, and then she'll turn the phone and show him. And it's in the grandpa text, it's like this big, all caps, because that's just the way he tweets. And then he'll be like, yeah, that's good, change this part. And then she sends it off, as Twitter would say.\r\n\r\n\r\nChris Koerner (01:12:13.91)\r\nYeah, yeah.\r\n\r\n\r\nChris Koerner (01:12:19.138)\r\nMm-mm. Mm-mm.\r\n\r\n\r\nChris Koerner (01:12:33.57)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (01:12:42.142)\r\nThere's a lesson there.\r\n\r\n\r\nNo, that's interesting. She wrote it for him.\r\n\r\n\r\nChris Koerner (01:12:46.7)\r\nYeah, yeah. So the other thing was\r\n\r\n\r\njust went blank.\r\n\r\n\r\nNikolas Hulewsky (01:12:55.07)\r\nI'm going to recap really quickly. Gregorius, very welcoming, curious, genuinely curious, soliciting feedback, action oriented, direct with his feedback, firm decisions, next steps done right away. Nothing's hanging over. Yeah, let's circle back on that or let's drill down on that later. No, it's like, okay, cool. We're done.\r\n\r\n\r\nChris Koerner (01:12:59.276)\r\nMm-hmm. Very likable.\r\n\r\n\r\nChris Koerner (01:13:04.419)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:13:23.778)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:13:25.16)\r\nlike moves it off of his plate quick. Okay.\r\n\r\n\r\nChris Koerner (01:13:27.426)\r\nYep. the way he handled the phone calls was super interesting. And remember my boss, Danny, the pest control business owner. Yes. Danny Galini. He would always answer the phone with go ahead, go like just let's freaking get into it. And then at the end he would end it with, me go, let me go. Right? Like I'm done with this conversation. I swear on my life, this guy, he answered the phone. Go ahead. Go ahead.\r\n\r\n\r\nNikolas Hulewsky (01:13:35.646)\r\nDanny Galini.\r\n\r\n\r\nChris Koerner (01:13:57.494)\r\nRight? As if it was like a walkie talkie and just straight to the point and like people would like over describe things to him and and he would just interrupt him like, tell me exactly what I need to know. What do need to know? Okay. So that was interesting. He's always on speakerphone, maybe because he can hear better maybe because he wanted the people in the room to hear it right.\r\n\r\n\r\nNikolas Hulewsky (01:13:58.46)\r\nMm-hmm. Yeah.\r\n\r\n\r\nNikolas Hulewsky (01:14:18.536)\r\nDude, yes, and he's like created this environment where no secrets was like, dude, like secrets cost him money. All right, cool. Everybody's gonna hear. Great. What did you guys think of that? Let's make a decision straight to the, I love that. I love that.\r\n\r\n\r\nChris Koerner (01:14:24.141)\r\nYeah.\r\n\r\n\r\nChris Koerner (01:14:31.702)\r\nIt's funny you say no secrets because at one point he said to me, Chris, what if I paid you X amount of dollars a year to work here? It's like completely took me off guard and it was surely. Yes. It was sure. Stop, stop, stop.\r\n\r\n\r\nNikolas Hulewsky (01:14:42.91)x\r\nto hold on to 200,000 here, 300,000 here, 700,000 here. Stop me, Chris, Chris, $900,000 a million dollars a year, Chris?\r\n\r\n\r\nChris Koerner (01:14:54.4)\r\nIt was surely an amount of money much more than either of the people in the room make. And I was, mean, how awkward, how easily do I get awkward neck?\r\n\r\n\r\nNikolas Hulewsky (01:15:03.326)\r\nexceptionally easily.\r\n\r\n\r\nChris Koerner (01:15:04.832)\r\nI get awkward probably more than anyone you ever met in your life, right? I wanted to die. I wanted to jump out of the window. Because I'm like, I what we're talking salary net, we're negotiating salary in front of these. What? And he's like, No, I probably couldn't pay that much because then everyone would get jealous. And they would resent you. And I'm thinking like, why does anyone have to know? Why? Why can't we just\r\n\r\n\r\nNikolas Hulewsky (01:15:25.886)\r\nYou\r\n\r\n\r\nNikolas Hulewsky (01:15:29.842)\r\nHe's like the autistic guy. just like, cause you get it, right? Cause then your wife would be attracted to me if you came in the office. You're like, whoa, what? don't.\r\n\r\n\r\nChris Koerner (01:15:33.891)\r\nYeah.\r\n\r\n\r\nChris Koerner (01:15:38.296)\r\nWell, and then he would look to the other people like, what do you think? What do you think? Yeah. And they were just like, I'm like, are we talking about this openly? What is happening here? And then I'd like, I literally said out loud, I'm like, this is awkward. And he's like, what is it, Chris? Is it a heck yes or a heck no? Is it a heck yes or a heck no? And I'm like, what would I have to move here? And he's like, he's actually considering it. you think we would ever pay you that?\r\n\r\n\r\nNikolas Hulewsky (01:15:45.438)\r\nPretty cool, yeah.\r\n\r\n\r\nNikolas Hulewsky (01:16:01.15)\r\nThat was a joke. Okay.\r\n\r\n\r\nChris Koerner (01:16:08.088)\r\nSo very, very open. One thing he kept referring to, go ahead.\r\n\r\n\r\nNikolas Hulewsky (01:16:14.876)\r\nLet me ask you this. I've noticed myself doing this in the last year in particular. I find myself cutting people off. I'm not trying to be rude, but it's like, I see where going with this. Okay, cool. Like I don't need everything else. Yeah. Like let's just cut to it. And I still struggle with it because I don't want people to think that I'm rude or mean or douche. You know what I mean? But at the same time, it's like, okay, cool. Can we, can we hurry this along? Could, did you see yourself in him when he would do that? Yeah. That's weird, right?\r\n\r\n\r\nChris Koerner (01:16:25.762)\r\nYeah, let me save us both some time.\r\n\r\n\r\nChris Koerner (01:16:38.434)\r\nMm-hmm.\r\n\r\n\r\n100 % 100 % Yeah.\r\n\r\n\r\nNikolas Hulewsky (01:16:44.412)\r\nI wouldn't have thought this like even even two years ago. I wouldn't have thought this but like recently I could definitely see that.\r\n\r\n\r\nChris Koerner (01:16:49.302)\r\nAnd yeah, I wonder if when either he's always been that way or if when he was our age, he would kind of pussy foot around it and hesitate. And now that he's older, he's just like, I don't give a crap. Like we're going to save time here. I'm to cut you off. I know where you're going.\r\n\r\n\r\nNikolas Hulewsky (01:17:02.174)\r\nYeah, and he's probably like, look, either you're like me or you're not gonna like me. I can't waste my time on it. But he's gonna be super welcoming, engaging, gregarious. So you know, quickly you trust him. He doesn't mean it to be rude. That's the way I'm starting to feel about it. It's like, look, you're get to know me. You know that I'm not trying to be rude. I like you, right? But let's just get to the heart of the matter.\r\n\r\n\r\nChris Koerner (01:17:14.698)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nChris Koerner (01:17:22.242)\r\nYeah. Yeah. And I think Michael Gurdley has this like a one page that he gives people that work with him. And it just gets like all of that out of the way. And I really like that. Because then it's like, then they know on day one that you're not being rude. That's just how you are. And I like that idea. He kept referring to 175 years, the whole time. And I would be like, why don't you do this? Why don't you do that? Why don't you? You could you could definitely raise these prices. And he's like, Chris,\r\n\r\n\r\nNikolas Hulewsky (01:17:32.158)\r\nMmm. Hmm.\r\n\r\n\r\nNikolas Hulewsky (01:17:38.45)\r\nRight. Right.\r\n\r\n\r\nNikolas Hulewsky (01:17:45.598)\r\nReally?\r\n\r\n\r\nChris Koerner (01:17:51.766)\r\nI want this business to be around in 175 years, right? So your idea is great for the next five years, but I'm not worried about that. Like, and he starts referencing all these companies that have, he's like, Sears was amazing. Sears was amazing. They should have been around for 175 years, but they made this one mistake. And so they're not that he's like, they could have done this. And I guarantee you they'd still be around, but they didn't.\r\n\r\n\r\nNikolas Hulewsky (01:18:13.438)\r\nDid he give his rationale for a Y 175? That's like a very specific number.\r\n\r\n\r\nChris Koerner (01:18:17.934)\r\nMaybe he wants to get to 2200 and we're like.\r\n\r\n\r\nBut just that's the framework is just a long-term thinker. Very long-term thinker, yeah. I gotta think of some more, unless you have some ideas.\r\n\r\n\r\nNikolas Hulewsky (01:18:26.014)\r\nMm-hmm, generational.\r\n\r\n\r\nNikolas Hulewsky (01:18:34.27)\r\nI was just going say a lot of Warren Buffett is like that. Elon Musk is like If you look at these guys who have billions of dollars, they're looking at long time horizons. Musk's trying to go to Mars. Warren Buffett is 92 and he's still investing as if he's got a 40-year time horizon. They're not necessarily trying to make decisions for this next quarter. They're trying to make decisions for the long term. I do think it changes at some point.\r\n\r\n\r\nChris Koerner (01:18:43.607)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:18:47.606)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:18:52.919)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:19:04.254)\r\nWhen you're getting started, it's like, I gotta make the decision for tomorrow. I gotta figure this out now. And then you get to a certain level that I think you're financially able to make decisions that are long-term as opposed to just these short-term flips.\r\n\r\n\r\nChris Koerner (01:19:04.684)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:19:15.788)\r\nYeah. Yeah. Say yes to everything until you can afford to say no to everything. he, kept wanting to know how I think, cause I think like everything he knew about me was publicly facing, but he kept asking me these questions that were kind of tests. They were tests in a way. Like at one point he had me stand up to the whiteboard and he asked me this super complicated question about his, his ranch and his deer lease.\r\n\r\n\r\nNikolas Hulewsky (01:19:20.222)\r\nMm-hmm. Right.\r\n\r\n\r\nChris Koerner (01:19:44.448)\r\nAnd like how he tags these deer and how he asked the guys that work on his ranch, if we kill all the deer with the red tags, how many deer would be laughed over? And it was kind of like, it was a math question on its surface, but really it was a, how do you think question below the surface? And it was, it was really interesting. And sometimes I would answer in a smart way, but the wrong way, like he was talking about like an issue they were having with a vendor. And he's like, now, why do you think we can't ask?\r\n\r\n\r\nNikolas Hulewsky (01:19:58.003)\r\nYeah.\r\n\r\n\r\nChris Koerner (01:20:14.294)\r\nour vendor to price us according to this other customer of theirs. And I was like, well, because then they would eventually find out it could, it would piss that customer off and it would risk what the vendor has with their customer. And he's like, that's actually genius. And I'm that's crazy. You thought of that, but that's not at all what I'm getting at. I'm like, thank you. And so like, there were like three or four times when he asked me these questions to test, not if I knew the answer, but\r\n\r\n\r\nNikolas Hulewsky (01:20:31.128)\r\nMm. Did you say genius?\r\n\r\n\r\nChris Koerner (01:20:41.42)\r\nwhat follow-up questions would I ask to help get to the right answer? And he didn't even care if I got to the right answer or not.\r\n\r\n\r\nNikolas Hulewsky (01:20:45.448)\r\nreal quick. Do you see Mark Gaskins is in your lobby?\r\n\r\n\r\nChris Koerner (01:20:52.956)\r\nshoot. yeah, I have a podcast with Mark in one minute. And I guess he's here early. I can make him wait. We could just tie a bow on it. Let me email him real\r\n\r\n\r\nNikolas Hulewsky (01:20:59.078)\r\nOkay. Yeah, we just, yeah.\r\n\r\n\r\nNikolas Hulewsky (01:21:20.039)\r\nI didn't realize we were talking that long.\r\n\r\n\r\nChris Koerner (01:21:21.965)\r\nMe either.\r\n\r\n\r\nAlright, I sent it. Anyway, so in general, it was an amazing experience, really enlightening day, and I learned a ton.\r\n\r\n\r\nNikolas Hulewsky (01:21:35.057)\r\nI like that idea of seeing how people think. So you and I, I'll tell you offline, but you and I have a mutual friend who has a friend that he claims is worth like $800 billion. And for a myriad of reasons, I don't believe him. And I'm like,\r\n\r\n\r\nChris Koerner (01:21:48.366)\r\nHmm.\r\n\r\n\r\nChris Koerner (01:21:52.33)\r\nI is anyone worth that much? Elon's worth like 400 billion. Okay, okay, okay.\r\n\r\n\r\nNikolas Hulewsky (01:21:55.038)\r\nI don't think there's a person. Oh, said, oh, I'm sorry. I said 800 million is what I meant. Sorry. didn't. Sorry. Anyways, the reasons don't matter why I don't believe them, but they were there and like we were talking about it and there's like, there's two ways that you can sort of validate somebody. I think over time, way number one is the hard facts. Oh, they fly private. I met.\r\n\r\n\r\ntheir chief of staff of this company. His personal chef was here. He let me stay at several of his houses, right? Like those are those are facts that you can do. The other way that I think you can validate is just by talking to them over many conversations over an extended period of time. And you like you just get a feel for how they think what kind of decisions they would make. And that can get you to trust and validate those things, right? It's like, yeah, he's a freaking genius when it comes to business. He's\r\n\r\n\r\nChris Koerner (01:22:44.6)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:22:52.446)\r\ncoached me on a couple of things, whatever. And that's where I think this billionaire that was talking to you, it's that second thing, right? It's like, how do you think, how do you answer this question? He's validating you by quickly trying to get to the spot that most people spend months getting to because they're just like getting to know somebody. He's trying to elicit that quickly by asking these series of questions. I think that's a really interesting way to sort of think about validating somebody is how do you quickly get them to give you the information you need?\r\n\r\n\r\nChris Koerner (01:22:54.466)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:23:12.024)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:23:20.361)\r\nMm. Yeah, I agree.\r\n\r\n\r\nI think it's something intelligent to add to that, but.\r\n\r\n\r\nNikolas Hulewsky (01:23:27.454)\r\nIt is what it is. So, are you going to work for them?\r\n\r\n\r\nChris Koerner (01:23:34.766)\r\nI'm going to propose something.\r\n\r\n\r\nNikolas Hulewsky (01:23:36.91)\r\nokay. The proposal.\r\n\r\n\r\nChris Koerner (01:23:38.902)\r\nnot to be not to be like an employee or W two but work with him enough for him in a way.\r\n\r\n\r\nNikolas Hulewsky (01:23:47.358)\r\nDude, I mean, might cut this out and that's fine. Wasn't it funny, like even three years ago, the conversations that you and I are having are the same. And I would say like the quality of our intellect and curiosity is pretty much the same. But now like the people that we're talking to and the opportunities that we've had is like, it's so different. Like in the ability to effectuate change by...\r\n\r\n\r\nusing our skills and things that were better than anybody else in the world at is pretty incredible. Anyways, that was my thought after listening to you.\r\n\r\n\r\nChris Koerner (01:24:19.01)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:24:24.13)\r\nYeah. No, that's good. And a framework that I just thought of while you were saying that is like, one thing that we're doing with this podcast, either overtly or subtly is encouraging people to go out and do cool stuff. Right? Just just start something, do something, build something, sell something, do something epic and cool. If you do that, it's almost silly. It's almost stupid, I would say to not tell the internet what you're doing.\r\n\r\n\r\nYou know what I'm saying? Like I get it. I, I, on one hand, I get it. Like content is, is a beast. It's, it can be stressful. It could be addicting in a very bad way, but it just opens up. Like if, if you're opportunistic, which you probably are, if you're listening to this, then you can be even more opportunistic by simply telling people about what you're doing. If you're doing something cool and things like, like this guy invited me over because of an interview he saw of mine.\r\n\r\n\r\nNikolas Hulewsky (01:24:55.774)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:25:17.202)\r\nYeah.\r\n\r\n\r\nChris Koerner (01:25:22.584)\r\nthat wasn't even on my podcast. He hadn't even seen any of my content. It was someone else's content featuring me. One piece of content, right? Like.\r\n\r\n\r\nNikolas Hulewsky (01:25:27.392)\r\nthat's crazy. That's super random. One, it's not all, the other thing is like, it's not all gonna look the same. You and I are gonna look very differently. You are much better than I am at storytelling, at figuring out the hook, at figuring out the interesting angle, at being brief, right? Like I talk too much. So your ability to grow an audience is much better than, I'm not saying that I won't get better. I'm not saying I won't grow an audience, whatever.\r\n\r\n\r\nYou're just like, you've built this skill set up over time and you have this natural ability. You're better than me at this. So your opportunity with content is different, right? I'm kind of getting, you're doing really cool stuff now and now like just continue feeding into your stuff. My path may be a little different. I'm thinking now about doing cool things, maybe raising some money, maybe getting back into healthcare. Still continuing to do content, but like using those things that I'm doing as a way to feed the content and then that.\r\n\r\n\r\nChris Koerner (01:26:05.08)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:26:24.124)\r\nis an opportunity for me to continue to share, But those are two very different things, the paths that we're laying out there. And neither one of them is right or wrong for anybody. They're just right or wrong for specific people. that's what's so cool to me is you can use this in any way that you want. You just need to figure out how you build trust at scale and then how it works for you moving forward.\r\n\r\n\r\nChris Koerner (01:26:29.059)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:26:35.469)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:26:45.998)\r\nYou gotta figure out what you do.\r\n\r\n\r\nNikolas Hulewsky (01:26:47.474)\r\nYou got to figure out what you do.\r\n\r\n\r\nChris Koerner (01:26:50.604)\r\nanother Tim Robinson reference there. All right, it's good. All right, roll tide.\r\n\r\n\r\nNikolas Hulewsky (01:26:52.862)\r\nAll right. Hey, talk to them. Love you too.",
  "metadata": {
    "duration": "",
    "date": "2025-02-28",
    "platform_source": "Google Drive"
  }
}