{
  "episode_number": "10",
  "episode_title": "From One-Co to HoldCo: How Do I Take the Next Step?",
  "guest_name": "Various",
  "business_name": "Fractional CFO Business",
  "transcript": "﻿Thomas, where are you calling from  Birmingham, Alabama, Birmingham, Alabama. Okay. Are you from Birmingham?  I'm originally from a bill, so close, but not quite Birmingham. Yeah. Okay. So  tell me a little bit about your background and what you're struggling with.  Yeah. Golly, if I went way back so I was originally an electrical engineer, that was my education.\r\n\r\n\r\nBut discovered I didn't like it as much. I have this systematic brain that I guess an engineer would have, but I just wasn't loving engineering. So I started doing fractional CFO work and I'm partnered with. Connor Abeney on it, which a lot of people know from Twitter and what he does.\r\n\r\n\r\nI'm partnered with him on that, but we want to start other things and buy other things. And so  I went down the rabbit hole thinking that when I was going to get out of my job, I'd go acquire like a local business and that was the way out. But I instead started doing the fractional, seeing if I work on the side, eventually left my job and was doing it full time, but I'm just at this point where.\r\n\r\n\r\nI just want to start things and buy things and, but I'm also like, I have no idea how I'm supposed to fit that in because there's only so many hours in the day. So that's why I always find these people and I'm like Chris and Nik, they're buying and starting a lot of things. There's other people who do that too.\r\n\r\n\r\nJosh and Reg, they're buying up multiple foundries. The list goes on if you're on SMB Twitter. And so I struggle with just like time utilization, is this your first business, you have owned? Yes. Yes. This is my first. And it's highly reliant upon my time for sure. It's hard to build.\r\n\r\n\r\nSystems and scale myself out, but yeah, so I'm just going to ask a bunch of questions to get a better feel for what you're currently doing. So you've partnered with Connor, you have the fractional CFO company. How much of the work are you doing versus how much are you managing the team?  Wow. So for the clients I take on, I'm doing most of the work and we have hired an analyst in the Philippines to help with that.\r\n\r\n\r\nI'm able to. Outsource some of those tasks, but it's still probably,  it's probably still 80 percent me. Tell me what kind of tasks does a fractional CFO do?  Sure. Yeah. So lots of cash flow forecasting, cash flow management we'll do P&L forecasting. We'll do reporting. So once the books are closed, provide some reporting and dig into some analysis ad hoc requests.\r\n\r\n\r\nSo if somebody wants to buy something, they want to structure a deal, an LOI or debt the capital stack, right? We'll help with that type of analysis. If somebody's doing that, we'll help fulfill a controller role. It's a bunch of things. How much of your role is spent doing  Tasks and how much of your role is spent using intellectual capital.\r\n\r\n\r\nAnd I'll give you an example. A task would be GL accounting,  right? You're going in and you're assigning where costs go. Intellectual capital would be business valuation,  right?  It's not a hard and fast rule where you just go in and add some numbers up and there's the value of the business. So using that framework, how much of your time is task oriented and how much of your time is  thinking? \r\n\r\n\r\nSure. I would say.  I would say half and half tasks and the other 50 percent would be non tasks and that would also include like phone calls because we'll have bi weekly or weekly calls with certain clients. And so we're working through issues right there on a zoom call. So I'd say 50, 50 tasks versus non tasks. \r\n\r\n\r\nHow old are you? Just give me an idea. I know you have kids. 28. I hear you're obvious. 28. Okay. You're young. You may not feel young. , but you're young. I I definitely don't.  Tell me about the business. So you and Connor started this business how long ago? So Connor started originally and then he probably ran it for about a year, and then I hopped on board with him.\r\n\r\n\r\n. And so it's expanded the full ecosystem. He's got like the services side and the product side, and we are partners on what we call products. That, that's like the dream of where I want to go, move towards, but I still have to fulfill my. CFO obligations, which falls more on the services side.\r\n\r\n\r\nThat's what pays the mortgage, puts food on the table. So we are partners, not directly in CFO. It's the other entity, but CFO is where I started with him.  Okay. And does Connor know that you want to do this? This is Connor aware that you have a itch or desire.  Oh totally. Yeah. Oh no. Yeah.\r\n\r\n\r\nNo, we have big plans to go do other things. It's just I know you say Oh, totally. Yeah, for sure. Sometimes partners don't communicate that stuff. So I just want to make sure that you guys are on the same page. That's a really important. So it's just a really freaking important part of this whole process.\r\n\r\n\r\nTell me what's the motivator for wanting to do something else.  Yeah. In general, I've been thinking about it's customers over clients, as far as the businesses client relationships are directly with me are very hard to scale because they work with me and it's hard to, I just can't, I can't go put in some sort of automated system and automate the people relationship, right?\r\n\r\n\r\nAI is not quite there yet. And so it's hard to scale appropriately and then it's just hard work. Oftentimes even in the CFO work, you can do an incredible job and you can still get fired from a client sometimes because you did such a good job where they're like, look, I feel like we know exactly what we need to do and you've helped us get to this point.\r\n\r\n\r\nSo it's time to sunset the relationship. And then you're dang, you did all that work to set it up. And then all of a sudden you don't get to Yeah. Reap the rewards for too long after that. Are you a CPA? I am not. No, not a CPA. All right. And how long have you been doing this with Connor?\r\n\r\n\r\nYou said a year? About 18 months now.  Okay.  Tell me if you're willing to, how big is the company right now?  Yeah. We are Definitely. We're over six figures in monthly recurring revenue. But yes, we're over six figures in the prior one and a half million dollar total run rate ish. Give me a ballpark of what that, like just financially, what that means to you.\r\n\r\n\r\nAre you at a place where you're  making, low six figures or are you like, yeah, man, I'm doing well in mid six figures. I got a lot of cash coming in every single month. What's, where are you in that continuum?  Yeah. So I would be between mid six figures and low six figures. So I'm making.\r\n\r\n\r\nWhich is great. Again, like it's a well paid job essentially. But I just want to own more businesses and that's just where my heart more lies more there. My mind works more there. Like I'm thinking about systems and processes and triggers and inputs, actions, outputs that's just more how I think.\r\n\r\n\r\nAnd so I'm not like,  It's just hard to do that on the CFO side as much. And so that's why I'm like, okay, I actually realize I want to go. Their start or buy businesses and run them and make them more efficient. And that's where I think the engineering part of me starts to play in for sure a little bit.\r\n\r\n\r\nAnd so that's what I want to go do. I want to go build processes and systems and then eventually move on to the next one. But why do you think you haven't been able to do that yet?  It's partly. I've never done it. So I don't necessarily know how, at least when it comes to the CFO stuff, I've been  reaching out to all sorts of people and learning from them.\r\n\r\n\r\nPeople like John Matzner. He's an idiot.  He's an idiot. Don't yeah. Yeah. Don't listen to that guy. Yeah. He'd probably agree with you. He'd probably agree with you. He so he's helped me define some frameworks for like how to think about this. This, and it comes down to  like, when it comes to the CFO stuff, he's really, you need to become quality control.\r\n\r\n\r\nYou need to define all your outputs, and then figure out like what really needs to be done by you. And what doesn't condense CFO in as small of a box as possible, like per week. So then you have more time to get to the other things. And it's, I totally agree with you or agree with him. And I think that's the right path, but I guess it's a, I don't, I have a wife and daughter.\r\n\r\n\r\nSo I try to spend time with them. Yeah. I try to sleep at least six hours a night. And it's there's just so many hours in the day that I can actually get things done and I'm just struggling to still maintain all my current stuff while trying to systemize it and also think about the other things that we can go do.\r\n\r\n\r\nCause we have another business we've already launched, which is probably like in hindsight, like terrible idea. Cause it's do I need more on my plate? Like probably not, but we just really wanted to launch it and get it going. So we did. And so I'm just It just feels like when it rains, it pours, man.\r\n\r\n\r\nWhen it comes down to tasks that have to get done every day. And I just don't know how to catch up. I have I think I have some advice based on what you told me. I remember being 28. In fact, I didn't buy my first business.  I didn't buy my first business until I was 32, 33.  I don't know, somewhere in that range. \r\n\r\n\r\nAnd I just felt this internal motivation. I didn't know where it was coming from, but it was like now or never you got it's now or never, Nik, are we going to do this? Are we not going to do this? So I totally understand that feeling and that drive to find and buy a business.  I would spend some more time just really thinking about why is it important for you to buy another business? \r\n\r\n\r\nAnd you don't have to have a specific answer right now, but  if it's to make more money, I would say you have a business that's already proven. That's really hard  to get to a point where you have a business already proven. So spend more time in that business, scaling it up. You're making decent money, but you're not to the point where it's spitting off so much cashflow that  you can do whatever you want.\r\n\r\n\r\nAnd a lot of people  Do what you're doing, right? They have an agency and then  they use the cash flows of that agency to fund other businesses. So like Andrew Wilkinson had  an agency. It's a very common model where it's I have a specific skill set. I launched an agency around that skill set. I build a business.\r\n\r\n\r\nAnd then once I have enough cash coming in from that business, I go and buy other businesses with that cash. And it's just like a rinse and repeat cycle.  And I've talked about this before, but in software, there's this land and expand. Philosophy or saying where you get in your product into one company and then you start adding adjacent offerings to that product. \r\n\r\n\r\nSo for example,  fractional CFO, you landed with a company and then you start offering bookkeeping services. Cause of course they need bookkeeping services. Bookkeeping services. Then you start offering, I don't know, tax services, because of course they need to file their taxes. And then you start offering I'm trying to think of what else, GL accounting or whatever it is, you land in your expanding it's the same thing with owning a business that once you have those cash flows, you, and you're getting them, you landed that business and then you start expanding. \r\n\r\n\r\nSo that's all like a big preamble. So if I were you're making more than enough money at this point to hire a replacement.  And it's a question of how uncomfortable you want to be.  If you want to  have all that time with your wife and kids after hours,  then you're going to make less money.\r\n\r\n\r\nYou need to hire someone to replace you with those clients right now. So that it will free up your time to go find another business or expand your product offering or whatever else you want to do. But that's the trade, right? Time and money. You'll have the time you'll have limited stress, but you'll just be making less money until those other investments and ventures get caught up.  Or  you have to be okay with, working from seven o'clock till 10 o'clock and not putting the kids down. And maybe, maybe a Saturday every month that you're not there  and you think, Oh, they're young.\r\n\r\n\r\nI can miss a couple of times. You can pick and choose your spots because you can't take a financial hit. But you still want to spend these things up. There's no really other way to do it. You need to figure out what your willingness to sacrifices, if it's one of those two things, or else  you stay in your current role and you get to a place where you can hire replacement and you don't need to take a significant cut. \r\n\r\n\r\nIn your compensation. So that may be twice as big as the agency is right now to see if the CFO company,  it, but then it's still your sacrificing time, right? Like I want to do this now versus a couple of years down the road.  What before I keep just rambling. What do you think of what I'm saying?\r\n\r\n\r\nI have a hard time accepting that I can't do everything. Cause I'd maybe I'm just young and naive. And it's I want to. So you ask like, why would I want to buy a business or why would I want to do something else? It's partly because I want to. Send my skillset to where it's probably at the highest and best use.\r\n\r\n\r\nBut also I think that I just want to achieve more. I think part of that's I, it's probably some underlying thing where I feel like I've always been overlooked and doubted. And so I have this like constant urge to just achieve more. And got a chip on your shoulder. Yeah, exactly.\r\n\r\n\r\nYou just look over and there it is. Welcome to the club. Yeah. Yeah. So it's, I want to achieve more, but I also want to make more as well because I didn't grow up poor or anything, but there wasn't a lot of excess when I grew up. And I remember parents being stressed about money and yeah.\r\n\r\n\r\nI just don't want that for myself. I just want to achieve, I don't know. It's I want more money. I want to go to live a good life and travel and do other things. And so I have the energy now and I am hungry and driven. So it's, I want to achieve what I can. I don't want to be patronizing.\r\n\r\n\r\nAnd I hope this doesn't come off this way. When guys used to say this to me, I used to always feel like, Oh yeah, it must be nice. But what they would say is every time I'm like, oh yeah, I'm 35 dude. You are so young. Oh my gosh, dude I wish I was 35 and had been in the position you're in and I was always like, yeah But like I'm not you I don't care what you feel like.\r\n\r\n\r\nSure. Sure. Now that being said  you're 28.  Sure, right? Yeah and I don't mean that as a knock in any sense of the word,  but there are some years left to put in before the compounding really takes effect. I didn't make a million dollars until I was 35.  So there was a lot of years in there where I had to figure it out  and I wouldn't rush.\r\n\r\n\r\nTo get to a place you're not ready for,  because either you're going to get there and you're going to fail,  or you're going to get there and have to sacrifice some things that you don't want to sacrifice. So  you just need to do like a real assessment. It's okay, why do I want to buy a business?  If there's like an opportunity right now and I have to get it, otherwise I feel like I'm never going to get that chance again. \r\n\r\n\r\nThen you should do it right now.  You should either make less money or spend less time with your family. I had to do this with my wife. I spent less time with my wife for a couple of years where I was like, Hey, look, I'm trying to put the work in. She's like, all right, every day  from four to six or from five to six, you come home, you see the kids.\r\n\r\n\r\nAnd then from six to 10, you're working. I'll get the kids away from you. I don't know if I'd make that trade again.  Now I'd make that trade again, if I was back in those shoes, just because I,  in order to get to where I wanted to get to, I had to sacrifice something. And that time commitment was what it was.\r\n\r\n\r\nBut what you will find is that in being intentional with your time,  it will be more meaningful When you are there with your kids  and I know this sounds weird and you can make fun of it if you want, you waste a lot of time during the day  and even with you when you're with your kids. I don't know.\r\n\r\n\r\nYou're just messing around. You're not doing stuff. But if all of a sudden you're like, Oh, I only have two hours a day to see my kids. All right. This is the routine. These are the things that we were doing. And all of a sudden you find. You're actually having a better relationship with them now because you're time constrained versus when you thought you had all the time in the world.\r\n\r\n\r\nSo I just don't believe that the trade offs are necessarily either I'm a good dad or I make a lot of money. I don't, I just don't think those are the trade offs. You just have to be intentional about. Scheduling your time. Maybe you watch less Netflix. Maybe you're not on Twitter as much. Maybe you don't,  I don't know.\r\n\r\n\r\nGo to the office three days a week and you work from home. There are sacrifices you can make right now, but if you're like, if you really believe that you can do this,  then you're going to have to make some type of sacrifice. Yeah. Yeah. It definitely rings true. And I don't take it patronizing when you also say like you're 28, like you've got time.\r\n\r\n\r\nI didn't really start doing anything on my own until I was 26. And it's only been, again, it's only been like 19 months of really me doing something on my own, but man, do I feel like, It's it's never here fast enough and it's, yeah, I want it now and it's easy to compare yourself to other people to write comparison is a thief of joy.\r\n\r\n\r\nThere's always going to be someone younger than you, more successful than you, better looking than you, more in shape than you, but you're not playing the game against them. You're playing the game against you.  And so you need to anchor. Yourself first. And I'm not saying that you forget about all of those things, but it then becomes easier where it's dude I'm stoked for Thomas.\r\n\r\n\r\nI'm glad at 29, he's making a million bucks a year. I couldn't have done that. I wasn't ready for it. I had a lot of lessons that I needed to learn.  So I, it's a balance being content versus being complacent. So I,  I don't know if I've ever been either one of those. I don't know if I've ever been complacent or content like ever.\r\n\r\n\r\nI don't know. I don't know what the right word is. Maybe like satisfied versus content. Cause like a lot of entrepreneurs are like this where  they're never satisfied. But there is a point in time where you're like, okay, but I am content. But that, but what does that mean? Does that mean I no longer strive for anything?\r\n\r\n\r\nI don't know. It's something that  a lot of people work through. Would you look to expand like a service line or would you look to buy a business?  So we would do either or, and so really like when it comes to like scalable right now, we have services, which is CFO\r\n\r\n\r\n and bookkeeping and will expand the  tax It's funny, you literally said the steps that we're going through, we'll expand the tax starting Jan one of 2025, we'll start filing 2024 taxes. I granted services is more like the bookkeeping side, but That's Connor and Josh who runs that. So that's the, I'm outside of bookkeeping, but they're like launching that, et cetera.\r\n\r\n\r\nI want to work on more of the product side, which is more like products and product types services. And so we've actually launched something over there. And so that was just something I had an idea and we wanted to launch that. However, we would, you're not talking about buying a new business. You're just talking about expanding your current business.\r\n\r\n\r\nYes, but we will buy something when the opportunity presents itself on that side, because if a particular. There's a software tool we use called causal. app. If that ever came for sale, we'll go buy it because it fits into what we'll do is there will be a day where like we are hunting and buying and we imagined something will come up for opportunity there.\r\n\r\n\r\nAnd so we will be on the hunt to buy things. We just don't know exactly what it will be yet, but we will also start things in the meantime. So I think there's a little bit of a difference between  expanding current service offerings and new businesses.  Buying a software, in my opinion, is a new business, even though you're using it like that's a new business.\r\n\r\n\r\nBut going from like bookkeeping CFO work to tax work is to me, an expansion of your current business because they're close enough in scope.  So  with that being said,  I was talking to somebody about this.  It sounds like you want to get to the point where you have a hold co, right? Where you're like, Oh, cool.\r\n\r\n\r\nNow I've got multiple businesses. Theoretically. Yes. Yeah. Theoretically. And until you're at the point where you are not the person producing the product,  you shouldn't buy another business.  And right now you're the person producing the product.  So forget about everything else. That is the problem you need to solve, whether it's using John Matzner's framework and like outsourcing it to a VA, whether it's recruiting another CPA that actually comes in and takes your place. \r\n\r\n\r\nThat is your bottleneck right now. And that's really what's standing in between you and whatever you want to do next. So you need, I would say you need to focus on that and getting that fixed. And then once that is taken care of  by whatever business you want, grow in whatever place that, that makes sense.\r\n\r\n\r\nBut until that's solved.  You're going to be hurting, I think that's going to be a page, right? Yeah. And so that leads me to the, to why I think you, you give useful advice. And also like working with Chris is is that typically just how it goes? You might buy something or start something and you just hammer hard on that until you hit a certain level.\r\n\r\n\r\nLevel scale before you move on to the next thing, or is that in general the framework? Like maybe you buy something, you focus relentlessly on that until you're not.  The bottleneck and operations. And then you move on to the next thing. Is that in general, how you guys approach it? Cause I just, I was impressed by just how much you're doing, but I'm like,  I'm struggling with my one thing right now.\r\n\r\n\r\nYeah. Again, it's social media. So we're like posting our wins and not necessarily all of our fails, but it's a resource question and really you've got to get these businesses launched, you've got two resources to play with. You've got time and you've got money.  And when you don't have money,  then time becomes the resource that you have to spend.\r\n\r\n\r\nSo yeah, if you launch something,  then we have to be in the weeds, in order to get it spun up. But if you have resources, which, thankfully we've been in that position recently last few years,  then we go out and hire an operator. We find an operator, we bring them on. It still takes time and energy to get a spun up, but we're now partnering with somebody  who's putting their time and sweat equity into growing that business.\r\n\r\n\r\nSo yeah, in the early days when we started new stuff, of course it was us. It was all of our time, energy, it's everything we put into it. But as we've gotten more resources to play with, And it doesn't require us to be the operator day to day. Now we shift to finding partners to bring in, to actually run those businesses. \r\n\r\n\r\nGotcha. Gotcha. Yeah. So it's probably not quite at that, that inflection point yet. It's we're trying to get there, but it's probably yeah, no, just focus relentlessly on what I'm doing day to day and It's again, it's like what Madsner said, like reducing that into the smallest box per week possible without degrading your quality.\r\n\r\n\r\nAnd said a different way. I said this to Sam Thompson when I met with him, you may be looking for someone to replace you, right? Oh, I need to find, I need to find another me. But the truth is there's not another you.  And the reason that the business is scaled has been because of your unique skillset, your talents, your intellectual capital. \r\n\r\n\r\nSo thinking that you are going to hire one person to replace you it's not smart thinking because otherwise that person, like they'd probably start their own company, right? Like it's just a level of skill and talent and expertise.  So I would think about it again in the way that John's thinking about it, it's like identifying what parts of your job you can outsource, what things you can get off of your plate to free you up enough.  To generate the revenue in those other areas that then allows you to hire somebody to eventually take the things off of your plate that you're currently doing. Yeah, I would compartmentalize it because you're not going to find one person to replace you.\r\n\r\n\r\nYou're probably going to hire one person to do a specific area of tasks and then somebody else and then somebody else. And then eventually you've got two or three people who have taken those tasks  off of you and are specializing. So now you're able to scale more and you're just in a better position to grow. \r\n\r\n\r\nGotcha. Gotcha. Interesting. Yeah. I guess I hadn't thought about  like hiring multiple people to replace the outputs. Cause I guess I just always maybe that's, maybe that was a bad assumption by me is that somebody would just do everything that I'm doing. But it's okay, maybe it's maybe you specialize three people to do really excellent work at these more siloed portions of our job.\r\n\r\n\r\nCause cashflow forecasting to me is different than P and L forecasting. Cause we just do them in different ways. And so maybe you specialize like that. I heard this analogy recently that rung true with me. When you're starting your company, when it's a startup,  it's like a basketball team. \r\n\r\n\r\nYou're playing all five positions at that point. You're, you're the shooting guard, you're the point guard, you're the forward of the center. You're also the coach or the GM, you the owner,  but as you grow and as revenue supports now you're able to like, okay, I can hire a shooting guard.  Oh, you know what?\r\n\r\n\r\nI'm definitely the best point guard, but I could hire a center to come and replace me.  And then all of a sudden you're at the point where you're like, Oh, I don't even need to run the floor anymore. I can just coach. So now I've got five people who are doing each of those roles really well. And now I'm coaching. \r\n\r\n\r\nAnd then all of a sudden you're at this point where actually I could get someone better than me who's who could coach. I, I could just get in the GM box. And then, then I'm in the owner position.  You're still on the spot where you're like running the floor, right? You need to find some other people who can come play those positions with you.\r\n\r\n\r\nAnd that's where I'm saying like, Chris and I are luckily more in the position of we're probably like the coach at this point. We're not having to run the floor. Every time, but yeah, that's where you are in the maturation process of your startup. So think of it in those terms. It's okay, I don't need to find one person who can play all five positions.\r\n\r\n\r\nI need to find the shooting guard. Oh, you know what? I'm going to find the center. I need to find the power forward, whatever it is. Yeah. One is there's a couple of things like I love about that and I obviously do because basketball is my favorite sport and I did play point guard. So yeah, no, I definitely, Yeah.\r\n\r\n\r\nSo I definitely ran everything and took on certain burdens. And so other people wouldn't. But no, you're right. It's like Kyle Corver. He specialized in shooting and that's why, LeBron recruited him at the end of Kyle Corver's career. Cause he's I just need a guy who's a sniper.\r\n\r\n\r\nTo help me in 2018 my last year in Cleveland. It's like that type of, yeah, you need to figure out. You need to figure out what the, what your next hire is. Again, using the basketball analogy, it's okay, if you're the point guard and that's going to be the last thing that you give up are the point guard skills, then hire the center, hire the route forward, hire the, the stretch three, whatever the position is that you're going to, that you're going to hire for, but hold onto what you're best at for as long as you need to.\r\n\r\n\r\nAnd then eventually you'll replace that as well, but you're not going to find one person to replace all of those things. Yeah, that's a good point. That's a good point. And that's yeah, that's where like Sagan comes in. They'll help me hire a bunch of people just an army of analysts sit behind me and replace me.\r\n\r\n\r\nYeah, that's could be, yeah, maybe that's the strategy. Yeah. Was this helpful at all? Was it yeah, no, cause it wasn't I know a lot of times it's like buying businesses or somebody who recently bought a business, but I was trying to think through you've just gone through, I know each  You know, buying a business is definitely on my horizon, but I was just like, I just don't know how I'm ever going to get there.\r\n\r\n\r\nAnd you'll get there. Sure. Sure. And so no, I just wanted to hash it out a little bit because sometimes I'm always trying to look for people ahead of me who who are wise, and you might not admit to being wise, but I think you just people who are wise beyond. Where I currently am.\r\n\r\n\r\nSo I don't know. I appreciate the time. And it's a, yeah, of course. Let me know how it goes. I'd love to hear an update at some point.  Yeah, sure. I got your email. I'll let you know. All right. Okay. Sounds good to me. It's good talking to you. Yeah. You too, man. Talk soon. Good luck. See ya. See ya.",
  "metadata": {
    "duration": "",
    "date": "2024-05-17",
    "platform_source": "Google Drive"
  }
}