{
  "episode_number": "97",
  "episode_title": "You DON'T Need to Be a FOUNDER to Be SUCCESSFUL (Here's¬†Proof!) with Emily Holdman",
  "guest_name": "Emily Holdman",
  "business_name": "Permanent Equity",
  "transcript": "﻿Nik (00:00\r\nNik (00:00.492)\r\nWe'll cut this beginning part anyway, so it's nothing too crazy. All right. I want to start by asking you to, I don't necessarily want to hear exactly what you do on a day-to-day basis yet. I'm curious on the history of Emily before permanent equity and how you found it and sort of where you've come because you've got a really interesting background. You've got a really interesting role. And I think it's just really\r\n\r\n\r\nfor people to hear a non-traditional sort of maturation.\r\n\r\n\r\nEmily (00:34.994)\r\nYeah, I think the short version is that it was very non-traditional. So I went to school for journalism and economics.\r\n\r\n\r\nAnd sort of the reason was that I really enjoyed writing and I really enjoyed math. And so I kind of went into separate directions with those. But I really didn't know what I was going to do career wise, headed into college and then sort of took the attitude of saying, I'm just going to take internships every summer and really figure it out. And so I stayed in the marketing vein for the internship and did a couple between my\r\n\r\n\r\nfreshman sophomore year sophomore and junior junior year and then between junior and senior year I went out to one of the film studios in Burbank California and worked in major motion picture publicity and that was awesome and I thought that I had found my career for a lot of reasons but it was also a weird time so it was kind of a lead up to the great recession and that experience was incredibly informative to me just because you know there were sort of\r\n\r\n\r\nlong-term career prospects, but also as a public company. And there were lots of things going on within said public company at that time. But I really enjoyed the work. And I enjoyed sort of a Midwest work ethic inside of a West Coast based company. I got to work at 7 a.m. every day. And there were just a few people there, including like major leaders of the organization. So I got incredible access to people and get super inspired. But\r\n\r\n\r\nI told the story before, my dad always just like instilled in me and nobody's off limits. And so just contact people and get to know them. And so I did that in that role. But then that translated into, as I was looking for opportunities, post graduation, trying to figure out what to do, I intended to go back out to Burbank. And then that did not work out because they were on a hiring freeze. And so I really had to figure out\r\n\r\n\r\nEmily (02:35.59)\r\nlast minute what my new career path was going to be. And I was journalism major, so I started looking for weird opportunities through newspapers and ended up finding an article about Brent B. Shore. And at the time he was a marketing oriented entrepreneur and had made a couple of significant investments in camera technology, which I was familiar with based on the role that I had played.\r\n\r\n\r\nin the film industry. And so with that in mind, I reached out to him on LinkedIn, didn't know him, had no, it was super cold. And he was kind enough to respond. We ended up having this like long exchange online in which it was never really about a role, if that makes sense. It was more about just like, how do see the world? What would you be excited to work on? What do you consider to be your core talents? And then me asking him, you know, so what are the business challenges you're facing right now? Like, what are your aspirations for the company?\r\n\r\n\r\nAnd every once in a while I'm like, yeah, yeah.\r\n\r\n\r\nNik (03:33.006)\r\ninterrupt you. I'm going to interrupt you for one second.\r\n\r\n\r\nEmily (00:01.572)\r\nSo we're going back and forth and then he invites me out to interview and he grilled me for four hours. So I like to tell people that just to say, you know, like it wasn't, it was definitely a, I'm feeling this out. He was not convinced he was going to hire me. And then he ended up creating a role for me. And the opportunism of that was just that he seemed to have just an incredible entrepreneurial spirit, big ambitions.\r\n\r\n\r\nNik (00:08.27)\r\nIt's awesome.\r\n\r\n\r\nEmily (00:28.762)\r\nAnd there were some ties for me personally that made the location interesting and sort of the opportunity interesting at that point. And that's, so I went to the University of Missouri, which is based here in Columbia. And that's where I knew them. I'm like a Midwest girl through and through. So was born in Dallas, mostly raised in Indy and then lived in St. Louis for a short stint before going to school. Yeah. Yeah. My future husband was still here. So that was part of it.\r\n\r\n\r\nNik (00:36.43)\r\nBecause where did you go to school?\r\n\r\n\r\nOkay. And are you from that area?\r\n\r\n\r\nNik (00:46.989)\r\nOkay.\r\n\r\n\r\nNik (00:51.918)\r\nOkay, so there was an appeal, there was a big appeal to coming.\r\n\r\n\r\nNik (00:58.111)\r\nYeah.\r\n\r\n\r\nEmily (00:58.894)\r\nand, and so it was a good fit all around and, I, you know, just jumped right in and he was definitely running what I'm sure he would call today a startup, right? Like trying a bunch of things, something stick. and then a few months into my, my role, he was approached about buying a business for the first time. And so very quickly things started to shift even further.\r\n\r\n\r\nThat business was supposedly a marketing firm, but it's really a government services contractor focused on recruitment marketing. And so there were so many cool attributes about that business. But the big things were, it didn't operate the same way our businesses did. It had three to seven year contracts, long standing relationships, and was repeatable, right? Whereas we were doing a lot of project work, agency of record work.\r\n\r\n\r\nwith things constantly shifting. And so we found the appeal in the business model. He began working on that. I worked on some of our existing businesses for a while. But as we continued to see those types of opportunities in the market, that's how we began to focus on investing opportunities. And at that point, we... Go ahead.\r\n\r\n\r\nNik (02:11.79)\r\nWhat was the original business that you were working on before the acquisition?\r\n\r\n\r\nEmily (02:17.624)\r\nSo it was three businesses. We had a market research firm, a commercial production firm, and then what you would refer to as a media placement agency with a small strategic advisory component to it as well.\r\n\r\n\r\nNik (02:31.95)\r\nAnd for you, obviously there's a job, Missouri, you and Brent hit it off, the business, like of the businesses, what was the original idea of why you would come in? Was it your film experience?\r\n\r\n\r\nEmily (02:44.468)\r\nNo, not at all. It was more just like, let's see what we can create in terms of further business lines that are marketing strategic communications oriented. So initially it was digital services, then it was focused on growing major client accounts and on agency record basis. And then we had this market research arm and there were some political angles on that that we explored for a while. And then we started a firm that was oriented with PR.\r\n\r\n\r\nso there were several different things that we were just like pulling at. and I liked, you know, trying to generate new business and looking for opportunities to see how we could expand. And at that point we were like young and hungry, right? Like we would try anything. and it was a really good learning ground because we got to see, we got to see and pitch a lot of businesses on working with us, but we were always in a service provider role.\r\n\r\n\r\nAnd comparatively, when we made that first investment, was like, once you're on the cap table and you're working with people and you've got aligned incentives to grow the business, it was just a whole different ball game. But coming from a background of like trying to help businesses generate more demand and thinking about, you know, sort of instead of the scarcity complex that I think a lot of investors come from of like, how do we cut costs? How do we keep things slim?\r\n\r\n\r\nwe were always oriented with like, do you make a bigger funnel? How do you grow the business? Like, what are other ways to package what we do? And I think that that helped us as we made that transition, because we just always looked at, you know, what the business is, right? Like, what's the positive analysis, but also like, what could it be? And, you know, how can we move towards that?\r\n\r\n\r\nNik (04:24.514)\r\nYeah. How long were you there until that acquisition happened? How long were you with permanent equity?\r\n\r\n\r\nEmily (04:32.013)\r\nLike, like maybe nine months. It was, it moved quickly.\r\n\r\n\r\nNik (04:34.934)\r\nOkay. And then tell me, tell me what, what was your starting salary when you joined Brent and like, what was your frame? Were you like a new grad and you're like, I'll take anything I can get or were you kind of, you weren't mid career? Okay.\r\n\r\n\r\nEmily (04:49.078)\r\nyeah, I was super hungry. Yeah, no, would take, I would take any role now. I mean, I had like a cost of living, but actually I've had this conversation recently. I don't remember what my starting salary was, but I remember it was like maybe 30, $35,000. Like it was not a lot of money. and in that, like, it was actually really empowering because I was able to live off of that. Now I have a family now. Things are, things are different.\r\n\r\n\r\nBut I think that there is an empowerment when you're young and you are kind of like scraping by and you're seeing sort of like your work yield results. Like you learn that you're capable of, you know, starting from scratch, of finding a new opportunity of living on, you know, a combination of macaroni and cheese and like chicken nuggets. You can do that for a while. I, yeah, I try not to, but it...\r\n\r\n\r\nNik (05:36.504)\r\nHey, I still eat chicken nuggets. I love them.\r\n\r\n\r\nWhen was this? What year was this?\r\n\r\n\r\nEmily (05:44.73)\r\nSo this would have been 08 and 09. Yeah.\r\n\r\n\r\nNik (05:47.542)\r\nwait, and don't I. Okay. So, so you were, did you? Were you in the middle of that recession? Like, was it a really bad job market? And you were just stoked to have a job? Or were you looking at other\r\n\r\n\r\nEmily (05:57.764)\r\nyeah. mean, most of my friends ended up going on to grad school. Like they just didn't enter the job market. I mean, the job market was nil. Like, like I said, I was supposed to have a role, that was promised to me. And then they went on a hiring freeze. And I mean, that was true for a lot of my friends. were, they just had job offers rescinded headed into summer of nine. And I mean, you just had to regroup and figure out what to do. And for a lot of people, was continuing their education.\r\n\r\n\r\nAnd for me, like I desperately wanted out of classroom and into the real world and just like the opportunity to prove myself and to get my hands dirty, like to start to learn something that wasn't theoretical and something that was practical. And so for all those reasons, like I wanted to find something where I could really dig in. And yeah, I looked at other things, but I think what really attracted me to like Brent and to the opportunity generally was that.\r\n\r\n\r\nI knew I was going to have a fair amount of autonomy and the ability to try stuff. And that proved to be very, very true.\r\n\r\n\r\nNik (07:00.782)\r\nYou seem very curious. Is that fair?\r\n\r\n\r\nEmily (07:05.2)\r\nYes, yeah, that yes. absolutely. Core core tenant of my personality.\r\n\r\n\r\nNik (07:10.67)\r\nthe same, you know, I'm, the same way. And I've noticed with curious people in particular is they get restless because they just are like, well, how does that work? How do you do that? Right. And you're very, you're prone to be in positions of figuring things out. I am, unfortunately don't have the skillset to be the day to day guy who's like every single day clocking in, making sure the trains run on time. That would be a disaster if I was that guy, but problem solving, figuring stuff out. I love, I love that stuff.\r\n\r\n\r\nEmily (07:19.679)\r\nRight.\r\n\r\n\r\nEmily (07:24.441)\r\nMm-hmm.\r\n\r\n\r\nEmily (07:28.932)\r\nMm-hmm.\r\n\r\n\r\nNik (07:38.264)\r\nDid you find that your background was actually a help when you moved into this role? Like even though yeah, it's weird. You're like economics and journalism. Did you find it to be a help?\r\n\r\n\r\nEmily (07:47.758)\r\nI actually went back and taught at the journalism school for a couple of years just as an adjunct. And the specific thing that I wanted to create a class around was the concept that what you're studying can translate into a much broader set of career paths than you may appreciate going into that particular degree track, right? And so in the case of journalism, obviously there are traditional journalism oriented roles, many of which are challenged in today's market.\r\n\r\n\r\nNik (07:51.787)\r\nwow.\r\n\r\n\r\nEmily (08:17.692)\r\nright? But it doesn't mean that being a good communicator and specifically being a good writer is not a valuable skill set and a transferable skill set and a broader breadth of careers. And so that was an example to me of like, absolutely, if you like break down what I studied, what I actually was naturally gifted towards, like, those are all things that play core roles in what I continue to do.\r\n\r\n\r\nbecause we have to uncover. So to your point, I was having a conversation with a colleague the other day and we were talking about, sort of like, you the person who keeps everything on the rails or are you the person that looks for new opportunities? And like, I am absolutely the person who likes to uncover things. I'm really naturally pretty scrappy. And then I like seeing them, we start to assemble.\r\n\r\n\r\nBut once it gets to a structural level, I have colleagues who are way, way better at that. I'm not totally allergic to process, but it's not where I live and breathe every day. So looking at companies is actually fascinating to me, because you have what it presents as, and then you've got to go figure out what it actually is. And that process I love. But if it's like, we know what we're doing, we've been doing it for 10 years, and we're just going to continue to execute on that.\r\n\r\n\r\nthat can absolutely be the right strategic decision. I'm just not the right person to do it. So there's the balance of like, yeah, right seat element to it.\r\n\r\n\r\nNik (09:47.67)\r\nI have a question for you. And it's just between us. Brent doesn't have to know. He's really terrible, right? No, I'm just kidding. He seems like a people collector. Like he seems like he meets somebody and is like, they're I don't know what the spot is for them. Maybe I'm projecting, but they're in his orbit for a period of time until there's an opportunity or he just brings them on and then finds the opportunity. that am I reading that right?\r\n\r\n\r\nEmily (09:54.932)\r\nSure.\r\n\r\n\r\nEmily (10:06.283)\r\nNo.\r\n\r\n\r\nEmily (10:15.231)\r\nHe is really great at seeing somebody for the things that are not readily apparent and maybe even things about themselves that they don't already know. And then to the extent that there is a relevant opportunity. Now, back in the day, when I started, the world was the opportunity set. We didn't know what we were really focused on. Now that we have strategies, it has to make sense. But to the extent that like,\r\n\r\n\r\nNik (10:36.802)\r\nYeah.\r\n\r\n\r\nEmily (10:42.866)\r\nYes, he absolutely gives people a wide berth with which to like make of it what they will. Right. And I think that that's worked for a pretty good size group of people over time.\r\n\r\n\r\nNik (10:55.758)\r\nWell, it's, it's an important skill set. mean, I haven't built anything near what you guys have built. But as I was building companies in that phase, where we just like trying to figure it out kind of where you are doing the first acquisition, you just you want people who you trust and you know, are curious, like to me, curiosity is the superpower. Because if someone's curious, they're going to figure it out. And I don't necessarily need them to have specific skill sets. But it's like, okay, cool. Christy is her name. She worked with me at Bluebird is like, Christy, I don't know where to put you.\r\n\r\n\r\nEmily (11:05.27)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nEmily (11:16.122)\r\nMm-hmm.\r\n\r\n\r\nEmily (11:21.091)\r\nYep.\r\n\r\n\r\nNik (11:24.532)\r\nwant you on my team. Justin, I want you on my team.\" And then you surround yourself with really good people and you figure things out as you go. in my opinion, it's a really, really valuable skill that people under-index on and over-index on the technical ability or the funding or the idea. And I'm so much better than XYZ company that I'm competing against.\r\n\r\n\r\nEmily (11:44.037)\r\nsure.\r\n\r\n\r\nI think that's true. think that over time we have grown to appreciate specialization more than we probably did back then. Like there are people that the expertise is just so much more valuable than us like sitting around reinventing the wheel for no reason. Right. And so we've grown to appreciate that over the years, but absolutely I think there's an element of just like being willing to jump into a variety of different scenarios and to your point, like figure it out that that will always be valuable.\r\n\r\n\r\nNik (12:13.486)\r\nYeah, it's, I mean, and you're at a different phase, right? Like when I was a startup sub 1 million in revenue, it's very different than when we were a $30 million company. And the hard part for me is when I hire people who are really good in those early days, and then we outgrow their skill set, or we outgrow them. And it can become hard because I don't have necessarily a place for them anymore. They're like, well, I don't like processes. And it's like, well, we need the processes because we're too big to just wing it. And I look at people like you,\r\n\r\n\r\nEmily (12:15.068)\r\nThank\r\n\r\n\r\nEmily (12:36.174)\r\nMm-hmm. Mm-hmm. Right.\r\n\r\n\r\nEmily (12:43.609)\r\nMm-hmm.\r\n\r\n\r\nNik (12:43.694)\r\nThen I look at Kelly, Clayton, I'm trying to think if there's anybody else who comes to mind. They're starting new businesses within permanent equity. I think that's fascinating. What's interesting to me about you is you're not spinning out. You're in the permanent equity, but you have a very entrepreneurial spirit. Within 30 seconds of talking to you, like you're super bright, you get it, you're curious.\r\n\r\n\r\nEmily (12:46.777)\r\nyeah, Kelly Morgan. Mm-hmm. Mm-hmm.\r\n\r\n\r\nEmily (12:55.758)\r\nMm-hmm. Sure.\r\n\r\n\r\nEmily (13:03.62)\r\nyou\r\n\r\n\r\nNik (13:12.498)\r\nyou have action for bias or bias for action, excuse me. Why haven't you gone and done something different? Like what keeps you intellectually stimulated enough to stay where you are?\r\n\r\n\r\nEmily (13:22.682)\r\nSure. I mean, I think there's two sides to this answer. There's sort of like the personal side, and then there's professionally sort of how things have played out. On the professional side, I have seen how our organization has compounded over the years, just in terms of learnings, in terms of the talent represented among our team growing, and the capabilities that we have now versus like 10 years ago. I mean, it's just radically different. Like I've been here for 16 years now. Like a lot has changed over that period of time.\r\n\r\n\r\neven if my fingerprints are not over parts of it, and that's certainly the case, it is incredible to see what it's become. And being a part of something that has that level of capability versus purely betting on myself is, I think, just, I believe in it more, right? If I were individually going to acquire a company, I know all the gaps that are represented by my colleagues that wouldn't be filled by me.\r\n\r\n\r\nand I would feel that deficit from day one. So I just think it's a better offering to the companies that we partner with to be part of a bigger team. And I think like, we try to be really good at it and I enjoy the people I work with and I like having a team and I'm one of those people, like I'm a verbal processor. So I talked to my teammates a lot about stuff and, and sometimes you need to be checked, right? Like I need to be checked. And so, my team does that for me regularly. And I think if I were.\r\n\r\n\r\ntrying to do that on my own on an island, like sanity may be questioned at some point in time. And then, so I just think there's an element of it that like scale is helpful on that side. And then on the personal side, I don't, great recession had a meaningful impact on my family. And it's one of those things that had long-term effects for me from a risk tolerance standpoint. And in that way, like I...\r\n\r\n\r\nNik (14:55.758)\r\nYes, I 100 % agree, yes.\r\n\r\n\r\nEmily (15:19.267)\r\nAgain, like setting up my own shingle and trying to do something just to say that it's mine and mine alone doesn't make sense to me. And... Yep.\r\n\r\n\r\nNik (15:27.278)\r\nI got married in 2008 and my wife is the daughter of a CPA and she's German. I mean, she's not actually from Germany, but her grandma's from Germany. But she's got like the, is the transfer run on time? was able not to run at all. And so when we got married in the first two months was when, it was October of that year that the market just crashed and I didn't know anything. I hadn't even gone to school. I'm actually a musician.\r\n\r\n\r\nEmily (15:33.782)\r\nMm-hmm.\r\n\r\n\r\nEmily (15:49.103)\r\nMm-hmm.\r\n\r\n\r\nNik (15:53.646)\r\nI ended up going to school. majored in economics and political science. So wasn't quite journalism, but there were two, you know, reading things, but I've always been creative. And I thought I knew what I was doing. And I told my wife, I'm like, sweetie, I know the market crashed, but we should buy some Bank of America stock. And I could, and I convinced her to buy, was $200 worth of Bank of America stock. I still remember this. And, and we bought at $20 after he had fallen from like 40 or 50, wherever it was. And.\r\n\r\n\r\nEmily (15:58.01)\r\nSure.\r\n\r\n\r\nEmily (16:09.549)\r\nYou\r\n\r\n\r\nEmily (16:14.424)\r\nYep.\r\n\r\n\r\nEmily (16:18.522)\r\nMm.\r\n\r\n\r\nEmily (16:22.135)\r\nMm-hmm.\r\n\r\n\r\nNik (16:23.136)\r\nYou know the punchline to this Bank of America ended up falling all the way down to $5. And we didn't lose a significant amount of because we never sold, but we held that stock for more than 10 years. And we finally sold, you know, when I think we got up to like $300, but you look at the time value of money and all those things. That one instance had a greater impact on our financial journey.\r\n\r\n\r\nEmily (16:26.958)\r\nMm-hmm.\r\n\r\n\r\nEmily (16:38.746)\r\nMm-hmm. Right.\r\n\r\n\r\nEmily (16:47.903)\r\nMmm. Yum. Yum.\r\n\r\n\r\nNik (16:48.342)\r\nprobably anything else in our marriage because it literally took her years to get over the fact that's like, Nick doesn't know what he's doing. so I didn't start a business until 10 years into our marriage. to your point, I think that's really interesting when you're coming of age, especially 08, 09, great financial crisis, it definitely has an impact on you. it definitely\r\n\r\n\r\nEmily (17:00.26)\r\nMm-hmm.\r\n\r\n\r\nEmily (17:05.166)\r\nMm-hmm.\r\n\r\n\r\nEmily (17:10.392)\r\nYeah, I I.\r\n\r\n\r\nI was a little too good with numbers to know the odds, if you will, of a startup being successful. And in that way, that plus I had close family members who were really in the early days of the Great Recession, I felt the impacts of that with layoffs and whatnot in transportation and some of the industries where it hit 2007 into 2008, early and dramatically. And it was prolonged effects for a number of years. looking back, retrospectively,\r\n\r\n\r\nit was an incredible time to enter the market. like...\r\n\r\n\r\nyou know, it was an incredible time to like learn about businesses and to be hunting for businesses. So like I began really hunting for businesses to invest in in 2011. And at that point in time, if you can imagine, it's like people are barely coming out of the recession, right. And every month is like a radical change in their performance oftentimes. And you're trying to figure out like what's stable, what's durable, all of those things. And it was a really interesting time in order in which\r\n\r\n\r\nNik (18:10.989)\r\nMm-hmm.\r\n\r\n\r\nEmily (18:15.628)\r\nto think about those types of things. And I got to follow some businesses for like a series of years because we didn't make an investment in 2011, right? We continued to like review things, gain literacy, and try and figure out sort of what our criteria were going to be ultimately. And we did that for a number of years. So there was a lot of time of just like educating ourselves and getting comfortable and finding, you know, stuff that we liked that didn't go anywhere and stuff that we didn't like that we spent time on trying to figure out why other people liked it.\r\n\r\n\r\nNik (18:45.442)\r\nDid you when 2020 when COVID hit, what was your mindset? Were you like, pattern recognition? This is just like the way, you financial crisis, let's go on or was it it was very different, right? But\r\n\r\n\r\nEmily (18:45.535)\r\nAnd it was just like a huge learning. Yep.\r\n\r\n\r\nEmily (18:56.65)\r\nNo, it was very different. It was very different, but it was also a recognition that there will be a myriad of results out of this event. It was a global event, and the Great Recession was a global event. so don't judge too early, I think, would be the learning that comes roaring back. And also make sure that you have contingency plans. We had a large portfolio of businesses by 2020.\r\n\r\n\r\nAnd so internally, the underwriting was like, make sure we plan for a variety of things to happen, right? We can't be convinced that this will be solved in three months or six months or nine months. We really need to have a lot of optionality going forward, both in terms of like financially, so thinking about cash management, but then also strategically, right? If you're gonna operate in an environment where people can't go into restaurants or buildings.\r\n\r\n\r\nthen you've got to make plans. And so that was ultimately, I think, what came back. But then looking at businesses in 21, I think that's where the great recession mentality came back, which is to say, people have heard the K recovery. Some businesses did phenomenally well, and some didn't do well. But nothing was normal. There was no normalization in it.\r\n\r\n\r\nAnd anyone who was doing well was just bragging about it. mean, any advisor who had a business to sell that had somehow changed their growth curve during COVID, they were like, this will go on forever. They're just on a totally different angle now. And it's like, it just doesn't work that way. It was a point in time. It was a weird environment. And acknowledging that, there's ways to share risk if you do believe that that's going to continue. There were deal structures to be discussed.\r\n\r\n\r\nNik (20:36.568)\r\nMm-mm.\r\n\r\n\r\nEmily (20:49.166)\r\nBut a lot of them, I think, were overconfident in the fact that this was now the quote unquote new normal. And I still don't know that we're there.\r\n\r\n\r\nNik (20:55.434)\r\nIs there anything in the last few years, post-COVID, that you think people just really get wrong?\r\n\r\n\r\nEmily (21:04.63)\r\npeople get wrong.\r\n\r\n\r\nNik (21:06.412)\r\nin the SMB community or even in investing.\r\n\r\n\r\nEmily (21:11.214)\r\nI mean, well, I mean, this opens up a broad range of subjects. I think in the SMB community, people aren't creative enough, I think is the overarching comment I would make. Well, that, I mean, recurring revenue service-based businesses is apparently what everybody's going to buy. like, you know, I think to some extent, you can go look for them. And some of them are great. But we saw HVAC businesses, you know, 12 years ago.\r\n\r\n\r\nNik (21:19.507)\r\ninteresting. What do mean?\r\n\r\n\r\nEmily (21:40.888)\r\nand we didn't buy them and there were reasons. And I think, you it depends on what kind of work you want to do post-close and how you're thinking about growing the opportunity set. And I just think that people are too quick to follow a trend instead of figuring out like what they're actually good at, what they actually understand, how they can most make an impact if they intend to work in the business or however they plan to support it. And then to the extent that like they're really...\r\n\r\n\r\nNik (21:47.15)\r\nMm-hmm.\r\n\r\n\r\nNik (21:55.331)\r\nYes.\r\n\r\n\r\nEmily (22:07.55)\r\nyou know, just not readily apparent business models that are fascinating and highly profitable. And if you take the time to appreciate them, I think you find, you know, sort of like a different fishing ground, if you will, compared to where everyone else is. And I think that there are huge advantages to that, right? And like, if it's a service-based business, this is my thing, is like, a lot of them, you could just start it.\r\n\r\n\r\nNik (22:33.315)\r\nMm-hmm.\r\n\r\n\r\nEmily (22:33.37)\r\nSo if there aren't a lot of barriers to entry, and there are a ton of them, the argument would be, why don't you just go start one? And so there are elements to the business model trends that I see talked about most frequently now that I just kind of question, why not be more creative? Why not go find something?\r\n\r\n\r\nNik (22:51.01)\r\nWell, it's in a similar vein. I see people talk about buying a business or like, well, I have no experience in this, but I really want to do X or HVAC plumbing, whatever is the new sexy thing. And they always cite somebody else who's done it. Well, so-and-so did it. I could do it or, you know, they're not that smart. And I did it. And I always go back to like, if I, if I go to the casino, I'm betting every single time. And when you buy a business, it's a bet. It's not a hundred percent surety. It's a bet, right?\r\n\r\n\r\nEmily (23:00.836)\r\nsure.\r\n\r\n\r\nEmily (23:14.66)\r\nMm-hmm.\r\n\r\n\r\nMm-hmm. Yeah.\r\n\r\n\r\nNik (23:20.056)\r\nBut if I have an option between playing blackjack and roulette, if I'm trying to win money, if I'm trying to win money, I go play blackjack. If I'm just trying to have fun, then I'll go play roulette, right? So could you go be successful playing roulette? Sure, you could, but the odds are stacked against you. Why not go play a game where you have better odds? And that's where I go back to what you're saying is, what are you passionate about? What do you think you have a competitive advantage in? Where do you want to operate? Have you done the market research to support your thesis? Because like,\r\n\r\n\r\nEmily (23:25.282)\r\nWe hope to God!\r\n\r\n\r\nEmily (23:29.368)\r\nYes. Yes. Yes.\r\n\r\n\r\nEmily (23:47.342)\r\nRight. And I think most of those people would argue that they're doing that, they just inverted it, right? Like they inverted it and said, I know that the outcomes exist because I've seen what happened to neighborly and I know that there's an exit if I go down that path. And so I'm gonna sort of work backwards and that's what I'm gonna go do.\r\n\r\n\r\nNik (23:59.821)\r\nYes.\r\n\r\n\r\nNik (24:05.368)\r\nproblem is they're cherry picking a sample set, Like, neighborly is the one, but there's the 2000 that failed that you're not looking at when it comes to the odds.\r\n\r\n\r\nEmily (24:08.534)\r\nAbsolutely, absolutely.\r\n\r\n\r\nOf course, right. I mean, there's always a bias in reporting, especially when we're reporting on successes, right? Like that's always going to exist. And I think broadly speaking, it's so, it's a bizarre way to think about it when you are uniquely gifted to do certain things. So like, if, it's you individually and specifically talking about ETA, like if it's you individually, you should be super self-aware about what makes you\r\n\r\n\r\nyou know, competitively interesting, right, and lean into that. So to your point, I think it is, it should be the other way, but too often people are working backwards for the outcome.\r\n\r\n\r\nNik (24:49.006)\r\nAll right, got a random, not random, but an interesting question to ask you. If Emily's brain could go back in time and you know everything that you know now, not necessarily timing with the great financial crisis, because you're like, okay, I'd buy Apple stock or Google, whatever. Now I'm not talking about timing of the investments, but you know how to operate businesses, you know how to evaluate them, you know how to grow them, et cetera. And you were talking to your 23, 24, 25, however old self. Would you buy a business?\r\n\r\n\r\nstart a business or raise a fund or option D other.\r\n\r\n\r\nEmily (25:24.314)\r\nI'm 23 to 25.\r\n\r\n\r\nNik (25:26.87)\r\nYes, but you have that you have all the experience in your brain. I think you go back in time.\r\n\r\n\r\nEmily (25:30.83)\r\nMm-hmm. I still don't think I would do any of those things. I think I would find a really great team to join. Mm-hmm. Just, again, I just, know like the benefits of like a scaled team. And I think that I still, I would not set up my own shingle in one way or another. I do think that...\r\n\r\n\r\nNik (25:36.461)\r\nReally?\r\n\r\n\r\nEmily (25:56.594)\r\nmentorship is such an incredible gift. And I think people don't take it seriously enough. I had a neighbor growing up who I used to go over to his house and like, this was like, you know, AOL internet days. And he helped me to deconstruct. No, yeah, Sloppy disks. Like, yeah, no, way back in the day. And he, I think I was eight years old and he helped me deconstruct a computer, like to really understand how\r\n\r\n\r\nNik (26:11.606)\r\nwith the\r\n\r\n\r\nEmily (26:23.652)\r\nlike the motherboard fit in and what was talking to what in order to power a computer. And then he helped me get this like CD game that taught you how to animate something. And it was one of those like experiences that for me to the point on mentorship, it's like, if you just find somebody who's already really good at something and you can learn from them, it's just an incredible leap forward, right? And in that way, I think that if I have all the lessons I have now, I just know the value of\r\n\r\n\r\nyou know, other people at the table and what they can contribute. And in that way, I still think the team element would be better for me, but it is also partially because of my risk tolerance for sure.\r\n\r\n\r\nNik (27:03.65)\r\nWell, my personality is I hate going in alone, right? So I do not like to go. I'm not the entrepreneur is just going to go build their own business by themselves and sit in the room all day. Like I think that sucks and I think it's boring and it doesn't add spice to your life. Like for all those reasons, but there are a lot of people who are young or maybe they have some experience and they're like, I want to own my own business. want to be in control of my own destiny and I want to be an entrepreneur for those types of people.\r\n\r\n\r\nEmily (27:10.201)\r\nYep.\r\n\r\n\r\nEmily (27:16.024)\r\nYep. Yep.\r\n\r\n\r\nEmily (27:26.34)\r\nMm-hmm.\r\n\r\n\r\nEmily (27:30.222)\r\nMm-hmm.\r\n\r\n\r\nNik (27:31.404)\r\nWhat do you recommend? What would you think would be the best way to get into entrepreneurship? Buy, build, or raise a fund?\r\n\r\n\r\nEmily (27:37.994)\r\nI, I think that my general advice, and obviously I would qualify this and say, I think it's super specific on your personality. I think it is super specific on your personality, but I think that for a lot of people, what would be true is that you try to start something because you, you think you're clever. You think you can figure stuff out and the real world will hit you in the face and it will teach you a lot.\r\n\r\n\r\nNik (27:47.032)\r\nNo, you can't qualify it. No, no, we're looking for sound bites.\r\n\r\n\r\nEmily (28:07.41)\r\nright, you will have to see do you have product market fit, you will get told no a hundred times. And I mean, we did this, like we tried to start things that never took off in our early days. And in that way, like it's an incredible feedback loop to know that not every idea is clever. And to try and figure out how do you recruit people onto a team that doesn't yet make any money? And how do you convince people in the mission and like get going? And I do think starting something is like\r\n\r\n\r\na humility builder and people who are otherwise maybe book smart or technically smart in some way. So I think that experience is always helpful. And then you have a better understanding of when you look at a business to potentially invest in or buy, then you can understand like, what is the true barrier to entry? What was the inflection point at which they stopped grinding and they were able to make something scale?\r\n\r\n\r\nWhy are they reputationally better than their competitors? How are they able to maintain their margins and pricing power? Being able to answer those questions and have the humility to know that it's not an automatic and it shouldn't be an assumption that that's actually going to happen, I think gives you a better appreciation if and when you go to to buy.\r\n\r\n\r\nNik (29:15.244)\r\nYeah.\r\n\r\n\r\nNik (29:24.238)\r\nSo I would agree with you. In fact, my personality is very much what you just described, right? Like really get to know it, understand it, plan it out. But there is the other side of the argument that I've heard. And some people would say, well, a bias for action is actually, you just need to go out and do, go out, get the experience, right? How do you feel about balancing those things? Because both of those things are true, right? But like, how do you balance the two of them, acting, being strategic?\r\n\r\n\r\nEmily (29:42.091)\r\nYep.\r\n\r\n\r\nNik (29:54.764)\r\nand not being an idiot, you know what mean?\r\n\r\n\r\nEmily (29:57.048)\r\nWell, I've had this debate with people before who have implemented the strategy of buying something and then basically tearing it down and building it back up. So seeing all the assets and basically, it's like you have a Lego house and you take it all apart and then you rebuild it into what you know will be a better, more scalable system. So I think that, again, this just depends on how you think about the quality of a business that you're investing in and why you're making the investment and what\r\n\r\n\r\nof work you want to do. So where I sit, why would I buy something just to take it all apart? Like I'm buying it because it's already got something worth buying, right? As opposed to I could just start with a bunch of Lego bricks and build my own thing. So if I'm going to start with something that's already been built, then I don't go in expecting to completely over\r\n\r\n\r\nAnd I know that that's, mean, obviously if you're a turnaround investor or a distressed investor, that can't be true, right? So this is stylistically specific to how I think about things, but to the extent that like, I wouldn't want to go in and overhaul something. So I think the bias to action is something that has to be checked against what you're actually trying to achieve in the sense that certainly you don't want to stay stagnant, right? Like you don't want to tread water, you'll get exhausted. The business will eventually...\r\n\r\n\r\nNik (30:55.874)\r\nYou have to, right?\r\n\r\n\r\nEmily (31:18.862)\r\nyou know, just decay, right? Like that's the natural, natural state of things. What you want instead is to look for, you know, the best and highest use of people and the best and highest use of the capabilities of the company in order to really bet to your gambling analogy, bet on the things that are worth betting on, like play the games that are worth playing and make sure that, you know, the business can scale in a way that's structurally stable and that when you make those bets that you're not like,\r\n\r\n\r\nbetting the whole company on it and that you can actually make improvements over time that'll stick.\r\n\r\n\r\nNik (31:54.767)\r\nYou know, you sit in a really interesting position because you look at just a ton of deals, right? You have a lot of deal flow coming your way. So I am very curious to ask you this question. What industries do you really like right now? You said that HVAC is kind of overplayed, but there's some really niche industries. What do you think is really cool in businesses maybe that people aren't looking at?\r\n\r\n\r\nEmily (32:20.408)\r\nOkay, so I really pay more attention to business models than I do to industries. So I am willing to look at a lot of things as long as the margins are above, net margins are above 15%. And the business has reliably generated meaningful profits relative to their current profits.\r\n\r\n\r\nfor more than at this point, like seven years. So like it couldn't have started during the recession to our conversation earlier of like timely business models. We wanna see something that has some durability to it and understand how they've confronted diversity and things like that. But I like, I mean, we own a luxury matchmaking firm. And so we've looked at some bizarre stuff over the years.\r\n\r\n\r\nNik (33:05.762)\r\nYeah.\r\n\r\n\r\nEmily (33:10.895)\r\nAnd that is an incredible business. It's operated similar to the way an executive search firm is. And so it's 12 month contracts and it's a business model in which a team is assigned. There's a sort of qualification process as well as trying to scope what they're searching for. And then there's an execution of the search that works similar to executive search. There's interviews, there's feedback loops, like there are all the things.\r\n\r\n\r\nAnd once you dig into it, it's really easily understandable and it's merited. Like it's worth paying for for a certain segment of society where privacy and time and confidentiality all are critically important. And it's a nice business to operate as a result. And so when we find stuff like that, it's like you do have to dig into all those details to really understand how it all comes together. Because on the surface, you can make some pretty, you know,\r\n\r\n\r\ncrude jokes and very easily pass it off as something that's uninvestable. And I think that that's true across a lot of industries. But honestly, like we've made a few investments lately that have been consumer oriented, that have been worked out really well. And we're really, I can't say that, sorry. We've made a few investments in consumer and the opportunity set there is really interesting just in the sense that\r\n\r\n\r\nAnd again, this probably is a bias of mine thinking about the opportunity funnel. But you can find interesting ways to generate new customers and to fill the funnel and to think about your long-term relationship with each customer. And so there are really compelling opportunities in consumer, which has kind of gone out of favor, I think, from an investing standpoint. And then there's stuff that's like super industrial, that's really interesting to get into. like, depending on how you're with the\r\n\r\n\r\nNik (35:02.958)\r\nSo those are usually going to be not 15 % net margins on the industrial side though, right? No?\r\n\r\n\r\nEmily (35:07.898)\r\nHuh? I don't know. Yeah, I've seen some some highly profitable business models in that segment. They may not be, you know, I mean, this is another topic entirely, but like from a power loss standpoint, they may not be a hundred billion dollar market opportunity, right? But they may be like a critical component in a larger industry in which they can command great margins and have very reliable customers, right?\r\n\r\n\r\nNik (35:14.776)\r\nOkay.\r\n\r\n\r\nEmily (35:37.934)\r\nand\r\n\r\n\r\nNik (35:38.03)\r\nSo it sounds like to me, if I were to regurgitate what you're saying, 15 % net margins, that's the first hurdle it's got to clear. Is it profitable, 15 % net margins? Has it been consistently profitable? I want to see seven years worth of consistent profitability. And then I guess the best way I can say it is some durability. You've said it a couple of times, like long-term contracts, maybe some systems, you can't just start up and be a competitor.\r\n\r\n\r\nEmily (36:01.016)\r\nYep. Well, so it's part of, it's, I mean, this is definitely like partially informed by our business model, right? We invest with no intention of selling. We don't want to execute turnarounds or cigar butt strategies where something's sort of petering out over time. We want things that have the capacity to grow. So for those reasons, yes, I want something that's durable. I want something that we can think about, you know, what is this going to look like in 10 years? Like,\r\n\r\n\r\nMoore's law definitely applies. We don't get involved in things that are so technologically advanced. There's a bunch of stuff that's come in lately, teaser-wise, that talks about AI. And AI is a tool in the toolbox, even for small businesses. And we firmly believe in that. But if your entire business model has switched to now be AI-based, that's not a business model that we would find investable right now, because that would be challenging to understand where that's going to be in 10 years, right?\r\n\r\n\r\nNik (36:54.446)\r\nTotally agree.\r\n\r\n\r\nEmily (36:54.744)\r\nSo there are elements of that that we're paying attention to. And then the core tenant that wasn't in the list as of now is the cash flow conversion. So there's a difference between what everybody talks about in EBITDA and what actually sticks to the owner after all reinvestments. So think of capital expenditures, think of buying inventory, think of what you need to keep on the balance sheet from a security standpoint. And as you grow the business, know, sort of\r\n\r\n\r\ndoes growth actually increase the free cashflow, the true discretionary free cashflow of the business? And internally, we call that beer money. So if you cannot buy beer with it, then it's not real. And that's a good litmus test for us oftentimes. But again, that's all dependent on getting like super specific about the business in particular and not about an industry thesis or like a broad, know, everything that has to have 15 % net margins, like...\r\n\r\n\r\nThat's a, I would say there are always exceptions to the rule and it's more about like generally what do we find to be attributes that are indicative of something that we'll probably end up spending more time on.\r\n\r\n\r\nNik (38:03.202)\r\nWell, I mean, it's interesting. think I think anybody who's buying a business should be buying a business with those parameters. It's got to have. It's got to be profitable. It's got to have a history. It's got to be durable because if you're especially like if you're an individual and you go get an SBA loan, you put your house on the line. You're putting your reputation on the line. Why would you get into something that was just spun up in 2020 or and this is me talking right? Like I get it. It can be successful and some people see those strategies in there. But for me is I'm like.\r\n\r\n\r\ndoing my due diligence. I want to see this set of things because I'm trying to mitigate my downside and that's going to be the best way to mitigate it.\r\n\r\n\r\nEmily (38:36.785)\r\nyeah.\r\n\r\n\r\nI mean, margin of safety is always at the end of the day, something that you can rarely overestimate the need for. But a lot of people underestimate it. it is a, I mean, something we have 16 companies in our portfolio. And in every transaction, there was always something that we didn't anticipate, right? Post close. And so you just keep collecting those learnings. But yes, absolutely, if it's like your first\r\n\r\n\r\ninvestment, like as much margin of safety as you can have for things to switch or swing, you want it and it'll help you to learn some very hard lessons and they'll be expensive for a period of time, but they're worth learning. And I think in that way, yeah, it's a core thing to look for.\r\n\r\n\r\nNik (39:19.81)\r\nYes, sir.\r\n\r\n\r\nNik (39:28.312)\r\nWell, this is a listener question and the listener is me. What's the next business that permanent equity is going to spin out? You have the events business that Clayton's running. You have the HR recruiting business that Kelly's running. I think those are the only two that I know of. There could be others that are up and running, but anything on the horizon?\r\n\r\n\r\nEmily (39:32.026)\r\nHahaha\r\n\r\n\r\nEmily (39:46.638)\r\nWe just had our operators summit and there were a couple of categories of things that our operators are interested in the firm helping to support them in. So specifically HR, like not recruitment, which is what Kelly's team at 10th Street Talent does now, and has been a huge leveling up for a lot of our companies and especially in sort of like executive level hiring.\r\n\r\n\r\nand just competitive optionality on candidates. But then there's the side of OSHA regulations and making sure that you're compliant on everything. And that's a huge burden for a lot of the companies, especially if they're in manufacturing or trades. correct. So there's a lot to be done there and we're trying to figure out exactly what that looks like in the future. And then...\r\n\r\n\r\nNik (40:31.522)\r\nYeah, or, you know, crafting separation agreements or yeah.\r\n\r\n\r\nEmily (40:42.094)\r\nThere are still things like in the marketing vein that, you know, we talk about sometimes sort of like the bias of service providers that are really good at something, oftentimes don't want SMBs as clients, they want bigger clients and it does make sense, but it's also means that you're probably not getting the best service as an SMB. So we have some of our companies that have experienced that challenge in various areas of marketing over the years.\r\n\r\n\r\nSo we're trying to figure out exactly what that looks like on a go-forward basis, sort of what should be core within their organization. It's something they do every day. We typically want it to be staffed within the organization so that they're self-sustaining. But sometimes there are things that you would use a service provider for. And maybe we could have a better service that unifies throughout our portfolio with aligned incentives.\r\n\r\n\r\nAnd in that way, there can be reasons why we may offer something that some of the companies may use over time. So I don't think we're done generating our own businesses out of problems we see in our universe, if you will, in our family of companies. But it is representative of the idea that you want to create something that actually solves a need within the market. We're not just going to say, ooh, we're clever. Here's a fun business. It's going to come out of a need that we see.\r\n\r\n\r\nNik (42:03.156)\r\nI it. All right, well, I gotta run to this call. I'm gonna stop recording.\r\n\r\n\r\nEmily (42:06.36)\r\nYeah.",
  "metadata": {
    "duration": "",
    "date": "2024-12-16",
    "platform_source": "Google Drive"
  }
}