{
  "episode_number": "157",
  "episode_title": "She Was Catfished by Sam Parr Then Launched Sam's List with Kimi Green",
  "guest_name": "Kimi Green",
  "business_name": "Sam's List",
  "transcript": "﻿Nikolas Hulewsky (02:21.998)\r\nDon't worry. All right, Kimmy, I am stoked to talk to you today. You and I spoke, I don't know, a month ago and I learned about your business, which was fascinating. Why don't you quickly just, what is your business and how do you make money?\r\n\r\n\r\nKimi Green (02:39.265)\r\nSo Sam's List is a platform where you can easily find and connect with accountants, fractional CFOs, and financial advisors as of two months ago. So that's the premise of Sam's List. And then the way we make money is basically sending leads to the professionals on our platform.\r\n\r\n\r\nNikolas Hulewsky (02:58.404)\r\nHow did you get into this?\r\n\r\n\r\nKimi Green (03:01.205)\r\nI can answer that a couple of ways. Do you think I should answer it like how did I meet Sam to start this business or how did I get into the marketplace arena?\r\n\r\n\r\nNikolas Hulewsky (03:09.968)\r\nwhich one is earlier?\r\n\r\n\r\nKimi Green (03:14.635)\r\nOoh, okay. This will tie in both to be honest with you. I accidentally started a marketplace over a year ago for run clubs. And then a few months later, so that was back in September, September of 2023, I was building a marketplace specifically for run clubs across the U S and while I was working my W to fast forward to February of 2024.\r\n\r\n\r\nI get this random text message from a guy named Sam that was like, hey, I have this idea. It's called Sam's List and people can find a CPA. I thought I was getting catfish.\r\n\r\n\r\nNikolas Hulewsky (03:53.57)\r\nLet's hold on. Let's set the context here. So the cool thing about your business is Sam's List is named after Sam Parr. My first million tech investor. I don't even know like his whole background. So I've heard about Sam's List for a couple of years, I think maybe a year and a half where he's like, hey, I have this thing called Sam's List because it's based off of this other list that his wife, what's his wife's name? Sarah's List, right? Which is about like,\r\n\r\n\r\nKimi Green (04:19.36)\r\nSarah.\r\n\r\n\r\nNikolas Hulewsky (04:22.286)\r\ntop VC companies, I think, I don't know, recommendations on who they should invest in. can't remember exactly what it is. But the gist is, Sam Parr is the Sam in Sam's List. So when you're saying you have this run club that you made and you get this random text from Sam, you thought you were being catfished because there's no way Sam Parr is texting you?\r\n\r\n\r\nKimi Green (04:27.724)\r\nMm-hmm.\r\n\r\n\r\nKimi Green (04:41.751)\r\nCorrect. So a few years ago, Sam had set on a podcast on My First Million, or he posted on Twitter that he was looking for someone who can just send him podcast ideas every week. It would just be a couple hours a week. And I felt, I still kind of think that I have a good pulse on interesting people or cool business ideas that, you know, aren't public companies. aren't raising capital yet. So through my name in the hat and all you have to do is\r\n\r\n\r\nNikolas Hulewsky (04:42.902)\r\nYou\r\n\r\n\r\nKimi Green (05:09.719)\r\ncreate this one pager of what you would have sent him for that week's episode. There were, I don't know, three, 500 people who did this. It was just a Google form that you had to do or submit it through. Got through the last round. It was me and two other people. I didn't end up getting it. And I also wasn't speaking to Sam, like one-on-one how we are right now. It was legitimately, hey, email me this one pager and I'm just going to let you know, yay or nay. So.\r\n\r\n\r\nNikolas Hulewsky (05:31.619)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (05:37.665)\r\nHahaha\r\n\r\n\r\nKimi Green (05:38.517)\r\nThat's what I did. would submit that one pager and wait for Sam to reply back. Great. Next round. Okay. I actually was looking at this the other day. One of them was around the, like a financial meme account liquidity and how he had basically gone from an investment banker.\r\n\r\n\r\nNikolas Hulewsky (05:44.834)\r\nWhat was the idea?\r\n\r\n\r\nKimi Green (06:03.671)\r\nbuilding a meme platform on Instagram, turned that into a six figure business just from memes alone, turned it into a newsletter. And now he is investing in companies. He has built this whole media and investment hub for himself. So he was one of them. Mark from Facebook, that's his name, right?\r\n\r\n\r\nNikolas Hulewsky (06:24.942)\r\nMark who? Mark Zuckerberg?\r\n\r\n\r\nKimi Green (06:26.443)\r\nwait, who's the Facebook guy? No, MySpace guy.\r\n\r\n\r\nNikolas Hulewsky (06:30.724)\r\nTom?\r\n\r\n\r\nKimi Green (06:31.713)\r\nTom, yeah, I had a little write up on.\r\n\r\n\r\nNikolas Hulewsky (06:33.624)\r\nDude, that's so funny. The way you said that, you're like, you know, Mark from Facebook. like, are you, do you just sound on first name basis with Mark Zuckerberg?\r\n\r\n\r\nKimi Green (06:38.423)\r\nYou\r\n\r\n\r\nKimi Green (06:43.005)\r\nI wish Marky Mark. No, Tom from MySpace. I had done a blurb about him building MySpace and then people building social media today. Like now it's pretty, I would say social media is quite self-absorbed. Tom from MySpace just wanted to help us curate our own little like mini business brands. So I had some write up on him and then there's another guy, Pomp, Anthony Pompleano.\r\n\r\n\r\nNikolas Hulewsky (06:44.688)\r\ngood.\r\n\r\n\r\nNikolas Hulewsky (07:02.349)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (07:11.317)\r\nThank you.\r\n\r\n\r\nKimi Green (07:13.631)\r\nYeah, he somehow I saw that he was discontinuing all of his advertisers for his podcasts. And it was a pretty big deal because that was his main revenue driver and people didn't know that at the time. So that was one of the things that stuck out to Sam is he literally was like, I don't know how you knew that.\r\n\r\n\r\nNikolas Hulewsky (07:24.472)\r\nYeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (07:31.086)\r\nOkay, so there was this call from Sam, like, hey, I want interesting guests, send me your ideas of who I should have on. And so then you fill out this one pager of, here are the couple of people that I think you should have on the podcast and why.\r\n\r\n\r\nKimi Green (07:45.385)\r\nNot even, not guests, just topics because on my first million, yeah, yeah, these were just, cause you know, sometimes they will have guests and then other times they're talking about just random little projects or ideas or throwbacks. And so that's what I was speaking on. And obviously I did not get that. but still now it's cool because we'll slack every day and I will still send him interesting,\r\n\r\n\r\nNikolas Hulewsky (07:48.369)\r\njust topics.\r\n\r\n\r\nNikolas Hulewsky (07:53.613)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (07:57.55)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (08:02.349)\r\nGot it.\r\n\r\n\r\nNikolas Hulewsky (08:14.03)\r\nMm-hmm.\r\n\r\n\r\nKimi Green (08:14.423)\r\nprojects and one of them was this guy building a website around purified water and he's just grading a bunch of different water brands and so he tweeted it out. Yeah, he tweeted out within 30 seconds of me sending it to him and it just got so much engagement on his Twitter and then the guy who built it was like, my God, I just got mentioned on Sam's podcast and on his Twitter. So it was cool. So I like to still send him fun stuff.\r\n\r\n\r\nNikolas Hulewsky (08:25.748)\r\nreally?\r\n\r\n\r\nNikolas Hulewsky (08:33.24)\r\nton of engagement.\r\n\r\n\r\nNikolas Hulewsky (08:42.808)\r\nWell, I mean, the cool thing about that is such an asymmetric bet. Like you have no downside. He's asking, hey, apply to be this person who gives me podcast ideas. And you're like, no downside to me. Sure, I can do that. And from that, there's like only upside. And you built this relationship. that was a few years ago. Did you guys stay in touch or was it like?\r\n\r\n\r\nKimi Green (09:06.303)\r\nNo, so this is why I thought I was getting catfished. This was like two, three years ago, two and a half years ago maybe. So out of sight, out of mind, I remember March Madness was going on. And if you know me, I really love women's basketball. So I remember being in Dallas at the time and March Madness was going on when that had ended. Fast forward two years later, I'm traveling.\r\n\r\n\r\nfor my run club business that I was building on the side. was in San Francisco visiting a run club that I really wanted to work with. And on a random day, I was just working at a coffee shop. And that's when I get the text from Sam. I don't have this number because again, we had only communicated over email barely. Again, it was just send us email through Google Forms and that's it. So when I get this text that says,\r\n\r\n\r\nHey, it's Sam. I have a project idea. You interested? It was so weird. He said Sam par. He did say his full name and immediate like signs are going off. I've been hijacked before. No, I didn't even have his number. Yeah. Maybe I put my number on the form, but I don't remember. It was so long ago.\r\n\r\n\r\nNikolas Hulewsky (10:13.23)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (10:16.846)\r\nBecause you would never have with.\r\n\r\n\r\nNo, okay, just email.\r\n\r\n\r\nNikolas Hulewsky (10:26.53)\r\nRight, right.\r\n\r\n\r\nKimi Green (10:30.911)\r\nSo I'm very confused. just let it sit for a few hours and then I look at it again and it did send us an iMessage. So it's not a green text. And I just sent a question mark back and he was like, it's me. He was like, it's me Sam. Remember you applied to be my researcher and didn't get it. And I was like, ow, that hurt. Yeah, I remember now. And I just said, how do I know it's?\r\n\r\n\r\nNikolas Hulewsky (10:41.678)\r\nHmm? Hmm.\r\n\r\n\r\nNikolas Hulewsky (10:55.19)\r\nWait, wait, wait. So you pulled the most alpha move possible. You didn't respond to him for a few hours and then you just hit him with a question mark on the message?\r\n\r\n\r\nKimi Green (11:04.215)\r\nYeah. Because in case it was like Tina from the Czech Republic, I didn't want to get a weirdo text back that was like, hey, send me $1,000 in PayPal gift cards or something like that. So I just wanted to.\r\n\r\n\r\nNikolas Hulewsky (11:07.064)\r\nGive me a...\r\n\r\n\r\nNikolas Hulewsky (11:11.548)\r\nmy\r\n\r\n\r\nNikolas Hulewsky (11:20.43)\r\nThis is why I was terrible at dating. like, if the girl that I liked showed any interest in me, I'd be like, yeah, yeah, yeah, where do you want to go this weekend? You know what mean? was just like, I'm like a dog when it comes to that. My tail's wagging. I'm like, yeah, what are we doing? Where are we going? And you're like, oh, interesting. I'll let it sit for a couple hours. Oh, you know what? I'll respond to him. Question mark. And then he's like, oh, you don't remember me, Sam? Just like instant insecurity. Like, what? No, I'm famous. You don't remember me? You interviewed for my research assistant position. You like just immediately changed the power dynamic.\r\n\r\n\r\nKimi Green (11:36.121)\r\nyeah.\r\n\r\n\r\nNikolas Hulewsky (11:49.665)\r\nSo good.\r\n\r\n\r\nKimi Green (11:49.783)\r\nIt was so gets a little better. once he said that, do you remember this? All I said was, yeah, I remember. And he said, I sent you an email a few weeks ago. Did you get it? I'm like, okay, this is how I could probably verify that it's him. So I go to my Gmail and I check my spam and I can see Sam's email there. That was basically an exact.\r\n\r\n\r\nduplicate of the text message that he had sent me. I'm like, my gosh, I think this might be him. So again, my account, I've had my LinkedIn account hacked before. It was horrible. I actually had a handful of friends send over thousands of dollars to like some sketchy guy asking for money because they thought it was me. I guess I'm a trusting person. But ever since then, I just have a wall up when\r\n\r\n\r\nsomeone that I don't know is getting in touch with me. So I sent him a DM on Instagram and I was like, hey, did you text me? And then I texted him. said, I just sent you a DM on Instagram. Did you get it? He said, no, I didn't get it. But he sent me a screenshot of all of his Instagram DMs and I can see his wife's name. I can see like Alex Lieberman, the morning brew guy, I think his name. So some recognizable names. I'm like,\r\n\r\n\r\nNikolas Hulewsky (13:10.893)\r\nMm-hmm.\r\n\r\n\r\nKimi Green (13:14.783)\r\nA hacker would do that. I'm still not convinced. And then right after he sent that screenshot, he said, I'm hopping into a podcast episode. Can I call you afterwards? And immediately, like, this is totally fake. And I just remember sending screenshots to my college group text at the time. And there's nine of us in there. I'm like, you guys, I think I'm getting catfished. because I also have a close friend who\r\n\r\n\r\nNikolas Hulewsky (13:17.249)\r\nHahaha\r\n\r\n\r\nKimi Green (13:42.369)\r\nhas an anonymous texting app and she does stuff like this. So I sent it to them one to see if any of my friends were doing this to me to be funny. But no, they were all, I think this could be real, be careful. Like clockwork, an hour later, when Sam finishes recording my first million, I get a FaceTime. I'm like.\r\n\r\n\r\nNikolas Hulewsky (14:04.654)\r\nI how you still do the air quotes. Like even to this day, you're still not convinced. You're like, I'm not sure it was actually him.\r\n\r\n\r\nKimi Green (14:07.467)\r\nYeah.\r\n\r\n\r\nThe first four months, the first four months I was not convinced. So I answer the FaceTime with my camera pointing to the sky and I see his face and I'm, I legitimately like my heart drops similar to how I joined this podcast episode. My heart drops. He's on the phone and I just go, my gosh, it's really you. And then he.\r\n\r\n\r\npans to his wife and his newborn baby in the background that was born like two weeks ago. And I word for word go, are you being held hostage to his wife, Sarah? And she was like, no, it's me. And she said something like that. And that is when I knew I was talking to Sam. And he gave the half-baked concept for Sam's List.\r\n\r\n\r\nNikolas Hulewsky (14:57.518)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (15:03.754)\r\npretty funny pans over and you're like, Sarah, blink twice if you're being held against your will, please. So here's my question. I get the general premise of Sam's list, and especially for somebody like Sam, where he has a large audience, being able to refer people to trusted fractional CFOs, CPAs, wealth managers, etc. It makes sense to me. He was persistent in following up with you. Why do you think that is?\r\n\r\n\r\nKimi Green (15:07.959)\r\nHere we go.\r\n\r\n\r\nKimi Green (15:34.325)\r\nHe's crazy, for one.\r\n\r\n\r\nNikolas Hulewsky (15:38.466)\r\nI mean, he may be crazy, true, but he gets hundreds of DMs, I'm sure they got tons of applicants. Like, what do you think it was about you that stood out? I mean, has he told you why he was kind of so dead set on Kimmy Green being the one to carry this idea out?\r\n\r\n\r\nKimi Green (15:54.325)\r\nI think it was two main reasons. One, my little one pagers sending him different podcasts, topic ideas stuck out to him because they were sort of unique and at an interesting angle. And then, so he remembered that for one. And then two, when we got on that first initial FaceTime, Sam's very good at setting the stage for what's about to come.\r\n\r\n\r\nI've seen him, I've been fortunate enough to see how he operates, which has been so freaking cool. But on our call, he made it very clear that this is either going to be such an incredible opportunity for me or the funniest story for me. And we never speak again. So I knew, I knew it could either go this way or this way. And I really wanted it to go this way.\r\n\r\n\r\nNikolas Hulewsky (16:43.982)\r\nMm.\r\n\r\n\r\nKimi Green (16:54.685)\r\nAnd I was willing to do anything that it took to make sure that Sam's List was a success. So we both went into this day zero, knowing that this could crash and burn. And I knew that he could easily replace me because during this little trial period of building Sam's List, this could be TMI, but I got access to his Twitter and LinkedIn accounts. And Nick, this is where, and his email.\r\n\r\n\r\nThis is where I saw just how many inbounds this guy gets on a daily basis. And then of course I'm like, holy crap, my one pagers were sticking out. Like he's getting flooded with people either. You know, can you mentor me or Hey, can you review this business that I have? Can I just steal five minutes of your time? He gets everything and it's in the Twitter DMS LinkedIn, his inbox and\r\n\r\n\r\nprobably a cell phone as well. that, you know, it was wild to see and some of it he'll engage with, but I knew getting access to that, I was like, I am so replaceable. Yeah.\r\n\r\n\r\nNikolas Hulewsky (18:06.302)\r\nI'm replaceable. You like Beyonce just started playing in your head. You're like, to the left to the left. Everything I own in a box to the left. So I have a quick\r\n\r\n\r\nKimi Green (18:14.967)\r\nLiterally. So I didn't want that to happen. I was like, no, this is me. It's me.\r\n\r\n\r\nNikolas Hulewsky (18:23.226)\r\nNo, I'm doing this. I'm doing this. So I have a quick, I have a quick sample story and then we'll move on from it. But he's, he was looking for a host for money wise and I applied for it I was like, I want to do money wise. I'd be great at this. I, I love the concept. I always ask people these types of questions, yada, yada, yada. So I apply, I make it through the first round, but like you said, just an email, right? And like really short, here's the email. And then I make it to the\r\n\r\n\r\nto the final round and I have to get somebody who has significant net worth. And then not only do I have to get them, but I have to get them to open up about it. And I recorded this podcast and I was like, oh, this should be fine. Cause he had told me if, know, if this goes well, you're going to then edit it and post and you'll make it a real episode. So as I was recording the podcast, was like, this is not a good conversation. It's not going well, this conversation that I'm having, but it's fine. I'll be able to like chop it up and post and whatever.\r\n\r\n\r\nAnd he watched it and was like, yeah, I don't think this is gonna work for me. And I was like, I was just devastated. Cause I'm like, I promise I could be good at this. And then I did like, not like you, cause I'm not, I'm not built like my wife's like you too. Where it's like, okay, cool. I just won't respond. I'll play hard to get. I wrote like the, you know, the breakup with the girlfriend who's clingy. And I'm like, no, I can be whatever you need. I'll be so much better.\r\n\r\n\r\nKimi Green (19:39.381)\r\nYou\r\n\r\n\r\nNikolas Hulewsky (19:46.606)\r\nI wrote like this whole long old thing and like in the moment I even knew I'm like, I should not be writing all of this, but I just couldn't help it. And then I never heard back from them. So that was, that was cool. That was a good, that was a good experience for me.\r\n\r\n\r\nKimi Green (19:58.443)\r\ncan't believe you applied. remember when he was looking for a Money Wise host and I think even when he started it, he was like, hey, I just want to do this for a few episodes and I want someone to take it over. And, you know, I think he's just about a year in and he just might have found someone. So I also knew someone that was applying to be the Money Wise podcast. I went to this MFN meetup and there was a guy\r\n\r\n\r\nwho had also applied and he was, I don't even think he recorded an episode, but similar to you, he was trying to find someone with high net worth. yeah, that one was weird. That little group, he was doing that. And then a month later I got the opportunity for Sam's List. And then a month later, someone else in that group was using Sam's List. And then someone else was asking me if he could work for Sam's List. And I'm like, well, buddy, we're barely making any money, but thanks for reaching out.\r\n\r\n\r\nNikolas Hulewsky (20:56.692)\r\nSam says it's going well, it's not going well. Okay. the\r\n\r\n\r\nKimi Green (20:59.401)\r\nYeah, well Sam doesn't do anything which is my fault, but it was going well.\r\n\r\n\r\nNikolas Hulewsky (21:04.43)\r\nWell, me ask this. So you and Sam have the FaceTime. Turns out Sarah is not being held hostage, which is great. That's great news for Sarah. What was the conversation like? Was it like, leave your job and come do this? Or was it, hey, this could be a side hustle? How did that look for you?\r\n\r\n\r\nKimi Green (21:23.421)\r\nAt the time, obviously I was building that run club business. also had a little newsletter on the side. So I was doing things so I could eventually leave my W2. And when Sam's List came about in my head, I was just thinking, maybe this can be that additional 50 % of supplementation that I needed to fully leave my W2. But when we were talking about it in the early stages, it was more of a\r\n\r\n\r\nside gig that could potentially produce dividends and, you know, wouldn't require much. But then as time went on, I think it was when we first hit like 30 or 40,000 maybe in the first couple of months. I'll never forget it was like a week before my birthday, I was at my friend's house and he was like, Hey, are you ready to go full time with this? And\r\n\r\n\r\nObviously I was. I, transparently, I was pretty MIA from my full-time job because Sam's List had just taken up so much of my time and I knew it was getting to the point where I'd have to quit soon. Funny story for you. I was in the office and at the time I stopped kind of going into the office every day just because again, like,\r\n\r\n\r\nNikolas Hulewsky (22:31.912)\r\nYou\r\n\r\n\r\nKimi Green (22:50.057)\r\nSam's list was taking up so much of my time. was like, I can't just show up to work with my personal laptop and have Sam Parr and Joe Spizer's name popping up from Slack. So I'm in the office and there's only like six of us out of a hundred people that would go into the office. It was in FinTech real estate. So I was an analyst at the time I was doing invest relation stuff. So one of our founders, he's a CEO.\r\n\r\n\r\nNikolas Hulewsky (23:07.502)\r\nWhat was your job?\r\n\r\n\r\nKimi Green (23:19.371)\r\nHe walked over to where all of us were sitting and I was sitting next to ironically one of our accountants and she's like, Hey Brian, what's this Hampton charge for $8,000? And I'm sitting there like Hampton charge. So for context, Hampton is Sam and Joe, Sam and Joe are two co-founders. Hampton is their other company and I'm freaking out. yeah.\r\n\r\n\r\nNikolas Hulewsky (23:43.576)\r\nAnd it's a peer group, it's a community for entrepreneurs, business owners.\r\n\r\n\r\nKimi Green (23:50.261)\r\nYeah, yeah. I'm internally freaking out. If he's in Hampton, there's a good chance he knows what Sam's List is because Sam had been talking about it and whatever. So I am freaking out. And he didn't say anything to me. So a couple days go by, nothing happens. I do some light calendar stalking and I see he had Hampton on his...\r\n\r\n\r\nCalendar there was a Hampton box that arrived on his desk a couple weeks later and I sent that box to I took a video of the box on his desk and sent it to Sam and Joe on slack and Again, this is just so funny and makes my origin story to these guys so weird but Sam goes you work for someone in Hampton I was like, do you know what I do? He was like honestly, no\r\n\r\n\r\nNikolas Hulewsky (24:44.506)\r\nHahaha!\r\n\r\n\r\nKimi Green (24:48.535)\r\nI was like, well, I work at this company and this is what I do. And now my CEO is a part of your group. And he was like, that is so funny. What are you doing? Like, okay. Anyways, that's what I knew. It was just getting, well, he knew everything else, but when it came to work, he knew nothing. Again, this man's crazy. I, so that happened and that started freaking me out. But then just like my overall.\r\n\r\n\r\nNikolas Hulewsky (25:00.238)\r\nis the first time he asked a personal question.\r\n\r\n\r\nNikolas Hulewsky (25:04.834)\r\nI'm kidding.\r\n\r\n\r\nKimi Green (25:17.237)\r\nbandwidth. could no longer dedicate enough time to this new team we were building at my company. Yeah, Sam's List was just taking off. And so we had had conversations in the early days of, hey, if this gets big, like you're going to be the CEO, you're going to be the one that's fully running it. Because at the time we split tasks between the three of us, the three co-founders and a part-time developer. So the plan was always for me to do that.\r\n\r\n\r\nIt just got expedited once things started moving along. And frankly, I loved my company and my coworkers so much. I didn't want to end on bad terms. So I knew. Yeah, he did not. Yeah, he didn't know what I was talking about now. He definitely does. But at the time he was like, what's Sam's lesson? I'm like, well, don't dig too far. And you might be mad at me.\r\n\r\n\r\nNikolas Hulewsky (25:56.142)\r\nDid you tell your boss? Did you tell the CEO what you're doing ever?\r\n\r\n\r\nNikolas Hulewsky (26:03.854)\r\nhow he does.\r\n\r\n\r\nNikolas Hulewsky (26:07.982)\r\nAre you pretty conservative? are you not a risk seeking person when it comes to business?\r\n\r\n\r\nKimi Green (26:17.458)\r\nI would say...\r\n\r\n\r\nNikolas Hulewsky (26:20.59)\r\nWell, let me ask you, can I ask it a different way? Did you always know you wanted to be an entrepreneur? You did.\r\n\r\n\r\nKimi Green (26:20.821)\r\nI would say yes. Yeah.\r\n\r\n\r\nyeah, definitely. I was trying to build a summer camp for kids and technology when I was in college.\r\n\r\n\r\nNikolas Hulewsky (26:31.008)\r\nOkay. So you always knew you wanted to do something entrepreneurial, but for you, you were like, was the plan in your head, work, get some experience, maybe launch a side hustle or two to see which one takes off and then leave? Or was it work, get some experience, then buy a business? Like how are you thinking about the transition into entrepreneurship?\r\n\r\n\r\nKimi Green (26:47.871)\r\nYou know what, if I would have never left corporate America, I think I would have been like any other entrepreneur who's like, I have this great business idea that's gonna make millions and millions of dollars. But yet you're going into the office every single day from 8 a.m. to 6 p.m. and you don't do anything about it, you just talk about it. So had I not left corporate America, I definitely think I would have been like.\r\n\r\n\r\nNikolas Hulewsky (26:59.884)\r\nyou\r\n\r\n\r\nKimi Green (27:13.775)\r\nway more on the conservative side. I do all the talking with little action to prove it. And so it wasn't until I left where I started trying new things to eventually have my own business.\r\n\r\n\r\nNikolas Hulewsky (27:20.12)\r\nDo you?\r\n\r\n\r\nNikolas Hulewsky (27:24.878)\r\nDo you think you needed that big of a catalyst to leave? Like, cause that's a pretty big catalyst, right? my boss is a member of a community that my co-founder owns and my co-founder is very public. Like this is going to be found out also at the same time. Like I'm pretty checked out at my job. Like it was coming to a head. It was forcing a decision. you feel like you had to be forced into that decision or do you think you would have left and been an entrepreneur either way?\r\n\r\n\r\nKimi Green (27:30.966)\r\nMm-hmm.\r\n\r\n\r\nKimi Green (27:54.263)\r\nYeah. So before that kind of happened, so Sam reached out to me February of 2024. And then it was September, October of 2023, where I was building the Run Club Marketplace. I had also started working with this guy who had a newsletter, former Barstool guy that was doing his own thing now. And I was doing, I was selling newsletter advertisements for Hint.\r\n\r\n\r\nSo that was generating not a lot, but like the first paycheck I got from that. And then the initial interest from with the run club stuff. I vividly remember calling my parents and telling them, cause I've had this conversation with them before, but I called them and I was like, Hey, just so you all know, there's a good chance that when 2024 is here, I'm doing my own thing and I will not have a typical W2 job.\r\n\r\n\r\nNikolas Hulewsky (28:23.533)\r\nRandom.\r\n\r\n\r\nKimi Green (28:51.415)\r\nTrust me that I'm going to make it work. Again, all I needed was that first paycheck from one of these side things to have the delusion that I'm just going to absolutely go for it. I wanted, again, I was 110 % in this thing, but I wanted my parents, I don't come from money. I want that to be well, I don't come from money. It's just a very average middle-class family. And I just wanted to at least\r\n\r\n\r\nNikolas Hulewsky (29:00.92)\r\nYeah.\r\n\r\n\r\nKimi Green (29:19.489)\r\nhave their blessing or comfort of like, I'm very bullish on this, but in the odd chance, I don't have enough to cover rent. Could you do it for me? And they're like, what are you doing? And so that conversation had happened. And like month one of Sam's List, I was out to lunch one day when I was at work and Sam FaceTimed me.\r\n\r\n\r\nwhich he was doing, he did like 10 times a day in the early stages and we were chit chatting. well we would do Slack FaceTime.\r\n\r\n\r\nNikolas Hulewsky (29:49.74)\r\nIs he a Face Timer?\r\n\r\n\r\nNikolas Hulewsky (29:56.338)\r\nYeah, no, whatever. But like, he video calls. I have a friend like that. He only video calls me and I'm just like, I'm just like, what are doing? You psychopath? Like send me a text.\r\n\r\n\r\nKimi Green (29:59.136)\r\nYeah.\r\n\r\n\r\nKimi Green (30:06.369)\r\nWell, that's me. I FaceTime over text. And if it's not FaceTime, it's a voice memo. Yeah, yeah. Like, don't make me move my fingers. You do?\r\n\r\n\r\nNikolas Hulewsky (30:10.744)\r\nDo you? okay, all right. I love voice memos.\r\n\r\n\r\nMm-hmm, I do love voice memos, yeah.\r\n\r\n\r\nKimi Green (30:21.385)\r\nI was gonna send you one the other day.\r\n\r\n\r\nNikolas Hulewsky (30:24.418)\r\nYou should have I love them. because like texting takes so much time and like there's nuance to it and like, well, I know what you said, but it's how you said it. You know, I mean, it's just like, it just leaves a lot of room for ambiguity and misinterpretation. So yeah, I like the voice memo now because I can get out my thoughts and you can kind of hear what I'm thinking.\r\n\r\n\r\nKimi Green (30:44.137)\r\nYeah, I appreciate them more too, because I'm also the only friend in my friend group that's not in Texas. So when I am speaking to my close people, like I want to see a reaction to everything I'm telling, I want to see your surrounding environments. I want to hear it. but anyways, Sam and I were on, yeah, Sam calls me, we're on Slack space time. And again, that conversation came up of when do think you could go full time on Sam's list?\r\n\r\n\r\nNikolas Hulewsky (30:51.726)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (30:56.846)\r\nSure.\r\n\r\n\r\nNikolas Hulewsky (31:01.912)\r\nSo Sam calls you.\r\n\r\n\r\nKimi Green (31:13.099)\r\nHe either asked me that or when do think you would ever quit your job? And I was like, I'm actually about to put in my two weeks next week because I have this run club business that is taking off. I hadn't made a dollar yet from the run club business. I just had interest and I will never forget. Sam goes, do you come from a wealthy family or do you come from money? And I was like, no, not at all. He goes, good luck with that.\r\n\r\n\r\nNikolas Hulewsky (31:23.726)\r\nMm.\r\n\r\n\r\nYou\r\n\r\n\r\nNikolas Hulewsky (31:39.722)\r\nHahaha!\r\n\r\n\r\nKimi Green (31:42.633)\r\nI was like, honestly, that just lit a fire under me because I know this is going to work out. But, and I still do that companies on backburner, but it did make a thousand dollars in just a couple of months. So, yeah, that was, those were sort of.\r\n\r\n\r\nNikolas Hulewsky (31:59.768)\r\nSo everything was coming, it was all coming to a head and you made the decision. I had a very similar experience. I had a lot of experience in corporate America and I knew I wanted to be an entrepreneur and I cosplayed for a while of like, yeah, I might buy this business, I might do that business. But I ended up getting fired from the company. was like a long story. They were having some financial difficulties. They had to take some money and they knew that I...\r\n\r\n\r\nI wasn't going to be long in that role anyways, because I had said I wanted to buy a business, yada, yada. So I was one of the ones who got cut. And it was that that was like the catalyst for, okay, I'm doing this then. Like it's enough talking about it. I got to actually do this thing. Because I think that there's two types of entrepreneurs. think there's people like maybe Sam, but Chris, who's my best friend and business partner. They're just hustlers. They've always hustled. They've never worked for anybody else. And they've always just like figured out a way.\r\n\r\n\r\nto make money to make money. like every time I call Chris, it's something different. It's like, Oh dude, I just bought this storage unit. Oh, I just bought the shipping container of defected products. I'm going to sell on eBay. Oh, I'm going to the flea market. And like, dude, what are you what? What I can't even keep up. But that's not me. I'm not like the hustler, right? I'm like, okay, I'm gonna buy a business and this is gonna be the plan. And this is how I'm gonna implement it. But for people like that, you kind of need like the kick in the pants, because otherwise, you're never gonna find the right time. And that was a big lesson to me is like, there is no\r\n\r\n\r\nKimi Green (33:21.761)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (33:26.562)\r\nright time. You just got to do it.\r\n\r\n\r\nKimi Green (33:29.205)\r\nYeah, that's how I left corporate America was, you know, it during COVID. I think my company, we were in the oil and gas industry. We might've had some layoffs, but nothing too severe. what ultimately led me to leave, otherwise I would still be on the path to climbing the corporate ladder. That was my one sole goal in life was to climb the corporate America ladder. Yeah.\r\n\r\n\r\nNikolas Hulewsky (33:56.504)\r\nclimb the corporate ladder. What did so what did Sam's List look like at that time? So when you quit, and you're like, all right, I'm doing Sam's List full time. Did you quit thinking it was Sam's List full time? Or did you really think, no, I'll do Run Club and Sam's List.\r\n\r\n\r\nKimi Green (34:13.071)\r\nmy goodness. No. I mean, at the time I knew I couldn't do anything else just because one first time founder, I had no idea what I was doing. So I was doing so much of learning while also building that any free time I got, I had to go to bed. so unfortunately all of the extracurriculars are in a closet.\r\n\r\n\r\nNikolas Hulewsky (34:16.813)\r\nThank\r\n\r\n\r\nNikolas Hulewsky (34:41.494)\r\nSo that was out. So what, when you quit, what was Sam's List doing a month in revenue?\r\n\r\n\r\nKimi Green (34:42.624)\r\nYeah, yeah.\r\n\r\n\r\nKimi Green (34:48.448)\r\nSo our first month we did about 10 and then the month where we did around 25, it was that month where we were like, okay, Kimmy, full time, you in? Yes, yes, okay, great.\r\n\r\n\r\nNikolas Hulewsky (35:03.586)\r\nwhat was the discussion then with your partners? it like, Kimmy, we need you full time. We'll pay you or is it Kimmy, we need you full time. You're just gonna be living on beans and rice. Like, were you walking into a situation where you knew you weren't going to get income or was it eat what you kill or was it we'll put some money into it? Like, how did that look?\r\n\r\n\r\nKimi Green (35:21.131)\r\nYeah, so Sam and Joe put 30 to $40,000 in initially. And so for the first few months that covered, I was getting paid like $8,000 and then our developer is getting paid some rare between. He started at two and then we bumped it to four so we could kind of move things along. So that covered both of us and then all the other software miscellaneous fees for actually.\r\n\r\n\r\nrunning the site. And so that was no problem. I knew I'd be getting paid for the first few months. And then all the money we made was just getting reinvested.\r\n\r\n\r\nNikolas Hulewsky (36:02.882)\r\nSo tell me when this was, The first few months would have been.\r\n\r\n\r\nKimi Green (36:05.143)\r\nThis was from, I think we announced in April.\r\n\r\n\r\nNikolas Hulewsky (36:10.83)\r\nSo a year ago.\r\n\r\n\r\nKimi Green (36:12.407)\r\nYeah, just almost a year ago. They were paid, like I think they paid me $2,500 in March and April. And funny enough, I actually used that first paycheck to pay for an accountant. It wasn't 2,500, but I vividly remember the timing I got my first paycheck from them. I sent part of it to my accountant. was perfect. And also funny. So yeah, that covered us from\r\n\r\n\r\nNikolas Hulewsky (36:13.486)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (36:32.93)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (36:37.002)\r\nEasy, easy.\r\n\r\n\r\nKimi Green (36:41.993)\r\nabout March until...\r\n\r\n\r\nLet's see. I officially became a co-founder in October, so we're still. No, I was.\r\n\r\n\r\nNikolas Hulewsky (36:52.354)\r\nHmm. Well, so you weren't a co-founder.\r\n\r\n\r\nSo you quit your job without the prospect of equity? was just like, hey, come work here?\r\n\r\n\r\nKimi Green (36:59.925)\r\nI had equity. Do you think I can say how much?\r\n\r\n\r\nNikolas Hulewsky (37:04.654)\r\nthink you could say whatever you want, but.\r\n\r\n\r\nKimi Green (37:05.685)\r\nWell, I'll say it like this. I have always had equity. I started with this much. They actually gave me what I would say a generous amount in the early stages.\r\n\r\n\r\nNikolas Hulewsky (37:15.534)\r\nOkay, okay. those who are just listening, Kimmy's got her fingers about 15 % apart. Okay, keep going.\r\n\r\n\r\nKimi Green (37:22.039)\r\nYeah, come October I got... Now my fingers are out of the frame. I like three...\r\n\r\n\r\nNikolas Hulewsky (37:30.4)\r\nOkay, now they're like 45 % apart, not 45, 35 % apart. So what do mean then when you say co-founder? Because in my mind, if you had equity from the beginning, you're a co-founder.\r\n\r\n\r\nKimi Green (37:40.577)\r\nWell, equity went up. Yeah. So basically my roles went from just being the operator, the person who's running it to, now you are project manager, you know, all the customer support speaking, working directly with the developer, legitimately everything. So it's just me doing. Yeah.\r\n\r\n\r\nNikolas Hulewsky (37:57.774)\r\nIt's like the CEO, those conversations that you had had early on and like, you can come on. can be the CEO. It was coming to fruition in October. Can you tell me, I'm curious because you talked about like development in particular. my understanding of this product is it's not a tech company. It's it's you have distribution, you have, uh, sort of buyers and sellers quote unquote, so to speak, right? You've got the.\r\n\r\n\r\nKimi Green (38:06.751)\r\nYeah, exactly.\r\n\r\n\r\nNikolas Hulewsky (38:25.038)\r\nthe people on the delivery side, the CPAs, the accountants, the tax advisors, whatever. And then you've got obviously the people on the other end who are needing these services and you're facilitating them actually connect. Why did you have a development team? Like what were you spending money on?\r\n\r\n\r\nKimi Green (38:42.465)\r\nWell, one, I'm not super technical, even though I did start my career in tech, but I've lost quite a bit of that. So we're using Bubble and that's what Sam's List is built on. So I don't have any experience with that. when we're building, so we recently changed our login process from requiring.\r\n\r\n\r\nNikolas Hulewsky (38:50.382)\r\nThank\r\n\r\n\r\nNikolas Hulewsky (39:02.968)\r\nSo Sam's list does function as a marketplace you can log into to go and find and be connected with people. Okay. That makes more sense.\r\n\r\n\r\nKimi Green (39:07.158)\r\nMm-hmm.\r\n\r\n\r\nWell, only the professionals are logging in as an end user if you're looking for an accountant or a financial advisor. There's no login required for you unless you're leaving a review for someone on our platform. Then this is like one of our favorite features on Sam's List. We require everyone to use their Twitter or LinkedIn account in order to leave a client review so that you can authenticate that person. So you can see their full name, their photo, and if you're like, hey, what does this person do that just left a...\r\n\r\n\r\nNikolas Hulewsky (39:20.216)\r\nMm.\r\n\r\n\r\nKimi Green (39:40.693)\r\neither very kind review or horrible review. can go check them out if you want to.\r\n\r\n\r\nNikolas Hulewsky (39:46.833)\r\nWell, in in Sam, Sam and Joe sound like what Chris and I have done. I don't know if you know Chris Kerner, my business partner and friend, the Kerner office. Have you seen him? Okay, there we go. That makes me feel very good about myself, Kimmy. Thank you. Thank you. No, he's awesome. He's awesome. But like part of our investment thesis, we've invested in a few incubated a few companies and it's been like, alright, we'll put 20 $30,000 into this. But\r\n\r\n\r\nKimi Green (39:55.679)\r\nI've seen them from your podcast in economics.\r\n\r\n\r\nKimi Green (40:02.045)\r\nI didn't know him before that, but he seems great.\r\n\r\n\r\nNikolas Hulewsky (40:14.584)\r\nWe're not trying to be the next Facebook. We don't want to go raise a bunch of VC money. Like this has got to be profitable fairly quickly. And then if the 20, $30,000 bet doesn't work out, it doesn't work out, right? But we're not then putting a hundred grand, 250 grand. Like the idea is not for it to become a proper tech company. So it sounds like that's kind of what Joe and Sam's thesis was like, okay, let's put some money in to get this business going, but we don't want to build the next Facebook. So we don't want to spend a bunch on development costs. We want it to be profitable. Is that a fair characterization of them?\r\n\r\n\r\nKimi Green (40:43.883)\r\nYeah, yeah, that's very accurate. Well, we're still not profitable. We're very, very close. And to be frank, I think Sam's List would be in a very different position if I had more experience, I knew what I was doing. So the fact that we even hit six figures with me at the helm says a lot about this business itself. Like you're right, we aren't inventing the next Facebook.\r\n\r\n\r\nNikolas Hulewsky (40:44.814)\r\nOkay, did it play out that way or has it not played out? Okay.\r\n\r\n\r\nKimi Green (41:13.943)\r\nI don't have aspirations to create the next Facebook, but I know what we're doing is actually solving a real problem. And I know it's very monetizable. And so now that I have these last 10 months of building, I know how to get to that next step quicker. I still need a little bit of health and we're getting that, but we will be.\r\n\r\n\r\nNikolas Hulewsky (41:35.95)\r\nSo did you have to put money in or do they have to put more money than the 30 or 40,000? What's been funding the losses?\r\n\r\n\r\nKimi Green (41:42.903)\r\nour sales. So we have a few partners who are just paying us for Legion.\r\n\r\n\r\nNikolas Hulewsky (41:48.526)\r\nBut if you're operating at a loss, someone's got to fill that gap, right?\r\n\r\n\r\nKimi Green (41:53.079)\r\nI guess you could say my credit card?\r\n\r\n\r\nNikolas Hulewsky (41:55.5)\r\nKimi Green (41:59.191)\r\nThank you, whoever I have.\r\n\r\n\r\nNikolas Hulewsky (41:59.757)\r\nOkay\r\n\r\n\r\nNikolas Hulewsky (42:04.206)\r\nThank you, whoever I open this month to never pay off the balance of. Okay. So nobody put any more money in after the 30 to 40 grand. You've just been very close to break even and then funding it with credit.\r\n\r\n\r\nKimi Green (42:10.187)\r\nYeah.\r\n\r\n\r\nKimi Green (42:14.977)\r\nRight.\r\n\r\n\r\nKimi Green (42:20.235)\r\nYeah, yeah. And it's nothing big. Like again, we've made $130,000. We've spent $140,000. So it's nothing super pressing. Although in December, gosh, I'll never forget, for the first time since I was probably 15, my card declined. And I was like, Lord help me. I was at a stake. I don't really go out anymore.\r\n\r\n\r\nNikolas Hulewsky (42:21.494)\r\nokay, that makes sense.\r\n\r\n\r\nKimi Green (42:49.527)\r\nBut I was visiting some friends in the sticks of Atlanta who I hadn't seen in while and went out to dinner with about 10 people, nice steak restaurant. And, you know, I think it was around like $150 per person. The sweet waiter comes up to me. He's like, ma'am, your card declined. No freaking way. I hadn't paid myself in like six weeks. So it was a quick transfer, but just the way your heart sinks.\r\n\r\n\r\nNikolas Hulewsky (43:17.315)\r\nYeah.\r\n\r\n\r\nKimi Green (43:18.535)\r\nAfter that, we had a great month, yeah, we are solely fueled right now by a very small credit card balance and just all money coming in from how we're monetizing.\r\n\r\n\r\nNikolas Hulewsky (43:33.07)\r\npretty self-aware of you to say, yeah, we would be in a better place if I had had experience. There's this whole ethos of like, fake it till you make it. I'm doing great. Everything's wonderful. So to hear somebody say, we probably would have been in a better spot if I would have had experience is refreshing. It might be one of the reasons that Sam sought you out. Because that's part of the thing I've been trying to work through in this conversation is there's obviously something special about you.\r\n\r\n\r\nRight. You're smart. You're young. You're, you're a learner. think that that to me is your words. Your words. you're, you're a learner. You know what mean? Then like people who are learners, they just figure stuff out. And I think those are all amazing qualities, but that the ability to have self-reflection is really important. It's kind of like a fine line as you're doing entrepreneurship, because if, if you're so prideful, but you can't actually self-evaluate.\r\n\r\n\r\nKimi Green (44:06.913)\r\nNo, I'm kidding. That was inappropriate.\r\n\r\n\r\nNikolas Hulewsky (44:32.12)\r\nyou're going to fail. But if you're so insecure that all you do is self evaluate, you're going to fail, right? Like there has to be this ability to have confidence, but then also take a look at the things you're doing well. And that it sounds like you're striking sort of that balance.\r\n\r\n\r\nKimi Green (44:47.029)\r\nYeah, I would also say a lot of that comes from so far I'm operating Sam's least successful company and I don't want to have that badge of honor for the rest of my life. you know, I want to hit certain goals. So it, you know, revenue wise hit certain metrics, but then he's also him and Joe both have done a phenomenal job of just pouring a lot of confidence in me. I don't think I lack it all the time, but I definitely\r\n\r\n\r\ndo in ways that people wouldn't expect. And they can pick up on it when people can't just by like what I'm saying or what I'm doing. they kind of know what some of my aspirations are in life. And they'll send me little reminders of, hey, you know, it could be around the corner. so having that is very motivating. And again, I got I got a front seat to two of the\r\n\r\n\r\nbest serial entrepreneurs out there. And yeah, I just want to work hard. And I'm also pretty known to the fact of, you know, this world is temporary. So if my only goal has a dollar sign in front of it, that's not what I'm here to do. You know, it's just something fun that I get to do in my life. I've been blessed with many things. And, you know, how can I seize this opportunity and help others so\r\n\r\n\r\nThis is what's allowing me to do that, bring people happiness, show people kindness. Accounting and finance is not fun. And the people who own these companies are pretty boring. There are some great ones, but if I can bring some light in this industry, I want to do that. So I think that's a cool angle that I get to be a part of with Sam's List. And hopefully it continues running.\r\n\r\n\r\nNikolas Hulewsky (46:34.046)\r\nSo you launched, it'll be my last questions. You launched this about a year ago and you said, you you've just been your first time founder. You're kind of going through the learning phase. What's interesting about entrepreneurship is it is not linear. The growth becomes exponential. It's like all those things that you did in the past, all of a sudden, you know, you have just this massive jump. But what do you, how do you feel about where Sam's List is right now?\r\n\r\n\r\nand its ability to grow versus where you were six months ago.\r\n\r\n\r\nKimi Green (47:06.037)\r\nOoh, how do I feel about it right now versus where it was six months ago?\r\n\r\n\r\nNikolas Hulewsky (47:13.198)\r\nYou're in that like, drinking from a fire hydrant, just like trying to figure out like, what am I supposed to do? How built out should the UI be on the website? How do I get customers? What do we charge them? How do we price things? I got to get CPAs to put that's our revenue model. It's the CPAs. You know what I mean? Like, I'm assuming six months ago, you were just like, overwhelmed. You don't. You could still be overwhelmed. I don't know. You don't strike me as that now. So yeah, how do you feel today versus six months ago?\r\n\r\n\r\nKimi Green (47:34.391)\r\nMm-hmm.\r\n\r\n\r\nKimi Green (47:38.966)\r\nYeah.\r\n\r\n\r\nKimi Green (47:43.445)\r\nWow. Funny enough, it was just about six months ago where I, I'm not making this up. I looked at myself in the mirror and I was like, I am becoming the worst version of myself. I felt like I was drowning. Like, yes, I was having so much fun, but I hadn't worked out in forever. I was eating like garbage. People were running over me to be honest with you. And it was just so difficult. I felt like I was failing at everything.\r\n\r\n\r\nAnd then it was overnight. spent like four hours on chat, GPT, I was like, Hey, this is what's going on. needed to create a workout plan for me, a diet plan. What vitamins do I need to be taking? And I just started respecting myself more. And I started changing the tone of how I converse with people. I've always tried to like speak with love and understanding to every single person that has ever used Sam's List. But, know, prior to six or over six months ago, like\r\n\r\n\r\nNikolas Hulewsky (48:18.936)\r\nReally.\r\n\r\n\r\nNikolas Hulewsky (48:24.831)\r\nYou\r\n\r\n\r\nKimi Green (48:42.977)\r\nthose priorities were not priorities to me. They were just kind of happened. So looking at the last six months, you know, I've changed a lot lifestyle wise so that I can do more and perform better for Sam's List. So one thing that I would say is like number one in our sole focus is SEO. We want organic to be the main driver. Yes, we have the\r\n\r\n\r\nlarge billboard sign that is Sam Parr and that's like a phenomenal advantage to have. But SEO also will be, that's something I just didn't even know. I did not know what SEO was before Sam's List. And I remember a couple months in, Sam was like, hey, you should learn what SEO is. It's going to be super important and it's going to be very pivotal to our platform. And I was like, okay, yeah, whatever.\r\n\r\n\r\nkind of ignored it to be honest with you. But then we had an SEO agency reach out and they were like, hey, we're like, we're this SEO agency, we're gonna help you over three to six months. So the beginning of Sam's List to last year, they were doing some stuff, but we weren't seeing anything from it. And it wasn't until Bench Accounting in December announced that they were just abruptly shutting down and...\r\n\r\n\r\nNikolas Hulewsky (50:05.645)\r\nMmm.\r\n\r\n\r\nKimi Green (50:06.345)\r\nI think that is when I signed up for an Ahrefs account and started watching YouTube videos and podcasts around SEO. And Nick, this is still one of my like favorite miniature success moments. Sam's List was one of the first platforms to talk about it. We were on the front page of Google with like two different articles that I had generated and it was short lived. Like it disappeared after a couple of hours. And I actually just looked the other day, now we're on like page 10.\r\n\r\n\r\nNikolas Hulewsky (50:28.046)\r\nThat's awesome.\r\n\r\n\r\nKimi Green (50:36.299)\r\nBut still, that was, I just started familiarizing myself with that because I'm like, okay, I know this is going to be huge. I started meeting with some executives at some of the largest marketplace platforms similar to us. And they're like, content, content, content is going to be what pushes you forward. And so getting the bench accounting news, speaking with people in this industry who have been doing it for a while. And then,\r\n\r\n\r\nYou know, honestly, when you and I met the other day and you were like, Kimmy, way more people should know about Sam's List. That was a huge wake up call for me. So now me and this guy, we met on Twitter, his name's Aubrey. He's been a phenomenal, new brand new entrepreneurial friend that I gained from all of this stuff. We're doing a 30 day challenge right now where I actually started with a hundred. He was like, if it's a hundred, I'm not going to do it. Let's do 30. And I think that was great. So we both came up with,\r\n\r\n\r\nNikolas Hulewsky (51:20.866)\r\nYeah, pure.\r\n\r\n\r\nKimi Green (51:33.431)\r\n30 day goal plans that we want to hit primarily centered around content. So that's what I'm doing now. I'm just trying to get more comfortable with the fact that, guys, I'm not a CPA. I'm not a certified financial planner either, but I have access to just about 300 of them. And I speak to all of them on a daily basis and I'm learning a lot. So how can I take my learnings, what I'm learning about SEO, what people want to see and take everything that people are just pouring into me and\r\n\r\n\r\nput that out into Sam's List to help us grow. And there already has been some slow but decent upticks from that. And so I would say that's the number one, you know, when I look back six months from now, I'd say just like the SEO and the content stuff is what I was blind to and ignoring. And now that's only what I am spending my days doing every single day.\r\n\r\n\r\nNikolas Hulewsky (52:14.434)\r\nGood.\r\n\r\n\r\nNikolas Hulewsky (52:31.758)\r\nI love it. love it. Kimmy, I can't wait to check in with you in a year to see where Sam's List is. Okay, eight months, I don't care. Six months, fine. No, but seriously, I can't wait to check back in with you. think it's gonna be, I think it's just gonna be really cool story.\r\n\r\n\r\nKimi Green (52:37.034)\r\neight months.\r\n\r\n\r\nKimi Green (52:42.28)\r\nAll right.",
  "metadata": {
    "duration": "",
    "date": "2025-04-23",
    "platform_source": "Google Drive"
  }
}