{
  "episode_number": "98",
  "episode_title": "How to Start and Scale an ATM Business: From 3 to 900 Machines ($180k/Month) with Mitchell Sorkin",
  "guest_name": "Mitchell Sorkin",
  "business_name": "ATM Business",
  "transcript": "﻿Can you give me an idea now of like,Nik (00:00.833)\r\nAll right, Mitchell, welcome to Nekonomics. Let's give the people what they want. Why don't you tell us what you do and how you make money,\r\n\r\n\r\nmitchell (00:07.95)\r\nThanks for having me on. I really appreciate it. I am the ATM guy on Twitter. So that's kind what I'm known for online. I got into this business three years ago with my brother. A little backstory, quick like 30 second spiel. spent the majority of my 20s building internet businesses. I was in e -commerce and then ended up building some software for e -com merchants.\r\n\r\n\r\nended up raising a little bit of VC money for that and just got really burned out in that cycle and then started reading about search and ETA on Twitter and my brother and I decided we were going to buy a cash flowing business and so we started just kind of like scanning through biz buy sell typical kind of search story and kind of purely out of serendipity stumbled into an ATM deal and the guy was selling I think like\r\n\r\n\r\nthree or 400 locations and I told my brother, don't we just try to buy three of them? So I reached out to the guy and I was like, hey, we just want to get our feet wet. He was local here in LA and I asked him to buy three locations and to my surprise, he just said yes right away. So that was great. Gave us like a really low risk entry into the business. We ran those three machines for like five or six weeks and then just kind of like started doubling down from there.\r\n\r\n\r\nNik (01:32.173)\r\nDude, okay, so tell me how ATM machines, this is like, I go to 7 -Eleven, I need to get cash, I pull out my debit card, and you charge a fee, essentially a percentage or a fixed dollar amount for me to pull that cash out of the ATM. That's the business.\r\n\r\n\r\nmitchell (01:49.55)\r\nThat's correct.\r\n\r\n\r\nNik (01:51.053)\r\nAll right. Can you give me an idea now of like, when was that? When did you start?\r\n\r\n\r\nmitchell (01:55.982)\r\nThat was October of 2021, so almost exactly three years ago.\r\n\r\n\r\nNik (01:57.943)\r\nOkay, so three years ago, you started with three machines and how do you measure the business now? Like how big is it in terms of revenue and machines?\r\n\r\n\r\nmitchell (02:07.278)\r\nYeah, so we have just about 900 machines now. There's a big difference in the ATM business between processing accounts and own and load accounts. It's kind of like the terminology that people use. so I can explain what each of those are, but processing accounts for probably like 55 % of those 900 machines and the rest is own and load. so own and load is a location where you own the equipment.\r\n\r\n\r\nNik (02:16.823)\r\nCough\r\n\r\n\r\nmitchell (02:35.882)\r\nyou put cash inside of it, either you personally or your employees or a third party, which can be like an armored truck or another ATM guy that decides to put his cash in your machine and you give him a piece of the surcharge. And then processing is when somebody else owns the machine and they load it themselves. And the same way how when you walk into a mobile gas station, you see a credit card terminal.\r\n\r\n\r\nthere's the processors, but then there's a middleman and sometimes a middleman under that middleman. And basically it's just everyone scraping like pieces of that transaction, right? And there's, there's a portion of income that comes from ATMs called interchange. We could talk a little bit about that if you want to, but without going too far into the weeds, it's basically just an additional form or an additional revenue source that gets paid out in between the processors and the networks. So for example,\r\n\r\n\r\nyou have a Visa card, you put that Visa card into the ATM, there is a certain amount of interchange that's paid out, and it's usually anywhere between like 20 and 40 cents, where it's basically the network saying to the processor, because you processed this transaction and allowed it to happen, we're gonna give you this set amount of cents per transaction. That amount of interchange varies greatly depending on\r\n\r\n\r\nwhat kind of card was used, where you are in the country, the time of day, whatever. There's a million different variables.\r\n\r\n\r\nNik (04:06.111)\r\nSo top line revenue, like how big is that? I have no idea.\r\n\r\n\r\nmitchell (04:09.034)\r\nyeah. Yeah, yeah. Yeah. So our revenue across all of our entities is probably like the 180K a month range. And I mean, with the caveat, you know, I told you before we got on the call, we have a few different entities. We have our wholly owned entities, just me and my brother. That's where we bought those first three machines. And, you know, the next like four or five deals that we did.\r\n\r\n\r\nWe're all small and we just used our own cash and funneled them into that entity. But we've gone out and done two separate bigger deals that we brought in LPs and raised debt for. And so when I say 180K a month, that's across all three entities. The one that we own ourselves is probably in the range of like 65 to 70K a month.\r\n\r\n\r\nNik (04:56.877)\r\nOkay, still, it's a business doing north of $2 million a year in revenue. And if that's a percentage or a fraction of the actual transactions that are that are happening, you're probably processing over $100 million worth of like, withdrawals. Yeah.\r\n\r\n\r\nmitchell (05:14.254)\r\nI would say you're talking about annually.\r\n\r\n\r\nNik (05:21.537)\r\nYeah, just, or you could do a month as well. I'm just kind of like curious what.\r\n\r\n\r\nmitchell (05:25.55)\r\nI'd say a hundred million is probably a little bit high, but it's a big number for sure. Like, I mean, if you include all of the processing accounts and all of the entities, like probably at least 40 to $50 million in $20 bills coming out of the machines for sure.\r\n\r\n\r\nNik (05:30.337)\r\nI'm\r\n\r\n\r\nNik (05:38.623)\r\nInsane. All right. So I'm an idiot. So I kind of understand the two different things that you do in the space, but I want to drill into each one. So there's the one that's the, what do call it? Load and code? Load and... Own and load? Okay. You own it and you load it. like, that's your machine. You handle the fulfillment. Either you're outsourcing the guy coming in the armored truck or you're doing it yourself. I'm assuming you outsource that.\r\n\r\n\r\nmitchell (05:51.434)\r\nYeah, own and load.\r\n\r\n\r\nNik (06:09.289)\r\nThat seems pretty straightforward to me. The other piece, you're just working as a processor. Like, are you a payment processor essentially on top of?\r\n\r\n\r\nmitchell (06:18.242)\r\nYeah, you're a middle man in between the processor and the independent ATM deployers. So basically, goes, there's like a hierarchy. It goes networks, ISO, which is the independent sales organization. And then under that is the independent ATM deployers. So that's just like me or you or anyone who just has one ATM or a thousand ATMs, doesn't really matter. And so the idea is you get economies of scale as you grow. And so you get\r\n\r\n\r\nmore and more of that interchange. And so you might go with four ATMs and your buy rate, is how much you get, which is how much you pay off of each transaction. let's say, let's say just to use simple numbers, let's say there was 10 cents of interchange for each transaction and you come to me and you say, Hey, I have one location. How much of that interchange can you give me? And I tell you, well, you only have one location. So I'm going to keep all of it or I'll give you one penny. Okay.\r\n\r\n\r\nThen you come back to me a year later and you say, hey, I have 40 machines now and I'm doing X amount of transactions. Can I get three cents now? And so basically it's just this kind of like, it's this negotiation of trying to keep more and more of that interchange. So.\r\n\r\n\r\nNik (07:31.361)\r\nAnd are you going to the ICO or are you going to the actual provider?\r\n\r\n\r\nmitchell (07:40.681)\r\nLet me put on Do Not Disturb. Sorry about that.\r\n\r\n\r\nNik (07:45.645)\r\nLet's see here, I might have to, okay, cool. Yeah, it's fine, we'll be good. Okay, so in that scenario, who are you negotiating with? Are you going to the ISO or are you going straight to the providers?\r\n\r\n\r\nmitchell (07:49.838)\r\nIt says it restarted the recording.\r\n\r\n\r\nmitchell (08:01.612)\r\nYeah, so back in the day when ATMs first came out, the only way to get a good buy rate was to become an ISO. And to become an ISO, you have to have a sponsor bank. And a lot of this is going to be like, you know, too much detail for the listeners to actually care about. But essentially nowadays, you can just negotiate your buy rate by going to a bunch of ISOs and just trying to get the best possible deal. And so\r\n\r\n\r\nNik (08:29.675)\r\nIs your your buy rate determining your profit? Like is that interchange where you make your money or because I thought don't you also have fees that you charge for? OK.\r\n\r\n\r\nmitchell (08:38.958)\r\nYeah. So there's two revenue streams from the ATM. There's the surcharge, which is the big bulk of the income, right? Like, let's say you're charging $3 on the machine, and then you get to keep like maybe 20 cents of interchange or 25 cents of interchange. the revenue, like the vast majority of the revenue is going to be coming from the surcharge. When you process someone else's terminal, you don't get any of the surcharge. They get to keep the surcharge.\r\n\r\n\r\nNik (08:52.629)\r\nOkay.\r\n\r\n\r\nNik (09:04.994)\r\nHmm.\r\n\r\n\r\nmitchell (09:08.888)\r\nbut you get to keep a piece of their interchange, but you do nothing, right? It's purely passive income there, right? Because it's somebody else's machine. If it breaks, you don't care, it's their problem. If the owner kicks them out, you don't care, it's their problem. So it's two very different things, but.\r\n\r\n\r\nNik (09:12.289)\r\nInteresting.\r\n\r\n\r\nNik (09:25.887)\r\nYeah. When you come in as the ISO, do you have to put any physical pieces on the machine or is essentially your value that you're coming in and able to negotiate because you have economies of scale and so they're piggybacking off of your economies of scale and there's not actually a physical product that you have to like, are they they tying into your software? Are they implementing a card reader that you go and distribute like?\r\n\r\n\r\nmitchell (09:51.032)\r\nNo. Yeah, purely piggybacking, I would say that some of the value adds that people pitch as like, hey, you should come under us, is we'll give you great local support. So someone will say, hey, I have a route in Massachusetts, and I might try to pitch them on processing with us, but they'll be like, hey, I'm gonna go with somebody else who's local in Mass, and if I need help fixing machines, they are here and they can help me, right?\r\n\r\n\r\nThere's stuff like that, but no, mean, it's purely just like a middleman.\r\n\r\n\r\nNik (10:16.887)\r\nMmm.\r\n\r\n\r\nNik (10:21.773)\r\nBecause in the ISOs are they are they also servicing and fixing the machines? they loading the machines? No, OK.\r\n\r\n\r\nmitchell (10:27.744)\r\nNo, they can if they want to offer those services, right? Like, so some of the biggest ATM companies in the world, like PAI, for example, which is an ISO and a processor and was bought by Brinks like four years ago, because they were bought by Brinks, they offer armored truck services, right? they can load your machines for you and they have a bunch of other stuff that they can offer you. But purely they started out like me building an ATM route.\r\n\r\n\r\nNik (10:45.623)\r\nMmm.\r\n\r\n\r\nmitchell (10:54.7)\r\nthen they got big, they became an ISO, then they got even bigger, they became a processor, you know what I mean? And actually, PAI is not a processor, but anyway, it doesn't matter, those details are a little too deep.\r\n\r\n\r\nNik (11:02.335)\r\nAnd...\r\n\r\n\r\nNik (11:07.629)\r\nDude, is, okay. What was your background before you were in software?\r\n\r\n\r\nmitchell (11:13.366)\r\nYeah, I started out in e -commerce in my early 20s. I spent all my teenage years and college years just hustling, trying a bunch of different stuff, buying and selling stuff online. Then I built an e -commerce business in my early 20s. And then built some software with two of my best friends that was mostly for Amazon merchants. Started out as an agency, and over time we built software and it became more of a SaaS.\r\n\r\n\r\nslash agency model. And then we raised some VC money for it. And we were just kind of like going through the typical tech cycle of just like lighting money on fire and then like trying to raise more. I just, I don't know, I had this kind of like burning desire to like actually make money. And even if like long term, I that business is still around today and they're doing really well, but they're probably another four or five years away from some sort of exit. So anyway, I just,\r\n\r\n\r\nI just really want to get back to basics.\r\n\r\n\r\nNik (12:14.347)\r\nWhat drew you to, I mean, know that it was kind of just fortuitous, but what drew you to ATMs?\r\n\r\n\r\nmitchell (12:22.958)\r\ncan't say there's anything specifically that drew me to ATMs. Really it's just my brother and I put together like a short list of qualities we wanted to avoid. And so like one of the first things we talked about was we're not going to buy a landscaping company with like 40 landscapers. Like we just, we wanted to like minimize the amount of, because I, I don't know how true this is, but my feeling was always that it's much easier to.\r\n\r\n\r\nmanage capital than it is to manage people, right? And so there's like so many moving parts when you buy a plumbing company or landscaping company and like, there's just so much risk baked into the human capital aspect of it. You know, there's like key man risk and all this stuff that like when you read about search, like one of the first things that you read about. And so we were looking for something with as little of that as possible and you know, vending, laundromats,\r\n\r\n\r\ncar washes, ATMs, all kind of like fell into that camp. And we were actually looking at a vending business, we almost bought it. And then I think my brother had contacted another vending business that was for sale and he asked him why he was selling and the guy was like, I actually, I want to focus on my ATM business. And then my brother was like, ATMs. And then that just kind of, yeah, kind of snowballed from there.\r\n\r\n\r\nNik (13:42.253)\r\nWhat are the economics of an ATM? I know it varies on like probably volume, et cetera, but how much revenue can one ATM machine do?\r\n\r\n\r\nmitchell (13:53.038)\r\nThe maximum ATM, the maximum revenue one ATM can do is probably somewhere in the neighborhood of like three to four grand a month, I would say. There are probably some that do more than that in like, know, Caesar's Palace in Vegas or whatever, but you're never gonna get that ATM. So I would say like the average ATM across the whole country probably does like maybe 200 bucks a month in revenue. And then, you know, really good\r\n\r\n\r\nNik (14:01.943)\r\nOkay. Okay.\r\n\r\n\r\nNik (14:07.916)\r\nYeah.\r\n\r\n\r\nNik (14:19.821)\r\nWow.\r\n\r\n\r\nmitchell (14:22.83)\r\nlocations do like 400 to 800 and anything over 800 is like kind of like a home run location. And so, you know, the typical split is let's say you have a $3 surcharge, you give a dollar to the location and you keep the rest. I'd say that's kind of like rule of thumb. When we go out and buy ATM portfolios, we get tons of locations where the owner gets 50 cents or 75 cents and the surcharge is 350, which is obviously way better.\r\n\r\n\r\nBut that's because those deals were negotiated years ago and the owner just kind of like forgot about it. Nowadays, if you go and place an ATM, it's much more competitive. The merchants know what's kind of like the market rate. And so it's going to be harder to get away with that.\r\n\r\n\r\nNik (15:09.425)\r\nHow do they value these portfolios? Like if I was just looking at one ATM machine, how do you value that one machine?\r\n\r\n\r\nmitchell (15:17.454)\r\nIt's just based off the goodwill cash flow and so you know obviously there's like a little bit of equipment value there but I would say that the goodwill like you measure it based off of is there a contract there and how long has the machine been there for right so if there's a contract that's a seven -year term and an auto renews\r\n\r\n\r\nNik (15:22.455)\r\nOkay.\r\n\r\n\r\nmitchell (15:43.438)\r\nyou know, six months before the end of the term and the machine has been there for 15 years. I mean, you can pretty confidently predict that that machine is going to continue to cashflow for, you know, indefinitely until ATMs are gone basically, right?\r\n\r\n\r\nNik (15:57.197)\r\n$200 a month in revenue translates to what? Like net income or cash flow.\r\n\r\n\r\nmitchell (16:03.886)\r\nYeah, so I want to preface that by saying there's like, you know, probably six or 700 ,000 ATMs in the country. I don't know the exact number and a lot of them are really bad. And so when I said the average is 200, like, you know, some people might listen to this with an ATM route and say, that's way too low. Mine do more than that. Or, you know, others will listen and be like, wow, that's kind of high. All of mine do like 70 bucks. So it's, you know, it really depends and it varies a lot. But off of $200, you know, let's say you're giving a third of it.\r\n\r\n\r\nNik (16:11.05)\r\nYeah.\r\n\r\n\r\nmitchell (16:33.07)\r\nto giving a third of it to the store owner, yeah, to the location, then you keep about 130, whatever, 135 bucks. If you're loading it yourself, that 135 is your net. But then you have additional cash outlay that's sitting inside of the machine, right? If you outsource it and somebody else loads it for you, usually you pay them a dollar. So that'll be another one third of it gone.\r\n\r\n\r\nNik (16:36.151)\r\nto the location, okay?\r\n\r\n\r\nNik (16:48.14)\r\nHmm.\r\n\r\n\r\nmitchell (17:01.07)\r\nAnd so you would keep 66 bucks off of that.\r\n\r\n\r\nNik (17:04.887)\r\nSo there's cash outlay, when you're buying, like you're buying the cash with cash, essentially.\r\n\r\n\r\nmitchell (17:11.15)\r\nIf you're going to load it yourself, then yes. So there are kind of three main ways you load the machine. One is you or your employees take your cash, your business's cash and put it into the machine. The second is another ATM operator or somebody who's just called a vaulter, meaning they just vault the cash for you. They use their own money and put it into the machine. Or the third is you get an armored truck to load it. And the armored truck model is you pay per visit.\r\n\r\n\r\nand then you borrow the money from the bank. So usually pay like prime plus half a percent or prime plus percent on the cash that's sitting in the machine.\r\n\r\n\r\nNik (17:46.827)\r\nWhich one of those do you prefer?\r\n\r\n\r\nmitchell (17:49.262)\r\nSo each of them have their pros and cons, right? So Armor would be the best except because of the way that the economics are structured, you can't really justify using Armor on the vast majority of locations. Meaning, if a location does like 70 transactions a month and it nets $210 in surcharge income and you pay\r\n\r\n\r\n$90 per visit or $100 per visit from the armor company. And then you pay to borrow the cash as well. After you've paid the owner, you paid the armor truck, you've lost money or you've broken even at best. So armor really only works on high volume locations for that reason. But armor is great because assuming the armor company uses reliable, which is another conversation, but if the company that you use is reliable, it's great because you just.\r\n\r\n\r\nNik (18:30.359)\r\nYeah.\r\n\r\n\r\nNik (18:35.586)\r\nMm\r\n\r\n\r\nmitchell (18:45.294)\r\nput it in an order, like you send an email with a work order and they just show up, right? It's just like, it's robotic. Volters, independent Volters, it's great because you pay per transaction so you can never lose, So the volume doesn't really matter. Although they can turn down the location and say there's not enough volume for it to make sense for me. But anyway, Volters, the problem is that they can just not show up and not fill the machine, right?\r\n\r\n\r\nAnd then you have the owner calling you yelling at you because you own the machine and they're like when are you gonna show up and you can't be like you don't understand. I use a third -party Volter like they don't they don't care. It's like that's not their problem, right? They don't care about that. So and then You make the most money when you load it yourself with employees, but then there's cash risk your employees have to drive around with your cash They could get robbed If the machine gets stolen the cash inside of it is yours as well. So there's the risk there\r\n\r\n\r\nNik (19:24.769)\r\nyou\r\n\r\n\r\nmitchell (19:44.398)\r\nSo, you know, we do all three. Like we have a fleet of locations we load ourselves with our own money. We have a ton of locations that are loaded by third party Vaulters and then we have some stuff on armor. So I don't really have like a blanket answer for which is best.\r\n\r\n\r\nNik (20:00.077)\r\nNo, it's just to like close, close the loop on this one. that for that vending vending machine ATM machine that's 62, $63 a month in cash flows. So we're talking about 750 bucks a year. What? How do you value that? Is there like a multiple of cash flow that you say, All right, this machine is worth 5x\r\n\r\n\r\nThat I mean, I know it's dependent on the contract, but there's probably some industry standards, or at least I'm hoping.\r\n\r\n\r\nmitchell (20:30.766)\r\nYeah, yeah, the industry standard is, it's interesting because a lot of the routes that you go and look at online, they list the pre -vaulting income, meaning they don't account for that dollar that it costs to load the machine. And so they give you the net income off a route that they've been loading themselves for 20 years, right? So it's usually it's like one guy, has 85 machines, he's been driving around himself.\r\n\r\n\r\nNik (20:47.287)\r\nHmm.\r\n\r\n\r\nNik (20:56.599)\r\nRight, right, right.\r\n\r\n\r\nmitchell (20:58.658)\r\nwith his own money sitting in like a backpack in his trunk, right? And he's like, well, this is my net income and I'm gonna charge you three years of that net income. And that's kind of like the industry standard that you see, but that's a really bad deal because if you outsource that route for a dollar per transaction, that three X multiple is now like five or even six X, right? And like paying six X for an ATM.\r\n\r\n\r\nis just not a good idea. think, like, look, hindsight is 20 -20. Like, it was 2004, I would have happily bought all the ATM routes for 6X, right, if outsourced. Because, I mean, it's very little work, it's very scalable, and, I mean, they've been printing money for 20 years. You know, we could talk about this a little bit. Usually people ask me about, like, the decline of ATMs.\r\n\r\n\r\nNik (21:29.932)\r\nReally?\r\n\r\n\r\nmitchell (21:56.462)\r\nYou know, nowadays paying 6X for it, like, I think is very risky. Like, I'm not worried about where ATMs are going to be next year or two years from now. I'm a little bit worried about where they'll be seven, eight, nine, 10 years down the line. And so I think, I think that paying a lower multiple is like really important in terms of mitigating your risk. So.\r\n\r\n\r\nNik (22:20.173)\r\nIt is your net. So what would you say for average industry ATM operators? What's what's their net income? Is it somewhere in the ballpark of 20 %?\r\n\r\n\r\nmitchell (22:31.342)\r\nAre you asking about their net margin?\r\n\r\n\r\nNik (22:32.429)\r\n30 %?\r\n\r\n\r\nmitchell (22:36.974)\r\nSo I know from our portfolio across the whole thing, our EBITDA margin has always been north of 35%. I think when we started, it was extremely high. was like 60%, but that was just unsustainable. And it's kind of leveled out around the high 30s. So that's.\r\n\r\n\r\nNik (22:58.733)\r\nIs that normal for the industry?\r\n\r\n\r\nmitchell (23:01.9)\r\nI believe so. mean, I haven't looked at PNLs of like everybody's portfolio, but.\r\n\r\n\r\nNik (23:06.487)\r\nI'm just, yeah, I'm just, curious. Like that is a high net income. Is there a lot of inherent risk in these industries? Obviously theft is a risk, is it as big of a risk? Okay, what are the risks?\r\n\r\n\r\nmitchell (23:18.498)\r\nYeah, there's a ton of risk. Yeah, there's a ton of risk. The first risk is that there's just like constant attrition because your customers are these like really fragile and, you know, frankly, like pretty incompetent business people. so like, like, like most of your locations are like, you know, some really like small mini mart or liquor store or\r\n\r\n\r\nNik (23:36.875)\r\nOkay.\r\n\r\n\r\nmitchell (23:47.362)\r\nknow, gas station, whatever, all these businesses like change hands all the time. People come in and out. And so whenever the business gets sold, you're at risk of getting kicked out. The businesses shut down a lot. You're at risk of getting kicked out. And so like, I'd say that's kind of like the major risk. You know, the other risk is theft, obviously, although I think like that's pretty overblown.\r\n\r\n\r\npeople will give you different opinions on that because it really just depends on how many machines you have and how lucky or unlucky you got, right? Because somebody could have like 15 machines in LA and they had three machines stolen last year and they're like, this is just insane. Like, I'm losing 20 % of my business to theft. But I mean, I can tell you as someone with hundreds of machines, on average, it just doesn't really matter.\r\n\r\n\r\nYou could just basically factor in like 1 to 2 % of gross revenue lost to theft and that's like, you know, pretty good estimate I would say.\r\n\r\n\r\nNik (24:52.119)\r\nYeah, what's a typical useful life of an ATM machine?\r\n\r\n\r\nmitchell (24:56.334)\r\nSo this is actually quite interesting. The useful life of an ATM is extremely long. Like we purchased machines that are probably from 2004, 2005, and they still work. Obviously parts will break in them, but you can just replace that part and it'll just keep going. Like some of these things are workhorses. And the reason I said it's interesting is because you can depreciate these things on a seven year, either a five or a seven year useful life.\r\n\r\n\r\nNik (25:05.847)\r\nWow.\r\n\r\n\r\nmitchell (25:21.838)\r\nAnd so there's actually like a ton of efficiency there in terms of like from a tax perspective.\r\n\r\n\r\nNik (25:28.585)\r\nAnd that would make sense to like if they're if they're, you know, depreciable five to seven years, your your gross unit margins are going to be high because, you know, theoretically, you've got high capex that you that you may need to do if you're investing in these in these machines. But also, like, I don't care if my if an ATM has the latest gadgets on it, I just want to know whether or not I can get cash out of it. You know, like, I don't care. I don't care, like how, you know, recent it was built. What do you think of like,\r\n\r\n\r\nmitchell (25:51.182)\r\nCorrect.\r\n\r\n\r\nNik (25:58.295)\r\nBitcoin ATMs or I guess that's the only really one I know about that are kind of popping up around the place.\r\n\r\n\r\nmitchell (26:05.166)\r\nI don't know a whole lot about it so I am not speaking from experience but what I do know is that the model that we've used where we go out and acquire ATMs is not going to work or is not that it's not going to work it's just much riskier with Bitcoin ATMs because Bitcoin ATM performance largely follows Bitcoin performance and so you know when we're in a bull market Bitcoin machines are\r\n\r\n\r\nNik (26:12.749)\r\nPeace.\r\n\r\n\r\nNik (26:17.239)\r\nThanks\r\n\r\n\r\nNik (26:26.455)\r\nBitcoin.\r\n\r\n\r\nmitchell (26:31.086)\r\ncredible and then when everything collapses, nobody even looks at them. And so if we're going to look at a portfolio and buy based off of like 2019, 2020, 2021 cashflow, I mean, we'd just be lighting money on fire because it's probably 50 % of that today. But I don't really know much beyond that. I know a guy who has a lot of them and what he's told me is it takes a lot of effort to like mature locations. So they do a lot of marketing where they go out and,\r\n\r\n\r\nbasically put up signs or do a lot of like SEO work to try to put their locations onto a Bitcoin ATM directory online and slowly you start to get traffic that way.\r\n\r\n\r\nNik (27:13.101)\r\nWhat's your strategy? you only buy portfolios or are you also scouting, know, de novo locations and then purchasing machines and placing them? What's your growth strategy?\r\n\r\n\r\nmitchell (27:24.366)\r\ngrowth strategy is largely buying. I would say we've placed like maybe 40 machines total since we got into the business. A decent amount of it has come from Twitter. ATMs are a really saturated market. They've been around for a really long time. And so the best locations are largely taken and it's very rare that you're going to like go out and find a location and place an ATM and it just does a thousand dollars a month. And you're like, wow, how did no one put an ATM here? Like,\r\n\r\n\r\nNik (27:37.581)\r\ncrazy.\r\n\r\n\r\nmitchell (27:54.296)\r\nThat's just kind of like a bit of a pipe dream. So you're much better off trying to find some guy who vastly undervalues his portfolio and sells it to you for a good price than spending your time trying to find your location.\r\n\r\n\r\nNik (28:10.093)\r\nDo you, as the owner operator, are you like marketing for this? Are you doing pay -per -click, SEO, Google business profile optimization, or is it dependent on the location to do the marketing for you? Does that make sense?\r\n\r\n\r\nmitchell (28:26.542)\r\nfor the machine itself is sitting in a store? No, no, we don't do any of that. ATMs are largely like a convenience play, meaning like the people usually, I think, I actually don't know if this true has been my theory, are usually just like walking and see the ATM and then realize that they need cash and just walk up to it. I don't think it's, I think it's very rare that somebody is like,\r\n\r\n\r\nNik (28:28.609)\r\nYeah. Yep.\r\n\r\n\r\nmitchell (28:55.296)\r\nsitting in their house and they're like ATM near me, right? And then it's possible, but the other thing is that like no ATM operator wants a list of their locations anywhere available online, mostly for like security concerns. And so, yeah, I don't know. We've never done any of that. Maybe that's a mistake, but we've...\r\n\r\n\r\nNik (29:00.215)\r\nYeah, I have no idea.\r\n\r\n\r\nNik (29:22.221)\r\nI have a friend of mine who he did on the podcast, buddy, and he does Google business profiles. That's his business as he works with companies and he optimizes their Google profile. And he worked with a Bitcoin ATM company recently and supposedly drove their revenue from $2 million a month to $2 .3 million a month just by optimizing like in the course of weeks, just by optimizing their Google business profiles locally.\r\n\r\n\r\nAnd I thought, that's interesting. also Bitcoin ATMs are not as ubiquitous as just cash ATMs. So.\r\n\r\n\r\nmitchell (29:55.736)\r\nWell, that makes a ton of sense to me because of the last thing we talked about, right? The guys that I've spoken to in Bitcoin ATMs told me that they spend a lot of time putting their locations out there and trying to drive traffic specifically for the Bitcoin ATM. But I would be very surprised if you can drive traffic to a specific liquor store because your ATM is there, because every liquor store has an ATM machine. So it's like, but\r\n\r\n\r\nNik (30:07.543)\r\nHmm.\r\n\r\n\r\nmitchell (30:24.78)\r\nYeah, I don't know. It's interesting. mean, I wouldn't be opposed to learning more about it. I just I've really been laser focused on buying portfolios, but yeah.\r\n\r\n\r\nNik (30:29.281)\r\nI bet\r\n\r\n\r\nNik (30:32.863)\r\nI would bet if you have somebody who's equidistant from free liquor stores and they don't necessarily know that they're equidistant from three liquor stores that have ATMs and they just on their phone ATM machine, they're probably gonna go to the one that says, ATM machine. Anyways, but I don't know. That's just like anecdotal. That's what I would do. I have no idea if there's like data to support that. All right, I have some rapid fire questions for you. Ready?\r\n\r\n\r\nWhat for you, what's the biggest bottleneck to growth?\r\n\r\n\r\nmitchell (31:04.792)\r\ngood deals, finding good deals. Yeah, finding portfolios that aren't overpriced, really.\r\n\r\n\r\nNik (31:06.529)\r\nJust good deal. Okay.\r\n\r\n\r\nYou have like three focuses, which I thought was interesting and I can't remember all of them, but there's one is just you own and manage the machines yourself. So you load, unload, whatever. Another is you have a bunch of machines and you outsource management of that. And then the like the third model is essentially you become like an ISO or processor where there's kind of three ways to make money. Is it normal to do all three or is it?\r\n\r\n\r\ntypical for companies to niche down on one of those three.\r\n\r\n\r\nmitchell (31:47.776)\r\nNo, it's normal, I would say. I would say most portfolios you look at, the larger it gets, the more likely it is that they have processing income because it's just like a relationships and networking thing, right? So you grow in the business, you meet more ATM operators, you talk about interchange. This guy says, Hey, I'm actually kind of getting screwed on my interchange under the ISO mat. You become friends with him. He moves his portfolio under you. And so that that's just kind of like a natural part of the growth cycle and ATMs.\r\n\r\n\r\nNik (31:49.612)\r\nOkay.\r\n\r\n\r\nmitchell (32:17.102)\r\nI mean, most people who have less than 50 machines probably load them all themselves and probably don't have any processing income. But as they start to grow beyond that, it's very like.\r\n\r\n\r\nNik (32:30.64)\r\nWhat do you love about this business?\r\n\r\n\r\nmitchell (32:33.962)\r\nwhat i love about i love that it is i love that has low labor intense that's my favorite part about it it's mostly just managing capital\r\n\r\n\r\nNik (32:41.549)\r\nIt's a great, yeah, that's that.\r\n\r\n\r\nWhat do you hate about it?\r\n\r\n\r\nmitchell (32:48.63)\r\nI hate that you have to manage a thousand different micro relationships with like convenience store owners. They are a nightmare. It's horrendous. It's worse than you imagine. So that's by far the worst.\r\n\r\n\r\nNik (33:03.949)\r\nDo you have wraps that you employ?\r\n\r\n\r\nmitchell (33:08.238)\r\nNo, we an office admin. The tricky thing about when you buy portfolios is that you really don't want any of the merchants, we refer to them as merchants, the customers, whatever you want to call it, but the owners of the locations, you don't want any of them to know that the portfolio was sold. As soon as they know that the portfolio was sold, they...\r\n\r\n\r\nNik (33:09.421)\r\nor do you manage all of those yourself?\r\n\r\n\r\nmitchell (33:31.362)\r\nThey wanna renegotiate, they wanna kick you out. They're like, where's the old guy? I miss Bob. Like, Bob was my friend. He didn't tell me that he was selling. Like, they just, have all these demands, even though the machine still works, they're still getting paid every month. Nothing has changed for them. And really, they don't need to know, right? And so, you know, it's very important that you kind of make that transition as smooth as possible. So, yeah.\r\n\r\n\r\nNik (33:50.23)\r\nand the\r\n\r\n\r\nNik (33:57.838)\r\nThat is so funny. What industry or business are you the most jealous of right now? All of us are jealous. I'm jealous of commercial real estate. I'm curious like what you look at and think, man, must be nice to own that business.\r\n\r\n\r\nmitchell (34:09.387)\r\nreally high margin SaaS businesses, I guess.\r\n\r\n\r\nNik (34:13.941)\r\nOkay, fine. Common answer. I know it's good. Totally agree. If if you have two hours in your day, and you don't have any family stuff, you don't have any work stuff, what what are you obsessed with right now? What are you spending your time on? That's taking up mind share.\r\n\r\n\r\nmitchell (34:18.296)\r\nHahaha\r\n\r\n\r\nmitchell (34:30.709)\r\nUI.\r\n\r\n\r\nNik (34:34.379)\r\nWhat? Comfy UI?\r\n\r\n\r\nmitchell (34:36.204)\r\nUnibot Comfy UI.\r\n\r\n\r\nNik (34:37.941)\r\nNo, I'm an idiot apparently, tell me.\r\n\r\n\r\nmitchell (34:39.438)\r\nNo, you're not. It's quite new. Well, actually, Comfy UI has been out for a year or two now. But do you know about AI image generation, like flux and stable diffusion and all this stuff?\r\n\r\n\r\nNik (34:52.416)\r\nYes.\r\n\r\n\r\nmitchell (34:53.804)\r\nSo Comfy UI is a GUI that was built that allows you to play with these models and have like a ridiculous amount of control over basically it has these like user friendly nodes they're called and you can connect to each one and you can say, I'd like you to remove the background on this or I'd like you to, you you say, okay, generate the face of a medieval warrior and it generates the face of a medieval warrior. Then you crop that image and you say, okay, I'd like you to\r\n\r\n\r\nNik (35:09.943)\r\nHmm.\r\n\r\n\r\nmitchell (35:23.562)\r\nlock the features of this face in place. And now I'd like you to create, and you can keep prompting off of that, you create, called workflows. You can create these really complex workflows that basically create a character, then lock in their face, then change the body, then, and you can do this for anything. Like you could do it for product shots. So can like take pictures of a Nike Air Force shoe and then be like, create, you know, a Nike campaign with this shoe and put it like,\r\n\r\n\r\non the background of New York City or whatever. And you can basically just, you have this insane amount of control and I'm just so fascinated with it. I've been spending all of my free time on\r\n\r\n\r\nNik (36:02.135)\r\nThat's freaky. That's amazing, man. But okay, I'm gonna have to go check it out. comfy UI. Love it. What advice would you give to your pre entrepreneurial self?\r\n\r\n\r\nmitchell (36:14.658)\r\nMy pre -entrepreneurial self.\r\n\r\n\r\nmitchell (36:28.398)\r\nTry more stuff.\r\n\r\n\r\nNik (36:31.326)\r\ntry more stuff earlier or like even even as you become an entrepreneur try more stuff.\r\n\r\n\r\nmitchell (36:38.05)\r\nLike in the beginning, try more stuff. think...\r\n\r\n\r\nI think I, because I was buying and selling stuff on Craigslist in high school and in college, I started buying stuff on Alibaba and then I got into e -commerce. I was so focused on that one thing and I wish I had just played around more in entrepreneurship. I'm actually a huge fan of Chris because of this. He's just.\r\n\r\n\r\nI love his threads on his ADHD approach to entrepreneurship. It's so inspiring and I wish that I had that early on. A lot of people say focus is the number one thing that you need to have to build a big business or to build really big success in entrepreneurship. I think I really disagree with the fact that that is a correct blanket statement for everyone.\r\n\r\n\r\nNik (37:15.905)\r\nYeah.\r\n\r\n\r\nmitchell (37:37.91)\r\nAnd I think Chris is a shining example of that. And my brain works that way too, which is why I'm spending time on comfy UI now, which is why I went from e -commerce into software and then into ATMs, which makes absolutely no sense. And then you ask me what I'm jealous of and I'm like, back to software. So my mind works that way too. And I wish that I had just tried micro businesses here and there early on.\r\n\r\n\r\nNik (37:56.086)\r\nYeah\r\n\r\n\r\nNik (38:02.913)\r\nYeah, that's great advice, man. Well, this dude, this has been awesome. I appreciate you being super transparent with all your business works and educating me an idiot on how ATM machines actually operate. Where can people come find you? Where's the best place to come see what you're doing?\r\n\r\n\r\nmitchell (38:18.67)\r\nTwitter mostly. I'm Mitchell the ATM guy. It's Mitchell underscore Sorkin I haven't been super active on there recently, but yeah, you can scroll through my history there You can also shoot me an email Mitchell at Sorkin ATM comm and\r\n\r\n\r\nNik (38:36.429)\r\nOkay, next time I'm in LA, I'll come say what's up.\r\n\r\n\r\nmitchell (38:39.086)\r\nPlease, please do.\r\n\r\n\r\nNik (38:40.927)\r\nAll man, have a good one.\r\n\r\n\r\nmitchell (38:42.05)\r\nYou too.",
  "metadata": {
    "duration": "",
    "date": "2024-12-18",
    "platform_source": "Google Drive"
  }
}