{
  "episode_number": "249",
  "episode_title": "How Jesse Tinsley Built a $750M+ Business in 12 Months",
  "guest_name": "Jesse Tinsley",
  "business_name": "Main Street",
  "transcript": "﻿Nikolas Hulewsky (00:01.044)\r\nOkay, Jesse Tinsley, you have had the craziest 12 months of any entrepreneur that I have ever personally known. You read about these stories, Rockefeller or Elon Musk, et cetera, but you don't actually get to know some of these people. So let me just recap. Since we last spoke, I was already blown away the last time we spoke, you talked about buying employer.com, which was amazing in and of itself. And before that, you had already bought a company that was public and kind of taken a, anyways, just.\r\n\r\n\r\nsome crazy things. But then since we last spoke over Christmas weekend, this company called Bench, which was an accounting firm announced whose customers was closing down on a Friday by Monday morning. You had announced that you were buying bench and you had had no prior conversations with them. Boom. Already nuts. Then like the next week you're like, Hey, I think I'm to buy Tik TOK. I remember you texting me. I'm like, is this guy serious? And sure enough, you put together a group, including Mr. Beast.\r\n\r\n\r\nto buy TikTok. You didn't end up buying TikTok, but it was an incredible bid. Then you go on and you've bought several other acquisitions. Cap, think was the name of the company. You've rebranded to Main Street. Dude, you have probably a more than billion, probably approaching a couple billion dollar enterprise value company that you've built. Kind of out of nowhere. Like you've come out of nowhere. You've made yourself a billionaire, not through inventing Facebook, and that's my words, Facebook or Uber or something.\r\n\r\n\r\nJesse (01:08.65)\r\nThanks,\r\n\r\n\r\nNikolas Hulewsky (01:28.392)\r\nYou just went out and freaking crushed it operationally. Where did you come from, Where did you come from?\r\n\r\n\r\nJesse (01:36.301)\r\nThat's a very nice intro. I appreciate it. It's been a crazy 12 months. It's been nonstop, but a lot of fun. think growing up in Silicon Valley gives you a taste for the extremes. So that was a good advantage and head start.\r\n\r\n\r\nNikolas Hulewsky (01:55.967)\r\nDude, it's been like, I mean, I made the joke. Literally you texted me you're like, yeah, I'm gonna buy TikTok next. my head was like, this guy can't be serious. Is this a joke? Is he joking? You weren't joking. And then next thing I see a news story, Jesse Tinsley putting together this group that's like about to buy TikTok. How did you, like, are you just speaking this stuff into existence or did you make a deal with somebody that I don't know about? It's like granting you these amazing opportunities. How are you doing it, man?\r\n\r\n\r\nJesse (02:07.245)\r\nA minute of time.\r\n\r\n\r\nJesse (02:24.917)\r\nDefinitely no deals. no, think a lot of it comes out like that. Generally, think the serious note, think if you have big ambitions and you can actually like have a track record of like producing operational efficiencies and closing on deals, people tend to want to back you. I'm joking.\r\n\r\n\r\nNikolas Hulewsky (02:27.476)\r\nYou\r\n\r\n\r\nJesse (02:47.789)\r\nRecently, it's like easier to go raise like $100 million than it is to raise like five. Like I'd rather much rather go raise the hundred because there's a lot more like larger, like check sizes. Whereas five, you might have to cobble it together through 25 investors. You know, you might raise the whole hundred from one person. So, uh, so it's just different. It's a different scale and scope and the audience is very different. So I think, yeah, I think, I think tick tock, tick tock is a very unique asset. think, uh, also too, right. That's the, you know, the most popular social media.\r\n\r\n\r\nlike company in the world at the time. And I don't think that's a hard one to raise on. take some credit away from myself, but it was fun. It was a really fun process. think my way kudos to like, you know, think there's a very good, the group ended up getting it. It's obviously world class with Susquana and A16Z and Silver Lake and all of them. Just, yeah. So to put that out there, like another great group.\r\n\r\n\r\nNikolas Hulewsky (03:25.256)\r\nWhat was?\r\n\r\n\r\nNikolas Hulewsky (03:37.79)\r\nDude, okay, how did you even get in the room? Like, offense to you, but most people outside of maybe your small circle know who Jesse Tinsley is, right? They know who Oracle is or they know who Microsoft is, but then all of sudden this guy, Jesse Tinsley comes out of nowhere. He's leading a group that has real, like 20 plus billion dollar bid to buy TikTok. How did you even get in the room?\r\n\r\n\r\nJesse (04:01.932)\r\nYeah, think the project was just as things generally, there's like a flywheel effect of momentum, right? Once you get certain things in process, more people want to join, right? And so we're obviously really fortunate enough to have worked with some great folks like Jimmy and his team and David Buzuki, CEO of Roblox and folks like that. They're just, and Nathan McCauley from Anchorage, some just really amazing folks.\r\n\r\n\r\nwhich was a lot of fun. I think the more momentum you have, it's just like, just kind of things kind of fall into place. Lots of synchronicities, I'd say. So, but it's a lot of\r\n\r\n\r\nNikolas Hulewsky (04:40.392)\r\nWell, okay, let's, let's go back. You, in the fall you bought employer.com and, and transition there. And then Christmas time rolls around and everybody on Twitter was kind of running around with their hair on fire because bench accounting, bench accounting shut down. They were done. They announced to all their customers on a Friday. They're like, sorry, we can't service you anymore. They, they were, they were going out of business and\r\n\r\n\r\nJesse (05:06.986)\r\nYep.\r\n\r\n\r\nNikolas Hulewsky (05:09.212)\r\nAnd you, you didn't have an inside line on bench, right? Like you weren't already talking to them.\r\n\r\n\r\nJesse (05:15.083)\r\nNo, yeah, just take one step back actually from that. So what happened when I originally started my first business was a services business and my co-founders, David and Ben and I got together at the end of last year and basically founded what was going to eventually become employer.com. So we didn't actually kick off that, like start that business, which acquired my first company and acquired Bench and acquired all these subsequent businesses and started to grow pretty massively until about\r\n\r\n\r\nNovember of last year, October, November of last year. So that's when we really went all in on what's now rebranded as Main Street, but then obviously led to the acquisition of Bench and all of the subsequent brands. only, the business has basically only existed about a year, just to put it in context, first off. So I think part of it was, and this is kind of a very interesting story on the bench side, I think. I was on\r\n\r\n\r\nNikolas Hulewsky (06:03.367)\r\nInsane.\r\n\r\n\r\nJesse (06:15.209)\r\nIt was the weekend between Christmas and New Year's and so it like the most dead weekend that probably exists in business, at least in North America. it basically was, I didn't even see the news until Saturday and I was on the East coast. And so I woke up and I had a few messages from folks. And what was interesting is I'd actually talked to our CTO, Ben, about we needed some like general manager, like accounting and tracking software, either through a partnership or\r\n\r\n\r\nbuilding it ourselves. And I was like, wow, this is like really fortuitous timing because like, seems like to probably buy this business that does the exact thing that we need to integrate with other systems. And so I reached out to a mutual connection and connecting with the board. And those conversations evolved, you know, very, very quickly. And yeah, that it was, yeah, things kind of took off from there. Happy to dive more into the story, but that's the\r\n\r\n\r\nNikolas Hulewsky (07:13.054)\r\nWell, you just, and you just reached out on LinkedIn, right? You reached out to somebody on LinkedIn who was kind of a mutual and then they put you in touch with the board.\r\n\r\n\r\nJesse (07:20.383)\r\nYeah, exactly. Yeah, one of the executive as a competitor, the report directors and.\r\n\r\n\r\nNikolas Hulewsky (07:21.908)\r\nfreaking nuts.\r\n\r\n\r\nNikolas Hulewsky (07:27.326)\r\nSo how big was Bench? Right? Because they were VC backed. They were a tech platform that all of sudden just said, no, we're out of business. How many customers did they have? Do know how much ARR they had at the time where they said they were going out of business?\r\n\r\n\r\nJesse (07:40.682)\r\nYeah, I think it was roughly, um, don't have to pull up in front of you. So not exact numbers, but can get rough, rough estimates. It was like roughly like a very healthy business, very unfortunate circumstances, obviously for, um, many people. I think the roughly looking like, I think it was like 11,000 customers and 40 million ARR, something to that effect. And I think according to, uh, like some of the, like articles that have been released, apparently we paid.\r\n\r\n\r\nNikolas Hulewsky (07:44.244)\r\nThat's fine.\r\n\r\n\r\nNikolas Hulewsky (08:01.854)\r\nCheers,\r\n\r\n\r\nJesse (08:10.441)\r\n9 million in cash for it. So it's allegedly. That's the exact number. Articles say that. I did not. I've never talked to those writers though.\r\n\r\n\r\nNikolas Hulewsky (08:15.252)\r\nApparently, I don't know, the articles.\r\n\r\n\r\nNikolas Hulewsky (08:22.932)\r\nSo $40 million in error, they couldn't have been worth nothing. Why did they just announce to customers and employees, like, hey, we're out. Why didn't they try to sell this thing? Or did they try to sell this thing? Or can you talk at all about what happened leading up to that Friday announcement?\r\n\r\n\r\nJesse (08:42.602)\r\nI don't know, so I can only speak to my experience. have no idea. I was there and there wasn't some. Actually, yeah, I don't have much context. think that's, if you look at some of the same articles, they have some hypothesis of what happened. think it's probably where I got my information from, honestly. But what I would say is that they were running at a very high burn rate.\r\n\r\n\r\nI think we're like, we looked at companies historically across that 21 to 23, 24 timeframe. lot of them were spending money to grow at all costs. I think they kind of got caught up in that, that mindset. And so, you know, was basically just a cashflow, you know, cashflow issue for covering, you know.\r\n\r\n\r\nNikolas Hulewsky (09:32.052)\r\nHow big was your company? I'm just going to call it Main Street just for simplicity sake. I know it was kind of a lot changing. But at the time, Main Street, if you were to compare $40 million ARR with Bench to Main Street, what was Main Street doing?\r\n\r\n\r\nJesse (09:36.093)\r\nYeah, lots of moving pieces.\r\n\r\n\r\nJesse (09:46.921)\r\nNot that, not as much, not nearly as much. were doing, we just started, we had just started, yeah, we had just started. So like, other than rolling in, we acquired, we were in the process of acquiring a other companies and we were probably right around, you know, one fourth or one fifth the size of the company. Something smaller, was much smaller, a lot of AR basically.\r\n\r\n\r\nNikolas Hulewsky (09:48.98)\r\nYeah. Give me a 20, 10. OK.\r\n\r\n\r\nNikolas Hulewsky (10:12.212)\r\nSo like way smaller, my first question to you was, I remember us talking about it, was like, how? Like this bench is way bigger, it's a distressed asset, and it's not necessarily something that was in your core competency. like to me it was, it's mind blowing. Like how did you even A, figure out a way to buy it, and then B, figure out a way to actually integrate and onboard a company of that size with 11,000 customers?\r\n\r\n\r\nJesse (10:38.185)\r\nYeah, definitely. Kind of get back. So first off, I would say we had a broader vision prior to this stuff, like a full end to end, like SMB, like back office automation, which included like originally the idea stemmed from like, going after like the payroll, like EOR space, but that was like less appealing as we dove more and more into it. Mainly because there's just a lot of competitors that are really great at like deal who we just did this deal with.\r\n\r\n\r\nNikolas Hulewsky (11:04.084)\r\nMm-hmm.\r\n\r\n\r\nJesse (11:07.367)\r\nCapBase and Gusto and there's Rippling and Workday and Plelocity and Paychex where the list goes on. There's tons. Yeah, exactly. Everyone can name a new one on top of that. There's no shortage of payroll providers, but there's not very many accounting companies like software companies. There's really, if you looked at the top ones, you're looking into it, Xero, FreshBooks, Main Street, and maybe NetSuite on the enterprise side or Wave. Those are really the only big ones that\r\n\r\n\r\nNikolas Hulewsky (11:12.926)\r\nBambooHR.\r\n\r\n\r\nYeah.\r\n\r\n\r\nJesse (11:36.477)\r\nthat have a lot of scale and scope. Everything else is much, smaller. So if you compare that to other sectors for like back office SMDs, like we thought that was a really, really big opportunity. So when this came up, we were all hands on deck and we kind of built our operating model where like our CTO and COO could plug in and actually to run companies day one. Like, and we proved that thesis out in a very short 36 hours that weekend.\r\n\r\n\r\nNikolas Hulewsky (11:49.758)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (12:04.924)\r\nIt reminded, when you were telling me the story, it reminded me of, there's a famous story of Elon. I think it's over Thanksgiving day or Thanksgiving. Did I lose you? you're here. Okay. Sorry. So Elon over Thanksgiving, they're flying and he's asking how long it would take for them to actually move their server center in Sacramento. And one of the members of the team was like, weeks. And Elon's getting like more and more irritated because they're telling him.\r\n\r\n\r\ntimeline that he doesn't want to hear. And so he's like, screw it. Let's go to Sacramento right now. So they turn around midair, they go to Sacramento, they land and Elan's there with like a freaking knife. lets the guy, the security guard lets him in and they like move racks that weekend. And that story reminded me of this bench story because it's a bigger company. And in one weekend, they went from we're going out of business to then sending an announcement Sunday night or Monday. I can't remember. Hey, actually,\r\n\r\n\r\nJesse (12:36.744)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (13:00.658)\r\nEmployer.com is going to be servicing you from now on and you're not actually going to lose access. Congratulations, you're still going to have ongoing support. It was mind blowing, but the thing that is the most mind blowing is that your customer satisfaction has not gone down. How has the experience been of bench customers that have transitioned to working with you?\r\n\r\n\r\nJesse (13:25.415)\r\nYeah, I think, like all things, we're always striving to improve and make it better and better. think part of that was too is just that our NDS obviously has gone up. think TURN has gone down quite substantially.\r\n\r\n\r\nNikolas Hulewsky (13:38.9)\r\nCan you say that one more time? it's NPS, what does that mean?\r\n\r\n\r\nJesse (13:42.887)\r\nNet promoter score. like how your users and customers would give you feedback based on what their overall sentiment is. And so that's been like a great, I think, turnaround story with we've actually taken the business from, I think they lost like 40 million roughly on a P &L basis, like in 2024 to, you know, positive cash flow, free cash flow, positive, but also like an EBIT of like...\r\n\r\n\r\nsomewhere between 12 and 15 million just on that business alone. So it's like roughly a 50 plus million dollar swing with less people and also like really, really high increase like efficiency and better light outcomes for customers. And we're obviously still working on improving that, but I think part of that's like a mindset shift and I can tell an interesting story. Like he didn't poke, like he was like week one at the owning bench, but it's been, we've been driving a lot of business.\r\n\r\n\r\nNikolas Hulewsky (14:19.699)\r\nWhat?\r\n\r\n\r\nNikolas Hulewsky (14:23.924)\r\nhole.\r\n\r\n\r\nNikolas Hulewsky (14:43.294)\r\nTell me, what's the week one of owning a bench?\r\n\r\n\r\nJesse (14:47.879)\r\nSo there was a situation where like, obviously we were in the sprint to get bench up and running. basically told the board that we weren't interested. It basically went into Monday because we knew that it's like a melting ice cube in the summer sun. All your customers are gone because every competitor in the world is reaching out to the running email campaigns on anyone's running bench, searching bench, login, anything like that. So you have tons of of turn if you don't start to fix this before business starts.\r\n\r\n\r\nSo long story short, our teams printed through it, got it docs done, and got the servers online at some point, Monday morning, Eastern at four or five in the morning, something like that, which is amazing. We had 100 % uptime from there, which was a really, really great turnaround. And then I think part of that, similar to the Yilong story, Yilong, I actually can.\r\n\r\n\r\nI don't know that that I've heard that story before and we've worked with we worked with Twitter and he was doing that turnaround too. So I've seen how he's like operated very directly very directly from you know, or two layers removed. But nonetheless, like he obviously is since urgency and does things that are probably unorthodox to others. But similarly, week one, we basically had I wanted to figure out what the customer experience was.\r\n\r\n\r\nI think it's like Tuesday or Wednesday of the following week. I basically submitted a basically, you know, customer service request and saw what the response was. I was kind of going through that workflow to see what it was like. And it's like, hey, sorry, you know, because whatever, we're going to get back to everyone in like seven days. And so I immediately called up the VP of customer success and said, hey, you're going to change this. You're going do it. And you're going say it's going to say the next 24 hours. And they're like, that's impossible.\r\n\r\n\r\nAnd I said, no, it's not. don't care. Like who has to answer tickets, like get everybody up on the all team. So there it's engineers or whatever. I don't care. Like, cause keep in mind, like they had laid everybody off on Friday. This is like Tuesday. So we had to rehire everybody Monday and to try to onboard people, and you know, with all the different like, know, bureaucracy that goes with that. And then, and then fix the customer issues. Once we've onboarded, we have people up into new systems, right? So it's not like as simple as just turning things back on. We have to go sign up for a new.\r\n\r\n\r\nNikolas Hulewsky (16:53.875)\r\nYeah.\r\n\r\n\r\nJesse (17:12.87)\r\nor get them integrated into our customer success software. So quite a lot of logistical moving pieces there. so, yeah, it's quite the operational burden in Sprint. So when we basically like change it 24 hours and we got through, I think over like\r\n\r\n\r\nNikolas Hulewsky (17:21.381)\r\nmy gosh.\r\n\r\n\r\nJesse (17:40.173)\r\nI think every customer basically submitted one or two tickets or like 10,000 customer tickets and like, you know, that timeframe give or take. And we got through all of them, not in 24 hours. maybe our VP of customer success was right. It's probably impossible, but we got it done in like 26 or seven hours. which was again, way farther, like way faster than it ever would have been, you know, in previous, you know, leadership, I think, because there's a lot of the driver urgency.\r\n\r\n\r\nNikolas Hulewsky (18:00.535)\r\nmy gosh.\r\n\r\n\r\nNikolas Hulewsky (18:09.652)\r\nDo you think that was necessary to kind of set the tone with that team of like, hey, there's a change here, right? Like not only is Bench gone, like you said, they got laid off and then all the customers were told they're going to lose access. Then they had to go through this whole rigmarole. They're re-onboarded, like you said, new systems. that, like sticking your flag in the ground, was it as important for you that the customers be answered as it was sending a message to the team, or is it only in retrospect that you realize?\r\n\r\n\r\nJesse (18:28.036)\r\nYeah.\r\n\r\n\r\nJesse (18:38.381)\r\nYeah, it wasn't so much like sending a message to the team. That wasn't like the objective. think like generally what I share with our team is like if I had a stack rank and my team probably would not like this, but like a stack rank like customers above team because we take care of our customers by proxy. I can take care of my team, right? And keep them employed and like we've been very historically good and not like having layoffs or having issues because we run properly, right? So it's very like, it's a kind of a self-fulfilling cycle where\r\n\r\n\r\nyou take care of your customers and do well for them, have high NPS and good customer satisfaction, you're basically going to be able to take care of your team at a very high level. And so that's the priority, right? We wanted to make sure in order to maintain a profitable and growing business with Bench that we took care of our customers so that they're staying and obviously becoming positive customers and referring to friends and whoever to Bench as well long term.\r\n\r\n\r\nNikolas Hulewsky (19:30.228)\r\nLooking back, do you feel like, man, that was actually necessary to set the tone with the team or no?\r\n\r\n\r\nJesse (19:36.996)\r\nI think it's similar to like the Elon thing. I don't think Elon's thinking like in terms of like, it's similar to myself. I'm not thinking in terms of like, oh, I'm gonna send a message to the team. It's really like, need to make sure our customers are taken care of or need to make sure that we're not hemorrhaging money or whatever the case is, right? And, but by proxy that takes care of the team. I think those stories kind of create that, there's many secondary like effects of that variable, unintended consequences for many or worse. So.\r\n\r\n\r\nNikolas Hulewsky (19:43.806)\r\nSure.\r\n\r\n\r\nNikolas Hulewsky (20:02.32)\r\nYeah, I mean, to go from losing 40 to making 10 to 15, a $50 million swing, that's not just, we came in and realized some operational inefficiencies. There's definitely a cultural and a mindset shift in there as well. yeah, I don't know. That one, that story just kind of resonates.\r\n\r\n\r\nJesse (20:24.067)\r\nYeah, definitely. the new, even at scale now, we continue to grow, kind of the same operational mindset, we're free cash flow positive, we'll operate heavily, probably in the black, we reinvest a lot in go-to-market R &D, but for the most part, focus on maintaining at least break-even from a...\r\n\r\n\r\nNikolas Hulewsky (20:28.148)\r\nHmm\r\n\r\n\r\nNikolas Hulewsky (20:49.31)\r\nSo I get that buying Bench made sense from a strategy standpoint, because you were like, hey, we looked around, we realized we didn't want to play in the payroll space, but we really like the accounting space. Bench comes up. We got to move quickly and take advantage of it. But they were a company that was five times your size, $40 million in error, and distressed. How did you pull off the financing of the deal? And then probably the I'm more interested in is how did you pull off the freaking integration? It's just really hard to integrate companies.\r\n\r\n\r\nJesse (21:18.596)\r\nYeah, definitely kudos to my co-founders and our team. They spent a lot of time on the integration piece and everything else. think in terms of financing and everything else, there's many ways we get pretty creative, like how we do deals. We generally don't lever a lot of and use cash flow or other means to basically to buy companies. So I think generally it's just\r\n\r\n\r\nNikolas Hulewsky (21:39.06)\r\nYou\r\n\r\n\r\nJesse (21:46.948)\r\nIt's a question like balance sheet item. It's a balance sheet item question. Like we use free cash flow, debt, and obviously equity in most cases. But yeah, so that's the context.\r\n\r\n\r\nNikolas Hulewsky (21:58.398)\r\nSo you got, for you, it just getting really creative with Bench. It was like, hey, this is kind of the combination that we can do. It wasn't necessarily, here's a blank check, I'm rolling in.\r\n\r\n\r\nJesse (22:10.399)\r\nyeah, obviously I think that like it's tough. It's very tough to fully diligence a business over a weekend and you're trying to get like all the information details and try to do full diligence and make sure you're not going to get to have all sorts of like unmitigated risk. So yeah, so it was a, it was a very unique situation. I'd say like all in all that one is, an outlier compared to everything else we normally do in terms of like, we actually just for context, like\r\n\r\n\r\nNikolas Hulewsky (22:18.43)\r\nYeah.\r\n\r\n\r\nJesse (22:40.224)\r\nWe usually don't even bid on deals that are distressed as a rule of thumb and separately, we won't bid on competitive bids. recently there was the, who was it? It was the Monster and Career Builder, bankruptcies. And that was one deal. they a ton of ARR. think it was like, I'm not sure if I, I think it's fine to say. They had a lot of ARR. A lot of ARR slung for.\r\n\r\n\r\nNikolas Hulewsky (23:07.58)\r\nOkay.\r\n\r\n\r\nJesse (23:08.642)\r\nwhich is very cheap comparative multiple, like a VAR. If you just bought it and just cash-loaded the business, you'd make a killing. But because we're known in the space for doing acquisitions in very short timeframe, we had three different parties approach us to join their bid. Like, hey, do you guys want to put in 20, 30 million on this? This is right up your alley. It fits in your brand portfolio of Main Street, employer.com, recruiter.com.\r\n\r\n\r\nAnd we passed on it because we actually want like we get lots of proprietary deal flow, not because it wasn't a good investment. We thought it was a really great investment just from a pure like cash flow perspective. But we didn't actually want to do it because we didn't want to have conflicts with deal sourcing. Similar like for Warren Buffett, it's been pretty like a similar model to him right over the years. like, won't jump into processes that are highly competitive.\r\n\r\n\r\nbecause he just want to burn bridges over winning one deal. Right. So I think playing that long, long, long game there has benefited us a lot and also built a lot of loyalty with folks that rolled equity in our deals, like Greylock and Signal Fire and some other VCs. We've done really well and outperformed what the expectations were. So I think like that also helps build goodwill. And that's one of the reasons we actually got benched. So it does tie back into what you were talking about. One of the investors at bench, I think was traveling at the time and\r\n\r\n\r\nThis is all happened on Saturday and they were like on a plate a plane flight internationally somewhere for a trip. They already had planned and I think I talked to like 2 a.m. Eastern like Sunday morning and He's basically like similar questions you like who are you right? So I was like, it's good to meet you too and\r\n\r\n\r\nWell, long story short, he actually had his first his first company he had done back like 20 years ago was angel invested by one of our our lead investors or like large shareholders from Greylock and long story short, that instantly gave us credibility on the guy. You can just back channel, you know, XYZ person like that's our GP there, like talk to them. And, you know, his point being is playing that long term game really helps, right? Because like, that's actually how we bought Main Street and others, you know, we have\r\n\r\n\r\nNikolas Hulewsky (25:23.156)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (25:32.372)\r\nYou\r\n\r\n\r\nJesse (25:34.888)\r\nVCs like, hey, we have this company, we'd love to plug them into you. We'd love to roll equity, right? And that helps kind of that flywheel effect. So yeah.\r\n\r\n\r\nNikolas Hulewsky (25:42.036)\r\nCan you tell me how Bench is doing? So was 40 million ARR when you got it. What's it doing today?\r\n\r\n\r\nJesse (25:50.336)\r\nThat's doing really well. think we're collectively across the entire business. We're projecting to have over 200 % growth across all things, which would include bench, obviously, for the year.\r\n\r\n\r\nNikolas Hulewsky (26:05.214)\r\nWell, just putting benching perspective, let's say $10 million of free cash flow and let's assign a 10x multiple, which I think is fairly conservative. You turned bench into a hundred million dollar asset in less than a year. I mean, fair. I mean, I know you can't say like exactly what it's about. I'm just doing back at the envelope now.\r\n\r\n\r\nJesse (26:21.755)\r\nYeah.\r\n\r\n\r\nJesse (26:25.908)\r\nNo, I actually didn't you our latest valuation. Our last valuation was we did it on a deal. We're roughly, I think, valued it right around, paraphrasing, not exact numbers, but roughly 750 million. That's across everything. Yeah, across all things.\r\n\r\n\r\nNikolas Hulewsky (26:43.753)\r\nmy god. my gosh. That's across everything or that's just bench?\r\n\r\n\r\nJesse (26:53.408)\r\nYeah, not bad for a bootstrap company. That's far at least. Yeah.\r\n\r\n\r\nNikolas Hulewsky (26:57.318)\r\nIt's insane. It's insane. A year ago, we talked and like your company was 20, $30 million. From what I remember, right, I could be off a little bit. But in a year's time, 20 to 750 and it's not like you invented Uber, like you're just went out and bought good assets at discount prices.\r\n\r\n\r\nJesse (27:13.855)\r\nI think we'll be closer to about, I think we'll, in the next few months, I think likely surpass well into the 10 figures range. So I think we'll be a billion plus in the next.\r\n\r\n\r\nNikolas Hulewsky (27:33.748)\r\nYou're so stupid. is what dude that is what it's ridiculous. That's what it's okay. Okay, so you do bench benches turned incredible, but it was in and of itself a crazy story. And then we were texting. And you're like, ha ha ha. Tick tock's next. What the freak?\r\n\r\n\r\nJesse (27:53.631)\r\nI was probably more joking when I texted you that, I was serious.\r\n\r\n\r\nNikolas Hulewsky (27:56.052)\r\nYeah, well, I don't know, man. You put it out to the universe and the universe is like, Jesse Tinsley, you deserve tech talk, young man. And like, all of a sudden, it was happening. Like, I can kind of understand going from, hey, we got a $20 million business and we just got this $40 million ARR business. It was a stretch, but we figured it out. We got some, I don't know, maybe we got some financing together. We have the team, we did the transition. But then from that to tech talk, like\r\n\r\n\r\nOne of the biggest apps in the world, a multi-billion dollar asset that's being divested from the Chinese government and you are in the same breath as, like I said, Microsoft and Oracle. How, Jesse? it doesn't, my tiny brain does not comprehend how that happens.\r\n\r\n\r\nJesse (28:40.339)\r\nYeah, my tiny brain feels the same way a lot of days. So yeah, no, think it's different when you're like, like in a flow state, right? Like a flow state with certain things. And it seems like how did that sometimes I'm like, how did I end up like buying this like, like, you know, it seems like things happen, right? But it's all like the micro interactions throughout the day, everything compounds, right? And then, you know, if you looked at my calendar, like general like calls and texts throughout a day, like\r\n\r\n\r\ntalking to 50, 60 people that compounds into those deals taking place. think that it's hard to look back and actually have a of introspection on how things are happening. But I think that I'm really good at seeing where the future is and how to work backwards from the end result. So if I go, let's say, something extreme, like the New York Yankees, I would go and build a plan around, OK, these are the owners.\r\n\r\n\r\nNikolas Hulewsky (29:28.66)\r\nYou\r\n\r\n\r\nJesse (29:38.175)\r\nHow do I get engaged with the owners and then build everything back from there? I don't think obviously there's so many New York Yankees that love to buy them, but yeah, but nonetheless. Has to have a willing seller. So I don't think anyone, I wouldn't be a willing seller if was that. But nonetheless, that's something I'm really good at. I played competitive chess growing up and other things and I can see and connect dots from, oftentimes my team will be confused. Like, hey, how did you get from this?\r\n\r\n\r\nNikolas Hulewsky (29:44.286)\r\nSure. I wouldn't put it past you, but okay.\r\n\r\n\r\nJesse (30:07.219)\r\nthis result, this result, but they'll be missing the middle context. And I can go from A to Z and then connect backwards.\r\n\r\n\r\nNikolas Hulewsky (30:14.292)\r\nGive me, well, give me some of the middle context for TikTok. Like, was there a person or a conversation that really set it in motion where it was like, once I talked to this fund or once I talked to Mr. Beast or whoever it was, where then it kind of became its own self-sustaining thing with the flywheel in effect? Was there a single conversation like that or situation? No.\r\n\r\n\r\nJesse (30:34.622)\r\nI don't think there was a single conversation, obviously. There's lots of great people we had in our bid, like Mr. Beast. But I think that there was no one inflection point that stood out more than the rest. I think that every conversation led to a half dozen new conversations. So it was pretty wild, right? I think that was a pretty ambitious bid, obviously, for all intents and\r\n\r\n\r\nI've got nothing short of an ambition. Now I want to go build the next $100 billion plus accounting software platform. That's kind of my goal right now.\r\n\r\n\r\nNikolas Hulewsky (31:10.452)\r\nWell, let me ask you this. Did you know, did you feel like I'm not gonna get TikTok, but this is gonna be really good for me, because I'm gonna meet all these people, it's gonna be good name recognition, you know, the secondary and tertiary effects of this situation is just gonna be good for me? Or were you like, I'm freaking buying TikTok and you were pissed when you didn't get it? Or somewhere in between?\r\n\r\n\r\nJesse (31:34.11)\r\nI thought we had a chance to get TikTok. So that was like my main goal is on winning that. Now I'd say like, didn't really, a lot of people thought I was doing it for a publicity stunt. I really didn't care. And I actually prefer to be pretty, if you see how many podcasts and everything else do, I'm pretty incognito. Generally as a general strategy, I don't want to self promote for the sake of self promoting. Like if there's something to talk about, I'll talk about it. But otherwise that's not my MO, honestly.\r\n\r\n\r\nBut that said, think like obviously it's had those effects and met some amazing folks like the ones I mentioned earlier, but a ton of others that were in that bid that I have a ton of respect for and will be doing lots of business with over the coming years, hopefully. I think that that's definitely not a bad, it was definitely not a bad outcome. think, yeah, just met some amazing people and I'm happy that they came up with a solution that actually works well for.\r\n\r\n\r\nNikolas Hulewsky (32:26.036)\r\nHmm\r\n\r\n\r\nJesse (32:32.089)\r\neverybody involved and like said they've got some great backers in that that bid.\r\n\r\n\r\nNikolas Hulewsky (32:37.416)\r\nHow so the rest of the year has been a blur. You've done multiple acquisitions since then you're rounding out this thesis that you kind of created a year ago. Here's my question though, because I think sometimes you know, entrepreneur, an entrepreneur might listen to this and be like, that's tick tock. I'm not buying tick tock, which is true. Only Jesse Tinsley and two other people are like in the conversation for buying tick tock. But but the thing that I'm like most interested in and really impressed with is\r\n\r\n\r\nAcquisition led growth is really hard. Obviously organic growth is hard, but acquisition led growth is really hard because you're buying other assets that already have a culture and an ethos. Like there's already just momentum going with the way that they're operating and you've got to bring them in and change habits and reorient them and onboard. it's a lot. when you're sitting here telling me $20 million last year, kind of a year and a half ago, ARR to\r\n\r\n\r\n$750 million valuation this year, or maybe it's ARR. I can't remember, but 750 is the number.\r\n\r\n\r\nJesse (33:41.277)\r\nDefinitely not 750. 750 AR would be amazing. It would be worth like 10 billion.\r\n\r\n\r\nNikolas Hulewsky (33:44.784)\r\nOkay. Okay, okay. valuation, valuation still. Like, how did you onboard that? I don't think people understand how hard it is to success to successfully onboard and integrate. What are you doing, man? Like, how do do it?\r\n\r\n\r\nJesse (33:59.269)\r\nYeah, yeah, yeah, so I think that there's a few, there's a few things we built around like first principles will generally get like alignment like, because cultural to your point, the most difficult part is the people, right? So like, culture, simulation, expectations for larger acquisitions will generally let that business be a standalone and then we'll have alignment from leadership top down and let that run somewhat independently. But then\r\n\r\n\r\nbuilt the products into one platform. So that's the first thing is like looking at the cultural alignment will pass on deals that they're too misaligned. Because that's obviously gonna cause a lot more issues and friction over the long term. So it's not worth whatever.\r\n\r\n\r\nNikolas Hulewsky (34:43.38)\r\nHave you passed? Have you passed on deals? I can't believe you've actually passed on a deal. Have you actually said no to deals?\r\n\r\n\r\nJesse (34:48.079)\r\nI passed on hundreds of deals. like so many deals that you've no idea. Yeah, we see stuff from like, know, biotech and med-device. Like, just things are completely out of left field right there. We obviously pass on. I couldn't value that business if I tried. Even if you're giving it to me for free, like I don't have no idea how to run it or do it. like, but and then.\r\n\r\n\r\nNikolas Hulewsky (35:09.15)\r\nOkay.\r\n\r\n\r\nSo step one, you stick it through your buy box.\r\n\r\n\r\nJesse (35:14.717)\r\nYeah, exactly. There's a certain scale and scope we go for now. think that's why I posted actually something went viral a few months ago. was like, Hey, I have a few businesses, but like, they just want to like roll equity and like get an earn out or something. And they have like 100 million ARR, right? Like there's tons of business like that. If like I wanted to go, if I was actually an entrepreneur, best advice I can give to your audience if they're entrepreneurs, like I would go and I would try to do like, if I was starting from zero right now, I would go get like a\r\n\r\n\r\nI would go be, do they call it? I don't even know the name because I don't study this stuff, but it's what's it called? Search fund, search fund. would start a search fund. And I'd a few backers and say, hey, if I get this type of profile business, you'll back me and help spin up like working capital, right? And I would go and I would figure out the niche that I feel like I could add impact to. I would go and I buy, I would not build, I would buy a few different companies and put them together. And I think you could do a small, like a much smaller version of what we've done, but.\r\n\r\n\r\nNikolas Hulewsky (35:50.548)\r\nOkay, yep.\r\n\r\n\r\nJesse (36:11.964)\r\nget to five, 10 million ARR and then scale it from there or sell it and make a decent amount of money. They make a few million bucks in a year, I think, which is not, it's probably, it's free advice, no course, no content to sell. So that's my, I honestly think if I had more time, I could do that all day every day because of the amount of deals.\r\n\r\n\r\nNikolas Hulewsky (36:21.31)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (36:26.472)\r\nHahaha!\r\n\r\n\r\nNikolas Hulewsky (36:33.493)\r\nIs it just because you're seeing how many deals there are at that size that you're like, I can't, I'm not doing these deals. They're too small for me, but man.\r\n\r\n\r\nJesse (36:40.812)\r\nYeah, there's nothing that happens with them, right? they're a low, they're subscale, right? So like, if you look at the markets right now, like, there's like a dead zone between like series A and series E. And so, and even from like, see the series A, right? There's like this huge drop off in funding. So you a lot of companies that raised that are running out of money that have no, and the founders are burnt out or tired or want to leave, right? And so there's lots of little businesses that\r\n\r\n\r\nNikolas Hulewsky (36:43.753)\r\nHmm\r\n\r\n\r\nJesse (37:06.533)\r\nThey're micro SAS that just have no outcome that's tangible. so I think.\r\n\r\n\r\nNikolas Hulewsky (37:12.862)\r\nWell, just to clarify on that, said series A to series E, like just so other entrepreneurs understand when you're saying series A, by the time you're raising series A, you've got a product for the most part. You've got like something that's actually, yeah. And so what you're saying is like, don't worry about the angel rounds or the seed rounds or any of that stuff, but there are companies who have actually raised real money. They've got a real viable product that are kind of in no man's land. Series E is\r\n\r\n\r\nJesse (37:27.737)\r\nYeah, you should have a high-scale revenue.\r\n\r\n\r\nNikolas Hulewsky (37:42.6)\r\nmaybe gap funding before they go public or the last round. Is that kind of fair?\r\n\r\n\r\nJesse (37:45.243)\r\nYeah, exactly. Yeah, typically like sage, yeah, growth rounds and stuff. Yeah. So there a lot of pre seed and seed companies that like kind of fall into this no man's land where they can't raise additional capital. And that basically creates an opportunity, right? Because there's no, there's no, they can't exit, right? There's no one unless, I don't know what like, unless it's strategic buyer, which most companies haven't been buying the last few years, and you're too small for private equity.\r\n\r\n\r\nNikolas Hulewsky (37:55.931)\r\nJesse (38:13.371)\r\nreally the only thing that falls in there is a search fund of sorts. And so there's a misalignment in the market, like a market inefficiency. And I think you can make a lot of money doing that. That's what I've told my friends. My friends, they come to me for advice. I'm like, I would go start a search fund. I'll put money in myself. put it on. If anyone's smart listeners, they're entrepreneurs that have either operational background in tech or computer science, and they want to start a search fund and go out.\r\n\r\n\r\nand stuff, I'd love to talk to them so they can DM me or something. Just Nick. Nick's like, I'm doing this. No more podcasts, I'm just going go all the down to such a long app. But yeah, think that there's a huge opportunity there. Obviously, it's a bit messy and things could go wrong. But even if you just ran out on a cash flow basis and started returning capital to investors, I think you could make quite a significant amount of money.\r\n\r\n\r\nNikolas Hulewsky (38:44.949)\r\nNo, I'm cutting this part out, keeping it just for myself. No, I'm not, I'm just kidding, just me.\r\n\r\n\r\nNikolas Hulewsky (38:53.118)\r\nDone.\r\n\r\n\r\nNikolas Hulewsky (39:07.656)\r\nWell, because they're hard, right? It's like, find one of the bench is a perfect example. Let's say you bought let's say bench was free and it was like, we don't want to just take it for free. You you still need operating capital, right? Because you got to fund payroll. You got to fund. You got to pay vendors. And if their pricing was off, they were losing money. So you get maybe you got to capitalize the business. So like these are potentially messy acquisitions. That's why you're saying you'd go raise money so that you have the capital behind you in order to run these businesses.\r\n\r\n\r\nJesse (39:14.618)\r\nTotally. You still need operational capital, right? Yeah.\r\n\r\n\r\nJesse (39:25.242)\r\nYeah. Holy.\r\n\r\n\r\nJesse (39:32.174)\r\nYep. Yep. I would spending on acquisition. would spend it on awkward working capital and growth and making that business efficient and then start returning capital at that point once you're free cash.\r\n\r\n\r\nNikolas Hulewsky (39:41.524)\r\nHmm.\r\n\r\n\r\nWhere would you find those deals? Asking for a friend.\r\n\r\n\r\nJesse (39:47.828)\r\nI think they're out there. think like you could look at like there's different like funding sources you can look or you can ask an LLM. They'll like tell you if you want like created like a research list of like companies that raised like seed or pre-seed stage fund like how much they've raised in these different sectors it can create a whole like excel spreadsheet for you.\r\n\r\n\r\nNikolas Hulewsky (40:07.572)\r\nOkay, so you'd start with, where would I want to focus? Like, so for me, I know healthcare, I know this particular space, cool, now I'm going to create a research document with all the healthcare companies in that space that have raised money, and then just cold outreach or like see who I know that knows somebody.\r\n\r\n\r\nJesse (40:12.299)\r\nYeah, I find it. Yep.\r\n\r\n\r\nJesse (40:22.841)\r\nI think that's probably the first thing to talk about on social media. I get lot of proprietary deal flow through social media and just brand awareness, as well as obviously now it's much more complex than that. We have lots of different referrers, could be investment banks or other founders or VCs, private equity, cetera. But I think a starting point for anybody would just be just doing some research and then reaching out to different founders.\r\n\r\n\r\nOr folks that are doing a lot of acquisitions like myself, there's just like, hey, oh yeah, you want a connection. I can think of a few companies today that are doing three, four, 500,000 that reached out to me in the last week that just way too small for us. We don't have time to focus.\r\n\r\n\r\nNikolas Hulewsky (41:06.056)\r\nYeah. I can be like, Hey, Jesse, just give me your sawdust, man. Like you're never going to do those companies. Like just shoot me. You know what I mean? Like that could be. Saw gold. That's awesome. Well, like the interesting thing about those companies, I was talking to somebody. I do these office hours for a company called the acquisition lab and someone came with a deal and they're, they're like, Hey, it's a SaaS product and it's doing about $2 million in top line, a million and a half dollars in bottom line.\r\n\r\n\r\nJesse (41:09.017)\r\nSawing\r\n\r\n\r\nNikolas Hulewsky (41:35.177)\r\nIt's been flat, if not declining a little bit in revenue. I think I should maybe evaluate it 10x.\r\n\r\n\r\nJesse (41:40.479)\r\nI lost track. was the numbers?\r\n\r\n\r\nNikolas Hulewsky (41:43.392)\r\nI think like ballpark, was like two million top line, 1.5 bottom line, wasn't growing, if not kind of declining a little bit in top line revenue. And this person was like, I think we should value it at 10 X EBITDA. And I was like, that's a valuation for a tech company. This is not a tech company. This is a small business that happens to have a tech component to it. Because there are some of these that they're just, not going to turn into a unicorn. They have a very specific use case. They're a cool niche solution.\r\n\r\n\r\nJesse (41:49.059)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (42:13.46)\r\nBut you don't need to value them as a unicorn, value them as the small business that they are. And there's nothing wrong with that. They're spitting off cashflow. They've got a little bit of a moat. Great. That's why I like kind of this method is a normal entrepreneur could come and just find one of these businesses. And if they understand how to unlock the value and run it like a small business, they can create a lot of value. They might get into trouble if they start thinking, oh, this is going to be the next unicorn. And then you justify throwing a lot of good money off your bed.\r\n\r\n\r\nJesse (42:38.504)\r\nYeah, think that like the best advice to give founders, the past, is like, if you want to build something, build it around what you value, right? So if you want to go build like scale and scope and like just bigger and bigger like opportunities and be able to help like all like, as many people as possible, run their own back office more efficiently. I think it's kind of my goal, but like, that might not be the goal for most people right now.\r\n\r\n\r\nNikolas Hulewsky (43:07.144)\r\nMm.\r\n\r\n\r\nJesse (43:07.863)\r\nI could turn around and my business and never work again, right? Like, you know, I don't even have to my business. don't have like, it's the choice, right? So I think a lot of people, if you want work-life balance or focus your family or focus on your parents or your health or whatever, I think that like, this is more that work-life balance and like lifestyle business that you could do with those smaller, I guess, mean, like SaaS companies with a few of them, sectors. And I think with AI and everything else, I think you can start to automate a lot of those efficiencies where, you know.\r\n\r\n\r\ncustomer success, running your back office with Main Street first off and then running and using Intercom or a similar competitor like for CS. Their AI solutions are great, reduces tickets 50 % plus percent. And so stuff like that, you'd start to have huge cost reductions in savings. I think that you could cash flow those businesses out over two, three, four years and make quite a bit of money.\r\n\r\n\r\nNikolas Hulewsky (44:01.908)\r\nHow do you view what you're doing? Do you it as venture capital? Do you it as private equity? Do you view it as value investing?\r\n\r\n\r\nJesse (44:08.687)\r\nNone of the above. value it. I view it as like an entrepreneur. So like, think the, I want to build like an SMB platform or scale number one globally for automating the back office. And that is a technology company. think that people oftentimes will think that it's like private equity or like, know, all this other stuff, but there's fundamentally a mismatch in like price valuations at SaaS companies right now.\r\n\r\n\r\nNikolas Hulewsky (44:29.748)\r\nMm.\r\n\r\n\r\nJesse (44:36.512)\r\nCompared to historical norms. I think because of AI, valuations have swung too far in one direction where I can buy companies for two years free cash flow, essentially at scale. At scale, like we're talking 25 plus million ARR businesses I can buy, example, I can do like just a math example. Like I can buy a $25 million ARR business for 1X cash and three or four X equity. And then on the flip side,\r\n\r\n\r\nbecause we're now into them.\r\n\r\n\r\nNikolas Hulewsky (45:07.29)\r\nSorry, what does that mean 1x cash or 3x equity?\r\n\r\n\r\nJesse (45:10.033)\r\nSo 25 million cash, right? So we'll pay 25 million cash, we'll pay maybe two or three, basically like, let's say four times total ARR, so 100 million, but we'll get 75 million equity. But on the flip side, there's arbitrage because we're probably trading much higher. We're trading at like closer to 10 plus times ARR. And so there's immediate arbitrage there that like is not seen. And obviously those companies don't have that impact by themselves as a standalone, but when you plug it into a platform,\r\n\r\n\r\nNikolas Hulewsky (45:22.836)\r\nMm.\r\n\r\n\r\nJesse (45:39.543)\r\nThat's a very, very different equation.\r\n\r\n\r\nNikolas Hulewsky (45:41.896)\r\nWell, that's and that's like the private equity piece, right? Like private equity roll ups. They're able to realize those values because there is an arbitrage there. But at the same time, you're not just private equity. You're focused on tech and there is you're going to have to build custom and proprietary tech to get these systems to integrate and operate.\r\n\r\n\r\nJesse (46:00.791)\r\nI'll tell you, I'll tell you, like we actually, like one of the coolest products, we haven't launched this publicly yet. So I'll talk about it anyways. like you saw a few months ago with, with that engineer that was working at multiple full-time jobs, forget his name, but seven, eight full-time jobs. He, we then work on this product. basically falls into the kind of the falls into our solutions with like background checks and like identity management where we basically can code.\r\n\r\n\r\nNikolas Hulewsky (46:16.712)\r\nYeah.\r\n\r\n\r\nJesse (46:28.31)\r\nwith 100 % accuracy detect employment fraud. So if you have an engineer or any other employee that's working a full-time job somewhere else, we want 100 % know that with like absolute clarity that they are defrauding basically their employer, which has no statute of limitations in the US. And I think what's really cool about that is actually that's the biggest cost of these businesses is like if you're a startup and you've only raised a million dollars,\r\n\r\n\r\nYou have an engineer that's working a different full-time job. That's a huge sum of costs, especially if they're not performing. I think for me as an entrepreneur, I have no problem if somebody's working multiple full-time jobs, if they're a top performer. Great. I would try to figure out a way to incentivize them even more to just spend more time with us. How do I pay you more salary-based equity bonus? What is it that can make you work here full-time? That would be my first...\r\n\r\n\r\nNikolas Hulewsky (47:21.257)\r\nYeah.\r\n\r\n\r\nJesse (47:25.192)\r\nchoice, right? Like, if not, we just let them do what they do. if you're like a bottom percentile, you're just dragging down everybody else, right? The concern is not so much them in isolation, it's everybody else they're impacting by just, you know, sandbagging work and right, right, or just being a low performer working eight other jobs or whatever they're doing. So that's something like we've proprietary built that doesn't exist in the marketplace, that it's pretty cool. And that has like, by itself could be a massive\r\n\r\n\r\nYes, some very, very large, like Fortune 500 customers onboarding for that. That alone could be a $5 billion company.\r\n\r\n\r\nNikolas Hulewsky (47:59.028)\r\nHow many employees does Main Street have?\r\n\r\n\r\nJesse (48:03.829)\r\nI don't know the exact number. Roughly 300. 300 plus.\r\n\r\n\r\nNikolas Hulewsky (48:13.884)\r\nAnd how many of those employees are like part of the management team? How big is your leadership team?\r\n\r\n\r\nJesse (48:24.085)\r\nIt's been saying kind of, but it's like probably 10 give or take on like the C-suite side.\r\n\r\n\r\nNikolas Hulewsky (48:29.556)\r\nHas that been a weird transition over the last year to go from where you were to now team of 300 and a robust C-suite?\r\n\r\n\r\nJesse (48:36.373)\r\nWe're going to be closer to about 600 by January. that would be fun transition. nonetheless, I'm somewhat like, it's different in that I think the biggest thing I seeing like Jack Dorsey and Elon and others talk about this, it's hard. I put reminders in my calendar and try to connect with early employees that might be further removed from what's happening top down.\r\n\r\n\r\nlike on a monthly basis or by like bi-weekly basis. Um, so that they're not like, cause you know, they might be 10, you know, multiple levels removed for myself. So they might just not talk like, and so that's always weird with a scaling startup. So I think that's like the biggest thing that I try to like lean in on. But other than that, like my day-to-day actually relatively easier, uh, cause I'm working on a higher level, like less problems and higher, higher level problems. Right. So I might have two things that I do this week that are like mission critical. And if I get those two right businesses.\r\n\r\n\r\n10 % better immediately, right? From an evaluation and growth perspective. yeah.\r\n\r\n\r\nNikolas Hulewsky (49:41.044)\r\nDo you have an office? Like are people in the office or is it your team 100 % co-located remote?\r\n\r\n\r\nJesse (49:46.2)\r\nWe're completely remote, but we're actually opening two offices really next year. So we'll one in the Bay Area and then one in the East Coast as well.\r\n\r\n\r\nNikolas Hulewsky (49:55.636)\r\nOkay, so 12 months from now, you're currently you went from 20 million to 750 million. Let's say enterprise value in 12 months, 12 months from now when we talk again, what is Main Street going to look like? What's the blueprint over the next year?\r\n\r\n\r\nJesse (50:13.236)\r\nWell, I would optimistically say that we'll be worth, you know, at a fair multiple like value. I think Michael will be worth at least five billion, probably goes 500 million plus error. I think we clear line of 500 million error on the next year. And it's not like just saying that, but I think both inorganically and organically, because again, the flywheel effect is just so strong as you start to have like very high NRR.\r\n\r\n\r\nNikolas Hulewsky (50:27.364)\r\nStupid. That's ridiculous.\r\n\r\n\r\nJesse (50:41.62)\r\nlike net revenue retention. So you add products and then you cross sell those products for those SMB customers and package those and bundles those together. think our run rate probably will hit. I think it's possible to hit 500 million ARR run rate by this time next year. That's what I'd say.\r\n\r\n\r\nNikolas Hulewsky (50:59.118)\r\nOkay, last question. What was the craziest moment of the last 12 months? Like, what, just as you look back that you're like, that happened? The freak.\r\n\r\n\r\nJesse (51:09.16)\r\nAlright.\r\n\r\n\r\nJesse (51:16.036)\r\nI think that there's a few that stick out, but I think it's fun. As you scale, you get to meet all sorts of interesting folks. think I'm pretty like, generally don't get into politics or anything else, but it's been very interesting learning that world across the board and meeting all sorts of different politicians on both sides now that have a lot of interest in.\r\n\r\n\r\nentrepreneurs and technology, obviously, we've seen a big push from President Trump's administration this year, like very tech forward, which I think is good. But overall, I think that's been on both sides, whether, Democrats, Republicans, independents, doesn't really matter. There's been a big push, obviously, we need to win the AI race. And I think that's like mission critical for the US. And that's been a really fun conversation to have with all sorts of local and regional and national leaders across the board.\r\n\r\n\r\nI think that's probably been the most interesting moment because it's a totally different world. I'm a noob, I guess, in that regard. I don't know the appropriate anything in that space. I'm still learning. yeah, the job.\r\n\r\n\r\nNikolas Hulewsky (52:29.822)\r\nHere's my takeaway from our conversation. I want to get your thoughts. Number one, if you're going to dream, dream big. I just love the fact that you just skipped the steps you're supposed to follow and you've grown like crazy. And it's like, we have one life. So if you're going to dream, dream big and go for big stuff. I think I really, really liked the idea of setting the tone with your teams, not in douchey way, but\r\n\r\n\r\nreally thinking about how you can help your teams understand either the sense of urgency or what values are really important to you. I think the other thing that you really hammered home is if you're going to get into this space, just pick one thing, like go an inch wide and a mile deep. You don't need to be a mile wide and an inch deep. It's much better to be sort of that inch wide and a mile deep. And then the flywheel. mean, it's like nothing happens and then everything all at once.\r\n\r\n\r\nLike it's just years of grind, grind, grind, and then you're meeting with Peter Thiel.\r\n\r\n\r\nJesse (53:33.234)\r\nYeah, yeah. I think the, yeah, it's so right. I love last step last piece. Like I think the flywheel effect is probably the best way to think of it. in, you know, Elon, I've heard lots of entrepreneurs, not just him talk about this. like think about a company that works 40 hours a week and a company that works 60 hours a week, compound that out over an entire year. That other company is working, you know, 50 % more in their productivity and everything else is going to happen quicker.\r\n\r\n\r\nwhich adds a ton of momentum and valuation liking across the spectrum. So I think, yeah, there's speed and urgency will get you ahead of most other entrepreneurs. Most people, I actually do a bit of, it's funny, I look close on this, but I do a bit of a test with a lot of founders who say they want to me their business. Whether I want to talk to them or not, I'll say, hey, can you talk Friday at like six? If they can't talk Friday at six, I'm just like, okay, well.\r\n\r\n\r\nNikolas Hulewsky (54:05.236)\r\nYeah.\r\n\r\n\r\nJesse (54:32.443)\r\nmust not be that important. yeah, that's your priority. Like, it's cool. Like, I know everyone's got plans on Friday at six, and maybe that's unfair, but like, it's cool. Like, I usually tell them like six to midnight, anytime, take time. And like, if they don't, you don't want to talk to them on there, I'm like, okay, well, probably not that serious. Don't really want to buy your business. So I think like, yeah, urgency matters. Like you, even for me, like now, like if somebody came to me on Friday at 10pm, and they're like, hey, I got this thing and it's got to close by tomorrow, I would be like,\r\n\r\n\r\nNikolas Hulewsky (54:45.193)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (54:49.542)\r\nYeah\r\n\r\n\r\nThat's amazing.\r\n\r\n\r\nJesse (55:02.726)\r\ndrop everything to do it. Not because I have to, but because that's how I'm wired.\r\n\r\n\r\nNikolas Hulewsky (55:07.624)\r\nYeah, I love it, I love it. All right, we'll go check Jesse out. Find him on LinkedIn, Twitter, all these places, Main Street, and can't wait to have you back.\r\n\r\n\r\nJesse (55:18.13)\r\nAwesome. Thanks for having me, Nick. See you.",
  "metadata": {
    "duration": "",
    "date": "",
    "platform_source": "Google Drive"
  }
}