{
  "episode_number": 252,
  "episode_title": "252 - Kevin Dahlstrom",
  "guest_name": "Unknown",
  "business_name": "Unknown",
  "transcript": "﻿Nikolas Hulewsky (00:01.105)\r\nAll right, welcome back to Niconomics. I have Kevin Dahlstrom on today. And the reason I reached out to Kevin is not because he's a multiple time serial entrepreneur founded more than four companies. It's not because he's led three publicly traded companies as a CMO. It's because he's launching a new business and he's going specifically into healthcare. And I thought, I have to talk to this guy who's invested in over 50 companies has had huge eight, nine figure businesses that he's running and talk to him. How is he launching the into the healthcare space, which is\r\n\r\n\r\nheavily regulated, what is his differentiator and why now? Like why take this swing when he could probably just be kicking back on a beach, sipping Mai Tai's. So that's why I have Kevin here today and you're gonna learn all about his new business, how he's launching it, what his marketing strategies are and lots of really cool advice for you guys. So Kevin, welcome.\r\n\r\n\r\nKevin Dahlstrom (00:48.762)\r\nthanks, Nick. This is going to be fun. You know, it's, what's funny is I was asking myself those same questions and I still am. it's funny because my, my, my current business, bolt is in, as you mentioned, it's in healthcare almost exactly a year ago today. I was socializing the idea and I was debating in my own mind, you know, do I have the fire to start another business? And also do I want to.\r\n\r\n\r\nNikolas Hulewsky (01:14.557)\r\nReally?\r\n\r\n\r\nKevin Dahlstrom (01:17.902)\r\nrisk screwing up my life. You know, I was in the enviable position of already having a great life financially secure all that. Why would I want to go and screw it up? And ultimately I've always been a big believer in biasing toward yes. And I'm so glad I did. I got some encouragement a year ago from a few friends that was the catalyst for, you know, deciding to give it a go and fast forward. And here we are. I've got a real business on my hands and, it's I'm having fun, but more importantly, it's aligned it's.\r\n\r\n\r\nNikolas Hulewsky (01:31.155)\r\nMm-hmm.\r\n\r\n\r\nKevin Dahlstrom (01:46.988)\r\nI'm living in more alignment than I've ever in my life so that everything I do is very missional for me. And that hits different. It wasn't always that way. I did my share of grinding, but it feels really good to be aligned.\r\n\r\n\r\nNikolas Hulewsky (01:59.241)\r\nSo tell me really quick, what is BULT Health and like why? What's the why behind you launching a business like this?\r\n\r\n\r\nKevin Dahlstrom (02:08.876)\r\nYeah, yeah, I love origin stories. best businesses tend to have great origin stories and,\r\n\r\n\r\nNikolas Hulewsky (02:16.835)\r\nThey do like Simon Sinek, right? People don't buy what you do, they buy why you do it. Like the why is so important when you're getting into things.\r\n\r\n\r\nKevin Dahlstrom (02:22.016)\r\nIt, it's so important, especially for the founder, because it's why is the fuel. if the why is I'm trying to become a billionaire that usually doesn't work out so well. If the why is because I just, I can't not do this. I have this itch I need to scratch. Then it tends to work out. And that was kind of the case with me is, bolt was born out of my own experience. And so I'm a 54 year old man. I've got a family. live in Boulder, Colorado. I'm extremely active. I'm a rock climber.\r\n\r\n\r\nNikolas Hulewsky (02:25.757)\r\nMm-hmm.\r\n\r\n\r\nKevin Dahlstrom (02:51.982)\r\nAnd, I've always been into health and fitness, biohacker. was a biohacker before that word even existed. Way before it was cool when it was way out there. But as an offshoot of that, I have tracked my blood for 15 plus years every six months. And like a lot of guys, I got into my forties and I noticed one marker in particular started trending down pretty rapidly and that was testosterone. And that's normal among men.\r\n\r\n\r\nNikolas Hulewsky (02:58.451)\r\nbefore it was cool.\r\n\r\n\r\nKevin Dahlstrom (03:20.632)\r\nBut I also noticed it came with some symptoms. And so I did everything I could to optimize, my testosterone, tried all the supplements, all the treatments, did all the lifestyle changes. And, man, well, the thing about testosterone in particular, it's the molecule of manhood. So the symptoms, run the gamut. mean, the most common ones are you start to notice lower energy. Your workouts aren't as good, poor recovery, poor sleep.\r\n\r\n\r\nNikolas Hulewsky (03:31.707)\r\nWhat were those symptoms, by the way? Sorry.\r\n\r\n\r\nKevin Dahlstrom (03:50.018)\r\ndepression, anxiety, low libido, erectile dys... It can show up in a lot of different ways. And what the scary thing is a lot of guys just start sort of going after those symptoms, right? So if you've got erectile dysfunction, you take Viagra or Cialis, if your immune system goes down, know, do other... But it's, the point here is what I learned along the way is testosterone in particular for men is foundational to health. In fact, our medical director at BOLT says, has a great line for this, he says,\r\n\r\n\r\nNikolas Hulewsky (04:03.817)\r\nYeah.\r\n\r\n\r\nKevin Dahlstrom (04:19.554)\r\nYou don't know what's wrong with you until you correct your testosterone because it can show up in so many ways. When you, what we've seen with our patients is when you correct testosterone to an optimal level, all these seemingly unrelated conditions tend to disappear. So back to my story is I fought it for years. And then finally my doctor said, Hey, you know, ultimately you've got a choice. can like feel like this forever, or you can do something about it. And I got on what's, you know, a lot of guys call TRT, your testosterone replacement therapy.\r\n\r\n\r\nIt made a huge difference. Give me a second lease on life. did this about four years ago, right around the time I turned 50. And, but, like I always do, I went deep down the rabbit hole. And what I learned was the way that testosterone therapy is administered is horribly outdated. Like literally hasn't changed since the 1950s. I'm giving you the summarized version, but along with my doctor, we developed a new protocol. we call micro dosing where it's tiny doses every day. and.\r\n\r\n\r\nIt's a game changer. can run on a much lower dose with better results, less side effects. And so my thinking was, gee, separately, low T is becoming an epidemic. It's always been the case that older men lose testosterone, but now we're seeing it become way more prevalent among young men. we can, we can, you know, we can talk for an hour about all the reasons for that. It's, it's environmental, it's, it's plastics, it's.\r\n\r\n\r\ndiet, it's obesity, it's all the lack of sunlight, all these things. Um, but the reality is it is, it is a, uh, become a silent epidemic and men's testosterone levels are down 30 to 50 % since the 1980s. And that's quite a warning.\r\n\r\n\r\nNikolas Hulewsky (06:03.017)\r\nYeah, I want to say, I want to say I heard some crazy stat that was like a 25 year old today has the same level of testosterone as a 60 year old in like 1950 or something ridiculous. don't remember.\r\n\r\n\r\nKevin Dahlstrom (06:11.32)\r\nThat is no in 1980. Yeah. That's roughly correct. Yeah. And so you have millions of men walking around suffering from the effects of low T. You know, there's lots of things you can do to optimize your T it's not all about medical. There are lifestyle changes, diet changes, supplements you can take. but my thinking was, look, there's an epidemic here that doesn't get talked about. There's a lot of myth and stigma and misinformation out there around testosterone. maybe there's a business opportunity here. I can help myself.\r\n\r\n\r\nNikolas Hulewsky (06:14.057)\r\nIn 1980? Jeez.\r\n\r\n\r\nNikolas Hulewsky (06:39.067)\r\nYeah. So I've gotten some feedback sometimes from people who were like, sometimes your episodes sound like a pitch for the person who's on. And I'm just going to make it clear. I'm not getting any money from Kevin. There's no affiliate agreement. This isn't like, pay me to be on. And I don't do that with anybody. But I like to drill into the why, because to your point, I think that's so important in entrepreneurship. If you don't have the fire and the desire, you're not going to make it through the crap. There's a lot of suck that comes along. And if you're just motivated by money,\r\n\r\n\r\nKevin Dahlstrom (06:59.308)\r\nYeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (07:08.329)\r\nYou're going to give up a long way. anyways, that's my disclaimer before I ask some of these questions.\r\n\r\n\r\nKevin Dahlstrom (07:12.346)\r\nWell, yeah. so, um, you know, literally, um, I say this and it sounds like a marketing line, but it's really not. It's the truth is that I created the testosterone service that I wanted as a patient. was literally the first patient, uh, a dozen of my friends were the first dozen, uh, Guinea pigs for, for this. And it turns out, uh, you know, it out like what we do works really well. And, um, we, you know, I've built the best testosterone service out there. We're not the cheapest.\r\n\r\n\r\nNikolas Hulewsky (07:20.563)\r\nYou\r\n\r\n\r\nNikolas Hulewsky (07:25.107)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (07:32.303)\r\nHahaha\r\n\r\n\r\nKevin Dahlstrom (07:41.016)\r\nbut we are the best and, you know, I won't say the rest is history because we're very young still, but it turns out that my hypothesis was right. There's that there's a lot of men out there who are facing these same issues.\r\n\r\n\r\nNikolas Hulewsky (07:53.553)\r\nYeah. Give me, give me just like a high level. What's the size of bolt your team sales people on.\r\n\r\n\r\nKevin Dahlstrom (07:58.476)\r\nYeah. So we officially launched in June. We are at $70,000 in monthly recurring revenue. So we're off to a quick start. We have a five person team, depending on how you count people. have some part-timers and contractors and stuff. you know, if you include our marketing agency, for example, we're probably like eight or nine, but small team and by design.\r\n\r\n\r\nNikolas Hulewsky (08:07.561)\r\nWow.\r\n\r\n\r\nKevin Dahlstrom (08:26.238)\r\nAnd, what's interesting about our business is we are, as you mentioned, we're a medical business. And so we have, you know, doctors involved. have a network of specialized pharmacies that we produce our own specialized medication. for\r\n\r\n\r\nNikolas Hulewsky (08:41.609)\r\nYeah, that's what I going to ask. Do you have to go through compounding pharmacies in order to have distribution?\r\n\r\n\r\nKevin Dahlstrom (08:44.076)\r\nYeah, yes. We have a network of compounding pharmacies. And the reason for that, just so your listeners know, is that almost all testosterone medication is formulated in toxic seed oils as a carrier or a base. And they do that because it's cheap and it's stable, but it's not healthy. It's inflammatory. We formulate our medication in MCT oil, which is derived from coconuts. It's an anti-inflammatory oil. So we specially formulate that. But essentially what BOLT is, it's a subscription service.\r\n\r\n\r\nthat is turnkey. like you sign up, we handle your blood testing, consultations with expert doctors, all your medication, all your supplies delivered to your home every month. It's turnkey. You don't really have to do anything.\r\n\r\n\r\nNikolas Hulewsky (09:25.917)\r\nAnd you said, you said MRR because this isn't like, get a treatment for two weeks and your testosterone levels are back. You have to have a sustained, I guess, protocol. Okay.\r\n\r\n\r\nKevin Dahlstrom (09:34.67)\r\nThat's right. It's a long-term therapy. Yes. And so, uh, it's a, it's a subscription business. Um, and you know, the, the product itself lends itself really well to subscription business because not only do you need the ongoing medication, but you want ongoing medical care as your life changes, you know, a health event happens, whatever you need ongoing medical care.\r\n\r\n\r\nNikolas Hulewsky (09:51.955)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (09:56.361)\r\nOkay, well, I'll drill into the business model in a second, but I am curious about, you said you were in your 40s, which if anybody who's seen you write online, you're really active online, but you're also just really active in real life. You're an avid rock climber. You are somebody who talks about having an intentional life. So like you're very particular with how you now architect things. Did you just like force your way through your 40s? Like, did you realize, oh man, I'm tired and I don't have as much energy and...\r\n\r\n\r\nI just got a man up from like 40 to 50 or was there a tipping point for you that you thought I gotta make a change now?\r\n\r\n\r\nKevin Dahlstrom (10:32.012)\r\nYeah. So, great question. I, I have always been, into preventative medicine. Like I said, I've been into health and fitness. I've spent thousands of hours reading about it. just enjoy it. I've, I've enjoyed the benefits of it as well. The investments I've made playing the long game. So I was super resistant and generally still am to any medical intervention. and yeah, pharmacological and the,\r\n\r\n\r\nNikolas Hulewsky (10:55.465)\r\nYeah, especially pharmacological.\r\n\r\n\r\nKevin Dahlstrom (11:01.134)\r\nSo the answer is yes, I just kind of put my head down and suffered needlessly much longer than I should have. And like I said, when I finally gave in and started on TRT, it was like a light being switched on, like immediately made a profound difference in my life. It's like a, literally like a second lease on life. mean, I'm 54 now and I'm not exactly, it sounds like it's going to be hard for a lot of people to believe when I say this, but I literally feel better than I did in my twenties.\r\n\r\n\r\nNikolas Hulewsky (11:16.595)\r\nReally.\r\n\r\n\r\nKevin Dahlstrom (11:30.604)\r\nAnd it's, you know, I like to think it's not just that the fact that I'm on testosterone, I'm on a very low dose just for the health benefits, but it's also because of all the other lifestyle things I do.\r\n\r\n\r\nNikolas Hulewsky (11:40.551)\r\nYeah, yeah, because in your 20s, you're eating Taco Bell and you know, fried foods for every meal, at least I was. not only are you like focusing on your health, but you're also focusing on what you put in your body and your recovery and all that stuff. Well, and I'm super curious about this. I just turned 40 last week, a week ago. And I've started noticing like, man, I'm tired. My workouts are not as intense as they used to be. just like lack of desire. Maybe I'm depressed.\r\n\r\n\r\nKevin Dahlstrom (11:46.306)\r\nYeah, literally.\r\n\r\n\r\nKevin Dahlstrom (11:55.726)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (12:07.401)\r\nAnd a couple of people have mentioned to me now like, oh, well, you should get your testosterone levels checked. And I am, I'm going through the process of getting all that stuff checked out. But I've started seeing this recently where it's the micro dosing almost that you're talking, like these low doses. I used to think of like TRT, like, oh, I'm going to turn into Jeff Bezos. And all of a sudden I'm wearing a Patagonia vest and I'm jacked. That's not what this is. Like there is a differentiator between like how we used to think about these.\r\n\r\n\r\ntestosterone replacement therapy treatments and today, like what exactly is the difference?\r\n\r\n\r\nKevin Dahlstrom (12:39.234)\r\nYeah. And it's, it's a huge, been a huge sea change in a few ways. So first of all, you know, you are at that age. I mean, if you look at the data and you know, everything we do at bolt, we're maniacal about the data and the research. I've read it all myself. If you look at the data, 35 is actually where testosterone sort of starts to fall off a cliff. And that age is getting younger and younger every year. But yeah, by the time you're 40.\r\n\r\n\r\nyou're usually going to be in what we would consider a treatable range. And then it's just a matter of like, are the symptoms annoying enough for you to take action? Because you know, you don't want to take a medical intervention if you don't need it. If you still feel great, fine. But you know, there usually comes a point where guys are like, okay, I've tried all the lifestyle stuff. It's, it's, you know, I feel a little bit better, but I'm still not feeling the way I want to. And so you can just do a trial of testosterone.\r\n\r\n\r\nso that's one thing. Then you mentioned like the change in the approach. So this is a, know, we could again, spend an hour on just this, but there's a ton of myths and misinformation about testosterone that came from the 1940s and the, and the bodybuilding era. So, know, bodybuilders use testosterone in massive doses, like 25 times the physiologic dose. Plus they stack it with other much more dangerous hormones and it creates problems.\r\n\r\n\r\nNikolas Hulewsky (13:54.857)\r\nMm-hmm.\r\n\r\n\r\nKevin Dahlstrom (14:02.504)\r\nAnd so doctors have taken a lot of that, you know, and, and sort of assumed it's also the case for people taking physiologic doses, like basically just trying to get their T level into the optimal lab range, which is what I'm doing. And it's night and day. And what's, what's really cool. And this was actually one of the primary factors that caused me to start bolt is there's been a, been a bunch of research that just came out in the past three years.\r\n\r\n\r\nNikolas Hulewsky (14:15.251)\r\nRight.\r\n\r\n\r\nKevin Dahlstrom (14:28.514)\r\nthat has definitively dispelled all of these myths around testosterone. Like, for example, there was a myth from the 1940s that testosterone supplementation increases risk of prostate cancer and other cancers. It's actually the opposite. The research clearly demonstrates that across the board, cardiovascular health, cancer risk, all improve. And in fact, all cause mortality improves. There was a study\r\n\r\n\r\nNikolas Hulewsky (14:51.827)\r\nReally?\r\n\r\n\r\nKevin Dahlstrom (14:55.746)\r\nthat was released in 2023 called the Traverse study. It's the largest clinical study ever done of double blind. It was people being treated for low T versus living with low T. And the, was very clear all cause mortality was significantly better over a 10 year period for people who are being treated. And it makes sense because testosterone is foundational to metabolic health, which is the foundation of everything.\r\n\r\n\r\nNikolas Hulewsky (15:24.135)\r\nAre you just servicing men? Because I have a friend of mine whose wife actually is on one of these protocols. She has a low dose testosterone that she takes. Are you just servicing men or do you have female clients as well?\r\n\r\n\r\nKevin Dahlstrom (15:34.008)\r\nCorrect.\r\n\r\n\r\nKevin Dahlstrom (15:38.382)\r\nYeah, it's an, it's an epidemic among men and women. We only treat men today. And the reason we started with men is, um, my wife does the same thing and I've researched this quite a bit is, um, women are actually much more complicated animals to manage, uh, in terms of hormonal balance. Yeah. Who would have known? We never did. Um, it's, it's a little bit of an oversimplification to say that like for men, you can just raise their T level and it's like the rising tide that lifts all boats, but it kind of is true.\r\n\r\n\r\nNikolas Hulewsky (15:53.555)\r\nNo. What?\r\n\r\n\r\nKevin Dahlstrom (16:07.096)\r\nWhereas with women, that's not quite the case. There are a number of things you have to kind of balance. But for men, like our medical director, Sean, Dr. Sean Bender says is, when you correct low T, it's amazing how things that you were, like little things you were experiencing that were impacting your quality of life that you would have never guessed were related to low T just sort of disappear.\r\n\r\n\r\nNikolas Hulewsky (16:29.769)\r\nor somehow related to the low T. Tell me about the business model. So if I'm somebody who decides I'm interested in this, right? How do I go? It seems like there's a lot of friction between I'm interested in this or I see an Instagram ad or something to I get my first box of testosterone treatments or whatever. walk me through the process of what I would have to do in order to come on.\r\n\r\n\r\nKevin Dahlstrom (16:52.61)\r\nYeah. Well, you've met, kind of indirectly hit on one thing, which is, our sales and it's an educational sale. It's not an impulse purchase. Like guys are skeptical. They want to be educated. They want to learn. So what we see is that, you know, it's not the kind of product that you, you you see in the ad on Instagram, you click and you met immediately add it to your cart. mean, we do have some of that, but what we've seen is there's a long sale cycle. If you want to think of it that way or guys really, so what we've done with the bolt.\r\n\r\n\r\nwhich I think we're really the only player that does this is we've taken, we were kind of playing the long game. We focus on education. For example, like last week, we did a one hour webinar and it was just jam packed with data and research. And we had, you know, our medical staff on there. And because our approach is like, we're not, you know, we're not pitching the product. mean, obviously we're, we're a business and we're here to drive sales and grow. But the way we do that is through education because.\r\n\r\n\r\nour target market and you know, we're, serving probably on the higher end of the market. We're one of the more expensive services out there, but we also provide a more comp, know, testosterone is only one component of what we do. We really approach it from a longevity standpoint and you have a real relationship with an expert doctor. You know, we're super responsive with our care. We ship everything to your home turnkey. So to answer your question, the process is, you know, when you're ready to sign up, you go to our website.\r\n\r\n\r\nYou pick a plan, you can either pay monthly or twice a year or annual. There's discounts for the long, for the, the, you know, biannual and annual. Yep. And so, first step is we immediately transmit a lab request to your nearest, blood draw location. So we work through the lab corp network, which has locations everywhere. you go in, you schedule a appointment, you go in, you get your blood drawn. As soon as we get the results from that, we reach out to you to schedule.\r\n\r\n\r\nNikolas Hulewsky (18:25.363)\r\nYeah, longer.\r\n\r\n\r\nKevin Dahlstrom (18:46.44)\r\na consult that's done via zoom. Essentially you have a consult with one of our doctors. They review your results, talk about your health goals. If you qualify, they'll tell you like how you're, you know, what your protocol is going to look like and how to administer it. if you decide to move forward, everything gets shipped to your home, you know, every quarter is how we do it. So you get your medication directly from one of our, licensed compounding pharmacies. You get your supplies directly from bolt.\r\n\r\n\r\nIf you ever have any questions, you reach out to us. usually respond within minutes and, and then we repeat lather, rinse, repeat. So every six months we recheck your blood to make sure you're, you're on track. you have another doctor consult. In fact, you can have a doctor consult anytime you want. just reach out to us. And so, you know, it's basically like, again, back to this, like it's the, the service is designed to be exactly the service I want. And our, our team at Bolt will tell you I'm by far the most demanding patient.\r\n\r\n\r\nBecause I want everything to be perfect and that's what I demand and that's what we're building toward\r\n\r\n\r\nNikolas Hulewsky (19:48.137)\r\nWell, when I hear you describe this, a couple things come to mind. The first thing is just operational complexity. One, have to educate somebody to make a purchasing decision. Two, let's say they make the purchasing decision. now an order has to be written. And I'm going to ask questions on this, but I want to frame this out. An order has to be written. So it's like, OK, are you coordinating with the PCP who should be managing an individual's care? does Bolt now become the PCC?\r\n\r\n\r\nKevin Dahlstrom (20:06.668)\r\nYeah, yeah, sure.\r\n\r\n\r\nNikolas Hulewsky (20:18.025)\r\nPCP, excuse me. Next, it's like, okay, you could have LabCorp, but why not have Quest come and do a lab draw at your house? And then you've got to coordinate with them to schedule a call. Then you've got to coordinate with them six months from now to go get their blood drawn again, and then they're making purchases. like, there's a lot in there. And I think that's why lot of entrepreneurs are scared away from it. How did you get over all of that?\r\n\r\n\r\nKevin Dahlstrom (20:38.54)\r\nYeah. So.\r\n\r\n\r\nKevin Dahlstrom (20:45.358)\r\nso two things first, I came from the world of banking, which compared to banking, healthcare is super easy and non-regulated. I mean, in banking, in banking, have regulators who are actively trying to put you out of business. At least that's how it feels in healthcare. Yes, there's regulation, but it doesn't feel like your public enemy. Number one, right? I mean, generally everybody's trying to do the right thing for the patient.\r\n\r\n\r\nNikolas Hulewsky (21:11.913)\r\nI say non-Medicare and Medicaid healthcare. If you're taking payments for Medicare and Medicaid, it's pretty similar to the financial world. But yes, for what doing, totally agree.\r\n\r\n\r\nKevin Dahlstrom (21:16.835)\r\nYes.\r\n\r\n\r\nKevin Dahlstrom (21:20.684)\r\nThat's right. That's right. and so that actually segues into, think the, the, the kind of big issue we're talking about today, which is there's an entirely new healthcare system being built outside of the legacy healthcare system. And the reason is because the legacy healthcare system is really a sick care system. I mean, we, we see the outcomes from it. People are getting sicker, not healthier. And it's also 20 plus years behind the times.\r\n\r\n\r\nespecially when it comes to therapies like hormones. There's just, there is no service you can turn to in the mainstream healthcare system that does what Bolt does. so entrepreneurs like myself, we're building pieces of it outside of the mainstream healthcare system. And so when you sign up for Bolt, we're not even trying to integrate with that system at all. We're a cash paying, we have a staff of doctors. You are assigned a Bolt doctor who, yes,\r\n\r\n\r\nNikolas Hulewsky (21:54.633)\r\nTotally agree.\r\n\r\n\r\nKevin Dahlstrom (22:17.686)\r\nis helping you with your hormones, but the discussion goes way beyond that. We end up.\r\n\r\n\r\nNikolas Hulewsky (22:21.373)\r\nAnd are they, do they become your PCP or are they just collaborating and coordinating with whoever your PCP is?\r\n\r\n\r\nKevin Dahlstrom (22:24.632)\r\nWe don't bill ourselves as a PCP, but we act in a very similar role for many of our patients. A lot of our patients have sort of gotten fed up with their primary healthcare practitioner. Like, yes, if you have a sinus infection or you break your arm or whatever, of course, go use the, you know, go to the emergency room, urgent care, whatever. But again, I can't emphasize enough, the mainstream healthcare system simply does not do what we do.\r\n\r\n\r\nNikolas Hulewsky (22:49.801)\r\nWell, so I just had somebody on his name is Dr. Sandeep and he he started a company called philosophy health and When we were talking he dropped this stat on me. So he was a he's a Harvard educated Mayo clinic experience physician guy knows his stuff and he was like, know How long your average visit is with your primary care physician by the way PCP stands for primary care physician Do know how long you face to face interact with a primary care physician? I was like, I don't know. He's like seven minutes\r\n\r\n\r\nThat's what the studies show. And that blew my mind. I went and did a little research and I was like, okay, for an average family of four, two parents, two kids, how many times a year do they go to the doctor? Average person goes to the doctor three times a year. That means for an average family of four, that's 12 visits, seven minutes per visit, that's 84 minutes. And the average premium plus out of pocket that a family is paying is $32,000 a year. I know this is a simplistic way to look at it, but for $32,000 a year, you're getting like 84 minutes.\r\n\r\n\r\nof primary care physician interaction. And I know that that's not all of healthcare, but the primary care physician theoretically is the one who's quarterbacking all of your care. They're the bottleneck if you want to see a specialist, if you want to get certain medications, if you want to have therapies, et cetera. So it's forcing a lot of people to go outside of the traditional insurance led healthcare system because if you want to have it reimbursed by your insurance, the PCP has got to write that order.\r\n\r\n\r\nAnd now they're pursuing cash pay solutions like this, where it's like, okay, cool. I'm not even going to mess with my PCP anymore. I'll pay out of pocket for it. And that's where Bolt comes in and fills the need.\r\n\r\n\r\nKevin Dahlstrom (24:21.954)\r\nWell, it's funny you mentioned that because that's actually personally a top of mind issue for me. pay $30,000 a year for my family's insurance. We generally are healthy and avoid the mainstream system, but you're sort of trapped because there's always like the what if I'm in a really bad accident? What if one of my family members gets cancer? but you know, $30,000 adds up quickly. And, as you probably know, there's new cash pay.\r\n\r\n\r\nprovide sort of group networks out there that are taking a very different approach. It's non-insurance, but allows for coverage of these disaster scenarios that we do.\r\n\r\n\r\nNikolas Hulewsky (25:03.207)\r\nYeah, there's a company that's pretty popular. think most entrepreneurs will have heard of it because when you become an entrepreneur, you're like, I don't have health insurance anymore. What do I do? Christian Health Ministries is one of the companies. I think you pay like $600 a month per person. I can't remember. No, it's for the family. But effectively, what it is is like you go to the hospital and you just say your cash pay. The hospital sends you the bill. You pay the hospital. And then Christian Health Care Ministries reimburses you significantly, dramatically reducing the expenditures.\r\n\r\n\r\nKevin Dahlstrom (25:29.026)\r\nYep. There's another one now that a friend of mine just told me about that's getting a lot of traction, but I'm, seriously evaluating that right now because it doesn't make sense anymore. Like we don't really participate in that mainstream health system. And because it's a pathway to just becoming less healthy.\r\n\r\n\r\nNikolas Hulewsky (25:48.967)\r\nYeah. And it sounds so weird to even say like mainstream healthcare, it's this like insurance led healthcare has kind of tricked people into this false sense of, well, I've just got to do what the doctor says and almost, almost taken away the responsibility of no, you got to be proactive with your health. You've got to do certain things because insurance only pays for it if it's happened. And so we've kind of like gotten into this reactive way. I, yeah, I'm talking to crowd health. I don't know you've heard of them.\r\n\r\n\r\nKevin Dahlstrom (26:12.035)\r\nYeah.\r\n\r\n\r\nKevin Dahlstrom (26:17.558)\r\nYep, that's the one. That's it. That's it.\r\n\r\n\r\nNikolas Hulewsky (26:19.375)\r\nokay. Yes. I'm having the CEO join me in a week or two and I'm going talk to him because I think that what you're doing, what Crowd Health is doing, like people are creating their own solutions right now. And it's because healthcare costs are exploding. The population is aging. People like us are getting to the point where we realize we want other solutions that aren't what we're currently seeing.\r\n\r\n\r\nAnd entrepreneurs are stepping in to fix that. And I just, fascinated by it because obviously I'm an entrepreneur and I have healthcare experience and I just think there's so much opportunity.\r\n\r\n\r\nKevin Dahlstrom (26:49.634)\r\nYeah. So by the way, Sandeep is a friend of mine. I'm actually talking to him this afternoon. And the reason, the reason we're talking is because the real vision for my business Bolt is to expand beyond hormones to comprehensive longevity medicine. And, and that'll happen in the next year. So we're already running some pilots with some of our customers and, that that's the end game for us is a comprehensive longevity service that looks at your health.\r\n\r\n\r\nNikolas Hulewsky (26:55.889)\r\nKevin Dahlstrom (27:19.054)\r\nHolistically, the reason we started with testosterone is because the research says it's the big gun for guys who have low T. It's the single most effective thing you can do to restore your health. And the reason is because testosterone is foundational to metabolic health, which all the research suggests that metabolic health is really the foundation of everything without proper metabolic health. get things like cancer, you suffer a huge array of symptoms.\r\n\r\n\r\nand the single path to six to metabolic health for guys who have documented low testosterone is to restore testosterone to optimal levels, then you can go from there.\r\n\r\n\r\nNikolas Hulewsky (27:50.505)\r\nYou\r\n\r\n\r\nNikolas Hulewsky (28:00.297)\r\nTell me, so if I want to be a customer, how much do they pay a month for, does it vary? $500 a month, So $500 a month in perpetuity. And the $500 a month covers what on your, obviously the testosterone, but what do they?\r\n\r\n\r\nKevin Dahlstrom (28:04.846)\r\n$500 a month. Nope. No, it's very simple pricing. It's $500 a month.\r\n\r\n\r\nKevin Dahlstrom (28:17.614)\r\nEverything. So it covers all your, all your annual testing. like, think of it similar to like, if you're at a function health, similar testing to that, it covers all your medication, all of your supplies and essentially unlimited doctor visits. our patient doesn't, you know, we kind of a joke internally, like our ideal person, our patient is already pretty healthy. Like we're not really like, if you've got multiple chronic conditions and medical problems,\r\n\r\n\r\nNikolas Hulewsky (28:21.693)\r\nMm-hmm.\r\n\r\n\r\nKevin Dahlstrom (28:45.742)\r\nYou're not the type of person who would typically turn to bolt. Our customers really looking to go beyond that. They're already fairly healthy. They do, they're doing most of the right things. They want to take their health to an act to the next level. Typically it's, you know, it's a guy 40 to 55 years old who's in decent shape as disposable income is, um, you know, and they, they want their time is their most valuable asset. They want the best service. like me, they want the best service and they want it to be turnkey.\r\n\r\n\r\nNikolas Hulewsky (29:01.469)\r\nhas disposable income.\r\n\r\n\r\nNikolas Hulewsky (29:14.695)\r\nYeah, I had Dr. Deepon, Son Deepon. And, you know, there are these things. So the Mayo Clinic does it, UCLA, Michigan, a lot of these big healthcare centers do it where they have like an executive health screening. So usually it's guys who are in their 40s or 50s, they'll go and they'll get a smattering of tests. They've got MRIs done, they'll do VO2 max, is to measure, because your cardiovascular health, some other tests. And then they tell you, hey, this is your baseline. These are things you should look out for. These are things you shouldn't look up.\r\n\r\n\r\ncosts like five, 10, $20,000. And then in order to maintain their health, they've got to spend a lot of money. So even in this cash pay world, it has been traditionally just more expensive than many people could afford. But with offerings like Dr. Deep is doing it virtually, you obviously have a subscription service, you're sort of piecemealing it and making it more affordable for the end user. You just unfortunately have to now educate more people because it's not just the executives.\r\n\r\n\r\nwho can afford it, it's a lot of other individuals because that price is coming down.\r\n\r\n\r\nKevin Dahlstrom (30:13.644)\r\nYeah, no, I mean, we intentionally priced our product at a level that, that a lot of guys can afford. And, and I'll give you, I'll give you a sneak peek of something we're doing since you mentioned like the Mayo clinic. used to go to the Cooper clinic in Dallas and get that done. And you're right. It's it's $10,000 for, know, a two day evaluation. We're actually, I haven't ever talked about this publicly, but we are act in the active planning stages of a, experience center for bolt here, here in Boulder.\r\n\r\n\r\nthat does exactly that. You don't have to come as a patient, but if you want to come in and fly into Boulder once a year, you can get a comprehensive evaluation. So when I say it's like, we're starting with testosterone, but it's much more than that. That's a great example of what I'm talking about. So, you we're going to do the calcium heart screenings, comprehensive blood testing, VO2 max testing. There'll be a fitness assessment. There'll be a diet consultation. That's the vision. And actually we're not that far from being able to\r\n\r\n\r\nNikolas Hulewsky (30:43.718)\r\nI love that.\r\n\r\n\r\nNikolas Hulewsky (31:03.049)\r\nMm-hmm.\r\n\r\n\r\nKevin Dahlstrom (31:13.496)\r\nturn that into a reality.\r\n\r\n\r\nNikolas Hulewsky (31:14.681)\r\nDude, do you know who Ryan Bartlett is? So he's the founder of True Classic. You've probably seen their like t-shirts advertised on Instagram or Facebook. Basically, Ryan in like 2018 saw that there's just no good t-shirts that fit well. And so he went out and like found some t-shirts from companies that were already offering it. And we're like, oh, these fit good that, you they don't taper. They taper well at the waist and\r\n\r\n\r\nKevin Dahlstrom (31:17.742)\r\nNot I don't think so.\r\n\r\n\r\nNikolas Hulewsky (31:42.291)\r\ntheir arms are good anyways, but nobody had like spoken to men that way before they'd spoken to women like, here's some clothes that fit really well. But for men, they hadn't spoken that way. And Ryan had amazing marketing background experience. He was a digital marketer and he realized nobody is attacking this specific like marketing positioning. I don't know exactly how to say it, but I think that there's a market here. I think there's a market for me to market these t-shirts to men who have not traditionally been marketed this way.\r\n\r\n\r\nAnd in six years, he launched in 2019 and six years, they're probably a $2 billion company. They've done hundreds of millions of dollars in sales. They've sold over 30 million t-shirts. And it was all because of like the simple thesis of men should be marketed to differently for a product that they need. I feel the same exact way about what you're describing with men's health. And like those clinics, like you just said, just make it nice.\r\n\r\n\r\nLike right now we show up to these clinics and they're like honest in a strip mall or in a back alley. It just feels sterile. Just make it a nice clinic and you will differentiate yourself. I just love that philosophy and that anyways you remind me of him in that.\r\n\r\n\r\nKevin Dahlstrom (32:47.212)\r\nWell, we agree. mean, our market is completely untapped. we're going after a very specific segment. I'll share with you, a really cool text that I got just this morning. So last week I was at a business event and I met, a guy who is an incredible entrepreneur, like a goat level entrepreneur. He's bootstrapped two business, two separate businesses to nine figures in revenue. And he sent me a text this morning and he said,\r\n\r\n\r\nNikolas Hulewsky (33:13.843)\r\nCheers.\r\n\r\n\r\nKevin Dahlstrom (33:16.684)\r\nof everyone I met last week, think your company has the most upside potential.\r\n\r\n\r\nNikolas Hulewsky (33:22.951)\r\nWell, dude, we spend four and a half trillion dollars a year on healthcare, four and a half trillion dollars a year. And there's a, there's a, we've already seen the turn from, you know, non-GMO foods or, locally sourced and all that stuff of what we're putting into our body, but we're starting to see more of a turn and focusing on our metabolic health in particular. How did you, how did you get past the, like the, the typical things that scare off on entrepreneur to healthcare, the regulatory being probably first and foremost, how did you get over that?\r\n\r\n\r\nKevin Dahlstrom (33:47.714)\r\nYeah.\r\n\r\n\r\nblissful ignorance is probably the best way to explain it. I mean, that, that is like, think a lot of entrepreneurs, like, so I don't know if you know about the Enneagram personality typing system, but on the Enneagram, there's nine personality types. Almost all founders are either an eight, which is the challenger. That's what I am. It's basically like, we're born to break rules or they're the three, which is the achiever, which is just consummate. Like put your head forward and run and go.\r\n\r\n\r\nNikolas Hulewsky (33:53.021)\r\nOr what is there?\r\n\r\n\r\nNikolas Hulewsky (34:02.345)\r\nMm-hmm.\r\n\r\n\r\nKevin Dahlstrom (34:21.132)\r\nI'm a challenger. so I tend to be like kind of an eternal optimist. I believe that every problem is solvable. And so honestly, it's not even something I think about. mean, look, I, I've been around long enough that I have a pretty good grasp of like what it takes to operate in industries like this. And, you know, some of what appear to be barriers can also become moats. Because look, we have to have, we have to be licensed in all 50 States. We have to work with licensed pharmacies. And so.\r\n\r\n\r\nNikolas Hulewsky (34:47.273)\r\nYou do.\r\n\r\n\r\nKevin Dahlstrom (34:49.89)\r\nThere are these things that like, you know, you, this isn't a business that just an 18 year old kid can start from his dorm room. it takes, you know, some capital, takes some, credibility. And so there's a lot of pieces to put together here. but that's what I mean. think great. Go ahead. Sorry.\r\n\r\n\r\nNikolas Hulewsky (35:07.177)\r\nDid the business itself have to be licensed or are you your medical director? he the one who's licensed and you operate under his license in those states?\r\n\r\n\r\nKevin Dahlstrom (35:14.69)\r\nYes, it's latter. The way it works in this field is we're actually operating under the licenses of our providers. And we are essentially a services provider to our providers. And to the customer, it doesn't matter. All they want is they want one turnkey service. But on the back end, there's a lot of legal implications to what we do.\r\n\r\n\r\nNikolas Hulewsky (35:28.115)\r\nDid you have to create? Go ahead.\r\n\r\n\r\nNikolas Hulewsky (35:37.981)\r\nYes. Did you have to create an MSO or like what does the legal structure look like?\r\n\r\n\r\nKevin Dahlstrom (35:42.542)\r\nThe legal structure is the, our doctors, to keep it simple, our doctors, there's a hierarchy of services organizations owned by our doctor network. And then yes, we're a services organization to that. And there's an agreement that goes both ways. And even like little nuances, like the way that cash flows has to flow in through the medical organizations and then back to both.\r\n\r\n\r\nWe do have to spend like the upshot of that is we spend more money with attorneys getting all these entities set up and structured properly.\r\n\r\n\r\nNikolas Hulewsky (36:17.203)\r\nSo when a customer comes on, $500 a month, how much does it cost to acquire those customers? Do you know at this point?\r\n\r\n\r\nKevin Dahlstrom (36:26.296)\r\nWe're early. So, I mean, that's like asking, you how long is a piece of rope? there are players in our, there are players in our space who are venture funded and are overspending right now because they kind of view it as a land grab and their economics make zero sense. Because we're bootstrapped, we've always tried to do things that make sense from day one. The truth is we've had incredible growth. Almost all of our growth has been through word of mouth. We got really, really lucky early on in that,\r\n\r\n\r\nNikolas Hulewsky (36:31.006)\r\nHa\r\n\r\n\r\nNikolas Hulewsky (36:40.456)\r\nYeah, makes sense.\r\n\r\n\r\nKevin Dahlstrom (36:55.722)\r\nOne of our customers happened to be a big YouTube influencer. It's a guy named JP Sears has, you know, 7 million followers on YouTube or something. He became a customer, you know, with no, like we had no marketing arrangement. In fact, I didn't even know who he was. And then we met became friends. JP loves our product. And so he started talking about it online. And actually we still don't really have a formal agreement in place. but that's driven a lot of business, but our customers, like almost all of them.\r\n\r\n\r\nNikolas Hulewsky (37:01.225)\r\nWow.\r\n\r\n\r\nKevin Dahlstrom (37:25.078)\r\nrefer somebody, we actually just started doing paid advertising like two weeks ago. And that appears to be working also, by the way, the other thing we do is like I mentioned, we're our play is to really be an educator. And so like we did our first webinar last week, it was very successful. And so we've already put another one on the calendar. Because we know that when customer becomes educated, then bolt becomes the obvious choice. And\r\n\r\n\r\nNikolas Hulewsky (37:51.773)\r\nYeah, well this friend of mine whose wife has the prescription, she found it, I'm always fascinated by this, but she found it through a fitness influencer on Instagram, where it was just like, you know, they posted about it. So the education, and I know people don't usually think of it like this, but that's what they're doing, these influencers, like they're just educating their distribution channel.\r\n\r\n\r\nKevin Dahlstrom (38:09.752)\r\nWell, I'll give you a great example. So when, when JP posted his first video to YouTube, it was, he basically ignored every rule in the marketing rule book that his video was a 24 minute video. didn't even mention bolt my company until 16 minutes into the video. And yet it worked incredibly well. Why did it work? Because it was authentic, authentic, right?\r\n\r\n\r\nJP is a real customer. really believes in what we're doing. And he spoke to his own journey in an authentic way. And it turns out there's lots of guys interested in this stuff. And so, you know, the, the, the, the conventional wisdom is you got to do these like really flashy 32nd Instagram reels or tick tock videos. And we sort of did the exact opposite. In fact, also our email communications, I write most of our communications. They tend to be.\r\n\r\n\r\nNikolas Hulewsky (38:48.243)\r\nYeah.\r\n\r\n\r\nKevin Dahlstrom (39:06.734)\r\nreally long emails that site research and are educational. And they're actually like not flashy at all. They're not hard selling emails, but they tend to work because what guys in our space want is they want to be educated. want to understand, they're like, look, I think I have this problem. In some cases, they've already documented it with blood tests on their own, but they're like, I don't know where to start. I have all these...\r\n\r\n\r\nNikolas Hulewsky (39:15.891)\r\nMm.\r\n\r\n\r\nKevin Dahlstrom (39:34.786)\r\nthese objections in my mind that I've heard from doctors or from other people. And how do we address all those, you know, those concerns they have, those objections.\r\n\r\n\r\nNikolas Hulewsky (39:43.145)\r\nSo you haven't even really started pushing paid ads.\r\n\r\n\r\nKevin Dahlstrom (39:47.372)\r\nVery little. think we've spent, we've spent a total of like, in fact, we just had our agency meeting this morning. spent right at a thousand dollars and we've already had two customers sign up out of it. And what's crazy is what's crazy Nick is we are so non optimized. Like we actually, our website is, you know, not optimized at all. We don't have all the tracking in place we have, but what we have is a freaking great product.\r\n\r\n\r\nNikolas Hulewsky (39:48.905)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (39:58.985)\r\nmean, wow, wow.\r\n\r\n\r\nNikolas Hulewsky (40:14.985)\r\nWait wait wait, Mr. CMO doesn't have all that stuff freaking dialed in?\r\n\r\n\r\nKevin Dahlstrom (40:17.025)\r\nKevin Dahlstrom (40:20.642)\r\nYeah, dude, takes time. Like you got to remember when you talk to an entrepreneur who's at our stage of, of revenue, they've typically been at it two years. We launched in June, dude. Like, literally when I say we launched, we had a website and we opened the doors. Luckily things worked right out of the gates, but we didn't have all the tracking platforms in place. We didn't have an affiliate platform. We're scrambling, but that, but, but I think this is a great message to people out there about marketing.\r\n\r\n\r\nNikolas Hulewsky (40:22.665)\r\nCrazy!\r\n\r\n\r\nNikolas Hulewsky (40:30.889)\r\nThat's incredible, man. That's incredible. Yeah.\r\n\r\n\r\nKevin Dahlstrom (40:48.556)\r\nis sometimes we let the tail wag the dog. You can have all the tracking and all the sophistication in the world. And if you don't have a great product, it doesn't matter. What we focused on from day one is let's deliver a great product experience. And what I do have, Nick, is dozens and dozens of emails from customers saying, this changed my life. And I'd rather have that than a piece of tracking software any day.\r\n\r\n\r\nNikolas Hulewsky (40:58.387)\r\nYou just gotta go.\r\n\r\n\r\nNikolas Hulewsky (41:11.005)\r\nYeah.\r\n\r\n\r\nSo off of the $500 a month or $70,000 a month in MRR, what is your expected net margin? Like what are the margins on a business like this?\r\n\r\n\r\nKevin Dahlstrom (41:21.218)\r\nYeah. So the way the business works is we actually operate somewhat near breakeven for the first couple of months. There's a, because of the way we operate, we're a high touch, high care service, between the cost of blood tests, our doctor consultations, and getting the first round of medication and supplies out to guys first couple of months are sort of breakeven. And you know, what's interesting is we're still in the first couple of months for almost all of our customers.\r\n\r\n\r\nAnd so we have been operating it sort of sort of break even after that, it becomes, uh, it becomes profitable, but not wildly profitable. I think we're priced at a level that is a good balance between us being a solid business. You know, we'll probably end up driving 20 % net margins as we scale. And that's fine. Like I wouldn't want to be less than that. Much more than that. think the price starts to become an obstacle. And so, yeah. And I'm net to the bottom line, like, you know,\r\n\r\n\r\nNikolas Hulewsky (41:51.593)\r\nTrue.\r\n\r\n\r\nNikolas Hulewsky (42:09.213)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (42:15.337)\r\n20 % as you scale, okay, so that's.\r\n\r\n\r\nRight, right, right, right.\r\n\r\n\r\nKevin Dahlstrom (42:21.514)\r\ncashflow and, uh, and that's fine. Like that, that works just fine for us, especially if we're growing at, you know, let's say 50 % plus per year. It's a really attractive business.\r\n\r\n\r\nNikolas Hulewsky (42:32.019)\r\nSo let me ask you this, there's like this Japanese, I always get it wrong, Ikagi, I don't know how people say it. Effectively what it is is there's four concentric circles, but I always just do three. What you're passionate about, what you're good at and what the world will pay you for, right? How you bring value. So I get that you're passionate about it and I get that there's real demand from the world's perspective. How did you decide like, okay, that third concentric circle?\r\n\r\n\r\nKevin Dahlstrom (42:37.742)\r\nYeah.\r\n\r\n\r\nKevin Dahlstrom (42:46.466)\r\nYeah. Yeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (43:00.743)\r\nwhat you're really good at, what you're world class at. How does that overlap with this business? And how did you come to the place where you thought, okay, I can make this happen?\r\n\r\n\r\nKevin Dahlstrom (43:08.012)\r\nYeah. Right. Well, the any direct to consumer business is essentially a marketing machine. That's what it is. Like, you know, we really, we probably focus more than most on the actual customer experience and the product. But at the end of the day, that's like, that's like a very solvable problem. Like it's all within your control. You know exactly what you need to do. And you can find people who are really good at operations, right?\r\n\r\n\r\nNikolas Hulewsky (43:32.232)\r\nYeah.\r\n\r\n\r\nKevin Dahlstrom (43:37.984)\r\nIt takes time and it's not easy. I'm not, I'm not meaning to, to minimize it in any way, but it's, it's kind of all within your grasp. The marketing piece is a complete unknown and most companies, that's why they fail. They can't figure out how to, either fail or flatline, right? Because they can't figure out how to scale the business. And so the whole ball game in a way is how do you get the message out and how do you scale that message? And that's what I've done my entire career. And I'm, I'm particularly good at taking like.\r\n\r\n\r\nconfusing, controversial type topics and bringing clarity to it. In many ways, like I describe our brand vibe at Bolt as like we're educators with a point of view, with a very strong point of view, right? So here's the information, here's what the research says. And by the way, here's how we interpret that and why that should matter. Because...\r\n\r\n\r\nNikolas Hulewsky (44:31.507)\r\nSo you'd go, sorry, finish your thought.\r\n\r\n\r\nKevin Dahlstrom (44:34.51)\r\nI was just going to say, because that doesn't really exist out there. You know, there's, there's a ton of misinformation and myth and like overwhelm out there in our market. And I view our job is like to cut through all the bullshit and like, give you like, this is what the research says. You can look at it with your own eyes. want to read the studies if you want to, we have, and here's how that, what that means for you. Right. It's like, for example, I'm to give you a very clear example. Like men with low T die sooner.\r\n\r\n\r\nNikolas Hulewsky (44:40.168)\r\nHmm\r\n\r\n\r\nNikolas Hulewsky (44:49.513)\r\nMm-hmm.\r\n\r\n\r\nKevin Dahlstrom (45:03.032)\r\nThat should get your attention as a 40 year old man, right? The research across multiple large scale studies is extremely clear on that. They have worse health and they die sooner. That should be something like, at least is worth spending an hour learning about, right?\r\n\r\n\r\nNikolas Hulewsky (45:05.789)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (45:20.275)\r\nDid you get to the point where you were like, okay, I'm passionate about this, I know that there's value here. And then did you do the research and say like, nobody's marketing this the right way. Like there's a real gap here.\r\n\r\n\r\nKevin Dahlstrom (45:30.318)\r\nI think that's how, sorry, I've got a fly buzzing me. I mean, that's how entrepreneurs roll, right? Like we can't help ourselves. to me, anything that I find interesting, my mind automatically goes to like, what's the business model behind it? Like how, how does this work? Like I'm the guy who I walk into a restaurant and I'm trying to figure out the economics of the place while I'm sitting there eating, right? I just can't help myself. And so this one, you know,\r\n\r\n\r\nNikolas Hulewsky (45:34.033)\r\nyou're good.\r\n\r\n\r\nNikolas Hulewsky (45:54.355)\r\nYeah, yeah.\r\n\r\n\r\nKevin Dahlstrom (45:58.092)\r\nbecause it was born out of like scratching my own itch and everything I do, I go deep in. I'm very careful about what I spend my time on. But the things I do spend my time on, I go extremely deep. And so as a patient slash customer, I did a deep dive. I read all the research myself, which makes me, by the way, more educated on the topic than 99 % of doctors, because they just don't have the time\r\n\r\n\r\nNikolas Hulewsky (46:27.401)\r\nThey don't have the time.\r\n\r\n\r\nKevin Dahlstrom (46:27.436)\r\nor the interest in studying the research. And it's funny how like, you know, whether it's COVID or whether it's testosterone or anything, if you actually read the research that's out there, it's very eye-opening because a lot of times it's not what you hear in the mainstream media. There's, you know, clear research out there that, you know, for example, this idea that there's always been this myth that like,\r\n\r\n\r\ntestosterone somehow negatively impacts your health if you supplement it, which is 180 degrees from the truth. And the research is overwhelmingly clear on that. In fact, even now, even the mainstream like the endocrinology association has now accepted this. The FDA in January of this year just removed warning labels from testosterone because the evidence is so overwhelming that those warning labels were incorrect. That's an unprecedented move, right?\r\n\r\n\r\nNikolas Hulewsky (47:22.761)\r\nI remember 10 years ago, I was working out a lot and I started taking creatine. And my wife, my wife was like, you're taking creatine? you, you're gonna roid rage on me? I'm like, what? She's like, well, you're just gonna, you know, and then we'd have a conversation and I get mad or something. She's like, was that the creatine coming out and the roid rage? And I'm like, you understand that creatine is not steroids, right? Or like, or we'd see somebody who's on like testosterone replacement therapy and they'd be like, well, that's why he's such a, in such a bad mood.\r\n\r\n\r\nKevin Dahlstrom (47:47.971)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (47:51.65)\r\nYou're right, right? Like it has been pervasive misconceptions around TRT.\r\n\r\n\r\nKevin Dahlstrom (47:56.27)\r\nAnd by the way, that's a great example, like the roid rage thing that again came out of the bodybuilding era and it's 180 degrees different. one of the things our customers like best about being in an optimal range, physiologic range is just the sense of calm that they get the sense of presence with their family. And we find that almost without exception, depression and anxiety disappear. So you have guys out there that are taking.\r\n\r\n\r\nantidepressants, anxiety medications who simply don't need to be on them. The fact is your testosterone is low. When you correct that, almost in all cases, anxiety and depression just disappear.\r\n\r\n\r\nNikolas Hulewsky (48:30.995)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (48:37.021)\r\nYeah, I mean, I'm sure roid rage is real in the guys that are taking 10 X what you know, some of the natural levels should be or 50 whatever, whatever the number is. But that's that's not what we're talking about here. Like nobody's going and doing testosterone replacement therapy. He was like, pump me with 50 X doc. I'm wrestling Randy man savage later this afternoon.\r\n\r\n\r\nKevin Dahlstrom (48:42.646)\r\nor 50x, yeah.\r\n\r\n\r\nKevin Dahlstrom (48:52.364)\r\nYeah.\r\n\r\n\r\nYeah. Yeah. I mean, to, quantify it for you, just to get really into the weeds. so like I'm a big guy, I weigh 200 pounds. I'm as active as anyone you'll meet. six, three, I'm tall. I'm active. Yeah. I'm dense, but, but, but I, my current dose is, of testosterone is 84 milligrams, which is a 12 milligrams.\r\n\r\n\r\nNikolas Hulewsky (49:05.993)\r\nHow tall are you? Okay, you're, cause I was gonna say, you don't, you don't look like you're 200 pounds. You look, very lean. Yeah.\r\n\r\n\r\nKevin Dahlstrom (49:24.572)\r\na day, so 84 milligrams a week, 12 milligrams a day. It's literally two drops of medication. And historically, even for men who are on just regular TRT, not bodybuilders, a dose might be 150, 200 milligrams. like literally twice what I'm, but that would be a normal dose, but, and what to make matters worse, they would take that all in one big dose once or twice a week. And, which has causes your levels to go like this.\r\n\r\n\r\nNikolas Hulewsky (49:39.501)\r\nmy gosh.\r\n\r\n\r\nNikolas Hulewsky (49:50.905)\r\njeez. Uh-huh.\r\n\r\n\r\nKevin Dahlstrom (49:53.708)\r\nAnd so it just doesn't make any sense. And so we literally pioneered, at least in the U S we pioneered the idea of micro dosing, which now being copied by a bunch of our competitors, which is great because it is, it's the gold standard.\r\n\r\n\r\nNikolas Hulewsky (50:07.251)\r\nShe's have you I'm sure you have you know who Ted Williams is. Baseball player. Yeah. You've heard of this concept of the fat pitch. When I say it, I'm sure you'll be like, yeah, I've heard that. But Ted Williams, for anybody listening to be a Hall of Fame baseball player, if you hit the ball three times out of 10, 30 % of the time, you're Hall of Fame level baseball player. And Ted Williams had a couple of seasons where he hit the ball four times out of 10.\r\n\r\n\r\nKevin Dahlstrom (50:12.258)\r\nThe baseball player?\r\n\r\n\r\nKevin Dahlstrom (50:17.015)\r\nUh-uh, no.\r\n\r\n\r\nKevin Dahlstrom (50:28.418)\r\nRight. Yep.\r\n\r\n\r\nNikolas Hulewsky (50:34.473)\r\nAnd people were losing their mind. He hits the ball 40 % of the time, but he had this system that he would do and he broke down the strike zone into like 27 different areas. And he knew where within the strike zone, he had a higher probability of hitting versus other places. And he said he would sit and he'd wait on his fat pitch. And that's how he had a higher batting average than most other people. Warren Buffett has stolen this as well, where he's like, I'm only looking for things that hit fit my specific buy box.\r\n\r\n\r\nAnd when I go, I go big. It's my fat pitch. And I think from like this conversation, it's just reminding me what my takeaway is. Somebody like you, who's had a lot of success in the world. When you get to a point where you can take something you're passionate about, like your health and something you've deep dived into and you're just kind of become obsessed with. And the minute you realize how you can pair that with your unfair competitive advantage, that becomes a fat pitch. Like those are moments where you say, I should go.\r\n\r\n\r\nin on this. Have you had moments like this before? Or is this kind of the first time that you felt like, man, this is these are the meaning of my two worlds.\r\n\r\n\r\nKevin Dahlstrom (51:40.086)\r\nYeah. I wish I could say I've had moments like that before, because it's great. It's it feels great, but, at 54 years old, this is really the first time I've had it. You know, most of my previous startups have been, you know, venture backed, changed the world type businesses. And I would say, I have very few regrets in life because I have the best life of anybody I know. But one thing I do cite as like a minor regret is I spent way too many years.\r\n\r\n\r\nNikolas Hulewsky (51:50.633)\r\nIt's so cool.\r\n\r\n\r\nKevin Dahlstrom (52:08.428)\r\nchasing unicorns is what I call it. Like trying to like have these tech startups that yeah, if it works, it's a billion dollar business, but the risk adjusted, you know, investment is arguably is debatable. And, whereas I really didn't know, it sounds silly to say, I didn't know that you could just like find something you're passionate about and to your, to your Icky guy come like, you know, you're passionate about it. It's a, it's a juicy market and I have a competitive advantage.\r\n\r\n\r\nNikolas Hulewsky (52:10.611)\r\nMm-hmm.\r\n\r\n\r\nKevin Dahlstrom (52:37.58)\r\nYou could just find those things and create an amazing business. Like I wish I could have those 10 years I spent chasing unicorns back to put into something like my current business, Bolt.\r\n\r\n\r\nNikolas Hulewsky (52:47.785)\r\nThat's incredible, Well, Kevin, this has been amazing. Better than I anticipated and I had high hopes for this. So where's the best place for people to come find you? Bolt?\r\n\r\n\r\nKevin Dahlstrom (52:54.744)\r\nGood.\r\n\r\n\r\nYeah. So I write a lot on, on X or it used to be called Twitter, which I think is how you, you discovered me. on, on, on X, my handle is, at camp for CAE MP number four. It's a old climbing reference. And then if you want to check out bolt, our website's very easy to remember it's bolt.health. So check it out. people can reach me. One thing I do that's kind of unique is, I give my email out, address out to anyone who has questions.\r\n\r\n\r\nNikolas Hulewsky (53:04.143)\r\nI see.\r\n\r\n\r\nNikolas Hulewsky (53:16.262)\r\nthat off.\r\n\r\n\r\nKevin Dahlstrom (53:25.152)\r\nAnd I'm incredibly responsive. I view that as a big part of my job. So reach out to me at Kevin at bolt.health. And if you have questions.\r\n\r\n\r\nNikolas Hulewsky (53:31.945)\r\nWhat about that webinar? Can people come to that without, I don't know, being a member? Okay. When is it? Oh, okay. Perfect, perfect. We'll do that. I think that would be amazing for people. All right, man, this is great. All right, I'm gonna hit stop. We'll let this upload for a minute.\r\n\r\n\r\nKevin Dahlstrom (53:36.844)\r\nYeah, let's put a link to the webinar in the show notes. We recorded it. yeah, there's a link where people can go watch it. Yeah.\r\n\r\n\r\nKevin Dahlstrom (53:47.822)\r\nCool. This is fun.",
  "metadata": {
    "duration": "",
    "date": "",
    "platform_source": "Google Drive"
  }
}