{
  "episode_number": "235",
  "episode_title": "How Mattress Firms Make Money Despite Empty Stores with Nick Hancock",
  "guest_name": "Nick Hancock",
  "business_name": "Direct Outlet Mattress",
  "transcript": "﻿Nikolas Hulewsky (00:01.39)\r\nAll right, we got the mattress guy on here. Freaking stoked to talk about mattresses. Let me ask you a question really quickly. What's the grossest mattress you've ever seen?\r\n\r\n\r\nNick (00:12.686)\r\nI I've seen countless with just multiple stains on it. You get the...\r\n\r\n\r\nNikolas Hulewsky (00:16.78)\r\nIs it the stains? there maggots? You ever find like maggots in them?\r\n\r\n\r\nNick (00:19.522)\r\nI haven't yet, thankfully. I don't know if I would even, what I would do, I'd probably call like a removal company. I try and stay away from used messages at this point.\r\n\r\n\r\nNikolas Hulewsky (00:29.824)\r\nIt's this dude, it's the stains you posted a picture the other day. It was like, is that blood or coffee or poop or like what the freak is this?\r\n\r\n\r\nNick (00:33.424)\r\nDisgusting. I had one recently, I was helping an old lady out and I picked up the mattress and I felt the wetness on it and I was like, this is disgusting.\r\n\r\n\r\nNikolas Hulewsky (00:44.952)\r\nDude, I heard the stat like if you have a mattress for 10 plus years, like a certain number of pounds of accumulated human like skin shedding is in that mattress. Is that true?\r\n\r\n\r\nNick (00:53.146)\r\nYes, that's what people don't understand fully is like your body just naturally sweats. So you don't have to pee the bed or spill wine or whatever. Like you're just naturally going to have, right? Your bodily, it's disgusting. It's disgusting.\r\n\r\n\r\nNikolas Hulewsky (01:11.51)\r\nmy gosh. All right. So you own a mattress business. And you got, I'm to do like a quick background on you. It was a, it's a family business. Your dad owns a store. Your brother owns a store. You went out kind of on your own, learned the business, ended up coming back to where family is. now are you operating in the same market as them?\r\n\r\n\r\nNick (01:15.568)\r\nYep.\r\n\r\n\r\nNick (01:33.144)\r\nI'm in Charlotte, the ARN, my brother's in Raleigh, my dad's in Wilmington. But yes, I started out in Pittsburgh to start.\r\n\r\n\r\nNikolas Hulewsky (01:40.28)\r\nSo you have these mattress stores across the family. Are you guys sharing any resources?\r\n\r\n\r\nNick (01:45.072)\r\nYes, everything. We're sharing and conversation. So essentially we all own and operate our own location, but we come together collectively as a team when buying, when talking through strategy, when marketing, et cetera.\r\n\r\n\r\nNikolas Hulewsky (02:01.954)\r\nWhat about things like payroll, accounts payable, financing, those types of things?\r\n\r\n\r\nNick (02:06.48)\r\nWe don't have to, yeah, I mean, we don't have to necessarily worry about that yet. To be honest, we all don't have any employees or anything under us. So it's kind of a one-man band on each location. But in the future, yes, like we're talking about rolling out online as well here in the next three or four weeks. And that'll be something where we share expenses and everything on all that.\r\n\r\n\r\nNikolas Hulewsky (02:17.806)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (02:31.726)\r\nAnd so, what's name of the company?\r\n\r\n\r\nNick (02:34.16)\r\ndirect outlet mattress.\r\n\r\n\r\nNikolas Hulewsky (02:35.778)\r\nDirect outlet mattress. Is that a franchise or is it like that's your guys' family company? Dude. So here's another big question. I don't remember the name of the companies, but it's the one that's the mattress company with like a red sign, mattress. I don't know. I don't know. But they have all these brick and mortars everywhere. And I don't ever see people in these freaking stores. I-\r\n\r\n\r\nNick (02:39.066)\r\nNope, it's ours.\r\n\r\n\r\nNick (02:50.682)\r\nby appointment.\r\n\r\n\r\nNick (02:55.748)\r\nYeah.\r\n\r\n\r\nNick (03:00.412)\r\nYou\r\n\r\n\r\nNikolas Hulewsky (03:01.73)\r\ndon't understand what the business model is, dude. Like you have the real estate, you have the overhead, but nobody's in your store. How do these businesses make money?\r\n\r\n\r\nNick (03:08.092)\r\nYeah, it's because all you need is one to two to three customers a week and it pays the bills, right? I said this and people say this about mattress firm 24 seven. They're like it's money longer Okay, mattress firm. Yeah master is the biggest they're multi-billion by the way. They just got bought out for four billion Probably like the third time with PE They sell mattresses for six seven eight grand\r\n\r\n\r\nNikolas Hulewsky (03:14.584)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (03:18.926)\r\nThat's what it was, mattress firm, mattress firm. Yeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (03:27.767)\r\nmy gosh.\r\n\r\n\r\nNick (03:35.256)\r\nevery day of the week and twice on Sunday. They'll sell adjustable base as well. You can literally, if you go to their website right now, you'll find Tempur-Bedix anywhere from 10 to 16K. And that's for the managers and the adjustable, right? Do they cost 5K for that? No, no shot. I mean, they're making high margins, 60, 70 % margins, right? But then they have all the employees, marketing, et cetera, that they pay for. So that's a simple answer.\r\n\r\n\r\nNikolas Hulewsky (03:56.046)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (04:03.936)\r\nSo since it's a high ticket item, it's like, I just need a few of these a week and the store pays for itself.\r\n\r\n\r\nNick (04:08.028)\r\nWell, and they make it up, right? I mean, they're the biggest known mattress brand in the US. So they make it up with foot traffic and all their ads that they spend countless millions on, right?\r\n\r\n\r\nNikolas Hulewsky (04:22.585)\r\nWe just, bought a new mattress last year in the last year, but you know, 2024 and we stopped five grand on it, but it was at a mattress. It was at a mattress firm. And it was like, cool. Let's, let's go do this thing. Um, here's another thing I don't understand. Most of the mattress firms that I've seen are in really good locations. Like they're on really busy streets. They're highly visible. It's not like they're in the business park. You know what I mean? Is that strategic? Like, this.\r\n\r\n\r\nNick (04:25.168)\r\nYeah.\r\n\r\n\r\nNick (04:31.098)\r\nYep. There you go.\r\n\r\n\r\nNick (04:51.664)\r\nYeah, location, location, location, right? I mean, it's convenience. A mattress firm is all about convenience. That's why you'll see one on one side of the street and one on the other, right? They're trying to hit people on both drives, right? So there's a very traditional model where it's, they just want to saturate the market and then they get almost all of it, right? And then there's this big time foot traffic, right? People searching on Google and you're two, three minutes away from a mattress firm. That's it.\r\n\r\n\r\nNikolas Hulewsky (04:51.746)\r\nReally an impulse buy?\r\n\r\n\r\nNikolas Hulewsky (04:59.086)\r\nHmm\r\n\r\n\r\nNikolas Hulewsky (05:03.618)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (05:20.258)\r\nOkay, so tell me about the stores themselves, like your stores. Do you own the real estate or are you leasing them? Okay. What about a company like Mattress Firm? Do they own the real estate or are they leasing?\r\n\r\n\r\nNick (05:26.158)\r\nNo, no we rent.\r\n\r\n\r\nNick (05:31.644)\r\nI have to double check on that. I assume at some point they do. I know that it depends. They have now what used to be one of my dad's stores and they rent it out. So I think it probably depends. I assume with how much they have over, I think it's like 2,500 locations. So I doubt they own all of them, but they probably have a good majority of them that they own.\r\n\r\n\r\nNikolas Hulewsky (05:52.204)\r\nThat would be a lot of real estate. Yeah, that would be a lot of real estate.\r\n\r\n\r\nNikolas Hulewsky (05:57.9)\r\nSo let's look at a store like yours and we can maybe try to make it analogous to mattress firm, but how many square feet is your store?\r\n\r\n\r\nNick (06:06.332)\r\nMy store is about 3,000 square feet.\r\n\r\n\r\nNikolas Hulewsky (06:09.262)\r\nOkay, so 3,000 square feet and your monthly lease is what on that?\r\n\r\n\r\nNick (06:13.508)\r\nMy mind's more expensive here, to be honest. It's $3,300.\r\n\r\n\r\nNikolas Hulewsky (06:17.262)\r\nOkay, so 3,300 and then you've got how many employees that work for you? None, it's just you? Okay, that's right. All so you're running the business full-time. What other overhead expenses would you have? So 3,300 for the lease, maybe you have some utilities in there.\r\n\r\n\r\nNick (06:21.261)\r\nNone. Tell me. Yep.\r\n\r\n\r\nNick (06:26.618)\r\nYep.\r\n\r\n\r\nNick (06:30.886)\r\nReally advertising, yeah, really advertising. We're spending another grand or so, grand to two grand-ish in advertising. Marketplace, Craigslist, OfferUp, we're all easy ones. But then really trying to build out, know, business like ours, word of mouth, right, referral programs with interior designers are great because they have people who want to spend five to six to seven grand on mattresses, right?\r\n\r\n\r\nNikolas Hulewsky (06:52.046)\r\nMm-hmm.\r\n\r\n\r\nNick (06:59.74)\r\nAnd then realtors as well, you know\r\n\r\n\r\nNikolas Hulewsky (07:03.758)\r\nOkay, so for a business like yours, let's say if your lease is $3,300 a month, marketing is $1,000 a month, let's just round up and say five grand a month is like your overhead, right? This is fixed costs, this is what I'm spending every single month. So if you look at it from, and if you look at it from that perspective, if you're selling a six, seven, $8,000 mattress, I know you're not, just going back to the mattress firm, six, seven, $8,000 mattress, you need to sell like two of those a month.\r\n\r\n\r\nNick (07:13.306)\r\nYup. Yup. Yup. And that's pretty hot, to be fair as well.\r\n\r\n\r\nNick (07:26.502)\r\nYeah. Right.\r\n\r\n\r\nNick (07:33.476)\r\nYep, yep, exactly. So like that store that you went to, that one sale, you know, paid for probably two weeks at least for them and then they need another one for the next two weeks. You just made that person's day. Yeah.\r\n\r\n\r\nNikolas Hulewsky (07:34.444)\r\nto basically just meet your overhead. That's crazy. Okay, that makes sense.\r\n\r\n\r\nNikolas Hulewsky (07:48.916)\r\nInsane. Are there franchise mattress stores? There are.\r\n\r\n\r\nNick (07:53.668)\r\nYeah, yeah, definitely. Yeah. I mean, I don't want to give all of them, you know, publicity, but, but, but yeah, there's tons of them out there and honestly, a lot of them are garbage.\r\n\r\n\r\nNikolas Hulewsky (07:57.964)\r\nNo, it's cool. Yeah, you're good.\r\n\r\n\r\nNikolas Hulewsky (08:04.556)\r\nAll right, so here's, let's get into like the business mechanics of it. How do you acquire customers? Cause you just said Facebook marketplace, Craigslist, surprising. And then you're like working on word of mouth. What are the traditional ways that you typically find customers for your store?\r\n\r\n\r\nNick (08:14.747)\r\nYep.\r\n\r\n\r\nNick (08:19.386)\r\nYeah, mean Google, Google's the biggest, right? I mean people just search mattress store near me, right? King mattresses near me, whatever the case is, right? So that's the first thing. And we have a marketing team striking through.\r\n\r\n\r\nNikolas Hulewsky (08:30.754)\r\nAnd are you focused for Google? Is it like SEO? Is it pay-per-click?\r\n\r\n\r\nNick (08:34.544)\r\nYeah, exactly. Right now, SEO, we will get into PPC down the line. We use Bodhi and Striker for SEO. Yeah, yeah, yeah. Yeah, they're great. They're great. So we use them for all three locations. And then eventually we'll do PPC as well, especially as we build out our online.\r\n\r\n\r\nNikolas Hulewsky (08:44.336)\r\ndude. Awesome. I love Bodhi. I had him on the podcast.\r\n\r\n\r\nNikolas Hulewsky (08:58.562)\r\nWhat about Google business profile? Is that something you focus a lot on or no? Okay. All right. Cool. So there's the Google side and then interesting Craigslist and Facebook marketplace. Like how do you advertise on those?\r\n\r\n\r\nNick (09:02.276)\r\nThey handle all that for us. Yeah. Kind of all included in the SEO thing. Yep.\r\n\r\n\r\nNick (09:12.922)\r\nYeah, and to be completely transparent, used to, like Facebook's died down a good bit. Facebook used to be like, I could get people buying a thousand, $2,000 mattresses all the time. It's gotten far lower in quality, especially over the past about two or three years. When I went out, when I was in Pittsburgh, where I started, which I did, I think it was close to 68,000 in the first four months there in sales.\r\n\r\n\r\nNikolas Hulewsky (09:25.699)\r\nMm-hmm.\r\n\r\n\r\nNick (09:43.752)\r\nIt was probably 50 % of my sales were Facebook Marketplace out there. Different dynamics and everything out there, but yeah, was just, yeah, Facebook Marketplace. I don't know what to say other than that. Put it up, we use something to automate it, so it's pretty easy.\r\n\r\n\r\nNikolas Hulewsky (09:50.037)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (10:02.702)\r\nHow much did you do in your first, you said $400,000 in your what? Oh.\r\n\r\n\r\nNick (10:05.596)\r\nNo, 68,000 in the first four months.\r\n\r\n\r\nNikolas Hulewsky (10:09.912)\r\nSorry. Wait $400 million in two days. You're like, no, no, no, no, Nick, you're an idiot. That's not what I said. so Facebook marketplace isn't as big of a channel for you, but Craig's list is.\r\n\r\n\r\nNick (10:22.202)\r\nNo, Google's the biggest. And then word of mouth and just getting your name out there and programs. No, we don't. I haven't seen them as effective. I I got thousands of things in the mail for especially political season, right? And it was just garbage. I'm like, trash, trash, trash, right? So, yeah.\r\n\r\n\r\nNikolas Hulewsky (10:28.558)\r\nDo you do mailers? you do?\r\n\r\n\r\nNikolas Hulewsky (10:48.014)\r\ntrash. So what is your, do know what your customer acquisition cost is right now?\r\n\r\n\r\nNick (10:53.882)\r\nYeah, I was thinking about this. I don't think we have like a pinpoint number on it, to be honest with you. I'd say it's, I mean, it's less than 100 for sure. You know, but it\r\n\r\n\r\nNikolas Hulewsky (11:04.172)\r\nWell, let's calculate it. If you're spending $1,000 a month on marketing, on average, how many customers are you getting a month?\r\n\r\n\r\nNick (11:08.208)\r\nYep.\r\n\r\n\r\nWe're anywhere in the, I'd say 20 to 30 range.\r\n\r\n\r\nNikolas Hulewsky (11:16.494)\r\n20 to 30, okay, so if it's 20, that's $50. If it's 30, it's $33. So you're between 33 and $50 per customer per month. And then how much revenue are you doing a month?\r\n\r\n\r\nNick (11:19.665)\r\nYep.\r\n\r\n\r\nNick (11:25.316)\r\nRight. Talk about right. Yeah.\r\n\r\n\r\nNick (11:31.804)\r\nSo let's see, we're on pace for about 200 ish, 200,000 a year. So I think that brings us out to like 20 ish depending.\r\n\r\n\r\nNikolas Hulewsky (11:42.35)\r\nOkay, let's, yeah, cool. So let's say 20. Wow, so if you're spending 1,000 and you're getting 20,000 coming in the door, that's a 20 ROAS. That's pretty good.\r\n\r\n\r\nNick (11:51.195)\r\nRight.\r\n\r\n\r\nNick (11:54.544)\r\nYeah, yeah, it's just, mean, I think repeat referrals, right? Google, it all kind of plays in, you know, the model isn't like these bigger stores, right? Where it's foot traffic, et cetera. The model is more driving people to a location rather than the location driving the sales.\r\n\r\n\r\nNikolas Hulewsky (11:57.112)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (12:14.958)\r\nSo if I'm like, mean, it be off $20,000 a month and you get 20 customers a month. That's only $1,000 per customer per month. Is that your average ticket size or is that just?\r\n\r\n\r\nNick (12:20.88)\r\nMm-hmm.\r\n\r\n\r\nNick (12:25.244)\r\nYeah, right now and to be honest in the past three months, yeah, I'd say so Our business is completely like this is a fascinating time for us. It's completely changing We used to cap out right around fifteen hundred two thousand In the past three months, we've taken on other lines New models. This is right around the time where it all changes now. We're up to I think three thousand thirty five hundred, right? It's almost doubling our total\r\n\r\n\r\nNikolas Hulewsky (12:27.692)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (12:36.43)\r\nHmm.\r\n\r\n\r\nNick (12:54.78)\r\nability there.\r\n\r\n\r\nNikolas Hulewsky (12:59.343)\r\nWhat does that mean when you expand new lines? Isn't it just a mattress?\r\n\r\n\r\nNick (13:03.356)\r\nNo, there's a thousand things that go into mattresses. That's really an educational thing at the end of the day. Yeah, so you have like individually pocketed coils, which is the best coil unit you can have in a mattress. You have different layers of memory foam. So you have like low density and then high density, right? High density would be considered like what's in those, like, I don't know if you bought like a Tempur-Pedic or what you bought from mattress firm.\r\n\r\n\r\nNikolas Hulewsky (13:09.538)\r\nYeah, I'm so stupid. Tell me, like, what...\r\n\r\n\r\nNikolas Hulewsky (13:30.838)\r\nWe didn't buy Tempur-Pedic. My wife did not like the way the Tempur-Pedic felt. So we got, it is a traditional mattress with springs in it, but it's like some hybrid type. Yeah.\r\n\r\n\r\nNick (13:34.342)\r\nGotcha. Okay.\r\n\r\n\r\nNick (13:38.384)\r\nOkay.\r\n\r\n\r\nsome hybrid type. right there, that tells me that it's got memory foam in it, if it's a true hybrid, which for five grand, you better be getting that. And then it's got individually pocketed coils. It's probably got eight.\r\n\r\n\r\nNikolas Hulewsky (13:45.486)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (13:50.155)\r\nSo the bass was in there too, right? it's probably, I don't know, 1500 for the bass and then the rest or some split. I'm not sure exactly what it was.\r\n\r\n\r\nNick (13:53.274)\r\nGot it. Okay.\r\n\r\n\r\nRight.\r\n\r\n\r\nNick (13:59.418)\r\nRight, Yeah. Bass isn't like an adjustable bass or... Okay, gotcha. Cool. Cool.\r\n\r\n\r\nNikolas Hulewsky (14:02.87)\r\nMm-hmm. Yeah, dude, it's... Can I just say for a second? Life-changing. I'm dead freaking serious. Do you have an adjustable base? Bro. Bro. I'm an old married man. I'm telling you right now. The ability to prop your head up, bro? my gosh!\r\n\r\n\r\nNick (14:08.38)\r\nYou love it. Yeah, it's awesome.\r\n\r\n\r\nI don't, I don't need one, I'm single so it doesn't really, for me, but. You love it.\r\n\r\n\r\nNick (14:26.564)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (14:29.314)\r\nLike I don't have to have five pillows behind me anymore for my wife and I to watch a show. Talk about put my feet up, zero gravity mode, or my wife and I call it zero grav. It's incredible. It has like the vibrating massager, which I thought was super stupid at first. And now I'm like, take me away. Just take me away. It's amazing. Like legitimately.\r\n\r\n\r\nNick (14:31.58)\r\nYeah.\r\n\r\n\r\nYeah.\r\n\r\n\r\nYeah.\r\n\r\n\r\nYeah. Yeah. You love it.\r\n\r\n\r\nYeah, for real.\r\n\r\n\r\nNick (14:53.084)\r\nIs it all one? Is it all one king for you guys? Gotcha.\r\n\r\n\r\nNikolas Hulewsky (14:56.654)\r\nYeah, yeah, it's all one king. I didn't want the, I don't know, I just felt like there's too, at that point it was like too many moving parts and I don't know, that just felt silly for me. I, dude, it's legitimately.\r\n\r\n\r\nNick (15:03.972)\r\nYeah. Yeah.\r\n\r\n\r\nNick (15:09.424)\r\nPeople typically go the Twin XL route when they can't compromise on a mattress, right? And so that's typically the route there. But it's more expensive. You're talking another three, four grand.\r\n\r\n\r\nNikolas Hulewsky (15:15.917)\r\nYeah.\r\n\r\n\r\nYeah, it is. It is and like, I was honestly I'm I fall asleep really easily. So I was good to go with whatever my white chest. Yeah. But I will say I like for the first time, the week after I got it the first time I was like, I understand why the sales tactic now is like, you spend a third of your life in bed. You don't mean it's like you, you should treat yourself. Come on, spend a little more.\r\n\r\n\r\nNick (15:26.95)\r\nWell, the guys always just do whatever their wife says. It's really hard. Every time.\r\n\r\n\r\nNick (15:45.904)\r\nYeah, right. Yeah.\r\n\r\n\r\nNikolas Hulewsky (15:49.006)\r\nIt is legitimately, I've had both my brother-in-laws come over and I'm like, when we first bought it, I was like, dude, come upstairs. They're like, what? I'm like, you just come with me. And they're just like, I'll go and lay in my bed. And they're like, this is kind of weird. And I'm like, yeah, but it's amazing, right? And anyways, I'm a believer.\r\n\r\n\r\nNick (15:56.358)\r\nYeah. Come on.\r\n\r\n\r\nNick (16:02.672)\r\nYeah. Well, you know what they say about shoes and mattresses. They say if you're not on one, you're on the other. And so they say to spend on that. Yep. There you go.\r\n\r\n\r\nNikolas Hulewsky (16:12.076)\r\nIf you're not on one year, I haven't, no, I hadn't heard that. Okay. So anyways, you've, you've basically expanded the quality offerings, I guess, like those being sort of the high end. Okay.\r\n\r\n\r\nNick (16:23.62)\r\nYeah, 100%. Exactly. The quality offerings, but also the ability for us to capture more on that revenue and to get our LTV up, right?\r\n\r\n\r\nNikolas Hulewsky (16:34.606)\r\nFor you, like it seems to me, I don't know, if you spend 1000 and it generates 20,000, why not spend 5000 and generate, you know, whatever that number is, 100,000.\r\n\r\n\r\nNick (16:40.944)\r\nMm-hmm.\r\n\r\n\r\nNick (16:47.388)\r\nYeah.\r\n\r\n\r\nNick (16:52.636)\r\nYeah, the hardest part with the store model, and this is where for me it's always been a catch 20, right? Is you still got to reinvest that money back into inventory, right? And so you have this inventory turn and then some inventory doesn't turn like you expect it to. And so that's probably the hardest part. Now that is changing. So we've, like I said, a lot's changed in the last three months really for us. A lot of our higher end models were bringing in less in inventory.\r\n\r\n\r\nNikolas Hulewsky (17:08.974)\r\nNick (17:20.27)\r\nand we're just saying to our manufacturers, hey, ship it to us when we need it, right? And so we'll order stuff in and just tell our customers three to seven days, and then we have less money in inventory, right? So we're getting better at just like cashflow as well there. So it's kind of a combination of those things.\r\n\r\n\r\nNikolas Hulewsky (17:40.768)\r\nIs it pretty typical for to, for mattress companies to just hold a bunch of inventory?\r\n\r\n\r\nNick (17:46.554)\r\nYeah, I when I started out in Pittsburgh, we had 30K in the business before I even sold a mattress.\r\n\r\n\r\nNikolas Hulewsky (17:52.568)\r\nIs that because?\r\n\r\n\r\nIs that because people want their mattress right away and if you can't deliver it right away, they'll like walk?\r\n\r\n\r\nNick (17:59.874)\r\nEspecially the cheaper cheaper people. yeah.\r\n\r\n\r\nNikolas Hulewsky (18:02.99)\r\nI didn't know that. I guess that makes sense. Okay, so it is a pretty capital intensive business, but it's all tied up in your inventory.\r\n\r\n\r\nNick (18:09.508)\r\nYeah, like I have a customer later today and I expect to probably deliver it tonight.\r\n\r\n\r\nNikolas Hulewsky (18:16.152)\r\nDo you, other than the mattress sales, are there any other revenue streams?\r\n\r\n\r\nNick (18:19.484)\r\nMm-hmm.\r\n\r\n\r\nNick (18:23.612)\r\nIn terms, yes, like other products and stuff we do, pillows, protectors, adjustable bases, mentioned it, bases. So there's all these other add-ons that we'll do as well.\r\n\r\n\r\nNikolas Hulewsky (18:28.172)\r\nMm-hmm. Okay.\r\n\r\n\r\nNikolas Hulewsky (18:35.81)\r\nWhat about like pick up and delivery?\r\n\r\n\r\nNick (18:38.286)\r\nYeah, don't really make a lot of money there to be honest with you and not really something I care a lot for. I think it's just time out of the business really more so for me. So we charge for it. I don't really get excited doing it.\r\n\r\n\r\nNikolas Hulewsky (18:47.406)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (18:52.236)\r\nWhat about things like warranty? Like, you buy a three year warranty for your mattress. Do you sell things like that?\r\n\r\n\r\nNick (18:58.233)\r\nIt comes included with the mattress.\r\n\r\n\r\nNikolas Hulewsky (19:00.68)\r\nOkay, so you're buying it from a manufacturer and the manufacturers have the warranty you as the mattress company or the wholesaler and not selling. Okay, that makes sense. What are typical margins on a business like this?\r\n\r\n\r\nNick (19:05.552)\r\nExactly.\r\n\r\n\r\nRight.\r\n\r\n\r\nNick (19:12.038)\r\nSo, I kind of break it up into three different categories, especially now with Twitter and everything. Residential, anywhere from 50 to 60%, right? And for mattress firm, et cetera, probably even more so.\r\n\r\n\r\nNikolas Hulewsky (19:27.426)\r\nAnd that's gross margin or is that like net?\r\n\r\n\r\nNick (19:30.268)\r\nThat's so net is going to be around 30 to 33 after probably everything said it said done. But yeah gross on like just mattress. Here's my cost of goods, right? on that Airbnb around the 30 to 40 ish mark depending on volume and then hotels anywhere from like the 10 to 15 ish.\r\n\r\n\r\nNikolas Hulewsky (19:34.67)\r\nOkay, cool.\r\n\r\n\r\nNikolas Hulewsky (19:56.248)\r\nbecause on hotels you're making it up in volume as opposed to just the margin.\r\n\r\n\r\nNick (19:59.343)\r\nyeah, real volume. Yeah.\r\n\r\n\r\nNikolas Hulewsky (20:03.008)\r\nWhich one do you like the best? If you had to pick one to just like go all in on.\r\n\r\n\r\nNick (20:07.942)\r\nJust do 24-7, hotel, obviously. Yeah, I mean, well, one, I like talking to business owners, so that's great. For instance, the hotel deal we did, right? And people can kind of infer some numbers, but like this is public. $104,000 hotel deal, 392 mattresses. We actually...\r\n\r\n\r\nNikolas Hulewsky (20:09.708)\r\nYeah. Really? Why?\r\n\r\n\r\nNick (20:36.7)\r\nSaved him He got a quote for this what he's the guy's name is our Pete Patel You can find him on Twitter, which is also another cool thing The guys under like a thousand followers on Twitter are just like usually the guys who got it Yeah, but 132,000 is what he got quoted and we were able to do it 104,000 out in Gallenburg, Tennessee and\r\n\r\n\r\nNikolas Hulewsky (20:52.13)\r\nthe best.\r\n\r\n\r\nNick (21:06.16)\r\ngave him better quality mattress, top to bottom in terms of specs, etc. Looked at everything for him. Something's going to last longer. But that interaction with him was just the best. Yeah.\r\n\r\n\r\nNikolas Hulewsky (21:06.424)\r\nto.\r\n\r\n\r\nNikolas Hulewsky (21:18.542)\r\nJust better, just better. When you say you did it in Pittsburgh and then you came back, was Pittsburgh your own thing or were you working for somebody?\r\n\r\n\r\nNick (21:25.648)\r\nYeah, it was my own thing. I wanted to go out on North Carolina, experience something different, and I got it. But then was when it was time to come back to family and everything, I came back.\r\n\r\n\r\nNikolas Hulewsky (21:36.312)\r\nHow much does it cost to start one of these up?\r\n\r\n\r\nNick (21:39.856)\r\nWell, I think when I started mine in Pittsburgh, I was right in all in for 30K.\r\n\r\n\r\nNikolas Hulewsky (21:47.882)\r\nOkay. And then how long until you're profitable? Are you profitable month one?\r\n\r\n\r\nNick (21:53.988)\r\nYeah, I I was profitable month one. That's how kind of our business model works. Especially with marketplaces taking off. I like I said, did 68,000 in sales, you know, in the first four months, right? So yeah, made it all back.\r\n\r\n\r\nNikolas Hulewsky (22:08.514)\r\nHmm. So for you, it's not, it's not like a logistics issue. You personally could sell a hundred mattresses a month, or you could sell 10 mattresses a month. That doesn't, it doesn't really matter. Like you don't, you don't need to add any more employees.\r\n\r\n\r\nNick (22:26.946)\r\nNo, if I, so if I was doing it locally, I might. If I was doing 100 a month, I'd probably have to hire like a assistant for driving and stuff like that, you know, so that I could be in this for selling. But if we were doing it online, no, because I can just ship it anywhere.\r\n\r\n\r\nNikolas Hulewsky (22:39.118)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (22:46.03)\r\nOkay, so that was what I was gonna ask you have companies like purple Casper, these like direct mail, which we tried first. That was the first one that we bought. We're like, need a new mattress and we bought that. And I was like, this is junk. I'm not.\r\n\r\n\r\nNick (22:52.54)\r\nYeah garbage.\r\n\r\n\r\nNick (23:00.548)\r\nWhich one? I love hearing this. So you can just say both, and Casper, you didn't like either.\r\n\r\n\r\nNikolas Hulewsky (23:04.417)\r\ndon't remember which one I just I know it was one of sure purple and Casper I want to say it wasn't one of them I want to say it was like another one that is like whatever but and I'm not I'm not I'm not not saying it because I don't want to out them I literally just don't remember like I'll ask my wife and I'll text you later but we got it and we and I like laid on it and I was like this is like not good\r\n\r\n\r\nNick (23:15.256)\r\nanother marketing company disguised as a built company.\r\n\r\n\r\nNick (23:22.426)\r\nYeah. Yeah, fair.\r\n\r\n\r\nfresh.\r\n\r\n\r\nNikolas Hulewsky (23:30.776)\r\nWhat are we doing here? So we ended up returning it and that's when we went to the mattress firm and like tried out all the mattresses, but they're marketing companies, like you said, that's essentially what they're doing. So they're out, they're just acquiring customers and they're drop shipping basically to them. How do you view them as competitors? Are they totally different businesses or are they real competitors?\r\n\r\n\r\nNick (23:50.15)\r\nThey're real competitors because they have share of mind, right? That's it. So we're kind of targeting that now and a little behind it, but I think long-term quality wins. And so I think the problem with a lot of these companies is they haven't really figured out the mattress side of things as much as the marketing side of things, and they're gonna lose on quality long-term.\r\n\r\n\r\nNikolas Hulewsky (24:17.122)\r\nWhen you say the mattress side of things, why is it just because they're the manufacturer?\r\n\r\n\r\nNick (24:20.124)\r\nThey use cheap crap, yeah. They just put cheap crap in their mattresses and then they have great profit in the short term, but long term it's not gonna last and hop off.\r\n\r\n\r\nNikolas Hulewsky (24:32.184)\r\nDo they have to put cheap crap in their mattresses because of the way that they're shipping it? No, okay.\r\n\r\n\r\nNick (24:35.96)\r\nNo, they don't have to. we have some of the companies we work with, people I ship to on Twitter, largest manufacturer of memory foam and hybrid mattresses in the US, they make a damn good mattress. I sleep on it personally. It's temperpedic quality without the price. That's what I ship to everybody.\r\n\r\n\r\nNikolas Hulewsky (24:53.262)\r\nSo this is the thing that's really interesting about what you're doing is you have the traditional brick and mortar, which is cool. And it's it's geographic based. You know what I mean? Like that's how you're acquiring customers is locally. And then you went out and built this brand on Twitter where you're the mattress guy and you just totally niche down on it, but you've generated sales from it. I want to say, I saw a tweet saying you've generated like $150,000 in sales just from Twitter.\r\n\r\n\r\nNick (25:12.326)\r\nYeah.\r\n\r\n\r\nYep.\r\n\r\n\r\nNick (25:21.946)\r\nYep, exactly. The hotel deal, an Airbnb deal, and then a bunch of residential. Yep.\r\n\r\n\r\nNikolas Hulewsky (25:24.494)\r\nfor real.\r\n\r\n\r\nNikolas Hulewsky (25:29.272)\r\nHow do those work? Are you online or is it like you're taking a manual order and then entering it into the... Really?\r\n\r\n\r\nNick (25:34.844)\r\nAll phone, all phone. I'm DMing with people. Yeah. We haven't got it where it's like perfect and I don't care. Like I'd rather struggle through the scale than anything, you know, because then I'm talking to my customers, right? And I feel like a lot of people are missing touch with talking to customers and not getting, because they want to automate everything and blah, blah, blah, blah, blah, blah, right? Where it's like, if you hear your customers, you're going to know how to grow your business even better. And so that's something I've\r\n\r\n\r\nNikolas Hulewsky (25:45.869)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (26:02.838)\r\nIs that the plan is like, we're never going to have a website where you can order or is it like that's in the work you are.\r\n\r\n\r\nNick (26:04.731)\r\nYeah.\r\n\r\n\r\nNo, we are. That's changing in the next three to four weeks, actually. I'm putting them motion now.\r\n\r\n\r\nNikolas Hulewsky (26:13.774)\r\nSo awesome. What's interesting about Twitter is that you can spend $1,000 a month on Google and you're acquiring 20 customers. And I'm not going to say there's no cost associated with Twitter because there is a real time cost. Like you've spent a lot of time personally investing in that. But once business starts coming, there's no customer acquisition cost, right? Like it becomes a self-fulfilling prophecy.\r\n\r\n\r\nNick (26:32.763)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (26:43.608)\r\nDid you know that when you started? Were you like, I'm to be the mattress guy and that's how I'm going get business? Or were you just thinking around and thought, I'll go.\r\n\r\n\r\nNick (26:45.414)\r\nNo.\r\n\r\n\r\nNick (26:49.48)\r\nI talked about useless crap. I talked about two other business ventures that didn't work out. And then, what's that? A cleaning business which worked, like, was just everybody and their mother does it. And then an SEO business as well that just didn't work out with a partner. And...\r\n\r\n\r\nNikolas Hulewsky (26:56.248)\r\nWhat were they? What were they?\r\n\r\n\r\nNikolas Hulewsky (27:04.907)\r\nNightmare.\r\n\r\n\r\nOkay.\r\n\r\n\r\nNick (27:12.526)\r\nIt was in December when I finally was like, enough's enough. Like, I just need to focus on mattresses. It was always weird. Yep. Yep. Yep.\r\n\r\n\r\nNikolas Hulewsky (27:19.98)\r\nDecember, like three months ago?\r\n\r\n\r\n150 grand in three months? Good for you, dude! That's incredible!\r\n\r\n\r\nNick (27:28.944)\r\nYeah, it's been awesome. Thanks, Rob.\r\n\r\n\r\nNikolas Hulewsky (27:32.942)\r\nWow, like genuinely, that is impressive.\r\n\r\n\r\nNick (27:36.88)\r\nYeah, it's been awesome. I love it. I love Twitter.\r\n\r\n\r\nNikolas Hulewsky (27:42.048)\r\nOkay, so December you're like, there's no Mattress Guys on Twitter. I'm gonna be the Mattress Guy. And you just leaned into it.\r\n\r\n\r\nNick (27:46.682)\r\nHonestly, wasn't even that man. just, for me, it was like, you know what? I'm going all in on my mattress business and that's that period. And I told that to my brother and his wife. And so was like, all right, let me put my money where my mouth is. And I was just really pissed off. And every time I've been pissed off has been when I've done very well. Same thing for the 68,000 in four months. My dad pissed me off.\r\n\r\n\r\nCalled me a cow potato and I just was like after you let's let's see and then I sent a screenshot like a year later my numbers anyways But yeah, December I was like, let's just do it and I just started talking about mattresses 24-7 was straightforward like hey Mattress firm was selling this for six seven grand. You could get it for two grand from me Why are you wasting your money? Do you like your money in your bank or in another person's bank?\r\n\r\n\r\nNikolas Hulewsky (28:44.92)\r\nThat's dude, that is really, really smart. So I'm gonna detour for a second, because there's the Twitter distribution model, which is interesting in and of itself, but you said something that I think is gold. I think that many people need to hear. doubled down, you picked one thing and you doubled down on it. And why did you do that? Like what was it that prompted, was that what it is?\r\n\r\n\r\nNick (29:03.482)\r\nNot enough people are doing this.\r\n\r\n\r\nNick (29:07.612)\r\nCause I failed. I failed at the other. Yeah. I mean, I failed at the other two things. I was like humiliated, right? I put a lot of eggs and two other baskets and I was like, what am I doing? You know, I had this like come to Jesus moment where I was like, what the freak am I doing? You know, I've spent the last three, four years doing mattresses and I don't like, I have something to show for it, but not what I, what I could be.\r\n\r\n\r\nNikolas Hulewsky (29:26.861)\r\nYeah.\r\n\r\n\r\nNick (29:36.204)\r\nAnd to be honest, it was a little bit of like imposter syndrome running from a business that I felt like was really my dad and my brothers, you know? And I'm like, no, like I have just as much a part of this as they do and I need to put my stamp on it. And that's what I've done in last three months. 27.\r\n\r\n\r\nNikolas Hulewsky (29:44.344)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (29:50.946)\r\nHow old are you?\r\n\r\n\r\n27. Dude, I one of things I had to realize, I don't know, in my early 30s was like, there's no shortage of good opportunities. There's no shortage of like, oh, I could make money here. I could make money. Chris, but you know, my business partner mobile home park guy. That's this whole shtick, right is like business porn, like, you can make money here and $100,000 in three days. And that stuff is really attractive. But it's also very distracting. And I'm not\r\n\r\n\r\nNick (30:19.825)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (30:23.234)\r\nI'm not knocking Chris, I'm just saying that it appeals to a lot of people who are trying to figure out what their thing is. And what I have found is, especially when you're starting, you just got to pick the one thing. It doesn't matter necessarily what it is. It doesn't matter even if you're in love with it, just like pick the one thing, become good at it. And then you can set yourself up for freedom down the road.\r\n\r\n\r\nNick (30:25.073)\r\nYeah.\r\n\r\n\r\nNick (30:30.032)\r\nMm-hmm.\r\n\r\n\r\nNick (30:35.845)\r\nMm-hmm.\r\n\r\n\r\nNick (30:43.281)\r\nYeah.\r\n\r\n\r\nYeah, instead of being a jack of all trades and a master of none.\r\n\r\n\r\nNikolas Hulewsky (30:48.91)\r\nMm hmm. Well, dude, 100 % or I saw a post last night about this where a lot of people think I'm to buy a business and hire an operator. I want to buy a business, but I don't want to buy a job. I'm like, um, dude, you should, you should buy a job. Like you're a watcherpreneur at this point. We all started there. You don't know what you're doing. You don't know how to manage stuff. You don't know how the business operates. If you don't know how, how a business operates, it's really difficult to manage that business. And then on top of that,\r\n\r\n\r\nNick (31:03.612)\r\nGotta start somewhere.\r\n\r\n\r\nNikolas Hulewsky (31:19.214)\r\nIf you haven't earned your success, if you're just hiring people out, it's really hard to appreciate that success. And if you don't appreciate it, you aren't going to respond the way that you need to respond in order for it to continue to be successful. Anyways, I have a soapbox on this, but.\r\n\r\n\r\nNick (31:30.556)\r\nNo, I 100 % agree. I'll just say this. I now know the sacrifices my dad made when he started everything. My dad built up a mattress business doing $3.9 million in revenue up until 2008. Had 20-plus employees, eight stores, just an absolute badass, right? In every sense of the word. And unfortunately, really lost it all because of the recession. It held out at 2014.\r\n\r\n\r\nNikolas Hulewsky (31:46.222)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (31:57.517)\r\nMm-hmm.\r\n\r\n\r\nNick (32:00.24)\r\nBut if it weren't for his sacrifice, and if it weren't for my grandmother telling him to get a real job to marry my mom, that's crazy story to himself. None of this would be possible, right? And so I think there's such a blessing in that, but there's a blessing in just grinding it out and figuring it out along the way. mean, part of how I got the hotel deal,\r\n\r\n\r\nNikolas Hulewsky (32:27.309)\r\nYeah.\r\n\r\n\r\nNick (32:29.628)\r\nI got the Airbnb deal before that so the Airbnb deal was eleven thousand five hundred and 21 mattresses bed bases etc. They found me on Twitter as well And I did all that and do you know when I did it? I did it on New Year's Eve Okay, New Year's Eve. I'm in this guy Mike my my is nor I think is how he's pronounced last name He's off Twitter as well and I'm in there\r\n\r\n\r\ntheir new places just because like I wanted to get my part of the job done so that they can get their Airbnb's rolling. And so I was like, all right, frig it, New Year's Eve is what I'm doing. My friends are out partying, yada yada, right? This is such a blessing though. I knock it all out. I do a great job. And Mike's like, if you want to use me, you know, as you know, for whatever, like if people want to talk or whatever, I'll be happy to help our call. The hotel guy was like,\r\n\r\n\r\nNikolas Hulewsky (33:02.38)\r\nMm-hmm.\r\n\r\n\r\nNick (33:25.968)\r\nwho do you gotta talk to? I said Mike. He hops on a call with Mike and then ends up going through the deal with us, right? But if it weren't for me taking the initiative and just grinding it out on New Year's Eve and I could have gone out, drank my stars away with all my friends, right? But to me, it's like, is it. Put your money where your mouth is. If you're about it, go be about it. Go do something.\r\n\r\n\r\nNikolas Hulewsky (33:32.92)\r\nThat's awesome, man.\r\n\r\n\r\nNikolas Hulewsky (33:44.078)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (33:51.714)\r\nI freaking love that. What's your plan for the next six months to a year? does this company look like for you online?\r\n\r\n\r\nNick (33:57.144)\r\nOnline, out online, locally building out these referral programs even more so, I've already seen it. And then letting my marketing team do what they're doing. But the bigger plan is online, distribution online. I told you I bought all this tech stuff that some guys recommended, like Fiora on Twitter did.\r\n\r\n\r\nNikolas Hulewsky (34:06.19)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (34:24.91)\r\nYou're gonna crush,\r\n\r\n\r\nNick (34:27.014)\r\nGonna build out TikTok and then more on Twitter as well and then whatever content else I can put out there. So build out online, selling online, but also Twitter, et cetera.\r\n\r\n\r\nNikolas Hulewsky (34:38.872)\r\nIs that a different business model? Is that just like drop shipping where you actually never have physical custody of?\r\n\r\n\r\nNick (34:41.658)\r\nYeah, I can ship. And I've worked, I just got in with a, I don't know, like a buying group or whatever for shipping, but now we can ship all of my manufacturers anywhere. And so that's huge. Some manufacturers already have it set up with FedEx, so you don't have to worry about it, but not all do, especially the really small ones.\r\n\r\n\r\nNikolas Hulewsky (34:50.2)\r\nGPO.\r\n\r\n\r\nNikolas Hulewsky (35:05.24)\r\ndo that. I'm excited to see how this I haven't seen a guy slinging mattresses on social media yet. So I'm excited to see how you do it. I think you're gonna I think you're gonna do great at it because I haven't seen people doing this yet. So there's obviously an opportunity.\r\n\r\n\r\nNick (35:07.676)\r\nIt's gonna be fun.\r\n\r\n\r\nNick (35:14.79)\r\nYeah.\r\n\r\n\r\nThe great thing is we are it's already proven right I mean did 150 Kenny in three months now Good 100 something of that is is those two big deals, but it's still a ton of other I sold a guy $2,000 mattress just Monday, I think Twitter yeah\r\n\r\n\r\nNikolas Hulewsky (35:23.209)\r\nyeah.\r\n\r\n\r\nNikolas Hulewsky (35:34.168)\r\nDude, that's so cool, so cool. All right, well, we're gonna go check you out. The mattress guy, or is it just mattress guy?\r\n\r\n\r\nNick (35:42.948)\r\nIt's at mattressguy underscore, think.\r\n\r\n\r\nNikolas Hulewsky (35:45.902)\r\nYep, at mattressguy, underscore, cool. Nick, from one Nick to another. Thanks for joining. All right, stay on.\r\n\r\n\r\nNick (35:51.002)\r\nYes, brother. Appreciate you.",
  "metadata": {
    "duration": "",
    "date": "2025-09-24",
    "platform_source": "Google Drive"
  }
}