{
  "episode_number": "210",
  "episode_title": "Outrageous Membership Platform Success! 99% Margins and Zero Ads with Tarek Arafat",
  "guest_name": "Tarek Arafat",
  "business_name": "Table One",
  "transcript": "﻿Nikolas Hulewsky (00:00.878)\r\nSo we don't need to worry about like being on oh, it's recording Okay, mic checks things are good Dude Tark. I am so freaking excited to talk to you because you've got a company It's doing over $200,000 a year in ARR with about 99 % margins $0 in paid ads You built by two people and it's all been within the last six months And you freaking help people what?\r\n\r\n\r\nfind them dinner? You got over 2,000 people in New York City. So tell me like what is one at table one?\r\n\r\n\r\nTarek Arafat (00:35.992)\r\nYeah, I mean, first of all, Nick, thank you for having me, man. This is, I've actually watched a few of your episodes. This is a cool moment for me. yeah, dude, Table One is a membership platform for, like you said, right? It's to help people get, not just dinner. I think it's like,\r\n\r\n\r\nIt's like the dinner, right? It's the amazing reservations that people more or less think are intangible in their city. Right now we're starting in New York because New York seems to be the hotbed of where this problem kind of originated, but also where these restaurants seem to exist. And yeah, it started as a personal problem and we've kind of grown it from there, but I'm excited to talk to you about it.\r\n\r\n\r\nNikolas Hulewsky (00:56.302)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (01:17.206)\r\nSo, alright, so explaining to like I'm five and like I'm an idiot, which won't be hard because I am an idiot, but there's Yelp, there's OpenTable, there's Google. I could just go see, you know, what foods around me. Why would, how did you get freaking 2,000 people in less than six months to pay you money to be part of this membership? Like what exactly is the pain point you're solving?\r\n\r\n\r\nTarek Arafat (01:38.648)\r\nYeah, so I think the thing I always talk about is that...\r\n\r\n\r\nThe reservation platforms that exist today, when you think of the resis and the open tables and whatever else is out there, seven rooms, they're fantastic, right? They're foundationally sound. They've kind of laid the framework of digitizing reservations. Before that, you were calling the restaurant on the phone, and they were writing it down in a book and saying, OK, yeah. And now we've got to a point where these places existed where you can now book a table online.\r\n\r\n\r\nNikolas Hulewsky (01:51.298)\r\nMm-hmm.\r\n\r\n\r\nTarek Arafat (02:10.48)\r\nAnd I think like more or less over the last five or so years, maybe a little bit more than that, like that particular industry, when it comes down to specifically high demand restaurants, you think like the hot spots in your city, it started to cannibalize itself in a lot of ways where now people weren't just reserving tables online for dinner, but they realized that there was inherent value to those tables. So then they started repurposing them and selling them online for hundreds of dollars, thousands of dollars.\r\n\r\n\r\nNikolas Hulewsky (02:38.69)\r\nWait, wait, wait, wait. So people would like sell their reservations?\r\n\r\n\r\nTarek Arafat (02:41.602)\r\nyeah, it's a it is it is in it's an epidemic. It's happening like it's an epidemic. It's happening in London. mean, there was a article like it was last year where they were talking about the\r\n\r\n\r\nNikolas Hulewsky (02:46.006)\r\nIt's an epidemic.\r\n\r\n\r\nTarek Arafat (02:55.876)\r\nBrown University kid who made $75,000 scalping reservations a year. long story short, Long story short, really what happens is these platforms that were built, Open Table launched in 2004, Resi launched in 2014, they were built upwards of a decade plus ago. They were built to accommodate the restaurant. And what's happening now is there's this shift where the consumer is kind of being left out of the equation here, the consumer side of that, where it's not built for\r\n\r\n\r\nNikolas Hulewsky (03:00.494)\r\nmy gosh.\r\n\r\n\r\nTarek Arafat (03:25.83)\r\nspeed in terms of like notifying people when tables are available. There's not protections in place like proper security to guard these things. So what we've basically done is built a system that kind of allows the human back into the game, right? Utilizing this kind of quicker technology so that you can basically start to reserve these tables again like a human would and we kind of connect these in platforms.\r\n\r\n\r\nNikolas Hulewsky (03:49.038)\r\nSo, all right, let me see if I can frame it. It's almost like people with, what's the big ticket selling company? It's not StubHub, it's Ticketmaster. Okay, so it's like Taylor Swift's tickets go for sale on Ticketmaster. But you've got a ton of people who are gonna buy tickets, not because they're gonna go see Taylor Swift, they're gonna buy them so that they can resell them at a profit, right? And so.\r\n\r\n\r\nTarek Arafat (04:00.388)\r\nTake a mask.\r\n\r\n\r\nExactly.\r\n\r\n\r\nTarek Arafat (04:14.212)\r\nIt's a great analogy.\r\n\r\n\r\nNikolas Hulewsky (04:15.65)\r\nAnd so obviously they're trying to do some controls. This is effectively that that's the problem that's kind of become with the open tables where you're making reservations is now people aren't necessarily making reservations to go eat dinner. They're looking at it as an arbitrage of like, I can make the reservation and then sell it and make money on Friday night.\r\n\r\n\r\nTarek Arafat (04:30.712)\r\nThat's correct. So they're basically weaponizing tech, They're weaponizing it to basically hit these sites like OpenTable Resi, snag these reservations, and then they're either selling them or, you know, I mean, it's become, I mean, dude, I could talk to you about this all day.\r\n\r\n\r\nNikolas Hulewsky (04:39.821)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (04:46.296)\r\nHow are they selling them? Tell me, like, I don't get it. How are they selling them? Like, are they just on Reddit and they're like, hey, I've got, I don't even know, Soho reservations at four o'clock. I don't even know if Soho's a restaurant. I think that's like a place in New York, because I'm a moron. Anyways, I've got reservations at the new spot in Soho. Does anybody want it? And then people on Reddit respond, like, where are they trading these?\r\n\r\n\r\nTarek Arafat (04:58.329)\r\nYeah.\r\n\r\n\r\nTarek Arafat (05:05.144)\r\nSo yeah, mean, it's so interesting. In New York particularly, there've actually been sites that have come up that were like, they're like black marketplaces, right?\r\n\r\n\r\nthey post the table and say, oh, yeah, you can buy this for, you know, three, $300, $400. And oftentimes, it's like demand based. So if they see that there's a lot of eyes on one restaurant, that that price will dynamically change. So obviously, increased price. And then, you know, like you said to Reddit, like, there are subreddits out there where, you know, these kinds of trades happen, cash in hand. It's really, really interesting. Yeah, but\r\n\r\n\r\nNikolas Hulewsky (05:35.96)\r\nDo you... A kid at Brown made $75,000 doing this?\r\n\r\n\r\nTarek Arafat (05:40.58)\r\nHe made $75,000. Yeah, and and I mean it was written about in the New Yorker last year actually this become such a big problem Nick this has actually become such a big problem that Like New York State has actually passed a law that it talks about like third-party Reservations and just like basically the distribution. Yeah, so I mean that that is I mean We were basically out here trying to solve that problem for people before this state had to actually get involved to try to curb a lot of what was happening\r\n\r\n\r\nNikolas Hulewsky (05:46.53)\r\nWhat?\r\n\r\n\r\nNikolas Hulewsky (05:59.501)\r\nNo way.\r\n\r\n\r\nTarek Arafat (06:12.194)\r\nAnd now they're doing the same thing in Florida because I think this is a problem in Miami. It's getting insane. Like it's getting really, really insane.\r\n\r\n\r\nNikolas Hulewsky (06:20.014)\r\nYou're blowing my mind. I didn't even know this was a problem. I had no idea it was a problem.\r\n\r\n\r\nTarek Arafat (06:23.972)\r\nIt's, man, it is crazy and I think...\r\n\r\n\r\nNikolas Hulewsky (06:26.83)\r\nThe state of New York passes legislation to say like, look, you can't resell your food reservations. Freaking nuts.\r\n\r\n\r\nTarek Arafat (06:34.06)\r\nYeah, so but like there's a problem to this right so like when that happens and and the reason we kind of so for everyone listening right it's like\r\n\r\n\r\nWhen you think of, you guys built a startup around reservations, you guys are probably snagging reservations and then distributing them at a fair price. No, that's not what we do. First and foremost, we wanted to leverage the foundation that was laid by Resy and Open Table and Seven Rooms and whomever, because so many restaurants rely on the data behind who you are as a diner. So when you guys book with Table 1, realistically what we're doing is we're pushing you back.\r\n\r\n\r\nto a resi and open table to book your table, right? Before, you know, any of these bad actors get there so that it's your profile that's being attributed to the table.\r\n\r\n\r\nNikolas Hulewsky (07:13.538)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nTarek Arafat (07:19.416)\r\nthen the restaurant is getting that data for them. Similarly, Resi and OpenTable now have actual actionable data to be able to utilize themselves. So it's kind of a win-win here, not only for the diner, right, who's now getting fair access back to these really high demand places, but also to the reservation platforms who then distribute the data inevitably to the restaurants.\r\n\r\n\r\nNikolas Hulewsky (07:42.39)\r\nIt feels like a really like super niche problem that it sounded like you were trying to solve it for yourself and it turned into a business, which is cool. I mentioned the numbers upfront to over $200,000 in annual recurring revenue at this point. How many signups have you had?\r\n\r\n\r\nTarek Arafat (07:59.268)\r\nSo since September of 2024, we had over, now it's coming up on 40,000 downloads, which is pretty crazy. It's just New York. I have to reiterate, it's just New York. Sorry, September of 2023 was the free model and we launched our paid model.\r\n\r\n\r\nNikolas Hulewsky (08:11.616)\r\nLess than a year, so less than a year you built this.\r\n\r\n\r\nNikolas Hulewsky (08:17.582)\r\nOh, 23, got it.\r\n\r\n\r\nTarek Arafat (08:20.292)\r\nin September of 2024. So yeah, it's been about eight, nine months of paid. We've just eclipsed 200K ARR. And like you said, man, like, you know, we built a really capital efficient business that we're super proud of. A lot of lot of insights I can give you, you know, in terms of that. But\r\n\r\n\r\nI think more or less like myself and my co-founder Frank, like that's really what we pride ourselves on is it's not about building the business. It's like how you're building the business. know, can you look at it and say like this is exactly, you're pinching every penny, you're turning every stone over to say like this is the best possible way to run this thing.\r\n\r\n\r\nNikolas Hulewsky (08:46.638)\r\nIt's here.\r\n\r\n\r\nNikolas Hulewsky (08:56.632)\r\nHow much are people paying you a month?\r\n\r\n\r\nTarek Arafat (08:58.852)\r\nSo originally we started out with $9 a month and we had a $59 a year annual plan. recently, just based on user behavior, we realized that the annual plan didn't actually make a lot of sense because New York is actually a really transient city. So what we decided to do is actually remove the annual plan and now we're just doing $15 a month across the board. So that way people can hop in and out, they can cancel at will and you know, they need a reservation.\r\n\r\n\r\nNikolas Hulewsky (09:20.706)\r\nInteresting.\r\n\r\n\r\nNikolas Hulewsky (09:24.354)\r\nSo like, how does it work exactly? Are you basically doing identity verification through you so that these restaurants understand like, okay, this isn't gonna be resold. It's John Smith who's booking or is it another way? Like I don't understand necessarily how it cuts out the bad actors.\r\n\r\n\r\nTarek Arafat (09:43.844)\r\nYeah, so mean, realistically, what it does is like, we're not the ones cutting out the bad actors, right? We're kind of trying to give normal people a way to compete in a sense, right? And I think that like, with the tech that we've built, it's not competing, it's winning. I think...\r\n\r\n\r\nNikolas Hulewsky (10:00.386)\r\nWell, what do I get for 15 bucks a month? Let me ask that another way.\r\n\r\n\r\nTarek Arafat (10:03.842)\r\nYeah, that's a good question. we basically have a totally crowd sourced list of the best restaurants in New York. And when we say the best restaurants, it's restaurants that people have said, hey, I've had a problem getting a reservation here. So number one, you're kind of getting an open live feed of all of these reservations kind of in real time, flying in and out, flying in and out. And then on top of that, you're also getting a notify system that is actually quicker than what you would get traditionally on resi, open table, whatever these other\r\n\r\n\r\nother platforms so that you're kind of first to the punch when a table drops. So you're kind of paying essentially for quicker access, if that makes sense.\r\n\r\n\r\nNikolas Hulewsky (10:38.392)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (10:44.098)\r\nSo if I'm already though somebody who has a bot that's going out and buying reservations for me and reselling them, or maybe I'm doing it manually, whatever, why wouldn't I just get a membership to your company, table one, because now, cool, I'll get notified earlier and I'll still be able to resell it. At least that's what I'm hearing. Why wouldn't they just join your app?\r\n\r\n\r\nTarek Arafat (11:02.86)\r\nYeah, yeah, this is where we've actually been working with OpenTable and Resi and really where we hope to deepen this relationship with them is, a lot of it is activity tracking, it's activity monitoring. You can sense when, and you can look in the data when behavior is really starting to change in a way that's like, this is being overused, you can flag that user behavior. Similar in a way that Resi and OpenTable tries to do it, it's a lot tougher.\r\n\r\n\r\nNikolas Hulewsky (11:25.731)\r\nHmm.\r\n\r\n\r\nTarek Arafat (11:30.308)\r\nYou know, when, when it is just when it's web traffic, because a web traffic, you know, it's, it's, it's hard to distinguish nowadays, especially with proxies and other things happening that like, you don't know if it's real human traffic. don't know if it is a human. So it's like, you're kind of betting on, okay, well, if they're moving a little bit too fast on my website, I'm just going to like, you know, block that IP. And sometimes it, what that ends up doing is it actually ends up icing out a real person who's just pretty quick with the keys to try to get a reservation, at least on our end.\r\n\r\n\r\nNikolas Hulewsky (11:51.106)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (11:59.182)\r\nThank\r\n\r\n\r\nTarek Arafat (12:00.284)\r\nAnd we're able to kind of monitor truly, it's like in-app, this is how they've used it before, this is who they're kind of going to dinner with and kind of build a dining profile that's a little bit more granular than maybe a Resier Open Table wheel.\r\n\r\n\r\nNikolas Hulewsky (12:12.6)\r\nHow do you have your margins at 99 %? Everybody's talking about AI. Is this built on AI, or is this just a layer that was very simple to create? 99 % margins, it's kind of nuts, right?\r\n\r\n\r\nTarek Arafat (12:26.744)\r\nNo. Honestly, I wish my co-founder was here to take his plaudits here for a second. Realistically, there's a lot of factors to what we do. It's the ability to identify this data in real time, which for a lot of the points is like that's what bots were doing, but it was doing it in a way that was...\r\n\r\n\r\nit could be caught by the securities and everything. And now what we were doing originally, I think I mentioned this to you, was we were scraping that data. that was great. And then we were able to do that in a way that was incredibly quick, but then also then to be able to distribute that via a notification or into an app.\r\n\r\n\r\nAnd to do that across, you know, hundreds of restaurants, that's really where the cost starts to compound. So that was really what we've spent the last two years optimizing. And then now it's gotten to the point where, you know, we're able to sit at the table with, you know, these, these platforms and say, Hey, like, you know, here's the real traffic that we've been driving to you guys. Like here's the benefit that we have. And that's also played a pretty big role, I guess, you know, in, cutting our costs there as well. you know, when we look at the grand scheme of things is 200 K or our business, like\r\n\r\n\r\nYeah, I mean, I'm proud to sit here and say like we're paying a few hundred bucks a month to monitor it. It wasn't always, but that's just because my co-founder is a beast who looked into every possible detail of how do we cut costs? We don't have funding. We don't have anything in the bank that's special. It's like you got to get creative and that's exactly what we did. Yeah.\r\n\r\n\r\nNikolas Hulewsky (13:43.544)\r\nto.\r\n\r\n\r\nNikolas Hulewsky (14:02.062)\r\nAll right, let's go back to the beginning. What were you doing at the time? How did you identify that this was a problem? What was your thought process and mentality back then?\r\n\r\n\r\nTarek Arafat (14:12.6)\r\nYeah.\r\n\r\n\r\nSo I actually realized that this was a problem back when I worked at American Express. And it's starting to become a problem when the credit cards, I think, made the move into reservation. like Amex bought Rezzi, Open Table has now done a deal with Visa. They also have the Sapphire Reserve thing going on right now. Seven Rooms actually just got bought by Dorda. I mean, there are a lot of big players that are making moves into this space. And I think at the time when I figured out it was a problem was when I moved up to New York. I moved up September of 2020.\r\n\r\n\r\nmiddle of COVID. So I followed a girl up here and it's working out. So knock wood for that. That was great. But you know, at time I didn't have a lot of friends around. my coworkers were like the ones who encouraged me to go and explore the New York dining scene. And that was really where I saw firsthand that, wow, like, why is this a problem? Why is it that when I set a notify on Rezzy, I'm not getting notified? Why is it that when I show up at 9 a.m. to try to get my tables, like everyone on Reddit is telling me I'm not getting my table? And\r\n\r\n\r\nNikolas Hulewsky (14:47.042)\r\nGreat time.\r\n\r\n\r\nTarek Arafat (15:14.022)\r\nAnd that's kind of took me down the rabbit hole of like, okay, this is a problem. And to be honest,\r\n\r\n\r\nNikolas Hulewsky (15:20.28)\r\nwere you doing? I'm sorry, finish that.\r\n\r\n\r\nTarek Arafat (15:22.988)\r\nNo, yeah, I was just gonna say, to be honest, I kind of forgot about it for a few years until my co-founder, my now co-founder, I hired him for another startup we were working on. And he just out of the kindness of his heart offered up this thing that sent him a text when availability became like when tables became open. And I got one of the amazing reservations in New York for my girlfriend for her birthday. And when I told her her face, I mean, it was like she just like melted. Right. It was like it was one of those like magic moments of like, what do you mean?\r\n\r\n\r\nthat you just got this thing. was like it truly was a magic trick. yeah, that's kind of where that's kind of where this like, this is a huge consumer problem.\r\n\r\n\r\nNikolas Hulewsky (16:03.064)\r\nWhat were you doing at American Express?\r\n\r\n\r\nTarek Arafat (16:05.218)\r\nI was a product manager, I was on the data team. So I was actually totally unrelated to the Resi side. I was just more curious because I come from a data background.\r\n\r\n\r\nNikolas Hulewsky (16:08.087)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (16:12.948)\r\nSo you're in your mid-20s working at American Express. Were you entrepreneurial? mean, it sounds like you had other startup ideas that you were working on. Did you always know you wanted to get into entrepreneurship?\r\n\r\n\r\nTarek Arafat (16:23.548)\r\nI always did. Yeah, my dad is an entrepreneur. So I kind of watched him from like the age of, you know, four years old. He started building his business out of our guest room. Right. And then that turned into the thing that kind of floated my family, you know, the rest of, you know, the rest of my childhood. And it was amazing because, know, on one hand, my mom is so, she's so by the book, right. In a lot of amazing ways. She's a nurse. She goes, she's worked at the same hospital now for 35 years. And\r\n\r\n\r\nNikolas Hulewsky (16:51.095)\r\nMm-hmm.\r\n\r\n\r\nTarek Arafat (16:53.124)\r\nAnd she shows me discipline in one way and then my dad was always the one that encouraged me like, hey, like, you know, if you really want to own your time and own your life, like, this is, you know, this is really how I've done it. And I was, mean, my friend. So he worked with, he worked with USAID. He was actually a subcontractor. So he was funding a lot of projects in the Middle East and North Africa, you know, things like providing laptops to schools and, and, you know, things like that. So.\r\n\r\n\r\nNikolas Hulewsky (17:04.897)\r\nWhat was his business?\r\n\r\n\r\nTarek Arafat (17:21.132)\r\nHe was, you know, he really loved his work. And so that was actually my my first job. was I was 14 years old. He had me on the phones asking for deals on laptop. And then at 16, I was his delivery driver. So kind of got thrust in, you know, and I think from there, I always knew it was and I had some high school stuff. Yeah. My dad's Jordanian. Yeah. Yeah. Yeah, my mom.\r\n\r\n\r\nNikolas Hulewsky (17:40.376)\r\nThen you're... You're dad, where's he from?\r\n\r\n\r\nJordanian immigrants, they get the job done.\r\n\r\n\r\nTarek Arafat (17:49.866)\r\nYeah, my mom is British, so.\r\n\r\n\r\nYou know, I think that that's awesome is like, you know, my parents, like they really just they didn't come from much. They were, you know, they came from very modest means. And for them, like getting here was awesome. And like they built an amazing life. And I guess like what was cool was, you know, I grew up in a part of the world where it's like, know, DC is awesome. Northern Virginia is fantastic. But it is a pressure cooker to it to a certain degree. And I watched a lot of my friends kind of get put under the microscope with a lot of a lot of different ways that they were like being raised. They were like, you know, you have to be in this sport and you have to be doing this.\r\n\r\n\r\nand have to be doing this extracurricular and you have to get this SAT and this and this. And it's just like, they were absolutely bombed with work to the point where I don't think that they were allowed to like think outside of what they really, they were kind of built to be these amazing worker bees. now it's like, my parents, they were just kind of happy when I was happy. I loved soccer, I loved tennis, I loved.\r\n\r\n\r\nNikolas Hulewsky (18:34.339)\r\nDo.\r\n\r\n\r\nTarek Arafat (18:43.3)\r\nI loved writing, so they really did everything in their power just to power those loves of mine. And then when I got to college, they were just like, dude, it's your world. You got here. You did it. You did everything we wanted you to do. Figure it out. And that was cool.\r\n\r\n\r\nNikolas Hulewsky (18:57.294)\r\nMy dad's an immigrant. He's full-blooded Ukrainian. He was born in Germany, but he was raised in Brazil. He was born in 1947, and his parents couldn't go back to the Ukraine. Long story. Anyways, he comes to the United States as a teenager, and then he goes to Vietnam when he's like 20. In his first 20 years, he's lived on, was that four different continents? Yeah, Europe, South America, North America, Asia.\r\n\r\n\r\nAs a kid, I didn't really understand him. I was like, I don't get it, dad. Why don't we have more money? Why are you okay with broken down Mercedes in the driveway? Because we'd always have a Mercedes, but it would be 15 years old and broken down. And as I got older, I just realized this dude grew up on dirt floors. So to be in the United States, this is high living. You know what I mean? Much to my chagrin. But for him, it's like, what's the problem? We have a car.\r\n\r\n\r\nWell, it works. It drives. goes to and from school. Who cares if it has different colored door, different color hood. Don't be such a sissy and Mickey Mouse. Come on. You know, he would be offended if I was offended, you know, and it like it. But it's just because we don't. I mean, you grew up here, right?\r\n\r\n\r\nTarek Arafat (20:09.572)\r\nof\r\n\r\n\r\nTarek Arafat (20:14.66)\r\nYeah, I did. grew up on that.\r\n\r\n\r\nNikolas Hulewsky (20:16.27)\r\nYeah, I mean, you're just a dumb kid. You don't have their perspective, right? You didn't see what it was like growing up overseas. You didn't see that they didn't have the same types of opportunities that we have here.\r\n\r\n\r\nTarek Arafat (20:24.18)\r\nIt's so funny you mentioned the car thing because to this day, my dad, like he will always try to fix his car before he lets anyone put his hands on it. So like he'll spend so much time and he'll like, you he'll figure it out. He'll watch the video. So do whatever he just it's just the mentality. Like, I don't know. He's he's always been so good with that stuff. So I totally resonate.\r\n\r\n\r\nNikolas Hulewsky (20:32.384)\r\nYeah\r\n\r\n\r\nNikolas Hulewsky (20:45.378)\r\nDo that. That is awesome. So when you when you were at AMEX and your co-founder approached you. Were you like, this is the idea or did you decide let's test it for a little bit like how did that kind of process work?\r\n\r\n\r\nTarek Arafat (20:58.456)\r\nYeah, so.\r\n\r\n\r\nthe crazy thing, I think this actually has a lot to do with why we built Table 1 the way that we did. when I kind of was at Amix and that was happening, I kind of just took it as like, so like this is, you know, essentially what I took away from it more or less is like, okay, the systems in place right now are, they're kind of credit card upsells, right? They tell you, you get priority access, and sometimes you do, and then sometimes you don't, most of the time you don't. And then, so I kind of walked away and I was like, okay, then that's just how it is. And I,\r\n\r\n\r\nI went about my life for two years. actually started a...\r\n\r\n\r\nI went to another company and moved to a company called Yext, which was an amazing three years there. But I actually was building another startup at the time. That's actually how I met my my co-founder. And the funny thing about that is I think we did everything right, but build the product, you know, so like you get you build the perfect pitch deck. You hire like five of your buddies. You give them all like 20 percent equity each. You know, you have a Figma demo that's on YouTube. You get a Y.C. interview. But like and then you try to\r\n\r\n\r\nget like a really killer advisor on the advisory board. But like, you know, when it all push came to shove, like, there's no product, there's no traction, there's really no momentum. And when I met my co founder, the number one thing that stood out to me about him is we met at a birthday party on a Saturday, I'll let you, you know, kind of determine or figure out how many margaritas between the two of us we had over a few hour period there. But he basically at the end of that conversation said, you know what, dude, I love your idea, I want to come and work with\r\n\r\n\r\nTarek Arafat (22:33.798)\r\nyou. And I said, All right, guy, I just met like an hour ago. Like, let's, let's see.\r\n\r\n\r\nSure, maybe we have a meeting on Thursday. You know, does that sound good to you? He's like, great. And I honestly left that birthday party thinking, well, that was fun. I'm never going to hear from that guy again. And then the next day he texted me and he said, still good for Thursday. I was like, yep. And then he shows up on Thursday. And I'm not even kidding you, Nick. He had found our video, our Figma demo on YouTube and then using screenshots that he had taken from our YouTube video, he built our entire app in four days.\r\n\r\n\r\nAnd this is pre vibe. This is precursor. This is pre-clawed. This is pre everything. This is just dude who was on a mission, self-taught programmer. He wanted to make a statement with this new team. He wanted to show them that he could provide value. And we had a working prototype just because he decided four days prior that he wanted to come in and impress it at what he now calls his interview. So that was that\r\n\r\n\r\nNikolas Hulewsky (23:12.462)\r\nWhoa.\r\n\r\n\r\nNikolas Hulewsky (23:33.762)\r\nHis interview was like, okay, I built the product.\r\n\r\n\r\nTarek Arafat (23:36.6)\r\nThat was step one. literally. yeah, I know it was was pretty crazy. And so like to your point about, well, when did this happen? It's like, you know, him and I were the only two New York based co-founders. you know, the startup after a while, if you are building it the way that I mentioned before, where you're trying to go for the interview and you're trying to go for the press, you're trying to go for everything, it loses steam eventually. So naturally, what happened was my girlfriend's birthday came up. I told you about the moment that, you know, we got the reservation. And honestly, him and I\r\n\r\n\r\nNikolas Hulewsky (23:38.83)\r\nDude.\r\n\r\n\r\nTarek Arafat (24:06.604)\r\njust wanted to deploy something for fun. We were just like, let's get this up on a website. Let's just get people using it. Let's do the opposite, right? Like let's do the opposite of everything we've just been doing. And we put it on Reddit and we put it on Instagram and it kind of just started to move. That was really the moment.\r\n\r\n\r\nNikolas Hulewsky (24:25.934)\r\nOkay, all right, so there's a lot of people listening who maybe they're in your situation or they want to be in your situation where they're like, I'm working full time and I I wish I had an idea for an app or a co-founder or they've launched that side hustle, quote unquote. And they're like trying to figure out, is this working? Is this not working? So my question is a two-part question. The first part is, when did you know it was working? And how did you know?\r\n\r\n\r\nAnd then the second part of the question is, when did you quit your job? Or do you still have a job?\r\n\r\n\r\nTarek Arafat (24:57.1)\r\nYeah, that's yeah. No, I don't. I don't have a job. Thank God. But yeah, so great question. So I think the amazing thing about this was we really never intended it and intended for it to be this big company like there this this thing that could be a big company, right? We really shipped it for the love of the game, right? We were just like two people that just really wanted\r\n\r\n\r\nNikolas Hulewsky (25:02.058)\r\nspoiler alert. Okay.\r\n\r\n\r\nTarek Arafat (25:23.81)\r\npeople to use our stuff and we really wanted to solve our own problems to your point, right? This was a personal problem for both him and I. And so we kind of started to see it kind of snowball a little bit and the beautiful thing about dining is there's like an inherent network effect to it. So like if I get a reservation for four, typically the first thing that happened was the other three people at the table asked me, well, how did you get it? And so we started to kind of spiral. think like,\r\n\r\n\r\nNikolas Hulewsky (25:29.71)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (25:45.464)\r\nRight.\r\n\r\n\r\nTarek Arafat (25:49.058)\r\nI think for me, when I really felt it, was starting to work, was when my DMs on Instagram started filling up with like, dude, this is insane. This is awesome. We think we were about 500 people. And you could feel the magnetism of like, my God, people are using this thing that I built. then now,\r\n\r\n\r\nNikolas Hulewsky (26:09.902)\r\nOkay, so you launched September, 2023. When did you start getting those DMs?\r\n\r\n\r\nTarek Arafat (26:13.666)\r\nsoon.\r\n\r\n\r\nYeah, so I guess like, to back it up, right. So we launched a beta on on a website in March of 2023. And then that's why what I meant is like, this wasn't supposed to be a big thing. literally just like, let's create a website. And if people use it, great. If people don't, no big deal.\r\n\r\n\r\nAnd so that was March of 2023. I started getting the DMs first week of April of 2023. Yeah, it happened. It happened really, really fast. And people were like, this is insane. Like, I want this feature. I want this restaurant. Like, I think like, there's so much there's so much great advice out there. if there's one thing that I loved was that, like, you know, keep your product super simple, because then your users will tell you everything else that they need. And that's exactly what happened. So my DM started filling up with like, people who are just asking for a wait, what if we could do this? And what\r\n\r\n\r\nNikolas Hulewsky (26:39.886)\r\nwow, really quick.\r\n\r\n\r\nNikolas Hulewsky (26:56.77)\r\nMm-hmm.\r\n\r\n\r\nTarek Arafat (27:03.462)\r\nif I could select multiple party sizes and what if we could add this restaurant? And it was infectious, It made me double the time I spent on it simply because I just loved responding to that feedback and I loved giving it back.\r\n\r\n\r\nNikolas Hulewsky (27:16.878)\r\nSo when did you get to 100 people using your product?\r\n\r\n\r\nTarek Arafat (27:20.964)\r\npretty much by the second day, I think. It really, was insane.\r\n\r\n\r\nNikolas Hulewsky (27:24.931)\r\nWhat?\r\n\r\n\r\nNikolas Hulewsky (27:28.674)\r\nWait, how? How did you get 100 people to sign up with no, like, were you running much paid ads?\r\n\r\n\r\nTarek Arafat (27:32.908)\r\nYeah, no, I mean, we literally paid an influencer like...\r\n\r\n\r\nI think it was $100 to put us on our story. And then we got like 41 people from that. And then honestly, that was the only paid ad we ran for the longest time. And then because those 41 people started using it, then their friends started using it. And then my friends started using it, whose other friends started using it. then, yeah, before you know, we had 100 people, had 300 people, 500 people. And then by week three, we had a thousand people. It was crazy.\r\n\r\n\r\nNikolas Hulewsky (27:39.831)\r\nNo way.\r\n\r\n\r\nNikolas Hulewsky (28:03.79)\r\nWait, by week three you had a thousand people?\r\n\r\n\r\nTarek Arafat (28:06.018)\r\nYeah, totally organic.\r\n\r\n\r\nNikolas Hulewsky (28:08.398)\r\nTotally organic. Just network effects. Friends of friends of friends. What's your churn like?\r\n\r\n\r\nTarek Arafat (28:10.914)\r\nNetworkify. That's why I, well, the thing is, is that when you're a free product, right, it's like you're not really focused on. So honestly, I can't even tell you, all I know is that like the growth rate spoke for itself, right? And the funny thing was is that,\r\n\r\n\r\nNikolas Hulewsky (28:19.918)\r\nYeah, true, yeah.\r\n\r\n\r\nTarek Arafat (28:31.78)\r\nat that time, you know, now obviously, we're a fully fledged app, we send push notifications and push notifications are free. But at the time, we were sending text messages. So I think by like week three, to the point where we had 1000 people on it, we were sending like 27,000 text messages a day. And we were like, dude, if we keep growing at this rate, I think a text message is like a cent per text, we're not gonna be able to afford our own our own business. We basically, we shut it down. Yeah, we shut down.\r\n\r\n\r\nNikolas Hulewsky (28:51.584)\r\nYeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (28:55.704)\r\nK so\r\n\r\n\r\nWhat? You shut down the app?\r\n\r\n\r\nTarek Arafat (29:00.388)\r\nwe shut it down. literally started getting so expensive to send text messages. It was the craziest actually looking back on it. I can't believe we did this. Like we fully just sent out a message that said, Hey guys, we're going to shut this down. We're going to try to build make this an app and then we'll let you know. And so we went two months just radio silent. And then we launched our app in test flight because we wanted to like, you know, test it out. And I don't know if you've ever used it test flight app, but it's like, you need like three steps just to get into the app. You need like\r\n\r\n\r\nNikolas Hulewsky (29:17.922)\r\nNo freaking way.\r\n\r\n\r\nTarek Arafat (29:30.342)\r\napplication code, that stuff. And then we launched that on June 17th of 2023. By August, we had 2,200 people using the test flight version of the app, which is the demand, right? It's like, honestly, I don't even think I realized how big the problem was until I started, you know, kind of seeing those numbers.\r\n\r\n\r\nNikolas Hulewsky (29:41.848)\r\nSo.\r\n\r\n\r\nNikolas Hulewsky (29:50.766)\r\nThat's it, so you shut it down. You're like, look, we can't even afford to these text messages out.\r\n\r\n\r\nTarek Arafat (29:54.948)\r\nYeah, I mean it was was crazy man\r\n\r\n\r\nNikolas Hulewsky (29:58.582)\r\nAlright, March you launch, you're working at Amex. Within a month, you're like, this is too big, let's shut it down. And then you relaunch and test flight in June, and by August, over 2,000 people are using it. At what point in there were you like, holy crap, this is it, I'm quitting my job. Did you, or was it later?\r\n\r\n\r\nTarek Arafat (30:19.554)\r\nman, wanted to quit my job so early. I mean, I think that like, there's a difference between being excited, right? And then there's a difference between like being pulled. So I think like in August, we were really excited about the traction, but it wasn't enough. I'm honest with you, it wasn't enough for me to leave my job. And I knew it. Like I wanted to quit, but I knew it. And I needed the paycheck, right? It's like, I actually think that keeping my job, like,\r\n\r\n\r\nNikolas Hulewsky (30:34.264)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (30:45.389)\r\nYeah.\r\n\r\n\r\nTarek Arafat (30:48.32)\r\nhelped me make more sane decisions. It helped me\r\n\r\n\r\nbe a little bit more creative. It kind of gave me that like mental clarity of just like, I'm not worried about money. So I'm not operating from a point of fear. I'm operating from a point of true strategy. Like, yeah, I want my messaging sound like this. I want to work with this person or we should design the app this way. And I think that like so many people are like, when you build a startup, you have to quit your job because you have to only focus on that. And I disagree. Like I have an ADD brain. So like for me, actually having a job was\r\n\r\n\r\nkind of therapeutic at times. Like whenever I was able to dive back into building Tableau dashboards for the C-suite at Yaks, like, you know, it was, it was kind of like, you know, you get frustrated with what you're building and you're like, okay, I'm just gonna like focus on this other stuff for a little bit. And then you come back to it and then you have a new perspective. And then it's, it really helped the growth. And obviously the money was good too to keep us, to keep us afloat.\r\n\r\n\r\nNikolas Hulewsky (31:28.022)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (31:42.734)\r\nSo, okay, so I've talked to a few people and they've told me like, you've got to hear this crazy story. So a tons going on, you've launched, you shut it down, relaunch, test flight, et cetera. You're balancing like, do I quit my job? You're working on the side. Apparently that's not the craziest part of this whole story. tell me, tell me when it gets crazy. All right, let's get to the crazy.\r\n\r\n\r\nTarek Arafat (32:07.148)\r\nI saw it. I didn't get in there. Not even getting.\r\n\r\n\r\nNikolas Hulewsky (32:12.664)\r\npart of this thing.\r\n\r\n\r\nTarek Arafat (32:13.444)\r\nOkay. Yeah. All right. The crazy, the crazy thing is all fast forward, right? So once the app store, I'd say like by December, we had about 5,000 people using the app at that point. Again, purely organic, like really, it was crazy to us. Like, I mean, and then I think the crazy thing was in March of 2024,\r\n\r\n\r\nWe get a DM from this guy at the New Yorker and he's like, Hey guys, like I want to, I want to, I want to, I want to talk to you guys about like what you're doing in the reservation space. And we were like, us too, the dudes who just launched their Reddit app. sure, man, like that sounds good. And what was crazy about that is a month and a half later, you know, in the same week,\r\n\r\n\r\nwe were in the New Yorker. And then that New Yorker article became the number one most read article of I think it was the previous year for the New Yorker. was a glow. was a global thing. was getting it. I was getting sent. My aunts were sending me the link on Facebook. Do you know that you're in this? And I was like, what was crazy, though? This is the other is the hilarious thing. This guy fully the interviewer, Adam, this guy's awesome. I think he fully came and was like truly writing a piece about like\r\n\r\n\r\nNikolas Hulewsky (33:16.728)\r\nShut up.\r\n\r\n\r\nTarek Arafat (33:31.158)\r\nhow, you know, kind of destructive the reservation space becomes. He wanted dirt on on all of the platforms. He wanted to talk. He wanted to talk a lot of crap. And, and when he met us, and he just heard our story exactly what I just told you, he's like,\r\n\r\n\r\nNikolas Hulewsky (33:38.894)\r\nMm-hmm.\r\n\r\n\r\nTarek Arafat (33:46.85)\r\ndamn, I'm rooting for you guys. This is awesome. and the one neutral line I would say in that whole article is just us. It just talks about what we do. It doesn't say anything bad. doesn't say anything. And we got like, I'm not even kidding you, Nick, overnight, 3000, 3000 plus downloads, then the then another publication hit us up called Gothamist, because one of the reporters said that we were we had almost helped her get into like, Tatiana, is like a big restaurant. And she was like, you guys are the closest\r\n\r\n\r\nNikolas Hulewsky (34:15.821)\r\nor\r\n\r\n\r\nTarek Arafat (34:16.8)\r\nthing I've come to actually getting in and I actually think I'm going to get a reservation. And then the last thing then, because of all this press, our emails got flooded with VCs who are like, you know, we need to talk to you guys now. one Friday that that same week on Friday, I think we had like six or seven VC meetings by 2pm. And we were like hopping around places in Manhattan. This is April of 2024.\r\n\r\n\r\nNikolas Hulewsky (34:36.64)\r\nWhat? Okay, so when was this? When was this?\r\n\r\n\r\nOkay, so this is before you even launched the paid version.\r\n\r\n\r\nTarek Arafat (34:44.418)\r\nYeah, yeah, it's just we're still free. We're still we're still just you guys in the nap.\r\n\r\n\r\nNikolas Hulewsky (34:46.518)\r\nOkay, so I know you're not paying for text messages, but there's still gonna be some costs associated. So how are you funding the app at this time?\r\n\r\n\r\nTarek Arafat (34:53.762)\r\nYeah, so mean, this is where the optimization point that I told you about, Like we had gotten kind of Frank had gotten really good at what he was doing. Like this is he kind of gotten our, you know, our costs down to like a very nominal amount, like in terms of kind of near where we are now, like, you know, maybe a little bit more. So for us, it was like, great, we still had our jobs. And that was it. But, you know, I left my job in March.\r\n\r\n\r\nNikolas Hulewsky (34:57.101)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (35:19.352)\r\nBut still, it's costing a grand a month, let's call it. Okay? Who's paying for that? You're just on your credit card or what?\r\n\r\n\r\nTarek Arafat (35:22.084)\r\nYeah, like, you know, it's like, you 800 bucks. Yeah, we're splitting it. We're literally then I was literally Venmoing him like half of it. It was that was it.\r\n\r\n\r\nNikolas Hulewsky (35:31.49)\r\nJust because you were so stoked, you're like, dude, it's growing. This is awesome. Like, yeah, let's keep putting money into this.\r\n\r\n\r\nTarek Arafat (35:35.556)\r\nI mean like because I wanted this to be the full-time gig and I think he did.\r\n\r\n\r\nNikolas Hulewsky (35:39.446)\r\nAnd how many, before the New Yorker article came out, how many people were downloading it and using it?\r\n\r\n\r\nTarek Arafat (35:45.636)\r\nI think at that point, like talking February, March, we're talking like 7,000, 6,000, 6,500, 7,000. Yeah.\r\n\r\n\r\nNikolas Hulewsky (35:53.366)\r\nOkay. Okay. Let's fast forward a month after the New Yorker article comes out. How many people are using it?\r\n\r\n\r\nTarek Arafat (35:57.636)\r\nYeah. Oh, man. At that point, 21,000. Yeah. 3x. Yeah.\r\n\r\n\r\nNikolas Hulewsky (36:05.022)\r\n3X. it's, it's, it's dude. I talk about this all the time and there's a saying in venture first time founders focus on products. Second time founders focus on distribution. Distribution is just incredibly important. Most of these companies, when they go and raise money from venture capital, half of those dollars go to Google and Facebook.\r\n\r\n\r\nto acquire customers because they're running paid ads and they're trying to acquire customers. And that's why it's always, hey, what's your CAC? what's your LTV? your LTV to CAC ratio and your ROAS. And that's why those metrics are so important because you have to have customers in order to have a product. So distribution is incredibly valuable. like I just looked it up, 1.3 million paid subscribers to the New Yorker, 21 million monthly readers because they have an online presence as well. So just randomly, you get this New Yorker columnist who reaches out to you.\r\n\r\n\r\nTarek Arafat (36:51.086)\r\nstroke of luck. Total luck.\r\n\r\n\r\nNikolas Hulewsky (36:52.918)\r\nwrites about it, throws you in there, boom, you're on the fast train, man.\r\n\r\n\r\nTarek Arafat (36:55.98)\r\novernight. The crazy dude, Nick, the crazy thing, right, is like, we're still two dudes with an app. The way that this article talked about us was like we were one of the one we're one of the big companies, right? It's like, it had as the literally listed, it was like Rezzi Open Table. I don't know if you're familiar with the company called Dorsia. it had I mean, it was it was crazy. Like\r\n\r\n\r\nNikolas Hulewsky (37:07.531)\r\nHahaha\r\n\r\n\r\nTarek Arafat (37:17.604)\r\nYou know, here you're in you're in an article with multi billion dollar global, you know, like platforms and then you also have new startups that just raised, you know, I think even plus million. It's like you have two guys who just built a literally a thing and launched it on Reddit. I mean, it was insane.\r\n\r\n\r\nNikolas Hulewsky (37:28.642)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (37:34.766)\r\nSo when you went from 6,000 to 21,000, did anything break?\r\n\r\n\r\nTarek Arafat (37:41.592)\r\nyeah. yeah. mean, like we...\r\n\r\n\r\nNikolas Hulewsky (37:43.138)\r\nHow, was there any moments where you're like, I've screwed this up? Great, it's over. Like we screwed ourselves.\r\n\r\n\r\nTarek Arafat (37:48.036)\r\nAll the time. If you don't have those moments, then I don't think that you're really out there. thought we were like, I mean, there were so many times we were dead because, I mean, lot of our stuff is broadcasting reservation inventory, right? So you're able to go and cross check that on Resi and it's sitting in Resi, but it's not sitting in your app. And then your app just goes blank because your connection broke for a second. I mean, like,\r\n\r\n\r\nNikolas Hulewsky (38:03.437)\r\nYeah.\r\n\r\n\r\nTarek Arafat (38:16.92)\r\nWe were dealing with that a lot. It was a fire that we were constantly putting out just because of the sheer usage of the product. mean, it was insane. It really was.\r\n\r\n\r\nNikolas Hulewsky (38:22.264)\r\nPaul, you know, well, dude, I have to tell you this story. So Chris Kerner is one of my best friends and we're not one of my best friends. He's my best friend, known for 20 years, business partners. And years ago, this is probably close to 10 years ago at this point, he was deep into crypto, deep into crypto, big believer. And he still is a big believer in crypto. And he reaches out. He reaches out to this guy named John McAfee. You know who John McAfee is? Okay. So John McAfee was.\r\n\r\n\r\nTarek Arafat (38:42.596)\r\nIt's hard enough.\r\n\r\n\r\nTarek Arafat (38:47.16)\r\nDo no job, actually, yeah.\r\n\r\n\r\nNikolas Hulewsky (38:50.708)\r\nHuge if anyone doesn't know who John McAfee is, if you have antivirus software, it's most likely McAfee. He's the that invented that. But then he became a big Bitcoin believer. And Chris had figured out this algorithm basically that took underutilized data sources and projected which coins were going to take off. Basically, he went to Reddit and some of these other sites and Twitter. And based on the sentiment, he was able to predict accurately which coins were going to take off.\r\n\r\n\r\nSo he DMS John McAfee. It's a great story. I won't get into all of it. Long and short of it is he and McAfee ended up partnering and they ended up launching this as a service. It was called no BS crypto. And what it was is basically, Hey, you have access to this group and we sell tips and that's like the very short version of it. But anyways, on the day of launch, McAfee had over a million followers on Twitter and probably a couple of million across platforms. They've launched this thing.\r\n\r\n\r\nIt's getting massive traction. Hundreds of thousands of people within an hour have already seen the tweet and it's pointing them to a Discord channel. And so they're going to the Discord channel and Chris realizes, holy crap, I messed up the permissions on this Discord channel. Everybody has admin rights. And so really quickly, people had taken it over and were just changing a bunch of stuff. Chris got kicked out and he was like, John, gotta take down that tweet and retweet.\r\n\r\n\r\nAnd John's like, no, I don't, I don't ever delete any of my tweets, Chris. He's like, no, John, I don't think you understand. Like I screwed this up. And anyways, for years, we've talked about that experience. Cause that was a moment where he was like super high, holy crap. This is amazing. This incredible to super low. Cause he's like, I just F'd all this up. All that goodwill that we just built up that the amazing launch that we just executed. I F'd up because my backend sucked. So\r\n\r\n\r\nI always think of that story when something goes really right, because any time something goes really right, a lot of other things are going to go really wrong. And it's all about how you manage through that process.\r\n\r\n\r\nTarek Arafat (40:52.568)\r\nYeah, and you don't want to see like, I mean, Frank and I have felt this and I think like.\r\n\r\n\r\nThe one thing I will say is like, you the system that Frank built, considering that it really was just that, you know, it was him. It was a one man army. like for him to be able to build a system that not only did what it was doing to provide the product, but then also handle the traffic that was coming in. Like, I mean, it was insane to watch him just kind of go into this overdrive point and he killed it. He crushed it. And we were getting all of this, this traction and,\r\n\r\n\r\npeople were loving it and it started just to really kick off. think by the end of, you know, by the end of that summer, I want to say like July, you know, we closing in on 30,000 people just because again, it was just keep going and we're talking it's just New York and dining is hard. Dining is hard.\r\n\r\n\r\nNikolas Hulewsky (41:41.742)\r\nCheers.\r\n\r\n\r\nI know, well that's what's crazy is it is just one market and you still have never to this day run paid ads. It's still only ever been organic.\r\n\r\n\r\nTarek Arafat (41:49.048)\r\nYeah.\r\n\r\n\r\nI mean, so this is the video and I can talk about.\r\n\r\n\r\nthe raise that we had just done. And that was the whole point of really kind of using that capital. And we have someone on who's kind of really helping with social strategy and she's fantastic. But like, I never ran paid out. Like, you ran some here and there just to test it. But like, as far as like consistently committing to, you know, let's say a strategy and all this stuff, Frank and I were never the guys that were gonna be able to run social. Like we just, we did not feel comfortable in that realm. We did not.\r\n\r\n\r\nNikolas Hulewsky (41:58.339)\r\nYeah.\r\n\r\n\r\nTarek Arafat (42:22.872)\r\nreally know messaging and all that stuff. So to be honest with you, we kind of stuck to our strengths and our strengths in this case with product.\r\n\r\n\r\nNikolas Hulewsky (42:31.886)\r\nAll right, let me ask you this. You've gone to the paid model. It just sounds like you're, obviously you're not growing at 18,000 a month, but you're still growing at a good clip. Where do you think table one is a year from now?\r\n\r\n\r\nTarek Arafat (42:46.724)\r\nYeah, it's a great question. So I think realistically, you know.\r\n\r\n\r\nIt's just so crazy to me because I think we've opened up kind of the eyes of a lot of people in this space. So I think that like right now, when people think table one, they think of the B2C product, right? They think of the app. They think it's like, oh yeah, it's a consumer subscription. That's great. There's so much more to this business. Like there's a B2B angle here where we're actually selling in the sales teams and investment managers and...\r\n\r\n\r\nbecause they need it for their clients. know, there's a world here where we're selling it into hotel concierges because they're approaching us for their own clientele. And then there's a world here where like, you know, the system that Frank has spun up, it's white labelable. So there are companies that have approached us to like spin up their own reservation world because the movement right now for a lot of, you know, corporate travel or, you know, anything kind of related to experiences, it's all about consolidation.\r\n\r\n\r\nSo for them, being able to have that on hand to connect, let's say, travel to dining and ironing out a whole night and a whole weekend is huge. And I think we're just scratching the surface as to what this thing is truly capable of. That's before we're even talking about the expansion into other cities for the B2C app.\r\n\r\n\r\nIt's a crazy, crazy time to be frank.\r\n\r\n\r\nNikolas Hulewsky (44:18.508)\r\nLet me ask you this. think there's two things that are kind of competing here. I think if somebody's listening to this, on the one hand, they're thinking like, well, must be nice to find a founder who could just build the app really quickly and partner with you. Must be nice to just randomly get featured in the New Yorker and then have your growth accelerated. But at the same time, I'm a huge believer that you can increase the surface area of your luck.\r\n\r\n\r\nTarek Arafat (44:39.107)\r\nfair.\r\n\r\n\r\nNikolas Hulewsky (44:47.298)\r\nWhether it's through networking or hard work or just iterating and trying a bunch of things. And what I would say that the counter to these is that at the same time, you didn't go the traditional route. You didn't raise money. You were a bootstrapped tech founder. You did it in a very non-traditional way. So yes, the exact things that you did where you got lucky are not necessarily replicable. However, I think the way that you approached it in bootstrapping it could be replicable. So if you're talking to that person who's listening.\r\n\r\n\r\nWhat advice would you give them or even what advice would you give yourself five years ago when you were starting out this process to help them get started or to help them feel confident and like, I could do this. I could could figure out how to do this. What do they need to look out for? What advice would you give yourself?\r\n\r\n\r\nTarek Arafat (45:33.796)\r\nI mean honestly like the number one thing the number one value I'd say that like Frank and I have Right and what we look for and people that we work with it's not where you went to school It's not what you've kind of what portfolio what your portfolio is telling you said it's not what your Twitter looks like It's not anything the number one thing is are you are you gonna show up like every single day and there are like\r\n\r\n\r\nThere are tangible qualities that you see in a person when you talk to them. It's like, what's their energy? How are they asking questions? Is it empathetic? When they talk about working with you, is it really from a point of a we, or is it a point of coming from a point of self-interest? And I think that the only thing that made Frank and I a good team\r\n\r\n\r\nNikolas Hulewsky (46:01.39)\r\nMm-hmm.\r\n\r\n\r\nTarek Arafat (46:19.234)\r\nwasn't because like, yeah, I mean, he's an insane engineer, but we had to learn, right? It's like, he had never built an app before table one. I had never designed an app before table one. I had never raised money before table one. And you know, I think that like, as long as we showed up every single day and committed to each other and said, Yeah, man, like, I don't know how to do this, but I'm gonna figure it out. Like, that's that was the only thing that we needed. And we were able to through walls because of that.\r\n\r\n\r\nNikolas Hulewsky (46:27.374)\r\nSure.\r\n\r\n\r\nNikolas Hulewsky (46:44.376)\r\ngrit.\r\n\r\n\r\nNikolas Hulewsky (46:47.96)\r\nDude, I mean, what about, okay, what about any other advice you would give you? You're like, man, if I could do it over again, I'd do this different.\r\n\r\n\r\nTarek Arafat (46:55.362)\r\nYeah, think a lot of people seek comfort in this journey, and that is totally OK. I think that when you think about\r\n\r\n\r\nwhat makes the road less scary. It's sometimes finding people that unlock you and can, they kind of cover your blind spots in a lot of ways, right? And people do this in the sense of like, oh, but I can bring on my friend who's in X sales and he can start to do partnerships and I can bring on this person to do the design of the app and I can bring on.\r\n\r\n\r\ndo it yourself. You have to try because if you are not at least trying and failing, then you don't care enough personally. And I think that like I did that in my first startup where I tried to outsource everything I and to the point Nick genuinely where I'm not even sure what my job was anymore. Like I had somebody come on and these are amazing people. They're amazingly talented people.\r\n\r\n\r\nlike someone for design, someone to do partnerships, someone to do obviously the tech. And then it's just like, there's me and I'm sitting here and I'm not doing product. I'm not doing engineering. I'm not doing business, like the business development side of it. I'm not doing marketing because I already told you that I'm not great at that. So realistically, like what am I doing? And I've kind of just talked my way and sold my own equity out of a job. And so I'd say like that is first and foremost, to anyone else, if I could tell myself something\r\n\r\n\r\nonly five years ago it's that. It is 100 % that. Just try everything. Have to do it.\r\n\r\n\r\nNikolas Hulewsky (48:27.438)\r\nI think that's a really good piece of advice as well. mean, a lot of people want to talk about in Silicon Valley now, like founder mode. However, you do need to know what your business is. If you are outsourcing everything, then you have no core competency. There has to be something that's special about you or at least you're in the weeds on if you think that your business is going to be successful. I love that advice. think that's fantastic advice. Where do you hang out? Where's the best place for people to come find you?\r\n\r\n\r\nYouTube, Twitter, LinkedIn.\r\n\r\n\r\nTarek Arafat (48:58.05)\r\nYeah, I just got on Twitter because, you know, I basically was smoldered was bad for business to not be on Twitter. So now I'm on Twitter. I'm talking about I'm talking about everything I'm talking about here. I love LinkedIn. I you know, honestly, LinkedIn gets a horrible rap. But I love it because of just, I really do believe that there are a lot of people there that are like trying to learn and they want to share in a lot of ways, right? It's like\r\n\r\n\r\nNikolas Hulewsky (49:03.586)\r\nWelcome.\r\n\r\n\r\nNikolas Hulewsky (49:22.648)\r\nSure.\r\n\r\n\r\nTarek Arafat (49:25.334)\r\nI hate some of the AI cringe content that I see, but I think that in a way you're almost standing out more if you go on there and you start to try to share genuine content, because I think people can read it. So those are the two places that I hang out. And we have Table 1 on Instagram.\r\n\r\n\r\nNikolas Hulewsky (49:41.838)\r\nIt seems like somebody who's benefited so much from organic reach, would just be all over the socials.\r\n\r\n\r\nTarek Arafat (49:48.132)\r\nI had to, right? It's like, and this is the last crazy story I'll tell you. And it really was how we raised the money. So I think like, you know, we had all this traction, we were in all these articles, you know, we had everything right now, I told you, like we're running the business efficiently.\r\n\r\n\r\nno VC was really, they basically told us like, guys, we love you. We love you, we love the product, we love the traction. We just can't get to conviction on the size of the problem. you know, the right now consumer is very not in vogue. And that was really the last domino that we could never tip over. what did I do? I dove into the world of AI, I went on lovable and I spun up what I'd call like an investment portal, right? And I basically said, you know what, screw it. I'm tired of going\r\n\r\n\r\nNikolas Hulewsky (50:13.838)\r\nMmm.\r\n\r\n\r\nTarek Arafat (50:33.702)\r\nthese people who don't understand the business who don't understand how hard we work to do this, like what it really is. So I basically just blasted all of our metrics up on a page. And I made it this really lovely, beautiful thing. said, Hey, this is table one. Here's a video about us. Here's all of our metrics. Here's our growth. And then by the way, if we were to raise the money, here is a roadmap as to how exactly we're going to execute. And I shipped it. And then I put it on Reddit. Yeah, it's live. And I'm gonna send\r\n\r\n\r\nNikolas Hulewsky (50:59.982)\r\nIs this live still? Is it still live? Where is it?\r\n\r\n\r\nTarek Arafat (51:03.672)\r\nto it's if you type in invest table one app it is this is the page so I shipped that in I'm not even kidding you it took me two days to put together I put it on reddit I put it on LinkedIn and within you know within about what three days I think we had over $600,000 of investment interest from users from people that have followed the journey of table one from my friends\r\n\r\n\r\nYeah, here it is. And you scroll down. Yeah, if you scroll this is\r\n\r\n\r\nNikolas Hulewsky (51:32.408)\r\nDude, this is it, okay. Invest.tableone.app. So I'm looking here, first of all, looks fantastic. You built this?\r\n\r\n\r\nTarek Arafat (51:38.378)\r\nAnd yeah, I built it. Yeah. So the design, everything, and there's our metrics. There's the story. And this was, yeah, this was back in, I think, April.\r\n\r\n\r\nNikolas Hulewsky (51:44.302)\r\nstuff. Okay, let's see our metrics here.\r\n\r\n\r\nNikolas Hulewsky (51:51.975)\r\nso this was almost a year ago. you're.\r\n\r\n\r\nTarek Arafat (51:53.506)\r\nNo, no, this is is this is April of this year.\r\n\r\n\r\nNikolas Hulewsky (51:55.886)\r\nOh, dang. Okay, so you've already added 70 grand, 60 grand of ARR. Sheesh. Okay. $514 a month in operating expenses. Holy Moses. 2000 active paying members. What does that translate to? That's $30,000.\r\n\r\n\r\nTarek Arafat (52:01.196)\r\nYeah, was a good quarter.\r\n\r\n\r\nTarek Arafat (52:16.344)\r\nWell, was back when we had our $9 a month in our plan of 49. Yeah, it was different.\r\n\r\n\r\nNikolas Hulewsky (52:19.946)\r\nGot it. Okay. Paid user retention, 89%. Dude, why didn't we look at this earlier? I'm like over here trying to wrap this interview. Son of perdition. Okay. Paid user retention, 89%. Industry benchmark, 40%. Dude, this is so clean. This is perfect. This is like...\r\n\r\n\r\nTarek Arafat (52:39.054)\r\nThose are the A16Z benchmarks, right? So like we went into pitch, we went into pitch meetings and we said, yo, listen, based on what a traditional paid consumer app is, this is where we are. This is what we're doing. And we yell and we were like, we're trying to get it through their heads and we couldn't get any conviction. So we said, you know, we know what we have, let's go and take it to the community. so that's paid conversion. So it's basically from download to paid subscriber. What is that?\r\n\r\n\r\nNikolas Hulewsky (52:59.586)\r\nWhat does conversion rate mean?\r\n\r\n\r\nNikolas Hulewsky (53:06.126)\r\nGot it. Wow. Almost 40 % in the industry benchmark is 5%. You guys are crushing it. Organic 98 % industry benchmark 75%. Holy crap. Okay, clear. So what is this hyper card super good like what I'm.\r\n\r\n\r\nTarek Arafat (53:10.884)\r\nCorrect. Yeah.\r\n\r\n\r\nTarek Arafat (53:23.798)\r\nYeah, these were pieces to our puzzle, right? So like, you know, the HyperCard partnership is a HyperCard is great. mean, it's run by a buddy of mine, You know, they basically have this great, great card product that they're now actually selling into enterprise. So we were actually kind of picked as their dining perk so that anybody with the HyperCard can go in and sign up for table one. And that was a pretty big win for us. Super Good is something that we're still noodling on as far as, you know,\r\n\r\n\r\nNikolas Hulewsky (53:27.747)\r\nOkay.\r\n\r\n\r\nTarek Arafat (53:53.444)\r\nhow we can kind of aggregate content around food into more bite-sized actual stuff, kind of like when you see like the, search something on Google and it comes up very aggregated. And then the last two things are the table one plus one events. It's kind of really getting humans back together to kind of foster that community and allowing someone to bring a friend like to do a dinner event or something that might not be on table one. then the last, yeah, so, you know,\r\n\r\n\r\nNikolas Hulewsky (53:55.086)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (54:11.16)\r\nthat is so smart. dude.\r\n\r\n\r\nNikolas Hulewsky (54:19.184)\r\nSo smart.\r\n\r\n\r\nTarek Arafat (54:22.252)\r\nAnd we're almost, yeah.\r\n\r\n\r\nNikolas Hulewsky (54:23.832)\r\nDoes, let me ask about this one. Hold on. Does that turn table one basically into an events platform where it's like, Hey, I'm hosting a dinner and it's just dinners and people are able to connect that way or is it something different?\r\n\r\n\r\nTarek Arafat (54:33.792)\r\nYou're very astute, man. So one of the things that we've talked about a lot is there are actually a lot of private chefs that really want to host more intimate dinners and they ticket them. And this is basically a way for table one members to kind of get a little bit of more exclusive experience, right? To add membership for you. And yeah, so we're really excited about it. I think it's gonna be great. I really do.\r\n\r\n\r\nNikolas Hulewsky (54:49.928)\r\nSo smart.\r\n\r\n\r\nNikolas Hulewsky (54:55.79)\r\nDude, that is so smart. And in-person things are so popular right now. So I have a company named Tribe, which is a community for entrepreneurs. And it's not like YPO or EO, are, aren't we so smart? Yes, I went to Harvard. Where did you go? I went to Brown. Everyone's patting themselves on the back. Tribe is for entrepreneurs who are like in it. They're like $10 million and less. There are bigger companies than that. But it's like those entrepreneurs, they're trying to get to the next level.\r\n\r\n\r\nAnd because we niche down on it and it's in person and these are connections, it's been really popular. And I think anything that facilitates human to human connection like this is super smart. So I love this plus one events idea. I think that's an incredible idea.\r\n\r\n\r\nTarek Arafat (55:41.678)\r\nWe're excited, think you hit the nail on the head, really. think especially now. I think especially now. So this was all built in lovable in two days. so we basically said, dude, if no one institutional is really going to look our way, let's see if the crowd around us does. honestly, most of our investment came from our users. So we were able to.\r\n\r\n\r\nNikolas Hulewsky (55:49.464)\r\nThis is insane! This is amazing!\r\n\r\n\r\nTarek Arafat (56:06.766)\r\nkind of start funding this next stage of things. And we're still actually very much on the investment side of things. But I think what we're really looking towards, right, is it's more so about, it's not now like how much money are you bringing on? It's who are you bringing on? So actually allowing our community to participate in this event was great because not only are you kind of bringing them in as part of the squad and this is theirs now too, but you kind of...\r\n\r\n\r\nNikolas Hulewsky (56:14.926)\r\nto hear.\r\n\r\n\r\nTarek Arafat (56:34.102)\r\nallow them and you enable them in a way because now they become an advocate for the product even harder than they've ever been. And now you just yeah.\r\n\r\n\r\nNikolas Hulewsky (56:39.362)\r\nWell, dude, I. This is really clean. It's not just the look of like, you you made it look nice, but the way you've structured it, cool that you know, this is our company. Here's our story in two minutes. You can click on this video. Now I'm up to speed. We've been we've been featured in these, so it's like instant credibility builder. Forbes, the New Yorker, Gothamist, great. And then it's OK. Here's a little bit about the high level.\r\n\r\n\r\npieces of the company has how many app downloads paid member, like all the metrics I would want to see. It's not too many metrics. I'm not overwhelmed. It's enough. And then you just pick three that are like very clearly showing how powerful the company's operations are. They pay to user retention, the conversion rate and the organic acquisition. as an investor, those are, that's what I want to look at. Right. And you just clearly call them out. There's a very clear comparison against the industry benchmarks. And then you've got obviously your roadmap.\r\n\r\n\r\nLike it's not too much information. It's very clean. If I want to learn more, I can reach out to you. Like this is a really smart way to communicate this because there's so much you could have thrown into this and you didn't.\r\n\r\n\r\nTarek Arafat (57:50.756)\r\nI mean, that's right. It's like, you know, I guess kind of being on that being on the investor track, right, where you're like really going around and having so many meetings, like you kind of learn what to cut out. You kind of learn what happens.\r\n\r\n\r\nNikolas Hulewsky (58:01.613)\r\nYeah\r\n\r\n\r\nTarek Arafat (58:02.742)\r\nAnd I think like, for us at the end of the day, too, it's like when we were in an advertiser or community and say, hey, guys, come on in. It's like we wanted to make it as digestible as possible. Like you said, it was enough to start a conversation. And if they really wanted to dive in, like you don't have to you don't have to throw up all of your metrics onto a page and and have them look through if they they want to find out more, they'll ask because, you know, that and at the end of the day, like that's all we really wanted was just to get to a point where they were like, hey, I'm curious. Can I read more? Can you tell me more? Can we go?\r\n\r\n\r\nfor a beer and talk about it. And that's, yeah, it was insane. So it's interesting question in the sense that we are capping around at 400. And it's because honestly, we really don't need much.\r\n\r\n\r\nNikolas Hulewsky (58:33.773)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (58:37.506)\r\nHow much are you raising right now?\r\n\r\n\r\nNikolas Hulewsky (58:47.47)\r\nMm-hmm.\r\n\r\n\r\nTarek Arafat (58:53.668)\r\nThere was a time where I wanted to raise a million and I looked at it and I was like, why would I be giving up so much of this company if I don't need to use all of that? So I've since kind of reprogrammed myself and said, no, no, let's take less. Let's really just iron it on paper, only what we need. And we landed at 400. So we are, as far as the WeFunder is right now, like that was exclusively community from users. We've taken 157,000 so far. We have\r\n\r\n\r\nNikolas Hulewsky (59:00.31)\r\nRight. Yeah.\r\n\r\n\r\nNikolas Hulewsky (59:19.683)\r\nMm-hmm.\r\n\r\n\r\nTarek Arafat (59:23.962)\r\nI mean, I'm not even going to kid you when I say this. There's about two million of interest on the table. We're kind of over committed. So now we're kind of having conversations as far as like, who is the right partner here? And that's where we're operating from. So for the first time, I think we're operating from a place of leverage and not from desperate.\r\n\r\n\r\nNikolas Hulewsky (59:28.686)\r\nCheese.\r\n\r\n\r\nNikolas Hulewsky (59:33.966)\r\nYeah, it's a good place to be. Totally a place to be.\r\n\r\n\r\nWhat?\r\n\r\n\r\nNikolas Hulewsky (59:42.446)\r\nWhat was the, what was the we funder valuation? So $150,000 at what valuation?\r\n\r\n\r\nTarek Arafat (59:48.258)\r\nYeah, so this Yeah, so we we actually went with a $4 million cap because so many people were like, dude, you could raise that seven, you could raise it eight, you could, you know, and we sat there, we're just like, no, if this is going to be our community, and this is kind of our first real go at this, like, what you need is results, you need to show people that you can raise you, or you can you can build the plane, can fly the plane, but you can land the plane, and then they can get a return so that if I'm going to be a serial entrepreneur my whole life, and honestly, like this is a huge conversation, like my co founder, I had\r\n\r\n\r\nNikolas Hulewsky (01:00:08.91)\r\nMm-hmm.\r\n\r\n\r\nTarek Arafat (01:00:18.916)\r\nIf you're going to be a serial entrepreneur your whole life, potentially going to raise money in the future, the number one thing you need on your resume is an exit that produced. So for us, I'm not going to try to shoot for an insane valuation. I'm going to go for a very, very modest valuation and then try to exceed that target by however much so that my investors are even more happy. And then we go from there. And that was my thought process.\r\n\r\n\r\nNikolas Hulewsky (01:00:46.808)\r\nSo when you say a $4 million cap, you guys raised a safe. Okay, okay. What's this next round? Is it a safe as well?\r\n\r\n\r\nTarek Arafat (01:00:51.556)\r\nYeah, on a safe. That's correct. Four million post money.\r\n\r\n\r\nTarek Arafat (01:00:59.074)\r\nYeah, we're you know, the thing is, right? It's like we're talking with syndicates. We're talking with there's a lot of people that you know, they might want to do an SPV. They might want to do something else. We're figuring what that is. But we're going to we're thinking that, you know, depending on the partner, it'll it'll still be somewhere around four to six million dollar cap. Preferably, we would do it on a safe. That was that's my preference.\r\n\r\n\r\nNikolas Hulewsky (01:01:21.358)\r\nStill a great valuation, dude. I mean, for where you are in the life cycle of your company and the position that you're in to be able to go and raise money and at terms that you want to be selective with who you bring on is, dude, it's incredible.\r\n\r\n\r\nTarek Arafat (01:01:32.952)\r\nYeah, I think it's hard man because you look at Twitter and so many people are raising it like, know, however many million and you feel so, so like, compel you're like, I have to be that or I'm a failure. It's like, no, dude, can an amazing business for, know, and not have to worry about that.\r\n\r\n\r\nNikolas Hulewsky (01:01:39.54)\r\nIt's a lie, dude. Nah.\r\n\r\n\r\nNikolas Hulewsky (01:01:45.91)\r\nNo.\r\n\r\n\r\nNikolas Hulewsky (01:01:49.902)\r\nThose are liars. 90 % of the time, they're just freaking blowing smoke. All right, dude, this was amazing. Thank you. Let's talk soon. I'm gonna...",
  "metadata": {
    "duration": "",
    "date": "2025-07-28",
    "platform_source": "Google Drive"
  }
}