{
  "episode_number": "07",
  "episode_title": "WTF is a Digital Agency and Where Do I Buy One?! Advice from the $100M Ad Man with Sam Thompson",
  "guest_name": "Sam Thompson",
  "business_name": "Creative OS",
  "transcript": "﻿We've got Sam Thompson here. You may have seen him on Twitter as Sam Thompson. We made his office into a podcast and I'm super stoked about this. Sam is in his mid twenties.  Media tech entrepreneur and mogul. And I'm going to let you give yourself an introduction because I couldn't even do your business justice.\r\n\r\n\r\nTell us a little bit about  what you do, where you're from. Yeah. Born and raised LA traps across the United States, Boston, Minnesota, New York, all of those building  a cornucopia of internet businesses with a healthy mix of successes and failures. And now I'm really focused on. Software enabled services in the marketing space.\r\n\r\n\r\nAnd so anything from SEO, paid ads, website dev, anything in that service space and trying to leverage technology within those to just give a quick breakdown. What businesses do you have? Okay. So we have quicker leads, which is a PPC agency. Okay.  Yep. We have unlimited content, which is content marketing, SEO low market.\r\n\r\n\r\nKind of an offer. Which is one of my favorite businesses right now, but we have 72 hour sites. com, which is a website in 72 hours. It's really hot. Just launch that. We have our high ticket website agency blinks where we do more of the 10 to 30, 000 sites that are much more complex.\r\n\r\n\r\nAnd then we have magic SEO which is a more traditional SEO agency. And then creative OS, which we'll talk about a little bit more in depth today which is all in the ad creative space for Facebook. And when you say we, you have multiple partners. A lot of the agency ones are owned by quicker HQ, me, Steven Allman and Sam Preston.\r\n\r\n\r\nAnd then. My boys over at creative OS, Bobby and Austin and chase, and we're running it up over there. Okay. You're originally from California. Just moved out to Dallas a month ago. Yep. You do have in and out here, so that's good. Thank God.  At least twice a week. And we're going to talk today about creative OS.\r\n\r\n\r\nThank you. I thought this would be fun to just have like a business breakdown and ask as many questions as possible. If there's anything that you're like, I don't really want to share that either. We'll edit it out later or you'll just say, I don't want to say I plead the fifth. If you could in like one sentence, what is creative OS?\r\n\r\n\r\nYeah. It's essentially the creative ecosystem for e commerce brands where we provide proven templates for landing pages. Emails and ad creatives for them to run ads with. Okay. Who would use you? Who's your ideal customer? Mostly the brands themselves and a lot of marketing agencies that are doing media buying or email marketing for brands are also customers for us.\r\n\r\n\r\nOkay. And your typical customer is doing what they're like a small one location business. They own multiple brands. Yeah. So we have essentially four. subsets of our market that we identify and target independently. One is we'll call them the indie e comm brand, in, in the internet world, the drop shippers, right.\r\n\r\n\r\nThat are just testing products and trying to run stuff up on those. Then we have the more established direct consumer brands ranging anywhere from doing 1, 000, 000 a year to a couple of brands that do north of 50, potentially even 100, 000, 000 in revenue every single year. And then we have the freelancers that are, one off, Hey, we help somebody with media buying or email marketing.\r\n\r\n\r\nAnd then we have the agencies that are bigger organizations that support those e comm brands. So let's say I'm black rifle coffee. Yep. I sell online. What would I come to you for? I'd come to you to say, I want to launch a campaign and then you would take it from there and do what? We would provide all the templates.\r\n\r\n\r\nAnd so we transitioned away from done for you services actually providing the services. Yeah. Yeah. So we originally creative us started as a done for you service. It was actually called better creatives two and a half, three years ago. And my partner and I did where we were doing done for you, they'd come to us for exactly that reason.\r\n\r\n\r\nHey, we want to test more on the Facebook ad side. We want to do email marketing, we want landing pages. And so we did it at that 3, 500 a month price point.  The challenge with scaling a service business is that just especially something that's design or creative oriented. It's just one of the more challenging businesses to grow and scale and hire for and all of that.\r\n\r\n\r\nAnd so we transitioned from that to taking all of the ads and landing pages and everything that we had created for our clients and turning them into templates that we could then sell as a digital product. Did that for, I actually left the business at that point for about a year. We sold those did well.\r\n\r\n\r\nProduct market fit was there, but couldn't really maximize any of the enterprise value in it because it was all one time packs, right? We were just selling them past 150 bucks and like you're, so there was no recurring nature when you were doing it for them. There was no like, Hey, we're placing X number of dollars per month and you're going to get this percentage.\r\n\r\n\r\nAnd we were doing that on when we were doing done for you. But we were only the creative arm. We were not doing any of the media buying or anything. So we would plug in either with the brands that already had an agency in place to do the media buying themselves or.  People that we're using, yeah, either an agency or internal teams.\r\n\r\n\r\nSo it would be fair to say that, this is a buzzword right now, but this is a product I service. Yeah, it was at that point. Now it's transitioned more into  SAS as a stretch, but it's getting there. Okay. So again, I'm black rifle coffee. I would come to you and say, look, we have our own team, but we're not getting the results that we want on Facebook, Instagram, like what are the platforms?\r\n\r\n\r\nYeah, basically. So we started with mostly ad creatives. And so they would sign up.  Sorry, what's an ad? Creative? So like you're running ads on meta. Right. Okay. And you need a creative asset to run as your visual component of that ad. Okay, got it. And so we have all the templates for that. They sign up something I would think of as like flyer or Yes.\r\n\r\n\r\nSome picture. Yeah. But a digital version of it for Facebook. And so they would sign up or their agency would sign up, their creative director, whoever that's gonna be and. One click, copy and paste proven ad creatives that have already worked for a bunch of other brands that they can go. And the reason they would come to you is because they'd say, Well, what type of font, what coloring, where you should place the lettering, what's going to catch people's attention, et cetera.\r\n\r\n\r\nThey have their own team that's chosen the color scheme they've chosen, what the messaging is going to be, all of those things, but they come to you to essentially configure it. Yeah. And get inspiration and just see what a bunch of other brands are running and being able to just like. Essentially, we try to accelerate their creative output at the end of the day, it's like you're either going to start from a blank page trying to design and add creative from scratch, or you can just come to creative OS and get, I don't know, we're at like a thousand ad templates now that you could just scroll and like one click copy paste, make it for your brand based on our template.\r\n\r\n\r\nSo would you be a company That brands go to as they're creating their brand or like, would Haynes come to you and be like, will you help us maximize our Facebook? Yeah. We have all sorts of people that are net new brands that are trying to test ads for the first time and running ads.\r\n\r\n\r\nYeah. Anyone that's looking for more creative assets comes to us. Okay. I know these are dumb questions. So you're not necessarily helping them saying, Oh, okay. Your brand is Haynes.  This should be the color scheme. This is what the lettering should be, et cetera. You're there. They already have that stuff.\r\n\r\n\r\nThey're coming. They're now coming to you and saying, We want to  leverage this into Facebook or Instagram, Twitter stuff and we'll give them the template to do so. Okay. And so now it's so much more, it's self serve like we, we think of creative OS as a SAS. I think like if you're thinking about it technically, it's probably a little bit more like a data as a service company where we have the library.\r\n\r\n\r\nYou guys can pop in and take what we, that's what I was gonna say. Like the reason you're thinking of as a SAS, because it's just monthly, it's a recurring business, monthly recurring things that they need. They go, they pick it out and there's, so are there any add ons? Like can you upsell? Yeah. So we do, we just rolled out a secondary pricing.\r\n\r\n\r\nAnd so we were originally only doing ad creatives and now we're doing email design and landing page design for websites as well. And then we have a handful of clients because we've built out a full. Essentially creative team that we use to produce all of the templates. We have a couple of agencies that, that work with us on done for you, where we'll actually go through and make custom stuff, but that's more in that 3000 price point.\r\n\r\n\r\nWe just don't prioritize it that much. Cause we're going, which we'll talk about valuation and all of that stuff. We're trying to stay more. On the SAS model. So you make money right now by recurring revenue, not one off done for you services. Nope. Okay. What's your ideal customer? How do you find your customers?\r\n\r\n\r\nTwitter. Really good old Twitter. Yeah. Twitter's fun. We're starting. So we just went through a whole revamp of the actual product. It was originally built on no code. And so we just transitioned to being a full. Mostly, well, for a bunch of reasons but one piece being the multiple, a little bit more of a tech mode where people can't come and replicate us.\r\n\r\n\r\nYeah, because you're actually building proprietary software that you'd be able to actually say as an asset versus like, Oh, you could also go put air table and web flow. Right. Right. These things put together. And so, yeah, we've been pushing on Twitter and now starting to do, we've done influencer marketing a little bit.\r\n\r\n\r\nOther expert packs of people that are big names in the space. And then we're going to start breaching a lot more into cold. So paid ads for ourselves and then cold email. I've always thought it was interesting, like marketing companies. Have to get customers as well. So do they use their own marketing funnels to do it?\r\n\r\n\r\nYeah. Like we've been playing with ads this week. So that's like the definition of eating your own dog food, right? Yeah. We use our own ad templates to run ads for ourselves. Dude that's rad. Yeah. So you're also testing this stuff. So when you actually give this, these templates to customers, it's like, Hey, we, that's how we got you.\r\n\r\n\r\nWe know that they work. Yeah. These are our conversion rates is where should be. Okay. Yeah, dude. Super fascinating. So how do you charge, what do you charge? Right? Is it all work price? 40. Yeah. 49 bucks a month. You get access to all of the ad templates. Okay. For the creatives themselves, 99 bucks a month, you get ads, emails, and landing page design templates.\r\n\r\n\r\nTalk to me about like the size of the business, and you can speak broadly if you want. Like, is this a million dollar a year? So this a hundred thousand dollar a year? Top line? Yeah, top line. So we just transitioned to SaaS. On the recurring model in December. And so we're at 25 K and M R now in the last four months.\r\n\r\n\r\nOkay. So 25, 25 K. Yeah. Cause 25 K M R that's going to be what? 250. Yeah. Customers. Yeah.  Yeah. A little bit more. That's not right. It's like 400. Yeah. 470 I think. Yeah. Five times. Yeah. RSV is starting to go up now. Cause it's just average subscription value. Okay. And so we only had the 49 plan for a while.\r\n\r\n\r\nThat's a lot of customers, 500.  That's awesome, man. Yeah, it's working. Twitter's fun. It's freaking mind blowing. And so we're going to, we're starting to put a little bit more fuel on the fire there. It's been super organic word of mouth,  mostly out of a desire to like get as much product feedback as possible on that subscription model versus the one time packs.\r\n\r\n\r\nAnd so, so before, okay, before you switch to this new pricing model, yeah.  How much revenue had your business done when we were selling the one time packs? I think we probably did, I don't know, two 50 to 300 in top line a year.  We only ran that for about a year. Okay. Creative OS as an entire company is only what made you switch.\r\n\r\n\r\nWas it like not as profitable or like you were saying there's recurring no enterprise value. Okay. And we just figured that we could probably get our LTV up because we were selling those packs as a one time thing for 150 bucks. What was your lifetime value before? It was 1 50 and now it's, it's still new.\r\n\r\n\r\nAnd so it's continuing to go up every single month as people stay on. How do you calculate Lifetime value, especially when you're a new company. Yeah, we just make assumptions. Yeah, Stripe gives you whatever that number is. And so for us, Stripe does. Yeah. Stripe gives you an average LTV.\r\n\r\n\r\nI didn't know. Yeah, you have to like go into the settings and ask for it. There has to be like a methodology that they apply to it. Yeah, I don't know. I don't know the math. Like for us, we're just trying to make the numbers go up, whatever they are. And so LTV is on our dashboard. Let's get that one north.\r\n\r\n\r\nAnd so for us, we like it cause we were at one 50 for an LTV. And so now stripe is saying our LTV is two Oh six or something like that this morning. So in your previous model, how much did it cost you to acquire a customer? We've not spent a dollar on ads or any marketing. You're dumb. How much do you think it will cost you to acquire customers moving forward?\r\n\r\n\r\nDepends on channel, obviously. Um, our target really is to break even on month one. And so our target CPA is 50 bucks. What's CPA? Sorry. Cost per acquisition cost was the same thing. Why do people differentiate between CAC and CPA? It's the same thing. Oh SAS people use CAC a lot more. E comm people use CPA.\r\n\r\n\r\nInteresting. What were your margins like before you pivoted and what are they like now? Just like a rough percentage basis.  99. 5 percent and now 85%.  Oh, so pretty bad. Yeah. They're only 85. I'm really sorry. Digital product, makes it easy. What is your, so you're talking about before you were a true agency.\r\n\r\n\r\nAnd the enterprise value was not great. So like, what would that business have been valued at? Maybe half a mil cause like, just walk me through like how would you value it? Yeah. So when we were running the agency, we were at,  I don't know, aggregate, probably we were averaging maybe like  35 a month,  35 a month top line or what they're.\r\n\r\n\r\nAgencies trade for like what? 1. 2. I have no idea that I think it's like 1. 2 top line rev.  Okay. So let's say that you're just to make it easy. Let's say it was 500, 000 a year. Top line. Yeah. You could have sold for 600, 000. Yeah. In theory. There's complications with that. Like the team was super small.\r\n\r\n\r\nIt was super founder reliant. There's a lot of key man risk. Yeah. It would have been an earn out more than it would have been anything else. Maybe. Probably positioned more as an aqua hire, but like, it wasn't the direction we were trying to go with it anyways. And so we were really focused on you  providing the service.\r\n\r\n\r\nOkay. So we had just a, such a small team that were all contractors. There was no w two. So it was hard. It was just like,  it was a cashflow. We were like, Oh, the market needs this. We're going to go make 30 to 40, 000 a month. Just cause like we have the people to do that. Let's go. So now how do those businesses trade?\r\n\r\n\r\nYeah, so I would say probably like on the safer end, probably four X,  four X revenue. Yeah. Why do they value off a revenue? I don't know. Because the margins are so good report on acquire. com that was talking about that. Okay. Like the challenge is like, I could sit here and be like, yo, like our business is worth one and a half million dollars.\r\n\r\n\r\nIf you do a six X on our three, whatever. Right. Like, yeah, The reality on it though, is like  what it would actually sell for today versus what it's quote unquote worth with the math or two different things. Like we've only been running it for six months. Like there's not enough historical data for someone to come in and buy that super comfortably.\r\n\r\n\r\nStill key man risk for sure. But the idea was to turn it into a business that could actually be sold without any of you being necessarily acquired. Yeah, and it's getting there. Has it reduced the amount of work that you put into the business? Changing it to this model? Drastically. Yeah. We saw a huge reduction in, in, running an agency is just the most time consuming business model.\r\n\r\n\r\nAnd so when we transitioned away from that, Yeah, we went from, 30 hours to 40 hours a week on that 10. And then now, I don't know, I probably spend  four or five hours a week on Kurt Voss. So what did your team look like and what does it look like now? Before when we were running the agency, it was me, partner.\r\n\r\n\r\nAnd then we had two freelance guys that were supporting him, but to be honest, VAs, or were they local or they were like, if we were hitting bandwidth issues and needed design support not somebody that we brought in locally, all offshore. Now  we have.  Two or three engineers, a fractional CTO,  and then a few smaller partners that also step in and do a couple hours of work on different pieces which has been a huge lift.\r\n\r\n\r\nIt's been awesome. Yeah. Yeah. Do that. It's super freaking interesting. Yeah. Have you had to change from like you  having the relationship with the customers to actually building out? Like customer relationship manager, client relationship manager. Yeah. Yeah. It's super self serve and like the nice part for us is like we try to build a business that was like supportless, like there was not a need for a lot of support unless something was truly broken.\r\n\r\n\r\nMeaning like one of the ad creatives, when you click copy and paste didn't work. Yeah. And so we just, we were going for simplicity. We have a support channel, we have a community in Slack for all of our customers. And we maybe get one message a month. Interesting. Like maybe a week, but like not that big of a support lift on that.\r\n\r\n\r\nOn Twitter, everybody's doing an agency. Yeah, right. There's like lots of people who do agencies, but Twitter's kind of a bubble or an echo chamber, I guess I should actually say. Yeah. Where do you think we are in the maturation of either in agencies or just digital services? Are we early? Are we like.\r\n\r\n\r\nLike, do you feel like there's a lot of runway for what you're doing? Yeah, there will all like agencies will always exist, right? I think a lot of people have conversations that are, they're nervous that software will take over the service provider,  but like the reality of it is all of these tools for all of these things have existed for a long time.\r\n\r\n\r\nYou can go run your own Google ads for sure. Like go ahead. But like a business owner doesn't want. To do that. No. They don't want to, like, they don't have the time. They'd rather pay. Like, the competition  to agencies is internal talent. Right. Cause that's the, that's more often the decision. What do you mean?\r\n\r\n\r\nWhat does that mean? Like you're either going to hire us as an agency, like not creative. Oh, you're either going to hire us. You're either going to bring it in house or you're going to hire it. Right. Because like the founder is not going to run the PPC forever. Like he's not going to run the Google ads or he's not going to send the cold emails or he's not right.\r\n\r\n\r\nLike there will always be an outsource and like. even though there are tools that would make doing it yourself easier, there will always be a market for people that don't want to do it themselves. And so like the benefit for  the agency owners at this time and who knows how long it will probably continue to be this way is like the tools that agency owners can use to deliver high quality services are getting better rapidly right now.\r\n\r\n\r\nRight. Yeah. I being, what we do with unlimited content. We do not hide the fact that our customers on unlimited content can totally go sign up for an AI blog writing tool. Yeah, you can. Go ahead. Like, if that's what you want to do, somebody's got to figure it out. They're not paying us for the quality of the AI.\r\n\r\n\r\nThey're paying us that they don't want to do it themselves. They don't have the time. They don't want to think about it. Like the last thing on their agenda is writing a daily blog post. So we just take it off their plate. We just don't charge 3, 000 a month for it. We just charge 400. And so there's these opportunities like that, where like tools are created that allow for.\r\n\r\n\r\nThe service provider to create more scalable offers and scale. I forget. Did you go to college? I dropped out. You dropped out. Yeah. Are you a coder? No, no code. Everything's all self taught. Yeah. So you were just on Twitter and you saw this opportunity. Or like, how did you get it? How did you actually get started with it?\r\n\r\n\r\nI've been in the digital service world since I was 15. Okay. So you were just always curious. Yeah. And  honestly, more than anything else, I've just been like super lazy and I'm like, there's gotta be a tool. I was like, there's gotta be a tool that can do this. And so like, I just got super familiar with, Lots of tools, especially in the no code space.\r\n\r\n\r\nOkay. That makes sense to me. Yeah. All right. I got some questions for you. What do you love about this business? About creative OS about creative.  Sorry.  How do I like describe it without calling it creative OS?  What do you mean? Digital marketing service digital concept. It's a SAS. It's like, it's a, I know it's a SAS, but like, There's a lot, like there's lots of companies that are SAS companies, but they have a specific niche.\r\n\r\n\r\nYeah. Did you, I don't know, it's like paid media support, like paid media templates, paid media, digital media is the world that we live in more than anything else is the paid media. Like we're not trying to call it digital media. That's just so broad.  We support specifically paid for EECOM. Like we're not, I called it paid digital media. \r\n\r\n\r\nThat's my show. I'm going to call it. Yeah, you can do whatever you want. I'm just, I'm along for the ride at this point. All right. So let's call it paid digital media. Sure. What do you love about it? It's a good question. Paid in general. I love that. It's the most asymmetric return on time. Right.\r\n\r\n\r\nGenerally speaking, like for brands, you can increase sales by just changing the numbers. Agree with that. Right. Why do you love this business though? That's more of my question. I think that it's very scalable. The the return that I will see  on it now being a SAS is sizable, it's self serve and it's high value for the customers that we serve.\r\n\r\n\r\nSo mainly financial. Yeah. It's not like you're like, I just love the digital space because of technology. No, I love all of it, but nothing, there's not like on any, like very transparently, like everything that I do, like I love marketing and growth. I love being in business more than anything else for me.\r\n\r\n\r\nWhat do I apply that desire for? And like, that's what I love is like building and growing and networking and like all of that. I'm just trying to apply that energy. Two things that I think fit my personal financial plan. And so like I do all the agency search, like services stuff because of the cashflow creative OS is a cashflow play, but like also the enterprise value that I'm building there is much higher.\r\n\r\n\r\nAnd so like, I'm able to play both sides personally while doing what I love. And I, with the partners that I love, like, that's why I love creative OS. It's like the guys that I'm building with are like some of my best friends and like. We get to hang out and build and make money together. And like, that's more of what I love than Oh, I'm super passionate about I love that you have an enthusiastic curiosity, right?\r\n\r\n\r\nLike you're just like, I appreciate that. Very curious on how things work. Yeah. And that's infectious. Like it's just fun to figure stuff out. What do you hate about the business?  What do I hate about the business?  So specific insufficient funds.  Oh, the number of failed payments and involuntary churn.\r\n\r\n\r\nWe see really on that business. Oh, like,  and are you building an arrears or any of that sort of stuff? They don't sign up for the free trial and they don't they churn, but they don't cancel because they're having insufficient funds in their bank account. And waking up every morning, checking Stripe and seeing.\r\n\r\n\r\nLiterally hundreds of dollars a day of transactions that are failing because of insufficient funds. The bane of my existence kills me. It makes sense. I always find something funny. Real estate guys always look at SMB guys. And think like, I wish I had a services business and then services business guys always look at real estate guys and are like, I wish I owned more real estate.\r\n\r\n\r\nYeah. What industry or business are you the most jealous of  the restaurant business? Really? Oh yeah. I think why  for the social component, like I think owning a coffee shop. Or I don't drink, so like a bar wouldn't really do it for me, but I think owning a coffee shop or like having a physical place where the community like gathers  would be so cool.\r\n\r\n\r\nThat's pretty rad. Okay. Yeah. I don't really want to run a plumbing shop or real estate. I'll buy, but. Okay. Yeah. No, I just, I always think it's interesting because  especially when you're curious, the grass is always greener. For sure. And so it's like, don't get me wrong. I look at everything on biz by cell.\r\n\r\n\r\nI'm super intrigued. But yeah, no I'm going to stay in my lane. What keeps you up at night? Ideas and time allocation ideas. Like I got to work, I got to act now or ideas like, Oh, that would be really cool. And you just can't stop thinking about it. I can't stop thinking about that. Like this would be dope whether it's within a business or a new business been, that's been my thing for this year is.\r\n\r\n\r\nNo new businesses. And I've been trying so hard because I just have ideas all the time. And I'm like, Oh, we've got the team that could do this and that and this and that and this. And it's like, let's get the main ones that are already working. I've been there, and so I've been there. That's what keeps me up at night.\r\n\r\n\r\nLet's see here.  Knowing what you don't know, would you do this business again? Yeah. Okay. For sure. That was an easy one. Yeah. Easy. What are you obsessed with right now?  What am I obsessed with right now? Arbitrage. I think there's so much arbitrage opportunity right now in the digital space. Like we were talking about with the service providers.\r\n\r\n\r\nUnlimited content is basically just an arbitrage opportunity. Are we better? And can we create a more efficient system that allows for us to split the difference? Same. And it happens within, within, digital marketing as well. From an SEO perspective. Unlimited serves that and helps our clients take advantage of arbitrage, right?\r\n\r\n\r\nLike the keywords that we talked about when I jumped on your show, randomly that one day where it's like,  you can just find niches of in the keyword space, like  not that much keyword difficulty, easy stuff to rank for. And if you can just write enough articles, you're able to get the total number.\r\n\r\n\r\nLike other people want in search volume, but you're dealing with the 10 percent of the keyword difficulty. And so there's just so much of that, of like in little niches all over the place, like just figuring it out. Yeah. There's just opportunities where little opportunities that I just like, if I see it and I go down the rabbit hole.\r\n\r\n\r\nWhich leads to ideas and then a business and then not sleeping myself out of it and the whole thing. Petables. No, sometimes. Not anymore. Not in Texas. All right. You want to look at some deals? Always. All right. So I thought it'd be fun after looking, after talking about the business, taking a look at a couple of deals.\r\n\r\n\r\nI don't know how we're going to do this. I think we, maybe you just want to pull it up on your computer. Yeah. The idea behind this is. We talked through the business. We get a better understanding of what they do, what the customer looks like, how they generate revenue, how they generate a profit, et cetera.\r\n\r\n\r\nAnd then we asked the question,  how do you find businesses like this? And if I found a business like this, how do I know if it's good or not? So we're going to go through a couple of examples  that  Sam found. So it was looking, so here's the first one. Where do you look for businesses? Acquire.com.\r\n\r\n\r\nacquire.com is a cool one. Used to be Micro Acquire. Micro is now acquire.com. Okay. Flippa. Flippa. Yeah. S and b stuff. Obviously Biz By Sell, but you're not really looking at s and b stuff. You're looking at tech. This year I'm not trying to buy anything. Cool. Cool. No, that's good's chilling. But and then Empire Flippers as well.\r\n\r\n\r\nEmpire, I don't know what that is. I've never heard that one. Yeah, no, he's on Twitter. Okay. Good guy. Alright screen share. Oh, sweet. There it is. Yeah. Look at this. All right. So this business just give us the broad strokes. Yeah. So basically comprehensive SAS based software and website building platform for rental businesses.\r\n\r\n\r\nHow did you, so what was the criteria you used to find this business in the first place? I went on flip and I clicked SAS. That's it. You just said SAS and then are you looking for something? Are you like, I want something that says website or digital marketing. Yeah. Generally like all of them just give you like that one liner.\r\n\r\n\r\nOkay. And so I'm kind of, there's two types of businesses that are interesting to me. Ones right now I'm more interested in like plugins. What do I have in my ecosystem already that can be leveraged? To like support the ecosystem. You know what I mean?  I heard this joke on my first million where they were talking about building enduring businesses.\r\n\r\n\r\nAnd one of the guys was like, I want to build a Chrome plugin, hand it down to my grandson. Grandson. Chrome won't even exist. No, Chrome won't exist. Yeah. So there's that there's ones that are like, I don't know. In the SMB world, they talk about them as like tuck ins, I think. Yeah. So that's how you view these.\r\n\r\n\r\nYeah. There's either the tuck in business that like, Hey, this would plug in well to something that we're already doing.  Or  there's the standalone kind of business. And so depending on who the buyer is and the context, like buying a business is like, everyone likes to talk about it so plainly, but there's just so much context that goes into it.\r\n\r\n\r\nAnd so like this one, all right. So describe it. Yeah, it's it's classified, so I don't have all the details, but just give the broad strokes,  it's doing 15, 000 a month in profit. Is that okay. So does it say what it's doing in MRR? It's doing, so the margin on it is 45%, so probably around 30 ish.\r\n\r\n\r\nWe'll say 30. 30 ish, 5. 5x profit multiple. Been around for six years.  Okay. So I like that because it's so six years is a long time in your space. Oh, yeah. Especially in like software and all that, like getting something that's six years old is solid. What about a 5. 5 multiple? Like I know what it is on the S and B world, but is that reasonable?\r\n\r\n\r\nYeah, it feels fine at a 40 percent margin. Let's just say. That wouldn't be the equivalent of two and a half times revenue,  right? Yeah. So a hundred. Yeah. Two and a half. So 40 percent for. Yeah. And so you're what your payback period, if you dumped it all in would be like three years.  Yeah. Less than three years.\r\n\r\n\r\nYeah. That's, so that's reasonable. That's in the range for you. Yeah. That feels fine. I think I look at it as like,  that's not going to be the monthly profit for long. It's going to go up pretty quickly. Why? So.  You're viewing this as a token. Yeah, like it's a website building platform.\r\n\r\n\r\nRight. And so like for me given my ecosystem, I just want all their customers. Because I can go sell them unlimited content. I can go sell them PPC. I can go sell them. Is there anything in there that gives, there's like a yellow flag or a red flag of like, I don't know, not turn or not off the rip without contacting the seller in India.\r\n\r\n\r\nDoes it matter where it's located for you?  No, these businesses are software one. No, not at all. Let's say you bought this business. You would essentially just.  Transition the customers and be able to handle them remotely. Yeah. Yeah. Yeah. Yeah. I'm assuming it's software, right? Like I'm sure they have customers all over the U S.\r\n\r\n\r\nOkay. So this is an interesting one for you. Yeah. Okay. I like that. And then the other SAS company that I found, I don't love. Okay. Don't spoil it for me. It's all right. I just switched it over to this one. This one is, A platform leveraging a I to generate high quality marketing copy, helping businesses enhance content creation.\r\n\r\n\r\nWhat does that even mean? A platform leveraging a I? Yeah, I'm sure you pop in there. You give it a prompt and it writes your blog content. You're whatever. Okay. This one's much smaller. 1000 1100  in monthly profit. Okay. 68 percent margin. So what? 1500. Okay. Roughly. The multiples are better, right?\r\n\r\n\r\nBut it's only been around for two years and it's a lot smaller. I think people would be interested in buying it. How much is it selling for? 30, 000. Okay. So it's doing 20, 000 a year ish revenue. Yeah. But it's selling for 30, 000. So it's in that one point. Yeah. They're saying 1. 6 revenue multiple and 2.\r\n\r\n\r\n3 on profit. Which like, I'm not mad at, I just think like the piece that makes me nervous with these is like with so much conversation around business buying happening, that there's like a very, there's a segment of the market and maybe it's more in my world on like the indie hacker tech side that someone would be like, Oh let me go buy that for 30, 000 bucks.\r\n\r\n\r\nAnd Try to grow it, which like, sure, if you're going to do it for a flip, like, if you could double the monthly profit and sell it for 60, that's fine. But if you're trying to build like a sizable business over a longer period of time,  like transparently, like we're going to make the entire value prop of this business. \r\n\r\n\r\nA feature of creative OS. Right. And so I think there's just a lot of risk in it of like, you're not going to be able to compete.  Like how are you going Other than the other business? Like they still, I'm sure they still have a customer base. They have, yeah. Information that's going to be valuable to you.\r\n\r\n\r\nLike, why would you be less bullish on this than the other one? If it was going to be positioned as a tuck in, I could be down. I just think that they, unless they have some secret sauce going on their, the AI prompting, it just feels super easily replicatable. Why wouldn't the web? Design company. I don't remember the description of the other one.\r\n\r\n\r\nLike that's not replicable. Yeah. It's just harder to get to 15 or 30, 000 a month in profit with also it's the scale for what they're doing. Yeah. Like me going and buying a thousand dollars a month of profit, doesn't move the needle in the same way 15 does and the size of it. And so it's almost an argument,  which like Steven Ullman, who's over there.\r\n\r\n\r\nAnd I talk about like, if you're going to buy a business, Try to buy the biggest one you can, right? Like it's probably the safer bet. The bigger it is as backwards as some people that are early. And I used to think about it. I'd be like, I'd buy this for 30, 000 bucks. And I'm like, if I'm going to go buy a business,  I'm trying to buy something. \r\n\r\n\r\n3 million that like, yeah, I'm in the middle. Yeah. I think your first businesses go with these types of asymmetric bets, right? You're like 30, 000. Get your feet wet, understand the business model outside of the game and then take that swing. Right. Cause now you've had a ton of reps. We were talking before, but your templates, how much  marketing spend has been generated using your templates?\r\n\r\n\r\nYeah. I think at least a hundred million spend on the back of a hundred million dollars on the back. Yeah. That's insane. A hundred million dollars.  On the back of your templates. Right. All right. So you've got a lot of reps in. Yeah. So now it's now, like I get you going and taking that big swing. If you're going to do a deal, like, yeah, go big.\r\n\r\n\r\nRight. Because the amount of work is the same, whether it's a small deal or a big deal. Like other than maybe not having to go finance it, but like, yeah, love it. There's enough people do. This was fascinating blast. Tell me and the people where can they find you? And what's the best way to contact you?\r\n\r\n\r\nHit me up on Twitter. I'm Sam Thompson. Sam Thompson. I'm pretty active in the DM. So hit me up. Okay. I love it. Sam is awesome. Yeah. Thank you.",
  "metadata": {
    "duration": "",
    "date": "2024-05-07",
    "platform_source": "Google Drive"
  }
}