{
  "episode_number": "122",
  "episode_title": "TOP PICK! How to Start a Business in 2025 (Two-Step Guide) with Michael Girdley",
  "guest_name": "Michael Girdley",
  "business_name": "Alamo Fireworks, Code Up, Dura Software, Nier, Scale Path, Gertling Media",
  "transcript": "﻿Nikolas Hulewsky (00:01.1)\r\nAll right, Michael Girdley, I made it back from Hawaii and thank you for rescheduling because I decided to take a weekend trip to Hawaii. I don't know who the freak does that, but my family did, which is great. And we made it back in one piece. So thanks for being patient.\r\n\r\n\r\nMichael Girdley (00:15.878)\r\nWelcome back. At some point you should do a whole podcast on why you did that. as you live tweeted it, looked crazy.\r\n\r\n\r\nNikolas Hulewsky (00:23.992)\r\nDude, all right. It was the first time we'd ever taken our kids on a real vacation. I'm not talking about, let's go to California and visit family, but proper fly six hours. It's because we didn't want to take our kids to fly six hours. So we left our two younger kids at home with my mom, and we took our two older kids thinking, they can handle it. And they did. They did fantastic. But in order to get anywhere from freaking Boise, you have to do a layover. San Antonio is probably a better airport. I don't know. Do they have direct flights to Hawaii? OK. Never mind.\r\n\r\n\r\nMichael Girdley (00:48.59)\r\nNo.\r\n\r\n\r\nNikolas Hulewsky (00:51.638)\r\nYeah, Boise doesn't either. It's a nightmare. So it was already an eight-hour trip. Well, we end up flying to Hawaii. There's a massive storm, massive outage. They close the Honolulu airport as we're landing on approach. And so we divert to Maui and the pilot just comes on. like, well, we got to divert to Maui because we don't have enough fuel to circle. So we got to go refuel. We land in Maui. It is packed. We can't even get to a gate. And the pilot comes on. He's like, optimistically, I think it's going to be 90 minutes before we get to a gate. He was actually really good.\r\n\r\n\r\nWe were on the tarmac for four hours. I'm not exaggerating. Four hours, the pilot came on and was like, this is the worst delay I've ever seen. I have a 10-year-old and a seven-year-old. They did fantastic, all things considered. But then we had to go get a hotel. I'm so grateful. My wife was like, no, we're not sleeping in the airport. I'm thinking, hey, they're going to reschedule our flight tonight or we'll get out at 6 a.m. Why go buy a hotel room? My wife's like, no, we're going to go buy a hotel room. Okay.\r\n\r\n\r\nLuckily she did because we ended up getting delayed again until 2 p.m. the next day. So at least my kids were stoked to be in Maui. We were at the AC Marriott. We've spent a thousand bucks. It was a thousand bucks to get a hotel room for the night. I was already irritated, but I'm glad we did because we actually had an experience. My kids loved it. They were like, we get to go to two islands? my gosh, this pool's amazing. the weather's so good. The food's fantastic. Thankfully they had good attitudes because I did not at the time, but yeah, we made it. We made it.\r\n\r\n\r\nMichael Girdley (02:16.432)\r\nSo how many hours did you spend in transit versus like, okay, and then how many hours did you actually spend in paradise?\r\n\r\n\r\nNikolas Hulewsky (02:20.782)\r\n38.\r\n\r\n\r\nNikolas Hulewsky (02:27.79)\r\n72? No, no, no, no, not even 72. freaking A. Why'd you bring this up? Now I'm gonna get irritated all over again.\r\n\r\n\r\nMichael Girdley (02:33.254)\r\nThis is like a two to one. No, I mean, I appreciate.\r\n\r\n\r\nNikolas Hulewsky (02:37.678)\r\n48 hours. 48 hours.\r\n\r\n\r\nMichael Girdley (02:42.182)\r\nI appreciate that it's going to be the memory of a lifetime. It's going to give you some stories. And frankly, it's probably the best marriage counseling ever because next time around, like you guys talk about doing this idea, I don't think it was your idea to do this trip, but you'll be able to be like, remember that time that we.\r\n\r\n\r\nNikolas Hulewsky (02:53.432)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (03:00.494)\r\nNo, I get it. My wife was like, well, the kids are still young. I don't want to be away from them for that long. We'll be gone four days, five with travel. So it'll be enough time. And we were going for a wedding. wasn't necessarily the trip of a lifetime for the family. So I kind of get it. But I should have held a little firmer because I was like, what are we doing? What is happening here? Anyways, it was good. It was a trip of a lifetime.\r\n\r\n\r\nMichael Girdley (03:23.78)\r\nWell, my wife is my wife is I mean, we're older now we have teenagers, but my wife was just such a similarly dedicated mom. She's just all in like 300%. So like, I was actually very aggressive about as soon as like it was possible, like the kids would go away to grandparents to hang out with them, like to give my wife separation from them. And we would do we started to do trips just to us all the time.\r\n\r\n\r\nand from a very young age and I don't regret doing that at all. and I know I know there's this whole like undercurrent in social media where like you need to be like super parents and you only have so many hours with your kids and all this kind of stuff but like I think as I look back on it I think I would have regretted doing that all-in parenting like all-consuming parenting that a lot of people want to do.\r\n\r\n\r\nAnd there's a lot of pressure on us to do it because you don't feel like you're a good parent unless you're all in you're going to every soccer game and all this kind of stuff, but like I don't know if you've looked at the stats, but there was actually there's actually people have studied how many hours people spend parenting now versus say like the 1960s and 1970s. Have you looked at these numbers? It's crazy. So don't I need to look them up because I didn't come prepared to quote these but it's something like\r\n\r\n\r\nThe average parent would spend 15 hours a week parenting back in the 1950s and 1960s. And today it's like 50, like just something, some ridiculous number. And, you know, as I've watched the amount of just mass media influence on you and me to be, what does it take to be a good parent? Well, you have to have every device. You have to have every like bottle warmer. You have to be at every single thing. And if you don't do it, you're a bad parent.\r\n\r\n\r\nNikolas Hulewsky (04:48.741)\r\nmy gosh.\r\n\r\n\r\nMichael Girdley (05:05.88)\r\nAnd like, there's so many people trying to sell us stuff as parents and they're like, yeah, like you need to be spending, you need to be killing yourself or you're not a good parent. And to me, it's like, wow.\r\n\r\n\r\nNikolas Hulewsky (05:17.141)\r\nMy wife is exceptionally bright. She was adjunct faculty at USC. She taught at the dental school. And we're fortunate enough where she's been able to be a stay at home mom for the last few years. But the biggest unlock over the last, I would say two years, and most people are going to roll their eyes at this, we got a tennis membership and she started playing tennis at the club. Like 12 hours a week, probably. Like a lot. It was a lot. And then we got cats.\r\n\r\n\r\nAgain, I know that sounds stupid. We've paid a stupid amount of money for these hypoallergenic cats. Those two things combined, I've just seen a marked difference in my wife. She's less stressed. She has more joy. I think vacations can be that as well. You need to make time for each other and doing things for each other that actually bring joy to each other. Not just, what the kids do today. Every day is just a debrief of what happened, the series of events.\r\n\r\n\r\nMichael Girdley (05:49.232)\r\nYeah\r\n\r\n\r\nMichael Girdley (06:10.276)\r\nYeah. Yeah. Well, that's, and I think that every therapist I've ever talked to, every like long time married couple I've ever talked to has said, couples need to have time to be couples rather than just partners and parenting. and this became really apparent to me when, you know, we had a kid with chronic health problems that went on for four years, right? We've been dealing with this. My son hadn't made\r\n\r\n\r\nWell, he's better now, so it's great. He had made a full week of school in four years, like post-COVID. So was just like a horrible time. And you look up at some point and you realize it's not like you have that beautiful time when you were a couple beforehand, right? When it's just you and you're just there, you're 100 % for each other. And then the kid comes and then it's easy for you to be 100 % parenting, right? As opposed to some couple still and some parenting.\r\n\r\n\r\nNikolas Hulewsky (06:41.399)\r\nOkay, all right.\r\n\r\n\r\nNikolas Hulewsky (06:59.288)\r\nMm-hmm.\r\n\r\n\r\nMichael Girdley (07:07.44)\r\nThen it gets even worse when it's just like, like now we don't even have time really to even think about being a couple because we're spending our times like as co-caregivers, right? Like, especially if a kid has chronic health problems or I've seen, I've had friends whose kids have passed away because of illness. Like you end up just going down this dark path where your relationship isn't really a marriage anymore. You're like partners in healthcare management. And like you want to talk, and if you look at people whose kids die or like get super sick,\r\n\r\n\r\nTo me, it's kind of a miracle when those parents and the marriage survives that. Like, if I see the marriage survive that, I'm like, okay, those people really had their shit together.\r\n\r\n\r\nNikolas Hulewsky (07:47.15)\r\nYeah, growing up, my twin sister is severely developmentally delayed. She passed away a couple of years ago. But yeah, my parents were caregivers essentially for the last 30 plus years of her life. So we had a son who passed away really young. And I remember thinking at the time, I don't know what's worse because caring for your child for such a long period of time is a burden in and of itself. It's a tax.\r\n\r\n\r\non your family and it's a tax on that child. Anyways, those are like weird situations to be in to even think about. What's worth? You remember you used to play like the would you rather game? Would you rather go to a Lakers game or a Celtics game? Those were fun. Then you get married and have kids and you're like, would you rather have a child with a chronic disease or you're like, well, I don't want to play this game. Welcome to parenthood.\r\n\r\n\r\nMichael Girdley (08:37.126)\r\nWell, it creates a thing, right? Where like when your kid is sick, like the whole world just grinds to a halt. And it's a funny parallel. I tweeted about it and then I deleted it. There was a guy who...\r\n\r\n\r\nappears to have had a fatal heart attack. He was sitting on the front row of the Memphis Grizzlies game the other night and just like, he just like crashed out. And you know, he went from just this beautiful privileged moment where you're like front rowed at NBA game, you're hanging there with your buds and and then it's all over. And it's funny how, yeah, it's funny how like life is like the card game spades, right? Like you're just there and then somebody's like, okay, here's the trump card. Like it just blows everything away.\r\n\r\n\r\nNikolas Hulewsky (09:14.637)\r\nGosh.\r\n\r\n\r\nNikolas Hulewsky (09:23.566)\r\nHope you didn't have anything else planned for the day because you just got a lawsuit.\r\n\r\n\r\nMichael Girdley (09:29.942)\r\nWhich which one the Memphis Gridley's are the guy who crashed out That Yeah\r\n\r\n\r\nNikolas Hulewsky (09:35.136)\r\nEither or, man. Jeez Louise, could you? That is just, that's, okay. Well, on that note, that was a good way to enter in her.\r\n\r\n\r\nMichael Girdley (09:45.146)\r\nWell, the big takeaway, the way, had, I'm sorry, I don't know if this is helpful to your audience or not, but the big takeaway, was sitting there looking at the video because somebody was shooting on a cell phone across the arena and you could see the outline of the guy on the ground. And it was clearly a man, either that or it was a woman with a very hairy chest. So it's clearly a man. And he had that look of just somebody who had not taken care of himself, like too much alcohol.\r\n\r\n\r\nNikolas Hulewsky (09:49.633)\r\nNo, I love it.\r\n\r\n\r\nNikolas Hulewsky (10:14.158)\r\nHmm.\r\n\r\n\r\nMichael Girdley (10:15.012)\r\nlike very big in the belly, just too much expecting too much of his body. And then the body eventually was just like done. And to me, it was just a reminder of how much we have an opportunity to invest in all of that. And it makes me glad that I'm health weirdo and stuff like that. So it is what it is.\r\n\r\n\r\nNikolas Hulewsky (10:32.322)\r\nYeah, knock on wood, knock on wood. all healthy. may have to talk. Anyways, I have a million things to talk about on that side. All right, I don't want to have a boring interview where I just have you rehash all of your wins and your fails and every story that you've already told 1,700 times. But I do want to give just a bit of context to the audience of who you are. So I'm going to go through some stuff and then you tell me what I missed just so we have some context here. Started out Alamo fireworks. You've grown that.\r\n\r\n\r\ncompany over time, it was a family business. I saw you're getting your son in on the action recently, which was really cool. He was working the fire, firework stand. You've invested in a, and had a company called Code Up, which was a coding bootcamp in Texas. You've done some real estate investments with dry line partners. You've had some venture funds, Red Runner Coffee, which I think you've divested, Dura Software, Nier, which is a staffing business, Scale Path, which is a CEO, Peer Network, and then obviously Gertling Media.\r\n\r\n\r\nDid I miss anything in there that was major that you're like, hey, you didn't talk about my favorite thing, which was Bonzi Ball?\r\n\r\n\r\nMichael Girdley (11:36.07)\r\nWell, there's a top secret project that I teased you about that we can't talk about yet, but we'll get there. But no, that's it. mean, in general, what I do is these days, like I incubate businesses and then I support them by being a board member and hopefully not having to come in and run them at any point. So.\r\n\r\n\r\nNikolas Hulewsky (11:41.513)\r\nHahaha!\r\n\r\n\r\nNikolas Hulewsky (11:54.99)\r\nCan you give me an idea right now, size and scale? Like if you can't give me a revenue number, just number of employees or number of operations, just to give context to kind of.\r\n\r\n\r\nMichael Girdley (12:04.03)\r\nI mean, the big help was actually having the coffee business from an employee standpoint. Like people don't realize like how many people work at like a Chick-fil-A or a Dairy Queen. It's like hundreds. So I think when I counted it up, like across all the businesses, it was six or 700 people last time I counted it up. Let's say there's four or 450 people working at companies that I own these steaks in and have big chunks in. then, you know, there's\r\n\r\n\r\nNikolas Hulewsky (12:09.27)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (12:13.528)\r\nMm-hmm.\r\n\r\n\r\nMichael Girdley (12:31.75)\r\nYou know, I generally only count companies there where I have like a majority control or a big level of influence. You know, I'm sitting on the board, that kind of stuff. So, but yeah, that's kind of kind of scale number.\r\n\r\n\r\nNikolas Hulewsky (12:43.47)\r\nOkay, so 500 million.\r\n\r\n\r\nMichael Girdley (12:45.392)\r\nNo, no, 500 people. No, you're...\r\n\r\n\r\nNikolas Hulewsky (12:46.862)\r\nNo, no, no. me when to stop. A billion? Two billion. Oh my gosh, Michael, stop me. Three billion. What? Three billion? Holy. Inflation happens that fast. Here's what I'm curious about. You've had a ton of successes and you've had a ton of failures and you've been open about those things. It's 2025. AI is here.\r\n\r\n\r\nMichael Girdley (12:56.866)\r\nZimbabwean dollars\r\n\r\n\r\nNikolas Hulewsky (13:13.326)\r\nEverybody's talking about HVAC business, they want to roll up and how AI is going to eliminate every business position that you can think of. If you had to start over in 2025, how would you build a business or what business would you go after? How would you make your first million dollars?\r\n\r\n\r\nMichael Girdley (13:30.694)\r\nI would actually do it in a two-step process. this is entirely, the first step is entirely data driven. So let me give you this pitch and then you can tell me I'm stupid. So step number one I would go do is I would actually first and foremost, let's say I'm like a 22 year old straight out of school. I would go find somebody who is an entrepreneur that I really admire and I want to do what they're doing. And I would go figure out how to work for them for a year or two. And I would just basically,\r\n\r\n\r\ngo pitch people on, I want to do chief of staff for you. want to be whatever that role is that that can get you in the room, where you see the entirety of what's going on with a small business operation or somebody that's running the type of business you want to actually do in the future would be where I would start. So if that's you know, you want to run a real estate brokerage someday, or you aspire to sell widgets, or you want to run a media company, like go figure out how to get in that room and do that job first and foremost. And\r\n\r\n\r\nThe reason I say this is this is better than any MBA, this is better than any trial and error, this is better than any other way to actually go build the skills that you need to have to run a real business. Because school does not teach you this stuff. Even an MBA does not teach you this stuff. And so that's first, that step one I would do is I would actually, if I wanted to go get into business, I would actually go work for somebody who I would aspire to want to be somebody.\r\n\r\n\r\nNikolas Hulewsky (14:54.286)\r\nOkay. I agree with step one. That's kind of what I did. Are you familiar with the Enzyme Group? Have you ever heard of them? They're a big skilled nursing facility company, mainly in the Western United States. And the way that they operate is each one of these skilled nursing facilities is its own standalone business. And they have a CEO, they call them, in the facility. And they let the CEO run it like their own small business. They manage the P &L. They have full purview to make decisions.\r\n\r\n\r\nthat's where I got started. I didn't get started on the skilled side. I got started in home health and hospice, but I learned what a P &L was. I learned why collections were so important because we wrote off 10 % of our revenue in year one, right? So I agree with you. think getting experience is a fantastic way to start. All So that's step one, getting experience.\r\n\r\n\r\nMichael Girdley (15:37.018)\r\nYeah, well, and as part of that, like I would live super frugally, like I would figure out how like am I putting a few thousand dollars a month away, you know, aside for me to be able to go work on step two, right? Because\r\n\r\n\r\nNikolas Hulewsky (15:50.926)\r\nyou just be putting cash or would you like, okay, I'm going to take that money and put it in an index fund or I'm going to put it into Tesla stock? Like, are you risky with it or is it very safe?\r\n\r\n\r\nMichael Girdley (15:58.628)\r\nI think, yeah, you know, I mean, look, you can put it in crypto if you want. It's your money. Do whatever you want. But, know, I think for me personally, you know, it's important to understand.\r\n\r\n\r\nA certain level of cash in the bank for you as an individual provides you optionality and a ton of safety. And that optionality is, I could go six months without having to work, and I could live off my savings. The other end of the spectrum of the impact of that, just it being in cash and very safe, is it changes your mindset in terms of how you can think. Let's say you only have two months of savings saved up.\r\n\r\n\r\nthat really hurts you in terms of being able to think long term, which is what you want to be doing when you're an entrepreneur. So I'm a big fan of, look, put a year salary or work towards a year salary if you can, or years living expenses in the bank somewhere. And then you have that and it unlocks this like so many new things that you so many different things that you could actually do in terms of business opportunities. But secondarily, it also changes how you think about the world and how you view the world by being able to open up your bank stamp being like, yep.\r\n\r\n\r\nIf nothing else happens, I know I could just sit at my house for the next six months and I'm gonna still have another six months worth of money left over. So that gives me a lot of freedom to pursue ideas and be comfortable and sleep really well.\r\n\r\n\r\nNikolas Hulewsky (17:18.798)\r\nOkay, so step two, what's step two? Step one, you've got experience, you feel safe, you got some cash, what's step two?\r\n\r\n\r\nMichael Girdley (17:20.624)\r\nStep two.\r\n\r\n\r\nMichael Girdley (17:24.902)\r\nStep two, okay, so this is an opinion. I would not go buy a business at this point. I would not do that. If I was to, no, no, no, no. Not as your first, like I'm this person, this 22 year old, this fictional person who has just worked for a boss for a year or two. I would go start some sort of services business with very low capex. Like I would not go take a big PG at this point to go buy a business.\r\n\r\n\r\nNikolas Hulewsky (17:33.205)\r\nReally?\r\n\r\n\r\nMichael Girdley (17:53.71)\r\nI would go try to do what's worth, there's a ton of demand right now, which is basically like some sort of digital services business, some sort of staffing business, something like that, that is B2B services. I could start with very little money and it'll cashflow very quickly.\r\n\r\n\r\nNikolas Hulewsky (18:09.358)\r\nI know if you've heard this though, but you can buy a business with zero money down, Michael. Have you not heard this?\r\n\r\n\r\nMichael Girdley (18:14.406)\r\nOh, really? how much it turns out, it turns out, and this is something I tell people, if you are going to personally guarantee a loan or personally guarantee anything like that via SBA 7A or whatever, or personally guarantee something to a bank, you should just mentally picture yourself taking that money out of your pocket and giving it to, you know, giving it to the other side to invest in it. And then when you do that, you should also realize\r\n\r\n\r\nto pay that money back, you're gonna have to earn that many post-tax dollars. So in most businesses, you have to pay taxes. In most countries, you have to pay taxes, including ours. I don't know if you're aware of this. You're gonna, you're gonna, man. So it's not only do you have to pay that amount of money back, you have to pay it back plus the amount of taxes you're have to pay when you earn it. So it's like, oof, like.\r\n\r\n\r\nNikolas Hulewsky (18:53.336)\r\nI'm not, I don't believe in taxes, it's theft.\r\n\r\n\r\nMichael Girdley (19:09.029)\r\nPG, you should treat a PG like I'm just taking out of my pocket, which that's what's going on with these seven, know, SBA 7A loans. And I don't, I don't think a lot of people look at it that way.\r\n\r\n\r\nNikolas Hulewsky (19:16.515)\r\nWow.\r\n\r\n\r\nWhat's interesting is I, I fall down these rabbit holes where the algorithm starts to find what I like. And so on Instagram in particular, I get a bunch of gurus and a bunch of people who are like, I'll show you how to buy a business with zero money down, no personal guarantee, no loan. You'll be cash flowing $50,000 a month within three weeks. And just cause it's like, it's like looking at a car wreck for me. It's like so fascinating. Like how do they\r\n\r\n\r\nMichael Girdley (19:41.796)\r\nWell, those are big information, those are big data businesses, information businesses, right? In the top corner, probably says sponsored, because those folks are selling courses and meetups and all that kind of stuff.\r\n\r\n\r\nNikolas Hulewsky (19:49.39)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (19:59.02)\r\nYeah, their money, quick, a quick tip to anybody. If somebody's business is selling you the idea of business, you are the product. It's a scam. I mean, it's not always a scam, it's anyways, buyer beware, buyer beware in those instances.\r\n\r\n\r\nMichael Girdley (20:12.23)\r\nIt's an interesting thing, right? Because I did and then I retired from doing a couple courses, mostly because the topic that I did, which was holdcalling, was just so niche that I didn't see a way where I could ever get paid if I wrote a book and it sold 3000 copies. Like I was just like, I don't know why I would bother with this. you know, so I did a course. But you're right, like it is just one of the weird things about\r\n\r\n\r\nlike courses in general, which is no matter how much you approach it with high integrity and trying to give people high value, like people look on paid online courses just negatively. Whereas writing a book is totally okay. Like that's fine. But paying doing a paid course is not cool.\r\n\r\n\r\nNikolas Hulewsky (20:56.686)\r\nI don't get it. I really don't get it. It's like you'll pay hundreds of thousands of dollars to go to college. Why would you not, why would I not pay money to have a course taught by Michael Gertling? Like you've done some really impressive things and your course isn't like, I promise you no money down, no personal guarantee, no like, no, it's not, you're not over promising all of these things. Like your eyes wide open, hey, this is what I'm teaching you. I think that's perfectly fine. But these, these\r\n\r\n\r\nMichael Girdley (21:06.916)\r\nYeah.\r\n\r\n\r\nMichael Girdley (21:22.266)\r\nI felt like I, yeah, in my course I felt like I spent half the course telling people not to do a whole co. I was like, don't do this. This may not be for you, don't do it.\r\n\r\n\r\nNikolas Hulewsky (21:32.43)\r\nbest course. But you dissuaded a lot of people from losing a lot of money. It's fantastic.\r\n\r\n\r\nMichael Girdley (21:33.83)\r\nSo, so here's the sorry to keep going on this, because I've thought about this a lot, because there's a lot of haters about courses out there. Here's why, you know, when I looked at courses, and the business of being in courses, I was like, okay, like, this isn't what I want to do long term, was when I got it out there. And I saw a few people made it all the way through and took the stuff. And then those fewer, even fewer number of those people took the stuff and put it into practice.\r\n\r\n\r\nAnd then I started to look at the numbers. I was like, this is weird. I started looking at the numbers of people who actually finish courses. And it's like 80 % of people never even finish the courses they buy. Like they spend all this money and they never even finish the course. yeah, yeah. So to me, that was this thing where I was like, like I'm doing this course, kind of the reason I like write stuff on social media or I do videos or whatever, which is like, I want to help people and then\r\n\r\n\r\nNikolas Hulewsky (22:16.397)\r\nReally?\r\n\r\n\r\nMichael Girdley (22:31.46)\r\nI want to bring in a little cash because I have 10 people like helping me produce stuff, right? Like it comes out of my brain and then there's a machine that like produces content. And that's how I can produce a lot of content and not spend much time on it each week. And, and I said, look, I'm doing this because I want to help people, but there's something about the course model and the delivery vehicle that just isn't effective. Like it isn't helping people like I want to be helping people. And so there's got to be like better, there's got to be a way to create better relationships with people than the way the\r\n\r\n\r\nkind of creates a relationship with the buyer's moment.\r\n\r\n\r\nNikolas Hulewsky (23:05.55)\r\nDo you know who Jason Calcanis is?\r\n\r\n\r\nMichael Girdley (23:08.217)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (23:09.422)\r\nSo he has, I think it's called Founders University is what it's called. And you can apply to it and you have to pay, I don't know what the number is. Let's just call it a $5,000. You have to pay $5,000, but the 5,000 is fully refundable if you complete the course. And Chris and I have toyed with this idea of like, hey, let's do something and we'll fully refund it if you complete these steps, because you know that a certain percentage you're not going to complete it. But I don't know, it kind of creates this\r\n\r\n\r\nsocial contract beyond just I paid the money. There's like this incentive where you can actually get the money back that I think is interesting. Anyways, that's just an idea if you ever wanted to try that.\r\n\r\n\r\nMichael Girdley (23:50.212)\r\nYeah, yeah. It's a fun idea. Like I've, I've toyed also with the idea of doing kind of in-person educational events, right? Like I think those seminars, and I think there's two reasons I like that. One is it just feels much more personal versus doing an online course, which just is like, hey, I published this thing and then you never really develop relationships with people. And it's, it doesn't feel like you're providing that much more of an improved life for people. Cause it's just, they're just digital bits downloading your thing with credit card numbers.\r\n\r\n\r\nNikolas Hulewsky (23:58.285)\r\nMm-hmm.\r\n\r\n\r\nMichael Girdley (24:20.23)\r\nBut I think secondarily, those kind of in-person learning events, I suspect they are a lot more effective because when you put somebody in a room and there's a bunch of peer pressure and there's 15 or 20 other people there, like they're gonna pay attention and hopefully get something out of it. The same way live lectures, live schooling is much better than virtual.\r\n\r\n\r\nNikolas Hulewsky (24:33.837)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (24:39.938)\r\nI was going to wait to talk about this, this is like a perfect segue for it. Is that why you launched Holdco conference?\r\n\r\n\r\nMichael Girdley (24:46.25)\r\nso yeah, we, well, frankly, the reason was of conferences I would go to every year was like one or two, like I've got a very few conferences and you know, John and Kelsey who had been running it, their lives had gotten pretty busy and they came to us and said, Hey, like we need to keep this thing going and we need a partner to do that. And the primary motivation was frankly sadness. Cause I was like, I really enjoyed this. I, I like\r\n\r\n\r\nthe idea of it like going away and then not existing anymore when I liked it so much, even though the conference last year was in Cleveland, like they had it in Cleveland last year. And we're doing it in Utah. Cleveland wasn't too bad. But that was the primary motivation. But frankly, like the people that are doing the kind of parallel entrepreneurship path that I'm doing, there's, you know, there's a small percentage of the total population of people that are\r\n\r\n\r\nNikolas Hulewsky (25:25.432)\r\nThat's a place.\r\n\r\n\r\nMichael Girdley (25:41.838)\r\nentrepreneurs, and then there's a smaller percentage of those that want to do it in this fashion, and getting them together in a room together and kind of talking about the challenges. And some of the speakers we have, by the way, like, like I didn't have an awesome year in 2024. I talked about it, some on social media and but like there's other speakers who are just like, yeah, like\r\n\r\n\r\nhere's some opportunity to learn from lessons of what happens if like things go wrong for you. And here's what happens if multiple things go all go wrong at the same time and the lessons they learned from those. you know, I think that creates just a powerful, like kind of real environment where people can be themselves, you know, face to face in a conference like that. And, you know, I'm excited about it happening, happening this year.\r\n\r\n\r\nNikolas Hulewsky (26:22.894)\r\nI talk about this often, but I think failure, obviously failure is one of the best teachers. But I think about people, do remember the Fyre Festival? Okay, so for those who don't know, so for those who don't know, there's this thing called the Fyre Festival and this guy, Billy, I think is his name, he'd had all these successes leading up to this and he announces this festival and is like a very fake it till you make it type of entrepreneur, right? It's like, hey, we're having this festival, it's gonna be in the Caribbean. He's like, pre-sells all of this stuff.\r\n\r\n\r\nMichael Girdley (26:33.722)\r\nYeah. That dude's awesome.\r\n\r\n\r\nNikolas Hulewsky (26:52.532)\r\nHe's trying to get the logistics together and he never had anybody telling him really no. He thought, can overcome any challenge that gets in front of me. He gets to the end and the crap hits the fan. It's a total disaster. People show up, there's no lodging, there's no food. The travel is a nightmare. It's a disaster. I think he went to jail for fraud. can't. Okay. But.\r\n\r\n\r\nMichael Girdley (27:07.611)\r\nRight.\r\n\r\n\r\nMichael Girdley (27:17.402)\r\nHe did. Yeah.\r\n\r\n\r\nNikolas Hulewsky (27:22.144)\r\nI can empathize with him. I'm like, see that in like, I'm not saying I would do it, but I see the fake it till you make it. It's like, hey, yeah, you gotta kind of put yourself out there. There are some risks that you have to take. Like I could see a scenario where you're like getting to a place where you kind of convince yourself. And I think the main difference is he had never had a real experienced a real failure before that. He'd always figured out, you know, some scammy way or some way around it. And unless you experience failure,\r\n\r\n\r\nYou don't see the yellow flags that are like blaring in your face until it's too late. And then like, so the level of his failure was catastrophic, right? I mean, it was just on a scale. You want to be able to fail when you have the stakes are smaller. And I think you talking about bringing people together to the whole co-conference to hear people's not only wins, but also their fails is just really valuable to hear a couple of people at a step, five steps ahead of you that are like, be on the lookout for X, Y, and Z.\r\n\r\n\r\nMichael Girdley (28:18.992)\r\nYeah, and I think it's also, it should give people just a level of kind of calmness to when you're, you know, from the outside, like everybody's social media, everybody's life looks like this thing that's just going like amazing and it's all W's and there's nothing wrong. And, you know, I was in, I was in therapy when I was talking to a psychiatrist and it a few years ago. And, you know, I started to, I started to tell them,\r\n\r\n\r\nthe, you know, like, well, you know, I feel bad about this because I was doing the comparison to other people, right? these other people type stuff. And then I saw the look on the psychiatrist's face and I was like, but, and I said, but Mr. Psychiatrist, they have their own problems too. And everybody's, you know, the grass is not greener. Everybody is living their own personal tortures. And you just shouldn't assume, assume you're special because we all are going through this. So.\r\n\r\n\r\nNikolas Hulewsky (29:10.839)\r\nyou\r\n\r\n\r\nMichael Girdley (29:12.91)\r\nAnyway, me going to psychologist or psychiatrist pretty fun because I just spend half the time like self diagnosing myself and talk to myself.\r\n\r\n\r\nNikolas Hulewsky (29:22.002)\r\nThat's what I've noticed about a lot of things. Whether you're negotiating with somebody, whether you go to a psychiatrist, they're just like asking you questions and you're just verbal vomiting and kind of coming to your own epiphanies. At least that's how I'm a, you know, I'm a verbal processor as well. Man, that's a skillset.\r\n\r\n\r\nMichael Girdley (29:30.086)\r\nRight.\r\n\r\n\r\nMichael Girdley (29:37.702)\r\nWell, yeah, yeah, well, I'm a nerd about human psychology. But I think Billy from Fire Festival, I think it's a weird thing where he's actually, my impression of him, he's actually a good person. There is just something where he's lacking self-awareness totally, right? Where he's just like this picture of the world, he just can make it totally different. he's doing Fire Festival too, I don't know if you've noticed it.\r\n\r\n\r\nNikolas Hulewsky (30:04.908)\r\nYeah. Yeah.\r\n\r\n\r\nMichael Girdley (30:07.202)\r\nAnd look, the guy could be evil, in my heart, I tend to try to think people, even the sociopaths and the psychopaths, I try to hope they're good people. But yeah, he's back at it again, doing Fire Festival too. Jow rule is not involved this time though. So I'm out.\r\n\r\n\r\nNikolas Hulewsky (30:20.17)\r\nNo jaw roll. Okay. I'm out. Baby. I, yeah, I'm the same as you. That's why I kind of sympathize with him. was like, yeah, until you've been in some crappy scenarios, you don't really understand how someone could get to that point. But then you're like, okay, I could kind of see a series of events where you build something up to, to convince yourself that it's going to be successful because you want to project this\r\n\r\n\r\nMichael Girdley (30:24.782)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (30:48.736)\r\nImage of strength. yeah, it's going to happen. Let's fake it till we make it. And then you just freaking eat it.\r\n\r\n\r\nMichael Girdley (30:54.362)\r\nWell, the weird thing is, like you look at the extremes of like Theranos and stuff like that, like a conference to some extent, there is a, I don't want to say fake it till you make it, but there's like a boiling, there's a, you're creating a marketplace here, right? So it's like, you have to talk a few people into showing up and being speakers and those have to be good speakers. And they're kind of trusting you that you're going to do the other side of it, which is we're going to bring some good attendees and there's going to be a good audience there. then,\r\n\r\n\r\nThey audit the attendees are trusting you that the next step is going to happen once you're going to find a great venue and then more speakers are going to come and all this kind of stuff. So like that's OK. Like that's the way the thing works where the figure so you make it people there knows or fire festival whatever go wrong is if there's some point where like you are not going to be able to like maintain all those social contracts and like literal contracts are doing with people that's where you have to step up and just be like OK we can't I can't do this anymore and I need to pick up the pieces and.\r\n\r\n\r\nNikolas Hulewsky (31:24.834)\r\nMm-hmm.\r\n\r\n\r\nMichael Girdley (31:51.172)\r\nyou know, eventually, you know, hopefully you're one of those people who just steps up and owns it. And then other times there's situations where frankly, just like people go too far and you end up with Aaronos.\r\n\r\n\r\nNikolas Hulewsky (32:01.774)\r\nSo I'll be at the whole co-conference this year. It's in Salt Lake, it's in my backyard. I'm stoked to be there. One of the things I like about it is that you're prioritizing activities. And this is a bandwagon that I've, or the drum that I've been beating for a long time. I want to host a conference called the Anti-Conference where we have maybe one speaker a day, but the whole conference is dedicated to facilitating relationships. Pickleball tournaments, ping pong, painting, improv, cooking classes. Because for the most part, like,\r\n\r\n\r\nMichael Girdley (32:05.296)\r\nLet's go.\r\n\r\n\r\nNikolas Hulewsky (32:29.922)\r\nYou've been to a lot of conferences. Where do most people hang out? They're like in the lobby or the foyer having conversations. That's where the stuff happens anyways. So I like that you're building that into the whole co-conference, like facilitating those relationships.\r\n\r\n\r\nMichael Girdley (32:33.296)\r\nYep. Yep.\r\n\r\n\r\nMichael Girdley (32:42.802)\r\nIt is a conference being run by introverts. So like that's pretty good. If you're an introvert, it's gonna be good. So two thoughts for you. When you do your own conference, by the way, we should totally start figuring out how to make this happen. Number one is, have you ever been to an unconference? Are you familiar with that format? Okay, so here's how an unconference works. They're not as common as regular conferences, but they're really cool. So basically an unconference takes all the things that you do in a conventional conference and it throws them on their head. So a normal...\r\n\r\n\r\nNikolas Hulewsky (32:46.953)\r\nHahaha\r\n\r\n\r\nMichael Girdley (33:11.44)\r\nconference, you curate who the speakers are, and then you let attendees sign up. What you do in an unconference is you curate the attendees and you don't worry about who the speakers are going to be. In a normal conference, you curate what your agenda is going to be and you have these big one to many kind of things. In an unconference, the attendees all show up and they propose the topics to happen based on the slots that you have. And then the topics get voted on.\r\n\r\n\r\nand led by whoever proposed it. And so people just vote with their feet and go to talk about whatever is on their mind. So it basically just takes the idea of the hallway conversation that is so cool and makes that the entire conference. And it's called an unconference. Yeah.\r\n\r\n\r\nNikolas Hulewsky (33:47.286)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (33:57.144)\r\nI love that. The uncomf- Why don't we have one of those for the like SMP space?\r\n\r\n\r\nMichael Girdley (34:02.022)\r\nThe world is waiting on you to organize it.\r\n\r\n\r\nNikolas Hulewsky (34:05.89)\r\nHere's the problem, and I know you know this problem. I know how much work it would take to do it, and I'm like, it's a good idea, I don't wanna do it. It's too much.\r\n\r\n\r\nMichael Girdley (34:13.414)\r\nit's scary to write like you like where we are right now. We hit for whole co-conference. We hit the, okay, we're going to break even like all of our expenses are going to be covered point. But before then, you don't know if you're going to lose money because you have to like before the conference gets announced, all this type of stuff, you have to like book hotel rooms like a block and they they're like, send us $50,000. So like it's nerve wracking as well.\r\n\r\n\r\nNikolas Hulewsky (34:36.545)\r\nmy gosh.\r\n\r\n\r\nI had a guy on the podcast. does lantern festivals and music festivals. So literally the lanterns where you're like lighting them on fire and they float away. And I think it's like a $10 million. It's like a $10 million business. So it's successful. But he was telling me he's like 50%. They hold 50 % of the tickets in reserve knowing that people aren't going to buy them that early so they can charge sort of surge pricing, I guess, if you will. But yeah, they don't know until pretty close to the launch of the event date.\r\n\r\n\r\nhow profitable they're going to be. think that is a crazy, yeah, that would be a crazy business model to do the first time. Maybe like in subsequent years when you have some data, you can get a little more confidence, but that would be scary.\r\n\r\n\r\nMichael Girdley (35:20.698)\r\nAll right, let me pitch you on this business, because I know you guys are nerds about businesses, you and Chris. We may need to edit this part out while I'm Googling stuff. Yes, but here's how it works. It's super interesting. Lightscape.\r\n\r\n\r\nNikolas Hulewsky (35:29.838)\r\nIs it an events business?\r\n\r\n\r\nNikolas Hulewsky (35:39.886)\r\nBecause I am here, I'll let you look, I am like in on events businesses. I think post COVID people want to get together. Like they realized, yeah, working with at least cool, but I actually like other humans. So I don't think it's just a short term bump. I think people really enjoy getting together, exchanging ideas in person. So I love in-person events.\r\n\r\n\r\nMichael Girdley (36:02.928)\r\nOkay, so here's how this business works. So I don't know if you have this, here in San Antonio, every year our botanical gardens puts together one of these, like you show up, you get a drink and you walk around, there's like holiday lights everywhere. And it's beautiful in San Antonio in winter, so everybody's outside. So the way the business actually works is the botanical garden partners with a Chinese company.\r\n\r\n\r\nthat is located here the United States in Chicago, that basically has all these lantern festival like installations, and there's like butterflies and all this kind of stuff. And I'll pull up some photos of what this looks like. So basically, the the way it works as a partnership, like the Chinese company comes into a venue like the Boise Botanical Garden, right? And then they go and like install all these lights there, get them working, because I was looking at the installation, was like, this is all like Chinese metalwork, like it looks\r\n\r\n\r\nlike just like stuff made in Shenzhen somewhere. And basically what they do is they then take that and the botanical gardens or whoever it is, like they get all of the food purchases, the hot chocolate, all this kind of stuff. And they get to keep 100 % of that, the concessions and all that stuff. And then basically the Chinese company\r\n\r\n\r\nNikolas Hulewsky (37:20.311)\r\nsessions.\r\n\r\n\r\nMichael Girdley (37:27.974)\r\ntakes half of the gross for tickets and you pay 50, 60 bucks to go through just for coming and installing these things. But the Botanical Garden or whoever it is, a venue, they do all the work. Just a fascinating business. They do hundreds of these around the US. I was like, how do I know this is a Chinese company? Because they have a Chinese name, even though they're in Chicago.\r\n\r\n\r\nNikolas Hulewsky (37:51.062)\r\nIs it called like best people's company?\r\n\r\n\r\nMichael Girdley (37:53.51)\r\nWe can put, I'll send it to you. We can put the name in the comments. I don't think so. Cause they're printing money. I don't think that, I just thought it was the awesomest business model. Cause like what's genius about it is they don't have any sort of like high capex. Like they have the stuff, right? They don't have to own the botanical garden. don't have to do any of the hassle.\r\n\r\n\r\nNikolas Hulewsky (37:56.087)\r\nIs it for sale?\r\n\r\n\r\nNo, no, no, no. Okay. Okay. You just, you just love the business model.\r\n\r\n\r\nMichael Girdley (38:16.229)\r\nof like selling getting a liquor license or that stuff. Like they just show up and install this stuff. And then they have just like one like Chinese American dude like hanging out making sure it doesn't break each night. And like, like it's just like a total like genius thing.\r\n\r\n\r\nNikolas Hulewsky (38:29.87)\r\nThey're just piggy. Yeah, I Chris and I love these types of models where they're just piggybacking. They're like, you already have the infrastructure, the botanical gardens. Great. Here we have this thing that we can tack onto it piggyback off of you.\r\n\r\n\r\nMichael Girdley (38:42.244)\r\nThis is it. Yeah, this is this.\r\n\r\n\r\nNikolas Hulewsky (38:44.78)\r\nI would have never guessed this was Chinese.\r\n\r\n\r\nMichael Girdley (38:47.834)\r\nReally? when you walk up to it, it's like, okay, cool. was like, really? But none of it is actually holiday stuff. It's all like generic Chinese lantern festival stuff. That's somebody skiing. somebody edit that one out. Yeah, there's me. Yeah, there's me and my family. Yeah, it's pretty cool. But yeah, just like such a cool business.\r\n\r\n\r\nNikolas Hulewsky (38:48.974)\r\nThat was sarcasm. That was sarcasm.\r\n\r\n\r\nNikolas Hulewsky (38:58.936)\r\nto do that.\r\n\r\n\r\nNikolas Hulewsky (39:03.562)\r\nwell, okay. There's some TikTok videos. We'll edit these ones out. Looking good, my wow.\r\n\r\n\r\nMichael Girdley (39:15.302)\r\nBut how they found the niche, because the pain in the ass with these kind of like holiday businesses and stuff like that is like, you got to go buy the land and you got to these expenses over and these guys are like, no, no, we're just gonna let the botanical gardens like handle all of that. And they just show up and do the lights and then take a percentage off the top.\r\n\r\n\r\nNikolas Hulewsky (39:24.054)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (39:31.31)\r\nSo Spencer is his name, Night Lights Event is what it's called, Night Light Events. Part of the hassle is, you know, they have to get all of the permitting from the local governments. They do a lot of these in the West Coast. And so they're like, yeah, when we release the lanterns, we've got to get not only the permit to do that, but then we've got to clean it up. There's a lot of organization. And then they're like putting on the music festivals themselves, right? So they're organizing the events as well. What you're describing is more of, like I said, the piggyback of, okay, what are...\r\n\r\n\r\nMichael Girdley (39:42.766)\r\nyeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (40:00.308)\r\ncould go pretty easily and find these markets that have cool botanical gardens and just say, during Christmas time, this is what we can provide to you and sell them through that distribution model. That's super interesting. How did you find out the economics of the business?\r\n\r\n\r\nMichael Girdley (40:03.088)\r\nGreat.\r\n\r\n\r\nMichael Girdley (40:15.715)\r\nI started to ask her how when I was at the event. I was like how does this work? I was like I go to every ask and like the manager\r\n\r\n\r\nNikolas Hulewsky (40:17.432)\r\nJust ask it around. That's amazing.\r\n\r\n\r\nOkay, so let's say this business, would this be the profile of a business like circling all the way back? Would this be the profile of a business that you would be, hey, you're 22, 23, you have some experience. This might be something you should look at or is this too CapEx heavy?\r\n\r\n\r\nMichael Girdley (40:37.254)\r\nI think this is way too capex for my first business. And actually to be very, you know, I was very generic about saying like I would do a low capex B2B services business. Like it could cashflow week three. Like to be even more specific around that, like I would go into something around staffing, right? Staffing and recruiting. like there, if you look at what's going on in the U.S. and globally, like,\r\n\r\n\r\nstaffing and recruiting is going to continue to grow as a business for the foreseeable future, right? Demographic trends are in your favor. People aren't having kids, there aren't that many workers. The economy is still really good. And the types of workers that people need are somewhat specialized. like recruiting and staffing, like that's where I would start. And the good thing about that is you can start like cash flowing a business like that within a few months, if not sooner.\r\n\r\n\r\nNikolas Hulewsky (41:26.05)\r\nYeah, one of the frameworks I like to look at, I think the safest way to get into entrepreneurship is through an agency. And it's developing some type of specialized skill set, whether it's, you know, SEO, running paid ads, staff, whatever it is, and then building a business around you as the person. And then as you scale, you start either expanding into other offerings or you just, you know, niche down and you bring other people on to make yourself more efficient. I definitely think that's the safest way to get into entrepreneurship. That being said,\r\n\r\n\r\nI do think that if you have some experience, so like my background, I worked in healthcare, I don't know, 10 years, and then I bought a healthcare company that was similar to the businesses that I was operating. I thought that was the best thing for me because in order to get started from scratch, it would have been fairly costly. Do you think there's an avenue for people to go that way? Like, hey, maybe don't just work for a year, maybe work somewhere where you get an even better skill set.\r\n\r\n\r\nMichael Girdley (42:13.168)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (42:24.438)\r\nand then buy a business or are you like you would never buy like are you like never buy.\r\n\r\n\r\nMichael Girdley (42:29.926)\r\nNo, no, I mean, I've bought businesses, I've sold businesses, like I'm totally in favor of that. Yeah, For your first, I would tend to recommend against it. And we're talking about this like 23 year old, like my first business person who's worked for a couple of years, a couple of years out of college. why take that big of a risk early on? Like you want a sandbox where you can, you know, deal with the failure if you have to go through it.\r\n\r\n\r\nNikolas Hulewsky (42:34.604)\r\nI just mean for your first. Like if you're going for your first business.\r\n\r\n\r\nMichael Girdley (42:55.608)\r\nI wouldn't buy one at that stage. Now, I think your case where you went through and developed industry expertise and all that kind of stuff that was right away, like I'm with you. Like there's, that's not wrong, but like for a 23 year old to go put a $5 million PG on some business they don't know anything about, like, and you don't know anything about business and you're still basically, your brain is still developing. That's a, that.\r\n\r\n\r\nNikolas Hulewsky (43:17.038)\r\nYour prefrontal cortex is even fully formed and you're signing a PG. That's good.\r\n\r\n\r\nMichael Girdley (43:22.022)\r\nYeah. Yeah. I mean, stops, you your brain stops developing at 25. So like, you know, throw yourselves a bone here.\r\n\r\n\r\nNikolas Hulewsky (43:31.746)\r\nWhat do you think are the most overrated businesses, opportunities right now, or the ones people are talking way too much about?\r\n\r\n\r\nMichael Girdley (43:40.678)\r\nCan I have 30 seconds to go pee? You're taking me? Alright, I'm an old man.\r\n\r\n\r\nNikolas Hulewsky (43:42.808)\r\nDude yeah, go pee. Of course.\r\n\r\n\r\nHahaha\r\n\r\n\r\nMichael Girdley (44:57.158)\r\nAll right, overrated businesses, I was just thinking about. Anyway, we're good.\r\n\r\n\r\nNikolas Hulewsky (44:58.168)\r\nHey. Hey.\r\n\r\n\r\nThat's really what you need 30 seconds for, is to think about the question. Yeah, what do you think – No, I know. I'm just kidding. What do you think is the most overrated, I guess, businesses that people are talking about right now, or the most overrated thing?\r\n\r\n\r\nMichael Girdley (45:04.846)\r\nNo, no, I really had to pee.\r\n\r\n\r\nMichael Girdley (45:14.534)\r\nThe thing I think is screwed in the future, and I'm happy that it's screwed, is this like enterprise ERP accounting software. I don't know if you've been an Oracle customer, it is the absolute worst. And every time there's a new version of Chat GPT comes out or whatever, I'm like, I cannot wait until this puts Oracle in a bind. Because you can see where this is going, like software.\r\n\r\n\r\nsoftware is going to have to figure out how to adapt to a world of AI. And I think it's going to be really interesting to see at some point, you'll you can already see where you're just like, hey, give me a give me a clock countdown iOS application. I think it just like spits it out for you, right? Based on what's commonly wanted and something like that. Like, it's not that far from there to like something that's going to be 95 or 98 % as good as NetSuite or our QuickBooks. And\r\n\r\n\r\nNikolas Hulewsky (45:41.848)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (46:10.222)\r\nSo I have an idea on this. So I agree with you. think that because it's getting so much cheaper to actually develop these products, you're going to be able to develop customized solutions that blow whatever you're currently paying for out of the water. Chamath from the All In Podcast, he has a company, I think it's called 8020 or 9010 or something like that, where the thesis is 90 % of the functionality for 10 % of the cost. Anyways, I kind of have an idea. I'm wondering what you think of this.\r\n\r\n\r\nMichael Girdley (46:10.694)\r\nI cannot wait for that moment.\r\n\r\n\r\nNikolas Hulewsky (46:39.15)\r\nIt's not fully formed. It's preformed. The cortex hasn't fully formed. I wonder if some of these large organizations are going to turn into GPOs. Are you familiar with GPOs like group purchasing organizations? These are pretty common in healthcare. So they're a group purchasing organization where it's like, we get all these disparate companies together and they come together and then we pool their buying power and we're able to negotiate lower pricing on supplies or whatever. I wonder if, let's say,\r\n\r\n\r\nMichael Girdley (47:02.982)\r\nGotta go.\r\n\r\n\r\nNikolas Hulewsky (47:06.926)\r\nSalesforce becomes a sort of GPO for just individual mom and pop organizations who want to have cheaper compute. Because you're going to have to pay for the compute. You're going to have to pay either on a per token basis or an energy use. I don't know what it's going to be. So if you could pull those people together, you're going to be able to negotiate essentially lower pricing for the thing that's going to become the most valuable, which is power, Like compute power to actually process all this stuff in the background. So I wonder if they transition into sort of these group purchasing organizations as opposed to\r\n\r\n\r\nthe service offering that they have now.\r\n\r\n\r\nMichael Girdley (47:38.212)\r\nYeah, I have to think about that. I haven't thought much more about it other than I can't wait for Oracle to get a punch in the face.\r\n\r\n\r\nNikolas Hulewsky (47:44.302)\r\nOther than you can't wait for it. All right, that's fair. That's fair. Okay, here's my last question for you. What do you think is one thing about business that most people get wrong?\r\n\r\n\r\nMichael Girdley (47:58.628)\r\nMost people get wrong.\r\n\r\n\r\nNikolas Hulewsky (48:00.83)\r\nWhat's a contrarian belief that you have other than don't buy your business for your first business?\r\n\r\n\r\nMichael Girdley (48:05.126)\r\nI don't know if that's a contrarian. It's contrary to the people that want to sell you on buying a business, which look, I have a podcast on buying businesses. think it's super fascinating, but I'm not going to sit here and tell you that everybody should do that. I mean, the thing that gets me the most mad to read is when people are pooping on somebody being a 1099 or a W2 or a business owner or a hold co-owner like,\r\n\r\n\r\nLike that's right or wrong. And all of those are right for somebody. And to hear somebody be like, hold cows are stupid. By the way, they do say that and they say it to my face, which, you know, that's a sign of something. Or to say that, you know, one path in life is right or wrong. I think that fundamentally translates into a broken view of business for a lot of people. Right. And if somebody wants to go\r\n\r\n\r\nNikolas Hulewsky (48:36.226)\r\nHmm. Yeah.\r\n\r\n\r\nMichael Girdley (49:00.998)\r\nwork a W-2 job or be a high powered executive or get into P.E. and be an associate there. Like, who are you or I to tell somebody that's right or wrong for them? Right? And, you know, I think people should approach business as a way to craft the life that's right for them rather than what they think is the right strategy to win or what their parents want them to do or what their HBS colleagues want them to do.\r\n\r\n\r\nAnd it's this idea of inverting how you're thinking about what you should do, not based on other people's opinions, but on what's right for you. And every time I see people pooping on W2 jobs or, or one career versus another, I'm just like, Like it may be wrong for you, but that doesn't mean it's going to be wrong for me. And,\r\n\r\n\r\nNikolas Hulewsky (49:47.214)\r\nDo you think they're just insecure? Like, why do you people do that?\r\n\r\n\r\nMichael Girdley (49:49.604)\r\nI think people are, I think people, a lot of people use being a hater as a way to build allies with other people. And I think a lot of it just comes from, you know, a, just a misanthropic way of approaching life. Like, and you see people do it. There's just like my entire social media account is me pooping on other people. It's like, well, bro, like, it's not gonna work.\r\n\r\n\r\nNikolas Hulewsky (50:16.578)\r\nI mean, strong opinions do attract eyeballs. That's for darn sure. I agree with that take though. I think that people need to know themselves more than anything because what you're good at, like your unique skillset, what you enjoy, whatever the e-kai-gi, whatever they call it, it's like what you can get paid for, what you enjoy, what the world needs, what your skills are. That's unique to everybody. And so a whole co might be that for somebody. A startup might be that for somebody. A VC backed startup might be, just.\r\n\r\n\r\nBut you need to do the work to figure out where yours is and then kind of go all in on that.\r\n\r\n\r\nMichael Girdley (50:50.916)\r\nYeah, and I think that's another case in point for my suggestion of doing something that is low capex, low, low kind of hurdle to start in your 20s is your 20s should be about getting exposed to like a lot of stuff, like really trying to understand, like in trying a bunch of different stuff. If you want to go, you know, if after two years of running a staffing business, you want to go to Maui and offer like services for people who are stranded with their families as a startup or like be on a boat out there, like\r\n\r\n\r\nor like go be a bartender in New York, you should have that freedom in your 20s. And so that's the other case in point against like taking a SBA, 7A, $5 million personally guaranteed loan when you're 24. Because guess what you can't do? Walk away from that without declaring bankruptcy. And with these other businesses where you started it and maybe you don't have that much invested, like you can at least continue down this right path in your 20s, which is to get exposed to as much stuff as possible.\r\n\r\n\r\nNikolas Hulewsky (51:41.998)\r\nYeah, I don't know if there's just two types, but I think of entrepreneurship in like two different types. I think that there are the hustlers and that is Chris. It's like he's never had a job. Like he really has never had a job where he's worked for somebody else. He's always just hustled. Okay, I got to figure out how to make a buck. I got to figure out how to make a buck. And for those people, I agree with you at 22, 23, started business in the way that you've kind of talked about. But then there's other people who I think are more like me in entrepreneurship where it's like,\r\n\r\n\r\nI'm not just always trying to figure out how make a buck, but I want to work for myself. I want to architect a life for myself. Those people, would say go work for five or 10 years, get real experience, and then you can make a decision. Do you want to start something from scratch or buy a business with some scale that leverages your unique skill set? To me, those are two different camps of entrepreneurship, but you need to figure out which camp you're in because I'm not the hustler. I'm not the guy who's just, new business. I can make a quick buck from this. Awesome. We're going to figure this out. But if I thought I was that and then I try to do something like that.\r\n\r\n\r\nI'm gonna fall on my face every time. All right, this is fantastic. Thank you for joining again, Hold Co-Conference. We'll post about it. Talk soon. Stay on for a second.\r\n\r\n\r\nMichael Girdley (52:41.446)\r\nThere you go.\r\n\r\n\r\nMichael Girdley (52:51.014)\r\nAll right,",
  "metadata": {
    "duration": "",
    "date": "2025-02-17",
    "platform_source": "Google Drive"
  }
}