{
  "episode_number": "119",
  "episode_title": "How to Find High-Paying Consulting Clients (and What to Do Once You Land Them) with Sean O'Dowd",
  "guest_name": "Sean O'Dowd",
  "business_name": "Scholastic Capital",
  "transcript": "﻿Nikolas Hulewsky (00:00.879)\r\nAll right, Sean, I'm really excited to have you because I've followed you for a little while on Twitter, but please tell me, what are you doing right now? What the heck is your business?\r\n\r\n\r\nSean O'Dowd (00:10.82)\r\nYeah, so we're, I run a real estate fund. So we buy single family homes and really high end school districts. And then we rent them on long-term leases to families that want to be there in a really good school district.\r\n\r\n\r\nNikolas Hulewsky (00:24.303)\r\nI think that was the best explanation I've ever had somebody give. It was short, succinct, like not a lot of wasted breath. It's amazing. I love the thesis. All right, so your thesis is to buy homes in good school districts and then rent them long-term to people with families.\r\n\r\n\r\nSean O'Dowd (00:31.372)\r\nYeah\r\n\r\n\r\nSean O'Dowd (00:39.129)\r\nMm-hmm.\r\n\r\n\r\nSean O'Dowd (00:43.639)\r\nExactly right.\r\n\r\n\r\nNikolas Hulewsky (00:44.983)\r\nOkay, this wasn't always what you did. What did you do before the fund? Like how long has the fund been around?\r\n\r\n\r\nSean O'Dowd (00:51.952)\r\nYes, the fund's been around for about a year or so. But I was doing this personally with my own money for about three, four years before that. So I started my career in consulting, both for a big consulting firm and then was also doing it independently. And then was basically taking the dollars I was making on that and moving them over to the real estate so I could buy some homes. After doing that for a couple of years, like, okay, there's enough meat on the bone here. I can leave the consulting and do the real estate full time.\r\n\r\n\r\nNikolas Hulewsky (01:20.783)\r\nOkay, so before the fund, you were just doing consulting full-time. Now was it your consulting or was it like, I worked for BCG or BAME?\r\n\r\n\r\nSean O'Dowd (01:22.692)\r\nThat's right.\r\n\r\n\r\nSean O'Dowd (01:29.412)\r\nIt was both. So I started my career at BCG, worked at BCG for a couple of years, left, actually joined a venture backed startup and was employed like 40, 50 doing strategy and operations for them. Had a lot of time on my hands. So I started doing some consulting on the side because I knew how to do it. And then that kind of quickly compounded to the point where I left the startup to do my own consulting for a couple of years.\r\n\r\n\r\nNikolas Hulewsky (01:53.775)\r\nCan you tell me, I think you gave me some good advice about a year ago. How did you find the consulting work?\r\n\r\n\r\nSean O'Dowd (02:01.348)\r\nI liked it, meaning how did I find it? Did I like it or how was I finding clients?\r\n\r\n\r\nNikolas Hulewsky (02:06.573)\r\nYeah. No, no, no, no, no. Sorry. How did you actually find the word?\r\n\r\n\r\nSean O'Dowd (02:11.164)\r\ngotcha. So I used a couple of different things. Mostly I used a platform called Catalint. I think of it as like Upwork, but a higher market, meaning the clients are Fortune 500s, they're mega private equity funds, places like that. So I would go on there and there'd be major private equity firms looking for a consultant to do some work. And then I would apply for that work. Similarly to Upwork, just different clientele.\r\n\r\n\r\nNikolas Hulewsky (02:40.335)\r\nSo a lot of times people think about entrepreneurship as like quit my job, bought a business or quit my job, started a company from scratch. You did it in a way that is the way that I think is the safest way to get into entrepreneurship. You work, you get some corporate experience, you build a company around consulting and then you, it's tech, right? Land and expand you for that phrase. Like you land in one thing, you expand. And then you went from consulting and you built an actual business. Was that thoughtful? Was that intentional? Or was it like, it just kind of happened because you're putting one foot in front of the other.\r\n\r\n\r\nSean O'Dowd (03:10.402)\r\nIt was a little bit of both. At the time, it was like, hey, I know how to do the consulting work. This is easy stuff. Once I have the clients, I know how to go from idea to delivering something the client's happy with. I just kind of fell into doing that. But to your point, you learn pretty easily. It's like business training wheels. Like, hey, I'm doing something already and I know how to do. Now I need to learn how to price work, how to...\r\n\r\n\r\nNikolas Hulewsky (03:32.761)\r\nMm-hmm.\r\n\r\n\r\nSean O'Dowd (03:37.784)\r\ndo the legal, how to do the insurance, how to do AP, how to do AR, how to do those kind of basic things on top of something I already know how to do. And then you can then get this business training, let's do something a little bit harder of like, hey, I still have those basic business foundations that I've now learned, but now I'm doing something during the day to day that I don't know as well as say I used to on the consulting side of things.\r\n\r\n\r\nNikolas Hulewsky (03:59.535)\r\nSo what was the idea behind getting into consulting and doing Catalan? Was it to control your time or was it like, want to be an entrepreneur and this is the next logical step?\r\n\r\n\r\nSean O'Dowd (04:09.316)\r\nIt was neither actually. So I left BCG knowing I wanted to do venture backed startups. I was like, want to work at a venture backed startup. I had three offers when I left BCG. I picked the one out of the three to not become a unicorn. So great picking on my part. But at its core, I needed money. I was going to buy a ring to propose to my now wife. So that's why I started doing consulting work. It's like, this is a good way to make some money to go buy a ring.\r\n\r\n\r\nNikolas Hulewsky (04:12.367)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (04:24.015)\r\nGood for you.\r\n\r\n\r\nSean O'Dowd (04:39.458)\r\nAnd then it got to the point of like, Hey, like actually I'm making a good amount of money. I'm just going to keep doing this because I can now go buy some real estate with it.\r\n\r\n\r\nNikolas Hulewsky (04:47.708)\r\nSo you went to Wharton, I can tell because you're wearing a Wharton sweater. And then how old are you?\r\n\r\n\r\nSean O'Dowd (04:50.85)\r\nYeah.\r\n\r\n\r\nI'm 30.\r\n\r\n\r\nNikolas Hulewsky (04:56.015)\r\nSo you went to Wharton, you came out of school, you work in consulting. I've always heard consultants make really good money. Would you mind sharing how much money did you make the last year you were a consultant?\r\n\r\n\r\nSean O'Dowd (05:04.58)\r\nSo at BCG, when I started, they bumped it up since then, it was 80 grand base salary out of school. And then with bonus and everything, I think it was like 96 total year one. Year two was a little bit more than that. This was 2017. So there's been a couple of pay raises since then, but it was basically about a hundred grand out of school. And then independently, that was between like 450 and 550 a year.\r\n\r\n\r\nNikolas Hulewsky (05:30.165)\r\nReally? So it was a big jump when you went from BCG.\r\n\r\n\r\nSean O'Dowd (05:33.704)\r\nIt was a very big jump. was a material jump to the point where it was a pretty significant lifestyle change and that we were able to, I've got two kids, a third on the way, we were able to afford childcare and we were able to start buying investment property and do things like that. So it was a big jump.\r\n\r\n\r\nNikolas Hulewsky (05:49.817)\r\nThat's incredible. Okay, so year one out of school, 100 grand. Year two out of school, call it 110 grand, about the same, whatever. Year three, what were you making year three?\r\n\r\n\r\nSean O'Dowd (05:57.262)\r\nPunta, yeah, 115, 110.\r\n\r\n\r\nSean O'Dowd (06:02.724)\r\nYear three was... I was at the startup, so I think I made like 65 at the startup. And then independently on top of that, I did like 503, 504. It like smidge over 500. So year three was like a life-changing year for lack of better way to describe it.\r\n\r\n\r\nNikolas Hulewsky (06:21.263)\r\nHow many years ago was this? 2020?\r\n\r\n\r\nSean O'Dowd (06:22.852)\r\nThat was 2018-2019.\r\n\r\n\r\nNikolas Hulewsky (06:29.095)\r\nOkay, so you're like 26 making 500 grand a year.\r\n\r\n\r\nSean O'Dowd (06:33.22)\r\nYeah, was like, I 24, 25, 25, because I had my eldest, my son, and when I was 25, I was over 500 that year.\r\n\r\n\r\nNikolas Hulewsky (06:42.799)\r\nThat's incredible, That is nuts.\r\n\r\n\r\nSean O'Dowd (06:45.004)\r\nIt was a really kind of great, nuts situation that I completely kind of fell into.\r\n\r\n\r\nNikolas Hulewsky (06:51.811)\r\nSo I went a year ago, think, I don't remember, somehow either you posted about it or you messaged me when I was asking about Catalan. And so I went, I signed up, I went through the onboarding process and I and looked at it. The hard part was like, there was no, there were, at least from my perspective, there were no jobs for me to bid on that fit my skillset. Cause I have like home health and hospice leadership and a lot of them were project based that were not that. What was your skillset? Like how did you, what was the work that you\r\n\r\n\r\nSean O'Dowd (06:59.875)\r\nMmm.\r\n\r\n\r\nSean O'Dowd (07:03.48)\r\nThanks.\r\n\r\n\r\nSean O'Dowd (07:13.006)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (07:22.051)\r\nfollowed into Catalan.\r\n\r\n\r\nSean O'Dowd (07:23.908)\r\nYeah. So I, for me, it was mostly functional versus industry work. So I did a lot of post-acquisition private equity work. Typically first like six months post-acquisition, there'd be a CTO, Chief Transformation Officer. And I was basically like a chief of staff, like lieutenant to the CTO where they had, hey, we bought this company. We had 10 reasons why we think we're going to make it better. And like, we just need people to start knocking stuff off this list and getting stuff done for us.\r\n\r\n\r\nThat was me. That's my job.\r\n\r\n\r\nNikolas Hulewsky (07:54.159)\r\nWere you doing one project at a time or was it like four or five projects that you took on?\r\n\r\n\r\nSean O'Dowd (07:58.134)\r\nYeah, so that was the challenge. So I was typically doing two to three projects at a time. Back then, Catalan didn't have great controls of how busy people were. And I was winning a lot of work and they were sending more work my way. I just kept on saying yes to it, but I was doing two to three full-time projects at a time. So it was a great earning year, but it was not a light work year to say the least, that year three that we're talking about.\r\n\r\n\r\nNikolas Hulewsky (08:28.003)\r\nWow, okay, so each one of projects was full-time work?\r\n\r\n\r\nSean O'Dowd (08:30.916)\r\nIt was full-time work.\r\n\r\n\r\nNikolas Hulewsky (08:32.271)\r\nGive me an idea how much, when you won one of these projects, they're probably like a range, but typically speaking, how long were they and how much did they pay?\r\n\r\n\r\nSean O'Dowd (08:40.812)\r\nYeah, projects range, the shortest was about three weeks, that was pre-acquisition private equity work. We were helping out on the due diligence. And then post-acquisition, longest was about a year. Range, they did it off of daily rates and your daily rate depended on a variety of different things. The biggest one being length of project, longer the project for less rate because you've got more kind of security in that. Longer term projects like 1500 a day.\r\n\r\n\r\nNikolas Hulewsky (09:04.815)\r\nSure, sure.\r\n\r\n\r\nSean O'Dowd (09:09.316)\r\nIf you're doing a three week diligence, you could get up to like $2,250 to $2,500 a day.\r\n\r\n\r\nNikolas Hulewsky (09:15.727)\r\nJeez Louise, how hard was it to get work at that time on Catalan?\r\n\r\n\r\nSean O'Dowd (09:20.516)\r\nIt's really hard to get started. And the challenge with Catalan is they don't let everybody on the platform. They actually reject a lot of people who apply for it. So everybody who's on the platform has game for lack of way to describe it. And when you're pitching on these projects, you've got 30 people who apply. You've got industry experts, got ex-Mackenzie people, you got ex-Goldman people, ex-Blackstone people. You've got really high caliber competition.\r\n\r\n\r\nit's hard to win your first couple of projects. Once you do though, it's kind of like Uber in the early days where it's a closed-end system where you have to review each other. Once you win a couple of projects, you get five-star reviews, you suddenly start becoming one of the few people that have a track record that's demonstrable on the Catalan platform. It becomes easier and easier easier to win each successive project from there.\r\n\r\n\r\nNikolas Hulewsky (10:11.609)\r\nyou still do any cattle at work? No.\r\n\r\n\r\nSean O'Dowd (10:13.812)\r\nI can't. Not with the fund. I am not allowed actually under our fund documents.\r\n\r\n\r\nNikolas Hulewsky (10:19.331)\r\nOkay, good to know. This Catalan thing is just like shocking to me. they essentially have large companies come on and say, this is the project work that I need. And then on the other side, so that's like the supply side. And then on the demands or however you want to say it, then on the supply side, you have people like you who are like, yep, I'm an industry expert or I can do X, Y, and Z. What functional tasks were you actually doing? Were you like running Excel models or were you actually running a team that was implementing\r\n\r\n\r\nSean O'Dowd (10:30.724)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (10:49.077)\r\nnew CRM or the new HRIS systems.\r\n\r\n\r\nSean O'Dowd (10:53.468)\r\nHonestly, all across the board. depended on... Most of the work was that post-acquisition value creation work. And it was a lot of like what... We just need somebody smart to jump in and just figure stuff out and get stuff going on. So sometimes it was a project where there were new product introduction, MPI process, where the product is a year delayed and they need to figure out why to start...\r\n\r\n\r\nneed somebody to start removing blockers so they can get it done. Sometimes it's like, we're moving our supply chain optimization software, and we need someone to help make sure that we don't lose data in that process.\r\n\r\n\r\nNikolas Hulewsky (11:20.271)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (11:28.505)\r\nSo it wasn't even like, I have a technical expertise. I'm a coder. I'm a biller or whatever. It was just, hey, we need somebody who kind of understands this world to do these functions for us. And then you... No, go ahead. No.\r\n\r\n\r\nSean O'Dowd (11:38.358)\r\nExactly. It was, or sorry, go ahead. Exactly. Exactly. Right. Catalan uses the word athlete to describe it of like, we just want somebody, somebody smart that like, we think we can introduce a problem to them. They can put their arms around it for an hour and like be dangerous enough to like go do an Excel model and be like, Hey, look, like you're trying to introduce this new product. And, all of the work has stopped at this one specific person.\r\n\r\n\r\nNikolas Hulewsky (12:03.759)\r\nMmm.\r\n\r\n\r\nSean O'Dowd (12:08.088)\r\nThis one specific person is not getting anything done and not advancing it. Like Sean's going to go back now and tell the CTO like, Hey, Joe Schmo in accounting is who you need to talk to you because it seems like everything is stopping once it reached Joe Schmo. And then they're like, okay, great. Tomorrow I need you to go figure out like, we need to renegotiate these 30 vendor contracts. Like put a plan together and a proposal together for how we're going to go run an RFP process for all of these guys, because we know we're being overcharged by at least half.\r\n\r\n\r\nguys. That's sort of like athlete work.\r\n\r\n\r\nNikolas Hulewsky (12:38.959)\r\nBro, I'm gonna go look at Cadillac. I'm looking at Cadillac tonight. I didn't even look at those types of projects. Cause I'm like, they're probably looking for somebody who's like, this is the exact discounted cashflow model we want built. And we want to make sure that you understand, you know, the Pareto principle when applying this to the economy. It's like, I don't want to figure that stuff out. But if that's it, I could have been working all this time. Okay, so you're making 500 grand a year. And I saw that like you built a Twitter audience. You started posting on Twitter about consulting in particular.\r\n\r\n\r\nSean O'Dowd (12:50.147)\r\nMm-hmm.\r\n\r\n\r\nSean O'Dowd (12:57.048)\r\nYeah.\r\n\r\n\r\nOkay\r\n\r\n\r\nNikolas Hulewsky (13:07.661)\r\nSo when I saw that you started this fund buying real estate in good school districts and renting it out to people, it's like, okay, that's out of left field. How the freak did you make that transition?\r\n\r\n\r\nSean O'Dowd (13:17.89)\r\nYeah, I, real estate's always been the thing for me. So I moved 22 times before I went to college. So I bounced around a ton growing up and that got me interested in real estate, like finding a place to live is this thing we're doing every nine months. And my mom was a teacher growing up. So I was also like pretty tuned into like, hey, like everywhere we live, like there's a really good school district and people tend to try to prioritize living there. So I've had this idea for what is scholastic for a long time now. And I,\r\n\r\n\r\nalways planned to buy homes under that thesis. I just didn't expect to have the disposable income that I had at 25 to be able to start buying $500,000 houses as rentals. But I did. So I started buying homes and built a portfolio larger than I expected to. And I, to your point on Twitter, like I use Twitter kind of like a public Slack channel during COVID, where I was just kind of like publicly posting what I was thinking about when I was doing.\r\n\r\n\r\nAnd it got to the point where I was sharing about what I was doing on the real estate side. People were reaching out like, hey, like next time you buy one of these, can I kick some money in? It's like, okay, like there's interest in this thesis that I'm doing. And I've now done this for a couple of years. I feel like there's pretty good meat on the bone at this point. I feel confident in what the actual thesis is. Maybe it's time to start bringing in outside capital to turn this into a fund. I thought that was going to happen 10, 15, 20 years down the line from where it is.\r\n\r\n\r\nNikolas Hulewsky (14:45.423)\r\nSo why did you decide to start doing the fund? Because it sounds like you were funneling cash into these single family homes and renting them out. I have a thing against funds. I'm just like, I don't want to raise money because then I give up control and then I have people to answer to. And if I fail, I let people down, which is a big deal to me. What was the tipping point? Like, why did you decide, hey, I need to raise a fund?\r\n\r\n\r\nSean O'Dowd (14:55.767)\r\nHmm\r\n\r\n\r\nSean O'Dowd (15:09.794)\r\nIt's a great question. And I agree with you on the letting people down component to it. It's not easy. For the fund, honestly came down to the investment makes more sense the more homes that we can buy for a variety of reasons. Like we can charge a more premium rental price the more homes we have. We can service the homes at a better lower cost the more homes we have. We can potentially sell the portfolio as a portfolio the more homes we have.\r\n\r\n\r\nAnd with all of those in mind, like we ran the math a hundred different ways to Sunday and every single time it made the most economic sense to build a fund. And if we were going to accept, call it any outside dollars, even if a good friend wanted to kick in 50 grand to the fund, I didn't feel right in doing it at a small scale of just say 50 grand because\r\n\r\n\r\nI know it be a suboptimal outcome. The best financial outcome would be to make it bigger than that and make it a true fund.\r\n\r\n\r\nNikolas Hulewsky (16:13.283)\r\nWhen did you launch the fund?\r\n\r\n\r\nSean O'Dowd (16:15.32)\r\nWe started putting the fund together about two and a half years ago. We formally started fundraising about a year and a half ago, and then we formally started buying homes about eight months ago.\r\n\r\n\r\nNikolas Hulewsky (16:26.489)\r\nHow much did you raise?\r\n\r\n\r\nSean O'Dowd (16:28.44)\r\nWe've raised about five and a half million to date. We've got another, call it 40 in the hopper right now that is likely to come through over the next year.\r\n\r\n\r\nNikolas Hulewsky (16:39.311)\r\n40 million? Geez, man. my gosh. Was that the plan? Were you like, yeah, we're gonna go raise $50 million or was it like, well, let's start with five.\r\n\r\n\r\nSean O'Dowd (16:51.192)\r\nThe plan was to start with five. We're a rolling fund model. one thing about our thesis, buying homes in good school districts, our tenants, our families that move in the summer between school years. So buying homes right now in January doesn't make sense because there aren't tenants looking for homes.\r\n\r\n\r\nSo we were basically on a yearly schedule of we raise in the fall, winter, and then we go buy homes in the summer and kind of repeat that process. So year one, we did the five million, we bought 21 homes with it. That was our first cycle. And now we're gearing up for cycle number two this upcoming year, which we can go bigger now that we've got a team in place now. We've got really good vendors. We've got a really good process and system built out. So now we can go a little bit bigger.\r\n\r\n\r\nNikolas Hulewsky (17:37.753)\r\nSo if I was your wife and I was like, wait a second, Sean, we're making 500 grand a year right now. You want to go raise a fund? I'm assuming, I don't know. You're not paying yourself 500 grand a year out of the fund. How was that conversation?\r\n\r\n\r\nSean O'Dowd (17:44.416)\r\nand\r\n\r\n\r\nSean O'Dowd (17:50.317)\r\nMm-hmm.\r\n\r\n\r\nSean O'Dowd (17:54.884)\r\nYes, I have an exceptionally supportive wife. I went from making 500 to basically zero for two years in a row now. And it's probably going to be zero for another year or two down the line because I'm reinvesting in hiring the team and building this out. So yeah, I have an extremely supportive wife who makes a good salary on her own that allows us to, for lack of better word, keep the lights on here.\r\n\r\n\r\nNikolas Hulewsky (18:24.951)\r\nOkay, so how does the fund work? So you've raised $5 million, but you're not paying yourself a salary. Are each one of the investments like their own SPV or is it all pooled together? Like, can you talk about how it functionally works?\r\n\r\n\r\nSean O'Dowd (18:30.5)\r\nMm-hmm.\r\n\r\n\r\nSean O'Dowd (18:39.458)\r\nYep, for sure. So it's all pulled together and we basically function like a private REIT. So investors buy into it and they get monthly distributions out. We pay distributions out the third Friday of every month from the profit from the previous month of operating. That's basically the dividend for the investors.\r\n\r\n\r\nAnd then on the actual equity side, our accountants, the fund administration vendor, every quarter revalues the fund. So every quarter, the investors get a statement that said, hey, you put in 250 grand, it's now worth 290, and you were paid out 12 grand in distributions over the past quarter. That's basically how it works at its core. On our side, we have a 1.5 %\r\n\r\n\r\nmanagement fee and then we get 15 % of the proceeds. So like the old two and 20 model, we're one and a half and 15. Exactly. So the one and a half percent, that is for fund fees. Some funds can basically use that as like a profit center for us. Like we use that to build our team because we want to grow the fund and we want to make sure we're doing it right. So me not paying myself is...\r\n\r\n\r\nNikolas Hulewsky (19:32.259)\r\nand 15.\r\n\r\n\r\nSean O'Dowd (19:50.756)\r\nuh me hiring a team basically in lieu of paying myself out of that one and a half percent\r\n\r\n\r\nNikolas Hulewsky (19:55.055)\r\nSo does that mean if you've raised five million every single year, you get $75,000 essentially as the one and a half percent, but then you're also getting 15 % of the distributions.\r\n\r\n\r\nSean O'Dowd (20:06.82)\r\n15 % of the distribution is correct.\r\n\r\n\r\nNikolas Hulewsky (20:09.295)\r\nSorry, did you say five zero or one five? Okay, okay, yeah, yeah, okay. I was like, dang, all right. And the way like this typically work at least for dumb people like me is you'll have this GP LP model where the LPs are the limited partners, typically are the ones contributing capital and then you got the GPs, the general partners who are operating the business. And so I think what you're saying is 85 % of the fund.\r\n\r\n\r\nSean O'Dowd (20:11.332)\r\nOne five, one five, five zero would be a lot.\r\n\r\n\r\nNikolas Hulewsky (20:37.655)\r\nequity essentially is owned by the LPs, 15 % is owned by the GPs, you and your partner. Okay. Is there a preferred return to the LPs? Like do they have a pref?\r\n\r\n\r\nSean O'Dowd (20:44.312)\r\nThat's right. That's exactly right.\r\n\r\n\r\nSean O'Dowd (20:49.54)\r\nWe have two different unit models. One has a preferred return. It's got an 8 % pref and then a split above that. And then we also have a model that doesn't have a split. The math is almost exactly the same between the two. So we have them both as options. We have some LPs who prefer one versus the other.\r\n\r\n\r\nNikolas Hulewsky (21:11.055)\r\nWhat do you prefer?\r\n\r\n\r\nSean O'Dowd (21:13.188)\r\nI'm indifferent. The math is basically the same for us. It really depends on how LPs are thinking about it what they're looking for for their investment.\r\n\r\n\r\nNikolas Hulewsky (21:13.549)\r\ndoesn't matter. Yeah.\r\n\r\n\r\nNikolas Hulewsky (21:23.311)\r\nSo if you get to that 40 million and you've got $45 million under management, you're at a spot where you're doing, what is that, $700, call it. Actually more than that, $750, call it, in management fees. Where does that money go? Who are you hiring? Besides just you and, is it you and a partner or how many other multiple partners?\r\n\r\n\r\nSean O'Dowd (21:44.29)\r\nYeah, so we have, the team's actually quite large. So it's myself and my actual partner in the business, Twitter gentleman, actually. And then we've got six advisors who each have a percent of the business. gentleman from Blackstone, a gentleman from Tri-Con, a gentleman from a big single family fund in Louisville.\r\n\r\n\r\nNikolas Hulewsky (22:06.575)\r\nThey've got a percentage of that GP, that 15%. Okay.\r\n\r\n\r\nSean O'Dowd (22:10.66)\r\nCorrect. That's exactly right. So that's called the advisory team. On the day to day, it's myself, I've got an operations manager and I've got an asset manager. We're hiring a controller and an accountant right now. But to your point on that 750, that 750 goes to hiring a leadership team and a fund that's not cheap. So for example, for us, we'll need a CFO.\r\n\r\n\r\nCFO is about 400 a year. We need a VP of IR. They'll be around 3 350. And we need a VP of asset management. They're about 300 as well.\r\n\r\n\r\nNikolas Hulewsky (22:51.823)\r\nIs the reason that they cost that much because you're not, how do I put this? It's not like you can just go, I'm gonna get a fractional CFO or I'm gonna go overseas and hire talent in Latin These are highly specialized specific positions. Like a CFO of a fund is very specific because there are regulatory requirements for the way the fund is supposed to operate, disclose, report, all those things. that why they cost so much?\r\n\r\n\r\nSean O'Dowd (23:09.337)\r\nMm-hmm.\r\n\r\n\r\nSean O'Dowd (23:18.35)\r\nThat's exactly right. We have a lot, I mean, we're an SCC regulated industry. We have a lot of rules and requirements that we have to follow. My team right now is based in Latin America and they're fantastic and they are.\r\n\r\n\r\nalways going to be a member of the team. But when I hire a leadership team, when I hire a CFO, I need somebody who is stateside. They are probably chartered. They have a significant amount of experience with the SEC. They're used to working with institutional investors who are deploying large amounts of capital and have a certain expectation of experience dealing with SEC rules and regulations.\r\n\r\n\r\nNikolas Hulewsky (23:56.719)\r\nSo if I'm just doing the math, right? I'm like, cool. Sean goes from making $500,000 a year. Amazing. To making no money per year. And even if you raise the 40 million and you're at 45 million, you're still $750,000 that's just going to pay administrative fees, right? And then you have other partners who are part of the GP. I don't see a world where in the near future, Sean's making $500,000 a year.\r\n\r\n\r\nOkay, so what is the thesis with this fund? Is it to operate it for a couple of years and sell and have a big liquidity event? And what size are you aiming for?\r\n\r\n\r\nSean O'Dowd (24:36.886)\r\nYeah, so where the fund makes sense is as we continue to grow and get bigger. The sweet spot for us is getting over, once we get over about 100 million, then things get more and more interesting from a financial perspective for myself and the remainder of the partners. For us, we're going to continue to add homes into the fund and grow.\r\n\r\n\r\nWe may sell down the line. We've been very intentional about choosing homes that we can sell, about choosing debt that we can sell. We're basically building a portfolio and a roll up that we could sell to a Blackstone or an invitation down the line. Go ahead.\r\n\r\n\r\nNikolas Hulewsky (25:17.551)\r\nyou\r\n\r\n\r\nSean O'Dowd (25:21.732)\r\n100 million, 100 million now, so 100 million net asset value of the fund. the equity being worth 100 million in the fund.\r\n\r\n\r\nNikolas Hulewsky (25:31.129)\r\nSo, okay, and buying $100 million worth of single family homes in good school districts, let's just say that every single home is a million dollars. That's a hundred homes that you have to buy. That's a lot of homes to go through and buy. And even if you bought all those homes over the next five years, it's still 20 homes a year and essentially this short window of time of the summer or whatever. How do you, are you buying them onesie twosies?\r\n\r\n\r\nor are these coming up in portfolio deals?\r\n\r\n\r\nSean O'Dowd (26:02.166)\r\nWe are buying them once in two season. These homes aren't available in packages, which is why the value, why are us creating a package is a value to somebody because they can then pick it up from us. But to your point, like this is an exceptionally ops heavy business to my knowledge, more so than any other form of real estate and why that ops PE background is extremely useful. mean,\r\n\r\n\r\nNikolas Hulewsky (26:03.788)\r\nWow.\r\n\r\n\r\nSean O'Dowd (26:26.08)\r\nat its core, I need to basically be building my data room as I go along with everything that we're doing. So for example, like every time we buy a home, I need make model serial number year for every single piece of capital equipment in every single house. Because somebody at Blackstone is going to be looking at this data room in a decade, hopefully. Like they need to have a tape that says, hey, here are all the ovens in all of the houses. How old they are.\r\n\r\n\r\nhow many years of useful life they have on them. Like I need to be like, hey, you want to know the shape of the portfolio? Like here is a detailed log of every single time we've sent out a service tech to all of our properties over the past decade. They're in pretty good shape. You can see why. Like we've taken good care of them. Give us the right price on that. We've got 21 right now. We're probably going to pick up another 30 to 40 this summer.\r\n\r\n\r\nNikolas Hulewsky (26:52.175)\r\nCrazy.\r\n\r\n\r\nNikolas Hulewsky (27:06.383)\r\nHow many homes do you currently have under management?\r\n\r\n\r\nNikolas Hulewsky (27:13.839)\r\nSo your core business is finding and buying these homes. What about the property management? Do you do that or is it strictly you find property managers in different locations?\r\n\r\n\r\nSean O'Dowd (27:27.684)\r\nWe are involved on the asset management side. So we do have a property management partner that handles the actual day-to-day communication with the tenants. That being said, we're overlaid on top of that and we have direct integrations to all of their software. we get, no, it's a third party that we work with.\r\n\r\n\r\nNikolas Hulewsky (27:43.865)\r\nDo you own that business though, or are they a standalone vendor?\r\n\r\n\r\nSean O'Dowd (27:50.864)\r\nWe have recordings to all other phone calls with tenants. We have access to all of the data. we overlay, but we don't actually do the touching.\r\n\r\n\r\nNikolas Hulewsky (27:57.007)\r\nWould you be allowed to start that business?\r\n\r\n\r\nSean O'Dowd (28:01.796)\r\nWe could, we could do it ourselves. There's a point at which it makes sense from a scales perspective to do that. It's probably around 200 homes. Before then, the economics are going to be really tough to, yeah.\r\n\r\n\r\nNikolas Hulewsky (28:15.661)\r\nYeah, makes sense. Why split your attention when you're strictly focused on buying good real estate? Are you focused on specific markets or is it like anything that comes across your desk? How are you actually acquiring these assets?\r\n\r\n\r\nSean O'Dowd (28:27.844)\r\nYeah, so we are focused on specific markets. We've got 37 zip codes that we track across five states in the upper Midwest. Minnesota, Wisconsin, Illinois, Indiana, Michigan is where we target. And that's going back to like, we're building this portfolio to sell. We've spoken with all of the big funds. We've said, hey, if we build this for you, where do you want to buy it? They all said independently, upper Midwest is where we'd want to buy it. So we're building it in a way that we can just drop it off to them.\r\n\r\n\r\nNikolas Hulewsky (28:51.503)\r\nCrazy.\r\n\r\n\r\nNikolas Hulewsky (28:55.823)\r\nThere's something about Twitter that I've noticed is there's a couple things that it's really good for. It's really, really good for people who have a product that have built distribution. So if you have a certain number of followers, you have access to people and it's about finding product market fit. It's like, okay, what or product audience fit, I like to say. What product will fit my audience? And sometimes it's Nick Huber. He started somewhere and as I know he's selling VAs to people.\r\n\r\n\r\nSean O'Dowd (29:17.166)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (29:24.993)\r\nor it's courses or whatever else. something that I think is underrated is Twitter as a fundraising mechanism or a fundraising channel. Because you've got all these people who have built trust with you. They understand you. They know who you are. And so when you say like, hey, I'm raising money to do X, Y, and Z, you have access to funds. Is my thesis correct? Are the majority of your funds coming from like Twitter connections or are these outside of Twitter?\r\n\r\n\r\nSean O'Dowd (29:31.524)\r\nHmm.\r\n\r\n\r\nSean O'Dowd (29:51.908)\r\nTwitter has played an outsized role. Some of it is from people directly from Twitter who saw something, like, that's interesting. Or it's come from somebody on Twitter saw something and then sent it to their uncle who they thought would find it interesting, who then introduced it to a friend of theirs who ended up investing in Scholastic.\r\n\r\n\r\nNikolas Hulewsky (30:11.471)\r\nSo maybe it was like good to get going, it's not necessarily now the main feeder.\r\n\r\n\r\nSean O'Dowd (30:16.26)\r\nIt's not the main feeder, but it's a big driver of called initial interest and a big driver of vendors. We found a lot of vendors through Twitter. It's a good way that we've validated quite a few hypotheses and hires.\r\n\r\n\r\nNikolas Hulewsky (30:33.492)\r\nWould you have launched this if you hadn't had an audience on Twitter?\r\n\r\n\r\nSean O'Dowd (30:38.465)\r\nit would have been exponentially harder to do so because this is a...\r\n\r\n\r\nNikolas Hulewsky (30:41.145)\r\nSure, but would you have launched it?\r\n\r\n\r\nSean O'Dowd (30:46.114)\r\nHonestly, I don't know if I could have afforded to. And the reason why is we are an exceptionally legally complex fund, just because our rolling fund structure is difficult. It just so happened that probably the best investment funds attorney in the country is on Twitter. And we met via Twitter and he joined the fund.\r\n\r\n\r\nNikolas Hulewsky (30:48.505)\r\nReally?\r\n\r\n\r\nSean O'Dowd (31:09.144)\r\nto help do our legal work. Like don't think I could have paid the 150 grand out of pocket. It would have cost to have set up our fund the way that we did.\r\n\r\n\r\nNikolas Hulewsky (31:09.758)\r\nit's amazing.\r\n\r\n\r\nNikolas Hulewsky (31:16.495)\r\nHmm. That's a, that's another really good point about Twitter is like, it's not just, I thought coming in, it was like deal flow. cool. I'll get on Twitter and there'll be deal flow or cool. I'll have an audience, but it's the caliber of people that you meet who have like, I don't know, some NFT as their profile picture and you know, it's dragon slayer six nine four 20 and you like, they never post about anything, but then all of a you get a DM from them. You're like, they're like, Hey, I run this division of fidelity.\r\n\r\n\r\nSean O'Dowd (31:23.95)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (31:43.927)\r\nand I really liked what you said about X, Y, and Z, we should talk. And you're like, what the freak? It's crazy.\r\n\r\n\r\nSean O'Dowd (31:48.74)\r\nYep. It's 100 % true. And it's always like the NFT or like the gray profile with no, it's just some random username. We've had multiple conversations with a $60 billion investment platform about an investment from them to Scholastic. And it came from a ranking member of their team with a gray silhouetted Twitter profile reaching out because they saw something that we were tweeting about.\r\n\r\n\r\nNikolas Hulewsky (31:55.364)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (32:14.19)\r\nNo way.\r\n\r\n\r\nSean O'Dowd (32:18.368)\r\nIt's a very underrated element of Twitter.\r\n\r\n\r\nNikolas Hulewsky (32:21.519)\r\nIt dude, it is totally. I've always said, I feel like Twitter is what people hoped LinkedIn would be. Where you're like, you're making real connections with real people who have actual influence in the, in the companies. like LinkedIn, but man, the DMS are a freaking mess and I've never met. I personally I'm biased. I just haven't made as good of a connections on LinkedIn. There's just something about Twitter where these people go and hang out and they can be totally open. They don't have to be a VP of corporate ops.\r\n\r\n\r\nSean O'Dowd (32:27.437)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (32:49.705)\r\nthey are on LinkedIn, can be Dragon's Lair 69420 and tweet whatever they want. And then if they do want to reach out to somebody, like, hey, by the way, I know I just post about these nuts, but I'm actually a fund manager with Blackstone. You're like, wait, what the? What? It's so funny, dude. It's so funny.\r\n\r\n\r\nSean O'Dowd (33:01.847)\r\nYou\r\n\r\n\r\nSean O'Dowd (33:05.952)\r\nSo funny. But it's just great. It's also people who don't take themselves too seriously. Like I feel like LinkedIn people are a little too buttoned up. Everyone on Twitter is like a genuinely good person. For the most part.\r\n\r\n\r\nNikolas Hulewsky (33:17.911)\r\nIt depends on which part of Twitter you are. think SMB. Yes, SMB Twitter real estate Twitter are amazing. You get outside of that. It's kind of a cesspool. Dude politics Twitter. my gosh, don't don't go viral and get politics Twitter involved. They will not like you. What is that?\r\n\r\n\r\nSean O'Dowd (33:19.918)\r\nThat's fair. That's great caveat.\r\n\r\n\r\nSean O'Dowd (33:30.702)\r\nYeah.\r\n\r\n\r\nSean O'Dowd (33:38.274)\r\nYes, that has happened a couple of times and it's never a fun day or two when that happens.\r\n\r\n\r\nNikolas Hulewsky (33:44.423)\r\nIt's never a fun day or two. You know what's cool too is like because you've been public about it and because you tweet about it, your investors understand that that's just a part of the fund. It's like, that's just the dynamic. And so you can keep doing it. Whereas if you would raise this fund and then you decided you wanted to start posting on Twitter, it gets a lot harder to do that. Cause people are like, whoa, whoa, whoa, Sean, I didn't invest with this. I didn't, didn't, I don't like this thesis. I don't like you putting stuff out there. So I think\r\n\r\n\r\nSean O'Dowd (34:07.886)\r\nMm-hmm.\r\n\r\n\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (34:14.233)\r\nI think that's actually a very helpful part of you having had experience on Twitter. Do you agree?\r\n\r\n\r\nSean O'Dowd (34:20.392)\r\nI think that's a great point. I think it would be really hard to do retroactively, but now it's a pretty core part of what we do. I send our investors their monthly update. We send a lot of data to our investors every month of what's going on in the portfolio. And then two weeks later, I basically send the exact same email with some edits of the confidential stuff, some edits out, but it's a very data heavy email that we send out publicly that is...\r\n\r\n\r\ncall it 85 % of the same email that the investors are getting.\r\n\r\n\r\nNikolas Hulewsky (34:52.245)\r\nThat's insane. All right. Last two questions. First question. Have you deployed $5 million or you just raised it? Okay. So you deployed $5 million. What is that currently generating on a yearly basis for dividends?\r\n\r\n\r\nSean O'Dowd (35:03.182)\r\nWe have.\r\n\r\n\r\nSean O'Dowd (35:09.72)\r\nYep. On the dividend side, it's about five and half percent. And for 99 % of investors, that's five and a half net of taxes because we also passed depreciation back to the investors on the K-1. So it's like an eight to nine pre-tax.\r\n\r\n\r\nNikolas Hulewsky (35:24.175)\r\nAre you passing everything through to them? Okay, so you pass everything through to them. And then on top of that, well, I'm assuming actually you're probably paying property management fees of pre-dividends. So any operational expenses?\r\n\r\n\r\nSean O'Dowd (35:26.638)\r\nCorrect.\r\n\r\n\r\nSean O'Dowd (35:39.47)\r\nYes, that five-five is net of everything.\r\n\r\n\r\nNikolas Hulewsky (35:42.925)\r\nOkay, okay. And then the houses that you're buying, are you going in and bidding above market? Like, are you going above asking? No, because that's the knock on a lot of these funds, right? It's like, Blackstone's coming in, they're buying all the single family real estate, they're driving the prices up, they're paying over market. But you say no.\r\n\r\n\r\nSean O'Dowd (35:51.524)\r\nSo we.\r\n\r\n\r\nSean O'Dowd (36:02.308)\r\nWe won 55.1 % of our offers this past summer. So we win a little bit more than half the time we offer on a house. And we are almost always the lowest offer when we put the offer in. In most cases, because we buy in neighborhoods that are very high owner occupancy, we are the only investor buying the homes. But as a result of that,\r\n\r\n\r\nSellers have a much higher degree of confidence that we're able to close, get approved for financing, and actually not nickel and dime them on inspections. So they tend to like working with us. The other element too is we don't have to take a buyer's agent fee. So the seller's agent can keep both sides of the commission. Seller's agents like working with us as well. So we win more than half the time with being the lowest offer.\r\n\r\n\r\nNikolas Hulewsky (36:53.977)\r\nThat's awesome. Well, what's the name of your fund?\r\n\r\n\r\nSean O'Dowd (36:56.621)\r\nScholastic Capital.\r\n\r\n\r\nNikolas Hulewsky (36:58.255)\r\nIt's called Elastic Capital. Okay, love it. This was awesome, man. Appreciate you coming on.\r\n\r\n\r\nSean O'Dowd (37:01.912)\r\nThanks for having me.\r\n\r\n\r\nNikolas Hulewsky (37:03.247)\r\nStay for a second.",
  "metadata": {
    "duration": "",
    "date": "2025-02-10",
    "platform_source": "Google Drive"
  }
}