{
  "episode_number": "139",
  "episode_title": "Beyond ChatGPT: Exploring Perplexity and the Deep Dive Revolution with Chris Koerner",
  "guest_name": "Chris Koerner",
  "business_name": "",
  "transcript": "﻿Chris Koerner (42:44.684)\r\nYep. It was a good one. As soon as I started playing, I'm like, I remember this.\r\n\r\n\r\nI got a little got a little framework little AI AI hack for our listeners today. OK. You've got Chad GPT their $200 a month pro plan and then you've got perplexity. Their pro plan is $20 a month, but they have a deep research function that is in mine and Kamal's opinion. Shout out to come all for pointing this out to me better. Just because of the UI, the way they organize it, it's better. So.\r\n\r\n\r\nNikolas Hulewsky (43:00.045)\r\nBye!\r\n\r\n\r\nNikolas Hulewsky (43:16.877)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (43:20.872)\r\nOkay, so the experience is better, not necessarily the output.\r\n\r\n\r\nChris Koerner (43:23.757)\r\nBoth.\r\n\r\n\r\nNikolas Hulewsky (43:25.838)\r\nOkay, have you messed around with grocs deep research?\r\n\r\n\r\nChris Koerner (43:26.572)\r\nBoth.\r\n\r\n\r\nChris Koerner (43:32.398)\r\nJust a little bit.\r\n\r\n\r\nNikolas Hulewsky (43:33.486)\r\nI would be curious to hear your guys' opinion on that too.\r\n\r\n\r\nChris Koerner (43:36.494)\r\nOkay, but like we've talked a lot about operator and deep deep research. Most people, myself included are hesitant to pay $200 a month, especially when free options out there exists like rock. So if you want the deep research, just use perplexities for $20 a month and you basically get the same thing if not better. Cause I'm not using operator. Like now that deep research came out, I haven't used them about two or three weeks. Um, so a little life hack.\r\n\r\n\r\nNikolas Hulewsky (43:51.608)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (43:59.682)\r\nBut let me ask you why. Why aren't you using operator? Because deep research.\r\n\r\n\r\nChris Koerner (44:03.074)\r\nbecause deep research does it for me and it's faster.\r\n\r\n\r\nNikolas Hulewsky (44:06.924)\r\nYeah, that is it. It's the same thing for me. It's like I was going to use operator to go and scrape all these sites, but now I can just tell deep research. Go to these sites, pull this information, put it into this table and it just executes it. So it's kind of weird to me like, well. Why would I ever use operator at this point, especially with given the functionality currently?\r\n\r\n\r\nChris Koerner (44:27.522)\r\nI'm assuming the operator is going to get a lot better and a lot faster and then we'll go back to using it.\r\n\r\n\r\nNikolas Hulewsky (44:30.878)\r\nyeah.\r\n\r\n\r\nChris Koerner (44:35.566)\r\nI'm having a lot of luck. I have like a GPT just called deep dives. And that's where I do a lot of my deep research prompts. And I still do deep research prompts and other GPTs, but I do it mostly in deep dive. So it'll, it'll spit out 10,000 words. And then I just say, I just say, Hey, take the most interesting things based on my preferences and give me bullet points of everything above. And it's like so much easier to.\r\n\r\n\r\nNikolas Hulewsky (44:40.654)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (45:00.942)\r\nOkay, can we talk about this right now? We both have custom GPTs. In fact, I texted you this morning about like one of your custom GPTs. Can you talk like, tell me about that custom GPT that you built? What is that?\r\n\r\n\r\nChris Koerner (45:13.366)\r\nIt's there's nothing. There's nothing custom. It's just it's just one of my GPTs that I only use for deep research. Like I didn't upload any PDFs or anything to it. There's no overriding prompt.\r\n\r\n\r\nNikolas Hulewsky (45:24.366)\r\nyou just created like a separate folder basically. Okay. Do you want to talk about GPTs? I think that would be interesting to at least like\r\n\r\n\r\nChris Koerner (45:28.502)\r\nYeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (45:35.074)\r\nMaybe not. We'll have to talk about it.\r\n\r\n\r\nChris Koerner (45:35.414)\r\nYeah, I'm not. I'm not having a lot of success with it. Like building a GPT based on all of my tweets or all like where you have a like you upload a bunch of stuff and then you have like instructions and then you just start talking to it. I haven't had a lot of success with it. Maybe I haven't given it a good enough shot.\r\n\r\n\r\nNikolas Hulewsky (45:50.934)\r\nReally? have. I have for like very specific tasks, so what we're talking about now is in chat. TPT you can build a custom GPT. It's not like you're not training it on your own data set, but you are training it more than is allowed in the current context window on chat. TPT. So what you can do is you'll say hey like I'll give you one of my custom GPTs. I have my weekly newsletter. GPT and I've trained it and I've said hey.\r\n\r\n\r\nChris Koerner (46:09.631)\r\nMm. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (46:20.598)\r\nI'm going to upload three transcripts from my podcasts from those podcasts. This is what I want you to pull out. I want you to. Summarize each business model with this these specific criteria, and here's an example of two that I've done. And then for business idea of the week, I want you to give me three suggestions based on that conversation, and then I want you to write. So so I'm telling it and then I'm giving it examples and then it's saved and I never have to enter.\r\n\r\n\r\nChris Koerner (46:43.736)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (46:49.122)\r\nthe custom prompt again, it's essentially like helping me save a prompt. So I do use it for that for like very, very specific use cases just to like get me an idea and get me going. But to your point, no, I don't find it to be like perfect every single time.\r\n\r\n\r\nChris Koerner (46:58.936)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (47:05.688)\r\nYou know what I've had better luck with is whenever Chad GPT spits out something perfect, right? It's just like my voice, my style, whatever. I always tell it, remember this. Hey, remember this. This was really good, remember this. And it will show you like a little, like a widget will appear and it's like bloop, remembered. And it will carry that memory across other chats or other GPTs.\r\n\r\n\r\nNikolas Hulewsky (47:13.24)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (47:18.218)\r\nNikolas Hulewsky (47:30.19)\r\nI had somebody post this week, Hector Resendez. He posted, he's like, Hey, I feel like I need to get into AI. Like how does a guy even get started in this space? And so I responded and said, here are my three like suggestions. Number one, just pick one chat, TBT, perplexity, Gemini. I don't care what it is. Just pick one upgrade to the pro plan on whatever, which one it is. So it's 20 bucks a month. Cool. And then stop going to Google for anything that's not geographic based.\r\n\r\n\r\nChris Koerner (47:50.446)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (47:58.638)\r\nSo if I'm not looking for a restaurant or sports team or hours of operation of a business. If I'm like, what was the biggest country in the world in 1952? Don't go to Google anymore. Go to the AI. I'm going to say chat GPT for the AI. Cool. And then third, anything that you would have used an expert or an assistant or bounce ideas off of start using chat GPT. like I really like uploading contracts or I really like uploading financial statements. I really like uploading just things that would have\r\n\r\n\r\nChris Koerner (48:00.462)\r\nHmm\r\n\r\n\r\nChris Koerner (48:09.144)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nChris Koerner (48:23.704)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (48:27.968)\r\nlonger than a paragraph that I can have to actually read through. I upload it and then it gives me bullet points and I can start just interacting with it and asking it questions. So if you're thinking about like how do I even get started? Do that, get a program plan for any of the any of the models. Stop using it for anything other than geographic questions and start anything longer than a paragraph that you need to synthesize. Putting that information into it.\r\n\r\n\r\nChris Koerner (48:54.562)\r\nI think it's a good framework to basically separate in your mind the geographical or the more recent news because open AI does not want to go scrape the internet again, right? That costs them money. And so you just know that open AI is biased. And if you're like, what's the best Filipino restaurant in Dallas, Texas, it's going to have to go look right then. And it's already done that, you know, maybe a month ago, maybe a year ago, it would rather not.\r\n\r\n\r\nNikolas Hulewsky (49:07.107)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (49:18.893)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (49:23.968)\r\nAnd so you're going to get a more biased or a less quality answer than going to Google for stuff like that. But for almost everything else, I go to Judgy PT.\r\n\r\n\r\nNikolas Hulewsky (49:32.418)\r\nTotally agree.\r\n\r\n\r\nChris Koerner (49:33.846)\r\nSo one cool framework that I found for deep research is if you're trying to think of trending things or business ideas, one of the best places I get new business ideas is just when I travel anywhere, right? Maybe it's an hour away, just out of my circle. And so I've been using deep research for that. And so I asked it a prompt, I want you to find me like unique foods in other countries that are starting to take on here in the United States. And then it spits out a bunch.\r\n\r\n\r\nAnd I can take one of those or more and go deep on that one and see, huh, could there be an opportunity there? And I found something interesting called banana ketchup. Have you ever heard of that Nick?\r\n\r\n\r\nNikolas Hulewsky (50:14.124)\r\nI've heard of banana hammocks, but I've never heard of banana ketchup.\r\n\r\n\r\nChris Koerner (50:18.636)\r\nAll right. All right, banana ketchup.\r\n\r\n\r\nIt is 90 % of the ketchup market in the Philippines. Okay? Yeah, it's ketchup made out of bananas. It's healthier.\r\n\r\n\r\nNikolas Hulewsky (50:28.983)\r\nWhat?\r\n\r\n\r\nNikolas Hulewsky (50:33.678)\r\nOkay.\r\n\r\n\r\nChris Koerner (50:34.039)\r\nOkay, okay. They eat it with their spaghetti, with their eggs.\r\n\r\n\r\nNikolas Hulewsky (50:36.076)\r\nBut... but ketchup's tomatoes.\r\n\r\n\r\nChris Koerner (50:40.47)\r\nNot in the Philippines. Okay.\r\n\r\n\r\nNikolas Hulewsky (50:42.978)\r\nOkay.\r\n\r\n\r\nChris Koerner (50:44.782)\r\nThe banana ketchup market in the US is 225 million and growing at like 7 % a year.\r\n\r\n\r\nNikolas Hulewsky (50:52.622)\r\n$225 million a year. Tiny.\r\n\r\n\r\nChris Koerner (50:56.076)\r\nYeah. Yeah. But. Seven percent.\r\n\r\n\r\nNikolas Hulewsky (50:59.918)\r\nTell me the growth percentage again. Wait, wait, wait, tell me the growth percentage again. That's not that fast growth.\r\n\r\n\r\nChris Koerner (51:07.36)\r\nIt's like if you look at the Google trends data, is booming. Like search volume for banana ketchup specifically in the United States is booming right now.\r\n\r\n\r\nNikolas Hulewsky (51:13.006)\r\nOkay, hold on. So we're talking about frameworks. Say that again. So you you're traveling use food, you're using food, what food is popular, you find you found banana ketchup, and then you went to Google Trends. So you didn't just go to like Google.\r\n\r\n\r\nChris Koerner (51:20.802)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (51:28.526)\r\nNo, no, no. Well, yeah, yeah, yeah, yeah, yeah. Then I'm like, OK, interesting. I go to Google Trends, type in banana ketchup, look at the last five years, 12 years.\r\n\r\n\r\nNikolas Hulewsky (51:34.176)\r\nOkay. Okay, so you're not going to Google period and being like, what is the gross domestic product? Okay, you're going to Google trends, because that's actually real time data.\r\n\r\n\r\nChris Koerner (51:41.059)\r\nMm-mm.\r\n\r\n\r\nChris Koerner (51:46.314)\r\nI'm just looking for redundancy on what Chad GPT told me. And if I find it outside of Chad GPT, then I go back to deep research and I say, huh, banana ketchup. That's interesting. I went.\r\n\r\n\r\nNikolas Hulewsky (51:56.162)\r\nAnd when you say redundancy, you just mean you're to find evidence that what Chachi Buti said is true.\r\n\r\n\r\nChris Koerner (52:00.49)\r\nAnother data point. Yeah. Yeah. And then this was my exact prompt. I said, deep dive on banana ketchup in the Philippines and launching something similar in the U S is there an opportunity here there? And then it's like, do you want feasibility study, general market analysis, comparisons with other contents? Yeah. Yep. And then I say, it gave me four bullet points. And I said, yes to the top three, no to the fourth. And it gave me so much info. And then I'm like, okay, good. Just give me bullet points to this.\r\n\r\n\r\nNikolas Hulewsky (52:18.158)\r\nbecause you're doing deep research.\r\n\r\n\r\nNikolas Hulewsky (52:30.232)\r\nHmph. Okay, fill me in. What were the bullet points?\r\n\r\n\r\nChris Koerner (52:35.054)\r\nYou can charge $4 to $6 a bottle. It says according to Google's keyword tool, there's much more demand than supply. It kind of looks at it like Sriracha was 10, 20 years ago. Because 20 years ago, you're like, OK, what kind of market is there for pickled pepper sauce called Sriracha? Well, that's pretty huge.\r\n\r\n\r\nNikolas Hulewsky (52:50.346)\r\nMm, yeah, yeah,\r\n\r\n\r\nNikolas Hulewsky (52:58.69)\r\nRight. Peter Piper picked a pack of pickled peppers.\r\n\r\n\r\nChris Koerner (53:02.838)\r\nExactly right. So yeah, I just think it's interesting. Like people are going away from red dye, right? Red dye is being banned in the US. It's a healthier alternative to ketchup. Ketchup is the biggest condiment in the United States by far. Something interesting there.\r\n\r\n\r\nNikolas Hulewsky (53:20.398)\r\nCan I give this is kind of an example of how I use deep research? All right, so I downloaded all of my tweets because you can download that from Twitter. It takes a while. It takes like 24 hours for them to actually produce it for you. And I got this massive file. And what do you want to know out of your tweets, right? You want to know which ones perform the best. You want to know which ones had the most engagement, right? And so whereas\r\n\r\n\r\nChris Koerner (53:26.029)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (53:33.539)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (53:47.928)\r\nA couple of months ago, I would have probably just uploaded the sheet and been like, tell me which tweets were the best. I don't do that anymore. This is the prompt I gave it. You ready? I have a spreadsheet with all of my Twitter posts from the last year and a half. There are about 520 lines of data. Each line has a link to the post. Yeah.\r\n\r\n\r\nChris Koerner (53:56.398)\r\nOkay, yeah.\r\n\r\n\r\nChris Koerner (54:06.158)\r\nLet me interrupt you. I really like that you said how many lines of data there are because a lot of times it will just pull from a sample size and you don't even know until you really start probing. So it's like, this is what to expect, right?\r\n\r\n\r\nNikolas Hulewsky (54:12.824)\r\nDo you know why I started doing that actually?\r\n\r\n\r\nChris Koerner (54:19.734)\r\nI'm assuming because it was only pulling from a sample size,\r\n\r\n\r\nNikolas Hulewsky (54:22.698)\r\nNo, actually, I didn't know was pulling from a sample size. I started doing that because of our conversation of you building that tool with Steve with our friend. Yeah, yeah, yeah, yeah. Because you were you were like, why the freak isn't this data correct? And then you found out it's only pulling a sample size of 10. So I was like, I don't want you pulling a sample size. I want you pull pull it all the day. So that's why I include all of all of the lines now.\r\n\r\n\r\nChris Koerner (54:29.895)\r\nand how mine was only pulling from a sample size.\r\n\r\n\r\nChris Koerner (54:38.595)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (54:48.044)\r\nAre you able to look at each post and categorize it for me? I would like you to. I would like you to give a brief one line 30 characters or less description. Categorize the post with at least one of these tags podcast thread. How to guide quick share troll because I want troll tweets framework tool deep dive personal and story. Give me a quality score on the post based on a mix of the number of views.\r\n\r\n\r\nChris Koerner (54:51.649)\r\nMmm.\r\n\r\n\r\nChris Koerner (54:58.35)\r\nThat's cool. That's cool.\r\n\r\n\r\nNikolas Hulewsky (55:18.178)\r\nbookmarks and likes relative to my followers at the time.\r\n\r\n\r\nChris Koerner (55:23.224)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (55:24.802)\r\nand then I enter. Okay, so the reason I wanted to read it out is because it was like, there are probably people listening who are like, wow, that was a lot more detailed than I would have asked. Chat tbt, we've talked about this before. If you want to get the right answer, you've got to ask a longer question. And, and even after asking that, I there were other follow up questions that I had to clarify. But I think is, I've like shifted my mind is like, this is a research assistant, I've got to be very specific with them. They're going to give me good data back, but I've actually got a\r\n\r\n\r\nChris Koerner (55:34.296)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (55:54.542)\r\nprompt it in the way that I would prompt a human to go and look at this data.\r\n\r\n\r\nChris Koerner (56:00.01)\r\nYeah, because you and I do that all the freaking time. We've been employing people like, hey, go get this done. And they're like, OK. Like they're eager, please. They're like, OK. Then they're like, frick, what do I actually do?\r\n\r\n\r\nNikolas Hulewsky (56:10.526)\r\nOr worse, they go do it and they come back to us and they're like, here's 10 hours of work. And you're like, that is not at all what, yeah, that's not at all what I wanted. And it was our fault for not being clear on what we wanted.\r\n\r\n\r\nChris Koerner (56:17.464)\r\nWhat are you doing? Are you stupid?\r\n\r\n\r\nChris Koerner (56:27.342)\r\nYeah, it's like, the more you treat it like a human, the better it performs, which is a little freaky.\r\n\r\n\r\nNikolas Hulewsky (56:34.658)\r\nYeah, it is very frequently very free. I was thinking about this last night on the drive home, OK? AI is going to get really good, right? We have really good and really bad employees though, and they're very smart. What if we have AI developed and it's not the tool that we think it's going to be? It's like, it's going to help me. We give it a prompt. It's like, nah, I don't like what you asked me. Actually, here's what you should be looking at. No, you should actually just be looking at.\r\n\r\n\r\nChris Koerner (56:47.107)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (56:59.278)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (57:03.086)\r\nThe number of tweets by month and the aggregate volume of views. That's what you should be. It's like, well, I didn't ask you that I want. I want to know exactly what my tweets like. I'm curious. That's what I'm getting that right is like I'm curious if at some point. You know we've got to figure out how to it back in, but anyways, that was a quick squirrel.\r\n\r\n\r\nChris Koerner (57:06.722)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (57:11.308)\r\nAnd some employees do that too. Yeah.\r\n\r\n\r\nChris Koerner (57:19.086)\r\nAnd then when you combine AI with hardware like a robot and it does the same thing, it's like, huh, instead of cooking you stir fry, I'm going to kill you. Now that, okay.\r\n\r\n\r\nLet me, let me ask you something about agents. I feel like agents are, it's almost like crypto even today or five years ago where it's like, everyone's like crypto this crypto that, and it's like, hold on, hold on. Yeah. Web three backup. Who's actually using this? Like who is actually buying their, their coffee with crypto? Well, no one, but like, there's potential and we just need to put our tax records on the blockchain, yada yada yada. And it's like the business of crypto is buying and selling crypto. And like today,\r\n\r\n\r\nNikolas Hulewsky (57:35.18)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (57:43.629)\r\nWeb 3.\r\n\r\n\r\nChris Koerner (58:02.316)\r\nThat's still pretty true, right? I feel like agents is very agents are very similar. There are literally over five over five companies that have raised seven to eight figures just to be an outsourced sales agent. OK, outs you know, outsource your sales to an agent. OK, there's a lot of money, billions of dollars pouring into companies building agent wrappers, right?\r\n\r\n\r\nNikolas Hulewsky (58:04.354)\r\nYeah. Yep.\r\n\r\n\r\nNikolas Hulewsky (58:20.152)\r\nWow.\r\n\r\n\r\nChris Koerner (58:28.558)\r\nAnd like we're all talking about it. Agent this and I was talking to Kamal a month ago and it's like, hey, anytime I have something to do, if you can't do it, then see if the VA can do it. If the VA can do it, see if an agent can do it. That's the new framework. So we don't have to hire a bunch of people. Okay, cool. Who is actually using agents to do tasks for them autonomously without intervention on a daily basis? And like, what are those? No, no. Like I'm, I'm, I'm trying like there's gum loop, there's Lindy.\r\n\r\n\r\nNikolas Hulewsky (58:29.102)\r\nHmm\r\n\r\n\r\nNikolas Hulewsky (58:49.09)\r\nAre you?\r\n\r\n\r\nNikolas Hulewsky (58:53.198)\r\nYou're like actively trying.\r\n\r\n\r\nChris Koerner (58:57.208)\r\nThere's all kinds of tools that like make integrating things and automating things like the Zapier AI. There's a bunch of tools that do that. But like Lindy, we spent hours trying to get Lindy to work with my freaking inbox and it's just not there. And I want it to be there. Are you using agents?\r\n\r\n\r\nNikolas Hulewsky (59:15.79)\r\nI tried like I'm trying to use agents. The problem with agents is like I still feel like it's it's manual. Right, like operators, the perfect example you have to sit there with your tab open and watch it move slower than a human to actually complete a task or a function. Now. I don't think all APIs. I don't think all integrations are the same as the way the operator works, but that's like a good analogy where it still feels like RPA. Right, like.\r\n\r\n\r\nChris Koerner (59:22.318)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (59:31.81)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (59:45.03)\r\nor is RPA, robotic process automation. Right, so like robot RPA for people who don't know, I didn't know what it was, but it was very, very specific set of instructions of what to do. Okay, at 10am, go to this website, click this link, click download this report, export it to this file. But it was it was very, very, very specific. And so you could do really cool things. You could like run a report every single day and then populate a dashboard. But it wasn't an agent.\r\n\r\n\r\nChris Koerner (59:48.526)\r\nMmm. Yeah.\r\n\r\n\r\nChris Koerner (01:00:00.856)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:00:14.73)\r\nIt was just doing what you told it to do. And so I feel like we're saying the word agent, but it's still this like robotic process automation system. It's going to be agents when we can say, hey, find me the best tweet yesterday in SMB that performed the best, right? And then it goes out and using context and critical reasoning. It's like,\r\n\r\n\r\nChris Koerner (01:00:14.744)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:00:36.92)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:00:42.862)\r\nOkay, well, this one didn't get the most views, but I had the most bookmarks and had the most shares and oh, this one was actually retweeted by Mark Cuban. And you know what I mean? Like best tweet, how do you define that? Like either you're have to do the robotic process automation and very clearly defined pull the best tweet or you have an agent that you can say pull the best tweet and it goes and executes that task on its own. I have not found the agency yet. I've found the robotic process automations.\r\n\r\n\r\nChris Koerner (01:00:52.558)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:01:04.11)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (01:01:07.31)\r\nwhich sucks. I want them to be here. But yeah, I think I told you this a week ago, like my mind's kind of shifted from AI is going to replace everybody in six months to it's going to disrupt and displace a lot of things, but the adoption curve is still going to be a long one. Like it's not\r\n\r\n\r\nChris Koerner (01:01:08.942)\r\nWe're still so early.\r\n\r\n\r\nChris Koerner (01:01:26.264)\r\nDude, it's the last mile, like the last mile for any new innovation is so long. Like self-driving cars, that last mile, like it's so hard to just get that last bit finished.\r\n\r\n\r\nNikolas Hulewsky (01:01:41.462)\r\nYeah. Well, and think about it like this. We have been working for years on achieving AGI, the smartest humans in the world. At some point, we're going to get to AGI, and at some point, there's going to be parity between a human and a computer. But at that point, when there's parity, it's only that we have like more smart humans to work on problems. Right. We don't have smarter humans yet to work on problems. We just have more smart humans to work on problems.\r\n\r\n\r\nChris Koerner (01:01:58.904)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:02:06.68)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:02:11.95)\r\nSo we will get there. There will be an inflection point where we're able to actually develop smarter technology because we've brought computers along and they've reached AGI. we're just not even, we don't even have the resources yet to really get to that point.\r\n\r\n\r\nNikolas Hulewsky (01:02:30.766)\r\nAnyways, I got an idea for you. We had a guy. We had a guy tag us on the Twitter sphere. Dragon Slayer 69420 said, no, kidding. This Zach Ashburn. Zach tagged us. It was a video of him saying, look at this freaking thing right here. Did you watch it? OK, so I'll explain it and then we can talk about it. I thought it was really cool. I don't remember exactly what it is, but his wife.\r\n\r\n\r\nChris Koerner (01:02:30.862)\r\nAlright, what you got for me? Okay.\r\n\r\n\r\nChris Koerner (01:02:49.038)\r\nMm-hmm. Mm-hmm. Yep.\r\n\r\n\r\nNikolas Hulewsky (01:02:57.866)\r\nsomehow is in the fashion industry. I don't know if they have an e-commerce store or if she just works in the fashion industry. But he was talking about how in the fashion industry, they have to make decisions a year in advance. So they, they're guessing basically is like, okay, what does fall 2026 fashion look like? Because if we want to deliver fashion in fall 2026, we've got to buy products, we've got to manufacture it, we've got to get it shipped. Like there's a whole lag in between when it's produced and when it's actually popular. And in order to prepare for that,\r\n\r\n\r\nthese people will literally read industry reports of like, hey, this is what we think is going to be the most popular thing a year and half from now. Here's the color scale. Here are the different fabric types, all of those things. And his idea was, why would you not be using chat tpt operator and operator deep research to effectively create these forward looking reports and sell them at a much cheaper price point than what companies are currently doing?\r\n\r\n\r\nChris Koerner (01:03:50.414)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:03:55.274)\r\nI thought that was really interesting. So it wasn't just fashion. I went and asked operator I was like, Hey, tell me if there are any other industries that do this. And it gave me some good ones. So so he said fashion. Here are some of the other ones that it gave me. Food and beverage. Right? Hey, what food and beverage is going to be popular a year from now? Because again, there's a lag time between\r\n\r\n\r\nwhat's popular and when you actually produce it. So you could, you could build reports for people to say, this is where preferences are trending. did you know that there's a never touch plastic.com that's booming right now. So actually a year from now, we think it's going to be three times as big. And so you should have XYZ products on your shelves. Okay. Technology. So you could literally go and say, Hey, here are the top 20 Google trends right now. I went on Google trends and these are the top 20 things. This is what it means for your industry.\r\n\r\n\r\nChris Koerner (01:04:24.024)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:04:36.984)\r\nMmm. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:04:50.37)\r\nDid you know more and more people are searching? I don't know in home caregiver. Well, that means the industry is going to grow at a rate of 10 X percent. And this is the product that you could sell through that vertical, right? Automotive. This was this was an interesting one. Just looking forward and predicting long term shifts, not only in technology of new cars coming out, but the current cars that are being produced today. What problems are they going to have down the road? Right? Like,\r\n\r\n\r\nChris Koerner (01:05:15.438)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (01:05:16.098)\r\ngoing to have a big problem with LCD screens needing to be replaced in about five years because all those cars that we sold are going to have problems. I like this idea of like, because I think AI is really good at this, taking information and extrapolating data points that help you understand not only what happened, but how to look for patterns in the future. And I think that this would be like a perfect use case. So thank you, Zach.\r\n\r\n\r\nI'm going stop talking. What do think?\r\n\r\n\r\nChris Koerner (01:05:47.758)\r\nI think it's great. It's a no-brainer. It's like...\r\n\r\n\r\nChris Koerner (01:05:54.254)\r\nHow long of research has been around, right? Like forever. Okay. I mean, pick an industry, healthcare, science, math, engineering, whatever. They're like, there's just so many variables out there to really dive deep on and to connect data points on from here to there. So with, with deep research being, you know, a thousand PhD level researchers in your pocket, we're going to be uncovering incredible use cases for deep research for the next decade. Like,\r\n\r\n\r\nWhere does it end?\r\n\r\n\r\nNikolas Hulewsky (01:06:23.554)\r\nYeah. I was talking to somebody the other day. And for thousands of years recorded history, every king has had their court, right? Their advisors. Hey, I got this guy. He's an expert on whatever farming he's in. This guy's an expert on war. This guy's an expert on commerce. This guy's an expert on trade, whatever. We don't have that at our fingertips. Like, I now can have an expert on all of those things at my fingertips. Whereas in the past, it was the billionaires who could afford to have somebody on their staff who was like, Hey, look,\r\n\r\n\r\nChris Koerner (01:06:40.152)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:06:45.87)\r\nI\r\n\r\n\r\nNikolas Hulewsky (01:06:53.494)\r\nget Brian, he's the AI expert, get him in here. I want to ask him a question. And it's like, Yes, sir. I and Brian graduated with a PhD in like computer science from Stanford University. You know what I mean? It's like\r\n\r\n\r\nChris Koerner (01:06:56.002)\r\nYeah, I got a guy for that.\r\n\r\n\r\nChris Koerner (01:07:04.29)\r\nYeah, so he only knows stuff about computer science and there's only one of Brian.\r\n\r\n\r\nNikolas Hulewsky (01:07:07.426)\r\nRight? Right. And it's like, great, I have like the best expert in this field, who works directly for me. And so that billionaire is able to make much better decisions because he actually has the right inputs. Well, now we have that at our fingertips. Nuts.\r\n\r\n\r\nChris Koerner (01:07:20.034)\r\nYeah. And Brian is so biased because his favorite professor specialized in Java. And so he loves Java. And like, you know what I'm saying? Whereas like deep research doesn't give a crap. It's just going to give us a bunch of data. back to agents. Like we're all talking about agents. Well, like we need to be talking about deep research. Like that's an agent. You just have to prompt at once.\r\n\r\n\r\nNikolas Hulewsky (01:07:25.368)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (01:07:29.378)\r\nNo.\r\n\r\n\r\nNikolas Hulewsky (01:07:41.686)\r\nIt is an agent because it's doing agentic things. going out and it's scraping and it's putting it into a data set for you. If you ask for a data set, it's giving you the links. You still have to go and digest it yourself to understand it. But it's an agent.\r\n\r\n\r\nChris Koerner (01:07:53.614)\r\nLet me tell you, Nick, you sound really smart when you say the word agentic. Okay. You need to know that.\r\n\r\n\r\nNikolas Hulewsky (01:07:58.83)\r\nCan you say that again so can play it for my wife?\r\n\r\n\r\nChris Koerner (01:08:02.478)\r\nThat's unnecessary. hit repeat. Let me bring an idea that's not AI related and see if you like it, okay?\r\n\r\n\r\nNikolas Hulewsky (01:08:11.394)\r\nI love it.\r\n\r\n\r\nChris Koerner (01:08:12.62)\r\nI would hate to talk about someone else's business idea and not name them. All right, I'm not going to call this person some guy. All right, I'm going to call him his actual username at Justin underscore XYZ on Twitter.\r\n\r\n\r\nNikolas Hulewsky (01:08:20.65)\r\nhuh? What?\r\n\r\n\r\ninteresting. You give them attribution. That's really weird. I didn't think you're supposed to do that. I don't think you're supposed to do that. I hadn't thought that.\r\n\r\n\r\nChris Koerner (01:08:28.002)\r\nYeah. Hmm. I don't know. I know. I just thought I just I thought I'd do something nice today. You know, maybe pay it forward. So Justin from Taiwan, that's his Twitter name. He tagged me on a tweet. And have you ever heard of Activate Games? Nick. Activate Games is a retail space blowing up. I think it's a franchise blowing up across the country.\r\n\r\n\r\nNikolas Hulewsky (01:08:47.635)\r\nNo, I've heard of Activision, Blizzard, but no, not.\r\n\r\n\r\nChris Koerner (01:08:56.494)\r\nThey're in about 4,000 square feet. You're going to find them next to a Chipotle or a Shake Shack. And they're for families, kids and adults, millennials, all ages. You go in, you pay 35, 45 bucks and you're in this room that has all these rooms that break off. you go in this main room with all these touchscreens and a scoreboard, and then you go play these games like basketball games or tight, like tiles on the floor that light up or, know,\r\n\r\n\r\nNikolas Hulewsky (01:09:19.639)\r\nMmm.\r\n\r\n\r\nChris Koerner (01:09:23.16)\r\nKind of like carnival games, but it's all gamified. You're connected to everyone else there. You have a certain amount of time to do it. you just, there's like 15, you know what? There's like 15 different rooms. Each room has like five to 15 different games. So there's hundreds of different games in this one space for 35 bucks. It's fun as crap. It's a legitimate workout. Like you break a sweat and think like escape room or like a trampoline park, but better than both of them. This is, it's just blowing up.\r\n\r\n\r\nNikolas Hulewsky (01:09:50.19)\r\nIt's like a modern Chuck E Cheese.\r\n\r\n\r\nChris Koerner (01:09:53.979)\r\nYeah, yeah, that's a good, but like for all ages.\r\n\r\n\r\nNikolas Hulewsky (01:09:55.342)\r\nYeah, it's just got like a ton. Right, it's got a ton of different games. You could go play a ton of different games, but these are these are like a lot more physical.\r\n\r\n\r\nChris Koerner (01:10:01.454)\r\nYes. Like it's a place for you to bring your kids or for you to go on a double date with your wife and two other adults. No kids. Like it's, it's for literally for all ages. Okay. So this guy on Twitter found the source of these floor tiles. They're like these light up tiles. they cost like, I don't know, $15,000. You can set up a whole room with the hardware, software, everything.\r\n\r\n\r\nNikolas Hulewsky (01:10:12.568)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (01:10:29.166)\r\nCheers.\r\n\r\n\r\nChris Koerner (01:10:29.964)\r\nand you can charge people to play instead of hundreds of different games in a big expensive retail space, you can set them up in your house and charge people 10 to 20 bucks to play 10 different games all based on these floor tiles. What do you think? Yeah, like you just set up an iPad, little touch screen, which game do you want? And then it plays and you've got lights and you've got the tiles and you dance and you jump from one to the other and there's a timer and like you could legit, this could be a side hustle.\r\n\r\n\r\nNikolas Hulewsky (01:10:44.973)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (01:10:57.582)\r\nDude, like in my mind goes to a mobile side hustle. Like, there's a corporate event. hey, we're having the company picnic this year. It's at Gerber Park. that's cool. Hey, let's get the the game company mobile games. yeah, great idea. And then you come and you have your tile and it's like, the kids want to play a game. Cool. What game do want to play? And they just, you know, they take turns playing. doesn't have to be in a physical location that you're renting out. You could just start on a mobile basis.\r\n\r\n\r\nChris Koerner (01:11:01.165)\r\nSure.\r\n\r\n\r\nChris Koerner (01:11:06.211)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:11:13.88)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:11:22.606)\r\nI would bet it takes like 30 to 60 minutes to set up. Yeah, but even so, that's like $20 worth of labor. You set it up at a park or an outdoor shopping area or as long as you have, yeah.\r\n\r\n\r\nNikolas Hulewsky (01:11:26.386)\r\nreally?\r\n\r\n\r\nNikolas Hulewsky (01:11:33.934)\r\nTotally. Well, yeah, I think of like, schools when they're having their like back to school fairs, and they're raising money, carnivals, especially in the summer when you're having a budget, you know, cities are having lots of things. This would be like the perfect thing you just set up.\r\n\r\n\r\nChris Koerner (01:11:52.622)\r\nYeah, this this guy claims I can't I can't vouch for this, but he says for under $15,000 you can set up a room that pays for itself in a month. Charge $25 a person, six to eight people per session, five to six sessions per day. That's $1000 a day. Our clients are already doing it. Now, granted, he's selling these things. It's in his best interest to say that, but. It's interesting. Because like I wanted to take my daughter to activate games. We showed up and they're like, oh, there's yeah, yeah, you can play. There's a four hour wait.\r\n\r\n\r\nAnd I crunched the numbers and like, cause you can see on their website, how many slots, how many people per slot at a hundred percent occupancy they're doing like 7 million a year.\r\n\r\n\r\nNikolas Hulewsky (01:12:31.278)\r\nDid you know where this would crush in a college town that doesn't allow liquor? Like, I don't know, Prevot, Utah.\r\n\r\n\r\nChris Koerner (01:12:42.261)\r\nyou mean in the only college town on the planet that doesn't allow liquor?\r\n\r\n\r\nNikolas Hulewsky (01:12:44.686)\r\nI'm just thinking, like, like, if you set it up in the dorms, or if you set it up in like shared student housing, especially, I'm thinking BYU, right? It's like,\r\n\r\n\r\nChris Koerner (01:12:54.798)\r\nHmm. Harmony Hall or or sorry. What is it? Heal him in halls.\r\n\r\n\r\nNikolas Hulewsky (01:12:59.778)\r\nHeal him in halls. Nephi Hall. They knocked those down. I think they're now. I don't know anyways, but yeah, it's just like for young couples to go have a date. That would be a freaking really cool place to go. Have a date. Anyways, it could be in the dorms. It could be at the University itself. Could be something mobile. That sounds like the perfect side hustle actually.\r\n\r\n\r\nChris Koerner (01:13:15.81)\r\nIt would be.\r\n\r\n\r\nChris Koerner (01:13:23.862)\r\nI agree. 15 grand? All day.\r\n\r\n\r\nNikolas Hulewsky (01:13:28.78)\r\nI like that one.\r\n\r\n\r\nAll right, I have one. So I this guy on my podcast. His name is Ethan. In fact, let me find his last name really quick.\r\n\r\n\r\nYes, Ethan Cohen. Dude, it was, I had planned to talk to him because he's franchising his business model. I plan to talk to him about franchising. He told me the craziest freaking story. Like, it was just bonkers of how he got into doing what he's doing. Here's the long, the short of the long. He goes to college. He has saved up $15,000 and proceeds to lose it.\r\n\r\n\r\nin a four week period of time because he gets into betting and gambling. And the more he loses, the more he doubles down, he's going to make his money back, whatever has to go and confess to his dad. His dad's like, you're never doing this again, man. Here, sign this contract. So makes it. His dad makes him write out this contract. He goes back to college. He's doing fine. Gets an internship six months later. He's got six grand NBA playoffs roll around. He's got the trigger trigger finger. Gambles again, loses it all. He's lost over $20,000 at this point. OK.\r\n\r\n\r\nChris Koerner (01:14:13.197)\r\nHmm.\r\n\r\n\r\nChris Koerner (01:14:34.197)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (01:14:41.176)\r\nThen he's like, crap, gotta tell my dad. So he tells his dad. And the lesson he takes from this is not, should stop gambling. The lesson he takes from this is, well, Vegas always wins. Why don't I just become Vegas? So he starts a sports book. He becomes Vegas. His friends all start placing bets through him. In one month, in one month, he's like, I made 22 grand the first month that I had this book, this betting book. He's like, but people weren't paying me. And I had to be like threatening to them.\r\n\r\n\r\nChris Koerner (01:14:57.654)\r\nThat's pretty smart. Alright, that's pretty smart. You got me.\r\n\r\n\r\nNikolas Hulewsky (01:15:10.698)\r\nAnd always. Yeah.\r\n\r\n\r\nChris Koerner (01:15:10.702)\r\nBanana in the sizzle reel, Mohammed and Simon put that line in there where it's like, well, Vegas always wins. Why don't I just become Vegas? That's gotta be in the sizzle reel. All right, keep going.\r\n\r\n\r\nNikolas Hulewsky (01:15:20.59)\r\nThat's a good one. That's a good one. So he makes 22 grand, but he got he's owed like 10 grand from these other people and they're not paying him. And he's like, I had to contact a guy he goes on the dark web. He emails this guy his social security number and is like, Hey, look, man, I have your social security number, either pay us what you OS or I might be doing something with this. the guy ends up eating. Yeah, Ethan had Ethan had a guy who did that for and eat. So Ethan's like,\r\n\r\n\r\nChris Koerner (01:15:42.219)\r\nEthan did that?\r\n\r\n\r\nNikolas Hulewsky (01:15:47.906)\r\nI just didn't like it. I didn't like feeling like that. So I ended up getting rid of the sports book, selling it. He then gets into vending machines and starts selling zin through vending machines, like totally freaking\r\n\r\n\r\nChris Koerner (01:16:01.226)\r\nIt's insane, He committed Zinfidelity?\r\n\r\n\r\nNikolas Hulewsky (01:16:04.472)\r\nfreaking amazing. It's Dude, he was screaming Zen Fidelities. That's how bad it was. We're so stupid. You're either zender you're out. He was all Zen dude, like once he found that business, he was all Zen. Anyways, start selling Zen in these vending machines, places it in his dorm. He's making like $3,000 a month. A kid in his dorm, or not his dorm, his frat house breaks it.\r\n\r\n\r\nChris Koerner (01:16:13.132)\r\nYou're either Zen or you're Zen.\r\n\r\n\r\nNikolas Hulewsky (01:16:34.606)\r\nHe's in Europe. He gets a message. It's like, dude, your vending machine broken. He's like, oh crap. Two minutes later. Also, dude, that video is trending. Videos freaking trending. Three million. The video of them breaking the vending machine. Yeah, so they take a video videos of him breaking the vending machine is now freaking trending on Barstool Sports. He starts getting all these DMS people. like, hey, how did you get his Zen vending machine? He's like, oh well, all I did was buy an old vending machine and then I swapped out.\r\n\r\n\r\nChris Koerner (01:16:44.866)\r\nWhat video?\r\n\r\n\r\ndidn't know there was a video of it.\r\n\r\n\r\nNikolas Hulewsky (01:17:04.622)\r\nI took I got rid of the the the coin and the and the paper money reader and we just inserted a credit card reader. They're like, oh, could you do that for us? He gets 100 orders. He's ordered them, he's placing them there in the process of fulfillment. He's placed 30 of them. He gets a loan for $250,000 from friends and family. He's looking at this. He's like, dude, I'm going to make 1880 $80,000 a month in profit. This is March of 2020, Chris. What happens March of 2020?\r\n\r\n\r\nChris Koerner (01:17:32.12)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (01:17:34.272)\r\nEverything shuts down, dude. Everything shuts down. So then he's got these machines that he can't place. Anyways, he's got to like retool everything. It was nuts. It was a crazy story to hear. The interesting thing that I took from that was he got started by buying these old vending machines for like three grand. And then working with this Israeli company that's apparently the number one company for the credit card payments on vending machines. To then retrofit them with the electronic payments.\r\n\r\n\r\nChris Koerner (01:17:57.816)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:18:03.822)\r\nAnd then all of a sudden he's like, it's still like I was just buying the shell essentially to make sure that it was safe. But then I had vending machines for way cheaper. So I just really liked the idea that he had, which was going and buying old shells of vending machines and retrofitting them with new technology and then placing them within colleges. I using the colleges as a distribution model, I think is a really interesting idea. I mean, we tried to do this with co-founders where we were looking for.\r\n\r\n\r\nChris Koerner (01:18:08.12)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:18:33.706)\r\npeople to start business with us using the college system as a distribution channel. He's using it for vending, but I wonder if there's any other cool ideas. Anyways, I just vomited a lot. do think?\r\n\r\n\r\nChris Koerner (01:18:43.448)\r\nDude I just love how his brain works because it reminds me of the Midwip meme distribution curve where it's like all the guys in the middle are like alright time for some research and development we're gonna figure out how to make a vending machine that can dispense the Zen canisters alright let's get a 3D rendering of a Zen canister and like he's just like we're gonna buy a vending machine to put Zen in it.\r\n\r\n\r\nIt's like, no, you can't do that because no, can just do that.\r\n\r\n\r\nNikolas Hulewsky (01:19:10.946)\r\nWell, and it's funny because the story that he told, he was like, I thought I was me patenting these machines and he's like, and then eventually it was just like, no, I'm just buying machines and retrofitting them to sell sit in them.\r\n\r\n\r\nChris Koerner (01:19:21.974)\r\nYeah. Or like, what's the book or the movie about the guys, the MIT crew that goes and like beats the house? Blackjack?\r\n\r\n\r\nNikolas Hulewsky (01:19:29.134)\r\nyeah, 21. I think it's called 21. Yeah.\r\n\r\n\r\nChris Koerner (01:19:32.226)\r\nsomething like that. So that's like one end of the spectrum. And they're like, all right, we're going to beat Vegas by using data and machine learning. and he's like, I'm just, I'm just going to be Vegas. Like, I don't need to be Vegas to the world. need to be Vegas to my dorm room and I'll do just fine. It's the same mindset.\r\n\r\n\r\nNikolas Hulewsky (01:19:47.47)\r\nWell, dude, it's so crazy. He's like totally clean cut. Like from Beverly Hills, I'm guessing from a Jewish family. Great kid. And I'm like, hold on a second. You became a gambling, a degenerate gambler. Then you became a bookie. Then you started selling vice products like drugs. You became a drug dealer. Like, how did this evolution happen? So nuts.\r\n\r\n\r\nChris Koerner (01:20:15.832)\r\nchecking all the boxes. I think I'm having him on the podcast at some point.\r\n\r\n\r\nNikolas Hulewsky (01:20:17.07)\r\nIt's pretty good.\r\n\r\n\r\nWell, you'll probably release it before me. usually what happens. Bias for action.\r\n\r\n\r\nChris Koerner (01:20:25.781)\r\nI just cut off.\r\n\r\n\r\nNikolas Hulewsky (01:20:27.022)\r\nNo, you'll like, you'll like his story. It was, I like it. Yeah, it was awesome. You should be. Hey, keep it sleazy.\r\n\r\n\r\nChris Koerner (01:20:32.844)\r\nI'm stuck. All right.",
  "metadata": {
    "duration": "",
    "date": "2025-03-28",
    "platform_source": "Google Drive"
  }
}