{
  "episode_number": "89",
  "episode_title": "Quit Your Job, Buy a Business: Advice for Aspiring Entrepreneurs with Yvette Owo",
  "guest_name": "Yvette Owo",
  "business_name": "YOLO Accounting",
  "transcript": "﻿Nik (00:00)\r\nYvette, welcome to Nekonomics.\r\n\r\n\r\nYvette Owo (00:04)\r\nHello, Nick. How are you? I'm excited to be here.\r\n\r\n\r\nNik (00:05)\r\nStuck down? I'm freaking great now that I'm talking to you. Let's jump into this thing. Tell me, what is your business and how do you make money?\r\n\r\n\r\nYvette Owo (00:15)\r\nThat's great. So I run YOLO accounting. We do accounting and tax work and &A analysis. So you're going to buy or sell a business, we can help you with that. And that's how we make money. Taxes, bookkeeping, sometimes payroll, other accounting activities, due diligence, things related to buying and selling a business.\r\n\r\n\r\nNik (00:36)\r\nHow old is the business you have?\r\n\r\n\r\nYvette Owo (00:38)\r\nSo I have to I started an accounting firm and then I bought an accounting firm And I closed on this one April 19th and this one was originally started in 2004 so it's been around for a while Yeah\r\n\r\n\r\nNik (00:51)\r\nbeen around for a while and like just give me so you started and you bought give me an idea of kind of what's the top line revenue how many employees do you have\r\n\r\n\r\nYvette Owo (01:00)\r\nGod, the employee numbers are hard. So top line is like two million. And I say the employee numbers are hard because so I separate them into groups. So I think there's three in one, eight. We also did two hires and I don't include myself. And then what I don't mention is I also have Yellow Companies, which is the entity that keeps searching for new businesses at all times.\r\n\r\n\r\nAnd so then there's four, that's a very self -managed team. There's four people there right now. And that team scales up and down that are every day looking for new businesses for me to buy, that are in accounting businesses. Yeah.\r\n\r\n\r\nNik (01:43)\r\nOkay, so we're at like 16, is it 16 employees? Okay. What's combined top line revenue for the accounting companies?\r\n\r\n\r\nYvette Owo (01:52)\r\nYeah, so it would be two million top line and then include across both of those like search and actually doing accounting.\r\n\r\n\r\nNik (02:02)\r\nHow did you get into this space? What's your background? I hate asking that question actually, because you're like the Dos Akis guy, just the most interesting woman in your case in the world. But yeah, what's your background?\r\n\r\n\r\nYvette Owo (02:12)\r\nYeah, so unusual background. So I went to college, graduated with a business degree in the bars. I just like school. I like nerding. I like learning. Nerding isn't a verb, but it's actually very factual for me. And then I came straight into consulting. And if anyone's ever heard of Accenture, I went to Accenture, moved straight up to, I was about to go managing director for those who know what that means. If you don't know what that means, which is most of normal people.\r\n\r\n\r\nI worked in Fortune 500 companies, so literally the top, largest 500 publicly traded companies. And for most of my time, I actually spent it in like the Fortune 50. And I did the Fortune 1, Fortune 2, Fortune 3 at some times. So I worked with really big companies. And I did a lot of things. I worked with big companies.\r\n\r\n\r\nNik (02:58)\r\nSo you're a big deal. You're a big deal.\r\n\r\n\r\nYvette Owo (03:04)\r\nI had a lot of experience. reported to every C -suite that existed up until 2015. There's new ones, like Chief People Officer, like people don't hear about people back then. But like, so for example, but in accounting specifically, like I reported up to like the VP of the then Fortune One company and they gave me a $2 billion, sorry, the CFO of the then Fortune One company and they gave me a $2 billion budget and they were like, 31 % of this is miscellaneous. We need to figure out.\r\n\r\n\r\nwhat we're paying for and then we need to be able to cut costs. And it wasn't just like cut headcount. And so was like, to the point where it was like, what is this? So for those of know bookkeeping, what is this billing code? The person who knows that left the company 10 years ago. So that was the level of complexity of accounting stuff. And there was like another one where it was like a $1 ,000 bookkeeping codes and it like a $300 million cost reduction.\r\n\r\n\r\nNik (03:38)\r\nvideos.\r\n\r\n\r\n$600, essentially $600 million is in this miscellaneous category that you had to comb through.\r\n\r\n\r\nYvette Owo (04:06)\r\nYes. no, we had the whole budget. let me, 31 % is miscellany. Yeah, 2 billion. Yes.\r\n\r\n\r\nNik (04:10)\r\nI'm saying two billion. You're like two billion, but 31 % is miscellaneous. So that's about $600 million, right?\r\n\r\n\r\nYvette Owo (04:17)\r\nRight, right, but if 31 % is miscellaneous, most of rest of it ain't right. So you just, you come in with the assumption that of this percentage, at least 50 % is wrong. There's a miscellaneous and then if we, at least 50 % needs to be rearranged somewhere was a going in assumption. And...\r\n\r\n\r\nNik (04:41)\r\nOkay.\r\n\r\n\r\nYvette Owo (04:46)\r\nYeah, obviously they had, if I'm trying to find the right information and the person who knows it left 10 years ago that tells you how long ago they did it. And it was because they're in an industry that makes so much money that they didn't really have to worry about this. And they were in the largest downturn in the history of the industry since like the 1800s. And so they were like, we have to do something unique. And I had built a brand like bring your vet on and you'll save a bunch of money without having to fire people.\r\n\r\n\r\nNik (05:05)\r\nmy gosh.\r\n\r\n\r\nYvette Owo (05:16)\r\nSo that was it.\r\n\r\n\r\nNik (05:17)\r\nWas that like your first experience kind of whetting your appetite for being an entrepreneur? Because being an entrepreneur isn't like being like a CPA where you're going in every day and, okay, these are my set of objectives.\r\n\r\n\r\nYvette Owo (05:30)\r\nNo, I'm an entrepreneur because my dad told me when I was 10 that he didn't come to America so I could knock on doors. So I've had two great summers in my life. One, I was 10 years old and I started five businesses. And this business, my favorite one, I did Lemonade Stand and I was like, my God, the ROI is stupid, it's super hot. And no one's stopping, they don't find me cute. And my neighbors actually didn't like me, so it's not helpful. Like didn't like me as in they played baseball on my yard without me.\r\n\r\n\r\nYeah, we were in the Black family. It was very challenging. And then, so I was like, I'm gonna go to you. I sort of, did it, because Girl Scouts had this whole, you know, brand of cookies. I was like, I'll just make them. No one cares about the actual cookies. They're just like, you're a 10 year old with a smile and these people are up in middle class. And so like, if they say no to your like $2 cookie, they just kind of feel bad. I just instinctively kind of figure that out. So.\r\n\r\n\r\nAnd this says a lot about how I think still now. my mom, again, they didn't support this whole idea, but my mom bought some cookie stuff and she was like, we're gonna do a girly thing together and make cookies. And so I was like, yeah. So she made the cookies. And then I took the orders and then I was gonna deliver the order that I wrote down, the house, the number of cookies, because I had like three different types, got a few options, pricing. But then I lost a sheet of paper. This was back before technology.\r\n\r\n\r\nNik (06:55)\r\nno.\r\n\r\n\r\nYvette Owo (06:57)\r\nBut again, I figured out a win. Go to their door and I would always have a plate of all the different types. And I'll be like, hi, it's usually Mrs. Hi Mrs. So and So, I have your cookies that you ordered. Tell me again, how many stinker doodle, how many chocolate and how many da da. So then they would just tell me and then I'd be like, here you go. I would give them the cookies. So division of labor.\r\n\r\n\r\noutsourcing, client facing relationship. also all I did, and I was, and I did it all by myself. mean, not all by myself, like I'm obviously help with that, like, that's very, that's still kind of who I am. I never spent a dollar that I made. I always ask for an allowance for actual spending money. And I just put in this green piggy bank that I had until I was 26. I still wish I had it. Yeah, I get every dollar I made from like age nine.\r\n\r\n\r\nNik (07:28)\r\nYeah.\r\n\r\n\r\nYvette Owo (07:54)\r\nOr my and my allowance, because I also learned like I had a dollar allowance, but I learned like people don't really remember that. So you ask your mom and you ask your dad and wait four days and you ask again. So I say like nine hundred ninety seven dollars and I wrote a contract to my parents when I was like between 10 or 11.\r\n\r\n\r\nNik (08:10)\r\nso you're okay. You're you're like a whole level of crazy. I wrote a contract to my parents when I was 10 or 11. My son came to me with a contract and be like, What the freak is this? Roy, get out of here.\r\n\r\n\r\nYvette Owo (08:20)\r\nWell, well, here's the thing is they didn't. Well, no, it was legit. basically, so I had saved up this money and then we're going to Nigeria and they were like, hey, kids, like, we want you to support the ships in Nigeria. And I was like, well, this is my money. I mean, yes, some of it came through allowance, but the ownership was transferred to me. So I was like, here's the money. And I wrote a contract and then I rounded to a thousand dollars. I literally kept that contract until I was 25 years old. That was when I gave up.\r\n\r\n\r\nand then repaying me. So I was serious.\r\n\r\n\r\nNik (08:52)\r\nmy gosh, why did you finally give up?\r\n\r\n\r\nYvette Owo (08:54)\r\nI realized they were never gonna repay me. Now, to be fair, my parents did feed me and help me go through college, know, but the thing is, right, but there are different contractual obligations, right? So someone say, for example, you have an employee and you have bonus and you have base, you have overtime. So there's different categories of obligations. And this was a contractual obligation that I had.\r\n\r\n\r\nNik (08:59)\r\nto be fair. To be fair, my parents did feed me and give me a roof and clothed me and gave me a roof.\r\n\r\n\r\nYvette Owo (09:23)\r\nboth of them sign and date. I don't even know how I knew what a contract was to be quite honest because I have my parents are not entrepreneurs. I have no memory of entrepreneurship before this summer. I have no memory watching a tv show about this. I don't know where I got this from.\r\n\r\n\r\nNik (09:42)\r\nSo was that somewhere like the impetus where you're like, yeah, I think I want to do this entrepreneur thing.\r\n\r\n\r\nYvette Owo (09:46)\r\nWell, I just did it, I loved it. then, so after the cookie thing.\r\n\r\n\r\nNik (09:49)\r\nlike this. This is so fun. I'm creating a contract for my parents to sign. I want to do this with random people. don't know.\r\n\r\n\r\nYvette Owo (09:57)\r\nmake it sound weird like that. yeah, it was fun. And so for example, I read Nancy Drew and then most people want to... So I was like, my God, I could spy on my neighbors and write a newspaper that's interesting. And then I realized I can't climb trees because I don't know how to climb trees and there are no trees in my neighborhood to climb because it's a new development. So then I just started writing a newspaper, handwritten, which in hindsight I...\r\n\r\n\r\nNik (09:58)\r\nI'm just kidding.\r\n\r\n\r\nYou\r\n\r\n\r\nmy god.\r\n\r\n\r\nYvette Owo (10:23)\r\nI didn't use, I should have been more fast forwarded technology. We did have a computer. But the second article was about my mom's poop, which again, seems crazy now, but as a 10 year old, I didn't know poop from mom could smell. And I thought that was breaking news. So that's how the paper got shut down.\r\n\r\n\r\nNik (10:43)\r\nI love how you're a deterrent for spying on people. You're like, my idea was to copy Nancy June and spy on people and write, but I realized I couldn't do that because I couldn't climb trees. Like the deterrent for not climbing on people is because you couldn't climb trees, not because you realized you shouldn't be spying on people.\r\n\r\n\r\nYvette Owo (11:00)\r\nWell, no, Nancy Drew did it and she's a good person. So I would be doing it for good reason so I could share inciting news with everyone.\r\n\r\n\r\nNik (11:05)\r\nI know.\r\n\r\n\r\nIt reminds me, don't know when you were growing up, it just reminds me when I was growing up in the 90s and all the TV shows that you just thought was normal and looking back now, you're like, I remember there was this show called Boy Meets World and there's this girl on there, her name's Topanga, and there was an episode where they talked about her weight gain. I look back at it now and I'm like, she looks like a normal girl, right? She's just a normal teenage girl.\r\n\r\n\r\nYvette Owo (11:17)\r\nYeah.\r\n\r\n\r\nmy God.\r\n\r\n\r\nYes!\r\n\r\n\r\nSwanga? Yes? Cory?\r\n\r\n\r\nmy God.\r\n\r\n\r\nNik (11:40)\r\nHow did they get away with that in the 90s? It just was so, so weird for me, like as a parent now looking back, but yeah, Nancy Drew's buying on people and you're like, yeah, but she's a good person. So I can write an article about my mom's Makes sense.\r\n\r\n\r\nYvette Owo (11:46)\r\nit's crazy. Yeah.\r\n\r\n\r\nYeah, yeah, so it got shut down. But so that is when my entrepreneurship goals started. And then I was told, like, I mean, my parents, we immigrated from Nigeria, my parents are super hardworking. And, you know, they wanted me to be like a professional, which meant doctor, lawyer, engineer, lawyer was the one because so they were just like, what are you doing? What are you doing? Like you're wasting like we didn't sacrifice for this. And, you know, they were just like, what are you doing with your life?\r\n\r\n\r\nAnd so yeah, so that got shut down and then, but I also take ownership. could have, I could have just rebelled. And then my, go ahead.\r\n\r\n\r\nNik (12:32)\r\nWhat was the moment for you that it was like, all right, I'm ready to be an entrepreneur. So you were working at these Fortune 50 companies, managing large budgets, doing well, you're on partner track, you're not there now, right? So there's a moment in time where you probably said to yourself, I think I wanna do this on my own. What was that? What made you jump?\r\n\r\n\r\nYvette Owo (12:43)\r\nYeah. Yeah. Yeah.\r\n\r\n\r\nYes. Well, so a little bit is I also had side hustles throughout this corporate career. And then I would tell my teens and they'd be like, why do you know that you have an executive job at the largest consulting firm in the world? Why do you have an Airbnb? Why are you running an Airbnb? Why do you have a financial planning business on the side? And I was like, you don't? And I was like, super weird. I mean, it was just super weird. So I was dating someone.\r\n\r\n\r\nNik (13:08)\r\nYou\r\n\r\n\r\nYeah.\r\n\r\n\r\nYvette Owo (13:23)\r\nwho was an entrepreneur, never went to college, and a multimillionaire, which is very, very relevant in the fact, because I had a cashflow, sorry, a network forecast from in my 20s up until age 50 was pretty accurate. It got a little fuzzy, but it went up to 100. And I realized I would hit my goals, but I wouldn't have fun in life. And so I'd already quantified it said, hey, I was gonna hit my goal, which is much lower now, much higher now. But I was like, this man,\r\n\r\n\r\nAnd then I remember, and he's very direct and most people think this is very mean, but the very first day we met he said, you're smarter than me, you're better with people than me, you're a better communicator. How did somebody ever convince you to be an employee? And then I would have like wins at work and he'd be like, honestly can't be happy for you because you don't own it. And you hear that shit every day. So we eventually stopped seeing each other for other reasons.\r\n\r\n\r\nNik (14:18)\r\nmy God.\r\n\r\n\r\nYvette Owo (14:22)\r\nbut that was ingrained. mean, he had strengths and weaknesses, but it was like, I can't be happy for you because you don't own it. He would literally be like, do you own a piece of this? I'm like, dude, it's Accenture. He's like, can you negotiate percentage? And I'm like, like he literally was just like, I don't care if it's Goldman Sachs. I don't care who you work for. If you don't own it, it doesn't process information.\r\n\r\n\r\nNik (14:22)\r\nFor other reasons.\r\n\r\n\r\nYvette Owo (14:51)\r\nAnd so one day, it was literally that, I tried, it was literally that, like one day I woke up on a Monday, nothing had happened, out of the normal. I still was doing my side hustling, still moving up. And I was like, girl, if you do not quit this company, you about to, you about to just get promoted again. And then I was like, you just need to go. And so I woke up on a Monday and I was like, you need to go. And then on Tuesday I was like, shit, I gotta tell people. And then Wednesday I had a meeting.\r\n\r\n\r\nAnd I won't go through the details, but the person was so supportive. I also have been hit by a car and I've been in pain every day for 11 years. So throughout that entire career, was in so much pain. that $300 million cost reduction thing I talked about. I was on pain meds so hardcore, I could only function for part of the time. So I was on pain meds. was never at full capacity. I just have high intensity ability to work. But he was just like, honestly, I've never even heard of somebody\r\n\r\n\r\nNik (15:27)\r\nmy god.\r\n\r\n\r\nYvette Owo (15:50)\r\nbeing able to do this job with the amount of physical pain that you're in. Like I couldn't wear like earrings at that point because my ears would get, like they couldn't hold them up. And I couldn't wear, I mean, I still don't wear necklaces because my neck gets so irritated. So anyway, the firm was very supportive. They were just kind of like, they were like, you you can go. And then I like, I did like a four month project in like three weeks. And then, cause I didn't want to leave him in a bad spot. Then they were like, just come back whenever if you change your mind. So.\r\n\r\n\r\nNik (15:58)\r\nman, yeah.\r\n\r\n\r\nYvette Owo (16:19)\r\nI know that's a little long, but there was just, I think it was just a build up. I just kind of...\r\n\r\n\r\nNik (16:23)\r\nSo there's a buildup. You've been doing side hustles. You get in this car accident. You have the thought to yourself, I'm going to mess around and get promoted again. Gosh day.\r\n\r\n\r\nYvette Owo (16:33)\r\nWell, it was never like I wanted to. I mean, sometimes I... Okay, so my last promotion was a goal. But the one before that, I honestly just like wanted to help out like the client and like, I had like this team that sucks. Like one of the guys refused to work with me because I was a woman. He believes women should be secretaries. And the guy was covering. I just wanted to help people. So the last one, they were like, you're promoting? I was like, this was before. was like, no, it's fine. I don't need it. They were like...\r\n\r\n\r\nLet's sit you down. When you do a project of three people by yourself, we go to bat for you. And I was like, thank you. No, honey. You just did something. You just did a project of three people as the most junior one by yourself with no prior experience. And you were harassed by two different people during this process. You've earned this. So yeah, it was just kind of a...\r\n\r\n\r\nAnd I was also in a very entrepreneurial community at the time. that, and I also started noticing, and this is the last thing on the topic, but the freedom, even though like it's still, entrepreneurship has strings like you would know. Like right now I am getting an apartment in a whole new city so I can support my team because my team needs me. And when my team asked me, do I want to live here during the week? I say, no, but you need me, right? Cause I'm here for you. But\r\n\r\n\r\nIt's a choice, right? And as I, for example, I knew, I won't say the name of the company, but like one down from the head of HR at one of the five largest banks in the world, in the US. We were both in the same program that required a lot of vacation time. And she had to get someone in the C -suite to approve her vacation time. I'm like, this woman, this is like CEO, CHRO, she here.\r\n\r\n\r\nNik (18:11)\r\nWow.\r\n\r\n\r\nYvette Owo (18:30)\r\nand you still need PTO approval? I can't do that.\r\n\r\n\r\nNik (18:35)\r\nThat's crazy. You would think that they just would say, you have an unlimited PTO policy, right? Like just get your work done.\r\n\r\n\r\nYvette Owo (18:42)\r\nNo, I mean it was a lot of days and she had literally and I I I planned well like as a paid job but like Like not for fun. She had taken all the she had taken an entire calendar and marked off all her days for the year And it was like so many days all her travel days her flight days. She planned an entire year of travel And they approved it very quickly because she's fantastic but that's the level of like I was just like I\r\n\r\n\r\nNik (19:03)\r\nWow.\r\n\r\n\r\nYvette Owo (19:11)\r\nwill not work so hard to still need to ask permission like a two -year -old.\r\n\r\n\r\nNik (19:17)\r\nI mean, that's why a lot of entrepreneurs do what they do, right? They want control over their lives, their schedule, what they work on, you know, what meetings they're a part of, what meetings are not a part of. it's crazy to me that somebody at that high level is asking for PTO, but I guess it also makes sense when you have a hierarchical organization. Why accounting? Like you had all these side hustles, like why were you like, all right, going on and on an accounting firm, YOLO.\r\n\r\n\r\nYvette Owo (19:26)\r\nYeah.\r\n\r\n\r\nYeah, I really love helping people. You only live once, let us do the numbers, you focus on the business. I really love helping people. So after that, I started helping small businesses. I was really sick actually. So I left and my body was just like, all that health that you weren't taking care of, we're gonna make it all at once. I was actually qualified for disability. I was like, I'm gonna start a business. And so I could only sit up for like three hours a day for a while.\r\n\r\n\r\nNik (19:48)\r\nI love it.\r\n\r\n\r\nYvette Owo (20:10)\r\nAnd so I was like, well, I really understand business structures. So was consulting and I was helping business owners directly. And they would see like net income, not revenue, the money at the end, 2X, 10X, 18X, going from like 184 ,000 to 3 .4 million in two years, three COVID shutdowns, and no headcount reduction. All staff got paid more.\r\n\r\n\r\nHe definitely got paid more. His dad was actually like at the end of like the year, son, is everything we do illegal? And so, because it was the highest, it was the business they'd ever been like in the history of the 50 year history of the business. Right, no. But it was like, he was just, he just like, yeah dad, we good. And so, and then actually,\r\n\r\n\r\nNik (20:50)\r\nHahaha\r\n\r\n\r\nWas he, yeah, was he looking at you sideways?\r\n\r\n\r\nWas it?\r\n\r\n\r\nYvette Owo (21:07)\r\nSo then I was helping people. I just love helping people. so I noticed, also then one of the people, one of my clients thought about bringing me as an equity partner and then change his mind. And I was like, I'm never going to put anyone in that position again where you can just change your mind. And they explained to me why they changed their mind. And I was actually their most trusted person apart from their wife. So imagine someone rejecting you, explaining to you why they reject you. And then\r\n\r\n\r\nwhy you're doing it, you're coming from such a place of help and service that you are the emotional comfort.\r\n\r\n\r\nNik (21:41)\r\nYeah, I've been there.\r\n\r\n\r\nYvette Owo (21:42)\r\nI was like, yeah, not my life, never again. So after that I was like, I'm owner and I just don't do consulting. So I just wanted to change. like B2B and I wanted to change the type of service. Like I could come out of cold dead sleep and tell you how to improve margins. You see how exhausted I just got.\r\n\r\n\r\nNik (22:01)\r\nYeah, it makes it it makes sense, right? Because it's like, all right, I want to be an entrepreneur. What am I really good at? Easy, right? I know that I'm good in this space. So getting a CPA firm offering those types of services for you fits your skill set really well.\r\n\r\n\r\nYvette Owo (22:13)\r\nRight. Well, and then there's the last piece is when I was helping out somebody these I would do across people process and profit. And I was like, girl, why don't you just keep your life easy? You like, just keep it simple, focus on one part of a business. And I noticed everyone thinks, let me grow a business. They easily think marketing, sales. What they don't realize is the finance and accounting side. So for example, with one client, we took a half a million dollars of fixed cost.\r\n\r\n\r\nand translated it to a variable cost that the customer paid for. So it went from half a million dollars to zero, right? Because the customer is not paying. And that's half a million dollars straight to your bottom line. And first you have to have good books to do that. People don't calculate, like people will be like, we have three ad vendors. Which ones gets you the best clients? What do mean? What are their campaigns? Wait, I don't know. Okay, which clients stick around? What's the LTV?\r\n\r\n\r\nNik (22:56)\r\nYes.\r\n\r\n\r\nYvette Owo (23:10)\r\nSo it was basically, I saw that in the SMP space, accounting and finance were the least underserved. I really love to serve and I have to be, I'm learning to be selfish in the way that is necessary for me to be happy and healthy and get the things that I want. And so if you go into a space where there is people are so underserved.\r\n\r\n\r\nI'm automatically serving. So I wouldn't have to feel like I'm choosing between. Does that make sense?\r\n\r\n\r\nNik (23:39)\r\nYeah, love that. Totally makes sense. think anytime you're an entrepreneur, you want to get to a place where your skill set and what you're passionate about obviously overlap. And in your case, the fact that you're passionate about serving people allows you to do a lot of different things with your skill set. You know what I mean? Like that's a great passion to have. If you're like, I'm passionate about mini figurines that reenact the Civil War.\r\n\r\n\r\nYvette Owo (23:59)\r\nYes. Yes. Yes.\r\n\r\n\r\nNo, all right.\r\n\r\n\r\nNik (24:07)\r\nOkay, it's kind of hard to find like an expertise that you know, fits that passion, but serving people can be applied to so many different so many different industries and business types. Tell me about the business itself. How do you acquire customers right now? Like are you doing digital customer acquisition? Are you doing organic? Is it all word of mouth? Like how are you getting customers?\r\n\r\n\r\nYvette Owo (24:30)\r\nYeah, so we need to upgrade, but honestly, we just, our website, which still needs work, we get like three to seven cold leads a week. Then, yeah. and I was like, I started smiling because I you're not gonna love this answer. So it's an underserved industry. And so we have to actually say no, because most people aren't our avatar. If you are listening to this and wondering if you're our avatar.\r\n\r\n\r\nNik (24:42)\r\nJust from your website.\r\n\r\n\r\nShe's the lead.\r\n\r\n\r\nYvette Owo (24:58)\r\nIf you are a business owner between one to 20 million in revenue and you want bookkeeping services, because we want to get in and really help you understand and make database decisions. So we need to have regular monthly services with you. We also do tax and things like that. So like that's our avatar. Or if you're trying to buy a business and you want to do like a quality of earnings report, that's our avatar. If you're trying to sell a business and you want like to make be able to sell for more money.\r\n\r\n\r\nby having your data cleaned, like your accounting cleaned up. Because most people were like, I'm going to go sell. And Nick, you know this. As soon as people start seeing your messy accounting, they start discounting that price. And then they start making assumptions like, ooh, the accounting is messy. I can only imagine what the processes are going to be a little bit messy. This is going to be messy. So people start making a lot of decisions. So yeah, so we get referrals, website cold. And then people also reach out to me.\r\n\r\n\r\nNik (25:32)\r\nYep, totally.\r\n\r\n\r\nYvette Owo (25:53)\r\ndirectly through Twitter, LinkedIn, SearchFunder, a friend, WhatsApp groups. So we're now to the point where I want to build a more formal channel.\r\n\r\n\r\nNik (26:07)\r\nHave you found that those channels are the best or are they just the ones that are working, right? Like does digital marketing work for a CPA firm?\r\n\r\n\r\nYvette Owo (26:16)\r\nAbsolutely. So I was proactively on Twitter marketing and I got it when I was active. The thing is, if you think these people active on Twitter with great content like Nick, in other words, are casually doing it, shit is not casual. It's work. So I could do 14 posts, five leads. And also, I also was always focused on inbound. So I've done outbound marketing in my life.\r\n\r\n\r\nNik (26:32)\r\nNo.\r\n\r\n\r\nYvette Owo (26:45)\r\nAnd I realize I just don't like it. I prefer to just provide you good help and you want to work with me. So I've never, I don't DM people like, hey, do you want to work with me? I would pay somebody else to do that, but I'm not going do that. I would rather just put really great content out there and have you be like, hey, can you help me? And so what happens is I've had, you know, people be like, someone, I saw this content. I want to see if you can help with my books. Also my friends going through a really bad time with their accountant.\r\n\r\n\r\nCan you help them? So I get a lot of that too. And then I got connected with the state of Ohio and I'm like an official, someone to like help with &A's with the state of Ohio. And then there's something in the works with the state of Virginia and there's something in the works with the state of Alabama. And then the state of Ohio, one department was like, she can help with that. Well, can we do another thing? So I absolutely think digital marketing works and the state stuff came through relationships that were built from online in addition to just direct leads.\r\n\r\n\r\nIt just happens to be that I bought a business and it's kind of time consuming. So I just haven't had as much time.\r\n\r\n\r\nNik (27:51)\r\nYou just haven't gotten to the place where you can be more methodical about, all right, what's my customer acquisition cost? What's my LTV? How do I go out and acquire new customers from different channels? Because you have the one you started, but you also just bought a business in April. So there's a lot of stabilization that's going on.\r\n\r\n\r\nYvette Owo (28:05)\r\nYeah, we're just now at the point where we want to kind of make that. Because I also wanted to clean up the sales process on our end once it's inbound. So I've been cleaning up the sales process on our end. You're going to have like someone comes in, for example, to talk to us, you have that sales conversation and we talk about what are you trying to accomplish with your business. We make it really simple. So at the end of it, you're going to be like, OK, these are the services we're providing for you.\r\n\r\n\r\nThis is the timeline. Here's like just the amount that is gonna cost per month like a Netflix account. So it's not like normally with an account and you're like, I don't know how much it's gonna cost. But we have like a fixed amount. So I needed I wanted to for non &A work, I wanted to get that really dialed in. And so now we've got that dialed into the point where now you want to turn on the funnel. It's kind of like you don't want to turn on the funnel if you don't like what's coming through.\r\n\r\n\r\nNik (28:57)\r\nTotally. Who does the fulfillment for your teams? Are they CPAs? Are they, you know, overseas VAs? Are they bookkeepers? Like what, does the fulfillment actually look like?\r\n\r\n\r\nYvette Owo (29:07)\r\nSo this is not related to the answer, but I am passionate. Overseas people are humans. Sometimes they're virtual assistants, sometimes they're CPAs, sometimes they're lawyers. I'm not talking just to you, but I think, like I always say to people, the womb I was born in was in Nigeria. If I was still there, people wouldn't respect me as much. I happen to live here, right? But I'm still, you know what mean? I will have different opportunities, but the raw material is still the same.\r\n\r\n\r\nSo in terms of fulfillment, I mean, we have a team of people in Richmond, where I am right now, Richmond, Virginia, and then in other states. And then we also have an elsewhere team. So it just depends. But all the review work and client relationships is with someone here, unless they're on vacation, someone's on vacation right now or working or rolling right now from another country.\r\n\r\n\r\nBut yes, I would say, mean.\r\n\r\n\r\nBut yeah, so we have like a lot of people in Richmond and then some folks spread across the US.\r\n\r\n\r\nNik (30:13)\r\nI just, yeah, I mixed those two questions. Really what I meant was like, are these CPAs who are fulfilling the work or these, you know, people who can just be trained on some of the functions there and then pass that, you know, are you, is your team remote or are they like in a location?\r\n\r\n\r\nYvette Owo (30:31)\r\nGot it. So that's a really good question. So CPAs do some of the work. So for example, when your tax returns start, we just redid our steps for tax returns. It starts with data entry. I could pay a CPA to do that. And they might choose to stay here or choose they want a better quality of life and not do boring stuff. So usually the person doing that is someone who is either a CPA, but they're a junior level employee.\r\n\r\n\r\nor they are always junior, but maybe they haven't taken their CPA test yet. So if you think of a tax return, you have to enter the initial raw data entry. Some of it we have technology that we use optical character recognition for, some of it humans have to type in. And then there's actually doing analysis, which can be done by one level. And then there's a reviewer that is the final reviewer. So when you get a tax return from an accounting shop that's doing their job right, there's\r\n\r\n\r\nIf they're doing their job right, there's three people that have touched your tax return before it gets to you.\r\n\r\n\r\nNik (31:37)\r\nSo are you as a CEO doing any of that work or are you just managing the team? Like, do you do any CPA work? Does that make sense?\r\n\r\n\r\nYvette Owo (31:45)\r\nYeah, it makes sense. I'm not even, I don't, I'm an asset allocator acting as a CEO. So that tells you, if that tells you where my mindset is.\r\n\r\n\r\nNik (31:51)\r\nGreat, yeah, that's great.\r\n\r\n\r\nYeah, it's just it's hard for many entrepreneurs who have a skill set in the business that they're It's hard many times for them to not jump in, right? Like it's a very natural reaction like, things are getting hairy. Okay, I can jump in and do some fulfillment. And that's why I asked because like you have a skill set in this right like\r\n\r\n\r\nYvette Owo (32:00)\r\nYeah.\r\n\r\n\r\nYes, yeah. So the reason I don't do that, there's two reasons. One, from as an employee, I remember once talking to one of my clients who tried to hire me away and I was like, Oscar, you make me work so hard. And he was like, Yvette, I only assign you one third of the things you do. And I was like, are you serious? He's like, yeah, the other two thirds is just you. And I was like, it took me a while to realize like, my God, like I'm working too hard.\r\n\r\n\r\nLike he's like, over exceed my expectations by 60%. And then the second was when I started my small business, I tailored it around me. And I had all these unique experiences because most people who had my corporate background never started a business. And then I did so much therapy. So had all the psychological experience. Then I got really into Tony Robbins, which I skipped over and like would travel and was mentored by him. So I had all that practical psychology experience. then, I mean, I had like, I just had all these different\r\n\r\n\r\nunusual experiences and I was like really into meditation like the Hindu Buddhist meditation and I brought all of that into how I worked with people. And so when you would try to find someone you like, okay, well, let's find someone to do this. It'd be like it was super hard. So I was like, that's not a business. That's just a human being working hard. So was like, we're never doing that again. What we need is a business, which is where there are roles, there are processes. Jennifer may occupy the role now.\r\n\r\n\r\nbut she may not later for she grew promotion, she quit, whatever. So I'd never do anything because when I do stuff, I tailor it. And it's not about me. It's about the client and being able to serve the client on a repeated ongoing basis. And it's about the team and growing them. So I'm productizing the business, absolutely. And...\r\n\r\n\r\nNik (33:59)\r\nYeah. You're productizing.\r\n\r\n\r\nYvette Owo (34:07)\r\nI'm not gonna do that if I make it focused on me. Because then I also I'm forcing, I'm trying to make my team have my skills and they might be good at other things that I'm not good at. So I don't think it's fair to them. I don't think it's fair to my clients and it is not fun for me. And if you're trying to sell a business ever, don't put your name on it. That's the other thing. Don't put your name on a business. I learned that. People always assume you're the smartest person in the room.\r\n\r\n\r\nNik (34:33)\r\nWell, like, do you know who Alex Ramones is? He, I used to think for long time, I think a lot of people look at him and are like, he invests in these companies, but he never posts about any of them. I mean, school is the recent one, but never posts. I have always thought of that, like, that's kind of dumb. Like, why would he do that? But his whole reasoning is like, I don't want to have key man risk in these businesses. If I ever sell them.\r\n\r\n\r\nYvette Owo (34:37)\r\nYes.\r\n\r\n\r\nYes.\r\n\r\n\r\nYeah, yeah.\r\n\r\n\r\nNik (34:58)\r\nI don't want to have to be looked at as like, there's a discount here because you've been pumping the sales or we need you to stay on for three years. He's like, I, if I sell, I want to be able to be done. I don't want to have any expectation moving forward. And the same is true for like, don't put your name on the business. Otherwise you become a part of the sale. Like they're buying you as much as they're buying the business.\r\n\r\n\r\nYvette Owo (35:17)\r\nRight. I completely agree with that. So when I forecast, I do not forecast any sales that come through me. I consider anything that comes through me gravy. That's not part of the business model. So I'm not meant to be a part of the business model. And then so for people who listening, does that mean you don't roll your sleeves up, you don't work hard, you don't care about people? It means that you're committed to a business. And having the experience of\r\n\r\n\r\nNik (35:27)\r\nAwesome.\r\n\r\n\r\nYvette Owo (35:46)\r\nworking with so many businesses, like 25 different industries, Fortune 500, one to 20 million. It's like, you just realize like, you know, I'm not perfect. make a lot of mistakes, but like I'm committed to a business, which is an act, which is a people and structure and functions that work without me.\r\n\r\n\r\nNik (36:07)\r\nAnd that's, that's where a lot of entrepreneurs get messed up because they build the business around themselves. And then they become a slave to the business. And anyways, like there are obviously a lot of different philosophies on it, but that's not anything that I want to create for myself. I don't want to be a slave really to anything. I have some rapid fire questions. We burned through a lot of time, which is awesome because I learned a ton about you that I know today.\r\n\r\n\r\nYvette Owo (36:14)\r\nYeah.\r\n\r\n\r\nYeah.\r\n\r\n\r\nNik (36:36)\r\nAll right, here we go. What do you love about this business?\r\n\r\n\r\nYvette Owo (36:43)\r\nIt's necessary. I know people need it.\r\n\r\n\r\nNik (36:48)\r\nI like that. All right, what do you hate about it?\r\n\r\n\r\nYvette Owo (36:52)\r\nMy staff is so resistant to change.\r\n\r\n\r\nNik (36:55)\r\nHahaha\r\n\r\n\r\nYvette Owo (36:59)\r\nof changes. They don't believe anything that's not a counter -historical focused. So if that hasn't already happened, it's not true.\r\n\r\n\r\nNik (37:07)\r\nYeah, that's friggin that's hilarious. If you have two hours in your day and you don't have any personal or family stuff set aside, you don't have any business stuff that is taking up your time, free time. What what are you obsessed with right now? What are you spending your time thinking about or working on?\r\n\r\n\r\nYvette Owo (37:18)\r\nYeah.\r\n\r\n\r\nI wasn't saying what I'm obsessed with right now is walking. Walking near the lake. I have a in Austin. live close to the water and there's a lake and it's really beautiful. So I'd probably be trying to take a walk. And I got some new outfits that are really cute for walking. So that has also helped. I feel like I shouldn't do an ad but it's so hard for me as the numbers like okay. So if you go to have Lenox look brand new, it's 80 % off for your first thing. And like I went in and\r\n\r\n\r\nNik (37:29)\r\nThat's fine.\r\n\r\n\r\nYvette Owo (37:56)\r\nI like bought a bunch of stuff and they were like, we've never seen anyone do this before. And I was like, I don't understand, it's 80 % off.\r\n\r\n\r\nNik (38:01)\r\nIt's 80 % off. What do you mean? You've never seen anyone do this before.\r\n\r\n\r\nYvette Owo (38:04)\r\nThey said people normally buy two things. I was like, I bought $500 worth of stuff for like $150 something dollars. And I was like, my, that's crazy. So yeah, so walking and we're talking to my best friend. Probably the two things I'm\r\n\r\n\r\nNik (38:09)\r\nYeah, thank you.\r\n\r\n\r\nOkay. If you were giving advice to your pre -entrepreneurial self, what would it be?\r\n\r\n\r\nYvette Owo (38:22)\r\nMmm.\r\n\r\n\r\nQuit your job, buy a business.\r\n\r\n\r\nNik (38:27)\r\nOkay, that was very direct. I love that. Quit your job and buy a business. Fair? All right. Okay, where's the best place for people to come find you? Where do you hang out?\r\n\r\n\r\nYvette Owo (38:30)\r\nyou\r\n\r\n\r\nYeah, so I'm regularly hanging out on LinkedIn. Less regularly on Twitter, although there's an amazing space. So yeah, find me on LinkedIn for the fastest response. Whether you're looking for client or know, business for sale, it has 50 % bookkeeping. Or you need help.\r\n\r\n\r\nNik (38:57)\r\nAnd you're dude, you're, marketing is so great. Yolo accounting. mean, it's like the most memorable, most memorable company name Yolo. I freaking love it. All right. Well, this, has been fantastic. It's great to see you. Good luck with the acquisition. Can't wait to check in with you in a year to see how things are going and we'll talk soon. All right. Hey,\r\n\r\n\r\nYvette Owo (39:04)\r\nYeah.\r\n\r\n\r\nYeah. All right. Thank you.",
  "metadata": {
    "duration": "",
    "date": "2024-11-27",
    "platform_source": "Google Drive"
  }
}