{
  "episode_number": "69",
  "episode_title": "Guerrilla Marketing & Treasure Hunts: How to Use Creative Marketing with Chris Koerner",
  "guest_name": "Chris Koerner",
  "business_name": "Project Skydrop, Utah Treasure Hunts, Phone Restore, Perfumatic",
  "transcript": "﻿Chris Koerner (00:02.168)\r\nWow.\r\n\r\n\r\nNik (00:04.605)\r\nWell, winky winky.\r\n\r\n\r\nChris Koerner (00:04.814)\r\nAll right, we doing this Nick? Okay, so our good friend will send me an idea not an idea. This is a business. That's pretty interesting and I think people could copy it in different ways You ready you ready? Okay, haven't I never heard of this until yesterday. It's called project sky drop. Okay, what is project sky drop? I'm gonna read this from the website\r\n\r\n\r\nNik (00:11.505)\r\nLet's frickin' do this, dude.\r\n\r\n\r\nNik (00:23.005)\r\nOkay. Born ready, dude.\r\n\r\n\r\nChris Koerner (00:34.862)\r\nProject Skydrop is a real world treasure hunt. A precious object made of 10 troy ounces of 24k pure gold has been placed somewhere in a circle that starts out 500 miles in diameter. Over the course of three weeks, that circle shrinks day by day. At the end of the hunt, the circle will shrink down to a single foot pinpointing the exact treasure location. People who join the hunt receive daily clues in the form of aerial photographs of the treasure taken from higher and higher altitudes.\r\n\r\n\r\nHalf of each entry fee contributes to an additional cash bounty that grows over time as more people join. The first person to locate the treasure and take it wins the hunt and claims the cash bounty. How genius is this?\r\n\r\n\r\nNik (01:16.583)\r\nDude, that's a freaking, that's amazing. Let's, how much is the entry price?\r\n\r\n\r\nChris Koerner (01:22.229)\r\nI don't even know, I'm looking right now.\r\n\r\n\r\nNik (01:24.123)\r\nAnd is it an all or nothing? it like, second place gets this third place gets this or is it like, look, you you're first or you're last? Like Ricky Bobby's dad would say, listen, Ricky, if you ain't first, you're last. Well, that don't make no sense. There's second, there's third, heck, there's even fourth.\r\n\r\n\r\nChris Koerner (01:36.728)\r\nOkay.\r\n\r\n\r\nChris Koerner (01:40.718)\r\nOkay, so it's $27 ,000 worth of gold, which is about, 10 ounces. Join now, it is $20. Okay, so if you join for $20, you receive an exclusive members only clue each day by email and text message. Each clue is, I love this, I can't even read, I'm just so excited right now. We need to get these guys to pay us. Each clue is an aerial photograph of the treasure location taken from higher and higher altitudes. Clues are sent between nine and three each day.\r\n\r\n\r\nand first joined first sent order by joining today, you will get your clues earlier in the day than somebody who joins tomorrow gain instant access to clues from previous days.\r\n\r\n\r\nNik (02:19.197)\r\nIs there a pricing tier? it just $20 or is it like for 50 you can get early? It's just 20 bucks. Dude, that's amazing. So smart.\r\n\r\n\r\nChris Koerner (02:23.566)\r\nIt looks like it's just 20 bucks. And the website is so simple. There's nothing really to click on. It has a proof of appraisal showing that it's real gold. has a pictures of where it is. And then it has a USA member zip code map. And you can see that most of the members are happen to live in an area that's close to this.\r\n\r\n\r\nNik (02:46.813)\r\nThat is so smart. The pricing so smart because it's like, why would I not pay 20 bucks? Like it's a Yolo type of purchase, right? Like, yeah, $27 ,000 just for the gold. Yeah, I'll spend 20 bucks. Have you ever seen those videos on YouTube of the guy who's whether like, find out where I am. And it's like a woman and she's she might be sitting at a table and like almost no other clues. And he just reverse engineers it. And he's like,\r\n\r\n\r\nChris Koerner (02:51.202)\r\nMm -hmm.\r\n\r\n\r\nNik (03:11.569)\r\nOkay, well, it looks like there's a T if I lighten the contrast. Yep, there it is right there. It's this restaurant. And if I go to Google and like he like finds it within five minutes. This is this is that this is like that on steroids.\r\n\r\n\r\nChris Koerner (03:24.3)\r\nYeah, that guy would crush it at this. They need to ban him for life from this.\r\n\r\n\r\nNik (03:25.149)\r\nSo they, so they, what you're saying is like, first day's pictures is like an inch from the gold second day is a foot third day is 10 feet, like those might not be the right distances, but like that's, that's kind of how it works. Like each additional day, you get a higher and higher level view of where this gold is.\r\n\r\n\r\nChris Koerner (03:38.456)\r\nMm\r\n\r\n\r\nChris Koerner (03:47.374)\r\nYeah, I believe that's right. I'm looking at 923.\r\n\r\n\r\nChris Koerner (03:54.326)\r\nYeah, it just keeps zooming out.\r\n\r\n\r\nNik (03:57.233)\r\nWhen did it start?\r\n\r\n\r\nChris Koerner (03:59.832)\r\nthink just a couple days ago.\r\n\r\n\r\nNik (04:02.823)\r\nThat is freaking so\r\n\r\n\r\nChris Koerner (04:05.132)\r\nSo there's another company doing this Utah treasure hunts .com. They do this a couple of times a year. And here's, one of the podcast listeners named Parker, shout out to Parker sent this to me. And he said a couple of realtors have been doing it for a couple of years now. They get some exposure for their companies and whatnot, but it's more of a passion project. Long story short, they hide a treasure chest somewhere in Utah and then release a cryptic poem with clues that lead to it.\r\n\r\n\r\nThey supposedly don't make any money from doing this. The only return I can see them making is growing their email list and social media volume. They do get some sponsors to help with the cash prize, but their costs are increasing with their growing email lists and server needs, yada, yada, yada.\r\n\r\n\r\nNik (04:42.333)\r\nCan we talk about, anytime I hear someone's like, we don't even make any money from this. I'm just like, okay. It's so tight.\r\n\r\n\r\nChris Koerner (04:46.37)\r\nWe've talked about this. We've talked about it on this pod. Yeah, it's either like they're dumb and they don't know how to monetize or they're lying. I refuse to believe otherwise.\r\n\r\n\r\nNik (04:56.733)\r\nThey're lying. Most of the time they're lying. And they're like doing all this mental gymnastics where they're like, well, technically, like the treasure box costs us $1 ,000 and to pay to find it, we get 100 ,000. But each of us spent a year's worth of our time planning this. like the way you calculate. And so like, actually, actually, it costs us 160 ,000. We lost money on it. I freaking hate that. That's so stupid.\r\n\r\n\r\nChris Koerner (05:14.658)\r\nYeah, on an hourly basis.\r\n\r\n\r\nChris Koerner (05:22.51)\r\nMm hmm. It reminds me of the calico cut pants skit from I think you should leave was like you got to donate because he's totally underwater. He's only eating hamburgers to survive right now. Like like keeping a website active is so expensive. So how could how can people copy this? Like\r\n\r\n\r\nNik (05:38.504)\r\nmy gosh. So.\r\n\r\n\r\nNik (05:44.349)\r\nthink it's very simple. If you have something of intrinsic value, right, like not like, I have a marketing agency, and I'll do a month free for you. Like, no, I have this gold bar, or I have this 67 Chevelle Chevelle that I want, you know, that's in mint condition, like, anything that you have kind of that's in that 10 to $30 ,000 price range. And then you put the dollar amount the entry fee at that 20 bucks. I think you could do this with I've assigned baseball from so and so I have a\r\n\r\n\r\nLike I'm trying to even think what else you could auction off, but you could even say like one Bitcoin, right? you, because you could do it. You could have the cold storage, like, right. You print it off and then you hide it somewhere and somebody has to actually go and find it. And literally the first person who finds it gets that Bitcoin because it's, it's, it's a piece of paper that they can then scan their wallet. But I think you could do it with a lot of things. The hard, the hard part is a getting the momentum. So like, because, because it's such a high price.\r\n\r\n\r\nChris Koerner (06:30.36)\r\nMm\r\n\r\n\r\nNik (06:45.085)\r\nthat like to win and it's such a low barrier of entry, the 20 bucks, I would assume it catches wildfire pretty quickly, but you probably want some type of an audience in order to get it launched. the second thing is you, you can't, you can't do a bad job of hiding it. Like I had a friend in high school who there was this radio contest and they were, can't remember what it was, but they like hid something and they would give clues every day on the radio of where it was hidden.\r\n\r\n\r\nAnd it was supposed to be like this 30 day event. And in day two, my friend who's super smart, Jimmy Riley, shout out. I don't know if he's listening. He found out where it was. And he wrote into the radio station and he's like, yeah, it's in this water tower in Chicago or something like that. And so they like had to stop the, you know, the competition because he found it in day two, but it like, I like totally ruined what they were trying to do, which was like create buzz around the radio station and get more people to listen. Right. Like, so I would think.\r\n\r\n\r\nChris Koerner (07:34.594)\r\nDang it!\r\n\r\n\r\nChris Koerner (07:39.874)\r\nYeah.\r\n\r\n\r\nNik (07:43.485)\r\nIf you are somebody who has a business and you want to have like a guerrilla marketing event or tactic, then I would find something that is of value. Like we could do this with our businesses. just basically say we're going to put $30 ,000 to marketing this year. And so this is what it will be. then the treasure hunt is essentially the marketing, the buzz around the treasure hunt comes back to us.\r\n\r\n\r\nChris Koerner (08:04.59)\r\nMm\r\n\r\n\r\nChris Koerner (08:09.326)\r\nI think that people could partner with local influencers to do this in any local market. and it doesn't need to be 26 grand. could be five grand in DFW, right? And you partner with a couple of Instagram accounts that focus on DFW restaurants or travel or Airbnb's you partner with them and you could do it every quarter or every month.\r\n\r\n\r\nNik (08:28.797)\r\nDude, you know what you could do? This is really interesting. You could go and find like 10 local businesses or more and say, hey, we're doing this marketing thing. Here's the cost. And they have to throw in something free. Maybe a restaurant was like free pizza for a year. And it's like one pizza every single week for your family for a year. And then the nail salon says like, whatever, free nails for a year, whatever.\r\n\r\n\r\nAnd they like, you combine all of those contributions from these businesses and say, this treasure chest is worth $30 ,000. Right. And then because you're in this local market, you hide it. And then like the local market gets into it. I'm sure you could leverage some Facebook groups, Twitter, Instagram, local, local influencers, like you're saying, but then it could be small businesses participating in this. They get free publicity. You would charge something to them, obviously.\r\n\r\n\r\nChris Koerner (09:03.459)\r\nMm\r\n\r\n\r\nChris Koerner (09:06.765)\r\nHmm\r\n\r\n\r\nChris Koerner (09:19.768)\r\nMm -hmm.\r\n\r\n\r\nNik (09:26.749)\r\nAnd it would just like that would just be so much fun. Can you like, can you imagine having this? There'd be like a treasure hunt with your kids. Remember? Dude, remember 10 years ago? I can remember what it was, but I I came with I came out to Dallas as when Pokemon Go was really popular and we drove to some outlet mall. I don't even know what it was.\r\n\r\n\r\nChris Koerner (09:43.118)\r\nI mean, I just this was this you must be confused. I've never played Pokemon Go. You're crazy.\r\n\r\n\r\nNik (09:45.959)\r\nBut like, you, you and Carson, like we get to that mall, and like, you look over and you see somebody with their kid and they're like on their phone. And I'm like, what the frick are they doing? He's like, my gosh, they found a Pokemon Carson, Carson, what's here? I was like, I think it's a it's the red, it's the Rizler dad. It's not a Bulbasaur, right? It was like, but it created this cool environment where the dad and the son could actually go and, and do something together, like a family could actually go and do this treasure hunt. That would be a really cool.\r\n\r\n\r\nChris Koerner (10:02.934)\r\nIs that a Bulbasaur?\r\n\r\n\r\nChris Koerner (10:08.961)\r\nMm\r\n\r\n\r\nNik (10:15.773)\r\ncomponent to it is make it family friendly.\r\n\r\n\r\nChris Koerner (10:17.774)\r\nI like the idea of partnering with businesses because it's the same value, but without having to spend $30 ,000, it's like a negative CAC, customer acquisition costs. You go to like 10 different restaurants, maybe like a velvet taco, like a regional chain, not like a Chili's, but like something that's native to DFW that has a budget for something like this. You find five of them, you get them to pay a few grand for this attention and promotion and then, you know, free tacos for a year. And so it like,\r\n\r\n\r\nNik (10:24.731)\r\nYeah.\r\n\r\n\r\nNik (10:39.613)\r\nMm\r\n\r\n\r\nChris Koerner (10:45.006)\r\nthe literal value of this is 10, 20, $30 ,000, but you got paid 10, 20, $30 ,000 to do it. And then you partner with the influencers and then they promote it. And instead of having to buy a $30 ,000 gold bar and hoping that people buy $30 ,000 worth of tickets to offset it like a lottery, you're profitable on day one.\r\n\r\n\r\nNik (11:06.045)\r\nDo know what I would do if I, if my kids team was like, we're going to do a fundraiser and they all like do the same fundraisers, right? Like we're selling cookies or they sell those little booklets or, or whatever it is. This would be a really cool test of a fundraiser. Wouldn't that be freaking cool?\r\n\r\n\r\nChris Koerner (11:20.759)\r\nMm It would be. Yeah, it would like unite and unite the community in a way.\r\n\r\n\r\nNik (11:23.483)\r\nLike, Gert\r\n\r\n\r\nYeah, Gertlie posted about this recently where he's like, I have a friend of mine who makes over a million dollars a year making pancakes for nonprofits. And he works like 80 days a year. And basically his business model is anytime that these nonprofits have like a pancake breakfast or like something for the community, they hire his friend's company. His friend has like 50 % margins and he goes and just makes pancakes, right? That's, that's his business. You could do this in your local community. Like you could be like, Hey,\r\n\r\n\r\nchurch, hey, high school, hey, soccer club, hey, Girl Scouts, whatever it is, you could do multiple. This is the thing that I do is I, I coordinate these treasure hunts and I get local businesses to contribute. And this is the way we create the buzz on average. This is how much money we raise. And this is my fee, et cetera. But like that could be a business locally is creating these sort of fundraising nonprofits with the treasure hunt component to it.\r\n\r\n\r\nChris Koerner (12:21.944)\r\nI love it. And while we're talking about school school fundraisers, let me go off script for a minute because I did one of these and some business ideas that just like I execute and it works and then I move on and then years later no one else is doing it. And it's like, why, why isn't anyone doing this? This works. So school fundraisers, I used to coach a wrestling at a Bob Jones high school, shout out Madison, Alabama. And we had a fundraiser every year. Nope. I don't, that's not what I said.\r\n\r\n\r\nNik (12:34.557)\r\nThank\r\n\r\n\r\nNik (12:39.422)\r\nOkay.\r\n\r\n\r\nNik (12:47.473)\r\nBob Vance for Fiduration.\r\n\r\n\r\nChris Koerner (12:51.342)\r\nWe have a fundraiser every year and we would sell cheesecakes. We'd buy them for like $15 and then the wrestlers would go door to door in the neighborhoods and sell them for like 45, $50. Okay. And it was, it's a good business. Like in order to have any fundraiser, you have to have a lot of margin because there's so many middlemen involved. Right. And so the year after we did this, I was like, Hey guys, how about we do a different fundraiser? I own a company called phone restore. We recycle iPhones. Let's do an electronic electronics drive.\r\n\r\n\r\nI'll bring in a box, I'll brand it, I'll leave it in the wrestling room, you send out an email to the parents and they bring in old electronics and just put them in the box. And then I will list them on eBay, sell them and give you guys a cut of the money. And so it's like, it's a, it's a perfect business because people just donate for free stuff that they already have. And maybe it's a keyboard that really has no value. Maybe it's an iPhone worth $150. Well, that's worth like six cheesecakes, you know, and no one has to spend any money.\r\n\r\n\r\nNik (13:19.613)\r\nRemember this.\r\n\r\n\r\nNik (13:24.282)\r\nThank\r\n\r\n\r\nChris Koerner (13:49.088)\r\nup some rando on eBay on the other side of the country.\r\n\r\n\r\nNik (13:50.397)\r\nEverybody does the same fundraisers. It's the same thing every time. we'll have the parents bake some cookies and then we'll sell them off or like it's a they're going to raise the money because people are like they want to support that kid. Right or that cause not because I really want this food or that product. But if you could pair a very appealing product or offering with these fundraisers like you did with Bob Vance federation's high school wrestling.\r\n\r\n\r\nChris Koerner (13:56.088)\r\nYeah.\r\n\r\n\r\nChris Koerner (14:05.218)\r\nMm\r\n\r\n\r\nChris Koerner (14:20.387)\r\nMm\r\n\r\n\r\nNik (14:21.021)\r\nThat's a win for everybody, right? Like it's not just, give little Timmy 20 bucks because he's raising money. Like, no, I could actually use getting rid of lot of these old electronics.\r\n\r\n\r\nChris Koerner (14:22.894)\r\nSo when?\r\n\r\n\r\nChris Koerner (14:30.392)\r\nYeah, we also did a point system. You know a lot of like the fundraisers have like a competition where it's like, alright kids, whoever raises the most money gets free Olive Garden. But so I had a point system where it was like however many dollars your device is worth. That's like a point to you so that incentivize people to not just bring in an old keyboard or something that they knew was worthless. They would want to bring in a Nintendo Switch or an iPhone. I don't even remember what the what the prize was, but.\r\n\r\n\r\nNik (14:35.068)\r\nYeah.\r\n\r\n\r\nNik (14:48.114)\r\nthen\r\n\r\n\r\nChris Koerner (15:00.108)\r\nWhat's great about this is you don't have to do it with one school. You could do it like with every sports team at a high school. Right.\r\n\r\n\r\nNik (15:07.847)\r\nYeah. Any, any organization in your community that ever does fundraisers, like off the top of my head, Girl Scouts, Boy Scouts, high schools, what churches, elementary schools. I mean, and there's probably dozens more that I'm not even thinking of that are always looking for cool ways to differentiate themselves and get and raise more money.\r\n\r\n\r\nChris Koerner (15:26.648)\r\nYeah, so.\r\n\r\n\r\nChris Koerner (15:30.658)\r\nThis is a public call out. So I want to hear someone do this. And what's great about this business is a lot of the people listening have kids. And even if the kids in preschool could have a fundraiser there, high school, it doesn't matter. If you, if this idea excites you, I want you to go out and do it and approach your elementary school or your middle school, your high school, whatever it is, your church, and just pose this idea and see if you can gather some electronics, sell them on eBay or Facebook marketplace and report back and we'll, we'll have you on.\r\n\r\n\r\nand talk to you about how it went. Because this is a business that anyone could do.\r\n\r\n\r\nNik (16:01.35)\r\nonce it's\r\n\r\n\r\nlike what you just said is key. Like there's a no downside to this test. The downside is you're left with a bunch of electronics that you don't know what to do with because you couldn't sell them on eBay, right? But you didn't come out of pocket and buy all of this stuff. That's right. I like it. It's a good one.\r\n\r\n\r\nChris Koerner (16:09.004)\r\nMm\r\n\r\n\r\nChris Koerner (16:17.294)\r\nMm\r\n\r\n\r\nYeah, I guess that's our fundraising segment.\r\n\r\n\r\nNik (16:24.795)\r\nAnd now you know.\r\n\r\n\r\nChris Koerner (16:26.498)\r\nYou know why the treasure hunt idea works? Like this treasure hunt idea will always work because I can't speak for women, but it is ingrained in the male DNA to want to treasure hunt. Period. End of story. I don't care who you are. And that will never go away.\r\n\r\n\r\nNik (16:41.979)\r\nYeah. Yeah. We hunt and they gather. Right.\r\n\r\n\r\nChris Koerner (16:47.852)\r\nEdit that out, mama.\r\n\r\n\r\nNik (16:49.285)\r\nMe man, you woman. All right. Should we give it should we give the people what they want a perfumatic update? All right. Quick summary for those who don't know the long and short of it is Chris posted a reel to Instagram and YouTube two months ago at this point, two and a half months ago at this point, we got a bunch of inbound and the the real was of a perfume vending machine.\r\n\r\n\r\nChris Koerner (16:56.948)\r\nLet's do it. don't you go ahead.\r\n\r\n\r\nNik (17:15.037)\r\nPeople found it very interesting. And so because we had so many leads that came in, it was like 2 ,500 leads. We decided let's talk to manufacturer, negotiate a relationship and sell these things in the United States. And so we started doing that two months ago. And in August, yes, in August we did $61 ,000 of sales. So far in September we've done $52 ,000 of sales, but we are on track to pass our August numbers, which is awesome. We have, we are in the middle of negotiating.\r\n\r\n\r\nthe exclusivity rights to North America with, with the manufacturer, which has been awesome. We've built out, hired and built out a sales team that we have actually qualifying these leads and having conversations with people and quick plug. we are hiring for two sales positions. So if you're someone who either has been a setter or a closer in the past, you know, to work the phones, you're good with people and you want to come work with Chris and I email us Chris or Nick at co -founders .com anyways. So we've been working on building this, this infrastructure.\r\n\r\n\r\nAnd, we, it's like anything that you do, right? It always takes longer than you think. And it always costs more than you thought. But I'm like, Chris and I are both, well, maybe I won't speak for you. I'm really, really excited about the progress that we've made. We've got like real systems in place. We've got real followup processes, perfumatic, which is the company that we're working with has they run on Barcelona time, but\r\n\r\n\r\nlearning to work with them and work through it. And I'm just stoked for what happens in Q4. the last thing is, for the first month, we didn't have our prices dialed in. So our gross margin was like 34%. I just crunched the numbers. We've now we've now fixed our pricing and our gross margins are 43%. So not quite the 50 % that we were hoping for, but they've been, you know, much improved. And I'm I'm stoked. It's awesome.\r\n\r\n\r\nChris Koerner (19:07.53)\r\nI love how you said fixed our pricing. Cause it reminds me of whenever you get an email from a company that's raising their prices, they never say they're raising their prices. They always say like there's a price adjustment or like we're, correcting. Like it's just like, I know what you're saying. Our prices were messed up because we weren't up charging at all the accessories. So I get what you're saying, but it's also funny.\r\n\r\n\r\nNik (19:22.097)\r\nWell, OK. So here's.\r\n\r\n\r\nNik (19:29.169)\r\nWell, let me just explain it. So there is this perfume vending machine, and then there are accessories that you can pay for to add onto it. Accessories might be a coin or bill acceptor, credit card acceptor. There's a stand that's an accessory. There's a TV that you can have on it. It's an accessory. All of these things cost more money. The only thing that we were marking up was the original machine. Any accessory that people purchased, we were just passing through. There was no markup on that margin, which\r\n\r\n\r\nwas insane. mean, because some of these things were an additional thousand or 1500, I think even $2 ,000 in some cases. So we ended up fixing that where we ended up creating the same margin on those accessories as we did on the original unit. But that's what I mean by fixing pricing because otherwise it was it was not working.\r\n\r\n\r\nChris Koerner (20:18.424)\r\nDid you, did you just admit to price fixing? Edit that out,\r\n\r\n\r\nNik (20:21.297)\r\nYeah, I did.\r\n\r\n\r\nChris Koerner (20:25.622)\r\nWhat you're saying doesn't make sense, Nick, because it sounds like we kind of launched something too fast and then really screwed up something very fundamental. So I don't think that was us. Are you sure that was us?\r\n\r\n\r\nNik (20:34.009)\r\nMm hmm. This has been a fun project though, because I think this is the first time that you and I soup to nuts are like really in the weeds together launching something. Most of time we've launched something, it's been like, Chris is launching it and I'll come in and out for a minute or Nick's running this, bought this business. Chris will come in and out for a minute. But this has been fun. I'm really excited about.\r\n\r\n\r\nthe infrastructure we're building and what this means for the next thing that we do. Because it's just, you know, just the flywheel is going, my friend. It is gaining momentum.\r\n\r\n\r\nChris Koerner (21:09.856)\r\nIt is indeed. Alright, I got I got a couple little hacky ideas for you. I want you to grade them. I'm gonna grade them. They're kind of similar. So I'm going to pair them together.\r\n\r\n\r\nNik (21:13.221)\r\nAll right.\r\n\r\n\r\nOoh.\r\n\r\n\r\nNik (21:20.849)\r\nAre they hacky ideas or Coach Hackney? Ideas.\r\n\r\n\r\nChris Koerner (21:26.464)\r\nso niche. So RIP, RIP Coach Hackney. That was my wrestling coach, astronaut high school.\r\n\r\n\r\nNik (21:28.806)\r\nA deep cut.\r\n\r\n\r\nNik (21:34.173)\r\nThat was a child molesting high school wrestling coach who just died.\r\n\r\n\r\nChris Koerner (21:39.383)\r\nI literally.\r\n\r\n\r\nNik (21:42.093)\r\nSorry. Sorry.\r\n\r\n\r\nChris Koerner (21:43.982)\r\nwrite that down.\r\n\r\n\r\nChris Koerner (21:49.442)\r\nWhy are you going to mess with my flow? He was not a child molester. He literally died ever when thinking he was a child molester, but the kid redacted that. It's a really sad story. Don't don't kill my boner here, Nick. Please actually edit the about the word boner and molester mom. Let me double check. We're not live streaming. Okay, cancel. all right. Let me get back.\r\n\r\n\r\nNik (21:49.597)\r\nThe way he is.\r\n\r\n\r\nNik (21:59.869)\r\nI'm sorry.\r\n\r\n\r\nNik (22:05.062)\r\nI'm sorry, okay, okay.\r\n\r\n\r\nNik (22:17.245)\r\nAll right, hacky ideas. I'm freaking ready for this. I love hacky ideas.\r\n\r\n\r\nChris Koerner (22:20.846)\r\nAll right, I love this because this is something that like an indie hacker could build I don't know how they're make a lot of money So I'm saying that up front it would be a fun project and either one has the opportunity to go viral Because of what they are number one We all order stuff on Amazon. In fact, the average American spends $1 ,600 a year on Amazon and about 10. Yeah And about 10 % of those orders are late\r\n\r\n\r\nNik (22:41.788)\r\nReally?\r\n\r\n\r\nChris Koerner (22:50.03)\r\nLate being alright, we expected to arrive between 7 AM and 11 AM and it arrives that afternoon. So it doesn't have to be the next day. Just late. Now, Nick, have you ever had something rivalry on Amazon in like complained via like a chat? Or customer support? OK, well, your wife and I are similar. We're both very frugal. And we've gone full Karen on an Amazon associate at some.\r\n\r\n\r\nNik (23:05.487)\r\nI have not, my wife has.\r\n\r\n\r\nNik (23:11.568)\r\nMm\r\n\r\n\r\nChris Koerner (23:17.686)\r\nAnd Amazon is what is Jeff Bezos obsessed with?\r\n\r\n\r\nNik (23:21.917)\r\ncustomer experience.\r\n\r\n\r\nChris Koerner (23:23.15)\r\ncustomer experience. They are always wrong. The customer is always right. Okay, and so basically if something arrives late and you complain about it, they will bend over backwards to make it right. Sometimes they'll refund you and let you keep it. I'm sure they have an algorithm based on the price of the item and what type of thing it is, but basically they will make it right more than they need to. So at LCD cycle about 10 years ago.\r\n\r\n\r\nWe used to use a service called 71 pounds. I don't know if they're still in business anymore. I, yep, yep. And I love this business because they would, they had an automation that would dispute, FedEx packages if they were late from like the shippers perspective. So we shipped a ton of FedEx packages every day and FedEx has a guarantee in their terms of service. If it's late, we'll give you a refund.\r\n\r\n\r\nNik (23:54.301)\r\n71 pounds. Okay.\r\n\r\n\r\nChris Koerner (24:16.366)\r\nBut you have to fill out a big form. It's a bunch of paperwork and most of these packages cost $15 a ship. It's just not worth the business owner's time. So they had an automation that would fill out the form and send it automatically. And their revenue model was they would take 40 % of everything they saved you. It's a great offer. Like, what do I have to lose? I'm not doing this today. Why not? So it is the same model with Amazon, just on a consumer basis. So it's a chat bot, basically, that is free. And it just\r\n\r\n\r\nNik (24:21.627)\r\nMm.\r\n\r\n\r\nChris Koerner (24:44.63)\r\nlogs in your Amazon account through an API, which is currently available, and monitors to see if something's late or not. And if it's late, it hops on the chat and goes full Karen with a customer associate and saves you money or makes you money back. And it monetizes by taking a percentage of the savings. What do we think?\r\n\r\n\r\nNik (25:01.885)\r\nSo whereas 71 pounds was from the shippers perspective, this would be a chat bot for the consumer.\r\n\r\n\r\nChris Koerner (25:08.396)\r\nYep. Free to use.\r\n\r\n\r\nNik (25:10.914)\r\nSo I, cause I've never done it on Amazon. You and Jess have obviously. You never talked to anybody. It's literally just a chat box.\r\n\r\n\r\nChris Koerner (25:19.926)\r\nNo, it's a human over chat.\r\n\r\n\r\nNik (25:22.279)\r\nWell that's what I mean, sorry, that's what I mean. You're just chatting with somebody? Yeah, why would you not make that?\r\n\r\n\r\nChris Koerner (25:24.29)\r\nYeah. Yeah.\r\n\r\n\r\nI mean, they have, there's a fairly big company, I forget the name that does this for like Comcast and AT &T and it will negotiate your bill. They'll say, Hey, I'm canceling. No, no, no. And it knows what their script is. So it uses that against them and saves you money. So this is like already an established business, even for consumers. Why not for Amazon?\r\n\r\n\r\nNik (25:46.235)\r\nWell, I mean, it's interesting because if you think about it broadly, a lot of companies make money because of the friction that they introduce in their processes. healthcare company. is healthcare companies do lots of healthcare companies will just blankly deny claims to a provider. Like if I'm a physician and I bill a healthcare company, they'll just get an automatic rejection and then you have to re bill it and you know, magically they pay you.\r\n\r\n\r\nChris Koerner (25:58.564)\r\nStrategically introduced friction. We talked about this last week.\r\n\r\n\r\nMm\r\n\r\n\r\nNik (26:16.253)\r\nAnd, you know, because they just assume that some percentage of those physicians aren't going to rebuild that claim. So they keep it right. Or they're like very technical with what they asked for. And maybe, you know, something technically was missing, but that's on the healthcare side of things. I read a statistic once that gift cards is like 10 to 20 % of all gift cards go unused, which is like a\r\n\r\n\r\nChris Koerner (26:35.34)\r\nYeah. Yep. There's a whole there's a whole industry around that.\r\n\r\n\r\nNik (26:40.697)\r\nRight, right. So it's like there are, in my mind, the Amazon example is an example of sort of the friction that exists with, and I don't even know what I would call it, with claiming your full value, basically. You know what I mean? So that's an interesting framework to kind of think about these opportunities from.\r\n\r\n\r\nChris Koerner (27:01.87)\r\nI'm picturing\r\n\r\n\r\nNik (27:26.545)\r\nMm -hmm. Sure. Sure.\r\n\r\n\r\nChris Koerner (27:32.406)\r\nStop getting screwed over with late Amazon packages. Dispute is on. There it is. Dispute is on. It's the worst name ever. Going to name cheap, going to name cheap. D -I -S.\r\n\r\n\r\nNik (27:37.265)\r\nDispute is on? You don't do a crap, you?\r\n\r\n\r\nNik (27:45.821)\r\nI like that. I like that idea. think that's I think that's an interesting idea. You're essentially you're advocating on behalf of the consumer. It could be for Amazon. It could be for Walmart deliveries. It could be probably a service for like disputing credit card transactions as well because dude. Okay. Funny story. When I had my first real liquidity event, I didn't buy anything. I wanted to buy something. I really wanted to buy a Lincoln Aviator because they're freaking super sick cars.\r\n\r\n\r\nBut I didn't, I waited, I didn't buy anything for a year, which is kind of the advice that I heard. It was what it was, but I did get one thing. Do know what it was?\r\n\r\n\r\nChris Koerner (28:24.142)\r\nYou're like, it's kind of the advice that I heard from like the grown woman that lives with me in my house.\r\n\r\n\r\nNik (28:28.157)\r\nNo, the grown woman that lived with me said, you can't buy anything. So, all right. So the one thing, the one thing that I got was this card. And I know it sounds stupid.\r\n\r\n\r\nChris Koerner (28:35.215)\r\nnot even food.\r\n\r\n\r\nChris Koerner (28:44.353)\r\nAmerican Express for those listening.\r\n\r\n\r\nNik (28:46.289)\r\nThis is the American Express Platinum Card and it's metal. I mean, it feels super cool in your hand.\r\n\r\n\r\nChris Koerner (28:51.182)\r\nWait, wait, So you had a seven figure liquidity event and your one splurge was a credit card with what a $500 annual fee?\r\n\r\n\r\nNik (29:01.437)\r\nat 7 .50.\r\n\r\n\r\nChris Koerner (29:04.034)\r\nOkay, and you can't meet you.\r\n\r\n\r\nNik (29:08.893)\r\nAnyways, so which my wife hated like $750 a year, what are we even getting for that? And I was like, it's a metal car, Jessica. It's a credit card that made a little I don't what do mean? I don't understand. When I hand it to people. Hello McFly. When I hand it to people and they go, wow. That's what I'm going for here, dude. Anyways, when I when I decided and I'm doing air quotes when I decided to cancel that card.\r\n\r\n\r\nChris Koerner (29:17.846)\r\nIt's metal. Do you hear it?\r\n\r\n\r\nYou knock on it. Hello, hello, you're knocking on the card.\r\n\r\n\r\nChris Koerner (29:30.164)\r\nwow.\r\n\r\n\r\nNik (29:38.929)\r\nbefore it auto -renewed, had to cancel it, but I didn't talk to anybody. I freaking spent an hour. I spent an hour canceling this stupid freaking credit card. And the people who are...\r\n\r\n\r\nChris Koerner (29:49.838)\r\nNow, now's when you got to go full guru and be like, and my hourly rate is way more than $750.\r\n\r\n\r\nNik (29:57.917)\r\nI spent probably close to $17 ,000 just canceling that credit card. Yeah, yeah. Time equals money. Anyways, because these salespeople are all trained on the same or whoever it was on the other end is all trained on the same thing. like, are you sure we can give you this, this new promo rate? we could actually give you this XYZ thing to entice you to stay with us. And it takes forever because they got to like get through their script. If you could have a chat bot that like goes and cancels subscriptions because you\r\n\r\n\r\nChris Koerner (30:02.936)\r\nworth of time.\r\n\r\n\r\nChris Koerner (30:25.326)\r\nI think they have that, but I'm sorry. You keep going. Sorry. I'm going to level it up. But I think, I think they have that. But what we could do is make like some of these, you have to call them and do it. And the technology is already here where you can use AI, an AI voice to have that same conversation. Like we used to only be able to do over chat. So it could just be the same thing, but just phone calls only take a percentage of what they save you.\r\n\r\n\r\nNik (30:27.858)\r\nDo they?\r\n\r\n\r\nNo, no, no, I'm done.\r\n\r\n\r\nNik (30:40.06)\r\nHmm.\r\n\r\n\r\nNik (30:48.167)\r\nOkay.\r\n\r\n\r\nNik (30:51.739)\r\nI love it.\r\n\r\n\r\nYeah, overall, I love the framework though of like, okay, what can we automate or use AI to take friction or uncomfortable, uncomfortable situations for the consumer? like there are a lot of people, you and Jess, you're fine calling up Amazon. Be like, Hey, this package was 14 minutes late, right? And whatever you get some refund. Me, I'm to be like, nah, you know, that guy's probably having a hard day. That's not worth it. You know what I mean?\r\n\r\n\r\nChris Koerner (31:13.634)\r\nMm\r\n\r\n\r\nChris Koerner (31:19.106)\r\nBeta.\r\n\r\n\r\nNik (31:21.765)\r\nI am a beta.\r\n\r\n\r\nChris Koerner (31:23.864)\r\nYou better not call yourself that. You're worth more than that.\r\n\r\n\r\nNik (31:27.708)\r\nChris, thank you.\r\n\r\n\r\nChris Koerner (31:29.004)\r\nWell, I'm glad you like it because I just bought the domain name disputazon .com. So if someone wants to start it, you gotta go through this guy first. Okay. But in all seriousness, if you do want to start it, just email me and I'll give you the domain name. So, all right. That's the first kind of kitschy hacky indie hacker idea. Second one, how often you get spam text messages.\r\n\r\n\r\nNik (31:36.407)\r\nHahaha!\r\n\r\n\r\nNik (31:43.261)\r\nCool, love it.\r\n\r\n\r\nOkay? Okay?\r\n\r\n\r\nNik (31:54.15)\r\nat least once a day. It's terrible.\r\n\r\n\r\nChris Koerner (31:55.51)\r\nIt's the worst. I hate it every time. Do you get like job offers? Like, hey, I don't even know. I want to know what the what the play is there. First of all, I'm very curious. I need to go through it.\r\n\r\n\r\nNik (32:07.399)\r\nI know I'm always like, are you kidding me? This is terrible. What's the name of your company and who's your supervisor and where can I get more information about this job?\r\n\r\n\r\nChris Koerner (32:14.83)\r\nBut like what's your signing bonus and never text me again.\r\n\r\n\r\nNik (32:18.449)\r\nHahaha!\r\n\r\n\r\nChris Koerner (32:19.886)\r\nSo I just got this text at 12 o 'clock exactly as we started recording, ready to sell, we're DHRE and looking to buy properties around Plano, Allen and McKinney. Are you still interested in selling? If not, you can reply stop. First of all, that's not how this works. That's not how this works. You don't just take my number and text me and then say, you could reply stop. No, that's what you send when I opt in to your message, right? So that's not how this works.\r\n\r\n\r\nNik (32:36.253)\r\nWhat do mean?\r\n\r\n\r\nChris Koerner (32:49.742)\r\nSo first of all, the fines for texting people that did not opt in are, I think it's like $5 ,000 per offense. And there are stories of people that have, yeah, there are stories of people that have like forked out six and seven figures because a handful of people grouped together, they found each other somehow and they find them.\r\n\r\n\r\nNik (32:59.922)\r\nWhat?\r\n\r\n\r\nChris Koerner (33:13.774)\r\nOkay, so here's the idea. You ready? You ready?\r\n\r\n\r\nNik (33:15.837)\r\nOkay. Yeah. huh.\r\n\r\n\r\nChris Koerner (33:20.994)\r\nan app where there's just like a five digit short code. And anytime someone texts you something like this, you just text this number, that number or a screenshot, and it will automatically fill out like an FCC violation form for you. Kind of like the last idea. Okay. But I don't know how you monetize it. It reminds me, have you heard of do not pay .com? So do not pay is\r\n\r\n\r\nNik (33:47.675)\r\nNo, never heard of her.\r\n\r\n\r\nChris Koerner (33:50.59)\r\na website that started and literally all they did was dispute parking tickets in San Francisco. And they like didn't know how to monetize. And now it's like quite a big company. They've raised seven, eight figures from VC and they do all kinds of things like what we're talking about. So they kind of set the precedent that there is a way to monetize something like this. but it might just need to be like donation based or something for people that really, really, really extra hate getting texts like these. What do we think?\r\n\r\n\r\nNik (34:20.573)\r\nI'll tell you my wife would freaking buy that. She would. Okay, here's my question. Who do they pay the $5 ,000 fine to?\r\n\r\n\r\nChris Koerner (34:31.575)\r\nthink the FCC, the Federal Communications, whatever.\r\n\r\n\r\nNik (34:36.189)\r\nBecause the FCC won't let me be, or let me be me, so let me see. They try to shut me down on MTV, but it feels so empty without me. No? Nothing? Just blazing right through it, okay. Because if you could organize a class action lawsuit and then actually share in what they pay out in fines, would that make sense?\r\n\r\n\r\nChris Koerner (34:46.904)\r\nNo.\r\n\r\n\r\nChris Koerner (34:55.63)\r\nMmm, there it is. There it is.\r\n\r\n\r\nNik (34:58.801)\r\nBut I don't know if that's how it works.\r\n\r\n\r\nChris Koerner (35:02.446)\r\nAll right, the FCC fine for cold texting is this. If a business violates the TCPA by sending unsolicited texts without explicit consent, it can face penalties ranging from 500 to $1 ,500 per message, depending on whether the violation was willful or accidental. These fines apply on a per violation basis, meaning businesses that send multiple cold texts could quickly face substantial fines.\r\n\r\n\r\nChris Koerner (35:32.054)\r\nSo there's that.\r\n\r\n\r\nNik (35:35.643)\r\nYou should not have brought this segment up.\r\n\r\n\r\nChris Koerner (35:40.994)\r\nI need to make a call.\r\n\r\n\r\nNik (35:42.769)\r\nAll right, I got an idea. Are you ready?\r\n\r\n\r\nChris Koerner (35:46.36)\r\nMm -hmm.\r\n\r\n\r\nNik (35:47.869)\r\nA couple of weeks ago, had, her name is Lauren Rofflesberger on my podcast and it was a Nickonomics. For those who don't know, my podcast is called Nickonomics and she has a company that owns commercial real estate, self storage. And ever since that conversation, I have just become, not ever since, for a while now, I become obsessed with commercial real estate.\r\n\r\n\r\nI mean, it's a big reason why we bought the park in Waco because I was like, dude, I want to, I really want to buy some corrosion real estate. Let's get into this space. And everybody talks about how cool it is. And I've always just thought it'd be so nice to have a business like a mailbox business, right? A mailbox business where we just get a check in the mail, triple net lease. It's taken care of whatever. I always view that as like the dream, so to speak. Anyways, so she came onto my podcast and she talked about the space.\r\n\r\n\r\nChris Koerner (36:42.734)\r\nMm\r\n\r\n\r\nNik (36:47.813)\r\nand I'm just going to like do some overviews. Do you know what like the average net margin is for self storage?\r\n\r\n\r\nChris Koerner (36:55.854)\r\n42%.\r\n\r\n\r\nNik (36:57.725)\r\nYeah, it's close. It's between 30 and 40%. It's like the average net margin. Now there are some major pros to commercial real estate and I'll list them out. Pro number one, it's a real estate backed asset. So you're not buying a services business that can go down 100 % in value because you lose all your customers. there's a limited, they ain't making more real estate. There's a limited supply of real estate and that's what's backing this asset.\r\n\r\n\r\nthere's a, it's a limited supply, so that helps maintain the value. It's got predictable cash flows, which are amazing. It's got fairly high barriers to entry. Like unless you have some capital to put down, you can't just buy a self storage facility. it's recurring revenue, right? Everybody in the SMB space loves, Ooh, it's recurring. that's a SaaS product. And it's not labor intensive. Like if you have one of these large self storage facilities, you don't have a bunch of labor that you're managing. So.\r\n\r\n\r\nChris Koerner (37:56.483)\r\nMm\r\n\r\n\r\nNik (37:56.733)\r\nThere's a million things why it's attractive. You get cash flows over time, the asset appreciates. It's a, a very safe investment. There are a lot of cons to it though, right? The cons are very limited upside in that particular facility. Maybe you increase rents, but you're not going to like triple your NOI every single year. It's going to just grow slow and steady, probably with the, with the rate of inflation, maybe a little faster if you're in a high pace, high, high growing market. It is capital intensive to expand. So if you want to buy other\r\n\r\n\r\nfacilities, you've got to put money into buying more real estate. It's slow and it's steady. Getting in is hard, right? Like kind of like the first deal is kind of the hardest because you don't really know anything about real estate and you've got to find someone who does know. And if you're just if you're going to put, you know, $200 ,000 into a piece of real estate and you're going to take a million and a half dollar loan, like that's a big swing for someone who doesn't know anything about the real estate space. Right. So it's hard to get into.\r\n\r\n\r\nAnd for the most part in these self -storage deals, there are no deals, right? Like everybody wants to look at it be like, I want to get it for as cheap as I can because then there's lots of upside. Like, no, people are paying like four or five, six caps for these purchases. And what the cap rate essentially means is that's the rate of return on the asset value. So it's a little bit above just a treasury, which you're getting 5 % at to go buy real estate, these self -storage.\r\n\r\n\r\nfacilities, you're going to purchase them at a six, seven cap. Maybe you'll get a much better cap, but what I'm saying is by and large, the deals that you're seeing that are brokered are kind of in that space. Did I miss anything with the pros and cons of self -storage? Commercial real estate.\r\n\r\n\r\nChris Koerner (39:44.192)\r\nNo, I think there are still deals out there. Connor, friend of the pod, he buys self storage only off market and he gets really, really good cap rates. it's like there's fewer than mobile home and RV park storage, but more than people might think off if off market.\r\n\r\n\r\nNik (40:03.004)\r\nSo that's where I want to go with this. A lot of times we're focused on the side hustle. I could spin this business up and I'm making 50 grand a year. Or I could do X, Y, thing and make $50 ,000 a pop. But I don't think what people realize is you can do the side hustle with real estate. It doesn't necessarily produce the same amount of consistent cash flows. But what I mean by that is\r\n\r\n\r\nChris Koerner (40:12.142)\r\n.\r\n\r\n\r\nNik (40:32.013)\r\nLauren has like a very predictable process. And basically what she's done is she's become an expert in her local market. She only buys in her local market. And so what she's saying is like, know where the good areas are, the bad areas are, I know what a good price is, and what a bad price is, like I know what market is. I also know what people will pay. know what developments are being put in place around them. Like she knows it so well that she's able to take\r\n\r\n\r\na bigger swing maybe than she otherwise would have to buy something that isn't necessarily a deal. So she becomes an expert in her local market. And then the first property that she buys was with her money, but also she went and raised some outside investor money and she did a seller note. the step three, she does some value add, she raised rents, and then she ended up selling that property and rolling it into another property.\r\n\r\n\r\nBut the piece I'm trying to take from here is like, I think we spend a lot of time looking for the side hustle and you can do that. But I also think that commercial real estate is a proven way to make anybody a millionaire over time. And if you just started looking in your local market for deals and familiarizing yourself with deals, then when the right deal comes across your plate, you can pounce on it and start getting into the real estate game. Now, the reason I wanted to bring this up is because\r\n\r\n\r\nI wanted to talk to you about how would you source off market deals? Because I'm a big believer in get your experience on market and then buy off market because you're going to get a better deal. You'll probably get better terms with the seller. You'll probably have a better chance of actually closing than if you go on market. Otherwise you got to work through a broker, et cetera. But I also don't think you should go off market without having experience first because that's just a recipe for disaster. So you like what would you do?\r\n\r\n\r\nOr how would you go about looking for that first piece of commercial real estate off market?\r\n\r\n\r\nChris Koerner (42:33.646)\r\nI think the part about like looking in your local market is one of the most important things that you said there because\r\n\r\n\r\nChris Koerner (42:45.144)\r\nThat's just like the big risk is that you can completely screw something up because you're looking at something on a spreadsheet and you're like, wow, this deal over here in Washington is killer deal. Look at these numbers, but you might not know about zoning regulation changes or a new employer coming or leaving town. Whereas every single local in that area will know those things. So I, I can't emphasize that enough. I don't think it has to be your local market. I think preferably it is, but it has to be the same market.\r\n\r\n\r\nYour first deal at least like you.\r\n\r\n\r\nNik (43:15.823)\r\nor a market that you know better than average. It's just too big of a risk, right? Especially if you're trying to do it as a quote unquote side hustle. Once you've got some experience under your belt, maybe you go into other markets that you don't know as well, because you know what risks to look for. yeah, local market. Sorry, go ahead.\r\n\r\n\r\nChris Koerner (43:34.338)\r\nI think the biggest benefit of buying on market is you've got a third party, hopefully one that you trust that like blesses the deal. Maybe it's the listing broker, maybe it's your buying broker, but at least you have someone in the industry. This isn't always the case. There are a lot of terrible brokers out there. Someone in the industry putting his reputation, his or her reputation on a deal. So you can at least feel safe knowing, okay, this is listed on the market. Other people are looking at it. I'm not crazy.\r\n\r\n\r\nNik (43:47.378)\r\nMm\r\n\r\n\r\nChris Koerner (44:04.012)\r\nwhereas if you go find an off market property, you might've just called that person on the day that they found out that they had a massive environmental issue and they're very much excited about selling and you don't know the questions to ask. Whereas if a, if a broker was listening that he would know. so for your first deal on market makes a lot of sense. how would I find an off market deal? Like driving for dollars is by far the least efficient, but most effective.\r\n\r\n\r\nwhich is just driving around, finding a piece of real estate and talking to the owner face to face. There's always a trade off between efficiency and effectiveness driving for dollars. You can't get any more efficient than talking to someone face to face. but it's, I'm sorry, effective, but it's very, very inefficient, time consuming on the complete other end of the spectrum. The least, effective most efficient is texting people.\r\n\r\n\r\nJust saying, hey, like I love your property. I'm here in the area. Do you have any interest in selling and then getting them on the call as soon as possible and then getting them in person as soon as possible. That's like both ends of the spectrum.\r\n\r\n\r\nNik (45:13.489)\r\nYeah, I think, I think if I were, and I've actually started doing this is just getting to know people who let's say they're at my church or my kid's school and you know, their parents have other kids at the kids school and I hear that they're in real estate or they're in commercial real estate. I just start getting to know them and asking them questions and just saying like, Hey, I'm, I'm open if you ever find a deal in this area, but you've\r\n\r\n\r\nYou've got to get your reps in even going and talking to brokers and just understanding what is a good cap rate? What do I look at and do diligence? What makes sense? Because otherwise when the when the right deal actually does come your way, you're going to screw it up. You're to think, I got to get a better price. I got to get better terms. I got to get, know, whatever, because you don't actually know what market is. And I see so many first time buyers, so many first time buyers f up because they just don't know how the deal process works.\r\n\r\n\r\nLike they think something's way more important than it actually is because they just don't understand it. They're scared. They don't know all the risks or all of the non -risks that look like risks that actually go into the deal process. I think just getting started and starting to look and just saying, okay, a year from now I'm going to buy my first property, but this first year I'm just getting my reps in. I'm just getting my reps in. Because if you can get into that self -storage facility and you can get into these with $100 ,000 down, they're like...\r\n\r\n\r\nI'm not saying it's easy to get $100 ,000, but given enough time and enough self -discipline, you can get $100 ,000. And once you get into that first one and it's cash flowing, then you start building equity, then you can take the equity from that and roll it into another one. Again, it's not going to make you a million dollars overnight, but it is the most proven and consistent way to make you a millionaire over time.\r\n\r\n\r\nChris Koerner (46:47.043)\r\nMm\r\n\r\n\r\nChris Koerner (46:54.904)\r\nYeah, the hard part is like the listener base of this myself included, because I listen to my own podcast is the opposite bias for action. Let's start now. Let's sell it before you have it. Let's buy the domain name right this second. That's the opposite advice of what is needful in commercial real estate. Take your take your time.\r\n\r\n\r\nNik (47:12.295)\r\nWell, that's why I'm saying is like, if you want to get into commercial real estate, like I do, you can still have a bias for action. Just your bias for action is just starting to talk to people, like getting to know the deal, like understanding the process, right?\r\n\r\n\r\nChris Koerner (47:23.703)\r\nYeah.\r\n\r\n\r\nYeah, it's just hard. It's hard to direct that the right way because I think most people and like they translate that to me. I want to buy a park or self storage as soon as I can. Yeah.\r\n\r\n\r\nNik (47:34.693)\r\nYeah, because there's not the same dopamine hit. Yeah, there's not the same dopamine hit and like seeing the results.\r\n\r\n\r\nChris Koerner (47:40.013)\r\nYeah.\r\n\r\n\r\nNik (47:41.885)\r\nSo, okay, that was it.",
  "metadata": {
    "duration": "",
    "date": "2024-10-11",
    "platform_source": "Google Drive"
  }
}