{
  "episode_number": "205",
  "episode_title": "The $3 Million Online Trade School Model: Solving the Labor Crisis with Hector Resendez",
  "guest_name": "Hector Resendez",
  "business_name": "Tribe",
  "transcript": "﻿Nikolas Hulewsky (00:00.918)\r\nAll right, Hector, one of my favorite guests, you're back. Last time we spoke, you had a trade school, it's doing $3 million a year. It's like 30 % net margins, which was nuts. And you blew a lot of people's minds. A lot of people just have been reaching out to you and saying like, what, how do I do that? And so I thought it'd be amazing, because a lot of stuff is happening right now in the real world to bring you back on and talk about not only the trade school, but how companies can take advantage of trade schools.\r\n\r\n\r\nsupply themselves with a staffing pipeline and make a lot more money.\r\n\r\n\r\nHector Resendez (00:36.161)\r\nman, thanks for having me back. It's life changing. Obviously I joined Tribe and you're an investor of Tribe, so I have to call you boss now, even, even jefe, jefe, but even then after doing your pod, man, it really, I got a lot of DMs and I felt like what it's like to be you and popular and prom king and all that stuff. So it's been a wild ride. I appreciate it.\r\n\r\n\r\nNikolas Hulewsky (00:37.88)\r\nCourse.\r\n\r\n\r\nNikolas Hulewsky (00:47.49)\r\nYep. Yep.\r\n\r\n\r\nNikolas Hulewsky (00:58.572)\r\nYeah, you're making real money. So that's the good stuff. So I'm going to set the table for people who are listening. Last time we had Hector on, Hector owned a trade school. And it sounds weird, but it was an online trade school. And the government actually pays the trade school for people to come in and for him to train them. And it was an amazing episode. If you want to go back and listen to it, we'll link in the show notes. But the reason that these trade schools are becoming more popular is because we have a staffing shortage when it comes to\r\n\r\n\r\ntrades. And so going to read some statistics. Right now in America this year, we are 550,000 plumbers, 600,000 auto mechanics, 80,000 electricians short of where we need to be. That's nuts. Like that's how short we are. So if you're out there and you're like, well, yeah, I remember calling to get my pipes fixed or my HVAC fixed or some electrical fixed, and it took three weeks to get out there. That's why. I mean, there's just a massive, massive shortage.\r\n\r\n\r\nHector Resendez (01:45.347)\r\nMakes sense.\r\n\r\n\r\nNikolas Hulewsky (01:58.062)\r\nAnd not only do we have a shortage, but it's actually going to get worse over time because the people who have been in the trades are retiring and people like you and I, who, when we grew up, our parents were like, oh, you don't want to be like that guy, an electrician. You should go to college and get a degree. And so because of that, you know, we don't have as many people in the trades and, but we have degrees and we don't really know what to do with our hands. I don't like, don't know how to change oil in a car. And so there's this imbalance of demand and supply and you.\r\n\r\n\r\nHector Resendez (02:13.145)\r\nRight.\r\n\r\n\r\nHector Resendez (02:23.171)\r\nYep.\r\n\r\n\r\nNikolas Hulewsky (02:26.986)\r\nstarted with this online trade school and you've sort of morphed now into helping businesses figure out their staffing pipeline by taking advantage of these grants. They don't need to start their own necessarily massive school, but internally take advantage of the grants, train people up, get them trained on those trades, and then they fix their staffing problems. Is that a fair characterization?\r\n\r\n\r\nHector Resendez (02:29.295)\r\nMm-hmm.\r\n\r\n\r\nHector Resendez (02:40.271)\r\nGreat, great.\r\n\r\n\r\nHector Resendez (02:48.495)\r\nGood night. You said it all. No, no, that was good. That was amazing. That's that's coming. Mike dropped. did good. Don't forget to tip your waitress on the way out. That's awesome. Yeah. No, you said, I mean, you left out this the cool part of how we do the training, right? But we'll get into it. But yeah, I mean, you said it correctly. One thing that stands out, I'm a big Mike bro friend and he's a big, you know, he's Mr. Trades and he always says it for every five.\r\n\r\n\r\nNikolas Hulewsky (02:52.63)\r\nI'm out of here.\r\n\r\n\r\nNikolas Hulewsky (02:58.196)\r\nstop.\r\n\r\n\r\nHector Resendez (03:16.505)\r\npeople that retire only get one gets replaced. So I think we're in trouble, pretty little trouble.\r\n\r\n\r\nNikolas Hulewsky (03:22.328)\r\nWell, you know what's crazy is like, everybody's like, AI is going to do X, and Z. And then, and then you look at it, you're like, yeah, but AI is not replacing the trades. AI is not helping the trades. But, but I was, Chris and I were having this conversation just yesterday. I have a sprinkler head that was broken in the yard. Chris had a problem with his HVAC unit with his air conditioner. And we were talking about how we faced time, chat GPT, and we're like, Hey, what's going on here? And it like walked Chris through what was wrong with his air conditioner. I guess it was missing some.\r\n\r\n\r\nHector Resendez (03:42.703)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (03:51.801)\r\nfree on and it walked me through identifying what the problem was with my sprinkler head. So it's like there is AI that's augmenting, that's helping people in the field that I actually think is going to make it more efficient to like diagnose the problems, fix the problems, et cetera. But then there's also things like you just showed where these VR headsets, like people are training in virtual reality on how to fix these things, right?\r\n\r\n\r\nHector Resendez (03:52.943)\r\nMmm.\r\n\r\n\r\nMmm.\r\n\r\n\r\nHector Resendez (04:00.335)\r\nSure.\r\n\r\n\r\nHector Resendez (04:10.65)\r\nYep. Yep. Yep. Exactly. I went through that myself. mean, two days ago, I woke up to just the fan blowing, like fan mode, and we're all kind of hot. It's 100 degrees outside. And I'm like, you know what? I've never even taken my own course. I'm like, let me just fast forward it to this part. I put on the goggles. I watched it. It turns out it's just a capacitor.\r\n\r\n\r\nIt looks like a little battery. So I swapped that out. I didn't get electrocuted. I'm like, man, we're in trouble. We're in trouble because that would have been a $300 trip easily for somebody just to swap out a little battery looking thing. Yeah.\r\n\r\n\r\nNikolas Hulewsky (04:42.808)\r\nThat is insane.\r\n\r\n\r\neasily. Well, the idea that Chris and I discussed yesterday, which I think is an amazing idea, I even bought the domain. It's called handymanmentors.com. There are guys like me who just, I'm not handy, right? Like we didn't grow up handy, even though my dad tried to teach me how to do stuff. I'm a son of an immigrant. Are you son of immigrants? Okay.\r\n\r\n\r\nHector Resendez (04:53.923)\r\ncowboy\r\n\r\n\r\nOoh.\r\n\r\n\r\nHector Resendez (05:01.742)\r\nYeah.\r\n\r\n\r\nHector Resendez (05:09.924)\r\nyeah, my parents are from Mexico and they didn't teach me to do nada.\r\n\r\n\r\nNikolas Hulewsky (05:12.974)\r\nYeah, yeah. So like, our dads are probably super capable. Like they could do anything, right? And they look at us and they're like, oh, you pansy, you don't even know how to change the oil. Yeah. Well, that's not how your dad sounds. Your dad's like, Hey, Hector, like, why can't he even change the oil? I don't know. That was like way off. That was super racist. Anyways, like we didn't learn how to do this stuff. And like,\r\n\r\n\r\nHector Resendez (05:16.619)\r\nHector Resendez (05:20.719)\r\nRight, right, right. Not for sure.\r\n\r\n\r\nHector Resendez (05:31.535)\r\nIt's okay, a little bit of racist, but just a little bit, like 10%, 10%.\r\n\r\n\r\nNikolas Hulewsky (05:39.628)\r\nIf we're just going to wait for people to come out from the HVAC company or the electrician, it's going to be two, three weeks. So why not have where we're setting up these boomers to meet guys like me and just kind of mentor them, teach them like, this is how you change a sprinkler head. This is how change the oil in your car. is how you, I don't know, redo an electrical box. That actually might be too much. But you get the point I'm making, right? Where it's like, raise the competency of normal people so that\r\n\r\n\r\nHector Resendez (06:00.623)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (06:07.16)\r\nWe're not necessarily just waiting two or three weeks for people to come out and fix real stuff.\r\n\r\n\r\nHector Resendez (06:11.507)\r\nIt's true. I mean the guy that fixes my C lives four houses away and he's my neighbor but it's prime time. He's like, man, I could get to you maybe in three days. And I'm like, do you live across the street? Like just come over. But he's just, he's that busy. I mean, I couldn't knock him and I'm like, my wife looked at me she's like, you know, let's go stay at my dad's. I'm like, I'll figure it out. And then I figured it out. But the thing is you have to be careful. I don't want to figure too much out because then she's going to figure out how to do stuff and expect.\r\n\r\n\r\nNikolas Hulewsky (06:23.981)\r\nYeah.\r\n\r\n\r\nIt's insane.\r\n\r\n\r\nHector Resendez (06:40.451)\r\nthings for me, so I set the bar really low. Yeah, I don't even own a ladder. I'm just not that guy.\r\n\r\n\r\nNikolas Hulewsky (06:40.61)\r\nYeah, it's a fine line, dude. It's a fine line. You can't let your wife know that you know how to do things because then there's expectations. It's you get it. Whoa, whoa, whoa, whoa, whoa. Did you not see my shirt? OK, it says I'm formal, but I'm also here to party. Right. And his bracelet.\r\n\r\n\r\nHector Resendez (06:48.887)\r\nI know. Take out the trash. Please change the light bulb. Whoa, whoa, whoa. No, not going to do it. Yeah, no. Right. I'm in the Sunday's Best. Right. Correct. And my bracelet. WWND. What would Nick do?\r\n\r\n\r\nNikolas Hulewsky (07:10.254)\r\nI'm glad you bought that. So that's there's merch. If people want to buy it, what? kidding. OK, here's what I love is like it was already mind blowing when you told me about trade schools, online trade schools was like no, we have a trade school. We do it online and then the government pays us to train these people. It's highly profitable. We don't have to have this massive school infrastructure that most schools have. It's online, blah, blah, blah. So that already blew my mind. But then you start. Then you started telling me.\r\n\r\n\r\nHector Resendez (07:13.123)\r\nYep. Yep. Yep.\r\n\r\n\r\nHector Resendez (07:20.365)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nHector Resendez (07:26.287)\r\nCorrect. Correct.\r\n\r\n\r\nHector Resendez (07:34.115)\r\nYep. Yep.\r\n\r\n\r\nNikolas Hulewsky (07:38.668)\r\nyou've been creative and you've kind of taken that ethos and said, you know what? Why don't we help companies take advantage of these grant programs? They don't have to have a school to do it. They can take advantage of these grant programs. They now have a revenue stream coming in that gives them money to train people. It fixes their pipeline for staffing and it allows them to expand their business. It's like just like a win, win, win all around. So your phone's been ringing off the hook and you've been helping companies do this, right? Like what is it?\r\n\r\n\r\nHector Resendez (07:47.651)\r\nYep.\r\n\r\n\r\nHector Resendez (07:51.139)\r\nYep.\r\n\r\n\r\nHector Resendez (08:07.451)\r\nMan, it's been an amazing ride. mean, we almost spoke probably like a year ago. So this is like our one year anniversary. my God. All right. look it. Sorry, America's Got Talent. Here we come. yeah, let's get back to business. Yeah, so.\r\n\r\n\r\nNikolas Hulewsky (08:16.285)\r\nHector, looks like we made it. Look how far we've\r\n\r\n\r\nHector Resendez (08:30.667)\r\nAt first, you know, I took an exit from that school and I needed to figure out what we're going to do next. And it happened a lot quicker than I thought. At first I was just doing like some, you know, contract work, project work, like helping other schools fix their funnel, like sales training, like they didn't even have cell scripts and how to text people, like just helping them audit that and get that fixed. And then January of this year, I get an email and it's from an Allstate agent, dude.\r\n\r\n\r\nAnd at first I ignored it because he's like, hey, I want to do a school. And I'm like, oh, you can't really do school insurance. I kind of ignored it. He was pretty persistent. He emailed me almost once a week and I would look at it and I'm like, man, I need to stop doing that because I'm not going to respond. And so I kept it unread, unread. And then the second email, he emailed me from a dog grooming email, but the same guy.\r\n\r\n\r\nAnd he has a interesting, uncommon name. So I finally look into it I call him and I'm like, dude, I'm so sorry. The holidays got in the way. What's, what's going on? How could I help you? And he goes into, he goes, listen, me and my wife own a dog grooming business right here in Princeton, Texas. So just a little hole in the wall. 15 actually number one sitting in the U S for some reason, if they're growing, blowing up. But he's like, look, we have three locations and we're a month out like for bookings for dog grooming.\r\n\r\n\r\nNikolas Hulewsky (09:19.072)\r\nMm-hmm.\r\n\r\n\r\nHector Resendez (09:48.119)\r\nI can't find enough technicians because we specialize in doodles like golden doodles, labradoodles, and he's charging 250 a trimmer haircut. I'm just like, that's crazy. So I thought, and I guess he saw a podcaster somehow or some way he found me and he's like, I want to do a dog grooming school. And I'm like, man, that'd be cool. I don't think that would work.\r\n\r\n\r\nYou know, I put my thinking hat on, I go to the state of Texas, I look up like, can the grant pay for this? And lo behold, vet tech, like a vet assistant. It qualifies, it qualifies because it's entry level and I guess there's a need for it. Obviously he's a month booked out. So I'm helping him. I already did. We helped him open up a school where he could train his own technicians, pick from the cream of the crop and keep those and the rest gets certified.\r\n\r\n\r\nThey go find work elsewhere pretty easily and we're able to add about $300,000 in revenue by using the grant. So not only is a grant paying for students to go there, he's teaching them the curriculum. They go take a test, they get certified, but also something a little new that came to mind is...\r\n\r\n\r\nNikolas Hulewsky (10:49.933)\r\nYeah.\r\n\r\n\r\nHector Resendez (10:56.847)\r\nOJT stands for on the job training. If the employer hires somebody that took this WIOA grant, they get paid 50 % of the wages up to the first 90 days or up to 90 days. That way they get to test drive each other. But really the employer gets to half off of their wages. They pick from the cream of the crop and the student, the grad gets something to put on the resume, like an externship almost. And it was just mind blowing to me. And it was a game changer for what I do now and for them.\r\n\r\n\r\nNikolas Hulewsky (11:21.112)\r\nHoly crap.\r\n\r\n\r\nNikolas Hulewsky (11:25.57)\r\nOkay, so let's go through the Vettech model. Is the grant amount the same for any of these or does it vary? like, you're an electrician, here's the amount. You're a Vettech, here's the amount.\r\n\r\n\r\nHector Resendez (11:27.885)\r\nYeah, yeah, yeah.\r\n\r\n\r\nHector Resendez (11:36.503)\r\nIt's whatever you could justify and value. And because he could guarantee him job placement, we're charging pretty much at the top.\r\n\r\n\r\nNikolas Hulewsky (11:42.028)\r\nMm-hmm.\r\n\r\n\r\nIs there a scale or are you telling the government like, nope, this is the amount we're going to charge?\r\n\r\n\r\nHector Resendez (11:49.475)\r\nwe get to tell them this is the amount we want to charge and why.\r\n\r\n\r\nNikolas Hulewsky (11:53.486)\r\nWow, do they audit it? Is it like an application where you're like, OK, hey, we want to charge $8,000 a student and they say, eh, too high? Or is it just?\r\n\r\n\r\nHector Resendez (11:54.563)\r\nYeah.\r\n\r\n\r\nHector Resendez (12:00.495)\r\nYou just have to justify it. Obviously it's a lot of work to become a school and that's why I exist, but to apply through the school and how you apply, how you write your catalog, how you write your curriculum. But these businesses, they don't have to be a school, they're really a business. They just have to dedicate a room or certain hours or certain days to teach.\r\n\r\n\r\nNikolas Hulewsky (12:18.637)\r\nYeah.\r\n\r\n\r\nHector Resendez (12:24.437)\r\nAnd they're already doing that anyway. I mean, they got to train somebody for so many days, but why not now add an additional revenue stream and it's been really profitable for them.\r\n\r\n\r\nNikolas Hulewsky (12:33.122)\r\nWell, there's a guy on Twitter who we just talking about, Chris Hoffman. He owns Hoffman Brothers. I don't remember exactly what they do. I think they do HVAC. I know they do HVAC, but I think they do some other things as well. But they're big. They're like a...\r\n\r\n\r\nHector Resendez (12:36.131)\r\nYeah. Yep.\r\n\r\n\r\nHector Resendez (12:42.499)\r\nYeah. I think, think, think in St. Louis, right?\r\n\r\n\r\nNikolas Hulewsky (12:48.142)\r\nThey're in St. Louis. I want to say they're like hundred million dollar company, right? They're big. What's all three? Okay. So is that what they call them? The big three?\r\n\r\n\r\nHector Resendez (12:52.087)\r\neasy. Yeah, I think they do all three. A-track, plumbing, and electrical. The big three.\r\n\r\n\r\nIt's just what people are starting to do. you're, if you look at vans, they're not just HVAC anymore. They're, dipping into all three.\r\n\r\n\r\nNikolas Hulewsky (13:06.958)\r\nOkay, I mean it makes sense, Like a lot, it's intertwined. Anyways, he opened his own school within the company. But that, is that a school like we're talking about or was it just, he's just funding it himself?\r\n\r\n\r\nHector Resendez (13:09.449)\r\nmean, you're already in the home. Let's sell them more stuff, right? You're already in the home.\r\n\r\n\r\nHector Resendez (13:17.935)\r\nCorrect. Correct.\r\n\r\n\r\nHector Resendez (13:24.735)\r\nHe's just, from my understanding, he's just funding it himself. Love the guy's content. I just think he's leaving a lot of money on the table based on his numbers. He's probably living a million dollars on the table every year.\r\n\r\n\r\nNikolas Hulewsky (13:29.667)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (13:35.982)\r\nYeah, so okay, so if I'm a I'm a company, I'm an electrician, I'm a plumbing company. Anybody who's in the home services business and I have multiple employees, this is probably probably best for a company that's like $2 million in top line revenue and above I'm assuming.\r\n\r\n\r\nHector Resendez (13:53.679)\r\nYou'll be surprised. One of my newest clients, they do quite a bit. mean, this dog grooming business was only doing 500 just because they're so backed up. they just added 300 for the students.\r\n\r\n\r\nNikolas Hulewsky (14:03.598)\r\nOkay. Okay, so maybe the threshold instead is like they have two employees or more or something, working for them as a tech.\r\n\r\n\r\nHector Resendez (14:15.086)\r\nAt least five and they're looking to scale and this is going to help them scale because it's fixing your your staffing problem. I mean even if you do the courses online or with the virtual reality we all know and what we were able to debunk the first time I was on is our bootcamp style classes through the grant just get you the credentials the piece of paper.\r\n\r\n\r\nNikolas Hulewsky (14:17.121)\r\nOkay.\r\n\r\n\r\nHector Resendez (14:35.791)\r\nOnce you go to that employer, they're going to want to train you how they do things their way. They're going to be here. Go shadow Nick for 60 days before you throw your keys to a work truck anyway. So that's what we've been able to do, but it works for anything. It's not just trades. I know we talked about that last time, but like, man, I've been involved with a dental school, with a CNA school, with an IT school. Um, right now, IT sales has been hot and it's always been hot. And it's, you know, a of people want to work remote because with all this return to office mandates, people still want to be remote. I help a school right now.\r\n\r\n\r\nNikolas Hulewsky (14:43.683)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (15:02.988)\r\nYeah.\r\n\r\n\r\nHector Resendez (15:05.744)\r\nyou know, skilled really fast with their IT tech sales course.\r\n\r\n\r\nNikolas Hulewsky (15:09.72)\r\nWell, in many services businesses, healthcare is a services business as well. that's where I come from. The bottleneck is not demand. I mean, yes, we're worried about demand and we'll run paid ads, et cetera, but the bottleneck in my experience for many of these industries are the labor necessary to fulfill the demand. And that's really where you see these companies hit the ceiling. It's not that, my ads aren't converting or my mailers didn't work. It's not usually not that it's usually we don't have enough people.\r\n\r\n\r\nHector Resendez (15:16.367)\r\nMm-hmm.\r\n\r\n\r\nHector Resendez (15:28.399)\r\nCorrect. Correct.\r\n\r\n\r\nHector Resendez (15:37.647)\r\nSo, yep. Yeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (15:39.192)\r\nto meet the demand that's coming at us. The flip side is though, they're thinking, how do I fix this problem? And if I'm a business owner and I'm listening to this, it's like, I don't have time to open a school. Like, how am gonna do that? Can you walk me through like, what does it look like? What are the economics? What are the time commitments?\r\n\r\n\r\nHector Resendez (15:53.807)\r\nSure, yeah. So let's go into it. Let's use my CNA score as an example, right? When I say my, somebody helped us, mine. So I met this guy, profitable, boutique, elder care living, so high-end assisted living out of residential homes in the Austin area. And he charges, I mean, without, I think like 10,000 a bed.\r\n\r\n\r\nNikolas Hulewsky (16:00.856)\r\nYeah.\r\n\r\n\r\nHector Resendez (16:17.241)\r\nYou know, so really, really high end professional chefs. Yeah. I'm a chefs, but because of that, now he needs CNAs 24 hours around the clock. You've been in an industry, you're just talking about it. It's hard for CNAs to stay motivated, stay doing that work because they're not compensated as well, but it's an entry level to like nursing, right? If you will. So what he does with these CNAs. Sure. Yes. Good.\r\n\r\n\r\nNikolas Hulewsky (16:17.538)\r\nYeah, a month.\r\n\r\n\r\nNikolas Hulewsky (16:38.754)\r\nSo just so I'm on and just educated with CNA certified nursing assistant. And so what they're doing is they're doing things like bathing. They're helping with daily tasks. They're not a nurse in the sense that they're going in and like changing wounds or any of those things, but they are, they're kind of the backbone of many facilities. Like they're the ones that do the hard work, getting in and out of bed, changing their diapers, bathing, you know, all of those things, grooming care, those types. So that's what we're talking about here.\r\n\r\n\r\nHector Resendez (16:49.547)\r\nMm-hmm. Nope. Nope. Nope.\r\n\r\n\r\nHector Resendez (17:00.323)\r\nThe dirty. Yup. Yup. Yup. Yup. Yup.\r\n\r\n\r\nYeah, they're almost like a teacher. They have to really love what they do because they're not getting paid for it, right? So.\r\n\r\n\r\nNikolas Hulewsky (17:12.31)\r\nYeah, it's hard work. It's very hard work.\r\n\r\n\r\nHector Resendez (17:16.365)\r\nIt's hard and that makes her break you. Like, are you going want to get into nursing, start off a CNA? You get a front row seat if you want to be in that world, right? So, so this guy, he's like, man, I'm spending 50,000 a year trying, you know, just fixing staffing, like with staffing companies and getting people trained and staffing. And, know, underneath my breath, I'm like, dude, you should start a school. He's like, what do mean? I'm like, well, I mean, let me ask you this, which again was shocking to me. He already has 30 CNAs and only five were certified.\r\n\r\n\r\nNikolas Hulewsky (17:20.756)\r\nMm-hmm. Right.\r\n\r\n\r\nHector Resendez (17:46.89)\r\nSo they're 25 or just doing the role, kind of like a home health provider. You really don't need much, but you do it. And I'm like, man, yes. Yep. Yep.\r\n\r\n\r\nNikolas Hulewsky (17:52.908)\r\nYeah, there are there are actual differences. So you can be a home health aide and there's a CNA. So one is this like you're certified nursing assistant and like an aide is just somebody who they pay 15 bucks an hour to do the real work without being certified. You get paid more if you're certified.\r\n\r\n\r\nHector Resendez (18:07.971)\r\nYes, yes, yes. So he says, you know, he tells me that and I'm like, I quickly do some math and I'm like, let me ask you something just without being so nosy. How many of your CNAs are on food stamps or low income and have kids? And he's like, probably all of them because they make no 16 bucks an hour in Austin, Texas. That's not anything, right? That's minimum wage, I guess you are. So I told him, dude, you're already sitting on.\r\n\r\n\r\nA pipeline, if you certify your own staff 25 times, let's just say Austin pays $7,500 for somebody to go through training. He keeps all that. You find a CNA course, white label it, you slap your new school name on it, CNA Academy, and you get to certify your own staff and get paid a lot of money for it. If he wants to scale from there, which he is, he's going to always find new CNAs, train them, pick from the cream of the crop.\r\n\r\n\r\nand the other ones get certified and go on their way. It doesn't take much time because you're buying a white label course. The course is already done. You're just administrating it. He's going to have one like office manager kind of run the school and they're still going to go through their training. We just help them fix the staffing problem.\r\n\r\n\r\nNikolas Hulewsky (19:09.55)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (19:19.47)\r\nSo $7,500 per student. what do you, again, what are you expected to do that? If I'm the employer, I've got to offer obviously the curriculum, but where else does that money go to providing? Do they get a laptop? Do they get?\r\n\r\n\r\nHector Resendez (19:22.649)\r\nFirst student.\r\n\r\n\r\nHector Resendez (19:33.785)\r\nSure, they could do whatever they want. What's really cool with his is they do the course online, they come in and they spend a month training, which he's also going to apply to be an OGT, on the job training provider. So he's going to get half of his wages reimbursed and he's going to be able to pick from the cream of the crop. But let's just say that course only costs 500 bucks.\r\n\r\n\r\nNikolas Hulewsky (19:44.91)\r\nMm-hmm.\r\n\r\n\r\nHector Resendez (19:54.031)\r\nThis is profit. But what's cool with him is he actually has a career growth program. He starts them off at 16. After 30 days, they made their training. He moves them up to 18. After six months, another review, he moves them up to 20. And then the real career progression there is as he scales, they're going to be house managers after a year or two or two years. And those house managers make between 60 and 70. So it could be life changing for somebody.\r\n\r\n\r\nNikolas Hulewsky (20:21.752)\r\nCan you, I don't know the answer to this, and if you don't know, that's fine too. Could you pay, like let's say he has those CNAs and they wanna be, or those AIDS and they wanna become CNAs, could you pay them a bonus once they become a CNA? Like could you, does that make sense what I'm saying?\r\n\r\n\r\nHector Resendez (20:36.911)\r\nWhy not? mean, he's making $7,500, right? The least he could do is give him a bonus. He's going to give him the laptops. Yeah. Yeah, yeah. Yeah, because what happens is you also don't want to interrupt their job. I they still got to work for him, right? But the cool thing with online courses, you get to do it on your own time.\r\n\r\n\r\nNikolas Hulewsky (20:41.528)\r\nWell, just incentivize. Yeah.\r\n\r\n\r\nNikolas Hulewsky (20:49.868)\r\nWell, not a-\r\n\r\n\r\nAnd not only that, like I don't want them leaving in six months, right? Like I just spent the time and energy to invest in them, to train them up. And now they've now they're a CNA. Well, now that you're CNA, like there are other options open to you. Right. So like I would want to see them stay. And that's where I think of like a retention bonus or maybe a bump in pay or whatever it is.\r\n\r\n\r\nHector Resendez (20:55.767)\r\nRight, Yep. Yep.\r\n\r\n\r\nHector Resendez (21:08.196)\r\nYep.\r\n\r\n\r\nNot only that, he's going to use that for future training. Like now let me pay you to become a phlebotomist and let me pay you to learn, you know, insurance, medical billing and coding or whatever. There's no, there's there's a lot of legs here and it's going to be fun.\r\n\r\n\r\nNikolas Hulewsky (21:23.83)\r\nAnd so to those, I know we're just talking about this specific scenario, but this will apply to any tech. For the aid who decides to become a CNA and go through the program, 7,500 from the government, are they paying anything? Okay.\r\n\r\n\r\nHector Resendez (21:27.055)\r\nSure.\r\n\r\n\r\nHector Resendez (21:35.403)\r\nMm-hmm. No. No, no, no. As long as they qualify, right? Because remember, you still have to Google WIOA. Most CNAs are going to fit this bill because they make about $14 to $16 an hour. And as long as they're on food stamps, Medicaid, TANF, some kind of life-bearing, which you're in that world, so you know a lot of them still are.\r\n\r\n\r\nNikolas Hulewsky (21:51.15)\r\nthat's right.\r\n\r\n\r\nOkay, so that's right. Tell me the qualifications again. How do you qualify for it? You have to be low income.\r\n\r\n\r\nHector Resendez (22:03.391)\r\nLow-income US citizen, transitional housing on SNAP, TANF, Medicaid, WIC, some kind of life here, some kind of government assistance.\r\n\r\n\r\nNikolas Hulewsky (22:11.5)\r\nAnd do they have to be on all of those or is there like a combination of those that they have to meet? Okay.\r\n\r\n\r\nHector Resendez (22:15.215)\r\nJust one, just one, just one of those. Cause you gotta remember the purpose, the purpose behind this grant is to teach you a new skillset, earn more money.\r\n\r\n\r\nSo you don't have to rely on government benefits and earn a decent wage and get into a career progression. So if it's CNA, in hopes, his career progression is he wants to turn a CNA into a medical assistant. So it's just another step up. And eventually maybe get into nursing or whatnot. I don't know what you can and can't do in adult and elder care. I know he says that.\r\n\r\n\r\nthat he still has some kind of other services come in to perform certain duties. But yeah, this to your point, this applies to anything, to welding, to dental assisting, to medical front desk is such a turnover role and everyone's always looking for it. You're the first person they see.\r\n\r\n\r\nNikolas Hulewsky (23:01.112)\r\nWell, dude, mean, yeah, you were just telling me, so there's a list of like qualified techs for this, but then there's also some creativity that can be involved. For example, I think you were talking to me about a dentist where you're like, yeah, they're looking at using this for their front desk person, but that's not typically where a dentist would look, right?\r\n\r\n\r\nHector Resendez (23:08.057)\r\nYes, yes.\r\n\r\n\r\nHector Resendez (23:15.609)\r\nYep.\r\n\r\n\r\nHector Resendez (23:19.331)\r\nYes.\r\n\r\n\r\nHector Resendez (23:22.893)\r\nNo, no, most dentists you think because you see everyone advertising dental assisting school. We have enough of those. This dentist, his real pain point was, you know, it's my front desk position.\r\n\r\n\r\nHow can I train them to use open dental, the most common CRM? How can I teach them to use AI for insurance and billing and coding? How do I teach them how to do, you know, soft skills? How to deescalate a client that's mad that their insurance doesn't work. And that's a real need right now, but not just for dentists. You could do this course for dermatology, medical front desk, GI doctors, just about any practice. That role is really important and it's such a high turnover rate. So why not get paid by the government to fix it?\r\n\r\n\r\nNikolas Hulewsky (23:39.309)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (23:46.542)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (24:04.342)\r\nIs the grant state specific or is this a federal grant?\r\n\r\n\r\nHector Resendez (24:07.671)\r\nIt's federal, it's in your backyard. It's in Meridian, Idaho. Shout out.\r\n\r\n\r\nNikolas Hulewsky (24:10.357)\r\nOkay, so there's no.\r\n\r\n\r\nDoes the ability you can charge change depending on where you are?\r\n\r\n\r\nHector Resendez (24:17.005)\r\nYes, yes. unfortunately the grants the same, but every state has their own requirements inside every state are broken up in regions and every region will only pay for certain courses, certain fields. Like if you go to Galveston, Texas, it's going to be more coastal like underground.\r\n\r\n\r\nNikolas Hulewsky (24:26.488)\r\nOkay.\r\n\r\n\r\nHector Resendez (24:36.131)\r\nwelding, boat technician, like stuff like that, right? If you go to rural Texas, you're gonna see like wind turbines, solar, oil rig, drivers, like stuff like that. So it's rural. Yes. Yes. Yeah.\r\n\r\n\r\nNikolas Hulewsky (24:37.752)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (24:46.178)\r\nAnd is it county specific? Like you'd need to look at the rules in your county. Okay, so it's like Medicaid dollars in the sense that Medicaid is federally apportioned. So it's like, okay, whatever the state is, these are your Medicaid dollars, but the state can decide how those dollars are spent, if that makes sense.\r\n\r\n\r\nHector Resendez (24:57.519)\r\nOkay.\r\n\r\n\r\nHector Resendez (25:06.287)\r\nDude, identical. Texas is so populated that I think Texas is one of the biggest states that gets the most pool. they also track on how you use it. To be a school, there's still certain metrics you got to hit. You got to make sure you have a 70 % completion rate, a 70 % graduation rate, and then a 70 % people get a job in the actual field. Not like college, where you get a degree and never use it. Which, who knows what that percentage rate is? Probably high. Yeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (25:07.853)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (25:13.187)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (25:33.528)\r\nHi, very hi. So if I'm, let's say I'm in Idaho, I'm in the county, what's usually the first step? Do you go and meet with, like, is there a person assigned to administering these programs that you wanna go and build a relationship with first?\r\n\r\n\r\nHector Resendez (25:40.067)\r\nYep. Yep.\r\n\r\n\r\nHector Resendez (25:48.847)\r\nThere is, but you'll be surprised that nothing's in person anymore. It's all through behind a computer screen when it comes to applying. if whoever's watching this, it should be like, hey, are you a business owner? Are you struggling with staffing? And do you want a cool way to...\r\n\r\n\r\nNikolas Hulewsky (25:56.269)\r\nMm-hmm.\r\n\r\n\r\nHector Resendez (26:06.895)\r\ndrive additional revenue and fix your staffing. However, there are some states that are tough, like Florida, you have to wait two years to even get access to the grant. So I'm sorry, Florida, it's a pain in the butt. Texas, Arizona, Montana, Arkansas, it's a no waiting state. So as soon as you apply, after you go through the process, you're approved. Where places like Tennessee, they review schools twice a year. So you have to wait for that period or that little window to apply. So just it's.\r\n\r\n\r\nNikolas Hulewsky (26:17.677)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (26:33.686)\r\nWhere would I go and even read up around this? it like tradeschools.org slash Idaho?\r\n\r\n\r\nHector Resendez (26:37.647)\r\nI there's no such thing. No, there's no such thing. For those that are really interested and want to go down that rabbit hole, I guarantee AI, as good as it is, won't take you there. Because it's really not, how do I say it? It's not as accurate as you would think it is. But just Google ETPL, and that means Eligible Training Provider List, or Google Eligible Training Provider\r\n\r\n\r\nIdaho eligible training provider, Kansas, because an eligible training provider is a school. You're providing a training that's in demand. And those demands can change yearly, they honestly do, so.\r\n\r\n\r\nNikolas Hulewsky (27:20.246)\r\nAnd where would you go to like figure out how do I become an eligible training provider?\r\n\r\n\r\nHector Resendez (27:24.943)\r\nYou're going to have to Google it or state by state or get in line and talk to me. Yeah. Man, what's funny is, you know, I still don't have a website to this day. People always like what? No website. I have a Gmail account, a Google doc and a Stripe account and we're cooking.\r\n\r\n\r\nNikolas Hulewsky (27:27.009)\r\nState by state.\r\n\r\n\r\nor Hector at OnlineTrainingSchools.org.\r\n\r\n\r\nNikolas Hulewsky (27:39.088)\r\ncome on.\r\n\r\n\r\nNikolas Hulewsky (27:46.232)\r\nSo wait, how do people get a hold of you then? Carrier pigeon?\r\n\r\n\r\nHector Resendez (27:49.854)\r\nUh, sometimes. I have an old Nextel phone that I use every now and then as a walkie talkie. Yeah, yeah, yep, yep. My MySpace is still active, so I do a lot there. But no, they find me out. No, they find me on Twitter.\r\n\r\n\r\nNikolas Hulewsky (27:59.15)\r\nStill active? No, seriously, what is your email?\r\n\r\n\r\nNikolas Hulewsky (28:05.676)\r\nWell, okay, well, if I'm not on Twitter, how do I find you?\r\n\r\n\r\nHector Resendez (28:08.419)\r\nThey could email me. You want me to say my email here? All right. No. OK. Maybe. OK. It's rescindance, just like it says on the bottom of screen, at LLC at gmail.com. That's it.\r\n\r\n\r\nNikolas Hulewsky (28:10.06)\r\nWell, tell us your email. Do I have to pull your teeth to get your email? I'm not trying to throw you business here and you're like, I don't know.\r\n\r\n\r\nNikolas Hulewsky (28:24.418)\r\nResendez LLC at gmail.com. That's a good email, man.\r\n\r\n\r\nHector Resendez (28:26.487)\r\nYep, just at Gmail, just a Gmail. That's my professional email.\r\n\r\n\r\nNikolas Hulewsky (28:33.888)\r\nSo if a business owner is looking basically like your new business that you're that you've kind of pulled into, you've tripped into, so to speak, is helping businesses navigate this, right? Because there is a lot of complexity to like, who do I talk to in my state? How do I set the prices? How do I create the curriculum? What's the what's the credentialing process? All that stuff. You're kind of doing the consulting piece to help them actually get credentialed.\r\n\r\n\r\nHector Resendez (28:38.253)\r\nMm-hmm. Yeah. Yep. Yep.\r\n\r\n\r\nHector Resendez (28:47.311)\r\nRight, right, right, right.\r\n\r\n\r\nHector Resendez (28:55.567)\r\nCorrect. If it makes sense, if it makes sense, because again, there's some states that really tough. If you're going to want to be in the trades and you're trying to do anything in the East Coast, expect it to be tough. You're against unions over there. So it's just a different battle over there. What does really well is IT or healthcare, not actual trades that are unionized. So it just depends case by case.\r\n\r\n\r\nNikolas Hulewsky (29:06.956)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (29:16.16)\r\nIs there, so like your trade school that you had was doing $3 million a year top line and like what, a million dollars a year in profit?\r\n\r\n\r\nHector Resendez (29:24.687)\r\nYeah, after overhead everything probably it's like 80 % margins. Yes. Total.\r\n\r\n\r\nNikolas Hulewsky (29:27.126)\r\ns- s- something ridiculous. How many students did you have?\r\n\r\n\r\nA year, yeah, yeah, to get to $3 million.\r\n\r\n\r\nHector Resendez (29:35.951)\r\nAbout 30 a month.\r\n\r\n\r\nNikolas Hulewsky (29:38.062)\r\n30 month, oh man, that's less than 400? That does not seem crazy.\r\n\r\n\r\nHector Resendez (29:44.559)\r\nIt's not crazy. It's not crazy.\r\n\r\n\r\nNikolas Hulewsky (29:46.254)\r\nYou could add this as a legitimate business stream, revenue stream to any business.\r\n\r\n\r\nHector Resendez (29:50.787)\r\nYeah, it's been fun. It's also been fun helping other schools get fixed. For example, there's some school numbers that call me and I guess I call it an audit, you know, and I ask them for basic stuff like, send me your cell script, send me your cadence. Like what text do you send out when this happens? What's the first text you sent out? What's your email sequence?\r\n\r\n\r\nNikolas Hulewsky (29:56.814)\r\nMm.\r\n\r\n\r\nHector Resendez (30:12.623)\r\nA lot of these schools don't even have those simple processes in mind. They're not using CRM. So it's easy to fix them because how do you operate? mean, a school is still a school is still a cell. Like you got to come in some of the phone to sign up for your school and you'll be surprised. You know, a lot of trade school owners are trades people themselves and they got stuck working in the business that have on it and they're the instructor, they're the owner, they're trying to do everything. The wife's kind of pitching in and they never scale. So I'm happy to help those as well.\r\n\r\n\r\nNikolas Hulewsky (30:20.088)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (30:23.884)\r\nhuh.\r\n\r\n\r\nNikolas Hulewsky (30:34.156)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (30:41.506)\r\nWhat do you do if you're let's say you're a small business owner and you have locations in four different counties? Do you train?\r\n\r\n\r\nHector Resendez (30:48.213)\r\nIt's well once... Go ahead.\r\n\r\n\r\nNikolas Hulewsky (30:51.406)\r\nI was just going say, you train everybody in one county and then they're all certified and you get the grant? Or do you have to have a school in each one of those counties and be credentialed in each county to get the grant?\r\n\r\n\r\nHector Resendez (31:01.751)\r\nNo, I mean, the goal is to do it all online, right? So you have a bigger reach and then you train them based on where they live. So if they live towards that county, you do it through that county. But.\r\n\r\n\r\nNikolas Hulewsky (31:06.766)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (31:14.04)\r\nCan you do out of state? Like could I have a school in Idaho and train someone in Texas?\r\n\r\n\r\nHector Resendez (31:18.253)\r\nYou... No. You're only licensed to do business in your home state?\r\n\r\n\r\nNikolas Hulewsky (31:21.568)\r\nNo, okay, so has to be in the state.\r\n\r\n\r\nHector Resendez (31:26.787)\r\nNow there's ways around it, but just to keep this professional and clean, you do have to be licensed in your home state. Now after two or three years, if you want to get accredited, which means you go from a .com to .edu, you do get access across state lines and you get access to about 34, 36 states now with that accreditation. But then everything changes because when you become accredited, your courses now have to be $900. And now you're competing with everyone else semester based schools. What's cool about doing it online is you can start classes every week.\r\n\r\n\r\nNikolas Hulewsky (31:39.246)\r\nMm-hmm.\r\n\r\n\r\nHector Resendez (31:56.673)\r\nand your classes are about 100 to 150 hours. So no one's waiting, there's no delays. I mean, you could literally take a course and wear a new uniform three months from now.\r\n\r\n\r\nNikolas Hulewsky (32:06.51)\r\nSo if I'm let's say that I'm in I'll use Idaho as an example. I live in Ada County and there's somebody who's in Canyon County and they want to get. I have a service location out there and I want to train them. Can I train them in Ada County and have them work in Canyon County and get do I get paid by 80 County? How does that work?\r\n\r\n\r\nHector Resendez (32:21.081)\r\nSure.\r\n\r\n\r\nYeah. As long as it's in the same state, so it just depends. Usually you get paid by the county they reside in. So they go through, I don't know what it's called, yeah, like if I'm here, you know, if I'm here in Collin County, I have to go to the Collin County Workforce Office if I want training dollars. But it doesn't stop me from getting a job working in Dallas. It's another county, but yeah.\r\n\r\n\r\nNikolas Hulewsky (32:32.875)\r\nOkay.\r\n\r\n\r\nThat makes sense.\r\n\r\n\r\nNikolas Hulewsky (32:42.318)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (32:47.47)\r\nSo I get accredited by the state, but I get paid by each county.\r\n\r\n\r\nHector Resendez (32:52.515)\r\nYes, yes, to make it simple,\r\n\r\n\r\nNikolas Hulewsky (32:53.358)\r\nAnd each county has criteria for which trades effectively that they will pay for.\r\n\r\n\r\nHector Resendez (32:57.775)\r\nYep. Yes. Like they have a thing called target occupation list. Like these fields will pay for it they're in demand and more likely you're going to get hired in this position because we need to, we need to, we can't meet that demand. Yeah.\r\n\r\n\r\nNikolas Hulewsky (33:12.332)\r\nYeah. Is the billing and collection a nightmare? Like, are you billing, you know, 20 different counties and getting paid by different counties or like?\r\n\r\n\r\nHector Resendez (33:19.777)\r\nIt was when we first were doing it, but we got it down to a science. It can be, but I mean, with AI now, like a lot of stuff could be automated. know, AI could be our best friend when it comes to trade schools if you use it properly.\r\n\r\n\r\nNikolas Hulewsky (33:33.004)\r\nWhat does the payment look like? Like are you paid everything upfront? Are you paid in installments?\r\n\r\n\r\nHector Resendez (33:38.051)\r\ndepends on the county. Some counties pay you, let's call it 10 grand upfront. And then some counties will do half upfront and half when they complete the It just depends.\r\n\r\n\r\nNikolas Hulewsky (33:48.11)\r\nand how quick is the turnaround? Let's say I send a bill to the county. Typically, how long does it take before I get paid?\r\n\r\n\r\nHector Resendez (33:55.33)\r\nNet 30.\r\n\r\n\r\nNikolas Hulewsky (33:57.127)\r\nthis is really fast.\r\n\r\n\r\nHector Resendez (33:58.56)\r\nReal fast, yeah.\r\n\r\n\r\nNikolas Hulewsky (34:00.524)\r\nWow, that's amazing. But typically you're not doing the full program and then getting paid. You're getting paid something along the way. Okay.\r\n\r\n\r\nHector Resendez (34:01.613)\r\nI know. I know.\r\n\r\n\r\nHector Resendez (34:07.791)\r\nYes, always, always. It's probably 60%. Now this is Texas, right? I don't know other states that well. In Texas, about 60 % of the counties pay upfront. The other 40 % pay half upfront and half when they complete it.\r\n\r\n\r\nNikolas Hulewsky (34:18.798)\r\nMm-hmm. Sure. All right. Here's the last question. If I'm a business owner, how do I know that I'm a perfect profile for doing this school model where I can get an extra revenue stream, I'm creating a pipeline, and I'm also helping my employees advance? How do I know that I'm in the right spot to be able to take advantage of it?\r\n\r\n\r\nHector Resendez (34:24.303)\r\nSure.\r\n\r\n\r\nHector Resendez (34:40.355)\r\nYeah.\r\n\r\n\r\nThat's the rolling the dice, we don't know. I know Texas really well, I know Arizona really well, I know for some reason, Montana, Missouri, Kansas. I know some states really well, but some states, it just doesn't make sense. Like if you call me, if you're in Florida, I'm sorry, but it's gonna take two years to create a school, so is it worth it? It could be, maybe down the line, but just know it's gonna take that long to get access to this funding. Yep. Yep.\r\n\r\n\r\nNikolas Hulewsky (35:04.214)\r\nOkay, well, let's say I'm in a state that's a good state, right? I'm in Texas. Is there a, I think you said five employees. If you five employees or more, that's kind of a threshold. Are there any other thresholds that you would look at and say like, yeah, you should probably be in these types of services?\r\n\r\n\r\nHector Resendez (35:19.587)\r\nWell, you want to the services as long as you could justify there's a need you'll be surprised. I took on a client that has a telematics company. I was going to be honest. I didn't know what telematics was. I'm like, yeah, probably not going to work. Then I took the call with him. He's like, no, man. They just need to learn basic.\r\n\r\n\r\nelectrical knowledge because we're installing technology and GPS to fleets of vehicles and I can't find those technicians fast enough and I have loads of contract work and this guy's in the middle of nowhere in Texas like like Midland Odessa oil country and I'm like you could definitely start a school for that like so and we did you know so it just it just depends it can't it can't be so niche but then you'll be surprised I helped a dog groomer out so it just\r\n\r\n\r\nNikolas Hulewsky (35:44.408)\r\nHmm.\r\n\r\n\r\nHector Resendez (36:04.527)\r\nIt'll take some work on their end, but man, they have at least five employees and they're looking to scale up, even if they're not keeping them, what a cool thing to do to have somebody train, have them train with you as an externship for 30 days. Maybe keep them if you love them. If not, they get certified and they'll find work elsewhere.\r\n\r\n\r\nNikolas Hulewsky (36:20.162)\r\nWell, full circle, what's crazy about this is this is not like a government money grab or kickback. They wouldn't be paying this unless there was real value here. And the value is we have a shortage of these types of technicians. We just talked about it in the beginning. Huge.\r\n\r\n\r\nHector Resendez (36:30.735)\r\nRight.\r\n\r\n\r\nBig time in healthcare. Not just in trade, but actually healthcare, man. I the most talked about courses are CNA, CDL, roofing is one of them, even though I don't know how you would do that. But it's just some really random low entry and the minimum wage in those fields are actually going up because they want to keep people because it's such a turnover rate.\r\n\r\n\r\nNikolas Hulewsky (36:44.983)\r\nMm-hmm.\r\n\r\n\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (36:57.678)\r\nRight, right. Yeah, it's insane. I mean, there's a real need, there's a real shortage. We say trades, but these technical, right, these technician level roles. Right.\r\n\r\n\r\nHector Resendez (37:06.359)\r\nYeah, dude, IT is a trade. IT is in there. IT is a big, and IT is almost on demand anywhere. Can you believe it? IT sales course, it's working remote, working from home in sales in IT, even though it's not technical, like cybersecurity, but it's just an IT role, sells, and that's one of the most popular courses right now.\r\n\r\n\r\nNikolas Hulewsky (37:14.977)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (37:28.11)\r\nWell, the one thing I didn't realize the last time, I don't know if we talked about it, was like the on the job training for the first 90 days, they'll pay half.\r\n\r\n\r\nHector Resendez (37:32.739)\r\nYeah.\r\n\r\n\r\nIf the employer registers with that workforce to say, hey, I want to do on the job training and hires a graduate, even if they went to their school or not, but just hire a graduate that went through this grant, you'll get up to 50 % of your wages paid for up to 90 days. I think that's a game changer alone. Yep. Yep. Yeah. For sure. Yes, sir. Yes. That's right. Sunday's best.\r\n\r\n\r\nNikolas Hulewsky (37:49.39)\r\nIt's Yeah, it's insane. It's freaking incredible. All right, Hector, this was awesome. We kept it short. We kept it freaking action packed. You wore your tuxedo shirt again. This is amazing. Can't wait to talk to you next year when you're doing $10 million a year and own 17 schools. Just kidding.\r\n\r\n\r\nHector Resendez (38:03.576)\r\nYep.\r\n\r\n\r\nHector Resendez (38:07.381)\r\nI I hope you're not kidding. I would love that. All right, go for\r\n\r\n\r\nNikolas Hulewsky (38:10.416)\r\nAll right, man. We'll talk soon.",
  "metadata": {
    "duration": "",
    "date": "2025-07-16",
    "platform_source": "Google Drive"
  }
}