{
  "episode_number": "154",
  "episode_title": "Which AI Tools Are Worth Your Time? Use Cases and Future Potential with Chris Koener",
  "guest_name": "Chris Koener",
  "business_name": "",
  "transcript": "﻿Nikolas Hulewsky (45:34.915)\r\nYou ready?\r\n\r\n\r\nChris Koerner (45:35.93)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (45:37.688)\r\nSo over the last two weeks, I've talked to 30 entrepreneurs who are using AI in their business because I feel like you and I have talked about this. There's a ton of good ideas, not a lot of good execution. then, and like Replet, how many things have you made on Replet that you haven't actually finished? Yeah, there's lots of things. So it's like, this is cool. I can build an app. This is great. And then you get to the final point and you're like, how do I actually complete it? It's like that last, that's that last 10%.\r\n\r\n\r\nChris Koerner (45:54.875)\r\n7.\r\n\r\n\r\nChris Koerner (46:03.407)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (46:05.984)\r\nSo I've been having conversations with people and it's been awesome. I've learned so much. like it. My brain hurts every single day because I'm learning so much, but there are some really cool insights that I've gotten out of this. So I'm going to share some of my findings with you because I had chat tpt take all my findings and put them into summary for me. Question number one, Chris, what do you think is the most popular LLM?\r\n\r\n\r\npeople to use as their primary LLM.\r\n\r\n\r\nChris Koerner (46:37.819)\r\nSee you guys in next\r\n\r\n\r\nNikolas Hulewsky (46:39.202)\r\nIt is. And what do you think is the most popular use case?\r\n\r\n\r\nChris Koerner (46:43.973)\r\nlike what types of prompts?\r\n\r\n\r\nNikolas Hulewsky (46:47.17)\r\nLike what are they using ChatGPT for?\r\n\r\n\r\nChris Koerner (46:49.339)\r\nwriting emails, like rewording emails.\r\n\r\n\r\nNikolas Hulewsky (46:54.058)\r\nmainly they're using it as a thought partner. So it could be rewriting emails. Not generally, not that it's usually like, Hey, this is, have an idea for this. How would I do X, Y, and Z thing? And it's like, just to get them started, which was, which was fascinating to me. the second most LLM second most used LLM. What do think it is? No.\r\n\r\n\r\nChris Koerner (46:57.872)\r\nHmm.\r\n\r\n\r\nChris Koerner (47:13.531)\r\nGermany.\r\n\r\n\r\nThe grok.\r\n\r\n\r\nperplexity, Claude.\r\n\r\n\r\nNikolas Hulewsky (47:22.114)\r\nNope. Claude Claude. And the surprising thing about Claude is it's actually used more in aggregate because I asked them two questions. Like what's the primary, like what's your primary favorite and then what are the other LLMs you use? And I mapped it all out. Claude is actually used more by more people than chat GPT is, but chat GPT is the most preferred. If that makes sense. Okay. what do you think that they're using Claude for?\r\n\r\n\r\nChris Koerner (47:40.539)\r\nHmm.\r\n\r\n\r\nChris Koerner (47:45.733)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (47:52.345)\r\nI have no idea. That's like the only one I really hardly ever use.\r\n\r\n\r\nNikolas Hulewsky (47:54.158)\r\nOkay. Okay. So I have it broken down in three tiers, non-technical, technical, intermediate, and then expert. All right. For chat GPT, the majority of the distribution is in the non-technical and intermediate. For quad, the majority of the distribution is an expert and intermediate. And the main use case that I see people use it for is coding. They're like, it's the best.\r\n\r\n\r\nChris Koerner (48:21.593)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (48:23.692)\r\ncoding tool, like to help them actually write code. And then the second best thing, this one blew my mind. It's organization structure is fantastic. So you know how chat jbt has projects Claude, you can set up projects, but you have two fields. One is what is this project about? And so you can write a prompt to say like, this is my content project. And then it has files that you can upload for context. And so anytime\r\n\r\n\r\nChris Koerner (48:36.219)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (48:44.123)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (48:51.109)\r\nHow's that different from chat GPT?\r\n\r\n\r\nNikolas Hulewsky (48:53.518)\r\nUm, from what I've seen, chat GPT doesn't have the same functionality with the uploading of files and the reference for each one of the threads. Maybe I'm just not using chat GPT to its fullest. So you do, you upload individual files.\r\n\r\n\r\nChris Koerner (49:04.377)\r\nThat's how I use it. It's like instructions. They call it files and instructions.\r\n\r\n\r\nNikolas Hulewsky (49:10.754)\r\nAnd so you use individual files for each one of your projects.\r\n\r\n\r\nChris Koerner (49:12.154)\r\nCough\r\n\r\n\r\nChris Koerner (49:16.283)\r\nyeah, I don't always use files, but it can. Yeah.\r\n\r\n\r\nNikolas Hulewsky (49:20.342)\r\nOkay. one of the people I spoke to, she's a writer and she's like, Claude does a much better, it's a, it's a much better writer apparently. and she has this whole setup where it's like, this is my brand voice here, recent projects that I've done. And so she's like constantly changing the context so that it's up to date. but the interesting thing is I didn't know this. You can only upload however big the context window is.\r\n\r\n\r\nChris Koerner (49:40.528)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (49:50.606)\r\nDoes that make sense what I'm Yeah, so that was interesting. What was the least mentioned tool?\r\n\r\n\r\nChris Koerner (49:51.043)\r\nOkay. Yeah. Yeah.\r\n\r\n\r\nChris Koerner (50:03.719)\r\nwell, I would say Grok, but I think that a lot of these calls came from people on Twitter. So maybe Gemini.\r\n\r\n\r\nNikolas Hulewsky (50:13.582)\r\nGemini. Yeah, it was the least mentioned and everybody like dogged on it. They're like, Gemini, not good. So that was just really interesting to me. The... God.\r\n\r\n\r\nChris Koerner (50:21.659)\r\nThat's interesting. Are they dogging on it because they're they've actually given it a fair shake and they don't like it or they're just it kind of has that brand around it because I dog on it but I don't really use it so it could be great.\r\n\r\n\r\nNikolas Hulewsky (50:35.16)\r\nThey're dogging on it, not that it sucks. They're dogging on it because it's not as good as what else they use, if that makes sense. They're like the Claude model, ChatGPT. And I think ChatGPT just has a head start because so many people were using it. But the two use cases that I found out about Gemini are, if you're trying to create workflows within the Google suite, Gemini is the best because it just knows Google so well. So I thought that was really interesting.\r\n\r\n\r\nChris Koerner (50:48.784)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (51:03.193)\r\nMake sense?\r\n\r\n\r\nNikolas Hulewsky (51:05.482)\r\nAnd then the second thing that I thought was really interesting is the context window. I didn't realize this, but do know how big the context window is for Gemini?\r\n\r\n\r\nChris Koerner (51:12.731)\r\nI looked this up a while ago, but I can't remember. think Claude was the biggest that I saw.\r\n\r\n\r\nNikolas Hulewsky (51:15.31)\r\nOkay. So, so chat GPT, let's back up the context window is essentially how much information you can give the model for context of a specific question that you're asking it for chat GPT, it's 120,000 tokens. And what that is, is that it's like a 300 page book. Okay. For Claude, it's 200,000 tokens. So it's a lot bigger than chat GPT for Gemini. It's a million. Yeah. So it's a much larger context window. I thought that was just.\r\n\r\n\r\nreally, really interesting.\r\n\r\n\r\nOkay, next finding. What do you think was the most used tool that interfaced with the LLMs that they worked with?\r\n\r\n\r\nChris Koerner (51:59.195)\r\nLike feature of the specific LLM.\r\n\r\n\r\nNikolas Hulewsky (52:02.402)\r\nHmm. No, let me ask it a different way. What do you think is the most used? AI tool that was not an LLM.\r\n\r\n\r\nChris Koerner (52:11.227)\r\nMm.\r\n\r\n\r\nsomething that I would have heard of? I don't know idea. Okay, okay.\r\n\r\n\r\nNikolas Hulewsky (52:16.098)\r\nYeah. Cursor. Cursor. And from several of them that like multiple people said, I think Cursor is going to be bigger than Google. They were like so, yeah, they were just like so in love with what Cursor can do. I did. I I talked to a couple of coders. It blew my mind though, like on the call with them, they were on Cursor and they were showing me you can natural language prompt into building an actual website.\r\n\r\n\r\nChris Koerner (52:25.807)\r\nWhat? You must have talked to some coders then.\r\n\r\n\r\nChris Koerner (52:42.394)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (52:44.192)\r\nAll of them who had like actual coding knowledge crapped on Replet, which was really interesting to me. They're like, Replet. But I'm like, in order to use cursor, you actually kind of have to have some coding experience. Like you can still, you can use it using natural language, but it would help if you had coding experience.\r\n\r\n\r\nChris Koerner (52:48.432)\r\nYeah.\r\n\r\n\r\nChris Koerner (52:51.835)\r\nWell, yeah.\r\n\r\n\r\nChris Koerner (52:59.77)\r\nYeah.\r\n\r\n\r\nChris Koerner (53:04.389)\r\nWell, here's my push pull framework for for this Friday. Okay.\r\n\r\n\r\nUsability and functionality. That's the push pull of today. Replet is more usable to more people. It's more functional. it's, sorry, I guess I should say Replet is more approachable to more people, but it's less functional as like a coding assistant. Whereas cursor is harder to use for more people, but it's a more functional coding assistant.\r\n\r\n\r\nNikolas Hulewsky (53:39.458)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (53:39.733)\r\nAnd the magic happens like the unicorn status happens when you have like an Airbnb with beautiful design, beautiful user interface, like easy for anyone on the planet to use yet. So freaking functional. just works. Everything just works. And it looks simple. Like from the outside looking in, you assume that it's very simply built, but on the backend, it is just a hairy mess of complexity. And it's just really good engineering and design, right?\r\n\r\n\r\nSo, most companies, 99 % of companies have one or the other. They have good UI or they have good functionality, not both.\r\n\r\n\r\nNikolas Hulewsky (54:18.502)\r\nOkay, so I'm going to go through generally broadly speaking. This is what I found to be the use cases chat GPT as a general thought partner, like some of their collaborating with and like trying to figure out ideas. Claude coding in particular. It's like that's their coding partner perplexity research. Everyone I spoke to who actually uses these models. They're like, it's as good as deep research and it's real time. So it can go and crawl the web.\r\n\r\n\r\nChris Koerner (54:34.181)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (54:39.034)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (54:46.17)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (54:46.528)\r\nin real time, which again was fascinating in and of itself. GROK, there was no like best use case, but it just seemed like generally speaking, everybody was impressed with GROK. The speed and responsiveness, I don't know if you've messed with GROK, like it spits answers out very quickly. They're very good, has access to real time data. Everybody's like, it's amazing what they've built a top tier model in such a short period of time. And then Gemini.\r\n\r\n\r\nChris Koerner (54:59.439)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (55:15.702)\r\nis just, it's really good for the Google Suite. So those were the general use cases that I'm seeing people actually use it. And I thought those things were fascinating.\r\n\r\n\r\nChris Koerner (55:26.469)\r\nCan I give you my personal takeaways from what you just said? I needed the thinking of using Gemini more since I'm so embedded in the Google workspace, right? I just don't think of it. We've talked about Notebook LM a bunch. I like the context window size. I just don't like what it spits out. I don't like what it gives me, right? So who cares how big the context window is if it's not working with it well in my opinion. I'm using perplexity more and more every day.\r\n\r\n\r\nNikolas Hulewsky (55:35.97)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (55:55.959)\r\nI don't as of today, I don't see a need to keep my $200 a month pro subscription because perplexity does deep research, which is the only thing I'm using pro for now. I still like a second layer of redundancy. I still take my prompts, my deep research prompts, and I put them in deep research and perplexity at the same time, because it does give me different answers. And I S I still kind of like deep research a little better. I think it's more thorough.\r\n\r\n\r\nNikolas Hulewsky (56:00.834)\r\nSee you\r\n\r\n\r\nNikolas Hulewsky (56:17.56)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (56:24.077)\r\nIt gives me a longer answer with good relevant info. I need to use cursor more. What's that? I, I've barely even tested it. I can't really speak to it.\r\n\r\n\r\nNikolas Hulewsky (56:28.174)\r\nHave you tried Grok's deep research? Have you?\r\n\r\n\r\nNikolas Hulewsky (56:35.738)\r\nit it's very very good like very good surprisingly good\r\n\r\n\r\nChris Koerner (56:38.03)\r\nOkay.\r\n\r\n\r\nI want to make a YouTube video where I take the same prompts and put them in all three specifically for deep research.\r\n\r\n\r\nNikolas Hulewsky (56:47.448)\r\nSo you think you need to use cursor more?\r\n\r\n\r\nChris Koerner (56:49.453)\r\nI need to use cursor more and I need to use replete less. Just because I'm not able to wrap up these projects.\r\n\r\n\r\nNikolas Hulewsky (56:58.286)\r\nI this is one of the things that's been fascinating to me is like, I wanted to learn how to do these things. So I did a project and have you ever heard of, I hate bringing these things up to you because I feel like a high schooler who's in chemistry 101 or whatever, talking to a PhD chemist is like, have you ever heard of gravity? And the chemist is like, yeah, yeah, it's offensive. Have you ever worked in Google CoLab?\r\n\r\n\r\nChris Koerner (57:19.899)\r\nI mean, you did ask me what a lead magnet was a while back. That was offensive.\r\n\r\n\r\nChris Koerner (57:28.377)\r\nNick, you it's a good thing you asked because no, I haven't. Okay, I haven't. want to be like, No, I don't. Genuinely.\r\n\r\n\r\nNikolas Hulewsky (57:31.534)\r\nDo know what it is?\r\n\r\n\r\nNikolas Hulewsky (57:35.31)\r\nOkay, so I have all of these transcripts from my podcasts and specifically I just wanted to focus on the AI podcast. So what I wanted to do and you know how this works is I want to take all the conversations, aggregate them and then be able to pull out information. Okay. But how do you do that? The context windows are only 120,000 tokens and like four of those transcripts are more than 120,000. It's like, it doesn't work. So I needed to clean the transcripts.\r\n\r\n\r\nChris Koerner (57:50.981)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (58:00.527)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (58:04.482)\r\nget rid of all the dead space, ums, ahs, timestamps, et cetera, and then get them into a format where they would all be combined. And I had them all saved, yeah.\r\n\r\n\r\nChris Koerner (58:13.423)\r\nWhat about do the transcripts identify who's speaking?\r\n\r\n\r\nNikolas Hulewsky (58:17.122)\r\nYes, I kept the speaker. I did keep the speaker because I wanted to know by person and I'll show you the output that I got. But I wanted to know by Pete, by speaker, who's talking and what are they saying and why? Anyways, so I don't know what to do. And what do I do? I literally just go to chat, GPT and I'm like, hey, this is what I want to do. I want to take all these transcripts. I want to combine them. I don't want to clean them. And it was like, OK, where are they stored? it's in Google. OK, perfect. You're to go to Google CoLab.\r\n\r\n\r\nChris Koerner (58:18.692)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (58:47.266)\r\nGreat. Open a new project, attach your drive. Great. I did that. And run this script. So Google Colab is an environment where you can run Python script for it to actually execute a function. So I'm like, okay. So it gives me the Python script. First couple of times it doesn't work. Then I go to Claude, Claude fixes my Python script and it starts working. The first iteration suck. Second iteration suck. But by the, you know, a couple hours later, I've got.\r\n\r\n\r\nChris Koerner (59:04.955)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (59:15.244)\r\nsome really, really good data. In fact, I'm going to share my screen with you. A moment.\r\n\r\n\r\nNikolas Hulewsky (59:28.462)\r\nNow again, it took time for me to for me to get to this place But then once once it was spit out I took it back to chat GPT and I was like, hey Please clean up this data for me make it look presentable, etc. And This is what it spit out. So now I have the episode with the person. Okay interview name their business type\r\n\r\n\r\nChris Koerner (59:47.109)\r\nMm. Mm-hmm.\r\n\r\n\r\nChris Koerner (59:57.381)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (59:57.656)\r\nthe industry, their technical knowledge, what their primary LLM was that they used. Here are the main tasks and use cases.\r\n\r\n\r\nChris Koerner (01:00:02.717)\r\nthis is cool.\r\n\r\n\r\nThis looks like a lead magnet to me,\r\n\r\n\r\nNikolas Hulewsky (01:00:08.302)\r\nHmm, hmm, I haven't done that. Motivation for using these LLMs, strengths, weaknesses, the ideal user profile, and then the key insights. And like the key insight, I was like, hey, write me a 500 character summary of this conversation. But then I had to do a couple of other things. Then I had to actually go to Zapier and create a Zap so that it would interface with OpenAI. And then I learned I could actually just attach the API. I'm going like real technical here, but whatever.\r\n\r\n\r\nChris Koerner (01:00:23.408)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:00:37.41)\r\nthe API key into Google CoLab, so I didn't need Zapier anymore. But because of that, I now have this amazing spreadsheet with tons of conversations with entrepreneurs who are actually using AI. And I understand the use cases that they're using it for. So now I can go to this and just ask it questions or, I don't know, make a quiz that says or tell Chachi Buti, which I've been working on, create a quiz for me.\r\n\r\n\r\nChris Koerner (01:00:53.051)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:01:03.372)\r\nI'm a business owner and I want to know which one of these models I should use to create a quiz that I can decide which model to use and it uses this information to create a quiz for somebody so they know which model to use. So anyways, it's been dude. It's been just so fascinating. To learn from these people and see how much application there actually is, even in the limited state that we currently see it.\r\n\r\n\r\nChris Koerner (01:01:09.584)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:01:25.253)\r\nThat's amazing. I love that you did that because we know that I hate hopping on calls with people. So you're able to do it and enjoy it and then relay what you learn.\r\n\r\n\r\nNikolas Hulewsky (01:01:31.554)\r\nYeah. Yeah. and the number one, the number one use case for it right now, sales.\r\n\r\n\r\nChris Koerner (01:01:38.905)\r\nFor AI in general? Was there a selection bias? Did you happen to talk to a bunch of sales guys?\r\n\r\n\r\nNikolas Hulewsky (01:01:40.216)\r\nMm-hmm. Sales. mean, myriad of things.\r\n\r\n\r\nNikolas Hulewsky (01:01:46.198)\r\nNo, they were all either owners or coders. And they were like, I'm using it for my sales team to follow up with them. I'm using it to track leads. I'm using it as an after hours phone service. I'm using it as a chat bot for customers. I'm using it for my sales team to prepare for calls. Like it was just all sales related. I thought that was really interesting.\r\n\r\n\r\nChris Koerner (01:01:48.709)\r\nHmm.\r\n\r\n\r\nChris Koerner (01:01:57.275)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:02:06.243)\r\nYou know what framework that is? Like when you're launching products or services, stay close to the money, right? Stay close to the things that directly generate revenue and you can tie it to revenue easily. Right? So let's say you want to start a SaaS, a B2B SaaS app. It's like, let's do HR. Should we do, you know, administrative assistant? It's like, no, like build something that people can use to directly make more money. And they know that your thing helped them generate more money.\r\n\r\n\r\nNikolas Hulewsky (01:02:08.182)\r\nNo, what?\r\n\r\n\r\nChris Koerner (01:02:34.863)\r\nthat will have the highest likelihood of succeeding.\r\n\r\n\r\nNikolas Hulewsky (01:02:37.358)\r\nYeah, yeah, it's a great point. And that's exactly what I found when talking to these people. It's all sales related.\r\n\r\n\r\nChris Koerner (01:02:42.863)\r\nYou know what I love about Chad GPT? I just realized this and you might have had a different experience and it may change because incentives aren't aligned. It is not biased. Like if I ask it about Republicans or Democrats or the Mormon church or the Catholic church or seed oils or health or carbs versus fats versus proteins, I really feel like it's unbiased. Like it is a superpower. So here's one example. I saw this Instagram reel and do you know what Ghee is? G-H-E-E.\r\n\r\n\r\nIt's like a clarified butter. It's like a different version of butter that we've been using for hundreds of years. It's it's whole food. It's healthy. It's it's like an alternative to seed oils or canola oil or butter. Okay. So I saw this stupid Instagram reel that was saying basically, gee is unhealthy actually. And canola oil is healthier than ghee. And I'm like, my gosh, what are we doing? Like there's so much info out there that like literally no one knows what to eat.\r\n\r\n\r\nCause you don't know who to believe cause you don't know who has the incentive to say whatever. So I went to chat, GPT four O and I said, who paid for the study? that says replacing ghee with canola oil is better. So this is what I said, who paid for this, right? And it's like, great question. Here's the deal with most of those canola is better than ghee studies. Many are funded by big food or ag companies. Example studies in the past that have been backed by groups like the canola council of Canada, American heart association.\r\n\r\n\r\nNikolas Hulewsky (01:04:09.378)\r\nThey just sound evil.\r\n\r\n\r\nChris Koerner (01:04:11.043)\r\nor Unilever like literally like Coke and Pepsi are funding the American Heart Association, right? So then they put out these studies that are like, Coke is actually good for you. It's like, but like chat GPT has no bias because there's nothing to click. The incentive is there. Whereas if I Google the same thing, like the incentives are for me to click on stuff. So I still can't believe what I Google, right? Now I don't as optimistic as I am, I don't think that chat GPT will stay like this forever because money.\r\n\r\n\r\nright? But I love that it's like this for now. Have you had the same experience?\r\n\r\n\r\nNikolas Hulewsky (01:04:46.558)\r\nI but a little bit different. So I think it's pretty unbiased when I'm asking it semi-factual questions, but I do think it's biased when I'm asking it for feedback. And this is either it's biased or I'm insecure. Because whenever I ask it for feedback on something that I'm doing or about me, I feel like it's overly praising me, if that makes sense. Where I'm like, hey, take a look at this post I wrote. What do you think?\r\n\r\n\r\nChris Koerner (01:05:10.96)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:05:14.392)\r\nThis post is fire, fire emoji. By the way, open AI, can we cut the emojis? Like what's happening? Why are there so many freaking emojis? Anyways, this post is fire. And I'm like, how would you rate it? I would rate it a 9.5 out of 10. And it's like, okay. And then I have to go back to it. like, you're a neutral third party. Your job is, you know, content management. You've seen everything. Right, right, right. So to me, that's where I am seeing bias is like.\r\n\r\n\r\nChris Koerner (01:05:20.825)\r\nYeah, I hate him.\r\n\r\n\r\nChris Koerner (01:05:31.768)\r\nMm-hmm.\r\n\r\n\r\nIt's saying what it thinks it wants you to hear. Right.\r\n\r\n\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (01:05:42.656)\r\nIt says what it thinks that I want to hear. And there are times where like, I, want it to be totally unbiased and like give me an actual opinion of what it thinks of my business plan or this post or the argument that I'm making with my lawyer. You know what I mean? So anyways, that that's the only piece that I would say I'm, I do see it biased.\r\n\r\n\r\nChris Koerner (01:05:46.875)\r\nThat's a point.\r\n\r\n\r\nChris Koerner (01:05:55.737)\r\nYeah.\r\n\r\n\r\nIt's funny because I'm going to directly contradict myself and it's like, it's not that it's unbiased. It's just biased in a different way. There there's always incentives. It's impossible to remove incentives. Opening eyes incentive is to keep us using Jad GPT. So it's like the bias is not clicked on this study. It's like, make sure Nick never churns, right? We want to keep Nick happy, you know.\r\n\r\n\r\nNikolas Hulewsky (01:06:06.67)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (01:06:12.11)\r\nRight. Yeah, yeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (01:06:18.35)\r\nYeah. Right. In fact, I have a custom GPT where in the GPT prompt, I'm like, you're a hard nosed, no nonsense content specialist. I need you to give me direct advice because bad advice is terrible. I give an analogy about being on the war field. War field. I'm so stupid. Being on the being on the battlefield and, you know, field generals need to have\r\n\r\n\r\nChris Koerner (01:06:31.311)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:06:46.646)\r\nnot only real-time information, but accurate information to make good decisions. Otherwise bad things happen. So like, give it that analogy of like, this is why I need you to give me good information because I need to make good decisions. And so that GPT is great because it gives me sort of unfiltered responses, but it's when I'm just like trying to ask it a general question that it's definitely biased.\r\n\r\n\r\nChris Koerner (01:07:00.709)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:07:07.355)\r\nI'm kind of debating if I should say this part next part or not.\r\n\r\n\r\nChris Koerner (01:07:15.515)\r\nI don't think I want to. I don't think I want to.\r\n\r\n\r\nNikolas Hulewsky (01:07:18.338)\r\nSay it and we'll cut it.\r\n\r\n\r\nChris Koerner (01:07:20.301)\r\nRelationship advice? Have you like with your spouse? Have you used it for that?\r\n\r\n\r\nNikolas Hulewsky (01:07:27.177)\r\nNo, but like what have you used it for?\r\n\r\n\r\nNikolas Hulewsky (01:07:32.77)\r\nDude, like, I'm gonna say this. You and I have talked about, we each have superpowers. And when you have a superpower, you have to know when to use it when not to use it. And you also have to recognize that you can use your superpower for evil. To me, the reasoning that ChatTPT has, like, let's say you have an argument with your spouse and you're trying to get your way, where it can help you frame an argument.\r\n\r\n\r\nChris Koerner (01:07:42.33)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:07:52.345)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:08:02.459)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (01:08:03.998)\r\nis out of this world. And then it's a very unfair fight because you've cut...\r\n\r\n\r\nChris Koerner (01:08:10.244)\r\nYou're not citing to your wife, ChatGBT. According to chat, you're not doing that.\r\n\r\n\r\nNikolas Hulewsky (01:08:13.118)\r\nNo, no, you're not citing you like, well, that's an interesting point on you because I would think that you would want to do X, Y and Z based on your previous, you know what I mean? And she's like, well, that's a, yeah, that's a really good point. And meanwhile, you're like looking down at your phone. You're like, she said it was a good point. What do I do now? What this has never happened. She said, I'm smart. What's happening right now?\r\n\r\n\r\nChris Koerner (01:08:32.059)\r\nBye guys.\r\n\r\n\r\nDude, I have been very impressed with how chat GPT is handled like relationship advice with my spouse. And I've never we've never seen like a marriage counselor or a therapist, or really talk to anyone like we've got a good marriage, right. But I've just been asking it some things and it has been so helpful. And it I feel like it's advice that like a very expensive, very, very good marriage counselor would give.\r\n\r\n\r\nAnd it's literally made our marriage better. And she has no idea. She has no idea.\r\n\r\n\r\nNikolas Hulewsky (01:09:10.456)\r\nIt's the perfect use case for it, And if you're like, if you're trying to come at it from a genuine way and you're like, look, I'm to try to give you all the facts that I can help me understand it. Then you're getting like this impartial third party and you're like, well, it's AI. So like if AI thinks I'm being a prick, yeah, I guess I am being a prick about that, right? Or vice versa. And it's pretty incredible with the way, if you give it enough context, right? Cause you and I might have a disagreement. I might give it all the context in the world and it's me like, yeah, Nick, you're right.\r\n\r\n\r\nChris Koerner (01:09:12.249)\r\nYeah.\r\n\r\n\r\nChris Koerner (01:09:23.547)\r\nYeah.\r\n\r\n\r\nChris Koerner (01:09:27.033)\r\nYeah.\r\n\r\n\r\nChris Koerner (01:09:33.467)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:09:39.298)\r\nand then you might have the same disagreement and put your context in. Well, it doesn't want me to turn, but also I'm just giving it my context and then you do the same thing and it gives it your comp. Right. And then it's like, yeah, well, of course.\r\n\r\n\r\nChris Koerner (01:09:39.535)\r\nYeah, it doesn't want Nick to churn. It doesn't want Chris to churn.\r\n\r\n\r\nChris Koerner (01:09:46.851)\r\nYeah, it's your side of the story, right? Like if you feed it biased info, it's going to give you biased info.\r\n\r\n\r\nNikolas Hulewsky (01:09:53.998)\r\nYeah. The trick is I would like to start using, figuring out a way to use this for mediation in business disputes, I think would be really fascinating. If everybody just had, if everybody just had the, the, um, limitless, which I ordered by the way. And it's like, it's like, okay, upload all your limitless data. Now you'd have to have two parties who are like, okay, with everything being uploaded, but that in and of itself would be a tell.\r\n\r\n\r\nChris Koerner (01:10:01.146)\r\nMm.\r\n\r\n\r\nMm-hmm. Mm.\r\n\r\n\r\nChris Koerner (01:10:09.48)\r\nLimitless. awesome.\r\n\r\n\r\nChris Koerner (01:10:21.253)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (01:10:23.276)\r\nRight? Where you're like, this guy doesn't want to upload it. What's going on? But it's like, all right, take all of the side of their story, enter all the information, because that's essentially what an arbitrator is doing anyways. That would be a really good dude. You're just an arbitrator.\r\n\r\n\r\nChris Koerner (01:10:23.587)\r\nYeah, yeah, yeah.\r\n\r\n\r\nChris Koerner (01:10:33.051)\r\nYeah, that's really good. You could do that with just a, you just create a fresh chat GPT account and the two people could sit side by side. So here's my side of the story. Here's my side of the story. And then they both agree like what the prompt is, right? And it's, it's neither one of their accounts and you just hit enter and see what happens.\r\n\r\n\r\nNow the hard part would probably be agreeing what the prompt is, right?\r\n\r\n\r\nNikolas Hulewsky (01:10:55.182)\r\nas a very.\r\n\r\n\r\nNikolas Hulewsky (01:10:59.598)\r\nYeah, and just like any other mediation, the hard part would be actually agreeing on the output. Because even if we're in a mediation and it sides with you, I'm going to be like, what? Well, it didn't take into, yeah, yeah. But I do think if you're a mediator and your business is mediation.\r\n\r\n\r\nChris Koerner (01:11:07.011)\r\nYeah, it's stupid. doesn't know what it's talking about.\r\n\r\n\r\nNikolas Hulewsky (01:11:16.024)\r\nFor those types of businesses, your bottleneck is you. It's your time essentially, because you're an agency and you can only bill as much as you can actually go out and meet with clients. If you could use ChatTPT to build a wrapper or to build a prompting system to get that information quicker so that you save an hour per mediation, like then all of sudden you can take on 20 more clients a month. Like you just grew your business in a way that's AI enabled. That would be a really, really cool use case.\r\n\r\n\r\nChris Koerner (01:11:19.109)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:11:31.045)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:11:42.649)\r\nThat is cool. banana. So I asked chat GPT for help on like getting more intimacy. And I was like, what, what I do? Like I do the dishes, like this is my perspective. Like I do all these things and like she's too, it was so good. Like it was just like, it's like, listen, it's like you're, you're acting like a sad puppy. Like you're acting put out when she won't put out, you know,\r\n\r\n\r\nThat's not helpful. Like you need to exude masculine energy. You need to be the opposite of her. She's feminine. You get it's like a work in progress, but it's looking really good that my friend, but it was, it was like so good. It just made logical sense. It's like, no, you need to be strong, but firm. You need like, yeah, don't not do the dishes, but like, no, you're cool if you don't do it. But like it just, it provided like a plan to where like she will come to me instead of me coming to her.\r\n\r\n\r\nNikolas Hulewsky (01:12:14.872)\r\nDid it work?\r\n\r\n\r\nNikolas Hulewsky (01:12:38.818)\r\nYou're an evil genius, my boy.\r\n\r\n\r\nChris Koerner (01:12:38.903)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (01:12:42.894)\r\nNo, it's funny too because it's like you put that in and the response is like, just listen to her and make sure that you do the dishes and don't act sad when she says no to sex. you're like, oh, that's wow, AI, that's really interesting. I know, I know.\r\n\r\n\r\nChris Koerner (01:12:57.243)\r\nIt is. And I asked, I'm like, where are you getting this info from? And it's so excited at sources like this famous book, this well researched book, and like, I'm not going to spend eight hours reading a book. And like a book isn't interactive, it doesn't know me. So it's so much better and faster. And like, we don't even realize the ways banana again, we don't even realize the ways that we're so much more efficient now with AI, because it's normal. But like,\r\n\r\n\r\nWhat would our lives be like today if there was no AI over the last two years? How much less would we have gotten done?\r\n\r\n\r\nNikolas Hulewsky (01:13:31.246)\r\nWell, dude, you and I talked about this idea a couple of weeks ago where it's just like buy limitless pendant and give it to somebody, almost like a lead magnet to get into their business. And you're already doing this because you're recording everything. At some point, the ability of these models to digest more data is going to happen. So what becomes the limiting factor in how well these models will get to know you and be your own personal assistant? The limiting factor will be data.\r\n\r\n\r\nChris Koerner (01:13:38.917)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nChris Koerner (01:13:44.975)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:13:51.3)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:14:00.389)\r\nContext windows.\r\n\r\n\r\nNikolas Hulewsky (01:14:00.44)\r\nIt's not going to be compute power. Yeah. Or, or the ability to process or you know what I mean? Or the ability, because what's happening right now is it may have this massive data set, but it's, it's optimizing for speed. And so it's only looking for certain whatever at some point. It's going to get way better. And the only, the limiting factor is going to be the amount of data that you have to input it into the system for it to then tailor itself to you. So I don't have a business model off of this. just think using chat, GBT.\r\n\r\n\r\nChris Koerner (01:14:06.33)\r\nYeah.\r\n\r\n\r\nChris Koerner (01:14:21.243)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:14:28.743)\r\nusing a limitless pendant where you're recording every conversation that you have. It just creates more and more and more data so that when it's there, it's fed in and you're accelerated even faster.\r\n\r\n\r\nChris Koerner (01:14:36.027)\r\nMm It's good to have. Yeah. Can we barbell this for a minute and go offline?\r\n\r\n\r\nSo you see my tweet about the podcast billboard I'm putting up. So that's been a lot of fun. It won't go live for like two or three weeks, but I used AI to generate a bunch of phrases, right? So you saw that I shared my screen. put the podcast art on the left, Kerner office in the middle, icons to YouTube, Spotify, Apple podcasts, and then like a catchy slogan at the top. Okay. So I had Simon make 34 of these.\r\n\r\n\r\nNikolas Hulewsky (01:14:48.824)\r\nYeah.\r\n\r\n\r\nChris Koerner (01:15:12.847)\r\nThey all look the exact same except for the catchy slogan at the top is all different. Two to five words. Like you only have so much time to read a billboard, right? And so the catchy slogans that I'm testing are, your dream is dying. Sell stuff, not ours. Nine to fives kill dreams. Own your time. Never job again. Jobs are jail. Delete LinkedIn. Work sucks? mark. Escape the grind. Fire your boss. still rat racing? Question mark.\r\n\r\n\r\nAnd what was the last one? then there was best, best podcast or best business podcast. And then quit your job with an exclamation point. And then there's a bunch of others, but I'm, I, I started Facebook ads that are all the exact same. It's just like the Kerner office podcast, title, text description. They all say the same thing. The Kerner office podcast, the audience, the four counties in and around where the billboard will be.\r\n\r\n\r\nAnd then I exclude anyone that's ever interacted with my content. So they don't follow me. They've never seen my video and they live in those counties. Cause that's bias. The people driving by don't know who I am. Right. And then I just run the ads, on any meta platform, meta thinks messenger marketplace, Instagram, it chooses. And then I just look at the clicks lowest cost per click wins. And then I get, cause it's 950 bucks to print that billboard.\r\n\r\n\r\nNikolas Hulewsky (01:16:30.51)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (01:16:39.341)\r\nAnd so I don't want to guess. and so I'm, putting these images and the, the image that I'm using on, on the Facebook ad is literally a picture of the billboard with like trees in the background instead of just the image, you know, and, and it's 18 plus any gender in those counties that don't know who I am. What do you think?\r\n\r\n\r\nNikolas Hulewsky (01:16:51.043)\r\nRight, right.\r\n\r\n\r\nNikolas Hulewsky (01:17:01.294)\r\nthink it's amazing. have an idea for it as well. I would, I know we're offline, but I'm gonna take it back to AI.\r\n\r\n\r\nChris Koerner (01:17:09.827)\r\nI used AI to generate most of those phrases by the way.\r\n\r\n\r\nNikolas Hulewsky (01:17:11.746)\r\nI know, I know. What I like to do with AI when I'm like creating a title for a video is I'll be like, generate me the 10 best titles and rank them. And then I'll like iterate from there. I would take all of your pictures and I would go to chat GPT, Grok, Claude, Gemini, four of them, upload them and say, rank these from what you think would be most to least effective. See what the four models spit out.\r\n\r\n\r\nChris Koerner (01:17:38.576)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:17:40.876)\r\nand then compare it to the actual results from Facebook ads. Yeah, that would be such a cool.\r\n\r\n\r\nChris Koerner (01:17:42.427)\r\nMmm. I'll do that. I'm just gonna do it with the phrases because all the pictures are the same. You know what saying?\r\n\r\n\r\nNikolas Hulewsky (01:17:49.032)\r\nokay. Yeah. Yeah. So like, I think that would be a really, really cool case study of like, all right, I'm trying it with real humans. This AI has been trained on the totality of human, whatever experience, which one of them wins or which, how accurate is it? Because then in the future, if it's like, they were, they all said the same five and those were actually the five that won, it might save you time, you know, running Facebook ads in the future.\r\n\r\n\r\nChris Koerner (01:17:54.479)\r\nYeah.\r\n\r\n\r\nChris Koerner (01:18:01.85)\r\nMm-hmm.\r\n\r\n\r\nYeah.\r\n\r\n\r\nChris Koerner (01:18:13.817)\r\nYeah.\r\n\r\n\r\nChris Koerner (01:18:17.539)\r\nYeah, I like that. It's interesting. I didn't exclude my audience at first and I started running the ads and the winning one was best business podcast. And that surprised me. And I was like, I wonder if that's cause like they recognize me, they see me. and I don't yet know it's still too early. but it just made me think like how much power there is in marketing to call your thing the best. I had Greg Eisenberg on a couple of weeks ago. His story was he was walking around Miami. He had just moved there.\r\n\r\n\r\nNikolas Hulewsky (01:18:32.91)\r\nRight.\r\n\r\n\r\nChris Koerner (01:18:47.055)\r\nHe walks by a dentist and he sees a sign on the window that says voted best dentist by who, what? I don't know. I don't care. He walks in because he saw that sign became a customer, been a customer for eight years, given them tens of thousands of dollars, referred 20 friends there because he saw the sign. So his idea was like, there needs to be some sort of like a marketplace where you could get like certified by whoever it's a racket. doesn't matter. You pay 200 bucks. You get a sign. Right. And so it's like, I just put up this billboard. Yeah.\r\n\r\n\r\nI think it's the best. My mom thinks it's the best, whatever. Best business podcast according to Chris's mom, fine print asterisk, right? It doesn't matter. So maybe people click that the most because they knew who I was and I'm going to find out that's actually bad data. Maybe not. Maybe it's the winner again. and people just, it's confirmation bias. They're like, I believe you internet stranger. I will now click and listen because you said it's\r\n\r\n\r\nNikolas Hulewsky (01:19:41.016)\r\nhearing you talk about Greg Eisenberg makes me think of that meme that's like, internet guy discovers rating agency. It's like these things exist, Like best business, like you can tell they're already businesses in and of themselves. But yeah, this cracks me up.\r\n\r\n\r\nChris Koerner (01:19:46.555)\r\nHehehehe\r\n\r\n\r\nYeah.\r\n\r\n\r\nChris Koerner (01:19:55.823)\r\nWell, there needs to be like for SaaS companies or for AI rappers, like you could do a rating agency for any number of things, right?\r\n\r\n\r\nNikolas Hulewsky (01:20:03.714)\r\nYeah, I mean, that's what No BS Crypto was when you were launching it, right? It's like, hey, this is a rating agency. I don't know. Looks like we made it. No, I like.\r\n\r\n\r\nChris Koerner (01:20:07.429)\r\nYeah. You remember?\r\n\r\n\r\nChris Koerner (01:20:16.709)\r\nDo you think now can go ahead.\r\n\r\n\r\nNikolas Hulewsky (01:20:19.542)\r\nI like, I just like that idea a lot because you're like, you're currently competing all of the tools, all of the advice. If you go and look at, how do I grow a podcast is do it on someone else's newsletter, go do paid ads, go to this brokerage, go to other podcasts. Right. It's like, okay, well everybody else is doing the same thing. They're all doing the same exact thing. And that we know that's a strategy zig while everybody's acting.\r\n\r\n\r\nChris Koerner (01:20:32.589)\r\nappear on other podcasts.\r\n\r\n\r\nChris Koerner (01:20:43.481)\r\nYeah, so like either this is going to be a total waste of money and I'm prepared for that to happen because I don't see other podcasts billboards probably for a reason or I'm going to unlock something really cool, right? aren't you going to ask me how I'm going to track if I'm getting new downloads from this Nick? Softball me here, set me up.\r\n\r\n\r\nNikolas Hulewsky (01:20:49.998)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:20:57.998)\r\nHow you gonna track?\r\n\r\n\r\nChris, let me ask you question. Like, I get it, but how do you freaking track that? It's on a billboard.\r\n\r\n\r\nChris Koerner (01:21:02.211)\r\nNo. Mm hmm. probably like a QR code, right? No QR codes are not allowed by clear channel, the company I'm using for this. OK, so Buzzsprout is the hosting platform that we use. You can export your downloads by location by every little city. So like when I export mine, there's like 8500 cities that have listened to my podcast, sometimes once, sometimes a thousand times, right?\r\n\r\n\r\nNikolas Hulewsky (01:21:10.52)\r\nNo?\r\n\r\n\r\nOkay?\r\n\r\n\r\nChris Koerner (01:21:31.513)\r\nNow what you don't know is how many unique listeners there are per city. You just know how many downloads. So 25 downloads could mean one person downloading your podcast, 25 episodes of it could mean 25 different people once each, right? You don't know. So what I did was I went to the billboard will be in Tomball, Texas, which is a city of 10,000 just north of Houston. I took Tomball, the Woodlands spring, all the cities and Houston itself in and around Tomball. And I exported every city by download.\r\n\r\n\r\nAnd then I found a percentage like a ratio. How many downloads have I had all time that were in Tomball and or Houston? 0.012 % of my downloads. And that's been consistent. And so I'm just going to run that export every week and see the raw number and the percentage as a ratio and see if it's climbing or not. Do you see any, any fault in that?\r\n\r\n\r\nNikolas Hulewsky (01:22:22.99)\r\nI do see a couple of faults. You don't necessarily know where it is as a percentage over time as it's mapped.\r\n\r\n\r\nChris Koerner (01:22:31.215)\r\nWell, I'm going to run the export every week because that's really the only way with Buzzsprout you can do it.\r\n\r\n\r\nNikolas Hulewsky (01:22:34.53)\r\nThe other.\r\n\r\n\r\nThe other problem would be, it's just all attribution related, right? Like you're looking at this geography, or did you capture the right cities? What I would do, this is just a suggestion, is I would ask ChatTPT the best way to track this and the best way to analyze it. Because you can throw data into ChatTPT and then ask it to run a regression model. And the regression model will tell you whether or not.\r\n\r\n\r\nChris Koerner (01:22:58.415)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (01:23:04.952)\r\nthat's statistically significant or not. Because you could just have, you could just blow up over the next month. Let's say you have like a couple of episodes that are amazing and it's like everybody saw a bump, right? So of course Turnball would see a bump, but does that necessarily mean?\r\n\r\n\r\nChris Koerner (01:23:07.023)\r\nMmm.\r\n\r\n\r\nChris Koerner (01:23:19.191)\r\nit wouldn't be proportional, it would be proportional in that sense, right? Like, in that instance, I would have to look at the percentage, not the raw number.\r\n\r\n\r\nNikolas Hulewsky (01:23:23.15)\r\npotentially.\r\n\r\n\r\nI just think you have so many downloads, you have so much data that it would be easy to say with statistical, like with confidence, whether or not it's statistically significant. just, I would just ask ChatGPT.\r\n\r\n\r\nChris Koerner (01:23:34.747)\r\nRight.\r\n\r\n\r\nChris Koerner (01:23:40.431)\r\nYeah, no matter what I do, it won't be exact, but it would be, it would be too coincidental if a disproportionate amount of people in that part of Houston suddenly started downloading my podcast, right? What I, what I wish I knew is how many, because you just don't know how many raw people it is, how many loyal listeners, because there could be a hundred people that listened to five seconds of it once and then bounce and it could look really good, but not actually be good.\r\n\r\n\r\nNikolas Hulewsky (01:23:43.191)\r\nNo, but I think it's amazing.\r\n\r\n\r\nNikolas Hulewsky (01:23:50.924)\r\nRight.\r\n\r\n\r\nNikolas Hulewsky (01:24:04.024)\r\nSo why didn't?\r\n\r\n\r\nWhy didn't you do the here's the website and then have like one letter off?\r\n\r\n\r\nChris Koerner (01:24:13.219)\r\nRight. I just don't want to mess with like URLs. I kind of want to go more for brand awareness. That's why I put the image of the podcast and one of them has TKO pod.com in it. yeah, I just want people to search for it. But another thing you can do is you can put up Facebook ads based on a latitude and longitude point of the exact billboard and it will show your ad to people that drive by that billboard. And so then you get double\r\n\r\n\r\nNikolas Hulewsky (01:24:24.686)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (01:24:29.934)\r\nHmph.\r\n\r\n\r\nChris Koerner (01:24:41.485)\r\nexposure, triple exposure, and that will make it even, it will make the billboard even more effective, but it will make it even harder to find the attribution because you're adding another variable, right?\r\n\r\n\r\nNikolas Hulewsky (01:24:45.774)\r\nThat'd make it even harder to.\r\n\r\n\r\nNikolas Hulewsky (01:24:52.91)\r\nYeah, but at that point, it's like, okay, I'll spend $780 for a billboard and I'll run $1,000 worth of Facebook ads. Who cares about the attribution? I know it works. You know what mean?\r\n\r\n\r\nChris Koerner (01:25:03.375)\r\nYeah, because any Joe Schmo can run a Facebook ad, but you don't see a lot of billboards. It just adds another layer of legitimacy to it.\r\n\r\n\r\nNikolas Hulewsky (01:25:09.484)\r\nRight. Yeah. And that feeling of like, dude, I'm seeing this guy everywhere.\r\n\r\n\r\nChris Koerner (01:25:13.433)\r\nRight. It, I kind of have the thought like, wouldn't it be interesting if one of us, anyone ran a test where they took like a random city in the middle of nowhere, like Sioux falls, Iowa, and they ran Facebook ads like saturated for your podcast, your brand, whatever, just in that city. And like you just became a freaking rock star in that one city and you just put them everywhere. Instagram ads, Tik TOK ads everywhere. Only geo-fenced.\r\n\r\n\r\nto that city and just, I don't know, go speak, have an event there. Like it'd be an interesting experiment. Like no one else in the world knows who you are except for suit balls.\r\n\r\n\r\nNikolas Hulewsky (01:25:48.835)\r\nWhat if you\r\n\r\n\r\nWhat if you went to chat GBT and you said, I want you to run a contagion analysis or model, um, only have cities less than a million people in the United States. And tell me which city would have the highest likelihood of spreading this contagion the fastest. So it's like, you know, it's going to go look at Des Moines. Like, well, Des Moines actually has the most connecting flights of any airport in the United States. So I don't know, right? I'm just like.\r\n\r\n\r\nChris Koerner (01:26:09.701)\r\nHmm.\r\n\r\n\r\nChris Koerner (01:26:19.175)\r\nMmm, contagion. Yeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (01:26:20.974)\r\nIt's going to – and then it's like, okay, cool. I'm to go target Grand Junction, Colorado because it says that of any city under a million people, that's the one that would have the worst contagion and that's city I'm going go target.\r\n\r\n\r\nChris Koerner (01:26:32.709)\r\nor like Vegas, like a city or Orlando where people are coming in and out of all the time. Like New York City has 20 million people anyway, right? People are coming in and out, but proportionally speaking, there's just a lot of people there.\r\n\r\n\r\nNikolas Hulewsky (01:26:35.756)\r\nYeah. Right. Right.\r\n\r\n\r\nNikolas Hulewsky (01:26:44.91)\r\nAnd, but for New York City, it's like you're or LA or San Francisco, there's just a lot of competitors. So standing out is going to be hard generally speaking, right? But a smaller market like Orlando, I don't know. You probably have a better chance of standing out.\r\n\r\n\r\nChris Koerner (01:26:46.747)\r\n.\r\n\r\n\r\nChris Koerner (01:26:55.632)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (01:27:02.798)\r\nThat'd be a idea.\r\n\r\n\r\nChris Koerner (01:27:04.411)\r\nThat is cool. I like that a lot.\r\n\r\n\r\nNikolas Hulewsky (01:27:06.894)\r\nBye!\r\n\r\n\r\nChris Koerner (01:27:08.283)\r\nI don't know.\r\n\r\n\r\nNikolas Hulewsky (01:27:09.706)\r\nAlright, what call it?\r\n\r\n\r\nChris Koerner (01:27:11.119)\r\nAll right. Yep.",
  "metadata": {
    "duration": "",
    "date": "2025-04-18",
    "platform_source": "Google Drive"
  }
}