{
  "episode_number": "135",
  "episode_title": "I Lost $20K Gambling‚Ä¶ Then Became Vegas & Built a $1M/yr Vending Empire with Ethan Kohan",
  "guest_name": "Ethan Kohan",
  "business_name": "Podplug",
  "transcript": "﻿Nikolas Hulewsky (00:00.104)\r\nso that we don't need to worry about getting into the flow of things. All right, Ethan, tell me about your business.\r\n\r\n\r\nEthan Kohan (00:08.546)\r\nYeah, my business is called Podplug. It's a smart nightlife vending machine business. Started it in 2019 at the University of Miami, my junior, senior year. And it all started with a vending machine in my fraternity house. I ended up putting, at the time, Juul pods, if you guys remember that, were like ubiquitous across the nation. Everyone wanted them.\r\n\r\n\r\nAnd I had the idea of putting these Juul pods inside of my vending machine. So I bought a vending machine, a refurbished vending machine, just a snack machine. And then I just asked the owner of the frat house if I could put it in. He was like, hell yeah, no problem. And at the time, like the legal age was 18 plus, so we were all 18 plus, so was totally fine. And I ended up putting them, bought a machine for like three grand, called a few different suppliers, found one in Charlotte. They'd ship it to me.\r\n\r\n\r\nHe customized it, make it cashless, get rid of the bill acceptor coin mechanism. We installed it in my frat house and we ended up putting Juul pods. We bought them for like nine bucks a unit, sold them for like 20, 22 bucks a unit. And in the first month, the machine generated four grand in revenue at about, yeah, like a 60 % margin. Yeah. The machine was back in like a month and a half.\r\n\r\n\r\nNikolas Hulewsky (01:25.096)\r\nFour grand.\r\n\r\n\r\nOkay, did you have to pay rent for this machine or no? This is a random question, but who owns a frat house? Is it like just some random dude who went to the university and or like, does that work?\r\n\r\n\r\nEthan Kohan (01:32.782)\r\nNo, he just laced it. Yeah.\r\n\r\n\r\nEthan Kohan (01:41.39)\r\nI guess it depends on the university, but at University of Miami, the school does not own the actual property of the frat house. The frats are just affiliated with the school and then they rent it from the property owner on on frat row. Yeah.\r\n\r\n\r\nNikolas Hulewsky (01:55.578)\r\nInteresting. Dude, have you always been a hustler?\r\n\r\n\r\nEthan Kohan (02:01.208)\r\nYou know, it actually, no, until freshman year of college, whenever I lost $15,000 sports betting from all my friends, freshman dorm, freshman dorm, it was bad.\r\n\r\n\r\nNikolas Hulewsky (02:05.479)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (02:12.956)\r\nWait, wait, wait. You made or lost $15,000? How?\r\n\r\n\r\nEthan Kohan (02:15.662)\r\nI lost. Put me in a hole. I didn't realize that I had such a\r\n\r\n\r\nNikolas Hulewsky (02:20.168)\r\nWait, wait, wait. How did you lose 15 grand as a freshman? How did you have 15 grand?\r\n\r\n\r\nEthan Kohan (02:24.814)\r\nWell, all the money leading up to when was 18 from birthday parties to gifts, everything, honestly, just add up, add up, add up. Never touched it. Yeah, never touched it. And then I invested in high school in the stock market as well, made some money off of Nvidia back in the day before it popped up now. Oh, I already did the math. It'd be like 1.2 million.\r\n\r\n\r\nNikolas Hulewsky (02:34.15)\r\nNo way.\r\n\r\n\r\nNikolas Hulewsky (02:46.501)\r\nmy gosh. Could you imagine if you still had that in video stock?\r\n\r\n\r\nNikolas Hulewsky (02:52.348)\r\nHahaha\r\n\r\n\r\nEthan Kohan (02:54.05)\r\nBut instead, profited like 10K.\r\n\r\n\r\nNikolas Hulewsky (02:56.946)\r\nmy gosh. Okay, so you had somehow gotten $15,000. Like that already boggles my mind because like I didn't have 15 grand in a bank account until I was like 30 probably. And you lost it sports betting would you do just bet it all in black?\r\n\r\n\r\nEthan Kohan (03:14.092)\r\nAlmost. Within four months, basically, I lost all of it. I I won my first like six bets, know, big Lakers fan, big NBA, big NFL fan. I'd start off with like 25, $50 bets. I won my first six. I was like, wow, this is so easy. I'm just gonna keep going. And I guess you realize how addictive my personality went. I remember there was this one game, it was like week 10 of the NFL season.\r\n\r\n\r\nNikolas Hulewsky (03:37.853)\r\nMm-hmm.\r\n\r\n\r\nEthan Kohan (03:42.254)\r\nThe Pat, the Patriots were 10 and oh, they're playing against the Panthers that were like one in nine and the Panthers won and I lost like a thousand dollars on that. Cause I thought it was a complete lock. Easy yet. Then I realized like, this is so rigged Vegas always wins. I don't know. I got into a big hole. was betting like one $2,000 bets. It was crazy. I thought I could just win. Yeah. I was like, shit, I lost a thousand here. Okay. And then another thousand to win it back. And then I lose 2000. Then you bet 2000. You lose that again.\r\n\r\n\r\nNikolas Hulewsky (04:02.44)\r\nCause you were like, I'm going to it back. I'm going to win it back.\r\n\r\n\r\nEthan Kohan (04:12.11)\r\nIt just spirals, right? So I just, anytime I go into casino now, I get like, ill. I don't like it. I'm really happy I learned that at a young age though.\r\n\r\n\r\nNikolas Hulewsky (04:20.232)\r\nTell me what else you learned from losing $15,000 in four weeks.\r\n\r\n\r\nEthan Kohan (04:23.554)\r\nSo what happened next? So a week before Thanksgiving, this is freshman year 2016, right, at the University of Miami, my dad calls me, he goes, why the hell do you have $97 in your bank account? And at the time I had a total account, right, so had access to it, and it was one of the most uncomfortable conversations I've ever had in my entire life. And I had to be honest, he was like, we're gonna have a long conversation whenever you come home for Thanksgiving.\r\n\r\n\r\nNikolas Hulewsky (04:39.037)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (04:52.23)\r\nmy gosh. What was that money supposed to be used for? Was it just like, it's my play money or was it like, Hey, Ethan, this is earmarked for groceries or what like living expenses at school or was it just there?\r\n\r\n\r\nEthan Kohan (04:52.835)\r\nYes.\r\n\r\n\r\nEthan Kohan (04:56.991)\r\nIt's like saying.\r\n\r\n\r\nEthan Kohan (05:02.926)\r\nNo, basically like an emergency fund for like my future. Basically, like not touch that money. And oh yeah, whenever I have my son or daughter, I'm never gonna let them touch that money. I'm gonna have access to that account.\r\n\r\n\r\nNikolas Hulewsky (05:07.555)\r\nmy gosh. Dude, I would have been so pissed if I was your dad.\r\n\r\n\r\nNikolas Hulewsky (05:16.784)\r\nWell, I have some thoughts on this. How do you look at that experience now?\r\n\r\n\r\nEthan Kohan (05:23.822)\r\nProbably the best thing that's ever happened.\r\n\r\n\r\nNikolas Hulewsky (05:25.969)\r\nWhy?\r\n\r\n\r\nEthan Kohan (05:28.494)\r\nI was put in a very uncomfortable situation. I hit rock bottom at a young age and hitting that as a young age, it reprogrammed my brain to think differently. Number one, like my dad told me, you know how much $15,000 is? This is back in 2016. And he was like, that's like the average, the minimum wage of a worker in the United States making and working six to eight months.\r\n\r\n\r\nworking 40 hour weeks, right? And after he put that into perspective, I was like, wow, I just wasted six months of my life, basically. I just cut a full six months, like that hit me, right? But just wait until I tell you a little bit more because it gets better. It gets better. I'll wait, wait, wait for that. The story's just starting.\r\n\r\n\r\nNikolas Hulewsky (06:10.237)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (06:16.936)\r\nOkay, go on, go on. You had a bookie? Broken kneecaps? okay.\r\n\r\n\r\nEthan Kohan (06:27.542)\r\nSo my dad, right, during that Thanksgiving break, made me write a handwritten letter to myself about the effects of gambling and sports betting and how I would never do it again. And if I do, are the consequences and I had to sign it. He still has that letter, by the way, to this day. He still has it. And you know what he does? He holds it in his work briefcase every single day.\r\n\r\n\r\nNikolas Hulewsky (06:37.213)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (06:47.912)\r\nWhat does he do for work?\r\n\r\n\r\nEthan Kohan (06:49.518)\r\nHe does real estate. does like multi-family value-added reality. He's on fire. He's on fire. So I stopped for about, you know, took like six months off. You know, I started doing really well in school. And then the NBA playoffs comes in and this is my sophomore year and my friends were like, my God, the Cleveland Cavaliers are playing the Warriors. They're easily going to win this game. It's a home game.\r\n\r\n\r\nNikolas Hulewsky (06:51.012)\r\nokay. He's not a lawyer. I was gonna I was gonna guess he was a lawyer, but okay. All right.\r\n\r\n\r\nNikolas Hulewsky (07:10.984)\r\nUgh.\r\n\r\n\r\nEthan Kohan (07:18.83)\r\nI was like, okay, now this is 2017. This is my software year.\r\n\r\n\r\nNikolas Hulewsky (07:19.128)\r\nWait, what year is this?\r\n\r\n\r\nWas this the year they came back?\r\n\r\n\r\nEthan Kohan (07:26.338)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (07:27.154)\r\nBro.\r\n\r\n\r\nway you just defeated Lee said yeah.\r\n\r\n\r\nEthan Kohan (07:35.374)\r\nYou dropped the gun.\r\n\r\n\r\nNikolas Hulewsky (07:39.814)\r\nOkay, I'm sorry.\r\n\r\n\r\nEthan Kohan (07:41.134)\r\nSo it kind of came back. Obviously in the back of my head, I was like, this is not a good idea, but I was like, how could they not win? It's LeBron James in the playoffs and the finals. Like he's got this, right? Obviously they lost. I bet like a few grand. had a real estate intern, two real estate internships that summer. And I made like five or six grand and I lost it all in like two games basically. And I was like, my God. I had to tell my dad. I had no choice. I had to, I had to be honest with him.\r\n\r\n\r\nNikolas Hulewsky (08:04.704)\r\nmy gosh.\r\n\r\n\r\nEthan Kohan (08:09.954)\r\nHe was this close from pulling me out of school, this close. And sometimes things have to hit me twice. I have to learn the hard way twice, right? And then after that, was like, truly, truly, is it. Fast forward to today, I haven't touched bedding since. So it's been eight years. Yeah, I basically lost my bed.\r\n\r\n\r\nNikolas Hulewsky (08:28.296)\r\n20 grand. You lost 20 grand betting in like the course of six months.\r\n\r\n\r\nEthan Kohan (08:34.828)\r\nLiterally. And what happened next was like, okay, I need to somehow make this money back. How am gonna do it? I probably shouldn't be saying this right now because I know, I know it was not legal, but what I'm about to say was definitely was not legal, but I'm gonna say it anyway. You can try to cut this out if you want or not, but I'm gonna tell you this. But I was like, okay, Vegas always frickin' wins, okay?\r\n\r\n\r\nNikolas Hulewsky (08:44.168)\r\nDude, I love this.\r\n\r\n\r\nNikolas Hulewsky (08:52.422)\r\nNo, that's the hook, dude. That's the hook. I'm not taking that out.\r\n\r\n\r\nEthan Kohan (09:02.734)\r\nYou know what I'm thinking. You know what I have to say, right? I ended up starting a sports book. And I knew I was really good at just talking to people and networking out a lot of friends and different fraternities and across the nation, honestly. I reached out to everyone I knew. I ended up getting 50 people to join my book within like a week, right? But like active bettors, like 90 % of them were active, betting almost daily.\r\n\r\n\r\nNikolas Hulewsky (09:04.71)\r\nI'm not stepping on your toes this time.\r\n\r\n\r\nEthan Kohan (09:32.248)\r\nRight? And it was like eight dollars, the software subscription was like eight dollars per person who joined the book. yeah, go for it.\r\n\r\n\r\nNikolas Hulewsky (09:39.74)\r\nHey, hold on one second. Hold on one second. Hey buddy, what's up?\r\n\r\n\r\nEthan Kohan (09:44.942)\r\nhe's so cute.\r\n\r\n\r\nNikolas Hulewsky (09:46.76)\r\none way.\r\n\r\n\r\nEthan Kohan (10:16.942)\r\nHe's so cute, what's his name? so cute.\r\n\r\n\r\nNikolas Hulewsky (10:17.212)\r\nI usually I usually lock my door. That was Ellis. Yeah, I usually lock my door but I did that today. Okay, sorry. So you've got people participating in your sports back book.\r\n\r\n\r\nEthan Kohan (10:25.998)\r\nI people in the book. Yeah. I knew I had a good network. was good. I was good at talking to people. I knew I can make this happen and paying eight bucks a month for the software, right? And in the software, the beauty of the software was it had live like gambling, like blackjack and poker, like live. It was crazy. was some, some place maybe in the Philippines or Asia where they would actually be feeling live. Yeah. They had a camera and everything, right?\r\n\r\n\r\nNikolas Hulewsky (10:52.391)\r\nDealing.\r\n\r\n\r\nEthan Kohan (10:55.726)\r\nbut you'd play virtually, right? It was pretty wild. I thought this is gonna be a money machine on top of the sports betting, right? The Lions basically mirrored Vegas and within a month, I ended up making 22K, all profit in the first month. My sophomore year of college, yeah, I was 19.\r\n\r\n\r\nNikolas Hulewsky (11:14.853)\r\nWhat?\r\n\r\n\r\nNikolas Hulewsky (11:18.746)\r\nOkay, so when you say you bought a sports book, what does that mean? Like you just started sorry. What does that mean? They came to you they you have the software and they bought bet on your platform.\r\n\r\n\r\nEthan Kohan (11:21.358)\r\nNo, started, I literally started in one book, Yeah, how was it? I was basically Vegas, exactly. I was Vegas. Because I knew Vegas was destroying me, so was like, if it's destroying me, it's going to destroy everyone else, because they always win.\r\n\r\n\r\nNikolas Hulewsky (11:40.048)\r\nOkay, hold on. my gosh. So you're an idiot freshman, you lose $15,000 over like a four week period, because you suck at betting. Then your dad makes you write this handwritten letter, I'll never bet again. You get an internship, you save up some money, you lose another five grand betting on the NBA finals. And at that point, your mind wasn't, should just stay away from betting. was freaking A, there's money in betting. But it's not as the better.\r\n\r\n\r\nEthan Kohan (11:46.412)\r\nYeah.\r\n\r\n\r\nEthan Kohan (12:05.599)\r\nYeah, there it is.\r\n\r\n\r\nNikolas Hulewsky (12:09.038)\r\nIt's as the house. So you started a sports book and you made all your money back in a month.\r\n\r\n\r\nEthan Kohan (12:10.414)\r\nExactly.\r\n\r\n\r\nEthan Kohan (12:14.2)\r\nmade all my money, all cash and Venmo basically in a month. I track everyone and all the payouts on a spreadsheet. And some people obviously didn't pay me out. And like, I never liked threatening people, but honestly I had to. Some people still didn't, some people still didn't pay. It was crazy. Some people literally still didn't pay. And one of the people, I had an agent who found like five people for me. He found like a heavy hitter. The guy lost like six grand in like a day against me, refused to pay me. And what my agent did was,\r\n\r\n\r\nNikolas Hulewsky (12:20.272)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (12:32.242)\r\nWhat?\r\n\r\n\r\nEthan Kohan (12:43.566)\r\nHe was a software engineer and he was a really good coder. He literally found the guy's social security number and his social security number saying like, yo, is this your social? If so, you got to pay up. the guy, didn't like that. I didn't like that.\r\n\r\n\r\nNikolas Hulewsky (12:57.032)\r\nOkay, your turn you turn man. my gosh. It's like in the course of a year. Have you? Have you ever seen the other Have you ever seen the other guys? Movie it's a movie with Will Ferrell and Mark Wahlberg and like Will Ferrell is this like uptight accountant. He's like, well, we should follow the rules we should follow. And then all of sudden it comes out. He was Gator. In college in college he was a pimp and he had a stable of you know, women that he pimped out and he took\r\n\r\n\r\nEthan Kohan (13:05.005)\r\nYeah. I became evil. Yeah, of course.\r\n\r\n\r\nEthan Kohan (13:22.222)\r\nYou\r\n\r\n\r\nNikolas Hulewsky (13:27.248)\r\nAnyways, he turns into Gator. It's pretty freaking hilarious. You you were Gator. This like you'd like turned into a please tell me your dad found out about this. Like I got to hear the resolution of the story,\r\n\r\n\r\nEthan Kohan (13:29.485)\r\nI\r\n\r\n\r\nEthan Kohan (13:36.598)\r\nYes, he was like, listen, congrats, but like, you got to sell this thing and get rid of it ASAP because it's definitely not legal and I don't want you to be in this industry. And I was like, listen, I agree. I just found a kid in my frat house and I just sold him the book for like three grand. I was like, just take it. I'm not going to turn it into like a premium or anything. Just fricking take it. I don't want to be in this industry anymore. I'm So I got rid of it. My dad was proud of me.\r\n\r\n\r\nNikolas Hulewsky (13:49.041)\r\nMm-hmm.\r\n\r\n\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (14:00.443)\r\nOkay, how did your dad find out?\r\n\r\n\r\nEthan Kohan (14:02.52)\r\nabout the book? I told him, I was honest. was like, listen, dude, I just made these in a month.\r\n\r\n\r\nNikolas Hulewsky (14:06.77)\r\nDude, you got a good relationship with your dad.\r\n\r\n\r\nEthan Kohan (14:10.53)\r\nYeah, I do. Ever since I hid that from him freshman year that I lost all that money, I had to be honest moving forward. And it was the best decision I made too. Yeah.\r\n\r\n\r\nNikolas Hulewsky (14:19.831)\r\nWow, dude, good for your dad. mean, like, I want to talk to your dad. I got four boys under 11. I'm like, how do I do that? I want my boy. Because you want like you want your kids to be able to come to you and say, like, I messed up because they're going to go to somebody. So it might as well be you. I.\r\n\r\n\r\nEthan Kohan (14:33.592)\r\nYeah.\r\n\r\n\r\nYeah, I realized the hard way and if I wasn't honest, obviously it would backfire. So was like, what if I just lead with honesty and it worked?\r\n\r\n\r\nNikolas Hulewsky (14:44.156)\r\nDid you know what I find interesting about that whole? There's a ton to find interesting, but there's a couple things. Number one, you lost $15,000, which at the time, I mean, it's still a lot of money. But looking back, you're like, it's not that much money in the grand scheme of things, right? Like you're probably you're probably processing, you know, 10 times that a month with your businesses. But what it allowed you to do is lose while the stakes are low. Right. Have you ever heard of fire festival?\r\n\r\n\r\nEthan Kohan (14:59.374)\r\nNow it's not. Back then it was.\r\n\r\n\r\nEthan Kohan (15:14.306)\r\nyeah, of course.\r\n\r\n\r\nNikolas Hulewsky (15:15.312)\r\nYeah, so Billy Billy McFarland, I don't know anything about him. But this is like my mental perception of him. I don't know that he ever got to lose when the stakes were low. And so when the stakes became exceptionally high, he finally lost but but he like kept ratcheting it up right like he had never encountered failure. He had never experienced\r\n\r\n\r\nEthan Kohan (15:32.718)\r\nThe demonstrations were so serious because he was already in his late 20s, early 30s, whenever it happened, and it hurt a lot of people.\r\n\r\n\r\nNikolas Hulewsky (15:38.589)\r\nYeah.\r\n\r\n\r\nYeah, and he had always been successful. He always. He always found a way out of it, right? Like hey, they could tell you, they could tell you make it. I'm gonna. I'm just going to realize this. I just gotta think about it and it's going to come true and then he gets to fire festival screws. A ton of people he ends up going to jail, but like I don't know this, but my theory is he didn't learn to lose when the scale when the scales not the wrong word. What's the word I'm looking for? He didn't learn to look. He did not learn to lose when the stakes were low.\r\n\r\n\r\nEthan Kohan (16:06.222)\r\nThanks.\r\n\r\n\r\nNikolas Hulewsky (16:10.9)\r\nis basically the thing and like you did and so you know, you're like, man, I remember what that felt like. And while it sucked, it sounds like eventually, it was the right learning experience for you. Like you had to you had to go through that maturation.\r\n\r\n\r\nEthan Kohan (16:24.974)\r\nI had to. had to. Are we going to Fire Festival too? I think you learned. You learned. You learned.\r\n\r\n\r\nNikolas Hulewsky (16:28.52)\r\nDude, I don't know. I? He learned. He learned. Yeah, I don't know if I'd bet on him, but dude, the hustler mentality, that's incredible. Well, I'll just become Vegas. You'd be freaking become Vegas. You're like threatening guys, break their kneecaps. I don't like this anymore. Okay, we, that was an amazing, dude, that was an amazing story. And I think there's a ton of things to take from that because failure sucks.\r\n\r\n\r\nEthan Kohan (16:47.95)\r\nSo\r\n\r\n\r\nNikolas Hulewsky (16:56.006)\r\nAnd you kind of have to like find your groove. And anyways, you got a lot of that out of your system. When you when you got into vending, what was it about vending that tickled that part of your brain that like satiated that part of your curiosity?\r\n\r\n\r\nEthan Kohan (17:00.28)\r\nThank you. I appreciate it.\r\n\r\n\r\nEthan Kohan (17:08.91)\r\nWell, actually there's a bridge to how I got into bedding. Let me explain that bridge as well. It also includes hustling, right? So after all the bedding stuff, You know, this is like first semester, second semester, sophomore year of college. And one of my friends was selling these Ju-Pods to kids in his dorm. And I was like, damn, that's actually kind of a good idea because everyone was using these products. Hot, right? And there was...\r\n\r\n\r\nright down frat row, like a two minute walk, there was this Circle K, right? There's a Circle K, of course, yeah, best location they made bank. And it's still there today. And everyone bought Juul pods from there. I was like, God damn, I want to make this more convenient for people. And I was like, what if I just started selling Juul pods to kids in my fraternity, plus all the other groupies I was in with the other fraternities and sororities, because my network was really good.\r\n\r\n\r\nNikolas Hulewsky (17:43.944)\r\nOf there was.\r\n\r\n\r\nNikolas Hulewsky (18:05.576)\r\nWhat's a group mean? don't know what that is.\r\n\r\n\r\nEthan Kohan (18:07.374)\r\nFor me in college, it's like, it's this app, Microsoft actually owns it, where you can like massive chats with like 150 different people, right? It can hold that.\r\n\r\n\r\nNikolas Hulewsky (18:11.135)\r\nokay.\r\n\r\n\r\nHmm. And, and I'm an idiot jewel. Do you like smoke it? Is it the vaping stuff? I\r\n\r\n\r\nEthan Kohan (18:20.782)\r\nIt was like the really popular vapes. They had the device. You could charge it with like a USB and then you just put like the external pods in it and then you just vape. Yeah, I never used those products. I never understood it. I never liked it. You don't get higher on your own supply. That's another thing.\r\n\r\n\r\nNikolas Hulewsky (18:36.696)\r\nmy gosh, bro, what? How did you get sucked into the world of gambling, tobacco, addictive substance? Like, my gosh, all the vices man.\r\n\r\n\r\nEthan Kohan (18:42.83)\r\nSo people ask, I was like, I reached out to like suppliers on eBay, because obviously I don't have a license to sell this thing retail, but I just found some suppliers on eBay. I found one that would work with me, sell me products for nine bucks a unit. I'd sell them for 20. So it's all 55 % margin and I'd have them in my backpack.\r\n\r\n\r\nI literally meet people in the library and I give it to them and then they just Venmo me people and then within like two weeks. I was a dealer, but I was a dealer, but it was legal. It was legal because everyone was 18 plus. So I just wasn't paying taxes. So it legal.\r\n\r\n\r\nNikolas Hulewsky (19:18.566)\r\nYou're a dealer. Holy crap.\r\n\r\n\r\nNikolas Hulewsky (19:29.705)\r\nmy god. Where did you grow up?\r\n\r\n\r\nEthan Kohan (19:35.355)\r\nin LA. Screw open.\r\n\r\n\r\nNikolas Hulewsky (19:37.106)\r\nBro grows up in Beverly Hills, West LA, moves to Miami, becomes a, first he becomes a degenerate gambler, then a bookie, then a drug dealer.\r\n\r\n\r\nEthan Kohan (19:46.702)\r\nNo, not drugs. Vape dealer, vape dealer, vape dealer.\r\n\r\n\r\nNikolas Hulewsky (19:50.318)\r\nyou're selling jewels is not the that's what okay let me say drugs it sounds better they becomes a truck dealer and then and then you're like walking around doesn't it's kind of tiring i don't like all these jewels in my backpack why don't i just get a vending machine\r\n\r\n\r\nEthan Kohan (20:06.254)\r\nPretty much, pretty much. So some of these are in backpack and kids in other fraternities were texting me random numbers and I was like, hey, I heard you're the pod plug. And I was like, damn, that kind of has a nice ring to it.\r\n\r\n\r\nNikolas Hulewsky (20:09.32)\r\nIt's incredible. It's incredible.\r\n\r\n\r\nNikolas Hulewsky (20:21.82)\r\nHmm. Okay. Wait, and pod is on your shirt, right? Is this your company still?\r\n\r\n\r\nEthan Kohan (20:27.822)\r\nLook, that's the name of my company. We'll get there in a sec. So they named me basically and I was like, yeah, I guess I am. I was selling like a bunch of these a day and I was making like 250 bucks a day in profit. And I was like, holy shit, this is going so well. I reached out to 15 of my other friends in different universities and 12 of the 15 said, I'm in. I was like, I shipped them the inventory. We'd split the profits.\r\n\r\n\r\nNikolas Hulewsky (20:30.566)\r\nmy gosh.\r\n\r\n\r\nNikolas Hulewsky (20:45.8)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (20:52.84)\r\nWhat the freak?\r\n\r\n\r\nEthan Kohan (20:54.19)\r\nThey'd sell it to kids in their fraternity. Dude, I was tracking these things on just a spreadsheet, right? Just on Excel. And I was making $750 a day in profit, pure profit, not revenue. This is like end of sophomore year, yeah. And I was like, wow, this is going too well right now. yeah, Venmo me every week. There were some markets that even had arbitrage, right?\r\n\r\n\r\nNikolas Hulewsky (21:08.648)\r\nThis is sophomore year.\r\n\r\n\r\nNikolas Hulewsky (21:18.076)\r\nWhat the freak?\r\n\r\n\r\nEthan Kohan (21:23.534)\r\nSo like, was selling it to my friends, I was selling it to my friends. I had a friend who went to UPenn. was in Warden, right? Genius. Studying finance. And he was one of my salespeople. And he was selling them for like 22 bucks a unit. So it was a $13 profit, $6.50 each, right? And then my friend went to USC, where you went to, right? Come on, baby. My dad went there. And he was selling them for $26 a unit because...\r\n\r\n\r\nNikolas Hulewsky (21:30.536)\r\nOkay. Okay.\r\n\r\n\r\nNikolas Hulewsky (21:45.714)\r\nFight on.\r\n\r\n\r\nEthan Kohan (21:53.248)\r\nObviously people at USC have more money, right? They can afford it. So the arbitrage was incredible, right? And we just split the profits. I was honest with how much I told them that I'd buy them at, and it was going very well. And I thought,\r\n\r\n\r\nNikolas Hulewsky (21:59.346)\r\nGosh.\r\n\r\n\r\nNikolas Hulewsky (22:07.208)\r\nSo you got to, you were doing $22,000 a month in profit.\r\n\r\n\r\nEthan Kohan (22:11.05)\r\nI basically did that for like another month. Yeah. I did it for another month and I was like, okay, I need to somehow make this legal. So I thought, what if I can automate this through a vending machine? I just typed vending machine suppliers, right? In the United States. And I called like 20, found one that would work really closely with me and do like, you know, custom configuration with a credit card reader, no cash, no coins, app, all that.\r\n\r\n\r\nNikolas Hulewsky (22:13.181)\r\nSim.\r\n\r\n\r\nNikolas Hulewsky (22:16.602)\r\nmy gosh.\r\n\r\n\r\nNikolas Hulewsky (22:36.753)\r\nRight, right.\r\n\r\n\r\nEthan Kohan (22:38.69)\r\nfix the coils in the machine to make sure it fits the Juul pods. And I was like, I'm putting this in my frat house. Reach out to the owner of the frat house. He said, let's do it. Spoke to the president of the frat house, who was my friend. He said, let's do it. It would make it more convenient so people don't have to go to the Circle K. Sorry Circle K, I know I took some business from you. That's for like a month or two, right? I get this machine, put it in the frat house. It's now beginning a junior year.\r\n\r\n\r\nNikolas Hulewsky (22:56.712)\r\nBro's doing drug deals in the Circle K parking lot in Miami. my gosh, I love it.\r\n\r\n\r\nEthan Kohan (23:08.332)\r\nRight? And the machine does four grand in its first month.\r\n\r\n\r\nNikolas Hulewsky (23:15.154)\r\nKate, how much how much money did you make like, are you lost 20 grand gambling and then you started sports book you make 20 grand back? How much more did you make until you started that?\r\n\r\n\r\nEthan Kohan (23:23.202)\r\nSo, I'm sitting under like 25K basically until I did the vending. I ended up getting three machines, one in my frat house and one in two other frat houses on campus. Get ready for this. The last day of school was called senior sendoff, right? Whenever the seniors, it's the last day. They had a massive party at the house. They got a, senior got a chair, a bunch of people, like 16 frat kids in my fraternity, Sigma Chi by the way, right? Crazy kids.\r\n\r\n\r\nNikolas Hulewsky (23:34.378)\r\nmy gosh.\r\n\r\n\r\nNikolas Hulewsky (23:41.266)\r\nYeah, yeah,\r\n\r\n\r\nEthan Kohan (23:52.974)\r\nThey video cameras all their phones recording and they smash the glass of the machine Everyone goes in all like crazy frat kids, right? They steal all the glass shatters They steal all the products in the machine people are going crazy like my god, three babes three babes they're going wild and guess what? The video goes viral it gets three million views on\r\n\r\n\r\nNikolas Hulewsky (23:54.128)\r\nEarly.\r\n\r\n\r\nEthan Kohan (24:20.302)\r\nIt was like a pre-barstool company called Total Frat Move. had a few million followers on Instagram. Someone sent it to them, went viral. I look at the video, because I wasn't there at the time. I look at the video and I'm like, holy shit. First of all, I was pissed. And then second of all, I saw my DMs and I had like over 105 DMs. And I was like, oh my God, this is like an opportunity.\r\n\r\n\r\nNikolas Hulewsky (24:46.217)\r\nSo what were the DMs? Why were people DMing you?\r\n\r\n\r\nEthan Kohan (24:47.854)\r\nSo the DM was like people in other fraternities and other universities saying this is genius. Can I get one from my house? Also, I know some bars on campus that would do extremely well if this was in there. It would crush it. I'm friends with the owner.\r\n\r\n\r\nNikolas Hulewsky (25:01.202)\r\nSo you didn't stage this video. This video happened organically.\r\n\r\n\r\nEthan Kohan (25:03.98)\r\nAnd guess what? I wasn't even there. I was studying abroad in Barcelona that semester and my friend sends it to me and I'm like, my God. First of all, the guy who broke it was like a billionaire. So he paid me back like four grand for the inventory and the machine. So that was like a quick Venmo. And then, yeah.\r\n\r\n\r\nNikolas Hulewsky (25:21.96)\r\nSo you went from pissed probably because you're like, what the freak? They freaking broke my machine. When did you switch to like, holy crap, this is actually amazing.\r\n\r\n\r\nEthan Kohan (25:30.974)\r\nliterally right after that video and getting all the DMs. Those DMs basically told me that I have a business under my belt. I was like, I was thinking of ideas like, I patent this idea? Like, this is my baby, you know?\r\n\r\n\r\nNikolas Hulewsky (25:42.322)\r\nWhat was patentable? Just that you had a vending machine that sold jewels? okay, okay.\r\n\r\n\r\nEthan Kohan (25:45.454)\r\nI was young. I was like 20 at the time. was like, can I patent this? Obviously, an Dean, right? I spoke to patent attorney. I paid him like a few grand to do research. He was like, listen, it's not patentable. I was like, But I had my ID under my belt and I ended up getting 10 new locations locked in within two weeks of talking to the presidents of these frat houses. I ended up ordering all those machines with the rest of the money that I had in cash and\r\n\r\n\r\nNikolas Hulewsky (25:50.894)\r\nYeah, yeah, yeah, yeah.\r\n\r\n\r\nEthan Kohan (26:14.786)\r\nWe ended up getting machines at Ohio State University, West Virginia University. I didn't even know that existed. Like Syracuse in New York, University of FSU in Florida, like U of A in Arizona. was crazy. And I just, the guys, these.\r\n\r\n\r\nNikolas Hulewsky (26:33.042)\r\nSo you just started using the fraternity distribution as where you're placing these machines.\r\n\r\n\r\nEthan Kohan (26:38.936)\r\nYes. Yes. I am so bullish, like to this day, on utilizing a campus ambassador program or some sort of like fraternity distribution as like the perfect hub and spoke model if there's something you want to sell within that market. I'm so bullish on it.\r\n\r\n\r\nNikolas Hulewsky (26:57.22)\r\nYeah, Chris and I, we have a podcast every Friday that we like brainstorm and one of our favorite frameworks is is piggybacking. So the idea is you're looking for something that already has distribution and then you're just piggybacking on top of it. This is you looking at fraternities and be like, are distributions here? How can I piggyback on top of it? a lot of people start with the product where they're like, I've got this really cool app idea. And they don't even think about distribution. I like to work my way backwards where it's like, I know this guy who\r\n\r\n\r\nEthan Kohan (27:12.568)\r\nYes.\r\n\r\n\r\nYep. Yeah, exactly.\r\n\r\n\r\nNikolas Hulewsky (27:27.496)\r\nhas all these Walmart connections. How could I use that relationship to launch a business?\r\n\r\n\r\nEthan Kohan (27:31.842)\r\nYeah. A C product with A plus distribution is better than an A plus product with C distribution. Hands down. Hands up. Right? That's how Morning Brew also blew up with their daily newsletter. They literally just went into classrooms in campuses and used those as distribution networks. The hub and smoke model, same thing I did.\r\n\r\n\r\nNikolas Hulewsky (27:39.622)\r\nYeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (27:56.102)\r\nLet me ask you this, how were your grades?\r\n\r\n\r\nEthan Kohan (27:59.79)\r\nI graduated with a 3.7, so not bad. Yeah.\r\n\r\n\r\nNikolas Hulewsky (28:02.982)\r\nWow, you did all you did all this and we're still maintaining like a minus GPA. What was your degree?\r\n\r\n\r\nEthan Kohan (28:07.756)\r\nYeah, yeah. So it was a double major actually in finance and real estate.\r\n\r\n\r\nNikolas Hulewsky (28:15.577)\r\nman, not like you were majoring in political studies or something.\r\n\r\n\r\nEthan Kohan (28:17.186)\r\nYeah. No, and I was going the whole, the account minor and accounting route. And I was like, at the end of my senior year, I was like, don't have time for this. No accounting. So just dropped the accounting minor, but.\r\n\r\n\r\nNikolas Hulewsky (28:21.917)\r\nhuh.\r\n\r\n\r\nNikolas Hulewsky (28:26.376)\r\nWhy did you go away from, so you could have still used the fraternity as a distribution. Why did you go away from individuals selling the dual pods and go all in on, let's just place vending machines at these locations?\r\n\r\n\r\nEthan Kohan (28:41.218)\r\nI wanted a way to automate it and actually track revenue and potentially just like build a business that's legal. I didn't think you'd scale.\r\n\r\n\r\nNikolas Hulewsky (28:47.356)\r\nHmm. Well, well, why do you say illegal? What like what? Why do you keep saying that?\r\n\r\n\r\nEthan Kohan (28:52.878)\r\nwell actually like registering as, you know, an LLC and paying taxes. Yeah. I feel like couldn't fully do that with like just selling by hand.\r\n\r\n\r\nNikolas Hulewsky (28:58.608)\r\nOkay. Okay. Okay.\r\n\r\n\r\nNikolas Hulewsky (29:04.2)\r\nYeah, because then you would have had to rely on these guys to tell you how many they sold at what price.\r\n\r\n\r\nEthan Kohan (29:07.084)\r\nYeah, exactly. All the transactions would be like through Venmo and like the taxation through that. I'd rather just credit card reader, toss this in the account, drop it in every week and then pay taxes on\r\n\r\n\r\nNikolas Hulewsky (29:11.719)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (29:19.568)\r\nI mean, you could have still maybe you did this, but was the did the model turn from okay, I have the guy who's selling them out of his backpack. Now I have the guy who's managing the vending machine. Is that what it turned into? Wow.\r\n\r\n\r\nEthan Kohan (29:31.662)\r\nBasically, yep. So yeah, that fraternity member, right, basically was the one restocking the machine. Some of the frat houses, they requested like a five or 10 % of sales revenue as commission. Yeah, it's worth it. It's fine. I was still doing like a 60 % gross margin. So my net after everything was like 40%, which is still amazing. We had this one machine at Ohio State University. This is gonna blow your mind.\r\n\r\n\r\nThey had a tailgate almost every week or every other week, right? Put on a senior off-campus frat house, okay, that threw all the tailgates. The machine was doing $6,700 per month in revenue.\r\n\r\n\r\nNikolas Hulewsky (30:02.909)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (30:16.07)\r\nRemind me how much did the Juul pods cost?\r\n\r\n\r\nEthan Kohan (30:18.894)\r\nlike $9 a unit.\r\n\r\n\r\nNikolas Hulewsky (30:20.968)\r\nOh my gosh, there's like almost 700 jewel units a month.\r\n\r\n\r\nEthan Kohan (30:24.758)\r\nIt was crazy. And we actually shifted a little bit. The time there was this other competitor called puff. It was a disposable thing. It was like kind of eating jewel and those are selling like hotcakes. They're like 10 to 12 bucks a unit. You have the device and then you have the cartridge. You got to buy them separately. so this other company came in it was just a disposable device that had everything all in and they were like 12 bucks a unit. We'd buy them for like four bucks. So we had.\r\n\r\n\r\nNikolas Hulewsky (30:31.879)\r\nUh-huh.\r\n\r\n\r\nNikolas Hulewsky (30:37.009)\r\nAre these jewels like cartridges that you were buying and you have like a vape pen or something?\r\n\r\n\r\nNikolas Hulewsky (30:44.21)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (30:52.966)\r\nIt's literally the razor razor blade model. Holy balls.\r\n\r\n\r\nEthan Kohan (30:55.21)\r\nNo, literally. And those are still popular to this day, that type, the disposable vape, So, yeah.\r\n\r\n\r\nNikolas Hulewsky (31:02.28)\r\nBy the time you graduate, that's insane, $6,700 a month, just mind-boggling. By the time you graduated, how many machines did you have placed and how many different universities?\r\n\r\n\r\nEthan Kohan (31:06.942)\r\nit's nuts. It's nuts.\r\n\r\n\r\nEthan Kohan (31:13.454)\r\nSo let's talk about right before I graduated because I graduated in 2020. We all know why. But after we were gaining ground with all these machines in our frat houses, one of my friends who went to UT Austin was like, why don't you put them in bars? He was like, I'm friends with a bar owner. He introduced me to the bar owner. The bar owner had seven bars. He was like, I want a machine in all seven of my bars. And I was like,\r\n\r\n\r\nNikolas Hulewsky (31:19.398)\r\nNo. Okay, okay.\r\n\r\n\r\nEthan Kohan (31:42.99)\r\nHeck yeah, I'm down. So what I had to do was I had to hire someone to actually stock machines. Cause now we're getting a little bit more corporate. We're going beat down. And I had, I went on indeed and I found like a vending machine route driver who just stock the machines. We track everything on an inventory tracking system. pay him 20 bucks an hour to do it.\r\n\r\n\r\nNikolas Hulewsky (31:45.948)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (31:52.028)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (32:03.821)\r\nWhat was the inventory tracking system? What were you using?\r\n\r\n\r\nEthan Kohan (32:05.838)\r\nIt's called NIACS. It's like a vending machine inventory tracking system. It's an Israeli company. They're a FinTech Yeah, still use it to this day. There are these yellow credit card readers. You've probably seen them on vending machines. They're the most popular ones probably in the world. Yeah. So was tracking everything through there and Austin was going well. Each machine was averaging about $2,000 a month in revenue. So it's pretty solid, going well.\r\n\r\n\r\nNikolas Hulewsky (32:08.146)\r\nSo you still use it?\r\n\r\n\r\nNikolas Hulewsky (32:14.63)\r\nYeah, for sure. Okay.\r\n\r\n\r\nNikolas Hulewsky (32:28.656)\r\nAnd we buying all these machines cash or did you finance them?\r\n\r\n\r\nEthan Kohan (32:33.208)\r\nSo was buying them all cash until I needed a few more machines. So I just got a family and friends loan.\r\n\r\n\r\nNikolas Hulewsky (32:39.12)\r\nAnd how much do they cost? how much did a typical machine cost?\r\n\r\n\r\nEthan Kohan (32:41.664)\r\nEach machine, like all in, three grand.\r\n\r\n\r\nNikolas Hulewsky (32:44.648)\r\nOkay, so it's not terrible, but still how many machines did you have?\r\n\r\n\r\nEthan Kohan (32:45.922)\r\nNo, I them refurbished. I literally got these 1995 refurbished vending machines and I basically slapped a credit card reader on them, got rid of the Bill Exceptor coin mech. I added a new control board, new motors and everything. So everything on the inside was basically pristine brand new. Just the shell was old and I can get like a 70 % discount on the equipment.\r\n\r\n\r\nNikolas Hulewsky (33:04.764)\r\nWow. OK, how many machines at its peak did you have?\r\n\r\n\r\nEthan Kohan (33:11.182)\r\nAt its peak, about 126 machines.\r\n\r\n\r\nNikolas Hulewsky (33:15.112)\r\nGuess you had 126 machines, three grand a pop. So we're talking about what is that? $5 million? Am I wrong? No, that's way off $500,000.\r\n\r\n\r\nEthan Kohan (33:22.966)\r\nNo. About 500k. Yeah.\r\n\r\n\r\nNikolas Hulewsky (33:27.048)\r\nOkay, so you were $500,000 into these machines and you were like, hey, business is booming, man. We got more than we know.\r\n\r\n\r\nEthan Kohan (33:32.482)\r\nYeah, got some friends and family loans. I'm very lucky. And business was booming and\r\n\r\n\r\nNikolas Hulewsky (33:40.336)\r\nOf the 150, sorry, how many were in the bars and how many were at universities?\r\n\r\n\r\nEthan Kohan (33:45.902)\r\nSo it was about 50-50. At one point, Nick, we were in 31 cities and I'll get there how we got there. I was like, this frat stuff is going to be amazing for like the hub and smoke model. I reached back out to Total Frat Move, the company that randomly posted the video that got 3 million views, right? I reached out to them doing a campaign. I paid them literally five grand, right? To do a campaign over two weeks across all their social platforms. So like over 5 million impressions, right?\r\n\r\n\r\nNikolas Hulewsky (33:57.234)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (34:03.644)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (34:12.712)\r\nOkay.\r\n\r\n\r\nEthan Kohan (34:15.054)\r\nThe whole goal was to do a campus ambassador program, right? So basically you can earn up to $500 if You know a bar owner or a bar manager and you can help place make an introduction on my behalf So we could place a machine in the bar and if the bar gets a machine I give you five. I'll then mo you 500 bucks Right and every student loves a nice $500. It's a lot of money for a student, right? a lot and\r\n\r\n\r\nNikolas Hulewsky (34:19.772)\r\nYeah, makes sense.\r\n\r\n\r\nNikolas Hulewsky (34:36.274)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (34:41.426)\r\nYeah.\r\n\r\n\r\nEthan Kohan (34:44.686)\r\nthey basically ran that campaign. It was a little mixture of cash plus commission off of every deal that we closed. But we ended up getting over 1,000 applicants in two weeks. This is now second semester of my senior year in college.\r\n\r\n\r\nNikolas Hulewsky (35:02.182)\r\nTell me the month and day or month and year.\r\n\r\n\r\nEthan Kohan (35:04.878)\r\nThis was January of 2020. January 6th of 2020 is when we ran this. I'll never forget the date.\r\n\r\n\r\nNikolas Hulewsky (35:11.536)\r\nOkay. on the day of the insurrection, you're just like,\r\n\r\n\r\nEthan Kohan (35:16.616)\r\nyeah, literally.\r\n\r\n\r\nNikolas Hulewsky (35:18.472)\r\nAnyway, sorry, keep going.\r\n\r\n\r\nEthan Kohan (35:21.734)\r\nAnd it was crazy. They basically promoted this campaign on all their socials. We got a thousand applicants in 10 days on a Google Sheet. They just created a co-branded page, Total Fratmove X Pod Plug. And it was a nice landing page. Ask for their name, email, phone number, what school they went to, what frat they're in, or sorority they're in, who they know, are they friends with any bar owners, bar managers.\r\n\r\n\r\nNikolas Hulewsky (35:33.852)\r\nYeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (35:47.848)\r\nthis wasn't just like, hey, I'm interested in this. This was, know a bar owner.\r\n\r\n\r\nEthan Kohan (35:50.67)\r\nNo, was, yes. We want to make sure that this person already has a connection. High quality. Let's get high quality leads so we can get really warm intros. Right.\r\n\r\n\r\nNikolas Hulewsky (35:53.97)\r\nWow, high quality, yeah.\r\n\r\n\r\nEthan Kohan (36:01.902)\r\nOut of a thousand applicants, I had to almost cold call every single one and was making a hundred cold calls a day. I was eating one meal a day at the food court. The same, it was a place called Pollo Tropicall. I got two chicken breasts with a side of beans. That's all I had every day. I ate in like five minutes. I went back to calling. I was eating one meal a day. I probably lost like 10 pounds that month. It was crazy.\r\n\r\n\r\nNikolas Hulewsky (36:25.852)\r\nDid you get through all thousand?\r\n\r\n\r\nEthan Kohan (36:27.598)\r\nI got through all a thousand in 10 days. I recruited 52 of them. So it was a 5 % acceptance rate. And in hindsight, I probably should have done it differently because I ended up doing like one-on-one calls with all of them on how to train them on how to pitch it. Instead of doing a call, it was ridiculous. It was ridiculous. Yeah. It was not scalable, but like sometimes you got to do stuff that doesn't scale. I wanted to develop a personal relationship with all of them. That's why I did that. Right. And I did.\r\n\r\n\r\nNikolas Hulewsky (36:33.616)\r\nWow. Okay.\r\n\r\n\r\nNikolas Hulewsky (36:45.492)\r\nmy gosh, 50 one-on-one calls?\r\n\r\n\r\nEthan Kohan (36:57.13)\r\nAnd out of those 52 people, they ended up getting me over 100 contracts signed within like a month. With bar owners. Crazy.\r\n\r\n\r\nNikolas Hulewsky (37:07.496)\r\nSo you're looking at this and you're like, okay, hold on a second. If I get a hundred bar, what was the average revenue per machine?\r\n\r\n\r\nEthan Kohan (37:13.612)\r\nThe average revenue per machine was about two grand a month.\r\n\r\n\r\nNikolas Hulewsky (37:16.04)\r\nOkay, two grand a month. right, I get a hundred bar owners. I'm looking at 200 grand a month with these machines. What was, what was net of, of the two grand?\r\n\r\n\r\nEthan Kohan (37:20.386)\r\nYeah. Net was like 38, 40%.\r\n\r\n\r\nNikolas Hulewsky (37:26.952)\r\nOkay, call it 40 % $800 a month net. So you're like 80 grand a month.\r\n\r\n\r\nEthan Kohan (37:32.458)\r\nMachines get paid back in four months.\r\n\r\n\r\nNikolas Hulewsky (37:34.696)\r\nYeah, you're like, okay, 80 80 grand a month in profit. just I have these signed contracts. I'm gonna make an 80 grand a month in profit. I'm in my second semester of my senior year. And by the time I graduate, I'm gonna have 80 grand a month coming into my bank account.\r\n\r\n\r\nEthan Kohan (37:46.86)\r\nYeah, so we ended up ordering like 85 vending machines from our supplier. That's when he got the loan from friends and family to fund those machines.\r\n\r\n\r\nNikolas Hulewsky (37:51.529)\r\nmy gosh.\r\n\r\n\r\nNikolas Hulewsky (37:55.388)\r\nSo that was what, a $250,000 loan probably.\r\n\r\n\r\nEthan Kohan (37:58.162)\r\nYeah, exactly. And we ended up immediately, overnight, becoming the biggest customer for our vending machine supplier. And they had to hire four new people on their factory assembly line to pump out 15 vending machines per week. Yeah, it was crazy. Exactly. It was all because of us.\r\n\r\n\r\nNikolas Hulewsky (38:19.378)\r\njust to meet the demand that you're replacing.\r\n\r\n\r\nWhen did you? OK, what was the date that you like placed these orders?\r\n\r\n\r\nEthan Kohan (38:26.587)\r\nthis was like mid-February.\r\n\r\n\r\nI know, I know. And then we ended up placing about 30 of them, right? Everything going well, but going well revenue wise, operationally was kind of a nightmare because many of these like kids stocking the machines, I'm sure they were stealing stuff and it was tough. It was a tough operation, right? In hindsight, I wish I just would have had 20 vending machines in one city than having a hundred vending machines in 40 cities. I mean, it's way easier. But...\r\n\r\n\r\nNikolas Hulewsky (38:42.908)\r\nI'm sure.\r\n\r\n\r\nNikolas Hulewsky (38:56.434)\r\nRight.\r\n\r\n\r\nEthan Kohan (39:00.546)\r\nThen COVID happened in March and 80 % of the locations basically shut down and said like, I can't get these machines, can't take them. And I couldn't reverse the order from our factory. I paid for all these dams and I was freaking out.\r\n\r\n\r\nNikolas Hulewsky (39:13.959)\r\nWow. Because what was the lead time? you place it you place an order in there like, we'll have this fulfilled in 60 days.\r\n\r\n\r\nEthan Kohan (39:20.268)\r\nand like, no, it like three to four weeks.\r\n\r\n\r\nNikolas Hulewsky (39:23.77)\r\nmy gosh. Yeah, and during COVID is like a lot changed in a three to four week period of time.\r\n\r\n\r\nEthan Kohan (39:24.408)\r\nfor weeks, yeah.\r\n\r\n\r\nEthan Kohan (39:28.494)\r\nAll changed of the bars in Austin like one of the bars even Put the machine in an alley and just left it there because they closed out They've literally put the machine in the freaking alley my mission\r\n\r\n\r\nNikolas Hulewsky (39:41.256)\r\nWhat did you do? okay, you've placed 30, you've got another 50 in delivery.\r\n\r\n\r\nEthan Kohan (39:44.428)\r\nI was like, I was like threatening to like sue him. was like, that's ridiculous. was, what? was going to take it to small claims court. It's not worth my time. It's not worth my time.\r\n\r\n\r\nNikolas Hulewsky (39:53.576)\r\nWell, you had like a hundred instances of small claims court, right? Cause you had all these machines.\r\n\r\n\r\nEthan Kohan (39:55.64)\r\nYeah, was awesome. All these machines. So what we had to do with most of the machines, fortunately we recovered, but we have to ship them all to Texas because that's where the frats weren't. It was more of a trustworthy market in Austin and we had a few machines in Dallas and we shipped them all to Austin and Dallas. And that became our model. Just focus on bars. Texas didn't fully close, right? They closed maybe for a couple of weeks, but then they reopened real quick. They didn't really believe in masks.\r\n\r\n\r\nNikolas Hulewsky (40:20.2)\r\nMm-hmm.\r\n\r\n\r\nEthan Kohan (40:25.09)\r\nThat was our market that we basically started growing in. Austin, got to like eight machines, we got like eight to 10 machines. And then Dallas just blew up.\r\n\r\n\r\nNikolas Hulewsky (40:34.728)\r\nI was waiting on the like, then we took a bath and declared bankruptcy, you really\r\n\r\n\r\nEthan Kohan (40:38.542)\r\nI was really close. basically laid off everybody who was stocking them our machines and I had to fly to Texas myself for a full month, Austin and Dallas. I rented some like really crappy small car. I had like boxes of like 12 boxes of inventory in the trunk of just all these different products. And I was staying at like holiday inns and I was like schlepping these boxes into like my unit and each holiday in was like my warehouse. And I was stocking all the machines myself.\r\n\r\n\r\nNikolas Hulewsky (40:48.168)\r\nMm-hmm.\r\n\r\n\r\nEthan Kohan (41:07.47)\r\nI'd go to the machines, I'd clean them, I'd stock them, I'd test them, I'd fix them all myself for like a month. I had to be as scrappy as possible to save money because revenue basically went from at our peak in February of 2020, we were 80,000 a month in revenue, and then to like four grand a month in revenue.\r\n\r\n\r\nNikolas Hulewsky (41:27.56)\r\nAnd did you finance these machines or did you pay cash for them?\r\n\r\n\r\nEthan Kohan (41:30.798)\r\nA mixture of both. A mixture of both.\r\n\r\n\r\nNikolas Hulewsky (41:32.68)\r\nOkay, so you had some overhead, had some debt payments that you were needing to make every single month.\r\n\r\n\r\nEthan Kohan (41:36.174)\r\nFortunately, there were good interest rates, like 5%. And then the initial ones, we paid cash. So it was a tough look.\r\n\r\n\r\nNikolas Hulewsky (41:45.212)\r\nWow, man.\r\n\r\n\r\nhow long did it take you to place all of them?\r\n\r\n\r\nEthan Kohan (41:51.406)\r\nyou\r\n\r\n\r\nTo this day, we still didn't place all of those 80 because we ended up shifting instead of like the traditional snack and drink machine, like machines that we had before, we ended up getting a smart touchscreen high-tech vending machines that we put in bars and clubs and their touchscreen and you could put them on the walls. So these bar owners were like, I want something smaller, lower profile, that's slicker. And I thought, wow, let's start sourcing some.\r\n\r\n\r\nfrom these machines. we partnered with a factory in China and same price basically as those other machines.\r\n\r\n\r\nNikolas Hulewsky (42:29.586)\r\nSo you kind of looked at the situation and you're like, all right, everything's shutting down. Universities are not open. The model was already messy because you had to manage all of these young kids, essentially. You don't see a timeline for these schools reopening, so it's not like you're gonna be seeing demand. And that forced you to like pick, okay, let's go to nightclubs, like nightclubs and bars.\r\n\r\n\r\nEthan Kohan (42:40.536)\r\nYeah, it was nice. Yeah.\r\n\r\n\r\nEthan Kohan (42:52.75)\r\nSo that and another thing back in like 2019 or 2020, Trump changed the law for like nicotine products to be 21 plus in the U S that's also another reason why we couldn't do frats anyway, which is fine. The model was messy. Anyway, it was a good proof of concept to start there.\r\n\r\n\r\nNikolas Hulewsky (43:03.483)\r\nMmm...\r\n\r\n\r\nSo you went out of it. Yeah.\r\n\r\n\r\nNikolas Hulewsky (43:12.018)\r\nDude, what a story. I'm sure there's like even way more to it. Let's fast forward to today.\r\n\r\n\r\nEthan Kohan (43:19.468)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (43:21.648)\r\nYou set the stage, you lay a foundation, start with Texas. How many machines do you have now? How big are your operations now?\r\n\r\n\r\nEthan Kohan (43:28.76)\r\nSo we scaled down a lot actually so we could focus on actual operations. So now we're at about 70 machines doing about 86k a month in revenue, but it's a much more structured operation.\r\n\r\n\r\nNikolas Hulewsky (43:44.112)\r\nWhich and what's your bottom line off of like 86,000?\r\n\r\n\r\nEthan Kohan (43:48.076)\r\nBefore overhead, let's just say like unit economics, permission, right? Because this is economics, so got to talk unit economics. About gross margins, about 70 % gross. Net margin is about 40 % still.\r\n\r\n\r\nNikolas Hulewsky (43:51.516)\r\nGross margins, yep. That's right, dude, that's right.\r\n\r\n\r\nNikolas Hulewsky (44:04.968)\r\nWow, so you're like $30,000-ish a month in that margin.\r\n\r\n\r\nEthan Kohan (44:08.854)\r\nYeah, but then now we have overhead. about to look into this in a second. We're about to franchise the business. We're spending a lot of money on growth whenever it comes to franchising and growing the team. We have a team of 15 people now that are all going to work. Yeah.\r\n\r\n\r\nNikolas Hulewsky (44:21.928)\r\nWhy did you stop growing so much? Okay, get that COVID happened. I get you shifted. But you were growing like crazy. Why did you decide to, like, you're only at 70 now. You had contracts in hand for over 100. Why did you ever-\r\n\r\n\r\nEthan Kohan (44:34.061)\r\nBecause those were all nationwide. It was an operational headache to manage these people remotely. Even our guys in Austin, we had eight machines in Austin, right? Just like about a year ago. And they were doing well, don't get me wrong, but on a Friday, the person who was restocking it, part-time, eight hours a week worker, she worked at 7-Eleven as a merchandiser. She did this part-time for us, paid her well, 22 bucks an hour plus mileage, right? Very good for Texas. That's like 3X the minimum wage. But I got a text from her.\r\n\r\n\r\nNikolas Hulewsky (44:41.906)\r\nMm-hmm.\r\n\r\n\r\nEthan Kohan (45:01.646)\r\non a Friday saying, I got a flat tire, I can't stock the machine. In all our sales, 95 % of our sales happen on Fridays and Saturdays. And that hurt us, that really hurt us. And we lost like four grand in revenue because she couldn't stock the freaking machines. There should be no reason why. We ended up going through five different people to stock our machines in Austin. Everyone gave us issues on commitment and timing and fixing the machines whenever they had issues.\r\n\r\n\r\nLet's say a credit card reader went down, can you check up on it? can't make it until like Friday or Thursday, right? Like you're wasting money, right? We're wasting money. So just, I ended up posting the eight machines on BizBuySell, sold them for 160K. I just got rid of them. So I sold each machine for 20K on location. Obviously I made money. That was nice. So I basically used that money and I was like, okay, the vending business is an owner operated business, especially at the beginning.\r\n\r\n\r\nYou have to be local. You have to be the one stocking at the beginning. And then maybe as you scale, can hire someone to stock it, but you still have to be in that market to at least account manage. You know what I'm saying? We had no account managers. All we did was have people go in the bars, restock and leave. Sometimes I need to say hi to the staff.\r\n\r\n\r\nNikolas Hulewsky (46:15.474)\r\nSo you just consolidated to what, Dallas?\r\n\r\n\r\nEthan Kohan (46:17.582)\r\nYeah, we've literally just hit Dallas and Fort Worth. That's it. And now we have a really nice, sustaining market. We have account managers who care. They get 25 % of the profit of the entire market to stock the machines and do sales as well, grow us. So we made the incentives more aligned, and aligning the incentives made us more profitable. now we don't have any of those issues, right? If, someone gets a flat tire on a Friday,\r\n\r\n\r\nNikolas Hulewsky (46:21.212)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (46:30.408)\r\nMm-hmm.\r\n\r\n\r\nEthan Kohan (46:46.008)\r\nThey'll figure it out. They'll borrow a car from a friend. They'll rent a car. Figure it out. The machine's gonna be stopped.\r\n\r\n\r\nNikolas Hulewsky (46:51.227)\r\nSo you said this, you're launching a franchise, you're franchising this and you've spent the last year, call it two years, whatever, getting your FDD together, spending 200 grand to make sure you have the proper filings and that your operations were in place so that you can bring on franchisees and you can have a good suite of services for them on the backend. Why is this a good franchisable business?\r\n\r\n\r\nEthan Kohan (47:11.662)\r\nExactly.\r\n\r\n\r\nEthan Kohan (47:16.586)\r\nIt's one of the lowest franchises actually you can get into in the world, actually. From a cost perspective, yeah. It's only starting at $25,000 franchise fee. And that's gonna range from like 25 to 45, depending on how big your city is. And this is basically a way to own your own business. Really low cost way to own your business.\r\n\r\n\r\nNikolas Hulewsky (47:21.65)\r\nLike from a cost?\r\n\r\n\r\nNikolas Hulewsky (47:33.832)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (47:42.256)\r\nOK, so you're selling it by territories. You're like, OK, cool. You're in Detroit. You've got Detroit. You've got this whole area. So the plan is if somebody buys the territory, it's not to buy one machine. It's probably to do multiple. Do they have a requirement to have like, if you get a territory, you got to have five machines at least or.\r\n\r\n\r\nEthan Kohan (47:59.726)\r\nSo it's a good question. So let's say Detroit, that's like a tier two city, I'd say, not a massive, massive Metro city like LA, New York, Miami. But I'd say it's tier two. So the franchise fee for tier two city is going to be 35K. And we're going to sell maybe one or two franchises in Detroit. In each franchise, you will have approximately 30 plus machines is our estimation. Obviously it could be more, it could be less, but that's basically what it's to be.\r\n\r\n\r\nNikolas Hulewsky (48:06.952)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (48:25.608)\r\nSo if you got 30 machines, 60 grand a month in revenue, 40 % net margins are going to be somewhere in the ballpark of $24,000 a month of net income. that fair? I know you can't say like, this is what you'll get, right? Because you're franchise or but are those numbers, broadly speaking?\r\n\r\n\r\nEthan Kohan (48:48.174)\r\nYeah, I mean, I'd say according to what we did in 2024 with all our machines in Dallas and Low Earth, our average machine did about $1,100 to $1,200 a month in revenue. So let's say each machine, generally franchised locations do well than corporate locations. That's just statistically. Let's say each machine does $1,200. Again, this is all theoretical. Let's say you have 30 machines. So that's about, let's say,\r\n\r\n\r\nNikolas Hulewsky (49:15.784)\r\n42,000.\r\n\r\n\r\nEthan Kohan (49:16.718)\r\nThat's about 432,000. So at 432,000, you're operating at about, let's say, a 30 % margin, right? After royalties and whatnot. You're doing about 130k a year in cash flow.\r\n\r\n\r\nNikolas Hulewsky (49:33.564)\r\nWow, how much work is that?\r\n\r\n\r\nEthan Kohan (49:34.254)\r\ncash. You could actually hire someone as well. That's also included in the margin. Maybe you can say 28 % margin after hiring someone. 120k a year, you can hire a full-time route driver to stock all your equipment and you're making 120k a year almost passive. I'm not going to say passive, but almost.\r\n\r\n\r\nNikolas Hulewsky (49:50.172)\r\nBut as franchisee, you gotta go out and get the relationships. You gotta place them. You gotta make sure that they're in the...\r\n\r\n\r\nEthan Kohan (49:55.064)\r\nWe actually help you do that as well. We put you in touch with people who can make warm intros on your behalf if you don't have interest, right? Let's say a franchisee is, let's say a liquor sales rep who already has intros in the market, easy. They already have the connections. We'll help you create your lead list for you of all the top bars and clubs in your city. We'll tell you which ones you want to target. We help you with the script. We help you, we train you full four days training. You actually fly to us in Dallas, Fort Worth. We do one day sales training, one day operations training, one day.\r\n\r\n\r\nNikolas Hulewsky (50:22.088)\r\nHmm.\r\n\r\n\r\nEthan Kohan (50:25.198)\r\nsoftware training, one day admin training, right? So we teach you how to run your business and then we fly out to you whenever you get your first location, we help you install and get, we have onsite opening assistance.\r\n\r\n\r\nNikolas Hulewsky (50:28.914)\r\nAnd how\r\n\r\n\r\nNikolas Hulewsky (50:37.0)\r\nHow fast are they supposed to get to that 30? Do they have to spend a bunch of money upfront to buy these machines?\r\n\r\n\r\nEthan Kohan (50:42.201)\r\nYou'll start with three machines. You can either buy the machines from us or you can rent them starting at about $140 a month. You can rent the machines from us. So if you're little lower on cash flow, a little more cognizant on that front, it's really good idea to rent the machines from us, three-year rental, instead of paying, let's say, $3,500 a machine upfront.\r\n\r\n\r\nNikolas Hulewsky (50:45.341)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (50:50.738)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (51:03.496)\r\nBut if somebody came to you and was like, I just want to do 30 right now. Would you tell them no? Or would you say like, yeah, let's do it. okay. You're that confident that you'd be able to like, yeah, there's no learning curve.\r\n\r\n\r\nEthan Kohan (51:06.734)\r\nYeah, let's do it. But I have to vet really well. After have to vet every franchisee, we're going to have only like a 1 to 2 % acceptance rate from all applications that come in because they need to be the perfect ICP, ideal candidate broker. They have to be someone who has minimum 50k liquid in cash. That's the bare minimum.\r\n\r\n\r\nNikolas Hulewsky (51:25.138)\r\nMm-hmm.\r\n\r\n\r\nEthan Kohan (51:33.396)\r\nIt would be a plus, and nice to have, if they already have connections to local bars and clubs. If not, we help you get locations as well.\r\n\r\n\r\nNikolas Hulewsky (51:41.446)\r\nWhat are you selling in the vending machines? it still Jewel or like what are you?\r\n\r\n\r\nEthan Kohan (51:44.122)\r\nSo it's actually completely changed. Now we're like a smart nightlife vending machine company that has basically mini convenience stores in bars and clubs. So we have like disposable cameras, hangover prevention drinks. We also sell Zin. We sell mystery bags, right? We have some like, you know, gay bars in Dallas that want these like naughty items they requested. So we make these like, I won't get into the details, but we make these three bags.\r\n\r\n\r\nNikolas Hulewsky (52:02.301)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (52:08.178)\r\nYeah, yeah, yeah.\r\n\r\n\r\nEthan Kohan (52:13.282)\r\nthat have really good branding, our marketing team is very strong. And we can whip up these mystery bags within weeks. We come up with ideas every month.\r\n\r\n\r\nNikolas Hulewsky (52:20.72)\r\nWhat? What is the like? What are you going to be doing as a franchise or for these franchisees centrally?\r\n\r\n\r\nEthan Kohan (52:28.184)\r\nSo we help them grow, right? The main thing we do is the training and development, right? Full-fledged mentorship, 24-7 support, right? They need anything. Hey, my credit card reader's down, call us. We're gonna answer, 24-7. We have people, right? We help you get locations, right? We teach you how to operate them. You buy the inventory of all our, we have 40 different suppliers because we have like 40 different SKUs now, right? Buy the inventory from us, buy the machines from us.\r\n\r\n\r\nNikolas Hulewsky (52:35.186)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (52:54.62)\r\nRight, right.\r\n\r\n\r\nEthan Kohan (52:58.07)\r\nEverything is set up, ready to go already.\r\n\r\n\r\nNikolas Hulewsky (53:00.914)\r\nWhat about all the back office stuff, accounting, accounts payable, credentialing, contracts, those things?\r\n\r\n\r\nEthan Kohan (53:06.734)\r\nBack end, like bookkeeping, accounting, we have an accounting, we have a bookkeeping partner that has a really good deal for franchisees that has our standard chart of accounts.\r\n\r\n\r\nNikolas Hulewsky (53:15.94)\r\nOkay, so that wouldn't be that wouldn't be included in the franchise royalty fee.\r\n\r\n\r\nEthan Kohan (53:19.734)\r\nNo, bookkeeping is only going to be like couple hundred bucks a month, I'd say.\r\n\r\n\r\nNikolas Hulewsky (53:24.616)\r\nI just never know what's all included in that franchise because I think franchise orders all do it differently,\r\n\r\n\r\nEthan Kohan (53:30.156)\r\nYeah, like our entire CRM system, our resource library, we have tons of training videos, we have continuous innovation, regular product updates, right?\r\n\r\n\r\nNikolas Hulewsky (53:36.36)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (53:40.552)\r\nWhat's your goal for the first year? How many franchises do you want to have?\r\n\r\n\r\nEthan Kohan (53:43.95)\r\nFirst year, we're gonna sell at least 15 franchises, at least. At least. Yep. Yep. I think it could be more, but at the beginning, we wanna start a little slow because we don't wanna overdo it. We wanna get our feet wet and get some operational track record franchising. But we have things in the works already. We're already talking to Barstool about doing a partnership with them, and they want to as well.\r\n\r\n\r\nNikolas Hulewsky (53:47.56)\r\n15, one five. Okay. Why couldn't you do that?\r\n\r\n\r\nEthan Kohan (54:13.036)\r\nSo now we're figuring out like all the franchise college launch markets, because we're launching the college chance first.\r\n\r\n\r\nNikolas Hulewsky (54:18.546)\r\nThat's what I was just gonna ask you, dude. Are you gonna go back to the colleges?\r\n\r\n\r\nEthan Kohan (54:21.24)\r\nFor sure, because the average college machine, the average machine generates three grand a month in revenue. We have five machines in Oxford, Mississippi right now. By the way, that's our only separate market other than Dallas, Fort Worth, because we just kept them. They never closed during COVID, so we kept them. We have five machines there. Each machine is doing $3,500 a month in revenue. So that market is bringing in $17.5K a month in revenue, which is about 20 % of our company's revenue on five machines.\r\n\r\n\r\nNikolas Hulewsky (54:33.563)\r\nOxford, Mississippi.\r\n\r\n\r\nNikolas Hulewsky (54:50.62)\r\nWow. Wow.\r\n\r\n\r\nEthan Kohan (54:51.576)\r\nCrazy. So college machines tend to outperform our general, normal big city machines by 3x.\r\n\r\n\r\nNikolas Hulewsky (54:59.164)\r\nWell, I was I was gonna say it seems like I wasn't a part of a fraternity. I wasn't a part of a fraternity or sorority, obviously. But it would seem like a no brainer. It's like, hey, look, you want extra money to throw cool parties? Place this machine in your frat, and you'll get an extra 1000 bucks a month. And you can do you know what mean? Like, it seems like a no brainer to me.\r\n\r\n\r\nEthan Kohan (55:03.746)\r\nYeah.\r\n\r\n\r\nEthan Kohan (55:12.013)\r\nMm-hmm.\r\n\r\n\r\nEthan Kohan (55:20.91)\r\nExactly. Exactly. And with a franchise, obviously it's going to be your most expensive way of getting into our smart nightlife bending concept, but it's also the highest success rate. And if you want to play it a little safer and if you want to be successful, right? Most franchisees have like an 85, 90 % success rate. So, franchising most likely will lead you to success as opposed to trying this yourself and failing and making mistakes.\r\n\r\n\r\nbecause there lot of mistakes people do take.\r\n\r\n\r\nNikolas Hulewsky (55:53.562)\r\nIs it called Pod Plug franchises or what are you calling it?\r\n\r\n\r\nEthan Kohan (55:57.016)\r\nSo our entity, our current entity is pod, our brand, okay, our brand is pod plug, right? But our new entity is pod plug franchise.\r\n\r\n\r\nNikolas Hulewsky (56:06.536)\r\npodpoked franchise. I love it, dude. my gosh, this was this was not what I thought this conversation is going to be and it was an amazing roller coaster. Thank you. This is Yeah, this is fantastic. I didn't even realize we're at an hour. I gotta stop. I have a I\r\n\r\n\r\nEthan Kohan (56:15.127)\r\nOf course, thanks for having me.\r\n\r\n\r\nEthan Kohan (56:21.225)\r\nThank you.",
  "metadata": {
    "duration": "",
    "date": "2025-03-19",
    "platform_source": "Google Drive"
  }
}