{
  "episode_number": "192",
  "episode_title": "AI SERIES: 16 - Decoding the Tech Stack: What Every Business Owner Needs to Know with Ellie Daw",
  "guest_name": "Ellie Daw",
  "business_name": "Unstuck, Yalla",
  "transcript": "﻿Nikolas Hulewsky (00:01.088)\r\nAll right, Ellie Daw, I'm excited to talk to you, founder of an agency called Unstuck where she, for lack of a better term, is a fractional CTO and then the founder of Yalla, which is a tech company. You are a multiple time founder. You've had multiple tech companies. You started in theoretical cryptography. So you are technically a crypto billionaire. And I think the most interesting thing that you've done is\r\n\r\n\r\nEllie Daw (00:19.852)\r\nMinus the billionaire, yes.\r\n\r\n\r\nNikolas Hulewsky (00:30.41)\r\nover 40 zero to one product builds in your career. So ton of tech experience, ton of knowledge. And what we're talking about today is very simple, very caveman stuff. for me, I contact you because I want to understand there's a lot of people right now who are like, I got to get AI in my business. I got to implement. got to integrate, blah, blah. And they're like me and they're like, I don't even know where to start. Is AI IT? Is AI something different?\r\n\r\n\r\nEllie Daw (00:33.952)\r\nYep. Yep.\r\n\r\n\r\nNikolas Hulewsky (00:57.518)\r\nAnd so this conversation is going to be for those founders and those owners who are trying to figure this out and even just build a vernacular and understanding of what exactly this is. The first part we're going to discuss is what's the difference between IT and real technical help, right? Like a CTO isn't a part of the IT team. Wait a second. I don't know what these words mean. The second part is going to be us talking about, you're getting real technical help. What do you need to know in order to not be taken advantage of?\r\n\r\n\r\nAnd then the third part, I'm really curious to see your new company that you're spinning up called Yala, where you're actually architecting softwares within companies. So that's the three part arc to this. If you're a founder, you want to listen to this conversation, especially if you don't have a ton of tech experience. So here's my very, very first question. Ellie, what's the difference between IT and like a CTO? Aren't they the same thing?\r\n\r\n\r\nEllie Daw (01:26.316)\r\nYeah.\r\n\r\n\r\nEllie Daw (01:51.148)\r\nYes, great question. They are similar. They have a lot of overlapping pieces. And I think maybe one thing just to kind of calm everyone's nerves at the top of this, I know it feels like AI is moving really fast. And I know a lot of people are like, how do I bring it in? Oh my gosh. But I think even sort of speaking from someone deep in the tech world, I think what a lot of the folks even on the front edge are learning is that\r\n\r\n\r\nthe value to the customer is still the top priority. So everyone listening to this, like you already have a story, you already have customers that are getting value from you. Don't like, don't, you know, blow that up just because AI. So start there.\r\n\r\n\r\nNikolas Hulewsky (02:29.11)\r\nYeah, that's a great point. That's a great point. Because there is a lot of anxiety. You're like, well, if I don't do AI right now, my business is going to fail. And then my family is going to go hungry because I went bankrupt. to your point, you've got a business. You're providing value to customers. That's the number one priority. This conversation is just about walking them through like, OK, what's the language? This is like a French 101. We're learning a new language here. Let's start teaching the language around this stuff.\r\n\r\n\r\nEllie Daw (02:39.627)\r\nYes.\r\n\r\n\r\nEllie Daw (02:48.886)\r\nYes, yeah.\r\n\r\n\r\nEllie Daw (02:54.348)\r\nYeah, love it. Okay, so difference between IT and like CTO, like how would I know the difference between an IT person, a CIO and then a CTO. So let's start with the IT person. If you need an IT person, this might be like hooking stuff up in the office. Let me make sure that all of my systems talk together. Let me be sure that my customers can call me. Let me be sure, like let me make sure that everything can operate very smoothly, but I don't need strategic help.\r\n\r\n\r\nWhen it turns to CIO, that's the same kind of operational side of the business, but now you need strategic help or strategic like partnership, right? You might be in a vertical where cybersecurity really matters or you're handling, you know, sensitive data or, I don't know, just, just think about it as like the operating pieces of the business.\r\n\r\n\r\nNikolas Hulewsky (03:44.11)\r\nYeah, you're in health care and you need to protect patient information. CIO would be someone.\r\n\r\n\r\nEllie Daw (03:48.244)\r\nYes, yes. Totally, 100%. Yep.\r\n\r\n\r\nNikolas Hulewsky (03:51.682)\r\nAnd a CIO would be Chief Informatics or Information Officer. Okay.\r\n\r\n\r\nEllie Daw (03:55.018)\r\nYep. Chief Information Officer usually. Yep. And then CTO, Chief Technology Officer. This is usually when you have a software as a service company or maybe your e-commerce or fintech. Your company is software enabled. The value that you are providing is sometimes the software itself, if not just, you know, software enabled in some major way. So you're building, there's custom builds there.\r\n\r\n\r\nNikolas Hulewsky (04:17.794)\r\nYeah, I really like that definition. IT versus CIO versus CTO. I think many people that are listening own small businesses and maybe they've got an IT department, quote unquote, that they usually call off like, I've got the blue screen of death if you have a Windows computer or, I have some ransomware. Actually, that's a terrible one. Hopefully nobody has that. Typically, that's IT to them. And then the only other real\r\n\r\n\r\nEllie Daw (04:32.917)\r\nYeah.\r\n\r\n\r\nEllie Daw (04:39.316)\r\nbe scary yet.\r\n\r\n\r\nEllie Daw (04:44.246)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (04:46.284)\r\ntechie thing that they've ever done is they've built a website and they wouldn't outsourced it. Maybe their cousin did it or whatever. And then maybe they're doing paid ads, but that doesn't feel techie. That feels like marketing. It just seems like tech is becoming more and more ingrained because now with AI, now it's like, okay, I built the website. Now I got to put AI agents in my business. Like it's bleeding into other things like\r\n\r\n\r\nEllie Daw (04:59.371)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (05:12.724)\r\nHow do you kind of draw the line and delineation for a small business owner?\r\n\r\n\r\nEllie Daw (05:12.769)\r\nYeah.\r\n\r\n\r\nEllie Daw (05:17.64)\r\nYeah, that's a really good question. And I, lot of times the marketing side of the business, like that website can kind of morph into like, now I'm a software enabled company because maybe it started just as, you know, a website advertising your services and then turned into like, wait, to make the experience better for my customers. Now I want a customer portal. Okay. Now all of sudden the website needs a way for the customers to log in and maybe they can see the status of their order or whatever it is. But that's, that's kind of turning into the like.\r\n\r\n\r\nNikolas Hulewsky (05:37.688)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (05:43.406)\r\nRight. Or, or there's a lead form on my website and somebody fills out the lead form. Well, now the lead form has to go somewhere. So now I've got to get HubSpot so that I have a CRM that's tracking these leads. And all of a sudden I've got integrations and I'm like, is that a CTO or is that the IT department? You know what I mean? They're just kind of in this no man's land of trying to figure out what do they do?\r\n\r\n\r\nEllie Daw (05:46.506)\r\nthe custom build software.\r\n\r\n\r\nEllie Daw (05:54.816)\r\nYeah.\r\n\r\n\r\nEllie Daw (05:58.177)\r\nYeah.\r\n\r\n\r\nEllie Daw (06:09.172)\r\nYeah. Yeah. And that's a good question too. I think a lot of this comes down to where your long-term goal is on the tech enable side, right? Because if it's a lot of systems integrating together, but you don't necessarily need custom like glue between them or custom software to deliver the services, then maybe CIO is the right role, right? It's like, let me make sure everything hooks together. I have a strategic partner to make sure the data is protected.\r\n\r\n\r\nIf it's genuinely like, five years from now, I want my entire company to like be running as if it were an automation. And I want me and the knowledge in my head and my team to just be able to like plug into the software and do our work faster. That might be CTO territory, right? Like the entire kind of business is transforming and it will have a software component to delivering the services.\r\n\r\n\r\nNikolas Hulewsky (06:51.822)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (07:00.448)\r\nInteresting. In both of those scenarios, are those both tech enabled businesses?\r\n\r\n\r\nEllie Daw (07:06.752)\r\nThat's another good question. Yeah. I think this is another like fuzzy term where people kind of throw it around without there necessarily being like a strict definition. I\r\n\r\n\r\nNikolas Hulewsky (07:07.159)\r\nRight?\r\n\r\n\r\nNikolas Hulewsky (07:17.72)\r\nWell, it just feels, it feels like to me, there are two types of businesses. are tech companies, Google, Facebook. Those are tech companies. They have a software that's their service. And then there are healthcare companies. Those are tech enabled businesses. Like they use technology tech, quote unquote, software bits to operate their business, but they're not tech companies. are tech enabled. So like in my mind, it feels like every business is tech enabled at this point to your, to your point though, like\r\n\r\n\r\nEllie Daw (07:22.794)\r\nYep.\r\n\r\n\r\nEllie Daw (07:33.024)\r\nYeah.\r\n\r\n\r\nEllie Daw (07:44.556)\r\n100%.\r\n\r\n\r\nNikolas Hulewsky (07:46.486)\r\nIt sounds like the delineation between when I bring on a technical expert is when the service that I'm providing is actually something that software enables or delivers as opposed to it just being a part of my business. So healthcare might be, I need a CIO because it's not tech that's delivering the product, but maybe I have a consulting agency and\r\n\r\n\r\nI'm going to build a chat bot or something. And this way customers can actually log in and have chats and get questions answered. That feels to me like, there's, there's now a component of the business that is tech. That's a service offering. I kind of need to see TOS. Would that make sense? Okay.\r\n\r\n\r\nEllie Daw (08:17.888)\r\nMm-hmm.\r\n\r\n\r\nEllie Daw (08:31.212)\r\nTotally. Yeah. Yeah. I think that's a great delineation. And I think it's kind of interesting because the entire, I'm seeing a shift in a lot of startups now where like, I guess the jargon would be, you probably all have heard SaaS, right? Like software as a service. Now you're starting to hear service as a software, right? Where it's like, how can I, it's like flipping the model, right? Like we are all kind of the faces of our business because that human component is really important.\r\n\r\n\r\nNikolas Hulewsky (08:55.064)\r\nHmm.\r\n\r\n\r\nEllie Daw (08:59.948)\r\nAnd now how can I put software behind that to like maybe make myself more efficient, maybe make the experience better for the customer. So yeah, service as a software is kind of interesting.\r\n\r\n\r\nNikolas Hulewsky (09:08.37)\r\ninteresting.\r\n\r\n\r\nYeah, that is very interesting. I think for many people who running these businesses, there's also another term that I've thrown out already, but I like to talk about the tech stack. I feel like that started really in the techie community, but now everybody's sort of adopting it. What the frick is the tech stack?\r\n\r\n\r\nEllie Daw (09:23.627)\r\nMm-hmm.\r\n\r\n\r\nEllie Daw (09:30.602)\r\nYeah.\r\n\r\n\r\nThis is every piece of technology that you use to piece together to either operate or run your software. So if engineers are talking about a tech stack, software engineers, they're talking about what languages they used, what frameworks they used, what services, what APIs they're calling to. Companies as a whole, when they talk about their tech stack, they're talking about marketing tech, right? Like what products are they using to do their marketing?\r\n\r\n\r\nNikolas Hulewsky (10:00.024)\r\nMm-hmm.\r\n\r\n\r\nEllie Daw (10:02.518)\r\nThey're talking about CMS, like content management kind of blogging stuff or CRM. How am I, you know, tracking all of my customer interactions? Yeah.\r\n\r\n\r\nNikolas Hulewsky (10:10.734)\r\nYeah. So, you know, a typical tech stack might be QuickBooks Online, HubSpot, the Google Suite. Maybe that's where you handle all of your emails. Jobber, if you're a home services company that's actually going out, quoting, invoicing, etc. Like it's basically any piece of software that your company's using to run their business, anything you're doing on the computer. And many, many times I feel like businesses don't even manage it. Have you found anything that's good about\r\n\r\n\r\nEllie Daw (10:17.046)\r\nQuick books, yeah.\r\n\r\n\r\nEllie Daw (10:22.24)\r\nMm-hmm.\r\n\r\n\r\nEllie Daw (10:33.228)\r\nYes. Yeah.\r\n\r\n\r\nNikolas Hulewsky (10:41.218)\r\nknow tracking hey this is how many softwares you're using this is what you're using them for other than your expenses at the end of the month no\r\n\r\n\r\nEllie Daw (10:48.606)\r\nNo, no, this, well, and this was one of the features that I like specifically built into Yalo and I was building the first version of this, right? Because even, even if you sort of down scope and tunnel vision yourself to just the custom built software, there's still not a good way to see how much are all of these services costing me? What are all the services that I'm talking to? Like there's just, most companies that I work with are just tracking this in a spreadsheet, right? There's no, no beautiful way to do it.\r\n\r\n\r\nNikolas Hulewsky (11:01.422)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (11:14.478)\r\nYeah, it's crazy. OK, so I'm a small business owner. Cool, I got it. I think I understand the IT portion of it. Anytime that I now need something technical, I'm reaching out. How do I? I feel like anytime I talk to somebody technical, let's say I wanted to build an automation or even a website. They could quote me whatever number they think of, and I'm to be like, OK, that sounds good. And they're like, well, we're going to host it on this back end and we're going to do this and that like.\r\n\r\n\r\nEllie Daw (11:37.642)\r\nHa\r\n\r\n\r\nSounds good.\r\n\r\n\r\nNikolas Hulewsky (11:43.788)\r\nThey might as well be speaking French. How do I even like get up to speed so that I don't feel like I'm being taken advantage of by developers or dev shops?\r\n\r\n\r\nEllie Daw (11:45.622)\r\nYum.\r\n\r\n\r\nEllie Daw (11:54.124)\r\nYeah, I guess if anyone takes anything away from this, want them to know that if anyone is making you feel dumb, stop working with them. You can understand the concepts here and you should just keep asking why until they can give you something that makes sense. There's jargon in every industry. The really, really good technical folks that you're working with will be able to explain to you.\r\n\r\n\r\nhere are the technical things I'm doing and here's why, right? And you should be able to understand that in the context of your business. So like just keep asking questions. If you don't understand it yet, ask more questions. can ask like chat to BT, right? The AI tools are really good with helping figure out the jargon. But I really would just encourage anyone like just keep asking questions. You don't just have to be like, well, like I guess I don't know because I'm not an engineer.\r\n\r\n\r\nNikolas Hulewsky (12:44.546)\r\nWhat?\r\n\r\n\r\nI'm good at asking questions because I don't mind looking like an idiot, but army with a tool belt. What are specific things I should be asking for? What's the bare minimum framework or ask, scope of work, whatever you want to call it, so that I feel confident in what's being provided to me?\r\n\r\n\r\nEllie Daw (13:06.228)\r\nYeah, that's a really good question. So I think before you approach these agencies, you should get really clear on what success would look like for you. And I think being on the other side as someone who is technical and does deliver on scopes like this, it's extra helpful if the person coming to me has also like, okay, I thought I was being specific, but actually let me try to be even more specific, right? Like think through all the edge cases. Have I thought of everything? What happens if this one weird edge case\r\n\r\n\r\nNikolas Hulewsky (13:31.18)\r\nHmm.\r\n\r\n\r\nEllie Daw (13:35.658)\r\nyou know, it happens, right? And then I would, when they provide, they will provide your proposal, the proposal will have a scope in it, it will have a price, maybe some information about how the project will run. And I would go through it with them and say, okay, when you say, when this bullet point on your scope says this, what does that mean to you? Because to me, it means this.\r\n\r\n\r\nAnd here's what the success metrics are, right? Like just really getting clear to make sure that everybody understands what all of the words mean, right?\r\n\r\n\r\nNikolas Hulewsky (14:08.366)\r\nWell, so keep talking about that because you've built more than 40 zero to one products. First of all, define what does zero to one mean?\r\n\r\n\r\nEllie Daw (14:17.516)\r\nYeah, this is another like funny tech world jargon. A lot of people will say, I'm a zero to one like engineer, zero to one product manager. That just means before there was not a project and then when you were done, there was one. But it's usually not referring to the product that will take you. Often you'll hear people say zero to one, one to 10, 10 to a hundred. And that's just kind of to delineate. Like this was the MVP. This is something that, you know,\r\n\r\n\r\ngot us growth and then this is the really big scale. the zero to one is MVP, zero to one is we have this problem, not really sure how to solve it yet. Let's figure out what makes the most sense and let's get something working to kind of prove it.\r\n\r\n\r\nNikolas Hulewsky (14:49.624)\r\nSo zero to one is the MPP.\r\n\r\n\r\nNikolas Hulewsky (15:01.368)\r\nWell, and that's usually articulated as the most difficult phase because you're going from idea to the first workable product, which is very similar to what we're talking about with business owners, right? It's like, I have an idea for what I want. I'm going to go contact a dev shop so they can create me that workable product. So I think your experience and skillset is uniquely suited to talk about this. And the place you started was basically start with the end in mind. that the way you did it with zero to one products as well as you're like,\r\n\r\n\r\nEllie Daw (15:12.748)\r\nYum.\r\n\r\n\r\nNikolas Hulewsky (15:28.94)\r\nOkay, let's scope out where do we wanna end up and work our way back.\r\n\r\n\r\nEllie Daw (15:33.056)\r\nYeah, yeah, 100%. And it's a lot of times it's like, okay, what would my dream scenario be? Now what do I have to have for me to say, yes, this thing works? And then when you're figuring out the solution, and this is another conversation you can have with the dev shop, when they tell you, we're gonna build it with these technologies, even if you don't know the technologies, say, why did you choose those?\r\n\r\n\r\na lot of that like science or art, maybe it's more of the art in that zero to one is understanding, if we pick this, these are the trade-offs we'll have long-term, but these are the pros for right now. And it's kind of like, that's why those people, the really good technical people that can sort of translate between you and the tech teams are really valuable because you have to, as the business owner, you are responsible for making those trade-offs and saying, yep, I'm fine with that trade-off.\r\n\r\n\r\nWhatever that means for the tech team, go do it. Right? Like.\r\n\r\n\r\nNikolas Hulewsky (16:28.174)\r\nSo I'm going to tell Mohammed to edit this part out. What was the, no, no, no, sorry, not before. Just this part where I'm Sorry. That was the worst answer I've ever heard. No, no, no. Remember last time when we were talking and you were like, you like on the fly created this framework where it was like here are the points. Was that for this? Was it this, was that for like, here are the things you should ask for from a dev shop? Do you remember?\r\n\r\n\r\nEllie Daw (16:31.915)\r\nOkay.\r\n\r\n\r\nEllie Daw (16:35.604)\r\nokay.\r\n\r\n\r\nEllie Daw (16:45.846)\r\nYes.\r\n\r\n\r\nEllie Daw (16:54.668)\r\ncan talk about that now. that's like, I think I was talking about that in terms of like handoff documentation. Yeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (17:01.258)\r\nOkay, okay, was handoff documentation. Okay, all right, that's fine. right, so we'll hop back into it. So as I'm vetting these dev shops, are there like any broad categories that you're like, all right, here are the five categories you need to look for, or here are the three, or maybe it's just one that you really need to make sure is spelled out when you're getting these proposals from development shops.\r\n\r\n\r\nEllie Daw (17:08.236)\r\nOkay.\r\n\r\n\r\nEllie Daw (17:28.524)\r\nI really like to see dev shops that have proposals with the sort of operating procedures. Like here's what we will do on milestones, here's what kind of week to week will look like. I think you should always get multiple quotes because I think sometimes it's hard, you one dev shop might quote you double the other one. But if you have a range to choose from, that's really helpful. I think...\r\n\r\n\r\nNikolas Hulewsky (17:37.005)\r\nMm-hmm.\r\n\r\n\r\nEllie Daw (17:55.692)\r\nSorry, I just.\r\n\r\n\r\nNikolas Hulewsky (17:56.088)\r\nWhat about like, do I need to focus on architecture? Like, do I need to worry about, this is what they're telling me they're building on top of. Boom. That's one pillar here is are the milestones they're projecting. That's another pillar here are, I don't know the tech stacks. I don't even know the terminology, right? Like I, I guess in my mind, I'm trying to think through, okay, these are the five checklist items. I don't know if you have those types of things, but anything that you can help me around that would be amazing.\r\n\r\n\r\nEllie Daw (18:26.368)\r\nYeah, think so. Okay. The proposal should always of course have like timeline and scope. You should make sure that the scope matches your expectations as well. Often really good dev shops will also include kind of details in the scope that you didn't think of. For non-technical people, this is a lot of times like an admin portal, right? Like this isn't something we're thinking about as the outcome of the project, but yeah, I actually do need an admin portal, right? So.\r\n\r\n\r\nlooking for things where it's like, I didn't think of that. That's good. the tech stack, if they have a high level architecture in there, that's always good too. The other thing that's really helpful, you should always ask the dev shops for examples of other projects that they've done. And when you're looking at them, like it's easy to pull up a website and say, this looks good, but really think like, is this the same type of project that I'm asking them for?\r\n\r\n\r\nRight? Cause some dev shops will be really, really fast at like simple websites, but maybe you don't need a simple website. And so they might be really awesome at that, but maybe not a good fit for you. and then the last thing is asking for referrals. Like if they can pass you the name or a LinkedIn link, you know, someone that they've worked with before, just so you can kind of get a sense for what it's like to work with them. That's really helpful.\r\n\r\n\r\nNikolas Hulewsky (19:43.34)\r\nYeah, I think the clarity piece is really interesting that you talked about, or just maybe sit down with your thoughts or maybe mess around with chat GPT and like get really clear on what you want. Don't just say, I want a website that gets contact information from potential customers. Okay. Think through what fields do you want? Do you just want their first name, last name email? Do on their first name, last name, email phone number to want their first name, last name, email phone number, zip code like\r\n\r\n\r\nHow expansive do you want it to be? Is it just a single landing page? After they click through that, does it pop up to something else that leads them somewhere? Just being, thinking through all those steps.\r\n\r\n\r\nEllie Daw (20:18.188)\r\nAnd, and yeah, and your experience on the backside of it, right? Like once they submit, what do I want to happen with that data? What happens next? Right. So just trying to like think through, okay, this is my vision. Now what's every perspective I could look at this from to try to really, really, really get clear on what you want that end product to look like.\r\n\r\n\r\nNikolas Hulewsky (20:28.182)\r\nRight. Right.\r\n\r\n\r\nNikolas Hulewsky (20:40.974)\r\nI think the other thing that would be interesting to hear from your viewpoint is like, should you get multiple quotes? You should always. Okay. It's just hard. It's like, what do I do? I go to Google and I'm like, a custom website developer. You know I mean? Like, where do I even go to look in your experience? Where's it been the best way of finding good people?\r\n\r\n\r\nEllie Daw (20:47.276)\r\nAlways, I think always, yeah, 100%, yeah.\r\n\r\n\r\nEllie Daw (20:57.782)\r\nYeah.\r\n\r\n\r\nEllie Daw (21:04.012)\r\nhonestly, referrals from inside my network, right? Like, yeah, folks that I know that have had projects done, like, hey, who did that for you? Did you have a good experience with them? Can I talk to them? That's been my best way. Because a lot of times, especially with these dev shops, probably so many of your listeners have horror stories with dev shops. I'm sure everyone does. But a lot of it comes down to communication and trust, right? And like, where do you find people that have good communication and high trust?\r\n\r\n\r\nNikolas Hulewsky (21:06.218)\r\nReferrals. Yeah.\r\n\r\n\r\nNikolas Hulewsky (21:13.943)\r\nMm-hmm.\r\n\r\n\r\nEllie Daw (21:33.238)\r\nprobably inside your network, right? So it kind of makes sense.\r\n\r\n\r\nNikolas Hulewsky (21:36.972)\r\nWell, and that kind of leads me to Yala. When we met in person a month or so ago, I'm I'm really deep into this vibe coding world. I don't do a ton of vibe coding, but it's been interesting to see. what basically what that means is now with natural language, dummies like me can go to a replet lovable, even cursor, although Chris is more complicated and just say, hey, I'm trying to build a website. These are the components that I want on it and it will build it. And it's it's it's functional and I can throw it up.\r\n\r\n\r\nEllie Daw (22:03.798)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (22:06.634)\r\nAnd so people like me start thinking, well, cool. just saved a bunch of money. I don't have to hire an outside developer. And they roll it out and it looks good for the first day or two. And then all of a sudden it starts breaking or people start complaining because the links don't work or, then they've got to go and fix it. And if you go to try to fix it, it doesn't necessarily go and fix that one thing that you asked it to do. Sometimes it expands the scope and it fixes other things that you didn't even ask it to do that weren't actually broken. And so what you do is you get this.\r\n\r\n\r\nEllie Daw (22:33.868)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (22:36.472)\r\nFrankenstein of a website and to the point where you're like, okay, now I got to get somebody professional in here to come fix it. And at that point, when you bring the professional in, you're paying the professional for two things. The first thing you're paying them for is to get educated on what you built, like what the freak is this thing? And the second thing you're paying them for then is expertise. And you want to just pay them for the expertise, but you can't pay them for the expertise until they get educated. Now that is the same problem that many small business owners face.\r\n\r\n\r\nEllie Daw (22:43.498)\r\nYeah.\r\n\r\n\r\nEllie Daw (23:02.956)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (23:06.284)\r\nhistorically when they built a website is like, don't like the developer that I had, I've got to bring somebody in. So let me bring in a new developer. They still got to get educated and then they've got to fix it. But now it feels like that problem is only it's expanding because you've gotten all these people who were like, I'll just vibe code my way to a product. and what, what you explained to me was this term called technical debt. And that's when the light bulb went off of like,\r\n\r\n\r\nholy crap. I didn't even realize that even in my small organization, this technical debt is really impacting me. So can you talk about what is technical debt and why is it actually a problem?\r\n\r\n\r\nEllie Daw (23:37.707)\r\nYeah.\r\n\r\n\r\nEllie Daw (23:42.228)\r\nYes. Yes. And I think while you were saying like, here's all these weird things that happen when you vibe code with AI, you touched on it too. But I was thinking like, I bet if you had removed the word AI from that story, a bunch of people would actually resonate with that with their horror stories from these step shops that they've hired. Right. which is why that like, I mentioned it comes down to communication and trust. And I will just share quickly and then I'll jump back to technical debt. The framework.\r\n\r\n\r\nNikolas Hulewsky (23:58.691)\r\nYeah.\r\n\r\n\r\nEllie Daw (24:10.346)\r\nthat I like to use for communication with dev teams. You've got to set the expectations upfront and specifically like do a kickoff meeting with them. The goal of the kickoff meeting is I want everybody to know everybody's first names, right? Like we need to have a little bit of a personal relationship and rapport here. Second, I want the whole team to have context. They should understand why we're here. Why are we building this? Why do we care about this? And third,\r\n\r\n\r\nI want the whole team to know where we're going. How will we know that we've got to where we're going? What does success look like? So that's kind of kickoff meeting. Thing number two is weekly check-ins. The check-in should just be, what did I do last week? What are the priorities for this week? What goals do we have for this week? And then talk through any questions. So no matter how clear you get on your scope upfront, there will always be questions. That's okay, that's expected. Let's have a regular time to tackle them.\r\n\r\n\r\npillar three is just ongoing communication. So a Slack channel or WhatsApp chat or something where you guys can talk ongoing as things are coming up, it doesn't have to wait for the meeting. There should be an ongoing place where everyone can see priorities and see progress. So like source of truth, here are the priorities, here's how far we are on them. So those are kind of the three like, you know, communicate really well with dev teams, do those three things.\r\n\r\n\r\nNikolas Hulewsky (25:34.914)\r\nfunny because it's like, that's not unique to tech. That should just be the communication, the communication style for any project. yeah, kickoff meetings so that everybody meets everybody. That's a great, that's actually really great advice, especially for outside vendors who don't know your team. An established weekly cadence for checking in and then a place where everybody can go and say, this is where we are relative to the goals that we set.\r\n\r\n\r\nEllie Daw (25:39.486)\r\nNo.\r\n\r\n\r\nEllie Daw (25:49.952)\r\nYeah. Yeah.\r\n\r\n\r\nEllie Daw (25:58.208)\r\nYep. Yep. And it's funny because that's actually a good segue into some of the technical debt because some of these same principles about like sharing context and kind of having these regular check-ins and success metrics apply to AI tools and vibe coding and stuff too. So it's kind of funny, but technical debt, another piece of jargon in the tech industry, but it just means we made a trade-off decision at one point. And now we're at the point where the trade-off decision is\r\n\r\n\r\ncausing a little bit of drag in some way. So every piece of software, 100 % always has technical debt. There's no such thing as projects without it. It's totally okay. Software comes with trade-offs. But it's just like, as that stuff starts to build up, you might find yourself doing more workarounds in your day-to-day operations, or things are breaking a little bit more often and you don't know why. That just means like the tech debt is building up, you know? And sometimes that happens if you're just building features and features and features.\r\n\r\n\r\nAnd you're not really sure like, wait, we should actually go back and redo this thing because our process has changed a little bit. And we're just putting Band-Aids on instead of fixing how the software works to match the new process.\r\n\r\n\r\nNikolas Hulewsky (27:08.419)\r\nIt's almost like the sludge in an engine. It just like builds up, builds up over time.\r\n\r\n\r\nEllie Daw (27:11.476)\r\nYes, 100%. It just fills up. Yeah, and you can do something about it. You just have to like actively go do something about it, right?\r\n\r\n\r\nNikolas Hulewsky (27:20.846)\r\nWell, and when you're, didn't realize it when you're vibe coding that tech debt just builds up, like you don't go back and clean it up. It's making fixes to the already broken process. Whereas if you had taken the time to actually just go fix it at the source, then the code would have been a lot cleaner. It'll run faster. There'll be less errors, et cetera. So a lot of times, like you were saying, when you come in to look at an organization and they're what they're, we're how they're operating, how their software is built. Like tech debt is kind of the first major hurdle that you have to get over.\r\n\r\n\r\nEllie Daw (27:26.742)\r\nYum.\r\n\r\n\r\nEllie Daw (27:30.433)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (27:50.946)\r\nbefore you can even get into fixing quote unquote everything.\r\n\r\n\r\nEllie Daw (27:55.04)\r\nYeah. Yeah. And this is, that's one of the reasons too, that context sharing is so key. Like whether you're vibe coding, working with AI, working with a dev shop, like if the whole team doesn't understand the why behind something, then they're going to make technical decisions that maybe have trade-offs that are worse for your, your outcome. Right? Like there's not necessarily one perfect way to build software. Everything comes with a trade-off. You just need to be\r\n\r\n\r\nNikolas Hulewsky (27:56.61)\r\nIt\r\n\r\n\r\nEllie Daw (28:23.638)\r\npicking the trade-offs that match with your business context, right?\r\n\r\n\r\nNikolas Hulewsky (28:27.826)\r\nWhen I say tech debt, I always think like, that sounds like a Silicon Valley company, but tech debt isn't unique to just a tech company, right? I mean, it's kind of all over the place.\r\n\r\n\r\nEllie Daw (28:38.314)\r\nNo, it's all over the place. It's all over the place. Yeah. Like sometimes when different systems are integrating together, there can be tucked up because maybe there was some work around with how you made the integration because you needed it to work fast. And so it's like maybe sending double the data that it needs to send, which is fine. Cause maybe we got it running today, but next year when we have a hundred times the number of customers sending double the amount of information is going to be really slow. Right. It's things like that.\r\n\r\n\r\nNikolas Hulewsky (29:07.992)\r\nSo you've been working as a fractional CTO effectively, you also developed, I mean, you started multiple companies, but you've developed this new product called Yala, which effectively just maps out your current technical infrastructure. Is there a word for that? Is there a word for that document?\r\n\r\n\r\nEllie Daw (29:22.838)\r\nYeah.\r\n\r\n\r\nEllie Daw (29:26.956)\r\nYeah, teams will sometimes call it the technical design document, sometimes like the architecture document. But the idea is like, a lot of times your tech stack feels really opaque, the software feels opaque. This is what you were mentioning too about like, you hire a dev and you want to pay them for their expertise, but actually the first week or two weeks or whatever, it's not even their expertise that you're paying them for, it's them figuring out what on earth is going on, you know?\r\n\r\n\r\nin there. So this is a problem that I've seen at every single company that I've worked with. And I just kind of started tinkering in the background of, you know, working with my clients, like, can I solve this? Right? Like, can I get this information visible in a way that makes sense to people so that they don't waste all this time kind of going down rabbit holes or being confused? Like, you don't want to feel confused.\r\n\r\n\r\nNikolas Hulewsky (30:17.197)\r\nYeah.\r\n\r\n\r\nI'm very visual, so I would love to see it. You actually map it out, right? Can I see? Yeah, yeah. I'd love to.\r\n\r\n\r\nEllie Daw (30:23.041)\r\nYeah.\r\n\r\n\r\nEllie Daw (30:26.602)\r\nYeah, I can share my screen. Yeah. So this I'll show you.\r\n\r\n\r\nNikolas Hulewsky (30:38.008)\r\nThis is one of the things that I've loved about this podcast is over the last couple of months, I've started doing screen shares as people were teaching me AI. And now I'm like, why didn't I do this sooner? Like I can see exactly what they're talking about. We don't have to just like speak in theory. okay.\r\n\r\n\r\nEllie Daw (30:44.844)\r\nMm.\r\n\r\n\r\nEllie Daw (30:50.644)\r\nYeah, I'm super visual too, so I get it.\r\n\r\n\r\nNikolas Hulewsky (30:53.974)\r\nAlright, so this is the Yala dashboard. Yala spelled G Y a L L a sorry.\r\n\r\n\r\nEllie Daw (31:01.216)\r\nG-J-A-L-L-A. So this is, no, no, you're not, I promise you. It's actually funny. Yeah, it's a long story, but the name, so my whole, my reason for being is that I'm super passionate about non-technical people not feeling like they're at some disadvantage for not knowing how to code, right? And I really love.\r\n\r\n\r\nNikolas Hulewsky (31:03.406)\r\nI'm so stupid, I'm so sorry.\r\n\r\n\r\nEllie Daw (31:27.828)\r\nall of my clients because I get to kind of partner with them and make them feel really confident that they understand their tech enough to go run their business, right? And so I feel like a bridge. And so I was like, okay, I need a name that like harkens to bridge somehow. And in Norse mythology, the Jallerhorn is like held at the bridge between two realms. And so I was like, that's pretty good. I can call it, I can call it Jaller. Jaller.\r\n\r\n\r\nNikolas Hulewsky (31:35.608)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (31:54.228)\r\nYalla. I feel like it's like, Hey, yalla. I like it. Yeah, yeah, that's fun. That's fun. Alright, so this is the yalla dashboard we're looking at. Tell me what I'm looking at.\r\n\r\n\r\nEllie Daw (31:57.662)\r\nYalla, yeah, that's like a little fun, you know? It's fun. Yes, this is Yalla. So this is actually a public link. So if you go to yalla.io slash demo slash medplum, spelled M-E-D-P-L-U-M. Medplum is an open source project. So this is just basically a big piece of software that's like.\r\n\r\n\r\nfree for anyone to use. It's a starter project for companies building software that needs to be HIPAA compliant. So the idea is like, yeah, like provide some tooling to get developers started. So you can start from this code and then build on top of it, however, however you need. but this is what YOLO does. So you just load in a code base and it basically draws it. So on the right side here, yeah.\r\n\r\n\r\nNikolas Hulewsky (32:49.07)\r\nI'm so sorry. I'm so sorry. I know a code base is a thing and maybe this is, maybe we should cut this out. How would I, sorry, I know how to get a code base. I know how to do it, but how would someone who's really dumb and stupid, how would they get their code base?\r\n\r\n\r\nEllie Daw (32:54.454)\r\nYeah.\r\n\r\n\r\nEllie Daw (33:00.426)\r\nYeah.\r\n\r\n\r\nEllie Daw (33:06.438)\r\nNo one is dumb and stupid, first of all. Most code bases are stored on GitHub. So if your dev shop sent you the GitHub link or whatever, or they were like, hey, I need you to create an account on GitHub, that's where they're storing all of their code. So think of it.\r\n\r\n\r\nNikolas Hulewsky (33:13.432)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (33:22.446)\r\nthey should have stored it on GitHub.\r\n\r\n\r\nEllie Daw (33:25.534)\r\nIt should be on GitHub. Think of it like, it's like Google Drive, but for code. That's basically what it is. Everyone just keeps their code on GitHub. Engineers, yeah.\r\n\r\n\r\nNikolas Hulewsky (33:34.176)\r\nOkay. Theoretically, you had a dev shop and you just came in and you actually don't have any link to GitHub. What would you do that?\r\n\r\n\r\nEllie Daw (33:49.162)\r\nguess the other way you could do it into Yalla anyways, if you have a zip file of all of the code, I would imagine, I guess if we back up to earlier, you were asking how can founders and business owners protect themselves when they work with dev shops. And one of the other things that I recommend is that you own all of your accounts. And what I mean by that is instead of the dev shop putting all of the code into their GitHub, you should go create a GitHub account.\r\n\r\n\r\nNikolas Hulewsky (34:17.01)\r\nMmm.\r\n\r\n\r\nEllie Daw (34:18.388)\r\nand have them put it in your GitHub account, right? So they should be okay with this because any of the services that have usage costs or something would be on your account. So they don't have to incur that cost if, you know, I don't know, something logistically weird happens, but then you also own all of your accounts, like, you know, whether or not you have the nice handoff documentation from them, you at least have control of all of the logins and accounts and stuff that you need to run.\r\n\r\n\r\nNikolas Hulewsky (34:21.258)\r\nOkay, yeah, yeah, yeah, yeah.\r\n\r\n\r\nNikolas Hulewsky (34:46.22)\r\nNo, that makes a ton of sense, right? Because then it's like, I don't need to go back and ask my developer who I had a really bad experience with for the zip file, just do it upfront. Hey, I'm gonna make a GitHub account or whatever. We're gonna store it there. Okay, cool. All right, keep going, thank you.\r\n\r\n\r\nEllie Daw (34:54.208)\r\nYep. Yep.\r\n\r\n\r\nYep. Yep. Yeah, of course. Okay. So you have your code, you load it into Yalla. What Yalla does is it goes through and on the right side here, you can see it's identified everything in the tech stack. So this is like what a software engineer means by a tech stack. So these are languages, TypeScript, Node as a framework, Docker, that's like a way to deploy stuff.\r\n\r\n\r\nIf you scroll down a little, it will show you any external dependencies that you have. So these are, if there are external dependencies in here, these might be things that you would also need accounts for. So Google Cloud, you might have an account that you own on there. Let me see what else would be interesting in here. I don't mean to scroll through all of these, but it basically maps out the entire code base and just kind of shows you at a really high level,\r\n\r\n\r\nWhat are the different components in this code? So this one in particular has a server component and it tells you it's got like a little description there. It's got an agent. It's talking to external healthcare systems. There's like healthcare clinicians, developers. So, you know, the people who, who downloaded Medplum and wanted to build on top of it databases.\r\n\r\n\r\nRight, it has all of these pieces. And then if you want to know more about the system, you can actually kind of increase the level of technical information that you're showing. So this just like zoomed into each of these components. Now you can see the server has a bunch of components inside the server. So what makes up the server? it has the repository and the authentication service. So just like, if you're kind of trying to figure out what on earth.\r\n\r\n\r\nNikolas Hulewsky (36:49.39)\r\nShe is the way he is.\r\n\r\n\r\nEllie Daw (36:56.388)\r\nlike how does my system work? This will just draw it all out for you and you can kind of look at whatever layer of depth you want, right? You don't have to be thrown all of the jargon.\r\n\r\n\r\nNikolas Hulewsky (37:05.038)\r\nIs there any way that it like like maps out the flow of data or the flow? don't know. Is there like any? Are there any arrows? I'm an arrow person.\r\n\r\n\r\nEllie Daw (37:11.294)\r\nYeah, let me show you. I am also a narrow person. Okay, let's do the bot automation. So this one just shows, this is how the data moves for bot automation. You can do user authentication. This one, so that one makes sense too, the user authentication flow. You're seeing that data goes between the authentication provider, the cache server and the web app.\r\n\r\n\r\nYeah, so you can kind of just see how the different key workflows in the product will move data. Yeah. Yeah, throw me a curveball. Yeah.\r\n\r\n\r\nNikolas Hulewsky (37:50.744)\r\nCan I throw you a curve ball that I think would actually be really fun? I vibe coded a personality quiz.\r\n\r\n\r\nEllie Daw (37:59.729)\r\nNikolas Hulewsky (38:00.63)\r\nAnd it's on GitHub. Can I extend it to you and have you map it? And you can be like, just like tell me what I'm looking at.\r\n\r\n\r\nEllie Daw (38:03.125)\r\nI love it.\r\n\r\n\r\nYeah!\r\n\r\n\r\nYeah, we could definitely do that. It takes like, like we will be past the end of our our time, but I can load it in and show you later if you want.\r\n\r\n\r\nNikolas Hulewsky (38:14.825)\r\nOkay,\r\n\r\n\r\nNikolas Hulewsky (38:18.824)\r\nOkay, darn it, I should have sent you it beforehand, nevermind. I thought it could be quick.\r\n\r\n\r\nEllie Daw (38:22.528)\r\nWe can like splice it in later if you want.\r\n\r\n\r\nNikolas Hulewsky (38:25.088)\r\nOkay, no, it's fine. It's fine. I just thought that would be actually a fun, a fun way to look at it. Have you got have you got a mark? what is this?\r\n\r\n\r\nEllie Daw (38:29.068)\r\nYeah.\r\n\r\n\r\nEllie Daw (38:35.692)\r\nSo this one maps out the data entities you can think about it as. So in this particular system, there's like a practitioner, there is an encounter. It's like how the different data is modeled in the system. And you can actually see if you go open the documentation panel again, it will show you, yeah, here we go. So you can look at like, an encounter has these various attributes. There's a participant, there's a subject, a class, a status.\r\n\r\n\r\nSo if you're kind of trying to think about like, want to build this new automation. Do I have the right data in my system to do it? You could go into Yalla and see like, okay, exactly what data do I have in my system? Am I saving the attributes that I need?\r\n\r\n\r\nNikolas Hulewsky (39:21.282)\r\nNow, YOLO would be more geared towards somebody technical, correct?\r\n\r\n\r\nEllie Daw (39:27.626)\r\nYeah, it definitely requires custom code. So right now doesn't work on operations infrastructure, I guess I would say. If your tech stack is HubSpot and QuickBooks, Yala doesn't map that kind of thing out. But if you have custom code, it will map that.\r\n\r\n\r\nNikolas Hulewsky (39:53.112)\r\nmean, basically, if I'm hiring a deaf shop, they would be the ones using Yalla on their end, right? I'm not necessarily using Yalla as a business owner.\r\n\r\n\r\nEllie Daw (40:00.491)\r\nYeah.\r\n\r\n\r\nEllie Daw (40:04.394)\r\nRight, yeah, and this is when I'm doing projects and giving handoff documentation, YALA is basically exactly what I give to my clients, right? Like here's the architecture, here's the tech stack, here's the data model, like the infrastructure, like you need to communicate to them everything that they would need to either operate it themselves or hire another dev shop. So dev shops can kind of use that as handoff documentation.\r\n\r\n\r\nYeah, like you, don't necessarily need to understand all of the details in here, but it's, it's good to just orient new engineers.\r\n\r\n\r\nNikolas Hulewsky (40:39.182)\r\nDid you use AI to build this?\r\n\r\n\r\nEllie Daw (40:42.037)\r\nYeah.\r\n\r\n\r\nThe first iteration that I did, I did in Replet. Yeah. So the, backend processing now is a little bit more complex, but a lot of the front end stuff I did in Replet. And then once I, kind of was like hitting the limits of what Replet could reliably do, especially for the like backend processing stuff. So I, pulled it out of Replet and kept building. But the other. Yeah.\r\n\r\n\r\nNikolas Hulewsky (40:49.7)\r\nreally?\r\n\r\n\r\nNikolas Hulewsky (41:09.41)\r\nSo I'm sorry, dumb question, what do you mean backend processes stuff?\r\n\r\n\r\nEllie Daw (41:13.724)\r\nSo one of the things that Yalla does is it like, it's called cloning in the technical world, but that just means it copies the code base, runs a bunch of analysis so that it can draw all of this stuff. And then it like deletes the code base. don't store any, any of that stuff, but that's the piece that like, I don't know. A, I wanted a little bit more control over that because that's like the core thing that I want to work really well. but B, Replet and some of these other tools are really, really good at the front end stuff.\r\n\r\n\r\nNikolas Hulewsky (41:32.109)\r\nOkay.\r\n\r\n\r\nEllie Daw (41:43.488)\r\nbut not, I don't know, like the backend stuff is more, yeah. Yeah.\r\n\r\n\r\nNikolas Hulewsky (41:46.402)\r\nWell, can I, can I give an example? So I just, I was building this app that I wanted to create for my kids and my wife, where it basically it's like the Hulusky task tracker was the name of it. And so we could go in and assign tasks because it's summer, the kids are home. They need to know what chores they have. And then the kids can market complete or they can leave notes. But in order for me to create it, I did this in lovable. I had to set up a super base account that was effectively hosting.\r\n\r\n\r\nEllie Daw (41:58.26)\r\nYeah.\r\n\r\n\r\nEllie Daw (42:03.21)\r\nYep.\r\n\r\n\r\nEllie Daw (42:10.177)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (42:15.946)\r\nAll of those tasks right? Because effectively replet and lovable is the UI, but the back end like the guts of it need to be stored somewhere else. So I was using super base. Is that what you're talking about when you say the back end of y'all?\r\n\r\n\r\nEllie Daw (42:21.238)\r\nYes.\r\n\r\n\r\nEllie Daw (42:29.676)\r\nof there's three usually there's three main pieces so what you just talked about were two of them there's the front end piece and then the database which is super base some applications have a third layer which is like if there's any additional processing that needs to happen between the front end and the database that would happen in the back end\r\n\r\n\r\nNikolas Hulewsky (42:48.162)\r\nHmm. So let's say that I wanted a layer of AI to process in between. I built a wrapper and it's an advice application. So I ask it a question and then does an API call to open AI and then responds back. Would that API call effectively be what you're talking about? This like third processing. Jeez Louise. I'm so smart.\r\n\r\n\r\nEllie Daw (43:12.352)\r\nYep, exactly, yeah. I mean, those are the three main components in most software systems. You've got the frontend where the people use it. You've got the database where stuff is stored. And then if there's any extra processing stuff, that's just the backend. That's the main gist. Yeah. The website is yalla.io, but you can also...\r\n\r\n\r\nNikolas Hulewsky (43:19.233)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (43:32.6)\r\nI love it. I love it. So where can people find YOLO right now?\r\n\r\n\r\nEllie Daw (43:40.62)\r\nFollow me on LinkedIn. I'm posting about it. I'm on Twitter also. Ellieintech is my handle on Twitter. And I love hearing from folks and especially hearing people's experience. I I've seen a lot of my clients and just everyone seems to be having a lot of fun playing with Replet and stuff, but having a little bit of a hard time turning these apps into something that's like production ready. I'm...\r\n\r\n\r\nNikolas Hulewsky (44:01.166)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (44:06.263)\r\nYeah.\r\n\r\n\r\nEllie Daw (44:07.442)\r\nYeah, like it's interesting for me to hear more about those use cases and see if that's something I can help with too.\r\n\r\n\r\nNikolas Hulewsky (44:13.624)\r\nCool, this is awesome. Ellie, appreciate you. Thank you for all your insights. We'll talk soon. All right, I'm gonna hit stop.\r\n\r\n\r\nEllie Daw (44:16.78)\r\nI appreciate you, Nick. Thank you so much for having me. This was fun. Yeah.",
  "metadata": {
    "duration": "",
    "date": "2025-06-24",
    "platform_source": "Google Drive"
  }
}