{
  "episode_number": "42",
  "episode_title": "How to Create a Billion Dollar Pitch Deck with Matt Gore",
  "guest_name": "Matt Gore",
  "business_name": "Optio",
  "transcript": "﻿Have you ever sat down and penciled out like, okay, this is how many companies I've helped raise. This is how much capital I've helped raise.  This is how much enterprise value my raises have contributed to the number that I know is that we've helped people raise about 2 billion so far 2 billion.  Yeah, 2 billion.\r\n\r\n\r\nWait, wait. Oh, okay. Holy freaking ball. Over. Okay. Over what period of time? Since I started probably five years ago, but most of that's been the last two years. \r\n\r\n\r\nHave you ever wondered how long investors actually spend looking at your pitch deck? Is it three hours? Is it 30 minutes?  Try three minutes and 37 seconds. That's right. The document you spent weeks perfecting gets less attention than a YouTube short.  So how do you make every second count and who do you turn to, to help craft the pitch that might decide the fate of your company? \r\n\r\n\r\nWell, my name is Nicholas Helusky and welcome to another episode of economics. This is the show for entrepreneurs and entrepreneurs. Curious to learn how other businesses work. Over the past five years, my companies have generated over a hundred million dollars in revenue and created millions of dollars in shareholder value.\r\n\r\n\r\nI've bought, run, and sold dozens of companies in the SMB space with multiple seven figure exits.  My mom always told me there's no such thing as a dumb question,  only dumb people. But what she meant by that was that those who don't ask questions are the dumb ones. So on this show, I let my curiosity drive as I interview successful entrepreneurs, asking them to walk me through exactly how their businesses operate, whether you're an experienced business owner or just starting out.\r\n\r\n\r\nEconomics is your place. To learn, ask questions and gain valuable insights. You just won't find anywhere else. And on today's episode, we're sitting down with Matt Gore. He's the founder of a company that's turned the art of a pitch deck creation into a seven figure thriving business. And you'll hear how Matt transformed a late night favor into that business, why he believes in the power of 12 second slides and how his team of seven soon to be nine have helped companies secure billions in funding. \r\n\r\n\r\nBut I'm mainly curious with just one question, how does he do all of that in less than four minutes?  Let's find out together. Okay, guys, we're going to get back to the show in just one second, but first a message from a sponsor who is, uh, me. Oh, it's me. Cause I'm doing the show for free. Listen, I want to give you a hundred dollars.\r\n\r\n\r\nAll you have to do is this go to Apple or Spotify.  Give me five stars, write a review, screenshot that review, send it to me, Nick at cofounders. com and you will be entered to win a hundred dollar Amazon gift card every four episodes. I am going to choose a winner at random and I'm going to do this five times, 500 for five stars.\r\n\r\n\r\nI just made that up. It's what I'm calling it. Please go to Apple or Spotify, leave a review, screenshot it, send it to me, Nick at cofounders. com and you'll be entered to win a hundred dollar Amazon gift card. All right, let's get back to the show. All right. We're in Matt. First of all, I'm stoked to have you.\r\n\r\n\r\nSecond of all, you look freaking fantastic with that exposed brick behind you on that bookshelf.  I mean, it's an amazing podcast set up.  So do you want to hear how I actually made this podcast set up? First off, the rest of my office looks like a disaster, but this is actually a old shed in my backyard and I met a guy begging for food outside of a Walmart.\r\n\r\n\r\nAnd I was like, Hey man, I don't have any, like, I don't have any money for you, but like I got some work. Do you want to help me convert my garden shed into an office? And so I ended up becoming friends with this guy. And then it turns out he didn't know anything about construction. So his father in law, we spent two weeks building  a office that I love.\r\n\r\n\r\nAnd so anyways, I just found two guys outside of Walmart and we had a blast building this thing. So anyways, that's freaking awesome.  Yeah. So he knew, he knew nothing about construction, but he was a body.  His father in law knew what he was doing. So Elvis, Elvis was a pro. Um, but he, no, no. The first guy I found did not know what he's doing.\r\n\r\n\r\nHe was a hard worker though. And the combo, so I kind of GC the project. And there were a couple of times when I saw him like mixing concrete, not in like a wheelbarrow or anything, but just on the concrete pad. And I was like, I have zero idea what you're doing. And I don't speak Spanish and didn't speak English.\r\n\r\n\r\nBut we just, we figured out how to do it and the results are beautiful. And they did, they took a lot of pride in their craftsmanship and we had a blast. And so anyways, it was a lot of fun. Dude, that's awesome.  Yes, that, that is awesome. Tell Elvis next time you see him that the podcast studio looks amazing. \r\n\r\n\r\nIf you can, all right, give me, and for those listening, Matt, just a brief explanation in the simplest terms. What is your business and how do you make money?  I make pitch decks that help founders raise money. Simple as that. That's a very, very concise explanation. I love it. Keep going. Well, my job is basically to listen to people ramble and then to turn it into polished slides, which is means I've done it a lot.\r\n\r\n\r\nSo I've gotten pretty good at it, but it also is a problem in my marriage because sometimes my wife will tell me a long story and really she'll be processing out loud. And then I'll come back and summarize it in a sentence. Which is my job all day for like, you know, aerospace companies. But when my wife really just wanted to be listened to, not, you know, put through Matt GPT and turned into like a polished phrase, it's not so helpful. \r\n\r\n\r\nHere's a trick. I don't know if you can use it or not use it. I've learned in the beginning when my wife starts and she does this to me as well. But when she starts like talking to me about something and I can tell it's touching a nerve, I'll ask,  is this a conversation you want me to listen? Or is this a conversation you want me to fix?\r\n\r\n\r\nAnd she'll say, listen or fix or whatever, and it just frames how I'm going to respond at the end. So just think about it. That question is next level marriage advice. And I have started implementing it. The problem is I thought that saying back to her, what she said was really good active listening. And it turns out that when it's too obvious that I've been cooking on the pithy one liner while she's been talking, then it doesn't work as well,  but  wow, men are such idiots.\r\n\r\n\r\nHow dare you, Matt.  How dare you actively listen and then show her you're actively listening with a, with a, you know,  quippy one line. It's awesome. How did you get into that? That seems like a very weird specific thing to get into. Well, I have to give my wife credit for actually starting the business because the day we got back from our honeymoon, which was Just about three years ago, I said, goodbye, honey, I'm going to stay up all night making pitch decks for these guys.\r\n\r\n\r\nAnd she said, no, you're not. You get to have one job, not two jobs. And so she actually encouraged me to quit when she was still in medical school. So she wasn't bringing home any money. And she's like, no, you'll be fine. You'll be able to make enough money. Just do that. So she gets credit for the actual initial push to go full time.\r\n\r\n\r\nTime out. Time out your wife. Is your wife a physician? Yes. She's a surgeon in residency right now. Holy crap. What kind of surgeon?  Right now, general, she wants to be a pediatric surgeon, and so  that means in addition to being the CEO of a small agency, I am a trophy spouse. And so I really try to embrace trophy husband ness.\r\n\r\n\r\nI do a lot of cooking and cleaning. I have hosted a party for like eight doctors on Saturday night and, you know, it was like work in the backyard, make the backyard nice, cook the food. You look fantastic. I'm Nick.  Thank you. I tried it. You got it. You can't be a trophy husband if you're not hitting the gym.\r\n\r\n\r\nAnd so you got to keep it tight. Oh yeah. But no, she works incredibly hard. And so it's been actually a real blessing because for instance, this week she's working nights. So I've had to work late. It doesn't cause any marital tension because she's working later. And so that's a nice thing. I think it'll be a real trade offs when God willing, we have kids, but right now it's very much, we're both deep in it.\r\n\r\n\r\nAnd so we're both in this grind and build phase and we're really good. She's incredibly supportive and also gets a lot of the stress that I'm under because when I have a bad day, it's because a client didn't like my PowerPoint slides. When she has a bad day, it's because somebody died on the table. And so anyways, she can,  she's, and she still takes my job seriously, which is really amazing.\r\n\r\n\r\nYeah, I used to own a medical billing practice, medical practice management company, and we had surgeons that were our clients. So at some point you'll help your wife launch your own business. And I also owned and operated hospice companies for 12 years. So I used to say the same thing. It's like,  if I have a bad day, somebody died. \r\n\r\n\r\nAnd like in a bad way,  because our job is helping people die. So if I'm getting a complaint, it's because like somebody,  somebody didn't die in a nice manner. Anyway, so I,  I get where she's coming from. That is a, that can be a very, very stressful environment. It's incredibly stressful for her and she's really good at handling it.\r\n\r\n\r\nAnd it's fun because then one day she'll be stressed. And just yesterday, last night, I was incredibly stressed about today. I've got a lot of projects cooking. We're hiring a bunch of people. We're expanding. And. She just said the same thing back to me that I had said to her three days ago when she was really stressed about work and  I was slightly annoyed and also very comforted.\r\n\r\n\r\nSo it's nice that we're both in it.  Okay. So what was the project you were working on? Like, why did, why was she like, you're not having two jobs. How dare you? Like, why were you working on this PowerPoint project for some friends? The first time I ever made a pitch deck, I made it for free. So I worked at a venture studio.\r\n\r\n\r\nI used to be a consultant at BCG. Then I worked in startups, mostly at a venture studio. And one of the partners of the venture studio is a guy and a very good friend named Evan Loomis.  And he wrote the Harvard business review book on pitch decks. And so his friends would call him all the time and ask him for help with pitch decks.\r\n\r\n\r\nAnd so one day he said, Hey, Matt,  I know you're building a company for the venture studio, would you just make a pitch deck for me? And so I made a terrible pitch deck. And they helped me make it into a pretty good pitch deck.  And then we started charging people money for it.  And then we started charging people a lot of money for it. \r\n\r\n\r\nAnd then I started getting recommendations from these people that I was  doing work for until eventually it was just kind of, I would, I made more money making pitch decks at night than I did at my day job operating startups. For I think three years before I said, before my wife told me, Hey, you can support our family with your side hustle.\r\n\r\n\r\nAnd I think you can make your side hustle into a bigger thing. So maybe you should jump full time into this. So you were managing ventures, venture companies, like you were managing a venture portfolio.  No, I was an operator. So I worked at, I worked in a venture studio, which is a company that starts companies, right.\r\n\r\n\r\nAnd sort of, it's halfway between a venture firm and like,  They have institutional capital. And so I was living off of their capital, but you also raise outside capital at some point after you've built a business to a certain stage. And so for them, I, they had a company that they were cooking on before I got there.\r\n\r\n\r\nI joined and I worked on this company for about six months. And then right before we launched our product, our main distribution partner declared bankruptcy and liquidated. And so that was our distribution strategy. They sold millions of dollars a year of our product, their CEO, Was an investor in our company.\r\n\r\n\r\nAnd so we built this to start there, get it to profitability and then expand from there. And then we just got kicked in the teeth out of nowhere, change of ownership, change of leadership, and they shut it all down. And so I kicked around for another six months trying to make that company see if there was another way.\r\n\r\n\r\nAnd then it turned out there wasn't. And so we shut it down. You're talking about that portfolio company within the venture studio. You were trying to figure out.  And so we shut it down, returned money to investors. And we were able to give  the Venture Studio lost money because they've been paying me to work on it for nine months, but everybody else got their money back, which was great.\r\n\r\n\r\nTalk about what is a pitch deck?  Cause I mean, everybody kind of throws it around. Oh, it's a deck. It's a performer. It's a, you know, business plan. Like everyone, they all use them interchangeably, but like, how do you define a pitch deck?  A pitch deck at the end of the day is a sales document, but where you're selling is an idea. \r\n\r\n\r\nSo most of the time I'm working in venture backed companies or companies that are seeking venture backing. And most of the time they're seed series I'll do like a late stage series C series D. But most of the time I'm working with folks when they're selling an idea more than a product. They have a product, they have customers, they'll have revenue,  but it's still a dream.\r\n\r\n\r\nAnd so the job of this document is to get people to show up to a meeting and talk to the co founder to see if they actually want to pursue a potential investment. So I think of it as like a tender profile for a business vision. The goal is just people to get people to swipe, right. Show up to the meeting and then forget the deck.\r\n\r\n\r\nIt's a conversation,  but yeah, that's how I think about  it. Give me some broad strokes. What's a good length for a pitch deck. I've seen pitch decks that are like three paid three slides. I've seen pitch decks that are like 75 slides with footnotes annotated that'll link you to like, you know, supporting documentation. \r\n\r\n\r\nWhat's the, what's like the perfect link for a pitch deck.  If I was pitching my own company, I would almost always keep it at the 12 to 15 slides.  The average deck that my clients go out to raise with, it's like 17 slides plus a huge appendix, right? Now what's the difference there? The difference is that  I believe in putting only the most vitally important information in the main flow,  but a lot of times people say, Hey, this is my baby.\r\n\r\n\r\nThis other element that I've contributed or built is really important. And I'll say it is really important. But it's not vital to get to the meeting. And so I'd pull it up. And the reason behind that is that venture capitalists spend no time looking at your deck. I think it's three minutes and 37 seconds was the average.\r\n\r\n\r\nAnd so you're trying to explain  something incredibly complicated. And you have like 12 seconds per slide. And so no one's reading the footnote.  That's a real challenge because it's almost like a haiku. You have to boil and boil and boil down until you get to that one really interesting insight that gets them to pay more attention. \r\n\r\n\r\nThat's what I find very fascinating about social media. Twitter in particular is like  anybody can write a long document. It doesn't mean it's good. It just means anybody can write it. It's very difficult to write a short. 280 character tweet  that makes sense that is engaging and that is actually valuable to people.\r\n\r\n\r\nAnd it's like,  but the, that part of the process, the refinement process really actually gives you a skillset as a founder or as a leader to speak intelligently about your company. And I think a lot of people listening  now are, have been, or will be in that position where they've got to prepare a deck where it's like, Hey, I'm looking to buy this company.\r\n\r\n\r\nWe do invest. Sure. Send me the business plan. Send me your deck  for you. And I know it's different than a venture backed company, but it's still similar in its,  I guess, intention, right? It's a sales document. You're trying to get somebody to invest in your company.  What do you feel like are the top two or three or five, if you have them off the top of your head, mistakes that people make in creating their decks? \r\n\r\n\r\nAnd first I'll say,  anytime there's millions of dollars on the line and somebody wants a PowerPoint, I help those guys. So I've helped people raise Everything from ETA to I'm currently helping somebody potentially exit. They're not ready for a bank, but they do want a really nice document. And so anytime there's kind of that intersection of storytelling, business strap and business strategy,  we can be really helpful.\r\n\r\n\r\nAnd so my bread and butter is the really complex, deep tech stuff, but we'll help  a lawn mowing company that's thinking about an exit. We'll help anybody. I love that. That's very short.  Anytime there's a, an intersection of storytelling and business strategy.  Yeah. That's where your skillset comes into play. \r\n\r\n\r\nThat's awesome. High leverage situations.  Exactly. Places where there really are millions of dollars on the line, where the difference between a four X and a five X EBITDA multiple is huge. Is whether or not you're buying that second home or whether or not you're paying your investors back, right? It matters a lot.\r\n\r\n\r\nSo what are the top mistakes? What are the top, top mistakes people make in their deck creation?  Okay. One is that they're precise.  Don't be precise. Be simple. And so earlier today I said,  investors spend 12 seconds per slide. They don't actually ran the numbers. They spend 11. 6666  repeating seconds per slide.\r\n\r\n\r\nNow that is a level of detail that does not matter for the takeaway. So a lot of times I see people trying to add too much context. I could tell you all kinds of things about the complexity of telling a story about our precise process, about how we do it, about how I had to learn how to do it. But now it's the intersection of strategy, business strategy, and storytelling. \r\n\r\n\r\nThat's simple. And that captures the essence of it. And so don't fudge your numbers,  but  You often don't need as many numbers or as many decimal points as you currently have in your deck. So that's the first one. Be simple. Don't be precise.  A second one that I see people miss all the time on is they don't say what they mean.\r\n\r\n\r\nSo picture a PowerPoint presentation. And I probably just made everybody in the audience sad because they started picturing a PowerPoint presentation. Everybody hates PowerPoint because people use it. They're garbage at it. And they do absolute war crimes with bullet points and Canva templates. It's horrible.\r\n\r\n\r\nAnd so the last time you saw one, you probably had a slide that says something like growth or financials really big. And then just a table. Now, actually that slide has an argument,  but the argument is implied. It's not stated. And so every time I make a slide, I'm thinking about the headline, just like a newspaper.\r\n\r\n\r\nI'm trying to think about the core argument or thesis statement of the slide. And then I say the thing that I want the reader to believe. And then the rest of the slide is simply data to support that idea.  So instead of saying market and then having a bunch of data about the market down below, you say the market is large, fragmented and growing. \r\n\r\n\r\nAnd then down below you have data on the size, the fragmentation and the growth. Right. That's a really simple example, but a lot of times people imply what they mean. And often they do that because they don't know what they mean themselves.  It takes a lot of work to understand what you're actually trying to say and then to say it plainly. \r\n\r\n\r\nThat's a really interesting way to think about it. Like  it's almost like the passive aggressive way when you know, you're mad at your spouse and they're like,  Hey, how was dinner? I guess it was fine for being made late.  You know what I mean?  But like,  yeah, in those decks, you present all this data and you just expect somebody else to figure out what it means, but that's not, that's not the job of the listener.\r\n\r\n\r\nLike that's supporting documentation. That doesn't necessarily the thesis.  Exactly. You want that narrative. And so how I build decks is I actually don't start in PowerPoint. I start with a blank piece of paper and I write out the narrative arc and we've actually gotten incredibly nerdy about it. So we've.\r\n\r\n\r\nDiscover they're like six different narrative arcs that work in pitch decks. There's sort of like we call the murder mystery, the classic, there's the consumer behavior in the wild. Anyways, we're like derived all of these ways of kind of scoping the story out. So then you can kind of follow along and you need to think about who the hero is, who the Is the hero, the customers, the hero, the founders, who is the hero in the story?\r\n\r\n\r\nAnd let's tell a story.  My basic one second takeaway about how to make a business presentation that doesn't wildly suck  is to think about how you'd say the exact same information around a campfire instead of a conference room.  And so a lot of times people will say things like, I went to Stanford, the market for nanotechnology, like they talk like crazy people.\r\n\r\n\r\nBut then if you tell the same story around a campfire, you'd say, My last startup failed for a really stupid reason. I couldn't get SOC 2 certification fast enough. When I talked to my friends, it turns out a lot of them had the same problem. There are millions of these businesses that need this exact thing.\r\n\r\n\r\nAnd so I gathered together a plucky band of engineers and we worked on this problem for six months and realized that we actually could slay the dragon of SOC 2 certification. And so far it's working. We already have two paying customers paying us 10, 000 a month.  And so now we need to scale this. We need to tell the good news to the world, but to do that, we need help.\r\n\r\n\r\nAnd so we're asking you to join our plucky band by writing us a check for 5 million so that we can hire a CMO. And right, like that's a story more or less.  I love the way you're framing it too, because  telling it around a campfire. Makes it less scary. It makes it familiar. It makes it like you're talking to an audience of friends, right?\r\n\r\n\r\nLike the stakes are a little bit lower. And  that is the type of behavior that's going to build trust in people. The second you start overthinking a presentation, peacocking, you know, trying to be something that you're not,  that's where you have difficulty connecting with the audience. So like just even getting them in that frame of mind where it's like, Hey, look, you're telling a story around a campfire.\r\n\r\n\r\nOh, cool. I mean, that just  gets somebody naturally in a better place than  stressing about. Cool. How they're going to communicate in a business presentation. I think that's really cool framing.  Yeah. And it's just, I don't know, it's just more human, right? Like VCs,  bless their hearts are actually humans. And at the end of the day, humans like  pictures more than they like numbers. \r\n\r\n\r\nAnd I may not offer VC, but like really think about what's a story that would keep you engaged. And that's, I work with a lot of super technical and a third of my clients, 25 percent of my clients have PhDs. And so a lot of times I tell them, Hey, my job is to piss you off by oversimplifying the incredible science that you're doing  so that a venture capitalist feels like they understand it.\r\n\r\n\r\nAnd then once they feel like they understand it, we're going to get you in a room with their PhDs. And then you can both nerd out over all the complexities, but at first let's get you in the room. Right. And just tell the story. Like you're talking to. A smart sixth grader or for all of my, I always tell people, like, explain your business to me as if I'm your grandma. \r\n\r\n\r\nAnd one guy, he had a PhD in physics and he said, well, my grandmother also had a PhD in physics. So  it's not going to work, dummy. Yeah. Or it was like fine. And said, if you can't explain something to a sixth grader, you don't, or a six year old, you don't really understand it.  Yep. Figure out how to talk about what you do plainly. \r\n\r\n\r\nSo I love the ethos that you have in your company because I can tell you're passionate about it. I can also tell you're curious,  which like that curiosity allows you to ask dumb questions of very smart people in a way where they understand that you're trying to help them boil down. So anyway, I just think that's, that's really cool.\r\n\r\n\r\nThat's a really cool approach that you've figured out a way to build a company around not only a skill set, but something that kind of feeds you. That is one of my favorite parts of my job is that basically I have the world's smartest people explain their businesses to me and I get to tell them I'm an advocate for the dumbest person in the room.\r\n\r\n\r\nAnd so I'm going to ask really stupid questions. And so I have, and they say, yes. So I have just permission from like the top researchers in AI, from a guy who's built four top performing service businesses. I could be like, well, how do you actually do your customer management? No, no, like, like not like, how do you actually build a relationship with customers?\r\n\r\n\r\nAnd you just keep asking them until they tell me the answer. And it's incredible that I get paid by CEOs to ask them incredibly dumb or incredibly invasive questions about their business. Until I get real insight into their business. And then I can give those insights back to them. That's one of my favorite things to do.\r\n\r\n\r\nAnd this is like a wacky example, but  let's say I'm talking to a pilot and they're like, yeah, so anyways, we fly the plane from here to Seattle. And I'm like, well, how do you fly the plane? And at first they look at me like, I'm an idiot. Like, well, I fly the plane. Hello.  And, and I'm like, no, no, no, no. Like, how do you fly the plane? \r\n\r\n\r\nWhat's the first step? Like, oh, okay. So then they start walking me through and.  Everybody takes things at face value. Not everybody. Lots of people just take a comment that somebody says, and they take it for face value and they move on with it, but they never actually understand what that person just said.\r\n\r\n\r\nThey didn't actually internalize it. They don't actually understand how things work because either they're too afraid or they don't care or whatever to say. How does that work? And I don't care looking like an idiot because I'm just curious of what that means. And I could see how you talking to all of these, you know,  millions of degrees and brilliant people.\r\n\r\n\r\nThey're looking at you sideways many times. Like, what do you mean? You don't know it. Advanced aerodynamics is like, why I'm a smart sixth grader, but that's about it. I mean, I literally have rocket scientists as clients explaining rocket science to me all the time. And then the crazy thing though, is that I've started doing this enough where I had a client  and I had two clients in similar fields.\r\n\r\n\r\nThey were different. It was, there were adjacent markets, but they were similar enough where I could say, Hey, actually, here's this other business model to monetize your IP that you haven't thought of.  And they're like, Whoa, that's actually, can I meet that person and talk to them about it? And because I've done enough of these that now I kind of get it.\r\n\r\n\r\nOkay, guys, we're going to get back to the show in just one second. But first a message from a sponsor who is, uh, me. Oh, it's me. Cause I'm doing the show for free. Listen, I want to give you a hundred dollars. All you have to do is this go to apple or Spotify.  Give me five stars, write a review, screenshot that review, send it to me, Nick at cofounders.\r\n\r\n\r\ncom and you will be entered to win a hundred dollar Amazon gift card every four episodes. I am going to choose a winner at random and I'm going to do this five times, 500 for five stars. I just made that up. It's what I'm calling it. Please go to Apple or Spotify, leave a review, screenshot it, send it to me, Nick at cofounders.\r\n\r\n\r\ncom and you'll be entered to win a hundred dollar Amazon gift card. All right, let's get back to the show. You worked for BCG, Boston Consulting Group.  That is one of the top tier consultants, consulting companies in the world. And so like effectively what you get to do is you get to talk to the smartest people in the world that are building the coolest things. \r\n\r\n\r\nAnd you've already got that mind where from a consulting background, you're taking all these disparate things and trying to distill them into an answer for one person. You're a connector. And so like, you're effectively doing that, even though your job is to create decks for people, you're also like connecting the dots.\r\n\r\n\r\nMany times, which I think  anyways, that's fascinating. I think that would be an incredibly fun job. Let me ask you, how does the business function? So like, how do you get a customer? How do you get a client?  I'm hoping to begin getting more clients through things like this through a podcast or tomorrow. I'm doing a speaking gig for AI fund, adventure, sort of adventure studio bootcamps, that sort of thing.\r\n\r\n\r\nTwitter, you can see my unhinged tweets, that kind of thing. And so that's where about 25 percent of my business comes from today.  Now, 0 percent of my business came from there six months ago.  At that point, I had grown for five years purely on word of mouth. And so I haven't calculated the exact are not, I think is the technical epidemiological term.\r\n\r\n\r\nBut the question is for every person who gets infected, every customer I have, how many closed sales or new infected people do I get in the next 12 months? And my answer has been about 1. 5.  So I've grown sort of  roughly 50 percent year over year for the last three years since I've been full time. I'm almost, we're about to hit our three year anniversary.\r\n\r\n\r\nAnd that's purely every time we do a project, we get 1. 5 new projects based off of that person's recommendations. That's dude, that's crazy. What is it? Isn't the flu like 0. 7 and like anything over one is like incredibly contagious. It's yeah. If you're the whole population, we'll get it. If it's over one,  geez, Louise,  it's been a while since I've thought about are not. \r\n\r\n\r\nSo you're not doing any of the traditional marketing channels. You're not doing pay per click. You're not doing SEO. You're not optimizing for any of that stuff at the moment. The first nine months of my business, I didn't have a website and I didn't have in a  pitch deck for my own services. It was entirely, Matt's great go work with Matt.\r\n\r\n\r\nI talked to them. I hear, I just lived my sales process is entirely asking them questions about their business and then kind of like having ideas with them and jamming with them on the ideas. Yeah. And then people say, Oh, he gets it. Let's try it. Tell me like, so, okay. Either trailing 12 or projected 12 months for 2024, like what's your top line revenue going to be? \r\n\r\n\r\nWe're going to finish the year at about a million dollars in revenue. Three years for not marketing. That's a pretty amazing clip.  Are these repeat customers? Are the, or do your customers come in and they churn and you're done with them?  So we have, everything's project based. And so I do not have that sweet, sweet recurring revenue, or I have very little of it.\r\n\r\n\r\nSo, but I do is entirely project based because people don't need me forever. I do two weeks sprints with people to give them world class pitch decks, and then they go raise money. Now, right now I'm building, right now I'm building a deck for somebody. I don't have helped them with their pre seed and their seed, their seed decks.\r\n\r\n\r\nAnd now I'm sort of doing like a seed extension. So the same client has been very successful and is continuing to build an amazing company. And I help them in a new engagement every time they raise more capital. So that's pretty interesting. Yeah. But I also have these relationships with venture capital firms where whenever their portcos are raising, they'll bring me in.\r\n\r\n\r\nAnd so the person who's actually paying me is different each time, but the real client is the venture capitalist who knows that their life is going to be a lot easier. Their company is going to be a lot more successful if they raise money and raise it fast. And they know I understand the game. And so they'll bring me in to make the pitch decks for their portfolio companies.\r\n\r\n\r\nHow much do you charge per pitch?  Five and a half to 25 and a half thousand dollars.  That's a massive range. \r\n\r\n\r\nYeah. It's a range based on how much money they're raising. So like a VC company, they're raising a million bucks. I'm not sure. I'm 25 K for a million bucks, but  I  just helped with a 70 million raise.  Look, that's complicated. And there's a, like at that stage of the company, there's a lot more that you have to explain and starts breaking those common.\r\n\r\n\r\nIt's much harder for my team to do any of that work because at that point, it's like, this is a one off specialized thing that I have to build from scratch with my team. How many, how much business do you get from VCs who they're pitching to?  Do you get what I'm saying? Where they're like, wow, this is a really good deck.\r\n\r\n\r\nI'm going to reach out to Matt. Like who created this deck for you? Does that ever happen? Yes, it does. So I. I have a VC who I worked, a VC friend of mine brought me in. So there were like two professional investors on this one project. I already knew one of them. He brought me in, I helped them. Then I got a call from the other professional investor who was already in the deal saying, Whoa, that is way better.\r\n\r\n\r\nI have three more clients that need you with. And so I think I'm going to, I've done three projects for the same VC in the last four months. So he's brought me in on offensive. Have you ever sat down and penciled out like, okay, this is how many companies I've helped raise. This is how much capital I've helped raise.\r\n\r\n\r\nThis is how much enterprise value my raises have contributed to. I mean, obviously you're not privy to what they're worth today, right? Cause they're not necessarily marked market all the time, but like, have you ever gone through that exercise?  I've gone through part of it  and I have my, I just hired a new chief of staff and I'm going to stick him on this project. \r\n\r\n\r\nThe number that I know is that we've helped people raise about 2 billion so far. 2 billion. Yeah. 2 billion. Wait, wait. Oh, okay. Holy balls over. Okay. Over what period of time since I started probably five years ago, but most of that's been the last two years, five years, 2 billion. Is that  at 2 billion valuation?\r\n\r\n\r\nIt's like, okay, we raised a hundred million dollars, but the companies were rated or valued at 2 billion. No, you raised 2 billion in capital. Those companies, 2 billion in cash in the bank. Yeah.  Do you have any idea? The 2 billion, what the enterprise value of those companies were at the time of the raise. \r\n\r\n\r\nNo idea. But I mean, just, just, I can think about one company. They're raising a less than a quarter billion valuation, raising another 70, 70 to a hundred that helped them with. And so I have, yeah, this is, these are, some of these guys are huge companies. And you get to talk to the CEO, the CFO, the chief investment officer, like the chief operating officer, their investment team, their advisory board.\r\n\r\n\r\nLike you get to talk to everybody. So you can put together the best pitch deck. I sometimes in my meetings, I feel like I would have listened to that as a podcast. Where I have two guys and there are two of the leading researchers in AI in the world  and they were, and I was like, let me ask a really dumb question about rag again, but like, how does that actually help somebody?\r\n\r\n\r\nAnd those questions that you like really want to ask, you know, it wasn't Sam Altman, I wish, but like the question you really want to ask those like cutting edge guys, I get to ask them behind the scenes and they get to be vulnerable. Because I'm their defense attorney. Right. I get to, they're like, yeah, this is a problem in the business.\r\n\r\n\r\nUm, and I'm like, okay, let's think about how to fix it. It is ridiculous. The caliber of people that I get to sit with and think through really hard problems with it is so fun. So  this would be hard to do because you can't necessarily prove a counterfactual, but  do you think you could go through the process and be like, Hey, the companies that I've worked with closed at X percent, right?\r\n\r\n\r\nLike 95 percent of them hit their fundraising goals.  It would be interesting to then take those companies and say like versus the field or the control group that closed at a 75 percent clip or something like that. Like, is that something you could do?  It is. And it's not fair. It would make me look better than I deserve because I think I don't deserve credit when these guys raise money.\r\n\r\n\r\nSure. I mean, there's a bit of a selection bias as well. I get that, but it would still, it would still be just very interesting  to be able to say like, this is the percentage.  Yeah. My success rate versus the field would be absolutely silly, but that's also because like some of these are already venture backed companies that the VC is calling me on.\r\n\r\n\r\nSo the selection there is  selection bias makes it a really hard problem to answer, but here's what I am going to do is I'm going to make.  I'm going to take a pitch deck for a company that's out there in the wild. I'm going to change the company slightly so that it's a real, so that it's the same quality of deck, in other words, garbage, but that it's just a new company.\r\n\r\n\r\nAnd then I'm going to build an amazing pitch deck for the exact same idea. And then I'm going to pop up a fake email address and I'm going to email it to. 10, 000  professional investors. And I'm going to figure out the response rate. And the like open rate, response rate, click through rate, all of that for a normal deck and an audio deck and try to quantify the difference there, because I think the difference is going to be gigantic, but I'm going to run the experiment and see if you put the deck on a web page that's hosted, you will be able to track how long they're on each slide, how long they're on the page, et cetera, and be able to compare the two. \r\n\r\n\r\nThat would be a freaking really cool experiment. Yeah. Oh, I'm going to run it. And also, I don't feel bad at all about sending a bunch of VCs an email about a fake company, because I know that at most they're going to spend three and a half minutes looking at it. And so I'm like, nah, y'all can handle this.\r\n\r\n\r\nSo you've made a ton of connections. I made a ton of contacts.  Are you keeping a Rolodex? Like, do you ever keep in the back of your mind? Like, Hey, at some point I might do something where I need to raise some money. These are good connections. Or has it been more of just like, these are just good people to know.\r\n\r\n\r\nAnd they can mentor me. Do you ever think about those relationships in that context or no?  For sure. So I worked for two different guys who are now full time VCs  and they both. Are incredibly good at using air table as a CRM because no CRM was sufficient for their particular use cases and needs. And so I've studied under some masters of the CRM and I'm not a master at all.\r\n\r\n\r\nSorry. Can you just define what a CRM is? A customer relationship management is a category, but basically it's a gigantic, it's a Rolodex gigantic list of people, you know, and what you know about them. And when the last time you talked to him about and what they have going on. Companies can hat can range anywhere from Salesforce, which is.\r\n\r\n\r\nA very, very expensive implementation product to HubSpot, which is, you know, similar, but not as expensive all the way down to Airtable, which you can create customizable CRMs for, but it's just a little bit more time intensive to actually create it yourself. But CRM is just, it's a very, very important piece of software for companies, especially that need to track their customers.\r\n\r\n\r\nSorry. I just want to make sure that people. No, that's great.  I just broke one of my own rules is I never let my clients use acronyms index until they're defined because some percentage of people won't understand it. Right. And you got to keep it simple, but no, I mean, you have a, you have, everybody has a CRM, it's just a really dumb one.\r\n\r\n\r\nAnd it's called contacts on your phone. Right. So we all have this thing. I use mine for instance, like Nick, when you're like, I'm pushing my CRM and you'll be tagged, With a bunch of things like podcaster and deal mafia and small business owner and a bunch of things like that. And then that's in your phone.\r\n\r\n\r\nOr is that an air table? That's an air table, which is also on my phone. Awesome. And so then when I just want to figure out like, Hey, who's everybody I know in marketing, just filter, and then it's a list of people I know in marketing. And then I can be like, Oh, that's the right guy for that. What are the margins look like for the business that you're  currently operating? \r\n\r\n\r\nSo last year, I think we had.  Well, I'm going to, I'm going to continue paying my, like, I'm not going to include all SD, right. All sellers, discretionary earnings. I'm just going to talk about like the actual bottom line into the day margins. And so I think our margins are for like 35 to 40 percent last year, this year, there'll be about the same, but then next year, because they're  both of those were too low.\r\n\r\n\r\nI think this should be at maturity, a 50 to 60 percent margin business. And that's like fully loaded with all your overhead and everything. So if we do a million in revenue this year, I think we'll probably make 400.  Just saying cash at the end of the year, but it should be more like 600 because right now I've,  how big is your team?\r\n\r\n\r\nI know you just hired a chief of staff, but like what else is, what does your team look like? We have seven people right now. We should have nine in the next two months. And so the goal of the business longterm is that is to turn me into  a full time coach. And thought partner and client interactor. Right?\r\n\r\n\r\nSo my job is full time just to be like making content, thinking through the hardest problems in the deck, coaching my team. That's my job down the road right now. I also build slides.  Then we have one project leader and two analysts who really make. Slides, right? So one person who can really make a deck and manage the whole project by themselves, and then two other really great folks who are excellent at just building the slides and roughing out the story for that deck.\r\n\r\n\r\nAnd then I have two designers plus a chief of staff who handles all the admin and also make sure that my email inbox doesn't get completely clogged up. Has anyone ever told you that you sound like a famous business person?  No, I don't want it. I don't want to color you. You sound like Sam Altman.  No. Yeah.\r\n\r\n\r\nStabbed through the heart. Really?  Why don't you like that? Sam is incredibly thoughtful  and Now that you say that I completely see our similar cadence and tone. It's the cadence more than anything.  You're not as slow of a talker as he is. Like I have to listen to him three X speed for freaking Sam Altman. \r\n\r\n\r\nYou're very thoughtful. In your answers and, and the way that you think about things and the way you explain things, just the cadence sounds very similar. Anyways, that's all.  That's awesome.  All right. I've, I've gone longer than I wanted to go because this was freaking fascinating. Can I end with some rapid fire questions, please?\r\n\r\n\r\nAll right. What do you love about this business?  Learning and coaching.  Okay. What do you hate about it? Non recurring revenue.  Non recurring revenue.  It's project based. I make somebody wildly happy.  I cashed their check. They love me. And best case scenario, they never have to hire me again because their company got to profitability. \r\n\r\n\r\nYeah, that, that would suck.  That would suck.  What industries are you the most jealous of? I'm really not jealous of other people's. Okay. Stop it. Okay.  I'm not saying that you'd want to be doing something else. I'm saying, is there a business or something that you look at where you're like, man, it must be nice to, and maybe it's SAS, right?\r\n\r\n\r\nMaybe it's the recurring revenue of SAS. Here's the next business I'm starting. Okay. I'm going to start selling design services,  like a design service subscription to my clients after I work with them. So I'm going to build out my design team. And so once they've worked with us as a design team, because we're strategists, we're storytellers, we're also designers.\r\n\r\n\r\nAnd after we make their deck look beautiful or build a beautiful website for them or something like that, everybody needs design services down the road. And so I'm going to start fixing the non recurring part of my business by layering on a recurring revenue add on that makes a lot of sense.  000 a month for someone to have unlimited access to our designers to do everything from build a new website page to I need a business card or I want to.\r\n\r\n\r\nYeah. You know, Joe Benson is, I think actually we talked about this on the pre call. He has a website design company and he just shifted from like, okay, pay me 4, 000 upfront to design your website and then I'll do project based work for you if you need updates to pay me. Basically 300 a month in perpetuity and I'll host your site.\r\n\r\n\r\nI'll make it in limited updates for you. I'll be like your go to  it's a similar model to that, right? Like, Hey, I'll design your deck. I'll get you funded. But then any design needs that you need moving forward, any important high leverage conversations that you need, something communicated well, you can use our team.\r\n\r\n\r\nAnd here's the subscription model. And it makes sense too, because especially if you're helping seed precede a, even be rounded startups,  they're going to continue to have those high leverage conversations. Those don't just go away. They're either going to have to continue to raise more money, or they just need good distribution.\r\n\r\n\r\nThey need partners, et cetera. So I like that aspect of you adding it on  to a services, a recurring service. Exactly. The distinction here is that this will be none of the strategy or the storytelling. It'll only be the design. Right. And so that means that I don't have to touch it. And so the goal is to do, there's some guys really pioneering this business model where there's not many emails.\r\n\r\n\r\nIt's like a Trello board. I say, I need X designed 48 hours. You get X back, you want it redesigned 48 hours. You get it back. And so it's a really low touch business model  follows really naturally from my extremely high touch business model. It'll be really interesting.  Like right now you're the go to strategy guy because you've seen so much, right?\r\n\r\n\r\nYou have like a really broad set of experiences that allow you to connect with almost any type of founder, right? Oh, I'm a SAS business for manufacturing. Well, I'm a SAS business for hospitals. Well, I'm a SAS business for education. Like, Oh, cool. I've seen all those different types of models. Cool. Let me help you. \r\n\r\n\r\nWhat if, as you grew,  you used that Rolodex to essentially build a network of advisors, That you could then match with companies where you're like, Hey, look, cause then that takes you out of having to be the one to go and consult with them to be like, Hey, I'll match you with Brian. He's fantastic. I know he's seen a lot of these type of deals.\r\n\r\n\r\nHe'll give you the feedback on your pitch deck moving forward. Right. Or I'll match you with John. He knows. International manufacturing SAS products really, really well. Let me hook you up, right? Cause you're building this Rolodex of people that you know, and you can only scale yourself and your skills so far until you hit a cap for what you can actually like reasonably coach or consult on, that would be a really interesting way to kind of unlock the next level.\r\n\r\n\r\nI don't know if you've ever thought about that.  So I think there's a really interesting things there. So today I was talking with the founder and they have an AI that layers on top of existing.  EHRs, electronic health record systems, and basically just pulls out the relevant insights, right? It's just a bunch of nasty data.\r\n\r\n\r\nAnd they just say like, Hey, this are the three things you need to know. Well, I built a deck for a company that does the same thing on top of police databases.  And so I said, Oh, I know guys who have done the same, solved the https: otter. ai AI problem and a wildly different field for wildly different audience.\r\n\r\n\r\nI bet there's a bunch of things that could be really valuable for you to talk about. And so I just send that connection email.  I think of that as my longterm value down the road is eventually I think all I'll do is I'll just be the guy who is a super connector who just points people to the right people.\r\n\r\n\r\nBut I'm also not trying to scale that much. I want to run a 3 million top line business spitting out a million and a half or 2 million cash every year. I  think I can get there in five years, I think I can do it, but where I'm taking wildly good care of all of my employees, my customers are absolutely delighted our systems and automations and everything.\r\n\r\n\r\nI mean, we're doing some of the best at work in the world at a really sustainable pace because at the end of the day, my wife's a surgeon. And so at the day, my kid throws a rock at another kid  at preschool. I'm the one going and doing that. And so I'm building my company, not for scale, not to maximize profit.\r\n\r\n\r\nI'm trying to build a delightful little business that makes the world, like just, that really solves a set of problems. And that enables me to be a really good dad and husband, because like, if I was trying to maximize cash, I wouldn't do this, I'm gonna do this job,  but I'm trying to maximize for some others.\r\n\r\n\r\nReally? What would you do?  Oh, I'd absolutely be an investor.  Really?  Yeah. Oh, a hundred percent. I could go call up. I could call up some of my friends. I also teach a class on venture capital investing. I'm a part time professor at Texas A& M, which is a blast. But I could almost certainly, I know one guy who runs a private equity firm who's already told me that he'll hire me whenever, and then I'll start like clipping fees on stuff, flipping fees on big funds, but I'd be miserable.\r\n\r\n\r\nSo I don't want to do it. I'm not mad. I would hate my life. Yeah. Oh my gosh. No.  Oh my gosh. Okay. Fair.  Last two questions. First question is if you have two hours in your day, no family responsibilities, no work responsibilities, what are you obsessed with right now? What are you doing with those two hours?\r\n\r\n\r\nSaturday, I did this and I binge listened to two business books while building stuff in my backyard.  And so that's what I would do. If I had an extra  hour every night, I would be DIY ing while absolutely  hammering.  Business or history books. What were the books? I, the books,  it was a hundred million dollar leads and a hundred million dollar offers was from my books.\r\n\r\n\r\nMy brother, Nolan, who runs his own landscaping business, he said, Matt, you have to listen to these. I know you're going to be annoyed at how much you like them. And that's exactly what happened. I was very annoyed at how they were.  It's so I had the reaction. Cause like you want, you'd want to not like Alex Hormozy.\r\n\r\n\r\nDesperately. You're like, dude, put on a shirt, get the freaking nose strip off your nose. Like we get it. You're strong.  But then you listen to his books and you're like, that makes a lot of sense. Like he has thought behind what he's putting out and he's annoyingly likable. Exactly. And insightful. And  they're great books.\r\n\r\n\r\nThey're great books and I wanted to hate them and I loved both of them. So yeah, I just like crushed two of those books on a Saturday. And they're great books for the reason that you said earlier, like they're written for a smart sixth grader.  Yes. They're not deep detailed philosophical books on marketing and philosophy.\r\n\r\n\r\nNo, they're like very practical. Here's what you should do and why. And here are the stories that I have to support why I was successful. Yes. So I am an incredibly deep nerd. So like, I, I read like a hundred to 200 books a year. I  like love, I love comp, I love philosophy. I love the really, really nerdy stuff.\r\n\r\n\r\nAnd I try to talk like a sixth grader 90 percent of the time, because that's how you communicate well. And so it is really funny for me. My job is just like, and it's not dumbing it down. Like it's actually, it's more work on your end. So it's less work on their end because like there's a certain amount of work involved in transferring an idea from your head to somebody else's head. \r\n\r\n\r\nWhat I try to do is say, I want the venture capitalist who is paid to think about this. To not have to think at all to make it just as just smooth that as much as possible. Cause someone's going to do that work. It's either you're going to ask your audience to do that work or you're going to do that work for your audience. \r\n\r\n\r\nYeah. Your goal is to get someone to say, Oh, that makes sense. Oh, it's just like X, Y, and Z, right? You don't want them to have to think through why something makes sense. They need to understand it on its face  through your explanation. So I like the way that you frame that.  Okay. Last question. No. You're 24, 25. \r\n\r\n\r\nNo, I'm 30,  30. Okay.  31. I don't know how old I  think I'm 30. We'll say 30.  What advice would you give yourself 10 years ago?  Be extremely valuable to extremely powerful people.  I got this entire job.  I have this entire profession because my boss, who is an absolute killer and who was a killer at the time and has been wildly successful since then, He said, Matt, will you spend six hours making PowerPoint slides for free late at night after you finish your day job?\r\n\r\n\r\nAnd he thought he could ask me that because I was the guy who, whenever he had a problem, would just be like, Oh, I can solve that. And I just figured out how to solve it. And then I did it. He was like, wow. Okay.  And then I was very valuable to him  and could solve problems for him.  And if you just find people who are really powerful, really successful, and you just solve their problems for them, they're going to give you increasing amounts of responsibility, increasing amounts of access, and teach you the skills that you need to have to solve their next problem for them. \r\n\r\n\r\nI love that answer, man. I love that answer. It's beautiful. Where's the best place for people to find you, your company, your thoughts. Best places on LinkedIn, just Matt W Gore, or it's going to be Twitter where I'm Goracle of Delphi.  You know, there's the nerdiness coming through. So it's the Oracle of Delphi, but with a G Oracle  and what's your company name? \r\n\r\n\r\nOptio. Oh, PTIO.  Optio. All right, Matt, this was, this was awesome. I need to have you back on. Thanks so much, Nick. I'd love that. I felt like we could have had like an hour long conversation on like several different side.  Pieces where we're both trying to figure out answers to these really interesting business problems.\r\n\r\n\r\nSo, okay, we gotta do that sometime. Agreed. This was awesome, my friend. Let's do this again.  All right. That's it. Another one for the books. I I'm fired up. I don't know what else to say. I hope you found something valuable in that conversation. I hope you learned something. I hope there's something that you can apply to your business today, tomorrow, in the future, that.\r\n\r\n\r\nIt makes you money. It makes you more successful. It gives you more time with your kids. If there was something I'd love to hear about it in the comments below, you know, give me some feedback. And if you like actionable advice and you want more of this, I write a weekly newsletter that gives insights, tips, and tricks into the world of entrepreneurship.\r\n\r\n\r\nSubscribe in my bio.  And if I can help you in any way in your entrepreneurial journey, don't hesitate to reach out to me, Nick at co founders. com. Sorry, Kelly, for more emails. And the last thing is. Remember,  curiosity is a superpower and you can use it to your advantage. As my mom used to say, there's no such thing as a dumb question. \r\n\r\n\r\nOnly dumb people.  We'll see you next time.",
  "metadata": {
    "duration": "",
    "date": "2024-08-09",
    "platform_source": "Google Drive"
  }
}