{
  "episode_number": "209",
  "episode_title": "How to Optimize Your SEO for the AI-First Search Era with Ryan Doser",
  "guest_name": "Ryan Doser",
  "business_name": "",
  "transcript": "﻿Nikolas Hulewsky (00:00.105)\r\nSo.\r\n\r\n\r\nRyan Doser (00:00.566)\r\nYeah, and first, do go by Nicholas or Nick? Nick. OK, perfect.\r\n\r\n\r\nNikolas Hulewsky (00:03.051)\r\nNick. Yeah, Nick. Great question. All right, Ryan, I am really stoked to have you. When I came across your YouTube YouTube page in particular, I just thought I have to talk to this guy because you're doing incredible things and utilizing AI. You're showing people how to utilize AI in their business right now, especially people like me who are just trying to figure it out. They're trying to get to the first million dollars and everyone's talking about AI. But how do I actually leverage AI in a way that's going to make me money? And that's all your content is about.\r\n\r\n\r\nHow do you take these tools that we currently have and figure out ways to increase distribution or to improve your brand or to repurpose content or to, you know, find a way to get another employee on board that you can't necessarily afford to have. for those who are just listening for the first time, Ryan Doser, you've got a YouTube channel, 20,000 subscribers. You've got more than 10 years of experience in marketing. You've done marketing for the big boys, people.com, Home and Garden. You've managed multi-million dollar media budgets. You've been featured on all the sites.\r\n\r\n\r\nlike, who are you saying, Forbes and Business Insider? Yeah. Google. dude, the Adam Newman quote. Google me. Google me. So good. Okay, so you've like done some real freaking things with your life. How did you get into what you're doing right now?\r\n\r\n\r\nRyan Doser (01:02.52)\r\nYeah, Forbes, daily upside. Just Google my name. You'll find it. Yeah.\r\n\r\n\r\nRyan Doser (01:10.242)\r\nYeah, Google me. Yeah, yeah, yeah.\r\n\r\n\r\nRyan Doser (01:24.376)\r\nWell, first of all, Nick, I appreciate you having me on. You've had some very good guests and a lot of great topics that you've covered on this show. So it's an honor to be here. First and foremost, I would say what really got me started. I started down the traditional path of nine to five corporate America. I was there for about 18 months or a year and a half at Meredith corporation. You mentioned people.com. So I was running multi, multi-million dollar paid marketing budgets for people, better homes and gardens, and all the other titles that now dot dash Meredith own. So we're talking, you know,\r\n\r\n\r\nNikolas Hulewsky (01:32.597)\r\nThank you.\r\n\r\n\r\nRyan Doser (01:53.422)\r\n30, 40 plus brands at this point, all very big names. And from there, I really got sick of the traditional nine to five corporate lifestyle. I realized after reading the four hour work week by Tim Ferriss, that was kind of what ignited by my spark, so to say, I quickly realized that the system rewards busyness over actual production. And I didn't want to sit there for 40 years.\r\n\r\n\r\nNikolas Hulewsky (01:56.491)\r\nMmm.\r\n\r\n\r\nRyan Doser (02:17.204)\r\nlooking busy for 20 hours while I work for the other 20 because that's what I was doing. That was a traditional nine to five corporate. Very grateful for my old boss and company for hiring me, getting my foot in the door, don't get me wrong there. But that was what really ignited everything. And he had this quote that stuck with me in the four hour work week, which I don't know if you've read, obviously it's a very popular book. Most people choose the path of unhappiness over uncertainty because of fear of the unknown. And so that's always stuck with me is choosing uncertainty over unhappiness.\r\n\r\n\r\nNikolas Hulewsky (02:36.299)\r\nI've never read it.\r\n\r\n\r\nRyan Doser (02:45.986)\r\nAnd so from there, about two months in into the job, I started a blog, I started learning SEO. was like, what is this SEO thing? And I started learning SEO, affiliate marketing, email marketing, and all the other parts that go into the digital marketing umbrella. Really, I was self-taught combination of trial and error combination, just kind of putting myself out there, know, spinning up WordPress sites, spinning up campaigns, and just seeing what happens alongside that nine to five. And then I got my first client.\r\n\r\n\r\nNikolas Hulewsky (02:47.979)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (03:06.315)\r\nRyan Doser (03:12.622)\r\nand just kind of said screw it and just see what happens. I kind of took that leap of faith and we're here ever since 2019 essentially.\r\n\r\n\r\nNikolas Hulewsky (03:18.389)\r\nGood for you, man. How old are you?\r\n\r\n\r\nRyan Doser (03:22.83)\r\nI'm 29.\r\n\r\n\r\nNikolas Hulewsky (03:24.619)\r\n29, okay. Married, kids, no kids?\r\n\r\n\r\nRyan Doser (03:27.8)\r\nJust got married last August, so coming up on the one year anniversary.\r\n\r\n\r\nNikolas Hulewsky (03:31.517)\r\nOkay, and so did you make the leap before or after you got married?\r\n\r\n\r\nRyan Doser (03:34.478)\r\nI made the leap in 2019, this was well before I met my current wife.\r\n\r\n\r\nNikolas Hulewsky (03:37.171)\r\nOkay, okay, okay, cool. Dude, what I think is interesting is you referenced that quote, which I haven't heard from Tim Ferriss before, which is, most people choose the path of unhappiness over the path of uncertainty. And it's really just a rephrasing of a very old saying, which is the devil you know over the devil you don't, right? Like people choose the devil they know because, hey, at least I know what to expect if I go and try this new thing. I don't know what to expect. That's scary.\r\n\r\n\r\nBut it holds a lot of people back. I mean, it holds a lot of people back from actually doing the things that they want to do. So when you read that, did you just start, hey, I'm gonna start on the side trying to do this stuff? Or were you like, that's so true, I'm out.\r\n\r\n\r\nRyan Doser (04:21.548)\r\nNo, no, it was on the side for sure. And, you know, I was literally sitting there at work reading it and he, gave this example of he used to work in corporate. So he gave this example of something that I resonated to right away where he said, if you want to be the best corporate employee, walk around with a stack of papers with your phone up to your ear and talk and act like you're talking to someone. my God, that guy deserves a raise. What is he doing? He must be doing something really important, right? It's this facade of busyness. And so once I started to learn that concept, started doing my own stuff on the side,\r\n\r\n\r\nNikolas Hulewsky (04:29.054)\r\nNikolas Hulewsky (04:47.466)\r\nYeah.\r\n\r\n\r\nRyan Doser (04:51.17)\r\ndidn't dive in right away. know people that, you know, take the leap of faith initially instantly and just go for it. I kind of weaved my way into it, so to say. But yeah, it's, you know, fast forward to today. I'm just a solopreneur YouTuber, like you mentioned, run a marketing agency with more than one client now focusing on high ticket Legion. You know, I got a lot of moving parts here and that's probably the good and a bad thing diversifies revenue, but also kind of pulls me away when it shouldn't. So I'm all over the place today, Nick, if I'm being honest.\r\n\r\n\r\nNikolas Hulewsky (05:15.145)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (05:20.927)\r\nDude, no, that's amazing. And that's the cool thing about entrepreneurship for people like you and I is I can tickle my curiosity anytime I want. I can follow this project or do that thing because I don't have a boss necessarily telling me what to do every second of every day. It's also the downside. It's like sometimes you wake up and you're like, wait, what should I be working on right now? And if you're not organized or have a system, that can be scary and overwhelming. When did you start messing around with AI?\r\n\r\n\r\nRyan Doser (05:47.544)\r\nYeah, my first look of AI was 2021. Well, I probably used it before that, but the most vivid memory in my mind is 2021. Jarvis AI, now Jasper AI, they got sued by Disney, had to rebrand, didn't realize what they were doing at the time, but it was the first iteration of what we now know today as rappers, AI rappers. They were using GPT-3, the API key behind the scenes on top of a fancy website. And I started using this and my mind was blown instantly.\r\n\r\n\r\nNikolas Hulewsky (05:57.653)\r\nMm-hmm.\r\n\r\n\r\nRyan Doser (06:13.646)\r\nI thought, wow, okay, I need to really rethink about everything that I know currently about SEO, copywriting, and really marketing as a whole. Because once Jasper came out and it started to gain some traction, I'm sure you're familiar with Jasper, well then ChatGPT launched, right? OpenAI launched an actual LLM or an interface where we could start using OpenAI's models called ChatGPT in November of 2022. And that's when things really started to take off.\r\n\r\n\r\nNikolas Hulewsky (06:37.087)\r\nYep. Yeah. So for people who don't know Jasper, what is was a tool that people would use for copywriting, especially on social media. You know, you're trying to ideate. You're trying to, Hey, this is something that I'm thinking about or here's some data points. Like, can you help me write something pithy or can you help me write a long blog post, et cetera? So Jasper AI was my first introduction to AI as well. But now we have Claude and we have Chachi Petit and we have Grok and we have\r\n\r\n\r\na plethora of different tools that we can kind of use at our disposal. So at that point, you were focusing pretty heavily on SEO, I'm assuming, if you're writing that much content with Jasper.\r\n\r\n\r\nRyan Doser (07:16.086)\r\nYeah, absolutely. I still do a decent amount of SEO work, but I'm kind of starting to pivot out of it. just, see the writing on the wall for traditional top of funnel informational SEO with AI search and AI generated groups coming into play. But yeah, now I'm kind of focused more on the YouTube and local SEO side of things with that. So that's a whole other conversation, but I'm very bullish on those avenues of SEO.\r\n\r\n\r\nNikolas Hulewsky (07:27.199)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (07:36.619)\r\nOkay, dude, I want to talk about both of those things. So Google, for whatever reason, waited for a really long time to have AI answers in their searches. And they've turned it on now. And they said it there at IO, hey, we've figured out the monetization model. So they figured it out at this point. I think they were waiting because obviously, dude, Google search was like the most profitable business of all time. It's just like an amazing business. It's just printed money. And obviously, they don't want to cannibalize that business. So it took them a while to figure out how to monetize this stuff.\r\n\r\n\r\nAnyways, so they've figured out now how to add AI answers into each one of these searches. But it has a lot of people scared. It has a lot of people scared because they're like, well, what does that mean for my SEO? What does that mean for like trying to rank? And how do I actually drive traffic to my website? And so what you're saying is, I've kind of pivoted away from that kind of SEO to now YouTube and video. Can you talk about why? what's the thesis behind that?\r\n\r\n\r\nRyan Doser (08:11.629)\r\nYeah.\r\n\r\n\r\nRyan Doser (08:31.694)\r\nAbsolutely. Well, first and foremost, SERPs have been busy since getting busier since, you know, 2016, 2017, 2018. Google has traditionally always been seeking what's called a zero click search experience. They want people to stay on the search engine as long as possible without giving that traffic to a third party publisher. We saw this through featured snippets. That was one of the first iterations of AI search. Then we went into AI overviews now we have Google AI mode, right? Where it has a whole tab.\r\n\r\n\r\nAnd it's just a generated a whole page of AI generated results. But anyways, what you asked there, the big reason is YouTube SEO. Look at YouTube as kind of your foundation for content. So YouTube SEO, in my opinion, look at the results on YouTube. They're not AI generated. In my opinion, I don't think Google's going to have AI generated YouTube results because you look at the intent of someone for searching on YouTube. They want long form video. Sure. There's a whole audience dedicated to shorts.\r\n\r\n\r\nbut I am so bullish on long form YouTube videos and YouTube SEO because A, you can use it as your content foundation to repurpose it with AI for other mediums. And B, I don't see YouTube SEO going anywhere. And if you not to mention, if you look at traditional Google search, they're actually putting more YouTube videos in the search for various queries instead of traditional third party websites because Google is an alphabet owned entity, right? So they're going to keep promoting all of their different products in traditional Google search as well.\r\n\r\n\r\nNikolas Hulewsky (09:55.861)\r\nWhat's a serp? I don't know what that is.\r\n\r\n\r\nRyan Doser (09:57.495)\r\nsorry, yeah, search engine results page.\r\n\r\n\r\nNikolas Hulewsky (10:00.479)\r\nokay, search engine results page. So, do you think that, is there a way to show in the data that like, actually video is getting more and more of a share of the click through or of the results? Or is this a feeling that you have of like, no, I just think we're getting more of it. Like why the thesis?\r\n\r\n\r\nRyan Doser (10:17.592)\r\nI don't have any concrete evidence, but if you just do general searches for different things in your niche or other niches, I almost guarantee you're gonna start to see more YouTube videos pop up.\r\n\r\n\r\nNikolas Hulewsky (10:27.529)\r\nWell, if you look at the underlying thesis of SEO, what are you doing? You're building trust. You want people to trust you, but you also want Google to trust you. That's why you do backlinks. That's why you want to be somebody who they look at and are like, they're reputable. They have a lot of information. There's a lot of backlinks. People look at them. We'll reference their site. In my opinion, video is probably the best way to build trust at scale because they're seeing you. They're hearing you.\r\n\r\n\r\nand you're able to communicate your ideas, right? Like if I say to you, Ryan, you're a freaking moron. Or if I say, Ryan, you're a freaking moron. Those are two very different meanings in there, right? And that doesn't necessarily come across in written form. But if you see a video, it's like, I like Ryan. He has a cool sense of humor. I like Nick, he's quirky. And so I think building a trusted scale has always been the name of the game when you're doing this organic marketing and video, man. There's just, in my opinion, there's no better way to build trusted scale than.\r\n\r\n\r\nvideo.\r\n\r\n\r\nRyan Doser (11:25.826)\r\nYeah, I would say long form video. would kind of disagree with that on the short form side. I see that more just kind of a quick dopamine hit. I also forgot to mention that YouTube is the second biggest search engine in the world behind Google. So people don't even realize that YouTube is the second biggest search engine. Not to mention you think of the branding behind YouTube. You have people on one camp saying, TikTok sucks. We don't trust Google and this and that. But in my opinion, YouTube seems to be getting more popular and you don't really hear a lot of negativity around it. It's got a pretty good brand behind it.\r\n\r\n\r\nNikolas Hulewsky (11:30.272)\r\nYeah.\r\n\r\n\r\nTotally.\r\n\r\n\r\nNikolas Hulewsky (11:53.673)\r\nYeah. Well, and this, is an idea that I'm literally just thinking of on the spot. I saw this interview with Elon Musk and he was like, at this point, we are models have all been trained on the totality of human knowledge. So it's like, okay, we've uploaded all the books and all the studies and everything. And it's been trained now in order for AI to keep up, like it's going to have to ingest new information. Where is new information being published? It's like long form video. so Google owning that platform, I think pointing people to platform makes sense to me as well.\r\n\r\n\r\nI also totally agree. Shorts is not the best way to build trust. Shorts is a really good way to point people to your long form. But no, you're not building trust at scale with shorts. Totally, totally top of funnel. So you saw that and you had already been doing the SEO, the pay per click, you'd been doing digital marketing. When did you decide, you know what, I should put my money where my mouth is and I'm gonna start a YouTube channel?\r\n\r\n\r\nRyan Doser (12:33.518)\r\nI agree, it's top of funnel.\r\n\r\n\r\nRyan Doser (12:46.83)\r\nof 2023. So it's actually been less than two years. And I actually I talked to Roberto Blake. I don't know if you know who that is. I had him on my podcast. He's a big time YouTuber and he brought up the statistic that 97 % of all YouTubers have less than 10,000 subscribers. So technically speaking, Nick, I'm a top 3 % YouTuber, which is honestly wild to think about because I have no creativity. I still get scared talking to the camera. I know nothing about editing or graphic design.\r\n\r\n\r\nNikolas Hulewsky (12:54.09)\r\nI do not.\r\n\r\n\r\nRyan Doser (13:14.818)\r\nbut it's my SEO background that's really fueled all of this growth. And that's what I've learned from this whole thing.\r\n\r\n\r\nNikolas Hulewsky (13:20.981)\r\nDo, okay, say the number again. What percentage have less than 10,000 subscribers?\r\n\r\n\r\nRyan Doser (13:24.066)\r\nYet 97 % of all YouTube channels have less than 10,000 subscribers.\r\n\r\n\r\nNikolas Hulewsky (13:29.931)\r\nHoly crap, man, that's insane. So how long did it take you to go from zero to kind of that 10,000 mark?\r\n\r\n\r\nRyan Doser (13:39.02)\r\nzero to 10,000, probably between 10 and 13 months. It took me about 20 months to hit 20,000.\r\n\r\n\r\nNikolas Hulewsky (13:46.333)\r\nOkay, so it definitely a shorter period of time. The thing I've noticed about social platforms in particular is that at least the way that they're moving to is it doesn't really matter how many subscribers you have anymore, especially on Twitter. Twitter used to when you had a lot of subscribers or followers, you could post something and most of them would see it. But now every platform is really prioritizing whether or not that content is engaging, viral, whatever you want to call it.\r\n\r\n\r\nAnd so I've seen that on YouTube as well. Now there are subscribers, they have the notifications turned on. You're in your big account. You're obviously going to get traffic that way, but there are small accounts who are just starting out. And if your video is good and people are sharing it and they're liking it, that algorithm is going to push you and it's going to push you for a really, really long time. So my, my question kind of in framing that is people are really nervous about getting onto YouTube.\r\n\r\n\r\nbecause they're like, I don't have anything to say. And in a weird way, it's like, yeah, you need to have something good to say, otherwise the algorithm is not going to push you. But you're not going to get good at it unless you publishing a bunch of crap. So how did you find the balance? Like, what was your thought process in getting started on YouTube?\r\n\r\n\r\nRyan Doser (14:55.212)\r\nYeah, myself included actually, Nick. Funny enough, I still get the jitters every time I hit the record button and I don't consider myself very good on camera to this day. But really the difference between what my strategy is, I think we should first differentiate between educators versus entertainers. Most people go on YouTube to be entertainers, which in my opinion is a bad idea unless you're attractive or you have a good personality. Most people in my opinion should default to educators. Find a niche that you know a lot about that you're passionate about and\r\n\r\n\r\nNikolas Hulewsky (15:17.547)\r\nMmm.\r\n\r\n\r\nRyan Doser (15:24.546)\r\nyou know, to add a cherry on top, maybe a lot of people are searching for it has a lot of high ticket affiliate opportunities or sponsorship opportunities behind it. But for me, I saw that the mix of AI and marketing as being a niche that I could really dive into and go after all sorts of good keywords, right? A lot of review content, a lot of comparison content, a lot of how to content, one of my best videos, 10 best AI tools for marketing and content creation. That's a big keyword, best AI tools for marketing. And so\r\n\r\n\r\nNikolas Hulewsky (15:42.258)\r\nNo.\r\n\r\n\r\nRyan Doser (15:53.002)\r\nOnce you attach a keyword behind each video that you go after, not saying every single video has to have a keyword behind it, but 90 to 95 % of your videos should have a target keyword behind it and optimize for that keyword in title, thumbnail, hook, whole packaging, know, throughout the, throughout the retention and the description, I can go into all the little elements of SEO if you want me to. Yeah, but that's what I would recommend people do is focus on the education side versus the entertainment side and find a niche that you're passionate. You know, a lot about.\r\n\r\n\r\nNikolas Hulewsky (16:14.001)\r\nSo interesting,\r\n\r\n\r\nNikolas Hulewsky (16:23.167)\r\nYeah, when I first started getting into social media, I started on Twitter and then obviously I started a podcast and many people associate, you're doing social media. You want to be famous, right? And so I use different terminology. You use entertainer, I use famous and then I use for business purposes and you use education, which yours are way better. I'm probably going to steal those. But yeah, there are people who are like, I want to be famous. And so they get into social media, but\r\n\r\n\r\nFor me, it was like, no, I want to meet people. I want to network. I want to build a brand. I want to actually have an opportunity to learn. So that's why I got in to social media. I was just kind of like documenting my experience. And I think that many entrepreneurs still have that misconception of, if I'm, if I'm making content, it's because I, have to have the latest Tik TOK or I'm trying to be an entertainer. It's like, no, man, you're, building a brand and like now to frame it in the context that you're saying where you're viewing it as your modern SEO.\r\n\r\n\r\nmakes total sense because you've got the thumbnail and you've got CTR and you've got average view duration and you want to know the click through rate and of the end screen links. Like it's just sort of now an extension of that digital marketing, right?\r\n\r\n\r\nRyan Doser (17:35.896)\r\nYeah, and you know, I think packaging is everything on YouTube. You could apply this to any marketing channel in my opinion, but it starts with target keyword, title, thumbnail, hook. If you don't have those things dialed in, say goodbye to the rest of any potential success on any video that you publish.\r\n\r\n\r\nNikolas Hulewsky (17:40.171)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (17:52.779)\r\nDo you recommend that entrepreneurs, whether or not they feel like they're good on camera, should start a YouTube channel?\r\n\r\n\r\nRyan Doser (17:59.074)\r\nI do, you know, I think there's a lot of things that you can learn from it. Obviously there comes the benefits of getting targeted keywords on YouTube, getting more traffic leads revenue from YouTube. But think about psychologically and mentally what that does to overcome a barrier. Hey, I'm not good on video. I'm not good on camera. But then you push yourself to actually do it, which I've seen benefits from this in the real world, networking with people and talking to people. It's overcoming that hump of being scared on camera, being scared to actually put yourself out there.\r\n\r\n\r\nI think psychologically that does a lot more and has a trickle effect to other areas of business.\r\n\r\n\r\nNikolas Hulewsky (18:33.417)\r\nYeah, I have a friend of mine who started, do know what ADUs are?\r\n\r\n\r\nRyan Doser (18:37.983)\r\nSay that again.\r\n\r\n\r\nNikolas Hulewsky (18:39.249)\r\nADU that's an additional dwelling unit and they're getting really popular in states like California where real estate is getting really expensive and people are aging and they can't necessarily put their parents in a home but their parents can't necessarily afford to live by themselves and so they'll build this what's called ADU. I can't remember the exact specifications for it it's like let's call it a thousand square feet or less but it's an additional dwelling unit on their property so they can go to the bank and they can pull on their line of credit.\r\n\r\n\r\nRyan Doser (18:42.081)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (19:07.793)\r\nor the equity in their home to build this ADU. And it's a win-win. It adds value to the property. It allows their parents or whoever to move in. It's great. And so it's become really popular in California. And a friend of mine started an ADU company five years ago, right when COVID started. And they're doing great. They do one ADU a week on average. Next year, they're projected to do two ADUs a week. An ADU is $300,000. So they're doing like $15 million a year this year in revenue. It's incredible.\r\n\r\n\r\nAnd he was telling me about their main marketing channels. And I was like, okay, so are you doing like pay per click? Are you doing like meta ads? And he was like, no, our two biggest marketing channels are one non media. We just hold an open house. So after they build the ADU in the neighborhood, they hold an open house and then they get a ton of referrals that way. And then the second one is Instagram. He's like, we put educational content out on Instagram. And he's like, check out our Instagram. We have 4,000 followers. And I was, cool. So, you know, I wouldn't looked at it backyard estates if anyone's wondering.\r\n\r\n\r\nAnd those two things have been like their deal flow. And that was interesting to me. And now talking to you in that context of these are traditional entrepreneurs and now they're starting to see like the media piece isn't just funny TikTok dances. Like this is driving real value to people.\r\n\r\n\r\nRyan Doser (20:23.746)\r\nYeah, you know, I would encourage him to do long form YouTube and then use AI to repurpose that into short clips that he could then go down Instagram reels and TikTok and all sorts of other things.\r\n\r\n\r\nNikolas Hulewsky (20:33.973)\r\nGo on.\r\n\r\n\r\nRyan Doser (20:35.916)\r\nYeah, I mean, that's, that's what my playbook is. And I've seen this work for other businesses. You start with long form video as the foundation upload to YouTube. I mean, you can have a podcast, upload that to podcast platforms as well. And then you leverage AI. I have an automation. mean, we can talk about that later on how I repurpose my YouTube videos, but then you leverage AI to repurpose that long form video into short form content variations through clips for Tik TOK reels, know, Facebook, et cetera.\r\n\r\n\r\nand also short form posts, whatever platform that may be, right? Twitter, Facebook, text-based content, but also email content. You can repurpose that into email newsletters every week. You can repurpose this into emails for a drip sequence. These are just some of the examples that I've done. I also repurpose it into video scripts for my clone. That's just another thing you can do.\r\n\r\n\r\nNikolas Hulewsky (21:05.663)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (21:19.915)\r\nInteresting.\r\n\r\n\r\nNikolas Hulewsky (21:23.627)\r\nOkay, so if I'm an entrepreneur, let's say that I'm ADUs, right? And there's a million pain points that people could have. There could be, do I finance them? How do I pick the right contractors? How do I know what size ADU to build? What architect should I use? Should I go through the city by myself or should I use a consultant, right? Those are just like five pain points. I, as somebody who owns the ADU building company, could sit down and say, I'm gonna film one video educating people on the financing.\r\n\r\n\r\nand I'm gonna tell them, this is how you go to the bank, this is what you talk about, this is what you present to them, these are the documents that you'll need, and it's gonna be a 20 minute explainer, and I'm gonna put a ton of thought into it so that I can educate people. And then from that, like you're saying, I'm gonna be able to then post multiple clips, I'm gonna be able to do written form, I'm gonna be able to put a blog, I'm gonna be able to do email. I can take that one piece of content and chop it up so that it's getting...\r\n\r\n\r\na lot more reach than just posting it one time to YouTube.\r\n\r\n\r\nRyan Doser (22:25.814)\r\nYeah, absolutely. can use, I mean, you can do this manually. I call it manually, but you're still using AI where you could use a tool like Opus Clip, right? To cut it up into clips, or you could copy and paste the YouTube transcript, dump it into a custom GPT or a Claude project and repurpose it that way. Or if we get, you know, into past amateur hour where we get down the rabbit hole of AI automations, it's funny because I didn't know automations until like five months ago. I thought I was doing everything right.\r\n\r\n\r\nAnd I started learning about automations. I'm like, wow, I've been stupid. I've been doing this thing wrong the entire time. And then you leverage an AI automation that automatically monitors your YouTube channel and then chops it up into those different variations. Now there's probably a way to do short clips. I haven't seen that maybe Opus clip has improved their API on that front. So that part might still be manual or using an editor to make it look nice and have all the fancy edits. But for actual pure tech space outputs, I think AI automations are the secret sauce behind it.\r\n\r\n\r\nNikolas Hulewsky (23:13.579)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (23:20.765)\r\nOkay, before we get to the automations, tell me again high level. If you record one video for YouTube and you think of that as like this is going to be my marketing, my organic marketing for the next month. How do you then think about all the repurposing that you're going to do with that piece of content?\r\n\r\n\r\nRyan Doser (23:37.976)\r\nI'll give you a real world example. So let's say, I'll give you two actually. So one, I did a video on Blaze AI. They're a popular AI marketing tool. I don't know if you've heard of them by now, but I did a review for them back in December. And that video, think still ranks one on Google and YouTube for Blaze AI review, again, back to the SEO side and all other long tail keyword variations. Now, how I use the repurposing automation.\r\n\r\n\r\nNikolas Hulewsky (24:00.191)\r\nDude, dude, I literally just Googled Blaze AI and your video comes up first.\r\n\r\n\r\nRyan Doser (24:05.206)\r\nand Google results or YouTube.\r\n\r\n\r\nNikolas Hulewsky (24:07.403)\r\nSo I went to Google and then I clicked on videos, not just all. And yours is the first video that it kicks out. That's awesome. Yeah. and it's on the main page as well. Dude, that's awesome.\r\n\r\n\r\nRyan Doser (24:14.306)\r\nThat's good. So it's still ranking one. I'm not full of shit. Yeah. Yeah. Yeah. That's, that's what I was alluding to earlier with YouTube SEO, both on Google and YouTube results. But anyways, with Blaze AI, what I did is I repurposed that long form video into an SEO optimized blog post that still trickles in some traffic here and there from Google.\r\n\r\n\r\nI also repurpose that into several social media posts for X and LinkedIn. Mostly you can do Facebook, Instagram, others, if you want. That's not my audience. Or what you could also do is repurpose that into short clips. So I would take that long form video from the transcript from YouTube. I would repurpose that into actual short form video scripts. And I would feed that into my AI clone where I would post those clone videos on shorts, TikTok, Instagram reels. And I would also repurpose that into an email newsletter.\r\n\r\n\r\nthat I sent out the weekend that I published that blaze AI review video to give it that little extra boost on YouTube and Google.\r\n\r\n\r\nNikolas Hulewsky (25:09.675)\r\nIt's amazing.\r\n\r\n\r\nOkay, so this is what for those you who are listening or can see this is what Ryan was talking about. So I just literally Googled Blaze AI. The sponsored post comes up first. If I scroll down just a little bit here to videos, this is Ryan's video right here. December 23rd, 2024. So about a little over six months old. If I come up here, you'll see here, we were talking about this earlier, this AI mode now from Google, but you can see videos, images, news, et cetera. So when I go to videos, boom, right up top, this is Ryan's video. So you're...\r\n\r\n\r\nRyan Doser (25:40.11)\r\nYeah, go to all and type in Blaze AI review. I'm curious to see what will show up for that now.\r\n\r\n\r\nNikolas Hulewsky (25:45.899)\r\nReddit. Yeah, there's the video again. So when you then went and chopped it up, so did you take the transcript and then just copy and paste it into a GPT and it chopped it up for you? Can you show me?\r\n\r\n\r\nRyan Doser (25:47.15)\r\nSo Reddit, so there's the video again.\r\n\r\n\r\nRyan Doser (26:02.146)\r\nYeah, so I'll show you, let me share my screen here.\r\n\r\n\r\nNikolas Hulewsky (26:08.511)\r\nAnd I'm assuming since you record in Riverside, you're just using the transcript that Riverside outputs.\r\n\r\n\r\nRyan Doser (26:14.584)\r\nI don't record my YouTube videos in Riverside. I use OBS Studio for that. Yep, so this is my content repurposing automation. So I don't know if you want me to walk you through this. mean, essentially, yeah, so I don't know if I can zoom in at all. Make.com gets a little funky. And by the way, it doesn't matter if you're using make.com. I wanna call this out, N8N, Zapierre, Gumloop.\r\n\r\n\r\nNikolas Hulewsky (26:16.925)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (26:23.669)\r\nHoly Moses. Yes, please.\r\n\r\n\r\nRyan Doser (26:38.484)\r\nAll of these no code automation platforms more or less accomplish the same thing. There's a really big cult following around N8N right now with these hundred node automations and agents. Make, Zapier and Gumloop can all accomplish more or less the same thing, just different interfaces, tools and whatnot. But anyways, back to this. So basically what this automation does, high level monitors my YouTube channel. I can set different intervals to however I want. And then I use what's called dumpling AI. You can use if you've heard of Appify.\r\n\r\n\r\nNikolas Hulewsky (26:38.697)\r\nLindy.\r\n\r\n\r\nNikolas Hulewsky (26:43.135)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (27:03.216)\r\nwow.\r\n\r\n\r\nRyan Doser (27:07.746)\r\nbasically just a scraper to scrape the transcript. That is a good free plan, that's what I did. Gave it the video URL with that video ID matching from the previous module. Then from there, I use a tool called Blatato. Reason for that is there are certain social platforms that don't have API access to use in automations, Twitter being one of them. I don't know if you knew that, but you can't use Twitter's API inside automations anymore. So this is kind of a workaround for that. And so really what this does when the video publishes,\r\n\r\n\r\nNikolas Hulewsky (27:29.312)\r\nYes.\r\n\r\n\r\nRyan Doser (27:37.026)\r\nYou'll see I have different Claude modules here. Now you can use open AI, you can use Google for these, but essentially what I'm doing is I'm doing a different module for each content output. This is an email newsletter. This is a LinkedIn personal post. This is a LinkedIn business page post, Facebook personal, Facebook business page, SEO optimized blog posts that goes directly to my WordPress.\r\n\r\n\r\nNikolas Hulewsky (27:47.691)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (27:57.929)\r\nNow are the Claude modules, are they like a project that you're sending them to or does it just have a custom prompt that tells?\r\n\r\n\r\nRyan Doser (28:05.868)\r\nNo. So I'll click into this real quick. So just a quick little tip here for anyone watching, I'm using Claude Hayekou 3.5. That's the cheapest model for testing purposes. If you're actually wanting to run this, I would use Claude Sonnet for whatever the best model is for copywriting at this given point. But yeah, from here, I'm going in here and actually filling out the prompt, adding the inputs from the previous modules. Basically, and this alludes to a point I'm gonna talk about, I guess maybe now or later in this podcast episode,\r\n\r\n\r\nis that you have to have subject matter expertise in order to get the desired outputs of what you want. If I don't know what good looks like for a tweet, for a LinkedIn post, for an email subject line, for a blog post, this is all irrelevant. You can come in here and copy my file and upload the JSON and whatnot. But if you fundamentally don't understand, you know, why I'm putting these inputs into this module. So in this example, right, you'll see I've gotten so granular where I'm giving it all of my different emails, subject lines,\r\n\r\n\r\nNikolas Hulewsky (28:50.25)\r\nYeah.\r\n\r\n\r\nRyan Doser (29:04.78)\r\nwith the open rate percentages. So it knows, hey, this one with this emoji did good or these buzzwords did good. So now it's using that and it's training data for the next set of outputs.\r\n\r\n\r\nNikolas Hulewsky (29:14.219)\r\nWell, what's interesting about that is like I have a have a bunch of projects set up in Claude. I use Claude's projects and I use chat. TPT is like a thought partner. So I have a bunch of projects set up in Claude, but I have like a brand style guide that's like, hey, this is how I write things. This is the voice I look that I sound like. This is how I look for things. So I like frameworks. I like large numbers, etc. And then when I do when I put a transcript in that in that project, it will rely on the project knowledge and it will sort of.\r\n\r\n\r\ngive me outputs, but yours looks like it's all in the prompt.\r\n\r\n\r\nRyan Doser (29:48.972)\r\nYeah, so and the reason for that. Have you ever heard of chat GPT assistance? Does that ring a bell?\r\n\r\n\r\nNikolas Hulewsky (29:54.173)\r\nI mean, yes, but I couldn't tell you what it does. Yeah, I'd love to. Dude, I freaking love the screen sharing because it's I learned so much.\r\n\r\n\r\nRyan Doser (29:56.654)\r\nDo you want me to share my screen again? I don't know how much screen sharing you want me to do here. Yeah, so if I go back, I didn't have this pulled up, I apologize. But the reason I'm using Claude and I can't have a project integrated with Claude is because they don't have the ability via the API to have some sort of project that you can use. Now you could probably figure out an MCP work around or something like that. But what the point I'm trying to make here is that with ChatGPT or OpenAI's module,\r\n\r\n\r\nYou can create what are called chat GPT assistance. Notice this assistant drop down here. And I have different assistance set up on open AI's API platform. have a blog post agent, a Facebook agent, a LinkedIn and Instagram agent. These are essentially custom GPTs that you can use on the API side inside automations.\r\n\r\n\r\nNikolas Hulewsky (30:29.643)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (30:36.06)\r\nNikolas Hulewsky (30:39.883)\r\nto the GPTs.\r\n\r\n\r\nthat's fascinating. I bet you could do it in Claude. hold on, I froze for a second.",
  "metadata": {
    "duration": "",
    "date": "2025-07-25",
    "platform_source": "Google Drive"
  }
}