{
  "episode_number": "212",
  "episode_title": "Roll-Ups vs. Holdcos: Understanding the Key Differences and Benefits with Dzmitry Miranovich",
  "guest_name": "Dzmitry Miranovich",
  "business_name": "Veterinary Clinic Roll-Up",
  "transcript": "﻿Nikolas Hulewsky (00:00.334)\r\nTell me, I'll mark it and we can, we'll edit it out later. Okay, Dimitri, I'm stoked, excited to talk to you today. I've been trying to get you on for over a year. You have a roll-up that you're working on right now, a veterinary clinics. You have over 20 of them. And I think people are very curious about this roll-up hold co model, especially when they haven't done it before. And they have a lot of, I guess, ideas about what it actually is. What is, in your opinion,\r\n\r\n\r\nDzmitry Miranovich (00:02.281)\r\nYeah, perfect.\r\n\r\n\r\nNikolas Hulewsky (00:30.2)\r\nthe worst thing about a hold co company or roll up and what do you feel like is the best thing? Let's start with the worst first.\r\n\r\n\r\nDzmitry Miranovich (00:36.563)\r\nYeah, well, thanks for having me on. And I'm glad we finally are able to do this. Yeah, so I'd say, so holdcos and rollups are, in my mind, are very different. I think some people might be using those terms interchangeably. Generally in my mind, when people say a holdcode, they refer to an organization which has some sort of corporate overhead, corporate systems, like a...\r\n\r\n\r\nNikolas Hulewsky (00:40.526)\r\nOf\r\n\r\n\r\nDzmitry Miranovich (01:03.241)\r\nfinance organization, HR organization, recruiting organization, and so forth, but then owns assets which are independent of each other, right? They might be a veterinary business, they might be a HVAC company, they might be a software company. Sometimes Holocaust have very little overhead as well. Sometimes they have a lot of overhead, but that's the model, right? You have businesses that are different in nature from each other.\r\n\r\n\r\nNikolas Hulewsky (01:17.058)\r\nMm.\r\n\r\n\r\nDzmitry Miranovich (01:31.869)\r\nIn roll-ups, the idea is that you buy or partner with handful of businesses in the same industry. And the more similar they are to each other, the better it is. Right. We're talking about GP vet clinics, right. As opposed to, you know, for example, our roll-up, we're doing GP, so general practitioner, veterinary clinics. We do not do urgent care. We do not do emergency. We do not do specialty.\r\n\r\n\r\nNow some of our clinics might offer occasionally one of the services, whether it's specialty or urgency, urgent care, it gets a little nuanced, but the idea is that you're acquiring businesses that have a very similar model. And, you know, in other industries, you can be doing commercial HVAC, residential HVAC, and those are quite different from each other. So in the roll up idea is that you buy a bunch of businesses that they're similar to each other.\r\n\r\n\r\nNikolas Hulewsky (02:01.134)\r\nYou\r\n\r\n\r\nDzmitry Miranovich (02:28.604)\r\nAnd there is some overarching reason why it makes sense, right? Why one plus one plus one is equal to three or at least three, but ideally more than three, right? Because the important fact to realize is when you put those together, you also have this synergist, right? Like you have corporate overhead, you have corporate cost, you're professionalizing those businesses in many ways, which actually costs money, right? Like running proper.\r\n\r\n\r\npayroll and accounting accruals, things like that, all of that costs money. And so there is a level of this synergy. And so it's very important to have a thesis whereby, again, one plus one plus one is at least worth three or more. And so there is often some, well, actually, there is rarely a revenue synergy component. It could be some. There might be better ways to run revenue, right? So just grow those faster.\r\n\r\n\r\nNikolas Hulewsky (03:02.699)\r\nMm-hmm.\r\n\r\n\r\nDzmitry Miranovich (03:26.42)\r\nThere is often some sort of cost synergy component, right? And that's, you know, could be margins, could be better ways of running those businesses, better SOPs, better operating procedures, so forth. And then there is also the aspect of diversifying risk or mitigating the risk, right? Like each of those businesses that you partner with or buy are inherently very small businesses that they're, you know, prone to risks. You know, it could be...\r\n\r\n\r\nloss of a key person, could be geographic risk of being subject to like hurricanes or weather or whatnot, right? So when you put them together, you diversify that away. put them systems in place to mitigate those risks. Like you might have a recruiting organization, right? Like a recruiter and a sourcer at the parent company level, which individual clinics just cannot afford, their individual companies cannot afford.\r\n\r\n\r\nNikolas Hulewsky (04:17.218)\r\nWell, I think, I think, I think of holdcos is like an inch deep and a mile wide and roll ups as an inch wide and a mile deep. But there are a lot of people who look at a Warren Buffett. He's got a holdco. I want to be like Warren Buffett. Well, Warren Buffett has multi-billion dollar positions and he's not the one who's actually running these businesses. It's very different when you have a holdco and you are responsible for operational execution. Then when you are someone like Warren Buffett who\r\n\r\n\r\nDzmitry Miranovich (04:31.284)\r\nYou\r\n\r\n\r\nNikolas Hulewsky (04:43.842)\r\nhas enough resources to hire out the depth and the bench of the team in order to execute really, really well. What made you decide to go the roll-up route? Because for people who are listening, typically what happens in a roll-up, the idea, the thesis is, look, we can go out and we can identify an industry, and we can raise capital. And with that capital, we are going to go and buy a bunch. We'll have a platform, and then we'll be able to consolidate and centralize either some of these things, the synergies that you were talking about. We'll either centralize some services, or we'll use those synergies to achieve better margins.\r\n\r\n\r\nBut then you grow and at scale, have cost efficiencies that you couldn't otherwise achieve by bootstrapping. However, you have to raise money and you kind of go into other investors and they're putting money into your business. There's some level of, I don't necessarily have full control, even though I am operating as an entrepreneur. For you, like why decide to go the roll up? Why not decide to maybe buy a business first, operate that, grow it and just rinse and repeat.\r\n\r\n\r\nDzmitry Miranovich (05:41.97)\r\nYeah, I think it.\r\n\r\n\r\nThere are several things to it, right? In a whole comodo, you're inherently buying a bunch of different businesses and different industries, right? So I think it's fundamentally difficult, or not necessarily difficult, just takes time to get really smart in an industry, right? To get really good at something, right?\r\n\r\n\r\nNikolas Hulewsky (05:55.384)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (06:05.619)\r\ntotally agree, totally agree.\r\n\r\n\r\nDzmitry Miranovich (06:09.38)\r\nAnd so in my mind, like, so we've been doing this for three to four years. you know, I can tell, like, you know, in my prior job, I worked for large investment firm, you know, I covered several different industries, including veterinary services. And so I knew the industry well, I thought. But then it turns out like sitting in a Manhattan, you know, high rise office building and like, you know, looking at numbers and thinking, I know this industry really well.\r\n\r\n\r\nTurns out that doesn't really give you the crats to know the industry. When you actually step into the role, you're like, my God, like this is so different. Like the reality is so much more complicated and questions that we used to ask don't really matter. There's those questions that we should have asked and we've never asked because we didn't even think about it.\r\n\r\n\r\nNikolas Hulewsky (06:58.37)\r\nWhat were you doing at Carlyle? So when you say you were sitting and looking at a spreadsheet, what functions were you actually doing?\r\n\r\n\r\nDzmitry Miranovich (07:05.256)\r\nYeah, so I was an investment professional. I worked in the product credit side. So we did everything from junior debt to senior debt, specials is directly ending everything in between. And so we were with the investments in several vet consolidators and also like dental and physical therapy and dermatology and many other industries, right? But to guess to your point, right? Like\r\n\r\n\r\nNow that I know what I know, I think it would be incredibly difficult to just say, I'm going to buy an HVAC business one year and then next year I'm going to buy.\r\n\r\n\r\nof that business and actually I'm going to buy a dental business. I think it's perfectly fine, right? If you have a management team to run those businesses, right? And you're partnering with someone who knows those industries really well, which oftentimes is the seller, right? If that's the whole cost set up, I can get behind it. I think it makes sense why people do it, how people do it. And like independent sponsor model in some ways is sort of doing that, right? Except that there's no common ownership.\r\n\r\n\r\nNikolas Hulewsky (07:48.654)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (08:06.914)\r\nYeah. I, I, I dabbled in a hold co. mean, we didn't have a ton of companies, but, I realized really quickly that I hated it because there's a lot of context switching and unless you're at scale and have management teams, the execution is on you. And it's really hard to have expertise in five different businesses. It's very difficult.\r\n\r\n\r\nIf you don't have a thesis, I think the hold goes that I've seen be successful is they may not be rolling up a vertical, but they've identified something where they say, we look for, don't know, businesses that are lagging on technological adoption specifically with AI. And then they'll go and they'll kind of apply that broadly. And they have a centralized team that has one specialty. And so that becomes sort of the differentiator. But if you were like me and just a shotgun approach, like, this is a cool tree trimming business.\r\n\r\n\r\nDzmitry Miranovich (08:40.691)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (09:00.718)\r\nOh, this is a cool digital agency or this is a cool RV park. That thesis kind of fails because there is no thesis and you really have to understand what you're doing.\r\n\r\n\r\nDzmitry Miranovich (09:09.906)\r\nYeah, unless you have a very strong management team that runs each of those businesses, right? And typically to have that, you need to be buying assets of certain size, right? Those companies have to be big enough to afford the dedicated management team, right? And dedicated management resource. so, yeah, I mean, think Holka Model could totally work. It's just, you know, you have to be mindful of that. Like in my mind, then, like I decided, you know,\r\n\r\n\r\nNikolas Hulewsky (09:14.57)\r\nExactly. Yep, which I didn't.\r\n\r\n\r\nNikolas Hulewsky (09:21.837)\r\nMm-hmm.\r\n\r\n\r\nDzmitry Miranovich (09:38.645)\r\nI looked at several industries, I evaluated them based on certain parameters. I'm happy to dive into that and I decided, okay, this is the industry I want to go after, let's dive in. I felt I knew the industry turned out that my knowledge was a lot more like spreadsheet knowledge than actual knowledge. But then I learned and I think...\r\n\r\n\r\nSo if you ask me like, what is the key quality that's in my mind as a predictor of doing this well, and I hope we're doing it well, is just like basically blocking and tackling, right? That's just having, and someone, someone told me that's a serial roll up founder is now like, you know, acquired and sold several, you know, roles in multiple industries. was the same thing he said to me. was like, it's just blocking and tackling. You just got to persevere. You just got to.\r\n\r\n\r\ndive in, learn, you'll face a lot of new problems, a lot of new things that you've never dealt with before. And maybe that's just with, any business and you just have to tackle them one by one and stay positive and do it.\r\n\r\n\r\nNikolas Hulewsky (10:50.19)\r\nSo let's go high level and then we can go granular on vet clinics. What makes a good industry to do a roll-up in? Or at least, what are the key characteristics that you look for to say, I could do a roll-up in this space?\r\n\r\n\r\nDzmitry Miranovich (11:05.64)\r\nYep. So it has to be fragmented, right? So it has to be, there has to be ideally thousands of individual small businesses operating within DaemonStream. There has to...\r\n\r\n\r\nNikolas Hulewsky (11:18.774)\r\nAnd is there a is there like a concentration percentage that you look for? Because obviously, can be thousands of businesses, but you have one company that has 80 % of the market. That's not fragmented.\r\n\r\n\r\nDzmitry Miranovich (11:26.452)\r\nYeah, exactly that wouldn't work. know, I'd say if industry is over 50 % consolidated, I probably wouldn't go for it. There is very rarely like one company that's, you know,\r\n\r\n\r\nNikolas Hulewsky (11:37.004)\r\nOkay. Okay.\r\n\r\n\r\nDzmitry Miranovich (11:42.151)\r\na large percentage of the entire industry, at least in the US, right? In some like Western European markets, it's more common. Like, for example, VetMed in Europe, in the UK, there's one company that's, I won't say 20 to 25 % of all vet clinics in the UK are owned by one company. In the, you know, it's much smaller market, much easier, quicker to consolidate. In the US, know, largest player probably owns like single digit percentage number of all vet clinics across multiple brands.\r\n\r\n\r\nNikolas Hulewsky (11:59.15)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (12:09.582)\r\nYeah, what I would say like the flip of that would be electronic medical records, for example, like in the hospital systems, epics dominating or like in the skilled nursing space or home health and hospice, like the EHRs, it's probably not a space you're to go do a roll up in just because there is heavy consolidation. But in the clinic space, you mentioned like physical therapy, occupational therapy, home health, hospice, there's a lot of fragmentation in those spaces. There's not a ton of consolidation.\r\n\r\n\r\nDzmitry Miranovich (12:17.469)\r\nYeah.\r\n\r\n\r\nDzmitry Miranovich (12:35.378)\r\nYeah. Yeah. Yeah. So I would say, like vertical therapy software, there's like bazillion of them, right? There is, HVAC, dental, dermatology, physical therapy, mainly like trampoline parks. Like there, there is fitness gyms, right? There is various degrees of consolidation in each of those industries. Right? So\r\n\r\n\r\nNikolas Hulewsky (12:44.558)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (12:57.812)\r\nthat's interesting. So you would even look at that as like, that's an ERP. So actually the ERP market is all of these different EHRs and backend systems that are managing these businesses. So you can actually do a roll up potentially in that space. That's it. Yeah, that's cool. I've never thought of it like that.\r\n\r\n\r\nDzmitry Miranovich (13:13.372)\r\nYeah. And yeah, and people doing that, like, first co-ERPs, like, they would buy ERP for, like, meat processing and the ERP for, a cookie factor and ERP for, I don't even know, like, cogs.\r\n\r\n\r\nNikolas Hulewsky (13:20.45)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (13:26.414)\r\nWell, because you have, yeah, you have ERPs like Monday's not the word. What is it? my gosh, I'm blanking on it. I'm looking at them right now. Anyways, where they're fully integrated and they're managing everything and they can apply to like almost any industry, but they're just overbilled and they're not at work day. That's geez Louise. That freaking took me forever to go. Yeah, like work day applies to almost any industry, but there's not a lot of specificity to your particular business.\r\n\r\n\r\nDzmitry Miranovich (13:48.296)\r\nWord they, yeah.\r\n\r\n\r\nNikolas Hulewsky (13:56.014)\r\nOkay, sorry, I got a soft track. the first one is fragmentation, less than 50 % consolidation.\r\n\r\n\r\nDzmitry Miranovich (13:58.677)\r\nYeah. So fragmented market, let's say, you know, it's arbitrary to be fair. It's arbitrary, right? Less than 50 % consolidated, but it's important that when you look at the overall market, you also need to look at what's your addressable market. Like for example, HVAC, right? There's like a bazillion HVAC companies in the U.S. and most of them or many of them are\r\n\r\n\r\nNikolas Hulewsky (14:05.399)\r\nMm-hmm.\r\n\r\n\r\nDzmitry Miranovich (14:27.3)\r\nsingle technician, a specialist and a truck and that's the entire business. And it still counts as an HVAC business. Now that will never get acquired. I mean, it's very difficult to your head around acquiring something like that because it's too small in terms of revenue. It's concentration risk was one that's called provider specialist, right? So you need to narrow it down from all of the businesses in the specific industry down to which can be\r\n\r\n\r\nNikolas Hulewsky (14:30.051)\r\nMm-hmm.\r\n\r\n\r\nDzmitry Miranovich (14:55.856)\r\nactually acquired or partnered with. And then you need to look at the fragmentation of that pie. Because oftentimes you might realize, like, example, dental industry, mean, there's all kinds of stats floating around of consolidation in the dental industry. But if you look at the addressable market, I mean, think it's 60 to 80 % consolidated. And so it's important to look, so fragmented industry, then fragmented addressable part of the industry.\r\n\r\n\r\nNikolas Hulewsky (15:16.952)\r\nMm-hmm.\r\n\r\n\r\nDzmitry Miranovich (15:25.17)\r\nSo that's number one. And then the extension of that is you want to have a runway for consolidation, right? You want to be able to do this for five, 10, 15, 20 years, because that's what supports your multiple arbitrage. You buy your individual asset for X ebita, you sell it for two X or one and half X, right? And those kinds of ratios differ and...\r\n\r\n\r\nIn the perfect world, your roll up thesis should not depend on multiple arbitrage. Your economics, your operational value creation should drive returns. And that's what we strive for internally. But you know, you want to have this kind of multiple arbitrage as a sort of chair on top. And quite frankly, that chair could be more like a pineapple. So, and that's support and that's supported by runway for consolidation, right? Because the longer the runway, the longer you can make an argument that you can be by.\r\n\r\n\r\nNikolas Hulewsky (16:11.832)\r\nWhat's up?\r\n\r\n\r\nDzmitry Miranovich (16:20.658)\r\nbind down the multiple rates.\r\n\r\n\r\nNikolas Hulewsky (16:22.606)\r\nHow do you measure runway for consolidation? Just what percentage of the market is consolidated and then how large the total addressable market is?\r\n\r\n\r\nDzmitry Miranovich (16:27.988)\r\nYeah. Yeah. Like in most industries, can find industry publications. Sometimes industry might have like a dedicated or like a blue cheap brokerage firm that operates within that niche, within that industry. They would track those numbers and it's a whole bunch of estimates, of course. Right. But you know, you can get the sense of it, right? There is a, let's say, you know, 10,000 units and 3000 are consolidated.\r\n\r\n\r\naddressable market. Let's say 10,000 is the addressable market, right? 3,000 are consolidated and 500 are being sold per year, roughly, right? And so you divide that kind of 10 minus three, seven by 500 and you get your runway, right? So that's kind of the, and you'll never achieve like 100 % consolidation, and you'll never achieve like 100 % consolidation, but maybe you sold from like, you know, that this case I'm.\r\n\r\n\r\nNikolas Hulewsky (17:15.967)\r\nthat's really interesting.\r\n\r\n\r\nDzmitry Miranovich (17:24.308)\r\ntalking about like from 30 % to like 60%. So that how long will it take for that 30%, 30 points of consolidation to happen, right? And you can.\r\n\r\n\r\nNikolas Hulewsky (17:34.062)\r\nOkay, I've never heard of that equation before. Let me like split that back to you. So if there's 10,000 companies in an industry, 3,000 are consolidated. So there's 7,000 free agents. And you go to that blue chip brokerage.\r\n\r\n\r\nDzmitry Miranovich (17:44.946)\r\nYep. Yep. And let's say there's 10,000 that are addressable. Those are the companies that can actually be a\r\n\r\n\r\nNikolas Hulewsky (17:53.646)\r\nRight. And then you go to that blue chip brokerage and you, or you talk to a few of them and you kind of decide, I have this 500 a year that are being sold. If you divide that 7,000 by 500, that's 14. So is that like, it's my runway is 14 years. Is that how you look at it?\r\n\r\n\r\nDzmitry Miranovich (18:13.746)\r\nYeah, yeah, exactly.\r\n\r\n\r\nNikolas Hulewsky (18:17.244)\r\nis there a is there a range like it.\r\n\r\n\r\nDzmitry Miranovich (18:18.484)\r\nNow, you will never achieve 100 % consolidation. So maybe you sold from, exactly, maybe you sold from 30 % to 60, 70%. And so in this specific example, maybe it's not 14 years, maybe it's more like 10 years. But yeah, that's the exact math you want to do in your head as you're looking at the industry. Say it again?\r\n\r\n\r\nNikolas Hulewsky (18:22.424)\r\nSure, but it's a proxy.\r\n\r\n\r\nNikolas Hulewsky (18:43.488)\r\nWow. Are there ranges for that? Let's say you did the math and it was other ranges. Let's say that did the math and it was seven. It was seven years. Is it like that's good runway or does that not good runway?\r\n\r\n\r\nDzmitry Miranovich (18:54.364)\r\nI'd say I look at things which are like 10 plus years. Yeah.\r\n\r\n\r\nNikolas Hulewsky (18:59.03)\r\nOkay, you want a decade plus. Dude, that is fascinating. I've never heard that before. Is that unique to you?\r\n\r\n\r\nDzmitry Miranovich (19:04.934)\r\nNow the exception to that is, I don't know if that's unique to me. I kind of look at everything from, I try to kind of have those like mental shortcuts and like overuse term models, right? But I have not heard other people use that mental framework, but I'm sure other people do too.\r\n\r\n\r\nNikolas Hulewsky (19:22.647)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (19:30.44)\r\nI think that's a great way to quickly quantify it. I think everybody has that thesis, like, we need a lot of runway in order to consolidate this market, but how do you even put a number on that? That's a very good proxy. I've never heard anybody doing that, and it makes total sense.\r\n\r\n\r\nDzmitry Miranovich (19:35.09)\r\nYeah.\r\n\r\n\r\nDzmitry Miranovich (19:46.025)\r\nYeah, and it's also like fairly, all those numbers are fairly easy to get. Like it's, if you spend like few days digging into the industry, you'll find specialty publications. There's usually like some sort of specialty conference. There's like, again, publication. There's like some data website, like there's brokers, like you'll find a way to get those numbers at least approximately. One, yeah.\r\n\r\n\r\nNikolas Hulewsky (19:51.074)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (20:12.896)\r\nOkay, so fragmentation, I put total addressable market as a separate category. I know that you kind of put it in with fragmentation, I do think you want to have, there has to be a market of some minimum viable size. then this, I.\r\n\r\n\r\nDzmitry Miranovich (20:28.148)\r\nSo the way I think about it, and sorry I interrupted you, I'm not necessarily thinking about it as a total addressable market, but I want to see that each company that you're looking to buy is at least of a certain size. So some industries are challenging, because an average business or a median business\r\n\r\n\r\nNikolas Hulewsky (20:31.853)\r\nNo, please.\r\n\r\n\r\nDzmitry Miranovich (20:57.876)\r\nin an industry is just tiny, right? That's maybe like four or 500 K of revenue. And so it's just difficult to roll those up, right? Because again, when you put them together, they all require work on the backend, right? Like you're creating overhead structure, creating sort of say corporate, we call success center management team. And so...\r\n\r\n\r\nNikolas Hulewsky (21:00.323)\r\nMm-hmm.\r\n\r\n\r\nDzmitry Miranovich (21:20.422)\r\nyou know, managing 10 veterinary clinics that generate, you know, one million of revenue is about the same effort as managing 10 that generate two or three million of revenue each. Right. And so ideally the industry you're looking at has opportunity for you to buy companies or partners companies that are at least of certain size. Right. So, and I would target, you know, I mean, you, you want to get to a point where\r\n\r\n\r\nNikolas Hulewsky (21:42.252)\r\nHmm.\r\n\r\n\r\nDzmitry Miranovich (21:50.477)\r\nYou can start off smaller, right? You can start off with, you know, companies with maybe a couple hundred KVB per acquisition, but you want to over time kind of move towards ones which are larger because again,\r\n\r\n\r\nNikolas Hulewsky (22:07.754)\r\nGive me an idea. Is it top line that you're looking at or are you looking at like bottom line net income when you're deciding how big? Okay. And so for you.\r\n\r\n\r\nDzmitry Miranovich (22:11.476)\r\nYeah, bottom EBITDA. Revenue matters too. Revenue is a proxy, right? But cash flow is what matters.\r\n\r\n\r\nNikolas Hulewsky (22:23.052)\r\nYeah, for sure. For you in the vet clinics that you're looking at, what was that number? Was it like, hey, they've got to be cash flowing at least $500,000 a year or more, less than that? Like, where do you land?\r\n\r\n\r\nDzmitry Miranovich (22:34.066)\r\nYeah. So early on, we did not have that well established. I mean, I knew generally what companies look like in the vet industry or what clinics look like. The reality when you're starting on is you kind of...\r\n\r\n\r\nLike it takes time to refine what your checklist looks like and what specific parameters to pay attention to. And so for us, like from day one, like we were really focused on partnership fit, right? On personality fit with, you know, doctors who partner with us, who sell to us, who stay on as co-owners, partners, that's, cause that's core to our model. Like we have a co-ownership model. We didn't pay that much attention to size.\r\n\r\n\r\nNikolas Hulewsky (23:04.525)\r\nYou\r\n\r\n\r\nDzmitry Miranovich (23:29.32)\r\nJust quite frankly, because it takes some experience to, and I realized that on paper, that you have corporate overhead, you're spreading it across locations, but until you're actually operating, when you operate, you start feeling it very tangibly, that you do want it to be certain size, because that's what helps support the overhead.\r\n\r\n\r\nNikolas Hulewsky (23:58.126)\r\nTotally. Well, and like you were saying, it's very different when, excuse my language here, I call it spreadsheet porn. You're sitting in your office and you're like, well, if we just do 10 % this year and then we cut this cost and then we, if we were growing this market and get this market shares, like you can talk yourself into anything being a billion dollar company, right? So it's very different when you're doing the analysis that you're talking about where it's like, okay, I need for each individual location to be producing X. Does the vet industry do that?\r\n\r\n\r\nDzmitry Miranovich (23:58.227)\r\nor a vice versa rate.\r\n\r\n\r\nNikolas Hulewsky (24:27.65)\r\nyes, it does. Okay, great. Now I'm going to go get my first acquisition. You're not necessarily at least from what you're saying. It's like you don't need to go out and swing for the fences and get the biggest acquisition you can get. You just need to get in the game so that you start getting some experience and understanding like how does it actually work and how does the spreadsheet translate to real life so that you can go faster later? I think that's what you're saying.\r\n\r\n\r\nDzmitry Miranovich (24:39.058)\r\nYeah.\r\n\r\n\r\nDzmitry Miranovich (24:50.066)\r\nYeah, absolutely. I would say, however, there is a, I've heard an opinion from someone where, you know, in the roll up, you want to get started as soon as possible, meaning, you know, get your first deal done as soon as quickly as possible, because once you have done it, you know, others will take you more seriously, like deal number two, three, four, five is much easier than deal number one, because you have to get someone to trust you.\r\n\r\n\r\nnot having any track record basically. I sort of disagree with that in a way that like we wanted to make sure that our deals, you we had very strong fit, culturally, partnership wise, like from day one, right? It might not have, you know,\r\n\r\n\r\nNikolas Hulewsky (25:21.9)\r\nRight, right.\r\n\r\n\r\nDzmitry Miranovich (25:39.465)\r\nwe didn't look at certain parameters like maybe size as much as we're looking at them now. And it's not to detriment of those clinics, it's just we wanted to make sure that we partner with right folks. That was focus number one, right? And so we could have focused on size, but that wasn't the most important thing for us day one, right?\r\n\r\n\r\nThe most important thing for us, day one, was to partner with the right people because if your first or second or third acquisition turns out to be problematic, it just drags down the entire thing.\r\n\r\n\r\nNikolas Hulewsky (26:17.422)\r\nWell, yeah, I totally agree. I was talking to somebody last week and they were, they want to do a roll up. And so they were kind of telling me their strategy and they found this. It was in the, going to make this up. wasn't in the space, but I'm going to say that it was, it's in the medical billing space. And they were like, Oh, it's a company and they do a million dollars top line and $250,000 bottom line. And I just want to get into the space. And I was like, that's way too small. You don't know anything about the space.\r\n\r\n\r\nDzmitry Miranovich (26:32.766)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (26:45.866)\r\nand this owner wants to retire, et cetera, et cetera. But worst of all, when the owner retires, you have to jump in and operate the business and there's no SOPs, there's no processes to get it going. So when you're doing that first acquisition, it's incredibly important to know what you need. Like if you had operated vet clinics before, maybe you get into the business and you don't necessarily need the owner to stay around or a good partner. Okay. But if you've never operated before, like you're saying, no, I need to have a partner. need to have either systems or processes or it needs to be large enough that I can go in and run it.\r\n\r\n\r\nTo your point, that first acquisition is so important, but it's not necessarily one size fits all of how it has to look.\r\n\r\n\r\nDzmitry Miranovich (27:22.334)\r\nYep. Yeah, I totally agree. I mean, we've had a deal under LOI that we could have closed, I think for like six months before we actually closed our first partnership. And we just, you know, we just walked away, we realized it's not going to be the right fit. And there's like some misrepresentation involved. And I don't think it's like any, I think it's...\r\n\r\n\r\nperhaps broke or not, necessarily doing a good job as opposed to any sort of like intentional misrepresentation. But, you know, it just wasn't for us, right? And so we walked away and we kept working. And then our clinic number one, actually became clinic number one is awesome, right? It's really solid team, really solid partner, great practice manager, great doctors. And that's been great, right? Because...\r\n\r\n\r\nNikolas Hulewsky (28:02.221)\r\nYeah.\r\n\r\n\r\nDzmitry Miranovich (28:19.809)\r\nand those people.\r\n\r\n\r\nyou know, the sort of references that's important, you will be making mistakes early on. Like, it's inevitable. And you want... That's right. Yeah, never. I've never made a mistake in my life. Everything I do is 100 % accurate, 100 % of the time.\r\n\r\n\r\nNikolas Hulewsky (28:33.26)\r\nWhat? I don't think so.\r\n\r\n\r\nNikolas Hulewsky (28:41.954)\r\nYeah, what are you talking about,\r\n\r\n\r\nDzmitry Miranovich (28:44.432)\r\nBut in case ever such thing were to happen that you did something wrong, it's really helpful to have people on the receiving end who are understanding and kind of work with you. Because it's challenging. mean, you're dealing with a lot of people, you're dealing with a lot of individual companies or clinics,\r\n\r\n\r\nNikolas Hulewsky (28:48.386)\r\nYeah.\r\n\r\n\r\nDzmitry Miranovich (29:10.33)\r\nLook, it's inevitable. There are third party circumstances that you do not control, right? Like, you know, you're like, we're dealing with this now, right? Our audit is taking longer than, you know, we expected. you know, it's first time audit, it takes a long time. Like it is what it is, right? We don't control it. And we have a great accounting firm we're working with, like our team is on it, but it's just taking long, right? And so...\r\n\r\n\r\nyou know, it's, people are waiting for the AK-1s and it's, you know, it's not ideal, right? It's, it's not great optics and I'm like trying to manage it, but at the end of the day, like we're doing our best and the accountants are doing their best, but this is just the reality that we're dealing with. Right. And so just trying to, I think, maximizing the positive factor, meaning,\r\n\r\n\r\nyou know, people that you can have a genuine conversation with and be direct and be like, like, listen, I'm sorry, this taken longer or this didn't get done or we were wrong. Like, I'm sorry, we'll do better next time. Like, you know, it is what it is, but.\r\n\r\n\r\nNikolas Hulewsky (30:19.352)\r\nWell, that's and that's why all the research that you did beforehand that we're talking about here is so important. It's not because, you've done the research and there's a perfect plan and it executes according to the plan. No, it's because all the things that you just said, they're going to happen anyways. So you want to go into a situation that you've mitigated the risk as much as possible because there are going to be, you know, K one delays or heaven forbid you buy a company and unfortunately there's not a disclosure beforehand. And all of sudden the bank account gets levied and you're just like stuff happens. And if you don't\r\n\r\n\r\nDzmitry Miranovich (30:33.801)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (30:49.432)\r\nhave a plan, if you don't have something to fall back on to at least change, you're kind of screwed because then you're out there, you're way over your skis. For you, fragmentation, total adjustable market, runway, what else was there where you were like, I love the veterinary clinic industry because of this key factor?\r\n\r\n\r\nDzmitry Miranovich (31:12.893)\r\nYeah, so.\r\n\r\n\r\ngreat tailwinds, people love their pets, pets are awesome, increasing sense of care. There's a lot to like about pet healthcare in general, but all of that aside, I think consolidation really makes sense in that industry, like one plus one plus one can generally is worth more than three. So that's important, right?\r\n\r\n\r\nNikolas Hulewsky (31:18.158)\r\nMm.\r\n\r\n\r\nDzmitry Miranovich (31:45.941)\r\nAnd then specifically to answer your question directly, I really like the fact that competition was in my eyes, not very differentiated. You know, there are 30 plus thousand vet clinics in America. are different estimates, depending what you count as a veterinary clinic or not, there's let's call it 30 to 35,000 veterinary clinics in the U.S. There are 50 plus consolidators. Some are\r\n\r\n\r\nvery large, some are tiny, some are hyper-regional, some are national. But if you look at that spectrum of consolidators, most of them kind of do it in the same way, right? They buy a clinic, the seller stays on as an employee, maybe they have some sort of equity rollover into the hold-co, but they sort of more or less lose agency over what's gonna happen after that.\r\n\r\n\r\nIt did, and they generally do not participate in the upside in a true way. Like they might, but it's, limited inherently and there are different ways to do it. I am kind of simplifying what, what I liked is that there are very few models out there that truly have a partnership of person. have a JD model. We did not invent it. There are other people in the industry doing, doing it in a similar way that we do it.\r\n\r\n\r\nNikolas Hulewsky (32:54.659)\r\nYeah.\r\n\r\n\r\nDzmitry Miranovich (33:11.654)\r\nI selfish, I think our model is better than theirs, but it's like, I.\r\n\r\n\r\nNikolas Hulewsky (33:15.576)\r\nWell, let me yeah, let me ask you that. OK, so I'll lay out kind of what traditional private equity roll ups do and then you can correct me obviously. But then you can help me understand how the JV model differentiates. You usually what happens and if you're a searcher that you're looking for a business and you're like, cool, there's this cool company that's for sale. I'm going to pay 5X because that's what I can afford. And then this private equity company moves in.\r\n\r\n\r\nand they're able to pay 7X and you're like, how does the math work? Is math still not math? Well, they're able to pay a higher multiple because typically what the private equity companies do is they'll come in and they'll say, hey, and I'll use VetClinics. Hey, VetClinics person, I'll pay more, but I'm actually only gonna pay 60%. You're gonna roll 40 % of your equity into the mothership. And when we sell, cause that's the whole plan, when we sell, instead of selling for a 7X EBITDA multiple,\r\n\r\n\r\nWe're going to have so many other clinics that now you're going to sell for a 13 X multiple. So you'll get a, what they call the second bite of the apple. So that's, that's way more appealing to these owners who want to get more money. And it's hard for searchers to be able to match that multiple. So that's the, and I get, there's lots of variations, but then the, the, the, let's say vet clinic owner becomes an employee and there's still some equity upside, et cetera. But generally speaking, that's how traditional private equity has worked in these healthcare mark, verticals.\r\n\r\n\r\nYou're saying you do it little differently though. It's a JV.\r\n\r\n\r\nDzmitry Miranovich (34:37.62)\r\nYeah. So I actually, what you've described, I actually viewed a little differently. So traditionally, and by the way, there is no one size fits all. are all kinds of private equity back consolidators that do everything from, you know, a hundred percent by us to JV model like we do. Right. So, but generally traditionally, when a lot\r\n\r\n\r\nNikolas Hulewsky (34:43.949)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (34:49.589)\r\nRight, yeah.\r\n\r\n\r\nDzmitry Miranovich (35:03.956)\r\nConsolidator comes in, and this is a traditional approach to consolidation, not on just in that industry that's common, but this is what has been common for a long time, right? You as a buyer, you come in, perhaps you're able to pay higher multiple than sort of non-consolidator buying. The reason you're typically able to pay higher multiples is because you're typically able to unlock cost synergies day one. So maybe you have better.\r\n\r\n\r\nsupplier contracts or better processes, cheaper benefits, for example, is a big one, right? There is some sort of pro forma on log that happens now that this business is worth for you more than it's worth for others, hence you're able to pay a higher multiple. You are, however, not giving the seller any participation, or you're giving them minimal participation in the future. So...\r\n\r\n\r\nIn the example of a whole core roll over, sometimes what happens is that, let's say I'm a buyer, I paid five times for your business. And in your example, know, 60 % is cash, 40 % is roll over. I value my holding company at 10 X. So when you roll your 40 % stake from your op cut to my whole code, you get diluted because you're so\r\n\r\n\r\nSo you do not participate, I mean, you participate in overall growth and if multiple that the business sells for is greater than 10, you still participate in this multiple arbitrage, but they actually are retaining most of the upside. that multiple arbitrage from five to 10 or five to 12, they retain the buyer retains most of it. And hence they're able to pay you more for the business because they know they'll have more economics to them.\r\n\r\n\r\nThe opposite is true. If you are telling the seller, hey, we'll get you 60 % as cash, 40 % as participating in rollover such that you will participate in multiple arbitrage, you can actually theoretically offer them a lower purchase price and still make a case that all in value that they'll get, including the second byte that they apple is actually greater.\r\n\r\n\r\nDzmitry Miranovich (37:28.998)\r\nSo that's...\r\n\r\n\r\nNikolas Hulewsky (37:29.384)\r\nIs it because you're not rolling over their equity necessarily at the valuation that you've set of your hold co? Excuse me, at the mothership? Okay.\r\n\r\n\r\nDzmitry Miranovich (37:36.18)\r\nCorrect, that's right, that's right, that's right. And there are different ways to do it, but generally that's the logic. So I think the logic is actually the opposite of kind of what you described, or at least in the current thinking, the way...\r\n\r\n\r\nNikolas Hulewsky (37:49.164)\r\nIt's okay, you're being very nice. You can say I'm wrong. You're like, I think it's the opposite. Nick, you're stupid.\r\n\r\n\r\nDzmitry Miranovich (37:53.397)\r\nThere are different ways to look at it. No, you're not. But that's kind of generally why rollup, know, kind of big P-backed rollups are able to pay more, right? Because they retain upside and then they're also typically able to create more value quicker out of, not to sit out at the gate, but more value and quicker, right? So they can.\r\n\r\n\r\nthey buy 100k VBDI and it becomes 125k like they won.\r\n\r\n\r\nNikolas Hulewsky (38:23.927)\r\nMm-hmm.\r\n\r\n\r\nWell, what's been interesting too is like to see these people who have gone and raised money and they're paying private equity multiples, but they're not doing what you said in the beginning. Like, yes, the theory is you should be able to unlock synergies or purchasing power or expertise, special specialization, et cetera. But then they've raised the money, but they're not actually able to do that. They just have money that they raised. And so they go and buy these companies and they're still paying a premium for it.\r\n\r\n\r\nAnd yet they don't unlock it upfront. At least that's what I saw 2020, 2021, 2022 when money was flowing. And then they get over their skis and rates go up and it becomes a big issue because they've got this big debt service and they're not actually able to execute in the way that they thought they were supposed to execute. there is big risk in doing it that way if you don't know what you're doing.\r\n\r\n\r\nDzmitry Miranovich (39:17.746)\r\nYeah, look, mean, absolutely. think for when money is flowing, lot of it's relatively easy to make an intellectual argument that there's a ton of multiple arbitrage and I can come in and arbitrage it, buy for five, sell for 10. And I don't have to do anything operationally. The reality though is unless you benefit from very rich markets, which was the case.\r\n\r\n\r\nyou know, three years ago, like you have to create value operationally. Like any investor who's looking at rollups right now, their number one focus is what is the operational value that you're able to create? And so to add another criteria to this framework of which industries are good for rollups, right? It's we should add another one is like ability to create value. And it sort of goes into the same like one plus one plus one is three or greater, right?\r\n\r\n\r\nLike you have to be able to come in and create value. Right. And it has to be more than just raising prices, right. Because that's not sustainable. You cannot grow sustainably by raising prices. Right. Like there has to be some sort of playbook or factor, right. Like in, in vet mad, it's, or many of those kind of, kind of individual location businesses, oftentimes it's just the sellers.\r\n\r\n\r\nNikolas Hulewsky (40:21.869)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (40:25.591)\r\nOkay.\r\n\r\n\r\nDzmitry Miranovich (40:45.288)\r\ndon't have individual operators and individual clinic owners, don't have bandwidth to spend a lot of time on Google marketing or recruiting or putting in place operating SOPs or setting up better procurement. They just don't have bandwidth for that. And so you can come in and establish playbooks for them, give that to them, and there will be some bumps.\r\n\r\n\r\nBut generally, there has to be a clear value creation from how you go from x to 1 and 1\r\n\r\n\r\nNikolas Hulewsky (41:22.702)\r\nI like that one a lot. I think my favorite one that we've talked about, and I talk about this one a lot, is market tailwinds, because everybody looks like a genius when you are in a market that has tailwinds, healthcare being one of them. But a very stark example is, oh, I bought Bitcoin at the beginning of a bull run, and it went from 20,000 to 60,000. I'm an investing genius. Everybody who thought they were a genius at the end of 2022, when their portfolio went up.\r\n\r\n\r\nIt's because there were tailwinds behind them, right? And like, you can look like a genius and you can make the game a lot easier if you choose to invest in companies that are in industries that have tailwinds. these are some crazy stats. I was, looking up as we were preparing for this. Did you know there's more pets in the United States than kids?\r\n\r\n\r\nfreaking nuts. It's according to this. I could be wrong. 80 million, 89 million dogs and 74 million cats in the United States. Dude, isn't last year, people spent $36 billion on vet care.\r\n\r\n\r\nDzmitry Miranovich (42:09.799)\r\nfor that.\r\n\r\n\r\nDzmitry Miranovich (42:19.22)\r\nI think that sounds about right.\r\n\r\n\r\nDzmitry Miranovich (42:30.052)\r\nIt's a I mean, the rate of change matters, right? Because it's like dollar amounts. I mean, those are all very compelling numbers, right? But also, it's important to look what the\r\n\r\n\r\nthe rate of changes and things like that. Because US is inherently such a large economy. You can pick like, the business for, market for toothbrushes is like, I'm sure it's like billions of dollars. But yeah, you're right. mean, I think tailwinds are super helpful. If your day to day is an uphill battle against pricing pressure, volume pressure,\r\n\r\n\r\nNikolas Hulewsky (42:45.367)\r\nYes.\r\n\r\n\r\nDzmitry Miranovich (43:14.132)\r\nindustry pressure, I think...\r\n\r\n\r\nThose industries tend to be a lot less forgiving. Like the more kind of margin of safety you have from the industry itself, the more forgiving it will be. Like there are people who operate, mean, like coal mines, I'm sure. Like there might be some recent tailwinds to that, but generally coal mines as an industry have been declining for decades, right? Probably, I mean, don't quote me on that for a long time.\r\n\r\n\r\nNikolas Hulewsky (43:34.158)\r\nHmph.\r\n\r\n\r\nNikolas Hulewsky (43:49.388)\r\nYeah, not. I mean...\r\n\r\n\r\nDzmitry Miranovich (43:50.389)\r\nAnd but there are people who've done it well, right? Whether it's like buying distress and like doing something about it. Like you can buy some businesses for cash flow, you know, it's a declining business, but you're essentially buying it. It's like a melting ice cube. You can do those things really well, but those industries are a lot less forgiving, right? And that's in the roll up theme where you're buying, partnering with many businesses a year.\r\n\r\n\r\nNikolas Hulewsky (44:09.955)\r\nYes.\r\n\r\n\r\nDzmitry Miranovich (44:17.98)\r\nAnd it's inherently a complex structure, right? You're operating a bunch of businesses. Like the more forgiven your industry is, the better it is.\r\n\r\n\r\nNikolas Hulewsky (44:29.414)\r\nI well, because there's a lot more margin for error. Like you're going to be making. Yeah, you're going to be making errors. So you need a forgiving industry. And generally speaking, one with tailwinds has a lot higher margin for error. I think that was one. Was it Munger or Buffett? It was like my favorite kind of boat is one with tailwinds or something like that. It's like some quote like that. Right. Yeah, you just. And unfortunately, there's a lot of people who.\r\n\r\n\r\nDzmitry Miranovich (44:32.552)\r\nYeah, absolutely. Yeah, absolutely.\r\n\r\n\r\nDzmitry Miranovich (44:47.188)\r\nThat sounds like one of them would say.\r\n\r\n\r\nNikolas Hulewsky (44:55.946)\r\noperate in tailwind driven markets and think that they're geniuses. So, and that's okay. That's okay for them to think that. I like these, I really like these lenses. So fragmentation, total adjustable market, competition, operational value creation, and then market tailwinds were, they're very, very good lenses to look at this through. I really liked that runway that you said as well. Sorry, I cut you off.\r\n\r\n\r\nDzmitry Miranovich (45:14.686)\r\nYep.\r\n\r\n\r\nDzmitry Miranovich (45:19.986)\r\nNo, it's fine. There's another one I would add is like risk mitigation is important one for the small businesses are inherently risky for many reasons. And so as a bigger organization, you should be able to mitigate their solos risks, right? Very simple examples, like recruiting, right? Like an individual veterinary clinic is not able to afford the recruiter, right?\r\n\r\n\r\nNikolas Hulewsky (45:22.584)\r\nBye.\r\n\r\n\r\nNikolas Hulewsky (45:39.054)\r\nMm.\r\n\r\n\r\nDzmitry Miranovich (45:47.349)\r\nThey're able to hire a third party recruiter, which is expensive, typically inefficient, but they're not able to afford the recruiter. A group is able to afford the recruiter, which will generally do a better job sourcing and hiring candidates than like a third party recruiter. So by being a group, you're able to solve some of those risks and manage them better than the individual clinics would be able to do.\r\n\r\n\r\nNikolas Hulewsky (46:11.214)\r\nUh, you know what's interesting? I went and as we were talking, I went and ran this, uh, you said that DSOs. So the dental rollup space was like, was too crowded and like there was, it wasn't as good of an opportunity. At least that's what I heard you say. I okay? Um, that, that surprised me because I love DSOs. I think they're freaking great businesses. So as we were talking, I went and I looked and, um, in the current market. there's\r\n\r\n\r\nDzmitry Miranovich (46:26.418)\r\nYeah, that's right. That's my view of it at least.\r\n\r\n\r\nNikolas Hulewsky (46:41.326)\r\n200,000 again, this is all chat GPT. So somebody is going to fact check me, but it's 200,000 dental practices in the United States. 35 % of them are in DSOs. So I looked at that and I was like, well, 35%, that's not terrible consolidation. I would view that as still fragmented. And then I, and then I asked it the next question, how many practices per year change hands? And so it went through this analysis and it was like, uh, approximately 19,000 practices a year change hands.\r\n\r\n\r\nSo I did the math and the runway was 6.8 years. So is that 200,000 minus the 35 % that are consolidated. get about 130,000 practices divided by that 19,000, which change hands every year, 6.8 years, which would be less than the 10 year timeline you talked about and not unattractive. Anyways, that was a cool, that was a cool like way to framework to look at it.\r\n\r\n\r\nDzmitry Miranovich (47:29.778)\r\nYeah. Yeah. I would say though, I think that 19,000, that probably includes platforms. I mean, assuming that number is correct, which I have no idea. But that probably, but that probably, that's the right, I think that's the right approach. I would of course like, and I know you would too, like in doing like actual research, like you would.\r\n\r\n\r\nNikolas Hulewsky (47:41.105)\r\nyeah.\r\n\r\n\r\nThe same.\r\n\r\n\r\nDzmitry Miranovich (47:56.105)\r\ndig deeper and like find like more reliable numbers. But that's the right mental model. But I would say like that figure probably includes like platform sales, which inherently not the same thing, right? I also think back to the point of addressable marketing, I think in dental, you have to narrow it down to clinics that are actually, you know, sort of say viable, right? Because a lot of...\r\n\r\n\r\nNikolas Hulewsky (47:56.492)\r\nYeah, I just.\r\n\r\n\r\nNikolas Hulewsky (48:00.908)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (48:23.264)\r\nIndependent.\r\n\r\n\r\nDzmitry Miranovich (48:24.668)\r\nYeah, well, a lot of it, a lot of the dental clinics are a Dr. Susan or Joe, and it's their name on the wall. And it's like you walk in and there's like one exam room and like a reception room and that's it. Right. Like that, that is inherently, very difficult to wrap your head around. Right. There's just so many like single dentists kind of, I'm open two days a week type businesses, in the U S but.\r\n\r\n\r\nNikolas Hulewsky (48:46.766)\r\nTotally.\r\n\r\n\r\nDzmitry Miranovich (48:54.172)\r\nAnyways, yeah, sorry, I mean to interrupt you.\r\n\r\n\r\nNikolas Hulewsky (48:55.741)\r\nWell, no, man, to be true. was, this was amazing. This was absolutely the best explanation I've ever gotten from anybody on how to look at a roll up. I mean, I'm being dead serious. I like, really love the lenses that you kind of view these through and how specific you are in creating quantifiable ways, proxies to measure the opportunity within each one through each one of those lenses. So I just thought that was really cool. And obviously you're going to be hyper successful. You already got 20 clinics.\r\n\r\n\r\nDzmitry Miranovich (49:22.772)\r\nYou're being too kind. You're being too kind, but thank you. Sure.\r\n\r\n\r\nNikolas Hulewsky (49:26.188)\r\nWell, you're paying me. You're paying me, right? Right? You're paying me checks in the mail. my gosh. Yeah. Anyway, this, this was awesome. If you want to come find more information about you, where's the best place.\r\n\r\n\r\nDzmitry Miranovich (49:40.208)\r\nSo let's see. Great question. I have an Axe account, but to be fair, I have not used it in like a year. I might resume that. yeah, I'm not very public, but I do have a Twitter account. just, again, I haven't used it in Axe.\r\n\r\n\r\nNikolas Hulewsky (49:57.27)\r\nOkay, Twitter, or you can go.\r\n\r\n\r\nNikolas Hulewsky (50:04.088)\r\nWell, you want to listen, if you want to talk to Dimitri, message me and then I'll message Dimitri. All right. Is that what you wanted? I'll be your go between. All right, man. This was great.\r\n\r\n\r\nDzmitry Miranovich (50:09.62)\r\nThere you go. That's perfect. That's right.\r\n\r\n\r\nCool.",
  "metadata": {
    "duration": "",
    "date": "2025-08-01",
    "platform_source": "Google Drive"
  }
}