{
  "episode_number": 253,
  "episode_title": "253 - Andrew Pignanelli",
  "guest_name": "Unknown",
  "business_name": "Unknown",
  "transcript": "﻿Nikolas Hulewsky (00:00.905)\r\nMic check. cool. And again, if there's anything in here where you're like, said that wrong, just tell me I'll market and we can cut it in it in post. All right. Andrew Pignonelli. Welcome to Nick, Nick economics. I am really excited to have you. The reason I'm excited to have you is because you co-founded, excuse me, you founded a company called the general intelligence company of New York. And your first product is this product called co-founder. I saw this video that was released and there was a tagline that you had in there that really caught my ear, which was.\r\n\r\n\r\nAndrew Pignanelli (00:10.744)\r\nSounds good.\r\n\r\n\r\nNikolas Hulewsky (00:31.123)\r\nWe want to facilitate one person billion dollar companies, which sounds outlandish, but you guys have raised a good amount of money. You launched in September on September 8th of this year. today is October 27th and you have already 6,000 customers. You've got, in the mid hundreds of daily active users, the company is growing really, really fast. And I think you're tackling this really cool, unique problem, which is how do I, as a founder extend myself?\r\n\r\n\r\nwithout having to do it the traditional way, which is hiring a team, onboarding a team, and growing that way. And I think for people who are listening who are entrepreneurs, that's what they want to figure out is like, how do I grow my business without necessarily having to scale the people side of things? So my first question to you is, what does it mean to you to help companies become one person billion dollar companies?\r\n\r\n\r\nAndrew Pignanelli (01:20.748)\r\nYeah, and thanks for having me on. This concept is really important for us. We like to think about entrepreneurs all the time and the challenges that they face every day. And going after this one person billion dollar company is like a long term goal on just solving those problems for them in their day to day lives. We wanted to make it really, really easy for people to start companies and to run companies. And that's what we started.\r\n\r\n\r\nwas with that goal of making it so fast, so easy that you could have a business idea at night on Friday and then by Monday morning have an actual real legitimate business. And so that's really what we're working towards. We've seen it resonate with people too on like the early signups of these like startup founders and entrepreneurs and things that are just trying to use it to give themselves more time in the day.\r\n\r\n\r\nNikolas Hulewsky (01:51.477)\r\nyou\r\n\r\n\r\nNikolas Hulewsky (02:14.569)\r\nYeah. Well, it's really interesting. I've been thinking about this a lot myself because there is so much data out there that we just individually create, right? I've got my Gmail, I've got Google docs, I've got text messages, we've got Slack. Like, so you got your CRM where you track leads, you got where you document things, et cetera. And like, I'm constantly thinking, how do I create an end of the day context document so that tomorrow I can just be off and running?\r\n\r\n\r\nand have AI help me with a number of these processes. And as I've been thinking about it, the hard part is getting all of those to tie in, but also making sure there's enough capacity for AI to look through it, synthesize it, and then give whatever analysis and context it needs. How do you do it? How are you connecting to all these disparate data points? it magic? Don't lie to me. It's magic, isn't it?\r\n\r\n\r\nAndrew Pignanelli (03:07.081)\r\nYou know, it's definitely not magic and I sometimes wish it was. We plug in all these different systems and we often do them. We actually built these integrations ourselves. We're not using MCP or anything else. We do use something for authentication so we can like pull, you know, just\r\n\r\n\r\npull the off details, you can log in through your login system. But all of the integrations and pulling the data, we've written ourselves. And we've done that because if you use someone else's standard, you tend to lose the ability to control the experience. And you make it harder for people to be able to actually have a great experience on that. So for example, email. If you're using an MCP for email,\r\n\r\n\r\nNikolas Hulewsky (03:39.797)\r\nThank\r\n\r\n\r\nAndrew Pignanelli (03:55.828)\r\nit might not be able to create labels the right way, or it might not be able to be written a certain way. Whereas when writing it ourselves, we're able to pull the style and get it perfectly.\r\n\r\n\r\nNikolas Hulewsky (04:07.239)\r\nSo I am a novice. Are you technical? you like an engineering background? Okay. So I'm not. I am what the kids call a vibe coder. Claude code is my tool of choice. But you said a couple of things in there. So MCP, I just wanted to define that for people. So that's the model context protocol. Can you explain exactly what that is?\r\n\r\n\r\nAndrew Pignanelli (04:10.827)\r\nYes.\r\n\r\n\r\nAndrew Pignanelli (04:27.47)\r\nYeah. So MCP came out in, I think it was February where, uh, this is the Anthropics take on how do we get a bunch of agents connected to a bunch of tools? And it's this new standard where you take like an API, which can plug into some service and you give it a series of instructions attached to the tools. And so you can essentially just give this thing to an agent and it can read the instructions and use the server to run the tool. So if.\r\n\r\n\r\nIf we're talking about emails, there is a Gmail MCP where it says, if you want to send an email, use the Send Email tool. Now, this is different than an API, which is essentially just a list of all the tools that you can use. And so I think that's a big difference.\r\n\r\n\r\nNikolas Hulewsky (05:16.753)\r\nLet's back up actually even just a little more because I want to talk about each one of these things. I think it's helpful for people to understand the way that these tools work. just lay out what's the use case? What problem is this solving that you created where entrepreneurs are trying to fix? What problem is it actually attacking?\r\n\r\n\r\nAndrew Pignanelli (05:39.318)\r\nYeah. So we call this the million paper cuts problem, which is less of like one single thing and more of like, there's a million things you do every day that are small and they take a bit of time and they take a bit of brain capacity. So think of it like you have a couple of people trying to schedule a meeting and you need to get them together. You need to send a calendar invite. You need to send someone an email with info on your company. You need to get a document from one email.\r\n\r\n\r\nput it in another and send it across to someone. You need to forecast a budget, but it's relatively simple. Or you just need to research something. All of this stuff is relatively small on the surface, but if you are an entrepreneur and you're a business owner, you have to do a million of these things every day. And so our solution is, with CoFounder, takes a lot of that off the plate and it's able to just do it for you.\r\n\r\n\r\nwe're pitching it as this sort of chief of staff or like self completing to do list that you have every day.\r\n\r\n\r\nNikolas Hulewsky (06:41.685)\r\nYeah, because for a lot of entrepreneurs, especially as you're scaling, it's like, it'd be nice to have somebody to schedule this meeting or to give me a prep document for this person I'm about to meet with or to be up to speed so that I can understand where I even pull sales data from the CRM. There's a lot of effectively either context building that you have to do as an entrepreneur or handing off context to another individual so they can go and execute a task. So like you're saying, it's like a million of these little cuts kind of throughout the day. This would allow\r\n\r\n\r\nacross all of those data sources or I don't even know modes of communication, right? Slack, email, text, et cetera, for co-pilot. I keep saying freaking co-pilot, I'm sorry. Co-founder to help you as a chief of staff, right? It's like to kind of be an extension of you. Okay.\r\n\r\n\r\nAndrew Pignanelli (07:29.002)\r\nYeah, exactly. It's just like a thing doer, is what we call it. the reason it's good at that is because it pulls in the context from how you actually work. instead of just doing stuff, it does stuff while knowing you. So instead of just scheduling a meeting, it knows, you're not going to be there. If you have to go across town, you're not going to be there in time. So you can't schedule at that restaurant.\r\n\r\n\r\nyou know, instead of just writing some random reply to an email, it can write a reply knowing the context you need to write that email, which is a really big thing that you see as an executive is just having having to have this knowledge to deal with these things.\r\n\r\n\r\nNikolas Hulewsky (08:09.663)\r\nWhat are the biggest use cases you're seeing people use CoFounder for right now?\r\n\r\n\r\nAndrew Pignanelli (08:14.318)\r\nSo we are seeing a lot of scheduling and emails. I think a big one is also research. One of the things Cofoundr can do is it can monitor a set of websites and give you updates on those websites. So if you give like 20 websites, it can give you an update every time something changes. So we're seeing people use this for competitor monitoring, for content creation, to let's say monitor a bunch of blogs and pull in content from them and then write your own blog piece.\r\n\r\n\r\nNikolas Hulewsky (08:17.258)\r\nOkay.\r\n\r\n\r\nAndrew Pignanelli (08:41.942)\r\nWe're seeing people use it for recruiting. They use it for recruiting automatically by setting up sequences. We see people using it for keeping themselves up to date every day. Things like that.\r\n\r\n\r\nNikolas Hulewsky (08:54.729)\r\nLet's talk about, I'm curious about this, so the scheduling and the emails. I think I'm the most curious about what's it doing in the scheduling? Is it making decisions? you, do you like, hey, co-founder, schedule a meeting with Barry for next week, find any time, and then it goes and does it? like, how does that interaction work?\r\n\r\n\r\nAndrew Pignanelli (09:14.422)\r\nYeah, it depends on what you ask, right? So if you say find any time, would use the, it would look at your calendar and find free slots on the calendar. If you say next week, it's going to make a decision about what that means. You maybe if, if, know, you say next week, it might be like Monday, right? And then it will look at the free slots in your calendar, and then it will figure out who the person you were talking about is by searching them in your email. And then it will actually send a calendar invite. Now,\r\n\r\n\r\nNikolas Hulewsky (09:33.077)\r\nMm.\r\n\r\n\r\nAndrew Pignanelli (09:44.194)\r\nWe've built all these guardrails so that it's not just sending these things willy-nilly. I actually learned that one the hard way by not having those guardrails and plugging my email and calendar in. It sent like 20 different calendar invites to people in my spam folder, actually. Yeah. And I literally had to send apology emails to everyone and then block the people that needed to be blocked. But the...\r\n\r\n\r\nYeah, the way that works now is it like, queues it up and it's like, hey, this is a calendar invite for this next week. You want to send it? Yes. And so the biggest change from your workflow goes from like having to go and do that to just approving it. And now you're seeing all these things and you could just approve them and you can approve the emails that are written and then you could just hit all of these things at the same time.\r\n\r\n\r\nNikolas Hulewsky (10:37.045)\r\nCan you show me? Like, can I see what that looks like?\r\n\r\n\r\nAndrew Pignanelli (10:42.252)\r\nLet me line myself up.\r\n\r\n\r\nNikolas Hulewsky (10:43.561)\r\nAnd while you're pulling that up, I'm curious on your thoughts here. I've been thinking a lot about AI and agents in particular as if you want them to work well, you've got to treat them as humans. I know that kind of like sounds weird to say, but if you had unlimited money and could hire an assistant to handle your schedule, what would you need to tell them in order for them to work well? You'd have to be very specific on.\r\n\r\n\r\nYou don't just say, hey, schedule a meeting with Barry. It's like, schedule a meeting with Barry at this place next week during these times. you it's the same thing. It's just, you're happening to be using AI, which feels a little bit weird. And so with, with what you're building, it, do you feel that philosophy? I oversimplifying it? Or is that like kind of a good way to think about how to interact with these agents?\r\n\r\n\r\nAndrew Pignanelli (11:32.332)\r\nYeah, I mean, think it is changing the way that you're thinking about this stuff now. Like we lean into stuff and companies where they're also down to lean into AI. if you're able to, can lean into it really hard. And it does change the way that you work, right? So like instead of opening your email the first thing in the morning, maybe you'll open Co-Founder and tell it to read your email.\r\n\r\n\r\nOr like instead of starting the chat session, you might make an automation that starts this chat session.\r\n\r\n\r\nNikolas Hulewsky (12:10.355)\r\nSo what did you type? What did you type in here? I'm looking at this right now. So co-founder has a chat window that you go to and you're interacting with. Okay.\r\n\r\n\r\nAndrew Pignanelli (12:18.24)\r\nYeah, so I, hold on, it's just almost, yeah. So I asked it, what's my calendar look like on Thursday? And so this is to give you an idea of like how it works, right? So it, it used its memory system to see past calendar events, but future calendar events are not in the memory yet. And so it did a search and it found what I'm doing on Thursday, which this is all accurate. Like this is the things there. And then it's giving me a response, right? So.\r\n\r\n\r\nNikolas Hulewsky (12:24.682)\r\nMm-hmm.\r\n\r\n\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (12:41.985)\r\nwow.\r\n\r\n\r\nAndrew Pignanelli (12:45.934)\r\nMorning, I do this. During the day, I'm speaking at that time. And then in the evening, I have a cocktail hour and then a party, right? So that's how it kind of uses the tools. And it's got this to-do list. And this to-do list will like, it can be really long, it be really short. So I can say...\r\n\r\n\r\nNikolas Hulewsky (13:07.861)\r\nWas that native in co-founder?\r\n\r\n\r\nAndrew Pignanelli (13:11.308)\r\nYeah, so this is one of the ways we trick the agent into running for a long time. So I can say something like, it's true, and I can say something like, okay, put this in a Google Sheet with each event in a row. And so now this is gonna use the spreadsheet tool to go and put this in a Google Sheet. And you'll see the to-do list light up and it will be able to show you that.\r\n\r\n\r\nNikolas Hulewsky (13:36.499)\r\nAssuming you've given it access to your Google Drive and your Gmail and like all these things have already been ported in.\r\n\r\n\r\nAndrew Pignanelli (13:44.108)\r\nYeah, I can show you that in a minute. Let's just watch Cofounder run on this sheet for a second, then I'll go and show you the integrations. Yeah, mean it plugs into everything you use in your workflow.\r\n\r\n\r\nNikolas Hulewsky (13:45.173)\r\nOkay. Yeah, that's fine.\r\n\r\n\r\nNikolas Hulewsky (13:51.924)\r\nAnd what do you-\r\n\r\n\r\nNikolas Hulewsky (13:55.999)\r\nWhat are you running this on top of? What model is this using?\r\n\r\n\r\nAndrew Pignanelli (13:59.938)\r\nRight now this is using Claude 4.5 Haiku. We can use 4.5 Sonnet or we can use ChatGPT type models. So you can see there, it made this to-do list where it has created Google Sheet and add them. And it's going to cross items off on this to-do list as it does it. Yeah. And the models have been a little bit slow today. So it might be a little bit slower than normal, but it will go in like...\r\n\r\n\r\nNikolas Hulewsky (14:13.589)\r\nWhat?\r\n\r\n\r\nas it does it.\r\n\r\n\r\nAndrew Pignanelli (14:29.598)\r\ndo this across different integrations and things. And you can make these to do lists really long. yeah, there we go. So this shows you the human in the loop aspect a little bit. It can create a Google Sheet and if I click show more, it should be able to run that. Actually don't know why it's not running this here.\r\n\r\n\r\nNikolas Hulewsky (14:40.213)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (14:48.789)\r\nBut it needs you to actually say, yes, run.\r\n\r\n\r\nAndrew Pignanelli (14:53.07)\r\nCorrect, yeah. So let me try this.\r\n\r\n\r\nNikolas Hulewsky (14:57.747)\r\nIs it to the point yet where it's, it doesn't need you or like, why, like, why does it need the human in the loop?\r\n\r\n\r\nAndrew Pignanelli (15:04.258)\r\nWe've set this up so that you can go and do it like that because we don't want the agent just doing stuff for you. Right. So let's say this is a very long, complicated spreadsheet that you made. You don't want it just writing to that spreadsheet without your approval. And what you can do though, is you can set this to auto approve, which will just keep running the agent and it will basically say yes to everything.\r\n\r\n\r\nNikolas Hulewsky (15:08.043)\r\nNikolas Hulewsky (15:28.213)\r\nJust do it.\r\n\r\n\r\nAndrew Pignanelli (15:31.502)\r\nAnd so if you're doing something that's really long time, you're going to want it to do that. So if I click this, I might have to log in with my other Google account. But no, yeah, see, there it is. And really quickly, I want to show you what connecting stuff looks like. If you go to the integrations page, we've got all these integrations connected. And so like Google Drive, Intercom, Loops, Notion. And I can show you how this works. If I click Disconnect here, it will just disconnect it.\r\n\r\n\r\nIt just takes like three seconds to connect to Google Sheets. And you just hit continue. And I don't think you've seen this tab, but if I connect to...\r\n\r\n\r\nNikolas Hulewsky (16:11.633)\r\nI'm just looking at the account connection in progress. Pipe dream.\r\n\r\n\r\nAndrew Pignanelli (16:16.44)\r\nYep, and then I just click that and then now it should be good. It was just like two buttons on the other side. I clicked the Google login screen. So, you know, we plug into all this different stuff.\r\n\r\n\r\nNikolas Hulewsky (16:29.045)\r\nHow is this different than if I'm in Cloud and I've connected my Google Drive and my Gmail and I want to query it? Is this different? How is it functionally different?\r\n\r\n\r\nAndrew Pignanelli (16:41.89)\r\nYeah, so you can do pretty simple operations in a very similar way to quad. One of the biggest differences is the memory system that we've added. So this knows things about me as well as so I can say something like what's going on in engineering and it will pull stuff from its native memory and it will tell me what the things that have happened from my memory and in my company. And I think that's the biggest difference is it knows me and it can do this stuff.\r\n\r\n\r\nNikolas Hulewsky (17:11.541)\r\nYeah, because if I was in Claude, I'd either need to have, if it's a project, I'd either have to add new context documents to the project or have some way of getting it up to speed on what's going on. It's not persistent.\r\n\r\n\r\nAndrew Pignanelli (17:23.276)\r\nYeah. And there's one thing that I haven't shown you yet, which is the way you make automations. Now, Cofounder is the easiest way to make automations in the world. So I can say, okay, do this every day and send me a DM on Slack. And Cofounder is going to go ahead and make that an automation. this...\r\n\r\n\r\nNikolas Hulewsky (17:28.757)\r\nWow.\r\n\r\n\r\nAndrew Pignanelli (17:45.89)\r\nAnd that's it. That's all I have to say. And it sets up the web hooks and everything. And it sets up the context and the tools and everything for you. And so if I click this, it will go to the flow. And this is like, this is the automation. Now it runs every time. So if I want to like try it, I can click test and it's going to test it. It's going to run it right now for me. And like, this is the easiest way to do anything.\r\n\r\n\r\nNikolas Hulewsky (18:01.033)\r\nWow.\r\n\r\n\r\nNikolas Hulewsky (18:06.965)\r\nand you don't have to go through Zapier. Like you don't have to go through Zapier. It runs the automations for you.\r\n\r\n\r\nAndrew Pignanelli (18:12.568)\r\nExactly. Runs in for me right now. And so it's testing this right now. It's like pulling up the flow. And so now it's initiating checking GitHub and sending a Slack message. You can see the logs over here. Yeah. I mean, it's all natural language based. Like if I want to change the plan, if I go to the flow here and I want to change the plan, I can just click it and I can edit it and change it right there. If I want to change the integrations, they happen automatically. I can't even choose.\r\n\r\n\r\nNikolas Hulewsky (18:24.927)\r\nDude, that's really cool.\r\n\r\n\r\nAndrew Pignanelli (18:42.498)\r\nthese because the agent just knows what I want.\r\n\r\n\r\nNikolas Hulewsky (18:44.703)\r\nSo like if I was a business owner, I'd like, you know what? I want a marketing report end of day, every day. want engineering to report every day, end of day. want finance once a week. And I could come in here and say, give me the marketing end of day report. This is how I want it to look every single day sent to my email. And then it would just create that automation.\r\n\r\n\r\nAndrew Pignanelli (19:04.758)\r\nExactly. Yeah. And you can have it ask you for permission to do whatever you want, or you can have it run automatically. So, you know, if I said to run automatically, it won't ask me permission to send it in. It will just send me the report. And like it's all with natural language. So you can just tell the agent you don't like how something is and the agent will change it for you. And so this is like a big part of our thesis for the company, which is like agents all the way down. Everything is an agent. And if you do that, then you can do everything with natural language.\r\n\r\n\r\nNikolas Hulewsky (19:11.293)\r\nWhoa.\r\n\r\n\r\nNikolas Hulewsky (19:30.356)\r\nYeah.\r\n\r\n\r\nAndrew Pignanelli (19:34.534)\r\nand you can like things just kind of work together and it can operate together and that's how we design.\r\n\r\n\r\nNikolas Hulewsky (19:39.797)\r\nCan it respond to emails for me? let's say that I wanted to, would I create an agent to do that? Or if I was like, Hey, I just want you to go through all the emails that I get every day with questions that you know how to answer and answer those questions and then star all the things that I need to look at. Cause as an entrepreneur, there are things that I don't need to look at, but they come to my email because whatever payroll processed. Here's the, here's the update that it actually processed or there's a customer question, but it was handled by my\r\n\r\n\r\nmarketing team, don't necessarily need to see that, but how would I set it up as an assistant to basically handle my emails?\r\n\r\n\r\nAndrew Pignanelli (20:17.454)\r\nYeah, so it's just as easy. So like this one, for example, is someone wanted to take emails from investor updates and forward them to whoever this is. And co-founder just has access to your email, right? I don't get investor updates because I'm not a VC, but it was just as easy, right? It can read my emails. And so I'm going to try to see if I can do this without leaking all the emails in my inbox on this podcast.\r\n\r\n\r\nNikolas Hulewsky (20:45.769)\r\nHahaha\r\n\r\n\r\nAndrew Pignanelli (20:47.298)\r\nBut let's see, what was your email address? Wait, email from nik at cofounders.com.\r\n\r\n\r\nNikolas Hulewsky (20:49.397)\r\nWe'll blur it if it shows anything. N-I-K.\r\n\r\n\r\nNikolas Hulewsky (20:56.913)\r\nat co-founders.\r\n\r\n\r\nNikolas Hulewsky (21:02.858)\r\nYep, done.\r\n\r\n\r\nthink I made the joke to you when I saw your video that I was like, I might want to buy my website someday.\r\n\r\n\r\nAndrew Pignanelli (21:09.185)\r\nYeah.\r\n\r\n\r\nAndrew Pignanelli (21:12.622)\r\nSo it's going to do when it's loading here, it will do a memory search. And it was not able to find you in the memory search, but it will be able to find you in like the long run agent search. And so now it's just going to search my Gmail and find it. So it does two searches.\r\n\r\n\r\nNikolas Hulewsky (21:28.437)\r\nSo is it like storing a, I don't know, static context document every day of kind of updating your history? And then if it doesn't find it there, it runs an actual agent search?\r\n\r\n\r\nAndrew Pignanelli (21:39.15)\r\nCorrect, yeah. So that works more for like concepts and like people you know. And so if I used your name, it might have gotten that more accurate than your email address because it kind of knows that you sent me this email. And so I actually couldn't find any emails from you. Maybe I've connected my wrong email address. I can't remember. it has the event. Did we?\r\n\r\n\r\nNikolas Hulewsky (21:44.18)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (21:58.567)\r\nThat's hurtful. It's okay.\r\n\r\n\r\nNikolas Hulewsky (22:04.652)\r\nyou have a podcasting event. That's cool.\r\n\r\n\r\nAndrew Pignanelli (22:08.492)\r\nDid we email back and forth at all?\r\n\r\n\r\nNikolas Hulewsky (22:11.283)\r\nWe might've just DM'd on Twitter.\r\n\r\n\r\nAndrew Pignanelli (22:13.29)\r\nI actually don't think we've emailed. Let me see. Who was that invite from? So yeah, so Nick, how do you say that? Hulovsky? Hulusky. Yeah. So it does know that it's from you, but I think it might've come from a different email address. Yeah, right there. So I guess we didn't actually email with each other. So I guess that kind of worked, right?\r\n\r\n\r\nNikolas Hulewsky (22:15.594)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (22:37.523)\r\nInteresting,\r\n\r\n\r\nNikolas Hulewsky (22:43.21)\r\nYeah.\r\n\r\n\r\nAndrew Pignanelli (22:43.599)\r\nbut yeah, so there's, there's co-founder.\r\n\r\n\r\nNikolas Hulewsky (22:48.949)\r\nDoes it currently respond to emails for you?\r\n\r\n\r\nAndrew Pignanelli (22:52.28)\r\nYeah, if you want to. So I can say, let's see, send an email to Nick saying, I'm excited to be on his podcast. And so when it will pull up this thing, it's not going to send it immediately. This is one of those things where I have to approve it. But yeah, I mean, we've got a little email editor here.\r\n\r\n\r\nAnd one of the things is it makes this to-do list every time. So very simple tasks take a minute. We're looking into making that faster, but.\r\n\r\n\r\nNikolas Hulewsky (23:25.065)\r\nYeah. So you could kind of just operate within co-founder and never leave that window. Like you don't need to go to Slack. You don't need to go to your email. I mean, I don't know. Maybe I'm wrong. It just feels like you could get any updates here and not have to like context or not your windows switch. guess. Is that, did you design it that way?\r\n\r\n\r\nAndrew Pignanelli (23:48.61)\r\nYeah, we did. Yeah. And we're actually launching this feature we call like to-do lists or home where instead of mini to-do lists, it's a, it's okay. It has an email. I don't know. I guess it's like running the issues at the Gmail tool, but you could do everything from within co-founder and basically make this to-do list and then have it complete itself. So.\r\n\r\n\r\nNikolas Hulewsky (24:10.581)\r\nMm-hmm.\r\n\r\n\r\nCan you tell it, these types of emails, you can always respond if you know X, Y, Can you effectively automate the responses? that make sense? Because I've handed off things to my executive assistant. She just answers emails. I don't have to check anything. But there are certain things she can. She stars them for me, and then I look at them later.\r\n\r\n\r\nAndrew Pignanelli (24:25.132)\r\nYes.\r\n\r\n\r\nAndrew Pignanelli (24:34.606)\r\nYeah, so here's an example of like one that looks at my email for spam and it's really inefficient, but it does work where it will say, oh, you know, if it's from here, mark the email as spam and like here's an example of some email from someone and it scanned all these emails and it said, oh, you know, these are\r\n\r\n\r\nNone of these are spam, so it didn't actually need to mark them as spam. But I could also have it respond to these emails. So I'll respond to the last one. And then it will just pull it up and write a response.\r\n\r\n\r\nNikolas Hulewsky (25:22.421)\r\nHave you messed around with any of these browsers, either Comet or Atlas?\r\n\r\n\r\nAndrew Pignanelli (25:26.67)\r\nI'm on Dia right now. This is through Dia. But I honestly find myself never using the AI features. I kind of want a browser to browse and then, you know, agents to agent. Not the same thing.\r\n\r\n\r\nNikolas Hulewsky (25:38.879)\r\nWell, I the nice thing, I was messing around with it last night in particular, but the nice thing is if I'm on a website or if I'm on a tool or anywhere that is browser based and I want to either set a reminder or ask AI a question, I got to go to another window. And the nice thing about Atlas is like, I can just click there and it opens on the side. Like having co-founder natively in your browser would be freaking sweet. Cause then you could just go to co-founder, not lose your\r\n\r\n\r\nLike not get out of your flow state, right? no anyways, that's I'm sure you get product ideas all the time. It's hard to prioritize things, but I don't know if you're thinking of like having a plug into your browser.\r\n\r\n\r\nAndrew Pignanelli (26:16.685)\r\nYeah.\r\n\r\n\r\nWe've thought about making a browser extension as well, or maybe even a desktop app. See, a desktop app unlocks some really interesting stuff like iMessage, like Apple Notes files in the computer. And so we're looking into both of those things, but we're a very small team right now. It's just three engineers, so not a lot we're working on.\r\n\r\n\r\nNikolas Hulewsky (26:25.471)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (26:31.305)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (26:38.549)\r\nHow, so tell me if I'm an entrepreneur or if I wanted to use this, how hard is the onboarding? Because if I just connect my Google Drive, there's a million things in there. Do I have to tell the AI what's what or does it go through and sort of comb it and self identify what's important and what's not?\r\n\r\n\r\nAndrew Pignanelli (26:58.158)\r\nIt goes in and it finds all that stuff out. So it structures the memory for you on its own. And actually people love our onboarding. We have become known as like one of the nicest onboardings in the industry. And it figures out your style, it figures out your calendar, and it just, reads this for you. And we actually designed the onboarding so that you only have to type something in twice, which is your name. And it's actually already filled in for you.\r\n\r\n\r\nNikolas Hulewsky (27:00.661)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (27:08.137)\r\nOkay.\r\n\r\n\r\nAndrew Pignanelli (27:28.099)\r\nIt's your name and your company's website. And both of these things are filled in for you if you use your company email. And so it's quite fun.\r\n\r\n\r\nNikolas Hulewsky (27:38.197)\r\nWhat industries are you seeing people use this in right now? Is it just a lot of tech founders or are you getting people, know, SMB owners all the way to corporate individuals? Like who's actually using this tool?\r\n\r\n\r\nAndrew Pignanelli (27:50.766)\r\nWe've seen a lot of tech founders. think that's our biggest, biggest sort of segment. We also have people from like mid-sized startups, like thousand person companies. Some of the companies you might've heard of. Like, I don't know if I should name drop or not right now, but we, big companies.\r\n\r\n\r\nNikolas Hulewsky (28:13.203)\r\nThat's okay. Yeah, I don't. It's fine. Big companies. The biggest companies many people like, you know, pulling a Donald. They're huge. You just\r\n\r\n\r\nAndrew Pignanelli (28:20.002)\r\nThey're huge. We do have a number of investors that use it too because they like the monitoring system a lot. Also, I talked to bunch of investors while fundraising and I think it stuck with them. And then we've had some requests for like services businesses as well, like people doing agencies or, you know, accountants and things like that, that are just using it to save themselves time.\r\n\r\n\r\nNikolas Hulewsky (28:49.084)\r\nWhat's the monitoring function?\r\n\r\n\r\nAndrew Pignanelli (28:51.79)\r\nYou can set it. can give it like a list of URLs and it will monitor those websites for changes and so what these will use it for is companies are interested in or Competitors of their deals are looking at so you can give it like 20 URLs like all these are all the competitors And then say monitor these for for any blog posts or press releases, so, know when they get funded\r\n\r\n\r\nNikolas Hulewsky (29:00.97)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (29:14.677)\r\nHow many could you monitor? it just like, what's the limit?\r\n\r\n\r\nAndrew Pignanelli (29:18.68)\r\nI actually don't know. think it's like a hundred or something. Which we may have just set that because if you go higher, it gets really expensive. Cause we're basically putting a little mini, pretty cheap, but mini agent on a, on these websites to check. But yeah, I mean, I think a hundred, I could look into more, but.\r\n\r\n\r\nNikolas Hulewsky (29:22.718)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (29:42.581)\r\nAre you using this? Obviously you are.\r\n\r\n\r\nAndrew Pignanelli (29:45.102)\r\nOf course, I use it for managing my schedule. I use the monitoring for competitors. I know all my competitors. I know everything about them.\r\n\r\n\r\nNikolas Hulewsky (29:52.489)\r\nWhat's your favorite thing? So what do you use it the most for?\r\n\r\n\r\nAndrew Pignanelli (29:56.802)\r\nI like the scheduling. have a draft and send emails and I have a draft and send calendar invites so that I don't have to think about it. Okay, so one of the coolest things that I use it for while fundraising, and I think this is the most useful thing that I've used it for ever, was when you're fundraising, you get introduced to like 40 different people and you have to meet them all as quickly as possible. And so you immediately turn these conversations into scheduling and...\r\n\r\n\r\nThe problem is someone has an assistant or someone needs to get another person on. And so you have all of these email chains where there's a date and time decided, but they're not in your calendar. And it is impossible to tell when you're free and when you're not. I told co-founder, read all of these and put them in my calendar as holds so I can reason about when I'm free. And it did that and it saved me a ton of time. I mean, I like would have had to have an actual assistant to be able to do something like that.\r\n\r\n\r\nNikolas Hulewsky (30:27.733)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (30:42.431)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (30:51.721)\r\nSo I have had this pendant, it's called the limitless AI, but there's others like plot and I can't remember. Anyways, where it records a lot of conversations, could there be a function within Co-Founder where I'm like, hey, go take all the conversations I had today and just update my calendars on things that I said I would do.\r\n\r\n\r\nAndrew Pignanelli (31:02.541)\r\nWe.\r\n\r\n\r\nAndrew Pignanelli (31:10.83)\r\nwe literally have a limitless integration. you could, yes, it's because an engineer on our team has, has limitless and he likes to use it. So he'll like plug stuff in. so you can be like, so, so an example, we actually have always on microphones in our office that plug into co-founder. It's a little crazy where it's, it's a little wild. Yeah. But then every day I just like, it assigns context and like tasks to people.\r\n\r\n\r\nNikolas Hulewsky (31:12.831)\r\nDo you really? talk dirty to me.\r\n\r\n\r\nNikolas Hulewsky (31:30.451)\r\nIt's creepy. I get it. Yeah. But I'm here for it.\r\n\r\n\r\nAndrew Pignanelli (31:39.732)\r\nor just tell someone if you're working on something like, here's something you were talking about with this guy, about this feature or something. And it's easy for us.\r\n\r\n\r\nNikolas Hulewsky (31:48.565)\r\nWait, what's the automation with Limitless? Because I've found Limitless doesn't have a great ecosystem. So the fact that you guys have an API integration with them, I'm like, Giddy is a school child right now.\r\n\r\n\r\nAndrew Pignanelli (31:57.502)\r\nlet me see, I'll pull it up here. It can list all the life logs and it can get all the life logs. So it's a read only thing. It can't like push to it. But if you have, like, think life logs are like how, yeah, it could pull all the things from it. It can search for specific ones. could do things like that. and so you can, if you pull, pull stuff from, from limitless, you can say, you know, every day pull all my stuff from limitless and then, and summarize it for me and, and, and give me a.\r\n\r\n\r\nNikolas Hulewsky (32:09.663)\r\nbut it can pull from it.\r\n\r\n\r\nAndrew Pignanelli (32:26.761)\r\ntranscript or something.\r\n\r\n\r\nNikolas Hulewsky (32:26.965)\r\nWell, because I I'd use limitless when I go to conferences and I'd meet people and I'd have it on and I'd be like, Brian, nice to meet you. And then at the end of the day, I'd be like, who did I meet with? And it would list them all. And what do they do? And so I'd have like this CRM, if you will, of people that I've met with companies that they're with and like things that we spoke about when I want to follow up with them, et cetera. But I had to do it all manually because I and there probably is better automations at this point. This was like six months ago. So someone's probably screaming at the screen right now. I'm like, you moron, you can totally do this.\r\n\r\n\r\nBut for me, it would just be nice to have something that at the end of the day goes and pulls all those logs and then creates here's to do's, here's a schedule, here's who you should follow up with updates a CRM. Like, like does it could it do those things? Could it? Could I tell it to do that? And at the end of the day, it's populating my CRM and email and setting calendars, etc. To really easy.\r\n\r\n\r\nAndrew Pignanelli (33:14.892)\r\nYep. It would be really easy. could, in fact, in fact, you could take, you could tell it, you could just tell it exactly what you told me. and, co-founder could make that happen. It's really, it's really quite cool, right? Like, like we, we like to say it's the simplest automation experience in the world. And it's just, it's just cause it's all natural language, right? And if you're describing, like if you can effectively describe what you want done, you can get it to happen. and so.\r\n\r\n\r\nNikolas Hulewsky (33:28.849)\r\nmy gosh.\r\n\r\n\r\nNikolas Hulewsky (33:43.093)\r\nWow.\r\n\r\n\r\nAndrew Pignanelli (33:43.342)\r\nWe're pushing it as far as we can. It's really interesting.\r\n\r\n\r\nNikolas Hulewsky (33:46.261)\r\nonly if you have the API integration, right? Like if I'm trying to get it to tie to something you don't have the API for, then we got to figure something else out.\r\n\r\n\r\nAndrew Pignanelli (33:49.294)\r\nYou\r\n\r\n\r\nAndrew Pignanelli (33:53.806)\r\nYeah. Yeah. And like we're, working towards how to make that scalable because there's a trade off between how, you know, how, how wide you go and how tall you go. Right. So we could have like a million integrations with like no depth and that's one way to do it. Uh, or we could have like 30 with a lot of depth and that's the other way to do it. And we're, picking the latter option because we want to build the system or our goal is to build a system of a company. Right.\r\n\r\n\r\nand not to build into every one system of a company. And I think there's a big difference there. we found that... Go ahead.\r\n\r\n\r\nNikolas Hulewsky (34:24.885)\r\nMm.\r\n\r\n\r\nHow worried are you about competition? Because like I was talking about Comet or Atlas, I created a workflow automation in Zapier last night using Atlas. And I was just like, hey, go to Zapier and create this for me. And it did. It wasn't like anything incredible, but it created the automation for me. Are you worried about competition? Or how do you view a changing landscape and trying to build a moat at the same time?\r\n\r\n\r\nlike that would scare me.\r\n\r\n\r\nAndrew Pignanelli (34:59.566)\r\nI'm not super worried. mean, yeah, it's it's a highly competitive space, but our goal is not to make a good AI assistant because then we be competing directly against Anthropic and ChatGVT, right? And they have way more money than we do. Our goal is to make autonomous companies. And that is really where we're going to unlock the value. And it's really, you know, our value is going to come from enabling somebody to start a business and run a business.\r\n\r\n\r\nNikolas Hulewsky (35:12.949)\r\nMm-hmm.\r\n\r\n\r\nAndrew Pignanelli (35:26.222)\r\nimmediately and in a way that is legitimate and not just slop, know, allowing them to do that. And co-founder is just our first step. And so, you know, with our vision, competition doesn't worry me very much.\r\n\r\n\r\nNikolas Hulewsky (35:41.759)\r\nKeep talking about that. is that? How do you enable these companies? Like how are you? What's the roadmap?\r\n\r\n\r\nAndrew Pignanelli (35:47.628)\r\nYeah, so, so co-founder is essentially our first step. and it's like this chief of staff assistant thing, right? But we're really focused on solving the coordination problem between departments. so when we talk about like how we're actually going to get to the one person billion dollar company, it has more to do with being able to coordinate things together as opposed to just making this assistant. and what that actually means is we want to plug into all these vertical agents that people are building.\r\n\r\n\r\nWe want to wrap it up and make it really easy for an entrepreneur to use. So for example, you've got coding agents, you've got product analytics agents, and you've got customer support agents. If you can coordinate those together, they're all operating autonomously. You can work towards a high level goal of like increase my customer retention, but each of them individually is not going to do that. And so we're working on coordinating them together for the product department and the sales department and the marketing department and the ops department.\r\n\r\n\r\nNikolas Hulewsky (36:20.169)\r\nHmm.\r\n\r\n\r\nAndrew Pignanelli (36:45.943)\r\nand building these agents that can work on goals that are much a higher level and then eventually enable these people to own these companies and run these companies.\r\n\r\n\r\nNikolas Hulewsky (36:56.629)\r\nSo the first vertical that you tackled was Chief of Staff Assistance.\r\n\r\n\r\nAndrew Pignanelli (37:01.826)\r\nBasically, yeah, because that's like, you have to start somewhere and that's one of the most solvable things right now. That's what we saw at least.\r\n\r\n\r\nNikolas Hulewsky (37:08.127)\r\nHmm. That's interesting. What do you think is next? Like what do you think is the next easiest, solvable, most solvable problem within an organization?\r\n\r\n\r\nAndrew Pignanelli (37:20.01)\r\nI think the product department, but I don't think entirely. think just enabling a higher level of above-value coding. Take for example, something like Lovable where you can make an app full stack. We want to take that and extend it to, okay, we have your app. Now you can extend it to more business. You can plug in analytics and you can have an agent operate on the analytics and you can plug in a customer support agent. And now you've got this\r\n\r\n\r\nproduct department as opposed to just a product. And so that's what we're going to be doing next.\r\n\r\n\r\nNikolas Hulewsky (37:53.503)\r\nHow do you think about educating the market? Because, for example, I worked in hospice. Do you know what hospice is? Hospice is end of life care. And many people think hospice is, now I'm dead. But the truth is many people live sometimes more than a year on hospice. Hospice is really just about managing symptoms. You have a terminal diagnosis and a prognosis of six months or less, and we help you die comfortably. I mean, that's kind of the easiest way to say it.\r\n\r\n\r\nBut there's a lot of education that goes into that because many people just think, I'm a hospice. I'm dying tomorrow. You're just going to give me morphine. So we have to go out, talk a lot. first time you probably had your product compared to hospice, but your product is similar in the sense that there's an education component on how do you use these things or what do you need to have in order to even unlock the potential there? How do you think about educating or creating a market that really isn't educated?\r\n\r\n\r\nAndrew Pignanelli (38:51.874)\r\nYeah, mean, new user experience is really important for this. I think pushing content out, getting people towards the product is one thing, but then you have to push content out within the product. So when someone opens it up and they see this empty box, it's like, what do I do? That's the biggest problem you have to solve when you're working on an app like this. And we're solving it by using this memory system that we've built up to see what you want to automate before you know it.\r\n\r\n\r\nAnd this is really, really key. And one of the things that we're putting a lot of work into right now is like, okay, I know that whenever you get an invoice from this email, you forward it to your accounts payable department, or I know every Monday you send an email to this person with this information or something like that. pulling those things in and like making these automations for people is really, really big. And so this is like a one way of educating is like how this is how you do it.\r\n\r\n\r\nBut then there's the content on like, okay, well, how do you build these automations into your life? And we're pushing that on like content of like, how do we use it? How do I use it? What is this person use it for?\r\n\r\n\r\nNikolas Hulewsky (39:58.867)\r\nYeah.\r\n\r\n\r\nThere's a couple different, like there's two problem sets. One problem set is just getting them to make the decision to use it, right? Like, okay, hook up Google and hook up Slack and hook up whatever, all these other tools. Great, now it's there. Then there's problem number two. Well, how do I use it? it's like the first time I hired a virtual assistant. Cool, I have a virtual assistant now. How do I use them? Like I have to educate them. I have to tell them exactly what I want. And sometimes I don't even know what I want, right?\r\n\r\n\r\nWhat does the onboarding look like for new customers? Are you going through that process and asking them a bunch of questions or are you just figuring it out as you go? Like how does it?\r\n\r\n\r\nAndrew Pignanelli (40:40.814)\r\nOur approach has to do with figuring it out from the data that they connect. So we require our users to connect their emails. And when you have their emails, you can see what integrations they use and their patterns in using these integrations. And so you can figure out how to help people based on that. And just internally, if you just give the agent access to that and you say, automate this stuff for this person.\r\n\r\n\r\nNikolas Hulewsky (40:49.141)\r\nOkay.\r\n\r\n\r\nAndrew Pignanelli (41:10.67)\r\nyou'd be surprised at how well it actually works. And so that's kind of our approach and pulling in things like style are also really important, like style for emails. Your chief of staff has to write the queue and talk like you. And if they're sending emails as you, it has to be like you. So there's another really big thing with co-founders is like this preferences memory as well.\r\n\r\n\r\nNikolas Hulewsky (41:34.069)\r\nDoes it prompt you? It's like, okay cool, I went and I studied you and I know everything about you. Does it then tell you, here are five things I can do for you? Or do you have to be pushing it to say, go write this email, do my scheduling. Like, there's gotta be like a push and pull I'm assuming. How does it work?\r\n\r\n\r\nAndrew Pignanelli (41:50.242)\r\nYou get, yeah, so you come on and we get your preferences for your email and your calendar by reading your email and reading your calendar. We figure out what you do based on all this info available on you online. And then we use all of those things once you're done onboarding to make four automations for you and say, hey, based on this, I made this for you. And yeah, and so you get the first couple.\r\n\r\n\r\nNikolas Hulewsky (42:01.941)\r\nMm-hmm.\r\n\r\n\r\nAndrew Pignanelli (42:18.838)\r\nAfter that, we've got templates that people can use, but we're trying to make it so that constantly you're getting this info of like, hey, I made your life a little better. Here's how you do that. Or like, I saw you're spending time on this. Here's how you do that. So that's pretty much.\r\n\r\n\r\nNikolas Hulewsky (42:29.941)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (42:35.189)\r\nAnd then are there lots of like proactive things like that where, hey, you haven't talked to me in a while, let me just send you this message saying, I'm noticing you're talking a lot more in Slack, would you like me to create daily stand downs for you?\r\n\r\n\r\nAndrew Pignanelli (42:48.216)\r\nWe're a bit early on proactivity. have like, we have a system that gives you these automations and it can run these every week. So it can give you new automations every week, but we want to make it much bigger than it is and much like, like really know you. So it's not all way there yet, but it's, it's coming very soon.\r\n\r\n\r\nNikolas Hulewsky (43:07.029)\r\nWhat are you personally the most excited about building for yourself? Like selfishly? Obviously you solve your scheduling problem, but as you look at this, maybe a year out, two years out, three years out, what do you think are going to be some of the coolest features that AI, maybe it's not even within a co-founder, but what do you think are the coolest features that are coming down the pike with AI?\r\n\r\n\r\nAndrew Pignanelli (43:32.714)\r\nI think the coolest feature that we haven't built this yet and no one's really built this yet is the ability to like have this sort of dashboard where you spin up a bunch of agents and you control like an army of agents basically. So, you know, one of our goals is to make it feel like you're playing a video game, but it's a real business in the real world. And I don't know all the details to what that will look like, but I do know we're going to build it. And so that's the thing I'm most excited about.\r\n\r\n\r\nNikolas Hulewsky (43:59.797)\r\nIt's amazing.\r\n\r\n\r\nAndrew Pignanelli (44:02.446)\r\nI know it's a little abstract, but it's like, okay, well, what if we could make it like playing a video game?\r\n\r\n\r\nNikolas Hulewsky (44:09.385)\r\nDoes any of stuff freak you out? does this at all make you nervous about where AI is heading?\r\n\r\n\r\nAndrew Pignanelli (44:15.822)\r\nI think there are serious concerns about what people are going to do for work in like five years. I believe that one of the best avenues will be starting a company and like having equity in that company. But aside from that, like I can see this thing doing the jobs of multiple people. Like these white collar jobs, these knowledge work jobs are not long for this world. So that makes me nervous.\r\n\r\n\r\nNikolas Hulewsky (44:43.657)\r\nHmm. Interesting.\r\n\r\n\r\nAndrew Pignanelli (44:46.95)\r\nAnd I don't think any of the experts have given convincing answers as to how we're going to go from where we are now to like this post economic, you know, AGI society. They say, well, yeah, I mean, you know, we're to lose a bunch of jobs and then AI is going to automate everything is going to be great. Well, it's like, well, okay, what happens when everybody loses their jobs though? Like there's, there's, there's a gap. And if you look at the, these clips of these people, these CEOs of these big AI companies,\r\n\r\n\r\nthey don't give the best answers and they don't give concrete answers either. They basically say, I don't know. And so that also concerns me a little bit.\r\n\r\n\r\nNikolas Hulewsky (45:24.595)\r\nYeah, I'd be worried if our ability to scale energy production and capacity was clear, but we don't even have enough energy to be able to power all the things that we'd want to do with AI. I think that will be a bottleneck anyways, which will give us time. If the power was all there right now, I probably would be a little more worried because it feels like that's the limiting factor at this point. But I don't know. We're all just making it up.\r\n\r\n\r\nAndrew Pignanelli (45:53.974)\r\nYeah, think like, I mean, it doesn't really keep me up at night, but it is something that I think about and it is something that I think the world's gonna have to reckon with at some point.\r\n\r\n\r\nNikolas Hulewsky (45:59.785)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (46:03.253)\r\nWell, where's the where's the best place for people to come find you or if people want to play around with not play around, but people want to look at co founder? it is it live? Is it beta is invite only like how would you even mess around?\r\n\r\n\r\nAndrew Pignanelli (46:14.117)\r\nIt's live on co-founder.co, so you can go check it out there. You can connect with me on Twitter. Just my name, Andrew Pignanelli. And you can also follow the company on Twitter. But yeah, I mean, we're hiring. We're hiring great engineers in New York. You can go and test out co-founder for yourself. We're gonna have stock two in like a week. So if people are concerned about data, then we got all of that. But yeah.\r\n\r\n\r\nNikolas Hulewsky (46:38.946)\r\nBy the time this comes out, they'll have sock too. Don't even worry about it. We're good to go.\r\n\r\n\r\nAndrew Pignanelli (46:42.382)\r\nYeah, so that's it. That's how you find me.\r\n\r\n\r\nNikolas Hulewsky (46:46.527)\r\nCool. Awesome, man. Well, this was fantastic and we'll talk soon.\r\n\r\n\r\nAndrew Pignanelli (46:51.022)\r\nThanks so much, Nick.",
  "metadata": {
    "duration": "",
    "date": "",
    "platform_source": "Google Drive"
  }
}