{
  "episode_number": "121",
  "episode_title": "Is Dan Pe√±a a Genius or a Fraud? What \"The Trillion Dollar Man\" Really Teaches with Chris Koerner",
  "guest_name": "Chris Koerner",
  "business_name": "",
  "transcript": "﻿Chris Koerner (02:04.458)\r\nAlright, you ready for this?\r\n\r\n\r\nChris Koerner (02:09.672)\r\nOkay, so for those that listened last week, we talked about a guy named Frank Kern. That was a somewhat controversial internet marketer, the guy who taught Cardone and Tony Robbins how to be Cardone, Grant Cardone and Tony Robbins. Okay, I got another guy for you today, Nick, and you know who he is and you love this guy. You ready?\r\n\r\n\r\nNikolas Hulewsky (02:27.564)\r\nOkay, yes, yes, yes, yes, yes, yes, love gurus, dude.\r\n\r\n\r\nChris Koerner (02:30.762)\r\nYou're a goo-goo guy, okay? You ready? Dan Pena. Tell me.\r\n\r\n\r\nTell me what you know about this guy.\r\n\r\n\r\nNikolas Hulewsky (02:42.642)\r\nmy gosh. Okay. It's been a while since I've done research on Dan Pena. But if you've ever seen any of these Instagram videos of the guys who are like pumping up the sales guys, you know, there's like a trend right now where they want the hardcore guys. Andy Elliott's like this. gonna have a six pack to work for me, bro. Right? Dan Pena. Dan Pena is he's 70 years old. Hard a\r\n\r\n\r\nChris Koerner (02:44.379)\r\nI went deep.\r\n\r\n\r\nOkay.\r\n\r\n\r\nChris Koerner (02:56.938)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (03:01.446)\r\nAndy Elliott. Yep. Yep. Take your shirt off.\r\n\r\n\r\nNikolas Hulewsky (03:12.064)\r\nlives in Florida and is just always spitting the most dramatic comments that he can possibly. Is he? I do believe that. but it's very much like, just fricking do it. What does it matter? You're lying. He wants, there's a quote of him on video. He's like, listen, this whole Bitcoin thing, I know who Satoshi is. I can't tell you, but when it comes out,\r\n\r\n\r\nChris Koerner (03:17.748)\r\nHe's actually 80 years old, believe it or not. Born in 45.\r\n\r\n\r\nNikolas Hulewsky (03:41.122)\r\nThere's going to be a lot of instability. know. I know personally who he is. like, my gosh, these guys. Anyways, that's Dan Pena.\r\n\r\n\r\nChris Koerner (03:47.934)\r\nI'm glad you said that because I'm gonna switch up the order of what I was gonna talk about. And I'm gonna talk about Dan Pena's predictions of the future hosted on his own website, danpena.co.uk. You ready for this? Still, someone needs to update the website. If you're listening to me, please go update the website. Okay. Dan told us that Trump would win in a landslide victory this year. Okay. Okay. Okay. Dan also told us...\r\n\r\n\r\nNikolas Hulewsky (03:58.894)\r\nStill? Okay.\r\n\r\n\r\nNikolas Hulewsky (04:11.918)\r\nOkay, winning. Okay.\r\n\r\n\r\nChris Koerner (04:18.282)\r\nSo no one listened. That's what it says. Dan told you so, no one listened. There's a YouTube video to click on and the YouTube video has been removed. Okay. Not sure what that one was. Yep. Dan predicted that Rick Scott would be our next US president. So still holding out for that one. No, this was years ago. Still holding out. It could still happen.\r\n\r\n\r\nNikolas Hulewsky (04:27.598)\r\nSure. Bad link. Happens.\r\n\r\n\r\nNikolas Hulewsky (04:37.07)\r\nafter Trump?\r\n\r\n\r\nNikolas Hulewsky (04:43.438)\r\nYou know, hey, we miss him. Hey, he's one for two. He's batting 500. That's a great batting average.\r\n\r\n\r\nChris Koerner (04:46.772)\r\nThat's okay. That's okay. Dan predicted that cybersecurity would be a hot deal. That's, that's bold. That's a hot deal. What you don't know what a hot deal is? Yeah, yep.\r\n\r\n\r\nNikolas Hulewsky (04:58.294)\r\nIt's going to be a hot deal. That's the best prediction you could make because it's so broad. All right, keep going.\r\n\r\n\r\nChris Koerner (05:03.294)\r\nYep. So hey, he's two for three though. I mean, it's a hot deal.\r\n\r\n\r\nNikolas Hulewsky (05:08.59)\r\nTwo for three. He's gotten 666.\r\n\r\n\r\nChris Koerner (05:12.604)\r\nHe predicted that Iran and Syria would be flattened by the US.\r\n\r\n\r\nNikolas Hulewsky (05:21.134)\r\nOkay, I mean, Syria's flattened, wasn't flattened by the US, but okay. All right, he missed that one. Hey, it's geopolitical. It's not the United States. He can't be an expert in everything.\r\n\r\n\r\nChris Koerner (05:22.079)\r\nMm-hmm.\r\n\r\n\r\nHuh. It's not there anymore. You know what?\r\n\r\n\r\nAnd he predicted that the greatest Mexican drug cartel boss of all time, El Chapo Guzman, would pay for the border wall.\r\n\r\n\r\nNikolas Hulewsky (05:42.382)\r\nin his defense, he did he cut a check? I'm pretty sure he might have been all cash. I can't remember exactly how he paid for it. Yeah.\r\n\r\n\r\nChris Koerner (05:43.528)\r\nAnd he obviously did, right?\r\n\r\n\r\nChris Koerner (05:50.37)\r\nsure. Huh. So that's Dan's predictions, but we're getting ahead of ourselves. So I'm going to give you a little background on Dan. Okay. You ready? Born in Jacksonville, Florida, 1945. He threatened to kill his teacher by dropping a glass aquarium on them. And he talks about this in all his mastermind seminars. You know why? Do know why? Because he was abused by him. But wait, there's more. Not physically abused, but he put a dunce out.\r\n\r\n\r\nNikolas Hulewsky (06:11.938)\r\nI don't know.\r\n\r\n\r\nChris Koerner (06:19.986)\r\non him and made him sit in the corner.\r\n\r\n\r\nNikolas Hulewsky (06:22.562)\r\nMakes sense. Punishment fits the crime.\r\n\r\n\r\nChris Koerner (06:23.338)\r\nMm hmm. So he threatened to kill him. He literally went on a balcony over his head and tried to drop an aquarium on his head. And now he brags about it. Uh huh. Uh huh. Stable genius.\r\n\r\n\r\nNikolas Hulewsky (06:32.269)\r\nHe's stable.\r\n\r\n\r\nIf he's not even telling that story as like that I'm reformed.\r\n\r\n\r\nChris Koerner (06:37.418)\r\nNo, he brags about it.\r\n\r\n\r\nNikolas Hulewsky (06:41.352)\r\nIt's literally a negotiating tactic, right? Because then anybody who negotiates with them, they're I'm going to drop an aquarium on my head.\r\n\r\n\r\nChris Koerner (06:48.136)\r\nYep. So as I tell you these stories, I want you to start thinking of some frameworks of Dan Pena that we can apply for the betterment of ourselves in society. Okay.\r\n\r\n\r\nNikolas Hulewsky (06:55.79)\r\nOkay, again, you and I never talk about this stuff. I have a story for you after this that we did not plan for.\r\n\r\n\r\nChris Koerner (07:01.742)\r\nokay. And I've got a boat. Wait, there's more. So how's that for a re hook? Okay. So he founded a company called Great Western Resources, which was an oil exploration company in 1982. Okay. Supposedly, now, there are very few details or quote, proof that he actually did these things. But we do know that this was a real company as far as what his ownership was in it, or if he founded it or not. No one really knows.\r\n\r\n\r\nNikolas Hulewsky (07:06.434)\r\nOkay.\r\n\r\n\r\nChris Koerner (07:31.387)\r\nIt sold for $450 million 10 years later.\r\n\r\n\r\nNikolas Hulewsky (07:36.91)\r\nWow. 1986, $450 million. That's a lot of money in 1986.\r\n\r\n\r\nChris Koerner (07:42.73)\r\n92. He's founded in 82, sold it in 92. But he was also ousted from that company. Details are blurry. Maybe 91 maybe 93. We don't know. But it was listed this company was listed on the London Stock Exchange. That is prurable. We just don't know what his ownership was in it other than what he's told us. Okay. My favorite quote of his. This was given at a seminar.\r\n\r\n\r\nNikolas Hulewsky (07:48.933)\r\nokay.\r\n\r\n\r\nChris Koerner (08:10.29)\r\none of his many mastermind seminars that cost $30,000 to attend. My favorite quote is, if I leave here with anyone liking me, I have failed.\r\n\r\n\r\nChris Koerner (08:22.26)\r\nCan you dive in on that for me?\r\n\r\n\r\nNikolas Hulewsky (08:25.102)\r\nGosh. It's reverse psychology sales tactic, right? You're anchoring people in the very beginning and you're getting them to buy into the Kool-Aid. Like, yeah, this is to be freaking hardcore. I'm going to hate him by the end of this. It's very good framing for the kind of seminar that he's going to put on, right? He's establishing himself as the authority. I'm the authority. You're going to hate me so much by the end of this because I'm going to freaking whip you into shape, right? The people who are on the receiving end are like,\r\n\r\n\r\nthis is going to be so good for me. my gosh, this is fantastic. They're just in this reciprocal feedback loop that he's setting up. So anyways, nutcase, keep going. $30,000.\r\n\r\n\r\nChris Koerner (09:04.138)\r\nYeah. So he's known $30,000. He's known for buying a castle in Scotland, uh, age 39 for $650,000. Do know what that is worth today? Or not what the castle is worth, but after inflation.\r\n\r\n\r\nNikolas Hulewsky (09:21.486)\r\n650, I'm gonna guess 1.5.\r\n\r\n\r\nChris Koerner (09:25.738)\r\nextremely close 1.4 and change. Okay. So supposedly that castles were 32 million today, but I just think it's funny because he, this is like his claim to fame is that he bought a castle and that's like, that's like buying like a three bedroom house in Palo Alto today. Like at that price, right?\r\n\r\n\r\nNikolas Hulewsky (09:45.07)\r\nThat's bloody great! That's a great deal of the castle!\r\n\r\n\r\nChris Koerner (09:49.034)\r\nHe renovated the castle and that's where he holds his masterminds which he has been holding for 30 years now. So after he makes a half a billion dollars, he makes it is that is after he makes half a billion dollars with a B supposedly according to him, his next big great venture is hosting masterminds to insecure dudes that want to be less insecure for $30,000. He's made $36 million selling these masterminds.\r\n\r\n\r\nNikolas Hulewsky (09:55.534)\r\nThat's pretty genius.\r\n\r\n\r\nNikolas Hulewsky (10:14.74)\r\nWhat? do you know it's there?\r\n\r\n\r\nChris Koerner (10:15.498)\r\nThat is quite provable because he has two or three a year, he has 20 to 25 people per and they're $30,000 each. So assuming they're all sold out and he's had that many per year for 30 years, $36 million.\r\n\r\n\r\nBut don't you want to know what framework he teaches at this mastermind Nick? Cause I'm in the business of saving all of our listeners $30,000. So you're about to get $30,000 worth of value from the trillion dollar man himself. And I'll get into that nickname in a minute. And it's the QLA principle and it's these are actually Nick and also these are mind blowing principles that you've never heard or thought of before. So are you ready for these? Are you sitting Nick? Are you sitting down? Okay.\r\n\r\n\r\nNikolas Hulewsky (10:33.634)\r\nI would love to, yes. What does he teach these people?\r\n\r\n\r\nNikolas Hulewsky (10:55.916)\r\nYes. Chris, I've been sitting on the edge of my seat. my gosh. This is ridiculous. Yeah.\r\n\r\n\r\nChris Koerner (10:59.902)\r\nOkay, number one, number one, you ready? Reshape your mindset. Okay. Your success, your success starts between your ears. Okay. I'm gonna, I'm gonna like sit for, for 10 minutes and let you think about that before I go to number two. Don't say a word. Very good. Wow. You got that quick. Number two, set big audacious goals. Wow. Have you ever thought of that?\r\n\r\n\r\nNikolas Hulewsky (11:05.582)\r\nOkay, okay, it's a good place to start.\r\n\r\n\r\nNikolas Hulewsky (11:12.27)\r\nbecause your brain's between your ears.\r\n\r\n\r\nNikolas Hulewsky (11:16.942)\r\nbecause your brain's between your ears.\r\n\r\n\r\nChris Koerner (11:28.958)\r\nLike I usually think to set really small goals, you know.\r\n\r\n\r\nNikolas Hulewsky (11:32.877)\r\nhis defense, that's actually a pretty good thing to teach. Keep going.\r\n\r\n\r\nChris Koerner (11:37.3)\r\nGood. Number three, build a dream team, hire smart people. I don't think I've ever heard anyone say that before. Okay. Number four, identify and acquire businesses. We're just like getting straight there. We go, we go like be smart, make good decisions, go acquire businesses. Wait, wait, what? How'd you get there? I think you skipped a few things.\r\n\r\n\r\nNikolas Hulewsky (11:41.39)\r\nMm.\r\n\r\n\r\nNikolas Hulewsky (11:58.754)\r\nNo, no, it's like, it's like, I have no money, but I financed everything to come to this mastermind. $30,000. What's what's step one? Step one, got to get that grind set. Rated it to do, can do. I got that, got that grind set. Step two, set big goals. Easy, I'm to be a billionaire. Okay, okay. All right, what's next? What do I need to do next? Step three, assemble a team. Okay, when you say team, like,\r\n\r\n\r\nChris Koerner (12:02.858)\r\nI'm going to get to the no money thing. Don't worry.\r\n\r\n\r\nNikolas Hulewsky (12:28.334)\r\nAm I hiring these people? how am I bringing them? How am I bringing them together? And who do I need from, how does it work exactly? Step four, wait, wait, I'm still, I'm still on step three. Step four, identify and buy businesses. Okay, I can't even pull forward to pay for the team. How am I identifying and buying these businesses? Exactly. Step five, cash out, refi, start a course, sell it to millions of people.\r\n\r\n\r\nChris Koerner (12:30.206)\r\nLike the Avengers.\r\n\r\n\r\nChris Koerner (12:36.798)\r\nYou sound weak.\r\n\r\n\r\nChris Koerner (12:57.354)\r\nBut wait, Nick, sorry, he does get more specific. He especially encourages first time entrepreneurs to acquire businesses. And they should be distressed ideally and underperforming.\r\n\r\n\r\nNikolas Hulewsky (13:06.798)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (13:12.054)\r\nNo way. is really this is his framework. Okay. Okay.\r\n\r\n\r\nChris Koerner (13:13.01)\r\nI swear, I swear. Yes. Okay. Number five, you're going to finance this business with no money down. How? Seller financing, obviously. And government grants, clearly. Number six, number six, you're going to grow the business. You're just going to grow it. You're going to say grow and it's just going to do it. Okay. Number seven, you're going to create a money machine. You just, you just have to, you have to\r\n\r\n\r\nNikolas Hulewsky (13:35.534)\r\nThat's how it works.\r\n\r\n\r\nChris Koerner (13:41.61)\r\nYou have to create the money machine. I don't know why that wasn't step one. Honestly, if that was step one, it could have saved us all a lot of time. Okay.\r\n\r\n\r\nNikolas Hulewsky (13:43.234)\r\nIs it like a 3D printer?\r\n\r\n\r\nNikolas Hulewsky (13:47.854)\r\nIs that a 3D printer? that like what the money machine is?\r\n\r\n\r\nChris Koerner (13:50.154)\r\nYep. Step eight of eight, repeat and scale. That's it. $30,000 in three minutes.\r\n\r\n\r\nNikolas Hulewsky (13:55.528)\r\nwhat would he do? What would he do if you're coming to me? Like, I want to join your course, but I can't afford it. And he's like, it's $30,000. You got to figure out how to freaking make this money. Okay, okay, okay. What if I sell or finance it, Dan?\r\n\r\n\r\nChris Koerner (14:11.498)\r\nThere you go. Will you hold the note?\r\n\r\n\r\nNikolas Hulewsky (14:14.86)\r\nWhat? what step for? We hold the note. Are you going to sell or finance it or what? No, no, no, that's not what this means. That's not what this means. But you're saying it's a $30,000 investment in my future, right? Like it's going to set me up for success. Absolutely perfect. Seller finance it down.\r\n\r\n\r\nChris Koerner (14:27.56)\r\nYeah. So do you know why he refers to himself as the trillion dollar man?\r\n\r\n\r\nNikolas Hulewsky (14:32.47)\r\nI don't know.\r\n\r\n\r\nChris Koerner (14:34.088)\r\nbecause people that have been through his course have created a trillion dollars worth of value before or after they went through the course.\r\n\r\n\r\nNikolas Hulewsky (14:42.296)\r\nBefore or after.\r\n\r\n\r\nChris Koerner (14:45.808)\r\nEither one, either one. Either one. Imagine how much value JK Rowling created by selling hundreds of millions of copies of Harry Potter. Think about it. Think about all the money that those readers made. No, I'm just saying like that framework of like, if you made money, if you shook my hand once, and then you made a million dollars, I created a million dollars worth\r\n\r\n\r\nNikolas Hulewsky (14:58.584)\r\nWait, did JK Rowling go through it? is there any, are there any testimonials?\r\n\r\n\r\nNikolas Hulewsky (15:09.548)\r\nIs there anybody out there who's like admitted to going through Dan Pena's mastermind?\r\n\r\n\r\nChris Koerner (15:13.79)\r\nYep, there are several YouTube videos of guys that went through it and make fun of the entire thing. It's quite hilarious. Yeah. In fact, one guy started confulsing and urinated on himself and threw up on himself during the seminar and Dan Pena made fun of him the whole time as it was happening from the stage. So, yep.\r\n\r\n\r\nNikolas Hulewsky (15:18.867)\r\nReally? I want to.\r\n\r\n\r\nNikolas Hulewsky (15:31.918)\r\nThat's pretty funny. I mean, in Dan's defense, what's he supposed to do? Call a medic?\r\n\r\n\r\nChris Koerner (15:37.704)\r\nknow. So what what good can we take from these principles in all seriousness? What is there to learn from? Like why is he successful Nick?\r\n\r\n\r\nNikolas Hulewsky (15:46.274)\r\nWell, before we get into that, I have a story for you. So I sold a business a few years ago and the people that were really interested in this business were private equity people. I got a lot of inquiries, a lot of people reaching out, right? It was a good business. We had grown it. It was profitable. It was great. We were exiting. One of the groups that reached out was Dan Pena's group. so they sit before, yeah, before the call, I get, it wasn't even a SIM, right? Cause like the SIM is what,\r\n\r\n\r\nChris Koerner (16:08.266)\r\nI think I remember this.\r\n\r\n\r\nNikolas Hulewsky (16:16.078)\r\nthe seller would send them. Oh, I'm sorry. So a SIM, CIM, confidential information memorandum, usually it's what sellers provide to prospective buyers to tell them about their business. They tell them the business has been around here, the key customers, this is how much money we make. These are the contracts, like just everything about your business that a buyer would want to know initially. And then you hop on a call and you kind of dive into more. Well, they sent me like a SIM for their investment team.\r\n\r\n\r\nChris Koerner (16:16.296)\r\nExplain what a sim is?\r\n\r\n\r\nChris Koerner (16:44.158)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (16:45.122)\r\nfront and center on their investment team was Dan Pena, right? So this was like Dan Pena's fund. And I looking back, I'm like, I don't know if they were just, if he was just being used as like, hey, this media personality. Well, I think he had something to do with it, but I don't know if it was his money or if it was like, I'll lend you my likeness and you can leverage that, right? Anyways. So I get that and I'm like, I was going to not take the meeting anyways, but I'm like, Dan Pena is involved. I I gotta take that meeting, bro.\r\n\r\n\r\nChris Koerner (16:54.931)\r\nMm. He might not have had anything to do with it.\r\n\r\n\r\nChris Koerner (17:02.653)\r\nRight.\r\n\r\n\r\nChris Koerner (17:14.366)\r\nAnd this is after you had been down like the Instagram reels, Dan Payne your rabbit hole, and we'd been sending them back and forth.\r\n\r\n\r\nNikolas Hulewsky (17:14.926)\r\nI knew that. Yeah, I was calling you. I called you about this because I was so excited. I'm like, so I take the meeting with their team. Dan Dan wasn't on probably better if I was like Dan Pena was on but he wasn't on. I want you to guess how the negotiations went.\r\n\r\n\r\nChris Koerner (17:35.656)\r\nIt was a joke. I don't know.\r\n\r\n\r\nNikolas Hulewsky (17:36.664)\r\nThey went exactly like you would think a Dan Pena negotiation would go. Hey, tell us about your business. Well, we're doing about $6 million in top line, 1.5 million in bottom line, market comps are three to five times. So we're looking between five and $8 million of a purchase price. You're not going to get that. Like initially, out of the gate, you're not going to get that. Like what? Yeah, you're not going to get, market's not going to pay that. Here's what we're willing to offer.\r\n\r\n\r\na million dollars financed over X period of time and seriously, and you stay on, but you can earn an additional $5 million if you grow this business to a hundred million dollar business. So with Dan's brand and with our backing, and I was like, is this for real? Is this like, just like that? said it on the call. I'm this is for real? They're like, are you kidding me? Have you seen what Dan's done? Like, and that's how this conversation, it was the weirdest.\r\n\r\n\r\nconversation. thought they could just come in, bull in a china shop. And I'm sure that they do buy businesses like that. I'm sure there are some idiots out there who were like, yeah, I guess I'll sell. I was like, yeah, it went exactly like I would have thought a Dan Payne Hill led negotiation strategy would have gone. It was so dumb.\r\n\r\n\r\nChris Koerner (18:40.234)\r\nYeah.\r\n\r\n\r\nChris Koerner (18:51.666)\r\nand tell us what that ended up selling for.\r\n\r\n\r\nNikolas Hulewsky (18:54.456)\r\nWell, I can't tell you the exact number, but it sold for the range that I I named in the in the beginning five to eight. No, it sold really. It was a great business. It sold really quick. So some of these some of these guys is like it's just a spray and pray kind of tactic. But what can we? Now you go. What can we take from Dan Pena? I mean, I think there's a couple of things. I think the reason I'm so obsessed with gurus is because I'm infatuated by this.\r\n\r\n\r\nChris Koerner (19:00.168)\r\nand it didn't take all that long.\r\n\r\n\r\nChris Koerner (19:05.247)\r\nYeah.\r\n\r\n\r\nChris Koerner (19:13.034)\r\nNo go.\r\n\r\n\r\nNikolas Hulewsky (19:23.636)\r\nlevel of confidence that is irrational because I don't have it. I just don't have it. You have a lot more confidence in me, but you are nowhere near that level, right? It's these guys who have this God-level complex and they are so confident that reasonable people like us look at them and say, what he's saying sounds unbelievable, but he's so confident. He surely can't be lying about it, right?\r\n\r\n\r\nChris Koerner (19:26.27)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nChris Koerner (19:38.708)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (19:48.606)\r\nMm-hmm.\r\n\r\n\r\nIt's not a lie if you believe it. That's what George Costanza said.\r\n\r\n\r\nNikolas Hulewsky (19:53.194)\r\nAnd in many instances, in many instances though, that fundamental belief in drive has created value for them. Like a perfect example of this, Jesse Tinsley, he texted me like two weeks ago, I'm gonna buy TikTok. Ho ho ho ho. And I'm like, you just bought bench. TikTok is like a $20 billion company. And then there was like, he just wills it into existence. Somehow he gets a meeting with Mr. Beast. He's convinced Mr. Beast to help him buy TikTok.\r\n\r\n\r\nHe's literally in talks. I mean, I haven't seen the talks, but supposedly he's in talks with the US government about buying TikTok because he just spoke it into existence. So I am infatuated by these people who have an unshakable belief in themselves. Many of these gurus use it for evil, right? Cause they're just like trying to extract as much value out of people, but it's also a very strong trait in some of the best founders and entrepreneurs, Steve Jobs, Mark Zuckerberg, Elon Musk, like these guys that have just gone on to do great things. This like self belief that is unshakable.\r\n\r\n\r\nChris Koerner (20:28.948)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (20:34.548)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (20:51.454)\r\nAnd you know what, like you only have to be right once. Like you could make these bold audacious claims and be wrong every time. And then once you're right, that really carries more weight than any of the wrong predictions that you had in yourself or what you were building. Like Elon Musk.\r\n\r\n\r\nNikolas Hulewsky (21:03.075)\r\nTotally.\r\n\r\n\r\nNikolas Hulewsky (21:06.732)\r\nWell, and he went and he just said, all right, I sold this company. I'm going to buy a castle in Scotland. Like there's tangible proof that he can point to to say like, yeah, I'm successful. I got a got a castle. So anyways, I think the unshakable belief is something I admire and I'm both terrified of at the same time. And some of these people.\r\n\r\n\r\nChris Koerner (21:17.886)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (21:26.41)\r\nIt's true. It's like the, fire fest guy.\r\n\r\n\r\nNikolas Hulewsky (21:30.606)\r\nYeah, dude, that's a perfect example. Because so many of us fake it till we make it. We're like, nah, I'm going to do it. I'm going to, yeah, this is going to happen. Adam Newman, made out like a bandit.\r\n\r\n\r\nChris Koerner (21:35.41)\r\nYeah, Adam Newman of we work like he until the day he dies, he could raise as much money as he'd ever want despite his history, because of that unshakable confidence.\r\n\r\n\r\nNikolas Hulewsky (21:48.14)\r\nElon Musk, you've read his biography. How many times did he promise a rocket was going to take off or that we can have full self-driving or we're going to have robots on, like whatever it is, he's promised all of these things. And while he may not have hit every single timeline, look at what he's accomplished. Like he's still able to point to some of these things. So again, it's a trait that I both fear and in admiration of.\r\n\r\n\r\nChris Koerner (22:08.202)\r\nYou know the big differences because like Alex Bromo's he makes a lot if not most of his money from conferences. A lot of people don't know that. Okay. The dip. So like they're both making millions of dollars doing the same thing. But what makes one of them\r\n\r\n\r\nI don't want to come a fraud because I don't want to get sued, but he has a poor reputation. And the other one, Alex Hormozi arguably has a great reputation despite the fact that he's making millions of dollars selling courses and masterminds and high ticket X, Y, or Z. In my opinion, it's because one of them is very specific. Alex Hormozi, he's written books. His books are extremely tactical. You're going to go to meta ads manager. You're going to click on this. You're going to use advantage. Plus you're going to use broad targeting.\r\n\r\n\r\nNikolas Hulewsky (22:29.912)\r\nGuru.\r\n\r\n\r\nChris Koerner (22:54.846)\r\nDon't tell Metta what your audience is. And like, it's very specific, granular, because he's sat down at a desk for 18 hours straight and done all these things, right? Whereas the other guy is just talking like platitudes that are super broad and high level.\r\n\r\n\r\nNikolas Hulewsky (23:10.222)\r\nYeah, it's the difference between the steak and the sizzle, right? or the, you know, the bark and the bite. They both are salesmen. They both talk a big game. They both are like, I can change your life. But I think one of them delivers more tangibly for the target audience that they have. A lot of those sales gurus strike me as very motivational. Hey, this is the kick in the pants that you need. Hey, just do it. Just fricking grow up and do it. You're giving me a little baby. And that's needed for many people. But\r\n\r\n\r\nChris Koerner (23:13.584)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nChris Koerner (23:32.199)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (23:39.992)\r\nBromozi is very tactical. like, yes, you're gonna get the motivational thing, but if you go and you pay for his course or you go and you buy his book, it's also like, that's a really good strategy. holy crap. Like that you can scale a business this way. So like, I agree with you. It's in the product offering itself. And I think that that goes for any entrepreneur. You've got to be good at sales, but you've got to make sure that what you're selling is actually backed up.\r\n\r\n\r\nChris Koerner (23:51.485)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (24:02.281)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (24:07.362)\r\nby a good product. Otherwise, you're going to get the first couple sales and then you're constantly going to need to be churning through people. There's a reason that Dan Pena puts out content that is divisive or controversial. It's because he needs his name out there enough in order for people to keep coming to his courses. Whereas Alex isn't necessarily putting out the controversial stuff. The word of mouth from people who've gone to his conferences or the word of mouth from people who are sharing his posts because of the goodwill.\r\n\r\n\r\nChris Koerner (24:22.09)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (24:34.164)\r\nreally doing the legwork for him. that's the type of business that you want as an entrepreneur. You want the goodwill to be doing the legwork. don't want to just be, Nick Huber is an example of like, worry about following down sort of this pain path, right? It's like, well, I got views, I got clicks, but is that the best way? It is for him right now.\r\n\r\n\r\nChris Koerner (24:49.896)\r\nYeah. Yeah. You ready for the grand finale of the segment for retire bow on it. So during this deep dive, I learned that Dan Pena will basically go on any podcast that asks him. And so I emailed his publicist and invited him on the hold co-brows podcast segment. And we, I, I don't have a yes yet, but I'm confident I can get a yes and we will have him on here and ask him all kinds of hairy questions.\r\n\r\n\r\nNikolas Hulewsky (24:54.284)\r\nAbsolutely. Yeah.\r\n\r\n\r\nNikolas Hulewsky (25:11.694)\r\nI was so excited!\r\n\r\n\r\nChris Koerner (25:19.762)\r\nAt least you will because you like the awkward stuff and I don't.\r\n\r\n\r\nNikolas Hulewsky (25:23.726)\r\nI'm not, look, if he's generous enough to come on and give us his time, I'm not gonna be rude to him.\r\n\r\n\r\nChris Koerner (25:28.498)\r\nNo, not rude. I'm just talking about like hard hitting questions.\r\n\r\n\r\nNikolas Hulewsky (25:31.756)\r\nYeah, no, yeah, yeah, yeah. will ask him things and he'll probably, I don't know. A lot of those guys, like Donald Trump's like this. He can take a good ribbing and he's very conversational, but if he feels like you're attacking him and adversarial, that's when he's gonna start just like hitting back on things, right? So I would be curious to see what Dan is like in a conversational setting.\r\n\r\n\r\nChris Koerner (25:46.239)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (25:49.834)\r\nYeah.\r\n\r\n\r\nChris Koerner (25:54.218)\r\nWell, I think one of the questions needs to be, listen, and you can use the Trump tactic. A lot of people are saying, and they are on the internet. A lot of people are saying that you don't have $500 million that you never sold this, but that you didn't have much ownership in this business at all. In fact, where you made most of your money is the $3.3 million lawsuit settlement you got for wrongful termination. A lot of people say that. Do you have any hard proof, a document, any sort of evidence? Cause this was pre-internet that you actually made all this money.\r\n\r\n\r\nto prove the haters wrong. And he's probably gonna say, don't care about the haters. He's probably gonna like talk around it. I'd be very curious to hear his answer to that. The second question is, if you're so successful in business, why do you make all of your money selling courses? Why aren't you starting other businesses? See what he says there.\r\n\r\n\r\nNikolas Hulewsky (26:40.728)\r\nSee, I probably wouldn't ask them those direct questions.\r\n\r\n\r\nChris Koerner (26:44.906)\r\nI guess I'll have to do it.\r\n\r\n\r\nNikolas Hulewsky (26:46.382)\r\nwould you even do it I would ask him things like\r\n\r\n\r\nbecause it's so foreign to me. How do you reconcile like not having the things that you say you're having while you're doing it, even though you've eventually achieved it, right? It's like, it's the fake it till you make it on steroids where you're projecting this ultra successful persona. But if somebody came in and actually audited you, they would look at it, sit down look at it be like, it's actually not true. However, you needed that level of confidence. Like how did you?\r\n\r\n\r\nI don't know. think he, I know, I'm not sure he's been divorced. I think he might be, have been married for, right, right, right. So I like, would ask him, I'd be like, did your wife look at you and like, damn, that's not true. Or like, how does that conversation go? Like that's, I would be very curious about that particular piece of it because I can never do that. I would never be able to live with myself, but I'm sure he's got his like, his way of convincing himself that it's fine. So anyways, we'll see.\r\n\r\n\r\nChris Koerner (27:22.322)\r\nI think he's been married the whole time to the same woman. He has three kids.\r\n\r\n\r\nChris Koerner (27:31.956)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (27:45.502)\r\nYeah. And we're gonna have to pay a lot of money to Muhammad to edit that episode because he can be, he can be a little brash.\r\n\r\n\r\nNikolas Hulewsky (27:50.176)\r\nChris Koerner (27:57.764)\r\nwhat do you got?\r\n\r\n\r\nNikolas Hulewsky (28:00.536)\r\nthink we're at 45 minutes and I have a heart.\r\n\r\n\r\nChris Koerner (28:03.37)\r\nI've got an AI idea, but you have a hard stop.\r\n\r\n\r\nNikolas Hulewsky (28:06.498)\r\nI have a hard stop in 30 minutes.\r\n\r\n\r\nChris Koerner (28:09.034)\r\nOkay, yeah, so do I. We're at like 50 minutes, I think, if not more.\r\n\r\n\r\nNikolas Hulewsky (28:10.734)\r\nOkay, I have another podcast after this.\r\n\r\n\r\nNikolas Hulewsky (28:17.454)\r\nSo what do want to do? Call it.\r\n\r\n\r\nChris Koerner (28:19.082)\r\nDo you have an AI idea? Because, okay, we could do that and then call it, because I have one too.\r\n\r\n\r\nNikolas Hulewsky (28:29.774)\r\nAll right, take a swig of this BS.\r\n\r\n\r\nNikolas Hulewsky (28:37.582)\r\nAll right, AI idea of week. I was listening to your conversation with James Camp, where you guys are talking about AI. And I really enjoyed it. I thought it was like an awesome conversation. But one of the things that popped into my mind as I was listening to it was if AI is going to make it so much easier for us to do outbound, to like reach out to people and have agents that are having conversations, it's probably going to be a hellscape for you, the consumer in the future. You're just\r\n\r\n\r\nChris Koerner (28:58.26)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (29:04.542)\r\nMm-hmm. Mm-hmm.\r\n\r\n\r\nNikolas Hulewsky (29:06.062)\r\nconstantly going to be getting inbound, inbound, inbound, like people asking you for things. And so I started thinking about it, not from the business perspective of going outbound and generating, but from the consumer's perspective and being inbound and filtering. Do you think that there's a space for AI products to be built that assign value to information that's coming in or that interact with the inbound?\r\n\r\n\r\nsuch that you don't actually have to interact with them.\r\n\r\n\r\nChris Koerner (29:39.594)\r\nDid you hear, so my episode with James Camp was split into two episodes. Did you listen to both of them or just one? Did you hear the segment where we talked about AI calling, AI receiving? Is that what you're referring to?\r\n\r\n\r\nNikolas Hulewsky (29:51.502)\r\nMm hmm. Yeah. And then you talked about agents just having conversations with agents. This but this is what I'm getting at is like, I think that there's a lot of focus right now on business owners who's like, you can develop your own agent. This is how you train them. This is how you do it. So it's almost like the AI business is a services business to help business owners get up to speed on AI. Like I did this tweet. I asked who's making real money with AI right now. There were some decent answers like there was some fine answers, but.\r\n\r\n\r\nChris Koerner (29:54.909)\r\nYeah. Yeah.\r\n\r\n\r\nChris Koerner (30:11.239)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (30:17.824)\r\nMostly what I'm seeing is people are making money off of AI by selling services, educating on AI, right? Like, hey, I can help you automate something or I can help you implement something or I can help you understand something and it's good. It's yeah, yeah, yeah. Like they're consulting services essentially on educating you on how to use AI and those are great services, but like actually having AI in your business, there are only a few examples. One of them was answering calls after hours and logging them into the CRM. I thought that was great because you can't always have people on call.\r\n\r\n\r\nChris Koerner (30:27.024)\r\nMm hmm. Time saving services.\r\n\r\n\r\nNikolas Hulewsky (30:47.534)\r\nOne idea that I really like is this crush the memory stick that Eric Kaiser has. He's going come on the podcast and talk about that. by and large, the main use cases right now for AI are time savings and some automation, right? Anyways, we're largely thinking out of from the business owners perspective because we are business owners. But I started thinking about it from the consumer's perspective and I don't have an answer, but I wanted to brainstorm with you on this.\r\n\r\n\r\nHow could you create a business around educating the end consumer, people like you and I? And when I say you and I, I mean just regular people on how to create their own agents so that these agents can become time savings for them, so that they can become an agent that will have a conversation with another agent, right? Like, how do you get them to understand what information is needed to train these agents and these models? How do you get them to understand what they're willing\r\n\r\n\r\nChris Koerner (31:31.242)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (31:41.838)\r\nto assign to an agent versus what they're not willing to assign to an agent. Because like I said, it's going to be kind of a hellscape if all of a sudden just agents could be reaching out to us all day. There's got to be like the defense from the other side that is answering these agent queries.\r\n\r\n\r\nChris Koerner (31:58.024)\r\nlook at this a lot like I think about cybersecurity like in the 80s and 90s. I feel like there's always we're gonna oversimplify it and call the good guys and the bad guys. Okay. Since the dawn of time, there's been a push pull between the good guys and the bad guys. So talk about cybersecurity computers come out, the internet comes out. The bad guys quote, were the party that was the most sophisticated at the time, right? So these early internet companies kept getting hacked because\r\n\r\n\r\nfrankly, randos on the internet that knew more about how to hack, they knew more about it than the companies. And of course, because the founders of the companies, they knew how to build a business, how to market a business, they didn't know how to protect their business against cyber threats, right? But then as more time goes on, then cybersecurity becomes like Dan Pena, it's gonna be a hot thing, right? Cybersecurity becomes more of a hot thing, McAfee comes along, the bad guys start helping the good guys, so to speak, and companies are...\r\n\r\n\r\nor better protected against bad actors around the world. Okay, so that push poll becomes a little more evenly weighted. There will always be hackers, there will always be people defending against hackers, but who's first, right? I look at it the same way. In this sense, the marketers and the business guys are first, we're first, right? So consumers are gonna be getting spammed first from people like me with robocalls and emails and texts until as know, enough months or years down the line when the consumers have enough tools\r\n\r\n\r\nNikolas Hulewsky (33:05.902)\r\nMm-hmm. The hackers.\r\n\r\n\r\nChris Koerner (33:26.036)\r\nto defend themselves against the marketers and the spammers like me and you, right? So I just think we're so early on in this that yeah, for a while it's just gonna be really annoying and I'm also a consumer and it's gonna be annoying for me. So what you're saying I think is there's an opportunity to create defense against the dark arts, right? Defense against all the marketers out there that are gonna use AI to spam them with ads and sales pitches at all times.\r\n\r\n\r\nNikolas Hulewsky (33:52.11)\r\nWell, and the reason I'm talking to you about it in particular is because who are going to be the best people to think up ways to stop this stuff from happening? It's the same people who are going to think up ways to do this stuff, right? Like it's, if you're sitting there and you're like, okay, this is exactly how I'm going and I'm scraping data. This is exactly how I'm going and identifying who a good lead is. You can think of the other side of the equation and think, okay, if I'm getting this information from here, how would I make sure my information is not included on this? So, so in my mind,\r\n\r\n\r\nChris Koerner (34:00.104)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (34:04.35)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (34:19.593)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (34:22.08)\r\nthe supplier and the, I don't even know what the right word is, but you're like the pharmaceutical companies, not pharmaceutical companies. You're selling the disease and you're selling the cure. know I mean? There it is. There it is. Yeah, yeah. So that's more why I'm bringing it up is because if you're already going through the thought process of thinking, how can I automate X, Y, Z things? I think there's also the other side of the equation. was like, how do I stop?\r\n\r\n\r\nChris Koerner (34:36.646)\r\ninvent the disease, sell the cure, yeah.\r\n\r\n\r\nChris Koerner (34:50.302)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (34:52.108)\r\nthose XYZ thing from automating to me. And then in that, is there something?\r\n\r\n\r\nChris Koerner (34:53.373)\r\nMm-hmm. Yeah. How can I detect like a caller that's AI prematurely so they don't waste my time? Right. Because I think those solutions exist for like text and for things that were generated by chat GPT. Chat GPT has their own product for like educators to use to make sure the essays weren't written by chat GPT. And then there's a whole ton of rappers that do the same thing.\r\n\r\n\r\nNikolas Hulewsky (35:03.724)\r\nYeah, exactly.\r\n\r\n\r\nNikolas Hulewsky (35:17.998)\r\nMm.\r\n\r\n\r\nChris Koerner (35:22.216)\r\nI was actually doing research on this before this podcast, but it's still insanely early. And I don't think that these mechanisms exist for voice or for video or for other types of AI generated nonsense out there. on Instagram, there's people copying my ideas that are using, what is it? Hey, Jen, what the video avatar creator using, they're using AI tools to have.\r\n\r\n\r\nNikolas Hulewsky (35:46.578)\r\nI know what you're talking about, but yeah.\r\n\r\n\r\nChris Koerner (35:50.164)\r\nthese AI people talk about business ideas on Instagram and they talk like this and it's robotic and if you look closely at their lips, it doesn't match and you can tell like if you're looking for it, you can tell it's AI but then I go look in the comments and nobody not one comment is like this is lame. This is AI. This is like nobody knows they don't know it's so early and on Instagram when you go to post a real there's a toggle button there that says like AI like tell us that this is AI and who would ever use that right?\r\n\r\n\r\nNikolas Hulewsky (36:09.122)\r\nReally?\r\n\r\n\r\nChris Koerner (36:18.34)\r\nWhy would you toggle that? Why isn't Instagram detecting it? Should they? There was news about a month ago about meta creating AI avatars of people. Did you see that? man, let me talk about that real quick. Because this is really interesting.\r\n\r\n\r\nNikolas Hulewsky (36:27.278)\r\nHmm. No, I didn't.\r\n\r\n\r\nChris Koerner (36:37.834)\r\nOne sec.\r\n\r\n\r\nNikolas Hulewsky (36:40.066)\r\nYeah, while you're looking at it, I think we talked about frameworks with AI last week and I talked about kind of my framework as I'm looking at businesses, but I think there's opportunity to go the opposite way. Like I was talking to somebody about content right now in content, very popular to like quick, get to the point, zip, zap, zoom, camera angles, changes, whatever. But then you can go the opposite way and like, all right, I'm going talk a little slower. It's going to be a little longer video and\r\n\r\n\r\nChris Koerner (37:01.578)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (37:08.078)\r\nyou're essentially, you know, zigging when everyone else is zagging. So there are probably businesses like that where everyone's thinking, oh, AI, AI, AI, I'm going to go the opposite way. And it may not be as big of a market, but it can be a really great business.\r\n\r\n\r\nChris Koerner (37:18.292)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (37:22.696)\r\nYeah. So Metta created these AI avatars, basically influencers. And there's a little, there's a little disclaimer on the profile that's like, I'm AI, but it's hard to see. So this was in a Mashable article. One of them was called Liv and her profile says, proud black queer mama of two and truth teller heart emoji, rainbow emoji, you're realist source for life's up and downs. Let's chat.\r\n\r\n\r\nNikolas Hulewsky (37:25.059)\r\nyou\r\n\r\n\r\nChris Koerner (37:47.986)\r\nAnd then all of the pictures she posts on Instagram are all AI generated. She's not a real person in her face. It's all AI generated and they shut it down after like 48 hours. There was another guy, grandpa Brian, a black retired businessman and Carter, a dating coach. The discovery of these profiles led to an outroar on Twitter, blue sky and meta owned threads. There was 28 AI profiles and it ended up deleting all of them because of the outlash backlash.\r\n\r\n\r\nNikolas Hulewsky (37:55.649)\r\nReally?\r\n\r\n\r\nNikolas Hulewsky (38:18.21)\r\nWere there videos or were these just like Facebook pages?\r\n\r\n\r\nChris Koerner (38:23.018)\r\nThere were Instagram and Facebook pages.\r\n\r\n\r\nNikolas Hulewsky (38:29.038)\r\nCheers, Louise.\r\n\r\n\r\nChris Koerner (38:29.982)\r\nand you can message them, they posted stuff, they would reply to your comments, and it's all fake. So.\r\n\r\n\r\nNikolas Hulewsky (38:38.316)\r\nMaybe that's a part of it is like, there's a package you could help someone, you could sell to somebody to help create their own personal assistant. And you use something like, gosh, what was the software you used that tracked everything across your Mac?\r\n\r\n\r\nChris Koerner (38:56.908)\r\nrewind?\r\n\r\n\r\nNikolas Hulewsky (38:58.156)\r\nrewind and it's like, all right, record your conversations for two weeks and then we will take that data, put it into a system and create your digital assistant. And maybe it's longer than two weeks, I don't know. But then what spits out is a digital agent that works on your behalf. That's your assistant.\r\n\r\n\r\nChris Koerner (39:16.682)\r\nDid you hear about that startup called Borty that raised $8 million with AI? Like they, yeah, they have this networking feature where AI will call you and like ask you questions like, name's Nick, I live in Boise, this is what I do. And it's like, hey, I know just the guy for you and they'll connect you with real people. It's an AI voice agent. And so they use their own product to raise $8 million without ever speaking to an actual investor themselves. Granted.\r\n\r\n\r\nNikolas Hulewsky (39:21.42)\r\nNo. Is that the one you posted about? No.\r\n\r\n\r\nNikolas Hulewsky (39:35.846)\r\ninteresting.\r\n\r\n\r\nNikolas Hulewsky (39:43.545)\r\nmy gosh, really?\r\n\r\n\r\nChris Koerner (39:44.858)\r\nmajor asterisk like I guarantee you they didn't actually sign the docs and accept the wire before it like I'm it was just like yeah we'll invest eight million we raised a million you know it was more of like a verbal thing but still pretty crazy what we're what we're getting to\r\n\r\n\r\nNikolas Hulewsky (39:55.095)\r\nRight, right, right.\r\n\r\n\r\nNikolas Hulewsky (40:00.492)\r\nYeah. Okay. I've been doing this thought exercise that I think would be really interesting. AI is just advancing so fast that by the end of the year, supposedly we're going to have PhD level autonomous agents working on our behalf, supposedly. That's the thought. What I would do if I was anybody, I tried to do this yesterday, I'm trying to do it today as well, is just spend an hour and think, what would I do with somebody?\r\n\r\n\r\nChris Koerner (40:15.87)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (40:29.486)\r\nwho had a PhD level of education that would work autonomously. What would that like, it could be your current business, it could be a business that you want to start, but what would that do? What would that free up and start thinking about how you would actually use them, even mapping out the processes, because you know this, there's only a short window of time for you to take advantage of these arbitrages. Everybody's gonna catch up at some point, but when they first come out, when they're finally available, if that's when you start thinking about how you're gonna use them,\r\n\r\n\r\nChris Koerner (40:38.142)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (40:51.348)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (40:59.116)\r\nwhat tasks you're going to give them, how they're going to communicate back to you, what they're going to do, what the of success are, how you're going to communicate to them, when you check in on them, like all of those things. If that's the first time you're thinking about it, then you're going to be three to six months behind people who are like you and I thinking about it today. And we are going to be able to exploit the opportunities in that short window of time. And it is, it's going to be very, a very short window of time. So I would be thinking about like, okay, what would I do with somebody with a PhD right now?\r\n\r\n\r\nChris Koerner (41:16.243)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (41:28.342)\r\nWhat would you do? How would you use them? Either to start a business or to grow your business or whatever.\r\n\r\n\r\nChris Koerner (41:34.194)\r\nHere's another framework that goes in line with that. I completely agree with that. Go to your, to your chat GPT thread and ask it to tell you what all your, your prompts have been. I just did this. What are all my prompts in this thread? There they are. Okay, cool. I remember now start thinking of how can you productize your prompts? Cause I was just looking at all these AI tools to prepare for this. And you know, my favorite name meme is the format of the astronaut out in space looking at our.\r\n\r\n\r\nNikolas Hulewsky (42:00.861)\r\nyeah, yeah, yeah.\r\n\r\n\r\nChris Koerner (42:00.894)\r\nand another astronaut behind him with a gun pointed his head and it says always has been right. Yes. So there's one that I saw and he was looking at the earth and the earth was like split open and it was cake inside. You like is it cake and the astronaut goes, wait, is it all cake? And he says always has been. Okay. So I'm looking at, I'm looking, I know I'm looking at these thousands of AI tools and they're, all rappers. They're all chat, GPT rappers. And really if you boil it down even more, they're all prompts.\r\n\r\n\r\nNikolas Hulewsky (42:04.163)\r\nAlways has been.\r\n\r\n\r\nNikolas Hulewsky (42:13.358)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (42:16.84)\r\nI don't even get it.\r\n\r\n\r\nChris Koerner (42:30.3)\r\nIt's all prompts productize your prompts. So go ask chat GPT what your prompts have been or go scroll and look at what your prompts have been and then think, how can I convert that prompt to an agent or how can I convert that prompt to an app or to a tool, a product or a service? I was looking at this AI tool and they're download, they're getting thousands of downloads per month. It's an iPhone app. It's called sugar free. And all you do is you take a picture of an ingredient panel.\r\n\r\n\r\nand you upload it and it's like, yeah, this random ingredient here, that's actually sugar. Like it's carbs, but it turns to sugar. Like these things that you've never heard of and you can't pronounce, that sugar, that sugar, that sugar. That's literally one prompt. That's it.\r\n\r\n\r\nNikolas Hulewsky (43:10.798)\r\nHey, I was gonna ask, I was gonna ask you, so I I've been spending a ton of time on prompt base. I thought it was super fascinating. And I've been taking notes of like, hey, what are all the prompts that I'm looking for that are not currently on prompt base? And like, I could make those my own prompts and sell them on prompt base. I think that's one easy way to do that. But these prompts are cheap. They're like between a dollar and $5. Maybe they're $20 if they're like very hyper specific, but whatever, but they're cheap.\r\n\r\n\r\nChris Koerner (43:16.628)\r\nMm-hmm.\r\n\r\n\r\nChris Koerner (43:29.066)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (43:37.934)\r\nHere's what I didn't understand and I wanted to ask you your opinion, because I don't know the answer. And if you don't know the answer, we'll just cut it out. At the end, you go to buy it, it's like, you'll get 50 free credits with this purchase. Why would I need any credits? If they're giving me the prompt, don't I just put that into my own Chad GPT? Or do I have to continually pay for the credit usage? Is it like a razor blade and razors model? Do you know?\r\n\r\n\r\nChris Koerner (43:58.644)\r\nHmm. I don't know. I've never used prompt base. I've never bought anything from it. edit this out mom.\r\n\r\n\r\nNikolas Hulewsky (44:03.958)\r\nOkay, I may have to buy something just to see. Banana.\r\n\r\n\r\nChris Koerner (44:09.38)\r\nno, but it's like, so take your prompt, you can sell it cool, or you can turn it into an app because it's just like chat. GPT can do all of these things that these apps getting millions of downloads are doing. It doesn't matter.\r\n\r\n\r\nNikolas Hulewsky (44:23.18)\r\nYeah. No, it's it's 100 % true. And like, I've started getting way more into GPTs. How many custom GPTs do you have?\r\n\r\n\r\nChris Koerner (44:33.716)\r\nNot a lot, just three or four.\r\n\r\n\r\nNikolas Hulewsky (44:35.566)\r\nthree or four, I'm at like three. And it takes a long time to set them up. And I was talking to Zach today and he was like, actually that's not the best use case for GPTs. I'm like, really? And he starts telling me that, you know, what's actually a better use case for them and how to use them. so I still think there's so many ways that we don't even know the best way to use this stuff. And it's because we can't spend 20 hours a day trying to figure it out.\r\n\r\n\r\nChris Koerner (45:03.454)\r\nMm-hmm.\r\n\r\n\r\nYeah, Zach knows a more than I do about that.\r\n\r\n\r\nNikolas Hulewsky (45:12.632)\r\nHe's doing some cool stuff, Was he?\r\n\r\n\r\nChris Koerner (45:14.462)\r\nHe was at my house on Sunday. Yeah, we had him over for breakfast. They were driving to Atlanta. No, that's right.\r\n\r\n\r\nNikolas Hulewsky (45:20.264)\r\nSweet. Hotlanta.\r\n\r\n\r\nNikolas Hulewsky (45:25.164)\r\nAll right, let's call it. Yeah. Did Zach tell you about?\r\n\r\n\r\nChris Koerner (45:25.194)\r\nAll right, that's it.",
  "metadata": {
    "duration": "",
    "date": "2025-02-14",
    "platform_source": "Google Drive"
  }
}