{
  "episode_number": "198",
  "episode_title": "The Marketer's Playbook: Launching a Full Ad Funnel with AI with Matthew Mellinger",
  "guest_name": "Matthew Mellinger",
  "business_name": "Lawn Care Business in Cookville, Tennessee",
  "transcript": "﻿Nikolas Hulewsky (00:00.552)\r\nI'm freaking great. Matthew, you have an agency, local SEO, SaaS product, analytics, newsletter, Cookville-based newsletter, correct? Okay, and we are going to build something in the next 30 minutes. We are going to build a landing page and add creative with AI in the next 30 minutes to show everybody how they can do the same thing.\r\n\r\n\r\nMatt (00:13.167)\r\nYes. Yep.\r\n\r\n\r\nMatt (00:26.149)\r\nYeah, let's do it. It'll be fun.\r\n\r\n\r\nNikolas Hulewsky (00:27.694)\r\nAll right, so the three things that we're add creative, add images, and the landing page. Basically what we're gonna do is we're gonna take a company and say, hey, we have a summer sale, so let's throw up the landing page and let's figure out how we can get traffic to convert once it goes to that landing page. All right, dude.\r\n\r\n\r\nMatt (00:36.134)\r\nYes.\r\n\r\n\r\nMatt (00:47.631)\r\nYep, and if we want to really go down the rabbit hole, see if we can get a working call to action button, like a Stripe checkout or a, I actually, what I want to do is kind of have a calculator as part of the landing page. So I got some ideas already.\r\n\r\n\r\nNikolas Hulewsky (01:00.686)\r\nOkay, all right, fingers crossed. Let's just remind the people, are you a developer? Is that your background?\r\n\r\n\r\nMatt (01:05.905)\r\nzero like I can work in WordPress we know very little in terms of like developing apps and stuff like that I am just a marketer and an SEO so scrappy I guess I don't know I don't even know if I could consider that I I tinker tinker round\r\n\r\n\r\nNikolas Hulewsky (01:16.216)\r\nHe's a vibe developer now. He's a viper.\r\n\r\n\r\nNikolas Hulewsky (01:24.76)\r\nCool. Okay, so what's the first tool we're gonna use? What are we gonna build first?\r\n\r\n\r\nMatt (01:27.805)\r\nAll right, so let's jump share screen here. So let's start this clock. So I'm still a big fan of Claude. When\r\n\r\n\r\nOne of the cool things that you can even do is create projects. And so if you have a business, would create, I have a document, a Google Doc that I allow it so I can come in here. And for my software company, this is a live document that I can update and it pulls information. This is really helpful if you're working with the same company to use projects. But for today,\r\n\r\n\r\nNikolas Hulewsky (02:00.0)\r\nYeah. So projects are amazing in\r\n\r\n\r\nMatt (02:03.737)\r\nYes, but for today, let's say we're gonna do a lawn care business doing a summer sale and I'll say my hometown Cookville, Tennessee. So I'm gonna actually start by just giving it an overview of kind of what we're doing. So I'm gonna say, hey, I'm creating a landing page and add creative for my lawn care business in Cookville, Tennessee. The...\r\n\r\n\r\nI'm going to need you to help me build ad creatives and prompts for Mid Journey and help me outline the landing page for Loveable.\r\n\r\n\r\nThe big thing, and again, thinking of it as a marketer as well, not just being a dummy, like I'm gonna say like, the big thing I'm pushing is the summer is hot. You'd rather be sipping tea or spending time with your family rather than out in the heat. Again, thinking of it as a user, it's just general marketing principles. So we'll start with this.\r\n\r\n\r\nNikolas Hulewsky (03:13.389)\r\nHmm.\r\n\r\n\r\nNikolas Hulewsky (03:18.414)\r\nOkay, so what you've done in this prompt is you've said, this is the business, lawn care, here are the, or excuse me, this is the business, this is what I wanna do, ad copy and creative. These are the tools I wanna use, lovable and mid-journey, and this is kind of what I'm trying to convey. And now Claude is gonna spit out in those formats that you're hoping to, for the tools that you're hoping to use.\r\n\r\n\r\nMatt (03:34.447)\r\nYes.\r\n\r\n\r\nMatt (03:41.155)\r\nyeah and again it's going to take some some back and forth so it's going start with marking materials so it's going to start with headline variations again yeah I love I love these three already because this is again going the first one while you sip tea will tame your guard\r\n\r\n\r\nNikolas Hulewsky (03:57.122)\r\nWhat does it say? Read them.\r\n\r\n\r\nMatt (03:58.479)\r\nYeah, so number one, I don't like, number two, stay cool this summer. We've got your lawn covered. Again, peace of mind. It's that whole, again, we're looking for emotional, that's with ad copy, specifically Instagram, Facebook. I don't like, we'll tame your yard.\r\n\r\n\r\nNikolas Hulewsky (04:10.178)\r\nWhy was the number one, why didn't you like number one?\r\n\r\n\r\nMatt (04:14.545)\r\nThat's not like, it's making things that your yard's out of, it just doesn't fit with the marketing general emotion that we're going for. But stay cool this summer, which again, goes to the problem, which is heat. We've got your lawn covered, peace of mind. Too hot to mow, again, problem.\r\n\r\n\r\nNikolas Hulewsky (04:23.096)\r\nGot it, okay. Cool.\r\n\r\n\r\nNikolas Hulewsky (04:28.344)\r\nMm-hmm.\r\n\r\n\r\nMatt (04:32.751)\r\nWe thrive in the heat. It's kind of general, but again, with an image creative, that will make sense. And then I really like this one. Family time is better than yard time this summer. Again, that's great. And we can even target in the creative parents, like dads, fathers, because that's who you're going to be really targeting. Or.\r\n\r\n\r\nNikolas Hulewsky (04:39.384)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (04:54.904)\r\nSo that would be the headline on the landing page.\r\n\r\n\r\nMatt (04:57.049)\r\nNo, so this would be the little things in Facebook when you scroll, that would be the little ad creative title. So here's a, and then you can have a little like in the copy.\r\n\r\n\r\nNikolas Hulewsky (05:03.502)\r\nokay, okay. Got it.\r\n\r\n\r\nMatt (05:11.217)\r\nSummers are brutal. Why spend your precious weekends sweating over lawn care when you can be relaxing in your porch with your family, our experienced crew, I would put our licensed experienced crew or whatever handles your heat so you don't have to professional lawn care that keeps your yard pristine while you stay comfortable. Summer Saturday should be for barbecues not battling the blazing sun with a lawnmower. Like these are again, these are the things that that people that's the reason you want to hire a lawn guy.\r\n\r\n\r\nNikolas Hulewsky (05:35.949)\r\nYeah.\r\n\r\n\r\nMatt (05:38.673)\r\nSo let's start with ad creatives Okay So split screen so mid-journey prompts for ad visuals. Let's let's do this a little bit deeper\r\n\r\n\r\nNikolas Hulewsky (05:52.062)\r\nSo it actually spit out the mid-journey prompts and the lovable prompts.\r\n\r\n\r\nMatt (05:54.543)\r\nYeah yeah so it's giving me a couple so let's just while we're here let's paste these in. I'm going to see I think I can paste a couple of these and we'll see.\r\n\r\n\r\nNikolas Hulewsky (06:09.038)\r\nOkay, well you're pasting that in, basically what he's doing is he's going from the output in Claude, which are the mid-journey prompts that Claude recommends, and he's copying those, he's then going over to mid-journey and pasting them into mid-journey to see what it generates. This is a really dumb question. When you say ad copy, that's what is gonna be on Facebook. So there's gonna be that title and then there's gonna be the ad copy and then we want them to click so that they then go to the landing page? Okay.\r\n\r\n\r\nMatt (06:34.787)\r\nYeah let me see so if I pull this up this allows you to search ads so I'm gonna just do lawn care well yeah so you can search any face yeah you can you can look so if you there's a certain brand so let's say Nike right I'm a shoe store I can click here this allows me to see all of Nike's meta ads right here.\r\n\r\n\r\nNikolas Hulewsky (06:44.588)\r\nI'm sorry, come on say what?\r\n\r\n\r\nYou like copying other people's homework?\r\n\r\n\r\nNikolas Hulewsky (07:02.04)\r\nWhat the freak? Are you serious?\r\n\r\n\r\nMatt (07:03.759)\r\nYes, this is free in public. Yeah, you can see everything. And so this is a great way for you to get inspiration for ads. Run through the summer, you can see that they're active when they started running. And again, if you go to the ones that have some of the older ones that have been around more, you will see that they're generally.\r\n\r\n\r\nNikolas Hulewsky (07:06.082)\r\nThis feels like this should be illegal.\r\n\r\n\r\nNikolas Hulewsky (07:14.411)\r\nmy gosh.\r\n\r\n\r\nNikolas Hulewsky (07:26.7)\r\nWhat? So wait, what website is this?\r\n\r\n\r\nMatt (07:29.489)\r\nI just typed in Facebook ad library.\r\n\r\n\r\nNikolas Hulewsky (07:34.654)\r\nmy gosh. Okay, so Facebook ad library, whatever, you clicked on it. It showed each one of the ads. My screen's too small to read it. Is it showing you like how long it's been running or like any data to show how successful it's been?\r\n\r\n\r\nMatt (07:41.19)\r\nYes.\r\n\r\n\r\nYes, start started running on June 23rd and what platforms they're running on and I can click here see add details. And so now this is what the ad is and the reason I was pulling this up was to show you where things are going right? So here's your ad creative. This is your title your ad creative title the call to action button, but then you will have a description here.\r\n\r\n\r\nNikolas Hulewsky (08:11.534)\r\nAnd so the ad copy that we're talking about is the description.\r\n\r\n\r\nMatt (08:14.481)\r\nThe ad copy is this description here that they would read. You can click to expand or whatever. This is the ad image and this is the headline. And then it would be learn more instead of shop now.\r\n\r\n\r\nNikolas Hulewsky (08:25.132)\r\nAnd so then that learn more takes us to the landing page. Okay.\r\n\r\n\r\nMatt (08:27.953)\r\nCorrect, that's what we're gonna try and set up in the next 23 minutes. So these obviously, this top row is not what we're looking for. Yes, it's random dudes, has nothing to do really, like it's showing up before and after a lawn, which, it's funny, you could almost like, like this image where it's a family, a guy sitting on a lawnmower, like.\r\n\r\n\r\nNikolas Hulewsky (08:37.518)\r\nWhy? Tell us why. So the top row is a bunch of random looking people.\r\n\r\n\r\nNikolas Hulewsky (08:44.558)\r\nIt looks fantastic.\r\n\r\n\r\nMatt (08:57.163)\r\nsad or upset and then happy. But it's just it's gonna take too much time. This is more of what I'm looking for because this is the outcome that we're trying to present to our customer. You'd rather be sitting. Yes, right. So this you can see the lawn in the background looks nice. Kid has three legs currently so probably would not want to use that ad or the legs. Yes. The ads have broken so\r\n\r\n\r\nNikolas Hulewsky (09:06.634)\r\nOkay, that's what you want to put in the ad copy. I want the outcome.\r\n\r\n\r\nNikolas Hulewsky (09:14.35)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (09:18.168)\r\nHey, you know, it happens. Is this in Chernobyl? Is that where this is?\r\n\r\n\r\nMatt (09:26.865)\r\nAgain, I would probably spend a little bit more time on making sure that those work, but for all intents and purposes, this one would work. It shows you're having fun out in the lawn, the lawn looks good, sunset, it's hot, it's all the things that we're conveying. So what I'm going to do is I'm going to save this image and I'm going to, yep, download. And then what I'm also going to do is this one is good and so I'm going to...\r\n\r\n\r\nNikolas Hulewsky (09:37.379)\r\nMmm.\r\n\r\n\r\nNikolas Hulewsky (09:42.368)\r\ninteresting. That's...\r\n\r\n\r\nMatt (09:56.643)\r\ncreate more variations subtly.\r\n\r\n\r\nNikolas Hulewsky (10:03.086)\r\nSo for those of you listening, he's still in mid-journey. What we're looking at is a family sitting on a porch, their yard looks fantastic. And you picked this one because you were like, I want them to see the end state, not necessarily these guys looking dour and, oh, my lawn, I don't want to take care of it. was, no, no, no. This is what you want to be doing. You want to be spending time with your family. And now he's like, I like this one enough. I'm going to do a bunch of variations on it to see if it creates anything even better than this first iteration.\r\n\r\n\r\nMatt (10:32.771)\r\nYeah. And so it doesn't look too much better. So the one I copied, I'll be fine with for now. And so now what I want to do is I'm going to go here and let's start working on the landing page because that takes some time.\r\n\r\n\r\nLet's see, hero section, stay cool to summer, handle the heat. Yes, yes, problem solution, services, what we do, local trust. I like it, call to action. Only thing I want to add to lovable is a pricing, to lovable landing page is a pricing calculator that adjusts, say, per square acre.\r\n\r\n\r\nSo they can know the pricing and it's showing a 40 % discount from our normal pricing. So this is going to give me a lovable prompt. I just I like that. So here's the updated outline. Cool. Yep showing this.\r\n\r\n\r\nMatt (11:50.689)\r\nAlright cool, so I'm gonna take this and we'll start here. I'm just gonna copy Copy I'm gonna go over to lovable and I'm just gonna paste that prompt in I'm gonna give\r\n\r\n\r\nNikolas Hulewsky (12:04.908)\r\nNow you didn't say like, make sure this is a lovable specific prompt.\r\n\r\n\r\nMatt (12:09.679)\r\nNo, because lovable does a pretty good job. I'm actually also gonna come up here and I'm going to recopy my original prompt to give lovable some context on top of the outline. So I'm gonna do this, hey, I'm creating a landing page and I'll remove the ad creative. The big thing I'm pushing for is that summer's hot, you'd rather be blah, blah.\r\n\r\n\r\nAnd then here you go, here's your hero section, problem, solution, services, interactive pricing calculator.\r\n\r\n\r\nCool.\r\n\r\n\r\nNikolas Hulewsky (12:45.806)\r\nSo the landing page has all of this stuff. You're building a separate website from the actual website of the company?\r\n\r\n\r\nMatt (12:52.913)\r\nSo this is just an example that this company doesn't exist This could be like again. I could use this as a home page You have the ability up here to publish it directly from lovable\r\n\r\n\r\nNikolas Hulewsky (12:55.142)\r\nokay.\r\n\r\n\r\nMatt (13:04.131)\r\nand you can also add your own domains. So you can do it straight from this because the thing is say you either have a like I would use cal.com to create a calendar link that they could schedule a free consultation for us to come out and make sure the yard is actually how big they say it is or you can just do it straight into a stripe checkout if you want to be a little more risky and frictionless. So while levelable is going I'm going to go back to this\r\n\r\n\r\nadd creative because I feel like that's going to start working. And now we're going to kind of run two things in tandem. We are about 1312 minutes in and already they're making some good progress. So we have that image. And now let's say, okay, I like these three headline variations. Give me 10 more.\r\n\r\n\r\nI'm going to copy this, is those three that we talked about. And the thing with meta ads is that you can give a bunch of different variations and meta will do the job of letting you know which one performs the best. Yes. And so that's a big thing with meta ads is the more you give them, the more opportunity for you to see exactly that that's that's how you win in meta ads is split testing.\r\n\r\n\r\nNikolas Hulewsky (14:04.75)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (14:15.034)\r\nreally?\r\n\r\n\r\nNikolas Hulewsky (14:27.266)\r\nNow the add creative copy options that it spit out for you, did you say in the prompt, this is for meta? Or did it just spit it out?\r\n\r\n\r\nMatt (14:35.119)\r\nNo, let me see. Nope, I just said add creatives. Yep. So I didn't specify meta, but obviously these are gonna be a lot better than like, this wouldn't be what I would use necessarily for like Google ads. So here are 10 headline variations. Beat the heat without lifting a finger. Why sweat?\r\n\r\n\r\nNikolas Hulewsky (14:40.206)\r\nWow.\r\n\r\n\r\nMatt (15:02.405)\r\nWhen we love the summer sun, keep your cool, we handle the scorching work. More porch time, less yard time. Weekends are for family, not lawn care. Spend summer making memories, not mowing. Tennessee, I really like this one. Tennessee heat got you down, we've got you covered. Hate summer yard work, we actually enjoy it. I don't know about that one, but skip the sweat, get the perfect lawn. Let us sweat so you don't have to. So there's, I would say I like those first three a lot.\r\n\r\n\r\nNikolas Hulewsky (15:31.864)\r\nSo you would copy these into Meta and Meta would say like, these are the two that really you should use or does it test them and then give you real-time feedback?\r\n\r\n\r\nMatt (15:38.373)\r\nYes, it tests them and then you get real time feedback on this ad creative with this title is 10 cents a lead, whereas this title is 70 cents a lead. And then you just start killing the bad ones and then you make iterations from there. So that's really how you wanna be doing these ad creatives. And.\r\n\r\n\r\nNikolas Hulewsky (15:50.651)\r\nwow.\r\n\r\n\r\nNikolas Hulewsky (15:57.404)\r\nMatt (16:04.397)\r\nAgain, same thing with descriptions. You can create different descriptions and different images and say, hey, here's 10 images. Which one draws your attention the best? So I like those. Let's see, Beat the Heat. I like this one. More Porched, Weekends Are for Family. Yep, I like both these.\r\n\r\n\r\nNikolas Hulewsky (16:28.568)\r\nSo how many do you choose to split test?\r\n\r\n\r\nMatt (16:31.569)\r\nIt totally depends. The nice thing is it's not hard to just create a lot of split tests. So I normally like split testing one thing at a time, whether it's titles or descriptions. So use the same description and 10 different titles. And then out of the top 10 titles, go to 10, keep the same title, try 10 descriptions. And then from there, try 10 ad copies. And each time it should be improving.\r\n\r\n\r\nNikolas Hulewsky (16:43.79)\r\nAnd once you figure that out, narrow it down.\r\n\r\n\r\nNikolas Hulewsky (16:55.598)\r\nHow fast is the feedback loop?\r\n\r\n\r\nMatt (16:57.905)\r\nit's it's normally based on it depends on your ad spend right? So if if you spend a thousand dollars a day, you're going to get it in very quickly. You're going to have enough data to say, okay, that's good.\r\n\r\n\r\nNikolas Hulewsky (17:08.686)\r\nWell, I was just gonna say, could we test this and then in like 10 minutes from now see which one's performing best or no? No, it's not like that.\r\n\r\n\r\nMatt (17:13.777)\r\nNo, you have to get the ad creative approved, which can take hours. And you have to have a Facebook page that's attached to it. it needs to be done on a, yeah, done on official thing. But if you ever want to run down that during a real company, can talk ad, ad Facebook meta ads on another one.\r\n\r\n\r\nNikolas Hulewsky (17:18.113)\r\nOkay.\r\n\r\n\r\nNikolas Hulewsky (17:21.442)\r\nWomp Womp.\r\n\r\n\r\nNikolas Hulewsky (17:29.39)\r\nTo quote Aladdin, open my mind to a whole new world. So yeah, we're gonna have to do this again. Okay, so you're, I bet. All right, so you're picking all these to try and you're telling Claude which ones you want him to try?\r\n\r\n\r\nMatt (17:39.331)\r\nYeah, because that's a whole different beast and that's a lot of fun.\r\n\r\n\r\nMatt (17:50.627)\r\nYeah, so I said these are the winners. And actually, I keep these two as well. I'm gonna say now write a meta adds description that I can use. Along with these variation these title variations. So now it's gonna write the description. And so.\r\n\r\n\r\nThe first thing I would start is we have 12345677 titles and again you can. So let's see these are not add descriptions. Yeah these are all fine. So these are different going back to this this is where.\r\n\r\n\r\nyou see that the Nike says get the gear that goes hard on and off the field. That is their whole description right there. There are some descriptions that are a lot longer and let me see if I can find just a lawn care company.\r\n\r\n\r\nNikolas Hulewsky (18:49.902)\r\nNikolas Hulewsky (18:55.974)\r\nYou know what's really interesting is this reminds me a lot of what I do for YouTube videos. People are gonna like start snoozing as I start talking about this, but whatever. When I do these and I record them and then I post them on YouTube, I have to make sure that the title is really good, right? And I have a prompt that I put into Chat TVT where I'm like, give me a title about this conversation that if a reader saw this out of context would get them to click and...\r\n\r\n\r\nIs 60 characters or less. So it's like I give it the parameters, but there's kind of a algorithm to it or equation to it if you will and that's what you're doing is like you're going and looking at other ads that have been successful which is what I do when I go and see other thumbnails and titles that have been successful on YouTube and you're like, oh, how did they phrase it? How long was this? Oh, that's interesting the way that they framed this and then you're going back to Claude to then refine what you're working on. It's like it's pretty cool to see the way you're using those tools. I wonder is there a way for you\r\n\r\n\r\nto make that a Gentic where it's like, okay, now go to this website, look at comparable ad copy and make this better.\r\n\r\n\r\nMatt (19:57.679)\r\nYes, so anything you do manually, I've come to the realization is you can pretty much make a Gentic with, I mean, whichever one you prefer, but yeah.\r\n\r\n\r\nNikolas Hulewsky (20:03.703)\r\nYeah.\r\n\r\n\r\nMatt (20:09.873)\r\nit's just then building it out and then rinsing and repeating. I still do things a lot manually like we're doing here. So I went to this ad library with this and I don't know if these guys are the best but it's showing that some of the things that they do and almost all of them is over 50 years of proven results locally owned and operated 100 % satisfaction guarantee. So I'm gonna say use a description close to this.\r\n\r\n\r\nAnd while we're going back to lovable, I kind of give that that prompt and it says I love this concept It started to make the landing page, but then it said that there was a an issue It's saying integrate a calculator in contact form Let's see here I need to fix the impact error So it's fixing it. Let's see if we can\r\n\r\n\r\nsee it yet looks like it's still blank there we go well that image is pretty bad yes and here's your custom quote yep yeah and I and like so now we can take go back to lovable or even better yet what I would do is have a real photo of you because again people are gonna call you're gonna show up\r\n\r\n\r\nNikolas Hulewsky (21:08.418)\r\nWhat the freak?\r\n\r\n\r\nbad image but holy crap it's a website my gosh it's like a fully built website\r\n\r\n\r\nMatt (21:32.439)\r\nAnd so like taking a real image, let me see if I can actually.\r\n\r\n\r\nNikolas Hulewsky (21:37.528)\r\nDude, while you're looking for that, I'm gonna have to like, I feel like a Neanderthal who just saw fire for the first time. That hot fire make things good. You've got mid journey running, which is the visual. You've got Claude running, which is helping you strategize everything. You've got lovable running, which is going to be the landing page. And then you are also using Claude to optimize the ad copy.\r\n\r\n\r\nMatt (21:45.925)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (22:05.17)\r\nfor Facebook, because you're gonna be running Facebook ads to this landing page. This is really cool, it's like soup to nuts. Like, okay, I want to increase sales for my lawn care business this summer. How do I do that? Okay, well I'm gonna go acquire customers on Facebook, yep, check. Well in order to do that I've gotta have the ad copy and the way that it looks, yep, and I have the landing page, yep, and I gotta have a custom quote, and I gotta have a way for people to pay. Dude.\r\n\r\n\r\nMatt (22:08.975)\r\nYes. Yes.\r\n\r\n\r\nMatt (22:29.872)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (22:30.71)\r\nI know everyone listening is like, yeah, Nick, that's what we've been talking about for the last 20 minutes, but it's pretty freaking incredible to watch it happen in real time.\r\n\r\n\r\nMatt (22:39.057)\r\nYeah, and so I just downloaded an image that I'm gonna see if I can add, add this image as hero section image. And then I'm come down here and I'm going to see if I can drag this down here. Let's see where we're going. Okay, did it go down there? I think it's here. All right, so I'm uploading this image.\r\n\r\n\r\nNikolas Hulewsky (23:08.344)\r\nWas that an image you already had or was that from Mid Journey? Okay.\r\n\r\n\r\nMatt (23:09.841)\r\nYes, this is a this is a real image. So I said add this image as the hero section image. Which cat you go ahead.\r\n\r\n\r\nNikolas Hulewsky (23:19.726)\r\nAnd is that this? So you have this like, stay cool this summer, we handle the heat and there's a picture of a, I don't know, crappy yard next to it. Is that the hero image?\r\n\r\n\r\nMatt (23:29.233)\r\nSo now I uploaded this this is a just a local company that I had an image of and so like\r\n\r\n\r\nNikolas Hulewsky (23:35.566)\r\nI just meant, sorry, sorry, like globally speaking, when you say hero image, that, that's the image you want right there at the front of the landing page? Okay.\r\n\r\n\r\nMatt (23:39.568)\r\nYes.\r\n\r\n\r\nMatt (23:43.153)\r\nYes, yeah, the hero section as a whole is this top banner what we call above the fold. First thing that they land and see they want to see something that so you see that it just popped it in right there. So now if I were to minimize this. So now what I'm gonna do Tennessee summer reality check would be fun is adding a live\r\n\r\n\r\nNikolas Hulewsky (23:56.108)\r\nYep.\r\n\r\n\r\nMatt (24:08.625)\r\nLike I'm talking fun. Can we add a live? Heat Temperature What would what would be the right term? Yeah thermostat tracker to the hero section with forecast highlighting how hot\r\n\r\n\r\nNikolas Hulewsky (24:22.879)\r\nthermostat tracker forecast.\r\n\r\n\r\nMatt (24:34.897)\r\nIt is let's see if we can do this. We're kind of pushing the boundaries. So yes, stay cool this summer. We handle the heat I would rather have a picture of a guy Mowing the lawn right here again your your own thing Calculate my savings below or you just call right here. I love the call to action. You can change obviously this so it's a Professional lawn care and cookville so you can enjoy what matters most whether that's sipping tea on the porch or making memories with the family Like I love it. That's exactly what I'm looking for\r\n\r\n\r\nSummer Reality Check.\r\n\r\n\r\nNikolas Hulewsky (25:04.973)\r\nDude, and we saw the prompt. It's not like the prompt was overly intensive. Like it just generated this.\r\n\r\n\r\nMatt (25:09.325)\r\nyeah.\r\n\r\n\r\nYes, professional service that thrives in the heat, trained professionals, weather exports. I would probably change this with a different one because weather experts don't really matter to them. But complete lawn care, this is the different things that we can do. I would add pricing, customized service plans. And then this is cool. whoa, okay, so we have one acre.\r\n\r\n\r\nNikolas Hulewsky (25:35.63)\r\nWatch this.\r\n\r\n\r\nMatt (25:37.265)\r\nSo this is a live calculator that shows you the savings. So it's 166 bucks, your summer price is 100 bucks, you save 66 bucks.\r\n\r\n\r\nNikolas Hulewsky (25:39.331)\r\nthe calculator.\r\n\r\n\r\nNikolas Hulewsky (25:51.074)\r\nDid you put pricing information in here or is this like just, okay, okay.\r\n\r\n\r\nMatt (25:53.377)\r\nYes, I said I said something like, I said, yeah, regular price is this your summer price is this this is what you save. Okay, and it's already added the pricing heat here. I love this. It's like very hot. So let's make make heat calc make heat thermostat a daily.\r\n\r\n\r\nNikolas Hulewsky (26:09.709)\r\nNo frickin' way.\r\n\r\n\r\nNikolas Hulewsky (26:13.624)\r\nDude, that's amazing.\r\n\r\n\r\nMatt (26:22.769)\r\nand make it a long banner at the top, not on the right.\r\n\r\n\r\nNikolas Hulewsky (26:32.28)\r\nNow how do you know if it's accurate? Like how do you know if it's like actually that temperature?\r\n\r\n\r\nMatt (26:36.913)\r\nI so that would be like something I would investigate of to see what it actually is if it is accurate because I don't think\r\n\r\n\r\nNikolas Hulewsky (26:43.766)\r\nOkay. So there's nowhere in the lovable code that it's like, I'm pulling from this website. I'm pulling the\r\n\r\n\r\nMatt (26:50.577)\r\nYes, there actually is. So if we hit the code mode right here, we will be able to see where it's pulling from and how it's pulling these elements. This is again for someone that knows, which you could pull this into Claude and say, hey, where's this pulling from if you don't know. But for the sake of speed, we're going to pretend that it is perfectly accurate, which it's probably not to be honest, but\r\n\r\n\r\nNikolas Hulewsky (26:55.137)\r\nCode mode!\r\n\r\n\r\nNikolas Hulewsky (27:07.758)\r\nMm-hmm.\r\n\r\n\r\nNikolas Hulewsky (27:13.548)\r\nYeah, it works. Yeah, yeah, yeah.\r\n\r\n\r\nMatt (27:19.569)\r\nBut the calculator works and so you can say how big is your acreage? I'm gonna say three acres and see how the price is now live and it locks in this rate. So your summer savings are gonna be 4,000 bucks. Let's see, there you go, boom. There's your banner at the top with the heat temperature which is too hot, like it already does the too hot for your hard work. Stay cool this summer, let us handle the heat.\r\n\r\n\r\nNikolas Hulewsky (27:20.48)\r\nHahaha\r\n\r\n\r\nNikolas Hulewsky (27:46.862)\r\nThat's amazing.\r\n\r\n\r\nMatt (27:48.495)\r\nLike this is a real, and then, yeah. So right off the bat, it's flaring the heat, it's red. Like I didn't have to tell it to be red. It's showing that it's hot. Showing the experience I would have, like attach, I would link to Google Business Profile and say make sure this is embedded in here, our Google reviews. So we have three minutes left. And I'm gonna go ahead and call this a wrap for now. So what we would do from here is,\r\n\r\n\r\nHere are our seven ad copy titles that we would test. Here's my description right here, which is, Cookville homeowners are ditching a summer sweat for professional lawn care that actually loves the heat. Transferring your yard work while you relax in the AC with our proven local service. Probably serving Cookville 100 % satisfaction guarantee 40 % off summer special. Calculate your savings with a free quote today.\r\n\r\n\r\nboth maintain the proven structure. Yeah, so that's the end of it. So I like that. There's your description. And then our image, which I'll open up here.\r\n\r\n\r\nThis would be the ad creative. Again, I would probably spend a little bit more time, but this will work for all intents and purposes. Here's your nice lawn care with the heat. You have your description, you have your ad creatives. I would then go into your meta and create your different ad variations like this. And\r\n\r\n\r\nNikolas Hulewsky (29:01.166)\r\nOkay.\r\n\r\n\r\nMatt (29:20.387)\r\nAgain, test that for a week, make sure you get enough impressions. There are a lot of good resources on how to do made-of-ads really well, especially with that. And then I would send them to this landing page. if I, I'll hit open it preview in a new tab, and here's your page. If you wanna publish it, you can come right in here. You hit publish, you can add your custom domain.\r\n\r\n\r\nclick right there you do your DNS you hit publish and you have a website and again you would want to test these things so when I click when I click calculate my savings it takes me to my calculator here I would probably make this a drop down not just I can't do because I could do three point one one one one one which is kind of cool like but it's cool that you can come in and say like\r\n\r\n\r\nNikolas Hulewsky (29:52.858)\r\nmy gosh.\r\n\r\n\r\nMatt (30:11.545)\r\nYou can choose your own pricing, probably serving Cookville and surrounding areas, what our neighbors say. You'll want to come in and make sure it's actually accurate. And then you would talk to Lovable and say, what happens when I get this quote? So, I mean, you're, you basically in, I would say probably another 30 minutes of setting up meta ads and setting up domain and everything, probably another hour.\r\n\r\n\r\nyou would have a fully functional ad funnel for a summer special for this campaign and it's good.\r\n\r\n\r\nNikolas Hulewsky (30:47.17)\r\ndoing not just not just that like, okay, yeah, if you have an existing business, cool, you've got a fully functional landing page and ad funnel campaign. But what if I just wanted to test a business? What if I was like, I wonder how many people are interested in this in my market, right? Like I'm starting a pickleball club at my tennis court in my backyard. I wonder if anybody's going to join like Chris did this recently, you know, on his podcast and like you could easily do that easily tested go to go to Facebook, set up the\r\n\r\n\r\nMatt (31:10.275)\r\nYes.\r\n\r\n\r\nNikolas Hulewsky (31:15.894)\r\nset up the ad copy and the description, put a thousand bucks behind it and just see, direct people to a website and you just see how it, dude that is freak, that's insane man.\r\n\r\n\r\nMatt (31:20.155)\r\nYep.\r\n\r\n\r\nMatt (31:24.197)\r\nWaiting list. Get them signed up on a waiting list.\r\n\r\n\r\nYeah, and that's all in an hour and a half. Like we spent maybe 30 minutes and there's my timer.\r\n\r\n\r\nSo yeah, 30 minutes and like this is way more than enough. Like I've seen landing pages out of ClickFunnels back in the day and even today, some people use like atrocious landing pages, it still work. But like I land on this landing page, I would probably have a couple critiques that again, I would touch up a little bit, but like I would have no issues with this, testing this to see can we get people to purchase lawn care.\r\n\r\n\r\nNikolas Hulewsky (32:02.401)\r\nOkay, so where you have the calculator and the contact form, where do those leads go?\r\n\r\n\r\nMatt (32:10.577)\r\nSo you would want to set it up to a CRM. could say, hey, I have a HubSpot or again, yep, yep.\r\n\r\n\r\nNikolas Hulewsky (32:13.069)\r\nOkay.\r\n\r\n\r\nOr you could just set to a Google Sheet, right? It's just like, oh, put everything into a Google Sheet.\r\n\r\n\r\nMatt (32:19.299)\r\nAirTable, whatever you want to do. There's a lot of different ways you could do that. You can connect it to, you just talk to Loveable and say, hey, you can actually probably even look at connecting like a, just a email submission that I just send you an email or finding a forms builder that would work with it. Again, I would just talk to Claude and Loveable and say, hey, I want to solve this problem and it will work you through how to solve it.\r\n\r\n\r\nNikolas Hulewsky (32:44.68)\r\nIt's crazy, it's like two hours and a thousand dollars you could launch a business.\r\n\r\n\r\nMatt (32:50.489)\r\nor test and again right yeah so let's say the business fails get no clicks nothing nothing then it's like okay great\r\n\r\n\r\nNikolas Hulewsky (32:52.248)\r\ntest is probably the better word.\r\n\r\n\r\nMatt (33:01.251)\r\nno real interest. had a lot of eyeballs and you could also see where in the funnel things are happening. like say your ad creative did really well and then when they landed the landing page, nothing was happening. Then I would ask two questions. One, does the form work properly? I would test it myself. Okay, the ad form works. So if we had this many people land and no one signed up, then either.\r\n\r\n\r\nNikolas Hulewsky (33:14.562)\r\nYeah, yeah.\r\n\r\n\r\nMatt (33:24.681)\r\nsomething looks sketchy. So maybe you need to put an about us or like some aspect of like this isn't a scam. Depends on what you're looking for. If you're asking for a credit card, like it's going to be tough if you have no business information. But if you're asking for an email for a waiting list, that's not much commitment.\r\n\r\n\r\nNikolas Hulewsky (33:37.72)\r\nWe'll do the...\r\n\r\n\r\nNikolas Hulewsky (33:41.932)\r\nWhat's interesting is like, you're just getting data instead of like doing all the whatever spreadsheet testing and like, well, theoretically if I get X, then Y will happen. No, you're just getting data. It's like, okay, if my ad copy got no clicks, either I sucked or my offering sucks, right? And you can go back, you can tinker with it, I guess, just to see like, okay, was it the picture? Was it the description, whatever? But it's probably your offering. Cool, now I know. If you do get clicks,\r\n\r\n\r\nand then people go to your website like you were saying, but there's no conversion. well I'm not, or no leads. shoot, well something's happening where I'm not able to convert people to leads. And then if they are going to your website and you are getting leads, but you're getting no qualified leads or conversion, there's just every step of the process that gives you more information that you can start sort of narrowing in on what the problem is. But it just gives you data to start acting. Like that's incredible. It's just incredible, mind blowing.\r\n\r\n\r\nMatt (34:35.823)\r\nYeah, I'm actually curious to see. Okay, so one other thing that I'll see if I can play with as well is that when I look this up, I'll share my screen again for those. I'm also at heart an SEO guy and nerd. And so I went on the preview here and.\r\n\r\n\r\nlike the H structure, the title tags and the H tags are fine, but like stay cool this summer, we handle the heat. I would come in here and say like, make sure that my business name is in the title tag, the H1, and I would talk to it to make sure that like, stay cool this summer, professional lawn care in Cookville.\r\n\r\n\r\nyou can see some of these other things. I would go back and make sure that like this also works because again, I also want to generate while you're sending Facebook traffic to it. I want it to be indexed and I want people to search.\r\n\r\n\r\nsummer specials for lawn care in Cookeville and for it to pop up which takes a lot more than just a page. You'd backlinks and business and entities and a bunch of other things but I think that's a I'm surprised actually how well this did looking at\r\n\r\n\r\nthe SEO portion just out the gate without any prompting. I think there was a couple things that you could add, but like, I'm almost wondering if if there would be like, it complete lawn care. Let me see. Does it have Yeah, complete lawn care services at h2. Probably serving cookville surrounding me like ready to Yeah. Yeah, I mean, I would. This is pretty good out the box. It's a lot of fun. Yeah.\r\n\r\n\r\nNikolas Hulewsky (35:58.466)\r\nYeah.\r\n\r\n\r\nNikolas Hulewsky (36:16.632)\r\nThis This is amazing. This is amazing. Matt, alright, dude, we'll call it there. That was freaking rad. Where can people come find you?\r\n\r\n\r\nMatt (36:27.306)\r\nLinkedIn, Matthew Mellinger on Twitter. I don't know what the, I think it's like Matt Mellie. Is the Twitter handle on me? Yeah, yeah, Matt Mellie. Yep.\r\n\r\n\r\nNikolas Hulewsky (36:35.362)\r\nWe'll put the link in. Yeah, yeah, yeah. I'll put the link in the description. But cool, man. This was awesome. Thank you.\r\n\r\n\r\nMatt (36:41.425)\r\nPleasure as always.",
  "metadata": {
    "duration": "",
    "date": "2025-07-03",
    "platform_source": "Google Drive"
  }
}